[{"isVegetarian": true, "title": "Tarta de frangipane albaricoque", "url": "www_bbc_co_uk_food_recipes_apricot_frangipane_tart_19845", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_frangipane_tart_19845_16x9.jpg", "ingredients": ["Harina normal 225g / 8oz", "100 g / 3½ oz de mantequilla, en cubos", "50 g / 1 oz de azúcar en polvo", "1 huevo de gallinas camperas", "175g / 6oz de mantequilla", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas", "175gr / 6 oz de almendras molidas", "1 cucharadita de extracto de almendra", "200 g / 7 oz de mermelada de albaricoque", "8 albaricoques maduros, cortados a la mitad y apedreados", "4 cucharadas de mermelada de albaricoque", "Almendras en copos de 15g / ½oz, tostadas"], "serves": "Sirve 8-10", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente el horno a 190 ° C / 170 ° Ventilador / Gas 5. Caliente una bandeja para horno plana y gruesa.", "Para hacer la masa, frote la harina y la mantequilla con los dedos hasta que se asemeje a migas de pan o mida la harina y la mantequilla en un procesador de alimentos y brevemente hasta que se froten. Agregue el azúcar y mezcle, luego agregue el huevo y una cucharada de agua. Procese hasta que la mezcla se mantenga unida (no trabaje demasiado, ya que hará que la masa sea dura). Envuelva en una película adhesiva y déjela enfriar por 20 minutos.", "Extienda la masa en una superficie enharinada y úsela para revestir una lata para flan de 28 cm / 11 pulg. Pinche la base de la masa con un tenedor y luego enfríe la masa durante 10 minutos.", "Cubra la caja de pastelería con papel pergamino y llene con granos de cerámica para hornear o arroz crudo. Coloque en la bandeja de hornear precalentada y hornee a ciegas durante aproximadamente 15 minutos, o hasta que la masa esté colocada y marrón claro. Retire los frijoles y el papel y vuelva al horno durante aproximadamente 10-12 minutos hasta que la base esté cocida.", "Para el relleno, ponga la mantequilla y el azúcar en un procesador de alimentos y pulse hasta que quede cremoso (si usó un procesador de alimentos para la masa, no es necesario que lo lave). Agregue los huevos y mezcle, luego mezcle las almendras molidas y el extracto de almendras.", "Extienda una fina capa de mermelada de albaricoque sobre la base de la masa y espolvoree la mezcla de almendras encima. Hornee durante 30-40 minutos, hasta que se complete el llenado. Sacar del horno y dejar enfriar.", "Para la decoración, cueza suavemente las mitades de albaricoque en agua hasta que estén tiernas. Dejar enfriar un poco.", "Organiza las mitades de albaricoque en círculos sobre la parte superior de la tarta. Caliente la mermelada de albaricoque a fuego lento y pase a través de un colador fino. Cepille la mermelada de albaricoque caliente sobre la parte superior de la fruta para glasear. Dispersión sobre las almendras copos. Sirve la tarta caliente o fría."]}, {"isVegetarian": true, "title": "Mermelada de albaricoque, zanahoria y almendras", "url": "www_bbc_co_uk_food_recipes_apricot_carrot_and_60812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_carrot_and_60812_16x9.jpg", "ingredients": ["100 g / 3½ oz de zanahoria, rallado, pelado", "600g / 1lb 5oz de albaricoques frescos", "Jengibre fresco de 5cm / 2in, pelado, rallado", "400g / 14oz granulado o azúcar en polvo", "1 limón pequeño, solo jugo", "50g / 2oz de almendras picadas"], "serves": "Rinde aproximadamente 600 ml / 20 fl oz (aproximadamente 2 jarras de mermelada)", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la zanahoria rallada en una olla con tapa con aproximadamente 300 ml / ½ pinta de agua, deje que hierva y luego cocine hasta que los hilos de la zanahoria se estén cayendo a pedazos y el agua se haya evaporado en su mayor parte.", "Mientras tanto, reduzca a la mitad los albaricoques, retire las piedras y coloque la carne en la sartén con las zanahorias. Cubra con una tapa y cocine durante cinco minutos, revolviendo ocasionalmente, hasta que la fruta comience a romperse y desmoronarse.", "Agregue el jengibre a la sartén y cocine con la tapa hasta que la mayor parte de la humedad restante se haya evaporado.", "Agregue el azúcar y el jugo de limón, lleve a ebullición y cocine hasta que la mezcla alcance los 105 ° C / 220 ° F en un termómetro de azúcar. Revuelva el atasco mientras se cocina, especialmente alrededor de los bordes, ya que a veces se engancha y quema en la parte inferior.", "Agregue las almendras.", "Deje la mermelada de albaricoque durante unos minutos para que se enfríe; luego, colóquelo en jarras calientes y limpias y selle de inmediato."]}, {"isVegetarian": true, "title": "Bolas de albaricoque, castaña y aduki con verduras asadas y salsa de miso de vino blanco", "url": "www_bbc_co_uk_food_recipes_apricot_chestnut_and_76988", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_chestnut_and_76988_16x9.jpg", "ingredients": ["18-20 coles de Bruselas, recortadas (cualquier brote más grande cortado por la mitad a través de la raíz)", "4 zanahorias grandes, peladas, cortadas, picadas", "2 cebollas rojas picadas", "4 chirivías grandes, peladas, cortadas, picadas", "3-4 tbsp de aceite de coco", "handul hierbas frescas picadas, como el romero o el tomillo", "sal y pimienta negra recién molida", "1 cucharada de aceite de coco, más extra para hilvanar", "2 cucharaditas de comino molido", "1½ cucharadita de cúrcuma molida", "1½ cucharadita de canela molida", "1 cebolla grande, finamente picada", "3 dientes de ajo, aplastados", "400 g de judías aduki de hojalata, escurridas", "50g / 1¾oz de harina de castaña", "60 g / 2¼ oz de albaricoques secos, listos para comer, preferiblemente orgánicos, picados", "puñado de perejil de flatleaf fresco picado", "¼ cucharadita de pimienta de cayena (o 1 cucharadita de chile fresco picado)", "1 cucharadita de sal", "¼ cucharadita de pimienta negra recién molida", "2 pequeñas cebollas blancas, descuartizadas", "250ml / 9fl oz de vino blanco", "1 cucharada de sedimento", "1 cucharada de pasta de miso no pasteurizada, al gusto", "pequeño puñado de hierbas mixtas frescas picadas (opcional)"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel para hornear.", "Mezcle las verduras junto con el aceite de coco en un plato resistente al horno. Sazone con sal y pimienta negro. Espolvorea sobre las hierbas. Asar en el horno durante 18-20 minutos", "Mientras tanto, para las bolas aduki, caliente el aceite de coco en una sartén a fuego medio hasta que se derrita. Agregue el comino, la cúrcuma y la canela y fría por 1-2 minutos, o hasta que esté fragante.", "Agregue la cebolla y fría por 4-5 minutos, o hasta que esté blanda pero no coloreada, revolviendo bien para cubrirla con las especias. Agregue el ajo y los frijoles aduki y continúe freír durante 2-3 minutos, aplastando los frijoles con el dorso de una cuchara de madera para que el exceso de humedad se libere y se evapore.", "Apague el fuego, luego doble suavemente los ingredientes restantes de la bola aduki hasta que estén bien combinados. Condimentar con sal y pimienta.", "Enrolle 1½ cucharada de la mezcla en bolas y coloque las bolas en la bandeja de hornear preparada. Derretir el aceite de coco e hilvanar las bolas de aduki por todas partes. Hornea de 12 a 15 minutos, volteando hasta la mitad de la cocción, hasta que quede crujiente por fuera y calentado. Retire del horno y manténgalo caliente.", "Retire las verduras asadas del horno y revuelva. Continúe asando por otros 25-35 minutos, o hasta que las verduras estén tiernas.", "Mientras tanto, para la salsa de miso, ponga las cebollas en una olla pequeña. Agregue el vino y 250 ml / 9 fl oz de agua y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 20-25 minutos, o hasta que la cebolla se haya ablandado.", "Agregue el tamari, el miso y todas las hierbas. Mezcle hasta que quede suave usando una licuadora de mano. Agregue un poco más de agua si es necesario para aflojar la salsa. Sazone con sal y pimienta, agregando un poco más de miso o tamari si lo desea.", "Para servir, divida las bolas aduki por igual entre 4 platos para servir. Cucharee algunas de las verduras asadas al lado. Sirve la salsa de miso en una jarra para pasar alrededor de la mesa."]}, {"isVegetarian": true, "title": "Biscotti de albaricoque y almendra con limoncello", "url": "www_bbc_co_uk_food_recipes_apricotandalmondbisc_86401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700ml / 1 pinta 5fl oz de alcohol de fruta, 40-80% de prueba, o vodka", "200 g / 7 oz de azúcar en polvo", "8 limones, zumos y jugos no encerados", "Harina normal de 250g / 9oz", "250 g / 9 oz de azúcar en polvo", "1½ cucharadita de polvo de hornear", "3 huevos medianos de granja, ligeramente golpeados", "50g / 2oz de fresas endulzadas secas, picadas", "100 g / 3½ oz de albaricoques secos, picados", "Fechas medjool 50g / 2oz, piedras removidas, picadas", "75 g / 2½ oz de pistachos, conchas eliminadas", "50g / 2oz de almendras blanqueadas enteras", "Avellanas 50g / 2oz, conchas eliminadas", "1 limón, ralladura solamente"], "serves": "Sirve 6-8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para el limoncello, vierta un poco del alcohol en una sartén, agregue el azúcar y caliente suavemente, revolviendo ocasionalmente, hasta que el azúcar se haya disuelto.", "Retire del fuego y agregue el jugo de limón y la ralladura. Agregue el alcohol restante y deje enfriar. Viértalo en una botella limpia, luego colóquelo en la nevera o congelador para enfriarlo bien.", "Para el biscotti, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con papel para hornear.", "Mezcle la harina, el azúcar y el polvo de hornear juntos en un tazón grande. Agregue la mitad de los huevos batidos y mezcle bien, luego agregue la mitad de lo que queda y vuelva a mezclar. Agregue el último cuarto un poco a la vez hasta que la masa tome forma pero no esté demasiado mojada (es posible que no necesite usar todos los huevos). Agregue la fruta, las nueces y la ralladura de limón y mezcle bien.", "Divide la masa en seis pedazos. Con las manos mojadas, enrolle cada pieza en forma de salchicha de unos 5 cm de ancho y colóquelas bien separadas en la bandeja para hornear. Aplanar ligeramente las \\\"salchichas\\\" y hornear durante unos 20 minutos, o hasta que estén doradas. Retirar del horno y dejar enfriar y endurecer durante diez minutos.", "Con un cuchillo de sierra, corte las \\\"salchichas\\\" en un ángulo en rodajas de 0,5 cm / ¼ y colóquelas en la bandeja para hornear. Regrese al horno y hornee durante ocho minutos, luego dé vuelta las rebanadas y cocine por otros 10-15 minutos, o hasta que tengan un color dorado pálido. Retirar del horno y enfriar en bastidores de alambre. Cuando está completamente frío, el biscotti se puede almacenar en frascos herméticos por una semana o más.", "Para servir, vierta el limoncello en un vaso de chupito frío y sirva con el biscotti."]}, {"isVegetarian": true, "title": "Pastel de Navidad de albaricoque y brandy", "url": "www_bbc_co_uk_food_recipes_apricotandbrandychri_77766", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricotandbrandychri_77766_16x9.jpg", "ingredients": ["Albaricoques secos 300 g / 9 oz, picados", "225g / 8oz pasas de Corinto", "255 sultanas 255 g / 8oz", "225 g / 8oz de pasas", "Brandy 90ml / 3½fl oz", "225 g / 8 oz de mantequilla, a temperatura ambiente", "225g / 8oz de azúcar mascabado ligero", "Harina normal 225g / 8oz", "4 huevos grandes de gallinas camperas", "350g / 12oz de cerezas glacé, reducidas a la mitad, enjuagadas y secas", "2 naranjas, ralladura ralladura solamente", "4 cucharadas de mermelada de albaricoque, para glasear"], "serves": "Hace pastel de 20 cm / 8 pulgadas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Remoje los albaricoques picados y los frutos secos, excepto las cerezas en el brandy, en un bol durante la noche, déjelos en la cocina y, a la mañana siguiente, la fruta habrá absorbido el brandy.", "Engrase y forre una lata redonda para pastel de 20 cm / 8 pulgadas de profundidad con una doble capa de papel engrasado o pergamino engrasado. Precaliente el horno a 140C / 275F / Gas 1.", "Ponga la mantequilla y el azúcar juntos en un tazón muy grande, agregue el resto de los ingredientes, incluida la mezcla de fruta seca, y continúe mezclándolo hasta que esté bien mezclado.", "Coloque la mezcla en la lata preparada y extiéndala uniformemente con el dorso de una cuchara. Cubra la parte superior de la torta sin apretar con una doble capa de papel resistente a la grasa.", "Hornee en el horno precalentado durante aproximadamente 3 horas y media o hasta que el pastel tenga un color dorado pálido, se sienta firme al tacto y un pincho insertado en el centro salga limpio. Vigile el pastel y si se está poniendo demasiado marrón, cúbralo ligeramente con papel de aluminio. Deje que la torta se enfríe en la lata, luego apáguela.", "El día antes de servir, caliente la mermelada en una sartén hasta que se derrita y cuele a través de un colador. Cepille todo el pastel con la mermelada de albaricoque tamizada para obtener un acabado brillante."]}, {"isVegetarian": true, "title": "Tarta de brioche de albaricoque", "url": "www_bbc_co_uk_food_recipes_apricotbriochetart_70816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 huevo", "2 cucharadas de azúcar en polvo", "250 g / 9 oz de queso mascarpone", "Rebanadas de brioche de 225 g / 8 oz, 1cm / ½ pulgada de espesor, extraídas de un pan de brioche comprado en la tienda", "2 mitades de albaricoque de 400g / 14oz, drenadas", "4 cucharadas de azúcar demerara", "creme fraiche para servir"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Engrase ligeramente un plato poco profundo a prueba de horno (alrededor de 28cm / 11in de diámetro). Precaliente el horno a 180C / 350F / Gas 4.", "Batir ligeramente el huevo y el azúcar impalpable en un bol.", "Agregue el mascarpone y bata de nuevo hasta que quede suave y no haya grumos.", "Coloque las rebanadas de brioche lo más ordenadamente posible en una sola capa en la placa de tarta engrasada para cubrir completamente la placa.", "Recorte las rebanadas de brioche según sea necesario para caber. Extienda la mezcla de mascarpone sobre las rodajas de brioche a aproximadamente 1 cm / ½ pulgadas del borde. ¡No tienes que ser preciso acerca de esto!", "Coloca las mitades de albaricoque pulcramente en espiral sobre el mascarpone hasta el borde del brioche. Espolvorea el azúcar demerara sobre los albaricoques.", "Hornee en el horno precalentado durante 30-35 minutos hasta que la crema esté dorada.", "Sirva inmediatamente con créme fraiche y espolvoree con azúcar glas."]}, {"isVegetarian": true, "title": "Mousse de albaricoque", "url": "www_bbc_co_uk_food_recipes_apricotmousse_79984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g / 3½oz de mitades de albaricoque en conserva", "50ml / 2fl oz de jugo de albaricoque estañado", "½ limón, solo jugo", "50 ml de jarabe de arce", "200ml / 7fl oz de crema doble, batida", "50g / 1¾oz de yogur griego", "ramita de menta fresca, para adornar"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las mitades de albaricoque y el jugo de albaricoque en un procesador de alimentos y mezcle con un puré.", "Agregue el jugo de limón y el jarabe de arce y mezcle.", "Coloque la crema y el yogur griego en un tazón grande y mezcle.", "Agregue la mezcla de puré de albaricoque a la mezcla de crema y mezcle bien.", "Para servir, vierta la mousse de albaricoque en un vaso de postre y adorne con una ramita de menta."]}, {"isVegetarian": true, "title": "Tarta al revés de albaricoque", "url": "www_bbc_co_uk_food_recipes_apricotupsidedowntar_91748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["235 g / 8½ oz harina natural", "pizca de sal", "170 g / 6 oz de mantequilla sin sal refrigerada, cortada en cubos", "50 g / 2 oz de azúcar en polvo", "1 huevo grande de gallinas camperas, batido con 1 cucharada de agua", "100 g / 3½ oz de azúcar en polvo, más 1 cucharadita de polvo", "50 ml / 2 fl oz de agua", "55 g / 2 oz de mantequilla", "8 albaricoques frescos de tamaño mediano, cortados por la mitad, sin piedras", "crema o helado, para servir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, mezcle la harina y la sal en un procesador de alimentos hasta que se combinen. Agregue los cubitos de mantequilla y el azúcar y mezcle de nuevo hasta que la mezcla se asemeje a finas migas de pan.", "Con el motor en marcha, agregue gradualmente suficiente cantidad de huevo batido y mezcla de agua hasta que la mezcla se una como masa. (NB: Puede que no necesite usar toda la mezcla de huevo y agua).", "Coloque la masa en una superficie de trabajo cubierta con una hoja grande de papel para hornear. Cubra la masa con una segunda hoja de papel para hornear, luego extiéndala hasta que la masa forme un círculo de 25 cm de diámetro. Recorta cualquier exceso para formar un círculo ordenado. Dejar de lado.", "Para el caramelo, caliente el azúcar y el agua en una sartén pequeña y resistente al horno a fuego lento durante 2 o 3 minutos, o hasta que el azúcar se haya disuelto y la mezcla se asemeje al jarabe.", "Aumenta el fuego hasta que la mezcla de jarabe hierva a fuego lento. Cocine a fuego lento durante 4-5 minutos, o hasta que la mezcla de jarabe caramelice. No agite la mezcla en esta etapa: agite la sartén para mover el contenido si es necesario. (PRECAUCIÓN: El azúcar caliente es peligroso. No lo deje sin supervisión).", "Cuando la mezcla de jarabe se haya caramelizado, retire la sartén del fuego y agregue 40 g / 1½ oz de la mantequilla, hasta que la mantequilla se haya derretido y la mezcla esté suave y espesa. Dejar de lado por cinco minutos.", "Coloque los albaricoques, con los lados cortados hacia abajo, en el caramelo caliente en la sartén.", "Cubre suavemente la sartén con el círculo de repostería, metiendo los bordes de la masa ligeramente dentro de la sartén con un cuchillo de hoja redonda. Pinche todo con un tenedor y un punto con la mantequilla restante. Espolvorea sobre la cucharadita de azúcar en polvo.", "Transfiera la sartén al horno y hornee durante 25-30 minutos, o hasta que la masa esté dorada y cocida y los albaricoques y el caramelo estén burbujeando. Retire la sartén del horno y déjela enfriar durante cinco minutos.", "Cuando la tarta se haya enfriado un poco, afloja los bordes de la masa con un cuchillo. Coloque un plato grande para servir sobre la sartén e inviértalo de modo que la tarta quede en la placa. (Nota: Cubra la manija de la bandeja con un paño de cocina antes de manipular, ya que todavía estará caliente).", "Servir las cuñas de la tarta albaricoque al revés, caliente o fría, con crema o helado."]}, {"isVegetarian": true, "title": "Tarta de noche árabe", "url": "www_bbc_co_uk_food_recipes_arabian_night_tart_07930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125 g / 4½ oz de azúcar en polvo", "1 huevo mediano de gallinas camperas", "Harina normal de 250g / 9oz", "125g / 4½oz de mantequilla salada, enfriada y cortada en cubitos", "1 huevo de gallinas camperas, solo blanco", "100 g / 3½ oz de pistachos sin sal, sin cáscara", "30 g / 1 oz de almendras molidas", "100g / 3½oz de mantequilla salada, suavizada", "Azúcar en polvo 80g / 3oz", "2 huevos grandes de gallinas camperas", "20g / ¾oz de miel que moquea", "Azúcar 80 g / 3 oz", "4 huevos grandes de gallinas camperas, solo yemas", "50g / 1¾oz de harina de maíz", "500ml / 18fl oz de leche entera", "20 g / oz de miel", "1 cardamomo debajo", "30g / 1oz de mantequilla sin sal", "175 g / 6 oz de arándanos", "1 granada grande, solo granos", "200g / 7oz de uvas blancas sin semillas, cortadas a la mitad a lo largo del ancho", "1 fruta de dragón rosa, solo carne, en rodajas", "5 cucharadas de mermelada de albaricoque suave", "puñado de pistachos sin sal, sin cáscara y triturados", "almendras copos puñado"], "serves": "Para 6", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la caja de pastelería, agregue un poco de agua helada en un tazón grande. Coloque un recipiente de metal más pequeño en la parte superior y coloque el huevo y el azúcar en el recipiente más pequeño. Batir el huevo y el azúcar juntos hasta que el azúcar se haya disuelto.", "Agregue la harina y combine hasta que la mezcla se asemeje a pan rallado. Agregue los cubos de mantequilla fría, y con un cuchillo de mantequilla, corte en la mezcla harinosa. Cuando la mezcla comience a juntarse, ponte en una superficie de trabajo ligeramente enharinada y amasa rápidamente durante unos segundos. Cubra la masa con film transparente, aplánela en un disco y colóquela en la nevera durante aproximadamente 30 minutos.", "Para el frangipane de pistacho, mezcle los pistachos y las almendras en una pasta en un procesador de alimentos. En un bol batir la mantequilla y el azúcar juntos y luego agregar los huevos y la miel. Continúa batiendo un poco, luego agrega las nueces y mezcla hasta que estén completamente combinadas.", "Para la crème pâtissière, combine el azúcar, las yemas de huevo y la harina de maíz en un tazón. Coloque una cacerola pequeña a fuego alto y deje hervir la leche, la miel y la cápsula de cardamomo. Vierta lentamente la leche hervida en las yemas de huevo, batiendo constantemente. Cuando se combinan, regrese la mezcla a la sartén. A fuego medio, bata la crème pâtissière hasta que esté muy espesa. Retirar del fuego y mezclar con la mantequilla. Cubra con film transparente y enfríe en la nevera.", "Precaliente el horno a 190C / 375F / Gas 5. Coloque una bandeja para hornear en el estante superior para calentar.", "Retire la masa del refrigerador, desenvuélvala y siéntela entre dos pedazos grandes de película adhesiva. Extienda la masa hasta que tenga 2-3 mm / 1/8 pulg. De grosor y colóquela en una tarta de 23 cm / 9 in (la mejor manera es mantener la masa enrollada unida a la película adhesiva de un lado, voltearla, adherir la película hacia arriba, y poner la masa en la lata). Presione hacia abajo en las ranuras de la lata, retire la película adhesiva y deje el excedente colgando sobre los lados. Enfríe la caja de pastelería en el congelador por 15 minutos.", "Corta un pedazo de papel para hornear lo suficientemente grande como para cubrir la caja de tarta. Arrástralo ligeramente, siéntalo en la lata de pastelería y rellena con alubias para hornear. Hornee en el horno durante siete minutos. Retire el papel de hornear y los frijoles y hornee durante otros siete minutos.", "Cepille la base de la caja de repostería con clara de huevo y hornee por unos dos minutos. Dejar de lado hasta que esté completamente frío.", "Extienda el frangipane en la base de la caja de pastelería y cubra los bordes de la masa con papel de aluminio doblado para que no se quemen al cocinar de nuevo. Hornee en el horno por 15-20 minutos, o hasta que el frangipane esté cocido y ligeramente dorado. Retire la lámina y déjela a un lado para que se enfríe.", "Para el relleno, vierta la crème pâtissière y coloque la fruta en la parte superior en círculos concéntricos. Haga un glaseado calentando la mermelada de albaricoque con una cucharada de agua en una olla pequeña. Tamiz para eliminar cualquier bulto. Luego cepilla suavemente el glaseado sobre la fruta. Termine rociándolos sobre los pistachos y las almendras en copos."]}, {"isVegetarian": false, "title": "Arancini con flores de calabacín fritas", "url": "www_bbc_co_uk_food_recipes_arancini_with_deep-fried_05270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal, para freír", "50g / 1¾oz de serrano o jamón de Parma, picado", "4 cucharadas de queso parmesano rallado", "aproximadamente 300g / 10½oz sobrante de risotto cocido refrigerado", "Harina normal de 90g / 3¼ oz", "2 huevos de gallinas camperas, ligeramente golpeados", "75g / 2½ oz de pan rallado fresco", "50g / 1¾oz de harina de maíz", "125ml / 4½fl oz de agua con gas", "8 flores de calabacín", "1 limón, cortado en cuñas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite de una freidora a 190C. Alternativamente, caliente el aceite en una olla profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle el jamón picado y el parmesano en el risotto frío, luego enrolle el risotto en pequeñas bolas, cada una del tamaño de una pelota de golf.", "Espolvoree 40 g / 1½ oz de la harina en un plato. Batir los huevos en un tazón. Espolvoree las migas de pan en un plato aparte. Espolvorea cada bola de risotto en la harina, luego sumérgete en el huevo batido, luego rueda en las migas hasta que esté completamente cubierto.", "Con cuidado, baje el arancini en el aceite caliente en lotes y fría por 2-3 minutos, o hasta que estén dorados y calientes. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Mantener caliente", "Mientras tanto, en un tazón, mezcle la harina de maíz, la harina restante y el agua con gas hasta que estén suaves y bien combinados. Sumerja las flores de calabacín en esta mezcla.", "Freír las flores de calabacín en lotes durante 1-2 minutos, o hasta que la masa esté crujiente y dorada. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Sirva el arancini con las flores de calabacín y las rodajas de limón al lado."]}, {"isVegetarian": false, "title": "Arancini con taleggio", "url": "www_bbc_co_uk_food_recipes_arancini_with_taleggio_15859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml / 18fl oz de caldo de pollo o vegetal", "1½ cucharadas de aceite de coco o aceite de oliva", "1½ cebollas, finamente picadas", "4 dientes de ajo, finamente picados", "Arroz risotto 250 g / 9 oz, preferiblemente Arborio o carnaroli", "200ml / 7fl oz de vino blanco", "puñado de perejil fresco de hoja plana, más o menos picado", "1 manojo de cebollín fresco, finamente picado", "1 manojo de menta fresca, finamente picado", "55 g / 2 oz de queso parmesano, finamente rallado, más extra para servir", "Taleggio de 100 g / 3½ oz, cortado en piezas de 1 cm / ½ pulgadas", "100g / 3½oz de harina de coco o harina natural", "2 huevos de gallinas camperas, golpeados", "125g / 4½oz de pan rallado seco", "aceite de coco o aceite vegetal para freír en grasa", "1 limón, cortado en cuñas"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Llevar el caldo a ebullición en una olla grande y luego mantener a fuego lento a fuego lento.", "Mientras tanto, caliente el aceite en una cacerola a fuego medio a bajo, agregue las cebollas y el ajo y cocínelos hasta que tengan un color suave y translúcido.", "Agregue el arroz a las cebollas y cocine durante 2 minutos, mezcle bien y cubra todo el arroz, luego agregue el vino y cocine a fuego lento hasta que se evapore. Agregue el caldo caliente a la mezcla de arroz un cucharón a la vez, revolviendo continuamente y permitiendo que el arroz absorba el caldo antes de agregar el siguiente cucharón. Continúe repitiendo el proceso hasta que todas las existencias se hayan agotado, la mezcla de arroz debe estar casi cocinada y espesa. Revuelva las hierbas y el parmesano en la mezcla. Extienda el risotto en una bandeja, deje enfriar y luego refrigere hasta que esté completamente frío.", "Para dar forma al arancini, coloca las cucharadas del risotto en bolas, luego coloca un trozo de Taleggio en el centro de cada bola y encierra el queso en el arroz por completo.", "Coloque la harina, el huevo y las migas de pan en 3 cuencos separados. Espolvoree ligeramente cada arancini en la harina, luego sumérjalo en el huevo y revuelva en las migas de pan hasta que esté uniformemente cubierto.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Freír los arancini en lotes por lotes, durante 3 minutos a la vez, girando constantemente, hasta que estén calientes y dorados. Escurrir en un plato forrado con papel de cocina.", "Sirva con queso parmesano rallado y las rodajas de limón y algunas hojas de bebé rociadas con vinagre balsámico."]}, {"isVegetarian": true, "title": "Arancini con tapenade de tomate y aceitunas", "url": "www_bbc_co_uk_food_recipes_arancini_with_tomato_and_49993", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arancini_with_tomato_and_49993_16x9.jpg", "ingredients": ["100g / 3½oz de aceitunas negras deshuesadas", "100g / 3½oz de tomate anaranjado, picado", "2 dientes de ajo", "1 limón, ralladura y jugo", "1 cucharada de perejil fresco picado", "Mayonesa 100 g / 3½ oz", "50g / 2oz de mantequilla sin sal", "Arroz Arborio 450g / 1lb", "salpicar vino blanco", "2 litros / 3½ pintas de caldo de verduras calientes", "100g / 3½oz de tomates secados al sol, picados", "5 cebolletas, finamente picadas", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "harina común, para quitar el polvo", "1 litro / 1¾ pintas de aceite vegetal, para freír"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para tapenade, mezcle todos los ingredientes a excepción de la mayonesa juntos hasta que quede suave. Agregue la mayonesa.", "Para el arancini, derrita la mantequilla en una olla grande de fondo grueso. Agregue el arroz y cocine por 2-3 minutos a fuego lento. Cuando el arroz empiece a ser un poco translúcido alrededor de los bordes, agregue el vino y cocine por un minuto más.", "Agregue un cucharón de caldo tierno y revuelva bien. Cuando el stock haya sido casi absorbido, agregue otro cucharón. Continúe agregando más caldo hasta que se haya agregado todo y el arroz esté cocido.", "Agregue los tomates secados al sol y la cebolla tierna y sazone con sal y pimienta negra recién molida. Dejar de lado para enfriar.", "Batir el huevo en un tazón, espolvorear la harina en un plato.", "Enrolla el arroz en bolitas, luego sumérgete en el huevo batido y draga en la harina.", "Llene a la mitad una cacerola profunda con aceite vegetal y caliéntela a 170 ° C / 325 ° F (verifique con un termómetro digital). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Fríe el arancini a fuego lento durante 3-4 minutos o hasta que se dore. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina.", "Sirve el arancini con la tapenade."]}, {"isVegetarian": false, "title": "Paté ahumado Arbroath con judías verdes y compota de remolacha asada", "url": "www_bbc_co_uk_food_recipes_arbroath_smoked_pat_with_76550", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 abadejo ahumado de Arbroath", "20g / ¾oz pepinillos para bebés, escurridos", "20g / ¾oz de alcaparras, escurridas", "2 cucharaditas de mostaza integral", "150g / 5½oz de mantequilla sin sal, suavizada", "1 cucharada de perejil de hojas planas finamente picado", "1 limón, solo jugo", "pan de nuez, congelado y en rodajas finas", "200g / 7oz de sal", "1 manojo de remolacha, hojas removidas, cortadas en cuartos", "250ml / 9fl oz de vinagre de vino tinto", "125 g / 4½ oz de azúcar en polvo", "1 cucharadita de semillas de comino", "1 cucharadita de cilantro molido", "100g / 3½oz de judías verdes, cortadas en 1cm / ½ pulgada", "100g / 3½oz de tomates cherry en la vid", "250 g / 9 oz de crema fresca", "2 cucharadas de rábano picante a la crema"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el paté ahumado Arbroath, precaliente el horno a 200C / 400F / Gas 6.", "Alinee un molde de terrina con film transparente.", "Coloque el abadejo ahumado, los pepinillos, las alcaparras y la mostaza integral en un procesador de alimentos y mezcle.", "Poco a poco agregue la mantequilla ablandada, mezclándola con cada adición y finalmente agregue el perejil y el jugo de limón.", "Coloque el paté en el molde de terrina y colóquelo en el refrigerador para prepararlo.", "Para la compota, coloque la sal en una bandeja para hornear, coloque la remolacha encima y tueste en el horno durante 40 minutos.", "Una vez cocido y enfriado lo suficiente como para manejarlo, pele y pique la remolacha y reserve.", "Ponga el vinagre de vino tinto, azúcar, semillas de comino, cilantro, judías verdes y remolacha picada en una cacerola grande y cocine durante 30-40 minutos a fuego lento. Coloque la compota a un lado para enfriar.", "Precalentar la parrilla a alto.", "Coloque los tomates cherry en una bandeja para hornear y tápelos en el horno durante cinco minutos o hasta que revienten ligeramente.", "Tueste el pan de nuez por un minuto en cada lado debajo de la parrilla caliente.", "Para la crema de rábano picante, ponga la crème fraîche y el rábano picante en un tazón pequeño y mezcle.", "Para servir, coloque una porción del paté en cada una de las cuatro placas rectangulares con una cucharada de compota al lado. Cubra con un tomate asado. Coloque la crema de rábano picante en una línea en un lado del plato y la tostada al lado de la pasta."]}, {"isVegetarian": false, "title": "Pastel de pescado Arbroath Smokie con salsa de cebollín", "url": "www_bbc_co_uk_food_recipes_arbroath_smokie_88572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Smokies de Arbroath u otro pescado ahumado", "400ml / 14fl oz de leche entera", "450g / 1lb de papas harinosas (como King Edward o Maris Piper), peladas y cortadas en trozos", "2 cucharadas de perejil de flatleaf fresco picado", "1 cucharada de cebolletas frescas picadas", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado panko japonés de 110g / 4oz", "2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla", "1 chalote, finamente picado", "110ml / 4fl oz de vino blanco", "110ml / 4fl oz de caldo de pollo caliente", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra recién molida", "2 limas, jugo y ralladura", "3 cucharadas de cebollines frescos finamente picados", "2 puñados de hojas de mizuna u otras hojas micro de ensalada, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las croquetas de pescado Smoke de Arbroath, coloque los smokies de Arbroath (o pescado ahumado) en una sartén grande y vierta sobre la leche. Llevar la leche a ebullición, luego retire la sartén del fuego.", "Saque los smokies de la leche y déjelos enfriar. Cuando esté lo suficientemente frío para manipularlo, quite la mayor cantidad posible de huesos del pescado, descascarando y reservando la carne sobre la marcha. Dejar de lado.", "Mientras tanto, cocine las papas en una sartén con agua hirviendo con sal durante 15-20 minutos o hasta que estén tiernas. Escurra bien y devuelva las papas a la sartén, luego regrese la sartén al fuego por uno o dos minutos más para secar las papas.", "Aplaste las papas hasta que estén suaves usando un triturador de papas o ricer, luego mézclelas en un bol con perejil, cebollín, yema de huevo y pescado en copos hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Enrolle pequeñas cantidades de la mezcla de pastel de pescado en bolas con las manos, luego aplánelas ligeramente para formar empanadas. Enfríe en la nevera hasta que esté firme para que no se colapsen cuando los fríe.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvoree las migas de pan en otro plato. Separe cada torta de pescado en la harina, luego sumérjala en el huevo y luego enróllela hasta que esté cubierta.", "Caliente el aceite de oliva en una sartén grande a fuego medio. Agregue las croquetas de pescado por 3-4 minutos en cada lado, o hasta que estén crujientes y doradas por ambos lados y completamente calientes.", "Para la salsa, caliente una sartén pequeña hasta que esté caliente, agregue un poco de mantequilla y, cuando se derrita, fría los chalotes durante 1-2 minutos, o hasta que estén blandos.", "Agregue el vino blanco, el caldo de pollo y la crema y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad y se haya espesado.", "Cuele la mezcla a través de un colador fino en una sartén limpia, luego mezcle la mantequilla restante, el jugo de limón y la cáscara. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida las hojas de mizuna entre cuatro platos para servir. Coloque los pasteles de pescado en la parte superior y agregue un poco de salsa sobre cada porción."]}, {"isVegetarian": false, "title": "Tartas de atasco de Arbroath con mermelada de chile", "url": "www_bbc_co_uk_food_recipes_arbroath_smokie_cakes_32036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arbroath_smokie_cakes_32036_16x9.jpg", "ingredients": ["75g / 3oz de azúcar en polvo", "2 chiles rojos, más o menos picados", "3 tomates de ciruela, toscamente picados", "8 hojas de lima", "2 tallos de limoncillo, hojas externas duras retiradas, finamente picadas", "25 g / 1 oz de jengibre fresco picado", "2 dientes de ajo, pelados, dejados enteros", "2 chalotes pequeños, toscamente picados", "4 cucharadas de salsa de pescado tailandés (nam pla)", "40ml / 1½fl oz de aceite de sésamo", "50ml / 2fl oz de salsa de soja oscura", "2 cucharadas de miel clara", "3 limas, jugo y ralladura", "110 g / 4 oz de crema fresca", "Smokie Arbroath 110g / 4oz, desollado, deshuesado y desmenuzado en pequeños trozos", "110g / 4oz de puré de papa", "1 chile rojo, finamente picado", "1 cucharadita de polvo de curry mediano", "sal y pimienta negra recién molida", "1 lima, solo jugo", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado Panko de 90g / 3½ oz", "aceite vegetal, para freír"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la mermelada de chile, caliente el azúcar en una cacerola de base pesada a fuego medio hasta que se derrita y forme un caramelo dorado. (No revuelva y vigílelo para que no se queme).", "Mezcle todos los ingredientes restantes de mermelada de chile, excepto la crème fraîche, en un procesador de alimentos para obtener un puré suave.", "Una vez que el azúcar se haya caramelizado, vierte la mezcla de mermelada de chile picado y revuelve bien. Ponga la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos, o hasta que esté pegajoso y atascado. Retirar del fuego y reservar para enfriar.", "Una vez que la mezcla de mermelada de chile se haya enfriado, agregue la crema fresca hasta que esté bien combinada.", "Para las tortas de pescado, mezcle el smokie de Arbroath, el puré de patata, el chile y el curry en polvo en un bol hasta que estén bien combinados. Sazone con sal y pimienta negra recién molida y jugo de lima, al gusto.", "Forme la mezcla en bolas de 2cm / ¾ pulgadas de diámetro.", "Espolvoree la harina en un plato, bata el huevo en un cuenco y luego coloque las migas de pan en otro plato.", "Draga cada bola en la harina, luego sumérgela en el huevo batido y rueda en la miga de pan hasta que esté completamente cubierta.", "Caliente el aceite en una freidora a 190C / 375F. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje las tortas de pescado en el aceite caliente y fría durante 3-4 minutos, o hasta que estén crujientes y doradas y completamente cocidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Mantenga caliente hasta que sea necesario.", "Ensarte los pasteles en pequeños pinchos y acomódelos en un plato para servir. Coloque la mermelada de chile en un bol y sirva junto con los pasteles."]}, {"isVegetarian": false, "title": "Pastel de smokie de Arbroath con huevos de codorniz tiernos y remolacha", "url": "www_bbc_co_uk_food_recipes_arbroath_smokie_pt_with_67959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Arbroath smokies", "2 limones, solo jugo", "150ml / 5fl oz de crema doble", "25 g / 1 oz de cebollín fresco, finamente picado", "sal marina y pimienta negra recién molida", "50ml / 2fl oz de vinagre de jerez", "50ml / 2fl oz de vinagre de vino tinto", "300ml / 10fl oz de aceite de oliva virgen extra", "hojas mixtas (acelga roja bebé, lengua de cordero, berros, pequeña joya)", "2 huevos de codorniz, pasados ​​por agua y pelados", "300g / 10½oz de remolacha cocida, en rodajas", "hojas frescas de perifollo, para adornar"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Para el paté, quite la carne del pescado, descarte toda la piel y los huesos, y coloque en una licuadora. Agregue el jugo de limón y mezcle rápidamente con la crema a un paté ligeramente grueso. Transfiera el paté de la licuadora a un recipiente, agregue el cebollín y sazone al gusto con sal marina y pimienta negra recién molida. Coloque el paté en una olla, alise la superficie y colóquelo en la nevera.", "Para hacer el aderezo, coloque ambos vinagres en un tazón. Batir en 225ml / 8fl oz del aceite de oliva y luego verificar el sabor en busca de equilibrio de aceite y acidez, agregando más aceite si es necesario.", "Forma el paté en quenelles. Viste las hojas de ensalada con un poco de vinagreta y corta los huevos a la mitad. Coloque la remolacha en círculos superpuestos en un plato, coloque las hojas de ensalada en la parte superior de la remolacha, cubra con el paté y el huevo y adornar con unas hojas de perifollo. Sirva con rebanadas de tostada tibia Melba."]}, {"isVegetarian": false, "title": "Arbroath smokie fishcakes con salsa de tomate", "url": "www_bbc_co_uk_food_recipes_arbroathsmokiefishca_88565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ Arbroath smokie, despellejado, deshuesado y desmenuzado en trozos pequeños", "4 pequeños pasteles de avena, partidos en migas con un rodillo", "1 huevo de gallinas camperas, golpeado", "1 cucharada de cebolletas frescas picadas", "3 cucharadas de harina común", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "100ml / 3½ fl oz crema doble", "1 cucharadita de mostaza integral", "1 tomate maduro, picado", "puñado de hojas de albahaca fresca, rasgada", "1 lima, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las croquetas, mezcle el pescado, las migas de pan de avena, el huevo batido y el cebollino picado en un bol. Dale forma a las hamburguesas con las manos y revuélvelas con harina.", "Caliente el aceite y la mantequilla en una sartén y fría las croquetas de pescado hasta dorarlas por ambos lados, aproximadamente tres minutos por cada lado.", "Para la salsa de mostaza, caliente la crema en una sartén pequeña al punto de ebullición y agregue la mostaza.", "Para la salsa de tomate, mezcle todos los ingredientes, excepto las cebolletas, en un tazón.", "Para servir, haga una cama de la salsa en un plato de servir y coloque las croquetas de pescado encima. Vierta la salsa de crema de mostaza por los lados y adorne con cebolletas frescas picadas."]}, {"isVegetarian": true, "title": "Arctic roll", "url": "www_bbc_co_uk_food_recipes_arcticroll_93744", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arcticroll_93744_16x9.jpg", "ingredients": ["750ml / 1pint 7fl oz de buena calidad helado de vainilla, suavizado", "4 huevos de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz, más extra al polvo", "Harina de auto crianza 110g / 4oz", "150 g / 5 oz de azúcar en polvo", "½ limón, ralladura y jugo", "Fresas 350g / 13oz, descuartizado"], "serves": "Sirve 6-8", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para la esponja, bata el helado hasta que se ablande y luego póngalo en una caña de plástico o metal limpia de 5cmx30cm / 2inx12 in. Coloque en el congelador y congélelo durante 3-4 horas o hasta que se solidifique. Alternativamente, ablande ligeramente y colóquelo en una hoja de pergamino para hornear, luego enrolle y moldee en una salchicha de 5cmx30cm / 2inx12 pulgadas de largo y congele hasta que se solidifique.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5 y forre una lata de rollo suizo de 23 cm x 33 cm / 9 pulg. X 13 mm con papel pergamino para hornear.", "Coloque los huevos y el azúcar en un tazón y bata hasta que quede muy liviano, esponjoso y espeso.", "Tamizar la harina sobre la mezcla y doblar con cuidado.", "Vierta en la lata forrada y alise con una espátula hasta que se distribuya uniformemente.", "Hornee la esponja durante 10-12 minutos, o hasta que esté firme al tacto.", "Coloque una hoja de papel para hornear que sea un poco más grande que la bandeja sobre la superficie de trabajo y espolvoree con un poco de azúcar en polvo.", "Coloque la esponja en el papel pergamino, luego retire el pergamino en la parte inferior de la esponja. Dejar enfriar un poco.", "Para la mermelada de fresa, caliente una sartén hasta que esté caliente, luego agregue el azúcar, la ralladura de limón y el jugo y cocine por 3-4 minutos hasta que el azúcar se haya disuelto y se haya espesado un poco.", "Mientras tanto, coloca las fresas en un procesador de alimentos y pulsa hasta que estén muy cortadas.", "Agregue a la sartén, mezcle bien y cocine el atasco durante 3-5 minutos más hasta que espese. Retirar del fuego y reservar para enfriar.", "Para armar el rollo, extienda la mermelada de fresa sobre la esponja enfriada, dejando un espacio de 2 cm / 1 pulgada alrededor del borde.", "Si la tubería utilizada para colocar el helado es de metal, pase un soplete sobre la tubería para liberar el helado o, si es de plástico, sumérjalo en agua caliente para liberar el helado de la tubería.", "Coloque el cilindro de helado a lo largo del lado largo de la esponja, luego use el papel pergamino debajo, enrolle la esponja para que el helado quede envuelto en una esponja.", "Ruede la esponja del pergamino y corte en rebanadas para servir."]}, {"isVegetarian": true, "title": "Arlettes", "url": "www_bbc_co_uk_food_recipes_arlettes_17164", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arlettes_17164_16x9.jpg", "ingredients": ["60 g / 2¼ oz de harina de pan blanco, más extra para espolvorear", "60g / 2¼ oz de harina común", "1 cucharadita de sal", "40 g / 1½ oz de mantequilla sin sal, derretida", "125g / 4½oz de mantequilla sin sal, a temperatura ambiente", "25 g / 1 oz de harina de pan blanco", "Harina normal de 25g / 1oz", "50g / 1¾oz de azúcar granulada", "2 cucharaditas de canela molida", "azúcar en polvo, para quitar el polvo"], "serves": "Hace 8 galletas", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque las harinas, la sal, la mantequilla y 50 ml / 2 onzas de agua fría en un bol y mezcle suavemente para formar una masa.", "Transfiera la masa a una superficie de trabajo ligeramente enharinada y amase durante 5 minutos hasta que quede suave. Forme la masa en un cuadrado, envuélvala en una película adhesiva y déjela enfriar durante una hora (o congélela durante 20-30 minutos).", "Para la capa de mantequilla, unte la mantequilla y las harinas usando una batidora eléctrica. Empareje la mezcla entre dos hojas de película adhesiva y extiéndala en un rectángulo del mismo ancho que el cuadrado de la masa, pero el doble de largo. Enfriar en la nevera durante 25 minutos.", "Desenvuelve la masa fría y la capa de mantequilla. Coloque la capa de mantequilla fría, con el extremo corto orientado hacia usted sobre una superficie ligeramente enharinada y coloque el cuadrado de masa en el centro de la lámina de mantequilla. Asegúrese de que esté posicionado ordenadamente y cubra casi hasta los bordes. Levante la lámina de mantequilla expuesta en la parte superior y dóblela sobre la masa, luego doble la lámina de mantequilla expuesta desde abajo hacia arriba, de modo que la masa quede completamente encerrada en la lámina de mantequilla.", "Coloque la masa sobre una superficie ligeramente enharinada, extremo corto hacia usted. Estire hacia un rectángulo, manteniendo los bordes lo más parejos posible. Doble el cuarto superior hacia abajo y el cuarto inferior hacia arriba para que se encuentren perfectamente en el centro. Luego dobla la masa por la mitad a lo largo de la línea central. Esto se llama un giro de libro. Envuelva la masa en una película adhesiva y déjela enfriar por 25 minutos.", "Retire la masa del refrigerador y haga girar otro libro. Envuelva la masa en una película adhesiva y déjela enfriar por 25 minutos.", "Para el relleno, mezcle el azúcar granulada y la canela en un bol. Sobre una superficie ligeramente enharinada, extender la masa en un rectángulo como antes y espolvorear sobre el azúcar.", "Haga girar otro libro para incorporar el azúcar, luego despliegue la masa de 1cm / ½ pulgada de grosor, en un rectángulo de 12x20cm / 4½x8 pulgadas. Enrolle la masa desde el extremo corto como un rollo suizo. Envuelva la película adhesiva y déjela enfriar por 25 minutos.", "Precaliente el horno a 200C / 180C Fan / Gas 6. Línea 2 líneas de bandejas para hornear con hojas de silicona o papel de hornear antiadherente.", "Recorte los extremos del rollo y córtelos en rebanadas gruesas de 8 x 1 cm / ½ in. Polvore la superficie de trabajo con abundante azúcar glas y enrolle cada pieza de masa muy finamente, volteándola para cubrir el azúcar y evitar que se pegue. Coloque los bizcochos en las bandejas preparadas y hornee durante 5 minutos. Retire del horno, gire las galletas con cuidado y cocine durante 3-4 minutos o hasta que estén doradas. Transfiera a una rejilla para enfriar."]}, {"isVegetarian": false, "title": "Tortilla de Arnold Bennett con ensalada de rábano y hinojo", "url": "www_bbc_co_uk_food_recipes_arnold_bennett_omelette_71002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml / 10fl oz de leche entera", "100g / 3½ oz de abadejo ahumado, preferentemente Arbroath Smokie abadejo", "100g / 3½oz de salmón ahumado", "1 hoja de laurel", "10 granos de pimienta negra", "40 g / 1½ oz de mantequilla", "4 huevos de gallinas camperas, golpeados", "15g / ½ oz de harina natural", "50g / 1¾oz de queso cheddar maduro, rallado", "sal y pimienta negra recién molida", "½ butterhead lechuga, hojas quitadas y lavadas", "½ cabeza de hinojo, en lonchas finas en una mandolina", "5 rábanos, en rodajas", "20ml / ¾fl oz de aderezo francés", "30g / 1 oz de miel", "2 cucharadas de vinagre balsámico blanco", "50ml / 2fl oz de aceite vegetal", "1 chalote, finamente picado", "½ diente de ajo, en rodajas finas", "1 cucharadita de albahaca fresca picada", "1 cucharadita de hojas de tomillo fresco picado", "1 cucharadita de cebollines picados", "1 cucharadita de perejil fresco picado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la tortilla, vierta la leche en una sartén grande y poco profunda. Agregue el eglefino ahumado, el salmón ahumado, la hoja de laurel y los granos de pimienta. Traiga a fuego lento. Cocine durante cinco minutos, o hasta que el pescado se haya cocinado y desmenuce cuando lo empuje suavemente. Levante el pescado de la sartén y póngalo a un lado para que se enfríe un poco antes de descascarillarlo suavemente, descartando la piel. Cuele la leche en una sartén limpia.", "Caliente una sartén hasta que esté a fuego medio, agregue 1 cucharada de mantequilla y los huevos. Cocine suavemente, revolviendo con un tenedor hasta que se mantengan juntas.", "Agregue la mitad del pescado copos a la parte superior de la tortilla. Salga de la sartén en un plato para servir a prueba de horno y cubra con el resto del pescado.", "Precalentar la parrilla a caliente.", "Limpie la bandeja de tortilla con papel de cocina, regrese al fuego y derrita la mantequilla restante. Agregue la harina y cocine revolviendo bien durante dos minutos. Poco a poco agregue la leche reservada, batiendo todo el tiempo hasta que se forme una salsa suave. Condimentar con sal y pimienta. Vierta la salsa sobre la tortilla y esparza el queso. Coloque debajo de la parrilla durante 3-5 minutos, o hasta que estén dorados y burbujeantes.", "Mientras tanto, para la ensalada, mezcle todos los ingredientes de la ensalada en una ensaladera grande.", "Para el aderezo, combine todos los ingredientes del aderezo en una licuadora hasta que quede suave. Justo antes de servir, vierta un poco del aderezo sobre la ensalada y mezcle. Cualquier aderezo sobrante se puede guardar en el refrigerador por unos días.", "Para servir, coloque la tortilla en el centro de la mesa y coloque la ensalada al lado."]}]