[{"isVegetarian": true, "title": "Toasted cashew and chilli broccoli salad with sesame soy dressing", "url": "www_bbc_co_uk_food_recipes_toastedcashewandchil_89382", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toastedcashewandchil_89382_16x9.jpg", "ingredients": ["100g/3½oz broccoli, cut into florets", "1 red chilli, finely chopped", "55g/2oz cashew nuts, toasted", "2 tbsp soy sauce", "1 tbsp sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of salted water to the boil. Add the broccoli and cook for 5-6 minutes, or until tender. ", "To serve, drain the broccoli and put it into a serving dish. Scatter the red chilli and cashew nuts over the broccoli, then dress it with the soy sauce and sesame oil."]}, {"isVegetarian": true, "title": "Toffee apple cake", "url": "www_bbc_co_uk_food_recipes_toffee_apple_cake_86505", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toffee_apple_cake_86505_16x9.jpg", "ingredients": ["115g/4oz self-raising flour, plus extra for dusting", "115g/4oz self-raising wholemeal flour", "100g/3½oz soft dark brown sugar", "1 tsp baking powder", "2 tsp ground cinnamon", "5 tbsp sunflower oil", "5 tbsp milk", "2 free-range eggs", "2 eating apples, peeled, cored and chopped into 5mm/¼in cubes", "50g/2oz toffee, broken into small pieces"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Butter a 1.2 litres/2 pint heatproof bowl and dust with flour. Preheat the oven to 180C/350F/Gas 4.", "In a bowl, mix the flours, sugar, baking powder and cinnamon together. In a separate bowl or jug, beat together the oil, milk and eggs. Pour this onto the dry ingredients and stir to combine. Fold in the apple and toffee pieces.", "Pour into the prepared dish and bake for 50-60 minutes. Test the cake is cooked through by inserting a skewer into the centre, if it is cooked it will come out clean. ", "Leave in the dish to cool for 10 minutes then turn the cake out. Leave to cool completely and serve."]}, {"isVegetarian": false, "title": "Toasted couscous with sweetcorn, pepper and parsley", "url": "www_bbc_co_uk_food_recipes_toastedcouscouswiths_89409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "200g/7oz couscous", "½ red pepper, seeds removed, chopped ", "2 tbsp canned sweetcorn", "250ml/9fl oz boiling water", "½ fish stock cube", "1 tbsp chopped fresh coriander ", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat, add the couscous grains, and fry for 2-3 minutes. ", "Stir in the red pepper and sweetcorn and fry for a further 2-3 minutes. ", "Add the water, crumble in the stock cube, take the pan off the heat and cover it with a lid. Leave for 5-6 minutes. ", "Once the couscous has absorbed the water, fluff the grains with a fork, then stir the coriander and parsley into the couscous.", "To serve, spoon the couscous onto a serving plate and serve as a side dish."]}, {"isVegetarian": true, "title": "Toffee apple doughnuts", "url": "www_bbc_co_uk_food_recipes_toffee_apple_doughnuts_45012", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp full-fat milk", "1 tsp dried yeast", "1 tbsp caster sugar", "250g/9oz strong white flour", "½ tsp salt", "50g/1¾oz unsalted butter, melted, plus extra for greasing", "1 large free-range egg", "vegetable oil, for deep frying", "3 Granny Smith apples, peeled, cored, chopped", "40g/1½oz caster sugar", "½ tbsp cornflour", "25g/1oz unsalted butter", "¼ tsp ground ginger", "1 tsp ground cinnamon", "100g/3½oz caster sugar", "35g/1¼oz unsalted butter", "50ml/2fl oz double cream", "½ tsp salt", "1 tbsp ground cinnamon", "50g/1¾oz caster sugar"], "serves": "Makes 12 doughnuts", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, warm the milk and put 50ml/1¾fl of it into a small bowl with the yeast and half a teaspoon of sugar. Set aside for 15 minutes to allow the yeast to reconstitute. ", "Mix the flour, salt and two tablespoons of sugar in a freestanding mixer with a dough hook attachment. Add the yeast mixture, the remaining warmed milk, 100ml/3½oz water, the butter and eggs. ", "Mix with a dough hook for 10 minutes, or until the dough is smooth and elastic. Then cover and set aside to prove for 45 minutes. ", "Meanwhile make the apple filling. Put all the filling ingredients in a saucepan set over a medium heat. Add four tablespoons water and cook until the apples are mushy. Set aside to cool.", "For the salted caramel, melt the sugar in a pan until it reaches a deep-brown colour. Then remove it from the heat and immediately whisk in the butter. ", "Add the cream slowly, whisking until combined. Mix in the salt and then pour the caramel into a bowl and set aside.", "For the dough, briefly knead the risen dough on a floured work surface to knock it back. ", "Divide the dough into 12 equally-sized balls then roll into neat spheres. ", "Grease a large baking tray with a little butter. Place the dough balls on the tray, cover with a floured tea towel and leave to rise until doubled in size (about an hour). ", "To cook the doughnuts, preheat a deep-fat fryer to 190C/375F, or alternatively heat the oil in a large heavy-based pan until a piece of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the dough balls in batches (do not crowd the pan), turning occasionally to ensure they are an even colour. Cook for around 3–5 minutes, or until golden-brown. ", "Once cooked, carefully remove the cooked doughnuts using a slotted spoon. Drain on kitchen roll and, when dry, set aside to cool on a wire rack. ", "To assemble the doughnuts, mix the cinnamon and caster sugar together in a bowl.", "Blend the apple filling in a food processor, or using a hand-held blender, until you have a smooth purée.", "Fill a large piping bag with the apple purée. Alternatively spoon the purée into a piping syringe with an injector nozzle attached.", "When the doughnuts are completely cool, use a small, sharp knife to make a cut into the side of each doughnut, reaching to the centre. Pipe, or syringe, the apple purée generously inside.", "Dip one half of the filled doughnuts in the cinnamon sugar. Dip the other side into the cooled salted caramel. If the caramel is too hard, heat it very gently to loosen, but do not allow it to get so hot that it can’t be handled safely. ", "Set the doughnuts aside to allow the caramel to settle before serving."]}, {"isVegetarian": true, "title": "Toffee apple cake with vanilla custard", "url": "www_bbc_co_uk_food_recipes_toffee_apple_cake_with_99093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz apples, peeled", "1 tsp bicarbonate of soda", "200g/7oz butter", "180g/6oz dark brown sugar", "2 free-range eggs", "200g/7oz plain flour", "1 tsp baking powder", "250ml/9fl oz double cream ", "250ml/9fl oz milk", "6 free-range eggs", "100g/3½oz caster sugar", "1 vanilla pod, seeds only", "65g/2½oz dark brown sugar", "65g/2½oz butter, cut into cubes", "4 tbsp double cream", "80g/2¾oz dark brown sugar", "80g/2¾oz butter", "150g/5½oz plain flour", "100ml/3½oz double cream", "1 tsp icing sugar, plus extra for dusting", "½ vanilla pod, seeds only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2 and line a square 30x30cm/12in cake tin with parchment paper.", "For the apple cake, place the apples in a pan with 300ml/½ pint water and boil for 1-2 minutes. ", "Remove from the heat, add the bicarbonate of soda to the apples and blend with a hand-blender. Set aside.", "In a large bowl, cream the butter and sugar together until light and fluffy. Add the eggs and beat to combine.", "Pour half of the apple mixture into the bowl with the butter and eggs (set aside the remaining apple purée to serve).", "Fold in the flour and baking powder until completely combined.", "Pour the mixture into the prepared cake tin and bake for 45 minutes-1hour, or until the cake is golden-brown and a wooden skewer inserted into the centre comes out clean.", "For the custard, whisk together the cream, milk, eggs, sugar and vanilla seeds in a heatproof bowl. Suspend the bowl over a pan of simmering water and heat through to thicken, whisking constantly.", "For the toffee sauce, add the sugar and butter to a large pan and gently heat until melted. Add the double cream and warm through, then remove from the heat and set aside until ready to serve.", "For the crumble topping, increase the oven temperature to 180C/350F/Gas 4.", "Using your hands, rub together all of the ingredients to make a rough breadcrumb texture. Sprinkle the topping onto a baking tray and bake until golden-brown.", "For the Chantilly cream, whip the cream in a large bowl with the icing sugar and vanilla seeds until soft peaks form when the whisk is removed from the bowl.", "To serve, spoon some apple purée onto each of four serving plates and drag using the back of a spoon to create a smear effect. Top with a slice of apple cake. Drizzle with the toffee sauce and spoon the custard on top. ", "Place a neat spoonful of the Chantilly cream alongside each slice of cake, sprinkle with the crumble and dust with icing sugar."]}, {"isVegetarian": true, "title": "Toffee apple upside-down cake", "url": "www_bbc_co_uk_food_recipes_toffee_apple_upside_down_02328", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "200g/7oz caster sugar ", "3 large Granny Smith apples, peeled, cored and sliced in 1cm/½in wedges", "1 large orange, zest only", "75g/2½oz dried cranberries", "225g/8oz salted butter, softened ", "225g/8oz golden caster sugar ", "225g/8oz self-raising flour", "½ tsp bicarbonate of soda ", "4 free-range eggs, at room temperature", "60ml/4 tbsp whole milk", "½ tsp vanilla extract", "200g/7oz caster sugar"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease 23cm/9in square baking tin with butter and line it with greaseproof paper. Preheat the oven to 180C/350F/Gas 4. ", "For the topping, put a pan over a high heat. Add the sugar and three tablespoons of water and cook until it the sugar melts and turns amber – do not stir at any point. Remove from the heat and carefully pour the toffee into the lined baking tin, taking care to cover the base completely. Place the apple wedges in three rows on top of the toffee and sprinkle with a third of the orange zest. Add the cranberries in any gaps between the rows of apple. ", "For the cake, beat the butter, the remaining orange zest and sugar until pale and fluffy. Sift together the flour and bicarbonate of soda and add a tablespoon of this to the butter mix along with one egg. Mix until combined and repeat the process until all the flour and eggs have been used. Stir in the milk and a few drops of vanilla. Pour into cake tin and gently smooth with a spatula. Bake for 40-50 minutes or until a skewer inserted into the centre comes out clean. Using oven gloves, place a cooling rack over the tin and quickly flip over, taking care not to burn yourself on any hot caramel that may leak from the tin. Remove from the tin and set aside to cool completely.", "For the caramel crown, in a pan set over a high heat add the sugar and two tablespoons of water and cook until a caramel forms, never stirring. Place the base of a clean cake tin on a heatproof mat. Drizzle over spoonfuls of the caramel to make a pattern. Allow to dry, and then gently remove and place on top of the cake."]}, {"isVegetarian": true, "title": "Toffee and stem ginger sauce", "url": "www_bbc_co_uk_food_recipes_toffeeandstemgingers_4138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz softened unsalted butter ", "50g/2oz caster sugar ", "125ml/4fl oz double cream ", "50g/2oz stem ginger, chopped ", "4tbsp/60ml/2fl oz syrup from the jar of stem ginger"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Dissolve the sugar in a heavy bottomed pan until it is completely dissolved and turns brown, forming a caramel. ", "Remove from the heat and very carefully add a knob of butter. ", "Whisk in the double cream. Once all the bubbles have gone, add the chopped ginger and syrup. Return to the heat to dissolve any remaining caramelised sugar, stirring occasionally. ", "Cool slightly before serving over a bowl of vanilla ice cream. "]}, {"isVegetarian": true, "title": "Toffee apple crumble", "url": "www_bbc_co_uk_food_recipes_toffeeapplecrumble_87427", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toffeeapplecrumble_87427_16x9.jpg", "ingredients": ["100ml/3½fl oz water", "225g/8oz granulated sugar", "30ml/1fl oz golden syrup", "30g/1oz unsalted butter ", "450g/1lb cooking apples, peeled, cored and sliced into wedges ", "450g/1lb eating apples, peeled, cored and sliced into wedges ", "150g/5oz plain flour", "100g/3½oz unsalted butter ", "100g/3½oz demerara sugar", "6 free-range egg yolks", "75g/2½oz caster sugar", "600ml/1 pint 1½fl oz whole milk", "1 vanilla pod, seeds only"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the toffee apples, place the water and sugar into a saucepan and slowly bring up to the boil. Reduce the heat once the sugar has melted, add the syrup and butter and then bring up to the boil again, stirring constantly. ", "Turn down the heat, add the apples and cook, stirring gently, until just soft. Place into an ovenproof dish.", "For the crumble, rub the flour, butter and sugar together in a bowl with your fingertips until the mixture resembles breadcrumbs. Spoon the crumble evenly over the toffee apple mixture and place in the oven to bake for 15 minutes, or until crisp and golden-brown.", "For the custard, place the egg yolks and sugar into a bowl. Place the milk and vanilla seeds into a saucepan and bring to the boil, then pour into the egg and sugar mixture. Whisk until well-combined.  Return the custard mixture to the saucepan and warm over a low heat until it thickens enough to coat the back of a spoon.", "To serve, divide the crumble between 4-6 serving plates and place a dollop of custard on each."]}, {"isVegetarian": true, "title": "Toffee apple sponge pudding", "url": "www_bbc_co_uk_food_recipes_toffeeapplespongepud_92633", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toffeeapplespongepud_92633_16x9.jpg", "ingredients": ["225g/8oz unsalted butter", "225g/8oz golden caster sugar", "4 free-range eggs", "200g/7oz self-raising flour", "splash full-fat milk", "1 tsp stem ginger (from a jar)", "250g/9oz cooking apples, peeled, cores removed, chopped", "2 tbsp sugar", "150g/5½oz butter", "150g/5½oz soft dark brown sugar", "150ml/5½fl oz double cream", "100ml/3½fl oz condensed milk", "50ml/2fl oz calvados (optional)", "ready-made custard, to serve"], "serves": "Makes 8 puddings", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the sponge, beat the butter and sugar together in a mixing bowl until pale and fluffy.", "Crack in the eggs, one at a time, beating each egg into the mixture until fully incorporated before adding the next.", "Fold in the flour until well combined. Add a splash of milk to loosen the mixture, as necessary. (NB: The mixture should be of dropping consistency.) Fold in the ginger.", "Place the chopped apples and sugar into a pan and cook for 4-5 minutes, or until the sugar has dissolved and is bubbling and the apple has softened.", "For the sauce, bring all of the sauce ingredients to the boil in a pan, stirring constantly to form a smooth sauce that is thick enough to coat the back of a spoon. Remove from the heat and set aside to cool slightly.", "Spoon a little of the sauce into eight dariole moulds. Divide the cooked apple equally among the moulds, then spoon over the sponge mixture.", "Place the dariole moulds into a large, deep-sided roasting tray. Pour enough boiling water into the roasting tray to reach halfway up the sides of the dariole moulds. (NB: This is called a bain-marie.) Cover the tray with aluminium foil, then transfer to the oven and cook for 25 minutes, or until the sponge has risen and is pale golden-brown. ", "Turn out one sponge pudding onto each of six serving plates. Drizzle any remaining sauce around the edge of the plates. Drizzle the custard over the sponge puddings."]}, {"isVegetarian": true, "title": "Toffee, chocolate and caramel pavlova", "url": "www_bbc_co_uk_food_recipes_toffeechocolateandca_88633", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter", "200g/7oz light muscovado sugar, or other light brown sugar", "3 tbsp water", "1 tbsp golden syrup", "1 tbsp white wine vinegar", "5 large free-range egg whites", "450g/1lb caster sugar", "2 tsp cornflour", "1 tsp white wine vinegar", "500ml/18fl oz double cream", "75ml/3fl oz water", "175g/6oz dark chocolate, melted"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the toffee, place all of the toffee ingredients into a pan and bring to the boil.", "Place a sugar thermometer into the pan and continue to cook until the temperature reads 128C/260F, then plunge the base of the pan into cold water. Immediately pour the toffee into a cold heatproof glass bowl and whisk well.", "Add one tablespoon of cold water and whisk until the toffee has thickened, then pour onto a shallow baking tray lined with baking parchment. Allow to cool until firm.", "For the pavlova, preheat the oven to 140C/285F/Gas 1.", "Place the egg whites into a clean bowl and whisk until soft peaks form when the whisk is removed.", "Add 300g/10½oz of the sugar, one tablespoonful at a time, whisking constantly, until stiff peaks form when the whisk is removed and the mixture appears glossy and smooth.", "Add the cornflour and vinegar and whisk to combine.", "Cut the toffee into chunks. Add half of the toffee to the meringue mixture and fold in gently.", "Line a baking tray with parchment paper and spoon the meringue and toffee mixture onto the tray in a large round shape.", "Place into the oven to bake for ten minutes, then turn the oven off and leave for at least 2-3 hours (preferably overnight), until crisp but uncoloured. Remove from the oven and cool. Transfer to a serving plate.", "Place the remaining 150g/5oz caster sugar and the water into a pan over a medium heat and bring to the boil. Reduce the heat and simmer until it forms a caramel.", "Pour half of the caramel onto a baking tray lined with baking parchment and allow to cool. Keep the remaining caramel warm.", "Whisk the double cream until soft peaks form when the whisk is removed.", "Fold in the remaining toffee pieces, two thirds of the melted chocolate and almost all of the warm caramel.", "Spoon the cream, chocolate and caramel mixture into the centre of the meringue.", "Drizzle with the remaining melted chocolate and caramel.", "Break the cool, set caramel into shards and place in the centre of the pavlova. Serve immediately."]}, {"isVegetarian": true, "title": "Tofu sushi bowl", "url": "www_bbc_co_uk_food_recipes_tofu_sushi_rice_bowl_69171", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tofu_sushi_rice_bowl_69171_16x9.jpg", "ingredients": ["100g/3½oz firm tofu, drained", "50g/1¾oz sushi rice", "25g/1oz frozen soya beans ", "low-calorie cooking spray", "4 radishes, thinly sliced", "¼ small cucumber, halved lengthways, seeds removed, cut into thin matchsticks", "¼ small carrot, peeled and cut into thin matchsticks", "3 spring onions, thinly shredded", "1 tsp toasted sesame seeds", "1 tbsp Japanese pickled ginger, drained, to serve", "½ lime, finely grated zest and juice ", "½ level tsp runny honey", "½ tbsp tamari or dark soy sauce", "½ tsp rice vinegar", "dash toasted sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sushi bowl, wrap the tofu in kitchen paper, sandwich between two plates or chopping boards and weigh down with a few tins from your cupboard. Leave to drain for 15 minutes.", "Meanwhile, bring a large saucepan of water to the boil and boil the sushi rice for 8–10 minutes, or until just cooked. Drain, place back in the pan, cover and set aside.", "Bring a small saucepan of water to the boil and cook the soya beans for 2 minutes, or until tender. Drain, refresh under cold water and set aside.", "To make the dressing, put the lime zest, juice and honey in a small saucepan and simmer for 1 minute. Stir in the tamari, vinegar and sesame oil and set aside.", "Cut the tofu into 1.5cm/½in cubes. Spray a large frying pan with a little low-calorie cooking spray and place over a medium-high heat. Add the tofu and cook for 1 minute on each side until crisp and golden brown.", "Place the rice in a bowl or lunchbox and stir in the dressing. Top with the soya beans, radishes, cucumber, carrot and two-thirds of the spring onions. Sprinkle over the tofu, remaining spring onions and sesame seeds and serve with the pickled ginger or place in the fridge until ready to eat."]}, {"isVegetarian": true, "title": "Tom Kerridge’s butternut squash and sage risotto", "url": "www_bbc_co_uk_food_recipes_tom_kerridges_butternut_56661", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tom_kerridges_butternut_56661_16x9.jpg", "ingredients": ["30g/1oz unsalted butter", "2 tbsp olive oil ", "1 onion, thinly sliced", "2 garlic cloves, finely chopped ", "280g/10oz arborio rice", "200ml/7fl oz dry white wine ", "1.1 litres/1 pint 16fl oz warm vegetable stock (made with stock cubes)", "1 small (or ½ large) butternut squash, peeled, deseeded, cut into small cubes ", "small handful fresh sage leaves, thinly sliced ", "100g/3½oz Parmesan (or a similar vegetarian hard cheese), finely grated", "150g/5oz mozzarella, drained, cut into small cubes", "30g/1¼oz pine nuts, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and half the oil in a frying pan over a low-medium heat. Add the onion and garlic and fry for 8-10 minutes, until softened but not coloured. Add the rice and fry for 1-2 minutes, stirring constantly until it is coated in the oil. ", "Pour in the wine and bring to the boil. Reduce the heat slightly until the wine is just simmering, then cook until two-thirds of the wine has evaporated. ", "Add a ladleful of the warm stock to the pan and return to a simmer, reducing the heat if the liquid starts to bubble too fiercely, to prevent the rice from cooking too quickly. When most of the stock has evaporated, add another ladleful. Cook the risotto in this way for 12-15 minutes, or until most of the stock has been absorbed by the rice and the rice is tender but has a slight bite. ", "Meanwhile, heat the remaining oil in a frying pan over a medium heat and fry and the butternut squash for 10-12 minutes, turning regularly, until tender and golden-brown all over. ", "Stir the sage, butternut squash, Parmesan and mozzarella into the risotto. Turn the heat off, leave the pan on the heat, and let the cheese melt. Season, to taste, with salt and pepper.", "Meanwhile, heat a dry frying pan over a medium heat. Add the pine nuts and toast for 1-2 minutes, until just golden-brown. Stir them into the risotto and serve."]}, {"isVegetarian": true, "title": "Tofu croquettes with cranberry sauce", "url": "www_bbc_co_uk_food_recipes_tofucroquetteswithcr_73354", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tofucroquetteswithcr_73354_16x9.jpg", "ingredients": ["400g/14oz semi-firm tofu, rinsed and drained, grated", "1 small bunch spring onions, white part only, finely chopped", "2 carrots, finely grated", "1 courgette, grated", "50g/2oz flour", "2-3 sprigs fresh thyme", "100g/3½oz fine dry breadcrumbs", "salt and freshly ground black pepper, to taste", "vegetable oil, for frying ", "100g/3½oz  sugar     ", "250g/9oz fresh or frozen cranberries", "100ml/3½fl oz fresh orange juice", "1 orange, finely grated zest only (optional)"], "serves": "Makes 12 croquettes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the tofu croquettes, use your hands to mix together all the croquette ingredients. The result should be a soft dough. Add the flour to make this hold together, and flavour to taste with thyme, salt and pepper. ", "Divide the dough into 12 patties, flatten them, and shallow-fry in batches for 5 minutes on each side, taking care when you turn them. ", "Arrange them side by side in a small oven-proof dish to be reheated in the oven when needed (although they will be less crisp, but no less delicious, if you do this). If you intend to freeze them, let them cool completely, then cover before doing so.", "For the cranberry sauce, add all the ingredients together in a pan and cook gently for 10-15 minutes, until the cranberries soften and burst in their skins and the sauce thickens. ", "Serve the tofu croquettes with the cranberry sauce alongside."]}, {"isVegetarian": true, "title": "Tofu in filo pastry", "url": "www_bbc_co_uk_food_recipes_tofuinfilopastry_80572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ block of firm tofu, drained", "¼ tsp dried chilli flakes", "pinch salt", "1 small bunch fresh thyme, leaves picked", "2 sheets of ready-made filo pastry, cut to 15cm/6in squares", "1 free-range egg, beaten", "1 tsp sesame seeds", "olive oil, to drizzle"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the dried chilli flakes, salt and thyme into a bowl. Add the tofu and toss to coat evenly.", "Brush the two sheets of filo pastry with the beaten egg. ", "Divide the tofu between the two sheets, placing it into the centre of each sheet, then fold in the edges of the filo on all sides to create two parcels. ", "Brush all over with egg and sprinkle with sesame seeds, then place on a baking sheet and place into the oven to bake for five minutes, or until golden.", "Remove and place onto a warmed plate and drizzle with olive oil to serve."]}, {"isVegetarian": false, "title": "Tom Kerridge’s spaghetti Bolognese", "url": "www_bbc_co_uk_food_recipes_tom_kerridges_spaghetti_51800", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tom_kerridges_spaghetti_51800_16x9.jpg", "ingredients": ["500g/1lb 2oz beef mince ", "splash vegetable oil", "100g/3½oz smoked streaky bacon, diced ", "1 onion, finely chopped", "2 celery stalks, trimmed, thinly sliced", "2 carrots, finely diced", "2 garlic cloves, grated", "1 bay leaf", "3-4 tbsp red wine vinegar ", "1 tsp demerara sugar", "1 tbsp dried oregano", "400g tin chopped tomatoes ", "300ml/10½fl oz beef stock (made from beef stock cubes) ", "150g/5oz button mushrooms, quartered", "salt and freshly ground black pepper", "400g/14oz dried spaghetti ", "grated Parmesan cheese, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/180C Fan/Gas 5.", "Put the beef mince in a colander and rinse under the cold tap to separate it into smaller pieces. Drain well and pat dry with kitchen paper. ", "Transfer the mince to a roasting tray and roast for 35-60 minutes, or until completely crisp and golden-brown. This intensifies the flavour and helps it to absorb the sauce ingredients. Drain off the fat. ", "Heat the oil in a large, heavy-based casserole over a medium heat. Add the bacon and fry for 4-5 minutes, stirring from time to time, until the fat melts and the bacon starts to brown. ", "Add the onion, celery, carrots, garlic and bay leaf and cook for 4-5 minutes, or until they begin to soften. ", "Stir in the vinegar, then the sugar and oregano. Add the cooked mince, tomatoes, stock and mushrooms. Stir well and bring to the boil, then reduce the heat and simmer for 45-60 minutes, stirring occasionally, until thickened. Season, to taste, with salt and pepper, then set aside. ", "Meanwhile, cook the spaghetti in a pan of boiling, salted water, stirring often with a fork, until just tender (al dente). Drain immediately in a colander, shaking it. ", "To serve, twirl the spaghetti onto 4 plates. Spoon over the Bolognese sauce and garnish with Parmesan, if desired."]}, {"isVegetarian": false, "title": "Steak, triple-cooked chips and Bordelaise sauce", "url": "www_bbc_co_uk_food_recipes_tomahawk_steak_30844", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz beef bone marrow", "250ml/9fl oz Bordeaux wine", "4 shallots, finely chopped", "½ tsp white peppercorns, crushed ", "1 bay leaf", "2 thyme sprigs ", "1 garlic clove, finely chopped", "300ml/10fl oz dark veal stock", "25g/1oz butter", "500g/1lb 2oz Maris Piper potatoes, peeled and cut into chips", "2 x 250g/9oz rib-eye steaks, bone in", "malt vinegar, to serve ", "½ bunch watercress, to serve", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Cover the bone marrow in water, cover and soak in the fridge overnight. In the morning, drain and cut into 2.5cm/1in pieces.", "To make the sauce, put the wine, shallots, peppercorns, herbs and garlic in a large saucepan over a high heat. Bring to the boil and simmer until the volume of the liquid has reduced by a third. ", "Add the stock, bring back to the boil and simmer until the volume of the liquid has reduced by half or until it coats the back of a spoon. ", "Place the bone marrow in a saucepan with a little water. Bring to the boil and cook for 30 seconds, then drain. Whisk the bone marrow and butter into the reduced sauce and season with salt and pepper. Keep warm. ", "Blanch the chips in boiling water for 5–8 minutes until softened but not cooked. Drain and spread out on a baking tray and chill in the fridge. ", "Preheat a deep-fat fryer to 130C (CAUTION: hot oil can be dangerous. Do not leave unattended.). Cook the chips for 5 minutes, or until cooked, but not coloured. Drain, spread out on the baking tray and leave to cool. ", "Turn the fryer up to180C. Cook the chips for 4–5 minutes until crisp and golden. Drain on kitchen paper and sprinkle with salt and malt vinegar. ", "Preheat the grill to its highest setting and cook the steaks for 4 minutes on each side or to your liking.  ", "Serve with the sauce poured over and the chips on the side. Garnish with the watercress."]}, {"isVegetarian": true, "title": "Tomato and basil savoury jam", "url": "www_bbc_co_uk_food_recipes_tomato_and_basil_savoury_46330", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["650g/1lb 7oz ripe tomatoes, skinned, chopped", "2 shallots, finely chopped", "2 garlic cloves, crushed", "½ red chilli, deseeded, finely chopped", "½ lemon, zest and juice", "1 tbsp balsamic vinegar", "½ tsp pectin", "225g/8oz caster sugar", "1 tbsp finely chopped fresh basil leaves"], "serves": "Makes 350ml/12fl oz jam", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the tomatoes, shallots, garlic, chilli, lemon zest and juice, vinegar and pectin in a saucepan and bring to the boil. ", "Stir in the sugar, then continue to boil until the mixture reaches 103C (use a sugar thermometer for this; it should take about 20 minutes). (CAUTION: hot sugar can be dangerous. Keep your eye on the pot at all times.)", "Remove the pan from the heat and stir in the basil. Set aside to cool for 20 minutes.", "Pour the jam into sterilised jars, seal and set aside until completely cooled.", "This jam will keep for up to 6 months."]}, {"isVegetarian": true, "title": "Tomato and basil tarte tatin", "url": "www_bbc_co_uk_food_recipes_tomato_and_basil_tarte_33340", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_and_basil_tarte_33340_16x9.jpg", "ingredients": ["500g/1lb 2oz ready-made puff pastry ", "40 vine-ripened cherry tomatoes ", "2 tbsp vegetable oil ", "pinch sea salt ", "freshly ground black pepper ", "2 tsp honey", "2 tbsp breadcrumbs ", "plain flour, for dusting ", "1 free-range egg, lightly beaten ", "small bunch fresh basil ", "2 tbsp extra-virgin olive oil "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Place the tomatoes into a 20cm/8in ovenproof frying pan with the vegetable oil, salt and pepper and honey. Arrange together as tightly as possible and sprinkle with the breadcrumbs.", "On a well-floured work surface, roll out a circle of puff pastry the same size as the top of the frying pan. Place the puff pastry over the tomatoes, tucking it around them so the tomatoes are encased. ", "Brush the pastry with the lightly beaten egg on the top only. (It does seem a bit pointless as this will be the underneath of the tart, but I like that bit of extra crunch that it adds to the pastry and it looks so much more presentable for that minute before you turn it upside down!)", "Bake in the oven for 20 minutes, or until the puff pastry is well puffed and golden brown. Remove from the oven and leave to sit for a few minutes, then tip away the excess liquid (if any) and put a large plate upside down on top of the frying pan. Using oven gloves, press the plate down hard and then quickly flip the whole thing so the frying pan is upside down and the plate is on the bottom. (I do this over the sink because there is usually some leakage!)", "Remove the frying pan. Once the tart is cold, rip up some mint or basil leaves and drizzle with extra-virgin olive oil. Add salt and freshly ground black pepper to taste. ", "To serve, arrange the tarte on a plate or large platter with cold meats, cheeses, olives or salads."]}, {"isVegetarian": true, "title": "Tomato and chilli jam", "url": "www_bbc_co_uk_food_recipes_tomato_and_chilli_jam_20031", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_and_chilli_jam_20031_16x9.jpg", "ingredients": ["2 red onions, finely chopped", "400g/14oz ripe cherry tomatoes, halved", "400g/14oz ripe plum tomatoes, quartered", "3 large mild red chillies, deseeded, finely chopped", "5cm/2in piece fresh root ginger, grated", "1 star anise", "250ml/9fl oz white wine vinegar", "300g/10½oz soft light brown sugar", "2 tsp fish sauce (substitute soy sauce for vegetarians)"], "serves": "Makes 4 x 250g/9oz jars", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sterilise the jars.  Wash in very hot water or on the hot cycle of a dishwasher.  Preheat the oven to 160C/325F/Gas 3. Place the jars upside down on a baking tray and dry in the oven for 10-15 minutes.", "Heat the red onion and chopped tomatoes in a large heavy-based saucepan over a low heat.", "Add the chillies, ginger, star anise, vinegar and sugar. Bring the mixture to the boil, then simmer for about 30 minutes, or until very thick and you can draw a wooden spoon across the base of the pan so that it leaves a channel behind it that does not immediately fill with liquid.", "Add the fish sauce and cook for 2-3 more minutes, then spoon into sterilised jars."]}, {"isVegetarian": true, "title": "Tofu stir-fry", "url": "www_bbc_co_uk_food_recipes_tofustirfry_79249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "100g/3½oz organic tofu, cubed", "1 tbsp olive oil", "pinch chilli flakes", "½ red pepper, de-seeded and sliced", "100g/3½oz spinach leaves", "4 mushrooms, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep, heavy-bottomed pan, one-third filled with vegetable oil, until a breadcrumb will sizzle gently in it. (CAUTION: hot oil can be dangerous! Do not leave unattended.)", "Carefully add the tofu cubes to the oil and fry for 2-3 minutes or until golden and crisp. Remove using a slotted spoon and drain on kitchen towels.", "Heat the olive oil in a large non-stick frying pan. Add the chilli flakes and fry for 1-2 minutes.", "Add the red pepper and sauté for 2-3 minutes to soften.", "Add the spinach leaves and mushrooms and cook gently until the spinach has wilted.", "Stir in the deep-fried tofu and cook until heated through. ", "Transfer the tofu stir-fry to a warm bowl and serve at once."]}, {"isVegetarian": true, "title": "Tomato and goats’ cheese doughballs", "url": "www_bbc_co_uk_food_recipes_tomato_and_goats_cheese_46597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 ready-made doughballs ", "a little soft butter ", "150g/5½oz tub soft goats’ cheese ", "1 tbsp red pesto ", "¼ tsp chopped thyme leaves", "12 cherry tomatoes", "salt and freshly ground black pepper", "25g/1oz parmesan (or vegetarian alternative), finely grated"], "serves": "Makes 24 canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Slice the doughballs in half and then cut a thin slice off of the rounded side so that both halves have a flat base to stand on. Butter the upper side and arrange on a baking tray lined with baking paper.", "Mix the goats’ cheese, pesto and thyme together in a small bowl. Spread this onto the buttered side of the doughballs, making sure that it is spread up to the edges. ", "Slice the tomatoes into thick slices and put one slice on top of each doughball half. Season with salt and freshly ground black pepper and then sprinkle over the parmesan cheese.", "Bake for 10 minutes, or until crisp and lightly golden-brown. Serve warm."]}, {"isVegetarian": true, "title": "Tomato and herb tarte tatin with a green salad", "url": "www_bbc_co_uk_food_recipes_tomato_and_herb_tarte_84464", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "2 tsp sugar ", "300g/10½oz small tomatoes (not cherry), halved ", "salt and pepper", "1 tsp dried mixed herbs ", "375g/13oz ready rolled puff pastry ", "1 egg, beaten ", "1 round lettuce, leaves torn  ", "1 tbsp white wine vinegar ", "1 tsp English mustard ", "5 tbsp olive oil "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Add a tablespoon of olive oil to a large (about 25cm/10in wide) ovenproof frying pan. Sprinkle the sugar in an even layer over the base. Arrange the tomatoes cut-side down tightly into the pan. Season well with salt and pepper and scatter over the mixed dried herbs. Cook over a medium heat for 10 minutes, or until the tomatoes are beginning to caramelise and colour on their cut sides and soften slightly around the edges. Remove from the heat.", "Cut the pastry into a circle 3cm/1½in bigger than the top of the pan.", "Place the puff pastry over the tomatoes, tucking it around the tomatoes and down the sides of the pan so that the tomatoes are encased. Brush the top of the pastry with the beaten egg.", "Bake in the preheated oven for 20 minutes, or until the puff pastry is puffed up and golden-brown. ", "Meanwhile, make the dressing for the lettuce. Whisk the vinegar, mustard and a pinch of salt and pepper together in a bowl. Slowly add four tablespoons of the oil, whisking as you go until it’s all incorporated. Taste and add salt and pepper as required.", "Remove the tart from the oven and set aside for a few minutes. Then pour any excess liquid away, if there is any, and put a large plate upside down over the top of the frying pan. Using oven gloves, press the plate down hard and then quickly flip the whole thing over so that the plate is on the bottom and the frying pan on the top.", "Place the plate on a counter and remove the frying pan. Dress the torn lettuce with the vinaigrette. Serve the tart in slices warm or cold, with the salad alongside. "]}, {"isVegetarian": true, "title": "Tomato and mozzarella tarts with rocket pesto", "url": "www_bbc_co_uk_food_recipes_tomato_and_mozzarella_57847", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz ice cold water", "110g/4oz rocket leaves", "½ garlic clove", "1 tbsp pine nuts, toasted", "8 tbsp olive oil", "275g/9½oz puff pastry (from above)", "200g/7oz mozzarella, sliced", "150g/5½oz fresh tomatoes, sliced", "25ml/1fl oz olive oil", "1 free-range egg yolk, beaten", "handful fresh basil, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour in a mound on a clean work surface and make a deep well in the centre using your fingers.", "Place the butter cubes and salt into the well and, using the fingertips of one hand, work the ingredients together, gradually drawing more flour into the well with the other hand. Work in the flour until the mixture is loosely but well combined and still with lumps of butter visible.", "Gradually add the iced water and mix until you have a rough dough. (You may not need all of the water. Take care not to overwork the mixture.)", "Roll the dough into a ball, wrap in cling film and chill for 20 minutes in the fridge.", "When the dough has chilled, roll it out on a lightly-floured work surface into a 40x20cm/16x8in rectangle. Fold the rectangle into three and give it a quarter turn.", "Repeat the process, giving the folded pastry another quarter turn.", "Wrap the pastry in cling film and chill for a further 30 minutes.", "When the dough has chilled, roll it out, as before, onto a lightly-floured work surface into a 40x20cm/16x8in rectangle. Fold the rectangle into three and give it a quarter turn.", "Repeat the process, as before, giving the folded pastry another quarter turn (making a total of four turns).", "Wrap the pastry in cling film and chill it for at least 30 minutes.", "For the rocket pesto, place all the ingredients in a blender and blend to a fine purée.", "For the tomato and mozzarella tarts, preheat the oven to 400F/200C/Gas 6.", "Roll the rough puff pastry out on a lightly-floured surface to a 2mm/1/8in thickness. Cut out six discs using a 12cm/5in pastry cutter.", "Line a baking tray with baking parchment and brush with a little cold water. Transfer each of the pastry discs onto the tray using a palette knife.", "Place two teaspoons of pesto in the centre of each pastry circle, leaving a 1cm/½in border.", "Place pieces of mozzarella on the top and put the tomatoes on top. Drizzle with olive oil and brush the pastry with egg yolk around the edges.", "Bake in the oven for 12-15 minutes, or until the pastry is golden-brown. ", "To serve, garnish the tarts with a little more pesto and some fresh basil leaves."]}, {"isVegetarian": true, "title": "Tomato confit canapés", "url": "www_bbc_co_uk_food_recipes_tomato_confit_canapes_28293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_confit_canapes_28293_16x9.jpg", "ingredients": ["250g/8oz ready-made shortcrust pastry", "1 tbsp olive oil", "125g/4oz cherry tomatoes, halved", "1 tbsp fresh thyme leaves", "1 fresh bay leaf", "1 garlic clove, unpeeled, halved", "1 tsp crushed black peppercorns", "8 sun-dried tomatoes", "50g/2oz pitted black olives", "2 tbsp chopped fresh basil", "salt and freshly ground black pepper"], "serves": "Makes 24 canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out to a 0.25cm/⅛in thickness and cut out 24 circles from it using a 5cm/2in pastry cutter.", "Place the circles onto a baking tray and prick all over with a fork. ", "Bake in the oven for 10-12 minutes, or until cooked through and golden-brown. Remove from the oven and set aside to cool.", "Meanwhile, heat the olive oil in a frying pan over a medium heat and add the tomatoes, thyme leaves, bay leaf, garlic and crushed peppercorns. Fry gently for 4-5 minutes, then remove from the heat and set aside to cool. Remove the bay leaf and garlic.", "Blend the sundried tomatoes and olives to a paste in a food processor, then stir in the basil and season, to taste, with salt and freshly ground black pepper.", "To assemble the canapés, spread a little of the olive paste onto each pastry circle and top with a spoonful of tomato confit."]}, {"isVegetarian": true, "title": "Tomato confit with steamed courgette flowers, fried tomatoes and basil sauce", "url": "www_bbc_co_uk_food_recipes_tomato_confit_with_90711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 plum tomatoes, halved", "1 orange, zest only", "2 tbsp finely chopped basil stalks and leaves", "250ml/3½fl oz olive oil", "4 garlic cloves, finely chopped", "1 unwaxed lemon, zest only", "salt and freshly ground black pepper", "1 tbsp green olives, pitted and chopped ", "100g/3½oz goats' cheese", "1 tsp chopped basil", "50g/1¾oz Parmesan, grated  ", "2 small courgette flowers ", "1 bunch basil ", "30g/1oz Parmesan, finely grated", "3 tbsp pine nuts ", "1 garlic clove", "150ml/5fl oz olive oil", "1 tbsp self-raising flour", "1 tbsp polenta", "1 tsp cayenne pepper ", "1 free-range egg, beaten ", "1 green tomato, sliced", "handful green cherry tomatoes, quartered", "drizzle olive oil", "drizzle sherry vinegar", "baby basil leaves"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½.", "To make the tomato confit, place the plum tomatoes on a roasting tray with the rest of the ingredients. Mix well and season with salt and pepper. Roast for 4 hours, or until soft. ", "Meanwhile, to make the steamed courgette flowers, mix the olives with the goats' cheese, basil and Parmesan. Season with salt and pepper and stuff the courgette flowers. Twist the tips to contain the stuffing and steam for 6 minutes. ", "To make the fried tomatoes with basil sauce, in a food processor, blend the basil, Parmesan, pine nuts and garlic with 100ml/3½fl oz of olive oil to form a sauce. ", "Place the self-raising flour, polenta and cayenne pepper into a small bowl and mix well. Put the beaten egg in a separate bowl. ", "Dip each slice of tomato in the egg, coating well, then dip into the flour and polenta mixture, turning to coat. ", "Heat the remaining olive oil in a large frying pan over a medium heat and fry the tomato slices for a few minutes on each side. ", "To serve, mix the halved cherry tomatoes with a little olive oil and sherry vinegar, spoon a few confit tomatoes onto each plate, add a steamed flower and a few fried tomato slices. Drizzle with the basil sauce and scatter over some baby basil leaves.  "]}]