[{"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "100 g / 3½ oz de azúcar en polvo", "100g / 3½oz de mantequilla fría, cortada en cubitos", "2 yemas de huevo de gallinas camperas, batidas", "Queso cuajado de 170g / 6oz (disponible en algunos grandes supermercados)", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de mantequilla, ablandada", "Harina normal de 10g / ¼ oz", "50 g / 1oz de pasas", "1 huevo de gallinas camperas, golpeado", "1 limón, ralladura solamente", "nuez moscada pizca", "50g / 1¾oz de cuajada de limón"], "method": ["Para la masa de pasta brisa dulce, engruesa y enharina una lata de tarta de 30 cm / 12 in.", "Coloque la harina, el azúcar impalpable y la mantequilla fría picada en un tazón o procesador de alimentos. Suavemente frote los ingredientes con las yemas de los dedos o licúe hasta que la mezcla se asemeje a pan rallado.", "Agregue los huevos batidos y combine para formar una masa liviana (agregue 2-3 cucharadas de agua si es necesario).", "Forme la masa en forma de bola y transfiérala a la nevera para que se enfríe durante 30 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "En una superficie de trabajo ligeramente enharinada, extienda la masa a 5 mm / ¼ de grosor.", "Alinee la lata tarta preparada con la masa y recorte cualquier exceso de los bordes. Cualquier pastel sin usar se puede congelar para un uso posterior.", "Coloque un trozo de papel antigrasa sobre la masa y llénelo con alubias o legumbres secas. Hornee a ciegas durante 15-20 minutos hasta que esté seco y firme para tocar.", "Retire la caja de pastelería del horno. Retire los frijoles para hornear y el papel resistente a las grasas. Dejar de lado.", "Para el llenado, drene el líquido del queso cuajado colocándolo en un colador. Use la parte posterior de una cuchara para exprimir el exceso de humedad. Descarta el liquido", "En un tazón, bata el azúcar y la mantequilla hasta que quede suave y pálido.", "Agregue la harina, las pasas, el huevo, el queso cuajado, la ralladura de limón y la nuez moscada. Mezclar bien.", "Extienda la crema de limón sobre la base de la masa y luego rellene con la mezcla de cuajada de queso. Alise la superficie con una espátula o con el dorso de una cuchara.", "Hornee durante 35-40 minutos, o hasta que la masa esté dorada y el juego de llenado.", "Deje que la tarta se enfríe en la lata durante 20-25 minutos.", "Retire de la lata y sirva en rebanadas."], "url": "www_bbc_co_uk_food_recipes_yorkshire_curd_tart_63644", "title": "Tarta de cuajada de Yorkshire", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de mantequilla o margarina", "Jarabe de oro de 250 g / 9 oz", "125g / 4½ oz de melaza negra", "500g / 1lb 2oz de azúcar mascabado", "Harina normal de 375g / 13oz", "1½ cucharadita de jengibre molido", "½ cucharadita de polvo de hornear", "500 g / 1 libra de harina de avena 2 oz", "½ pinta de leche"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear de 15 x 20 cm / 6 x 8 pulgadas con papel resistente a la grasa.", "En una sartén, derrita suavemente la mantequilla (o margarina), el jarabe dorado, la melaza negra y el azúcar hasta que se combinen.", "Mezcle los ingredientes secos restantes en un tazón grande.", "Agregue la mezcla de jarabe caliente y revuelva para combinar. Agregue la leche para ayudar a aflojar la mezcla.", "Vierta en la lata preparada y hornee durante 35-45 minutos, o hasta que esté suave al tacto."], "url": "www_bbc_co_uk_food_recipes_yorkshire_oatmeal_parkin_13911", "title": "Yorkshire avena parkin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "¼ cucharadita de sal", "3 huevos grandes de gallinas camperas", "225ml / 8 fl oz de leche", "aceite de girasol"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Mezcle la harina y la sal juntas en un bol y haga un pozo en el centro. Agregue los huevos y un poco de la leche. Batir hasta que esté suave y luego agregar gradualmente la leche restante. Esto se puede hacer con una cuchara de madera, pero es más fácil con un batidor de mano eléctrico. Vierta la mezcla en una jarra.", "Mida una cucharada de aceite en cada orificio de la bandeja de 12 panecillos, o una cucharada en cada orificio de las latas de cuatro orificios, o tres cucharadas en la lata de asar. Transfiera al horno precalentado por cinco minutos o hasta que el aceite esté bien caliente.", "Retire con cuidado del horno y vierta la mezcla por igual entre los agujeros o la lata. Regrese la masa rápidamente al horno y cocine por 20-25 minutos (35 si prepara el pudín de Yorkshire en la lata de asar), o hasta que esté dorado y bien levantado.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_yorkshire_pudding_69240", "title": "Yorkshire pudding", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_pudding_69240_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "2 huevos medianos de granja", "300ml / 10fl oz de leche entera", "sal marina y pimienta negra recién molida", "4 cucharadas de grasa de ganso, carne goteando o manteca de cerdo (si eres vegetariano, puedes usar aceite de colza, aceite de girasol o aceite vegetal)"], "method": ["Tamiza la harina en un tazón grande. Agregue los huevos y mezcle con la batidora. Una vez incorporada, bata gradualmente la leche poco a poco, bata hasta obtener una mezcla suave, sazone con sal y pimienta y luego vierta la mezcla en una jarra. Cubra con película adhesiva y refrigere durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6. Ponga media cucharada de grasa o aceite en cada uno de los ocho orificios de una lata de muffin profunda. Deje en el horno durante 5-7 minutos a minutos para calentar, o hasta que la grasa esté humeando.", "Vierta la mezcla fresca en los agujeros que lo dividen por igual y regrese al horno. Cocine por 20 minutos sin abrir la puerta, luego revíselo y cocínelo por otros 2-3 minutos si es necesario o hasta que se dore y se eleve. Eliminar y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_61798", "title": "Cómo hacer pudines de Yorkshire", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 8 pudines grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_puddings_61798_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "sal y pimienta negra recién molida", "8 huevos medianos de granja", "600ml / 20fl oz de leche entera", "55 g / 2 oz de goteo", "25 g / 1oz de mantequilla sin sal", "2 cucharadas de aceite de oliva", "1kg / 2lb 4 oz cebollas blancas, finamente cortadas", "2 ramitas de tomillo fresco, hojas recogidas", "3 dientes de ajo, finamente picados", "50ml / 2fl oz de jerez seco", "250ml / 9fl oz de vino blanco", "2 cucharadas de harina normal", "1,2 litros / 2 pintas de ternera fresca o caldo de carne", "1 cucharadita de azúcar morena suave", "sal y pimienta negra recién molida", "4 rebanadas de baguette", "Queso emmental 110 g / 4 oz, rallado"], "method": ["Para los budines de Yorkshire, para hacer la masa, coloque la harina en un tazón grande y sazone con sal y pimienta. Agregue los huevos y bata. Poco a poco agregue la leche, batiendo todo el tiempo.", "Deje reposar la masa durante 24 horas en la nevera.", "Para cocinar los budines de Yorkshire precalentar el horno a 220C / 450F / Gas 7.", "En una bandeja de budín de Yorkshire con 8-12 agujeros, coloque un poco del goteo en cada hoyo y colóquelo en el horno caliente hasta que la grasa esté caliente.", "Retire del horno y vierta la mezcla. Coloque en el horno durante 20-25 minutos. Baje el fuego a 190C / 375F / Gas 5 y cocine por otros 10 minutos.", "Para la sopa de cebolla francesa, caliente una olla grande y agregue la mantequilla y el aceite. Una vez caliente, agregue las cebollas y el tomillo y fría por 20-25 minutos a fuego lento, o hasta que estén suaves y dorados.", "Agregue el ajo y cocine por otros minutos, luego agregue el jerez y el vino blanco. Cocine hasta que el líquido haya reducido su volumen a la mitad.", "Agregue la harina y cocine por un par de minutos más, luego vierta el caldo.", "Deje que hierva a fuego lento y cocine suavemente por 10-15 minutos y sazone con el azúcar, la sal y la pimienta.", "Para hacer pan tostado con baguette, precaliente la parrilla a fuego alto.", "Coloque el pan en una bandeja para hornear y tueste ligeramente debajo de la parrilla, luego agregue el queso rallado y vuelva a colocar en la parrilla hasta que se dore.", "Para servir, ponga un poco de sopa en tazones calientes y cubra con los panqueques con queso.", "Coloque los budines de Yorkshire un plato y sirva el resto de la sopa con ellos."], "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_and_40867", "title": "Pudines de Yorkshire y sopa de cebolla francesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "8 huevos de gallinas camperas", "500ml / 18fl oz de leche entera", "sal y pimienta negra recién molida", "Goteo de carne de res de 75g / 2¾oz", "250ml / 9fl oz de vino tinto", "1 litro / 1¾ pintas de carne de vacuno fresca o ternera", "50g / 1¾oz de mantequilla", "3 cebollas, en rodajas finas", "3 ramitas de tomillo, hojas recogidas", "50ml / 1¾fl oz de brandy"], "method": ["Para los budines de Yorkshire, coloque la harina en un tazón, bata los huevos y la leche hasta que esté lo más suave posible, sazone con sal y pimienta negra.", "Vierta en una jarra y coloque en la nevera para descansar, preferiblemente durante la noche.", "Caliente el horno a 220C / 425F / Gas 7.", "Coloque una lata de muffin profunda de 12 agujeros en el horno y déjela durante cinco minutos, luego agregue un poco de carne goteando en cada uno de los agujeros y déjelo calentar durante 5-10 minutos, o hasta que esté caliente.", "Tome la mezcla de la nevera y bata una vez más. Con cuidado, vierta la mezcla en las latas y hornee durante 10-15 minutos hasta que se dore y se eleve por los bordes.", "Para la salsa de cebolla, coloque el vino tinto en una sartén ancha y caliente hasta reducir a la mitad. Agregue el caldo y cocine a fuego muy lento hasta que se reduzca a la mitad nuevamente.", "Mientras tanto, caliente una sartén grande hasta que esté caliente, luego agregue la mantequilla, las cebollas en rodajas y las hojas de tomillo y cocínelas durante 12-15 minutos, o hasta que estén suaves y ligeramente doradas.", "Agregue el brandy y el flambeado para quemar el alcohol (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos). Agregue el caldo reducido y llévelo a ebullición.", "Reduzca el fuego a fuego lento y cocine por otros cinco minutos, luego sazone con sal y pimienta negra recién molida.", "Para servir, vierte la salsa de cebolla sobre los cálidos budines de Yorkshire."], "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_with_15870", "title": "Pudines de Yorkshire con salsa de cebolla", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 pudines grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "sal y pimienta negra recién molida", "8 huevos de gallinas camperas", "600ml / 20fl oz de leche entera", "Goteo o manteca de cerdo de 50 g / 1¾oz", "4kg 28 días de edad, forerib de carne de vacuno, en el hueso", "50ml / 2fl oz de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "1 repollo savoy, sin núcleo, en rodajas finas", "2 cucharadas de semillas de alcaravea", "jus de carne o salsa, para servir"], "method": ["Para los budines de Yorkshire, coloque la harina en un tazón y sazone con sal y pimienta negra recién molida.", "Agregue los huevos y la leche al bol y bata para hacer una mezcla suave.", "Cubra y coloque en la nevera para enfriar durante al menos una hora, pero preferiblemente durante la noche.", "Para la carne de res, precaliente el horno a 200C / 400F / Gas 6.", "Calentar una sartén hasta que esté muy caliente. Sazonar la carne con sal y pimienta negra recién molida y untar con un poco de aceite de oliva. Agregue la carne a la sartén caliente. Freír en todos los lados en la sartén caliente hasta que esté dorado.", "Transfiera la carne a un plato para asar y colóquela en el horno para que se cocine durante 1 hora y 10 minutos para hacerla rara o más larga para que se adapte a su gusto.", "Retire la carne del horno, cubra con papel de aluminio y descanse en un lugar cálido durante 15-30 minutos.", "Para los budines de Yorkshire, precaliente el horno a 220C / 450F / Gas 7. Divida el goteo o la manteca de cerdo entre dos moldes para muffins de 12 hoyos o latas Yorkshire y coloque las latas en el horno durante diez minutos hasta que esté caliente.", "Con cuidado, vierta la mezcla en las latas, llenando las latas dos tercios por completo.", "Coloque las latas en el horno y cocine los pudines de Yorkshire durante 20 minutos; no abra la puerta del horno durante este tiempo.", "Después de 20 minutos, abra la puerta para permitir que salga el vapor y baje la temperatura a 190 ° C / 375 ° F / Gas 5. Continúe cocinando hasta que los postres de Yorkshire estén dorados y crujientes.", "Para el repollo estacional, caliente una sartén grande y agregue la mantequilla. Una vez caliente agregue el repollo y un poco de agua. Agregue las semillas de alcaravea y cocine por 2-3 minutos hasta que la col se haya marchitado.", "Para servir, esculpe la carne y colóquela en platos junto con los budines y repollo Yorkshire. Vierta el jugo de carne o salsa sobre la carne y los postres."], "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_with_50889", "title": "Postres de Yorkshire con costillas de res y repollo estacional", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 cucharaditas de aceite de girasol", "125g / 4½oz de harina blanca normal", "pizca de sal", "1 cucharadita de mostaza en polvo", "pizca de pimienta negra", "75 g / 2½ oz de leche entera", "2 huevos medianos de rango libre, golpeados", "½ cubo de caldo de pollo", "pellizcar hilos de azafrán", "2 cucharadas de aceite de oliva virgen extra", "1 cebolla pequeña, finamente cortada", "2 pechugas de pollo grandes, cortadas en pedazos del tamaño de un bocado", "1 chiles rojos, en rodajas finas", "gran pizca de canela molida", "2 cucharadas de vinagre de sidra", "6 tomates cherry, cortados en cuartos", "1 cucharada de miel", "1 cucharada de sultanas", "50 g / 1¾oz de almendras en copos, tostadas", "pequeño cilantro fresco"], "method": ["Precalentar el horno a 250 ° C / 230 ° Ventilador / Gas 9.", "Para los budines de Yorkshire, agregue 1 cucharadita de aceite a cada orificio de una lata de muffins. Coloque la bandeja en el estante superior del horno para precalentar el aceite.", "En un tazón grande, tamice la harina, la sal, la mostaza en polvo y la pimienta. En una jarra, combine la leche y 75 g / 2½ oz de agua fría. Haga un pozo en la mezcla de harina y agregue los huevos. Batir para combinar (la consistencia debe ser una pasta muy espesa). Poco a poco agregue la mezcla de leche y bata hasta la consistencia de una sola crema. Decantar en una jarra de vertido y dejar reposar a temperatura ambiente durante 30 minutos.", "Retire las latas precalentadas del horno y vierta rápidamente aproximadamente 5 mm de profundidad de la mezcla en cada orificio, teniendo cuidado de protegerse de cualquier salpicadura de aceite caliente. El aceite debe chisporrotear cuando se vierte la mezcla.", "Regrese rápidamente al estante superior del horno y hornee por 15 minutos hasta que se dore y se eleve. No abra la puerta del horno hasta que estén cocidos o los postres se colapsen. Retire cada pudín de la lata y colóquelo en una rejilla para enfriar.", "Para el llenado, coloque el cubo en una jarra medidora y agregue 200 ml / 7 fl oz de agua hirviendo. Mezcle hasta que se disuelva y luego agregue el azafrán. Dejar de lado.", "Caliente el aceite en una sartén grande colocada a fuego medio. Agregue la cebolla y cocínela durante 5 minutos hasta que esté suave y dorada. Agregue el pollo y cocine por 3 minutos, o hasta que el pollo comience a dorarse. Agregue el chile y la canela y cocine por unos minutos. Agregue el caldo de azafrán, el vinagre de sidra, los tomates, la miel y las sultaninas a la sartén y deje que hierva. Baje el fuego y cocine a fuego lento durante 10 minutos para reducir la salsa.", "Elija 12 hojas de cilantro y déjelas a un lado para usarlas como aderezo. Pica finamente el resto y agrega la salsa.", "Para servir, use un cuchillo de cocina para cortar un pozo en el centro de cada pudín. Llene cada Yorkshire con el relleno. Esparce las almendras tostadas encima y decora con una hoja de cilantro."], "url": "www_bbc_co_uk_food_recipes_yorkshire_tapas_puddings_93245", "title": "Budines de Yorkshire 'tapas'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 12 pudines de Yorkshire", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_tapas_puddings_93245_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina natural, más extra para espolvorear", "Harina de auto crianza de 200g / 7oz", "½ cucharadita de polvo de hornear", "1 litro / 1¾ pintas de agua fría", "1 cucharada de vinagre de malta", "1 cucharada de salsa de soja", "½ cucharadita de jengibre rallado", "4 rebanadas de pavo sobrante (aproximadamente 200 g / 7 oz)", "aceite vegetal, para freír", "1 patata grande y harinosa, pelada, cortada en 8 rebanadas delgadas de igual tamaño", "50g / 2oz de mantequilla", "1 chalote, finamente picado", "340 g / 11¾oz de guisantes congelados", "2 cucharadas de hojas de menta fresca picada", "salpicaduras de vinagre de malta", "sal y pimienta negra recién molida"], "method": ["Tamiza las dos harinas en un tazón grande. Agregue el polvo de hornear y el agua y mezcle para obtener una consistencia cremosa. Agregue el vinagre y colóquelo en la nevera durante 30 minutos.", "Mientras tanto, para la torta de pavo, mezcle la salsa de soja y el jengibre. Agregue las rebanadas de pavo y reserve para marinar.", "Caliente el aceite en una freidora a 175C / 340F. Alternativamente, caliente el aceite vegetal en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Empareda cada rebanada de pavo marinado entre dos rodajas de patata, sacudariendo cualquier exceso de adobo. Espolvorea la harina en un plato y espolvorea cada torta de pavo en la harina para cubrir. Sumerja en la mezcla, luego con cuidado en el aceite caliente y fría durante 6-8 minutos, o hasta que las rodajas de patata estén tiernas y la masa esté crujiente y dorada. Ponga a un lado para drenar en papel de cocina, manténgalo caliente.", "Para los guisantes, caliente la mantequilla en una sartén a fuego medio. Agregue la chalota y fría por 3-4 minutos, o hasta que esté blanda pero no coloreada. Agregue los guisantes, la menta, el vinagre y un poco de agua fría y mezcle bien. Continúe cocinando durante 2-3 minutos, o hasta que se caliente por completo. Sazonar, al gusto, con sal y pimienta.", "Retire la mitad de la mezcla de guisantes de la sartén y transfiérala a un plato. Mash la mezcla restante de guisantes. Regrese la mezcla de guisantes reservada a la sartén, luego sazone de nuevo si es necesario.", "Sirva los pasteles de pavo con los guisantes triturados al lado."], "url": "www_bbc_co_uk_food_recipes_yorkshire_turkey_cake_on_64435", "title": "Pastel de pavo Yorkshire en guisantes triturados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 bolsitas de té negro, fuertes y de buena calidad", "4 cucharadas de aguardiente", "1 cucharadita de agua de rosas", "1 cucharada de miel clara", "115g / 4oz sultanas", "75 g / 2½ oz pasas", "50g / 1¾oz pasas de Corinto", "180g / 6½oz de harina de pan fuerte", "1½ cucharadita de polvo de hornear", "½ cucharadita de canela molida", "½ cucharadita de nuez moscada molida", "2 cucharadas de mermelada de naranja de corte medio", "120g / 4oz de azúcar morena suave", "1 huevo grande de gallinas camperas, a temperatura ambiente, ligeramente golpeado", "30 g / 1oz de mantequilla sin sal, derretida y enfriada hasta que esté tibia", "2 cucharadas de mermelada", "frutas de mazapán (opcional)", "hoja de oro (opcional)"], "method": ["Coloque las bolsitas de té en un recipiente y agregue 200 ml / 7 fl oz de agua caliente, el aguardiente, agua de rosas, miel y fruta seca. Cubra y remoje durante la noche, o hasta que la fruta esté regordeta. (Si tiene poco tiempo, puede hacer trampa un poco calentando los ingredientes suavemente para acelerar el proceso).", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y forre una lata de pan de 450 g / 1 lb con papel de hornear.", "Cuando la fruta esté gruesa, cuela y descarta el líquido y las bolsas de té.", "Tamiza la harina, el polvo de hornear, la canela y la nuez moscada en un tazón grande. Agregue la mermelada y el azúcar moreno. Agregue el huevo y la mantequilla derretida y combine para formar una masa suave. Agregue la fruta y mezcle completamente.", "Transfiera la mezcla al molde de pan preparado y hornee por 50-60 minutos, o hasta que un pincho de madera salga limpio.", "Retire del horno y deje en la lata durante 10 minutos. Apague y enfríe en la rejilla de alambre.", "Para decorar el pastel, cepille el pastel con mermelada. Corte las frutas de mazapán por la mitad y colóquelas encima del pastel. Use la hoja de oro para dorar las frutas de mazapán."], "url": "www_bbc_co_uk_food_recipes_yorkshire_tea_cake_98065", "title": "Pastel de té de Yorkshire", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 litros / 3 pintas de leche entera", "1 limón, solo jugo", "Harina simple de 400g / 14oz, más extra para quitar el polvo", "pizca de sal", "110g / 4oz de mantequilla, cortada en pedazos", "Manteca de cerdo de 110 g / 4oz cortada en pedazos", "3-4 cucharadas de agua fría", "Mantequilla 110g / 4oz, ablandada", "1 cucharada de agua de rosas", "2 huevos de gallinas camperas, golpeados", "Grosellas 110 g / 4 oz"], "method": ["Comienza el día antes de que quieras hacer el pastel. Para la cuajada, llevar la leche a ebullición en una sartén. Agregue el jugo de limón y revuelva bien; la mezcla se cuajará bastante rápido. Retirar del fuego y dejar enfriar, luego verter en un tamiz forrado de muselina colocado sobre un recipiente y dejar durante la noche hasta que se solidifique. Refrigere las cuajadas sólidas una vez separadas - deseche cualquier líquido.", "Al día siguiente, para la masa, tamice la harina y la sal en un tazón. Agregue la mantequilla y la manteca de cerdo y frote hasta que la mezcla se asemeje a migajas de pan finas. Agregue el agua y revuelva hasta que la mezcla se una, luego pase a una superficie de trabajo ligeramente enharinada y amasar brevemente hasta que quede suave. Envuelva la masa en una película adhesiva y colóquela en la nevera durante 30 minutos para que descanse.", "Retire la masa del refrigerador y extiéndala a 0.5cm / ¼ de grosor. Cubra una lata tarta profunda de 20cm / 8in de fondo suelto con la masa, pinche la base con un tenedor y colóquela en la nevera para que descanse durante diez minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cubra la caja de pastelería con papel de hornear y rellene con arroz o frijoles para hornear. Transfiera al horno y hornee durante 15 minutos. Retire el papel de hornear y el arroz o los frijoles y vuelva al horno durante cinco minutos, o hasta que estén ligeramente dorados.", "Para hacer el pastel, coloque la mantequilla suavizada en un recipiente, agregue el agua de rosas y mezcle bien. Agregue los cuajos sólidos y los huevos batidos al recipiente y mezcle bien. Agregue las grosellas y mezcle bien.", "Vierta la mezcla en la caja de repostería y hornee por 20-30 minutos, o hasta que el relleno esté listo y ligeramente dorado. Sacar del horno y dejar enfriar.", "Para servir, retire la tarta de la lata, córtela en rodajas y colóquela en platos para servir."], "url": "www_bbc_co_uk_food_recipes_yorkshirecurdpie_86473", "title": "Pastel de cuajada de Yorkshire", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite, para freír", "3 cucharadas de vinagre de estragón", "3 cucharadas de vino blanco", "¼ cucharadita de granos de pimienta blanca", "½ chalote de plátano pequeño, finamente picado", "125 g / 4½ oz de mantequilla", "2 yemas de huevo de gallinas camperas", "sal marina y pimienta negra recién molida", "½ limón, solo jugo", "1 cucharada de hojas de estragón picadas", "1 cucharada de aceite de oliva", "1 filete de buey de buena calidad de 1 x 200 g / 7oz", "100 g / 3½ oz de chips congelados"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Precaliente una freidora a 180C / 350F. Alternativamente, llene una olla grande de base pesada con aceite y calor, usando un termómetro de cocción para verificar la temperatura. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Ponga el vinagre, el vino blanco, los granos de pimienta y la chalota en una cacerola pequeña y deje que hierva. Cocine a fuego lento hasta que el volumen de líquido se haya reducido a aproximadamente una cucharada. Cuele el líquido en un recipiente y luego déjelo enfriar.", "Mientras tanto, derrita 100 g / 3½ oz de la mantequilla en una cacerola pequeña a fuego medio.", "Coloque las yemas de huevo en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento y bata hasta que espese y luz en color. Poco a poco agregue la mantequilla derretida, batiendo constantemente.", "Sazonar con sal y pimienta negra, agregar la reducción de chalote refrigerado y las hojas de estragón picado y mezclar bien.", "Apague el fuego y deje el recipiente sobre la sartén hasta que esté listo para usar.", "Calentar una sartén hasta que esté caliente. Agregue el aceite de oliva y el bistec y cocínelos por un lado durante 2 a 3 minutos, antes de voltearlos y colocarlos en el horno durante 2 o 3 minutos.", "Mientras los filetes están en el horno, cuidadosamente baje las papas fritas en la freidora y cocine por 3-4 minutos, o hasta que estén doradas y cocidas.", "Retire la carne del horno y agregue la mantequilla restante a la sartén. Ponga la mantequilla derretida sobre el bistec varias veces durante al menos 2-3 minutos mientras descansa el filete, esto le dará un brillo encantador y le dará sabor.", "Para servir, coloca el bistec en un plato, apila las patatas al lado y luego termina con una cucharada de salsa bearnesa."], "url": "www_bbc_co_uk_food_recipes_yorkshire_wagyu_fillet_50959", "title": "Filete de Yorkshire con papas fritas y salsa bearnesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de avena mediana", "Harina de 175g / 6oz de auto crianza", "2 cucharaditas de jengibre molido", "175g / 6oz de azúcar morena suave", "175g / 6oz de mantequilla", "250g / 9fl oz de jarabe dorado", "50g / 2 oz de melaza negra", "2 huevos de gallinas camperas", "Leche de 110ml / 4oz"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2 y alinee una bandeja pequeña y profunda para hornear con papel pergamino. Combine la harina de avena, la harina y el jengibre en un tazón grande.", "Derrita el azúcar, la mantequilla, el jarabe y la melaza en un bol en el microondas o en una cacerola a fuego lento. Vierta los ingredientes derretidos en la harina con los huevos y la leche y mezcle bien.", "Vierta la mezcla en la bandeja de horno preparada.", "Hornee durante 45 minutos hasta que estén dorados, pero aún suaves y pegajosos en la parte superior. Reduzca el horno a 130 ° C / 250 ° F / Gas 1 y hornee por otros 30 minutos hasta que esté firme al tacto.", "Deje que se enfríe antes de envolverlo firmemente en una película adhesiva. Almacene por lo menos de tres a cinco días para madurar."], "url": "www_bbc_co_uk_food_recipes_yorkshireparkin_83745", "title": "Yorkshire Parkin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "sal y pimienta negra recién molida", "8 huevos de gallinas camperas", "600 ml / 1 litro de leche", "55 g / 2 oz de goteo"], "method": ["Coloque la harina y un poco de sal y pimienta negra recién molida en un bol. Agregue los huevos, mezclando con un batidor, luego vierta gradualmente la leche, mezclándola lentamente para evitar que se formen grumos.", "Cubra el recipiente con film transparente y deje enfriar en la nevera durante la noche.", "Precalentar el horno a 220C / 425F / Gas 7.", "Ponga un poco del goteo en cuatro latas de pudín de Yorkshire antiadherentes. Coloque las latas en el horno hasta que estén calientes.", "Retire del horno y llene rápidamente los moldes con la mezcla. Regrese al horno y cocine durante 20-25 minutos.", "Baje el horno a 190C / 375F / Gas 5 y cocine por otros 10 minutos para colocar la parte inferior de los postres.", "Retirar del horno y servir."], "url": "www_bbc_co_uk_food_recipes_yorkshirepudding_81824", "title": "Pudín de Yorkshire clásico", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos", "Harina de 115g / 4oz", "275ml / ½ litro de leche", "goteo de carne", "sal"], "method": ["Mezcle los huevos, la harina y una pizca de sal.", "Agregue la leche, revolviendo constantemente, hasta que tenga un rebozado.", "Deje esto para descansar, cubierto, en el refrigerador por hasta 12 horas.", "Coloque 1 cm / ½ pulgada de goteo de carne de res en el fondo de cada molde de pudín, o si está utilizando una bandeja de tostado rectangular, coloque 1 cm / ½ pulgada de carne goteando en el fondo.", "Caliente el goteo en el horno (a 240 ° C / 460 ° F / Gas 8) durante aproximadamente diez minutos, hasta que esté caliente.", "Retire la bandeja de asar del horno, vierta la mezcla e inmediatamente regrese al horno. Hornee durante 25 minutos, hasta que estén dorados y crujientes, asegurándose de no abrir la puerta del horno durante los primeros 20 minutos."], "url": "www_bbc_co_uk_food_recipes_yorkshirepudding_93848", "title": "Yorkshire pudding", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshirepudding_93848_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "½ cucharadita de sal", "pizca de pimienta blanca", "1 cucharada de sebo triturado (opcional)", "2 huevos de gallinas camperas", "200ml / 7fl de leche en oz", "50 ml / 2 fl oz de agua", "aceite o grasa de res, para cocinar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Tamiza la harina en un tazón. Agregue la sal, la pimienta, el sebo (si está usando) y los huevos y bata con un tenedor para combinar.", "Mezcle la leche y el agua en una jarra, luego agregue gradualmente a la mezcla de harina y huevo, revolviendo constantemente, para crear una mezcla suave y cremosa.", "Deje la mezcla para reposar durante diez minutos.", "Vierta dos cucharadas de aceite o grasa de res en cada una de las tazas de una bandeja para muffins. Coloque la bandeja para muffins en el horno caliente y déjela durante 5-10 minutos, hasta que la grasa esté humeante.", "Retire con cuidado la bandeja para muffins del horno. Vierta aproximadamente 30ml / 1fl oz de masa en cada molde para muffins, luego vuelva cuidadosamente al horno para hornear por 10-15 minutos, hasta que se levante y dore. Resista la tentación de abrir el horno y controlar los postres durante al menos diez minutos, ya que esto obstaculizará su progreso.", "Retire del horno y sirva con el asado de su elección."], "url": "www_bbc_co_uk_food_recipes_yorkshirepuddings_86010", "title": "Pudines Yorkshire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshirepuddings_86010_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 3 oz de huesos de vaca (como costillas, costillas cortas, nudillos o huesos de los muslos)", "1-2 cucharadas de copos de sal marina", "2 cebollas grandes, peladas, cortadas en cuartos", "2 zanahorias, peladas, picadas", "2 tallos de apio, cortados, cortados por la mitad", "350 ml / 13 fl oz de cerveza ligera, preferiblemente de North Yorkshire", "1 bouquet garni (1 ramita de perejil, hojas de laurel y tomillo, atados con una cuerda de cocina)", "10 granos de pimienta negra", "4 dientes de ajo enteros sin pelar", "1 cucharadita de puré de tomate", "2 hojas de laurel", "1.5 litros / 2 pintas 12¾fl oz de agua", "4 cucharadas de harina normal", "½ cucharadita de sal", "2 huevos de gallinas camperas, golpeados", "275 ml / 10 fl oz de leche entera", "2 cucharadas de aceite vegetal o aceite de girasol, más extra para engrasar", "50 g / 2 oz de grasa de res, cortada en tiras finas (pregúntele a su carnicero por esto)", "1-2 cucharadas de copos de sal marina", "2 cebollas, peladas, finamente picadas", "1.5 litros / 2 pintas 12¾ fl oz de caldo de carne (ver arriba)", "1 cucharada de jalea de grosella", "175ml / 6fl oz cerveza (cerveza inglesa), preferiblemente de Yorkshire", "2 cucharaditas de harina común", "2 cucharaditas de agua", "", "12 salchichas individuales de morcilla (o 12 rebanadas de una morcilla grande), fritas hasta que estén crujientes"], "method": ["Para el caldo de carne, precalentar el horno a 230C / 450F / Gas 8.", "Coloque los huesos de carne en una bandeja de asar y espolvoree sobre los copos de sal. Asar en el horno durante 25-30 minutos, o hasta que esté bien dorado.", "Agregue las cebollas, las zanahorias y el apio a la bandeja de asar y vuelva al horno por otros 12-15 minutos, o hasta que las verduras se hayan dorado.", "Transfiera los huesos y verduras a una olla grande.", "Agregue la cerveza ligera a la bandeja de asar y cocine a fuego lento, raspando cualquier trozo dorado desde el fondo de la bandeja con una cuchara de madera para desglasar. Agregue la mezcla a la sartén.", "Agregue el bouquet garni, granos de pimienta, dientes de ajo, puré de tomate y hojas de laurel a la sartén y mezcle bien. Agregue el agua y lleve la mezcla lentamente a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante dos horas, eliminando cualquier grasa que se eleva a la superficie del líquido a intervalos regulares.", "Cuele el caldo en una sartén limpia y déjelo enfriar (quite la grasa restante antes de usar).", "Para el pudín de Yorkshire, disminuya la temperatura del horno a 220C / 425F / Gas 7.", "Tamiza la harina con la sal en un tazón y haz un pozo en el centro.", "Poco a poco agregue los huevos batidos al pozo y trabaje en el centro de la mezcla de harina poco a poco. Poco a poco bata la leche un poco a la vez hasta que la mezcla tenga la consistencia de una crema individual. Dejar de lado por lo menos una hora para descansar.", "Cuando el rebozado haya reposado durante una hora, vierta un poco de aceite en cada uno de los pocillos de una bandeja de pudín de Yorkshire de 12 hoyos.", "Calienta el aceite en el horno hasta que se caliente, luego rápidamente tres cuartas partes llenan cada pocillo con un poco de la pasta de budín de Yorkshire con un cucharón y regresa al horno. Hornee durante 25-30 minutos, o hasta que los postres Yorkshire hayan aumentado y estén dorados.", "Mientras tanto, para la salsa, coloque la grasa de res en rodajas en una sartén grande a fuego medio a alto y espolvoree sobre la sal. Freír por 2-3 minutos o hasta que la grasa comience a derretirse. (Retire las tiras de grasa que no se hayan derretido de la bandeja y deséchelas).", "Agregue las cebollas a la grasa caliente y fría por 4-5 minutos, o hasta que estén blandos. Agregue el caldo de carne y la cerveza y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante 15 minutos o por más tiempo si prefiere una salsa más espesa.", "Agregue la gelatina de grosella y mezcle bien hasta que se disuelva. Continúe cocinando a fuego lento por otros 4-5 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. (Nota: el caldo de carne que sobra puede guardarse para enfriarse, luego congelarse en bandejas de cubitos de hielo y conservarse por hasta seis meses).", "Para servir, coloque dos budines de Yorkshire en el centro de cada uno de los cuatro platos para servir. Arregle tres de las salchichas de morcilla entre los pudines de Yorkshire. Rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_yorkshirepuddingswit_92145", "title": "Budines de Yorkshire con morcilla y salsa de cerveza y cebolla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina", "½ cucharadita de sal", "¼ cucharadita de semillas de cilantro molido", "1 huevo (batido)", "300 ml / 10 fl oz de leche", "agua fría", "2 cucharadas de goteo", "Necesitarás latas de pudín de Yorkshire para esta receta."], "method": ["Tamiza la harina, la sal y el polvo de cilantro en un bol.", "Agregue los huevos batidos y la mitad de la leche. Batir bien durante 5 minutos o hasta que la masa esté suave.", "Batir la leche restante y suficiente agua fría para darle una consistencia espesa y cremosa.", "Deje la mezcla para reposar durante 30 minutos.", "Caliente goteando en latas de pudín de Yorkshire hasta que estén muy calientes. La grasa debe estar tan caliente que cuando se vierte la mezcla chisporrotea.", "Espolvoree unas gotas de agua fría en la mezcla y vierta en la grasa caliente (esto crea vapor y ayuda a que la mezcla se eleve).", "Cocine por 15-20 minutos en un horno precalentado 220C / 425F / Gas 7, hasta que se hinche y dore con un centro suave.", "Retirar del horno y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_yorkshirepuddingviap_9974", "title": "Pudín de Yorkshire (a través de Punjab!)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 10oz", "8 huevos medianos de granja", "sal y pimienta negra recién molida", "500ml / 1 pinta de leche entera", "100 g / 4 oz de goteo de carne", "30 g / 1¼ oz de mantequilla", "2 cebollas rojas, finamente cortadas", "2 dientes de ajo rallados", "200ml / 7fl oz de vino tinto", "1 litro / 2 pintas de caldo de res fresco", "2 ramitas de tomillo", "2 cucharadas de vinagre balsámico"], "method": ["Precalentar el horno a 220C / 430F / Gas 8.", "Coloque la harina, los huevos y el condimento en un procesador de alimentos.", "Encienda y mezcle para pegar antes de agregar la leche. Continúe procesando hasta que se forme una mezcla suave.", "Vierta en una jarra y coloque en la nevera para descansar. Esto funciona mejor si puede dejarlo durante la noche.", "Coloque las latas de Yorkshire en una bandeja para hornear, luego ponga la carne goteando en las latas y colóquela en el horno. Caliente durante 5-10 minutos hasta que esté caliente.", "Vierta la mezcla en las latas y hornee durante 10-15 minutos hasta que estén doradas y se eleven por los bordes.", "Mientras tanto, caliente una sartén hasta que esté caliente, luego agregue la mantequilla, las cebollas en rodajas y el ajo y cocine por 8-10 minutos hasta que estén tiernas pero no coloreadas.", "Agregue el vino tinto y reduzca a la mitad.", "Agregue el caldo de carne y déjelo hervir.", "Reduzca el fuego a fuego lento, agregue el vinagre balsámico y el tomillo y cocine durante 10-15 minutos.", "Sazone con sal y pimienta negro.", "Servir servido sobre el Yorkshire Pudding."], "url": "www_bbc_co_uk_food_recipes_yorkshirepuddingwith_83703", "title": "Pudín de Yorkshire con salsa de cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, triturados o finamente rallados", "1 naranja, cáscara y jugo solamente", "2 limas grandes, cáscara y jugo solamente", "2 cucharadas de salsa mexicana de chile picante", "2 cucharadas de puré de tomate", "1 cucharadita de orégano seco", "1 cucharadita de comino molido", "1 cucharadita de sal marina en copos o ½ cucharadita de sal fina", "1 cucharadita de pimienta negra recién molida", "6 filetes de muslo de pollo deshuesados ​​y sin piel, con guarnición de grasa", "4 tortillas de maíz, calentadas, para servir", "2 lechugas Little Gem, hojas separadas, enjuagadas y secas, para servir", "1 aguacate maduro (aproximadamente 150 g / 5½ oz), apedreado, pelado y rebanado, para servir", "crema agria o grasa cruda fraîche, para servir", "1 cebolla roja, finamente rebanada", "1 cucharada de vinagre de vino blanco o rojo", "1 cucharada de azúcar en polvo"], "method": ["Para hacer el adobo, coloque todos los ingredientes en un tazón grande y mezcle bien. Agregue el pollo y déle vuelta varias veces hasta que esté bien cubierto. Cubra el recipiente y colóquelo en el refrigerador para marinar durante 30-60 minutos.", "Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Cubra una bandeja grande para hornear con papel de hornear. Coloque el pollo marinado en la bandeja preparada.", "Cepille el pollo generosamente con más del adobo. Asar en el horno precalentado durante 20-25 minutos, o hasta que el pollo esté tierno y cocido y el adobo esté ligeramente carbonizado en algunos lugares. El pollo se cuece cuando los jugos se vuelven transparentes sin ningún rastro de rosa cuando la parte más gruesa del filete se perfora con un pincho.", "Mientras tanto, haz la cebolla roja en vinagre. Pon la cebolla en un tazón resistente al calor. Cubra con agua recién hervida y deje reposar durante 10 minutos. Escurrir bien y luego agregar el vinagre y el azúcar impalpable. Dejar reposar durante al menos 10 minutos antes de escurrir y servir.", "Transfiera el pollo a una tabla y triture en pedazos con dos tenedores. Para servir, coloque el pollo sobre las tortillas calentadas y cubra con la lechuga, el aguacate, la cebolla encurtida y la crema agria."], "url": "www_bbc_co_uk_food_recipes_yucatn_chicken_tacos_97105", "title": "Yucatán chicken tacos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yucatn_chicken_tacos_97105_16x9.jpg", "isVegetarian": false, "recommendations": 0}]