[{"ingredients": ["150g / 5½ oz de arroz con leche", "Crema doble 250ml / 9fl oz", "250ml / 9fl oz de leche entera", "2 cucharadas de azúcar en polvo de oro", "1 vaina de vainilla, dividida", "16 albaricoques secos", "1 ramita de canela", "½ limón sin cera", "2 cucharaditas de agua de rosas", "2 cucharaditas de agua de azahar", "50 g / 1¾oz de pistachos sin cáscara, más o menos picados", "2 cucharadas de pétalos de rosa de calidad alimentaria"], "method": ["Coloque el arroz en una sartén de tamaño medio y de base pesada, luego vierta la crema, la leche y el azúcar y agregue la vaina de vainilla.", "Llevar a ebullición a fuego medio, luego reducir el fuego hasta que la leche burbujee suavemente. Deje que hierva a fuego lento durante 25 minutos o hasta que esté tierno, revolviéndolo de vez en cuando.", "Llene otra sartén con 300ml / 10 fl oz de agua, agregue los albaricoques secos, la rama de canela y la mitad de limón. Llevar a ebullición y cocine a fuego lento durante 10 minutos.", "Cuando el arroz esté suave, retire la vaina de vainilla y agregue el agua de rosas y el agua de azahar.", "Divida el arroz con leche entre cuatro tazones. Coloque cuatro albaricoques en cada tazón con un poco del jugo de la sartén. Dispersar sobre los pistachos y unos pétalos de rosa y servir."], "url": "www_bbc_co_uk_food_recipes_lebanese_rice_pudding_16994", "title": "Pudín de arroz libanés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lebanese_rice_pudding_16994_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ puerro, limpio y finamente picado", "4 espárragos picados", "150ml / 5fl oz de caldo de verduras", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Caliente el aceite en una cacerola mediana a fuego medio. Agregue el puerro y los espárragos y saltee durante 2-3 minutos, para suavizar.", "Agregue el caldo de verduras, lleve a ebullición, luego reduzca el fuego a fuego lento durante 8-10 minutos, hasta que los espárragos estén cocidos.", "Transfiera a un procesador de alimentos, agregue la crema y mezcle hasta que quede suave.", "Regrese la sopa a la sartén, sazone, sazone, con sal y pimienta negra recién molida y cálida suavemente.", "Para servir, vierta en un tazón de sopa con el pan crujiente colocado en un plato al lado."], "url": "www_bbc_co_uk_food_recipes_leekandasparagussoup_80982", "title": "Sopa de puerros y espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 8¾oz de carne de cordero", "½ puerro, picado", "puñado de migas de pan", "½ cucharadita de pimentón", "½ cucharadita de copos de chile", "½ cucharadita de jengibre", "1 yema de huevo de gallinas camperas", "1 cucharada de aceite", "Ensalada de hierbas, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle todos los ingredientes a fondo y molde alrededor de tres pinchos.", "Caliente el aceite en una sartén y cocine los pinchos de cordero durante 1-2 minutos para sellar en todos los lados.", "Coloque en el horno durante diez minutos, hasta que estén dorados y cocidos.", "Sirve con una ensalada de hierbas."], "url": "www_bbc_co_uk_food_recipes_leekandlambkoftas_77205", "title": "Koftas de puerro y cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "½ cucharadita de sal", "1 cucharada de azúcar glas", "1 huevo de gallinas camperas, golpeado", "200 ml / 7 fl oz de agua", "75g / 3oz de mantequilla, picada", "75g / 3oz de manteca de cerdo, picada", "25g / 1oz de mantequilla", "1 kg / 2 lb 2 oz puerros, en rodajas finas", "2 ramitas de tomillo frescas, solo hojas", "Pata de cordero sin hueso de 450 g / 1 libra, cortada en trozos", "2 cucharadas de perejil de flatleaf fresco picado", "2 cucharadas de menta fresca picada", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "patatas nuevas, cocidas", "zanahorias chantenay, cocidas"], "method": ["Precalentar el horno a 225 C / 440 F / Gas 8.", "Coloque una bandeja de horno pesada en el horno para precalentar.", "Mezcle la harina, la sal y el azúcar glas en un tazón grande. Haga un pozo en medio de los ingredientes secos y vierta el huevo en él. Vierte una cantidad generosa de harina para cubrir el huevo.", "Coloque el agua, la mantequilla y la manteca de cerdo en una cacerola a fuego lento y deje que hierva lentamente.", "Poco a poco, vierta el líquido hirviendo en la mezcla de harina, revuelva con un cuchillo constantemente para combinar, luego amasar sobre una superficie limpia y enharinada hasta que el huevo esté completamente combinado y la masa esté suave. (NB: use la masa inmediatamente para hacer su pastel porque cuando la masa se enfríe se endurecerá y se volverá inmanejable).", "Corta un tercio de la masa y ponlo a un lado para la tapa. Extienda la masa restante en una forma redonda y redonda lo suficientemente grande como para forrar la base y los lados de una lata de torta de fondo suelto de 25 cm / 10 pulgadas, permitiendo un voladizo de unos 2 cm.", "Estire la masa para la tapa para que encaje en la parte superior del pastel y déjela a un lado.", "Para el relleno, caliente una sartén hasta que esté caliente, luego agregue la mantequilla, los puerros y el tomillo y fría a fuego lento durante 5-8 minutos, o hasta que los puerros estén tiernos. Poner a un lado y dejar enfriar un poco.", "Coloque el cordero en un procesador de alimentos junto con el perejil y las hojas de menta y pulse para cortar finamente. Sazonar bien con sal y pimienta negra recién molida.", "Extienda la mezcla de cordero en la caja de pastelería en una capa gruesa y luego extienda los puerros por la parte superior.", "Cepille los bordes de la masa con un poco de huevo batido. Coloque la tapa de la repostería sobre el relleno y pellizque y engarce los bordes de la caja y la tapa para sellar.", "Recorte cualquier exceso de pastel del pastel con un cuchillo filoso y use los bordes de los pasteles para hacer hojas decorativas para la parte superior del pastel.", "Cepille la parte superior del pastel con huevo batido y haga un agujero en el centro para permitir que escape el vapor. Coloque las hojas de hojaldre en la parte superior y cepíllelas con el huevo batido.", "Coloque en el horno para cocinar durante 15 minutos, luego reduzca la temperatura del horno a 180 ° C / 355 ° F / Gas 4 y continúe horneando durante una hora. Retirar del horno y dejar enfriar durante cinco minutos antes de servir.", "Para servir, corte una rodaja de pastel y coloque en un plato acompañado de patatas con mantequilla y zanahorias chantenay."], "url": "www_bbc_co_uk_food_recipes_leekandlambpiewithbu_85341", "title": "Pastel de puerro y cordero con patatas con mantequilla y zanahorias nuevas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 puerro, (solo blanco), picado", "50g / 1¾oz de champiñones castaños, picados", "100g / 3½ oz de arroz risotto", "50ml / 2fl oz de vino blanco", "300 ml / 10 fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "50g / 1¾oz de Dolcelatte", "sal y pimienta negra recién molida"], "method": ["Caliente la mantequilla y el aceite en una cacerola a fuego medio.", "Agregue la cebolla, el ajo, el puerro y el champiñón y freír durante dos minutos, o hasta que estén suaves.", "Agregue el arroz y el vino y deje que hierva. Baje el fuego ligeramente y cocine a fuego lento hasta que el vino se haya absorbido por completo.", "Agregue el caldo y cocine a fuego lento durante 12 minutos, o hasta que el caldo se haya absorbido y el arroz esté completamente cocido.", "Agregue la Dolcelatte y revuelva con una cuchara hasta que se derrita. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, cuchara sobre un plato de servir."], "url": "www_bbc_co_uk_food_recipes_leekandmushroomrisot_84317", "title": "Risotto de puerros y hongos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 puerros", "340 g / ¾lb de patatas", "1 cebolla picada", "1 diente de ajo, en rodajas finas", "30g / 1oz de mantequilla", "570ml / 1 pinta de agua", "1 hoja de laurel", "1 ramita de tomillo", "sal y pimienta negra recién molida", "100ml / 3½ fl oz de leche", "100ml / 3½ fl oz crema doble", "2 cucharadas de cebollín fresco, picado"], "method": ["Recorta y corta los puerros en rondas finas. Enjuague en un colador bajo agua fría.", "Pelar las papas y cortar en trozos.", "Derrita la mantequilla en una sartén y saltee suavemente la cebolla y el ajo.", "Agregue el puerro, las papas, la hoja de laurel y el tomillo. Temporada.", "Cubra con el agua y deje que hierva.", "Cocine a fuego lento durante 12 minutos hasta que las papas y los puerros estén tiernos.", "Retire la hoja de laurel.", "Justo antes de servir agregue la leche y la crema y revuelva a fuego lento, revise el condimento.", "Servir en tazones y espolvorear con las cebolletas."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_14556", "title": "Sopa de papa y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 cebolla, en rodajas", "Papas 225 g / 8 oz, en cubos", "2 puerros medianos, en rodajas", "1,2 litros / 2 pintas de caldo de verduras", "150ml / 5fl oz crema doble o crema fresca", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén grande y agregue las cebollas, las papas y los puerros. Cocine por 3-4 minutos hasta que comience a ablandarse.", "Agregue el caldo de verduras y deje que hierva. Sazonar bien y hervir a fuego lento hasta que las verduras estén tiernas.", "Whizz con una batidora de mano o en una licuadora hasta que quede suave. Vuelva a calentar en una sartén limpia, mezcle la crema o la crema fresca, caliente y sirva."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_1920", "title": "Sopa de papa y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leekandpotatosoup_1920_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ de patata, cortada en cubitos", "¼ de puerro, en rodajas", "1 cucharada de mantequilla", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "puñado de cebolletas frescas, picadas"], "method": ["Coloque todos los ingredientes, excepto el cebollín, en una cacerola y cocínelos durante 15 minutos o hasta que estén cocidos.", "Agregue las cebolletas y sirva."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_75793", "title": "Sopa de papa y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ patata, pelada y cortada en cubitos", "1 diente de ajo, pelado y cortado en cubitos", "1 puerro, cortado en cubitos", "55ml / 2fl oz de vino blanco", "150ml / 5fl oz de caldo de verduras", "Crema doble 55ml / 2fl oz", "sal y pimienta negra recién molida", "1 rebanada de pan", "35 g / 1½ oz de queso azul"], "method": ["Calentar el aceite en una cacerola y freír la papa y el ajo durante 3-4 minutos, para ablandar.", "Agregue los puerros y cocine por unos minutos más.", "Agregue el vino con el caldo y la crema, luego reduzca el fuego y cocine a fuego lento durante 10-12 minutos, o hasta que las papas estén tiernas.", "Usando una licuadora de mano, mezcle la sopa hasta que quede suave y sazone al gusto.", "Para servir, tueste el pan en un lado, debajo de una parrilla caliente, hasta que se dore. Dar la vuelta y poner el queso azul en la parte superior. Regrese a la parrilla y cocine hasta que se derrita y se dore.", "Sirva la tostada de queso encima de la sopa."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_79045", "title": "Sopa de papa y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ puerro, finamente picado", "1 diente de ajo, finamente picado", "ramita de tomillo fresco, solo hojas", "½ cubo de verduras, desmenuzado", "150ml / ¼ litro de leche", "1 patata pequeña, pelada y picada", "1 cucharada de crema doble", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas, para servir"], "method": ["Caliente el aceite de oliva en una olla pequeña, agregue el puerro y saltee durante 3-4 minutos, hasta que se ablande. Agregue el ajo y el tomillo y fría por un minuto más.", "Agregue la mitad del cubo común, la leche y la papa. Llevar a ebullición, reducir el fuego y cocinar a fuego lento durante 6-8 minutos, o hasta que la papa esté tierna.", "Agregue la crema, condimente, al gusto, con sal y pimienta negra recién molida y deje que se enfríe un poco.", "Vierta la sopa en un procesador de alimentos y mezcle hasta que quede suave. Si es necesario, vuelva a calentar suavemente la sopa antes de servirla.", "Para servir, vierta la sopa en un tazón o taza de cappuccino y espolvoree cebollino."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_85731", "title": "Sopa de papa y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla sin sal", "½ cebolla, finamente rebanada", "1 diente de ajo, picado", "1 puerro, cortado y picado", "1 patata, pelada y picada", "150ml / 4½fl oz de caldo de verduras calientes", "50 g / 2 oz de tocino lardons o tocino ahumado picado", "1 diente de ajo, picado", "1 cucharadita de pimentón ahumado", "sal y pimienta negra recién molida", "ramita perifollo fresco, para adornar"], "method": ["Para la sopa de puerros y papas, caliente la mantequilla en una sartén y saltee la cebolla, el ajo y el puerro hasta que se ablanden.", "Agregue la papa y el caldo y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante diez minutos, o hasta que la papa esté tierna. Retirar del fuego y dejar enfriar ligeramente.", "Vierta la sopa en una licuadora y mezcle hasta que quede suave.", "Para la grasa de cerdo picante, caliente la grasa de cerdo en una sartén con el ajo y el pimentón. Sazonar con sal y pimienta negra recién molida y freír suavemente hasta que la grasa se haya secado y la textura esté crujiente. Retire los trozos de grasa con una espumadera y escurra sobre papel de cocina.", "Para servir, vierta la sopa en un tazón, cubra con la grasa de cerdo picante y adorne con perifollo."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_85929", "title": "Sopa de papa y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pollos, cortados en porciones", "1 puerro, más o menos picado", "1 barra de apio, más o menos picada", "1 cebolla, más o menos picada", "1 cabeza de ajo, cortada por la mitad transversal", "Ramita de tomillo", "1 hoja de laurel", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 cebolla pequeña, finamente picada", "4 puerros grandes, finamente cortados", "2 patatas grandes, peladas y cortadas en cubos", "1 bouquet garni", "8 ostras de roca pequeñas", "250ml / 9fl oz de caldo de pescado", "cebollines cortados, para adornar"], "method": ["Primero haga el caldo de pollo. Coloque los pollos, las verduras picadas, el ajo y las hierbas en una sartén grande. Cubra con agua fría y lleve a ebullición. Elimine cualquier grasa que suba a la superficie, luego deje hervir a fuego lento durante 1½-2 horas.", "Cuele el caldo a través de un colador colocado en un recipiente, luego páselo por un colador. Necesitas 700 ml / 1¼ pintas de caldo para la sopa; guarde el resto para otro uso.", "Retire las 'ostras' (la pequeña pieza de carne con forma de ostra que está sobre el muslo) de las partes posteriores del pollo y déjelas a un lado para usarlas más tarde como guarnición. Deseche todos los contenidos restantes del colador.", "Para la sopa, derrita la mantequilla con el aceite de oliva en una olla. Agregue la cebolla y cocine lentamente sin colorear. Después de un par de minutos agregue los puerros, luego cubra y sude por unos cinco minutos a fuego lento. No permita que las verduras se coloreen.", "Agregue las papas y bouquet garni y cocine sin tapar durante dos minutos, luego vierta el caldo caliente. Llevar a ebullición y cocinar hasta que las papas estén suaves.", "Retire el bouquet garni, luego cuidadosamente rellene la sopa en un procesador de alimentos o licuadora. Viértalo en un bol y póngalo sobre hielo para que se enfríe. Enfríe en el refrigerador hasta que esté listo para servir.", "Retire las ostras de roca de sus caparazones y poche ligeramente en el caldo de pescado. Escurrir y dejar enfriar.", "Para servir, coloque las ostras de mar y las \"ostras\" de pollo en grandes cuencos de sopa y ponga la sopa en la parte superior. Termine con una pizca de cebollino."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoupwit_81984", "title": "Sopa de puerros y patatas con ostras escalfadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, pelada, cortada en cubitos", "1 zanahoria, pelada, cortada en cubitos", "4 tallos de apio, cortados en cubitos", "2 puerros, cortados en cubitos", "1 manojo de perejil fresco, solo tallos", "1 cabeza de ajo, roto en clavos", "1 bouquet garni", "Lengua de buey de 2 kg / 4 lb 6½ oz", "1 cucharadita de aceite vegetal", "150 g / 5¼ oz de mantequilla sin sal", "2 cebollas, peladas, finamente cortadas", "4 puerros, en rodajas finas", "3 papas medianas, peladas, finamente cortadas", "4 huevos de gallina, escalfados", "100 g / 3½ oz de puerros, solo parte blanca, finamente rebanada", "botón de mantequilla", "100g / 3½oz de papa, pelada, cortada en cubos de 2cm / 1in, hervida hasta que esté tierna, escurrida"], "method": ["Para la lengua de buey, coloque las verduras, los tallos de perejil, el ajo y el bouquet garni en una cacerola grande. Cubra con agua y lleve a ebullición.", "Agregue la lengua de buey, reduzca el fuego y cocine a fuego lento durante 4 horas, o hasta que la carne esté tierna.", "Retire con cuidado la lengua de la sartén. Retire la piel y cualquier glándula o exceso de grasa y cartílago. Haga a un lado para descansar en la nevera durante al menos 30 minutos, luego, corte la lengua en cubos.", "Calentar una sartén hasta que esté caliente, agregar los cubos de lengua y freír hasta que estén dorados y crujientes por todos lados.", "Mientras tanto, para la sopa de puerros y patatas, derrita la mantequilla en una cacerola sobre fuego suave, hasta hacer espuma. Freír las cebollas durante 4-5 minutos, o hasta que se ablanden.", "Agregue los puerros y freír durante 2-3 minutos más. Agregue las papas y cubra con 1 litro / 1 pizca de agua a 15¼ fl oz. Llevar la mezcla a ebullición y cocinar por 10-15 minutos, o hasta que las papas estén tiernas.", "Retire la sartén del fuego y mezcle la mezcla en una licuadora hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, caliente la mantequilla en una sartén y fría los puerros por 4-5 minutos, o hasta que se ablanden. Sazonar, probar con sal y pimienta negra recién molida.", "Vierte un poco de puerro frito y papa cocida en cada uno de los 4 tazones para servir y encima un huevo escalfado. Coloque la sopa alrededor del huevo y cubra con la lengua de buey crujiente."], "url": "www_bbc_co_uk_food_recipes_leekandpotatosoupwit_93783", "title": "Sopa de puerros y patatas con crujiente lengua de buey y huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 200 g / 7 oz, tamizada, más extra para dragado", "pizca de sal", "4 huevos de gallinas camperas", "Leche 400ml / 14fl oz", "150ml / 5½fl oz de agua", "100 g / 3½ oz de mantequilla, derretida", "aceite vegetal, para freír", "2 huevos de gallinas camperas, golpeados", "125g / 4½ oz de polenta (harina de maíz)", "50g / 2oz de mantequilla", "250 g / 9 oz de puerros, cortados en rodajas", "150g / 5½oz de queso ahumado, rallado", "1 cucharada de tomillo fresco picado", "1 cucharada de salvia fresca picada", "100g / 3½oz de guisantes congelados", "100g / 3½ oz de ricotta", "1 cebolla roja, pelada, picada", "1 pepino, picado", "12 tomates cherry, picados", "200ml / 7fl oz de puré de tomate", "1 chile rojo, finamente picado", "50ml / 2fl oz de vinagre de jerez"], "method": ["Para los panqueques, tamiza la harina y la sal en un tazón grande y haz un pozo en el centro. Rompe los huevos en el pozo, luego mezcla los huevos en la harina con un tenedor. Poco a poco agregue la leche y el agua a la mezcla, batiendo continuamente, hasta que la mezcla esté suave y tenga la textura de crema doble. Finalmente, bate la mantequilla.", "Caliente una llovizna de aceite en una sartén antiadherente de 18cm / 7pulg a fuego alto hasta que fume, luego baje la temperatura a medio. Con una cuchara, coloque alrededor de dos cucharadas de la masa de panqueque en la sartén, agitándola para cubrir uniformemente el fondo de la sartén.", "Cocine por unos 30 segundos, luego voltee el panqueque y cocine por otros 15-20 segundos, o hasta que esté cocido. Coloque el panqueque en un plato forrado con papel resistente a la grasa, luego coloque otra capa de papel antigrasa en la parte superior. Repita el proceso de cocción con la masa de panqueque restante, añadiendo más aceite a la sartén si es necesario, y asegurándose de que cada panqueque quede entre dos capas de papel antigrasa para evitar que se peguen entre sí. Dejar de lado.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, derrita la mantequilla en una sartén hasta que haga espuma, luego fría los puerros durante 4-5 minutos, o hasta que se ablanden. Escurrir bien, luego colocar en un recipiente.", "Agregue el queso ahumado, el tomillo, la salvia, los guisantes y la ricota al cuenco de puerros y mezcle hasta que estén bien combinados.", "Extienda tres cucharadas de relleno sobre un panqueque. Enrolle la parte inferior, luego los dos lados; ruede el panqueque hacia arriba para formar una forma cilíndrica como un rollo de primavera. Repita con el relleno restante y panqueques.", "Separe cada rollo de panqueque en harina, luego sumerja en el huevo batido y ruede en la polenta para cubrir.", "Calentar un chorrito de aceite en una sartén y freír los rollos de panqueque durante 3-4 minutos en cada lado, o hasta que estén dorados por todas partes. Coloque los panqueques en el horno para cocinar durante 10-12 minutos, o hasta que estén bien calientes. Dejar de lado.", "Para la salsa, mezcle todos los ingredientes de la salsa en un tazón.", "Para servir, coloque los rollos de panqueques en los platos para servir con la salsa en tazones pequeños al lado para mojarlos."], "url": "www_bbc_co_uk_food_recipes_leekandsmokedcheesep_91738", "title": "Panqueques de puerro y queso ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de masa de pasta brisa lista para usar", "50g / 2oz de mantequilla", "750g / 1lb 10½ oz de puerros cortados en rodajas finas", "5 ramitas de tomillo fresco, solo hojas", "Crema doble de 200 ml / 7 fl oz", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida", "200 g / 7 oz de salmón ahumado", "Queso gruyere 75g / 3oz, rallado", "1 cucharada de mostaza integral", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "2 lechugas Little Gem, hojas recortadas por separado", "50g / 2oz de berro"], "method": ["Para la tarta, precalentar el horno a 200C / 400F / Gas 6.", "Sobre una superficie ligeramente enharinada, extienda la masa para forrar una lata agria de fondo suelto de 20cm / 8in de diámetro, 2.5cm / 1in. Cubra el interior de la lata con la masa, luego cubra y enfríe en la nevera durante 30 minutos.", "Retire la caja de tarta de la nevera. Alinee la caja de tarta de hojaldre con papel antigrasa y llénela con alubias para hornear o arroz sin cocer. Hornee a ciegas en el horno por 15 minutos.", "Retire los frijoles para hornear o el arroz y el papel resistente a las grasas y devuelva la caja para tartas al horno durante otros 5-6 minutos, o hasta que esté recién cocida y se ponga dorada.", "Reduzca la temperatura del horno a 180C / 360F / Gas 4.", "Mientras tanto, derrita la mantequilla en una sartén grande a fuego lento. Agregue los puerros y freír hasta que estén suaves. Retirar del fuego y dejar enfriar.", "Coloque la crema, el huevo y la yema de huevo en un tazón y bata para combinar.", "Agregue la mezcla de huevo y crema a los puerros fríos y mezcle bien. Sazonar bien con sal y pimienta negra recién molida.", "Vierta la mezcla de puerros en la caja de pastelería cocida.", "Coloque el salmón ahumado sobre el relleno de la mezcla de puerros, para cubrir completamente el relleno.", "Espolvoree el gruyère rallado sobre la capa de salmón ahumado. Hornee en el horno durante 20 minutos, o hasta que el relleno esté recién hecho y la parte superior esté dorada.", "Para la ensalada, mezcle la mostaza, el vinagre y el aceite de oliva en un bol. Agregue las Pequeñas Gemas y el berro y mezcle bien.", "Para servir, coloque una rebanada de tarta en cada plato y coloque una porción de ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_leekandsmokedsalmont_89896", "title": "Tarta de salmón ahumado y puerro con ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, picada", "½ puerro, parte blanca solamente, en rodajas", "½ batata, pelada y en rodajas", "2 cucharadas de vino blanco", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite y la mantequilla en una sartén a prueba de horno a fuego medio. Freír la cebolla y el puerro por 3-4 minutos, o hasta que se ablanden. Agregue la batata y fría por otros dos minutos.", "Agregue el vino y cocine a fuego lento durante 1-2 minutos hasta que el líquido se haya reducido. Agregue la crema, sazone al gusto con sal y pimienta negra recién molida, y mezcle bien.", "Transfiera la sartén al horno y cocine durante 10-12 minutos, o hasta que las papas estén cocidas y la crema burbujee.", "Para servir, cuchara sobre un plato de servir y servir inmediatamente como guarnición."], "url": "www_bbc_co_uk_food_recipes_leekandsweetpotatogr_89400", "title": "Gratinado de puerros y camotes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 puerros medianos, cortados", "12 cebollas de primavera, recortadas", "750ml / 1 pinta 6fl oz de caldo de verduras", "1 hoja de laurel", "3 hojas de gelatina", "sal y pimienta negra recién molida", "2 cucharadas de perifollo fresco picado", "1 cucharadita de mostaza inglesa", "2 cucharaditas de vinagre de vino blanco", "½ limón, solo jugo", "250ml / 9fl oz de aceite de colza", "sal y pimienta negra recién molida", "750g / 1lb 10oz de jamón cocido, en rodajas, para servir"], "method": ["Para la terrina, coloque los puerros y las cebolletas en una sartén ancha y poco profunda con el caldo de verduras y la hoja de laurel. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 8-10 minutos, o hasta que las verduras estén tiernas. Retire las verduras de la sartén y déjelas a un lado.", "Regrese la sartén al fuego y hierva para reducir el volumen del caldo en dos tercios.", "Mientras tanto, remoje las hojas de gelatina en agua fría hasta que se ablanden. Colar, luego agregar al stock reducido. Batir para combinar, luego colar en un bol. Deje que se enfríe, luego sazone con sal y pimienta negra recién molida y agregue el perifollo.", "Coloque en la nevera y deje enfriar durante 30 minutos, o hasta que esté listo, pero aún con un buen bamboleo.", "En una superficie de trabajo, coloque tres hojas grandes de película adhesiva una encima de la otra. Coloque los puerros en una fila en la película adhesiva, luego cubra con las cebolletas.", "Cuchara sobre la gelatina, luego enrolle la película adhesiva en una gran forma de cigarro, girándola firmemente para encerrarla en ambos extremos. Coloque en el refrigerador durante al menos una hora hasta que esté completamente listo.", "Para el aderezo, mezcle la mostaza, el vinagre y el jugo de limón en un tazón. Batir lentamente el aceite de colza y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, corte la terrina en trozos y colóquela en platos para servir con algunas rebanadas de jamón y una llovizna de aderezo."], "url": "www_bbc_co_uk_food_recipes_leekandspringonionte_86658", "title": "Terrina de puerros y cebolla de primavera con jamón asado y aderezo de mostaza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 hoja de pasta de filo lista para usar", "25g / 1oz de mantequilla, derretida", "1 cucharada de aceite de oliva", "¼ de puerro, finamente cortado", "2 yemas de huevo de gallinas camperas", "2 cucharadas de crema doble", "1 cucharada de cebolletas frescas picadas, más extra para servir", "sal y pimienta negra recién molida", "30g / 1oz Stilton, desmenuzado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cepille la masa de filo con mantequilla, dóblela por la mitad y presione el anillo de un cocinero en una bandeja para hornear. Cepille con más mantequilla, luego transfiera al horno y hornee durante ocho minutos, o hasta que estén doradas.", "Mientras tanto, caliente el aceite de oliva en una sartén pequeña, agregue el puerro y saltee durante 3-4 minutos, hasta que se suavice. Dejar enfriar un poco.", "Coloque los huevos, la crema y el cebollín en un bol, sazone con sal y pimienta negra recién molida y mezcle bien. Agregue los puerros al tazón y revuelva para combinar.", "Retire la caja de pasta filo del horno, vierta la mezcla de huevo y cubra con el Stilton. Regrese al horno y hornee durante 8-10 minutos, o hasta que se haya establecido el llenado.", "Para servir, coloque la tarta en un plato, retire el anillo de los chefs y espolvoree cebollino picado."], "url": "www_bbc_co_uk_food_recipes_leekandstiltontart_85730", "title": "Tarta de puerro y Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, picada", "1 diente de ajo, finamente picado", "200g / 7oz de papas nuevas, picadas", "85g / 3oz de puerros tiernos, en rodajas", "300 ml / 10 fl oz de pollo caliente o caldo de verduras", "85g / 3oz de queso Lanark Blue, u otro queso azul, para servir"], "method": ["Caliente el aceite y la mantequilla en una sartén y fríe con cuidado la cebolla y el ajo durante unos minutos, hasta que se ablanden.", "Agregue las papas y los puerros y continúe freír durante otros 3-4 minutos.", "Agregue el caldo y caliente a fuego lento. Cocine a fuego lento durante 10-12 minutos, o hasta que las papas estén tiernas.", "Servir en un tazón, con el queso azul desmenuzado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_leekbluecheeseandpot_88555", "title": "Sopa de puerro, queso azul y papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ puerro, finamente cortado", "1 diente de ajo, finamente picado", "¼ de cebolla, finamente picada", "150ml / ¼ pinta de caldo de verduras calientes", "1 cucharada de crema doble", "sal y pimienta negra recién molida", "1 rebanada de chapata, a la plancha", "aceite de oliva, a llovizna"], "method": ["Caliente el aceite en una olla pequeña, agregue el puerro, el ajo y la cebolla y saltee suavemente durante 3-4 minutos. Agregue el caldo y cocine a fuego lento durante cinco minutos. Retirar del fuego y dejar enfriar ligeramente.", "Vierta en una licuadora, agregue la crema y sazone bien con sal y pimienta negra recién molida. Mezclar hasta que esté suave.", "Para servir, vierta en un recipiente y cubra con la chapata a la plancha y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_leekonionandgarlicso_86202", "title": "Sopa de puerro, cebolla y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]