[{"isVegetarian": false, "title": "Lamb koftas with spiced yoghurt", "url": "www_bbc_co_uk_food_recipes_lambkoftaswithspiced_80781", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz wheatgerm", "250g/10½oz lean lamb mince", "1 free-range egg", "1 onion, finely chopped", "1 tbsp pine nuts, finely chopped", "2 tbsp finely chopped fresh parsley ", "1 tsp olive oil, for frying", "1 red chilli, seeds removed and finely chopped", "1 tbsp finely chopped fresh mint ", "1 tbsp finely chopped fresh parsley ", "1 tbsp finely chopped fresh coriander ", "1 clove garlic, crushed", "½ tsp ground cumin", "200g/7oz low-fat Greek-style yoghurt"], "serves": "Serves 3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Place the wheat germ into a large bowl and cover with cold water. Leave to stand for ten minutes, then drain and pat dry with kitchen towels to remove excess water.", "Place the wheat germ, lamb mince, egg, onion, pine nuts and parsley into a large bowl and mix together well. Roll small lumps of the lamb mixture into small balls, the size of a golf ball and place onto a greased baking sheet, cover with cling film and place into the fridge to chill for 30-45 minutes.", "Meanwhile, for the spiced yoghurt, place the chilli, mint, parsley, coriander, garlic, cumin and yoghurt into a clean bowl and mix thoroughly.", "Heat a tablespoon of oil in a large frying pan over a medium heat. Add the kofta balls and fry, turning regularly, until browned and cooked all the way through.", "To serve, divide the hot kofta balls between three plates and top with a dollop of the spiced yoghurt."]}, {"isVegetarian": false, "title": "Lamb neck fillet tagine with tabbouleh", "url": "www_bbc_co_uk_food_recipes_lambneckfillettagine_91764", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp ras-el-hanout", "½ tsp ground cinnamon", "½ tsp ground ginger", "½ tsp smoked sweet paprika", "½ tsp ground cumin", "¼ tsp freshly ground black pepper", "¼ tsp ground turmeric", "3 tbsp olive oil", "1kg/2lb 3oz lamb neck fillet, cut into large chunks", "1 onion, thickly sliced", "2 cloves garlic, peeled, finely chopped", "1 x 400g/14oz tin chopped tomatoes", "2 tbsp pomegranate molasses (available from Middle Eastern grocers and some supermarkets)", "½ tsp saffron", "350ml/12fl oz chicken stock", "125g/4½oz stoneless dried apricots, halved", "110g/4oz green olives, stones removed", "75g/2½oz whole almonds", "1 small bunch fresh coriander", "salt and freshly ground black pepper", "175g/6oz bulgar wheat", "700ml/1 pint 5fl oz chicken stock", "2 small red onions, peeled, finely chopped", "300g/10½oz pistachio nuts, shells removed, roughly chopped", "1 lemon, juice only", "3 tbsp extra virgin olive oil", "5 tbsp chopped fresh flatleaf parsley ", "5 tbsp chopped fresh coriander leaves", "5 tbsp chopped fresh mint ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb tagine, mix the ras-el-hanout, ground cinnamon, ground ginger, smoked sweet paprika, ground cumin, freshly ground black pepper and ground turmeric together in a bowl. Add the lamb neck fillet pieces and turn in the mixture to evenly coat. ", "Heat a large pan until smoking, then add a tablespoon of the olive oil and sear the neck fillet pieces on all sides for 2-3 minutes, or until golden-brown all over. Remove the lamb pieces from the pan and set aside", "Add the remaining olive oil to the same pan and fry the onions and garlic for 2-3 minutes, or until softened. Add the lamb pieces back to the pan and stir well, then add all of the remaining tagine ingredients except for the coriander and salt and freshly ground black pepper and bring to a simmer. ", "Chop the coriander, reserving the leaves for later, and add the stalks to the pan. Reduce the heat, cover the pan with a lid and allow to simmer for one hour and 30 minutes, or until the lamb is tender. ", "Remove the lid and cook for a further 30 minutes, or until the tagine is slightly thickened. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the tabbouleh, place the bulgar wheat into a pan with the chicken stock, bring to the boil then reduce the heat to a simmer. Cover the pan with a lid and cook for 15-20 minutes over a low heat. When the bulgar wheat is tender, drain off the excess stock.", "Remove from the heat and allow to cool slightly, then transfer the bulgar wheat to a bowl. Add the red onion, pistachios, lemon juice, olive oil and herbs and mix well. Season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the tabbouleh among four serving plates, then spoon the lamb neck fillet tagine alongside. Chop the reserved coriander leaves and sprinkle over the tagine."]}, {"isVegetarian": false, "title": "Lamb patties with honey and chilli onions", "url": "www_bbc_co_uk_food_recipes_lambpattieswithhoney_83929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz lamb steak, fat trimmed and roughly chopped", "½ small red onion, finely chopped", "handful fresh mint, chopped", "salt and freshly ground black pepper", "1 tbsp plain flour", "2 tbsp olive oil", "1 tbsp olive oil", "1 red onion, cut into rings", "½ jar of marinated artichokes, drained", "2 tbsp honey ", "½ tsp dried chilli flakes"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, place the meat into a food processor with the onion and mint and season with salt and freshly ground black pepper. Pulse to mix but not over blend to a paste.", "Transfer the lamb mixture to a bowl and use the flour to bind and form into four patties. Place into the fridge yo chill while you make the onions.", "For the onions, heat the oil in a small frying pan and add the onions. Cook gently for three minutes. Add the artichokes and continue to cook, covered for five minutes.", "Add the honey and chilli flakes and cook uncovered over a high heat for three minutes.", "Meanwhile heat the oil for the lamb in a frying pan. Add the lamb and cook for three minutes on each side, or until cooked through.", "To serve, place the lamb onto a plate and top with the onions."]}, {"isVegetarian": false, "title": "Lamb pasanda", "url": "www_bbc_co_uk_food_recipes_lambpasanda_74035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/17½oz boned leg of lamb", "100g/3½oz ghee (clarified butter)", "4 cinnamon sticks, each 4cm (1¾in) long", "4 black cardamoms", "200g/7¼oz flour, approx", "50ml/1¾fl oz water, or enough to bind into a slack dough", "8 dried figs, soaked in water, to cover", "3 tbsp khoya (dried reduced milk), available from ethnic grocers", "1 tbsp raisins, soaked in water, to cover", "½ tsp saffron strands, soaked in 3 tbsp warm water", "150ml/5¼fl oz plain yoghurt", "3 onions, sliced and shallow-fried in oil until golden brown", "4cm/1¾in piece of fresh root ginger, peeled and grated", "6 garlic cloves", "2 tsp salt, or to taste", "2 tsp red chilli powder", "4 tsp garam masala", "2 tsp ground cumin", "1 tsp freshly ground cardamom seeds", "1 tbsp chopped coriander, to garnish", "naan bread, warmed", "meat mallet"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Remove all the white membranes from the surface of the meat.", "Using a sharp knife, cut the meat into 5cm (2in) squares, about 1cm (½in) thick.", "Place these escalopes between sheets of cling film and beat them out with a meat mallet or rolling pin until the lamb has been flattened into thin pieces.", "Tip all the marinade ingredients into a food processor and blend until smooth.", "Coat the escalopes with the marinade, making sure the meat is completely covered with the masala spice mix. Set aside for at least one hour.", "Heat the clarified butter in a heavy-bottomed casserole pan, wide enough to take the meat in one layer.", "Add the cinnamon sticks and black cardamoms and let them sizzle for a few seconds before adding the marinated meat with its liquid. ", "Cover the pan with a tightly-fitting lid and seal the edges with a flour and water paste (this helps to retain all the flavours in the pot as the meat cooks).", "Simmer on a very low heat for an hour until the sauce has reduced and the meat is tender.", "Remove the lid from the pan. If there's too much liquid, cook the sauce down until there's a thin film of oil on top.", "Scatter with chopped coriander and serve straight away with warm naan bread."]}, {"isVegetarian": false, "title": "Lamb, pepper and pineapple kebabs with lime, chilli and coriander mayonnaise", "url": "www_bbc_co_uk_food_recipes_lambpepperandpineapp_91704", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambpepperandpineapp_91704_16x9.jpg", "ingredients": ["175ml/6fl oz pineapple juice", "4 tbsp malt vinegar", "115g/4oz molasses sugar", "salt and freshly ground black pepper", "750g/1lb 10oz lamb neck fillet, fat trimmed, cut into 3cm/1¼in cubes", "2 large red peppers, seeds removed, cut into 3cm/1¼in squares", "2 large green peppers, seeds removed, cut into 3cm/1¼in squares", "2 red onions, peeled, chopped into 3cm/1¼in wedges", "1 fresh pineapple, skin and core removed, flesh cut into quarters, then chopped", "3 large bananas (not too ripe), peeled, chopped", "sunflower or groundnut oil, for brushing", "2 free-range egg yolks ", "1 tsp Dijon mustard", "salt and freshly ground black pepper", "1 large garlic clove, crushed to a paste with the edge of a knife ", "1 lime, juice only", "290ml/9¾fl oz sunflower or light olive oil ", "1 red chilli, seeds removed (half reserved), shredded ", "small bunch coriander, leaves only, finely chopped ", "5-6 flatbreads", "½ iceberg lettuce, shredded"], "serves": "Makes 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, in a glass or ceramic bowl, mix the pineapple juice, vinegar, molasses sugar and seasoning together until smooth and well combined. ", "For the kebabs, rinse the lamb neck fillet and pat dry with kitchen paper. Place the lamb into an ovenproof glass or ceramic dish and pour over half of the marinade mixture. Cover the dish and chill in the fridge for between one and four hours. ", "Meanwhile, for the lime, chilli and coriander mayonnaise, in a bowl, beat together the egg yolks, mustard, salt and freshly ground black pepper, garlic and half of the lime juice until well combined.  ", "Gradually add the oil in a thin stream, whisking contiuously, until the mixture thickens and all of the oil has been incorporated into the mixture.", "Stir in the shredded chilli and reserved chilli seeds, chopped coriander and the remaining lime juice. Mix until well combined, then chill in the fridge until needed.   ", "Soak twelve wooden skewers in cold water for at least 30 minutes, then shake off any excess moisture.", "When the meat has marinated, thread alternate pieces of red and green pepper, onion, pineapple, banana and marinated lamb onto the soaked skewers to make 10-12 kebabs. Leave 3-5cm/1-2in free at one end of each skewer with which you can grip the skewers. Brush the kebabs all over with the oil. ", "Heat a griddle pan over a high heat. When the pan is very hot, add the kebabs, in batches if necessary, and fry for 8-10 minutes, basting at intervals with the remaining marinade and turning regularly. (NB: The kebabs can also be barbecued or grilled under a medium hot grill, if desired.)", "To serve, stuff the flatbreads with the lettuce and drizzle in a little of the lime, chilli and coriander mayonnaise. Sandwich two kebabs inside each flatbread."]}, {"isVegetarian": false, "title": "Lamb rack in hot pepper paste with sesame spinach", "url": "www_bbc_co_uk_food_recipes_lambrackinjapaneseho_86628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz hot pepper paste or gochugang (Korean chilli bean paste; available from Asian supermarkets)", "75ml/3fl oz sake", "25ml/1fl oz soy sauce", "75ml/3fl oz mirin (available from Asian supermarkets)", "pinch dried chilli", "40g/1½oz garlic paste (available from Asian supermarkets), or four garlic cloves, pounded to a paste", "40g/1½oz ginger paste (available from Asian supermarkets), or thumb-sized piece of ginger, pounded to a paste", "2 tsp toasted sesame oil", "4 x 4 bone lamb racks, French cut (ask your butcher to prepare this for you)", "1 tbsp olive oil", "1 tbsp toasted sesame seeds", "60g/2½oz sesame paste or tahini", "10g/½oz sweet white miso (available from Asian supermarkets and health food shops)", "1 tsp ginger juice (grate the ginger and squeeze to collect the juice)", "3 tbsp dashi stock (dried sachets of dashi are available from Asian supermarkets, add the appropriate amount of water, following packet instructions)", "2 tsp rice vinegar", "1½ tsp lemon juice", "2 tsp sesame oil", "500g/1lb2oz spinach leaves", "1 tsp chopped yama gobo/Japanese burdock root (available from Asian supermarkets)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the lamb, place the hot pepper paste, sake, soy, mirin, dried chilli, garlic, ginger and toasted sesame oil into a bowl and whisk together to form a smooth paste.", "Wrap the lamb bones in small pieces of tin foil and pinch tight to prevent them burning.", "Lightly brush the lamb racks with half of the hot pepper marinade (reserving the rest for later) and place the lamb onto a tray. Transfer to the fridge to marinate overnight, preferably for 24 hours. Allow to return to room temperature before cooking.", "Preheat the oven to 180C/365F/Gas 4.", "Heat a large ovenproof frying pan until hot and add the olive oil and marinated lamb. Cook on each side until golden-brown all over, then brush all over with some more of the marinade (reserve a little marinade for serving).", "Transfer to the oven and cook for 10-12 minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place for five minutes.", "For the sesame spinach, place the sesame seeds, sesame paste, sweet white miso, ginger juice, dashi stock, rice vinegar, lemon juice and sesame oil into a bowl and whisk together to combine.", "Heat a frying pan until hot, then add the spinach and cook until just wilted.", "Add the yama gobo and the sesame dressing mixture and mix to combine.", "To serve, spoon the sesame spinach into the centre of each plate in a neat pile. Slice the lamb rack into chops and place four onto each plate, arranged over the spinach. Add a little of the remaining marinade to each plate and serve."]}, {"isVegetarian": false, "title": "Spiced lamb rack with spinach, chickpeas and crème fraîche dressing", "url": "www_bbc_co_uk_food_recipes_lambrackwithspinacha_92736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 4-bone lamb racks French trimmed (ask your butcher to prepare this for you)", "1 garlic clove, peeled, finely chopped", "1 lemon, juice only", "1½ tsp coriander seeds, toasted, ground to a powder", "1 tbsp olive oil", "1 tbsp olive oil", "400g/14oz canned chickpeas, drained, rinsed", "½ tsp coriander seeds, toasted, ground to a powder", "200g/7oz baby spinach leaves, washed", "Salt and freshly ground black pepper", "1 tbsp crème fraîche", "1 garlic clove, peeled, finely chopped", "Bunch chopped fresh coriander", "2 tbsp olive oil", "Salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the marinated lamb, place the rack of lamb into a large  bowl and add the garlic, lemon juice and ground coriander. Mix well until the lamb is coated in the mixture.", "Cover the bowl with cling film and chill in the fridge for at least one hour.", "Heat the oil in a large ovenproof frying pan, over a medium heat. Add the marinated lamb and cook on each side for 2-3 minutes or until golden-brown all over. Brush any remaining marinade over the lamb and transfer to the oven to roast for 10-12 minutes (for medium), or until cooked to your liking. Remove from the oven and set aside in a warm place for five minutes.", "Meanwhile, for the spinach and chickpeas, heat the oil in a frying pan over a medium heat, add the chickpeas and ground coriander and fry for four minutes. Add the spinach and continue to cook; stirring well, until the spinach has wilted. Season, to taste, with salt and freshly ground black pepper. Set aside and keep warm.", "For the crème fraîche dressing, place the crème fraîche into a bowl with the garlic, coriander and oil and season, to taste, with salt and freshly ground black pepper. Stir until well combined.", "To serve, place the chickpeas and spinach into the centre of four serving plates, cut the rack of lamb into individual chops and place one on top of each portion of the chickpeas. Drizzle over the crème fraîche dressing."]}, {"isVegetarian": false, "title": "Lamb, red wine and rosemary casserole", "url": "www_bbc_co_uk_food_recipes_lambredwineandrosema_71047", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambredwineandrosema_71047_16x9.jpg", "ingredients": ["650g/1lb 7oz boned shoulder of lamb, cut into 2cm/¾ inch cubes", "2 tbsp plain white flour, seasoned", "1 tbsp olive oil ", "25g/1oz butter", "1 tbsp tomato puree ", "300ml/½ pint red wine", "300ml/½ pint chicken and beef stock", "leaves from 1 sprig of fresh rosemary, finely chopped", "1 garlic clove, crushed", "1 carrot, cut into 1cm/½in dice", "1 onion, cut into 1cm/½in dice ", "2 celery sticks, cut into 1cm/½in dice", "salt", "freshly ground black pepper ", "4 large Maris Piper potatoes ", "75ml/2½fl oz fruity olive oil", "plus extra for greasing", "2 tbsp roughly chopped fresh rosemary", "1 tbsp roughly chopped fresh thyme ", "salt ", "freshly ground black pepper ", "50g/2oz butter", "750g/1lb 10oz red cabbage, cored and thinly sliced", "2 tbsp redcurrant jelly", "3 tbsp red wine vinegar or sherry vinegar", "1 orange, finely grated zest and juice", "250ml/9fl oz ruby port", "salt", "freshly ground black pepper", "85g/3oz raisins"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Put the cubes of lamb in a plastic bag with the seasoned flour and give the bag a good shake so that the meat becomes well coated with the flour. ", "Heat a large frying pan until very hot. Add the oil and the butter and then the lamb and fry over a high heat, stirring now and then, until all the pieces of lamb are well browned. Don't crowd the pan; cook in batches if necessary. Transfer to a casserole dish and set aside. ", "Add the tomato puree and red wine to the pan and bring to the boil, scraping up all the little bits that have stuck to the bottom. Pour this into the casserole dish and add the stock, rosemary, garlic and diced vegetables. ", "Add a little seasoning, cover with a tight fitting lid and bake for 1-½ hours or until tender. (If using a slow cooker, cook on auto for about eight hours). ", "Remove from the oven and check the seasoning. ", "To make the potato stacks - preheat the oven to 180C/350F/Gas 4.", "First slice the potatoes (no need to peel them) about two mm thick, either by hand, if you can trust your hand and knife co-ordination, or on a mandolin slicer. Dump the potatoes into a large bowl, without washing, and add the olive oil and herbs. ", "Toss well with your hands, making sure the potatoes are evenly coated. Season with a little salt and pepper and toss again to mix.  ", "Brush a heavy baking sheet with a little olive oil and start to build eight stacks of the potato slices. Try to make them look random, and incorporate as many of the herbs as you can. Sprinkle any remaining herbs and olive oil left in the bowl around and over the potato stacks. ", "Bake for 35-45 minutes or until golden brown at the edges and tender all the way through. You can test this by inserting a thin skewer through the middle of a stack - it should slip through easily. Serve immediately or turn the oven low and keep warm for up to 30 minutes. ", "To make the cabbage - melt the butter in a large ovenproof saucepan. ", "Add the cabbage and stir to coat in the butter. Add the redcurrant jelly and stir until it is melted. ", "Add the vinegar, orange zest and juice, the port and some seasoning. Bring to the boil, cover and simmer gently for approximately one hour or cook in an oven, preheated to 160c/325F/Gas 3.", "Stir in the raisins and bring back to a simmer. Cook gently for another 30 minutes. Check that the cabbage is tender. ", "Either serve straight away, keep warm in a low oven for up to one hour or cool and reheat."]}, {"isVegetarian": false, "title": "Lamb, rosemary and olive casserole with cauliflower purée", "url": "www_bbc_co_uk_food_recipes_lambrosemaryandolive_85239", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "1kg/2lb 3oz lamb shoulder, cut into large cubes", "1 large onion, roughly chopped", "1 garlic clove", "6 sticks celery, roughly chopped", "3 carrots, roughly chopped", "750ml/1 pint 7fl oz red wine", "350ml/12½fl oz beef stock", "salt", "20 black peppercorns", "200g/7oz mixed olives", "1 cauliflower head, broken into large florets", "100ml/3½fl oz chicken stock", "200ml/7fl oz double cream ", "pinch curry powder", "salt and freshly ground black pepper", "fresh parsley, chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Heat the oil in a large casserole over a medium heat and fry the lamb pieces quickly to brown on all sides. Remove the meat from the pan and place in a clean bowl.", "Reduce the heat slightly, and add the onion, garlic, celery and carrot to the casserole. Fry for 5-6 minutes, until the vegetables are softened.", "Add the wine, stock and peppercorns and bring the mixture to the boil.", "Return the meat to the pot and transfer to the oven to cook for two hours in the oven.", "Meanwhile, to make the cauliflower purée, place the cauliflower into a large saucepan and pour over the chicken stock. Cover with a lid and bring to the boil. Cook for 7-8 minutes, or until the cauliflower is tender.", "Place the cauliflower into a food processor and add the cream and curry powder. Blend to a smooth paste, then pass the mixture through a sieve.", "Remove the casserole from the oven. Add the olives and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon generous portions out onto plates. Sprinkle with parsley and place a spoonful of cauliflower purée alongside."]}, {"isVegetarian": false, "title": "Lamb rump with spiced chickpea stew", "url": "www_bbc_co_uk_food_recipes_lambrumpwithspicedch_91277", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 sprigs rosemary, leaves only, roughly chopped", "5 garlic cloves, finely chopped", "1 tbsp ground turmeric", "1 tbsp ground coriander", "1 tbsp mild red chilli powder", "1 tbsp garam masala", "3 tbsp vegetable oil", "4 x 200g/7¼oz boned rumps of lamb (chumps)", "4 tbsp vegetable oil", "2 bay leaves", "2 green cardamom pods, crushed", "5 garlic cloves, peeled", "200g/7¼oz onions, sliced", "1 tbsp ginger and garlic paste (from a jar)", "1 tsp ground coriander ", "1 tsp red chilli powder ", "1 tsp ground cumin", "1 tsp ground turmeric", "2 tsp salt", "200g/7¼oz tomatoes, roughly chopped", "1 large potato, peeled and cubed", "2 large turnips, peeled and cubed", "1 large carrot, peeled and cubed", "150g/5¼oz canned chickpeas, drained and rinsed", "handful fresh coriander, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, mix all the ingredients, apart from the lamb, in a shallow non-reactive dish. Score the rumps with a sharp knife and rub the mixture all over the rumps. Leave in the dish, covered, to marinate for at least two hours in a cool place. ", "Preheat the oven to 200C/390F/Gas 6. ", "Brown the lamb well in a hot frying pan, before placing in the oven to roast for 15-20 minutes - longer if you prefer your meat well done.", "Leave to rest in a warm place for at least five minutes before serving.", "Meanwhile, for the vegetable stew, heat the oil in a pan over medium heat and fry the bay leaves, cardamom pods and garlic cloves for one minute. ", "Add the onions and fry until lightly coloured. Stir in the ginger and garlic paste and cook for a further two minutes, until fragrant. ", "Add the coriander, chilli powder, cumin, turmeric, salt, tomatoes, potato, turnips and carrots. Stir well and simmer for 30 minutes.", "Once the potatoes and other vegetables are tender when tested with the point of a knife, add the drained chickpeas. Cook for a further five minutes. ", "Scatter the coriander over the stew and serve it topped with the lamb rump."]}, {"isVegetarian": false, "title": "Lambs’ liver with balsamic sauce", "url": "www_bbc_co_uk_food_recipes_lambs_liver_with_60023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 banana shallots, finely diced", "small handful fresh curly parsley, finely chopped", "1 garlic clove, finely diced", "1 tbsp olive oil", "150g/5oz thick cut smoked bacon, diced", "2 Little Gem lettuce, cut in half lengthways", "2 large Portobello or field mushrooms, sliced", "2 tbsp chicken stock ", "60g/2¼oz butter", "450g/1lb lambs’ liver", "flour, for dusting", "salt and freshly ground black pepper", "4 tbsp balsamic vinegar", "2 tbsp beef stock"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Stir the shallot, parsley and garlic together in a bowl and set aside. ", "Heat the oil in a frying pan and fry the bacon over a low heat for 2-3 minutes, or until golden-brown. Add the lettuce to the pan, cut-side down and the mushrooms and chicken stock and cook for 15-20 minutes.", "Meanwhile, heat a frying pan over a low heat and add half of the butter. Season the flour to taste with salt and freshly ground black pepper. Dust the liver slices in the seasoned flour and add to the butter once it is foaming. Cook for 2-3 minutes, then turn over and cook for another minute. Remove the liver from the pan and set aside, then deglaze the pan with the balsamic vinegar, scraping up any browned bits. Add the remaining butter and beef stock and continue to cook until the sauce is well combined and thickened slightly. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the braised lettuce onto serving plates, top with the liver and spoon over the balsamic sauce. Spoon over the shallot mixture. "]}, {"isVegetarian": false, "title": "Lambs' liver and kidney, with braised kale and crushed potatoes", "url": "www_bbc_co_uk_food_recipes_lambs_liver__kidney_with_60029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large red onions, thinly sliced", "1 tsp rapeseed oil", "1 tbsp Dijon mustard ", "pinch caster sugar ", "500g/1lb 2oz medium-size floury potatoes, peeled", "5 tbsp milk", "110g/3¾oz butter", "300g/10½ oz kale, stemmed and chopped into 2.5cm/1in pieces, reserve a few leaves for garnish", "4-5 bacon rashers, rind on", "vegetable oil, for frying", "500g/1lb 2oz lambs liver, unsliced", "small bunch sage, bruised", "3 garlic cloves, crushed", "8 lambs’ kidneys, cut into quarters ", "2 tbsp ground cumin ", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil and blanch the onions for 5 minutes to soften. Drain and transfer to a bowl. Add the rapeseed oil, Dijon mustard, sugar and season with salt and freshly ground black pepper. Set aside.", "Cook the potatoes in a pan of boiling, salted water for about 20 minutes or until they are just tender. (Be careful not overcook them as you want a bit of resistance in the potatoes.) Drain the potatoes in a colander, return them to the pan and dry them out over a very low heat. ", "Gently heat the milk. While the potatoes are warm, crush them roughly in the pot with the back of a fork. Add the hot milk and 60g/2¼ oz butter. ", "Boil the kale in hot water for 4 minutes, then drain thoroughly. Add it to the crushed potatoes and season with salt and pepper. Set aside. ", "Fry the bacon in a dry frying pan until crisp. Drain on kitchen paper and chop into small pieces. Fry the reserved kale leaves in a dry pan until crisp and charred. ", "For the liver, heat a little vegetable oil in a frying pan until very hot. Place the liver in the pan with the bruised sage. Season with salt and pepper and add the remaining butter and 2 cloves of garlic. Cook for about 3-4 minutes on both sides, regularly basting with the melted butter. Remove the liver from the pan and set it aside to rest. ", "Add the kidneys to the pan with the cumin and remaining garlic. Flash-fry for 2 minutes turning frequently. ", "Divide the kale and potatoes between serving plates and top with the onions. Slice the liver and place on top with the kidneys and drizzle with juices from the pan. Garnish with the bacon pieces and crisp kale leaves. "]}, {"isVegetarian": false, "title": "Lamb rump navarin with rosemary dumplings and roasted onions and parsnips", "url": "www_bbc_co_uk_food_recipes_lambrumpnavarinwithr_93447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 x 400g/14oz lamb rump steaks, chopped", "50g/2oz plain flour", "salt and freshly ground black pepper", "1 tbsp olive oil", "300g/11oz shallots, peeled, left whole", "2 sprigs fresh rosemary, leaves only, roughly chopped", "175g/6oz baby carrots, trimmed", "650ml/1pint 4fl oz chicken stock", "125g/4½oz plain flour, plus extra for dusting", "1 tsp baking powder", "pinch salt", "60g/2½oz suet", "1 tbsp chopped fresh rosemary leaves", "2 red onions, peeled, cut into wedges", "600g/1lb 6oz parsnips, peeled, cut into chunks", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Sprinkle the flour onto a plate and dredge the chopped lamb pieces in the flour until coated. Season, to taste, with salt and freshly ground black pepper.", "Heat the oil in a large lidded casserole and fry the lamb, turning frequently, for 3-4 minutes, or until browned all over. (You may need to do this in batches.) Remove each batch of lamb from the casserole and set aside. ", "Add the shallots to the casserole the lamb was cooked in  and fry for 2-3 minutes, then add the rosemary and carrots and continue to cook for a further 1-2 minutes.", "Return the browned lamb to the pan, pour in the chicken stock and bring the mixture to a simmer.", "Cover the casserole with a lid and transfer to the oven to cook for 1¼-1½ hours, or until the lamb is tender and the sauce has thickened slightly.", "Meanwhile, for the rosemary dumplings, sift the flour, baking powder and salt into a bowl. Stir in the suet and rosemary and add enough water until the mixture comes together as a dough.", "Using floured hands, roll spoonfuls of the dough into small balls.", "Remove the casserole from the oven and season, to taste, with salt and freshly ground black pepper. Place the dumplings into the casserole, cover with a lid and return to the oven for a further 20-25 minutes, or until the dumplings are cooked through. Remove from the oven and set aside.", "For the roasted onions and parsnips, increase the oven to 200C/390F/Gas 6. ", "Mix the onions and parsnips with the oil in a baking tray. Season, to taste, with salt and freshly ground black pepper and roast in the oven for 25-30 minutes, or until golden-brown and tender.", "To serve, reheat the lamb rump navarin, if necessary. Divide the roast onions and parsnips among 4 serving plates. Spoon the lamb navarin alongside and top with a few dumplings."]}, {"isVegetarian": false, "title": "Lamb, shallot and date tagine", "url": "www_bbc_co_uk_food_recipes_lambshallotanddateta_449", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambshallotanddateta_449_16x9.jpg", "ingredients": ["1.5kg/3¼lb leg of lamb, cubed", "2 tsp ground coriander seeds", "2 tsp ground ginger", "pinch saffron", "2 tbsp olive oill", "18 shallots whole, peeled", "4 garlic cloves, crushed", "1 tbsp plain flour", "1 tbsp tomato purée", "1 cinnamon stick", "600ml/1 pint lamb stock", "2 tbsp flatleaf parsley, chopped ", "2 tbsp coriander, chopped ", "1 preserved lemon, rinsed, inner pulp removed", "110g/4oz medjool dates, pits removed", "1 tbsp clear honey"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the lamb in a bowl and add the ground coriander, ground ginger, saffron and one tablespoon of the olive oil. Mix well and leave to marinate in the fridge, covered, for 24 hours.", "The next day, heat the remaining olive oil in a heavy-based pan with a lid. Cook the lamb until browned all over (you may need to do this in batches). Remove the lamb from the pan and set aside.", "Fry the shallots in the same pan until lightly golden then add the garlic and return the lamb to the pan.", "Stir in the plain flour and add the tomato purée and cinnamon stick.", "Stir in the lamb stock and bring to the boil. Cover tightly and simmer gently for 1½ hours, or until the lamb is tender.", "Add the parsley, coriander, lemon rind, dates and honey, stir well to combine and serve with a bowl of cous cous."]}, {"isVegetarian": false, "title": "Lamb shanks braised in a yoghurt sauce with basmati pilau with dill and cardamom", "url": "www_bbc_co_uk_food_recipes_lambshanksbraisedina_91037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb shanks", "2 tsp salt", "freshly ground black pepper", "13cm/5in piece fresh ginger, peeled and coarsely chopped", "8 garlic cloves, peeled and coarsely chopped", "525ml/18fl oz cold water", "8 tsp olive oil or corn oil", "2 tsp cumin seeds, left whole", "1 tsp cloves, left whole", "4 medium-sized cinnamon sticks", "2 tsp black peppercorns, left whole", "475ml/16fl oz full-fat plain yoghurt, stirred until smooth", "4 tsp coriander seeds, ground to a coarse powder in a mortar and pestle", "1½ tsp coarsely ground pure chilli powder or cayenne pepper", "½ tsp ground turmeric", "basmati rice, measured to the 500ml/17fl oz level in a measuring jug", "3 tbsp corn oil, peanut oil or olive oil", "1 medium-sized cinnamon stick", "5 cardamom pods, left whole but lightly crushed", "2 bay leaves", "85g/2½oz onion slices, sliced into fine half rings", "25g/1oz finely chopped fresh dill", "650ml/1 pint 4fl oz chicken stock"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the lamb shanks, preheat the oven to 160C/325F/Gas 3.", "Season the lamb shanks all over with ½ tsp of the salt and freshly ground black pepper, to taste. Pat the seasoning into the meat.", "In a food processor, blend the ginger, garlic and four tablespoons of the water to a smooth paste. Set aside.", "Heat the oil in a large, non-stick, ovenproof pan over a high heat. (NB: You will need to use a pan with a tight-fitting lid.) When the oil is smoking, add the lamb shanks and fry for 3-4 minutes, turning regularly, or until lightly browned on all sides. Remove the lamb shanks from the pan and set aside on a warm plate.", "Add the cumin, cloves, cinnamon and peppercorns to the hot oil in the pan the lamb shanks were cooked in. Fry for 10-15 seconds, or until fragrant.", "Add the ginger and garlic paste and stir well. Fry for 5-6 minutes, or until lightly browned.", "Remove the pan from the heat and allow the contents to cool slightly, then add the yoghurt. Stir until well combined, then add the remaining water and stir again until well combined.", "Return the pan to the heat, then add the ground coriander, chilli powder or cayenne pepper, ground turmeric and the remaining one and a half teaspoons of salt. Stir well until combined.", "Return the lamb shanks to the pan so that they are covered in the yoghurt mixture. Bring the mixture to the boil, then cover the pan with aluminium foil and place the lid on top.", "Transfer the pan to the oven and bake slowly for three hours, turning the shanks over every 30 minutes.", "Remove the pan from the oven and remove the lid and aluminium foil. Place the pan over a high heat and bring the yoghurt mixture to the boil. Reduce the heat until the mixture is simmering, then simmer the remaining liquid for 6-7 minutes, or until the volume of liquid has reduced and the sauce has thickened. Baste the lamb shanks regularly with the remaining sauce as you simmer it.", "Meanwhile, for the basmati pilau with dill and cardamom, rinse the rice in several changes of water. Drain well, then place the drained rice into a bowl and cover generously with fresh water. Set aside for 30 minutes to soak, then drain well again. ", "Heat the oil in a heavy-based pan over a medium heat. (NB: You'll need a pan with a tight-fitting lid.) When the oil is hot, add the cinnamon stick, cardamom pods and bay leaves and fry for 5-10 seconds, stirring well.", "Add the onions and fry for 4-5 minutes, stirring regularly, or until coloured. ", "Add the soaked, drained basmati rice and the chopped dill and stir well. Reduce the heat slightly and cook the rice for 2-3 minutes, stirring well, or until the rice is coated in the oil and has begun to cook.", "Add the stock and bring to the boil. Season, to taste, with up to a teaspoon of salt if necessary, then cover with a lid. Reduce the heat to its lowest setting and cook the rice for 20-25 minutes, or until tender.", "To serve, divide the rice equally among four serving plates. Place one lamb shank alongside each."]}, {"isVegetarian": false, "title": "Lamb steaks with anchovy butter, salsify and walnuts", "url": "www_bbc_co_uk_food_recipes_lambsteakswithanchov_87915", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 garlic clove, finely chopped", "2 x 225g/8oz lamb leg steaks", "salt and freshly ground black pepper", "250g/9oz unsalted butter, softened to room temperature", "1 tsp anchovy essence", "1 lemon, zest only", "6 fresh anchovies, drained of oil and chopped", "750g/1lb 10oz salsify ", "2 lemons, juice only", "1.5 litres/2½ pints cold water ", "25g/1oz plain flour ", "1 tsp salt", "75g/3oz walnut halves", "1 tbsp clarified butter", "salt and freshly ground black pepper", "1 tbsp walnut oil", "1 tbsp sultanas, soaked overnight in enough brandy to cover", "½ tsp caster sugar", "1 tbsp sherry vinegar", "25g/1oz unsalted butter", "2 tbsp chopped flatleaf parsley, to serve"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, rub the oil and garlic onto the steaks. Place them in a bowl, cover and leave in the fridge for at least six hours.", "A quarter of an hour or so before you are ready to cook, remove the lamb from the fridge and bring back to room temperature.", "Heat a griddle pan until hot. Place the steaks on the griddle and cook for 3-4 minutes on both sides. Remove the steaks from the pan, season with salt and freshly ground black pepper, to taste, and set aside in a warm place to rest.", "For the anchovy butter, place the butter into a bowl and add the anchovy essence, lemon zest and chopped anchovies and mix to combine.", "Place the butter mixture onto a sheet of cling film or baking parchment laid out on a clean work surface, and roll into a log.", "Place the prepared butter log in the fridge and leave to chill until firm.", "For the salsify, fill a bowl with water and add half the lemon juice. Peel the salsify and slice into 5cm/2in pieces and immediately place the salsify in the bowl (to stop it from discolouring).", "Meanwhile, combine a splash of the 1.5 litres/2½ pints water with the flour in a saucepan and stir to make a smooth paste.", "Add the remaining 1.5 litres/2½ pints water and lemon juice, along with the salt. Bring to a boil, whisking continuously. This mixture is called a 'blanc'.", "Drain the salsify and place it in the pan with the blanc.", "Bring to the boil, then reduce the heat to a simmer and cook for 15 minutes until tender.", "Drain and rinse the salsify in cold water and pat dry.", "Heat a non-stick frying pan, add half of the clarified butter and then add the dry salsify.", "Season with a little salt and freshly ground black pepper and fry gently to colour and heat through. Place the remaining clarified butter in another frying pan, add the walnuts and place over a high heat for a couple of minutes. Be careful not to let the nuts burn.", "Add the sultanas, sugar and vinegar to the walnuts. The sugar will caramelise and the vinegar will reduce to a glaze. ", "Remove from the heat and whisk in the unsalted butter. Season with salt and black pepper, to taste. Pour this mixture over the salsify and toss together.", "To serve, preheat the grill to hot. Remove the anchovy butter from the fridge and slice. Place a slice of butter over each lamb steak and place the lamb on a tray under the grill to melt the butter. ", "Transfer the lamb steaks to two serving plates. Spoon the salsify alongside, garnish with chopped parsley and serve."]}, {"isVegetarian": false, "title": "Lamb shank with garlic, rosemary and flageolet beans", "url": "www_bbc_co_uk_food_recipes_lambshankwithgarlicr_79926", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb shanks", "6 tinned anchovies, cut into halves", "12 small rosemary sprigs", "12 slivers garlic", "salt and freshly ground black pepper", "55g/2oz duck fat, butter or dripping ", "2 carrots, roughly chopped", "2 sticks celery, roughly chopped", "1 leek, roughly chopped ", "2 onions, roughly chopped ", "1 head garlic, broken up into cloves", "1 sprig thyme ", "1 sprig rosemary ", "1 bay leaf ", "½ bottle red wine", "600ml/1 pint chicken or lamb stock or water", "2 tbsp extra virgin olive oil", "115g/4oz streaky bacon lardons, blanched", "1 carrot, finely diced", "1 stick celery, finely diced", "1 onion, finely diced ", "6 cloves garlic, peeled", "2 sprigs thyme", "2 sprigs rosemary, chopped", "4 tomatoes, seeded and diced", "2 x 375g/13oz tins flageolet beans, drained and rinsed", "3 cloves garlic, chopped", "5 tbsp chopped fresh parsley", "2 lemons, grated zest only", "2 tbsp grated parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1.", "For the lamb shanks, first remove the majority of fat from the shanks. Make three deep incisions in each shank and insert in each half an anchovy wrapped around a sprig of rosemary and a slice of garlic. Season the meat with salt and freshly ground black pepper - you will not need too much salt as the anchovies are very salty.", "Heat a little duck fat, butter or dripping in a casserole, add the shanks and brown all over. Remove and set aside.  ", "To the casserole, add the carrots, celery, leek, onions, garlic cloves and herbs and cook over a high heat until the vegetables are browned.", "Deglaze the casserole by adding the red wine, scraping the residue on the bottom of the pan and stirring well.", "Add the stock or water to the casserole, place the shanks on top of the vegetables, cover and cook in the oven for two and a half hours.", "When the lamb has finished cooking, remove the four shanks to a dish and keep warm. Pass the vegetables and cooking liquor through a mouli, or blend in a food processor, and set to one side.", "For the sauce, heat the oil in a large pan over a medium to high heat. Add the bacon and fry until browned. Reduce the heat and add the carrot, celery, onion and garlic.  ", "Cook for eight minutes until the vegetables have softened then add the thyme, rosemary, tomatoes and flageolet beans. Heat through.", "Pass the blended lamb cooking liquor and vegetables through a strainer or fine sieve onto the bean mixture, stir together and pour over the lamb shanks.", "Mix the gremolata ingredients together to make the gremolata.", "Serve the lamb garnished with the gremolata and parmesan."]}, {"isVegetarian": false, "title": "Lamb stew with rosemary dumplings", "url": "www_bbc_co_uk_food_recipes_lambstewwithrosemary_90363", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambstewwithrosemary_90363_16x9.jpg", "ingredients": ["750g/1lb 10oz lamb neck fillet, cut into 2.5cm/1in cubes", "salt and freshly ground black pepper", "25g/1oz plain flour ", "1 tbsp olive oil", "50g/2oz butter", "12 baby onions, peeled", "2 medium carrots, cut into large dice", "1 medium swede, cut into large dice", "50ml/2fl oz white wine", "2 sprigs rosemary", "4 bay leaves", "1.25 litres/2 pints lamb stock", "3 tbsp flatleaf parsley, roughly chopped", "125g/4½ oz plain flour", "65g/2½ oz suet", "½ tsp baking powder ", "pinch salt", "1 tbsp rosemary, finely chopped", "500ml/18fl oz lamb stock  "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ½.", "Season the lamb and dust with the flour. Palce a heavy-bottom casserole dish over a medium heat, add the olive oil and butter then the lamb. Fry until golden-brown. Remove the lamb and keep to one side.", "Reduce the heat and fry the onions, carrots and swede until caramelised. Add the wine and simmer until the volume of liquid has reduced by half, then add the lamb back in with the lamb stock. Bring the stew to a simmer then add the bay leaf and rosemary. Cover with a lid, transfer the pan to the oven and bake for one hour.", "For the dumplings, mix the flour, suet, baking powder and a pinch of salt in a bowl. Add the rosemary then gradually stir in 3–5 tablespoons of cold water, or enough to form a sticky dough. Flour your hands and then roll the dough into 12 small balls. Place on a plate in the fridge to chill.", "When the lamb stew is ready, place 500ml/18fl oz lamb stock into a seperate pan and bring to a simmer. Add the dumplings and simmer for 6–8 minutes. Discard the stock when the dumplings are cooked and set them aside to rest for a minute.", "Add the dumplings and parsley to the casserole dish and serve equally between four shallow bowls. "]}, {"isVegetarian": false, "title": "Lamb with aubergine and tzatziki", "url": "www_bbc_co_uk_food_recipes_lambwithaubergineand_71920", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium aubergine, cut lengthways into 1cm/½in thick slices", "olive oil, to coat the aubergines", "1 leg of lamb, bone removed", "115g/4¼oz kalamata black olives, pitted", "2 tbsp grated orange zest", "1 tsp grated lemon zest", "2 tbsp chopped sage", "2 tbsp chopped garlic", "2 tbsp chopped anchovy ", "1 tsp crushed black pepper", "2 tbsp olive oil", "2 tbsp dried oregano", "salt and freshly ground black pepper", "1 lemon, juice only", "1 cucumber, halved, de-seeded and coarsely grated", "450g/1lb Greek yoghurt", "2 limes, zest only, grated", "2 large cloves of garlic, crushed", "1 bunch spring onions, finely sliced", "1 red chilli, finely chopped", "chopped dill, to serve"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Heat a griddle pan. Cut the aubergines lengthways into four slices and brush with olive oil. Sear on both sides. Remove from the heat and put to one side.", "Put the paste ingredients in a food processor and blend together.", "Take the paste and smear it over the inside of the leg of lamb. Place the aubergine slices on top. Roll up the leg and tie at 5cm/2in intervals. Allow to rest for as long as possible, overnight if you can.", "Preheat the oven to 200C/400F/Gas 6. Rub the oregano, salt, pepper and lemon juice on to the meat. Put the meat into a hot pan to sear on each side before placing in the oven. Roast for 15 minutes per 500g/1lb plus 15 minutes more, turning occasionally. Cover the meat with foil for the first 30 minutes' cooking to keep moist.", "Remove from the oven and rest the meat for one third of the time it took to cook. This ensures a perfectly pink result.", "To make the lime tzatziki, peel the cucumber, remove the seeds and grate finely. Squeeze out all the moisture before combining with all the rest of the ingredients. Chill for an hour to allow the flavours to blend. Sprinkle over the dill just before serving.", "Serve the meat with the tzatziki on the side."]}, {"isVegetarian": false, "title": "Lamb-stuffed rolled marrow with salad", "url": "www_bbc_co_uk_food_recipes_lambstuffedrolledmar_89438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "400g/14oz minced lamb", "1 tsp ground cumin", "1 tsp ground coriander seeds", "½ tsp ground cinnamon ", "1 tbsp tomato purée", "300ml/11fl oz lamb stock", "75g/3oz sultanas", "50g/2oz pine nuts, toasted", "3 tbsp fresh coriander leaves, roughly chopped", "salt and freshly ground black pepper ", "4 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "400g/14oz canned chopped tomatoes", "1 tsp caster sugar", "1 tsp ground coriander seeds", "salt and freshly ground black pepper ", "2 marrows, peeled and sliced thinly lengthways", "1 ball mozzarella, thickly sliced", "3 tbsp freshly grated parmesan ", "1 lemon, juice only", "4 tbsp olive oil", "salt and freshly ground black pepper ", "1 bag mixed salad leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lamb mince, heat a frying pan until hot, add the olive oil, onion and garlic and cook for 3-4 minutes, until just softened.", "Add the lamb mince and cook for 2-3 minutes, until browned.", "Add the cumin, coriander, cinnamon and tomato puré and cook for a further minute.", "Add the lamb stock, sultanas and pine nuts and bring to the boil, then reduce the heat and simmer for 15 minutes.", "Add the fresh coriander and season, to taste, with salt and freshly ground black pepper. Remove from the heat and leave to cool slightly.", "For the rolled marrow, heat a separate frying pan until hot. Add half of the olive oil, the onion and garlic and cook for 2-3 minutes, until softened.", "Add the tomatoes, sugar and ground coriander seeds and bring to the boil. Reduce the heat and simmer for 20 minutes, or until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper.", "Heat a separate frying pan until hot, add the remaining olive oil and the sliced marrow strips in batches and fry on each side for 30-50 seconds, until just softened and starting to turn golden-brown. Remove and drain on kitchen paper while you cook the remaining strips.", "Place the marrow slices onto a clean work surface and season well with salt and freshly ground black pepper.", "Spoon some of the lamb mince mixture into the centre of each marrow slice and roll it up around the mince. Transfer each stuffed roll into an ovenproof dish, seam-side down.", "Spoon the tomato sauce over the stuffed marrow rolls, then top with pieces of mozzarella and sprinkle with parmesan.", "Cover the dish with aluminium foil and place into the oven to bake for 15 minutes. Remove the foil and return to the oven for a further 5-8 minutes, or until golden-brown all over.", "For the salad, whisk the lemon juice and olive oil together in a bowl and season to taste with salt and freshly ground black pepper.", "Place the salad leaves into a serving bowl and drizzle with the dressing. Toss the salad to coat well.", "To serve, place two stuffed marrow rolls onto each plate and spoon a little sauce over. Serve with the salad alongside."]}, {"isVegetarian": false, "title": "Lamb with cabbage and mushroom fricassée", "url": "www_bbc_co_uk_food_recipes_lambwithcabbageandmu_73310", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "1 lamb fillet", "1 litre lamb stock", "½ carrot", "½ celery stick", "½ onion", "1 garlic clove", "2 tbsp olive oil", "1 garlic clove, finely diced", "½ onion, sliced", "1 sprig thyme", "200g/7¼oz savoy cabbage, shredded", "3 large flat mushrooms, cut into wedges"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot.", "Add the oil then sear the lamb briefly on each side.", "Meanwhile, place the lamb stock, carrot, celery, onion and garlic in a pan and bring to the boil.", "Add the lamb and poach for two minutes.", "Remove and allow to stand.", "For the fricassée, heat the frying pan until hot, add the olive oil, garlic, onion and thyme.", "Cook for 2-3 minutes until just softened.", "Add the savoy cabbage and stir-fry for five minutes.", "Add the mushrooms and cook for a further 2-3 minutes.", "Add 50ml/1¾fl oz of the poaching liquid.", "Serve."]}, {"isVegetarian": false, "title": "Lamb with egg sauce", "url": "www_bbc_co_uk_food_recipes_lambwitheggsauce_68076", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp extra virgin olive oil", "1 large onion, sliced", "900g/2lb boned leg of lamb, cut into fairly large chunks", "1 glass dry white wine", "1 egg", "3 eggs, yolks only", "2 tbsp coarsely chopped fresh parsley", "½ lemon, juice only", "salt and freshly ground black pepper", "12 asparagus stems", "ciabatta loaf"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan, add the onion and cook gently until tender.", "Add the meat and fry for 5 minutes, until browned.", "Stir in the wine and some salt and pepper, then cover and braise for 20-30 minutes, until the lamb is tender, stirring occasionally to prevent sticking. ", "Lightly beat the whole egg and egg yolks in a bowl, then add the parsley and lemon juice. Take the pan off the heat and pour in the egg mixture, stirring to obtain a silky-smooth sauce; the heat of the meat will gently cook the eggs but they should not scramble.", "Cook the asparagus stems in simmering water until they are soft (or they can be steamed).  ", "Serve the lamb immediately, with some ciabatta bread and some asparagus."]}, {"isVegetarian": false, "title": "Lamb with herb crust", "url": "www_bbc_co_uk_food_recipes_lambwithherbcrust_7598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb cutlets", "1 slice of bread, toasted", "handful of fresh mixed herbs (parsley, mint, basil)", "80g/3oz parmesan, finely grated", "salt and pepper to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high", "Tip all the crust ingredients into a processor and blitz briefly. ", "Cook the lamb cutlets under the grill and serve scattered with the herb crust."]}, {"isVegetarian": false, "title": "Lamb with lemon and fresh rosemary, roasted shallot and sweet potato mash", "url": "www_bbc_co_uk_food_recipes_lambwithlemonandfres_82126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lamb leg steak, cut into two pieces", "1 tbsp olive oil", "1 tbsp fresh rosemary, finely chopped", "½ lemon, juice and zest", "salt and freshly ground black pepper", "1 shallot, peeled and halved", "1 tbsp olive oil", "100g/3½oz sweet potato, peeled and chopped", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lamb, rub the lamb with the oil, fresh rosemary and lemon zest and season well with salt and freshly ground black pepper.", "Place the lamb into a hot pan over a medium heat and fry for 4-5 minutes on each side, or until cooked through. Squeeze over the lemon juice on each side during cooking.", "For the roasted shallot, place the shallot into a small roasting tin, drizzled with olive oil and place into the oven to roast for 10-15 minutes, until browned and soft.", "For the sweet potato mash, place the sweet potato into boiling salted water and boil for 10 minutes, then drain over a colander. Return the sweet potato to the pan and mash, stirring in the olive oil and salt and freshly ground black pepper, to taste.", "To serve, place the lamb onto a pile of sweet potato mash with the roasted shallot on the side."]}, {"isVegetarian": false, "title": "Lamb with sautéed butternut squash", "url": "www_bbc_co_uk_food_recipes_lambwithsautebuttern_77966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butternut squash, top end, sliced 1cm thick", "1 banana shallot, finely chopped", "25g/1oz unsalted butter", "30ml/1floz olive oil", "150g/5½oz lamb (leg steak)", "salt and freshly ground black pepper to taste"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut out three butternut rounds using a three-inch round cutter. Toss in a bowl with the shallots and olive oil and season well. ", "Melt the butter in a frying pan over a medium heat. Add the rounds and cook for three minutes on each side.", "To cook the lamb, place a griddle pan over a high heat.", "Season the lamb steak on both sides. Place in the griddle pan and cook for two minutes on each side.", "Remove and slice the steak.", "To serve, lay the butternut rounds in a pile on a serving plate. Place the sliced lamb on top."]}]