[{"isVegetarian": false, "title": "Fish curry with watercress and lemon couscous", "url": "www_bbc_co_uk_food_recipes_fish_curry_with_84873", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["240g/9oz couscous ", "1 tbsp butter ", "½ tsp salt ", "1 lemon, zest only", "700g/1lb 9oz skinless tilapia or white fish fillets, defrosted if frozen, cut into large chunks", "1 tsp paprika ", "1 tsp ground turmeric ", "3 tbsp olive oil ", "3 garlic cloves, crushed ", "1 small onion, peeled and finely chopped ", "1 small green chilli, finely chopped (deseeded if you want less heat) ", "½ tsp salt ", "½ tsp ground cumin ", "1 tsp ground coriander ", "85g/3oz watercress, finely chopped ", "large handful pea shoots or micro herbs, to garnish", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lemon couscous, put the couscous into a large bowl and cover with boiling water to 1cm/½in above the level of couscous. Add the butter, then cover tightly with cling film and set aside for 20 minutes.", "To make the curry, put the fish into a bowl, and sprinkle over the paprika and ½ teaspoon turmeric. Add a pinch of salt and mix well to coat the fish.  ", "Heat the oil in a large lidded non-stick frying pan on a medium-high heat and fry the fish for 3–4 minutes on each side, until cooked all the way through and golden-brown. Remove the fish from the pan and set aside to keep warm. ", "Add the garlic, onions, chilli and salt to the same pan and cook for 5 minutes on a low to medium heat, until the onions have softened. Add the turmeric, cumin and coriander and cook for a few more minutes. Add 200ml/7fl oz water and leave to cook gently on a low heat for a few more minutes. Add the watercress, then cover the pan and cook for 2 minutes, until it has wilted. Return the fish and any resting juices to the pan and mix through gently, just enough to warm the fish through.", "Meanwhile, remove the cling film from the couscous and fluff up with a fork. Add the lemon zest and salt and mix well. ", "Serve the curry with the couscous on the side, garnished with pea shoots or micro herbs and the lemon wedges."]}, {"isVegetarian": false, "title": "Fish fingers with tomato salsa", "url": "www_bbc_co_uk_food_recipes_fish_fingers_with_tomato_13687", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fish fingers", "150g/5½oz tomatoes, roughly chopped", "½ tsp olive oil", "¼ onion (25g/1oz peeled weight), finely chopped ", "pinch dried red chilli flakes", "salt and freshly ground black pepper, to taste", "fresh coriander, finely chopped (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium–hot. Grill the fish fingers according to packet instructions. ", "Meanwhile, mix together all the salsa ingredients in a bowl and serve alongside the fish fingers."]}, {"isVegetarian": false, "title": "Fish goujons and tartare sauce", "url": "www_bbc_co_uk_food_recipes_fish_goujons_and_tartare_10220", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 plaice or lemon sole, filleted, skinned and cut into strips", "75g/2½oz plain flour", "2 free-range eggs", "150g/5½oz panko breadcrumbs", "3 free-range egg yolks", "2 tbsp cider vinegar", "300ml/10fl oz rapeseed oil", "110g/4oz capers", "150g/5½oz gherkins, chopped", "½ shallot, finely chopped", "1 small bunch fresh dill, chopped", "2 tbsp chopped fresh flatleaf parsley", "1 lemon, cut into wedges, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 190C or until a breadcrumb sizzles and turns golden-brown when dropped into it (CAUTION: Hot oil can be dangerous. Don't leave unattended).", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the panko breadcrumbs onto a separate plate. Dredge the fish in flour, dusting off any excess, then dip them in the egg, then roll in the breadcrumbs until coated.", "Cook in the deep-fat fryer for 2-3 minutes until golden-brown.", "For the tartare sauce, whisk the egg yolks and vinegar together in a bowl.", "Continue to whisk the mixture and slowly pour in the rapeseed oil until all of the oil is incorporated and mixture is thick and light.", "Stir in the capers, gherkins, shallot and herbs. Season, to taste, with salt and pepper and a squeeze of lemon juice.", "Serve the fish goujons with the tartare sauce and lemon wedges. "]}, {"isVegetarian": false, "title": "Fish in parsley sauce", "url": "www_bbc_co_uk_food_recipes_fish_in_parsley_sauce_44734", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz unsalted butter", "375g/13oz plain flour", "3 litres/5¼ pints whole milk", "large bunch fresh curly parsley, finely chopped", "sea salt and freshly ground black pepper", "6kg/13lb ling fillets, skin on"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "The make the parsley sauce, melt the butter in a large saucepan. Add the flour, cook for 2-3 minutes then slowly add the milk to the pan, whisking continually, until you have a thick white sauce. ", "Add the parsley and cook for a further five minutes.  Season with salt and freshly ground black pepper.", "Meanwhile, place the fish on large baking trays lined with greaseproof paper.  Season with salt and freshly ground black pepper and put in the oven for 7-10 minutes or until the fish is cooked through. (You may have to do this in batches.)", "To serve, place the fish on the plate and pour over the parsley sauce."]}, {"isVegetarian": false, "title": "Fish pie", "url": "www_bbc_co_uk_food_recipes_fish_pie_27557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb floury potatoes, peeled and cut into chunks", "100g/3½oz butter", "100ml/3½fl oz milk", "salt and freshly ground black pepper ", "2 free-range eggs", "600ml/21fl oz milk", "1 bay leaf", "1 leek, finely chopped", "100g/3½oz smoked haddock fillet, skinned", "200g/7oz salmon fillet, skinned", "50g/1¾oz butter", "50g/1¾oz plain flour", "2 anchovy fillets", "1 whole smoked mackerel, flaked", "300g/10½oz cooked prawns", "4 scallops, cleaned, roe removed", "100g/3½oz Edam cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the mash, boil the potatoes in a large saucepan of salted water until tender. Drain, return the potatoes to the pan and mash them with the butter and milk. Season. ", "To make the filling, cook the eggs in boiling water for 10 minutes. Cool under running water, then peel and quarter them. ", "Warm the milk, bay and leek in a wide sauté pan. Add the haddock and salmon and poach gently for 5 minutes then remove, reserving the infused milk.", "Melt the butter in a frying pan and gradually add the flour, stirring, until you have a paste. Pour in the infused milk, whisking constantly, until you have a smooth sauce. Add the anchovy and season. ", "Flake in the salmon, haddock and mackerel.  Add the prawns and scallops and transfer to a pie dish. Dot the egg quarters over the top.", "Top with the mashed potato, scatter with the Edam cheese and bake for 20 minutes, or until golden and bubbling. "]}, {"isVegetarian": false, "title": "Fish pie", "url": "www_bbc_co_uk_food_recipes_fish_pie_84774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz floury potatoes, cut into chunks", "300g/10½oz Gruyère, grated", "salt and freshly ground black pepper", "2 free-range eggs ", "300g/10½oz smoked haddock fillet, skinned and pin-boned  ", "150g/5½oz raw prawns, shells removed", "6 cooked crayfish, shells removed", "3 sardines, gutted and cleaned ", "1 small monkfish tail, loin removed", "500ml/18fl oz whole milk", "1 onion, halved", "1 bay leaf ", "30g/1oz unsalted butter", "2 banana shallots, finely chopped", "50ml/2fl oz vermouth ", "30g/1oz plain flour", "½ bunch fresh dill, roughly chopped", "½ bunch fresh parsley, roughly chopped ", "½ bunch fresh chives, snipped"], "serves": "Serves 4–6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. To make the topping, cook the potatoes in lightly salted boiling water for 15–20 minutes, or until cooked. Drain well and mash.", "To make the filling, put the eggs in a saucepan of water and bring to the boil. Lower the temperature and boil for 8 minutes. Remove from the pan with a slotted spoon and leave to cool. Peel and cut in half. ", "Meanwhile, put the smoked haddock, prawns, crayfish, sardines, monkfish, milk, onion and bay in a sauté pan and bring to a simmer. Poach the fish for a few minutes. Lift it out using a slotted spoon and break the haddock and monkfish into large chunks, then set aside. Strain the milk into a jug and reserve. ", "Add enough of the poaching milk to the potatoes to make a thick mash. Mix in the Gruyère. Season and set aside.", "To make the sauce, heat a medium sauté pan, add the butter and heat until melted. Add the shallots and cook until softened. Pour in the vermouth and reduce by half. Tip in the flour, stir well and cook for a minute. Whisk in most of the reserved poaching milk and simmer for a few minutes. Remove from the heat and stir in the smoked haddock, monkfish and herbs.", "Put the prawns and half the crayfish in a 23cm/9in ovenproof pie dish. Top with the eggs, then the sauce and white fish. Finally spoon over the mash and stick the remaining crayfish and the sardines in the top, heads and tails showing.", "Bake for 20–30 minutes, or until golden and bubbling. Serve."]}, {"isVegetarian": false, "title": "Fish pie with garden peas", "url": "www_bbc_co_uk_food_recipes_fish_pie_with_garden_36257", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5-6 large baking potatoes", "1 tbsp vegetable oil", "handful rock salt", "200g/7oz mussels", "150ml/5fl oz white wine", "1 onion, thinly sliced", "½ tsp black peppercorns", "2 bay leaves", "500g/1lb 2oz boneless, skinless smoked haddock", "400g/14oz salmon, bones and skin removed", "400g/14oz cod, bones and skin removed", "200g/7oz butter ", "3 heaped tbsp plain flour", "475ml/17fl oz milk  ", "1 lemon, zest and juice", "4 tbsp chopped flat leaf parsley", "250g/9oz cooked peeled prawns", "1 cooked lobster, meat removed", "150g/5½oz strong cheddar, grated", "200g/7oz peas", "50g/1¾ unsalted butter", "salt and pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish pie, preheat the oven to 180C/160C Fan/Gas 4. ", "Prick the potatoes all over with a fork, then rub with a little oil. Sprinkle a roasting tray with the rock salt and place the potatoes on top. Bake for 1-1½ hours, or until tender.", "Clean the mussels in running water. Discard any open mussels that do not close when given a sharp tap. Put a large saucepan over a high heat. Add the mussels and white wine, cover with a lid and cook for 2-3 minutes, or until the mussels have opened. Strain and discard any mussels that have not opened (keep the cooking liquor). Pick the mussels from their shells. ", "Meanwhile, half-fill a large frying pan with water and bring to a simmer. Add the onion, black peppercorns, bay leaves and all the fish. Poach for 3-4 minutes, then lift the fish from the pan using a slotted spoon and set aside. Strain the fish stock through a sieve suspended over a large bowl. Reserve the strained stock and discard the onion, bay leaves and peppercorns.", "Melt 100g/3½oz of the butter in a saucepan over a medium heat. Whisk in the flour to form a smooth paste, then cook for a further 1-2 minutes. ", "Whisk in 50ml/2fl oz of the milk until it is fully incorporated into the sauce. Continue to add 350ml/12fl oz of the remaining milk little by little, whisking after each addition, until the sauce is smooth and thick. Add 500ml/18fl oz of the fish stock and the cooking liquor from the mussels, stir well and cook for 4-5 minutes, or until the sauce is smooth and just thick enough to coat the back of a spoon. (Any remaining fish stock can be chilled and frozen for use in another dish.)", "Stir in the lemon zest, juice and parsley, then season with salt and pepper. Remove from the heat. Stir the prawns and lobster meat into the sauce, then flake in the poached fish, keeping it in fairly large pieces. Transfer the pie filling to a large ovenproof dish.", "When the potatoes are cooked, remove them from the oven and increase the oven temperature to 220C/200C Fan/Gas 7.", "Slice the potatoes in half, scoop out the flesh and pass it through a potato ricer into a pan set over a medium heat. Add 75g/2½oz of the butter and the remaining 75ml/2½fl oz milk to the potatoes and beat over the heat until the mash is smooth, thick and not too soft. ", "Spoon the mash into a piping bag with a large star-shaped nozzle and pipe the mashed potato all over the fish pie filling. (Alternatively, just spread mashed potato over the filling.) Sprinkle over the grated cheese.", "Place the ovenproof dish onto a baking sheet and bake for 5-10 minutes, or until the cheese and potatoes are golden-brown and the pie is heated through.", "Meanwhile, bring a pan of salted water to the boil, add the peas and cook for 2-3 minutes until tender. Drain well and return to the pan, then stir in the butter and season with salt and pepper. Serve the fish pie with the peas alongside."]}, {"isVegetarian": false, "title": "Fish pie with soufflé crouton topping", "url": "www_bbc_co_uk_food_recipes_fish_pie_with_souffl_57249", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_pie_with_souffl_57249_16x9.jpg", "ingredients": ["50g/1¾oz butter, plus extra for greasing", "1 leek, thinly sliced or chopped", "50g/1¾oz flour", "600ml/20fl oz hot milk", "2 tbsp chopped fresh dill", "2 tbsp lemon juice", "350g/12oz fresh haddock, skinned and cut into evenly sized cubes", "350g/12oz undyed smoked haddock, skinned and cut into evenly sized cubes", "3 hard-boiled eggs, each cut into 4 or 8 wedges", "1 small (400g/14oz) loaf white bread (about 2-3 days old)", "50g/1¾oz full fat cream cheese", "75g/2½oz butter", "75g/2½oz mature cheddar, grated", "1 large free-range egg white", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1.5 litre/2½ pint shallow wide-based ovenproof dish with butter.", "To make the fish pie, melt the butter in a saucepan, add the leeks and gently soften over a low heat until completely tender but not coloured.  ", "Sprinkle in the flour and stir over a high heat for a minute. Gradually pour in the hot milk, stirring all the time until the sauce is smooth, thick and has come to the boil.  Remove from the heat and add the chopped dill, lemon juice, fish and season with salt and pepper.  Cook for two minutes, stirring.  Remove from the heat.", "Spoon into a 1.5 litre/2½ pint shallow wide-based ovenproof dish. Arrange the eggs on top of the sauce and press in gently. Level the top and set aside until cold. Cover with cling film and chill in the fridge for about an hour or until firm.", "Preheat the oven to 200C/180C Fan/Gas 6.", "To make the soufflé topping, remove the crusts from the loaf and discard. Cut into five slices then cut each slice into small cubes (about 1.5cm/¾in across). You will need 150g/5½oz of bread cubes.  ", "Add the cream cheese, butter and cheddar to a saucepan, melt over a low heat until runny (the mixture may look curdled but do not worry).  Set aside for a moment.  ", "In a spotlessly clean bowl, whisk the egg white until stiff peaks form when the whisk is removed. Fold the eggs whites into the cheese mixture.  Season with salt and pepper and carefully stir.  Stir in the bread cubes so they are all coated in the mixture.  Spoon onto the top of the chilled fish mixture so the cubes are in a single layer.", "Bake in the oven for 25-30 minutes until golden-brown and bubbling. If it is getting too brown cover it with foil and continue to bake.", "Leave to stand for five minutes then serve with salad or green vegetables."]}, {"isVegetarian": false, "title": "Fish soup-stew", "url": "www_bbc_co_uk_food_recipes_fish_soup-stew_79327", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_soup-stew_79327_16x9.jpg", "ingredients": ["2kg/4lb 8oz mixed fresh fish fillets and shellfish, such as red mullet, small sole, gurnard, monkfish, sea bass, cuttlefish, baby octopus, prawns, mussels, squid or scallops", "8 tbsp olive oil, plus extra for drizzling", "1 large onion, finely sliced", "2 garlic cloves, finely chopped, plus an extra clove for the toast", "1kg/2lb 4oz ripe tomatoes, skinned and chopped, or 2x400g/14oz tins of chopped tomatoes ", "125ml/4fl oz red wine", "chopped fresh chilli, to taste", "3 tbsp finely chopped flatleaf parsley", "½ tsp fennel seeds", "salt and freshly ground black pepper", "6-8 slices good bread, slightly stale or toasted"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["If your fishmonger hasn’t already done so, clean and prepare your chosen fish and shellfish. Cut fish fillets into large chunks and seafood into manageable pieces. ", "Put the oil, onion and garlic into a large pan and fry briefly. ", "Add the tomatoes, wine, chilli, parsley and fennel seeds and season with salt and pepper. Cook for 15 minutes. ", "Start to add large pieces of fish to the sauce first and those that will take the longest to cook such as monkfish, then add the more tender fish such as red mullet or sole and the shellfish, ending up with the mussels if using. Cook for five or so minutes, or until the fish is cooked and the mussels have opened. (Discard any mussels that haven't opened.)", "Rub the bread with garlic, drizzle with olive oil, and put each slice in the bottom of a deep soup bowl. Pour over the soup and serve. "]}, {"isVegetarian": false, "title": "Fish soup with rouille-topped crostini", "url": "www_bbc_co_uk_food_recipes_fish_soup_with_27076", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_soup_with_27076_16x9.jpg", "ingredients": ["4 tbsp olive oil", "1 onion, peeled, roughly chopped", "2 banana shallots, peeled, roughly chopped", "1 fennel bulb, trimmed, roughly chopped", "4 garlic cloves", "2kg/4lb 4oz fish bones (if using fish heads, ask your fishmonger to remove the gills)", "300g/10½oz prawn shells and heads", "2 tbsp sun-dried tomato purée", "400g/14oz canned chopped tomatoes", "500g/1lb 2oz passata", "2 tbsp dried mixed herbs", "1.5 litres/2½pints chicken or vegetable stock", "1 tbsp caster sugar", "salt and freshly ground black pepper", "1 small dressed crab (optional)", "250ml/9fl oz double cream", "1 small unbaked ciabatta, cut into 6-8 thin slices", "splash olive oil", "salt and freshly ground black pepper", "2 garlic cloves", "2 free-range egg yolks", "75ml/3fl oz extra virgin olive oil", "75ml/3fl oz vegetable oil", "large pinch cayenne pepper", "3 tbsp tomato purée", "freshly squeezed lemon juice, to taste", "6-8 bantam eggs (available from farm shops)", "splash of white wine vinegar", "75g/3oz gruyère, grated", "parsley or chervil sprigs, to garnish"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the fish soup, heat the oil in a frying pan over a medium heat. Fry the onion, shallots and fennel for 8-10 minutes, or until softened, then add the garlic and continue to fry for a further 1-2 minutes, stirring well.", "Add the fish bones and fry for a further 4-5 minutes, stirring well.", "Add the prawn shells and heads, tomato purée, chopped tomatoes, passata, mixed herbs, stock and caster sugar and stir until well combined. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 30 minutes. Once cooked, set aside to cool slightly.", "Meanwhile, for the rouille-topped crostini, place the slices of ciabatta onto a baking tray. Brush each slice with a little olive oil and season, to taste, with salt and freshly ground black pepper. Bake in the oven for 5-6 minutes, or until crisp and golden-brown. Set aside.", "To make the rouille, blend the garlic and egg yolks in a food processor with a pinch of salt.", "Mix together the vegetable and extra virgin olive oil. With the motor still running, gradually add the oils to the egg mixure in a thin stream until the mixture becomes thick and smooth.", "Add the cayenne pepper, tomato purée and lemon juice and blend again until smooth. Set aside.", "Once the fish soup has cooled, blend the mixture to a smooth purée using a hand-held blender, then strain through a fine sieve into a clean bowl, helping the mixture through the sieve using the back of a wooden spoon. Season, to taste, with salt and freshly ground black pepper.", "Just before serving, reheat the fish soup gently, stirring in the crabmeat (if using) and cream.", "Meanwhile, poach the bantam eggs. Bring a saucepan of water to the boil, add the eggs (still in their shells) and boil for 20 seconds. Remove the eggs from the water.", "Add a splash of white wine vinegar to the boiling water and stir to form a vortex. Crack one of the eggs into the centre of the vortex and poach for 2-3 minutes, or until the egg is cooked to your liking. Remove the poached egg from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining eggs.", "Top each crostini with a teaspoonful of rouille and a little grated gruyère. Top each with a poached bantam egg and garnish with a sprig of parsley or chervil.", "When the soup is warmed through, ladle into bowls. Serve the rouille-topped crostini alongside, or float them on top of the soup."]}, {"isVegetarian": false, "title": "Fish soup with aïoli", "url": "www_bbc_co_uk_food_recipes_fish_soup_with_aoli_67591", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz cod loin, cut into 1.5cm/⅝in chunks", "1 lemon, zest only", "1½ tbsp olive oil", "1 garlic clove, thinly sliced", "1 large red onion, thinly sliced", "1 fennel bulb, thinly sliced", "1 carrot, finely chopped", "1 tsp mild curry powder", "½ tsp paprika", "1 400g tin chopped tomatoes, drained", "400ml/14fl oz Pino Grigio white wine ", "2 tsp caster sugar", "250ml/9fl oz fish stock ", "small bunch fresh dill, finely chopped", "200g/7oz raw king prawns, deveined", "20g/¾oz butter", "15g/½oz finely chopped flatleaf parsley", "small bunch chives, finely chopped", "freshly ground black pepper", "2 free-range egg yolks", "1 tbsp fresh lemon juice", "250ml/9fl oz sunflower oil", "1 garlic clove, crushed", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coat the cod with the lemon zest and a few turns of pepper and set aside. ", "Heat the olive oil in a large saucepan over a medium heat. Sweat the garlic, onion, fennel and carrot for 10 minutes or until soft. Add the curry powder and paprika and fry for a further minute. ", "Add the tomatoes, white wine, sugar, stock and 2 tablespoons of the dill. Bring to the boil, reduce the heat and simmer for 25 minutes. ", "While the soup is simmering, make the aioli by placing two egg yolks in a mini food processor. Add the lemon juice and blend together. Gradually add the oil, drop by drop while blending, for about 5 minutes or until it thickens. Add the garlic and season to taste. ", "When the soup has been cooking for 25 minutes, add the cod and simmer for 3 minutes. Season to taste. ", "Meanwhile, fry the prawns in the butter for 3 minutes, or until pink and cooked through. Once cooked, stir the prawns into the soup. ", "To serve, divide the soup between four bowls and garnish with the parsley, chives, dill and a dollop of the aïoli."]}, {"isVegetarian": false, "title": "Fish tacos", "url": "www_bbc_co_uk_food_recipes_fish_tacos_33979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_tacos_33979_16x9.jpg", "ingredients": ["1 small red onion, peeled, halved and sliced into half moons", "2 limes, juice only", "125g/4½oz mayonnaise", "2 tsp gochujang paste, or other hot sauce, to taste", "1 x 198g/7oz tin sweetcorn, drained", "1 fresh red chilli, finely diced (de-seed if you don’t like too much heat)", "3 tbsp chopped fresh coriander", "salt, to taste", "4 skinless fillets of firm white fish, such as hake or haddock (750–900g/1lb10oz-2lb total), from the thicker loin end", "1 tsp ground cumin", "½ tsp paprika", "1 tsp sea salt flakes", "1 garlic clove, peeled and finely grated or minced", "2 tbsp regular olive oil", "8 soft corn tortillas", "2 ripe avocados", "1 lime, juice only", "salad leaves of your choice", "1–2 tbsp chopped fresh coriander", "2 limes, cut into wedges"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 for the fish, and begin by preparing the sides for your tacos. Put the red onion slices into a bowl and cover with the lime juice. Stir with a fork to mix the onion well in the juice. Actually, if you can get this done ahead of time (up to 1 day), so much the better, but even 20 minutes is fine.", "Make the hot sauce by mixing together the mayonnaise and the gochujang paste (or other hot sauce) in a small bowl. Set aside.", "For the corn relish, put the canned sweetcorn into a bowl. Add the chilli to the sweetcorn, along with the chopped coriander and some salt to taste. Give it all a good stir, and set aside.", "Cut the fish fillets in half lengthways, so you have long fingers, and arrange in a shallow roasting tin. Mix together the cumin, paprika and salt, and sprinkle over the fish fillets. Mix the garlic and the oil in a small bowl. Drizzle the fish with the garlicky oil, and roast in the oven for 8–10 minutes, depending on the thickness of your fillets. Check to see if the fish is cooked through (though only just) before taking out of the oven.", "Once you’ve taken the fish out (though don’t let it get cold) turn off the oven and warm the tortillas in the fading heat. Meanwhile, peel, stone and slice the avocados, then spritz with the juice of the lime, ready to serve with the other accompaniments.", "Arrange the fish on a plate (lined with salad leaves, if so desired), sprinkle with some chopped fresh coriander, and take to the table along with the warmed tortillas. If you don’t want to add any salad to the fish directly, you may want to put a bowl of shredded iceberg or some other crisp leaves nearby.", "Put the bowls of soused, but drained, red onions, the corn relish, hot sauce and a plate of sliced avocados on the table so that everyone can load their tortillas. A plate of lime wedges and a pile of napkins are both good ideas, too. "]}, {"isVegetarian": false, "title": "Fish tacos 'Ensenada' (Tacos de Pescado Ensenada)", "url": "www_bbc_co_uk_food_recipes_fish_tacos_ensenada_42309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_tacos_ensenada_42309_16x9.jpg", "ingredients": ["2 chipotles en adobo, finely chopped ", "3 tbsp mayonnaise ", "3 tbsp soured cream", "½ lime, juice only", "flaked sea salt and freshly ground black pepper", "2 large ripe tomatoes, deseeded and finely chopped", "½ onion, finely chopped", "handful fresh coriander, roughly chopped", "1 green serrano or jalapeno chilli, finely chopped", "1 lime, juice only", "1 litre/1¾ pints corn or vegetable oil", "300g/10½oz plain flour ", "½ tsp baking powder", "275ml/9½fl oz ice-cold lager", "600g/1lb 5oz cod fillet, preferable Icelandic, cut into chunks", "12 corn tortillas ", "½ small white cabbage, finely shredded", "1 avocado, diced", "hot chilli sauce"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the chipotle crema, mix the ingredients together with a pinch of salt in a small bowl and set aside. ", "To make the salsa, mix all the ingredients together with ½ teaspoon of salt in a small bowl, and set aside.", "Heat the oil in a large heavy-based pan to 190C (CAUTION: hot oil can be dangerous. Do not leave unattended). ", "To make the batter, sift 200g/7oz of the flour, 1 teaspoon of salt and the baking powder into a large bowl. Whisk in the lager until smooth. Tip the remaining100g/3½oz flour into a small bowl and season well with salt and pepper. ", "In batches, coat the fish in the seasoned flour, shake off the excess, then dip into the batter. Fry each piece for 2–3 minutes, until crisp and golden-brown. Repeat until all the fish is cooked. Drain each batch on kitchen paper to remove any excess oil. Sprinkle lightly with salt. ", "Warm the tortillas in a dry frying pan, microwave or oven. ", "Serve the fish immediately in the warm tortillas, with the cabbage, avocado, salsa and sauces on the side. "]}, {"isVegetarian": false, "title": "Fish triple decker", "url": "www_bbc_co_uk_food_recipes_fish_triple_decker_52632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "1 x 200g/7oz haddock fillet, or similar white fish", "splash tomato ketchup", "4 black olives, pitted, chopped", "2 small chestnut mushrooms, chopped", "2 sprigs fresh curly-leaf parsley, leaves only, chopped", "1 rounded tbsp sweetcorn", "25g/1oz grated cheddar", "1 slice day-old bread, crusts removed, grated", "pinch freshly ground black pepper", "steamed green vegetables, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with baking parchment and brush the paper all over with vegetable oil. ", "Place the haddock fillet onto the baking tray, spread a little tomato ketchup all over the top of it, then sprinkle over the chopped olives, mushrooms, parsley and sweetcorn.", "In the bowl, mix together the cheddar and breadcrumbs, then season with freshly ground black pepper. Cover the fish with the breadcrumb mixture.", "Transfer the haddock to the oven and bake for 18-20 minutes, or until the fish is completely cooked through and the breadcrumbs are golden-brown. (The fish is cooked through when it is opaque throughout and flakes easily.) Serve with steamed green vegetables."]}, {"isVegetarian": false, "title": "Fish with lemon and brown butter sauce", "url": "www_bbc_co_uk_food_recipes_fish_with_lemon_and_80186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fillets of lemon sole (about 150g/5oz each), skin removed", "3 tbsp plain flour", "½ tsp salt", "2 pinches freshly ground black pepper", "1½ tbsp sunflower oil", "45g/1½oz butter, cut into cubes", "½ lemon, juice only", "1 tbsp chopped flatleaf parsley", "1 tbsp small capers (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Check the fish for small bones and use tweezers to pull out any that you find.", "Mix the flour with the salt and pepper and spread out over a large plate. Pat the fish fillets in the flour so they are evenly coated, and shake off any excess.", "Heat the oil in a large frying pan over a high heat. When the oil is smoking hot, place the fish fillets in the pan and lower the heat to medium. Cook for 1-2 minutes on one side until golden-brown, then turn the fillets over and cook for a further 1-2 minutes until the second side is golden-brown. (Flatfish fillets need only 1-2 minutes cooking on each side. If you’re cooking thicker slices or fillets from a fish like trout (2-3cm/1in thick), then 3-4 minutes on each side should be fine.) ", "When cooked remove the fish from the pan and wrap the fish in aluminium foil to keep warm.", "Wipe the pan with paper towels and return to a medium heat. Add the cubes of butter and heat until they melt and become light brown, then turn off the heat and add the lemon juice (stand back a little as it will splutter). ", "Add the parsley and capers (if using), and swirl the contents of the pan around. Return the fish to the pan, spoon over the juices and serve immediately."]}, {"isVegetarian": false, "title": "Fishcakes", "url": "www_bbc_co_uk_food_recipes_fishcakes_1915", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fishcakes_1915_16x9.jpg", "ingredients": ["450g/1lb potato, chopped into chunks", "450g/1lb mixed frozen fish such as cod, haddock, salmon, smoked haddock", "2 tbsp chopped fresh parsley", "1 free-range egg, beaten", "vegetable oil, for frying", "salt and freshly ground black pepper"], "serves": "Makes 8-12 cakes", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "For the mashed potato, bring a pot of salted water to the boil. Add the potatoes to the pot and cook until tender, this should tabke about 15 minutes. When cooked drain in a colander and leave to drain for a few minutes. Return to the pot and mash with a potato masher until a smooth consistency is achieved. Set aside. ", "Put the frozen fish on a roasting tin and cook in the oven for about 10-15 minutes until opaque and starting to flake. When cool enough to handle, remove the skin and any bones and flake the fish into large chunks.", "Mix the fish, mashed potato, parsley and egg together until well combined. (Mix together carefully so as not to break up the fish too much.) Season with salt and pepper. Shape the mixture into 8-12 patties, depending on how large you want them to be and set aside to chill in the fridge for one hour. ", "Heat vegetable oil in a frying pan and fry the fish cakes until golden brown on each side and heated right through. Serve with tartare sauce and a simple salad. "]}, {"isVegetarian": false, "title": "Fishcakes and creamy peas", "url": "www_bbc_co_uk_food_recipes_fishcakes_and_creamy_01930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz potatoes, chopped  ", "25g/1oz butter ", "salt and pepper ", "360g/12oz frozen white fish fillets (such as Coley or Pollock), defrosted, skin and bones removed ", "2 tbsp plain flour", "1 egg, beaten ", "150g/5½oz breadcrumbs (made from 4-5 slices of bread, broken into breadcrumbs and dried slightly) ", "1 tbsp olive oil ", "25g/1oz butter ", "1 onion, finely sliced", "300g/10½oz frozen peas ", "100g/3½oz cream cheese "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the fish cakes, cook the potatoes in a large saucepan of boiling water until tender. Drain and set aside to dry for a couple of minutes. ", "Mash with a potato masher until smooth then mix in the butter. Taste and add salt and pepper as necessary.  Set aside to cool.", "Meanwhile, half fill a frying pan with boiling water and place over a medium heat. Add the defrosted fish fillets and poach gently for 5-6 minutes, or until just cooked through. Drain, pat dry with kitchen paper and leave to cool for 10 minutes. ", "Break the fish into flakes and add to the mashed potato. Taste and add salt and pepper as necessary.", "Put the flour into a shallow bowl and season with a pinch of salt and pepper. Put the beaten egg in a separate shallow bowl and the breadcrumbs in another shallow bowl. Shape the potato and fish mixture into four large patties.", "Dust a fishcake in the flour, shaking off any excess, then dip into the egg, making sure all sides are coated and finally roll in the breadcrumbs, coating all the sides in crumbs. Set to one side while you repeat with the other fishcakes. At this point the fishcakes can be chilled for up to 24 hours until needed, but otherwise refrigerate for at least 20 minutes to allow them to firm up.", "Line a baking tray with baking paper and place the fishcakes on top. Drizzle with olive oil and bake for 15-20 minutes, turning after 10 minutes.", "While the fishcakes are cooking, make the creamy peas. Heat a sauté or frying pan over a medium-high heat. Add the butter and, once hot, add the onion along with a pinch of salt. Fry gently until the onions are tender and translucent. Add the peas and crush lightly with the back of a fork. Once the peas are heated through, stir in the cream cheese until melted. Taste and add salt and pepper as necessary. ", "Serve the hot fish cakes with the creamy peas alongside. "]}, {"isVegetarian": false, "title": "Fishcakes with lime and caper yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_fishcakeswithlimeand_81289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz hot-smoked trout", "100g/3½oz ready-made mashed potato", "pinch dried chilli flakes", "1 tbsp chopped fresh coriander", "1 free-range egg", "2 tbsp sesame seeds", "1 tsp chopped fresh coriander, to garnish", "2 tbsp capers, finely chopped", "75g/2¾oz Greek yoghurt", "1 tsp finely chopped fresh chives", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the fish cake, place the mashed potato, smoked trout, chilli flakes, coriander and egg into a large bowl and mix together well. Season the mixture well with salt and freshly ground black pepper and shape into a ball.", "Roll the fishcake in the sesame seeds until coated, then flatten to a patty shape.", "Heat the oil in a frying pan over a medium heat. Add the fishcake and fry for three minutes on each side, until golden and cooked through.", "To make the dressing, place the capers, yoghurt, chives and lime juice into a bowl. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the fishcake in the centre of a warm plate, spoon some of the dressing around the plate and sprinkle over the chopped coriander."]}, {"isVegetarian": false, "title": "Fishcakes with cheddar sauce", "url": "www_bbc_co_uk_food_recipes_fishcakeswithcheddar_93165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/17½oz hake steaks", "sea salt and freshly ground black pepper", "250ml/9fl oz milk, plus extra for the cheddar sauce", "1 bay leaf", "500g/17½oz cold mashed potatoes", "3 free-range eggs", "1 heaped tbsp chopped fresh curly parsley", "freshly ground white pepper", "4 tbsp plain flour", "1 x 200g/7oz packet golden breadcrumbs", "vegetable oil, for shallow frying", "50g/2oz unsalted butter", "2 tbsp plain flour", "175g/6oz cheddar cheese", "salt and freshly ground black pepper"], "serves": "Makes 4 large fishcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the hake into a large pan and season with sea salt and freshly ground black pepper. Pour over the milk and add the bay leaf, then cover the pan with aluminium foil and gently poach the fish over a medium low heat for 25 minutes, or until the fish is cooked through (the flesh should be opaque and flake easily). ", "Set the fish aside to cool, then flake the flesh into a bowl and discard the bones. Strain the poaching liquid into a measuring jug, discarding any solids. Add enough milk to the liquid to bring it up to 500ml/17½fl oz, then set aside for making the cheese sauce later.", "In a large bowl, carefully fold together the fish, mashed potatoes, one beaten egg and the parsley until well combined. Season, to taste, with salt and freshly ground white pepper. ", "With damp hands, divide the mixture into four equal portions and form into patties. Dust the fishcakes in the flour, dip into the remaining beaten egg and roll in the breadcrumbs. ", "Heat a few tablespoons of vegetable oil in a frying pan and fry the fish cakes for 2-3 minutes on both sides, or until golden-brown and crisp all over.", "For the cheddar cheese sauce, melt butter in a pan set over a medium heat, then beat in the flour. Cook the mixture for 2-3 minutes, then gradually whisk in the reserved milk mixture until smooth. Cook for 10-12 minutes, or until the sauce is thickened slightly, then stir in the grated cheddar cheese until melted. Season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the cheddar cheese sauce over the fishcakes."]}, {"isVegetarian": false, "title": "Fish finger butty", "url": "www_bbc_co_uk_food_recipes_fishfingerbutty_89301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz assorted cooked fish (salmon, whiting, pollack)", "salt and freshly ground black pepper", "100g/3½oz plain flour", "2 free-range eggs", "100g/3½oz polenta  ", "vegetable oil, for shallow frying", "200ml/7fl oz ready-made mayonnaise", "1 tbsp English mustard", "1 tbsp capers, rinsed and drained", "1 tbsp finely chopped gherkins", "4 burger buns", "handful rocket", "4 lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Break up the cooked fish with a fork in a bowl. Season with salt and freshly ground black pepper.", "Divide the fish mixture into 12 even portions, then mould into finger-shapes about 7.5cm/3in long and 2.5cm/1in thick.", "Dredge the fish fingers in the flour, then dip into the beaten egg.", "Dip the fish fingers into the polenta to coat completely.", "Heat the oil in a frying pan over a medium heat. Add the polenta-coated fish fingers and fry for 2-3 minutes, turning regularly, until golden-brown ll over and warmed through.", "For the tartare sauce, place all of the tartare sauce ingredients into a bowl and mix well. ", "To serve, place a spoonful of tartare sauce onto each bun, then add a little rocket.", "Top each with three fish fingers and a squeeze of lemon."]}, {"isVegetarian": false, "title": "Fish in a hot and sour sauce", "url": "www_bbc_co_uk_food_recipes_fishinahotandsoursau_74007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fresh white fish fillets such as sole or plaice", "cornflour, for dusting", "150ml/5fl oz groundnut oil", "150ml/5 fl oz chicken stock", "2 tbsp Shaoxing rice wine or dry sherry", "1½ tbsp dark soy sauce", "2 tbsp chilli bean sauce (available from Asian grocers)", "½ tsp freshly ground white pepper", "2 tbsp Chinese black rice vinegar or cider vinegar", "2 tsp sugar", "3 tbsp finely chopped spring onions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the skin from the fish. Cut the fillet across the width and at a slight diagonal into 2.5cm (1in) wide strips. Dust the pieces with cornflour, shaking off any excess.", "Heat a wok until it is very hot. Add the oil and fry the fish strips gently for 2-3 minutes until golden brown. ", "Drain the cooked fish strips on kitchen paper.", "Pour off all the oil. Wipe the wok and reheat. Add all the hot and sour sauce ingredients, bring to a boil then simmer. ", "Add the fish strips and simmer in the sauce for two minutes. ", "Serve on a warm platter garnished with spring onions."]}, {"isVegetarian": false, "title": "Fish chowder with 'piri-piri' sauce and fennel salad", "url": "www_bbc_co_uk_food_recipes_fishchowderwithpirip_92209", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 tbsp olive oil ", "2 onions, peeled, finely chopped ", "pinch sea salt", "3 garlic cloves, peeled, finely chopped", "100g/3½oz cooking chorizo, skin removed, roughly chopped", "1 medium red chilli, finely sliced ", "reserved fennel stem, finely chopped (see below)", "1 red pepper, seeds removed, sliced", "salt and freshly ground black pepper", "2 large floury potatoes, such as Maris Piper or King Edward, peeled, chopped ", "pinch saffron threads, infused in 1 glass dry white wine", "500ml/17fl oz fish stock or vegetable stock", "1 x 400g/14oz can chopped tomatoes", "8-12 fresh prawns, heads and shells removed, de-veined ", "450g/1 lb cod fillet, skin removed, chopped", "8-12 mussels, rinsed, cleaned, de-bearded (discard any mussels that do not close tightly when tapped)", "1 fennel bulb, finely sliced, stem reserved for chowder, green fronds reserved for the piri-piri sauce ", "1 red chilli, finely chopped", "bunch fresh flatleaf parsley, leaves only ", "½ lemon, juice only ", "reserved green fennel fronds, finely chopped (see above)", "6 small fresh red chillies, finely chopped", "3 ripe tomatoes, skins removed, chopped", "1 tsp salt flakes", "1 tbsp finely chopped garlic, plus 1 garlic clove, peeled and cut in half", "4-6 tbsp olive oil", "2 tbsp red wine vinegar", "4-6 thick slices crusty white bread", "4-6 tbsp olive oil", "large pinch salt", "4-6 wild sea bass fillets (about 500g/1 lb in total), skin scored several times using a sharp knife", "3-4 tbsp olive oil", "salt, to taste", "½ lemon"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish chowder, heat the olive oil in a large, lidded saucepan over a medium heat. Add the onions, salt and garlic and fry for 2-3 minutes, or until softened. ", "Add the chorizo and chilli and continue to fry for 3-4 minutes, or until the chorizo is crisp and has darkened in colour.", "Add the chopped fennel stem and red pepper and season, to taste, with sea salt and freshly ground black pepper. Continue to fry for 2-3 minutes.", "Add the chopped potatoes and fry for 3-4 minutes, or until coloured. ", "Add the wine and saffron mixture to the pan, scraping any browned bits up from the bottom of the pan to deglaze. ", "Add the stock and all of the canned tomatoes and bring the mixture to a simmer. Continue to simmer for 15-20 minutes, or until the potatoes are tender and the volume of liquid has reduced by half.", "Add the prawns, cod and mussels, cover the pan with a lid and bring the mixture back to a simmer. Steam for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking).", "Meanwhile, for the fennel salad, in a glass or ceramic bowl, mix together the sliced fennel, chopped red chilli and parsley leaves until well combined. Squeeze over the lemon juice and mix well to coat the vegetables. Set aside.", "Meanwhile, for the 'piri-piri' sauce, in a bowl, mix together the fennel fronds, chillies, tomatoes and garlic. Season, to taste, with salt. Drizzle over the olive oil and red wine vinegar and stir to combine.", "For the bread, rub the bread slices all over with the halves of garlic. Drizzle both sides of each slice with a dash of olive oil. ", "Heat a griddle pan over a medium heat. When the pan is hot, add the bread slices, in batches, and grill for 1-2 minutes on each side, or until golden-brown griddle marks appear on both sides. Repeat the process with the remaining batches of bread slices. Keep warm.", "For the sea bass, drizzle the sea bass fillets with olive oil and sprinkle the salt over the skin. ", "Heat a griddle pan over a high heat. When the pan is hot, add the sea bass fillets, skin-side down and griddle for 2-3 minutes, or until the skin is crisp.", "Turn the fish fillets over and fry for a further minute, or until the sea bass is cooked through. Drizzle over the lemon juice.", "To serve, spoon the fish chowder equally among four to six serving bowls. Place one of the sea bass fillets on top of each serving. Sprinkle over the chopped parsley. Serve the bread alongside, with the 'piri-piri' sauce spooned over it."]}, {"isVegetarian": false, "title": "Fish fingers with chive yoghurt dip", "url": "www_bbc_co_uk_food_recipes_fishfingerswithchive_79025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "1 lemon sole fillet, cut into strips", "110g/4oz plain flour", "1 free-range egg", "salt and freshly ground black pepper", "splash of carbonated water ", "110g/4oz Greek yoghurt", "2 tbsp fresh chives, chopped", "squeeze of lime juice", "½ lime, cut into wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a heavy bottomed saucepan, a third full of vegetable oil, until a breadcrumb sizzles in it. (CAUTION: hot oil can be dangerous! Do not leave unattended.)", "Place the flour in a large bowl and beat in the egg and salt and freshly ground black pepper, to taste. ", "Add the carbonated water and whisk to create a batter the consistency of double cream.", "Dredge the sole pieces in flour then dip pieces into the batter to coat.", "Place in the hot oil and deep-fry for 2-3 minutes, until crisp and golden. Carefully remove using a slotted spoon and drain on kitchen towels. ", "To make the dip, mix the yoghurt with the chives and lime juice. Transfer to a serving bowl.", "Serve the fish fingers on a plate with the dip and lime wedges alongside."]}, {"isVegetarian": false, "title": "Fish mousse", "url": "www_bbc_co_uk_food_recipes_fishmousse_75672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["chunk of bread", "1 plaice fillet", "handful dill", "100ml/3½fl oz double cream", "1 free-range egg", "1 orange, juice only", "100ml/3½fl oz cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 220C/425F/Gas 7.", "Blend the bread, cream, plaice, dill and egg in a food processor.", "Pour into a lined and greased round ramekin dish and place in a bain-marie.", "Bake in the oven for 8-10 minutes.", "For the cream, place the cream and juice in a saucepan. Bring to the boil and reduce for 1-2 minutes.", "Turn out onto a plate and drizzle with orange cream."]}, {"isVegetarian": false, "title": "Fish pie with sweet potato topping", "url": "www_bbc_co_uk_food_recipes_fishpiewithcrunchysw_89434", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, chopped", "2 garlic cloves, chopped", "splash water", "100ml/3½fl oz hot fish stock", "100g/3½oz haddock, skin removed, chopped", "75ml/2½fl oz double cream", "4 tbsp chopped fresh chervil", "salt and freshly ground black pepper ", "½ sweet potato, peeled, sliced very thinly on a mandoline"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the olive oil in a pan, add the onion and garlic and fry for 3-4 minutes until softened.", "Add the water and hot fish stock and boil for three minutes. ", "Add the chopped haddock and cook for three minutes. ", "Add the cream and three tablespoons of the chervil and season, to taste, with salt and freshly ground black pepper. Simmer for 1-2 minutes, then pour the mixture into a gratin dish.", "Place the sweet potato slices on top of the fish sauce mixture, drizzle with the remaining olive oil, and season, to taste, with salt and freshly ground black pepper. Place under a medium grill for 4-5 minutes, or until the top is crisp and golden-brown.", "Serve the fish pie at the table in the gratin dish, and garnish with the remaining chopped chervil."]}]