[{"isVegetarian": true, "title": "Passion fruit ice cream cake with coconut-caramel sauce", "url": "www_bbc_co_uk_food_recipes_passion_fruit_ice_cream_67878", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/passion_fruit_ice_cream_67878_16x9.jpg", "ingredients": ["300ml/10fl oz double cream ", "4 passion fruit ", "4 tsp orange liqueur ", "8 shop-bought meringue nests ", "50g/1¾oz unsalted butter ", "50g/1¾oz soft light brown sugar ", "50g/1¾oz caster sugar ", "3 tbsp golden syrup ", "250ml/9fl oz coconut cream (not creamed coconut) "], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Line your loaf tin with cling film, leaving plenty of overhang on the sides of the tin so that you can cover the top later. ", "To make the ice cream cake, whip the double cream until ripples start to appear in the bowl and it’s slightly thickened but not stiff. Add the pulp, seeds and juice of the passion fruit, then the liqueur and fold briefly just to combine. ", "Break up the meringue nests, making a mixture of both dust and small pieces of meringue, and very gently fold in, until evenly mixed.", "Spoon gently into the lined loaf tin, pressing down as you go so that you don’t have any air pockets. Once the mixture is carefully packed in and the top smoothed, cover with the cling film overhang, then wrap the tin in another sheet of cling film and put in the freezer overnight. ", "To make the sauce, gently melt the butter, sugars and golden syrup in a deep, heavy- based saucepan about 20cm/8in in diameter. Once melted, turn the heat up a little and let it simmer for 3 minutes. Lift the pan up off the heat every now and again and give it a swirl. ", "Add the coconut cream when the pan is off the heat and swirl again, then put back on the heat and cook at a fast simmer for about 10 minutes, stirring every now and then, until it’s the colour of peanut butter and slightly thickened (it will thicken more once cooled). ", "Pour the sauce into a heatproof jug and leave to cool to room temperature. The sauce will thicken too much if refrigerated. ", "When you are ready to serve, take the tin out of the freezer, remove the outer layer of cling film then lift out the ice cream cake and sit it on a board before fully unwrapping. Cut into thick slices; if you don’t want to eat all the cake at one sitting, wrap the remaining unsliced loaf up and put it back in the freezer. ", "Put a slice onto each plate and leave to soften for 5–10 minutes, depending on the warmth of your kitchen. Zigzag some of the coconut-caramel sauce over each slice – stirring it briskly first if it’s got too thick – and pour the rest into a serving jug to take to the table alongside. "]}, {"isVegetarian": true, "title": "Passion fruit pavlova with a lemon posset filling", "url": "www_bbc_co_uk_food_recipes_passion_fruit_pavlova_48479", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 egg whites", "180g/6¼oz caster sugar", "180g/6¼oz icing sugar", "600ml/20fl oz double cream", "150g/5½oz caster sugar", "2 large lemons, juice and zest only", "4 passion fruit, seeds removed", "600ml/20fl oz double cream", "10-15 passion fruit, seeds removed", "lemon verbena leaves, to decorate"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pavlova, preheat the oven to 100C/80C Fan/Gas ¼ and line a large baking tray with baking parchment.", "Beat the egg whites with the caster sugar until stiff peaks form when the whisk is removed. Add the icing sugar and continue to beat for 4-6 minutes, or until the mixture is smooth and shiny. ", "Spoon the mixture onto the prepared baking tray creating a circle shape approximately 30cm/12in wide. ", "Bake for 2 hours. Once cooked, allow the pavlova to cool slightly before removing from the baking tray using a palette knife. Transfer to a cooling rack and set aside.", "For the passion fruit and lemon posset, slowly bring the double cream and sugar to the boil in a large saucepan over a low heat, stirring well to dissolve the sugar in the cream. Boil for 3 minutes, then remove from the heat and set aside to cool.", "Once the cream mixture has cooled, whisk in the lemon juice, zest and passion fruit juice and seeds. Pour the posset mixture into a glass bowl and chill in the fridge for at least 3 hours.", "Whip the double cream until soft peaks form when the whisk is removed. Fold the posset into the cream (you can leave streaks of posset if desired).", "To serve, spoon the cream and posset mixture on the top of the pavlova and decorate with the passion fruit seeds and lemon verbena."]}, {"isVegetarian": true, "title": "Passion fruit soufflé with passion fruit ice cream and lemon shortbread", "url": "www_bbc_co_uk_food_recipes_passion_fruit_souffl_10439", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["568ml/1 pint double cream", "1 vanilla pod, split lengthways", "12-14 passion fruit", "6 medium free-range egg yolks", "150g/5½oz caster sugar ", "90g/3¼oz icing sugar", "185g/6½oz plain flour, plus extra for flouring", "60g/2¼oz cornflour", "30g/1oz ground almonds", "250g/9oz butter, cut into cubes, plus extra for greasing", "2 drops almond essence", "1 lemon, zest only", "caster sugar, for dusting", "butter, for greasing", "2 tbsp caster sugar", "4 medium free-range egg whites", "120ml/4fl oz fresh ready-made custard", "1 passion fruit, halved, seeds and pulp scraped out"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the passion fruit ice cream, place the cream, vanilla pod and seeds, and passion fruit into a large saucepan and heat until it starts to simmer gently.", "Place the egg yolks and sugar in a large mixing bowl and whisk until it thickens and turns pale.", "Gradually add the cream mixture to the bowl, continually whisking. Once you have added all the liquid, pour it back in the pan. ", "Cook until the mixture thickens. Transfer to an ice cream machine for 40-50 minutes before freezing, or follow the manufacturer’s instructions.  ", "For the lemon shortbread, line two baking trays with silicone paper or baking parchment.", "Sift the icing sugar, flour and cornflour together into a bowl and add the ground almonds.", "Transfer the flour mixture to a food processor. Add the butter and pulse until there are no visible lumps of butter.", "Add the almond essence and lemon zest. Pulse again, then turn the mixture out onto a lightly floured surface and bring together to form a smooth dough.", "Dust the work surface with flour and roll out the dough. Cut out shapes as desired and place on the baking tray. ", "Transfer to the oven and bake the shortbreads for 8-12 minutes, or until they are a light golden-brown colour. Dust with caster sugar.", "Remove from the oven and allow to cool. ", "For the passion fruit soufflé, preheat the oven to 180C/350F/Gas 4. Grease two ramekin dishes with butter and sprinkle with one tablespoon of the caster sugar.", "Place the egg whites into a large clean bowl and whisk until stiff peaks form when the whisk is removed. Add the remaining sugar and whisk again until thick and glossy.", "Place the custard in a separate large bowl, add the passion fruit seeds and pulp and mix well. Gently fold in the whisked egg whites. Spoon the mixture into the prepared ramekins and place onto a baking tray.", "Bake for 15-20 minutes, or until risen and golden-brown.", "Dust with icing sugar before serving.", "To serve, place the soufflé in the middle of the plate and drop a quenelle of ice cream in the centre of the soufflé. ", "Serve with the lemon shortbread on the side of the plate."]}, {"isVegetarian": false, "title": "Passion fruit and lime Charlotte russe", "url": "www_bbc_co_uk_food_recipes_passionfruit_and_lime_35313", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/passionfruit_and_lime_35313_16x9.jpg", "ingredients": ["3 medium free-range eggs, separated", "70g/2½oz caster sugar", "½ tsp vanilla extract", "60g/2¼oz plain flour", "1 tbsp cornflour", "pinch of salt", "pinch of cream of tartar", "25g/1oz icing sugar", "450ml/16fl oz full-fat milk", "6 free-range egg yolks", "75g/2¾ oz caster sugar", "7 leaves gelatine, soaked in cold water for 10 minutes ", "200ml/7fl oz passion fruit purée (available from some large supermarkets)", "350ml/12oz double cream", "2 limes, finely grated zest and juice only ", "125g/4½oz caster sugar", "3 sheets gelatine, soaked in cold water for 10 minutes", "green food colouring", "450g/16oz fresh fruit, such as strawberries "], "serves": "Serves 10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line the base and sides of a deep, 20cm/8in springform cake tin with baking parchment. Line 2 baking sheets with baking parchment and draw ten 11cm/4¼in lines, 2½cm/1in apart on each sheet. Turn the parchment over so the ink/pencil line is underneath, to use as a template. ", "For the savoiardi, whisk the egg yolks and half of the sugar together with an electric hand whisk until pale, creamy and thick enough to leave a trail on the surface when the whisk is removed (known as the ribbon stage). Add the vanilla extract and whisk again. Sieve the flour, cornflour and salt over the mixture and gently fold in. ", "In a clean bowl, whisk the egg whites and cream of tartar until soft peaks form when the whisk is removed. Add the remaining sugar one spoonful at a time, whisking continuously to a glossy meringue. Gently fold the meringue into the egg and flour mixture in 3 batches - keeping as much air in the mixture as possible - until all the flour is incorporated. ", "Spoon the mixture into a piping bag fitted with a 12mm/⅝in plain nozzle and pipe the mixture in straight lines along the lines on the prepared baking parchment. Sieve the icing sugar over the top and bake for 10-12 minutes until fairly firm but a bit spongy (they will harden up as they cool).", "Remove from the oven and immediately transfer the sheets of savoiardi onto cooling racks. Leave to cool for 2-3 minutes, then remove form the baking parchment with a palette knife. Leave to cool completely on a wire rack. ", "For the bavarois, pour the milk into a pan and heat until just under boiling point. Whisk the egg yolks and caster sugar together until pale and creamy. Pour the hot milk over the eggs and whisk together. Drain the gelatine, squeezing out any excess moisture and then add to the mixture. Return the custard to the pan and cook gently until the mixture is thick enough to coat the back of a spoon (do not boil as the custard might split). Remove from the heat.", "Transfer to a clean bowl and leave to cool slightly before folding in the passion fruit purée. Leave to cool completely. ", "In a bowl, whip the cream until soft peaks form when the whisk is removed then fold into the passion fruit bavarois. ", "When the savoiardi are cold, stand them vertically, next to each other, around the inside edge of the tin. Arrange them tightly together to form a seal and squash them slightly together so they remain upright. Spoon the bavarois into the savoiardi lined tin. Cover with cling film and chill in the fridge for 3-4 hours until set.", "For the lime jelly, place the lime zest and juice, sugar and 150ml/5fl oz water in a pan. Bring to the boil, stirring until the sugar has dissolved. Remove from the heat. ", "Drain the gelatine, squeezing out any excess moisture and add it to the pan. Stir until the gelatine has dissolved, then pass through a fine sieve into a jug. Add the food colouring paste to make a lime green jelly. Leave to cool until just beginning to set, then pour over the surface of the set bavarois and chill for 3-4 hours until set.  ", "When ready to serve, remove the Charlotte from the tin and place on a serving plate or cake stand. Remove the baking paper and decorate with fruit. "]}, {"isVegetarian": true, "title": "Passion fruit and custard soufflé", "url": "www_bbc_co_uk_food_recipes_passionfruitandcusta_86197", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "2 tbsp caster sugar", "4 medium free-range egg whites", "120ml/4fl oz fresh ready-made custard", "1 passion fruit, halved, seeds and pulp scraped out", "25g/1oz butter", "1 tbsp caster sugar", "2 medium bananas, peeled and halved lengthways", "vanilla ice cream", "few sprigs fresh mint"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease two ramekin dishes with butter and sprinkle with one tablespoon of the caster  sugar.", "Place the egg whites into a large clean bowl and whisk until stiff peaks form when the whisk is removed. Add the remaining sugar and whisk again until thick and glossy.", "Place the custard into a separate large bowl, add the passion fruit seeds and pulp and mix well. Gently fold in the whisked  egg whites. Spoon the mixture into the prepared ramekins and place onto a baking sheet.", "Transfer to the oven and bake for 15-20 minutes, or until risen and golden-brown.  ", "Meanwhile, for the bananas, heat the butter in a non-stick pan until it turns slightly brown. Add the sugar and the bananas and cook, stirring frequently, until the bananas are golden-brown all over.", "To serve, place the soufflés onto serving plates in their ramekin dishes. Place the bananas alongside and serve  with a scoop of vanilla ice cream. Garnish with fresh mint."]}, {"isVegetarian": false, "title": "Passion fruit delice with autumn berries", "url": "www_bbc_co_uk_food_recipes_passionfruitdelicewi_92675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["370g/13¼oz caster sugar", "325ml/11½fl oz water", "30g/1¼oz liquid glucose", "170g/6oz caster sugar", "5 tbsp water", "3 free-range egg whites", "16 passion fruit, pulp only", "50ml/2fl oz sugar syrup (see above)", "12g/½oz powdered milk", "½ vanilla pod", "3 free-range egg yolks", "25g/1oz caster sugar", "4½ gelatine leaves, soaked in cold water for 15 minutes, drained, squeezed dry", "20ml/¾fl oz passion fruit liqueur", "400ml/14fl oz double cream, whipped until soft peaks form when the whisk is removed", "½ ready-made round sponge flan base, cut in half horizontally to form two thinner cakes (second cake reserved for another recipe)", "50ml/1¾fl oz sugar syrup (see above)", "5 passion fruit, pulp only", "3 gelatine leaves, soaked in cold  water for 15 minutes, drained", "200g/7¼oz fresh blackberries", "200g/7¼oz fresh redcurrants", "1 passion fruit, inner pulp only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sugar syrup, place all the syrup ingredients into a pan and bring to the boil, stirring occasionally with a wooden spoon. Boil for 2-3 minutes, skimming the surface if necessary. Pass the syrup through a fine sieve and set aside until completely cooled.", "For the Italian meringue, place the sugar and water into a pan and slowly bring to the boil until the syrup reaches 110C/230F (use a sugar thermometer to check the temperature).", "At this stage, place the egg whites into a bowl and whisk until firm peaks form when the whisk is removed. ", "As soon as the sugar reaches 121C/250F, remove the pan from the heat. Immediately resume whisking the egg whites. While whisking, gradually pour the sugar and water mixture into the egg whites in a steady stream, keeping it clear of the beaters. Continue whisking for 4-5 minutes, until the meringue is tepid. ", "For the passionfruit delice, blend the passion fruit pulp and the sugar syrup in a food processor until smooth. Strain the mixture through a fine sieve.", "Place the passion fruit purée into a pan, add the powdered milk and vanilla pod and bring to the boil. ", "Place the egg yolks and sugar into a bowl and whisk until the mixture forms a ribbon when the whisk is removed (this is called the ribbon stage). Pour the passion fruit mixture onto the egg mixture, whisking continuously, then pour this custard mixture back into the pan. Heat gently, stirring continuously with a spatula, until the custard is thick enough to coat the back of the spatula (do not allow the mixture to boil).", "Remove the pan from the heat and stir the drained gelatine into the custard. Strain the custard through a conical sieve and set aside to cool. Stir occasionally to prevent a skin forming. ", "When the custard is lukewarm, gently fold in half of the Italian meringue (the remaining meringue can be used in another recipe). Stir in the passion fruit liqueur, and then fold in the whipped double cream. (You must now assemble the dessert immediately, before the gelatine causes the mixture to set.)", "Place the sponge flan bases onto a chopping board. Mix together 50ml/2fl oz of the sugar syrup and one tablespoon of the reserved passion fruit purée and brush this mixture over the sponge. Place a 25cm/10in flan ring (6cm/2½in deep) onto the sponge and cut out a circle to form the base (discard the excess sponge). ", "Fill the flan ring with the passion fruit custard mixture, leaving a small gap at the top, and carefully smooth the surface with a palette knife. Transfer to the freezer and chill for several hours. ", "For the glaze, place the sugar syrup and the passion fruit pulp into a pan and heat gently, then remove from the heat, stir in the drained gelatine and set aside to cool. Once cool, remove the delice from the freezer and spread the glaze over the top of the passion fruit filling. Transfer to the fridge to chill again before serving.", "To serve, remove the tart ring by heating the outside of the ring with a blowtorch for a few seconds, then slide the ring upwards, rotating it slightly.", "Place a slice of delice onto a serving plate and garnish with redcurrants, blackberries, and passionfruit pulp."]}, {"isVegetarian": false, "title": "Passion fruit delice with satsumas in orange liqueur", "url": "www_bbc_co_uk_food_recipes_passionfruitdelicewi_85066", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 passion fruit", "50ml/2fl oz double cream", "3 tbsp caster sugar", "2 free-range egg yolks", "1 leaf gelatine, soaked in cold water", "1 free-range egg white", "200ml/7fl oz whipping cream, whipped to soft peaks", "1 ready-made sponge cake", "4 passion fruit", "20g/¾oz caster sugar", "3 tbsp water", "1 leaf gelatine, soaked in cold water", "3 passion fruit", "3 satsumas, peeled and segmented", "3 tbsp orange liqueur"], "serves": "Makes 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the delice, scoop out the flesh from eight passion fruit, place into a food processor and blend until the seeds become well pulped. Pour the juice through a fine sieve into a small saucepan, squeezing out as much of the liquid as possible. Discard the seeds.", "Add the double cream and two tablespoons of the caster sugar. Place over a medium heat and bring to the boil, then reduce the heat to simmer until the sugar has just melted.", "Place the egg yolks into a clean bowl and add the hot passion fruit mixture, whisking constantly.", "Return the passion fruit mixture to the saucepan and cook for one minute, or until just thickened.", "Add the soaked gelatine leaf and stir well to dissolve, then remove from the heat and allow to cool.", "Meanwhile, in a separate clean bowl, whisk the egg white with the remaining tablespoon of sugar, until soft peaks form when the whisk is removed.", "Place the whipped cream into a clean bowl. Add the cooled passion fruit mixture and gently fold together to vreate a mousse. ", "Add the beaten egg white and fold into the cream mixture.", "Cut six rounds from the sponge cake using six 7.5cm/3in chefs' rings, leaving the sponge at the bottom. ", "Spoon in the mousse to fill each chefs' ring to just below the top, then place into the fridge to chill for 1-2 hours.", "For the topping, scoop out the flesh from four passion fruit and pour through a sieve into a small saucepan, squeezing out as much of the juice as possible.", "Add the caster sugar and water to the pan and place over a medium heat. Bring to the boil, then simmer until the sugar has dissolved.", "Add the gelatine leaf and stir to dissolve. Remove the pan from the heat and allow to cool.", "Remove the mousses from the fridge and carefully pour the passion fruit sauce over the top of the mousse, filling to the top of the rings. Return the rings to the fridge to cool for 30 minutes, or until the topping has set.", "For the satumas, scoop the flesh from three passion fruit into a clean bowl. Add the satsuma segments and orange liqueur and stir gently.", "To serve, place each delice into the centre of a plate. Use a mini-blowtorch to loosen the chefs' rings around the delice, then remove the ring. Spoon the satsumas around and serve."]}, {"isVegetarian": true, "title": "Passion fruit fool", "url": "www_bbc_co_uk_food_recipes_passionfruitfool_74615", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 passion fruits ", "284ml/10fl oz tub double cream", "100g/3½oz icing sugar", "1 lemon, juice only", "2 tsp Malibu or coconut rum"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the passion fruits in half, scoop out the pulp with a spoon and place in a bowl. ", "Gently whisk the cream in a large bowl and place in the fridge, along with four glasses.", "Sieve the icing sugar into a bowl, and set aside.", "When you wish to eat, whisk the icing sugar into the cream with the lemon juice and coconut rum.", "Fold in the passion fruit pulp and pour the fool into the chilled glasses.", "Serve with biscuits of your choice."]}, {"isVegetarian": true, "title": "Passion fruit puddings", "url": "www_bbc_co_uk_food_recipes_passionfruitpuddings_86768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "125g/4oz caster sugar", "40g/1½oz plain flour, plus extra for dusting", "1 tbsp whole milk", "2 free-range eggs, separated", "8 passion fruit, inner pulp only, sieved to remove seeds", "butter, for greasing", "200g/7oz caster sugar", "200ml/7fl oz water", "50ml/2fl oz coconut liqueur", "double cream, lightly whipped, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the butter and sugar into a large bowl and mix together well, until light and fluffy.", "Add the flour, milk, egg yolks and half of the passion fruit pulp, and stir until just combined.", "Whisk the egg whites in a clean bowl until stiff peaks form when the whisk is removed.", "Fold the egg whites into the passion fruit mixture.", "Divide the cake mixture among four greased and floured 6fl oz/170ml ramekins or dariole moulds and place onto a baking tray.", "Transfer to the oven and bake for 12 minutes, or until cooked through.", "Meanwhile, for the sauce, place the sugar and water into a pan over a medium heat and bring to the boil. Reduce the heat and simmer for 15 minutes, until thickened to a syrup, then remove from the heat.", "Add the remaining passion fruit pulp and the coconut liqueur and stir well.", "To serve, place the puddings in their dishes onto plates, drizzle the sauce over the top of each and top with a dollop of whipped cream."]}, {"isVegetarian": true, "title": "Passionfruit soufflé", "url": "www_bbc_co_uk_food_recipes_passionfruitsouffle_92900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz whole milk", "2 tbsp caster sugar", "2 free-range egg yolks", "1 tsp cornflour", "2 passion fruits, pulp scooped out, skins reserved"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the milk and sugar into a saucepan and bring to the boil. ", "Whisk the egg yolks and cornflour together in a bowl.", "Remove the pan from the heat and whisk in the egg yolks and cornflour mixture, whisking continuously until the mixture starts to thicken. ", "Mix the passion fruit pulp into the custard mixture, pour the souffleé mixture into the reserved hollowed-out passionfruit skins and place onto a baking tray. Transfer to the oven to cook for 5-7 minutes or until risen and golden brown. Serve immediately."]}, {"isVegetarian": true, "title": "Passion fruit soufflés", "url": "www_bbc_co_uk_food_recipes_passionfruitsouffles_88944", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 passion fruit, halved", "50ml/2fl oz white wine", "2 tbsp sugar", "1 tsp cornflour ", "1 tsp cold water", "2 free-range eggs, whites only", "1 passion fruit, halved", "1 orange, juice only", "1 tbsp icing sugar", "1 tsp cornflour", "1 tsp cold water", "100ml/3½fl oz double cream", "1 tbsp Greek-style yoghurt", "1 lime, zest only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the soufflés, scoop out the flesh from the passion fruit and place into a saucepan. Reserve the shells. ", "Add the white wine and sugar to the pan, and warm through over a low heat. In a small bowl, mix together the cornflour and water and pour into the passion fruit mixture, stirring until the liquid starts to thicken. Remove from the heat and allow to cool slightly.", "For the sauce, scoop out the flesh from the passion fruit halves and place into another saucepan over a medium heat, reserving the shells. Stir in the orange juice and icing sugar. Mix  the cornflour and cold water together to make a smooth paste, then add to the pan. Reduce the liquid over a high heat until thickened. ", "For the lime cream, whisk the cream until thickened and fold in the yoghurt and lime zest. Set aside. ", "For the soufflés In a large bowl, whisk the egg whites together until soft peaks form when the whisk is removed from the bowl. Gently fold in the passion fruit mixture, then divide the mixture equally among the four passion fruit shell halves. Place on a baking tray and bake in the oven for 2-3 minutes, or until golden-brown and risen.", "To serve, carefully transfer the passion fruit soufflés onto a plate and drizzle around the sauce. Add a spoon of lime cream on the side, dust with icing sugar and serve immediately."]}, {"isVegetarian": false, "title": "Passion fruit soufflé with passion fruit jelly and ice cream", "url": "www_bbc_co_uk_food_recipes_passionfruitsoufflew_93715", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz milk", "8 free-range egg yolks", "200g/7oz caster sugar", "400ml/14fl oz double cream", "8 passion fruit, seeds scooped out", "200g/7oz caster sugar", "200ml/7fl oz water", "6 passion fruit, seeds scooped out", "6 gelatine sheets, soaked in cold water until softened", "25g/1oz butter, softened", "4 tbsp caster sugar", "4 free-range egg whites", "175ml/6fl oz ready-made vanilla custard", "4 passion fruit, seeds scooped out", "1 chocolate-coated honeycomb bar, crumbled"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, bring the milk to the boil in a heavy-based pan. Remove from the heat immediately. ", "Place the egg yolks and sugar in a bowl and whisk until pale and fluffy. Pour the warm milk over the egg yolks, whisking well until smooth and well combined. Pour the mixture back into the pan and return to a low heat.", "Whisk in the cream and passion fruit seeds. Cook for a further 3-4 minutes, stirring occasionally, until the mixture has thickened enough to coat the back of a wooden spoon. (Do not allow the mixture to boil.)", "Remove from the heat and set aside to cool. Once cooled, pour the mixture into an ice cream machine and churn according to the manufacturer's instructions. Transfer the churned ice cream to a freeze-proof container and chill in the freezer until needed. Take the ice cream out of the freezer about 10 minutes before serving to soften slightly. ", "For the jelly, place the sugar and water into a saucepan and bring to the boil, stirring until the sugar has dissolved. Reduce the heat to a simmer and cook for 2-3 minutes, or until the mixture has thickened, then stir in the passion fruit seeds. Remove from the heat.", "Squeeze out any excess moisture from the soaked gelatine and whisk into the warm sugar mixture until dissolved. Pour the jelly mixture into the prepared baking tray and chill in the fridge for at least 1 hour, or until the jelly has set. Using a 7.5cm/3in round cutter, cut out four circles of jelly. Place onto a tray lined with cling film and place back into the fridge until needed.", "Preheat the oven to 200C/400F/Gas 6.", "For the soufflé lightly grease 4 large ramekins with the butter, then dust with half the caster sugar.", "Whisk the egg whites in a large clean bowl until soft peaks form. Add the remaining caster sugar and whisk until stiff peaks form. ", "Gently fold in the vanilla custard and passion fruit seeds until just combined. Spoon the mixture gently into the prepared ramekins and place onto a baking tray. ", "Bake the soufflés in the oven for 10 minutes, or until golden-brown and risen. ", "Meanwhile, start plating the dessert. Place a jelly round on one side of each serving plate. Top the jelly with some of the crumbled chocolate honeycomb bar, then place a scoop of ice cream on top of the crumble. Remove the risen soufflés from the oven and place alongside the jelly. Dust with icing sugar and serve immediately."]}, {"isVegetarian": true, "title": "Passion fruit tart", "url": "www_bbc_co_uk_food_recipes_passionfruittart_85085", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "75g/3oz cold unsalted butter, cut into cubes", "pinch salt", "100g/3½ oz icing sugar, sifted ", "50ml/2fl oz whole milk", "2 free-range egg yolks", "1 egg, beaten, for egg wash", "550g/1lb 3½oz caster sugar", "150ml/5fl oz water", "12 passion fruit, sieved to collect pulp and juice only", "9 free-range eggs", "300ml/10½fl oz double cream", "icing sugar, to serve"], "serves": "Serves 8-10", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, place the flour, butter, salt and icing sugar into a food processor and pulse until it begins to look like breadcrumbs.", "Add the milk and egg yolks and pulse again until it comes together as a dough. ", "Turn the dough out onto a floured work surface and roll out to a diameter 5cm/2inches larger than that a 28cm/11inch tart case. Push the pastry into the base of the tart case, leaving excess hanging over the sides, and transfer to the fridge to chill for at least 30 minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Line the chilled pastry case with aluminium foil and cover with rice or baking beans. Transfer to the oven to bake for 20 minutes, then remove the rice or beans and foil. Brush the pastry with the egg wash and return to the oven to bake for a further ten minutes, until golden brown. Remove from the oven and trim off the excess pastry with a sharp knife. Leave to cool.", "Reduce the heat of the oven to 170C/340F/Gas 3.", "For the filling, place 200g/7oz of the sugar and the water into a saucepan and heat gently until the sugar dissolves.", "Add the passion fruit juice, stir well, then remove from the heat and allow to cool.", "In a bowl, whisk the eggs with the remaining sugar, until pale and light, then add the cream. ", "Using a slotted spoon, remove three-quarters of the passion fruit pulp from the syrup and add to the cream mixture along with a tablespoon of the cooled passion fruit juice mixture. Reserve some of the remaining juices to use as extra sauce.", "Pour the egg and cream mixture into the cooked tart case, then transfer to the oven on the middle shelf to bake for about 40 minutes, or until the filling has almost set. It should still be a little bit wobbly, but will carry on cooking after it is removed from the oven and will set.", "To serve, dust the tart with icing sugar and drizzle with a spoonful of the remaining sauce."]}, {"isVegetarian": false, "title": "Linguine alla puttanesca", "url": "www_bbc_co_uk_food_recipes_pasta_puttanesca_81206", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pasta_puttanesca_81206_16x9.jpg", "ingredients": ["200g/7oz dried linguine", "2 tbsp extra virgin olive oil", "200g tin chopped tomatoes", "1 garlic clove", "2 salted anchovies, rinsed and boned, or 4 anchovy fillets", "2 pinches dried chilli flakes", "1 tbsp capers, rinsed", "12 black olives, stones removed if you wish", "handful basil leaves", "sea salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Add 2 tablespoons salt to 2 litres water and bring to the boil in a large saucepan. Add the linguine and return to the boil quickly. Cook until the linguine is al dente.", "Meanwhile, heat the oil in a frying pan. Add the tomatoes and a pinch of salt and cook over a high heat for 2–3 minutes, stirring often.", "Roughly chop the garlic and anchovies with the chilli flakes and add them to the tomatoes, turn the heat down to low and cook for 2–3 minutes, mashing the anchovies into a paste using a wooden spoon or fork. ", "Stir in the capers and olives and cook for another minute. Meanwhile, quickly drain the linguine, then add it to the sauce and heat through.", "Divide the pasta puttanesca between two plates and tear over the basil leaves before serving. "]}, {"isVegetarian": false, "title": "Pasta bolognese and ricotta tortellini with a courgette and garlic sauce", "url": "www_bbc_co_uk_food_recipes_pasta_bolognese_and_93159", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz '00' pasta flour", "1 free-range egg and 6 egg yolks", "50g/1¾oz fine semolina flour", "2 tbsp olive oil", "1 small red onion, chopped", "2 celery sticks, chopped", "1 garlic clove, finely chopped", "1 tsp chopped fresh rosemary", "150g/5½oz beef fillet, cut into strips", "150ml/5fl oz red wine", "1 x 400g tin chopped tomatoes", "50g/1¾oz unsalted butter", "125g/4½oz ricotta ", "freshly grated nutmeg, to taste", "½ lemon, zest only", "1 egg yolk, beaten", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 garlic cloves, finely sliced", "1 sprig thyme, leaves picked", "1-2 large courgettes, grated or sliced into ribbons using a vegetable peeler", "75g/2½oz unsalted butter", "75g/2½oz unsalted butter", "150g/5½oz freshly grated Parmesan"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, put the flour, egg and egg yolks into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough in a bowl, cover with cling film and place into the fridge to rest for 30 minutes.", "Cut the pasta dough in half and feed one of the pieces through a pasta machine according to the machine instructions, ending on the thinnest setting. Pass through a tagliatelle cutter. Set aside the other half for the tortellini.", "For the bolognese, heat a large, heavy-based casserole over a medium heat. When hot, add the olive oil, onion, celery, garlic and rosemary and cook until soft. Turn up the heat, add the beef and cook until browned all over. Add the wine and chopped tomatoes and bring to a simmer. Cook gently for 20-25 minutes, or until the sauce is rich and reduced. Season with salt and pepper.", "For the ricotta tortellini, put the ricotta in a bowl and season with salt and freshly ground black pepper, some freshly grated nutmeg and the lemon zest. Mix until well combined. Set aside until needed.", "Flatten the reserved pasta dough slightly with a rolling pin, then starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process, flouring the machine and changing the setting down each time, until you reach the thinnest setting. You can cut the pasta into smaller individual sheets and work on them individually, keeping the remaining unused dough covered under cling film to prevent them from drying out.", "Cut out circles from the pasta sheets using a 4-5cm/1.5-2in pastry cutter, then brush each circle with the beaten egg. Place a heaped teaspoon of the ricotta filling onto one half of the circle, then fold the other half of the pasta over and press together to seal. Bring the bottom two corners of the half-moon together to create a circle and pinch to seal. Repeat with the remaining pasta and filling mixture, placing each completed tortellini on a tray lined with greaseproof paper. Set aside.", "Cook the tortellini, in batches, in a pan of boiling salted water for 2-3 minutes, or until they float to the surface and are al dente. Remove with a slotted spoon. Reserve a little of the cooking water for the sauce.", "For the courgette and garlic sauce, heat a large frying pan until hot, add the oil and garlic and fry for 1-2 minutes. Add the thyme and courgette and a little of the pasta cooking water. Stir in the butter and season with salt and pepper.", "To serve, cook the tagliatelle for 2-3 minutes, or until al dente, then drain well and mix with the bolognese and butter. Toss everything together. Drop in the tortellini into the courgette sauce and mix just before serving. Serve the pasta bolognese and the tortellini in separate bowls, garnished with grated Parmesan cheese."]}, {"isVegetarian": false, "title": "Pasta fazool", "url": "www_bbc_co_uk_food_recipes_pasta_fazool_04131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["130g/4½oz semolina", "130g/4½oz 00 flour", "120g/4oz egg yolks (about 6 large yolks)", "1.5 litres/2½ pints chicken stock", "20g/¾oz 'nduja, chopped, or use pancetta", "½ onion, finely chopped ", "2 celery stalks, including leaves, finely chopped ", "1 small carrot, grated on a fine microplane", "small pinch dried chilli flakes", "1 garlic clove, crushed", "1 x 400g tin borlotti beans", "100-125g/4-4½oz good-quality tinned tomatoes, skinned and de-seeded ", "1 tsp tomato purée", "2-4 tbsp extra virgin olive oil ", "salt and pepper", "1 tbsp micro basil cress", "1 tbsp micro baby red vein sorrel"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the cavatelli, bring all the ingredients together in a large bowl or food processor and to form a dough. Allow the dough to rest for at least an hour in the fridge before shaping the pasta.", "To make the cavatelli, cut the pasta into pieces and roll into long batons. Cut into 1cm/½in pieces. Using a sharp knife roll the knife along the pasta to create rolled up tiny shells.", "For the pasta fazool, bring the chicken stock to the boil in a saucepan. ", "In a separate pan, on a medium-to-low heat, add the 'nduja and let some fat render out. Add the finely chopped onion and cook briefly for 2-3 minutes, just until the n’duja has melted and the onion is soft and translucent. Add the celery and carrot and cook for 5 minutes. Add the chilli and the garlic. Cook for 5 minutes without letting the garlic brown.", "Add the beans and enough of the boiling chicken stock to just cover the mixture. Let all this cook for 10 minutes and then remove about a third of the beans. Mash or blend them then put back in the pan.", "Add the tomatoes and stir, add the tomato purée, cook for a couple of minutes and season with salt and pepper, to taste. ", "Add 150g/5½oz of the pasta to the chicken stock and cook for 8-10 minutes. Then drain and add the pasta to the beans with some of the stock - the consistency should not be too soupy, but not really dry. Finish with the basil, baby red vein sorrel and a little extra virgin olive oil."]}, {"isVegetarian": false, "title": "Pasta puttanesca with garlic and red onion focaccia", "url": "www_bbc_co_uk_food_recipes_pasta_puttanesca_with_53471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz strong white flour, plus extra for dusting", "2 tsp salt", "425ml/15fl oz lukewarm water", "7g sachet dried yeast", "4 tbsp olive oil, plus extra for greasing", "4 garlic cloves, very finely chopped", "1 red onion, thinly sliced", "handful pitted black olives", "3 tbsp olive oil", "3 garlic cloves, crushed", "3 anchovy fillets", "2 x 400g tins plum tomatoes, drained", "60g/2¼oz black olives, preferably oil-cured, pitted", "2 tbsp capers", "pinch dried red chilli flakes", "450g/1lb linguine", "small handful fresh parsley or basil, roughly chopped, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the focaccia, put the flour and salt in a large bowl and make a well in the middle. Mix the lukewarm water with the yeast and 2 tablespoons oil in another bowl. Leave to stand for 10 minutes, then slowly combine the liquid with the flour until a dough forms. Turn the dough out onto a floured surface and knead for 4–5 minutes, until smooth and elastic. Lightly oil a clean mixing bowl and place the dough in it. Cover and leave to prove for 45 minutes–1 hour, or until doubled in size. Punch down the dough and knead for a further 2–3 minutes.", "Preheat the oven to 220C/200C Fan/Gas 7.", "Halve the dough and shape each half into a flat rectangle, then put them on two lightly oiled baking trays. In a bowl, mix the garlic with the remaining 2 tablespoons oil and spread over the dough. Make indents all over the dough with your thumb, then press in the onions and olives. Bake for 15–20 minutes, or until golden and firm.", "Meanwhile, make the pasta puttanesca. Warm 2 tablespoons oil in a frying pan over a medium–low heat. Add the garlic and anchovies and fry until the garlic is slightly golden. Crush the tomatoes with a fork or your hands and add to the pan. Stir in a pinch of black pepper and cook over a medium–high heat for 10 minutes, or until the tomatoes break down and create a sauce. Stir in the olives, capers and chilli flakes and simmer for 10 minutes.", "Bring a large saucepan of salted water to the boil and cook the pasta according to the packet instructions. Drain quickly, retaining a little of the cooking water, and toss the pasta and retained water with the sauce and remaining 1 tablespoon oil. Season with salt and pepper.", "To serve, place the pasta in the centre of a shallow bowl and garnish with parsley or basil. Enjoy with the focaccia."]}, {"isVegetarian": false, "title": "Pasta rotolo with creamed endive", "url": "www_bbc_co_uk_food_recipes_pasta_rotolo_with_82739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["275g/9¾oz 00 pasta flour", "2 whole free-range eggs", "3 free-range egg yolks", "olive oil, for frying", "500g/1lb 2oz cooked pork shoulder, cut into cubes", "1 fennel bulb, root and top diced, fronds reserved, head finely sliced and placed in iced water for the garnish ", "2 sticks celery, finely sliced", "1 medium carrot, finely sliced", "2 garlic cloves, finely sliced", "small bunch fresh flatleaf parsley, leaves only", "pinch of chilli flakes", "150ml/5fl oz olive oil, plus extra for frying", "50g/1¾oz dried breadcrumbs", "2 lemons, zest of 2, juice of ½", "sea salt, to taste", "2 large chicory\t", "extra virgin olive oil", "100ml/3½fl oz chicken stock", "100ml/3½fl oz double cream", "1 lemon, juice only (to taste)", "1 tbsp finely chopped chives"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pasta, place the flour in a food processor and pulse it. Add the whole eggs and egg yolks and keep whizzing until the mixture resembles fine breadcrumbs (it shouldn't be dusty, nor should it be a big, gooey ball). This takes 2-3 minutes.", "Tip out the dough and knead to form into a ball shape. Knead it briskly for one minute - it should be quite stiff and hard to knead. Wrap in cling film and leave to rest in the fridge for 30 minutes before using.", "Divide the dough into two and keep one of the pieces wrapped in cling film. Fold over the dough and pass it through the pasta machine at its widest setting, refolding and rolling seven times (not changing the setting) until you have a rectangular shape. It is important to work the dough until it is nice and shiny, as this gives it the \"al dente\" texture. ", "Continue putting the pasta through the pasta machine, decreasing the roller setting down grade by grade with each pass. Roll out each half into a sheet as wide as the pasta machine will allow on the number one thickness setting. Repeat with the second piece of dough.", "Cook the pasta in a pan of boiling salted water for one minute, drain and then refresh in ice-cold water. Drain and dry on a tea towel.", "Lay several lengths of cling film (vertically) overlapping on a work surface and place the first sheet of pasta on horizontally towards the bottom of the cling film and then overlap the second sheet of pasta over the first by approximately 3cm/1¼in to create a large sheet of pasta.", "Place a damp tea towel over the pasta to prevent it drying out while you make the filling.", "For the filling, preheat the oven to 160C/325F/Gas 3.", "Heat a dash of the olive oil in a pan and fry the diced pork until golden-brown. Add the sliced fennel tops and root, celery, carrot, garlic, parsley and chilli flakes and cook for two minutes, or until soft. ", "Add the olive oil and breadcrumbs. Stir in the lemon juice and lemon zest and season with salt to taste.", "Take off the heat, transfer to a food processor and blend to a smoothish paste. ", "Spread the pork mixture over the pasta sheet leaving a 3-4cm/1¼-1½in gap free at the top and bottom. To get the filling evenly spread out, lay cling film over the top of it and use a rolling pin to spread.", "When evenly spread out, roll it up like a Swiss roll, using the cling film to help you, keeping it nice and tight. Wrap the excess cling film around the rotolo and, if you have time, refrigerate until firm. ", "Cut into 2-3cm/¾-1¼in slices, flour lightly each side of the rotolo and fry in more of the olive oil until lightly golden-brown on each side. Transfer to a baking tray and bake for two minutes.", "For the creamed chicory, cut the chicory in half. Trim off the root and cut finely lengthways. ", "Fry for one minute in a splash of olive oil. Add the stock and cook until the liquid has reduced until it’s nearly gone, then add the cream and reduce the liquid by three-quarters. ", "Add a few drops of lemon juice to cut the richness of the cream and add salt, to taste.", "To serve, drain the now-crisp shaved fennel from the iced water and dry using a salad spinner or tea towel.", "Dress with finely crushed sea salt, freshly squeezed lemon juice, finely chopped fennel fronds and extra virgin olive oil. Serve the rotolo with the creamed chicory and fennel."]}, {"isVegetarian": true, "title": "Pasta with almond, basil and pecorino pesto (pesto alla Trapanese)", "url": "www_bbc_co_uk_food_recipes_pasta_with_almond_basil_68146", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pasta_with_almond_basil_68146_16x9.jpg", "ingredients": ["75g/2¾oz almonds in their skins", "large handful basil (about 30g/1oz), torn (reserve a few leaves for decoration)", "4 garlic cloves, chopped", "300g/10½oz cherry tomatoes, halved", "50g/1¾oz pecorino cheese (or vegetarian hard cheese), grated, plus extra to serve", "6 tbsp olive oil", "8 turns black peppermill", "½ tsp salt, plus extra for cooking", "500g/1lb 2oz spaghetti, linguine or bucatini, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and blanch the almonds for a few minutes. Drain and set aside to cool, then pinch off the skins.", "Toast the almonds in a dry frying pan over medium–high heat. Keep them moving to prevent burning; they should be a light golden colour.", "In a food processor, pulse the almonds until they resemble breadcrumbs. Add the basil and garlic and pulse a couple of times. Tip into a bowl. ", "Mix in the tomatoes, pecorino and oil. Season with the salt and pepper. ", "Bring a pan of salted water to the boil and cook the pasta until al dente. Drain it and stir the pesto through. Serve, garnished with basil, with plenty of pecorino."]}, {"isVegetarian": false, "title": "Pasta with chilli, bacon and tomato sauce", "url": "www_bbc_co_uk_food_recipes_pasta_with_chilli_bacon_13839", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pasta_with_chilli_bacon_13839_16x9.jpg", "ingredients": ["130g/5oz guanciale (cured pork cheeks), cut into small cubes", "1 small onion, finely chopped", "3-4 tbsp extra virgin olive oil", "1 hot dried red chilli, finely chopped", "2 tbsp dry white wine", "500g/1lb 2oz San Marzano tomatoes, cut into quarters", "400g/14oz bucatini pasta", "80g/3oz pecorino, freshly grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, put the guanciale and onion in a pan with the oil and chilli, and fry gently for about 4-5 minutes. Add the white wine and tomatoes and cook for a further 15–20 minutes, stirring occasionally.", "Meanwhile, bring a large saucepan of lightly salted water to the boil, and cook the pasta until al dente. Strain the bucatini and mix with the sauce. Serve sprinkled generously with the freshly grated pecorino."]}, {"isVegetarian": false, "title": "Pasta with hot-smoked salmon", "url": "www_bbc_co_uk_food_recipes_pasta_with_hot_smoked_93788", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz rigatoni or penne pasta", "2 tbsp extra virgin olive oil ", "1 white onion, finely chopped", "2 garlic cloves, lightly crushed but left whole", "salt and freshly ground black pepper", "100ml/3½fl oz chilli-flavoured vodka ", "300g/10½oz hot smoked salmon (see 'Top recipe tip' below)", "600ml/20fl oz double cream", "2 tbsp roughly chopped fresh parsley, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the pasta in a large pan filled with boiling salted water and boil according to packet instructions.", "Meanwhile, heat the olive oil in a large frying pan and fry the onion and garlic over a medium heat until soft, but not coloured – about five minutes. ", "Add a pinch of salt, bearing in mind that the salmon will be salty already, and a generous pinch of black pepper.", "Pour in the chilli vodka and ignite if you wish (take care to stand back until any flames have subsided) or simply leave for a couple of minutes to burn off the alcohol.", "Flake the salmon into the pan and pour in the cream. Cook over a low heat until the sauce has thickened and the pasta is al dente.", "Drain the pasta through a colander and add it to the pan with the salmon and cream. Toss through gently so as not to break up the salmon further and serve with a sprinkling of fresh parsley."]}, {"isVegetarian": true, "title": "Pasta and herb frittata", "url": "www_bbc_co_uk_food_recipes_pastaandherbfrittata_87227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "250g/9oz fresh tagliolini pasta, blanched and drained", "1 tbsp each finely chopped fresh parsley, basil, chives, coriander and dill", "salt and freshly ground black pepper ", "55g/2oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Crack the eggs into a large bowl and beat well. Add the pasta and herbs, season well with salt and freshly ground black pepper and stir well.", "Heat the butter in a small ovenproof frying pan, pour in the egg and pasta mixture and cook for 3-4 minutes, until set and lightly browned on the bottom.", "Place in the oven and cook for 3-4 minutes, or until cooked through.", "To serve, slide onto a plate and cut into slices."]}, {"isVegetarian": true, "title": "Pasta arrabiatta", "url": "www_bbc_co_uk_food_recipes_pastaarabiatta_83363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter, chopped", "1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, finely chopped", "½ tsp dried chilli flakes", "50ml/2fl oz white wine", "2 tomatoes, skinned and chopped", "1 tsp chopped parsley", "salt and freshly ground black pepper", "150g/5½oz pasta, cooked al dente"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the olive oil in a frying pan and fry the onion, garlic and chilli until soft.", "Add the white wine and cook to reduce by half.", "Add the chopped tomatoes and simmer for five minutes.", "Add the parsley and season well with salt and freshly ground black pepper.", "Toss the pasta through the sauce and serve in a warm bowl."]}, {"isVegetarian": false, "title": "Pasta con sarde", "url": "www_bbc_co_uk_food_recipes_pastaconsarde_91609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 tbsp extra virgin olive oil", "1 large bulb fennel, trimmed, finely sliced, fronds reserved and finely chopped", "2 small onions, finely chopped", "1 heaped tsp fennel seeds, crushed", "2-3 small fresh red chillies, finely chopped", "600g/llb 6oz sardines, scaled, gutted and filleted (you can ask your fishmonger to do this for you)", "75g/3oz raisins", "50g/2oz pine nuts", "175ml/6fl oz white wine", "175ml/6fl oz water", "salt and freshly ground black pepper ", "450g/llb dried linguine", "1-2 lemons, zest and juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat six tablespoons of the oil in a large frying pan over a low to medium heat. Add the fennel, onions, fennel seeds and chillies, then half-cover the pan with a lid. Fry gently for 18-20 minutes, or until the vegetables have softened but not coloured.", "Add half of the sardines and all of the raisins and pine nuts and stir until well combined. Remove the lid from the pan, then continue to cook over a low heat for a further 8-10 minutes, stirring and crushing the ingredients with a wooden spoon every now and then, until the sardines have fallen apart and the mixture is well combined.", "Increase the heat, add the white wine and water and bring the mixture to a simmer, stirring well. Continue to simmer until the volume of liquid has reduced by half, then return the temperature to a low heat and simmer the sauce very slowly for a further 4-5 minutes, or until it has thickened. Season, to taste, with salt and freshly ground black pepper.", "Arrange the remaining sardine fillets, skin-side up, on top of the sarde sauce, side by side, then drizzle over two tablespoons of the extra virgin olive oil.", "Cover the pan again with the lid and cook the sardines and sauce over a low heat for 7-10 minutes, or until the sardine fillets are cooked through. (NB: There is no need to stir the mixture at this stage.)", "Meanwhile, cook the linguine according to packet instructions in a large pan of boiling, salted water. When the pasta is al dente, drain well.", "Add the sarde sauce, cooked whole sardine fillets and the remaining two tablespoons of olive oil to the pan with the cooked pasta in it and mix well until the linguine is coated in the sauce. ", "To serve, divide the pasta con sarde equally among four serving plates. Squeeze a little lemon juice, to taste, over each serving. Garnish with the lemon zest and reserved fennel fronds."]}, {"isVegetarian": false, "title": "Pasta bake with cherry tomatoes and mozzarella", "url": "www_bbc_co_uk_food_recipes_pastabakewithcherryt_88844", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "55g/2oz fresh peas", "3 red cherry tomatoes", "3 yellow cherry tomatoes", "2 tbsp white wine", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "150g/5½oz penne pasta, cooked according to packet instructions", "2 slices prosciutto, cut into strips", "85g/3oz mozzarella, sliced", "a few shavings of fresh white truffle to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the oil in a frying pan and lightly fry the peas and tomatoes for 3-4 minutes. Add the wine to the pan, reduce, then pour in the cream and season, to taste, with salt and freshly ground black pepper. ", "Bring the sauce to a simmer and cook for 4-5 minutes, then stir through the cooked penne pasta. Transfer to a gratin dish, scatter over the prosciutto strips and arrange the mozzarella slices on top before transferring to the oven. Bake for 4-5 minutes, or until the mozzarella is melted and bubbling. ", "Serve with shavings of fresh truffle to garnish."]}, {"isVegetarian": true, "title": "Pasta and bean soup (Pasta e fagioli)", "url": "www_bbc_co_uk_food_recipes_pastaefagioli_92269", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastaefagioli_92269_16x9.jpg", "ingredients": ["90ml/3¼fl oz extra virgin olive oil, plus extra to serve ", "1 onion, peeled, chopped", "2 garlic cloves, peeled, chopped", "½ tsp dried chilli flakes", "600g/1lb 5oz mixed vegetables (such as courgette, fennel, swede, potato, sweet potato, leek, celery, carrot or peas), chopped into 1cm/½in cubes", "3-4 pinches dried mixed herbs (such as rosemary, oregano and thyme)", "salt and freshly ground black pepper", "1 litre/1¾ pints chicken or vegetable stock, preferably home-made", "80g/2¾oz dried pasta, such as penne", "1 x 400g/14oz can beans (such as cannellini, borlotti, haricot or chickpeas), drained and rinsed ", "2 fresh bay leaves", "50g/2oz freshly grated parmesan", "1 large or 2 small very ripe tomatoes, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 60ml/2¼fl oz of the oil in a heavy-based pan over a medium heat. Add the onion, garlic and chilli flakes and fry for 2-3 minutes, or until softened.", "Add all of the mixed vegetables (except the peas, if using) and the dried mixed herbs to the pan. Season, to taste, with salt and freshly ground black pepper. Fry for 2-3 minutes, or until the vegetables have softened. ", "Reduce the heat to medium, cover the pan with a lid and continue to fry for 10-15 minutes, stirring regularly, or until the vegetables have softened and are pale golden-brown. ", "Add the stock, pasta, beans, bay leaves and peas (if using), then bring the mixture to the boil. Return the mixture to a simmer and continue to simmer, covered, for 20-25 minutes, or until the vegetables are tender and the pasta has absorbed some of the liquid and is tender. Remove from the heat and set aside to cool slightly before serving.", "Meanwhile, in a bowl, mix together the parmesan, chopped tomatoes and the remaining 30ml/1fl oz of olive oil until well combined.", "To serve, spoon the pasta e fagioli into four serving bowls. Spoon over the parmesan and tomato mixture. Season, to taste, with freshly ground black pepper. Drizzle a splash of olive oil over each serving."]}, {"isVegetarian": false, "title": "Pasta gratin with prosciutto crisps", "url": "www_bbc_co_uk_food_recipes_pastagratinwithprosc_82110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range eggs, beaten", "3 tbsp double cream", "75g/3oz parmesan, grated (1 tbsp reserved)", "salt and freshly ground black pepper", "250g/9oz fresh spaghetti, cooked for 2 minutes and drained", "2 slices prosciutto", "olive oil, to drizzle"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the eggs, double cream, parmesan, salt and freshly ground black pepper together in a small saucepan, stir well and cook for two minutes over a low heat. ", "Place the cooked spaghetti in a small gratin dish, pour over the sauce, sprinkle with parmesan and put under the grill until bubbling.", "Heat a grill to high.  Place the slices of prosciutto on a baking sheet under the grill for 3 minutes until crisp.", "To serve, place the prosciutto on top of the gratin and drizzle with olive oil."]}, {"isVegetarian": true, "title": "Pasta primavera", "url": "www_bbc_co_uk_food_recipes_pastaprimavera_86310", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastaprimavera_86310_16x9.jpg", "ingredients": ["50g/2oz unsalted butter", "1 garlic clove, crushed", "200g/7oz asparagus, blanched, cut into bite-sized pieces ", "150g/5oz fresh peas, podded", "100g/3½oz frozen soya beans, defrosted", "100g/3½oz baby spinach", "450g/1lb cooked tagliolini or tagliatelle (a few tablespoons of cooking water reserved)", "1 lemon, juice and zest ", "large handful fresh spring herbs, including mint, basil, dill and parsley, chopped", "salt and freshly ground black pepper", "25g/1oz hazelnuts, toasted and lightly crushed", "parmesan shavings, or similar vegetarian hard cheese shavings", "olive oil, for drizzling"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan, add the garlic and fry for one minute.", "Add the asparagus, peas, soya beans and spinach and stir fry for 1-2 minutes, until the spinach has wilted slightly.", "Add the pasta and a little of the cooking water to the pan and stir to combine.", "Stir in the lemon juice and zest and the herbs and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the pasta among four bowls, sprinkle over the hazelnuts and parmesan shavings and drizzle with olive oil."]}, {"isVegetarian": true, "title": "Pasta bows with olives, mozzarella and peppers", "url": "www_bbc_co_uk_food_recipes_pastasalad_92362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz farfelle", "1 garlic clove ", "small handful fresh basil leaves", "1 tbsp olive oil, plus more for drizzling", "50g/2oz olives, stones removed, roughly chopped", "1 ball mozzarella, torn into bite-sized pieces ", "2 baby red peppers from a jar, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring to the boil a large pan of salted water. Cook the pasta bows in the water, following the instructions on the packet for timing.", "Blend the garlic, basil and olive oil in a bowl with a hand blender to make a pesto.", "When the pasta is cooked, drain and allow to cool slightly. ", "To serve, put the pasta in a bowl, add all the other ingredients and mix. Drizzle with olive oil and serve."]}, {"isVegetarian": true, "title": "Pasta with onions, tomato, chilli and olive oil", "url": "www_bbc_co_uk_food_recipes_pastatossedwithonion_88931", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, sliced", "½ tsp chilli flakes", "3 baby plum tomatoes, quartered", "2 tbsp chopped fresh parsley leaves", "150g/5½oz shell pasta, cooked according to packet instructions", "1 handful fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and gently fry the onion for 3-4 minutes, or until softened. Stir in the chilli flakes and the plum tomatoes and cook for a further 3-4 minutes.", "Stir in the chopped parsley, then add the cooked pasta to the sauce and stir gently to combine. ", "To serve, pile the pasta onto a serving plate and garnish with the fresh chervil."]}, {"isVegetarian": true, "title": "Pasta with almond pesto", "url": "www_bbc_co_uk_food_recipes_pastawithalmondpesto_88934", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g whole blanched almonds, toasted ", "1 clove garlic, crushed", "2 large handfuls fresh basil leaves", "1 large handful fresh parsley leaves", "salt and freshly ground black pepper", "150g/5½oz shell pasta, cooked according to packet instructions", "1 sprig fresh basil, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the almonds, garlic, basil, and parsley into a food processor and blend to a smooth paste. Season with salt and freshly ground black pepper.", "Stir the pesto into the cooked pasta in a serving bowl and serve garnished with the fresh basil sprig."]}, {"isVegetarian": true, "title": "Pasta with butternut squash sauce", "url": "www_bbc_co_uk_food_recipes_pastawithbutternutsq_81588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 clove garlic", "2 tbsp chopped fresh sage ", "100g/3½oz butternut squash, peeled, seeds removed, finely chopped", "100ml/3½fl oz white wine", "100ml/3½fl oz double cream", "50ml/2fl oz hot water", "150g5½oz penne pasta, cooked according to packet instructions ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium heat. Add the garlic and sage and fry for 1-2 minutes, until golden.", "Add the butternut squash and sauté for 3-4 minutes, until golden.", "Add the white wine and cook for one minute.", "Add the double cream and water, bring to the boil, then reduce the heat to simmer for five minutes, until the butternut squash is soft and cooked.", "Add the pasta, toss together and season, to taste, salt and freshly ground black pepper.", "Serve in a warm bowl."]}, {"isVegetarian": true, "title": "Pasta with creamy sauce", "url": "www_bbc_co_uk_food_recipes_pastawithcreamysauce_79164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter", "½ red romero pepper, diced", "2 garlic clove, peeled and crushed", "2 spring onions, chopped", "100ml/3½fl oz double cream", "1 tbsp sage, chopped", "1 tbsp parsley, chopped", "140g/5oz cooked spaghetti", "salt", "freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a pan and sauté the pepper, garlic and spring onions for 4-5 minutes, to soften. Pour in the cream and  add the fresh herbs. Allow to simmer gently for a few minutes.", "Stir in the cooked pasta and season to taste. Stir in the sauce and heat through.", "Transfer the pasta to a serving bowl and serve at once."]}, {"isVegetarian": true, "title": "Pasta with courgette sauce and spinach balls", "url": "www_bbc_co_uk_food_recipes_pastawithcourgettesa_93036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastawithcourgettesa_93036_16x9.jpg", "ingredients": ["500g/1lb 2oz spinach leaves, washed thoroughly, tough stalks removed", "2 free-range eggs, beaten", "pinch freshly grated nutmeg", "1 garlic clove, blended to a purée with ½ tsp water", "110g/4oz fresh white breadcrumbs", "50g/2oz parmesan, or similar vegetarian hard cheese, freshly grated", "salt and freshly ground black pepper", "2-3 tbsp olive oil", "8 tbsp olive oil", "2 garlic cloves, peeled, finely chopped", "1 chilli, finely chopped", "2 courgettes, trimmed, finely grated", "60g/2¼oz parmesan, or similar vegetarian hard cheese, freshly grated", "salt and freshly ground black pepper", "400g/14oz rigatoni, cooked according to packet instructions, drained (reserve a few spoonfuls of the cooking water)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spinach balls, blanch the spinach leaves in a pan of salted, boiling water for 1-2 minutes, then drain well and refresh in cold water.", "Using your hands, squeeze out as much water from the blanched spinach leaves as possible, then finely chop the spinach. ", "Transfer the blanched, drained spinach to a bowl, then stir in the beaten eggs, nutmeg, garlic purée, breadcrumbs and parmesan. Season to taste with salt and freshly ground black pepper. Mix well until the mixture binds together, adding more breadcrumbs or more water, as necessary, to bind the mixture. ", "Roll the spinach mixture into walnut-sized balls and place onto a baking tray.", "Cover the base of a frying pan in a thin film of olive oil. Heat gently over a low to medium heat.", "When the oil is hot, add the spinach balls, in batches if necessary, and fry for 4-5 minutes on each side, or until crisp and golden-brown all over. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining spinach balls.", "Meanwhile, for the pasta sauce, heat the oil in a separate frying pan over a medium heat. Add the garlic and chilli and fry for 1-2 minutes, or until softened but not coloured.", "Add the courgettes and continue to fry for 3-4 minutes, or until the courgettes have started to soften. ", "Add the parmesan and season, to taste, with salt and freshly ground black pepper. Mix until well combined, then stir in the reserved cooking water from the pasta and the cooked, drained rigatoni. ", "To serve, divide the pasta and sauce equally among four serving plates. Place the fried spinach balls on top."]}, {"isVegetarian": true, "title": "Pasta with halloumi and tomatoes", "url": "www_bbc_co_uk_food_recipes_pastawithhalloumiand_81587", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ red onion, finely chopped", "1 clove garlic, chopped", "pinch dried chilli flakes", "100g/3½oz halloumi, cut into cubes", "2 tomatoes, seeds removed and finely chopped", "150g/5½oz penne pasta, cooked according to packet instructions", "2 tbsp chopped fresh basil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium heat. Add the onion, garlic and chilli flakes and fry for 2-3 minutes, until softened.", "Add the halloumi and fry for 2-3 minutes, until golden.", "Add the finely chopped tomato, pasta and basil and stir together and warm through.", "To serve, place into a warm bowl and season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Pasta with halloumi and red onion", "url": "www_bbc_co_uk_food_recipes_pastawithhaloumiandr_81586", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastawithhaloumiandr_81586_16x9.jpg", "ingredients": ["2 tbsp olive oil", "½ red onion, finely chopped", "pinch dried chilli flakes", "100g/3½oz halloumi, cut into cubes", "150g/5½oz penne pasta, cooked according to packet intructions", "2 tbsp chopped fresh parsley ", "2 tbsp chopped fresh basil ", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium heat. Add the onion and the chilli flakes and fry for 2-3 minutes, until soft.", "Add the halloumi and fry for 2-3 minutes, until golden.", "Add the pasta, fresh herbs and lemon juice and mix together well.", "To serve, place in a warm bowl and season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Pasta with mushroom sauce", "url": "www_bbc_co_uk_food_recipes_pastawithmushroomsau_83362", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastawithmushroomsau_83362_16x9.jpg", "ingredients": ["25g/1oz unsalted butter, chopped", "1 tbsp olive oil", "½ onion, finely chopped ", "1 garlic clove, finely chopped", "1 portobello mushroom, chopped", "50ml/2fl oz white wine", "50ml/2fl oz double cream", "1 tsp chopped fresh parsley", "100g/3½oz pasta, cooked according to packet instructions", "25g/1oz pine nuts", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the olive oil in a frying pan and fry the onion and garlic until soft.", "Add the mushroom and cook until soft. Season well with salt and pepper.", "Add the white wine and cook until the volume of liquid has reduced by half. ", "Add the cream and simmer for 5 minutes, then add the parsley and check the seasoning again.", "Toss the pasta through the sauce, then serve in a warm bowl and sprinkle over the pine nuts."]}, {"isVegetarian": false, "title": "Pasta with purple sprouting broccoli", "url": "www_bbc_co_uk_food_recipes_pastawithpurplesprou_3417", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastawithpurplesprou_3417_16x9.jpg", "ingredients": ["1kg/2¼lb purple sprouting broccoli", "1 medium sized fresh red chilli (not too hot)", "2 cloves garlic, peeled", "1 small tin of anchovy fillets in olive oil, drained", "good quality olive oil", "350g/12oz pasta fusilli, oriecchiette, penne rigate or conchiglie are the most suitable shapes", "4 tbsp freshly grated parmesan or hard pecorino cheese", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put a large pan of water on to boil with a little salt. Trim the outer leaves and woody stalks from the broccoli. Wash the good bits and chop into 1cm/½in sections. Cut the chilli in half lengthways and scrape out the seeds and the attached pith. Chop the chilli flesh, the garlic and the anchovies finely.", " In another large pan warm four tablespoons of olive oil over a medium flame and add the chilli, garlic and anchovies. Gently fry these for a minute or so and add the broccoli, season with a little salt and pepper, then continue to cook gently while the pasta boils.", "Drop the pasta in the boiling water and stir immediately. Cook until just tender with a little bit of resistance to the bite (al dente). This could take anything between 7 and 12 minutes depending on the type of pasta you choose.", "When the pasta has nearly finished cooking, transfer a small ladle of the cooking water to the broccoli and continue to cook over a high heat until tender. ", "When cooked, drain the pasta. Add another two tablespoons of oil and the cheese to the broccoli. Toss with the drained pasta and serve immediately."]}, {"isVegetarian": true, "title": "Pasta with tomato and chilli sauce", "url": "www_bbc_co_uk_food_recipes_pastawithtomatoandch_79946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ red onion, sliced", "1 garlic clove, chopped ", "150g/5½oz tinned tomatoes, chopped ", "½ tsp dried chilli flakes", "150g/5½oz penne pasta, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a frying pan over a medium heat. Add the olive oil, red onion and garlic and cook for five minutes, until the onion has softened.", "Add the tomatoes and chilli flakes and continue to cook for five more minutes.", "To serve, place the pasta in a bowl and pour over the tomato sauce."]}, {"isVegetarian": false, "title": "Pasta with simple courgette sauce", "url": "www_bbc_co_uk_food_recipes_pastawithsimplezucch_12162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz orechiette pasta", "3 large courgettes", "extra virgin olive oil, for cooking", "6 whole anchovies", "3 cloves garlic", "sea salt and freshly ground black pepper", "dash fried chilli flakes", "fresh parmesan, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pot of water to the boil. Add the pasta and cook 'al dente\u0014.", "Meanwhile, grate the courgettes and set aside.", "In a large frying pan, heat plenty of olive oil and add the anchovies, crushed garlic and sea salt. Fry for about 3 minutes, stirring continuously until the anchovies start to soften.", "Sprinkle in the chilli flakes and freshly ground pepper, followed by the grated courgettes and a dash more olive oil. Stir for a further 2 minutes.", "When the pasta is cooked (it should take 10 minutes), drain well and add to the sauce.", "To serve, toss the pasta through the sauce and spoon onto plates. Grate fresh parmesan over the top and finish with freshly ground pepper."]}, {"isVegetarian": false, "title": "Pasta with prawns and tomato sauce", "url": "www_bbc_co_uk_food_recipes_pastawithtomatoandpr_84471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 spring onion, finely chopped", "2 tbsp tomato sauce", "½ garlic clove, crushed", "1 tbsp tomato purée ", "2 tbsp olive oil", "2 tbsp caster sugar", "1 tbsp red wine vinegar", "50ml/2fl oz hot water", "55g/2oz bell peppers, chopped", "salt and freshly ground black pepper", "110g/4oz prawns, cooked and peeled ", "handful of basil leaves, to garnish", "110g/4 oz spaghetti, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients, except the prawns, basil and spaghetti, into a deep saucepan over a medium heat, season with salt and freshly ground black peper and simmer for four minutes.", "Transfer the tomato sauce into a food processor and blend until smooth. Return to the pan and simmer until the sauce reduces, about four minutes.", "To serve, add the prawns and basil and stir through. Add the spaghetti and stir through again and transfer to a serving plate."]}, {"isVegetarian": true, "title": "Pasta with winter ratatouille", "url": "www_bbc_co_uk_food_recipes_pastawithwinterratat_10658", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pastawithwinterratat_10658_16x9.jpg", "ingredients": ["200g/7oz sweet potatoes, peeled and cut in wedges", "200g/7oz parsnips, peeled and cut in large pieces ", "200g/7oz carrots, washed and cut in large pieces", "110g/4oz red onions, cut in quarters", "3-4 cloves garlic ", "2 tbsp olive oil", "75ml/2½fl oz clear honey", "2 sprigs rosemary, plus extra chopped rosemary to garnish", "salt and freshly ground black pepper ", "500g/1lb 2oz packet of pasta", "800ml/1 1/3 pint passata "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Place all the vegetables and the garlic on an oven tray and drizzle with the olive oil and honey. Add the sprigs of rosemary and season well. Cook for about 20 minutes until all the vegetables are tender and browned. ", "While the vegetables are in the oven, cook the pasta according to packet instructions.", "Remove vegetables from the oven, squeeze the cloves of roasted garlic over the vegetables and tip everything in a saucepan. ", "Add the passata, bring to the boil and allow to simmer gently for a minute or two.", "Serve on top of the pasta and garnished with chopped rosemary."]}, {"isVegetarian": false, "title": "Pastry cream", "url": "www_bbc_co_uk_food_recipes_pastry_cream_36417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium free-range egg yolks (preferably organic)", "65g/2½oz caster sugar", "15g/½oz plain flour", "15g/½oz cornflour", "350ml/12fl oz whole milk", "½ tsp vanilla bean paste", "icing sugar, for dusting"], "serves": "Makes 400g/14oz", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large mixing bowl, whisk together the eggs and sugar until they turn a pale gold colour. Whisk in the flour and cornflour and set aside.", "Place the milk and vanilla bean paste in a heavy-bottomed saucepan, bring to a gentle simmer, stirring frequently. Remove the pan from the heat and let cool for 30 seconds.", "Slowly pour half of the hot milk onto the egg mixture, whisking all the time, then return the mixture to the remaining milk in the pan. It is important to slowly pour the hot milk onto the cold eggs before you return the mixture to the pan to prevent the eggs from scrambling.", "Bring the mixture back to the boil and simmer for one minute, whisking continuously, or until smooth.", "Pour the cream into a clean bowl and dust with icing sugar to prevent a skin forming. Cool as quickly as possible, by sitting the bowl of pastry cream in another larger bowl of ice water. When cooled, refrigerate until needed."]}, {"isVegetarian": true, "title": "Pataquetas", "url": "www_bbc_co_uk_food_recipes_pataquetas_40078", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour", "7g sachet instant yeast", "1 tsp sugar", "100ml/3½fl oz tepid water", "500g/1lb 2oz strong white bread flour, plus extra for flouring and dusting", "250ml/9fl oz tepid water", "1 tsp salt", "oil, for greasing"], "serves": "Makes 12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the starter ingredients together in a bowl – you should have a fairly thick, sticky dough. Leave out for 15 minutes, just to give the yeast a kick start, then cover with cling film and put in the fridge for at least 24 hours, preferably for 48 hours. ", "When you are ready to make the bread, remove the starter dough from the fridge and allow to return to room temperature before using. It should be spongy with large, visible air bubbles on the surface and throughout the dough. ", "Transfer to a large bowl or the bowl of a stand mixer, then mix in the flour, water and salt. You will have a sticky dough to start with. Either turn out onto a floured surface and knead for 10–15 minutes, or knead with a dough hook for at least 5 minutes, until the dough is smooth and elastic.", "Divide the dough into 12 pieces and roll into balls. Place on a lightly oiled baking tray and cover with a damp cloth. Leave to stand for 20 minutes.", "To shape, take each ball, then press down lightly into a flat disc on a floured surface – it will have a diameter of around 10cm/4in. Make a cut from the centre of the disc, downwards, through to the edge, then prize the two sides apart, pinching in tips as you do so the dough looks like crescent shaped. ", "Make a further cut horizontally across the dough, just above the first cut, but this time just score without cutting right through. Place the crescents well-spaced out over two baking trays.", "Cover with a damp cloth or oiled cling film and leave somewhere warm to rise. They should double in size and should spring back when pressed with a finger. ", "Preheat the oven to 200C/180C Fan/Gas 6. Boil a kettle of water and pour the water into a deep roasting dish. Put this in the bottom of the oven. ", "Dust the crescents with flour, then place in the oven. Bake for around 25 minutes, or until golden brown and hollow sounding when tapped."]}, {"isVegetarian": true, "title": "Patatas bravas", "url": "www_bbc_co_uk_food_recipes_patatabravas_81525", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/patatabravas_81525_16x9.jpg", "ingredients": ["600g/1lb 5oz potatoes - either Maris Piper, Desiree or King Edwards", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 x 410g tins chopped tomatoes", "3 red chillies", "4 cloves garlic, crushed", "chopped parsley, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 225C/450F/Gas 7.", "Peel the potatoes and cut into 2.5cm/1in cubes. ", "Heat the olive oil in a large roasting tin until really hot. Place the potatoes in the tin and shake them in the oil until covered. Season well with salt and freshly ground black pepper. Place in the hot oven for about ten minutes until they begin to turn golden-brown.", "Add the tomatoes, chilli and garlic and stir well. Cook for another 25-35 minutes until the potatoes are soft on the inside and are crisp on the outside. ", "You can either add the parsley and serve, or refrigerate them until the next day, then reheat, adding more oil and then add the parsley before eating."]}, {"isVegetarian": true, "title": "Patatas bravas", "url": "www_bbc_co_uk_food_recipes_patatas_bravas_72566", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/patatas_bravas_72566_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1 tsp pimentón picante (smoked hot Spanish paprika), plus extra for serving", "½ tsp crushed dried chilli flakes", "½ tsp Tabasco sauce", "1 tbsp red wine vinegar", "125ml/4fl oz tomato sauce (see Top recipe tip below)", "1.5kg/3lb 5oz floury potatoes, such as Maris Piper or King Edwards, peeled", "180ml/6fl oz olive oil, for shallow frying", "salt"], "serves": "Serves 8–10 as a tapas", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salsa brava, heat the olive oil over a low heat, add the pimentón, chilli flakes, Tabasco and vinegar and mix together well. Stir in the tomato sauce and season to taste with salt and freshly ground black pepper (thin the mixture with a little water if necessary). ", "Cut the potatoes into small, even-sized pieces. Drop into a large pan of well-salted water and cook for 6-7 minutes, or until just tender. Drain well. ", "Heat the olive oil in two large, non-stick frying pans, divide the potatoes between them and shallow-fry in a single layer for 10–12 minutes, turning them regularly, until crisp, golden-brown all over and sandy in texture. ", "Spoon the potatoes into one large or small individual serving plates, drizzle over the sauce, sprinkle with a pinch of pimentón and serve with some toothpicks and napkins. "]}, {"isVegetarian": true, "title": "Pâte sucrée (sweet shortcrust pastry)", "url": "www_bbc_co_uk_food_recipes_pate_sucree_39572", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pate_sucree_39572_16x9.jpg", "ingredients": ["90g/3½oz butter, softened ", "65g/2½oz caster sugar", "3 free-range egg yolks", "200g/7oz plain flour, plus extra for dusting"], "serves": "Makes 300g/10½oz pastry", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cream the butter and sugar together in a bowl until well combined, then beat in the egg yolks, one at a time until fully incorporated into the mixture.", "Mix in the flour until the mixture comes together as a ball of dough.", "Tip the pastry out onto a floured work surface and knead briefly until smooth.", "Wrap the pastry in cling film and chill for 30 minutes. Alternatively, it can be frozen for use at a later date."]}, {"isVegetarian": true, "title": "Paul Hollywood's baguettes", "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_55351", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_55351_16x9.jpg", "ingredients": ["olive oil, for greasing", "500g/1lb 2oz strong white bread flour, plus extra for dusting", "10g/¼ oz salt", "10g/¼ oz fast-action yeast", "370ml/13fl oz cool water "], "serves": "Makes 4 baguettes", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly oil a 2¼  litre/4 pint square plastic container with olive oil. (It’s important to use a square tub as it helps shape the dough.)", "Put the flour, salt and yeast into the bowl of a freestanding mixer fitted with a dough hook (don’t put the salt directly on top of the yeast). Add three-quarters of the water and begin mixing on a slow speed. As the dough starts to come together, slowly add the remaining water, then continue to mix on a medium speed for 5-7 minutes, until you have a glossy, elastic dough.", "Tip the dough into the prepared tub. Cover and leave for 1 hour, or until at least doubled in size. ", "Dredge a linen couche with flour and lightly dust the work surface with flour.", "Carefully tip the dough onto the work surface. Rather than knocking it back, handle it gently so you can keep as much air in the dough as possible. (This helps to create the irregular, airy texture of a really good baguette.) The dough will be wet to the touch but still lively.", "Divide the dough into 4 pieces. Shape each piece into an oblong by flattening the dough out slightly and folding the sides into the middle. Then roll each up into a sausage – the top should be smooth with the join running along the length of the base. Now, beginning in the middle, roll each sausage with your hands. Don’t force it out by pressing heavily. Concentrate on the backwards and forwards movement and gently use the weight of your arms to roll out the dough to 30cm/12in long. ", "Lay a baguette along the edge of the linen couche and pleat the couche up against the edge of the baguette. Place another baguette next to the pleat. Repeat the process until all 4 baguettes are lined up against each other with a pleat between each. Cover the baguettes with a clean tea towel and leave for 1 hour, or until the dough has at least doubled in size and springs back quickly if you prod it lightly with your finger. ", "Preheat the oven to 240C/220C Fan/Gas 9 and put a roasting tray in the bottom of the oven to heat up.", "When the baguettes are risen, remove them from the couche and dust lightly with flour. Slash each one 4 times along its length on the diagonal, using a razor blade or a very sharp knife. Transfer to a large baking tray.", "Fill the heated roasting tray with hot water, to create steam, and put the bread into the oven. Bake for 20-25 minutes, or until the baguettes are golden-brown and have a slight sheen. Cool on a wire rack."]}, {"isVegetarian": true, "title": "Paul Hollywood’s bloomer", "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_bloomer_84636", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_bloomer_84636_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for kneading", "10g/¼oz salt", "1 x 7g sachet of instant yeast", "320ml/11½oz cold water", "40ml/1½fl oz olive oil, plus extra for kneading", "extra oil and flour, for kneading"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the dry ingredients in a bowl, taking care not to have the salt and yeast touching. Add the oil and 240ml/9fl oz of water. ", "Using your hands, mix the ingredients together. Gradually add the remaining water (you may not need it all), until all the flour leaves the side of the bowl and you have a soft, rough dough.", "Pour a little oil onto a clean work surface. Sit the dough on the oil and begin to knead. Do this for 5-10 minutes, or until the dough becomes smooth and silky. Once the correct consistency is achieved, place the dough into a clean, oiled bowl. Cover with cling film and leave in a warm place until tripled in size.", "Once risen, place the dough onto a floured surface. Knock the dough back by folding it in on itself repeatedly. Do this until all the air is knocked out and the dough is smooth.", "To shape into the bloomer, flatten the dough into a rectangle. With the long side facing you fold each end into the middle then roll like a Swiss roll so that you have a smooth top with a seam along the base.  Very gently roll with the heel of your hands.", "Place on a tray lined with parchment paper, cover and leave to prove for 1-2 hours at room temperature, or until doubled in size.", "Lightly spray with water and dust with a little flour. Make four diagonal slashes using a sharp knife across the top.", "Preheat the oven to 220/425F/Gas 7 and place a baking tray filled with water on the bottom shelf of the oven - this will create steam when the loaf is baking. Place the loaf on the middle shelf and bake for 25 minutes. After this time lower the heat to 200C/400F/Gas 6 and bake for a further 10 minutes. Remove from the oven and leave to cool on a wire rack."]}, {"isVegetarian": true, "title": "How to make easy white bread", "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_crusty_83536", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_crusty_83536_16x9.jpg", "ingredients": ["500g/1lb 1oz strong white bread flour, plus a little extra flour for finishing", "40g/1½oz soft butter", "12g/2 sachets fast-action dried yeast", "2 tsp salt", "about 300ml/10¾fl oz tepid water (warm not cold – about body temperature) ", "a little olive or sunflower oil "], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour into a large mixing bowl and add the butter. Add the yeast at one side of the bowl and add the salt at the other, otherwise the salt will kill the yeast. Stir all the ingredients with a spoon to combine.", "Add half of the water and turn the mixture round with your fingers. Continue to add water a little at a time, combining well, until you’ve picked up all of the flour from the sides of the bowl. You may not need to add all of the water, or you may need to add a little more – you want a dough that is well combined and soft, but not sticky or soggy. Mix with your fingers to make sure all of the ingredients are combined and use the mixture to clean the inside of the bowl. Keep going until the mixture forms a rough dough. ", "Use about a teaspoon of oil to lightly grease a clean work surface (using oil instead of flour will keep the texture of the dough consistent). Turn out your dough onto the greased work surface (make sure you have plenty of space).", "Fold the far edge of the dough into the middle of the dough, then turn the dough by 45 degrees and repeat. Do this several times until the dough is very lightly coated all over in olive oil. ", "Now use your hands to knead the dough: push the dough out in one direction with the heel of your hand, then fold it back on itself. Turn the dough by 90 degrees and repeat. Kneading in this way stretches the gluten and makes the dough elastic. Do this for about 4 or 5 minutes until the dough is smooth and stretchy. Work quickly so that the mixture doesn’t stick to your hands – if it does get too sticky you can add a little flour to your hands.", "Clean and lightly oil your mixing bowl and put the dough back into it. Cover with a damp tea towel or lightly oiled cling film and set it aside to prove. This gives the yeast time to work: the dough should double in size. This should take around one hour, but will vary depending on the temperature of your room (don’t put the bowl in a hot place or the yeast will work too quickly). ", "Line a baking tray with baking or silicone paper (not greaseproof).", "Once the dough has doubled in size scrape it out of the bowl to shape it. The texture should be bouncy and shiny. Turn it out onto a lightly floured surface and knock it back by kneading it firmly to 'knock' out the air. Use your hand to roll the dough up, then turn by 45 degrees and roll it up again. Repeat several times. Gently turn and smooth the dough into a round loaf shape.", "Place the loaf onto the lined baking tray, cover with a tea towel or lightly oiled cling film and leave to prove until it’s doubled in size. This will take about an hour, but may be quicker or slower depending on how warm your kitchen is.", "Preheat the oven to 220C (200C fan assisted)/425F/Gas 7. Put an old, empty roasting tin into the bottom of the oven.", "After an hour the loaf should have proved (risen again). Sprinkle some flour on top and very gently rub it in. Use a large, sharp knife to make shallow cuts (about 1cm/½in deep) across the top of the loaf to create a diamond pattern. ", "Put the loaf (on its baking tray) into the middle of the oven. Pour cold water into the empty roasting tray at the bottom of the oven just before you shut the door – this creates steam which helps the loaf develop a crisp and shiny crust.", "Bake the loaf for about 30 minutes. ", "The loaf is cooked when it’s risen and golden. To check, take it out of the oven and tap it gently underneath – it should sound hollow. Turn onto a wire rack to cool."]}]