[{"isVegetarian": true, "title": "Mushroom and mozzarella burger with relish", "url": "www_bbc_co_uk_food_recipes_mushroom_and_mozzarella_44092", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_and_mozzarella_44092_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, finely diced", "salt and pepper ", "1 garlic clove, crushed ", "200g/7oz tinned tomatoes ", "1 tbsp white wine vinegar ", "25g/1oz butter ", "2 onions, finely sliced ", "4 large flat mushrooms, stalk trimmed so it doesn’t come above the edge of the mushroom ", "1 tbsp olive oil ", "1 ball mozzarella ", "4 burger buns, sliced in half "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the relish, heat a small frying pan over a medium heat and add the olive oil. Fry the onion and a pinch of salt in the oil for 4-5 minutes, or until the onion is soft. Add the garlic and cook for two minutes, then stir in the tomatoes and the vinegar. Gently simmer for five minutes, or until the mixture has thickened to a relish consistency. Taste and adjust the seasoning as necessary. Leave to cool.", "For the onions, heat a frying pan over a medium heat and melt the butter in the pan. Add the sliced onion and a pinch of salt. Turn down the heat and leave the onions, stirring now and again, to cook for 25-30 minutes, or until dark golden in colour and completely collapsed.", "For the rest of the burger, place the mushrooms with the stalk side facing up onto an oven tray, drizzle with the oil and season with salt and pepper. Bake in the oven for 10 minutes, or until beginning to soften. Meanwhile slice the mozzarella ball into four equal slices. After the mushrooms have cooked for 10 minutes, remove from the oven and place a slice of mozzarella into each of the mushrooms on top of the stalk. Put back into the oven for 5-7 minutes to melt the mozzarella.", "To assemble, lightly toast the cut side of the burger buns.  Spread with a little relish and then place the mushrooms on top of the bottom burger bun. Divide the onions among the burgers and add any remaining relish on top. Finish by sandwiching each burger with the remaining halves."]}, {"isVegetarian": true, "title": "Mushroom and parsnip rösti pie", "url": "www_bbc_co_uk_food_recipes_mushroom_and_parsnip_91300", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_and_parsnip_91300_16x9.jpg", "ingredients": ["olive or rapeseed oil", "750g/1lb 10oz mixed mushrooms (preferably portobello, chestnut and wild mushrooms), roughly chopped into chunks", "3 garlic cloves, sliced", "small bunch thyme, leaves picked", "2 red onions, sliced", "2 carrots, finely chopped", "250g/9oz swede, finely chopped", "200ml/7fl oz white wine or vegetable stock", "1 tbsp vegetarian Worcestershire sauce ", "1 tbsp Dijon mustard", "2 tbsp wholegrain mustard", "small bunch fresh flatleaf parsley, roughly chopped", "2-4 tbsp crème fraîche (optional)", "3 small parsnips, grated", "sea salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place a large ovenproof frying pan over a high heat and add a good glug of oil. Add enough mushrooms to cover the base of the pan, season with salt and pepper, and sauté until nicely brown and beginning to crisp at the edges. Transfer to a bowl and fry the remaining mushrooms in batches.", "Put the pan back on the heat and add another glug of oil. Add the garlic, thyme, onions, carrots and swede, season with a good pinch of salt and pepper and cook over a medium heat for 10 minutes, until softened and starting to brown. ", "Preheat the oven to 200C/180C Fan/Gas 6.", "Add the mushrooms and the wine or stock, and simmer until almost all the liquid has evaporated. Add the Worcestershire sauce, mustards, parsley and crème fraîche, if using, and cook gently for a few more minutes, until you have a rich gravy. Taste and add more salt and pepper if needed. ", "Season the parnsips with salt and pepper and pile on top of the mushroom mixture, leaving a little gap around the edge. Drizzle generously with oil and bake for 40 minutes, until golden brown and crisp.", "Serve with some cheerful greens. "]}, {"isVegetarian": true, "title": "Mushroom and sauerkraut pierogi", "url": "www_bbc_co_uk_food_recipes_mushroom_and_sauerkraut_52289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "½ tsp salt", "1 free-range egg", "2 tbsp soured cream", "15g/½oz dried mushrooms", "40g/1½oz butter", "1 small onion, finely chopped", "150g/5½oz field mushrooms, very finely chopped", "1 garlic clove, finely chopped", "200g/7oz sauerkraut (drained weight)", "1 tbsp finely chopped parsley", "1 tbsp finely chopped dill", "salt and freshly ground black pepper", "breadcrumbs", "chopped chives"], "serves": "Makes approx 20", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough, sieve together the flour and salt into a large mixing bowl. Make a well in the middle. Lightly whisk the egg with the soured cream and 2 tablespoons water and pour into the well.", "Using a fork, start working the flour into the wet ingredients, until you have a rough, floury dough. Turn the dough out on to a a lightly floured work surface and knead until the dough is smooth. It should not be sticky – if it is, add a little more flour. Cover the dough with clingfilm and leave for 1 hour. ", "Meanwhile, make the filling. Cover the dried mushrooms with hot water and leave to soak for 10 minutes. ", "Melt half of the butter in a large frying pan and add half of the onion, field mushrooms and garlic. Fry for a few minutes until the mixture is quite dry. Rinse the sauerkraut in cold water and wring out thoroughly. Finely chop and add to the frying pan. ", "Drain the dried mushrooms, reserving their soaking liquid. Finely chop and add to the frying pan. Strain the reserved liquid into the frying pan. Add 200ml/7fl oz water. Leave to cook on a low heat, stirring regularly, until the whole mixture is quite dry and the sauerkraut has softened, this should take about 20 minutes. Stir in the parsley and dill and et aside. Leave to cool. ", "Roll the dough out to a thickness of 1-2mm. Use a cutter to cut out rounds of 7cm/2¾in diameter. Bring the offcuts of the dough together to make the remaining circles.", "Put a tablespoonful of the cooled mushroom and sauerkraut mixture in the centre of each round. Then bring the edges together to form a crescent shape. Crimp or pleat together with your fingers or use a fork to seal.", "To cook, bring a large pot of salted water to the boil. Cook the pierogi, in batches, for about 5 minutes. They are ready when they float to the top. Drain and put on kitchen paper.", "For the topping, heat the remaining butter in a large frying pan and cook the remaining onion until soft, add the breadcrumbs and mix. Fry until the breadcrumbs are crisp.", "Top the pierogi with the onion breadcrumbs and chopped chives and serve. "]}, {"isVegetarian": true, "title": "Mushroom and spinach tagliatelle", "url": "www_bbc_co_uk_food_recipes_mushroom_and_spinach_09065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_and_spinach_09065_16x9.jpg", "ingredients": ["1 tbsp olive oil", "bunch spring onions, finely sliced", "2 garlic cloves, finely chopped", "10 button or chestnut mushrooms, finely sliced", "200g/7oz fresh spinach, washed", "1 x 200ml7fl oz tub crème fraîche", "salt and freshly ground black pepper", "300g/10½oz dried tagliatelle"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and gently fry the spring onions and garlic for a few minutes, or until pale golden-brown. Add the mushrooms and fry over a high heat for 8-10 minutes, or until the water has evaporated. Tip the spinach into the pan, and stir regularly as it wilts. Continue cooking over a medium heat until most of the water has evaporated.", "Remove the pan from the heat and stir in the crème fraîche. Return the pan to the heat, bring to the boil, and simmer for a few minutes, or until the sauce has thickened. Season to taste with salt and freshly ground pepper.", "Meanwhile, cook the pasta in a large pan of salted boiling water, according to packet instructions. Once cooked, drain the pasta, and toss with the mushroom and spinach sauce. Serve immediately."]}, {"isVegetarian": true, "title": "Mushroom crostini", "url": "www_bbc_co_uk_food_recipes_mushroom_crostini_99270", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_crostini_99270_16x9.jpg", "ingredients": ["8 tbsp olive oil", "2 garlic cloves, 1 peeled, 1 finely chopped", "1 small red chilli, finely chopped", " 400g/14oz mixed mushrooms, chopped", "1 tbsp coarsely chopped fresh flatleaf parsley", "1 tbsp fresh marjoram leaves  ", "salt and freshly ground black pepper", "8 slices Pugliese (or sourdough) bread"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat six tablespoons of the olive oil in a frying pan, fry the chopped garlic and chilli for one minute, then add the mushrooms and fry for a further 2-3 minutes, or until cooked.", "Stir in the parsley and marjoram and season with salt and freshly ground black pepper.", "Meanwhile, toast the slices of bread on both sides. Rub each piece of bread lightly with the whole garlic clove and brush with the remaining olive oil, then slice into individual servings if needed. Spoon over the mushrooms and serve."]}, {"isVegetarian": true, "title": "Mushroom purses", "url": "www_bbc_co_uk_food_recipes_mushroom_purses_97982", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_purses_97982_16x9.jpg", "ingredients": ["4 tbsp olive oil, plus extra for the pastry", "3 garlic cloves, finely chopped", "1.2kg/2lb 7oz wild mushrooms, larger mushrooms chopped", "3 tbsp coarsely chopped parsley", "1 small chilli, finely chopped (optional)", "8 rectangles ready-made filo pastry, about 20x20cm/8x8in", "small bunch fresh chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 8.", "Heat the oil in a frying pan, add the garlic and mushrooms and fry over a high heat for 3-4 minutes, or until just cooked. Season with salt and freshly ground black pepper and sprinkle over the parsley. Set aside to cool.", "Brush one side of each sheet of filo pastry all over with a little olive oil.", "Place one sheet of filo pastry on top of another to create two layers of pastry, then spoon a quarter of the mushroom mixture into the centre of the pastry.", "Gather up the corners of the pastry to create a parcel and secure with a couple of chives. Brush all over with olive oil and place onto a baking tray.", "Repeat the process with the remaining filo pastry and mushroom mixture.", "Bake the parcels for 10-12 minutes, or until the pastry is cooked through and golden-brown."]}, {"isVegetarian": true, "title": "Mushroom millefeuille", "url": "www_bbc_co_uk_food_recipes_mushroom_mille_feuille_39761", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_mille_feuille_39761_16x9.jpg", "ingredients": ["500g/1lb 2oz all-butter puff pastry", "pinch of cayenne, paprika or chilli flakes, optional", "2 shallots, finely chopped", "450g/1lb chestnut mushrooms, finely chopped", "25g/1oz butter", "salt and freshly ground black pepper ", "small bunch tarragon leaves, chopped", "splash of Madeira", "200ml/7fl oz double cream", "handful girolle mushrooms, chopped", "knob of butter", "squeeze of lemon juice", "small handful chives, chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Roll the pastry out into a large rectangle, about 2mm thick. It needs to be large enough so that after baking you can use a biscuit cutter to make 12 circles of about 7.5cm/3in diameter.", "Place onto a baking sheet and prick with a fork (you may need to divide the pastry between two baking sheets). Sprinkle with cayenne, paprika or chilli flakes, if using, and put another baking sheet on top to prevent the pastry from puffing up too much as it bakes. ", "Bake for 20 minutes, or until crisp and golden-brown. Remove the upper tray and set aside to cool.", "For the filling, fry the shallots and mushrooms in butter. Season with salt, pepper and the tarragon, followed by a glug of Madeira and the cream. Let it bubble away until reduced in volume by about a third. Transfer to a food processor or blender and blend to a mousse consistency. Spoon into a piping bag fitted with a medium-sized plain nozzle.", "For the garnish, fry the girolles in a separate pan with a knob of butter for 2-3 minutes until softened. Finish with a squeeze of lemon juice.", "To assemble, cut out twelve circles of pastry using a biscuit cutter. The circles should be about 7.5cm/3in across. Pipe a good amount of the mushroom mousse neatly onto a pastry circle. Top with another circle of pastry and another layer of mousse. Finish with a final circle of pastry and decorate with the girolles and chives. Repeat until you have used up all the pastry circles."]}, {"isVegetarian": true, "title": "Mushroom soup", "url": "www_bbc_co_uk_food_recipes_mushroom_soup_03841", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_soup_03841_16x9.jpg", "ingredients": ["25g/1oz butter", "1 large onion, finely chopped", "1 green pepper, finely chopped", "1 medium leek, finely chopped", "1–2 garlic cloves, crushed", "300g/10½oz button or chestnut mushrooms, grated or finely chopped", "2 tbsp plain flour", "450ml/16fl oz vegetable stock", "450ml/16fl oz milk", "1 tbsp finely chopped parsley", "salt and freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a pan over a low heat, and gently sweat the onion, green pepper, leek and garlic until they start to soften.", "Increase the heat and add the mushrooms to the pan, stir until well combined. Continue to fry until the mushrooms are cooked. Stir in the flour, and cook for one minute. Remove the pan from the heat and add the stock a little at a time, stirring well between each addition. ", "Once all the stock is added, return the pan to the heat, bring to the boil, reduce the heat and simmer for a few minutes. Pour in the milk and bring to a simmer. Stir in the chopped parsley and season to taste with salt and freshly ground black pepper.", "Ladle the soup into bowls and serve with crusty bread."]}, {"isVegetarian": true, "title": "Mushroom soup", "url": "www_bbc_co_uk_food_recipes_mushroom_soup_72353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz dried wild or porcini mushrooms", "10g/⅓oz butter", "2 shallots or 1 leek, finely chopped", "1 garlic clove, sliced", "500g/1lb 2oz fresh mushrooms, a mixture of Portobello, chestnut, button and wild mushrooms, in any combination you like", "700ml/1¼ pint chicken or vegetable stock", "1 large sprig thyme", "25ml/1fl oz sherry or marsala or juice of ½ lemon", "salt and freshly ground black pepper", "2 tbsp finely chopped fresh parsley, to serve "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Measure 150ml/5fl oz just-boiled water and pour it over the dried mushrooms in a bowl. Leave to soak for 10 minutes.", "Heat the butter in a heavy-based saucepan. Finely chop the shallots or leek, and add to the saucepan. Cover and leave to cook on a low heat for 5 minutes. ", "Add the garlic and fresh mushrooms to the pan. Turn up the heat and cook for a couple of minutes until the mushrooms are glossy.", "Strain off the soaking mushrooms, reserving the liquor. Finely chop the soaked mushrooms and add to the pan. Pour in the reserved liquor and the stock, then add the thyme. Season with salt and pepper.", "Bring to the boil, then simmer for 5 minutes. Add the sherry, marsala or lemon juice. Remove the sprig of thyme, then cool slightly and carefully blend the soup using a hand-blender. It should be a lovely rich brown colour. Serve immediately topped with a sprinkle of chopped parsley."]}, {"isVegetarian": true, "title": "Mushroom soup with garlic bread", "url": "www_bbc_co_uk_food_recipes_mushroom_soup_with_19428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 shallots, roughly chopped", "2 garlic cloves, finely chopped", "400g/14oz various different mushrooms, roughly chopped", "4 fresh thyme sprigs", "150ml/5fl oz double cream", "1 red onion, thinly sliced", "150g/5½oz various different mushrooms, roughly chopped", "1 tbsp finely chopped fresh parsley", "1 tbsp finely chopped fresh tarragon", "¼ sourdough loaf, torn into pieces  ", "1 garlic clove, finely chopped", "4 tbsp olive oil", "100g/3½oz Parmesan cheese (or other vegetarian hard cheese), grated, to serve", "½ truffle, freshly shaved (optional), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the soup, heat the oil in a sauté pan over a medium heat. Add the shallots, garlic, mushrooms and thyme and cook 2–3 minutes. Add 500ml/18fl oz water,", "bring to the boil and cook for a further 3 minutes. Add the cream and blitz in a blender until smooth.", "To make the topping, heat the oil in a frying pan over medium heat. Add the onion and mushrooms and cook for 2 minutes. Add the herbs and mix to combine.", "To make the bread, heat the oil in a frying pan over a medium heat. Add the bread and garlic and cook until crispy. Remove from the pan and allow to drain on kitchen paper.", "To serve, pour the soup into serving bowls and top with the garnish and garlic bread. Garnish with the parmesan and truffle shavings."]}, {"isVegetarian": true, "title": "Mushroom stroganoff", "url": "www_bbc_co_uk_food_recipes_mushroom_stroganoff_80260", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_stroganoff_80260_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp oil", "160g/5¾oz sliced onions", "550g/1lb 4oz medium mushrooms, sliced", "½ tsp garlic purée", "1 tsp ground paprika", "a good pinch chilli powder", "50ml/2fl oz white wine", "30g/1oz tomato purée", "1 tsp vegetable stock granules, dissolved in 100ml/3½fl oz water", "100ml/3½fl oz cream", "½ tsp chopped parsley", "boiled rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter and oil in a large pan. Add the onions, mushrooms, garlic purée, spices and wine and cook for 10 minutes. ", "Stir in the tomato purée, stock and cream. Bring to the boil and then reduce the heat to a simmer. Add the parsley.", "If the sauce is too thin, simmer the stroganoff until the volume of liquid has reduced to the desired consistency. ", "Serve with boiled rice."]}, {"isVegetarian": true, "title": "Mushroom stroganoff", "url": "www_bbc_co_uk_food_recipes_mushroom_stroganoff_with_83256", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_stroganoff_with_83256_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, finely diced ", "2 garlic cloves, crushed ", "500g/1lb 2oz mushrooms (such as white closed cup), cleaned and sliced ", "½ tsp English mustard ", "1 tsp paprika ", "250ml/9fl oz vegetable stock, made from stock cube ", "200g/7oz rice ", "200ml/7fl oz soured cream ", "1 lemon, cut into six wedges ", "salt and black pepper  "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan or wide saucepan over a medium heat and add the oil. Once hot, add the onion along with a pinch of salt and cook the onion gently for 5–7 minutes or until soft.", "Add the garlic to the pan and continue to cook for 2 minutes, then add the sliced mushrooms. Continue to cook gently for a 5–6 minutes, or until the mushrooms are tender and golden-brown.", "Add the mustard and paprika and mix well so that everything is coated. Add the stock, stirring as you pour it. Simmer gently for 5 minutes while you cook the rice.", "Cook the rice according to the packet instructions in a separate saucepan until tender.", "Once the rice is cooked, remove the mushrooms from the heat, stir in the soured cream along with the juice of two lemon wedges and mix it all together. Taste and add salt and pepper as needed. Serve the stroganoff with the rice and the remaining wedges of lemon on the side."]}, {"isVegetarian": true, "title": "Mushroom wild rice salad with pomegranate and spring onion", "url": "www_bbc_co_uk_food_recipes_mushroom_wild_rice_salad_47495", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_wild_rice_salad_47495_16x9.jpg", "ingredients": ["250g/9oz chestnut mushrooms, halved", "1 onion, finely chopped", "2 garlic cloves, crushed", "1 unwaxed lemon, finely grated zest only", "150g/5½oz mix of brown basmati and wild rice, rinsed", "375ml/13fl oz hot vegetable stock", "1 pomegranate, seeds only", "5 spring onions, finely chopped", "100g/3½oz watercress, roughly chopped", "2 tbsp extra virgin olive oil", "15g/½oz fresh coriander, roughly chopped", "2 tbsp lemon juice", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Place the mushrooms, onion, garlic, lemon zest, rice and vegetable stock in a casserole dish or small, deep roasting tin. Cover tightly with kitchen foil or a lid and cook for 1 hour.", "Meanwhile, to make the lemon and coriander dressing, mix all the ingredients together in a small bowl. Set aside. ", "Stir the dressing, half the pomegranate seeds, half the spring onions and the watercress into the rice. Taste and adjust the seasoning, if needed. Garnish with the remaining pomegranate seeds and spring onions. Serve immediately. "]}, {"isVegetarian": true, "title": "Mushroom and caramelised onion rarebit", "url": "www_bbc_co_uk_food_recipes_mushroomandcaramelis_84445", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80ml/3fl oz olive oil", "2 large onions, finely sliced", "6 large field mushrooms, peeled and trimmed", "salt and freshly ground pepper", "30g/1oz butter", "2 garlic cloves, roughly chopped", "100ml/3½fl oz olive oil", "225g/8oz mature cheddar or gruyere cheese, grated", "1 tsp wholegrain mustard", "1 garlic clove, crushed", "1 free-range egg, beaten"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4 and preheat the grill to its highest setting.", "For the caramelised onions, heat the oil in a frying pan over a very low heat. Add the onions and gently fry for 45 minutes, stirring regularly, until the onions are caramelised, golden-brown and sweet.", "Meanwhile, for the mushrooms, place the mushrooms in a baking dish and season with salt and freshly ground black pepper. Sprinkle with the butter and garlic, then pour over the olive oil. Transfer to the oven to bake for 10-12 minutes, until softened slightly.", "For the rarebit, place the cheese, mustard, garlic and egg into a bowl and mix together well.", "Remove the mushrooms from the oven. Spoon over the caramelised onions and some of the rarebit mixture, pressing this topping into each mushroom.", "Transfer the mushrooms to the hot grill and cook until the cheese bubbles, melts and becomes golden-brown.", "To serve, place a large cheese-coated mushroom onto each of six plates."]}, {"isVegetarian": true, "title": "Mushroom and herb couscous salad", "url": "www_bbc_co_uk_food_recipes_mushroomandherbcousc_84770", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "2 garlic cloves, chopped", "200g/7oz mushrooms, sliced", "200g/7oz cooked couscous", "1 lemon, juice only", "50ml/2fl oz olive oil, plus extra for oiling", "1 tsp chopped fresh parsley", "1 tsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mushrooms, melt the butter with the oil in a frying pan and cook the garlic and mushrooms over a medium heat until soft.", "For the couscous, place the cooked couscous into a bowl along with the lemon juice, olive oil and herbs and mix well.", "Add the mushrooms to the couscous mixture and season to taste with salt and freshly ground black pepper.", "Lightly oil a small bowl and pack the couscous mixture into the bowl.", "To serve, turn the bowl of couscous out onto a plate."]}, {"isVegetarian": true, "title": "Mushroom and melting cheese tart", "url": "www_bbc_co_uk_food_recipes_mushroomandmeltingch_86268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz plain flour", "100g/3½oz butter", "1 free-range egg", "2 tbsp ice cold water", "pinch salt", "1 tbsp olive oil", "½ onion, sliced", "1 garlic clove, chopped", "85g/3oz mixed mushrooms, sliced", "100g/3½oz Camembert, chopped", "1 tbsp fresh thyme leaves", "3 tbsp double cream"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Crack in the egg and add the water and salt and blend again until the mixture comes together as a dough.", "Turn out onto a floured surface and roll out to the thickness of a pound coin. Line a small tart tin with the pastry and trim away the excess. Refrigerate for five minutes.", "Line the tart with baking parchment and fill with baking beans. Transfer to the oven and bake for ten minutes. Remove the baking beans and parchment.", "For the filling, heat the olive oil in a frying pan, add the onion and gently fry for 3-4 minutes.", "Add the garlic and mushrooms and cook for 3-4 minutes.", "Spoon the mushroom mixture into the pastry case. Top with the Camembert, thyme and cream.", "Transfer to the oven and bake for 10-12 minutes, or until the pastry is golden-brown and the cheese is beginning to melt.", "To serve, remove from the tart tin and place onto a serving plate."]}, {"isVegetarian": true, "title": "Mushroom and parmesan torte", "url": "www_bbc_co_uk_food_recipes_mushroomandparmesant_85571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz butter, plus extra for greasing", "175g/6oz parmesan, or similar vegetarian hard cheese, finely grated, plus extra for dusting ", "oil, for frying", "small knob of butter", "175g/6oz button and/or field mushrooms, chopped", "2 red onions, finely chopped", "225ml/7½fl oz double cream", "3 free-range eggs, beaten", "100g/3½oz frozen peas", "2 tbsp olive oil ", "4 onions, finely chopped", "75ml/3fl oz vinegar", "1 garlic clove, crushed", "1 tbsp chilli paste, from a jar", "75g/3oz brown sugar", "salt and freshly ground black pepper", "mixed salad leaves", "mustard vinaigrette"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease a 20cm/8oz spring-form cake tin with butter and dust with a little of the parmesan.", "Heat the oil and the butter in a frying pan and fry the mushrooms and red onions for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper.", "Remove from the heat and allow to cool, then transfer half of the mushroom mixture to a food processor and blend to a smooth paste.", "Transfer the mushroom paste to a large bowl. Add the remaining, unblended mushroom mixture, the cream, the eggs and the peas and mix well.", "Add half of the parmesan and stir to combine.", "Spoon the mixture into the prepared tin and sprinkle with the remaining parmesan. Transfer to the oven to bake for 40-50 minutes, or until set.", "Remove from the oven and leave to cool, then release the sides of the tin and place onto a serving plate.", "Meanwhile, for the chutney, heat the olive oil in a frying pan. Add the onions and fry until soft.", "Add the vinegar, garlic, chilli paste and sugar, stir well and cook over a low heat for 45 minutes, stirring occasionally, to prevent burning.", "To serve, place generous slices of the torte onto plates with a spoonful of the chutney alongside. Garnish with a handful of salad leaves drizzled with mustard vinaigrette."]}, {"isVegetarian": true, "title": "Mushroom biryani with omelette topping", "url": "www_bbc_co_uk_food_recipes_mushroombiryani_90436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "1 tbsp double cream", "1 tbsp chopped fresh coriander", "salt and freshly ground black pepper", "1 tsp vegetable oil", "1 garlic clove, crushed to a paste", "5cm/2in piece fresh ginger, grated ", "pinch cayenne pepper", "1 tsp paprika", "1 tsp ground cumin", "pinch salt", "175ml/6fl oz natural yoghurt", "1 lime, juice only", "1 tbsp vegetable oil", "300g/10½ mushrooms", "2 red chillies, chopped", "2 garlic cloves, crushed ", "2.5cm/1in fresh ginger, grated and squeezed through muslin, juice only", "pinch ground turmeric", "1 tsp garam masala", "1 tbsp vegetable oil", "½ onion, sliced", "250g/9oz basmati rice, washed and soaked for 30 minutes, then drained ", "2 bay leaves", "400ml/14fl oz vegetable stock", "1 tbsp rose water", "1 lemon, juice only", "1 tbsp chopped fresh mint"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the omelettes, mix the eggs, cream and coriander together in a bowl and season well with salt and freshly ground black pepper.", "Heat a little of the oil in a small frying pan over a medium heat. Add a quarter of the omelette mixture and fry gently, until it begins to set. Fold over the omelette and cook until just set, then transfer to a plate. Keep warm.", "Repeat the process to make three more omelettes. Set aside.", "For the marinated mushrooms, mix all of the marinated mushrooms ingredients, except the mushrooms and the vegetable oil, in a bowl. Set the marinade mixture aside.", "Heat the oil in a pan and fry the mushrooms for 2-3 minutes, until golden-brown.", "Add the cooked mushrooms to the marinade and set aside. ", "For the chilli paste, place all of the chilli paste ingredients into a food processor and blend to a rough paste. ", "For the biryani, heat the oil in a separate frying pan. Add the onion and fry until softened.", "Add the chilli paste and cook for five minutes.", "Add the rice and bay leaves and fry for 3-4 minutes.", "Add enough stock to cover and simmer for 15-20 minutes, or until all the liquid has been absorbed and the rice is cooked through.", "Spread the cooked rice onto a clean tray to cool, drizzle with rose water and lemon juice and sprinkle with the chopped mint.", "Preheat the oven to 180C/360F/Gas 4.", "Grease four 10cm/4in chefs' rings and place onto a baking tray. Pack a layer of the rice mixture into each ring, then top with a layer of the marinated mushrooms. Repeat these layers until each ring is full - making sure the top layer is rice.", "Cover each ring with aluminium foil and bake in the oven for 30 minutes. ", "To serve, place an omelette on top of each biryani stack."]}, {"isVegetarian": true, "title": "Mushroom and spinach pancakes", "url": "www_bbc_co_uk_food_recipes_mushroomandspinachcr_87049", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroomandspinachcr_87049_16x9.jpg", "ingredients": ["125g/4½oz plain flour or buckwheat flour", "1 free-range egg", "150ml/5fl oz milk ", "olive oil, for frying ", "1 tbsp olive oil", "1 small onion, chopped", "handful mushrooms, sliced", "2 handfuls baby spinach", "2 tbsp crème fraîche (optional)", "few sprigs fresh parsley or chives, chopped (optional)", "salad leaves, to serve", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, sift the flour with a pinch of salt into a mixing bowl, then crack in the egg and mix well. Add the milk and 150ml/5fl oz water, then beat well until smooth and well combined. Set aside while you make the filling.", "For the filling, heat the oil in a frying pan and fry the onion until softened, then add the mushrooms to cook through. Season well with salt and pepper,  add the baby spinach and cook for 2 minutes until it wilts, stirring frequently. Set aside while you cook the pancakes.", "To cook the pancakes, heat a little olive oil in a large frying pan, pour in a ladleful of batter and swirl around until it thinly covers the base of the pan. Fry for about a minute until the underside is set and beginning to turn golden-brown. Turn over using a spatula and cook the other side.", "While the pancake is still in the pan, spread half the crème fraîche over one side (if using), scatter over half of the mushroom and spinach mixture, and sprinkle with parsley and chives (if using). Fold the sides of the pancake over the filling and lift onto a serving plate.", "Repeat with the remaining batter and filling to make another pancake (if you have any batter leftover, fry-up another pancake for dessert). Serve with salad leaves."]}, {"isVegetarian": true, "title": "Mushroom cappuccino", "url": "www_bbc_co_uk_food_recipes_mushroomcappuccino_79137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz mixed mushrooms ", "1 tbsp olive oil ", "1 garlic clove chopped ", "25g/1oz butter ", "75ml double cream ", "100ml/2½fl oz vegetable stock ", "pinch of nutmeg"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a saucepan heat the butter and oil together. Cook the mushrooms and garlic for three minutes.", "Add the stock and cook for five minutes.", "Finish by adding the cream and nutmeg and season.", "Using the hand blender blend until frothy.", "Serve in a cappucino cup."]}, {"isVegetarian": true, "title": "Mushroom, cheese and spinach open lasagna with white wine cream sauce", "url": "www_bbc_co_uk_food_recipes_mushroomcheeseandspi_92423", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "1 tbsp olive oil", "½ onion, peeled, sliced", "1 garlic clove, peeled, sliced", "3 field mushrooms, sliced", "100ml/3½fl oz white wine", "75ml/2½fl oz double cream", "salt and freshly ground black pepper", "2 tbsp chopped chives", "1 handful spinach leaves", "2  fresh lasagne sheets, cooked according to packet instructions", "55g/2oz cheddar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter with the oil in a pan over a medium heat. Fry the onion and garlic for 3-4 minutes, or until softened, stirring occasionally.", "Add the sliced mushrooms to the pan and cook for 2-3 minutes. ", "Add the wine to the pan and bring to the boil. Reduce the heat until the mixture is simmering. Continue to simmer until cook over a high heat until the volume of liquid has reduced by half. ", "Stir the cream into the pan and season with salt and freshly ground black pepper, to taste. Return the mixure to a simmer.", "Stir the chives and spinach leaves into the mixture until they are warmed through and wilted.", "To serve, place one cooked lasagne sheet on a plate and spoon the mushroom mixture on top. Place the remaining sheet on top of the mushrooms and sprinkle over the cheese.  Place the lasagne under a hot grill until the cheese is bubbling and golden-brown. (Alternatively, use a cook's blowtorch to melt the cheese.)"]}, {"isVegetarian": true, "title": "Mushroom carpaccio", "url": "www_bbc_co_uk_food_recipes_mushroomcarpaccio_88686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large St Georges mushrooms (weighing approximately150g/5oz) If unavailable use Portobello mushrooms. ", "20 fresh mint leaves, very finely sliced", "1 tsp truffle oil ", "1 tbsp wholegrain mustard ", "1 tsp sugar", "75ml/2½fl oz white wine vinegar ", "150ml/5fl oz extra virgin olive oil", "salt and freshly ground black pepper, to taste", "½ lemon, juice only", "1 garlic clove, finely chopped", "4 tbsp crème fraîche", "pecorino, shaved or grated", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the stalks from the mushrooms and discard. Place the mushroom caps into the freezer for 10-15mins (this will make them easier to slice thinly).", "Once the mushrooms are chilled, slice them very thinly (a mandoline is ideal for this, but a sharp knife and a steady hand will do) and arrange the slices onto plates.", "Sprinkle with the mint.", "For the dressing, place all of the dressing ingredients into a food processor and blend to combine.", "To serve, drizzle the mushroom slices with the dressing, then add a spoonful of crème fraîche to each plate.", "Sprinkle with freshly grated or shaved pecorino cheese and season well with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Mushroom, cheese and steak stack with red pepper dressing", "url": "www_bbc_co_uk_food_recipes_mushroomcheeseandste_85185", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "3 Portobello mushrooms, stalks removed", "150g/5½oz rump steak, halved lengthways", "salt and freshly ground black pepper ", "85g/3oz Stinking Bishop cheese, sliced", "1 tbsp olive oil", "1 red pepper, chopped", "1 garlic clove, chopped", "50ml/2fl oz boiling water", "50ml/2fl oz white wine", "2 tbsp soft brown sugar", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the mushroom, cheese and steak stack, drizzle a little olive oil over the Portobello mushrooms. Heat a frying pan over a medium heat and fry the mushrooms for 4-5 minutes on each side, until softened. Remove from the pan and set aside to keep warm. ", "Add a little more oil to the pan and heat until very hot. Season the steak on both sides with salt and freshly ground black pepper and fry for 1-2 minutes on each side, or until cooked to your liking.", "Place one Portobello mushroom onto a baking sheet and top with one of the steak pieces and half the cheese. Place another Portobello mushroom on top of the cheese, followed by the other piece of steak, the rest of the cheese and finally the third mushroom. Secure with a wooden skewer and place in the oven for 6-8 minutes, or until the cheese is melted.", "For the dressing, heat the olive oil in a small pan over a medium heat and fry the red pepper for 3-4 minutes. Add the garlic and cook for a further minute. Add the water, wine and sugar, season with salt and freshly ground black pepper and simmer for 3-4 minutes. Add the parsley, then blend the mixture with a hand blender until almost smooth.", "To serve, place the mushroom stack onto a serving plate and pour over the dressing."]}, {"isVegetarian": true, "title": "Mushroom gratin", "url": "www_bbc_co_uk_food_recipes_mushroomgratin_72372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp groundnut oil", "2 red onions, peeled, halved and sliced", "200g/7¼ wild mushrooms, sliced", "sea salt and freshly ground black pepper", "salted butter (to butter bread)", "6 thin slices of white, day-old bread with crusts left on", "275g/10oz gruyère, grated", "3 eggs", "300ml/10½fl oz milk", "300g/10½oz crème fraîche", "50g/1¾oz parmesan, grated", "rocket and roasted red pepper salad"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4.", "Put two tablespoons of groundnut oil into a preheated pan. Add the onions and fry gently until golden. Now add the mushrooms. Sauté for a few minutes until softened and lightly coloured. Season and remove from the heat.", "Butter the slices of bread and cut each one into two triangles. Cover the base of a greased ovenproof dish with half of the bread.", "Scatter over half each of the onion and mushroom mixture followed by half the grated gruyère. Repeat with the remaining bread, onions, mushrooms and gruyère.", "Whisk the eggs, milk, crème fraîche, parmesan and some seasoning in a large bowl and pour over the top.", "Place the gratin dish inside a roasting dish with warm water to come two thirds of the way up the sides (a bain marie) and bake for 35 minutes until puffy and golden.", "Serve immediately while the cheese and custard are molten and gooey."]}, {"isVegetarian": true, "title": "Mushroom, leek and spinach risotto", "url": "www_bbc_co_uk_food_recipes_mushroomleekandspina_85579", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, finely chopped", "pinch chilli flakes", "75g/3oz mixed mushrooms, for example oyster, shiitake and enoki, roughly chopped", "200g/7oz risotto rice (eg carnaroli or arborio)", "1 x 125ml/4½fl oz glass white wine", "150ml/¼ pint hot vegetable stock", "75g/3oz spinach, roughly chopped", "25g/1oz butter", "salt and freshly ground black pepper", "fresh chives, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large saucepan with a lid, add the leek and chilli flakes and fry gently until softened. Add the mushrooms and fry for 2-3 minutes. Add the rice and cook, stirring frequently, for 1-2 minutes, or until the rice turns translucent.", "Add the wine, turn up the heat and boil for 1-2 minutes. Add the stock one ladleful at a time and stir continuously until all the stock has been absorbed and the rice is cooked.", "Stir in the spinach and the butter, remove from the heat, cover and set aside for a few minutes. Season, to taste, with salt and freshly ground black pepper. ", "To serve, place the risotto into serving bowls and garnish with the chives."]}]