[{"isVegetarian": true, "title": "Basic chocolate roulade", "url": "www_bbc_co_uk_food_recipes_chocolateroulade_83888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob butter, for greasing", "170g/6oz plain chocolate (70% cocoa solids)", "5 free-range eggs, separated", "225g/8oz sugar", "284ml/10fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Prepare a Swiss roll tin by greasing it with butter and then lining it with a piece of greaseproof paper slightly larger than the tin.", "Gently melt the chocolate in a glass bowl set over a saucepan of boiling water.", "Beat the egg yolks into the sugar. ", "When the chocolate has cooled and melted a little, pour it into the egg yolk and sugar mixture.", "Beat the egg whites to stiff peaks, before folding into the chocolate mix.", "Pour the mix into the tin and bake in the oven for 15-20 minutes until firm to the touch - you will know the cake is ready when an inserted skewer comes out clean.", "Run a tea towel under cold water and wring out.", "Place the tea towel over the chocolate roulade once it has cooled a little. After ten minutes remove the tea towel, transfer the roulade to the fridge and leave overnight.", "The next day, sieve icing sugar over a sheet of greaseproof paper a little larger than the tin.", "Tip the cake out onto the fresh greaseproof paper and peel off the other piece of greaseproof paper from the top of the roulade.", "Whip the double cream and smooth it all over the roulade.", "Roll up the roulade, using the greaseproof paper to help hold it together. It may crack a little, but this will not affect the quality of the cake."]}, {"isVegetarian": true, "title": "Chocolate roulade with praline cream", "url": "www_bbc_co_uk_food_recipes_chocolaterouladewith_87177", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflour oil, for greasing", "6 free-range eggs, separated", "175g/6oz caster sugar", "50g/2oz cocoa powder, sifted", "25g/1oz shelled almonds", "25g/1oz shelled hazelnuts", "110g/4oz caster sugar", "300ml/10½fl oz double cream", "50g/2oz cocoa powder, sifted", "75g/3oz dark chocolate, grated"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the roulade, preheat the oven to 180C/465F/Gas 4.", "Lightly grease a 23cm x 33cm/9in x 13in Swiss roll tin with a little sunflower oil and line with baking parchment.", "Place the egg yolks and sugar into a large bowl and whisk until light and pale.", "Sift the cocoa powder into the egg yolk mixture and whisk until completely combined.", "In a clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Add half of the whisked egg whites to the cocoa mixture and mix together well, then gently fold in the remaining whisked egg whites until just combined.", "Pour the mixture into the Swiss roll tin, moving the tin so that the mixture spreads evenly into the corners. ", "Transfer to the oven to bake for 20 minutes, or until firm to the touch, then remove from the oven. Place a clean, dry tea towel on top of the roulade and on top of this place another tea towel that has been soaked in cold water and well wrung out. Leave in a cool place for an hour.", "For the filling, heat a dry frying pan until hot and add the almonds and hazelnuts and toast until golden-brown all over.", "Remove the nuts from the pan, allow to cool slightly, then roughly chop.", "Add the sugar to the same pan and return to the heat. Cook until the sugar has melted and caramelised to a golden-brown colour.", "Add the chopped nuts to the caramel and swirl to combine and coat the nuts in caramel.", "Pour the caramel and nut mixture into a well-greased, lined baking tray and leave to cool and set. Once set, remove the mixture and break up into small pieces.", "Whisk the cream until soft peaks are formed when the whisk is removed, then fold the caramel nut pieces into the cream.", "To serve, remove the tea towels from the sponge, and turn out onto a piece of baking parchment that has been dusted with sifted cocoa powder.", "Peel the lining paper from the sponge and spread the whipped cream mixture evenly over the top.", "Starting from a long end, roll up the sponge, using the cocoa-dusted paper to help lift the cake as you roll it forward.", "Once rolled up, dust the roulade with more sifted cocoa powder and sprinkle the grated chocolate over the top."]}, {"isVegetarian": true, "title": "Chocolate sauce", "url": "www_bbc_co_uk_food_recipes_chocolatesauce_1302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dark chocolate, broken into pieces", "80g/3oz caster sugar", "120ml/4fl oz double cream", "60ml/2fl oz hot water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients into a thick-bottomed saucepan.", "Put on a gentle heat and stir until the chocolate has melted and the sauce is hot."]}, {"isVegetarian": true, "title": "Chocolate soufflé", "url": "www_bbc_co_uk_food_recipes_chocolatesouffle_81163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp cocoa powder", "2 free-range eggs, separated ", "100ml/3½fl oz double cream ", "2 tbsp caster sugar", "2 tbsp groundnut oil ", "1 orange, segmented"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a large bowl mix the cocoa and egg yolks together. Add half the double cream and whisk together.", "Whisk the egg whites until stiff peaks form. Continue whisking and slowly add the sugar until you have glossy peaks. ", "Fold the whites carefully into the chocolate mixture, then heat the oil in a small non-stick frying pan.", "Pour the mixture into the hot pan, then transfer to the oven for 8 minutes, or until cooked through.", "To serve, pour over the remaining double cream and garnish with the segmented oranges."]}, {"isVegetarian": true, "title": "Chocolate tart with clotted cream", "url": "www_bbc_co_uk_food_recipes_chocolatetartwithclo_91269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz butter, cut into cubes, plus extra for greasing", "250g/8¾oz plain flour, plus extra for dusting", "50g/1¾oz icing sugar", "vanilla pod, seeds only (scraped out with a knife)", "1 free-range egg, beaten", "400g/14¼oz dark chocolate, broken into pieces", "150ml/5½fl oz milk", "250ml/8¾fl oz whipping cream", "2 free-range eggs, beaten", "clotted cream, to serve"], "serves": "Makes 1 28cm/11in tart", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 28cm/11in tart case with butter. ", "For the sweet pastry, in a food processor, pulse the butter and flour until the mixture resembles breadcrumbs. ", "Transfer the butter and flour mixture to a bowl and add the icing sugar and vanilla seeds. Mix until well combined. ", "Add the beaten egg and mix, using your hands, until the mixture comes together as a dough. Wrap the dough in cling film and chill in the fridge for 30 minutes.", "Roll the chilled pastry out onto a lightly floured surface until it is 30-35cm/12-14in in diameter. Line the prepared tart tin with the pastry, pressing it gently to the tin and trimming off any excess. Line the pastry case with baking parchment and half-fill with ceramic baking beans, then transfer to the oven and bake for 8-10 minutes. ", "Remove the baking beans and baking parchment, then prick the pastry several times with a fork. Return to the oven and continue to cook for a further 4-5 minutes, or until the pastry is crisp and pale golden-brown.", "Reduce the oven temperature to 130C/250F/Gas 1.", "For the tart filling, bring some water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water. Do not allow the base of the bowl to touch the water. Add the dark chocolate pieces to the bowl and stir until smooth and completely melted. Remove the bowl from the heat and set aside.", "Bring the milk and cream to the boil in a pan, then pour the mixture over the melted chocolate. ", "Add the beaten eggs and mix until smooth and well combined.", "Pour the filling mixture into the pastry case and bake for 20-25 minutes, or until set. Allow to cool before serving.", "To serve, place one slice of tart into the centre of each serving plate. Spoon a little clotted cream alongside."]}, {"isVegetarian": true, "title": "Chocolate tart with white chocolate sauce", "url": "www_bbc_co_uk_food_recipes_chocolatetartwithwhi_87928", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatetartwithwhi_87928_16x9.jpg", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "pinch salt", "125g/4½oz cold butter", "3 free-range egg yolks", "125g/4½oz caster sugar", "400ml/14fl oz double cream", "few drops vanilla extract", "100g/3½oz caster sugar", "400g/14oz dark chocolate, approx 70 per cent cocoa solids", "50g/2oz butter", "250ml/9fl oz single cream", "1 vanilla pod, split lengthways", "100g/3½oz white chocolate, chopped", "raspberries and fresh mint sprigs, to serve"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, salt and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the egg yolks and sugar and pulse until the mixture comes together to form a dough. You may need to add a splash of ice cold water if the pastry is too dry. Place into a bowl, cover the bowl with cling film and chill in the fridge for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Roll the dough out on a lightly floured surface until large enough to line a 25cm/10in fluted tart tin. Place into the tin, then place a piece of greaseproof paper on top and weigh it down with baking beans or rice.", "Place into the oven for 15 minutes, then remove the paper and beans and return to the oven for five minutes, or until lightly browned.", "Meanwhile, for the filling, bring the cream, vanilla extract and sugar slowly to the boil in a pan.", "Break the chocolate and butter into pieces and place into a large bowl. Pour over the cream mixture and whisk slowly until the chocolate has melted and the mixture is smooth.", "Pour the chocolate mixture into the tart case and leave to cool. Place in the fridge to set for two hours.", "For the sauce, place half of the cream and the vanilla pod into a pan and heat until the mixture is warm but not too hot when touched with a finger. Take off the heat and remove the vanilla pod.", "Add the white chocolate and stir until melted. Stir in the remaining cream.", "To serve, cut the tart into wedges and drizzle over the white chocolate sauce. Serve with raspberries and a sprig of mint."]}, {"isVegetarian": true, "title": "Chocolate yule log", "url": "www_bbc_co_uk_food_recipes_chocolateyulelog_93127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz caster sugar", "6 free-range eggs, separated", "50g/2oz plain flour", "175g/6oz dark chocolate,  melted", "150g/5oz sweetened chestnut purée", "150ml/5fl oz double cream, whipped until soft peaks form when the whisk is removed", "50g/2oz mascarpone", "75g/3oz cooked chestnuts, roughly chopped", "2-3 tbsp icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Line a 23x33cm/9x13in Swiss roll tin with a sheet of greaseproof paper and brush the paper lightly with vegetable oil.", "Whisk the caster sugar and egg yolks together in a bowl until pale and thick. Stir in the flour until combined, then stir in the melted chocolate.", "Meanwhile, whisk the egg whites until stiff peaks form when the whisk is removed. ", "Gently fold a spoonful of the whisked egg whites into the chocolate mixture, using a large metal spoon, then gently fold in the remaining egg whites until just combined. (NB: Do not overmix.)", "Carefully pour the cake batter into the prepared Swiss roll tin and bake for 18-20 minutes, until the cake has risen and springs back when a finger is pressed gently into the centre.", "When the cake is cooked, set it aside, in the tin, on a wire rack, to cool for at least two hours.", "When the cake is completely cool, run a butter knife around the inside edge of the tin to loosen the cake. Spread a tea towel out on a large chopping board. With one bold movement, turn the whole cake out onto the tea towel, then lift away the tin. Carefully peel away the greaseproof paper lining.", "Meanwhile, for the filling, carefully mix the chestnut purée, whipped cream and mascarpone in a bowl until well combined, then fold in the chopped chestnuts. Spread the filling all over the cake, leaving a 2cm/1in border free at the edge.", "Starting at the longest side of the cake, gently but firmly roll up the cake, as you would a Swiss roll, using the tea towel as a guide. Transfer the Swiss roll to a flat serving dish.", "To serve, cut the yule log into slices and dust with icing sugar."]}, {"isVegetarian": true, "title": "Choi sum and mixed vegetable salad with pineapple dressing", "url": "www_bbc_co_uk_food_recipes_choisumandmixedveget_89262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz choi sum (Chinese cabbage) leaves, sliced ", "100g/3½oz sugar snap peas", "2 large carrots, julienned", "1 red pepper, de-seeded, sliced  ", "1 yellow pepper, de-seeded, sliced", "240g/8½oz canned pineapple, drained, sliced", "2 spring onions, finely sliced", "2-3 tbsp groundnut oil or olive oil", "7 tbsp pineapple juice ", "2 tbsp light soy sauce ", "1 tbsp rice vinegar or cider vinegar", "pinch freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, toss all of the salad ingredients together in a large salad bowl. ", "For the dressing, whisk all of the dressing ingredients together in a small bowl and drizzle over the salad. Toss well to coat, then pile onto serving plates and serve."]}, {"isVegetarian": false, "title": "Cholent", "url": "www_bbc_co_uk_food_recipes_cholent_16734", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cholent_16734_16x9.jpg", "ingredients": ["170g/6oz butter beans", "280g/10oz barley", "2 tbsp goose fat or sunflower oil", "1.5kg/3lb 5oz beef brisket, or braising steak, cut into cubes", "1.8kg/4lb potatoes, preferably King Edward or Maris Piper, peeled and left whole", "sea salt and freshly ground black pepper", "280g/10oz flour", "2 tsp baking powder", "1 large onion, cut into small cubes", "2 tbsp sunflower oil"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the butter beans in cold water for 24 hours before they are needed. You can use canned beans but dried beans give a much better flavour.", "On the evening of cooking the dish, first make the dumpling. Put the flour and baking powder in a bowl and add the onion, oil and seasoning. ", "Add enough water to make a soft dough, shape into a fat oval, then wrap in clingfilm and leave to chill in the fridge for at least 30 minutes.", "Preheat the oven to 120C/250F/Gas ½. Wash and drain the barley and drain the soaked butter beans. ", "Grease a large heavy casserole dish or a heavy pot with the goose fat or sunflower oil (do not use olive oil) and place the beef in the middle of the dish.", "Position the dumpling, beans, barley and potatoes around the beef, then pour in boiling water to cover everything. Season with salt and freshly ground black pepper and cover with a tightly-fitting lid. Place on a low shelf in the oven and leave to cook overnight.", "In the morning, check there is enough liquid in the pot - there’s usually enough to leave the dish cooking as it is, but if it looks dry, add a little water. The dish will be ready by lunchtime. If you want a darker colour, you could turn the oven heat up a couple of hours before you eat it."]}, {"isVegetarian": false, "title": "Chopped salad", "url": "www_bbc_co_uk_food_recipes_chopped_salad_41277", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chopped_salad_41277_16x9.jpg", "ingredients": ["400g tin chickpeas, drained and rinsed ", "1 iceberg lettuce, chopped", "½ romaine lettuce, chopped", "120g/4½oz Italian salami, cut into thin strips roughly 5cm/1¾in long", "200g/7oz mozzarella, roughly chopped", "3 tomatoes, roughly chopped", "½ cucumber, roughly chopped", "small handful basil leaves, finely chopped", "flaked sea salt and freshly ground black pepper", "4 tbsp olive oil", "1 tbsp red wine vinegar", "½ tsp mustard powder", "½ tsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, mix the chickpeas with 1 teaspoon of salt, then toss with the remaining ingredients in a large bowl.", "To make the dressing, mix all the ingredients together with ½ teaspoon of salt 12 turns of the black pepper mill in a bowl.", "Drizzle the dressing over the salad and toss well. Serve immediately."]}, {"isVegetarian": false, "title": "Chopped duck egg with confit salmon", "url": "www_bbc_co_uk_food_recipes_choppedduckeggwithco_90364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 duck eggs", "50g/2oz unsalted butter, softened", "50ml/2fl oz double cream", "salt and freshly ground black pepper ", "500ml/½ litre olive oil", "200g/7oz kiln-roasted cured salmon fillet, sliced into 4 pieces", "110g/4oz watercress, leaves picked", "fresh chervil sprigs"], "serves": "Serves 4 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck eggs, bring a pan of water to the boil. Using a slotted spoon, gently lower the duck eggs into the water and simmer gently for 7-8 minutes to soft-boil the eggs. ", "Using a slotted spoon, remove the eggs from the water and refresh in a bowl of cold water. Carefully peel off the shells, then slice each egg in half and scoop out the runny yolks into a large bowl. ", "Finely chop the egg whites and add to the bowl with the egg yolks. Mix well until the whites are evenly coated in the yolk. Set aside. ", "For the salmon, pour the olive oil into a heavy-based pan and place over a very low heat, preferably with a heat diffuser underneath the pan. Heat the oil slowly until it registers 55C/130F on a cooking thermometer. ", "Gently lower the salmon into the oil and cook, keeping the temperature consistent by lowering or increasing the heat as necessary, for 8-10 minutes, or until the fish is cooked through. Remove the fish with a slotted spoon and pat dry with kitchen paper. ", "For the watercress, bring a pan of salted water to the boil, add the watercress  and blanch for 20 seconds, or until the leaves are just wilted but still bright green. Drain, then transfer to a food processor and blend to a fine purée. Pour into a warm bowl.", "Place the chopped duck eggs into a pan with the butter, cream, salt and freshly ground black pepper and gently warm through over a medium heat. ", "To serve, spoon the watercress purée into the base of four serving bowls and cover with the chopped duck eggs. Top with a portion of salmon fillet, garnish with the chervil sprigs and serve."]}, {"isVegetarian": true, "title": "Chopped salad with peanuts", "url": "www_bbc_co_uk_food_recipes_choppedsaladwithpean_86558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tomato, finely chopped", "4 tbsp finely chopped cucumber", "1 green chilli, finely chopped", "2 tbsp finely chopped onion", "handful coriander leaves and stalks, chopped ", "2 tbsp salted peanuts, roughly chopped", "1 heaped tbsp desiccated coconut", "¼ tsp grated ginger", "salt, to taste", "1 tsp vegetable oil", "¼ tsp mustard seeds", "few curry leaves", "1 tbsp lemon juice, or to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, mix together all the salad ingredients in a bowl.", "For the spices, heat the oil in a small pan and add the mustard seeds. Once they begin to splutter, add the curry leaves and remove from the heat. Add the lemon juice and stir.", "To serve, pour the spice mixture over the salad and stir to coat. Taste and adjust the seasoning if necessary."]}, {"isVegetarian": false, "title": "Chorizo-stuffed squid with sage, potatoes, peas, capers and aïoli", "url": "www_bbc_co_uk_food_recipes_chorizo-stuffed_squid_25587", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large free-range egg yolk ", "1 small tsp Dijon mustard ", "½ garlic clove, very finely chopped", "1 tsp white wine vinegar, plus extra to taste", "100ml/3½fl oz vegetable oil ", "100ml/3½fl oz extra virgin olive oil ", "salt and freshly ground pepper", "lemon juice, to taste ", "10 baby squid", "3 spicy parrilla cooking chorizos, peeled and chopped finely", "8 new potatoes, cut into quarters", "2 tbsp olive oil", "1 garlic clove, crushed", "25g/1oz unsalted butter", "7 sage leaves, roughly chopped", "25g/1oz fresh peas, podded", "12g/½oz miniature pickled capers", "½ lemon, zest only", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aïoli, place the yolk in a mixing bowl along with the mustard, garlic and vinegar. Begin whisking and slowly add the oils to emulsify with the yolk. As the oils incorporate into the yolk, you can speed up the process. ", "When all the oil has been added, season with salt and pepper and add some lemon juice and vinegar to taste. Set aside.", "For the chorizo-stuffed squid, pull the tentacles away from the body of each squid and reserve them. Check the centre of the tentacles for the hard beak, which can be discarded. Feel inside the body for the quill of each squid (it resembles a shard of plastic). Pull it out of the squid and discard. Rinse inside the body in cold water. Pull the ears (wing-like flaps) from the body. Pull the purplish skin from the ears and body to leave only the white meat.", "Discard the guts of the squid or, if desired, retain the ink sack to use in seafood pasta or risotto.", "Knead the chorizo in a bowl together using your hands to form a rough paste. Take a piece of chorizo and form it into a shape to fill the cavity of one of the squid.", "Fill each squid to about two-thirds full and press it down. Secure each squid tube with a cocktail stick and reserve until ready to cook.", "Cook the potatoes in a pan of salted water until tender and then drain well. Heat a non-stick frying pan over a medium heat, add a lug of olive oil, the crushed garlic and the potatoes and season well with salt and freshly ground black pepper. Cook over a moderate heat tossing occasionally to evenly crisp and caramelise the potatoes.", "Take another non-stick pan and place over a moderate heat. Season the squid pockets and tentacles with salt and pepper.  Add a lug of oil to the pan and add the squid. Cook for two minutes on one side and then turn over and cook for a further two minutes. ", "Add the butter and sage and, when foaming, spoon it over the squid to cook further and ensure the chorizo is cooked inside. The filling will feel firm to the touch when cooked.", "Add the peas, capers and zest and remove the pan from the heat. When the potatoes are ready, transfer to a plate lined with kitchen paper to drain.", "To serve, divide the potatoes between serving plates along with the squid, the buttery pan juices, peas, capers and zest. Serve with a dollop of aioli."]}, {"isVegetarian": false, "title": "Chorizo and butterbean stew with baked potatoes", "url": "www_bbc_co_uk_food_recipes_chorizo_and_butterbean_72682", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_and_butterbean_72682_16x9.jpg", "ingredients": ["4 baking potatoes (200g/7oz each)", "200g/7oz cooking chorizo, sliced", "2 x 390g tins chopped tomatoes with onion and garlic", "2 x 400g tins butterbeans, drained", "50g/1¾oz fresh basil leaves, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Prick the potatoes all over with a fork and microwave on a high heat for 5–6 minutes. Season well with salt. Bake for 10–15 minutes, or until tender. (If you don’t have a microwave, bake for 1 hour at 220C/200C Fan/Gas 7).", "Meanwhile, dry-fry the chorizo in a large saucepan over a medium heat for 4–5 minutes, or until lightly browned. Stir in the chopped tomatoes and beans and bring to a boil. Reduce the heat to medium and cook for 12–15 minutes until slightly thickened, stirring often. Season and stir in the basil.", "Serve the stew with the baked potatoes."]}, {"isVegetarian": false, "title": "Chorizo and lemongrass pastry puff scrolls", "url": "www_bbc_co_uk_food_recipes_chorizo_and_lemongrass_30901", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_and_lemongrass_30901_16x9.jpg", "ingredients": ["a little plain flour, for dusting", "340g/11¾oz pack puff pastry (not ready-rolled as it usually breaks up when you open it) ", "18 pieces pre-sliced chorizo (about 7cm/2¾in wide pieces)", "1 stick lemongrass", "freshly ground black pepper", "1 free-range egg, lightly beaten"], "serves": "Makes 32", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Line a large baking tray with baking parchment and set aside.", "Lightly dust a clean work surface with flour and roll the pastry out to a 25x35cm/10x14in rectangle.", "Arrange six chorizo slices in a slightly overlapping layer in a row down one long side. Repeat to make three rows and completely cover the pastry.", "Top and tail the lemongrass stick and then remove one or two outer layers. Slice the stick very thinly and then sprinkle this evenly over the chorizo. Season with a little twist of pepper.", "With the longest side facing you, roll up the pastry away from you, really tightly like a Swiss roll to be about 4cm/1½in thick. Carefully lift onto the baking tray and then pop it into the fridge to firm up for about 20 minutes. ", "Preheat the oven to 220C/425F/Gas 7 (fan 200C)", "Once the pastry is nice and firm, use a sharp knife to cut the roll into 32 slices about 1cm/½in thick each. Lay each one down on the baking tray, spaced apart, as you go. Brush the sides facing upwards with the beaten egg.", "Bake in the oven for about 15-20 minutes, or until the pastry has puffed up and turned golden-brown. Once baked, remove from the oven, leave to cool for a couple of minutes and then serve on a party platter."]}, {"isVegetarian": false, "title": "Chorizo and thyme fougasse", "url": "www_bbc_co_uk_food_recipes_chorizo_and_thyme_65587", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white bread flour, plus extra for dusting ", "2 tsp salt ", "1 sachet fast-action dried yeast ", "250–300ml/9–11fl oz water ", "4 sprigs of fresh thyme, leaves only ", "50g/2oz cooked chorizo, chopped finely ", "1 tbsp vegetable oil, for greaing ", "3 tbsp milk "], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and dust a large baking tray with flour. ", "Mix the flour, salt and yeast in a large bowl and mix until well combined. Make a well in the centre of the mixture and steadily pour in the water until the dough is loose and easy to knead, but not too sticky.", "Knead the dough for 10 minutes on a lightly floured work surface, or for 5 minutes in an electric mixer fitted with a dough hook. ", "Add the thyme and knead for a further 30 seconds, or until it is well combined. Put half the chorizo in the middle of the dough and then fold the edges around it to cover and knead it for a further minute. ", "Place the dough mixture on a dusted work surface. Shape it into a ball, making sure the top is taught and smooth. Using a rolling pin, roll it out into a rough oval shape. ", "Cut slashes in the loaf to look like a fern leaf with a knife or razor blade, and then open the slashes apart with floured hands. ", "Push the remaining chorizo into the top of the dough, then cover loosely with oiled cling film (you may need several pieces). Leave to rise in a warm place until the dough has doubled in size, approximately for one hour.", "Once risen, remove the clingfilm, brush the dough with milk and place in the hot oven. Spray the oven with water before closing - this will prevent a crust from forming too quickly and will help to ensure a good rise. Bake for 30–35 minutes, or until the bread is well-risen and golden brown. It will come off the tray once fully cooked too. ", "To serve, either keep the bread whole or cut into chunks to eat before or with a main meal."]}, {"isVegetarian": false, "title": "Chorizo and chickpea stew with chorizo-stuffed chicken", "url": "www_bbc_co_uk_food_recipes_chorizo_and_tomato_soup_10248", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz semi-cured chorizo, skinned, roughly chopped", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 red chilli, finely chopped", "1 tsp smoked paprika", "2 tomatoes, skinned, seeds removed, chopped", "200g/7oz tinned chopped tomatoes", "400g/14oz tinned chickpeas, drained", "110ml/4fl oz chicken stock", "300g/11oz baby spinach leaf", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "3 tbsp coriander cress", "150g/5oz cured chorizo, cut into thick slices", "110g butter, softened", "dash lemon juice", "4 chicken breasts, boneless and skinless", "50g/2oz plain flour", "2 free-range eggs, lightly beaten", "110g/4oz dried breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan and fry the chorizo for 3-4 minutes, or until crisp.", "Add the onion, garlic and chilli and fry for 2-3 minutes, or until softened.", "Add the paprika and stir until well combined. Place the tomatoes, chickpeas and chicken stock into the pan and bring to the boil.", "Reduce the heat and simmer for 4-5 minutes. Add the spinach and fold it through the stew.", "Return the mixture to the heat and season with salt and freshly ground black pepper. Cook for another minute to wilt the spinach, then season with lemon juice.", "For the chorizo-stuffed chicken, heat a deep fat fryer to 170C/340F. (CAUTION: Do not leave hot fat unattended.)", "Place the chorizo and butter into a food processor and blend to a purée. Add a little touch of lemon juice and black pepper, then spoon into a piping bag. Make an incision in the side of the chicken breast and pipe some of the chorizo butter into the chicken.", "Press the incision shut then dust with the flour. Prepare a plate of egg and a plate of breadcrumbs. Dip the chicken first in the egg, then the breadcrumbs. Place into the fat fryer and cook for 8-9 minutes, or until golden-brown and cooked through.", "To serve, cut the chicken in half carefully. Place the stew into a bowl and top with the chicken. Finish with a drizzle of extra virgin olive oil and scattering of cress."]}, {"isVegetarian": false, "title": "Chorizo eggs with scallops and coriander salt", "url": "www_bbc_co_uk_food_recipes_chorizo_eggs_with_94719", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large scallops", "20 coriander seeds", "10g/½oz cinnamon stick", "200g/7oz sea salt", "175g/6oz butter, softened", "40g/1½oz yeast extract", "150g/5oz soft cooking chorizo, skin removed, meat diced", "4 free-range eggs", "1 tbsp sunflower oil", "4 thick slices malted grain bread", "1 x 20g/¾oz punnet coriander cress ", "freshly ground black pepper", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Prise open the scallop shells, pat the scallops dry with kitchen paper and leave in the fridge, uncovered, for 2-3 hours to dehydrate slightly. ", "Meanwhile, for the coriander salt, dry fry the coriander seeds and cinnamon stick in a frying pan over a medium heat for 30-40 seconds, or until toasted and fragrant.", "Transfer the toasted seeds to a spice grinder and blend to a coarse powder. Tip the powder into a bowl and mix in the sea salt. Set the coriander salt mixture aside.", "When the scallops have dried out in the fridge, preheat the grill to its highest setting. Remove the scallops from their shells and cut each in half to create two thinner scallops. Mix 160g/5½oz of the butter with the Marmite until smooth and well combined and set aside.", "Heat a frying pan over a medium heat, add the diced chorizo and fry for 4-5 minutes, or until golden-brown.", "Crack the eggs into the pan over the chorizo pieces and fry for 1-2 minutes, or until cooked to your liking. Remove the pan from the heat", "Meanwhile, heat a separate frying pan over a medium heat until hot. Add the sunflower oil and the remaining 15g/½oz of butter. When the butter has melted, add the scallops and cook for 15-20 seconds on the cut side, or until golden-brown.", " Remove the scallops from the pan and place them, cut-sides down, into a cold, ovenproof frying pan. Place the pan under the grill and grill the scallops for 30 seconds, or until just cooked through.", "To serve, toast the bread until crisp and golden-brown. Place one slice into each of four serving plates. Season the chorizo eggs with a little of the coriander salt and freshly ground black pepper. Place one on top of each slice of toast and garnish with the coriander cress. Squeeze the lemon juice over the scallops, season with a little more of the coriander salt, then brush them with the Marmite butter. Place one scallop on top of each portion of chorizo eggs."]}, {"isVegetarian": false, "title": "Chorizo guacamole", "url": "www_bbc_co_uk_food_recipes_chorizo_guacamole_64754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ripe avocado", "1 lime, juice only", "3 tbsp roughly chopped chives", "150g/5½oz cooked chorizo sausage, roughly chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Scoop the avocado flesh into a mixing bowl.", "Squeeze the lime juice over the avocado to prevent it from discolouring.", "Lightly crush the avocado with a fork.", "Skin and roughly chop the chorizo.", "Roughly chop the chives and then fold everything together with the avocado and serve. "]}, {"isVegetarian": false, "title": "Chorizo tapas", "url": "www_bbc_co_uk_food_recipes_chorizo_tapas_72587", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_tapas_72587_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 banana shallot, sliced", "1 garlic clove, finely chopped", "300g/1oz chorizo, cut diagonally into 2.5cm/1in chunks", "2 fresh bay leaves", "200ml/7fl oz red wine", "2 tbsp olive oil", "2 garlic cloves, sliced", "300g/11oz chorizo, cut diagonally into ½cm/¼in thick slices", "pinch sea salt", "8 medium-sized prawns, shell on", "50ml/2fl oz dry sherry", "2-3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chorizo in red wine, heat a frying pan until medium hot, add the olive oil, shallot and garlic and fry for 2-3 minutes, or until softened.", "Add the chorizo to the pan and fry for 1-2 minutes, or until crisp and the oil is released.  ", "Add the bay leaves and red wine, and cook until the volume of wine has reduced to just coat the chorizo.  ", "For the prawns with chorizo, heat a frying pan until medium hot, add the olive oil and garlic and fry for 1-2 minutes. Add the chorizo and fry for a further 1-2 minutes.", "Add the sea salt and prawns and cook for 2-3 minutes, or until the prawns are just pink. ", "Add the dry sherry and deglaze the pan.  ", "Tip into a serving dish and sprinkle over the parsley."]}, {"isVegetarian": false, "title": "Chorizo and bean quesadilla", "url": "www_bbc_co_uk_food_recipes_chorizoandbeanquesad_76375", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizoandbeanquesad_76375_16x9.jpg", "ingredients": ["85g/3oz cheddar, grated", "55g/2oz chorizo, chopped", "85g/2oz mixed beans, mashed slighly with a fork", "handful fresh coriander, chopped, plus extra to garnish", "salt and freshly ground black pepper ", "2 Mexican tortilla wraps", "2 tbsp olive oil", "½ garlic clove, peeled and chopped", "2 tomatoes, chopped", "6cm/3in piece of cucumber, chopped"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the cheese, chorizo, beans, coriander and salt and freshly ground black pepper in a bowl.", "Spread the mixture onto one of the tortillas and top with the other.", "Heat a little oil in a frying pan and pan-fry the quesadilla for 2-3 minutes on each side.", "Meanwhile, for the salad, mix all the ingredients together in a bowl and season with salt and pepper. Garnish with more fresh coriander.", "To serve, transfer the quesadilla to a plate and serve the salad alongside."]}, {"isVegetarian": false, "title": "Chorizo and brandy chicken", "url": "www_bbc_co_uk_food_recipes_chorizoandbrandychic_86376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 chicken, jointed (you can ask your butcher to do this or buy chicken portions if you prefer)", "570ml/1 pint hot chicken stock", "1 onion, peeled and quartered", "2 cloves", "1 large carrot, halved ", "1 celery stick, halved", "2 bay leaves", "few sprigs fresh thyme", "1 tsp smoked paprika", "4 garlic cloves, skin on, slightly bruised using a rolling pin", "1 tbsp plain flour", "1 tbsp unsalted butter", "4 tbsp brandy", "110g/4oz cured chorizo sausage, finely chopped", "salt and freshly ground black pepper ", "110g/4oz Manchego cheese, grated (use parmesan instead if not available)", "4 jacket potatoes, baked", "225g/8oz green beans, cooked"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat the oil in a pan over a medium heat and cook the chicken portions, turning frequently, for about 5-6 minutes, or until browned on all sides.", "Meanwhile, bring the stock to the boil in a large saucepan. Stud one of the onion quarters with the two cloves and add to the pan along with the remaining onion quarters, the chicken, carrot, celery, bay leaves, thyme, paprika and garlic. Simmer very gently, uncovered, for 30-45 minutes, or until the chicken just starts to fall apart. Remove the chicken from the pan and place into a roasting tin. Strain the stock through a sieve into a bowl.", "Preheat the oven to 180C/350F/Gas 4.", "For the sauce, return the strained stock to the pan, bring to the boil and simmer until the liquid has reduced by half.", "In a bowl, for the sauce, mash the flour and butter together to make a paste (this, in chef terms, is a beurre manié). Whisk this paste into the stock along with the brandy and simmer for 3-4 minutes, until thickened and smooth. Add the chorizo and season, to taste, with salt and freshly ground black pepper.", "Pour this sauce over the chicken in the roasting tin and sprinkle over the grated cheese. Transfer to the oven and bake for 10-15 minutes, or until the cheese is bubbling and lightly browned.", "To serve, place portions of the chicken onto four serving plates and serve with the jacket potatoes and green beans."]}, {"isVegetarian": false, "title": "Chorizo and potato hash with poached egg", "url": "www_bbc_co_uk_food_recipes_chorizoandpotatohash_86059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz chorizo, sliced", "85g/3oz new potatoes, cooked and sliced", "1 spring onion, chopped", "salt and freshly ground black pepper", "1 free-range egg, poached, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan and fry the chorizo for 2-3 minutes, stirring frequently.", "Add the sliced cooked potatoes and the spring onion and cook gently, stirring occasionally, for five minutes.", "Slightly crush the potatoes with a fork and mix well to combine the ingredients. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the chorizo and potato hash onto a serving plate and top with a poached egg."]}, {"isVegetarian": false, "title": "Chorizo, artichoke and tomato pizzette", "url": "www_bbc_co_uk_food_recipes_chorizoartichokeandt_91279", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint 1½fl oz water, at room temperature", "2 x 7g/¼oz sachets fast-action dried yeast", "1 tbsp caster sugar", "1 tbsp extra virgin olive oil", "1kg/2lb 3¼oz type '00' flour, plus extra for dusting", "½-1 tsp salt", "handful black olives, pits removed, finely chopped", "2 tbsp olive oil", "1 chorizo sausage, finely chopped", "10 plum tomatoes, chopped", "3 garlic cloves, crushed to a paste with the edge of a knife", "small bunch basil leaves, finely chopped", "1 tsp caster sugar", "¼ tsp salt", "freshly ground black pepper", "freshly made tomato sauce (see above)", "200g/7¼oz jalapeno peppers, chopped", "200g/7¼oz artichoke hearts, chopped", "200g/7¼oz Roquefort cheese, or similar strong blue cheese, crumbled into large pieces", "2 tbsp chopped fresh oregano", "rocket salad, to serve"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7. ", "For the pizzetta bases, in a jug, mix together the water, yeast, sugar and olive oil until well combined (this is the starter). ", "Sift the flour and salt into a large bowl. Make a well in the centre, then pour the starter mixture into the well and add the chopped olives. Stir until the mixture comes together as a dough and is well combined. ", "Turn out the dough mixture onto a lightly floured work surface and knead for 3-4 minutes until smooth. ", "Divide the dough into 20 equal portions and roll into balls (each portion should be about the size of a tennis ball). Place the dough balls onto a baking tray and cover with a damp cloth, then set aside in a warm place for 18-20 minutes, or until the balls have doubled in size. ", "On a lightly floured work surface, flatten each ball of dough with your hands to form pizzetta bases that are 2.5cm/1in thick and 5cm/2in in diameter. Set aside.", "For the tomato sauce, heat the oil in a pan over a medium heat. Add the chopped chorizo and fry for 3-4 minutes, or until the chorizo is fragrant and crisp. ", "Add the tomatoes and garlic, stir well and bring the mixture to a simmer. Continue to simmer over a medium heat for 25-30 minutes, or until the tomatoes have broken down. Add the basil leaves and sugar. Season, to taste, with salt and freshly ground black pepper.", "For the topping, spread half a tablespoon of the tomato sauce all over each of the pizzetta bases. Sprinkle over the topping ingredients. ", "Transfer the pizzette to a hot oven and bake for 8-10 minutes, or until the bases are crisp and golden-brown, the cheese has melted and the topping ingredients have softened and coloured.", "To serve, slice the pizzette and place a handful of rocket salad alongside."]}, {"isVegetarian": false, "title": "Chorizo, chicken and chickpea casserole", "url": "www_bbc_co_uk_food_recipes_chorizochickenandchi_87895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizochickenandchi_87895_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "500g/1lb 2oz chicken thighs", "1 onion, sliced", "1 garlic clove, sliced ", "2 carrots, chopped", "1 celery stalk, chopped", "1 red chilli, deseeded and chopped", "splash red wine", "275g/9½oz chorizo, chopped", "100ml/3½fl oz dry sherry", "1 x 400g/14oz can chopped tomatoes", "200ml/7fl oz chicken stock", "1 x 400g/14oz can chickpeas, rinsed and drained ", "salt and freshly ground black pepper", "handful chopped fresh parsley", "crusty bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the vegetable oil in a large pan. Add the chicken thighs and fry, turning frequently, until lightly browned all over. Remove from the pan and keep warm. ", "Add a little more oil to the pan, then add the onion, garlic, carrots, celery and chilli and cook for five minutes. Add a splash of red wine and simmer until reduced by half. ", "In another pan, heat the remaining oil and fry the chorizo for 2-3 minutes. Add the sherry and cook until the chorizo is crisp. Set aside.", "Add the can of chopped tomatoes to the pan with the vegetables and bring to the boil. Cook for five minutes, then add the stock and bring back to the boil.", "Add the browned chicken, the chickpeas and crisp chorizo and simmer for 20-25 minutes, or until the chicken is completely cooked through. Season, to taste, with salt and freshly ground black pepper.", "Sprinkle with chopped parsley and serve with crusty bread."]}, {"isVegetarian": false, "title": "Chorizo chicken with sautéed chorizo, potatoes and spinach", "url": "www_bbc_co_uk_food_recipes_chorizochickenwithsa_90360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz boneless chicken breasts, skin removed", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 banana shallot, finely chopped", "175g/6oz chorizo, finely chopped", "2 tbsp chopped fresh flatleaf parsley", "1 lemon, zest only", "300g/10oz semi-cured chorizo, chopped", "450g1lb new potatoes, cooked and cut into quarters", "250g/8oz cherry tomatoes, cut in half", "3 tbsp chopped fresh flatleaf parsley", "salt and freshly ground black pepper", "50g/2oz butter", "600g/1lb 6oz baby leaf spinach ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, preheat the oven to 200C/400F/Gas 6.", "Using a knife, make a deep cut in the side of each chicken breast to create a pocket. Season each chicken breast, to taste, with salt and freshly ground black pepper.", "Heat one tablespoon of the olive oil in a frying pan over a medium heat, add the shallot and fry for 1-2 minutes, or until just softened. Remove from the heat.", "In a bowl, mix together the shallot, chorizo, parsley and lemon zest until well combined. Season, to taste, with freshly ground black pepper.", "Fill each chicken breast with the chorizo mixture.", "Heat the remaining olive oil in a separate, ovenproof frying pan over a high heat, add the stuffed chicken breasts and fry for 1-2 minutes on each side, or until golden-brown on both sides.", "Transfer to the oven and cook for 15-18 minutes, or until completely cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Remove the chicken breasts from the pan and set aside on a warm plate to rest.", "Meanwhile, for the sautéed chorizo and potatoes, heat a separate frying pan over a medium heat, add the chorizo and fry for 2-3 minutes, or until the oil comes out of the chorizo.", "Add the potatoes, and fry for 3-4 minutes, or until crisp and golden-brown.", "Add the tomatoes and fry for a further 2-3 minutes, or until just softened.", "Add the parsley, then season, to taste, with salt and freshly ground black pepper and stir well to combine.", "For the spinach, heat the butter in a separate frying pan over a medium heat until melted, add the spinach and fry for 1-2 minutes, or until just wilted. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the spinach equally among four serving plates. Carve the chicken diagonally into three pieces and arrange the pieces on top of the spinach. Spoon the sautéed chorizo and potatoes alongside. Drizzle over any remaining juices from the chorizo."]}, {"isVegetarian": false, "title": "Chorizo hash with peppers and paprika", "url": "www_bbc_co_uk_food_recipes_chorizohashwithpeppe_67954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 oz (150 g) chorizo sausage ", "1 small red pepper ", "1 rounded teaspoon hot paprika ", "1 medium onion ", "10 oz (275 g) Desirée or King Edward potatoes ", "4 tablespoons olive oil ", "1 fat clove garlic, peeled and crushed ", "2 large, very fresh eggs ", "salt and freshly milled black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First the onion needs to be peeled, sliced in half and then each half sliced as thinly as possible so you end up with little half-moon shapes. Next halve and deseed the red pepper, slice it, then chop it into ½ inch (1 cm) pieces. After that, peel the skin off the chorizo sausage and cut into pieces roughly the same size as the pepper.", "The potatoes need to be washed and cut into ½ inch (1 cm) cubes, leaving the skin on. Then place them in a saucepan and pour enough boiling water from the kettle to almost cover them, then add salt and a lid and simmer for just 5 minutes before draining them in a colander and covering with a clean tea cloth to absorb the steam. ", "Next heat 2 tablespoons of the oil in the larger frying pan and, when it's fairly hot, add the onion, pepper and garlic and cook for about 6 minutes, until softened and tinged brown at the edges. Then push these to the side of the pan, add the chorizo and, keeping the heat fairly high, cook for about 2 minutes, again, till nicely browned at the edges. Next, add the paprika and stir everything together, then remove the whole lot to a plate. ", "Now add another tablespoon of oil to the pan and, still keeping the heat high, add the potatoes and seasoning. Toss them around in the hot pan for about 3 minutes, keeping them moving, until they begin to crisp and brown at the edges, then return the chorizo, onion and pepper to the pan and, using a pan slice, keep turning the mixture over. Carry on cooking the whole thing for 5-6 minutes, until it's all really brown and crispy. Then turn the heat down to its lowest setting and, in the other pan, fry the eggs in the remaining oil (see How to fry an egg, below). Serve the hash divided between the two warmed plates with an egg on top of each and have plenty of tomato ketchup on the table."]}, {"isVegetarian": false, "title": "Chorizo and couscous stuffed marrow", "url": "www_bbc_co_uk_food_recipes_chorizopepperandcous_75307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizopepperandcous_75307_16x9.jpg", "ingredients": ["1 large marrow, peeled", "100g/3oz couscous", "1 lemon, juice only", "2 tbsp olive oil", "1 red onion, finely sliced", "100g/3oz chorizo, cut into small chunks", "1 roasted red pepper, finely sliced", "2 vine ripened tomatoes, seeded and chopped", "1 tbsp parsley, roughly chopped", "1 tbsp mint, roughly chopped", "1 tbsp coriander, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat an oven to 200C/390F/Gas 6.", "For the chorizo, pepper and couscous stuffed marrrow, slice the marrow lengthways and scoop out all the seeds, then place on a roasting tray.", "Place the couscous in a bowl along with the lemon juice and enough boiling water to cover.", "Cover with cling film and allow to soak for five minutes.", "Meanwhile, heat a frying pan until hot then add the olive oil. Add the red onion and stir-fry for 3-4 minutes until just softened. Add the chorizo and fry for a further two minutes until just crisped and the juices are released. Add to the couscous, along with the pepper, tomatoes and herbs.", "Mix well and season to taste with salt and black pepper. Spoon into the centre of the two marrow halves.", "Place in the oven for 20 minutes and cook until piping hot and the marrow is just tender. ", "To check if the marrow is done, place the tip of a knife into the side, if it offers just a little resistance it is done. "]}, {"isVegetarian": false, "title": "Chorizo sausage roll with red onion marmalade", "url": "www_bbc_co_uk_food_recipes_chorizosausagerollwi_84082", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 x 5cm/2in strips ready-made puff pastry", "1 cooking chorizo sausage, skin removed", "1 egg, beaten", "1 tbsp olive oil", "½ red onion, thinly sliced", "2 tbsp soft brown sugar", "1 tbsp tomato purée", "1 tbsp red wine vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Wrap the pastry strips around the chorizo and brush with the beaten egg. Place onto a baking sheet and place into the oven to bake for 10 minutes, or until the pastry is golden.", "For the marmalade, place the oil in a saucepan over a medium heat. Add the onions and fry for three minutes to soften. Add the remaining ingredients and cook for 7-8 minutes, or until thickened.", "To serve, slice the sausage roll into three pieces and place onto a plate with a tablespoonful of the marmalade alongside."]}, {"isVegetarian": false, "title": "Chorizo, tomato and chickpea stew", "url": "www_bbc_co_uk_food_recipes_chorizotomatoandchic_85891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz chorizo, sliced", "1 garlic clove, chopped", "240g/8½oz canned cherry tomatoes, drained", "125g/4½oz canned chickpeas, rinsed and drained", "50g/2oz olives, stones removed", "1 tbsp olive oil", "75g/2½oz canned cooked new potatoes, halved", "2 tbsp fresh breadcrumbs", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan and fry the chorizo for 2-3 minutes.", "Add the garlic and cook for one minute. Add the cherry tomatoes, chickpeas and olives and cook for 2-3 minutes.", "In a separate frying pan, heat the olive oil, add the new potatoes and sauté until golden-brown on all sides. Add the sautéed potatoes to the tomato stew, then pour the mixture into an ovenproof dish.", "Preheat the grill to medium.", "Place the breadcrumbs and parsley into a small bowl and mix together. Sprinkle the breadcrumb mixture over the stew, then place under the grill and cook for 2-3 minutes, or until golden-brown on top. Serve in the dish."]}, {"isVegetarian": true, "title": "Savoury-filled choux buns", "url": "www_bbc_co_uk_food_recipes_choux_buns_filled_with_18960", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter, softened", "65g/2¼oz plain flour", "2 large free-range eggs", "salt", "2 large red onions, sliced", "50g/1¾oz caster sugar", "2 tbsp olive oil", "1-2 tsp balsamic vinegar", "salt", "1 bay leaf", "½ tsp dried chilli flakes", "120ml/4fl oz double cream", "200g/7oz soft goats’ cheese (soft-textured rather than waxy)", "100g/3½oz shelled walnuts, chopped and toasted", "50g/1¾oz rocket"], "serves": "Makes about 15", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the choux buns, preheat the oven to 220C/fan oven 200C/425F/Gas 7. Grease and line a baking tray. ", "Heat 150ml/5fl oz water in a saucepan. Add the softened butter in small pieces and bring the mixture to a rolling boil.", "When the butter has melted, add the flour to the mixture all at once and beat continuously until the mixture is thick and smooth. Continue to beat until the dough comes away cleanly from the sides of the pan.", "Remove the dough from the pan and place in a bowl to cool.", "When the dough is cool, beat the eggs in a clean bowl with a fork. Gradually add the beaten egg mixture to the dough, a bit at a time, mixing well between each addition; the mixture should now be at dropping consistency, but still firm enough to be piped in a piping bag. (You may not need to use all of the beaten egg.)", "Transfer the mixture to a piping bag fitted with a 1cm/½in plain nozzle. Pipe the pastry into small circles of about 5cm/2in on the prepared baking tray.", "Bake for 10-15 minutes and then reduce the heat to 190C/fan oven 170C/375F/Gas 5 and cook for a further 20-25 minutes, or until they are golden-brown and dry. Remove from the oven and transfer to a wire rack to cool.", "For the caramelised red onions, place all the ingredients into a pan and cook for 20 minutes over a low heat. Remove from the heat and leave to cool.", "For the filling, stir the cream into the goats’ cheese in a bowl. Put the mixture into a piping bag fitted with a wide star nozzle. ", "Cut each choux bun in half and pipe the goats’ cheese on top of each halved choux bun. Add a teaspoon of onion and top with a walnut and a little rocket. "]}, {"isVegetarian": false, "title": "Chow mein", "url": "www_bbc_co_uk_food_recipes_chowmein_74002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chowmein_74002_16x9.jpg", "ingredients": ["225g/8oz egg noodles", "2 tbsp sesame oil", "100g/4oz chicken breast, skinned", "2½ tbsp finely chopped garlic", "50g/2oz mangetout, trimmed", "50g/2oz Parma ham or cooked ham, finely shredded", "2 tsp light soy sauce", "2 tsp dark soy sauce", "1 tbsp Shaoxing rice wine or dry sherry", "½ tsp salt", "½ tsp freshly ground white pepper", "½ tsp sugar", "3 tbsp finely chopped spring onions", "2 tsp sesame oil", "2 tsp light soy sauce", "2 tsp Shaoxing rice wine or dry sherry", "1 tsp sesame oil", "½ tsp salt", "½ tsp freshly ground white pepper"], "serves": "Serves   4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles by boiling them for 3-5 minutes in a pan of boiling water. Drain and plunge into cold water, drain again then toss with a little sesame oil.", "Using a cleaver, slice the chicken breasts into fine shreds approximately 5cm (2 in) long. ", "To marinate the chicken, combine the chicken with the light soy sauce, rice wine, sesame oil, salt and pepper in a small bowl.", "Mix well and leave to marinate for 20 minutes.", "Heat a wok until it is very hot. Add one tablespoon of oil and, when it is very hot and slightly smoking, add chicken shreds.", "Stir-fry the mixture for about two minutes, then transfer to a plate. ", "Reheat the wok, and add remaining oil. Add the garlic and stir-fry for 10 seconds. Add the mangetout and ham and fry for one minute.", "Add noodles, light soy sauce, dark soy sauce, rice wine, salt and pepper, the sugar and spring onions and continue to stir-fry for two minutes. ", "Return chicken to noodle mixture.", "Continue to fry for 3-4 minutes, until chicken is cooked. ", "Stir in sesame oil and give a few final stirs.", "Turn onto warm serving platter and serve at once."]}, {"isVegetarian": false, "title": "Chris Evans' big breakfast", "url": "www_bbc_co_uk_food_recipes_chrisevansbigbreakfa_92550", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 rashers smoked streaky bacon, rind removed", "25g/1oz butter", "500g/1lb 2oz mixed wild mushrooms (such as oyster, shiitake, or chanterelle), cleaned, roughly chopped", "1 tbsp olive oil", "4 slices sourdough bread", "1 tbsp vegetable oil", "4 truffle-infused duck eggs", "1 tbsp chopped fresh parsley, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Arrange the bacon rashers on a baking tray, then place a second baking tray on top. Transfer to the oven and cook for 5-8 minutes, or until the bacon rashers are crisp and golden-browned and cooked through. Set aside to cool for 10 minutes.", "Heat a frying pan over a medium heat. Add the butter and, when it is foaming, add the chopped mixed mushrooms and fry for 3-4 minutes, or until golden-brown.", "Meanwhile, heat a griddle pan over a medium heat. Drizzle the olive oil over the sourdough bread. Grill the bread slices, in batches, for 1-2 minutes on each side, or until golden-brown griddle marks appear on both sides of the bread. Repeat the process with the remaining slices of sourdough bread. Keep warm. ", "Meanwhile, heat the vegetable oil in a small frying pan over a high heat. When the oil is hot, crack the truffle-infused duck eggs into the pan, in batches if necessary. Cook for 1-2 minutes, or until the whites are cooked through but the yolk is runny. Remove from the pan and set aside. Repeat the process with the remaining truffle-infused duck eggs. ", "To serve, place one piece of grilled sourdough bread into the centre of each of four serving plates. Place one truffled duck egg on top of each slice of bread. Place two rashers of crisp bacon alongside each. Spoon the mixed mushrooms alongside, then sprinkle over the chopped parsley."]}, {"isVegetarian": true, "title": "Christmas apple tarts", "url": "www_bbc_co_uk_food_recipes_christmas_apple_tarts_28037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4½fl oz ice-cold water", "4 medium dessert apples, peeled, halved lengthways and cored", "110g/4oz butter, melted", "75g/3oz caster sugar", "110g/4oz sultanas", "50g/2oz soft dark brown sugar", "½ tsp ground mixed spice", "½ tsp ground cinnamon", "115g/4oz dark soft brown sugar", "115g/4oz butter", "175ml/6fl oz double cream"], "serves": "Makes 6 tartlets", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, put the flour in a mound on the work surface and make a well in the centre.  Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated, but don’t overwork the dough.  ", "Roll it into a ball, wrap in cling film and refrigerate for 20 minutes.  ", "Flour the work surface and roll out the pastry into a 40x20cm/16x8in rectangle.", "Fold it into three, by folding the outside third on each side over onto the middle section, then give it a quarter-turn. ", "Roll the block of pastry into a 40 x 20cm rectangle as before, and fold it into three again.  ", "These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes.", "Give the chilled pastry another two turns, rolling and folding as before. This makes a total of four turns, and the pastry is now ready.  ", "Wrap it in cling film and refrigerate for at least 30 minutes before using.  ", "For the tartlets, preheat the oven to 200C/400F/Gas 6. ", "On a light floured surface, roll out the pastry to a 3mm/1/8in thickness.", "Using a 10cm/4in pastry cutter, cut out six discs and six small leaf shapes.", "Brush a baking sheet with a little cold water and lift the pastry onto it with a palette knife. Refrigerate for 20 minutes.", "Prick the pastry discs with a fork, and mark the leaves with a knife to form veins.", "Brush the halved apples with butter then sprinkle with some of the caster sugar and set aside.", "Mix the sultanas with the soft dark brown sugar, spices and remaining butter in a bowl, then spoon the sultana mix onto the centre of the pastry.", "Finely slice the apples, keeping them in their original shape, then place over the top of the sultana mix on the pastry and press gently to one side so the slices just separate, but the filling is enclosed.", "Place the leaf shapes onto the edge of the pastry and brush with butter and sugar. (Place into the freezer at this stage if you want to and freeze until needed.)", "Bake for 15 minutes, then sprinkle generously with the caster sugar and cook for another five minutes. ", "Take the tartlets out of the oven and immediately lift them onto a wire rack with a palette knife.", "For the caramel sauce, heat the sugar and butter in a small saucepan until melted and well combined. ", "Pour in the double cream and simmer gently for 3-5 minutes, or until the mixture thickens slightly.", "To serve, slide the tart onto a plate and serve with a spoonful of caramel sauce."]}, {"isVegetarian": false, "title": "Christmas barbecued coconut prawns and chicken tikka", "url": "www_bbc_co_uk_food_recipes_christmas_barbecued_39176", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in piece fresh root ginger, peeled and roughly chopped", "2 garlic cloves, roughly chopped", "2 green chillies, roughly chopped", "1 tbsp ground coriander", "1 tbsp ground cumin", "1 x 160ml tin coconut cream", "2 limes, juice only plus 2 limes, cut into wedges, to garnish", "small bunch fresh coriander, roughly chopped", "1 onion, roughly chopped", "8 large Madagascan prawns, shells left on", "5cm/2in piece ginger, peeled and grated", "1 tbsp tomato purée", "1 green chilli, finely chopped", "2 garlic cloves", "1 tsp ground turmeric", "1 tsp red chilli powder", "1 tsp ground cumin", "1 tsp garam masala", "400g/14oz Greek-style yoghurt", "2 limes, juice only", "4 boneless skinless chicken breasts, cut into chunks", "4 ripe tomatoes", "1 lime, juice only", "½ tsp ground cumin", "½ tsp ground coriander", "small bunch fresh coriander, roughly chopped", "small bunch fresh mint, leaves only, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the coconut prawns, blend all of the coconut prawn ingredients, except for the prawns, to a smooth paste in a food processor.", "Thread the prawns onto 4 large metal skewers, place them onto a baking tray, then spoon the marinade mixture over the top, turning to coat the prawns completely. Cover and marinate for at least 2 hours in the fridge.", "For the chicken tikka, blend all of the chicken tikka ingredients except for the chicken to a smooth paste in a clean food processor. ", "Place the chicken pieces in a bowl, spoon over the marinade mixture and stir to coat. Cover and marinate for at least 2 hours in the fridge. When marinated, thread the chicken pieces onto large metal skewers.", "When you’re ready to start cooking, light your barbecue. Allow the flames to flare up and die down, until the coals are glowing red and starting to turn white. ", "While the barbecue is warming up, make the dip by blending all of the dip ingredients to a coarse salsa in a clean food processor. ", "When the barbecue is ready, lay the prawn skewers over the coals and cook for 5-8 minutes, turning once, until slightly charred on both sides. Cook the chicken skewers at the same time, for 12-15 minutes, or until the chicken is cooked through. (The chicken is cooked through when the juices run clean when the meat is pierced with a knife and no trace of pink remains.) Alternatively, heat a griddle pan until hot and cook the prawns and chicken until cooked through.", "To serve, slide the prawns and chicken from the skewers onto plates and serve with a dollop of the dip alongside, garnished with the lime halves."]}, {"isVegetarian": true, "title": "Christmas brownies", "url": "www_bbc_co_uk_food_recipes_christmas_brownies_41164", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_brownies_41164_16x9.jpg", "ingredients": ["30ml/1fl oz brandy", "100g/3½oz dried cranberries", "300g/10½oz dark chocolate, broken into chunks", "200g/7oz butter", "4 free-range eggs", "300g/10½oz light muscovado sugar", "200g/7oz plain flour", "1 tsp mixed spice", "100g/3½oz pecans, roughly chopped", "icing sugar, to serve"], "serves": "Makes 24 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a 30x20cm/12x8in tin with baking parchment.", "Gently heat the brandy then add the cranberries and leave to soak while you prepare the brownie mix.", "Melt the chocolate and butter in a bowl over a pan of simmering water, or in the microwave. Stir gently until smooth then set aside to cool slightly.", "In a large bowl, whisk together the eggs and sugar until pale and fluffy.", "Whisk the chocolate and butter mix into the eggs then gently fold in the flour, mixed spice, pecans, cranberries and brandy until fully incorporated.", "Pour into the prepared tin, smooth the surface then bake in the oven for 25-30 minutes, or until the brownie is firm to the touch.", "Leave to cool in the tin for 10 minutes, then place on a wire rack until cooled completely.", "Once cool, cut into squares and dust the tops with icing sugar."]}, {"isVegetarian": false, "title": "Christmas cake pops", "url": "www_bbc_co_uk_food_recipes_christmas_cake_pops_03112", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_cake_pops_03112_16x9.jpg", "ingredients": ["400g/14oz Christmas cake", "100g/3½oz dark chocolate", "100g/3½oz white chocolate", "sprinkles, to decorate"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Break the Christmas cake into pieces then blend in the food processor for a few minutes to turn into crumbs.", "Divide the mix into 12 and shape into balls. Place in the fridge for a couple of hours to firm up.", "Melt the chocolates in separate bowls, over pans of simmering water or in a microwave.", "Make a hole in each ball with a lolly stick, then dip the end of the stick in the melted chocolate and place back in the hole. Repeat with the other sticks and leave to set for about 30 minutes.", "Re-melt the chocolate if necessary, then, using a teaspoon pour the chocolate over a cake pop, holding it over the bowl. Work quickly to get a smooth finish. Tap the cake pop on the side of the bowl to get rid of the excess chocolate, then stick into a piece of polystyrene or upturned colander while you coat the rest of the pops.", "Once the chocolate has set slightly, but is still sticky, coat in sprinkles then leave to set completely."]}, {"isVegetarian": true, "title": "Christmas cake present", "url": "www_bbc_co_uk_food_recipes_christmas_cake_present_81563", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_cake_present_81563_16x9.jpg", "ingredients": ["150g/5½oz mixed dried fruit, such as sultanas, raisins and currants", "150g/5½oz dried cranberries", "150g/5½oz pitted soft prunes", "150g/5½oz pitted soft-dried dates", "150g/5½oz dried figs", "150ml/5fl oz brandy, plus optional extra to ‘feed’ the cake", "½ orange, finely grated zest and juice only", "150g/5½oz mixed whole nuts", "150g/5½oz butter, softened", "150g/5½oz dark muscovado sugar", "3 tbsp black treacle or date syrup, optional", "3 free-range eggs (at room temperature), beaten", "150g/5½oz self-raising flour", "3 tbsp ground mixed spice", "4 tbsp apricot jam", "750g/1lb 10oz ready to roll fondant", "750g/1lb 10oz marzipan", "selection of ribbons", " gingerbread gift tags, optional (see recipe in link)"], "serves": "Makes 20cm/8in square cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the mixed dried fruit and cranberries in a bowl. Using kitchen scissors, snip the prunes, dates and figs into small pieces, removing any stalks, and drop into the bowl. Add the brandy and orange zest and juice, and stir well to combine. Cover the bowl with a shower cap, clingfilm or plate and leave to soak in a cool place for at least 12 hours or, even better, 2 days.", "When you’re ready to make the cake, grease and line a 20cm/8in square tin and preheat the oven to 180C/160C Fan/Gas 4.", "Spread the nuts on a baking tray and toast, checking frequently to be sure they don’t burn, for 5–10 minutes or until fragrant (you can skip the toasting, but it really brings out their flavour). Cool, then chop the nuts – I like them relatively chunky to contrast with the fruit. Turn the oven down to 140C/120C Fan/Gas 1.", "Using a hand-held electric whisk (it’s tricky to beat this small quantity in a free-standing mixer), beat together the butter and sugar for 5–10 minutes or until very light and creamy. Beat in the treacle or syrup, if using. Gradually add the beaten eggs to the butter and sugar mixture, beating well after each addition. Sift the flour and spice into the mixture and fold in. Finally, stir through the soaked fruit, with any liquid left in the bowl, and the chopped nuts. ", "Spoon the mixture into your prepared tin and smooth the surface with the back of a spoon dipped in hot water. Bake for 2¼–2½ hours or until the cake is firm to the touch and a skewer pushed into the centre comes out clean. Set the tin on a wire rack. If you want to ‘feed’ the cake, leave it to cool for about 15 minutes, then prick the top all over with a cocktail stick or skewer, going about 3cm deep. Brush over about 1 tablespoon of brandy. Leave to soak in while the cake is cooling. Once the cake is cold, remove from the tin and wrap in fresh baking parchment, if you like, and then in foil before storing in an airtight tin or container for at least 5 days before eating. You can repeat the feeding process weekly for up to 5 weeks.", "When you’re ready to finish the cake, gently heat the apricot jam and spread over the surface of the cake. Roll out the marzipan to about the thickness of a pound coin and cover the whole cake. Roll out the fondant icing to the same thickness and cover the cake completely, pressing down to smooth it out. ", "Once covered in marzipan and fondant. Decorate your cakes with your chosen ribbons and trimmings, tucking the ends of the ribbons under the cake – the weight of the cake will secure them, although pins can be used. Just don’t forget to remove them before eating! If you've made gingerbread gift tags tie them to the ribbons on the cake, using either actual ribbons or strawberry laces if using. Holly and mini baubles can be added alongside or in place of the tags, depending on the size and style of the present."]}, {"isVegetarian": true, "title": "Christmas pudding cake", "url": "www_bbc_co_uk_food_recipes_christmas_cake_pudding_88064", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_cake_pudding_88064_16x9.jpg", "ingredients": ["150g/5½oz mixed dried fruit, such as sultanas, raisins and currants", "150g/5½oz dried cranberries", "150g/5½oz pitted soft prunes", "150g/5½oz pitted soft-dried dates", "150g/5½oz dried figs", "150ml/5fl oz brandy, plus optional extra to ‘feed’ the cake", "finely grated zest and juice of ½ orange", "150g/5½oz mixed whole nuts", "150g/5½oz butter, softened", "150g/5½oz dark muscovado sugar", "3 tbsp black treacle or date syrup, optional", "3 free-range eggs (at room temperature), beaten", "150g/5½oz self-raising flour", "3 tbsp ground mixed spice", "4 tbsp apricot jam", "750g/1lb 10oz ready to roll fondant", "1kg/2lb 4oz marzipan ", "4 tbsp mincemeat", "small sprig holly leaves", "glace cherries or cranberries"], "serves": "Makes 20cm/8in cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the mixed dried fruit and cranberries in a bowl. Using kitchen scissors, snip the prunes, dates and figs into small pieces, removing any stalks, and drop into the bowl. Add the brandy and orange zest and juice, and stir well to combine. Cover the bowl with a shower cap, clingfilm or plate and leave to soak in a cool place for at least 12 hours or, even better, 2 days.", "When you’re ready to make the cake, grease and line a 20cm/8in round loose-bottomed tin and preheat the oven to 180C/160C Fan/Gas 4.", "Spread the nuts on a baking tray and toast, checking frequently to be sure they don’t burn, for 5–10 minutes or until fragrant (you can skip the toasting, but it really brings out their flavour). Cool, then chop the nuts – I like them relatively chunky to contrast with the fruit. Turn the oven down to 140C/120C Fan/Gas 1.", "Using a hand-held electric whisk (it’s tricky to beat this small quantity in a free-standing mixer), beat together the butter and sugar for 5–10 minutes or until very light and creamy. Beat in the treacle or syrup, if using. Gradually add the eggs to the butter and sugar mixture, beating well after each addition. Sift the flour and spice into the mixture and fold in. Finally, stir through the soaked fruit, with any liquid left in the bowl, and the chopped nuts. ", "Spoon the mixture into your prepared tin and smooth the surface with the back of a spoon dipped in hot water. Bake for 2¼–2½ hours or until the cake is firm to the touch and a skewer pushed into the centre comes out clean. Set the tin on a wire rack. If you want to ‘feed’ the cake, leave it to cool for about 15 minutes, then prick the top all over with a cocktail stick or skewer, going about 3cm deep. Brush over about 1 tablespoon of brandy. Leave to soak in while the cake is cooling. Once the cake is cold, remove from the tin and wrap in fresh baking parchment, if you like, and then in foil before storing in an airtight tin or container for at least 5 days before eating. You can repeat the feeding process weekly for up to 5 weeks.", "When you’re ready to finish the cake, gently heat the apricot jam and spread over the surface of the cake. Roll out the marzipan to about the thickness of a pound coin and cover the whole cake. Roll out the fondant icing to the same thickness and cover the cake completely, pressing down to smooth it out. ", "Place a round template, plate or round cake tin smaller than the diameter of your cake on the top and cut around it with a knife or scalpel. Carefully remove the circle of fondant and marzipan to reveal your naked cake inner circle. ", "Using the template you used before to help yout, cut out a simple custard shape from the marzipan circle. Press this into the top of your cut out circle to create the custard effect. Next carefully spoon some mincemeat into the remainder of the cut out shape to produce a plump looking pudding, or leave out entirely if you want. Finally place and position your holly, cherries or cranberries into the top of the pudding shape to finish."]}, {"isVegetarian": true, "title": "Christmas carrots", "url": "www_bbc_co_uk_food_recipes_christmas_carrots_90489", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_carrots_90489_16x9.jpg", "ingredients": ["9 medium carrots, peeled, topped and tailed", "250g/9oz butter", "150g/5½oz sugar", "3 tsp salt", "4 star anise"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Use a clean scourer to smooth the carrots and remove any peel marks (optional).", "In a pan combine 400ml/14fl oz of water, the butter, sugar, salt and star anise. Bring to the boil, then reduce the heat to a gentle simmer and add the carrots. Cook until the carrots are tender (approximately 45 minutes) and the volume of liquid has reduced by half.", "Serve the carrots as a side dish with the reduced cooking liquid poured over."]}, {"isVegetarian": true, "title": "Christmas croquembouche", "url": "www_bbc_co_uk_food_recipes_christmas_croquembouche_13159", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["235g/8⅓oz butter", "330ml/11½fl oz whole milk", "1½ tbsp caster sugar", "275g/10oz plain flour", "8 free-range eggs", "salt", "1 litre/1¾ pints double cream", "100g/3½oz icing sugar", "1½–2 tbsp coffee extract", "1 tsp ground cardamom", "500g/1lb 2oz caster sugar", "white sugar nibs"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Place the butter, milk and sugar in a saucepan, pour over 330ml/11½fl oz water and add a pinch of salt. Slowly bring to the boil, then lower the heat and simmer until the butter has melted. Sift and stir in the flour until the mixture comes away from the sides and forms a ball. Beat for 30 seconds, then set aside to cool.", "Beat the eggs into the mixture one at a time using an electric or manual whisk, until glossy.", "Using a piping bag with a 1–1½cm/½–⅝in nozzle, pipe 3cm/1¼in diameter rounds on three  to four baking trays (or cook in batches). Bake for 10 minutes, then turn down the heat to 180C/160C Fan/Gas 4 and cook for 20–25 minutes. Make a small slit in the side of each bun, then bake for another 5 minutes.", "At this point you can continue with the recipe, store in an airtight container or freeze until ready to use (if doing the latter, reheat the buns in the oven for a few minutes before cooling and filling).", "To make the spiced cream, whip the cream until quite stiff. Sift and stir in the icing sugar with the coffee extract and cardamom. Cover with cling film and refrigerate for 30 minutes. Using a piping bag, pipe the cream into the slit in each bun. Wipe away any excess and refrigerate the buns until ready to assemble.", "To make the caramel, place the sugar in a heavy-bottomed saucepan over a medium heat. Heat until 154C when all the sugar will have dissolved and caramelised. (Move the saucepan around if it looks like one edge is darkening before the other and use a brush dipped in water to wipe away any crystals that form on the sides.) ", "Dip the top of the buns into the caramel, then sprinkle with sugar nibs. Repeat with as many of the buns as you want decorated.", "To assemble, dip either side of the buns in the caramel. One side will stick to the bottom, one side will glue to the top (the sugar nibs will face outwards). Continue assembling the buns until you reach the top of the cone. If the caramel becomes too sticky to work with, place over a low heat to warm. ", "Leave to set completely, then remove the cone. Indoor sparklers will add extra flare."]}, {"isVegetarian": false, "title": "Last-minute Christmas cake", "url": "www_bbc_co_uk_food_recipes_christmas_eve_cake_64830", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_eve_cake_64830_16x9.jpg", "ingredients": ["550/1lb 4oz mixed dried fruit", "100g/3½oz dried cherries, halved ", "100g/3½oz dried figs, chopped ", "100ml/3½fl oz sweet sherry", "240ml/8½fl oz almond oil ", "120ml/3¾fl oz treacle", "120ml/3¾fl oz golden syrup", "200g/7oz soft dark brown sugar", "1½ tsp bicarbonate of soda", "160ml/5½fl oz boiling water", "350g/12oz plain flour", "50g/1¾oz cocoa powder", "3 tsp mixed spice", "pinch of table salt", "6 free-range eggs", "435g tin crushed pineapple in juice, drained", "85g/3oz almond butter", "200g/7oz unsalted butter", "400g/14oz golden icing sugar", "1 tsp almond extract", "splash milk", "250g/9oz mini white marshmallows", "65g/2¼oz blue or purple candy melts, chopped", "navy blue gel food colouring ", "500g/1lb 2oz icing sugar, plus extra for dusting", "25g/1oz vegetable shortening, plus extra for kneading ", "125g/4½oz royal icing sugar", "yellow or orange food colouring pastes ", "3 tbsp agave syrup mixed with 1 tbsp boiling water ", "200g/7oz ready-to-roll black fondant icing", "silver edible glitter (optional) ", "white sprinkles (optional)"], "serves": "Makes 1 x 25cm/10in cake", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the dried fruit and sherry in a bowl and leave to soak for at least 30 minutes, but preferably for a few hours.", "Preheat the oven to 170C/150C Fan/Gas 3½. Grease and line a 25cm/10in cake tin with baking paper. ", "Put the oil, treacle, syrup and sugar in a large mixing bowl and whisk until they just come together (the oil will still remain quite separate). ", "Mix the bicarbonate of soda with the boiling water and stir until it fizzes and dissolves. Pour into the oil mixture and whisk together.", "Add the flour, cocoa powder, mixed spice and salt and whisk until smooth. Add the eggs and whisk until smooth and shiny. Tip in the pineapple, dried fruit and any sherry that hasn’t been absorbed. Mix until well combined and then pour into the prepared tin.", "Bake for 2 hours, then insert a skewer into the centre, if it comes out almost clean the cake is cooked, if not bake for 10–15 minutes and test again. ", "Meanwhile, for the buttercream, beat the butters together until smooth and fluffy. Add the icing sugar, almond extract and a little milk and beat again, cover with cling film and set aside. ", "For the fondant, put the marshmallows and 2½ tablespoons water in a microwave-safe bowl and heat on full power for 40 seconds, remove and stir. Repeat this process, removing and stirring again at 30 second intervals until the marshmallows have melted. Set aside a few tablespoons of the melted marshmallows and add the candy melts to the remainder. Stir until melted, then add the navy gel food colouring. ", "Sift 450g/1lb of the icing sugar into a large mixing bowl and add the blue marshmallow mixture. Using an electric hand whisk beat until it comes together, starting on a slow speed to avoid a dust cloud. Grease your hands with the vegetable shortening and knead the remainder into the icing for 5 minutes, or until smooth (the icing will be very sticky to start with). Add more food colouring, if required, and knead again until smooth. Wrap in cling film and leave to rest. ", "In a smaller bowl repeat the process with the reserved marshmallows beating in the remaining 50g/1¾oz icing sugar (this will make the white circle that sits on top of the cake).", "When the cake is cooked, turn it out of the tin and leave to cool on a wire rack. When the cake is completely cold, trim the top to remove the dome, if necessary. Divide the cake in two horizontally and then place on a cake board with the bottom of the cake upwards (so you have a really neat, flat top).  ", "Spread an even layer of buttercream on the bottom cake, sandwich and cover the outside of the cake in a generous layer of buttercream using a small palette knife. Take care to get an even, smooth finish as this will make a big difference as to how smooth the finished icing is. Place the cake in the fridge until the icing has set and is firm. ", "Knead the blue fondant until smooth and pliable (microwave for 10 second intervals, if necessary) and knead in a little more vegetable shortening if required. Dust a worktop liberally with icing sugar and roll out the icing into a circle large enough to cover the cake. ", "Brush the cake all over with the agave syrup and use a rolling pin to lift the icing onto the cake. Carefully push down the icing to cover the sides of the cake including the board. Use a cake smoother to smooth and finish, then trim off any excess icing. Brush the top with edible glitter, if using. Wet the reverse of the white circle and stick to the top of the cake.", "Roll the black fondant into a sausage shape using your hands. Lightly dust the work surface with icing sugar and roll out into a long, thin rectangle about 80cm/31in long. Using a small sharp knife cut a straight edge along one length and cut the other into a silhouette of rooftops – making sure it is no deeper than the height of the cake. Keep any offcuts to use to make Santa and his reindeer later. Brush the sides of the cake with the diluted agave syrup and stick the black fondant rooftops to it (to make this easier, cut the strip into smaller pieces that are easier to handle).", "Reroll the offcuts and carefully cut out a silhouette of Santa and his reindeer (make this easier by printing a suitably-sized image from the internet, placing it over the fondant and using a pin to mark the out the edges). ", "Roll out the white fondant and use a large biscuit cutter to cut into a neat circle. This will make the moon on the top of the cake. Wet the back of the black fondant Santa and place on top of the cake going across the fondant moon.", "For the royal icing, beat the icing sugar and a tablespoon of water together until thick and smooth, adding extra water if necessary. Put a third in a separate bowl and mix in a little yellow food colour (this will be used to form the windows). Put the white icing in a piping bag fitted with a small plain nozzle.", "Use a stencil to paint windows onto the black fondant rooftops. Using the yellow royal icing and a small flexible knife, hold the stencil in place and run the icing over it. Clean the back of the stencil in between windows. If it gets a bit messy, allow the icing to dry and then scrape off any excess using a round tipped knife.", "Pipe white royal icing onto the rooftops to look like snow. If desired, decorate the sky with small white dots to look like falling snow (alternatively use white sprinkles). Transfer to a cake stand or serving plate."]}, {"isVegetarian": true, "title": "Christmas frangipane tart", "url": "www_bbc_co_uk_food_recipes_christmas_frangipane_23040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz Cabernet Sauvignon red wine", "1 whole cinnamon stick", "1g ground nutmeg ", "1 clove", "2g ground allspice", "100g/3½oz caster sugar", "1 orange, peeled and halved", "3 ripe pears (Bosc or Conference pears), peeled, cored and halved", "250g/9oz plain flour", "50g/1¾oz icing sugar", "100g/3½oz unsalted butter, diced", "1 large free-range egg yolk", "1 tbsp ice-cold water", "175g/6oz unsalted butter, softened ", "175g/6oz caster sugar ", "3 large free-range eggs", "175g/6oz ground almonds", "1 tsp almond extract", "25g/1oz ground almonds ", "50g/1¾oz blanched sliced almonds", "2 tbsp apricot jam, sieved", "100g/3½oz icing sugar", "2 tsp lemon juice"], "serves": "Makes 1 x 25cm/10in tart", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pears, add the red wine, spices, caster sugar and orange to a saucepan and warm gently. Place the pears in the saucepan and bring to the boil, reduce to a simmer and cook for 15 minutes, or until the pears are tender.", "Remove the pears and pat dry using kitchen paper. To decorate the pears (optional), place the halves cut-side down and use a sharp knife to make 5-6 cuts widthways, about 1cm/½in deep and 5mm wide. Leave to cool.", "For the sweet pastry, add the flour, icing sugar and butter to a blender. Blend until the mixture resembles breadcrumbs. Add the egg yolk and pulse briefly. Pour in just enough ice cold water to bring the mixture together as a ball in the blender. Remove and place onto a lightly floured surface. Knead just enough to form a ball, wrap in cling film and place in the fridge for 15-20 minutes.", "Remove the dough from the fridge and set aside a small piece of the dough. On a lightly floured work surface, roll out the remaining dough to a circle and line a 23cm/9in flan tin. Use the reserved dough to push the dough into the fluted sides. Prick the base with a fork and leave in the fridge for 15 minutes.", "For the frangipane, beat the butter and sugar using a an electric mixer until light and fluffy. Beat in the eggs one at a time then beat in the ground almonds and essence.", "Preheat the oven to 220C/200C Fan/Gas 7. Line the pastry case with baking parchment and fill with baking beans or uncooked rice. Bake for 10 minutes, then remove the baking beans and baking paper and return to the oven for a further 5 minutes, or until the pastry is dry. ", "Reduce the oven temperature to 180C/160C Fan/Gas 4.", "For the topping, sprinkle a handful of ground almonds on the base of the pastry case. Spoon the frangipane into the pastry case. Add the pears, cut-side down in a star pattern. Press them gently into the frangipane and sprinkle the sliced almonds between the pears.", "Bake for 45 minutes, or until the crust is golden-brown and the frangipane firm to the touch. Remove from the oven and brush all over with the apricot jam.", "For the icing, mix the icing sugar with the lemon juice until you have a smooth paste that drizzles from a spoon. Add a little water if the icing is too thick.", "Cool on a wire rack for 5-10 minutes before removing the tart casing. When cool, drizzle the icing all over and serve warm or cold."]}, {"isVegetarian": true, "title": "Christmas gingerbread men", "url": "www_bbc_co_uk_food_recipes_christmas_gingerbread_84244", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_gingerbread_84244_16x9.jpg", "ingredients": ["350g/12oz plain flour, plus extra for rolling out", "1 tsp bicarbonate of soda", "2 tsp ground ginger", "1 tsp ground cinnamon", "125g/4½oz butter", "175g/6oz light soft brown sugar", "1 free-range egg", "4 tbsp golden syrup", "writing icing", "cake decorations"], "serves": "Makes 20", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Sift together the flour, bicarbonate of soda, ginger and cinnamon and pour into the bowl of a food processor. Add the butter and blend until the mix looks like breadcrumbs. Stir in the sugar.", "Lightly beat the egg and golden syrup together, add to the food processor and pulse until the mixture clumps together. Tip the dough out, knead briefly until smooth, wrap in clingfim and leave to chill in the fridge for 15 minutes.", "Preheat the oven to 180C/350F/Gas 4. Line two baking trays with greaseproof paper.", "Roll the dough out to a 0.5cm/¼in thickness on a lightly floured surface. Using cutters, cut out the gingerbread men shapes and place on the baking tray, leaving a gap between them. For decorations, use a skewer to make a small hole in the top of each biscuit.", "Bake for 12-15 minutes, or until lightly golden-brown. Leave on the tray for 10 minutes and then move to a wire rack to finish cooling. When cooled decorate with the writing icing and cake decorations."]}, {"isVegetarian": false, "title": "Christmas Martini", "url": "www_bbc_co_uk_food_recipes_christmas_martini_77981", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_martini_77981_16x9.jpg", "ingredients": ["ice cubes", "50ml/2fl oz vodka", "25ml/1fl oz Chambord ", "25ml/1fl oz cocoa liqueur (such as Creme de cacao blanc)", "1 sprig rosemary"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Tumble ice cubes generously into a cocktail shaker. Add the vodka, Chambord and cocoa liqueur and shake well. Pour into a martini glass (leaving the ice behind in the shaker) and add a sprig of rosemary. Drink, full of Christmas cheer."]}, {"isVegetarian": true, "title": "Raspberry and white chocolate mini meringues", "url": "www_bbc_co_uk_food_recipes_christmas_mini_meringues_81206", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_mini_meringues_81206_16x9.jpg", "ingredients": ["3 medium free-range egg whites", "110g/4oz caster sugar", "50g/1¾oz icing sugar", "1 tsp rosewater", "couple of drops of red or pink food colouring ", "2 tbsp double cream", "50g/1¾oz white chocolate, broken into pieces", "25g/1oz raspberries, finely chopped", "40g/1½oz dark chocolate (optional)", "1 tbsp lemon curd (optional)", "150ml/5fl oz whipped cream"], "serves": "Makes 38 meringue kisses", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the meringues, preheat the oven to 120C/100C Fan/Gas ½. Line 2 baking trays with baking paper.", "Whisk the egg whites in a clean glass bowl until soft peaks form.", "Whisk in the sugar a tablespoon at a time until the mixture is thick, smooth and glossy. Sift over the icing sugar then fold in. Fold in the rosewater and food colouring. ", "Place teaspoonfuls of the mixture on to the prepared baking trays to make about 40 small meringues. Bake for 2 hours then remove from the oven and leave to cool.", "To make the raspberry filling, heat the cream in a small saucepan until just boiling. Remove from the heat and stir in the white chocolate. Mix in the raspberries. Leave to cool a little.", "Make the meringues kisses by using a teaspoon of raspberry filling to sandwich together 2 meringues. ", "You can also use chocolate or lemon curd to stick the meringues together. For the chocolate, melt the chocolate in the microwave, or in a glass bowl over a pan of boiling water. Leave it to cool a little, then dip a flat side of a meringue into the chocolate and sandwich 2 meringues together. For lemon curd, stir the lemon curd into the whipped cream and use this to sandwich the meringues together."]}, {"isVegetarian": false, "title": "Christmas morning waffles", "url": "www_bbc_co_uk_food_recipes_christmas_morning_26289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g-150g/4½-5½oz butter", "250g/9oz plain flour", "425ml/15fl oz milk", "3 free-range eggs", "1½ tsp baking powder", "1 tsp salt", "4 tbsp finely chopped fresh chives", "1 tbsp white wine vinegar", "4 duck eggs", "150g/5½oz baby spinach leaves", "200g/7oz crème fraîche", "150g/5½oz sliced smoked salmon, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a waffle maker to a medium setting and preheat the oven to 140C/120C Fan/Gas 1.", "Melt the butter in a saucepan over a low heat, then set aside to cool slightly.", "In a bowl, whisk together the flour, half of the milk, 3 eggs, baking powder and salt. Whisk in most of the melted butter and the remaining milk until smooth and well combined, then stir in 3 tablespoons of the chives.", "Grease the waffle maker with some of the remaining melted butter. Ladle some of the waffle batter into each well of the waffle maker, close the lid and cook for 4-5 minutes, or until golden-brown and crisp. Remove from the waffle maker and transfer to a baking tray, then keep warm in the oven. Repeat the process with the remaining butter and batter.", "Meanwhile, bring a pan of water to the boil and prepare a bowl of iced water. Add the white wine vinegar to the pan, then swirl the boiling water and crack one duck egg into the vortex. Reduce the heat until the water is just simmering and poach for 2-3 minutes, or until firm on the outside, but runny in the middle. Remove from the pan using a slotted spoon and lower into the iced water. Repeat the process with the remaining eggs. ", "When ready to serve, heat the pan containing the remaining melted butter and add the spinach; cook until wilted. Season with salt and pepper, then set aside to drain on kitchen paper.", "Return the pan of poaching water to the boil, then return the poached eggs to the water for 1 minute to heat through.", "Meanwhile, mix the crème fraîche with the remaining tablespoon of chopped chives, then season with salt and pepper.", "To serve, divide the waffles among 4 plates. Top each with some of the spinach, a few slices of smoked salmon and a duck egg, plus a dollop of the chive crème fraîche."]}, {"isVegetarian": false, "title": "Christmas pan bagnat", "url": "www_bbc_co_uk_food_recipes_christmas_pan_bagnat_43210", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz cranberries, fresh or frozen", "200ml/7fl oz orange juice", "1 pinch ground juniper berries", "100g/3½oz caster sugar", "1 large white crusty loaf, such as pugliese, sourdough or pain de campagne", "2 red onions, finely sliced", "70g/2½oz rocket leaves", "500g/1lb 2oz leftover stuffing, roughly chopped", "750g/1lb 10oz cold leftover cooked meat, such as chicken, turkey, ham or pork", "3 balls mozzarella, drained and thinly sliced", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the cranberries, orange juice and juniper in a saucepan until the mixture is boiling. Stir in the sugar and reduce the heat until the mixture is simmering, stirring well until the sugar has dissolved. Simmer for 5-8 minutes, stirring occasionally, until the cranberries have all burst and the mixture has thickened. Season with salt and black pepper and set aside to cool.", "Meanwhile, cut one-quarter from the top of the loaf - set aside this ‘lid’. Scoop out all the bread from inside the loaf and reserve for making breadcrumbs that can be frozen for use in another recipe. Spread some of the cranberry sauce into the bottom of the hollowed-out loaf.", "Add the red onion, rocket, stuffing, leftover meat and mozzarella slices to the loaf in layers until everything has been used up. Season each layer with a little salt and black pepper. Finish with a layer of cranberry sauce.", "Place the ‘lid’ on top of the loaf. Wrap the loaf tightly in cling film and chill in the fridge for at least 1 hour, but preferably overnight (it will keep for up to 5 days). Unwrap and cut into wedges to serve."]}, {"isVegetarian": true, "title": "Christmas parfait", "url": "www_bbc_co_uk_food_recipes_christmas_parfait_38775", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz raisins", "1 large orange, finely grated zest and juice", "75ml/2½fl oz spiced rum", "1 tsp ground allspice", "½ tsp freshly grated nutmeg", "1 tsp ground cinnamon", "¼ tsp ground cloves", "125g/4½oz dark brown soft sugar", "4 free-range eggs, separated", "600ml/21fl oz double cream"], "serves": "Serves 4–6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Line a large loaf tin with cling film. ", "Place the raisins, orange juice and zest, rum and spices in a saucepan over a high heat. Bring to the boil, then turn down the heat and simmer until the raisins are plump and most of the liquid has been absorbed. Set aside to cool.", "Meanwhile, beat the sugar and egg yolks together in a large bowl until fluffy and firm. ", "In a separate bowl, whisk the cream to soft peaks and stir into the egg and sugar mixture with the raisins and any remaining poaching liquid.", "In a clean bowl, whisk the egg whites to soft peaks. Fold into the cream and raisin mixture gently, one spoon at a time.", "Pour into the loaf tin, smooth with the back of a spoon and wrap in cling film. Freeze for 45 minutes, then whisk to evenly distribute the raisins. Freeze for several hours, until firm. Cut into slices and serve."]}, {"isVegetarian": true, "title": "Christmas pavlova", "url": "www_bbc_co_uk_food_recipes_christmas_pavlova_20589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pavlova_20589_16x9.jpg", "ingredients": ["6 large free-range egg whites", "350g/12oz caster sugar", "1 tsp white wine vinegar", "1 tsp cornflour", "600ml/20fl oz double cream", "1 tsp vanilla bean paste", "50g/1¾oz icing sugar, sifted", "200g/7oz strawberries, hulled and quartered", "300g/10½oz raspberries", "200g/7oz blueberries", "50g/1¾oz pomegranate seeds", "a few mint leaves, to decorate (optional)", "icing sugar, for dusting"], "serves": "Serves 12-15", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Line a large baking tray with baking parchment and draw a 30cm/12in circle in the middle of the paper.  Draw a 15cm/6in circle in the centre of the larger circle to make a ring. ", "Put the egg whites in a clean mixing bowl and whisk with an electric whisk until soft peaks form when the whisk is removed. Gradually add the sugar a little at a time, whisking on maximum speed until they are stiff and glossy. Mix the vinegar and cornflour in a cup until smooth, then stir into the egg whites.", "Spoon the meringue onto the ring drawn on the baking parchment. Using a large spoon make a shallow trench in the meringue for the cream and fruit to sit in.", "Transfer to the oven and immediately reduce the temperature to 140C/120C Fan/Gas 1. Bake for 1 hour–1 hour 15 minutes, until the outside is hard but still white. Turn the oven off and leave the pavlova inside for an hour or overnight to cool and dry.", "To assemble, whip the cream, vanilla paste and icing sugar until stiff peaks form when the whisk is removed. Spoon the cream into the trench in the meringue. Arrange the strawberries, raspberries, blueberries and pomegranate on top and decorate with a few mint leaves, if using. To serve, dust with icing sugar and cut into wedges. "]}]