[{"isVegetarian": false, "title": "Chicken Thai red curry", "url": "www_bbc_co_uk_food_recipes_chickenandbambooshoo_90183", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandbambooshoo_90183_16x9.jpg", "ingredients": ["30-55g/1-2oz dried tamarind pulp, from a block", "hot water, to cover", "10-12 dried, hot red chillies (of the long, cayenne variety)", "140g/5oz shallots, chopped", "5 garlic cloves, peeled and chopped", "3 thin slices peeled fresh galangal, or fresh ginger", "1 tbsp fresh lemongrass that has been thinly sliced, crossways", "6-8 fresh coriander roots, washed well and coarsely chopped (use coriander leaves if unavailable)", "1 thin slice of fresh kaffir lime rind, about 4cm x 0.5cm/1½in x ¼in, or dried rind, soaked in water for 30 minutes (substitute ordinary lime rind, without the white pith, if unavailable)", "½ tsp freshly ground white pepper", "¼ tsp shrimp paste, or 2 anchovies from a can, chopped", "½ tsp ground cumin", "½ tsp ground coriander", "2 tbsp bright red paprika", "450g/1lb boned and skinned chicken breasts", "2 tbsp vegetable or groundnut oil", "400ml/14fl oz can of coconut milk, left undisturbed for three hours or more", "5 tbsp red curry paste", "140g/5oz sliced bamboo shoots from a can, drained and rinsed", "4 fresh kaffir lime leaves or 1 tsp lemon zest", "2 tbsp fish sauce, or to taste", "1 tsp thick tamarind paste or lemon juice", "1 tsp palm sugar or brown sugar", "15-20 fresh Thai (holy) basil leaves or ordinary basil leaves"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["If using tamarind paste, a couple of hours before you want to make the curry (or preferably the night before), place the tamarind pulp into a small bowl. Add hot or boiling water to cover (if the pulp is very dry, use boiling water). Soak the tamarind until it's very soft and pliable, for a few hours or preferably overnight.", "To obtain the pulp, remove the tamarind seeds and any tough fibres with your fingers. Discard. Place the pulp into a sieve set over a bowl and press the pulp through the sieve.", "For the curry paste, soak the chillies in five tablespoons of hot water for 1-2 hours. (You could also put them in a microwave oven for 2-3 minutes and then let them soak for about an hour.)", "Put the soaked chillies, together with their soaking liquid, into the bowl of a food processor, along with all the remaining paste ingredients in the order listed. Blend until you have a smooth paste. You may need to add a bit more water. This recipe will make about ten tablespoons of paste, so freeze or refrigerate what you don't use.", "For the curry, cut the chicken breasts crossways into 3mm/1/8in thick slices.", "Heat the oil in a wide, preferably non-stick, pan set over a medium-high heat.", "Carefully open the can of coconut milk without disturbing it too much. Remove four tablespoons of the thick coconut cream that will have settled at the top and place in a small bowl. Stir the remaining contents of the can well and set aside.", "When the pan is hot, add the coconut cream and stir. Add the curry paste and stir again. Stir fry for 3-4 minutes or until the oil separates and the paste is lightly browned.", "Reduce the heat to low and add the chicken, bamboo shoots, reserved coconut milk, lime leaves (or lemon zest), fish sauce, tamarind paste (or lemon juice) and the palm sugar (or brown sugar).", "Stir together well and bring to a simmer. The chicken should turn white and cook through by the time the first bubbles begin to appear. Simmer on a low heat for a further minute or two.", "Just before serving, sprinkle the basil leaves over the curry, stir gently and remove from the heat. Serve with jasmine rice."]}, {"isVegetarian": false, "title": "Chicken and butter bean casserole with basmati rice", "url": "www_bbc_co_uk_food_recipes_chickenandbutterbean_84102", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandbutterbean_84102_16x9.jpg", "ingredients": ["drizzle of olive oil", "4 red onions, finely chopped", "1 garlic clove, crushed", "2 celery sticks, finely sliced", "1 red pepper, seeded, finely sliced ", "2 leeks, finely sliced", "6 portabellini mushrooms (or any large flat mushrooms)", "1.75 litres/3 pints chicken stock", "2 tbsp soy sauce", "1 x tin 400g/14oz canned chopped tomatoes", "2 carrots, finely chopped", "1 x tin 400g/14oz butter beans, rinsed and drained", "10 chicken thighs, on the bone, skin removed", "water", "285g/10oz basmati rice"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large heavy-bottomed saucepan. Add the onions and garlic and fry gently until softened. Add the celery, red pepper, leeks and mushrooms, gently stirring together. ", "Add the stock, soy sauce and tomatoes and bring to the boil then turn down to a gentle simmer. Add the carrots, butter beans and the whole chicken thighs and leave all to simmer gently for approximately one hour.", "To make the rice, bring to the boil a pan of water seasoned with a pinch of salt. Add the rice and cook according to packet instructions.", "Take out one of the chicken thighs and gently break it open. Check that the meat is all thoroughly cooked (the meat will be white, not still pink). When cooked, remove the chicken thighs from saucepan and remove the bone. The chicken should literally fall off the bone. If desired, cut into bite-sized pieces and return to the pan.", "Drain the rice and place into bowls. To serve, generously ladle casserole onto bowls of rice."]}, {"isVegetarian": false, "title": "Chicken and cashew nut stir-fry", "url": "www_bbc_co_uk_food_recipes_chickenandcashewnuts_89299", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandcashewnuts_89299_16x9.jpg", "ingredients": ["1 free-range egg", "1 tbsp cornflour", "pinch sea salt", "500g/1lb 2oz skinless chicken breast fillets, sliced", "300ml/10fl oz groundnut oil", "1 onion, sliced", "1 yellow pepper, de-seeded, sliced into strips", "1 red pepper, de-seeded, sliced into strips", "3 tbsp chicken stock", "2-3 tbsp light soy sauce", "2 large spring onions, sliced", "4 tbsp roasted cashew nuts", "sea salt and ground white pepper", "steamed jasmine rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, place the egg into a bowl, add the cornflour and a pinch of salt and whisk well to combine. Add the chicken to the mixture and coat well in the egg.", "Heat a wok until smoking and add the groundnut oil. Fry the chicken for 4-5 minutes, or until golden-brown and crisp, then remove with a slotted spoon and drain on absorbent kitchen paper.", "For the stir fry, pour off all the oil from the wok, except for one tablespoon. Reheat the oil over a high heat, add the onion and stir fry for a few seconds. Add the yellow and red pepper slices and stir fry for one minute, or until softened. Add the chicken pieces and stir fry for 1-2 minutes, then add the stock and soy sauce. Simmer for another minute, or until the chicken is cooked through.", "Stir in the spring onions and cashew nuts, season, to taste, with sea salt and ground white pepper and transfer to a serving dish. Serve immediately with steamed rice."]}, {"isVegetarian": false, "title": "Chicken quesadillas and sweetcorn salsa", "url": "www_bbc_co_uk_food_recipes_chickenandcheeseques_85536", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandcheeseques_85536_16x9.jpg", "ingredients": ["8 ready-made flour tortillas", "250g/9oz mature cheddar, grated", "300g/11oz cooked chicken, thickly sliced", "½ red onion, finely sliced", "60g/2½oz jalapeno chillies, roughly chopped", "1 small bunch coriander leaves and roots", "4 tbsp sour cream", "2 tbsp olive oil", "150g/5oz sweetcorn", "20g/¾oz jalapeno chillies, roughly chopped", "1 green chilli, finely chopped", "1 lime, juice only", "2 tbsp fresh mint leaves, roughly chopped", "2 tbsp fresh coriander leaves, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For quesadilla, place four of the tortillas onto a board and cover each with the grated cheese.", "Divide the chicken, red onion, jalapeno chillies and coriander equally over the cheese-covered tortillas.", "Spread the sour cream onto one side of each of the remaining four tortillas and place sour cream-side down onto the filled tortillas.", "Heat a frying pan and add the oil. Carefully place a quesadilla into the frying pan and cook over a medium heat for 3-4 minutes, until crisp and golden and the cheese filling is melting. Carefully turn the quesadilla over and cook on the other side for a further two minutes, or until crisp and golden. Remove from the pan and set aside to keep warm. Repeat with the remaining quesadillas.", "Cut the quesadillas into quarters and serve fresh and hot.", "For the salsa, place all of the salsa ingredients into a food processor and pulse to combine. Season, to taste, with salt and freshly ground black pepper.", "To serve, arrange the quesadillas serving plate and place a bowl of salsa into the middle."]}, {"isVegetarian": false, "title": "Chicken and chickpea stew with roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_chickenandchickpeast_92405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "1  chicken breast, skin removed, chopped", "2 tbsp tomato purée", "150ml/5fl oz chicken stock", "6 cherry tomatoes, cut in half", "85g/3oz tinned chickpeas, drained", "2 tbsp garlic-and-herb cream cheese, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan over a medium heat. Fry the onion and garlic for 4-5 minutes, or until softened, stirring occasionally.", "Add the chopped chicken to the pan and fry for 4-5 minutes, or until golden-brown, stirring occasionally. Add the tomato purée and chicken stock and heat until simmering. ", "Stir in the tomatoes and chickpeas and continue to simmer for 2-3 minutes.", "To serve, spoon the chicken and sauce onto a plate and crumble over the garlic-and-herb cream cheese."]}, {"isVegetarian": false, "title": "Chicken and chorizo with paprika and red wine", "url": "www_bbc_co_uk_food_recipes_chickenandchorizoste_88444", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandchorizoste_88444_16x9.jpg", "ingredients": ["2 tsp smoked paprika", "1 tsp chilli powder", "1 chicken thigh, bone removed", "2 tbsp olive oil", "½ onion, finely sliced", "2 garlic cloves, finely chopped", "1 small chorizo sausage, chopped", "100ml/3½fl oz red wine", "50g/1¾oz broad beans, skins removed (frozen is fine, but defrost first)", "1 tbsp chopped fresh chives", "chopped fresh parsley, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "In a bowl, combine the smoked paprika, chilli powder, salt and pepper. Open out the chicken thigh so that it's flat and roll in the spice mixture to coat. Heat 1 tablespoon of the olive oil in an ovenproof frying pan and fry the chicken until golden-brown on all sides. Transfer to the oven and roast for 10-12 minutes, or until cooked through.", "Meanwhile, heat the remaining tablespoon of oil in a pan and fry the onion and garlic until softened. Add the chorizo and fry gently until the chorizo starts to crisp slightly, this should take about 5-7 minutes. Add the red wine and simmer for 5 minutes, or until slightly reduced. Add the broad beans and stir.", "Remove the chicken from the oven and cut into strips. Add the chicken and chives to the pan and stir to combine.", "Put the chicken mixture in a shallow dish, garnish with fresh parsley and serve. "]}, {"isVegetarian": false, "title": "Chicken and coconut salad", "url": "www_bbc_co_uk_food_recipes_chickenandcoconutsal_74613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz palm sugar (substitute golden caster sugar if unavailable)", "50ml/2fl oz fish sauce", "1 can coconut milk", "6 chicken thighs, bones removed", "2 small shallots, small Thai ones if possible", "½ small red pepper ", "2 long red chillies ", "½ cucumber, peeled", "100g/3½oz roasted peanuts", "handful of coriander leaves", "lime leaves (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a heavy-based frying pan, bring to the boil the palm sugar, fish sauce and coconut milk. Once it's boiling, drop in the chicken thighs and make sure all pieces are covered by the liquid. Simmer for a good 10 minutes, turning once or twice. Once cooked, leave to cool in the liquid.", "Peel and slice the shallots very finely, remove the seeds from the pepper and the chillies and cut into long thin strips.", "Cut the cucumber down the centre lengthwise and remove the seeds. Using a potato peeler, peel long strips of the cucumber until all used up. ", "Chop the roasted peanuts and mix them with the coriander. Mix the pepper, shallots, chillies and cucumber in a bowl and leave to sit.", "When cool, take the chicken from the liquid and, using a sharp knife, remove any skin and discard. Cut the chicken into thin strips about the same size as the pepper and chillies. Add the chicken to the vegetable mix, then add the coconut milk mixture. ", "Toss well together and place in a large bowl. Sprinkle with the chopped nuts and the coriander to serve."]}, {"isVegetarian": false, "title": "Chicken and courgette skewers", "url": "www_bbc_co_uk_food_recipes_chickenandcourgettes_88468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 chicken mini-fillets", "½ courgette", "2 tbsp olive oil", "1 tbsp soy sauce", "1 lime, cut into wedges", "½ orange, cut into wedges", "small handful mixed red and yellow cherry tomatoes, halved", "sprig fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Cut each chicken mini-fillet in half and cut the courgette half into six pieces. Thread the chicken and courgette pieces alternately onto two skewers.", "Heat the oil in an ovenproof frying pan and fry the chicken and courgette skewers for 4-5 minutes, turning frequently, until they begin to turn golden-brown.", "Sprinkle over the soy sauce and transfer to the oven to cook for five minutes, or until the chicken is completely cooked through.", "Serve with a garnish of orange and lime wedges, halved cherry tomatoes and a sprig of fresh parsley."]}, {"isVegetarian": false, "title": "Chicken and herb salad with onion mayonnaise", "url": "www_bbc_co_uk_food_recipes_chickenandherbsaladw_84198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ready-cooked chicken breast, roughly chopped", "handful fresh sage", "handful fresh coriander", "handful fresh parsley", "handful fresh mint", "handful fresh dill", "handful fresh basil", "3 free-range egg yolks", "2 tbsp caramelised onions from a jar", "½ tsp white wine vinegar", "salt and freshly ground black pepper", "150ml/5fl oz olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, mix together the chicken and herbs in a clean bowl, and set aside. ", "For the onion mayonnaise, place  the egg yolks, onion and white wine vinegar into a food processor and blend until smooth. Season, to taste, with salt and freshly ground black pepper. Once it looks slightly thickened begin to gradually add in the olive oil, blending constantly.", "To serve, mix the onion mayonnaise into the salad."]}, {"isVegetarian": false, "title": "Chicken and leek pie", "url": "www_bbc_co_uk_food_recipes_chickenandleekpie_90191", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandleekpie_90191_16x9.jpg", "ingredients": ["300g/10½oz plain flour, plus extra for flouring", "pinch salt", "30g/1¼oz cold lard, cut into cubes (optional - you can use all butter if you prefer)", "85g/3oz cold butter, cut into cubes", "2-3 tbsp cold water", "1 free-range egg, beaten with a pinch of salt", "30g/1¼oz butter", "30g/1¼oz flour", "600ml/1 pint milk", "3 tbsp double cream", "2 tsp Dijon mustard", "1/3 chicken stock cube, crumbled", "2 large leeks", "30g/1½oz butter", "3 crisp eating apples, cored and cut into large pieces", "70g/2½ oz bacon lardons, or streaky bacon, diced", "10 boneless chicken thighs, diced", "1 bunch tarragon, leaves only (optional)", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, sift the flour and salt into a large mixing bowl.", "Add the lard and butter and, using your fingertips, rub the fat into the flour until the mixture resembles breadcrumbs. Lift the flour into the air as you do so, to get some air into the mixture and keep it cool.", "Add just enough cold water to form a dough and mix together with a palette knife.", "Then, using your hands, bring the dough together in the bowl. Turn it out onto a clean, floured work surface and knead briefly. Shape it into a flattened circle and wrap it in cling film. Chill in the fridge for at least 20 minutes.", "While the pastry is chilling, make the white sauce. Melt the butter in a heavy-bottomed pan. Add the flour and stir with a wooden spoon over a medium heat for a minute or two, being careful not to burn it.", "Add the milk all at once. Take off the heat and whisk the mixture with a balloon whisk. Once all the lumps are whisked in, place the pan back onto a medium heat and whisk continuously until the sauce comes to the boil and thickens.", "Cook for another five minutes, stirring frequently with a wooden spoon. Add the double cream, mustard and the crumbled stock cube. Stir well, then allow to cool.", "For the filling, top and tail the leeks. Slice them into thick rings and wash thoroughly in a bowl of clean water, to remove any grit. Heat a heavy-bottomed pan and place the leeks into the hot pan. Add the butter.", "Add the apples to the pan with the leeks and cook for a few minutes. Add the bacon lardons and the chicken pieces to the pan and cook for a few minutes longer (the chicken will be only about two-thirds cooked at this stage).", "Preheat the oven to 200C/400F/Gas 6. Place the chicken mixture into a pie dish. Sprinkle the tarragon leaves, if using, over the top. Season with freshly ground black pepper. Pour over the cooled white sauce.", "For the pastry top, allow the pastry to get up to room temperature. Lightly flour a clean board and roll out the pastry into a rectangle about one-and-a-half times the size of the pie dish.", "With a knife, trim long, half-inch wide strips from the pastry. Use the trimmings to make an edge around the pie dish by brushing them with a bit of water (to help the pastry adhere) and placing them in a single layer around the outer edge of the pie dish.", "Using your rolling pin, lift the remaining pastry sheet and place it on top of the dish to form a lid. Trim around the edge of the pie dish with a knife to cut off the excess pastry, reserving the trimmings. Use your fingers and thumb to crimp the edges. Make a hole in the centre to allow the air to escape.", "Brush the top of the pastry with the beaten egg and salt wash. Use the reserved pastry trimmings to decorate the top.", "Place the pie on a baking tray and bake in the oven for 25-30 minutes until bubbling hot and golden. Serve while hot."]}, {"isVegetarian": false, "title": "Chicken and mango salad", "url": "www_bbc_co_uk_food_recipes_chickenandmangosalad_80105", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "75g/2¾oz chicken breast, cut into strips", "salt and freshly ground black pepper ", "1 tbsp sesame oil", "1 tbsp soy sauce", "½ lime, juice only", "1 garlic clove, finely diced", "½tsp lemongrass, inner white finely chopped", "¼ onion, finely diced", "½ mango, diced", "1 tbsp chopped mint leaves", "1 tbsp chopped coriander", "50g/1¾oz blanched broccoli"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium to high heat, fry the chicken strips for approximately ten minutes or until the chicken is cooked through, season and drain off juices.", "In a large bowl whisk together the sesame oil, soy sauce, lime juice, garlic, lemongrass and onion.", "Add the mango, chicken, herbs. Season and toss together.", "Serve in a tall pile on a plate with the broccoli."]}, {"isVegetarian": false, "title": "Chicken al marsala", "url": "www_bbc_co_uk_food_recipes_chickenalmarsala_73329", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "2 tbsp olive oil", "5 tbsp of marsala wine", "knob of butter ", "pinch of flour, salt and pepper to taste", "potatoes, boiled and tossed in salt, pepper and extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Flatten the chicken breast with a rolling pin or meat mallet between two sheets of cling film. Fry the chicken in the olive oil for three minutes each side.", "Add the marsala wine and allow to flame. As the sauce flames, remove the chicken from the pan and blow out the flame.", "Coat the knob of butter in flour and add to the pan. Add salt and pepper to taste.", "When the sauce has thickened, serve with the chicken and potatoes."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_chickenallimone_73328", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenallimone_73328_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 chicken breast", "½ lemon, juice only", "5 tbsp white wine", "knob of butter", "pinch of flour", "salt and freshly ground black pepper", "green beans"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan and add the olive oil, fry the chicken for 5 minutes on each side, or until cooked through. ", "Add the lemon juice and salt and pepper. Add the white wine and reduce for 30 seconds. Coat the knob of butter in flour, and drop in the mixture to thicken. ", "Bring a pan of water to the boil and cook the green beans for 3-4 minutes, drain. ", "Put the beans on a plate, top with the chicken, drizzle over the sauce and serve. "]}, {"isVegetarian": false, "title": "Chicken and pineapple salad", "url": "www_bbc_co_uk_food_recipes_chickenandpineapples_83971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices pineapple from a can, chopped", "½ lime, juice only", "1 tbsp olive oil", "¼ red chilli, finely chopped", "½ ready-cooked chicken breast, chopped", "handful of mixed fresh herbs e.g. mint, basil, coriander and parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a bowl, stri well and serve."]}, {"isVegetarian": false, "title": "Chicken and mushroom pie", "url": "www_bbc_co_uk_food_recipes_chickenandmushroompi_89034", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandmushroompi_89034_16x9.jpg", "ingredients": ["2 tbsp olive oil ", "3 chicken breasts, skin and bone removed ", "150g/5½oz button mushrooms, quartered ", "1 small onion, chopped", "1 garlic clove, finely chopped", "50g/2oz butter ", "2 tbsp plain flour, plus extra for dusting ", "300ml/½ pint milk", "200ml/7fl oz chicken stock ", "freshly grated nutmeg, to taste", "freshly ground white pepper", "pinch salt", "small handful fresh parsley, chopped ", "500g/1lb 2oz ready-made short-crust pastry", "1 free-range egg, beaten"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan, add the chicken and fry until the chicken begins to turn white.", "Add the mushrooms and continue to fry until the chicken is golden-brown.", "Remove the chicken and mushrooms from the pan and set aside. Add the onion and garlic to the same pan and fry for 2-3 minutes or until softened. Remove from the heat and set aside with the chicken and mushrooms.", "Melt the butter in a saucepan, stir in the flour and cook for about three minutes, stirring constantly until it has formed a thick smooth paste (this is called a roux).", "Mix the milk and stock together in a jug, then add the nutmeg, white pepper and salt, to taste. Pour the liquid slowly into the flour mixture, whisking all the time until smooth. Simmer over a gentle heat, stirring constantly, for about five minutes or until the sauce has thickened.", "Stir in the chopped parsley and pour the sauce over the chicken and mushroom mixture. Mix well, then spoon into a pie dish and leave until completely cool.", "Roll out the pastry on a lightly floured surface until it is the thickness of a pound coin. Brush the edges of the pie dish with beaten egg, lay the pastry on top, press down the edges and trim. Brush the top of the pie with beaten egg and cut some leaf shapes out of the left-over pastry to decorate the top of the pie. ", "Make two or three slits in the top of the pie to allow steam to escape and then bake in the oven for 20-25 minutes or until golden-brown on top."]}, {"isVegetarian": false, "title": "Potato soup with scallops, chorizo  and spinach", "url": "www_bbc_co_uk_food_recipes_chickenandpotatosoup_93444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz baking potato (preferably Marfona), peeled, cut into 1cm/½in pieces", "750ml/1pint 10fl oz water", "3 tbsp olive oil", "3 banana shallots, peeled, sliced", "3 garlic cloves, peeled, chopped", "750ml/1pint 10fl oz chicken stock ", "110ml/4fl oz milk", "4 fresh thyme sprigs, leaves only", "salt and freshly ground black pepper", "4 small chorizo sausages, skin removed, sliced", "8 scallops, cleaned, roes removed, each scallop cut in half horizontally to form two thinner scallops", "½ lemon, juice only", "200g/7oz baby spinach leaves", "leftover roast chicken skin, sliced, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chopped potatoes into a bowl, cover with the water and set aside to soak.", "Meanwhile, heat one tablespoon of the oil in a frying pan over medium heat and fry the shallots and half of the chopped garlic for 2-3 minutes, or until softened. ", "Add the chopped potato and soaking water to the pan and bring to the boil. Add the chicken stock and return the mixture to the boil. Reduce the heat and simmer for 20-25 minutes, or until the potatoes are tender. ", "Pour in the milk, then transfer the mixture to a food processor and blend until smooth.", "Return the blended soup to the saucepan and stir in the remaining garlic and half of the thyme. Season, to taste, with salt and freshly ground black pepper. Set aside to cool slightly.", "Meanwhile, heat one tablespoon of the remaining oil in a frying pan over medium heat and fry the chorizo slices for 30 seconds-1 minute on each side, or until golden-brown on both sides.", "Season the scallops, to taste, with salt and freshly ground black pepper. Heat the remaining olive oil in a separate large frying pan and fry the scallops for 1-2 minutes on each side, or until golden-brown on both sides and just cooked through. Add the lemon juice, to taste.", "To serve, ladle the soup into each of 4 serving bowls. Carefully float 4 pieces of scallop onto each portion of soupl, top with some chorizo slices and a handful of spinach leaves. Sprinkle over the sliced chicken skin, the remaining thyme leaves and drizzle over any chorizo oil from the frying pan used to cook the chorizo."]}, {"isVegetarian": false, "title": "Chicken and prawn rolls", "url": "www_bbc_co_uk_food_recipes_chickenandprawnrolls_11053", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz chicken breast, cut into 16 slices", "48 prawns, defrost if frozen", "4 large bunches of coriander, washed and chopped roughly", "5 large red chillies, cut into thin julienne strips", "salt and pepper to taste", "8 spring roll wrappers", "oil for deep-frying"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the chicken with salt and pepper. Place a slice of chicken diagonally across the spring roll pastry. ", "Lay 6 prawns on top of the chicken slice. Top with two to three chilli strips and a handful of coriander. ", "Place another slice of chicken over the coriander.", "Fold in ends of pastry and roll up in an envelope shape. Secure with a cocktail stick.", "Deep-fry the chicken and prawn rolls in hot oil until golden brown and cooked through, about 2-3 minutes.  Do not have oil too hot or the rolls will brown before the filling is cooked through.", "Drain on absorbent kitchen towels.", "Remove cocktail stick from each roll. "]}, {"isVegetarian": false, "title": "Chicken and prosciutto skewers with lemon griddled asparagus", "url": "www_bbc_co_uk_food_recipes_chickenandprosciutto_92360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, skin removed", "4 slices prosciutto", "1 tsp olive oil", "8 stalks asparagus", "1 lemon, zest and juice", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak four kebab sticks in cold water for ten minutes. Shake to dry.", "Cut the chicken into four long thin strips. Wrap a slice of prosciutto around each chicken strip. Carefully thread a strip, lenthways in a zigzag, onto each kebab stick. ", "Heat a griddle pan on a medium heat. Pour on the olive oil. Cook the kebabs on the griddle for 8-10 minutes, until the ham is crisp and the chicken is cooked through, turning them over after five minutes. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Keep the chicken in a warm place and keep the griddle on the heat.", "For the asparagus, snap off the tough woody end of the stalks. Rub the rest of the asparagus stalks with olive oil, sprinkle over the lemon zest and season with salt and freshly ground black pepper, to taste. ", "Cook the asparagus on the hot griddle pan, turning every few minutes, until the asparagus is slightly charred and tender. Pour over the lemon juice.", "Place the chicken and prosciutto skewers on a plate with the lemon griddled asparagus alongside and serve."]}, {"isVegetarian": false, "title": "Chicken and spinach balti", "url": "www_bbc_co_uk_food_recipes_chickenandspinachbal_86977", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandspinachbal_86977_16x9.jpg", "ingredients": ["2½ cm/1in piece fresh ginger, peeled", "2 garlic cloves, peeled", "¼ tsp salt", "1 lime, juice only", "½ tsp ground coriander", "½ tsp chilli powder", "½ tsp ground turmeric", "½ tsp ground cumin", "2 chicken breasts, cut into bite-sized pieces", "75ml/2½fl oz plain yoghurt", "1 tbsp sunflower oil", "1 red onion, peeled and finely sliced", "2 tomatoes, seeds removed, flesh finely chopped", "1 tbsp tomato purée", "splash water", "75ml/2½fl oz double cream", "150g/5oz baby spinach leaves", "small handful fresh coriander leaves, chopped", "100g/3½oz basmati rice, rinsed and drained, then cooked according to packet"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinade, finely chop the ginger and garlic. Sprinkle rover the salt and chop a little more, then place into a bowl.", "Add the lime juice, ground coriander, chilli powder, ground turmeric and ground cumin to the bowl and mix well.", "Add the chicken pieces and the yoghurt and stir to coat the chicken. Leave to marinate for at least 10–15 minutes (or for an hour if possible, covered in the fridge).", "For the curry, heat the oil in a frying pan over a low heat and add the onion. Fry for 1–2 minutes, then add the tomatoes and the tomato purée and cook gently for about one minute.", "Add the chicken to the pan along with the marinade and a splash of water.", "Pour in the cream, turn up the heat and simmer for 10–15 minutes, or until the chicken is cooked through. There should be no pink when you cut into it. If pink, cook for longer.", "Add the spinach to the pan and stir until just wilted.", "Sprinkle over the coriander.", "To serve, drain the rice and divide between two plates. Top with the curry."]}, {"isVegetarian": false, "title": "Chicken and sweetcorn stir fry chowder", "url": "www_bbc_co_uk_food_recipes_chickenandsweetcorns_89352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed", "½ skinned chicken breast, cut into strips", "100g/3½oz canned sweetcorn", "55g/2oz mangetout ", "½ orange pepper, cut into strips", "300ml/10fl oz chicken stock", "bread to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan over a medium heat. Add the onion and garlic and fry for 2-3 minutes to soften. ", "Add the chicken pieces and fry for 3-4 minutes until they start to colour, then add the sweetcorn, mangetout and pepper, frying for a further 2-3 minutes. ", "Add the stock, and leave to simmer on a medium heat for 8-10 minutes, until everything is cooked through and the liquid has slightly reduced.  ", "To serve, ladle into a bowl and eat piping hot with bread."]}, {"isVegetarian": false, "title": "Chicken biryani", "url": "www_bbc_co_uk_food_recipes_chickenbiriyani_89035", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenbiriyani_89035_16x9.jpg", "ingredients": ["200g/7¼oz basmati rice", "1 tsp salt", "2 tbsp vegetable oil", "8 shallots, chopped", "2 medium onions, chopped", "4 garlic cloves, finely chopped", "2 tsp fresh root ginger, grated", "6 chicken breast fillets or 2 chicken breasts, thinly sliced into strips (chicken breast fillets are the small, tender fillets on the underside of the chicken breast, available in some supermarkets)", "1 tsp chilli powder", "1 tsp ground cumin", "2 tsp ground coriander", "½ tsp ground cinnamon", "½ tsp ground turmeric", "generous pinch freshly grated nutmeg", "¾ cup plain yoghurt", "2 tsp caster sugar", "4 or 5 handfuls raisins"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Wash the rice in several changes of water until the water runs clear, then leave to soak in tepid water with the salt for 30 minutes. ", "Drain the rice and place in a pan with enough cold water to come about 2cm/¾inch above the top of the rice.", "Bring the water to the boil, then reduce the heat to as low as possible, cover and cook for about ten minutes, or until 'holes' begin to appear on the top of the rice and all the water has been absorbed. ", "Heat the oil in a frying pan, add the shallots, onions, garlic and ginger and fry for a couple of minutes, until golden-brown. Remove a tablespoonful and set aside for garnishing.  ", "Add the chicken and stir fry for four minutes.", "Add the spices and stir for one minute, then stir in the yoghurt and simmer for 1-2 minutes. Add the sugar, raisins and part-cooked rice. Cover the pan with a clean tea towel and cover with a lid (this will hold in all the steam).", "Place over a very low heat and cook for ten minutes.", "Remove from the heat and leave to rest for five minutes.", "Serve large spoonfuls garnished with the reserved shallot and onion mixture."]}, {"isVegetarian": false, "title": "Chicken bhuna with pilau rice", "url": "www_bbc_co_uk_food_recipes_chickenbhunawithpila_67271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/½lb sliced chicken breast", "1 tbsp vegetable oil", "1 tbsp olive oil", "1 tsp garam masala", "6 tbsp natural yoghurt", "1 lemon, juiced", "2 garlic cloves, finely chopped ", "½ tsp turmeric", "1 tbsp paprika", "3 cardamoms, crushed with husk removed", "½ tbsp salt", "1 tbsp ground chilli", "1 tbsp cumin", "handful of fresh coriander", "2 cups basmati rice, washed well", "1 onion, chopped", "1 clove of garlic, chopped", "½ cinnamon stick", "2 cardamom pods", "1 tbsp fennel seeds", "1 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the marinade ingredients together and marinade the chicken for 2 hours.", "Heat 1 tbsp vegetable oil in a pan and fry the onion in a pan.", "Add the rice, garlic, cinnamon, cardamom and fennel seeds.  ", "Add cold water to 1in above the level of the rice and bring to the boil.", "Boil for 5 minutes and cover with a lid.", "Turn off the heat and leave for 20 minutes.", "In a non-stick pan heat the oils and fry the chicken until tender and cooked through.", "When the chicken is cooked, add the garam masala and chopped coriander and serve with the rice and a warm naan bread."]}, {"isVegetarian": false, "title": "Chicken goujons with sweetcorn fritters, sautéed potatoes and yellow pepper chilli jam", "url": "www_bbc_co_uk_food_recipes_chickenandsweetcorns_89353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast, skin removed, cut into strips", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp honey", "55g/2oz self-raising flour", "1 tsp baking powder", "pinch salt", "2 free-range eggs", "2-4 tbsp milk", "100g/3½oz canned sweetcorn, drained", "2 tbsp olive oil", "vegetable oil for frying", "1 potato, sliced", "2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed", "½ orange pepper, chopped", "1 vine tomato, seeds removed, chopped", "½ tsp chilli flakes", "2 tbsp white wine vinegar", "2 tsp caster sugar", "1 tbsp tomato ketchup", "55g/2oz mangetout, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the chicken, rub the oil into the meat and season with the salt and pepper.", "In an ovenproof griddle pan, heat a small amount of oil over a medium heat and add the chicken pieces, turning them until they are browned all over. Drizzle the honey over the chicken and transfer the pan to the oven for 7-8 minutes to cook the chicken through.", "For the sweetcorn fritters, mix the flour, baking powder and salt in a large bowl. Using an electric whisk, mix in the eggs and add the milk little by little until the mixture has the consistency of a thick batter. Fold in the sweetcorn.", "In a large frying pan, heat the oil over a medium heat. Using a large spoon, spoon the batter into the frying pan, keeping the spoonfuls of batter separate so that they form fritters.", "Fry the fritters for 3-4 minutes on each side, or until golden-brown and cooked through.", "For the sautéed potatoes, heat the vegetable oil in a large pan over a medium heat and add the potato slices to the oil. Cook for two minutes until they have softened but are not cooked through. Remove and drain on kitchen paper. ", "Return the potato slices to the hot oil for another five minutes until cooked through, or until golden-brown and crisp. Remove and set aside to drain on kitchen paper. ", "For the yellow pepper chilli jam, heat the oil in a frying pan over a medium heat. Add the onions and garlic and fry for 2-3 minutes, or until softened. Add the pepper, tomato, chilli flakes, wine vinegar, sugar and tomato ketchup and cook for 8-10 minutes until the vegetables have visibly softened, then add the sliced mangetout. ", "To serve, place the chicken goujons on a plate with the sweetcorn fritters and potatoes, and garnish with a spoonful of the pepper chilli jam."]}, {"isVegetarian": false, "title": "Chicken and vegetable spring rolls", "url": "www_bbc_co_uk_food_recipes_chickenandvegetables_89282", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandvegetables_89282_16x9.jpg", "ingredients": ["1 tbsp groundnut oil, plus extra for deep-frying", "200g/7oz skinless chicken breast fillets, chopped into small pea-sized pieces", "4 dried Chinese mushrooms, soaked in hot water for 20 minutes, drained and finely chopped ", "1 tbsp light soy sauce", "1 tbsp five-spice powder", "1 tsp grated fresh root ginger", "75g/3oz beansprouts", "2 large spring onions, finely sliced lengthways", "1 small carrot, julienned", "1 tbsp oyster sauce", "½ tbsp light soy sauce", "sea salt and ground white pepper", "16 ready-made large spring roll wrappers, thawed if frozen (available from Asian supermarkets)", "1 egg yolk, beaten"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add the groundnut oil, then add the chicken and mushrooms and stir-fry for 1-2 minutes. Season with soy sauce and five-spice powder, then remove from the wok and set aside to cool for ten minutes. Wipe the wok clean with kitchen paper. ", "Place the grated ginger, beansprouts, spring onions and carrot into a bowl, then add the chicken and mushrooms and season with the oyster sauce, soy sauce, sea salt and ground white pepper. Stir well to combine. ", "Lay two spring roll wrappers one on top of the other (the extra thickness will prevent the skin from breaking) and position so that the corners are pointing upwards, downwards and to the sides.", "Spoon two tablespoons of the filling into the centre of the wrapper. Brush each corner of the wrapper with the cornflour paste, then bring the two opposite corners on the sides together and, keeping your finger on those edges, bring the bottom corner towards the middle and then roll the pastry up tightly towards the top corner. Tuck the top edge in and seal it with a little of the beaten egg yolk. Repeat with the remaining spring roll wrappers and filling. ", "Heat the wok over a high heat and fill the wok to a quarter of its depth with groundnut oil. Heat until a cube of bread dropped in sizzles and turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the spring rolls in small batches into the oil and deep-fry for 2-3 minutes, or until golden-brown. Remove with a slotted spoon and drain on kitchen paper. ", "Transfer the spring rolls onto a plate and serve immediately."]}, {"isVegetarian": false, "title": "Chicken braised with chicory and crème fraîche", "url": "www_bbc_co_uk_food_recipes_chickenbraisedwithch_85937", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp groundnut oil, plus extra if necessary", "30g/1oz butter, plus extra if necessary ", "6 large free-range chicken pieces (drumsticks, thighs, breasts)", "3 heads chicory, cut in half lengthways", "2 tsp brown sugar", "salt and freshly ground black pepper", "3 shallots, finely chopped", "1 lemon, juice only", "125ml/4fl oz medium-dry white wine", "180ml/6½fl oz crème fraîche ", "small handful fresh parsley, chopped", "boiled potatoes, to serve"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the groundnut oil and butter in a large, deep casserole dish with a lid over a medium heat.", "When butter starts to bubble, carefully add the chicken pieces (in two batches if necessary so as not to overcrowd the pan) and fry them until they are golden-brown on each side.", "Lift the chicken out of the pan and set aside. If the butter and oil mixture in the pan is still in reasonable condition keep it for further cooking. If it looks a bit dark, pour it out and add some more, but on no account get rid of the sticky bits on the bottom as that is where much of the flavour is.", "Place the chicory into the pan and return to the medium heat. Add the sugar and season with salt and freshly ground black pepper. Cook over a moderate heat for 5-6 minutes, until the outside leaves start to caramelise and soften. ", "Add the shallots and lemon juice, then return the chicken to the pan. Add the wine to the pan, bring to a simmer, then turn the heat down and cook for ten minutes, or until the wine and cooking juices have reduced.", "Add the crème fraîche, season with salt and freshly ground black pepper, and stir the pan juices into the cream. Cover with a lid and transfer to the oven to cook for 50-60 minutes. Stir the pieces of chicken and chicory half-way through this cooking time.", "Lift the chicken and chicory out of the sauce with a slotted spoon, place into a serving dish and keep warm.", "Add half of the parsley to the sauce and place over a moderate heat. Bring to the boil, then simmer until the sauce starts to thicken slightly - it should be the consistency of double cream.", "Add the remaining parsley and stir well. Pour the sauce over the chicken and chicory in the serving dish.", "To serve, spoon the chicken pieces and sauce onto plates and serve with boiled potatoes to soak up the juices."]}]