[{"ingredients": ["30ml / 1fl oz de aceite de oliva", "60g / 2¼ oz de jengibre fresco, pelado y cortado en tiras muy finas", "400g / 14oz de tomates cherry enteros", "sal y pimienta negra recién molida", "2 cucharadas de jarabe de arce", "1 coliflor", "1 cucharada de aceite de oliva", "pellizcar el polvo de curry sin gluten", "1 cucharada de vinagre de vino blanco", "1 cucharada de jarabe de arce", "sal y pimienta negra recién molida", "1 manzana, pelada, sin corazón, finamente picada", "1 manojo de cebolletas, finamente picado", "1 cucharada de menta fresca picada", "1 cucharada de cilantro fresco picado", "250g / 9oz de col rizada, lavada y deja separada", "100 g / 3½ oz de harina de gramo", "1 cucharadita de comino molido", "1 cucharadita de pimentón molido", "½ cucharadita de cúrcuma", "sal y pimienta negra recién molida", "150ml / 5½ fl oz de leche", "75 g / 2½ oz de queso feta, desmenuzado", "2 cucharadas de aceite de oliva"], "method": ["Para el chutney fresco de tomate y jengibre, caliente el aceite en una sartén grande, agregue el jengibre y cocine durante dos minutos a fuego medio.", "Agregue los tomates y el jarabe de arce, sazone con sal y pimienta y deje que se ablanden durante cinco minutos.", "Dejar de lado hasta que esté listo para servir, caliente o frío.", "Para la coliflor como cuscús, haga un núcleo de coliflor y divídalo en floretes. Picar finamente, ya sea a mano o en un procesador de alimentos.", "Calentar el aceite en una sartén grande o wok. Agregue el polvo de curry y revuelva rápidamente, luego agregue la coliflor picada, el vinagre y el jarabe de arce. Sazonar bien con sal y pimienta. Revuelva rápidamente a fuego medio durante cinco minutos hasta que la coliflor esté tierna.", "Para los buñuelos con especias de col rizada y queso feta, ponga a hervir un sartén grande de agua con sal y cocine las hojas de col rizada durante dos minutos, o hasta que estén tiernas, luego drene y revuelva con agua fría. Exprime el exceso de humedad y corta las hojas aproximadamente.", "Tamiza la harina de gramo y las especias en un tazón grande y agrega una pizca de sal. Agregue la leche lentamente, revolviendo todo el tiempo para hacer una masa espesa. Revuelva en el queso feta desmenuzado, seguido de la col rizada picada. Sazonar bien con sal y pimienta.", "Caliente el aceite en una sartén antiadherente y vierta en cucharadas de la mezcla para hacer pequeños buñuelos. Cocine por unos minutos en cada lado.", "Para servir, coloque el \"cuscús\" en un recipiente y revuelva a través de la manzana, las cebolletas y las hierbas frescas. Apile los buñuelos en cada plato con un poco de salsa picante entre cada capa."], "url": "www_bbc_co_uk_food_recipes_cauliflower_as_couscous_42193", "title": "Cuscús de coliflor con buñuelos de col rizada y queso feta y salsa picante de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_as_couscous_42193_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de guisantes de tejón negro secos (también conocidos como guisantes de arce y guisantes carin)", "1 bulbo de ajo", "4 cucharadas de aceite de oliva extra virgen", "50 ml / 2 fl oz aceite de girasol, más extra para asar el ajo", "1 cucharadita de chiles secos", "1 cucharadita de sal", "1 cucharadita de melaza negra", "½ limón, solo jugo", "100ml / 3½fl oz de jugo de tomate", "2 pequeñas coliflores, con hojas", "pizca de azúcar en polvo", "100g / 3½oz de mantequilla sin sal", "sal y pimienta negra recién molida", "pizca de maíz pizca", "100ml / 3½fl oz de pasta de tempura", "½ cucharadita de aceite de oliva de buena calidad", "2 cebolletas, cortadas", "1 cebolla mediana", "250ml / 9fl oz de crema batida", "250ml / 9fl oz de leche entera", "100ml / 3½fl oz de caldo de verduras", "4 rebanadas de jamón de buena calidad", "100g / 3½ oz de humus de arveja negra (de arriba)", "puñado de guisantes negros cocidos", "100 ml / 3½ fl oz de salsa de cebolla ahumada (desde arriba)", "flores de cebollino", "Cebolletas, picadas"], "method": ["Para el humus de guisante negro, prepare los frijoles el día antes de servir el plato. Enjuague los guisantes secos a fondo con agua fría. Coloque en un recipiente y cúbralo con agua fría. Remoja toda la noche en la nevera.", "El% 20siguiente% 20day,% 20drain% 20the% 20peas% 20and% 20steam% 20gently% 20for% 20an% 20hour.% 20In% 20a% 20conventional% 20steamer,% 20place% 20water% 20in% 20the% 20pan% 20and% 20bring% 20to % 20the% 20boil.% 20Set% 20the% 20steamer% 20over% 20the% 20pan% 20and% 20turn% 20down% 20the% 20heat.% 20Check% 20regularly% 20to% 20ensure% 20the% 20water% 20level% 20doses% 20not% 20drop% 20too % 20much.% 20In% 20a% 20steam% 20oven,% 20place% 20the% 20black% 20peas% 20in% 20a% 20tray% 20and% 20cover% 20with% 20600ml / 20fl% 20oz% 20cold% 20water.% 20Place% 20in% 20the% 20steam% 20oven% 20and% 20set% 20to% 20120C% 20with% 20100 %% 20humidity.% 20Steam% 20for% 20an% 20hour,% 20then% 20drain% 20the% 20peas% 20again% 20to% 20remove% 20the% 20liquid.", "Mientras tanto, precaliente el horno a 220C / 200C ventilador / Gas 7. Rocíe un poco de aceite sobre el ajo y tueste durante 15-20 minutos, o hasta que los dientes estén suaves y dorados.", "Corte la bombilla por la mitad, exprima el ajo suave cocido y páselo por un colador para crear un puré.", "Cuando los guisantes estén casi tiernos, ponga ambos aceites en una sartén pequeña y agregue los chiles secos. Caliéntelo suavemente para infundir los aceites con la guindilla (asegúrese de que los copos de chile no se quemen en el aceite), luego reserve.", "Reserve algunos guisantes para adornar y coloque el resto en un procesador de alimentos. Agregue la sal, la melaza, el jugo de limón, el jugo de tomate y una cucharadita de puré de ajo. Procese a velocidad máxima hasta que se combinen, luego, con el motor en marcha, vierta los aceites calentados en un flujo constante. Procese hasta que quede suave.", "Sazone el hummus con sal y pimienta. Tendrá más hummus de lo requerido para esta receta, pero cualquier exceso se puede guardar en el refrigerador en un recipiente hermético por hasta 3 días.", "Para la coliflor, retire las hojas de las coliflores y reserve 4 de las hojas amarillas interiores (amarillas) para la tempura.", "Recorte los tallos de las coliflores y forme un punto con un cuchillo pequeño.", "Vierta 1 litro / 1¾fl de onza de agua en una cacerola y sazone con sal y una pizca de azúcar en polvo. Agregue la mantequilla a la sartén y deje que hierva. Blanquee las tiernas hojas de coliflor durante 30 segundos y revuelva en agua helada. Retire las hojas y seque con un rodillo de cocina. Dejar de lado.", "Agregue las coliflores pequeñas al agua hirviendo y cocínelas durante 3-4 minutos a fuego alto (asegúrese de que el agua hierva rápidamente). Cuando las coliflores estén tiernas, pero todavía retenga un poco de mordisco, colóquelas en una bandeja alineada con el rollo de cocina. Sazone las coliflores con sal y pimienta y manténgase caliente.", "Precaliente una freidora a 180 ° C.", "Para las hojas tempura, el polvo de las hojas de coliflor blanqueadas con harina de maíz, sumerja en la masa de tempura y fría hasta que estén crujientes y doradas. Escurrir en el rollo de cocina y sazonar con sal. Mantenga caliente en un horno bajo hasta que esté listo para servir.", "Para las cebolletas, caliente una sartén antiadherente a fuego alto. Ligeramente cepille las cebolletas con aceite y luego póngalas en la sartén caliente. Sazonar con un poco de sal y pimienta negra recién molida. Mantener caliente", "Para la salsa de cebolla ahumada, precalentar el horno a un ventilador de 200C / 180C / Gas 6.", "Coloque toda la cebolla en una bandeja para hornear y tueste en su piel durante aproximadamente 1 hora hasta que esté muy suave. Retirar del horno y reservar para enfriar.", "Cuando la cebolla se haya enfriado, retire con cuidado la piel y retenga todos los jugos. Fuma la cebolla por 20 minutos.", "Coloque todos los ingredientes restantes en una cacerola y llévelos a ebullición. Vierta en un licuador y agregue la cebolla ahumada. Procese hasta que quede suave, luego pase a través de un tamiz fino. Condimentar con sal y pimienta.", "Para servir, coloque una cucharada de humus de guisante negro en el medio de cada plato de servir calentado y agregue algunos guisantes cocidos. Coloque la coliflor en la parte superior del hummus, apunte hacia arriba y espolvoree un poco de salsa de cebolla ahumada. Adorne con la cebolla chamuscada, el jamón y las hojas tempura de coliflor. Finalmente espolvorea sobre las flores de cebollino y las cebolletas picadas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cauliflower_black_pea_91065", "title": "Coliflor, guisante negro, hummus, jamón curado y salsa de cebolla ahumada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 coliflor grande, cortada en florecillas", "500ml / 18fl de leche en oz", "2 hojas de laurel", "1 cuchilla", "pocos granos de pimienta", "30g / 1oz de mantequilla", "Harina normal de 30g / 1oz", "½ cucharadita de mostaza en polvo", "pizca de cayena", "Queso cheddar o gruyère 100 g / 3½ oz", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 3.", "Llevar a ebullición una cacerola grande de agua salada. Agregue la coliflor y cocine por 4 minutos, o hasta que esté tierna. Escurrir y poner en un plato grande a prueba de horno.", "Vierta la leche en una cacerola y agregue las hojas de laurel, macis y granos de pimienta. Llevar casi a ebullición, luego retirar del fuego y dejar de lado.", "En una olla aparte, derrita la mantequilla. Agregue la harina, la mostaza en polvo y la pimienta de cayena. Batir hasta que quede suave, luego cocinar durante 1-2 minutos más, revolviendo todo el tiempo. Colar la leche en una jarra y agregarla gradualmente a la sartén, batiendo en cada adición hasta que quede suave antes de agregar más leche. A medida que la mezcla se afloja, puede agregar la leche en grandes cantidades, revolviendo constantemente hasta que esté todo incorporado. Agregue 75 g / 2½ oz de queso y revuelva hasta que se derrita. Condimentar con sal y pimienta.", "Vierta la salsa sobre la coliflor y espolvoree con el queso reservado. Hornee durante unos 30 minutos, o hasta que la parte superior esté dorada y burbujeante."], "url": "www_bbc_co_uk_food_recipes_cauliflower_cheese_27559", "title": "Queso de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 coliflor de cabeza grande, cortada en florecillas", "sal marina y pimienta negra recién molida", "20 g / ¾oz de mantequilla sin sal", "Harina normal de 20g / ¾oz", "6-8 raspaduras de nuez moscada", "Leche desnatada 250ml / 9fl oz", "40 g / 1½ oz de queso cheddar maduro, finamente rallado", "2 cucharaditas de mostaza Dijon", "15g / ½ oz de parmesano o queso duro vegetariano similar, finamente rallado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque la coliflor en un plato resistente al horno y sazone con una pizca de sal y pimienta. Asar durante 20 minutos o hasta que estén tiernos y comenzar a dorarse.", "Mientras tanto, prepare la salsa: derrita la mantequilla en una cacerola, agregue la harina y cocínela durante 1-2 minutos, o hasta que tenga un color dorado claro. Poco a poco agregue la leche hasta que quede suave, luego cocine a fuego lento durante 3-4 minutos, mezcle a medida que calienta hasta que espese.", "Agregue la nuez moscada. Baje el fuego y agregue la mostaza y el queso cheddar. Pruebe y agregue un poco de pimienta al gusto.", "Coloque la coliflor asada en la salsa y mezcle para cubrir. Vuelva a ponerlo en el plato de asar, espolvoree sobre el parmesano y vuelva al horno de 10 a 15 minutos, o hasta que el queso esté dorado y la salsa burbujee."], "url": "www_bbc_co_uk_food_recipes_cauliflower_cheese_30249", "title": "Queso de coliflor asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_cheese_30249_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cordero", "harina común, para quitar el polvo", "1 huevo mediano de granja, golpeado", "50g / 1¾oz de setas de trompeta secas, mezcladas a un polvo fino", "aceite de oliva, para freír", "sal y pimienta negra recién molida", "1 coliflor grande, solo florecillas", "3 cucharadas de pasas, remojadas en agua tibia durante 10 minutos, escurridas", "50g / 1¾oz de aceitunas verdes, piedras removidas, picadas", "3 cucharadas de piñones", "2 champiñones Portobello grandes, limpios", "75g / 2¾oz de mantequilla sin sal", "150g / 5½oz de setas silvestres surtidas, limpiadas", "1 cucharada de romero fresco picado", "100ml / 3½ fl oz crema doble", "1 cucharada de vinagre de vino tinto", "2 cucharaditas de salsa de soja", "2 cucharadas de perejil fresco picado"], "method": ["Para hacer el cordero con costra de hongos, espolvoree ligeramente el lomo de cordero con harina. Sumérgete en el huevo batido y luego revuélvelo con el polvo de champiñones. Envuélvela con fuerza en una película adhesiva y déjala enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 220 ° C / 200 ° Ventilador / Gas 7. Calentar un poco de aceite de oliva en una sartén. Desenvuelve el cordero y fríe hasta que se dore por todas partes. Transfiera a una bandeja para hornear y hornee durante 5-10 minutos, o hasta que se cocinen a su gusto. Retire del horno y reserve en un lugar cálido para descansar.", "Para hacer el cuscús de coliflor, coloque la coliflor en un procesador de alimentos y pulse hasta que esté muy finamente picado. Inclínelo en un colador fino y cocínelo sobre una olla con agua hirviendo durante 5 minutos o hasta que esté tierno. Transfiera la coliflor a un tazón grande y mezcle las pasas, las aceitunas y los piñones. Sazone al gusto con sal y pimienta.", "Precalentar la parrilla a fuego medio-alto. Para hacer las setas cremosas, salpique los champiñones Portobello con un poco de mantequilla y ase a la parrilla hasta que estén tiernos. Poner a un lado para enfriar un poco, luego cortar.", "En una sartén, agregue la mantequilla restante y caliente hasta que se vuelva marrón. Agregue los champiñones y el romero y cocine hasta que los champiñones estén tiernos.", "Agregue los hongos Portobello y la crema y sazone con sal y pimienta. Cocine a fuego lento hasta que la crema se reduzca y espese, luego agregue el vinagre y la salsa de soja. Cocine a fuego lento hasta que la crema cubra los champiñones. Espolvoree un poco de perejil picado.", "Para servir, esculpe el cordero en cuatro rebanadas. Coloque una porción de los champiñones en un plato para servir y coloque una rebanada de cordero encima. Sirva con el cuscús de coliflor."], "url": "www_bbc_co_uk_food_recipes_cauliflower_couscous_24088", "title": "Cuscús de coliflor con cordero con costra de champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 coliflor mediana, tallo eliminado, floretes separadas", "100 g / 3½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "500ml / 18fl de leche en oz", "1 cucharada de mostaza Dijon", "300 g / 10½ oz de queso cheddar extra maduro, rallado", "sal marina y pimienta negra recién molida", "3 rebanadas de brioche, blitzed to migmbs en un procesador de alimentos", "20 lonchas de tocino rayado o panceta", "2 cucharadas de jarabe de arce"], "method": ["Precalentar la parrilla a su configuración más alta.", "Ponga a hervir una olla grande de agua con sal, luego cocine las flores de coliflor durante 5-6 minutos o hasta que estén tiernas. Escurrir bien y refrescar en un tazón grande de agua helada.", "Derretir la mitad de la mantequilla en una olla grande. Cuando se derrita, bata la harina para formar una pasta suave. Continúe cocinando la pasta durante 1-2 minutos, batiendo continuamente.", "Poco a poco agregue la leche a la pasta, batiendo después de cada adición hasta que quede suave. Cuando toda la leche se haya agregado a la salsa, mezcle la mostaza y la mitad del queso rallado hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Escurra los flósculos de coliflor enfriados y transfiéralos a un plato resistente al horno. Verter sobre la salsa de queso, luego espolvorear sobre el queso rallado restante.", "Coloque el plato debajo de la parrilla durante 4-5 minutos, o hasta que el queso esté dorado y burbujeante.", "Mientras tanto, derrita la mantequilla restante en una sartén a fuego medio. Agregue las migas de brioche y freír hasta que estén doradas y crujientes, revolviendo bien. Transfiera a un tazón.", "Limpie la sartén con el rollo de cocina. Agregue la panceta y fría hasta que esté crujiente y dorado. Rocíe sobre el jarabe de arce y revuelva hasta que cubra toda la panceta.", "Para servir, espolvorea el pan rallado sobre el queso de coliflor. Coloque las lonjas de panceta de jarabe de arce en la parte superior. Cuchara en platos."], "url": "www_bbc_co_uk_food_recipes_cauliflower_cheese_with_76792", "title": "Queso de coliflor con panceta de jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo cortadas a la mitad", "2 cucharadas de aceite de oliva", "8 ramitas de tomillo fresco, solo hojas", "4 tomates maduros, cortados por la mitad horizontalmente", "3 cucharadas de miel clara", "1 coliflor grande, sin núcleo extraído, quebrado en florecillas", "250ml / 9fl oz de jarabe de arce", "6 cucharadas de vinagre de vino blanco", "1 cucharadita de curry en polvo", "75 g / 2½ oz de pistachos con cáscara, toscamente picados", "75g / 2½oz de almendras copos tostadas", "4 cebollas de primavera, cortadas, en rodajas", "3 cucharadas de hojas de menta fresca picada", "3 cucharadas de hojas de cilantro fresco picado", "sal y pimienta negra recién molida"], "method": ["Treinta minutos antes de que desee comer, prepare su barbacoa: permita que las llamas se enciendan y mueran hasta que las brasas brillen.", "Mientras tanto, frote las piezas de pechuga de pollo en la mitad del aceite y sazone, al gusto, con sal y pimienta negra recién molida. Agregue la mitad de las hojas de tomillo y mezcle bien.", "Cuando la barbacoa esté lista, coloque los trozos de pollo, con la piel hacia abajo, sobre la barbacoa y ase a la parrilla durante 8-10 minutos en cada lado, o hasta que estén dorados y cocidos. (El pollo se cuece si los jugos salen limpios cuando se inserta un pincho en el centro de la carne).", "Coloque las mitades de tomate, con el lado del corte hacia abajo, en una hoja de papel de aluminio. Pliega los bordes de la lámina para hacer una bandeja, luego rocía sobre el aceite restante y la miel. Espolvorear sobre el tomillo restante y sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque la bandeja de aluminio en la parrilla de la barbacoa, junto con el pollo, y ase a la parrilla durante 12-15 minutos, o hasta que los tomates se hayan suavizado y ennegrecido ligeramente.", "Mientras tanto, mezcle los flósculos de coliflor en migajas en un procesador de alimentos, luego transfiera a un tazón grande.", "Calentar una sartén a fuego medio. Cuando esté caliente, agregue el jarabe de arce, el vinagre y el polvo de curry, revuelva bien, y cocine durante 1-2 minutos, o hasta que se caliente por completo.", "Agregue la mezcla de jarabe de arce a la coliflor, luego agregue los pistachos, almendras, cebollas y hierbas y revuelva hasta que se combinen bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, apile la ensalada de coliflor en un plato grande para servir y cubra con los trozos de pollo asados ​​y los tomates a la parrilla. Rocíe los jugos que quedan en la bandeja de tomate."], "url": "www_bbc_co_uk_food_recipes_cauliflower_salad_with_90691", "title": "Ensalada de coliflor con barbacoa de pollo y miel", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_salad_with_90691_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "Flósculos de coliflor de 800 g / 1 libra y 12 onzas, más o menos picados", "1 litro / 1¾ pinta de caldo de verduras", "Crema doble 250ml / 9fl oz", "2 cucharadas de vinagre balsámico reducido (o vinagre balsámico común)", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de berro de coriandro", "125ml / 4fl oz de agua", "50g / 1¾oz de mantequilla, cortada en cubitos", "Harina simple de 75g / 2¾oz", "2 huevos de gallinas camperas", "75g / 2¾oz Stilton, desmenuzado"], "method": ["Para la sopa, caliente una sartén grande hasta que esté caliente. Agregue la mantequilla, la cebolla y el ajo y saltee durante dos minutos, o hasta que se ablanden.", "Agregue la coliflor y el caldo de verduras y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante 4-6 minutos, o hasta que la coliflor esté tierna.", "Enfríe un poco, luego coloque la mezcla en una licuadora de alimentos y blitz para un puré.", "Vuelva a la cacerola y agregue 200 ml / 7 fl oz de la crema. Sazonar con sal y pimienta negra recién molida y volver a hervir.", "Cocine a fuego lento por un minuto, luego mantenga caliente hasta que esté listo para servir.", "Para el stilton cheese choux, caliente una freidora a 190C / 375F.", "Coloque el agua y la mantequilla en una olla y deje hervir durante un minuto.", "Retire del fuego y agregue la harina de una vez, batiendo bien hasta que la mezcla esté suave y se desprenda de los lados de la sartén.", "Regrese al fuego por un minuto o dos para cocinar.", "Retire del fuego nuevamente y agregue los huevos, uno a la vez, batiendo bien entre la adición de cada huevo.", "Agregue el queso azul y mezcle bien. Sazonar con sal y pimienta negra recién molida.", "Ponga cucharaditas de la mezcla en la freidora y fríe por 2-3 minutos, o hasta que estén doradas y crujientes (puede necesitar hacer esto en tandas).", "Escurrir sobre papel de cocina y sazonar con un poco de sal.", "Para servir, ponga la sopa en cuencos y coloque algunos de los quesos Stilton en la parte superior. Rocíe el vinagre balsámico, la crema doble restante y el aceite de oliva. Termina con una dispersión de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_cauliflower_soup_with_39115", "title": "Sopa de coliflor con Stilton choux", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pimiento rojo, semillas eliminadas, en rodajas", "200g / 7oz de coliflor, blanqueada", "150ml / 5fl oz de crema doble", "150g / 5oz de queso cheddar rallado", "1 yema de huevo de gallinas camperas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén y agregar el pimiento rojo. Freír durante tres minutos, hasta que comience a ablandarse, luego agregar la coliflor y cocinar por dos minutos.", "Transfiera la mezcla de pimiento y coliflor a un plato resistente al horno.", "Para la salsa de queso, caliente la crema y 100 g / 3½ oz del queso cheddar en una cacerola a fuego lento, revolviendo para derretir el queso. Deje que hierva a fuego lento y cocine durante tres minutos, luego retírelo del fuego y agregue la yema de huevo. Revuelva bien para combinar, luego vierta la mezcla sobre la coliflor y los pimientos.", "Cubra el plato con el queso cheddar rallado restante y coloque en el horno precalentado para hornear durante ocho minutos, o hasta que burbujee y dore.", "Servir en la fuente del horno directamente del horno."], "url": "www_bbc_co_uk_food_recipes_cauliflowercheeseand_84897", "title": "Queso de coliflor y pimientos asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 coliflor grande, cortada en florecillas", "50 g / 2 oz de mantequilla, más extra para engrasar", "Harina normal de 50g / 2oz", "450ml / 16fl de leche en oz", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "Salsa de salsa Worcestershire", "sal y pimienta negra", "150g / 5oz de salmón cocido cocido", "Queso cheddar 125 g / 4½ oz, rallado", "Queso emmental de 75 g / 3 oz, rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ponga a hervir una olla grande de agua con sal, luego agregue la coliflor y cocine durante dos minutos.", "Escurrir y colocar en un plato a prueba de horno con mantequilla.", "Coloque la mantequilla y la harina en una cacerola y caliente para derretir la mantequilla.", "Cocine, revolviendo por uno o dos minutos hasta que esté ligeramente dorado.", "Retire del fuego y bata gradualmente en la leche para formar una salsa suave.", "Regrese al fuego y cocine a fuego lento durante dos o tres minutos.", "Retirar del fuego y batir en las yemas de huevo, mostaza y salsa Worcestershire.", "Sazone con sal y pimienta y vierta el salmón en la salsa, revolviendo con cuidado.", "Vierta sobre la coliflor y cubra con los quesos rallados.", "Coloque en el horno y cocine durante 10-15 minutos, hasta que estén doradas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cauliflowercheesewit_83926", "title": "Queso coliflor con salmón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflowercheesewit_83926_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ cebolla grande, en rodajas", "1 cucharadita de polvo de curry suave", "1 cucharadita de hojuelas de chile", "1 cucharadita de semillas de comino", "½ coliflor, cortada en florecillas", "agua caliente según sea necesario", "7 papas nuevas, cortadas en trozos pequeños, hervidas por parchar y escurridas", "85ml / 3fl oz de leche semidesnatada", "sal y pimienta negra recién molida al gusto", "1 cucharada de cilantro fresco, picado", "1 cucharada de cebollín fresco, picado"], "method": ["Caliente el aceite de oliva en una sartén grande a fuego moderado. Agregue la cebolla en rodajas y fría por 2-3 minutos, hasta que se suavice.", "Agregue el curry en polvo, los copos de chile y las semillas de comino y fría por un minuto más.", "Agregue las florecillas de coliflor, revuelva bien para cubrir las especias, y luego agregue suficiente agua caliente para cubrir la coliflor. Llevar a ebullición y luego bajar el fuego a fuego lento durante 8-10 minutos.", "Agregue las papas hervidas y cocine durante dos minutos, o hasta que las papas y la coliflor estén completamente cocidas.", "Agregue la leche, condimente, al gusto, con sal y pimienta negra recién molida y caliente durante un minuto.", "Agregue el cilantro y las cebolletas y revuelva.", "Para servir, cuchara el curry en cuatro cuencos."], "url": "www_bbc_co_uk_food_recipes_cauliflowercurry_80942", "title": "Curry de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 coliflor pequeña, cortada en pequeños floretes", "Crema doble 50ml / 2fl oz", "50g / 1¾oz de queso azul", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 230C / 400F / Gas 6.", "Coloque la coliflor en una olla de agua hirviendo y cocine a fuego lento durante 3-5 minutos, o hasta que esté tierna, luego drene y transfiera a un plato pequeño a prueba de horno.", "Vierta la crema sobre la coliflor y esparza sobre el queso azul. Haga un pozo en el medio de la mezcla y coloque la yema de huevo en el pozo, luego sazone bien con sal y pimienta negra recién molida.", "Transfiera el plato al horno y cocínelo durante ocho minutos, o hasta que el huevo se haya fraguado y el queso burbujee.", "Para servir, retire del horno y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cauliflowereggandblu_84693", "title": "Coliflor, huevo y queso azul gratinado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Coliflor de 450 g / 1 libra, cortada en florecillas", "1 huevo de gallinas camperas", "125ml / 4½fl oz de agua helada", "pizca de sal", "125g / 4½oz de harina natural", "aceite vegetal, para freír", "125g / 4½ oz de mayonesa lista para usar", "1 cucharada de pasta de curry media", "1 cucharada de hojas de cilantro fresco picado, para servir"], "method": ["Para los buñuelos de coliflor, hierva una olla de agua. Agregue las florecillas de coliflor y deje hervir durante 3-4 minutos, o hasta que estén tiernas. Escurrir bien, luego actualizar en agua fría y drenar de nuevo. Dejar de lado.", "En un tazón, bata el huevo y el agua juntos. Agregue la sal y la harina y bata hasta que la mezcla forme una mezcla suave.", "Caliente el aceite vegetal en una freidora de grasa ajustada a 180 ° C. Alternativamente, vierta el aceite vegetal en una sartén profunda de base pesada para que alcance dos tercios del camino hasta la sartén y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje sin supervisión.) Sumerja las flores de coliflor drenadas en la masa, luego, con cuidado, bótelas en el aceite caliente, en lotes si es necesario. Freír a fuego lento durante 3-4 minutos, o hasta que estén crujientes y doradas, luego con cuidado quítelos del aceite con una espumadera y déjelos a un lado para escurrirlos sobre papel de cocina. Repita el proceso con cualquier florecillo de coliflor restante.", "Para la mayonesa al curry, mezcle la mayonesa y la pasta de curry en un tazón pequeño hasta que estén bien combinados.", "Para servir, coloque una cucharada de la mayonesa al curry en el centro de cada uno de los cuatro cuencos de servir. Arregle los buñuelos de coliflor alrededor de la mayonesa al curry. Espolvorea sobre las hojas de cilantro picado."], "url": "www_bbc_co_uk_food_recipes_cauliflowerfrittersw_91594", "title": "Buñuelos de coliflor con mayonesa al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 coliflor de cabeza mediana, rota en grandes floretes", "40 g / 1½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "Leche 400ml / 14fl oz", "1 cucharadita de mostaza inglesa", "Queso cheddar maduro 100g / 3½oz, rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Lave bien la coliflor y colóquela en una olla grande de agua con sal. Llevar a ebullición y cocinar durante 3-5 minutos, hasta que la coliflor esté casi tierna, pero aún bastante firme. Incline en un colador y déjelo escurrir.", "Para hacer la salsa, derrita la mantequilla en una sartén mediana de base pesada y agregue la harina. Cocine a fuego lento durante un minuto. Retire la sartén del fuego y gradualmente agregue la leche, poco a poco, revolviendo bien entre cada adición. Regrese la sartén a fuego medio y lleve la mezcla a ebullición, revolviendo constantemente. Cocine a fuego lento durante dos minutos, luego retire del fuego.", "Agregue la mostaza y dos tercios del queso y reserve. Arregle la coliflor y la fuente de horno para hornear. Vierta cuidadosamente sobre la salsa, asegurándose de que la coliflor esté completamente cubierta. Esparcir sobre el queso restante y hornear durante 25-30 minutos, hasta que la parte superior esté dorada y burbujeante."], "url": "www_bbc_co_uk_food_recipes_cauliflower_cheese_55471", "title": "Queso de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_cheese_55471_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "½ cebolla, finamente rebanada", "1 coliflor, cortada en florecillas", "100g / 3½ oz de queso cheddar maduro, rallado", "75ml / 2½ fl oz crema doble", "sal y pimienta blanca recién molida", "nuez moscada pizca"], "method": ["Derretir la mantequilla en una olla. Agregue la cebolla y el sudor durante 1-2 minutos hasta que se ablanden.", "Agregue la coliflor y suficiente agua para cubrir los ingredientes. Revuelva para combinar, lleve a ebullición y reduzca a fuego lento durante 8-10 minutos o hasta que esté tierno.", "Escurre a través de un colador y coloque la mezcla de coliflor en un procesador de alimentos.", "Agregue el queso y la crema y mezcle hasta que tenga un puré espeso.", "Sazonar con sal, pimienta blanca recién molida y una pizca de nuez moscada."], "url": "www_bbc_co_uk_food_recipes_cauliflowermash_76888", "title": "Puré de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "Flósculos de coliflor de 800g / 1¾lb, toscamente picados", "1 litro / 1¾ pintas de pollo o verdura", "150ml / 5fl oz de crema doble"], "method": ["Para la sopa de coliflor, caliente el aceite en una sartén profunda de base pesada a fuego medio. Agregue la cebolla y el ajo y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el comino molido y el cilantro molido y fría por otros 1-2 minutos, o hasta que estén fragantes.", "Agregue la coliflor picada y el caldo de pollo. Llevar la mezcla a ebullición, luego reducir el fuego y hervir a fuego lento durante 8-12 minutos, o hasta que la coliflor esté tierna. Retirar del fuego y reservar para enfriar.", "Con cuidado, vierta la mezcla de sopa en un procesador de alimentos y mezcle con un puré (o alternativamente, use una batidora en la cacerola). Regrese la mezcla de sopa puré a la sartén y agregue la crema. Sazonar, al gusto, con sal y pimienta negra recién molida y calentar durante 1-2 minutos.", "Para servir, divida la sopa de coliflor por igual entre cuatro tazones para servir. Sirva con pan crujiente y mantequilla."], "url": "www_bbc_co_uk_food_recipes_cauliflowersoupwithc_90939", "title": "Sopa de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflowersoupwithc_90939_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 3oz cuello de cordero (en el hueso), preferiblemente galés, cortado en porciones", "2 litros / 3 pintas 10½ fl oz de caldo de cordero", "Papas 225g / 8oz, peladas y picadas", "225g / 8oz cebollas, peladas y picadas", "225 g / 8oz de puerros, cortados y cortados en rodajas de 1cm / ½ en rodajas", "Zanahorias 225 g / 8 oz, peladas y picadas", "Grano de 225 g / 8 oz, pelado y picado"], "method": ["Coloque el cordero en una sartén grande y vierta sobre el caldo. Ponga el líquido a ebullición, luego reduzca el fuego hasta que esté hirviendo a fuego lento y continúe cocinando a fuego lento durante una hora.", "Agregue las verduras picadas y continúe cocinando durante una hora más. Retirar del fuego, tapar y reservar para enfriar durante la noche.", "Cuando esté listo para servir el estofado, vuelva a hervir la mezcla y continúe hirviendo durante 15 minutos, o hasta que esté completamente caliente.", "Para servir, divida el macollo por igual entre cuatro a seis platos para servir. Servir con pan crujiente y queso galés."], "url": "www_bbc_co_uk_food_recipes_cawl_92334", "title": "Cawl", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz pasas de Corinto", "225 g / 8oz sultanas", "225 g / 8oz de pasas", "175g / 6oz de cerezas glaseadas, enjuagadas, secas y descuartizadas", "Albaricoques secos listos para el consumo de 175g / 6oz, cortados en pedazos", "75g / 3oz de cáscara confitada mixta, finamente picada", "4 cucharadas de brandy, más brandy extra para 'alimentar' el pastel", "Harina normal de 275g / 10 oz", "½ cucharadita de nuez moscada rallada", "¾ cucharadita de especias mixtas", "Mantequilla 400g / 14oz, ablandada", "400g / 14oz de azúcar mascabado oscuro", "5 huevos de gallinas camperas", "65 g / 2½ oz de almendras enteras, picadas (pieles dejadas)", "1 cucharada de melaza negra", "1 limón, ralladura rallada solamente", "1 naranja, ralladura solamente", "almendras blanqueadas", "cerezas glaseadas, enjuagadas, secas y cortadas a la mitad"], "method": ["Ponga las grosellas, pasas sultanas, pasas, cerezas enjuagadas, secas y descuartizadas, albaricoques cortados y cáscara mixta picada en un tazón grande. Agregue el brandy, cubra el recipiente y déjelo en un lugar fresco durante la noche.", "Engrase ligeramente una lata de pastel redonda de 23 cm / 9 en profundidad. Corte una tira de pergamino antiadherente para hornear para que se ajuste dos veces a los lados de la lata, pliegue el borde inferior de la banda unos 2,5 cm / 1 para arrugarla firmemente, luego abra el pliegue y corte las líneas oblicuas en este estrecho tira a intervalos. Coloque un círculo de pergamino antiadherente en la base de la lata, engrase ligeramente el borde exterior y luego ajuste la tira de pergamino preparada con el borde recortado en la base del estaño para revestir los lados de la lata. Coloque un segundo círculo de pergamino para hornear antiadherente para cubrir la parte cortada del papel.", "Precalentar el horno a 140C / 275F / Gas 1.", "Ponga la harina, nuez moscada rallada, especias mixtas, mantequilla, azúcar, huevos, almendras picadas, melaza negra y la ralladura de cítricos en un tazón grande y bata bien para mezclar bien. Doble las frutas empapadas.", "Coloque la mezcla en la lata de torta preparada y extiéndala uniformemente con el dorso de una cuchara. Decora la parte superior con las almendras blanqueadas y las cerezas glaseadas, empujándolas ligeramente hacia la parte superior de la mezcla de tortas. Cubra la parte superior de la torta sin apretar con una doble capa de papel resistente a la grasa. Hornee en el horno precalentado durante aproximadamente 4¼-4 ¾ horas, o hasta que la torta se sienta firme al tacto y un pincho insertado en el centro salga limpio. Permita que la torta se enfríe en la lata.", "Cuando esté fresco, perforar el pastel a intervalos con un pincho fino y 'alimentar' con un poco de brandy. Una vez que la torta esté completamente fría, deje el papel de revestimiento sobre la torta, envuelva en una doble capa de papel a prueba de grasa y otra vez en papel de aluminio. Almacene en un lugar fresco y seco por hasta tres meses, alimentándose a intervalos con más brandy."], "url": "www_bbc_co_uk_food_recipes_celebration_cake_61952", "title": "Pastel de frutas clásico de Mary Berry", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de harina de espelta, más extra para espolvorear", "125g / 4½oz de mantequilla fría sin sal, en cubos", "½ cucharadita de sal marina fina", "algunas ramitas cada romero fresco, tomillo y salvia, hojas recogidas y finamente picadas", "1 limón sin cebar, ralladura fina solamente", "25g / 1oz Cheddar, rallado", "1 yema de huevo de gallinas camperas", "3 cabezas de ajo, clavos separados y pelados", "aceite de oliva", "1 cucharadita de vinagre balsámico", "1 cucharada de miel líquida", "2 ramitas de romero fresco, tomillo y salvia, hojas recogidas y finamente picadas, más extra para decorar", "1 kg / 2lb 4 oz de apionabo, pelado, 300 g / 10½ oz reservado, el resto cortado en 2 cm / ¾en piezas", "220g / 8oz de queso Lancashire o Cheddar, desmenuzado", "150 g / 5½ oz de crema", "½ limón, solo jugo", "1 cucharada de mostaza integral", "pequeño racimo de perejil fresco, picado", "dash salsa Worcestershire", "2 huevos de gallinas camperas, golpeados", "sal y pimienta negra recién molida"], "method": ["Para hacer la masa, poner la harina en un tazón. Agregue la mantequilla y la sal y frote suavemente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Revuelva a través de las hierbas, la ralladura de limón y el Cheddar.", "Batir la yema de huevo con 1 cucharada de agua fría en un bol. Agregue a la mezcla de harina y combine hasta que se forme una masa, agregando más agua fría si es necesario. Envuelva la película adhesiva y colóquela en el refrigerador mientras realiza el llenado.", "Para hacer el relleno, coloque el ajo en una cacerola, cubra con agua fría y cocine a fuego lento. Cocine por 2-3 minutos, luego escurra.", "Limpie la cacerola seca. Agregue el ajo y 1 cucharada de aceite de oliva y fría a fuego alto durante 2 minutos. Agregue el vinagre y 100ml / 3½ fl oz de agua, lleve a ebullición y cocine a fuego lento durante 10 minutos.", "Agregue la miel, la mayor parte del romero y el tomillo (reservando el resto, con el sabio) y una buena pizca de sal. Cocine a fuego medio durante 5 minutos, o hasta que la mayoría del líquido se haya evaporado y el ajo esté cubierto con un jarabe oscuro.", "Mientras tanto, ponga el apionabo en una cacerola, cúbralo con agua recién hervida y hierva durante 7-10 minutos, o hasta que esté suave y ligeramente translúcido. Escurrir y verter en un tazón grande.", "Agregue los quesos, la crema fresca, el jugo de limón, la mostaza, el perejil, la salsa Worcestershire y los huevos. Agregue una buena pizca de sal y muela de pimienta y dóblela suavemente en el ajo.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Espolvoree la harina sobre una superficie de trabajo limpia y extienda la masa hasta 3-4 mm de grosor. Cubra una lata redonda de pastel de 20 cm / 8 in con la masa, asegurando un poco de derrames sobre los bordes. Vierta el relleno en la caja de pastelería. Rallar gruesamente el apio nabo reservado y apilarlo encima. Termine con el romero, el tomillo, la salvia y un chorrito de aceite de oliva reservados.", "Hornee durante 45 minutos, o hasta que el relleno de tarta se haya endurecido y la parte superior esté dorada. Deje que se enfríe un poco, luego sáquelo de la lata. Sirva caliente con algunas hierbas rociadas."], "url": "www_bbc_co_uk_food_recipes_celebration_celeriac_and_33665", "title": "Celebración de apio nabo y ajo dulce", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celebration_celeriac_and_33665_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de cacao en polvo, más extra para quitar el polvo", "3 cucharadas de agua hirviendo", "100 g / 3½ oz de azúcar en polvo", "100g / 3½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear de nivel", "2 huevos grandes de gallinas camperas", "Margarina 100 g / 3½ oz, más extra para engrasar", "2 cucharadas de aguardiente", "300g / 11oz de chocolate puro (no más de 40-50 por ciento de sólidos de cacao), dividido en cuadrados", "450 ml / 16 fl oz de crema batida", "225 g / 8 oz de frambuesas frescas y arándanos", "doble crema", "azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase la lata con margarina y forre la base y los costados con papel de hornear. Debe alinear el estaño hasta la parte superior, aunque la esponja no lo llene.", "Para la torta de chocolate, mida el polvo de cacao en un tazón grande. Vierta sobre el agua hirviendo y mezcle hasta obtener una pasta con una espátula. Agregue el resto de los ingredientes secos y los huevos y la margarina y bata hasta que quede suave usando una batidora portátil.", "Con una cuchara, mezcle la torta en la lata de torta preparada y nivele la superficie con una espátula. Hornee en el horno durante 20-25 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio y el pastel se sienta elástico al tacto.", "Mientras el pastel esté todavía caliente, cepille el brandy sobre la parte superior del pastel. Deje que la torta se enfríe en la lata.", "Mientras tanto, para la mousse, coloque el chocolate en un recipiente y derrita sobre una cacerola de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Revuelva continuamente, teniendo cuidado de que el chocolate no se caliente demasiado. Dejar de lado para enfriar un poco.", "Batir la crema hasta que se formen picos suaves cuando se quite la batidora. Con cuidado, dobla el chocolate derretido hasta que esté suave y no rayado.", "Cuando el pastel se haya enfriado, y mientras aún esté en la lata, coloque la mousse de chocolate en la parte superior y nivele con una espátula. Cubra la lata de la torta con film transparente y deje enfriar en la nevera durante un mínimo de 4 horas, preferiblemente durante la noche, hasta que la crema esté firme.", "Para servir, retire cuidadosamente la torta de la lata y transfiérala a un plato plano. Espolvorea la parte superior con cacao en polvo, luego apila las frambuesas y los arándanos en el centro. Termine con una ligera capa de azúcar glasé. Cortar en trozos y servir con crema para verter."], "url": "www_bbc_co_uk_food_recipes_celebration_chocolate_26103", "title": "Torta de mousse de chocolate Celebration", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celebration_chocolate_26103_16x9.jpg", "isVegetarian": true, "recommendations": 0}]