[{"isVegetarian": true, "title": "Melon soup", "url": "www_bbc_co_uk_food_recipes_melonsoup_90686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ Galia melon, seeds removed", "1 orange, juice only", "2 tbsp chopped fresh mint"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Scoop out the flesh from the melon, roughly chop and place into a food processor along with the orange juice and mint. Reserve the melon husk. ", "Blend until smooth, then tip back into the melon husk and serve immediately."]}, {"isVegetarian": false, "title": "Melon with Serrano ham", "url": "www_bbc_co_uk_food_recipes_melonwithserannoham_83622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ cantalope melon, peeled and sliced", "2 slices Serrano ham", "freshly ground black pepper", "flatleaf parsley leaf, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the melon slices on a plate and lay over the slices of Serrano ham.", "Grind over some black pepper and garnish with the parsley leaf."]}, {"isVegetarian": false, "title": "Melon with parma ham", "url": "www_bbc_co_uk_food_recipes_melonwithparmaham_86017", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ cantaloupe melon, seeds and skin removed, quartered", "8 fresh basil leaves, plus an extra sprig, to garnish", "4 slices parma ham"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place two basil leaves on top of each piece of melon.", "Wrap a slice of parma ham around each piece of melon.", "To serve, place the parma ham-wrapped melon onto a serving plate and garnish with a sprig of basil."]}, {"isVegetarian": true, "title": "Melted cheese frittata with four kinds of mushroom", "url": "www_bbc_co_uk_food_recipes_meltedcheesefrittata_67960", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 oz (110 g) Fontina or Gruyère ", "12 oz (350 g) mixed mushrooms ", "1 tablespoon olive oil ", "8 large eggs ", "salt and freshly milled black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["First of all chop the mushrooms into roughly 1 inch (2.5 cm) chunks - it's going to look an enormous quantity at this stage, but they will lose approximately half their volume in the initial cooking. Now heat a teaspoon of the olive oil in a frying pan and, when it's hot, throw in the mushrooms and toss them around by shaking the pan. Don't worry that there is so little oil, because the mushrooms give off masses of juice once the heat gets to them. Season with salt and pepper, then turn the heat down to very low and just let the mushrooms cook gently, uncovered, so that all the juice evaporates and the flavour of the mushrooms becomes more concentrated. Leave them like that for 30 minutes, stirring them around once or twice.", "While they are cooking, cut two-thirds of the cheese into ¼ inch (5mm) cubes and grate the other third on the coarse blade of the grater. After that, break the eggs into a large bowl, whisk lightly with a fork and season well with salt and pepper. Then add three-quarters of the cooked mushrooms to the eggs, together with the cubed cheese. Place the rest of the mushrooms in a bowl covered with foil and keep them warm in the oven, along with the plates.", "Now wipe the pan clean with some kitchen paper and put it back on a medium heat, add the rest of the olive oil and, when it's hot, swirl it around the pan. Turn the heat down to its lowest setting and pour the egg mixture into the pan, scattering the grated cheese all over the surface. Now all you have to do is leave it alone and put a timer on forminutes.", "When 15 minutes have passed, turn the grill on to its highest setting and see how the omelette is cooking - it will probably take about 20 minutes in total to cook, but there should still be about 10 per cent of liquid egg left on the top. At that stage transfer the pan to the grill - not too close - and cook briefly to allow the liquid egg to set. This will take 20-30 seconds. Scatter the remaining cooked mushrooms over the top of the frittata and cut it into four wedges. Transfer the wedges to warm plates and serve immediately, because the egg will continue cooking even though the frittata is no longer in contact with the heat. I like to serve this with two salads - a plain, green lettuce salad and a tomato and basil salad."]}, {"isVegetarian": true, "title": "Gooey chocolate fondant puddings", "url": "www_bbc_co_uk_food_recipes_meltedchocolatefonda_77527", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meltedchocolatefonda_77527_16x9.jpg", "ingredients": ["85g/3oz caster sugar", "150g/6oz butter, chopped, plus extra for greasing", "150g/6oz dark chocolate (70% cocoa solids), roughly chopped", "3 free-range egg yolks", "3 whole free-range eggs", "1 tbsp plain flour", "double cream, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease 4 small dariole moulds or individual pudding basins.", "Place the sugar, butter and chocolate into a heatproof bowl over a pan of simmering water.", "Heat very gently until the butter and chocolate have melted, then remove from the heat.", "Whisk together until combined.", "Add the egg yolks and whole eggs and beat well.", "Fold in the flour.", "Pour into the dariole moulds or pudding basins and place in the fridge to chill for at least 20-25 minutes.", "Remove from the fridge and place onto a baking tray. Put straight into the oven and cook for 8-9 minutes.", "Allow to rest for a minute or two, then turn out onto individual serving plates.", "Serve with a dollop of double cream, if you like."]}, {"isVegetarian": true, "title": "Melting moments", "url": "www_bbc_co_uk_food_recipes_melting_moments_59381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter, softened", "100g/3½oz caster sugar", "1 free-range egg, beaten", "1 tsp vanilla extract", "250g/9oz self-raising flour", "140g/5oz oats"], "serves": "Makes 12-15 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/200F/Gas 4. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until light and fluffy.", "Beat in the egg until well combined. Stir in the vanilla and flour until well combined.", "Divide the dough into 12 equal pieces and roll each piece into a ball.", "Sprinkle the oats onto a plate, roll the balls in the oats and put them on the baking tray. Squash the balls slightly with your hands.", "Bake the biscuits for 12–15 minutes, or until pale golden-brown."]}, {"isVegetarian": false, "title": "Melting mushrooms", "url": "www_bbc_co_uk_food_recipes_meltingmushrooms_71049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 large open-cap or Portobello mushrooms, of roughly equal size", "4 tbsp vermouth or white wine", "2 garlic cloves, chopped", "2 tsp fresh thyme leaves", "salt ", "freshly ground black pepper", "100-125g/3½-4½oz Gruyere cheese, or other melting cheese, grated", "extra virgin olive oil", "fresh crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the barbecue.  ", "Cut the stem out of the mushrooms, then score with a knife over the grills, not cutting through to the other side.  ", "Choose pairs of equal size.  Lay one of each pair grill-side up on a work surface, then season to taste with salt and black pepper.  ", "Add one tablespoon vermouth or white wine, followed by a little garlic and thyme, and finishing with grated cheese.  ", "Place another mushroom on top and drive a cocktail stick or skewer through from the top to secure together.  ", "Brush all over with olive oil.", "Cook over hot coals, turning frequently and carefully, until very soft, juicy, and melting inside.  ", "Serve with crusty bread."]}, {"isVegetarian": false, "title": "Melton Mowbray pork pie", "url": "www_bbc_co_uk_food_recipes_meltonmowbrayporkpie_92224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/7oz lard", "50ml/2fl oz milk", "50ml/2fl oz water", "450g/1lb plain flour, plus extra for dusting", "salt and freshly ground black pepper", "1 free-range egg, beaten, for brushing", "900g/2lb pork bones", "2 pig's trotters", "2 large carrots, chopped", "1 onion, peeled, chopped", "2 sticks celery, chopped", "1 bouquet garni (bay, thyme, parsley; tied together with string)", "½ tbsp black peppercorns", "400g/14oz shoulder of pork, finely chopped", "55g/2oz pork belly, skin removed, minced", "55g/2oz lean bacon, finely chopped", "½ tsp ground allspice", "½ tsp freshly grated nutmeg", "salt and freshly ground black pepper", "piccalilli or chutney"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the lard, milk and water into a small pan and gently heat until the lard has melted.", "Sift the flour into a large bowl and season with salt and freshly ground black pepper and mix well.", "Make a well in the flour and pour in the warm lard mixture. Mix well to combine, until the mixture comes together to form a dough. Knead for a few minutes, then form into a ball and set aside. ", "For the pork jelly, place all of the pork jelly ingredients into a large pan and pour in enough water to just cover. Bring slowly to the boil, then reduce the heat to a simmer. Cook for three hours over a low heat, skimming off any scum that rises to the surface, then strain the stock through a fine sieve and discard the solids. ", "Pour the sieved stock into a clean pan and simmer over a medium heat until the liquid has reduced to approximately 500ml/1 pint.", "For the pie filling, place all of the pie filling ingredients into a large bowl and mix well with your hands. Season with salt and freshly ground black pepper. ", "Preheat the oven to 180C/350F/Gas 4. ", "Line a pork pie dolly (or a jam jar) with cling film to prevent the pastry from sticking. ", "Pinch off a quarter of the pastry and set aside. On a floured work surface, roll out the remaining three-quarters of pastry into a round disc about 3cm/1¼in thick. Place the pie dolly into the middle of the pastry circle and draw the edges of the pastry up around the sides of the dolly to create the pie casing. Carefully remove the dolly from the pastry once your pie casing is formed. ", "Roll the pork pie filling into a ball and carefully place into the bottom of the pastry case.", "Roll out the remaining piece of pastry into a circle large enough to cover the pastry case as a lid. ", "Brush the top inner parts of the pastry casing with some of the beaten egg and place the pastry circle on top. Pinch the edges of the pastry to seal the pie. Brush the top of the pie with the rest of the beaten egg, then bake in the oven for 45 minutes to one hour, or until the pie is golden-brown all over. ", "Remove the pie from the oven and set aside to cool. Cut two small holes in the top of the pork pie and pour in the pork jelly mixture (you may need to heat it through gently to loosen the mixture for pouring). Chill in the fridge until the jelly is set.", "To serve, cut the pie into slices and serve with piccalilli or chutney."]}, {"isVegetarian": true, "title": "Butternut squash and Stilton quiche with roasted sprouts", "url": "www_bbc_co_uk_food_recipes_membrillo_and_stilton_28987", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/membrillo_and_stilton_28987_16x9.jpg", "ingredients": ["1 medium butternut squash, peeled, deseeded and cut into small cubes", "1½ tbsp olive oil", "250g/9oz best-quality shortcrust pastry", "plain flour, for dusting", "200g/7oz Stilton, crumbled", "70g/2½oz membrillo (quince paste), cut into 1cm/½in dice", "3 free-range eggs", "150ml/5fl oz double cream", "150ml/5fl oz crème fraîche", "salt and freshly ground black pepper", "100g/3½oz caster sugar", "2 cinnamon sticks", "5 star anise", "3 tbsp lemon juice", "1 pomelo (approximately 900g/2lb)", "600g/1lb 5oz Brussels sprouts, trimmed", "250g/9oz shallots", "5 tbsp olive oil", "2 tbsp chopped coriander leaves", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Toss the squash in a bowl with the oil, a pinch of salt and black pepper. Spread out on a baking tray and roast for 30 minutes, or until golden-brown, turning once. Set aside to cool.", "Roll out the pastry on a floured work surface, roughly 3mm thick, and transfer it to a 24cm/9½in quiche tin. When lining, leave some pastry hanging over the edge. Prick the base of the pastry with a fork and chill in the fridge for 20 minutes. ", "Reduce the oven temperature to 160C/140C Fan/Gas 3. Line the pastry case with baking parchment, fill with baking beans and cook for 30-35 minutes. Remove the beans and paper, and cook for a further 10 minutes, or until the pastry is golden-brown. Increase the oven temperature to 180C/160 Fan/Gas 4. ", "Spread the squash over the pastry base, dot the Stilton between, and sprinkle the membrillo all over. ", "Place the eggs, cream and crème fraîche in a mixing bowl with a pinch of salt and some black pepper. Whisk together and pour over the squash, leaving some of the filling exposed. Place in the oven for about 40 minutes, or until the egg mixture has set. Leave to rest, then remove from the tin and keep warm or allow to cool to room temperature.", "Meanwhile for the pomelo, place the sugar, cinnamon and star anise in a small saucepan with 100ml/3½fl oz of water and bring to a light simmer. Cook for 1 minute, stirring until the sugar dissolves. Remove from the heat, stir in 1 tablespoon of the lemon juice and set aside to cool.", "Peel the thick skin off the pomelo. Segment the fruit, making sure to remove all the white membrane. Break into bite sized pieces and put in a shallow bowl. Pour the sugar syrup over the pomelo and leave to marinate for at least an hour, stirring occasionally. Remove the cinnamon and star anise and strain the pomelo reserving the juices. ", "For the sprouts, increase the oven to 220C/200C Fan/ Gas Mark 7. Halve the sprouts lengthways and cut the shallots so that they are similar size to the sprouts. Put in a baking tray with 3 tablespoons of the oil, ½ tablespoon of salt and some black pepper. Roast for about 20 minutes, or until the sprouts are golden brown but still retain a bite. Set aside to cool. ", "Just before serving, put the shallots, sprouts, pomelo and coriander in a large mixing bowl. Add the remaining olive oil and lemon juice, plus 1 tablespoon of the reserved pomelo syrup and ¼ tablespoon of salt. Gently mix, season to taste, you may wish to add another tablespoon of the pomelo syrup.", "Slice the quiche and serve alongside the Brussels sprouts. "]}, {"isVegetarian": false, "title": "Memphis ribs", "url": "www_bbc_co_uk_food_recipes_memphis_ribs_58449", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 full racks baby back ribs", "2 tbsp cracked black pepper", "1 tbsp fine sea salt", "1 tbsp demerara sugar", "1 tbsp paprika", "200ml/7fl oz apple juice", "100ml/3½fl oz Tennessee bourbon or rye whisky ", "75ml/2½fl oz vegetable oil", "1 tbsp paprika", "1 tbsp demerara sugar"], "serves": "Makes 2 full racks", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the ribs from the fridge half an hour before cooking and preheat the barbecue for indirect cooking. ", "Grind the rub ingredients to a fine dust in a pestle and mortar. Lay the ribs in a large roasting tin and coat evenly in the rub. Place the ribs on the barbecue meat-side up and cook for two hours.", "After two hours, begin the mopping process. Combine all of the mop ingredients in a jug and use a large brush to generously apply the mop to the surface of both racks. ", "Continue cooking for a further two hours, mopping every half an hour. To test that the ribs are done, give the end of one of the racks a gentle twist; if the meat gives easily and feels tender, they’re ready."]}, {"isVegetarian": false, "title": "Merguez sausages with chickpeas on toast", "url": "www_bbc_co_uk_food_recipes_merguezsausageswithc_88136", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil ", "1 onion, finely chopped", "1 garlic clove, finely chopped", "2 tsp harissa paste", "1 lemon, juice and zest only", "1 x 400g/14½oz can chickpeas, drained and rinsed", "150ml/5¼fl oz chicken stock", "1 tbsp chopped fresh parsley", "4 pieces sourdough bread", "dash olive oil ", "8 grilled merguez sausages, cooked and kept warm"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan and add the onion. Fry the onion for five minutes or so until softened, but not browned.", "Add the garlic, harissa, lemon juice and lemon zest and cook for a further three minutes.", "Add the chickpeas and stock, bring gently to the boil and simmer for five minutes. Sprinkle over the chopped parsley.", "Meanwhile, for the toast, heat a griddle pan until hot. Brush the bread with olive oil and griddle for two minutes on each side.", "Serve the chickpeas on the griddled bread, with the merguez sausages arranged on top."]}, {"isVegetarian": false, "title": "Merguez sausages with harissa mayonnaise", "url": "www_bbc_co_uk_food_recipes_merguezsausageswithh_91465", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 merguez sausages", "1 lemon, juice and zest", "150g/5oz couscous", "1 red onion, finely chopped", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "4 tbsp chopped fresh coriander leaves ", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz vegetable oil ", "15g/½oz dried red chillies, soaked in cold water and roughly chopped", "50g/2oz fresh red chillies, seeds removed, roughly chopped", "2 tsp ground cumin", "2 tsp ground caraway seeds", "1 tbsp smoked sweet paprika", "2 garlic cloves", "2 tbsp tomato purée", "3 tbsp red wine vinegar", "4 tbsp olive oil", "4 crusty white rolls (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking hot. Cook the merguez sausages on the hot griddle for 2-3 minutes on all sides, turning regularly, until the sausages are cooked through. Squeeze over a little of the lemon juice.", "Place the couscous into a bowl with the lemon zest, the remaining lemon juice, the red onion and olive oil. Pour over enough boiling water to cover the couscous by 1cm/½in. Cover with cling film and set aside for five minutes, or until the liquid has been absorbed by the couscous. Fluff the couscous with a fork and season to taste with salt and freshly ground black pepper. Add the coriander and mix well.", "For the mayonnaise, place the egg yolks, vinegar and mustard into the bowl of a food processor and blend until pale and creamy. With the motor running, pour in enough vegetable oil, in a steady stream, to form a thick mayonnaise.", "For the harissa, place all the harissa ingredients into a clean food processor and blend to form a smooth paste.", "For the harissa mayonnaise, add 1-2 spoonfuls of the harissa to the mayonnaise (or more, to taste). Stir until well combined.", "Serve the merguez sausages in a bread roll or with the couscous, with a spoonful or two of the harissa mayonnaise alongside."]}, {"isVegetarian": false, "title": "Baked Alaska with passion fruit", "url": "www_bbc_co_uk_food_recipes_meringue_baked_alaska_38214", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 medium egg whites", "90g/3¾oz caster sugar", "90g/3¾oz icing sugar, sieved", "1 large sponge flan case, cut in half widthways to about 5mm/¼in thick", "4 tbsp passion fruit liqueur", "500ml/18 fl oz vanilla ice cream", "50ml/2floz water", "50g/1¾oz caster sugar", "200ml/7fl oz passion fruit purée", "½ tsp arrowroot", "2 passion fruit, halved"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Whisk the egg whites with the caster sugar in a clean bowl until the mixture forms stiff peaks. ", "Add the icing sugar and whisk again until the mixture forms stiff peaks and is smooth and shiny. ", "Using a 7.5cm/3in cookie cutter, cut out four sponge discs.", "Place the sponges onto serving plates and spoon over the passion fruit liqueur.", "Top each one with a large scoop of ice cream.", "Transfer the meringue mixture into a piping bag and pipe the meringue around the ice cream, covering from top to bottom.", "Glaze the meringue with a blow torch, or briefly in a hot oven.", "For the passion fruit sauce, place the water and caster sugar into a saucepan and heat until the sugar has melted and the mixture is just simmering.", "Add the passion fruit purée and mix well then whisk in the arrowroot and cook until just thickened.", "Remove from the heat and stir in the seeds from the halved passion fruit.", "To serve, spoon the passion fruit sauce around the edge of each individual baked Alaska."]}, {"isVegetarian": true, "title": "Meringue gelato cake with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_meringue_gelato_cake_38183", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringue_gelato_cake_38183_16x9.jpg", "ingredients": ["300ml/10½fl oz double cream", "30g/1oz dark chocolate (70% cocoa solids, minimum)", "1 tbsp Elisir San Marzano (or coffee liqueur and/or rum)", " 8 meringue nests", "250ml/9fl oz double cream", "125g/4½oz dark chocolate (70% cocoa solids, minimum), finely chopped or in buttons made for melting", "2 tbsp Elisir San Marzano (or coffee liqueur and/or rum)", "250g/9oz raspberries, to serve"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Line a 450g/1lb loaf tin with cling film, making sure you have enough overhang to cover the top later.", "Whip the cream until thick but still soft.", "Chop the chocolate very finely so that you have a pile of dark splinters, and fold them into the cream, along with the liqueur.", "Now, using brute force, crumble the meringue nests and fold these in, too.", "Pack this mixture into the prepared loaf tin, pressing it down with a spatula as you go, and bring the cling film up and over to seal the top, then get out more cling film to wrap around the whole tin. Freeze until solid, which should take around eight hours or overnight.", "About an hour before serving, make the chocolate sauce. Pour the cream into a saucepan and add the tiny bits of chocolate. Put over a gentle heat and whisk as the chocolate melts, taking the pan off the heat once the chocolate is almost all melted. If the mixture gets too hot, the chocolate will seize, whereas it will happily continue melting in the warm cream off the heat.", "Add the liqueur, still off the heat, and whisk again to amalgamate the sauce completely. Pour into a jug, whisking every now and again until it cools to the desired temperature. If you feel the sauce has thickened too solid, then stand the jug in a bowl of warm water for a few minutes, whisking frequently, before pouring. Or I whisk in a shot - about two tablespoons - of hot espresso.", "To serve the gelato cake, unwrap the outer layer of cling film, then unpeel the top and use these bits of long overhanging wrap to lift out the ice-cream brick. Unwrap and unmould it onto a board and, using a sharp, heavy knife (dipped in hot water between each slice) cut the frozen meringue cake into slabs to serve. I like to zig-zag a little chocolate sauce over each slice and sprinkle a few raspberries alongside on each plate."]}, {"isVegetarian": true, "title": "Meringue tranche with berries and cream", "url": "www_bbc_co_uk_food_recipes_meringue_tranche_with_82125", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringue_tranche_with_82125_16x9.jpg", "ingredients": ["4 free-range egg whites", "225g/8oz caster sugar", "300ml/½ pint pouring double cream", "200g/7fl oz full-fat Greek yoghurt", "900g/2lb raspberries and blueberries", "icing sugar, to dust"], "serves": "Serves 8-10", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ½. Line a large baking tray with non-stick baking parchment. Mark two rectangles 12x40cm/4½x16in long on the parchment in pencil and turn the paper over.  ", "Place the egg whites in a spotlessly clean bowl and whisk with an electric whisk until they form stiff peaks when the whisk is removed from the bowl. Continue whisking as you add the sugar, one teaspoonful at a time, until all the sugar is incorporated. The meringue will then become shiny and will hold stiff peaks when the whisk is lifted from the bowl.", "Place the mixture in a large plastic piping bag and snip 1cm/½in off the end. Pipe the meringue into the rectangle shapes on the paper, then pipe little blobs along the long sides on top to make a rim. Or if liked, spread the meringue into the rectangular shapes.", "Bake for 1½-2 hours, or until the meringue can be lifted easily off the paper without sticking. Turn off the oven, leave the door ajar and leave until the meringues are cold.", "Just before serving, whip the cream in a bowl until it just holds its shape. Fold in the yoghurt.  Spread the cream mixture onto the meringues and top with alternate raspberries and blueberries. Dust with icing sugar. "]}, {"isVegetarian": true, "title": "Meringue roulade with raspberries and lemon syllabub filling", "url": "www_bbc_co_uk_food_recipes_meringuerouladewithr_67265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 eggs, whites only", "225g/8oz caster sugar", "55g/2oz shredded coconut or almonds", "1 punnet raspberries", "570ml/1 pint double cream, chilled", "2 lemons, juice and zest ", "1 orange, juice and zest ", "3-5 tbsp clear honey", "2 tbsp brandy or sherry (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Line a baking sheet with non-stick silicone paper.", "In a clean bowl whisk the egg white until very stiff. This is best done with a freestanding electric mixer.", "Now add the sugar one third at a time, whisking well between each batch.", "Once the sugar has all been added continue to whisk until the mixture is very thick and glossy.", "Spread over the prepared baking sheet, then sprinkle liberally with the coconut or almonds.", "Bake in the oven for 15-20 minutes or until golden brown and just firm to the touch.", "Remove from the oven and at once turn on to a piece of greaseproof paper or a clean tea towel.  ", "Leave for 15 minutes then remove the backing paper.", "Make the syllabub while the meringue is cooking. Mix the zest, juice and honey, stirring until the honey has dissolved.", "Place this mixture with the chilled cream in a large bowl then whisk until floppy.", "When the meringue is cool spread the syllabub over, place the raspberries on top and roll up. Chill until needed."]}, {"isVegetarian": true, "title": "Meringues with strawberries and cream", "url": "www_bbc_co_uk_food_recipes_meringues_with_48499", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range eggs, whites only", "200g/7oz white caster sugar", "400ml/14fl oz double cream", "2 tbsp icing sugar", "250g/9oz strawberries, hulled and quartered"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringue, preheat the oven to 100C/200F/Gas ¾. Line a baking tray with baking parchment. You may want to draw circles on the paper to help keep your meringues the same size.", "Place the egg whites into a clean glass or metal bowl and whisk until soft peaks form when the whisk is removed.", "Gradually add the sugar and continue to whisk until stiff peaks form when the whisk is removed.", "Spoon into a piping bag fitted with a large plain or star nozzle.", "Pipe into 16 small rounds onto the prepared baking tray.", "Place in the oven and bake for 20 minutes.", "Turn the oven off but leave the meringues in the oven for at least two hours.", "When crisp, remove from the oven", "For the filling, whisk the cream and icing sugar together until soft peaks form when the whisk is removed. Fold in half the strawberries.", "Place a meringue onto a serving plate. Spread the whipped cream lightly over the meringue to cover totally, and top with more strawberries. Place another meringue on top of the strawberries."]}, {"isVegetarian": true, "title": "Meringues with clotted cream and strawberries", "url": "www_bbc_co_uk_food_recipes_meringueswithclotted_516", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringueswithclotted_516_16x9.jpg", "ingredients": ["6 egg whites, at room temperature", "350g/12oz caster sugar", "300ml/½ pint clotted cream", "900g/2lb fresh small strawberries"], "serves": "Makes 10 meringues", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Put the egg whites into a large clean bowl and whisk to form soft peaks. Add 110g/4oz of the sugar and continue to whisk. ", "Gradually add another 110g/4oz of sugar, a spoonful at a time, until the mixture forms stiff peaks.", "Gently fold in the remaining sugar.", "Shape 20 large spoonfuls of the meringue onto 2 baking sheets lined with non-stick baking paper and bake in the oven for 15 minutes.", "Lower the oven temperature to 110C/225F/Gas ¼ and cook for a further 2-3 hours until very crisp and dry. ", "Leave to cool, then store in an air tight tin.", "Serve with the clotted cream and strawberries"]}, {"isVegetarian": false, "title": "Hake with chorizo and potatoes (Merluza à la Gallega)", "url": "www_bbc_co_uk_food_recipes_merluzaalagallega_11637", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/merluzaalagallega_11637_16x9.jpg", "ingredients": ["50ml/2fl oz olive oil", "2 onions, sliced thinly", "6 garlic cloves, sliced", "2 tsp paprika", "70g/3oz chorizo, cut into cubes", "100g/4oz padron peppers or other tiny green peppers, sliced (or 1 large pepper, diced)", "900g/2lb floury potatoes, scraped and halved lengthways", "85ml/3fl oz dry white wine", "300ml/10fl oz water", "8 x 100g/4oz or 4 x 225g/8oz hake steaks", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a terracotta cazuela or a shallow flameproof casserole.", "Add the onions and garlic and cook gently until soft.", "Add the paprika and fry for 2-3 minutes, then add the chorizo sausage and green peppers and fry for another 3-4 minutes.", "Stir in the potatoes, then pour in the wine and water, season with some salt and pepper and simmer for about 10 minutes, until the potatoes are just tender and the liquid has reduced a little.", "Season the hake steaks well on both sides. Put them on top of the potatoes, cover and simmer for 8-10 minutes, until the hake is cooked through."]}, {"isVegetarian": true, "title": "Meringues with summer berries", "url": "www_bbc_co_uk_food_recipes_meringueswithsummerb_89162", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringueswithsummerb_89162_16x9.jpg", "ingredients": ["4 free-range egg whites", "pinch salt", "225g/8oz caster sugar", "4 tsp cornflour", "2 tsp raspberry vinegar", "½ tsp vanilla extract", "300ml/10½fl oz double cream", "mixed summer fruits and berries, to taste"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 130C/275F/Gas 1.", "Beat the egg whites and salt together in a bowl until soft peaks form when the whisk is removed. ", "Add the sugar one tablespoon at a time, whisking constantly, until all the sugar is incorporated and stiff peaks form when the whisk is removed.", "Add the cornflour, raspberry vinegar and vanilla extract and whisk to combine.", "Drop spoonfuls of the meringue mixture into little heaps onto a greased, baking parchment-lined baking sheet and transfer to the oven to bake for 1-1¼ hours, or until the outside of the meringues is crisp and the inside is marshmallow-like.", "To serve, place one or two meringues into each dish and top with whipped cream and the summer berries of your choice."]}, {"isVegetarian": true, "title": "Meringue toffee baked Alaska with toffee sauce", "url": "www_bbc_co_uk_food_recipes_meringuetoffeebakeda_86358", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz water", "225g/8oz white caster sugar", "4 free-range egg whites", "75g/3oz hazelnuts, finely chopped", "1 small ready-made chocolate sponge", "500ml/1lb 2oz vanilla ice cream", "500ml/1lb 2oz toffee ice cream", "500ml/18fl oz double cream", "175g/6oz demerara sugar", "175g/6oz butter", "1 tbsp golden syrup", "1 tbsp black treacle"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked Alaska, place the water and sugar into a pan and bring to the boil. Skim the surface and wipe the sides of the pan with a wet pastry brush to remove any sugar crystals, then increase the heat so that the syrup boils rapidly.", "Insert a sugar thermometer. When the sugar mixture reaches 110C/225F beat the egg whites with an electric mixer until stiff peaks are formed.", "When the sugar mixture reaches 121C/250F remove from the heat. It will have formed a syrup.", "Turn the electric mixer onto the lowest setting then pour the sugar syrup into the egg whites in a thin, steady stream, continuing to beat until all the syrup is incorporated.", "Continue to beat at a slow speed until the mixture is almost cold, this can take up to 15 minutes.", "Fold the hazelnuts into the egg white mixture then spoon into a piping bag fitted with a plain nozzle.", "Place the chocolate sponge onto a serving plate and top with alternate scoops of vanilla and toffee ice cream.", "Pipe the meringue around the ice cream, covering completely from top to bottom. Glaze the meringue with a mini-blowtorch, or bake briefly in a very hot oven.", "For the toffee sauce, pour the cream into a pan and heat gently. Add the sugar and butter and whisk until melted. Whisk in the syrup and treacle. ", "To serve, cut wedges of baked Alaska and place on serving plates. Drizzle the sauce over the top."]}, {"isVegetarian": true, "title": "Merry marmalade", "url": "www_bbc_co_uk_food_recipes_merry_marmalade_90280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small grapefruit ", "2 lemons ", "1 sweet or Seville orange ", "1.75 litres/3 pints water ", "1.4kg/3lb 1oz granulated sugar ", "75ml/5 tbsp whisky, rum or brandy"], "serves": "Makes approx. 2.25kg/5lb", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Juice the fruit and pour the juice into a large, lidded pan with a capacity of 6-8 litres/10-14 pints. Add the water.", "Scrape out the inner membranes and pips from the fruit with a small sharp knife. Put the membranes into a food processor or mini-chopper and chop finely. Put the chopped membranes, and any pips, into a muslin bag or a piece of muslin tied with string. Add to the pan. ", "Shred the peel to your preferred thickness and add it to the pan. Set aside to allow the peel to soak for a few hours or, if possible, overnight.", "Bring the lidded pan to boil, reduce the heat and simmer very gently for two hours. The peel should be very tender. ", "Meanwhile, preheat the oven to 140C/275F/Gas 1. Pour the sugar into a baking dish and warm in the oven for a few minutes. ", "Remove the muslin bag from the pan and squeeze the liquid from the bag into a bowl. Pass through a sieve and add to the pan. ", "Weigh the contents of the pan - it should be no more than 1.4kg/3lb 1oz. If you have more than this, return the contents to the pan and simmer to reduce the liquid until the correct weight is achieved.", "Add the warmed sugar to the pan and stir until dissolved. Gradually bring the pan to a rolling boil. After seven minutes, test the setting point by scooping out a large spoonful of the marmalade. Allow the mixture to cool a little, then slowly pour it back into the pan. If it is at the setting point, the drops will run together to form a hanging flake (this is known as the flake test). It can take up to 30 minutes to reach setting point, so keep testing.", "Leave the marmalade to cool for 5-10 minutes (a skin should form on the surface). Remove any scum from the surface and add the spirit of your choice to the pan. Gently stir the marmalade to evenly distribute the peel and the alcohol.", "Pour the marmalade into sterilised jars and seal. Leave the jars upright and undisturbed to set."]}, {"isVegetarian": true, "title": "Mexican bean stew", "url": "www_bbc_co_uk_food_recipes_mexican_bean_stew_75910", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mexican_bean_stew_75910_16x9.jpg", "ingredients": ["low-calorie cooking spray", "1 onion, thinly sliced", "2 garlic cloves, crushed", "1 yellow pepper, deseeded and cut into 3cm/1in chunks", "½ tsp hot chilli powder", "1 tsp ground cumin", "1 tsp ground coriander", "400g tin chopped tomatoes", "2 tbsp tomato purée", "400g tin mixed beans, drained and rinsed", "125g/4½oz wholegrain long-grain rice, to serve", "100g/3½oz fat-free Greek yoghurt, to serve", "1 lime, cut into wedges, to serve", "salt and freshly ground black pepper", "1 tomato, roughly chopped", "4 tbsp roughly chopped freshly coriander", "2 spring onions, thinly sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a large frying pan with oil and place over a medium heat. Add the onion and garlic and cook gently for three minutes, stirring regularly. Add the pepper and cook for two minutes.", "Stir in the spices and cook for a few seconds, then add the tomatoes, tomato purée and mixed beans. Pour over 300ml/10fl oz cold water and bring to a gentle simmer. Season with a little salt and lots of ground black pepper and cook for 30 minutes, stirring occasionally until thick.", "Meanwhile half-fill a medium saucepan with water and bring to the boil. Add the rice and return to the boil. Cook for 25 minutes, or until tender, stirring occasionally. ", "To make the salsa, mix the tomato, coriander and spring onions together in a bowl.", "Drain the rice and divide between two plates. Spoon the beans over and scatter with the salsa. Serve with the yoghurt and lime wedges."]}, {"isVegetarian": true, "title": "Mexican black bean Buddha bowl", "url": "www_bbc_co_uk_food_recipes_mexican_black_bean_96128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "1 spring onion, thinly sliced", "½ garlic clove, thinly sliced", "1 tsp cumin seeds", "pinch dried chilli flakes", "400g tin black beans, drained and rinsed ", "200ml/7fl oz veg stock (made from ½ stock cube or ½ tsp bouillion powder)", "140g/5oz brown rice", "small handful fresh coriander, finely chopped", "1 lime", "½ red pepper, thinly sliced", "2 small tomatoes, diced", "198g tin sweetcorn, drained and rinsed", "½ avocado, chopped, optional", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the spring onion, garlic and spices and cook for 1–2 minutes, until fragrant. Add the beans and stock and bring to the boil. Reduce the heat and simmer with the lid off for 25 minutes, stirring occasionally. ", "Meanwhile, cook the rice according to the packet instructions. Stir in the coriander and the juice of half the lime and season. ", "Arrange the rice in the bottom of a bowl and top with the black beans, red pepper, tomatoes, sweetcorn and avocado, if using. Serve with a lime wedge on the side. "]}, {"isVegetarian": false, "title": "Mexican crisp pressed pork with prunes, sherry vinegar and cauliflower cream", "url": "www_bbc_co_uk_food_recipes_mexican_crisp_pressed_10726", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110ml/4fl oz sherry vinegar", "150g/5½oz prunes", "110ml/4fl oz sherry", "30g/1¼oz panko breadcrumbs", "1 bunch fresh flatleaf parsley", "1 tbsp grated lemon zest", "salt, to taste", "1 garlic clove, crushed", "3 tbsp rapeseed oil", "1 onion, roughly chopped", "2 carrots, roughly chopped", "2 sticks celery, roughly chopped", "1 leek, roughly chopped", "4 garlic cloves", "1 tbsp chopped fresh thyme", "375ml/13fl oz white wine", "50ml/2fl oz Madeira", "2 litres/3½ pints chicken stock", "3 cardamom pods", "2 star anise", "½ orange, zest only", "2 apples, cored and blended to a purée", "500ml/18fl oz tomato juice", "700g/1lb 9oz pork shoulder", "300g/11oz pork belly", "2 green chillies, finely chopped", "1 bunch coriander, chopped", "2 banana shallots, finely chopped", "malt vinegar, to taste", "salt and freshly ground black pepper", "2–3 free-range eggs, whites only, lightly beaten", "110g/4oz panko breadcrumbs", "2–3 tbsp olive oil", "2–3 tbsp English mustard", "¼ head of cauliflower, grated", "1 tbsp sesame seeds, toasted", "salt, to taste", "½ head cauliflower, cut into florets", "250ml/9fl oz milk", "salt, to taste", "150ml/5fl oz double cream", "1 tsp lemon juice", "2–3 tbsp baby cress or herbs, such as parsley or coriander", "pork scratchings"], "serves": "Serves 4–6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the prunes, heat the vinegar in 300ml/11fl oz water then pour over prunes with the sherry. Leave to soak overnight.", "For the persillade, blend together the breadcrumbs and parsley until fine textured, add the crushed garlic, lemon zest and salt and mix through.", "For the braised pork, preheat the oven to 140C/275F/Gas 1.", "Heat the oil in a large heavy based pan. Add the onions, carrots, celery, leeks, garlic and thyme and cook, stirring occasionally, until caramelised all over. ", "Add the white wine and Madeira to the pan and scrape the cooked bits from the bottom of the pan with a wooden spoon. Simmer until reduced in volume by half.", "Add the stock, cardamom, star anise, orange zest, apple purée and tomato juice. ", "Bring to the boil, add the pork shoulder and belly, return to the boil then cover and place in the oven for 3-4 hours.", "When tender and cooked through, remove from the oven and allow to cool down slightly. ", "While the meat is still warm, remove it from the cooking liquor and pull the meat into small strands using your hands or two forks. ", "Put this pulled meat into a bowl with some of the fat from the cooking liquor. The cooking liquor can be reserved: make a sauce by simmering some of the liquor to reduce it in volume to sauce consistency ready for serving.", "For the pressed pork, season the pulled pork with the chopped chillies, coriander, shallots, malt vinegar, salt and freshly ground black pepper. Taste and adjust the seasoning if necessary.", "Roll out two large layers of cling film onto a clean work surface. Place the cooked, seasoned meat in a line, approximately 5cm/2in deep, 4cm/1¾in high and 15cm/6in long, leaving a space at each end.", "Wrap the meat in the cling film, then roll the cling film into a tight sausage shape and tie each end securely. ", "Prick all over with a sharp pointed knife. Refrigerate until set.", "Preheat the oven to 180C/350F/Gas 4.", "Cut the chilled cling film roll into 5cm/2in wide cylindrical shapes. ", "Remove the cling film and brush the meat with beaten egg all the way around the rounded sides of the roll, but not the flat ends, then roll in panko breadcrumbs, keeping the flat ends clear of crumbs.", "Heat a frying pan until medium hot, add a little olive oil and colour the breadcrumbed side of the pork until golden-brown all around.", "Place in the oven and heat through.", "Remove from the oven and spread a thin layer of mustard over the top flat surface and sprinkle quite generously with the prepared persillade, then return to the oven for a further five minutes.", "For the cauliflower couscous, mix everything together and add salt to taste.", "For the cauliflower cream, heat the cauliflower, milk and salt in a saucepan until simmering and cook for 12–15 minutes.", "When cooked and softened, remove the cauliflower from the milk but reserve the milk.", "Purée the cauliflower with some of the cooking liquor and extra double cream if desired.", "Taste and adjust seasoning; lemon juice can be added here if needed.", "To serve, heat the cauliflower purée through until hot, and spread across base of serving plates, then sprinkle the cauliflower couscous onto the purée. ", "Sit the pork in the centre of the plate on top of the cauliflower. Place three prune halves on each plate around the pork.", "Garnish with baby herbs, cress and pork scratchings and pour some sauce around the outside. "]}]