[{"ingredients": ["1.5kg / 3lb 5oz carne de caza mixta, deshuesada y en cubitos, como conejo, faisán, perdiz", "300 g / 10½ oz de panceta de cerdo picada", "150 g / 5½ oz de albaricoques secos", "Avellanas de 75g / 2½oz, más o menos picadas", "75 g / 2½ oz de pistachos sin sal", "½ cucharadita de nuez moscada molida", "2 manojos de salvia fresca, hojas recogidas", "2 hojas de gelatina", "200ml / 7fl oz de caldo de pollo caliente", "sal y pimienta negra recién molida", "Harina normal de 340g / 12oz, más extra para espolvorear", "Harina de pan blanco fuerte 75g / 2½oz", "55 g / 2 oz de mantequilla sin sal fría, cortada en aproximadamente 1 cm / ½ en dados", "½ cucharadita de sal", "75 g / 2½ oz de manteca de cerdo, más extra para engrasar", "1 yema de huevo, batida, para glasear", "150g / 5½oz de azúcar moreno claro y suave", "50g / 1¾oz sultanas", "50g / 1¾oz pasas de Corinto", "125ml / 4fl oz de vinagre de malta", "2 comiendo manzanas, sin corazón, más o menos picadas", "3 tomates, toscamente picados", "1 chalote, finamente picado"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Engrase un molde para pastel con forma de resorte de 25 cm / 10 pulgadas, de unos 8 cm / 3 pulgadas de profundidad, con manteca.", "Para el relleno, en un tazón grande, mezcle el juego de carne, panceta picada, albaricoques secos, avellanas y pistachos. Sazonar con sal, pimienta negra recién molida y nuez moscada y mezclar de nuevo.", "Para la masa de la masa de agua caliente, mezcle las harinas en un recipiente, luego frote la mantequilla ligeramente con los dedos. Caliente 200 ml / 7 fl oz de agua, la sal y la manteca en una olla hasta que hierva. Vierta el líquido sobre la harina y mezcle bien con una cuchara. Tan pronto como esté lo suficientemente frío para manipularlo, colóquelo en una superficie ligeramente enharinada y amaselo hasta que tenga una masa homogénea.", "Corte dos tercios de la masa y extiéndala sobre la superficie enharinada usando un rodillo, luego úsela para revestir la lata preparada, dejando cualquier exceso colgando sobre el borde. Asegúrate de que no haya grietas en la masa. Estirar los pasteles restantes y establecer el lado.", "Coloca una cuarta parte del relleno en la caja de la pastelería, luego coloca una línea de hojas frescas de salvia en la parte superior. Repita tres veces, hasta que todo el relleno se haya agotado. Presione hacia abajo para nivelar la superficie.", "Cepille el borde de la masa con la yema de huevo batida, luego coloque la masa reservada en la parte superior. Prensar los bordes para sellarlos y cortar el exceso de masa. Cepille la parte superior con más yema de huevo y haga un agujero en el centro de la tapa para que salga el vapor y para que se vierta la mezcla de gelatina.", "Coloque la lata en una bandeja para hornear y hornee la torta durante 30 minutos. Apague el horno a 160C / 140C Fan / Gas 3 y hornee durante 1¾ horas más. Transfiera el pastel a una rejilla y déjelo enfriar durante 10 minutos.", "Remoje la gelatina en un recipiente poco profundo de agua fría durante 5 minutos. Exprima el exceso de agua y mezcle la gelatina en el caldo caliente en una jarra. Con cuidado, vierta el caldo en el orificio de la tapa del pastel, llenando los espacios. (Esto debe hacerse cuando el pastel está caliente, si lo hace, cuando esté frío, la gelatina se colocará en la parte superior y no se mojará). Deje que fragüe durante la noche antes de servir.", "Para la salsa picante, caliente una sartén grande hasta que esté caliente. Agregue el azúcar, pasas y grosellas y caliente hasta que el azúcar se derrita. Agregue el vinagre y cocine hasta que se haya disuelto y comience a caramelizar. Agregue las manzanas, los tomates y la chalota y cocine por 10 minutos, o hasta que las manzanas estén tiernas y la mezcla se haya espesado. Retire del fuego y transfiera a un recipiente esterilizado.", "Para servir, corte el pastel de cerdo en rodajas finas y colóquelo en un plato para servir. Poner el chutney al lado."], "url": "www_bbc_co_uk_food_recipes_game_raised_pie_with_87444", "title": "Pastel de juego levantado con chutney de manzana", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de panceta picada", "Juego mixto 300 g / 10½ oz picada (como carne de venado, faisán y pato silvestre)", "2 huevos de gallinas camperas, más 1 yema de huevo de gallinas camperas, batida, para lavar huevos", "pequeñas hojas de tomillo fresco", "50 g / 1¾oz de castañas cocidas, finamente picadas", "pizca de pimienta inglesa", "1 x 500g / 1lb 2oz paquete hojaldre", "harina común, para quitar el polvo", "sal y pimienta negra recién molida", "1 cucharada de mantequilla", "100 g / 3½ oz de champiñones silvestres", "Crema doble 50ml / 2fl oz", "1 cucharadita de mostaza Dijon", "2 nueces en vinagre, escurridas, picadas", "2 hojas de diente de león"], "method": ["Para el rollo de salchicha del juego, precaliente el horno a 180C / 160C Fan / Gas 4.", "En un tazón grande, mezcle el cerdo picado y el juego picado. Mezcle los huevos, el tomillo, las castañas y la pimienta de Jamaica hasta que estén bien combinados, luego condimente, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Estire la masa de hojaldre sobre una superficie de trabajo ligeramente enharinada hasta obtener un rectángulo de aproximadamente 30x20 cm / 12x8 pulgadas.", "Forme la mezcla de carne picada en una salchicha de aproximadamente la misma longitud que el borde más largo del rectángulo. Colóquelo encima de la masa, luego enrolle la masa alrededor de la mezcla de relleno, presione los extremos para sellar y prensar con un tenedor.", "Cepille la parte superior del rollo de salchicha por todas partes con la yema de huevo batida, luego hornee en el horno durante 15-20 minutos, o hasta que la masa se haya levantado y esté dorada.", "Para la guarnición, caliente la mantequilla en una sartén grande a fuego medio. Agregue los champiñones y freír durante 4-5 minutos, o hasta que toda el agua haya sido liberada de los champiñones y se haya evaporado.", "Agrega la crema doble y lleva la mezcla a ebullición.", "Transfiera el contenido de la bandeja a un procesador de alimentos y mezcle con un puré grueso. Agregue la mostaza y el pulso para combinar.", "Para servir, corte el rollo de salchicha en rebanadas gruesas y divida las rebanadas por igual entre 2 platos. Cucharee la guarnición de champiñones al costado. Adorne el rollo de salchicha con algunas piezas de nuez en escabeche y una hoja de diente de león."], "url": "www_bbc_co_uk_food_recipes_game_sausage_roll_with_85483", "title": "Juego de rollo de salchicha con setas y nueces en escabeche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["675g / 1½lb de carne de caza mixta, como faisán, perdiz, liebre y conejo, deshuesada", "Filete de carne de venado de 225g / 8oz cortado en cubos de 2.5cm / 1in", "2 cucharadas de aceite de girasol", "2 cebollas rojas, peladas y en rodajas", "Tocino rayado ahumado 120g / 4oz, deshilachado y picado", "Setas de castaña 120 g / 4 oz, limpiadas y en rodajas", "1 diente de ajo, pelado y aplastado", "Harina normal de 30g / 1oz", "1 hoja de laurel", "1 naranja, ralladura y jugo", "1 cucharada de jalea de grosella", "300 ml / ½ pinta de caldo de pollo", "300ml / ½ pinta de vino tinto", "Hojaldre de 340g / 12oz", "Sal y pimienta", "huevo batido, para glasear"], "method": ["Calentar una cucharada de aceite y dorar el juego y carne de venado en tandas hasta que estén bien doradas. Mantente a un lado.", "Caliente el resto del aceite y cocine las cebollas durante cinco minutos hasta que comience a ablandarse. Agregue el ajo, el tocino y los champiñones y cocine por otros 2-3 minutos.", "Agregue la harina y cocine durante dos minutos. Sazonar bien y agregar la hoja de laurel, la ralladura de naranja y el jugo, la jalea de grosella, el caldo y el vino.", "Llevar a ebullición, agregar la carne y cocinar a fuego lento durante 40-50 minutos hasta que la carne esté tierna. Guay.", "Caliente el horno a 200C / 400F / Gas 6.", "Pon la mezcla de carne en un plato para pastel. Estirar la masa para hacer una tapa y unirla al plato. Decora con los adornos de pastelería y corta un agujero de vapor en el centro. Glaseado con huevo batido.", "Hornee durante 20 minutos y luego reduzca el fuego a 180 ° C / 350 ° F / Gas 4 durante 30 minutos hasta que la masa esté dorada y se haya levantado y el relleno esté bien caliente."], "url": "www_bbc_co_uk_food_recipes_gamepie_8555", "title": "Pastel de juego", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gamepie_8555_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "4 papas negras de Shetland, en rodajas finas"], "method": ["Calentar una olla de fondo grueso, un tercio lleno de aceite vegetal, hasta que una migaja de pan chisporrotee en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje desatendido).", "Agregue las rodajas de papa y cocine durante 1-2 minutos, hasta que estén doradas. Retire y drene las toallas de cocina.", "Servir en un tazón grande."], "url": "www_bbc_co_uk_food_recipes_gamechips_79105", "title": "Fichas de juego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 chile rojo seco", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de hinojo", "½ cucharadita de semillas de comino", "¼ cucharadita de pimienta negra", "1cm / ½ en rama de canela", "¼ cucharadita de semillas de carom o semillas de ajwain", "4 cucharadas de aceite vegetal o de maíz", "¼ cucharadita de semillas de fenogreco", "2 chiles rojos secos, cada uno dividido en 2-3 piezas", "½ cucharadita de semillas de cebolla negra", "700g / 1lb 9 oz carne de calabaza, pelada, cortada en cubos de 1cm / ½ en", "1½ cucharadita de sal", "1 cucharadita de chile rojo en polvo", "½ cucharadita de cúrcuma molida", "3-5 cucharadas de azúcar", "2 cucharaditas de polvo de mango seco (amchoor), disponible en supermercados indios (o encurtido de mango de un tarro)", "3 cucharadas de aceite vegetal o de maíz", "¼ cucharadita de clavo de olor", "3 vainas de cardamomo verde, ligeramente trituradas", "1 hoja de laurel fresca o hoja de canela", "2 cebollas medianas, peladas, 1½ cebollas finamente picadas, ½ cebolla cortada en rodajas de 1cm / ½ en rodajas", "2 dientes de ajo, pelados, finamente picados", "Jengibre fresco de la raíz de los 2.5cm / 1in, pelado, tajado", "1 chile verde, picado", "½ cucharadita de chile rojo en polvo", "½ cucharadita de cilantro molido", "½ cucharadita de comino molido", "3 tomates, 2 mezclados con un puré, 1 semilla extraída, cortada en rodajas de 1cm / ½", "6 pechos grouse, huesos extraídos, cortados en tiras de 1cm / ½ pulgada", "1 cucharadita de sal", "½ cucharadita de azúcar", "1 cucharada de hojas de cilantro fresco picado", "1 lima, solo jugo", "algunas ramitas micro hojas de ensalada o hojas de ensalada mixtas, para servir"], "method": ["Para la mezcla de especias, caliente una sartén a fuego medio. Cuando la sartén esté caliente, agregue los ingredientes de la mezcla de especias y fría por 1-2 minutos, o hasta que las especias estén fragantes.", "Retire de la sartén y transfiera a un mortero y una mano de mortero. Moler la mezcla a un polvo grueso, luego reservar.", "Para el pepinillo de calabaza, caliente el aceite en una sartén a fuego alto. Agregue las semillas de fenogreco y los chiles rojos secos y cocínelos hasta que exploten. (PRECAUCIÓN: Mantenga la bandeja bien lejos de los ojos y la cara).", "Agregue los cubitos de calabaza y saltee durante 3-4 minutos, o hasta que estén suaves y dorados.", "Agregue las semillas de cebolla, la sal, el chile en polvo y la cúrcuma, luego reduzca el fuego, cubra la olla con una tapa y cocine suavemente hasta que la calabaza comience a descomponerse, alrededor de 8-10 minutos.", "Cuando la calabaza se haya descompuesto, agregue el azúcar hasta que la mezcla esté brillante. Espolvorea sobre el polvo de mango seco o el pepinillo de mango y remueve hasta que estén bien combinados.", "Mientras tanto, para el urogallo, caliente el aceite en un wok indio de fondo plano o una sartén grande a fuego alto. Cuando el aceite esté caliente, agregue los dientes de ajo, las vainas de cardamomo y la hoja de laurel y fría durante 1-2 minutos, o hasta que chisporroteen.", "Agregue las 1½ cebollas finamente picadas y saltee durante 3-4 minutos, o hasta que estén doradas.", "Agregue el ajo, el jengibre y el chile verde y saltee durante otros 1-2 minutos o hasta que estén blandos.", "Agregue el chile en polvo, el cilantro molida y el comino molido y cocine por un minuto más, hasta que las especias sean fragantes.", "Agregue los tomates en puré, revuelva bien, luego traiga la mezcla a fuego lento. Continúe cocinando a fuego lento la mezcla hasta que el volumen de salsa se haya reducido a la mitad y la salsa se haya espesado, alrededor de 4-5 minutos.", "Cuando la salsa de tomate se haya reducido, empújala hacia un lado del wok o sartén y agrega las rebanadas de grouse. Revuelva-fríe durante 1-2 minutos, o hasta que se dore por todos lados.", "Reduzca el fuego a medio y agregue las rodajas de cebolla. Agregue la mezcla de especias, sal y azúcar hasta que toda la mezcla de tomate, urogallo y cebolla esté bien combinada, luego continúe cocinando durante 1-2 minutos, o hasta que las cebollas se hayan suavizado.", "Agregue las rodajas de tomate hasta que estén bien combinadas.", "Espolvorea sobre las hojas frescas de cilantro, luego exprime el jugo de lima y retira la sartén del fuego.", "Para servir, cuchara el urogallo cocido en wok en cada uno de los cuatro platos de servir. Con una cuchara, coloca el pepinillo de calabaza junto a cada porción. Adorne cada plato con unas ramitas de micro hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_gamecookedinanindian_92519", "title": "Juego cocinado en una caminata india", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 450g / 16oz", "2 cucharaditas de polvo de hornear", "60 g / 2½ oz de mantequilla sin sal, más extra para engrasar la lata de tarta", "60 g / 2½ oz de manteca de cerdo", "1 yema de huevo de gallinas camperas", "½ cucharadita de sal", "120ml / 4½fl oz de agua", "4 cucharadas de aceite vegetal", "1,5 kg / 3lb 5 oz mezcla de carne de caza (carne de venado, faisán, conejo, squirrell), picada", "Filete de carne de venado de 500 g / 17½ oz, picado", "125g / 4½oz tocino rayado, cortado en lardons", "2 cebollas grandes, en rodajas", "1 palo de apio, en rodajas", "250 g / 9 oz de champiñones castaños", "Harina normal de 50g / 2oz", "2 hojas de laurel", "2 cucharadas de jalea de grosella", "500ml / 17½fl oz de caldo de carne", "500ml / 17½ fl oz de vino tinto", "2 cucharaditas de tomillo fresco picado", "copos de sal marina y pimienta negra recién molida", "1 paquete de hojaldre listo para enrollar", "1 huevo de gallinas camperas, golpeado"], "method": ["Para la base de masa de pasta brisa, mezcle la harina, el polvo de hornear y la sal en un procesador de alimentos. Agregue la mantequilla y la yema de huevo y pulse hasta que la mezcla se asemeje a pan rallado. Poco a poco, con el motor en marcha, agregue el agua hasta que la mezcla se una para formar una masa (es posible que no necesite toda el agua).", "Enrolle la masa de hojaldre en una bola y envuélvala en una película adhesiva. Enfriar en la nevera durante una hora.", "Mientras tanto, para el relleno del pastel, caliente el aceite vegetal en una sartén grande y dore el juego y carne de venado en pequeños lotes (tenga cuidado de no llenar la sartén). Transfiera la carne a un plato y reserve, repitiendo el proceso según sea necesario.", "En la misma sartén que se usa para cocinar la carne, agregue el tocino y las cebollas. Cocine por 3-4 minutos, o hasta que las cebollas sean translúcidas. Agregue el apio y los champiñones y cocine durante 3-4 minutos o hasta que estén tiernos.", "Agregue la harina y cocínela durante 1-2 minutos, mezclándola bien para evitar que se formen grumos. Agregue las hojas de laurel, la jalea de grosella, el caldo, el vino tinto y el tomillo. Sazonar bien con sal y pimienta negra recién molida.", "Deje que la mezcla hierva a fuego lento y cocine, sin tapa, durante dos horas, o hasta que la carne esté tierna. Dejar de lado para enfriar.", "Mientras tanto, precaliente el horno a 180 ° C / 360 ° F / Gas 4. Engrase un molde para pastel de 20 cm / 8 pulgadas de profundidad con mantequilla sin sal.", "Estirar la masa de pasta brisa para que sea lo suficientemente grande como para alinear la lata. Con un rodillo, levante la masa y colóquela sobre el molde para pastel. Presione la masa hacia abajo en la base y alrededor de los lados a la línea.", "Alinee la masa con papel para hornear y luego rellene con alubias para hornear. Hornee en el horno por 20 minutos, o hasta que la masa esté dorada alrededor de los bordes. Retirar del horno y reservar para enfriar. Retire los frijoles y deseche el pergamino para hornear.", "Llene la caja de repostería con la mezcla de carne de caza cocida enfriada.", "Para la tapa de la pastelería, extienda la hoja de hojaldre hasta que quede lo suficientemente grande para que quepa sobre la fuente del pastel. Pinte alrededor del borde de la caja de pastelería con un poco del huevo batido y coloque la hoja de hojaldre en la parte superior.", "Engarce la masa alrededor de los bordes y elimine cualquier exceso. Pinche la masa varias veces con un tenedor para crear agujeros para que escape el vapor. Decora la parte superior con los trozos de masa sobrante (puedes cortar hojas u otras formas).", "Cepille la tapa de la pasta con el huevo batido restante, luego hornee la torta en el horno durante 30 minutos, o hasta que la masa esté dorada y se haya levantado.", "Deje a un lado el pastel para que se enfríe completamente, luego sirva en rodajas gruesas, preferiblemente con encurtidos."], "url": "www_bbc_co_uk_food_recipes_gamepie_93146", "title": "Pastel de juego", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["selección de carne de caza magra, aproximadamente 1 kg / 2¼lb en total, que podría incluir:", "pechos de faisán (colgados alrededor de 5 días)", "pechos de paloma", "pechugas de pato u otras aves silvestres", "silla de montar y cuartos traseros de 1 conejo, deshuesado", "silla de montar y cuartos traseros de liebre, huesos", "tiras delgadas de carne de venado (de la pierna o filete)", "aceite o grasa, para freír", "500g / 1lb2oz de carne de salchicha", "hígado de todo el juego, finamente picado", "2 puñados de pan blanco fresco", "1 huevo", "3 cucharadas de perejil, finamente picado", "algunas ramitas de tomillo, hojas removidas y picadas", "5-6 bayas de enebro, aplastadas en almirez y mortero", "2 dientes de ajo, finamente picados", "salpicaduras de brandy", "salpicaduras de vino tinto", "sal y pimienta", "Tocino rayado de 300 g / 10½oz, aplastado con la parte posterior de un cuchillo"], "method": ["En un tazón grande mezcla la carne de salchicha y los hígados picados del juego.", "A continuación, agregue el pan rallado, el huevo, el perejil, el tomillo, las bayas de enebro y el ajo. A continuación, el vino y el brandy, sazone con sal y pimienta y mezcle todo a conciencia, preferiblemente con las manos.", "Corte la carne del juego en tiras de aproximadamente el mismo tamaño, con un grosor aproximado de 2 dedos.", "En una sartén de base pesada, caliente la grasa o el aceite y fría las piezas del juego durante 2 minutos hasta que estén doradas.", "Cubra un plato de lata de pan o de terrina de cerámica con las lonchas estiradas de tocino rayado. Agregue una capa de carne picada seguida de una capa de carne de caza, luego una capa de carne picada seguida de otra capa de carne de caza. (Si lo desea, puede poner el mismo tipo de carne en cada capa, es decir, una capa de conejo, una capa de paloma y luego una capa de faisán). Sin importar cuántas capas hagas (suelo ir por tres), asegúrate de terminar con una capa de la carne.", "Doble las tiras de tocino expuestas sobre la parte superior de la terrina y cubra bien con papel de cocina. Si tu plato de terrina tiene una tapa tanto mejor.", "Coloque el plato de terrina en una lata de asar medio llena de agua caliente. Cocine en el horno a 160 ° C / 325 ° F / Gas 3 durante aproximadamente 1½-2 horas. Pruebe con un pincho para ver si está cocido, si el pincho no sale de la tubería de terrina caliente, entonces no está listo.", "Para obtener la mejor textura posible y un corte fácil, se debe presionar la terrina mientras se enfría. Encuentra una pieza de madera o plástico que se ajuste cómodamente dentro del plato de terrina y pégalo con un ladrillo o dos. (Otro plato de tamaño similar o una lata de hojaldre con un ladrillo en su interior a menudo hace el truco, pero envuélvala en una película adhesiva si está usando una lata.) Deje la terrina hasta que esté completamente fría durante varias horas o toda la noche.", "Para servir la terrina, cortarla de forma gruesa con un cuchillo muy afilado, poner en un plato con una ensalada pequeña de hojas verdes ligeramente vestidas y una pizca de buen chutney de frutas. Sirva con tostadas calientes."], "url": "www_bbc_co_uk_food_recipes_gameterrine_14230", "title": "Juego terrina", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gameterrine_14230_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas harinas 400g / 14oz", "1 cucharadita de aceite de oliva, más aceite en aerosol para freír", "sal y pimienta negra recién molida", "2 rebanadas de piña fresca", "Filete de carne magra de 250 g / 9 oz, con guarnición de grasa", "Brotes de Bruselas 150g / 5½oz, recortados y descuartizados"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Lave bien las papas, luego pélelas a medias, dejando un poco de la piel nutritiva para darle más sabor. Corta en chips bastante finos, de aproximadamente 1 cm de grosor, que crujen más fácilmente. Poner en una olla y cubrir con agua fría. Cubra la sartén, hierva el agua a fuego alto y cocine las papas durante 3 minutos. Drene y deje secar al vapor durante 2-3 minutos.", "Pon el aceite de oliva en una bandeja para hornear y calienta en el horno por un minuto. Agregue las astillas secas y escurridas al aceite caliente, dando a la bandeja un batido suave para separar las virutas. Deben estar en una sola capa. Sazone con un poco de sal y pimienta negra, hornee por 30-40 minutos, voltee las virutas a la mitad de la cocción para mover las virutas externas al medio y viceversa para que se froten uniformemente.", "Mientras tanto, rocíe una sartén ligeramente con aceite en aerosol. Caliente la sartén a fuego medio-alto y, cuando esté caliente, agregue los anillos de piña. Freír durante 2 minutos por lado, volteando regularmente, hasta que las rodajas estén doradas y caramelizadas. Dejar de lado.", "Reduzca el fuego a medio, rocíe el bistec gammon ligeramente con aceite en aerosol y fría en la misma sartén durante 4-5 minutos, volteándolo regularmente, hasta que el bistec esté dorado y cocido. Dejar de lado.", "Regrese la sartén al fuego y agregue las coles de Bruselas. Sofreír los brotes durante 3 minutos, agregando un chorrito de agua si es necesario, hasta que estén verde brillante pero aún retengan un poco de mordida.", "Sirva los filetes gammon con la piña en la parte superior, con los brotes salteados y las virutas al lado."], "url": "www_bbc_co_uk_food_recipes_gammon_and_chips_with_12644", "title": "Gammon y patatas fritas con piña y verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gammon_and_chips_with_12644_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina natural, más extra para espolvorear", "250g / 9oz de mantequilla sin sal, picada", "2 yemas de huevo de gallinas camperas", "5 cucharadas de agua helada", "1 huevo de gallina, batido con un poco de leche", "3 patatas Maris Piper, peladas y cortadas en rodajas de 1cm / ½ in", "1 cebolla, finamente rebanada", "Tocino 150 g / 5½ oz", "300 g / 10½ oz gammon", "4 hojas de salvia, finamente cortadas", "aceite, al gusto", "2 manzanas bramley, peladas con corazón y cortadas en rodajas de 1 cm", "pimienta negra recién molida", "1 cucharada de azúcar mascabado", "250ml / 9fl oz de sidra", "1 cucharada de harina de maíz", "Crema doble 250ml / 9fl oz"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la masa, coloque todos los ingredientes, excepto el agua helada, en un procesador de alimentos. Pulsa hasta que tengas una mezcla que se asemeje a pan rallado. Agregue el agua y el pulso para combinar. Envuelva la masa en film transparente y coloque en la nevera para enfriar hasta que sea necesario.", "Para el relleno, pula las rodajas de patata en agua hirviendo con sal durante unos minutos.", "Mientras tanto, fríe la cebolla con cuidado hasta que quede suave y translúcida. Luego agrega la panceta y freír hasta que estén crujientes.", "En una sartén limpia, freír el jamón y la salvia durante 1-2 minutos. Retírelo de la sartén y déjelo hasta que el jamón esté lo suficientemente frío como para manipularlo, luego páselo o destrúyalo en trozos pequeños.", "En un plato para horno poco profundo, rocíe un poco de aceite, agregue una capa de papas y cubra con un poco de gammon. Luego agrega una capa de la mezcla de cebolla y panceta y una capa de manzanas al plato. Ahora agregue una capa de cebolla frita y otra capa de gammon. Finalmente, agrega otra capa de la mezcla de cebolla y panceta. Sazonar con pimienta negra recién molida y agregar una pizca de azúcar.", "Mezcle la sidra, la harina de maíz y la crema doble juntas. Sazone al gusto con sal y pimienta negra recién molida, luego vierta sobre las capas de relleno.", "Saque los pasteles fríos del refrigerador y, en una superficie de trabajo ligeramente enharinada, extienda los pasteles al grosor de una moneda de una libra. Coloque la masa en la parte superior del relleno en el plato a prueba de horno, doble los bordes y haga un agujero en el centro, para que la humedad pueda escapar.", "Cepille la masa con el huevo batido y hornee por una hora, o hasta que la masa esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_gammon_and_pancetta_76452", "title": "Gammon y pancetta fidget pie", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10oz de guisantes amarillos secos", "50g / 2oz de mantequilla", "1 cebolla, más o menos picada", "½ cucharadita de tomillo seco", "1 hoja de laurel", "1 cucharadita de copos de sal marina", "½ cucharadita de nuez moscada rallada finamente", "1 huevo de gallinas camperas, golpeado", "pimienta negra recién molida", "1kg / 2¼lb de jengibre ahumado o no ahumado, atado", "1 cebolla mediana, pelada", "4 dientes", "1 zanahoria grande, más o menos picada", "2 palitos de apio, más o menos picados", "2 hojas de laurel", "10 granos de pimienta negra", "25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "300 ml / 10 fl oz existencias de jamón (de cocinar el jamón)", "1 cucharadita de mostaza inglesa", "1 cucharadita de mostaza integral", "5 cucharadas de crema individual"], "method": ["Enjuague los guisantes en un colador con agua corriente fría y escúrralos. Coloque los guisantes en un recipiente y cúbralos con agua caliente. Deje reposar durante 20 minutos.", "Caliente 25 g / 1 oz de la mantequilla en una sartén de base pesada y cocine la cebolla, el tomillo y la hoja de laurel muy suavemente durante 15 minutos, o hasta que se suavicen y apenas comiencen a colorear. Revuelva regularmente.", "Escurra los guisantes y agregue a la sartén. Vierta más de 1 litro / 1¾ pintas de agua y deje que hierva. Reduzca ligeramente el fuego y cocine a fuego lento durante 30-40 minutos, o hasta que los guisantes se ablanden y comiencen a desmoronarse. El líquido debería estar bien reducido en este momento.", "Mientras tanto, ponga el jamón en una olla grande con tapa y cúbralo con agua fría. Llevar a ebullición y luego desechar el agua (tenga cuidado ya que creará una gran cantidad de vapor). Cortar la cebolla por la mitad y sembrar cada pieza con clavos de olor.", "Quite los guisantes del fuego, retire la hoja de laurel y mezcle con una batidora de mano hasta obtener un puré espeso. Batir la nuez moscada y el huevo restante. Sazonar con sal y pimienta negra recién molida.", "Coloque la mezcla de guisantes en el centro de una pieza de muselina. Ate los extremos con una cuerda de cocina justo encima de los guisantes, permitiendo un poco de espacio para la expansión.", "Coloque el pudín de pease y la cebolla en la sartén junto al jamón. Agregue la zanahoria, el apio, las hojas de laurel y los granos de pimienta. Llene la sartén con suficiente agua fría para cubrir el jamón y volver a la cocina. Traiga a fuego lento, tape ligeramente con una tapa y cocine por 1-1 ¼ horas.", "Retire el gammon y colóquelo en un tablero. Cubra con papel de aluminio y un par de paños de cocina. Deje reposar por 10 minutos antes de tallar. Cucharee 300 ml / 10 fl oz de la reserva de gammon en una jarra resistente al calor.", "Para la salsa de mostaza, derrita la mantequilla en una cacerola a fuego medio. Agregue la harina y cocine durante unos segundos antes de agregar lentamente el caldo reservado, revolviendo bien entre cada adición. Llevar la salsa a fuego lento, agregue la mostaza y luego la crema. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Talla el jamón en rodajas gruesas. Desenvuelva el pudín de pease y transfiéralo a un recipiente para servir calentado. Sirva una cucharada de pudín de pease con una rodaja de gammon y rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_gammon_and_pease_pudding_56485", "title": "Gammon y pease pudding", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de gamuza 100 g / 3½ oz", "¼ de cebolla, en rodajas", "150g / 5oz de guisantes frescos", "1 naranja, segmentado", "2 cucharadas de menta fresca picada", "1 cucharada de aceite"], "method": ["Coloque el jamón en una olla. Cubra con agua y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante diez minutos, o hasta que el jamón esté completamente cocido.", "En un tazón, mezcle la cebolla, los guisantes, los segmentos de naranja, la menta y el aceite.", "Coloque la ensalada en un plato de servir. Corte el jamón en tiras y esparza sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_gammonpeaandorangesa_87781", "title": "Ensalada de gamma, guisantes y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12-16 rebanadas de tocino rayado", "1 kg / 2 lb 4 oz de carne de caza (como pechuga de faisán, paloma, pato o carne de venado magra), en cubitos", "500g / 1lb 2oz de carne de salchicha", "Hígados de pollo a 200 g / 7 oz, finamente picados", "2 puñados de pan rallado blanco", "1 huevo de gallinas camperas, golpeado", "3 cucharadas de perejil fresco picado", "algunas ramitas de tomillo fresco, hojas recogidas", "2 dientes de ajo picados", "splash brandy", "salpicaduras de vino tinto", "2 cabezas de lechuga gema bebé, hojas separadas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "algunas rebanadas de cuentas tostadas de su elección"], "method": ["Para la terrina del juego, precaliente el horno a 180C / 350F / Gas 4.", "Cubra un molde de terrina con película adhesiva o papel de aluminio y luego coloque las rebanadas de tocino en el molde con el tocino superpuesto. Mantenga un poco de tocino a un lado para cubrir la parte superior de la terrina.", "Coloque todos los demás ingredientes de terrina en un recipiente y mezcle para combinar.", "Llene el molde de terrina con el relleno del juego y coloque el tocino restante sobre la parte superior.", "Coloque la terrina en una bandeja honda para hornear y vierta en agua hirviendo hasta que llegue a dos tercios del camino hasta los lados del molde. Este método de cocción de bain marie permite que el calor del horno cuece la terrina muy suavemente. Hornea por 1-1¼ horas.", "Para la ensalada ponga la lechuga en un tazón. Mezcle el aceite, el vinagre y la mostaza en un tazón pequeño para hacer un aderezo.", "Para servir, apague la terrina y corte algunas rodajas. Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle. Sirva una rebanada de terrina en un plato con la ensalada y la tostada."], "url": "www_bbc_co_uk_food_recipes_game_terrine_50385", "title": "Juego terrina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ruibarbo de 500 g / 1lb 2 oz", "200g / 7oz de azúcar morena suave", "3 cebollas, finamente picadas", "3 dientes de ajo picados", "Tomates 100 g / 3½ oz, picados", "1 cucharada de hojas frescas de tomillo", "200ml / 7fl oz de vinagre de vino tinto", "1 limón, ralladura y jugo", "1 cucharadita de jengibre molido", "½ cucharadita de canela molida", "1 diente", "2 filetes de gammon", "1 cucharada de aceite de oliva"], "method": ["Coloque el ruibarbo, el azúcar y un chorrito de agua en una sartén y cocine a fuego medio hasta que el ruibarbo esté suave. Agregue las cebollas, el ajo, los tomates, el tomillo, el vinagre, el jugo de limón y la ralladura y las especias. Llevar a ebullición lentamente, revolviendo de vez en cuando, luego cocine a fuego lento durante aproximadamente dos horas, revolviendo con frecuencia, hasta que la salsa picante esté espesa.", "Cortar la grasa en los filetes de gammon en varios lugares con un par de tijeras. Coloque el aceite de oliva en una sartén a fuego medio y, cuando el aceite esté caliente, fría los bistecs gammon durante 3-4 minutos por cada lado.", "Coloque el jamón y parte de la salsa picante en platos y sirva con repollo verde cocido."], "url": "www_bbc_co_uk_food_recipes_gammon_with_spiced_71179", "title": "Gammon con salsa picante de ruibarbo con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de melaza", "3 cucharadas de jarabe de arce", "9 lonchas de tocino rayado ahumado", "1kg / 2lb 4oz gammon joint", "750ml / 1½fl oz de jugo de manzana", "1 cebolla, entera, pelada", "3 dientes", "2 anís estrellado", "2 hojas de laurel", "6 granos de pimienta", "½ calabaza grande", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "50g / 2oz de mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, mezcle la melaza y el jarabe de arce. Agregue el tocino y déjelo marinar durante al menos cuatro horas.", "A una olla grande, agregue el jugo de manzana, cebolla tachonada con clavos, laurel, anís estrellado y granos de pimienta. Finalmente coloque la junta de gammon en el líquido y cocine a fuego lento con una tapa durante 1 hora y 30 minutos.", "Mientras tanto, corta la mitad de la calabaza por la mitad otra vez.", "Coloque la calabaza en una fuente de horno, con la piel hacia abajo, y vierta el aceite de oliva. Sazonar con sal y pimienta negra recién molida, agregar un poco de mantequilla en cada rodaja de calabaza y hornear en el horno durante 45 minutos. Cuando esté cocido, aparte bajo papel de aluminio para mantener el calor.", "Cuando el gammon se haya cocinado, retírelo del líquido, colóquelo en una bandeja para hornear y, a continuación, coloque la tocineta sobre la parte superior.", "Hornee por otros 15 minutos o hasta que el tocino esté crujiente.", "Tallar el jamón y servir con bolas de carne de calabaza suave."], "url": "www_bbc_co_uk_food_recipes_gammon_with_treacle_81407", "title": "Gammon con corteza de tocino y melaza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gammon_with_treacle_81407_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de semillas de cardamomo (si no puedes comprar las semillas, entonces compra las vainas de cardamomo y cáscalas tú mismo)", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de comino negro (puede usar semillas de comino regulares si el negro no está disponible)", "1 cucharadita de clavos enteros", "1/3 de nuez moscada entera (se puede romper una nuez moscada enterita colocándola en un paño y golpeándola con un mazo de carne o un rodillo)", "una barra mediana de canela, alrededor de 5-8 cm / 2-3 pulgadas, dividida en 3-4 piezas"], "method": ["Coloque todos los ingredientes en un molinillo de café limpio u otro molinillo de especias y moler lo más finamente posible.", "Almacene en un recipiente bien tapado, lejos del calor y la luz solar, y use según sea necesario."], "url": "www_bbc_co_uk_food_recipes_garammasala_90213", "title": "Sal masala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace alrededor de 3 cucharadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garammasala_90213_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8oz / 225g de arroz basmati", "3 cucharadas de aceite vegetal", "1 cebolla, finamente picada", "2 dientes", "3 vainas de cardamomo", "1 ramita de canela", "½ cucharadita de semillas de comino", "1 cucharadita de sal"], "method": ["Lave bien el arroz con agua corriente fría y déjelo a un lado.", "Calentar el aceite en una sartén grande y freír las cebollas hasta que estén doradas. Eliminar y reservar.", "Mientras la sartén aún está caliente, agregue todas las especias y cocine durante 1-2 minutos.", "Agregue el arroz enjuagado a la sartén, junto con la sal y 550 ml / 1 litro de agua. Cubra y lleve a ebullición. Agregue la mitad de las cebollas cocidas y cocine a fuego lento durante 10-15 minutos más hasta que el arroz esté tierno.", "Sirva caliente y adornado con las cebollas restantes."], "url": "www_bbc_co_uk_food_recipes_garammasalarice_88053", "title": "Arroz picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojaldre listo para enrollar de 300g / 10½oz, enfriado y luego laminado a 3 mm de grosor", "300 g / 10½ oz (alrededor de 6 pequeños) remolacha Golden o Chioggia, limpiada", "Una pizca de sal marina", "2 pizca de pimienta negra", "20 g / ¾oz de mantequilla sin sal, caliente", "10g de mantequilla sin sal", "200 g / 7 oz de cebolla Rose de Roscoff (alrededor de 1), en rodajas", "Una pizca de sal marina", "pizca de pimienta negra", "2 cucharaditas de vinagre de Jerez (o vinagre de Jerez)", "1 yema de huevo, batida con 2 cucharaditas de agua para un lavado de huevos", "pizca de pimienta negra", "1 cucharadita de polvo de naranja y tomillo seco (opcional), para hacer su propia cáscara de naranja seca y tomillo en un horno a 100C / 80C Fan / Gas ¼ por 1 hora, luego rellene con un polvo", "4 cucharaditas de vinagre de Jerez, hervido durante 30 segundos", "40ml / 1½ fl oz de aceite de oliva de buena calidad", "Una pizca de sal marina", "pizca de pimienta negra", "150g / 5½oz de hojas de ensalada mixtas", "60 g / 2¼ oz de requesón"], "method": ["Para la base de pastelería, forre una bandeja para hornear con papel antigrasa. Cortar la masa en dos discos de 13cm / 5in utilizando un anillo de chef o un plato pequeño y colocar en la bandeja para hornear forrada. Transfiera a la nevera, o idealmente al congelador, durante al menos 1 hora, para evitar que la masa esté pegajosa.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para preparar la remolacha, corta la raíz de cada una. Con una mandolina ajustada a un grosor de 1 mm, corta en discos delgados y transfiérelo a un tazón. Condimentar con sal y pimienta. Agregue la mantequilla caliente para asegurarse de que cada rodaja de remolacha esté uniformemente cubierta.", "Para cocinar la remolacha, coloque un anillo de metal de 9cm / 3½ pulgadas en un blini de 12cm / 4½ pulgadas. Coloque los discos de remolacha sazonados dentro del anillo en un patrón de rosace 3 capas de profundidad. El anillo de metal facilitará la construcción de la remolacha y la mantendrá en posición vertical y en un círculo perfecto. Repita esto con el otro blini pan y anillo de metal. Corta un círculo de papel para hornear del mismo tamaño que el blini pan.", "Levante el anillo de metal de la remolacha y coloque el papel de hornear encima de la rosácea de remolacha, luego presione el anillo sobre la rosácea. (Al colocar el anillo sobre el papel, atrapará el vapor que intenta escapar, lo que mantendrá la remolacha maravillosamente húmeda.) Cocine las rosáceas de remolacha a fuego medio durante 2 minutos, hasta que los lados comiencen a burbujear. Algunos jugos de la remolacha hervirán en la sartén; esto es importante ya que acelera la cocción de la remolacha en el horno y proporciona una agradable caramelización ligera a la remolacha.", "Transfiera la remolacha al horno por 10-12 minutos. Retirar del horno, dejar reposar y enfriar por completo. Quite los anillos y el papel a prueba de grasa de las rosáceas de remolacha enfriadas y colóquelas en un plato pequeño (el lado de color, con su diseño de rosácea dorada estará orientado hacia arriba). Dejar de lado.", "Para la mermelada de cebolla, en una sartén a fuego medio, derrita la mantequilla y agregue la cebolla, la sal y la pimienta. Cocine durante 35-40 minutos, tapado con una tapa, hasta que se suavice pero no se caramelice. Revuelva cada 5 minutos para evitar que las cebollas se quemen. Desglasar la sartén con el vinagre, raspando cualquier trozo dorado del fondo con una cuchara de madera, y hervir durante 20 segundos. Pruebe y ajuste el aderezo si es necesario. Deje que se enfríe completamente.", "Para construir y cocinar las tartas de remolacha, divida el atasco de cebolla por igual entre los dos discos de hojaldre y con la parte posterior de una cuchara extienda las cebollas en una capa delgada dejando un espacio de 1 cm / ½ pulgada alrededor del borde. Cepille ligeramente los bordes de la masa con una fina capa de huevo y espolvoréelos con pimienta negra y naranja en polvo y tomillo, si los usa. Con una espátula, levante cada rosácea dorada en el centro de cada base de masa. Coloque un trozo de pergamino para hornear sobre cada una de las tartas y coloque una rejilla para enfriar encima de ellas. Transfiera al horno por 20 minutos, o hasta que los lados de la masa estén dorados. El papel pergamino y la rejilla de enfriamiento en las tartas ayudan a mantener la humedad en la remolacha; también asegurará que la masa se levante de manera uniforme y que las rodajas de remolacha no se curven durante la cocción.", "Para preparar la vinagreta de Jerez, mezcle todos los ingredientes en un tazón pequeño. Pruebe y ajuste el aderezo si es necesario.", "Para servir, vista las hojas con la mitad de la vinagreta y colóquelas en cada plato. Esparce el requesón sobre la ensalada. Cepille la vinagreta restante sobre las tartas de remolacha para darle sabor y un glaseado hermoso y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_garden_beetroot_and_95410", "title": "Remolacha de jardín y tarta de cebolla Roscoff", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo, sin piel", "20g / ¾oz de perejil, finamente picado", "150g / 5½oz de queso taleggio, cortado en tiras", "75g / 2½z de mantequilla", "2 dientes de ajo, finamente picados", "3 lonchas de tocino ahumado ahumado, finamente picadas", "dos puñados de migas de pan", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Anota las pechugas de pollo cuatro veces, diagonalmente en la parte superior a 2 cm / ¾ pulg del fondo.", "Cortar finamente el perejil y cortar el taleggio en tiras.", "Ruede el taleggio en el perejil y luego rellene el queso en los espacios marcados en las pechugas de pollo.", "Derretir la mantequilla en una sartén. Agregue el ajo picado y el tocino a la sartén y cocine durante tres minutos.", "Agregue las migas de pan a la sartén y cocine por otros tres minutos.", "Vierta el aceite de oliva sobre el pollo y sazone con sal y pimienta negra recién molida.", "Esparce la mezcla de migas de pan sobre las pechugas de pollo, dándoles palmaditas ligeramente.", "Hornee en el horno por 30 minutos."], "url": "www_bbc_co_uk_food_recipes_garlic-crumbed_chicken_92638", "title": "Pollo molida de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic-crumbed_chicken_92638_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles rojos, finamente cortados", "4 dientes de ajo, en rodajas finas", "75 g / 2½ oz de azúcar en polvo", "75ml / 2½fl oz de vinagre de vino de arroz", "350g / 12oz de arroz basmati", "2 cucharaditas de sal marina", "1 cucharada de aceite vegetal", "Jengibre fresco de 5 cm / 2 pulgadas, finamente triturado", "3 dientes de ajo picados", "2 guindillas rojas, finamente picadas", "125ml / 4½fl oz de salsa de tomate", "75ml / 2½fl oz de ajo y salsa de chile (desde arriba)", "75ml / 2½fl oz salsa hoisin", "3 cucharadas de salsa de pescado", "1 cucharada de azúcar en polvo", "500 g / 1 libra de garras de cangrejo cocidas de 2 oz, ligeramente trituradas", "2 hojas de plátano, cada corte por la mitad y suavizado sobre una llama desnuda", "2 cucharadas de cilantro fresco"], "method": ["Para la salsa de ajo y chile, coloque todos los ingredientes en una olla pequeña con dos cucharadas de agua. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante unos minutos hasta que el azúcar se disuelva. Dejar de lado para enfriar.", "Para el arroz al vapor, agregue 500ml / 18fl de agua en una sartén y luego agregue el arroz y la sal. Cocine a fuego lento hasta que toda el agua haya desaparecido. Coloque una tapa en la parte superior y déjela a un lado durante 20 minutos.", "Para el cangrejo de chile, caliente un wok hasta que esté caliente y agregue el aceite vegetal, el jengibre, el ajo y los chiles y saltee durante dos minutos.", "Mientras tanto, mezcle la salsa de tomate, el ajo y la salsa de chile, la salsa hoisin y la salsa de pescado en un bol. Agregue el azúcar y 75ml / 2½ fl oz de agua y mezcle para combinar. Agregar al wok y llevar a ebullición.", "Agregue el cangrejo, luego reduzca el fuego y cocine a fuego lento durante 3-4 minutos hasta que la salsa se haya espesado un poco y el cangrejo se caliente por completo.", "Para servir, coloque una hoja de plátano blanda en cada plato y una cuchara sobre el cangrejo y el arroz al lado. Adorne con cilantro picado."], "url": "www_bbc_co_uk_food_recipes_garlic_and_chilli_king_04319", "title": "Cangrejo rey de ajo y ají con arroz al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de langostinos enteros (alrededor de 24 medianos)", "150ml / 5fl oz de aceite de oliva", "4 dientes de ajo, muy finamente picados", "3 cucharadas de hojas de perejil muy finamente picado", "generosas pizcas de chile rojo seco pellizcado", "sal marina", "Rodajas de limón", "pan (opcional)"], "method": ["Pele las gambas, dejando intacta la punta de la cola y la cabeza.", "Vierte el aceite de oliva en una sartén grande y ponlo a fuego medio. Agregue el ajo, el perejil, los copos de chile y una gran pizca de sal marina y cocine por unos minutos, revolviendo constantemente, hasta que el ajo comience a ablandarse pero no tome mucho color.", "Suba el fuego y agregue las gambas, freír rápidamente en cada lado hasta que estén rosadas y cocidas. Esto llevará hasta 3 minutos.", "Retire con cuidado las gambas de la sartén con una cuchara ranurada. Sirva inmediatamente con un poco del aceite de cocina con sabor rociado, con rodajas de limón y tal vez un poco de pan para mojar."], "url": "www_bbc_co_uk_food_recipes_garlic_and_chilli_prawns_85728", "title": "Gambas al ajillo y chiles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]