[{"ingredients": ["Carne picada de carne 250 g / 9 oz", "1 diente de ajo, aplastado", "½ cebolla, finamente picada", "1 huevo de gallinas camperas, ligeramente golpeado", "½ pizca de chile en polvo", "harina, para dragado", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "2 dientes de ajo, aplastados", "1 pimienta romero, semillas eliminadas, picadas", "1 cucharada de puré de tomate", "1 cucharadita de hojuelas de chile", "150ml / ¼ de pinta de vino blanco", "200g / 7oz de arroz basmati, lavado", "puñado de perejil fresco picado", "puñado de eneldo fresco picado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["Para las albóndigas, mezcle la carne picada, el ajo, la cebolla, el huevo y el chile en polvo en un bol.", "Con las manos mojadas, dé forma a la mezcla en 4-5 bolas del tamaño de una pelota de golf y drague en harina.", "Para la salsa, caliente el aceite de oliva en una sartén y sude la cebolla hasta que esté suave pero no coloreada.", "Agregue el ajo y la pimienta romero y fría por 2-3 minutos.", "Agregue los ingredientes restantes y lleve a ebullición. Cocine para reducir el volumen de vino a la mitad.", "Agregue las albóndigas, cubra y cocine por 15 minutos, volteando las albóndigas de vez en cuando en la salsa, hasta que estén bien cocidas.", "Para el arroz, coloque el arroz en una cacerola y cubra con 2½ cm / 1 en agua fría. Llevar lentamente a ebullición.", "Una vez que el arroz esté hirviendo, revuelva una vez, baje el fuego a muy bajo y cúbralo con una tapa hermética durante 10 minutos o hasta que se haya absorbido todo el agua y se haya cocinado el arroz.", "Cuando el arroz esté cocido, revuelva a través de las hierbas y condimente, al gusto, con sal y pimienta negra recién molida.", "Frote el aceite sobre el interior de un pequeño recipiente Pyrex. Presione el arroz en el recipiente, luego incline sobre un plato de servir.", "Para servir, coloque las albóndigas alrededor del arroz y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_chillibeefmeatballsi_85473", "title": "Albóndigas de carne de chile en tomate, vino blanco y salsa de pimienta romero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 libras 2 onzas de patatas King Edward, peladas y cortadas en trozos", "2 dientes de ajo, pelados", "3-4 cucharadas de aceite de oliva", "Queso cheddar de 75g / 3oz, cortado en pedazos de 4cm x 1cm / 2in x ½in", "Pan rallado de pan de 50g / 2oz (disponible en tiendas de comestibles asiáticas), o pan rallado seco", "2 cucharaditas de copos de chile seco", "Harina normal de 50g / 2oz", "2 huevos de gallinas camperas, golpeados", "aceite vegetal, para freír", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, pelado, aplastado", "1 chile rojo, finamente picado", "2 cucharaditas de comino molido", "1 x 400g / 14oz de tomates picados en lata", "1 cucharadita de azúcar en polvo", "sal y pimienta negra recién molida", "110g / 4oz de hojas de cohete", "110g / 4oz de berros, hojas recogidas", "2 cucharadas de aceite de oliva virgen extra", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para las croquetas de queso de chile, coloque las papas y el ajo en una sartén con agua con sal y deje que hierva. Cocine durante 15-18 minutos, o hasta que las papas estén tiernas, luego drene y vuelva a la sartén.", "Coloque la sartén sobre el fuego durante unos minutos para expulsar el exceso de humedad de las papas, luego retírelo del fuego y triture bien la papa y el ajo hasta que quede suave. Batir el aceite de oliva, luego sazone con sal y pimienta negra recién molida.", "Moldee una pequeña porción del puré de patatas alrededor de un trozo de queso para formar una salchicha de aproximadamente 7 cm x 3 cm / 3 pulgadas x 1½ pulgadas. Repita con el queso restante y el puré de patata hasta que todo se haya agotado.", "En un tazón grande, mezcle las migas de panko y las hojuelas de chile juntas.", "Espolvoree los paquetes de papas y queso en la harina, sumérjalos en el huevo batido y revuelva en la mezcla de copos de chile y panko hasta que estén bien cubiertos. Coloque en una bandeja y cubra con película adhesiva, luego enfríe en la nevera durante 30 minutos.", "Mientras tanto, para la salsa de tomate y comino, caliente el aceite de oliva en una sartén y fría la cebolla, el ajo y el chile por 2-3 minutos, o hasta que se ablanden. Agregue el comino molido y cocine durante un minuto más, luego agregue los tomates y cocine a fuego lento. Cocine por 20 minutos, o hasta que la mezcla se haya reducido y espesado hasta obtener una consistencia de salsa. Sazonar, al gusto, con azúcar, sal y pimienta negra recién molida.", "Para la ensalada, coloque el cohete y las hojas de berro en un recipiente y mezcle. Rocíe el aceite de oliva virgen extra y el jugo de limón alrededor del borde interior del recipiente, luego sazone con sal y pimienta negra recién molida. Mezcle la ensalada para cubrir con aceite de oliva y jugo de limón.", "Para las croquetas de queso de chile, llene a medias una sartén profunda de base pesada con aceite vegetal y caliente a 170 ° C / 325 ° F, controlando la temperatura con un termómetro digital (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Retire las croquetas del refrigerador y frítelas, en pequeños lotes, en el aceite durante 2-3 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloca tres croquetas en el centro de cada plato de servir. Coloque la salsa de tomate y comino en pequeños tazones o moldes para mojar y coloque junto a las croquetas. Coloque la ensalada al lado y sirva."], "url": "www_bbc_co_uk_food_recipes_chillicheesecroquett_92167", "title": "Croquetas de queso con salsa de tomate picante", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 dientes de ajo, finamente picados", "Jengibre fresco de la raíz de los 2.5cm / 1in, finamente tajado", "1 chile rojo, finamente picado", "½ pimiento rojo, cortado en tiras", "2 tomates, toscamente picados", "2 cucharadas de ketchup de tomate", "1 cucharadita de azúcar moreno", "1 cucharada de aceite de maní", "Filetes de pechuga de pollo sin piel 250 g / 9 oz, en rodajas", "1 calabacín, cortado en tiras", "½ pimiento rojo o amarillo, sin semillas, cortado en tiras", "2 cucharadas de salsa de soja ligera", "2 cebollas grandes de primavera, cortadas longitudinalmente", "arroz hervido, cocinado de acuerdo con instrucciones empaquetadas"], "method": ["Para la salsa, coloque todos los ingredientes de la salsa con 5 cucharadas de agua en un procesador de alimentos y mezcle hasta que quede suave.", "Para el pollo, caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue el pollo y saltee durante 2-3 minutos, o hasta que esté ligeramente dorado. Agregue el calabacín y el pimiento rojo y saltee durante 1-2 minutos, luego vierta la salsa y deje que hierva. Cocine por otros 2-3 minutos o hasta que el pollo esté bien cocido.", "Sazonar con la salsa de soya y amontonar en un plato para servir. Adorne con las cebolletas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chillichickenwithjas_89288", "title": "Pollo salteado de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chillichickenwithjas_89288_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas grandes y sin piel, con un peso de 200 g / 7 oz cada una", "1 cucharadita de chile en polvo", "1 cucharadita de pimentón dulce", "2 cucharaditas de pimienta negra cuarteada", "1 cucharadita de sal de ajo", "1 cucharadita de tomillo picado", "1 cucharadita de perejil picado", "1 cucharadita de aceite de oliva", "1 frijol pinto, escurrido (preferiblemente orgánico)", "1 cebolla roja pequeña, finamente picada", "1-2 chiles rojos grandes, en rodajas", "2 aguacates, pelados, apedreados y cortados en cubitos", "4 cucharadas de cilantro fresco picado", "2 cucharadas de jugo de limón", "6 cucharadas de aceite de oliva virgen extra", "sal", "pimienta negra recién molida"], "method": ["Retire el pollo de la nevera y espere aproximadamente una hora hasta que alcance la temperatura ambiente.", "Mezcle las especias, el condimento, las hierbas y la mitad del aceite de oliva. Frote la mezcla en el pollo.", "Ase a la parrilla sobre brasas o en un molde para parrilla calentado y precalentado, durante aproximadamente ocho minutos a cada lado, rociándolo con el aceite restante.", "Para hacer la salsa, mezcle suavemente todos los ingredientes en un tazón grande y deje reposar por diez minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_chillichickenandavoc_72036", "title": "Chilli de pollo y salsa de aguacate", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pechuga de pollo cortada a la mitad", "½ naranja, picada (piel)", "1 cucharada de miel clara", "¼ de chile rojo, picado", "1 cucharada de aceite vegetal", "¼ de cebolla picada", "2 cebollas de primavera, picadas", "Fideos de huevo listos para cocinar de 100 g / 3½ onzas, cocidos de acuerdo con las instrucciones del paquete", "2 cucharadas de salsa de soja", "¼ naranja, solo jugo", "pizca de copos de chile seco", "puñado de hojas de cilantro fresco, picado"], "method": ["Para el pollo picante, caliente el aceite de oliva en una sartén a fuego medio. Agregue el pollo y cocine por 3-4 minutos en cada lado, o hasta que estén dorados y completamente cocidos.", "Agregue las piezas de naranja, la miel y el chile y cocine durante dos minutos, volteando el pecho para cubrir la salsa.", "Para los fideos salteados, caliente el aceite en un wok a fuego alto. Agregue la cebolla y la cebolla tierna y saltee durante 2-3 minutos.", "Agregue los fideos, la salsa de soja, el jugo de naranja y las hojuelas de chile y saltee por un minuto.", "Agregue el cilantro, mezcle bien y coloque en un plato calentado. Coloque el pollo picante encima y adorne con hojas frescas de cilantro."], "url": "www_bbc_co_uk_food_recipes_chillichickenwithsti_84517", "title": "Pollo al ajillo con fideos salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "100g / 3½ oz verdes de primavera, rallado", "½ cucharadita de copos de chile", "nuez moscada recién rallada, al gusto", "300g / 10½oz puré de papa", "sal y pimienta negra recién molida", "300ml / ½ pinta de aceite vegetal, para freír", "½ tomate de ternera, cortado en rodajas gruesas", "100ml / 3½ fl oz de leche", "3 cucharadas de harina común", "2 salchichas de cerdo italianas, a la parrilla", "1 huevo de gallinas camperas, frito", "1 cucharada de cebolletas frescas picadas"], "method": ["Para el chile colcannon, caliente la mantequilla en una sartén y saltee los vegetales hasta que empiecen a ablandarse. Agregue los copos de chile y nuez moscada y revuelva.", "Agregue el puré de patatas y sazone, al gusto, con sal y pimienta negra recién molida. Freír hasta que el puré se vuelva dorado, alrededor de 7-8 minutos.", "Para los anillos de tomate, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Remoje las rodajas de tomate en la leche, luego drague con la harina. Coloque los tomates en el aceite caliente y fría hasta que estén dorados y crujientes, aproximadamente 5-6 minutos. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque el chile colcannon en un plato de servir y cubra con las salchichas a la parrilla y el huevo frito. Coloque los anillos de tomate en el exterior y espolvoree sobre el cebollino picado."], "url": "www_bbc_co_uk_food_recipes_chillicolcannonwithg_88630", "title": "Colcannon de chile con salchichas a la parrilla, huevo frito y anillos de tomate fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas picadas", "2 dientes de ajo, aplastados", "1kg / 2¼lb de carne de res magra picada", "250ml / 9fl oz de vino tinto", "2 x 400 g de tomates picados", "3 cucharadas de puré de tomate", "2 chiles rojos, en rodajas finas o 3-4 cucharaditas de copos de chile seco", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 barra de canela", "buen batido de salsa Worcestershire", "1 cubo de caldo de carne", "sal y pimienta negra recién molida", "2 x 400 g pueden frijoles rojos, enjuagados y drenados", "1 gran racimo de hojas de cilantro, toscamente picadas", "cuñas de lima, para servir"], "method": ["Calentar el aceite en una olla grande de base pesada con tapa y freír la cebolla y el ajo hasta que se ablanden. Aumentar el fuego y agregar la carne picada, cocinar rápidamente hasta que se dore y romper los trozos de carne con una cuchara de madera.", "Verter el vino tinto y hervir durante 2-3 minutos.", "Agregue los tomates en lata, puré de tomate, chile fresco o escamas de chile, comino, cilantro, canela y salsa Worcestershire y desmenuzar en el cubo común. Sazonar bien con sal y pimienta negra recién molida. Deje que hierva a fuego lento, cubra con una tapa y cocine a fuego lento durante aproximadamente 50 minutos a 1 hora, revolviendo ocasionalmente hasta que la mezcla sea rica y espesa.", "Agregue los frijoles y el cilantro fresco. Cocine por otros diez minutos, sin tapar, antes de retirar del fuego, agregando cualquier condimento adicional si es necesario. Sirva con arroz, guacamole, crema agria y una gran ensalada verde."], "url": "www_bbc_co_uk_food_recipes_chilliconcarne_67875", "title": "Chili con carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilliconcarne_67875_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de agua", "5 cucharadas de ketchup de tomate", "2 cucharadas de salsa de soja ligera", "1 cucharada de azúcar", "2 cucharadas de harina de maíz", "4 cucharadas de aceite de cacahuete", "6 dientes de ajo, finamente picados", "2 cucharadas de jengibre fresco rallado", "3 chiles rojos, sin semillas, finamente cortados", "500g / 1lb1½oz de cangrejo cocido, las partes no comestibles se descartan, las pinzas se quitan y se agrietan, las patas se quitan, la cáscara restante se corta en cuartos", "150ml / 5fl oz de agua", "1 cucharada de jugo de lima", "2 cebolletas, cortadas longitudinalmente", "1 gran puñado de cilantro fresco, toscamente picado", "Fideos de huevo finos de 300g / 11oz o fideos de harina de trigo shi amarillos secos, cocidos de acuerdo con las instrucciones del paquete", "lanzar aceite de sésamo", "½ cucharadita de hojuelas de chile seco", "1 cucharada de salsa de soja ligera"], "method": ["Para la salsa de chile, coloque todos los ingredientes de la salsa juntos en un tazón y mezcle bien. Dejar de lado.", "Para el cangrejo, caliente el aceite en un wok hasta que esté humeando y agregue el ajo, el jengibre y los chiles y saltee por 30 segundos. Agregue las piezas de cangrejo al wok y saltee durante otros 1-2 minutos, luego agregue la salsa de chile y cocine durante 1-2 minutos. Agregue el agua y el jugo de lima y mezcle bien.", "Para los fideos, rocíe los fideos cocidos con aceite de sésamo para evitar que se peguen. Agregue los fideos cocidos y los copos de chile al wok caliente y sazone con la salsa de soja. Mezcle para mezclar, luego mezcle la mitad de la cebolleta y el cilantro.", "Para servir, amontone los fideos y el cangrejo en un plato y decore con las rebanadas restantes de cebolleta y el cilantro picado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chillicrabwitheggnoo_89276", "title": "Chili cangrejo con fideos de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chillicrabwitheggnoo_89276_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1½ cucharadas de aceite vegetal", "2 cebollas pequeñas, peladas, picadas", "3 dientes de ajo, pelados, picados", "1 cucharadita de tomillo fresco picado", "1 cucharadita de Romero fresco picado", "500 g / 1 libra de carne picada 2 oz", "200g / 7oz de tomates picados enlatados", "½ cucharada de salsa Worcestershire", "1½ cubos de caldo de carne", "2 cucharadas de aceite vegetal", "1 cebolla, pelada, finamente picada", "2 dientes de ajo, pelados, finamente picados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de chile en polvo", "1 cucharadita de pimentón ahumado", "350ml / 12fl oz de vino tinto", "1 x 400 g / 14 oz pueden cortar tomates", "splash salsa Worcestershire", "2 chiles rojos, finamente picados", "800 g / 1¾lb de carne picada estofada (ver arriba)", "250 g / 9 oz de champiñones, en rodajas gruesas", "1 x 410 g / 14¼ oz puede frijoles rojos, enjuagados, escurridos", "1 cubo en existencia, disuelto en 250ml / 9fl oz de agua hirviendo", "300g / 10½oz de arroz de grano largo, cocido de acuerdo con las instrucciones del paquete, escurrido", "4 envolturas de tortilla calentadas", "1 x 142ml / 5fl oz de mantequilla crema agria", "100g / 3½ oz de queso cheddar maduro, rallado"], "method": ["Para la carne picada estofada, caliente la mitad del aceite vegetal en una sartén grande a fuego alto. Agregue las cebollas, el ajo y las hierbas y fríalos durante 3-4 minutos, o hasta que estén suaves y dorados. Apague el fuego y coloque la olla a un lado.", "Caliente un tercio del aceite restante en una sartén por separado a fuego medio. Agregue un tercio de la carne picada de ternera y fría por 4-5 minutos, o hasta que se dore.", "Transfiera la carne picada dorada a la sartén que contiene las cebollas, el ajo y las hierbas.", "Repita el proceso dos veces más con el aceite restante y los lotes restantes de carne picada. (Nota: sobrecargar la sartén no acelerará las cosas porque la sartén perderá calor, así que tómese su tiempo).", "Regrese la sartén que contiene la carne picada cocida y las verduras a fuego medio. Agregue los tomates enlatados y la salsa Worcestershire y mezcle bien la mezcla para combinar. Lleva la mezcla a fuego lento.", "Mientras tanto, desmenuce los cubos en una jarra grande a prueba de calor y agregue 500ml / 18fl oz de agua hirviendo. Revuelva hasta que los cubos de caldo se hayan disuelto.", "Agregue el caldo a la mezcla de carne de res y tomates y cocine a fuego lento. Cocine a fuego lento durante una hora, sin cubrir, o hasta que el volumen del líquido se haya reducido ligeramente y la salsa se haya espesado. Dejar de lado para enfriar.", "Mientras tanto, para el chile con carne, caliente el aceite en una sartén grande de base pesada a fuego medio. Agregue las cebollas y el ajo y fría por 3-4 minutos, o hasta que estén suaves y ligeramente dorados.", "Agregue todas las especias molidas hasta que cubran la cebolla y el ajo, luego vierta el vino tinto y hierva a fuego lento, revolviendo ocasionalmente. Cocine a fuego lento durante 6-8 minutos, o hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue los tomates picados, la salsa Worcestershire y los chiles rojos picados y continúe cocinando a fuego lento durante 4-5 minutos, o hasta que la salsa se haya espesado un poco.", "Agregue la carne picada, champiñones, frijoles y caldo de carne, revuelva bien, luego cocine a fuego lento, sin tapar, durante 40-45 minutos, revolviendo ocasionalmente, o hasta que la salsa se haya espesado y los sabores se hayan intensificado.", "Para servir, divida el arroz por igual entre cuatro platos para servir. Cuchara sobre el chile con carne. Coloque una tortilla al lado de cada porción. Coloque la crema agria y el queso en pequeños tazones y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_chilliconcarne_91965", "title": "Chili con carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, en rodajas finas", "1 zanahoria, finamente picada", "1 apio, finamente picado", "400 g / 14¼ oz de carne picada", "1 guindilla roja, sin semillas, finamente cortada en cubos", "1 cucharadita de pimentón", "1 cucharada de puré de tomate tbsp", "400 g / 14¼ oz pueden cortar tomates", "1 x 400 g / 14¼ oz pueden frijoles, drenados", "½ grupo de cilantro fresco, toscamente picado", "arroz basmati al vapor, para servir"], "method": ["Caliente el aceite de oliva en una sartén grande y profunda a fuego medio a alto. Agregue las cebollas, el ajo, la zanahoria y el apio. Freír hasta que las verduras estén blandas, pero no doradas (alrededor de ocho minutos).", "Aumente el fuego y agregue la carne picada y el chile rojo. Gírelo regularmente para dorar la carne por todos lados.", "Agregue el puré de pimentón y tomate. Cocine por tres minutos, revolviendo continuamente.", "Agregue los tomates picados y cocine a fuego lento durante 35 minutos, agregando agua si la mezcla comienza a secarse.", "Agregue los frijoles y el cilantro y cocine por otros cinco minutos.", "Sirva generosas porciones de chile con arroz basmati al vapor."], "url": "www_bbc_co_uk_food_recipes_chilliconcarnewithri_91064", "title": "Chilli con carne con arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de pan rallado fresco", "2 cucharadas de perejil fresco picado", "1 cucharadita de hojuelas de chile seco", "2 cucharadas de aceite de oliva, más extra para frotar el bistec", "sal y pimienta negra recién molida", "Filete de lomo 150 g / 5½ oz", "pequeño puñado de perejil fresco", "pequeño puñado de perifollo fresco", "pequeño cilantro fresco", "1 cucharadita de salsa de soja", "2 cucharaditas de vinagre balsámico", "2 cucharadas de aceite de oliva"], "method": ["Para el bistec, coloque las migas de pan, el perejil, el chile y la mitad del aceite de oliva en un procesador de mini alimentos, sazone bien con sal y pimienta negra recién molida y mezcle hasta que el perejil esté bien picado.", "Transfiera la mezcla de migas de pan a un plato. Frote la carne con aceite de oliva, luego revuelva en la mezcla de migas de pan.", "Caliente el aceite de oliva restante en una sartén hasta que comience a fumar, coloque el bistec en la sartén y fría por 3-4 minutos por cada lado, o hasta que esté cocido a su gusto. Deje reposar la carne durante cinco minutos, luego corte a la mitad.", "Para la ensalada de hierbas, coloque las hierbas en un recipiente, luego agregue la salsa de soja, el vinagre balsámico y el aceite y mezcle bien para cubrir las hierbas.", "Para servir, coloca la ensalada de hierbas en un plato con el bistec."], "url": "www_bbc_co_uk_food_recipes_chillicrustedsteakwi_84982", "title": "Bistec a la parrilla con ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "¼ de cebolla picada", "½ pera, pelada, sin núcleo y picada", "1 cucharada de vinagre de vino blanco", "1 cucharada de azúcar moreno", "1 cucharada de ketchup", "200g / 7 oz nuevas patatas, en rodajas", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "½ pechuga de pato, piel removida, cortada en tiras", "½ chile rojo, en rodajas finas", "1 cucharada de miel", "2 cucharadas de salsa de soja"], "method": ["Para el chutney de pera, caliente el aceite en una cacerola. Agregue la cebolla y la pera y saltee durante 2-3 minutos. Agregue el vinagre, el azúcar moreno y el ketchup. Cubra con una tapa y cocine a fuego lento durante diez minutos.", "Para las papas salteadas, ponga a hervir una olla pequeña de agua. Agregue las papas en rodajas y deje hervir durante cinco minutos hasta que estén casi cocidas, luego escurra. Calentar el aceite en una sartén y saltear las patatas a fuego alto hasta que estén doradas y tiernas. Sazonar con sal y pimienta negra recién molida.", "Para el pato, caliente el aceite en otra sartén. Freír el pato a fuego alto durante 5-6 minutos hasta que esté dorado y cocido. Agregue el chile, la miel y la salsa de soja. Retire del fuego y reserve para descansar.", "Coloque las papas en un plato y acomode las tiras de pato encima. Sirve con el chutney."], "url": "www_bbc_co_uk_food_recipes_chillifriedduckwithp_87280", "title": "Pato frito con chutney de pera y papas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "2 huevos de gallinas camperas", "sal y pimienta negra recién molida", "½ cucharadita de hojuelas de chile seco", "1 cucharada de perejil fresco picado", "2 chapatis calientes"], "method": ["Calentar el aceite en una sartén a fuego medio. Con cuidado, romper los huevos en la sartén y freír durante 2-3 minutos, o hasta que estén cocidos a su gusto.", "Coloque los chapatis tibios en un plato y coloque los huevos fritos encima.", "Para servir, sazone con sal y pimienta negra recién molida y espolvoree los copos de chile y el perejil."], "url": "www_bbc_co_uk_food_recipes_chillifriedeggs_83630", "title": "Chilli huevos fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal, más extra para freír poco", "Tofu firme de 500 g / 1 lb 2 oz, escurrido, secado al tacto con papel de cocina, cortado en cubos de 1,5 cm / ½ in", "4 cucharadas de harina de arroz (también se puede usar harina de patata o harina de maíz)", "2 cucharadas de granos de pimienta de Sichuan, aplastados", "75g / 3oz anacardos", "Vinagre de vino de arroz 150ml / 5fl oz", "150 g / 5 oz de azúcar en polvo", "4 cucharadas de salsa de soja", "2 chiles rojos, finamente cortados en cubitos", "2 cucharaditas de copos de chile seco", "Jengibre fresco de la raíz de los 10cm / 4in, pelado, rallado fino", "2 zanahorias, peladas, en juliana", "2 cucharadas de aceite de cacahuete", "200g / 7oz de arroz basmati, cocido de acuerdo con las instrucciones del paquete, escurrido", "2 huevos grandes de gallinas camperas, ligeramente golpeados", "2 cucharaditas de aceite de sésamo", "sal y pimienta negra recién molida", "4 cebolletas, finamente cortadas", "3 cucharadas de hojas de cilantro fresco picado"], "method": ["Para el tofu, vierta el aceite vegetal en una sartén profunda de base pesada hasta que tenga 3 cm de profundidad. Calienta a fuego medio. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras tanto, mezcle el tofu con las dos cucharadas restantes de aceite vegetal.", "Mezcle la harina y los granos de pimienta triturados en un tazón. Separe el tofu en la harina, sacuda el exceso, luego baje cuidadosamente el tofu recubierto en el aceite caliente y cocine el tofu durante 1-2 minutos, o hasta que estén crujientes. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina. (Puede necesitar hacer esto en lotes).", "Freír los anacardos en el aceite caliente durante 1-2 minutos, o hasta que estén dorados y crujientes. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Para la salsa de chile, caliente el vinagre, el azúcar y la salsa de soja en una sartén no reactiva hasta que la mezcla hierva. Agregue los chiles, las hojuelas de chile y el jengibre y cocine durante 1-2 minutos más o hasta que el volumen del líquido se haya reducido.", "Agregue el tofu frito, anacardos fritos y zanahorias a la sartén, revuelva bien y cocine por 1-2 minutos, o hasta que las zanahorias se hayan ablandado.", "Para el arroz frito con huevo, caliente el aceite en un wok a fuego alto, agregue el arroz y saltee durante 2-3 minutos, o hasta que el arroz esté completamente caliente.", "Batir los huevos y el aceite de sésamo juntos en un bol y agregar al wok. Revuelva freír durante 2-3 minutos más, o hasta que los huevos se hayan cocinado por completo.", "Sazonar, al gusto, con sal y pimienta negra recién molida, revolver a través de las cebolletas y el cilantro.", "Para servir, espolvorea el arroz frito con huevo en cuatro platos para servir y completa con una cucharada de tofu frito."], "url": "www_bbc_co_uk_food_recipes_chillifriedtofuwithe_93035", "title": "Tofu frito con arroz frito con huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / ¼ pinta de aceite de oliva", "150ml / ¼ pinta de aceite vegetal", "1 cucharadita de hojuelas de chile", "4 dientes", "2 vainas de cardamomo, ligeramente trituradas", "1 x 100 g / 3½ oz de filete de salmón, sin piel", "1 cucharada de aceite de oliva", "¼ de cebolla picada", "1 cucharadita de hojuelas de chile", "200g / 7oz de tomates cherry enlatados", "1 cucharada de hojas de albahaca fresca picada", "sal y pimienta negra recién molida"], "method": ["Para el salmón escalfado en chile, caliente los aceites y las especias en una cacerola a fuego medio.", "Agregue el pescado y cocine durante 8-10 minutos, o hasta que el pescado esté bien cocido. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la salsa, caliente el aceite en una sartén y fríe con cuidado la cebolla hasta que esté blanda pero no coloreada.", "Agregue las hojuelas de chile y los tomates y cocine a fuego lento durante 2-3 minutos, hasta que espese un poco. Agregue las hojas de albahaca, sazónese, al gusto, con sal y pimienta negra recién molida y revuelva.", "Para servir, coloque el pescado en un plato de servir y rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_chillipoachedsalmonw_86109", "title": "Salmón escalfado en salsa de arrabbiata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tomates de ciruela", "1 guindilla roja, sin semillas, más o menos picadas", "½ cucharadita de chiles rojos secos triturados", "¼ de pimiento rojo, aproximadamente picado", "¼ de cebolla roja, más o menos picada", "1 diente de ajo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "Polenta instantánea de 110g / 4oz", "4 x 225 g / 8oz de pechugas de pollo deshuesadas y sin piel", "1 cucharada de aceite de oliva", "110g / 4oz de hojas de cohete", "1 diente de ajo", "1 cucharada de piñones, tostados", "1 lima, solo jugo", "8 cucharadas de aceite de oliva", "3 papas para hornear grandes", "4 cucharadas de aceite de oliva", "1 cucharadita de pimentón", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los tomates, el chile, los chiles triturados, el pimiento rojo, la cebolla roja y el ajo en un procesador de alimentos y mezcle hasta formar una pasta.", "Agregue dos cucharadas de aceite de oliva y sazone, al gusto, con sal y pimienta negra recién molida.", "Coloque la pasta en un recipiente, agregue la polenta y mezcle bien.", "Coloque las pechugas de pollo entre dos pedazos de película adhesiva y aplaste ligeramente con un mazo de carne o rodillo, luego sazone con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y agregar una cucharada de aceite de oliva y las pechugas de pollo. Cocine a cada lado, hasta que estén doradas, luego colóquelas en una bandeja para hornear. Extienda la mezcla de polenta sobre la parte superior de las pechugas de pollo, luego transfiéralas al horno y tueste durante 12-15 minutos, hasta que el pollo esté completamente cocido. (Si el relleno de polenta aún está ligeramente suave, coloque el pollo debajo de una parrilla en su posición más alta durante 2-3 minutos, hasta que esté crujiente y dorado).", "Para el pesto, coloque el cohete, el ajo, los piñones, el jugo de lima y el aceite de oliva en un procesador de alimentos limpio y mezcle hasta obtener una pasta fina.", "Para las papas asadas, corta las papas a lo largo en trozos y colócalas en un tazón con aceite de oliva, pimentón y sal y pimienta negra recién molida. Mezcle bien para cubrir las papas, luego colóquelas en una bandeja para hornear. Transfiera al horno para asar durante 20-25 minutos, hasta que esté cocido y crujiente por fuera.", "Para servir, coloque cada pechuga de pollo en un plato calentado con una cucharada de pesto y unas patatas asadas al lado."], "url": "www_bbc_co_uk_food_recipes_chillipolentacoatedc_84426", "title": "Pollo con chile y polenta con pesto de rúcula y patatas asadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de cacahuete", "4 dientes grandes de ajo, aplastados", "1 cucharada de raíz de jengibre, rallado", "3 chiles rojos medianos, sin semillas y finamente picados", "Gambas de tigre cruda de 200 g / 7 oz, sin cáscara y desveladas", "400ml / 14fl oz de caldo de verduras calientes", "3 cucharadas de ketchup de tomate", "½ cucharada de salsa de soja ligera", "½ cucharadita de azúcar moreno", "1 lima, solo jugo", "1 cucharada de harina de maíz mezclada con 2 cucharadas de agua", "2 cebollas de primavera, picadas en diagonal", "1 gran cilantro puñado, toscamente picado", "250 g / 9 oz de arroz jazmín, cocinado", "ramitas de cilantro, para adornar", "1 cuña de lima"], "method": ["Caliente un wok sobre una llama alta y agregue el aceite de cacahuete.", "Agregue el ajo, el jengibre y los chiles y saltee durante 30 segundos.", "Agregue las gambas tigre y cocine durante 30 segundos más, hasta que las gambas comiencen a ponerse rosadas. Vierta el caldo de verduras calientes y deje hervir.", "Agregue la salsa de tomate, la salsa de soja liviana y el azúcar moreno y mezcle bien.", "Agregue el jugo de lima y la harina de maíz mezclada. Cocine hasta que esté reducido y ligeramente espesado - alrededor de 5-8 minutos.", "Dispersar sobre cebolletas y cilantro.", "Vierte las gambas en dos platos y acompaña con una porción de arroz jazmín cada una. Adorne con unas ramitas de cilantro y una rodaja de lima."], "url": "www_bbc_co_uk_food_recipes_chilliprawnswithjasm_83646", "title": "Gambas al ajillo con arroz jazmín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cerdo 150 g / 5½ oz, cortado en 3 medallones", "1 cucharadita de hojuelas de chile seco", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 cucharaditas de salsa de soja", "1 cucharadita de salsa Worcestershire", "2 tomates frescos, picados aproximadamente", "1 cucharada de cilantro fresco picado", "1 cucharada de perejil de flatleaf fresco picado", "1 cucharadita de semillas de sésamo"], "method": ["Para los pinchos de cerdo, espolvorear los medallones con los copos de chile y sazonar con sal y pimienta negra recién molida. Rocíe el aceite de oliva y pinche cada uno con un pincho de bambú. Caliente una sartén de plancha y cocine la carne de cerdo hasta que esté completamente cocida, aproximadamente 2-3 minutos por cada lado.", "Retire los pinchos de la sartén y agregue la salsa de soja y salsa Worcestershire a la sartén. Traiga a fuego lento y raspe los pedazos para hacer un aderezo para la ensalada.", "Para la ensalada, combine todos los ingredientes en un tazón. Rocíe los jugos de la sartén de la plancha y mezcle todo para combinar.", "Para servir, coloque la ensalada de tomate en un plato de servir y coloque los pinchos de cerdo encima. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chilliporkskewerswit_88181", "title": "Pinchos de carne de cerdo con ensalada de tomate y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9 oz de tofu de seda", "1 guindilla roja pequeña, en rodajas finas", "2 cebollas de primavera, cortadas y cortadas finamente", "1 cucharada de salsa de soja reducida en sodio", "1 cucharadita de aceite de sésamo", "1 cucharadita de salsa de ostras (o salsa vegetariana de ostras, si se prefiere)", "2 cucharadas de cilantro fresco", "arroz al vapor, para servir"], "method": ["Llena la base de tu barco de vapor con agua y llévala a ebullición. Escurra el tofu y colóquelo en una placa resistente al calor que se ajustará dentro del vaporizador. Cueza al vapor el tofu durante 15 minutos, luego escurra el exceso de agua y transfiéralo cuidadosamente a un plato de servir.", "Caliente la salsa de soja, el aceite de sésamo y la salsa de ostras juntas en una sartén pequeña hasta que estén calientes. Vierta la mezcla sobre el tofu, espolvoree con chile rojo, cebolleta y hojas de cilantro y sirva con arroz al vapor al lado."], "url": "www_bbc_co_uk_food_recipes_chillisoytofu_13912", "title": "Tofu de soja al vapor de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chillisoytofu_13912_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, pelada, picada", "1 diente de ajo, pelado, finamente picado", "½ chile rojo, picado", "500ml / 18fl oz de caldo de pollo (los vegetarianos pueden sustituir el caldo vegetariano)", "2 puñados de hojas de espinaca, lavados", "sal y pimienta negra recién molida", "2 cucharadas de crema doble, para servir"], "method": ["Caliente el aceite en una cacerola a fuego medio y fría la cebolla, el ajo y el chile por 2-3 minutos hasta que se ablanden. Agregue el caldo y lleve a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Agregue la espinaca, mezcle bien y cocine a fuego lento durante 2-3 minutos.", "Transfiera la sopa a un procesador de alimentos y mezcle hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la sopa en un tazón y rocíe con la crema."], "url": "www_bbc_co_uk_food_recipes_chillispinachsoup_92721", "title": "Sopa de espinacas y chiles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]