[{"isVegetarian": false, "title": "Breakfast stack", "url": "www_bbc_co_uk_food_recipes_breakfaststack_72030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices rye bread", "1 tomato", "50g/2oz cured ham", "2 tsp oil", "2 eggs", "1 large pickled gherkin"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Take the rye bread and place it on a plate.", "Slice tomato, place it on the rye bread.", "Take the ham and place it on top of the tomato.", "Pre-heat pan with the oil - make sure pan is not too hot, break eggs into frying pan and fry until cooked.", "Remove eggs, place on top of ham and serve with the gherkin."]}, {"isVegetarian": true, "title": "Breakfast rosti", "url": "www_bbc_co_uk_food_recipes_breakfastrosti_85073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small potato, peeled", "salt and freshly ground black pepper", "2 tbsp olive oil", "15g/½oz butter", "2 free-range eggs, fried", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grate the potato into a clean tea towel over a bowl and squeeze out the excess liquid. Season the grated potato with salt and freshly ground black pepper.", "Heat the oil in a small frying pan. Place the grated potato into the pan, press down and fry for 3-4 minutes. Push half of the butter down the edges of the rösti to crisp the edges.", "Carefully turn the rösti over using a fish slice and cook for a further 2-3 minutes, or until beginning to turn golden-brown. Push the remaining butter down the edges of the rösti and cook for a further minute.", "To serve, place the rösti onto a plate, top with two fried eggs and sprinkle over the chives."]}, {"isVegetarian": false, "title": "Breast of lamb with broccoli, anchovy and caper dressing", "url": "www_bbc_co_uk_food_recipes_breast_of_lamb_with_53662", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breast_of_lamb_with_53662_16x9.jpg", "ingredients": ["1 breast of lamb, boned", "2 tbsp chopped rosemary", "salt and pepper", "oil, for frying", "2 banana shallots, sliced", "75g/2½oz button mushrooms, sliced", "150ml/5fl oz red wine ", "568ml/1 pint chicken stock", "plain flour, for dusting", "75g/2½oz butter", "2 broccoli stalks, in quarters", "pinch salt", "6 salted anchovies, chopped", "2 tbsp superfine capers, drained", "2 tbsp cabernet sauvignon vinegar", "6 tbsp extra virgin olive oil", "1 tbsp chopped mint", "1 tbsp chopped parsley", "1 tbsp chopped tarragon", "1 red chilli, finely chopped", "chopped celery leaves"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 140C/280F/Gas 1. Lay the breast of lamb out lengthways and score it using a sharp knife. Rub in the chopped rosemary and season with salt and pepper. Cut in half into two equal pieces. Roll each half tightly like a Swiss roll and tie with string. ", "In a casserole pan, heat the oil. Add the shallots to the pan. Cook until caramelised. Add the mushrooms and then the wine and stock. Bring up to the boil and then turn down to a simmer. ", "Heat a little more oil in another pan and fry the lamb rolls to brown all over, then add them to the stock. Place a lid on the top and put into the preheated oven to cook for three hours. Remove from the oven, transfer to a clean bowl and leave to cool to room temperature. Take out the lamb and carefully remove the string. ", "Roll the lamb very tightly in cling film to keep their shape. Put them into the fridge to chill for eight hours. Pass the sauce through a fine sieve into a saucepan and cook over a medium heat to reduce the stock down to a sauce consistency. Keep it in the fridge until needed.", "When ready to serve, remove the clingfilm from the lamb and slice into discs and dust in a little flour. Heat some oil in a pan and fry until crisp and brown all over.", "For the broccoli, in a large pan, bring 150ml/5fl oz water and the butter up to the boil and add the broccoli stalks. Season with salt and cook until tender. The water and butter should emulsify to a lovely glaze. ", "Mix all of the dressing ingredients together in a bowl and leave to the side. Reheat the lamb sauce and serve the lamb discs with the broccoli and dressing on the side. "]}, {"isVegetarian": false, "title": "Breast of lamb with tartare sauce", "url": "www_bbc_co_uk_food_recipes_breastoflambwithtart_79286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.35kg/3 lb piece breast of lamb", "2 carrots", "2 onions", "1 sprig thyme", "280ml/½pint chicken stock", "1 tbsp Worcestershire sauce", "1 glass white wine", "salt and freshly ground black pepper", "seasoned flour", "1 tbsp Dijon mustard", "2 free-range eggs", "340g/12oz fresh white breadcrumbs", "1 bunch chopped fresh mint", "vegetable oil, for deep-frying", "280ml/½pint mayonnaise", "60g/2oz chopped capers", "85g/3oz chopped gherkins", "2 tbsp chopped fresh parsley", "half lemon, juice only"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas Mark 2.", "Put the piece of lamb into a ovenproof dish that has a tight fitting lid.", "Cut the carrots into quarters lengthways and cut the onions into quarters. Put into the dish with the lamb.", "Add the thyme, chicken stock, Worcestershire sauce and wine.", "Season and cover the dish with its lid. Transfer to the oven and cook for around three hours, basting every 30 minutes and turning the meat regularly. The meat should be completely tender when cooked enough.", "Remove from the oven and leave to rest. After 15 minutes remove the meat from the stock. Push out the bones and discard.", "Loosely wrap the meat in cling film and place between two heavy chopping boards. Place in the fridge and leave for a few hours or preferably overnight.", "Remove the meat from the cling film and cut into strips.", "In a clean bowl, lightly beat the eggs with the mustard. In a separate bowl place the seasoned flour. In another bowl mix the breadcrumbs together with the mint.", "Dip the strips of lamb into the seasoned flour and then into the mustard-egg mixture and finally into the breadcrumbs.", "Roll each strip carefully in your hands to make sure the breadcrumbs are well stuck on.", "In a heavy-bottomed saucepan, heat enough vegetable oil for deep frying (CAUTION: hot oil can be dangerous. Do not leave unattended).", "Deep-fry the strips until crispy and golden. Remove with a slotted spoon and drain on kitchen towel.", "For the tartare sauce (if using), mix all the ingredients together.", "Serve the hot crispy lamb strips with the tartare sauce (if using)."]}, {"isVegetarian": false, "title": "Breast of lamb baked with onions", "url": "www_bbc_co_uk_food_recipes_breast_of_lamb_baked_80591", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breast_of_lamb_baked_80591_16x9.jpg", "ingredients": ["1.6 kg/3lb 8oz lamb breast, boned, rolled and tied with kitchen string", "fine salt and freshly ground white pepper ", "2 tbsp dripping or vegetable oil ", "1.6 kg/3lb 8oz onions, thinly sliced ", "1 bay leaf", "1 tbsp red wine vinegar  ", "2-3 tbsp anchovy essence (or several finely chopped anchovies), or to taste ", "2 tbsp chopped fresh parsley "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Season the lamb with salt and freshly ground white pepper. Melt the dripping or oil in a large, lidded roomy casserole dish until hot. Place the lamb breast into the casserole dish, turn down the heat and colour well on all sides, until golden-brown. Lift out the meat and remove all fat from the dish with a spoon. ", "Add half of the onions to make a bed of onions on which to rest the lamb and add the lamb back into to the dish. Tuck in the bay leaf and cover with the remaining onions. ", "Cut a circle of greaseproof paper slightly bigger than the diameter of the dish. Dampen it, lightly grease one side, and press it onto the onions (greased side down).  Put on the lid cook in the oven for about three hours. After an hour, remove the dish to see whether the onion mixture has reduced and to check that the natural juices are running. Scrape down the side of the dish if the onions have stuck. Replace the paper and lid and place the dish into the oven again.", "After about three hours of cooking (check after another hour), push a skewer into the lamb to see how tender it is; there should be little resistance. Lift out the meat, put it into a small roasting tin and cover with foil. Turn down the oven to 140C/275F/Gas 1, and return the meat to the oven while you finish the onions.", "Remove the bay leaf from the onions and drain the onions, reserving the cooking juices. Put the onions back into the casserole. Remove any fat that has settled on the surface of the cooking juices. Pour the liquid back in with the onions, and simmer until the volume of liquid has reduced by half. Stir in the vinegar and anchovy essence.", "Season the onions to taste with salt and freshly ground black pepper. Finally, stir in the parsley. ", "Remove the lamb from the oven (if any meaty juices have exuded from the resting lamb, add them to the onions), cut off the strings and thickly slice the meat. Arrange the slices onto a hot serving dish and pile the onions alongside."]}, {"isVegetarian": false, "title": "Breast of teal with sweet potato mash and game jus", "url": "www_bbc_co_uk_food_recipes_breastoftealwithswee_84611", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 breast of teal", "drizzle olive oil", "salt and freshly ground black pepper", "1 teal carcass", "1 beef stock cube", "75ml/2½fl oz red wine", "1 garlic clove", "1 tsp white wine vinegar", "1-2 tbsp boiling water", "15g/½ oz butter", "1 small sweet potato, peeled and chopped", "25g/1oz butter", "2 tsp soy sauce", "freshly ground black pepper"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the breast of teal, cover the teal breast with a little olive oil and season with salt and freshly ground black pepper.", "Heat a small ovenproof frying pan and add the teal breast. Cook for 2-3 minutes on each side and then transfer the frying pan to the oven. Cook the breast in the oven for eight minutes, or until cooked through. Remove from the oven and leave to rest for two minutes.", "For the game jus, place the teal bones and carcass into a small saucepan with all the rest of the game jus ingredients, except the butter. Heat the saucepan over a high heat and boil for ten minutes, adding a little more boiling water if the mixture becomes too thick and dry. ", "Add the butter to the game jus and mix well.  Once the butter has melted, strain the mixture into a gravy boat.", "For the sweet potato mash, place the sweet potato into a small saucepan filled with boiling water and cook for ten minutes, or until the potato has become soft. ", "Drain the excess water from the sweet potatoes and add the butter, soy sauce and black pepper and mash with a potato masher, until the mash becomes smooth.", "To serve, place the mash onto a clean plate.  Slice the teal breast thinly and place it on top of the mash.  Pour the game jus over the top of the teal breast."]}, {"isVegetarian": false, "title": "Bresaola salad", "url": "www_bbc_co_uk_food_recipes_bresaola_salad_04379", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bresaola_salad_04379_16x9.jpg", "ingredients": ["3 slices bread", "2 tbsp extra virgin olive oil", "4 tbsp extra virgin olive oil", "2 tbsp white wine vinegar", "salt and freshly ground black pepper", "1 garlic clove, left whole and pierced with a knife", "2 little gem lettuce, leaves separated", "small handful wild rocket", "100g/3½oz radishes, sliced", "20 black olives", "2 free-range eggs, hard-boiled and quartered", "80g/3oz bresaola, thinly sliced", "2 tbsp finely shaved fresh Parmesan, to serve"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the crusts from the bread and slice into small triangles. Heat the oil in a frying pan, add the bread and fry on both sides until golden-brown. Remove from the pan and drain on kitchen paper.", "Meanwhile make the dressing. Combine all the dressing ingredients and whisk together with a fork until you obtain a creamy consistency. Remove the garlic clove from the dressing.", "Arrange the lettuce leaves, rocket, radishes and olives on a serving dish, pour over the dressing and toss well. Arrange the eggs, bresaola and fried bread in the dish and scatter over the parmesan shavings."]}, {"isVegetarian": false, "title": "Brie brioche pie", "url": "www_bbc_co_uk_food_recipes_brie_brioche_pie_75406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong flour", "1 tsp salt", "25g/1oz caster sugar", "5g instant yeast", "70ml/2½fl oz milk", "3 medium free-range eggs", "125g/4½oz unsalted butter, softened", "280g/9½oz prosciutto", "3 tbsp cranberry sauce", "1 large brie (approximately 750g/1lb 10oz), cut into slices", "1 free-range egg, beaten, for glazing"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Place the flour into the bowl of a food mixer fitted with a dough hook. Add the salt and sugar to one side and the yeast to the other. Add the milk and eggs and mix on a slow speed for two minutes. Increase the speed and mix for a further 6-8 minutes. The dough should be glossy and elastic. ", "Add the softened butter and continue mixing for five minutes, scraping down the bowl periodically to ensure that the butter is thoroughly incorporated. The dough will be very soft at this stage.", "Place the dough into a bowl, cover and chill overnight to allow the dough to firm up.", "When you’re ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.", "Tip the dough onto a lightly floured surface and fold it in on itself a few times to knock out the air.  Roll the dough out to 5mm/¼in thickness and into a large circle. Lay half the prosciutto on the base. Spread the cranberry sauce over the top. Place the brie on top of the cranberry sauce. Use the remaining prosciutto to cover the brie.", "Stretch the dough over the ham to encase the brie and seal the edges.", "Turn over your brie parcel and place on a baking tray. Glaze the dough with the beaten egg. Using the back of a knife score a criss-cross pattern over the parcel. ", "Bake for 20-25 minutes, or until golden-brown."]}, {"isVegetarian": true, "title": "Brie en papillote with spicy pear and chilli dressing", "url": "www_bbc_co_uk_food_recipes_brieenpapillotewiths_84990", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "75g/2½oz Brie", "1 tsp fresh thyme leaves", "¼ pear, cored, sliced", "dash olive oil", "salt and freshly ground black pepper", "15g/½oz butter", "½ pear, cored, chopped", "1 tbsp caster sugar", "2 tsp white wine vinegar", "pinch chilli flakes", "dash olive oil", "bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease a 20cm/8in x 20cm/8in square of aluminium foil or baking parchment. Place the Brie into the middle of the foil or parchment, add the thyme, pear and a little olive oil and season with salt and freshly ground black pepper.", "Seal the foil or parchment at the edges to make a bag enclosing the ingredients. Place onto a baking sheet, transfer to the oven and bake for 6-7 minutes.", "For the spicy pear and chilli dressing, melt the butter in a small saucepan, add the chopped pear and cook for 2-3 minutes. Add the sugar, vinegar, chilli flakes and olive oil and cook for a further 1-2 minutes. ", "To serve, place the Brie parcel onto a serving plate, open it and pour over the dressing. Serve with bread to dip into the hot cheese."]}, {"isVegetarian": false, "title": "Brie-stuffed chicken with spiced butternut squash wedges", "url": "www_bbc_co_uk_food_recipes_briestuffedchickenwi_79901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "25g/1oz sun-blushed tomatoes", "50g/2oz Brie", "2 slices speck ham", "splash of vegetable oil", "1 tsp oregano", "pinch curry powder", "pinch turmeric", "1 tbsp olive oil", "200g/8oz butternut squash, peeled and cut into chips", "2 tbsp red onion, finely sliced", "50ml/2fl oz red wine", "50ml/2fl oz beef stock", "25g/1oz unsalted butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 225C/425F/Gas 7.", "For the chicken, using a sharp knife, carefully cut into the side of the chicken breast to create a pocket. Stuff the pocket with the Brie and tomatoes. Press down to seal the stuffing inside.", "Wrap the stuffed chicken breast with the speck slices.", "Place a splash of oil in an ovenproof pan over a high heat. Place the speck-wrapped chicken breast into the pan and cook the chicken for one minute on each side, to brown. Transfer into the oven to roast for 15-20 minutes, or until cooked through.", "For the squash wedges, place the oregano, turmeric, curry powder and oil into a large bowl. Add the squash and mix well to coat. Place into on a roasting tray and place into the oven to roast for 15 minutes, or until cooked through. Turn the squash occasionally, so that it will brown evenly.", "For the sauce, place the red onion in a saucepan over a high heat. Add the red wine and beef stock and bring to the boil. Reduce the heat to a simmer and cook until the liquid has reduced by half.", "Add the butter to the sauce and remove from the heat. Stir the butter into the sauce to give a glossy finish.", "To serve, place the chicken onto a plate with a pile of squash wedges and drizzle the sauce around."]}, {"isVegetarian": false, "title": "Brie-stuffed chicken with a crunchy sweet potato mash", "url": "www_bbc_co_uk_food_recipes_briestuffedchickenwi_84023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "25g/1oz Brie, sliced", "4 fresh basil leaves", "sea salt and freshly ground black pepper", "1 tsp olive oil", "½ cooked sweet potato, boiled until cooked through", "1 tbsp olive oil", "15g/½oz butter", "25g/1oz unsalted cashew nuts, chopped", "50g/2oz mangetout, blanched", "1 tsp olive oil", "few fresh basil leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the chicken, cut a pocket down the side of the beast using a sharp knife and stuff with the Brie and basil, then season, with sea salt and freshly ground black pepper.", "Heat the oil in an ovenproof frying pan over a high heat. Place the chicken breast in the pan and cook for two minutes, on each side, until golden brown.", "Place the frying pan into the oven and roast for 15-20 minutes, or until completely cooked through.", "For the sweet potato, place the cooked potato, oil and butter into a bowl and mash, then fold in the cashew nuts.", "To serve, toss the mangetout with the oil in a bowl and place on a serving plate. Place the chicken breast and mashed potato onto the plate. Garnish with a few basil leaves."]}, {"isVegetarian": false, "title": "Brill baked in seaweed with clams, fennel and coco beans", "url": "www_bbc_co_uk_food_recipes_brill_baked_in_seaweed_42689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz fresh coco de paimpol (French white Paimpol beans)", "1litre/1¾ pint chicken stock", "1 bouquet garni (thyme, bay leaf, garlic, black peppercorns wrapped together with kitchen string)", "200g/7oz palourde clams", "75ml/2½fl oz white wine", "2 banana shallots, finely chopped", "50g/1¾oz dulse", "50g/1¾oz nori", "50g/1¾oz sea lettuce", "150g/5½oz butter ", "1 x 180g-200g/6-7oz portion of brill ", "1 tbsp fine capers, drained and chopped", "5 sprigs dill, chopped", "1 lemon, juice only", "1 bulb fennel, ½ diced and ½ shaved on a mandoline, keep fennel tops", "2 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7.", "Cook the beans for 15-20 minutes in 1litre/1¾ pint of water and the chicken stock with the bouquet garni. Cook gently and do not boil - otherwise the beans will break up.", "Heat a saucepan with a lid and cook the clams with the white wine and one of the shallots, until the clams open, then drain in a sieve, reserving the juice. Pick the meat from the clams and discard the shells.", "Line a small heavy-based casserole dish with the three types of seaweed (reserve a few pieces of dulse for the garnish).", "Heat a frying pan with a little of the butter and fry the fish on one side until golden-brown. Turn over, remove from the pan and place into the pan with the seaweed. ", "Into the same hot pan you used to fry the fish, put a good sized spoonful of butter and the other finely chopped shallot, capers, half the chopped dill, clam juices and a few drops of lemon juice. Bring up to the boil and then pour the mixture over the fish. Place the lid onto the pan and cook in the oven for 5-6 minutes.", "Add the fennel shavings (reserving the diced fennel), the remaining chopped dill and fennel tops if you have them. Season with salt, lemon juice and olive oil and add half of the reserved dulse. Set aside.", "Place half of the coco beans in a blender and purée; finish with a few drops of olive oil, some butter (reserve a few knobs) and the lemon juice. Drain the remaining coco beans, add the diced fennel and a little chopped dulse.", "Remove the fish from the casserole dish and reserve. Strain the juices from the seaweed and add a splash to the whole coco beans. Place the beans back on the heat and bring to the boil, add a couple of knobs of butter and stir until the beans are glazed with butter. Add the reserved clam flesh. Taste and add a few more drops of lemon juice if necessary.", "To serve, place a good-sized spoonful of purée in the centre of each plate, make a well with your spoon, place the beans on top with the fish and a small amount shaved fennel salad."]}, {"isVegetarian": false, "title": "Brill fillet with clams cooked in cider", "url": "www_bbc_co_uk_food_recipes_brill_fillet_with_clams_89947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 banana shallot, finely chopped", "50g/1¾oz butter", "8 clams, rinsed under colder running water", "½ garlic clove, chopped", "100ml/3½fl oz cider ", "1 whole brill (about 2kg/4lb 8oz) ", "25g/1oz freshly podded peas", "vegetable oil, for frying", "10 small girolles (also known as chanterelle mushrooms)", "50ml/2fl oz double cream", "1tbsp crème fraîche", "8 sea kale leaves", "4 courgette ribbons, sliced into long ribbons using a vegetable peeler", "pinch of freshly chopped tarragon", "dill and edible flowers, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Gently fry a pinch of the shallots in a little butter. Add the clams, garlic and cider then cover and steam lightly. Once the clam shells are open pass through a colander reserving the stock (discard any clams that do not open).", "Fillet the brill then remove the skin, portion into 140g/5oz fillets.", "Blanch the peas in boiling salted water for 1-2 minutes, then refresh in cold water and set aside.", "Heat a non-stick frying pan over a low heat. Add a little vegetable oil, salt, pepper and the fish. Cook slowly until golden-brown.", "Meanwhile, add a knob of butter and a pinch of shallots to a separate pan. Gently fry until softened, then add the mushrooms and cook for a minute, but do not colour. Add the reserved cooking juices from the cockles and cook until the volume of liquid has reduced by half. Add the cream and crème fraîche and briefly bring back to the boil. Reduce the heat to low.", "The fish should be ready to turn over now, so season the exposed side and turn over.", "Drop the peas and cockles into the sauce to warm through.", "In a sauté pan or a large frying pan, add 50ml/2fl oz water and a knob of butter. When the butter is melted, add the kale and courgettes, plus a little salt and pepper. Stir fry for 2 minutes or until the vegetables are just tender. ", "Place the cooked fish on serving plates and pile the courgette and sea kale alongside. Put the tarragon into the sauce, taste to check the seasoning and add to the plates. Garnish with dill and edible flowers."]}, {"isVegetarian": false, "title": "Brill with fennel pollen wrapped in ‘spaghetti’ of potato", "url": "www_bbc_co_uk_food_recipes_brill_with_fennel_pollen_78515", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Maris Piper potato ", "2 x 180g/6oz boneless brill fillets, skin off", "2g fennel pollen", "sea salt and freshly ground black pepper", "dash oil", "knob of butter", "1 lemon, juice only", "dash oil", "1 banana shallot, finely chopped ", "1 garlic clove, finely chopped", "250ml/9fl oz vegetable stock", "250ml/9fl oz whipping cream", "1 large handful flatleaf parsley, leaves only", "3 mixed heritage tomatoes, sliced", "drizzle extra virgin oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the fish, peel and top and tale the potato and put on a fruit and vegetable spiraliser set with a fine strand blade. Use according to manufacturer’s instructions, twisting the handle to create fine potato strands.", "Season the fish fillets with fennel pollen and salt and pepper. Wrap the potato strands neatly around the fish portions.", "Heat a non-stick pan to a medium heat, add a splash of oil and a knob of butter and fry the fish on both sides for around two minutes, or until golden-brown.  Line a baking tray with greaseproof paper. Transfer the fish to the lined baking tray and cook in the preheated oven for a further six minutes.", "For the sauce, heat a dash of oil in a saucepan and fry the shallot and garlic until softened. Add the stock and cook until the volume has reduced by half, add the cream and cook until reduced by half again.", "Pour the sauce base into a blender or food processor and blend with parsley leaves on full power to achieve a vibrant green sauce.", "For the tomatoes place the tomatoes on a baking tray, season with salt and pepper and drizzle with a little extra virgin oil. Pop in the oven to warm through for a minute.", "Remove the fish from the oven and squeeze over a little lemon juice. Arrange the tomato slices on each of two serving plates, place the fish on top and drizzle around the sauce."]}, {"isVegetarian": false, "title": "Brill with spiced carrots", "url": "www_bbc_co_uk_food_recipes_brill_with_toffee_and_85667", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz chicken stock", "1 tbsp vadouvan (a spice mix similar to masala)", "12 baby carrots, washed and peeled", "50g/1¾oz butter", "8 tbsp olive oil ", "2 tsp aged balsamic vinegar ", "2 large carrots, shredded into thin strips ", "1 lemon, finely grated zest only", "300ml/10fl oz full-fat coconut milk", "250ml/9fl oz full-fat milk", "1 tsp cardamom pods, cracked ", "5 lime leaves ", "10g ground ginger ", "1 pinch rock salt ", "4 x 150g/5½oz brill fillets ", "1 tbsp coriander cress", "leaves from the baby carrots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the spiced carrots, add the vadouvan spice to the chicken stock and bring to a simmer. Put the carrots in the stock and cook for 5–7 minutes until tender. Remove the carrots, increase the heat and reduce the volume of liquid by half. Whisk in the butter and set the stock and carrots aside.", "For the vinaigrette, mix all ingredients together in a bowl until well combined. Set aside.", "For the fish, pour the coconut milk and milk into a large saucepan. Stir in the ginger, cardamom pods, lime leaves and salt. Bring to a gentle simmer over a medium heat, then add the brill fillets and cook them gently for 3–4 minutes. Turn off the heat, but leave the fish in the poaching liquid to keep warm. ", "To serve, return the spiced carrots to the reduced stock and heat until the carrots are warm and glazed. ", "Using a fish slice, remove the fish fillets from the poaching liquid and transfer to serving plates. Place the spiced carrots alongside. Dress the fish and carrots with the vinaigrette and garnish with cress and baby carrot leaves."]}, {"isVegetarian": false, "title": "Brill en papillote", "url": "www_bbc_co_uk_food_recipes_brillenpapillote_88911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz soy sauce", "50ml/2fl oz sake", "50ml/2fl oz mirin ", "1 tbsp sesame oil ", "2 large banana leaves, steamed and softened the hard edge removed so they roll up (available from some Asian grocers)", "2 carrots, cut into fine strips ", "3 spring onions, cut into fine strips ", "1 small handful basil ", "2 sprigs fresh thyme, leaves only", "5cm/2in root ginger, peeled, cut into fine strips ", "4 x 200g/7oz pieces brill with the bone in"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 8.", "Whisk the soy sauce, sake and mirin and the sesame oil together in a bowl and set this dressing aside.", "Place each banana leaf into a bowl so that it follows the shape of the bowl. Place the carrots, spring onions, basil, thyme leaves and ginger into a clean bowl and mix well. Place a little of the vegetable, herb and ginger mixture into the dip of each banana leaf (reserving half of the vegetables for later), then top with a piece of brill.", "Spoon a little of the dressing over the top, then cover with the reserved vegetable, herb and ginger mixture and any remaining dressing.", "Fold the banana leaf over to cover the filling and tie with cook's string to completely seal as a parcel.", "Place the banana leaf parcels onto a baking tray and transfer to the oven to cook for 10-12 minutes.", "To serve, place each parcel onto a plate and open them at the table in front of your guests."]}, {"isVegetarian": false, "title": "Brill poached in red wine", "url": "www_bbc_co_uk_food_recipes_brillpoachedinredwin_85659", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shallot, sliced", "1 sprig fresh thyme", "2 stalks fresh parsley", "1 garlic clove ", "200ml/7fl oz red wine", "4 x brill fillets, about 150g/5oz each", "salt and freshly ground black pepper", "50g/2oz cold butter", "50ml/2fl oz double cream", "100g/3½oz butter", "400g/14oz potatoes, boiled, drained, mashed", "150g/5oz savoy cabbage, shredded, boiled", "8 spring onions, chopped", "pinch freshly grated nutmeg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the brill, place the shallot, thyme, parsley, garlic and wine into a large deep frying pan and bring to the boil.", "Turn down the heat to a gentle simmer. Add the brill and poach for 5-6 minutes, or until just cooked. Remove from the pan, set aside and keep warm.", "Strain the cooking liqueur into a separate pan and bring to the boil. Boil rapidly to reduce the liquid volume by about two thirds.", "Season the sauce with salt and freshly ground black pepper, then whisk in the cold butter. Do not bring the sauce to the boil again.", "For the colcannon, place the cream and butter into a large bowl with the warm mashed potato and mix well.", "Add the cabbage and spring onions and fold together. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of colcannon onto four plates. Place a piece of brill onto each, spoon over some of the sauce and finish with a little freshly grated fresh nutmeg."]}, {"isVegetarian": false, "title": "Brined roast turkey", "url": "www_bbc_co_uk_food_recipes_brined_roast_turkey_29599", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz salt", "250g/9oz brown sugar", "2 cinnamon sticks", "5 cloves", "1 bunch thyme", "4 bay leaves", "2–3 heads garlic ", "1 tsp black peppercorns ", "3 clementines, cut in half to squeeze", "2 white onions, chopped", "few whole star anise", "1 x 5kg/11lb good-quality free-range turkey", "dash olive oil", "50g/1¾oz butter, softened ", "few rashers streaky bacon"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the brine, combine all the ingredients in a large pan with 6 litres/10½ pints water. Slowly bring to the boil, stirring, to dissolve the sugar and salt. Remove from the heat and allow to cool completely.", "Pour the brine into a large, sterilised bucket. Add the turkey and leave for two days in the fridge or a very cold room. The turkey must be completely submerged under the brine. Use weights to keep it from floating up (plastic bottles of water work well).", "Preheat the oven to 170C/150C Fan/Gas 3. Remove the turkey from the brine and pat dry.", "Rub the turkey with olive oil and season with salt and pepper. Spread with the butter and the cover with streaky bacon. Cook for about three hours, or until the juices run clear when the meat is pierced in the thickest part. Leave to rest for at least fifteen minutes and serve in slices."]}, {"isVegetarian": false, "title": "Aubergine fritters with cumin and turmeric crusted mackerel", "url": "www_bbc_co_uk_food_recipes_brinjalbharjiewithac_88615", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "½ onion, finely chopped", "3 garlic cloves, crushed", "½ tsp ground turmeric", "1 tbsp tomato purée", "200ml/7fl oz vegetable stock", "100ml/3½fl oz white wine", "1 tsp caster sugar", "1 small aubergine, cut into 2cm/1in cubes", "½ pint vegetable oil, for deep frying", "2 tbsp chopped fresh coriander", "1 tsp ground turmeric", "1 tsp ground cumin", "salt and freshly ground black pepper", "1 mackerel fillet, skin scored", "1 tbsp olive oil", "small bunch fresh chives, cut into 5cm/2in lengths", "½ lime, cut into wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the aubergine fritters, heat the oil in a pan and gently fry the onion and garlic for 2-3 minutes. Add the turmeric, tomato purée, stock, wine and sugar and bring to a gentle simmer for about  five minutes.", "Meanwhile, heat the vegetable oil for deep frying in a large saucepan and heat until a small cube of bread turns golden-brown in 30 seconds. (CAUTION: do not leave oil unattended as hot oil can be dangerous.) Carefully add the aubergine cubes and fry for 4-5 minutes, or until golden-brown.", "Remove with a slotted spoon and drain on kitchen towel before stirring them gently into the onion and spices. Finally, stir in the coriander.", "For the cumin and turmeric crusted mackerel, combine the spices in a bowl and coat the fish with the mixture. Season, to taste, with salt and freshly ground black pepper. Heat the oil in a frying pan and fry the mackerel until golden-brown on both sides, about 3-4 minutes. Transfer the pan to the oven to continue cooking for 8-10 minutes.", "To serve, place the fish in the centre of a serving plate and surround with the aubergine fritters. Garnish with chopped fresh chives and lime wedges."]}, {"isVegetarian": true, "title": "Aubergine fritters with sautéed spinach, yoghurt and paprika", "url": "www_bbc_co_uk_food_recipes_brinjalbharjiewithsa_88614", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "½ onion, finely chopped", "3 garlic cloves, crushed", "½ tsp ground turmeric", "1 tbsp tomato purée", "200ml/7fl oz vegetable stock", "100ml/3½fl oz white wine", "1 tsp caster sugar", "1 small aubergine, cut into 2cm/1in cubes", "½ pint vegetable oil, for deep frying", "2 tbsp chopped fresh coriander", "1 tbsp olive oil", "225g/8oz spinach", "freshly grated nutmeg, to taste", "1 tbsp Greek yoghurt", "paprika, for sprinkling"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aubergine fritters, heat the oil in a pan and gently fry the onion and garlic for 2-3 minutes. Add the turmeric, tomato purée, stock, wine and sugar and bring to a gentle simmer for about  five minutes.", "Meanwhile, heat the vegetable oil for deep frying in a large saucepan and heat until a small cube of bread turns golden-brown in 30 seconds. (CAUTION: do not leave oil unattended as hot oil can be dangerous.) Carefully add the aubergine cubes and fry for 4-5 minutes, or until golden-brown. Remove with a slotted spoon and drain on kitchen paper.", "Gently stir the aubergine fritters into the onion and spice mixture. Stir in the coriander.", "For the sautéed spinach, heat the oil in a wok and add the spinach. Cook for 1-2 minutes, until wilted. Grate over the nutmeg and stir to combine. ", "To serve, arrange the spinach into a ring on a serving plate and pile the aubergine fritters into the centre. Top with the yoghurt and sprinkle with paprika."]}, {"isVegetarian": false, "title": "Brioche sausage roll (Saucisson brioche)", "url": "www_bbc_co_uk_food_recipes_brioche_sausage_roll_01493", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large saucisson, or other soft French sausage", "1 x 7g/¾oz sachet of fast-action dried yeast", "1 tsp caster sugar", "125ml/4fl oz warm milk", "500g/1lb 2oz plain flour, plus extra for dusting", "1 tsp fine sea salt", "2 tbsp caster sugar", "4 medium eggs, beaten", "175g/6oz butter, softened, plus extra for greasing", "1 egg yolk, beaten, for glaze"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the brioche, sprinkle the yeast and caster sugar on to the warm milk in a small bowl. Whisk them together lightly, then leave in a warm place for 10 minutes or until a light foam forms on the surface.", "Sift the flour, salt and caster sugar into a large mixing bowl. Make a well in the centre and pour in the yeast mixture and the beaten eggs. Mix together with a wooden spoon until the mixture forms a ball.", "Turn the dough out on to a floured surface and knead it gently for about 5 minutes until smooth. Gradually add the softened butter, a teaspoon at a time, kneading well between each addition. It will take about 10 minutes to incorporate the butter and the dough will be very sticky.", "On a clean floured surface and using clean hands, sprinkle the dough with flour and continue to knead lightly for 10 minutes until the dough is very pliable, smooth and no longer sticky. Place it in a large buttered bowl and cover with a clean cloth. Leave in a warm place for 1½ hours until well risen and spongy.", "Turn the dough back on to a lightly floured surface and knock it back with your knuckles. ", "Knead for a minute or so, then flatten the dough slightly and wrap it around the saucisson, pressing the edges firmly to seal. ", "Place it in a lightly buttered 900ml/1½ pint loaf tin and cover loosely with cling film. Leave in a warm place to prove for 45 minutes or until the dough is well risen.", "Preheat the oven to 180C/350F/Gas 4. ", "Brush the brioche lightly but generously with beaten egg yolk and bake for 35–40 minutes until risen and golden brown. ", "Cool it in the tin for 10 minutes, then turn out and cool on a wire rack. ", "Serve in thick slices."]}, {"isVegetarian": true, "title": "Brioche toast with caramelised pears and ginger syrup", "url": "www_bbc_co_uk_food_recipes_brioche_toast_with_41352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large free-range eggs", "4 tbsp maple syrup ", "½ vanilla pod, cut in half lengthways and seeds scraped out", "pinch of salt ", "100g/3½oz demerara sugar, plus 1 tbsp for the caramelised pears", "50g/1¾oz pecan nuts", "60g/2¼oz unsalted butter", "4 slices brioche", "3 conference pears, peeled, cored and cut into thick slices", "75g/2½oz stem ginger in syrup, finely chopped", "100ml/3½fl oz syrup, reserved from the stem ginger", "4 tbsp crème fraîche", "1 unwaxed lemon, zest and a little juice", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the eggs, maple syrup, vanilla seeds and a pinch of salt together in a large bowl. ", "For the caramelised pecans, heat the sugar in a small pan until it turns a deep caramel colour (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.). Add the nuts and stir well to coat. Pour the mixture onto a baking tray lined with non-stick baking paper. Leave to cool and harden for a few minutes, then chop into pieces.", "Melt 50g/1¾oz butter in a large non-stick frying pan. Dip the brioche slices into the egg mixture then pan fry in the butter for 2-3 minutes on each side, or until golden brown.", "Heat the remaining butter in a non-stick pan and add the sliced pear, reserving four slices for a garnish. Add a tablespoon of sugar to the pan and cook for 2-3 minutes. Then add the chopped ginger and syrup. Cook for a further 1-2 minutes until the liquid has reduced and the pears have caramelised.", "Arrange the toasted brioche on four plates, top with the caramelised pears and fresh pear slices, crème fraiche and a squeeze of lemon and zest. Scatter with chopped pecans and dust with icing sugar. "]}, {"isVegetarian": true, "title": "Brioche donuts filled with apple compôte", "url": "www_bbc_co_uk_food_recipes_briochedonutsfilledw_74853", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1¼oz fresh yeast", "25ml/1fl oz water", "500g/1lb 1½oz strong flour", "pinch salt", "20g/¾oz caster sugar", "4 eggs", "4 egg yolks", "500g/1lb 1½oz butter, cold and diced", "6 tsp caster sugar", "1 tsp cinnamon ", "groundnut oil, for deepfrying", "10g/½oz butter", "6 Bramley apples, peeled and chopped ", "150g/5¼oz caster sugar ", "1 cinnamon stick ", "1 lemon, zest only"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Prepare the dough by adding a few drops of the water to the yeast and leave at room temperature to become frothy and creamy.  ", "Put the flour, salt and sugar in a bowl, and tip in the yeast and the remainder of the water.  Add the eggs and egg yolks and finally, the butter.  Draw together with your hands, then knead until the dough is silky smooth.  ", "Break off ball sized pieces and roll into balls. Place on a baking sheet, with plenty of room between each ball. ", "Leave to prove in a warm place until the balls have doubled in size.", "Meanwhile, prepare the compote.  Heat the butter in a heavy-bottomed pan.  ", "Add the apples, sugar, cinnamon and lemon zest and heat gently until the fruit is stewed. Remove the cinnamon stick. Transfer the stewed fruit to a squeezy plastic bottle.", "To cook the donuts, heat ground nut oil in a deep fat fryer to 190C/375F.  To test if oil is the correct temperature, drop a small cube of bread in the oil, if it sizzles and turns golden the oil is ready to use. (CAUTION: hot oil is very dangerous. Do not leave unattended.)  Re-shape the balls then drop them in the hot oil.  ", "When they are golden brown, fish the balls out with a slotted spoon and sit on a piece of paper towel.  ", "Combine the caster sugar with the cinnamon.  ", "When the donuts are cool enough to handle, roll them in the cinnamon sugar, then take the bottle of apple compote and push gently into each donut, squeezing to release a dollop of compote."]}, {"isVegetarian": true, "title": "Brioches à tête", "url": "www_bbc_co_uk_food_recipes_brioches__ttes_39328", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brioches__ttes_39328_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "50g/1¾oz caster sugar", "10g/⅓oz fast-acting yeast", "7g/¼oz salt", "140ml/5fl oz full-fat milk", "6 free-range eggs, one egg beaten for egg wash", "250g/9oz unsalted butter, softened"], "serves": "Makes 16 brioche têtes", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the flour, sugar, yeast, salt, milk and five eggs into a free-standing food mixer and mix, for about five minutes, to a smooth dough. If mixing by hand, this will take about eight minutes.", "Add the butter to the dough and mix for a further five minutes in the mixer, or 10 minutes by hand. Put the dough into a bowl, cover and leave in the fridge overnight.", "The dough should now be stiff and easily shaped. Cut the dough into 50g/1¾oz pieces and divide 45g/1½oz for the brioche bodies and 5g/¼oz for the brioche heads. ", "Using your hands, shape the dough pieces into balls. Put each large piece of dough into a brioche mould and push a smaller dough on top of each once. Leave the brioche in a warm place to rise for one hour.", "Preheat the oven to 200C/400F/Gas 6. Brush the brioche with the egg wash and bake for 20 minutes, or until golden-brown. ", "Transfer to a wire rack to cool."]}, {"isVegetarian": false, "title": "British beef Raj curry", "url": "www_bbc_co_uk_food_recipes_british_beef_raj_curry_70957", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/british_beef_raj_curry_70957_16x9.jpg", "ingredients": ["25g/1oz butter", "750g/1lb 10oz chuck steak, cut into 4cm/1½in cubes", "2 medium onions, sliced", "3 garlic cloves, crushed", "1 tsp Kashmiri chilli powder", "1 tsp ground turmeric", "1½ tbsp garam masala", "1½ tsp salt", "600ml/20fl oz beef stock", "50g/1¾oz desiccated coconut", "100g/3½oz sultanas", "choose from: Bombay duck (or any dried, salted fish such as dried anchovies, available from Asian shops), apple chutney, tamarind chutney, sliced bananas, grated coconut and/or poppadoms"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large, sturdy pan over a medium heat. Add the steak, in batches, and fry for a few minutes until browned and then remove to a plate. Add the onions to the same pan and fry for 10 minutes, or until softened and golden-brown. ", "Add the garlic and fry for one minute, then return the meat to the pan, along with any juices on the plate. Stir in the chilli powder, turmeric, one tablespoon of the garam masala, and the salt, and cook for one minute.", "Add the stock, followed by the coconut and sultanas. Bring to a simmer, cover and cook over a low heat for 45 minutes to an hour or until the beef is tender. Stir in the remaining garam masala and serve."]}, {"isVegetarian": false, "title": "Brisbane prawn soufflé", "url": "www_bbc_co_uk_food_recipes_brisbaneprawnsouffle_13045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter\t\t\t\t", "15g/½oz flour\t\t", "230ml/8fl oz milk\t", "3 eggs, separated, whites whipped stiffly\t\t\t", "85g/3oz cheese, grated\t\t", "1 tbsp brandy\t\t\t", "170g/6oz prawns (shelled weight), large shrimp, cut into 1cm/½in pieces\t", "30g/1oz butter\t\t\t", "1 tbsp brandy\t\t\t", "salt,white peppercorns, cayenne, nutmeg, to season"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a souffle dish well and preheat a baking sheet in the oven at 190C/375F/Gas 5.", "Melt the butter in a pan, add the flour to make a roux, then add milk gradually.", "Allow to cool.  Beat in the yolks and cheese until smooth.", "Chop 25g/1oz of the prawns very finely and add to the sauce, also add half the brandy.  Season quite highly with salt, pepper, cayenne and nutmeg.", "Fold the mixture into the stiffly-beaten whites.", "sauté the remaining prawns in clarified butter for 1 minute, add the remaining brandy and set alight.", "Place half the souffli mixture in the dish, place flamed prawns on top, and cover with the remaining mixture.", "Place in the preheated oven and bake 40 minutes."]}, {"isVegetarian": true, "title": "Broad bean and goats’ cheese bruschetta", "url": "www_bbc_co_uk_food_recipes_broad_bean_and_goats_69027", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_goats_69027_16x9.jpg", "ingredients": ["400g/14oz fresh broad beans, (about 300g/10½oz when podded)", "1 whole red chilli", "2 fat garlic cloves, finely chopped", "1 spring onion, thinly sliced", "1 lemon, zest and juice only \t", "1 tbsp dried oregano or 2 tbsp fresh chopped oregano", "½ loaf sourdough bread, sliced", "4 tbsp olive oil", "200g/7oz soft goats’ cheese"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan filled with boiling water. Blanch the beans very briefly (just to soften, not to cook them through).  Drain and set aside to cool.", "Roast the chilli over a direct flame on the hob until blackened a little, but not completely charred. Alternatively, char them under a hot grill. Slice open and remove the seeds. Cut the flesh into thin ribbons. ", "Mix the chilli, garlic, spring onion, lemon zest and juice together. Add the oregano and broad beans and lightly crush them as you mix. You don’t want a smooth purée, but it needs to hold together.", "Heat a large griddle pan and drizzle the sliced sourdough with a little olive oil. Place on the griddle and cook on both sides for 1-2 minutes, or until the bar marks appear.", "Remove from the heat and spread with the goats’ cheese. Top with the broad bean mixture and serve."]}, {"isVegetarian": false, "title": "British tapas", "url": "www_bbc_co_uk_food_recipes_british_tapas_94352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 camembert-style cheese such as Tunworth", "1 sprig rosemary", "1 tbsp clear honey", "freshly ground black pepper", "slices of baguette", "shop-bought pickle or chutney", "8 quails’ eggs, at room temperature ", "malt vinegar (enough to fill a small bowl)", "200g/7oz pork mince", "a few leaves fresh sage, chopped", "½ tsp salt", "½ tsp freshly ground black pepper", "1 free-range egg, beaten", "plain flour, for dusting", "100g/3½oz panko Japanese breadcrumbs", "vegetable oil, for deep frying", "brown sauce, to serve", "4 springs fresh mint, plus extra for garnish", "250g/9oz frozen peas", "1 tbsp crème fraîche", "salt and pepper, to taste"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked cheese and pickle, preheat the oven to 180C/350F/Gas 4. Take the plastic wrapper off the cheese and place it back in its box, or create a tin foil package for it to sit in. ", "Pierce the top of the cheese with a small, sharp knife. Push a few rosemary leaves into each hole, drizzle with honey and sprinkle with freshly ground black pepper. Bake for 15-20 minutes, or until the top is golden-brown and the cheese is bubbling up through the cracks. Serve with slices of baguette and shop-bought pickle.", "For the mini Scotch eggs, carefully place the quails’ eggs into a pan of boiling water and cook for two minutes. Remove from the pan straight into a bowl of iced water to stop them cooking further.", "Transfer the eggs to a bowl of malt vinegar to soak for around 10 minutes - this will make the shells easier to peel", "Meanwhile combine the mince, sage, salt and pepper in a bowl and set aside.", "Crack the egg into a bowl and beat. Place a few tablespoons of plain flour in another bowl and the breadcrumbs in a third bowl.", "Carefully peel the quails’ eggs. Roll them in flour and then mold a quarter of the meat mixture around each egg. Dip them in the beaten egg and then coat with the panko breadcrumbs. Place the prepared Scotch eggs in the fridge while you heat up the vegetable oil for frying.", "Fill a heavy-bottomed sauce pan with about 8cm/3in of vegetable oil and set over a medium heat. To test if the oil is ready, drop a pinch of breadcrumbs in. they should immediately sizzle and rise to the surface (CAUTION: hot oil is dangerous. Do not leave unattended.)", "Remove the Scotch eggs from the fridge and carefully lower into the oil using a slotted spoon. Fry for 3-4 minutes, or until golden-brown all over. Remove from the oil with the slotted spoon to a plate lined with kitchen paper to soak up any excess oil. Serve with brown sauce.", "For the pea and mint soup, pick the leaves off the sprigs of mint and set aside. Place the peas in a saucepan with the mint stalks and pour in just enough to water to cover them. Season with salt and bring to the boil. Cook for three minutes, or until the peas are tender. Drain and set aside a few of the peas to garnish.", "Add the peas to a blender with a splash of the cooking liquid, the mint leaves, crème fraîche and black pepper. Blend until smooth and taste for seasoning. Serve in small glasses with a few peas in the bottom and a leaf of mint on top."]}, {"isVegetarian": false, "title": "British seaside chowder with saffron", "url": "www_bbc_co_uk_food_recipes_british_seaside_chowder_59346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz white wine", "1kg/2lb 4oz mixed shellfish, such as cockles, clams, mussels and winkles, cleaned and soaked in cold water", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 fennel bulb, finely chopped", "½ leek, white part only, finely chopped", "250g/9oz waxy potatoes, peeled and cut into 5mm/¼in cubes", "2 pinches saffron strands", "1 star anise", "500ml/18 fl oz chicken stock", "175ml/6fl oz double cream", "75g/2½oz samphire", "2 ripe tomatoes, skin and seeds removed", "12 shelled cooked whelks", "2 tbsp finely chopped fresh chives", "handful celery leaves, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the wine to the boil in a large lidded saucepan. Add the shellfish, cover the pan with the lid, reduce the heat until the wine is simmering, and simmer the shellfish for 3-5 minutes, or until all the shells have opened (discard any that do not open). ", "Drain the shellfish, reserving the cooking liquor in a bowl. When the shellfish is cool enough to handle, pick the meat from the shells.", "Heat the butter in a large saucepan over a medium heat. Add the shallot and garlic and fry for 1-2 minutes, or until softened. Add the fennel, leek, potatoes, saffron and star anise and fry for a further 1-2 minutes.", "Add the reserved cooking liquor and the chicken stock and bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for 3-4 minutes, or until the potato cubes are just tender.", "Add the cream and samphire and continue to simmer for 1-2 minutes, or until the soup has thickened slightly. Reduce the heat to low, then add the tomatoes and shellfish meat, including the whelks. Heat until the meat is warmed through. ", "Stir in the chives and celery leaves, season, to taste, with a little salt and freshly ground black pepper, then serve."]}, {"isVegetarian": false, "title": "Crab and leek tart", "url": "www_bbc_co_uk_food_recipes_british_crab_and_leek_40568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/british_crab_and_leek_40568_16x9.jpg", "ingredients": ["100g/3½oz plain flour, plus extra for rolling", "100g/3½oz wholemeal flour", "125g/4oz cold butter, cubed", "1 free-range egg, beaten", "knob of butter", "2 medium leeks, trimmed, sliced thinly ", "50g/2oz butter", "300ml half-fat crème fraîche", "3 free-range eggs, beaten", "100g/3½oz fresh brown crab meat", "pinch sea salt flakes", "100g/3½oz fresh white crab meat", "50g/2oz mature cheddar, finely grated ", "freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the pastry, pulse the flours and butter in a food processor until the mixture resembles fine breadcrumbs. With the motor running, add the egg in a thin stream and blend until the mixture begins to form a ball. ", "Roll the pastry into a circle on a floured work surface and use it to line a 23cm/9in loose-based fluted tart tin. Press the pastry with your fingertips firmly into the base and sides. Trim any excess pastry and lightly prick the base of the tart using a fork. Chill in the fridge for 30 minutes.", "Line the pastry with a large sheet of crumpled baking parchment and half fill with baking beans. Bake the tart case for 25 minutes. Remove the beans and return the tart to the oven for a further 5-10 minutes or until the surface is dry and beginning to brown. Remove from the oven and reduce the oven to 180C/350F/Gas 4.", "For the filling, melt the butter in a large heavy-based frying pan over a low heat. Add the leeks and fry gently for 2-3 minutes, stirring until just softened. Remove from the heat and set aside.", "Put the eggs in a large jug and beat lightly with a whisk. Stir in the crème fraîche, season with salt and freshly ground black pepper. Beat together with a wooden spoon until thoroughly combined. Stir in the brown crab meat.", "Scatter the leeks over the pastry case and dot the white crab meat around them. Pour over the crème friache mixture and sprinkle with the cheese.  Cook on the baking tray for 25 minutes, or until the filling is golden-brown and just set. (It should still wobble a tiny bit in the centre as it will continue to set as it cools.) ", "Remove the quiche from the oven and leave to cool in the tin for 15 minutes before removing."]}, {"isVegetarian": true, "title": "Broad bean and runner bean risotto", "url": "www_bbc_co_uk_food_recipes_broad_bean_and_runner_93551", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_runner_93551_16x9.jpg", "ingredients": ["150g/5½oz runner beans", "dash olive oil", "1 large onion, finely chopped", "300g/10½oz risotto rice", "1 litre/1¾ pints vegetable stock ", "3 tbsp mascarpone (optional)", "50g/2oz parmesan (or similar vegetarian hard cheese), finely grated, plus extra to serve", "200g/7oz cooked broad beans", "3 knobs butter", "salt and freshly ground black pepper", "1 heaped tbsp chopped fresh herbs (a mixture of chervil, tarragon, chives and flatleaf parsley)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": [" String the runner beans, slice them into 2cm/¾in pieces and cook in a pan of boiling water until tender. Drain and set aside.", "Heat the olive oil in a large lidded saucepan, then add the onion and cook over a low heat for 3-4 minutes, or until softened. ", "Stir in the rice and cook for a further 2-3 minutes, stirring continuously. ", "Pour over the stock, stir the mixture and cover with the lid. Cook over a low heat for 15-17 minutes, or until the rice is just tender.", "Stir in the mascarpone (if using), parmesan, butter, broad beans and runner beans and season, to taste, with salt and freshly ground black pepper. Sprinkle over the herbs to serve."]}, {"isVegetarian": false, "title": "Broad bean and Little Gem salad", "url": "www_bbc_co_uk_food_recipes_broad_bean_and_little_99871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb thick slices white bread", "6 tbsp olive oil", "salt and pepper", "300g/10oz frozen baby broad beans", "6 Little Gem lettuces", "100g/3½oz parmesan cheese, or vegetarian hard cheese, cut into shavings with a vegetable peeler", "3 tbsp Dijon mustard ", "5 tbsp white wine vinegar", "8 tbsp olive oil ", "5 tbsp double or single cream ", "1 rounded tbsp caster sugar", "salt and pepper"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the croutons, preheat the grill to hot. Cut the crusts off the bread and discard. Cut the bread into even-sized small cubes. Sit a plastic bag in a bowl, pour in the oil and season with salt and pepper. ", "Add the cubed croutons to the bag, pick up the bag and shake, tossing the cubes in the seasoned oil. Tip the bread out on a baking tray and place under the grill. Turn until they’re evenly browned - watch them all the time to prevent scorching and shake occasionally to make sure they brown evenly.\r\n\r\n", "For the salad, cook the broad beans in boiling water for about 3-4 minutes, or until tender. Drain and refresh in cold water. Remove the beans from their pods, set aside. ", "Trim the very ends off of the Little Gem lettuces but keep the root intact. Slice each lettuce into six wedges. Arrange on a platter, scatter with beans and parmesan and season with salt and pepper.", "For the mustard dressing, measure all of the dressing ingredients into a clean jam jar, season with salt and pepper and seal with a lid and shake until combined. Pour over the dressing, toss and serve."]}, {"isVegetarian": true, "title": "Broad bean hummus", "url": "www_bbc_co_uk_food_recipes_broad_bean_hummus_29052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fresh broad beans, podded weight", "100g/3½oz tinned chickpeas, drained reserving 6 tbsp of the liquid from the can", "1 garlic clove, crushed", "2 heaped tbsp tahini ", "1 tbsp lemon juice", "½ tsp salt", "pinch ground cumin", "pinch ground white pepper", "pinch caster sugar (optional)", "4 tbsp extra virgin olive oil, plus extra for drizzling", "1 tsp sesame seeds, toasted", "melba toasts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the podded broad beans in a pan of boiling, salted water for a minute or two, or until tender. Drain and cool in iced water.", "Once cold, the beans are ready to drain and re-pod (double podding stage): remove the skin from the bright green beans.", "Place the broad beans (saving a few for garnish), chickpeas, crushed garlic, tahini paste, lemon juice, salt, cumin, white pepper and caster sugar, if using, in a food processor and blend until smooth, loosening with the reserved chickpea liquor.", "As the mix continues to purée, slowly pour in the olive oil until completely combined.", "Serve the homemade broad bean hummus spooned or piped into a bowl, topped with the saved broad beans, toasted sesame seeds and a little drizzle of olive oil with the melba toast."]}, {"isVegetarian": true, "title": "Warm salad of broad bean, mangetout, peas, roasted beetroot and mozzarella", "url": "www_bbc_co_uk_food_recipes_broad_bean_mange_tout_00471", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_mange_tout_00471_16x9.jpg", "ingredients": ["4 heritage beetroots", "2 shallots", "2 tbsp rapeseed oil", "500g/1lb 2oz broad beans, podded and outer skin removed", "200g/7oz fresh peas, podded", "200g/7oz mangetout, thinly sliced", "2 balls buffalo mozzarella, torn ", "few basil leaves, to garnish", "30g/1oz French dressing", "30g/1oz honey", "30g/1oz white balsamic vinegar", "pinch salt", "squeeze lemon juice", "1 garlic clove, crushed", "100g/3½oz blue cheese", "50g/1¾oz buttermilk", "40g/1½oz crème fraîche", "40g/1½oz mayonnaise", "dash worcestershire sauce (omit if cooking for vegetarians)", "dash Tabasco"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Put the beetroots and shallots, unpeeled, on a sheet of foil and drizzle with the oil. Wrap them up and seal to make a parcel and bake in the oven for 40-50 minutes, or until soft. ", "Remove from the oven and allow to cool. Once cool, peel the beetroots and shallots and cut into quarters.", "Make the mustard and honey dressing by blending all the ingredients together in a bowl or blender until smooth. ", "Blanch the broad beans in boiling water for a couple of minutes and then drain.", "Heat a large frying pan and add the broad beans, peas and mangetout. Add the mustard and honey dressing to the pan and cook for a couple of minutes.", "Make the blue cheese dressing by blending all the ingredients together in a blender until smooth. ", "Place the beans, mangetout and peas in a large serving bowl.", "Scatter over the pieces of torn mozzarella, shallots and beetroot.", "Dress the salad with a little of the blue cheese dressing, garnish with a few torn basil leaves and serve."]}, {"isVegetarian": true, "title": "Broad bean and courgette pilaf", "url": "www_bbc_co_uk_food_recipes_broadbeanandcourgett_91842", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broadbeanandcourgett_91842_16x9.jpg", "ingredients": ["1 tsp cumin seeds", "1 tsp coriander seeds", "50ml/2fl oz vegetable oil", "1 onion, peeled, finely chopped", "2 cloves garlic, peeled, crushed", "1 cinnamon stick", "1 tsp ground turmeric", "10 cardamom pods, lightly crushed", "2 cloves", "225g/8oz basmati rice, soaked in water for 20 minutes and drained", "200g/7oz broad beans, out of their pods, inner membranes removed", "400ml/14fl oz vegetable stock", "4 courgettes, cut into 3cm/1in rounds", "olive oil, for brushing", "salt and freshly ground black pepper", "50g/2oz butter", "chopped fresh parsley", "lemon juice", "yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dry frying pan and add the cumin and coriander seeds. Fry over a medium heat, moving the spices around the pan frequently to prevent them from burning, for 2-3 minutes, or until aromatic and lightly browned. Transfer to a mortar and grind with a pestle.", "In a pan, heat the vegetable oil and fry the onion and garlic over a medium-low heat for 6-8 minutes, or until softened. Add the ground toasted spices, the cinnamon stick, ground turmeric, cardamom pods and cloves and cook for 2-3 minutes.", "Add the rice, broad beans and stock, cover the pan with a lid and cook over a low heat for 12-15 minutes, or until the rice is tender.", "Meanwhile, heat a griddle pan until smoking. Brush the courgettes with the olive oil, season with salt and freshly ground black pepper then cook on the griddle for 2-3 minutes on both sides, or until charred and softened. Set aside.", "To serve, stir the butter into the pilaf until melted, then spoon into serving bowls and top with the griddled courgette pieces. Garnish with chopped fresh parsley, a squeeze of lemon juice and a dollop of yoghurt."]}, {"isVegetarian": true, "title": "Broad bean dip", "url": "www_bbc_co_uk_food_recipes_broadbeandip_68044", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz  broad beans", "150g/6oz cream  ", "salt and fresh groud pepper ", "pinch sugar", "1 tsp garlic, finely chopped ", "1 tbsp fresh oregano, chopped ", "1 tsp ground cumin ", "150ml/¼ pint extra virgin olive oil ", "spring onions, to garnish", "chilli powder, to garnish", "ground cumin, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Use a vegetable mouli to mash the broad beans - this will mash the bean flesh but leave the skins behind. ", "Add some cream, salt, pepper and a hint of sugar.", "Add the garlic, oregano, cumin, olive oil and pepper to the broad bean purée.  ", "Garnish with spring onions, chilli powder, ground cumin and olive oil."]}, {"isVegetarian": false, "title": "Broad bean, asparagus and potato salad with duck in parma ham", "url": "www_bbc_co_uk_food_recipes_broadbeanasparagusan_87236", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large potato, peeled, cut into cubes and boiled until tender", "handful broad beans, removed from pods and blanched", "handful asparagus, trimmed and blanched", "salt and freshly ground black pepper ", "55g/2oz goats' cheese", "2 tbsp double cream", "2 tbsp finely chopped fresh basil", "½ duck breast, skin removed, sliced into 4 strips", "2 slices parma ham, halved lengthways", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the cooked potato, broad beans and asparagus into a bowl and season with salt and freshly ground black pepper.", "For the dressing, heat the goats' cheese and cream in a saucepan over a gentle heat until the cheese has melted and the sauce is smooth. Stir in the basil.", "For the duck, wrap each duck strip in half a slice of parma ham.", "Heat the oil in a frying pan and fry for 6-8 minutes, or until crisp and golden-brown and the duck is cooked through.", "To serve, place the salad in the centre of a plate, top with the duck and drizzle over the dressing. Serve warm or cold."]}, {"isVegetarian": true, "title": "Broad bean salad", "url": "www_bbc_co_uk_food_recipes_broadbeansalad_76452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz podded broad beans, cooked, skins removed", "¼ red onion, peeled and chopped", "1 tbsp chives, chopped", "1 tbsp olive oil", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, mix the broad beans, red onion and chives in a bowl.", "Drizzle over the olive oil and lemon juice and then add the salt and freshly ground black pepper. ", "Toss together and then transfer to a serving plate."]}, {"isVegetarian": true, "title": "Broad beans with dill", "url": "www_bbc_co_uk_food_recipes_broadbeanswithdill_74757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb young fresh broad beans in their pods", "50ml/2fl oz olive oil", "2 onions, chopped", "2 cloves garlic, peeled and finely chopped", "½ lemon, juice only", "250ml/½ pint vegetable stock", "2 tbsp fresh chopped dill", "a dollop of Greek-style yoghurt (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the beans, top, tail and string them where necessary. ", "Heat the oil in a large heavy-lidded pan and add the onions and garlic. Cook for 2-3 minutes to soften. Add the beans in their pods and the lemon juice and toss to combine. ", "Add the stock, bring to the boil and cook for 20-25 minutes until the pods are very tender. Cover and reduce heat to a gentle simmer.", "At the end of cooking, add the dill. Serve warm. Add a generous dollop of Greek-style yoghurt (optional)."]}, {"isVegetarian": true, "title": "Broad bean salad with dried tomatoes, feta cheese and turmeric potatoes", "url": "www_bbc_co_uk_food_recipes_broadbeansaladwithdr_89015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "85g/3oz broad beans, out of their pods", "½ onion, sliced", "100g/3½oz feta cheese, crumbled", "125g/4½oz cherry tomatoes, halved", "½ tsp sugar", "½ tsp salt", "100g/3½oz new potatoes, sliced", "1 tsp ground turmeric", "25g/1oz butter", "1 handful fresh parsley, chopped", "1 handful fresh basil, chopped", "1 handful fresh chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a pan and lightly fry the broad beans and onion for 6-8 minutes, or until onions aer softened. Remove from the heat and allow to cool slightly before stirring in the feta cheese. ", "Place half the tomatoes onto a plate and sprinkle over the sugar and salt. Place in the microwave for five minutes on a medium heat, or until dried. Remove from the microwave, drizzle over the remaining olive oil and allow to cool before stirring into the onion and broad bean mixture.", "Parboil the new potato slices in boiling salted water seasoned with the ground turmeric for 5-6 minutes, then drain. Melt the butter in a pan and fry the potatoes for 5-6 minutes, or until tender and golden-brown. ", "To serve, place the fresh herbs onto a serving plate and pile on the broad bean, onion, feta and dried tomato mixture. Scatter over the remaining tomato halves, arrange the turmeric potatoes around the edge of the plate and drizzle over any remaining oil from the pan."]}, {"isVegetarian": false, "title": "Broad beans with pata negra ham", "url": "www_bbc_co_uk_food_recipes_broadbeanswithpatane_91729", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broadbeanswithpatane_91729_16x9.jpg", "ingredients": ["120g/4½oz baby broad beans, pods removed (podded weight)", "55g/2oz very finely sliced pata negra or similar high-quality Spanish cured ham, torn (the slices will be so thin that it should result in small shavings of ham)", "1 small garlic clove, peeled, finely chopped", "1 tbsp extra virgin olive oil", "splash sherry vinegar", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the podded broad beans in a pan of boiling, salted water for 2-3 minutes, or until tender. Drain well, then refresh in cold water. When cool enough to handle, peel away the outer membranes. ", "In a bowl, mix together the cooked broad beans, pieces of pata negra ham and chopped garlic until well combined. ", "Drizzle over the olive oil and a splash of sherry vinegar, then season, to taste, with salt and freshly ground black pepper and stir well. (NB: Remember that the cured ham will be salty.) Serve immediately."]}, {"isVegetarian": true, "title": "Broad bean, yoghurt and mint soup", "url": "www_bbc_co_uk_food_recipes_broadbeanyoghurtandm_85610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb shelled broad beans, thawed if frozen, blanched and skins removed", "30g/1oz butter", "1 onion, chopped", "1 stick celery, thinly sliced", "2 tbsp pudding rice", "1 generous sprig fresh summer savory or thyme", "1 litre/1¾ pints hot chicken stock or vegetable stock", "salt and freshly ground black pepper", "115ml/4fl oz Greek-style yoghurt", "handful fresh mint leaves, chopped", "4 small sprigs fresh mint", "paprika or cayenne pepper, for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take about one-eighth of the blanched broad beans, chop roughly and set aside.", "Heat the butter in a heavy-bottomed, lidded pan. Add the onion and celery, cover and sweat over a low heat for about ten minutes, or until very tender.", "Add the rice and summer savory or thyme and cook for another minute, uncovered.", "Add the broad beans, except for the reserved chopped ones, and the stock. Season with salt and freshly ground black pepper, bring up to the boil, reduce the heat and simmer for about ten minutes, or until the rice is tender. Remove the savory or thyme stem, then allow to cool slightly.", "Pour the soup into a food processor in batches and blend until smooth.", "Shortly before serving, reheat the soup thoroughly, then take off the heat.", "Add a tablespoon of the yoghurt, together with the reserved beans and the chopped mint and stir well. Mix in a second tablespoon of yoghurt and continue stirring in, a spoonful at a time, until all the yoghurt is incorporated. Taste and adjust the seasoning.", "To serve, pour the soup into bowls and top with a sprig of mint and a light dusting of paprika or cayenne pepper."]}, {"isVegetarian": false, "title": "Broccoli and anchovy pasta", "url": "www_bbc_co_uk_food_recipes_broccoli_and_anchovy_27818", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoli_and_anchovy_27818_16x9.jpg", "ingredients": ["300g/10½oz wholemeal plain flour, plus extra for dusting", "3 free-range eggs", "1 tbsp olive oil", "½ tsp sea salt", "180g/6oz broccoli, cut into florets and the stem into thick slices", "3 tbsp extra virgin olive oil", "4 anchovies, roughly chopped", "20g/¾oz freshly grated Parmesan", "freshly ground black pepper"], "serves": "Serves 3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta (if making by hand), put the flour in a large bowl, then make a well in the centre. Add the eggs, olive oil and salt and whisk together in the centre. Gradually pull a little bit of flour in each time you stir the mixture. You want to gradually add the flour to the eggs to make a smooth firm dough. Flatten the dough into a disc about 1cm/½in thick, then wrap in cling film and chill for 20 minutes in the fridge. ", "When the pasta is chilled, remove and place on a lightly floured work surface. Cut in half then use a rolling pin to flatten the dough to a rectangle, turning the pasta as you go to make sure you have an even thickness. Roll each piece of pasta to about 2mm thick – the thinner the better. When the pasta is as thin as you can go, cut into strips about 3mm wide for tagliatelle or thinner for linguine.", "Hang over a rolling pin or similar so that the pasta can dry slightly while you make the sauce.", "To make the pasta by machine: tip the flour into a food processor, then add the eggs, olive oil and salt and pulse until the mixture forms small crumbs. Tip out on to a work surface and squash into a ball, then knead, pulling the dough together for a couple of minutes, until smooth. ", "Flour the rollers of the pasta machine. Cut the pasta in half and using a rolling pin, roll to about 5mm thick rectangle. Starting at the thickest setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again if needed and feed the pasta sheet through the machine the same way. Keep going, making the opening smaller each time – you might need to cut the pasta in half lengthways as it gets towards the end. Fold the pasta in half lengthways then cut into strips as above.", "For the sauce, add the broccoli to boiling water for 4-5 minutes until just tender.", "Meanwhile, bring a large saucepan of salted water to the boil. Add the pasta and cook for 3-4 minutes until it rises to the surface. Drain into a colander, reserving some of the cooking water.", "Add the broccoli to the pasta and add the anchovies and mix well to combine. Add 2 tablespoons of the cooking water and cook for 1 minute stirring as you go. The pasta should be coated in the broccoli and anchovy.", "Pile the pasta into serving bowls, then top with the Parmesan."]}, {"isVegetarian": true, "title": "Broccoli, almond and lemon penne", "url": "www_bbc_co_uk_food_recipes_broccolialmondandlem_89918", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz dried penne pasta", "500g/1lb 2oz broccoli, cut into florets", "110g/4oz butter", "75g/3oz flaked almonds", "50g/2oz white breadcrumbs", "1 lemon, juice only", "parmesan (or a vegetarian alternative), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil. Add the pasta and cook according to packet instructions.", "Meanwhile, bring a separate pan of salted water to the boil. Add the broccoli and boil for 2-3 minutes, until just tender. Drain the broccoli into a colander.", "Heat a frying pan over a medium heat. Add the butter and fry until it melts and begins to turn golden-brown.", "Add the almonds and breadcrumbs and heat until the breadcrumbs are golden-brown.", "Add the broccoli and stir well to coat in the almonds and breadcrumbs.", "Add the lemon juice and season, to taste, with salt and freshly ground black pepper.", "Add the cooked penne pasta and mix together well.", "To serve, spoon equal portions of the pasta and broccoli into bowls and garnish with freshly grated parmesan."]}, {"isVegetarian": false, "title": "Broccoli and cauliflower cheese bake", "url": "www_bbc_co_uk_food_recipes_broccoli_and_cauliflower_17520", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "50g/1¾oz plain flour", "450ml/16fl oz whole milk", "1 tsp English mustard", "1 tsp Worcestershire sauce", "200g/7oz cheddar, grated", "50g/1¾oz unsalted butter", "2 leeks, sliced", "½ loaf brioche, cut into 2cm/1in cubes", "200g/7oz broccoli, cut into florets", "200g/7oz cauliflower, cut into florets", "150g/5½oz Lincolnshire poacher cheese, grated", "3 tbsp olive oil", "1 tbsp sherry vinegar", "1 tsp Dijon mustard", "1 lemon, juice only", "salt and freshly ground black pepper", "2 heads baby gem lettuce, leaves separated", "150g/5½oz Tenderstem broccoli, boiled until just tender", "150g/5½oz romanesco broccoli, cut into florets, boiled until just tender"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "For the cheese sauce, melt the butter in a large pan, add the flour and cook for 2-3 minutes.", "Gradually add the milk, whisking all the time until the milk is completely incorporated and the sauce is thickened.", "Once you have a smooth sauce add the mustard, Worcestershire sauce and grated cheese.", "For the bake, melt 25g/1oz of the butter in a medium frying pan, then add the chopped leeks. Cook for 2-3 minutes until softened then add to the cheese sauce.", "Melt the rest of the butter in a clean frying pan and gently fry the brioche cubes.", "In a large pan of boiling water cook the broccoli and cauliflower for 2-3 minutes and drain.", "Take an ovenproof dish and lay the broccoli, cauliflower, sauce and brioche, finish with a layer of the Linconshire poacher cheese and brioche. Bake in the preheated oven for 25-30 minutes.", "For the dressing, pour the oil and vinegar in a small glass bowl and whisk in the mustard and lemon juice. Season with salt and pepper.", "To serve, place the baby gem leaves in a bowl, pour the dressing over and mix to combine.", "Spoon the bake onto a serving plate and serve the broccoli alongside and the salad in a small bowl."]}, {"isVegetarian": false, "title": "Broccoli and ham with poached egg", "url": "www_bbc_co_uk_food_recipes_broccoliandhamsalad_88904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "100g/3½oz broccoli florets, cut into pieces", "55g/2oz chestnut mushrooms, sliced", "55g/2oz Parma ham, cut into pieces", "2 tbsp balsamic vinegar", "1 free-range egg, poached to your liking", "55g/2oz Gorgonzola cheese, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the olive oil in a pan and fry the broccoli, mushrooms and ham for 5-6 minutes.", "Remove from the heat, add the balsamic vinegar and the remaining oil and stir to coat.", "Serve the broccoli, mushrooms and ham on a plate with the poached egg on top and the chopped Gorgonzola arranged around."]}, {"isVegetarian": true, "title": "Broccoli and potato soup with cheese, honey and thyme-stuffed bread", "url": "www_bbc_co_uk_food_recipes_broccoliandpotatosou_90315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, chopped", "½ potato, peeled and chopped", "1 head broccoli, chopped", "400ml/14 fl oz vegetable stock", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "½ small loaf country white bread", "salt and freshly ground black pepper", "2 tbsp olive oil", "85g/3oz cheddar cheese, chopped", "3 tbsp chopped fresh thyme", "2 tbsp honey", "1 tbsp double cream, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the soup, heat the olive oil in a frying pan and gently fry the onion and potato for 3-4 minutes, or until the onion is softened. Add the broccoli and stock. Bring to the boil, then reduce the heat and simmer gently for 5-6 minutes, or until the potato and broccoli are tender.", "Stir in the cream and season, to taste, with salt and freshly ground black pepper. Liquidise using a stick blender until smooth. ", "For the bread, hollow out the middle of the loaf and season well with salt and freshly ground black pepper. Drizzle over the oil, sprinkle in the cheese and thyme and finally drizzle in the honey. Place into the oven to bake for 4-5 minutes, or until the cheese is beginning to melt. ", "Serve alongside a bowl of the soup, garnished with a drizzle of cream."]}, {"isVegetarian": true, "title": "Broccoli and potato soup with creamy pistou", "url": "www_bbc_co_uk_food_recipes_broccoliandpotatosou_92460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "½ onion, peeled, chopped", "½ potato, peeled, sliced", "½ head broccoli, cut into small florets", "400ml/14fl oz chicken or vegetable stock", "2 tbsp double cream", "1 handful fresh basil leaves", "2 tbsp pine nuts, toasted", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "1 tbsp double cream", "1 tbsp chopped fresh flatleaf parsley leaves", "1 tbsp chopped fresh chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the butter in a pan over a medium heat and gently fry the onion for 3-4 minutes, until softened. ", "Add the potato and broccoli to the pan and stir. Add the chicken stock and bring the mixture to a simmer. Simmer for 8-10 minutes, or until the vegetables are tender, then stir in the cream.", "Blend the mixture with a stick blender until smooth.", "For the pistou, blend all the pistou ingredients in a food processor until smooth.", "Serve the soup in a bowl with the pistou and cream drizzled over the top. Garnish with the chopped parsley and chervil."]}, {"isVegetarian": true, "title": "Broccoli and Stilton soup with Stilton croûtons", "url": "www_bbc_co_uk_food_recipes_broccoliandstiltonso_76390", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandstiltonso_76390_16x9.jpg", "ingredients": ["350g/12oz broccoli, florets and stalks cut into small pieces", "400ml/14fl oz vegetable stock", "25g/1oz butter", "4 spring onions, finely sliced", "50g/1¾oz Stilton, crumbled, or to taste", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "pinch freshly grated nutmeg", "4 slices French bread", "100g/3½oz Stilton, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, place the pieces of broccoli into a glass bowl. Pour over the vegetable stock.", "Cover the bowl with cling film and place in the microwave. Cook on full power for four minutes, or until tender.", "Meanwhile, heat a frying pan until hot then add the butter. When it starts to foam, add the spring onions and cook for one minute.", "Transfer the cooked broccoli and stock to a food processor. Add the fried spring onions, Stilton and cream and blend until smooth.", "Transfer the blended mixture to a pan and bring gently to a simmer.", "Meanwhile, for the croûtons, toast the French bread under a grill until golden-brown on each side.", "Top the grilled bread with the slices of Stilton and return to the grill until golden-brown and bubbling.", "Season the soup with salt, freshly ground black pepper and a pinch of nutmeg.", "Divide the soup equally among four warm bowls and top each with a Stilton croûton. Serve."]}, {"isVegetarian": false, "title": "Broccoli and salmon bake", "url": "www_bbc_co_uk_food_recipes_broccoliandsalmonbak_77132", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandsalmonbak_77132_16x9.jpg", "ingredients": ["1 onion, chopped", "1 tsp olive oil", "20g/¾oz butter", "20g/¾oz plain flour", "150ml/5fl oz milk", "50g/1¾oz parmesan, grated", "150g/5¼oz salmon steak", "150g/5¼oz broccoli, cut into florets and steamed", "2 carrots, cut into batons and steamed", "6 cherry tomatoes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Gently fry the onions in the oil in a saucepan and cook until soft. Stir in the butter and the flour. Mix thoroughly, cooking on a low heat for one minute.", "Pour in the milk, gradually, until everything is combined. Cook for two minutes.", "Add half the cheese to the sauce and reserve the other half.", "Meanwhile, pan-fry the salmon steak for one minute on each side.", "Lay the salmon steak in a small oven-proof dish.", "Add the broccoli, carrots and cherry tomatoes to the dish.", "Pour over the sauce and top with the rest of the cheese.", "Bake in the oven for ten minutes or until bubbling and golden."]}]