[{"isVegetarian": false, "title": "Easy chicken liver pâté", "url": "www_bbc_co_uk_food_recipes_easychickenliverpate_87604", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easychickenliverpate_87604_16x9.jpg", "ingredients": ["450g/1lb chicken livers, trimmed", "200g/7oz  butter, melted", "50ml/2fl oz  double cream", "1 tbsp Armagnac or brandy", "coarse sea salt and freshly ground black pepper", "handful of dried cranberries", "8 fresh bay leaves", "hot toast", "spicy chutney"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a heavy-based frying pan over a medium heat. Pour a little of the melted butter into the hot pan, add half the chicken livers and cook for three minutes. The livers should be cooked on the outside and pink in the middle. Transfer them to a plate and repeat with the rest of the livers. ", "Transfer the chicken livers to a food processor and blend them for a minute or so until smooth. Then pour in the remaining melted butter and double cream and blend once more. Season with salt and freshly ground black pepper and then stir in the Armagnac. ", "Transfer the pâté to eight small ramekins, cover with cling film and chill.", "When you are ready to serve, uncover the pâtés and garnish with dried cranberries and fresh bay leaves to give them a festive feel. Serve with hot toast and spicy chutney."]}, {"isVegetarian": false, "title": "Easy garlic bread", "url": "www_bbc_co_uk_food_recipes_easygarlicbread_72032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz butter", "30g/1oz tomato paste", "1 clove garlic, crushed", "½ tsp thyme, chopped", "½ tsp rosemary, chopped", "seasoning", "toast or hot baguette for serving"], "serves": "Makes about 250g", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Beat butter with wooden spoon until soft, and then add the remaining ingredients and beat until smooth.  ", "Alternatively add all ingredients to a food processor and blend until smooth.  ", "Scrape onto cling film or foil and roll to reform.  Refrigerate until ready to use.  ", "Serve on the toast or hot baguette."]}, {"isVegetarian": false, "title": "Easy baked eggs", "url": "www_bbc_co_uk_food_recipes_easyeggsbenedict_71983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter to grease", "50g/2oz butter", "225g/8oz baby spinach leaves", "4 tbsp bacon, finely chopped ", "8 eggs", "4 tbsp double cream", "4 tbsp grated parmesan and gruyere ", "4 tbsp breadcrumbs", "thyme leaves to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grease ramekins, or coffee cups with butter and place on baking tray.", "Cook the spinach in butter, until soft, season and divide between the ramekins. ", "Fry the bacon pieces until crispy and divide between ramekins. Next crack two eggs into each ramekin, top with a tablespoon of cream, parmesan and breadcrumbs and bake for 12-15 minutes until golden. ", "Garnish with thyme leaves and serve with toast on the side."]}, {"isVegetarian": true, "title": "Easy jam ice cream", "url": "www_bbc_co_uk_food_recipes_easyjamicecream_74647", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz double cream", "500ml/18fl oz plain yoghurt", "450g/16oz pot high quality raspberry jam or preserves", "cones, to serve"], "serves": "Makes 1 tub", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the above ingredients together and transfer to a freeze-safe container. ", "Freeze for about four hours or overnight. Remove from freezer one hour before serving."]}, {"isVegetarian": true, "title": "Eccles cakes", "url": "www_bbc_co_uk_food_recipes_eccles_cakes_72475", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eccles_cakes_72475_16x9.jpg", "ingredients": ["75g/3oz unsalted butter", "150g/5oz soft brown sugar", "150g/5oz currants", "1 tsp ground cinnamon", "½ tsp freshly ground nutmeg ", "1 orange, juice and finely grated zest ", "50g/2oz mixed citrus peel", "25-50g/1-2oz margarine, for greasing", "1 block ready-made puff pastry", "flour, for dusting", "2-3 tbsp milk, for glazing ", "caster sugar, for dusting", "icing sugar, for dusting"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, melt the butter over a low heat in a small saucepan. Once melted, remove from the heat and stir in all of the remaining filling ingredients until well combined. Set aside to cool. ", "Preheat the oven to 220C/425F/Gas 7. Grease a baking tray with the margarine.", "For the pastry, roll out the pastry on a lightly floured work surface to a thickness of about 3mm/⅛in. Using a 6cm/2½in cutter, cut the pastry into rounds.", "Place a teaspoon of the filling in the middle of each round, then brush the edges of half the pastry with milk. Bring the other half of the pastry over and seal. Bring the corners of the pastry up into the middle and pinch to seal. ", "Turn thr sealed pastry parcel over, so that the seam is underneath, then gently roll out until it is about ½cm/¼in thick. Gently pat back into a round shape and place onto the greased baking tray.", "Slash each cake across three times using the tip of a sharp knife. Brush the cakes with milk and sprinkle with caster sugar. ", "Bake for 15 minutes, or until the pastry is golden-brown and puffed up. Transfer the cakes to a wire rack to cool. ", "Dust the eccles cakes with icing sugar before serving. "]}, {"isVegetarian": true, "title": "Eccles cakes", "url": "www_bbc_co_uk_food_recipes_eccles_cakes_75687", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eccles_cakes_75687_16x9.jpg", "ingredients": ["225g/8oz plain flour", "½ tsp salt", "200g/7oz chilled butter, cubed", "½ lemon, juice only", "115g/4oz currants", "3 tbsp Pedro Ximénez sherry", "knob of unsalted butter", "55g/2oz light muscovado sugar", "30g/1oz mixed chopped peel", "½ tsp ground cinnamon", "¼ tsp freshly grated nutmeg", "¼ tsp ground ginger", "1 lemon, zest only", "1 tsp lemon juice", "1 free-range egg white", "a little caster sugar"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, sift the flour and salt into a large bowl and add the butter. Mix the butter around with a large metal spoon to coat it in flour. Be careful to keep the butter in lumps.  ", "Mix 180-200ml/6-7fl oz chilled water and lemon juice together in a jug and gradually pour it into the flour and butter mixture.  ", "Using a round-tipped knife, cut across the contents of the bowl several times, turning the bowl continuously as you chop the butter into the flour, or until the dough comes together. The dough will be very wet at this point.", "Tip the dough onto a well-floured work surface and quickly shape it into a rectangle about 30x20cm/12x8in.", "With the pastry vertically on the board in front of you, fold the bottom third of the pastry up onto the middle third, then the top third down onto the other thirds. Rotate the pastry a quarter turn and repeat the folding. ", "Wrap in cling film and leave to chill in the fridge for 10 minutes.  ", "Take the dough out of the fridge and, with a rolling pin, roll into the original narrow rectangle and repeat the folding, the turn and the rest as before. Do this three times in total. Don't worry if the butter oozes through the dough at first, just keep the board and rolling pin well floured.", "For the filling, soak the currants in the sherry in a bowl.", "Melt the butter in a saucepan and stir in all the other filling ingredients, including the currants and sherry. Leave to cool.", "To assemble, preheat the oven to 220C/425F/Gas 7.", "Roll the pastry to the thickness of 3mm. Cut out 6 x 12.5cm/4¾in rounds. Cover the rounds in cling film and leave to chill in the fridge for 10 minutes.", "Place a good teaspoon of filling in the centre of each pastry round. Pull the pastry around the filling and squeeze to seal. Trim away any excess pastry. Turn the balls over and place on a baking tray. Flatten lightly with a rolling pin until the fruit begins to show through the pastry.", "To assemble, in a bowl, beat the egg white lightly with a fork, until frothy. Brush the tops of the cakes with this and sprinkle with sugar. With a sharp knife, make three small parallel cuts on the top.", "Bake for 20 minutes, or until the pastry is lightly browned and puffed up."]}, {"isVegetarian": true, "title": "Egg-fried rice", "url": "www_bbc_co_uk_food_recipes_egg-fried_rice_85655", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg-fried_rice_85655_16x9.jpg", "ingredients": ["1 tsp rapeseed oil", "5 spring onions, thinly sliced", "1 red pepper, seeds removed and thinly sliced", "2 garlic cloves, finely chopped", "1 head of broccoli, cut into small florets", "300g/10½oz freshly cooked basmati rice, cooled", "175g/6oz frozen peas", "3 eggs, lightly beaten", "1 tbsp soy sauce", "2 tsp toasted sesame seeds", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until hot, then add the oil. When it is hot, add the spring onions and red pepper and stir-fry for 1–2 minutes, or until just softened. Stir in the garlic and add the broccoli with 4 tablespoons of water, then bring to the boil and simmer for 2 minutes, or until the broccoli is just tender and the water has nearly evaporated.", "Add the rice and stir fry for 2–3 minutes, or until hot through. Stir in the peas and cook for 1 minute. ", "Beat the eggs and soy sauce together using a fork. Add the egg mixture to the rice and stir-fry for 2–3 minutes, or until the eggs have just set. Stir in the sesame seeds, season with salt and pepper and serve immediately."]}, {"isVegetarian": false, "title": "Egg and bacon pie", "url": "www_bbc_co_uk_food_recipes_egg_and_bacon_pie_09677", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_and_bacon_pie_09677_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "8–10 rashers smoked streaky bacon", "9 free-range eggs", "4 tbsp whole milk", "salt and freshly ground black pepper", "300g/10½oz plain flour, plus extra for dusting", "good pinch of sea salt ", "175g/6oz chilled butter, diced", "1 free-range egg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the filling, heat the oil in a large non-stick frying pan. ", "Cut the bacon rashers in half and fry over a medium heat for 4–5 minutes until the fat is golden and crisp, turning them once. ", "Remove the bacon from the heat and leave to cool. Place a sturdy baking tray in the oven and preheat to 190C/375F/Gas 5. ", "For the pastry, pulse the flour, salt and butter in a food processor until the mixture resembles fine breadcrumbs.", "Whisk the egg with a tablespoon of cold water and pour onto the flour and butter mixture with the motor running. Continue blending until the dough begins to form a ball. ", "Turn the pastry out onto a lightly floured board, knead quickly into a ball and cut in half. ", "Roll out one half until it is about 0.5cm/¼in thick and line a greased 23cm/9in pie plate, leaving any excess pastry overhanging the edge. ", "Scatter the bacon loosely over the pastry case. Gently break six of the eggs into the pastry case, spacing them evenly between the bacon rashers. ", "Beat the remaining eggs with the milk and plenty of salt and pepper. ", "Slowly pour the beaten eggs into the pastry case, stopping every now and then to allow the beaten egg to find its way between the whole eggs and the bacon. Leave 2–3 tablespoons of the mixture in the bowl for glazing the top of the pie. ", "Roll out the rest of the pastry to make a lid for the pie. Brush the edge of the pastry case with beaten egg and milk and gently lift the pastry lid over the filling. ", "Press the edges firmly to seal, then trim. Use a fork to firmly seal the edge all the way around the pie then brush the top with the remaining beaten egg to glaze.", "Bake the pie on the preheated baking tray for 45–55 minutes until golden-brown and cooked through.", "Test by piercing the centre with a sharp knife – the filling should be just set. If it’s still runny, put the pie back in the oven for a few minutes. Leave to stand for at least 15 minutes before serving."]}, {"isVegetarian": true, "title": "Egg and vegetable fried rice", "url": "www_bbc_co_uk_food_recipes_egg_and_vegetable_fried_44022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil", "2 free-range eggs, beaten", "3 spring onions, sliced on an angle", "¼ green pepper, deseeded and thinly sliced", "¼ red pepper, deseeded and thinly sliced", "¼ yellow pepper, deseeded and thinly sliced", "¼ orange pepper, deseeded and thinly sliced", "½ carrot, peeled and shredded ", "2–6 fine green beans, shredded", "8–10 mushrooms, roughly chopped", "2 tbsp frozen peas, defrosted", "500g/1lb 2oz cold, cooked rice ", "2 tbsp light soy sauce or tamari, to taste", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil to smoking point in a large wok. Add the eggs and swirl with a ladle or spoon, breaking them up as they cook.", "Add the spring onions and peppers and stir-fry for 1 minute. Add the remaining vegetables, season with salt and pepper, and stir-fry for a couple of minutes until they are softened, but still have a bite.", "Add the rice and stir-fry for a few minutes until the rice is piping hot. Season with soy sauce and serve."]}, {"isVegetarian": false, "title": "Egg, bacon and asparagus flan", "url": "www_bbc_co_uk_food_recipes_egg_bacon_and_asparagus_32159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_bacon_and_asparagus_32159_16x9.jpg", "ingredients": ["1 bunch young asparagus, about 10 spears, trimmed", "5 rashers dry-cure smoked back bacon", "1 tsp olive oil", "1 medium onion, finely sliced", "25g/1oz cornflour", "300ml/½ pint semi-skimmed milk", "3 free-range eggs, beaten", "25g/1oz extra-mature Cheddar cheese, finely grated", "flaked sea salt", "freshly ground black pepper", "1 tbsp sunflower oil, plus extra for oiling the tin", "4 sheets filo pastry, each about 32 x 38cm/13 x 15in"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Slice the asparagus into lengths of about 5cm/2in. Half fill a large non-stick frying pan with water and bring to the boil. Add the asparagus, bring back to the boil and cook for a minute until just tender. Drain and rinse under running water until cold, then pat dry. ", "Trim any fat off the bacon and cut into 1cm/½in strips. Return the pan to a low heat, add the oil and gently fry the onion and bacon until lightly browned, stirring regularly. ", "Add the onion and bacon to the bowl with the asparagus, toss lightly and leave to cool. ", "Preheat the oven to 200C/400F/Gas 6. Place a baking tray in the oven to heat.", "Lightly oil a 20cm/8in loose-based fluted flan tin that’s about 3.5cm/1½in deep. Pour the rest of the oil into a small bowl. ", "Place a sheet of filo pastry in the flan tin, pressing it firmly against the base and sides. Using the tip of a pastry brush, brush the pastry with a little oil then cover with a second pastry sheet at a right angle to the first. Brush with more oil and cover with a third sheet at the same angle to the first. Brush with the oil and cover with a fourth sheet, running in the same direction as the second. Roll and crumple the overhanding pastry back on to the rim of the tin, lifting slightly above it, and brush lightly with the remaining oil. Place the tin on the baking tray. ", "Put the cornflour in a non-stick saucepan and stir in 50ml/2fl oz of the milk to make thin paste. Pour over 200ml/7fl oz of the milk and stir well. Bring to a simmer, stirring constantly. ", "Cook for a minute over a medium heat, stirring, until the sauce is thick and smooth. ", "Season, then remove from the heat and stir in the rest of the milk to cool and loosen the sauce. ", "Stir in the beaten eggs until thoroughly combined. ", "Scatter half the asparagus, bacon and onion mixture over the base of the pastry case and pour the white sauce gently on top. Scatter the remaining asparagus and bacon mixture on top and press down lightly, then sprinkle evenly with the cheese. ", "Bake on the preheated baking tray in the centre of the oven for 25-30 minutes or until the pastry is lightly browned and crisp and the filling is set. ", "Take the flan out of the oven and leave to cool in the tin for 10 minutes before removing. Serve warm or cold. "]}, {"isVegetarian": true, "title": "Egg custard tarts", "url": "www_bbc_co_uk_food_recipes_egg_custard_tarts_15352", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_custard_tarts_15352_16x9.jpg", "ingredients": ["165g/5¾oz plain flour, plus extra for dusting", "25g/1oz ground almonds", "120g/4¼oz chilled unsalted butter, cubed", "55g/2oz caster sugar", "1 free-range egg", "700ml/1¼ pint full-fat milk", "7 free-range egg yolks", "90g/3¼oz caster sugar", "freshly ground nutmeg"], "serves": "Makes 12 tarts", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, stir the flour and ground almonds together in a large bowl, then add the butter and rub in with your fingertips until the mixture resembles breadcrumbs. Stir in the sugar. ", "Break in the egg and work it into the mixture with your fingers, bringing it together to form a soft dough.", "Tip the dough onto a lightly floured work surface and shape it into a ball. Flatten with your fingers to a disc and wrap in cling film. Leave to chill in the fridge for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Roll out the sweet pastry on a lightly floured work surface.", "Using an 11cm/4½in fluted cutter, cut out twelve discs and line the muffin tray moulds with the pastry circle. The pastry should overlap the top of the moulds by a few millimetres, so that you can crimp the edges if you wish. ", "For the custard filling, warm the milk in a saucepan, and beat the egg yolks and sugar together in a separate bowl until pale and creamy. ", "Pour the milk onto the egg yolk mixture and stir well, creating little bubbles. ", "Transfer the custard mixture into a pouring jug with a lip, then fill each of the tart cases.", "Sprinkle a small pinch of ground nutmeg into the middle of each tart. ", "Bake the tarts in the oven for about 25 minutes - you may need to turn the temperature down to 180C/350F/Gas 4  for the final 10 minutes. You are looking for a very slight dome on the custard, indicating that it is baked. If the custard domes too much this indicates that you have over-cooked the custard, it will have boiled, and will sink back down leaving a big dip. If this does happen you can help rescue it by removing the tarts from the oven immediately and placing the tin in cold water on a cold surface.", "Cool in the tin for 30 minutes and then carefully remove from the moulds. The base of the tarts should be perfectly baked through, without having over-cooked the custard filling."]}, {"isVegetarian": false, "title": "Lighter egg fried rice", "url": "www_bbc_co_uk_food_recipes_egg_fried_rice_09743", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_fried_rice_09743_16x9.jpg", "ingredients": ["30g/1oz basmati rice or 75g/2½oz cooked basmati rice", "1 tsp rapeseed oil ", "2 spring onions, chopped", "25g/1oz red pepper, roughly chopped", "100g/3½oz cooked peeled prawns", "25g/1oz peas (fresh or frozen)", "1 tsp soy sauce", "1 medium free-range egg, beaten", "chopped fresh coriander (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice according to the packet instructions. Drain. ", "Heat the oil in a small saucepan over a medium heat. Add the spring onions and red pepper and cook for 1 minute. Add the cooked rice, prawns, peas and soy sauce and cook for 3–4 minutes, stirring constantly. Stir in the beaten egg and cook for 30 seconds. Scatter over the coriander, if using, and serve."]}, {"isVegetarian": false, "title": "Egg fried rice with five-spice pork belly", "url": "www_bbc_co_uk_food_recipes_egg_fried_rice_with_86215", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp Sichuan peppercorns", "1 star anise", "500g/1lb 2oz pork belly, skin scored", "1 tsp Chinese five-spice powder", "2 garlic cloves, finely grated", "thumb-sized piece fresh root ginger, peeled and finely grated ", "4 tbsp hoisin sauce", "1 tbsp sesame oil", "2 tbsp soy sauce (optional)", "1 tsp grated palm sugar or caster sugar", "½ tsp salt", "100g/3½oz cooked five-spice belly pork, cut in to 1cm/½in cubes (see above)", "120g/4oz rice", "2 large free-range eggs", "1 tsp sesame oil", "flaked sea salt, to taste", "300g/10½oz chilled cooked rice", "groundnut oil, for frying", "60g/2¼oz small dried shrimp, soaked in warm water", "1 garlic clove, finely sliced\t", "¾ tsp Sichuan peppercorns", "1 tsp Chinese five-spice powder", "60g/2¼oz cooked small peeled prawns, if using frozen defrost and drain well", "3 spring onions, sliced at an angle (including green parts)", "freshly ground white pepper", "soy sauce, for finishing"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the five-spice belly pork, crush the peppercorns and star anise in a pestle and mortar or a spice grinder, then tip them into a large plastic food bag. You need something that's big enough to hold the pork and has a top you can seal, such as a zip and seal plastic bag.", "Add the remaining ingredients, including the pork, to the bag, then massage the mixture into the meat through the bag. Seal the top of the bag and leave the pork to marinate for 24 hours or longer in the fridge. The longer the meat is marinated the more flavour there will be.", "When you’re ready to cook the pork, preheat the oven to 160C/325F/Gas 3. Place the pork in a roasting tin – it should fit tightly – with the marinade and roast the pork for 1½-1¾ hours, or until tender and crisp.", "Dice 100g/3½oz of the cooked belly pork into 1cm/½in cubes and put to one side. Any remaining five-spice pork can be eaten at your own leisure.", "For the egg-fried rice, cook the rice according to the directions on the packet and leave to cool. ", "Whisk the eggs with the sesame oil and a good pinch of salt. Heat a non-stick frying pan or a wok with a drizzle of groundnut oil. When the oil is fairly hot, pour in the egg mixture. Do not stir and let the egg cook gently for a minute, or until the bottom starts to set. Then, using a rubber spatula, gently push one side of the egg mixture into the centre of the wok and tilt the wok to allow the still liquid egg to flow underneath and cook.", "Slide the cooked omelette onto a plate and roll it up into a cigar shape. Cut it into 1cm/½in slices, then cover with foil and set it aside to keep warm while you prepare the rice.", "Heat two tablespoons of groundnut oil in the pan. Drain the dried shrimp and add them to the pan with the diced belly pork and garlic, then heat through for about 45 seconds.", "Grind the Sichuan peppercorns in a pestle and mortar and add them to the pan along with the Chinese five-spice powder. Add the rice and stir-fry for 4–5 minutes, tossing everything together frequently to blend all the flavours.", "Add the peeled prawns and spring onions. Check the seasoning, adding some freshly ground white pepper and soy sauce, to taste. Carefully fold in the strips of omelette and  serve at once."]}, {"isVegetarian": true, "title": "Eggnog", "url": "www_bbc_co_uk_food_recipes_egg_nog_64580", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_nog_64580_16x9.jpg", "ingredients": ["6 medium free-range eggs (preferably organic and as fresh as possible), separated", "150g/5½ oz golden caster sugar", "500ml/18fl oz whole milk", "400ml/14fl oz double cream", "350ml/12fl oz rum, bourbon or a mixture of the two, depending on your preference", "freshly grated nutmeg, to taste"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg yolks in a bowl with 100g/3½ oz of the caster sugar until the mixture is pale yellow and thick (this is best done with an electric handheld mixer).  ", "Stir in the milk, double cream, and the rum and/or bourbon.  You can add a little grated nutmeg as well, if you like your nog this way.", "Pour the mixture into two 750ml/1½ pint bottles with stoppers and store in the fridge for up to two weeks. (The alcohol will prevent any spoilage of the eggs or cream.)", "Place the egg whites in a box and freeze until ready to serve the egg nog. ", "When ready to serve, defrost the egg whites into a clean metal or glass bowl. Using a handheld electric mixer, whisk the egg whites until foamy and opaque. Add the remaining 50g of sugar and whisk the egg whites until soft peaks form when the whisk is removed.", "Pour the egg nog from the bottles into a large bowl and fold in the egg whites until well combined. Ladle the egg nog into glass tumblers and serve with a little freshly grated nutmeg over the top of each glass."]}, {"isVegetarian": false, "title": "Bacon, egg, tomato, fried bread and mushroom velouté", "url": "www_bbc_co_uk_food_recipes_egg_tomato_fried_bread_45770", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs", "8 thin slices bacon", "50g/1¾oz butter", "2 slices white bread, diced", "120g/4¼oz trompette de mort", "2 tbsp flatleaf parsley, leaves picked", "4 tbsp olive oil", "1 large shallot, finely chopped", "3 cloves garlic", "1 sprig thyme", "1 bay leaf", "1 tsp tomato purée", "1kg/2lb 4oz vine-ripened tomatoes, skinned, deseeded, roughly chopped", "1 tsp mustard", "1 tsp vinegar", "115g/4oz butter", "500g/1lb 2oz flat mushrooms, peeled", "2 thyme sprigs", "2 cloves garlic", "150ml/5fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a water bath to 62C/144F. Place the whole eggs into the water bath and cook for 1 hour 15 minutes. If not using a water bath, simply poach the eggs as normal. ", "Peel the eggs and carefully slide them into a bowl of warm water. The eggs should hold together and be jelly-like. (If not using immediately, remove the egg in its shell from the water bath and carefully place into a bowl of ice-water. Once cooled, chill in the fridge until ready to use. Reheat it in the water bath for 5-8 minutes.)", "Preheat the oven to 170C/325F/Gas 3. Lay the bacon between two heavy baking trays and bake for around 12 minutes or until crisp. Keep warm until ready to serve.", "Heat a frying pan until hot, add half the butter and heat until foaming. Add the diced bread and cook until golden-brown all over, then tip out onto kitchen paper and cool.", "Add the remaining butter to the pan with the trompette de mort and cook until just tender, about two minutes. Drain onto kitchen paper.", "For the tomato fondue, heat a large frying pan until hot, add 3 tablespoons olive oil, shallot, garlic, thyme and bay leaves and cook gently until everything has softened. Add the tomato purée and cook for 2-3 minutes.", "Reserve one third of the chopped tomaotes. Add the remaining tomatoes to the pan and cook for 6-7 minutes until the tomatoes have broken down and are nearly dry.", "Place the mixture into a food processor and blend to a fine purée. Strain the mixture through a sieve into a clean pan and stir in the reserved tomatoes.", "Whisk the mustard, vinegar and remaining olive oil together then stir into the tomatoes, to taste.", "For the mushroom velouté, heat a sauté pan until hot, add the butter and heat until foaming.", "Add the mushrooms, thyme and garlic and cook until golden-brown. Add the cream and cook until reduced and thickened.", "Place into a food processor, blend until smooth then strain through a sieve into a clean pan. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of the tomato fondue on one side of a soup plate, and a spoonful of the mushroom veloute on the other side. Pile the trompette de mort in the centre and scatter croutons and parsley around the plate. Place the egg on top of the trompette de mort and finish with a couple of pieces of crispy bacon. "]}, {"isVegetarian": true, "title": "Egg tortilla pie", "url": "www_bbc_co_uk_food_recipes_egg_tortilla_pie_60712", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/egg_tortilla_pie_60712_16x9.jpg", "ingredients": ["2 tsp olive oil ", "2 large flour tortillas ", "1–2 slices ham, torn into pieces ", "2 large free-range eggs, at room temperature ", "Pinch sea salt flakes ", "75g/2½oz cheddar, grated", "hot sauce, to taste "], "serves": "Serves 1–2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Use 1 teaspoon of the oil to lightly grease the base and sides of a shallow, round, ovenproof dish. Line it with one of the tortillas, making sure it comes up the sides a little, creating a tortilla bowl. ", "Scatter over the ham, crack in the eggs – sprinkling the yolks with a little salt – and then spread about a third of the cheese on top. ", "Brush one side of the second tortilla with oil and place oiled-side up, loosely on top of the filling. Press the edges of the tortillas together, pushing them down into the dish and up the sides, then brush these edges with a little more oil. ", "Top with the remaining cheese, then add a few squeezes or shakes of hot sauce, depending on how fiery you want this to be. Bake in the oven for 15 minutes, by which time the eggs will be cooked inside, the cheese melted, and the edges of the tortilla crust crisped and browned. Ovens do vary, so you may find you need to alter the cooking time. Eat immediately. This is not a huge problem. "]}, {"isVegetarian": false, "title": "Egg yolk and goats' cheese ravioli", "url": "www_bbc_co_uk_food_recipes_egg_yolk_and_goats_93768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium baking potatoes, pierced", "100g/3½oz soft goats’ cheese, beaten", "drizzle olive oil", "few sprigs thyme, leaves picked", "4 ready-made fresh pasta sheets", "4 free-range egg yolks", "1 free-range egg, beaten", "8 coloured heritage young carrots", "30g/1oz butter", "pinch smoked paprika", "dressed watercress, to serve", "salt and freshly ground black pepper", "150g/5½oz goats’ cheese", "2 tbsp olive oil", "double cream, if necessary", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the ravioli, bake the potatoes for 45 minutes – 1 hour, or until soft. Set aside to cool a little. Remove the skin and mash. Season with salt and pepper.", "Mix together the mash and goats’ cheese in a bowl. Season with salt and pepper and stir in the olive oil and thyme. ", "Place a large spoonful of the mixture onto a pasta sheet. Using the back of the spoon, make a deep well in the potato. Place an egg yolk into the well and gently place a second layer of pasta over the top. Brush egg wash around the edges and press down around the filling, ensuring it is well sealed and there are no air pockets. Repeat with the remaining pasta sheets and filling.", "Bring a pan of salted water to the boil. Blanch the ravioli, one at a time, for 2 minutes or until the pasta is al dente.", "Meanwhile, place the carrots in a saucepan and add enough water to just cover them. Add the butter and bring to a simmer. Cook until glazed and soft. Add the smoked paprika and season with salt and pepper.", "To make the goats’ cheese cream, beat the cheese with the olive oil. Season with salt and pepper and, if necessary, add a little double cream to make a soft spooning consistency. ", "To serve, spoon a generous amount of the soft cheese onto the base of a dish. Drizzle over a little olive oil. Place the carrots between the plates, garnish with watercress and top with the ravioli. "]}, {"isVegetarian": false, "title": "Egg drop chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_eggdropchickennoodle_88311", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz egg noodles", "300ml/½ pint hot chicken stock", "3 tbsp chopped fresh coriander, plus extra to serve", "1 tbsp soy sauce, plus extra to serve", "1 tsp sesame oil", "1 free-range egg, beaten", "2 tbsp finely sliced Savoy cabbage"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the egg noodles into a bowl, pour over enough boiling water to cover them and leave for 3-4 minutes, or until softened. Drain.", "Place the stock into a small saucepan, add the coriander, soy sauce and sesame oil and bring to the boil. Make a whirlpool by stirring the pan with a wooden spoon and then crack the egg into the whirlpool and whisk. Add the shredded Savoy cabbage and stir.", "To serve, pour into a bowl and garnish with coriander leaves and soy sauce."]}, {"isVegetarian": false, "title": "Egg fried ham and stuffed mushrooms", "url": "www_bbc_co_uk_food_recipes_eggfriedhamandstuffe_72118", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 egg, lightly beaten", "55g/2oz plain flour", "a little milk to taste", "2 slices ham, 1cm/0.5in thick", "2-3 tbsp olive oil", "2 large mushrooms", "2-3 tbsp parmesan, grated", "1 tbsp honey", "handful of rocket", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Make a batter by beating the egg with the flour.  Add a little milk if it is too thick.", "Dip the ham in the batter.", "Pan-fry the ham in the oil for one to two minutes either side until crisp.", "Remove the stems from the mushrooms.", "Stuff the mushrooms with the parmesan and drizzle with honey.", "Bake in a hot oven for five to six minutes.", "Season and serve the mushroom and ham on a bed of rocket."]}, {"isVegetarian": true, "title": "Egg-fried rice", "url": "www_bbc_co_uk_food_recipes_eggfriedrice_67782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfriedrice_67782_16x9.jpg", "ingredients": ["1 egg", "2 tsp sesame oil", "2 tbsp vegetable oil", "200g/7oz long-grain rice (uncooked weight), cooked and left to go cold", "100g/4oz frozen peas, defrosted (rinse under warm water to do this quickly)", "4 spring onions, finely chopped", "100g/4oz beansprouts (optional)", "1-2 tsp soy sauce", "ground white pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Beat together the egg and sesame oil and put to one side.", "Heat the vegetable oil in a wok or large frying pan. When it's shimmering and almost smoking, add the rice and stir-fry for about 3-4 minutes until completely heated through.", "Add the peas, spring onions and beansprouts, if using. Stir-fry, turning the rice constantly around the pan, for about 3 minutes. Season well with soy sauce and pepper, then push to one side of the pan. Pour the beaten egg mixture into the other side and leave for about 10 seconds so it begins to set. Using a chopstick, briskly swirl around the egg to break it up and then toss around with the rice. Stir-fry for a further minute and serve straight away."]}, {"isVegetarian": true, "title": "Simple egg-fried rice", "url": "www_bbc_co_uk_food_recipes_eggfriedrice_88279", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash vegetable oil", "½ onion, finely sliced", "½ leek, finely sliced", "2 free-range eggs, beaten", "2 tbsp soy sauce, plus extra to serve", "200g/7oz basmati rice, cooked ", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a wok, add the onion and leek and fry gently until softened but not browned.", "Add the eggs and whisk until they are beginning to scramble and cook. Add the soy sauce and whisk.", "Add the cooked rice and stir well to coat in the eggs. Stir in the chopped chives, salt and freshly ground black pepper and spoon into a serving dish. Drizzle with soy sauce and serve."]}, {"isVegetarian": false, "title": "Egg fu yung wrap with chilli sauce", "url": "www_bbc_co_uk_food_recipes_eggfuyoungwithroaste_89264", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfuyoungwithroaste_89264_16x9.jpg", "ingredients": ["2 tbsp groundnut oil", "1 small handful shiitake mushrooms or chestnut mushrooms, sliced", "1 red pepper, de-seeded and diced", "75g/3oz smoked bacon, diced", "5 free-range eggs, lightly beaten", "dash light soy sauce", "pinch freshly ground white pepper", "handful leftover chicken and/or ham, chopped", "2 spring onions, shredded", "handful mixed salad leaves", "sweet chilli sauce"], "serves": "Makes 2 omelette wraps", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add a tablespoon of the oil. Add the mushrooms, red pepper and bacon and stir-fry for one minute, or until crisp and golden-brown.", "Add the stir-fry mixture to the beaten eggs and stir to combine.", "Carefully wipe out any excess oil from the wok with kitchen paper. Place the wok over a high heat and add the remaining oil, swirling to coat the wok. Add half the beaten egg mixture and cook for 1-2 minutes, or until golden-brown on the underside. Flip the omelette over and cook for another minute on the other side, or until golden-brown and cooked through. Season with soy sauce and freshly ground white pepper. Slide onto on a warmed plate and cover with foil. Repeat with the remaining egg mixture. ", "To serve, fill the omelette with the spring onion, cooked chicken or ham and salad leaves. Spoon over the sweet chilli sauce and serve immediately."]}, {"isVegetarian": true, "title": "Egg fried rice with tomatoes", "url": "www_bbc_co_uk_food_recipes_eggfriedrice_89260", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfriedrice_89260_16x9.jpg", "ingredients": ["2 tbsp groundnut oil", "3 free-range eggs, beaten", "400g/14oz cooked long-grain rice, chilled until completely cold", "½ small head broccoli, cut into small florets", "1 carrot, cut into matchsticks", "3 tomatoes, sliced ", "3 tbsp light soy sauce", "dash toasted sesame oil (optional)", "freshly ground black pepper (or pinch white pepper)", "1 large spring onion, finely sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add half the groundnut oil, then add the eggs and scramble for 1-2 minutes. Transfer the scrambled eggs to a warm plate and set aside. Wipe away the excess oil from the wok.", "Reheat the wok and add the remaining groundnut oil. When the work is hot, add the broccoli florets and carrot and stir-fry for 3 minutes until tender, but still crunchy. Add the cooked rice and stir well to break up the grains, then add the tomatoes and stir fry for 1-2 minutes. ", "Return the egg to the wok with the rice and vegetables and season, to taste, with the soy sauce, sesame oil and pepper. Stir in the sliced spring onion.", "Pile the rice onto a plate and serve immediately."]}, {"isVegetarian": true, "title": "Egg in tomato sauce", "url": "www_bbc_co_uk_food_recipes_eggintomatosauce_85389", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint tomato juice (from can of tomatoes)", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 free-range egg", "handful fresh parsley, chopped, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the tomato juice and olive oil into a small frying pan, season with salt and freshly ground black pepper and bring to the boil.", "Crack the egg on top of the sauce and simmer until the egg white has set and the yolk is still runny.", "To serve, carefully transfer the egg and juice to a shallow bowl and scatter over the parsley."]}, {"isVegetarian": true, "title": "Egg-free sponge cake", "url": "www_bbc_co_uk_food_recipes_eggless_sponge_cake_70634", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggless_sponge_cake_70634_16x9.jpg", "ingredients": ["450g/1lb plain flour", "40g/1½ oz cocoa powder", "2 tsp baking powder", "2 tsp bicarbonate of soda", "300g/10½ oz caster sugar", "125ml/4fl oz sunflower oil", "300ml/½ pint milk", "2 tbsp white vinegar", "2 tsp vanilla extract"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C (Fan)/Gas 4. Grease and line a 23cm/9in springform tin.", "Sift the flour, cocoa powder, baking powder and bicarbonate of soda into a bowl. Stir in the sugar until everything is completely combined.", "In a jug, mix together the oil, milk, vinegar and vanilla extract. Make a well in the centre of the dry ingredients and pour in the oil and milk mixture. Stir steadily until the ingredients are completely mixed, making sure there are no pockets of flour left. ", "Pour the batter immediately into the prepared tin and bake in the oven for about an hour, or until a skewer inserted into the centre of the cake comes out clean. Keep an eye on the cake - you may need to cover the top with foil if the edges are catching.", "Remove the cake from the oven and set aside to cool slightly. Turn out onto a wire rack and set aside to cool completely.  When cool, split the cake in half horizontally to form two layers. Fill the centre with your favourite filling - buttercream, cream and fruit, jam or fruit curd."]}]