[{"ingredients": ["2 huevos", "Harina simple 100g / 3½zoz", "30ml / 1¼fl de onza de leche", "mantequilla de perilla, para freír", "50g / 1¾oz de calabaza", "¼ de manzana, sin corazón y en cubitos", "1 cucharadita de azúcar moreno", "3 cucharadas de yogur griego", "miel a llovizna"], "method": ["Mezcle los huevos, la harina y la leche para formar una masa de panqueque.", "Derretir un poco de mantequilla en una sartén pequeña. Cuando caliente poner en un cucharón de la mezcla para hacer un panqueque. Cocine hasta que esté dorado en ambos lados. Repita hasta que la mezcla se haya agotado.", "Derrita un poco más de mantequilla en la sartén y saltee la calabaza y la manzana hasta que estén suaves.", "Agregue el azúcar moreno y deje que se caramelice.", "Retire del fuego y agregue el yogur griego.", "Cuchara la mezcla de yogurt por igual entre los panqueques y servir."], "url": "www_bbc_co_uk_food_recipes_butternutsquashpanca_76794", "title": "Panqueques de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ calabaza, puré", "1 cucharadita de sal", "1 cucharada de mantequilla", "salpicadura de leche", "sal y pimienta negra recién molida, al gusto"], "method": ["Coloque la calabaza en una sartén llena de agua fría con una cucharadita de sal.", "Llevar a ebullición y cocinar por 10-15 minutos. Drene y coloque de nuevo en la sartén.", "Con un machacador de papas o ricer, machaque la calabaza.", "Agregue la mantequilla, la leche, la sal y la pimienta negra recién molida, al gusto, y sirva."], "url": "www_bbc_co_uk_food_recipes_butternutsquashmash_78369", "title": "Puré de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60 g / 2½ oz de mantequilla", "10 hojas de salvia frescas, picadas", "1.5kg / 3lb 5 oz de calabaza, peladas, sin semillas, cortadas en piezas de 2cm / 1in", "grandes copos de chile pizca", "40 g / 1½ oz de queso parmesano (o un queso duro vegetariano similar), rallado grueso", "6 cucharadas de crema fresca", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una sartén grande con tapa y tapa gruesa a fuego lento. Cuando la mantequilla esté espumosa, agregue la salvia y fría por un minuto.", "Agregue las piezas de calabaza y las hojuelas de chile. Cubra la olla con una tapa y cocine durante 15-20 minutos, o hasta que la calabaza esté tierna, revolviendo ocasionalmente.", "Ligeramente machaque la calabaza, usando un tenedor, luego agregue el queso parmesano y la nata fresca hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_butternutsquashsagea_92665", "title": "Calabaza, salvia y puré de crema fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternutsquashsagea_92665_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabaza, pelada, sin semillas, cortada en cubos de 2.5cm / 1in", "2 cucharadas de miel clara", "2 cucharadas de aceite de oliva", "1 cebolla blanca picada", "2 dientes de ajo, toscamente picados", "110ml / 4fl oz de vino blanco", "500ml / 18fl oz de caldo de verduras", "20g / ¾ oz hojas de albahaca fresca", "20g / ¾oz de perifollo fresco", "75ml de aceite de oliva virgen extra", "150ml / 5fl oz de crema doble", "1 lima, jugo y ralladura solamente", "sal y pimienta negra recién molida", "50g / 2oz de crema fresca", "25g / 1oz de piñones, ligeramente tostados"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la calabaza en una bandeja para hornear y rocíe con la miel y el aceite de oliva.", "Coloque en el horno para asar durante 30-40 minutos, o hasta que estén tiernos.", "Calentar una sartén hasta que esté caliente, luego agregar la cebolla y el ajo y freír durante 1-2 minutos.", "Agregue el vino y el caldo y llévelo a ebullición.", "Cocine a fuego lento durante aproximadamente 3-4 minutos, luego agregue la calabaza cocida.", "Mientras tanto, corte la mitad de la albahaca y todo el perifollo y colóquelo en un procesador de alimentos con el aceite de oliva virgen extra y mezcle hasta obtener un puré fino. Vierta en un tazón y reserve.", "Coloque la sopa de calabaza en un procesador de alimentos limpio. Agregue la crema, el jugo de limón y la ralladura y mezcle hasta obtener un puré.", "Regrese la sopa de calabaza a la cacerola, caliéntela y condimente, al gusto, con sal y pimienta negra.", "Para servir, ponga la sopa en cuencos para servir, luego cubra con una cucharada de crème fraîche. Agregue una pizca de piñones tostados, rocíe con el puré de hierbas y adorne con el resto de la albahaca."], "url": "www_bbc_co_uk_food_recipes_butternutsquashsoup_83878", "title": "Sopa de calabaza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "¼ calabaza, pelada y cortada en cubos", "1 diente de ajo, finamente picado", "½ chalota, finamente picada", "290ml / ½ pinta de caldo de verduras", "1 tomate, finamente picado", "40g / 2½oz de queso azul"], "method": ["Calentar el aceite en una olla. Agregue la calabaza y saltee durante 2-3 minutos a fuego medio a bajo.", "Agregue el ajo y la chalota y cocine por un minuto más.", "Agregue el caldo y el tomate picado a la sartén, lleve a ebullición y reduzca el fuego a fuego lento durante 8-10 minutos, hasta que la calabaza esté suave.", "Retire la sartén del fuego y agregue el queso azul. Licuar con una batidora de mano y luego pasar a través de un colador en un recipiente.", "Vierte la sopa en tazones y sirve."], "url": "www_bbc_co_uk_food_recipes_butternutsquashsoupw_79645", "title": "Sopa de calabaza con queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de calabaza, sin semillas y en rodajas finas", "2 cucharadas de aceite de oliva", "1 diente de ajo, en rodajas", "2 cucharadas de romero fresco picado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "Halloumi de 100 g / 3½ oz, cortado en tres piezas"], "method": ["Para la calabaza, coloque la calabaza, el aceite de oliva, el ajo y el romero fresco en un tazón grande, sazone al gusto con sal y pimienta negra recién molida y mezcle.", "Calentar una sartén a fuego lento. Agregue la mezcla de calabaza y freír suavemente hasta que esté bien cocida.", "Para el halloumi, caliente el aceite en una sartén pequeña separada a fuego medio. Agregue el halloumi y fría por dos minutos en cada lado, hasta que estén dorados.", "Sirva la calabaza en un plato caliente con el halloumi frito en la parte superior."], "url": "www_bbc_co_uk_food_recipes_butternutsquashwithr_81589", "title": "Calabaza con romero y halloumi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternutsquashwithr_81589_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "100g / 3½ oz de calabaza, pelada y picada en cubos de 1cm / ½ en cubitos", "¼ de cebolla roja picada", "1 puerro, cortado y picado", "1 pimiento rojo, picado", "100ml / 3½fl oz de vino blanco", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "gran cilantro fresco puñado", "gran puñado de perejil fresco", "2 cucharadas de cebolletas frescas picadas", "1 diente de ajo, picado", "50g / 1¾oz de pan blanco fresco", "½ lima, solo jugo", "2 cucharadas de aceite de oliva"], "method": ["Para el estofado de calabaza, caliente el aceite en una sartén grande a fuego medio, coloque las piezas de calabaza en la sartén y fríe durante 6-8 minutos, revolviendo con frecuencia.", "Agregue la cebolla roja, puerro y pimiento rojo y cocine suavemente durante 4-5 minutos.", "Agregue el vino, suba el fuego y cocine a fuego lento durante 3-4 minutos. Agregue la crema y sazone bien con sal y pimienta negra recién molida.", "Para el coriandro rouille, coloque todos los ingredientes en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para servir, vierta el guiso en un tazón grande y poco profundo y rocíe sobre algunos de los rouille."], "url": "www_bbc_co_uk_food_recipes_butternutsquashsteww_85528", "title": "Estofado de calabaza con cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de mantequilla sin sal, más extra para engrasar", "55g / 2 oz de azúcar morena clara", "1 vaina de vainilla, semillas retiradas", "Harina de levante 225g / 8oz", "2 cucharaditas de polvo de hornear", "pellizcar bicarbonato de soda", "2 huevos de gallinas camperas, golpeados", "300ml / 10fl oz de leche entera", "Nueces de 55 g / 2 oz, picadas", "55g / 2oz de fechas de Medjool, picadas", "puñado de nueces picadas y fechas, para decorar", "200 g / 7 oz de crème fraîche o crema coagulada, para servir", "85g / 3oz de mantequilla salada", "85g / 3oz de azúcar mascabado", "Crema doble de 200 ml / 7 fl oz", "Whisky escocés, al gusto"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase cuatro tartaletas pequeñas con mantequilla.", "Para los postres, coloca la mantequilla, el azúcar y la vainilla en un tazón y mezcla hasta que estén combinados. Mezcle la harina, el polvo de hornear y el bicarbonato de soda en un recipiente aparte. Agregue la mezcla de harina y los huevos gradualmente a la mezcla de mantequilla y mezcle para hacer una masa. Agregue la leche, nueces y dátiles. Coloque la mezcla en latas preparadas y hornee por 30 minutos o hasta que se asienten.", "Para la salsa, caliente la mantequilla y el azúcar en una cacerola pequeña a fuego lento hasta que se derrita. Agregue la crema y el whisky, al gusto.", "Para servir, coloca la salsa sobre la parte superior o junto a los postres. Decorar con nueces picadas y dátiles y servir con crème fraîche."], "url": "www_bbc_co_uk_food_recipes_butterscotch_puddings_33496", "title": "Postres de mantequilla con salsa de whisky", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "50g / 2oz de azúcar morena suave", "50g / 2oz de sirope dorado", "vaina de vainilla, dividida", "jugo de limón (aproximadamente 1/3 de limón)", "75ml / 2½ fl oz crema doble"], "method": ["Coloque la mantequilla, el azúcar morena, el sirope dorado y la vaina de vainilla en una olla pequeña. Llevar a fuego lento a fuego lento.", "Retire del fuego y agregue el jugo de limón al gusto.", "Agregue la crema doble.", "Retire la vaina de vainilla antes de servir."], "url": "www_bbc_co_uk_food_recipes_butterscotchsauce_4814", "title": "salsa de caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "1 cucharadita de polvo de hornear", "1 cucharada de azúcar en polvo", "½ cucharadita de sal", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de extracto de vainilla", "15 g / ½ onza de mantequilla, derretida", "700ml / 1¼ pinta de maíz o aceite vegetal, para freír", "azúcar de canela", "300g / 10½oz de azúcar blanda marrón claro", "8cm / 3¼ en canela en rama", "2 tiras de cáscara de naranja", "1 estrella de anís", "4 bayas de pimienta de Jamaica", "1 lima, solo jugo", "1 naranja, solo jugo", "pizca de sal", "1 cucharadita de harina de maíz, mezclada en una pasta con 1 cucharada de agua", "350g / 12oz de guayaba, troceadas, o 350g / 12oz de mango, peladas, removidas y cortadas en trozos de 4cm / 1½ pulgadas"], "method": ["Para los buñuelos, coloca todos los ingredientes secos en un tazón grande y haz un pozo en el centro. Rompe el huevo en el centro con la vainilla y la mantequilla derretida. Frote con los dedos hasta que la mezcla se asemeje a pan rallado grueso. Agregue lentamente 125-150 ml de agua tibia, un cuarto a la vez, y mezcle en una masa suave. Gire sobre una superficie ligeramente enharinada y amase durante 5 minutos. Cubra con un paño de cocina y deje reposar durante 30 minutos.", "Mientras tanto, para hacer el jarabe de fruta, coloque todos los ingredientes, aparte de la harina de maíz y la guayaba (o mango), en una olla grande con 1 litro / 1¾ pintas de agua. Revuelva hasta que el azúcar se disuelva, luego lleve a ebullición y cocine a fuego lento durante 20 minutos, hasta que espese.", "Mezcle la harina de maíz con 1 cucharada de agua para hacer una pasta. Mezcle en el jarabe, agregue la guayaba (o mango) y cocine a fuego medio, revolviendo de vez en cuando, durante 15 minutos hasta que el almíbar sea espeso y la fruta tierna.", "Caliente el aceite en una sartén honda a 190 ° C o hasta que se dore un trozo de pan en 30 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Divida la masa en 8 bolas iguales y enrolle cada una en una ronda de 2 mm de espesor (como una tortilla) sobre una superficie ligeramente enharinada. Asegúrate de que se ajusten a tu sartén.", "Freír hasta que estén dorados y crujientes en un lado, luego darle la vuelta y cocinar el otro lado. Escurrir sobre papel de cocina y espolvorear con azúcar de canela. Repite con los buñuelos restantes.", "Rompe los buñuelos y colócalos equitativamente entre ocho tazones. Sirva un poco de sirope de fruta y sirva."], "url": "www_bbc_co_uk_food_recipes_buuelos_with_spiced_15500", "title": "Buñuelos con jarabe de guayaba especiado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buuelos_with_spiced_15500_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 col hipsi", "4 rodajas grandes de rodaballo", "sal marina y pimienta negra recién molida", "30 g / 1 oz de piñones, tostados", "30 g / 1 oz de queso parmesano", "200ml / 7fl oz de aceite de oliva", "apretón de jugo de limón", "500 g / 1 libra 2 onzas de papas baby Lincolnshire", "500g / 1lb 2oz de queso Lincolnshire Poacher", "1 cucharada de crème frâiche", "sal marina y pimienta negra recién molida", "25g / 1oz de mantequilla", "50g / 1¾oz pamplina"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Separe el corazón de la col removiendo las hojas más sueltas de las capas externas pero dejando las hojas centrales más apretadas unidas al tallo. Ponga a hervir una olla grande de agua, agregue las hojas de repollo y cocine hasta que estén tiernas. Retire con una espumadera en un recipiente con agua helada para refrescar. Regrese el agua a ebullición y cocine las hojas del centro hasta que estén tiernas, luego drene y revuelva en agua helada.", "Cubra una bandeja para hornear con un pedazo grande de papel manteca con mantequilla, sazone el rodaballo y póngalo en el papel. Doble el papel como un paquete y gírelo cuidadosamente para que la unión quede en la parte inferior. Coloque en el horno y cocine durante 7-8 minutos hasta que el pescado esté recién cocido.", "Ponga las hojas de repollo blanqueadas, los piñones, el parmesano y el aceite en una licuadora, pulse hasta que esté suave y luego sazone con sal marina, pimienta negra recién molida y jugo de limón.", "Mientras tanto, cocine las papas en una cacerola con agua hirviendo, luego escurra bien y pele. En una sartén pequeña, derrita el queso Poacher con la crema frâiche. Cubra las papas en el queso derretido y revise el condimento. Cortar el centro de repollo blanqueado en cuartos. Derretir un poco de mantequilla en una sartén y freír el repollo hasta que comience a colorear.", "Para servir, coloque el repollo en un plato y cubra con una porción de rodaballo. Coloque las papas alrededor del pescado, póngalo sobre el pesto de col y adorne con la pamplina."], "url": "www_bbc_co_uk_food_recipes_cabbage_pesto_steamed_99146", "title": "Pesto de repollo, rodaballo al vapor y patata de Lincolnshire real", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 140g / 5oz, más extra para quitar el polvo", "2 cucharaditas de azúcar en polvo, más extra para espolvorear", "¼ cucharadita de polvo de hornear", "pizca de sal", "4 cucharadas de leche", "1 huevo de gallinas camperas", "pizca de semillas de anís", "aceite de girasol, para freír", "Frambuesas de 500 g / 1 lb 2 oz", "1 manzana comiendo, pelada, sin corazón y cortada en cubitos", "75g / 2½oz de azúcar glasé, más extra para rociar", "exprimir jugo de limón"], "method": ["Tamiza la harina en un tazón grande y luego criba una vez más, para asegurarse de que esté muy bien. Agregue el azúcar impalpable, el polvo de hornear y la sal.", "En un tazón pequeño, mezcle la leche, el huevo y el anís hasta que estén livianos y espumosos.", "Haga un pozo en la harina y bata lentamente en la mezcla de huevo. Use sus manos para crear una masa áspera y amasar sobre una superficie ligeramente enharinada hasta que quede suave. Forme 16 bolas pequeñas, cubra y deje reposar por 20 minutos.", "Mientras tanto, para hacer el coulis, coloque todos los ingredientes en una cacerola a fuego lento y cocine durante 5 minutos, o hasta que estén suaves. Mezcle usando un procesador de alimentos, luego pase a través de un colador en un recipiente.", "Usando un rodillo, haga rodar las bolas de masa sobre una superficie ligeramente enharinada en rondas muy finas y déjelas reposar durante 5 minutos.", "Caliente una freidora a 170 ° C o hasta que se dore una migaja de pan en 30 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír los buñuelos uno a la vez, volteándolos hasta la mitad, hasta que estén hinchados y dorados. Escurrir bien sobre papel de cocina y espolvorear con azúcar glas. Sirve dos buñuelos por persona con el coulis."], "url": "www_bbc_co_uk_food_recipes_buuelos_with_apple_and_42330", "title": "Buñuelos con puré de manzana y frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buuelos_with_apple_and_42330_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ repollo rojo, rallado", "50ml / 2fl oz de vino tinto", "100 g / 3½ oz de azúcar en polvo", "100 ml / 3½ fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "1 cucharada de aceite de oliva", "2 puerros tiernos, limpios", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco", "1 cucharada de cebollín fresco", "100g / 3½oz de pan rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer el repollo, caliente el aceite en una cacerola grande a fuego medio. Agregue el repollo triturado y el vino tinto y cocine por tres minutos.", "Agregue el azúcar y cocine, revolviendo bien, durante dos minutos.", "Agregue el caldo de pollo, lleve a ebullición y reduzca el fuego a fuego lento. Cocine a fuego lento durante 5-6 minutos, o hasta que el repollo se haya suavizado.", "Para hacer los puerros, caliente una sartén hasta que fume. Coloque los puerros y el aceite de oliva en un tazón grande y mezcle, condimentar, al gusto, con sal y pimienta negra recién molida.", "Coloque los puerros en la bandeja de la plancha caliente para cocinar durante dos minutos en cada lado, luego transfiera al horno para asar durante cinco minutos.", "Para servir, vierta un poco de repollo en un recipiente tibio, coloque los puerros tostados y espolvoree sobre algunas de las hierbas y pan rallado."], "url": "www_bbc_co_uk_food_recipes_cabbageconfitandleek_80189", "title": "Ensalada de col 'confit' y puerro", "time": {"preparation": "", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 dientes de ajo, finamente picados", "½ repollo, rallado", "½ tomate, cortado en cubitos", "½ pinta de caldo de verduras", "puñado de perejil fresco, picado"], "method": ["Calentar el aceite en una olla pequeña y agregar el ajo, el repollo y el tomate.", "Cocine por 5-8 minutos o hasta que esté suave. Agregue el caldo y continúe cocinando durante 8-10 minutos.", "Termine agregando el perejil para servir."], "url": "www_bbc_co_uk_food_recipes_cabbagesoup_75692", "title": "Sopa de repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Repollo savoy de 400 g / 14 oz, cortado en tiras de 1 cm / ½", "300g / 10½oz cavalo nero repollo, cortado en tiras de 1cm / ½", "2 chalotes, en rodajas finas", "Panceta de 150 g / 6 oz, cortada en lardons de 5 mm / un octavo de pulgada de grosor", "3 cucharadas de eneldo, más o menos picadas", "3 cucharadas de vinagre de sidra", "sal y pimienta negra recién molida", "200ml / 9fl oz de caldo de pescado", "Crema doble 110ml / 4fl oz", "½ limón, solo jugo", "25g / 1oz de mantequilla", "4 x 175g / 7oz de filetes de lubina", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["Para el repollo, ponga a hervir una olla grande de agua, luego agregue el repollo y una pizca de sal. Cocine por dos minutos, luego drene y exprima el exceso de agua.", "Calentar una sartén grande hasta que esté caliente, agregar los chalotes y la panceta y freír durante dos minutos hasta que estén dorados y crujientes.", "Agregue el repollo drenado y sofría por 2-3 minutos más.", "Agregue el eneldo y el vinagre de sidra y sazone con la sal y la pimienta negra recién molida.", "Para la lubina, coloque el caldo de pescado y la crema doble en una cacerola y llévela a ebullición.", "Reduzca el fuego y cocine a fuego lento hasta que se reduzca en un tercio.", "Agregue la mantequilla y la mitad del jugo de limón.", "Sazone la lubina al gusto con sal y pimienta negra recién molida. Mientras tanto, caliente una sartén hasta que esté caliente y agregue el aceite de oliva y la lubina, con la piel hacia abajo.", "Freír durante 2-3 minutos en el lado de la piel, luego girar y cocinar por un minuto más en el lado de la carne. Exprime el jugo de limón restante sobre el pescado.", "Para servir, coloque un montón de repollo en el plato, coloque el pescado a su lado y ponga la salsa sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_cabbagebaconanddills_87609", "title": "Col frita con tocino y eneldo con lubina frita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ de patata, pelada y finamente picada", "300ml / 10½fl oz de caldo de verduras", "¼ repollo Savoy, picado", "Cacahuetes tostados 25g / 1oz, para adornar"], "method": ["Coloque la papa y el caldo en una cacerola a fuego alto. Llevar a ebullición y luego reducir el fuego a fuego lento durante siete minutos.", "Agregue el repollo y continúe cocinando a fuego lento durante seis minutos, hasta que el repollo se haya cocinado y las papas estén suaves.", "Para servir, vierta la sopa en un recipiente y termine con una pizca de cacahuetes."], "url": "www_bbc_co_uk_food_recipes_cabbagesoup_80623", "title": "Sopa de repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pan de 100g / 3½oz, cortado en cubos de 2.5cm / 1in", "50ml / 2fl oz de aceite de oliva", "sal y pimienta negra recién molida", "1 yema de huevo de gallinas camperas", "½ limón, solo jugo", "Crema doble 50ml / 2fl oz", "50ml / 2fl oz de yogur griego", "2 cucharadas de anchoa picada", "25 g / 1 oz de queso parmesano, rallado", "sal y pimienta negra recién molida", "1 cos lechuga, picada", "100 g / 3½ oz de pechuga de pollo ahumada, rallada", "25 g / 1 oz de queso parmesano, rallado", "1 cucharadita de menta picada", "sal y pimienta negra recién molida"], "method": ["Para hacer los croutons, en un tazón grande, mezcle el pan con el aceite hasta que se absorba y sazone bien con sal y pimienta negra recién molida.", "Freír los cubos de pan hasta que estén dorados y crujientes, luego escurrir sobre la toalla de cocina.", "Para hacer el aderezo, en un tazón grande mezcle todos los ingredientes del aderezo y luego sazone con sal y pimienta negra recién molida.", "Para hacer la ensalada, mezcle la lechuga y el pollo en el aderezo y luego acomódelos en un plato grande para servir.", "Para servir, espolvorear sobre el parmesano, los croutons y la menta, luego sazone con sal y pimienta negra recién molida al gusto."], "url": "www_bbc_co_uk_food_recipes_caesarsalad_82788", "title": "Ensalada César con pollo ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo grande de gallinas camperas", "1 diente de ajo grande, pelado y aplastado", "1 cucharada de jugo de lima", "2 cucharaditas de salsa Worcestershire", "4-5 filetes de anchoa, picados", "3 cucharadas de aceite de oliva, más un poco más para freír", "pimienta negra recién molida", "2 rebanadas gruesas de pan blanco, costras quitadas, en cubos", "1 cos lechuga, lavada, seca y rasgada en pedazos", "25 g / 1 oz de queso parmesano, rallado grueso"], "method": ["Coloque el huevo en una fuente de agua fría y deje que hierva. Hervir durante un minuto y luego sumergir en agua fría para detener el proceso de cocción.", "Una vez que el huevo esté lo suficientemente frío como para manipularlo, agriete el huevo en un procesador de alimentos y agregue el ajo, el jugo de lima, la salsa Worcestershire, las anchoas y el aceite. Procese bien y agregue pimienta al gusto.", "Calentar un poco de aceite de oliva en una sartén, luego freír los cubos de pan hasta que estén crujientes y dorados, luego escurrir sobre papel de cocina.", "Coloque la cos lechuga en un tazón grande.", "Para servir, vierta el aderezo sobre las hojas y agregue los cubos de pan frito y el parmesano. Mezcle bien y sirva a la vez."], "url": "www_bbc_co_uk_food_recipes_caesarsalad_72154", "title": "ensalada César", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caesarsalad_72154_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 col pequeña Savoy, finamente triturada", "2 cucharadas de aceite de maní o de maíz", "¼ cucharadita de semillas de mostaza negra", "pellizcar las semillas de fenogreco", "12 hojas frescas de curry", "1 chile rojo seco, roto, sin semillas", "2 cebollas pequeñas, en rodajas", "2cm / ¾en jengibre fresco, finamente triturado", "¾ cucharadita de cúrcuma en polvo", "pizca de chile en polvo", "1 tomate, cortado en cubitos"], "method": ["Calentar el aceite en una sartén grande. Mezcle las semillas de fenogreco y mostaza, las hojas de curry y el chile. Baje el fuego inmediatamente y agregue las cebollas y el jengibre.", "Cubra la sartén y suavice las cebollas sin dorar durante cinco minutos. Agregue la cúrcuma y el chile en polvo, luego agregue el repollo rallado y la sal.", "Cubra la sartén una vez más y cocine a fuego lento durante aproximadamente 10 minutos o hasta que el repollo se haya ablandado pero conserve una mordida. Agregue el tomate cortado en cubitos y sirva."], "url": "www_bbc_co_uk_food_recipes_cabbagewithmustardse_9992", "title": "Repollo con semillas de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cabbagewithmustardse_9992_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de mostaza Dijon", "2 cucharaditas de vinagre de vino blanco", "2 cucharaditas de alcaparras picadas", "1 yema de huevo de gallinas camperas", "pizca de sal", "100ml / 3½fl oz de aceite de oliva ligero", "pimienta negra recién molida", "Cohete 85g / 3oz", "2 cucharadas de aceite de oliva", "Pan de 75 g / 2½ onzas, cortado en cubos de 1 cm / ½ in", "1 huevo de gallinas camperas", "2 filetes de anchoa, picados, para servir"], "method": ["Para el aderezo, coloque la mostaza de Dijon, el vinagre, las alcaparras, la yema de huevo y la sal en un tazón y bata hasta que se combinen.", "Vierte muy gradualmente el aceite de oliva, batiendo continuamente hasta que la mezcla se combine y espese. Sazonar con pimienta recién molida negro.", "Para la ensalada, coloque el cohete en un recipiente grande, vierta sobre el aderezo y revuelva para cubrir todas las hojas.", "Calentar el aceite de oliva en una sartén a fuego medio y freír los cubos de pan hasta que estén dorados. Deje que se enfríe un poco.", "Mientras tanto, coloque el huevo en una olla con agua hirviendo y deje hervir durante 6 minutos y medio. Retirar de la sartén y correr bajo agua fría. Pele el huevo y córtelo por la mitad a lo largo.", "Para servir, coloque las hojas de rúcula en un plato grande. Espolvoree los crotones y las anchoas y cubra con las mitades de huevo hervido."], "url": "www_bbc_co_uk_food_recipes_caesarsaladwithsoftb_85215", "title": "Ensalada César con huevo hervido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]