[{"isVegetarian": false, "title": "Higos balsámicos con pechuga de pato asado y puerros crujientes", "url": "www_bbc_co_uk_food_recipes_balsamicfigswithroas_76272", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pechuga de pato", "2 higos frescos", "2 cucharadas de miel", "2 cucharadas de vinagre balsámico", "1 cucharada de mantequilla", "2 cucharadas de aceite vegetal", "100g / 3½oz de patatas nuevas, ralladas", "sal y pimienta negra recién molida", "Aceite vegetal caliente para freír", "100g / 3½oz de puerro, solo parte blanca, finamente rebanada"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno 200C / 400F / Gas 6.", "Puntuación de la pechuga de pato en un patrón entrecruzado.", "Coloque la pechuga de pato en una sartén fría, con la piel hacia abajo, y cocine a fuego alto durante tres minutos. Escápate y descarta la grasa.", "Para los higos, coloque los higos en la cacerola con el pato y cocine por otros dos minutos. Luego coloque en el horno precalentado durante cuatro minutos.", "Saque del horno, retire el pato y los higos, y desglasifique la sartén con miel y vinagre balsámico.", "Termine con la mantequilla y descanse durante tres minutos.", "Para los rösti, en una sartén pequeña caliente el aceite hasta que esté caliente.", "Agregue la papa rallada y sazone con la sal y la pimienta negra recién molida.", "Cubra la base de la sartén con las papas. Dar la vuelta después de tres minutos o cuando esté dorado. Cocine por otros dos minutos.", "Para los puerros crujientes, caliente el aceite en una olla grande o freidora. (PRECAUCIÓN: el aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Freír las tiras de puerros y escurrir sobre papel de cocina.", "Sirva el pato en la parte superior del rösti con higos balsámicos y puerros crujientes para adornar."]}, {"isVegetarian": true, "title": "Gachas de plátano y coco", "url": "www_bbc_co_uk_food_recipes_banana_and_coconut_40749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g / ¾oz avena avena", "100ml / 3½ fl oz de leche desnatada", "100ml / 3½fl oz de agua de coco", "1 plátano pequeño (80 g / 3oz de peso pelado), en rodajas", "pellizcar la canela molida (opcional)", "edulcorante bajo en calorías, al gusto (opcional)"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la avena, la leche y el agua de coco en una cacerola y refrigere durante la noche.", "Cuando esté listo para comer, coloque a fuego lento y agregue la mitad del plátano y la canela, si está usando. Cocine por 3-5 minutos.", "Sirva en un tazón tibia y cubra con las rebanadas de plátano restantes y el edulcorante, si se usa."]}, {"isVegetarian": true, "title": "Tarta de plátano y crema", "url": "www_bbc_co_uk_food_recipes_banana_and_custard_tart_86132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 225g / 8oz", "50 g / 2 oz de azúcar en polvo", "125g / 4½oz de mantequilla, ligeramente suavizada", "1 huevo de gallinas camperas, más 1 yema de huevo", "1 vaina de vainilla, semillas raspadas", "3-4 bananas, peladas, rebanadas gruesas", "1 huevo de gallinas camperas, más 2 yemas de huevo", "2 cucharaditas de ron oscuro", "50 g / 2 oz de azúcar en polvo", "400 ml / 14 fl oz crema doble", "75g / 3oz de mantequilla", "2 plátanos, pelados, cortados diagonalmente", "2 cucharadas de ron", "50 g / 2 oz de azúcar en polvo", "½ cucharadita de canela molida", "½ cucharadita de pimienta de Jamaica molida", "250g / 9oz de crema cuajada"], "serves": "Sirve 8-10", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Engrase ligeramente una lata agria de fondo suelto de 20cm / 8in", "Para la masa, coloque la harina, el azúcar, la mantequilla y las semillas de vainilla en un tazón y frote con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan (o al pulso en un procesador de alimentos).", "Batir ligeramente el huevo entero y verterlo en la mezcla de harina. Mezcle la mezcla hasta que se forme grumos, luego junte con las manos para formar una masa. Envuelva en film transparente y descanse en la nevera durante 30 minutos.", "Ruede los pasteles a un grosor de 3 mm / ⅛ pulgadas y úselos para revestir la lata de tarta, dejando cualquier exceso de hojuelas colgando sobre el borde. Enfriar en la nevera durante 10 minutos.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Precaliente una bandeja grande para hornear.", "Cubra la caja de pastelería con papel resistente a la grasa y rellene con frijoles o arroz seco.", "Coloque la lata en la bandeja para hornear precalentada y hornee durante ocho minutos.", "Retire el papel y los frijoles y hornee la caja de repostería por otros cinco minutos.", "Batir la yema de huevo restante en un recipiente.", "Cuidadosamente recorte el borde de la hojuela colgante con la parte superior de la lata, luego cepille el interior de la caja con la yema de huevo.", "Coloque la caja de repostería de nuevo en el horno durante otros cinco minutos, luego retírela del horno y déjela enfriar.", "Reduzca el horno a 170 C / 325 F / Gas 3.", "Para el relleno, coloque las rebanadas de plátano en el fondo de la caja de pastelería.", "Batir el huevo, las yemas de huevo, el ron y el azúcar juntos en un bol hasta que estén bien combinados.", "Caliente la crema en una cacerola hasta que hierva, luego bata la crema en la mezcla de huevo hasta que esté bien combinada.", "Vierta la crema pastelera en la caja de pastelería y hornee en el horno durante 20 minutos, o hasta que la crema esté recién colocada y la parte superior esté pálida dorada.", "Mientras tanto, para los plátanos salteados con especias, derrita la mantequilla en una sartén y fría los plátanos durante 1-2 minutos, o hasta que estén dorados. Vierta cuidadosamente el ron y flamee el líquido inclinando lentamente la sartén hacia la llama del gas, o enciéndala con una cerilla. Deje que las llamas se enciendan y luego se apaguen. (Precaución: mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Agregue el azúcar, la canela molida y la pimienta de Jamaica molida y fría por otro minuto.", "Para servir, corte la tarta en trozos, colóquela en los platos para servir y espolvoree un poco de plátano con crema untada."]}, {"isVegetarian": true, "title": "Magdalenas de plátano y nuez", "url": "www_bbc_co_uk_food_recipes_banana_and_pecan_21476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150 g / 5½ onzas de mantequilla, suavizadas", "100 g / 3½ oz de azúcar en polvo", "2 huevos", "2 plátanos maduros", "Pacanas 50g / 1¾oz", "150g / 5½ oz de harina de auto crianza", "140g / 5oz de mantequilla, suavizada", "175g / 6oz de azúcar glas", "1-2 cucharadas de leche"], "serves": "Hace 12 magdalenas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja para hornear con cajas de cupcake de papel.", "Para los cupcakes, bata la mantequilla y el azúcar impalpable con una cuchara de madera hasta que estén suaves y cremosos. Agregue los huevos, uno a la vez, hasta que estén completamente mezclados.", "Mash los plátanos usando un tenedor. Corta bastante las pacanas. Mezcle ambos en la mezcla de huevo hasta que se mezcle uniformemente.", "Dobla la harina en los ingredientes húmedos hasta que esté completamente combinada.", "Divida la mezcla entre las cajas de cupcake de papel. Hornee en el horno por 15 minutos o hasta que estén dorados. Dejar enfriar un poco, luego transferir a una rejilla para que se enfríe por completo.", "Mientras tanto, haz la guinda. Batir la mantequilla, el azúcar glas y la leche. Agregue una cucharada a la parte superior de cada bizcocho y extienda con un cuchillo de mantequilla."]}, {"isVegetarian": true, "title": "Magdalenas de plátano y caramelo salado", "url": "www_bbc_co_uk_food_recipes_banana_and_salted_48285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g / 5oz de mantequilla sin sal", "340g / 11¾oz de harina natural", "500 g / 1 lb 2 oz de azúcar en polvo", "100 g / 3½ oz de cacao en polvo", "2 cucharaditas de polvo de hornear", "1 cucharadita de sal", "420ml / 15fl oz de leche entera", "4 huevos grandes de gallinas camperas", "1 banana grande, pelada y triturada", "200g/7oz dulce de leche", "670g / 1lb 7oz de azúcar glasé", "210 g / 7¼ oz de mantequilla sin sal", "5 cucharadas de leche entera", "30g/1oz dulce de leche", "sal marina copos", "dulce de azúcar, cortado en pequeños cuadrados", "chocolate negro, rallado"], "serves": "Hace 24 magdalenas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 170 ° Ventilador / Gas 3 y alinee dos moldes para cupcakes de 12 hoyos con cajas de papel.", "Coloque la mantequilla, la harina, el azúcar, el cacao en polvo, el polvo de hornear y la sal en un tazón grande. Mezcle los ingredientes con un batidor eléctrico hasta lograr una consistencia arenosa. Batir ligeramente la leche y los huevos en una jarra. Con el batidor en marcha, vierta gradualmente la mitad de la leche y los huevos en el bol y mezcle bien para combinar. Cuando la masa esté suave agregue el líquido restante y continúe mezclándolo hasta que esté combinado. Revuelva el plátano.", "Divida la mezcla por igual entre las 24 cajas de cupcake y hornee durante 20-25 minutos, o hasta que la esponja rebote cuando se toca ligeramente. Deje que se enfríe durante 5 minutos en la lata, luego colóquelo sobre una rejilla de alambre.", "Para la crema de mantequilla, use un batidor eléctrico para batir el azúcar glas y la mantequilla hasta que estén bien combinados. Poco a poco agregue la leche mientras se mezcla a baja velocidad para formar una capa de hielo suave. Agregue el dulce de leche y mezcle bien. Suba la velocidad y bata hasta otros 5-10 minutos o hasta que la formación de hielo sea ligera y esponjosa. Transfiera a una manga pastelera equipada con una boquilla estrella grande.", "Una vez que los cupcakes estén fríos, use un cuchillo afilado para hacer un hueco en el centro de cada bizcocho, y mantenga el trozo de esponja recortado. Pon una cucharadita del dulce de leche en cada hueco. Vuelva a colocar la pieza recortada de esponja, recortando para ajustar y presionando suavemente hacia abajo para asegurarse de que la parte superior esté nivelada.", "Coloca un remolino de crema de mantequilla sobre cada magdalena y decora con un poco de sal marina y trozos de chocolate y chocolate negro."]}, {"isVegetarian": true, "title": "Pastel de jarabe de plátano y arce", "url": "www_bbc_co_uk_food_recipes_banana_and_maple_syrup_03992", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_and_maple_syrup_03992_16x9.jpg", "ingredients": ["200g / 7oz de mantequilla, ablandada, más extra para engrasar", "Harina simple de 400g / 14oz, más extra para quitar el polvo", "4 plátanos maduros, pelados", "200ml / 7fl oz de jarabe de arce", "Leche de 25-50 ml / 1-2 fl oz (opcional)", "150 g / 5¼ oz de azúcar en polvo", "4 huevos de gallinas camperas", "2 cucharaditas de polvo de hornear", "100 g / 3½ oz de nueces de pacana, picadas", "Crema doble de 200 ml / 7 fl oz"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 170 C / 150 Ventilador / Gas 3. Engrasar una lata de torta con forma de resorte de 23 cm / 9 in con mantequilla. Agregue una cucharada de harina a la lata e incline la lata de esta manera hasta que la base y los lados estén cubiertos con harina. Sacuda cualquier exceso de harina.", "Mezcle los plátanos en un procesador de alimentos hasta que estén bien picados, luego agregue 75ml / 2¾fl oz del jarabe de arce y mezcle hasta lograr una pasta homogénea. Vierta hasta 50 ml / 2 fl oz de leche y mezcle nuevamente para obtener una consistencia más suave, si es necesario.", "En un tazón grande, bata la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Agregue los huevos uno a la vez, golpeando después de cada adición hasta que cada huevo esté completamente incorporado a la mezcla.", "Agregue el polvo de hornear, la harina, el puré de plátano y las tres cuartas partes de las nueces pecan al recipiente. Doble suavemente la mezcla hasta que esté combinada.", "Coloque la mezcla de la torta en la lata preparada. Golpee la base de la lata cuidadosamente contra la superficie de trabajo un par de veces para asentar la mezcla, luego espolvoree las nueces de nuez picadas restantes sobre la parte superior de la torta.", "Hornee por 45-60 minutos, o hasta que la parte superior esté dorada y un pincho insertado en el centro del pastel salga limpio. Coloque la torta a un lado para enfriar en la lata durante 10 minutos, luego colóquela en una rejilla y deje que se enfríe por completo.", "Mientras tanto, lleva la crema y el jarabe de arce restante a ebullición en una cacerola. Continúe hirviendo durante 3-5 minutos o hasta que la mezcla se haya espesado un poco, luego déjelo a un lado hasta que se haya enfriado por completo.", "Antes de servir, esparza el glaseado de jarabe de arce sobre la parte superior de la torta, dejándola rociar ligeramente por los lados. Poner a un lado durante 10 minutos, luego cortar en rodajas y servir."]}, {"isVegetarian": true, "title": "Pudín de plátano y toffee", "url": "www_bbc_co_uk_food_recipes_banana_and_toffee_80843", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal, para engrasar", "2 cucharadas de salsa toffee preparada", "1 plátano maduro, pelado, en rodajas", "Harina de auto aumento 70g / 3oz", "70g / 3oz de mantequilla, ablandada", "Azúcar en polvo 70 g / 3 oz", "½ cucharadita de especias mixtas", "1 huevo de gallinas camperas, golpeado", "flan, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase la base y los lados de un plato resistente al horno con aceite, luego coloque el plato en una bandeja para hornear.", "Rocíe la salsa de caramelo uniformemente en el fondo del plato.", "Coloque una capa del plátano rebanado en el plato, manteniendo algunas rebanadas para decorar.", "Batir la harina, la mantequilla, el azúcar y la mezcla de especias en un tazón para mezclar hasta que estén suaves y bien combinados. Poco a poco golpee el huevo hasta que la mezcla esté suave y todo el huevo se haya incorporado.", "Extienda la mezcla de esponja de manera uniforme sobre las capas de plátano y toffee con una espátula. Cubra con las rebanadas restantes de plátano.", "Hornee en el horno durante 25-30 minutos, o hasta que la esponja se haya levantado y esté dorada. Sirve con crema pastelera."]}, {"isVegetarian": true, "title": "Plátano y pudín de melaza", "url": "www_bbc_co_uk_food_recipes_banana_and_treacle_52470", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de jarabe de oro", "2 plátanos grandes (1 cortado en rodajas en la diagonal, 1 puré)", "175g / 6oz de mantequilla suavizada, más extra para cubrir el cuenco del pudín", "175g / 6oz azúcar moreno claro y suave", "3 huevos de gallinas camperas", "Harina de 175g / 6oz de auto crianza", "exprimir jugo de lima", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, dividida por el medio, a lo largo o 1 cucharadita de extracto de vainilla", "6 yemas de huevo de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "1 cucharada de licor de banana (opcional)"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para el pudín de plátano y melaza, unte bien el interior de un gran recipiente de budín. Pon el jarabe dorado en la base, luego coloca el plátano en rodajas encima.", "Bata la mantequilla y el azúcar juntos, luego agregue los huevos uno a la vez con una cucharada de harina después de cada uno. Incorpore el resto de la harina y el plátano. Agregue un chorrito de jugo de lima para aflojar la consistencia un poco, luego raspe la mezcla en el recipiente del pudin.", "Cubra el lavabo con una hoja de papel (o papel de aluminio) con un pliegue doblado por la mitad (esto permite que el aire se expanda durante la cocción). Ponga un platillo a prueba de calor revuelto o un pequeño salvamanteles en una cacerola grande y profunda, y coloque el recipiente de budín en la parte superior. Agregue suficiente agua recién hervida a la sartén para llegar hasta la mitad de los lados de la cuenca. Cubra la bandeja con una tapa ajustada y colóquela a fuego lento. Deje que hierva a fuego lento durante 2 horas, agregando más agua a la sartén si es necesario. (Asegúrese de que la sartén no hierva en seco.) El pudín se hace cuando una brocheta insertada en el centro del pudín (a través de la lámina o papel) sale limpia. Cuando termine, apague el fuego y cuidadosamente levante el lavabo del agua. Deje reposar durante 5 minutos.", "Deseche el papel de aluminio y el papel. Pase un cuchillo de cubiertos por el borde del pudin para aflojar los lados. Con cuidado, invierta en un plato profundo y retire el lavabo.", "Mientras el budín está humeante, prepare la crema pastelera. Coloque la leche y la crema en una cacerola con la vaina o extracto de vainilla. Lleve casi a ebullición, luego retírelo del fuego y déjelo así para que los sabores se infundan hasta que se enfríe.", "Batir las yemas de huevo y el azúcar hasta que estén pálidas con una textura espumosa y aireada. Vuelva a calentar la leche y la crema hasta que esté justo por debajo del punto de ebullición. Cuele la mezcla de leche a través de un tamiz en una jarra y enjuague la cacerola.", "Vierta lentamente la mezcla de leche sobre los huevos, batiendo constantemente mientras lo hace, luego vuelva a verter en la cacerola. Coloque a fuego muy lento y revuelva constantemente hasta que la crema se haya espesado un poco y podrá trazar una línea cuando cubra la parte posterior de una cuchara.", "Vuelva a colar la crema pastelera y mezcle el licor de plátano, si lo está usando.", "Para servir, voltee el budín en un plato y sirva con la crema pastelera."]}, {"isVegetarian": true, "title": "Panqueques veganos de plátano, arándanos y nueces", "url": "www_bbc_co_uk_food_recipes_banana_blueberry_and_50179", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_blueberry_and_50179_16x9.jpg", "ingredients": ["100 g / 3½ oz de avena porridge", "50g / 1¾oz nueces de pacana, más o menos picadas", "1 cucharadita de polvo de hornear", "Una pizca de sal marina", "1 plátano maduro, pelado y puré", "150ml / 5fl oz de leche de coco o leche de almendras", "2 cucharaditas de aceite de coco, para freír", "Arándanos 200g / 7oz", "100 g / 3½ oz de arándanos", "3 cucharadas de azúcar en polvo", "2 plátanos, pelados y cortados en rodajas finas", "algunas nueces pecanas finamente picadas", "1 lima, cortada en cuñas", "8 cucharadas de jarabe de arce (opcional)"], "serves": "Rinde 8 panqueques pequeños", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 120C / 100C ventilador / Gas ½.", "En un procesador de alimentos, pulse la avena hasta que tenga una harina desaliñada. Transfiera a un tazón grande. Agregue las nueces, el polvo de hornear y la sal.", "En otro recipiente, mezcle el puré de plátano con la leche (puede hacerlo en el procesador de alimentos, si lo desea). Batir la mezcla de plátano en los ingredientes secos y dejar reposar durante unos minutos.", "Para la compota de arándanos, ponga los arándanos y el azúcar en una olla pequeña con una cucharadita de agua y cocínelos durante 3-4 minutos, o hasta que tenga una compota espesa y brillante. Ponga a un lado hasta que esté listo para servir.", "Caliente una sartén antiadherente a fuego medio. Agregue las rodajas de plátano y freír en ambos lados en la sartén hasta que estén doradas y caramelizadas. Mantenga caliente en el horno.", "Vuelva a poner la sartén sobre el fuego y agregue un poco de aceite de coco o mantequilla. Coloque una generosa cucharada de masa para cada panqueque. Una vez que los lados estén cocidos y las burbujas hayan subido a la superficie, esparza un puñado de arándanos y voltea el panqueque. Cocine por otro par de minutos en el otro lado, o hasta que estén ligeramente coloreados. (Los panqueques permanecerán un poco húmedos en el medio debido a la banana, así que no te preocupes). Manténlos calientes en el horno mientras cocinas los panqueques restantes.", "Sirva los panqueques en una pila con las rodajas de plátano. Agregue algunas pacanas picadas y un chorrito de lima, y, si lo desea, con un chorrito de jarabe de arce. Sirve la compota en el lateral."]}, {"isVegetarian": true, "title": "Pastel de platano", "url": "www_bbc_co_uk_food_recipes_banana_bread_06221", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_bread_06221_16x9.jpg", "ingredients": ["6 plátanos muy maduros", "125ml / 4½fl oz de aceite vegetal", "115g / 4oz de mantequilla, ablandada, más extra para engrasar", "Azúcar en polvo de 335 g / 11½ oz", "4 huevos de gallinas camperas", "Harina simple de 450g / 1lb", "2 cucharaditas de polvo de hornear", "1 cucharada de canela molida", "1 cucharadita de clavo de olor molido", "½ cucharadita de sal", "225 g / 8oz de pasas", "Pacanas 225 g / 8 oz"], "serves": "Rinde 2 panes", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase y alinee dos moldes de pan medianos (o tres pequeños).", "Aplaste los plátanos y el aceite vegetal en un tazón y déjelos a un lado.", "En un tazón para mezclar por separado, unte la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Batir los huevos, uno a la vez, luego agregue la mezcla de plátano hasta que estén bien combinados.", "Mezcle la harina, el polvo de hornear, las especias molidas y la sal juntas en otro recipiente y dóblelas ligeramente en la mezcla de plátano. Agregue las pasas y nueces y dóblelas ligeramente.", "Con una cuchara, coloque la mezcla de pastel en las latas de pan y hornee en el horno durante 1 hora y media, o hasta que se levante y se dore. Revise después de una hora y reduzca ligeramente la temperatura del horno si los panes se doran demasiado rápido en la parte superior, o cubra los panes con papel de aluminio.", "Deje que el pan de plátano se enfríe en las latas, luego gire y sirva en rodajas gruesas."]}, {"isVegetarian": false, "title": "Pastel de plátano con caramelo de miso y praliné de semilla de girasol", "url": "www_bbc_co_uk_food_recipes_banana_cake_with_banana_07454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 plátanos", "250g / 9oz de mantequilla sin sal ablandada", "150 g / 5½ oz de azúcar en polvo", "150g / 5½oz de azúcar moreno oscuro", "100g / 4 oz de jarabe de oro", "4 huevos de gallinas camperas", "100ml / 3½ fl oz de leche", "2 cucharaditas de bicarbonato de soda", "550g / 1lb 4 oz de harina de auto crianza", "300 g / 10½ oz de azúcar en polvo", "4 plátanos demasiado maduros, puré", "100g / 4oz de azúcar mascabado", "Habitación de 80g / 3oz", "Pasta de miso 25g / 1oz", "100ml / 3½ fl oz de leche", "Crema doble 300g / 10½oz g", "100g / 4oz de mantequilla sin sal, cortada en cubos", "200 g / 8 oz de semillas de girasol, muy tostadas", "100 g / 4 oz de azúcar en polvo", "Pasta de miso 25g / 1oz", "50g / 2oz de azúcar mascabado", "100ml / 3½ fl oz de leche", "300 ml / 10 fl oz doble crema", "100g / 4oz de crema fresca"], "serves": "Para 8-12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y alinee dos bandejas para hornear con papel de hornear.", "Para hacer la torta de plátano, perfora las pieles de plátano, colócalas en una de las bandejas preparadas y hornea por 10 minutos. Una vez que estén lo suficientemente fríos como para manipularlos, quítales los plátanos de la piel y aplástalos en un bol.", "Baje el horno a 170C / 150C Fan / Gas 3½ y forre una bandeja grande y profunda de 25x30cm / 10x12in con papel de hornear.", "Bata la mantequilla y el azúcar en un tazón, hasta que quede esponjoso. Agregue los huevos y el puré de plátano y mezcle bien.", "Vierta la leche en una olla pequeña y caliente hasta que esté caliente, pero no hirviendo, a fuego medio. Agregue el bicarbonato de soda y revuelva para disolver, vierta en el tazón de la torta y mezcle bien.", "Doble la harina, mezcle y vierta en la bandeja de horno preparada. Hornee por 20-25 minutos o hasta que el pincho salga limpio.", "Mientras tanto, para hacer el caramelo de miso de plátano, coloque el azúcar impalpable en una cacerola a fuego medio hasta que comience a caramelizar, sacudiendo la olla de vez en cuando para evitar que se queme. Agregue los plátanos y el azúcar mascabado y agite para combinar. Cocine hasta que el líquido haya salido de los plátanos.", "Agregue el ron a la sartén y cocine hasta que el líquido se haya evaporado. Agregue el miso, la leche y la crema y mezcle bien. Agregue la mantequilla un cubo a la vez, mezclando cada uno hasta que tenga un caramelo suave.", "Para hacer la semilla de girasol praliné, coloque el azúcar en una cacerola a fuego medio y caramelice, agitando la olla de vez en cuando para evitar que se queme. Agregue las semillas de girasol y mezcle bien, vierta en una bandeja para hornear preparada y deje enfriar. Una vez que esté frío, mezcle un procesador de alimentos con unas gotas de agua para formar una pasta.", "Para hacer la crema de miso y moscovado, coloque el miso, el mascabado y la leche en una cacerola y cocine a fuego medio hasta que el azúcar se haya disuelto. Viértalo en un tazón grande y déjelo enfriar.", "Batir la crema doble y la crema fresca en un tazón hasta que estén firmes, luego doblar en el miso y la leche mascabado.", "Para servir, espolvorea un poco de la pasta en un plato para servir y corta una porción del pastel y colócalo encima de la pasta. Cubra con la salsa de caramelo y una cucharada de crema al lado del pastel."]}, {"isVegetarian": true, "title": "Avena crujiente de cacao de banano", "url": "www_bbc_co_uk_food_recipes_banana_cocoa_crunch_06267", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_cocoa_crunch_06267_16x9.jpg", "ingredients": ["40 g / 1½ oz de avena enrollada (use avena sin gluten si es necesario)", "pequeñas avellanas", "150ml / 5fl oz de leche o leche de soja", "1 cucharada de jarabe de arce", "½ banana, picada", "1 cucharadita de semillas de cacao"], "serves": "Sirve 1", "time": {"preparation": "durante la noche", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Coloque la avena y las avellanas en una bandeja para hornear y tápelas durante 7 minutos, hasta que huelan fragantes. Alternativamente, bríndelos en una sartén. Dejar de lado para enfriar.", "Picar las avellanas y ponerlas en un recipiente con tapa. Agrega la avena. Vierta la leche y el jarabe de arce y cubra con las semillas de plátano y cacao. Deje pasar la noche en la nevera.", "Para servir, cubra con más semillas de plátano y cacao si lo desea."]}, {"isVegetarian": true, "title": "Profiteroles de crema de plátano con caramelo de whisky", "url": "www_bbc_co_uk_food_recipes_banana_cream_53293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g / 3oz de mantequilla", "Harina normal de 100 g / 3½ oz", "3 huevos de gallinas camperas", "3 plátanos, piel en", "1 vaina de vainilla, cortada en 3", "2 cucharadas de miel líquida", "pellizcar canela molida", "Crema doble de 250 g / 9 oz, ligeramente azotada", "250g / 9oz de mascarpone", "250 g / 9 oz de azúcar en polvo", "splash bourbon whisky, al gusto", "Crema doble de 250g / 9oz", "3 plátanos, pelados y cortados en ángulo", "200 g / 7 oz de azúcar en polvo, más extra para caramelizar los plátanos", "azúcar en polvo, para quitar el polvo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y forre una bandeja grande para hornear con papel de hornear.", "Para hacer la pasta choux, derrita la mantequilla con 220ml / 8fl de agua en una cacerola y llévela a ebullición, incline la harina y, con una cuchara de madera, hágalo inmediatamente hasta que quede suave. Retire la sartén del fuego y continúe batiendo hasta que se haya enfriado un poco.", "Batir los huevos uno a la vez hasta que estén completamente incorporados y brillantes. Dejar de lado para enfriar.", "Cuchara en una manga pastelera. Pipe las bolas de la masa en la bandeja de horneado preparada, dejando un espacio generoso entre cada una. Hornea por 25 minutos. Ahueca un pequeño orificio en la masa y hornea por otros 5 minutos. Dejar de lado.", "Para hacer el relleno de banana, apague el horno a 190C / 170C Fan / Gas 5.", "Haz una hendidura en cada plátano y rellena con un tercio de la vaina de vainilla, miel y canela. Envuelva en papel de cocina y hornee durante 20 minutos. Raspe la carne de la piel y empuje a través de un tamiz en un recipiente limpio. Mezcle con la crema ligeramente batida y mascarpone. Vierta en una manga pastelera y pinte en los bollos. Dejar de lado.", "Para hacer el caramelo de whisky, caliente el azúcar a fuego lento hasta que se derrita. Retire del fuego y luego mezcle un chorrito de whisky y la crema doble, luego coloque a fuego lento para calentar. Dejar de lado.", "Para servir, coloque el azúcar impalpable en una sartén a fuego lento hasta que se derrita. Sumerge cada bollo choux en el caramelo y crea una torre en forma de cono. Espolvoree azúcar impalpable sobre el plátano en rodajas y caramelice con un soplete de cocina. Dispersión sobre la torre. Cuchara sobre un poco de caramelo de whisky y terminar con un poco de azúcar glas."]}, {"isVegetarian": true, "title": "Muffins de banana", "url": "www_bbc_co_uk_food_recipes_banana_muffins_51549", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_muffins_51549_16x9.jpg", "ingredients": ["125g / 4½oz de harina integral", "3 cucharadas de azúcar ligera mascabado", "Polvo de hornear 2 cucharaditas de nivel", "1 huevo mediano de granja, golpeado", "50g / 1¾oz de yogur natural bajo en grasa", "50ml / 2fl oz de aceite de colza, más un poco extra para engrasar", "2 plátanos maduros (175g / 6oz de peso pelado), aproximadamente triturados"], "serves": "Hace 6 muffins", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra un molde para muffins de seis agujeros con fundas para muffins o engrase.", "Mezcle la harina, el azúcar y el polvo de hornear en un tazón. En otro recipiente, bata el huevo, el yogur y el aceite. Haga un pozo en la harina, vierta el líquido y mezcle bien. Agregue los puré de plátano, teniendo cuidado de no mezclar.", "Coloque la mezcla en las cajas preparadas y hornee durante 20-30 minutos, o hasta que un pincho insertado en el centro salga limpio. Transfiera los muffins a una rejilla de alambre para enfriar."]}, {"isVegetarian": false, "title": "Panqueques de plátano con tocino rayado", "url": "www_bbc_co_uk_food_recipes_banana_pancakes_with_98240", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_pancakes_with_98240_16x9.jpg", "ingredients": ["55 g / 2 oz de mantequilla, en cubos", "275g / 9¾oz de harina de auto crianza", "1 cucharadita de polvo de hornear", "2 huevos de gallinas camperas", "2 cucharadas de azúcar moreno claro", "300ml / ½ pinta de leche entera", "1 plátano grande, aproximadamente picado", "1-2 cucharadas de aceite de girasol", "8 lonchas de tocino rayado sin corteza", "arce o jarabe dorado, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 110C / 225F / Gas ¼.", "Derretir 25 g / 1 oz de la mantequilla en una sartén pequeña a fuego lento y dejar enfriar durante cinco minutos.", "Coloque la mantequilla derretida, la harina, el polvo de hornear, los huevos, el azúcar y la leche en un procesador de alimentos y mezcle hasta que quede suave.", "Vierta en un tazón grande y mezcle el plátano en la mezcla con un triturador de patatas.", "Derrita un poco del aceite con un cubo de mantequilla en una sartén antiadherente grande a fuego medio. Limpie alrededor de la base de la sartén con un grueso rollo de papel de cocina.", "Coloque cuatro cucharadas grandes de la mezcla de panqueques de plátano en la sartén, separándolas bien. Cocine durante tres minutos, o hasta que los panqueques se levanten, aparezcan burbujas y la superficie parezca seca.", "Voltee con un cuchillo de paleta y cocine en el otro lado por otros 2-3 minutos, o hasta que esté pálido dorado.", "Transfiera a un plato resistente al calor y manténgalo caliente en el horno mientras cocina los ocho panqueques restantes exactamente de la misma manera.", "Regrese la sartén al fuego y agregue el tocino rayado. Cocine por unos tres minutos por cada lado hasta que esté dorado y crujiente, volteándolo una vez. Agregue un poco de aceite si las lonchas comienzan a pegarse.", "Coloque los panqueques en cuatro platos calientes y cubra con el tocino frito. Rocíe con un poco de jarabe de arce (o jarabe dorado) y sirva el resto por separado."]}, {"isVegetarian": true, "title": "Batido de plátano", "url": "www_bbc_co_uk_food_recipes_banana_smoothie_17334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g / 3½oz de yogur sin grasa al estilo griego", "1 plátano pequeño (75 g / 2½ oz de peso pelado), roto", "175ml / 6fl oz de leche desnatada", "pellizcar canela molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que quede suave. Verter en un vaso y servir, o en una botella para llevar y beber en el camino."]}, {"isVegetarian": true, "title": "Plátano se divide", "url": "www_bbc_co_uk_food_recipes_banana_split_90276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50 g / 1¾oz de avellanas sin cáscara, tostadas, pieles frotadas", "25 g / 1 oz de azúcar en polvo", "1 cucharada de mantequilla", "100 g / 3½ oz de chocolate negro, roto en pedazos", "50ml / 2fl oz crema batida", "1 cucharada de jarabe de oro", "pequeña perilla de mantequilla", "1 cucharada de ron", "50g / 1¾oz de mantequilla", "4 plátanos grandes, divididos longitudinalmente y cortados a la mitad", "75g / 2¾oz de azúcar morena suave y ligera", "pizca de sal", "helado", "crema batida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para las avellanas confitadas, forre una bandeja para hornear con papel de hornear. Pon las avellanas, el azúcar y la mantequilla en una sartén pequeña. Cocine a fuego lento hasta que el azúcar se haya derretido, girando ocasionalmente pero sin remover.", "Suba ligeramente el fuego y continúe cocinando y girando hasta que el caramelo se haya dorado. Inmediatamente incline las avellanas en la bandeja de hornear y sepárelas. Deje endurecerse y fragmentarse un poco si lo desea en trozos más pequeños.", "Para la salsa de chocolate Ponga el chocolate, la crema y el sirope dorado en una cacerola y derrita a fuego muy bajo, batiendo para combinar. Agregue la mantequilla y el ron, y manténgase caliente mientras prepara los plátanos.", "Para las divisiones de plátano, derrita suavemente la mantequilla en una sartén grande. Cuando empiece a formar espuma, agregue los plátanos y luego espolvoree sobre el azúcar y una pizca de sal. Suba el fuego a fuego medio-alto y cocine los plátanos, volteándolos de vez en cuando, hasta que estén bien cubiertos con azúcar caramelizado y mantecoso.", "Divida los plátanos entre cuatro tazones y cubra con helado, crema batida, las avellanas confitadas y la salsa de ron de chocolate."]}, {"isVegetarian": true, "title": "Tarta de plátano tatin", "url": "www_bbc_co_uk_food_recipes_banana_tart_tatin_74566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de azúcar en polvo", "1½ cucharada de ron", "25 g / ½ oz de mantequilla", "8 plátanos, pelados y cortados en trozos de 2½cm / 1in", "500 g / 1lb 2 oz de hojaldre", "1 huevo, batido, para esmaltar"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el azúcar impalpable en una sartén antiadherente a prueba de horno de 20 cm / 8 in. Calienta suavemente hasta que el azúcar se convierta en caramelo. Una vez que el azúcar se haya disuelto, agregue una y media cucharadas de agua y el ron y deje que burbujee.", "Cuando el caramelo esté dorado, quítelo del fuego y agregue la mantequilla.", "Siente los trozos de plátano en el caramelo, empaquételos y no dejes huecos.", "Estire la masa de hojaldre sobre una superficie de trabajo ligeramente enharinada y siéntela encima de los plátanos, metiendo cualquier exceso hacia un lado de la sartén. Esmalte de la pastelería con huevo lavado. Transfiera la sartén al horno por 20 minutos, o hasta que la masa esté crujiente y dorada.", "Antes de servir, vierta cuidadosamente el exceso de líquido. Invierta un plato sobre la sartén y saque el tatin."]}, {"isVegetarian": true, "title": "Tarta tatin de plátano", "url": "www_bbc_co_uk_food_recipes_banana_tarte_tatin_23202", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de azúcar en polvo", "75g / 2¾oz de mantequilla, más extra para engrasar", "pellizcar el cardamomo molido (opcional)", "1 naranja, ralladura solamente (opcional)", "4-5 plátanos, pelados y cortados en trozos de 2cm / ¾in.", "Pastel de hojaldre en bloque de 375g / 13oz", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "4 yemas de huevo de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "3 cucharadas de cacao en polvo", "1 cucharada de harina de maíz"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalienta el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Cocina generosamente un plato de tarta tatin o similar de alrededor de 23-24 cm / 9-9½ pulgadas de diámetro. También puedes utilizar una sartén de hierro fundido ya que es resistente al horno.", "Derrita el azúcar en una cacerola bastante ancha, teniendo cuidado de no removerla, sino de darle vueltas de vez en cuando, hasta que el azúcar se haya derretido y se haya vuelto de color caramelo claro. Retire del fuego y agregue la mantequilla.", "El líquido burbujeará, luego disminuirá, y luego puede batir la mantequilla. Si el caramelo se divide, puede agregar una cucharada de agua tibia y volver a batir, la salsa debe volver a emulsionarse.", "Vierta el caramelo sobre el plato de tarta tatin o sartén, luego espolvoree el cardamomo y la ralladura de naranja, si está usando. Arregle los plátanos con el lado cortado sobre el caramelo; deben quedar bien ajustados.", "Estire la masa de hojaldre en una ronda, o simplemente puede extenderla y recortarla en una ronda. Píllalo ligeramente con un tenedor, luego colócalo encima de los plátanos, colocando los bordes a medida que avanzas. Hornee durante 40-45 minutos, o hasta que la masa esté dorada. Puede ser un poco elevado.", "Para la crema pastelera, caliente la leche y la crema juntas hasta justo debajo del punto de ebullición. Retire del fuego.", "Mezcle las yemas de huevo, el azúcar, el cacao en polvo y la harina de maíz en un tazón, luego vierta la mezcla de leche y crema en el tazón desde una altura constante, moviéndolo a medida que avanza. Vuelva a la cacerola (enjuague primero), luego cocine a fuego lento, revolviendo constantemente, hasta que la crema se espese.", "Sirva rebanadas de tarta tatin con flan de chocolate en un lado."]}, {"isVegetarian": true, "title": "Tarta tatin de plátano", "url": "www_bbc_co_uk_food_recipes_banana_tarte_tatin_69729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "Una pizca de sal marina", "190g / 6¾oz de mantequilla sin sal, fría, cortada en cubos de 2cm / ¾in", "½ cucharada de jugo de limón", "100g / 3½ oz de azúcar blanco granulado", "60g / 2¼ oz de mantequilla salada", "3 plátanos firmes"], "serves": "Sirve 8", "time": {"preparation": "durante la noche", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Para la pasta de hojaldre basta, tamice la harina y la sal en un tazón grande y agregue la mantequilla. Mueva la mantequilla hasta cubrir la harina.", "Mezcle 125ml / 4fl oz de agua y el jugo de limón en una jarra y vierta en la harina y la mantequilla. Usando un cuchillo de mantequilla, mezcle el líquido y pique la mantequilla ligeramente sobre la marcha, girando el recipiente redondo, hasta que los ingredientes se combinen en una masa.", "En una superficie de trabajo enharinada, incline la masa y rápidamente forme un bloque. Estirar la masa en un rectángulo de aproximadamente 35cmx20cm / 14inx8in de tamaño. Con el lado corto del rectángulo de pastelería frente a usted, doble el tercio inferior de la masa al centro, luego doble la mitad superior hacia abajo para cubrirlo. Enrolle los pasteles en un rectángulo nuevamente y repita el proceso de doblado. Gire la pastelería un cuarto de vuelta y estire y doble nuevamente. Repite esto de 4 a 5 veces.", "Después del último plegado, envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante unas horas, o preferiblemente durante la noche. Cuando la masa se haya enfriado, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Para hacer el caramelo, caliente el azúcar con una cucharada de agua en una sartén a prueba de horno a fuego lento y deje que hierva lentamente. Mantenga hirviendo hasta que el jarabe se vuelva dorado claro, esto tomará entre 5 y 7 minutos. Agregue la mantequilla y agite la sartén (no revuelva) hasta que todo se haya derretido. Retirar del fuego y dejar enfriar durante unos minutos.", "Cortar los plátanos en rondas y organizar en un patrón en el caramelo.", "Estirar la masa y cortar un círculo un poco más grande que la sartén. Coloque la masa en la parte superior de los plátanos y métala alrededor de los bordes. Perfore la parte superior de la masa con un tenedor y colóquela en el horno precalentado durante 40-45 minutos, o hasta que la masa esté dorada e hinchada. Inmediatamente voltee la tarta en un plato (tenga cuidado ya que el caramelo aún estará muy caliente y puede salpicar) y sirva."]}]