[{"ingredients": ["Harina normal de 120g / 4½oz", "225 g / 8 oz de azúcar en polvo", "100 g / 3½ oz de avena", "85g / 3oz de coco desecado", "125g / 4½oz de mantequilla, más extra para engrasar", "1 cucharada de jarabe de oro", "1 nivel de cucharadita de bicarbonato de soda", "2 cucharadas de agua hirviendo"], "method": ["Precalentar el horno a 170C / 325F / Gas 3. Engrasar un molde cuadrado de 20cm / 8in", "Mezcle la harina, el azúcar, la avena y el coco en un tazón grande.", "Pon la mantequilla en una olla pequeña con el almíbar dorado y calienta suavemente hasta que se derrita. Mezcle el bicarbonato de soda con el agua hirviendo y agregue esto a la mezcla de mantequilla y jarabe.", "Vierta el líquido sobre los ingredientes secos y mezcle bien. Incline la mezcla en lata y presione hacia abajo.", "Hornee en el horno precalentado durante 20 minutos o hasta que estén dorados, luego déjelos enfriar por unos minutos antes de cortarlos en rodajas. Alternativamente, dé forma a la mezcla en galletas y colóquelas en una bandeja de horno engrasada. Cocine por 10-15 minutos o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_diggers_46052", "title": "Diggers", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/diggers_46052_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5oz", "1 cucharadita de sal", "14g / ½ oz de levadura fresca", "150ml / 5fl de leche en oz", "2 claras de huevo de gallinas camperas", "3 cucharadas de cebollines frescos finamente picados", "2 cucharadas de aceite de oliva", "50g/2oz caviar", "Crema agria de 150g / 5oz"], "method": ["Coloque la harina y la sal en un bol y desmigaje en la levadura.", "Coloque la leche en una sartén a fuego lento y caliente.", "Vierta la leche tibia en la harina, mezcle bien para formar una masa espesa. Dejar de lado por una hora.", "Batir las claras de huevo hasta que se formen picos suaves cuando se quita el batidor.", "Dobla las claras de huevo y el cebollín en la mezcla de rebozado.", "Calentar una pequeña cantidad del aceite de oliva en una sartén a fuego medio.", "Agregue una cucharada de la mezcla y fría por 45-60 segundos, hasta que se dore por debajo, luego voltee y cocine durante 30 segundos en el otro lado. Retire el blini y colóquelo en papel de cocina. Repita este proceso con la masa restante. Mantenga los blinis calientes", "Para servir, coloque una cucharada de crema agria en cada blini, cubra con una cucharada de caviar y coloque en un plato grande."], "url": "www_bbc_co_uk_food_recipes_dillbliniswithcaviar_86321", "title": "Cebolleta blindada con caviar y crema agria", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka o ginebra de 70 ml / 2 fl oz", "1 cucharada de vermut seco", "2 cucharadas de salmuera de oliva", "1 rodaja de limón", "1 aceituna verde"], "method": ["Vierta el vodka, el vermut seco y la salmuera de oliva en una coctelera con un puñado de hielo y agite bien.", "Frote el borde de un vaso de martini con la rodaja de limón.", "Cuele el contenido de la coctelera en el vaso y agregue la aceituna."], "url": "www_bbc_co_uk_food_recipes_dirtymartini_93631", "title": "Martini sucio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dirtymartini_93631_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 gotas de extracto de vainilla", "2 cucharaditas de miel líquida", "270 g / 9½ oz de yogur al estilo griego", "50g / 2oz de frambuesas frescas, machacadas", "100 g / 4 oz de fresas frescas, puré"], "method": ["En un tazón, mezcle el extracto de vainilla y la miel en el yogur. Agregue la fruta y los jugos de fruta con una espátula para crear un patrón de remolino.", "Divida la mezcla en partes iguales entre cuatro moldes de piruletas. Cubra con las tapas o con papel de aluminio.", "Congele la discoteca emerge durante la noche."], "url": "www_bbc_co_uk_food_recipes_disco_pops_02468", "title": "Disco pops", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/disco_pops_02468_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de melaza de granada", "6 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Coloque la melaza de granada, el aceite de oliva y el vinagre de vino blanco en un tarro de mermelada limpio.", "Pon la tapa sobre el tarro y agita bien. Sazone con sal y pimienta recién molida al gusto y use el aderezo de su ensalada favorita."], "url": "www_bbc_co_uk_food_recipes_divinesaladdressing_85676", "title": "Ensalada de melazas de granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 8 cucharadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de leche de buena calidad o chocolate negro, picado", "100g / 3½oz de coco desecado", "200ml / 7fl oz de leche condensada", "puñado de mini malvaviscos", "2 cucharadas de mantequilla de maní, crujiente o lisa", "mezcla de frutos secos y nueces"], "method": ["Coloque 200 g / 7 oz del chocolate en un recipiente de vidrio. Derrita en el microondas en la configuración más baja hasta que esté casi liso. Revuelva rápidamente el chocolate restante. (Esto reduce la temperatura rápidamente y garantiza un acabado liso y brillante.)", "Vierta el chocolate derretido en los cuadrados del cubo de hielo hasta aproximadamente un cuarto de lleno. Mueva la bandeja hasta que los lados de los moldes del cubo estén cubiertos de chocolate. Reserve en un lugar fresco hasta que esté completamente fraguado.", "Mientras tanto, cubra el chocolate derretido restante con film transparente y déjelo en un lugar cálido. Si comienza a solidificarse, coloque el tazón de chocolate sobre un recipiente más pequeño de agua hirviendo y revuelva suavemente hasta que esté suave otra vez.", "Para hacer el relleno de coco, coloque el coco desecado en un tazón pequeño y agregue la leche condensada hasta que se adhiera entre sí pero no esté descuidado. Rodar en pequeños cuencos.", "Una vez que la base de chocolate se endurece, puede agregar una selección de rellenos a los cuadrados. Agregue una bola de coco, o una cucharadita de mantequilla de maní, o espolvoree algunas nueces o frutas. (No llene demasiado los cuadrados ya que esto puede causar roturas al sacarlos del molde).", "Vierta el resto del chocolate derretido, hasta que todos los moldes estén llenos y los rellenos estén cubiertos. Deje que se endurezca en un lugar fresco.", "Una vez que esté listo, apague cuidadosamente los chocolates. Si lo desea, aplique un poco de chocolate derretido encima de cada chocolate y espolvoree los rellenos restantes.", "Sirva en un plato o paquete en una caja de regalo o bolsa para regalar."], "url": "www_bbc_co_uk_food_recipes_diy_choc_box_18584", "title": "Bombones bricolaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 21", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/diy_choc_box_18584_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800g / 1lb 12oz de azúcar granulada", "400 ml / 14 fl oz crema doble", "450 g / 1 libra de mantequilla, ablandada", "8 huevos grandes de gallinas camperas", "Azúcar en polvo 350g / 12oz", "Harina de auto crianza tamizada 300g / 10½ oz", "75g / 2½oz de almendras en copos", "16 avellanas blanqueadas", "Azúcar granulada 400g / 14oz"], "method": ["Para la crema de caramelo, coloque el azúcar y 100 ml / 3 ½ oz de agua en una olla grande. Lentamente llevar a ebullición a fuego medio, revolviendo hasta que el azúcar se haya disuelto.", "Una vez que ya no quede arenilla, suba el fuego y hierva hasta obtener un caramelo dorado. Quite el fuego y agregue la crema doble y agite rápidamente, luego déjela enfriar y luego deje enfriar hasta que se endurezca.", "Coloque la mantequilla ablandada en el tazón de un mezclador independiente y bata hasta que esté suave y esponjosa. Agregue a la mezcla de caramelo fría una cucharada a la vez, batiendo entre cada adición. Raspe el tazón con regularidad. Enfríe hasta que esté listo para usar.", "Precaliente el horno a 200C / 180C (ventilador) / Gas 6. Marque seis círculos de 20cm / 8in y seis círculos de 15cm / 6in en el pergamino para hornear y coloque en bandejas para hornear.", "Para hacer las capas de esponja, rompa los huevos en un tazón grande y agregue el azúcar. Batir con un mezclador eléctrico de mano hasta que la mezcla sea ligera y espumosa y el batidor deja un rastro cuando se saca de la mezcla.", "Doble ligeramente la harina, poco a poco. Divida la mezcla entre los 12 círculos marcados, extendiendo la mezcla de manera uniforme.", "Hornee los pasteles, de a dos por vez, en el horno precalentado durante aproximadamente 8-10 minutos hasta que estén pálidos dorados y elásticos al tacto. Con un cuchillo afilado, recorte los círculos. Despegue el pergamino y déjelo enfriar en una rejilla de alambre.", "Para hacer las avellanas cubiertas de caramelo y praliné de almendras, extienda las almendras en copos sobre una hoja de pergamino para hornear en una bandeja para hornear.", "Stick palitos de cóctel en cada una de las 16 avellanas.", "Disuelva el azúcar en 8 cucharadas de agua a fuego lento, revuelva constantemente, luego aumente el fuego y hierva el almíbar hasta que tome un color marrón dorado. Deje que se enfríe un poco y luego vierta la mitad sobre las almendras en copos. Dejar de lado para enfriar por completo.", "Sumerja las avellanas en el caramelo caliente retorciendo los palitos de cóctel para que las nueces estén completamente cubiertas de caramelo. Con cuidado, invierta los palitos de cóctel y presiónelos en una naranja o pedazo de espuma y déjelos reposar.", "Tome uno de los círculos de esponja de 15 cm / 6 pulgadas y colóquelo en una hoja de silicio o pergamino para hornear. Vierta el caramelo restante sobre el círculo de esponja.", "Cuando el caramelo en la parte superior de la esponja recién comienza a marcar, marque y luego córtela en ocho porciones con un cuchillo engrasado.", "Coloque los seis círculos de esponjas de 20cm / 8in junto con crema de caramelo. Extienda los lados y cubra con crema de mantequilla.", "Coloque los cinco círculos restantes de 15cm / 6 en esponjas junto con la crema de mantequilla. Extienda crema de mantequilla alrededor de los lados y la parte superior de los pasteles y coloque en la parte superior la pila de pastel de 20 cm / 8 pulgadas para formar un segundo nivel.", "Rompa la almendra garapiñada en trozos pequeños y presione los lados de ambos niveles del pastel.", "Con una cuchara, la crema de mantequilla restante en una manga pastelera con una boquilla de estrella de tamaño mediano. Coloque 16 rosetas de crema de mantequilla alrededor del borde superior de la torta más grande y cubra cada roseta con una avellana recubierta de caramelo.", "Coloca ocho rosetas alrededor de la torta pequeña y coloca una rodaja de pastel con tapa de caramelo en ángulo sobre cada roseta para formar la capa superior."], "url": "www_bbc_co_uk_food_recipes_dobos_torte_82293", "title": "Dobos torte", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 torta grande de dos niveles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dobos_torte_82293_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 300 g / 10½ oz, más extra para enrollar", "175g / 6oz de mantequilla", "1 huevo de gallinas camperas, golpeado", "botón de mantequilla", "1 cucharadita de aceite de oliva", "3 peras de conferencia media, peladas, descuartizadas, sin núcleo, rebanadas gruesas a lo largo", "3 huevos de gallinas camperas, golpeados", "300ml / ½ pinta de crema", "3 hojas de salvia fresca, finamente trituradas", "150g / 5½oz Stilton, corteza eliminada, rota en pequeños pedazos", "Nueces de 40 g / 1½ oz, rotas en trozos pequeños"], "method": ["Para la masa, mezcle la harina y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a migas de pan finas. Agregue el huevo y el pulso hasta que la mezcla se una como masa.", "Divida la masa en ocho porciones y forme bolas. Aplanar una bola de repostería ligeramente y extender sobre una superficie ligeramente enharinada a un grosor de 3 mm / ½ pulgadas. Usa la masa para forrar una lata de tarta individual suelta. Recorta cualquier exceso de masa y pincha la base con un tenedor. Repita con las bolitas de repostería restantes y enfríe en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cubra cada caja para tarta con papel resistente a la grasa y horneando frijoles y hornee en el horno durante 20 minutos. Retire el papel y los frijoles y vuelva al horno por otros 10 minutos o hasta que la masa esté dorada.", "Retire las cajas de tarta, reduzca el horno a 170 C / 325 F / Gas 3.", "Derrita la mantequilla y el aceite en una sartén antiadherente grande. Freír las rodajas de pera durante 1-2 minutos en cada lado, o hasta que estén ligeramente doradas por ambos lados. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Batir los huevos en un recipiente hasta que queden suaves, luego incorporar la crema fresca y la salvia. Sazonar con una buena pizca de sal y mucha pimienta negra recién molida.", "Divide el Stilton entre las fundas de tartaletas. Agregue las rodajas de pera y esparza con las piezas de nuez. Vierta lentamente sobre la mezcla de huevo, completando cada caja agria cuando el líquido haya tenido la oportunidad de asentarse.", "Hornee durante 25-30 minutos o hasta que el relleno esté listo. Retire las tartas del horno y ajústelas durante 15 minutos antes de retirarlas cuidadosamente de las latas de tarta."], "url": "www_bbc_co_uk_food_recipes_dolcelatte_pear_and_73284", "title": "Tartas de Dolcelette, pera y nuez", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de queso Dolcelatte, picado", "2 yemas de huevo de gallinas camperas", "2 cucharadas de berros picados", "3 claras de huevo de gallinas camperas", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal"], "method": ["Precaliente dos bandejas blini a prueba de horno o pequeñas sartenes en el horno a 200C / 400F / Gas 6.", "Coloque el queso, las yemas de huevo y el berro en un bol y mezcle bien.", "En un recipiente aparte, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Doble la mezcla de clara de huevo en la mezcla de queso y sazone con sal y pimienta negra recién molida.", "Retire los moldes del horno, divida la mantequilla entre los moldes y la cuchara en la mezcla de soufflé. Vuelve al horno y hornea por diez minutos, o hasta que se levante y dore.", "Para servir, coloca los moldes en platos."], "url": "www_bbc_co_uk_food_recipes_dolcelatteandwatercr_85113", "title": "Soufflé de Dolcelette y berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120g / 4¼oz de arroz de grano largo, cocido", "250 g / 8¾oz de cordero picado", "1 cucharadita de orégano seco", "1 cebolla pequeña, finamente picada", "3 cucharadas de perejil finamente picado", "3 cucharadas de apio finamente picado", "sal y pimienta negra recién molida", "1 cucharada de puré de tomate", "250g / 8¾oz de hojas de vid preservadas y escurridas", "2 tomates, en rodajas", "2 ajos, clavo de olor en rodajas", "1 limón, solo jugo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Primero, haz el relleno. En un tazón, combine el arroz, la carne, la cebolla, las hierbas, el apio, la sal y la pimienta. Doble el puré de tomate.", "Coloque una hoja de vid en un plato, con la vena hacia arriba. Tome una cucharadita colmada del relleno y colóquelo en el centro de la hoja cerca del borde del tallo. Doble el extremo del tallo sobre el relleno, doble ambos lados hacia el centro y enrolle como un cigarro pequeño. No ruedes demasiado fuerte ya que el arroz se expandirá.", "Alinee la parte inferior de un plato grande para horno con una capa de rodajas de tomate o hojas de parra. Esto evitará que las hojas rellenas se peguen al fondo y se quemen.", "Empaque las hojas rellenas en capas en la parte superior, empujando pequeños trozos de ajo entre ellos. Espolvorea con jugo de limón y agrega alrededor de 150ml / 5¼fl oz de agua fría. Cubra con papel de aluminio engrasado.", "Coloque las hojas en el horno por 45 minutos, agregando agua extra si es necesario. Servir."], "url": "www_bbc_co_uk_food_recipes_dolmades_72399", "title": "Dolmades", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dolmades_72399_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 kg / 2lb 4oz filete de ternera cocido, cortado en trozos de 2.5cm / 1in", "2 cebollas", "3 tallos de apio", "4 zanahorias grandes", "1 litro / 1¾pint stock de carne de vacuno (de cubos en existencia)", "Papas 900g / 2lb", "25 g / 1oz de mantequilla sin sal", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Primero cocine la carne colocando una cacerola grande a fuego alto, agregue 1 cucharada de aceite y dore las piezas de carne. Haga esto en lotes para que la sartén no esté demasiado llena. Retire la carne de la cacerola y déjela a un lado en un plato. No limpie la sartén, ya que la necesitará para freír las verduras.", "Mientras la carne se fríe, pele y corte las cebollas y las zanahorias y corte el apio.", "Caliente el aceite restante en la misma cacerola y fría la cebolla, el apio y la zanahoria durante 4-5 minutos o hasta que las cebollas se ablanden. Raspe cualquier trozo cocido en el fondo de la sartén. Eso agregará sabor al estofado. Condimentar con sal y pimienta.", "Mezcle la carne con las verduras, luego retire la sartén del fuego. Incline la carne y las verduras en un plato grande a prueba de horno y vierta el caldo por encima.", "Pele y corte las papas en rodajas gruesas de ½ cm / ¼ de grosor y coloque encima de la carne. Coloca la mantequilla sobre la parte superior y cúbrela con papel de aluminio. Hornee durante 1 hora, luego retire la lámina y hornee por otros 15 minutos hasta que las papas estén crujientes y doradas. Servir en cuencos hondos"], "url": "www_bbc_co_uk_food_recipes_donals_irish_beef_stew_85494", "title": "Guiso de ternera irlandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/donals_irish_beef_stew_85494_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2½oz de mantequilla sin sal", "Galletas digestivas 250 g / 9 oz", "2 cucharadas de azúcar moreno claro", "800 g / 1 libra de queso crema de 12 onzas", "1 limón, ralladura solamente", "1 vaina de vainilla, dividida por la mitad a lo largo y sin semillas", "800ml / 1⅓ pinta de frigorífico doble crema fría", "75g / 2½ oz de azúcar glas", "6 higos frescos, cortados a la mitad", "4 peras maduras, sin corazón y cortadas en cuartos a lo largo", "2-4 cucharadas de jarabe de arce", "250ml / 9fl oz ron oscuro o jugo de manzana", "1 vaina de vainilla, dividida por la mitad longitudinalmente", "1 palito de canela, partido por la mitad", "1 ramita de romero fresco, dejado entero", "1 naranja, solo ralladura", "Avellanas tostadas de 25 g / 1 oz"], "method": ["Para la tarta de queso, ponga la mantequilla en una cacerola grande a fuego lento y deje que se derrita.", "Mientras tanto, coloque los bizcochos en una bolsa de plástico para alimentos, séllelos y triture los bizcochos con un rodillo, hasta que tenga migas finas. (Alternativamente, póngalas en un procesador de alimentos). Incline los bizcochos machacados y el azúcar en la mantequilla derretida. Mezclar todo junto.", "Empuje la mezcla en la base de una lata profunda de 23cm / 9 pulg. Realmente empaca apretado presionándolo hacia abajo con tus manos o con el dorso de una cuchara. Colóquelo en la nevera para reafirmarlo mientras realiza la cobertura.", "En un tazón grande, mezcle el queso crema, la ralladura de limón y las semillas de vainilla hasta que quede suave. Vierta la crema doble en un recipiente aparte y tamice el azúcar glasé. Batir hasta que tenga casi la misma consistencia que el queso crema, solo un poco más suelto.", "Incline la crema en la mezcla de queso crema y mezcle todo con cuidado. Retire la base del refrigerador e incline la mezcla sobre la base. Alisa la parte superior con la parte posterior de una cuchara. Cubra con una película adhesiva y colóquela en el congelador durante aproximadamente 30 minutos, hasta que se haya fraguado. O coloque en la nevera durante 4 horas.", "Para las peras, los higos y las avellanas, precaliente el horno a 160 C / 140 C Fan / Gas 3 y forre una bandeja de hornear con papel de hornear.", "Coloque la fruta picada en la bandeja y rocíe con sirope de arce, al gusto. Rocíe con ron o jugo de manzana y cubra con la vaina de vainilla, la ramita de canela, el romero y la ralladura de naranja. Mezcle hasta que esté combinado y cubra con papel de aluminio. Asar durante 30 minutos, luego retire la lámina y cocine durante 20 minutos más, rociando la fruta con los jugos. Retire el romero antes de servir.", "Para servir, retire la tarta de queso del congelador 10 minutos antes de servir. Corte en rodajas y sirva la fruta tostada y las avellanas al lado."], "url": "www_bbc_co_uk_food_recipes_doorstep_vanilla_66658", "title": "Doorstep tarta de queso de vainilla con ron peras asadas, higos y avellanas tostadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2½oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "2 chalotes, pelados y dejados enteros", "100 g / 3½ oz de champiñones", "1 diente de ajo, finamente picado", "pequeños puerros pequeños, cortados", "2 cucharadas de aceite de oliva o de colza", "90g / 3¼oz de mantequilla sin sal, más extra para engrasar", "Harina normal de 40 g / 1½ oz, más extra para quitar el polvo", "150 g / 5½ oz de setas", "350 ml / 12 fl oz de leche", "225g / 8oz de queso cheddar rallado", "1 cucharadita de mostaza Dijon", "3 huevos de gallinas camperas, separados", "Crema doble 250ml / 9fl oz", "2 ramitas de tomillo fresco, solo hojas", "sal y pimienta negra recién molida"], "method": ["Para los champiñones y los chalotes, precaliente el horno a 220C / 200C Fan / Gas 7.", "Caliente 50 g / 1¾ oz de la mantequilla y el aceite en una sartén pequeña y resistente al horno a fuego medio. Agregue las chalotas, luego transfiera la sartén al horno y tueste las chalotas por 15 minutos o hasta que estén tiernas.", "Retire los chalotes asados ​​de la sartén y reservar. Una vez que esté lo suficientemente frío como para manipularlo, separe los chalotes en 'pétalos' pelando cada capa completa.", "Coloque la misma sartén a fuego medio, luego agregue la mantequilla restante, los champiñones y el ajo y fría por 3-4 minutos, o hasta que se ablanden y empiecen a dorarse.", "Para los puerros tiernos, pula los puerros tiernos en una olla grande de agua hirviendo con sal durante 1-2 minutos. Escurrir y refrescar en un tazón de agua helada.", "Caliente una sartén a fuego alto. Frota los puerros por todos lados con un poco de aceite. Agregue los puerros a la sartén de la plancha y déjelos asar por 2-3 minutos en todos los lados, o hasta que aparezcan las marcas doradas.", "Mantenga todas las verduras calientes hasta que estén listas para servir.", "Para los soufflés, precaliente el horno a 180 ° C / 160 ° Fan / Gas 4. Engrase la base y los lados de 4 moldes con un poco de mantequilla, luego espolvoréelo con harina y sacuda el exceso. Coloque los moldes en una bandeja de asar profunda.", "Caliente 50 g / 1¾ oz de la mantequilla en una sartén a fuego medio. Agregue los champiñones y fríalos durante 1-2 minutos, o hasta que estén blandos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Derretir la mantequilla restante en una cacerola grande a fuego medio. Batir la harina para formar una pasta espesa (conocida como roux). Cocine el roux a fuego lento durante 2-3 minutos más, revolviendo con una cuchara de madera.", "Poco a poco bata la leche, poco a poco, batiendo constantemente para evitar que se formen grumos. Una vez que toda la leche haya sido incorporada en el roux, reduzca el calor a su nivel más bajo y continúe cocinando por otros 2-3 minutos, o hasta que la mezcla sea lo suficientemente espesa para cubrir la parte posterior de la cuchara.", "Agregue 125 g / 4½ oz del queso, así como la mostaza y los champiñones cocidos. Batir las yemas de huevo y sazonar con sal y pimienta, al gusto.", "En un recipiente limpio y seco, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Doble las claras de huevo cuidadosamente en la mezcla de soufflé.", "Divida la mezcla por igual entre los moldes preparados. Vierta suficiente agua hirviendo en la bandeja de asar para alcanzar la mitad de los lados de los moldes. Con cuidado, transfiera la bandeja de asar al horno y hornee los suflés durante 15-20 minutos, o hasta que se hayan levantado y estén dorados uniformemente.", "Retire los soufflés de la bandeja de tostado y déjelos a un lado en una superficie resistente al calor durante 5 minutos.", "Precalentar la parrilla a su configuración más alta.", "Pase un cuchillo de hoja redonda alrededor de los bordes interiores de los moldes, luego convierta cada soufflé en un plato individual a prueba de horno.", "Vierta un cuarto de la crema en cada plato, cubriendo la parte superior de cada soufflé. Espolvorea sobre el tomillo y el queso cheddar restante, luego cocina los soufflés durante 3-4 minutos, o hasta que el queso burbujee y se dore.", "Para servir, coloca los platos soufflé en platos para servir. Coloque los champiñones, los chalotes y los puerros pequeños al lado."], "url": "www_bbc_co_uk_food_recipes_double-baked_mushroom_97325", "title": "Soufflé de setas doblemente horneado con champiñones, chalotes y puerros tiernos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de harina de pan blanco, más extra para quitar el polvo", "225g / 8oz de harina integral fuerte", "1 cucharadita de sal", "1 x 7g bolsita de levadura seca de acción rápida", "1 cucharada de miel clara", "300ml / 11fl oz de agua tibia", "aceite vegetal o aceite en aerosol, para engrasar", "un poco de leche, para cepillar"], "method": ["Polvo una bandeja de horno mediana con harina.", "Tamiza las harinas y la sal en un tazón grande. Reserve una cucharada de grano: los trozos marrones que son demasiado grandes para pasar por el tamiz. Revuelva el resto a través de la mezcla de harina. Agregue la levadura, luego haga un gran agujero en el centro y vierta la miel y la mayor parte del agua. Mezcle bien para formar una masa suave, trabajando suavemente con sus manos si es necesario. Si la masa se siente un poco rígida, agregue más agua.", "Forme la mezcla en forma de bola y colóquela en la bandeja para hornear preparada. Asegúrese de que la parte superior esté lisa y sin arrugas. Cubra la masa sin apretar con film transparente aceitado, asegurándose de que sea hermética, y deje que se levante en un lugar cálido durante una buena hora, o hasta que casi haya duplicado su tamaño.", "Precalienta el horno a 200C / 400F / Gas 6. Quita la película adhesiva de la masa y haz unas cuantas barras en la parte superior con un cuchillo afilado. Utilizo una cuchilla dentada afilada y la sierra suavemente. Cepille el pan con leche, espolvoree con el grano reservado y luego colóquelo en el horno.", "Ponga unos 10 cubos de hielo en el fondo del horno; producirán vapor, lo que evitará que la corteza se endurezca demasiado rápido. (Una costra endurecida rápidamente evita que el pan se levante bien.) Hornee el pan durante 30-40 minutos, o hasta que se haya levantado, suena hueco cuando se golpea debajo y sale fácilmente de la bandeja de hornear. Retire del horno y deje enfriar en la bandeja.", "Sirva fresco del horno con mucha mantequilla. Estos panes no se mantienen bien. Sin embargo, si todo el lote no desaparece de una vez, corte el resto y colóquelo en el congelador para comerlo como pan tostado."], "url": "www_bbc_co_uk_food_recipes_doris_grant_loaf_16985", "title": "Doris Grant Loaf", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan pequeño", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/doris_grant_loaf_16985_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Lomo de atún 150 g / 5½ oz", "dash aceite de oliva", "1 cucharadita de granos de pimienta, aplastados", "½ cucharadita de semillas de cilantro, aplastadas", "Fideos fideos de arroz moreno de 150g / 5½oz", "4 cebolletas, cortadas a la mitad", "dash aceite de oliva", "Brócoli 150 g / 5½ oz, cortado en florecillas", "lanzar aceite de sésamo", "pizca de cilantro molido", "1-2 cucharadas de salsa de soja", "2 cucharadas de ketchup de tomate", "2 cucharadas de salsa de soja", "½ limón, solo jugo", "dash aceite de oliva", "sal y pimienta negra recién molida"], "method": ["En primer lugar, frotar el lomo de atún en un poco de aceite de oliva, luego rodar en los granos de pimienta machacados y semillas de cilantro.", "Rocíe el atún con un poco más de aceite de oliva, caliente una sartén hasta que esté caliente y agregue el atún. Cocine por dos minutos en cada lado y retire del fuego. Apartar y mantener caliente.", "Para los fideos, coloque los fideos de arroz en un recipiente con agua fría y déjelos en remojo durante cinco minutos o hasta que se ablanden. Escurrir bien.", "Frote las cebollas de primavera en aceite de oliva, caliente una sartén hasta que se caliente y agregue las cebolletas. Planche durante 3-4 minutos y reserve.", "Mientras tanto, vierta cuidadosamente las flores de brócoli en una sartén con agua hirviendo suavemente y deje hervir durante tres minutos. Escurrir bien.", "Calentar un chorrito de aceite de oliva en un wok, agregar los brotes de brócoli blanqueados y sofreír durante un minuto. Agregue las cebollas de primavera a la plancha, el aceite de sésamo, el cilantro molido y la salsa de soja y cocínelas durante un minuto más.", "Agregue los fideos empapados y escurridos al wok y mezcle.", "Para la vinagreta de salsa de tomate y soja, mezcle todos los ingredientes de vinagreta en un tazón pequeño.", "Para servir, amontone los fideos y las verduras a la parrilla en un plato para servir, cubra con el atún y rocíe con vinagreta."], "url": "www_bbc_co_uk_food_recipes_dgheth_86895", "title": "Atún a la pimienta y cilantro con fideos y vinagreta de tomate y soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla pequeña, pelada, cortada en cuñas", "275 ml / 10 fl oz de leche entera, más extra para rellenar si es necesario", "1 hoja de laurel", "40 g / 1½ oz de mantequilla, más extra para engrasar", "Harina normal de 40 g / 1½ oz", "100 g / 3½ oz de queso cheddar maduro, rallado grueso", "1 cucharadita de mostaza inglesa (o 2 cucharaditas de mostaza Dijon)", "nuez moscada recién rallada, al gusto", "sal y pimienta negra recién molida", "3 huevos de gallinas camperas, separados", "1 cucharada colmada de cebollines picados, más extra para decorar", "50g gruyere o cheddar maduro, finamente rallado", "6 cucharadas de crema doble"], "method": ["Para los soufflés, precaliente el horno a 200C / 400F / Gas 6. Manteque generosamente moldes para horno 6x150ml / 5fl oz y forre las bases con un disco de pergamino para hornear. Coloque en una bandeja para hornear.", "Pon la cebolla en una olla con leche y laurel. Llevar a fuego lento a fuego lento y cocinar durante 5 minutos para infundir los sabores. Mire cuidadosamente para asegurarse de que la sartén no hierva. Retire del fuego y deje de lado por un par de minutos.", "Derrita la mantequilla en una cacerola mediana antiadherente a fuego lento. Retire del fuego y agregue la harina con una cuchara de madera. Una vez combinados, vuelva al fuego y cocine por un minuto, revolviendo mientras se cocina y comienza a burbujear. Retire del fuego.", "Cuele la leche a través de un colador en una jarra y deseche la cebolla y la hoja de laurel. Necesitará alrededor de 250 ml / 9 fl oz de leche infundida, por lo que deseche cualquier exceso o recargue según sea necesario con leche fresca.", "Poco a poco revuelva la leche en la harina y la pasta de mantequilla, luego vuelva al fuego y cocine durante 2 minutos, hasta que hierva, revolviendo constantemente. La salsa será suave y espesa. Agregue el Cheddar, la mostaza y una ralladura de nuez moscada y continúe cocinando durante 1-2 minutos más hasta que el queso se derrita.", "Agregue el cebollín y sazone al gusto. El condimento puede ser bastante fuerte en este punto, ya que la mezcla se rellenará con claras de huevo más tarde. Transfiera la salsa de queso a un recipiente resistente al calor y déjela reposar durante 5 minutos.", "Una vez que la mezcla se haya enfriado, bata las yemas de huevo de a una por vez hasta que estén bien mezcladas.", "Batir las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor. Doble una quinta parte de las claras de huevo en la mezcla de queso con una cuchara de metal grande (esto afloja la mezcla y facilita el plegado de las claras de huevo restantes). A continuación, doble suavemente las claras de huevo restantes para conservar el volumen que ha creado.", "Coloque la mezcla de soufflé en los moldes hasta que casi llegue a la parte superior. Hornee en el centro del horno durante 15 a 20 minutos hasta que esté muy bien levantado y dorado en la parte superior. (No abra la puerta del horno durante los primeros 10 minutos de cocción). Una vez cocinado, retire la bandeja del horno y deje que los soufflés se enfríen en sus moldes.", "Cuando los soufflés estén fríos, forre una bandeja para hornear con pergamino para hornear y deslice un cuchillo por el borde de cada molde. Con cuidado, coloque los soufflés en su mano. retire el disco de papel para hornear de la base. Coloque la bandeja boca abajo. Los soufflés ahora pueden cubrirse con película adhesiva y refrigerarse por hasta 24 horas antes de ser horneados de nuevo.", "Para la segunda cocción, precaliente el horno a 200C / 400F / Gas 6. Quince minutos antes de servir, retire la película adhesiva de los soufflés y espolvoree con el gruyere rallado o el cheddar. Ponga una cucharada de crema doble sobre cada soufflé, permitiendo que se escurra por los lados. Hornee durante 10 minutos hasta que los soufflés estén calientes y la cubierta de queso se haya derretido. Servir inmediatamente, espolvoreado con cebollino extra si se usa."], "url": "www_bbc_co_uk_food_recipes_double_baked_cheese_94727", "title": "Soufflés dobles de queso al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/double_baked_cheese_94727_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["70g / 2⅓oz de mantequilla sin sal, ablandada", "70g / 2⅓oz de azúcar glas", "2 claras de huevo de gallinas camperas", "Harina simple de 40 g / 1½ oz, tamizada", "40 g / 1½ oz de cacao en polvo, tamizado", "2 claras de huevo de gallinas camperas", "10 g / oz de azúcar en polvo", "60 g / 2¼ oz de almendras molidas", "60g / 2¼ oz de azúcar glas", "2 huevos de gallinas camperas", "20g / ¾oz de harina natural, tamizada", "20g / ¾oz de mantequilla sin sal, derretida", "150 g / 5% C2% BDoz% 20plain% 20chocolate% 20 (36%% 20cocoa% 20solids),% 20chopped", "botón de mantequilla", "2 huevos de gallinas camperas, separados", "1 cucharada de brandy (opcional)", "100ml / 3½ fl oz crema doble", "300 g / 10½ oz de chocolate blanco, picado", "100ml / 3½ fl oz crema doble", "1 huevo blanco de corral", "100 g / 3½ oz de bayas frescas (frambuesas y arándanos funcionan bien)", "azúcar en polvo, para quitar el polvo"], "method": ["Engrase y forme una lata de rollo suizo de 33x23 cm / 13x9 in con papel para hornear. Corte una hoja de silicona para hornear para que se ajuste a la base de la lata de rollo suizo. Alinee una bandeja para hornear con un pergamino para hornear y coloque la lámina de silicona encima.", "Para la pasta decorativa, unte la mantequilla y el azúcar glas juntos hasta que estén suaves y esponjosos. Poco a poco agregue las claras de huevo, batiendo continuamente. Doble la harina y el cacao en polvo hasta que se combinen.", "Extienda la pasta fina y uniformemente sobre la estera de silicona con una espátula. Arrastre un peine de pastelería en diagonal a través de la pasta para formar un patrón de rayas, raspando el exceso de mezcla después de cada arrastre. Coloque la pasta en el congelador por 15 minutos.", "Para la esponja joconde, precaliente el horno a 220C / 200C (ventilador) / Gas 7.", "Batir las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar en polvo, una cucharadita a la vez, batiendo entre cada adición para hacer un merengue brillante. Cubra con film transparente y reserve.", "Incline las almendras molidas y el azúcar glas en el tazón de una batidora independiente y agregue los huevos enteros. Batir durante 3-5 minutos, o hasta que duplique el volumen. Doble la harina y, a continuación, doble suavemente el merengue en tres lotes separados. Vierta la mantequilla derretida por el costado del tazón y doble hasta que se incorpore.", "Retire la lámina de silicona con la pasta decorativa del congelador y colóquela en la base de la lata de rollo suizo forrado.", "Incline la mezcla de esponja joconde sobre la pasta a rayas y nivele la superficie con una espátula. Hornee durante 5-7 minutos, o hasta que estén pálidos, dorados y elásticos al tacto.", "Coloque una hoja de pergamino para hornear sobre una rejilla para enfriar y coloque la torta sobre ella. Retire el pergamino para hornear y la lámina de silicona de la base del pastel y deje que se enfríe por completo.", "Alinee los lados de 6 x 6.5cm / 2½ en los anillos de los cocineros con el pergamino para hornear. Corta una plantilla rectangular que mide 17x5cm / 6½x2in, de un pedazo de papel pergamino.", "Cuando la esponja se haya enfriado, recorte los bordes y corte seis rectángulos de esponja usando la plantilla. Envuelva las tiras de la torta dentro de los anillos de la torta, con el lado rayado hacia afuera. Una vez envueltos dentro de los anillos, empuja suavemente y presiona los extremos para unirlos para formar una torta sin costuras. Quieres que la joconde se ajuste muy apretada a los lados de los anillos de la torta.", "Con un pequeño cortador redondo de 4 cm / 1½ pulgadas, corte pequeños círculos de los bordes de los pasteles y empújelos en la base de los anillos para pasteles.", "Para la mousse de chocolate negro, coloque el chocolate en un recipiente colocado sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua). Derrita lentamente y no permita que el chocolate se caliente demasiado.", "Agregue la mantequilla y mezcle hasta que se combinen. Agregue las yemas de huevo y el brandy y deje enfriar un poco.", "En un recipiente, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Doble en la mezcla de chocolate hasta que esté completamente incorporado.", "Batir la crema hasta que se formen picos suaves cuando se quite la batidora. Incorpora la mezcla de chocolate y clara de huevo.", "Con una cuchara, coloca la mousse en una manga pastelera desechable y pásalos por los anillos forrados, hasta que la espuma esté a tres cuartas partes de la esponja. Enfriarlos en el congelador mientras preparas la mousse de chocolate blanco.", "Para la mousse de chocolate blanco, coloque el chocolate en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Derrita muy suavemente, pero no permita que el chocolate se caliente demasiado.", "En un recipiente, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Dobla en la mezcla de chocolate blanco.", "En un recipiente, batir la crema hasta que se formen picos suaves cuando se quite el batidor y doblar en la mezcla de chocolate blanco.", "Con una cuchara, coloque la mousse de chocolate blanco en una manga pastelera desechable y pinte en la parte superior de la mousse de chocolate hasta que llegue a la parte superior de los anillos de la torta. Enfríe en el refrigerador hasta que esté listo.", "Una vez que esté listo, apague los anillos de la torta y colóquelos en los platos para servir. Cubra con las frambuesas y los arándanos y el polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_double_chocolate_mousse_23581", "title": "Postres dobles de mousse de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 6 postres", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225ml / 8 fl oz de leche", "½ cebolla", "12 granos de pimienta negra", "25g / 1oz de mantequilla, más extra para engrasar", "Harina normal de 25g / 1oz, más extra para quitar el polvo", "2 huevos de gallinas camperas, separados", "1 cucharada de hojas frescas de tomillo", "Queso de cabra semiduro 100g / 3½oz, rallado", "sal y pimienta negra recién molida", "berros, para servir"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Coloque la leche, la cebolla y los granos de pimienta en una sartén a fuego medio y llévelos al punto de escaldadura (pero no los hierva). Cuele la leche en un recipiente y deseche la cebolla y los granos de pimienta.", "Mientras tanto, derrita la mantequilla en una sartén limpia a fuego medio. Agregue la harina y mezcle bien durante un minuto para crear una pasta.", "Poco a poco agregue la leche caliente, poco a poco, esperando a que la harina burbujee antes de agregar más leche y revolver entre las adiciones. Sigue agregando para crear una salsa suave.", "Retire la sartén del fuego, luego agregue las yemas de huevo y el tomillo y bata para combinar.", "Agregue 75 g / 2½ oz de queso de cabra, sazone con sal y pimienta negra recién molida y revuelva bien.", "Batir las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Agregue una cucharada pequeña de claras de huevo a la salsa de queso y mezcle bien.", "Poco a poco agregue cucharadas generosas de las claras de huevo a la salsa de queso, doblando suavemente los blancos en la salsa, hasta que los blancos se combinan por completo con la salsa.", "Unte con mantequilla y harina cuatro moldes de 150 g / 5 oz y divida la mezcla de queso entre ellos.", "Si está cocinando para servir inmediatamente, espolvoree los soufflés con el queso de cabra restante; si planea almacenar y recalentar, reserve el queso para más adelante.", "Transfiera los suflés a un plato resistente al horno y agregue suficiente agua al plato para llegar un tercio del camino hasta los moldes.", "Cuidadosamente coloque en el horno para hornear durante 15-18 minutos, o hasta que se haya levantado.", "Los soufflés pueden enfriarse y almacenarse en la nevera, o incluso congelarse, para cocinarlos más tarde. Si está recalentando, descongelando o retirando del refrigerador, cubra con el queso restante y colóquelo en un horno precalentado a 180 ° C / 365 ° F / Gas 4 y hornee durante 8-10 minutos, o hasta que se caliente por completo.", "Para servir, coloque los suflés en platos y coloque un puñado de berros al costado."], "url": "www_bbc_co_uk_food_recipes_doublebakedgoatschee_86260", "title": "Soufflés de queso de cabra doblemente horneados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de levadura", "4 cucharadas de azúcar en polvo", "150ml / 5¼fl de onza de leche, calentada", "Harina normal de 225g / 8oz, más extra para quitar el polvo", "¼ cucharadita de sal", "50g / 2oz de mantequilla, derretida", "1 huevo de gallinas camperas, golpeado", "300ml / 10½fl oz de aceite vegetal, para freír", "mermelada de su elección"], "method": ["Mezcle la levadura con media cucharadita de azúcar y dos cucharadas de leche tibia. Coloque en un lugar cálido para descansar durante 15 minutos o hasta que esté espumoso.", "Tamiza la harina y la sal en un tazón grande. Agregue una cucharada de azúcar.", "Haga un pozo en la harina y vierta la mezcla de levadura, el resto de la leche, la mantequilla derretida y el huevo. Mezcle para hacer una masa y luego amasar, cubra el recipiente y déjelo reposar durante 45 minutos, o hasta que la masa se haya duplicado.", "En una superficie de trabajo enharinada, amase la masa durante cinco minutos, luego divídala en 12 bolas y colóquela en un lugar cálido durante 30 minutos, o hasta que dupliquen su tamaño.", "Calienta el aceite en una sartén honda hasta que alcance los 190 ° C / 375 ° F, o un cubo de pan caído en chispas y se vuelve dorado en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Baje suavemente las bolas de masa de una en una en el aceite caliente, en lotes de dos o tres, y fría durante 3-5 minutos o hasta que estén doradas, y luego voltee con cuidado. Retire del aceite caliente con una espumadera y escurra sobre papel de cocina.", "Ruede las donas calientes en el azúcar restante. Haga una pequeña ranura en la rosquilla con la punta de un cuchillo y llénela con una cucharadita de mermelada. Servir."], "url": "www_bbc_co_uk_food_recipes_doughnuts_89027", "title": "Donuts", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/doughnuts_89027_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10½ fl oz crema doble", "1 ramita de pino abeto de Douglas", "6 yemas de huevo", "50g / 1¾oz de azúcar", "300ml / 10½fl oz de leche entera", "4 naranjas de sangre, cáscara y jugo", "110g / 4oz de mantequilla", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas, golpeados", "50 g / 1¾oz de mantequilla sin sal", "85g / 3oz de coco fresco o desecado", "85g / 3oz de azúcar glas, cernida", "Harina normal de 25g / 1oz", "2 claras de huevo"], "method": ["Para la crema pastelera, en una sartén, hierva la crema doble y la leche.", "En un recipiente, mezcle las yemas de huevo y el azúcar impalpable. Vierta la crema caliente y la leche en los huevos, batiendo sobre la marcha.", "Regrese a la sartén y colóquelo a fuego lento. Cocine suavemente la crema pastelera, revolviendo todo el tiempo, hasta que esté lo suficientemente grueso como para cubrir la parte posterior de una cuchara, o alcanza 82C / 180F en un termómetro de cocina. Agregue la ramita de abeto y vuelva a hervir. Retira la crema del fuego y deja que el abeto se infunda durante una hora mientras la natilla se enfría.", "Pasar a través de un tamiz fino en un recipiente. Cubra la superficie con film transparente para evitar que se forme la piel y deje que se enfríe en la nevera.", "Para la cuajada de naranja de sangre, coloque la ralladura de naranja, el jugo, la mantequilla y el azúcar en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento. (No permita que el recipiente toque el agua).", "Batir de vez en cuando hasta que el azúcar esté completamente disuelto, luego batir en los huevos y batir hasta que espese y se cueza a través.", "Retirar del fuego y dejar enfriar por completo.", "Para las Tuilles de coco, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una bandeja para hornear con una estera de silicona o pergamino para hornear.", "Derrita la mantequilla, luego déjelo hasta que esté frío, pero aún moqueando.", "Mezcle el coco en un procesador de alimentos hasta que esté finamente molido, pero no en polvo. Agregue el azúcar glas y la harina, mezcle nuevamente, luego agregue las claras de huevo, seguido de la mantequilla enfriada y mezcle hasta que tenga una pasta suave y ligeramente líquida.", "Coloque una cucharadita de la mezcla sobre la silicona y extiéndala con el reverso de una cucharada de postre en un fino círculo de 7cm / 3 pulgadas. Repita para llenar la bandeja con círculos.", "Hornee por siete minutos o hasta que los bordes estén dorados. Retire y raspe en una rejilla para enfriar. Para darle forma, presione cada uno sobre un rodillo mientras se enfría, para hacer una tuille curva.", "Para servir, ponga un poco de la cuajada de naranja en platos para servir. Batir la natilla para espumarla y colocarla encima de la cuajada. Cubra con coco Tuilles."], "url": "www_bbc_co_uk_food_recipes_douglas_fir_pine_custard_60315", "title": "Flan de pino de abeto de Douglas con cuajada de naranja de sangre y tuile de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]