[{"isVegetarian": false, "title": "Tuscan-style marinated chicken breasts", "url": "www_bbc_co_uk_food_recipes_tuscanstylemarinated_73191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts ", "1.5 litres/52¾fl oz of white wine ", "250ml/8¾fl oz cider vinegar ", "1.5 litres/52¾fl oz of water ", "4 tbsp sultanas ", "2 tbsp  pine kernels ", "1 lemon, zest only, cut into strips ", "1 tsp salt ", "½ litre/17½fl oz olive oil ", "10 tbsp balsamic vinegar ", "4 rosemary branches, roughly chopped ", "5 garlic cloves, roughly chopped ", "1 red chilli, roughly chopped ", "green salad"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the marinade, place all the marinade ingredients in a large bowl and set aside.  ", "Place the remaining ingredients in a large saucepan and bring to the boil.  ", "Reduce and simmer for 15 minutes.  ", "Once simmered, remove the chicken breasts, the lemon zest, the sultanas and the pine kernels and while still hot, add them to the marinade.  ", "Leave in a fridge to marinate for 12 hours, then remove the chicken breasts, lemon, sultanas and pine kernels.", "Slice the chicken and serve with a tossed green salad which has been garnished with the lemon, sultanas and pine kernels."]}, {"isVegetarian": false, "title": "Tuscan vegetable soup", "url": "www_bbc_co_uk_food_recipes_tuscanvegetablesoup_82390", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 tbsp extra virgin olive oil", "4 celery sticks, finely chopped", "2 carrots, finely chopped", "1 medium onion, finely chopped", "2 cloves garlic, crushed", "1 sprig rosemary", "4 bay leaves", "salt and freshly ground black pepper", "200g/7oz carrots, chopped", "200g/7oz celery, chopped", "200g/7oz potatoes, chopped", "200g/7oz courgettes, chopped", "small piece of rind from a ham (optional)", "1.5 litres/2¼ pints stock (vegetable or chicken stock are both fine) ", "2 tomatoes, peeled and chopped, with the juice and seeds squeezed out"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soffritto, heat the olive oil in a large saucepan and gently fry the celery, carrot, onion, garlic, rosemary and bay leaves until golden, about 15 minutes.", "Remove the rosemary sprig and bay leaves and season with salt and freshly ground black pepper. ", "To make the soup, add the carrots, celery, potatoes and courgettes and cook on a low heat for 10-15 minutes, stirring continuously but gently. Add the ham rind at this stage if you are including it (remember to remove it before serving the soup). Season with salt and freshly ground black pepper to taste.", "Add the stock and cook over a low heat for another 20-30 minutes. Add the tomatoes and continue to cook for another 10 minutes. Serve."]}, {"isVegetarian": true, "title": "Twice-baked blue cheese and walnut soufflés", "url": "www_bbc_co_uk_food_recipes_twice-baked_blue_cheese_40326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small onion", "8 cloves", "1 bay leaf", "8 peppercorns", "300ml/10fl oz milk", "40g/1½oz butter, plus extra for greasing", "40g/1½oz plain flour", "50g/1¾oz Stilton, crumbled ", "75g/2½oz cheddar, finely grated", "3 free-range eggs, separated", "grating fresh nutmeg", "1 tsp fresh thyme leaves", "30g/1oz walnut halves, roughly chopped", "120ml/4fl oz double cream"], "serves": "Makes 8 soufflés", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Lightly butter eight ramekin dishes and line the bases with a circle of baking paper. ", "Peel the onion, leaving the base intact. Press the cloves into the onion, then put it in a small heavy-bottomed saucepan. Add the bay leaf and peppercorns, then pour in the milk. Heat gently until it comes to the boil, then remove from the heat and leave to stand for at least 10 minutes. Strain the flavourings from the milk and discard them.  ", "Melt the butter in a heavy-bottomed frying pan over a medium heat. Stir in the flour and continue cooking, stirring all the time, for 1–2 minutes. Slowly pour in the warm milk and beat well using a whisk until it comes to a simmer and you have a thick sauce. ", "Crumble in the Stilton and add 50g/1¾oz of the grated cheddar, then continue to stir over the heat until you have a smooth sauce. Remove from the heat and beat in the egg yolks, nutmeg and thyme. Stir in the walnuts. ", "In a clean glass bowl, whisk the egg whites until stiff peaks form. Fold a tablespoon of the beaten whites into the soufflé mixture. Add the rest of the whites and fold in well. ", "Spoon the mixture into the prepared ramekins to just below the top. Bake for 15–20 minutes, or until risen and cooked. Leave to cool, then run a knife around the sides to loosen them. Line a baking tray with baking paper. Turn out the soufflés on to the prepared baking sheet, so they are bottom-side-up. If refrigerating and eating the following day, cover with cling film. ", "To finish the soufflés, preheat the oven to 200C/180C Fan/Gas 6. Sprinkle the remaining cheese over the soufflés and spoon a tablespoon of double cream over each one. Bake for 10 minutes, or until golden-brown. Serve."]}, {"isVegetarian": false, "title": "Twice-cooked braised horseradish rib-eye steaks with crispy onions", "url": "www_bbc_co_uk_food_recipes_twice-cooked_braised_66810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz rib-eye steaks (ideally all cut from the same piece of rib-eye by your butcher)", "1 x 750ml bottle red wine", "1 sprig fresh thyme", "2 tbsp rapeseed oil", "2 carrots, finely chopped", "2 celery sticks, finely chopped", "1 large onion, finely chopped", "3 garlic cloves, chopped", "6 ripe tomatoes, chopped", "1 tbsp Worcestershire sauce", "1 litre/1¾ pints chicken stock", "2 tbsp creamed horseradish", "50g/1¾oz butter", "2 tbsp chopped fresh parsley", "vegetable oil, for deep-fat frying", "100g/3½oz plain flour", "1 tsp smoked paprika", "150ml/¼ pint full-fat milk", "2 onions, cut into 0.5cm/¼in-thick slices", "500g/1lb 2oz new potatoes, boiled until tender", "50g/1¾oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["The day before you want to serve the steaks, place them into a large mixing bowl, pour over the wine and add the thyme. Cover the bowl and chill in the fridge overnight. ", "When the steaks have marinated, preheat the oven to 160C/140C Fan/Gas 3.", "Heat the oil in a flameproof casserole over a medium heat. Add the carrots, celery and onion and fry for 6-8 minutes, or until softened and golden-brown.", "Add the garlic, chopped tomatoes and Worcestershire sauce and stir well to combine.", "Lay the marinated steaks on top of the vegetables and season, to taste, with salt and freshly ground black pepper. Pour over the marinade and the stock and bring the mixture to the boil.", "Cut a circle of greaseproof paper slightly smaller than the diameter of the casserole. Place it inside the casserole to cover its contents. Transfer to the oven for 1½-1¾ hours, until the meat is very tender, but not falling apart. Remove the meat from the casserole, cover and set aside to rest. Keep warm.", "Meanwhile, take a ladleful of sauce from the casserole and pour it into a bowl. Whisk in the creamed horseradish until well combined. Strain the mixture back into the casserole through a fine sieve, discarding the sieve contents. ", "Strain the whole casserole through a fine sieve, collecting the strained liquid in a clean saucepan. Simmer until it has thickened to the consistency of double cream. Season with salt and pepper, then stir in the butter and parsley. Set aside and keep warm.", "Heat the oil in a deep-fat fryer to 180C/350F. Alternatively, heat the oil in a deep-sided, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "In a large bowl, mix together the flour and smoked paprika until well combined. Pour the milk into a bowl.", "Dust the onion slices with the seasoned flour, then dip them into the milk. Finally, roll them in the seasoned flour again to coat.", "Carefully lower the onion slices into the hot oil and fry for 1-2 minutes, or until crisp and golden-brown.", "To serve, place one of the braised rib-eye steaks onto each of four serving plates. Spoon over a little of the sauce. Garnish with the deep-fried onions. Serve the new potatoes in a large bowl, dotted with the butter."]}, {"isVegetarian": false, "title": "Twice cooked pork with pickled cucumber", "url": "www_bbc_co_uk_food_recipes_twice_cooked_pork_with_11941", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz fatty pork belly, skin on", "2 tbsp groundnut oil", "1 tbsp Shaoxing rice wine (or dry sherry)", "1 tbsp chilli bean paste", "1 tbsp yellow bean sauce", "1 tbsp fermented black beans, rinsed and crushed", "1 spring onion (or baby leek), sliced on the diagonal into julienne strips ", "1 tsp dark soy sauce", "1 tsp light soy sauce", "pinch sugar", "sea salt and freshly ground white pepper", "1 garlic clove, minced", "2 pinches caster sugar", "1 tbsp Chinese clear rice vinegar or cider vinegar", "1 tsp chilli bean paste", "1 tsp chilli oil", "1 tbsp toasted sesame oil ", "4 small cucumbers, sliced in half lengthways, de-seeded, each half cut into long wedges and then sliced into 1cm/½in pieces", "1 fresh red chilli, de-seeded and cut into small strips", "300g/10½oz jasmine rice, steamed"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pork, pour 700ml/1¼ pints water into a large pan, add the pork and bring to the boil. Boil for 30 minutes. Drain and leave to cool. ", "Transfer the meat to the fridge for an hour, to firm up. ", "Meanwhile, for the pickled cucumber, combine the garlic, sugar, vinegar, chilli bean paste, chilli oil and sesame oil in a bowl. ", "Add the cucumbers and leave to marinate in the fridge for 20 minutes. ", "Remove the cucumbers from the fridge and add the fresh chilli.", "Remove the meat from the fridge and slice into 5mm/¼in thick slices.Heat a wok over high heat and add the groundnut oil, then the pork. As the pork starts to brown, add the rice wine (or sherry) and cook until the pork has browned and the skin is slightly crisp. ", "Add the chilli bean paste, yellow bean sauce and fermented black beans and stir-fry for a minute. ", "Add the spring onion (or leek) if using, and stir-fry for less than a minute until well mixed. ", "Add both soy sauces and the sugar, season and serve. ", "To serve, place a spoonful of rice onto the plate, spoon the pork over the top then the pickles alongside."]}, {"isVegetarian": false, "title": "Twice-stuffed chicken", "url": "www_bbc_co_uk_food_recipes_twicestuffedchicken_92270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz butter", "750ml/1 pint 7fl oz chicken stock, preferably fresh", "6 slices air-cured ham, such as Parma or Serrano, 4 left whole, 2 finely chopped", "220g/7¾oz stale baguette, chopped into 1cm/½in cubes", "75g/2½oz smoked pancetta, chopped into lardons", "60g/2½oz flatleaf parsley, washed, leaves finely chopped", "2 medium shallots, peeled, finely sliced", "1 lemon, zest only", "1 x 2.2kg/4lb 13½oz whole chicken", "10 fresh sage leaves ", "2-3 tbsp olive oil", "salt and freshly ground black pepper", "1kg/2lb 3oz potatoes, peeled, cut in half", "1 white onion, peeled, finely chopped", "3 sweetcorn cobs, kernels only", "small handful fresh thyme, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt 100g/3½oz of the butter in a saucepan, then add 250ml/7fl oz of the stock and stir well to combine.", "In a large mixing bowl, mix together the two slices of chopped air-cured ham, cubed bread, pancetta, 30g/1¼oz of the parsley leaves, and all of the shallots and lemon zest until well combined. Season, to taste, with salt and freshly ground black pepper.", "Add the dry mixture to the butter and stock mixture and stir well to combine. Set aside to soak for 15-20 minutes.", "Meanwhile, using wet fingers, gently pull back the skin of the chicken breasts until all of the skin from the opening to the wing bone comes away from the meat. ", "Press two pieces of the air-cired ham together and rub them all over with water. Slide two of the ham slices under the skin on one side of the breast, pushing them right to the wing bone. ", "Rub the sage leaves in water and slide 4-5 leaves under the skin on one side of the breast too. Repeat the process on the other side of the breast. ", "Squeeze the stuffing mixture dry, then stuff the cavity of the chicken with the stuffing. Place the stuffed chicken into a roasting tray, breast-side down.", "Pierce the chicken all over using a wooden skewer, then rub the skin all over with olive oil and season, to taste, with salt and freshly ground black pepper. ", "Transfer the chicken to the oven and cook, breast-side down, for one hour in the middle of the oven. ", "Turn the chicken over and continue to roast for a further 20 minutes, or until the skin on the crown is crisp and golden-brown and the chicken is cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Transfer the chicken to a warm plate, cover with aluminium foil and set aside to rest for 10 minutes (reserve the fat in the roasting tray for the sauce).", "Meanwhile, boil the potatoes in a pan of salted water for 18-20 minutes, or until tender. Drain well, then season, to taste, with freshly ground black pepper and stir in the remaining chopped parsley. Keep warm.", "Meanwhile, add the remaining 500ml/17fl oz of chicken stock to the fat in the roasting tray and heat over a medium heat until simmering. Continue to simmer for 4-5 minutes, or until the volume of sauce has reduced by half. Keep warm.", "Meanwhile, heat the remaining 50g/2oz of butter in a separate saucepan over a medium heat. Add the onions and sweetcorn kernels and stir to coat them in the butter, then cover the pan with a lid and continue to cook for 4-5 minutes, or until softened. ", "Remove the pan from the heat, stir in the thyme leaves and season, to taste, with salt and freshly ground black pepper. Mash the sweetcorn kernels with a potato masher or the back of a wooden spoon until creamy. ", "To serve, carve the twice-stuffed chicken and arrange the meat on four serving plates. Spoon the potatoes and creamed sweetcorn alongside. Drizzle over the sauce."]}, {"isVegetarian": false, "title": "Twice cooked pork belly with noodle chow chow", "url": "www_bbc_co_uk_food_recipes_twicecookedporkbelly_70504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/21¼fl oz water", "150ml/5¼fl oz malt vinegar", "3 tomatoes, halved", "4cm root ginger, finely chopped", "50ml/1¾fl oz syrup from jar of stem ginger", "1 tsp soy sauce", "1 tbsp demerara sugar", "1 tsp cornflour, mixed with 1 tbsp tomato ketchup", "1 kg/2¼lb pork belly, cooked the day before ", "500g/17½oz  packet of 4-minute dried medium egg noodles", "1 tbsp sesame oil mixed with 1 tbsp vegetable oil", "4 shiitake mushrooms, sliced", "4 baby sweetcorn, quartered", "½ yellow pepper, cut into thin strips", "1 garlic clove, finely chopped", "2.5cm fresh root ginger, finely chopped", "2 spring onions, cut into 4cm pieces", "6 mangetout", "1 carrot, cut into matchsticks", "3 tbsp chopped fresh coriander", "1 tsp Thai fish sauce (nam pla)", "1 tsp soy sauce"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the sweet and sour ingredients, except the corn flour and tomato ketchup, in a saucepan, bring to the boil and leave to simmer for 30 minutes.", "Then stir in the corn flour mixture and cook until thick and glossy. ", "Drop the noodles in a large pan of lightly salted boiling water, bring back to the boil and cook for 4 minutes. ", "Drain and cool under cold water. ", "Divide the pork into four portions and warm on a griddle pan for 4 minutes on each side.", "Then heat half the mixed oils in a large frying pan or wok, add the cold, drained noodles and stir-fry until lightly coloured.", "Transfer to a plate and keep warm. ", "Add the remaining oil to the wok and stir fry the vegetables for 2 minutes, starting with the mushrooms and sweetcorn, then adding the pepper, garlic and ginger, then the spring onions, mangetout and finally the carrots. ", "Add the noodles, sweet and sour sauce, coriander, fish sauce and soy sauce to taste and mix well. Serve with the warm pork belly."]}, {"isVegetarian": true, "title": "Twister bread", "url": "www_bbc_co_uk_food_recipes_twister_bread_10942", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/twister_bread_10942_16x9.jpg", "ingredients": ["550g/1lb 4oz strong white bread flour, plus extra for dusting", "100g/3½oz wholemeal bread flour", "2 tsp salt", "7g sachet of fast action dried yeast", "2 squidges of honey", "1 tbsp sesame oil", "50g/1¾oz poppy seeds", "sunflower oil (or spray oil)"], "serves": "Makes 1 loaf", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flours, salt and yeast into a large bowl, mix a bit and then make a hole in the middle. Squidge in the honey and add in 350ml/12oz of warm water (from the tap). Then mix everything together until combined. Then, I like to get my hands in (I find it very therapeutic!) and squidge it all together, gathering up all those dry bits from the bottom of the bowl. ", "Then tip the dough onto a floured surface and knead it for 10 minutes (or five minutes if kneading in a food mixer fitted with a dough hook). To test and see if it has been kneaded enough, form the dough into a ball with a nice taut top. Dip your finger in the flour and then prod the side of the dough making an indent. The indent should spring back all the way and almost disappear if it is ready.", "Put some more flour on the surface and then, using a rolling pin, roll the dough out into about a 40x24cm/15x9in rectangle. If it is too springy to roll then cover it with a tea towel and leave for five minutes or so. That way the stretchy gluten strands in the bread can relax a bit which will make it easier to roll out.", "Using a pastry brush, brush the top of the dough with the sesame oil going right up to the edges and then sprinkle the poppy seeds evenly all over. Then cut the dough into six 4cm/1½in wide strips down the length.", "Keeping the strips lined up together, twist each one up like a twisted breadstick or cheese straw. Once they are all twisted, stack them into a bundle and pick them all up in one go. Then twist them together so you have a long thick twisted rope made up of the individual strands of bread. Try to twist it evenly so the rope is an even thickness throughout.", "Then curve the bread into a ‘wreath’ shape and squish the ends together, sealing them with a bit of water. It does not have to be perfect, just as long as they are joined up. When I make this bread there are usually lots of poppy seeds left on the surface, so I scoop those up and then scatter them over the bread, especially the bit where the join is, to cover it up a bit. ", "Place the wreath on a baking sheet. Oil some cling film (I find the spray oil is best for this) and use it to cover the dough, oiled side down, so it is airtight but with enough room for the dough to rise a little. ", "I usually put the oven to preheat to 200C/400F/Gas 6 now and place the dough on a chair near it, so it’s nice and warm. Leave to prove for about 30 minutes. To test if it is ready for the oven (because the bread will not have doubled in size but probably grown by about half again), dust your finger with some flour and then make an indent in the side of the bread. The indent should spring back about half way. If the indent just stays there and does not really move very much, then it needs more time.", "When ready, place in the oven to bake for 35 minutes.", "The loaf is cooked when it sounds hollow when tapped underneath. If not, then give it another five minutes or so in the oven.", "Once ready remove from the oven and serve. I love the crispy crunch bits on the outside and the soft pillowy inside slathered in lots of butter. "]}, {"isVegetarian": true, "title": "Two-step buttercream", "url": "www_bbc_co_uk_food_recipes_two-step_buttercream_19730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/two-step_buttercream_19730_16x9.jpg", "ingredients": ["300g/10½oz icing sugar", "25g/1oz liquid glucose", "50g/1¾oz condensed milk", "2 tsp vanilla extract or other flavouring", "200g/7oz unsalted butter, softened", "100g/3½oz baking margarine, softened", "200g/7oz icing sugar", "100ml/3¾fl oz double cream", "colouring and flavouring"], "serves": "Makes enough to layer and cover one 20cm/8in round birthday cake", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the icing sugar, glucose, condensed milk, flavouring and butter with an electric mixer in a bowl until smooth and light, then beat in the baking margarine until smooth.", "In a jug, stir the icing sugar into the cream until dissolved, then add any colouring or flavouring you want, or just leave it plain. Beat this gradually into the butter mixture until light and fluffy. ", "This buttercream keeps very well covered at room temperature for 2-3 days and can be warmed slightly and re-beaten if the texture is too firm."]}, {"isVegetarian": true, "title": "Tzatziki", "url": "www_bbc_co_uk_food_recipes_tzatziki_01135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves", "salt, to taste", "300g/10oz natural yoghurt", "1 lemon, juice only", "small handful mint leaves, chopped"], "serves": "Makes 300g/10oz", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Crush the garlic with a little salt in a pestle and mortar to make a paste. ", "Add the yoghurt and lemon juice and stir well. Stir through the mint. Set aside until needed."]}, {"isVegetarian": true, "title": "Tzatziki", "url": "www_bbc_co_uk_food_recipes_tzatziki_13049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz Greek yoghurt ", "1 cucumber ", "2 tbsp lemon juice ", "2 cloves of garlic, grated finely ", "dash of extra virgin olive oil", "paprika, for sprinkling"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["The best result is achieved by peeling and de-seeding the cucumber before grating. Hang the grated cucumber in muslin cloth or a tea towel in order to squeeze out all the excess liquid.  ", "Combine the yoghurt, cucumber, lemon juice and garlic. Add a dash of olive oil and sprinkle with paprika.  ", "Perfect for dipping your aubergines in. (See recipe for puréed Aubergine and Garlic Dip.)"]}, {"isVegetarian": false, "title": "Udon noodles in miso broth with stir-fried greens and shichimi pepper", "url": "www_bbc_co_uk_food_recipes_udon_noodles_in_miso_41653", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in piece kombu seaweed ", "1½ tsp dashi powder ", "2½cm/1in piece fresh ginger, peeled and grated ", "1 tbsp white miso paste", "pinch caster sugar ", "2 tbsp mirin ", "75g/2½oz tofu, cubed into 1cm/½in pieces", "1 tbsp vegetable oil", "1 garlic clove, finely sliced ", "4 shiitake mushrooms, sliced ", "2 heads bok choi, sliced in quarters ", "75g/2½oz kale, shredded ", "1 small courgette, sliced ", "50g/2¾oz sugar snap peas ", "2 tbsp Japanese soy sauce ", "40g/2½oz enoki mushrooms, broken into pieces ", "4 spring onions, finely sliced ", "1 tsp shichimi pepper ", "1 tsp sesame seeds ", "1 x 150g/5oz packet udon noodles "], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the miso broth, place a saucepan of water over a medium heat and add the kombu seaweed. ", "Add the dashi powder, stir and leave to simmer for a few minutes. Add the grated ginger, white miso paste, sugar and mirin.  Taste and adjust the amount of sugar or mirin if necessary. Keep warm.", "For the stir-fried greens, heat a wok with a little vegetable oil until shimmering, add the sliced garlic and fry gently for 10 seconds. Tip in the sliced mushrooms, bok choi, kale, courgette and sugar snap peas.", "Keep stirring the contents of the wok and cook for two minutes or so, then add the soy sauce, enoki mushrooms and all but a teaspoon of the spring onions.", "Meanwhile, bring a second pan, filled with water, to the boil.  ", "Fry the vegetables until slightly softened, then add all but a pinch of the schicimi pepper and sesame seeds.", "Drop the udon noodles into the boiling water and cook for a few minutes, or until heated through, and then drain.", "To finish the miso broth, add the tofu cubes to the broth.", "To serve, lay the udon noodles in the bottom of a bowl, place the stir-fried greens on top and then ladle over the miso broth.  Finish with the reserved finely sliced spring onion and a pinch of both the shichimi and sesame seeds."]}, {"isVegetarian": false, "title": "Ultimate burger in a brioche bun", "url": "www_bbc_co_uk_food_recipes_ultimate_burger_in_a_73911", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ultimate_burger_in_a_73911_16x9.jpg", "ingredients": ["800g/1lb 12oz best-quality beef steak, minced", "3 egg yolks", "1 tbsp Dijon mustard", "300ml/10½fl oz rapeseed oil", "25g/1oz beer mustard or wholegrain mustard", "½ lemon, juice only", "2 tbsp vegetable oil", "4 brioche rolls, cut in half", "4 tbsp ready-made mild chilli relish", "½ round lettuce, leaves separated", "2 tomatoes, sliced", "200g/7oz cheese slices, preferably Monterey Jack", "8 gherkins, drained, sliced", "1 red onion, peeled, sliced", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Season the steak mince with salt and freshly ground black pepper and mix in a bowl using your hands. Divide the mince into four equally-sized balls and press each one between your palms to form a patty. Place the patties on a plate, cover, and chill in the fridge for an hour.", "Thirty minutes before you want to eat, light your barbecue. Allow the flames to flare up and die down.", "Meanwhile, in a bowl, whisk together the egg yolks and mustard until well combined. Gradually add the rapeseed oil in a thin stream, whisking continuously, until the mixture thickens to a mayonnaise and all of the oil has been incorporated. Stir in the beer mustard and lemon juice, then season, to taste, with salt and freshly ground black pepper.", "When the barbecue coals are just glowing, rub the patties with the vegetable oil and cook for 3-4 minutes on each side, or until cooked to your liking. (Alternatively, cook over a high heat on a griddle pan.) ", "Place each brioche onto the barbecue, cut-side down, and cook for one minute, or until chargrill marks appear on the bread. Set aside.", "To assemble the burgers, spread a little of the chilli relish onto the base of each brioche bun. Place a lettuce leaf and a slice of tomato on top, then add a burger, a slice of cheese, and a dollop of the mustard mayonnaise. Top with a few gherkin and red onion slices, then place the top half of the brioche bun on top.", "Place the burgers onto serving plates, keeping them from toppling over by spearing them with wooden skewers, if desired."]}, {"isVegetarian": false, "title": "Ultimate English breakfast omelette", "url": "www_bbc_co_uk_food_recipes_ultimate_english_39468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 new potatoes", "2-3 tbsp vegetable oil, for cooking", "100g/3½oz black pudding, cut into rings", "100g/3½oz bacon lardons", "100g/3½oz cooking chorizo  ", "2 banana shallots, thinly sliced into rings", "2 garlic cloves, grated", "1 green chilli, sliced", "6 free-range eggs, beaten", "1 tbsp chopped rosemary", "1 bunch flatleaf parsley, leaves picked and chopped", "salt and freshly ground black pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the new potatoes in salted boiling water for 12-15 until just soft. Drain in a colander then leave to steam dry and cool. When cool, cut them in half and keep to one side.", "Preheat the oven to 220C/425F/Gas 7.", "Heat a 25cm/10in ovenproof frying pan on a medium heat and pour in a little oil. Fry the black pudding until crisp, remove from the pan and drain on  kitchen roll. Add the bacon to the pan and fry until it starts to brown and the fat renders out. Add the whole chorizo to the pan and fry with the bacon. The smoky red paprika oil will start to come out of the chorizo. Remove the bacon and chorizo from the pan and drain on some kitchen roll. When the chorizo is cool enough to handle slice it thinly.", "Add one of the sliced banana shallots and the grated garlic to the pan with all of the rendered oil still in it, and cook on a low heat until soft. Add the halved potatoes and stir around, then put the cooked meats back into the pan and add the green chilli.", "Pour the eggs into the pan, add the rosemary and half the chopped parsley. Season with salt and pepper and stir slowly over a low heat until it starts to firm up. Put the pan in the oven and cook for 5-8 minutes, or until the eggs are set and puffed up.", "Remove the pan from the oven, sprinkle on the remaining raw shallot and chopped parsley. Serve immediately."]}, {"isVegetarian": false, "title": "Ultimate indulgence mirror glaze cake", "url": "www_bbc_co_uk_food_recipes_ultimate_indulgence_90754", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ultimate_indulgence_90754_16x9.jpg", "ingredients": ["40g/1½oz unsalted butter, melted, plus extra for greasing", "5 medium free-range eggs", "165g/5¾oz caster sugar", "2 large oranges, finely grated zest only", "pinch salt", "165g/5¾oz plain flour", "55g/2oz unsalted butter", "130g/4⅔oz soft light brown sugar", "5 tbsp double cream", "1 tsp sea salt", "600ml/20fl oz double cream", "1 tbsp butter (to thicken, if necessary)", "ivory gel food colour (optional)", "150ml/5fl oz double cream", "135g/5oz caster sugar", "55g/2oz cocoa powder", "3 leaves gelatine ", "100g/3½oz granulated sugar", "50g/1¾oz blanched hazelnuts", "chocolate curls (optional)"], "serves": "Makes 1 large cake", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/170C Fan/Gas 4. Grease and line two 20cm/8in springform cake tins with baking paper.", "For the génoise, half fill a large saucepan with water and bring to a simmer. In a large heatproof mixing bowl, combine the eggs and sugar, then place the bowl over the saucepan (creating a bain-marie). Make sure the bottom of the bowl doesn’t touch the water.", "Using a hand-held electric whisk, vigorously whisk the mixture for around 7 minutes, or until trebled in volume, pale and it leaves ribbons on the surface when the beater is lifted. Remove the mixture from the heat as soon as it is warm to the touch to avoid cooking the eggs.", "Gently fold in the orange zest and salt. Sift the flour into the mixture in three batches, gently folding in each batch before adding the next. Slowly pour the melted butter down the side of the bowl and fold in.", "Divide the mixture equally between the prepared cake tins, pouring from as low a height as possible. Place on the middle shelf of the oven and bake for 18-20 minutes, or until they are coming away from the sides of the tin and a cake skewer inserted in the middle comes out clean. Cool in the tin for 5 minutes then transfer to a wire rack to cool completely.", "For the salted caramel sauce, put the butter and light brown sugar in a small saucepan over a low heat and stir until the sugar is melted (about 3 minutes). Drizzle in the double cream, mixing well – take care as the mix may splatter. Bring to the boil and simmer for 1 minute, then remove from the heat. Stir in the sea salt and set aside to cool, stirring frequently to prevent a crust forming. When cooled, whisk it for 1-2 minutes to incorporate some air.", "For the cream base, whisk the double cream until stiff peaks form. Then whisk in the salted caramel to make a salted caramel cream. If the mixture is too loose, beat the butter until smooth and add to the salted caramel cream as necessary. Use a toothpick to add enough ivory food colouring to make a light brown/orange colour (if using).", "To assemble the cake, cut each cake in half horizontally to make four layers. Carefully place the first layer on a cake board. Using a palette knife, spread about 5mm of cream on top in an even layer. Place the next layer of génoise on top and repeat the cream and cake layers until you have four layers of génoise with salted caramel cream on top of each layer.", "Apply a ‘crumb coat’ of cream all over the cake, ensuring any gaps are filled to give a smooth surface. Make sure there are no overhanging edges as this will affect the mirror glaze later. Transfer the cake to the fridge for 20-30 minutes.", "Remove the cake from the fridge and add a final layer of cream all over, finishing it carefully using a palette knife (the smoother the cream, the better the final finish will be). Place back in fridge for 20 minutes, along with any remaining cream.", "For the chocolate glaze, add the cream, sugar, cocoa powder and 150ml/5fl oz water to a small saucepan and heat gently until the sugar is fully dissolved. Keep stirring during heating. Bring to the boil and simmer for 2 minutes. Remove from the heat and leave to cool for 10 minutes.", "Soak the gelatine leaves in a bowl of cold water for 5 minutes. Squeeze any excess water from the leaves and stir into the glaze until fully dissolved. Use a sugar thermometer to check the temperature of the glaze and cool to a maximum of 38C before using. ", "Pass the glaze through a fine sieve into a measuring jug and tap on a hard surface to encourage any air bubbles to pop.", "Once the cake has finished cooling in the fridge, transfer to a wire cooling rack placed on a large baking tray to catch any excess glaze as you pour it over the cake.", "Pour the glaze evenly over the top of the cake. Check the sides of the cake are covered and add more glaze if needed by reusing any excess glaze caught in the baking tray. Immediately transfer the cake to the fridge to firm up. ", "To decorate, make a caramel. Put the sugar and 1-2 tablespoons water in a small pan over a medium heat. Do not stir, just swirl the pan. Heat until the sugar is an amber caramel colour, then remove from the heat.", "Meanwhile, attach each hazelnut to the end of a cocktail stick. Very carefully dip each hazelnut into the caramel (the caramel will be very hot, so take care not to burn yourself) and hang over the edge of a work surface, using a heavy chopping board to hold the cocktail stick in place – protect the floor and any cupboards and with newspaper as the caramel will drip. This will form a caramel ‘spike’ as the caramel stretches. Once all hazelnuts are coated, trim the spikes to the same length using scissors and remove from the cocktail sticks onto a sheet of parchment paper.", "To finish, put the cake on a serving plate and pipe small circles of salted caramel cream around the top edge of the cake and place a caramelised hazelnut on each circle. "]}, {"isVegetarian": false, "title": "Ultimate Korean fried chicken with pickled radish", "url": "www_bbc_co_uk_food_recipes_ultimate_korean_fried_29527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110ml/3¾fl oz rice vinegar", "110g/4oz superfine sugar or caster sugar", "1 tsp kosher salt or sea salt ", "500g/1lb 2oz radish, preferably Daikon, cut into 10mm/½in cubes", "35g/1¼oz cornflour", "2½ tsp kosher salt or sea salt", "½ tsp baking powder", "freshly ground black pepper", "2 chicken drumsticks, thighs and wings (with tips), bone in, skin on", "vegetable oil, for deep-frying", "70g/ 2½oz cornflour", "35g/1¼oz fine matzo meal", "35g/1¼oz plain flour", "2 tbsp chilli flakes, preferably Korean chilli flakes (gochugaru)", "1 tbsp kosher salt or sea salt", "2½ tsp garlic granules", "2½ tsp onion granules", "¼ tsp baking powder", "5 tbsp vodka", "2 tbsp chilli paste, preferably Korean chilli paste (gochujang)", "250ml/9fl oz soy sauce", "2 tbsp rice wine vinegar", "4 tbsp mirin", "100g/3½oz  dark brown sugar", "2 garlic cloves, crushed", "4 tsp grated fresh ginger", "½ tsp chilli paste, preferably gochujang (Korean chilli paste)", "1 tsp sesame oil", "1½ tbsp cornflour", "70g/2½oz  chilli paste, preferably Korean chilli paste (gochujang)", "4 tsp soy sauce", "1 tbsp rice wine vinegar", "70g/2½oz dark brown sugar", "3 garlic cloves, crushed", "2 tsp grated fresh ginger", "4 tsp sesame oil", "1 tsp roasted white sesame seeds", "¼ bunch fresh chives, chopped", "2 tsp black sesame seeds"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pickled radish, put the rice vinegar, sugar, salt and 110ml/3¾fl oz water in a bowl. Whisk until the sugar and salt have dissolved. Add the radish and toss to coat. Cover and leave at room temperature for 24 hours, then place in the fridge. ", "For the coating, put the cornflour, salt, baking powder and pepper in a large mixing bowl and whisk together. Add the chicken and toss well until evenly coated. Transfer the chicken to a rack, shaking well to get rid of any excess coating.  Leave to rest for 1 hour in the fridge. ", "Pour enough oil into a large casserole dish to reach a depth of 5cm/2in. Heat the oil over a medium-high heat until it reaches 175C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "For the batter, mix the dry ingredients in a large bowl. In a separate bowl whisk the wet ingredients and 235ml/8¼fl oz water together. Just before frying, whisk the wet mixture into the dry mixture.  The consistency should be relatively thin and runny. ", "Dip each piece of chicken into the batter, letting excess batter drip off.  Suspend the chicken in the oil for a couple of seconds for it to set before letting it slip completely into the oil. You may need to do this in batches. ", "Fry the chicken for 15-20 minutes, or until golden brown and cooked through. Transfer to a wire rack to drain. ", "For the black soy umani sauce, put all of the ingredients except the cornflour in a small saucepan and simmer over medium heat until the sugar dissolves. Mix the cornflour with 1½ tbsp water and whisk into the sauce. Bring to the boil, then remove from the heat. ", "For the red chilli sauce, put all of the ingredients in a small saucepan and simmer over medium heat for 2 to 3 minutes, whisking well to make sure ingredients are dissolved and incorporated. . ", "Place the chicken and pickled radishes on a serving plate with the sauces.  Garnish with fresh chives and sesame seeds. "]}, {"isVegetarian": false, "title": "Umami bomb (parmesan and wild mushroom custard)", "url": "www_bbc_co_uk_food_recipes_umami_bomb_parmesan_and_62918", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "100g/3½oz yellow chanterelle mushrooms, washed and roughly chopped", "100g/3½oz ceps, washed and roughly chopped", "40g/1½oz unsalted butter, plus extra for greasing", "½ shallot, finely chopped", "2 garlic cloves, finely chopped", "2 thin slices pancetta, sliced into thin strips", "salt", "2 free-range eggs", "160g/5½oz whipping cream", "4 medium free-range egg yolks", "120g/4¼oz parmesan, grated", "200ml/7fl oz full-fat milk", "pepper", "200ml/7fl oz chicken jus or reduced chicken stock, warmed", "4 slices pancetta", "25ml/1fl oz olive oil", "1 courgette, finely chopped", "100g/3½oz mangetout, sliced", "100g/3½oz asparagus, sliced", "150g/5½oz girolle mushrooms, cleaned", "100g/3½oz fresh peas", "100g/3½oz parmesan, grated", "10g/¼oz plain flour"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the parmesan and wild mushroom custard, preheat the oven to 150C/300F/Gas 2 and grease four ramekins. ", "Pour the olive oil into a hot pan and fry the chanterelle mushrooms and ceps for a minute until they release their water. Drain and set aside the mushrooms. Discard the cooking liquid.", "Melt the butter in the pan used to cook the mushrooms. When the butter is golden-brown, add the shallots, garlic and sliced pancetta. Stir and return the mushrooms to the pan. ", "Season with salt and stir. Continue cooking for two minutes, taking care not to colour the mushrooms (it will make them taste slightly bitter). Transfer to a plate to cool.", "When the mushroom mixture is cool, divide it between the prepared ramekins.", "In a bowl, whisk the eggs and the whipping cream. Mix in the egg yolks, parmesan and milk. Season to taste with salt and pepper.", "Divide the mixture evenly among the prepared ramekins. Place in a baking dish and pour cold water into the baking dish to reach halfway up the side of the ramekins. Cook in the oven for 20-25 minutes. ", "Check the custards are cooked by inserting a knife into one of them, if it comes out clean, the custard is cooked. Return to the oven for a few minutes if required. When the custards are cooked, set aside to cool slightly.", "For the vegetable medley, preheat the oven to 220C/425F/Gas 7.\r\n\r\n", "Place the pancetta between two baking trays that fit together and bake in the oven for 5-6 minutes, or until crisp. Remove from the oven and allow to cool with the baking tray on top so the pancetta stays straight.", "Heat a large frying pan and add the olive oil. Once hot, add the courgette, mangetout, asparagus, girolles and peas and cook them (without colouring) until they are tender.", "Place the parmesan and plain flour in a bowl and mix. To make a parmesan crisp, heat a frying pan and sprinkle a quarter of the mixture in a neat line. When the mixture starts to bubble, remove from the pan in one piece and place over a rolling pin to curve the parmesan crisp. Repeat with the remaining mixture.", "To serve, add a spoonful of warm chicken jus to the custards. Place the vegetables and a slice of pancetta on top of the custards with a parmesan crisp."]}, {"isVegetarian": false, "title": "Umami chicken and shiitake mushroom pies", "url": "www_bbc_co_uk_food_recipes_unami_chicken_and_08796", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½ oz chicken breasts", "1 tbsp rapeseed oil ", "½ onion, diced", "50g/1¾oz frozen peas", "6 fresh shiitake mushrooms, diced  ", "1 tbsp Shaoxing rice wine", "½ tsp Chinese five-spice powder ", "150ml/5fl oz chicken stock", "150ml/5fl oz double cream", "1 tbsp chopped fresh tarragon leaves", "1 tbsp light soy sauce ", "sea salt and ground black pepper", "3 sheets puff pastry", "1 free-range egg"], "serves": "Makes 12 mini pies", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Poach the chicken in a large lidded pan with water. Cover with the lid and bring to the boil, reduce the heat and simmer for 20 minutes or until the chicken is cooked through. Remove the chicken from the pan and leave to cool. Once cool, shred the chicken. ", "Heat a wok over a high heat. Add the rapeseed oil and stir fry the onions until slightly translucent, then add the peas, mushrooms and rice wine. Stir fry for a minute. Add the shredded chicken and Chinese five spice and cook for 30 seconds. Add the stock and stir well. Pour in the double cream and tarragon. Season with soy sauce, salt and black pepper. Set aside.", "Roll out the pastry to about 3mm/⅛in thick. Using pastry cutters, cut out enough pastry to line the bases of the muffin tray and create the pie tops. ", "Line the tray with the pastry then spoon the filling on top. Beat an egg, top the pies with pastry and glaze with the egg.", "Bake for 25 minutes until the pastry is risen and golden-brown. Serve warm. "]}, {"isVegetarian": true, "title": "Union Jack battenberg cake", "url": "www_bbc_co_uk_food_recipes_union_jack_battenburg_15063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/union_jack_battenburg_15063_16x9.jpg", "ingredients": ["175g/6oz softened butter, plus extra for greasing", "175g/6oz caster sugar", "3 free-range eggs", "175g/6oz self-raising flour", "½ tsp vanilla extract", "blue food colouring ", "300g/10½ icing sugar", "150g/5¼oz butter, softened", "6 tbsp good-quality strawberry jam", "500g/1lb 2oz white, ready-made marzipan", "2-3 tbsp icing sugar, for dusting"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Grease and line a 20cm/8in square cake tin.", "Beat together the butter and sugar in a bowl until light and fluffy. Beat in the eggs, a little at a time, until well combined. (If the mixture looks like it is curdling add a spoonful of the flour.)  Fold in the flour. Gradually add a few drops of blue food colouring (don’t add too much or the cake will look green.)", "Spoon the cake batter into the cake tin and level using the back of a spoon.  Bake for 35-40 minutes, or until golden-brown and a skewer inserted into the middle comes out clean.", "Remove the cake from the oven, set aside to cool for five minutes, then turn out and cool, upside down, on a wire rack.", "For the  buttercream filling, beat the butter in a bowl until soft and smooth, slowly beat in the icing sugar. Continue to beat until fluffy.", "To assemble the cake, slice the cake in half lengthways, place one sponge half on top of the other and trim off the edges, ensuring that both cakes are the same size.", "Cut the cakes in half again lengthways to make four long rectangles.", "Slice each rectangle diagonally along the length to make two triangular cakes", "Spread each cut side of the triangle with buttercream and jam and sandwich together with the other triangle to make four rectangular sections. Wrap each rectangular section in clingfilm and chill for at least an hour.", "Stack the rectangular sections into a square, so that the cross-section resembles a Union Jack (use an image of the Union Jack as a guide).", "Assemble the bottom half of the cake first by spreading each of the long inside edges with buttercream and jam and sandwiching together. Repeat with the top layer and chill both cakes for one hour. ", "Finally, sandwich the two cakes together by spreading the top of the bottom layer and the bottom of the top layer with buttercream icing.  Spread the bottom layer with jam and sandwich together. Chill the cake for one hour.", "Meanwhile, roll the marzipan out on a surface dusted with icing sugar to a 5mm/¼in thickness, it should be large enough to cover the cake.", "Warm a little strawberry jam and use this to brush the outside of the chilled cake. ", "Turn the cake upside down on the marzipan and brush the underside of the sponges with the jam.", "Wrap the marzipan around the cake, pressing it gently onto the surface of the sponges, and press the edges together to make a firm join.", "Turn back over with the seam underneath, trim a thin slice off each end and place on a serving plate.  Take a slice from each end of the cake to neaten the edge and it should reveal a cake version of the Union Jack. "]}, {"isVegetarian": true, "title": "Upside-down winter pudding", "url": "www_bbc_co_uk_food_recipes_upside_down_winter_10049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp demerara sugar", "3 English pears, peeled, cored and halved lengthways", "6 glacé cherries", "100g/4oz unsalted butter", "100g/4oz golden syrup ", "100g/4oz black treacle ", "1 large free-range egg ", "150ml/5fl oz tepid milk ", "1 tsp bicarbonate of soda", "225g/8oz plain flour", "1 heaped tsp ground cinnamon ", "1 heaped tsp ground ginger", "75g/3oz soft light brown sugar ", "vanilla ice cream, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/gas 4. Line the base and sides of a deep-sided 20cm/8in round cake tin with a non-stick baking parchment. Sprinkle the base with the demerara sugar. ", "Place a cherry in the cavity of each pear half where the core has been removed then place the pears, cut side down, on the sugar in the cake tin, radiating from the centre of the tin.", "Melt the butter, syrup and treacle together in a small pan over a low heat, then set aside. In a jug, mix together the egg, milk, and bicarbonate of soda.", "Sift the flour, cinnamon and ginger into a mixing bowl and stir in the soft brown sugar.  Make a well in the centre and pour in the melted ingredients and the egg and milk mixture. Stir thoroughly until well combined. Pour over the pears into the prepared cake tin.", "Bake in the centre of the oven for about 45 minutes, or until well risen, golden-brown and firm to the touch. Cool in the tin for 3-4 minutes then turn out onto a serving plate, pear-side-up. Cut into thick slices and serve warm with vanilla ice cream."]}, {"isVegetarian": true, "title": "Union Jack fondant fancies", "url": "www_bbc_co_uk_food_recipes_union_jack_fondant_70560", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/union_jack_fondant_70560_16x9.jpg", "ingredients": ["175g/6oz unsalted butter, softened", "175g/6oz caster sugar", "3 free-range eggs, lightly beaten", "175g/6oz self-raising flour", "1-2 tbsp milk", "50g/1¾oz caster sugar", "50ml/2fl oz water", "¼ tsp lemon essence", "150g/5½oz icing sugar", "75g/2¾oz butter, softened", "3-5  tbsp strawberry jam", "2 tbsp apricot jam, warmed gently, then passed through a sieve", "250g/9oz marzipan", "450g/1 lb fondant icing sugar", "red and blue food colouring"], "serves": "Makes 25", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Grease and line a 20cm/8in square cake tin.", "Beat together the butter and sugar in a bowl until light and fluffy. Beat in the eggs, a little at a time, until well combined. (If the mixture looks like it is curdling add a spoonful of the flour.)  Fold in the flour and add a little milk if the mixture looks stiff.", "Spoon the cake batter into the cake tin and level using the back of a spoon.  Bake for 35-40 minutes, or until golden-brown and a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven, set aside to cool for 5 minutes, then turn out and allow to cool completely, upside down, on a wire rack.", "Meanwhile, for the sugar syrup, heat the sugar and water in a saucepan until the sugar has dissolved. Stir in the lemon essence.", "For the filling, beat the butter in a bowl until soft and smooth, slowly beat in the icing sugar. Continue to beat until fluffy. ", "Very carefully, using the longest knife you have, remove the dark crust from the top of the cake and turn the cake upside down.  Then cut the cake in half horizontally.", "Drizzle or brush the bottom cake layer with the sugar syrup and then spread with the buttercream. Top with the jam and carefully sandwich with the top half of the cake. ", "Wrap the cake in cling film and chill for 2-3 hours, this will make it easier to cut the cake later. ", "Lightly dust the work surface with icing sugar and roll out the marzipan to the same size as the cake.  Once the cake is chilled, brush the top of the cake with the sieved apricot jam.  Carefully lift the marzipan onto the cake, smooth it flat along the top of the cake and cut off any excess marzipan. Cut the cake into equal 25 x 4cm/1½in squares. ", "Sieve the fondant icing sugar into a small bowl and stir in enough hot water to make a smooth icing thick enough to coat the cakes. Reserving three tablespoons of the icing into two bowls, cover with cling film and set aside.  ", "Coat the cake squares with the icing, easing the icing down the sides of the cakes until you have an even coating all over the cakes.  Sit the cakes on a cooling rack until the icing is set. ", "Add a few drops of blue food colouring to one of the bowls of icing, mix to a smooth paste and spoon into a piping bag with a very fine nozzle.  Repeat with the other bowl of icing using the red food colouring. ", "Use these two colours to pipe the union jack onto the fondant fancies. Be as simple or as intricate as you dare! Carefully remove the cakes from the rack and sit in paper cases."]}, {"isVegetarian": true, "title": "Upside-down cherry tomato tarte tatin", "url": "www_bbc_co_uk_food_recipes_upsidedowncherrytoma_87767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "200g/7oz cherry tomatoes", "100g/3½ oz caster sugar", "1 tbsp chopped fresh sage", "100g/3½oz plain flour, plus extra for dusting", "55g/2oz butter", "2 tbsp olive oil", "2 tbsp cold water", "2 tbsp balsamic vinegar, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the filling, heat the oil in a small ovenproof frying pan. Add the tomatoes and sugar and fry until the tomatoes just start to soften and the sugar becomes light golden-brown in colour. Scatter the chopped sage over the tomatoes.", "For the pastry, place the flour and butter into a food processor. Blend until it resembles breadcrumbs.", "Add the oil and water and blend for a few seconds more. Tip out onto a work surface lightly sprinkled with flour and knead lightly to form a soft dough.  ", "Using a rolling pin, roll out to a round circle slightly bigger than the frying pan. ", "Place the pastry on top of the fried tomatoes and tuck the edges into the filling. ", "Put the frying pan into the oven and cook for about 12 minutes, until the pastry is golden-brown and cooked on top. ", "Carefully turn out onto a large plate, so that the tomatoes are on top. Drizzle with balsamic vinegar and serve warm."]}, {"isVegetarian": true, "title": "Upside-down pear and walnut frangipane tart with honeyed cream", "url": "www_bbc_co_uk_food_recipes_upsidedownpearandwal_87281", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "55g/2oz caster sugar", "1 pear, core removed and sliced", "100g/3½oz walnuts", "125g/4½oz butter, softened", "125g/4½oz self-raising flour", "3 tbsp caster sugar", "2 free-range eggs", "150ml/¼ pint double cream", "2 tbsp honey"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Melt the butter and sugar in a small, oven-proof frying pan over a low heat until the sugar starts to turn light brown. Add the pear and lightly sauté for a few minutes. Place to one side.", "For the frangipane, place the walnuts into a food processor and whiz until a powder. Add the remaining frangipane ingredients to the food processor and whiz again until smooth. Spoon the mixture over the pears and level the top. ", "Put the frying pan into the oven and bake for about 12-15 minutes or until the frangipane is cooked. Loosen the edges of the tart, then carefully turn over onto a plate. ", "For the honeyed cream, whip the cream in a mixing bowl and fold in the honey. Spoon the honeyed cream over the tart. Serve warm."]}, {"isVegetarian": false, "title": "Open lamb tart with feta", "url": "www_bbc_co_uk_food_recipes_v_81322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "100g/3½oz unsalted butter", "2 free-range eggs", "30ml/1fl oz water", "1 tbsp olive oil", "2 cloves garlic, finely chopped", "1 shallot, sliced", "4 lamb chump chops, sliced ", "salt and freshly ground black pepper", "50ml/2fl oz red wine", "25g/1oz olives, pits removed, chopped", "25g/1oz cherry tomatoes, chopped", "15g/½oz mint leaves, chopped", "50g/2oz feta cheese", "parsley leaves, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the pastry, place the flour and butter in a food processor and blend together until you get a mixture resembling coarse breadcrumbs.", "Add one egg and the water and whiz until the pastry comes together in a dough.", "Roll the pastry on a floured surface to½cm/¼in thickness. Use a small plate as a guide to cut the pastry into a circle. ", "Place on a baking tray and into the oven to bake for 12 minutes.", "To make the topping, heat the oil in a frying pan and fry the garlic and shallot until softened.", "Season the lamb with salt and freshly ground black pepper and add to the pan. Fry until cooked through, then remove from the pan and set aside.", "Pour in the red wine and allow to bubble for 1 minute, then add the olives, tomatoes and mint. Stir together and season with salt and freshly ground black pepper.", "To serve, place the pastry on a plate, spoon over the lamb mixture, crumble over the feta cheese and garnish with a few parsley leaves."]}, {"isVegetarian": false, "title": "Valencian fish stew", "url": "www_bbc_co_uk_food_recipes_valencianfishstew_83162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "3 shallots, chopped", "1 carrot, chopped", "1 leek, chopped", "1 bulb fennel, chopped", "2 sticks celery, chopped", "2 cloves garlic, chopped", "30g/1oz tomato purée", "4 tomatoes, skinned and chopped", "60ml/2fl oz brandy", "175ml/6fl oz white wine", "300g/11oz mixed salmon and cod, chopped", "900ml/1¾ pints fish stock", "1 bay leaf", "1 sprig tarragon", "pinch cayenne pepper", "400g/14oz assorted fish and shellfish, such as salmon, cod, skate and clams", "12 new potatoes, cooked", "2 carrots, sliced and cooked ", "100g/3½oz fine beans, chopped and cooked ", "50-100ml/2-3½fl oz double cream", "1 tbsp chopped fresh parsley ", "1 lemon, juice only", "salt and freshly ground black pepper", "crusty bread", "garlic mayonnaise"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the oil in a casserole dish. Add the shallots, leek, carrot, fennel, garlic and celery and fry for 10 minutes over a low heat until soft.", "Add the tomato purée, chopped tomatoes, white wine and brandy and cook to reduce by half.", "Add the chopped salmon and cod and cook for five minutes.", "Add the stock, bay leaf, tarragon and cayenne pepper, then cover and simmer for 40 minutes.", "Blend the mixture, then pass through a sieve (push the mix through the sieve to get as much flavour as possible).", "For the stew, pour the sieved sauce back into the casserole dish and bring up to the boil. Add the fish and vegetables and simmer for 3-4 minutes or until the fish is cooked through.", "When cooked, stir in the double cream and mix through the parsley.", "Stir in the lemon juice and season with salt and freshly ground black pepper. Serve with crusty bread and garlic mayonnaise."]}]