[{"isVegetarian": true, "title": "Homemade lemon curd", "url": "www_bbc_co_uk_food_recipes_homemade_lemon_curd_15350", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large free-range eggs", "4 unwaxed lemons, finely grated zest and juice only", "300g/10½oz caster sugar", "225g/8oz butter, cut into pieces"], "serves": "Makes 1–2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Break the eggs into a saucepan and whisk to combine. Stir in the remaining ingredients and place over a medium heat. ", "Whisk continuously over the heat until the mixture coats the back of a spoon and is slightly thickened – this could take 7–10 minutes. Do not allow the mixture to boil or it may split.", "Remove from the heat and leave to cool. Spoon into a sterilised jar (or two small jars) seal, and leave to thicken.", "Keep in the fridge for up to a month, but use within a week of opening the jar. "]}, {"isVegetarian": false, "title": "Homemade linguine with lobster sauce", "url": "www_bbc_co_uk_food_recipes_homemade_linguine_with_94058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz type '00' flour (available in supermarket baking sections and some delicatessens), plus extra for dusting", "salt and freshly ground black pepper", "3 free-range eggs", "1 tbsp olive oil", "2 cooked lobsters", "50g/2oz butter", "1 onion, roughly chopped", "1 carrot, roughly chopped", "4 sprigs fresh thyme", "¼ tsp cayenne pepper", "1 tbsp tomato purée", "75ml/3fl oz white wine", "75ml/3fl oz brandy", "500ml/17fl oz chicken stock ", "75ml/3fl oz double cream", "salt and freshly ground black pepper", "3 tomatoes, peeled, de-seeded, diced", "2 tbsp chopped fresh chervil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the linguine, season the flour with salt and freshly ground black pepper. Blend the flour and eggs in a food processor until the mixture forms small crumbs. Turn the mixture out onto a lightly floured work surface and knead for 2-3 minutes, or until the dough is smooth and elastic.", "Wrap the pasta dough in cling film and chill in the fridge for 20 minutes.", "To make the linguine, weigh out about 300g/11oz of the pasta dough (the remaining pasta dough can be stored in the fridge for up three days or in the freezer for up to three months). Lightly flour a clean work surface and work the rested dough into a rough rectangle shape using your fingers.", "Flour the pasta machine. Starting at the lowest (widest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-widest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time, until the pasta is thin and smooth.", "Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the cutting attachment to the pasta machine, flouring it well. Run each sheet of dough through the machine once again, cutting it into linguine. Dust the linguine well with flour and place onto a plate. Chill in the fridge while you make the sauce.", "For the lobster sauce, cut the lobsters in half lengthways and remove the meat. Chop all of the meat except the claw meat into small pieces. Reserve the claw meat and lobster shells.", "Heat half of the butter in a frying pan until foaming, add the onion, carrot and thyme and cook for 2-3 minutes, or until softened but not coloured.", "Add the reserved lobster shells, cayenne pepper and tomato purée and cook for a further minute, stirring well.", "Add the white wine and brandy to the pan. Carefully set the alcohol alight with a match and allow the flames to flare up and die down. (CAUTION: make sure there are no flammable materials above the pan when flaming and keep the pan away from your face and hair.)", "Add the chicken stock, bring the mixture to the boil, then reduce the heat and simmer for 30 minutes, until reduced and thickened.", "Set the sauce mixture aside to cool slightly, then transfer to a food processor and blend to a purée. (You may need to do this in batches.)", "Pass the puréed sauce through a sieve into a clean saucepan and whisk in the cream. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "Heat the remaining butter in a frying pan and fry the reserved lobster claw meat for 1-2 minutes on each side.", "Meanwhile, cook the linguine in a large pan of boiling, salted water for 2-3 minutes, or until al dente. ", "Drain the linguine and return it to the saucepan. Add the chopped lobster meat, diced tomatoes and chervil. Season, to taste, with salt and freshly ground black pepper.", "To serve, pile the linguine into serving bowls and top with one lobster claw. Ladle the lobster sauce around and over the pasta."]}, {"isVegetarian": false, "title": "Homemade marshmallows with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_homemade_marshmallows_33473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb granulated sugar", "1 tbsp liquid glucose", "2 large free-range egg whites", "9 sheets gelatine, soaked in 140ml/4¾fl oz water", "1 tsp vanilla extract", "vegetable oil, for greasing", "5-6 tbsp icing sugar, for dusting", "5-6 tbsp cornflour, for dusting", "75g/2¾oz caster sugar", "200g/7oz dark chocolate, roughly chopped"], "serves": "Makes 450g/1lb", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the marshmallows, place the granulated sugar, glucose and 200ml/7fl oz of water into a heavy-bottomed saucepan and bring to the boil.", "Cook over a medium high heat until a sugar thermometer shows 127C/260F.", "Place the egg whites into a clean grease-free bowl and whisk to firm peaks.", "Add the soaked gelatine sheets and water to the hot sugar syrup very carefully. Stir through, then pour into a jug.", "Continue to whisk the egg whites, then pour the sugar syrup onto the egg whites, whisking all the time until the whites are shiny.", "Add the vanilla extract and continue to whisk for about 5-10 minutes, or until the mixture is thick enough to hold its shape on a whisk.", "Lightly oil a shallow 30x20cm/12x8in baking tray.", "Dust the tray with some icing sugar and cornflour, then spoon the mixture into the tray, smoothing the top with a wet palette knife.", "Place in the fridge for at least one hour to set.", "Dust some more icing sugar and cornflour over the work surface.", "Loosen the edge of the marshmallow, then turn out onto the dusted work surface.", "Cut into squares and roll in the icing sugar and cornflour to coat totally. Carefully place the marshmallows onto a skewer.", "Either place on a hot griddle, under a grill, over an open fire or into a tandoor and grill for 1-2 minutes, or until slightly charred and gooey.", "For the chocolate sauce, place the sugar and 110ml/4fl oz water into a saucepan and bring to a simmer.", "Cook for 1-2 minutes, or until all the sugar has dissolved, then add the chocolate.", "Whisk until smooth and then remove from the heat.", "Serve the marshmallows with the chocolate sauce in a bowl on the side."]}, {"isVegetarian": false, "title": "Homemade puff-pastry and wild boar sausage rolls", "url": "www_bbc_co_uk_food_recipes_homemade_puff-pastry_38790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "pinch salt", "300g/10½oz chilled unsalted butter, 50g/1¾oz cut into cubes, the rest left in a block", "25g/1oz unsalted butter", "1 onion, chopped", "3 garlic cloves, chopped", "50ml/2fl oz brandy", "500g/1lb 2oz minced wild boar (available from farm shops and online specialists)", "6 sprigs fresh tarragon, leaves roughly chopped", "2 free-range egg yolks, lightly beaten", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, tip the flour and salt into a large bowl, add the cubes of butter and rub the butter into the flour using your fingertips, until the mixture resembles breadcrumbs.", "Gradually stir in 150ml/5fl oz cold water, until the mixture comes together as a soft dough (you may not need all the water). Use your hands to pat the dough into a 2cm/¾in-thick rectangular block.", "Roll out the dough onto a lightly floured work surface to a rectangle measuring about 30x20cm/12x8in. ", "Sandwich the remaining block of butter between two pieces of greaseproof paper. Using a rolling pin, roll or bash it out to a rectangle measuring about 15x20cm/6x8in.", "Place the flattened butter into the centre of the rolled pastry. Fold one edge of the pastry over the butter to half-cover it, then fold the other edge of the pastry over the butter to cover the other half, so that the two edges of pastry meet. Pinch together the top and bottom edges of the pastry to seal the butter inside. ", "Fold the pastry in half lengthways, then turn the pastry 90 degrees to the right (a quarter-turn).", "Roll out the pastry again to a rectangle measuring about 30x20cm/12x8in. ", "Fold the pastry as before, bringing each edge into the centre so that the edges meet, then folding in half lengthways, before giving the pastry a quarter-turn.", "Repeat the rolling and folding process once more, then wrap the pastry in cling film and chill in the fridge for one hour.", "Meanwhile, for the filling, heat the butter in a frying pan over a medium heat. When the butter is foaming, add the onions and garlic and fry for 4-5 minutes, or until softened. ", "Add the brandy, then stand back and set the pan contents alight with a long match. (CAUTION: Do not flame the pan ingredients with the extractor fan running. Keep your hair and face away from the flames.) Allow the flames to flare up and die down, then transfer the pan contents to a large bowl and set aside to cool. ", "When the onion mixture has cooled, add the minced wild boar and tarragon and mix well, then season generously with salt and freshly ground black pepper.", "Preheat the oven to 230C/210C Fan/Gas 8. Line a baking tray with baking parchment.", "Roll out the puff pastry on a lightly floured work surface to a rectangle measuring about 40x30cm/16x12in and about 5mm/¼in thick. ", "Cut the pastry in half lengthways to create two rectangles measuring 40x15cm/16x6in.", "Divide the filling mixture into two and form a line of filling down the length of each sheet of pastry, making sure the filling mixture is slightly off-centre. ", "Brush the narrow edge of the pastry rectangles with the beaten egg. Fold the wider edge of the pastry rectangle over the filling and press it against the narrow edge of the pastry, crimping to seal and trimming the pastry if desired. ", "Transfer the sausage rolls to the prepared baking tray, seam-side down. Brush the tops with the remaining beaten egg. Bake in the oven for 20-30 minutes, or until the pastry has risen and is golden-brown and the filling is cooked through.", "To serve, cut the wild-boar sausage rolls into slices and pile onto a platter. Serve hot or cold."]}, {"isVegetarian": false, "title": "Homemade puff pastry sausage rolls", "url": "www_bbc_co_uk_food_recipes_homemade_puff_pastry_72461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/1lb 4oz plain flour, plus extra for dusting ", "¾ tsp salt", "200ml/7fl oz cold water", "2 tsp lemon juice", "550g/1lb 4oz unsalted butter, soft enough to be pliable", "2 tsp dried mixed herbs ", "sea salt and freshly ground black pepper", "700g/1lb 9oz minced pork", "1 tbsp Worcestershire sauce", "1 tsp chopped fresh sage", "1 tsp chopped fresh thyme leaves", "100g/3½oz breadcrumbs", "egg wash (1 free-range egg, lightly beaten in a bowl)"], "serves": "Serves 9-12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour and salt in a large mixing bowl. Add the water and lemon juice. Mix to combine and then tip out onto a floured work surface. Briefly knead to form a rough, but evenly combined, dough. ", "Place the pastry in the fridge to rest for 1-2 hours.", "On a lightly floured work surface, roll the pastry out into a rectangle approximately 50x30cm/20x12in. Slice the butter and lay this over two-thirds of the dough. Fold the unbuttered dough third over the buttered one, then flip that over the remaining buttered third so that the butter is wrapped inside the dough. Take a rolling pin and lightly roll the upper surface of the dough to press out any air bubbles. Seal the edges with a sharp whack of the rolling pin.", "Give the pastry what is known as one single turn – fold the bottom third of the pastry up, then the top third down. Roll the pastry out towards the folded edges until it measures roughly 60x25cm/23x10in, then fold the pastry in by thirds again. ", "Give the pastry a further two turns, without resting in between. Place the pastry on a plate, cover with cling film and transfer to the fridge to chill for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6 and line a baking tray with baking paper.", "For the filling, in a bowl combine the dried herbs, salt and pepper, pork mince, Worcestershire sauce, sage and thyme. Stir, then add breadcrumbs. Mix well.", "Remove the pastry from the fridge and roll it into a fairly shallow rectangle at least 24cm/9½in long. If necessary, trim the edges to make a neat rectangle.", "Roll the meat into a long, thin sausage, approximately the same length as the pastry. (Don’t make it too thick or the sausage will not cook.)", "Place the sausage on the pastry and roll the pastry around the sausage. Brush some egg wash on to seal the edge of the pastry. Trim any the excess pastry and discard.", "Cut the sausage roll into three equal parts, then divide each part into three or four mini sausage rolls. Brush with egg wash all over the top.", "Place the rolls on the lined baking tray and bake for 20 minutes, or until puffed and golden-brown."]}, {"isVegetarian": true, "title": "Homemade ricotta with broad bean salad", "url": "www_bbc_co_uk_food_recipes_homemade_ricotta_with_55585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 litres/5¼ pints whole milk", "1.5 litres/2½ pints double cream", "8 lemons, juice only", "2 sprigs thyme ", "2 sprigs rosemary ", "2 garlic cloves", "salt and freshly ground black pepper", "extra virgin olive oil, to serve", "100g/4oz fresh peas, podded", "100g/4oz broad beans, podded", "1 bunch asparagus, chopped", "½ fennel bulb, shaved", "1 punnet pea shoots", "salt", "25ml/1¾fl oz pomace oil or olive oil", "25ml/1¾fl oz extra virgin olive oil", "1 tbsp sherry vinegar", "1 garlic clove, grated", "1 tsp Dijon mustard", "1 orange, zest only", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the ricotta, place the milk, cream, thyme, rosemary and garlic in a medium saucepan and heat through to infuse the milk. Pass through a fine sieve.", "Place back on the heat in a new saucepan and season with salt. Bring to a simmer and add the lemon juice. Do not whisk. The milk infusion will split on its own.  Remove from the heat, set aside for 30 minutes.", "Place a sieve over a large bowl and line with muslin. Pour the split milk mixture into the sieve and place in the fridge for 6 hours. Discard the whey and place the curd in the fridge.", "For the broad bean salad, heat a large saucepan of boiling water and season with salt. Blanch the peas, broad beans and asparagus for 3-5 minutes, plunge in cold water to cool then drain. Mix the vegetables in a bowl, then add the fennel and pea shoots. ", "For the dressing, place the ingredients into a bowl and whisk to combine. Pour the dressing over the salad and mix just before serving.", "To serve, spoon ricotta onto a plate, dress with some black pepper, sea salt and extra virgin olive oil and place some of the salad alongside. "]}, {"isVegetarian": false, "title": "Homemade sausage rolls", "url": "www_bbc_co_uk_food_recipes_homemade_sausage_rolls_60543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_sausage_rolls_60543_16x9.jpg", "ingredients": ["50g/1¾oz butter ", "6 pork sausages", "6 large sheets filo pastry, room temperature (ideally remove from the fridge 20 minutes before needed)", "sea salt and freshly ground black pepper"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/190C Fan/Gas 7 and line a baking tray with greaseproof paper.", "Melt the butter in a small saucepan over a low heat and season with salt and pepper. Meanwhile, make a slit along the side of the sausages, peel the skin off and discard.", "Lay a sheet of filo pastry on a clean work surface and brush with the melted butter. Layer another sheet on top and brush with more butter. Lay two sausages along the shortest edge of the filo, then roll it up to form a long sausage. Cut into four pieces and place onto the baking tray. Repeat this step another two times.", "Brush the tops of the rolls with any remaining butter and bake in the oven for 25 minutes until cooked through and golden-brown."]}, {"isVegetarian": false, "title": "Homemade tandoori chicken", "url": "www_bbc_co_uk_food_recipes_homemade_tandoori_63396", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_tandoori_63396_16x9.jpg", "ingredients": ["1.75kg/4lbs chicken drumsticks, skinned", "pinch salt ", "2 lemons, juice only", "500g/1lb 2oz plain yoghurt ", "3-4 tbsp tandoori spice mix ", "3-4 tbsps plain yoghurt", "pinch salt", "pinch sugar", "5 fresh mint sprigs", "1 green chilli, deseeded, sliced"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Cut deep incisions into the chicken flesh with a small, sharp knife. Place the chicken into a bowl and sprinkle over the salt and the juice of two lemons, massaging into the chicken until well coated. ", "Whisk the yoghurt and tandoori spice mix in a bowl until well combined. Pour the marinade onto the chicken and massage into the flesh. Cover with clingfilm and chill in the fridge overnight. ", "Preheat the grill to high.", "Lift the drumsticks from the tandoori mixture and gently shake off any excess. Place a wire rack over a roasting tin and lay the drumsticks upon it. Grill for 20 minutes, turning regularly, or until richly burnished and the chicken is cooked through. Add more lemon juice to taste.", "For the dip, place all of the ingredients into a food processor and blend until smooth. Serve alongside the chicken drumsticks."]}, {"isVegetarian": false, "title": "Homemade baked beans with cherry tomatoes, garlic and sausage", "url": "www_bbc_co_uk_food_recipes_homemadebakedbeanswi_85532", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ onion, chopped", "1 smoked garlic clove, chopped", "2 rashers pancetta, chopped", "200g/7oz tinned butter beans, rinsed and drained", "1 tbsp tomato purée", "2 tsp brown sugar", "dash Tabasco sauce", "2 tbsp red wine", "200g/7oz tinned cherry tomatoes", "1 smoked sausage, griddled and sliced", "2 slices ciabatta, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a small pan and fry the onion, garlic and pancetta for 4-5 minutes.", "Add the butter beans, tomato purée, sugar, Tabasco sauce, red wine and cherry tomatoes and simmer for 4-5 minutes.", "To serve, place the baked beans into a serving dish and top with the sausage and ciabatta."]}, {"isVegetarian": false, "title": "Classic cheeseburgers", "url": "www_bbc_co_uk_food_recipes_homemadebeefburger_83644", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadebeefburger_83644_16x9.jpg", "ingredients": ["540g/1lb 3oz minced beef chuck steak", "25g/1oz chopped coriander", "1 onion, chopped", "1 tbsp Dijon mustard", "1 free-range egg yolk", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 slices mature Cheddar", "4 tbsp mayonnaise", "½ iceberg lettuce, shredded", "4 ciabatta rolls", "1 red onion, sliced", "1 beef tomato, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the burger ingredients in a mixing bowl and stir to combine. Using your hands, shape into four equal-sized patties.", "Preheat the grill to hot. Cook the burgers under the grill for 15 minutes, or until cooked through, turning once.", "Top each burger with a slice of cheese towards the end of the cooking time.", "Before serving, mix together the mayonnaise and lettuce. Cut the ciabatta rolls in half and toast under the grill on both sides.", "Top the bottom halves of the ciabatta rolls with the lettuce and mayonnaise, followed by a slice of tomato.", "Arrange the burger and cheese on top of the ciabatta, followed by a slice of red onion. Top each burger with the other halves of the ciabatta rolls and serve."]}, {"isVegetarian": false, "title": "Homemade chicken stock", "url": "www_bbc_co_uk_food_recipes_homemadechickenstock_71470", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.8kg/4lb chicken carcass (roasted or un-roasted), cut into pieces", "2 small onions", "2 cloves", "2 carrots", "2 leeks", "1 stalk celery", "3 cloves garlic", "3 large sprigs parsley", "2 sprigs thyme", "1 bay leaf", "1 tsp coarse salt", "10 peppercorns", "2 litres/3½ pints water"], "serves": "Makes 1.3 litres", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place all ingredients in a stockpot or any large pot, bring to boil and cook for 2-3 hours, skimming regularly.", "Strain and use straight away, or allow to cool and place in airtight containers.", "The stock can then be frozen until needed or kept in the refrigerator for a few days."]}, {"isVegetarian": true, "title": "Homemade chocolate Easter eggs", "url": "www_bbc_co_uk_food_recipes_homemadechocolateeas_4891", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadechocolateeas_4891_16x9.jpg", "ingredients": ["300g/10½oz dark chocolate (70% cocoa solids) or milk chocolate", "icing for piping Easter eggs "], "serves": "Makes 6-8 eggs", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Polish the inside of each mould with a piece of paper kitchen towel. Then dampen a piece of kitchen towel with a little flavourless oil, sunflower will do, and polish the inside of each mould with the oil. This ensures a highly polished finish to the chocolate and also helps to release the set chocolate from the mould.", "It is essential to  temper  the chocolate - this is a method of heating and cooling chocolate for coating or moulding. The heating and cooling separates the cocoa solids and ensures the set chocolate will have a high gloss and smooth finish. To temper the chocolate you will need a cooking thermometer, a heat-proof bowl and saucepan of hot water. Break the chocolate into small, even pieces and melt gently in a bowl over a saucepan of hot, not boiling, water. Place the thermometer into the chocolate and heat until it reaches 43C/110F. Take off the heat and cool to 35C/95F. Now it is ready to use.", "Pour spoonfuls of the chocolate into each mould. Swirl around until coated, use the pastry brush if necessary and then remove excess chocolate. Leave to set, flat side down on a surface, like a large tray, covered in greaseproof paper. Fill each mould in the same way. You will have to repeat the process another two or three times to build up a good layer of chocolate in each mould. Wait for about 20 minutes for the chocolate to set in between layers. Draw a clean ruler or the flat edge of a knife across the chocolate to ensure a clean edge every time you add a layer. This is important so that the two sides of the egg stick together evenly. Leave to chill in a larder or cool place until set.", "Carefully un-mould the egg halves and place on a clean surface taking care not to handle the chocolate too much as it will start to melt from the heat of your hands.", "To stick the two edges of an egg together, heat a baking sheet and then place the edges of two halves on it for a few seconds, then gently push the edges together.", "To decorate the eggs, sit an egg in a glass or small cup and use as a stand while you pipe your desired message on the egg. You can wrap your eggs in cellophane wrap and label them to give away or place them in a basket and offer them to guests."]}, {"isVegetarian": true, "title": "Homemade cranberry biscotti", "url": "www_bbc_co_uk_food_recipes_homemadecranberrybis_84810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz plain flour, plus extra for flouring", "1 lemon, zest only", "1 orange, zest only", "50g/1½oz caster sugar", "50g/1½oz fresh cranberries", "2 free-range eggs"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a baking sheet in the oven at 200C/400F/Gas 6.", "Place all the ingredients into the bowl of a food processor and blend until the ingredients have combined and formed a dough.", "Place the dough onto a floured surface and shape the dough, with floured hands, into a long ciabatta shape.", "Place the ciabatta onto the hot baking sheet and bake for 15 minutes, or until cooked through and golden-brown in colour. Remove from the oven and allow to cool for two minutes.", "Cut diagonally into thin slices to make the biscotti.", "To serve, place the biscotti into a clean bowl."]}, {"isVegetarian": true, "title": "Homemade flatbread with spicy red pepper hummus", "url": "www_bbc_co_uk_food_recipes_homemadeflatbreadwit_85657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp coriander seeds, toasted in a dry frying pan ", "100ml/3½fl oz water", "250ml/9fl oz natural yoghurt", "1½ tsp dried yeast", "550g/1lb 3½oz strong plain flour, plus extra for dusting", "1 tbsp salt", "2 tbsp vegetable oil, plus extra for brushing", "400g/14oz canned chickpeas, rinsed and drained ", "4 garlic cloves", "50g/2oz tahini paste", "3 lemons, juice only", "100g/3½oz Peppadew peppers or sweet pickled chilli peppers from a jar", "extra virgin olive oil, to taste", "salt and freshly ground black pepper", "6 olives", "1 red chilli, chargrilled"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Toast the coriander seeds in a dry frying pan over a medium heat for 1-2 minutes, until they turn golden-brown.", "Transfer the toasted seeds to a pestle and mortar and lightly crush them.", "Place the crushed coriander seeds into a pan with the water and bring to the boil.", "Place the yoghurt into a bowl and add the yeast.", "Pour the coriander seeds and water into the yoghurt mixture and stir well.", "Add 200g/7oz of the flour and use your hands to combine well. Cover the bowl and leave to prove for 25 minutes (preferably somewhere warm, but this isn't essential).", "Turn the dough out onto a lightly floured surface. Add the salt, oil and remaining flour and mix well to completely combine.", "Place the dough back into its bowl, cover and leave to prove for one hour. (The dough should have nearly doubled in size.)", "Turn the dough out onto a lightly floured surface and knead it lightly for one minute.", "Divide the dough into six and roll into little balls.", "Roll each ball out flat to 10cm-12.5cm/4in-5in circles.", "Heat a griddle pan or large shallow pan. Brush each circle of dough with a little oil and cook the flatbreads for about 30 seconds on each side, or until golden-brown all over.", "For the hummus, place all of the hummus ingredients, except the oil, into a food processor and blend until smooth.", "With the food processor motor running, add a steady stream of oil, to loosen the mixture, until at the consistency of your choice.  ", "Transfer the hummus to a dish or bowl and garnish with the olives and chargrilled chilli.", "To serve, place the bowl of hummus onto a large plate and place the flatbreads around the bowl."]}, {"isVegetarian": false, "title": "Homemade jaffa cakes", "url": "www_bbc_co_uk_food_recipes_homemadejaffacakes_91480", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadejaffacakes_91480_16x9.jpg", "ingredients": ["2 free-range eggs", "50g/2oz caster sugar", "50g/2oz plain flour, sieved", "1 x 135g/4¾oz packet orange jelly, chopped", "1 tbsp orange marmalade", "125ml/4½fl oz boiling water ", "200g/7oz good quality dark chocolate, minimum 70 per cent cocoa solids, broken into pieces"], "serves": "Makes 12 cakes", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cakes, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the eggs and sugar to the bowl and beat continuously for 4-5 minutes, or until the mixture is pale, fluffy and well combined. ", "Add the flour, beating continuously, until a thick, smooth batter forms. ", "Half-fill each well in a 12-hole muffin tin with the cake batter. Transfer the tin to the oven and bake the cakes for 8-10 minutes, or until pale golden-brown and cooked through (the cakes are cooked through when a skewer inserted into the centre of the cakes comes out clean.) Remove from the oven and set the cakes aside, still in their tray, until cool. ", "Meanwhile, for the filling, in a bowl, mix together the jelly, marmalade and boiling water until the jelly has dissolved and the mixture is smooth. Pour the filling mixture into a shallow-sided baking tray or large dish to form a 1cm/½in layer of jelly. Set aside until completely cooled, then chill in the fridge until set. ", "When the jelly has set and the cakes have cooled, cut small discs from the layer of jelly, equal in diameter to the cakes. Sit one jelly disc on top of each cake. ", "Bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the chocolate and stir until melted, smooth and glossy, then pour over the cakes. Set aside until the melted chocolate has cooled and set."]}, {"isVegetarian": false, "title": "Homemade linguine with a mussel and tomato sauce and pesto", "url": "www_bbc_co_uk_food_recipes_homemadelinguinewith_93221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz type '00' flour (available in supermarket baking sections and some delicatessens), plus extra for dusting", "3 free-range eggs", "60g/2½oz fresh basil leaves, plus extra to serve", "50g/2oz pine nuts, toasted ", "50g/2oz parmesan, freshly grated", "1 garlic clove, peeled", "75ml/3fl oz extra virgin olive oil", "5 tbsp olive oil", "1 onion, finely chopped ", "1 stick celery, finely chopped", "2kg/4lb 4oz mussels, cleaned, beards removed (discard any mussels that remain open after rinsing)", "150ml/5fl oz white wine", "2 garlic cloves, peeled, finely chopped", "800g/1lb 12oz canned tomatoes", "6 fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the linguine, blend the flour and eggs in a food processor until they form small crumbs. Remove from the processor and knead on a lightly floured surface for 2-3 minutes, or until the dough is smooth and elastic.", "Cover the dough in cling film and chill in the fridge for 20 minutes.", "To make the linguine, weigh out about 300g/11oz of the pasta dough (you can store the remaining pasta dough in the fridge for up three days or in the freezer for up to three months). Lightly flour a clean work surface and work the rested dough into a rough rectangle shape with your fingers.", "Flour the pasta machine. Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time.", "Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the cutting attachment to the pasta machine, flouring it well. Run the sheets of dough through the machine once again, cutting them into linguine. Dust the linguine well with flour and place on a plate. Chill in the fridge while you make the sauce.", "For the pesto, blend the basil, pine nuts, parmesan and garlic in a food processor to a fine purée. Add the olive oil and continue to blend to a coarse paste.", "For the mussel and tomato sauce, heat 2½ tablespoons of the olive oil in a lidded frying pan over a medium heat. Fry the onion and celery for 1-2 minutes, or until softened.", "Add the mussels and white wine and cover the pan with its lid. Steam for 2-3 minutes, or until all of the mussels have opened. (Discard any mussels that have not opened.)", "Strain the mussels through a fine sieve into a bowl. Reserve the cooking liquid.", "Using your hands, discard the shells from half of the mussels and set the mussel flesh aside. (Set aside the remaining mussels in their shells too.)", "Return the pan the mussels were cooked in to the heat and add the remaining 2½ tablespoons of olive oil. Fry the garlic for 30 seconds, or until pale golden-brown.", "Add the reserved cooking liquid, canned tomatoes and basil and bring to the boil. Reduce the heat until the mixture is simmering and simmer for 8-10 minutes, or until the volume of the mixture has reduced by one third. Season, to taste, with salt and freshly ground black pepper and stir in all of the cooked reserved mussels.", "Meanwhile, bring a large pot of salted water to the boil. Remove the prepared linguine from the fridge and loosen it carefully with your fingers, to separate the strands. Cook the linguine in the boiling water for 2-3 minutes, or until just tender, then drain.", "Stir the cooked linguine into the mussel and tomato sauce.", "To serve, spoon the mussel and tomato linguine onto each of four serving plates and top each with a spoonful of pesto and a few basil leaves."]}, {"isVegetarian": true, "title": "Homemade open apple pie with cinnamon cream", "url": "www_bbc_co_uk_food_recipes_homemadeopenapplepie_90694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting", "200g/7oz cold butter, cubed", "1 free-range egg yolk", "2-3 tbsp water, to bind", "2 apples, peeled, cored and sliced", "2 tbsp caster sugar", "½ tsp ground cinnamon", "200ml/7fl oz double cream", "½ tsp ground cinnamon", "1 tbsp icing sugar, plus extra for sprinkling"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pie, place the flour and 175g/6oz of the butter into a food processor and pulse until the mixture resembles breadcrumbs. Add the egg, then add just enough water, one tablespoon at a time, to bind the mixture. Blend briefly to bring the mixture together as a dough. ", "Tip the dough out onto a floured work surface and knead gently. Shape into a ball and roll out into a flat circle with the thickness of a pound coin. Place onto a baking sheet lined with greaseproof parchment. ", "Arrange the sliced apple on the pastry, leaving a 2.5cm/1in gap around the edges, then sprinkle over the caster sugar and cinnamon and dot with the remaining butter. Draw the edges of the pastry up to form a crust and pinch to hold in place. Bake for 8-10 minutes in the oven, or until the pastry is golden-brown and crisp.", "For the cinnamon cream, whisk the cream together in a bowl with the cinnamon and icing sugar until soft peaks form when the whisk is removed. ", "Serve the apple pie with spoonfuls of the cinnamon cream and a sprinkle of icing sugar."]}, {"isVegetarian": true, "title": "Homemade mayonnaise", "url": "www_bbc_co_uk_food_recipes_homemademayonnaise_67195", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["290ml/½ pint groundnut oil", "2 eggs, yolks only", "1 garlic clove, crushed", "1 heaped tsp powdered mustard", "1 level tsp salt", "freshly milled black pepper", "1 tsp white wine vinegar"], "serves": "Makes 290ml/½ pint", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["First of all, put the egg yolks into the basin, add the crushed garlic, mustard powder, salt and a little freshly milled black pepper. Mix all of these together well. Then, holding the groundnut oil in a jug in one hand and an electric hand whisk in the other, adddrop of oil to the egg mixture and whisk this in.", "However stupid it may sound, the key to a successful mayonnaise is making sure each drop of oil is thoroughly whisked in before adding the next drop. It won't take all day, because after a few minutes - once you've added several drops of oil - the mixture will begin to thicken and go very stiff and lumpy. When it gets to this stage you need to add a teaspoon of vinegar, which will thin the mixture down.", "Now the critical point has passed, you can then begin pouring the oil in a very, very thin but steady stream, keeping the beaters going all the time. When all the oil has been added, taste and add more salt and pepper if it needs it. If you'd like the mayonnaise to be a bit lighter, at this stage addtablespoons of boiling water and whisk it in.", "Mayonnaise only curdles when you add the oil too quickly at the beginning. If that happens, don't despair. All you need to do is put a fresh egg yolk into a clean basin, add the curdled mixture to it (drop by drop), then continue adding the rest of the oil as though nothing had happened."]}, {"isVegetarian": true, "title": "Homemade pasta with rocket pesto", "url": "www_bbc_co_uk_food_recipes_homemadepastawithroc_85298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for flouring", "3 free-range eggs", "1 tbsp olive oil, plus extra for drizzling", "2 tbsp olive oil", "3 tbsp pine nuts", "1 garlic clove, peeled", "large handful rocket", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, place the flour, eggs and olive oil into a food processor and pulse until combined.", "Turn the dough out onto a lightly floured surface and knead briefly until smooth. Cut the dough in half and set one piece aside.", "Roll out one half of the dough until 1cm/½in thick, then feed it through a pasta machine. Start on the thickest setting, passing the sheet through several times and lowering the setting until it reaches the thinnest setting. Slice the pasta sheet into ribbons 1cm/½in wide. Repeat the process with the rest of the dough.", "Place the pasta into a large saucepan of boiling salted water and cook for 2-3 minutes, until al dente. Drain well, place into a large bowl and drizzle with olive oil.", "For the rocket pesto, place all the pesto ingredients into a small food processor and blend until smooth.", "To serve, pour the pesto over the pasta and stir well to coat. Place the pasta into two serving bowls."]}, {"isVegetarian": false, "title": "Homemade minestrone", "url": "www_bbc_co_uk_food_recipes_homemademinestrone_93768", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemademinestrone_93768_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 large onion, peeled, sliced", "150g/5½oz streaky bacon, diced", "4 celery stalks, chopped", "2 garlic cloves, peeled, finely chopped.", "2 carrots, peeled, diced ", "2 potatoes, peeled, diced", "1 litre/1 pint 15¼fl oz beef stock", "30g/1oz tomato purée", "400g/14 oz canned haricot beans, drained", "1 bay leaf", "1 tsp fresh thyme leaves", "handful chopped fresh parsley", "400g/14 oz tomatoes, chopped", "100g/3½ oz  spaghetti, broken into 2cm/1in pieces", "salt and freshly ground black pepper", "1 crusty white bread loaf, cut into thick slices", "1 tbsp olive oil", "200g/7oz mozzarella, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and fry the onion, bacon, celery, garlic and carrots for 2-3 minutes, or until softened. ", "Stir in the potatoes and fry for a further 2-3 minutes. Pour in the stock and bring the mixture to the boil. Stir in the tomato purée and simmer for 45 minutes.", "Add the haricot beans, herbs, chopped tomatoes and spaghetti and continue to cook until the pasta is tender. Season, to taste, with salt and freshly ground black pepper.", "For the croûtons, drizzle the bread with the olive oil.", "Heat a griddle pan until hot and fry the bread on one side for 2-3 minutes, or until golden-brown. Meanwhile, preheat the grill to high.", "Remove the bread from the pan and top the uncooked side with the mozzarella. Place under the grill for 2-3 minutes, or until the cheese is bubbling and golden-brown.", "To serve, ladle the soup into 4 soup bowls and top with a croûton."]}, {"isVegetarian": false, "title": "Homemade pork sausages with colcannon and apple sauce", "url": "www_bbc_co_uk_food_recipes_homemadeporksausages_85815", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fatty minced pork", "50g/2oz breadcrumbs", "1 free-range egg, beaten", "1 garlic clove, crushed", "1 tbsp chopped fresh parsley or marjoram", "3 tbsp olive or sunflower oil", "salt and freshly ground black pepper", "1.5kg/3lb 5oz floury potatoes, scrubbed ", "100g/3½oz butter", "500g/1lb 2oz green cabbage, outer leaves removed and discarded, inner leaves sliced", "250ml/9fl oz hot milk", "2 tbsp chopped fresh parsley", "1 large cooking apple, peeled, cored and roughly chopped", "1 tbsp water", "25-50g/1-2oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sausages, place all the ingredients, except the olive oil, into a bowl and mix thoroughly then season well with salt and freshly ground black pepper. (Fry a tiny bit of the mixture in a hot pan with a little olive or sunflower oil to check the seasoning. Add more if required.)", "Divide the mixture into 12 pieces and shape each one into a sausage shape. Place on a baking tray or plate and set aside until you want to cook them. (Chilling them for a day in the fridge is fine, or you can freeze them.)", "To cook the sausages, heat a frying pan on a low to medium heat, add two tablespoons of olive or sunflower oil and gently fry the sausages for 12-15 minutes, turning occasionally, until golden on all sides and completely cooked through.", "For the colcannon, cook the potatoes in boiling salted water for 10 minutes, then drain off three quarters of the water and continue to cook over a low heat until tender. ", "When cooked, drain all of the remaining water. Once just cool enough to handle, peel the potatoes, then mash with half of the butter.", "Heat a pan until hot and add the remaining butter, two tablespoons of water and the sliced cabbage. Cook over a medium heat for 5-7 minutes, stirring frequently, until just cooked through.", "Add the cabbage mixture to the potatoes, then add most of the hot milk and the parsley, keeping some of the milk back in case you do not need it all. Season, to taste, with salt and freshly ground black pepper, and beat until creamy and smooth, adding more milk, if necessary, to achieve your preferred consistency.", "For the apple sauce, place the apple in a small pan with the water. Cover with a lid and cook over a gentle heat, stirring occasionally, until the apple has broken down to a pulp. Add sugar to taste.", "To serve, place a spoonful of colcannon onto each plate and place a knob of butter into the centre to melt. Add three sausages to each plate and a spoonful of warm apple sauce alongside."]}, {"isVegetarian": true, "title": "Homemade scones", "url": "www_bbc_co_uk_food_recipes_homemadescones_73976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadescones_73976_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "1 tsp baking powder", "pinch salt", "25g/1oz caster sugar", "50g/2oz unsalted butter, slightly softened", "150ml/¼ pint milk", "1 egg, beaten, or plain flour, for brushing or dusting"], "serves": "Makes 8-10 scones", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pre-heat the oven to 220C/425F/Gas 7.", "Sift together the flour, baking powder and salt into a bowl. Stir in the sugar, add the butter and rub quickly into the flour, creating a fine breadcrumb consistency. ", "Add the milk, a little at a time, working to a smooth dough. ", "This is now best left to rest for 5-15 minutes before rolling.", "Roll out the dough on a lightly floured work surface until 2cm/¾in thick. Using a 5cm/2in pastry cutter, cut the dough, using one  sharp tap and not twisting the dough as you cut. Twisting the scone mix will result in an uneven rising.", "Once cut, the scones can be either brushed with the beaten egg for a shiny glaze, or dusted with the flour for a matt finish.", "Place the scones on a greased baking tray and bake in the pre-heated oven for 10-12 minutes until golden-brown. Allow to  cool slightly, and serve while still warm."]}, {"isVegetarian": true, "title": "Homemade tomato ketchup", "url": "www_bbc_co_uk_food_recipes_homemadetomatoketchu_81722", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, finely chopped", "¼ tsp coriander seeds", "¼ tsp cumin seeds", "pinch chilli flakes", "pinch ground ginger", "2 tomatoes, skinned, deseeded and finely chopped"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small frying pan over a medium heat. Add the onions and fry for 2-3 minutes, until softened.", "Place the coriander seeds, cumin seeds, chilli flakes and ginger into a pestle and mortar and grind to a powder.", "Add the ground spices and chilli flakes and tomatoes to the onions and simmer gently over a low heat for 10 minutes, or until the tomato has softened and become a sauce.", "To serve, pour into a bowl and leave to cool."]}, {"isVegetarian": false, "title": "Homemade tomato ketchup with chicken goujons", "url": "www_bbc_co_uk_food_recipes_homemadetomatoketchu_85534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/8fl oz cider vinegar", "1 bay leaf", "½ tsp ground coriander", "½ tsp ground cinnamon", "8 tbsp Demerara sugar", "1.5kg/3lb ripe tomatoes, quartered, seeds removed", "1 tsp salt", "1 tbsp English mustard powder", "1 garlic clove, crushed", "Tabasco sauce", "2 tbsp tomato purée", "½ tsp cornflour, if necessary", "125g/4½oz fresh fine breadcrumbs", "½ tsp cayenne pepper", "4 boneless and skinless chicken breasts, cut into strips", "50g/2oz plain flour", "3 medium free-range eggs, beaten"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato ketchup, place the vinegar, bay leaf, coriander, cinnamon and sugar into a heavy-based saucepan and bring to a gentle simmer.", "Add all of the remaining tomato sauce ingredients, except the cornflower, and bring to the boil, stirring occasionally to prevent any sticking or burning.", "Once boiling, reduce the temperature and simmer, stirring frequently, for 30 minutes. (NB: be careful the mixture doesn't burn or catch on the base of the pan as this will ruin the sauce.)", "Remove from the heat and allow to cool for a few minutes. Transfer to a food processor or liquidiser and blend until smooth. Push the sauce through a sieve into a bowl and allow to cool completely.", "If you find the ketchup is too thin once cold, place into a pan and boil until thickened, stirring frequently. If necessary, add half a teaspoon of cornflour mixed to a paste with water; this will prevent the tomato water separating from the ketchup, but be careful not to make it to starchy and too thick.", "For the chicken goujons, heat a deep fat fryer to 190C/375F.", "Mix the breadcrumbs and the cayenne pepper in a bowl and set aside.", "Dredge the chicken in the flour, then dip into the beaten egg.", "Dip the chicken into the spicy breadcrumbs, making sure all the chicken is coated thoroughly.", "Carefully place the goujons into the deep fat fryer in batches and cook for about 3-4 minutes, until crisp and golden brown and the chicken is completely cooked through. Carefully remove with a slotted spoon and drain onto kitchen paper. Repeat until all the goujons are cooked.", "To serve, place the chicken goujons onto a large serving plate with a bowl of tomato ketchup alongside."]}, {"isVegetarian": true, "title": "Celeriac soup", "url": "www_bbc_co_uk_food_recipes_homestyleceleriacsou_87169", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, crushed", "½ large potato, peeled, chopped", "½ celeriac, peeled, chopped", "salt and freshly ground black pepper", "300ml/½ pint hot vegetable stock ", "1 tbsp fresh chopped chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry over a gentle heat until softened. ", "Add the garlic and cook for one minute. ", "Add the potato and celeriac and season, to taste, with salt and freshly ground black pepper.", "Add the stock and cook for ten minutes, or until the potato and celeriac have softened. Remove the vegetables and stock from the heat and leave to cool for a few minutes, before blending with a stick blender. Alternatively do not blend fir a rustic style soup. ", "To serve, pour into a bowl and garnish with chopped chives."]}]