[{"isVegetarian": true, "title": "Pear tart", "url": "www_bbc_co_uk_food_recipes_peartart_87097", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "50g/2oz caster sugar", "4 pears, peeled and halved", "225g/8oz plain flour", "100g/3½oz unsalted butter", "25g/1oz caster sugar", "1 free-range egg", "1 tbsp milk, to bind, if required", "225g/8oz unsalted butter", "225g/8oz caster sugar", "4 free-range eggs", "1 lemon, zest only, finely grated ", "50g/2oz plain flour", "175g/6¼oz ground almonds", "100g/3½oz butter", "100g/3½oz caster sugar", "100g/3½oz dark chocolate", "1 tbsp cocoa powder", "½ tsp vanilla extract", "125ml/4fl oz water", "double cream"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter with the sugar in a large frying pan and cook until the sugar has dissolved and the mixture has become a golden-brown caramel.", "Add the pear halves and cook, turning once, until caramelised all over. Remove from the heat and set aside.", "For the pastry, place the plain flour, butter and sugar into a food processor and pulse together until the mixture resembles breadcrumbs.", "Add the egg and pulse until the mixture just comes together as a dough. Add a little milk if required. ", "Remove the dough from the food processor and roll to form a ball. Wrap in cling film and chill in the fridge for 40 minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Remove the dough from the fridge and unwrap. Roll the pastry out on a clean, floured work surface to line a 20cm/8in tart tin. Transfer to the oven to bake for ten minutes, or until golden-brown.", "For the filling, mix the butter and sugar together in a bowl until light and fluffy.", "Add one egg at a time to the butter mixture and mix well, before adding the next (this can be done in a food mixer) until all the eggs are mixed into the butter and sugar.", "Add the lemon zest, plain flour and ground almonds and mix well to combine.", "Spoon the filling into the baked pastry tin and press the caramelised pear halves into the filling, so that they are half-submerged.", "Transfer to the oven and bake for 30 minutes, or until the filling is cooked through.", "For the chocolate sauce, place the butter, sugar, chocolate, cocoa powder, vanilla extract and water into a clean pan over a medium heat. Bring to the boil and simmer for 15 minutes, stirring regularly, until the sauce is thick and glossy.", "To serve, cut a piece of tart and place on a serving plate, top with the chocolate sauce and drizzle over the double cream."]}, {"isVegetarian": true, "title": "Pear tarts with Poire William cream", "url": "www_bbc_co_uk_food_recipes_peartartswithpoirewi_85533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz ready-made puff pastry, rolled out to 5mm/¼in thick", "3 small pears, peeled and halved", "1 lemon, zest and juice only", "50g/2oz caster sugar", "6 tbsp apricot jam", "1 vanilla pod, split, seeds scraped out", "300ml/½ pint whole milk", "2 free-range egg yolks", "75g/3oz caster sugar", "20g/¾oz cornflour", "3 tbsp sweet pear liqueur, such as Poire William", "300ml/11fl oz double cream", "6 fresh mint sprigs"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tarts, cut out the puff pastry to fit six 10cm/4in tart cases. Line the cases with the puff pastry and place into the fridge for 30 minutes to chill.", "Prick the base of the pastry in each tart case with a knife, then line with baking paper and baking beans or rice and place onto a baking sheet. Transfer to the oven and bake blind for 15 minutes.", "Remove the baking paper and baking beans from the tart cases and return the tarts to the oven to bake for a further 5-8 minutes, until cooked through and golden. Remove from the oven and cool on a wire rack.", "Meanwhile, place the pears, lemon zest and juice and sugar into a pan and cover with water. Bring to the boil, then reduce the heat and simmer for 10-12 minutes, or until the pears are cooked and tender. Remove from the heat and allow to cool.", "For the cream, place the vanilla seeds and milk into a pan and bring to the boil.", "Meanwhile, place the egg yolks, sugar and cornflower into a bowl and mix well.", "Once the milk is boiling, pour onto the egg mixture and whisk vigorously. Pour the custard mixture back into the pan and bring back to the boil, stirring constantly.", "Once the mixture has reached boiling point, take the pan off the heat and allow to cool.", "Meanwhile, pour the pear liqueur into the cream and whip until soft peaks are formed when the whisk is removed.", "Fold the cream mixture into the custard gently, so as not to lose too much volume.", "Place the apricot jam into a saucepan with a teaspoon of water and warm through.", "Fill the cooled pastry cases with the pear liqueur cream.", "Place a poached pear half onto a board and cut into slices. Fan the pear slices slightly and gently place onto the cream.", "Pour the warm apricot sauce over the pears.", "To serve, place each tart onto a dessert plate and garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Peas à la français with poached eggs and toasts", "url": "www_bbc_co_uk_food_recipes_peas_a_la_franais_with_03769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz vegetable stock ", "50g/1¾oz butter ", "300g/10½oz frozen peas ", "2 Little Gem lettuce, 1 shredded, 1 cut into quarters lengthways ", "3 sprigs tarragon ", "salt and pepper ", "1 small baguette or baton, cut into 12 slices ", "4 eggs ", "1 tsp white wine vinegar "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the stock and butter in a large frying pan until simmering, stirring to mix. Add the peas and cook for two minutes, then add the Little Gem lettuce and two of the tarragon sprigs. Cook for 3-4 minutes, or until the lettuce has wilted, taste and season with salt and pepper to taste. Remove from the heat.", "Meanwhile toast the slices of bread either on a griddle pan, under a hot grill or in the toaster. Season with a pinch of salt and pepper on both sides.", "Heat a large, wide shallow pan of water. Break an egg in a teacup or ramekin. Whisk the vinegar and a pinch of salt into the water and gently drop the egg into the swirling water. Poach for 3-4 minutes or until the white is set and the yolk still runny (or until cooked to your liking). Remove with a slotted spoon and pat dry. repeat with the remaining eggs.", "Remove the tarragon sprigs from the peas.  Serve the peas on the toasts with a poached egg on top. Season the egg with a pinch of salt and pepper and garnish everything with roughly torn leaves from the remaining sprig of tarragon. Serve immediately. "]}, {"isVegetarian": false, "title": "Peas, mint, girolles and seared scallops", "url": "www_bbc_co_uk_food_recipes_peas_mint_girolles_and_53451", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz chicken stock ", "50g/1¾oz butter, plus extra for frying the scallops ", "sea salt", "black pepper", "150g/5½oz fresh peas ", "100g/3½oz girolles (chanterelle mushrooms)", "200ml/7fl oz double cream", "2 free-range egg yolks", "10 leaves fresh mint, chopped ", "4 large scallops (with or without roes, as preferred)", "1 banana shallot, finely sliced ", "olive oil, to taste ", "lemon juice, to taste ", "pinch sugar  ", "large handful pea shoots "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a pan, bring the stock and butter to the boil. Season with salt and pepper, add the peas and mushrooms and cook for 2-3 minutes, or until tender. ", "Remove the peas and mushrooms from the pan. Pour half the cream into the pan and bring to the boil. Cook until the volume of liquid has reduced to a sauce consistency. ", "Preheat the grill to hot.", "Put the egg yolks in a bowl and whisk in the reduced cream. Whisk the remaining cream until soft peaks form when the whisk is removed. Add the peas, mushrooms and the mint to the sauce, then add a spoonful of the whipped cream.", "Pour the mixture into a heatproof bowl and place under the grill for a few minutes, or until the vegetables are glazed and the sauce is bubbling.", "Heat a knob of butter in a frying pan until foaming. Place the prepared scallops in the hot pan and cook for a minute and a half on both sides, or until golden-brown and just cooked.", "In a bowl, mix the shallot with a little olive oil, lemon juice and a pinch of sugar. ", "To serve, divide the glazed peas and mushrooms between the serving plates. Place the scallops on top and put the shallot mix on top. Dress the plates with the pea shoots. "]}, {"isVegetarian": true, "title": "Pea, salted yoghurt and mint salad", "url": "www_bbc_co_uk_food_recipes_peasaltedyoghurtandm_91778", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peasaltedyoghurtandm_91778_16x9.jpg", "ingredients": ["200g/7oz peas, out of their pods", "1 long red chilli, seeds removed, finely chopped", "1 garlic clove, peeled, finely chopped", "½ lemon, juice only", "½ tbsp extra virgin olive oil", "sea salt flakes and freshly ground black pepper", "100g/3½oz firm, salted, strained yoghurt or fresh soft goats' cheese", "small handful fresh mint leaves, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the peas in a pan of boiling, salted water for 1-2 minutes, or until tender. Drain well, then refresh in cold water until cold. ", "In a large bowl, mix together the cooled, cooked peas, chilli, garlic, lemon juice and olive oil until well combined. Season, to taste, with salt and freshly ground black pepper.", "Break up the strained yoghurt or goats' cheese into bite-sized pieces and sprinkle over the pea mixture. Sprinkle over the mint leaves and mix lightly to combine. ", "Serve immediately."]}, {"isVegetarian": true, "title": "Pea soup", "url": "www_bbc_co_uk_food_recipes_peasoup_81686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, finely chopped", "75g/2½oz fresh peas", "150ml/5fl oz hot vegetable stock", "50ml double cream, plus 1 tsp extra, to serve", "salt and freshly ground black pepper", "fresh mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small saucepan over a medium heat. Add the onions and gently fry for three minutes, until softened. ", "Add the peas and stock, bring to the boil, then reduce the heat to simmer for 10 minutes.", "Add the double cream, salt and pepper and heat through for one minute. Pour into a food processor and blend until smooth.", "To serve, pour into a bowl and garnish with a swirl of double cream and a sprig of mint."]}, {"isVegetarian": false, "title": "Pea soup with blue cheese scones", "url": "www_bbc_co_uk_food_recipes_peasoupwithbluechees_81624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz self-raising flour", "1 tsp baking powder", "50g/1¾oz unsalted butter", "50g/1¾oz blue cheese", "1 free-range egg", "50ml/2fl oz milk", "1 tbsp olive oil", "1 garlic clove, chopped", "1 banana shallot, chopped", "200g/7oz peas", "300ml/10½fl oz hot chicken stock", "50g/1¾oz blue cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the blue cheese scones, place the flour, baking powder and butter into a food processor and blend.", "Add the cheese, egg and milk and blend again, until the mixture is just coming together.", "Bring the dough together with floured hands and roll onto a floured surface to 1cm/½in thickness.", "Using a 5cm/2in chefs' ring, cut five rounds out of the pastry, then brush them with milk.", "Place the rounds onto a baking sheet and place into the oven to bake for 15 minutes, or until risen and golden.", "To make the pea soup, heat the olive oil in a saucepan over a medium heat. Add the garlic and shallot and fry for two minutes to soften.", "Add the peas and cook for five minutes.", "Add the stock and blue cheese, bring to the boil, then reduce the heat to simmer for 10 minutes.", "Season, to taste, with salt and freshly ground black pepper, then blend with a hand blender until smooth.", "To serve, pour into a large cappuccino cup or small bowl and place onto a large plate with the scones piled alongside."]}, {"isVegetarian": true, "title": "Pea soup with croûtons", "url": "www_bbc_co_uk_food_recipes_peasoupwithcroutons_88481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "100g/3½oz fresh peas, podded", "300ml/10fl oz vegetable stock", "salt and freshly ground black pepper", "50ml/2fl oz double cream", "50g/2oz butter", "1 thick slice white bread, cubed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablepsoon of the olive oil in a saucepan and gently fry the onion for around 4-5 minutes, until turning translucent.", "Add the peas and stock, bring to a simmer and cook for about five minutes, or until the peas are tender. Season, to taste, with salt and freshly ground black pepper and stir in the cream.", "Allow to cool slightly then, using a hand blender, process the soup until smooth.", "Heat the remaining tablespoon of olive oil and the butter in a frying pan and fry the bread cubes, until golden-brown and crisp all over.", "Reheat the soup if necessary and serve in a bowl, with the croûtons scattered over the top."]}, {"isVegetarian": true, "title": "Pea soup with mint cream", "url": "www_bbc_co_uk_food_recipes_peasoupwithmintcream_88716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 banana shallots, finely chopped", "400g/14oz peas", "350ml/12fl oz chicken stock or vegetable stock", "150ml/5fl oz double cream", "salt and freshly ground  black pepper ", "1 lime, zest only", "2 tbsp mint, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a pan until hot, then add the butter and shallots and fry over a low heat for 2-3 minutes, until the shallots have softened but not coloured.", "Add the peas and stock and bring to the boil. Reduce the heat and simmer for 2-3 minutes.", "Allow the soup to cool for a few minutes, then carefully pour into a food processor and blend to a smooth purée. Return the soup to the saucepan.", "Add 110ml/4fl oz of the cream, and season well with salt and freshly ground  black pepper.", "Place the remaining cream into a bowl and whisk until soft peaks form when the whisk is removed.", "Fold in the lime zest and mint.", "Spoon the soup into serving bowls and add a spoonful of the lime and mint cream to the middle."]}, {"isVegetarian": true, "title": "Pecan and maple pinwheels", "url": "www_bbc_co_uk_food_recipes_pecan_and_maple_63294", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecan_and_maple_63294_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "10g/¼ oz fine sea salt", "50g/1¾oz caster sugar", "9g/⅓oz fast-action yeast ", "1 large free-range egg, plus one yolk, lightly beaten", "150ml/5fl oz full-fat milk, heated to 43C", "vegetable oil, for greasing", "250g/9oz unsalted butter, chilled ", "150g/5½oz pecans ", "85g/3oz light muscovado sugar, ", "2 tbsp maple syrup ", "30g/1oz unsalted butter, softened ", "1 large free-range egg beaten with 2 tbsp milk", "50g/1¾oz apricot jam", "2 tsp lemon juice", "150g/5½oz icing sugar, sifted", "2 tbsp boiling water", "½ tsp vanilla extract"], "serves": "Makes 12 large Danish pastries", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry dough, put the flour, salt and sugar on one side of a mixing bowl and the yeast on the opposite side. Add the eggs, egg yolk, warm milk and 80ml/2½fl oz water and mix for one minute using a fork until combined. Add a little more water if needed to form a firm dough.", "Dust a work surface with flour and turn out the dough. Dust with a little flour and knead for 5 minutes, then shape into a ball.", "Lightly oil a mixing bowl and a large piece of cling film. Put the dough in the bowl and cover with the cling film. Set aside in a warm place to prove for an hour, or until almost doubled in size. ", "For the filling, in a food processor, pulse 100g/3½oz of the pecans until fine. Transfer to a bowl and stir in the sugar, maple syrup and butter. Cover and leave at room temperature. Roughly chop the remaining pecans to use as a garnish.", "To make the pastry, sandwich the chilled butter between the open wrapper and a piece of cling film. Using a rolling pin, beat the butter until it is flattened to roughly 1.5cm/⅝in. Roll out the dough on a lightly floured work surface until 1cm/½in thick and roughly double the size of the butter. ", "Arrange the dough with a short edge nearest you and put the butter in the middle. Fold the top and bottom of the pastry over the butter so it is just overlapping. Press all the edges and sides together to ensure the butter is sealed within the pastry. Using a rolling pin, tap the dough from the middle upwards and from the middle downwards. This ensures the butter is evenly distributed.", "Roll out the pastry to a large rectangle approximately 1cm/½in thick. Turn dough so you have a long edge nearest you, then fold the right third into the middle and cover with the left third. Chill in the fridge for 30 minutes. Do this turning, folding and chilling three more times.", "Preheat the oven to 200C/180C Fan/Gas 6. Line two large baking trays with non-stick baking paper. ", "Roll out the dough to a 30x40cm/12x16in rectangle.  Using a pizza cutter or a sharp knife, cut the dough into 12 equal squares.", "To shape the pastry, cut a line from every corner almost into the middle of the square. Brush the tip of each corner with a little of the egg and milk mixture, and fold the alternate corners into the middle pressing down firmly, creating a pinwheel. ", "Transfer the pastries to the prepared trays. Using your finger, press down to create a hollow in the middle of the pastry for the filling.  Put 1 teaspoon of the ground pecan mixture into the centre of each pastry and scatter with a few chopped pecans to decorate. Cover the baking trays with cling film and set aside in a warm place to rise for 10 minutes.", "To finish, brush each pastry with egg wash and bake for 15–20 minutes, or until the pastry is crisp and golden-brown. ", "Meanwhile, for the apricot glaze, combine the apricot jam and lemon juice with 2 tablespoons water in a small saucepan. Slowly heat the mixture, stirring gently, until runny. Pass through a sieve and set aside. While the pastries are still warm brush them with the apricot glaze. ", "For the icing, mix the icing sugar, boiling water and vanilla extract together until smooth. Transfer to a piping bag fitted with a small plain nozzle and pipe lines across the cooled pastries to finish. "]}, {"isVegetarian": true, "title": "Sweet potato pecan pie", "url": "www_bbc_co_uk_food_recipes_pecan_pie_82855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour", "150g/6oz salted butter", "120g/4oz icing sugar", "3 free-range egg yolks", "1 tbsp whole milk ", "100g/3½oz pecans, finely chopped", "1kg/2lb 4oz peeled sweet potatoes, roughly chopped (about two large sweet potatoes) ", "170g/6oz caster sugar ", "1½ tsp ground cinnamon ", "1 whole nutmeg, grated ", "3 free-range eggs ", "6 tbsp condensed milk ", "¾ tsp vanilla extract ", "30g/1oz melted butter ", "300g/10½ oz  pecans "], "serves": "Makes 1 pie", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, lightly grease a 28cm/11in fluted loose-bottomed flan tin. Combine the flour, butter and icing sugar in a food processor and pulse until the mixture resembles fine breadcrumbs. Add the egg yolks and a splash of milk and pulse until the pastry just comes together. Bring the dough into a ball and wrap in cling film. Freeze for 10 minutes, then place in the fridge for a further 20 minutes.", "Bring a pan of salted water to the boil and add the sweet potatoes. Cook for ten minutes or until very tender. Drain and allow to cool slightly.", "When the pastry has chilled, roll it out to a thickness of ½cm/¼in, then transfer it to the greased tin, leaving a little pastry dangling over the edge. Use any leftover pastry to patch-up any holes. Press the chopped pecans into the pastry. Prick the base with a fork and chill in the fridge for 20 minutes.", "Preheat oven to 170C/375F/Gas 5.", "Cover the pastry case with baking parchment and fill with baking beans. Bake blind for 10 minutes, then remove the paper and beans and bake for a further 15 minutes. Cool the pastry case in the tin on a wire rack.", "Mash the cooked sweet potato very roughly. Stir in the sugar, eggs and spices. Then add the condensed milk, vanilla and butter and mix thoroughly.", "Pour the filling into the cooled case. Arrange the pecan halves on the top of the filling and sprinkle with ground cinnamon.", "Bake for 25 minutes, or until the filling is set. Leave to cool for 10 minutes, before removing the pie from the tin. Aloow the pie to reach room temperature before transferring to the fridge to chill."]}, {"isVegetarian": true, "title": "Mincemeat strudel", "url": "www_bbc_co_uk_food_recipes_pecanandmincemeatstr_87725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 sheets ready-made filo pastry ", "1 free-range egg, beaten with a pinch of salt added", "1 jar ready-made mincemeat", "pinch ground mixed spice", "single cream, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place a sheet of the filo on a large baking sheet and brush all over with the beaten egg. Place a second sheet of filo on top of the first and brush with egg, then top with the final filo sheet and brush with beaten egg. ", "Spoon the mincemeat along one edge of the layered filo sheets, then roll up the filo into a large sausage shape. Seal the edges securely, brushing with more beaten egg and dust lightly with the mixed spice.", "Bake for about 8-10 minutes until the pastry is cooked through and golden-brown. ", "To serve, transfer to a serving plate and serve at the table with a jug of pouring cream alongside."]}, {"isVegetarian": true, "title": "Pecan pie", "url": "www_bbc_co_uk_food_recipes_pecanpie_86028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecanpie_86028_16x9.jpg", "ingredients": ["110g/4oz unsalted butter", "110g/4oz golden syrup", "1 tsp vanilla extract", "225g/8oz brown sugar", "3 free-range eggs, beaten", "1 x 245g/8½oz shop-bought shortcrust pastry case", "285g/10oz pecan nuts, halved"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the butter, golden syrup, vanilla extract and sugar into a heavy-based saucepan over a low heat.", "When the butter has melted, remove the pan from the heat and leave to cool for 5-10 minutes.", "Add the beaten eggs to the mixture and stir well.", "Set aside a small handful of the pecan nuts. Arrange the remaining pecan halves evenly in the pastry case and carefully pour over the syrup mixture.  ", "Place into the preheated oven and bake for 40-50 minutes - the pie will be golden-brown, but the filling should still be slightly soft. ", "Leave the pie to cool on a wire tray. As the pie begins to set, decorate the top with the reserved pecan halves. Serve in slices."]}, {"isVegetarian": true, "title": "Pecan toffee cheesecake", "url": "www_bbc_co_uk_food_recipes_pecan_toffee_cheesecake_22876", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecan_toffee_cheesecake_22876_16x9.jpg", "ingredients": ["100g/3½oz pecans", "150g/5oz chocolate digestive biscuits, roughly broken", "75g/3oz butter", "375g/13oz caster sugar", "4 tbsp cold water", "150g/5oz white chocolate, broken into squares", "600g/1lb 5oz full-fat cream cheese", "150ml/5fl oz double cream", "2 free-range egg yolks", "4 free-range eggs", "300ml/10fl oz double cream"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Line a baking tray with greaseproof paper and lightly oil a 23cm/9in springform cake tin.", "Put the pecans and biscuits into a food processor and blend to a coarse powder. Melt the butter in a small pan and pour into the food processor with the motor running. Blend until the biscuits and butter are thoroughly combined. ", "Place the crumb mixture into the cake tin. Spread evenly over the base and press down lightly with the back of a spoon. Place the tin in the fridge and leave the base to set while you make the filling.", "For the filling, put 200g/7oz of the caster sugar in a saucepan with the cold water and heat gently until the sugar dissolves, stirring occasionally. Bring the liquid to the boil and cook for 4-5 minutes without stirring until the sugar syrup turns a deep golden brown. Swirl the caramel around the pan gently as it bubbles.", "As soon as the caramel is the colour of toffee, remove from the heat and carefully pour onto the lined baking tray. Tilt the tin so the caramel covers the base evenly. Leave to cool and set. ", "Melt the chocolate in a heatproof bowl over a pan of simmering water. Take off the heat and leave to cool for 20 minutes, but do not allow to set. ", "Preheat the oven to 180C/160C (fan)/Gas 4 and boil a kettle of water.", "Put the cheese, cream, remaining sugar, egg yolks and eggs in a food processor and blend until smooth. Gradually add the cooled chocolate with the motor running and blend until just mixed. ", "Crush the hardened caramel into small shards using the end of a rolling pin. Fold half of the caramel into the cheese mixture and pour gently on to the biscuit base. (Keep the rest on the tray, lightly covered with clingfilm in a cool place. Do not put in the fridge or the moisture will cause the caramel to soften.)", "Put a large piece of aluminium foil on the work surface. Place the tin in the centre of the foil and bring up the sides to create a foil bowl around the cheesecake.  ", "Place in a medium-sized roasting tin and add enough just-boiled water to rise 2cm/¾in up the sides of the tin. Carefully place the roasting tin in the centre of the oven and bake for 45-50 minutes. The cheesecake is ready when it is almost, but not fully, set. ", "When the cheesecake is ready, turn off the oven but leave the cheesecake inside for a further 30 minutes. (This will help prevent the surface cracking as the cheesecake cools.)", "Lift the cake tin from the water and peel off the foil. Put the cheesecake in the fridge, cover and chill for at least two hours before serving. ", "To serve, carefully release the tin and slide the cheesecake onto a flat serving plate or cake stand, using a palette knife to help you. Whip the cream until soft peaks form and spoon in big fluffy clouds over the cheesecake. Scatter the remaining shards of caramel on top. Serve in wedges. "]}, {"isVegetarian": true, "title": "Pecan pie with cardamom ginger ice cream", "url": "www_bbc_co_uk_food_recipes_pecanpiewithcardamom_67749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz muscovado sugar", "110g/4oz butter", "110ml/4fl oz honey", "140g/5oz pecans (65g/2½oz finely chopped, remainder left whole)", "1 egg, beaten ", "a pinch of ground cinnamon", "4 small deep sweet pastry tartlet cases, baked blind", "pecan halves, to decorate", "maple syrup, to decorate", "225g/8oz caster sugar", "4 eggs, yolk only", "170ml/6oz semi-skimmed milk", "170ml/6oz full-fat milk", "340ml/12fl oz double cream", "2 tsp vanilla extract", "1 heaped tbsp chopped stem ginger", "6-8 cardamom seeds, finely ground"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["First make the ice cream. In a mixing bowl, combine the caster sugar and egg yolks together. Beat the mixture until it is a thick yellow paste and set it aside. ", "Bring the semi-skimmed and the whole milk to a simmer in a heavy-based, medium-sized saucepan. Slowly beat the hot semi skimmed and whole milk mixture into the egg and sugar mixture. This mixture should be hot, but not boiling. ", "Return the mixture to the saucepan and simmer very gently, stirring constantly, for a few minutes until it thickens to a custard-like consistency. Strain the mixture into a large bowl, cool and chill overnight in a refrigerator. ", "The next day, stir in the double cream, vanilla, ginger and ground cardamom. Churn in an ice cream maker, following manufacturer's instructions, until frozen. Cover and freeze until required. ", "Preheat the oven to 170C/325F/Gas 3. ", "Make the pecan pies. In a saucepan, melt together the muscovado sugar and butter. Remove from the heat and stir in the honey, finely chopped pecans, beaten egg and cinnamon. Mix together thoroughly. ", "Pour the pecan mixture into the tartlet cases and top with the whole pecans. ", "Bake the pecan tarts for 20 minutes. ", "Serve the tarts warm from the oven topped with a scoop of the cardamom ginger ice cream. Decorate the serving plates with pecans and a drizzle of maple syrup."]}, {"isVegetarian": true, "title": "Peking-style vegetable dumplings", "url": "www_bbc_co_uk_food_recipes_pekingvegetabledumpl_91214", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pekingvegetabledumpl_91214_16x9.jpg", "ingredients": ["4 tbsp vegetable oil", "50g/1¾oz morning glory, finely sliced (available in some Asian markets; substitute spinach if unavailable)", "50g/1¾oz pak choi, finely sliced", "50g/1¾oz fresh shiitake mushrooms, finely sliced", "1 small red onion, finely sliced", "25g/1oz bamboo shoots, finely sliced", "50g/1¾oz bean sprouts", "small handful fresh coriander, finely chopped", "1 red chilli, seeds removed, finely chopped", "salt and freshly ground black pepper ", "8 circular wonton wrappers (for vegan versions, look for egg-free wrappers)", "1 tsp cornflour, mixed to a paste with 1 tsp water", "vegetable oil, to shallow fry", "ready-made hot and sour sauce, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half a tablespoon of the oil in a wok over a high heat. Add the morning glory, pak choi, shiitake mushrooms, red onion, bamboo shoots and bean sprouts and stir fry for 2-3 minutes, or until the vegetables have softened slightly. ", "Remove from the heat and add the coriander and chilli. Season with salt and freshly ground black pepper and allow to cool.", "Lay the wonton wrappers on a clean surface. Place one tablespoon of the fried vegetables in the centre of each wrapper. Using a pastry brush, brush the edges of each wrapper with the cornflour paste. Fold the sides together to create a semi-circular wonton shape.", "Place the wontons in a steamer over boiling water, and steam for six minutes. Remove and allow to cool.", "Heat the rest of the oil in a shallow pan until hot. Place the steamed wontons one by one into the hot oil and cook on one side until golden-brown. Remove with a slotted spoon and drain on kitchen paper before serving.", "Serve with hot and sour sauce."]}, {"isVegetarian": false, "title": "Peking-style duck with udon noodle soup", "url": "www_bbc_co_uk_food_recipes_pekingstyleduckwithu_83641", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp Chinese five-spice powder", "1 tbsp sesame oil", "3 tbsp hoi sin sauce", "3 tbsp brown sugar", "3 tbsp water", "1 tbsp dark soy sauce", "2 x 175g/6 oz duck fillets, skin on ", "1 litre/35fl oz chicken stock", "2 dried shiitake mushrooms, soaked in 200ml hot water for 20 minutes", "100g/4oz Chinese leaf, shredded", "1  tbsp light soy sauce", "1  tbsp rice wine", "1  tbsp rice vinegar", "200g/8oz flat udon noodles, cooked ", "3 spring onions, sliced on the diagonal", "40g/2oz bean sprouts", "1 large handful coriander, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Place all of the marinade ingredients into a shallow bowl and mix well to coat the duck. Marinate for as long as you can - preferably overnight, but anything more than 20 minutes will do.", "Heat a dry frying pan until just warm. Place the duck skin-side down and cook for 8-10 minutes, until golden brown.", "Turn up the heat, turn over the duck and cook for a further minute until crisp.", "Transfer to the oven and cook for 10-15 minutes.", "Remove from the oven and rest for five minutes, before slicing.", "For the noodle soup, pour the chicken stock into a saucepan and bring to a gentle simmer. Add the shiitake mushrooms and their soaking liquid, and the Chinese leaf.", "Add the light soy sauce, rice wine, rice vinegar and udon noodles to the pan. Bring to the boil.", "Scatter over the chopped spring onions, bean sprouts and coriander. Season to taste.", "To serve, ladle some of the noodle soup into a bowl, place the duck breast on top and serve straightaway."]}, {"isVegetarian": false, "title": "Pembrokeshire seafood", "url": "www_bbc_co_uk_food_recipes_pembrokeshire_seafood_29704", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pembrokeshire_seafood_29704_16x9.jpg", "ingredients": ["500g/1lb 2oz clams", "250g/9oz mussels, cleaned", "500g/1lb 2oz razor clams", "150ml/5fl oz white wine", "25g/1oz dulse butter (alternatively use salted butter)", "100g/3½oz samphire", "black pepper", "1 shallot, finely chopped", "1 garlic clove, crushed ", "100ml/3½fl oz cream", "2 tomatoes, skin and seeds removed, cut into 1cm/½in cubes ", "1 lemon, juice only", "10g red seaweed"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the shellfish by cleaning the shells and removing any beards from the mussels. Discard any with open shells that do not close when given a sharp tap.", "Place all the seafood in a large, hot pan. Add the white wine, cover with a lid and cook for 2-3 minutes. Discard any shells that have not opened.", "Strain and reserve the cooking liquor. Remove all the flesh from the shells and chop the white meat from the razor clams into 2cm/1in pieces. Place the razor clam shells onto a serving plate or flat stone.", "In the same pan, melt half of the butter and add the samphire. Season generously with pepper and cook for 1-2 minutes. Spoon the cooked samphire into the razor clam shells. ", "Add the remaining butter to the pan along with the shallot and garlic. Gently fry for 1-2 minutes, then add the reserved cooking liquor (taking care not add the dregs from the bottom of the bowl). Stir in the cream and simmer until the volume of liquid is reduced by half and the sauce is thick enough to coat the back of a spoon.", "To finish, add the seafood and tomatoes to the sauce and gently warm through. Season to taste with salt and pepper then add the lemon juice. ", "Spoon the sauce over the samphire and top with red seaweed to serve."]}, {"isVegetarian": false, "title": "Penang fish curry", "url": "www_bbc_co_uk_food_recipes_penang_fish_curry_70583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil", "15 Thai shallots (or 8 ordinary shallots), peeled and finely sliced", "2 x 160g/5¾oz cans coconut cream", "4 tbsp Thai yellow or red curry paste", "400g/14oz can coconut milk ", "2 lemongrass stalks", "8 fresh kaffir lime leaves, rinsed", "1-2 tbsp Thai fish sauce (nam pla) ", "2 tbsp palm sugar or soft light brown sugar", "150g/5½oz pea aubergines, washed well (or 150g/5½oz green beans, cut into short lengths)", "1 large red pepper and 1 large yellow pepper, seeds removed, cut into 3cm/1¼ chunks", "1kg/2lb 4oz skinless mixed fresh white fish fillets, such as hake, pollack and whiting", "200g/7oz mangetout, trimmed and rinsed", "handful coriander, leaves picked ", "handful Thai basil (or normal basil), roughly torn", "cooked rice, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a large non-stick wok or wide frying pan or over a medium-high heat. Add the oil and stir-fry the sliced shallots for 5-8 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "Return the pan to a low heat, add the coconut cream and the curry paste and cook for one minute, stirring constantly. Pour over the coconut milk and stir in 100ml/3½fl oz water. Bring to a gentle simmer.", "Put the lemongrass on a board and cut in half. Bash with a rolling pin to bruise and flatten the stalks – this will allow their flavour to escape more easily into your curry. Add the lemongrass, lime leaves, nam pla and sugar to the pan and cook for 1-2 minutes more, or until the sugar dissolves, stirring.", "Add the pea aubergines and simmer gently for eight minutes, stirring occasionally until almost tender. (If using green beans, cook for three minutes instead.) Stir in the peppers and cook for five minutes more, stirring regularly. The coconut curry sauce needs to be bubbling gently but constantly to cook the vegetables. ", "When the aubergines are tender, taste the curry sauce and add more Thai fish sauce if necessary. It needs to have a good balance of hot, salty, sour and sweet. At this point the curry sauce can be removed from the heat and left to stand before the fish is ready to be cooked.", "Cut the fish pieces into 3cm/1¼in chunks and season with ground black pepper. Stir the fish and mangetout into the curry and cook for a further five minutes. Turn the fish in the sauce every now and then at the beginning of the cooking time, but stop as soon as you see it beginning to flake. ", "The fish should look opaque rather than translucent when cooked and the curry should be thick and creamy but not so thick that it begins to burn on the bottom of the pan. If it does reduce too far, simply add a little extra water.", "Scatter the crisp shallots, coriander leaves and roughly torn Thai basil on the curry and serve immediately with cooked rice."]}, {"isVegetarian": false, "title": "Penne and sausage pasta bake", "url": "www_bbc_co_uk_food_recipes_penne_and_sausage_pasta_30949", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_and_sausage_pasta_30949_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, diced", "2 garlic cloves, chopped", "8 thick pork sausages, skin removed, meat crumbled ", "400g tin chopped tomatoes", "300ml/10½fl oz vegetable stock", "50g/1¾oz butter", "50g/1¾oz plain flour", "500ml/18fl oz milk", "400g/14oz penne pasta", "salt and pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6", "Heat a large frying pan over a medium heat. Add the oil and gently cook the onion with a pinch of salt for 4-5 minutes or until soft and translucent. Add the garlic and continue to cook for 2 minutes.", "Crumble in the sausagemeat and fry until coloured on all sides. Add the tomatoes and vegetable stock, season with a pinch of salt and pepper and turn down the heat. Gently simmer for 10 minutes while you make the white sauce.", "Melt the butter in a saucepan. Add the flour and stir to mix. Cook over a medium heat for 2-3 minutes, or until the mixture has taken on a biscuit-coloured appearance. Slowly add the milk, bit by bit, whisking as you add to prevent any lumps from forming. Season with salt and pepper and bring to a simmer. Cook for 5 minutes to thicken slightly then remove from the heat.", "Meanwhile cook the penne in a pan of salted boiling water according to the packet instructions. Once cooked, drain and pour into the pan with the sausage and tomato mixture. Mix well. Pour this into a medium-sized ovenproof baking dish. Pour over the white sauce and bake for 15-20 minutes, or until bubbling and golden."]}, {"isVegetarian": false, "title": "Penne carbonara", "url": "www_bbc_co_uk_food_recipes_penne_carbonara_98193", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp extra virgin olive oil", "300g/11oz pancetta, sliced", "3 free-range egg yolks", "50g/1¾oz parmesan, grated, plus extra for serving", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "350g/12oz fresh penne pasta", "3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot. Add the olive oil and pancetta and cook for 3-5 minutes, or until crisp. Remove the pancetta from the pan and set aside to drain on kitchen paper.", "Whisk the egg yolks, parmesan and cream in a bowl and season, to taste, with salt and freshly ground black pepper.", "Cook the penne according to pack instructions in a pan of salted boiling water.", "Drain the pasta and add it to the cream mixture, stirring continuously until smooth. Add the pancetta and parsley and stir until well combined.", "To serve, spoon pasta into warmed bowls and sprinkle with a little extra parmesan."]}, {"isVegetarian": true, "title": "Penne pasta with tomato fondant and roasted vegetables", "url": "www_bbc_co_uk_food_recipes_penne_pasta_with_87725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ butternut squash, peeled and cut into 3cm/1¼in chunks", "½ aubergine, cut into 3cm/1¼in chunks ", "1 large sweet potato, peeled and cut into 3cm/1¼in chunks", "1 courgette, cut into 3cm/1¼in chunks", "3 tbsp olive oil, plus extra for frying", "1 onion, finely chopped", "1 garlic clove, finely chopped", "400g/14oz tinned chopped tomatoes", "400g/14oz penne pasta", "100g/3½oz fine green beans, cut into 2cm/1in lengths, blanched", "2 tbsp roughly chopped flatleaf parsley", "100g/3½oz fresh breadcrumbs", "150g/5½oz strong cheddar cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the squash, aubergine, sweet potato and courgette in a large roasting tin and drizzle with with the olive oil. Roast in the oven for 20 minutes, or until soft and golden-brown.", "Heat a medium frying pan and add a little oil. Once hot, add the onion and garlic. Cook for 3-4 minutes until soft.", "Add the tinned tomatoes and cook for a further 15 minutes, or until reduced in volume by half.", "Meanwhile, place a large saucepan of water on the hob and add a pinch of salt. Once boiling, add the penne pasta and cook according to packet instructions. Once cooked drain and stir in the tomato sauce, roasted vegetables, green beans and parsley. Transfer to an ovenproof dish.", "Mix the breadcrumbs and cheese in a small mixing bowl, then sprinkle over the pasta.", "Bake in the oven for 15-20 minutes, or until golden-brown."]}, {"isVegetarian": false, "title": "Penne with anchovy, broccoli, chilli and garlic", "url": "www_bbc_co_uk_food_recipes_penne_with_anchovy_19322", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_with_anchovy_19322_16x9.jpg", "ingredients": ["400g/14oz dried penne pasta ", "1 x 50g/1¾oz tin anchovies in olive oil, oil reserved ", "2 garlic cloves, finely sliced ", "1 tsp chilli flakes (use half if you prefer less heat) ", "1 head of broccoli (about 350g/12oz), chopped into very small florets ", "salt and black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta according to packet instructions in a large saucepan of salted boiling water.", "Heat a large frying pan over a medium heat. Pour 1½ tablespoons (or as much as there is in the tin if it doesn’t make 1½ tablespoons) of the anchovy oil into the pan and, once hot, add the anchovies and the garlic, breaking the anchovies up with a wooden spoon as they cook. Cook gently until the anchovies have melted into a paste. Add the chilli flakes and mix well. Reduce the heat to low until the pasta is ready.", "When the pasta is two minutes away from being ready, add the broccoli to the pan with the pasta. Continue to cook for two minutes and then drain, reserving a cup of the cooking water. Tip the pasta and broccoli into the pan with the anchovies and stir well to coat everything in the anchovy sauce. If the anchovies are too thick or the pasta a little sticky, then add a dash of the pasta water, stir and continue to add until all the pasta is coated with the sauce.", "Taste and adjust the seasoning as necessary. Serve."]}, {"isVegetarian": true, "title": "Penne with peas and beans", "url": "www_bbc_co_uk_food_recipes_penne_with_peas_and_44307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_with_peas_and_44307_16x9.jpg", "ingredients": ["350g/12oz wholewheat penne", "1 tbsp extra virgin rapeseed oil or olive oil", "2 spring onions, finely chopped", "200g/7oz reduced-fat mascarpone cheese", "4 tbsp lemon juice", "400g/14oz frozen peas, thawed", "400g/14oz frozen baby broad beans, thawed", "1 small bunch of basil, roughly chopped, a few leaves reserved for garnish", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the penne in a large saucepan of boiling water for 10-12 minutes, or until al dente.", "Meanwhile, heat the oil in a large frying pan over a medium-low heat, add the spring onions and fry for 1-2 minutes or until softened. Stir in the mascarpone, lemon juice, peas, broad beans and basil. Season with salt and freshly ground black pepper and stir for 1-2 minutes or until bubbling.", "Drain the penne, reserving a little  of the cooking water. Stir the pasta into the peas and beans. Add a little of the pasta cooking water, if needed, to loosen the mixture. Garnish with basil and serve."]}, {"isVegetarian": true, "title": "Penne with roasted vegetable and tomato sauce", "url": "www_bbc_co_uk_food_recipes_penne_with_roasted_77840", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz penne", "400g tin chopped tomatoes", "2 tbsp extra virgin olive oil", "pinch onion powder", "pinch garlic granules", "½ tsp chipotle sauce, or to taste ", "250g/9oz frozen roasted Mediterranean vegetables", "freshly ground black pepper", "4 tbsp freshly grated Parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of salted water to the boil. Add the penne and cook according to the packet instructions, normally 10–12 minutes.", "Meanwhile, tip the tomatoes into a large saucepan. Add the oil, onion powder, garlic granules and chipotle sauce, stir well, then bring to the boil over a medium heat. Simmer for 2 minutes.", "Remove from the heat and blend until smooth using a stick blender. Return to the heat, stir in the roasted vegetables and cook for 2–3 minutes, or until bubbling.", "Drain the penne, reserving a little of the water, then tip the pasta into the sauce and stir. Add a couple of spoonfuls of pasta water to the pan, then season well with black pepper. ", "Serve sprinkled with grated Parmesan."]}, {"isVegetarian": false, "title": "Penne with sausage, pancetta and Swiss chard", "url": "www_bbc_co_uk_food_recipes_penne_with_sausage_26109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz Swiss chard", "2 tbsp olive oil", "1 small onion, finely chopped", "1 garlic clove, finely sliced", "75g/3oz sliced pancetta, cut into matchsticks ", "150g/5oz Tuscan sausages, skin removed, finely chopped", "50ml/2floz double cream", "pinch dried chilli flakes", "400g/14oz penne rigate", "sea salt and freshly ground black pepper", "freshly grated parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the ends of the Swiss chard and cut the green leaves off the white stems. ", "Cut the stems into fine matchsticks and blanch in boiling salted water for 1-2 minutes, or until soft. Drain and set aside. ", "Blanch the green leaves in boiling salted water for 4-5 minutes, then drain and chop roughly.", "Heat the olive oil in a large, heavy-based saucepan, add the onion and garlic and cook gently for 5-6 minutesm, or until soft. ", "Add the pancetta and sausage meat and cook over a low heat for 20 minutes, then drain off the excess fat. ", "Add the cream to the sauce and bring to the boil. Stir in the dried chilli and the blanched Swiss chard stalks and their leaves, then cook for 4-5 minutes. Season to taste, with salt and freshly ground black pepper.", "Cook the penne in a large pan of boiling water, according to packet instructions, until al dente. Drain, reserving a few spoonfuls of the cooking water. ", "Add the pasta to the sauce, mix well and add a little of the reserved water if necessary to loosen the sauce. ", "Cook gently for 2 minutes, then serve with freshly ground black pepper and grated parmesan."]}, {"isVegetarian": false, "title": "Penne all'Amatriciana", "url": "www_bbc_co_uk_food_recipes_penneallamatriciana_86982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 tbsp extra virgin olive oil", "1 onion, peeled and chopped", "4 slices streaky bacon, rind removed, chopped", "500g/1lb 2oz ripe cherry tomatoes, cut in half", "salt and freshly ground black pepper", "1 tsp salt", "2 litres/3½pints boiling water", "250g/9oz penne pasta", "20g/3/4 oz parmesan cheese, finely grated, to serve", "2 ciabatta rolls, cut in half", "1 garlic clove, peeled and cut in half", "extra virgin olive oil, for drizzling", "250g/9oz ripe cherry tomatoes, cut into quarters", "1 x 125g/4½oz ball buffalo mozzarella", "salt, to taste", "1 small bunch fresh basil, leaves only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the oil in a frying pan, add the onion and cook over a medium heat for about 2-3 minutes, until softened.", "Add the bacon to the pan and fry gently until lightly golden-brown, about ten minutes.", "Add the tomatoes to the pan and stir well.", "Reduce the heat and simmer until the tomatoes begin to break down, about five minutes. Season, to taste, with salt and freshly ground black pepper, but take care with the salt as the bacon is salty.", "For the pasta, place the salt into a saucepan of boiling water and add the penne.", "Boil for 8-10 minutes, or according to packet instructions, until al dente (the pasta should give some resistance when bitten into). Drain, then add to the pan with the sauce and mix well.", "Meanwhile, for the bruschetta, preheat the grill to medium. Toast the ciabatta halves on both sides.", "Lightly rub the cut sides of the garlic clove over the ciabatta halves.", "Drizzle generously with olive oil.", "Place the tomatoes on top of the ciabatta. Tear the mozzarella into pieces and place on top of the tomatoes.", "Season, to taste, with salt and drizzle over a little more olive oil. Tear the basil leaves into pieces and scatter over the top.", "To serve, divide the pasta between two bowls and sprinkle over the parmesan. Serve with the bruschetta with mozzarella."]}, {"isVegetarian": true, "title": "Penne al'arrabiata (pasta with a tomato and chilli sauce)", "url": "www_bbc_co_uk_food_recipes_pennealarrabiatapast_83813", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennealarrabiatapast_83813_16x9.jpg", "ingredients": ["6 tbsp extra virgin olive oil, plus an extra dash for cooking the pasta", "2 medium hot chillies, finely sliced", "2 garlic cloves, chopped", "handful basil leaves", "600g/1lb 5oz canned chopped tomato", "salt, to taste", "400g/14oz fresh penne pasta", "parmesan shavings (or similar vegetarian hard cheese), to serve"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan. Add the chilli and garlic to the pan. After about a minute, add the basil leaves and gently wilt them in the flavoured oil. ", "Remove the garlic, basil and chilli from the pan and set aside. Add the chopped tomatoes to the frying pan.", "Put the garlic, basil and chilli back in the pan with the tomatoes. Simmer for at least 10 minutes, until the sauce has thickened a little. Add salt to taste.", "Meanwhile, cook the pasta for a few minutes in large saucepan of boiling, salted water with a dash of olive oil. Drain the pasta and the tomato sauce to it. Serve with shavings of parmesan."]}, {"isVegetarian": false, "title": "Penne alla torrese", "url": "www_bbc_co_uk_food_recipes_penneallatorrese_65964", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penneallatorrese_65964_16x9.jpg", "ingredients": ["250g/9oz penne pasta,  previously cooked al dente", "150g/5oz pancetta, cubed", "1 medium red onion, sliced", "70g/3oz defrosted peas\t\t", "3 tbsp sun-dried tomato flavoured olive oil ", "1 tbsp chilli flavoured olive oil ", "salt, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan fry the onions, pancetta and peas in the sun-dried tomato flavoured olive oil.  ", "Allow to cook for apprimately  2 minutes until crispy.", "Blanch the pasta in boiling water for approximately 30-40 seconds, drain and immediately put in the sauce and mix well. ", "Drizzle chilli flavoured olive oil over the pasta and serve hot."]}, {"isVegetarian": true, "title": "Pasta with tomato and vodka sauce", "url": "www_bbc_co_uk_food_recipes_pennealpomodoroevodk_10819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb2oz pack of short dried pasta, such as farfalle, penne or fusilli", "200ml/7fl oz (approx.) jar of good quality tomato passata ", "2 tbsp of extra virgin olive oil", "2 cloves of garlic, sliced", "5 leaves fresh basil", "200ml/7fl oz of single cream ", "1 small glass of vodka", "60g/2oz of butter ", "1 tbsp crushed pepper ", "salt", "3 tbsp freshly grated parmesan"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the tomato sauce, heat the olive oil in a small saucepan. Add the chopped garlic and fry gently until golden. ", "Add the jar of tomato passata and season with salt and pepper. Add several fresh basil leaves and cook gently for about 10 minutes.", "While the sauce is simmering, bring a pan of salted water to the boil and cook the pasta until  al dente . Drain well .", "Meanwhile, in a large frying pan melt the butter, add the crushed pepper and the drained pasta. Toss well, making sure that all the pasta is well coated with butter. Keep the heat high and toss the pasta with a spatula, while adding the tomato sauce and the cream. Add the glass of vodka, toss again and turn the heat off; if the vodka evaporates, you will loose the taste of it.", "Sprinkle with parmesan and serve immediately."]}, {"isVegetarian": true, "title": "Penne arrabiata with avocado and rocket salad", "url": "www_bbc_co_uk_food_recipes_pennearabattiawithav_84013", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz penne pasta, cooked according to packet instructions", "1 tbsp olive oil", "1 garlic clove, finely chopped", "¼ red onion, finely chopped", "½ tsp dried chilli flakes", "1 tbsp tomato purée", "½ avocado, stone removed, sliced", "small handful rocket leaves", "1 tbsp olive oil", "½ tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients for the pasta into a serving bowl, mixing well to combine the ingredients.", "For the salad, place all the ingredients on a separate bowl, mixing together well. Serve alongside the bowl of pasta."]}, {"isVegetarian": true, "title": "Penne with chilli, garlic, herbs and olive oil", "url": "www_bbc_co_uk_food_recipes_pennewithchilligarli_88845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "3 tbsp fresh parsley leaves", "1 garlic clove, crushed", "1 tsp chilli flakes", "a pinch of salt", "150g/5½oz penne pasta, cooked according to packet instructions", "6 fresh basil leaves, torn", "a few shavings of fresh white truffle, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oil, parsley, garlic, chilli flakes and salt into a food processor and blend until smooth. ", "Stir the mixture into the cooked penne pasta, and pile onto a plate. Garnish with fresh torn basil leaves and the shavings of white truffle."]}, {"isVegetarian": false, "title": "Creamy pasta with cherry tomato and prosciutto", "url": "www_bbc_co_uk_food_recipes_penneprosciuttonestw_88842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "55g/2oz fresh peas", "6 cherry tomatoes, halved", "2 tbsp white wine", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "150g/5½oz penne pasta, cooked according to packet instructions", "4 slices prosciutto"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and lightly fry the peas and tomatoes for 3-4 minutes. Add the wine to the pan, bring to the boil, then pour in the cream and season, to taste, with salt and freshly ground black pepper. ", "Bring the sauce to a simmer and cook for 4-5 minutes, then stir through the cooked penne pasta. Tear the prosciutto into the pasta and serve in a warmed pasta bowl. "]}, {"isVegetarian": true, "title": "Penne with fresh green pesto", "url": "www_bbc_co_uk_food_recipes_pennewithfreshgreenp_88289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large handfuls fresh basil leaves", "2 garlic cloves, peeled", "75g/2½oz pecorino cheese, grated, plus extra to serve", "3 tbsp pine nuts, toasted", "4 tbsp olive oil", "salt and freshly ground black pepper", "125g/4½oz fresh penne pasta"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the basil leaves, garlic, grated pecorino and pine nuts into a blender and process, gradually adding the olive oil until the mixture reaches the desired consistency. Season with salt and freshly ground black pepper.", "Cook the fresh penne according to the packet instructions and drain, leaving a little of the cooking liquid in the bottom of the pan. Add the green pesto to the hot pasta and stir to coat.", "To serve, spoon into a serving dish and scatter with grated pecorino."]}, {"isVegetarian": false, "title": "Penne with prawns, tomato and crème fraîche", "url": "www_bbc_co_uk_food_recipes_pennewithprawnstomat_65890", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["255g/8oz cooked peeled prawns", "200g/7oz penne pasta", "mirepoix  (finely chopped vegetables) such as 1 onion, 1 celery stalk, 1 carrot, 1 clove of garlic", "½ pint fish stock (shop bought)", "½ glass white wine", "1 tbsp tomato purée", "1 bay leaf", "3 tbsp crème fraîche", "bunch fresh basil", "good handful parmesan", "1 lemon, juice only", "2 tbsp olive oil", "1 tbsp plain flour"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the penne for 8 minutes in boiling salted water, strain and toss in olive oil. ", "Preheat the olive oil in a pan and add the mirapois of onions, celery, garlic and carrot and cook until soft. ", "Add the flour and stir into the vegetables.", "Add the tomato purée, bay leaf, lemon juice, wine and reduce, then add the fish stock. Bring to the boil and reduce.   ", "Pass the liquid through a sieve and return to the pan. ", "Add the cooked prawns and bring back to the boil and add the crème fraîche.", "Add the cook penne and then  stir in half the parmesan and some torn basil leaves.", "Serve with a sprinkle of parmesan and some more basil."]}, {"isVegetarian": false, "title": "Tuna steak with penne, lemon and rocket", "url": "www_bbc_co_uk_food_recipes_pennewithlemonandroc_84012", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz penne pasta, cooked according to packet instructions", "1 tbsp olive oil, plus 1 tbsp ", "1 lemon, juice and zest", "small handful rocket", "55g/2oz fresh tuna steak", "sea salt and freshly ground black pepper", "½ tomato, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the hot pasta, olive oil, lemon and rocket into a serving bowl, mixing the ingredients together.", "Heat the extra oil in a frying pan on a high heat. Season the tuna, to taste, with salt and freshly ground black pepper on each side. Place the tuna into the frying pan and fry for two minute on each side, or until cooked to your liking.", "Remove the tuna from the frying pan and place on top of the pasta. Sprinkle the chopped tomato over the top to serve."]}, {"isVegetarian": true, "title": "Penne with halloumi and cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_pennewithhaloumiandc_92783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithhaloumiandc_92783_16x9.jpg", "ingredients": ["250g/9oz cherry tomatoes, on the vine", "1 tbsp olive oil", "1 red onion, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "1 red chilli, finely chopped", "250g/9oz halloumi cheese, cut into 1cm/½in cubes", "400g/14oz canned cherry tomatoes", "1 tbsp chopped fresh oregano leaves", "salt and freshly ground black pepper", "400g/14oz fresh penne, cooked according to packet instructions", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "75g/3oz rocket leaves", "1 head Little Gem lettuce, cut in half lengthways, leaves separated, washed", "75g/3oz lamb's lettuce", "3 tbsp freshly grated parmesan (or alternative vegetarian hard cheese)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, heat a frying pan until hot over a medium heat, add the fresh cherry tomatoes and fry for 4-5 minutes, or until just softened. Remove from the pan and set aside.", "Add the olive oil, red onion, garlic and chilli to the pan the tomatoes were cooked in and fry for 2-3 minutes.", "Add the halloumi cheese and cook for 1-2 minutes on each side, or until pale golden-brown on both sides. Add the canned cherry tomatoes and bring to the boil, then reduce the heat and simmer for 2-3 minutes. Add the fresh cherry tomatoes and oregano and cook for a further minute. Season, to taste, with salt and freshly ground black pepper.", "Add the cooked pasta to the pan and mix gently until well combined.", "For the salad, whisk the mustard and vinegar together in a bowl, then whisk in the olive oil. Season, to taste, with salt and freshly ground black pepper.", "Place all the salad leaves into a bowl and pour over the dressing. Stir until well combined.", "To serve, spoon the pasta onto four serving plates and sprinkle over the grated parmesan. Spoon the dressed salad alongside."]}, {"isVegetarian": false, "title": "Penne pasta with pancetta and parsley and Little Gem salad", "url": "www_bbc_co_uk_food_recipes_pennewithpancettaand_88250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices pancetta", "175g/6oz pancetta, cut into cubes", "250g/10½oz fresh penne pasta", "3 free-range egg yolks", "110ml/4fl oz double cream", "175g/6oz parmesan, grated, plus parmesan shavings, to serve", "salt and freshly ground black pepper", "6 tbsp flatleaf parsley, roughly chopped", "2 tbsp extra virgin olive oil", "3 slices crusty bread, cut into cubes", "4 tbsp extra virgin olive oil", "2 Little Gem lettuce, leaves separated", "1 tbsp red wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "For the pasta, place the pancetta slices onto a tray and place under the grill for 2-3 minutes, or until crisp and golden-brown.", "Meanwhile, heat a frying pan until hot. Add the pancetta cubes and cook for 3-4 minutes, until golden-brown all over.", "Bring a large pan of salted water to the boil and add the pasta. Cook according to packet instructions or until al dente.", "While the pasta is cooking, mix the egg yolks, cream and freshly grated parmesan together in a bowl. Season the mixture well with salt and freshly ground black pepper, then add the flatleaf parsley and cooked pancetta cubes.", "Drain the pasta and quickly add to the eggs and cream mixture. Add a little olive oil and check the seasoning, adding more salt and freshly ground black pepper if necessary.", "Spoon the pasta and sauce into bowls and top with parmesan shavings and a little extra freshly ground black pepper. Serve with the grilled pancetta slices on the top.", "For the salad, heat a clean frying pan until hot. Add one tablespoon of the olive oil and the bread cubes. Fry until golden-brown all over to make croûtons.", "Place the Little Gem leaves into a large salad bowl and add the croûtons.", "Whisk the remaining olive oil and the vinegar together in a clean bowl and season with salt and freshly ground black pepper.", "Pour the dressing over the salad, mix well to combine, and serve with the pasta."]}, {"isVegetarian": false, "title": "Penne with radicchio and pancetta", "url": "www_bbc_co_uk_food_recipes_pennewithradicchioan_8647", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet of penne", "4 shallots, chopped", "2 cloves garlic, chopped ", "olive oil", "2 packets of pancetta", "1 red chilli, chopped", "2 heads of radicchio", "glass white wine", "150ml/5fl oz vegetable stock ", "small tub double cream", "zest and juice of 1 lemon", "1 tbsp mascarpone ", "handful fresh parsley, chopped ", "shavings of parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the penne in a large pan of salted water, drain and return to the pan.", "While the pasta is cooking, sweat the onion and garlic gently in a little oil until just soft and remove from the pan. Turn up the heat and add the pancetta, chilli and radicchio. Cook for a few minutes.", "Add the wine, stock and reduce, add the cream and cook for a few minutes more. Add the mascarpone, lemon juice and zest and mix well.", "Add the radicchio mixture to the cooked pasta and stir well. Tip into a bowl, scatter with parsley and shavings of parmesan and serve immediately."]}, {"isVegetarian": true, "title": "Penne with spicy tomato and mozzarella sauce", "url": "www_bbc_co_uk_food_recipes_pennewithspicytomato_92443", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithspicytomato_92443_16x9.jpg", "ingredients": ["2 tsp olive oil", "1 onion, finely chopped", "3 garlic cloves, finely chopped", "1 red chilli, seeds removed, finely chopped", "400g tin chopped tomatoes ", "splash red wine vinegar ", "1 tbsp tomato purée", "Tabasco sauce, to taste", "1 tsp sugar", "small bunch fresh basil leaves, torn", "125g ball fresh buffalo mozzarella, crumbled", "400g/14oz dried penne pasta, cooked according to packet instructions, drained", "grated Parmesan, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the onion and fry for 4-5 minutes, or until softened and beginning to colour. Add the garlic and chilli and continue to fry for 1-2 minutes.", "Pour in the chopped tomatoes, red wine vinegar, tomato purée, a splash or two of Tabasco (to taste), sugar and half of the basil leaves, and stir well. Season with salt and pepper. ", "Bring the mixture to a simmer, then continue to simmer until the sauce has thickened and reduced in volume.", "Just before serving, stir the crumbled mozzarella into the tomato sauce. Then stir the drained pasta into the sauce. ", "Divide the pasta and sauce equally among four serving plates. Sprinkle over the remaining basil leaves and the grated Parmesan."]}, {"isVegetarian": true, "title": "Penne with spicy roasted pepper sauce", "url": "www_bbc_co_uk_food_recipes_pennewithroastedpepp_88288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 roasted red peppers from a jar, drained", "2 garlic cloves, chopped", "pinch dried chilli flakes", "1 tbsp tomato purée", "2-3 tbsp olive oil", "pinch dried oregano", "dash Tabasco sauce", "salt and freshly ground black pepper", "125g/4½oz fresh penne pasta", "grated pecorino, to serve", "fresh basil leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the roasted red peppers, garlic, chilli flakes, tomato purée, olive oil, oregano, Tabasco, salt and freshly ground black pepper into a mini blender and blend until almost smooth. Set aside.", "Cook the pasta according to the packet instructions and drain, leaving a little of the cooking liquid in the bottom of the pan. Add the roasted pepper sauce to the hot pasta and stir well.", "To serve, spoon into a serving bowl, scatter with grated pecorino and garnish with basil leaves."]}, {"isVegetarian": false, "title": "Penne with tomatoes, chorizo and cream", "url": "www_bbc_co_uk_food_recipes_pennewithtomatoesspi_73926", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithtomatoesspi_73926_16x9.jpg", "ingredients": ["450g/1lb penne pasta", "25g/1oz butter", "1 tsp finely chopped rosemary", "700g/1½ lb fresh ripe tomatoes, peeled, seeded and diced", "salt and freshly ground pepper ", "sugar, pinch of", "175-225g/6-8oz chorizo or kabanossi sausage", "pinch crushed chilies", "125-175ml/4-6 fl oz cream", "3 tbsp finely chopped flatleaf parsley", "4 tbsp freshly grated parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a sauce pan, add chopped rosemary and diced tomatoes. ", "Season with salt and pepper and sugar.", "Cook until the tomatoes have just begun to soften into a sauce, which takes about 5 minutes.", "Slice the sausage into 5mm/¼in rounds and add to the pan with the crushed chilies.", "Add the cream and two tablespoons of chopped flatleaf parsley, and allow to bubble for 3-4 minutes, stirring frequently until the cream has reduced by half. Remove the pan from the heat and set aside. ", "Cook the pasta until it is 'al dente', drain and stir into the sauce with the grated parmesan.", "Sprinkle with remaining flatleaf parsley, and serve."]}, {"isVegetarian": true, "title": "Spaghetti with garlic and chilli", "url": "www_bbc_co_uk_food_recipes_peperoncino_99009", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peperoncino_99009_16x9.jpg", "ingredients": ["200g/7oz dried spaghetti", "1 fat garlic clove", "handful fresh parsley leaves", "3 tbsp extra virgin olive oil ", "2 pinches dried chilli flakes, to taste", "sea salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Add 2 tablespoons salt to 2 litres water and bring to the boil in a large saucepan. Add the spaghetti and return to the boil quickly, then cook until al dente.", "Finely chop the garlic and parsley together. ", "Heat the oil in a frying pan over a low heat. Add the garlic and parsley and fry for 1 minute, or until the garlic is softened but not coloured. Add the chilli flakes and cook for 1 more minute. ", "Drain the spaghetti lightly, then add to the frying pan with the water still clinging to it. Mix to coat with the oil. Add a little extra cooking water if needed. Sprinkle the spaghetti with the parsley, toss, season with salt and serve. "]}, {"isVegetarian": true, "title": "Pepper boats", "url": "www_bbc_co_uk_food_recipes_pepper_boats_77216", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper ", "4 cherry tomatoes ", "1 tbsp olive oil ", "1 dessertspoon pine nuts ", "4 basil leaves", "30g/1½oz soft goats’ cheese", "pinch ground black pepper"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Preheat the oven to 200C/400F/Gas 6.", "Pop the pepper by pushing down on the stalk with your thumbs until you push it inside – then tear the pepper carefully to make two even-sized halves. These are your boats. Knock the pepper halves upside down to shake out all the seeds and pull off all the pale soft bits.", "Add the tomatoes into the bowl, then chop them up with scissors. Add the olive oil and a pinch of pepper and stir well.", "Sprinkle in the pine nuts and tear in the basil leaves, then give the mixture a good stir.  ", "Spoon half of the filling to each pepper boat. Finally, crumble the goats’ cheese on top of the tomato mixture.", "Bake for 20-25 minutes or until the cheese topping is golden-brown. Serve with crusty French bread."]}, {"isVegetarian": true, "title": "Pepper, tomato and basil pasta", "url": "www_bbc_co_uk_food_recipes_pepper_tomato_and_basil_74401", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pepper_tomato_and_basil_74401_16x9.jpg", "ingredients": ["3  peppers, red, yellow or orange", "handful cherry tomatoes ", "2 cloves of garlic, peeled", "2 tbsp olive oil ", "large bunch basil ", "400g/14oz pasta shapes (orecchiette is nice) ", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "Halve the peppers lengthways, trim out the seeds and membrane. Lay them in a fairly large roasting tin facing upwards. Halve the cherry tomatoes and place them inside the peppers. Finely slice the garlic and tuck them in with the tomatoes. Drizzle the peppers with olive oil, season, to taste, with salt and freshly pepper. Bake in the oven while you get on with the basil oil.", "Set aside a few sprigs of basil and blend the rest in a food processor with 3 tablespoons of olive oil and a little salt until you have a bright green basil oil. ", "When 30 minutes or so have passed and the peppers and tomatoes are beginning to soften, pour over the basil dressing. Return to the oven for a further 20 minutes or until the vegetables are slightly charred around the edges. Lift the peppers and tomatoes out of the tray with a slotted spoon and set aside. ", "Cook the pasta in boiling salted water according to the packet instructions. Drain.", "Tip the cooked, drained pasta into the roasting tin, and stir well to scrape up any caramelised peppers stuck to the pan. ", "Serve the pasta in bowls, tearing in the remaining basil. Spoon the roasted peppers and tomatoes on top."]}, {"isVegetarian": true, "title": "Pepper and sun-blushed tomato soup", "url": "www_bbc_co_uk_food_recipes_pepperandsunblushedt_82614", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 tbsp olive oil", "½ red pepper, sliced", "85g/3oz sun-blushed tomatoes", "½pint chicken stock (vegetarians can substitute vegetable stock)", "handful of fresh basil leaves", "salt and freshly ground black pepper", "drizzle of olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan and sauté the pepper slices for 3-4 minutes, to soften. Stir in the tomatoes and heat for a further few minutes. ", "Add the chicken stock, bring to the boil, then reduce the heat and simmer gently for 8-10 minutes.", "Stir in the basil and season well with salt and freshly ground black pepper.", "Transfer to a serving bowl and drizzle with a little olive oil, to serve."]}, {"isVegetarian": false, "title": "Beef steak for one", "url": "www_bbc_co_uk_food_recipes_peppercrustedbeefste_87038", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppercrustedbeefste_87038_16x9.jpg", "ingredients": ["200g/7oz sirloin steak", "1 small free-range egg, lightly beaten", "2 tsp coarsely ground black pepper", "1 tbsp olive oil", "green salad, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dip the steak in the beaten egg and sprinkle with the pepper to coat.", "Heat the olive oil in a non-stick frying pan and fry the steak for four minutes on each side, or until cooked to your liking.", "Leave the steak to rest for 5 minutes before serving with the salad."]}, {"isVegetarian": false, "title": "Peppercorn and herb-crusted venison with homemade tomato chutney and buttered kale", "url": "www_bbc_co_uk_food_recipes_peppercornandherbcru_88332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz venison fillet", "dash olive oil", "salt and freshly ground black pepper", "25g/1oz butter", "2 garlic cloves, peeled and crushed ", "4 sprigs fresh thyme, leaves only", "55g/2oz fresh breadcrumbs", "small handful fresh parsley, chopped", "salt, to taste", "1 tsp black peppercorns, crushed", "2 tsp red wine vinegar", "150g/5½oz fresh cherry tomatoes, quartered", "1 tsp caster sugar", "2 tsp tomato purée", "salt and freshly ground black pepper", "25g/1oz butter", "large handful fresh kale, chopped", "salt and freshly ground black pepper", "splash hot water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the venison, tie the venison up with kitchen string - this will help it to retain its shape. Rub with olive oil and season with salt and freshly ground black pepper.", "Heat a frying pan and sear the venison until browned on all sides. Add a knob of the butter, reserving the rest for the crust, and brush the meat with the melted butter. Turn down the heat and add the garlic and half of the thyme. Fry gently for about ten minutes. Remove from the pan and leave to rest for five minutes, then remove the string and cut in half.", "Place the breadcrumbs, parsley, salt, crushed peppercorns and the remaining thyme and butter into a mini blender and process until combined.", "Spread the crust mixture on top of the venison fillet halves and place onto a baking sheet. Place into the oven and bake for 2-3 minutes, or until golden-brown on top.", "For the homemade tomato chutney, place all the ingredients into a small non-reactive pan and simmer for five minutes, or until the tomatoes have softened. Beat with a wooden spoon until smooth and well combined.", "For the buttered kale, heat the butter in a large saucepan and add the kale, salt and freshly ground black pepper and a splash of boiling water. Stir over a low heat until wilted.", "To serve, place the tomato chutney onto a serving plate. Place the venison on top and serve with the buttered kale."]}, {"isVegetarian": false, "title": "Pepper-crusted chicken with sugar snap peas and red pepper", "url": "www_bbc_co_uk_food_recipes_peppercrustedchicken_87088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, plus extra for drizzling", "1 chicken breast, skin scored", "1 tsp crushed black peppercorns ", "1 tbsp olive oil, plus extra for drizzling", "½ red pepper, deseeded", "1 garlic clove, sliced", "100g/3½oz sugar snap peas, sliced", "1 tbsp soy sauce", "2 tbsp lemon juice", "1 lime, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, heat the olive oil in a frying pan. Rub the chicken breast with a little extra olive oil, then rub the skin with the crushed peppercorns.", "Place the chicken into the pan skin-side down and cook for 5-10 minutes. Turn over and cook for 4-5 minutes on the other side, or until completely cooked through.", "For the sugar snap peas and red pepper, drizzle the red pepper half with olive oil and place onto a baking sheet. Transfer to the oven and roast for 8-10 minutes, or until softened.", "Remove the pepper from the oven, place into a bowl and cover the bowl with cling film. After 3-4 minutes, remove the cling film, peel the skin off the pepper and cut into wedges.", "Heat the oil in a frying pan and fry the roasted pepper slices with the sliced garlic for 1-2 minutes. Add the sliced sugar snap peas, soy sauce and lemon juice and cook for a further 1-2 minutes.", "To serve, place the sugar snap pea and red pepper salad onto a serving plate and top with the pepper-crusted chicken. Garnish with lime wedges."]}, {"isVegetarian": false, "title": "Pepper crusted monkfish with mustard dill sauce", "url": "www_bbc_co_uk_food_recipes_peppercrustedmonkfis_68035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 monkfish tail, about 500g/1lb 2oz, filleted and skinned", "2 tbsp olive oil, for frying", "3 tbsp cracked black pepper", "sea salt and freshly ground black pepper", "1 tbsp olive oil", "1 shallot, chopped", "1 garlic glove, chopped", "3 tbsp white wine", "110ml/4fl oz double cream", "3 tbsp coarse grain mustard", "2 tbsp chopped fresh dil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Trim the monkfish, then cut into medallions about 2.5cm/1in thick. Season with a little salt and press each medallion lightly into the cracked pepper to coat. Place in the refrigerator.", "To make the sauce, heat the oil in a frying pan, add the shallot and garlic and sauté for 3 minutes. Add the wine and cook until evaporated. Stir in the cream and bring to the boil, then add the mustard, dill and seasoning. Reduce the heat and keep warm.", "Wipe out the pan with kitchen paper. Heat the oil for frying until very hot, add the monkfish medallions and cook for about 2 minutes on each side until browned and just firm when pressed. Remove and drain on kitchen paper.", "Place the medallions on 4 warmed serving plates and spoon the sauce around", "Serve with bubble and squeak cakes and a salad of crisp mixed leaves."]}]