[{"ingredients": ["450g / 1lb de masa de copos de brisa lista", "Jengibre fresco de 10cm / 4in en pieza, pelado y aproximadamente picado", "1 gran manojo de perejil flatleaf", "2 cucharadas de aceite de girasol", "350g / 12oz de carne de cangrejo blanca fresca", "2 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "325ml / 11fl oz crema fresca", "sal y pimienta negra recién molida", "4 cebolletas, finamente picadas", "1 lima, solo jugo", "1 chile rojo, finamente picado", "3 cucharadas de salsa de soja", "6 cucharadas de aceite de girasol", "1 cucharadita de azúcar en polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sobre una superficie ligeramente enharinada, extender la masa y utilizar para revestir una lata de tarta de fondo suelto de 25 cm / 10 in. Cubra y coloque en la nevera por 15 minutos.", "Alinee la caja de tarta de hojaldre con papel antigrasa y llénela con alubias para hornear.", "Hornee en el horno por 10-15 minutos.", "Retire el papel y los frijoles a prueba de grasa y devuelva la caja agria al horno por otros 3-5 minutos hasta que esté recién cocida.", "Reduzca el calor a 180C / 350F / Gas 4.", "En un procesador de alimentos pequeño, mezcle el jengibre con el perejil y dos cucharadas de aceite de girasol.", "Extiende sobre la base de la caja de tarta.", "Esparce la carne de cangrejo sobre la parte superior de la mezcla de jengibre.", "En un tazón combine los huevos y las yemas de huevo con la crème fraîche y sazone con sal y pimienta negra recién molida.", "Vierta en la caja de tarta.", "Devuelva la tarta al horno durante 30-35 minutos o hasta que se haya puesto.", "Mientras tanto, haz el aderezo. En un tazón pequeño, mezcle las cebollas, el jugo de lima, el chile, la salsa de soja, el aceite de girasol y el azúcar con una cucharada de agua. Sazone al gusto.", "Sirva la tarta tibia con un chorrito de salsa de chile."], "url": "www_bbc_co_uk_food_recipes_crabandgingertartwit_83886", "title": "Tarta de cangrejo y jengibre con aderezo de chile", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450g / 16oz de carne de cangrejo", "1 cucharadita de mostaza en polvo", "2 cucharaditas de salsa Worcestershire", "1 cucharada de mayonesa", "1 cucharada de perejil fresco picado", "1 yema de huevo de gallinas camperas", "4 cucharadas de pan rallado seco, más pan rallado adicional para el recubrimiento", "30g / 1oz de mantequilla"], "method": ["Mezcle todos los ingredientes en un tazón, a excepción de las migas de pan y la mantequilla.", "Forme la mezcla en ocho pasteles de pescado individuales con sus manos.", "Incline las migas de pan adicionales en un plato. Sumerja cada torta de pescado en las migas de pan para cubrir.", "Caliente la mantequilla en una sartén y agregue las croquetas de pescado a la sartén, puede que tenga que cocinarlas en tandas. Freírlos hasta que estén crujientes y dorados y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_crabcakes_85675", "title": "Pasteles de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de maíz dulce enlatado, enjuagado y escurrido (o use maíz dulce fresco)", "1 cucharada de aceite vegetal", "3 cebolletas, finamente picadas", "Jengibre de 2.5cm / 1in, pelado, cortado en cerillas", "200g / 7oz de carne de cangrejo", "50ml / 2fl oz de jerez seco", "1 litro / 1 pinta 15fl oz de caldo de pollo", "1 cucharadita de harina de maíz mezclada con un poco de agua para formar una pasta", "1 huevo de gallinas camperas, golpeado", "1 cucharadita de semillas de sésamo", "1 chile rojo, finamente picado"], "method": ["Coloque tres cuartas partes del maíz dulce en un procesador de alimentos y mezcle hasta obtener un puré suave.", "Caliente el aceite vegetal en una sartén a fuego medio. Agregue la cebolla tierna y el jengibre y fría por 3-4 minutos, hasta que la cebolla esté blanda, pero no coloreada.", "Agregue la carne de cangrejo, el jerez, el puré de maíz dulce y el caldo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos.", "Agregue el maíz dulce restante y la pasta de harina de maíz y mezcle bien.", "Pase el huevo batido a través de un fino colador sobre la sopa para crear hilos de huevo en la sopa. Cocine hasta que los huevos se hayan formado como hebras.", "Para servir, coloque cucharadas de sopa en cuencos y adorne con semillas de sésamo y chiles."], "url": "www_bbc_co_uk_food_recipes_crabandsweetcornsoup_89965", "title": "Sopa de cangrejo y maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, ligeramente golpeados", "3 cucharadas de cebolletas, finamente picadas (1 cucharada reservada para decorar)", "25g / 1oz de mantequilla", "50g / 1¾oz de carne de cangrejo enlatada", "50g / 1¾oz Taleggio, finamente picado", "sal y pimienta negra recién molida"], "method": ["Coloque los huevos y las cebolletas en un bol y mezcle.", "Derrita la mantequilla en una sartén pequeña hasta que forme espuma. Agregue la mezcla de huevo y cocine por dos minutos.", "Precalentar la parrilla a alto.", "Espolvorear la tortilla con la carne de cangrejo y el Taleggio, sazonar con sal y pimienta negra recién molida y colocar debajo de la parrilla durante cuatro minutos.", "Para servir, coloque la tortilla en un plato y espolvoree con la cucharada restante de cebollas picadas."], "url": "www_bbc_co_uk_food_recipes_crabandtaleggioomele_82133", "title": "Tortilla de cangrejo y taleggio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas harinas de 250 g / 9 oz, como el rey Eduardo, cortadas en trozos grandes", "aceite vegetal, para freír", "10g / ¼ oz de mantequilla", "1 cucharada de cilantro fresco finamente picado", "½ pimiento verde fresco grande, sin semillas y finamente picado", "150g / 5½oz de carne de cangrejo blanca, en copos", "100 g / 3½ fl oz de carne de cangrejo marrón", "2 limas, solo jugo", "sal y pimienta negra recién molida", "Fideos de arroz 250 g / 9 oz", "3 limas, solo jugo", "4 dientes de ajo, aplastados", "2 cucharadas de jengibre fresco de raíz finamente rallado", "4 cucharadas de azúcar de palma", "1 cucharada de aceite de sésamo", "3 cucharadas de nuoc nam (salsa de pescado vietnamita)", "3 cucharadas de salsa de soja", "2 chiles rojos, 1 finamente picado y 1 rebanado", "1 manojo grande de menta fresca, hojas solo, picadas", "1 cilantro de racimo grande, solo hojas, picado", "berro de coriandro", "1 chile rojo, en rodajas", "4 cebolletas, picadas"], "method": ["Hervir las papas en una olla con agua ligeramente salada durante unos 15 minutos, o hasta que estén tiernas. Drene bien, y luego regrese a la sartén. Mash con un tenedor o trituradora de patata hasta que quede suave.", "Caliente el aceite en una freidora de grasa profunda o una sartén de fondo profundo y con fondo grueso a 180 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida).", "Agregue la mantequilla, el cilantro, el chile y sazone con sal y pimienta. Agitar juntos para mezclar bien, luego dejar enfriar por completo.", "Mientras tanto, revisa cuidadosamente las carnes de cangrejo para detectar cualquier mancha de concha y deséchala. Agregue las carnes de cangrejo a la mezcla de puré de patatas. Agregue el jugo de lima y luego moldee en 4 hamburguesas redondas. Si la mezcla se pega a tus manos, sumerge tus manos en agua fría.", "Con cuidado agregue las tortas de crab al aceite y cocine durante 3-4 minutos, hasta que estén doradas en la parte inferior, luego gírelas con cuidado y cocine por otros 3-4 minutos en el otro lado. Cuando esté completamente cocinado, retírelo de la freidora y escurra sobre papel de cocina.", "Cocine los fideos de acuerdo con las instrucciones del paquete y colóquelos en un tazón grande.", "Coloque todos los demás ingredientes en un procesador de alimentos y mezcle hasta obtener una pasta áspera. Agregue el aderezo a los fideos y mezcle bien.", "Coloque los fideos en el centro de los tazones para servir y cubra con los crabcakes. Adorne con el berro de cilantro, el chile y las cebolletas."], "url": "www_bbc_co_uk_food_recipes_crabcakes_with_a_rice_91861", "title": "Crabcakes con una ensalada de fideos de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de pan rallado blanco", "100g / 3½oz de carne de cangrejo marrón", "½ cucharadita de jengibre molido", "½ cucharadita de hojuelas de chile seco", "1 cebolla tierna, finamente picada", "sal y pimienta negra recién molida, al gusto", "3 cucharadas de vino blanco", "3 cucharadas de azúcar en polvo", "½ cucharadita de hojuelas de chile seco", "1 cucharadita de ketchup de tomate"], "method": ["Para hacer los pasteles de crab, coloque todos los ingredientes de crabcake en un tazón grande y mezcle.", "Coloque una sartén mediana antiadherente a fuego medio. Divida la mezcla de crabcake en dos, forme cada uno en un crabcake y colóquelos en la sartén calentada.", "Cocine los crabcakes por dos minutos en cada lado, hasta que estén dorados, luego retírelos del fuego y déjelos a un lado.", "Para hacer el jarabe de chile, coloque una cacerola pequeña a fuego alto. Coloque todos los ingredientes de jarabe de chile en la sartén y llevar a fuego lento. Cocine a fuego lento durante dos minutos, hasta que se alcance una consistencia de jarabe.", "Para servir, coloque los pasteles de crab en un plato y rocíe sobre el sirope de chile."], "url": "www_bbc_co_uk_food_recipes_crabcakeswithchillis_79703", "title": "Crabcakes con jarabe de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas King Edward de 250g / 9oz, peladas y cortadas en trozos grandes", "10g / ½ oz de mantequilla", "1 cucharada de crema doble", "½ cucharadita de polvo de curry mediano", "1 cucharada de cilantro fresco finamente picado", "½ pimiento verde fresco grande, sin semillas y finamente picado", "1 cucharada de cebolla roja rallada", "sal y pimienta negra recién molida", "250 g / 9 oz de carne de cangrejo blanco, en copos", "1 cucharada de aceite vegetal", "75g / 2¾oz de azúcar en polvo", "2 chiles rojos, más o menos picados", "3 tomates de ciruela, toscamente picados", "8 hojas de lima kaffir", "2 tallos de limoncillo, finamente picados", "25 g / 1 oz de jengibre, aproximadamente picado", "2 dientes de ajo", "2 chalotes, toscamente picados", "4 cucharadas de salsa de pescado (nam pla)", "40ml / 1½fl oz de aceite de sésamo", "50ml / 2fl oz de salsa de soja oscura", "2 cucharadas de miel clara", "3 limas, jugo y ralladura solamente"], "method": ["Hervir las papas en una olla con agua ligeramente salada durante unos 15 minutos, o hasta que estén tiernas. Drene bien, y luego regrese a la sartén. Mash con un tenedor o trituradora de patata hasta que quede suave.", "Agregue la mantequilla, la crema, el polvo de curry, el cilantro, el chile, la cebolla y sazone con sal y pimienta negra recién molida. Agitar juntos para mezclar bien, luego dejar enfriar por completo.", "Mientras tanto, revisa cuidadosamente la carne de cangrejo para detectar cualquier mota de concha y deséchala. Agregue la carne de cangrejo a la mezcla de puré de patatas, luego forme cuatro hamburguesas redondas. Si la mezcla se pega a sus manos, simplemente sumerja sus manos en agua fría.", "Caliente el aceite en una sartén poco profunda y cuando esté caliente, agregue cuidadosamente las tortas de crab. Cocine durante 3-4 minutos, hasta que estén doradas en la parte inferior, luego con cuidado gire la torta de crabcake y cocine por otros 3-4 minutos en el otro lado. Cuando esté completamente cocido, quítelo de la sartén y póngalo en las toallas de cocina.", "Para la salsa de chile, coloque el azúcar en una sartén a fuego medio y derrita a un caramelo marrón claro.", "Coloque los ingredientes restantes de la salsa de chile en un procesador de alimentos y mezcle hasta obtener un puré suave.", "Una vez que el azúcar tenga un rico color caramelo (pero no quemado), vierta el puré y mezcle bien.", "Llevar la mezcla a ebullición, reducir el fuego y hervir a fuego lento durante unos cinco minutos, luego retirar del fuego y dejar enfriar.", "Sirva los pasteles de crab en un plato con la salsa de chile en un tazón para sumergir a un lado."], "url": "www_bbc_co_uk_food_recipes_crabcakeswithchillis_83757", "title": "Crabcakes con salsa de chile", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pan rallado fresco de 110 g / 4 oz, sazonado", "1 huevo grande", "55 ml / 2 fl oz crème fraîche, grasa completa", "1 cucharadita de salsa Worcestershire", "1 cucharadita de mostaza en polvo", "450g / 1lb de carne de cangrejo", "gran puñado de estragón fresco", "sal marina y pimienta negra recién molida", "berro y ensalada de escarola"], "method": ["En un tazón, mezcle las migas de pan, el huevo, la crème fraîche, la salsa Worcestershire y el polvo de mostaza.", "Ahora agregue la carne de cangrejo y el estragón. Mezcle bien y sazone al gusto. Si la mezcla está demasiado seca, agregue más crème fraîche. Ponlo en el refrigerador para unir.", "Retire la mezcla de la nevera y déle forma a ocho pasteles pequeños.", "Poco profundas freír las tortas a fuego lento hasta que estén doradas por ambos lados.", "Sirva con berros y ensalada de escarola."], "url": "www_bbc_co_uk_food_recipes_crabcakeswithwatercr_72371", "title": "Crabcakes con ensalada de berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cangrejo marrón cocido, con un peso de alrededor de 1.25kg / 2½lb", "300ml / 10fl oz de aceite de oliva", "1 zanahoria grande, picada", "1 puerro, picado", "1 cebolla mediana picada", "Papas 900g / 2lb", "harina, para quitar el polvo", "2 huevos, golpeados", "100g / 4oz de pan rallado", "2 tomates, desollados, sin semillas y picados", "10 hojas de albahaca fresca, 6 rebanadas finas y 4 hojas enteras", "jugo de ¼ limón", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 150C / 300F / Gas2.", "Extraiga toda la carne del cangrejo pero reserve todas las conchas. Coloque las cáscaras con el aceite de oliva en una bandeja de asar poco profunda con la zanahoria, el puerro y la cebolla. Hornee en el horno durante 2 horas para extraer suavemente el sabor. Deje que se enfríe, luego cuele el aceite y deseche los residuos.", "Cocine las papas en agua hirviendo ligeramente salada hasta que estén suaves. Mash con un tenedor y mezclar en tres cuartas partes de la carne de cangrejo blanco, la mitad de la carne de cangrejo marrón y un tercio del aceite de cangrejo. Corrija el aderezo con sal. Divida la mezcla en bolas que pesen aproximadamente 50 g / 2 oz. En una superficie enharinada, forma tortitas planas redondas con una espátula. Pase las tortas primero a través de la harina, luego el huevo y luego las migas de pan.", "Ponga el resto del aceite de cangrejo, los tomates, la albahaca en rodajas, el jugo de limón y el resto de la carne de cangrejo en una sartén y caliente, pero no hierva.", "Ajuste la freidora a 160 ° C / 320 ° F o caliente un poco de aceite a la misma temperatura en una sartén grande. Agregue los pasteles y fría por tres minutos. Retire y escurra sobre papel de cocina.", "Divida los pasteles de crab entre cuatro platos calentados. Vierta el aderezo alrededor de los pasteles de cangrejo. Adorne con una hoja de albahaca completa colocada encima del aderezo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crabfishcakeswithato_6230", "title": "Tortas de cangrejo con salsa de tomate, cangrejo y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crabfishcakeswithato_6230_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla", "2 cucharadas de pimiento rojo en cubitos", "4 cucharadas de cebolla de primavera finamente picada", "2 cucharadas de apio finamente picado", "200g / 7oz de merluza fresca / merlán / bacalao deshuesado y despellejado", "450g / 16oz de carne de cangrejo fresca o congelada", "1 huevo", "1 cucharada de perejil picado", "1 cucharada de albahaca fresca picada", "1 cucharada de mostaza Dijon", "200g / 7oz de pan rallado fresco", "sal", "pimienta recién molida", "1 cucharada de aceite vegetal", "2 yemas de huevo", "2 dientes de ajo", "1-2 cucharadas de jugo de limón", "ralladura de limón rallado", "¼ cucharadita de sal", "125ml / 4fl oz de aceite de oliva", "125ml / 4fl oz de aceite vegetal", "hojas de ensalada verde"], "method": ["Derrita una cucharada de mantequilla en una cacerola pequeña y sude la pimienta, la cebolleta y el apio hasta que estén blandos, aproximadamente cinco minutos. Deje que se enfríe y luego colóquelo en un bol.", "Procese el pescado fresco en un procesador de alimentos para hacer un puré áspero. Agregue la carne de cangrejo, el huevo, las hierbas, la mostaza y 100 g / 3½ oz de las migas de pan. Pruebe el condimento y agregue sal y pimienta si es necesario.", "Enrolla la mezcla de carne de cangrejo en bolas un poco más grandes que una pelota de golf y sumérgete en las migas de pan restantes.", "Finalmente, forma las bolas en pequeños pasteles presionándolos ligeramente.", "Derretir una cucharada de mantequilla en una sartén grande con aceite vegetal. Saltee los crabcakes a fuego moderado hasta que estén dorados y calientes. Esto tomará alrededor de 3-4 minutos en cada lado (dependiendo del grosor)", "Escurrir sobre papel de cocina y servir con una mayonesa de ajo.", "Para hacer la mayonesa, combine las yemas de huevo, el ajo, una cucharada de jugo de limón, la ralladura de limón y la sal en un procesador de alimentos.", "Mezcle durante unos segundos y luego agregue lentamente los aceites en una corriente constante hasta que se emulsionen.", "Pruebe y ajuste la cantidad de jugo de limón y sal si es necesario. Sirve con las tortas de crab y algunas hojas de ensalada verde."], "url": "www_bbc_co_uk_food_recipes_crabfishcakeswithgar_71554", "title": "Tortas de pescado de cangrejo con mayonesa de ajo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 chiles rojos pequeños", "5 dientes de ajo", "5 limas, solo jugo", "1 tallo de limoncillo, finamente picado", "75ml / 3fl oz de vinagre de arroz", "75ml / 3fl oz de agua", "250g / 10½oz de fideos de arroz fino", "250 g / 10½ oz de carne de cangrejo fresca (cocida)", "1 cebolla roja, muy finamente cortada", "1 cucharada de cilantro fresco picado", "3 hojas de lima finamente cortadas", "medio pimiento rojo, finamente picado", "medio pepino, sin semillas, finamente picado", "sal y pimienta negra recién molida"], "method": ["Para el nuoc cham, coloque todos los ingredientes nuoc cham en un procesador de alimentos y mezcle hasta que quede suave.", "Para la ensalada de cangrejo, remoje los fideos de arroz en agua muy caliente durante cinco minutos, o hasta que estén suaves (o cocínelos de acuerdo con las instrucciones del paquete - no los cocine en exceso). Escurrir y reservar para enfriar.", "Coloque todos los ingredientes restantes de la ensalada en un tazón y mezcle bien, condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, rocíe un poco del aderezo nuoc cham en los fideos y mezcle bien.", "Dobla la mitad de la mezcla de ensalada de cangrejo en los fideos, luego usa un tenedor grande, envuelve un tenedor lleno de fideos y coloca suavemente en un tazón pequeño para crear un \"nido\" de fideos. Repite con tres cuencos más.", "Ponga un poco del aderezo nuoc cham sobre cada nido de fideos.", "Cubra con una cucharada de mezcla de ensalada de cangrejo, luego cubra con un poco más de aderezo."], "url": "www_bbc_co_uk_food_recipes_crabnoodlesaladwithn_86637", "title": "Ensalada de fideos de cangrejo con nuoc cham", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de carne de cangrejo blanca fresca", "Papas harinas 400g / 14oz, cocidas, machacadas y dejadas enfriar", "1cm / ½ en jengibre fresco, pelado, finamente rallado", "1 lima, solo jugo", "1 cilantro fresco de racimo pequeño, aproximadamente picado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 chiles rojos, finamente picados", "75g / 3oz de azúcar en polvo", "75ml / 3fl oz de vinagre de vino blanco", "75ml / 3fl oz de agua", "75 g / 3 oz de hojas de mizuna (sustituto con hojas de cohete si no está disponible)", "50g / 2oz de granos de maíz dulce, escurridos", "4 cebolletas, finamente cortadas", "50g / 2oz de coco fresco, rebanado y tostado en una sartén seca hasta que esté dorado"], "method": ["Para las hamburguesas de cangrejo, coloque el cangrejo, la patata, el jengibre y el jugo de lima en un bol y mezcle bien.", "Agregue el cilantro y sazone bien con sal y pimienta negra recién molida y mezcle bien.", "Ruede una pieza de cangrejo del tamaño de una pelota de golf y métala en forma de patty plano. Repita con el resto de la mezcla.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva. Agregue las hamburguesas y fría en ambos lados hasta que se doren por completo y se caliente. Déjelo a un lado en papel de cocina y manténgalo caliente.", "Para la ensalada, coloque los chiles, el azúcar, el vinagre y el agua en una sartén a fuego medio y deje hervir. Reduzca el fuego y cocine a fuego lento la mezcla durante 5-6 minutos para preparar el aderezo.", "Coloque las hojas de mizuna, maíz dulce, cebolletas y coco tostado en un bol y revuelva suavemente para combinar. Agregue un poco de aderezo y revuelva para cubrir.", "Para servir, coloque porciones iguales de la ensalada en los platos y cubra cada una con dos o tres hamburguesas de cangrejo."], "url": "www_bbc_co_uk_food_recipes_crabpattieswithmizun_86379", "title": "Empanadas de cangrejo con ensalada de mizuna y aderezo de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pedazo de jengibre (del tamaño de una nuez)", "75ml / 3fl oz de jugo de limón recién exprimido (aproximadamente 2 limas maduras)", "1 cucharadita de azúcar", "1 cucharada de aceite de oliva suave", "sal y pimienta negra recién molida", "15 hojas de menta", "2 melones pequeños verdes maduros o de pulpa anaranjada, bien refrigerados", "½ pepino pequeño", "100g / 3½ oz de berros", "300 g / 10 oz de carne de cangrejo fresco, cocinado"], "method": ["Para hacer el aderezo, pele el jengibre y rallarlo sobre un tazón - debe obtener una cucharadita colmada.", "Usando un batidor pequeño (si tiene uno, revuelva con una cuchara), combine el jugo de lima, el azúcar y el aceite de oliva con el jengibre.", "Sazonar con un poco de sal y una generosa molienda de pimienta negra. Corta las hojas de menta y revuelve la mitad de ellas.", "Para la ensalada, pele los melones, corte la carne por la mitad y raspe las semillas con una cucharilla. Corta la carne en trozos.", "Pele el pepino, retire las semillas y corte la carne en trozos, un poco más pequeños que los del melón.", "En un tazón, mezcle el melón y el pepino con el aderezo.", "Recorte solo los tallos más duros del berro y agréguelo al melón.", "Divida el melón y el berro entre dos platos grandes o ensaladeras, dejando cualquier aderezo adicional en el tazón.", "Sazone la carne de cangrejo con un poco de sal y pimienta negra. Apila el cangrejo encima del melón y el berro.", "Dispersa sobre las hojas de menta restantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crabsalad_83897", "title": "Ensalada de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas pequeñas de 250 g / 9 oz, preferiblemente papas de piel roja como Roosevelt", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "Salmón 250 g / 9 oz, escalfado, copos, huesos extraídos", "Carne de cangrejo blanca 150 g / 5 oz", "Carne de cangrejo marrón 150g / 5oz", "1 cucharada de mayonesa de buena calidad", "puñado de perejil fresco de flatleaf, picado", "puñado de eneldo fresco, picado", "1 chile rojo, finamente picado", "1 cucharadita de mostaza Dijon", "sal marina y pimienta negra recién molida", "1 cucharada de aceite de oliva", "4 cucharadas de mayonesa de buena calidad", "4 pequeños cornichons o pepinillos, finamente picados", "1 cucharada de alcaparras", "puñado de perejil fresco de flatleaf, finamente picado", "½ limón, solo jugo", "1 cucharadita de rábano picante fresco rallado", "sal marina y pimienta negra recién molida", "2 puñados grandes de espinaca fresca", "1 cucharada de aceite de oliva", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las papas, hierva las papas en una sartén grande de agua con sal durante 15-20 minutos, o hasta que estén tiernas. Escurrir, y luego regresar a la olla.", "Aplastar las papas con un tenedor, sazonar al gusto, con sal y pimienta negra recién molida, y rociar sobre el aceite. Incline en una lata de asar y tueste en el horno durante 25-30 minutos, o hasta que estén dorados y crujientes.", "Mientras tanto, para las croquetas de pescado, combine el salmón, la carne de cangrejo blanca y marrón, la mayonesa, el perejil, el eneldo, el chile rojo y la mostaza Dijon en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Forme la mezcla en tortas con las manos y enfríe en la nevera hasta que las papas estén casi listas.", "Para la salsa tártara, mezcle todos los ingredientes en un tazón y sazone, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Para cocinar las croquetas de pescado, caliente el aceite en una sartén grande a fuego medio-alto. Freír las croquetas de pescado en el aceite durante 3-4 minutos por cada lado, o hasta que estén doradas y crujientes.", "Para la espinaca, coloque la espinaca en una sartén pequeña a fuego medio y cocine durante 1-2 minutos, o hasta que se marchite. Rocíe el aceite de oliva y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, divida las croquetas de pescado entre dos platos para servir, coloque las papas asadas y las espinacas a cada lado, y coloque la salsa tártara alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_crabsalmonanddillfis_93618", "title": "Croquetas de pescado cangrejo y salmón con salsa tártara casera", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crabsalmonanddillfis_93618_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de salsa bechamel lista para usar", "2 cucharadas de cebollín fresco, picado", "Crema doble 25ml / 1fl oz", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida", "2 claras de huevo de gallinas camperas, batidas hasta formar picos rígidos", "25g / 1oz de mantequilla, derretida", "125 g / 4½ oz de carne de cangrejo blanca de una lata", "1 cebolla tierna, finamente picada"], "method": ["Precalentar la parrilla a alto.", "Coloque la salsa bechamel, el cebollín fresco, la crema doble, la yema de huevo, la sal y la pimienta negra recién molida en un bol y mezcle bien.", "Agregue las claras de huevo y doble en la mezcla suavemente para mantener el volumen.", "Derrita la mantequilla en una sartén pequeña a prueba de horno y, cuando haga espuma, vierta la mezcla de huevo.", "Espolvorea sobre el cangrejo durante 3-4 minutos, o hasta que la base se haya solidificado.", "Transfiera a la parrilla y cocine por 2-3 minutos, o hasta que se dore y se prepare, pero todavía un poco tambaleante en el medio.", "Para servir, deslice el soufflé en un plato y espolvoree sobre las cebolletas."], "url": "www_bbc_co_uk_food_recipes_crabsouffle_82130", "title": "Cangrejo soplado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 diente de ajo, en rodajas finas", "4 tomates, despellejados, sin semillas, cortados en cuatro", "400g / 14oz de carne de cangrejo blanca", "1 cucharadita de curry en polvo", "1 limón, solo jugo", "sal y pimienta negra recién molida", "1 manojo grande de cebollín fresco, finamente picado", "400 g / 14 oz de carne de cangrejo marrón, recogido", "1 cucharadita de pimentón dulce ahumado", "Crema doble de 110 ml / 4 fl oz, ligeramente batida", "2 berrinches pequeños"], "method": ["Caliente una sartén hasta que esté tibia y luego agregue dos cucharadas de aceite de oliva, el ajo y los tomates y cocine a fuego lento durante 5-8 minutos, hasta que los tomates se ablanden. Retirar del fuego y dejar enfriar.", "Coloque cuatro anillos de chefs de 5cm / 2in x 8cm / 3in en una placa plana grande.", "Coloque tres trozos de tomate en la parte inferior de cada anillo.", "Coloque la carne de cangrejo blanca, el polvo de curry y un chorrito de jugo de limón en un tazón. Mezcle bien y sazone con sal y pimienta negra recién molida.", "Coloque una capa de mezcla de cangrejo en el anillo de cada chef sobre los tomates y alise.", "Espolvorea sobre el cebollino picado para cubrir la mezcla de carne de cangrejo.", "Mezcle la carne de cangrejo marrón con el pimentón ahumado y un chorrito de limón, y sazone con sal y pimienta negra recién molida. Coloque una capa de la mezcla de carne de cangrejo marrón sobre la parte superior de cada capa de cebollín.", "Repita el proceso de estratificación con la mezcla de carne de cangrejo blanca restante, los cebollinos y la mezcla de carne de cangrejo marrón hasta que el anillo esté lleno.", "Batir el jugo de limón restante en la crema doble y sazonar, al gusto, con sal y pimienta negra recién molida.", "Vierta la mezcla de crema sobre la parte superior del anillo de los chefs, alisándolo sobre la parte superior. Coloque en la nevera para enfriar durante una hora.", "Para servir, retire la placa con los anillos de la nevera y cuidadosamente transfiera cada anillo a un plato de servir.", "Corta finamente los cuatro trozos de tomate restantes.", "Retire el anillo de cada chef con cuidado y luego la parte superior de la pila con unos trozos de tomate.", "Coloque el berro en un bol con la cucharada restante de aceite de oliva y sal y pimienta negra recién molida. Mezcla bien para cubrir y luego coloca un poco de berro alrededor de cada pila."], "url": "www_bbc_co_uk_food_recipes_crabtian_86162", "title": "Cangrejo tian", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2¼ lb de cangrejo cocido, carne blanca y carne de garra solamente, picada (la carne marrón se puede utilizar en otra receta)", "1 mango maduro, pelado, sin hueso, carne cortada en cubos", "2 aguacates, piedras y piel eliminadas, carne cortada en cubos", "1 cebolla roja, pelada, en rodajas", "1 diente de ajo, pelado, en rodajas", "½ chile rojo suave, sin semillas, en rodajas finas", "2 ramitas de tomillo fresco, solo hojas", "1 lima, solo jugo", "1-2 cucharadas de aceite de oliva, o al gusto", "pizca de sal", "2 lechugas Little Gem, hojas separadas, lavadas y secadas con papel de cocina"], "method": ["Coloque la carne de cangrejo blanca y la carne de garra en un bol, agregue el mango picado, los aguacates, la cebolla roja, el ajo, el chile rojo, las hojas de tomillo, el jugo de limón y el aceite de oliva, y sazone al gusto con sal. Mezcle hasta que esté bien combinado.", "Para servir, cuchara la mezcla de cangrejo en las hojas de lechuga. Divida las hojas de lechuga llena por igual entre cuatro platos para servir."], "url": "www_bbc_co_uk_food_recipes_crabwithmangoandavoc_91733", "title": "Cangrejo con ensalada de mango y aguacate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pan blanco fuerte 400g / 14oz adicional para quitar el polvo", "50g / 2oz de harina de pan integral fuerte", "1 bolsita de 7 g de levadura seca de acción rápida", "2 cucharaditas de sal", "un poco de aceite de girasol (o aceite en aerosol)", "Harina de arroz de 25g / 1oz", "1 cucharadita de azúcar en polvo", "¼ cucharadita de levadura seca de acción rápida", "pizca de sal", "1 cucharadita de aceite vegetal"], "method": ["Primero, prepara el pan. Coloque las harinas, la levadura y la sal en un tazón grande (o en un mezclador de alimentos con un gancho para masa) y dé una mezcla rápida para combinar. Agregue 275ml / 9¾fl oz de agua, mezclando todo el tiempo hasta que todo se una. Luego pon tus manos dentro y haz una bola. Amasar sobre una superficie enharinada durante 10 minutos (o durante 5-7 minutos si usa un mezclador de alimentos).", "Para ver si la masa se ha amasado lo suficiente, primero haga la masa en forma de bola con la parte superior enseñada. Luego, ponga el dedo en la harina y pise el lado de la masa para hacer una sangría. Si la masa retrocede todo el tiempo, entonces la masa está lista, si solo retrocede un poco, luego amasar durante un par de minutos más y vuelva a intentarlo.", "Ahora aplana un poco la bola de pan (para dar aproximadamente 5cmx12.5cm / 2inx5in pan ancho). Luego tira de los bordes hacia el centro dando una pequeña cosa tipo parcela y dale la vuelta. Esto le dará a la masa una buena parte superior enseñada. Recorte los bordes de la masa con las manos para darle forma redonda y coloque en una bandeja para hornear.", "Engrase un poco de película adhesiva y envuélvala sobre el pan. Use varias piezas si es necesario, de modo que el pan esté completamente cubierto, pero no demasiado bien para que haya espacio para levantarse. Coloque en un lugar cálido durante aproximadamente 30-45 minutos o hasta que haya aumentado en tamaño en aproximadamente un cincuenta por ciento.", "Precalentar el horno a 200C / 400F / Gask 6.", "Para el relleno, mezcle la harina de arroz en un tazón pequeño con el azúcar, la levadura y la sal. Agregue el aceite y 25 ml / 1 fl oz de agua tibia hasta que se forme una pasta espesa. Cubra y reserve en un área cálida hasta que esté listo para usar.", "Para comprobar que la masa ha subido lo suficiente, quite la película adhesiva, sumerja el dedo en un poco de harina y luego sumérjalo en el costado del pan haciendo una pequeña sangría. Si la masa retrocede hasta la mitad, está lista.", "Una vez que la masa ha demostrado suficientemente, use sus manos para frotar la pasta de cobertura por toda la parte superior y los lados del pan en una buena capa uniforme.", "Hornee el pan en el horno por 25 minutos. El pan debe crujirse en la parte superior; si no, vuelva a colocarlo en el horno hasta que comience a oscurecerse. Si está crujiente, déle un toque debajo; debe sonar hueco, pero si todavía no está allí, vuelva a colocarlo en el horno durante otros cinco minutos más o menos.", "Una vez que esté listo, retírelo del horno y déjelo enfriar en una rejilla de alambre por un momento. Esto se sirve mejor con montones de mantequilla."], "url": "www_bbc_co_uk_food_recipes_crackle_top_bread_97187", "title": "Crackle pan superior", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crackle_top_bread_97187_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1-1.5kg / 2¼lb-3lb 5 oz de vientre de cerdo, huesos extraídos, piel intacta y finamente puntuada", "3 dientes de ajo", "media cucharadita de hojuelas de chile seco", "2 cucharadas de salsa de soja ligera", "una cucharada de aceite de cacahuete", "2 cucharaditas de sal", "una cucharadita ligeramente apilada de cinco especias en polvo chino", "2 cebollas de primavera", "un pequeño chile rojo", "3 melocotones", "8 tomates cherry", "un cilantro pequeño racimo", "jugo de 2 limas", "3 cucharadas de aceite de oliva"], "method": ["Coloque el vientre de cerdo en un plato de porcelana o vidrio.", "Para el masaje, pele y triture el ajo en una pasta, revolviendo la soja, los copos de chile seco, el aceite de cacahuete, la sal y el polvo de cinco especias. Extiende esta pasta sobre la piel y la parte inferior del vientre de cerdo. Déjelo marinar durante unas buenas 4 horas, si no durante la noche.", "Cuando el cerdo se haya marinado, precaliente el horno a 220 ° C / 425 ° F / Gas 8. Coloque el cerdo en un molde para asar y cocine con la piel hacia arriba, por unos 20 minutos. Baje el fuego a 200C / 400F / Gas 6 y continúe cocinando por otros 40-50 minutos, o hasta que la piel esté oscura y crujiente. Deje reposar por 10 minutos y luego talle.", "Mientras tanto, para hacer la salsa de melocotón, corte y pique finamente las cebolletas, pique finamente el chile, la cáscara, la piedra y pique finamente el melocotón y divida los tomates a la mitad. Mezclar suavemente y luego vestir con el jugo de limón y el aceite de oliva.", "Sirve las costillas con la salsa de durazno en un lado."], "url": "www_bbc_co_uk_food_recipes_crackling_pork_belly_21942", "title": "Vientre de cerdo chispeante", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crackling_pork_belly_21942_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz gachas avena", "150 g / 5½ oz de azúcar en polvo", "3 litros / 5¼ pintas de crema doble", "3 litros / 5¼ pintas de yogurt natural", "Fresas frescas de 1.8kg / 4lb, descascaradas, picadas"], "method": ["Precalentar el horno a 200C / 400F / Gas mark 6.", "Coloque la avena en dos bandejas grandes para hornear, espolvoree el azúcar sobre ellas y mezcle. Hornee en el horno durante 7-8 minutos o hasta que estén ligeramente tostados.", "Batir la crema doble hasta que llegue a los picos suaves. Agregue el yogur y casi toda la fruta fresca y doble la avena tostada.", "Coloque en platos para servir, cubra con la fruta restante y enfríe hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_cranachan_17284", "title": "cranachan", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]