[{"ingredients": ["4 filetes de bacalao negro, aproximadamente 150-200g / 5½-7oz cada uno, con espinas", "4 tallos de hajikami o 50g / 1¾oz de jengibre en escabeche, para servir", "50g / 1¾oz raíz de loto o chips de taro, para servir, opcional", "50ml / 2fl oz sake", "100ml / 3½fl oz", "Pasta de miso blanco 400 g / 14 oz", "125 g / 4½ oz de azúcar en polvo", "200ml / 7fl oz dashi stock o stock de pescado", "2 cucharadas de salsa de soja oscura", "1 cucharada de azúcar en polvo", "500g / 1lb 2oz de espinaca grande de hojas", "50 g / 1¾oz de semillas de sésamo"], "method": ["Para hacer el saikyo miso, pon el sake, mirin, miso paste y azúcar en una cacerola mediana y lleva a ebullición a fuego alto. Cocine por unos minutos, hasta que el azúcar se haya disuelto. Dejar enfriar a temperatura ambiente.", "Coloca el bacalao en un bol y cúbrelo con el saikyo miso (reserva un poco para decorar). Cubra y deje macerar a temperatura ambiente durante 2-3 horas.", "Cuando esté listo para cocinar el bacalao, precaliente el horno a 220C / 200C Fan / Gas 7. Caliente una sartén a prueba de horno a fuego medio. Levante los filetes de pescado del adobo y cocínelos con la piel hacia abajo en la sartén durante 2 minutos. Voltee el pescado y tueste en el horno durante 6-8 minutos, o hasta que esté cocido y ennegrecido.", "Mientras tanto, para la espinaca de sésamo, hierva el caldo dashi en una cacerola grande y agregue la salsa de soja y el azúcar. Una vez que el azúcar se haya disuelto, agregue las espinacas, revuelva y apague el fuego. Tueste las semillas de sésamo en una sartén seca hasta que estén doradas, luego triture usando un mortero y una mano de mortero. Escurra las espinacas, reserve el líquido y exprima el exceso de humedad. Mezcle la espinaca con casi todas las semillas tostadas y un poco del licor de cocción.", "Para servir, junte la espinaca en una bola y cubra con las semillas de sésamo restantes. Sirva con bacalao y hajikami, con unas gotas del saikyo miso reservado en cada plato."], "url": "www_bbc_co_uk_food_recipes_black_cod_with_miso_38131", "title": "Bacalao negro con saikyo miso y espinaca de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Licor de regaliz 150ml / 5fl oz", "2 cucharadas de miel", "100ml / 3½ fl oz de prosecco", "½ limón, pelar solo (reservar el jugo para aderezar la lechuga)", "5 g de hojas de menta chocolate, picadas", "1 guindilla, sin semillas, cortado por la mitad a lo largo", "15g de estragón", "4 x 140 g / 5 oz de filetes de bacalao negro de Alaska", "sal y pimienta negra recién molida", "500 g / 1 libra 2 onzas de cebolla roja picada (alrededor de 6 cebollas)", "125 g / 4½ oz de azúcar en polvo", "20g / ¾oz de remolacha cocida, picada", "50ml / 2fl oz de vinagre de vino tinto", "2 lechugas Little Gem, cortadas en cuartos", "2 cucharadas de aceite de oliva virgen extra", "puñado de brotes de guisantes"], "method": ["Para el bacalao negro, prepare el adobo el día antes de que quiera comer. Agregue el licor de regaliz, miel, prosecco, cáscara de limón, hojas de menta chocolate, chile y estragón en un tazón grande y mezcle para combinar. Agregue los filetes de bacalao y marinado en la nevera durante la noche. Al día siguiente, quite el bacalao y deseche el adobo. Sazone el pescado con sal y pimienta. Dejar de lado hasta que esté listo para cocinar.", "Para la mermelada de cebolla roja, coloque las cebollas, el azúcar en polvo, la remolacha y el vinagre en una sartén y cocine a fuego lento a fuego lento durante aproximadamente 45 minutos. Una vez que la mezcla se asemeja a una mermelada delgada, use una espátula para pasarla a través de un tamiz fuerte para eliminar grumos. Dejar de lado para enfriar.", "Para cocinar el pescado, precaliente la parrilla a fuego medio-bajo. Ase el bacalao durante 15-20 minutos, o hasta que esté bien glaseado y firme", "Para servir, cocine la lechuga con un soplete de chef y luego aliñelo con aceite de oliva y el jugo de limón reservado.", "Ponga un poco de mermelada de cebolla en cada plato y cubra con el bacalao. Coloque la lechuga al lado y viste el plato con brotes de guisantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_black_cod_with_red_onion_62871", "title": "Bacalao negro con mermelada de cebolla roja y lechuga carbonizada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla, suavizada", "175g / 6oz de azúcar en polvo", "2 huevos de gallinas camperas", "Harina de auto crianza de 200g / 7oz", "2 cucharadas de cacao en polvo", "125ml / 4fl de leche en oz", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20melted,% 20plus% 20extra% 20to% 20serve", "1 x 360 g / 12½ oz de cerezas negras en kirsch", "½ cucharadita de arrurruz o harina de maíz mezclada con un poco de agua para hacer una pasta suave", "300 ml / 10 fl oz crema doble, ligeramente batida"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Cubra una bandeja para muffins de 12 hoyos con cajas de papel.", "Batir la mantequilla y el azúcar juntos en un bol hasta que estén suaves y cremosos. Gradualmente agregue los huevos, uno a la vez, hasta que estén bien combinados. Tamizar la harina y el cacao en polvo y mezclar hasta que estén bien combinados. Dobla la leche y el chocolate derretido.", "Con una cuchara o pipe la mezcla en las cajas de muffins y hornear durante 18-20 minutos, o hasta que esté bien levantado y elástico al tacto.", "Retire los pasteles de la lata y déjelos a un lado para que se enfríen en una rejilla para enfriar.", "Escurre las cerezas en un colador que recoge el kirsch en el recipiente de abajo. Perfore los pasteles con un pincho y vierta cuidadosamente una cucharadita de kirsch sobre cada pastel.", "Caliente el kirsch y la pasta de arrurruz en una olla pequeña hasta que hierva. Retire la sartén del fuego y bata hasta que espese.", "Usando un cuchillo pequeño, haga un pozo en la parte superior de cada pastel quitando un disco de pastel", "Pase un cucharón o cuchara por un remolino de crema sobre los pasteles, cubra con algunas cerezas y rocíe con el kirsch espesado. Justo antes de servir, ralla algo de chocolate."], "url": "www_bbc_co_uk_food_recipes_black_forest_cupcakes_02412", "title": "Magdalenas del bosque negro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_cupcakes_02412_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla, ablandada, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "160g / 5½ oz de harina de auto crianza", "65 g / 2¼ oz de cacao en polvo", "½ cucharadita de polvo de hornear", "4 huevos medianos", "Frasco de 340g / 11¾oz de mermelada de cereza de morello", "2 paquetes de 80g / 2¾oz de guindas secas azucaradas", "2-3 cucharadas de Kirsch", "100ml / 3½ fl oz de brandy de cereza (idealmente aguardiente de cereza morello)", "Crema doble 500ml / 18fl oz", "50 g / 2 oz de chocolate negro, rallado grueso", "cerezas frescas, para decorar"], "method": ["Precaliente el horno a 190 ° C / 375F / Gas 5. Engrase 2 x 20 cm / 8 en latas de sándwich sueltas y forre las bases con papel para hornear.", "Coloque la mantequilla, el azúcar, la harina, el cacao en polvo, el polvo de hornear y los huevos en un procesador de alimentos y mezcle hasta que quede suave y espeso. Es posible que necesite empujar la mezcla hacia abajo desde los lados un par de veces para asegurarse de que la mezcla esté bien mezclada.", "Divida la mezcla entre las latas de torta preparadas y extiéndala uniformemente con una espátula de goma.", "Hornea de 22 a 25 minutos o hasta que los pasteles estén bien aliñados y empezando a encogerse a los lados de las latas. Retírelos del horno y déjelos enfriar durante 5 minutos antes de encenderlos en una rejilla. Quite el papel de revestimiento y deje que los pasteles se enfríen.", "Cuando los pasteles estén fríos, córtelos por la mitad, horizontalmente, con un cuchillo de sierra de hoja larga. Tenga cuidado de mantener el cuchillo paralelo a la superficie de trabajo, para obtener un buen corte uniforme. Coloque las tortas de nuevo en la rejilla o en una tabla, corte los lados hacia arriba.", "Para el relleno, ponga la mermelada en una cacerola con las guindas y Kirsch y coloque a fuego lento. Deje que hierva a fuego lento y cocine por 6-8 minutos, revolviendo, hasta que el atasco se haya derretido y las cerezas estén comenzando a hincharse. Deja enfriar por 15 minutos.", "Espolvoree el brandy de cereza sobre las esponjas de chocolate, luego distribuya tres de ellas con la mezcla de guindas y déjelas enfriar. Asegúrese de que la esponja sin el relleno de cereza es de la mitad superior de un pastel.", "Batir 300 ml / 10 fl oz de la crema con un batidor de mano eléctrico hasta que se formen picos suaves.", "Transfiere una de las esponjas (con la cobertura de cereza) con mucho cuidado a un soporte de pastel o plato - desliza una base de hojalata debajo de la esponja para ayudarte. Con un par de cucharadas de budín, vierta aproximadamente un tercio de la crema batida sobre la mezcla de cerezas. No hay necesidad de extenderlo, pero trate de mantener las cucharadas espaciadas uniformemente sobre el pastel. Espolvorea con un poco del chocolate rallado.", "Cubra con otra esponja y repita las capas dos veces más. Deberías terminar con tres capas de esponja, cerezas, crema y chocolate. Coloque la esponja final en la parte superior, con su superficie superior hacia arriba.", "Batir los 200ml / 8fl oz restantes de la crema con un batidor de mano eléctrico hasta que se formen picos suaves.", "Usando el lado plano de una espátula, extiende alrededor de tres cucharadas de crema sobre la parte superior de la torta, llevándola hasta el borde. Coloque la crema restante en una manga pastelera equipada con una boquilla grande y lisa y con rosetas para tubos alrededor del borde de la torta. Incline casi todo el chocolate rallado restante en el centro y espolvoree el resto sobre las rosetas.", "Decore con cerezas frescas si tiene alguna. Mantenga la torta fresca o enfríe hasta que esté lista para servir.", "Lo mejor es comerlo el mismo día que está hecho, ¿cómo podrías resistirte? - pero si necesita preparar el pastel con anticipación, déjelo enfriar en el refrigerador por hasta 24 horas y déjelo reposar a temperatura ambiente durante 30 minutos antes de servirlo."], "url": "www_bbc_co_uk_food_recipes_black_forest_gateau_43895", "title": "Pastel de la selva negra", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gateau_43895_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 huevos de gallinas camperas, separados", "185g / 6½ oz de azúcar en polvo de oro", "80g / 3oz de cacao en polvo", "pizca de sal", "Crema doble 600ml / 20fl oz", "1 vaina de vainilla, solo semillas", "60g / 2¼ oz de azúcar glas", "350g / 12oz cerezas en kirsch", "Atasco de cereza de 340g / 12oz jarra de cereza, 3 cucharadas reservadas para el aderezo", "1 cucharada de harina de maíz mezclada con 2 cucharaditas de agua", "750g / 1lb 10oz de cerezas, empedradas", "3 cucharadas de morello cherry jam", "50-60 lápices de chocolate negro"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4 y engrase y forre una lata de torta en forma de resorte de 22 cm / 8½ pulgadas con papel de hornear.", "Combine las yemas de huevo y el azúcar en una batidora independiente y bata a alta velocidad durante 3 minutos hasta que esté pálida, esponjosa y doblada en volumen. Tamice el polvo de cacao y dóblelo, manteniendo tanto aire como sea posible.", "En un tazón limpio, bata las claras de huevo con una pizca de sal hasta que se formen picos rígidos cuando se retire el batidor del tazón.", "Doble las claras de huevo en la mezcla de chocolate un tercio a la vez. Con cuidado, vierta la mezcla en la lata forrada y hornee durante 40 minutos. Retirar del horno y dejar enfriar por completo.", "Para el relleno, bata la crema, la vainilla y el azúcar glas hasta que se formen picos suaves. Escurre las cerezas, reservando el kirsch, luego dóblalas en la crema.", "Para la decoración, ponga las cerezas frescas y la mermelada en una cacerola y cocine a fuego alto durante 2 minutos hasta que estén brillantes. Agregue la mezcla de harina de maíz, cocínela por un minuto más y luego déjela enfriar por completo.", "Para armar la torta, usando un cuchillo de pan afilado, corte la esponja en tres rebanadas iguales. Coloque una rodaja en un soporte para pasteles o en una tabla para servir y luego ponga más de 3 cucharadas de kirsch reservadas.", "Extienda la mitad de la mermelada sobre la parte superior y luego la parte superior con la mitad de la crema. Coloque una segunda esponja en la parte superior, presione suavemente hacia abajo, luego repita el proceso de estratificación, terminando con una capa final de esponja. Pase una espátula alrededor del borde del pastel para suavizar cualquier crema; esto debería cubrir la parte exterior de la torta con una fina capa de crema que ayudará a los lápices de chocolate a pegarse a la torta.", "Decora el exterior de la torta con una línea apretada de lápices de chocolate, luego coloca las cerezas glaseadas en el centro. Enfríe por al menos una hora antes de servir."], "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_01263", "title": "Pastel de la selva negra", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de chocolate negro, roto en pedazos", "300ml / 10fl oz de leche entera", "300 ml / 10 fl oz doble crema", "1 vaina de vainilla, dividida", "6 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "2 cucharadas de cacao en polvo", "1 cucharada de harina de maíz", "Pastel de chocolate de 400 g / 14oz o brownies", "50g / 1¾oz de cereza negra o confitura de cereza de Morello", "Brandy de Kirsch o de cereza de 100g / 3½oz", "300g / 10½oz de cerezas negras deshuesadas", "Galletas de amaretti 150 g / 5½ oz", "300 ml / 10 fl oz doble crema", "rizos de chocolate, para decorar"], "method": ["Primero prepare la crema, ya que tendrá que enfriarse antes de compensar la bagatela. Derrita el chocolate, ya sea en el microondas o con mucho cuidado en un baño maría (un recipiente resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento). Deja enfriar.", "Ponga la leche y la crema en una cacerola con la vaina de vainilla y llévela a un punto de ebullición justo por debajo. Retirar del fuego y dejar en infusión hasta que se enfríe un poco.", "Ponga las yemas de huevo, el azúcar impalpable, el cacao en polvo y la harina de maíz en un bol y mezcle, preferiblemente con batidores eléctricos, hasta que la mezcla esté bien aireada, pálida y lo suficientemente rígida como para mantener la forma cuando atraviesa los batidores.", "Vierta la mezcla de leche y crema ligeramente enfriada sobre los huevos, mezcle sobre la marcha y luego agregue el chocolate derretido. Mezcle bien, luego enjuague la cacerola y devuelva la crema pastelera. Cocine, revolviendo constantemente hasta que la crema se espese, esto puede tomar entre 10 y 20 minutos dependiendo de qué tan alto se atreva a calentar. No lo caliente demasiado, ya que no se espesará, pero asegúrese de no dejar hervir la mezcla y seguir revolviendo.", "Cuando la natilla se haya espesado hasta el punto de crema doble espesa, transfiéralo a una jarra y cúbrelo con film transparente para evitar que se forme una piel. Cuando esté frío, transfiéralo a la nevera; la crema seguirá espesándose mientras se enfría.", "Para hacer la bagatela, corte los brownies o la torta de chocolate en rodajas bastante finas y extiéndalos con la mermelada. Sándwich juntos y organizar en el fondo de un tazón pequeño. Vierta sobre el aguardiente de cereza o kirsch, luego espolvoree sobre las cerezas.", "Pon una capa de galletas amaretti sobre las cerezas, luego vierte sobre la crema pastelera en una capa gruesa y pareja. Si tiene tiempo, colóquelo en el refrigerador hasta que esté casi listo para servir, nuevamente cubierto con película adhesiva.", "Batir la crema doble en un bol hasta que forme picos suaves, luego alisar esto sobre la crema pastelera. Decorar con rizos de chocolate."], "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_47551", "title": "Boletería de la Selva Negra", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gteau_47551_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["340g / 12oz de harina blanca fuerte, más extra para espolvorear", "60 g / 2¼ oz de cacao en polvo", "1 cucharadita de sal marina fina", "400g / 14oz de mantequilla sin sal, cortada en cubos", "1 huevo de gallinas camperas, batido para lavar huevos", "azúcar en polvo, para quitar el polvo", "300 ml / 10 fl oz doble crema", "250 g / 9 oz de cerezas negras en almíbar sabor kirsch (peso escurrido), 12 reservadas y el resto picado", "2 cucharadas de jarabe de cerezas negras (ver arriba)", "2 cucharadas de kirsch", "algunas gotas de extracto de almendra", "50g / 1¾oz de azúcar glas", "50g / 1¾oz de almendras copos tostadas, más extra para la decoración", "100ml / 3½ fl oz crema doble", "1 cucharadita de mantequilla sin sal", "100g / 3½oz de chocolate puro"], "method": ["Para obtener un poco de soplo, tamiza la harina y el cacao en un recipiente para mezclar y agrega la sal. Agregue la mantequilla y frótelo en la harina con las yemas de los dedos (debe tener pequeños copos de mantequilla). Mezcle en 160ml / 5½fl oz de agua y amase suavemente. Junta la masa y dale forma en un rectángulo. Envuelva en una película adhesiva y déjela enfriar por 20 minutos.", "En una superficie de trabajo ligeramente enharinada, extienda la masa fría a un rectángulo de aproximadamente 60 cm de largo. Con el borde corto orientado hacia usted, doble el tercio superior hacia abajo y el tercero inferior hacia arriba. Gire la masa en 90 grados (conocido como un cuarto de vuelta) y despliegue en un rectángulo como antes. Repita el proceso de doblado, envuélvalo en una película adhesiva y vuelva a enfriarlo.", "Para hacer el relleno del castillo de la Selva Negra, bate la crema doble hasta que se formen picos rígidos cuando se quite el batidor. Mezcle las cerezas picadas, el jarabe, el kirsch y el extracto de almendras. Revuelva a través de tamizar el azúcar glasé y mezcle hasta que se combinen.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Estirar la masa hasta que tenga un espesor de 3-4 mm. Corta en tiras largas de aproximadamente 1 cm / ½ pulgadas de ancho. Envuelva cada tira alrededor de un molde de cuerno comenzando en la punta y trabajando hacia arriba, con la masa superpuesta ligeramente. Cepille con huevo batido, espolvoree con azúcar glas y colóquelo en una bandeja para hornear con la costura hacia abajo. Hornee durante aproximadamente 15-20 minutos hasta que la masa esté crujiente y oscurecida ligeramente.", "Una vez que los cuernos estén cocidos, deje enfriar por unos minutos y luego retírelos de los moldes de la bocina y deje que se enfríen completamente en una rejilla de alambre.", "Para la ganache de chocolate, caliente la crema, la mantequilla y el chocolate en una sartén. Retire la sartén del fuego y bata la mezcla hasta que quede suave y espesa. Deje que se enfríe un poco y luego colóquelo en una bolsa para tubos con una boquilla pequeña y lisa.", "Coloca los cuernos en tazas para mantenerlos erguidos y luego canaliza las finas líneas de la ganache de chocolate dentro de los cuernos hasta llegar lo más lejos posible.", "Llena los cuernos con el relleno del castillo de la Selva Negra. Cubra con una cereza y algunos copos de almendras. Pase una fina línea de chocolate por el borde superior de la masa."], "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_cream_88183", "title": "Black Forest Gâteau cuernos crema", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 cuernos de crema", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["170g / 6oz de azúcar glas", "150 g / 5½ oz de almendras molidas", "10g / ¼ oz de cacao en polvo", "4 (125ml / 4fl oz) claras de huevo de gallinas camperas", "165g / 5¾oz de azúcar granulada", "125 g / 4% C2% BDoz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa,% 20finely% 20chopped", "125ml / 4fl oz de crema doble", "1 cucharadita de kirsch (opcional)", "100 g / 3½ oz de mermelada de cereza Morello o conserva de cereza"], "method": ["Alinee dos bandejas grandes para hornear con papel de hornear. Ponga el azúcar glas, las almendras y el cacao en un procesador de alimentos y mezcle hasta obtener un polvo muy fino. Tamizar la mezcla en un tazón grande y agregar la mitad de las claras de huevo. Combine con un tenedor para hacer una masa húmeda.", "Agregue las claras de huevo restantes a la taza del mezclador independiente. Caliente el azúcar granulada y 50 ml / 2 fl oz de agua en una sartén pequeña a fuego medio, revolviendo ocasionalmente hasta que el azúcar se disuelva. Deja de remover y lleva la mezcla a ebullición con el termómetro de azúcar sumergido. Una vez que el jarabe alcanza 112C, encienda el mezclador de pie a alta velocidad. Cuando el jarabe llega a 118C las claras de huevo deben ser espumosas y blancas. Con cuidado, vierta el jarabe de ebullición por el costado del tazón con la batidora en funcionamiento (PRECAUCIÓN: el jarabe de azúcar está muy caliente. No vierta el jarabe sobre las batidoras o puede salpicarlo hacia atrás). Sigue batiendo el merengue hasta que el exterior del tazón esté frío al tacto.", "Usando una espátula suave, mezcle la mitad del merengue en la mezcla de almendras, no se preocupe por ser demasiado suave. Una vez que el color sea uniforme, agregue el merengue restante.", "Coloque la mezcla en una bolsa grande y corte un agujero de 1 cm / 1 / 2in de diámetro en la punta. Pase 3 cm / 1¼ en discos sobre las bandejas de horneado preparadas y deje a temperatura ambiente durante al menos media hora antes de hornear. Esto permite que se forme una piel, lo que ayuda a lograr una buena cúpula.", "Precalentar el horno a 170 ° C / 150 ° Ventilador / Gas 3. Justo antes de que las bandejas ingresen al horno, déjelos caer desde una pequeña altura sobre la superficie de trabajo, esto ayuda a que el \"pie\" del macarrón crezca cuando hornea. Hornea por 14-15 minutos. Retire los macarrones del horno y deje que se enfríen en sus bandejas.", "Mientras tanto, haz la ganache. Pon el chocolate en un tazón pequeño y resistente al calor. Caliente la crema en una cacerola hasta que comience a hervir (pero antes de hervir). Vierta la crema sobre el chocolate y déjela por un minuto. Revuelva suavemente hasta que el chocolate se derrita y el ganache se vuelva brillante. Agregue el kirsch, si está usando, y revuelva. Separe para reafirmar hasta una consistencia de tubería.", "Transfiere el ganache a una manga pastelera pequeña y corta un pequeño orificio en la punta. Coloque una masa de mermelada de cereza en el centro de cada concha y vierta un anillo de ganache a su alrededor. Coloque la otra media concha en la parte superior y apriete suavemente hasta que la ganache llegue al borde. Repita con las conchas restantes."], "url": "www_bbc_co_uk_food_recipes_black_forest_macaroons_13462", "title": "Macarrones de la selva negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace alrededor de 20 macarrones", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "Harina normal de 100 g / 3½ oz", "60 g / 2¼ oz de cacao en polvo", "150 g / 5½ oz de mantequilla, derretida y enfriada, más extra para engrasar", "100 g / 3½ oz de mermelada de cereza morello", "425 g de cerezas negras sin hueso, drenadas", "Crema doble 500ml / 18fl oz", "2 cucharadas de azúcar glas", "100 g / 3½ oz de chocolate negro, para decorar"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forre la base de tres latas de bocadillo de 20 cm / 8 pulgadas con papel de hornear.", "En un tazón, mezcle los huevos y el azúcar con un batidor de mano eléctrico hasta que quede muy ligero y esponjoso. La mezcla debe dejar un rastro visible cuando levante el batidor (etapa de cinta). Esto tomará alrededor de 10 minutos.", "En un recipiente aparte, tamice la harina y el cacao en polvo juntos antes de doblarlo en la mezcla de huevo, siendo muy suave para no expulsar el aire.", "Vierta suavemente la mantequilla derretida enfriada por el interior del tazón y dóblela con cuidado.", "Divida la mezcla en partes iguales entre las tres latas y hornee durante 20-25 minutos, hasta que quede elástico al tacto. Déjelo enfriar durante 5 minutos, luego colóquelo sobre una rejilla de alambre, despegue el papel de hornear y deje que se enfríe por completo.", "Caliente el atasco en una cacerola pequeña para que se derrita. Reserve ocho de las cerezas en conserva para la parte superior de la torta, luego mezcle el resto en la mermelada. Dejar de lado para enfriar por completo.", "Batir la crema y el azúcar glas juntos hasta que se formen picos suaves. Guarde en el refrigerador hasta que esté listo para armar.", "Cuando la torta esté completamente fría, coloque la crema batida en una manga pastelera con una boquilla estrella y vierta una pequeña cantidad de crema en la primera capa de esponja y extiéndala de manera uniforme. Luego coloca un anillo alrededor del borde y llena el medio con la mitad de la mezcla de cereza. Coloque la segunda capa de esponja encima y repita el proceso.", "Pipe ocho remolinos de crema en la parte superior de la torta, cada uno con una cereza reservada.", "Use un pelador de verduras para afeitar el chocolate negro en rizos en la parte superior (alternativamente, rallar el chocolate y espolvorear). Este pastel se come mejor el día de su fabricación."], "url": "www_bbc_co_uk_food_recipes_black_forest_gateau_39909", "title": "Pastel de la selva negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gateau_39909_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de cerezas frescas, piedras removidas, reducidas a la mitad", "4 cucharadas de licor de almendras", "125 g / 4½ oz de avena", "30g / 1oz de almendras en copos", "200g / 7oz% 20 calidad buena% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20preferentemente% 20Fairtrade", "1 cucharada de miel clara", "400 ml / 14 fl oz crema doble", "50g / 1¾oz de azúcar glas"], "method": ["Coloque las mitades de cereza en un recipiente y vierta más de la mitad del licor de almendras. Reserve para macerar por 15-20 minutos.", "Mientras tanto, precalentar la parrilla a mediano. Espolvoree la avena en una bandeja para hornear y tueste debajo de la parrilla durante 4-5 minutos, agitando la bandeja ocasionalmente mientras la avena se cocina para asegurarse de que se doren por completo. (Alternativamente, precaliente el horno a 160C / 325F / Gas 3 y tueste la avena durante 12-15 minutos).", "Repita el proceso de tostado con las almendras en copos (esto debería tomar menos tiempo para dorarse, así que vigílelos). Dejar de lado para enfriar.", "Ponga un poco de agua a hervir en una sartén. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento, luego suspenda un recipiente resistente al calor sobre el agua, asegurándose de que el fondo del recipiente no toque el agua.", "Agregue el chocolate al tazón y revuelva hasta que se derrita. Retirar del fuego y reservar para enfriar un poco.", "Rocíe la miel sobre la avena tostada. Agregue la avena recubierta de miel al chocolate derretido y mezcle bien.", "Agregue el licor de almendras restante y un tercio de la crema doble a la mezcla de chocolate y revuelva hasta que esté bien combinado.", "Batir la crema restante en un bol con el azúcar glas hasta que se formen picos suaves cuando se quite el batidor.", "Divida la mezcla de chocolate y avena entre cuatro vasos o platos individuales.", "A continuación, vierta un poco de crema batida en cada plato. Capa en las cerezas maceradas (ahorrando cuatro para usar como guarnición).", "Vierta la crema batida restante y espolvoree sobre las almendras tostadas.", "Enfriar los cranachans de la Selva Negra en la nevera durante al menos 30 minutos, o hasta que sea necesario, para reafirmarse.", "Justo antes de servir, decore cada postre con una de las cerezas restantes."], "url": "www_bbc_co_uk_food_recipes_black_forest_cranachan_06130", "title": "Bosque negro cranachan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_cranachan_06130_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de leche entera", "¼ cucharadita de sal marina fina", "75 g / 2½ oz de azúcar en polvo", "1 huevo mediano de gallinas camperas", "1 naranja, solo ralladura", "1 limón sin cebar, solo cáscara", "600g / 1lb 5oz de harina blanca fuerte, más extra para quitar el polvo", "2 cucharaditas de levadura de acción rápida", "100g / 3½oz de mantequilla sin sal, ablandada", "1 cucharadita de aceite de colza, para engrasar", "200g / 7oz de cerezas secas", "75 g / 2½ oz de chocolate belga oscuro, fríos en la nevera", "20 cubos de azúcar blanco, partidos por la mitad", "4 cucharadas de aguardiente de cereza", "1 huevo grande de granja, batido, para lavar huevos", "20 cerezas glaseadas de colores, cortadas por la mitad", "100 g / 3½ fl oz de azúcar nibbed", "1 cucharadita de canela molida, para quitar el polvo", "50 g / 1% C2% BEoz% 20 calidad buena% 20plain% 20chocolate% 20 (70%% 20cocoa% 20solids)"], "method": ["Para la masa, coloque la leche en una jarra resistente al calor y caliéntela en el microondas hasta que hierva. Agregue 150ml / 5½fl oz de agua fría para enfriarlo.", "En el cuenco de un mezclador independiente con un accesorio de gancho de masa, agregue la sal, el azúcar, el huevo, la ralladura de naranja, la ralladura de limón, la harina y la levadura. (Asegúrese de que la levadura y la sal no se tocan).", "Agregue aproximadamente la mitad de la mezcla de leche y, usando el accesorio para el gancho de masa, mezcle lentamente para juntar la mezcla. Siga añadiendo la mezcla de leche hasta incorporar toda la harina (es posible que no necesite toda la leche). Aumente la velocidad del mezclador a medio y mezcle durante tres minutos.", "Agregue lentamente la mantequilla hasta que se incorpore y mezcle durante otros seis minutos. La masa debe ser suave y elástica.", "Engrase un recipiente grande con aceite de colza y agregue la masa. Cubra con un gorro de baño o una película adhesiva engrasada. Pruebe la masa en un lugar cálido (idealmente a 27 ° C / 80 ° F) durante 50 minutos, o hasta que la masa se haya duplicado.", "Cuando la masa haya demostrado, colócala en una superficie de trabajo ligeramente enharinada. Derriba la masa y dobla sobre sí mismo un par de veces.", "Para el relleno, amase suavemente las cerezas y las chispas de chocolate hasta que se distribuyan uniformemente. Divida la masa en porciones de 80 g / 2¾oz y enrolle en bolas.", "Aplanar las bolas de masa ligeramente y colocar medio cubo de azúcar en el centro de cada bola. Remoje cada cubo de azúcar con un poco de brandy de cereza, con una pipeta, si está disponible. Tire de la masa sobre los cubos de azúcar, para sellar el cubo en el centro. Rodar en bolas ordenadas.", "Línea dos bandejas grandes para hornear con pergamino para hornear antiadherente. Coloque las bolas de masa en la bandeja de hornear dejando un espacio de 1 cm / ½ pulgadas entre las bolas para permitir la expansión. Rocíe con una fina neblina de agua (si no tiene un atomizador, humedezca sus manos y deslice gotitas de agua sobre los bollos). Pruebe por otros 25 minutos en un lugar cálido (idealmente 27C / 80F).", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y coloque un estante en el tercer estante (justo debajo del centro).", "Para la decoración, después de la prueba, cepille suavemente los panecillos con el lavado de huevos. Coloque una cereza glace en la parte superior de cada panecillo y decore con azúcar mordisqueada. Con un pequeño colador, espolvorea los bollos con canela molida.", "Hornee por unos 25-30 minutos, o hasta que esté bien levantado y dorado. Retire del horno y colóquelo en una rejilla para enfriar.", "Mientras tanto, derrita el chocolate negro en un recipiente resistente al calor suspendido sobre una sartén de agua hirviendo a fuego lento (no permita que el recipiente toque el agua). Coloque el chocolate en una bolsa de plástico con una boquilla de escritura fina.", "Cuando se enfríe, rocíe el chocolate derretido sobre los panecillos para decorar. Sirve una vez que el chocolate esté listo."], "url": "www_bbc_co_uk_food_recipes_black_forest_rolls_94689", "title": "Rollitos del Bosque Negro", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace alrededor de 18 panecillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225ml / 8fl oz de vino de postre Muscat", "4 cucharadas de aguardiente", "2 limones, ralladura y jugo", "115 g / 4 oz de azúcar en polvo", "pizca de nuez moscada recién rallada", "600 ml / 1 pinta de crema doble", "200 g / 7 oz de azúcar en polvo", "3 cucharadas de polvo de fruta de grosella negra", "100 g / 3½ oz de claras de huevo de gallinas camperas", "2 cucharadas de agua", "100 g / 3½ oz de azúcar en polvo", "3 cucharadas de polvo de fruta de frambuesa", "100 g / 3½ oz de claras de huevo de gallinas camperas", "2 cucharadas de agua", "Moras 175g / 6oz", "175 g / 6 oz de cerezas negras, apedreado, reducido a la mitad", "175g / 6 oz de grosellas negras", "12 hojas pequeñas de albahaca"], "method": ["Para el syllabub, coloque el vino de postre, el brandy, la ralladura de limón y el jugo y el azúcar en un tazón pequeño y revuelva hasta que el azúcar se haya disuelto. Cubra el recipiente con film transparente y déjelo toda la noche.", "Precalentar el horno a 125C / 250F / Gas ½. Alinee dos bandejas grandes para hornear con papel antigrasa. Dibuja 12 x 6 cm / 2½ en círculos con lápiz en una de las hojas de papel.", "Para las cestas de merengue, mezcle el azúcar y el polvo de grosella negra y reserve.", "Batir las claras de huevo hasta que formen picos rígidos, luego agregue el agua y continúe batiendo por dos minutos más. Poco a poco mezcle la mezcla de azúcar, hasta que se haya agregado todo el azúcar y el merengue esté firme y brillante.", "Coloque la mezcla en una bolsa para tubos con una boquilla simple de 1 cm / ½ pulgadas. Haga círculos en el papel usando las líneas de lápiz para guiarlo, luego coloque otros dos anillos en la parte superior para formar las \"paredes\" de las cestas.", "Para las barras de merengue, mezcle el azúcar y el polvo de frambuesa y reserve.", "Batir las claras de huevo hasta que formen picos rígidos, luego agregue el agua y continúe batiendo por dos minutos más. Poco a poco mezcle la mezcla de azúcar, hasta que se haya agregado todo el azúcar y el merengue esté firme y brillante.", "Coloque la mezcla en una bolsa para tubos con una boquilla simple de 1 cm / ½ pulgadas. Pipe 5cm / 2in se adhiere a la otra bandeja para hornear.", "Hornee los merengues durante 40 minutos, luego reduzca el calor a 110C / 225F / Gas ¼ y hornee por otras dos horas. Retire los merengues del horno y transfiéralos cuidadosamente a una rejilla para que se enfríen.", "Mientras tanto, termina el syllabub. Cuele el líquido en un tazón grande y agregue una pizca grande de nuez moscada. Vierta la crema y bata con un batidor de alambre hasta que conserve su forma, teniendo cuidado de no sobrepasar o se cuajará. Transfiera a un recipiente limpio y deje enfriar hasta que esté listo para usar.", "Para ensamblar los merengues, con una cuchara o con una pipa, coloca el syllabub en las cestas de merengue y decora con la fruta y las hojas de albahaca. Sirva los palitos de merengue en el lado para 'sumergir'."], "url": "www_bbc_co_uk_food_recipes_black_fruit_meringues_04123", "title": "Mini merengues de la Selva Negra con syllabub eterno", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal, cortada en cubos", "225g / 8oz de chocolate blanco, roto en pequeños pedazos", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "½ cucharadita de extracto de vainilla", "Harina de 175g / 6oz de auto crianza", "100 g / 3½ oz de chocolate negro, picado", "100g / 3½oz de cerezas glacé, reducidas a la mitad", "150ml / 5fl oz de crema doble", "150ml / 5fl oz de leche entera", "4 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "Harina normal de 30g / 1oz", "100 g / 3½ oz de chocolate negro, finamente picado", "3 cucharadas de kirsch", "2 x 470g / 1lb 1 oz frascos de cerezas morello en almíbar, escurrido", "1 x 340g / 11¾oz conserva de jarra de cereza o mermelada", "200 g / 7 oz de mascarpone", "Crema doble de 200 ml / 7 fl oz", "25 g / 1 oz de chocolate negro, rallado"], "method": ["Para los Blues, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y forre una lata de brownie de 20 x 26 cm / 8 x 10 1/2 con pergamino.", "Coloque la mantequilla y el chocolate blanco en un recipiente sobre una fuente de agua hirviendo y déjelos derretir, revolviendo de vez en cuando. Cuando esté suave y derretido, deje que se enfríe un poco.", "Ponga el azúcar, los huevos y la vainilla en un tazón grande y use un batidor eléctrico o una batidora para batirlos juntos durante varios minutos hasta que estén pálidos y suaves y aumenten su volumen. Vierta lentamente la mezcla derretida de chocolate en los huevos y dóblela suavemente.", "Agregue la harina y dóblela ligeramente. Dobla el chocolate negro picado. Verter en la lata forrada y esparcir sobre las cerezas glaseadas.", "Hornee durante aproximadamente 30 minutos, o hasta que un pincho insertado en el centro salga casi limpio. Dejar enfriar en la lata.", "Para la crema de chocolate, poner la crema y la leche en una sartén y calentar hasta que esté a punto de hervir. Quítate el calor. Batir las yemas de huevo, el azúcar y la harina. Vierta la leche y la crema caliente sobre los huevos y bata hasta que quede suave. Regrese esta mezcla a la sartén y agregue el chocolate picado.", "A fuego lento y revolviendo constantemente, cocine hasta que todo el chocolate se haya derretido y la crema se espese. Retire del fuego, cuele en una jarra y cubra la superficie de la crema pastelera con una película adhesiva (esto evita que se forme una piel). Deje que se enfríe completamente.", "Para armar la bagatela, use alrededor de un tercio de los Bluries, cortados en 2-3cm / ¾-1¼ en cubos, para revestir la base de un tazón grande (no necesitará los Blondies restantes para esta receta). Galopa sobre el Kirsch, para que se empape en las blondies. Esparce sobre las cerezas escurridas, luego extiende sobre la confitura de cerezas.", "Vierta la crema de chocolate fría sobre las cerezas y colóquela en la nevera durante varias horas hasta que la crema esté lista.", "Para terminar la bagatela, azote el mascarpone con la crema en un bol hasta que la mezcla contenga picos suaves cuando retire el batidor del bol. Remolino o pipa esto sobre la crema de chocolate. Termine con chocolate rallado."], "url": "www_bbc_co_uk_food_recipes_black_forest_trifle_62822", "title": "Pastel de trufas del bosque", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 filetes de caballa fresca, deshuesada", "2 cucharaditas de mostaza Dijon", "3 cucharadas de pimienta negra agrietada", "½ cabeza de apio con hojas, en rodajas", "Mitades de nogal 110g / 4oz", "2 manzanas verdes, sin corazón y cortadas en cuñas", "2 manzanas rojas, sin corazón y cortadas en cuñas", "1 cucharada de mostaza Dijon", "1 limón, solo jugo", "3 cucharadas de aceite de oliva"], "method": ["Para la caballa con costra de pimienta negra, caliente la parrilla a fuego. Cepille los filetes de caballa con la mostaza y enrolle los filetes en la pimienta negra.", "Coloque en una bandeja para hornear y póngalo debajo de la parrilla durante 3-4 minutos.", "Para la ensalada de apio, coloque todos los ingredientes en un tazón grande y mezcle.", "Para el aderezo, coloque todos los ingredientes del aderezo en un tazón pequeño y bata.", "Justo antes de servir vierte el aderezo sobre la ensalada", "Para servir, coloque los filetes de caballa en cada uno de los cuatro platos con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_black_pepper-crusted_61117", "title": "Caballa con costra de pimienta negra con ensalada de apio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_pepper-crusted_61117_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla grande, finamente cortada en lunas crecientes", "2 dientes de ajo, finamente picados", "1 cucharadita de orégano seco", "1 cucharadita de pimentón dulce", "½ cucharadita de pimentón picante", "½ cucharadita de pimienta de Jamaica molida", "½ cucharadita de comino molido", "pellizcar clavos de tierra", "pellizcar canela molida", "250 g / 9 oz de pudín negro, pelado y cortado en cubitos", "2 tomates, semillas eliminadas, cortadas en cubitos", "sal y pimienta negra recién molida", "baguette rebanadas finas, tostadas", "2 cucharadas de perejil finamente picado"], "method": ["Caliente la mitad del aceite de oliva en una sartén grande. Agregue la cebolla y freír suavemente durante unos 10 minutos, o hasta que esté suave y translúcido. Agregue el ajo, el orégano y las especias.", "Continúe cocinando por un par de minutos más y sazone con sal y pimienta. Agregue 100 ml / 3½ fl oz de agua y deje hervir a fuego lento durante un par de minutos.", "En una sartén separada, caliente el aceite de oliva restante. Agregue la morcilla y fríe enérgicamente por todos lados hasta que estén crujientes. Agite suavemente la morcilla con la mezcla de cebolla y los tomates.", "Sirva el budín negro amontonado en la tostada y adornado con perejil."], "url": "www_bbc_co_uk_food_recipes_black_pudding_with_31654", "title": "Black pudding con cebollas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 orejas de cerdo", "1 cebolla pequeña, pelada y cortada a la mitad", "1 zanahoria mediana, aproximadamente picada", "1 apio en barra, toscamente copado", "½ cucharadita de granos de pimienta", "75g / 2½ oz de harina de maíz", "Harina normal de 75 g / 2½ oz", "sal y pimienta negra recién molida", "3 chalotes, cortados a la mitad longitudinalmente y luego en rodajas", "2 dientes de ajo, finamente picados", "2 cucharadas de azúcar", "buenas pizcas de copos de chile seco, al gusto", "1 cucharadita de sal marina", "1 cucharadita de pimienta negra recién molida", "50ml / 2fl oz de vinagre de vino tinto", "8-12 tomates blandos, toscamente picados", "150 g / 5½oz de pasas doradas", "salpicar vinagre de vino blanco", "4 huevos medianos de granja", "2 cucharadas de aceite", "4 rodajas de morcilla", "50g / 1¾oz de mantequilla"], "method": ["Para las orejas crujientes del cerdo, coloque las orejas del cerdo en una olla grande con la cebolla, la zanahoria, el apio y los granos de pimienta. Sazonar con sal y agregar suficiente agua para cubrir los ingredientes. Cocine a fuego medio durante 1½-2 horas.", "Cuando esté cocido, escurra las orejas del cerdo y déjelo a un lado para que se seque.", "Precaliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle las dos harinas juntas, agregue sal y pimienta y mezcle bien.", "Corta las orejas en tiras y draga en la harina. Transfiera a la freidora y cocine por 2-3 minutos o hasta que esté dorada y crujiente. Retire con una espumadera y déjelo escurrir sobre papel de cocina.", "Para el chutney picante de tomate, ponga los chalotes y el ajo en una sartén o sartén. Agregue el azúcar, los copos de chile, la sal, la pimienta y el vinagre. Llevar a ebullición, luego agregue los tomates y las pasas. Cocine por otros 10-15 minutos hasta que los tomates se hayan ablandado. Dejar de lado.", "Para la morcilla y el huevo escalfado, hierva una olla de agua, agregue un poco de vinagre de vino blanco, mezcle el agua y agregue los huevos uno por uno. Cueza hasta que los blancos estén listos y las yemas se ablanden (alrededor de 1-2 minutos). Retire con una espumadera y escurra.", "Mientras tanto, caliente una sartén grande a fuego medio y agregue el aceite. Agregue la morcilla y cocine a cada lado hasta que esté crujiente y cocida. Agregue la mantequilla al final e hilvane la morcilla.", "Para servir, coloque una cucharada de salsa picante de tomate en los platos de servir y coloque la morcilla en la parte superior. Cubra con un huevo escalfado y sazone con sal y pimienta. Adornar con las orejas de cerdo crujientes."], "url": "www_bbc_co_uk_food_recipes_black_pudding_with_a_94219", "title": "Black pudding con huevo escalfado, orejas de cerdo crujientes y salsa picante de tomate", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ piña, pelada, sin corazón y cortada en trozos de 2½cm / 1in", "3 cucharadas de aceite de semilla de uva", "3 cebollas de primavera, cortadas y en rodajas finas", "1 cucharada de jengibre fresco, finamente picado", "1 cucharada de ajo finamente picado", "1 cucharadita de granos de pimienta negra, aplastados", "1 cucharadita de frijoles negros fermentados (disponibles en los supermercados chinos), enjuagados, exprimidos en seco y picados", "3 cucharadas de salsa de soja dulce", "1 cucharada de salsa de soja", "1 lima, solo jugo", "1½ cucharada de azúcar", "½ cucharadita de sal", "12 gambas grandes, limpias, peladas, sin venas y divididas a la mitad", "30g / 1oz de jícama en cubitos (opcional), para adornar", "Brotes de guisantes para bebé de 10g / ½oz, en rodajas finas"], "method": ["Para el camarón de pimienta negra con piña secada al sol, precalentar el horno a 90 ° C / 200 ° F / Gas ¼. Coloque un estante encima de una bandeja de horno con borde y forre el estante con papel antigrasa.", "Coloque las piezas de piña en el papel antigrasa en una sola capa. Hornee durante aproximadamente tres horas hasta que la piña esté seca, arrugada y masticable. Retire de la bandeja y deje enfriar completamente en una rejilla para enfriar.", "Caliente una cucharada de aceite en una cacerola grande a fuego medio-alto. Agregue las cebollas de primavera, el jengibre y el ajo y cocine, revolviendo, hasta que estén suaves y doradas. Agregue la pimienta triturada y cocine hasta que esté fragante, luego agregue los frijoles negros, las salsas de soya, el jugo de lima, el azúcar y la sal y deje que la mezcla hierva, revolviendo ocasionalmente. Reduzca el fuego a medio y cocine a fuego lento durante dos minutos. Transfiera a una licuadora y licúe hasta que se mezcle en grandes cantidades. Dejar de lado.", "Caliente las dos cucharadas restantes de aceite en un wok o una sartén grande a fuego alto. Cuando el aceite esté a punto de ahumar, agregue las gambas y cocine, volteando las piezas una vez, hasta que estén crujientes y doradas. Retire el aceite del wok, luego agregue la salsa de pimienta negra y dos cucharadas de agua. Cocine, revolviendo, hasta que las gambas estén bien cubiertas.", "Para servir, coloque decorativamente las gambas en su plato de servir, adorne con la jícama, los brotes de guisantes y la piña."], "url": "www_bbc_co_uk_food_recipes_black_pepper_shrimp_with_47852", "title": "Camarón de pimienta negra con piña seca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Eglefino de 200g / 7oz, piel marcada con un cuchillo afilado", "sal y pimienta negra recién molida", "2 cucharadas de vinagre balsámico", "dash aceite de oliva", "¼ de cebolla, finamente rebanada", "½ chile rojo, picado", "125 g / 4½ oz de espinaca baby", "sal y pimienta negra recién molida", "3 cucharadas de vinagre balsámico", "1 cucharada de yogur al estilo griego", "1 ramita de perejil fresco, para adornar"], "method": ["Para el eglefino, calentar el aceite en una sartén, sazonar el eglefino con sal y pimienta negra recién molida y freír con la piel hacia abajo durante dos minutos. Voltee, rocíe sobre el vinagre balsámico y cocine durante 1-2 minutos más, o hasta que esté recién cocido. Retire del fuego y reserve en un lugar cálido.", "Para la espinaca picante, caliente el aceite de oliva en una sartén, agregue la cebolla y fríe a fuego lento hasta que esté blanda pero no coloreada.", "Agregue la guindilla y fría por un minuto. Agregue las espinacas, sazone con sal y pimienta negra recién molida y revuelva hasta que se marchiten. Drene cualquier exceso de líquido.", "Para servir, vierta el vinagre balsámico en una olla pequeña y cocine a fuego lento durante cinco minutos, o hasta que esté reducido y almibarado.", "Coloque la espinaca picante en un plato para servir, cubra con el eglefino y vierta la reducción balsámica alrededor del plato. Cubra con una cucharada de yogur y una ramita de perejil."], "url": "www_bbc_co_uk_food_recipes_blackbalsamichaddock_88427", "title": "Abadejos balsámicos con espinacas picantes y reducción balsámica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 x 300 g / 10½ oz de filete de res, finamente cortado", "Hojas cavolo nero de 200g / 7oz, lavadas y recortadas", "2 dientes de ajo, en rodajas finas", "Jengibre de 3 cm / 1¼ en pieza finamente cortado", "1 guindilla roja, sin semillas, carne picada finamente", "3 cucharadas de salsa de frijoles negros", "3 cucharadas de caldo de carne caliente", "220g / 8oz de arroz de grano largo, cocido de acuerdo con las instrucciones del paquete, para servir"], "method": ["Calentar un wok a fuego alto hasta que esté caliente. Agregue una cucharada de aceite vegetal, luego agregue las rodajas de carne y saltee durante 1-2 minutos, o hasta que las rodajas de carne se doren por fuera. Transfiera las rodajas de carne a un colador suspendido sobre un recipiente y déjelo a un lado.", "Regrese el wok al fuego, agregue el aceite vegetal restante, luego agregue las hojas de cavolo nero. Revuelva freír durante 1-2 minutos o hasta que se marchite.", "Agregue el ajo en rodajas, el jengibre y el chile y saltee durante 1-2 minutos más.", "Agregue la salsa de frijoles negros y el caldo de res caliente, revuelva bien para cubrir los ingredientes, luego cocine a fuego lento la mezcla a fuego alto durante 1-2 minutos.", "Regrese las rebanadas de carne a la sartén hasta que se caliente.", "Para servir, vierta el arroz en el centro de cuatro platos para servir. Vierta la cuchara sobre el sofrito y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_blackbeancavoloneroa_89900", "title": "Frijol negro, cavolo nero y salteado de carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de vermicelli de arroz 50 g / 1¾oz", "1 cucharadita de aceite vegetal", "100g / 3½ oz de carne picada de cerdo", "½ cucharadita de pimienta negra recién molida", "2 cucharaditas de salsa de soja", "2 cebollas de primavera, picadas", "½ pimiento rojo, en rodajas finas"], "method": ["Hervir el hervidor. Coloque los fideos en una sartén y vierta sobre agua hirviendo para cubrir. Deje remojar durante 8 minutos hasta que se ablanden.", "Caliente un wok o sartén hasta que esté muy caliente. Agregue el aceite, luego la carne picada de cerdo con mucha pimienta negra recién molida. Rompe la carne picada con una cuchara de madera, dándole tiempo para dorar antes de remover.", "Cuando se dore por todas partes, agregue las partes blancas de la cebolla y la mitad del verde. Revuelva-fríe por 1 minuto. Agregue la salsa de soja, burbujeará rápidamente y se espesará. Inmediatamente transfiera la carne picada de cerdo a un recipiente para servir.", "Escurra los fideos y agregue la carne junto con el pimiento rojo y la cebolla restante. Esto se puede servir caliente, a temperatura ambiente o frío."], "url": "www_bbc_co_uk_food_recipes_black_pepper_pork_noodle_13499", "title": "Ensalada de fideos de cerdo a la pimienta negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_pepper_pork_noodle_13499_16x9.jpg", "isVegetarian": false, "recommendations": 0}]