[{"ingredients": ["225g / 8oz de mantequilla sin sal", "100g / 3½ oz de jarabe dorado", "200g / 7oz de azúcar morena suave", "150g / 3½oz de harina natural", "2 cucharaditas de polvo de hornear", "1 cucharadita de copos de sal marina", "4 cucharaditas de jengibre molido", "2 cucharaditas de canela molida", "400g / 14oz de avena", "2 huevos de gallinas camperas, golpeados", "50g / 1¾oz de tallo de jengibre, picado", "115g / 4oz de chocolate negro de buena calidad"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos bandejas para hornear con pergamino antiadherente. Derrita la mantequilla y el sirope dorado en una sartén a fuego lento. Dejar enfriar un poco.", "Combine el azúcar, la harina, el polvo de hornear, la sal y las especias y mezcle bien para combinar. Agregue la avena arrollada y mezcle bien. Vierta la mantequilla derretida y el jarabe y mezcle hasta que estén bien combinados. Luego agregue los huevos batidos y el tallo de jengibre.", "Coloque las cucharillas en cucharas pares sobre las bandejas forradas, dejando espacio para que se extiendan. Hornee en el horno durante 8-10 minutos. Retire los bizcochos del horno y déjelos a un lado para que se enfríen por completo.", "Derrita el chocolate en un recipiente suspendido sobre una fuente de agua a fuego lento (no permita que el fondo del recipiente toque el agua). Sumerja los bizcochos en el chocolate derretido y colóquelos en una rejilla para enfriar hasta que el chocolate se haya solidificado."], "url": "www_bbc_co_uk_food_recipes_classic_stem_ginger_83286", "title": "Galletas de avena de chocolate y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 24 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_stem_ginger_83286_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "8 huevos de gallinas camperas", "1 cucharada de mostaza integral", "570ml / 1 litro de leche", "75 g / 2¾oz de goteo de carne (o manteca de cerdo)", "6 salchichas de buena calidad", "200ml / 7fl oz de buena calidad jus / stock de ternera (alternativamente use jus de ternera)", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "pizca de sal", "azúcar pizca", "1 manojo de zanahorias baby, recortadas", "300g / 10½ oz guisantes de jardín"], "method": ["Pon la harina en un bol y haz un pozo en el centro. Agregue los huevos y la mostaza y continúe batiendo hasta que quede suave. Poco a poco agregue la leche y una pizca de sal y mezcle con una batidora suave. Coloque en el refrigerador durante al menos cuatro horas, pero preferiblemente durante la noche.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Verter tres cuartas partes de la carne goteando en una lata de asar y calentar en el horno. Calentar una sartén y agregar el resto del goteo. Cuando esté derretido, agregue las salchichas y fría en cada lado hasta que se dore.", "Retire la mezcla de la nevera y mezcle una vez más.", "Coloque las salchichas en la lata para asar y vierta sobre la mezcla. Coloque en el horno durante 30 minutos. Abra brevemente la puerta del horno para permitir que salga el vapor y cocine por otros 10 minutos.", "Mientras tanto, para las verduras, ponga la mantequilla, la sal, el azúcar y 200 ml / 7 fl oz de agua en una sartén profunda. Cuando la mantequilla se haya derretido agregue las zanahorias y cocine durante 3-4 minutos.", "Ponga a hervir una olla grande de agua con sal, agregue los guisantes y cocine por 2-3 minutos. Escurra los guisantes y agregue un poco de mantequilla.", "Caliente el jugo de ternera y sazone con sal y pimienta.", "Corte una sección del sapo en el hoyo y colóquelo en un plato, vierta sobre el jus y sirva las verduras al costado."], "url": "www_bbc_co_uk_food_recipes_classic_toad_in_the_hole_67862", "title": "Sapo clásico en el agujero", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite, para engrasar", "200g / 7oz de mantequilla", "200 g / 7 oz de azúcar en polvo", "½ cucharadita de esencia de vainilla", "4 huevos de gallinas camperas", "Harina de auto crianza de 200g / 7oz, tamizada", "½ jar de mermelada de frambuesa", "Crema doble 175ml / 6fl oz, batida", "Frambuesas 250 g / 9 oz", "2-3 cucharadas de azúcar glas"], "method": ["Precaliente el horno a 190 ° C / 350 ° F / Gas 5. Engrase y alinee 2 latas de sandwich de 20 x 20 cm.", "Mezcle la mantequilla, el azúcar y la esencia de vainilla en un tazón o procesador de alimentos hasta que estén bien combinados.", "Lentamente golpee los huevos uno por uno. Doble la harina tamizada y vierta cuidadosamente la mezcla en las latas preparadas.", "Hornee por 20-25 minutos hasta que estén doradas. Pruebe presionando un pincho en el centro del pastel. Si el pincho sale limpio, el pastel está listo.", "Coloque la torta en una rejilla y déjela enfriar.", "Extienda un pastel con mermelada de frambuesa, seguido de una capa de crema batida. Cubra con las frambuesas y coloque la otra torta encima.", "Para servir, espolvorear con azúcar glas y cortar el pastel en rodajas."], "url": "www_bbc_co_uk_food_recipes_classic_victoria_sponge_45518", "title": "Bizcocho clásico Victoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb de azúcar de mermelada 2 oz", "1 limón, ralladura y jugo", "500g / 1lb 2oz de fresas frescas, descascadas, cortadas a la mitad solo si son grandes", "aceite, para engrasar las latas", "harina, para desempolvar las latas", "250g / 9oz de mantequilla", "250 g / 9 oz de azúcar en polvo", "½ cucharadita de esencia de vainilla", "4 huevos de gallinas camperas", "Harina de auto crianza 250 g / 9 oz, tamizada", "Crema doble 175ml / 6fl oz, batida", "Fresas de 250g / 9oz", "2-3 cucharadas de azúcar glas"], "method": ["Para la mermelada, caliente el azúcar, el jugo de limón y la ralladura y tres cucharadas de agua en una sartén grande, lentamente, hasta que el azúcar se haya derretido.", "Agregue las fresas y revuelva suavemente.", "Llevar la mermelada a ebullición y cocinar durante 3-4 minutos, o hasta 10 minutos si prefieres un atasco más espeso.", "Verifique la temperatura con un termómetro de azúcar: debería alcanzar los 105 ° C / 220 ° F.", "Retire el atasco del fuego y deje que se enfríe un poco. Elimine cualquier espuma con una cuchara limpia, para evitar que el atasco se enturbie.", "Coloque la mermelada en un tarro de mermelada estéril, sello y etiqueta.", "Para la torta, precalentar el horno a 190C / 375F / Gas 5.", "Engrase y enharine dos latas de emparedado de 20cm / 8in.", "Combine la esencia de la mantequilla, el azúcar y la vainilla en un tazón o procesador de alimentos, y mezcle bien hasta obtener una consistencia cremosa.", "Lentamente golpee los huevos uno por uno.", "Doble la harina tamizada y luego vierta la mezcla en las latas preparadas.", "Hornee durante 20-25 minutos hasta que la esponja esté bien levantada, dorada y brota cuando se la presiona.", "Retire los pasteles del horno, sáquelos de sus latas en una rejilla y déjelos enfriar.", "Extienda un pastel con mermelada de fresa, seguido de una capa de crema batida.", "Coloque las fresas frescas sobre la otra torta.", "Polvo con azúcar glas para terminar."], "url": "www_bbc_co_uk_food_recipes_classic_victoria_sponge_54621", "title": "Bizcocho victoria clásico con mermelada de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de masa dulce con brisa", "3 cucharadas de azúcar glas, más extra para quitar el polvo", "175g / 6oz de mantequilla, ablandada", "175g / 6oz de azúcar en polvo", "4 huevos de gallinas camperas", "175gr / 6 oz de almendras molidas", "300 g / 11 oz de mermelada de frambuesa preparada", "40 g / 1½ oz de almendras tostadas", "200g / 7oz de crema coagulada", "Crema doble 250ml / 9fl oz"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Haga rodar la masa dulce de pasta en una superficie de trabajo ligeramente espolvoreada hasta un grosor de 0.5cm / ¼.", "Cubra con cuidado una lata de tarta de 23 cm / 9 pulg. De lados profundos con la masa, presionando la masa en los bordes de la lata.", "Cubra la caja de pastelería con papel resistente a la grasa y rellene con alubias o arroz.", "Coloque la lata de tarta en una bandeja de horno, luego hornee en el horno durante 15 minutos.", "Retire el papel a prueba de grasa y hornee los frijoles o el arroz, luego devuelva la caja agria al horno y hornee por otros 8-10 minutos, o hasta que la masa esté crujiente y dorada. Retire del horno y deje a un lado para que se enfríe un poco.", "Mientras tanto, bata la mantequilla y el azúcar juntos en un tazón hasta que estén pálidos y esponjosos.", "Agriete los huevos, uno a la vez, batiendo bien después de cada adición, hasta que todos los huevos se hayan incorporado por completo a la mezcla.", "Dobla las almendras molidas hasta que estén bien combinadas.", "Cuando la caja de repostería se haya enfriado, extiende el atasco de frambuesa en una capa uniforme en toda la parte inferior de la tarta.", "Vierta la cuchara en la mezcla de almendras y alise la superficie con una espátula.", "Espolvorea la parte superior de la tarta con azúcar glas y luego espolvorea sobre las almendras en copos.", "Regrese la tarta al horno y continúe cocinando durante 25-30 minutos, o hasta que el relleno se haya levantado y esté cocido y la superficie esté dorada. (NB: El relleno se cuece cuando una brocheta insertada en el centro sale limpia).", "Retire la tarta del horno y déjela a un lado para que se enfríe un poco antes de servir.", "Para servir, coloque una rebanada de tarta de Bakewell en el centro de cada una de las 10-12 placas para servir. Coloque una cucharada de crema cuajada encima de cada rebanada. Rocíe la crema doble alrededor del borde de cada plato."], "url": "www_bbc_co_uk_food_recipes_classicbakewelltart_92618", "title": "Bakewell tarta profunda con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cubo de azúcar blanco", "2 guiones amargos", "20ml / ¾fl oz de coñac", "suficiente champaña para llenar el vaso"], "method": ["Coloque el terrón de azúcar en una cuchara y agregue los bitters.", "Coloque el cubo de azúcar empapado en una copa de champán y agregue el coñac.", "Rellene el vaso con champaña y sirva."], "url": "www_bbc_co_uk_food_recipes_classicchampagnecock_84499", "title": "Cóctel clásico de champán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicchampagnecock_84499_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x pechugas de pollo, piel y nudillos todavía unidos", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "150ml / 5fl oz de caldo de pollo", "Pan blanco 200g / 7oz, cortado en cubos pequeños", "pizca de sal", "80ml / 3fl oz de aceite de oliva", "150 g / 5 oz de parmesano, rallado", "2 cucharadas de vinagre de vino blanco", "250g / 10½oz de mayonesa lista para usar", "3 cucharadas de mostaza Dijon", "2 filetes de anchoa, enjuagados", "pizca de sal", "1 diente de ajo, aplastado", "50ml / 2fl oz de aceite de oliva", "1 cos lechuga, rasgada", "12 anchoas (almacenadas en vinagre)", "50 g / 2 oz de virutas de parmesano"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la ensalada, sazone bien el pollo con sal y pimienta negra recién molida.", "Caliente el aceite en una sartén a fuego medio y agregue las pechugas de pollo, con la piel hacia abajo. Freír durante 4-5 minutos, hasta que la piel esté crujiente y dorada.", "Voltee los pechos y fríalos durante 1-2 minutos.", "Transfiera los senos, con la piel hacia arriba, a un plato resistente al horno y vierta el caldo alrededor de la carne. Trate de no verter el caldo sobre la carne.", "Coloque en el horno para cocinar durante 20 minutos o hasta que esté completamente cocido. Pruebe la carne con un pincho en la parte más gruesa; los jugos deben quedar limpios. Retirar del horno y dejar enfriar un poco.", "Mientras tanto, para los crotones, coloque los cubos de pan en una bandeja para hornear, espolvoree sal y rocíe con el aceite.", "Coloque en el fondo del horno y hornee durante 5-6 minutos, o hasta que los crutones estén dorados.", "Para el aderezo, coloque el parmesano y el vinagre en un procesador de alimentos y mezcle hasta que quede muy suave.", "Agregue la mayonesa, la mostaza, los filetes de anchoa, la sal, el ajo y el aceite de oliva y mezcle hasta que quede suave.", "Para servir, coloque la lechuga en un tazón grande, vierta un poco de aderezo y gire suavemente las hojas para cubrir.", "Agregue los croutones y transfiera la ensalada a cuatro cuencos separados.", "Agregue tres anchoas a cada plato y rocíe un poco más de aderezo.", "Tallar cada pechuga de pollo en rodajas gruesas y colocar la mitad del pollo sobre cada plato de ensalada.", "Espolvorear con virutas de parmesano y servir."], "url": "www_bbc_co_uk_food_recipes_classicchickencaesar_86187", "title": "Ensalada César de pollo clásico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "650 g / 1 libra de carne picada 7 oz", "3-4 chalotes de plátano o 7-8 chalotes redondos pequeños, finamente picados", "4 ramitas de tomillo fresco, solo hojas", "2 cucharadas de puré de tomate", "1 cucharada de harina normal", "150ml / 5fl oz de vino tinto", "400ml / 14fl oz de caldo de carne", "sal y pimienta negra recién molida", "Salsa Worcestershire, al gusto", "Patatas King Edward de 900g / 2lb, peladas y picadas", "115g / 4oz de mantequilla", "Crema doble 125ml / 4½fl oz", "sal y pimienta negra recién molida", "150g / 5½oz de guisantes congelados", "50g / 1¾oz de mantequilla"], "method": ["Calentar una sartén grande hasta que se fume, agregar la mitad del aceite de oliva y freír la carne picada, en tandas, durante 4-5 minutos, o hasta que se dore por todas partes.", "Caliente una sartén por separado sobre un poco de calor, agregue el aceite de oliva restante y fríe los chalotes y el tomillo durante 2 o 3 minutos, o hasta que se ablanden. Agregue el puré de tomate y la harina y cocine por un minuto más, luego agregue la carne cocida.", "Desglasar la sartén utilizada para cocinar la carne con el vino tinto, raspando cualquier trozo de caramelo con una cuchara de madera. Cocine por 3-4 minutos, o hasta que el vino se haya reducido a la mitad, luego vierta el vino en la sartén con la carne.", "Agregue el caldo a la sartén y deje hervir a fuego lento durante 45 minutos, o hasta que la carne esté tierna y la mezcla se espese. Sazonar, al gusto, con sal, pimienta negra recién molida y unas gotas de salsa Worcestershire. Mantenga caliente a fuego muy bajo.", "Precalentar la parrilla a alto.", "Para el puré, coloque las papas en una sartén con agua con sal y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Drene y devuelva las papas a la sartén, luego coloque sobre el fuego durante aproximadamente un minuto para eliminar el exceso de humedad. Mash bien con un triturador de patata o ricer, luego agregue la mantequilla y la leche, batiendo para formar un puré suave. Sazonar, al gusto, con sal y pimienta negra recién molida. Con una cuchara, coloca el puré en una manga pastelera.", "Coloque la mezcla de carne picada en una fuente para hornear y vierta el puré sobre la parte superior. Coloque debajo de la parrilla durante 8-10 minutos, o hasta que la parte superior esté dorada. Servir una cucharada en platos para servir.", "Coloque los guisantes en agua en una olla pequeña y cocine por 3-4 minutos, escurra y agregue la mantequilla.", "Para servir, sirva una cucharada del pastel de la casa en platos con los guisantes al lado."], "url": "www_bbc_co_uk_food_recipes_classiccottagepie_90765", "title": "Pastel clásico de la cabaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 110 g / 4 oz, tamizada", "pizca de sal", "2 huevos", "200ml / 7fl oz de leche mezclada con 75ml / 3fl oz de agua", "50g / 2oz de mantequilla", "1 naranja mediana ralladura rallada solamente", "1 cucharada de azúcar en polvo", "150ml / 5fl oz de jugo de naranja (de 3-4 naranjas medianas)", "1 naranja mediana ralladura rallada solamente", "1 limón pequeño, corteza rallada y jugo", "1 cucharada de azúcar en polvo", "3 cucharadas de Grand Marnier, Cointreau o brandy", "50g / 2oz de mantequilla sin sal", "un poco más de Grand Marnier, para flamear"], "method": ["Tamiza la harina y la sal en un tazón grande para mezclar con un colador elevado sobre el tazón para que la harina se ventile. Ahora haga un pozo en el centro de la harina y rompa los huevos en ella. Luego comience a batir los huevos (cualquier tipo de batidor o incluso un tenedor), incorporando cualquier trozo de harina del borde del tazón mientras lo hace.", "A continuación, agregue gradualmente pequeñas cantidades de la mezcla de leche y agua, aún batiendo (no se preocupe por los grumos, ya que eventualmente desaparecerán al batir). Cuando se haya agregado todo el líquido, use una espátula de goma para raspar cualquier trozo esquivo de harina de alrededor del borde hacia el centro, luego bata una vez más hasta que la masa esté suave, con la consistencia de crema fina. Ahora derrita los 50g / 2oz de mantequilla en una sartén. Coloque 2 cucharadas de la mezcla en la masa y empújela, luego vierta el resto en un recipiente y úsela para lubricar la sartén, usando un trozo de papel de cocina para untarlo antes de hacer cada panqueque. Revuelva la ralladura de naranja y el azúcar impalpable en la masa.", "Ahora ponga la sartén bien caliente, baje la temperatura a medio y, para empezar, haga un panqueque de prueba para ver si está usando la cantidad correcta de la mezcla. Estos pequeños crêpes deben ser más delgados que los panqueques básicos, de modo que cuando los prepare, use ½ cucharada de rebozo a la vez en un molde de 18cm / 7 pulgadas. También es útil si vierte la masa en un cucharón para que se pueda verter en la sartén caliente de una sola vez. Tan pronto como la masa golpee la bandeja caliente, voltéela de lado a lado para obtener la base uniformemente cubierta con la mezcla. Solo debería tomarse medio minuto para cocinar; puede levantar el borde con una espátula para ver si está teñida de oro como debería ser. Dale la vuelta al panqueque con una rebanada de pan o una espátula - el otro lado solo necesitará unos segundos - luego simplemente deslízalo hacia afuera de la sartén y colócalo en un plato. Si los panqueques se ven un poco deshilachados en la sartén, no importa porque se van a doblar de todos modos. Deberías terminar con 15-16 crêpes.", "Apila los panqueques a medida que los haces entre las hojas de papel a prueba de grasa en un plato colocado sobre agua hirviendo, para mantenerlos calientes mientras haces el resto.", "Para la salsa, mezcle todos los ingredientes, a excepción de la mantequilla, en un tazón. Al mismo tiempo, caliente los platos en los que se servirán los crêpes. Ahora derrita la mantequilla en la sartén, vierta la salsa y permita que se caliente muy suavemente. A continuación, coloque las primeras crepas en la sartén y deje que se caliente antes de doblarlas por la mitad y luego por la mitad otra vez para hacer una forma triangular. Deslice esto en el borde de la sartén, incline la sartén ligeramente para que la salsa vuelva al centro, luego agregue la próxima crêpe. Continúe de esta manera hasta que todos estén recalentados, doblados y bien empapados con la salsa.", "Puedes flamearlos en este punto si quieres. Caliente un cucharón sosteniéndolo sobre una llama de gas o recostándolo sobre el borde de una placa calefactora, luego, lejos del calor, vierta un poco de licor o brandy en él, regréselo al fuego para calentar el licor y luego encienda la bombilla. lo. Lleve el cucharón llameante a la mesa sobre la sartén y vierta las llamas sobre las crepes antes de servir en los platos calentados."], "url": "www_bbc_co_uk_food_recipes_classiccrepessuzette_66236", "title": "Crêpes clásicos suzette", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classiccrepessuzette_66236_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Ron blanco 50ml / 2fl oz", "35ml / 1½fl oz de jugo de limón fresco", "4 cucharaditas de jarabe de azúcar (a menudo se vende como jarabe Gomme)", "1 cal de cuña"], "method": ["Coloque el ron, el jugo de lima y el jarabe de azúcar en una coctelera y agite bien para combinar.", "Vierta en un vaso de Martini y sirva adornado con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_classicdiaquari_86314", "title": "Daiquiri clásico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20ml / ¾fl oz de jugo de lima fresco (o 1-2 limas, picadas)", "1 cucharada de azúcar en polvo", "2-3 cucharadas de hojas de menta fresca, deja todo", "50ml / 1¾fl oz de ron cubano (u otro)", "mucho hielo picado", "330 ml / 12 fl oz de vidrio", "ramita de menta fresca para adornar"], "method": ["Vierta el jugo de lima en el vaso.", "Agregue el azúcar y revuelva hasta que se disuelva en el jugo de limón. (Si usa limas recién picadas en lugar de jugo de lima, tritúrelas con el azúcar usando un mortero hasta que el azúcar se disuelva).", "Eche las hojas de menta enteras, dejándolas caer donde puedan, incluso dejando que se peguen a los lados del vidrio. El vaso debe estar flojo de menta.", "Vierta hielo picado sobre las hojas de menta para llenar el vaso.", "Con una cuchara, mezcle el hielo con la menta y la lima hasta que la menta comience a romperse. No rompa la menta hasta este punto.", "Cubra con 50 ml de ron y revuelva hasta que esté uniformemente mezclado y el hielo esté ligeramente fangoso.", "Sirva con una ramita de menta en la parte superior."], "url": "www_bbc_co_uk_food_recipes_classicmojito_72225", "title": "Mojito clásico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de vinagre de vino blanco", "1 cucharada de tallos de perejil, toscamente picados", "1 cucharada de perifollo, picado", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa en polvo", "150ml / 5fl oz de aceite de oliva ligero", "150ml / 5fl oz de aceite vegetal", "sal y pimienta negra recién molida", "exprimir jugo de limón"], "method": ["Coloque el vinagre, los tallos de perejil y el perifollo en una olla pequeña y deje que hierva. Cocine a fuego lento hasta que el volumen se reduzca a una cucharada de líquido.", "Cuele el líquido a través de un tamiz y deseche el perejil y el perifollo.", "Coloque las yemas de huevo, la mostaza en polvo y el vinagre infundido en un procesador de alimentos y mezcle.", "Con la licuadora aún en funcionamiento, agregue gradualmente los aceites. Continúe mezclando la mezcla hasta que todo el aceite se haya incorporado y la mezcla se haya espesado.", "Sazonar con sal y pimienta negra recién molida y agregar un chorrito de jugo de limón.", "Poner en un tazón pequeño y servir."], "url": "www_bbc_co_uk_food_recipes_classicmayonnaise_81725", "title": "Mayonesa clásica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["35ml / 1¼fl oz Tequila Reposado", "20ml / ¾fl oz de Cointreau", "35ml / 1¼fl oz de jugo de limón fresco", "puñado de cubitos de hielo", "cuña de lima, para adornar"], "method": ["Vierta el Tequila, el Cointreau y el jugo de lima en una coctelera.", "Agregue un puñado de cubitos de hielo y agite vigorosamente durante 10-15 segundos.", "Cuele en un vaso de Martini con la mitad del borde humedecido con agua, luego sumergido en sal.", "Agregue una cuña de lima en el borde a modo de guarnición."], "url": "www_bbc_co_uk_food_recipes_classicmargarita_84327", "title": "Margarita clásica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicmargarita_84327_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 huevos de gallinas camperas", "190g / 6¾oz de azúcar en polvo", "Crema doble 250ml / 9fl oz", "4 limones, jugo y ralladura", "mantequilla, para engrasar", "harina, para quitar el polvo", "225g / 8oz de masa de pasta brisa lista para usar", "azúcar en polvo, para quitar el polvo", "110g / 4oz de queso de cabra suave", "Crema doble 50ml / 2fl oz", "2 cucharadas de azúcar glas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la tarta de limón, agriete los huevos en un bol y bata suavemente para romper las yemas. Agregue el azúcar y mezcle bien. Agregue la crema y el jugo de limón y revuelva. Pase la mezcla a través de un colador, luego agregue la ralladura de limón y reserve.", "Engrase un anillo de flan de 20 cm con mantequilla. Estirar la masa en una superficie ligeramente enharinada para hacer un círculo lo suficientemente grande como para caber sobre el anillo de flan. Usando el rodillo, cuidadosamente levante la masa sobre el anillo y presione suavemente dentro del anillo. Permita que la masa sobresalga ligeramente de los bordes del anillo. Haga una línea con un círculo de papel a prueba de grasa y rellene con arroz o frijoles para hornear.", "Transfiera al horno y hornee durante aproximadamente 15 minutos. Retire del horno y retire los frijoles y el papel resistente a las grasas, luego vuelva al horno durante cinco minutos, o hasta que la caja de tarta esté ligeramente dorada.", "Baje el horno a 150C / 300F / Gas 2 y vierta la mezcla de limón en la caja de tarta. Hornee en el horno durante aproximadamente una hora, o hasta que el relleno esté recién hecho y la masa esté dorada.", "Retire la tarta del horno y recorte los bordes de la masa. Deje que se enfríe completamente, luego colóquelo en la nevera para enfriar durante aproximadamente dos horas.", "Precalentar la parrilla a mediano.", "Espolvorea la parte superior de la tarta generosamente con azúcar glas y luego ponla debajo de la parrilla hasta que esté caramelizada.", "Para la crema de queso de cabra, coloque el queso de cabra en un tazón con la crema y el azúcar glas y mezcle bien.", "Para servir, corte la tarta en rodajas y sirva con una cucharada de crema de queso de cabra."], "url": "www_bbc_co_uk_food_recipes_classiclemontart_86198", "title": "Tarta clásica de limón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classiclemontart_86198_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "175ml / 6fl oz de vino blanco", "Mejillones vivos de 250g / 9oz, rellenado, limpiado y enjuagado", "3 cucharadas de crema doble", "2 cucharadas de perejil fresco picado", "pan blanco crujiente, para servir"], "method": ["Toque los mejillones contra una superficie dura y deseche los que no se cierren.", "Caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 3-4 minutos, o hasta que estén blandos. Vierta el vino blanco y cocine a fuego lento, luego agregue los mejillones y cubra con una tapa durante 4-5 minutos, o hasta que los mejillones se hayan abierto. Deseche cualquier mejillón sin abrir.", "Agregue la crema y el perejil y la cuchara en un tazón para servir. Sirva inmediatamente con el pan para limpiar los jugos."], "url": "www_bbc_co_uk_food_recipes_classicmoulesmarinie_90477", "title": "Mejillones clásicos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7¼ oz de mayonesa", "2-3 cucharadas de ketchup de tomate", "pizca de cayena", "exprimir jugo de limón", "dash Tabasco, al gusto", "guisa salsa Worcestershire, al gusto", "splash brandy, al gusto", "½ lechuga iceberg, finamente picada", "250 g / 8¾oz de gambas peladas grandes y pequeñas", "pimienta de cayena, al gusto", "4 rebanadas de manzana Braeburn", "4 ramitas de eneldo fresco", "cuñas de limón, para adornar", "1 ciabatta, cortado en rodajas finas y tostado"], "method": ["Para la salsa de marie-rose, mezcle la mayonesa, el ketchup, la pimienta de cayena y el jugo de limón en un tazón grande. Sazone, al gusto, con Tabasco, salsa Worcestershire y un chorrito de brandy. Revuelve para combinar.", "Para el cóctel de gambas, coloque una cucharada de salsa de marie-rose en el fondo de cuatro vasos para servir. Divida la lechuga por igual entre los vasos. Coloque otra capa de salsa en la parte superior.", "Coloque las gambas en la parte superior y termine con una cucharada final de salsa (cualquier salsa restante puede cubrirse y almacenarse en la nevera durante 2-3 días y utilizarse para otras recetas).", "Espolvorear con un poco de pimienta de cayena y cubrir con una rodaja de manzana y una ramita de eneldo. Adorne con una rodaja de limón y sirva con una rebanada de pan ciabatta tostado."], "url": "www_bbc_co_uk_food_recipes_classicprawncocktail_91163", "title": "Cóctel de gambas clásico con pan rústico tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de chocolate negro de buena calidad, con un mínimo de 70% de sólidos de cacao, picados", "175ml / 6fl de leche en oz", "2 cucharadas de crema doble", "30 g / 1 oz de azúcar en polvo", "30g / 1¼ oz de mantequilla fría, cortada en cubos"], "method": ["Ponga un poco de agua a hervir en una sartén, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue el chocolate y derrita lentamente, revolviendo de vez en cuando, hasta que quede muy suave. Retire el tazón del fuego.", "Llevar la leche, la crema y el azúcar a ebullición en una cacerola a fuego medio, batiendo continuamente.", "Vierta la mezcla de crema hirviendo sobre el chocolate derretido, batiendo continuamente hasta que la mezcla esté suave y bien combinada.", "Regrese la mezcla de chocolate y crema a la sartén y caliente hasta que hierva a fuego lento, revolviendo continuamente. Deje burbujear sobre el fuego durante unos segundos, luego apague el fuego y bata la mantequilla, un cubo a la vez, hasta que la salsa esté suave y brillante y toda la mantequilla se haya derretido.", "Cuele la salsa de chocolate a través de un colador fino, luego sirva inmediatamente. (Sugerencia para servir: vierta la salsa de chocolate sobre los merengues preparados)."], "url": "www_bbc_co_uk_food_recipes_classicrichchocolate_93211", "title": "Clásica salsa de chocolate rico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicrichchocolate_93211_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g de frutas frescas de verano", "jugo y corteza rallada de 1 naranja grande", "2 - 3 cucharadas de licor de naranja como Cointreau o Grand Marnier", "2 claras de huevo", "100 g de azúcar en polvo"], "method": ["Coloque la fruta, corteza de naranja y jugo, licor y 175 ml de agua en un procesador de alimentos y mezcle hasta que quede suave. Me gusta dejar semillas pero puedes tamizar tu mezcla si lo prefieres.", "Si tiene una máquina para hacer helados, agite la mezcla hasta que comience a congelarse, o viértala en un recipiente rígido y congélela, revolviendo cada 30 minutos aproximadamente hasta que los cristales de hielo comiencen a formarse y se sienta esponjoso.", "Batir las claras de huevo hasta que estén tieso y luego agregar gradualmente el azúcar batir hasta que esté firme y brillante. Doble el merengue en la mezcla de fruta congelante y continúe congelando y revuelva hasta que esté completamente congelado. Si lo hace por adelantado, transfiera la mezcla a la nevera 30 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_classicsummerberryso_70045", "title": "Sorbete clásico de bayas de verano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicsummerberryso_70045_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["290ml / ½pt de agua", "1 carcasa de poussin", "3 dientes de ajo, ligeramente triturados", "puñado de hierbas frescas (romero, salvia, perejil)", "1 cucharada de aceite de oliva", "½ cebolla roja, pelada y picada", "110 g / 4 oz de champiñones, en rodajas", "1 cucharadita de aceite de sésamo", "1 cucharadita de salsa de soja", "1 cucharadita de vinagre de vino tinto", "dash salsa Tabasco", "pizca de copos de chile", "puñado de perejil fresco de flatleaf, picado"], "method": ["Para el caldo, coloque el agua, la carcasa de poussin, el ajo y las hierbas en una sartén y deje que hierva. Hierva durante 8-10 minutos y luego cuele el caldo, descartando los huesos y reservando el líquido.", "Calentar el aceite en una sartén mediana y saltear la cebolla roja durante unos minutos para suavizar. Agregue el champiñón y saltee por 1-2 minutos más.", "Agregue el aceite de sésamo, la salsa de soja, el vinagre, la salsa Tabasco, el chile y el perejil y mezcle bien.", "Verter en el caldo, llevar a ebullición, luego reducir el fuego y hervir a fuego lento durante 10-12 minutos.", "Cucharee en un tazón y sirva."], "url": "www_bbc_co_uk_food_recipes_clearmushroombroth_79268", "title": "Caldo claro de setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de oliva", "½ chile rojo, finamente picado", "1 diente de ajo, aplastado", "2 cucharaditas de salsa de soja", "1 lima, ralladura y jugo", "150ml / ¼ pinta de caldo de verduras", "100 g / 3½ oz de champiñones shiitake", "Fideos de arroz 150 g / 5½ oz", "3 hojas de choy sum, más o menos picadas", "300ml / ½ pinta de aceite vegetal, para freír", "Fideos de arroz medio 150 g / 5½ oz"], "method": ["Para el caldo, caliente el aceite de oliva en una sartén y fría el chile y el ajo durante un minuto.", "Agregue la salsa de soja, la ralladura de lima y el caldo de verduras y deje que hierva.", "Agregue los hongos shiitake y los fideos de arroz y reduzca a fuego lento a fuego lento. Cocine por otros tres minutos o hasta que estén tiernos.", "Agregue la suma de choy y el jugo de lima y cocine a fuego lento por otros dos minutos.", "Viértalo en un recipiente y manténgalo caliente.", "Para la torta de fideos crujiente, caliente el aceite en una cacerola de base pesada, hasta que la miga de pan chisporrotee suavemente. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje desatendido).", "Freír los fideos durante 1-2 minutos, hasta que estén hinchados y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Sirva el caldo cubierto con la torta de fideos crujiente."], "url": "www_bbc_co_uk_food_recipes_clearmushroombrothwi_86857", "title": "Caldo de hongos claro con suma choy y pastel de fideos crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]