[{"ingredients": ["Habas baby de 120g / 4½oz, sin cápsulas (peso envasada)", "55 g / 2 oz de pata negra muy finamente cortada o jamón curado español de alta calidad similar, desgarrada (las rodajas serán tan delgadas que deberían dar como resultado pequeñas virutas de jamón)", "1 diente de ajo pequeño, pelado, finamente picado", "1 cucharada de aceite de oliva extra virgen", "salpicaduras de vinagre de jerez", "copos de sal marina y pimienta negra recién molida"], "method": ["Cocine las habas en polvo en una sartén con agua hirviendo y en sal durante 2-3 minutos, o hasta que estén tiernas. Escurrir bien, luego actualizar en agua fría. Cuando esté lo suficientemente frío para manipularlo, retire las membranas externas.", "En un tazón, mezcle las habas cocidas, los trozos de jamón pata negra y el ajo picado hasta que estén bien combinados.", "Rocíe el aceite de oliva y un chorrito de vinagre de jerez, luego sazone al gusto con sal y pimienta negra recién molida y revuelva bien. (Nota: recuerde que el jamón curado será salado.) Sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_broadbeanswithpatane_91729", "title": "Habas con jamón pata negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broadbeanswithpatane_91729_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de habas sin cáscara, descongeladas si se congelaron, blanquearon y quitaron las cáscaras", "30g / 1oz de mantequilla", "1 cebolla picada", "1 apio en barra, finamente cortado", "2 cucharadas de arroz con leche", "1 ramita generosa de verano fresca sabrosa o tomillo", "1 litro / 1¾ pintas de caldo de pollo caliente o caldo de verduras", "sal y pimienta negra recién molida", "115ml / 4fl oz de yogur al estilo griego", "puñado de hojas de menta fresca, picada", "4 pequeñas ramitas de menta fresca", "pimentón o pimienta de cayena, para quitar el polvo"], "method": ["Tome aproximadamente un octavo de las habas blanqueadas, pique aproximadamente y reserve.", "Calentar la mantequilla en una sartén tapada con fondo grueso. Agregue la cebolla y el apio, cubra y transpire a fuego lento durante unos diez minutos o hasta que estén tiernos.", "Agregue el arroz y el ajedrea o el tomillo y cocine por otro minuto, sin tapar.", "Agregue las habas, excepto las picadas reservadas, y el caldo. Sazonar con sal y pimienta negra recién molida, llevar a ebullición, reducir el fuego y hervir a fuego lento durante unos diez minutos, o hasta que el arroz esté tierno. Retire el tallo salado o tomillo, luego deje que se enfríe un poco.", "Vierta la sopa en un procesador de alimentos en lotes y mezcle hasta que quede suave.", "Poco antes de servir, vuelva a calentar la sopa a fondo, luego quite el fuego.", "Agregue una cucharada de yogur, junto con los frijoles reservados y la menta picada y mezcle bien. Mezcle una segunda cucharada de yogur y continúe removiendo, una cucharada a la vez, hasta que se incorpore todo el yogur. Prueba y ajusta el sazón.", "Para servir, vierta la sopa en tazones y cubra con una ramita de menta y una ligera capa de pimentón o pimienta de cayena."], "url": "www_bbc_co_uk_food_recipes_broadbeanyoghurtandm_85610", "title": "Sopa de habas, yogur y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de harina integral, más extra para quitar el polvo", "3 huevos de gallinas camperas", "1 cucharada de aceite de oliva", "½ cucharadita de sal marina", "Brócoli 180g / 6oz, cortado en floretes y el tallo en rodajas gruesas", "3 cucharadas de aceite de oliva virgen extra", "4 anchoas, aproximadamente picadas", "20g / ¾oz de parmesano recién rallado", "pimienta negra recién molida"], "method": ["Para la pasta (si se hace a mano), ponga la harina en un tazón grande, luego haga un pozo en el centro. Agregue los huevos, el aceite de oliva y la sal y mezcle en el centro. Poco a poco, tire un poco de harina cada vez que mezcle la mezcla. Desea agregar gradualmente la harina a los huevos para hacer una masa firme y lisa. Aplaste la masa en un disco de aproximadamente 1 cm / ½ pulgadas de espesor, luego envuélvala en una película adhesiva y déjela enfriar durante 20 minutos en la nevera.", "Cuando la pasta esté fría, retírela y colóquela en una superficie de trabajo ligeramente enharinada. Corta por la mitad y luego usa un rodillo para aplanar la masa en un rectángulo, girando la pasta sobre la marcha para asegurarte de que tienes un grosor homogéneo. Haga rodar cada pedazo de pasta hasta aproximadamente 2 mm de grosor; cuanto más delgado, mejor. Cuando la pasta esté lo más delgada posible, córtela en tiras de unos 3 mm de ancho para tallarines o diluyente para linguini.", "Cuelgue un rodillo o similar para que la pasta se seque un poco mientras prepara la salsa.", "Para hacer la pasta a máquina: incline la harina en un procesador de alimentos, luego agregue los huevos, el aceite de oliva y la sal y presione hasta que la mezcla forme migas pequeñas. Inclínese hacia una superficie de trabajo y aplaste una bola, luego amase, tirando de la masa por un par de minutos, hasta que quede suave.", "Harina los rodillos de la máquina de pasta. Corta la pasta por la mitad y, usando un rodillo, rueda hacia un rectángulo de aproximadamente 5 mm de grosor. Comenzando por la posición más gruesa, introduzca la masa a través de la máquina, gire la manija con una mano y sostenga la masa a medida que pasa por la máquina con la otra. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla si es necesario y alimente la hoja de pasta a través de la máquina de la misma manera. Continúe, reduciendo la apertura cada vez; es posible que deba cortar la pasta por la mitad a medida que avanza hacia el final. Doble la pasta por la mitad a lo largo y luego córtela en tiras como se indica arriba.", "Para la salsa, agregue el brócoli a agua hirviendo durante 4-5 minutos hasta que esté tierno.", "Mientras tanto, trae una olla grande de agua con sal al hervor. Agregue la pasta y cocine durante 3-4 minutos hasta que salga a la superficie. Drene en un colador, reservando parte del agua de cocción.", "Agregue el brócoli a la pasta y agregue las anchoas y mezcle bien para combinar. Agregue 2 cucharadas de agua de cocción y cocine durante 1 minuto revolviendo sobre la marcha. La pasta debe estar cubierta con brócoli y anchoa.", "Acumula la pasta en tazones para servir, luego completa con el parmesano."], "url": "www_bbc_co_uk_food_recipes_broccoli_and_anchovy_27818", "title": "Brócoli y pasta de anchoas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoli_and_anchovy_27818_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de penne seca 300 g / 10 oz", "500 g / 1 libra de brócoli de 2 onzas, cortado en florecillas", "110g / 4oz de mantequilla", "75g / 3oz de almendras en copos", "Pan rallado blanco de 50g / 2oz", "1 limón, solo jugo", "parmesano (o una alternativa vegetariana), para servir"], "method": ["Llevar a ebullición una sartén grande de agua salada. Agregue la pasta y cocine según las instrucciones del paquete.", "Mientras tanto, trae una sartén aparte de agua con sal al hervor. Agregue el brócoli y hierva por 2-3 minutos, hasta que esté suave. Escurra el brócoli en un colador.", "Calentar una sartén a fuego medio. Agregue la mantequilla y fría hasta que se derrita y comience a dorarse.", "Agregue las almendras y las migajas de pan y caliente hasta que el pan rallado esté dorado.", "Agregue el brócoli y revuelva bien para cubrir con almendras y pan rallado.", "Agregue el jugo de limón y sazone, al gusto, con sal y pimienta negra recién molida.", "Agregue la pasta de penne cocida y mezcle bien.", "Para servir, coloca porciones iguales de pasta y brócoli en tazones y decora con parmesano recién rallado."], "url": "www_bbc_co_uk_food_recipes_broccolialmondandlem_89918", "title": "Penne de brócoli, almendra y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de harina natural", "450ml / 16fl oz de leche entera", "1 cucharadita de mostaza inglesa", "1 cucharadita de salsa Worcestershire", "Queso cheddar 200 g / 7 oz, rallado", "50 g / 1¾oz de mantequilla sin sal", "2 puerros, en rodajas", "½ pan brioche, cortado en cubos de 2cm / 1in", "200g / 7oz de brócoli, cortado en florecillas", "200 g / 7 oz de coliflor, cortada en florecillas", "150g / 5½oz de queso cazador furtivo de Lincolnshire, rallado", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de Jerez", "1 cucharadita de mostaza Dijon", "1 limón, solo jugo", "sal y pimienta negra recién molida", "2 cabezas bebé gema lechuga, hojas separadas", "150g / 5½oz Tenderstem brócoli, hervida hasta que esté tierna", "Brócoli romanesco 150 g / 5½ oz, cortado en floretes, hervido hasta que esté tierno"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Para la salsa de queso, derrita la mantequilla en una sartén grande, agregue la harina y cocine por 2-3 minutos.", "Poco a poco agregue la leche, batiendo todo el tiempo hasta que la leche esté completamente incorporada y la salsa se espese.", "Una vez que tenga una salsa suave agregue la mostaza, la salsa Worcestershire y el queso rallado.", "Para hornear, derrita 25 g / 1 oz de la mantequilla en una sartén mediana, luego agregue los puerros picados. Cocine por 2-3 minutos hasta que se ablanden y luego agregue a la salsa de queso.", "Derrita el resto de la mantequilla en una sartén limpia y fríe con cuidado los cubos de brioche.", "En una olla grande de agua hirviendo, cocine el brócoli y la coliflor durante 2-3 minutos y escurra.", "Tome un plato a prueba de horno y coloque el brócoli, la coliflor, la salsa y el brioche, termine con una capa del queso cazador furtivo de Lincolnshire y brioche. Hornee en el horno precalentado durante 25-30 minutos.", "Para el aderezo, vierta el aceite y el vinagre en un recipiente pequeño de vidrio y mezcle la mostaza y el jugo de limón. Condimentar con sal y pimienta.", "Para servir, coloque las hojas de la gema del bebé en un recipiente, vierta el aderezo y mezcle para combinar.", "Coloque la fuente en un plato y sirva el brócoli junto con la ensalada en un tazón pequeño."], "url": "www_bbc_co_uk_food_recipes_broccoli_and_cauliflower_17520", "title": "Brocheta de brócoli y coliflor horneada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "100g / 3½ oz de florecillas de brócoli, cortadas en pedazos", "55 g / 2 oz de champiñones castaños, en rodajas", "55 g / 2 oz de jamón de Parma, cortado en trozos", "2 cucharadas de vinagre balsámico", "1 huevo de gallina, escalfado a tu gusto", "Queso Gorgonzola de 55g / 2oz, picado"], "method": ["Calentar dos cucharadas de aceite de oliva en una sartén y freír el brócoli, las setas y el jamón durante 5-6 minutos.", "Retire del fuego, agregue el vinagre balsámico y el aceite restante y revuelva para cubrir.", "Sirva el brócoli, las setas y el jamón en un plato con el huevo escalfado encima y el Gorgonzola picado."], "url": "www_bbc_co_uk_food_recipes_broccoliandhamsalad_88904", "title": "Brócoli y jamón con huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, picada", "½ patata, pelada y picada", "1 cabeza de brócoli, picado", "400ml / 14 fl oz de caldo de verduras", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "½ pan blanco pequeño pan de campo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "85g / 3oz de queso cheddar, picado", "3 cucharadas de tomillo fresco picado", "2 cucharadas de miel", "1 cucharada de crema doble, a llovizna"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la sopa, caliente el aceite de oliva en una sartén y fríe con cuidado la cebolla y la papa durante 3-4 minutos, o hasta que la cebolla se ablande. Agregue el brócoli y el caldo. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 5-6 minutos, o hasta que la papa y el brócoli estén tiernos.", "Agregue la crema y condimente, al gusto, con sal y pimienta negra recién molida. Licuar usando una batidora hasta que quede suave.", "Para el pan, ahueque el centro del pan y sazone bien con sal y pimienta negra recién molida. Rocíe el aceite, espolvoree el queso y el tomillo y finalmente rocíe la miel. Coloque en el horno para hornear durante 4-5 minutos, o hasta que el queso comience a derretirse.", "Servir junto con un plato de sopa, adornado con una llovizna de crema."], "url": "www_bbc_co_uk_food_recipes_broccoliandpotatosou_90315", "title": "Sopa de brócoli y papa con queso, miel y pan relleno de tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "½ cebolla, pelada, picada", "½ patata, pelada, en rodajas", "½ cabeza de brócoli, cortado en pequeños floretes", "400ml / 14fl oz de caldo de pollo o vegetal", "2 cucharadas de crema doble", "1 puñado de hojas frescas de albahaca", "2 cucharadas de piñones, tostados", "4 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 cucharada de crema doble", "1 cucharada de hojas frescas de perejil de flatleaf picadas", "1 cucharada de perifollo fresco picado"], "method": ["Para la sopa, caliente la mantequilla en una sartén a fuego medio y fría la cebolla durante 3-4 minutos, hasta que se ablande.", "Agregue la papa y el brócoli a la sartén y revuelva. Agregue el caldo de pollo y lleve la mezcla a fuego lento. Cocine a fuego lento durante 8-10 minutos, o hasta que los vegetales estén tiernos, luego agregue la crema.", "Mezcle la mezcla con una batidora hasta que quede suave.", "Para el pistou, mezcle todos los ingredientes pistou en un procesador de alimentos hasta que quede suave.", "Sirve la sopa en un tazón con el pistou y la crema rociados sobre la parte superior. Adornar con el perejil picado y el perifollo."], "url": "www_bbc_co_uk_food_recipes_broccoliandpotatosou_92460", "title": "Sopa de brócoli y papa con pistou cremoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Brócoli de 350g / 12oz, floretes y tallos cortados en pedazos pequeños", "400ml / 14fl oz de caldo de verduras", "25g / 1oz de mantequilla", "4 cebolletas, finamente cortadas", "50g / 1¾oz Stilton, desmenuzado, o al gusto", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "pizca de nuez moscada recién rallada", "4 rebanadas de pan francés", "100g / 3½oz Stilton, en rodajas"], "method": ["Para la sopa, coloque los trozos de brócoli en un recipiente de vidrio. Vierta sobre el caldo de verduras.", "Cubra el recipiente con film transparente y colóquelo en el microondas. Cocine a plena potencia durante cuatro minutos o hasta que estén tiernos.", "Mientras tanto, caliente una sartén hasta que esté caliente y luego agregue la mantequilla. Cuando empiece a formar espuma, agregue las cebolletas y cocine por un minuto.", "Transfiera el brócoli cocido y el caldo a un procesador de alimentos. Agregue las cebollas fritas de primavera, Stilton y crema y mezcle hasta que quede suave.", "Transfiera la mezcla mezclada a una sartén y cocine a fuego lento.", "Mientras tanto, para los croûtons, tueste el pan francés bajo una parrilla hasta que se dore por ambos lados.", "Cubra el pan a la parrilla con las rebanadas de Stilton y vuelva a la parrilla hasta que se dore y burbujee.", "Sazonar la sopa con sal, pimienta negra recién molida y una pizca de nuez moscada.", "Divida la sopa por igual entre cuatro cuencos calientes y cubra cada uno con un croûton Stilton. Servir."], "url": "www_bbc_co_uk_food_recipes_broccoliandstiltonso_76390", "title": "Sopa de brócoli y Stilton con croûtons de Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandstiltonso_76390_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla picada", "1 cucharadita de aceite de oliva", "20 g / oz de mantequilla", "Harina normal de 20g / ¾oz", "150ml / 5fl de leche en oz", "50 g / 1¾oz de queso parmesano, rallado", "150 g / 5¼ oz de filete de salmón", "150 g / 5¼ oz de brócoli, cortado en floretes y al vapor", "2 zanahorias, cortadas en porras y al vapor", "6 tomates cherry"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Suavemente fría las cebollas en el aceite en una cacerola y cocine hasta que estén suaves. Agregue la mantequilla y la harina. Mezcle bien, cocinando a fuego lento durante un minuto.", "Vierta la leche gradualmente hasta que todo esté combinado. Cocine por dos minutos.", "Agregue la mitad del queso a la salsa y reserve la otra mitad.", "Mientras tanto, freír el filete de salmón durante un minuto en cada lado.", "Coloque el filete de salmón en un plato pequeño a prueba de horno.", "Agregue el brócoli, las zanahorias y los tomates cherry al plato.", "Vierta sobre la salsa y cubra con el resto del queso.", "Hornee en el horno durante diez minutos o hasta que burbujee y se dore."], "url": "www_bbc_co_uk_food_recipes_broccoliandsalmonbak_77132", "title": "Brócoli y salmón horneado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandsalmonbak_77132_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "½ cebolla, finamente picada", "1 diente de ajo, picado", "3 tallos de brócoli brotación púrpura, picado", "2 cucharadas de alcaparras, enjuagadas y escurridas", "1 tomate maduro, toscamente picado", "150ml / ¼ pinta de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "2 cucharadas de crema doble", "puñado de cebolletas frescas, picadas, para servir"], "method": ["Caliente la mantequilla en una cacerola grande y fría la cebolla hasta que se suavice pero no se coloree. Agregue el ajo y cocine por un minuto.", "Agregue el brócoli, las alcaparras, el tomate picado y el caldo a la sartén y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante 5-6 minutos, o hasta que el brócoli esté tierno. Agregue la crema, retire del fuego y deje que se enfríe un poco.", "Vierta la sopa en un procesador de alimentos y mezcle hasta que quede suave. Si es necesario, devuelva la sopa a la sartén y recaliente suavemente.", "Para servir, vierta la sopa en un recipiente y espolvoree sobre la cebolleta."], "url": "www_bbc_co_uk_food_recipes_broccolicaperandtoma_85484", "title": "Sopa de brócoli, alcaparras y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de aceite vegetal caliente", "100g / 3½ oz de harina de auto crianza", "1 cucharada de semillas de comino", "1 cucharada de semillas de sésamo", "30 ml / 1 fl oz de agua con gas", "7 florecillas de brócoli"], "method": ["Calentar el aceite vegetal en una olla profunda de fondo grueso, hasta que la miga de pan chisporrotea y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso; ¡no lo deje sin supervisión!)", "Coloque la harina, las semillas de comino y las semillas de sésamo en un tazón grande y mezcle.", "Agregue el agua con gas y bata vigorosamente para formar una masa.", "Sumerja los floretes de brócoli en la mezcla y colóquelos cuidadosamente en el aceite caliente y fría en lotes, para no saturar la sartén. Retire con cuidado con una cuchara ranurada y drene en toallas de cocina.", "Para servir, colóquelo en un recipiente tibio."], "url": "www_bbc_co_uk_food_recipes_broccolifritters_83422", "title": "Buñuelos de brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "100g / 3½oz Tentedtem brócoli, picado", "2 cucharadas de piñones, tostados", "1 limón, ralladura y jugo", "sal y pimienta negra recién molida", "125g / 4½oz de pasta fresca de penne", "2 cucharadas de aceite de oliva", "pecorino rallado, para servir"], "method": ["Derrita la mantequilla en una cacerola, agregue el brócoli y los piñones y fríalos suavemente durante tres minutos. Agregue la ralladura de limón y el jugo, sazone bien con sal y pimienta negra recién molida y retire del fuego.", "Cocine el penne de acuerdo con las instrucciones del paquete y escurra, dejando un poco del líquido de cocción en la sartén. Agregue la mezcla de brócoli al penne cocido, rocíe sobre el aceite de oliva y revuelva bien.", "Para servir, espolvorear en un tazón para servir y esparcir con pecorino rallado."], "url": "www_bbc_co_uk_food_recipes_broccolilemonandpine_88287", "title": "Penne de brócoli, limón y piñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cabeza de brócoli, cortada en florecillas, blanqueada", "puñado de albahaca fresca", "puñado de perejil fresco, picado", "puñado de cilantro fresco, picado", "1 naranja, pelado, picado", "1 cucharada de semillas de sésamo", "1 cucharada de aceite de oliva", "1 cucharada de vinagre balsámico", "50g / 1¾oz de semillas de granada"], "method": ["Coloque el brócoli, las hierbas y los pedazos de naranja en un tazón. Dispersar sobre las semillas de sésamo, rociar sobre el aceite y el vinagre y mezclar bien.", "Para servir, espolvorea las semillas de granada sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_broccolipomegranatea_84997", "title": "Ensalada de brócoli, granada y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Florecillas de brócoli 110 g / 4 oz", "pizca de sal", "½ cucharadita de cúrcuma molida", "1 cucharada de mostaza integral", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de miel", "1 cucharada de aceite de oliva"], "method": ["Para la ensalada, coloque el brócoli en una sartén y cúbralo con agua. Agregue una pizca de sal y deje que hierva. Cocine a fuego lento durante 3-4 minutos, o hasta que esté tierno.", "Escurrir e inmediatamente correr bajo agua fría hasta que se enfríen.", "Para la vinagreta, mezcle todos los ingredientes para el aderezo en un tazón.", "Para servir, agregue el brócoli al tazón y mezcle hasta que esté uniformemente cubierto en el aderezo."], "url": "www_bbc_co_uk_food_recipes_broccolisaladwithspi_86016", "title": "Ensalada de brócoli con vinagreta picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, picado", "250ml / 8¾fl oz de caldo de pollo o vegetal (más si es necesario)", "Floretes de brócoli 200g / 7oz", "sal y pimienta negra recién molida", "crema de llovizna, para servir"], "method": ["Calentar el aceite en una cacerola y freír el ajo durante 1-2 minutos.", "Vierta el caldo de pollo o verduras en la sartén y agregue las flores de brócoli.", "Llevar a ebullición y reducir el fuego y hervir a fuego lento durante 10-12 minutos, hasta que el brócoli esté tierno.", "Sazone con sal y pimienta, luego transfiera a un licuador. Mezclar hasta que esté suave.", "Vierte la sopa en tazones para servir y rocía con crema para servir."], "url": "www_bbc_co_uk_food_recipes_broccolisoup_76607", "title": "Sopa de brocoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccolisoup_76607_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "½ cebolla, finamente picada", "½ cabeza de brócoli, picada en florecillas", "150ml / ¼ litro de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "yogur natural, para servir"], "method": ["Caliente la mantequilla en una cacerola y fríela suavemente hasta que esté blanda pero no coloreada.", "Agregue el brócoli y el caldo, lleve a ebullición y hierva rápidamente durante 3-4 minutos, o hasta que el brócoli esté tierno.", "Sazonar con sal y pimienta negra recién molida y licuar la sopa con una batidora de mano hasta que quede suave.", "Para servir, vierta la sopa en un tazón y cubra con una cucharada de yogur."], "url": "www_bbc_co_uk_food_recipes_broccolisoup_85318", "title": "Sopa de brocoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cabeza de brócoli, picada, tallo principal descartado", "½ cebolla, picada", "250ml de caldo de verduras", "2 cucharadas de crema doble"], "method": ["Coloque el aceite de oliva en una cacerola mediana a fuego medio. Agregue el brócoli y la cebolla y fría por dos minutos para ablandar la cebolla.", "Agregue el caldo, lleve a ebullición y reduzca el fuego a fuego lento durante ocho minutos, hasta que el brócoli se haya cocinado.", "Mezcle con una batidora de mano hasta que quede suave, luego vierta en un bol y sirva rociada con crema."], "url": "www_bbc_co_uk_food_recipes_broccolisoup_79944", "title": "Sopa de brocoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 diente de ajo, picado", "300ml / 10½fl oz de caldo de pollo", "1 cucharada de cebolletas frescas picadas", "1 cabeza de brócoli, dividida en florecillas", "Crema doble 50ml / 2fl oz", "1 cucharada de aceite de oliva virgen extra, para servir", "100 g / 3½ oz de mantequilla, cortada en cubitos", "Harina de auto crianza de 200g / 7oz", "1 huevo de gallinas camperas", "sal y pimienta negra recién molida", "25-50ml / 1-2fl oz de leche", "55g / 2oz de queso cheddar maduro, rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la sopa, coloque todos los ingredientes, excepto el aceite en una cacerola a fuego medio. Llevar a ebullición y reducir el fuego a fuego lento durante diez minutos, o hasta que el brócoli esté suave. Mezcle con una batidora de mano hasta que quede suave.", "Mientras tanto, para los bollos, coloque la mantequilla y la harina en un procesador de alimentos. Mezcle hasta que la mezcla tenga la textura de pan rallado fino.", "Agregue el huevo y la sal y pimienta negra recién molida y mezcle para combinar. Continúe mezclando, agregando gradualmente la leche, para hacer una masa suave, pero no pegajosa.", "Forme la masa en rondas con las manos enharinadas y coloque en una bandeja para hornear. Espolvoree sobre el queso cheddar y colóquelo en el horno para hornear por diez minutos, o hasta que se levante y se dore.", "Para servir, ponga la sopa en un cuenco, rocíe el aceite y sirva con un bollo de queso."], "url": "www_bbc_co_uk_food_recipes_broccolisoupwithchee_80568", "title": "Sopa de brócoli con bollos de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paletilla de cerdo de 320 g / 11½ oz, lavada, seca, sin piel", "Vientre de cerdo de 500 g / 1 lb 2 oz, lavado, secado, sin piel", "500g / 1lb 2oz huesos de cerdo", "2 cebollas, cortadas a la mitad", "3 tallos de limoncillo, partidos por la mitad", "2cm / ¾en jengibre fresco, en rodajas", "1 chalote de plátano, pelado y reducido a la mitad", "Anís de 2 estrellas", "1 cucharadita de sal marina", "1 cucharadita de pimienta blanca molida", "5 dientes de ajo, picados", "Jengibre fresco de raíz de 5cm / 2in en pieza, pelado, más o menos picado", "2 chalotes, pelados", "2 tallos de limoncillo, pelados", "Anís de 2 estrellas", "3 cucharadas de salsa de soja ligera baja en sodio", "3 cucharadas de vino de arroz Shaoxing o jerez seco", "1 cucharada de salsa de soja oscura", "1 cucharada de salsa de pescado", "1 cucharada de azúcar demerara o azúcar de palma", "1 cucharadita de polvo chino de cinco especias", "¼ cucharadita de sal", "½ cucharadita de pimienta negra recién molida", "400 g / 14oz de fideos de arroz planos de 5 mm de ancho", "1 cucharada de aceite de colza", "2cm / ¾en jengibre fresco, en rodajas", "aceite vegetal, para freír", "100g / 3½oz de brotes de soja", "media cabeza de lechuga romana, tallo retirado, hojas largas separadas, lavadas, secas, cortadas por el centro", "30 g / 1 oz de menta fresca, lavada, seca", "30g / 1oz de cilantro fresco", "30g / 1oz de bálsamo de limón vietnamita", "30 g / 1 oz de hojas frescas de perilla", "1 chile rojo, en rodajas finas", "1 lima, rebanada en 4 cuñas", "4 cucharadas de salsa hoisin", "4 cucharaditas de salsa sriracha"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½. Alinee una bandeja de tostado con papel resistente a la grasa.", "Para preparar la piel de cerdo frita, quite la piel del hombro de cerdo y el vientre de cerdo. Limpie cualquier grasa con un cuchillo afilado y corte la piel en pedazos de 2½ cm / 1 in. Séquelo y colóquelo en una rejilla sobre la bandeja preparada. Asar durante 2 horas y media hasta que se seque.", "Coloque los huesos de cerdo en 1 litro / 1¾ de agua. Llevar a ebullición, luego desechar el agua y la espuma. Vuelva a calentar otra olla de agua y agregue los huesos de cerdo, luego cocine a fuego lento.", "Coloque la cebolla, hierba de limón, chalota y jengibre en una sartén plancha caliente. Char y marrón en todos los lados. Coloque los ingredientes carbonizados en el caldo de huesos y agregue el anís estrellado, sal marina y pimienta. Cocine a fuego lento durante 30 minutos.", "Coloque el hombro de cerdo y el vientre de cerdo en una bolsa de plástico grande. En un procesador de alimentos, agregue el ajo, el jengibre, el lemongrass y el chalote y procese hasta que esté bien. Agregue a la bolsa con la carne. Agregue todos los ingredientes de aderezo. Selle y marinade en el refrigerador por 30 minutos.", "Retire la carne de la nevera. Caliente un wok o sartén a fuego alto, agregue el aceite de colza y dore la carne de cerdo hasta que esté coloreada. Agregue el resto del adobo y cocine estofado con la tapa del wok o sartén, durante 40 minutos. Revise el líquido de cocción cada 15 minutos, agregue dos cucharadas de caldo de puerco para ayudar en el proceso de estofado y voltee la carne para asegurar incluso que se esté cocinando.", "Mientras la carne se está cocinando, pula algunos frijoles en una cacerola de agua, escurra y reserve. En la misma sartén cocine los fideos de arroz en agua hirviendo durante 6-8 minutos hasta que estén al dente. Escurra, pase por agua fría, escurra bien y mezcle con 1 cucharada de aceite de colza.", "Para freír a fuego lento la piel de cerdo, caliente el aceite vegetal en una freidora o una sartén honda de fondo profundo a 180 ° C o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida). Retire la piel del horno y luego fría hasta que se dore, escurra el papel de cocina.", "Una vez que la carne de cerdo esté cocida, retire la carne de cerdo y agregue el caldo al wok para que el caldo se fusione con el líquido de cocción y lo lleve a ebullición.", "Para servir, vista la base del cuenco de fideos con algunas hojas de lechuga romana fresca, cubra con un puñado de fideos de arroz cocidos, vierta el caldo, mézclelo con panceta de cerdo asada en rodajas y hombro, cubra con frijoles blancos, menta fresca, cilantro, Bálsamo de limón vietnamita, hojas de perilla, rodajas de chile, cuña de lima, cucharada de hoisin y cucharadita de sriracha. Cubra con la piel de cerdo frita. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_brothy_vietnamese_pork_36958", "title": "Brothy Vietnamese pork cao lau", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]