[{"isVegetarian": true, "title": "How to make cinnamon buns", "url": "www_bbc_co_uk_food_recipes_how_to_make_cinnamon_86187", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_cinnamon_86187_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "1 tsp salt", "50g/1¾oz light brown sugar", "15g/1oz fresh yeast or 1½ tsp dried yeast ", "75g/3oz butter, softened", "200ml/7fl oz milk", "2 free-range eggs, plus one egg yolk, for glazing", "flavourless oil, for oiling", "200g/7oz prunes, roughly chopped", "1 orange, zest and juice", "100g/3½oz light brown sugar", "1½ tsp ground cinnamon", "100g/3½oz butter, softened, plus extra for greasing", "50g/2oz caster sugar"], "serves": "Makes 12 buns", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the flour, salt and sugar in a bowl. Crumble in the fresh yeast (or stir in the dried yeast). Rub the softened butter into the flour mixture with your fingertips until there are no large lumps of butter. (It does not have to be as fine as breadcrumbs, as you would do with a crumble.) ", "Make a well in the flour mixture. Pour the milk into the well and crack in one egg. Bring the dough together with your hands or with a spatula. This is quite a soft, supple dough - if it feels a little wet and sticky, don't panic. Keep mixing and the flour will absorb the liquid.", "Turn the dough out onto a clean surface and knead for 10 minutes or until the dough is smooth and elastic. Cut a small piece off and stretch the dough as thin as you can – if you can see light shining through the dough and you can see the shadow of your fingers held behind the thinnest part, it is ready.", "Put the dough in an oiled bowl, cover with a damp tea towel and leave to prove for about 80-90 minutes.", "Meanwhile for the filling, combine the chopped prunes with the orange zest and juice and set aside. The fruit should be soaked for a minimum of half an hour, but it can be made as much as a day in advance.", "In a small mixing bowl, beat the sugar and cinnamon into the softened butter with a fork until well combined. Set aside.", "Lightly grease the base and sides of a deep roasting tin roughly 34x24cm/13x9in with butter and line with baking parchment.", "When the dough has nearly doubled in size, tip it out of the bowl and knock the air out. Roll the dough into a rectangle, the thickness of a pound coin. The long side of the rectangle should be about 30cm/12in long.", "Spread the cinnamon paste over the surface of the dough, ensuring the paste reaches all the edges. Drain the soaked prunes, reserving the juice, then sprinkle the prunes evenly over the dough. ", "Starting with a long side of the rectangle, roll the dough up into a sausage shape. Flour the work surface and lay the rolled dough on top of the flour before cutting into rolls into 12 equal slices. ", "Place the slices side by side, with the spiral facing up, into the lined roasting tin. Cover with a damp tea towel and leave to prove again for about 45 minutes.", "Preheat the oven to 200C/400F/Gas 6. ", "When the buns have risen and feel springy to the touch, they are ready to bake. Beat the remaining egg and egg yolk together in a small bowl, and brush the tops of the buns with egg glaze. This will give the buns a shine and lovely colour.", "Bake the buns at 200C/400F/Gas 6 for 10 minutes and then lower the oven temperature to 180C/350F/Gas 4. Cook for a further 20 minutes. ", "While the buns are baking, make the syrup. Pour the reserved orange juice from soaking the prunes into a small saucepan with the sugar. Gently heat the mixture, stirring until the sugar dissolves. Bring the syrup to the boil and cook for five minutes. Set aside.", "When the buns have finished baking, remove them from the oven and brush with the syrup so that the orangey flavour soaks right into the buns. Transfer the buns on the paper to a wire rack to cool."]}, {"isVegetarian": true, "title": "How to make curry paste", "url": "www_bbc_co_uk_food_recipes_how_to_make_curry_paste_37065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_curry_paste_37065_16x9.jpg", "ingredients": ["3 tbsp coriander seeds", "2 tbsp cumin seeds", "1 tbsp mustard seeds ", "1 tsp fennel seeds", "1 tsp black peppercorns", "1 tsp ground turmeric", "1 tsp ground cinnamon", "1 tsp paprika", "1 or 2 dried chillies, depending on personal preference ", "1 tsp salt", "thumb-size piece fresh root ginger, peeled and finely grated", "4 garlic cloves, finely grated", "1 tbsp tomato purée", "4 tbsp white wine vinegar or cider vinegar", "vegetable or sunflower oil, to cover the paste for storing"], "serves": "Makes enough paste for 8 servings", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the seeds and peppercorns into a dry frying pan over a medium heat. Cook for about three minutes, stirring often, until the mustard seeds start to pop and the seeds turn golden and aromatic. Tip into a bowl and allow to cool for a few minutes.", "Add the turmeric, cinnamon, paprika and dried chillies to a pestle and mortar. Add the cooled toasted spices and grind everything together into a fine powder. Add the salt.", "Add grated ginger, garlic, tomato purée and white wine vinegar and mix well to make a paste.", "Use immediately, or spoon the paste into a jar, cover with a layer of oil, seal with a lid and store in the fridge for up to a week. "]}, {"isVegetarian": false, "title": "How to make fish fingers", "url": "www_bbc_co_uk_food_recipes_how_to_make_fish_fingers_64484", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fish_fingers_64484_16x9.jpg", "ingredients": ["500g/1lb 2oz sustainable white fish, such as pollock or coley", "pinch salt", "50g/2oz plain flour", "2 free-range eggs, beaten", "200g/7oz breadcrumbs (made from stale bread)", "1 tbsp finely chopped parsley", "1 lemon, zest and juice only", "salt and freshly ground black pepper", "2 tbsp olive oil, plus extra for greasing", "100g/3½oz mayonnaise", "3 gherkins, finely chopped", "50g/2oz capers", "1 tbsp finely chopped parsley"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Cut the fish into strips down the fillet, following the natural lines of the fish. The strips should be approximately 2cm/1in wide and 6-8cm/3-4in long. Sprinkle some salt onto the fish.", "Place the flour onto a plate. Place the beaten eggs into a wide bowl. Place the breadcrumbs on another plate, and mix the chopped parsley and lemon zest into the breadcrumbs.", "Now you have your production line ready, take a piece of fish and dust it in the flour, next dip it in the egg (allowing any excess to drip off) and finally into the breadcrumbs. ", "Transfer the fish fingers to the prepared baking tray and refrigerate for an hour - this will firm up the fish and make them easier to handle, and the egg and flour will set a little too.", "Pre-heat the oven to 220C/425F/Gas 7 and lightly grease a baking tray.", "Drizzle the fish fingers with olive oil.", "Bake the fish fingers for 12-15 minutes, or until lightly golden and cooked through. Or fry the fish in a pan, over a medium heat, with a few tablespoons of olive oil for 2-3 minutes either side until golden-brown and cooked through. Remove the fish fingers from the pan and place on kitchen paper to absorb any excess oil.", "Meanwhile make the tartare sauce by mixing all the ingredients together in a small bowl, and set aside until needed.", "Once cooked, squeeze a little lemon juice over the fish fingers. Serve with a generous helping of tartare sauce."]}, {"isVegetarian": true, "title": "How to make fairy cakes", "url": "www_bbc_co_uk_food_recipes_how_to_make_fairy_cakes_45428", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fairy_cakes_45428_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened", "100g/3½oz caster sugar", "2 free-range eggs, at room temperature, lightly beaten", "100g/3½oz self-raising flour", "1 tsp vanilla extract", "¼ tsp fine salt", "1 tbsp milk", "125g/4½oz unsalted butter, softened", "200g/7oz icing sugar, sifted", "1 tbsp milk", "1 tsp vanilla extract", "lemon curd or jam for the topping (optional)"], "serves": "Makes 12 small fairy cakes, or 6 deep cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a 12-hole bun tin with 12 paper fairy cake cases. (Or for deep American-style cupcakes, line a 6-hole muffin tin with larger muffin cases.) ", "Place the softened butter in a large bowl then beat with an electric hand-whisk until pale and fluffy. Gradually add the sugar and continue to beat until fully combined. ", "Add a little of the beaten egg to the butter mixture, then whisk again. Gradually add the egg, little by little, whisking after each addition. It’s important to go slowly here, as adding too much egg at once can cause the mix to split. If it does split, simply add a tablespoon of the flour and whisk until the batter is smooth again. ", "Sift the flour into the bowl. Using a large metal spoon or spatula, fold the flour into the cake mix.", "Add the vanilla and the salt and stir to combine. Add the milk to get the cake mix to a soft dropping consistency, where a heaped spoonful of mixture falls off the spoon after tipping it for few seconds.", "Using two dessert spoons (one to scoop and the other to push the mix into the tin), fill the paper cases half full with the batter, filling them equally. ", "Bake the fairy cakes for 15 minutes in the middle of the oven, until golden-brown and the cakes spring back when pressed lightly. (Bake cupcakes for 18-20 minutes.)", "When cool enough to handle, lift the cakes onto a cooling rack and leave to cool completely. The cakes can be frozen for up to a month, or will keep fresh in an airtight tin for a few days.", "To make the buttercream, put the butter into a large bowl and beat with electric hand beaters until smooth and creamy. Sift in the icing sugar, then work it into the butter, starting slowly at first, then beating more vigorously once all the sugar is combined. Add the milk and the vanilla, then beat until creamy and smooth. If the mixture is too stiff, add a little more milk. You can colour the buttercream at this stage. ", "To make butterfly cakes, cut the top off each cake using a small serrated knife – angling the knife in slightly so that you make a concave cut. Cut the tops in half, to make two ‘wings’. Spread or pipe a heaped teaspoon of buttercream into the dip you have made in the top of each cake, and spoon on a little lemon curd or jam. Place the wings into the buttercream, and dust with a little icing sugar. "]}, {"isVegetarian": true, "title": "How to make cream cheese frosting", "url": "www_bbc_co_uk_food_recipes_how_to_make_cream_cheese_66895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_cream_cheese_66895_16x9.jpg", "ingredients": ["150g/5½oz unsalted butter, at room temperature", "45g/3 tbsp caster sugar", "300g/10½oz full fat cream cheese"], "serves": "Makes enough for one cake", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the butter in a large bowl with the caster sugar. ", "Beat the butter and sugar together for 2-3 minutes until light and creamy.", "Then beat in the cream cheese until smooth. "]}, {"isVegetarian": false, "title": "How to make fish pie", "url": "www_bbc_co_uk_food_recipes_how_to_make_fish_pie_56143", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fish_pie_56143_16x9.jpg", "ingredients": ["1kg/2lb 4oz potatoes, peeled", "50g/2oz butter", "100g/3½ oz crème fraîche", "3 tbsp warm milk", "pinch salt and white pepper", "500ml/1 pint milk", "250g/9oz smoked haddock", "200g/7oz cod loin", "1 onion", "1 bay leaf", "3 cloves", "2 leeks, washed and chopped", "50g/2oz butter, plus 25g/1oz for dotting on top of the pie", "1 tbsp olive oil", "3 tbsp flour", "salt and white pepper", "100g/3½oz raw king prawns", "50g/2oz frozen peas", "1 tbsp finely chopped parsley", "1 lemon, zest only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Cut the potatoes into 5cm/2in chunks and boil until soft. Drain and mash with the butter, crème fraîche and warm milk. Season with salt and white pepper. Set aside and keep warm.", "Heat the milk in a large pan, add the smoked haddock and cod. Cut the onion in half, make an incision in one of the halves and insert the bay leaf. Push the cloves into the same onion half and place this into the pan with the milk and fish.  Bring the milk up to the boil. Reduce the heat and simmer gently for 6-7 minutes. ", "Meanwhile, finely chop the remaining half onion and the leeks. Heat the butter with the olive oil in a small frying pan and gently fry the onion and the leeks for 4-5 minutes to soften, but not brown. ", "Remove the fish from the pan, and set aside to cool slightly. Keep the milk in the pan. ", "Add the flour to the leeks and stir well to combine.  Fry for one minute, stirring frequently. Gradually spoon in the milk from poaching the fish, and stir it in well each time. Add all the milk in this way, and heat gently until the sauce has thickened. ", "Taste the sauce for seasoning, and add more salt or pepper if necessary.", "Break the fish into chunks, being careful to feel for any bones and remove any skin, then fold the fish pieces into the sauce. ", "Add the raw prawns and frozen peas to the mixture.", "Place an ovenproof pie dish onto a baking tray (this will catch any of the mix that bubbles over when cooking).", "Spoon the fish mixture into the bottom of the ovenproof dish. Sprinkle fresh chopped parsley and grated lemon zest over the top. ", "Carefully top with the cooled mashed potato. Use a fork to spread the mash over the pie and create a rough texture on top. Dot the pie with the remaining half of the butter and place in the oven for 25-30 minutes, or until golden-brown and bubbling."]}, {"isVegetarian": false, "title": "How to make fish soup", "url": "www_bbc_co_uk_food_recipes_how_to_make_fish_soup_13895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_fish_soup_13895_16x9.jpg", "ingredients": ["3 x whole white fish (such as bream, John Dory or snapper), gutted", "large handful prawns in the shell", "large handful mussels in the shell", "400g/14oz waxy potatoes, such as Desirée, peeled and cut into 2cm chunks ", "1 tbsp chopped flatleaf parsley", "drizzle of olive oil ", "30ml/2 tbsp olive oil", "fish trimmings, including head and bones, from fish listed above", "1 shallot, chopped ", "1 small bulb fennel, chopped ", "3 ripe tomatoes", "3 garlic cloves, crushed with the flat side of a knife", "1 large sprig thyme", "2 bay leaves", "2 pinches saffron strands", "1-2 star anise", "2 litres/3½ pints boiling water", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Fillet the fish, set aside the trimmings and remove any small bones from the fillets with tweezers. Set the fillets aside to be added to the soup later. ", "To make the stock, roughly chop the fish trimmings into three parts. Heat a large, heavy-based saucepan over a medium heat, and add the olive oil. ", "Add the fish trimmings and fry for 5-10 minutes until they begin to brown. Remove the fish trimmings from the pan and set aside on a plate. ", "Add the shallot, fennel, tomatoes, garlic, thyme, bay leaves, saffron and star anise.  Fry gently over a medium heat for a few minutes, stirring regularly, until the vegetables have softened. ", "Add the cooked fish trimmings back into the pan, and pour in the boiling water. Bring back to a simmer and remove any scum that forms on the surface with a ladle or spoon. Reduce the heat and simmer gently for 35 minutes.", "Place a sieve in a colander placed over a large saucepan. Ladle the stock into the sieve, then gently pour in any remaining liquid from the pan - taking care not to tip the fish or vegetables into the sieve.  Season to taste with salt and freshly ground black pepper. ", "For the soup, place the potatoes into the fish stock. Bring to the boil and cook for 6-8 minutes, or until the potatoes are nearly cooked. ", "Cut the fish fillets into 5cm/2in pieces. Discard any mussels that are open or that don't close when tapped, or have broken shells.", "Add the prawns, mussels and white fish to the saucepan and simmer for 2-3 minutes, or until the fish is cooked through and the mussels have opened.  Discard any mussels that have not opened during cooking. Season to taste with salt and freshly ground black pepper. ", "To serve, ladle the fish soup into soup bowls, scatter with parsley, drizzle with olive oil and serve immediately."]}, {"isVegetarian": true, "title": "How to make flatbread", "url": "www_bbc_co_uk_food_recipes_how_to_make_flatbread_44059", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_flatbread_44059_16x9.jpg", "ingredients": ["250g/9oz strong bread flour, plus extra for dusting", "½ tsp salt", "½ tsp coriander seeds, toasted and ground", "½ tsp smoked paprika", "4 tbsp olive oil", "100ml/3½fl oz warm water"], "serves": "Makes 5 flatbreads", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the flour, salt, coriander seeds and paprika in a large bowl, make a well in the centre and add the olive oil and the warm water. Using a fork, start incorporating the flour with the water and olive oil, if necessary add more water. Once the dough starts to come together, use your hands to form a soft ball of dough. ", "Dust your hands and a clean work surface with flour and knead the dough for five minutes, or until it is smooth and elastic.  Put the dough back into the bowl, cover and set aside for 15 minutes. (This dough is much firmer to handle than bread dough and will feel heavier.)", "Divide the dough into five equal balls. Roll them out to the thickness of a £2 coin. Heat a griddle pan and cook the flat breads for two minutes on each side.", "Serve immediately."]}, {"isVegetarian": false, "title": "How to make French onion soup", "url": "www_bbc_co_uk_food_recipes_how_to_make_french_onion_87434", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_french_onion_87434_16x9.jpg", "ingredients": ["50g/2oz butter ", "1kg/2lb 4oz onions, thinly sliced ", "2 garlic cloves, chopped ", "100ml/3½fl oz white wine ", "2 tbsp Madeira, plus extra once cooked, to taste", "1 litre/1¾ pint fresh beef stock ", "salt and freshly ground black pepper", "chopped parsley to garnish", "8 thick slices French bread ", "2 cloves garlic, cut in half", "100g/3½oz Gruyère cheese, grated "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a medium-sized ovenproof pan, add the onions and garlic and gently fry over a low heat for 30-35 minutes, stirring occasionally, until the onions are really soft and a rich dark brown colour. This stage of the recipe is really important, the long slow cooking of the onions gives this soup its lovely rich flavour and colour.", "Add the white wine, stirring the bottom of the pan to loosen all the browned onion. Bring it back to the boil then add the Madeira and beef stock.", "Bring to the boil and then simmer for about 10-12 minutes.", "Meanwhile make the croutons. Toast the bread on both sides and rub the toast with the cut side of a garlic clove. Top with the grated cheese and place under the grill until the cheese has melted. ", "Taste the soup to check the seasoning, and add salt and freshly ground black pepper to taste. Add another few tablespoons of Madeira to the soup, to boost the flavour and stir well. ", "Lay the croûtons on top of the soup and scatter with fresh chopped parsley.", "To serve, ladle the soup into bowls, making sure each serving has a cheesy croûton. Serve immediately, before the croûton goes soggy. "]}, {"isVegetarian": true, "title": "How to make ice cream", "url": "www_bbc_co_uk_food_recipes_how_to_make_ice_cream_97157", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_ice_cream_97157_16x9.jpg", "ingredients": ["4 free-range eggs, yolks only", "100g/3½oz golden caster sugar", "1 tsp cornflour, optional", "300ml/½ pint double cream", "300ml/½ pint full-fat milk", "1 vanilla pod"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Make sure that you have plenty of room spare in the freezer. First, separate the eggs, placing the yolks in a large bowl. (You will not need the whites for this recipe. You can use them to make meringues.)", "Add the sugar to the egg yolks and whisk until pale and thick. ", "Add the cornflour (if using) and whisk well to incorporate into the egg yolks. ", "Put the cream and milk into a medium saucepan.", "Cut the vanilla pod open lengthways and scrape out the seeds with the back of a knife, then add to the cream and milk. ", "Heat the cream and milk until just below boiling. Slowly pour the hot cream and milk onto the eggs and sugar, whisking as you go. ", "Sieve the custard into a clean pan, and set it over a very low heat. Stir the custard constantly with a wooden spoon, paying special attention to the corners of the pan, until it is steaming and has thickened slightly. The custard is ready when you can draw a clear line through it on the back of the wooden spoon. This can take up to 10 minutes.", "Tip the custard into a large, shallow, freezer-proof container, and allow to cool to room temperature (you can speed this up by sitting the tub of custard in a large bowl of iced water). ", "Once at room temperature, place a lid on the custard and chill in the fridge overnight.", "Once chilled, transfer the custard to the freezer and take it out every hour, for three hours, to whisk it with an electric handheld whisk. This will disperse the ice crystals and keep it smooth. ", "Then leave the ice-cream in the freezer for a final freeze, until it is solid.", "Remove the ice cream from the freezer 10 minutes before serving, so that it’s easy to scoop. "]}, {"isVegetarian": true, "title": "How to make icing", "url": "www_bbc_co_uk_food_recipes_how_to_make_icing_04669", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_icing_04669_16x9.jpg", "ingredients": ["125g/4½oz unsalted butter, softened", "200g/7oz icing sugar, sifted", "1 tbsp milk", "1 tsp vanilla extract"], "serves": "Makes enough for 6 cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the butter into a large bowl and beat with an electric hand mixer until light and fluffy. ", "Sift in the icing sugar, then work it into the butter, starting slowly at first, then beating more vigorously once all the sugar is combined. ", "Add the milk and the vanilla, then beat until creamy and smooth. ", "If the mixture is too stiff, add a little more milk. ", "Scrape down the sides of the bowl to make sure all the icing sugar is incorporated. Continue to whisk until light and creamy. ", "You can colour the buttercream at this stage, or add flavourings such as cocoa or melted chocolate, or lemon or orange zest."]}, {"isVegetarian": true, "title": "How to make custard", "url": "www_bbc_co_uk_food_recipes_how_to_make_custard_82327", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_custard_82327_16x9.jpg", "ingredients": ["4 free-range eggs", "100g/3½oz golden caster sugar", "1 tsp cornflour, optional", "300ml/1 pint double cream", "300ml/½ pint full-fat milk", "1 vanilla pod"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Separate the eggs, placing the yolks in a large bowl. (You will not need the whites for this recipe. You can use them to make meringues.)", "Add the sugar to the egg yolks and whisk until pale and thick. ", "Add the cornflour and whisk well to incorporate into the egg yolks. ", "Put the cream and milk into a medium saucepan. ", "Cut the vanilla pod open lengthways and scrape out the seeds with the back of a knife, then add to the milk and cream. ", "Heat the cream mixture to just below boiling point. Take the vanilla pod out and set aside (it can be dried out and placed in sugar to make vanilla sugar).", "Slowly pour the hot cream and milk onto the eggs and sugar, whisking as you go. ", "Transfer the custard to a clean pan, and set it over a very low heat. ", "Stir the custard constantly with a wooden spoon, paying special attention to the corners of the pan, until it is steaming and has thickened slightly. The custard is ready when you can draw a clear line through it on the back of the wooden spoon. This can take up to 10 minutes."]}, {"isVegetarian": true, "title": "How to make jam", "url": "www_bbc_co_uk_food_recipes_how_to_make_jam_75331", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_jam_75331_16x9.jpg", "ingredients": ["450g/1lb raspberries, as fresh as possible", "450g/1lb granulated sugar"], "serves": "Makes 3 jars of jam", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To clean the jars, preheat the oven to 140C/275F/Gas 1. Wash the jars well in warm soapy water then rinse thoroughly under running water. Leave the jars and lids to dry, upside down, in the oven. (Or you can clean the jars by putting them through the hot cycle of a dishwasher.)", "Place a few saucers in the freezer to chill. These will be used to test if the cooked jam has reached setting point.", "Place the raspberries and sugar into a wide-mouth preserving pan over a very low heat, stirring every so often until all the sugar has completely dissolved. It's important to have the heat low so the sugar dissolves rather than melts and sticks to the pan.", "Bring the fruit mixture to a rapid, rolling boil (when the bubbles cannot be calmed down by stirring with a spoon). Cook for 3-5 minutes until the jam reaches setting point. As your jam approaches setting point, it will thicken and start to boil more slowly, with thicker, heavier bubbles. ", "To test if the jam has reached setting point, first remove the pan from the heat while you test the jam – this is very important. Spoon a little of the jam onto a cold saucer, leave to cool for a few minutes, then push your finger into the jam. If it wrinkles, it is ready. If not, return the pan to the heat and cook the jam for a minute or two more and test again. ", "When the jam has reached setting point, carefully ladle it into the sterilised jars (a sterilised jam funnel is very useful) and twist the lids on while the jam is still hot. The jam will thicken up as it cools and the seal on the jars should dip. If a jar doesn't seal, store it in the fridge and use the jam within a couple of weeks.", "Sealed jars can be kept in the cupboard for months, although after six months the flavour begins to deteriorate."]}, {"isVegetarian": false, "title": "How to make lamb curry", "url": "www_bbc_co_uk_food_recipes_how_to_make_lamb_curry_32719", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_lamb_curry_32719_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz lamb shoulder, boned weight, cut into cubes", "4 tbsp medium Indian curry paste ", "2 tbsp vegetable or sunflower oil", "generous knob of butter", "2 onions, halved then thinly sliced", "1 cinnamon stick", "6 cardamom pods", "400g/14oz can chopped plum tomatoes", "1 tbsp tomato purée", "300ml/½ pint hot chicken or lamb stock", "400g/14oz can chickpeas, drained", "125g/4½oz baby leaf spinach, well washed"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Place the diced lamb shoulder into a bowl or food bag. Mix in three tablespoons of curry paste and leave to marinate for 30 minutes at room temperature, or up to 24 hours in the fridge. ", "Heat the oil and butter in a large heavy based pan, then add the onions, cinnamon stick, cardamom pods and the remaining tablespoon of curry paste. Fry over a medium heat for 10 minutes, until the onions are softened and starting to turn golden-brown.", "Add the marinated lamb, and fry for a couple of minutes until the meat has changed colour -  it doesn’t have to be browned. ", "Stir in the chopped tomatoes, tomato purée and enough stock to cover most of the lamb, with the top pieces just poking clear of the liquid. ", "Add the chickpeas and bring the mixture up to the boil, then turn the heat down to a simmer, and cook gently for 1 – 1½ hours, until the lamb is very tender and the sauce is rich and thick.", "Spoon away the excess fat that will have gathered on the top of the curry, then season with salt and freshly ground black pepper to taste.", "Add the spinach, stirring the spinach leaves into the curry until they wilt.", "Serve the curry with your favourite rice, breads and chutneys. "]}, {"isVegetarian": true, "title": "How to make marmalade", "url": "www_bbc_co_uk_food_recipes_how_to_make_marmalade_20072", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_marmalade_20072_16x9.jpg", "ingredients": ["1.25kg/2lb 12oz Seville oranges", "1.5kg/3lb 5oz granulated sugar"], "serves": "Makes 8 jars of marmalade", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Scrub the oranges and place the whole fruits in a large stainless steel pan, or preserving pan. ", "Cover with 2.25 litres/4 pints water, then bring to the boil. Reduce the heat and simmer, covered, for about an hour until the fruit is soft. ", "Preheat the oven to 140C/275F/Gas 1. Wash the jars well in warm soapy water then rinse thoroughly under running water. Leave the jars and lids to dry, upside down, in the oven. Place a few saucers in the freezer to chill (these will be used to test if the cooked marmalade has reached setting point).", "Remove the oranges from the pan with a slotted spoon and set aside to cool. Carefully measure out 1.7 litres/3 pints of the cooking liquid, discarding any extra or topping up with water as necessary. Return the liquid to the pan.", "When the oranges are cool enough to handle, cut them in half and scoop out the flesh, pith and pips into a bowl. Pour the orange pulp into a muslin bag and secure with kitchen string. Add to the pan. ", "Chop the peel into shreds as fine as you like and add to the pan. Set the pan over a low heat and add the sugar. Stir until the sugar is dissolved.", "Bring the marmalade to a rolling boil for 10-15 minutes. Skim off any orange scum that rises to the surface. ", "Test for setting point by dropping a little of the mixture onto a chilled saucer, leave for a moment, then push your finger into the marmalade. If it wrinkles it is ready. Alternatively, dip a spoon into the marmalade, allow the mixture to cool a little, then slowly pour it back into the pan. If it is at the setting point, the drops will run together to form a hanging flake (this is known as the flake test). It can take up to 30 minutes to reach setting point, so keep testing. ", "When the marmalade is ready, remove the pan from the heat. Carefully ladle into the hot sterilised jars (a sterilised jam funnel makes this much easier) leaving approximately 1cm/½in space at the top of the jar. Twist the lids on the hot jars to seal. The marmalade will continue to thicken up as it cools. "]}, {"isVegetarian": true, "title": "How to make meringues", "url": "www_bbc_co_uk_food_recipes_how_to_make_meringues_70958", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_meringues_70958_16x9.jpg", "ingredients": ["3 free-range eggs, whites only", "150g/5½oz golden caster sugar", "150ml/¼pt double cream ", "150g/4½oz dark chocolate (70% cocoa solids)", "double cream, whipped, used to sandwich meringues together"], "serves": "Makes 8 sandwiched meringues", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1 and line two flat baking sheets with baking parchment. ", "Separate the eggs into a clean, large bowl, preferably metal or glass. Gently crack the shell against the side of a small bowl. Slowly pull the shell apart as cleanly as possible along the crack, tipping the yolk into one half of the shell. Let the white drain away into a bowl below. Drop the yolk into another small bowl. Separate the next egg over a third bowl - that way if you accidentally break the yolk, it won’t contaminate the clean whites.  (You can use the yolks for another recipe, such as custard or ice cream.)", "Using an electric hand whisk, whisk the whites until stiff peaks form when the whisk is removed, but the mixture should not look too dry. ", "Add one tablespoon of the sugar to the egg whites, and continue to whisk until the mixture comes back to stiff peaks. Add the sugar one tablespoon at a time until it has all been used, and the meringue is thick and glossy. ", "Using two dessertspoons, scoop 16 rugby-ball shaped meringues onto the baking paper, leaving plenty of space between them. ", "Bake for an hour until the meringues are pale, golden-brown, crisp and lift away easily from the baking paper. Open the oven door slightly and leave the meringues to cool in the oven.", "Meanwhile, make the chocolate filling (ganache). Use a large, sharp knife to chop the chocolate into small pieces.", "Pour the cream into a small saucepan, then bring it to just below boiling. Take the pan from the heat, add the chopped chocolate, swirl the pan to help combine the chocolate and then stir until smooth. Tip the ganache out of the pan and leave to cool, it will thicken as it cools. ", "When the ganache has cooled, spread it over the flat side of half of the meringues, then sandwich meringues together. To make these a little more luxurious, whip some double cream, then spoon on top of the ganache before sandwiching the meringues together. "]}, {"isVegetarian": true, "title": "How to make pancakes", "url": "www_bbc_co_uk_food_recipes_how_to_make_pancakes_02824", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pancakes_02824_16x9.jpg", "ingredients": ["200g/7oz plain flour", "350-400ml/12-14fl oz milk, or ½ milk ½ water for a lighter pancake", "2 large eggs, lightly whisked", "1 tbsp vegetable oil", "pinch salt", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour into a large bowl, make a well in the centre and pour in the milk and eggs. Give the liquid mixture a quick whisk before incorporating the flour. Continue to whisk until you have a smooth batter.", "Now add 1 tbsp vegetable oil and whisk thoroughly. ", "Take a crêpe pan, or large frying pan, dip some kitchen roll in the oil and carefully wipe the inside of the pan. Heat the pan over a medium heat for a minute.", "Add just under a ladleful of batter to the pan and immediately start swirling it round the pan to get a nice even layer. ", "Cook the pancake for approximately 30-40 seconds. Use a palette knife to lift the pancake carefully to look at the underside to check it is golden-brown before turning over. Cook the other side for approx 30-40 seconds and transfer to a serving plate."]}, {"isVegetarian": false, "title": "How to make pea and ham soup", "url": "www_bbc_co_uk_food_recipes_how_to_make_pea_and_ham_17426", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pea_and_ham_17426_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "1 medium onion, finely chopped", "1 large potato (about 250g/9oz), cut into small cubes", "300g/10½oz frozen petits pois or garden peas", "400ml/14fl oz chicken stock, or vegetable stock if preferred", "200ml/7fl oz semi-skimmed or whole milk", "100g/3½oz thick cut ham", "small handful fresh mint leaves, optional", "salt and freshly ground black pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan on low or medium heat, then add the onion and potato, season with salt and pepper, then stir to coat the vegetables in the oil. ", "Take a piece of baking paper large enough to cover the top of the pan, scrunch it up then unfold it. Lay the paper over the surface of the vegetables, sealing them in right to the edges of the pan (this helps cook the vegetables more quickly). Put a lid on the pan, cook on a low heat for 8-10 minutes, until the potatoes are tender and the onions are soft and translucent.  ", "Remove the paper. Add the peas and stock to the pan, then bring to the boil. Cook for a couple of minutes, or until all of the peas have floated to the top and are tender and bright.", "Take the pan off the heat. Using a stick blender, process the peas until very smooth. Add the milk (or, if preferred, use more stock, water or cream). Tear in most of the ham. Bring the soup back to a simmer, then season to taste with salt and pepper, remembering that the ham is fairly salty. ", "To serve, ladle the soup into bowls then scatter with the rest of the ham and a few torn mint leaves. "]}, {"isVegetarian": true, "title": "How to make pesto", "url": "www_bbc_co_uk_food_recipes_how_to_make_pesto_18843", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pesto_18843_16x9.jpg", "ingredients": ["125g/4½oz pine nuts", "125g/4½oz parmesan cheese (or a similar vegetarian hard cheese), cut into small chunks", "1 large bunch fresh basil leaves", "1 clove garlic, crushed with the flat side of a knife", "200ml/7fl oz extra virgin olive oil", "salt and freshly ground black pepper", "squeeze lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dry frying pan over a medium heat. Add the pine nuts and toast them for a few minutes until browned and fragrant. ", "Place the parmesan chunks in a food processor and add the basil leaves, garlic, toasted pine nuts and olive oil.  Season to taste with salt and freshly ground black pepper. ", "Blend for a few seconds until it begins to come together and is smooth.", "Taste the pesto for seasoning, and add a squeeze of lemon juice if you like.", "If not using straight away, you can store the pesto in a jar and will keep for a week in the fridge. Or you can put it into ice-cube trays and freeze."]}, {"isVegetarian": false, "title": "How to make pizza", "url": "www_bbc_co_uk_food_recipes_how_to_make_pizza_50967", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_pizza_50967_16x9.jpg", "ingredients": ["400g/14oz strong white flour", "100g/3½oz semolina, plus extra for dusting", "2 tsp salt ", "15g/½oz fresh yeast, or 1½ tsp of dry yeast", "275ml/9½fl oz water", "50ml/2fl oz olive oil, plus extra for oiling", "2 tbsp tomato sauce", "pizza toppings of your choice"], "serves": "Makes 2 pizzas", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a large mixing bowl, stir together the flour, semolina and salt. Stir in the dried yeast (or crumble in the fresh yeast, whichever you are using). Make a well in the centre of the flour mixture.  Pour most of the water into the well along with the olive oil and bring the dough together with your hands or a wooden spoon. As the flour is incorporated the dough will start to take shape. Add the remaining water if the dough feels tight or hard.", "Turn the dough out onto a clean surface and knead for 10 minutes or until the dough is smooth and elastic. Cut off a small piece of the dough and stretch part of it as thinly as you can. If you can see the shadow of your fingers through the dough - the light should shine through the dough like a window pane - without the dough tearing, it is ready to prove. ", "Knead the cut piece back into the dough and shape the dough into an even ball. Place in an oiled bowl, cover with a damp tea towel and allow to prove in a warm place for about 1-1½ hours, or until it has doubled in size (the temperature of your kitchen can affect the timing of this).", "When the dough has risen, take it out of the bowl and knock the air out. Divide the dough into two equal portions, and shape each portion into a ball. Cover the dough with a damp cloth and allow to prove again for about 15 minutes. ", "Place a pizza stone or an upturned baking tray into the oven and preheat to its highest setting.", "Dust the work surface liberally with semolina. Roll out one piece of the dough to form a circle that will fit on your pizza stone or baking tray.  ", "Transfer the pizza base onto a plastic chopping board (or another upturned baking tray) dusted with semolina. The tray will be used to slide the pizza base directly onto the pizza stone.", "Cover the surface with half of the tomato sauce and toppings of your choice.", "When ready to bake, slide the pizza directly onto the pizza stone and cook for 8-10 minutes, or until the base is golden-brown and the toppings are bubbling. Repeat with the remaining dough, tomato sauce and toppings."]}, {"isVegetarian": true, "title": "How to make puff pastry", "url": "www_bbc_co_uk_food_recipes_how_to_make_puff_pastry_65905", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_puff_pastry_65905_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for rolling out", "½ tsp fine salt", "250g/9oz unsalted butter, cold but not rock hard (or you can use half butter, half lard)", "150ml/¼ pint ice-cold water"], "serves": "Makes 500g/1lb 2oz pastry", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Sift the flour and salt into a large mixing bowl, then put the bowl in the fridge for a few minutes to chill. (Keeping the flour and bowl cold will help you to get a better result later and create nice layers of pastry.) ", "Meanwhile, cut the butter into small cubes.", "Using a round-bladed knife, stir the butter into the bowl until each piece is well coated with flour. ", "Pour in the water, then, working quickly, use the knife to bring everything together to a rough dough.", "Gather the dough in the bowl using one hand, then turn it onto the work surface. Squash the dough into a fat, flat sausage, without kneading. Wrap in cling film then chill the dough in the fridge for 15 minutes. ", "Lightly flour the work surface and the pastry. Roll out the pastry in one direction until it’s about 1cm thick and three times as long as it is wide, or about 45x15cm/18x6in. Straighten up the sides with your hands now and again, and try to keep the top and bottom edges as square as possible. ", "Fold the bottom third of the pastry up, then the top third down, to make a block about 15x15cm/6x6in. It doesn’t matter if the pastry isn’t exactly the right size - the important thing is that the corners are nice and square. ", "Turn the dough so that its open edge is facing to the right, like a book. Press the edges of the pastry together with the rolling pin.", "Roll out and fold the pastry again, repeating this four times in all to make a smooth dough, with buttery streaks here and there. If the pastry feels greasy at any point, or starts to spring back when as you roll, then cover and chill it for 10 minutes before continuing. ", "Chill the finished pastry for an hour, or ideally overnight, before using.", "When you use the pastry roll it out to about the thickness of a £1 coin, and cook it at 200C/400F/Gas 6 for about 30 minutes."]}, {"isVegetarian": true, "title": "How to make preserved lemons", "url": "www_bbc_co_uk_food_recipes_how_to_make_preserved_01545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_preserved_01545_16x9.jpg", "ingredients": ["10-15 unwaxed lemons", "250g/9oz flaky sea salt (depending on the size of the lemons)", "2 cinnamon sticks (optional)", "2 dried red chillies (optional)", "4 bay leaves (optional) "], "serves": "Makes 2x500ml/18fl oz jars", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To clean the jars, preheat the oven to 140C/275F/Gas 1. Wash the jars well in warm soapy water then rinse thoroughly under running water. Leave the jars and lids to dry, upside down, in the oven. (Or you can clean the jars by putting them through the hot cycle of a dishwasher.)", "For the preserved lemons, scrub the lemons clean, then cut each lemon in half lengthways. Cut lengthways again, to divide each half lemon into three long, thin slices. ", "Tightly pack the lemons into the sterilised jars, packing the salt around them generously as you build up the layers. Poke the herbs and spices, if using, around the lemons.", "Press the lemons down well and finish with a final layer of salt. For decoration you could add peppercorns and a bayleaf, though this will not affect the taste.", "Leave the jar in a cool dark place for at least three months before using. Turn the jars every day. There should always be a layer of salt in the bottom of the jar, so add extra salt if needed. The mature lemons are yellowish brown.", "Once opened, keep in the fridge and re-cover with lemon juice or a layer of olive oil after each use. When you use them the only part of the lemon you need is the rind - scrape away the pith and flesh and chop the rind finely. Try a little stirred into mashed potato, or in rice, served with fish."]}, {"isVegetarian": false, "title": "How to make roast chorizo chicken", "url": "www_bbc_co_uk_food_recipes_how_to_make_roast_71135", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_roast_71135_16x9.jpg", "ingredients": ["500g/1lb 2oz new potatoes, such as Charlotte ", "1-2 tbsp rapeseed or olive oil", "salt and freshly ground black pepper", "8 skinless and boneless chicken thighs (approximately 500g/1lb 2oz)", "1 tsp smoked paprika ", "pinch ground cinnamon (optional)", "handful fresh thyme sprigs or 1 tsp dried thyme ", "115g/4oz piece dried chorizo sausage ", "4 ripe tomatoes (or about 150g cherry tomatoes)", "2 garlic cloves ", "handful flat leaf parsley "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Halve or quarter the potatoes, depending on their size (to produce evenly sized chunks). Place in a large non-stick roasting tin. Toss with two tablespoons of the oil and season to taste with salt and pepper, then put into the oven for 15 minutes. ", "Cut the chicken thighs in half, add the smoked paprika and cinnamon, if using. Scatter with half the thyme leaves, season with salt and pepper, stir through and set aside.  ", "Make a nick in the skin of the chorizo then, peel away the papery skin. Cut the sausage into chunks or rounds. ", "When the potatoes have had 15 minutes roasting, give them a stir, then nestle the chicken and tomatoes into the pan. Scatter with the chorizo, garlic and the remaining thyme leaves, then season with salt and pepper. ", "Drizzle the remaining oil all over, and return to the oven to roast for 20 minutes more, stirring half-way, until the chicken is cooked through and the potatoes and tomatoes are turning golden brown and crisp at the edges", "Scatter the dish with a handful roughly chopped parsley, and serve."]}, {"isVegetarian": true, "title": "How to make sourdough bread", "url": "www_bbc_co_uk_food_recipes_how_to_make_sourdough_08213", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_sourdough_08213_16x9.jpg", "ingredients": ["500g/1lb 2oz strong unbleached white bread flour, plus extra for flouring", "300g/10½oz sourdough starter", "250ml/9fl oz water", "10g/¼oz brown sugar", "10g/¼oz salt", "flavourless oil, for greasing"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the flour, sourdough starter and water in a bowl. Add the sugar and salt. Turn out on to a clean kitchen surface and knead for 10 minutes or until the 'windowpane effect' is achieved (where the dough can be stretched until it is so thin that it becomes transparent). ", "Put the dough into a lightly oiled bowl, cover with a damp tea towel and let it prove for 2½-3 hours. You won't notice as much of a rise in the dough as you would with a normal, yeasted bread and it will take a lot longer.", "Turn out the dough onto a clean kitchen surface and knock back. Portion the dough into two and shape into two ball-shaped loaves. Flour generously, and place each loaf seam side up in a bowl, lined with a couche cloth or a heavily-floured tea towel - without the cloth, your loaf will stick in the bowl and you won't be able to turn it out. Leave to prove for a further 2½ hours. ", "Preheat the oven to 230C/450F/Gas 8. Put a few ice cubes or cold water into a baking tin and place in the bottom of the oven to create steam. Turn the loaves out onto a baking tray or hot baking stone. Using a thin sharp knife score two or three times on the top of the loaf and place in the oven. Bake for 35-40 minutes or until a good crust has formed and the loaves sound hollow when tapped on the base."]}, {"isVegetarian": false, "title": "How to make Thai green curry with prawns", "url": "www_bbc_co_uk_food_recipes_how_to_make_thai_green_83259", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_thai_green_83259_16x9.jpg", "ingredients": ["1 tsp coriander seeds", "1 tsp cumin seeds", "1 shallot, finely chopped ", "4 green bird’s-eye chillies, chopped", "4 garlic cloves, crushed", "thumb-sized piece fresh root ginger, grated", "1 lemongrass stalk, finely chopped", "pinch salt", "small bunch fresh coriander, stalks and leaves", "2 dried kaffir lime leaves", "1 tbsp fish sauce ", "pinch ground white pepper", "1 tbsp vegetable oil ", "1 aubergine, cut into 2cm/1in chunks ", "1 x 400ml can coconut milk", "2 tbsp Thai green curry paste (made above)", "100g/3½oz fine green beans ", "100ml/3½fl oz chicken or vegetable stock", "1 tbsp palm sugar, or caster sugar ", "1-2 tsp Thai fish sauce ", "500g/1lb 2oz raw, peeled king prawns", "1 dried kaffir lime leaf", "1 lime, zest and juice", "small bunch fresh coriander, chopped ", "steamed jasmine rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry paste, lightly toast the coriander and cumin seeds in a dry frying pan, until fragrant. ", "Place the seeds into a pestle and mortar, and add the shallot, chillies, garlic, ginger, lemongrass and salt. Pound to a paste with the pestle. Alternatively, you can use a food processor to do this. ", "Cut the coriander stalks into chunks, and set aside the leaves for later. Add the coriander stalks and crumble the dried kaffir lime leaves to the mix, and continue to grind until fairly smooth. ", "Add the fish sauce and a pinch of white pepper, to season. The curry paste is now ready to use. If not using immediately, the paste can be stored in a jar topped with a little oil and will keep in the fridge for a couple of weeks.", "For the curry, heat the vegetable oil in a wok or large frying pan over a medium heat. Add the chopped aubergines and fry for 4-5 minutes, until browned all over and starting to soften. Cook for another 10 minutes until the aubergines are golden-brown and softened.", "Add the solid fat from the top of the can of coconut milk and then add the Thai green curry paste and fry for 2-3 minutes until the paste has cooked a little and is fragrant. ", "Add the remaining coconut milk, bring to the boil, then lower the heat to a simmer. Add the green beans and continue cooking for 2-3 minutes, stirring occasionally.", "Allow the coconut milk to reduce and thicken slightly before adding the chicken stock.", "Add the sugar and the fish sauce to the curry. ", "Add the raw king prawns and cook for 3-5 minutes until they turn pink and are cooked through.", "Crumble in the crushed kaffir lime leaf, fresh lime juice and zest, and chopped coriander. ", "Serve with steamed jasmine rice, and sprinkle over the reserved coriander leaves."]}]