[{"ingredients": ["Pasta de pimiento picante 250 g / 9 oz o gochugang (pasta de frijol chili coreano, disponible en los supermercados de Asia)", "75ml / 3fl oz sake", "25 ml / 1 fl oz de salsa de soja", "75ml / 3fl oz mirin (disponible en los supermercados asiáticos)", "pizca de chile seco", "40g / 1½oz de pasta de ajo (disponible en los supermercados asiáticos), o cuatro dientes de ajo, machacados en una pasta", "Pasta de jengibre de 40 g / 1½ oz (disponible en supermercados asiáticos), o pedazo de jengibre del tamaño de un pulgar, machacada para untar", "2 cucharaditas de aceite de sésamo tostado", "4 x 4 soportes de cordero de hueso, corte francés (pregúntele a su carnicero que prepare esto para usted)", "1 cucharada de aceite de oliva", "1 cucharada de semillas de sésamo tostadas", "60g / 2½oz de pasta de sésamo o tahini", "10g / ½ oz de miso blanco dulce (disponible en los supermercados asiáticos y tiendas de alimentos saludables)", "1 cucharadita de jugo de jengibre (rallar el jengibre y exprimir para recoger el jugo)", "3 cucharadas de caldo dashi (bolsitas secas de dashi están disponibles en los supermercados asiáticos, agregue la cantidad apropiada de agua, siguiendo las instrucciones del paquete)", "2 cucharaditas de vinagre de arroz", "1½ cucharadita de jugo de limón", "2 cucharaditas de aceite de sésamo", "500 g / 1lb2oz de hojas de espinaca", "1 cucharadita de yama gobo picado / raíz de bardana japonesa (disponible en los supermercados asiáticos)"], "method": ["Para el cordero, coloque la pasta de pimiento picante, el sake, la soja, el mirin, el chile seco, el ajo, el jengibre y el aceite de sésamo tostado en un bol y agítelos para formar una pasta suave.", "Envuelva los huesos de cordero en pequeños trozos de papel de aluminio y péguelos para evitar que se quemen.", "Ligeramente cepille los estantes de cordero con la mitad del adobo de ají picante (reservando el resto para más tarde) y coloque el cordero en una bandeja. Transfiera a la nevera para marinar durante la noche, preferentemente durante 24 horas. Permita que regrese a la temperatura ambiente antes de cocinar.", "Precalentar el horno a 180C / 365F / Gas 4.", "Calentar una sartén grande a prueba de horno hasta que esté caliente y agregar el aceite de oliva y el cordero marinado. Cocine por cada lado hasta que se dore por todas partes, luego cepille todo con un poco más de adobo (reserve un poco de adobo para servir).", "Transfiera al horno y cocine por 10-12 minutos, o hasta que esté cocido a su gusto. Retire del horno y deje reposar en un lugar cálido durante cinco minutos.", "Para la espinaca de sésamo, coloque las semillas de sésamo, pasta de sésamo, miso blanco dulce, jugo de jengibre, caldo dashi, vinagre de arroz, jugo de limón y aceite de sésamo en un tazón y batir para combinar.", "Caliente una sartén hasta que esté caliente, luego agregue las espinacas y cocínelas hasta que estén marchitas.", "Agregue el yama gobo y la mezcla de aderezo de sésamo y mezcle para combinar.", "Para servir, espolvorea la espinaca de sésamo en el centro de cada plato en una pila ordenada. Corte la parrilla de cordero en chuletas y coloque cuatro en cada plato, dispuestos sobre la espinaca. Agregue un poco del adobo restante a cada plato y sirva."], "url": "www_bbc_co_uk_food_recipes_lambrackinjapaneseho_86628", "title": "Parrilla de cordero en pasta de pimiento picante con espinaca de sésamo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Estantes de cordero de 1 x 4 huesos cortados en francés (pregúntele a su carnicero que prepare esto para usted)", "1 diente de ajo, pelado, finamente picado", "1 limón, solo jugo", "1½ cucharadita de semillas de cilantro, tostadas, molidas a un polvo", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "Garbanzos enlatados de 400g / 14oz, escurridos, enjuagados", "½ cucharadita de semillas de cilantro, tostadas, molidas en polvo", "Hojas de espinaca bebé 200 g / 7 oz, lavado", "Sal y pimienta negra recién molida", "1 cucharada de crema", "1 diente de ajo, pelado, finamente picado", "Manojo de cilantro fresco picado", "2 cucharadas de aceite de oliva", "Sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cordero marinado, coloque el costillar de cordero en un tazón grande y agregue el ajo, el jugo de limón y el cilantro molido. Mezcle bien hasta que el cordero esté cubierto en la mezcla.", "Cubra el tazón con film transparente y deje enfriar en la nevera durante al menos una hora.", "Caliente el aceite en una sartén grande a prueba de horno, a fuego medio. Agregue el cordero marinado y cocine en cada lado durante 2-3 minutos o hasta que se dore por todas partes. Cepille cualquier adobo restante sobre el cordero y transfiéralo al horno para asar durante 10-12 minutos (a fuego medio), o hasta que esté cocido a su gusto. Retire del horno y déjelo a un lado en un lugar cálido durante cinco minutos.", "Mientras tanto, para la espinaca y los garbanzos, caliente el aceite en una sartén a fuego medio, agregue los garbanzos y el cilantro molido y fría por cuatro minutos. Agregue las espinacas y continúe cocinando; revolviendo bien, hasta que la espinaca se haya marchitado. Sazonar, al gusto, con sal y pimienta negra recién molida. Apartar y mantener caliente.", "Para el aderezo crème fraîche, coloque la crème fraîche en un tazón con ajo, cilantro y aceite y sazone al gusto con sal y pimienta negra recién molida. Revuelva hasta que esté bien combinado.", "Para servir, coloque los garbanzos y las espinacas en el centro de los cuatro platos para servir, corte el costillar de cordero en chuletas individuales y coloque uno encima de cada porción de los garbanzos. Rocíe sobre el aderezo crème fraîche."], "url": "www_bbc_co_uk_food_recipes_lambrackwithspinacha_92736", "title": "Estofado de cordero con espinacas, garbanzos y aderezo crème fraîche", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paletilla deshuesada de cordero de 650 g / 1 libra, cortada en cubos de 2 cm / ¾ pulgadas", "2 cucharadas de harina blanca, sazonada", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 cucharada de puré de tomate", "300ml / ½ pinta de vino tinto", "300ml / ½ litro de pollo y caldo de carne", "hojas de 1 ramita de romero fresco, finamente picado", "1 diente de ajo, aplastado", "1 zanahoria, cortada en dados de 1 cm / ½ pulgadas", "1 cebolla, cortada en dados de 1cm / ½in", "2 palitos de apio, cortados en dados de 1 cm / ½ pulgadas", "sal", "pimienta negra recién molida", "4 papas grandes Maris Piper", "75ml / 2½fl oz de aceite de oliva con sabor a fruta", "más extra para engrasar", "2 cucharadas de romero fresco aproximadamente picado", "1 cucharada de tomillo fresco tostado", "sal", "pimienta negra recién molida", "50g / 2oz de mantequilla", "750g / 1lb 10oz de col roja, sin corazón y en rodajas finas", "2 cucharadas de jalea de grosella", "3 cucharadas de vinagre de vino tinto o vinagre de jerez", "1 naranja, ralladura fina y jugo", "250ml / 9fl oz de puerto de rubí", "sal", "pimienta negra recién molida", "85 g / 3oz de pasas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Pon los cubos de cordero en una bolsa de plástico con la harina sazonada y dale a la bolsa un buen batido para que la carne quede bien cubierta con la harina.", "Caliente una sartén grande hasta que esté muy caliente. Agregue el aceite y la mantequilla y luego el cordero y fría a fuego alto, revolviendo de vez en cuando, hasta que todos los trozos de cordero estén bien dorados. No llenes la sartén; cocine en tandas si es necesario. Transfiera a una cazuela y reserve.", "Agregue el puré de tomate y el vino tinto a la sartén y deje que hierva, raspando todos los pedacitos que se han pegado al fondo. Vierta esto en la cazuela y agregue el caldo, el romero, el ajo y las verduras cortadas en cubitos.", "Agregue un poco de aderezo, cubra con una tapa hermética y hornee por 1 hora y media o hasta que esté tierno. (Si usa una olla de cocción lenta, cocine en auto por aproximadamente ocho horas).", "Retire del horno y revise el condimento.", "Para preparar las pilas de patatas, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Primero corte las papas (sin necesidad de pelarlas) de unos dos milímetros de grosor, ya sea a mano, si puede confiar en la coordinación de su mano y cuchillo, o en una rebanadora de mandolina. Vierta las papas en un recipiente grande, sin lavar, y agregue el aceite de oliva y las hierbas.", "Mezcle bien con sus manos, asegurándose de que las papas estén bien cubiertas. Sazone con un poco de sal y pimienta y mezcle de nuevo para mezclar.", "Cepille una bandeja para hornear con un poco de aceite de oliva y comience a preparar ocho pilas de rodajas de papa. Intenta hacer que se vean al azar, e incorpora la mayor cantidad de hierbas que puedas. Espolvoree las hierbas y el aceite de oliva restantes en el recipiente alrededor y sobre las pilas de patatas.", "Hornee durante 35-45 minutos o hasta que estén dorados en los bordes y tierno hasta el final. Puede probar esto insertando un pincho delgado en el medio de una pila, debe deslizarse fácilmente. Sirva inmediatamente o baje el horno y manténgalo caliente hasta por 30 minutos.", "Para hacer el repollo, derrita la mantequilla en una olla grande a prueba de horno.", "Agregue el repollo y revuelva para cubrir con la mantequilla. Agregue la gelatina de grosella y revuelva hasta que se derrita.", "Agregue el vinagre, la ralladura de naranja y el jugo, el puerto y un poco de aderezo. Llevar a ebullición, tapar y cocinar a fuego lento durante aproximadamente una hora o cocinar en un horno, precalentado a 160c / 325F / Gas 3.", "Agregue las pasas y vuelva a hervir a fuego lento. Cocina suavemente por otros 30 minutos. Verifique que el repollo esté tierno.", "O sirva de inmediato, manténgalo caliente en un horno bajo durante hasta una hora o enfríelo y recaliéntelo."], "url": "www_bbc_co_uk_food_recipes_lambredwineandrosema_71047", "title": "Cazuela de cordero, vino tinto y romero", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambredwineandrosema_71047_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 kg / 2 lb 3 oz hombro de cordero, cortado en cubos grandes", "1 cebolla grande, más o menos picada", "1 diente de ajo", "6 palitos de apio, más o menos picados", "3 zanahorias, más o menos picadas", "750ml / 1 pinta 7fl oz de vino tinto", "350ml / 12½fl oz de caldo de carne", "sal", "20 granos de pimienta negra", "200g / 7oz de aceitunas mixtas", "1 cabeza de coliflor, rota en grandes floretes", "100 ml / 3½ fl oz de caldo de pollo", "Crema doble de 200 ml / 7 fl oz", "pizca de curry en polvo", "sal y pimienta negra recién molida", "perejil fresco, picado"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Calentar el aceite en una cazuela grande a fuego medio y freír las piezas de cordero rápidamente para dorar por todos lados. Retire la carne de la sartén y colóquela en un tazón limpio.", "Reduzca ligeramente el fuego y agregue la cebolla, el ajo, el apio y la zanahoria a la cazuela. Freír durante 5-6 minutos, hasta que las verduras estén blandas.", "Agregue el vino, el caldo y los granos de pimienta y ponga la mezcla a ebullición.", "Regrese la carne a la olla y transfiérala al horno para cocinarla durante dos horas en el horno.", "Mientras tanto, para hacer el puré de coliflor, coloque la coliflor en una olla grande y vierta sobre el caldo de pollo. Cubra con una tapa y deje que hierva. Cocine por 7-8 minutos, o hasta que la coliflor esté tierna.", "Coloque la coliflor en un procesador de alimentos y agregue la crema y el polvo de curry. Mezcle hasta obtener una pasta suave, luego pase la mezcla a través de un colador.", "Retire la cazuela del horno. Agregue las aceitunas y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, cuchara porciones generosas en platos. Espolvorea con perejil y coloca una cucharada de puré de coliflor al lado."], "url": "www_bbc_co_uk_food_recipes_lambrosemaryandolive_85239", "title": "Cazuela de cordero, romero y aceitunas con puré de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 ramitas de romero, solo hojas, más o menos picadas", "5 dientes de ajo, finamente picados", "1 cucharada de cúrcuma molida", "1 cucharada de cilantro molido", "1 cucharada de chile rojo en polvo", "1 cucharada de sal masala", "3 cucharadas de aceite vegetal", "4 x 200 g / 7¼ oz de grupas de cordero deshuesadas (chumps)", "4 cucharadas de aceite vegetal", "2 hojas de laurel", "2 vainas de cardamomo verde, aplastadas", "5 dientes de ajo, pelados", "200 g / 7¼ oz cebollas, en rodajas", "1 cucharada de jengibre y pasta de ajo (de un recipiente)", "1 cucharadita de cilantro molido", "1 cucharadita de chile rojo en polvo", "1 cucharadita de comino molido", "1 cucharadita de cúrcuma molida", "2 cucharaditas de sal", "Tomates de 200g / 7¼ onza, cortados aproximadamente", "1 patata grande, pelada y en cubos", "2 nabos grandes, pelados y en cubos", "1 zanahoria grande, pelada y en cubos", "150 g / 5¼ oz de garbanzos enlatados, escurridos y enjuagados", "puñado de cilantro fresco, toscamente picado"], "method": ["Para el cordero, mezcle todos los ingredientes, aparte del cordero, en un plato poco reactivo. Anota las grupas con un cuchillo afilado y frota la mezcla por todas las grupas. Deja en el plato, cubierto, para marinar durante al menos dos horas en un lugar fresco.", "Precalentar el horno a 200C / 390F / Gas 6.", "Dorar bien el cordero en una sartén caliente, antes de colocarlo en el horno para asar durante 15-20 minutos, más si prefiere que la carne esté bien hecha.", "Deje reposar en un lugar cálido durante al menos cinco minutos antes de servir.", "Mientras tanto, para el estofado de verduras, caliente el aceite en una sartén a fuego medio y fríe las hojas de laurel, las vainas de cardamomo y los dientes de ajo durante un minuto.", "Agregue las cebollas y fría hasta que estén ligeramente coloreadas. Agregue el jengibre y la pasta de ajo y cocine por otros dos minutos, hasta que esté fragante.", "Agregue el cilantro, el chile en polvo, el comino, la cúrcuma, la sal, los tomates, la papa, los nabos y las zanahorias. Revuelva bien y cocine a fuego lento durante 30 minutos.", "Una vez que las papas y otras verduras estén tiernas cuando se prueban con la punta de un cuchillo, agregue los garbanzos drenados. Cocine por otros cinco minutos.", "Esparce el cilantro sobre el guiso y sírvelo coronado con la rabadilla de cordero."], "url": "www_bbc_co_uk_food_recipes_lambrumpwithspicedch_91277", "title": "Bata de cordero con guiso de garbanzos con especias", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chalotes de plátano, finamente cortados en cubitos", "pequeño puñado de perejil rizado fresco, finamente picado", "1 diente de ajo, finamente cortado en cubitos", "1 cucharada de aceite de oliva", "Tocino ahumado cortado grueso de 150g / 5oz, cortado en cubitos", "2 lechuga Little Gem, cortada a la mitad longitudinalmente", "2 Portobello grandes o champiñones de campo, en rodajas", "2 cucharadas de caldo de pollo", "60 g / 2¼ oz de mantequilla", "450 g / 1lb de hígado de cordero", "harina, para quitar el polvo", "sal y pimienta negra recién molida", "4 cucharadas de vinagre balsámico", "2 cucharadas de caldo de carne"], "method": ["Mezcle la chalota, el perejil y el ajo en un tazón y déjelos a un lado.", "Calentar el aceite en una sartén y freír el tocino a fuego lento durante 2-3 minutos, o hasta que se dore. Agregue la lechuga a la sartén, con el lado del corte hacia abajo y los champiñones y el caldo de pollo y cocínelos durante 15-20 minutos.", "Mientras tanto, caliente una sartén a fuego lento y agregue la mitad de la mantequilla. Sazone la harina al gusto con sal y pimienta negra recién molida. Espolvoree las rodajas de hígado en la harina sazonada y agregue a la mantequilla una vez que esté espumante. Cocine por 2-3 minutos, luego voltee y cocine por otro minuto. Retire el hígado de la sartén y póngalo a un lado, luego desglasifique la sartén con el vinagre balsámico, raspando las brochetas doradas. Agregue la mantequilla restante y el caldo de carne y continúe cocinando hasta que la salsa esté bien combinada y espesada ligeramente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la lechuga estofada en un plato para servir, cubra con el hígado y una cuchara sobre la salsa balsámica. Cuchara sobre la mezcla de chalote."], "url": "www_bbc_co_uk_food_recipes_lambs_liver_with_60023", "title": "Hígado de cordero con salsa balsámica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas rojas grandes, en rodajas finas", "1 cucharadita de aceite de colza", "1 cucharada de mostaza Dijon", "pizca de azúcar en polvo", "500g / 1lb 2oz de papas harinas medianas, peladas", "5 cucharadas de leche", "110g / 3¾oz de mantequilla", "300g / 10½ oz de col rizada, despalillada y cortada en trozos de 2.5cm / 1 in, reserva algunas hojas para adornar", "4-5 lonchas de tocino, corteza en", "aceite vegetal, para freír", "500g / 1lb 2oz de hígado de cordero, sin cortar", "pequeño sabio, magullado", "3 dientes de ajo, aplastados", "8 riñones de cordero cortados en cuartos", "2 cucharadas de comino molido", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir una olla de agua y blanquee las cebollas durante 5 minutos para que se ablanden. Escurrir y transferir a un tazón. Agregue el aceite de colza, la mostaza de Dijon, el azúcar y sazone con sal y pimienta negra recién molida. Dejar de lado.", "Cocine las papas en una sartén con agua salada hirviendo durante aproximadamente 20 minutos o hasta que estén tiernas. (Tenga cuidado de no cocinarlos demasiado ya que quiere un poco de resistencia en las papas.) Escurra las papas en un colador, vuelva a colocarlas en la sartén y séquelas a fuego muy lento.", "Calienta suavemente la leche. Mientras las papas estén calientes, tritúrelas aproximadamente en la olla con la parte trasera de un tenedor. Agregue la leche caliente y 60g / 2¼ oz de mantequilla.", "Hervir la col rizada en agua caliente durante 4 minutos, luego escurrir bien. Agregue a las papas trituradas y sazone con sal y pimienta. Dejar de lado.", "Freír el tocino en una sartén seca hasta que esté crujiente. Escurrir sobre papel de cocina y cortar en trozos pequeños. Freír las hojas de col rizada reservadas en una sartén seca hasta que estén crujientes y chamuscadas.", "Para el hígado, caliente un poco de aceite vegetal en una sartén hasta que esté muy caliente. Coloque el hígado en la sartén con el sabio magullado. Sazone con sal y pimienta y agregue la mantequilla restante y 2 dientes de ajo. Cocine por 3-4 minutos en ambos lados, rociándolos regularmente con la mantequilla derretida. Retire el hígado de la sartén y déjelo a un lado para que descanse.", "Agregue los riñones a la sartén con el comino y el ajo restante. Freír a fuego lento durante 2 minutos girando con frecuencia.", "Divida la col rizada y las papas entre los platos para servir y cubra con las cebollas. Cortar el hígado y colocar encima con los riñones y rociar con los jugos de la sartén. Adorne con los pedazos de tocino y hojas crujientes de col rizada."], "url": "www_bbc_co_uk_food_recipes_lambs_liver__kidney_with_60029", "title": "Hígado y riñón de cordero, con col rizada estofada y patatas trituradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 x 400 g / 14 oz de filetes de grupa de cordero, picados", "Harina normal de 50g / 2oz", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "Chalotes de 300g / 11oz, pelados, enteros a la izquierda", "2 ramitas de romero fresco, solo hojas, más o menos picadas", "Zanahorias baby 175g / 6oz, recortadas", "650ml / 1pint 4fl oz de caldo de pollo", "125g / 4½ oz de harina natural, más extra para espolvorear", "1 cucharadita de polvo de hornear", "pizca de sal", "60 g / 2½ oz de sebo", "1 cucharada de hojas de Romero fresco picado", "2 cebollas rojas, peladas, cortadas en cuñas", "600 g / 1 libra 6 pastillas de chirivía de 6 oz, peladas, cortadas en trozos", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Espolvoree la harina en un plato y drague las piezas de cordero picadas en la harina hasta que estén cubiertas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Caliente el aceite en una cazuela grande con tapa y fría el cordero, volteándolo con frecuencia, durante 3-4 minutos, o hasta que se dore por todas partes. (Puede necesitar hacer esto en lotes.) Retire cada lote de cordero de la cazuela y déjelo a un lado.", "Agregue los chalotes a la cazuela en la que se cocinó el cordero y fríalos durante 2-3 minutos, luego agregue el romero y las zanahorias y continúe cocinando durante 1-2 minutos más.", "Regrese el cordero dorado a la sartén, vierta el caldo de pollo y cocine a fuego lento.", "Cubra la cacerola con una tapa y transfiérala al horno para que se cocine de 1¼ a 1½ horas, o hasta que el cordero esté tierno y la salsa se haya espesado ligeramente.", "Mientras tanto, para las albóndigas de romero, tamice la harina, el polvo de hornear y la sal en un tazón. Agregue el sebo y el romero y agregue suficiente agua hasta que la mezcla se una como masa.", "Con las manos enharinadas, vierta cucharadas de la masa en bolitas.", "Retire la cazuela del horno y sazone, al gusto, con sal y pimienta negra recién molida. Coloque las albóndigas en la cazuela, cúbralas con una tapa y vuelva al horno durante otros 20-25 minutos, o hasta que las albóndigas estén cocidas. Retire del horno y reserve.", "Para las cebollas y chirivías tostadas, aumente el horno a 200C / 390F / Gas 6.", "Mezcle la cebolla y la chirivía con el aceite en una bandeja para hornear. Sazonar, al gusto, con sal y pimienta negra recién molida y asar en el horno durante 25-30 minutos, o hasta que estén dorados y tiernos.", "Para servir, recalentar el cordero navarin, si es necesario. Divida las cebollas asadas y chirivías entre 4 platos para servir. Coloque el navarin de cordero al lado y cubra con algunas albóndigas."], "url": "www_bbc_co_uk_food_recipes_lambrumpnavarinwithr_93447", "title": "Ramillete de cordero navarin con albóndigas de romero y cebollas asadas y pastinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3¼lb pierna de cordero, en cubos", "2 cucharaditas de semillas de cilantro molido", "2 cucharaditas de jengibre molido", "pellizcar el azafrán", "2 cucharadas de aceite de oliva", "18 chalotes enteros, pelados", "4 dientes de ajo, aplastados", "1 cucharada de harina normal", "1 cucharada de puré de tomate", "1 ramita de canela", "600 ml / 1 pinta de caldo de cordero", "2 cucharadas de perejil de flatleaf, picado", "2 cucharadas de cilantro, picado", "1 conservado de limón, enjuagado, pulpa interna eliminada", "Fechas medjool 110g / 4oz, hoyos eliminados", "1 cucharada de miel clara"], "method": ["Coloque el cordero en un recipiente y agregue el cilantro molido, el jengibre molido, el azafrán y una cucharada de aceite de oliva. Mezcle bien y deje marinar en la nevera, tapado, durante 24 horas.", "Al día siguiente, caliente el aceite de oliva restante en una sartén de base gruesa con tapa. Cocine el cordero hasta que se dore por todas partes (puede necesitar hacer esto en lotes). Retire el cordero de la sartén y déjelo a un lado.", "Freír las chalotas en la misma sartén hasta que estén ligeramente doradas, luego agregar el ajo y devolver el cordero a la sartén.", "Agregue la harina común y agregue el puré de tomate y la ramita de canela.", "Agregue el caldo de cordero y lleve a ebullición. Cubra herméticamente y cocine a fuego lento durante 1 hora y media, o hasta que el cordero esté tierno.", "Agregue el perejil, el cilantro, la cáscara de limón, las dátiles y la miel, revuelva bien para combinar y sirva con un cuenco de cuscús."], "url": "www_bbc_co_uk_food_recipes_lambshallotanddateta_449", "title": "Cordero, chalote y tagine de fecha", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambshallotanddateta_449_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 corderos", "2 cucharaditas de sal", "pimienta negra recién molida", "13cm / 5 en pieza de jengibre fresco, pelado y picado grueso", "8 dientes de ajo, pelados y picados en trozos gruesos", "525ml / 18fl oz de agua fría", "8 cucharaditas de aceite de oliva o aceite de maíz", "2 cucharaditas de semillas de comino, todo entero", "1 cucharadita de clavo de olor, dejó todo", "4 palitos de canela de tamaño mediano", "2 cucharaditas de pimienta negra, dejada entera", "475 ml / 16 fl oz de yogur natural sin grasa, revuelto hasta que quede suave", "4 cucharaditas de semillas de cilantro molidas a un polvo grueso en un mortero", "1½ cucharadita de polvo de chile picante grueso o pimienta de cayena", "½ cucharadita de cúrcuma molida", "arroz basmati, medido al nivel de 500 ml / 17 fl oz en una jarra medidora", "3 cucharadas de aceite de maíz, aceite de cacahuete o aceite de oliva", "1 canela de tamaño mediano", "5 vainas de cardamomo, dejadas enteras pero ligeramente trituradas", "2 hojas de laurel", "Rodajas de cebolla de 85g / 2½oz, cortadas en finas medias medias", "25g / 1 oz de eneldo fresco finamente picado", "650ml / 1 pinta 4fl oz de caldo de pollo"], "method": ["Para las patas de cordero, precaliente el horno a 160 ° C / 325 ° F / Gas 3.", "Sazonar las espigas de cordero con ½ cucharadita de sal y pimienta negra recién molida, al gusto. Pat el condimento en la carne.", "En un procesador de alimentos, mezcle el jengibre, el ajo y cuatro cucharadas de agua hasta obtener una pasta homogénea. Dejar de lado.", "Caliente el aceite en una sartén grande, antiadherente, a prueba de horno a fuego alto. (NB: Necesitará usar una olla con tapa hermética). Cuando el aceite esté humeando, agregue las espigas de cordero y fría durante 3-4 minutos, volteándolas regularmente o hasta que estén ligeramente doradas por todos lados. Retire las espigas de cordero de la sartén y déjelas a un lado en un plato caliente.", "Agregue el comino, los clavos de olor, la canela y los granos de pimienta al aceite caliente en la sartén en la que se cocinaron las costillas de cordero. Fría durante 10-15 segundos, o hasta que esté fragante.", "Agregue el jengibre y la pasta de ajo y mezcle bien. Freír durante 5-6 minutos o hasta que estén ligeramente dorados.", "Retire la sartén del fuego y permita que el contenido se enfríe un poco, luego agregue el yogur. Revuelva hasta que esté bien combinado, luego agregue el agua restante y mezcle de nuevo hasta que esté bien combinado.", "Regrese la sartén al fuego y luego agregue el cilantro molido, el chile en polvo o la pimienta de cayena, la cúrcuma molida y las restantes cucharaditas y media de sal. Revuelva bien hasta que se combinen.", "Regrese las espigas de cordero a la sartén para que estén cubiertas con la mezcla de yogurt. Llevar la mezcla a ebullición, luego cubrir la sartén con papel de aluminio y colocar la tapa en la parte superior.", "Transfiera la sartén al horno y hornee lentamente durante tres horas, girando las espigas cada 30 minutos.", "Retire la sartén del horno y retire la tapa y el papel de aluminio. Coloque la sartén a fuego alto y ponga a hervir la mezcla de yogur. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento el líquido restante durante 6-7 minutos, o hasta que el volumen del líquido se haya reducido y la salsa se haya espesado. Hilvane las patas de cordero regularmente con la salsa restante mientras la hierve a fuego lento.", "Mientras tanto, para el pilau basmati con eneldo y cardamomo, enjuague el arroz en varios cambios de agua. Escurra bien, luego coloque el arroz escurrido en un recipiente y cúbralo generosamente con agua fresca. Déjelo a un lado durante 30 minutos para remojar, luego drene bien nuevamente.", "Caliente el aceite en una sartén de base pesada a fuego medio. (NB: Necesitarás una sartén con una tapa hermética). Cuando el aceite esté caliente, agrega la ramita de canela, las vainas de cardamomo y las hojas de laurel y freír durante 5-10 segundos, revolviendo bien.", "Agregue las cebollas y freír durante 4-5 minutos, revolviendo regularmente, o hasta que estén coloreados.", "Agregue el arroz basmati remojado y escurrido, el eneldo picado y mezcle bien. Reduzca ligeramente el fuego y cocine el arroz durante 2-3 minutos, revuelva bien, o hasta que el arroz esté cubierto con el aceite y haya comenzado a cocinarse.", "Añadir el caldo y hervirlo. Sazonar, al gusto, con hasta una cucharadita de sal si es necesario, luego cubrir con una tapa. Reduzca el fuego a su nivel más bajo y cocine el arroz durante 20-25 minutos, o hasta que esté tierno.", "Para servir, divida el arroz por igual entre cuatro platos para servir. Coloque una pierna de cordero al lado de cada uno."], "url": "www_bbc_co_uk_food_recipes_lambshanksbraisedina_91037", "title": "Caña de cordero estofado en salsa de yogurt con pilaf basmati con eneldo y cardamomo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo, finamente picado", "2 filetes de pierna de cordero 2 x 225 g / 8 oz", "sal y pimienta negra recién molida", "250 g / 9 oz de mantequilla sin sal, suavizada a temperatura ambiente", "1 cucharadita de esencia de anchoa", "1 limón, ralladura solamente", "6 anchoas frescas, drenados de aceite y picados", "750 g / 1 libra 10 oz de salsifí", "2 limones, solo jugo", "1.5 litros / 2½ pintas de agua fría", "Harina normal de 25g / 1oz", "1 cucharadita de sal", "Mitades de nuez 75g / 3oz", "1 cucharada de mantequilla clarificada", "sal y pimienta negra recién molida", "1 cucharada de aceite de nuez", "1 cucharada de sultanas, empapada durante la noche en suficiente brandy para cubrir", "½ cucharadita de azúcar en polvo", "1 cucharada de vinagre de Jerez", "25 g / 1oz de mantequilla sin sal", "2 cucharadas de perejil de flatillo picado, para servir"], "method": ["Para el cordero, frote el aceite y el ajo en los filetes. Colóquelos en un recipiente, cúbralos y déjelos en la nevera durante al menos seis horas.", "Un cuarto de hora antes de que esté listo para cocinar, retire el cordero de la nevera y vuelva a la temperatura ambiente.", "Caliente una sartén hasta que esté caliente. Coloque los filetes en la plancha y cocine durante 3-4 minutos en ambos lados. Retire los filetes de la sartén, sazone con sal y pimienta negra recién molida, al gusto, y déjelos a un lado en un lugar cálido para descansar.", "Para la mantequilla de anchoa, coloque la mantequilla en un tazón y agregue la esencia de anchoa, la ralladura de limón y las anchoas picadas y mezcle para combinar.", "Coloque la mezcla de mantequilla en una hoja de película adhesiva o pergamino para hornear colocado en una superficie de trabajo limpia, y ruede en un tronco.", "Coloque el registro de mantequilla preparado en el refrigerador y deje enfriar hasta que esté firme.", "Para el salsifí, llene un recipiente con agua y agregue la mitad del jugo de limón. Pele el salsifí y corte en trozos de 5cm / 2in e inmediatamente coloque el salsifí en el recipiente (para evitar que se decolore).", "Mientras tanto, combine un chorrito de 1.5 litros / 2½ litros de agua con la harina en una cacerola y revuelva para hacer una pasta suave.", "Agregue los 1,5 litros restantes / 2½ pintas de agua y el jugo de limón, junto con la sal. Llevar a ebullición, batiendo continuamente. Esta mezcla se llama 'blanc'.", "Escurra el salsifí y colóquelo en la sartén con el blanc.", "Llevar a ebullición, luego reduzca el fuego a fuego lento y cocine durante 15 minutos hasta que esté tierno.", "Escurra y enjuague el salsifí en agua fría y séquelo.", "Caliente una sartén antiadherente, agregue la mitad de la mantequilla clarificada y luego agregue el salsifí seco.", "Sazonar con un poco de sal y pimienta negra recién molida y freír suavemente para colorear y calentar. Coloque la mantequilla clarificada restante en otra sartén, agregue las nueces y colóquelas a fuego alto durante un par de minutos. Tenga cuidado de no quemar las nueces.", "Agregue las sultaninas, el azúcar y el vinagre a las nueces. El azúcar se caramelizará y el vinagre se reducirá a un glaseado.", "Retire del fuego y mezcle con la mantequilla sin sal. Se sazona con sal y pimienta negro al gusto. Vierta esta mezcla sobre el salsifí y mezcle.", "Para servir, precaliente la parrilla a fuego. Retire la mantequilla de anchoa del refrigerador y corte. Coloque una rebanada de mantequilla sobre cada filete de cordero y coloque el cordero en una bandeja debajo de la parrilla para derretir la mantequilla.", "Transfiera los filetes de cordero a dos platos para servir. Ponga el salsifí al costado, adorne con perejil picado y sirva."], "url": "www_bbc_co_uk_food_recipes_lambsteakswithanchov_87915", "title": "Filetes de cordero con mantequilla de anchoas, salsifí y nueces", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 corderos", "6 anchoas en conserva, cortadas en mitades", "12 pequeñas ramitas de romero", "12 láminas de ajo", "sal y pimienta negra recién molida", "55 g / 2 oz de grasa de pato, mantequilla o goteo", "2 zanahorias, aproximadamente picadas", "2 palitos de apio, más o menos picados", "1 puerro, más o menos picado", "2 cebollas, más o menos picadas", "1 cabeza de ajo, dividida en clavos de olor", "1 ramita de tomillo", "1 ramita de romero", "1 hoja de laurel", "½ botella de vino tinto", "600 ml / 1 pinta de caldo de pollo o cordero o agua", "2 cucharadas de aceite de oliva virgen extra", "115g / 4oz lardons de bacon rayados, blanqueados", "1 zanahoria, finamente picada", "1 apio en barra, finamente cortado en cubitos", "1 cebolla, finamente picada", "6 dientes de ajo, pelados", "2 ramitas de tomillo", "2 ramitas de romero, picadas", "4 tomates, sin semillas y en cubitos", "2 x 375 g / 13 oz de frijoles flageolet, escurridos y enjuagados", "3 dientes de ajo picados", "5 cucharadas de perejil fresco picado", "2 limones, ralladura ralladura solamente", "2 cucharadas de queso parmesano rallado"], "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Para las patas de cordero, primero quite la mayoría de la grasa de las espigas. Haga tres incisiones profundas en cada espiga e inserte en cada mitad una anchoa envuelta alrededor de una ramita de romero y una rodaja de ajo. Sazone la carne con sal y pimienta negra recién molida; no necesitará demasiada sal ya que las anchoas son muy saladas.", "Caliente un poco de grasa de pato, mantequilla o goteando en una cacerola, agregue las espigas y dore todo. Eliminar y reservar.", "A la cazuela, agregue las zanahorias, el apio, el puerro, la cebolla, el ajo y las hierbas y cocine a fuego alto hasta que las verduras estén doradas.", "Desglasar la cazuela agregando el vino tinto, raspando los residuos en el fondo de la sartén y revolviendo bien.", "Agregue el caldo o el agua a la cazuela, coloque las espigas en la parte superior de las verduras, cubra y cocine en el horno durante dos horas y media.", "Cuando el cordero haya terminado de cocinarse, retire los cuatro vástagos a un plato y manténgalos calientes. Pase las verduras y el licor de cocción a través de un mouli o mezcle en un procesador de alimentos y déjelo a un lado.", "Para la salsa, caliente el aceite en una sartén grande a fuego medio a alto. Agregue el tocino y fría hasta que se dore. Reduzca el fuego y agregue la zanahoria, el apio, la cebolla y el ajo.", "Cocine durante ocho minutos hasta que las verduras se hayan ablandado, luego agregue el tomillo, el romero, los tomates y los frijoles flageolet. Calor a través de.", "Pase el licor de cocina de cordero mezclado y las verduras a través de un colador o un tamiz fino sobre la mezcla de frijoles, mezcle y vierta sobre las patas de cordero.", "Mezcle los ingredientes gremolata juntos para hacer el gremolata.", "Sirva el cordero con guarnición de gremolata y parmesano."], "url": "www_bbc_co_uk_food_recipes_lambshankwithgarlicr_79926", "title": "Caña de cordero con ajo, romero y frijoles flagelados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero 750 g / 1 lb 10 oz, cortado en cubos de 2.5 cm / 1 in", "sal y pimienta negra recién molida", "Harina normal de 25g / 1oz", "1 cucharada de aceite de oliva", "50g / 2oz de mantequilla", "12 cebollas baby, peladas", "2 zanahorias medianas, cortadas en dados grandes", "1 colinabo mediano, cortado en dados grandes", "50ml / 2fl oz de vino blanco", "2 ramitas de romero", "4 hojas de laurel", "1,25 litros / 2 pintas de caldo de cordero", "3 cucharadas de perejil de flatillo, más o menos picado", "125g / 4½ oz de harina común", "65 g / 2½ onzas de sebo", "½ cucharadita de polvo de hornear", "pizca de sal", "1 cucharada de romero, finamente picado", "500ml / 18fl oz de caldo de cordero"], "method": ["Precalentar el horno a 120C / 250F / Gas ½.", "Sazonar el cordero y el polvo con la harina. Coloque una cazuela de fondo grueso a fuego medio, agregue el aceite de oliva y la mantequilla y luego el cordero. Freír hasta que estén doradas. Retire el cordero y manténgalo a un lado.", "Reduzca el fuego y fría las cebollas, las zanahorias y el colinabo hasta que esté caramelizado. Agregue el vino y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el cordero nuevamente con el caldo de cordero. Haga hervir a fuego lento el guiso y luego agregue la hoja de laurel y el romero. Cubra con una tapa, transfiera la sartén al horno y hornee por una hora.", "Para las albóndigas, mezcle la harina, el sebo, el polvo de hornear y una pizca de sal en un tazón. Agregue el romero y agregue gradualmente 3-5 cucharadas de agua fría, o suficiente para formar una masa pegajosa. Harina sus manos y luego enrolle la masa en 12 bolas pequeñas. Coloque en un plato en la nevera para enfriar.", "Cuando el estofado de cordero esté listo, coloque 500 ml / 18 fl oz de caldo de cordero en una sartén separada y deje hervir a fuego lento. Agregue las albóndigas y cocine a fuego lento durante 6-8 minutos. Deseche el caldo cuando las albóndigas estén cocidas y déjelas a un lado para que descansen por un minuto.", "Agregue las albóndigas y el perejil a la cacerola y sirva por igual entre cuatro cuencos poco profundos."], "url": "www_bbc_co_uk_food_recipes_lambstewwithrosemary_90363", "title": "Guiso de cordero con albóndigas de romero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambstewwithrosemary_90363_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 berenjena mediana, cortada longitudinalmente en rodajas gruesas de 1cm / ½ in", "aceite de oliva, para cubrir las berenjenas", "1 pierna de cordero, hueso eliminado", "115g / 4¼oz de aceitunas negras kalamata, sin hueso", "2 cucharadas de ralladura de naranja rallada", "1 cucharadita de ralladura de limón rallado", "2 cucharadas de salvia picada", "2 cucharadas de ajo picado", "2 cucharadas de anchoa picada", "1 cucharadita de pimienta negra molida", "2 cucharadas de aceite de oliva", "2 cucharadas de orégano seco", "sal y pimienta negra recién molida", "1 limón, solo jugo", "1 pepino, reducido a la mitad, sin semillas y rallado grueso", "450 g / 1 libra de yogur griego", "2 limas, solo ralladura, ralladas", "2 dientes de ajo grandes, aplastados", "1 manojo de cebollas en rodajas finas", "1 chile rojo, finamente picado", "eneldo picado, para servir"], "method": ["Calentar una sartén de plancha. Cortar las berenjenas a lo largo en cuatro rebanadas y cepillar con aceite de oliva. Sear en ambos lados. Retirar del fuego y poner a un lado.", "Coloque los ingredientes de la pasta en un procesador de alimentos y mezcle.", "Toma la pasta y untala sobre el interior de la pierna de cordero. Coloque las rodajas de berenjena encima. Enrolle la pierna y ate a intervalos de 5cm / 2in. Permita descansar el mayor tiempo posible, de la noche a la mañana si puede.", "Precaliente el horno a 200C / 400F / Gas 6. Frote el orégano, la sal, la pimienta y el jugo de limón en la carne. Coloque la carne en una sartén caliente para dorar a cada lado antes de colocarla en el horno. Asar durante 15 minutos por 500 g / 1 libra más 15 minutos más, volteando ocasionalmente. Cubra la carne con papel de aluminio durante los primeros 30 minutos de cocción para mantenerla húmeda.", "Retire del horno y deje reposar la carne durante un tercio del tiempo que le tomó cocinar. Esto garantiza un resultado perfectamente rosado.", "Para hacer la tzatziki lima, pelar el pepino, quitar las semillas y rallar finamente. Exprime toda la humedad antes de combinar con el resto de los ingredientes. Enfriar durante una hora para permitir que los sabores se mezclen. Espolvorea sobre el eneldo justo antes de servir.", "Sirva la carne con el tzatziki en el lado."], "url": "www_bbc_co_uk_food_recipes_lambwithaubergineand_71920", "title": "Cordero con berenjena y tzatziki", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "400g / 14oz de cordero picado", "1 cucharadita de comino molido", "1 cucharadita de semillas de cilantro molido", "½ cucharadita de canela molida", "1 cucharada de puré de tomate", "300ml / 11fl oz de caldo de cordero", "75g / 3oz sultanas", "50g / 2oz de piñones, tostados", "3 cucharadas de hojas frescas de cilantro, picadas", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "400g / 14oz de tomates picados enlatados", "1 cucharadita de azúcar en polvo", "1 cucharadita de semillas de cilantro molido", "sal y pimienta negra recién molida", "2 calabacines, pelados y cortados finamente a lo largo", "1 bola de mozzarella, espesamente en rodajas", "3 cucharadas de parmesano recién rallado", "1 limón, solo jugo", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 bolsa de hojas de ensalada mixtas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne picada de cordero, caliente una sartén hasta que esté caliente, agregue el aceite de oliva, la cebolla y el ajo y cocínelos durante 3-4 minutos, hasta que se suavicen.", "Agregue la carne picada de cordero y cocine por 2-3 minutos, hasta que se dore.", "Agregue el puré de comino, cilantro, canela y tomate y cocine por un minuto más.", "Agregue el caldo de cordero, pasas sultanas y piñones y deje que hierva, luego reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Agregue el cilantro fresco y condimente, al gusto, con sal y pimienta negra recién molida. Retirar del fuego y dejar enfriar un poco.", "Para la médula enrollada, caliente una sartén por separado hasta que esté caliente. Agregue la mitad del aceite de oliva, la cebolla y el ajo y cocine por 2-3 minutos, hasta que se ablanden.", "Agregue las semillas de tomate, azúcar y cilantro molido y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 20 minutos, o hasta que la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Calentar una sartén por separado hasta que esté caliente, agregar el aceite de oliva restante y las tiras de médula en rodajas en lotes y freír en cada lado durante 30-50 segundos, hasta que se ablande y comience a dorar. Retire y escurra el papel de cocina mientras cocina las tiras restantes.", "Coloque las rodajas de médula en una superficie de trabajo limpia y sazone bien con sal y pimienta negra recién molida.", "Ponga un poco de la mezcla de carne de cordero en el centro de cada rebanada de médula y enrolle alrededor de la carne picada. Transfiera cada rollo relleno a un plato resistente al horno, con la costura hacia abajo.", "Coloque la salsa de tomate sobre los rollos de médula rellena, luego cubra con trozos de mozzarella y espolvoree con queso parmesano.", "Cubra el plato con papel de aluminio y colóquelo en el horno para hornear por 15 minutos. Retire la lámina y vuelva al horno por otros 5-8 minutos, o hasta que se dore por todas partes.", "Para la ensalada, mezcle el jugo de limón y el aceite de oliva en un bol y sazone al gusto con sal y pimienta negra recién molida.", "Coloque las hojas de ensalada en un recipiente para servir y rocíe con el aderezo. Mezcle la ensalada para cubrir bien.", "Para servir, coloque dos rollos de médula rellena en cada plato y espolvoree un poco de salsa. Sirva con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_lambstuffedrolledmar_89438", "title": "Tuétano enrollado relleno de cordero con ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "1 filete de cordero", "1 litro de caldo de cordero", "½ zanahoria", "½ barra de apio", "½ cebolla", "1 diente de ajo", "2 cucharadas de aceite de oliva", "1 diente de ajo, finamente cortado en cubitos", "½ cebolla, en rodajas", "1 ramita de tomillo", "200g / 7¼oz de repollo savoy, rallado", "3 hongos planos grandes, cortados en cuñas"], "method": ["Calentar una sartén hasta que esté caliente.", "Agregue el aceite y luego cocine el cordero brevemente en cada lado.", "Mientras tanto, coloque el caldo de cordero, la zanahoria, el apio, la cebolla y el ajo en una sartén y deje que hierva.", "Agregue el cordero y el poach por dos minutos.", "Retire y deje reposar.", "Para la fricassée, calentar la sartén hasta que esté caliente, agregar el aceite de oliva, el ajo, la cebolla y el tomillo.", "Cocine por 2-3 minutos hasta que se suavice.", "Agregue el repollo savoy y saltee durante cinco minutos.", "Agregue los champiñones y cocine durante 2-3 minutos más.", "Agregue 50ml / 1¾fl oz del líquido de caza furtiva.", "Servir."], "url": "www_bbc_co_uk_food_recipes_lambwithcabbageandmu_73310", "title": "Cordero con col y hongos fricassée", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva virgen extra", "1 cebolla grande, en rodajas", "Pierna de cordero deshuesada de 900g / 2lb, cortada en trozos bastante grandes", "1 vaso de vino blanco seco", "1 huevo", "3 huevos, solo yemas", "2 cucharadas de perejil fresco grueso picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "12 tallos de espárragos", "pan de ciabatta"], "method": ["Caliente el aceite en una sartén grande, agregue la cebolla y cocine suavemente hasta que esté tierna.", "Agregue la carne y fría por 5 minutos, hasta que se dore.", "Agregue el vino y un poco de sal y pimienta, luego cubra y estofar durante 20-30 minutos, hasta que el cordero esté tierno, revolviendo ocasionalmente para evitar que se pegue.", "Batir ligeramente el huevo entero y las yemas de huevo en un tazón, luego agregar el perejil y el jugo de limón. Saque la olla del fuego y vierta la mezcla de huevo, revolviendo para obtener una salsa suave como la seda; el calor de la carne cocinará suavemente los huevos, pero no deberían revolver.", "Cocine los tallos de espárragos en agua hirviendo a fuego lento hasta que estén suaves (o pueden cocinarse al vapor).", "Sirve el cordero inmediatamente, con pan de chapata y algunos espárragos."], "url": "www_bbc_co_uk_food_recipes_lambwitheggsauce_68076", "title": "Cordero con salsa de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chuletas de cordero", "1 rebanada de pan tostado", "puñado de hierbas frescas mezcladas (perejil, menta, albahaca)", "Parmesano 80 g / 3 oz, finamente rallado", "sal y pimienta para probar"], "method": ["Precalentar la parrilla a alto", "Incline todos los ingredientes de la corteza en un procesador y blitz brevemente.", "Cocine las chuletas de cordero debajo de la parrilla y sirva dispersas con la corteza de hierbas."], "url": "www_bbc_co_uk_food_recipes_lambwithherbcrust_7598", "title": "Cordero con corteza de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de pierna de cordero, cortado en dos piezas", "1 cucharada de aceite de oliva", "1 cucharada de romero fresco, finamente picado", "½ limón, jugo y ralladura", "sal y pimienta negra recién molida", "1 chalote, pelado y reducido a la mitad", "1 cucharada de aceite de oliva", "100g / 3½ oz de batata, pelada y picada", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el cordero, frote el cordero con el aceite, el romero fresco y la ralladura de limón y sazone bien con sal y pimienta negra recién molida.", "Coloque el cordero en una sartén caliente a fuego medio y freír durante 4-5 minutos en cada lado, o hasta que esté cocido. Exprima el jugo de limón en cada lado durante la cocción.", "Para la chalota tostada, coloque la chalota en una lata pequeña, rociada con aceite de oliva y coloque en el horno para asar durante 10-15 minutos, hasta que se dore y suave.", "Para el puré de camote, coloque la batata en agua hirviendo con sal y hierva durante 10 minutos, luego drene sobre un colador. Regrese la batata a la sartén y revuelva, revuelva en aceite de oliva y sal y pimienta negra recién molida, para probar.", "Para servir, coloque el cordero sobre una pila de puré de camote con la chalota tostada en el lado."], "url": "www_bbc_co_uk_food_recipes_lambwithlemonandfres_82126", "title": "Cordero con limón y romero fresco, chalota asada y puré de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de calabaza, extremo superior, en rodajas de 1 cm de espesor", "1 chalote de plátano, finamente picado", "25 g / 1oz de mantequilla sin sal", "30ml / 1floz de aceite de oliva", "150 g / 5½ oz de cordero (filete de pierna)", "sal y pimienta negra recién molida al gusto"], "method": ["Recorta tres rondas de nogal con un cortador redondo de tres pulgadas. Mezcle en un recipiente con los chalotes y el aceite de oliva y sazone bien.", "Derrita la mantequilla en una sartén a fuego medio. Agregue las rondas y cocine por tres minutos en cada lado.", "Para cocinar el cordero, coloque una sartén a fuego alto.", "Sazone el filete de cordero en ambos lados. Coloque en la sartén de la plancha y cocine por dos minutos en cada lado.", "Retire y corte el bistec.", "Para servir, coloque las rondas de nogal en una pila en un plato de servir. Coloque el cordero cortado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_lambwithsautebuttern_77966", "title": "Cordero con calabaza salteada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]