[{"isVegetarian": false, "title": "Parsee-style lamb cutlet served with tomato gravy and salad", "url": "www_bbc_co_uk_food_recipes_parsee-style_lamb_cutlet_13755", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 6-bone rack of lamb, each cut into 3-bone pieces", "1 tsp crushed ginger", "1 tsp crushed garlic", "1 tsp ground cumin", "1½ tsp ground coriander", "½ tsp ground turmeric", "½ tsp garam masala", "2 tbsp sunflower or rapeseed oil", "½ lime, juice only", "pinch salt", "4-5 large Maris Piper potatoes, peeled and cut into cubes 0.5cm/¼in thick", "1 tsp butter", "1 tsp cumin seeds", "2 garlic cloves, finely chopped", "1 heaped tbsp chopped fresh coriander leaves", "110g/4oz plain flour", "3-4 free-range eggs, beaten", "200g/7oz breadcrumbs", "vegetable oil, for frying", "500g/1lb 2oz tomatoes, roughly chopped", "25g/1oz butter", "1 tbsp sunflower or rapeseed oil ", "2-3 large red chillies, seeds removed, cut into 2-3 pieces", "3 garlic cloves, chopped", "7.5-10cm/3-4in piece cassia bark (or cinnamon stick)", "250g/9oz red onion, finely chopped", "2 tbsp malt vinegar", "2 tbsp raw cane sugar or jaggery", "1 tbsp tamarind paste", "pinch salt", "2 tbsp ready-made mango chutney relish with mint", "½ lime, juice only", "1 tbsp vegetable oil", "pinch salt", "½ cucumber, diced", "1 beef tomato, seeds removed, finely diced", "1 medium green chilli, finely chopped", "1 small banana shallot, finely sliced", "1 lettuce, leaves finely chopped", "1 tbsp chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, remove the two outer bones from each 3-bone rack of lamb, leaving only the centre bone on each piece of meat.", "Flatten the lamb cutlets between two sheets of cling film using a meat mallet or rolling pin. ", "Scrape all the meaty bits off the top of the bones with the back of your knife.", "Mix the ginger, garlic, ground cumin, coriander, turmeric, garam masala, sunflower (or rapeseed) oil, lime juice and salt together in a bowl, then rub the mixture all over the cutlets.", "Cover the cutlets and chill in the refrigerator overnight, or for at least a few hours, to marinate.", "When the cutlets have marinated, shake off any excess marinade.", "Heat a heavy-based non-stick frying pan over a medium to high heat. When the pan is hot, add the marinated lamb chops and fry quickly until browned all over. (Be careful not to burn the spices in the marinade.)", "Remove the cutlets from the pan and place onto a plate lined with kitchen paper. Set aside for 30-40 minutes to cool.", "Meanwhile, bring a pan of salted water to the boil, then add the potatoes. Return to a simmer and cook for 5-8 minutes, or until tender. Drain off the water and return the potatoes to the pan. Return to the heat briefly to drive off any excess moisture. As the potatoes cook, crush them lightly with a wooden spoon. Mash the potatoes with a masher or ricer until smooth. Set aside.", "Heat a frying pan over a medium heat, then add the butter, cumin seeds and garlic and fry for 1-2 minutes, or until the garlic has softened. Add the mixture to the mashed potatoes along with the coriander leaves and mix well. Set aside. ", "For the tomato gravy, blend the tomatoes to a pulp in a food processor. ", "Heat a frying pan over a medium heat. Add the butter and oil. When the butter is foaming, add the chillies, garlic and cassia bark (or cinnamon stick) and fry for 1-2 minutes, or until the garlic is golden-brown.", "Add the red onions and fry for a further 3-4 minutes, or until softened.", "Add the tomato pulp and bring the mixture to the boil. Simmer for 3-4 minutes, or until the mixture has thickened slightly, then add the vinegar, sugar and tamarind paste and reduce the heat until the mixture is simmering. Simmer until the mixture has thickened to a rich sauce.", "Remove the cassia bark (or cinnamon stick), then return the sauce to the food processor and blend to a purée. Season, to taste, with salt and freshly ground black pepper. Keep warm. ", "When the lamb cutlets have cooled, cover each one all over in a 1.5cm/½in layer of the spiced mashed potato.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto a separate plate.", "Dredge each lamb and potato cutlet in the flour, dusting off any excess. Then dip them in the beaten egg and finally roll them in the breadcrumbs.", "Heat 5cm/2in of the oil in a deep-sided, heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous; do not leave unattended.) Fry the coated cutlets until browned on both sides and cooked through, about 6-8 minutes in total. Remove from the pan and set aside to drain on kitchen paper. Keep warm.", "For the salad, whisk the mango chutney, lime juice, oil and salt together until well combined, then mix with the rest of the ingredients. ", "To serve, pile some salad onto each of four serving plates. Rest one lamb cutlet alongside each portion of salad, then spoon over the tomato gravy."]}, {"isVegetarian": true, "title": "Parnsip rosti", "url": "www_bbc_co_uk_food_recipes_parnsip_rosti_83149", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parnsip_rosti_83149_16x9.jpg", "ingredients": ["300g/10½oz parsnips, grated", "300g/10½oz sweet potatoes, grated ", "pinch dried chilli flakes", "1 small bunch fresh coriander, leaves reserved, stalks finely chopped ", "1 garlic clove, crushed", "½ tsp ground coriander ", "½ tsp ground cumin", "1 tsp black onion seeds ", "1–2 tbsp plain flour", "1 medium free-range egg, beaten", "4 tbsp olive oil", "150g/5½oz Greek-style yoghurt", "harissa paste, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients, apart from the oil, yoghurt and harissa, in a large bowl and mix to combine. The mixture should hold together. It it doesn't, add an extra tablespoon of flour. Using your hands, divide the mixture into four and shape into 8cm/3¼in flat rounds.", "Place a large frying pan over a medium heat, add the oil and fry each rosti on both sides until golden and crisp. The rostis will probably need to be cooked in batches. If so, place the cooked rosti on a plate lined with kitchen paper and keep warm in an oven on a low temperature until ready to serve.", "Mix the yoghurt and harissa in a small bowl.", "To serve, put the rosti on serving plates and spoon the harissa yoghurt over the top."]}, {"isVegetarian": false, "title": "Parsee fish in banana leaf with egg and peanut salad", "url": "www_bbc_co_uk_food_recipes_parseefishinbananale_90849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp salt", "½ tsp ground turmeric", "4 grey mullet, head and backbone removed (ask your fishmonger to do this)", "1 fresh coconut, flesh grated (or 200g/7oz desiccated coconut, soaked in water and squeezed dry)", "2 large bunches fresh coriander, leaves only", "4-5 long green chillies", "6-8 garlic cloves", "7.5cm/3in piece fresh ginger, peeled and roughly chopped", "1 heaped tsp cumin seeds, toasted", "1 tbsp caster sugar", "1-2 limes, juice only", "1 large bunch fresh mint, leaves only", "3-4 tbsp water, as necessary", "4 banana leaves, trimmed, any hard stem removed (available from some Asian grocers, sometimes frozen)", "4 tbsp malt vinegar", "5 free-range eggs, hard boiled, cooled, peeled", "6 tbsp freshly grated coconut (or desiccated coconut, soaked in water and squeezed dry)", "1-2 large green chillies, trimmed, finely chopped", "2 tbsp chopped fresh coriander", "1 tbsp tamarind pulp (or 1½ tsp tamarind concentrate, available from Asian grocers)", "3-4 tbsp chopped roasted peanuts", "1 tbsp chopped shallots", "2 tbsp chopped fresh tomatoes", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Parsee fish, preheat the oven to 190C/375F/Gas 5.", "In a bowl, mix together the salt and ground turmeric until well combined, then rub the spice mixture into the fish.", "Blend the grated coconut, coriander, chillies, garlic, ginger, cumin seeds, sugar, lime juice and mint to a paste in a food processor. If necessary, gradually add enough water, a tablespoon at a time, to loosen the mixture.", "Rub the paste all over each seasoned grey mullet, both on the outside skin of the fish and inside the belly cavities.", "Pass one side of each of the banana leaves over the flame of a gas cooker (5-10 seconds is sufficient) to soften the leaves. Alternatively, soften the leaves using a chefs' blow torch. ", "Place one piece of fish into the centre of each banana leaf. Fold the leaves over to make four parcels. Tie each parcel securely with string.", "Place the banana leaf parcels into a roasting tray. Sprinkle over the malt vinegar and a few drops of cold water. Bake in the oven for 15-20 minutes.", "For the egg and peanut salad, cut each of the hard-boiled eggs in half. Remove the yolks from the whites. Crumble the yolks, then finely chop the whites.", "In a bowl, mix together the diced egg whites, crumbled egg yolks and the remaining egg and peanut salad ingredients. Season, to taste, with salt and freshly ground black pepper.", "To serve, place one banana leaf parcel into the centre of each of four serving plates. Remove the string from the banana leaf parcels and open them up. Serve a portion of the egg and peanut salad alongside each Parsee fish portion, inside the banana leaf."]}, {"isVegetarian": false, "title": "Parsley and asparagus soup with poached egg and pork scratchings", "url": "www_bbc_co_uk_food_recipes_parsley_and_asparagus_39884", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "2 shallots, chopped", "2 sprigs fresh thyme", "600ml/20fl oz vegetable stock ", "300g/10½oz asparagus, stalks roughly chopped, tips set aside ", "115g/4oz flatleaf parsley, leaves picked", "50g/2oz watercress", "1 tbsp olive oil", "115g/4oz pork rind, patted dry and cut into small pieces", "115g/4oz streaky bacon, cut into small lardons", "1 tbsp white wine vinegar", "4 free-range eggs", "2 tbsp parsley cress", "2 tbsp watercress cress"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, fry the butter, shallots and thyme in a medium saucepan for two minutes.", "Add the vegetable stock and bring to the boil.", "Add the asparagus stalks, reserving the tips, and cook for a minute.", "Add the parsley and watercress and simmer for two minutes, until the asparagus is just tender.", "Remove from the heat and blend with a hand blender, or allow to cool for 3-4 minutes and place into a food blender. Blend the soup until smooth.", "Return the soup to the hob over a medium heat and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, bring a pan of salted water to the boil, add the asparagus tips and simmer for 2-3 minutes until just tender.", "Drain the asparagus tips and mix with a little olive oil, salt and black pepper.", "For the garnish, preheat a deep fat fryer to 160C/325F, or alternatively heat vegetable oil in a deep sided, heavy based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the dried pieces of pork rind into the fat fryer and cook for 2-3 minutes until golden-brown and puffed. Lift out with a slotted spoon and set aside on a plate.", "Increase the temperature of the fat fryer to 190C/375F.", "Return the pork rind to the fat fryer and fry for another 2-3 minutes until crisp. Lift out with a slotted spoon and drain onto kitchen paper. Sprinkle with salt.", "In aa frying pan, fry the bacon until brown and crisp, then set aside onto kitchen paper to drain. ", "Bring a small pan of water to a gentle simmer then add the vinegar.", "Stir the simmering water vigorously to create a vortex, then carefully crack two of the eggs into the water. Poach for 2-3 minutes, or until the eggs are cooked to your liking, then carefully remove from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "Repeat the poaching process with the remaining two eggs.", "Alternatively, if using later, drop the poached eggs straight into iced water and chill in the fridge until ready to use. Bring a pan of water to the boil, then add the poached eggs and cook for a minute just to heat through. Drain onto kitchen paper.", "To serve, lay the asparagus tips into the centre of the soup plate then nestle the poached egg in the centre of the pile. Ladle in the soup around the edge then scatter over the pork scratchings and bacon. Finish by scattering the parsley and watercress cress over the top."]}, {"isVegetarian": false, "title": "Parsley and pea soup with smoked salmon fish cakes", "url": "www_bbc_co_uk_food_recipes_parsley_and_pea_soup_58491", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 shallot, chopped", "2-3 garlic cloves, finely chopped", "500g/1lb 2oz flatleaf parsley, roughly chopped", "400g/14oz frozen peas", "1 litre/1¾ pints hot vegetable stock (or water)", "50ml/2fl oz double cream", "25ml/1fl oz olive oil", "handful of pea shoots, to serve", "oil, for deep-fat frying", "225g/8oz floury potatoes, peeled and cut into chunks", "40g/1½oz butter", "6 spring onions, thinly sliced", "1 tbsp chopped flatleaf parsley", "1 lemon, zest and juice", "salt and freshly ground black pepper", "375g/13oz smoked salmon, diced", "110g/4oz plain flour", "2 free-range eggs, beaten", "110g/4oz panko breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsley and pea soup, heat the butter in a frying pan over a medium heat. Add the shallot and garlic and fry gently for about 3-4 minutes, or until softened. ", "Add the parsley, peas and hot stock (or water), bring the mixture to the boil, then reduce the heat until the mixture is simmering and continue to simmer for three minutes, or until the peas are bright green and just tender.", "Place in a blender and blend until smooth.", "For the smoked salmon fish cakes, heat a deep-fat fryer to 180C/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Boil the potatoes in a pan of boiling water for 12-18 minutes, or until tender. Drain and return the pan to the heat for one minute to drive off any excess moisture. Mash the potatoes, or pass through a potato ricer into a bowl. Set aside to cool slightly.", "Melt the butter in a frying pan and fry the spring onions for 2-3 minutes, or until just softened.", "Stir the spring onions, parsley, lemon zest and juice into the potatoes and stir until well combined.", "Season with plenty of salt and freshly ground black pepper, then add the salmon and carefully fold together.", "Divide the mixture into 16 small fishcakes, each one the size of a thumb nail.", "Put the flour, beaten egg and panko breadcrumbs into three separate bowls.", "Coat the fish cakes in the flour, then beaten egg and finally in the breadcrumbs. Deep fry them (in batches if necessary) for 1-2 minutes, or until golden-brown.", "Remove from the fryer and place on kitchen paper to drain away any excess fat.", "To serve, pour the soup into shallow bowls and place the fish cakes in the centre. Garnish with the pea shoots and drizzle with cream and olive oil."]}, {"isVegetarian": true, "title": "Parsley pesto", "url": "www_bbc_co_uk_food_recipes_parsleypestowithpota_11633", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz flatleaf parsley leaves (no stalks)", "1-2 garlic cloves, crushed", "40g/1½oz freshly grated parmesan", "30g/1oz pine nuts", "75ml/2½fl oz extra virgin olive oil", "salt"], "serves": "Makes 1 portion", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients except the oil and salt into the food processor.  Whiz for a second or two, add the oil and a little salt.  Taste and correct seasoning."]}, {"isVegetarian": true, "title": "Parsley sauce", "url": "www_bbc_co_uk_food_recipes_parsleysauce_1300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "25g/1oz plain flour", "600ml/1 pint milk", "salt and white pepper", "2 tbsp parsley, freshly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan. ", "Stir in the flour and cook for 1-2 minutes.", "Take the pan off the heat and gradually stir in the milk to get a smooth sauce. Return to the heat and, stirring all the time, bring to the boil. ", "Simmer gently for 8-10 minutes and season with salt and white pepper.", "Stir in the parsley and serve."]}, {"isVegetarian": true, "title": "Parsley, tomato and bulgar wheat salad", "url": "www_bbc_co_uk_food_recipes_parsleytomatoandburg_73147", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsleytomatoandburg_73147_16x9.jpg", "ingredients": ["30g/1¼oz fine bulgar wheat", "600g/1lb 5¼oz firm ripe tomatoes, diced into small cubes, 0.5cm/¼in square", "½ bunch spring onions, trimmed and very thinly sliced", "2 bunches flatleaf parsley, (about 400g/14lb¼oz on the stalk), very finely chopped", "small bunch mint, (about 70g/2½oz on the stalk), leaves only, very finely chopped", "¼ tsp ground cinnamon ", "½ tsp ground allspice", "½ tsp finely ground black pepper", "salt ", "1 lemon, juice only", "5 tbsp extra virgin olive oil", "4 Little Gem lettuces, washed and quartered (or fresh tender vine leaves or white cabbage leaves, washed and dried)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Rinse the bulgar wheat in several changes of cold water, drain well and put in a large salad bowl.Spread the diced tomatoes and their juice over the bulgar then add the sliced onions.  Put the chopped parsley over the spring onions, looking out for big pieces, if there are any, take them out and chop them finely. Add the chopped mint to the parsley, cover with a clean kitchen towel and leave for about half an hour for the bulgar wheat to absorb the tomato juices and soften. ", "Season with cinnamon, allspice, pepper and salt to taste.  Add the lemon juice and olive oil and mix well together. Taste, adjust seasoning if necessary and serve immediately with either Little Gem lettuce or fresh vine leaves."]}, {"isVegetarian": true, "title": "Parsley sauce", "url": "www_bbc_co_uk_food_recipes_parsleysauce_70894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint béchamel sauce", "5 heaped tbsp fresh parsley, finely chopped ", "1 tbsp single cream ", "1 tsp lemon juice ", "salt ", "freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Warm up the béchamel sauce, add the chopped parsley, cream and lemon juice, taste and season, then serve."]}, {"isVegetarian": true, "title": "Parsnip, apple and raisin mini-muffins", "url": "www_bbc_co_uk_food_recipes_parsnip_apple_and_raisin_68466", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsnip_apple_and_raisin_68466_16x9.jpg", "ingredients": ["130g/4½oz plain flour", "130g/4½oz plain wholemeal flour", "2 tsp baking powder", "1 tsp mixed spice", "pinch salt", "1 free-range egg, lightly beaten", "70g/2½oz butter, melted and cooled slightly", "1 parsnip (about 125g/4½oz pre-peeled weight), peeled and grated", "1 small apple, grated", "75g/2¾oz raisins", "5 tbsp clear honey", "100ml/3½fl oz apple juice ", "125g/4½oz unsalted butter, softened", "125g/4½oz full-fat cream cheese", "2 tbsp clear honey", "1 tsp vanilla extract"], "serves": "Makes 24 mini-muffins", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4. Line two mini-muffin tins with squares of baking parchment, pushing them down to make little cases (alternatively use shop-bought mini-muffin cases).", "Mix the flours, baking powder, mixed spice and salt together in a bowl.", "Whisk together the egg and butter in a separate bowl. Stir in the parsnips, apple, raisins and honey and then add to the dry ingredients. Add the apple juice and stir to combine, but take care not to overmix.", "Spoon the mixture into the muffin tins and bake for 18-20 minutes, or until risen (check after 15 minutes).", "For the topping, beat the butter in a bowl until smooth and creamy.", "In another bowl, beat the cream cheese until creamy then stir in the honey and vanilla extract. Add the creamed butter and stir to combine. Transfer the topping into a piping bag fitted with a large star tip. Refrigerate the piping bag for about 30 minutes (leaving the piping bag in the fridge makes the topping easier to pipe). ", "Pipe the topping onto the muffins."]}, {"isVegetarian": false, "title": "Parsnip and chestnut soup", "url": "www_bbc_co_uk_food_recipes_parsnip_and_chestnut_03556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter", "600g/1lb 5oz parsnips, chopped", "1 small leek, trimmed and chopped", "150ml/5fl oz white wine", "200g/7oz cooked chestnuts (sold vacuum-packed)", "1.5 litre/2 pints vegetable stock (preferably homemade)", "salt and freshly ground black pepper", "8 scallops"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt half of the butter in a large heavy-based saucepan over a gentle heat but do not allow it to colour. Add the parsnips and leek and let them fry gently for about 4-5 minutes, or until the parsnip is soft.", "Add the white wine and chestnuts (reserving a few for garnish) and fry gently for a further 7-8 minutes. Season the mixture with salt and pepper to taste.", "Add the stock to the saucepan and bring to the boil, then simmer for 5-6 minutes. Remove the pan from the heat and blend with an immersion blender or in a food-processor until it’s nice and smooth. (If you’re using a food processor, allow the soup to cool a little before you blend it.) Pass the soup through a fine sieve and set aside.", "Heat a large frying pan and add the butter. Once melted, add the scallops and cook on each side for 1-2 minutes.", "Divide the seared scallops among four shallow serving bowls and ladle the soup around. Grate the reserved chestnuts on top."]}, {"isVegetarian": false, "title": "Parsnip soup with spinach and scallops", "url": "www_bbc_co_uk_food_recipes_parsnip_soup_with_10440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "1 shallot, roughly chopped", "1 garlic clove, roughly chopped ", "500g/1lb 2oz parsnips, peeled, cut into medium chunks", "2 sprigs fresh thyme", "1 tbsp honey", "2 tsp medium curry powder", "400ml/14fl oz vegetable stock ", "100ml/3½fl oz double cream", "1 tbsp rapeseed oil", "50g/1¾oz spinach ", "2 tbsp rapeseed oil", "4 hand-dived scallops in their shells, meat removed and cleaned", "4 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt the butter in a large saucepan. Add the shallot and garlic and cook for 2-3 minutes. Add the parsnips, thyme, honey and curry powder and cook for a further 2-3 minutes. Pour in the stock and cook for 8-10 minutes, or until the parsnips are tender. ", "Transfer to a blender and blend until smooth. Pour back into the pan, stir in the cream and gently warm though.", "Meanwhile, heat the oil in a large frying pan. Add the spinach and a few tablespoons water, then cook until wilted. Keep warm.", "For the scallops, heat the oil in a large frying pan. Once hot, add the scallops and cook for 1 minute on each side, or until just cooked through. Remove from the pan and season with salt and pepper. Set aside to rest for a few minutes before serving.", "To serve, divide the wilted spinach between shallow serving bowls and pour over the hot soup. Garnish with the scallops and coriander cress."]}, {"isVegetarian": true, "title": "Parsnip, sprout and chestnut hotpot with cider and sprout top pesto", "url": "www_bbc_co_uk_food_recipes_parsnip_sprout_and_73857", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz pearl barley or pearled spelt", "2 tbsp olive or rapeseed oil", "250g/9oz shallots or baby onions, peeled and cut in half", "300g/10½oz Brussels sprouts, trimmed and outer leaves removed", "400g/14oz parsnips, peeled and cut into 2.5 cm/1in chunks", "150g/5½oz cooked, peeled chestnuts", "150ml/5fl oz medium-dry cider", "2 bay leaves, torn", "2 thyme sprigs ", "750ml/26fl oz hot vegetable stock ", "extra virgin olive oil, for drizzling", "sea salt and freshly ground black pepper", "leafy tops from 1–2 Brussels sprout stems ", "½ garlic clove, finely chopped or grated", "25g/1oz walnuts or pumpkin seeds", "1 lemon, juice and zest", "2–3 tbsp extra virgin olive or rapeseed oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the pearl barley into a large bowl, cover with cold water and leave to soak for 15 minutes. ", "Heat the oil in a flameproof casserole dish over a medium heat. Add the shallots, Brussels sprouts, parsnips, chestnuts, and season with salt and pepper. Cook for 15 minutes, stirring only occasionally, until you get a golden-brown colour on the vegetables.", "Add the cider and simmer for a couple of minutes, stirring and scraping the bottom of the pan to deglaze it, until the liquid has reduced to almost nothing. ", "Drain the pearl barley and rinse well. Add to the casserole dish with the bay leaves, thyme and stock. Stir well, bring to a simmer, then reduce the heat to low.  Cover and simmer for 35–40 minutes, or until the barley is tender. Check the seasoning. ", "Meanwhile, to make the pesto, strip any tough stalks from the Brussels leaves. Roughly shred or chop the leaves and place into a food processor. Add the garlic, walnuts or pumpkin seeds and some salt and pepper. Blend until finely chopped, stopping once or twice to scrape down the sides. ", "Add a squeeze of lemon juice and slowly trickle in the oil, whilst the processor is on. Stop when the ingredients have formed a coarse pesto – it’s nicest if it’s still a bit leafy and textured, rather than a smooth puree. Taste and add more salt, pepper or lemon juice as needed. Place into a bowl and finish with a few fine gratings of lemon zest. ", "To serve, spoon the hotpot into warmed bowls and top with the sprout top pesto. "]}, {"isVegetarian": false, "title": "Parsnip soup with mini crab beignets", "url": "www_bbc_co_uk_food_recipes_parsnip_soup_with_mini_24382", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "500g/1lb 2oz parsnips, peeled, roughly chopped", "2 banana shallots, roughly chopped", "2 garlic cloves, finely chopped", "2 fresh thyme sprigs, leaves only", "½ tsp curry powder", "750ml/1pt 7fl oz chicken stock", "75ml/3fl oz double cream, plus extra to garnish", "salt and freshly ground black pepper", "vegetable oil, for frying", "125ml/4½fl oz water", "50g/2oz butter, diced", "75g/3oz plain flour", "½ tsp cayenne pepper", "2 free-range eggs", "75g/3oz white crabmeat", "25g/1oz brown crabmeat", "salt and freshly ground black pepper", "2 tsp extra-virgin olive oil", "2 tbsp fresh coriander cress", "1 tbsp flaked almonds, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt half of the butter in a large saucepan until foaming. Add the parsnips and fry for 4-5 minutes, or until pale golden-brown.", "Add the shallots, garlic and thyme and fry for 2-3 minutes, then stir in the curry powder and fry for another minute.", "Pour in the chicken stock and cook for 8-10 minutes, or until the parsnips are tender.", "Add the double cream, cool the soup slightly and blend the soup in a blender until smooth.", "Strain the soup through a sieve into a clean saucepan and season, to taste, with salt and freshly ground black pepper. Whisk in the remaining butter.", "For the mini crab beignets, heat the oil in a deep-fat fryer to 180C/350F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Heat the water and butter in a saucepan until the mixture boils, then boil for another minute.", "Remove the pan from the heat and beat in the flour and cayenne with a wooden spoon until smooth, or until the mixture comes away from the side of the pan.  Return the pan to the heat and cook for 1-2 minutes, stirring continuously.", "Remove the pan from the heat and beat in the eggs, one at a time, beating well before adding the other egg.", "Stir in the white and brown crabmeat until well combined, then season with salt and freshly ground black pepper.", "Spoon the mixture into a piping bag and pipe 1.5cm/½in long sections into the oil and fry for 1-2 minutes, or until golden-brown and crisp. Remove the beignets from the pan with a slotted spoon, set aside to drain on kitchen paper and season with salt.", "To serve, ladle the soup into soup bowls, scatter over some crab beignet and finish with a swirl of double cream. Drizzle the soup with olive oil and sprinkle over the coriander cress and flaked almonds."]}, {"isVegetarian": false, "title": "Parsnip soup with steamed clams", "url": "www_bbc_co_uk_food_recipes_parsnipsoupwithsteam_93513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 slices streaky bacon, roughly chopped", "1.5kg/3lb 4oz clams, cleaned (discard any clams that remain open after rinsing)", "175ml/6fl oz white wine", "salt and freshly ground black pepper", "2 tbsp chopped fresh flatleaf parsley", "50g/2oz butter", "1 onion, peeled, roughly chopped", "2 garlic cloves, peeled, finely chopped", "500g/1lb 2oz parsnips, peeled, roughly chopped", "2 fresh sprigs thyme, leaves only", "750ml/1pint 7fl oz chicken stock", "75ml/3fl oz double cream", "1 tbsp olive oil", "4 thin slices baguette, rubbed with a little oil and toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over a medium heat and fry half of the bacon for 1-2 minutes, or until golden-brown. Remove from the pan, using a slotted spoon, and set aside to drain on kitchen paper.", "Meanwhile, heat a lidded frying pan over a medium heat. Add the clams and white wine, cover the pan with a lid and steam the clams for 2-3 minutes, or until all of the clams have opened. (Discard any clams that have not opened during cooking.) ", "Strain the clams through a colander and reserve the cooking liquor. Pick the clam meat from the shells, place into a bowl, season, to taste, with freshly ground black pepper. Stir in the parsley and cooked bacon and set aside.", "Heat half of the butter in a saucepan until foaming and fry the onion, garlic and the remaining half of the bacon for 2-3 minutes, or until softened. Add the parnsips and thyme and cook a further 2-3 minutes. Pour in the reserved cooking liquor from the clams, bring the mixture to the boil and cook until the volume of the liquid has reduced by one-third.", "Pour in the chicken stock and return the mixture to the boil. Reduce the heat and simmer for 8-10 minutes, or until the parsnips are tender.", "Stir in the double cream and blend the mixture in a blender until smooth. ", "Pass the blended soup through a sieve into the saucepan and return to the heat. Season, to taste, with salt and freshly ground black pepper and whisk in the remaining 25g/1oz butter.", "To serve, spoon some of the clams into the middle of each of 4 serving bowls. Ladle the soup around the clams and top with a slice of toast."]}, {"isVegetarian": true, "title": "Cheesy parsnip and sweet potato tarts", "url": "www_bbc_co_uk_food_recipes_parsnip_sweet_potato_and_66305", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsnip_sweet_potato_and_66305_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "pinch salt", "150g/5½oz cold butter, cut into cubes", "50g/1¾oz Parmesan (or alternative vegetarian hard cheese), finely grated", "2½-3½ tbsp iced water", "10g butter", "1 onion, finely chopped", "2 parsnips, peeled and cut into 1cm cubes", "1 sweet potato, peeled and cut into 1cm cubes", "2 free-range eggs", "200ml/7fl oz double cream", "2 sage leaves, finely chopped", "1 tsp fresh thyme leaves, plus 12 thyme sprigs to garnish", "60g/2¼oz Parmesan (or alternative vegetarian hard cheese), finely grated", "30g/1oz blanched hazelnuts, roughly chopped", "salt and freshly ground black pepper"], "serves": "Makes 6 tarts", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour and salt into a mixing bowl. Rub in the butter, then mix in the Parmesan and bring together with the water. Wrap in clingfilm and put in the fridge for 30 minutes.", " Preheat the oven to 200C/180C Fan/Gas 6.", "Roll out the pastry on a lightly floured surface to 2-3mm thick. Cut out six circles using an 11cm/4in cutter and use to line six tart tins, rerolling the pastry if you need to. Line each pastry case with baking paper, add baking beans and blind bake for 12 minutes. ", "Remove the paper and beans and bake for a further minute. Remove from the oven and reduce the temperature to 180C/160C Fan/Gas 4.", "Meanwhile for the filling, heat the butter in a heavy-bottomed frying pan. Add the onion and cook for 1–2 minutes. Add the parsnip and sweet potatoes and cook, stirring from time to time, for 15 minutes, or until almost cooked through and caramelised. Spoon into the pastry cases. ", "Mix the eggs, cream, sage, thyme and half the Parmesan together in a jug and season well. Pour over the vegetables in the pastry cases. ", "Sprinkle the hazelnuts and remaining Parmesan over the pastry cases and decorate each one with two thyme sprigs. Bake for 35–40 minutes until golden-brown. Serve."]}, {"isVegetarian": false, "title": "Partridge with Jerusalem artichoke purée, caramelised apple and chicken sauce", "url": "www_bbc_co_uk_food_recipes_partridge_with_jerusalem_01583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz rapeseed oil", "200ml/7fl oz chardonnay or white wine vinegar", "100g/3½oz caster sugar               ", "6 sprigs thyme  ", "2 Jerusalem artichokes, peeled and thinly sliced", "1 tbsp rapeseed oil", "4 chicken wings", "2 banana shallots, peeled and sliced                                             ", "30g/1oz button mushrooms, sliced ", "1 garlic clove, sliced", "1 sprig thyme", "100ml/3½fl oz Madeira", "300ml/10½fl oz dark chicken stock        ", "100ml/3½fl oz double cream, to finish  ", "1 lemon, juice only  ", "350g/12½oz Jerusalem artichokes, peeled and diced                 ", "150g/5½oz celeriac, diced             ", "3 banana shallots, chopped                        ", "1 garlic clove, peeled            ", "150g/5½oz unsalted butter              ", "200ml/7fl oz double cream", "1.1 litres/2 pints chicken stock", "3 garlic cloves, peeled and left whole", "6 sprigs thyme ", "2 partridge crowns", "1 tbsp rapeseed oil", "salt and freshly ground black pepper", "knob of butter", "vegetable oil, for deep frying", "100g/3½oz kale leaves", "salt, to taste", "1 tbsp rapeseed oil", "50g/1¾oz smoked pancetta, diced into 1cm/½in cubes", "50g/1¾oz girolle mushrooms, trimmed ", "knob of butter", "10g finely chopped chives    ", "100g/3½oz sugar", "1 Granny Smith apple, cored and cut into rings", "50g/1¾oz butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinated artichoke discs, put all the ingredients apart from the artichokes into a large pan. Bring to a simmer, add the artichoke discs and bring back to a simmer. Pour into a deep container and leave to marinate for an hour.", "For the chicken sauce, heat the oil in a deep pan over a medium-high heat. Add the wings and cook until caramelised. Set the wings aside. ", "Drain the pan and add the shallots. Cook the shallots until caramelised then add the mushrooms, garlic and thyme.", "When they have turned golden-brown de-glaze the pan with the Madeira and continue to cook to reduce it in volume down to a syrup.", "Add the stock, put the wings back into the pan and bring to the boil. Simmer for 30 minutes and then pass through a fine sieve.", "To finish, add the cream and cook to reduce the volume of liquid down to a sauce consistency. Finish with lemon juice, to taste.", "For the Jerusalem artichoke purée, put all the ingredients into a pan with 560ml/1 pint of water and bring to the boil. Cook over a high heat to rapidly reduce the volume of liquid until the butter and water have absorbed into the vegetables. Add cream, to taste, and blend to a smooth purée using a stick blender.", "For the partridge, bring the chicken stock, garlic and thyme to the boil in a pan. Once boiling, remove the pan from the heat and place the partridge crowns into the stock, cover and leave for 10 minutes.", "Remove the partridge crowns from the pan and pat dry. Carefully remove the breasts from the partridge crowns using a thin, sharp knife.", "Heat a non-stick frying pan and add a little oil. Season the partridge breasts with salt and pepper and place skin-side down in the pan. Cook until golden-brown, then add a little butter and turn the partridge over. Baste for 20 seconds, remove the breasts from the pan and set aside in a warm place.", "For the kale, prepare a deep-fat fryer or fill a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 160C/300F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Deep fry the kale for approximately 30 seconds or until the kale is crisp. Remove and drain on kitchen paper. Season with a little salt and leave to cool.", "For the mushroom and smoked bacon garnish, in a hot pan add a touch of rapeseed oil and fry the pancetta until just golden-brown. Add the mushrooms and a little butter and cook for a further minute. Add the chopped chives and season if needed.", "For the caramelised apple, heat the sugar in a pan until it turns a light caramel colour.", "Add the apple rings and a little butter and cook for 30 seconds, flip the apple over and turn off the heat of the pan, after 20 seconds remove the apple from the pan.", "To serve, on large serving plates trim the partridge and neatly place off centre, and put the apple next to the partridge. Spoon the Jerusalem artichoke purée next to the them. Spoon the smoked bacon and mushrooms over and around the breast. Finish with a little drizzle of chicken sauce and arrange a few pieces of deep-fried kale and artichoke discs around the plate."]}, {"isVegetarian": false, "title": "Partridge with cobnut crust and potted game", "url": "www_bbc_co_uk_food_recipes_partridge_with_cobnut_86862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash vegetable oil", "3 whole partridge, jointed (ask your butcher to do this)", "300g/10½oz mixed game", "1 x 340g/12oz tin goose fat, melted", "100g/3½oz oats", "100g/3½oz plain flour, plus extra for flouring", "50g/1¾oz grated parmesan", "½ tsp cayenne pepper", "salt and freshly ground black pepper", "1 tbsp olive oil", "100g/3½oz shelled cobnuts", "200g/7oz melted butter", "50g/1¾oz finely chopped chive", "1 punnet blackberries", "fresh herbs, for garnish"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Heat the oil in a pan and fry the partridge legs to colour them all over.", "Place the partridge legs in an ovenproof dish. ", "Add the mixed game and pour over the goose fat. Set aside the partridge breasts.", "Place in the oven for two hours to gently confit. ", "Once cooked, carefully remove the partridge from the fat with a slotted spoon. Season the confit and press it together to form a slim sausage shape and wrap tightly in cling film. Place in the fridge to set.", "Set the oven to 180C/350F/Gas 4.", "Mix the oats, flour, parmesan, cayenne pepper, salt and pepper in a bowl. ", "Add just enough boiling water to make a dough that is not sticky. ", "On a lightly floured surface, roll out the dough and cut into rounds. ", "Grease a baking tray with olive oil and place the rounds on the prepared baking tray. Cook for 12-15 minutes", "Gently fry the cobnuts in a frying pan. Chop them finely and set aside for the crust.", "Season the partridge breasts, brown lightly in a pan before placing in the oven for 6-8 minutes, or until the partridge is cooked but still slightly pink in the middle. Brush with some of the melted butter and dip into the cobnuts to form a crust. ", "To assemble the dish, slice a small round of the confit game, brush with a little melted butter and dip in chopped chives. Put the game, breast and oatcakes onto each plate and garnish with blackberries and fresh herbs."]}, {"isVegetarian": false, "title": "Partridge croustillant", "url": "www_bbc_co_uk_food_recipes_partridge_croustillant_20604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz caster sugar", "250ml/9fl oz cider vinegar", "1 sprig fresh tarragon", "1 sprig fresh thyme", "2cm/¾in piece fresh root ginger", "½ red chilli", "500g/1lb 2oz fresh blackberries", "500g/1lb 2oz carrots, sliced", "1 litre/1¾ pint fresh carrot juice", "salt and freshly ground black pepper", "450g/1lb large-leaf spinach, stalks removed, leaves blanched briefly in lightly salted water", "6 partridge breasts (off the bone)", "6 feuilles de brick pastry circles (available online and from specialist retailers)", "4 Maris Piper potatoes, cut into strings using a spiraliser", "vegetable oil, for deep-frying", "1 free-range egg, beaten ", "1 shallot, finely chopped", "75g/2½oz unsalted butter", "150g/5½oz girolles, cleaned", "150g/5½oz chanterelles, cleaned", "2 tbsp chopped fresh tarragon", "6 circles sliced bread, fried in lard", "6 leaves hispi cabbage, cooked and refreshed in ice water", "partridge jus or gravy"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pickled blackberries, mix the sugar, cider vinegar, tarragon, thyme, ginger and chilli in a saucepan. Bring to the boil then cool a little before adding the blackberries. Allow to infuse for a few hours and for up to 2 weeks.", "For the carrot purée, put the carrots in a large saucepan and cover with enough carrot juice to cover. Bring to the boil and then simmer until the carrots are soft. Transfer to a blender and pulse until smooth. Push through a sieve, season with salt and pepper. Keep warm until ready to serve.", "For the partridge, preheat a deep-fat fryer to 160C. Or until a small piece of bread turns crisp and golden-brown within a minute. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Lay out 6 spinach leaves on a work surface. Put a partridge breast in the middle of each leaf and season with salt and pepper. Wrap up into a parcel, then layout 2 circles of the brick pastry and cut each circle into quarters. Wrap each spinach parcel in a quarter of pastry, brushing the edges with beaten egg to help them stay in place. ", "Wrap the parcels completely in potato strings. Lower each parcel into the fryer and cook for 3 minutes. Remove using a slotted spoon and set aside to rest and drain on kitchen paper.  ", "Heat the butter in a large frying pan, then fry the shallot until soft. Add the mushrooms and when cooked, finish with the tarragon.", "When ready to serve, if necessary, fry the parcels again briefly to ensure they are hot. To serve, lay a leaf of hispi cabbage in centre of each plate. To one side place the fried bread, on top of this add the mushrooms. Slice the croustilliant parcels in 2 and lay them on the cabbage. Drain the blackberries and arrange them around the plates. Spoon over partridge jus and finish with a neat spoonful of carrot purée.\t"]}, {"isVegetarian": false, "title": "Parsnip-stuffed roast saddle of lamb with fondant potatoes, roast beetroot and red wine sauce", "url": "www_bbc_co_uk_food_recipes_parsnipstuffedroasts_86957", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "400g/14oz parsnips, cut into 3cm x 10cm (1¼in x 4in batons)", "2 tbsp honey", "2 sprigs fresh thyme", "2 sprigs fresh rosemary", "salt and freshly ground black pepper ", "1.5kg/3lb 4oz boned saddle of lamb", "6 large potatoes, cut into cylinders about 5cm/2in long", "1 tbsp water", "2 sprigs fresh thyme", "50g/2oz butter", "3 large beetroot, cut into wedges", "1 tbsp olive oil", "salt and freshly ground black pepper ", "200ml/7fl oz red wine", "300ml/11fl oz beef stock", "salt and freshly ground black pepper ", "50g/2oz butter"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lamb, heat the oil in an ovenproof frying pan and add the parsnips. Fry for 2-3 minutes, then add the honey, thyme and rosemary. Stir to coat and season, to taste, with salt and freshly ground black pepper.", "Transfer to the oven and roast for 20-25 minutes, or until just tender and golden-brown. Remove from the oven and allow to cool.", "Open up the lamb and season with salt and freshly ground black pepper. Place the parsnips down the centre of the lamb. Fold the lamb over the parsnips, then turn over so that the join is on the bottom and tie securely with string to enclose the filling.", "Heat a large frying pan until hot. Place the lamb into the pan and cook on each side for 2-3 minutes, until lightly browned all over. Place in the oven for 30-40 minutes, until the lamb is cooked through but still pink, or until cooked to your liking. Remove from the oven and leave to rest for five minutes.", "For the fondant potatoes, place the potatoes into a heat-resistant plastic food bag with the water and thyme and seal tightly.", "Place a pan of water over a high heat and place the bag of potatoes into it. Bring to the boil, then reduce the heat and simmer for 20-25 minutes, or until the potatoes are just tender. Remove the bag from the water and take the potatoes out of the bag, taking care as there will be steam.", "Heat the butter in a frying pan and fry the potatoes, turning frequently, until golden-brown all over.", "Meanwhile, for the roast beetroot, place the beetroot into a roasting pan, drizzle with olive oil and season with salt and freshly ground black pepper. Place in the oven along with the lamb and roast for 30 minutes, or until just tender.", "For the sauce, heat the red wine in a small pan. Bring to the boil, then reduce the heat and simmer until reduced by half.", "Add the beef stock and simmer until reduced by two thirds. Season, to taste, with salt and freshly ground black pepper and whisk in the butter.", "To serve, slice the lamb and place onto serving plates with the fondant potatoes and beetroot. Pour over the sauce."]}, {"isVegetarian": false, "title": "Party eggs", "url": "www_bbc_co_uk_food_recipes_party_eggs_72598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs, hard-boiled, peeled, halved lengthways", "2 tsp salad cream", "cherry tomatoes, chopped", "cooked bacon bits", "cress", "spring onion, sliced"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully remove the yolk from the eggs and put in a bowl. Mash in the salad cream and a little of the toppings. ", "Spoon the yolk mixture back into the halved eggs and place on a serving plate."]}, {"isVegetarian": false, "title": "Party vol-au-vents", "url": "www_bbc_co_uk_food_recipes_party_vol-au-vents_60239", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz ready-made puff pastry", "plain flour, for rolling", "225g/8oz un-dyed smoked haddock fillet", "300ml/10fl oz whole milk", "100g/3½oz cooked, peeled prawns", "2 tbsp chives, finely sliced", "½ onion, cut into quarters", "2 bay leaves", "3 sprigs fresh thyme", "25g/1oz butter", "25g/1oz plain flour", "5 tbsp crème fraîche", "sea salt flakes", "freshly ground black pepper", "2 boneless chicken breasts, roasted, skin removed, cut into small pieces", "1 tbsp fresh tarragon leaves", "1 tbsp white wine"], "serves": "Makes 30", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, preheat the oven to 200C/400F/Gas 6 and line a large baking tray with greaseproof paper.  Roll out the pastry on a lightly floured surface and cut into 30 x 6cm/2½in squares. Score a smaller square inside each one, leaving a 75mm/¼in border.  (Take care not to cut the pastry all the way through.)", "Bake the pastry squares in the oven for 18-20 minutes, or until puffed up and golden-brown. ", "Remove from the oven and transfer to a wire rack to cool.  When cool carefully remove the central square of pastry from each one. ", "Meanwhile, for the smoked haddock and prawn filling, place the haddock in a saucepan with the milk, bring to a simmer, switch off the heat and leave the fish to cook in the residual heat for ten minutes.", "Drain the haddock, reserving the milk. Set the haddock aside to cool slighly, then remove the skin. ", "For the sauce, pour the reserved milk into a saucepan and add the onion, bay leaves and thyme.  Bring to a gentle simmer, then remove from the heat and leave to infuse for ten minutes.   Strain the milk through a sieve into a jug and discard the onion and herbs.", "Melt the butter in a non-stick saucepan over a low heat, add the flour and cook for a few seconds, stirring constantly.  Stir in the hot infused milk slowly,  and cook for 1-2 minutes or until the sauce is smooth and thick.   Season, to taste, with salt and freshly ground black pepper, remove from the heat and stir in the crème fraîche.   Cover with clingfilm and leave to cool. ", "Divide the sauce into two portions, flake the haddock into one half of the sauce, checking for any remaining bones and stir in the prawns and chives.  For the chicken and tarragon filling, stir the chicken, tarragon and wine into the other half of the sauce. ", "To assemble the vol-au-vents preheat the oven to 200C/400F/Gas 6.   Put the pastry squares onto a baking tray, spoon in the fillings and warm in the oven for 8-10 minutes or until the filling is bubbling.  Serve warm or cold."]}, {"isVegetarian": false, "title": "Passion fruit and chocolate tart", "url": "www_bbc_co_uk_food_recipes_passion_fruit_and_76131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["270g/9¾oz plain flour, plus extra for dusting", "30g/1oz cocoa powder", "30g/1oz ground almonds", "65g/2½oz icing sugar", "170g/6oz unsalted butter, cubed", "1 medium free-range egg", "1 free-range egg white, for egg wash", "40g/1½oz ground almonds", "60g/2¼oz icing sugar", "1 large free-range egg white", "1 tbsp caster sugar", "orange or yellow gel or paste food colouring", "125ml/4fl oz double cream", "4 tbsp sieved passion fruit ", "2 free-range egg yolks", "1 large free-range egg", "55g/2oz caster sugar", "200g/7oz milk chocolate drops ", "50g/1¾oz dark chocolate drops ", "50g/1¾oz unsalted butter", "150g/5½oz mini white marshmallows", "200ml/7fl oz double cream", "100g/3½oz caster sugar", "3 large passion fruits, seeds scooped out", "3 gelatine leaves, soaked in cold water for 10 minutes", "50g/1¾oz butter", "125g/4½oz icing sugar", "1 tbsp sieved passion fruit", "50ml/2fl oz double cream ", "200g/7oz dark chocolate drops", "50ml/2fl oz sieved passion fruit ", "small yellow and purple edible pansies (optional)"], "serves": "Makes 1 large tart", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put all the ingredients, except the egg white, in a food processor and briefly blitz to combine. Add a few drops of water and pulse to bring the dough together. Cover with cling film and chill for 20 minutes. ", "To make the macarons, blitz the ground almonds and icing sugar to a fine powder using a food processor. In a separate bowl, whisk the egg white until stiff peaks form when the whisk is removed. Add the caster sugar and whisk until glossy. Add a drop of the food colouring and stir through. Fold the powder mixture into the egg whites. Transfer to a piping bag fitted with a plain nozzle.", "Line a baking tray with non-stick baking paper. Pipe small rounds of the macaron mixture about the size of a 10p coin then set aside until they form a skin. Preheat the oven to 160C/140C Fan/Gas 3.", "Bake the macarons for 12-15 minutes, or until they are no longer sticky to the touch.  Place the macarons on wire racks to cool. ", "Roll out the chilled pastry on a lightly floured work surface until it is about 4mm thick. Line a 23cm/9in tart tin with the pastry. Chill for 20 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6.", "For the passion fruit layer, put all the ingredients in a saucepan and whisk gently over a low heat until it thickens. ", "Line the pastry case with baking parchment and fill with baking beans. Bake for 10 minutes, then remove from the oven and reduce the temperature to 180C/160C Fan/Gas 4. Remove the baking beans and brush the pastry with the egg white. ", "Pour in the passion fruit layer and return to the oven for 10 minutes, or until set. Allow to cool slightly then place in the fridge to chill. ", "For the chocolate mousse layer, melt the chocolate drops, butter and marshmallows together until combined. Leave to cool. ", "Whip the cream until stiff peaks form when the whisk is removed. Fold in the chocolate mixture then whisk it in the bowl of a freestanding mixer for approximately 10 minutes, or until very pale in colour and fluffy. Pour on top of the passion fruit layer, smooth the surface and chill again. ", "To make the jelly, combine the sugar and passion fruit in a pan with 100ml/3½fl oz water. Bring to the boil then squeeze any excess water from the gelatin and add to the pan.  When the gelatin is dissolved, pour the mixture into a 23cm/9in sandwich tin lined with cling film. Chill until set. ", "To make the buttercream for the macarons mix all the ingredients together until smooth. Transfer to a piping bag fitted with a 1cm/½in plain nozzle. Use the buttercream to sandwich the macarons together.", "For the passion fruit ganache, heat the cream in a pan then add the chocolate drops. When the chocolate is melted, stir in the passion fruit, leave to cool slightly then smooth on top of the chocolate mousse and chill in the fridge until set. ", "To assemble the tart, cut the jelly into cubes. Decorate the top of the tart with the macarons, some squares of jelly and pansies. "]}, {"isVegetarian": false, "title": "Passion fruit cream with coconut and cherry biscotti", "url": "www_bbc_co_uk_food_recipes_passion_fruit_cream_with_05122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint double cream", "250g/9oz caster sugar", "1 lime, juice only", "150ml/5fl oz passion fruit pulp, passed through a fine sieve", "2 gelatine leaves, soaked in cold water", "300g/10½oz plain flour, plus extra for dusting", "250g/9oz caster sugar", "100g/3½oz shelled pistachios", "60g/2¼oz fresh coconut, grated", "50g/2oz natural glacé cherries, roughly chopped", "1 lemon, zest and juice", "1¼ tsp baking powder", "pinch salt", "3 free-range eggs"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the passion fruit cream, bring the double cream and 150g/5oz of the sugar gently to the boil in a large saucepan, then remove from the heat. Whisk in the lime juice and half of the sieved passion fruit pulp.", "Pour the cream mixture into four large Martini glasses (do not fill to the top) and chill in the fridge for at least two hours, or until set.", "Meanwhile, drain the gelatine leaves and shake dry. Bring 100ml/3½fl oz of water and the remaining sugar to the boil in a large saucepan. Add the gelatine leaves and whisk until completely dissolved. ", "Add the remaining sieved passion fruit pulp to the sugar syrup mixture, then set aside to cool.", "When the gelatine mixture has cooled and the cream has set, pour one-quarter of the gelatine mixture on top of each portion of set cream to form a thin layer about 0.5cm/¼in thick. Return to the fridge for another hour, or until set.", "Meanwhile, for the biscotti, preheat the oven to 180C/350F/Gas 4. Line a baking tray with baking parchment.", "Place all of the biscotti ingredients into a large bowl and stir until the mixture comes together as a soft, sticky dough.", "Divide the dough in half and roll each portion out into a sausage shape on a lightly floured work surface. ", "Place the pieces of dough onto the prepared baking tray and bake for 20-30 minutes, or until golden-brown. Remove from the oven and set aside for 10 minutes to cool and firm up.", "Using a serrated knife, slice 1cm/½in-thick discs from the pieces of dough, slicing them at an angle. Lay the discs onto the same baking tray (use an extra baking tray if necessary). Return the biscotti to the oven and cook for 6-8 minutes, then turn the slices over and cook for a further 10-15 minutes, or until crisp and pale golden-brown on both sides. Remove from the oven and transfer to wire racks to cool. ", "Serve the passion fruit creams with the biscotti alongside."]}, {"isVegetarian": false, "title": "Passion fruit delice with tuiles", "url": "www_bbc_co_uk_food_recipes_passion_fruit_delice_69401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz caster sugar", "110g/4fl oz water", "10g/½oz glucose syrup", "175g/6oz caster sugar", "5 tbsp water", "3 free-range egg whites", "300ml/10fl oz passion fruit purée", "100ml/3½fl oz sugar syrup (see above)", "4½ gelatine leaves, soaked in cold water for 15 minutes, drained, squeezed dry", "½ vanilla pod", "3 free-range egg yolks", "25g/1oz caster sugar", "25cm/10in ready-made sponge flan case", "20ml/¾fl oz passion fruit liqueur", "400ml/14fl oz double cream, whipped until soft peaks form when the whisk is removed", "100g/3½oz unsalted butter", "100g/3½oz icing sugar", "1 tbsp clear honey", "3 free-range egg whites", "100g/3½oz plain flour", "50ml/2fl oz sugar syrup (see above)", "50ml/2fl oz passion fruit purée", "2 gelatine leaves, soaked in cold water for 15 minutes, drained", "4 passion fruit", "12g/½oz powdered milk"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the sugar syrup, place all the ingredients into a pan and slowly bring to the boil, stirring occasionally with a wooden spoon. ", "Boil for about 2-3 minutes, skimming the surface if necessary. Pass the syrup through a fine sieve and leave until completely cold before using. ", "For the Italian meringue, place the sugar and water into a pan and slowly bring to the boil until the syrup reaches 110C/230F on a sugar thermometer.", "At this stage, whisk the egg whites in the bowl of an electric mixer until firm peaks form when the whisk is removed.", "As soon as the sugar reaches 121C/250F, remove the pan from the heat. ", "Immediately resume whisking the egg whites - with the beater at its lowest speed, pour in the melted sugar, in a thin, steady stream. CAUTION: Ensure the syrup is clear of the beaters, as it could be splashed on your hands. Continue beating for about five minutes, until the meringue is tepid. ", "For the passionfruit delice, blend the passion fruit pulp and the sugar syrup in a food processor until smooth. Strain the mixture through a fine sieve.", "Reserve four tablespoons of the passion fruit purée and place the rest into a pan. Add the milk powder and vanilla pod and bring to the boil. ", "Whisk the egg yolks and sugar in a bowl until the mixture forms a ribbon when the whisk is removed. ", "Pour half of the passion fruit mixture onto the egg mixture, whisking continuously, then pour this custard mixture back into the pan. ", "Heat gently, stirring continuously with a spatula, until the custard is thick enough to coat the spatula. Do not allow it to boil.", "Remove the pan from the heat and stir in the drained gelatine leaves.  Set aside to cool slightly.", "Discard the vanilla pod, and then pass the custard through a conical sieve into a bowl and leave to cool, stirring occasionally to prevent a skin forming. ", "For the base of the delice, place the sponge flan base onto a board or baking tray. ", "Mix together 50ml/2fl oz of the cold sugar syrup and the reserved passion fruit purée and brush this mixture over the sponge. ", "Place a 25cm/10in flan ring (6cm/2½in deep) onto the sponge and press down to cut out a circle, leaving the sponge as the base of the flan ring.", "When the custard is lukewarm, gently fold in half of the Italian meringue (the remaining meringue can be used in another recipe). Stir in the passion fruit liqueur, and then fold in the whipped double cream. (You must now assemble the dessert immediately, before the gelatine causes the mixture to set.)", "Fill the flan ring with the passion fruit custard mixture, leaving a small gap at the top, and carefully smooth the surface with a palette knife. Transfer to the freezer and chill for several hours.", "Preheat the oven to 200C/400F/Gas 6.", "For the tuiles, beat the butter, icing sugar and honey in a bowl until smooth.", "Gradually beat in the egg whites, one at a time, until well combined. Then carefully fold in the flour using a metal spoon. ", "Take a piece of silicone or plastic and cut out long thin leaf shapes to create a stencil. Line a baking tray with baking parchment then place the stencil onto the tray. Using a palette knife, spread a thin layer of the tuile mixture into the cut-out part of the stencil. Carefully remove the template and repeat with the remaining mixture.", "Place the tray into the oven and bake for 3-4 minutes, or until pale golden-brown.", "For the glaze, place the sugar syrup and the passion fruit pulp into a pan and heat gently, then remove from the heat, stir in the drained gelatine and set aside to cool. Once cool, remove the delice from the freezer and spread the glaze over the top of the passion fruit filling. Transfer to the fridge to chill again before serving. ", "To serve, remove the flan ring by heating the outside of the ring with a blowtorch for a few seconds, then slide the ring upwards, rotating it slightly. Spoon the remaining passion fruit seeds into the centre of the delice. Place the tuiles upright around the edge of the delice to form a ring. Cut into slices to serve."]}]