[{"ingredients": ["3 galletas digestivas", "20 g / oz de mantequilla, derretida", "12-16 frambuesas frescas, más extra para decorar", "125g / 4½oz de queso crema suave", "1 huevo de gallinas camperas, golpeado", "½ cucharadita de extracto de vainilla", "30 g / 1 oz de azúcar en polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los bizcochos en una bolsa de comida y golpee suavemente con un rodillo hasta que se asemejen a pan rallado.", "Mezcle los bizcochos triturados y la mantequilla derretida hasta que estén bien combinados.", "Divida la mezcla en partes iguales entre cuatro moldes, presionando cada porción hacia abajo en una capa uniforme en la base con las yemas de los dedos.", "Divida las frambuesas por igual entre los moldes, colocándolos sobre la base de la galleta.", "Batir el queso crema, el huevo batido, el extracto de vainilla y el azúcar hasta que estén suaves y bien combinados.", "Con una cuchara, coloque la mezcla de queso crema en los moldes y alise la parte superior de cada uno con una espátula. Transfiera los moldes a una bandeja para hornear.", "Hornee las tartas de queso en el horno durante 18-20 minutos, o hasta que las partes superiores estén doradas claras y la mezcla de queso esté colocada en el medio, con un leve bamboleo.", "Para servir, coloque los moldes en los platos de postre y decore con frambuesas frescas."], "url": "www_bbc_co_uk_food_recipes_hide-and-seek_cheesecake_00243", "title": "Tarta de queso escondida", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 x 125 g / 4 oz de filetes de salmón, con la piel restante", "2 cucharadas colmadas de salsa hoisin (de un frasco o botella)", "150g / 5½oz de tomates cherry, cortados a la mitad", "Fideos de huevo medios 140g / 5oz", "Brócoli de tallo largo 200g / 7oz, recortado", "pimienta negra recién molida", "salsa de soja oscura, para servir (opcional)"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7 y forre un plato pequeño y poco resistente al horno con papel de cocina.", "Coloque los filetes de salmón en el plato, con la piel hacia abajo, y cepille generosamente con la salsa hoisin. Asegúrese de que los filetes estén separados por lo menos 5 cm / 2 pulgadas el uno del otro. Dispersa los tomates cherry a su alrededor. Cocine por 15 minutos, o hasta que el salmón esté bien cocido.", "Mientras tanto, prepara los fideos. Llene a la mitad una olla con agua y deje que hierva. Agregue los fideos, vuelva a hervir y cocine durante 1 minuto, revolviendo para separar los hilos. Agregue el brócoli y cocínelo por 3 minutos más, revolviendo ocasionalmente.", "Divida los fideos y el brócoli entre cuatro platos calentados. Cubra con los filetes de salmón y esparza los tomates cherry. Sazonar con pimienta y servir espolvoreado con un poco de salsa de soya, si se usa."], "url": "www_bbc_co_uk_food_recipes_hoisin_salmon_with_44468", "title": "Salmón Hoisin con brócoli y fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hoisin_salmon_with_44468_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas, golpeados", "1 cucharada de aceite de sésamo", "1 cucharadita de azúcar de palma", "2 cucharaditas de galanga, cortadas en tiras", "1 cucharada de raíz de jengibre, cortado en tiras", "3 cucharaditas de semillas de sésamo", "1 cucharada de salsa de pescado", "1 cucharadita de vino de arroz o sake", "1 cucharadita de pimienta negra recién molida", "Filete de res de 500 g / 1 libra y 2 onzas, finamente cortado a lo largo del grano", "aceite de girasol o de maní, para freír", "harina de maíz, para recubrimiento"], "method": ["Mezcle todos los ingredientes del adobo en un tazón y agregue la carne en rodajas. Marinar durante el mayor tiempo posible o de la noche a la mañana si es posible.", "Para la carne de res, caliente el aceite en una sartén profunda de fondo grueso. Está listo cuando una miga de pan que se deja caer chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja la carne en la harina de maíz, luego agregue al aceite y fría hasta que esté ligeramente dorado. No se sienta tentado a poner mucha carne de res en el aceite a la vez, sino cocine en tandas. Retire con una espumadera y escurra sobre la toalla de cocina. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hoiancrispybeef_81504", "title": "Hoi An carne crujiente", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3kg / 4lb 4oz - 6lb 6oz fácil-talle la pierna de jamón cocida", "15-20 anís estrellado entero, para decorar", "125ml / 4½fl oz salsa hoisin", "125ml / 4½fl oz de salsa de ciruela", "60ml / 2½fl oz vino de arroz chino", "60ml / 2½fl oz de salsa de soja", "60g / 2½oz de azúcar morena suave", "1 cucharadita de polvo chino de cinco especias", "Papas cerosas 750g / 1lb 10oz (como kipfler), peladas y en rodajas", "1 cucharadita de sal marina", "75ml / 3fl oz de aceite de oliva virgen extra", "125ml / 4½fl oz de jugo de limón", "1 cucharada de zumaque (disponible en tiendas de comestibles del Medio Oriente)", "sal y pimienta negra recién molida", "1 lima, solo jugo", "1 pimiento verde pequeño, sin semillas, finamente picado", "2 chiles rojos grandes, sin semillas, finamente picados", "1 manojo pequeño de menta fresca, toscamente picada", "1 gran manojo fresco de hojas de perejil de flatleaf", "6 cebollas de primavera, finamente rebanadas"], "method": ["Precaliente el horno a 180C / 355F / Gas 4.", "Con un cuchillo pequeño y afilado, corte la corteza alrededor del mango del jamón. Levante con cuidado la corteza de la grasa en una sola pieza, pasando los dedos a través de donde la corteza y la grasa se unen para alejarse. Reserve la cáscara y úsela para cubrir el jamón cortado cuando la guarde.", "Anota la grasa blanca en un patrón de diamante y presiona el anís estrellado en el centro de cada segundo o tercer diamante marcado.", "Coloque el jamón en una rejilla sobre una bandeja de asar, luego vierta una pequeña cantidad de agua en la base de la bandeja de asar para evitar que se queme el glaseado.", "Coloque los ingredientes restantes del jamón en una cacerola a fuego lento, revolviendo hasta que el azúcar se haya disuelto por completo.", "Retire la mezcla de glaseado del fuego y vierta cuidadosamente sobre el jamón, asegurándose de que toda la grasa expuesta esté cubierta.", "Transfiera el jamón al horno para hornear durante 30-40 minutos, rociándolo de vez en cuando, hasta que el jamón esté dorado por completo.", "Retire el jamón del horno y colóquelo en un plato grande listo para tallar.", "Para la ensalada de patata de limón, ponga a hervir una olla grande de agua y luego agregue las papas y la sal. Reduzca el fuego y cocine a fuego lento durante aproximadamente 8-10 minutos, hasta que las papas estén tiernas cuando se perforan con un cuchillo. Recuerde cocinar un poco las papas un poco, porque continuarán cocinando a su propio calor y vapor cuando las saque del agua.", "Coloque el aceite de oliva, el zumo de limón y el zumaque en un tazón, mezcle para combinar y sazone, al gusto, con sal y pimienta negra recién molida.", "Vierta la mitad del aderezo de zumaque sobre las papas calientes y revuelva muy suavemente. Deje que se enfríe, luego agregue el pimiento, el chile, la menta, el perejil, la cebolla tierna y el aderezo restante y revuelva suavemente para combinar.", "Para servir, coloque varias rebanadas de jamón en cada plato con una cucharada grande de ensalada de papa al lado."], "url": "www_bbc_co_uk_food_recipes_hoisinandplumglazedh_84880", "title": "Hoisin y jamón glaseado con ensalada de patata de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de vinagre de vino blanco", "6 granos de pimienta", "1 hoja de laurel seca", "2 huevos, solo yemas", "125g / 4oz de mantequilla", "jugo de limón, sal y pimienta al gusto"], "method": ["Ponga el vinagre en una olla pequeña con los granos de pimienta y laurel. Reduzca el vinagre a fuego alto hasta que quede solo 1 cucharada. Cuele los granos de pimienta y la hoja de laurel de esta reducción.", "Coloque las yemas de huevo en un procesador de alimentos con la reducción de vinagre.", "Suavemente derrita la mantequilla para que los sólidos de la mantequilla caigan al fondo de la cacerola.", "Encienda el procesador de alimentos y vierta lentamente la mantequilla sobre las yemas de huevo con el motor todavía en funcionamiento. La salsa comenzará a espesar. Cuando solo queden sólidos de mantequilla, deténgase.", "Si la salsa es demasiado espesa, agregue un poco de agua caliente.", "Sazone al gusto con sal y pimienta y un poco de jugo de limón."], "url": "www_bbc_co_uk_food_recipes_hollandaisesauce_1309", "title": "Salsa holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hollandaisesauce_1309_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de oliva, para asar", "6-8 papas grandes para hornear, peladas, cortadas en cubos de 2.5cm / 1in", "sal y pimienta negra recién molida", "4 dientes de ajo, aplastados", "2 x 400 g / 13 onzas de latas de tomates picados", "2 chiles rojos pequeños, sin semillas, picados", "1 cucharadita de pimentón", "1 cucharada de perejil fresco picado", "Filetes hoki de 10 x 150 g / 5oz", "1 limón, solo jugo", "Queso cheddar maduro de 400 g / 13 oz o queso manchego rallado", "25g / 1oz de mostaza Dijon", "2 huevos de gallinas camperas, golpeados", "sal y pimienta recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el aceite en una lata de asar grande y profunda, hasta que el aceite esté a 2 cm / 1 pulgadas de profundidad en la lata y colóquelo en el horno hasta que esté humeando.", "Con cuidado agregue las papas al aceite caliente y gírelas en el aceite para cubrirlas. Sazonar con sal y pimienta negra recién molida y colocar en el horno durante diez minutos.", "Con cuidado agregue el ajo triturado, los tomates, los chiles y el pimentón a las papas y revuelva para combinar. Regrese al horno para asar durante otros 30 minutos, o hasta que las papas estén crujientes por fuera, pero suaves por dentro.", "Sazonar, al gusto, con sal y pimienta negra recién molida, agregar más aceite de oliva si la mezcla de papa se ha secado y espolvorear con el perejil.", "Para el hoki, engrase ligeramente una bandeja de asar limpia y agregue los filetes hoki. Sazonar ligeramente con sal y pimienta negra recién molida y exprimir el jugo de limón en la parte superior.", "Coloque el queso, la mostaza y el huevo batido en un tazón y revuelva bien para combinar.", "Divida la mezcla de queso en diez porciones y moldee cada porción para que quepa en la parte superior de una pieza de hoki, luego presione sobre cada filete de pescado. (No se preocupe si se ve un poco descuidado: el huevo pondrá el relleno cuando se cocina).", "Transfiera el pescado al horno y tueste durante 10-15 minutos, o hasta que el queso se dore y el pescado esté completamente cocido.", "Para servir, presione una cucharada de patatas bravas en un plato, luego coloque un filete hoki en la parte superior."], "url": "www_bbc_co_uk_food_recipes_hokiwithpatatasbrava_84674", "title": "Hoki con patatas bravas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla sin sal, más extra para engrasar", "1 cebolla grande, finamente rebanada", "sal y pimienta negra", "800g / 1lb de papas cerosas de 12 onzas (como Maris Peer), peladas y en rodajas finas", "500ml / 18fl oz de leche entera (suficiente para cubrir las papas para cocinar)", "4 hojas grandes de pasta filo (aproximadamente 25x40cm / 10x16 en cada uno)", "Salmón ahumado en caliente deshuesado y copos 400 g / 14oz", "100ml / 3½ fl oz crema doble"], "method": ["Precalienta el horno a 200 ° C / 400 ° F / Gas 6 y coloca una bandeja para hornear con labios (ya que la tarta puede derramar un poco de mantequilla) en el estante del medio para calentarla. Use un poco de mantequilla para engrasar una lata para pasteles con forma de resorte de 20 cm / 8 pulgadas (aproximadamente 7 cm / 2 pulgadas de profundidad).", "Caliente 25 g / 1 oz de la mantequilla en una sartén grande. Agregue la cebolla y fría a fuego lento durante unos 20 minutos, revolviendo a menudo, hasta que esté muy suave y dorado. Sazonar con un poco de sal y pimienta y dejar de lado.", "Coloque las papas en rodajas en una cacerola grande y cúbralas con la leche. Llevar a ebullición, bajar el fuego y cocinar a fuego lento durante unos cinco minutos, o hasta que las papas estén tiernas pero no cocidas.", "Escurra las papas, reservando 100 ml / 3½ fl oz de la leche.", "Derretir la mantequilla restante. Coloque una hoja de hojaldre en el molde de la torta, dejando el exceso colgando sobre el costado. Cepille ligeramente con la mantequilla derretida, luego gire la lata ligeramente y repita con el resto de las hojas.", "Coloque un tercio de las papas en la lata revestida de pasta y sazone con un poco de sal y pimienta. Siga con la mitad de las cebollas y luego la mitad del pescado copos. Repita estas capas, luego termine con el tercio final de papa.", "Mezcle la leche reservada con la crema y vierta sobre el relleno.", "Doble la pasta que sobresale por el relleno para encerrarla, y cepille la parte superior del pastel con mantequilla derretida. Coloque el pastel en la bandeja para hornear caliente en el horno y hornee durante 30-35 minutos, o hasta que el filo esté crujiente y dorado.", "Deje reposar la tarta durante 30 minutos más o menos (se recomienda que se caliente o temperatura ambiente) y luego transfiérala a un plato hondo antes de cortarla."], "url": "www_bbc_co_uk_food_recipes_hollywoods_temptation_10953", "title": "La tentación de Hollywood", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hollywoods_temptation_10953_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "200g / 7oz de sal marina", "1 trucha grande, limpia, fileteada, deshuesada (pídale a su pescadero que haga esto por usted)", "1 cucharada de vinagre balsámico blanco", "3 cucharadas de aceite de oliva virgen extra", "2 chalotes, pelados, cortados en anillos", "200g / 7oz de remolacha cocida, más o menos picada", "Feta de 200 g / 7 oz, más o menos picada", "100g / 3½oz de berro", "sal y pimienta negra recién molida"], "method": ["Mezcle el azúcar y la sal del mar en un tazón. Divida la mezcla en cuatro porciones iguales.", "Coloque una gran pieza de película adhesiva sobre una superficie de trabajo limpia. Coloque otra pieza en la parte superior. Espolvorea una porción de la mezcla de sal y azúcar en una línea en el centro de la película adhesiva. Coloque uno de los filetes de trucha, con la piel hacia abajo, en la línea de azúcar y sal.", "Espolvorea otra porción de la mezcla de sal y azúcar por todo el filete, luego envuelve la película adhesiva.", "Repita el proceso con el filete de trucha restante. Enfríe el pescado en la nevera durante 12-24 horas.", "Cuando la trucha se haya curado, retire la película adhesiva y elimine la mezcla de sal y azúcar. Enjuague bien el pescado con agua corriente fría, luego seque con papel de cocina.", "Coloque un puñado generoso de virutas de roble en un ahumador. Encienda las astillas de madera y rocíe con un poco de agua.", "Cuando las astillas de madera estén humedecidas, coloque los filetes de trucha, con la piel hacia abajo, en el centro de la parrilla. Cúbralo con la tapa y fume durante 1-1½ horas, revisando las virutas regularmente para asegurarse de que no estén quemando. (PRECAUCIÓN: Fumar alimentos genera una gran cantidad de humo. Cocine en un lugar bien ventilado y abra las ventanas).", "Cuando la trucha haya fumado, retírela del fumador y déjela enfriar.", "Mientras tanto, mezcle el vinagre balsámico y el aceite de oliva en un bol. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque los anillos de chalote, remolacha y queso feta en un plato grande para servir. Escama la trucha ahumada sobre la parte superior. Adorne con hojas de berros, luego rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_home-smoked_trout_with_19243", "title": "Trucha ahumada en casa con ensalada de queso feta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de azúcar moreno", "pizca de sal", "600g / 1lb trozo de bacalao de 5 oz, con la piel puesta, deshuesada", "1 corta longitud de rama de enebro", "½ cabeza de lechuga frisée, use solo las partes verdes claras y blancas, picadas", "1 manzana, en rodajas", "½ hinojo, en rodajas", "2 cucharadas de eneldo escogido", "3 cucharadas de crema espesa", "sal al gusto", "400g / 14oz de patatas nuevas, cortadas a la mitad", "½ pepino", "2 cucharadas de alcaparras", "3 cucharadas de crema agria", "Mayonesa 100 g / 3½ oz", "1 cucharada de vinagre de vino tinto", "100g / 3½ oz de azúcar", "100ml / 3½fl oz de vinagre", "1 cucharada de semillas de mostaza", "½ cucharada de semillas de alcaravea", "½ cucharada de semillas de eneldo", "150ml / 5fl oz de aceite de un tarro de anchoas"], "method": ["Mezcle el azúcar y la sal juntas para la mezcla de curado. Frote el bacalao con la mezcla de curado en ambos lados. Deja a temperatura ambiente durante 30 minutos. Coloque en la nevera durante al menos 8 horas, preferiblemente durante la noche.", "Pat el bacalao seco con papel de cocina. Pon el bacalao en una bandeja para hornear y coloca la rama de enebro en el lado opuesto de la lata. Con cuidado, prende fuego a la rama de enebro. Cubra con papel de aluminio y fume durante 10 minutos. Si quieres un sabor más ahumado, deja de fumar por más tiempo.", "Retire el bacalao de la lata de tueste y corte cuidadosamente en rebanadas de 5 mm / ¼. Ligeramente dore las rebanadas con un soplete de chef.", "Para la ensalada de manzana y frisée, mezcle todos los ingredientes de la ensalada en la crema y sazone con sal.", "Para la ensalada de papa, ponga a hervir una olla de agua con sal, agregue las papas y cocínelas hasta que estén suaves. Use un pelador para crear hebras delgadas desde el exterior del pepino, reserve esto para hacer pepinillos encurtidos. Picar finamente la carne restante del pepino para la ensalada de papa", "Escurra las papas y déjelas enfriar. Mezcle con los otros ingredientes de la ensalada de papa.", "Para la salsa de salsa de mostaza y anchoa, ponga el azúcar, el vinagre, las especias y 100 ml / 3½ fl oz de agua en una olla y llevar a ebullición. Batir para disolver el azúcar. Dejar enfriar y reservar la mitad para el pepino en escabeche. Mezcle la otra mitad con el aceite de anchoa.", "Para el pepinillo encurtido, mezcle los filamentos de pepino reservados con ½ cucharada de sal y déjelo a un lado durante 5 minutos. Lave el pepino para eliminar la sal, luego drene. Mezcle con el líquido decapante.", "Divida las rebanadas de bacalao entre 4 platos para servir y sirva con las ensaladas y la salsa para mojar."], "url": "www_bbc_co_uk_food_recipes_home_smoked_cod_with_38574", "title": "Bacalao ahumado en casa con ensalada y salsa de anchoa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de salmón fresco", "5 cucharadas de sal marina", "150ml / ¼ pinta de aceite de oliva", "2 limones, jugo y corteza finamente rallada", "2 cucharadas de eneldo picado", "1 cucharada de azúcar", "3 cucharadas de jerez", "pimienta negra"], "method": ["Coloque el salmón en un recipiente y cubra bien con la sal marina. Cubra el recipiente con film transparente y refrigere durante la noche.", "Al día siguiente, enjuague el salmón. Debería sentirse un poco duro y correoso. Coloque en un tazón limpio.", "Para el adobo, mezcle el aceite de oliva, el jugo de limón, la cáscara, el eneldo, el azúcar, el jerez y la pimienta. Verter sobre el salmón y dejar, cubierto, en la nevera durante la noche.", "Esculpe el salmón finamente y sirva con crujientes hojas de ensalada, tortas de avena y mayonesa."], "url": "www_bbc_co_uk_food_recipes_homecuredsalmon_66103", "title": "Salmón curado en casa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mantequilla 400g / 14oz, ablandada", "Azúcar 400 g / 14 oz", "2 cucharadas de miel", "2 limones, solo cáscara", "7 huevos de gallinas camperas (preferiblemente orgánicos)", "Harina de auto aumento de 400g / 14oz, tamizada", "1 kg / 2lb de mantequilla de 4oz, ablandada", "1.5kg / 3lb 5oz de azúcar glas, tamizado", "jugo de limon", "1 cucharada de miel, o al gusto", "Coloración amarillo dorado - en lugar de limón", "Pequeñas cantidades de glaseado de fondant listo para rodar en amarillo, negro, rojo y blanco", "Almendras en copos de 25g / 1oz", "250g / 9oz de glaseado de fondant verde listo para enrollar"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme una lata de pastel de 15 cm / 6 pulgadas y una lata de pastel de 18 cm / 7 pulgadas. Engrase un recipiente de vidrio a prueba de horno de 15 cm / 6 pulgadas o similar. Recorta un pequeño círculo de papel de hornear para que quepa en el fondo del tazón. Harina los lados.", "Bata la mantequilla y el azúcar hasta que esté muy pálida, ligera y esponjosa. Batir la ralladura de limón y la miel.", "Agregue los huevos lentamente y un poco de harina si la masa parece que puede cuajarse. Doble la harina restante con una cuchara grande de metal.", "Divida la mezcla entre las latas de la torta y el recipiente a prueba de horno.", "Hornee durante 40-50 minutos, revisando las tortas más pequeñas después de 30 minutos. Los pasteles se hacen cuando un pincho insertado en el centro del pastel sale limpio.", "Retire del horno y deje enfriar en las latas durante 10 minutos antes de colocarlo en una rejilla para que se enfríe completamente. Retire el papel de hornear con cuidado.", "Para la decoración, bata la mantequilla ablandada en un mezclador independiente durante 5-8 minutos hasta que quede muy ligera y suave. Agregue el azúcar glas gradualmente, batiendo todo el tiempo, hasta que todo esté incorporado. Afloje esta mezcla de glaseado de crema de mantequilla con el jugo de limón y saboréelo con miel, al gusto. Batir el colorante amarillo dorado en el glaseado de crema de mantequilla para lograr el tono deseado.", "Espolvorea la superficie de trabajo con azúcar glas. Amasar el glaseado fondant amarillo hasta que esté suave y flexible, luego enrolle pequeñas cantidades del fondant amarillo en bolas de rugby para formar el cuerpo de las abejas. Amasar el glaseado negro hasta que esté suave y extender sobre la superficie de trabajo espolvoreada en cuerdas muy finas para crear rayas. Cepille las abejas muy ligeramente con agua y péguelas sobre las rayas. Haz bolitas de color rojo para las narices y pequeñas bolas de color blanco con puntos negros para los ojos. Stick estos con muy poca agua. Empuja dos rebanadas de almendras en cada abeja para obtener alas. Reservar para secar", "Estirar el glaseado de fondant blanco y utilizar un cortador de margaritas para cortar flores blancas. Corta pequeños círculos del fondant amarillo para los centros de las margaritas. Reservar para secar", "Estirar el glaseado de fondant verde para cubrir la tarta.", "Coloque la torta más grande en el tablero de torta forrado verde. Extienda una capa de crema de mantequilla en la parte superior, luego cubra con la torta más pequeña. Extienda un poco más de crema de mantequilla en la parte superior y luego termine con la tarta de tazón redondo.", "Extiende una fina capa de crema de mantequilla por todo el exterior del pastel. Guarde para endurecer (preferiblemente en la nevera) durante 10-15 minutos.", "Transfiera la crema de mantequilla restante a una manga pastelera equipada con una boquilla plana de 2 cm / in. Pipe la formación de hielo alrededor de la torta en círculos concéntricos para crear una forma de colmena. En la parte superior, pipe una espiral y alise con una espátula.", "Coloque unas pocas abejas en brochetas o palitos de cóctel y péguelas en la torta. Adjunte otras abejas directamente a la colmena. Coloque las margaritas en el pastel y en el tablero verde."], "url": "www_bbc_co_uk_food_recipes_hive_cake_03837", "title": "Colmena, pastel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 14-16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hive_cake_03837_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "700 g / 1lb 9 oz de carne picada de buena calidad", "2 chiles rojos, finamente picados", "2 cucharadas de perejil de flatleaf, aproximadamente picado", "sal y pimienta negra recién molida", "4 rebanadas cortas y gruesas de queso Monterey Jack (o queso cheddar fuerte)", "4 panecillos de hamburguesa, divididos por la mitad", "400ml / 14fl oz de aceite vegetal, para freír", "2 papas para hornear grandes, cortadas en tiras largas de 5cm / 2½ pulgadas", "2 maíz dulce, en la mazorca", "50g / 2oz de mantequilla", "2 chiles rojos, finamente picados", "½ lima, solo jugo", "2 lechugas Little Gem, hojas separadas", "2 tomates, en rodajas gruesas"], "method": ["Para la hamburguesa, caliente una sartén hasta que esté caliente, agregue el aceite de oliva y la cebolla y cocine hasta que la cebolla esté blanda, pero no coloreada. Retirar del fuego y dejar enfriar ligeramente.", "Coloque la carne picada, los chiles, el perejil plano, la sal y la pimienta negra recién molida y la cebolla cocida enfriada en un tazón grande y mezcle bien.", "Divida la mezcla en cuatro porciones iguales. Envuelva cada porción de la mezcla de hamburguesas alrededor de una pieza de queso y molde para formar una hamburguesa. Tenga cuidado de no exponer el queso.", "Caliente una sartén hasta que esté caliente, agregue las hamburguesas y cocine por 4-6 minutos en cada lado, o hasta que la carne esté recién hecha. Retire de la sartén y deje reposar en un lugar cálido durante 2-3 minutos.", "Mientras tanto, coloque los bollos de hamburguesa cortados de lado hacia abajo en la sartén de la plancha y tueste durante un minuto, hasta que estén calientes.", "Para las papas fritas finas, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue las tiras de patata al aceite en tandas y fríe durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para el condimento de chile dulce, traiga una sartén grande de agua con sal a ebullición. Agregue el maíz en las mazorcas y hiérvalas durante 7-8 minutos, o hasta que estén tiernas.", "Escurra el maíz en las mazorcas y deje que se enfríe un poco. Una vez que se enfríe lo suficiente como para manejarlo, corte los granos de la mazorca en un tazón.", "Agregue la mantequilla y el chile y mezcle bien hasta que la mantequilla se haya derretido. Espolvorear con jugo de limón y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca la mitad inferior de cada panecillo en un plato. Cubra cada uno con algunas hojas de Little Gem y un par de rodajas de tomate, luego agregue una hamburguesa. Cubra cada hamburguesa con la otra mitad del panecillo.", "Coloque un puñado de papas fritas al costado y termine con una cucharada del condimento de chile dulce."], "url": "www_bbc_co_uk_food_recipes_highlandcheeseburger_89309", "title": "Hamburguesa con queso con papas fritas y salsa de maíz dulce de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "8 salchichas de cerdo de buena calidad", "2 chalotes, finamente picados", "1 cucharadita de hojas de romero fresco tostadas", "2 dientes de ajo, finamente picados", "1 x 400 g de tomate picado", "125ml / 4¼fl oz de caldo de pollo", "1 x 400 g de frijoles flageolet, escurridos y enjuagados", "1 cucharada de perejil fresco de flatleaf", "4-6 rebanadas gruesas de pan de masa fermentada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente una cucharada de aceite en una sartén a prueba de horno a fuego medio. Agregue las salchichas y fría por 2-3 minutos, o hasta que estén doradas por todos lados. Transfiera la sartén al horno y continúe cocinando durante 10-12 minutos, o hasta que esté cocida.", "Mientras tanto, caliente otra cucharada de aceite en una sartén separada a fuego medio. Agregue los chalotes y fría por 2-3 minutos, o hasta que estén blandos. Agregue el romero y el ajo y fría por 1-2 minutos más.", "Agregue los tomates picados y llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Agregue el caldo y los frijoles, deje que la mezcla hierva a fuego lento y cocine durante 3-4 minutos, o hasta que la salsa se haya espesado un poco.", "Agregue el perejil y sazone, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Justo antes de servir, caliente una sartén a fuego medio. Rocíe un poco de la cucharada restante de aceite en cada lado de las rebanadas de pan. Ase el pan durante 1-2 minutos en cada lado, o hasta que aparezcan marcas doradas en ambos lados.", "Para servir, coloque una rebanada de pan tostado en cada plato de servir. Cuchara sobre la mezcla de frijoles y cubra cada uno con una salchicha o dos."], "url": "www_bbc_co_uk_food_recipes_homemade_baked_beans_02438", "title": "Judías cocidas caseras con salchichas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla, finamente picada", "½ diente de ajo, rebanado", "1 cucharada de aceite de oliva extra virgen", "1 tomate, picado", "1 x 400 g de frijoles pintos, escurridos y enjuagados", "½ cucharadita de pimentón ahumado", "sal marina y pimienta negra recién molida", "1 rebanada de masa fermentada, tostada"], "method": ["Freír las cebollas y el ajo en un poco de aceite hasta que estén suaves, agregar el tomate, los frijoles y un chorrito de agua y cocinar por 10 minutos hasta que estén casi secos. Agregue ½ cucharadita de pimentón ahumado y una llovizna de aceite de oliva y sazone con sal y pimienta.", "Vierta los frijoles sobre la tostada y coma de inmediato."], "url": "www_bbc_co_uk_food_recipes_homemade_beans_on_toast_39014", "title": "Frijoles caseros en pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beans_on_toast_39014_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 2 oz de filete de salmón, cortado, piel anotada con un cuchillo afilado, cortado en cuatro filetes de igual tamaño", "Copos de sal de mar de buena calidad de 110g / 4oz", "Sal marina fina de 110g / 4oz", "200 g / 7 oz de azúcar en polvo", "1 cucharadita de semillas de cilantro", "1 cucharadita de pimienta negra", "1 limón, ralladura y jugo", "½ naranja, ralladura y jugo", "200 ml / 7 fl oz de agua", "eneldo pequeño racimo, picado", "2 yemas de huevo de gallinas camperas", "3 claras de huevo de gallinas camperas", "50g / 2oz de mostaza inglesa", "Pasta de wasabi 50 g / 2 oz", "75ml / 3fl oz de vinagre balsámico blanco", "1 cucharada de vinagre de vino de arroz", "2 cucharaditas de azúcar en polvo", "110ml / 4fl oz de aceite de oliva", "Aceite de semilla de uva 110ml / 4fl oz", "sal y pimienta negra recién molida", "200g / 7oz de eneldo, aproximadamente picado", "110ml / 4fl oz de aceite vegetal", "110ml / 4fl oz de aceite de oliva", "2 pepinos, pelados", "4 cucharadas de aceite de oliva", "50 ml / 2 fl oz de agua con gas", "sal y pimienta negra recién molida", "75g / 3oz de papas Charlotte, cocidas, escurridas, cortadas en cubos de 1cm / ½ en cubitos", "4-5 cucharadas de vinagreta de limón lista para usar", "2 focaccia prefabricada de tamaño mediano, cortada en 30 cubos de 1cm x 2.5cm / ½in x 1in", "50 g / 2 oz de azúcar en polvo", "1 limón, ralladura y jugo", "Jengibre en escabeche de 40 g / 1½ oz", "40g / 1½ oz de hinojo, muy finamente en rodajas, a un lado en un recipiente con agua helada", "Huevas de pescado con sabor a wasabi de 10g / ½ oz (disponibles en proveedores japoneses especializados)", "eneldo pequeño racimo, picado", "1 x 20g / ¾oz cusita shiso berro (disponible en proveedores especializados y en línea)", "1 x 20g / ¾oz cest tahoon berro (disponible en proveedores especializados y en línea)"], "method": ["Para el salmón curado, coloque los filetes de salmón en un plato grande y profundo. En un tazón, mezcle todos los ingredientes de salmón curados restantes hasta que estén bien combinados.", "Coloque los filetes de salmón en un plato hondo grande y vierta la mezcla de curación por todas partes.", "Coloque un segundo plato ligeramente más pequeño encima de los filetes de salmón y coloque un objeto pesado, como una bolsa de azúcar, en el segundo plato para aplanar los filetes de salmón.", "Cubra el plato con film transparente, luego transfiera el plato con los filetes de salmón al refrigerador y deje curar durante 1-2 días, convirtiendo los filetes de salmón dos veces al día (aproximadamente ocho horas de diferencia).", "Cuando los filetes de salmón se hayan curado, enjuague el líquido de curado y seque los filetes de salmón con papel de cocina. Tallar los filetes de salmón en rodajas finas, luego enfríelos en la nevera, tapados, hasta que los necesites.", "Para el aderezo de wasabi, mezcle las yemas de huevo, las claras de huevo, la mostaza inglesa, la pasta de wasabi, el vinagre balsámico blanco, el vinagre de vino de arroz y el azúcar impalpable hasta obtener un puré en un procesador de alimentos.", "Con el motor todavía en marcha, agregue gradualmente el aceite de oliva y el aceite de semilla de uva al puré, uno después del otro, en una corriente fina, hasta que la mezcla de aderezo se espese. Sazonar, al gusto, con sal y pimienta negra recién molida, luego dejar de lado.", "Para el aceite de eneldo, mezcle los ingredientes del aceite de eneldo en un procesador de alimentos limpio en un puré muy fino. Dejar de lado.", "Para la ensalada, usando una bola de melón, esculpe 20 bolas de los pepinos pelados.", "Coloque las bolas de pepino en un recipiente y rocíe sobre dos cucharadas de aceite de oliva y toda el agua con gas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cubra el recipiente y el microondas a máxima potencia durante un minuto. Drene el líquido del tazón.", "Agregue los cubos de papa cocidos a las bolas de pepino escurridas, luego vierta un poco de la vinagreta de limón y mezcle bien para cubrir las verduras cocidas.", "Caliente una cucharada de aceite de oliva en una sartén a fuego medio. Agregue los cubos de focaccia y fríalos durante 1-2 minutos en todos los lados, o hasta que se conviertan en croûtons crujientes y dorados.", "Caliente el azúcar en polvo en una sartén no reactiva por separado a fuego medio o bajo. Cuando el azúcar se haya derretido y caramelizado, agregue los croûtons de focaccia y mezcle bien para cubrirlos con el azúcar derretida.", "Agregue la ralladura de limón, el jugo de limón y la cucharada restante de aceite de oliva y revuelva para cubrir los croûtons.", "Para servir, escurra las rodajas de hinojo y seque con papel de cocina. Cepille cuatro platos para servir con el aderezo de wasabi, luego espolvoree el jengibre en escabeche y escurra las rodajas de hinojo y salpique con las huevas de pescado de wasabi. Divida la ensalada por igual entre los platos y cubra con una porción de rodajas de salmón curado. Espolvoree los croûtons, el eneldo picado, el shiso berro y el tahoon berro. Rocíe el aceite de eneldo alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_homecuredsalmonwithp_91466", "title": "Salmón curado en casa con jengibre en vinagre y aderezo de wasabi", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de chorizo ​​para cocinar, cortado en cubitos", "Garbanzos en lata 200g / 7oz, escurridos y enjuagados", "200g / 7oz de tomates picados en lata", "1 cucharada de hojas de tomillo fresco picado", "sal y pimienta negra recién molida", "2 rebanadas de pan tostado", "1 cucharada de hojas de perejil fresco picado"], "method": ["Coloque una cacerola a fuego medio. Cuando la sartén esté caliente, agregue el chorizo ​​y fría por 1-2 minutos, o hasta que comience a crujiente.", "Agregue los garbanzos escurridos y los tomates enlatados, luego agregue el tomillo. Sazonar, al gusto, con sal y pimienta negra recién molida. Cocine a fuego lento durante 4-5 minutos, o hasta que la salsa se haya calentado y espesado a su gusto.", "Para servir, espolvorea la mezcla de garbanzos sobre la tostada y decora con perejil."], "url": "www_bbc_co_uk_food_recipes_homemade_beans_on_toast_46976", "title": "Chorizo ​​en tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beans_on_toast_46976_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175 g / 6 oz de semillas de mostaza amarillas", "175 g / 6 oz de semillas de mostaza negra", "500ml / 18fl oz de cerveza o cerveza", "1 cucharada de sal marina", "pizca de hojuelas de chile molido", "175ml / 6fl oz de vinagre de sidra o vinagre de vino blanco", "6 cucharadas de miel líquida", "1 cucharada de macis molido o nuez moscada"], "method": ["Mezcle las semillas de mostaza y la cerveza juntas en un tazón, cubra y deje de lado durante la noche. (Las semillas de mostaza se ablandarán y absorberán la mayor parte de la cerveza).", "Esteriliza los frascos para la mostaza. Lave con agua muy caliente o en el ciclo caliente de un lavaplatos. Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Coloque las jarras boca abajo en una bandeja para hornear y seque en el horno durante 10 a 15 minutos.", "Agregue los ingredientes restantes, luego mezcle en un procesador de alimentos hasta que esté casi liso (puede que tenga que hacer esto son lotes).", "Vierta la mostaza en los frascos esterilizados; toque suavemente para eliminar todas las burbujas de aire."], "url": "www_bbc_co_uk_food_recipes_homemade_beer_mustard_55981", "title": "Mostaza de cerveza casera", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace 4 tarros de 250 g / 9 oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beer_mustard_55981_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["625g / 1lb 6oz de harina de pan blanco fuerte, más extra para espolvorear", "75 g / 2½ oz de azúcar en polvo", "12g de sal marina fina", "40 g / 1½ oz de levadura fresca", "500 g / 1 lb 2 oz de mantequilla sin sal refrigerada, más extra para servir", "1 huevo de gallinas camperas y 1 yema de huevo, ligeramente batido", "mermelada de frambuesa, para servir"], "method": ["El día antes de que desee hornear los cruasanes, coloque la harina, el azúcar, la sal y la levadura en el cuenco de un mezclador de alimentos con un gancho de masa o un tazón grande. Vierta 350-400ml / 12-14fl oz de agua fría y mezcle hasta que quede como una masa suave.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amase durante unos 8-10 minutos, o hasta que la masa se sienta lisa, elástica y elástica. Vuelva al tazón y déjelo a un lado para descansar.", "Coloque la mantequilla fría entre dos hojas de papel resistente a la grasa y extiéndala en un rectángulo de 30x20 cm / 12x8 pulgadas, de aproximadamente 1 cm / ½ pulgada de grosor. Enfriar en la nevera hasta que sea necesario.", "Voltea la masa nuevamente en una superficie de trabajo ligeramente enharinada. Enróllelo en un rectángulo de 60x30cm / 24x12in.", "Pele el papel resistente a la grasa de la mantequilla y coloque la mantequilla en el centro sobre el rectángulo de repostería.", "Doble un borde de la masa sobre la mantequilla para cubrirlo a medias, luego haga lo mismo con el otro borde de la masa para que la mantequilla esté tapada.", "Dobla el rectángulo por la mitad a lo largo, luego dale un cuarto de vuelta y desplázate de nuevo a un rectángulo que mide 60x30cm / 24x12 pulgadas.", "Repita el proceso de plegado, torneado y laminado, como antes, tres veces más (no despliegue la masa la última vez que la doble y gire). Envuelva la masa en film transparente y deje enfriar en la nevera durante la noche.", "Cuando la masa repose, extiéndala hasta un grosor de 0.5 cm / ¼ in. Corta la masa en dos tiras de 50x20cm / 20x8 pulgadas, luego corta cada tira en triángulos de unos 10cm de ancho en la base.", "Con el punto angosto de uno de los triángulos de repostería mirando hacia atrás, use las puntas de los dedos para estirar los dos puntos del triángulo más cercano a usted hacia los lados para que se inclinen un poco.", "Haga rodar la masa sobre sí misma, curvándola en forma de media luna tradicional, de modo que el punto más alejado del triángulo termine doblado sobre la parte superior del croissant.", "Repita el proceso con los triángulos de repostería restantes para crear unos 20 croissants.", "Coloque los croissants en bandejas para hornear forradas con papel de silicona o pergamino para hornear. Cepíllalos con el huevo batido, luego deja reposar para probar durante 30-45 minutos. (NB: Los croissants se pueden congelar en este punto, si se desea).", "Precaliente el horno a 190C / 170C Ventilador / Gas 5. Hornee los cruasanes durante 20-25 minutos o hasta que estén dorados y dorados. Sirve caliente con mermelada y mantequilla."], "url": "www_bbc_co_uk_food_recipes_homemade_buttery_18294", "title": "Medialunas caseras mantecosas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_buttery_18294_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450ml / 17fl oz de aceite de oliva (no virgen)", "20g / ¾oz de copos de chile rojo seco", "3-4 chiles rojos secos enteros"], "method": ["Calienta suavemente el aceite de oliva en una olla. Agregue los copos de chile y los chiles enteros al aceite y caliéntelos durante 3-4 minutos. Retire del fuego y deje que el aceite se enfríe un poco.", "Cuando el aceite se haya enfriado, cuele cuidadosamente en una botella de vidrio esterilizada y sellable con un embudo. Agregue los chiles secos de la sartén y selle la botella.", "Guarde la botella en el refrigerador y úsela dentro de una semana."], "url": "www_bbc_co_uk_food_recipes_homemade_chilli_oil_54985", "title": "Aceite de chile hecho en casa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 450ml / 17fl oz de aceite de chile", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_chilli_oil_54985_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 2oz de carne de cerdo magra picada", "200 g / 7 oz de grasa de cerdo, en cubitos", "25g / 1oz de sal fina", "1½ cucharada de pimentón ahumado", "3 dientes de ajo, aplastados", "1½ cucharadas de pimienta negra molida", "1½ cucharadas de semillas de hinojo", "25-50ml / 1-2fl oz de vino tinto", "pieles de salchichas naturales (disponibles en carniceros)"], "method": ["Para el chorizo, coloque todos los ingredientes, excepto las pieles de salchicha, en un bol y mezcle hasta que estén bien combinados.", "Presione la carne de salchicha en una máquina de salchichas manual y presione hacia abajo.", "Coloque una piel de salchicha sobre el extremo de la boquilla y gire la manija.", "Gire hasta que las pieles estén todas llenas, luego retire de la boquilla.", "Gire la salchicha a intervalos de 30 cm / 12 in para formar salchichas individuales, luego pellizque con cuidado con un palillo de dientes para liberar las bolsas de aire.", "Cuelgue en un lugar fresco y seco durante al menos un mes, preferiblemente hasta tres meses."], "url": "www_bbc_co_uk_food_recipes_homemade_chorizo_98579", "title": "Chorizo ​​hecho en casa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace 1.2kg / 2Ib 10oz de chorizo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]