[{"ingredients": ["200g / 7oz '00' harina de pasta, más extra para quitar el polvo", "3 huevos de gallinas camperas", "200g / 7oz de col rizada, tallos eliminados", "125g / 4½oz de queso ricotta", "sal y pimienta negra recién molida", "nuez moscada recién rallada, al gusto", "½ limón, solo ralladura", "4 x 200 g / 7 oz de filetes de rodaballo, piel en", "sal y pimienta negra recién molida", "110g / 4oz de mantequilla", "3 cucharadas de alcaparras, escurridas y enjuagadas", "1 limón, solo jugo", "2 cucharadas de cebollines frescos finamente picados", "2 cucharadas de perejil fresco de flatleaf recién picado", "Col rizada de 300 g / 10½oz, tallos eliminados", "75ml / 3fl oz de agua"], "method": ["Para los tortellini, coloque la harina y dos de los huevos en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Coloque la mezcla en una superficie de trabajo enharinada y mezcle la mezcla suavemente para formar una masa.", "Amase ligeramente la masa durante 2-3 minutos, o hasta que esté suave y elástica. Ruede en una bola, cubra con una película adhesiva y déjela enfriar en la nevera durante al menos 20 minutos.", "Mientras tanto, cocine la col rizada en una olla de agua hirviendo durante 2 o 3 minutos, o hasta que se marchite y se ablande. Escurra bien, envuelva en papel de cocina y exprima el exceso de humedad de la col rizada.", "Pique finamente la col rizada, luego coloque en un tazón junto con la ricota. Sazonar con sal y pimienta negra recién molida, un poco de nuez moscada recién rallada y la ralladura de limón. Mezcle hasta que esté bien combinado. Dejar de lado hasta que sea necesario.", "Retire la masa del refrigerador y deseche la película adhesiva. Ligeramente la harina de su máquina de pasta para evitar que la masa se pegue. Aplane la bola de masa ligeramente con un rodillo, luego comience con la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa al pasar por la máquina con la otra.", "Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes. Repita este proceso, enharinando la máquina y cambiando la configuración cada vez, hasta llegar a la configuración más delgada. Puede cortar la pasta en láminas individuales más pequeñas y trabajarlas individualmente, manteniendo la masa restante sin usar cubierta debajo de una película adhesiva para evitar que se sequen.", "Batir el huevo restante en un recipiente. Recorta los círculos de las hojas de pasta con un cortador de pasteles de 4-5 cm / 1,5-2 pulgadas, luego cepilla cada círculo con el huevo batido. Coloque una cucharadita colmada de la col rizada y el relleno de ricotta en la mitad del círculo, luego doble la otra mitad de la pasta, de modo que forme una forma de media luna, y presione juntas para sellar. Traiga las dos esquinas inferiores de la media luna juntas para crear un círculo y pellizque para sellar. Repita con la pasta restante y la mezcla de relleno, colocando cada tortellini terminado en una bandeja forrada con papel resistente a la grasa. Dejar de lado.", "Para el rodaballo, condimente el pescado con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente y agregue 25 g / 1 oz de la mantequilla. Cuando la mantequilla esté espumosa, agregue el rodaballo y fría el lado de la piel hacia abajo durante 2-3 minutos, o hasta que la piel esté crujiente y dorada.", "Voltee el pescado y cocine durante 2-3 minutos más, o hasta que esté bien cocido (la carne debe ser opaca y desmenuzarse fácilmente). Retire el pescado de la sartén y déjelo a un lado para que descanse.", "Regrese la sartén al fuego y agregue 50 g / 2 oz de la mantequilla a la sartén. Cocine a fuego medio durante 4-5 minutos, o hasta que la mantequilla se vuelva de color marrón claro. Agregue las alcaparras y el jugo de limón, luego retire la sartén del fuego y agregue el cebollín picado y el perejil. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Calentar una sartén grande con tapa hasta que esté caliente, agregar la mantequilla restante y freír la col rizada durante aproximadamente 1-2 minutos. Agregue el agua, tape la olla con la tapa y cocine por 2-3 minutos, o hasta que la mayor parte del agua se absorba y la col rizada esté tierna. Retirar del fuego y mantener caliente.", "Cocine los tortellini, en tandas, en una sartén con agua salada hirviendo durante 2 o 3 minutos, o hasta que floten en la superficie y estén al dente. Eliminar con una cuchara ranurada.", "Para servir, coloca la col rizada marchita en el centro de cuatro platos para servir. Coloque un filete de rodaballo, con la piel hacia arriba, encima de la col rizada y coloque 4-5 tortellini en el filete. Rocíe la mantequilla de la alcaparra sobre la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_curlykaleandricottat_93570", "title": "Curly kale y ricotta tortellini con rodajas de rodaballo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva virgen extra", "1 cebolla grande, en rodajas", "2 ramitas de romero fresco", "1 chile rojo fresco medio o caliente, sin semillas y en rodajas finas", "4 dientes de ajo, en rodajas", "250g / 9oz de col rizada o cavolo nero, cortado de tallos resistentes, enjuagados y cortados en rodajas gruesas de 1cm / ½ in", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva en una sartén profunda con fondo profundo a fuego medio. Agregue la cebolla, baje el fuego y fríela suavemente hasta que esté tierna.", "Agregue el romero, el chile y el ajo y fría por un minuto más.", "Agregue la col rizada o el cavolo nero y sazone con sal. Cubra con una tapa ajustada, reduzca el calor a su mínimo absoluto y deje cocer suavemente durante unos 20 minutos. Revuelva una vez después de cinco minutos, luego otra vez diez minutos más tarde.", "Retire los tallos de romero, luego pruebe y ajuste el condimento. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_curlykaleorcavoloner_85608", "title": "Col rizada (o cavolo nero) con romero y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curlykaleorcavoloner_85608_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8 oz de grosellas rojas", "225 g / 8 oz de grosellas negras", "100 g / 3½ oz de fresas", "250g / 9 oz de azúcar granulada", "1 limón, solo jugo"], "method": ["Lave y quite el tallo de toda la fruta y colóquela en una sartén de tamaño mediano.", "Agregue el azúcar, 250ml / 9fl oz de agua y jugo de limón a la sartén.", "Ponga todos los ingredientes a ebullición y cocine a fuego lento durante 20 minutos.", "Ate una bolsa de gelatina o una sábana limpia de muselina a algo apropiado para que pueda colgar sobre un recipiente. Vierta los ingredientes en la bolsa de gelatina (o muselina) y déjela gotear. No apriete la bolsa para evitar que el cordial se ponga turbio.", "Una vez que todo el líquido haya goteado (alrededor de una hora), vierta el jarabe en un recipiente esterilizado."], "url": "www_bbc_co_uk_food_recipes_curranty_cordial_71718", "title": "Cordial de la garantía", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 400ml / 14fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curranty_cordial_71718_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de mantequilla sin sal", "Cebollas 150g / 5½oz, picadas", "2 dientes de ajo, aplastados", "500 g / 1lb 2 oz zanahorias, peladas y picadas en trozos pequeños", "1 cucharadita de semillas de comino", "½ cucharadita de polvo de curry Madras", "300 ml / ½ litro de caldo de pollo (o caldo de verduras)", "1 bouquet garni", "1 cucharada de cilantro fresco picado, para servir"], "method": ["Derrita la mantequilla en una cacerola y sude la cebolla, el ajo y las zanahorias, con una pizca de sal, durante 5-6 minutos, o hasta que se ablanden.", "Mientras tanto, tuesta las semillas de comino en una sartén seca hasta que estén fragantes. Agregue las semillas de comino tostadas y el polvo de curry Madras a las verduras y cocine durante 2-3 minutos más.", "Agregue el caldo, bouquet garni y 500ml / 18fl oz de agua y llévelo a ebullición. Reduzca a fuego lento y cocine por 30 minutos.", "Retire el bouquet garni, luego mezcle la sopa en una licuadora hasta que quede suave. Pase a través de un colador en una cacerola limpia y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, cuela la sopa en tazones y espolvorea con cilantro fresco picado."], "url": "www_bbc_co_uk_food_recipes_curried_carrot_soup_29946", "title": "Sopa de zanahoria al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curried_carrot_soup_29946_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de colza", "1 cebolla, finamente picada", "1 cucharada de polvo de curry suave", "Coliflor de 600 g / 1 libra y 5 onzas, sin tallo, floretes toscamente picados", "500ml / 17fl de leche en oz", "500ml / 17fl oz de caldo de verduras", "1 cucharada de vinagre de vino blanco", "pellizcar copos de sal marina", "4 huevos de gallinas camperas", "2 rebanadas de pan blanco, cortado en cubos", "pimienta negra recién molida", "exprimir jugo de limón", "1 cucharada de cilantro fresco picado o hojas de perejil, para adornar"], "method": ["Calentar 1 cucharada de aceite de colza en una sartén profunda a fuego medio. Agregue la cebolla y fría por 1-2 minutos, o hasta que se suavice. Agregue el polvo de curry y cocine durante un minuto más, luego agregue la coliflor y saltee durante 2-3 minutos.", "Vierte la leche y el caldo de verduras y lleva la sopa a ebullición, luego reduce el fuego hasta que la sopa esté hirviendo a fuego lento y cocine a fuego lento durante 12-15 minutos, o hasta que las flores de coliflor estén tiernas.", "Mientras tanto, poach los huevos. Prepare un recipiente con agua helada. Ponga a hervir una olla de agua y agregue el vinagre y una pizca de sal, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento.", "Agriete 1 de los huevos en un tazón pequeño. Batir el agua para crear un remolino, luego dejar caer el huevo en el vórtice. Cocine a fuego lento durante 1-1½ minutos, luego levante cuidadosamente el huevo escalfado de la sartén y transfiéralo al agua helada.", "Repita el proceso de caza furtiva con los huevos restantes. Mantenga los huevos bien fríos en el refrigerador, en el agua, hasta que los necesite.", "Caliente 2 cucharadas de aceite de colza en una sartén separada a fuego medio. Freír los cubitos de pan en todos los lados hasta que se doren por todas partes, luego se ponen a un lado para escurrir sobre papel de cocina. Dejar de lado.", "Cuando la sopa esté lista, póngala a un lado para que se enfríe un poquito, luego mezcle hasta obtener un puré suave usando un procesador de alimentos o una licuadora portátil. Regrese la sopa a la cacerola, sazone, sazone, con sal y pimienta negra recién molida, luego termine con un chorrito de jugo de limón.", "Cuando esté listo para servir, ponga a hervir un recipiente con agua, luego retírelo del fuego y baje suavemente los huevos escalfados en el agua de una sola vez para recalentar durante 30-60 segundos, o hasta que estén calientes por completo.", "Sirva la sopa en tazones y adorne cada porción con un huevo escalfado, una dispersión de croûtons y hierbas, y una llovizna del aceite de colza restante."], "url": "www_bbc_co_uk_food_recipes_curried_cauliflower_soup_51373", "title": "Sopa de coliflor al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curried_cauliflower_soup_51373_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal, para freír", "800 g / 1 libra de coliflor de 12 onzas, cortada en florecillas", "Paneer o halloumi de 225g / 8oz, cortado en cubos de 2cm / ¾in", "1 cebolla, finamente rebanada", "4cm / 1½en raíz fresca de jengibre, pelado y rallado", "2 dientes de ajo rallados", "2 cucharaditas de curry en polvo", "2 cucharaditas de cúrcuma molida", "Espinaca de hoja ancha de 500 g / 1 lb 2 oz, tallos duros eliminados", "200g / 7oz de yogurt natural", "sal"], "method": ["Caliente una olla de fondo grueso a fuego medio y vierta una cucharadita de aceite. Agregue la coliflor y saltee durante 15-20 minutos, o hasta que esté dorada. Tómese su tiempo y no se mueva demasiado o creará vapor, lo que dificultará la coloración. Escurrir sobre papel de cocina.", "Agregue otra cucharadita de aceite a la sartén y fría el paneer hasta que se dore. Escurrir sobre papel de cocina.", "Vierta otra cucharadita de aceite en la sartén y agregue la cebolla, el jengibre y el ajo. Reduzca el fuego a medio-bajo y fría, revolviendo de vez en cuando, durante 10-15 minutos, o hasta que se ablanden. Agregue el curry en polvo y la cúrcuma y cocine, revolviendo, durante 1 minuto.", "Regrese la coliflor a la sartén y agregue 200ml / 7floz de agua. Cocine a fuego lento durante 2 minutos, o hasta que esté tierno. Agregue el paneer, luego la espinaca, y revuelva hasta que se marchite.", "Sazonar con sal y servir con algunas cucharadas de yogur."], "url": "www_bbc_co_uk_food_recipes_curried_cauliflower_with_57222", "title": "Coliflor al curry con espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curried_cauliflower_with_57222_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2½oz de arroz integral de grano largo", "2 cucharaditas de polvo de curry mediano", "Brócoli de tallo largo de 100g / 3½oz, cortado y cortado en longitudes cortas", "½ cubo de caldo de pollo", "1 pechuga de pollo deshuesada y desollada", "1 cebolla pequeña, mitad rebanada finamente, mitad finamente picada", "1 hoja de laurel", "aceite en aerosol bajo en calorías", "Almendras en copos de 15g / ½oz, tostadas", "1 manzana pequeña para comer, sin corazón, partida a la mitad y en rodajas finas", "100g / 3½oz de tomates cherry, cortados por la mitad", "3 cucharadas colmadas de cilantro fresco tostado", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Llene a la mitad una cacerola mediana con agua y llévela a ebullición. Agregue el arroz y una cucharadita de curry en polvo. Cocine por 25 minutos, o hasta que estén tiernos. Agregue el brócoli y cocine por otros dos minutos. Escurrir en un colador y enjuagar con agua fría hasta que esté frío.", "Mientras tanto, llene a medias una cacerola pequeña con agua, agregue el cubo en existencia y deje que hierva, revolviendo hasta que el caldo se disuelva. Agregue el pollo, la cebolla rebanada y la hoja de laurel y reduzca el fuego. Cocine a fuego lento durante 15 minutos o hasta que el pollo esté bien cocido. Escurrir en un colador, reservando el licor de cocción. Deja el pollo a un lado para que se enfríe.", "Regrese la sartén al fuego, rocíe con aceite y agregue la cebolla picada. Cocine a fuego lento durante tres minutos, revolviendo. Agregue el polvo de curry restante y revuelva durante unos segundos más.", "Vierta 200 ml / 7 fll oz de licor de cocción reservado en la sartén y llevar a fuego lento. Cocine la cebolla durante 5-6 minutos, o hasta que la mayor parte del líquido se haya evaporado, revolviendo ocasionalmente. Retirar del fuego, extender sobre un plato y dejar enfriar durante cinco minutos antes de transferir a la nevera hasta que esté frío.", "Rompa el pollo en pedazos y colóquelo en un tazón. Incline el arroz y el brócoli encima, agregue las cebollas condimentadas, las almendras, la manzana y los tomates. Esparce el cilantro y espolvorea con jugo de limón. Temporada para probar y servir."], "url": "www_bbc_co_uk_food_recipes_curried_chicken_and_rice_47377", "title": "Ensalada de pollo al curry y arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curried_chicken_and_rice_47377_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cebollas grandes, 1 finamente picado, 2 rebanadas finas", "5 dientes de ajo, pelados y aplastados", "1 pequeño manojo de cebollín fresco, cortado", "50ml / 2fl oz de vinagre de vino blanco", "¼ cucharadita de clavo de olor molido", "1kg / 2lb 4oz muslo de cabra, cortado en trozos grandes", "3 cucharadas de aceite de girasol", "3 cucharadas de polvo de curry suave", "1 cubo de caldo de cordero", "2 ramitas de romero fresco", "2 ramitas de orégano fresco", "puñado de perejil fresco", "1 cilantro fresco de racimo pequeño, aproximadamente picado", "sal y pimienta negra recién molida", "300g / 10½oz de arroz de grano largo fácil de cocinar, enjuagado", "20ml / ¾fl oz de leche de coco", "30ml / 1fl oz de aceite de girasol", "2 cubos de caldo de pollo", "400 g de frijoles de lata, escurridos y enjuagados", "pizca de sal"], "method": ["En un recipiente lo suficientemente grande como para contener toda la carne, mezcle la cebolla picada, el ajo y el cebollino con el vinagre y el clavo de olor. Agregue la cabra y marine durante aproximadamente 20 minutos.", "Mientras tanto, caliente el aceite en una cazuela grande a prueba de fuego a fuego medio. Agregue las cebollas rebanadas y fría por 10 minutos. Agregue el polvo de curry y cocine durante 1 minuto más. Agregue la cabra y el crumble en el cubo de caldo de cordero. Agregue las ramitas de romero, orégano y perejil. Agregue 700ml / 1¼ de pinta de agua y sazone con sal y pimienta. Mezcle todo junto y lleve a ebullición. Reduzca el fuego, cubra con una tapa y cocine a fuego lento durante 1 hora.", "Retire la tapa y continúe cocinando a fuego lento por 1-1 hora más o hasta que la carne esté tierna y la salsa reducida.", "Mientras se cocina el curry, coloque todos los ingredientes del arroz en una olla con tapa con 450ml / 16fl de agua. Mezcle bien y llevar a ebullición. Reduzca el fuego, cubra y cocine a fuego lento durante 6 minutos.", "Apague el fuego y déjelo reposar, tapado, por otros 5-6 minutos, o hasta que esté tierno y el líquido haya sido absorbido.", "Revuelva el cilantro a través del curry y esponje el arroz antes de servir."], "url": "www_bbc_co_uk_food_recipes_curried_goat_with_45870", "title": "Cabra al curry con arroz de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curried_goat_with_45870_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina integral fuerte", "5g de sal", "4 cucharaditas de aceite de oliva", "6 dientes de ajo, asados ​​en sus pieles hasta que estén blandos", "15g / ½ oz de jengibre fresco, finamente picado", "2 cucharaditas de sal", "2 cucharaditas de sal masala", "3-4 chiles verdes pequeños, finamente picados con semillas guardadas en", "1 x 400 g / 14 oz de tomates de hojalata", "Filetes de bacalao 350g / 12oz, desollados", "1 cucharada de aceite vegetal", "2 cucharaditas de semillas de carom (también conocidas como semillas de ajwain)", "1 x 215 g / 8 oz de garbanzos de lata, enjuagados y escurridos"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Comience haciendo la masa de chapati. Mezcle la harina y la sal juntas en un tazón. Agregue el aceite y luego agregue gradualmente 160 ml / 5½ fl oz de agua para formar una masa.", "Amasar la masa sobre una superficie de trabajo ligeramente enharinada durante 5-10 minutos, hasta que quede elástica y lisa. Coloque en un bol engrasado y deje reposar por 30 minutos.", "Para hacer el relleno, exprime los dientes de ajo tostados de sus pieles en un tazón. Agregue el jengibre, la sal y el garam masala. Mezcle para combinar. Agregue los tomates y revuelva. Agite suavemente las porciones de bacalao en la mezcla para cubrir.", "Calentar el aceite en una sartén grande. Cuando el aceite esté caliente, agregue las semillas de carambola y cocine hasta que se oscurezcan en color. Coloque las piezas de bacalao recubiertas en la sartén y vierta sobre la mezcla de tomate. Una vez que la salsa comience a hervir, reduzca el fuego y cocine a fuego lento durante tres minutos. Gire el bacalao y cocine por 3-4 minutos más, o hasta que el bacalao esté recién cocinado.", "Retire el bacalao de la sartén y déjelo a un lado. Cocine la salsa hasta que el volumen del líquido se reduzca a una salsa espesa. Incline los garbanzos en la salsa y revuelva. Retirar del fuego y reservar para enfriar.", "Divide la masa chapati en seis piezas iguales. Enrolle cada pieza en una bola, luego use un rodillo para enrollar cada bola en un disco delgado, de aproximadamente 18 cm de diámetro.", "Toma la salsa fría y vierte el bacalao en ella.", "Coloque cucharadas del relleno en el centro de los discos de chapati. Cepille los bordes con agua. Junta los bordes de la masa alrededor del relleno y engarza la parte superior para sellar.", "Coloque en una bandeja para hornear y hornee durante 30-35 minutos, o hasta que la masa esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_curried_cod_pasties_28943", "title": "Pastel de bacalao al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 6 empanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1½ cucharadita de sal masala", "1 cucharadita de cúrcuma molida", "½ cucharadita de chile en polvo", "1 cucharadita de semillas de hinojo", "½ cucharadita de semillas de comino", "½ cucharadita de semillas de cilantro", "10 vainas de cardamomo, sin semillas", "1 diente de ajo, rallado", "1 cucharadita de sal", "4 cucharadas de aceite de oliva", "2 limones, solo jugo", "8 chuletas de cordero", "6 tomates de ciruela", "50 g / 1¾oz de mantequilla sin sal", "½ cucharadita de sal", "1 cucharada de vinagre de vino tinto", "30g / 1oz de azúcar moreno", "2 cucharadas de estragón fresco picado", "2 cucharadas de cilantro fresco picado", "2 cucharadas de perejil rizado picado", "2 cucharaditas de mostaza Dijon", "1 cucharadita de vinagre de vino tinto", "4-6 cucharadas de aceite de oliva", "50 g / 1¾oz de almendras tostadas", "1 limón, cortado en cuartos"], "method": ["Para las chuletas de cordero, ponga todos los ingredientes, excepto el cordero, en un mortero. Moler a una pasta. Frote la pasta sobre las chuletas de cordero y colóquelas en el refrigerador para marinar durante al menos una hora.", "Para los tomates, caliente el horno a 100C / 80C Fan / Gas ¼ y forre una bandeja para hornear con papel de hornear.", "Coloque los tomates en la bandeja de horno forrada y coloque un pequeño botón de mantequilla en cada mitad. Manche con el vinagre de vino tinto y esparza sobre el azúcar moreno, sal y pimienta. Asar hasta que esté casi seco (semi jugoso y totalmente carente de acidez), esto tomará de 1 a 2 horas.", "Para las chuletas de cordero, calentar una sartén grande y agregar la mantequilla y el aceite, una vez caliente, agregar las chuletas de cordero y dorar a cada lado. Reservar para descansar", "Para la salsa verde, mezcle todos los ingredientes en un tazón.", "Para servir, coloque los tomates asados ​​lentos en los platos para servir y cubra con la salsa verde. Coloque el cordero al lado de los tomates y espolvoree con almendras tostadas. Sirva una rodaja de limón en un lado."], "url": "www_bbc_co_uk_food_recipes_curried_lamb_cutlets_41998", "title": "Chuletas de cordero al curry con tomate y salsa verde", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4-5 cucharadas de aceite vegetal", "1 cebolla, pelada, en rodajas", "1 diente de ajo, pelado, picado", "1 chile, sin semillas, finamente picado", "1 cucharadita de canela molida", "1 cucharadita de curry en polvo", "1 cucharadita de semillas de fenogreco", "pizca de sal", "2 berenjenas, cortadas, cortadas en cubos de 2cm / ¾in", "1 lima, solo jugo", "Pan crujiente de 4 piezas, tostado en una sartén de plancha", "1 cucharada de yogur al estilo griego", "1-2 cucharadas de hojas de cilantro fresco picado"], "method": ["Calienta 1-2 cucharadas de aceite en una sartén a fuego medio. Agregue la cebolla, el ajo y el chile y fría por 6-8 minutos, o hasta que estén suaves y dorados. Retire de la sartén y reserve.", "Espolvoree las especias y la sal en un plato y mezcle bien para combinar. Cepille los cubos de berenjena con otra cucharada de aceite y luego séquelos en la mezcla de especias hasta que estén cubiertos.", "Calentar el aceite restante en la sartén y freír los cubitos de berenjena recubiertos durante 4-5 minutos, agitando la sartén de vez en cuando, hasta que estén tiernos y dorados.", "Regrese la mezcla de cebolla a la sartén y mezcle bien para combinar. Exprime el jugo de lima.", "Para servir, coloque una pieza de pan en forma cuadrada en el centro de cada una de las cuatro placas para servir. Cuchara sobre la berenjena con especias. Sirva una cucharada del yogur griego al lado. Espolvorea sobre las hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_curriedaubergineonto_92480", "title": "Berenjena con especias en una tostada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cucharadita de cúrcuma molida", "1 cucharadita de chile molido en polvo", "2 cucharaditas de cilantro molido", "1 cucharadita de comino molido", "1 cucharadita de polvo de garam masala", "3 cucharadas de aceite de colza", "2 cucharadas de jengibre y pasta de ajo (cantidades iguales de jengibre y ajo en puré junto con agua y un poco de aceite)", "4-5 chiles verdes picados", "2-3 cebollas medianas, picadas", "500g / 1lb 2oz de carne de cordero", "½ lima, solo jugo", "2-3 cucharadas de cilantro fresco picado y menta", "2 tomates, despellejados, semillas retiradas y picadas", "3 cucharadas de ketchup de tomate", "4 huevos de gallinas camperas", "4 rollos suaves", "mantequilla suave", "1 cebolla roja picada", "1 chile verde, picado", "2 cucharadas de menta fresca picada y cilantro"], "method": ["Mezcle los polvos de especias en un tazón pequeño con 200 ml / 7 fl oz de agua. Cubra y reserve.", "Caliente una cazuela y agregue el aceite de colza. Cuando esté caliente y se forme una neblina, agregue el jengibre y la pasta de ajo y los chiles verdes y fría a fuego lento, revolviendo bien con una espátula de madera para evitar que se pegue al plato.", "Una vez que la pasta cambia de color y obtiene un gran aroma, agregue las cebollas picadas y continúe cocinando. Es posible que necesite agregar un poco de agua para limpiar el fondo de la sartén.", "Continúe freyendo las cebollas, agregando agua de vez en cuando, a fuego medio hasta bajo, hasta que la cebolla se reduzca a casi una pulpa. Esto puede tomar algo de tiempo.", "Agregue la mezcla de especias empapada (agregue un poco de agua al tazón para liberar cualquier especia pegada a los bordes) y freír suavemente hasta que vea salir el aceite. Es posible que necesite agregar un poco de agua nuevamente para evitar que se pegue.", "Reduzca el fuego a muy bajo o apague completamente el fuego y agregue la carne picada. Trabaja bien con la espátula hasta que esté completamente fragmentada y mezclada muy bien con el masala.", "Regrese el fuego a medio y cocine, revolviendo regularmente hasta que la carne esté cocida.", "Sazonar y agregar el jugo de lima y la menta picada y el cilantro.", "Agregue los tomates picados y el ketchup de tomate y cocine hasta que se los absorba.", "Batir los huevos y agregarlos a la carne picada caliente y revuelva suavemente sobre el fuego hasta que estén mezclados a su gusto. Nos gusta el nuestro suave, ya que es un gran relleno en un rollo de desayuno suave, pero algunos prefieren hacerlo casi como en una consistencia de tortilla. De cualquier manera, el sabor es excelente. Sirva en panecillos con mantequilla con la cebolla, el chile, la menta y el cilantro al gusto."], "url": "www_bbc_co_uk_food_recipes_curried_lamb_minced_87032", "title": "Cordero al curry picado con huevo (Kheema ghotala)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas de manzana de abeto rosa de 250 g / 9 oz (o papas de ensalada similares), peladas, cortadas en rodajas y blanqueadas", "2 cucharadas de aceite de oliva", "1 cucharada de romero picado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 dientes de ajo, finamente picados", "½ pimienta romero, finamente picada", "¼ calabaza, pelada, sin semillas y en cubos", "½ cucharadita de cúrcuma", "½ cucharadita de comino", "½ cucharadita de polvo de curry mediano", "150ml / 5fl oz de caldo de pollo caliente", "Crema doble 50ml / 2fl oz", "Mejillones de 200 g / 7 oz, limpios y barbados", "100g / 3½oz de azúcar a presión, blanqueados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer las patatas fritas, mezcle las rodajas de patata con el aceite y el romero y luego sazone bien con sal y pimienta negra recién molida.", "Colocar en una bandeja para hornear y asar durante 17 minutos.", "Para hacer los mejillones al curry, caliente el aceite de oliva en una olla y cocine el ajo, la pimienta y la calabaza hasta que estén blandos.", "Agregue las especias, mezcle y cocine por un minuto.", "Suba el fuego y agregue el caldo y la crema. Cuando comience a hervir, agregue los mejillones y cocine durante cuatro minutos (deseche los que no se abren).", "Agregue las brochetas de azúcar y sazone con sal y pimienta negra recién molida.", "Sirva los mejillones al curry en un recipiente tibio con las patatas fritas en un recipiente aparte."], "url": "www_bbc_co_uk_food_recipes_curriedmusselswithfr_82586", "title": "Mejillones al curry con patatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pimiento rojo", "½ cucharadita de polvo de curry suave", "½ cucharadita de cilantro", "2 dientes de ajo", "2 cucharadas de aceite vegetal", "Fideos de huevo a 200 g / 7 oz, cocidos de acuerdo con las instrucciones del paquete", "1 cucharada de aceite de sésamo", "55g / 2oz anacardos", "5 lanzas de espárragos, solo tallos leñosos", "½ pimiento rojo, picado", "250ml / 9fl oz de caldo de pollo o vegetal", "100ml / 3½ fl oz crema doble", "2 cucharadas de cilantro fresco picado", "ramitas de cilantro fresco", "ramitas de cebollín fresco"], "method": ["Para la pasta de curry, coloque todos los ingredientes de la pasta en un procesador de alimentos pequeño y mezcle hasta lograr una pasta homogénea.", "Para los fideos, mezcle la mitad de la pasta de curry con los fideos de huevo drenados cocidos y el aceite de sésamo.", "Para el caldo, fría los anacardos en una sartén por 2-3 minutos o hasta que estén dorados, luego retírelos y déjelos a un lado. Agregue la pasta de curry restante a la sartén junto con los espárragos y el pimiento rojo y fría por 3-4 minutos, cubriendo las verduras uniformemente en la pasta. Agregue el caldo y la crema y deje hervir a fuego lento por 2-3 minutos, o hasta que los vegetales estén tiernos. Agregue el cilantro y los anacardos tostados.", "Sirva los fideos en un tazón de sopa con el caldo cucharada en la parte superior, y adorne con el cilantro fresco y el cebollino."], "url": "www_bbc_co_uk_food_recipes_curriednoodlebrothwi_90132", "title": "Caldo de fideos al curry con anacardos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ calabacín, picado", "2 cebollas de primavera, en rodajas", "3 higos secos, en rodajas", "100 g / 3½ oz de frijoles rojos en lata, enjuagados y escurridos", "1 cucharadita de puré de tomate", "1 cucharada de salsa Tabasco", "100 g / 3½ oz de queso paneer, en cubos (disponible en la mayoría de los supermercados y tiendas asiáticas)", "100 g / 3½ oz de yogur griego", "2 cucharadas de menta fresca picada", "1 cebolla tierna, finamente picada", "1 pan pitta, ligeramente tostado"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue los calabacines, cebollas, higos, frijoles rojos, puré de tomate, salsa Tabasco y cocine durante cinco minutos hasta que el calabacín esté bien cocido.", "Agregue el paneer en cubos y cocine por tres minutos más.", "Para el tzatziki, coloca el yogur griego, la menta y la cebolleta en un bol y mezcla bien.", "Para servir, coloque el curry en un plato, cubra con una cucharada de tzatziki y un pan pitta en el lado."], "url": "www_bbc_co_uk_food_recipes_curriedpaneerwithtaz_79950", "title": "Paneer al curry con pan tzatziki y pitta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "½ cebolla, finamente picada", "1-2 pastinacas, peladas, finamente picadas", "300ml / 10½fl oz de caldo de verduras calientes", "2 cucharadas de queso duro de cabra rallado", "2 cucharaditas de curry en polvo", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "1 cucharada de yogur al estilo griego", "rociar aceite de oliva"], "method": ["Derrita la mantequilla en una cacerola y fría la cebolla hasta que esté blanda pero no coloreada. Agregue la chirivía, vierta el caldo y cocínelo durante 6-8 minutos, o hasta que la chirivía esté tierna.", "Agregue el queso de cabra y el polvo de curry y cocine por 3-4 minutos. Agregue la crema doble y sazone con sal y pimienta negra recién molida, luego mezcle con una licuadora de mano hasta que quede suave. Agregue una pizca de agua hirviendo si la sopa es demasiado espesa.", "Vierta en un tazón y adorne con una cucharada de yogurt al estilo griego y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_curriedparsnipsoup_88856", "title": "Sopa de chirivía al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, más o menos picada", "2 dientes de ajo, en rodajas gruesas", "1 kg / 2lb 2 pastillas de chirivía de 2 oz, peladas, cortadas en trozos", "3 ramitas de tomillo fresco", "3 cucharadas de miel", "1-2 cucharaditas de polvo de curry caliente", "sal y pimienta negra recién molida", "1.5litros / 2½pints de caldo de pollo (los vegetarianos pueden sustituir el caldo de verduras)", "Crema doble 450ml / 16fl oz", "aceite, para freír", "½ chirivía, pelada", "½ remolacha, pelada", "½ nabo, pelado", "½ zanahoria, pelada", "Crema doble 250ml / 9fl oz", "½ limón, solo jugo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque todos los ingredientes de la sopa con la excepción del caldo y la crema en una bandeja para asar. Mezcle bien y sazone con sal y pimienta negra recién molida. Coloque en el horno para asar durante 25-30 minutos, hasta que estén dorados y tiernos.", "Coloque todo menos 250ml / 9fl oz de caldo de pollo en una cacerola a fuego alto. Agregue la crema y, una vez que hierva, reduzca el fuego a fuego lento.", "Agregue las chirivías asadas y continúe cocinando a fuego lento.", "Vierta el resto del caldo en la bandeja de tostado y colóquelo a fuego alto. Revuelva bien, raspando los trozos dorados en la base de la bandeja de asar para liberar todo el sabor, luego agregue esta salsa a la sopa hirviendo a fuego lento.", "Retire del fuego y deje enfriar un poco, luego transfiera a un procesador de alimentos y mezcle hasta que quede suave. Regrese la sopa a la sartén y sazone, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para los chips de verduras, precaliente una freidora a 190C / 375F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Usando un pelador de patatas, pele las tiras largas de cada una de las verduras. Con cuidado, agregue las tiras de verduras en el aceite y fría hasta que estén doradas. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque la crema en un recipiente y látelo ligeramente hasta que se formen picos suaves cuando se quite la batidora. Agregue el jugo de limón y doble en la crema.", "Sirva la sopa en un bol con una cucharada de crema en el centro y una pequeña pila de patatas fritas vegetales colocadas sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_curriedroastparsnips_84173", "title": "Sopa de chirivía asada al curry con chips vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curriedroastparsnips_84173_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de zanahorias, ralladas", "150g / 5½ oz pastinacas, ralladas", "120 g / 4½oz de harina de gramo", "1 cucharadita de comino molido", "1 cucharadita de curry en polvo", "1 cucharadita de cilantro molido", "1 cucharadita de sal", "2 huevos de gallinas camperas, golpeados", "1.5-2 litros / 2¾-3½ pintas de aceite, para freír", "gran cilantro fresco de puñado (aproximadamente 50g / 1¾oz)", "3 chiles verdes frescos", "3 cucharadas de jugo de limón", "1 cucharadita de aceite de oliva", "½ cucharadita de sal", "1 cucharadita de azúcar en polvo"], "method": ["Para los bhajis, ponga las zanahorias, chirivías, harina de garbanzos, comino, polvo de curry, cilantro molido y sal en un tazón grande y mezcle con las manos para liberar parte de la humedad.", "Añadir los huevos y mezclar bien. La mezcla debe ser como una pasta espesa. Casi como una mezcla de pastel de zanahoria sin cocer.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliéntelo a 150 ° C (una gota de la mezcla debe chisporrotear y flotar hasta la parte superior.) (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Trabajando en lotes, coloque cucharadas colmadas de la mezcla en el aceite y cocínelas durante 3- 4 minutos, girando los bhajis todo el tiempo para que tengan un color dorado uniforme. Escurra sobre papel de cocina mientras cocina el resto.", "Para hacer el chutney, coloque todos los ingredientes en un procesador de alimentos y mezcle en una pasta suave. Sirve con los bhajis."], "url": "www_bbc_co_uk_food_recipes_curry_carrot_and_parsnip_33941", "title": "Bhajis de zanahoria y chirivía con cilantro y chutney de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cucharadita de semillas de comino", "2 cucharaditas de aceite de oliva ligero", "45g / 1½oz de maíz reventado", "1 cucharadita de polvo de curry suave", "¼ cucharadita de canela molida", "¼ cucharadita de ralladura de lima finamente rallada", "Una pizca de sal marina"], "method": ["Coloque una olla con tapa a fuego medio. Tueste ligeramente las semillas de comino durante 1 a 2 minutos, luego hágalo en un tazón.", "Agregue el aceite y el estallido de maíz a la sartén y mezcle bien. Cubra con la tapa y cocine durante unos minutos, agitando la sartén cada pocos segundos, hasta que el maíz comience a reventar. Sigue sacudiendo constantemente al reventar para evitar quemar el maíz.", "Mezcle las semillas de comino tostadas, curry en polvo, canela y ralladura de limón.", "Espolvoree el condimento y un poco de sal marina sobre las palomitas de maíz y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_curry_and_lime-spiced_58305", "title": "Palomitas de maíz con especias de curry y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curry_and_lime-spiced_58305_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 patas de pollo, con la piel puesta", "1 cucharada de cúrcuma molida", "1 cucharadita de sal, o al gusto", "4 cucharadas de aceite vegetal", "2 cebollas en rodajas", "Leche de coco 400ml / 14oz de espesor", "4-6 hojas de lima jóvenes, finamente trituradas", "1 cucharada de azúcar de palma (o azúcar moreno)", "2 cucharadas de jugo de limón recién exprimido", "Chalotes de 350g / 13oz, más o menos picados", "4 dientes de ajo", "1 cucharada de jengibre fresco y picado", "1 flor de jengibre pequeña, picada (opcional, disponible en algunas tiendas especializadas de Asia)", "1 cucharadita de galanga picado", "1 cucharadita de raíz de cúrcuma picada", "4-6 candlenuts o nueces de macadamia", "2 tallos de hierba de limón, hojas exteriores duras retiradas, tallo interior blando toscamente picado", "2 chiles rojos frescos, toscamente picados", "1 chili rojo seco, roto", "1 cucharadita de Blachan (pasta de camarones), ligeramente frita hasta que sea fragante", "aceite vegetal, para freír", "10 chalotes, en rodajas", "hojas de menta", "1 chile rojo, en rodajas", "1 pepino, en rodajas", "arroz al vapor, para servir"], "method": ["Para el pollo, coloque las patas de pollo en un plato poco profundo y espolvoree la cúrcuma y la sal. Cubra y enfríe en la nevera durante la noche, para marinar.", "Retire el pollo marinado de la nevera media hora antes de que esté listo para cocinarlo.", "Mientras tanto, para la pasta de especias, mezcle todos los ingredientes de la pasta de especias en un procesador de alimentos hasta que quede suave.", "Para cocinar el pollo, caliente una sartén grande a fuego alto, agregue tres cucharadas de aceite y, cuando esté humeando, agregue el pollo. Freír el pollo durante 4-6 minutos, o hasta que se dore por todos lados.", "Retire el pollo de la sartén y déjelo a un lado para escurrirlo sobre un plato forrado con papel de cocina.", "Calentar un wok a fuego medio, luego agregar el aceite vegetal restante, la cebolla y la pasta de especias y sofreír durante 2 o 3 minutos, o hasta que esté fragante.", "Agregue el pollo reservado y cocínelo durante 5-7 minutos.", "Agregue la leche de coco, las hojas de lima y el azúcar. Cocine a fuego lento durante 25-30 minutos, o hasta que el pollo esté tierno y cocido.", "Agregue el jugo de lima y mezcle bien.", "Para la guarnición, llene a medias una cacerola profunda de base pesada con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las rodajas de chalote hasta que estén crujientes, luego retire con cuidado de la sartén con una espumadera y déjelas a un lado para escurrirlas sobre un plato forrado con papel de cocina.", "Para servir, espolvorea el curry en cuatro tazones para servir. Espolvorear con los chalotes crujientes, hojas de menta, chiles rojos y rodajas de pepino. Sirva el arroz al vapor al lado."], "url": "www_bbc_co_uk_food_recipes_curry_chicken_kapitan_76528", "title": "Kapitan pollo al curry", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]