[{"ingredients": ["1-2 cucharaditas de aceite de colza", "4 x 150g-175g / 5-6oz filetes de trucha a la escama, piel en", "sal y pimienta negra recién molida", "1 gran puñado de astillas de madera (idealmente hechas de aliso)", "4 cucharadas de aceite de colza primero prensado", "4 cucharaditas de vinagre de vino blanco", "1 chalote, finamente picado", "sal y pimienta negra recién molida", "200g / 7oz de guisantes frescos o congelados", "1 manojo pequeño de menta fresca, finamente picado", "1 brote de guisante, para servir", "300g / 11oz guisantes congelados", "Crema doble 110ml / 4fl oz", "sal y pimienta negra recién molida"], "method": ["Para la trucha, coloque las virutas de madera en el fondo de una bandeja metálica vieja equipada con una parrilla. Engrase ligeramente la parrilla y colóquela encima de la bandeja, de modo que (debe estar a 4-5 cm / 1½-2 pulgadas del fondo de la bandeja).", "Frote los filetes de trucha con aceite y sazone ligeramente con sal y pimienta negra recién molida. Colóquelos en el estante con la piel hacia abajo.", "Cubra toda la bandeja con una doble capa de papel de aluminio resistente y selle con fuerza alrededor de los bordes, asegurándose de que la lámina no toque la trucha.", "Para cocinar, primero asegúrese de estar trabajando en un área bien ventilada. Coloque la bandeja sobre una llama de gas muy alta para cocinar durante dos minutos; luego, con cuidado, corte un pequeño agujero en la parte superior de la lámina con un par de tijeras de cocina (para que escape el humo). Retire la bandeja del fuego y déjela reposar (idealmente afuera) mientras prepara la ensalada y el puré de guisantes.", "Para la ensalada, combine el aceite, el vinagre, la chalota y una pizca de sal y pimienta negra recién molida en una olla pequeña. Cocine suavemente en la estufa por unos minutos para que todo el vinagre sea absorbido por las chalotas.", "Ponga a hervir una olla de agua con sal, agregue los guisantes y cocine hasta que estén tiernos. Escurra los guisantes y agregue a los chalotes. Mezclar para combinar; luego agrega la menta picada.", "Para el puré de guisantes, cocine los guisantes congelados en una olla grande de agua hirviendo hasta que estén tiernos. Mientras los guisantes se cocinan, vierta la crema en una sartén lo suficientemente grande como para acomodar los guisantes también.", "Ponga la crema a ebullición, luego reduzca el fuego y manténgala caliente.", "Cuando los guisantes estén cocidos, escurrirlos y agregar a la crema. Cocine por un par de minutos más.", "Coloque los guisantes y la crema en una licuadora o procesador de alimentos y mezcle hasta lograr un puré suave. Pase la mezcla por un colador fino y sazone con sal y pimienta negra, al gusto.", "Para servir, coloque una cucharada de puré de guisantes en el centro de cada plato de servir. Coloque un filete de trucha ahumada encima y ponga la ensalada alrededor. Adornar con brotes de guisantes."], "url": "www_bbc_co_uk_food_recipes_hotsmokedtroutwithpe_91173", "title": "Trucha ahumada caliente con guisantes y menta fresca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["cestito de ciruelas inglesas, tallos eliminados", "buena aspersión de colada sin refinar o azúcar granulada", "buena rociadura de azúcar mascabado ligero", "algunos clavos enteros", "1 ramita de canela", "1 hoja de laurel fresca", "helado de vainilla de buena calidad, para servir"], "method": ["Coloque las ciruelas enteras en una sartén grande y poco profunda a fuego medio y espolvoree ambos tipos de azúcar, agregando más o menos dependiendo de la dulzura de la fruta y de lo dulce que sea su diente.", "Agregue suficiente agua para cubrir la fruta hasta la mitad, luego coloque los dientes de clavo, la canela y la hoja de laurel en la sartén. Traiga a fuego lento, luego cubra la olla con una tapa y reduzca el fuego. Cocine por 6-7 minutos, hasta que las ciruelas se hayan colapsado un poco y los jugos se hayan mezclado con el azúcar.", "Sirva el helado muy frío en tazones, cuchara sobre las ciruelas calientes y algunos de los jugos de cocina y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hotspicedfruitwithic_92530", "title": "Fruta especiada caliente con helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de azúcar en polvo", "1 cucharada de vinagre de vino tinto", "1 cucharada de vino tinto", "½ vaina de vainilla, semillas raspadas", "3 fresas frescas", "75ml / 2½ fl oz crema doble", "½ vaina de vainilla, solo semillas"], "method": ["Caliente el aceite de oliva, el azúcar impalpable, el vinagre de vino tinto, el vino tinto, la vaina de vainilla y las semillas en una sartén antiadherente pequeña.", "Agregue las fresas frescas y caliente suavemente hasta que estén glaseadas y calientes.", "Coloque las fresas alrededor del borde de un plato de servir y vierta los jugos de la bandeja sobre ellas.", "Para la crema, mezcle ligeramente la crema doble y las semillas de vainilla.", "Coloque la crema en el centro del plato para servir."], "url": "www_bbc_co_uk_food_recipes_hotsweetandsourstraw_85805", "title": "Fresas agridulces calientes con crema de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cucharadas de azúcar en polvo", "1 vaina de vainilla, dividida con un cuchillo afilado para quitar las semillas", "2 cucharadas de vinagre de vino tinto", "100 g / 3½ oz de fresas frescas", "75ml / 2½fl oz de vino tinto", "100ml / 3½ fl oz crema doble", "½ vaina de vainilla, solo semillas", "2 cucharaditas de azúcar glas", "2 cucharadas de botones de chocolate recubiertos de azúcar"], "method": ["Para las fresas calientes, agridulces, caliente el aceite de oliva y el azúcar en una sartén hasta que estén caramelizados. Agregue la vaina de vainilla partida y el vinagre de vino tinto y cocine a fuego lento durante dos minutos. Agregue las fresas y agite en la salsa por un minuto. Retire las fresas a un plato.", "Agregue el vino tinto a la sartén y cocine a fuego lento durante tres minutos, o hasta que la salsa se haya reducido ligeramente y se haya convertido en almíbar.", "Para la crema de vainilla, mezcle la crema doble, las semillas de vainilla y el azúcar glas juntos en un bol hasta que se formen picos suaves cuando se quite la batidora. Agregue los botones de chocolate recubiertos de azúcar.", "Para servir, coloca la crema de vainilla en el centro de un tazón para servir. Vierta las fresas alrededor de la crema y luego vierta sobre la salsa de la sartén."], "url": "www_bbc_co_uk_food_recipes_hotsweetandsourstraw_88193", "title": "Fresas calientes, agridulces con crema de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 chalota, en rodajas", "1 diente de ajo, picado", "1 remolacha grande, rallada", "2 cucharadas de vinagre de vino tinto", "una pizca de azúcar", "200ml / 7fl oz de caldo de carne", "yogur griego", "cebollino, picado para adornar"], "method": ["Calentar el aceite en una sartén a fuego medio y freír la chalota y el ajo hasta que estén suaves.", "Agregue la remolacha y el vinagre de vino tinto y cocine para reducir el líquido.", "Agregue el azúcar y cocine por un minuto.", "Agregue el caldo de carne y cocine a fuego lento durante 10 minutos.", "Transfiera la sopa a un tazón para servir y sirva con una cucharada de yogurt griego y cebollino picado."], "url": "www_bbc_co_uk_food_recipes_hotsweetandspicybeet_84433", "title": "Sopa de remolacha caliente dulce y picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 500 g / 1 libra de queso Vacherin Mont d'Or", "higos frescos, achicoria, galletas y pan de pasas, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque todo el Vacherin, en su caja con tapa, en una bandeja para hornear en el horno y hornee durante 20-25 minutos hasta que gotee.", "Coloque la caja de queso derretido en un plato y sirva con higos frescos y achicoria y algunos bizcochos salados y pan de pasas, como una fondue."], "url": "www_bbc_co_uk_food_recipes_hotvacherin_73054", "title": "Hot Vacherin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 claras de huevo de gallinas camperas", "3 cucharadas de azúcar en polvo", "1 cucharada de harina de maíz", "3 yemas de huevo de gallinas camperas", "30 g / 1 oz de dulce de azúcar, desmenuzado", "6-8 frambuesas, para decorar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque las claras de huevo en un recipiente limpio y bata, agregando gradualmente el azúcar impalpable y la harina de maíz hasta que la mezcla forme picos duros y brillantes, cuando se quite la batidora.", "Coloque las yemas de huevo en un recipiente aparte y bata. Luego agregue el dulce de azúcar y las frambuesas.", "Doble suavemente las claras de huevo en la clara de huevo y la mezcla de chocolate y revuelva para combinar.", "Transfiera la mezcla de huevo a una olla resistente al fuego y colóquela en el horno para cocinar durante seis a ocho minutos o hasta que esté bien dorada.", "Para servir, sirva el soufflé en la olla y espolvoree con el azúcar glasé."], "url": "www_bbc_co_uk_food_recipes_hotsweetsouffle_84346", "title": "Soufflé dulce caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "pizca de sal", "1 huevo, golpeado", "100 ml / 3½ fl oz de agua", "80 g / 3oz de manteca de cerdo"], "method": ["Ponga la harina, la sal y el huevo en un bol y mezcle aproximadamente.", "Ponga el agua y la manteca de cerdo en una olla pequeña y caliente juntos hasta que alcance el punto de ebullición.", "Mezcle en la mezcla de harina y traiga una bola. Envuélvala en film transparente y descanse a temperatura ambiente durante 5 minutos antes de moldearlo en el molde para pasteles o en el molde.", "La masa se endurecerá a medida que se enfríe."], "url": "www_bbc_co_uk_food_recipes_hotwaterpastry_1279", "title": "Repostería de agua caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 jamón crudo ahumado, aproximadamente 5 kg / 11 lb, hueso en", "2 puerros, cortados a la mitad", "1 cebolla, partida por la mitad", "1 zanahoria, cortada en trozos grandes", "10 granos de pimienta negra", "2 hojas de laurel", "1 cucharadita de semillas de cilantro", "1 cucharadita de ralladura de naranja rallada", "3 cucharadas de azúcar demerara", "3 cucharadas de azúcar mascabado ligero", "2-3 cucharadas de mostaza inglesa en polvo", "puñado de clavos enteros, para decoración", "miel a llovizna"], "method": ["Pon a prueba la salinidad de tu jamón cortando una pequeña pieza del extremo y friéndola en un poco de aceite. Si el jamón es muy salado, deberá remojarlo durante 12 horas en agua fría, cambiando el agua una vez. Si su jamón es bastante salado, colóquelo en una sartén muy grande, cúbralo con agua fría y llévelo a ebullición. Drene y deseche el agua de cocción.", "Una vez que el jamón esté listo para cocinar, colóquelo en una sartén grande, cúbralo con agua fría fresca y agregue los puerros, la cebolla, la zanahoria, los granos de pimienta y las hojas de laurel. Llevar a ebullición, cubrir con una tapa y cocine a fuego lento el jamón durante unos 20 minutos por 450 g / 1 libra. Para probar que el jamón esté cocido, inserte un pincho frío en el centro del jamón y déjelo por 10 segundos. Tómelo y pruébelo cuidadosamente contra su labio. Debería estar muy caliente.", "Deje que el jamón se enfríe un poco en el líquido de cocción, luego levántelo con cuidado y colóquelo sobre una tabla. (El líquido se puede usar como un caldo delicioso para sopa de guisantes partidos y otras recetas). Deje que el jamón se enfríe un poco.", "Usando un cuchillo pequeño y afilado, corte cuidadosamente la piel del jamón, dejando una buena capa uniforme de grasa.", "Marca la grasa en un patrón cruzado diagonal con un cuchillo afilado. El jamón ahora se puede enfriar durante hasta dos días, o puede hornearlo de inmediato.", "Precalentar el horno a 220C / 425F / Gas 7.", "Moler las semillas de cilantro en un almirez y mortero. En un tazón, mezcle la ralladura de naranja rallada y los azúcares, luego agregue las semillas de cilantro molidas. Tamice uniformemente el polvo de mostaza sobre el jamón, luego esparza la mezcla de azúcar sobre la superficie de trabajo y haga rodar el jamón en la mezcla para cubrir la grasa. Empuja un clavo en el centro de cada diamante en la grasa del jamón. Rocíe sobre la miel.", "Cubra el extremo expuesto del jamón sin apretar con papel de aluminio, asegurando con unos palillos de dientes. Coloque el jamón en una rejilla dentro de una lata de asar y hornee el jamón durante 15 minutos hasta que el glaseado esté pegajoso y crujiente, tal vez un poco chamuscado aquí y allá. Coma caliente o frío."], "url": "www_bbc_co_uk_food_recipes_how_to_cook_a_ham_22897", "title": "Jamón asado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_a_ham_22897_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 faisanes, aproximadamente 500 g / 1 lb 2 oz cada uno", "50g / 2oz de harina", "sal", "1 cucharada de aceite vegetal", "botón de mantequilla", "1 cucharada de mantequilla sin sal", "1½ chalotes de plátano, finamente picados", "1 ramita de tomillo, hojas recogidas y finamente picadas", "2 dientes de ajo, aplastados", "½ vaso de vino blanco", "4 cucharaditas de sidra o vinagre de vino blanco", "300ml / 10fl oz de caldo de pollo", "2 cucharaditas de mostaza Dijon, o más al gusto", "100ml / 3½ fl oz crema doble", "Lentejas Puy, cocinadas de acuerdo con las instrucciones del paquete, para servir"], "method": ["Prepara el faisán primero. Las patas de los faisanes tienen tendones resistentes que deben retirarse antes de cocinarlos. Con un par de alicates, tire con fuerza de los extremos expuestos de los tendones (en el extremo del pie) y extráigalos.", "Corte las piernas y los muslos lejos de cada ave, pero deje la pechuga pegada a la caja torácica. Corte la columna vertebral con tijeras de cocina fuertes o tijeras para aves de corral.", "Coloque la harina en un plato y sazone con sal. Polvore la piel del faisán con la harina, sacudiendo cualquier exceso.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén grande hasta que esté caliente, luego agregue el aceite y el pomo de mantequilla. Freír las patas y la carne de pechuga, con la piel hacia abajo, hasta que se dore por todos lados (no aplaste la sartén, si es necesario, fría la carne en tandas). Coloque las secciones de los senos a un lado en un plato y coloque las piernas en una bandeja de asar.", "Coloque las patas de faisán en el horno para asar durante 5-7 minutos. Agregue las secciones de los senos, con la piel hacia arriba, luego continúe asando toda la carne durante otros 10-12 minutos. Retire del horno en un plato caliente, reservando los jugos de cocción, y cubra ligeramente el faisán con papel de aluminio. Permita descansar por cinco minutos.", "Mientras tanto, prepara la salsa mientras el faisán se está asando. En la misma sartén que los jugos de cocción de faisán, agregue la mantequilla, los chalotes, el tomillo y un poco de sal. Cubra y cocine suavemente durante 10 minutos hasta que los chalotes se ablanden. A continuación, agregue el ajo y fría por otro minuto.", "Verter el vino, subir el fuego y hervir la salsa con furia hasta que el vino se haya evaporado para no dejar ningún líquido acuoso. Agregue la sidra o el vinagre de vino blanco y continúe cocinando hasta que el líquido haya desaparecido.", "Vierta el caldo y continúe cocinando, reduciendo el líquido a aproximadamente un tercio de su volumen original.", "Agregue la mostaza y agregue la crema. Vuelva a hervir y cocine a fuego lento durante unos minutos hasta que la salsa se espese. Agregue los jugos de cocción reservados y condimente, al gusto, con sal y pimienta negra recién molida.", "Tallar el pecho del faisán de la caja torácica (aún debe ser un poco rosado). Esto dará dos pedazos de pecho de cada pájaro. Cortar en rodajas gruesas.", "Para servir, coloque las lentejas Puy en cada uno de los cuatro platos, coloque sobre una cantidad generosa de salsa, y luego cubra con un pecho en rodajas y una pierna por plato. Espolvorea un poco de perejil de hojas rizadas picadas."], "url": "www_bbc_co_uk_food_recipes_how_to_cook_pheasant_05547", "title": "Cómo cocinar el faisán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_pheasant_05547_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.3kg / 3lb pieza vientre cerdo", "4 ramitas de romero, hojas finamente picadas", "1 cucharada de semillas de hinojo", "1 cucharadita de pimienta negra recién molida", "1 limón sin cera, solo ralladura, rallado", "1½ cucharada de sal marina en copos", "1 cucharada de aceite de girasol", "2 grandes bulbos de hinojo", "4 dientes de ajo", "250ml de vino blanco", "exprimir jugo de limón"], "method": ["Acaricie la barriga de cerdo con papel de cocina y puntee la piel con un cuchillo afilado de cocina (o cuchillo de bricolaje), si su carnicero todavía no lo ha hecho. La puntuación debe ser correcta en todo el ancho de la carne, en líneas paralelas muy juntas. El puntaje debe ir a través de la piel, hacia la grasa, pero no hacia la carne que está abajo.", "Precalentar el horno a 220C / 425F / Gas 7.", "Picar las hojas de romero, las semillas de hinojo, la pimienta, la ralladura de limón y la sal. Frote todo el cerdo con el aceite de girasol antes de frotar la mezcla de hierbas y sal en la piel, empujándola entre las líneas marcadas. Coloque el cerdo en una rejilla, colóquelo en una lata de asar, con el lado de la piel hacia arriba y cocínelo durante 35-40 minutos o hasta que la piel comience a hincharse y crujiente en los bordes.", "Mientras tanto, prepara el hinojo. Retire los tallos del hinojo y deje a un lado las hojas plumosas. Corta la bombilla en finas cuñas. Aplanar el ajo y quitar la cáscara, dejando los dientes enteros.", "Retire la barriga de cerdo del horno y baje el horno a 160 ° C / 300 ° F / Gas 2. Levante la parrilla de la lata de asar y agregue el hinojo, el ajo y el vino blanco a la grasa de cerdo en la lata de asar y revuelva para cubrir. Coloque la parrilla de nuevo en la parte superior. Regrese la carne de cerdo y el hinojo al horno y tápelo durante una hora más a 160 ° C / 300 ° F / Gas 2.", "Retire el hinojo del horno, cuando esté tierno y dorado (esto tomará aproximadamente 30-40 minutos). Exprime un poco de jugo de limón, luego cúbrelo y déjalo a un lado en un lugar cálido.", "Para terminar el cerdo, vuelva a encender el horno hasta 200C / 400F / Gas 6. Cocine el cerdo por otros 20 minutos o hasta que la piel esté muy crujiente. Cortar la panceta de cerdo y servir el hinojo al lado, salpicar sobre las hojas de hinojo reservadas picadas para adornar."], "url": "www_bbc_co_uk_food_recipes_how_to_cook_pork_belly_03291", "title": "Cómo cocinar el vientre de cerdo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_pork_belly_03291_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina natural, más extra para extender", "½ cucharadita de sal fina", "250g / 9oz de mantequilla sin sal, fría pero no dura como la piedra (o puede usar media manteca, media manteca de cerdo)", "150 ml / ¼ pinta de agua helada", "1 huevo de gallinas camperas, batido, para esmaltar", "1 kg / 2lb filete de estofado de 4oz, cortado en piezas del tamaño de una caja de cerillas", "3 cucharadas de harina común", "3 cucharadas de aceite de oliva", "300ml / ½ pinta brown ale", "2 dientes de ajo, picados", "2 cebollas, más o menos picadas", "250 g / 9 oz de zanahorias, más o menos picadas", "2 palitos de apio, más o menos picados", "1 hoja de laurel", "puñado de ramitas de tomillo fresco", "300ml / ½ pinta de caldo de buey de buena calidad", "1 cucharada de puré de tomate", "1 cucharada de vinagre balsámico", "500g / 1lb 2oz de castaño o champiñones blancos, cortados a la mitad o cortados en cuartos si son grandes", "botón de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para la masa, tamice la harina y la sal en un tazón grande para mezclar, luego ponga en el refrigerador por unos minutos para enfriar. (Mantener fría la harina y el recipiente le ayudará a obtener un mejor resultado más adelante y a crear capas o pasteles agradables).", "Mientras tanto, corta la mantequilla en cubos pequeños. Con un cuchillo de hoja redonda, revuélvelo en el recipiente hasta que cada pieza esté bien cubierta con harina. Vierta en el agua, luego, trabajando rápidamente, use el cuchillo para unir todo en una masa áspera.", "Reúna la masa en el recipiente con una mano, luego gírela a la superficie de trabajo. Aplastar la masa en una salchicha plana y gruesa, sin amasar. Envuelva la película adhesiva y luego déjela enfriar en la nevera durante 15 minutos.", "Enharinar ligeramente la superficie de trabajo y la masa. Estire la masa en una dirección hasta que tenga alrededor de 1 cm de grosor y tres veces más que anchura, o aproximadamente 45x15 cm / 18x6 pulgadas. Enderezar los lados con las manos una y otra vez, y tratar de mantener los bordes superior e inferior lo más cuadrados posible.", "Dobla el tercio inferior de la masa hacia arriba, luego el tercio superior hacia abajo, para hacer un bloque de aproximadamente 15x15 cm / 6x6 pulgadas. No importa si la masa no es exactamente del tamaño correcto, lo importante es que las esquinas sean cuadradas.", "Gire la masa de modo que su borde abierto quede hacia la derecha, como un libro. Presione los bordes de la masa juntos utilizando el rodillo.", "Estirar y doblar la masa nuevamente, repitiendo esto cuatro veces para hacer una masa suave, con vetas mantecosas aquí y allá. Si la masa se siente grasosa en algún punto, o comienza a brotar cuando se enrolla, cúrela y déjela enfriar durante 10 minutos antes de continuar. Enfríe el pastel terminado durante una hora, o idealmente durante la noche, antes de usarlo.", "Para el relleno, mezcle la carne con la harina y un poco de sal y pimienta. Una manera fácil de hacerlo sin ensuciar demasiado es poner todo en una bolsa de comida grande, sellar y luego agitar bien.", "Caliente una cucharada de aceite en una cazuela grande a prueba de calor hasta un fuego medio, luego agregue la mitad de la carne, sacuda el exceso de harina y mantenga los trozos bien espaciados para que fríen en lugar de sudar. Brown durante unos 10 minutos, hasta que se dore por todas partes.", "Transfiera el primer lote de carne a un recipiente, luego agregue un chorrito de cerveza o agua marrón a la sartén y retire cualquier trozo de carne. Incline el líquido en el tazón de carne. Limpie la sartén, agregue una cucharada de aceite y dore la segunda tanda de carne. Cuando la carne esté dorada, transfiérela al tazón y déjela a un lado.", "Agregue la cuchara final de aceite a la sartén y caliente suavemente. Agregue el ajo, las cebollas, las zanahorias, el apio y las hierbas a la sartén y fría por unos minutos, hasta que se ablanden.", "Pon la carne de nuevo en la sartén. Vierta el caldo y la cerveza marrón, luego agregue el puré de tomate y el vinagre balsámico. Si es necesario, agregue un poco más de caldo o agua caliente para asegurarse de que la carne esté cubierta de líquido (esto evitará que la carne se seque). Llevar a ebullición, luego cubrir y hervir a fuego lento el guiso durante 1-1½ horas hasta que la carne esté casi tierna y la salsa se haya espesado. Dejar de lado para enfriar, de la noche a la mañana si es posible.", "Derrita la mantequilla en una sartén grande, luego agregue los champiñones. Sazonar con sal y pimienta negra recién molida, luego freír a fuego alto durante 5 minutos, o hasta que estén doradas. Mezcle con el relleno del pastel enfriado y agréguelo al plato para pastel.", "Para preparar el pastel, precaliente el horno a 200C / Fan 180C / Gas 6. Incorpore la superficie de trabajo, luego extienda la masa al grosor de dos monedas de 1 £ y lo suficientemente ancha como para cubrir un plato de tarta de tamaño familiar con un poco de exceso. Cepille el borde del plato para pastel con un poco de agua o huevo batido.", "Usa un cuchillo filoso para cortar la masa y que se ajuste a la parte superior del plato; si es demasiado grande, no importa. Levante la parte superior del pastel, colocando la masa sobre un rodillo para levantarlo. Presione hacia abajo suavemente para sellar.", "Sosteniendo la cuchilla horizontalmente, haga un borde modelado presionando suavemente alrededor del borde de la masa (esto ayudará a que las capas en la masa se hinchen).", "Corta un par de hendiduras en la parte superior del pastel para liberar vapor. Cepille la parte superior de la tarta con el huevo batido, teniendo cuidado de evitar poner huevos en los bordes de la masa ya que pegará las capas entre sí. Enfríe por 10 minutos, o hasta que la masa esté firme. Hornee por 30 minutos, o hasta que el relleno esté burbujeante y la masa esté dorada e hinchada por completo."], "url": "www_bbc_co_uk_food_recipes_how_to_cook_steak_and_15585", "title": "Cómo hacer un pastel de carne y cerveza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4 a 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_steak_and_15585_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de venado 500 g / 1 libra 2 oz, a temperatura ambiente", "3 cucharadas de aceite vegetal", "sal y pimienta negra recién molida", "300g / 10½oz de judías verdes finas", "100g / 3½ oz bagcress, o una mezcla de hojas de pimienta", "½ chalota, finamente rebanada", "puñado de nueces, rotas aproximadamente", "1 cucharada de aceite de nuez", "1 cucharadita de mostaza inglesa en polvo", "1 nuez en escabeche, finamente rebanada, más 2 cucharaditas de jugo del tarro", "1 pepinillo, picado", "¼ cucharadita de pimienta negra recién molida", "1 cucharadita de salsa Worcestershire", "1 ramita de estragón, hojas recogidas", "½ cucharadita de vinagre de vino tinto"], "method": ["Con un cuchillo muy afilado, corte los tendones plateados que se extienden a lo largo del filete.", "Frote la carne de venado con una cucharada de aceite vegetal, luego sazone generosamente con sal y pimienta negra recién molida. Calentar una sartén grande de base pesada hasta que esté muy caliente, y luego dorar el filete por todos lados hasta que esté dorado oscuro en el exterior (esto tomará aproximadamente dos minutos). Luego reduzca el fuego a bajo y fríalo suavemente, volteándolo regularmente, durante 6-8 minutos o hasta que esté cocido a su gusto.", "Transfiera la carne de venado a una tabla, cúbrala muy ligeramente con un trozo de papel de aluminio y déjela reposar durante unos minutos mientras prepara el aderezo. Agregue una cucharada más o menos de agua a la sartén caliente, y retire cualquier trozo dorado de la sartén con una cuchara de madera. Dejar de lado para enfriar.", "Para la ensalada, recorte el tallo de las judías verdes. Ponga a hervir una olla de agua con sal, luego cocine los frijoles por cinco minutos o hasta que estén tiernos. Escúrralos, enfríelos con agua corriente fría (para que mantengan el color verde brillante), luego drene nuevamente, seque y séquelos.", "Para el aderezo, en un tazón pequeño mezcle el polvo de mostaza, el jugo de nuez en vinagre, el pepinillo, la pimienta negra y la salsa Worcestershire junto con los jugos de la bandeja de carne. Picar la mitad de las hojas de estragón y agregar al aderezo con el vinagre de vino tinto.", "Tallar la carne de venado en rodajas en diagonal. Agregue cualquier jugo de la carne al aderezo. Esparza los frijoles, el berro, la nuez en escabeche, la chalota y las nueces sobre cuatro platos, cubra con la carne de venado y cubra con una cuchara el aderezo. Rocíe con aceite de nuez y sazone al gusto con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_how_to_cook_venison_11210", "title": "Cómo cocinar venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_venison_11210_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva virgen extra, más más para servir", "5 dientes de ajo, en rodajas finas", "2 cucharadas de puré de tomate", "4 x 400 g de tomates cortados en ciruela", "1 cucharada de azúcar en polvo", "gran manojo de albahaca fresca, finamente picado", "sal y pimienta negra recién molida", "2 salchichas de cerdo herby por persona", "1 cucharadita de aceite de oliva, para freír", "¼ cucharadita de chiles molidos secos por persona (opcional)", "espagueti, cocinado de acuerdo con las instrucciones del paquete", "parmesano recién rallado, para servir", "1 cucharada de mascarpone por persona", "espagueti, cocinado de acuerdo con las instrucciones del paquete", "hojas de albahaca, para servir"], "method": ["Para la salsa de tomate básica, caliente el aceite en una cacerola amplia o una sartén grande, luego agregue el ajo y los tallos de albahaca y chisporroteando durante 1 minuto, sin colorearlos. Agregue el puré de tomate.", "Incline los tomates picados y el azúcar, luego sazone con una cantidad generosa de sal y pimienta. Cocine a fuego lento durante 5 minutos hasta que la salsa sea rica y espesa. Agregue las hojas de albahaca justo antes del final.", "Para la variación de albóndigas de salchicha, corte la piel de salchicha y exprima la carne de las salchichas, pellizcándola en pequeñas albóndigas a medida que las aprieta.", "Caliente el aceite en una sartén antiadherente, luego agregue las albóndigas de salchicha y fría por 10 minutos o hasta que se dore por todas partes y se cocine completamente. Sazonar con los chiles. Agregue un poco de salsa de tomate y luego cocine a fuego lento. Agregue la pasta cocida a la salsa y revuelva para cubrirla con la salsa. Agregue 2 cucharadas de agua de la pasta para adelgazar la salsa. Sirva con parmesano recién rallado.", "Para la variación cremosa de salsa de mascarpone, mezcle el mascarpone en la salsa de tomate hasta que se derrita. Agregue la pasta cocida para cubrirla en la salsa. Agregue dos cucharadas de agua de la pasta para adelgazar la salsa. Sazone al gusto y sirva salpicado de hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_how_to_make_a_tomato_07153", "title": "Cómo hacer una salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8 porciones", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_a_tomato_07153_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 calabacines medianos", "Lanzas de espárragos de 200g / 7oz", "8 huevos grandes", "sal y pimienta negra recién molida", "puñado de eneldo fresco, aproximadamente picado", "1 cucharada de aceite de oliva virgen extra, más un poco de llovizna para terminar", "1 diente de ajo", "racimo de cebollas", "100g / 3½oz de queso de cabra redondo", "½ limón sin cebar, solo cáscara"], "method": ["Precaliente la parrilla a alta (250-275C / 480-520F). Cortar los calabacines en cuartos a lo largo y cortar en trozos pequeños. Cortar los espárragos en longitudes cortas, descartando los últimos 5 cm / 2 pulgadas de cada tallo.", "Batir los huevos con un poco de sal y pimienta y la mayor parte del eneldo.", "Calentar el aceite en una sartén mediana, de aproximadamente 23 cm, y freír el calabacín a fuego alto durante dos minutos para ablandarlos, revolviendo con frecuencia. Agregue los espárragos y cocínelos durante dos minutos, hasta que estén verdes y tiernos y el calabacín esté dorado aquí y allá.", "Mientras tanto, aplastar el ajo y cortar finamente las cebolletas. Corta el queso en trozos pequeños.", "Agregue el ajo y dos tercios de las cebollas de primavera a la sartén, ralle la mayor parte de la ralladura de limón, freír durante un minuto, luego vierta los huevos y esparza la mitad del queso.", "Con la sartén a fuego medio, cocine la tortilla lentamente, revolviendo suavemente para permitir que el huevo que gotea en la parte superior se encuentre con el calor de la sartén. El huevo comenzará a ponerse como cintas. Cuando el huevo esté suavemente colocado completamente, y ligeramente mocoso en la parte superior, retírelo del fuego.", "Esparza la tortilla con el resto de las cebollas y el queso, luego ase a la parrilla durante dos minutos o hasta que se dore.", "Termine con el resto del eneldo y la ralladura de limón, y un chorrito de aceite de oliva virgen extra de su agrado, luego sirva en trozos."], "url": "www_bbc_co_uk_food_recipes_how_to_make_an_omelette_22250", "title": "Cómo hacer una tortilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_an_omelette_22250_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paquete de 375g / 13oz listo dulce hecho de lácteos dulces con mantequilla", "4-6 manzanas Bramley (aproximadamente 800 g / 1 lb 12 oz)", "1 cucharada de jugo de limón", "1½ cucharada de harina común", "½ cucharadita de canela molida", "½ cucharadita de nuez moscada recién rallada", "100 g / 3½ oz de azúcar en polvo de oro, más un poco más para rociar", "50g / 2oz pasas o sultanas, o moras frescas (opcional)", "Harina normal de 85g / 3oz", "pizca de sal fina", "85g / 3oz de mantequilla sin sal, cortada en cubos pequeños", "4 cucharadas de azúcar en polvo", "puñado avena avena (opcional)"], "method": ["Cubra ligeramente la superficie de trabajo con harina, luego extienda la masa de pasta hasta que esté a unos 3 cm / 1½ pulgadas más grande que la placa de tarta.", "Voltea la masa sobre el rodillo y luego levanta la masa sobre el plato o la lata. Presiónalo en la lata, luego corta el borde con un cuchillo afilado. Enfríe la masa mientras hace el relleno.", "Precaliente el horno a 190C / 375F / Gas 5 y coloque una bandeja para hornear en el estante del medio.", "Para la cobertura de crumble, tamice la harina y la sal en un tazón grande, luego agregue la mantequilla. Frota la mantequilla en la harina con las puntas de los dedos hasta que la mezcla parezca pan rallado áspero.", "Agregue el azúcar y, si lo desea, un puñado de avena. Enfríe la cobertura de crumble en la nevera mientras prepara las manzanas.", "Pele las manzanas, córtelas por la mitad, luego en rebanadas gruesas, cortando el núcleo sobre la marcha. Mezcle las rodajas de manzana con el jugo de limón en un tazón grande.", "Tamice la harina, la canela y la nuez moscada y mezcle bien para cubrir. Incline el azúcar, reserve algo para el relleno, y agregue las pasas o la fruta, si las usa. Mezclar bien.", "Acumula las manzanas en la lata revestida de hojaldre, espolvorea con la mezcla de crumble y luego una última cucharada de azúcar. (Parecerá estar lleno pero se reducirá y se asentará durante la cocción.) Hornee el pastel durante 30 minutos, o hasta que la masa y el crumble estén dorados y crujientes. Sirva caliente con crema o helado."], "url": "www_bbc_co_uk_food_recipes_how_to_make_apple_59768", "title": "Pastel de manzana fácil crumble", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_apple_59768_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla sin sal", "Galletas digestivas 200 g / 7 oz", "150g / 5½ oz de luz mascabado o azúcar morena suave", "150g / 5½oz de mantequilla sin sal", "1 x 397 g puede leche condensada", "pellizcar copos de sal marina", "2 plátanos maduros", "150ml / ¼ pt doble o crema batida", "100g / 3½oz barra de chocolate con leche, rallado"], "method": ["Haga la base de galletas primero. Derrita la mantequilla en una sartén de tamaño mediano. Coloca los bizcochos en una bolsa de comida y aplasta con un rodillo, o llévalos hasta que queden bien en un procesador de alimentos.", "Incline las migas de galleta en la mantequilla derretida hasta que estén bien cubiertas. Vierta la mezcla en el centro de una lata agria de fondo suelto de 23 cm / 9 pulgadas. Luego presione la mezcla firmemente sobre la base del estaño y los lados. Transfiera la base al refrigerador para enfriar durante aproximadamente 30 minutos, hasta que esté firme.", "Mientras la base se enfría, haz el caramelo. Caliente el azúcar moreno y la mantequilla juntos en una sartén a fuego medio hasta que la mantequilla se derrita y el azúcar se haya disuelto. Al principio, el azúcar y la mantequilla no se mezclarán, sino que seguirán removiendo. A medida que el azúcar se derrita, se unirá.", "Agregue la leche condensada y los copos de sal marina. Llevar a ebullición, luego quitar el fuego.", "Saque la base de galletas del frigorífico y vierta el caramelo sobre la base de galletas. Transferir a la nevera y dejar enfriar por completo.", "Cuando esté listo para servir, corte los plátanos y póngalos sobre el caramelo. Vierta la crema en un tazón grande, y látigo con batidores de mano eléctricos hasta que se espese, pero no rígido. Cucha la crema sobre los plátanos.", "Ralla el chocolate sobre la parte superior del pastel.", "Retire la tarta de la lata de tarta, colocando la lata en la parte superior de un tazón hacia arriba, y luego deslice el borde de la lata hacia abajo. Mueva el bol fuera del camino, luego deslice el pastel de banoffee de la base de lata y sobre una tabla o placa. Ahora está listo para servir."], "url": "www_bbc_co_uk_food_recipes_how_to_make_banoffee_pie_35961", "title": "Cómo hacer un pastel de banoffee", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_banoffee_pie_35961_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids)", "150 g / 5½ oz de mantequilla sin sal, más extra para engrasar la lata", "100 g / 3½ oz de leche o chocolate blanco, o una mezcla de ambos", "125g / 4½oz de azúcar moreno oscuro", "125 g / 4½ oz de azúcar en polvo de oro", "4 huevos de gallinas camperas, a temperatura ambiente", "Harina normal de 85g / 3oz", "2 cucharadas de cacao en polvo, más un poco extra para quitar el polvo, si quieres", "¼ cucharadita de sal fina"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque una olla mediana que contenga una pulgada de agua hirviendo del hervidor sobre la placa y cocine a fuego lento.", "Mientras tanto, use un poco de mantequilla para engrasar el interior de una bandeja para hornear cuadrada de 23 cm. Corta un cuadrado de pergamino para hornear un poco más grande que tu lata (aproximadamente 27 cm). Corte un corte de 5 cm / 2 pulgadas en diagonal desde las esquinas hacia el centro. Empuje el papel en la lata y coloque cuidadosamente el papel en las esquinas: se superpondrán ligeramente. Recorte si es necesario.", "Con un cuchillo grande y afilado, corta el chocolate negro en trozos pequeños (cuanto más pequeñas sean las piezas, más rápido se derretirá). Coloque el chocolate negro picado con la mantequilla en un tazón grande que se sentará en la parte superior de la olla de agua hirviendo a fuego lento.", "Coloque el recipiente sobre la fuente de agua hirviendo a fuego lento, asegurándose de que el fondo del recipiente no toque el agua. Mantenga el calor bajo: el agua no debe hervir furiosamente debajo, sino burbujear en silencio. Después de unos minutos, el chocolate y la mantequilla comenzarán a derretirse. Revuelva de vez en cuando, hasta que el chocolate se derrita en su mayor parte. Retire el recipiente de la sartén y déjelo a un lado. El calor residual en el chocolate terminará el proceso de fusión.", "Mientras el chocolate se derrite, pique el chocolate blanco (o blanco y la leche) en pedazos más grandes, del tamaño de un centavo. Pon estos a un lado.", "Bata el azúcar en el chocolate derretido, luego agrega los huevos y mezcle bien hasta que la mezcla esté ligeramente burbujeante.", "Tamiza la harina, el cacao en polvo y la sal en un recipiente aparte. Con una cuchara grande de metal, agregue la mezcla de harina en la mezcla de chocolate un tercio a la vez, y dóblela suavemente en la mezcla de chocolate hasta que esté bien combinada.", "Vierta suavemente la mezcla en la lata preparada y esparza los trozos restantes de chocolate encima. Hornee los brownies por 20-25 minutos. Los brownies todavía se tambalean ligeramente en el medio, ya que continuarán cocinando por un momento cuando se retiren del horno. Un brownie sobre-horneado es seco y desmenuzable, en lugar de húmedo y esponjoso, así que vigílelos.", "Deje que los brownies se enfríen completamente en su lata. Sácalos de la lata en un tablero, utiliza el papel de hornear para ayudar, luego corta en cuadrados. Tamice un poco de azúcar glas o cacao en polvo. Almacenar en una lata hermética."], "url": "www_bbc_co_uk_food_recipes_how_to_make_brownies_14648", "title": "Cómo hacer brownies", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 - 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_brownies_14648_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla sin sal", "Galletas digestivas 250 g / 9 oz", "3 huevos y 2 yemas de huevo, a temperatura ambiente", "1 vaina de vainilla (o 1 cucharadita de pasta de vainilla)", "Queso crema 900g / 2lb, a temperatura ambiente", "200 g / 7 oz de azúcar en polvo de oro", "Crema de grasa entera de 300ml / ½ pinta", "Fresas de 200g / 7oz", "25g / 1oz de azúcar glas"], "method": ["Derrita la mantequilla en una cacerola mediana sobre un calor suave. Cepille un poco de la mantequilla derretida alrededor de la base y los lados de una lata con forma de resorte de 23 cm / 9 pulgadas, luego forre la base con un círculo de pergamino para hornear.", "Coloque los bizcochos en una bolsa grande y sellable, exprima el aire y selle la parte superior. Use un rodillo, o una botella, para triturar las galletas en migas finas.", "Revuelva las migas en la mantequilla derretida hasta que estén completamente combinadas. Presione las migas en la lata. Usa la parte posterior de la cuchara para compactar las migas tanto como puedas en una capa uniforme. Póngalo en la nevera para que se endurezca mientras prepara la tarta de queso, aproximadamente 30 minutos - 1 hora.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para separar los huevos, tiene tres cuencos pequeños listos, preferiblemente vidrio o cerámica. Agriete suavemente la cáscara contra el costado de un tazón pequeño. Lentamente jale la carcasa lo más limpiamente posible a lo largo de la grieta, inclinando la yema en la mitad del caparazón. Deje que el blanco se escurra en el recipiente de abajo. Deja caer la yema en otro tazón pequeño. Separe el siguiente huevo sobre un tercer tazón, de esa manera si accidentalmente rompe la yema, no contaminará los blancos limpios. (Las claras de huevo se mantendrán durante una semana en la nevera y se pueden batir para aclarar las tortitas).", "Corta la vaina de vainilla longitudinalmente y raspa las semillas con el lado romo de tu cuchillo. Raspe las semillas de su cuchillo (o cuchara la pasta de vainilla) en un tazón grande con el queso crema. Batir el queso y la vainilla con una cuchara de madera o un mezclador de mano hasta que quede suave.", "Agregue el azúcar, luego bata nuevamente hasta que quede suave. Ahora agregue los huevos y las yemas, uno a la vez, seguido por la mitad de la crème fraîche.", "Cuando la base esté bien fría, envuelva la parte exterior de la lata en dos hojas de papel de aluminio ancho. Asegúrese de que la lámina cubra los lados de la lata más de la mitad, luego coloque la lata envuelta en una lata de asar profunda. Cuchara en el relleno de tarta de queso y alisar la parte superior.", "Hervir una tetera llena de agua. Luego coloque la lata de asar con la tarta de queso en el estante superior del horno. Vierta el agua caliente de la tetera en la lata de asar alrededor de la tarta de queso para que llegue hasta la mitad de los lados y deslice con cuidado la lata en el horno. Hornee por 10 minutos a 180C / 350F / Gas 4, luego baje el horno a 140C / 275F / Gas 1 y cocine por otros 40-50 minutos hasta que la tarta de queso esté lista, con un leve bamboleo en el medio.", "Apague el horno y deje que la tarta de queso se enfríe en el horno, con la puerta entreabierta. Cuando esté frío, retíralo del horno y enfría bien. Enfriar la tarta de queso lentamente ayudará a evitar que se agriete la parte superior.", "Para la salsa de fresa, coloque la mitad de las fresas en un procesador de alimentos o licuadora, agregue el azúcar glas y luego pulse hasta que quede suave. Corta las fresas restantes y reserva.", "Aproximadamente media hora antes de que desee comer la tarta de queso, retírela del refrigerador. Barrer una espátula entre la torta y el lado de la lata, luego soltar con cuidado la forma de resorte. Transfiera la tarta de queso a un plato de servir. Extienda la crème fraîche restante sobre la superficie de la tarta de queso, esto cubrirá cualquier grieta que pueda haber aparecido. Decore la parte superior con las fresas en rodajas, luego córtelas en rodajas y sirva con la salsa de fresa derramada."], "url": "www_bbc_co_uk_food_recipes_how_to_make_cheesecake_30383", "title": "Cómo hacer tarta de queso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_cheesecake_30383_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, a temperatura ambiente", "200ml / 7fl oz de aceite vegetal o de girasol, más un poco extra para la lata", "250 g / 9 oz de zanahorias ralladas gruesas", "100 g / 3½ oz pasas o sultanas", "Piezas de nogal de 100 g / 3½ onzas, más algunas adicionales para la decoración", "1 naranja, solo ralladura", "Harina de auto crianza de 200g / 7oz", "2 cucharaditas de especias mixtas", "1 cucharadita de bicarbonato de soda", "¼ cucharadita de sal fina", "200g / 7oz de azúcar mascabado ligero", "150 g / 5½ oz de mantequilla sin sal, a temperatura ambiente", "45 g / 3 cucharadas de azúcar en polvo", "300g / 10½oz de queso crema con alto contenido de grasa"], "method": ["Para la torta, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata honda de pastel redonda de 20 cm / 8 pulg. Con un pergamino para hornear.", "Rompe los huevos en un recipiente y bate ligeramente con un tenedor.", "Agregue el aceite vegetal a los huevos y bata de nuevo.", "Agregue las zanahorias ralladas, las pasas, las nueces y la ralladura de naranja.", "En un recipiente aparte, tamice la harina, la mezcla de especias, el bicarbonato de soda y la sal. Agregue el azúcar.", "Agregue la mezcla húmeda de zanahoria a los ingredientes secos y mezcle bien para combinar, asegurándose de que no haya bolsas de harina.", "Con una cuchara, coloque la masa para pasteles en la lata forrada y hornee en el estante del medio durante 1 - 1¼ horas, hasta que la torta se haya levantado y esté dorada por todas partes.", "Retire la torta del horno y déjela reposar en la lata para que se enfríe durante 10-15 minutos, luego gire la torta y déjela enfriar completamente en una rejilla.", "Mientras la torta se enfría, haga el glaseado. Coloque la mantequilla en un tazón grande con el azúcar en polvo, batir durante 2-3 minutos hasta que esté suave y cremoso, luego bata en el queso crema hasta que quede suave.", "Coloque la torta en un plato para servir o en un puesto para pasteles. Use una espátula o un cuchillo ancho y plano para extender el glaseado sobre la parte superior y los lados del pastel. Esparce más nueces en la parte superior. Ahora está listo para servir."], "url": "www_bbc_co_uk_food_recipes_how_to_make_carrot_cake_28928", "title": "Cómo hacer pastel de zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_carrot_cake_28928_16x9.jpg", "isVegetarian": true, "recommendations": 0}]