[{"ingredients": ["1 cebolla picada", "1 bulbo de hinojo, en rodajas", "100g / 3½oz de apio, en rodajas", "100 g / 3½ oz de zanahorias, en rodajas", "25g / 1 oz champiñones, lavados y en rodajas", "1 ramita de tomillo", "2¼ litros / 4 pintas de agua", "1kg / 2lb 4oz huesos de pescado plano (como solomillo, lenguado o solomillo) o filete (pregunte a su pescadero por los huesos)", "6 cucharadas de aceite de oliva", "4 dientes de ajo, finamente picados", "1kg / 2lb 4oz de tomates con sabor, pelados o 2 x 400 g de tomates picados", "sal y pimienta negra recién molida", "4 filetes John Dory", "50g / 1¾oz de harina natural", "2 cucharadas de aceite de oliva, más extra para servir", "1 limón, reducido a la mitad", "1 cucharadita de salsa Worcestershire", "2 pepinillos pequeños, finamente picados", "2 cucharadas de alcaparras, 1 cucharada finamente picada y 1 cucharada entera", "2 tomates, pelados, sin semillas y finamente picados", "3 cucharadas de salsa de tomate (ver arriba)", "250 ml / 9 fl oz de caldo de pescado (ver arriba)", "pequeño puñado de perejil, picado"], "method": ["Para el caldo de pescado, coloque todos los ingredientes, excepto los huesos de pescado en una sartén grande, llevar a ebullición, luego baje el fuego y cocine a fuego lento durante 20 minutos.", "Agregue los huesos de pescado (o filete de pescado) y vuelva a hervir a fuego lento, quitando cualquier espuma a medida que sube a la superficie. Cocine a fuego lento durante 20 minutos más. Cuele a través de un colador en un recipiente limpio y cocine a fuego lento un poco más, si es necesario, hasta que se reduzca a aproximadamente 1,2 litros / 2 pintas. Si no se usa inmediatamente, enfríe y refrigere o congele para un uso posterior.", "Para la salsa de tomate, caliente el aceite de oliva y el ajo en una cacerola. Tan pronto como el ajo comience a chisporrotear, agregue los tomates y cocine a fuego lento durante 15-20 minutos, separándolos mientras cocinan. Cocine hasta que la salsa se haya reducido y espesado, luego sazone con sal y pimienta. La salsa está lista para usar. Si no lo usa de inmediato, déjelo enfriar, luego refrigérelo por hasta una semana o congélelo para usarlo más adelante.", "Sazonar los filetes de John Dory con un poco de sal y pimienta y espolvorear ligeramente con harina. Calentar el aceite de oliva en una sartén, agregar los filetes con la piel hacia abajo y freír durante 2-3 minutos hasta que estén ligeramente dorados. Sazonar con un chorrito de jugo de limón, voltear el pescado y cocinar por un minuto más. Sacar de la sartén y mantenga caliente.", "Agregue la salsa Worcestershire, pepinillos, alcaparras enteras y picadas, tomates, salsa de tomate y caldo de pescado a la sartén, deje hervir y luego reduzca un poco para crear la salsa. Agregue el pescado cuidadosamente a la sartén por un minuto para que se caliente en la salsa.", "Sirva inmediatamente, rociado con un poco más de aceite de oliva y espolvoreado con perejil fresco."], "url": "www_bbc_co_uk_food_recipes_john_dory_alla_carlina_43959", "title": "John Dory alla carlina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "200 g / 7 oz de alcachofas de Jerusalén, peladas y picadas", "1 ramita de tomillo fresco, picado", "75ml / 2½fl oz de vino blanco", "300ml / ½ pinta de caldo de verduras", "sal y pimienta negra recién molida", "2 cucharadas de yogurt griego", "150ml / 5½fl oz de aceite vegetal, para freír poco", "¼ de puerro, finamente cortado en cerillas", "sal", "4 cucharadas de aceite de oliva", "½ limón, solo jugo", "pequeño puñado de hojas frescas de cohetes", "sal y pimienta negra recién molida"], "method": ["Para la sopa, caliente el aceite y la mantequilla en una cacerola y suavice suavemente la cebolla y el ajo durante 4-5 minutos. Agregue las alcachofas y el tomillo y continúe cocinando por 3-4 minutos. Agregue el vino blanco y reduzca por 2-3 minutos. Luego agregue el caldo y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento hasta que la alcachofa esté tierna, unos cinco minutos. Sazonar con sal y pimienta negra recién molida, y finalmente incorporar el yogur.", "Para los puerros crujientes, caliente el aceite en una sartén hasta que un pequeño cubo de pan se dore en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Cuando el aceite esté caliente, baje con cuidado el puerro en el aceite caliente, con una espumadera, y fríalo durante unos 30 segundos o hasta que comience a dorar. Retirar con la cuchara ranurada y escurrir sobre papel de cocina. Espolvorea con sal al gusto.", "Para el pesto de rúcula, coloque el aceite de oliva, el jugo de limón y el cohete en un bol. Usando una licuadora de mano, mezcle hasta que quede suave. Sazonar con sal y pimienta negra recién molida.", "Para servir, vierta la sopa en un tazón de servir, coloque los puerros en la parte superior y rocíe el pesto encima en un círculo."], "url": "www_bbc_co_uk_food_recipes_jerusalemartichokeso_88168", "title": "Sopa de alcachofas de Jerusalén con puerros crujientes y pesto de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cestones de fresas silvestres", "1-2 cucharadas de aceite de oliva", "1 puntarella (achicoria italiana), finamente picada", "sal y pimienta", "1.5kg / 3lb 5oz pequeñas habas, envasadas", "botón de mantequilla, para freír", "rociar aceite de oliva, para freír", "1 chalote, finamente picado", "Setas de mousseron 300 g / 10½ oz, limpiadas", "sal y pimienta", "4 filetes John Dory (aproximadamente 200 g / 7 oz cada uno)", "1 yema de huevo, batida", "200g / 7oz de pan blanco seco", "botón de mantequilla, para freír", "rociar aceite de oliva, para freír", "1 ramita de tomillo", "1 diente de ajo, aplastado y dejado entero", "sal y pimienta", "Berro de berro, lechuga berro, bergamota berro, berro de flor de manzana, para adornar"], "method": ["Para el aderezo, reserve alrededor de 12 de las más bellas fresas y machaque las otras con un poco de aceite de oliva. Agregue la puntarella picada y mezcle.", "Para las verduras, pula los frijoles en una olla pequeña de agua hirviendo durante 2 minutos y luego drene. Cuando se enfríe lo suficiente como para manejarlo, saque los granos de sus pieles de cuero apretando suavemente. Desecha las pieles.", "Para los peces, cepille el lado sin piel de cada filete con huevo batido. Cubra el mismo lado con migas de pan.", "Caliente un poco de aceite y mantequilla en una sartén grande con ajo y tomillo (puede que necesite usar dos sartenes). Freír el pescado con el lado empanado hacia abajo. Cocine por 6 minutos a fuego lento. Sazone el pescado con sal y pimienta.", "Mientras tanto, caliente un poco de mantequilla y aceite en una olla grande. Suavemente fríe los chalotes por 2 minutos y luego agregue los champiñones mousseron y las habas. Cocine por 4 minutos a fuego medio. Condimentar con sal y pimienta.", "Para servir, divida las verduras entre los platos para servir, coloque suavemente el pescado encima y agregue el aderezo a un lado. Adorne con las fresas reservadas y los berros."], "url": "www_bbc_co_uk_food_recipes_john_dory_mousseron_78446", "title": "John Dory, setas mousseron, habas y fresas silvestres", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas rojas, finamente cortadas usando una mandolina", "16 lanzas de espárragos, partes de madera eliminadas, cortadas en rodajas finas usando una mandolina", "4 chiles rojos, partidos por la mitad, sin semillas, en rodajas finas", "1 naranja", "4 x John Dory, aproximadamente 500 g / 1 lb 2 oz cada uno, eviscerado, fileteado y despellejado", "sal marina y pimienta negra recién molida", "4 cucharadas de verjuice (disponible en línea)", "4 cucharadas de aceite de oliva", "1 cucharada de mostaza Dijon", "1 cucharada de miel", "2 cucharadas de hojas de cilantro picado", "2 cucharadas de hojas de menta picadas"], "method": ["Precalentar la parrilla a alto.", "Coloque la cebolla roja, los espárragos y los chiles en un tazón grande. Rallar finamente la ralladura de la naranja y agregar a la ensalada. Corte la cáscara y la médula (parte blanca) de la naranja y corte los segmentos de entre las membranas; agregue a la ensalada y mezcle para combinar.", "Sazonar todo el pescado con sal y pimienta, luego poner en la bandeja de la parrilla. Coloque debajo de la parrilla por 3 minutos, luego voltee los filetes y cocine el otro lado por 3 minutos.", "Mientras tanto, para el aderezo, mezcle los ingredientes en un bol y sazone con sal y pimienta. Justo antes de servir agregue la mitad del aderezo a la ensalada de espárragos y mezcle ligeramente. Pruebe y agregue más aderezo si es necesario.", "Para servir, divida la mayor parte de la ensalada entre platos calientes. Coloque un filete de pescado a la parrilla encima, coloque la ensalada restante sobre el pescado y rocíe sobre el aderezo reservado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_john_dory_with_52995", "title": "John Dory con ensalada de espárragos, chile y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pinta de aceite vegetal, para freír", "6 calabacines grandes", "500ml / 18fl oz de leche fría", "500g / 1lb 2 oz de harina natural, condimentada con sal y pimienta", "gran pizca de sal fina", "aceite de oliva virgen extra, para freír", "4 x filetes de John Dory", "1 diente de ajo, en rodajas finas", "1 gran puñado de hierbas mixtas (menta, eneldo, albahaca y salvia), finamente picadas", "50ml / 2fl oz de caldo de pescado", "70ml / 2½fl oz de jugo de limón", "70ml / 2½fl oz de jugo de naranja", "1 pequeño puñado de granos de pimienta rosa y verde", "1 naranja pequeña, cortada en rodajas (opcional)", "sal marina escamosa y pimienta negra molida"], "method": ["Para las patatas fritas con zucchini, agregue el aceite a una freidora y caliente a 190 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida).", "Mientras tanto, corte los calabacines a lo largo con una mandolina para crear tiras de 4 mm de espesor.", "Cuidadosamente draga las cuerdas del calabacín en la leche y agita en la harina sazonada para cubrir ligeramente.", "Baje las papas fritas en la freidora y cocine por 3 minutos o hasta que estén doradas. Retire con una espumadera y déjelo escurrir sobre papel de cocina. Espolvorear con sal fina y mantener caliente hasta que esté listo para servir.", "Mientras tanto, para el John Dory, vierta un generoso chorro de aceite de oliva en una sartén grande y poco profunda con tapa. Con cuidado agregue los filetes de John Dory con la piel hacia abajo con el ajo y una pizca de sal y pimienta. Esparce las hierbas picadas sobre el pescado y coloca la sartén a fuego medio. Cuando la sartén comience a chisporrotear, agregue el caldo, el jugo de limón y el jugo de naranja y cubra con una tapa. Después de no más de 4 minutos, quite los filetes y colóquelos en platos calientes.", "Encienda el fuego, agregue los granos de pimienta y hierva los jugos hasta que el volumen de líquido comience a reducirse (aproximadamente 2 minutos). Quite el fuego y vierta los jugos reducidos en los filetes de John Dory. Adorne cada filete con una rodaja de naranja, si está usando, y sirva con las papas fritas del calabacín al costado.", "Para servir, coloque el John Dory en un plato para servir y las papas fritas a un lado."], "url": "www_bbc_co_uk_food_recipes_john_dory_with_courgette_44843", "title": "John Dory con patatas fritas con calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas nuevas de 400 g / 14 oz, cortadas en rodajas de 2,5 cm / 1 in, precocidas", "2 cucharadas de aceite de oliva", "200 g / 7 oz de harina", "sal y pimienta negra recién molida", "4 filetes John Dory", "50g / 1¾oz de mantequilla", "½ limón, solo jugo", "2 bulbos de hinojo, en rodajas finas, (separados en un recipiente con agua helada)", "2 naranjas, peladas, segmentadas, jugo reservado", "2 cucharaditas de alcaparras para bebés, escurridas", "1 manojo de eneldo fresco picado", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "8 anchoas saladas, cortadas por la mitad a lo largo", "4 cucharaditas de bayas de alcaparra"], "method": ["Coloque las papas sancochadas en un tazón con aceite de oliva y sazone al gusto con sal y pimienta negra recién molida. Revuelva hasta que esté bien combinado.", "Caliente una sartén a fuego medio hasta que esté caliente. Agregue las papas en lotes y cocínelas durante cuatro minutos por cada lado o hasta que estén tiernas y doradas en ambos lados. Sacar de la sartén y mantenga caliente. Repita el proceso con los lotes restantes de papas.", "Espolvorea la harina en un plato. Sazonar con sal y pimienta negra recién molida. Espolvorea el John Dory en la harina sazonada.", "Calienta la mitad de la mantequilla en una sartén a fuego medio hasta hacer espuma y freír el John Dory durante tres minutos por cada lado o hasta que el pescado esté recién cocido (hazlo en tandas si es necesario). Agregue la mantequilla restante y el jugo de limón a la sartén y cocine por otro minuto, rociando el pescado con la mezcla de limón y mantequilla.", "Para la ensalada de hinojo y alcaparras, escurra bien el hinojo y colóquelo en un tazón grande con los segmentos de naranja. Agregue las alcaparras y un tercio del eneldo. Revuelva hasta que esté bien combinado.", "Para hacer el aderezo, coloque el jugo reservado de las naranjas en un recipiente pequeño y agregue el aceite, el vinagre de vino blanco y el eneldo restante. Batir hasta que esté bien combinado. Rocíe el aderezo sobre la ensalada de hinojo y naranja y mezcle bien.", "Para servir, coloque un filete John Dory en cada uno de los cuatro platos para servir. Coloque las papas y la ensalada de naranja e hinojo al lado y adorne con los filetes de anchoa y las bayas de alcaparras."], "url": "www_bbc_co_uk_food_recipes_johndorywithorangefe_92735", "title": "John Dory con ensalada de naranja, hinojo y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva o vegetal", "2 cebollas grandes, en rodajas", "2 x 400g / 14oz latas de tomates ciruela", "1 pimiento rojo, cortado en cubitos", "4 cucharadas de puré de tomate", "¼ cucharadita de pimienta de cayena o chile en polvo", "1 cucharadita de curry en polvo", "1 hoja de laurel", "ramita de tomillo fresco", "1 cubo de acciones", "225 g / 8 oz de grano largo o arroz basmati", "sal y pimienta negra recién molida", "2 plátanos, cortados en rodajas y fritos", "Ensalada de hojas verdes"], "method": ["Para el arroz, caliente el aceite en una sartén grande y cocine las cebollas a fuego lento hasta que estén translúcidas.", "Agregue los tomates enlatados, el pimiento rojo y el puré de tomate, y sazone con sal, pimienta negra recién molida y la pimienta de cayena o chile. Agregue el polvo de curry, la hoja de laurel y el tomillo, luego vierta en 550 ml / 19 fl oz de agua y desmenuzar en el cubo de valores.", "Cubra y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 20-30 minutos.", "Enjuague bien el arroz para eliminar el exceso de almidón y luego agréguelo a la mezcla de tomate.", "Llevar a ebullición, luego reduzca el fuego a bajo. Cubra y cocine a fuego lento durante 25-30 minutos, o hasta que el arroz esté cocido.", "Sazone al gusto con sal y pimienta negra recién molida y sirva el joffol con plátanos fritos y una ensalada verde crujiente."], "url": "www_bbc_co_uk_food_recipes_jollof_rice_with_fried_79619", "title": "Jollof arroz con plátanos fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jollof_rice_with_fried_79619_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz de mantequilla", "10 cebollas, picadas", "2.25kg / 5lb taza de champiñones cerrados, en rodajas", "200 g / 7 oz de harina", "2.8 litros / 5 pintas de leche", "2,8 litros / 5 pintas de caldo de pollo", "sal marina y pimienta negra recién molida", "Pollo de 2.7kg / 6lb - cortado en cubos de 2.5cm / 1in", "10 cucharadas de perejil fresco picado, más extra para decorar"], "method": ["Derretir 100 g / 4 oz de la mantequilla en una sartén muy grande y freír los trozos de pollo hasta que estén dorados. Retire el pollo con una espumadera y transfiéralo a un plato grande. Tendrá que hacer esto en lotes.", "En la misma sartén, derretir 200 g / 8 oz de mantequilla y freír la cebolla suavemente hasta que esté suave pero no dorada. Agregue la mitad de los champiñones a la sartén, fríe durante 2-3 minutos hasta que estén recién cocidos, y luego escurra el exceso de grasa y déjelo a un lado. Repita con otros 200 g / 8 oz de mantequilla y los champiñones restantes.", "Derretir la mantequilla restante en una olla grande. Agregue la harina y cocine por un minuto, revolviendo constantemente. Retire del fuego y mezcle gradualmente la leche y el caldo. Regrese al fuego y hierva, revolviendo continuamente.", "Sazone la salsa con sal y pimienta y agregue los trozos de pollo, el perejil, los champiñones y la cebolla. Cocine por 3-4 minutos y luego retírelo del fuego.", "Espolvorear con un poco de perejil fresco y servir con patatas nuevas y verduras de su elección"], "url": "www_bbc_co_uk_food_recipes_julies_cchicken_fricase_68855", "title": "Fricasé de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino", "Harina normal de 375 g / 13 oz, más extra para quitar el polvo", "½ cucharadita de anís molido", "½ cucharadita de maceta de tierra", "60 g / 2¼ oz de mantequilla sin sal, en cubos", "150 g / 5½ oz de azúcar en polvo", "1 limón grande o 2 pequeños sin cera, ralladura finamente rallada solamente", "3 huevos de gallinas camperas, ligeramente golpeados", "1 huevo de gallinas camperas, ligeramente golpeado", "azúcar en polvo, para rociar"], "method": ["Línea dos bandejas de hornear grandes con pergamino para hornear.", "Coloque las semillas de alcaravea en un molinillo de especias o un almirez y mortero y muela hasta formar un polvo. Tamiza la alcaravea, la harina, el anís y la macla en un bol.", "Frote la mantequilla en la harina hasta que se asemeje a migas de pan finas, luego agregue el azúcar y la ralladura de limón. Agregue los huevos y junte la mezcla para formar una masa suave.", "Divida la masa en cuatro bolas que pesen 65 g / 2½ y cuatro bolas que pesen 85 g / 3oz (es posible que tenga un poco de sobra). Coloque las bolas de masa en una de las bandejas preparadas, cúbralas con una película adhesiva y déjelas enfriar en la nevera durante 30 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Amasar los cuatro trozos más pequeños de masa en una superficie ligeramente enharinada y rodar usando las yemas de los dedos en una cuerda de 30 cm / 12 in. Haga nudos dobles y colóquelos en una de las bandejas forradas.", "Forme las cuatro piezas de masa más grandes restantes en cuerdas largas y corte un cuarto de cada cuerda. Diseñe (como se ve en la imagen) en nudos celtas, usando la masa reservada para hacer que los anillos queden arriba. Colóquelos directamente en la otra bandeja revestida. (Los nudos dobles tomarán entre 5 y 10 minutos más para hornear, así que no mezcle las formas en las bandejas).", "Cepillar con huevo batido y espolvorear con azúcar impalpable. Hornee los nudos celtas por 15-20 minutos, hasta que estén dorados y los nudos dobles por 20-25 minutos. Retire del horno y deje enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_jumble_biscuits_20028", "title": "Mezcla de galletas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 8 galletas grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumble_biscuits_20028_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de caldo de verduras", "2 cucharaditas de aceite de oliva", "100g / 3½oz de cuscús gigante", "Brócoli 200 g / 7 oz", "Guisantes 100 g / 3½ oz", "100 g / 3½ oz de habas, envasadas", "100g / 3½oz de hojas de ensalada", "4 cebollas de primavera, formas de longitud a la mitad", "2-4 cucharadas de menta (o cualquier otra hierba suave, como el estragón)", "100 ml / 3½ fl oz oz yogur", "pellizcar el azafrán", "½ cucharadita de miel líquida", "pizca de azúcar en polvo", "1 cucharada de menta (o cualquier otra hierba suave, como el estragón)", "sal marina y pimienta negra recién molida"], "method": ["Precalentar una barbacoa o parrilla a su configuración más alta.", "Vierta el caldo de verduras en una cacerola y deje que hierva.", "Caliente 1 cucharadita de aceite en una sartén a fuego medio y tueste el cuscús por un par de minutos. Incline en un recipiente grande y agregue el caldo de verduras calientes. Cubra con una película adhesiva y deje reposar de 5 a 10 minutos.", "Ponga a hervir una cacerola grande de agua con sal y blanquee el brócoli, los guisantes y las habas durante unos minutos y revuelva en agua helada.", "Retire el brócoli del agua, escurra y mezcle en un tazón con las cebolletas y 1 cucharadita de aceite. Coloque en la parrilla o debajo de la parrilla y carbonizado en todos los lados. Retire de la parrilla y deje a un lado hasta que esté listo para servir.", "Para hacer el aderezo, coloque todos los ingredientes en un recipiente de vidrio mediano y mezcle bien.", "Esparcir las hojas en un plato de servir y vestir con cuscús, brócoli, guisantes, habas, cebolletas y hierbas. Cubra con el aderezo y sirva."], "url": "www_bbc_co_uk_food_recipes_jumbo_couscous_salad_23940", "title": "Ensalada de cuscús Jumbo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbo_couscous_salad_23940_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva suave", "2 dientes de ajo, en rodajas muy finas", "1 chile rojo largo, sin semillas y finamente picado (o use ½ cucharadita de hojuelas de chile secas)", "150g / 5½oz de tomates cherry, cortados a la mitad", "½ limón, solo jugo", "Langostinos jumbo de 250 g / 9 oz, cocidos, pelados y desvelados", "3 cucharadas colmadas de perejil de hoja plana aproximadamente picado", "pimienta negro", "160 g / 6 oz de judías verdes, al vapor, para servir"], "method": ["Caliente el aceite en una sartén pequeña a fuego lento. Agregue el ajo y el chile y cocine muy suavemente durante cinco minutos o hasta que el ajo esté muy suave pero sin color, revolviendo ocasionalmente.", "Agregue los tomates y el jugo de limón y cocine durante dos minutos o hasta que comience a ablandarse. Agregue las gambas y cocine por 2-3 minutos, revolviendo, hasta que los tomates estén bien suavizados y las gambas estén calientes.", "Retire la sartén del fuego, agregue el perejil, sazone con mucha pimienta y sirva con los frijoles."], "url": "www_bbc_co_uk_food_recipes_jumbo_prawns_with_15297", "title": "Gambas Jumbo con tomate y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbo_prawns_with_15297_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["375g / 13oz de hojaldre listo para enrollar", "3 rebanadas de jamón de Parma, cortadas en tiras", "100 g / 3½ oz de gorgonzola, desmenuzado", "1 cucharada de semillas de apio", "1 huevo de gallinas camperas, golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una superficie de trabajo ligeramente enharinada, extender la masa de hojaldre en una hoja delgada.", "Coloque las tiras de jamón de Parma en la mitad de la masa y luego espolvoree sobre el gorgonzola.", "Dobla la masa sobre el jamón y el gorgonzola, y luego despliega otra vez sobre una lámina delgada.", "Recorte los bordes de la masa rellena, cepille todo con el huevo batido y espolvoree sobre las semillas de apio.", "Corta la masa rellena en tiras de 1cm / ½.", "Gire las tiras y transfiéralas a una bandeja para hornear. Presione los extremos de los bollos hacia abajo para asegurarlos a la bandeja y evitar que se deshagan.", "Hornee en el horno durante 20-25 minutos, o hasta que estén doradas. Déjelo enfriar un poco, luego sirva."], "url": "www_bbc_co_uk_food_recipes_jumbocheesestraws_90633", "title": "Jumbo de queso y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "18", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbocheesestraws_90633_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechugas de pollo 3x140g / 5oz, sin piel", "2 cucharadas de harina normal", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 cucharada de mantequilla", "1 diente de ajo, aplastado", "4 hojas de laurel", "125ml / 4fl oz de vino blanco seco", "2 cucharadas de alcaparras, bien enjuagadas", "1 cucharada de jugo de limón", "2 cucharadas de perejil de flatleaf"], "method": ["Coloque una sartén al fuego y agregue el aceite y la mantequilla.", "Coloque las pechugas de pollo entre dos hojas de película adhesiva y plana.", "Sazone la harina con sal marina y pimienta negra.", "Rompa el pollo en trozos, luego mezcle la harina sazonada. Freír el pollo hasta que esté cocido. Retire del fuego.", "Agregue el ajo, las hojas de laurel, las alcaparras y el condimento a la sartén. Agregue el vino y regrese al fuego.", "Agregue el jugo de limón y las hojas de perejil.", "Plaque el pollo, rocíe la salsa y sirva con hojas de rúcula y pan."], "url": "www_bbc_co_uk_food_recipes_jumpinthepanchicken_66045", "title": "Salta en la sartén de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 hojas de lima kaffir (congeladas, frescas o secas)", "½ cubo de caldo de pollo, disuelto en 300 ml / 10 ½ l de agua recién hervida", "275g / 9¾oz de grano largo o arroz basmati", "2 cucharadas de aceite de girasol", "2 pechugas de pollo, deshuesadas, despellejadas, cortadas en pequeños trozos", "1 pimiento rojo grande, sin corazón, sin semillas y cortado en trozos de 2cm / ¾in", "Frijoles verdes finos de 200g / 7oz, recortados, cortados a la mitad longitudinalmente", "Maíz dulce de bebé de 200 g / 7 oz, recortado, reducido a la mitad en diagonal", "2 cucharadas de pasta de curry rojo tailandés", "1 cucharada de salsa de pescado tailandés (nam pla)", "2 cucharadas de harina de maíz", "50 g / 1¾oz de hojas frescas de espinaca", "gran puñado de hojas de albahaca fresca (opcional)"], "method": ["Revuelva las hojas de lima en el caldo y déjelas a un lado para infundirlas.", "Mientras tanto, medio llenar una olla grande con agua y llevar a ebullición. Agregue el arroz, revuelva bien y vuelva a hervir, luego cocine según las instrucciones del paquete.", "Caliente el aceite en una sartén antiadherente grande o en un sartén a fuego alto. Agregue el pollo, el pimiento rojo, las judías verdes y el maíz dulce y saltee durante 2-3 minutos.", "Agregue la pasta de curry y cocine durante 1-2 minutos más.", "Agregar el caldo, las hojas de lima y la salsa de pescado, llevar la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos, o hasta que las verduras estén tiernas.", "En un tazón pequeño, bata la harina de maíz con 1 cucharada de agua fría para formar una pasta suave. Batir en el curry y continuar a fuego lento durante 4-5 minutos, o hasta que la salsa de curry se haya espesado un poco.", "Agregue la espinaca y continúe cocinando a fuego lento hasta que se marchite. Agregue las hojas de albahaca justo antes de servir. Descarta las hojas de lima.", "Para servir, escurre el arroz y espárcelo sobre platos para servir. Cubra cada porción con un cucharón de curry."], "url": "www_bbc_co_uk_food_recipes_jungle_chicken_curry_49545", "title": "Pollo al curry de la selva con arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jungle_chicken_curry_49545_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2½ oz de pasta de camarón", "6 chalotes tailandeses", "3 dientes de ajo", "4 chiles pequeños de color amarillo o verde, cortados por la mitad, sin semillas", "6 chiles rojos largos, sin semillas", "50g / 1¾oz de galanga, pelada", "Azúcar de palma 40g / 1½oz", "20g / ¾oz de cúrcuma fresca", "2 cucharaditas de sal fina", "30 g / 1 oz de camarones secos, empapados durante 30 minutos y luego escurridos", "2 cucharadas de aceite vegetal", "12 vainas de cardamomo verde", "1 gallina de guinea, dividida en ocho articulaciones, piel cortada con un cuchillo", "5 tallos de krachai, triturados (una versión más suave de galangal y jengibre, de la misma familia)", "3 hojas de lima, espinas eliminadas, trituradas", "50ml / 2fl oz de salsa de pescado", "100ml / 3½fl oz de vino de arroz Shaoxing", "500ml / 18fl oz de caldo de pollo", "azúcar en polvo, al gusto", "200g / 7oz de arroz de grano largo", "50 g / 1¾oz de leche de coco gruesa (enfríe la lata de leche de coco en el refrigerador por 30 minutos, espolvorea la leche gruesa de coco de la parte superior de la lata)", "1 cucharadita de sal", "pizca de azúcar en polvo", "6 hojas de lima, rasgadas", "4 judías verdes, cortadas en trozos de 1cm / ½ en trozos", "1 brote de bambú, triturado", "2 hojas de lima, trituradas", "1 guindilla roja, cortada en rodajas y sin semillas"], "method": ["Para hacer la pasta de curry, envuelva la pasta de camarones en un paquete de papel de aluminio y tueste en una sartén seca y caliente o directamente en un quemador de gas hasta que quede fragante.", "En una maza grande y mortero, triture los chalotes tailandeses, los dientes de ajo, los chiles amarillos o verdes, los chiles rojos, la galanga, el azúcar de palma, la cúrcuma, la sal y los camarones secos rehidratados.", "Para el curry, en un wok grande, caliente el aceite vegetal hasta que esté caliente. Agregue la pasta de curry y los cardamonos verdes y cocine hasta obtener una pasta seca. Agregue las articulaciones de gallina de Guinea y fría por unos minutos. Agregue el krachai, las hojas de lima, la salsa de pescado, el vino Shaoxing y el caldo de pollo. Cocine hasta que la gallina de guinea esté cocida. Esto tomará alrededor de 30 minutos. Pruebe y agregue azúcar en polvo al gusto.", "Mientras tanto, cocina el arroz. Lave el arroz tres veces y déjelo reposar durante 10 minutos. Coloque todos los ingredientes para el arroz en una olla y cubra con agua. Coloque una tapa, hierva y cocine durante cuatro minutos, apague y deje reposar cubierto durante 12 minutos o hasta que esté cocido a su gusto.", "Adorne el plato terminado con frijoles de serpiente, brotes de bambú, hojas de lima y rodajas de chile rojo."], "url": "www_bbc_co_uk_food_recipes_jungle_curry_of_guinea_73580", "title": "Curry de la selva de gallina de guinea con coco y arroz de lima", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rebanada de pan blanco, sin costras", "200 g / 7 oz de piñones", "2 dientes de ajo pequeños, finamente picados", "1/2 perejil pequeño, finamente picado", "1 limón, solo jugo", "5 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "12 langostinos, cáscaras y cabezas retiradas, desvendadas", "2 cucharadas de jugo de limón", "1 diente de ajo, finamente picado", "½ cucharadita de cilantro molido", "½ cucharada de Tabasco", "Pastelería kadaifi de 200g / 7oz (también llamada 'kataifi', disponible en algunos delicatessen continentales y especialistas en línea)", "24 hojas frescas de albahaca", "aceite vegetal, para freír"], "method": ["Para el tarator, coloque el pan en un tazón, agregue suficiente agua fría para cubrir el pan, luego exprima el exceso de agua.", "Mezcle el pan empapado, los piñones, el ajo, el perejil y el jugo de limón en un procesador de alimentos hasta que esté suave y bien combinado.", "Poco a poco agregue el aceite de oliva y mezcle hasta obtener un puré. Sazonar, al gusto, con sal y pimienta negra recién molida y enfriar en la nevera hasta que se necesite.", "Para las gambas, en un tazón, mezcle las gambas, el jugo de limón, el ajo picado, el cilantro y Tabasco hasta que estén bien combinados. Enfriar en la nevera durante dos horas para marinar.", "Caliente una freidora a 170C / 325F / Gas 3, o hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Corta la masa kadaifi en 12 piezas iguales de unos 10 cm / 4 pulgadas. Coloque una pieza de masa kadaifi en una superficie de trabajo limpia. (Mantenga cubiertas las piezas de repostería restantes para evitar que se sequen). Coloque dos hojas de albahaca encima de la masa.", "Coloque una gamba de rey en un extremo de la masa, luego enrolle la masa alrededor de la gamba hasta que la gamba esté cubierta de masa.", "Repita el proceso con los camarones restantes.", "Baje con cuidado las gambas envueltas en el aceite caliente en lotes. Freír durante 3-4 minutos, o hasta que la masa esté crujiente y dorada. Retire las gambas envueltas del aceite con una cuchara ranurada y déjelas a un lado para escurrirlas sobre papel de cocina. Mantener caliente", "Para servir, divida el tarator entre cuatro platos y coloque tres gambas encima de cada porción."], "url": "www_bbc_co_uk_food_recipes_kadaifiwrappedkingpr_90790", "title": "Kadaifi langostinos envueltos con piña tarator", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fresas de 950g / 2lb 2oz, sin cáscara y en cuartos", "175g / 6oz de azúcar en polvo", "175ml / 6fl oz de jugo de naranja", "1 estrella de anís, ligeramente tostado", "1 cucharada de Grand Marnier u otro licor de naranja", "50g / 2oz de mantequilla, suavizada para untar las bandejas", "175g / 6oz de azúcar en polvo, más 40 g / 1½ oz para quitar el polvo de las bandejas", "4 yemas de huevo de gallinas camperas, a temperatura ambiente", "115g / 4oz de queso blanco", "175g / 6oz de crema fresca", "75ml / 5 cucharadas de ron oscuro", "Harina normal de 75g / 3oz", "60 g / 2¼ oz de pasas doradas, empapadas en 4 cucharadas de vino blanco", "8 huevos de gallinas camperas, solo blancos", "½ cucharadita de crema de tártaro", "60g / 2¼ oz de azúcar glas, para quitar el polvo"], "method": ["Para la salsa de fresa, separa 350g / 12oz de las fresas y 60g / 2¼ oz del azúcar.", "En una cacerola pesada, combine las fresas restantes, 125 ml / 4 fl oz de agua, 115 g / 4 oz de azúcar, el zumo de naranja, anís estrellado y Grand Marnier.", "Llevar a ebullición a fuego medio, revolviendo ocasionalmente para evitar quemarse. Reduzca el fuego y cocine a fuego lento durante 10 minutos.", "Retire las fresas del fuego y cubra con una película adhesiva. Dejar de lado para infundir durante 10 minutos.", "Retire el anís estrellado y vierta la mezcla de fresa en una licuadora, y mezcle hasta obtener un puré fino.", "Cuele la salsa a través de un colador fino y reserve en una sartén lista para usar, o refrigérela si no la está usando de inmediato.", "Precalentar el horno a 210C / 425F / Gas 7.", "Para el kaiserschmarrn, generosamente manteca dos platos a prueba de horno de 22cm / 8½ de diámetro. Espolvorea cada sartén con azúcar y elimina cualquier exceso.", "En un tazón mediano con una batidora de mano, bata las yemas de huevo con 25 g / 1 oz del azúcar impalpable hasta que la mezcla sea ligera y de color amarillo limón.", "Batir en el queso blanco y mezclar hasta que estén bien combinados.", "Batir la crème fraîche y el ron, luego batir en la harina. Revuelva a través de las pasas.", "En otro tazón y usando un batidor eléctrico o un batidor de pie, bata las claras de huevo a velocidad media-baja hasta que hagan espuma, luego agrega la crema de tártaro.", "Vuelva la velocidad a medio y continúe batiendo mientras vierte lentamente el resto de 150 g / 5½ oz de azúcar. Batir hasta que se formen picos rígidos cuando se quite el batidor.", "Batir la mitad de las claras de huevo en la mezcla crème fraiche, luego doble suavemente las claras de huevo restantes.", "Divida la mezcla por igual entre los dos recipientes azucarados.", "Hornee el kaiserschmarrn en el medio del horno durante 15 minutos. Gire las bandejas si se dora de manera desigual y hornee durante otros 5-8 minutos, hasta que se hinchen y se doren. El centro debe establecerse y ser levemente firme.", "Mientras tanto, en una olla grande, hierva la salsa de fresa a fuego alto. Agregue el azúcar reservado de 60 g / 2¼ oz y revuelva hasta que el azúcar se haya disuelto. Cocine la salsa a fuego alto durante un minuto.", "Agregue las fresas cortadas reservadas de 350g / 12oz, y revuelva a través de la salsa para cubrir. Para servir, divida la salsa de fresa entre cuatro platos para servir.", "Con una cuchara para servir divida cada una en dos porciones y una cuchara encima de la salsa de fresa. Polvo con azúcar glas y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_kaiserschmarrn_with_86930", "title": "Kaiserschmarrn con salsa de fresa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Calle de 400g / 14oz", "1 cucharadita de sal", "½ limón, solo jugo", "1 cucharada de miel", "Jengibre fresco de la raíz 2-3cm / 1in, finamente picado", "2 cucharadas de semillas de sésamo", "aceite de oliva virgen extra (opcional)", "4 cucharadas de harina de arroz (alternativamente, use harina de espelta o normal)", "8 dientes de ajo picados", "1 cebolla, más o menos picada", "50ml / 2fl oz de salsa de pescado", "4 cucharadas de chile coreano en polvo o 2 cucharadas de pimienta de cayena", "1 colinabo pequeño (aproximadamente 250 g / 9 oz), pelado y cortado en 5 mm / ¼ pulgadas", "1 zanahoria, cortada en fósforos", "1 puerro, en rodajas finas", "col rizada con semillas de sésamo y miel (desde arriba)", "semillas de sésamo (opcional)", "500g / 1lb 2oz sobrantes de cerdo desmenuzado o paleta de cerdo triturada", "1 pan de masa fermentada, cortado en rodajas gruesas", "1 bulbo entero de ajo, cortado por la mitad", "2 cucharadas de sal marina"], "method": ["Para la col rizada cruda con semillas de sésamo y miel, saque las hojas de col rizada de los tallos gruesos. Corta finamente los tallos y corta las hojas, luego lava ambas. Escurrir bien,", "Coloque la col rizada en un recipiente con la sal, el jugo de limón y la miel. Masajee el aderezo en las hojas durante 2 a 3 minutos, magullándolas para que absorban los jugos. Déjalo por 30 minutos, luego vierte el exceso de líquido. Agregue las semillas de jengibre y sésamo, mézclelo y viértalo con aceite de oliva virgen extra, si lo usa.", "Para la col rizada y el kimchi de colinabo, lleve 400 ml / 14 fl oz de agua a fuego lento y agregue la harina de arroz. Mantenga la agitación durante unos minutos hasta que se espese y comience a burbujear. Cocine a fuego lento durante otros 1-2 minutos hasta que se convierta en una papilla opaca.", "Con una licuadora de mano o un procesador de alimentos, mezcle el ajo, la cebolla y la salsa de pescado para hacer un puré. Transfiera a un recipiente, agregue la mezcla de harina y el chile en polvo. Mezcle bien, luego agregue el colinabo, zanahoria y puerro y finalmente la col rizada. Mezclar bien.", "Coloque en una tina no metálica esterilizada, presione hacia abajo para empacar y cubrir con una tapa. Cómelo fresco con semillas de sésamo espolvoreadas en la parte superior o déjalo en una habitación fresca por 2-3 días. Después de dos días, revisa si puedes ver alguna pequeña burbuja; ellos probarán que está fermentando. De lo contrario, déjalo fuera del refrigerador un poco más, hasta que comience el proceso de fermentación.", "Guarde el kimchi en un recipiente sellado en el refrigerador y coma dentro de tres semanas. La col rizada cruda se consume mejor de inmediato.", "Para servir, caliente una sartén de plancha. Ligeramente aceite y frote el ajo y la sal en el pan y cocine por 1-2 minutos en cada lado.", "Triture el cerdo sobrante y vuelva a calentarlo en una sartén hasta que esté caliente. Servir en el pan con una cucharada de kimchi en la parte superior."], "url": "www_bbc_co_uk_food_recipes_kale_and_kohlrabi_kimchi_63904", "title": "Kimchi de col rizada y colinabo con cerdo desmenuzado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Quinua 350g / 12oz", "1 cucharada de aceite de oliva extra virgen", "2 cucharaditas de aceite de coco", "600g / 1lb col rizada de 5½oz, tallos resistentes descartados, hojas trituradas, lavadas", "1 diente de ajo graso, finamente picado", "1 gran puñado de cilantro fresco picado o perejil de flatleaf, para adornar", "1 naranja sin cebar, solo ralladura, en rodajas finas", "2½ cucharadas de tahini", "2 cucharadas de aceite de oliva virgen extra", "1 diente de ajo", "6 cucharadas de agua tibia (hervida)", "4 cucharadas de jugo de naranja", "pimienta negra recién molida"], "method": ["Coloque la quinua en un recipiente y cubra con aproximadamente 700 ml / 1¼ pintas de agua fría. Déjelo a un lado para que se empape durante la noche (o durante al menos 8 horas).", "Escurrir la quinua y transferir a una olla muy grande. Cubra con 350 ml / 12 fl oz de agua y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10-12 minutos, o hasta que la quinua esté tierna.", "Escurra la quinua y ponga en un tazón grande. Rocíe el aceite de oliva y sazone con sal marina.", "Mientras tanto, para el aderezo, mezcle todos los ingredientes del aderezo hasta que quede suave, cremoso y bien combinado, agregando un chorro de agua tibia para aflojar la mezcla si es necesario. Sazonar con pimienta. Dejar de lado.", "Caliente el aceite de coco en una sartén a fuego medio hasta que se derrita. Agregue la col rizada y saltee durante 1-2 minutos, agregando el ajo después de 1 minuto. Continúa freír hasta que la col rizada esté tierna, luego inclínala en la quinua y revuelve para combinar.", "Para servir, divida la col rizada y la quinoa salteadas por igual entre 4 platos, decore con la ralladura de naranja. Rocíe sobre el aderezo de tahini y espolvoree sobre las hierbas."], "url": "www_bbc_co_uk_food_recipes_kale_and_quinoa_saut_64469", "title": "Kale y quinoa salteados con aderezo de tahini naranja", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_and_quinoa_saut_64469_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Calle de 400g / 14oz", "1 cucharadita de sal", "½ limón, solo jugo", "1 cucharada de miel", "Jengibre fresco de la raíz 2-3cm / 1in, finamente picado", "2 cucharadas de semillas de sésamo", "aceite de oliva virgen extra (opcional)"], "method": ["Tire de las hojas de col rizada de los tallos gruesos. Corta finamente los tallos y corta las hojas, luego lava ambas. Escurrir bien.", "Coloque la col rizada en un recipiente con la sal, el jugo de limón y la miel. Masajee el aderezo en las hojas durante 2 a 3 minutos, magullándolas para que absorban los jugos. Déjalo por 30 minutos, luego vierte el exceso de líquido. Agregue las semillas de jengibre y sésamo, mézclelo y viértalo con aceite de oliva virgen extra, si lo usa."], "url": "www_bbc_co_uk_food_recipes_kale_lemon_honey_and_69996", "title": "Ensalada de col rizada, limón, miel y sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_lemon_honey_and_69996_16x9.jpg", "isVegetarian": true, "recommendations": 0}]