[{"isVegetarian": false, "title": "Thai poached pork belly with coriander salad", "url": "www_bbc_co_uk_food_recipes_thai_poached_pork_belly_75251", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz boneless pork belly, skin scored", "2 long red chillies, split lengthways", "2 sticks lemongrass, lightly bruised", "½ head of garlic, sliced horizontally", "4 coriander sprigs, preferably with root attached", "4 slices fresh ginger", "2 lime leaves, lightly bruised", "oil, for frying", "knob of butter", "1 white turnip, peeled and thinly sliced", "1 cucumber, thinly sliced", "110ml/4fl oz white wine vinegar", "1 tsp sugar", "1 tsp salt", "150g/5½oz caster sugar", "2 red chillies, roughly chopped", "3 plum tomatoes, roughly chopped", "8 lime leaves", "2 lemongrass stems, tough outer leaves removed, finely chopped", "4 sprigs coriander (preferably with root attached), roughly chopped", "25g/1oz roughly chopped fresh ginger", "2 garlic cloves, peeled", "2 small shallots, roughly chopped", "4 tbsp Thai fish sauce ", "40ml/1½fl oz sesame oil", "50ml/2fl oz dark soy sauce", "2 tbsp clear honey", "3 limes, juice and zest", "110g/4oz crème fraîche", "150g/5oz watercress leaves", "3 tbsp coriander leaves", "2 tbsp mint leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pork belly, place the pork belly, chillies, lemongrass, garlic, coriander, ginger and lime leaves into a large saucepan. Top with water, so the pork is covered, then bring to a boil. Reduce the heat to a simmer and cook for two hours.", "For the pickled vegetables, place the turnip and cucumber in a heatproof bowl. Put 110ml/4fl oz water in a pan with the white wine vinegar, sugar and salt, and heat until the salt and sugar have dissolved. Pour over the turnip and cucumber and set aside to pickle for two hours, then drain off the pickling liquid.", "For the pork belly, when poached, remove from the heat and place between two heavy baking trays and place in the fridge for at least two hours to cool and set.", "For the chilli jam, heat the sugar in a heavy-based saucepan over a low to medium heat until it melts and forms a golden-brown caramel. Do not stir and keep an eye on it so that it doesn’t burn.", "Blend all of the remaining chilli jam ingredients, except the crème fraîche, in a food processor to a smooth purée.", "Once the sugar has caramelised, pour in the puréed chilli jam mixture and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool slightly. ", "For the pork belly, remove the pork from the fridge and cut into 1cm/½in thick slices. Heat a frying pan until hot, add a splash of oil and a knob of butter, and fry the pork slices on each side for 1-2 minutes, or until golden-brown and crisp.", "Add a couple of spoons of the chilli jam to the pan and continue to fry, basting as you go until coated and slightly sticky.", "To serve, lay three slices of the pork belly on to the plate, dress with the pickled vegetables, watercress, coriander and mint leaves and finish with a few dots of chilli jam."]}, {"isVegetarian": false, "title": "Thai pork and lemongrass stir fry", "url": "www_bbc_co_uk_food_recipes_thai_pork_kaffir_lime_91692", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7 Thai shallots, peeled and sliced", "8 garlic cloves, peeled", "2–3 galangal pieces, peeled and sliced", "6 lemongrass stalks, peeled and sliced", "4 fresh turmeric pieces, peeled and sliced", "1 tsp shrimp paste", "1 small, dried, very hot chilli, soaked and finely chopped", "1 bird’s-eye chilli, finely chopped", "1 kaffir lime, zest only", "pinch sea salt", "½ tsp ground black peppercorns", "135g/4¾oz pork mince", "½ tsp Thai fragrant oil", "2–3 Prik Kee Noo Suan chillies or other Thai red chillies", "3–4 small green peppercorns", "small pinch golden caster sugar ", "1 tbsp fish sauce", "small splash of chicken stock ", "1½ tbsp finely sliced lemongrass", "1 heaped tbsp julienned kaffir lime leaves", "1 fennel, core removed and sliced ", "¼ cucumber, chopped ", "¼ Chinese cabbage, finely chopped", "2 white turmeric pieces or snake beans, sliced", "8 lime leaves ", "1 Thai basil sprig", "1 Asian pennywort sprig"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry paste, pound everything together in a pestle and mortar to a smooth paste. ", "For the stir fry, place a wok over a low heat and add 1½ tablespoons of the curry paste. Add the mince and mix the pork and paste together. Pour in the oil and mix well, continuing to fry and break up the meat. Stir-fry until the pork is cooked through. ", "Add the chillies and green peppercorns and continue to cook for another minute, mashing everything together so the chillies and peppercorns bruise. Add the sugar, fish sauce and stock to create a light sauce. Add the lemongrass and kaffir lime leaves and cook for 15 more seconds. ", "Place the fennel, cucumber, cabbage and white turmeric into iced water for a few minutes. Serve the stir fry garnished with the iced vegetables, lime leaves, Thai basil and Asian pennywort. "]}, {"isVegetarian": false, "title": "Thai prawn curry with noodles", "url": "www_bbc_co_uk_food_recipes_thai_prawn_curry_with_09136", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large shallots, chopped", "5cm/2in piece fresh root ginger, peeled, chopped", "2.5cm/1in piece fresh galangal, peeled,chopped", "2 stems lemongrass, finely chopped", "2 garlic cloves, chopped", "small bunch coriander, roughly chopped, plus extra to serve", "3 dried, hot red chillies soaked in 75ml/3fl oz warm water", "3 lime leaves, roughly chopped", "1 tbsp Thai fish sauce", "1 tbsp vegetable oil", "400g/14oz raw tiger prawns, peeled and de-veined", "1 tbsp palm sugar", "1 tbsp tamarind paste", "1 x 225g/8oz tin water chestnuts, drained and roughly chopped", "¼ tsp freshly ground white pepper ", "400ml/14fl oz coconut milk", "1 lime, juice only", "1 tbsp vegetable oil", "1 tbsp hot chilli sauce", "6 spring onions, finely sliced", "3 Thai red chillies, finely sliced", "200g/7oz fine rice noodles, cooked according to packet instructions", "2 tbsp roasted salted peanuts, crushed", "1 tbsp light soy sauce", "1 tbsp toasted sesame oil", "3 tbsp chopped fresh coriander", "1 lime, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Thai red curry paste, blend all of the Thai red curry paste ingredients, including the soaking water, in a food processor to a smooth paste. Keep any spare paste in a sealed sterilised jar in the fridge for up to 1 week.", "For the prawn curry, heat the oil in a wok over a very high heat. Add 50g/1¾oz of the curry paste and stir-fry for 1-2 minutes, or until just starting to darken in colour.", "Add the prawns, palm sugar, tamarind paste, water chestnuts, white pepper and coconut milk. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 10 minutes, or until thickened. Keep warm; season with the lime juice and garnish with some chopped coriander just before serving. ", "For the noodles, heat the oil in a wok over a very high heat. Add the chilli sauce, spring onions and red chilli and stir-fry for 1-2 minutes.", "Add the cooked noodles, peanuts, soy sauce, sesame oil and coriander and and stir-fry until heated through. Season, to taste, with lime juice.", "To serve, divide the noodles among four serving plates. Spoon over the prawn curry. "]}, {"isVegetarian": false, "title": "Thai roast chicken", "url": "www_bbc_co_uk_food_recipes_thai_roast_chicken_92130", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_roast_chicken_92130_16x9.jpg", "ingredients": ["2 sticks lemongrass ", "50g/1¾oz ginger, peeled", "3 spring onions", "2 medium red chillies", "2 medium yellow chillies", "1 medium green chilli", "1 tbsp ground turmeric", "200ml/7oz groundnut oil", "1 whole chicken"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Set the oven to 180C/350F/Gas 4.", "Combine all of the ingredients apart from the chicken in a food processor and blend until smooth.", "Brush the chicken generously with the spice mix.", "Cover the chicken with foil and roast in the oven for 70-80 minutes, or until the juices run clear when the chicken is pierced with a skewer – the cooking time will depend on the size of the chicken. Remove the foil half way through to allow the skin to crisp up.", "Leave to rest for 15 minutes covered in foil before serving."]}, {"isVegetarian": true, "title": "Thai tofu Panang Yorkshires", "url": "www_bbc_co_uk_food_recipes_thai_tofu_panang_99782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_tofu_panang_99782_16x9.jpg", "ingredients": ["2 large onions, roughly chopped", "5cm/2in piece galangal, peeled and grated ", "2 bird’s-eye chillies", "4 garlic cloves", "3 kaffir lime leaves", "1½ tbsp dark soy sauce", "3 tbsp fish sauce  ", "1½ tbsp Thai shrimp paste", "6 tbsp tomato purée", "2 tbsp smoked paprika", "1½ tbsp ground cumin  ", "1½ tbsp ground coriander ", "1 tsp turmeric ", "½ tsp ground cloves", "½ tsp nutmeg", "1 tbsp light brown sugar (firmly packed)   ", "2 tbsp peanut oil", "600g/1lb 5oz extra-firm tofu, cubed", "½ red pepper, quartered and thinly sliced", "½ green pepper, quartered and thinly sliced  ", "500ml/18fl oz coconut milk", "2 tbsp fish sauce ", "1 lime, juice only ", "6 tbsp vegetable oil", "200g/7oz plain flour", "½ tsp sea salt", "½ tsp ground black pepper", "½ tsp smoked paprika ", "¼ tsp red chilli powder", "¼ tsp cumin powder", "200ml/7fl oz full-fat milk", "4 medium eggs (only 200g/7oz needed) ", "handful Thai basil or coriander leaves", "3 limes, cut into wedges "], "serves": "Makes 18", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 245C/225C Fan/Gas 9. ", "For the curry paste, put all the ingredients in a food processor and blend until smooth. If the paste is very thick, add a little water and blend again.", "For the tofu, heat the peanut oil in a wok or a large frying pan over a high heat, add the tofu and stir-fry for 10 minutes, turning, or until browned. Add the peppers and continue to stir-fry. Add the curry paste and cook for 2-3 minutes. Pour in the coconut milk, fish sauce and lime juice. Simmer for 15-20 minutes, or until most of the liquid has evaporated, then set aside.", "For the Yorkshire puddings, add a teaspoon of vegetable oil to each hole of a muffin tin. (You have enough batter for 18 small Yorkshire puddings.) Preheat in the oven for 10 minutes, or until the oil is smoking hot.  ", "Meanwhile, in a large bowl, mix the flour, sea salt, black pepper, smoked paprika, chilli powder and cumin powder together until well combined. ", "In a separate bowl lightly whisk the milk and eggs. Add to the flour mixture and whisk until smooth. Set aside to rest in the fridge for at least a few minutes or ideally half an hour.", "Carefully remove the hot tins from the oven and using a measuring jug pour the batter evenly into each hole. Bake for 12 minutes, or until golden-brown and risen. Remove from oven and cool in the tins for few minutes, then remove and place onto a wire rack to cool further.", "To assemble, put the Yorkshire puddings on a serving platter. If necessary, gently push down in the middle of the Yorkshire to create a dip. Spoon a generous amount of the tofu mixture into them. Top each one with a Thai basil or coriander leaf. Arrange the lime wedges around the serving platter and serve.      "]}, {"isVegetarian": false, "title": "Thai roast chicken with sesame noodles and pak choi", "url": "www_bbc_co_uk_food_recipes_thai_roast_chicken_with_58724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red chillies, halved, seeds removed", "150g/5¼oz creamed coconut", "4 limes, zest and juice of 2 limes, remaining 2 limes sliced", "handful fresh coriander", "1 x 1.5kg/3lbs 5oz whole chicken, preferably free-range", "350g/12½oz fresh egg noodles", "1 tbsp sesame seeds, toasted", "1 tbsp sesame oil", "2 spring onions, sliced", "1 tbsp vegetable oil", "2 garlic cloves, crushed ", "pinch sugar", "4 heads pak choi, halved, cores removed", "570ml/1 pint chicken stock", "2 tsp Thai fish sauce (nam pla)", "4 sprigs fresh coriander, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the Thai roast chicken, preheat the oven to 190C/350F/Gas 5. ", "Blend the chillies, creamed coconut, lime zest, lime juice and coriander in a food processor to a smooth paste.", "Carefully push some of the paste between the skin and flesh of the chicken breasts, making sure it is evenly distributed.", "Score the chicken thighs twice with a sharp knife right down to the bone. Carefully rub the remaining paste into the cuts and all over the chicken thighs.", "Lay the lime slices on the bottom of a roasting tray and sit the chicken on top. Cover with aluminium foil and roast in the oven for 40 minutes. Remove the aluminium foil, baste the chicken with any juices that have collected in the bottom of the tray and return to the oven for a further 30-40 minutes, basting occasionally, or until the chicken is cooked through.", "Remove the chicken from the oven and set aside to rest in a warm place for five minutes.  ", "Meanwhile, for the sesame noodles, cook the noodles according to the packet instructions. Drain well.", "Mix the cooked noodles, sesame seeds, sesame oil and spring onions together in a bowl. Set aside.", "For the garlic pak choi, heat the oil in a frying pan over a medium heat. Fry the garlic and sugar for one minute, until the sugar has caramelised. Add the pak choi, cut-sides down, then pour in the chicken stock and fish sauce and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then cover the pan with a circle of greaseproof paper (a cartouche) and simmer for 3-4 minutes, or until the pak choi is tender.", "To serve, carve the chicken. Place one pak choi half into each of four serving bowls. Twist portions of the noodles around a fork and place them in the middle of the serving bowls. Top with the some of the chicken and the remaining pak choi halves, then drizzle with any juices from the roasting tray. Garnish with the coriander sprigs."]}, {"isVegetarian": false, "title": "Thai red curry with noodles", "url": "www_bbc_co_uk_food_recipes_thai_red_curry_with_23014", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 red dried chillies, seeds removed, halved, soaked for 30 minutes and then  drained", "50g/1¾oz coriander root (available online)", "8 lime leaves, shredded", "4 lemongrass stalks, roughly chopped", "100g/3½oz galangal, peeled and sliced", "2 tbsp lime zest, preferably kaffir limes", "50g/1¾oz Thai shallots, peeled and sliced (available online),", "50g/1¾oz garlic, sliced", "2 tbsp shrimp paste", "½ tsp coriander seeds", "¼ tsp cumin seeds", "small piece of mace", "5 white peppercorns", "2-3 tbsp coconut cream", "4 tbsp curry paste (see above)", "1cm/½in piece fresh root ginger, peeled and chopped", "6 boneless chicken thighs, skinned and chopped ", "2 tbsp palm sugar", "1 tbsp fish sauce", "2 sticks lemongrass, bashed ", "6 lime leaves, crushed \t", "2 x 400ml tins coconut milk", "100ml/3½fl oz chicken stock, heated until boiling", "handful fresh coriander, leaves picked", "handful Thai basil, leaves picked", "handful mint, leaves picked", "2 long red chillies, seeds removed and cut into long thin strips ", "2 small shallots, sliced, fried until crisp", "2 garlic cloves, sliced, fried until crisp", "2 garlic cloves ", "thumb-sized piece of fresh root ginger ", "6 coriander roots or stalks ", "50ml/2fl oz vegetable oil ", "300g/10½oz rice noodles, soaked", "1 tbsp oyster sauce ", "1 tbsp soy sauce ", "handful fresh coriander ", "100g/3½oz beansprouts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry paste, put all of the ingredients except the coriander seeds, cumin seeds, mace and peppercorns in a blender and blend to a smooth paste. Add a little water if needed.", "Toast the coriander, cumin and mace in a frying pan until fragrant. Add the peppercorns. Remove from the heat and leave to cool. Grind in a pestle and mortar and add to the paste.  ", "For the curry, heat the coconut cream. When the cream splits, add the curry paste and fry, stirring constantly over a medium heat. Add the chicken,  palm sugar and the fish sauce. It should look like a sticky jam. Add the lemongrass, lime leaves, coconut milk and stock. Bring to the boil and cook for 4 minutes or until the chicken is cooked through. Keep warm over a very low heat while you make the noodles.", "For the noodles, put the garlic, ginger and coriander in a pestle and mortar and pound to a paste. Heat the oil in a wok and add the paste to the oil, fry at a very high heat for a minute until fragrant and starting to colour. ", "Stir in the chillies and noodles. Add the sauces, mix and when hot put in a large bowl topped with the fresh coriander and beansprouts. ", "Serve the curry with the noodles alongside. Top with the curry garnish, if using."]}, {"isVegetarian": false, "title": "Thai beef patties", "url": "www_bbc_co_uk_food_recipes_thaibeefpatties_84008", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz rump steak, finely chopped", "1 garlic clove", "¼ tsp dried chilli flakes", "½ tsp sesame oil", "2 tbsp chopped fresh coriander", "½ free-range egg, lightly beaten", "sea salt and freshly ground black pepper", "100g/3½ oz green beans, trimmed and thinly sliced", "1 tsp plain flour", "2 tbsp olive oil", "fresh coriander to garnish", "1 tsp toasted sesame seeds, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the steak, garlic, chilli, sesame oil, coriander and egg into a food processor. Blend to combine the ingredients.Season with salt and freshly ground black pepper.", "Transfer into a bowl and stir through the green beans. Lightly flour your hands and form the meat mixture into four patties.", "Heat the oil in a deep frying pan over a medium-high heat. Place the beef patties into the frying pan and fry for about three minutes on each side, until golden and cooked through.", "To serve, place the patties on a bed of fresh coriander leaves and sprinkle over the toasted sesame seeds."]}, {"isVegetarian": false, "title": "Thai chicken cakes with a sweet chilli dipping sauce", "url": "www_bbc_co_uk_food_recipes_thaichickencakeswith_66006", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken fillets", "2 bird's-eye red chillies, chopped", "1 tsp peeled and finely grated galangal", "1 tsp finely chopped lemongrass", "2 spring onions, finely chopped", "15g/½ oz coriander, including stalks, chopped", "1 lime, zest of half and juice", "2 tbsp vegetable oil", "salt and freshly ground black pepper", "55g/2oz caster sugar", "55ml/2fl oz water", "½ tsp crushed dried chilli flakes"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a medium bowl mix together the galangal, lemongrass, spring onion, coriander, lime zest and juice. Season.", "In a food processor blend together the chicken and chilli.", "Add the galangal mixture to the chicken and blend again until just combined.", "Carefully remove the mixture from the processor, divide into eight potions and shape each portion into a cake.", "In a small saucepan mix together the sugar, water and chillies, then place over a low heat and cook until a syrup forms.", "Heat the oil in a medium frying pan.", "Fry the cakes in the oil for 2-3 minutes each side or until cooked through and golden.", "Serve the cakes with the dipping sauce in a separate dish to the side."]}, {"isVegetarian": false, "title": "Thai vegetable curry", "url": "www_bbc_co_uk_food_recipes_thai_vegetable_curry_41763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_vegetable_curry_41763_16x9.jpg", "ingredients": ["250g/9oz glutinous (sticky) rice (available from Asian greengrocers)", "4 small red onions, peeled and roughly chopped", "16 garlic cloves, peeled", "12 stalks lemongrass, outer leaves removed, core roughly chopped", "8 long red chillies, stems removed", "8 tbsp chopped fresh coriander (roots and leaves)", "8 tsp chilli powder", "10cm/4in piece fresh galangal, peeled", "4 tsp grated lime zest", "4 fresh lime leaves", "4 tsp shrimp paste (available from Asian greengrocers)", "12 tsp hot paprika", "8 tsp ground turmeric", "2 tsp cumin seeds", "8 tbsp vegetable oil", "2 tbsp vegetable oil", "1 large leek, trimmed, thinly sliced", "2 garlic cloves, crushed to a paste", "1 large red chilli, trimmed, finely chopped", "2 tbsp Thai red curry paste (see above)", "4 fresh lime leaves", "2 carrots, peeled, roughly chopped ", "400g/14oz canned chopped tomatoes", "400g/14oz coconut milk", "250ml/9fl oz vegetable stock", "I small cauliflower, trimmed, cut into florets", "½ small butternut squash, peeled, seeds removed, flesh cut into 2.5cm/1in pieces", "175g/7oz snake or French beans, trimmed", "1 x 225g/8½oz can bamboo shoots, drained", "bunch fresh coriander, chopped", "handful fresh beansprouts, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the sticky rice, before starting to make the curry, soak the sticky rice in cold water for at least 20 minutes, or up to 3 hours.", "For the Thai red curry paste, blend all of the Thai red curry paste ingredients to a smooth paste in a food processor.", "For the curry, heat one tablespoon of the vegetable oil in a large wok over a high heat. When the oil is smoking, add the leek, garlic and chilli and stir-fry for 3-5 minutes, or until softened but not browned.", "Add the two tablespoons of curry paste and fry for 2-3 minutes, stirring well.", "Add the lime leaves, carrots and chopped tomatoes, then pour in the coconut milk and vegetable stock, stirring well to combine. Bring the mixture to the boil, then reduce the heat until simmering and continue to simmer, uncovered, for 10 minutes.", "Add the cauliflower florets, butternut squash, French beans and bamboo shoots and continue to simmer for 12-15 minutes, or until the butternut squash is tender and the sauce has thickened slightly and reduced in volume.", "Meanwhile, to cook the sticky rice, drain the soaked rice and rinse thoroughly. Punch a few holes in a sheet of baking paper and line a metal or bamboo steamer with it. Add the drained rice to the steamer, cover tightly and suspend the steamer over a pan of boiling water for 20 minutes. (Do not allow the bottom of the steamer to touch the surface of the water.)", "When the vegetables in the curry are tender and the sauce has thickened, stir in the chopped coriander.", "To serve, spoon the sticky rice into bowls, ladle over the vegetable curry and garnish with a few beansprouts."]}, {"isVegetarian": false, "title": "Thai chicken patties with a sweet chilli dipping sauce and griddled spring onions", "url": "www_bbc_co_uk_food_recipes_thaichickenpattieswi_70011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz minced chicken", "30g/1oz coriander, chopped (stalks and leaves)", "1 red chilli, finely chopped", "2 garlic cloves, finely chopped", "salt and freshly ground black pepper", "1 stalk lemongrass, finely shredded", "1 thumb-size lump of ginger, finely chopped", "1 tbs dark soy sauce", "2 kaffir lime leaves, finely shredded", "1 lime, juice only", "6 spring onions", "sesame oil", "cooking oil", "30g/1oz dried chilli flakes", "110g/4oz of caster sugar", "120ml/4fl oz water"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the sweet chilli sauce, mix together the sugar and water and bring to the boil.  Add the chilli flakes reduce to a simmer and cook for 40 minutes. Set aside to cool.", "Brush the spring onions with sesame oil and griddle for 2 minutes.", "For the chicken patties mix all the ingredients together and marinade together for 20 minutes. Using your hands create small patties about the size of a tablespoon. Fry in a mixture of sesame and plain oil for 5 minutes on each side. Lay the spring onions on a plate and  lay the patties on top. Place a small bowl of dipping sauce on the plate and sprinkle with coriander."]}, {"isVegetarian": false, "title": "Thai coconut mussels", "url": "www_bbc_co_uk_food_recipes_thaicoconutmussels_93907", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves, peeled, roughly chopped", "5cm/2in piece galangal, or ginger, peeled, chopped", "2 stalks lemongrass ", "2 fresh lime leaves, roughly chopped", "4 shallots, preferably Thai, peeled, chopped", "1 tbsp palm sugar", "1 tbsp fish sauce", "1 tbsp vegetable oil", "1kg/3lb 3oz mussels, beards removed, cleaned (discard any mussels that do not close tightly when tapped gently)", "400ml/14fl oz coconut milk", "1 lime, juice only", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh Thai holy basil", "1 tbsp chopped fresh mint", "vegetable oil, for deep frying", "3 large baking potatoes, peeled, julienned", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Thai coconut mussels, crush the garlic, galangal, lemongrass, lime leaves, shallots, palm sugar, fish sauce and vegetable oil in a pestle and mortar to a paste.", "Heat a lidded wok over a high heat and fry the paste for 1-2 minutes, or until fragrant.", "Add the mussels and coconut milk, cover with a lid and bring to the boil. Reduce the heat and simmer for 2-3 minutes, or until the mussels have opened. (Discard any mussels with shells that have not completely opened.)", "Meanwhile, for the straw fries, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep fat fryer to 190C.", "Carefully lower the julienned potatoes into the hot oil, and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the oil and set aside to drain on kitchen paper. Season, to taste, with salt and freshly ground black pepper. (You may need to do this in batches.)", "To serve stir the lime juice, coriander, Thai basil and mint intto the mussels. Spoon the mussels into each of 4 serving bowls and spoon the chips alongside."]}, {"isVegetarian": false, "title": "Thai fishcakes served with Thai cucumber salad", "url": "www_bbc_co_uk_food_recipes_thaifishcakesservedw_73733", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaifishcakesservedw_73733_16x9.jpg", "ingredients": ["500g/1lb 2oz fish fillets (whiting, pollock, coley, etc)", "½ red pepper, chopped", "2 red chillies, chopped", "2 tbsp coriander ", "3 spring onions, finely chopped", "2 cloves garlic, chopped", "1 stalk lemongrass, tender part only, chopped", "1 tbsp fish sauce", "125ml/4fl oz coconut milk", "1 whole egg", "125g/4½oz green beans ", "vegetable oil ", "2 cucumbers peeled, halved lengthways and de-seeded", "35g/1¼oz caster sugar", "50ml/2fl oz rice vinegar", "2 hot chillies, finely diced", "2 shallots, finely diced", "2 tbsp chopped coriander leaves", "40g/1½oz roasted peanuts, chopped", "½ tbsp nam pla (fish sauce)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Cut the fish into small pieces. Place the pepper, chillies, coriander, spring onions, garlic, lemongrass and fish sauce into a food processor and blend to a paste. ", "Add the fish pieces to the paste and blend well. Mix to a smooth paste adding coconut milk and egg.", "Place the mixture in a bowl. Slice the beans finely into 3mm (1/8in) and stir into fish paste. Chill in refrigerator overnight or for at least two hours.", "Half-fill a heavy-based frying pan with oil and heat over a medium to high heat. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Shape the chilled paste into small patties with the help of a spoon. Carefully lower the fish patties into the hot oil, in batches (the oil should reach halfway up the sides of the patties). Fry until crisp and brown, turning once during cooking. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining fish patties.", "For the salad, cut the cucumber in to 5mm (¼in) slices ", "Dissolve the sugar in the vinegar and toss the cucumber slices in it. Fold in the chilli, shallot and coriander.", "Sprinkle with the peanuts and fish sauce just before serving."]}, {"isVegetarian": false, "title": "Thai green chicken curry with crisp carrot strips", "url": "www_bbc_co_uk_food_recipes_thaigreenchickencurr_84582", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm piece root ginger, chopped", "25g/1oz fresh coconut", "pinch chilli flakes", "1 lime, zest and juice only", "3 cloves garlic", "large handful fresh coriander", "2 tbsp coconut water", "75g/2½oz fresh spinach", "1 lime, juice only", "pinch dried chilli flakes", "2 tsp soy sauce", "1 tbsp olive oil", "½ garlic clove, chopped", "2 tsp honey", "1 chicken breast", "500ml/18fl oz hot vegetable oil, for deep frying", "2 carrots, cut into long thin strips, dried on kitchen paper", "salt"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry paste, place all of the curry paste ingredients, except the spinach, into a food processor and blend to a smooth a paste.", "Pour the paste into a frying pan over a medium heat and fry for 3-4 minutes to bring out the flavours and fragrances of the paste.", "Add the spinach and fry for one minute, until wilted down.", "For the chicken, place all of the chicken ingredients into a bowl, stir well,  then leave to marinate for ten minutes.", "Heat a griddle pan until smoking, then add the chicken and griddle for 5-7 minutes each side, or until completely cooked through. (Check that the juices run clear when pierced with a skewer at its thickest point.)", "For the crisp carrot strips, heat the vegetable oil in a deep, heavy-bottomed saucepan, until a breadcrumb sizzles and turns golden in 30 seconds when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Add the carrots and deep-fry for 5-6 minutes, or until turning golden and crisp. Carefully remove with a slotted spoon and drain on kitchen paper. Sprinkle the carrot strips with salt to taste.", "To serve, pour the curry paste sauce into the centre of a plate. Place the chicken on top and place with a handful of crisp carrot strips on top."]}, {"isVegetarian": false, "title": "Thai fragrant salmon with pak choi", "url": "www_bbc_co_uk_food_recipes_thaifragrantsalmonwi_72333", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch coriander, washed", "12 mint leaves, washed", "1 tsp salt", "3 cloves garlic, crushed", "2 green chillies, seeds removed", "3 tbsp fresh lime juice", "1 tbsp fish sauce (nam pla)", "2 tbsp caster sugar", "2 tsp peeled and chopped ginger", "4 x 175g/6oz salmon fillets", "450g/1lb pak choi", "1 tbsp sesame oil", "1 tbsp vegetable oil", "1 clove garlic, thinly sliced", "85g/3oz spring onions, finely sliced", "2 red chillies, de-seeded and finely sliced", "salt and freshly ground black pepper", "1 tbsp soy sauce"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a food processor, blend together the coriander leaves and stalks, the mint leaves, salt, garlic and chillies to make a paste. ", "Add the lime juice, fish sauce, one tablespoon of the caster sugar and one teaspoon of the ginger, and process until smooth. Spoon the sauce into a bowl and combine with the salmon. Marinate for 20 minutes.", "Boil water in the bottom half of a steamer. Place the bowl with the marinated salmon in the top half and steam it for 6-8 minutes.", "Blanch the pak choi in boiling salted water for two minutes, drain and refresh.", "In a wok, heat the sesame oil and vegetable oil. When hot, add the garlic, spring onions, chillies and the remaining ginger.  Cook for one minute.  ", "Add the soy sauce, the remaining caster sugar and the pak choi.  Toss to warm through.  Season to taste.", "Place the pak choi in the centre of a serving plate and put the steamed salmon on top.  Serve immediately with the salad."]}, {"isVegetarian": false, "title": "Thai green chicken curry with lemongrass jasmine rice", "url": "www_bbc_co_uk_food_recipes_thaigreenchickencurr_86295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "2 banana shallots, finely sliced", "2 tbsp Thai green curry paste", "400ml/14fl oz coconut milk", "1 tsp fish sauce", "4 chicken thighs, boneless and skinless", "250g/9oz new potatoes, peeled and halved", "125g/4½oz pea aubergines (available at some supermarkets or Asian grocers)", "1 lime, juice only", "salt and freshly ground black pepper", "250g/9oz Thai jasmine rice", "1 stalk lemongrass, lightly crushed", "500ml/18fl oz water", "handful fresh coriander, leaves only, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry, heat a large deep lidded frying pan or wok until hot, then add the vegetable oil and the shallots. Stir fry for one minute, then add the curry paste and stir fry for a further minute.", "Add the coconut milk and bring to the boil.", "Add the fish sauce, chicken thighs, potatoes and aubergines and return to a simmer. Cover with a lid and simmer gently for 15-20 minutes, or until the chicken is completely cooked through and the potatoes are tender. Add the lime juice, season, to taste, with salt and freshly ground black pepper and stir.", "Meanwhile, for the rice, place the rice and lemongrass into a small saucepan and cover with the cold water. Cover with a lid and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the rice is tender and all the water has been absorbed. Remove the lemongrass.", "To serve, place the rice onto serving plates, top with the curry and sprinkle over the coriander."]}, {"isVegetarian": false, "title": "Thai green chicken curry", "url": "www_bbc_co_uk_food_recipes_thaigreenchickencurr_92440", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaigreenchickencurr_92440_16x9.jpg", "ingredients": ["1 tbsp vegetable oil ", "1-2 tbsp ready-made green curry paste", "6 chicken thighs, skin and bones removed, meat cut into strips", "400ml tin coconut milk", "2 lime leaves (optional)", "2 tbsp Thai fish sauce", "1 tbsp sugar ", "handful green beans, trimmed ", "handful asparagus spears", "salt and freshly ground black pepper", "Thai fragrant rice, cooked according to packet instructions", "handful fresh coriander leaves (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok over a high heat until smoking. Add the green curry paste and stir fry for 1-2 minutes, or until fragrant.", "Add the chicken strips and stir until coated in the curry paste. Continue to stir-fry for 1-2 minutes, or until the chicken has browned on all sides.", "Add the coconut milk, lime leaves, fish sauce and sugar and stir well. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 8-10 minutes, or until the sauce has thickened.", "Add the green beans and asparagus and continue to simmer for 2-3 minutes, stirring regularly, until just tender. Season with salt and pepper. ", "To serve, spoon the rice into four serving bowls, then ladle over the Thai green chicken curry. Sprinkle over the coriander leaves."]}, {"isVegetarian": false, "title": "Thai green curry", "url": "www_bbc_co_uk_food_recipes_thaigreencurry_67788", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaigreencurry_67788_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "2 tbsp  Thai green curry paste (according to taste)", "1 tbsp soft dark brown sugar", "1-2 thick stalks lemongrass, fat ends bashed with a rolling pin (optional)", "750g/1½lb skinless, boneless chicken, cut into chunks (use breast and/or leg meat)", "6-8 kaffir lime leaves, torn into pieces (if unavailable, use the grated zest of 1 lime)", "400ml/14fl oz coconut milk", "Good shake of Thai fish sauce or light soy sauce", "Small handful of coriander, roughly chopped", "½-1 lime, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok or large frying pan. Add the green curry paste and sugar and cook over a fairly high heat for about a minute, stirring with the lemongrass, if using. Reduce the heat slightly and stir in the chicken pieces and lime leaves or zest until coated in the paste. Add the coconut milk, fish sauce or soy sauce and bring to a simmer, cooking for 25-30 minutes until thickened slightly. Stir in the coriander and lime juice. Check for seasoning, adding more fish sauce or soy sauce if needed.", "The curry is now best left to sit for a few minutes so the sauce becomes creamier. You will also taste the true flavours of the curry paste ingredients when it's slightly cooler. Serve with lots of fragrant Thai jasmine rice."]}, {"isVegetarian": false, "title": "Thai green curry with aubergine and prawns", "url": "www_bbc_co_uk_food_recipes_thaigreencurrywithau_84641", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 tiger prawn, shells and heads only", "100ml/3½fl oz boiling water", "15g/½oz root ginger", "1 tbsp vegetable oil", "4 baby aubergines, cut into wedges", "1 scotch bonnet chilli, sliced", "30g/1oz root ginger, cut into batons", "2 garlic cloves, chopped", "4 tiger prawns", "2 spring onions, chopped", "large handful fresh coriander", "2 tbsp double cream", "1 lime, zest only", "large handful fresh mint", "1 scotch bonnet chilli, chopped", "2 tbsp fresh basil,  chopped", "2 tbsp Greek yoghurt", "fresh coriander leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawn stock, place the prawn shells and heads, boiling water and ginger into a saucepan and boil for ten minutes. ", "Strain the mixture into a clean bowl.  Discard the shells and ginger.", "For the aubergines and prawns, heat the oil in a wok until smoking hot.  Add the aubergines and cook for two minutes. Add the chilli, ginger and garlic to the wok and cook for one minute. ", "Add the prawns and spring onions to the wok and cook for 2-3 minutes or until the prawns are coloured on all sides and are cooked through.", "For the curry paste, place all the ingredients into the bowl of a food processor and blend to a paste.  ", "Add the paste and the prawn stock to the aubergines and prawns in the wok and cook for three minutes. ", "To serve, stir in the basil and pour into a serving bowl.  Garnish with the Greek yoghurt and the fresh coriander leaves."]}, {"isVegetarian": true, "title": "Thai green rice", "url": "www_bbc_co_uk_food_recipes_thaigreenrice_68034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12fl oz/340ml basmati rice ", "50g/2oz creamed coconut ", "4 cloves garlic ", "2 large or 3 medium-sized fresh green chillies ", "4cm cube root ginger ", "20g fresh coriander ", "1½ tbsp groundnut or other flavourless oil ", "3 x 2in/5cm pieces cinnamon stick ", "6 whole cloves ", "15 black peppercorns ", "1½ oz/40g unsalted cashew nuts, halved ", "2 medium onions, peeled and finely sliced ", "4oz/110g fresh peas, or frozen and defrosted ", "1½ level tsp salt, or to taste", "15fl oz/425ml hot water ", "2 tbsp lime juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Begin by dissolving the creamed coconut in the boiling water, then place it in a food processor with the garlic, chillies, ginger and coriander stalks, whizzing until everything is finely chopped.", "Leave this aside while you heat the oil over a gentle heat in the frying pan, then add the cinnamon sticks, cloves, peppercorns and cashew nuts to the pan and sauté everything gently for about 1 minute. Next, add the onions and continue to cook over a medium heat until they become softened and pale gold in colour, which will take 8-10 minutes. Next add the rice, then stir once and cook for another 2-3 minutes. After that, add the coconut mixture, give everything a stir, and cook for a further 2-3 minutes. Now add the peas, salt and hot water, bring it all up to a gentle simmer, then cover with the lid. Turn the heat to low and let everything cook very gently for 8 minutes; use a timer here, and don't lift the lid.", "Then remove the pan from the heat, take the lid off and cover the pan with a cloth for 10 minutes before serving. Finally, remove the pieces of cinnamon, sprinkle in the lime juice and the finely chopped coriander leaves, then fork the rice gently to separate the grains. Garnish with the reserved whole coriander leaves."]}, {"isVegetarian": false, "title": "Spicy sea bass stew", "url": "www_bbc_co_uk_food_recipes_thaigreenseabasscurr_88784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "½ onion, finely sliced", "pinch dried chilli flakes", "1 clove garlic, chopped", "¼ red pepper, chopped", "4 cherry tomatoes, halved", "85g/3oz sugar snap peas", "1 lime, zest only", "1 tbsp soy sauce", "1 tsp sesame oil", "1 tbsp honey", "2 tbsp fresh chopped coriander", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "1 sea bass fillet, cut into cubes", "150g/5½ oz basmati rice, cooked according to packet instructions (cooked weight)", "fresh coriander leaves, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan and fry the onion and chilli until softened, then add the garlic and fry for one minute. Stir in the red pepper, cherry tomatoes and sugar snaps and fry for 2-3 minutes.", "Add the lime zest, soy sauce, sesame oil, honey, coriander, and cream. Season with salt and freshly ground black pepper and bring to the boil, then reduce the heat and simmer for ten minutes. Add the sea bass pieces and cook for 2-3 minutes, or until the fish is just-cooked.", "Spoon the curry into serving bowls and garnish with the coriander leaves. Serve with basmati rice."]}, {"isVegetarian": false, "title": "Simple Thai noodle soup", "url": "www_bbc_co_uk_food_recipes_thaiinspirednoodleso_92377", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaiinspirednoodleso_92377_16x9.jpg", "ingredients": ["1 good knob fresh root ginger, peeled and roughly chopped", "1-2 red chillies, seeds removed (optional), roughly chopped", "1-2 stalks lemongrass, tough outer layers removed, roughly chopped", "2-3 garlic cloves, peeled ", "1 handful fresh coriander, a few sprigs reserved and chopped", "a glug or two vegetable oil", "1 tbsp coriander seeds", "1-2 pinches ground turmeric", "small jug vegetable stock ", "a couple of handfuls rice noodles", "1 x 400ml/14fl oz can coconut milk", "1 large handful raw, peeled tiger prawns (the shells and heads can be reserved for making stock in another recipe)", "a few splashes Thai fish sauce, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the ginger, chilli, lemongrass, garlic and coriander in a food processor until quite finely chopped, adding a little vegetable oil if the paste is too dry.", "Add the paste to a large shallow pan and cook for a few minutes to release the aromas, stirring frequently. Roughly crush some coriander seeds with a pestle and mortar and add to the paste with a pinch or two of turmeric and the vegetable stock and simmer for a few minutes. ", "Meanwhile, pour some boiling water over the rice noodles in a bowl and let them sit until they have softened, about 4-5 minutes, then drain and set aside. ", "To soften the heat of the sauce, add the coconut milk to the pan and bring back to the boil. Reduce the heat and simmer for a few minutes while you devein the prawns by cutting along the back of the prawn with a small sharp knife and removing the black 'thread' using the point of the knife. Add the prawns to the pan and cook for 2-3 minutes, or until pink and tender, finishing off with splashes of Thai fish sauce, to taste, and more chopped fresh coriander, to your taste.", "To serve, divide the drained noodles between two bowls and ladle over the aromatic soup with the prawns and serve straightaway. Chicken, scallops or mushrooms are a great alternative to the prawns."]}, {"isVegetarian": false, "title": "Thai lemongrass and chilli vegetable soup", "url": "www_bbc_co_uk_food_recipes_thailemongrassandchi_90103", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "½ onion, chopped", "3 garlic cloves, skin-on and squashed", "2 tsp freshly grated root ginger", "1 sea bass, head and tail only", "1 lemongrass stalk, crushed", "400ml/14fl oz boiling water", "3 tbsp tomato ketchup", "½ tsp Tabasco sauce", "100ml/3½fl oz fresh coconut milk", "85g/3oz tenderstem broccoli, chopped", "3 tbsp grated fresh coconut ", "1 red chilli, chopped", "½ lime, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and gently fry the onion, garlic and ginger for 3-4 minutes, or until softened. Add the fish head and tail and lemongrass, stirring to coat in the oil, then pour over the boiling water and simmer for 6-8 minutes.", "Strain the mixture through a sieve into a clean pan, then add the ketchup, Tabasco sauce and coconut milk and simmer for a further 2-3 minutes. Add the broccoli, grated coconut, chilli and lime juice and cook for 3-4 minutes, or until the broccoli is tender.", "Ladle into bowls and serve immediately."]}, {"isVegetarian": true, "title": "Thai noodles", "url": "www_bbc_co_uk_food_recipes_thainoodles_66007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g packet medium egg noodles", "1 tsp sesame oil", "2 tsp soy sauce", "1 tsp peeled and finely grated galangal", "2 bird's-eye red chillies, chopped", "2 tsp chopped fresh holy basil", "1 tsp chopped fresh coriander", "1 lime, juice only", "1 tsp clear honey", "1 tsp sesame seeds"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodle according to  the packet instructions.", "In a large bowl mix together the remaining ingredients.", "Drain and toss the noodles in the Thai mixture.", "Serve."]}, {"isVegetarian": false, "title": "Thai peanut, vegetable and coconut noodles", "url": "www_bbc_co_uk_food_recipes_thaipeanutvegetablea_85256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 400g/14oz tin coconut milk", "1 tbsp sunflower or peanut oil", "2 tbsp ready-made red curry paste", "3 tbsp crunchy peanut butter", "300ml/10½fl oz vegetable stock", "3 tbsp fish sauce, plus more to taste", "1 tbsp brown sugar", "250g/8¾oz medium rice noodles", "150g/5¼oz baby sweetcorn, cut into slices at an angle", "150g/5¼oz broccoli, cut into small florets", "150g/5¼oz mangetout, cut in half at an angle", "50g/1¾oz spring onions, sliced at an angle", "100g/3½oz toasted unsalted peanuts, roughly chopped", "2 tbsp torn basil or roughly chopped coriander", "salt and freshly ground black pepper"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["If the coconut milk has divided into two parts (watery and thick), separate it by carefully spooning off the thick part and pouring the watery part into a small jug; set both aside.", "Heat a wok or a large wide pan over a medium heat until hot, add the oil and the thick part of the coconut milk (if the coconut milk has not separated into two parts, add all the coconut milk at this stage). ", "Stir this over a medium heat until the coconut milk starts to separate and thicken.", "Add the curry paste and peanut butter and mix to combine. Then add the stock, fish sauce and brown sugar and bring to the boil.", "Place the noodles in a bowl and cover with boiling water. Leave for five minutes to soften, then drain.", "Meanwhile add the baby sweetcorn and broccoli to the wok or pan and cook, uncovered for one minute. Add the mangetout and spring onion, and cook for a further 1-2 minutes until the vegetables are tender.", "Stir half of the chopped peanuts and half of the basil or coriander into the vegetables and sauce. Season with salt and freshly ground black pepper, and add more fish sauce if you want it to be a bit more salty. ", "Finally, add the drained noodles and stir to combine. ", "Place in a large warm serving bowl, or individual bowls. Scatter with the remaining peanuts and herbs and serve straightaway."]}]