[{"ingredients": ["50g / 2oz de mantequilla", "50 g / 2 oz de azúcar en polvo", "4 peras, peladas y cortadas a la mitad", "Harina normal 225g / 8oz", "100g / 3½oz de mantequilla sin sal", "25 g / 1 oz de azúcar en polvo", "1 huevo de gallinas camperas", "1 cucharada de leche, para unir, si es necesario", "225g / 8oz de mantequilla sin sal", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "1 limón, ralladura solamente, finamente rallado", "Harina normal de 50g / 2oz", "175 g / 6¼ oz de almendras molidas", "100 g / 3½ oz de mantequilla", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de chocolate negro", "1 cucharada de cacao en polvo", "½ cucharadita de extracto de vainilla", "125ml / 4fl oz de agua", "doble crema"], "method": ["Derrita la mantequilla con el azúcar en una sartén grande y cocine hasta que el azúcar se haya disuelto y la mezcla se haya convertido en un caramelo dorado.", "Agregue las mitades de pera y cocine, volteándolas una vez, hasta que estén caramelizadas por completo. Sáquelo del fuego y apártelo.", "Para la masa, coloque la harina común, la mantequilla y el azúcar en un procesador de alimentos y pulse juntos hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo y el pulso hasta que la mezcla se una como masa. Agregue un poco de leche si es necesario.", "Retire la masa del procesador de alimentos y ruede para formar una bola. Envuelva la película adherida y deje enfriar en la nevera durante 40 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Retire la masa del refrigerador y desenvuelva. Ruede los pasteles sobre una superficie de trabajo enharinada limpia para forrar una lata de tarta de 20cm / 8in. Transfiera al horno para hornear por diez minutos o hasta que se dore.", "Para el relleno, mezcle la mantequilla y el azúcar en un tazón hasta que estén suaves y esponjosos.", "Agregue un huevo a la vez a la mezcla de mantequilla y mezcle bien, antes de agregar el siguiente (esto se puede hacer en un mezclador de alimentos) hasta que todos los huevos se mezclen con la mantequilla y el azúcar.", "Agregue la ralladura de limón, la harina común y las almendras molidas y mezcle bien para combinar.", "Vierta el relleno en la masa de hojaldre horneada y presione las mitades de pera caramelizadas en el relleno, de modo que queden medio sumergidas.", "Transfiera al horno y hornee por 30 minutos, o hasta que el relleno esté cocido.", "Para la salsa de chocolate, coloque la mantequilla, el azúcar, el chocolate, el cacao en polvo, el extracto de vainilla y el agua en una sartén limpia a fuego medio. Llevar a ebullición y cocine a fuego lento durante 15 minutos, revolviendo regularmente, hasta que la salsa esté espesa y brillante.", "Para servir, corte un pedazo de tarta y colóquelo en un plato para servir, cubra con la salsa de chocolate y rocíe sobre la crema doble."], "url": "www_bbc_co_uk_food_recipes_peartart_87097", "title": "Tarta de pera", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de hojaldre lista para preparar de 500 g / 1 lb 2 oz, laminada a 5 mm / ¼ pulgada de grosor", "3 peras pequeñas, peladas y cortadas a la mitad", "1 limón, cáscara y jugo solamente", "50 g / 2 oz de azúcar en polvo", "6 cucharadas de mermelada de albaricoque", "1 vaina de vainilla, partido, semillas raspadas", "300ml / ½ pinta de leche entera", "2 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "20g / ¾oz de harina de maíz", "3 cucharadas de licor dulce de pera, como Poire William", "300 ml / 11 fl oz crema doble", "6 ramitas de menta fresca"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las tartas, recorte la masa de hojaldre para que quepan seis cajas de tarta de 10 cm / 4 in. Cubra las cajas con la masa de hojaldre y colóquelas en la nevera durante 30 minutos para que se enfríen.", "Pinche la base de la masa en cada caja para tarta con un cuchillo, luego forre con papel para hornear y hornee frijoles o arroz y colóquelos en una bandeja para hornear. Transfiera al horno y hornee a ciegas durante 15 minutos.", "Retire el papel de hornear y los frijoles para hornear de las cajas de tarta y coloque las tartas en el horno para hornear por otros 5-8 minutos, hasta que estén cocidas y doradas. Retire del horno y deje enfriar en una rejilla de alambre.", "Mientras tanto, coloca las peras, la ralladura de limón y el jugo y el azúcar en una sartén y cúbrelos con agua. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10-12 minutos, o hasta que las peras estén cocidas y tiernas. Retirar del fuego y dejar enfriar.", "Para la crema, coloque las semillas de vainilla y la leche en una sartén y deje que hierva.", "Mientras tanto, coloca las yemas de huevo, el azúcar y el aciano en un bol y mezcle bien.", "Una vez que la leche esté hirviendo, vierta sobre la mezcla de huevo y bata vigorosamente. Vierta la mezcla de crema en la sartén y vuelva a hervir, revolviendo constantemente.", "Una vez que la mezcla haya alcanzado el punto de ebullición, retire la olla del fuego y déjela enfriar.", "Mientras tanto, vierta el licor de pera en la crema y látigo hasta que se formen suaves picos cuando se quite la batidora.", "Dobla la mezcla de crema en la crema pastelera suavemente, para no perder demasiado volumen.", "Coloque la mermelada de albaricoque en una olla con una cucharadita de agua y caliente.", "Llene las cajas de repostería enfriadas con la crema de licor de pera.", "Coloque una mitad de pera escalfada en un tablero y corte en rodajas. Airee las rebanadas de pera ligeramente y colóquelas suavemente sobre la crema.", "Vierta la salsa de albaricoque caliente sobre las peras.", "Para servir, coloque cada tarta en un plato de postre y adorne con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_peartartswithpoirewi_85533", "title": "Tartas de pera con crema Poire William", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de caldo de verduras", "50g / 1¾oz de mantequilla", "300g / 10½oz de guisantes congelados", "2 lechugas Little Gem, 1 triturado, 1 cortado en cuartos a lo largo", "3 ramitas de estragón", "sal y pimienta", "1 baguette pequeño o bastón, cortado en 12 rebanadas", "4 huevos", "1 cucharadita de vinagre de vino blanco"], "method": ["Caliente el caldo y la mantequilla en una sartén grande hasta que hierva a fuego lento, revolviendo para mezclar. Agregue los guisantes y cocine durante dos minutos, luego agregue la lechuga Little Gem y dos ramitas de estragón. Cocine durante 3-4 minutos, o hasta que la lechuga se haya marchitado, pruebe y sazone con sal y pimienta al gusto. Retire del fuego.", "Mientras tanto, tueste las rebanadas de pan en una sartén de plancha, debajo de una parrilla caliente o en la tostadora. Sazonar con una pizca de sal y pimienta en ambos lados.", "Calienta una bandeja de agua grande, ancha y poco profunda. Rompa un huevo en una taza de té o un molde. Bata el vinagre y una pizca de sal en el agua y vierta suavemente el huevo en el agua turbulenta. Cueza al horno durante 3-4 minutos o hasta que el blanco esté listo y la yema todavía se moje (o hasta que esté cocida a su gusto). Retire con una espumadera y seque. repite con los huevos restantes.", "Retire las ramitas de estragón de los guisantes. Sirva los guisantes en las tostadas con un huevo escalfado encima. Sazonar el huevo con una pizca de sal y pimienta y decorar todo con hojas rotas de la ramita restante de estragón. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_peas_a_la_franais_with_03769", "title": "Guisantes a la francesa con huevos escalfados y tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de caldo de pollo", "50 g / 1¾ oz mantequilla, más extra para freír las vieiras", "sal marina", "pimienta negra", "150g / 5½oz de guisantes frescos", "100 g / 3½ oz girolles (champiñones)", "Crema doble de 200 ml / 7 fl oz", "2 yemas de huevo de gallinas camperas", "10 hojas de menta fresca picada", "4 vieiras grandes (con o sin huevas, como prefiera)", "1 chalote de plátano, finamente cortado", "aceite de oliva, al gusto", "jugo de limón, al gusto", "azúcar pizca", "gran puñado de brotes de guisantes"], "method": ["En una sartén, ponga a hervir el caldo y la mantequilla. Sazone con sal y pimienta, agregue los guisantes y los champiñones y cocine por 2-3 minutos, o hasta que estén tiernos.", "Retire los guisantes y las setas de la sartén. Vierte la mitad de la crema en la sartén y llévala a ebullición. Cocine hasta que el volumen del líquido se haya reducido a una consistencia de salsa.", "Precalentar la parrilla a caliente.", "Coloque las yemas de huevo en un recipiente y mezcle con la crema reducida. Batir la crema restante hasta que se formen picos suaves cuando se quite la batidora. Agregue los guisantes, los champiñones y la menta a la salsa, luego agregue una cucharada de la crema batida.", "Vierta la mezcla en un recipiente resistente al calor y colóquela debajo de la parrilla por unos minutos, o hasta que las verduras estén glaseadas y la salsa burbujee.", "Calentar un poco de mantequilla en una sartén hasta hacer espuma. Coloque las vieiras preparadas en la sartén caliente y cocine durante un minuto y medio en ambos lados, o hasta que estén doradas y recién cocidas.", "En un tazón, mezcle la chalota con un poco de aceite de oliva, jugo de limón y una pizca de azúcar.", "Para servir, divida los guisantes glaseados y los champiñones entre las placas para servir. Coloque las vieiras en la parte superior y coloque la mezcla de chalotes en la parte superior. Viste las placas con los brotes de guisantes."], "url": "www_bbc_co_uk_food_recipes_peas_mint_girolles_and_53451", "title": "Guisantes, menta, girolles y vieiras chamuscadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz peas, fuera de sus vainas", "1 chile rojo largo, sin semillas, finamente picado", "1 diente de ajo, pelado, finamente picado", "½ limón, solo jugo", "½ cucharada de aceite de oliva virgen extra", "copos de sal marina y pimienta negra recién molida", "100 g / 3½ oz de yogur firme, salado, colado o queso fresco de cabra suave", "pequeña puñado de hojas de menta fresca, rasgada"], "method": ["Cocine los guisantes en una sartén con agua hirviendo con sal durante 1-2 minutos o hasta que estén tiernos. Escurrir bien, luego actualizar en agua fría hasta que esté frío.", "En un tazón grande, mezcle bien los guisantes cocidos y enfriados, el chile, el ajo, el jugo de limón y el aceite de oliva hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Divida el yogur colado o el queso de cabra en pedazos del tamaño de un bocado y espolvoree sobre la mezcla de guisantes. Espolvorear sobre las hojas de menta y mezclar ligeramente para combinar.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_peasaltedyoghurtandm_91778", "title": "Ensalada de guisantes, yogur salado y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peasaltedyoghurtandm_91778_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "75g / 2½oz de guisantes frescos", "150ml / 5fl oz de caldo de verduras calientes", "50 ml de crema doble, más 1 cucharadita extra, para servir", "sal y pimienta negra recién molida", "ramita de menta fresca, para adornar"], "method": ["Caliente el aceite de oliva en una olla pequeña a fuego medio. Agregue las cebollas y fríelas suavemente por tres minutos, hasta que se ablanden.", "Agregue los guisantes y el caldo, lleve a ebullición, luego reduzca el fuego a fuego lento durante 10 minutos.", "Agregue la crema doble, sal y pimienta y caliente durante un minuto. Vierta en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, vierta en un tazón y adorne con un remolino de crema doble y una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_peasoup_81686", "title": "Sopa de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear", "50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de queso azul", "1 huevo de gallinas camperas", "50ml / 2fl de leche en oz", "1 cucharada de aceite de oliva", "1 diente de ajo, picado", "1 chalote de plátano, picado", "Guisantes 200 g / 7 oz", "300ml / 10½fl oz de caldo de pollo caliente", "50g / 1¾oz de queso azul", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer los bollos de queso azul, coloque la harina, el polvo de hornear y la mantequilla en un procesador de alimentos y mezcle.", "Agregue el queso, el huevo y la leche y mezcle de nuevo, hasta que la mezcla se una.", "Junta la masa con las manos enharinadas y rueda sobre una superficie enharinada de 1 cm / ½ pulgada de grosor.", "Con un anillo de chefs de 5 cm / 2 pulgadas, corta cinco rondas de la masa y luego cepíllalas con leche.", "Coloque las rondas en una bandeja para hornear y coloque en el horno para hornear durante 15 minutos, o hasta que estén doradas.", "Para hacer la sopa de guisantes, caliente el aceite de oliva en una cacerola a fuego medio. Agregue el ajo y la chalota y fría por dos minutos para ablandar.", "Agregue los guisantes y cocine por cinco minutos.", "Agregue el caldo y el queso azul, lleve a ebullición, luego reduzca el fuego a fuego lento durante 10 minutos.", "Sazonar, al gusto, con sal y pimienta negra recién molida, luego mezclar con una batidora de mano hasta que quede suave.", "Para servir, vierta en una taza de cappuccino grande o en un tazón pequeño y colóquelo en un plato grande con los bollos amontonados al costado."], "url": "www_bbc_co_uk_food_recipes_peasoupwithbluechees_81624", "title": "Sopa de guisantes con bollos de queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "100g / 3½ oz de guisantes frescos, envasadas", "300ml / 10fl oz de caldo de verduras", "sal y pimienta negra recién molida", "Crema doble 50ml / 2fl oz", "50g / 2oz de mantequilla", "1 rebanada de pan blanco, en cubos"], "method": ["Caliente una cucharada de aceite de oliva en una cacerola y fría la cebolla por unos 4-5 minutos, hasta que se vuelva translúcida.", "Agregue los guisantes y el caldo, deje hervir a fuego lento y cocine durante unos cinco minutos, o hasta que los guisantes estén tiernos. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar la crema.", "Dejar enfriar un poco y luego, con una batidora de mano, procesar la sopa hasta que quede suave.", "Caliente la cucharada restante de aceite de oliva y la mantequilla en una sartén y fríe los cubos de pan, hasta que estén dorados y crujientes por todos lados.", "Vuelva a calentar la sopa si es necesario y sirva en un tazón, con los croûtons esparcidos por la parte superior."], "url": "www_bbc_co_uk_food_recipes_peasoupwithcroutons_88481", "title": "Sopa de guisantes con croûtons", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "2 chalotes de plátano, finamente picados", "Guisantes 400 g / 14 oz", "350ml / 12fl oz de caldo de pollo o caldo de verduras", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "1 lima, ralladura solamente", "2 cucharadas de menta, finamente picada"], "method": ["Caliente una sartén hasta que esté caliente, luego agregue la mantequilla y los chalotes y fría a fuego lento durante 2-3 minutos, hasta que los chalotes estén suaves pero no coloreados.", "Agregue los guisantes y el caldo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos.", "Deje que la sopa se enfríe durante unos minutos, luego vierta cuidadosamente en un procesador de alimentos y mezcle hasta obtener un puré suave. Regrese la sopa a la cacerola.", "Agregue 110ml / 4fl oz de la crema y sazone bien con sal y pimienta negra recién molida.", "Coloque la crema restante en un recipiente y bata hasta que se formen picos suaves cuando se quite el batidor.", "Doble la ralladura de lima y la menta.", "Coloque la sopa en tazones para servir y agregue una cucharada de la crema de lima y menta en el medio."], "url": "www_bbc_co_uk_food_recipes_peasoupwithmintcream_88716", "title": "Sopa de guisantes con crema de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "10g / ¼ oz de sal marina fina", "50 g / 1 oz de azúcar en polvo", "Levadura de acción rápida 9g / ⅓oz", "1 huevo grande de gallinas camperas, más una yema, ligeramente batido", "150ml / 5fl oz de leche entera, calentada a 43C", "aceite vegetal, para engrasar", "250g / 9oz de mantequilla sin sal, refrigerada", "Pacanas 150 g / 5½ oz", "85g / 3oz de azúcar mascabado ligero,", "2 cucharadas de jarabe de arce", "30g / 1oz de mantequilla sin sal, ablandada", "1 huevo grande de gallinas camperas batido con 2 cucharadas de leche", "50g / 1¾oz de mermelada de albaricoque", "2 cucharaditas de jugo de limón", "150g / 5½oz de azúcar glas, tamizado", "2 cucharadas de agua hirviendo", "½ cucharadita de extracto de vainilla"], "method": ["Para la masa de hojaldre, ponga la harina, la sal y el azúcar en un lado del tazón y la levadura en el lado opuesto. Agregue los huevos, la yema de huevo, la leche tibia y 80ml / 2½ fl oz de agua y mezcle durante un minuto con un tenedor hasta que se combinen. Agregue un poco más de agua si es necesario para formar una masa firme.", "Espolvoree una superficie de trabajo con harina y termine la masa. Polvo con un poco de harina y amasar durante 5 minutos, luego formar una bola.", "Engrase ligeramente un recipiente para mezclar y una gran pieza de película adhesiva. Coloque la masa en el recipiente y cubra con la película adhesiva. Ponga a un lado en un lugar cálido para probar durante una hora, o hasta casi duplicar su tamaño.", "Para el llenado, en un procesador de alimentos, presione 100 g / 3½ oz de las nueces hasta que estén finas. Transfiera a un recipiente y agregue el azúcar, el jarabe de arce y la mantequilla. Cubra y deje a temperatura ambiente. Corta aproximadamente las nueces restantes para usar como guarnición.", "Para hacer la masa, coloque la mantequilla enfriada entre la envoltura abierta y un pedazo de película adhesiva. Con un rodillo, bata la mantequilla hasta que quede aplanada a aproximadamente 1.5 cm / ⅝ pulg. Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta 1 cm / ½ pulgadas de espesor y aproximadamente el doble del tamaño de la mantequilla.", "Arregle la masa con un borde corto cerca de usted y ponga la mantequilla en el medio. Dobla la parte superior e inferior de la masa sobre la mantequilla para que se solape. Presione todos los bordes y los lados para asegurarse de que la mantequilla esté sellada dentro de la masa. Con un rodillo, golpee la masa desde el centro hacia arriba y desde el centro hacia abajo. Esto asegura que la mantequilla esté distribuida uniformemente.", "Estirar la masa a un rectángulo grande de aproximadamente 1 cm / ½ pulgada de grosor. Voltee la masa para que tenga un borde largo cerca de usted, luego pliegue el tercero derecho en el centro y cúbralo con el tercio izquierdo. Enfriar en la nevera durante 30 minutos. Haga esto girando, doblando y enfriando tres veces más.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque dos bandejas grandes para hornear con papel para hornear antiadherente.", "Estirar la masa a un rectángulo de 30x40cm / 12x16in. Usando un cortador de pizza o un cuchillo afilado, corte la masa en 12 cuadrados iguales.", "Para darle forma a la masa, corte una línea desde cada esquina hasta casi la mitad del cuadrado. Cepille la punta de cada esquina con un poco de la mezcla de huevo y leche, y doble las esquinas alternas en el centro presionando firmemente, creando un molinete.", "Transfiera los pasteles a las bandejas preparadas. Usando su dedo, presione hacia abajo para crear un hueco en el centro de la masa para el relleno. Ponga 1 cucharadita de la mezcla de nueces pecanas en el centro de cada hojaldre y esparza con algunas nueces picadas para decorar. Cubra las bandejas para hornear con film transparente y déjelo a un lado en un lugar cálido para que se levante durante 10 minutos.", "Para finalizar, cepille cada hojaldre con un lavado de huevo y hornee durante 15-20 minutos, o hasta que la masa esté crujiente y dorada.", "Mientras tanto, para el glaseado de albaricoque, combine la mermelada de albaricoque y el jugo de limón con 2 cucharadas de agua en una olla pequeña. Lentamente caliente la mezcla, revolviendo suavemente, hasta que gotee. Pasar a través de un tamiz y reservar. Mientras los pasteles aún estén tibios, cepíllalos con el glaseado de albaricoque.", "Para la formación de hielo, mezcle el azúcar glas, agua hirviendo y extracto de vainilla juntos hasta que quede suave. Transfiera a una manga pastelera equipada con una pequeña boquilla lisa y líneas de tubería a través de los pasteles refrigerados para terminar."], "url": "www_bbc_co_uk_food_recipes_pecan_and_maple_63294", "title": "Molinillos de pecan y arce", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 12 grandes pasteles daneses", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecan_and_maple_63294_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 300g / 10½ oz", "150g / 6oz de mantequilla salada", "Azúcar de formación de hielo 120g / 4oz", "3 yemas de huevo de gallinas camperas", "1 cucharada de leche entera", "Pacanas de 100 g / 3½ oz, finamente picadas", "1 kg / 2 lb 4 oz de batatas peladas, picadas (aproximadamente dos camotes grandes)", "170 g / 6 oz de azúcar en polvo", "1½ cucharadita de canela molida", "1 nuez moscada entera, rallada", "3 huevos de gallinas camperas", "6 cucharadas de leche condensada", "¾ cucharadita de extracto de vainilla", "30g / 1oz de mantequilla derretida", "Pacanas 300g / 10½ oz"], "method": ["Para la pastelería, engrase ligeramente una lata de flanco suelta aflautada de 28cm / 11in. Combine la harina, la mantequilla y el azúcar glas en un procesador de alimentos y pulse hasta que la mezcla se asemeje a migas de pan finas. Agregue las yemas de huevo y un chorro de leche y pulse hasta que la masa se una. Traiga la masa en forma de bola y envuélvala en una película adhesiva. Congelar durante 10 minutos, luego coloque en la nevera por otros 20 minutos.", "Ponga a hervir una sartén con agua con sal y agregue las batatas. Cocine por diez minutos o hasta que esté muy tierno. Escurrir y dejar enfriar un poco.", "Cuando la pastelería se haya enfriado, extiéndala hasta un grosor de ½ cm / ¼ in, luego transfiérala a la lata engrasada, dejando un pequeño pastel colgando sobre el borde. Usa cualquier masa sobrante para remendar cualquier agujero. Presione las nueces picadas en la masa. Pinchar la base con un tenedor y enfriar en la nevera durante 20 minutos.", "Precalentar el horno a 170 ° C / 375 ° F / Gas 5.", "Cubra la caja de pastelería con un pergamino para hornear y rellene con alubias para hornear. Hornee a ciegas por 10 minutos, luego quite el papel y los frijoles y hornee por otros 15 minutos. Enfríe la caja de pastelería en la lata sobre una rejilla de alambre.", "Mash la batata cocida muy bruscamente. Agregue el azúcar, los huevos y las especias. A continuación, agregue la leche condensada, la vainilla y la mantequilla y mezcle bien.", "Vierta el relleno en la caja refrigerada. Coloque las mitades de nuez en la parte superior del relleno y espolvoree canela molida.", "Hornee durante 25 minutos, o hasta que se complete el llenado. Deje que se enfríe durante 10 minutos, antes de retirar el pastel de la lata. Mantenga el pastel para alcanzar la temperatura ambiente antes de transferirlo a la nevera para que se enfríe."], "url": "www_bbc_co_uk_food_recipes_pecan_pie_82855", "title": "Pastel de nueces de papa dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 pie", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 hojas de pasta filo lista para usar", "1 huevo de gallina, batido con una pizca de sal añadida", "1 carne picada lista para el jarro", "pizca de tierra mezcla de especias", "crema individual, para servir"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque una hoja del filo en una bandeja para hornear grande y cepille todo con el huevo batido. Coloque una segunda hoja de filo encima de la primera y cepille con huevo, luego cubra con la hoja de filo final y cepille con huevo batido.", "Coloque la carne picada a lo largo de un borde de las capas de filo en capas, luego enrolle el filo en una forma de salchicha grande. Selle los bordes de forma segura, cepillando con más huevo batido y polvo ligeramente con la mezcla de especias.", "Hornee durante aproximadamente 8-10 minutos hasta que la masa esté bien cocida y dorada.", "Para servir, transferir a un plato de servir y servir en la mesa con una jarra de crema para servir al lado."], "url": "www_bbc_co_uk_food_recipes_pecanandmincemeatstr_87725", "title": "Strudel de carne picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110g / 4oz de mantequilla sin sal", "110g / 4 oz de jarabe de oro", "1 cucharadita de extracto de vainilla", "225g / 8oz de azúcar moreno", "3 huevos de gallinas camperas, golpeados", "1 x 245g / 8½oz comprados en pastelería brisa casera", "Nueces de pacana 285g / 10oz, partidas por la mitad"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la mantequilla, el jarabe dorado, el extracto de vainilla y el azúcar en una cacerola de base pesada a fuego lento.", "Cuando la mantequilla se haya derretido, retire la sartén del fuego y déjela enfriar durante 5-10 minutos.", "Agregue los huevos batidos a la mezcla y mezcle bien.", "Guarde un puñado de nueces pecanas. Coloque las mitades restantes de nuez pecanalmente en la caja de repostería y vierta cuidadosamente sobre la mezcla de jarabe.", "Coloque en el horno precalentado y hornee durante 40-50 minutos: el pastel será dorado, pero el relleno aún debe estar ligeramente suave.", "Deje que la tarta se enfríe en una bandeja de alambre. A medida que la tarta comienza a establecerse, decore la parte superior con las mitades de pacana reservadas. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_pecanpie_86028", "title": "Pastel de nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecanpie_86028_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pacanas 100g / 3½oz", "Galletas digestivas de chocolate 150g / 5oz, aproximadamente rotas", "75g / 3oz de mantequilla", "375 g / 13 oz de azúcar en polvo", "4 cucharadas de agua fría", "150g / 5oz de chocolate blanco, roto en cuadrados", "600g / 1lb 5oz de queso crema con toda su grasa", "150ml / 5fl oz de crema doble", "2 yemas de huevo de gallinas camperas", "4 huevos de gallinas camperas", "300 ml / 10 fl oz doble crema"], "method": ["Cubra una bandeja para hornear con papel resistente a la grasa y ligeramente aceite una lata de pastel springform de 23cm / 9in.", "Coloque las nueces y las galletas en un procesador de alimentos y mezcle con un polvo grueso. Derrita la mantequilla en una sartén pequeña y vierta en el procesador de alimentos con el motor en funcionamiento. Mezcle hasta que las galletas y la mantequilla se combinen a fondo.", "Coloque la mezcla de migas en la lata de la torta. Extienda uniformemente sobre la base y presione ligeramente hacia abajo con la parte posterior de una cuchara. Coloque la lata en el refrigerador y deje que la base se seque mientras realiza el llenado.", "Para el llenado, ponga 200 g / 7 oz del azúcar en polvo en una olla con agua fría y caliente suavemente hasta que el azúcar se disuelva, revolviendo ocasionalmente. Ponga a hervir el líquido y cocínelo durante 4-5 minutos sin remover hasta que el jarabe de azúcar se torne dorado. Agite suavemente el caramelo alrededor de la sartén mientras burbujea.", "Tan pronto como el caramelo tenga el color del caramelo, retírelo del fuego y vierta con cuidado en la bandeja de horno revestida. Inclina la lata para que el caramelo cubra la base de manera uniforme. Dejar enfriar y establecer.", "Derretir el chocolate en un recipiente a prueba de calor sobre una olla de agua hirviendo. Quite el fuego y deje enfriar por 20 minutos, pero no permita que se solidifique.", "Precalienta el horno a 180 ° C / 160 ° C (ventilador) / Gas 4 y hierve un hervidor de agua.", "Coloque el queso, la crema, el azúcar restante, las yemas de huevo y los huevos en un procesador de alimentos y mezcle hasta que quede suave. Poco a poco agregue el chocolate enfriado con el motor en marcha y mezcle hasta que esté mezclado.", "Aplasta el caramelo endurecido en pequeños fragmentos utilizando el extremo de un rodillo. Dobla la mitad del caramelo en la mezcla de queso y vierte suavemente sobre la base de la galleta. (Mantenga el resto en la bandeja, ligeramente cubierto con film transparente en un lugar fresco. No lo ponga en el refrigerador o la humedad hará que el caramelo se reblandezca).", "Coloque un trozo grande de papel de aluminio sobre la superficie de trabajo. Coloque la lata en el centro de la lámina y suba los lados para crear un tazón de aluminio alrededor de la tarta de queso.", "Coloque en una lata de tostado de tamaño mediano y agregue suficiente agua recién hervida para subir 2 cm / ¾ en los lados de la lata. Coloque con cuidado la lata de asar en el centro del horno y hornee por 45-50 minutos. El pastel de queso está listo cuando casi, pero no del todo, está listo.", "Cuando la tarta de queso esté lista, apague el horno pero deje la tarta de queso adentro por otros 30 minutos. (Esto ayudará a evitar el agrietamiento de la superficie a medida que la torta de queso se enfría).", "Levante la lata de la torta del agua y despegue la lámina. Coloque la tarta de queso en la nevera, tape y deje enfriar durante al menos dos horas antes de servir.", "Para servir, suelte cuidadosamente la lata y deslice la tarta de queso en un plato plano para servir o en un soporte para pasteles, usando una espátula para ayudarlo. Batir la crema hasta que se formen picos suaves y echar una cuchara en grandes nubes esponjosas sobre la tarta de queso. Esparce los fragmentos restantes de caramelo en la parte superior. Servir en cuñas"], "url": "www_bbc_co_uk_food_recipes_pecan_toffee_cheesecake_22876", "title": "Pastel de queso de caramelo de pacanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecan_toffee_cheesecake_22876_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de azúcar mascabado", "110g / 4oz de mantequilla", "110ml / 4fl oz de miel", "Pacanas de 140g / 5oz (65g / 2½ oz finamente picadas, resto restante entero)", "1 huevo, golpeado", "una pizca de canela molida", "4 pequeñas tarteletas de pasteles dulces profundos, cocidos al horno", "mitades de pecanas, para decorar", "jarabe de arce, para decorar", "225 g / 8 oz de azúcar en polvo", "4 huevos, solo yema", "Leche semidesnatada 170ml / 6oz", "170ml / 6oz de leche entera", "Crema doble 340ml / 12fl oz", "2 cucharaditas de extracto de vainilla", "1 cucharada colmada de jengibre picado", "6-8 semillas de cardamomo, finamente molidas"], "method": ["Primero haz el helado. En un tazón, combine el azúcar en polvo y las yemas de huevo. Batir la mezcla hasta que quede una pasta amarilla espesa y dejarla a un lado.", "Lleve la leche semidesnatada y la leche entera a fuego lento en una cacerola mediana de base pesada. Lentamente bata la mezcla caliente semidesnatada y la leche entera en la mezcla de huevo y azúcar. Esta mezcla debe estar caliente, pero no hirviendo.", "Regrese la mezcla a la cacerola y cocine a fuego lento con mucha suavidad, revolviendo constantemente, durante unos minutos hasta que espese hasta obtener una consistencia parecida a la de una crema. Cuele la mezcla en un tazón grande, deje enfriar y deje enfriar durante la noche en el refrigerador.", "Al día siguiente, mezcle la crema doble, la vainilla, el jengibre y el cardamomo molido. Batir en una máquina para hacer helados, siguiendo las instrucciones del fabricante, hasta que se congelen. Cubra y congele hasta que se requiera.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Haz los pasteles de nuez. En una sartén, derretir el azúcar mascabado y la mantequilla. Retirar del fuego y agregar la miel, las nueces picadas finamente, el huevo batido y la canela. Mezcle bien.", "Vierta la mezcla de nuez en las cajas de tartaletas y cubra con las pacanas enteras.", "Hornee las tartas de nuez durante 20 minutos.", "Sirva las tartas calientes del horno cubiertas con una bola de helado de jengibre y cardamomo. Decora los platos con pacanas y una llovizna de jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_pecanpiewithcardamom_67749", "title": "Pastel de nuez con helado de jengibre y cardamomo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal", "50g / 1¾oz de gloria de la mañana, en rodajas finas (disponible en algunos mercados asiáticos, espinaca sustitutiva si no está disponible)", "50g / 1¾oz pak choi, finamente cortado", "50g / 1¾oz de champiñones shiitake frescos, finamente rebanados", "1 cebolla roja pequeña, finamente rebanada", "Brotes de bambú de 25g / 1oz, finamente cortados", "50 g / 1¾oz de brotes de soja", "pequeño puñado de cilantro fresco, finamente picado", "1 chile rojo, sin semillas, finamente picado", "sal y pimienta negra recién molida", "8 envolturas circulares de wonton (para versiones veganas, busque envolturas sin huevo)", "1 cucharadita de harina de maíz, mezclada en una pasta con 1 cucharadita de agua", "aceite vegetal, para freír poco profundo", "salsa agridulce lista para usar, para servir"], "method": ["Caliente media cucharada de aceite en un wok a fuego alto. Agregue la gloria de la mañana, pak choi, hongos shiitake, cebolla roja, brotes de bambú y brotes de soja y sofría por 2-3 minutos, o hasta que los vegetales se hayan suavizado un poco.", "Retire del fuego y agregue el cilantro y el chile. Sazonar con sal y pimienta negra recién molida y dejar enfriar.", "Coloque las envolturas de wonton en una superficie limpia. Coloque una cucharada de verduras fritas en el centro de cada envoltura. Usando una brocha de pastelería, cepille los bordes de cada envoltura con la pasta de harina de maíz. Doblar los lados para crear una forma de wonton semicircular.", "Coloque los wontons en un vapor sobre agua hirviendo y deje hervir durante seis minutos. Remover y dejar enfriar.", "Caliente el resto del aceite en una sartén poco profunda hasta que esté caliente. Coloque los wonton cocidos al vapor uno por uno en el aceite caliente y cocine por un lado hasta que estén dorados. Retire con una espumadera y escurra sobre papel de cocina antes de servir.", "Sirve con salsa agridulce."], "url": "www_bbc_co_uk_food_recipes_pekingvegetabledumpl_91214", "title": "Albóndigas vegetales de estilo Pekín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pekingvegetabledumpl_91214_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cucharadita de polvo chino de cinco especias", "1 cucharada de aceite de sésamo", "3 cucharadas de hoi sin salsa", "3 cucharadas de azúcar moreno", "3 cucharadas de agua", "1 cucharada de salsa de soja oscura", "2 x 175 g / 6 oz filetes de pato, piel en", "1 litro / 35 fl oz de caldo de pollo", "2 hongos shiitake secos, empapados en 200 ml de agua caliente durante 20 minutos", "Hoja china 100g / 4oz, triturada", "1 cucharada de salsa de soja ligera", "1 cucharada de vino de arroz", "1 cucharada de vinagre de arroz", "Fideos udon planos de 200g / 8oz, cocinados", "3 cebollas de primavera, cortadas en diagonal", "Brotes de soja 40g / 2oz", "1 gran cilantro puñado, toscamente picado", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque todos los ingredientes del adobo en un recipiente poco profundo y mezcle bien para cubrir el pato. Marinar durante el mayor tiempo posible, preferiblemente de la noche a la mañana, pero cualquier cosa que exceda los 20 minutos servirá.", "Caliente una sartén seca hasta que esté tibia. Coloque el pato con la piel hacia abajo y cocine durante 8-10 minutos, hasta que se dore.", "Suba el fuego, voltee el pato y cocine por un minuto más hasta que quede crujiente.", "Transfiera al horno y cocine por 10-15 minutos.", "Retire del horno y descanse durante cinco minutos, antes de cortar.", "Para la sopa de fideos, vierta el caldo de pollo en una olla y cocine a fuego lento. Agregue los hongos shiitake y su líquido de remojo, y la hoja china.", "Agregue la salsa ligera de soja, el vino de arroz, el vinagre de arroz y los fideos udon a la sartén. Llevar a ebullición.", "Esparce sobre las cebolletas picadas, los brotes de soja y el cilantro. Sazone al gusto.", "Para servir, ponga un poco de sopa de fideos en un bol, coloque la pechuga de pato encima y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pekingstyleduckwithu_83641", "title": "Pato de estilo Pekín con sopa de fideos udon", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz almejas", "Mejillones 250 g / 9 oz, limpiados", "500g / 1lb 2oz navajas de afeitar", "150ml / 5fl oz de vino blanco", "25g / 1oz dulse butter (alternativamente use mantequilla salada)", "100 g / 3½ oz de samphire", "pimienta negra", "1 chalote, finamente picado", "1 diente de ajo, aplastado", "100 ml / 3½ fl oz crema", "2 tomates, piel y semillas eliminadas, cortadas en cubos de 1cm / ½ en cubitos", "1 limón, solo jugo", "Algas rojas 10g"], "method": ["Prepare el marisco limpiando las conchas y quitando las barbas de los mejillones. Deseche cualquiera con conchas abiertas que no se cierren cuando se da un golpecito fuerte.", "Coloque todos los mariscos en una sartén grande y caliente. Agregue el vino blanco, cubra con una tapa y cocine por 2-3 minutos. Deseche cualquier caparazón que no se haya abierto.", "Cuele y reserve el licor de cocción. Retire toda la carne de las conchas y corte la carne blanca de las almejas en 2 cm / 1 en piezas. Coloque las conchas de almeja de afeitar en un plato de servir o piedra plana.", "En la misma sartén, derretir la mitad de la mantequilla y agregar el hinojo. Sazone generosamente con pimienta y cocine durante 1-2 minutos. Con una cuchara, coloque la salchicha cocida en las conchas de almejas.", "Agregue la mantequilla restante a la sartén junto con la chalota y el ajo. Freír suavemente durante 1-2 minutos, luego agregue el licor de cocción reservado (teniendo cuidado de no agregar las heces del fondo del recipiente). Agregue la crema y cocine a fuego lento hasta que el volumen del líquido se reduzca a la mitad y la salsa sea lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Para finalizar, agregue los mariscos y los tomates a la salsa y cálida suavemente. Sazone al gusto con sal y pimienta y luego agregue el jugo de limón.", "Vierta la salsa sobre el hinojo y cubra con algas rojas para servir."], "url": "www_bbc_co_uk_food_recipes_pembrokeshire_seafood_29704", "title": "Mariscos de Pembrokeshire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pembrokeshire_seafood_29704_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "15 chalotes tailandeses (u 8 chalotes comunes), pelados y finamente cortados", "2 x 160g / 5¾oz latas de crema de coco", "4 cucharadas de pasta de curry tailandesa amarilla o roja", "400 g / 14 oz puede leche de coco", "2 tallos de limoncillo", "8 hojas frescas de lima kaffir, enjuagadas", "1-2 cucharadas de salsa de pescado tailandés (nam pla)", "2 cucharadas de azúcar de palma o azúcar morena clara y suave", "Berenjenas de guisantes de 150 g / 5½ oz, bien lavadas (o 150 g / 5½ oz de judías verdes, cortadas en trozos cortos)", "1 pimiento rojo grande y 1 pimiento amarillo grande, sin semillas, cortado en trozos de 3cm / 1¼", "1 kg / 2 lb 4 oz filetes de pescado blanco fresco sin piel mezclado, como la merluza, el abadejo y la pescadilla", "Mangetout 200g / 7oz, recortado y enjuagado", "puñado de cilantro, hojas recogidas", "puñado de albahaca tailandesa (o albahaca normal), aproximadamente desgarrada", "arroz cocido, para servir"], "method": ["Coloque un wok grande antiadherente o una sartén grande o a fuego medio-alto. Agregue el aceite y saltee los chalotes en rodajas durante 5-8 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Regrese la sartén a fuego lento, agregue la crema de coco y la pasta de curry y cocine por un minuto, revolviendo constantemente. Vierta sobre la leche de coco y añada 100 ml / 3½ fl oz de agua. Llevar a fuego lento a fuego lento.", "Pon el lemongrass en un tablero y córtalo por la mitad. Bash con un rodillo para magullar y aplanar los tallos - esto permitirá que su sabor se escape más fácilmente en su curry. Agregue el lemongrass, las hojas de lima, el nam pla y el azúcar a la sartén y cocínelos por 1-2 minutos más, o hasta que el azúcar se disuelva, revolviendo.", "Agregue las berenjenas de guisantes y cocine a fuego lento durante ocho minutos, revolviendo ocasionalmente hasta que estén casi tiernas. (Si usa judías verdes, cocínelas durante tres minutos). Agregue los pimientos y cocine durante cinco minutos más, revolviendo regularmente. La salsa de curry de coco debe burbujear suavemente pero constantemente para cocinar las verduras.", "Cuando las berenjenas estén tiernas, pruebe la salsa de curry y agregue más salsa de pescado tailandés si es necesario. Necesita tener un buen equilibrio de caliente, salado, agrio y dulce. En este punto, la salsa de curry se puede quitar del fuego y dejar reposar antes de que el pescado esté listo para cocinarse.", "Cortar las piezas de pescado en trozos de 3 cm / 1 ¼ pulgadas y sazonar con pimienta negra molida. Revuelva el pescado y el mangetout en el curry y cocine por otros cinco minutos. Gire el pescado en la salsa de vez en cuando al comienzo del tiempo de cocción, pero deténgalo tan pronto como lo vea comenzar a copos.", "El pescado debe verse opaco en lugar de translúcido cuando se cocina y el curry debe ser espeso y cremoso, pero no tan espeso que empiece a arder en el fondo de la sartén. Si se reduce demasiado, simplemente agregue un poco de agua extra.", "Esparce los chalotes crujientes, las hojas de cilantro y la albahaca tailandesa desgarrada sobre el curry y sirve inmediatamente con arroz cocido."], "url": "www_bbc_co_uk_food_recipes_penang_fish_curry_70583", "title": "Curry de pescado Penang", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, cortada en cubitos", "2 dientes de ajo picados", "8 salchichas de cerdo gruesas, piel eliminada, carne desmenuzada", "400g de tomates cortados en lata", "300ml / 10½fl oz de caldo de verduras", "50g / 1¾oz de mantequilla", "50g / 1¾oz de harina natural", "500ml / 18fl de leche en oz", "Pasta de penne 400g / 14oz", "sal y pimienta"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6", "Caliente una sartén grande a fuego medio. Agregue el aceite y cocine suavemente la cebolla con una pizca de sal durante 4-5 minutos o hasta que esté suave y translúcida. Agregue el ajo y continúe cocinando durante 2 minutos.", "Revuelva en la carne de salchicha y fría hasta que esté coloreado en todos los lados. Agregue los tomates y el caldo de verduras, sazone con una pizca de sal y pimienta y baje el fuego. Cocina a fuego lento durante 10 minutos mientras preparas la salsa blanca.", "Derretir la mantequilla en una olla. Agregue la harina y revuelva para mezclar. Cocine a fuego medio durante 2-3 minutos, o hasta que la mezcla tome una apariencia de color de galleta. Poco a poco agregue la leche, poco a poco, batiendo a medida que agrega para evitar que se formen grumos. Sazonar con sal y pimienta y llevar a fuego lento. Cocine durante 5 minutos para espesar un poco y luego retírelo del fuego.", "Mientras tanto, cocine el penne en una sartén de agua hirviendo con sal según las instrucciones del paquete. Una vez cocinado, escurrir y verter en la sartén con la mezcla de salchicha y tomate. Mezclar bien. Vierta esto en una fuente para hornear de tamaño mediano para horno. Verter sobre la salsa blanca y hornear durante 15-20 minutos, o hasta que burbujee y dore."], "url": "www_bbc_co_uk_food_recipes_penne_and_sausage_pasta_30949", "title": "Penne y pasta de salchicha hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_and_sausage_pasta_30949_16x9.jpg", "isVegetarian": false, "recommendations": 0}]