[{"ingredients": ["2 cucharadas de aceite de oliva o de girasol, o 30 g / 1 oz de mantequilla", "1 cebolla, pelada y picada", "1 diente de ajo, pelado y picado", "1 bouquet garni", "y / o 1-2 chiles rojos frescos, sin semillas y picados", "o 1 cucharadita o más de pasta de curry o polvo de curry o especias, p. comino, semillas de hinojo, canela, etc.", "1 papa u otro espesante si es necesario, pelado y cortado en trozos", "Verduras de 500g / 18oz, preparadas según corresponda y tostadas", "1-1.5 litros / 1¾-2¾ pintas) de verduras o caldo de pollo, o agua de cocción vegetal, o una mezcla de agua y leche", "sal", "pimienta negra recién molida"], "method": ["Caliente el aceite o la mantequilla suavemente en una cacerola grande, luego agregue los ingredientes básicos, los aromáticos y los ingredientes principales. Revuelva para cubrir todo en la grasa, luego sude muy suavemente durante 10-15 minutos.", "Agregue 1 litro / 1¾pints de caldo u otro líquido, guarde el resto para adelgazar (si es necesario) y sazone con sal y pimienta negra recién molida. Llevar a ebullición, luego cocine a fuego lento durante unos 20 minutos hasta que todas las verduras estén tiernas.", "Licuar en varios lotes y volver a la sartén. Adelgace con la reserva reservada, agua o leche según sea necesario, y revise el condimento", "Recalentar cuando sea necesario."], "url": "www_bbc_co_uk_food_recipes_goodvegetablesoup_73412", "title": "Buena sopa de verduras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goodvegetablesoup_73412_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina blanca lisa de 225 g / 8oz, más extra para enrollar", "pizca de sal", "110g / 4oz de mantequilla, fría y en cubitos, más extra para engrasar", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "4 lonchas de tocino, cortadas en tiras finas", "30g / 1oz de mantequilla", "1 cebolla, en rodajas", "170 g / 6 oz de queso suave cremoso, como Levin Down", "4 huevos de gallinas camperas", "Crema doble de 285 ml / ½ pt", "170g / 6oz de queso duro maduro, como Charlton, rallado", "2 cucharadas de perejil fresco picado", "pimienta negra recién molida", "pizca de nuez moscada recién rallada"], "method": ["Para la masa, tamiza la harina y la sal en un bol y haz un pozo en el centro. Frote la mantequilla, agregue el huevo y junte la masa con un chorrito de agua. Póngase en forma de pelota, envuélvala en una película adhesiva y déjela enfriar en la nevera durante al menos una hora.", "Engrase una caja de flan de 25cm / 10in. Estirar la masa y colocar en la caja de flan, dejando un poco de hojaldre colgando. Descanse en la nevera durante 30 minutos. Precalentar el horno a 180C / 350F / Gas 4.", "Pinche la base de la masa, coloque un círculo de papel a prueba de grasa en la parte superior, seguido de granos de cocción y hornee a ciegas durante 20 minutos. Retirar del horno, dejar reposar y cortar el exceso de masa.", "Para el relleno, caliente el aceite en una sartén y cocine el tocino hasta que esté ligeramente dorado. Retire el tocino con una cuchara ranurada, reteniendo el aceite.", "Agregue la mantequilla al aceite y coloree lentamente la cebolla. Deje que se enfríe, luego espolvoree en la caja de flan. Espolvorear el tocino y romper el queso blando.", "Batir los huevos y la crema doble juntos y mezclar con 110 g / 4 oz del queso rallado y el perejil. Sazonar con pimienta y verter en una caja de flan. Hornea por 20 minutos.", "Espolvorea sobre el queso restante y la nuez moscada y hornea durante 5-10 minutos más, hasta que se endurezca. Deje que se enfríe durante cinco minutos. Retire el anillo de flan y corte para servir."], "url": "www_bbc_co_uk_food_recipes_goodwood_tart_84631", "title": "Tarta de Goodwood", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["650-700g / 1lb 8 oz de repollo Savoy", "1 pepino sin pelar", "2 zanahorias medianas, peladas", "1 rábano daikon mediano, pelado", "1 manojo de rábanos rojos", "45g / 1½ oz de sal marina", "385g / 13½ oz de azúcar blanco", "1.5l / 2 pintas de 13 fl oz de vinagre blanco", "1 cucharadita de aceite de chile", "60ml / 2¼fl oz de salsa de soja ligera"], "method": ["Rebane el repollo por la mitad, retire el núcleo y corte en trozos irregulares (aproximadamente 5 cm x 2.5 cm).", "Aproximadamente separe las piezas para separar las hojas.", "Cortar el pepino y las zanahorias por la mitad a lo largo, y luego cortar en bastones (aproximadamente 6 cm x 1 cm / 2.5 pulgadas x 0.5 pulgadas).", "Cortar el daikon de rábano por la mitad a lo largo, y cortar en trozos (aproximadamente 3 cm x 2 cm / 1 pulg x 0.5 pulg). Corte los rábanos rojos por la mitad.", "Coloque las verduras preparadas en un tazón grande, espolvoree sal y mezcle bien para combinar. Cubra el recipiente herméticamente con papel plástico y refrigere durante la noche.", "Combine el azúcar y el vinagre en una olla de base pesada y revuelva a fuego medio hasta que el azúcar se disuelva.", "Cocine a fuego lento, sin revolver, hasta que esté reducido y ligeramente almibarado (alrededor de 15 minutos). Dejar de lado para enfriar.", "Al día siguiente, vierta el jarabe enfriado sobre vegetales salados. Agregue el aceite de chile y la salsa de soja al gusto, y mezcle bien.", "Almacene en un recipiente hermético en el refrigerador durante tres días para permitir que los sabores se desarrollen antes de usar. Los pepinillos se mantendrán refrigerados durante varios meses."], "url": "www_bbc_co_uk_food_recipes_goonggoongshomemadep_72057", "title": "Encurtidos caseros", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace jarras de 2 x 1 litro", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de azúcar en polvo", "4 cucharadas de flor de saúco cordial", "250 g / 9 oz de grosellas espirituosas, coronado, atado y reducido a la mitad", "200g / 7 oz de galletas de jengibre", "400 ml / 14 fl oz crema doble", "flores de saúco, para adornar"], "method": ["Ponga el azúcar, los cordiales y las grosellas en una sartén y cocínelos suavemente hasta que estén suaves. Retirar del fuego y dejar enfriar. Reserve un par de grosellas para usar como decoración más tarde.", "Aplastar un cuarto de las galletas de jengibre en migas finas, y romper las galletas restantes en trozos pequeños.", "Coloque la mitad de las grosellas en un procesador de alimentos y mezcle, luego reserve.", "Coloque el resto de las grosellas en un recipiente y mezcle con las piezas de galleta rotas.", "Con una cuchara mezcle la grosella espinosa y la galleta en cuatro copas de martini.", "Batir la crema hasta que se formen picos suaves cuando se levante la batidora. Con cuidado mezcle el puré de grosella y añádalo a las copas.", "Espolvoree las migas de galleta sobre la parte superior y decore con flores de saúco y grosellas negras reservadas."], "url": "www_bbc_co_uk_food_recipes_gooseberry_and_12470", "title": "Grosella espinosa y tonto de flor de saúco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "100g / 3½oz de azúcar glasé", "pizca de sal", "200 g / 9 oz de mantequilla fría, cortada en cubitos", "2 yemas de huevo de gallinas camperas, batidas", "700g / 1lb 9 oz de grosellas, cascadas", "40g / 1½ oz de azúcar en polvo de oro", "200ml / 7fl oz de flor de saúco cordial", "55ml / 2fl de leche en oz", "3 hojas de gelatina de hoja, empapada en un recipiente con agua fría", "275ml / 9¼ oz de yogur natural", "5 cucharadas de jarabe de vainilla", "Fresas frescas de 250g / 9oz, lavadas, descascaradas, cortadas en cuartos", "1 primavera de tomillo, hojas recogidas"], "method": ["Para el shortbread, tamice la harina, el azúcar glas y la sal en un tazón grande. Agregue la mantequilla en cubitos, luego frote la mantequilla en la mezcla de harina con la punta de los dedos hasta que la mezcla se asemeje a pan rallado.", "Haga un pozo en el centro de la mezcla de harina, luego agregue las yemas de huevo y póngalas en la mezcla, dibuje los ingredientes secos en los ingredientes húmedos gradualmente, hasta que la mezcla se una como una masa. Tenga cuidado de no trabajar demasiado la masa.", "Con las manos, forma la masa en una salchicha, luego envuélvela en una película adhesiva y déjala enfriar en la nevera durante al menos dos horas.", "Mientras tanto, para las cremas de grosella, coloque las grosellas espinosas en una olla grande de base pesada, espolvoree el azúcar y vierta el cordial de flor de saúco.", "Deje que la mezcla hierva a fuego lento y cocine a fuego lento, sin tapar, durante 25-30 minutos, revolviendo regularmente para evitar que la mezcla se enganche en el fondo de la sartén. Dejar enfriar un poco.", "Mezcle un cuarto de las grosellas espinosas cocidas y enfriadas en un procesador de alimentos hasta obtener un puré suave.", "Calienta la leche a fuego lento en una olla aparte. Cuando la leche esté caliente, escurra las hojas de gelatina, exprímalas para eliminar el exceso de líquido y agréguelas a la leche, batiendo hasta que se disuelva. Retire la sartén del fuego.", "Ponga 225ml / 8fl oz del puré de gooseberry en una jarra de medir (cualquier puré sobrante se puede agregar a las grosellas espinosas reservadas). Batir el puré de grosella espinosa en la leche caliente, luego batir el yogur hasta que esté bien combinado.", "Divida la mezcla por igual entre cuatro moldes. Cubra cada molde con film transparente y póngalo a un lado para que se enfríe por completo, luego enfríelo en el refrigerador hasta que se asiente (cuando lo coloque, las cremas de uchuva se tambalearán levemente cuando se golpee).", "Para cocinar los bizcochos, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Retire la masa de galletas de la nevera, desenvuelva y corte en rebanadas gruesas y uniformes. Coloque las rebanadas de masa en una bandeja para hornear, luego hornee las galletas dulces en el horno durante 15-20 minutos, o hasta que estén crujientes y doradas.", "Mientras tanto, para la ensalada de fresas, caliente suavemente el jarabe de vainilla en una olla pequeña. Coloque las fresas en cuartos en un tazón, espolvoree sobre las hojas de tomillo y luego vierta sobre el jarabe de vainilla tibia. Dejar de lado hasta que sea necesario.", "Para servir, coloca una ramekin de crema de grosella en cada uno de los cuatro platos de postre. Coloque una cucharadita de las grosellas espinosas reservadas en la parte superior de cada crema de grosella espinosa. Apila dos bizcochos al lado. Coloque una porción de la ensalada de fresas al lado."], "url": "www_bbc_co_uk_food_recipes_gooseberry_creams_with_49391", "title": "Cremas de grosella con ensalada de fresa y shortbread", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de azúcar en polvo", "100 g / 3½ oz de grosellas espigas", "120 g / 4 oz de almendras molidas", "Harina normal de 75 g / 2½ oz", "150g / 5½oz de azúcar glas", "6 claras de huevo de granja, ligeramente batidas", "100 g / 3½ oz de mantequilla sin sal, derretida, más extra para engrasar", "2 cucharadas de flor de saúco cordial", "azúcar glas, al polvo"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Cepille un bollo o una lata de muffins con mantequilla derretida.", "Coloque el azúcar en polvo con dos cucharadas de agua en una olla pequeña y caliente, revuelva, hasta que el azúcar se haya disuelto. Agregue las grosellas y cocine a fuego lento en el jarabe durante cinco minutos hasta que estén suaves, revolviendo ocasionalmente, pero tenga cuidado de no romperlas demasiado.", "En un tazón grande, combine las almendras y la harina y tamice el azúcar glasé.", "Agregue las claras de huevo hasta que se combinen, luego agregue la mantequilla derretida y el cordial de flor de saúco.", "Transfiera la masa en cucharadas a la lata de muffins. Coloque 3-4 grosellas guisadas guisadas en el centro de cada torta.", "Hornee en el horno durante 35-40 minutos, o hasta que las tortas se sientan elásticas para tocarlas y comiencen a separarse de los bordes de la lata.", "Retire del horno y deje enfriar en la lata durante cinco minutos, luego transfiera con cuidado a una rejilla de alambre. Estos se comen mejor caliente con una cucharada de crema."], "url": "www_bbc_co_uk_food_recipes_gooseberry_cupcakes_63065", "title": "Magdalenas de grosella espinosa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberry_cupcakes_63065_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina común", "100g / 3½oz de azúcar glasé", "250g / 9oz de mantequilla fría, cortada en cubos", "1 vaina de vainilla, partido, semillas raspadas", "2 huevos de gallinas camperas", "botón de mantequilla", "225 g / 8 oz de grosellas espirituosas, coronadas y de cola", "150ml / 5½ oz de agua", "225g / 8oz de azúcar granulada", "1 cucharada de flor de saúco cordial", "3 huevos de gallinas camperas, más 1 yema de huevo de gallinas camperas", "150g / 5½oz de mantequilla suave", "150 g / 5½ oz de azúcar en polvo", "150 g / 5½ oz de almendras molidas", "100g / 3½oz de almendras flanes desaladas"], "method": ["Para la masa, pulse la harina, el azúcar glas y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a migajas de pan finas. Agregue las semillas de vainilla y pulse brevemente. Retire del procesador de alimentos y vierta las migas en un tazón grande. Agregue los huevos y use un cuchillo sin filo para formar una pasta. Rodar hasta formar una bola, aplanar, cubrir con una película adhesiva y enfriar en la nevera durante 30 minutos.", "Para la grosella espinosa y la mermelada de flor de saúco, coloca un platillo en el congelador.", "Unte la base de una olla grande con la mantequilla, luego agregue las grosellas y el agua y cocine a fuego lento durante 15 minutos o hasta que las grosellas estén tiernas. Reduzca el fuego, agregue el azúcar y revuelva hasta que esté bien combinado. Deje que esta mezcla se caliente hasta que el azúcar se haya disuelto, luego aumente el fuego y hierva durante 8-10 minutos. Retire la sartén del fuego y vierta una cucharadita de la mezcla en el platillo refrigerado; está buscando que se forme una capa en la superficie una vez que se haya enfriado. Si no lo ha hecho, continúe hirviendo, verificando cada cinco minutos, hasta que se alcance el punto de ajuste. Coloque la mermelada en un recipiente y deje que la mezcla se enfríe un poco antes de removerla en el cordial.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase dos pequeños recipientes de 12 orificios.", "Extienda la masa sobre una superficie de trabajo enharinada y úsela para revestir las cuatro latas pequeñas. Enfriar en la nevera durante 30 minutos.", "Mientras tanto, para el frangipane, golpee los huevos en una jarra y déjelos a un lado. Batir la mantequilla y el azúcar hasta que esté suave y esponjoso, luego agregue los huevos batidos un poco a la vez hasta que estén bien combinados. Agregue las almendras molidas.", "Coloque un poco de mermelada en el fondo de las cajas de tartaletas, cubra con un poco de frangipane y luego hornéelas en el horno por 15 minutos o hasta que el relleno recién empiece a solidificarse. Coloque las almendras en copos en un patrón de flores en la parte superior de las tartas y luego vuelva al horno durante 10-15 minutos o hasta que estén doradas. Dejar enfriar sobre una rejilla."], "url": "www_bbc_co_uk_food_recipes_gooseberry_and_02813", "title": "Grosella espinosa y flor de saúco Bakewell tarta petits fours", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 24", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de grosellas verdes coronados y cola", "4 cucharadas de agua", "10 cabezas de flor de saúco", "4 cucharadas de azúcar granulada", "1 tira gruesa de corteza de limón", "290ml / ½ pinta de crema", "ramitas de bálsamo de limón, menta o flor de saúco", "muselina para hacer la infusión de flor de saúco"], "method": ["Coloque las grosellas espinosas en una sartén grande con el agua y deje que hiervan. Cocine suavemente hasta que las grosellas empiecen a ablandarse y liberar sus jugos.", "Envuelva las cabezas de saúco en muselina, ate y presione las grosellas. Deje hervir a fuego lento durante 15 minutos.", "Mezcle bien la mezcla de grosella espinosa con un tenedor o un triturador de papas, o pise ligeramente en un procesador de alimentos. Incline en un recipiente y déjelo enfriar.", "Retire la infusión de flor de saúco de las grosellas espinosas y exprima todos los jugos en el recipiente. Deseche la bolsa de muselina. Con una cuchara, un cuarto del puré de grosella espinosa en un tazón pequeño y reservar.", "Agregue la crème fraîche al resto de grosella y dóblela suavemente.", "Ponga el puré de uchuva reservado entre los vasos para servir. Coloque la mezcla tonta encima y coloque los vasos en la nevera para que se enfríen hasta que se necesiten.", "Para servir a cada tonto decorar con ramitas de bálsamo de limón, menta o bayas de flor de saúco y servir con los dedos de la esponja, si le gusta."], "url": "www_bbc_co_uk_food_recipes_gooseberryandelderfl_6907", "title": "Grosella espinosa y tonto de flor de saúco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de grosella de 4 onzas, coronada y con cola", "100 g / 3½ oz de azúcar en polvo", "3 cucharadas de flor de saúco cordial", "200g / 7oz de crema doble", "100 ml / 3½ fl oz de yogur de estilo griego o crème fraîche", "ramitas de menta fresca, para decorar (opcional)"], "method": ["Ponga las grosellas espinosas, el azúcar y el cordial en una olla. Cocine a fuego alto hasta que el azúcar se haya disuelto y la fruta esté suave. Retirar del fuego y reservar una cuarta parte de las grosellas espinosas cocidas.", "Mezcle las grosellas espinosas restantes cocidas en una licuadora o procesador de alimentos, luego tamice para quitar las pieles. Dejar de lado para enfriar.", "Batir la crema en un bol hasta que se formen picos suaves cuando se retire la batidora del bol. Dobla el yogur y dobla las grosellas. Divida entre seis vasos.", "Deje los vasos en el refrigerador durante al menos 2 horas, para permitir que el tonto se espese.", "Para servir, espolvorea las grosellas restantes sobre la parte superior del tonto y decora con la menta, si las usas. Sirve con miel se derrite."], "url": "www_bbc_co_uk_food_recipes_gooseberry_fool_54833", "title": "Grosella espinosa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberry_fool_54833_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["masa quebrada", "500 g / 1 libra 2 onzas de uva", "Echador de 125 g / 4½ oz o azúcar morena suave", "una babosa de flor de saúco cordial", "1 cucharada de harina de patata", "generosa perilla de mantequilla", "Leche", "1 huevo", "azúcar demerara batido"], "method": ["Precalentar el horno y una bandeja para hornear a 180 ° C / 356 / Gas 4.", "Divida la masa en dos mitades, una ligeramente más grande que la otra. Estire la pieza más grande y forre un plato poco profundo y engrasado, dejando un poco de saliente. Espolvorea un poco de azúcar sobre la superficie y luego agrega las grosellas.", "Espolvorea sobre la harina de patata, el resto del azúcar y el cordial de flor de saúco, luego rocía con la mantequilla.", "Extienda la porción restante de masa para la tapa, colóquela sobre la parte superior y luego selle con un tenedor en todos los bordes.", "Corta una cruz en el medio por donde puede escapar el vapor, cepilla con huevo batido y luego esparce un poco de azúcar demerara sobre la superficie.", "Coloque sobre la bandeja para hornear caliente y cocine durante unos 25 minutos. Baje el fuego un poco y continúe cocinando por otros 20-25 minutos hasta que se dore y burbujee.", "Dejar enfriar durante al menos 15 minutos, luego servir con crema de Jersey coagulada o crema casera."], "url": "www_bbc_co_uk_food_recipes_gooseberryandelderfl_72321", "title": "Tarta de grosella y saúco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla, para engrasar", "500 g / 1 libra 2 oz de grosellas frescas", "200 g / 7 oz de azúcar en polvo", "300 g / 10½oz de hojaldre listo para envolver (forma rectangular)", "harina común, para quitar el polvo", "1 huevo de gallinas camperas, golpeado", "6 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "200ml / 7fl oz de leche entera descremada", "150ml / 5½fl oz de crema individual", "50ml / 1¾ fl oz de champán", "1 vaina de vainilla, partida, semillas raspadas con un cuchillo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase un plato de tarta de 25cm / 10in con mantequilla.", "Para el pastel de grosella, caliente las grosellas y el azúcar en una sartén a fuego medio o bajo durante 6-8 minutos, o hasta que se ablanden. Dejar de lado para enfriar.", "Corta la masa de pasta brisa por la mitad y enrolla cada pieza en una superficie de trabajo ligeramente enharinada, hasta que sean 5-8 cm / 2-3 pulgadas más grandes que el diámetro de la placa de pastel.", "Alinee el plato de pastel preparado con una de las hojas de hojaldre enrolladas y recorte los bordes. Con una cuchara, mezcle la grosella espinosa y el azúcar en la caja de tarta en una capa uniforme, dejando 2,5 cm / 1 in libre alrededor de los bordes.", "Coloque la hoja de repostería restante sobre la placa de pastel y recorte cualquier exceso. Selle los bordes de la masa con un tenedor. Pincha el pastel con un tenedor y un cepillo con el huevo batido.", "Transfiera la tarta de grosella espinosa al horno y hornee durante 25-30 minutos, o hasta que estén doradas.", "Mientras tanto, para la crema de champán, en un tazón, mezcle las yemas de huevo y el azúcar hasta que estén pálidas y esponjosas.", "Caliente la leche, la crema, el champán y las semillas de vainilla en una sartén hasta que estén hirviendo a fuego lento, pero no hirviendo. Cuando la mezcla esté casi hirviendo, retire la sartén del fuego y vierta gradualmente sobre la mezcla de huevo y azúcar en una corriente fina, batiendo continuamente.", "Regrese la mezcla de natillas a una cacerola limpia y caliente a fuego medio a bajo durante 8-10 minutos, revolviendo continuamente, hasta que la mezcla esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Para servir, corte la tarta en 6-8 cuñas. Coloque una cuña en el centro de cada plato y vierta sobre la crema de champán."], "url": "www_bbc_co_uk_food_recipes_gooseberrypiewithcha_91596", "title": "Pastel de grosella con crema de champán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de uva", "150ml / 5fl oz de flor de saúco cordial", "2 yemas de huevo", "1 cucharadita de arrurruz", "150ml / 5fl de leche en oz", "30g / 1 oz de azúcar", "150ml / 5fl oz de crema doble", "Flores de saúco frescas, para decorar"], "method": ["Arriba y la cola las grosellas espinosas. Ponlos en una sartén con el cordial de flor de saúco. Llevar a ebullición y luego cocine a fuego lento hasta que esté suave y pulposo. Deje enfriar, y luego colóquelo en un plato para servir.", "Haga que la crema caliente la leche en una sartén hasta que hierva. Batir las yemas de huevo, el arrurruz y el azúcar en una jarra y verter la leche caliente en la jarra. Mezclar bien y luego volver a la sartén. Calienta suavemente hasta que la crema espese, pero no hiervas. Colar en un tazón limpio y fresco.", "Batir la crema a la misma consistencia de las grosellas espinosas.", "Revuelve suavemente la crema en las grosellas espinosas y luego dobla la natilla. Intente darle un efecto marmoleado en el tazón de servir. Coloque algunas flores de saúco encima para decorar."], "url": "www_bbc_co_uk_food_recipes_gooseberryfool_6466", "title": "Grosella espinosa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberryfool_6466_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla sin sal, más extra para engrasar", "Grosellas rojas o verdes de 500g / 1lb 2oz, recortadas", "150 g / 5½ oz de azúcar en polvo", "2 huevos grandes de gallinas camperas, blancos y yemas separados", "¼ cucharadita de extracto de vainilla"], "method": ["Engrase cuatro moldes de 150ml / 5fl oz con mantequilla.", "Coloque 40 g / 1½ oz de la mantequilla, las grosellas espinosas y 50 g / 2 oz del azúcar en una sartén y caliente a fuego medio, revolviendo regularmente, hasta que la mantequilla se haya derretido y el azúcar se haya disuelto.", "Deje que la mezcla hierva a fuego lento y continúe cocinando por 6-8 minutos, o hasta que la fruta comience a descomponerse. Retire del fuego y deje enfriar por cinco minutos.", "Precalentar el horno a 190C / 375F / Gas 5.", "En un recipiente, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Poco a poco mezcle los restantes 100 g / 3½ oz de azúcar, poco a poco, hasta que la mezcla de merengue sea gruesa y brillante. Batir el extracto de vainilla hasta que esté bien combinado.", "Batir las yemas de huevo en la mezcla de uchuva fría hasta que estén bien combinadas.", "Coloque la mezcla de grosella espinosa en los moldes preparados, luego con una cuchara sobre el merengue. Transfiera los moldes a una bandeja para hornear.", "Coloque la bandeja para hornear en el horno y cocine la grosella espinosa por 12-15 minutos, o hasta que el merengue esté recién dorado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gooseberrysnow_91868", "title": "La grosella espinosa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gooseberrysnow_91868_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "4 chalotes, pelados, finamente picados", "2 dientes de ajo, aplastados", "1 litro / 1¾ pintas de caldo de pollo", "Arroz risotto 400 g / 14½ oz (como arborio o carnaroli)", "1 cucharada de granos de pimienta verdes enteros", "2 cucharadas de mantequilla", "250 g / 9 oz de champiñones castaños, finamente en rodajas", "500 g de carne de ganso sobrante, finamente picada", "1 cucharada de hierbas frescas mezcladas picadas (salvia, romero, perejil, estragón, cebollín)", "4 cucharadas de parmesano recién rallado", "sal y pimienta negra recién molida", "ensalada verde, para servir (opcional)"], "method": ["En una sartén grande de base pesada a fuego medio, caliente dos cucharadas de aceite y fríe las chalotas por 2-3 minutos, o hasta que estén blandas pero no coloreadas. Agregue el ajo y cocine por otros 2-3 minutos, o hasta que se ablanden.", "Mientras tanto, coloque el caldo en una sartén y cocine a fuego lento.", "Agregue el arroz a la sartén con el ajo y la cebolla y revuelva para cubrir el aceite. Cocine por 1-2 minutos, o hasta que el arroz sea translúcido.", "Agregue unos cucharones de caldo al arroz y revuelva bien, luego agregue los granos de pimienta. Cocine hasta que la mayoría del caldo haya sido absorbido antes de agregar otro cucharón. Continúe cocinando hasta que el arroz esté cremoso pero aún esté al dente, aproximadamente 20 minutos (es posible que no necesite todas las existencias).", "Mientras tanto, caliente la cucharada restante de aceite de oliva con una cucharada de mantequilla en una sartén hasta que forme espuma. Agregue los champiñones y fríalos durante 1-2 minutos, o hasta que estén tiernos.", "Dobla los champiñones en el risotto cocido, seguido de la carne de ganso picada, hierbas frescas y queso parmesano. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta el risotto en platos para servir. Si lo desea, sirva con una ensalada verde al lado."], "url": "www_bbc_co_uk_food_recipes_gooserisotto_93080", "title": "Risotto de ganso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, picado", "½ cebolla, picada", "200g / 7oz de arroz risotto (como arborio o carnaroli)", "½ cucharadita de copos de chile", "55ml / 2fl oz de vino blanco", "200ml / 7fl oz de caldo de verduras calientes", "gran puñado de hojas de espinaca", "50g / 1¾oz de gorgonzola (o un queso azul vegetariano similar), desmenuzado", "4 cucharadas de perejil fresco picado", "1 cucharada de tomillo fresco picado", "2 cucharadas de albahaca fresca picada", "1 diente de ajo, picado", "55ml / 2fl oz de aceite de oliva", "sal y pimienta negra recién molida", "200g / 7oz de tomates cherry", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "50g / 1¾oz de piñones, tostados, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén, agregue el ajo, la cebolla y el risotto de arroz y cocine a fuego medio durante 3-4 minutos.", "Agregue las hojuelas de chile, el vino y el caldo a la sartén y cocine a fuego lento durante 15 minutos, revolviendo a menudo, hasta que el arroz esté al dente.", "Agregue la espinaca y el gorgonzola y reserve para mantener el calor.", "Para el aceite de hierbas, coloca el perejil, el tomillo, la albahaca, el ajo y el aceite en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar bien.", "Para los tomates asados, coloque los tomates en una bandeja para hornear, rocíe con el aceite y sazone con sal y pimienta negra recién molida. Transfiera al horno y tueste por 8-10 minutos.", "Para servir, coloque el risotto en platos, cubra con los tomates, rocíe con el aceite de hierbas y esparza sobre los piñones tostados."], "url": "www_bbc_co_uk_food_recipes_gorgonzolaandpinenut_84950", "title": "Risotto de gorgonzola y piñones con tomates cherry asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2oz de queso gorgonzola", "1 cucharadita de tomillo fresco, solo hojas", "2 chuletas de cordero", "150 g / 5½ oz de judías verdes, recortadas", "1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "½ cebolla, finamente rebanada", "¼ cucharadita de azúcar en polvo", "½ cucharadita de copos de chile"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón pequeño, mezcle el queso gorgonzola y las hojas de tomillo juntas.", "Calienta una sartén antiadherente pequeña, a prueba de horno, y coloca las chuletas de cordero, con la grasa hacia abajo, en la sartén hasta que la grasa se haya derretido y esté crujiente y dorada. Dale la vuelta a las chuletas de cordero y dobla por el otro lado.", "Divida la hierba de queso gorgonzola en dos y presione sobre la parte superior de las chuletas de cordero.", "Transfiera la sartén al horno durante 3-4 minutos o hasta que el cordero esté cocido a su gusto.", "Para la ensalada de frijoles verdes, ponga a hervir un sartén con agua con sal y póngalos a secar durante dos minutos. Desagüe.", "Caliente el aceite de oliva en una sartén antiadherente y agregue el ajo, la cebolla, el azúcar y las hojuelas de chile. Saltee hasta que las cebollas estén suaves pero no coloreadas.", "Agregue las judías verdes escurridas a la sartén y fría por un minuto más.", "Para servir, coloque la ensalada de frijoles verdes calientes en un plato para servir y cubra con las chuletas de cordero."], "url": "www_bbc_co_uk_food_recipes_gorgonzolacrustedlam_87031", "title": "Chuletas de cordero con corteza de gorgonzola en ensalada de judías verdes de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "4 hojas de pasta de filo lista para usar", "1 huevo de gallinas camperas, golpeado", "1 cucharada de crema doble", "85 g / 3 oz de gorgonzola, en cubos", "2 rebanadas de jamón de Parma, picadas", "2 ramitas de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "1 cucharada de semillas de sésamo, para servir"], "method": ["Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque dos hojas de hojaldre en una superficie de trabajo limpia. Mezcle el huevo batido y la crema juntos en un recipiente, luego cepille un poco sobre las sábanas de filo. Coloque otra hoja de filo en la parte superior de cada hoja para formar una doble capa, luego vuelva a cepillar con la mezcla de huevo y crema.", "Corte cada hoja en cuatro a lo largo para que tenga ahora ocho tiras de filo.", "En un tazón pequeño, mezcle el gorgonzola, el jamón de Parma, las hojas de tomillo y el condimento. Coloque una cucharada de la mezcla al final de cada tira de pasta filo, vuelva a cepillar alrededor del relleno con la mezcla de huevo y crema y luego enrolle para hacer triángulos. Cepillo de nuevo con la mezcla de huevo y crema.", "Coloque con cuidado cada triángulo en el aceite caliente. Freír a fuego lento durante cinco minutos o hasta que estén dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, espolvorear con semillas de sésamo y servir amontonado en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_gorgonzolaparmahaman_86217", "title": "Gorgonzola, jamón de parma y paquetes de filo de tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["65g / 2¼oz de mantequilla sin sal, picada", "100 g / 3½ oz de harina fuerte", "pizca de sal", "3 huevos de gallinas camperas, golpeados", "75g / 2¾oz gruyère, rallado", "30 g / 1 oz de crema de queso entero, ablandada", "1 cucharada de mayonesa", "1 cucharada de crema agria", "1 cucharadita de mostaza Dijon", "pizca de cayena", "½ limón, solo ralladura", "200g / 7oz de carne de cangrejo, medio marrón y medio blanco", "puñado de berros", "3 rebanadas de salmón ahumado, cortado en 15 tiras", "15 gambas grandes cocidas, peladas", "½ pimiento rojo, finamente picado", "2 cucharadas de alcaparras picadas", "sal y pimienta negra recién molida", "cuñas de limón, para servir"], "method": ["Para la masa, ponga 160 ml / 5½ fl oz de agua fría y la mantequilla en una olla y déjela hervir suavemente.", "Retirar del fuego y agregar la harina y la sal. Revuelva vigorosamente y luego caliente a fuego lento y mezcle hasta que la mezcla se desprenda de los lados de la sartén. Retirar del fuego y dejar enfriar un poco.", "Batir los huevos un poco a la vez, incorporando cada adición a fondo. Solo agregue suficiente huevo para hacer que la masa tenga una consistencia suave y que se pueda pinchar (es posible que no necesite todos los huevos). Dobla el queso.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel de hornear.", "Coloque la masa en una manga pastelera equipada con una boquilla plana de 16 mm y pise los dedos de 15 x 8 cm / 3¼ en la bandeja preparada. Hornee por unos 25 minutos, reduciendo la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4 después de 10 minutos. Cuando esté crujiente y dorado, apague el horno, abra la puerta y deje los gougères en el horno para que se sequen y enfríen.", "Mientras tanto, para el relleno, mezcle el queso crema, la mayonesa, la crema agria, la mostaza, la pimienta de cayena y la ralladura de limón con la carne de cangrejo marrón. Dobla la carne de cangrejo blanca y condimenta al gusto con sal y pimienta.", "Para ensamblar, corte las partes superiores de los gougères, para que se vean como canoas. Pon unas hojas de berro en la base y coloca la mezcla de cangrejo encima. Coloque una tira enrollada de salmón ahumado y una gamba encima.", "Espolvorear sobre el pimiento rojo finamente picado, las alcaparras y algunas hojas pequeñas de berros decorativamente."], "url": "www_bbc_co_uk_food_recipes_gougre_barquettes_filled_00451", "title": "Barquillas Gougère rellenas de cangrejo, gambas y salmón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 15 brotes de canapés", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gougre_barquettes_filled_00451_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de harina de auto crianza", "1 huevo de gallinas camperas", "3 cucharadas de leche", "3-6 cucharadas de agua con gas", "1 x 125 g / 4½ oz de filete de salmón, cortado en tiras", "aceite vegetal, para freír", "2 cucharadas de aceite de oliva", "1 batata, pelada y cortada en chips", "1 diente de ajo, aplastado", "1 rodaja de limón"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los goujons de salmón, mezcle la harina, el huevo, la leche y suficiente agua con gas para hacer una mezcla con la consistencia de crema doble (es posible que no necesite toda el agua).", "Llene a la mitad una cacerola profunda con aceite vegetal y caliente hasta que un pequeño cubo de pan caiga en chispas y se vuelva dorado en 30 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Sumerja las tiras de salmón en el rebozado y fría, en tandas, en el aceite durante 1-2 minutos, o hasta que estén doradas. Retire con una espumadera y escurra sobre papel de cocina. Repita hasta que todas las tiras de salmón estén cocidas.", "Para los chips de batata y el ajo, caliente el aceite en una sartén a prueba de horno y fría a fuego lento la batata y el ajo durante 3-4 minutos, luego transfiera al horno para cocinar durante 10-12 minutos, o hasta que las papas estén tiernas y marrón dorado.", "Para servir, apile los goujons de salmón en un plato junto con las batatas y el ajo. Adorne con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_goujonsofsalmonwiths_88937", "title": "Goujons de salmón con batatas y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Suela de lenguado o limón 450g / 1Ib, pelada", "aceite de girasol para freír", "50g / 1¾oz de harina natural", "sal", "pimienta negra recién molida", "3 huevos medianos golpeados", "125g / 4½ oz de pan rallado fresco", "225g / 8oz de guisantes secos de tuétano", "1 cucharadita de bicarbonato de soda", "35 g / 1¼ oz de mantequilla", "sal", "pimienta negra recién molida", "½ cucharadita de pimienta de cayena", "2 limones cortados en cuñas"], "method": ["Corte cada suela o lenguado de limón en tiras, en diagonal, de aproximadamente 1 cm / ½ de grosor. Mezcle las migas de pan con la pimienta de cayena y déjela a un lado. Caliente el aceite en una freidora a 190C / 375F.", "Sazone la harina con sal y pimienta. Cubra el pescado en la harina sazonada, luego sumerja primero en el huevo batido y luego en las migas de pan. Haga algunas piezas a la vez, asegurándose de que todos los peces estén cubiertos en cada una de las tres inmersiones.", "Coloque algunos de los goujons en la freidora a la vez y cocine durante aproximadamente un minuto, hasta que estén crujientes y dorados. Repita hasta que todos los goujons estén cocidos. Una vez cocinado, remueva sobre papel de cocina para absorber el exceso de aceite.", "Coloque los goujons en un plato o en platos, sazone y sirva con las rodajas de limón. Son geniales con una ensalada de hoja verde mixta, vestida.", "Para los guisantes blandos, remoje los guisantes en un tazón grande, en tres veces su volumen de agua con el bicarbonato de soda durante al menos cuatro horas o, si tiene tiempo, durante la noche.", "Escurra los guisantes, enjuáguelos bajo el grifo y colóquelos en una fuente grande y cúbralos con el agua. Cubra y hierva, y una vez hervida, reduzca el fuego y cocine a fuego lento los guisantes durante 1½-2 horas, revolviendo de vez en cuando.", "Los guisantes deben ser suaves y de textura blanda pero no demasiado secos. Si están mojados, continúe cocinando sobre el fuego con la tapa apagada para secar un poco. Batir la mantequilla y sazonar.", "Sirva los guisantes blandos con el pescado, espolvoree un poco de pimienta de cayena y cubra con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_goujonsofsolewithlem_71476", "title": "Goujons de lenguado con limón y guisantes blandos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]