[{"ingredients": ["1 cucharada de harina normal", "1 cucharadita de cúrcuma", "1 cucharadita de curry en polvo", "200 g / 7oz de queso paneer, en cubos", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida", "pequeño cilantro fresco puñado, picado, para adornar", "50ml / 2fl oz de vino blanco", "1 cucharada de vinagre de vino blanco", "pizca de copos de chile", "2 cebollas tiernas, finamente picadas", "2 cucharadas de miel líquida", "sal y pimienta negra recién molida", "2 cucharadas de cilantro fresco picado"], "method": ["Para el paneer, coloque la harina, la cúrcuma y el polvo de curry en un tazón, agregue el paneer al tazón y mezcle hasta que esté cubierto.", "Calentar el aceite en una sartén y freír el queso hasta que esté dorado y crujiente. Escurra el queso sobre papel de cocina y sazone con sal y pimienta negra recién molida.", "Para la inmersión, coloque todos los ingredientes, excepto el cilantro, en una cacerola y caliente durante 5-6 minutos, luego agregue el cilantro y revuelva para mezclar.", "Para servir, coloca el paneer en un plato junto con la salsa en un tazón pequeño. Espolvorear con el cilantro, para adornar."], "url": "www_bbc_co_uk_food_recipes_tikkapaneercheesewit_84774", "title": "Tikka paneer con salsa de chile dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾fl oz de azúcar", "75ml / 2¾fl oz de vinagre de vino blanco", "1 naranja, cáscara reservada, pelada y segmentada", "1 bulbo de hinojo, cortado, muy finamente cortado", "75ml / 2¾fl oz aceite de oliva, más 2 cucharaditas extra para freír", "1 cucharada de aceitunas negras sin hueso", "4 x 100 g / 3½ oz de filetes de tilapia", "sal y pimienta negra recién molida", "botón de mantequilla", "1 cucharada de estragón fresco picado", "puñado de berros"], "method": ["Coloque el azúcar y el vinagre en una sartén no reactiva a fuego medio. Llevar a ebullición y cocinar durante 3-4 minutos, o hasta que la mezcla esté almibarada.", "Agregue la ralladura de naranja y los segmentos de naranja pelados, el hinojo, el aceite de oliva y las aceitunas, luego retírelos del fuego y déjelos enfriar.", "Mientras tanto, sazone los filetes de tilapia con sal y pimienta negra recién molida.", "Caliente las dos cucharaditas adicionales de aceite en una sartén a fuego medio. Freír los filetes de tilapia con la piel hacia abajo durante dos minutos.", "Voltee los filetes y agregue la mantequilla. Freír por un minuto más, o hasta que el pescado esté recién cocido, hilvanando regularmente.", "Para terminar la ensalada, coloca el estragón y el berro en un tazón. Agregue la mezcla de hinojo y naranja y mezcle bien.", "Para servir, coloque porciones iguales de la ensalada en cada plato y cubra cada una con un filete de tilapia."], "url": "www_bbc_co_uk_food_recipes_tilapiafishsaladwith_90172", "title": "Ensalada de pescado de tilapia con naranja e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "pizca de tierra mezcla de especias", "½ cucharadita de cúrcuma molida", "pellizcar el orégano seco", "½ cucharadita de hojuelas de chile seco", "1 cucharadita de semillas de cilantro, trituradas", "2 cucharaditas de semillas de sésamo", "150g / 5½oz de arroz de grano largo", "300 ml / 12 fl oz de caldo de pollo caliente (los vegetarianos pueden sustituirlo con caldo de verduras)", "aceite vegetal, para engrasar", "½ naranja, cortado en cuñas, para adornar", "perejil fresco picado, para adornar", "1 cucharada de aceite de oliva", "1 pimiento rojo, picado", "1 diente de ajo, picado", "50ml / 2fl oz de agua hirviendo", "50ml / 2fl oz de vino blanco", "2 cucharadas de azúcar moreno", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado"], "method": ["Para el arroz picante, caliente el aceite en una sartén mediana, agregue todas las especias y las semillas de sésamo y cocine suavemente durante 1-2 minutos.", "Agregue el arroz y mezcle bien para cubrir todos los granos.", "Agregue el caldo de pollo, lleve a ebullición y hierva durante 8-10 minutos, o hasta que el arroz esté tierno.", "Engrase ligeramente dos tazas o timbales con el aceite vegetal y presione el arroz en ellos. Voltee el arroz en platos para servir.", "Para el aderezo, caliente el aceite de oliva en una sartén pequeña a fuego medio y fría el pimiento rojo durante 3-4 minutos. Agregue el ajo y cocine por un minuto más. Agregue el agua, el vino y el azúcar, sazone con sal y pimienta negra recién molida y cocine a fuego lento durante 3-4 minutos. Agregue el perejil, luego mezcle la mezcla con una batidora de mano hasta que esté casi suave.", "Para servir, vierta el aderezo de pimiento rojo alrededor de los timbales de arroz y decore con gajos de naranja y perejil."], "url": "www_bbc_co_uk_food_recipes_timbalesofspicyricew_85187", "title": "Timbales de arroz picante con aderezo de pimiento rojo dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz oz expreso o café instantáneo fuerte", "2 cucharadas de licor de café", "4 galletas Savoiardi (galletas 'ladyfinger' de esponja delgada)", "2 claras de huevo de gallinas camperas", "250g / 9oz de mascarpone", "2 cucharadas de miel", "2 cucharadas de Marsala", "1 cucharadita de cacao en polvo"], "method": ["Haga su expreso y viértalo en una jarra resistente al calor, agregue el licor de café, luego déjelo enfriar - ¡Encuentro diez minutos afuera de la ventana en un día fresco!", "Rompa cada dedo de la esponja de Savoiardi en aproximadamente cuatro y coloque los pedazos en cuatro copas de martini pequeñas, luego vierta la mezcla de expreso frío sobre ellos. Presiona suavemente, asegurándote de que los bizcochos estén empapados.", "Usando una batidora manual eléctrica para facilitar, bate las claras de huevo en un bol hasta que formen picos suaves cuando se quite la batidora y déjalas a un lado por un momento.", "Raspe el mascarpone en otro tazón, agregando la miel: me encanta la forma en que su suave dulzura se casa con el Marsala (aunque el azúcar también estaría bien). Batir con el batidor (no es necesario limpiarlo primero) y, cuando esté suave, batir lentamente en el Marsala.", "Doble las claras de huevo, un tercio a la vez, luego vierta esta mezcla sobre el Savoiardi soused en cada vaso, con una cuchara para convertirlo en un elegante pico en la parte superior.", "Deje reposar en la nevera durante al menos 20 minutos y hasta 24 horas, luego espolvoree con cacao, empujándolo a través de un colador de malla fina, justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_tiramisini_69286", "title": "Tiramisini", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tiramisini_69286_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos grandes de gallinas camperas, separados", "200 g / 7 oz de azúcar en polvo", "250g / 9oz de mascarpone", "Crema doble 250ml / 9fl oz", "250ml / 9fl oz de café exprés", "170ml / 6fl oz de vino Marsala", "30-40 galletas Savoyard (o galletas con dedos de esponja)", "cacao en polvo, para quitar el polvo"], "method": ["En un tazón grande, bata las yemas de huevo y el azúcar con un batidor eléctrico hasta que estén pálidas y cremosas. Mezcle el mascarpone en la mezcla de huevo hasta que esté bien combinado.", "En un recipiente aparte, bate la crema doble hasta que se formen picos suaves cuando se quite la batidora. Con una cuchara de metal, doble la crema batida en la mezcla de mascarpone, huevo y azúcar.", "En otro recipiente muy limpio, batir las claras de huevo hasta que se formen picos suaves cuando se quite el batidor. Doble ligeramente en la mezcla de mascarpone, crema y huevo.", "Ponga un tercio de la mezcla de mascarpone, huevo y crema en un plato grande de aproximadamente 23 cm x 33 cm (9 x 13 pulgadas).", "Mezcle el espresso y Marsala juntos en un tazón poco profundo. Sumerja la mitad de los bizcochos en el espresso y la mezcla de Marsala, luego colóquelos sobre la mezcla de mascarpone y crema en el plato. (Repita el remojo y la estratificación individualmente sobre la marcha o las galletas se volverán demasiado húmedas).", "Cuchara sobre el próximo tercio de la mezcla de mascarpone y crema, seguido de otra capa de galletas. Cuchara sobre la capa final de mascarpone y crema. Cubra y enfríe en el refrigerador por 24 horas.", "Polvo con cacao en polvo antes de servir."], "url": "www_bbc_co_uk_food_recipes_tiramisu_82373", "title": "Tiramisu", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tiramisu_82373_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas de 75g / 3oz cantuccini", "150ml / 5fl oz de café espresso fuerte", "250ml / 9fl oz de crema doble, batida", "2 cucharadas de azúcar glas", "1 cucharadita de cacao en polvo, para decorar", "1 fresa, en rodajas finas, para adornar"], "method": ["Coloque las galletas cantuccini en la base de un plato de postre de vidrio. Vierta más de 100 ml / 3½ oz del café y deje que las galletas se remojen durante un minuto.", "En un tazón mezcle la crema doble batida con el café restante y el azúcar glasé.", "Vierta la mezcla de crema sobre los bizcochos.", "Para servir, espolvorear sobre el cacao en polvo y decorar con la fresa."], "url": "www_bbc_co_uk_food_recipes_tiramisu_82592", "title": "Tiramisu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["un poco de mantequilla ablandada, para engrasar", "4 huevos grandes de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100g / 3½ oz de harina de auto crianza", "1 cucharada de gránulos de café instantáneo", "150ml / 5½fl oz de agua hirviendo", "100ml / 3½fl oz de brandy", "3 tarrinas de 250 g / 9 onzas de queso mascarpone completo en grasa", "300ml / 10½ fl oz crema doble", "3 cucharadas de azúcar glas, cernida", "65 g / 2% C2% BCoz% 20dark% 20chocolate% 20 (36 %% 20cocoa% 20solids),% 20grated", "100 g / 3% C2% BDoz% 20dark% 20chocolate,% 20 (70%% 20cocoa% 20solids),% 20finely% 20chopped", "2 cucharadas de cacao en polvo"], "method": ["Precaliente el horno a 180 ° C / 160 ° C (ventilador) / 350 ° F / Gas 4. Engrase una lata de rollo suizo de 35x25 cm / 14 x 10 pulgadas y forre con papel para hornear.", "Para la esponja, coloque los huevos y el azúcar en un tazón grande y, usando una batidora eléctrica eléctrica, mezcle durante unos cinco minutos, o hasta que la mezcla esté muy pálida y espesa. La mezcla debe dejar un rastro ligero en la superficie cuando se levanta el batidor.", "Tamice la harina y dóblela suavemente con una cuchara o espátula de metal, teniendo cuidado de no mezclar demasiado.", "Vierta la mezcla en la lata de torta preparada e incline la lata para nivelar la superficie.", "Hornee por 20 minutos o hasta que se levante, dorado y elástico al tacto. Dejar enfriar en la lata durante cinco minutos, luego colocar en una rejilla y dejar que se enfríe por completo.", "Para el relleno, disuelva el café en agua hirviendo y agregue el brandy. Dejar de lado para enfriar.", "Cuando la esponja esté fría, corte con cuidado la torta por la mitad horizontalmente, de modo que tenga dos esponjas delgadas de la misma profundidad.", "Utilizando la base suelta de una lata de pastel cuadrado como guía, corte dos cuadrados de 18cm en cada esponja. Deseche los restos de esponja (o consérvelos para pastelitos o una bagatela furtiva de una sola porción).", "Alinee la base y los lados de la lata cuadrada con largos rectángulos de pergamino para hornear; debe haber suficiente exceso de pergamino que puede usar para ayudar a levantar la torta de la lata más adelante.", "Coloque el queso mascarpone en un tazón grande y bata hasta que quede suave. Poco a poco batir la crema y el azúcar glas para hacer un glaseado cremoso y extensible.", "Coloque una capa de esponja en la base de la lata forrada. Ponga más de una cuarta parte de la mezcla de brandy de café. Luego extienda una cuarta parte del glaseado de mascarpone sobre la esponja empapada. Dispersar más de un tercio del chocolate rallado.", "Coloque la segunda esponja en la parte superior, coloque una cuchara sobre otro cuarto de la mezcla de café y luego distribuya otro cuarto del glaseado sobre la esponja empapada. Dispersar sobre otro tercio del chocolate rallado. Repita con la tercera esponja y otra cuarta parte de la mezcla de café y glaseado y el resto del chocolate rallado.", "Coloque la cuarta esponja en la parte superior y cuchara sobre la mezcla de café restante. Usando una espátula, extienda una capa muy fina del glaseado restante sobre la parte superior de la torta; esto se denomina \"cobertura de migajas\" y sellará cualquier migaja suelta de esponja.", "Limpie la espátula y extienda el resto del glaseado en una capa más gruesa sobre la torta. Enfriar durante al menos una hora en la nevera antes de apagar.", "Mientras la tarta se enfríe, derrita la mitad del chocolate picado en un tazón pequeño colocado sobre una fuente de agua hirviendo a fuego lento. (No permita que el fondo del recipiente toque el agua). Revuelva suavemente el chocolate hasta que alcance una temperatura de fusión de 53 ° C / 127 ° F.", "Retire el recipiente del fuego y agregue la mitad restante de chocolate picado y continúe revolviendo suavemente hasta que el chocolate se enfríe a 31 ° C / 88 ° F o menos y tenga un grosor suficiente para pasar la tubería.", "Coloque una hoja de pergamino para hornear sobre la superficie de trabajo. Use otra hoja para hacer una manga pastelera de papel.", "Con una cuchara, coloca el chocolate derretido en la manga pastelera de papel. Corta el extremo y coloca formas decorativas en el pergamino para hornear. Deje que se establezca hasta que se requiera.", "Espolvorea la torta fría de tiramisú con el cacao en polvo antes de colocarla en un plato para servir, usando el papel pergamino para ayudar a levantar la lata. Decora con las formas de chocolate."], "url": "www_bbc_co_uk_food_recipes_tiramisu_cake_13686", "title": "Pastel de tiramisú", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 9", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tiramisu_cake_13686_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas de sándwich de chocolate de 300 g / 10½ oz, como Oreos", "140g / 5oz de mantequilla, derretida", "6 yemas de huevo de granja, batidas", "125 g / 4½ oz de azúcar en polvo", "1 cucharadita de extracto de vainilla", "150ml / 5fl oz de crema doble", "150ml / 5fl oz de mascarpone", "30ml / 1fl oz del espresso", "Licor de café 30ml / 1fl oz", "30ml / 1fl oz de ron especiado", "30ml / 1fl oz de agua tibia", "200g / 7oz dedos de esponja", "30g / 1 oz de cacao en polvo de buena calidad", "Crema doble de 200 ml / 7 fl oz", "Una pizca de sal marina", "250 g / 9 oz de chocolate negro", "30ml / 1fl oz de ron especiado", "50 g / 1¾oz de mantequilla sin sal", "cacao en polvo, para quitar el polvo"], "method": ["Para hacer la base, mezcle los bizcochos en un procesador de alimentos y mezcle con la mantequilla derretida. Presiona en el fondo de la lata y deja reposar en la nevera durante al menos una hora.", "Combine las yemas de huevo batidas y el azúcar en un recipiente sobre agua hirviendo a fuego lento. Asegúrese de que la base del recipiente no toque el agua. Revuelva constantemente hasta que la mezcla se espese y se convierta en un color limón claro. Dejar enfriar antes de agregar el mascarpone y batir hasta que esté completamente combinado.", "Batir la crema en picos suaves y luego doblar suavemente en la mezcla de mascarpone.", "Mezcle el expreso, el licor de café y el ron juntos y vierta sobre los dedos de la esponja.", "Coloque una capa de esponja encima de la base de galletas, luego cubra con la mezcla de mascarpone. Repita con otra capa de esponja y una capa final de mascarpone. Alise la parte superior con un cuchillo plano y colóquelo en la nevera durante al menos 4 horas o durante la noche.", "Mientras tanto, para hacer las trufas, caliente suavemente la crema y la sal en una sartén a fuego medio-bajo. Agregue el chocolate, el ron y la mantequilla y continúe calentándose, revolviendo hasta que quede suave. Dejar enfriar, luego dejar en la nevera durante 2 horas.", "Usando una cucharilla, saque las cucharadas de la mezcla de trufa y enrolle en bolitas. Ruede las bolas en polvo de cacao y transfiéralas a un plato en la nevera, hasta que la tarta de queso esté lista.", "Cuando esté listo para servir, espolvoree la torta de queso con el cacao en polvo y suelte de la lata. Decorar con las trufas de chocolate y servir en rodajas."], "url": "www_bbc_co_uk_food_recipes_tiramisu_cheesecake_66814", "title": "Torta de queso tiramisú", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas, separados", "3 cucharadas de azúcar en polvo", "350g / 12oz mascarpone", "½ limón, solo jugo", "350g / 12oz de castañas dulces", "6 Madeleines", "5 cucharadas de ron blanco", "5 cucharadas de leche entera"], "method": ["Primero haz la crema de mascarpone. En un tazón, bata las yemas de huevo con el azúcar hasta que estén pálidas y parecidas a las de un mousse. Doble el mascarpone, una cucharada a la vez, luego mezcle brevemente. Mezcle el jugo de limón.", "Batir las claras de huevo en un recipiente de vidrio grande y limpio hasta que se formen picos fuertes. Pliégalos gradualmente en la crema de mascarpone. Agregue un poco más de azúcar o jugo de limón, o ambos, si es necesario.", "Separe tres o cuatro marrons glacés para la decoración. Picar el resto y mezclarlos en la crema de mascarpone.", "Corte las Madeleine por la mitad horizontalmente. Mezcle el ron con la leche y remoje las Magdalenas en la mezcla. Coloque seis mitades de Madeleine en un plato rectangular, cubra con la mitad de la crema de mascarpone y luego con las seis mitades de Madeleine restantes. Extienda el resto de la crema de mascarpone sobre la parte superior y decore con todo el marrons glacés. Cubra y enfríe durante aproximadamente seis horas antes de servir."], "url": "www_bbc_co_uk_food_recipes_tiramisu_natalizio_26228", "title": "Tiramisú de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo de rango medio", "Azúcar en polvo 350g / 12oz", "55 g / 2 oz de almendras molidas", "2 cucharadas de harina normal", "3 cucharadas de esencia de café", "50g / 1¾oz de café molido", "100ml / 3½fl oz de vino Marsala", "350g / 12oz mascarpone", "50g / 1¾oz de azúcar glas", "125ml / 4fl oz de crema doble", "150g / 5½ oz de chocolate negro", "25g / 1oz de mantequilla", "1 cucharada de café en polvo fino", "1 cucharada de cacao en polvo"], "method": ["Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 2 y alinee una lata de trinchar de 20 cm / 8 pulg con papel de hornear.", "Batir las claras de huevo y el azúcar hasta que forme picos rígidos con un batidor eléctrico o un mezclador de pie con un accesorio batidor. Agregue las almendras, la harina, la esencia de café y el café molido. Vierta la mezcla en la bandeja revestida y hornee durante 25 minutos o hasta que se endurezca.", "Retire del horno, deje que se enfríe y luego espolvoree con Marsala.", "Mientras tanto, bata el mascarpone y el azúcar glas juntos hasta que estén suaves. Extienda la mezcla sobre el rectángulo de merengue, y luego enrolle cuidadosamente el rectángulo en forma de rollo suizo, utilizando el lado largo.", "Para el aderezo, llevar la crema a ebullición en una sartén pequeña, retirar del fuego. Agregue el chocolate y la mantequilla, y mezcle. Cuando se enfría llovizna ligeramente sobre el rodillo suizo.", "Espolvorea sobre el café y el cacao en polvo, sirve."], "url": "www_bbc_co_uk_food_recipes_tiramisu_roulade_cake_03599", "title": "Pastel de pastel de tiramisú", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos medianos de granja, separados", "Azúcar en polvo de 110 g / 4 oz", "50 g / 1¾oz de cacao en polvo", "400 ml / 14 fl oz crema doble", "200ml / 7fl oz de leche entera", "4 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "300ml / ½ pinta de café expreso", "250 g / 9 oz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "75 g / 2½ oz de azúcar en polvo", "5 yemas de huevo de gallinas camperas", "Crema doble de 425 ml / 15 fl oz", "50ml / 1¾fl oz de amaretto", "Crema doble de 300 ml / ½ pinta", "50g / 1¾oz de chocolate negro, rallado"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase una lata de torta con forma de resorte de 20 cm / 8 pulg. De diámetro.", "Para la torta, coloque las yemas de huevo en un tazón de vidrio y las claras de huevo en otro. Coloque el azúcar con las yemas de huevo y bata hasta que la mezcla deje un rastro cuando quite la batidora (se llama etapa de cinta).", "Tamizar en el polvo de cacao y agitar suavemente en la mezcla de yema de huevo.", "Batir las claras de huevo hasta que se formen picos rígidos cuando retire el batidor. Doble en la mezcla de yema de chocolate. Coloque en la lata de pastel preparada y hornee durante 20 minutos.", "Retirar del horno y dejar enfriar en la lata. Una vez que se haya enfriado, corte la esponja por la mitad horizontalmente y déjela a un lado.", "Mientras tanto, haz la crema inglese. Coloque la crema y la leche en una olla grande y coloque a fuego lento para calentar. Coloque las yemas de huevo en un recipiente grande de vidrio, agregue el azúcar y bata. Agregue la crema caliente y la leche lentamente a los huevos, batiendo todo el tiempo.", "Vuelva a colocar la mezcla en una sartén, agregue el café y caliente hasta que quede suave y espeso.", "Para hacer el relleno de torte, pulse el chocolate en un procesador de alimentos para romperlo. Ponga el azúcar y 100 ml / 3½ fl oz de agua en una sartén, deje que hierva y espere hasta que el azúcar se haya disuelto pero no tenga color.", "Lentamente agregue el azúcar y el agua al chocolate en el procesador de alimentos mientras el motor está funcionando. Agregue las yemas de huevo y mezcle hasta que quede suave.", "En un recipiente aparte, batir la crema hasta que se formen picos rígidos cuando se quite el batidor. Luego dobla la mezcla de chocolate y mezcla hasta que quede suave.", "Para construir la torta, coloque una de las esponjas en el fondo de la torta y vierta más de la mitad del amaretto. Alise más de la mitad del relleno de torte. Cubra con la otra esponja y rocíe con el amaretto restante. Alise el resto del relleno de torte con una espátula para obtener un acabado prolijo.", "Batir la crema para el relleno y pipe en la parte superior. Espolvorea el chocolate rallado sobre la parte superior.", "Para servir, corte una porción de la torta y vierta la crema inglese alrededor de la torta."], "url": "www_bbc_co_uk_food_recipes_tiramisu_torte_with_47596", "title": "Pasteles de tiramisú con crema de café exprés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de café exprés", "75ml / 2flfl oz de vino Marsala", "250g / 9oz de dedos de esponja ya hechos", "200 g / 7 oz de helado de café confeccionado", "200g / 7oz de helado de vainilla listo para usar", "cacao en polvo, para quitar el polvo", "65g / 2oz de chocolate puro, mínimo 70% de sólidos de cacao, roto en pedazos", "Crema doble 65ml / 2fl oz", "½ cucharada de mantequilla sin sal", "75g / 2½oz de chocolate puro, rallado, para servir"], "method": ["Para la torta de helado, vierta el café exprés y el vino Marsala en un tazón. Sumerja la mitad de los dedos de la esponja en la mezcla de café y vino (haga esto rápidamente para que no se desintegren). Coloque los dedos de esponja empapados en una capa en la parte inferior de un plato cuadrado congelable.", "Coloque el café y los helados de vainilla en dos cuencos separados. Batir cada uno con una cuchara de madera hasta que esté suave, suave y untable.", "Extienda el helado de café sobre los dedos de esponja empapados.", "Sumerja los dedos restantes de la esponja en la mezcla de café y vino, como antes, luego extienda sobre el helado de vainilla ablandado.", "Espolvorea la superficie de la torta de helado con cacao en polvo. Coloque en el congelador para enfriar por 20 minutos.", "Mientras tanto, para la salsa de chocolate, hierva un poco de agua a fuego lento en una sartén. Suspenda un recipiente resistente al calor sobre la bandeja (no permita que la base del recipiente toque el agua). Agregue los pedazos de chocolate y la crema doble al bol y revuelva hasta que todas las piezas de chocolate se hayan derretido y la mezcla esté completamente suave y bien combinada.", "Agregue la mantequilla y revuelva hasta que se haya derretido y la mezcla esté brillante. Mantener caliente", "Para servir, coloque un cuadrado de la torta de helado de tiramisú frío en el centro de cada una de las cuatro placas de servir. Espolvoree sobre el chocolate rallado y rocíe sobre la salsa de chocolate caliente."], "url": "www_bbc_co_uk_food_recipes_tiramisuicecreamcake_91472", "title": "Pastel de helado de tiramisú con salsa de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas, separados", "3 cucharadas de azúcar glas", "Crema doble de 100 ml / 3½ fl oz, suavemente batida", "125g / 4½ oz de mascarpone", "2 cucharadas de licor de café", "6 dedos de esponja ya hechos", "150ml / 5½fl oz de café fresco fuerte, refrigerado", "2 cucharaditas de cacao en polvo", "1 cucharada de chocolate blanco rallado", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de almendras blanqueadas"], "method": ["Para el tiramisú, coloca las yemas de huevo y el azúcar glas en un tazón grande y bate con un batidor de mano eléctrico hasta que esté pálido y espumoso.", "Agregue la crema suavemente batida y el mascarpone y una pizca de licor de café, y mezcle bien.", "En un recipiente aparte, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Dobla en la mezcla de crema.", "Mezcle el resto del licor de café con el café frío en un plato poco profundo.", "Sumerja la mitad de los dedos de la esponja en la mezcla de café. Coloque en la base de un gran vaso de postre, luego cuchara más de la mitad de la mezcla de crema. Sumerja el resto de los dedos de la esponja en la mezcla de café, luego coloque encima de la mezcla de crema en el vaso. Termine con la mezcla de crema restante.", "Polvo con cacao en polvo y chocolate blanco rallado y enfriar durante 30 minutos, si el tiempo lo permite.", "Para la almendra quebradiza, coloca el azúcar en una sartén y derretir a fuego lento hasta que adquiera un color caramelo.", "Agregue las almendras y revuelva para cubrir. Vierta sobre una bandeja para hornear forrada con papel de hornear y deje enfriar.", "Cuando esté frío, rompe los pedazos en pedazos y decora la parte superior del tiramisú. Servir."], "url": "www_bbc_co_uk_food_recipes_tiramisuwithalmondbr_87985", "title": "Tiramisú con almendra quebradiza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 lata de peras, en rodajas", "2 pedazos de jengibre", "1 cucharada de jarabe de jengibre", "250ml / 9fl oz de mascarpone", "250ml / 9fl oz crème frâiche", "200g / 7 oz damas dedos galletas", "polvo de cacao", "vaso grande de café extra fuerte", "Marsala o jerez dulce"], "method": ["Coloque las galletas en el fondo de un plato grande. Vierta el café y el Marsala. Asegúrate de que todos los bizcochos estén empapados.", "Mezcle la crème fraîche y el mascarpone y agregue el jengibre tallo picado y algo del jarabe. Cuánto depende de la fuerza que te gusta", "Coloque las peras sobre los bizcochos. Coloque la mezcla de crema sobre la superficie y espolvoree abundantemente con chocolate. Enfríe por 2 horas antes de servir."], "url": "www_bbc_co_uk_food_recipes_tiramisuwithpearsand_14575", "title": "Tiramisú con peras y tallo de jengibre", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20 huevos de gallinas camperas", "Harina normal de 1.25kg / 2lb 12oz", "500ml / 18fl oz de leche entera", "1.5 litros / 2 pintas 14 fl oz de agua fría", "sal marina y pimienta negra recién molida", "300 g / 10½ oz de manteca de cerdo", "40 salchichas de cerdo"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque los huevos, la harina, la leche, el agua y el condimento en una batidora grande y bata hasta que tenga una mezcla suave. Coloque en la nevera para descansar durante 30 minutos.", "Coloque la manteca de cerdo en dos latas grandes para hornear y colóquela en el horno durante 5-8 minutos o hasta que esté humeando.", "Vierta cuidadosamente la mezcla - chisporroteará suavemente en la grasa caliente - luego coloque las salchichas en la masa.", "Transfiera las latas al horno y hornee por 25-30 minutos hasta que se doren y se doren."], "url": "www_bbc_co_uk_food_recipes_toad_in_the_hole_41928", "title": "Sapo en el agujero para una multitud", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "sal y pimienta negra", "3 huevos de gallinas camperas", "300 ml / 10 fl oz de leche", "2 cucharadas de aceite de oliva", "8 salchichas", "1 cucharada de aceite de oliva", "2 cebollas, finamente cortadas", "½ cucharadita de mostaza inglesa", "500 ml / 18 fl oz existencias (de un cubo de valores, ideal carne de vacuno, aunque pollo o verdura está bien)", "1 repollo Savoy, rallado, con núcleo descartado", "½ cucharada de aceite de oliva", "2 ajos, pelados y finamente picados"], "method": ["Para la mezcla, tamiza la harina en un recipiente y sazone con sal y pimienta. Haz un pozo en el medio y rompe los huevos. Batir los huevos lentamente en la harina. Una vez combinado, vierta la leche mientras bate para que tenga una masa suave y sin grumos con la consistencia de crema doble (si la masa es demasiado espesa, agregue un poco de agua). Cubra la masa y descanse en la nevera durante una hora.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la salsa de cebolla, caliente una sartén de base pesada a fuego lento. Agregue el aceite, las cebollas y una pizca de sal. Cocine suavemente durante 15-20 minutos, o hasta que esté completamente colapsada y de color marrón dorado oscuro. Si las cebollas se cocinan demasiado rápido, cubra con una tapa mientras se cocinan.", "Una vez que las cebollas estén completamente blandas y doradas, agregue la mostaza y una pizca de pimienta y luego agregue el caldo. Llevar la mezcla a ebullición, reducir a fuego lento y cocinar a fuego lento durante 10-15 minutos, o hasta que el volumen del líquido se haya reducido a la mitad. Pruebe y ajuste el condimento según sea necesario.", "Coloque una bandeja para asar (aproximadamente 30x20x6cm / 12x8x2½in) en el horno precalentado. Una vez que esté realmente caliente, agregue el aceite de oliva y las salchichas. Dore las salchichas en el horno caliente, volteándolas una y otra vez hasta que estén coloreadas por todos lados (no es necesario que estén cocidas).", "Batir la masa reposada y verter en la lata caliente sobre las salchichas doradas. Regrese al horno y cocine por otros 30-35 minutos, o hasta que la mezcla esté levantada y dorada por todas partes.", "Mientras el sapo en el hoyo se está cocinando, prepare el repollo. Saque el repollo rallado en una sartén alta o en una sartén poco profunda con 3-4 cucharadas de agua a fuego medio durante 6-8 minutos, revolviendo ocasionalmente. Una vez que el repollo esté tierno, vierta el exceso de agua (o agréguelo a la salsa) y luego agregue el aceite a la sartén junto con el ajo. Freír a fuego mediano durante 2-3 minutos, o hasta que el ajo esté suave y aromático. Sazone el repollo con sal y pimienta y manténgalo caliente.", "Vuelva a calentar la salsa de cebolla y sirva el sapo cocido en el agujero en rodajas con el repollo al costado."], "url": "www_bbc_co_uk_food_recipes_toad_in_the_hole_with_86283", "title": "Sapo en el hoyo con salsa de cebolla y col de ajo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toad_in_the_hole_with_86283_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "1 huevo de gallinas camperas", "100ml / 3½ fl oz de leche", "Harina normal de 50g / 2oz", "1 cucharadita de mostaza integral", "2 salchichas de chipolata", "4 tomates cherry"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase un plato pequeño a prueba de horno.", "Bata el huevo en un tazón y luego bate la leche.", "Coloque la harina en un recipiente aparte y luego bata lentamente la mezcla de huevo. Batir la mostaza.", "Coloque las salchichas y los tomates en el plato y vierta sobre la mezcla.", "Hornee en el horno por 15-20 minutos, o hasta que la mezcla esté hinchada y dorada."], "url": "www_bbc_co_uk_food_recipes_toad_in_the_hole_84460", "title": "Pequeño sapo en el agujero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina común 115g / 4oz", "gran pizca de sal", "pimienta negra recién molida", "4 huevos grandes de gallinas camperas", "300 ml / ½ litro de leche", "2 cucharadas / 30g de hojas frescas de tomillo", "8 salchichas de cerdo, de ternera o vegetarianas de buena calidad", "2 cucharadas / 30 g de mostaza Dijon", "2 cucharadas / 30 g de goteo de carne o grasa vegetal blanca para vegetarianos", "botón de mantequilla, para servir"], "method": ["Para hacer la mezcla, tamiza la harina en un tazón grande. Agrega la sal y la pimienta.", "Haz un pozo en el centro de la harina y agrieta los huevos. Usando una cuchara de madera, gradualmente bata los huevos en la harina y luego bata lentamente en la leche hasta que la mezcla tenga la consistencia de la crema doble.", "Cuele y empuje los grumos restantes a través de un tamiz. Revuelva en el tomillo. Cubra y deje reposar por 30 minutos, o idealmente por 3-4 horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén antiadherente grande y cocine las salchichas a fuego medio hasta que estén doradas por todas partes. (Si no tiene un sartén antiadherente, agregue un poco de aceite.) Apague el fuego y cepille las salchichas con la mostaza. Dejar de lado.", "Coloque el goteo o grasa vegetal blanca en un plato resistente al horno y caliente en el horno durante cinco minutos o hasta que el goteo esté caliente y confuso.", "Agregue las salchichas al plato caliente y vierta la mezcla. Inmediatamente devuelva el plato al horno y cocine por 35-40 minutos hasta que esté bien levantado y dorado.", "Servir condimentado con pimienta negra y un gran botón de mantequilla."], "url": "www_bbc_co_uk_food_recipes_toadinthehole_3354", "title": "Sapo en el agujero", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toadinthehole_3354_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "200 g / 7 oz de carne picada de cerdo", "pellizcar el orégano seco", "sal y pimienta negra recién molida", "Harina común 110g / 4oz", "pizca de sal", "2 huevos de gallinas camperas, golpeados", "290ml / ½ litro de leche"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén pequeña a prueba de horno. Coloque la carne picada y el orégano en un tazón grande, sazone con sal y pimienta negra recién molida y mezcle bien. Enrolla la mezcla en bolas del tamaño de una pelota de golf. Coloque las albóndigas en la sartén y fría hasta que estén doradas por todos lados.", "Mientras tanto, para el rebozado, coloque la harina y la sal en un tazón grande, haga un pocillo en el medio y bata los huevos y la leche para formar una masa espesa y suave. Deja descansar durante cinco minutos.", "Caliente la sartén, con las albóndigas adentro, hasta que esté muy caliente y vierta la mezcla sobre las albóndigas.", "Transfiera al horno y cocine durante 10-12 minutos, o hasta que la mezcla esté bien levantada y dorada en la parte superior y las albóndigas estén completamente cocidas.", "Para servir, transfiéralo a un plato de servir."], "url": "www_bbc_co_uk_food_recipes_toadinthehole_85707", "title": "Sapo en el agujero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "125g / 4½oz de harina natural", "150ml / 5fl oz de leche mezclada con 150ml de agua fría", "1 cucharada de mostaza en grano", "sal y pimienta negra recién molida", "6 salchichas de cerdo herby y grasas", "100 g / 3½ oz de jamón serrano cortado en rodajas finas, panceta, jamón serrano o tocino rayado fino", "3 cucharadas de goteo o manteca de cerdo", "cebolla morena y salsa de madeira"], "method": ["Batir los huevos, la harina, la leche, la mostaza y el condimento, batiendo cualquier pequeño trozo de harina. La consistencia debe ser similar a la de la crema doble común, pero no más delgada. Descansa por 15 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Retire con cuidado la piel de cada una de las salchichas. Envuelva cada pedazo de carne de salchicha pelada en un pedazo de jamón curado.", "Ponga el goteo o la manteca de cerdo en un molde para asar y déjelo en el horno hasta que esté humeando.", "Vierta la mezcla - chisporroteará suavemente en la grasa caliente - luego coloque las salchichas en la masa.", "Transfiera la lata al horno y hornee durante 25-30 minutos hasta que se hinche y se dore. Sirva con cebolla marrón y salsa de Madeira."], "url": "www_bbc_co_uk_food_recipes_toadinthehole_83871", "title": "Sapo en el agujero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toadinthehole_83871_16x9.jpg", "isVegetarian": false, "recommendations": 0}]