[{"isVegetarian": true, "title": "Tarka dal", "url": "www_bbc_co_uk_food_recipes_tarkadal_90055", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarkadal_90055_16x9.jpg", "ingredients": ["250g/9oz chana dal (yellow dried split peas), rinsed until the water runs clear", "3 tbsp vegetable oil ", "1 tbsp cumin seeds", "1 small onion, chopped", "3-4 whole green chillies, pricked with a knife", "2cm/¾in piece fresh ginger, peeled and cut into thin strips", "3 garlic cloves, peeled and left whole", "3 tomatoes", "¾ tsp ground turmeric", "¾ tsp garam masala", "1½ tsp ground coriander", "salt and freshly ground black pepper", "handful chopped fresh coriander leaves"], "serves": "Serves 4-6 as a side, 2 as a main", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the lentils and 900ml/1¾ pints of the water into a pan, stir well and bring to the boil. Skim off any froth that forms on the surface of the water with a spoon. Cover the pan with a lid and reduce the heat to a simmer. Simmer, stirring regularly, for 35-40 minutes, or until the lentils are just tender, adding more water as necessary. ", "When the lentils have cooked through, remove the pan from the heat and use a whisk to break down the lentils. Set the mixture aside to thicken and cool.", "Meanwhile, heat the oil in a pan over a medium heat. Add the cumin seeds and fry for 20-30 seconds, or until fragrant.", "Add the onion, chillies and ginger and fry for 4-5 minutes, or until golden-brown. ", "Blend the garlic and tomatoes to a purée in a food processor. Add the purée to the pan and stir well to combine. ", "Add the ground spices and 100ml/3½fl oz of water to the pan and stir well to combine. Season, to taste, with salt and simmer over a medium heat for 15-20 minutes, or until the oil from the sauce has risen to the surface of the sauce. ", "Add the cooked lentils to the sauce and stir well, adding more water as necessary to loosen the mixture. Bring the mixture to the boil and season, to taste, with salt and freshly ground black pepper. Stir in the chopped coriander just before serving."]}, {"isVegetarian": false, "title": "Tarragon stuffed crown of lamb with duchess potatoes", "url": "www_bbc_co_uk_food_recipes_tarragon_stuffed_crown_01121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large baking potatoes", "25g/1oz butter", "3 free-range egg yolks", "1 small onion", "25g/1oz butter, plus extra for greasing", "300g/10½oz button mushrooms", "1 small bunch picked tarragon, finely chopped", "50g/1¾oz fresh white breadcrumbs", "75g/2½oz lamb mince", "salt and freshly ground black pepper", "2 x 7-bone French trimmed racks of lamb"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the duchess potatoes, preheat the oven to 200C/400F/Gas 6.", "Bake the potatoes in the oven for about 1-1¼ hours, or until tender when pierced by a knife.", "For the tarragon stuffed crown of lamb, put the onion in a food processor and pulse until very finely chopped. ", "Heat a frying pan until warm, add the butter and onions and gently fry for a few minutes.", "Add the mushrooms to the food processor and blend to a really fine purée, then add them to the frying pan. Turn the heat up to high and fry for 2-3 minutes, or until all the moisture from the mushrooms has been driven off.", "Tip into a bowl with the tarragon, breadcrumbs and mince. Season generously with salt and black pepper.", "Rub some butter over a sheet of aluminium foil. Place the foil on an oven tray, buttered side up.", "Tie the two racks of lamb together to form a circle and place onto the buttered foil. Spoon the stuffing into the centre, packing down well. Place in the oven (set to 200C/400F/Gas 6) for 50-60 minutes then remove and rest for 10 minutes.", "Meanwhile, for the duchess potatoes, remove the potatoes from the oven and, when cool enough to handle, scoop out the flesh and pass it through a fine sieve into a bowl.", "Beat to a smooth and fluffy purée then add the butter and egg yolks. Season with salt and pepper.", "Spoon into a piping bag then pipe little pyramids onto a baking tray and place in the oven for 5-10 minutes, or until golden-brown.", "To serve, carve the lamb and serve with the duchess potatoes. "]}, {"isVegetarian": false, "title": "Tarragon crusted sea bass", "url": "www_bbc_co_uk_food_recipes_tarragon_crusted_sea_93411", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarragon_crusted_sea_93411_16x9.jpg", "ingredients": ["4 sea bass fillets, skin on", "40g/1½oz butter", "60g/2¼oz panko breadcrumbs", "1 unwaxed lemon, finely grated zest ", "1 tbsp chopped fresh tarragon", "40g/1½oz Parmesan, coarsely grated", "salt and freshly ground black pepper", "200g/7oz crème fraîche", "dash caster sugar", "1 tbsp lemon juice "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 200C/180C Fan/Gas 6. Line a large baking tray with baking paper. ", "Season the sea bass fillets well on both sides with salt and pepper.  ", "Melt the butter in a shallow frying pan. Remove from the heat, add the breadcrumbs, lemon zest and half the tarragon. Toss and set aside.", "Place half the breadcrumb mixture in four rows on the prepared tray. Place the fillets on top, skin side down and press firmly into the crumbs. Top each fillet with the remaining crumbs and sprinkle with Parmesan. Bake for 12–15 minutes until cooked through. Cut the lemon into wedges. ", "To make the sauce, mix the crème fraiche, remaining tarragon, sugar, and lemon juice together in a bowl. Season with salt and pepper.  ", "Serve the fish with a dollop of sauce and lemon wedges."]}, {"isVegetarian": false, "title": "Tarragon chicken on carrot and chicory salad", "url": "www_bbc_co_uk_food_recipes_tarragonchickenoncar_78548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 skinless chicken breast, flattened with a rolling pin", "juice of 1 lime", "1 garlic clove, crushed and diced", "2 tbsp olive oil", "1 red onion, chopped", "150ml white wine", "½ chicken stock cube", "1 tbsp double cream", "1 tsp wholegrain mustard", "1 tbsp tarragon, chopped", "1 chicory head", "1 carrot, peeled and grated", "bunch of chives, chopped", "1 tbsp olive oil", "1 tbsp lemon juice", "1 tsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the chicken into strips and toss in a bowl with the lime juice, garlic and a tablespoon of the olive oil.", "Heat the remaining oil in a deep frying pan. Add the red onion and white wine and bring to a simmer.", "Add the chicken, crumble in the stock cube and simmer for about ten minutes, or until the chicken is cooked through.", "Add the cream and wholegrain mustard to the pan and continue to simmer for two minutes, until reduced and slightly thickened.", "Add the chopped tarragon and stir through.", "For the salad, mix together the chicory, carrot and chives. Add the oil, lemon juice and balsamic vinegar and toss thoroughly.", "To serve, spoon the chicken on top of the salad and drizzle with the cream and mustard sauce."]}, {"isVegetarian": true, "title": "Tarte au citron", "url": "www_bbc_co_uk_food_recipes_tarte_au_citron_94480", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarte_au_citron_94480_16x9.jpg", "ingredients": ["175g/6oz plain flour", "100g/3½oz cold butter, cut into small cubes", "25g/1oz icing sugar", "1 free-range egg yolk", "1 tbsp cold water ", "5 free-range eggs", "125ml/4fl oz double cream", "225g/8oz caster sugar", "4 lemons, juice and zest", "icing sugar, for dusting"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, place the flour, butter and icing sugar into a food processor. Pulse briefly until the mixture resembles breadcrumbs, then add the egg yolk and water. ", "Pulse again until the mixture sticks together in clumps then tip onto a work surface and gather it into a ball with your hands. Knead the pastry just two or three times to make it smooth. If your butter was a bit too soft, the pastry might be too. If so, wrap it in parchment paper and chill for 15 minutes.", "Grease a 23cm/9in loose-bottomed, fluted tart tin.", "Lay a piece of parchment paper on the work surface. Remove the base from the tart tin and lay it on the paper. Using a pencil, draw a circle onto the paper 4cm/1½in bigger than the tin base.  ", "Dust the base of the tin with flour. Place the pastry ball in the centre of the tin base and flatten it out slightly. Roll out the pastry, still on the base, until it meets the circle mark. As you are rolling out, turn the pastry by turning the paper.  Gently fold the pastry surrounding the tin base in towards the centre.  ", "Carefully lift the tin base off the work surface, drop it into the tin, then ease the pastry into the corners and up the sides of the tin, pressing the overhang lightly over the rim. If the pastry has cracked at all, simply press it together to seal. Press the pastry into the flutes of the tin then lightly prick the base with a fork, but not quite all the way through. Place the pastry-lined tin on a baking tray, cover loosely with cling film and chill in the fridge for 30 minutes. Preheat the oven to 200C/400F/Gas 6. ", "Remove the cling film from the pastry case and line with foil so it supports the sides, then fill with baking beans. Bake blind for 12-15 minutes, until the pastry is set, then lift out the foil and beans. Carefully trim the excess pastry from the sides using a sharp knife, holding the knife at a sharp angle and slicing away from you. Remove the trimmings from the sheet. Return the empty pastry case to the oven for another 10-12 minutes or until it is pale golden and completely dry. Set aside to cool while you make the filling. Reduce the oven temperature to 170C/325F/Gas 3. ", "For the filling, break the eggs into a large bowl and whisk together with a wire whisk. Add the rest of the filling ingredients and whisk again until they are all well combined. Pour the filling mixture into a jug, then into the cooled baked pastry case. To prevent it spilling as it goes in the oven, pour in most of the filling so it almost fills the tart, carefully sit the baking sheet and tart on the oven shelf, then top up with the rest of the filling to completely fill it. Bake for about 30-35 minutes or until just set but with a slight wobble in the centre. ", "Leave to cool slightly then, when the pastry seems firm enough, remove the tart from the tin. The easiest way to do this is to place the base of the tin on an upturned can or jam jar and let the outer ring fall to the work surface. Transfer the tart to a serving plate and serve warm or cold, dusted with sifted icing sugar. "]}, {"isVegetarian": true, "title": "Tarte owt of lente", "url": "www_bbc_co_uk_food_recipes_tarte_owt_of_lente_36277", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz shortcrust pastry", "plain flour, for dusting", "200g/7oz Cheshire cheese, grated", "225ml/8fl oz double cream", "2 free-range eggs, beaten", "100g/3½oz cream cheese", "sea salt and black pepper", "1 free-range egg yolk", "1 tsp milk"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Roll out the pastry on a lightly floured work surface and use two thirds of it to line a 23cm/9in fluted pie tin. Place the pastry case in the fridge to chill while you prepare the filling and then gather up the scraps and the remaining pastry, roll into a ball, wrap in cling film and set aside.", "Put the Cheshire cheese into a food processor and blend to a fine crumb. Gradually add the cream, blending until the mixture is smooth, then add the eggs, cream cheese and a pinch of salt and pepper and blend again to combine. ", "Pour the mixture into the pastry case, then roll out the excess pastry to make a lid. Brush the edge of the pastry case with a little water, top with the lid and pinch to seal. ", "For the glaze, mix together the egg yolk and milk in a small bowl. Trim the edges of the tart and then brush the top with the glaze. Bake for 30 minutes, or until golden-brown."]}, {"isVegetarian": true, "title": "Tarte Tatin", "url": "www_bbc_co_uk_food_recipes_tarte_tatin_72509", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarte_tatin_72509_16x9.jpg", "ingredients": ["2kg/4½lbs dessert apples, about 12, peeled", "3 tbsp water", "100g/3½oz caster sugar", "60g/2½oz cold unsalted butter, diced", "30g/1oz unsalted butter, melted, to add richness", "300g/11oz all-butter puff pastry, rolled to a thickness of 3mm/⅛in, cut very slightly larger than the diameter of the tarte tin, pricked with a fork and frozen"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Cut the apples in half horizontally, remove the cores and slice off the rounded tops and bottoms of the apples so they sit flat in the tin. ", "Put the water in the bottom of the tin and sprinkle over the sugar. Let it sit for two minutes to allow the water to absorb the sugar.", "On a medium heat, cook the syrup until it turns to a pale blonde caramel (do not let it become too dark or the flavour will overpower the apples), then stir in the diced butter - this will stop the caramel cooking and give extra richness to the dish.", "Arrange the apples, middles uppermost, around the edge of the tin and then fill in the centre with the remaining apples. It is important to pack them as tightly as possible – press them down with your hands as you go.", "Brush the apples with the melted butter and place the tin on a baking tray. Bake in the oven for 30 minutes.", "Remove from the oven and place the disc of frozen pastry on the top. Tuck the edges of the pastry into the dish and prick a few holes with a sharp knife to let the steam out as the dish cooks.", "Return to the oven for a further 40-45 minutes, or until the pastry is crisp and golden-brown.", "Allow to cool at room temperature for one hour before turning out of the tin and serving warm. Alternatively, make the tarte the day before and reheat as above. "]}, {"isVegetarian": true, "title": "Tarte tatin", "url": "www_bbc_co_uk_food_recipes_tarte_tatin_05826", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, sifted", "1 pinches salt", "100g/3½oz butter, chilled and cubed", "2 tbsp soured cream, or crème fraîche", "4 eating apples, Granny Smith or Golden Delicious; if using a small variety, such as Cox’s Orange Pippin, you will need about 6 apples", "125g/4½oz caster sugar", "100ml/3½oz water", "25g/1oz butter", "1 free-range egg, beaten", "whipped cream, ice-cream or whipped cream with a little icing sugar", "ground cinnamon or Calvados"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soured cream shortcrust pastry, place the flour, salt and butter in a food processor and blend briefly. Add half of the soured cream and continue to blend. You might add a little more soured cream, but not too much as the mixture should be just moist enough to come together. If making by hand, rub the butter into the flour until it resembles coarse breadcrumbs then, using your hands, add just enough soured cream to bring it together.", "With your hands, flatten out the ball of dough until it is about 2cm/¾in thick, then wrap in cling film or place in a plastic bag and leave in the fridge for at least 30 minutes or, if you are pushed for time, in the freezer for 10–15 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "For the filling: prepare the apples, by peeling them with a peeler to keep them in a nice rounded shape, then cut into quarters. Remove the core from each quarter and set aside. Don’t worry if they go brown, and don’t cover in water or they will be too wet.", "Place the sugar and water in a medium-sized ovenproof saucepan set over a low–medium heat and stir until the sugar dissolves.", "Increase the heat and boil the syrup until it starts to caramelise around the edges – about five minutes. Do not stir once it has come to the boil otherwise the syrup will crystallise. Once the syrup starts to turn golden-brown, you may need to swirl the pan slightly to even out the caramelisation.", "Once the syrup is a golden-caramel colour, add the butter and swirl the pan again to distribute it through the caramel.", "Remove the pan from the heat, and place the apple quarters in a concentric circle around the outside and any remaining pieces in the centre, keeping in mind that the tart will be flipped over when serving. The apples must completely cover the base of the pan; you may need an extra apple!", "Place the pan back over a medium heat and cook for 10 minutes to slightly caramelise the apples, while you roll out the pastry.", "Roll the pastry out on a lightly floured work surface to a disc about 2cm wider in diameter than the pan. Remove the pan from the heat and place the pastry on top of the almost cooked apples. Using the base of a spoon or a fork, tuck the pastry in around the edges of the apples. Brush the pastry with beaten egg then, using a skewer or fork, prick a few holes in the pastry.", "Bake in the oven for 25 minutes or until the pastry is golden and the apples feel cooked when you insert a skewer through the centre.", "Remove from the oven and allow to stand for just a few minutes before placing a plate on top of the pan and carefully (it is hot!) but quickly flipping it out. Use a plate with a slight lip to catch the delicious juices. Cut into slices to serve. Serve with whipped cream, ice cream or whipped cream with a little icing sugar and cinnamon or Calvados mixed in."]}, {"isVegetarian": false, "title": "Tartiflette", "url": "www_bbc_co_uk_food_recipes_tartiflette_59096", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tartiflette_59096_16x9.jpg", "ingredients": ["1kg/2lb 4oz Charlotte potatoes, peeled", "250g/8oz bacon lardons", "2 shallots", "1 garlic clove", "100ml/3½fl oz white wine ", "200ml/7fl oz double cream", "sea salt and freshly ground black pepper", "1 whole Reblochon cheese (about 450g/1lb), sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tartiflette, preheat oven to 200C/400F/Gas 7.", "Cook the potatoes in a saucepan of salted boiling water for 5-10 minutes, or until tender.", "Drain and set aside to cool slightly.  ", "Meanwhile, heat a frying pan until hot and fry the bacon, shallots and garlic for 4-5 minutes, or until golden-brown. Deglaze the pan with the white wine and continue to cook until most of the liquid has evaporated.", "Slice the potatoes thinly and layer into an ovenproof gratin dish with the bacon mixture. Pour over the double cream.  Season with salt and lots of freshly ground black pepper. Layer the Reblochon slices on top. ", "Bake in the oven for 10-15 minutes or until the cheese is golden-brown and bubbling."]}, {"isVegetarian": true, "title": "Tarte tatin with calvados cream", "url": "www_bbc_co_uk_food_recipes_tarte_tatin_with_27177", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarte_tatin_with_27177_16x9.jpg", "ingredients": ["200g/7oz ready-made puff pastry", "little plain flour, for dusting", "100g/3½oz caster sugar", "60g/2¼oz unsalted butter, cubed, plus extra, melted, for brushing", "600g/1lb 5oz Braeburn apples, peeled, cored and cut into quarters", "175ml/6fl oz double cream", "½ tbsp icing sugar", "1 tbsp calvados", "1 fresh mint sprig, to decorate"], "serves": "6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Roll out the pastry on a lightly floured work surface to a circle a little larger than the rim of a 20cm/8in ovenproof frying pan.", "Place the frying pan over a medium heat, pour in the sugar and cook until it turns light brown and starts to smoke a little. Do not stir, simply move the pan around a little if required – it will take 5 minutes or so.  ", "Remove the pan from the heat and add the cubed butter. Stir until combined, then arrange the apples in the pan, starting from the outer edge and working towards the centre. Brush the apples with the melted butter and place the pastry on top, tucking it in at the sides. Prick the pastry several times with a fork. Bake the tart for 20–25 minutes, or until risen and golden brown. Leave to cool for 10 minutes. ", "Meanwhile, make the calvados cream. Place the cream and sugar in a bowl and whisk until it starts to form soft peaks. Add the calvados and stir gently. ", "Serve the tarte tatin with the calvados cream in a small bowl, topped with the mint."]}, {"isVegetarian": true, "title": "Tarte tatin", "url": "www_bbc_co_uk_food_recipes_tartetatin_80584", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tartetatin_80584_16x9.jpg", "ingredients": ["320g/11oz plain flour", "225g/8oz ice-cold butter", "110g/4oz icing sugar", "3 free-range egg yolks", "6 Cox or 4 Granny Smith apples, peeled, cored and cut into 8-12 wedges", "¼ lemon", "110g/4oz caster sugar", "110g/4oz butter", "double cream or vanilla ice cream"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 250C/500F/Gas 9.", "First, make the pastry. In a food processor, mix the flour, butter and icing sugar just until they resemble breadcrumbs. Add the egg yolks and, using the pulse button, mix until it comes together in a dough. ", "Remove the dough from the mixer bowl and divide into two pieces. Wrap in clingfilm and put in the freezer to chill for at least an hour.", "For the filling, place the apple wedges in a bowl, squeeze the lemon juice over them and toss them gently.", "Sprinkle 85g/3oz of the sugar in a heavy-bottomed pan and place on the hob over a medium heat, turning the pan frequently and making sure the sugar doesn't burn. Allow the sugar to caramelise a little and become a pale golden brown, then remove from the heat and arrange the drained apple pieces in one layer over the bottom of the pan.", "Place the pan in the oven and bake until the apples have softened a bit and started to release some liquid - about 10 minutes.", "Remove from the oven and sprinkle over the remaining sugar and dot the butter on top. Remove the pastry from the freezer and, using the coarse side of a cheese grater, grate the pastry with long steady strokes over the apples until it forms an even layer at least 2.5cm/1 inch thick. Do not press down. Return to the oven, turn the heat down to 220C/425F/Gas 7 and bake until the pastry is golden brown - about 20 minutes. Remove from the oven and leave to rest for a minute or two.", "Take a heatproof serving dish that is generously larger than the pan on all sides and place over the pan. Protecting your hands with a dry folded tea-towel, and holding the dish and pan firmly together, quickly and carefully flip the pan and the dish so that the pan is on top. Tap the pan sharply a few times all round with a wooden spoon, then lift off. The tart should be left on the serving dish with the apple on top. ", "Serve warm with double cream, crème fraîche or vanilla ice cream."]}, {"isVegetarian": false, "title": "Tartiflette with bacon fat salad", "url": "www_bbc_co_uk_food_recipes_tartiflette_and_bacon_21649", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz medium sized, red-skinned potatoes, such as Désirée", "75g/3oz butter, plus extra to serve", "1 large white onion, finely sliced", "1 tsp fresh thyme leaves", "1 bulb garlic, cut in half horizontally ", "10 thick slices smoked dry-cured streaky bacon", "1 x 250g/9oz whole petit Reblochon cheese, rind removed", "1 tsp Dijon mustard", "1½ tbsp white wine vinegar", "1 free-range egg yolk", "2 tbsp vegetable oil", "100g/3½oz mixed salad leaves", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the whole potatoes in a large pan, cover with water and bring to the boil. Cook for 10 minutes.", "While cooking, heat a frying pan until medium-hot, add a knob of the butter, onion and thyme and gently fry for 5-8 minutes, or until softened, but not coloured.", "Drain the potatoes and, when they are cool enough to handle, scrape the skins off using a table knife and cut them into thick slices (about 5mm thick).", "Rub the cut side of the garlic all over the inside of an ovenproof dish, then smear on some butter.", "Place the sliced onions into the dish and spread out over the base, then lay six slices of bacon across the top. Lay the potatoes in concentric circles over the top, then place the cheese in the centre. Top with half the remaining butter and season with freshly ground black pepper and a touch of salt.", "Bake in the oven for 45 minutes, or until the potatoes are lovely and crisp around the edges and the cheese is totally melted.", "While the tartiflette is cooking, melt the remaining butter and chop the remaining slices of bacon into small pieces. Heat a frying pan, add the bacon and cook over a medium heat until the fat starts to render out, then turn the heat up and cook until crisp and browned.", "To make the dressing, whisk the Dijon mustard, vinegar and egg yolk together until pale then very slowly add the vegetable oil, whisking all the time until the mixture emulsifies. Pour the mixture into the hot fat from the bacon pan and whisk to combine. Season to taste with salt and pepper.", "Toss the crisp bacon with the salad leaves and toss with a little of the dressing.", "Remove the tartiflette from the oven and brush with a little melted butter. Serve in slices with the dressed salad."]}, {"isVegetarian": false, "title": "Gyoza (Japanese dumplings)", "url": "www_bbc_co_uk_food_recipes_tasty_gyoza_japanese_16947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz strong white flour, plus extra for rolling", "½ tsp fine salt", "200ml/7fl oz boiling water", "1 tbsp vegetable oil, for frying", "1 tbsp sesame oil", "500g/1lb 2oz pork or chicken mince", "1 head pak choi, very finely shredded", "¾in/2cm piece fresh root ginger, peeled, grated", "3 garlic cloves, peeled, grated", "½ tsp salt", "½ tsp freshly ground black pepper", "1 tbsp chopped spring onion (green part only)", "½ tsp ground chilli flakes", "1 tsp sesame oil", "1 tbsp oyster sauce", "pinch sugar", "1 dressed crab (dark and white meat)", "200g/7oz cooked, peeled North Atlantic prawns, chopped", "½ tsp fine salt", "½ tsp freshly ground black pepper", "1 tbsp sesame oil", "½ lemon, zest only, finely grated", "1 tbsp oyster sauce", "1 tbsp chopped spring onion (green part only)", "2cm/¾in piece fresh root ginger, peeled, grated", "splash soy sauce", "splash lime juice", "splash chilli oil"], "serves": "Makes 30-40", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the gyoza skins, sift the flour into a large bowl and mix in the salt.", "Stir in the boiling water using a knife or a pair of chopsticks until the mixture comes together as a dough. (You many not need to use all of the water.)", "Roll the dough into a ball, cover with cling film and set aside to rest for one hour.", "Meanwhile, for the chicken or pork filling, mix all of the chicken or pork filling ingredients together in a large mixing bowl until well combined (the ingredients will form a gloopy paste). Season well with salt and freshly ground black pepper. Chill in the fridge until needed.", "For the crab and prawn filling, mix all of the crab and prawn filling ingredients together in a large mixing bowl until well combined (the ingredients will form a gloopy paste). Season well with salt and freshly ground black pepper. Chill in the fridge until needed.", "For the gyoza skin,turn out the dough onto a lightly floured work surface and knead for five minutes until smooth and elastic. (You can use the dough hook attachment of a food processor for this.)", "Cut the dough into three equally sized pieces and roll each into a ball. Roll out one of the balls onto a lightly floured work surface, stretching and turning the dough as you go, until the gyoza dough is as thin as possible.", "Using a 10cm/4in cookie cutter, cut discs from the gyoza dough and stack them on top of each other, dusting the top of each with a little flour before adding the next one. Repeat the rolling and cutting process until all of the dough has been used.", "To assemble the dumplings, hold a gyoza skin in the palm of your hand and add one teaspoon of the filling mixture. Wet the edges with a little water using your fingertip and seal the dumpling, pinching along the edges to create a pleated fan effect (the end result should resemble a mini Cornish pasty). Repeat the process until all of the filling mixture and gyoza skins have been used up, setting each dumpling aside on a plate dusted with flour.", "To cook the dumplings, heat the vegetable oil in a large frying pan with a lid over a high heat. Arrange the gyoza in the pan, in batches if necessary, leaving space between each one, and fry for 2-3 minutes, or until the bottoms are golden-brown. Take care as they will burn quickly.", "Add 100ml/3½fl oz of water to the pan, cover with the lid and steam the dumplings for a further two minutes.", "Give the pan a shake to release the gyoza from the bottom of the pan and continue to cook for a further two minutes with the lid off, until the filling is completely cooked through.", "Meanwhile, for the dipping sauce, mix all of the dipping sauce ingredients together in a small bowl, to taste. Set aside.", "When the gyoza are cooked through, drizzle the sesame oil around the edges of the frying pan and shake the pan.", "Serve the gyoza immediately with the dipping sauce."]}, {"isVegetarian": true, "title": "Tasty treacle tart", "url": "www_bbc_co_uk_food_recipes_tasty_treacle_tart_68276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz mascarpone", "100g/3½oz caster sugar", "pinch salt", "150ml/5½ fl oz milk", "225ml/8fl oz double cream", "½ vanilla pod, seeds scraped", "250g/9oz butter, softened", "100g/3½oz caster sugar", "pinch of salt", "250g/9oz plain flour, plus extra for dusting", "190g/6¾oz bran flakes, blended to a powder", "2 free-range eggs, beaten", "225g/8oz butter", "675g/1lb 8oz golden syrup  ", "190g/6¾oz brioche crumbs", "75ml/2½fl oz double cream", "½ tsp salt", "2 free-range eggs, beaten", "1 large free-range egg yolk", "flaky sea salt, to finish"], "serves": "Makes 1 tart", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, mix all of the ingredients together in a bowl and then churn in your ice cream maker. Place the frozen mixture into a freezer-safe container and store in the freezer until needed.", "To make the pastry, cream together the soft butter and caster sugar. Add a pinch of salt, the plain flour and powdered bran flakes. Stir to combine. Add the beaten eggs and mix together to form a soft sticky dough. Cover with cling film and place into the fridge to rest for at least an hour.", "Preheat the oven to 170C/340F/Gas 3½.", "When the pastry is rested, lightly dust a work surface with flour and roll out the pastry to the thickness of a pound coin.  Line a 23cm/9in loose-bottomed tart case with the pastry, gently pushing it into the edges and leaving any excess overhanging the sides.", "Line the pastry with baking parchment. Fill with ceramic baking beans or uncooked rice and bake for 20-25 minutes. Remove the beans and lining paper, return it to the oven and cook for a further 10 minutes to ensure the pastry is cooked through and dried out. Remove from the oven and set aside to cool. Turn the oven temperature down to 160C/325F/Gas 3.    ", "To make the filling, melt the butter in a saucepan over a medium heat until it foams and turns brown.  Add the syrup, take the pan off the heat and whisk to combine (if the mixture is grainy pass it through a sieve). Put the brioche crumbs in a medium bowl and add the butter and syrup mixture. Whisk in the cream, salt, eggs and egg yolk and leave to cool for 10-15 minutes. Once cooled, pour the filling into the cooled tart case and bake for 25 minutes. Reduce the oven temperature to 140C/275F/Gas 1, and cook for a further 30 minutes, until the tart is just set – it should still have a wobble in the centre. Remove the tart from the oven and leave to cool and set for 30 minutes.", "When ready to serve, sprinkle a little sea salt over the top of the tart, trim the top edges of the tart and release the ring. Cut into slices and serve with the mascarpone ice cream."]}, {"isVegetarian": false, "title": "Tattie scone with bacon and mushrooms", "url": "www_bbc_co_uk_food_recipes_tattiesconewithbacon_88635", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz Worcestershire sauce", "4 plum tomatoes, halved lengthways, seeds and core removed", "75g/3oz butter", "salt and freshly ground black pepper ", "12 rashers streaky bacon", "8 field mushrooms, peeled and thickly sliced", "300g/10oz cooked mashed potatoes, warm", "75g/3oz plain flour", "1 free-range egg yolk", "pinch ground mace", "4 free range eggs", "50ml/2fl oz sunflower oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Pour the Worcestershire sauce into a pan and place over a medium heat. Bring to the boil, then reduce the heat and simmer until reduced by just over a third of its original volume.", "Place the tomatoes onto a baking tray and dot with 25g/1oz of the butter, and season well with salt and freshly ground black pepper. Transfer to the oven to cook for 20-25 minutes.", "Place the bacon onto a clean baking sheet and place in the oven for 5-6 minutes, or until crisp and golden-brown.", "Heat a frying pan until hot, add 25g/1oz of the butter and the mushrooms and fry for 2-3 minutes. Season well with salt and freshly ground black pepper.", "Place the warm mashed potato into a bowl and mix with the remaining butter and the flour to form a soft dough. Season with the ground mace and salt and freshly ground black pepper.", "Roll out the potato dough to 1.5cm/½in thick. Cut out rectangles approx 9.5cm/4in by 6cm/2in wide.", "Heat a griddle pan until very hot. Brush the griddle very lightly with oil and add the potato scones. Cook for about 20-30 seconds on each side, or until golden brown and crisp all over.", "Crack the eggs into a small frying pan and cook over a gentle heat trying to avoid crisp egg white. Cook to your preference.", "To serve, place a tattie scone into the centre of each warmed plate, then place some of the mushrooms on top.", "Place the cooked tomatoes into the same pan as the Worcestershire sauce so that they soak up the flavour, then place them on top of each pile of the mushrooms.", "Place a rasher of cooked, crisp bacon on top, then add a fried egg on top of that.", "Place a second tattie scone on top to form a lid. Pour any excess Worcestershire sauce reduction around the plate and serve."]}, {"isVegetarian": false, "title": "Tea-smoked mackerel with crab apple jelly", "url": "www_bbc_co_uk_food_recipes_tea-smoked_mackerel_with_32050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz crab apples, peeled and halved", "250g/9oz sugar", "water, to cover", "gelatine leaves, soaked", "100g/3½oz white rice", "100g/3½oz demerara sugar", "25g/1oz tea leaves of your choice", "8 mackerel fillets", "salt and freshly ground black pepper", "oil, for greasing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the jelly, put the apples and sugar in a pan and pour in enough water to cover. Bring to a boil and cook until the apples are soft and falling apart.", "Strain the cooked apples through a sieve and pour the strained liquid into a measuring jug. For every 500ml/18fl oz of liquid you will need two leaves of gelatine. Add the gelatine to the liquid while it is still hot, stir to dissolve, strain again then chill the jelly in the fridge.", "For the smoking mixture, mix together the rice, demerara sugar and tea leaves in a bowl. Line a deep pan or wok with aluminium foil, place over a high heat and add the smoking mixture.", "Season the mackerel with salt and freshly ground black pepper. Grease a cooling rack with a little oil and place the mackerel on the rack, skin side down. When the mixture begins to smoke, place the rack on top of the pan or wok and cover with aluminium foil. Turn off the heat and let the mackerel cook slowly as it cools.", "When cooked, place the mackerel fillets onto serving plates and serve with the crab apple jelly."]}, {"isVegetarian": false, "title": "Tea-smoked mackerel with a new potato salad and mustard dressing", "url": "www_bbc_co_uk_food_recipes_tea-smoked_mackerel_with_54880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz new potatoes, halved or quartered, depending on the size", "2 tbsp fresh dill, finely chopped", "1 small bunch watercress", "4 spring onions", "salt and freshly ground black pepper", "2 Earl grey tea bags, leaves reserved, bags discarded", "2 mackerel fillets", "3 tbp olive oil", "1 garlic clove, crushed", "1 tbsp cider vinegar", "1 tsp wholegrain mustard"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the potato salad, put the new potatoes in a saucepan, cover with cold water and season with salt and pepper. Bring to the boil and cook for 15 –20 minutes, or until tender. Drain and allow to cool.", "Meanwhile, set up a smoker with the tea leaves and wood chips placed in the bottom. (CAUTION: Tea-smoking generates a lot of smoke. Cook in a well-ventilated area, and open the wok outside if possible.). Put the mackerel fillets on top, cover with the lid and smoke for 2–3 minutes.", "In a large bowl, mix together the dill, watercress, spring onions and the cooled potatoes. ", "To make the dressing, whisk together ingredients in a small bowl.", "Pour the dressing over the potato salad and mix well. Break up the fish fillets and stir through the salad. Serve. "]}, {"isVegetarian": false, "title": "Tea-time mackerel", "url": "www_bbc_co_uk_food_recipes_tea-time_mackerel_16856", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea-time_mackerel_16856_16x9.jpg", "ingredients": ["4 thickish slices bread", "2 smoked mackerel fillets", "5 tbsp double cream ", "60g/2¼oz parmesan ", "freshly ground black pepper", "1 tbsp chopped chives", "fresh horseradish, to taste"], "serves": "Makes 4 toasts", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Have four slices of your favourite bread ready toasting under the grill.", "Peel the skin off the mackerel and flake into a bowl. Add four tablespoons of double cream, grate in 50g/2oz of parmesan, add a pinch of black pepper and mix with a fork. Add a spoonful of chopped chives and some grated horseradish, and mix again.", "Pile the mixture onto the toast. Add a final drizzle of cream and a scattering of grated parmesan and put them under the grill for 3-4 minutes. Serve when they start to bubble and brown."]}, {"isVegetarian": false, "title": "Tasty fish bake", "url": "www_bbc_co_uk_food_recipes_tastyfishbake_73312", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz potatoes, scrubbed and finely sliced ", "4 tbsp olive oil ", "1 clove of garlic, peeled and chopped ", "1 onion, peeled and sliced ", "1 bulb of fennel, trimmed and sliced ", "1 tsp fennel seeds ", "4 medium or 8 small fillets of trout, pinboned ", "285ml/½ pint single cream ", "2 handfuls of freshly grated parmesan cheese, plus extra for sprinkling ", "2 anchovy fillets ", "sea salt and freshly ground black pepper ", "2 handfuls of fresh breadcrumbs ", "2 lemons, halved"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Parboil the sliced potatoes in salted boiling water for a few minutes until softened, then drain in a colander. ", "Place a 20cm/8in casserole-style pan on a low heat, and add the oil, garlic, onion, fennel and fennel seeds. Cook slowly for 10 minutes with the lid on, stirring every so often. ", "Take the pan off the heat. Lay the trout fillets skin-side up over the onion and fennel. ", "Mix together the cream, parmesan and anchovies, season with salt and freshly ground black pepper, and pour over the fish. Toss the potato slices in a little olive oil, season with salt and pepper and layer these over the top. ", "Place in the oven for 20 minutes, sprinkling with the breadcrumbs and a little grated parmesan five minutes before the end. Serve with lemon halves, a green salad and cold beers!"]}, {"isVegetarian": false, "title": "Tea sandwiches", "url": "www_bbc_co_uk_food_recipes_tea_sandwiches_59195", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea_sandwiches_59195_16x9.jpg", "ingredients": ["½ lemon, juice only", "1 apple, core removed, chopped into small pieces", "¼ cucumber, finely sliced", "200g/7oz cream cheese", "½ bunch mint, chopped", "¼ bunch flatleaf parsley, chopped", "1 thin baguette, halved horizontally and lightly buttered", "150g/5½oz cream cheese", "½ red onion, finely chopped", "1 tbsp capers, drained, finely chopped", "8 slices wholemeal bread, lightly buttered", "8 slices smoked salmon", "4 free-range eggs, hard-boiled, peeled, chopped", "3-4 tbsp mayonnaise", "1 tbsp capers, drained, finely chopped", "salt and freshly ground black pepper", "8 slices bread, lightly buttered", "small punnet cress"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple and cucumber sandwiches, mix the apple with the lemon juice. ", "Spoon the cream cheese into a bowl and stir in the herbs. Add the apple pieces and a little of the lemon juice.", "Arrange the cucumber slices along the bottom half of the baguette, slightly overlapping each slice. Spoon in the cream cheese and apple mixture and add the top half of the baguette.  Slice into 5cm/2in sandwiches. ", "For the smoked salmon, caper and cream cheese sandwiches, mix the cream cheese, red onion and capers together in a bowl. ", "Spread this mixture onto four slices of the bread.  Top with the smoked salmon and close the sandwiches with the remaining slices of bread. ", "Remove the crusts and cut the sandwiches into quarters.", "For the egg and caper mayonnaise sandwiches, mix the eggs, mayonnaise and capers together in a bowl. Season, to taste with salt and freshly ground black pepper.", "Spread the egg mayonnaise onto four slices of the bread. Sprinkle over the cress and close the sandwiches with the remaining slices of bread. ", "Remove the crusts and cut the sandwiches into fingers."]}, {"isVegetarian": true, "title": "Tea loaf", "url": "www_bbc_co_uk_food_recipes_tea_loaf_75867", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea_loaf_75867_16x9.jpg", "ingredients": ["400g/14oz strong bread flour, plus extra for dusting", "1½ tsp salt", "40g/1½oz caster sugar", "40g/1½oz butter, softened, plus extra for greasing", "10g/¼oz fast-action dried yeast", "120ml/4fl oz milk", "50g/1¾oz sultanas", "60g/2¼oz glacé cherries", "1 tsp ground cinnamon", "3 oranges, zest only", "200g/7oz icing sugar", "butter, to taste"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, salt, sugar, butter, yeast, milk and 120ml/4fl oz of water into a bowl and mix together with your hands.", "When all the flour has been incorporated, tip the dough onto a lightly floured work surface and knead until smooth and pliable.", "Return the dough to the bowl, cover with cling film and set aside to rest for an hour.", "Add the sultanas, cherries, cinnamon and orange zest to the dough and, using an electric mixer or your hands, work it in well.", "Shape the dough into a sausage shape by flattening out the dough and rolling it up.", "Put the dough on a greased baking tray. Slide the baking tray inside a plastic bag, to protect the dough from drafts, taking care not to allow the plastic bag to touch the top of the loaf. Leave to rise for an hour.", "Preheat the oven to 220C/425F/Gas 7.", "Bake the dough for 25-30 minutes, then transfer to a wire rack to cool.", "While the loaf is cooling, make the water icing. Tip the icing sugar into a bowl, add a little water and mix well to form a paste. Gradually add more water until the icing is just thick enough to coat the back of a spoon.", "Drizzle or spread the icing over the top of the tea loaf. Cut into slices and eat with lashings of butter."]}, {"isVegetarian": true, "title": "Classic scones", "url": "www_bbc_co_uk_food_recipes_tea_time_scones_77839", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tea_time_scones_77839_16x9.jpg", "ingredients": ["450g/1lb self-raising flour", "2 level tsp baking powder", "50g/1¾oz caster sugar", "100g/3½oz butter, softened, cut into pieces", "2 free-range eggs", "a little milk", "handful sultanas (optional)", "strawberry jam", "clotted cream"], "serves": "Makes 16 small scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Lightly grease two baking trays.", "Put the flour, baking powder and sugar in a large bowl. Add the butter and rub in with your fingertips until the mixture resembles fine breadcrumbs.", "Crack the eggs into a measuring jug, then add enough milk to make the total liquid 300ml/10fl oz. Stir the egg and milk into the flour – you may not need it all – and mix to a soft, sticky dough. ", "Turn out onto a lightly floured work surface, knead lightly and work in the sultanas, if using. Roll out to a rectangle about 2cm/¾in thick. ", "Cut into as many rounds as possible with a fluted 5cm/2in cutter and place them on the prepared baking trays. Brush the tops of the scones with a little extra milk, or any egg and milk left in the jug.", "Bake for 12–15 minutes, or until the scones are well risen and a pale, golden-brown colour. Lift onto a wire rack to cool. Eat as fresh as possible.", "To serve, split the scones and serve with strawberry jam on the plain scones along with a good dollop of clotted cream."]}, {"isVegetarian": false, "title": "T-bone steak with roasted tomato butter, wilted spinach and fat chips", "url": "www_bbc_co_uk_food_recipes_tbonesteakwithroaste_89101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tomatoes, halved and de-seeded", "3 sprigs thyme, leaves only", "2 tbsp olive oil", "250g/9oz butter, softened", "salt and freshly ground black pepper", "4 T-bone steaks", "salt and freshly ground black pepper", "1 tbsp olive oil", "25g/1oz butter", "3 large baking potatoes, peeled and cut into 1.5cm/½in thick chips", "vegetable oil, for deep frying", "1 tbsp olive oil", "25g/1oz butter", "250g/9oz baby spinach leaves", "salt and freshly ground black pepper", "pinch freshly grated nutmeg, to taste"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "For the roasted tomato butter, place the tomatoes on a baking sheet, cut-side up, and season with salt and freshly ground black pepper. Sprinkle over the thyme leaves and drizzle with the olive oil.", "Place in the oven and roast for 20 minutes. Turn the oven off and leave the tomatoes in the oven for 4-5 hours, or overnight, until semi-dried but still soft.", "Place the butter into a food processor and blend to soften. Add the roasted tomatoes and pulse until combined. Check the seasoning and add more salt and freshly ground black pepper, if necessary.", "Spoon the tomato butter along a piece of cling film. Wrap the cling film around the butter and roll up tightly to form a sausage shape, twisting at both ends to seal. Place in the fridge for at least an hour, until chilled and firm.", "For the steaks, season the steaks with salt and freshly ground black pepper. Heat a large frying pan until hot, add the oil, butter and the steaks.", "Fry the steaks for  4-5 minutes on both sides, depending on the thickness of the steaks, or until cooked to your liking. Remove from the pan and leave to rest on a warm plate for 5-10 minutes.", "Meanwhile, for the chips, heat a deep fat fryer to 150C. Cook the chips in batches for 2-3 minutes, until softened but not coloured. Remove with a slotted spoon and drain on kitchen paper.", "Increase the temperature of the deep fat fryer to 190C. Return the chips to the fryer, in batches, and cook until golden-brown and cooked through. Remove with a slotted spoon, drain on kitchen paper and season generously with salt and freshly ground black pepper.", "For the spinach, heat a frying pan until hot. Add the butter, oil and spinach and cook until the spinach has wilted. Season, to taste, with salt, freshly ground black pepper and freshly grated nutmeg.", "To serve, divide the chips between each of four serving plates. Spoon the spinach alongside and top with a steak. Unwrap the tomato butter and cut into thick slices. Place a slice on top of each steak and serve immediately."]}, {"isVegetarian": false, "title": "Tear and share Christmas Chelsea buns", "url": "www_bbc_co_uk_food_recipes_tear_and_share_christmas_58564", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tear_and_share_christmas_58564_16x9.jpg", "ingredients": ["800g/1lb 12oz strong white flour, plus extra for dusting", "1 tbsp salt", "15g sachet fast-acting yeast", "400ml/14fl oz milk", "60g/2¼oz unsalted butter, plus extra for greasing ", "2 free-range eggs", "1 x 411g jar mincemeat", "1 apple, cored and finely chopped", "1 pear, cored and finely chopped", "1 orange, finely grated zest only", "75g/2½oz shelled pistachio nuts, chopped", "100g/3½oz candied peel", "1 tbsp ground cinnamon", "25g/1oz unsalted butter, melted", "3 tbsp apricot jam", "200g/7oz icing sugar, sifted", "1 orange, finely grated zest only", "15 glacé cherries", "40g/1½oz candied peel", "25g/1oz pistachio nibs, chopped"], "serves": "Serves 15", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour into a large mixing bowl, add the salt to one side and the yeast to the other side. ", "Warm the milk and butter in a small saucepan until the butter is melted and the mixture is lukewarm. Pour into the flour mixture, add the eggs and stir thoroughly until the contents of the bowl come together as a soft dough (the dough will be sticky).", "Tip the dough out onto a lightly floured work surface and knead well for 5 minutes, or until the dough is smooth and elastic. Alternatively this can be done in a freestanding mixer using a dough hook.", "Place the dough in an oiled bowl and leave to rise, covered with a damp tea towel, for 1 hour or until doubled in size. This is best done in a warm room.", "For the filling, mix the mincemeat with the apple, pear, orange zest, pistachio nuts, candied peel and cinnamon.", "When risen, tip the dough out onto a lightly floured work surface. Roll out into a rectangle about 50x45cm/20x18in. Tack down the long side of the dough rectangle nearest to you by pressing it down onto the work surface with your thumb. Brush all over with the melted butter. Then spread the mincemeat mixture over the dough leaving a 2cm/¾in border.", "Roll the opposite long side of the dough towards you quite tightly, until the roll is complete and tight. Trim the ends to neaten. Using a sharp knife, cut it into 15 rounds about 4cm/1½in thick. ", "Line a very large baking tray (or use the grill tray from your oven) with baking parchment. Arrange the rolls on the prepared tray, cut side up, in a Christmas tree shape, with 1 on top, 2 underneath, 3 in the third row, 4 in the fourth row, 5 in the fifth row. Use some of the trimmings to make a trunk. You want them to be close enough so that their sides will touch when the dough has risen. They can then be pulled apart and you get a lovely soft edge.", "Cover loosely with a clean tea towel and let the dough rise for 30-45 minutes. ", "Preheat oven to 190C/170C Fan/Gas 5. ", "When the buns have risen, put them in the oven and bake for 20-25 minutes or until golden-brown. Check after 15 minutes or so and cover the buns with foil if they are browning too quickly.", "Remove the buns from the oven and let them cool slightly before transferring them to a cooling rack. ", "To finish, melt the jam in a small saucepan with a splash of water until smooth. Brush the jam over the buns to glaze and allow to cool completely.", "Mix the icing sugar, orange zest and 2 tablespoons water together. Transfer to a disposable piping bag and snip off a tiny tip. Pipe garlands on the buns to resemble a decorated Christmas tree. Garnish with glacé cherries, candied peel and chopped pistachio nibs. "]}, {"isVegetarian": false, "title": "Tempura scallops and asparagus with ponzu dressing", "url": "www_bbc_co_uk_food_recipes_tempura_scallops_and_24441", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tempura_scallops_and_24441_16x9.jpg", "ingredients": ["100ml/3½fl oz mirin (rice wine)", "75ml/2½fl oz dark soy sauce", "1 tbsp rice vinegar", "1 x 13cm/5in strip kombu (dried seaweed)", "2 tbsp ponzu (Japanese citrus-based sauce), if non-available use fresh lemon juice, plus 1-2 tsp extra to taste", "lemon wedges, for garnish", "1 spring onion (green part only), finely sliced", "pinch dried chilli flakes (optional)", "240g/9oz bundle asparagus spears, trimmed", "200-250g/7-9oz roe-less queen scallops (or 18 medium roe-less scallops), thawed if frozen", "sunflower oil, for deep frying (roughly 1 litre/1¾ pints)", "100g/3½oz cornflour", "100g/3½oz self-raising flour", "1 tbsp sesame seeds", "1 large free-range egg, yolk only", "200ml/7fl oz chilled sparkling water"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the ponzu dressing, pour the mirin, soy sauce, vinegar and kombu into a small saucepan and bring to a simmer. Cook for three minutes, or until reduced by almost half, stirring occasionally. ", "Remove the pan from the heat and leave to cool. When the liquid has cooled, remove the kombu and stir in the ponzu or lemon juice. (Add a little extra lemon juice if necessary just before serving – you want the dressing to taste very zingy.) Pour into individual dipping bowls and place on serving plates with slender lemon wedges. (Alternatively, put in a small bowl and place on a serving platter.) Add the spring onion and dried flaked chilli (if you like – not strictly authentic but a nice touch).", "Fill a large saucepan with enough water to go a third of the way up the sides. Bring to the boil over a high heat. Add the asparagus spears, cutting any particularly long or thick spears diagonally in half first. Return to the boil and cook for 1½ minutes, or until just tender. Drain in a colander under running water until cold. Pat dry with kitchen paper and set aside.", "Pat the scallops dry on kitchen paper. Pour 4cm/1½in of oil into a large, wide-based saucepan. Place over a medium heat and heat to 180C/350F using a cooking thermometer to check the temperature at all times. Alternatively, use an electric deep-fat fryer (CAUTION: Do not allow oil to overheat. Do not leave hot oil unattended.)", "To make the batter, put the cornflour, self-raising flour and sesame seeds into a large bowl and mix until thoroughly combined. Make a well in the centre. Whisk the egg yolk with half of the water in a separate bowl and gradually add to the flour mixture, using a whisk to draw the dry ingredients into the liquid. When the batter is thick, slowly whisk in the remaining liquid until the batter is just mixed. Don’t over-whisk or make the batter too smooth.", "If using medium or king scallops, cut in half horizontally through the middle. Leave small queen scallops whole. Drop 10-12 of the scallops or scallop pieces into the batter and turn until lightly coated. ", "Working quickly, take one at a time with tongs or a couple of forks and drop gently into the hot oil. Keep the bowl close to your saucepan or fryer as the batter is thin and will drip off quite quickly. Drop the scallops into different areas of the pan so that they don’t get a chance to stick together.", "Once all the battered scallop pieces are in the oil, fry for 2–2 ½ minutes, or until pale golden-brown and very crisp. Keep an eye on the temperature of the oil so that it doesn’t overheat or cool too far. Use a heatproof slotted spoon to scoop up any bits of the batter that separate from the scallops and to nudge any scallops that stick to the bottom of the pan. They should all float as they fry.", "Remove the tempura scallops with the slotted spoon and drain on kitchen paper. Continue frying the remaining scallops in batches as above until they are all cooked. Add the asparagus to the batter, in batches if necessary, and cook as above for 1½-2 minutes, or until crisp. Drain on kitchen paper.", "Arrange the scallops and asparagus on the serving plates with the ponzu dressing and lemon wedges for garnish. Serve immediately. "]}]