[{"isVegetarian": false, "title": "Frittata with roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_frittatawithroastedt_85847", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp chopped fresh coriander", "150g/5¼oz canned chickpeas, rinsed and drained", "75g/2½oz hot-smoked salmon", "1 garlic clove, chopped", "4 free-range eggs, beaten", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 fresh tomatoes, halved", "salt and freshly ground black pepper", "1 tbsp olive oil", "50ml/2floz white wine vinegar", "1 tsp caster sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. For the frittata, mix all the frittata ingredients, except the olive oil, together in a mixing bowl and season with salt and freshly ground black pepper. ", "Heat the one tabespoon of olive oil in a frying pan and add the frittata mixture. Cook for two minutes, or until the mixture turns golden brown underneath..", "Heat another frying pan, greased with the remaining olive oil, of the same size and place the hot pan to face the other on top.", "Flip the frittata from one pan to the other so the coloured side faces upwards. Cook for another two minutes, or until golden and cooked through.", "For the roasted tomatoes, place the halved fresh tomatoes to a baking tray and season with salt and freshly ground black pepper.", "Drizzle over the olive oil and white wine vinegar and sprinkle the sugar over the tomatoes.", "Place into the oven and bake for five minutes.", "Serve the frittata on a plate with the roasted tomatoes placed on top."]}, {"isVegetarian": true, "title": "Frittata with rustic rocket pesto", "url": "www_bbc_co_uk_food_recipes_frittatawithrusticro_85276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz Anya potatoes, thinly sliced lengthways", "½ onion, peeled, finely sliced", "½ leek, finely sliced", "2 baby carrots, sliced", "4 free-range egg yolks", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "large handful rocket, finely chopped", "1 garlic clove, finely chopped", "1 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the frittata, heat the olive oil in a frying pan, add the potatoes and fry for 3-4 minutes. Add the onion, leek and carrot and fry for 3-4 minutes or until cooked but still firm.", "Whisk the egg yolks with the double cream and season with salt and freshly ground black pepper. Pour over the vegetables in the frying pan and cook until the base is set. Flip and cook on the other side for 2-3 minutes or until golden-brown. Slide onto a plate and cut into wedges.", "For the rocket pesto, mix together the rocket, garlic, olive oil and seasoning in a small bowl. Pour the pesto over the wedges of frittata. Serve."]}, {"isVegetarian": true, "title": "Fritters with chilli and spring onion jam", "url": "www_bbc_co_uk_food_recipes_fritterswithchillian_84473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour", "1 tbsp bicarbonate of soda", "1 tbsp chilli flakes", "sparkling water", "1 tbsp oil", "30g/1oz caster sugar", "2 tbsp water", "½ tsp chilli flakes", "3 spring onions, finely sliced", "1 tbsp white wine vinegar", "1 tbsp ground coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritters, place the dry ingredients into a bowl and mix together. Add enough sparkling water to make a thick pancake batter.", "Heat the oil in a frying pan over a high heat, drop spoonfuls of the fritter mixture into the pan and cook for 1-2 minutes on each side, until golden.", "For the jam, melt the sugar in a small pan with the water and chilli, over a medium heat and cook until golden.", "Add the spring onions, vinegar and coriander and simmer for two minutes.", "To serve, place the fritters on to a serving plate, and place the chilli jam on the side."]}, {"isVegetarian": true, "title": "Fritto misto di verdure", "url": "www_bbc_co_uk_food_recipes_fritto_misto_di_verdure_14523", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, juice only", "3 violet artichokes with long stems", "1 large aubergine, thinly sliced", "1 bunch of asparagus, woody ends removed", "2 sweet onions (such as scallions), thinly sliced", "2 portobello mushrooms, cut into 1cm/½in slices", "6 small courgettes with their flowers attached, sliced", "sunflower oil, for deep-frying", "4 small Swiss chard leaves", "6 large sage leaves", "sea salt and freshly ground black pepper", " 300g/10½oz tipo ‘00’ flour", "4 tbsp extra virgin olive oil", "250ml/9fl oz warm water", "1 free-range egg white", "1 red chilli, seeds removed and chopped", "2 tbsp chopped fresh mint", "2-4 tbsp sherry vinegar", "1 lemon, zest and juice only", "lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a large bowl with water and add the lemon juice. Prepare the artichokes one at a time. Remove the tough outer leaves to reveal the pale inner heart. Open the heart and, using a teaspoon, scoop out the hairy choke. Peel the stem to remove the tough outside, leaving just the tender core. Chop the artichoke heart vertically in half, then cut the heart and stem into slices. Immediately immerse the artichoke in the lemon water to prevent it from turning brown.", "For the batter, put the flour in a large mixing bowl and make a well in the middle. Pour the oil into the well, then mix it with the flour while slowly adding the warm water. Mix until the batter is smooth with the consistency of double cream.", "Put a deep, heavy-based pan containing the sunflower oil on the heat until the oil is 180C, or alternatively use a deep-fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Preheat the oven to its lowest setting.", "Drain the artichokes and pat dry using kitchen paper. ", "In a separate, clean glass bowl, whisk the egg white to soft peaks. Carefully fold it into the batter.", "Fry the vegetables in batches, each type separately (cook the chard and sage leaves together). To do this, dip the vegetables into the batter and shake off any excess, then deep-fry them in the hot oil for 3–4 minutes, or until crisp and golden-brown all over. Drain on kitchen paper and keep warm in the oven while you cook the next batch. ", "Mix all the dressing ingredients together in a small bowl.", "To serve, season the deep-fried vegetables with salt and pepper, drizzle the dressing over the top and serve with lemon wedges."]}, {"isVegetarian": false, "title": "Festive berry delice", "url": "www_bbc_co_uk_food_recipes_frozen_berry_delice_42196", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frozen_berry_delice_42196_16x9.jpg", "ingredients": ["200g/7oz frozen blackcurrants", "100g/3½oz frozen blackberries", "75g/2½oz caster sugar", "2 tbsp crème de cassis", "3 gelatine leaves, soaked in cold water until softened, then drained", "500g/1lb 2oz frozen mixed berries", "3 tbsp crème de cassis", "4 gelatine leaves, soaked in cold water until softened, then drained", "150g/5½oz caster sugar", "2 free-range egg whites", "300ml/10½fl oz double cream", "23cm/9in ready-made sponge flan case", "2 ripe figs, cut into quarters", "small handful fresh raspberries", "small handful fresh mint sprigs"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the jelly, heat the blackcurrants, blackberries, sugar, 50ml/2fl oz water and crème de cassis in a pan until boiling. Reduce the heat until simmering, then simmer for 1-2 minutes without stirring. ", "Strain the mixture through a sieve lined with muslin, catching the strained juice in a clean pan. Tip the cooked fruit back into the original saucepan.", "Heat the strained juice over a medium heat, then stir in the gelatine until melted. Set aside to cool.", "For the blackcurrant mousse, add the frozen mixed berries to the pan of cooked berries, pour over 50ml/2fl oz water and bring the mixture to the boil. Cook for 2-3 minutes, mashing the fruit in the pan as it cooks. Stir in 2 tablespoons of the cassis.", "Transfer the mixture to a food processor and blend to a fine purée. Strain the purée through a fine sieve into a clean saucepan, pressing the fruit through the sieve using the back of a spoon. ", "Return the strained mixture to the heat and stir in the gelatine until dissolved. Set aside until completely cooled, then chill in the fridge, covered, until needed. ", "Heat the sugar and 50ml/2fl oz water in a pan until the sugar has dissolved and the mixture is boiling. Continue to boil the syrup until its temperature reaches 118C/235F (this is called the soft ball stage). Use a sugar thermometer to test the temperature.", "Whisk the egg whites until soft peaks form when the whisk is removed. Gradually pour the hot sugar syrup onto the egg whites in a thin but steady stream, whisking continuously, until all of the syrup has been incorporated (take care to make sure the syrup doesn't hit the beaters as it may splash you). Continue to whisk for a further 1-2 minutes, to cool the mixture slightly. ", "In a separate bowl, whisk the double cream until soft peaks form when the whisk is removed.", "Whisk the fruit purée into the egg white mixture, then whisk in the double cream.", "Use a 20-22cm/8-8½in metal chefs’ ring to cut out the centre of the flan case. Cut the sponge in half horizontally to create two thinner sponge discs. Reserve or freeze one for use in another recipe.", "Place the chefs’ ring onto a serving plate or cake stand and place one sponge disc inside it. Drizzle over the remaining cassis, then pour the blackcurrant mousse mixture inside, almost but not quite to the top. Chill in the fridge for at least 1 hour, or until the mousse has set enough to support a layer of jelly. ", "Pour the jelly on top of the cake to form a thin layer. Return to the fridge for another 2 hours until set firm.", "Decorate the top of the cake with the figs, raspberries and sprigs of mint. When ready to serve, run a hot towel or blow torch briefly around the edge of the chefs’ ring to loosen it, then lift away."]}, {"isVegetarian": true, "title": "Frozen berry soufflé", "url": "www_bbc_co_uk_food_recipes_frozen_berry_souffl_73644", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz mixed berries (e.g strawberries, raspberries, blueberries, blackcurrants), hulled, plus extra to decorate", "400g/14oz caster sugar", "1 lemon, juice only", "4 free-range egg whites", "80ml/3fl oz whipping cream"], "serves": "Makes 10", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Blend the berries with 150g/5½oz of the sugar in a blender, then pass through a fine sieve and add lemon juice to taste.", "Prepare 10 x 9x6cm/3½x2⅓in individual soufflé dishes by tying a piece of greaseproof paper around the edges to form a collar that stands 5cm/2in above the rim.", "Dissolve the remaining 250g/9oz of sugar in 250ml/9fl oz of water in a saucepan over a low heat. When the sugar has completely dissolved, bring to the boil, skim off the foam and cook to 120C, testing with a sugar thermometer. ", "Whisk the egg whites until foamy in a stand mixer, then pour the hot sugar directly onto the whites while whisking, avoiding the beaters. Continue beating until the meringue is cool.", "Whip the cream until soft peaks form. Fold it into the meringue along with the berry purée. Spoon into the prepared soufflé dishes. Cover and freeze for 12 hours.", "Remove the collars and decorate with fresh berries to serve. "]}, {"isVegetarian": true, "title": "Frozen chocolate chip cookies", "url": "www_bbc_co_uk_food_recipes_frozen_chocolate_chip_95194", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frozen_chocolate_chip_95194_16x9.jpg", "ingredients": ["275g/9¾oz unsalted butter, softened", "275g/9¾oz soft light brown sugar", "225g/8oz granulated sugar", "2 large free-range eggs", "1 tbsp vanilla extract", "475g/1lb 1oz plain flour", "2 tsp baking powder", "300g/10½oz good-quality milk chocolate, chopped roughly into chunks", "sea salt"], "serves": "Makes 18 very large cookies", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the butter and sugars into a large mixing bowl. Beat together with an electric hand whisk until smooth and light in colour. ", "Break in the eggs one at a time, mixing as you break in each egg. Once the eggs are combined, add the vanilla extract.", "Sift in the flour and baking powder and mix in with a wooden spoon until completely incorporated. Add the chocolate chunks and mix in until thoroughly combined. Divide the dough in half. ", "Place each half onto a large sheet of cling film. Roll the dough into a wide sausage shape and wrap in the cling film, twisting the ends to seal. Each sausage will make nine large cookies (but you can roll them smaller and make more). The dough sausages can be frozen at this point. However if you wish to bake them straightaway, chill the dough in the fridge for 30 minutes before use.", "Once ready to use the cookie dough, remove from the freezer and allow to warm up enough to slice. Preheat the oven to 180C/350F/Gas 4.", "Slice the dough sausage into nine discs and place onto a non-stick baking tray or a tray that has been lined with baking parchment. ", "Sprinkle each cookie with a tiny pinch of salt and bake in the preheated oven for 20 minutes, or until they are golden-brown on the edge and slightly paler in the centre.", "Remove from the oven and transfer to a wire rack to cool before serving."]}, {"isVegetarian": true, "title": "Frozen pea ice cream with bananas and mint", "url": "www_bbc_co_uk_food_recipes_frozen_pea_ice_cream_30393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 frozen sliced bananas", "1 handful fresh mint", "250g/9oz frozen peas", "½ lime, juice only", "2 tbsp agave syrup", "5 drops liquorice essence, or a pinch of liquorice powder"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix all the ingredients in a food processor until smooth. ", "Serve immediately in glasses or bowls."]}, {"isVegetarian": true, "title": "Frozen elderflower posset", "url": "www_bbc_co_uk_food_recipes_frozen_elderflower_07251", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frozen_elderflower_07251_16x9.jpg", "ingredients": ["150ml/¼ pint pouring double cream", "150ml/¼ pint elderflower cordial", "summer berries, to serve", "a dusting of icing sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the cream in a mixing bowl and whip until it forms soft peaks, then gradually pour in the elderflower cordial, whisking until combined.", "Freeze in a plastic tub until completely frozen. Scoop into a food processor and blend to remove any ice crystals", "Transfer to pretty little dessert glasses or Martini glasses for at least three hours or overnight in the freezer.", "To serve, place in the fridge for 15-20 minutes to soften slightly, then serve each glass with a few summer berries and decorate with a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Frozen strawberry tartlets with vanilla whipped cream and meringue", "url": "www_bbc_co_uk_food_recipes_frozen_strawberry_60846", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/14oz strawberries (my favourites are Buddy, Gariguette, Royal Sovereign or Mara des Bois), stalks removed ", "1 tsp stevia powder ", "dash of lemon juice", "200g/7oz strawberries (Buddy, Gariguette, Royal Sovereign or Mara des Bois), cut into small dice ", "large pinch of stevia powder ", "100g/3½oz whipping cream ", "large pinch of stevia powder ", "½ tsp vanilla purée or good-quality vanilla extract ", "50g/1¾oz miniature meringues, crush 4–6 of them ", "100g/3½oz low-sugar strawberry jam ", "4 mint sprigs ", "6 strawberries, halved"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Take four 7.5cm/3in pastry rings and tightly stretch cling film over the top of each one, then turn them upside down; these will become the frames for the tarts. Line a tray with greaseproof paper, place the pastry rings on the tray with the cling film on the bottom, line the insides with the acetate plastic and transfer to the freezer. ", "For the sorbet, in a large bowl macerate the strawberries with the stevia and lemon juice for 30 minutes. Macerating the strawberries will give the sorbet much more flavour. ", "Blend the strawberries to a purée. Set aside 150g/5oz of the purée and pour the remainder into a squeezy plastic bottle. Squeeze the purée into the bottom of each frozen pastry ring until you have 5mm layer covering the bottom. Return the tray to the freezer and freeze for 30 minutes, or until frozen solid. ", "Remove from the freezer and place a 6cm/2½in pastry ring centrally on top of each circle of frozen purée. Gently press it down so that it just indents the base. Squeeze more purée into the gap between the two rings, to create a wall 2cm/¾in high.", "Place back in the freezer and leave to freeze for at least 2 hours, or until solid. (The steps up to this stage can be done a few days in advance.) Place 4 serving plates in the freezer 1 hour prior to serving. ", "For the tart filling, in a bowl macerate the strawberries with the stevia for 30 minutes. ", "Meanwhile, make the crème Chantilly by whipping the cream with the stevia and vanilla purée or extract, until firm peaks form when the whisk is removed. (Beware, if you over-whip the cream, it will separate and you will create butter!)", "Mix 100g/3½oz of the reserved purée with the macerated strawberries. Fold half the macerated strawberries through the Chantilly cream. Reserve the other half for decorating. ", "Take one sorbet out of the freezer. Remove the inner pastry ring by rubbing your fingers around the inside to soften the sorbet behind it slightly and enable you to gently lift off the ring. Now lift off the outer pastry ring and gently peel away the acetate surrounding the sorbet. Return each sorbet case to a baking tray in the freezer as you repeat this process for the remaining sorbets. ", "When ready to serve, remove the plates from the freezer and place a small amount of the crushed meringue in the centre of each plate to stop the tarts from sliding around, then cover with a frozen sorbet case. ", "Place a spoonful of the jam in the bottom of each sorbet case, followed by the strawberry and Chantilly cream mix. Finish each tart with a spoonful of the reserved macerated strawberries, followed by a few whole meringues and mint leaves. Drizzle the remaining reserved purée around each tart, place a few halved strawberries on the plates and serve immediately."]}, {"isVegetarian": true, "title": "Frozen cherry margarita", "url": "www_bbc_co_uk_food_recipes_frozencherrymargarit_72296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz caster sugar", "175g/6¼oz cherries, stemmed and stoned", "4 tbsp lime juice", "150ml/5¼fl oz tequila", "3 tbsp cherry liqueur or Cointreau", "275ml/10fl oz ice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the sugar with three tablespoons of water and heat on a low heat until the sugar dissolves. ", "Remove from the heat and allow to cool.  ", "Once cool, place the sugar in a blender with the cherries, lime juice, tequila, cherry liqueur or Cointreau, and the ice.", "Blend until smooth, and serve in martini glasses with a sugared rim."]}, {"isVegetarian": true, "title": "Frozen mango and lime shots", "url": "www_bbc_co_uk_food_recipes_frozenmangoandlimesh_85670", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 mango, peeled, stone removed and chopped", "1 lime, zest and juice", "2 oranges, juice only", "3-4 ice cubes", "fresh mint leaves and lime wedges, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mango, lime zest and juice, orange juice and ice into a food processor and blend until smooth.", "To serve, pour into four shot glasses and garnish each with mint leaves and lime wedges."]}, {"isVegetarian": true, "title": "Fruit and cobnut crumble cream", "url": "www_bbc_co_uk_food_recipes_fruit_and_cobnut_crumble_92561", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruit_and_cobnut_crumble_92561_16x9.jpg", "ingredients": ["4 small pears, peeled and cut into 2cm/¾in dice", "2 tbsp lemon juice", "4½ tbsp caster sugar", "2 medium cooking apples, preferably Bramley variety, peeled and cut into 2cm/¾in dice", "16 blackberries", "40g/1½oz wholemeal flour", "40g/1½oz plain flour", "50g/1¾oz unsalted butter, chilled and cut into 2cm/¾in cubes", "25g/1oz soft brown sugar", "pinch of salt", "100g/3½oz dried cobnuts or hazelnuts", "150ml/5fl oz double cream", "100ml/3½fl oz Greek yoghurt", "100ml/3½fl oz mascarpone", "1 tbsp caster sugar", "½ tsp vanilla essence", "½ tsp ground cardamom", "½ tsp ground star anise"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Mix the pears, lemon juice and 1½ tablespoons of the caster sugar in a bowl. Spread the pears out on the baking tray, cover with aluminium foil and place in the oven. After 10 minutes, add the apples, cover with the foil again and return to the oven for 30 minutes. Crush the fruit with a fork, set aside to cool then fold in the blackberries.", "To make the crumble, place both the flours in a mixing bowl with the butter and brown sugar and rub together with your fingertips until the mixture resembles breadcrumbs. Spread out on a baking tray lined with greaseproof paper and place in the oven for 15 minutes. Remove the tray from the oven and set aside to cool.", "Add the remaining three tablespoons of caster sugar and the nuts to a non-stick saucepan and cook over a gentle heat for 5-6 minutes, swirling the pan regularly, until the sugar has melted and coated the nuts evenly and the mixture is golden-brown. Tip the mixture onto a baking tray lined with greaseproof paper and set aside to cool. Once cooled, crush the nuts into a coarse powder.", "For the cream, place all the ingredients in a large mixing bowl and whisk to soft peaks, taking care not to over-whisk.", "To assemble, spoon two thirds of the crumble into the bottom of the serving glasses. Cover with two thirds of each of the fruit mixture, cream and nuts. Add the remaining crumble followed by the remaining third of the fruit and cream. Scatter over the remaining nuts and serve at once, or chill for a few hours. If you are serving the dish chilled, scatter over the nuts at the last minute."]}, {"isVegetarian": true, "title": "Fruit and fudge buns", "url": "www_bbc_co_uk_food_recipes_fruit_and_fudge_buns_26812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "150g/5oz strong white bread flour, plus extra for dusting", "1 tsp caster sugar", "1 tsp mixed spice", "3 tbsp mixed dried fruit", "2 tbsp chopped fudge", "1 tsp dried-action instant yeast", "125ml/4fl oz milk, at room temperature ", "seedless grapes, to serve (optional)"], "serves": "Makes 6 buns", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Grease the holes in a six-hole mini-muffin tray with butter.", "In a bowl, mix together the flour, sugar and mixed spice. Add the dried fruit and chopped fudge and mix again until well combined. Stir in the yeast.", "Make a well in the centre of the dry ingredients. Gradually pour in the milk, bringing the dry ingredients into the pool of milk using a fork, until the mixture comes together as a dough. You may not need all of the milk - try to avoid the dough becoming too sticky.", "Turn out the dough onto a lightly floured work surface and knead well for about 10 minutes, or until smooth and elastic.", "Divide the dough into six equally sized pieces. Push one into each of the holes in the muffin tray. Cover the tray with a clean, damp tea towel and set aside in a warm room for 45-60 minutes, or until the buns have almost doubled in size.", "Preheat the oven to 200C/400F/Gas 6.", "Bake the buns in the oven for 20-25 minutes, or until risen, golden-brown and cooked through (a skewer inserted into the centre of each should come out clean). Remove the buns from the muffin tray whilst they are still warm (be careful as the fudge will be very hot).", "Serve with seedless grapes, if desired."]}, {"isVegetarian": true, "title": "Fruit and yoghurt with homemade granola", "url": "www_bbc_co_uk_food_recipes_fruit_and_yoghurt_with_32329", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4kg/9lbs eating apples, peeled, cored and chopped", "250g/9oz demerara sugar ", "2 litres/3½ pints water ", "200g/7oz unsalted butter ", "800g/1lb 12oz oats ", "200g/7oz desiccated coconut ", "1 tbsp ground cinnamon ", "150g/5½oz honey ", "2kg/4lb 8oz plain yoghurt "], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 200C/400F/Gas 6.", "Place the apples, sugar and water in a large saucepan and cook gently for 10-15 minutes, or until the apples start to break up. Remove from the heat and set aside to cool. ", "Melt the butter in a microwave.  Place in a large bowl and stir in the oats, coconut, cinnamon and honey.  Spread the mixture onto large baking trays and cook in the oven for 7-8 minutes, or until golden-brown. Remove from the oven and set aside to cool.", "To serve, place the cooled apples into individual serving bowls, top with the yoghurt and sprinkle over the granola mix. "]}, {"isVegetarian": true, "title": "Fruit jumble", "url": "www_bbc_co_uk_food_recipes_fruit_jumble_25437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 ripe plums ", "1 tbsp orange juice ", "1 tbsp runny honey ", "40g/2oz butter ", "1 tbsp demerara sugar ", "1 thick slice bread"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven at 200C/400F/Gas 6.", "Make sure you ask a grown-up to help you use the knife – cut around the plums lengthways, then twist the plums in half and pull out the stone. ", "Lay the plums flat side down and cut them in half again. Put them into a casserole dish with the orange juice and honey and stir until all the plums are coated.", "Melt the butter in a small saucepan – you will need a grown-up to help you with this. Put to one side to cool down a little while you cut the bread into large squares with the table knife to make the topping. Drop the bread into the butter and swish it around to coat the bread.  Stir in half of the demerara sugar until well combined. ", "Tip the bread on top of the plums and sprinkle the top with the remaining demerara sugar.", "Ask a grown-up to place the casserole into the oven for 20-25 minutes or until the topping is golden-brown and crisp and the fruit is soft. Serve with yoghurt or custard.\t"]}, {"isVegetarian": true, "title": "Fruit meringue gâteau", "url": "www_bbc_co_uk_food_recipes_fruit_meringue_gteau_22379", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg whites ", "300g/10½oz caster sugar ", "1 litre/1¾ pints double cream", "1 tbsp vanilla bean paste", "500g/1lb 2oz strawberries, hulls removed, cut in half", "4 plums, cut in half, stones removed, finely sliced", "5 ripe figs, cut into small wedges", "100g/3½oz caster sugar", "2 tbsp toasted flaked almonds"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/90C Fan/Gas ½. ", "For the meringues, using a cake tin as a template, draw 4 x 20cm/8in circles onto 4 sheets of silicone paper or baking paper. Turn them over and place one sheet onto each of 4 flat baking trays.", "Whisk the egg whites in a bowl until soft peaks form when the whisk is removed. Add the sugar and continue to whisk until the mixture is smooth and glossy and stiff peaks form when the whisk is removed. ", "Spoon the egg white mixture into a piping bag fitted with a 1cm/½in  plain nozzle. Use a dot of the mixture to stick each corner of the baking paper to the tray. (This stops the paper and meringue being blown about by the oven fan.) Pipe the mixture inside each circular template, starting in the centre and working out to fill it. Smooth each meringue disc with a wet palette knife. ", "Cook the meringues in the oven for 2 hours. Remove from the oven to cool completely before assembling.", "For the filling, whisk the cream and vanilla bean paste in a bowl until soft peaks form when the whisk is removed. ", "To assemble, place one meringue disc into a cake stand or large serving plate. Spread over one-third of the vanilla cream, then scatter over one-quarter of the sliced fruit. Top with a second meringue disc. Repeat the layering process, topping the last meringue disc with the remaining fruit. ", "To serve, melt the sugar in a heavy-based frying pan until it starts to caramelise and turn golden-brown. Stir in the flaked almonds until completely coated. Drizzle the sugared nut mixture on top of the gâteau. Chill in the fridge for about 1 hour before serving."]}, {"isVegetarian": false, "title": "Fruit tart", "url": "www_bbc_co_uk_food_recipes_fruit_tart_28132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "75g/2½oz caster sugar", "pinch salt", "1 vanilla pod, seeds only", "150g/5½oz unsalted butter, softened", "1 free-range egg, lightly beaten", "1 tbsp milk", "1 pint full-fat milk", "1 vanilla pod, split in half lengthways", "6 free-range egg yolks", "125g/4½oz caster sugar", "40g/1½oz plain flour", "½ punnet strawberries, hulled ", "½ punnet raspberries", "½ punnet blackberries", "½ punnet redcurrants", "325ml/11fl oz pink champagne", "4 gelatine leaves, softened in cold water for 10 minutes", "75g/2½oz sugar"], "serves": "Makes 1 large tart", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, sugar, salt, vanilla seeds and butter in a food processor. Use the pulse setting to mix until combined. Add the beaten egg and milk, then pulse again until the dough comes together and leaves the sides of the bowl.", "Turn out the dough onto a very lightly floured work surface. Shape into a ball and wrap in cling film and place in the fridge for at least an hour before using. (The pastry can also be made ahead and frozen or kept in the fridge for up to four days.)", "Preheat the oven to 180C/320F/Gas 4.", "Once chilled, on a floured work surface roll the pastry out thinly. Line a 20-23cm/8-9in flan or quiche dish with the pastry.  Place some baking parchment in the middle and fill with baking beans. Bake for 30 minutes or until the pastry is a light golden-brown (to blind bake – the pastry should not be completely cooked).", "For the crème pâtissière, in a pan bring the milk and vanilla pod to the boil. Remove from the heat and set aside to infuse.", "In a bowl, cream together the egg yolks and sugar until pale and fluffy, then add the flour.  Remove the vanilla pod from the hot milk and set aside. Pour the milk over the egg yolk mix and stir well. Return the mixture to the pan and warm, stirring continuously, over a medium heat until it is thick enough to coat the back of a spoon. ", "Remove from the heat. Place a fine sieve over a bowl and strain the crème pâtissière into it. Cover with clingfilm so that the clingfilm sits directly on the crème pâtissière (to prevent a skin forming) and refrigerate until completely cooled.", "Fill the pastry case with the crème pâtissière and smooth the surface with a pallet knife or the back of a spoon.  ", "For the fruit topping, arrange the strawberries, raspberries, blackberries and redcurrants over the top. Chill in the fridge until needed.", "For the jelly, warm half of the champagne in a pan over a low heat. Add the sugar and cook until melted, then add the softened gelatine and stir well.  Pour in the rest of the champagne and stir. Transfer to the fridge to cool. When the jelly is nearly set spoon it over the fruit tart and smooth the surface.", "Chill in the fridge until the jelly has set completely. "]}, {"isVegetarian": true, "title": "Fruit tarts", "url": "www_bbc_co_uk_food_recipes_fruit_tarts_45402", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruit_tarts_45402_16x9.jpg", "ingredients": ["350g/12oz plain flour", "pinch salt", "125g/4½oz unsalted butter, flattened out in between two sheets of greaseproof paper to 1cm/½in thick, chilled in the fridge", "125g/4½oz caster sugar", "2 free-range eggs, whole and 1 egg, yolk only", "1 egg, yolk only, beaten for egg-wash ", "500ml/18fl oz full fat milk", "2 vanilla pods, seeds removed and pods retained", "6 free-range eggs, yolks only", "120g/4½oz caster sugar", "50g/2oz plain flour", "4 tbsp kirsch", "400g/14oz strawberries", "100g/3½oz redcurrants", "100g/3½oz whitecurrants", "100g/3½oz blackberries", "4 tbsp clear apricot jam", "75g/2¾oz mint tips", "50g/2oz icing sugar", "100g/3½oz green shelled pistachios, roughly chopped"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the sweet pastry, preheat the oven to 190C/350F/Gas 5.", "Lightly grease and flour 12 x 8cm/3¼in loose bottomed tins.", "Stir the flour and salt together in a large mixing bowl. Add the flattened butter straight from the fridge into the flour and rub in the mixture.", "Add the sugar, mix together the eggs and egg yolk, and to the mixture. Gently mix with a dough scraper, or spatula, until the dough comes together in a ball.", "Lightly flour a work surface, tip the pastry ball out onto it, and knead until you have a smooth soft dough. Shape the pastry into a square, to make it easier to roll out.", "Place the dough the fridge to chill for an hour minimum, preferably overnight.", "Remove the pastry from the fridge and lightly flour a work surface. Roll out the pastry 2-3mm thick and line the 12 tins, leaving an overhang of pastry. Place some greaseproof paper over the top and fill with baking beans. Rest in the fridge for 30 minutes.", "Once chilled, place the pastry tart cases on a baking sheet and cook for 15 minutes. Lift out the paper and beans, brush with beaten egg yolk, and place back in the oven for 8 minutes. ", "Remove from the oven and allow to cool for 15 minutes. Then trim the edges and lift out onto a cooling rack.", "For the crème patissière, place the milk, vanilla seeds and pods into a large saucepan and warm though.", "Place the eggs, sugar and flour in a large mixing bowl and whisk until the colour changes and becomes pale. Gradually add the warm milk and vanilla to the egg mixture, whisk together, then return the mixture to the pan. Cook on a low heat until it the mixture thickens, then pour into a clean bowl. Place a circle of greaseproof paper on the mixture, to stop a skin forming.", "If you would like to flavour the crème with kirsch, add it to the crème once it is cold.", "To make up the fruit tarts, spoon the crème patissière in a piping bag, and pipe into the pastry cases. Top the tarts with the strawberries, redcurrants or whitecurrants and blackberries.", "Put the apricot jam and 1-2 tablespoons of water in a small sauce pan and warm it through, so it loosens up and becomes more liquid. Lightly brush the fruit to glaze.", "To serve, place the tarts on a cake stand and dust with icing sugar, and garnish with mint tips or pistachios."]}, {"isVegetarian": true, "title": "Fruit tarts", "url": "www_bbc_co_uk_food_recipes_fruit_tarts_77282", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruit_tarts_77282_16x9.jpg", "ingredients": ["500g/1lb 2oz plain flour, plus extra for dusting", "100g/3½oz icing sugar", "250g/9oz butter, cubed", "1 free-range egg yolk", "splash ice-cold water, if needed ", "500ml/18fl oz milk", "6 free-range egg yolks", "40g/1½oz plain flour", "125g/4½oz caster sugar", "a little icing sugar, to dust", "½ jar apricot jam", "pineapple, peeled and diced", "400g/14oz raspberries", "handful strawberries", "handful grapes"], "serves": "Makes 18 tartlets", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, sift together the flour and icing sugar in a mixing bowl until well combined. Tip in the butter cubes and rub in with your fingers until the mixture resembles breadcrumbs. ", "Add the beaten egg and work together with your hands until the pastry comes together. You may need to add a splash of ice-cold water if the pastry is too dry. Wrap in cling film and leave to rest in the fridge for at least ten minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Remove the pastry from the fridge and peel off the cling film. Roll the pastry out on a well-floured surface to a thickness of about 5mm/¼in. ", "Cut circles of the pastry out with a cutter that’s only slightly bigger than a set of 10cm/4in tart cases. Carefully line the miniature tart cases, ensuring that you overlap the edge a little. Alternatively, lay the pastry on the top of the barquette tins and roll a rolling pin over the tart case to cut them to shape - this should cut the pastry exactly the same size as the case.  Then press the pastry into the tart tin with your fingers.", "Prick the base of the pastry with a fork. Press a square of aluminium foil bigger than the tin against the bottom to make the shape of the tin. Then place the foil into the pastry case and fill the case with ceramic baking beans. Repeat with the remaining pastry and cases.", "Place all the cases in the oven and bake for about 15 minutes, or until cooked and crisp all the way through. Remove the beans and foil lining and set aside the cases to cool on a wire rack. Then remove from the tins and set aside.", "For the crème pâtissière, heat the milk in a large pan until it is just boiling.", "Thoroughly whisk together the egg yolks, plain flour and sugar in a bowl. Pour the milk into the bowl containing the eggs and whisk to combine. Pour the entire mixture back into the pan and cook over a medium heat while stirring constantly. The mixture should thicken as it just comes to the boil.", "Remove from the heat and transfer to a bowl to cool. At this point sprinkle over a little icing sugar to stop a skin from forming.", "Pass the jam through a sieve into a clean bowl to make it smooth. Heat up the apricot jam with two tablespoons of water and leave to cool.", "Spoon a little of the cooled crème pâtissière into each one of the tart cases. Top with whatever fruit you wish before brushing lightly with the cooled apricot jam."]}, {"isVegetarian": true, "title": "Fruit tarts with elderflower custard", "url": "www_bbc_co_uk_food_recipes_fruit_tarts_with_07623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "125g/4½oz sugar", "125g/4½oz butter, diced", "25g/1oz ground almonds", "1 tsp baking powder", "1 orange, zest only", "1 lemon, zest only", "1 free-range egg, beaten", "1 vanilla pod, seeds scraped out", "400ml/14fl oz whole milk", "115g/4oz sugar", "6 free-range eggs yolks", "30g/1oz cornflour, mixed to a paste with a little cold water", "50ml/2fl oz elderflower cordial", "115g/4oz sugar", "250ml/9fl oz apple juice ", "2 tbsp cornflour", "2 tbsp golden syrup", "175g/6oz blueberries", "175g/6oz raspberries", "175g/6oz redcurrants", "175g/6oz whitecurrants"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, pulse the flour, sugar, butter, ground almonds, baking powder and citrus zests in a food processor until the mixture resembles breadcrumbs. ", "Add the beaten egg and pulse until the mixture comes together as a dough (adding a little cold water if necessary). Press the dough into a ball, wrap in clingfilm and chill in the fridge for at least 30 minutes.", "Preheat the oven to 200C/400F/Gas 6. Grease two six-hole petit four tins.", "For the pastry cream, bring the vanilla seeds and milk to the boil, in a saucepan, whisking all  the time. Remove the pan from the heat.", "Beat the sugar and egg yolks in the bowl for 3-5 minutes, or until the mixture falls in thick ribbons from the whisk. Slowly whisk in the cornflour paste until well combined.", "Add the hot milk in a steady stream and when it’s completely incorporated, pour the mixture back into the saucepan. Heat the mixture, whisking contantly, until boiling. Cook for a further minute, then pour the mixture into a bowl. Set aside to cool for 10 minutes, then stir in the elderflower cordial. Cover with the clingfilm and chill in the fridge.", "Roll the pastry out on a floured work surface and use it to line the petit four tins. Bake in the oven for 7-10 minutes or until the pastry is golden-brown and crisp. Let the tart cases cool a little then carefully transfer them to a wire rack.", "For the glaze, heat the sugar and half the apple juice in a saucepan until boil then remove the pan from the heat.", "Dissolve the cornflour in the remaining juice, quickly pour the mixture into the saucepan and return to pan to the heat. Cook until the mixture has thickened, stirring all the time, then add the golden syrup, bring back to the boil and remove the pan from the heat. Set aside to cool ", "To assemble the tarts, spoon a little pastry cream into each pastry case. Arrange the fruit on top and drizzle over the glaze. Chill in the fridge until ready to serve."]}, {"isVegetarian": true, "title": "Broad bean and feta frittata", "url": "www_bbc_co_uk_food_recipes_fruitalia_91683", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruitalia_91683_16x9.jpg", "ingredients": ["200g/7oz small broad beans, pods removed (podded weight) (use frozen beans if fresh aren't available)", "2 tbsp olive oil", "1 small red onion, peeled, chopped", "salt and freshly ground black pepper", "6 large free-range eggs", "100g/3½oz feta cheese, crumbled", "small bunch fresh mint, leaves only (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the broad beans in a pan of boiling, salted water for 2-3 minutes, or until tender. Drain well, then refresh in cold water. When the beans are cool enough to handle, peel away the outer skins, if you want to.", "Heat the oil in a small ovenproof frying pan over a low heat. Add the onion and season with a pinch of salt. Fry for 8-10 minutes, or until softened but not browned.", "Meanwhile, preheat the grill to its highest setting. In a bowl, whisk the eggs until well combined and full of air, then season, to taste, with salt and freshly ground black pepper.", "When the onions have softened, increase the heat to medium and pour in the beaten eggs. Sprinkle over the crumbled feta, mint leaves (if using) and cooked broad beans. Leave the pan on the heat for 2-3 minutes, or until the underside of the egg mixture is pale golden-brown. (NB: Do not stir the mixture.)", "Transfer the pan to the grill and cook for a further 2-3 minutes, or until the top side of the egg mixture is firm and pale golden-brown. Place a large plate upside-down over the pan, then turn the pan over so that the omelette falls onto the plate. Cut it into wedges and serve with crusty white bread."]}, {"isVegetarian": false, "title": "Fruit dripping cake with Seville orange marmalade", "url": "www_bbc_co_uk_food_recipes_fruitdrippingcakewit_85924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz mixed dried fruit, including apricots, sultanas, raisins, currants, and cherries", "90g/3½oz clarified beef dripping", "150g/5oz soft brown sugar", "225ml/8fl oz water", "butter, for greasing", "225g/8oz wholemeal flour", "1 tsp baking powder", "½ tsp bicarbonate of soda", "¼ tsp ground cinnamon", "¼ tsp ground nutmeg", "¼ tsp ground allspice", "4 free-range eggs, lightly beaten", "550g/1lb 4oz Seville oranges", "1 lemon, juice only", "1.3 litres/2pt 4fl oz water", "1.1kg/2lb 6oz granulated sugar"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the cake, place the mixed fruit, dripping, sugar and water into a pan over a medium heat and bring to the boil, stirring constantly. Remove from the heat and leave to cool and soak overnight.", "Preheat the oven to 180C/365F/Gas 4.", "Grease and line a small loaf tin.", "Sift the flour, baking powder, bicarbonate of soda, cinnamon, nutmeg and allspice into a large bowl.", "Add the cooled fruit mixture and mix well.", "Add the eggs one by one and beat the mixture together to combine well between adding each one.", "Pour the cake mixture into the cake tin and level the top with a palette knife. Place into the oven to bake for 1-1¼ hours, or until the top is golden brown and a metal skewer comes out clean. (You may need to cover the top with aluminium foil if it starts to brown too much.)", "Remove from the oven and cool in the tin for 30 minutes before turning out and leaving to cool completely on a wire rack.", "For the Seville orange marmalade, halve the oranges and scoop the flesh into a food processor, leaving the pith behind. Blend the orange flesh to a smooth purée and pass through a fine sieve into a non-reactive pan.", "Remove any remaining pith from the remaining peel, then slice the peel into thin strips and set aside.", "Add the lemon juice, water and sliced peel to the pan of orange juice and bring to the boil over a medium heat. Reduce the heat and simmer for 1-1½ hours, until the peel is tender and the liquid volume has reduced by half.", "Add the sugar and stir until it has dissolved completely. Bring the mixture back to the boil and cook for a further 10 minutes, removing any froth that may form on the surface with a spoon.", "Test whether the marmalade is ready by spooning a little onto a chilled plate and push it with your finger - it should be like jelly. If it is still runny, cook for a further 5-10 minutes, or until jelly-like on the cold plate.", "Leave to cool slightly before pouring into sterilised jars. (The marmalade should keep for up to two months in the fridge if left unopened.)", "To serve, slice the cake and spread generously with the marmalade."]}, {"isVegetarian": true, "title": "Fruit kebab skewers", "url": "www_bbc_co_uk_food_recipes_fruitkebabskewers_10298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pineapple, peeled and cored", "2 mangoes, peeled, halved and de-stoned", "1 papaya, peeled, halved and de-seeded", "1 dragon fruit, peeled", "2 kiwi fruit, peeled", "12 lychees, peeled and de-stoned", "¼ watermelon (seedless)", "12 kaffir lime leaves, washed", "6 lemon grass sticks, outer leaves removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the fruits into rough shapes.", "Thread the fruits through the lemongrass alternating  every third fruit with a lime leaf.", "Chill until required or place on a BBQ or grill and cook for 2 minutes on either side.", "Serve hot or cold."]}, {"isVegetarian": false, "title": "Gammon with spiced marmalade glaze and two zingy salsas", "url": "www_bbc_co_uk_food_recipes_fruitgammonwithspice_90783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3kg/6¾lb gammon (smoked or unsmoked according to preference)", "1 litre/1¾ pints pineapple juice", "1 litre/1¾ pints apple juice", "2 bay leaves ", "2 star anise", "4 allspice berries", "1 apple, cut in half", "1 orange, peeled, cut in half, pith removed", "1 lime, zest only", "1 cinnamon stick", "7.5cm/3in piece fresh root ginger, peeled", "4 tsp thick-cut orange marmalade", "2 tbsp clear honey", "1 tsp mixed spice", "1 tsp ground ginger", "1 tsp freshly ground black pepper", "2 bunches watercress, leaves only", "1 medium-sized fresh pineapple, peeled and chopped", "½ cucumber, cut in half horizontally, seeds scooped out with a spoon, flesh finely chopped", "½ medium fennel bulb, thinly sliced", "1 red chilli, seeds removed, flesh finely chopped", "4 tsp golden caster sugar", "2 tbsp raspberry vinegar", "4 fresh beetroot, cooked and chopped", "2 large dessert apples, peeled and finely chopped", "1 lime, zest and juice only", "4 tbsp chopped fresh mint leaves"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the gammon, bring all of the gammon ingredients to the boil in a large pan. Reduce the heat to a simmer, then cover and simmer for three hours, or until the gammon is cooked through.", "Meanwhile, for the marmalade glaze, place all of the marmalade glaze ingredients into a pan and heat over a medium heat, stirring well, until the mixture is smooth and well combined.", "Simmer the mixture for 4-5 minutes, stirring continuously, then remove from the heat and set aside.", "Preheat the oven to 180C/350F/Gas 4.", "Transfer the cooked gammon to a roasting tin. (The cooking liquor can be strained and simmered for 20 minutes until thickened to the consistency of a sauce, if desired, to serve with the finished dish.)", "Remove the skin from the gammon, leaving the underlying layer of fat exposed. Using a sharp knife, score the fat all over in a diamond pattern.", "Brush the marmalade glaze over the gammon, then bake in the oven for 25-30 minutes, or until the marmalade glaze has turned golden-brown and is sticky, then remove from the oven and set aside on a warm plate to rest. ", "For the pineapple salsa, in a bowl, mix together the pineapple, cucumber, fennel and chilli until well combined.", "Heat the sugar and vinegar in a non-reactive pan until the sugar has dissolved and the mixture is well combined. Drizzle the mixture over the pineapple mixture and stir well to combine. ", "For the beetroot and apple salsa, place the chopped beetroot and apples into a bowl and mix well.", "Add the lime juice and zest and stir well to coat the beetroot and apple in it.", "Add the chopped mint and mix well.", "To serve, place a handful of watercress into the centre of each of six serving plates. Carve the gammon into thick slices and place two slices onto the watercress. Place a spoonful of each salsa alongside the gammon. Drizzle the sauce around the edge of each plates, if using."]}]