[{"ingredients": ["75 g / 2½ oz de semillas de mostaza amarillas", "40 g / 1½ oz de semillas de mostaza marrón", "50ml / 2fl oz de vinagre de vino blanco", "25g / 1 oz de miel", "110ml / 3¾fl oz light ale", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10½fl oz de aceite vegetal", "6 cucharadas de eneldo fresco picado", "250 g / 9 oz de azúcar en polvo", "250g / 9oz de sal fina", "50g / 1¾oz de eneldo fresco, picado", "½ lado del salmón (aproximadamente 500g / 1lb 2oz), fileteado, sin piel, con espinas", "4 cabezas de lechuga Little Gem, hojas separadas", "1 yema de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "2 cucharaditas de miel clara", "2 cucharadas de vinagre de sidra", "150ml / 5fl oz de aceite vegetal o de girasol", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente picado", "1 cucharada de perejil de flatillo finamente picado", "1 cucharada de menta finamente picada", "1 cucharada de albahaca finamente picada", "1 cucharada de tomillo finamente picado", "pan integral", "mantequilla"], "method": ["Para la mayonesa de eneldo y mostaza, ponga las semillas de mostaza en un tazón. Caliente el vinagre y la miel en una olla no reactiva hasta que la miel se haya disuelto. Vierta la mezcla de vinagre y miel sobre las semillas de mostaza y mezcle bien. Agregue la cerveza y revuelva hasta que esté bien combinada.", "Cubra el recipiente con film transparente y déjelo a un lado durante al menos cuatro horas, preferiblemente durante la noche.", "Una vez frío, mezcle la mezcla de base de mostaza en un procesador de alimentos hasta que quede suave (esto tomará unos minutos ya que todas las semillas de mostaza deben descomponerse). Vierta la mezcla en un recipiente y reserve.", "Para hacer una mayonesa, mezcle las yemas de huevo, el vinagre de vino blanco y la mostaza de Dijon en un procesador de alimentos. Con el motor en marcha, agregue lentamente el aceite en una corriente delgada hasta que la mezcla se una como una mayonesa espesa y cremosa. (Puede que no necesite usar todo el aceite).", "Mezcle la mayonesa, la base de mostaza y el eneldo juntos en un bol hasta que estén bien combinados. Cubra con film transparente y enfríe en el refrigerador hasta que lo necesite.", "Para el gravlax, mezcle el azúcar, la sal y el eneldo en un tazón.", "Espolvoree la mitad de esta mezcla de adobo en el fondo de una bandeja para asar poco profunda, luego coloque el salmón encima y espolvoree sobre la mezcla restante de adobo.", "Cubra la bandeja con película adhesiva y coloque el salmón en la nevera para marinar durante una hora. Enjuague el adobo con agua fría y seque con papel de cocina.", "Para la lechuga Little Gem, coloca la lechuga en un tazón grande. Coloque el resto de los ingredientes en una licuadora y mezcle hasta que quede suave y emulsionado.", "Justo antes de servir, mezcle la lechuga en el aderezo.", "Para servir, corte el salmón en rodajas finas en un ángulo y colóquelo en un plato para servir. Sirva con la ensalada, el eneldo y la mayonesa de mostaza y el pan en rebanadas integral con mantequilla."], "url": "www_bbc_co_uk_food_recipes_gravlax_with_dill_and_34974", "title": "Gravlax con mayonesa de eneldo y mostaza y lechuga", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de salmón de alta calidad de 250 g / 9 oz, mitad trozo, piel sobre", "Sal fina de mar de 75g / 2½oz", "50 g / 1 oz de azúcar en polvo", "2 cucharaditas de granos de pimienta blanca molida", "5 ramitas de eneldo, más o menos picadas", "100 g / 3½ oz de azúcar en polvo", "50ml / 2fl% 20oz% 20Swedish% 20vinegar% 20essence% 20 (% C3% 84ttiksprit% 2012%),% 20alternativamente% 20use% 20white% 20wine% 20vinegar", "1 hoja de laurel", "2 cucharaditas de semillas de mostaza amarilla", "2 cucharaditas de semillas de mostaza marrón", "1 pepino, pelado", "4 vieiras, huevas reservadas", "1 cucharada de mantequilla clarificada, preferiblemente ahumada", "buena sal marina", "1 puñado de heno", "1 chalote pequeño, finamente picado", "100ml / 3½ fl oz crema doble", "4 huevas de vieira (desde arriba)", "sal marina, para sazonar", "pizca de puerro ceniza (de puerro cocido sobre una llama abierta)", "½ limón, solo jugo", "1 manzana roja pequeña", "½ puñado de hojas de mostaza"], "method": ["Para el gravlax, coloque el salmón en una bolsa de plástico sellable. Mezcle todos los ingredientes restantes y viértelos en la bolsa. Agite la bolsa ligeramente, deje salir el aire y selle la bolsa.", "Coloque la bolsa en el refrigerador y déjela durante 12 horas. Voltea la bolsa y vete por otras 12 horas.", "Retire el salmón de la bolsa y elimine el exceso de sal / azúcar. Rebana finamente sobre las fibras.", "Para el pepino, agregue todos los ingredientes excepto el pepino a una cacerola con 150 ml / 5 fl oz de agua y deje hervir. Retirar del fuego y enfriar durante dos minutos. Vierta en un frasco de vidrio sellable.", "Cortar el pepino longitudinalmente en cuartos. Retire las semillas y córtelas en trozos de 10cm / 4in. Coloque las piezas de pepino en la salmuera en el frasco, el líquido debe cubrir el pepino. Guárdelo en la nevera durante al menos 12 horas antes de servir.", "Para las vieiras, abra las vieiras con un cuchillo delgado y filoso. Límpielos y reserve la carne blanca, el caparazón y las huevas (para el aderezo).", "Caliente una sartén pequeña de hierro fundido o una sartén de base pesada hasta que esté caliente. Derretir la mantequilla y dorar las vieiras en ambos lados hasta que estén doradas. Retire de la sartén y sazone con sal. Reserve la mantequilla en la sartén para el aderezo de las huevas.", "Vuelva a poner las vieiras en sus conchas y colóquelas en el tambor de una barbacoa. Cubra las vieiras con el heno. Dispara al heno y déjalo arder hasta que las vieiras estén cubiertas de cenizas. Raspe el exceso de cenizas.", "Para el aderezo de las huevas, caliente dos cucharaditas de la mantequilla reservada de las vieiras en una pequeña sartén de hierro fundido o de base pesada y fría la chalota por un minuto. Agrega la crema. Pica las huevas y agrégalas a la crema. Usando una licuadora manual, mezcle hasta que quede suave. Sazonar con sal, una pizca de ceniza de puerro y un poco de jugo de limón.", "Para servir, ponga dos rebanadas de salmón de forma irregular en cada plato. Corta cada vieiras por la mitad para que consigas dos piezas redondas y colócalas al lado del salmón. Rocíe unas gotas de la salsa de huevas sobre el salmón.", "Corte rebanadas muy finas del pepino agrio a lo largo con una mandolina. Haz lo mismo con la manzana. Coloque algunas de estas rodajas de pepino y manzana alrededor de cada plato y termine con algunas hojas de mostaza."], "url": "www_bbc_co_uk_food_recipes_gravlax_with_hay_smoked_66813", "title": "Gravlax con vieiras ahumadas, pepino agrio y hojas de mostaza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["menudencias de pavo", "1 hoja de laurel", "1 ramita de tomillo", "4 granos de pimienta negra", "½ cebolla, en rodajas", "2 pintas de agua", "zumos de pan del pavo asado", "Harina normal de 25g / 1oz", "sal y pimienta"], "method": ["Coloque las menudencias en una olla y cúbralas con el agua. Agregue la hoja de laurel, el tomillo, los granos de pimienta y la cebolla.", "Llevar a ebullición y quitar cualquier escoria. Reduzca el fuego y luego cocine a fuego lento durante 45 minutos.", "Cuele el caldo y mida 750 ml / 1 1/4 pintas.", "Cuele la grasa de la lata de tostado dejando solo los jugos de pavo. Agregue la harina y mezcle con los jugos a fuego lento hasta que se torne dorado y tenga una textura suave.", "Retire de la sartén y vierta el caldo caliente. Raspe la base de la sartén con una espátula para mezclar todo el sedimento carnoso.", "Regrese al fuego y hierva durante 3-4 minutos revolviendo todo el tiempo para eliminar los grumos y hasta que la salsa se espese. Temporada para probar y servir."], "url": "www_bbc_co_uk_food_recipes_gravy_2812", "title": "Salsa de pavo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 2 pintas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gravy_2812_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite de girasol", "12 salchichas de cerdo de buena calidad", "6 lonchas de tocino rayado sin corteza, cortadas en longitudes de 2.5cm / 1in", "2 cebollas medianas, en rodajas finas", "2 dientes de ajo, aplastados", "½-1 cucharadita de chile en polvo o pimentón ahumado", "1 x 400 g / 14 oz pueden cortar tomates", "300ml / 10fl oz de caldo de pollo", "2 cucharadas de puré de tomate", "1 cucharada de salsa Worcestershire", "1 cucharada de azúcar mascabado marrón oscuro", "1 cucharadita de hierbas mezcladas secas", "2 hojas de laurel", "3-4 ramitas de tomillo fresco", "100 ml / 3½ fl oz de vino tinto o blanco (opcional)", "1 x 400 g / 14 oz puede mantequilla frijoles o judías mezcladas", "sal y pimienta negra recién molida"], "method": ["Caliente una cucharada de aceite en una sartén antiadherente grande y fría las salchichas suavemente durante 10 minutos, volteándolas de vez en cuando hasta que estén doradas por todas partes. Transfiera a una cacerola grande o una cazuela a prueba de llamas y reserve.", "Freír los trozos de tocino en la sartén hasta que empiecen a dorarse y crujientes y luego agregar a las salchichas.", "Coloque las cebollas en la sartén y fría a fuego medio durante cinco minutos hasta que comiencen a ablandarse, revolviendo con frecuencia. Deberías tener suficiente grasa en la sartén, pero si no, agrega un poco más de aceite.", "Agregue el ajo y cocine durante 2-3 minutos más hasta que las cebollas se pongan pálidas doradas, revolviendo con frecuencia.", "Espolvoree sobre el chile en polvo o la páprika ahumada y cocínelos juntos durante unos segundos más.", "Agregue los tomates, caldo de pollo, puré de tomate, salsa Worcestershire, azúcar moreno y hierbas.", "Vierta sobre el vino, o un poco de agua si no está usando vino, y cocine a fuego lento.", "Incline cuidadosamente en la sartén con las salchichas y el tocino y vuelva a hervir a fuego lento, luego reduzca el fuego, tape la sartén con una tapa y deje hervir a fuego lento durante 20 minutos, revolviendo de vez en cuando.", "Escurra los frijoles y enjuáguelos en un colador con agua corriente fría. Revuelva los frijoles en la cazuela y continúe cocinando durante 10 minutos, revolviendo ocasionalmente, hasta que la salsa esté espesa.", "Sazonar al gusto con sal y pimienta negra recién molida y servir con arroz o rebanadas de pan rústico."], "url": "www_bbc_co_uk_food_recipes_great_sausage_casserole_73010", "title": "Gran cazuela de salchichas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/great_sausage_casserole_73010_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de yogurt natural", "40 g / 1½ oz de azúcar en polvo", "1 limón, en rodajas", "200g / 7oz de sal", "1 cucharadita de chile rojo", "2 dientes de ajo, picados", "1 cucharadita de comino", "1 cucharadita de cilantro molido", "1 kg / 2lb 4oz hombro de cordero (peso deshuesado)", "aceite de oliva, para freír", "350ml / 12fl oz de caldo de pollo blanco", "350ml / 12fl oz de caldo de pollo marrón", "100 g / 3½ oz de panceta de cerdo picada", "100g / 3½oz de carne picada de cordero", "2 chalotes, picados", "1 cucharadita de chile rojo picado", "2 dientes de ajo, finamente picados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharada de puré de tomate", "200g / 7oz de tomates frescos picados", "100ml / 3½fl oz de caldo de pollo marrón", "½ pepino grande, pelado", "sal marina", "2 lechugas Little Gem, cortadas a la mitad", "1 manojo de cebollas de primavera, recortadas", "2 cucharadas de aceite de oliva", "200 g / 7oz de queso feta, cortado en cubitos", "menta fresca, al gusto", "miel, al gusto"], "method": ["Para el yogurt, vierta el yogur en una gasa o paño de muselina sobre un recipiente y déjelo colgar durante la noche.", "Deseche el líquido y vierta la mezcla de yogurt en un tazón. Enfríe hasta que esté listo para usar.", "Coloque el azúcar y 200 ml / 7 fl oz de agua en una olla y caliente hasta que el azúcar se disuelva. Agregue el limón en rodajas y cocine durante 15-20 minutos. Reserve para pasar la noche en el almíbar.", "Para el cordero estofado, mezcle la sal, el chile, el ajo, el comino y el cilantro juntos y extiéndalo sobre el cordero. Dejar de lado para marinar en la nevera durante 12 horas.", "Lave la mezcla de sal. Calentar un poco de aceite en una cazuela y dorar la carne por todos lados. Agregue ambos caldos y cocine a fuego lento durante alrededor de 4 horas o hasta que la carne esté tierna. Retire la carne de la sartén, reserve el líquido y colóquelo en una bandeja para hornear forrada con pergamino para hornear. Coloque otra hoja de pergamino para hornear en la parte superior, seguido de otra bandeja y coloque algunos pesos en la parte superior (4 latas de frijoles servirá). Coloque en el refrigerador para enfriar y configurar.", "Cuele todo el líquido de la sartén a través de un colador en una sartén limpia. Caliente y reduzca el volumen para espesar hasta obtener una consistencia de salsa. Dejar de lado hasta que sea necesario.", "Para el cordero ragù, fríe ambas carnes en un poco de aceite a fuego alto. Cuando esté dorado, desglasa la sartén con un poco de agua y agrega los chalotes, el chile y el ajo. Agregue el comino y el cilantro y cocine por 30 segundos, luego agregue el puré de tomate, los tomates picados y el caldo de pollo marrón. Cocine a fuego lento durante una hora, o hasta que el líquido esté espeso y brillante. Dejar de lado hasta que sea necesario.", "Para servir, corte el pepino en dos pedazos, de aproximadamente 6 cm / 2½ pulgadas de largo. Toma una pieza, divídela a la mitad, vuelve a dividir a la mitad y una vez más para que te queden octavos. Repita con la otra pieza. Rebane el núcleo sembrado y deséchelo. Espolvorear con sal marina y dejar de lado.", "Coloque las lechugas en el lado del corte hacia abajo en una sartén caliente hasta que estén caramelizadas. Colóquelos en la salsa de cordero reservada y caliéntelos suavemente.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Cuando esté listo para servir, corte el hombro de cordero en porciones. Dorar en una sartén caliente y colocar en el horno durante 6 minutos.", "Calentar una sartén plana. Cepille las cebolletas con un poco de aceite y la plancha durante 1-2 minutos hasta que estén chamuscadas y marchitas.", "En un tazón, mezcle el queso feta, la menta y la miel.", "Coloque rebanadas de paletilla de cordero en platos para servir y agregue una cucharada de ragú, el pepino y la lechuga carbonizada. Ponga el queso feta y el yogur colado alrededor de los platos, y agregue las rodajas de limón confitadas y las cebollas chamuscadas. Cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_greek-style_mutton_24087", "title": "Cordero al estilo griego", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "100 g / 3½ oz de carne de cordero cortada del hueso, cortada en cubos", "1 diente de ajo, finamente picado", "½ pimiento verde, picado", "1 tomate, picado", "8-10 aceitunas negras", "2 cucharadas de vino tinto", "200ml / 7fl oz de caldo de carne", "1 ramita de romero fresco"], "method": ["Caliente el aceite de oliva en una olla grande. Agregue la carne de cordero y fría por 3-4 minutos, revolviendo ocasionalmente, hasta que se dore por todas partes, luego quite con una espumadera y déjelo a un lado.", "Agregue el ajo a la sartén y cocine por un minuto, luego agregue la pimienta, el tomate, las aceitunas y el vino tinto. Llevar a ebullición y cocinar durante 1-2 minutos.", "Agregue las piezas de cordero, el caldo de carne y el romero, luego reduzca el fuego y cocine a fuego lento durante diez minutos, o hasta que el cordero esté cocido y tierno.", "Vierta en un tazón y sirva."], "url": "www_bbc_co_uk_food_recipes_greeklambstew_84507", "title": "Guiso de cordero griego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla roja pequeña, finamente cortada", "2 tomates grandes maduros, toscamente picados", "½ pepino, sin semillas y tostado", "100g / 3½oz de queso feta reducido en grasa, escurrido y cortado en cubos", "50g / 1¾oz de aceitunas negras, picadas y escurridas (en salmuera, no en aceite y preferiblemente en aceitunas Kalamata)", "pequeño puñado de hojas de menta fresca", "½ cucharadita de orégano seco", "2 cucharaditas de aceite de oliva virgen extra", "2 cucharaditas de jugo de limón fresco", "sal marina y pimienta negra recién molida", "2 panes pitta integrales, calentados"], "method": ["Coloque la cebolla, los tomates y el pepino en un recipiente y sazone al gusto.", "Esparce el queso feta, las aceitunas y las hojas de menta en la parte superior. Espolvoree sobre el orégano y mezcle ligeramente. Rocíe el aceite y el jugo de limón y sirva con pan de pita caliente."], "url": "www_bbc_co_uk_food_recipes_greek_salad_16407", "title": "ensalada griega", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greek_salad_16407_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["160g / 5½oz de sal", "60g / 2¼ oz de azúcar moreno", "2 naranjas, jugo y ralladura", "pizca de copos de chile", "2 cucharaditas de semillas de hinojo", "1 canela grande", "1 cabeza de ajo, formas de ancho reducido a la mitad", "4 cucharadas de vinagre de jerez", "1 pato entero, hueso de la espalda eliminado, salpicado de espinas", "2 cebollas españolas pequeñas, en rodajas finas", "4 dientes de ajo, dejados enteros", "1 canela grande", "2 hojas de laurel", "1 ralladura de naranja y jugo", "1 cucharada de cilantro molido", "2 cucharadas de semillas de hinojo", "1 cucharada de semillas de comino", "pizca de copos de chile", "Col blanca rallada 40g / 1½oz", "1 manzanas Granny Smith, cortadas en tiras finas (en una mandolina)", "2 melocotones, cortados en tiras finas", "3 cucharadas de vinagre de manzana", "1½ cucharadas de ouzo", "puñado de hojas frescas de cilantro", "jugo de limón, al gusto", "2 cucharadas de aceite de oliva", "50g / 1¾oz que hace estallar el maíz", "1 cucharadita de semillas de hinojo molido", "pizca de copos de chile", "1 manojo de berros, hojas recogidas", "1 encurtido de eneldo, en rodajas finas", "Queso de leche de oveja, como un pecorino trufado, en rodajas", "6 bollos de hamburguesa"], "method": ["Para hacer la salmuera, mezcle la sal, el azúcar, el vinagre y 1 litro / 1¾ pintas de agua en una cacerola a fuego medio para disolver el azúcar y la sal. Quite 6 tiras de cáscara de las naranjas con un pelador de verduras, agregue a la sartén con el jugo de naranja, ajo y especias, y cocine a fuego lento. Apague el fuego y transfiéralo a un recipiente lo suficientemente grande como para caber en el pato. Agregue 2 litros de agua fría y deje que la salmuera se enfríe antes de agregar el pato, empujándolo hacia abajo para sumergirlo. Refrigere durante al menos 8 horas o durante la noche.", "Cuando esté listo para cocinar, retire el pato de la salmuera y séquelo, déjelo en un lugar fresco durante una hora para que se seque. Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque las cebollas en una bandeja de asar agregando los dientes de ajo, la ramita de canela, las hojas de laurel y el jugo de naranja y la ralladura. Mezcle el cilantro, el comino, las semillas de hinojo y el chile y espolvoree un poco en la parte inferior del pato. Coloque el pato encima de las cebollas y espolvoree la especia restante sobre el pato. Agregue 1.5 litros / 2½ litros de agua a la bandeja y cúbralo con papel de aluminio. Asar durante 4-4½ horas, luego verificar la ternura. La carne debe ser fácilmente perforada con la punta de un cuchillo.", "Retire el papel de aluminio, hilvanado y vuelva al horno por otros 30 minutos para que la piel quede crujiente. Transfiera el pato a una bandeja y déjelo enfriar.", "Cuidadosamente quite la grasa superficial y déjela a un lado. (Si lo hace con anticipación, vierta el licor de cocción de pato en un recipiente, déjelo enfriar y refrigere durante la noche. Al día siguiente, quite la grasa solidificada y déjela a un lado).", "Retire los palitos de canela y las tiras de naranja y coloque el licor de cocción y las cebollas en una olla pequeña y deje que hierva, baje el fuego a fuego lento y reduzca el volumen hasta que la salsa se haya espesado. Mientras tanto, cuidadosamente recoja la piel crujiente y la carne del pato en un tazón grande.", "Agregue la salsa de pato reducida a la piel y la carne y mezcle bien. Sazone al gusto, aunque por lo general no necesita ningún condimento ya que ha sido salteado. Divida la mezcla en seis hamburguesas y colóquela en la mitad de una bandeja forrada con papel pergamino. Doble el papel sobre las hamburguesas, doblando los bordes para asegurarlo. Coloque en el horno y vuelva a calentar suavemente durante 10-12 minutos mientras plancha el pan antes de servir, rociado con un poco de aceite de oliva.", "Para la ensalada, mezcle los ingredientes, sazone con sal marina, pimienta negra recién molida y agregue el jugo de limón al gusto. Cubrir y refrigerar hasta servir.", "Para las palomitas de maíz, caliente el aceite en una olla grande con una tapa ajustada. Agregue el maíz y cubra inmediatamente. Cocine a fuego medio, moviendo la sartén continuamente hasta que el estallido casi se haya detenido, aproximadamente 2-3 minutos. Retire la sartén del fuego y déjela tapada por un minuto hasta que el estallido se detenga por completo. Retire con cuidado la tapa, agregue la grasa de pato reservada, las semillas de hinojo y el chile y mezcle bien. Las palomitas se pueden preparar con anticipación y almacenar en un recipiente hermético.", "Para servir, levante cuidadosamente las empanadas de pato del papel y sirva emparedado entre el pan cubierto con ensalada, berros y encurtidos. Sirva con un tazón de palomitas de maíz."], "url": "www_bbc_co_uk_food_recipes_greek_pulled_duck_burger_28630", "title": "Hamburguesa de pato sacó griego con palomitas de pato con especias, manzana y ensalada de melocotón, encurtidos y berros", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de cordero o 8 chump chops, alrededor de 750 g / 1lb 10 oz de peso total", "2 cucharaditas de orégano seco", "1 kg / 2lb 4 oz patatas harinas, como el rey Edwards, en rodajas", "2 cebollas en rodajas", "4 dientes de ajo grasos", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Limpie los filetes o las chuletas y espolvoree con sal, pimienta negra recién molida y la mitad del orégano.", "Incline las papas y las cebollas en un molde para asar y rocíe más de 3 cucharadas de aceite de oliva, el resto del orégano, sal y pimienta. Mezcle todo hasta que las papas y las cebollas estén bien cubiertas con aceite. Coloque los dientes de ajo sin pelar entre las papas.", "Ase las papas durante 20 minutos hasta que comiencen a ablandarse, luego ponga las chuletas encima, vierta 300 ml / ½ pinta de cordero o caldo de pollo o agua y vuelva al horno durante 30-35 minutos, hasta que el cordero esté tierno y las papas teñidas de marrón. Al servir, asegúrese de que todos se tomen un diente de ajo para exprimir y mezclar con los otros ingredientes."], "url": "www_bbc_co_uk_food_recipes_greeklambwithpotatoe_65572", "title": "Cordero griego con patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de aceitunas Kalamata negras", "3 tomates medianos, cortados en cubos de 2cm / ¾in", "1 pepino pelado, cortado en cubos de 2cm / ¾in", "1 pimiento rojo, sin semillas, cortado en cubitos", "½ cebolla roja, en rodajas finas", "100ml / 3fl oz de aceite de oliva virgen extra", "Feta de 150g / 5oz, cortado en cubitos", "1 lechuga cos pequeña y firme, cortada en cubos ásperos a lo largo", "1 ramita generosa de orégano (o 2 cucharaditas de orégano seco)", "50ml / 3 cucharadas de vinagre de vino tinto"], "method": ["Mezcle todos los ingredientes en un tazón."], "url": "www_bbc_co_uk_food_recipes_greeksalad_13055", "title": "ensalada griega", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greeksalad_13055_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 puñados de hojas frescas de perejil de flatleaf, más o menos picadas", "2 tallos de apio, finamente picados", "3 tomates, sin semillas y picados", "100 g / 3½ oz de queso feta, cortado en cubos", "2 cucharadas de frijoles cannellini en lata, enjuagados y escurridos", "1 limón, solo jugo", "1 cucharada de aceite de oliva", "2 cucharadas de aceitunas negras, picadas"], "method": ["Coloque todos los ingredientes en un tazón grande. Mezcle bien y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_greeksalad_79831", "title": "ensalada griega", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 8¾fl oz de agua fría", "50 g / 1 oz de azúcar en polvo", "1 ramita de canela", "pequeñas hebras de azafrán", "1 cucharada de miel", "12 albaricoques, cortados a la mitad", "150g / 5¼ oz de yogur griego", "50 g / 1¾oz de pistachos triturados"], "method": ["Ponga el agua, el azúcar, la rajita de canela, el azafrán y la miel en una sartén y caliente hasta que el azúcar se haya disuelto.", "Cocine a fuego lento durante cinco minutos antes de agregar los albaricoques. Cocine a fuego lento por otros cinco minutos. Retire del fuego y deseche la ramita de canela.", "Sirva los albaricoques calientes sobre una cama de yogur y rocíe sobre el almíbar."], "url": "www_bbc_co_uk_food_recipes_greekapricots_72397", "title": "Albaricoques griegos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greekapricots_72397_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de queso feta, picado", "Aceitunas negras de 75 g / 2½ oz, hoyos eliminados", "3 cucharadas de perejil fresco picado", "3 cucharadas de aceite de oliva", "2 cucharaditas de vinagre de vino blanco", "2 cucharaditas de vinagre de vino tinto", "sal y pimienta negra recién molida"], "method": ["Mezcle todos los ingredientes y sirva."], "url": "www_bbc_co_uk_food_recipes_greeksalad_82142", "title": "ensalada griega", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 limón, solo jugo", "150g / 5½oz de tomates cherry de vid, cortados a la mitad", "½ chalote, pelado y finamente cortado", "Aceitunas 50g / 2oz, hoyos eliminados", "50g / 2oz de queso feta, desmenuzado", "sal y pimienta negra recién molida", "4-6 rebanadas de chapata, dependiendo del tamaño del pan", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para hacer la ensalada griega, mezcle el aceite de oliva y el jugo de limón en un tazón.", "Agregue los tomates cherry, el chalote, las aceitunas y el queso feta, luego sazone con sal y pimienta negra recién molida y mezcle.", "Para hacer la bruschetta, caliente una sartén hasta que fume. Rocíe las rodajas de ciabatta con el aceite y sazone ambos lados con sal y pimienta negra recién molida. Grill por un minuto en cada lado.", "Para servir, coloca las rodajas de bruschetta en el centro de un plato y coloca la ensalada griega encima."], "url": "www_bbc_co_uk_food_recipes_greeksaladonbruschet_81321", "title": "Ensalada griega sobre bruschetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 4-6 rebanadas de tamaño mediano", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greeksaladonbruschet_81321_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo asado de un tarro, en rodajas", "¼ de pepino, en rodajas", "1 diente de ajo, en rodajas finas", "puñado de garbanzos de una lata, enjuagado y escurrido", "1 cucharada de aceite de oliva", "puñado de aceitunas, picadas", "½ limón, solo jugo", "sal marina y pimienta negra recién molida", "25 g / 1 oz de harina", "2 cucharaditas de semillas de sésamo", "1 huevo de gallinas camperas", "110 g / 4 oz de queso feta, en rodajas en 2 piezas", "4 cucharadas de aceite de oliva, para freír", "apretón de jugo de limón"], "method": ["Para hacer la ensalada, mezcle todos los ingredientes, sazone al gusto con sal y pimienta negra recién molida y reserve.", "Para el queso feta frito mezcle la harina, las semillas de sésamo y el huevo en un tazón. Sumerja las piezas de feta en la mezcla para cubrir.", "Caliente el aceite en una sartén honda y agregue el queso feta. Freír durante dos o tres minutos, volteando una vez, hasta dorar por ambos lados. Retire y escurra sobre papel de cocina.", "Coloque el queso feta frito encima de la ensalada con un chorrito de jugo de limón y sirva."], "url": "www_bbc_co_uk_food_recipes_greeksaladwithfriedf_83947", "title": "Ensalada griega con queso feta frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 claras de huevo de gallinas camperas, ligeramente batidas", "1 cucharada de miel clara", "1 limón, jugo y ralladura", "2 cucharadas de semillas de comino", "½ cucharadita de pimienta de cayena", "½ cucharadita de jengibre molido", "½ cucharadita de canela molida", "½ cucharadita de pimienta de Jamaica molida", "sal y pimienta negra recién molida", "1 pollo entero de 1.3kg / 3lb", "125ml / 4½fl oz de aceite de oliva", "500g / 1lb 2 oz de papas para ensalada como Anya o Charlotte, sancochado hasta que estén tiernas en caldo de pollo", "Aceitunas negras 100g / 3½oz, pozos eliminados, picados", "sal y pimienta negra recién molida", "1 limón, ralladura solamente", "1 cucharada de mantequilla sin sal", "1 cucharada de perejil fresco picado", "ensalada verde mixta ligeramente vestida", "Yogur de estilo griego"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En un tazón grande, mezcle las claras de huevo, la miel, el jugo de limón y la ralladura de limón hasta que estén bien combinados.", "En un recipiente aparte, mezcle las semillas de comino, pimienta de cayena, jengibre, canela, pimienta, sal y pimienta hasta que estén bien combinados. Espolvorea la mezcla en un plato.", "Sumerja primero el pollo en la mezcla de huevo, luego enrósquelo en la mezcla de especias hasta que esté completamente cubierto.", "Coloque el pollo recubierto en una bandeja para hornear y tueste en el horno durante 1¼-1½ horas, o hasta que la piel esté crujiente y dorada y el pollo esté bien cocido. (NB: el pollo se cuece cuando los jugos se aclaran cuando se inserta un pincho en la parte más gruesa).", "Mientras tanto, para las papas, caliente el aceite en una bandeja para asar en el horno hasta que fume. Agregue las papas sancochadas y las aceitunas picadas y sazone, al gusto, con sal y pimienta negra recién molida. Regrese al horno y tueste durante 35-40 minutos, o hasta que las papas estén crujientes, doradas y cocidas.", "Transfiera las papas cocidas y las aceitunas a un tazón, luego mezcle la ralladura de limón, la mantequilla y el perejil hasta que cubran las papas y las aceitunas.", "Para servir, esculpe el pollo y divida la carne en partes iguales entre los cuatro platos para servir. Coloque las papas y las aceitunas al lado. Sirve con ensalada verde y yogur griego."], "url": "www_bbc_co_uk_food_recipes_greekstyleroastchick_92179", "title": "Pollo asado al estilo griego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de queso feta, desmenuzado", "1 tomate de ternera, cortado en cubitos", "2 cucharadas de pasas", "puñado de perejil fresco, solo hojas", "puñado de menta fresca, solo hojas", "puñado de albahaca fresca, solo hojas", "puñado de cebollín fresco, picado", "2 cucharaditas de aceite de oliva", "1 cucharadita de vinagre de vino tinto", "sal y pimienta negra recién molida"], "method": ["Coloque la feta, el tomate, las pasas y las hierbas juntas en un tazón pequeño y revuelva suavemente para combinar.", "Batir el aceite de oliva con el vinagre de vino tinto en un recipiente aparte y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta el aderezo sobre la ensalada y revuelva para cubrir bien la ensalada."], "url": "www_bbc_co_uk_food_recipes_greekstylesalad_85405", "title": "Ensalada de estilo griego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de centeno 80 g / 3 oz", "100g / 3½oz de harina integral", "80g / 3oz de mantequilla sin sal", "2 g de bicarbonato de soda", "40 g / 1½ oz de azúcar en polvo", "3g de sal", "95g / 3¼ oz de avena jumbo", "1 huevo de gallinas camperas, golpeado", "300g / 10½oz de queso crema", "130g / 4oz de crema fresca", "1 cucharada de puré de vainilla o extracto de vainilla de buena calidad", "¼ limón, solo jugo, más una gota adicional para las claras de huevo", "2 hojas de gelatina", "100 g / 3½ oz de azúcar en polvo", "4 claras de huevo medianas", "200 g / 7 oz de grosellas verdes (como Invicta), lavadas, sin tallos y cortadas a la mitad", "10 g de azúcar en polvo", "2¼ hojas de gelatina, ablandadas en agua y luego escurridas", "aproximadamente 10-12 grosellas espinosas verdes firmes, tallos eliminados", "500 g / 1 libra de grosella roja de 2 onzas (como Hinnomaki), recortada", "50 g / 1 oz de azúcar en polvo (opcional)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Tenga listo un molde para pasteles de 4 cm / 1½ pulgadas de profundidad, 20 cm / 8 pulgadas o una lata de torta.", "Para la base de galletas de avena, en un tazón grande combine las harinas, la mantequilla, el bicarbonato de soda, el azúcar y la sal. Con las puntas de los dedos, frote los ingredientes hasta que la mezcla se asemeje a pan rallado. Agregue la avena y el huevo y mezcle bien. Amasar hasta que se una.", "Con un rodillo, enrolle la mezcla de galletas entre dos hojas de pergamino para horno con un espesor de 5 mm / ¼ in. Levante en una bandeja de horno y quite la pieza de papel superior. Hornee en el horno por 15 minutos.", "Retire del horno y deje reposar por 2 minutos. Usando el anillo de hojaldre de 20 cm / 8 pulgadas o la lata de torta, presione hacia abajo en la galleta, cortando a través de la parte inferior. Deje que se enfríe completamente antes de usarlo para la tarta de queso. Retire el exceso de galletas de alrededor del anillo; esto se puede desmenuzar encima de la tarta de queso terminada, si se desea.", "Para el relleno, en un tazón grande mezcle el queso crema, la crème fraîche, el puré de vainilla o el extracto y el jugo de limón.", "Coloque la gelatina en una olla pequeña con 2 cucharaditas de agua y caliente suavemente hasta que la gelatina se disuelva. Una vez que se haya enfriado un poco, bata rápidamente en la mezcla de crema. En una cacerola pequeña disuelva el azúcar en 5 cucharaditas de agua. Llevar a ebullición y continuar calentando a 121C en un termómetro de azúcar. (PRECAUCIÓN: el azúcar hirviendo está muy caliente. Tenga cuidado de no quemarse).", "Mientras tanto, en un mezclador de alimentos equipado con el accesorio de batir o con un batidor de mano eléctrico y un bol, bata las claras de huevo, agregando solo una gota de jugo de limón al comienzo. Batir hasta que se formen picos suaves cuando se quite la batidora.", "Gire el batidor a velocidad media y prepárese para agregar el jarabe de azúcar caliente. La mejor técnica para hacer este tipo de merengue italiano es verter el jarabe de azúcar caliente por el costado del tazón en un solo hilo para que se mezcle bellamente. De lo contrario, la velocidad del batidor hará girar el azúcar y lo solidificará sobre el batidor y el bol. Continúe batiendo a velocidad media por otros 5 minutos hasta que la mezcla esté brillante; el jarabe caliente parcialmente cocinará la clara de huevo haciéndola estable.", "Apoye la base del tazón de merengue en un recipiente con agua helada y continúe batiendo a mano hasta que la mezcla esté completamente fría. Cuando esté frío, agregue la mitad de las claras de huevo a la mezcla de relleno de crema y batir rápidamente con un batidor hasta que quede suave, luego agregar las claras de huevo restantes y doblar.", "Coloque el anillo de pastelería o la lata de torta con la base de galleta dentro de una bandeja o placa de horno. Vierta el relleno en el anillo, dejando un espacio de 5 mm / ¼ pulgada desde la parte superior del anillo y nivele la superficie plana con una espátula o con el dorso de una cuchara. Refrigere por 2 horas para permitir que la mezcla se solidifique.", "Cuando la tarta de queso se haya enfriado durante 1 hora y media, prepare la mermelada de grosella espinosa. Coloque las grosellas en un bol y macere con el azúcar por 15 minutos. Transfiera a una cacerola pequeña a fuego medio y cocine a fuego lento durante 10 minutos, tapado con una tapa. Vierta en una licuadora, con la gelatina ablandada y 50 g / 1¾oz de agua y mezcle a máxima velocidad durante un minuto. Para asegurarse de que el puré esté suave, páselo por un colador fino en un recipiente, forzándolo a pasar usando la parte posterior de un cucharón. Apoye la base del recipiente sobre un recipiente con agua helada para que se enfríe y revuelva todo el tiempo. Una vez que la mezcla empiece a espesarse, espárcela sobre la tarta de queso fría.", "Para el relleno, superior y la cola de las grosellas espinosas y cortar cada uno en diagonal en rodajas de 2 mm de espesor. Coloque 16 rebanadas de grosellas en el borde de la tarta de queso sobre la gelatina. Enfríe la tarta de queso durante la noche o hasta que esté completamente fraguada.", "Para la compota, corte las grosellas por la mitad. Prueba uno: si es lo suficientemente dulce, no hay necesidad de macerarlos, si están un poco amargos, ponerlos en un tazón con el azúcar y dejar que se maceren durante 15 minutos.", "Transfiera a una cacerola a fuego medio y cocine por 10 minutos con la tapa puesta, guiándolos en una burbuja suave; revuelva de vez en cuando para evitar que la compota quede atrapada en el fondo de la sartén. Retirar del fuego y dejar enfriar completamente, probar y ajustar con un chorrito de agua si es muy ácido o un poco de azúcar, si es necesario.", "Sirve la tarta de queso con la compota junto a tus invitados para ayudarse a sí mismos."], "url": "www_bbc_co_uk_food_recipes_green_gooseberry_jelly_79010", "title": "Tarta de queso gelatina de grosella verde con compota de grosella roja", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 10-16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo", "100 g / 4 oz de queso crema suave con cebollino", "1 cucharada de parmesano listo para rallar, o queso duro vegetariano similar", "pimienta negra", "Calabacín de 60 g / 2 oz, rallado", "50ml / 2fl oz de aceite de colza", "3 hojas de pasta filo", "pizca de pimienta"], "method": ["Lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 6.", "Comience haciendo el relleno de tarta. Rompe un huevo en un bol y luego bate con un tridente. A continuación, agregue el queso crema y mezcle en el huevo hasta que esté bien combinado. Agregue el parmesano y un poco de pimienta negra. Revuelva bien, luego agregue el calabacín rallado y dé otra buena mezcla a la mezcla.", "Cepille el interior de una lata de hojaldre pequeña (500 g) con el aceite y cúbrala con una lámina de hojaldre con el resto cayendo sobre la parte exterior de la lata.", "Cepíllese con más aceite, luego coloque otra hoja encima creando una superposición adicional en el costado. Cepille esa capa con aceite, luego agregue la tercera hoja en la parte superior.", "Vierta su relleno de egipto en el pastel y doble la masa extra sobre la parte superior, una capa a la vez, ocultando el relleno. Apunte la masa con aceite mientras construye las capas. Finalmente aplique la parte superior de la masa de filo con más aceite.", "Pídale a un adulto que lo ponga en el horno durante 20-25 minutos o hasta que el relleno del filo esté dorado y crujiente."], "url": "www_bbc_co_uk_food_recipes_green_parcel_pie_17626", "title": "Pastel de paquete verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["cilantro fresco de manojo grande, toscamente picado", "gran manojo de menta fresca, solo hojas", "gran manojo de albahaca fresca, solo hojas", "6 dientes de ajo, picados", "Jengibre fresco de raíz de 5cm / 2in en pieza, pelado y aproximadamente picado", "4 chiles verdes, más o menos picados", "200 g / 7 oz de yogur griego", "5 limas", "1 pollo entero, espolvoreado", "2 cucharadas de salsa de soja oscura", "2 cucharadas de salsa de pescado", "1 cucharada de aceite de sésamo tostado", "1 cucharada de miel", "Col de 1 hispi, solo hojas, en rodajas finas", "1 cebolla roja, finamente rebanada", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a su configuración más alta, o al menos 240C / 220C Fan / Gas 8.", "Mezcle dos tercios del coriandro, la menta y las hojas de albahaca en un procesador de alimentos. Agregue 5 de los dientes de ajo, todo el jengibre y 3 de los chiles y mezcle hasta obtener una pasta fina. Agregue el yogur y mezcle de nuevo. Agregue la ralladura y el jugo de 3 de las limas y mezcle hasta que quede suave. Pon este adobo a un lado.", "Sazone el pollo espolvoreado muy bien en ambos lados con sal y pimienta negra recién molida. Colóquelo en una bandeja para hornear, con la piel hacia arriba. Frota el adobo sobre el pollo con las manos. Si tiene tiempo, cubra y coloque en el refrigerador para marinar durante 1 hora; de lo contrario cocina enseguida.", "Ase el pollo en el horno durante 40-45 minutos o hasta que esté bien cocido. (El pollo se cuece cuando los jugos se hacen transparentes cuando el pollo se perfora en la parte más gruesa del muslo con un cuchillo afilado y no queda rastro de restos rosados).", "Mientras tanto, muele el cilantro restante, la menta y la albahaca hasta obtener una pasta usando un mortero. Sazonar con una gran pizca de sal. Agregue los chiles y el ajo restante y vuelva a moler hasta lograr una pasta homogénea. Agregue las salsas de soja y pescado, el aceite de sésamo y la miel hasta que estén bien combinados. Agregue la ralladura y el jugo de las 2 limas restantes y muela una vez más.", "Mezcle la col y la cebolla en un recipiente, rocíe sobre el aderezo y revuelva para cubrir. Incline la ensalada en un plato de servir. Tallar el pollo cocido en trozos y colocarlos en la parte superior de la ensalada para servir."], "url": "www_bbc_co_uk_food_recipes_green_spatchcocked_72293", "title": "Pollo salpicado de verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]