[{"isVegetarian": true, "title": "Homemade lemon curd", "url": "www_bbc_co_uk_food_recipes_homemade_lemon_curd_15350", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large free-range eggs", "4 unwaxed lemons, finely grated zest and juice only", "300g/10½oz caster sugar", "225g/8oz butter, cut into pieces"], "serves": "Makes 1–2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Break the eggs into a saucepan and whisk to combine. Stir in the remaining ingredients and place over a medium heat. ", "Whisk continuously over the heat until the mixture coats the back of a spoon and is slightly thickened – this could take 7–10 minutes. Do not allow the mixture to boil or it may split.", "Remove from the heat and leave to cool. Spoon into a sterilised jar (or two small jars) seal, and leave to thicken.", "Keep in the fridge for up to a month, but use within a week of opening the jar. "]}, {"isVegetarian": false, "title": "Homemade linguine with lobster sauce", "url": "www_bbc_co_uk_food_recipes_homemade_linguine_with_94058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz type '00' flour (available in supermarket baking sections and some delicatessens), plus extra for dusting", "salt and freshly ground black pepper", "3 free-range eggs", "1 tbsp olive oil", "2 cooked lobsters", "50g/2oz butter", "1 onion, roughly chopped", "1 carrot, roughly chopped", "4 sprigs fresh thyme", "¼ tsp cayenne pepper", "1 tbsp tomato purée", "75ml/3fl oz white wine", "75ml/3fl oz brandy", "500ml/17fl oz chicken stock ", "75ml/3fl oz double cream", "salt and freshly ground black pepper", "3 tomatoes, peeled, de-seeded, diced", "2 tbsp chopped fresh chervil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the linguine, season the flour with salt and freshly ground black pepper. Blend the flour and eggs in a food processor until the mixture forms small crumbs. Turn the mixture out onto a lightly floured work surface and knead for 2-3 minutes, or until the dough is smooth and elastic.", "Wrap the pasta dough in cling film and chill in the fridge for 20 minutes.", "To make the linguine, weigh out about 300g/11oz of the pasta dough (the remaining pasta dough can be stored in the fridge for up three days or in the freezer for up to three months). Lightly flour a clean work surface and work the rested dough into a rough rectangle shape using your fingers.", "Flour the pasta machine. Starting at the lowest (widest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-widest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time, until the pasta is thin and smooth.", "Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the cutting attachment to the pasta machine, flouring it well. Run each sheet of dough through the machine once again, cutting it into linguine. Dust the linguine well with flour and place onto a plate. Chill in the fridge while you make the sauce.", "For the lobster sauce, cut the lobsters in half lengthways and remove the meat. Chop all of the meat except the claw meat into small pieces. Reserve the claw meat and lobster shells.", "Heat half of the butter in a frying pan until foaming, add the onion, carrot and thyme and cook for 2-3 minutes, or until softened but not coloured.", "Add the reserved lobster shells, cayenne pepper and tomato purée and cook for a further minute, stirring well.", "Add the white wine and brandy to the pan. Carefully set the alcohol alight with a match and allow the flames to flare up and die down. (CAUTION: make sure there are no flammable materials above the pan when flaming and keep the pan away from your face and hair.)", "Add the chicken stock, bring the mixture to the boil, then reduce the heat and simmer for 30 minutes, until reduced and thickened.", "Set the sauce mixture aside to cool slightly, then transfer to a food processor and blend to a purée. (You may need to do this in batches.)", "Pass the puréed sauce through a sieve into a clean saucepan and whisk in the cream. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "Heat the remaining butter in a frying pan and fry the reserved lobster claw meat for 1-2 minutes on each side.", "Meanwhile, cook the linguine in a large pan of boiling, salted water for 2-3 minutes, or until al dente. ", "Drain the linguine and return it to the saucepan. Add the chopped lobster meat, diced tomatoes and chervil. Season, to taste, with salt and freshly ground black pepper.", "To serve, pile the linguine into serving bowls and top with one lobster claw. Ladle the lobster sauce around and over the pasta."]}, {"isVegetarian": false, "title": "Homemade marshmallows with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_homemade_marshmallows_33473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb granulated sugar", "1 tbsp liquid glucose", "2 large free-range egg whites", "9 sheets gelatine, soaked in 140ml/4¾fl oz water", "1 tsp vanilla extract", "vegetable oil, for greasing", "5-6 tbsp icing sugar, for dusting", "5-6 tbsp cornflour, for dusting", "75g/2¾oz caster sugar", "200g/7oz dark chocolate, roughly chopped"], "serves": "Makes 450g/1lb", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the marshmallows, place the granulated sugar, glucose and 200ml/7fl oz of water into a heavy-bottomed saucepan and bring to the boil.", "Cook over a medium high heat until a sugar thermometer shows 127C/260F.", "Place the egg whites into a clean grease-free bowl and whisk to firm peaks.", "Add the soaked gelatine sheets and water to the hot sugar syrup very carefully. Stir through, then pour into a jug.", "Continue to whisk the egg whites, then pour the sugar syrup onto the egg whites, whisking all the time until the whites are shiny.", "Add the vanilla extract and continue to whisk for about 5-10 minutes, or until the mixture is thick enough to hold its shape on a whisk.", "Lightly oil a shallow 30x20cm/12x8in baking tray.", "Dust the tray with some icing sugar and cornflour, then spoon the mixture into the tray, smoothing the top with a wet palette knife.", "Place in the fridge for at least one hour to set.", "Dust some more icing sugar and cornflour over the work surface.", "Loosen the edge of the marshmallow, then turn out onto the dusted work surface.", "Cut into squares and roll in the icing sugar and cornflour to coat totally. Carefully place the marshmallows onto a skewer.", "Either place on a hot griddle, under a grill, over an open fire or into a tandoor and grill for 1-2 minutes, or until slightly charred and gooey.", "For the chocolate sauce, place the sugar and 110ml/4fl oz water into a saucepan and bring to a simmer.", "Cook for 1-2 minutes, or until all the sugar has dissolved, then add the chocolate.", "Whisk until smooth and then remove from the heat.", "Serve the marshmallows with the chocolate sauce in a bowl on the side."]}, {"isVegetarian": false, "title": "Homemade puff-pastry and wild boar sausage rolls", "url": "www_bbc_co_uk_food_recipes_homemade_puff-pastry_38790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "pinch salt", "300g/10½oz chilled unsalted butter, 50g/1¾oz cut into cubes, the rest left in a block", "25g/1oz unsalted butter", "1 onion, chopped", "3 garlic cloves, chopped", "50ml/2fl oz brandy", "500g/1lb 2oz minced wild boar (available from farm shops and online specialists)", "6 sprigs fresh tarragon, leaves roughly chopped", "2 free-range egg yolks, lightly beaten", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, tip the flour and salt into a large bowl, add the cubes of butter and rub the butter into the flour using your fingertips, until the mixture resembles breadcrumbs.", "Gradually stir in 150ml/5fl oz cold water, until the mixture comes together as a soft dough (you may not need all the water). Use your hands to pat the dough into a 2cm/¾in-thick rectangular block.", "Roll out the dough onto a lightly floured work surface to a rectangle measuring about 30x20cm/12x8in. ", "Sandwich the remaining block of butter between two pieces of greaseproof paper. Using a rolling pin, roll or bash it out to a rectangle measuring about 15x20cm/6x8in.", "Place the flattened butter into the centre of the rolled pastry. Fold one edge of the pastry over the butter to half-cover it, then fold the other edge of the pastry over the butter to cover the other half, so that the two edges of pastry meet. Pinch together the top and bottom edges of the pastry to seal the butter inside. ", "Fold the pastry in half lengthways, then turn the pastry 90 degrees to the right (a quarter-turn).", "Roll out the pastry again to a rectangle measuring about 30x20cm/12x8in. ", "Fold the pastry as before, bringing each edge into the centre so that the edges meet, then folding in half lengthways, before giving the pastry a quarter-turn.", "Repeat the rolling and folding process once more, then wrap the pastry in cling film and chill in the fridge for one hour.", "Meanwhile, for the filling, heat the butter in a frying pan over a medium heat. When the butter is foaming, add the onions and garlic and fry for 4-5 minutes, or until softened. ", "Add the brandy, then stand back and set the pan contents alight with a long match. (CAUTION: Do not flame the pan ingredients with the extractor fan running. Keep your hair and face away from the flames.) Allow the flames to flare up and die down, then transfer the pan contents to a large bowl and set aside to cool. ", "When the onion mixture has cooled, add the minced wild boar and tarragon and mix well, then season generously with salt and freshly ground black pepper.", "Preheat the oven to 230C/210C Fan/Gas 8. Line a baking tray with baking parchment.", "Roll out the puff pastry on a lightly floured work surface to a rectangle measuring about 40x30cm/16x12in and about 5mm/¼in thick. ", "Cut the pastry in half lengthways to create two rectangles measuring 40x15cm/16x6in.", "Divide the filling mixture into two and form a line of filling down the length of each sheet of pastry, making sure the filling mixture is slightly off-centre. ", "Brush the narrow edge of the pastry rectangles with the beaten egg. Fold the wider edge of the pastry rectangle over the filling and press it against the narrow edge of the pastry, crimping to seal and trimming the pastry if desired. ", "Transfer the sausage rolls to the prepared baking tray, seam-side down. Brush the tops with the remaining beaten egg. Bake in the oven for 20-30 minutes, or until the pastry has risen and is golden-brown and the filling is cooked through.", "To serve, cut the wild-boar sausage rolls into slices and pile onto a platter. Serve hot or cold."]}, {"isVegetarian": false, "title": "Homemade puff pastry sausage rolls", "url": "www_bbc_co_uk_food_recipes_homemade_puff_pastry_72461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/1lb 4oz plain flour, plus extra for dusting ", "¾ tsp salt", "200ml/7fl oz cold water", "2 tsp lemon juice", "550g/1lb 4oz unsalted butter, soft enough to be pliable", "2 tsp dried mixed herbs ", "sea salt and freshly ground black pepper", "700g/1lb 9oz minced pork", "1 tbsp Worcestershire sauce", "1 tsp chopped fresh sage", "1 tsp chopped fresh thyme leaves", "100g/3½oz breadcrumbs", "egg wash (1 free-range egg, lightly beaten in a bowl)"], "serves": "Serves 9-12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour and salt in a large mixing bowl. Add the water and lemon juice. Mix to combine and then tip out onto a floured work surface. Briefly knead to form a rough, but evenly combined, dough. ", "Place the pastry in the fridge to rest for 1-2 hours.", "On a lightly floured work surface, roll the pastry out into a rectangle approximately 50x30cm/20x12in. Slice the butter and lay this over two-thirds of the dough. Fold the unbuttered dough third over the buttered one, then flip that over the remaining buttered third so that the butter is wrapped inside the dough. Take a rolling pin and lightly roll the upper surface of the dough to press out any air bubbles. Seal the edges with a sharp whack of the rolling pin.", "Give the pastry what is known as one single turn – fold the bottom third of the pastry up, then the top third down. Roll the pastry out towards the folded edges until it measures roughly 60x25cm/23x10in, then fold the pastry in by thirds again. ", "Give the pastry a further two turns, without resting in between. Place the pastry on a plate, cover with cling film and transfer to the fridge to chill for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6 and line a baking tray with baking paper.", "For the filling, in a bowl combine the dried herbs, salt and pepper, pork mince, Worcestershire sauce, sage and thyme. Stir, then add breadcrumbs. Mix well.", "Remove the pastry from the fridge and roll it into a fairly shallow rectangle at least 24cm/9½in long. If necessary, trim the edges to make a neat rectangle.", "Roll the meat into a long, thin sausage, approximately the same length as the pastry. (Don’t make it too thick or the sausage will not cook.)", "Place the sausage on the pastry and roll the pastry around the sausage. Brush some egg wash on to seal the edge of the pastry. Trim any the excess pastry and discard.", "Cut the sausage roll into three equal parts, then divide each part into three or four mini sausage rolls. Brush with egg wash all over the top.", "Place the rolls on the lined baking tray and bake for 20 minutes, or until puffed and golden-brown."]}, {"isVegetarian": true, "title": "Homemade ricotta with broad bean salad", "url": "www_bbc_co_uk_food_recipes_homemade_ricotta_with_55585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 litres/5¼ pints whole milk", "1.5 litres/2½ pints double cream", "8 lemons, juice only", "2 sprigs thyme ", "2 sprigs rosemary ", "2 garlic cloves", "salt and freshly ground black pepper", "extra virgin olive oil, to serve", "100g/4oz fresh peas, podded", "100g/4oz broad beans, podded", "1 bunch asparagus, chopped", "½ fennel bulb, shaved", "1 punnet pea shoots", "salt", "25ml/1¾fl oz pomace oil or olive oil", "25ml/1¾fl oz extra virgin olive oil", "1 tbsp sherry vinegar", "1 garlic clove, grated", "1 tsp Dijon mustard", "1 orange, zest only", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the ricotta, place the milk, cream, thyme, rosemary and garlic in a medium saucepan and heat through to infuse the milk. Pass through a fine sieve.", "Place back on the heat in a new saucepan and season with salt. Bring to a simmer and add the lemon juice. Do not whisk. The milk infusion will split on its own.  Remove from the heat, set aside for 30 minutes.", "Place a sieve over a large bowl and line with muslin. Pour the split milk mixture into the sieve and place in the fridge for 6 hours. Discard the whey and place the curd in the fridge.", "For the broad bean salad, heat a large saucepan of boiling water and season with salt. Blanch the peas, broad beans and asparagus for 3-5 minutes, plunge in cold water to cool then drain. Mix the vegetables in a bowl, then add the fennel and pea shoots. ", "For the dressing, place the ingredients into a bowl and whisk to combine. Pour the dressing over the salad and mix just before serving.", "To serve, spoon ricotta onto a plate, dress with some black pepper, sea salt and extra virgin olive oil and place some of the salad alongside. "]}, {"isVegetarian": false, "title": "Homemade sausage rolls", "url": "www_bbc_co_uk_food_recipes_homemade_sausage_rolls_60543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_sausage_rolls_60543_16x9.jpg", "ingredients": ["50g/1¾oz butter ", "6 pork sausages", "6 large sheets filo pastry, room temperature (ideally remove from the fridge 20 minutes before needed)", "sea salt and freshly ground black pepper"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/190C Fan/Gas 7 and line a baking tray with greaseproof paper.", "Melt the butter in a small saucepan over a low heat and season with salt and pepper. Meanwhile, make a slit along the side of the sausages, peel the skin off and discard.", "Lay a sheet of filo pastry on a clean work surface and brush with the melted butter. Layer another sheet on top and brush with more butter. Lay two sausages along the shortest edge of the filo, then roll it up to form a long sausage. Cut into four pieces and place onto the baking tray. Repeat this step another two times.", "Brush the tops of the rolls with any remaining butter and bake in the oven for 25 minutes until cooked through and golden-brown."]}, {"isVegetarian": false, "title": "Homemade tandoori chicken", "url": "www_bbc_co_uk_food_recipes_homemade_tandoori_63396", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_tandoori_63396_16x9.jpg", "ingredients": ["1.75kg/4lbs chicken drumsticks, skinned", "pinch salt ", "2 lemons, juice only", "500g/1lb 2oz plain yoghurt ", "3-4 tbsp tandoori spice mix ", "3-4 tbsps plain yoghurt", "pinch salt", "pinch sugar", "5 fresh mint sprigs", "1 green chilli, deseeded, sliced"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Cut deep incisions into the chicken flesh with a small, sharp knife. Place the chicken into a bowl and sprinkle over the salt and the juice of two lemons, massaging into the chicken until well coated. ", "Whisk the yoghurt and tandoori spice mix in a bowl until well combined. Pour the marinade onto the chicken and massage into the flesh. Cover with clingfilm and chill in the fridge overnight. ", "Preheat the grill to high.", "Lift the drumsticks from the tandoori mixture and gently shake off any excess. Place a wire rack over a roasting tin and lay the drumsticks upon it. Grill for 20 minutes, turning regularly, or until richly burnished and the chicken is cooked through. Add more lemon juice to taste.", "For the dip, place all of the ingredients into a food processor and blend until smooth. Serve alongside the chicken drumsticks."]}, {"isVegetarian": false, "title": "Homemade baked beans with cherry tomatoes, garlic and sausage", "url": "www_bbc_co_uk_food_recipes_homemadebakedbeanswi_85532", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ onion, chopped", "1 smoked garlic clove, chopped", "2 rashers pancetta, chopped", "200g/7oz tinned butter beans, rinsed and drained", "1 tbsp tomato purée", "2 tsp brown sugar", "dash Tabasco sauce", "2 tbsp red wine", "200g/7oz tinned cherry tomatoes", "1 smoked sausage, griddled and sliced", "2 slices ciabatta, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a small pan and fry the onion, garlic and pancetta for 4-5 minutes.", "Add the butter beans, tomato purée, sugar, Tabasco sauce, red wine and cherry tomatoes and simmer for 4-5 minutes.", "To serve, place the baked beans into a serving dish and top with the sausage and ciabatta."]}, {"isVegetarian": false, "title": "Classic cheeseburgers", "url": "www_bbc_co_uk_food_recipes_homemadebeefburger_83644", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadebeefburger_83644_16x9.jpg", "ingredients": ["540g/1lb 3oz minced beef chuck steak", "25g/1oz chopped coriander", "1 onion, chopped", "1 tbsp Dijon mustard", "1 free-range egg yolk", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 slices mature Cheddar", "4 tbsp mayonnaise", "½ iceberg lettuce, shredded", "4 ciabatta rolls", "1 red onion, sliced", "1 beef tomato, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the burger ingredients in a mixing bowl and stir to combine. Using your hands, shape into four equal-sized patties.", "Preheat the grill to hot. Cook the burgers under the grill for 15 minutes, or until cooked through, turning once.", "Top each burger with a slice of cheese towards the end of the cooking time.", "Before serving, mix together the mayonnaise and lettuce. Cut the ciabatta rolls in half and toast under the grill on both sides.", "Top the bottom halves of the ciabatta rolls with the lettuce and mayonnaise, followed by a slice of tomato.", "Arrange the burger and cheese on top of the ciabatta, followed by a slice of red onion. Top each burger with the other halves of the ciabatta rolls and serve."]}, {"isVegetarian": false, "title": "Homemade chicken stock", "url": "www_bbc_co_uk_food_recipes_homemadechickenstock_71470", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.8kg/4lb chicken carcass (roasted or un-roasted), cut into pieces", "2 small onions", "2 cloves", "2 carrots", "2 leeks", "1 stalk celery", "3 cloves garlic", "3 large sprigs parsley", "2 sprigs thyme", "1 bay leaf", "1 tsp coarse salt", "10 peppercorns", "2 litres/3½ pints water"], "serves": "Makes 1.3 litres", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place all ingredients in a stockpot or any large pot, bring to boil and cook for 2-3 hours, skimming regularly.", "Strain and use straight away, or allow to cool and place in airtight containers.", "The stock can then be frozen until needed or kept in the refrigerator for a few days."]}, {"isVegetarian": true, "title": "Homemade chocolate Easter eggs", "url": "www_bbc_co_uk_food_recipes_homemadechocolateeas_4891", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadechocolateeas_4891_16x9.jpg", "ingredients": ["300g/10½oz dark chocolate (70% cocoa solids) or milk chocolate", "icing for piping Easter eggs "], "serves": "Makes 6-8 eggs", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Polish the inside of each mould with a piece of paper kitchen towel. Then dampen a piece of kitchen towel with a little flavourless oil, sunflower will do, and polish the inside of each mould with the oil. This ensures a highly polished finish to the chocolate and also helps to release the set chocolate from the mould.", "It is essential to  temper  the chocolate - this is a method of heating and cooling chocolate for coating or moulding. The heating and cooling separates the cocoa solids and ensures the set chocolate will have a high gloss and smooth finish. To temper the chocolate you will need a cooking thermometer, a heat-proof bowl and saucepan of hot water. Break the chocolate into small, even pieces and melt gently in a bowl over a saucepan of hot, not boiling, water. Place the thermometer into the chocolate and heat until it reaches 43C/110F. Take off the heat and cool to 35C/95F. Now it is ready to use.", "Pour spoonfuls of the chocolate into each mould. Swirl around until coated, use the pastry brush if necessary and then remove excess chocolate. Leave to set, flat side down on a surface, like a large tray, covered in greaseproof paper. Fill each mould in the same way. You will have to repeat the process another two or three times to build up a good layer of chocolate in each mould. Wait for about 20 minutes for the chocolate to set in between layers. Draw a clean ruler or the flat edge of a knife across the chocolate to ensure a clean edge every time you add a layer. This is important so that the two sides of the egg stick together evenly. Leave to chill in a larder or cool place until set.", "Carefully un-mould the egg halves and place on a clean surface taking care not to handle the chocolate too much as it will start to melt from the heat of your hands.", "To stick the two edges of an egg together, heat a baking sheet and then place the edges of two halves on it for a few seconds, then gently push the edges together.", "To decorate the eggs, sit an egg in a glass or small cup and use as a stand while you pipe your desired message on the egg. You can wrap your eggs in cellophane wrap and label them to give away or place them in a basket and offer them to guests."]}, {"isVegetarian": true, "title": "Homemade cranberry biscotti", "url": "www_bbc_co_uk_food_recipes_homemadecranberrybis_84810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz plain flour, plus extra for flouring", "1 lemon, zest only", "1 orange, zest only", "50g/1½oz caster sugar", "50g/1½oz fresh cranberries", "2 free-range eggs"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a baking sheet in the oven at 200C/400F/Gas 6.", "Place all the ingredients into the bowl of a food processor and blend until the ingredients have combined and formed a dough.", "Place the dough onto a floured surface and shape the dough, with floured hands, into a long ciabatta shape.", "Place the ciabatta onto the hot baking sheet and bake for 15 minutes, or until cooked through and golden-brown in colour. Remove from the oven and allow to cool for two minutes.", "Cut diagonally into thin slices to make the biscotti.", "To serve, place the biscotti into a clean bowl."]}, {"isVegetarian": true, "title": "Homemade flatbread with spicy red pepper hummus", "url": "www_bbc_co_uk_food_recipes_homemadeflatbreadwit_85657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp coriander seeds, toasted in a dry frying pan ", "100ml/3½fl oz water", "250ml/9fl oz natural yoghurt", "1½ tsp dried yeast", "550g/1lb 3½oz strong plain flour, plus extra for dusting", "1 tbsp salt", "2 tbsp vegetable oil, plus extra for brushing", "400g/14oz canned chickpeas, rinsed and drained ", "4 garlic cloves", "50g/2oz tahini paste", "3 lemons, juice only", "100g/3½oz Peppadew peppers or sweet pickled chilli peppers from a jar", "extra virgin olive oil, to taste", "salt and freshly ground black pepper", "6 olives", "1 red chilli, chargrilled"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Toast the coriander seeds in a dry frying pan over a medium heat for 1-2 minutes, until they turn golden-brown.", "Transfer the toasted seeds to a pestle and mortar and lightly crush them.", "Place the crushed coriander seeds into a pan with the water and bring to the boil.", "Place the yoghurt into a bowl and add the yeast.", "Pour the coriander seeds and water into the yoghurt mixture and stir well.", "Add 200g/7oz of the flour and use your hands to combine well. Cover the bowl and leave to prove for 25 minutes (preferably somewhere warm, but this isn't essential).", "Turn the dough out onto a lightly floured surface. Add the salt, oil and remaining flour and mix well to completely combine.", "Place the dough back into its bowl, cover and leave to prove for one hour. (The dough should have nearly doubled in size.)", "Turn the dough out onto a lightly floured surface and knead it lightly for one minute.", "Divide the dough into six and roll into little balls.", "Roll each ball out flat to 10cm-12.5cm/4in-5in circles.", "Heat a griddle pan or large shallow pan. Brush each circle of dough with a little oil and cook the flatbreads for about 30 seconds on each side, or until golden-brown all over.", "For the hummus, place all of the hummus ingredients, except the oil, into a food processor and blend until smooth.", "With the food processor motor running, add a steady stream of oil, to loosen the mixture, until at the consistency of your choice.  ", "Transfer the hummus to a dish or bowl and garnish with the olives and chargrilled chilli.", "To serve, place the bowl of hummus onto a large plate and place the flatbreads around the bowl."]}, {"isVegetarian": false, "title": "Homemade jaffa cakes", "url": "www_bbc_co_uk_food_recipes_homemadejaffacakes_91480", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadejaffacakes_91480_16x9.jpg", "ingredients": ["2 free-range eggs", "50g/2oz caster sugar", "50g/2oz plain flour, sieved", "1 x 135g/4¾oz packet orange jelly, chopped", "1 tbsp orange marmalade", "125ml/4½fl oz boiling water ", "200g/7oz good quality dark chocolate, minimum 70 per cent cocoa solids, broken into pieces"], "serves": "Makes 12 cakes", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cakes, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the eggs and sugar to the bowl and beat continuously for 4-5 minutes, or until the mixture is pale, fluffy and well combined. ", "Add the flour, beating continuously, until a thick, smooth batter forms. ", "Half-fill each well in a 12-hole muffin tin with the cake batter. Transfer the tin to the oven and bake the cakes for 8-10 minutes, or until pale golden-brown and cooked through (the cakes are cooked through when a skewer inserted into the centre of the cakes comes out clean.) Remove from the oven and set the cakes aside, still in their tray, until cool. ", "Meanwhile, for the filling, in a bowl, mix together the jelly, marmalade and boiling water until the jelly has dissolved and the mixture is smooth. Pour the filling mixture into a shallow-sided baking tray or large dish to form a 1cm/½in layer of jelly. Set aside until completely cooled, then chill in the fridge until set. ", "When the jelly has set and the cakes have cooled, cut small discs from the layer of jelly, equal in diameter to the cakes. Sit one jelly disc on top of each cake. ", "Bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the chocolate and stir until melted, smooth and glossy, then pour over the cakes. Set aside until the melted chocolate has cooled and set."]}, {"isVegetarian": false, "title": "Homemade linguine with a mussel and tomato sauce and pesto", "url": "www_bbc_co_uk_food_recipes_homemadelinguinewith_93221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz type '00' flour (available in supermarket baking sections and some delicatessens), plus extra for dusting", "3 free-range eggs", "60g/2½oz fresh basil leaves, plus extra to serve", "50g/2oz pine nuts, toasted ", "50g/2oz parmesan, freshly grated", "1 garlic clove, peeled", "75ml/3fl oz extra virgin olive oil", "5 tbsp olive oil", "1 onion, finely chopped ", "1 stick celery, finely chopped", "2kg/4lb 4oz mussels, cleaned, beards removed (discard any mussels that remain open after rinsing)", "150ml/5fl oz white wine", "2 garlic cloves, peeled, finely chopped", "800g/1lb 12oz canned tomatoes", "6 fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the linguine, blend the flour and eggs in a food processor until they form small crumbs. Remove from the processor and knead on a lightly floured surface for 2-3 minutes, or until the dough is smooth and elastic.", "Cover the dough in cling film and chill in the fridge for 20 minutes.", "To make the linguine, weigh out about 300g/11oz of the pasta dough (you can store the remaining pasta dough in the fridge for up three days or in the freezer for up to three months). Lightly flour a clean work surface and work the rested dough into a rough rectangle shape with your fingers.", "Flour the pasta machine. Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time.", "Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the cutting attachment to the pasta machine, flouring it well. Run the sheets of dough through the machine once again, cutting them into linguine. Dust the linguine well with flour and place on a plate. Chill in the fridge while you make the sauce.", "For the pesto, blend the basil, pine nuts, parmesan and garlic in a food processor to a fine purée. Add the olive oil and continue to blend to a coarse paste.", "For the mussel and tomato sauce, heat 2½ tablespoons of the olive oil in a lidded frying pan over a medium heat. Fry the onion and celery for 1-2 minutes, or until softened.", "Add the mussels and white wine and cover the pan with its lid. Steam for 2-3 minutes, or until all of the mussels have opened. (Discard any mussels that have not opened.)", "Strain the mussels through a fine sieve into a bowl. Reserve the cooking liquid.", "Using your hands, discard the shells from half of the mussels and set the mussel flesh aside. (Set aside the remaining mussels in their shells too.)", "Return the pan the mussels were cooked in to the heat and add the remaining 2½ tablespoons of olive oil. Fry the garlic for 30 seconds, or until pale golden-brown.", "Add the reserved cooking liquid, canned tomatoes and basil and bring to the boil. Reduce the heat until the mixture is simmering and simmer for 8-10 minutes, or until the volume of the mixture has reduced by one third. Season, to taste, with salt and freshly ground black pepper and stir in all of the cooked reserved mussels.", "Meanwhile, bring a large pot of salted water to the boil. Remove the prepared linguine from the fridge and loosen it carefully with your fingers, to separate the strands. Cook the linguine in the boiling water for 2-3 minutes, or until just tender, then drain.", "Stir the cooked linguine into the mussel and tomato sauce.", "To serve, spoon the mussel and tomato linguine onto each of four serving plates and top each with a spoonful of pesto and a few basil leaves."]}, {"isVegetarian": true, "title": "Homemade open apple pie with cinnamon cream", "url": "www_bbc_co_uk_food_recipes_homemadeopenapplepie_90694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting", "200g/7oz cold butter, cubed", "1 free-range egg yolk", "2-3 tbsp water, to bind", "2 apples, peeled, cored and sliced", "2 tbsp caster sugar", "½ tsp ground cinnamon", "200ml/7fl oz double cream", "½ tsp ground cinnamon", "1 tbsp icing sugar, plus extra for sprinkling"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pie, place the flour and 175g/6oz of the butter into a food processor and pulse until the mixture resembles breadcrumbs. Add the egg, then add just enough water, one tablespoon at a time, to bind the mixture. Blend briefly to bring the mixture together as a dough. ", "Tip the dough out onto a floured work surface and knead gently. Shape into a ball and roll out into a flat circle with the thickness of a pound coin. Place onto a baking sheet lined with greaseproof parchment. ", "Arrange the sliced apple on the pastry, leaving a 2.5cm/1in gap around the edges, then sprinkle over the caster sugar and cinnamon and dot with the remaining butter. Draw the edges of the pastry up to form a crust and pinch to hold in place. Bake for 8-10 minutes in the oven, or until the pastry is golden-brown and crisp.", "For the cinnamon cream, whisk the cream together in a bowl with the cinnamon and icing sugar until soft peaks form when the whisk is removed. ", "Serve the apple pie with spoonfuls of the cinnamon cream and a sprinkle of icing sugar."]}, {"isVegetarian": true, "title": "Homemade mayonnaise", "url": "www_bbc_co_uk_food_recipes_homemademayonnaise_67195", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["290ml/½ pint groundnut oil", "2 eggs, yolks only", "1 garlic clove, crushed", "1 heaped tsp powdered mustard", "1 level tsp salt", "freshly milled black pepper", "1 tsp white wine vinegar"], "serves": "Makes 290ml/½ pint", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["First of all, put the egg yolks into the basin, add the crushed garlic, mustard powder, salt and a little freshly milled black pepper. Mix all of these together well. Then, holding the groundnut oil in a jug in one hand and an electric hand whisk in the other, adddrop of oil to the egg mixture and whisk this in.", "However stupid it may sound, the key to a successful mayonnaise is making sure each drop of oil is thoroughly whisked in before adding the next drop. It won't take all day, because after a few minutes - once you've added several drops of oil - the mixture will begin to thicken and go very stiff and lumpy. When it gets to this stage you need to add a teaspoon of vinegar, which will thin the mixture down.", "Now the critical point has passed, you can then begin pouring the oil in a very, very thin but steady stream, keeping the beaters going all the time. When all the oil has been added, taste and add more salt and pepper if it needs it. If you'd like the mayonnaise to be a bit lighter, at this stage addtablespoons of boiling water and whisk it in.", "Mayonnaise only curdles when you add the oil too quickly at the beginning. If that happens, don't despair. All you need to do is put a fresh egg yolk into a clean basin, add the curdled mixture to it (drop by drop), then continue adding the rest of the oil as though nothing had happened."]}, {"isVegetarian": true, "title": "Homemade pasta with rocket pesto", "url": "www_bbc_co_uk_food_recipes_homemadepastawithroc_85298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for flouring", "3 free-range eggs", "1 tbsp olive oil, plus extra for drizzling", "2 tbsp olive oil", "3 tbsp pine nuts", "1 garlic clove, peeled", "large handful rocket", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, place the flour, eggs and olive oil into a food processor and pulse until combined.", "Turn the dough out onto a lightly floured surface and knead briefly until smooth. Cut the dough in half and set one piece aside.", "Roll out one half of the dough until 1cm/½in thick, then feed it through a pasta machine. Start on the thickest setting, passing the sheet through several times and lowering the setting until it reaches the thinnest setting. Slice the pasta sheet into ribbons 1cm/½in wide. Repeat the process with the rest of the dough.", "Place the pasta into a large saucepan of boiling salted water and cook for 2-3 minutes, until al dente. Drain well, place into a large bowl and drizzle with olive oil.", "For the rocket pesto, place all the pesto ingredients into a small food processor and blend until smooth.", "To serve, pour the pesto over the pasta and stir well to coat. Place the pasta into two serving bowls."]}, {"isVegetarian": false, "title": "Homemade minestrone", "url": "www_bbc_co_uk_food_recipes_homemademinestrone_93768", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemademinestrone_93768_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 large onion, peeled, sliced", "150g/5½oz streaky bacon, diced", "4 celery stalks, chopped", "2 garlic cloves, peeled, finely chopped.", "2 carrots, peeled, diced ", "2 potatoes, peeled, diced", "1 litre/1 pint 15¼fl oz beef stock", "30g/1oz tomato purée", "400g/14 oz canned haricot beans, drained", "1 bay leaf", "1 tsp fresh thyme leaves", "handful chopped fresh parsley", "400g/14 oz tomatoes, chopped", "100g/3½ oz  spaghetti, broken into 2cm/1in pieces", "salt and freshly ground black pepper", "1 crusty white bread loaf, cut into thick slices", "1 tbsp olive oil", "200g/7oz mozzarella, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and fry the onion, bacon, celery, garlic and carrots for 2-3 minutes, or until softened. ", "Stir in the potatoes and fry for a further 2-3 minutes. Pour in the stock and bring the mixture to the boil. Stir in the tomato purée and simmer for 45 minutes.", "Add the haricot beans, herbs, chopped tomatoes and spaghetti and continue to cook until the pasta is tender. Season, to taste, with salt and freshly ground black pepper.", "For the croûtons, drizzle the bread with the olive oil.", "Heat a griddle pan until hot and fry the bread on one side for 2-3 minutes, or until golden-brown. Meanwhile, preheat the grill to high.", "Remove the bread from the pan and top the uncooked side with the mozzarella. Place under the grill for 2-3 minutes, or until the cheese is bubbling and golden-brown.", "To serve, ladle the soup into 4 soup bowls and top with a croûton."]}, {"isVegetarian": false, "title": "Homemade pork sausages with colcannon and apple sauce", "url": "www_bbc_co_uk_food_recipes_homemadeporksausages_85815", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fatty minced pork", "50g/2oz breadcrumbs", "1 free-range egg, beaten", "1 garlic clove, crushed", "1 tbsp chopped fresh parsley or marjoram", "3 tbsp olive or sunflower oil", "salt and freshly ground black pepper", "1.5kg/3lb 5oz floury potatoes, scrubbed ", "100g/3½oz butter", "500g/1lb 2oz green cabbage, outer leaves removed and discarded, inner leaves sliced", "250ml/9fl oz hot milk", "2 tbsp chopped fresh parsley", "1 large cooking apple, peeled, cored and roughly chopped", "1 tbsp water", "25-50g/1-2oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sausages, place all the ingredients, except the olive oil, into a bowl and mix thoroughly then season well with salt and freshly ground black pepper. (Fry a tiny bit of the mixture in a hot pan with a little olive or sunflower oil to check the seasoning. Add more if required.)", "Divide the mixture into 12 pieces and shape each one into a sausage shape. Place on a baking tray or plate and set aside until you want to cook them. (Chilling them for a day in the fridge is fine, or you can freeze them.)", "To cook the sausages, heat a frying pan on a low to medium heat, add two tablespoons of olive or sunflower oil and gently fry the sausages for 12-15 minutes, turning occasionally, until golden on all sides and completely cooked through.", "For the colcannon, cook the potatoes in boiling salted water for 10 minutes, then drain off three quarters of the water and continue to cook over a low heat until tender. ", "When cooked, drain all of the remaining water. Once just cool enough to handle, peel the potatoes, then mash with half of the butter.", "Heat a pan until hot and add the remaining butter, two tablespoons of water and the sliced cabbage. Cook over a medium heat for 5-7 minutes, stirring frequently, until just cooked through.", "Add the cabbage mixture to the potatoes, then add most of the hot milk and the parsley, keeping some of the milk back in case you do not need it all. Season, to taste, with salt and freshly ground black pepper, and beat until creamy and smooth, adding more milk, if necessary, to achieve your preferred consistency.", "For the apple sauce, place the apple in a small pan with the water. Cover with a lid and cook over a gentle heat, stirring occasionally, until the apple has broken down to a pulp. Add sugar to taste.", "To serve, place a spoonful of colcannon onto each plate and place a knob of butter into the centre to melt. Add three sausages to each plate and a spoonful of warm apple sauce alongside."]}, {"isVegetarian": true, "title": "Homemade scones", "url": "www_bbc_co_uk_food_recipes_homemadescones_73976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadescones_73976_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "1 tsp baking powder", "pinch salt", "25g/1oz caster sugar", "50g/2oz unsalted butter, slightly softened", "150ml/¼ pint milk", "1 egg, beaten, or plain flour, for brushing or dusting"], "serves": "Makes 8-10 scones", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pre-heat the oven to 220C/425F/Gas 7.", "Sift together the flour, baking powder and salt into a bowl. Stir in the sugar, add the butter and rub quickly into the flour, creating a fine breadcrumb consistency. ", "Add the milk, a little at a time, working to a smooth dough. ", "This is now best left to rest for 5-15 minutes before rolling.", "Roll out the dough on a lightly floured work surface until 2cm/¾in thick. Using a 5cm/2in pastry cutter, cut the dough, using one  sharp tap and not twisting the dough as you cut. Twisting the scone mix will result in an uneven rising.", "Once cut, the scones can be either brushed with the beaten egg for a shiny glaze, or dusted with the flour for a matt finish.", "Place the scones on a greased baking tray and bake in the pre-heated oven for 10-12 minutes until golden-brown. Allow to  cool slightly, and serve while still warm."]}, {"isVegetarian": true, "title": "Homemade tomato ketchup", "url": "www_bbc_co_uk_food_recipes_homemadetomatoketchu_81722", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, finely chopped", "¼ tsp coriander seeds", "¼ tsp cumin seeds", "pinch chilli flakes", "pinch ground ginger", "2 tomatoes, skinned, deseeded and finely chopped"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small frying pan over a medium heat. Add the onions and fry for 2-3 minutes, until softened.", "Place the coriander seeds, cumin seeds, chilli flakes and ginger into a pestle and mortar and grind to a powder.", "Add the ground spices and chilli flakes and tomatoes to the onions and simmer gently over a low heat for 10 minutes, or until the tomato has softened and become a sauce.", "To serve, pour into a bowl and leave to cool."]}, {"isVegetarian": false, "title": "Homemade tomato ketchup with chicken goujons", "url": "www_bbc_co_uk_food_recipes_homemadetomatoketchu_85534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/8fl oz cider vinegar", "1 bay leaf", "½ tsp ground coriander", "½ tsp ground cinnamon", "8 tbsp Demerara sugar", "1.5kg/3lb ripe tomatoes, quartered, seeds removed", "1 tsp salt", "1 tbsp English mustard powder", "1 garlic clove, crushed", "Tabasco sauce", "2 tbsp tomato purée", "½ tsp cornflour, if necessary", "125g/4½oz fresh fine breadcrumbs", "½ tsp cayenne pepper", "4 boneless and skinless chicken breasts, cut into strips", "50g/2oz plain flour", "3 medium free-range eggs, beaten"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato ketchup, place the vinegar, bay leaf, coriander, cinnamon and sugar into a heavy-based saucepan and bring to a gentle simmer.", "Add all of the remaining tomato sauce ingredients, except the cornflower, and bring to the boil, stirring occasionally to prevent any sticking or burning.", "Once boiling, reduce the temperature and simmer, stirring frequently, for 30 minutes. (NB: be careful the mixture doesn't burn or catch on the base of the pan as this will ruin the sauce.)", "Remove from the heat and allow to cool for a few minutes. Transfer to a food processor or liquidiser and blend until smooth. Push the sauce through a sieve into a bowl and allow to cool completely.", "If you find the ketchup is too thin once cold, place into a pan and boil until thickened, stirring frequently. If necessary, add half a teaspoon of cornflour mixed to a paste with water; this will prevent the tomato water separating from the ketchup, but be careful not to make it to starchy and too thick.", "For the chicken goujons, heat a deep fat fryer to 190C/375F.", "Mix the breadcrumbs and the cayenne pepper in a bowl and set aside.", "Dredge the chicken in the flour, then dip into the beaten egg.", "Dip the chicken into the spicy breadcrumbs, making sure all the chicken is coated thoroughly.", "Carefully place the goujons into the deep fat fryer in batches and cook for about 3-4 minutes, until crisp and golden brown and the chicken is completely cooked through. Carefully remove with a slotted spoon and drain onto kitchen paper. Repeat until all the goujons are cooked.", "To serve, place the chicken goujons onto a large serving plate with a bowl of tomato ketchup alongside."]}, {"isVegetarian": true, "title": "Celeriac soup", "url": "www_bbc_co_uk_food_recipes_homestyleceleriacsou_87169", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, crushed", "½ large potato, peeled, chopped", "½ celeriac, peeled, chopped", "salt and freshly ground black pepper", "300ml/½ pint hot vegetable stock ", "1 tbsp fresh chopped chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry over a gentle heat until softened. ", "Add the garlic and cook for one minute. ", "Add the potato and celeriac and season, to taste, with salt and freshly ground black pepper.", "Add the stock and cook for ten minutes, or until the potato and celeriac have softened. Remove the vegetables and stock from the heat and leave to cool for a few minutes, before blending with a stick blender. Alternatively do not blend fir a rustic style soup. ", "To serve, pour into a bowl and garnish with chopped chives."]}, {"isVegetarian": false, "title": "Honey-glazed confit duck with spiced lentils and mashed potato", "url": "www_bbc_co_uk_food_recipes_honey-glazed_confit_duck_74877", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz table salt ", "2 tsp thyme leaves", "2 tsp finely chopped rosemary", "2 garlic cloves, finely chopped", "4 duck legs", "600ml/20fl oz duck fat", "2 bay leaves", "50g/1¾oz unsalted butter", "2 tbsp olive oil", "150g/5½oz bacon lardons", "1 onion, finely chopped", "1 garlic clove, finely sliced", "1 small carrot, finely chopped", "1 stick celery, finely chopped", "2 tsp ground cumin", "2 tsp ground coriander", "300g/10½oz Puy lentils", "175ml/6fl oz red wine", "450ml/16fl oz beef stock", "2 tbsp good sherry vinegar", "2 tbsp fresh coriander", "1kg/2lb 4oz Maris piper potatoes, peeled and cut into chunks", "300ml/10fl oz full-fat milk", "300ml/10fl oz double cream", "150g/5½oz unsalted butter", "50g/1¾oz butter", "4 tbsp clear honey", "200ml/7fl oz veal jus or reduced beef stock, warmed"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 140C/120C Fan/Gas 1.", "For the honey-glazed confit duck, put the salt, thyme, rosemary and garlic into a bowl and mix. Add the duck legs, cover with the mixture and marinate in the fridge for 24 hours.", "Rinse the duck legs to wash off the salt mixture. Place in an ovenproof lidded saucepan or casserole and add the duck fat and bay leaves. Bring to a simmer over a medium heat. Cover with the lid and transfer to the oven for 2½ hours.", "For the spiced lentils, add the butter and oil to a frying pan. Once hot, add the bacon lardons and cook until golden-brown and crisp. Add the onion and cook for 2 minutes, then add the garlic, carrot, celery and spices and cook for a further 2 minutes.", "Stir in the lentils and red wine and bring to the boil, cook until the wine has reduced in volume by half, then add the stock and cook for 25-30 minutes, or until the lentils are tender. Finish with the sherry vinegar and fresh coriander.", "For the mashed potato, place the potatoes in a large pan of salted water and bring to the boil, cook for 15-20 minutes or until tender.", "Drain the potatoes then mash well or pass through a potato ricer. Stir in the milk, cream and butter and mix until smooth.", "To serve, heat a frying pan and add the butter. Once hot, add the drained duck legs and colour on both sides. Add the honey to the pan and glaze the duck with the pan juices. ", "Put a spoonful of lentils on each serving plate and place a duck leg on top. Serve the mashed potato alongside. Finish with the warm jus or reduced stock."]}, {"isVegetarian": false, "title": "Honey-glazed guinea fowl with pomegranate and pineapple", "url": "www_bbc_co_uk_food_recipes_honey-glazed_guinea_fowl_24715", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey-glazed_guinea_fowl_24715_16x9.jpg", "ingredients": ["1kg/2lb 4oz oven-ready guinea fowl ", "2 tbsp sunflower oil", "½ tsp dried crushed chilli", "½ tsp Chinese five-spice powder", "½ tsp flaked sea salt", "freshly ground black pepper", "1 large ripe pineapple, around 1kg/2lb 4oz", "½ cucumber", "½ large pomegranate", "2 tbsp clear honey", "1 tbsp dark soy sauce", "50g/1¾oz bunch fresh coriander", "25g/1oz bunch fresh mint ", "½ small red onion", "1 large lime, juice only", "banana leaf, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C (fan)/Gas 6. To prepare the guinea fowl, turn the bird onto its breast on a sturdy chopping board and cut carefully on either side of the backbone with good scissors or poultry shears. Discard the bone. Cut off the end of the foot joints and wing tips and discard.", "Open the guinea fowl out and place on the board so that the breast side is facing upwards. Press down heavily with the palms of your hands to break the breastbone and flatten the bird as evenly as possible. This will help it cook more quickly. ", "Drizzle a baking tray with one tablespoon of the oil and place the guinea fowl on top. Rub all over with the remaining oil and tuck in the legs and wings. ", "Mix the crushed chillies, five-spice, sea salt and lots of freshly ground black pepper in a small bowl. Sprinkle over the guinea fowl and rub into the skin with your hands. Roast the guinea fowl for 20 minutes.", "While the guinea fowl is cooking, put the pineapple on a board and cut off the top and bottom. Remove the prickly skin with a sharp knife and dig out any ‘eyes’ with the tip of your knife. Cut the pineapple lengthways into sixths and remove the central core. Cut the pineapple into roughly 1.5cm/¾in triangle slices and put in a bowl.", "Peel the cucumber and cut lengthways in half. Cut into 1cm/½in slices and add to the pineapple. Bash the back of the pomegranate with a wooden spoon to dislodge the seeds – you may need to help some of them out with a knife or spoon. Put the seeds and any juice in a bowl. Mix the honey and soy sauce in a small bowl. ", "Take the bird out of the oven and brush with the honey mixture. Return to the oven for a further 10-15 minutes, or until thoroughly cooked, golden-brown and glossy. (The juices should run clear when the thickest part of one of the thighs is pierced with a skewer.) While the bird continues to roast, trim the coriander and discard the stalks. Pick the leaves off the mint stalks. Peel and finely slice the red onion. Put the herbs and onion to one side. ", "Transfer the guinea fowl to a board and leave to rest for a few minutes while the dressing is made. Tip the contents of the baking tray into a heatproof bowl and leave to stand for five minutes. Carefully spoon off any fat that has risen to the surface with a spoon. ", "Stir the fresh lime juice into the pan juices, just a little at a time, tasting between additions. You want the dressing to be tangy but not sour. Season the dressing with a little salt and pepper and an extra dash of soy sauce if you like.", "Carve the guinea fowl into chunky pieces and arrange on a clean banana leaf, or large serving platter, with the pineapple and cucumber. Scatter the herbs and onion on top. Sprinkle with the pomegranate seeds and any juice and toss very lightly together. Drizzle over the lime dressing and serve immediately while the guinea fowl is warm."]}, {"isVegetarian": true, "title": "Honey and grapefruit polenta cake", "url": "www_bbc_co_uk_food_recipes_honey_and_grapefruit_24386", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter, softened, plus extra for greasing tins", "150g/5½oz ground almonds", "70g/2½oz polenta", "80g/3oz plain flour", "1 tsp bicarbonate of soda ", "140g/5oz honey", "1 large red grapefruit, finely grated zest only", "2 large free-range eggs", "200g/7oz red grapefruit juice", "200g/7oz blood orange juice", "160g/5¾oz clear honey", "1 red grapefruit", "1 orange", "100g/3½oz maple syrup", "250g/9oz mascarpone"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the cake, preheat the oven to 170C/150C Fan/Gas 3.", "Line the base of a deep 20cm/8in round tin with baking parchment and grease with butter.", "Combine the almonds, polenta, flour and bicarbonate of soda in a bowl and set aside.", "In a free-standing mixer, beat the butter until smooth, then add the honey and grapefruit zest.", "Gradually beat in the eggs and reserved dry ingredients. Pour the batter into the tin and bake for approximately 30 minutes.", "For the citrus syrup, mix the grapefruit and orange juice and honey in a saucepan and heat gently until the honey has melted. Bring to the boil and simmer until temp reaches 105C on a sugar thermometer. Remove from the heat.", "Once the cake is baked, set it aside to cool. Prick the surface of the cake with a skewer and drizzle with half the citrus syrup.", "For the candied peel, boil a kettle full of water. Use a potato peeler to remove slices of the citrus fruit skin.", "Add the peel to a saucepan and cover with boiling water. Boil for 2 minutes, then remove the peel and discard the water. Repeat this process twice until the bitterness has been removed from the peel.", "Add the remaining citrus syrup to a saucepan. Add the peel and cook for 5-10 minutes until translucent. Set aside to cool.", "For the maple cream, heat the maple syrup in a small pan and boil until reduced by half. Set aside to cool. Beat the mascarpone until smooth, then add the reduced maple syrup.", "To assemble the cake, cover with the maple cream and arrange the candied peel on top."]}, {"isVegetarian": false, "title": "Sticky chicken", "url": "www_bbc_co_uk_food_recipes_honey_chicken_39457", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_chicken_39457_16x9.jpg", "ingredients": ["6 chicken legs", "6 tbsp tomato ketchup", "2 tbsp tomato purée", "2 tbsp grainy mustard", "3 tbsp Worcestershire sauce", "2 tbsp runny honey", "1 garlic clove, crushed"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Using a sharp knife, make shallow slits in the top of the chicken legs, and arrange in a shallow dish.  ", "Measure all the ingredients for the marinade together in a bowl and stir until combined. Pour over the chicken and toss to coat. Cover and place in the fridge for at least 30 minutes.", "Preheat the oven to 220C/200 Fan/Gas 7.", "Line a roasting tin with baking paper, and sit the chicken legs on top, in a single layer. Spoon over the marinade and roast for 35-40 minutes, or until sticky, golden-brown and cooked through. Serve hot."]}, {"isVegetarian": false, "title": "Honey confit of duck with Puy lentils", "url": "www_bbc_co_uk_food_recipes_honey_confit_of_duck_58484", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 duck legs", "15g/½oz table salt per kilo of duck legs", "2 tsp thyme leaves", "2 tsp finely chopped rosemary", "2 garlic cloves, finely chopped", "600ml/20fl oz duck fat", "2 bay leaves", "2 tbsp olive oil", "4 tbsp honey", "50g/1¾oz unsalted butter", "2 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely sliced", "1 small carrot, finely chopped", "1 stick celery, finely chopped", "¼ leek, finely chopped", "300g/10½oz Puy lentils", "175ml/6fl oz red wine", "450ml/16fl oz beef stock", "2 tbsp good sherry vinegar", "2 tbsp chopped fresh coriander", "4 slices pancetta, cooked"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the honey confit of duck, preheat the oven to 140C/275F/Gas 1.", "Mix the salt, herbs and garlic in a bowl with the duck legs to coat them. Cover the bowl and leave for 24 hours in the fridge.", "Rinse the duck legs and wash the salt mix off the duck. Place in an ovenproof saucepan with a lid and add the duck fat and bay leaves.", "Bring to a simmer, then put the lid on and cook in the oven for 2½ hours. Remove the duck from the fat and set aside.", "For the Puy lentils, heat a sauté pan or a large frying pan then add the butter and oil. Once hot, add the onion and cook for two minutes. Add the garlic, carrot, celery and leek and cook for a further two minutes.", "Add the lentils and red wine and bring to the boil. Cook until the wine has reduced by half then add the stock and cook the lentils for 25-30 minutes. Mix in the sherry vinegar and coriander.", "To finish the duck legs, heat the oil in a frying pan, once hot add the honey. Cook the duck legs in the honey for two minutes basting the legs all the time.", "To serve, place a pile of the lentils on the plate with a leg next it, and crumble the cooked pancetta on top of the lentils."]}, {"isVegetarian": false, "title": "Honey glazed lamb and celeriac mash", "url": "www_bbc_co_uk_food_recipes_honey_glazed_lamb_and_27790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large spring onions, roughly chopped ", "2 tomatoes, roughly chopped", "1 bunch chives, chopped ", "1 bunch mint ", "1 bunch oregano", "1 shoulder salt marsh lamb ", "100ml/3½fl oz olive oil ", "1 bottle dry white wine  ", "salt and freshly ground black pepper ", "3 tbsp honey ", "1 bunch thyme, leaves picked ", "500g/1lb 2oz potatoes, peeled and cut into 2cm/ ¾in cubes", "500g/1lb 2oz celeriac, peeled and cut into 4cm/1½in cubes", "100g/3½oz slightly salted butter, diced ", "100g/3½ oz smoked cheese, grated ", "salt and freshly ground black pepper ", "splash of single cream", "pinch nutmeg, freshly grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, preheat the oven to 140C/275F/Gas 1. ", "Place the spring onions, chopped tomatoes, chives, mint and oregano in a deep roasting tin.  Place the lamb on top and drizzle with olive oil and the white wine.  Season to taste with salt and freshly ground black pepper. Cover tightly with aluminum foil.  ", "Place in the oven and cook for 3-4 hours, or until the meat is very tender. Once cooked, remove the lamb from the tin and set aside to cool. Leave the vegetables and herbs in the tray to cool.", "For the celeriac mash, bring a pan of salted water to the boil. Add the potatoes and celeriac and cook for 15-20 minutes, or until tender. Drain and mash until smooth using a potato ricer or masher. Add the butter and cheese, season with salt and freshly ground black pepper, then whisk in a splash of cream. Grate in a pinch of nutmeg. Set aside somewhere warm until ready to serve. ", "Preheat the oven to 180C/350F/Gas 4.", "For the lamb, make a sauce. Remove most of the herbs from the bottom of the roasting tin. Place the remaining contents of the roasting tin in a blender, scraping off any bits from the bottom of the tin. Blend to a purée and keep warm.", "Mix the honey and three quarters of the thyme together. Brush over the lamb. Cut the lamb into bite-sized pieces and sprinkle over a little more thyme. Place on a baking tray and cook in the hot oven for 10 minutes, or until golden-brown.", "To serve, reheat the sauce and mash (if necessary). Place a scoop of mash on each plate and top with the lamb. Drizzle the sauce over."]}, {"isVegetarian": false, "title": "Honey mousse with port jelly and fresh raspberries", "url": "www_bbc_co_uk_food_recipes_honey_mousse_with_port_51340", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_mousse_with_port_51340_16x9.jpg", "ingredients": ["320ml/11fl oz milk ", "4 free-range eggs, yolks only\t\t ", "100g/3½oz caster sugar\t\t\t\t\t\t\t ", "60g/2¼oz  honey\t\t\t\t\t\t\t\t", "2½ leaves gelatine", "250ml/9fl oz double cream, whipped to stiff peaks", "90g/3oz sugar", "90ml/3fl oz port", "2 leaves gelatine ", "fresh figs, sliced into quarters"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the milk to a simmer in a saucepan.  Whisk the egg yolks and caster sugar in a bowl until pale and frothy, then add the honey and slowly whisk in the warm milk.  Stand the bowl over a pan of simmering water (ensure the bowl does not touch the water) and gently cook, whisking continuously until thickened and the mixture coats the back of a spoon.", "Soften the gelatine leaves in a little cold water for five minutes, wring out the excess water and stir the gelatine into the custard until dissolved.  Pass the custard through a fine sieve into a clean bowl and chill in the refrigerator.  When the custard is almost set (about an hour) fold in the whipped cream.  ", "For the port jelly, mix the sugar and port in a saucepan and boil until the sugar has dissolved. Soften the gelatine leaves in a little water for five minutes, wring out the excess water and stir the gelatine into the hot liquid until dissolved.  Pass the jelly through a fine sieve into a bowl and allow to cool but not set.", "To assemble, seal the bottom of six ring moulds with clingfilm. Spoon the mousse into the moulds, leaving space at the top to add the port jelly. Refrigerate until set (at least 1½ hours). Pour the jelly on top of the mousse. Refrigerate until set (about one hour).", "To serve, suspend the moulds in hot water for 30 seconds then carefully remove the clingfilm. Place each mousse onto a plate.  Place a few raspberries on top of the mousse and drizzle a little honey over the top. Arrange the fig slices around the mousse."]}, {"isVegetarian": false, "title": "Honey mustard and garlic spatchcock chicken with sweet potato and mint mash", "url": "www_bbc_co_uk_food_recipes_honey_mustard_and_garlic_02558", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_mustard_and_garlic_02558_16x9.jpg", "ingredients": ["1 large chicken (about 1.8kg/4lb)", "4 garlic cloves, thinly sliced", "2 tsp sunflower oil", "flaked sea salt and freshly ground black pepper", "4 tbsp Dijon mustard", "2 squidges clear honey (to taste)", "½ tsp hot chilli powder", "a few sprigs fresh thyme, leaves picked and roughly chopped, plus extra sprigs to garnish ", "1kg/2lb 4oz sweet potatoes (or potatoes), peeled and cut into large chunks ", "25g/1oz unsalted butter", "1 bunch spring onions, trimmed and finely sliced", "½ bunch mint, leaves picked and roughly torn", "3 tbsp plain flour", "½ glass white wine (about 75-100ml/2½-3½fl oz)", "500ml/18fl oz good liquid chicken stock"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/450F/Gas 8 (220C fan).", "Place the chicken breast-side down on a chopping board and using a good pair of scissors cut along each side of the backbone to remove it, cutting through the ribs as you go. Then turn it over and flatten the breast down with the heel of your hand. There will be a small crack which means the bird will then be nice and flat. Then put the bird, breast-side up in a roasting tin. ", "Use the tip of a small sharp knife to put enough slits all over the breast and legs as there are garlic slices and then push the garlic slices into them. Drizzle with the oil, season well with salt and pepper and then pop into the oven for 30 minutes to get some colour on the skin. ", "Meanwhile, mix the mustard, honey, chilli powder and thyme leaves together in a small bowl and set aside. ", "After 30 minutes of cooking, pull the bird out of the oven and reduce the oven temperature to 200C/400F/Gas 6 (180C fan). To help cool the oven down quickly, you can open the oven door and once the thermostat’s red light comes back on shut it. Meanwhile, smear the chicken with the mustard mixture using the back of a spoon. Once the temperature is correct, pop the chicken back into the oven for a further 15 minutes.", "Meanwhile, for the sweet potato and mint mash, boil the sweet potatoes for about eight minutes or so (depending on the size of the chunks), or until the potatoes are just tender but not too soft. A couple of minutes before they are ready, melt the butter in a small frying pan on a medium heat and cook the spring onions for two minutes, stirring until softened. Drain the cooked potatoes well and then mash well with a masher. Stir in the spring onions and butter and season well with salt and pepper. Pop a lid on to keep it warm. ", "To check that the chicken is cooked, insert a sharp knife into the thickest part of the leg, then press the knife down a bit. If the juices run clear, and are not pink, then the chicken is cooked. Once cooked, lift the chicken out of the tray and place on a warmed platter or board and cover with aluminium foil to keep warm. ", "For the gravy, holding the roasting tin with an oven cloth, tip it up until all the fat and juices run to one corner. Spoon off as much fat as possible and discard. You should be left with around three tablespoons of juices in the bottom of the tin. Pop it on the hob over a low heat and stir in the flour until well blended. Add the wine and stock a little at a time, stirring all the time so that it does not go lumpy. Once all the liquid is added, bring the mixture to the boil and cook for 2-3 minutes, or until thickened, stirring regularly. Pour through a fine sieve into a warmed jug and season to taste with salt and pepper.", "Carve the chicken, arrange the slices on a large serving platter and garnish with fresh thyme sprigs. Spoon the sweet potato mash into a serving bowl and scatter the mint over. Serve at once with the hot gravy."]}, {"isVegetarian": false, "title": "Honey mustard chicken with avocado and tomato salsa and hummus sauce", "url": "www_bbc_co_uk_food_recipes_honey_mustard_chicken_09043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large skinless and boneless chicken breasts", "6 tbsp wholegrain mustard", "2 tbsp clear honey", "2 lemons, juice only", "freshly ground black pepper", "2 tbsp rapeseed oil", "8 warm pitta breads ", "2 large ripe avocados, stoned, peeled and diced (1cm/½in cubes)", "1 lime, juice only", "2 shallots, finely chopped", "8 cherry tomatoes, quartered", "1 large red chilli, seeds removed, finely chopped", "1 garlic clove, finely chopped", "pinch sugar", "1 tbsp extra virgin olive oil ", "salt and freshly ground black pepper", "410g/14oz can chickpeas, drained and rinsed", "4 tbsp tahini paste", "2 garlic cloves, roughly chopped", "1 lemon, juice only", "8 tbsp extra virgin olive oil", "3 tbsp Greek yoghurt", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, cut the chicken breasts into finger-length strips. ", "In a bowl, combine the mustard, honey and lemon juice. Add the chicken strips to the mixture and season with black pepper.", "Heat the rapeseed oil in a wok or large frying pan until very hot. Add the chicken strips and and stir-fry for 5-6 minutes, or until golden-brown and cooked through. ", "For the avocado and tomato salsa, place the diced avocado in a bowl and squeeze over the lime juice.", "Add the remaining ingredients to the bowl and season with a little salt and lots of freshly ground black pepper", "For the hummus sauce, place the chickpeas, tahini paste and garlic in a food processor and blend until smooth. Add the lemon juice, olive oil and two tablespoons of water. ", "Blend again until very smooth. Stir in the yoghurt and season generously with salt and pepper.", "Serve the chicken with the warm pitta breads, avocado and tomato salsa and hummus sauce. "]}, {"isVegetarian": true, "title": "Honey, pears and madeleines", "url": "www_bbc_co_uk_food_recipes_honey_pears_and_91279", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz unsalted butter, plus 1 tbsp melted butter for brushing", "2 tbsp honey", "2 large free-range eggs", "55g/2oz caster sugar", "2 tsp soft brown sugar", "1 vanilla pod, seeds only", "pinch salt", "85g/3oz plain white flour, plus extra for dusting", "½ tsp baking powder", "55g/2oz butter", "2 pears, peeled and cut into small dice", "2 tbsp honey", "150ml/5fl oz sweet white wine"], "serves": "Makes 12 madeleines", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a heavy-based saucepan, melt the 85g/3oz butter and 2 tablespoons honey together gently, then set aside.", "Put the eggs in a large bowl, then add the caster sugar, brown sugar, vanilla seeds and salt. Whisk until doubled in size.", "Sieve together the flour and baking powder. Carefully fold the flour into the egg mixture using a large metal spoon.", "Gently pour the melted butter and honey down the side of the bowl and carefully fold it in. Cover with cling film and chill in the fridge for 30 minutes.", "Meanwhile, preheat the oven to 220C/425F/Gas 7. Brush 12 madeleine moulds with a little melted butter, then dust them with flour.", "Put the batter into a piping bag with a 1.5cm/½in plain nozzle fitted. Pipe a fat, solid line down the centre of each mould, being careful not to overfill it.", "Bake for 5-8 minutes, depending on size, until golden-brown. Keep your eye on them as they cook quickly. Take the madeleines out of moulds immediately and set aside to cool on a wire rack.", "Meanwhile, for the pears, melt the butter in a saucepan, add the pears and then the honey and wine. Poach for 5-10 minutes, or until the pears are just cooked, then remove from the pan using a slotted spoon and put to one side. ", "Increase the heat and reduce the cooking liquor down in volume until it becomes a syrup. Return the pears to the pan to coat them in the syrup. Serve the pears with the madeleines."]}, {"isVegetarian": false, "title": "Honey, feta and thyme pancakes", "url": "www_bbc_co_uk_food_recipes_honey_feta_and_thyme_77232", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_feta_and_thyme_77232_16x9.jpg", "ingredients": ["2-3 tbsp clear honey", "100g/3½oz feta", "2-3 sprigs thyme, leaves picked", "4 pancakes, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the pancakes on serving plates and crumble over the feta.", "Drizzle with honey and scatter the thyme leaves over the top.", "Serve hot or cold."]}, {"isVegetarian": false, "title": "Honey mustard beetroot gravad lax", "url": "www_bbc_co_uk_food_recipes_honey_mustard_beetroot_96264", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large cooked beetroot, quartered", "2 good handfuls fresh dill, roughly chopped", "6 tbsp sea salt ", "2 tbsp freshly ground black pepper", "140g/5oz caster sugar", "1 tbsp runny honey", "1 tbsp wholegrain mustard", "2 x 200g/7oz salmon fillets", "Swedish crisp bread, to serve", "watercress sprigs, to serve", "fresh dill sprigs, to serve", "2 tbsp caster sugar", "2 tbsp cider vinegar", "½ tsp sea salt", "½ small shallot, very thinly sliced", "½ cucumber, thinly sliced", "200g/7oz crème fraîche", "good handful fresh dill, finely chopped", "½ lemon, juice only", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Put the beetroot in a food processor and blend to a smooth purée. Tip it into a bowl, then add the dill, sea salt, pepper, sugar, honey and mustard and mix well. ", "Lay out a large piece of cling film and sprinkle with one-third of the beetroot mixture. Put one piece of salmon, skin side-down, on the mixture. Top with half the remaining mixture, then put the second salmon fillet on top, flesh side-down. Sprinkle with the remaining mixture. Wrap the salmon tightly with the cling film.", "Put the wrapped parcel in a high-sided dish and weigh it down with a plate and some full food tins. Leave the salmon to cure in the fridge for five days, turning halfway through.", "The day before serving, make the pickle. Put the sugar and vinegar in a bowl and stir until the sugar has dissolved. Mix in the salt and shallot, then the cucumber. Cover with cling film and chill in the fridge for 2 hours, or overnight if you have the time.", "For the dill crème fraîche, put the crème fraîche, dill, lemon juice and black pepper in a bowl and mix well. Cover with cling film and chill in the fridge for at least for 2 hours, or overnight.", "When you are ready to serve, unwrap the salmon and wipe it clean. Separate the sides and slice thinly using a large, sharp knife. Put the Swedish crisp bread on a serving plate and top with the slices of salmon and dollops of the dill crème fraîche and a small amount of cucumber pickle. Garnish with the watercress and dill to serve."]}, {"isVegetarian": false, "title": "Honey roast chicken with outstanding roasties", "url": "www_bbc_co_uk_food_recipes_honey_roast_chicken_with_00451", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2lb 10oz chicken", "6 tbsp honey", "50g/1¾oz fresh root ginger, chopped", "1 tsp turmeric", "1 tsp ground cinnamon", "3 tbsp light soy sauce", "2 tbsp lime juice", "3 tbsp cold-pressed rapeseed or olive oil", "salt and freshly ground black pepper", "1-1.2kg/2lb 4oz-2lb 10oz floury potatoes, peeled and cut roughly into 5cm/2in chunks", "100ml/3½fl oz rapeseed oil or vegetable oil", "2 tsp dried sage", "1 tsp chilli powder", "1 tsp vegetable bouillon powder", "¼ tsp garlic powder (optional)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["In a blender or mini food-processor, blend together all of the marinade ingredients to a fine paste. Taste and adjust the seasoning to taste.", "Pat the chicken dry with kitchen paper. Put it in a dish and rub the marinade all over it and if time allows let it rest for an hour or so in the fridge. ", "Preheat an oven to 180C/350F/Gas 4.", "Put the chicken in a roasting tin and baste with the marinade, reserving any extra. Bake the chicken for one hour. Cover the chicken loosely with aluminium foil after the first 10-15 minutes or  the honey in the marinade will burn. Baste the chicken a few times during cooking, adding some of the reserved marinade if it starts to look dry.  ", "To cook the potatoes, preheat an oven to 220C/425F/Gas 7. Put the prepared potatoes in a pan of salted water, bring to the boil, then reduce the heat and simmer for seven minutes. Meanwhile, pour the oil into a large roasting tin and put into the oven for five minutes until hot. ", "Drain the potatoes well, allow to steam, then return to the pan in which the were cooked. Cover the pan and shake the potatoes about – you want to bash up their edges but not break them up. Gently transfer them to the hot roasting tin, turn them about in the hot oil and sprinkle with salt. Roast on the top shelf for 30 minutes, then turn them and roast for a further 20–30 minutes or until crisp and golden-brown.", "After the chicken has been roasting for an hour, check whether it is cooked. (The meat is cooked when a thin skewer or a thick needle inserted in the thigh joint produces a clear liquid.) Transfer to a serving dish, cover the chicken with foil and allow it to rest for five minutes before you carve it.", "Meanwhile, strain the liquid from the roasting tin into a small pan, adjust the seasoning to taste and keep warm.", "Mix together the sage, chilli powder, bouillon powder and garlic powder if using, to make a spice mix. Remove the potatoes from the oven, set them on a plate lined with kitchen paper, and sprinkle over the spice mix. ", "Joint and serve the roast chicken alongside the roast potatoes, drizzled with the juices from the roasting pan."]}, {"isVegetarian": true, "title": "Honey roast parsnips", "url": "www_bbc_co_uk_food_recipes_honey_roast_parsnips_80898", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_roast_parsnips_80898_16x9.jpg", "ingredients": ["500g/1lb 2oz parsnips, peeled and cut into quarters lengthways", "4 tbsp sherry", "4 tbsp clear honey", "salt and freshly ground black pepper"], "serves": "Serves 6-8 as part of a roast dinner, or 4 as a stand-alone side dish", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the parsnips, sherry and honey into a baking tray and mix to coat the parsnips. Season with salt and freshly ground black pepper. ", "Roast in the oven for 20 minutes, turning half way through, until the parsnips are tender and golden-brown."]}, {"isVegetarian": false, "title": "Honey roast ribs with anise", "url": "www_bbc_co_uk_food_recipes_honey_roast_ribs_with_64823", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_roast_ribs_with_64823_16x9.jpg", "ingredients": ["6 tbsp thickish honey", "3 heaped tbsp oyster sauce ", "¼ tsp chilli flakes ", "4 whole star anise ", "¼ tsp salt", "¼ tsp black peppercorns ", "4 cloves garlic ", "1.5kg/3lb 5oz meaty pork ribs"], "serves": "Serves 2-3", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["To make the marinade, spoon the honey and oyster sauce into a roasting tin or baking dish. Add the chilli flakes, star anise and salt. Grind the peppercorns and add them to the marinade.", "Toss the ribs in the marinade and tuck the garlic cloves whole between the ribs, then set aside for at least 2 hours. It wouldn’t hurt if they stay there overnight.", "Roast the ribs at 160C/325F/Gas 3 for 90 minutes, turning them in their sauce from time to time.", "Then turn the heat up to 200C for 15 minutes, Keep an eye on them, as sometimes they burn easily. They are ready when the meat is tender, though far from falling off the bone, and the ribs are sticky and almost charred."]}, {"isVegetarian": false, "title": "Honey roast duck with cabbage, smoked bacon, roast garlic, girolle mushrooms and spiced jus", "url": "www_bbc_co_uk_food_recipes_honey_roast_duck_with_20554", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz duck carcasses, chopped into small pieces", "5g Chinese five-spice powder", "1 large onion, cut into thick rings ", "½ garlic bulb", "15g/½oz fresh thyme leaves ", "700ml/1¼ pint chicken stock ", "100g/3½oz clear honey ", "50ml/1¾fl oz sherry vinegar ", "300ml/10½fl oz veal stock", "5g white peppercorns ", "50ml/1¾fl oz cream ", "2g salt ", "4 x 180g/6oz duck breasts, chilled in the refrigerator", "salt and pepper", "vegetable oil, for frying", "12 garlic cloves, peeled and left whole", "2 tbsp clear honey mixed with pinch of Chinese five-spice powder ", "1 tbsp butter", "½ celeriac, peeled, finely chopped and blanched ", "350g/12oz savoy cabbage, sliced", "4g finely chopped shallots", "40g/1½oz unsalted butter", "40g/1½oz smoked back bacon, chopped", "20g/¾oz garlic purée", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "80g/3¾oz girolle mushrooms "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 4.", "For the duck sauce, place the duck carcasses in a roasting tray and cook in the oven for 20-30 minutes. Just before they finish roasting, sprinkle the bones with the Chinese five-spice. ", "Remove the carcasses from the oven and place over a low heat on the hob. Add the onions and garlic. Cook until the onions are translucent and just starting to colour. Add the thyme. ", "Remove the bones and set them aside to cool. Deglaze the roasting tin with the chicken stock. Set aside", "In a saucepan, bring the honey to a rolling boil and cook for three minutes (be careful not to burn the honey as it will make the sauce bitter). Add the vinegar and cook until the volume of liquid has reduced by a third. ", "Add the cooled duck carcasses and chicken stock to the pan, along with the veal stock, peppercorns and cream. Bring to the boil and skim off the scum from the surface. Reduce the heat to a simmer and cook for 30 minutes. ", "Strain the sauce through a colander and then pass through a fine sieve to remove any fragments of bone. Return to the pan, bring to the boil and cook until reduced to a sauce consistency. Season with salt. ", "For the duck breasts, using a sharp knife score the fatty skin of the duck breast in a criss-cross pattern, but be careful not to cut the meat. Season with salt and pepper.", "Heat a little oil in a heavy-bottomed frying pan and add the duck breasts skin-side down. Cook at a fairly high temperature so that the skin renders out the fat, but take care not to burn the skin. ", "When the skin is golden-brown and crisp, turn the breast over and cook the other side for a minute before returning it once more to its skin side. Crisp the skin a little more before turning the breast onto its other side again and finish cooking to your liking. ", "Meanwhile, put the garlic cloves in a pan of cold water and bring to the boil, refresh in cold running water and repeat twice more.", "Once the duck is cooked, remove it from the pan and brush the honey and five-spice over the crisp skin. Set aside in a warm place to rest before serving. ", "Place the garlic cloves in a heavy-bottomed pan with a little butter and season with salt and pepper. Cook slowly until soft and lightly golden-brown then add the blanched celeriac into the pan to warm through. ", "For the savoy cabbage, add the cabbage to a pan of boiling salted water and cook until tender (about 3-4 minutes). Refresh in ice-cold water. Drain well and pat dry. ", "In a frying pan, gently fry the finely chopped shallots in the butter until translucent, then add the smoked bacon. Add the cooked cabbage and cook until dry and the bacon is crisp. Stir in the garlic purée and season, to taste, with salt and pepper. ", "To serve, heat the butter small frying pan and, once hot, add the mushrooms and gently fry for a minute.", "If necessary, reheat the duck in a low oven for a few minutes, and then slice thinly. Place the cabbage down the middle of the serving plates and place the duck on top. Add the celeriac and garlic around the outside of the duck and then pour over the sauce. "]}, {"isVegetarian": false, "title": "Honey roasted duck confit with Puy lentils, mashed potatoes and celery leaves", "url": "www_bbc_co_uk_food_recipes_honey_roasted_duck_49176", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz sea salt ", "2 tsp finely chopped thyme leaves", "2 garlic cloves, finely chopped", "4 duck legs", "600ml/20fl oz duck fat", "2 bay leaves", "2 tbsp olive oil", "4 tbsp honey", "4 tbsp celery leaves, to garnish ", "2 tbsp rapeseed oil", "100g/3½oz pancetta, diced", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "1 small carrot, finely chopped", "1 stick celery, finely chopped", "¼ leek, finely chopped", "300g/10½oz Puy lentils", "175ml/6fl oz red wine", "450ml/16fl oz veal jus or stock", "2 tbsp good-quality sherry vinegar", "2 tbsp chopped fresh parsley", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "125g/4½oz butter", "125ml/4fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 140C/120C Fan/Gas 1.", "Mix the salt, thyme and garlic in a large bowl. Coat the duck legs with the mixture then place on a tray with any remaining mixture on top and underneath. Refrigerate for 24 hours. Rinse the duck legs under cold running water to wash away the salt mixture. ", "Place the duck in a flameproof casserole with a lid and add the duck fat and bay leaves. Bring to a simmer, then put the lid on and cook in the oven for 2½ hours. Remove the duck from the fat and set aside. Discard the fat.", "For the Puy lentils, heat the oil in a sauté pan or a large frying pan. Once hot, add the pancetta and shallot and cook for 2 minutes. Add the garlic, carrot, celery and leek and cook for a further 2 minutes.", "Add the lentils and red wine and bring to the boil. Cook until the volume of liquid has reduced by half. Add the stock and cook for 25-30 minutes. When the lentils are tender, stir in the sherry vinegar and parsley.", "Place the potatoes in a large pan of salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.", "Drain and return the potatoes to the pan. Place over the heat for a minute to drive off any excess moisture. Pass through a potato ricer or mash thoroughly until smooth. Stir in the butter and cream, beating until smooth.", "To finish the duck confit, heat the olive oil in a frying pan. Once hot, add the honey and the duck legs. Cook the duck for 2 minutes on each side, basting all the time.", "Divide the lentils and mashed potatoes between serving plates. Serve the duck legs on top of the Puy lentils and garnish with celery leaves."]}, {"isVegetarian": true, "title": "Honey tea loaf", "url": "www_bbc_co_uk_food_recipes_honey_tea_loaf_48060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "100g/3½oz mixed dried fruit", "70ml/2¾fl oz decaffeinated tea, cooled until tepid", "1 heaped tsp honey", "1 free-range egg, beaten", "150g/5oz plain flour", "1 tsp baking powder", "½ teaspoon mixed spice"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a loaf tin with vegetable oil.", "Place the dried fruit into a large mixing bowl and pour over the warm tea. Stir in the honey.", "Beat the egg and whisk it into the tea mixture using a fork. (Make sure that the tea is not too hot so that the egg doesn't curdle.)", "In a separate bowl, mix together the flour, baking powder and mixed spice.", "Add the dry ingredients to the wet ingredients and beat until the mixture is thick, sticky and well combined.", "Pour the cake mixture into the prepared loaf tin and place the tin onto a baking tray. Bake the tea loaf in the oven for 20-25 minutes, or until a skewer inserted into the centre comes out clean.", "Set the tea loaf aside to cool in the tin, then cut into thick slices."]}, {"isVegetarian": false, "title": "Honey and balsamic-glazed steak stir-fry", "url": "www_bbc_co_uk_food_recipes_honeyandbalsamicglaz_87023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint red wine", "2 tbsp balsamic vinegar", "1 tbsp olive oil", "85g/3oz steak, sliced thinly", "100g/3½oz green beans, trimmed", "½ carrot, peeled and cut into matchsticks", "2 tsp soy sauce", "1 tbsp clear honey", "1 tsp balsamic vinegar", "1 tsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the wine and vinegar in a small saucepan and simmer until the volume has reduced by half and the mixture has become sticky. Set aside to keep warm.", "For the stir fry, heat the olive oil in a wok and fry the steak for 2-3 minutes, or until browned.", "Add the green beans and carrot to the wok and stir fry for two minutes.", "Add the soy sauce, honey and balsamic vinegar to the wok and stir fry for a further 1-2 minutes, or until the vegetables are just tender.", "Stir in the sesame seeds.", "To serve, pile the stir-fry onto a serving plate and drizzle over the red wine and balsamic vinegar sauce."]}, {"isVegetarian": false, "title": "Honey and ginger-glazed ribs with pak choi tempura and mango salsa", "url": "www_bbc_co_uk_food_recipes_honeyandgingerglazed_86053", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 3-rib pork rack", "water, to cover", "1 sprig fresh rosemary", "1 sprig fresh thyme", "1 garlic clove, unpeeled ", "1 tsp sesame oil", "2 tbsp honey", "2.5cm/1in piece root ginger, peeled and grated", "2 tbsp soy sauce", "1 orange, juice only", "1 red chilli, chopped", "2 tbsp sesame seeds, for sprinkling", "300ml/½ pint vegetable oil, for deep frying", "small handful ice", "150g/5½oz self-raising flour", "85ml/3fl oz sparkling water", "2 small bulbs pak choi", "½ mango, peeled, stone removed, finely chopped", "2 tbsp chopped fresh coriander, plus extra, to garnish ", "1 tbsp balsamic vinegar", "2 tbsp olive oil", "1 tsp sesame seeds"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the ribs, place the ribs into a small saucepan and cover with boiling water. Add the rosemary, thyme and unpeeled garlic clove and bring to the boil. Boil for ten minutes, then drain and discard the water and herbs.", "For the glaze, place the sesame oil, honey, ginger, soy sauce, orange juice and chilli into a small pan and simmer for five minutes, or until reduced and sticky.", "Place the blanched ribs onto a baking sheet and brush with the glaze.", "Transfer to the oven and bake for 10-12 minutes, or until the pork is completely cooked through.", "Place the ribs onto a serving plate, pour over any remaining glaze and sprinkle with the sesame seeds.", "Meanwhile, for the pak choi tempura, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the ice and flour into a large bowl and gradually whisk in the sparkling water to make a batter the consistency of double cream.", "Dip the pak choi into the batter to coat, shaking off any excess, then carefully place into the hot oil. Deep fry for 4-5 minutes, or until crisp and golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the mango salsa, place all of the mango salsa ingredients into a small bowl and stir to combine.", "To serve, place the pak choi tempura onto the plate with the ribs. Sprinkle over the coriander and serve the mango salsa in a bowl alongside."]}, {"isVegetarian": true, "title": "Honey and lime tofu", "url": "www_bbc_co_uk_food_recipes_honeyandlimetofu_80570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ packet firm tofu, dried and cut into three 1cm/½in slices", "1 lime, zest and juice", "2 tsp honey", "1 garlic clove, sliced", "olive oil, to drizzle", "1 handful peanuts", "toasted bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the tofu in an ovenproof dish and then drizzle over the remaining ingredients.", "Place into the oven to bake for five minutes, or until cooked through.", "Serve with toasted bread."]}, {"isVegetarian": false, "title": "Honey and marmalade-glazed gammon joint", "url": "www_bbc_co_uk_food_recipes_honeyandmarmaladegla_93186", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeyandmarmaladegla_93186_16x9.jpg", "ingredients": ["6kg/13lb 3½oz gammon joint", "fresh orange juice, to cover", "water, to cover", "8 cloves, plus extra for studding the gammon", "2 onions, peeled, halved", "4 large bay leaves", "120g/4oz soft brown sugar", "3 oranges, zest of three, juice of two", "3 tbsp clear honey", "3 heaped tbsp orange marmalade", "3 tbsp wholegrain mustard", "apple compote", "pickled red cabbage"], "serves": "Serves at least 20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the gammon, place the gammon into a large, deep pan and cover with water. Bring to the boil, then remove from the heat and drain.", "Return the gammon to the pan, then pour in enough orange juice to cover half of the gammon. Pour in enough cold water to cover the gammon completely. ", "Push two cloves into each onion half and add to the pan along with the bay leaves. Cover with a lid and bring to the boil, then reduce the heat to a simmer. Cook gently for three hours, adding more hot water to the pan as necessary. ", "Preheat the oven to 180C/360F/Gas 4. ", "Remove the gammon from the pan and place into a roasting tin. Remove the skin, leaving behind a thin layer of fat. Score the gammon in a diamond pattern with the tip of a sharp knife. Stud the centre of each diamond with a clove. ", "For the glaze, mix together all of the glaze ingredients in a bowl until well combined. Spoon the glaze evenly over the gammon. ", "Roast the gammon in the oven for 45 minutes, basting frequently with the glaze and pan juices, until the gammon is cooked through and golden-brown all over. ", "Set aside to rest, then carve into thick slices to serve. Alternatively, the gammon can be eaten cold. Serve with apple compote and pickled red cabbage."]}, {"isVegetarian": true, "title": "Honey and mustard dressing", "url": "www_bbc_co_uk_food_recipes_honeyandmustarddress_1317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp French mustard", "1 tbsp honey", "1 clove garlic, peeled and crushed", "1 tsp balsamic vinegar", "2 tbsp cider vinegar", "6 tbsp sunflower oil", "salt and pepper, to taste"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the mustard, honey, garlic, balsamic and cider vinegar in a food processor and whiz together.", "With the motor still running, pour the oil in through a funnel.", "Season with salt and pepper and serve."]}, {"isVegetarian": false, "title": "Honey and mustard glazed chicken salad with pine nuts and goats' cheese", "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_67765", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large chicken breast, skinned and sliced into strips", "2 tbsp clear honey", "2 tsp grain mustard", "140g/5oz goats' cheese", "110g/4oz toasted pine nuts", "bunch of rocket", "balsamic vinegar", "olive oil", "salt and freshly ground pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the honey and grain mustard in a bowl, add the skinless, sliced chicken strips and make sure the chicken is well coated.", "Place the chicken strips in a hot char-grill pan and cook for 3-4 minutes on each side.", "Mix together one part balsamic vinegar, with 2 parts olive oil and some salt and pepper, dress the rocket leaves with the dressing.", "Place the rocket in the centre of the plate.", "Stack the chicken strips on top of the salad leaves, crumble the goat's cheese over the top and sprinkle with toasted pine nuts.", "Drizzle some honey around the outside of the salad and serve."]}, {"isVegetarian": false, "title": "Honey and mustard-glazed chicken with spicy potato wedges", "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_86102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 potato, cut into wedges", "½ tsp cayenne pepper", "½ tsp chilli flakes", "1 tbsp olive oil", "1 chicken breast, skin removed", "1 tsp balsamic vinegar", "1 tsp wholegrain mustard", "1 tsp honey", "sprig fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the potato wedges, heat the oil in an ovenproof frying pan, add the potato wedges and sprinkle over the spices. Fry the wedges, stirring frequently, until lightly browned on all sides.", "Transfer to the oven and bake for 15 minutes, or until golden-brown and tender.", "Meanwhile, for the chicken, heat the oil in another ovenproof frying pan and fry the chicken for 2-3 minutes on each side. Add the balsamic vinegar, mustard and honey and stir to coat the chicken.", "Transfer to the oven and bake for 8-10 minutes, or until the chicken is completely cooked through.", "To serve, place the chicken onto a serving plate with the potato wedges and garnish with parsley."]}]