[{"ingredients": ["450g / 1lb de hígado de pollo fresco", "100 g / 4 oz de hojas de ensalada mixtas (lechuga frisée, ramita de hojas de bebé y ramitas de berros)", "3 cucharadas de mantequilla clarificada", "sal y pimienta negra recién molida", "4 rebanadas gruesas de pan blanco", "3 cucharadas de mantequilla clarificada", "1 cucharada de vinagre de perry", "1 cucharadita de mostaza Dijon", "pizca de azúcar en polvo", "4 cucharadas de aceite de girasol", "1 cucharada de aceite de nuez", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas"], "method": ["Para la ensalada de hígado de pollo, retire el tendón de los hígados y, si los hígados son bastante grandes, córtelos por la mitad. Dejar de lado.", "Coloque las hojas de ensalada mixta sobre la base de un plato grande para servir.", "Para los crotones, quite las cortezas del pan y corte el resto en cubos de 1 cm / ½ pulgada.", "Caliente la mantequilla clarificada a fuego medio en una sartén. Agregue los cubos de pan y revuelva bien para cubrir la mantequilla. Freír durante 4-5 minutos, revolviendo con frecuencia, hasta que el pan esté dorado y crujiente. Escurrir sobre papel de cocina y reservar.", "Caliente la mantequilla clarificada para los hígados en una sartén grande de base pesada a fuego alto. Sazonar los hígados de pollo con sal y pimienta negra recién molida, luego freír durante 1-2 minutos en ambos lados, o hasta que los hígados estén dorados por todas partes, pero aún ligeramente rosa en el centro. Retirar del fuego y dejar enfriar un poco antes de colocar encima las hojas de la ensalada.", "Para el aderezo de vinagre de perry, regrese la sartén que se usa para cocinar los hígados al fuego y agregue el vinagre de perry, la mostaza y el azúcar. Revuelva bien con una cuchara de madera, raspando cualquier trozo dorado del fondo de la sartén. Transferir a un tazón pequeño.", "Agregue el aceite de girasol y nuez a la mezcla de vinagre de perry y sazone con sal y pimienta negra recién molida. Batir hasta que esté bien combinado, luego rociar el aderezo sobre la ensalada de hígado de pollo.", "Para servir, esparza sobre las cebolletas y los croutons y sirva mientras los hígados aún estén calientes."], "url": "www_bbc_co_uk_food_recipes_warmchickenliversala_962", "title": "Ensalada de hígado de pollo caliente con aderezo de vinagre de perry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "50g / 2oz de pechuga de pato ahumada, picada", "1 naranja, solo jugo", "1 cucharada de vinagre balsámico", "2 pequeñas hojas de lechuga Little Gem, desmenuzadas", "sal y pimienta negra recién molida", "50g / 2oz de avellanas tostadas, picadas"], "method": ["Calienta la mitad del aceite de oliva en una sartén. Freír el pato hasta que esté crujiente y dorado.", "Agregue el jugo de naranja, el vinagre balsámico y el aceite de oliva restante. Revuelva a través de la lechuga y sazone con sal y pimienta negra recién molida.", "Servir en un plato caliente y espolvorear sobre las avellanas picadas."], "url": "www_bbc_co_uk_food_recipes_warmduckandlettucesa_81166", "title": "Ensalada de pato y lechuga caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["290ml / ½ pinta de aceite de oliva virgen extra", "100ml / 3½fl oz de vinagre balsámico", "1 diente de ajo, en rodajas", "3 ramitas de tomillo fresco", "10 hojas de albahaca fresca", "2 pimientos rojos, cortados a la mitad, sin semillas", "2 pimientos amarillos, partidos por la mitad, sin semillas", "pimienta negra recién molida", "aceite de oliva, para lloviznar", "1 berenjena grande (o 2 pequeñas), picada en rodajas de 1 cm / ½", "1 calabacín grande (o 2 pequeños), picado en rondas de 1 cm / ½", "200g de registro de queso de cabra, cortado en rodajas gruesas de 1cm / ½ in", "aceite de oliva virgen extra", "albahaca fresca", "hojas de ensalada verde de su elección (por ejemplo, lechuga, espinaca baby, escarola, cos lechuga)"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Precaliente la parrilla a su nivel más alto.", "Para el adobo, coloque todos los ingredientes del adobo en un tazón grande y mezcle bien.", "Alinee una bandeja de asar grande con un trozo de papel de aluminio el doble del tamaño de la bandeja. Coloque los pimientos en la mitad de la lámina colocada en la lata de asar, sazone con pimienta negra recién molida y rocíe con aceite de oliva. Doble la otra mitad de la lámina para sellar los pimientos y colóquelos en el horno para asar durante 20 minutos, volteándolos de vez en cuando.", "Una vez que los pimientos estén cocidos y suavizados, colóquelos en un recipiente y cúbralos con una película adhesiva. Una vez que se haya enfriado, pele los pimientos y córtelos en triángulos grandes, pero parejos, y colóquelos en el adobo.", "Coloque el calabacín y las rodajas de berenjena en una bandeja para hornear. Rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida y coloque debajo de la parrilla caliente. Ase los dos lados durante 3-4 minutos o hasta que estén dorados. Retire del fuego y coloque en el adobo con los pimientos.", "Baje la parrilla a fuego moderado.", "Coloque las rondas de queso de las cabras en una bandeja para hornear y coloque debajo de una parrilla moderada. Grill durante 2-3 minutos, hasta que el queso se haya derretido y comience a dorarse.", "Para servir, coloca las hojas de ensalada en un tazón grande. Agregue los vegetales marinados y cubra con el queso de cabra a la parrilla. Rocíe con un poco del adobo y sirva."], "url": "www_bbc_co_uk_food_recipes_warmgoatscheesesalad_80782", "title": "Ensalada de queso de cabra caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/warmgoatscheesesalad_80782_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de queso de cabra, rebanado de un 'tronco'", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "½ limón, solo jugo", "gran puñado de perifollo, albahaca, perejil", "¼ papa grande, pelada, rallada", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, rocíe el queso de cabra con aceite de oliva y sazone con sal y pimienta negra recién molida. Calentar una sartén, agregar el queso de cabra y freír durante 1-2 minutos en cada lado hasta que estén dorados.", "Mezcle el jugo de limón, un chorrito de aceite de oliva, sal y pimienta negra recién molida en un tazón y agregue las hierbas, revolviendo bien para cubrir uniformemente.", "Para la patata rösti, rallar la patata en una toalla de té seca y exprimir el exceso de agua. Derrita la mantequilla en una sartén pequeña, agregue la papa rallada y presione hacia abajo con una espátula o espátula. Sazonar con sal y pimienta negra recién molida. Freír hasta que estén doradas por ambos lados, girando con cuidado.", "Para servir, amontone la ensalada de hierbas en un plato de servir, coloque el rösti de papa al lado de la ensalada y cubra con el queso de cabra caliente."], "url": "www_bbc_co_uk_food_recipes_warmgoatscheesesalad_88795", "title": "Ensalada templada de queso de cabra con crujiente patata rosti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 dientes de ajo", "gran puñado de perejil fresco de flatleaf, toscamente picado", "25 g / 1 oz de piñones", "50g / 2oz de queso parmesano recién rallado", "150ml / 5fl oz de aceite de oliva extra virgen", "sal y pimienta negra recién molida", "6 tomates de carne de vacuno, o 12-15 tomates de ciruela grandes", "450g / 1lb de calabacín", "sal y pimienta negra recién molida", "puñado de hojas de albahaca fresca, más extra para decorar", "450 g / 1 libra de queso feta griego, desmenuzado", "aceite de oliva, para lloviznar", "18 aceitunas negras Kalamata grandes", "6 rodajas de limón, para servir"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Para hacer el pesto, coloque el ajo y el perejil en un procesador de alimentos y mezcle. Con el procesador de alimentos todavía en funcionamiento, agregue los piñones, queso parmesano y aceite y mezcle hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Piel los tomates cortando una pequeña cruz en el fondo y colocándolos cuidadosamente en un recipiente resistente al calor con agua hirviendo durante unos 30 segundos. Retírelos con una cuchara ranurada y colóquelos en un recipiente con agua helada durante un minuto. La piel debe desprenderse fácilmente. Una vez pelado, corte los tomates al grosor de una moneda de una libra.", "Caliente una sartén hasta que fume. Cortar los calabacines con el mismo grosor que los tomates, sazonar con sal y pimienta negra recién molida y colocar en la sartén de la plancha para cocinar durante 2-3 minutos en cada lado, o hasta rayado con las marcas de la plancha.", "Para armar la ensalada, coloque seis anillos profundos de 10cm / 4in en una bandeja para hornear. Coloque una capa de tomates en la parte inferior de cada anillo. Sazone con sal y pimienta negra recién molida, luego espolvoree un poco de pesto.", "Agregue un par de hojas de albahaca para cubrir la capa de pesto, luego agregue una capa de queso feta.", "Agregue una capa de calabacín a la parrilla, luego repita las capas de tomate, pesto, albahaca, queso feta y calabacín.", "Cubra los montones con una capa de queso feta y rocíe cada uno con un poco de aceite de oliva.", "Transfiera al horno para hornear durante 10-12 minutos solo para calentar las pilas. (Luego puede colocar los anillos de los cocineros apilados debajo de una parrilla caliente para dorar el queso feta si lo desea).", "Para servir, coloque el anillo de cada chef en un plato y coloque tres aceitunas alrededor de cada pila. Con cuidado, retire los anillos de los chefs y adorne cada pila de ensalada griega con hojas de albahaca, rocíe con aceite de oliva y coloque una rodaja de limón al lado."], "url": "www_bbc_co_uk_food_recipes_warmgreeksaladwithpa_84442", "title": "Ensalada griega caliente con pesto de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85 g / 3 oz de judías verdes, recortadas", "1 cucharada de mantequilla", "1 cucharada de azúcar en polvo", "½ pera, sin corazón, pelado y rebanado", "½ zanahoria, pelada y rallada", "puñado de cilantro fresco, solo hojas", "30g / 1oz Brie, picado", "1 cucharada de aceite de oliva", "¼ de limón, cáscara y jugo"], "method": ["Ponga a hervir una olla de agua con sal y póngala en la lejía por dos minutos. Drene y enjuague con agua fría, luego drene nuevamente.", "Caliente la mantequilla y el azúcar impalpable en una sartén pequeña antiadherente hasta que el azúcar se haya derretido.", "Agregue la pera rebanada a la sartén y cocine durante dos minutos, o hasta que esté bien recubierta y caramelizada, pero manteniendo su forma.", "En un tazón, mezcle la zanahoria, las hojas de cilantro y Brie y mezcle las judías verdes blanqueadas.", "Rocíe la mezcla de judías verdes con el aceite de oliva y el jugo de limón y agregue la ralladura de limón.", "Para servir, apile la mezcla de judías verdes en un plato para servir y cubra con la pera caramelizada."], "url": "www_bbc_co_uk_food_recipes_warmgreenbeanpearbri_87024", "title": "Ensalada templada de judías verdes, peras, brie y zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de lomo de cordero de 250 g / 9 oz, sin grasa", "aceite de oliva", "sal y pimienta negra recién molida", "2 dientes de ajo, sin pelar, ligeramente triturados", "2 ramitas de romero", "Mitades de nuez 75g / 3oz", "75 g / 3 oz de judías verdes blanqueadas", "puñado de perejil plano, picado", "1 cucharada de vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote el cordero con el aceite de oliva y sazone bien con sal y pimienta negra recién molida.", "Caliente una sartén pequeña a prueba de horno hasta que esté caliente, luego coloque el cordero, el ajo y el romero en la sartén y espere 2-3 minutos por cada lado.", "Transfiera la sartén al horno y cocine durante diez minutos o hasta que esté cocida, pero ligeramente rosada en el medio.", "Coloque el cordero en un plato y corte en cuatro rebanadas, luego agregue todos los ingredientes restantes a un tazón y mezcle bien para combinar.", "Para servir, coloque los ingredientes de la ensalada mixta en un plato para servir, luego coloque el cordero sobre la ensalada."], "url": "www_bbc_co_uk_food_recipes_warmlambsalad_84697", "title": "Ensalada de cordero caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 canal de pato mallard (sin los senos) más o menos picada", "25g / 1oz de mantequilla", "2 chalotes, en rodajas", "2 dientes de ajo, finamente picados", "1 hoja de laurel", "1 ramita de tomillo", "pimienta negra recién molida", "1 cucharada de puré de tomate", "150ml / 5fl oz de vino tinto", "800ml / 14fl oz de caldo de pollo", "50g / 2oz de lentejas Puy", "150ml / 5fl oz de caldo de pollo", "1 diente de ajo, finamente picado", "1 ramita de tomillo", "4 pechugas de pato mallard", "sal y pimienta negra recién molida", "1 cucharada de aceite de girasol", "150-175 g / 5-6 oz de pastinacas, en rodajas finas a lo largo (use un pelador de verduras)", "aceite vegetal, para freír en grasa", "sal", "150-175g / 5-6oz hojas de ensalada mixtas", "1 cucharada de vinagre balsámico", "2 cucharadas de aceite de oliva virgen extra"], "method": ["Para la salsa, precaliente el horno a 230C / 350F / Gas 8.", "Coloque la carcasa del pato silvestre en una lata de asar y tueste en el horno durante 15 minutos, hasta que se dore.", "Caliente una sartén grande hasta que esté caliente. Agregue la mitad de la mantequilla a la sartén y, cuando la mantequilla empiece a formar espuma, agregue a la sartén los chalotes, el ajo, la hoja de laurel, el tomillo y la pimienta negra recién molida. Freír hasta que esté bien dorado.", "Agregue el puré de tomate a la sartén y cocine por un minuto o dos.", "Agregue el vino tinto a la sartén y cocine hasta que se reduzca tanto que casi todo el líquido se haya ido.", "Agregue el canal asado a la sartén y mezcle bien. Vierta el caldo y 200 ml / 7 fl oz de agua.", "Llevar a ebullición y luego reducir el fuego. Cocine a fuego lento hasta que espese, esto tomará aproximadamente 45 minutos.", "Pase la salsa a través de un colador fino en una sartén o jarra limpia, y quite la grasa. Mantenga la salsa caliente.", "Para las lentejas, coloque las lentejas en una olla con el caldo, el ajo, el tomillo y suficiente agua para cubrir. Cocine a fuego lento durante 20 minutos, hasta que estén tiernos.", "Escurra las lentejas y transfiéralas a un tazón. Cubra con papel de aluminio y manténgalo caliente hasta que se requiera.", "Para el pato, condimente los pechugas de pato con sal y pimienta negra recién molida.", "Caliente una sartén grande hasta que esté caliente, agregue el aceite de girasol y luego los senos con la piel hacia abajo.", "Cocine por 4-5 minutos, hasta que estén crujientes y doradas. Voltee los senos con pinzas y cocine en el otro lado durante 2-4 minutos (esto dejará el centro de cada pecho ligeramente rosado, puede agregar tiempo de cocción adicional si le gusta que el pato esté más cocido).", "Coloque las pechugas de pato en un plato limpio, cubra con papel de aluminio y déjelos reposar en un lugar cálido durante al menos diez minutos.", "Para los jirones crujientes de la pastinaca, caliente el aceite vegetal en una cacerola profunda a aproximadamente 190 ° C / 375 ° F - una miga de pan chisporrotea y se dora al dejarla caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión).", "Freír las rodajas de chirivía hasta que estén doradas. Retírelos con una espumadera y colóquelos en un recipiente forrado con papel de cocina para drenar. Espolvorea con sal.", "Para servir, mezcle las hojas de ensalada, el vinagre balsámico y el aceite de oliva en un tazón grande. Agregue las lentejas cocidas y combine suavemente. Talla los pechugas de pato en rodajas finas y agrega el pato al cuenco.", "Mezcle cuidadosamente la ensalada con las manos y divídala entre cuatro platos, luego rocíe sobre la salsa.", "Cubra cada montón de hojas con un puñado de tiras de chirivía. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_warmmallardducksalad_87875", "title": "Ensalada de pato mallard caliente con lentejas Puy y jirones de chirivía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 melón galo", "pequeño manojo de menta fresca, picado", "200 g / 7 oz de azúcar en polvo", "4 cucharadas de agua", "50ml / 2fl oz de champán", "1 cucharada de canela molida", "1 cucharada de jengibre molido"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Cortar el melón por la mitad y eliminar las semillas con una cuchara.", "Rebane cada mitad en cuatro cuñas y colóquelas en una bandeja para hornear.", "Coloque el melón en el horno y cocine durante cinco minutos mientras prepara el jarabe.", "Para el almíbar, coloca el azúcar y el agua en una sartén. Disuelva el azúcar a fuego lento, antes de encender el fuego. Agregue los ingredientes restantes de jarabe y reduzca en un tercio.", "Coloque el melón tibio en un plato de servir, vierta la cuchara sobre el almíbar y espolvoree con menta picada."], "url": "www_bbc_co_uk_food_recipes_warmmelonboatswithgi_87768", "title": "Melón caliente 'barcos' con jengibre y jarabe de canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["170g / 6oz de patatas nuevas hervidas y en cubitos", "55g / 2oz Raclette cheese o Abundance", "2 cucharadas de mostaza de grano", "½ cabeza de lechuga frisee", "1 pimiento rojo", "3 cucharadas de vinagre balsámico", "6 cucharadas de aceite de oliva", "albahaca fresca", "romero fresco", "sal", "pimienta negra recién molida", "aceitunas negras", "1 diente de ajo", "1 cebolla", "1 limón, solo jugo", "3 cucharadas de alcaparras", "6 filetes de anchoa", "perejil de hoja plana picado", "aceite de oliva virgen extra"], "method": ["Corte el pimiento rojo por la mitad, quite las semillas y la parte superior, y colóquelo en la bandeja del horno. Rocíe el pimiento rojo con aceite de oliva y hornee en un horno caliente hasta que estén dorados en la parte superior. Retire del horno y colóquelo en un recipiente cuando aún esté caliente y cubra con una película adhesiva para permitir que se enfríe.", "Pele la piel del pimiento enfriado y corte la carne, luego mezcle con el vinagre balsámico, el aceite de oliva, el condimento y el romero fresco finamente picado. Coloque en el microondas durante aproximadamente 30 segundos para calentar y luego presione los pimientos y las papas en unos anillos de acero inoxidable de 5 cm / 2 in. Cubra esto con un poco de queso rallado y colóquelo bajo una parrilla caliente para dorar la parte superior.", "Coloque una pequeña pila de lechuga en el centro del plato y el anillo de papa y queso en la parte superior, retire el anillo de acero inoxidable. Coloque una pila de tapenade encima del queso. Pique un poco de albahaca fresca y agregue al aderezo.", "Verifique que no tenga más condimentos y ponga una cuchara alrededor del borde del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_warmnewpotatosaladwi_70909", "title": "Caliente nueva ensalada de patata con romero, queso raclette y pimientos rojos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 hojas de laurel", "1 zanahoria, más o menos picada", "1 tallo de apio, más o menos picado", "½ cebolla, partida por la mitad", "1kg / 2¼lb de pulpo, limpiado", "4 papas medianas", "sal y pimienta negra recién molida", "1 cucharada de jugo de limón", "aceite de oliva virgen extra", "pequeño racimo de perejil fresco, toscamente picado"], "method": ["Llene una bandeja grande con agua y agregue las hojas de laurel, la zanahoria, el apio, la cebolla y el pulpo. Llevar a ebullición y hervir a fuego lento durante aproximadamente una hora, o hasta que un cuchillo filoso pueda atravesar la carne del pulpo fácilmente.", "Saca al pulpo del agua y vuelve a limpiarlo. Despegue la piel externa y retire el ojo central. Si es necesario, lávelo nuevamente. Picar la carne en trozos pequeños.", "Mientras tanto, hierve las papas. Escurrirlos, pelarlos y cortarlos en rodajas.", "Mezcle las rodajas de papa y los cubos de pulpo. Sazone con sal y pimienta negra recién molida al gusto, luego rocíe con el jugo de limón y una generosa ración de aceite de oliva. Mezcle el perejil picado y sirva."], "url": "www_bbc_co_uk_food_recipes_warmoctopusandpotato_82387", "title": "Ensalada templada de pulpo y patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pak choi, descuartizado", "Jengibre de raíz de 25 g / 1 oz, pelado, finamente picado", "1 chile rojo, finamente picado", "1 cucharada de vinagre balsámico", "1 naranja, pelada, segmentada", "3 cucharadas de aceite de oliva", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Coloque el pak choi en un vaporizador y hágalo durante cinco minutos, o hasta que se marchite.", "Batir el resto de los ingredientes juntos en un tazón pequeño para hacer un aderezo.", "Para servir, amontone el pak choi en un plato para servir y rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_warmpakchoisaladwith_88948", "title": "Ensalada templada de pak choi con aderezo de jengibre y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de mantequilla sin sal, más extra, derretida, para engrasar", "50g / 2 oz de queso parmesano (o similar queso duro vegetariano), finamente rallado", "Harina simple de 450g / 1lb", "100 g / 3½ oz de harina de maíz", "150g / 5oz de azúcar glasé", "2 yemas de huevo de gallinas camperas", "80ml / 2½fl oz de leche fría", "3 peras, peladas y partidas por la mitad", "1 pedazo pequeño de jengibre, finamente cortado", "500 ml / 17 fl oz de vino de postre", "220 g / 8oz de pistachos blanqueados", "180g / 6oz de azúcar glas", "200g / 7oz de mantequilla sin sal", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de harina", "1 cucharada de melaza de granada"], "method": ["Para la masa, engrase seis tartaletas acanaladas de 10cm / 4in con mantequilla derretida.", "En un tazón, frote la mantequilla y el queso en la harina y la harina de maíz, luego mezcle el azúcar glas.", "En un recipiente aparte, bata las yemas de huevo con la leche, luego agrega dos tercios de la mezcla en la mezcla de harina. Agregue más mezcla de huevo según sea necesario hasta que la mezcla se una como masa. Junta la mezcla con las manos y amasa la masa ligeramente hasta que quede suave y elástica.", "Envuelva la masa en una película adhesiva y enfríe en la nevera durante una hora. Mientras tanto, precalentar el horno a 170 C / 325 F / Gas 3.", "Haga rodar la masa refrigerada sobre una superficie de trabajo ligeramente enharinada. Recorte seis discos de 12.5 cm / 5 pulgadas con un cortador de pasteles o un cuenco vuelto hacia arriba como plantilla. Alinea cada caja de tartas con un disco de hojaldre.", "Coloque un círculo de papel antigrasa en cada caja de repostería y llénelo con frijoles o arroz seco. Hornee en el horno por 15-20 minutos, luego retírelo del horno y déjelo enfriar un poco.", "Para el relleno, coloque las peras, el jengibre y el vino de postre en una sartén, cubra con una tapa y deje hervir a fuego lento. Cocine a fuego lento durante 10-12 minutos, o hasta que las peras estén tiernas. (El tiempo de cocción variará según la madurez de la pera.) Retire las peras de la sartén con una espumadera y transfiéralas a un plato.", "Enciende el fuego y hierve el vino hasta que se haya reducido en tres cuartos. Sáquelo del fuego y apártelo.", "Mezcle las nueces de pistacho en un procesador de alimentos hasta que se asemejen a pan rallado.", "Agregue el azúcar glas y la mantequilla y mezcle la mezcla hasta formar una pasta.", "Agregue los huevos batidos, la harina y la melaza y mezcle hasta que quede suave.", "Divida el relleno entre las cajas de repostería y coloque una de las mitades de pera escalfadas en la parte superior.", "Hornee las tartas en el horno durante 20-25 minutos, o hasta que el relleno esté cocido."], "url": "www_bbc_co_uk_food_recipes_warmpeartart_10393", "title": "Tarta de pera caliente", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "3 rebanadas de pan, cortezas eliminadas y cortadas en cubos de 1cm", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 cucharaditas de mantequilla", "100 g / 3½ oz espinacas, lavadas", "sal y pimienta negra recién molida", "Pecorino de 75g / 3oz, cortado en cubos de 1cm", "2 dientes de ajo, aplastados", "2 puñados grandes de hojas frescas de albahaca", "Pecorino 50g / 2oz, rallado", "150ml / ¼ pinta de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para los crotones, caliente la mantequilla en una sartén. Agregue los cubos de pan, sal y pimienta negra recién molida y una cucharada de aceite de oliva. Freír suavemente hasta que estén doradas por todos lados. Retirar del fuego y escurrir sobre papel de cocina.", "Para la ensalada, derrita la mantequilla en una cacerola grande, agregue la espinaca y mezcle para cubrir la mantequilla. Cocine por 1-2 minutos, revolviendo con frecuencia, hasta que comience a marchitarse. Agregue los cubos de Pecorino y retírelos del fuego.", "Para el aderezo de pesto, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que esté casi liso.", "Para servir, coloque la ensalada de espinacas y Pecorino en un plato grande. Espolvorear con los croutons y rociar con aderezo de pesto."], "url": "www_bbc_co_uk_food_recipes_warmpecorinospinacha_80304", "title": "Ensalada templada de pecorino, espinacas y croûton con aderezo de pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de vino blanco", "Cebollas de 400g / 14oz, peladas, finamente picadas", "3 hojas de laurel", "500ml / 17fl oz de agua o caldo de pescado", "sal y pimienta negra recién molida, al gusto", "700g / 1lb 7oz de patatas nuevas, preferiblemente Jersey Royals, restregado", "algunas ramitas de menta fresca", "4 x 200 g / 7 oz de filetes de salmón", "12 lanzas de espárragos, extremos leñosos recortados", "150g / 5oz de mantequilla salada", "2 yemas de huevo de gallinas camperas", "½ cucharada de mostaza Dijon", "½ limón, solo jugo"], "method": ["Coloque el vino blanco, las cebollas, las hojas de laurel, el agua o el caldo de pescado y la sal y la pimienta negra recién molida en una cacerola o bandeja de asar que sea lo suficientemente grande como para contener los filetes de salmón. Calentar durante 20 minutos a fuego lento. (NB: No permita que el líquido hierva a fuego lento o hierva).", "Mientras tanto, coloque las papas nuevas en una olla separada y cúbralas con agua fría. Agregue una pizca de sal y las ramitas de menta y cocine a fuego lento durante 20-25 minutos, o hasta que estén tiernas.", "Cuando el líquido de cocción se haya calentado, agregue los filetes de salmón, con la piel hacia abajo. Cubra la bandeja o la bandeja de asar con papel de aluminio y continúe cocinando a fuego lento durante diez minutos.", "Agregue las lanzas de espárragos al líquido de caza furtiva, luego vuelva a tapar y continúe cocinando durante otros cinco minutos, o hasta que los espárragos estén tiernos y el salmón esté bien cocido.", "Mientras tanto, para el holandés, caliente la mantequilla en una sartén a fuego medio.", "Mezcle las yemas de huevo, la mostaza y el jugo de limón en un procesador de alimentos hasta que estén pálidos y bien combinados.", "Cuando la mantequilla hierva vigorosamente, con el motor del procesador de alimentos aún en funcionamiento, vierta la mantequilla derretida en la mezcla de huevo y limón gota por gota, o hasta que la mezcla esté bien combinada y espesada.", "Transfiere la salsa holandesa a un tazón y condimenta, al gusto, con sal y pimienta negra recién molida.", "Para servir, levante con cuidado los filetes de salmón del líquido de cocción y séquelos. Coloque uno en el centro de cada uno de los cuatro platos de servir. Coloque las papas nuevas y las espárragos al lado. Rocíe la salsa holandesa. (NB: El líquido de caza furtiva se puede reservar para enfriar y congelar, luego descongelar y reutilizar. Retirar las hojas de laurel antes de congelarlas)."], "url": "www_bbc_co_uk_food_recipes_warmpoachedsalmonand_92049", "title": "Salmón escalfado caliente y 'holandesa sin fallas'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750g / 1lb de papas nuevas, raspadas y limpias", "2 cucharadas de aceite de oliva", "1 cebolla, en rodajas", "2 palitos de apio, en rodajas", "1 hoja de laurel fresca", "3 cucharadas de vinagre de vino blanco", "2 cucharaditas de sal", "6 granos de pimienta negra", "1.2 litros / 2 pintas de agua", "2 alas de patín preparadas de x 450 g / 1 libra", "pellizco de hebras de azafrán", "2 tomates de ciruela, sin piel, sin semillas y en cubitos", "¼ cucharadita de semillas de cilantro trituradas", "pizca de comino molido", "1 pimiento rojo asado pequeño desollado, sin semillas y cortado en tiras finas", "1 chile rojo holandés medio caliente, sin semillas y finamente picado", "2 dientes de ajo, finamente picados", "150ml / 5fl oz de oliva virgen extra", "1 cucharada de jugo de limón", "sal y pimienta negra recién molida", "2 cucharaditas de cilantro rallado y menta", "85ml / 3fl oz de aceite de oliva virgen extra, más extra para servir", "50g / 2oz de ramitas de berros, muy toscamente picadas.", "vinagre balsámico", "copos de sal marina", "pimienta negra molida"], "method": ["Cocine las papas en agua hirviendo bien salada hasta que estén tiernas.", "Para el caldo de la corte, coloque todos los ingredientes en una sartén grande y poco profunda. Llevar a ebullición y cocine a fuego lento durante 20 minutos.", "Corta cada ala de patina por la mitad. Agréguelos al caldo de la corte y cocine a fuego lento durante 10 minutos.", "Mientras tanto, para la salsa, remoje el azafrán en un par de cucharaditas de agua tibia durante cinco minutos. Luego ponga el azafrán y su agua, tomates, cilantro, comino, pimiento rojo, chile, ajo, aceite, jugo de limón, una cucharadita de sal y diez vueltas del molinillo de pimienta negra en una sartén pequeña y, justo antes de que el patín esté listo , calentar la salsa a través de un calor muy suave.", "Levante los trozos de patín del caldo de la canasta, escurra el exceso de líquido y déjelo a un lado en un plato. Revuelva el cilantro y la menta en la salsa, cuchara un poco sobre cada pieza de patín.", "Caliente las dos cucharadas de aceite de oliva en una sartén grande. Cuando terminen las papas, escurrirlas bien y devolverlas a la sartén con el aceite de oliva virgen extra.", "Triture suavemente cada patata contra el costado de la sartén con la parte trasera de un tenedor hasta que se abra de golpe.", "Sazone las papas y agregue cualquier jugo del pescado. Agregue el berro y revuelva suavemente hasta que el berro esté bien mezclado.", "Para servir, coloque las patatas trituradas sobre las cuatro placas calentadas y coloque el patín encima. Coloque el pulgar sobre la parte superior de la botella de aceite de oliva virgen extra y rocíe un poco alrededor del borde exterior de cada plato.", "Haga lo mismo con el vinagre balsámico y luego espolvoree unos copos de sal marina y pimienta negra pisada en trozos gruesos."], "url": "www_bbc_co_uk_food_recipes_warmpoachedskatewith_74906", "title": "Patín escalfado caliente con sabores aromáticos de Marruecos con patatas trituradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de salmón 200 g / 7 oz", "2 ramitas de eneldo fresco", "½ limón, solo jugo", "1 diente de ajo, pelado", "300 ml / ½ litro de caldo de pescado", "salpicar vino blanco", "2 dientes", "85g / 3oz de espinaca baby", "salpicar agua", "¼ cucharadita de nuez moscada recién rallada", "sal y pimienta negra recién molida", "½ limón, jugo y ralladura", "¼ de papa, picada y cocinada", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva", "2 cucharaditas de mostaza Dijon", "sal y pimienta negra recién molida", "dash aceite de oliva", "½ cebolla, finamente picada", "1 pimiento rojo, picado", "100ml / 3½ fl oz de leche", "1 diente de ajo, picado", "sal y pimienta negra recién molida"], "method": ["Para el salmón escalfado, coloque todos los ingredientes de salmón escalfados en una sartén grande y deje que hierva. Retire del fuego, cubra y deje cocer en el calor residual durante cinco minutos, o hasta que el salmón esté bien cocido. Retire el salmón del líquido y retírelo y deseche la piel. Desmenuce el salmón en trozos y déjelo a un lado.", "Para la espinaca y la papa, coloque la espinaca en una sartén, agregue el agua, la nuez moscada, el jugo y la ralladura de limón, la sal y la pimienta negra recién molida y deje marchitar durante 1-2 minutos. Escurra el exceso de agua y agregue la papa cocida.", "Para el aderezo de ensalada, mezcle todos los ingredientes y luego vierta sobre la mezcla de espinacas y patatas.", "Para el coulis de pimiento rojo, caliente el aceite de oliva en una cacerola, agregue la cebolla y el pimiento rojo y sofríalos a fuego lento hasta que se ablanden. Agregue la leche, el ajo, la sal y la pimienta negra recién molida y hiérvalos durante seis minutos, o hasta que el pimiento rojo esté tierno. Deje que se enfríe un poco, luego vierta en una licuadora y mezcle hasta que quede suave.", "Para servir, espolvorea la espinaca y la papa en un plato para servir. Cubra con el salmón copos y cuchara alrededor del coulis de pimiento rojo."], "url": "www_bbc_co_uk_food_recipes_warmpotatoandspinach_88581", "title": "Ensalada de papas y espinacas calientes con escamas de salmón escalfado y pimientos rojos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente rebanada", "1 cucharada de mostaza Dijon", "75ml / 2½ fl oz crema doble", "sal y pimienta negra recién molida", "1 cucharada de mantequilla", "150 g / 5½ oz de patatas nuevas cocidas, en rodajas", "1 cucharada de cebolletas frescas picadas", "3-4 lanzas de espárragos, recortadas", "1 huevo de gallinas camperas"], "method": ["Caliente una cucharada de aceite de oliva en una sartén antiadherente y fría la cebolla hasta que esté suave pero no coloreada.", "Agregue la mostaza y la crema y cocine a fuego lento durante 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida y batir en la mantequilla.", "Agregue las papas en rodajas y el cebollín.", "Rocíe las lanzas de espárragos con el aceite de oliva restante y caliente una sartén. Planche los espárragos durante 3-4 minutos, o hasta que estén tiernos y carbonizados.", "Ponga a hervir una cacerola de agua con sal y rompa el huevo. Reducir a fuego lento y escalfar el huevo durante cuatro minutos. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque la ensalada de papa en un plato y cubra con los espárragos y el huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_warmpotatosaladwitha_86998", "title": "Ensalada de papas con espárragos y huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de patatas nuevas", "2 cucharadas de mostaza Dijon", "llovizna de aceite de oliva", "2 cucharadas de eneldo, picado", "sal y pimienta negra recién molida"], "method": ["Coloque las papas nuevas en una olla grande de agua salada hirviendo y deje hervir durante 15 minutos o hasta que estén recién cocidas.", "Escurra las papas y colóquelas en un tazón grande con todos los demás ingredientes.", "Mezcle bien y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_warmpotatomustardand_80303", "title": "Ensalada de patata caliente, mostaza y eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "2 cucharadas de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "sal y pimienta negra recién molida", "2 cucharadas de cebolletas frescas picadas", "200g / 7oz de papas nuevas, cocinadas y partidas a la mitad, todavía calientes"], "method": ["En un recipiente, mezcle el aceite, el vinagre y la mostaza Dijon. Sazone con sal y pimienta negra recién molida, al gusto, y mezcle las cebolletas.", "Mezcle las papas nuevas calientes cocidas en el aderezo y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_warmpotatosaladwithh_88228", "title": "Ensalada de papas calientes con aderezo de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]