[{"isVegetarian": false, "title": "Ever-so-easy cottage pie", "url": "www_bbc_co_uk_food_recipes_ever-so-easy_cottage_pie_77158", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ever-so-easy_cottage_pie_77158_16x9.jpg", "ingredients": ["400g/14oz lean minced beef (10% fat or less)", "1 onion, chopped", "2 celery sticks, trimmed and thinly sliced", "2 carrots, peeled and diced", "400g tin chopped tomatoes", "2 tbsp tomato purée", "1 beef stock cube", "1 tbsp Worcestershire sauce", "1 tsp dried mixed herbs", "100g/3½oz frozen peas", "sea salt and freshly ground black pepper", "700g/1lb 9oz floury potatoes, such as King Edwards or Maris Piper, peeled and cut into 4-cm/1½-in chunks", "2 leeks, trimmed and cut into 1-cm/½-in slices", "25g/1oz mature Cheddar, grated"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place a large, non-stick saucepan or flameproof casserole over a medium heat. Add the beef, onion, celery and carrots to the pan and cook for 5 minutes. Use a couple of wooden spoons to break up the meat as it cooks. ", "Stir in the tomatoes, tomato purée, stock cube, Worcestershire sauce and mixed herbs. Refill the tomato tin with water and pour into the pan. Season with a good pinch of salt and plenty of pepper. Bring to a simmer, then reduce the heat, cover loosely and simmer gently for about 25 minutes, stirring regularly. ", "Meanwhile, to make the topping, put the potatoes into a large saucepan and cover with cold water. Bring to the boil, then reduce the heat slightly and simmer for 10 minutes. Add the leeks, return to a simmer and cook for 2 minutes more, or until the potatoes are tender but not falling apart.", "Preheat the oven to 220C/200C Fan/Gas 7. Drain the potatoes and leeks and return to the pan. Roughly crush the potatoes with a fork. Season with a little salt and lots of pepper.", "Stir the peas into the beef mixture then spoon into a 2 litre/3½ pint shallow ovenproof dish. Using a large spoon, top the beef mixture with the crushed potatoes. There is no need to do it too neatly. Scatter the cheese over the top.", "Bake for 25–30 minutes, or until the topping is golden brown and the filling is bubbling. Serve."]}, {"isVegetarian": false, "title": "Everyday roast chicken", "url": "www_bbc_co_uk_food_recipes_everyday_roast_chicken_91003", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/everyday_roast_chicken_91003_16x9.jpg", "ingredients": ["a small, free-range roasting chicken", "75ml/3fl oz olive oil", "4 cloves of garlic, squashed", "a large lemon", "6 sprigs thyme", "salt and freshly ground black pepper"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 8.", "Place the chicken onto a chopping board and cut in half down the backbone using a large and very sharp cooks’ knife. Flatten the chicken as much as you can buy pressing down with the palm of your hand.", "Pour the olive oil into a mixing bowl large enough to take the chicken, add the squashed garlic cloves, the juice from the lemon and then the squeezed lemon shells. Put in the sprigs of thyme, a good seasoning of salt and black pepper, then turn the chicken over in the oil. (If you have the time, you can leave the chicken like this for an hour or so in the fridge.) ", "Place the chicken in a roasting tin, skin-side up. Roast for about 30 minutes or until the skin is golden and the bird cooked right through. "]}, {"isVegetarian": true, "title": "Eve's pudding", "url": "www_bbc_co_uk_food_recipes_eves_pudding_91583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb cooking apples, peeled, cored and sliced", "15g/1/2oz butter", "85g/3oz sugar", "½ lemon, juice and zest", "115g/4oz flour", "pinch salt", "½ tsp baking powder", "55g/2oz butter, softened", "55g/2oz sugar", "1 free-range egg", "1 tbsp milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the filling, place the apples, butter, sugar and lemon juice and zest in a saucepan with a little water and cook gently until the apples have softened. ", "Put the apple mixture in the bottom of a pie dish, packing the apples down to provide a firm base for the topping (this helps it rise evenly during baking).", "For the topping, sieve the flour together with a pinch of salt and the baking powder.  In a separate bowl, cream together the butter and sugar, beat in the egg and then lightly fold in the flour. Add a little milk if the mixture is too stiff.  ", "Pour the mixture on top of the apples and bake in the oven for 45-55 minutes or until the top is golden-brown and cooked through. "]}, {"isVegetarian": true, "title": "Eve's pudding", "url": "www_bbc_co_uk_food_recipes_eves_pudding_99739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40 large Bramley apples, peeled, cored and sliced ", "1kg/2lb 4oz unsalted butter, softened", "550g/1lb 4oz brown sugar ", "150ml/5fl oz golden syrup ", "1 tbsp ground cinnamon ", "700g/1lb 10oz raisins ", "20 eggs", "1kg/2lb 4oz self-raising flour"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease a very large ovenproof serving dish with 125g/4oz of the butter then scatter in the apple slices. Sprinkle over 150g/5½oz of the brown sugar, the golden syrup, cinnamon and finally the raisins.", "In a mixing bowl, beat together the remaining butter and sugar in a large mixer (or with a wooden spoon) until pale and fluffy. Beat in the eggs, one at a time, then use a large metal spoon to gently fold in the flour.", "Spoon the batter over the apples and gently even out with the back of the spoon.", "Bake for 45-50 minutes, or until golden-brown and cooked through. Serve with custard."]}, {"isVegetarian": true, "title": "Eve's pudding", "url": "www_bbc_co_uk_food_recipes_evespudding_83911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large cooking apples (about 500g/1lb2oz in total)", "1 tbsp lemon juice", "2 tbsp water", "20g/¾oz butter ", "2 tbsp caster sugar", "75g/3oz butter", "100g/3½oz caster sugar ", "100g/3½oz self-raising flour", "2 free-range eggs, lightly beaten", "1 tbsp boiling water", "cream or custard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350/Gas 4.", "Peel, core and roughly chop the apples.", "Add the apples to a saucepan with the lemon juice and water.", "Stir, cover and cook briskly for five minutes until the apples are soft.", "Add the butter and caster sugar and stir. ", "Transfer to a 900ml/1½ pint capacity ceramic gratin dish, about 5cm/2in deep. ", "Leave to cool while you prepare the topping. ", "For the topping, cream together the butter and caster sugar until fluffy and light.  ", "Fold the flour and egg in alternate spoonfuls into the sugar mixture until blended, being careful to keep folding rather than stirring energetically - this will keep air in the mixture and fold in.", "Add a spoonful of boiling water to the mix.", "Spoon the mixture over the apples. Cook in the oven for 30-35 minutes or until the topping is puffy and golden. Serve with cream or custard."]}, {"isVegetarian": false, "title": "Ewes' milk cheese and hot-smoked trout on toast", "url": "www_bbc_co_uk_food_recipes_ewesmilkcheeseandhot_86832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large slices bread", "olive oil", "100g/3½oz ewes' milk cheese, sliced", "salt and freshly ground black pepper, to taste", "1 hot-smoked trout fillet, flesh flaked with a fork", "parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium-hot.", "Heat a griddle pan. Drizzle the bread with olive oil and griddle for two minutes on each side. ", "Slide the griddled bread onto a baking sheet, top with sliced cheese, season with salt and freshly ground black pepper and place under the grill for 2-3 minutes. ", "Slide onto a plate, top with the flaked hot-smoked trout flakes and garnish with parsley. Serve."]}, {"isVegetarian": false, "title": "Exceptional gammon with cider and cinnamon", "url": "www_bbc_co_uk_food_recipes_exceptional_gammon_with_50001", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/exceptional_gammon_with_50001_16x9.jpg", "ingredients": ["1.2kg/2lb 10oz boneless gammon joint (we used unsmoked but smoked would work too)", "500ml/17fl oz cider", "1 litre/1¾ pints cloudy apple juice", "2 sharp green apples, cored and cut into rough chunks", "2 x 8cm/3¼in pieces cinnamon stick", "3-4 fresh red chillies, seeds removed, cut into quarters", "1 tbsp coarsely crushed coriander seeds", "1 tbsp demerara sugar, or to taste", "¼ tsp chilli powder", "1 heaped tbsp cornflour", "sautéed red cabbage with cumin seeds and lemon juice", "green chilli mashed potatoes"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the gammon in plenty of cold water in the fridge for at least two hours, or overnight. Drain well. ", "Place the gammon along with all the other gammon ingredients in a casserole dish. The liquid should cover the meat; if not, add a little water to just cover. Bring to the boil, then reduce the heat to low and simmer gently, partly covered with a lid, for 1¼ hours. Turn the gammon carefully in the liquid every 20 minutes or so.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the gammon from its cooking stock, transfer to a small roasting tin. Reserve the cooking liquid for making the sauce. ", "Cut the rind from the gammon, leaving a thin layer of fat, and discard the rind. With a small sharp knife, score the fat into diamonds.", "For the glaze, put a ladleful of cooking liquid into a large clean pan. Add the sugar and chilli powder and cook until a glaze-like consistency. Pour this over the gammon and roast for 15 minutes, until browned and caramelised. Set aside in a warm place while you make the sauce", "For the sauce, boil the cooking liquid in a pan, uncovered, over a high heat until it has reduced to about 500ml/17fl oz; this could take about 10 minutes of boiling.", "Strain the liquid through a sieve into a clean pan, rubbing any pieces of apple through the sieve too so that the flesh is in the sauce; leave behind only the skins. Taste the sauce and adjust seasoning to taste. If you want it sweeter, add a pinch of demerara sugar; you almost certainly won’t need any salt.", "Reheat the remaining strained sauce gently until it reaches a simmer. Blend the cornflour in a little cold water to a smooth paste, and stir into the sauce, stirring continuously. A creamy consistency is better than a very thick sauce, but if you prefer yours thicker, add a little more blended cornflour. To serve, place gammon slices on individual plates and pour over the sauce. Serve with spiced red cabbage and green chilli mash. "]}, {"isVegetarian": true, "title": "Exotic fruit salad", "url": "www_bbc_co_uk_food_recipes_exoticfruitsalad_72345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Charentais melon", "1 paw-paw", "1 Asian pear, peeled and sliced", "8 lychees, peeled and stoned", "150ml/5¼fl oz fresh fruit juice, orange or any you like"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Use a melon baller to scoop balls from the melon and the paw-paw. Place these in a bowl, add the remaining fruit and the juice.", "Cover and chill until needed, making sure you take it out of the fridge 30 minutes before serving."]}, {"isVegetarian": false, "title": "Express bacon and pesto pasta", "url": "www_bbc_co_uk_food_recipes_express_bacon_and_pesto_15099", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_bacon_and_pesto_15099_16x9.jpg", "ingredients": ["150g/5½oz broccoli head, thick stem removed", "1 onion, roughly chopped", "350g/12oz penne", "300g/10½oz smoked back bacon, cut into small pieces", "150g/5½oz basil pesto", "150g/5½oz cherry tomatoes, halved", "25g/1oz pine nuts, to serve", "salt and freshly ground black pepper", "25g/1oz Parmesan shavings, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the broccoli into florets and chop the green stems into small chunks.", "Heat a small frying pan until hot. Add the pine nuts and dry fry over a medium-low heat for a few minutes, until toasted and golden brown.", "Bring a pan of salted water to the boil, then add the onion and penne. Cook according to the pasta packet instructions, adding the broccoli 3 minutes before the end. Drain the pasta and vegetables, refreshing the broccoli separately in cold water to stop the cooking and to set the colour.", "Meanwhile, fry the bacon in a large, dry pan over a medium-high heat for about 10 minutes, or until crisp and golden-brown, stirring often. Reserve 2 tablespoons of the cooked bacon and add the remainder to the pasta.", "Add the pesto, tomatoes and broccoli to the cooked pasta mixture. Season with black pepper and stir.", "Tip into a serving dish, scatter with toasted pine nuts, the reserved bacon and Parmesan and serve."]}, {"isVegetarian": false, "title": "Express lasagne", "url": "www_bbc_co_uk_food_recipes_express_lasagne_51375", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_lasagne_51375_16x9.jpg", "ingredients": ["butter, for greasing", "6 large dried lasagne sheets", "75g/2¾oz mature Cheddar cheese, grated", "1 tbsp oil", "450g/1lb pork sausage meat", "1 tbsp plain flour", "1 red chilli, deseeded and finely chopped", "2 fat garlic cloves, crushed", "250g/9oz chestnut mushrooms, sliced", "200ml/7fl oz full-fat crème fraîche", "100g/3½oz baby spinach, roughly chopped", "salt and freshly ground black pepper", "500g/1lb 2oz passata", "2 tbsp sun-dried tomato paste", "1 tsp light muscovado sugar", "1 tbsp chopped fresh thyme leaves", "1 tbsp chopped fresh sage"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease the ovenproof dish with butter. ", "Soak the lasagne sheets in recently boiled warm water to soften while you prepare the two sauces. ", "For the pork and spinach sauce, heat the oil in a large, non-stick frying pan. Add the sausage meat and brown over a high heat for 5–10 minutes until golden-brown, breaking up the mince with two wooden spoons. Sprinkle in the flour and fry for a minute.", "Add the chilli, garlic and mushrooms and fry for about 5 minutes. Stir in the crème fraîche and spinach. Bring to the boil and allow to bubble for a couple of minutes. Season well with salt and pepper and set aside. ", "For the tomato sauce, mix all the ingredients together in a jug or bowl and season well with salt and pepper. ", "Drain the lasagne sheets.", "Spoon one-third of the spinach sauce into the base of the ovenproof dish. Spoon one-third of the tomato sauce on top and arrange half the lasagne sheets over the tomato sauce. Repeat using two more layers of spinach and tomato sauce and one of lasagne sheets. Sprinkle over the grated cheese.", "Bake for 30–35 minutes, or until the pasta is tender and the top of the dish is golden-brown and bubbling around the edges. Serve immediately."]}, {"isVegetarian": false, "title": "Extra-lean burger and salad", "url": "www_bbc_co_uk_food_recipes_extra_lean_burger_and_59164", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extra_lean_burger_and_59164_16x9.jpg", "ingredients": ["low-calorie cooking spray", "½ small onion, finely chopped", "100g/3½oz Portobello mushrooms, finely chopped", "250g/9oz extra-lean beef mince (under 5% fat)", "2 tsp finely chopped fresh thyme (or ½ tsp dried thyme)", "freshly ground black pepper", "1 Little Gem lettuce, leaves separated", "120g/4½oz cherry tomatoes, sliced", "1/3 cucumber, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a small frying pan with oil and cook the onion and mushrooms over a medium heat for five minutes, or until well softened, stirring regularly. Tip into a heatproof bowl and leave to cool for five minutes.", "Add the beef, thyme and lots of ground black pepper. Mix well and form into two balls. Flatten into burger shapes, each around 2cm/¾in thick.", "Clean the pan and return to the hob. Spray with a little more oil and cook the burgers over a medium-low heat for 10 minutes, turning occasionally, until browned on the outside and cooked through inside. ", "Serve the burgers with lettuce, tomatoes and cucumber."]}, {"isVegetarian": false, "title": "Extra special beef biryani", "url": "www_bbc_co_uk_food_recipes_extra_special_beef_27357", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extra_special_beef_27357_16x9.jpg", "ingredients": ["100ml/3½oz full-fat milk", "1 heaped tsp saffron strands", "1kg/2lbs 2oz braising steak, cut into bite-sized chunks", "4 onions, peeled", "4 garlic cloves, peeled", "25g/1oz fresh root ginger, peeled and roughly chopped", "2 fresh red chillies, deseeded and roughly chopped", "5 cloves", "2 tsp cumin seeds", "2 tsp coriander seeds", "¼ cinnamon stick", "12 cardamom pods", "2½ tsp sea salt flakes, plus extra to season", "½ whole nutmeg, finely grated", "135ml/4¾fl oz sunflower oil", "200ml/7fl oz natural yoghurt", "2 bay leaves", "2 tsp caster sugar", "325g/11½oz basmati rice", "4 tbsp chopped fresh coriander", "50g/2oz butter", "50g/2oz sultanas", "40g/1½oz flaked almonds", "3 large free-range eggs", "freshly ground black pepper", "fresh coriander"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Pour the milk into a small saucepan, add the saffron threads and heat gently for two minutes without boiling. Remove from the heat and set aside for 2-3 hours, preferably overnight.", "Trim the beef of any hard fat and cut into bite-sized pieces. Heat two tablespoons of oil in the frying pan. Season the beef with salt and freshly ground black pepper and fry in 2-3 batches over a medium-high heat until browned on all sides. Transfer to a large, lidded saucepan.", "While the beef is frying, roughly chop two of the onions and put in a food processor with the garlic, ginger and chillies. Add 50ml/2fl oz cold water and blend to a smooth paste.", "Put the cloves, cumin, coriander, cinnamon, 1½ teaspoons salt and seeds from the cardamom pods into a pestle and mortar. Grind until a fine powder. Grate the nutmeg into the mixture and tip into the onion paste. Add plenty of freshly ground black pepper. Mix until all the ingredients are combined.", "Add a further three tablspoons of oil into the same frying pan that was used to cook the beef and fry the spiced onion paste over a medium heat for around 10 minutes until lightly browned, stirring often. Place the mixture into the pan with the beef. Stir in the yoghurt, 450ml/16fl oz water and bay leaves. Place the pan over a low heat and bring to a gentle simmer. Cover with a lid and simmer gently for 1½ hours or until the beef is tender, stirring occasionally. ", "Remove the lid from the pan and stir in the sugar. Increase the heat and simmer the sauce for 10 minutes, or until reduced and thick. Add a little more salt and pepper to taste.", "Toast the almonds in a non-stick frying pan and cook over a medium heat for 4-6 minutes. Stir the sultanas into the almonds and immediately tip into a heatproof bowl. Set aside to cool.", "Cut the remaining two onions in half and slice thinly. Pour two tablespoons of oil into a frying pan and fry the onions for 6-8 minutes over a fairly high heat until softened and golden-brown, stirring frequently. Set aside.", "Preheat the oven to 180C/350F/Gas 4. ", "Half-fill a large pan with water, add one teaspoon of salt and bring to the boil. Put the rice in a sieve and rinse under plenty of cold water. Stir the rice into the hot water and return to the boil. Cook for five minutes and drain well. Add the coriander and stir until well combined.", "Transfer half the meat and sauce into a large, ovenproof dish. Spoon over half of the part-cooked rice and drizzle with half the soaked saffron threads and milk. Top with half the fried onions. Repeat the layers once more. Dot with the butter. Cover the dish with two layers of tightly fitting foil and bake for 30 minutes. ", "Hard-boil the eggs for nine minutes until firm and drain in a sieve under running water until cool enough to handle. Peel the eggs and cut into quarters. ", "Remove the dish from the oven and discard the foil. Use a fork to lightly fluff the rice. Garnish with the freshly boiled eggs, scatter with toasted almonds and sultanas. Add a few fresh coriander leaves and serve."]}, {"isVegetarian": true, "title": "Extravagant five-tiered wedding cake", "url": "www_bbc_co_uk_food_recipes_extravagant_five-tiered_21283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extravagant_five-tiered_21283_16x9.jpg", "ingredients": ["one quantity Rich moist fruit cake", "one quantity Rich moist fruit cake", "one quantity Rich moist fruit cake", "1 x 340g/12oz jar apricot jam", "5.5kg/10lb marzipan", "icing sugar, for dusting", "2.5kg/5lb royal icing", "ribbons, fresh flowers or fondant flowers, to decorate"], "serves": "Serves 200", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the 25cm/10in cake, bake the fruit cake according to the recipe. Remove the cake from the oven and set aside to cool.", "For the 22cm/8½in and 10cm/4in cakes, make the cake mixture according to the recipe, divide between the two tins and cook according to the recipe. Remove the cakes from the oven and set aside to cool.", "For the 18cm/7in and 15cm/6in cakes, make the cake mixture according to the recipe, divide between the two tins and cook according to the recipe. (There will slightly too much cake mixture, and leftover mixture can be baked in a muffin tin). Remove the cakes from the oven and set aside to cool.", "When the cakes are cold, spoon the top liberally with brandy, whisky or boiled orange juice, wrap well and leave for 3-4 days before icing.", "To cover the cakes in marzipan, thin the apricot jam with a little water so it’s the consistency of double cream and bring this to the boil. Pour the hot jam through a sieve into a bowl, pressing any fruit pieces through to extract the liquid, then leave until warm before using.", "If the cakes have peaked in the middle during baking you will want to carefully slice it flat. But if the cake is just gently domed then there’s no need.", "Cover the 10cm/4in cake with marzipan. Smooth the edges with a cake smoother and set aside to dry in a cool, dark place for 4-5 days. Repeat with the 15cm/6in, 18cm/7in, 22cm/8½in, and 25cm/10in cakes. ", "Apply a thin layer of royal icing to each cake and leave to dry for 2-3 days, then apply another coat and leave to dry for a further 2-3 days. Sand the cakes with sandpaper for a really smooth finish.", "Spoon the leftover royal icing into a piping bag fitted with a small plain nozzle. Pipe small dots around top and bottom edge of each cake. For more elaborate decoration, you can cover the cake in small dots.", "To assemble the cake, place the 25cm/10in cake onto the 30cm/12in cake drum. Place the 12cm/4½in cake board into the middle of the 25cm/10in and mark four points around the edge in a square. Push a dowelling rod into the cake and mark where it reaches the top of the cake. Cut the rod and three others to the same length and insert them into the cake at the four points.", "Place the 12cm/4½in cake board onto the top of the dowelling rods and top with the 12cm/4½in polystyrene cake spacer. Place the 22cm/8½in cake on top. ", "Repeat with the 22cm/8½in cake and 18cm/7in cakes, finishing with the 15cm/6in cake. Insert dowelling rods into the 15cm/6in and finally place the 10cm/4in cake on top. Decorate with fresh or fondant flowers."]}, {"isVegetarian": false, "title": "Fabulous fish pie", "url": "www_bbc_co_uk_food_recipes_fabulous_fish_pie_89662", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fabulous_fish_pie_89662_16x9.jpg", "ingredients": ["600ml/1 pint 1fl oz full-fat milk", "1 onion, peeled and cut into sixths (keep the root intact)", "2 bay leaves", "500g/1lb 2oz thick white fish fillets, such as cod, haddock or pollock", "500g/1lb 2oz smoked haddock fillet, preferably undyed", "500g/1lb 2oz thick salmon fillet", "6 free-range eggs (optional)", "75g/3oz butter", "75g/3oz plain flour", "3 tbsp white wine", "100ml/3½fl oz double cream", "small bunch fresh dill, leaves removed ", "sea salt flakes and freshly ground black pepper", "1.25kg/2½lb potatoes, peeled and cut into even-sized pieces", "75g/3oz butter, cubed", "75ml/3fl oz double cream", "150g/5oz mature Cheddar, coarsely grated"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, pour the milk into a large saucepan and add the onion and bay leaves. Season with salt and freshly ground black pepper. Place the fish fillets in the pan and bring to a very gentle simmer. Cover with a lid and cook for two minutes. Remove from the heat and set aside to stand and infuse for five minutes until the fish is almost cooked. Drain the fish through a colander into a bowl, then pour the milk into a jug. ", "Meanwhile, for the topping, cook the potatoes in simmering water for 15 minutes or until the potatoes are soft. Drain in a colander then return to the pan and mash with the butter, cream and three-quarters of the grated cheese. Season to taste with salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6. ", "Fill a saucepan one-third full with water and bring to the boil. Gently add the eggs to the water and cook for nine minutes. Drain in a colander under running water for 1-2 minutes then transfer to a bowl of very cold water and set aside. ", "Melt the butter in a medium saucepan and stir in the flour. Cook for a few seconds, and then gradually add the infused milk, wine and cream, stirring over a medium heat for five minutes until the sauce is smooth and thick. Season with salt and freshly ground black pepper. ", "Remove the sauce from the heat and add the dill fronds into the sauce. Peel the eggs and cut in half.", "Spoon a third of the sauce into the base of a large ovenproof dish or 6-8 individual dishes. Scatter half the fish fillets over the sauce, breaking them into chunky pieces as you go, discarding the skin, onion and bay leaves. Place half the eggs on top and pour over another third of the sauce. Continue with the layering process until the ingredients are used up.", "Spoon the potato over the fish mixture, starting at the edges before making your way into the centre. Fluff up the potato with a fork and sprinkle with the remaining cheese. Place the dish on a baking tray and bake in the centre of the oven for about 45 minutes or until the top is golden-brown and the filling is bubbling. "]}, {"isVegetarian": true, "title": "Fabulous fruity jewelled tarts", "url": "www_bbc_co_uk_food_recipes_fabulous_fruity_jewelled_62910", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fabulous_fruity_jewelled_62910_16x9.jpg", "ingredients": ["350g/12oz plain flour, plus extra for dusting", "115g/4oz icing sugar, sifted", "pinch salt", "225g/8oz cold unsalted butter, cut into cubes", "1 free-range egg, plus 2 egg yolks, lightly beaten", "6 egg yolks", "90g/3¼oz caster sugar", "40g/1½oz cornflour", "450ml/16fl oz full-fat milk", "2 vanilla pods, split lengthwise", "50ml/2fl oz double cream", "45g/1½oz unsalted butter, cut into small pieces", "1-2 tbsp elderflower cordial, preferably homemade ", "400g/14oz mixed berries, such as redcurrants, blueberries, raspberries and strawberries", "170g/6oz redcurrant jelly, to glaze"], "serves": "Makes 12 individual tarts", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the flour, icing sugar and salt in a food processor and pulse briefly to combine. Add the butter and pulse briefly until the mixture resembles fine breadcrumbs. Add the beaten eggs and yolks and pulse until the mixture comes together. Turn out onto the work surface, knead very briefly and shape into a thick disc. Wrap the pastry in cling film and refrigerate for at least an hour.", "For the custard, put the egg yolks, caster sugar and cornflour in a bowl and mix well until combined. ", "Put the milk and split vanilla pods into a saucepan and bring just to the boil. Remove from the heat and carefully fish out the vanilla pods. Slowly pour the hot milk into the egg mixture, whisking all the time. ", "Return the custard to the saucepan and cook over a medium heat, stirring constantly until the mixture is very thick. Remove from the heat and transfer the custard to a large bowl. Stir in the cream and butter until completely combined, then add elderflower cordial to taste (you do not want it to be overpowering). Press baking parchment down onto the surface of the custard to prevent a skin forming and cool to room temperature, then chill in the fridge until needed.", "Grease twelve 10cm/4in fluted tart tins. On a lightly floured work surface, roll out the pastry to a 4mm thickness. Cut 11cm/4¼in circles from the pastry to line the tins, rerolling as necessary. Prick the bases with a fork and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Put a piece of baking parchment into each pastry case and fill with baking beans. Bake in a preheated oven for 15 minutes, then remove the beans and parchment and return to the oven for 5–8 more minutes, or until lightly golden-brown. Remove from oven and allow to cool.", "Heat the redcurrant jelly in a saucepan until melted. Brush the insides of the pastry shells with a thin layer of jelly.", "Fill the cases with the custard and top with a generous amount of fruit. Brush the fruits with jelly to give them a shine."]}, {"isVegetarian": true, "title": "Eton mess", "url": "www_bbc_co_uk_food_recipes_etonmess_81082", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/etonmess_81082_16x9.jpg", "ingredients": ["500g/1lb 2oz strawberries, hulls removed", "400ml/14fl oz double cream", "3 x 7.5cm/3in ready-made meringue nests, crushed", "1 tbsp ginger cordial (optional)", "sprigs of fresh mint, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Purée half the strawberries in a blender. Chop the remaining strawberries, reserving four for decoration.", "Whip the double cream until stiff peaks form, then fold in the strawberry purée and crushed meringue. Fold in the chopped strawberries and ginger cordial, if using. ", "Spoon equal amounts of the mixture into four cold wine glasses. Serve garnished with the remaining strawberries and a sprig of mint."]}, {"isVegetarian": false, "title": "Faggots with onion gravy", "url": "www_bbc_co_uk_food_recipes_faggotswithoniongrav_3899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 medium onion, peeled and finely chopped ", "175g/6oz minced pigs' liver ", "2 lamb or pigs' heart, trimmed and cut into chunks ", "450g/1lb belly of pork, trimmed and rind removed ", "½ tsp mace", "4tbsp freshly chopped chives ", "1 tsp freshly chopped sage ", "1 egg, beaten ", "salt and freshly ground pepper ", "115g/4oz fresh white bread crumbs ", "25g/1oz beef dripping or 3 tbsp olive oil ", "4 red onions, peeled and each onion cut into 8 wedges ", "4 sprigs of fresh thyme ", "1 tbsp olive oil ", "900ml/1½pt fresh beef stock ", "290ml/½ pint red wine ", "salt and freshly ground black pepper"], "serves": "Makes 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a small saucepan and add the onions. Cook until soft and transparent. Cool slightly", "Place the belly pork onto a chopping board and cut into portions. ", "Place the minced pigs' liver into a large glass bowl and place under the blade of a mincer. Using a fine blade of a mincer, mince the pork belly and lambs heart directly into the bowl with the pig s liver. If you do not have a mincer at home ask your butcher to mince all your meat for you. ", "Add the cooled chopped onions, mace, chives, sage, beaten egg and salt and pepper. Stir in the breadcrumbs. ", "Using your hands shape the mixture into 12 patties. Place on a plate and chill for about 1 hour. ", "Preheat the oven to 200C/400F/Gas 6. 7. For the gravy: place the onion wedges into a large roasting pan or ovenproof dish. Add the thyme and drizzle over the olive oil. Place in the oven and roast uncovered for 40 minutes until the onions are caramelised. ", "Meanwhile heat the dripping or olive oil in a large frying pan. Fry the faggots until golden brown on both sides. ", "Place the stock and wine in a small saucepan, bring to the boil and reduce by a third. ", "Remove the roasted onions from the oven and lay the faggots on top. Pour over the gravy liqueur. Reduce the oven temperature to 180C/350F/Gas 4 and cook the faggots for 40 minutes. ", "Place two to three faggots onto a plate. Top with a spoonful of the onions and pour over the gravy. Serve the faggots with mashed potatoes and green vegetables."]}, {"isVegetarian": true, "title": "Chocolate fairy cakes", "url": "www_bbc_co_uk_food_recipes_fairycakes_83889", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fairycakes_83889_16x9.jpg", "ingredients": ["4 free-range eggs", "225g/8oz sugar", "225g/8oz self-raising flour", "225g/8oz butter, melted", "110g/4oz butter, softened", "170g/6oz icing sugar", "55g/2oz cocoa powder, sifted", "1-2 tbsp milk", "white chocolate buttons", "milk chocolate buttons"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and lin 2 x 12-hole fairy cake tins with paper cases.", "Whisk the eggs and sugar together in a bowl until light and fluffy.", "Carefully fold in the flour and butter.", "Pour the mixture carefully into the paper cases.", "Bake the cakes for 15-20 minutes, or until golden-brown on top and a skewer inserted into one of the cakes comes out clean. Set aside to cool for 10 minutes on a wire rack before removing from the tin.", "To make the buttercream, beat the butter in a large bowl until soft. Add half of the icing sugar and beat until smooth.", "Add the remaining icing sugar, cocoa powder and one tablespoon of the milk and beat until creamy. Beat in more milk if necessary to loosen the icing.", "Once the cakes are cool, spread the buttercream icing on top of the cakes.", "Decorate the cakes with the chocolate buttons."]}, {"isVegetarian": true, "title": "Fairy cakes", "url": "www_bbc_co_uk_food_recipes_fairycakes_93711", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fairycakes_93711_16x9.jpg", "ingredients": ["110g/4oz butter or margarine, softened at room temperature", "110g/4oz caster sugar", "2 free-range eggs, lightly beaten", "1 tsp vanilla extract", "110g/4oz self-raising flour", "1-2 tbsp milk", "300g/10½oz icing sugar", "2-3 tbsp water", "2-3 drops food colouring", "hundreds and thousands, or other cake decorations"], "serves": "24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line 2 x 12-hole fairy cake tins with paper cases.", "Cream the butter and sugar together in a bowl until pale. Beat in the eggs, a little at a time, and stir in the vanilla extract.", "Fold in the flour using a large metal spoon. Add a little milk until the mixture is a soft dropping consistency and spoon the mixture into the paper cases until they are half full.", "Bake in the oven for 8-10 minutes, or until golden-brown on top and a skewer inserted into one of the cakes comes out clean. Set aside to cool for 10 minutes, then remove from the tin and cool on a wire rack.", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring. ", "To ice the fairy cakes, drizzle the icing over the cakes, sprinkle with decorations and set aside until the icing hardens."]}, {"isVegetarian": true, "title": "Veggie bean fajitas", "url": "www_bbc_co_uk_food_recipes_fajitas_8651", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fajitas_8651_16x9.jpg", "ingredients": ["2 tbsp vegetable oil ", "1 onion, chopped ", "1 red chilli, seeds removed and chopped ", "1 garlic clove, chopped ", "2 x 110g tins kidney beans, washed and drained ", "vegetable stock or water", "4 tomatoes, seeds removed and chopped", "½ red onion, chopped", "small bunch coriander, chopped ", "1 lime ", "1 packet of wheat tortillas ", "250ml/9fl oz plain yoghurt or soured cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, add the oil to a pan and cook the onion, chilli and garlic until softened. Add the beans and cook for a further 10 minutes, stirring occasionally. Add a little vegetable stock, about half a small glass, cook the beans until the mixture is smooth and not runny. ", "Mash the beans roughly with the back of a fork or a potato masher, then set aside.", "For the salsa, mix together the tomatoes, red onion, a squeeze of lime juice and a handful of the chopped fresh coriander.", "Just before you are ready to eat, add the remaining coriander and a squeeze of lime juice to the beans.", "Warm each tortilla through in a pan and put on a plate, spoon over some of the filling, add a spoonful of the yoghurt and a little salsa. Roll up and serve immediately."]}, {"isVegetarian": false, "title": "Fajitas with guacamole", "url": "www_bbc_co_uk_food_recipes_fajitaswithguacamole_90524", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fillet steak, cut into strips", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 ripe avocado, skinned and chopped", "1 garlic clove, crushed to a paste", "1 tbsp olive oil", "½ lime, zest and juice", "½ beef tomato, chopped", "2 tbsp chopped fresh coriander", "2 tortilla wraps", "2 tbsp Greek-style yoghurt"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the steak strips with salt and freshly ground black pepper. Heat the olive oil in a pan, then fry the steak for 1-2 minutes on both sides (for medium), or until cooked to your liking. Remove from the pan and allow to rest on a warm plate. ", "For the guacamole, mash the avocado and garlic together with a fork, and then mix in the remaining guacamole ingredients.", "To serve, wrap the steak, guacamole and yoghurt up in two tortilla wrap."]}, {"isVegetarian": true, "title": "Falafel three ways", "url": "www_bbc_co_uk_food_recipes_falafel_4_ways_22209", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/falafel_4_ways_22209_16x9.jpg", "ingredients": ["400g tin chickpeas, drained and rinsed", "1 small onion, roughly chopped", "2 garlic cloves, roughly chopped", "½ tsp ground coriander", "½ tsp ground cumin", "½ tsp ground cinnamon", "½ tsp flaked sea salt", "3 tbsp gram flour (chickpea)", "small bunch coriander leaves and stems, roughly chopped", "1 small free-range egg", "100g/3½oz sesame seeds, for rolling", "1 tbsp olive oil", "100g/3½oz tagliatelle", "1 tbsp olive oil", "1 garlic clove, thinly sliced", "pinch dried chilli flakes", "2 handfuls baby spinach", "4 cooked falafel", "2 tbsp finely chopped fresh parsley", "½ lemon, juice only", "3 cooked falafel", "1 pitta bread, cut into thin triangles", "2 tbsp olive oil", "sea salt", "½ Little Gem lettuce, thinly sliced", "½ small red onion, thinly sliced", "squeeze lemon juice", "1 tsp plain yoghurt, ideally Greek, to serve", "1 slice sourdough", "2 cooked falafel", "1 free-range egg", "1 tsp olive oil", "large pinch paprika, to garnish"], "serves": "Serves 1", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the falafel, tip the chickpeas, onion, garlic, spices, salt, gram flour, fresh coriander and egg into a food processor and pulse until it is blended but still has some texture. Roll the mixture into 12–15 small balls and coat each in sesame seeds. Refrigerate for 30 minutes, or until ready to use. To cook the falafel, heat the oil in a frying pan until medium–hot. Fry for 10 minutes, turning regularly, until golden and cooked through. ", "For the pasta, boil the tagliatelle following the packet instructions or until al dente, then drain well. Meanwhile, heat the oil in a frying pan, add the garlic and chilli and cook, stirring, for 1 minute. Add the spinach and stir for 1 minute or until wilted. Tip in the tagliatelle and parsley and heat through for a few seconds, stirring. To serve, top with four cooked falafel and squeeze over the lemon juice. ", "For the pittas, preheat the oven to 210C/190C Fan/Gas 6. Put the pitta triangles on a baking tray, drizzle over 1 tablespoon oil and sprinkle with sea salt. Bake for 5–10 minutes, or until crisp. Mix the Little Gem and red onion and dress with the remaining oil and the lemon juice. Serve with four cooked falafel and the yoghurt. ", "For the breakfast toast, toast the sourdough and top with the broken up falafel. Fry the egg in the oil over a high heat and place on top of the toast. Sprinkle over paprika and serve."]}, {"isVegetarian": true, "title": "Falafel footballs", "url": "www_bbc_co_uk_food_recipes_falafel_footballs_41881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil for greasing ", "1 tin kidney beans (240g drained weight) ", "1 garlic clove, peeled ", "1 spring onion ", "small handful fresh coriander ", "1 tsp dried cumin ", "1 tsp plain flour"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Brush a baking tray generously with vegetable oil.  Ask a grown-up to preheat the oven at 200C/400F/Gas 6. \t\t\t               \t\t\t", "Start by placing the drained beans and the garlic clove in the plastic bag and mashing with the rolling pin then transferring into bowl. ", "Ask a grown-up to help you use the scissors to cut off the roots and the dark green top of the spring onions – this is called topping and tailing. Finely cut up the rest of the spring onion and add to the beans. Then chop up the fresh coriander finely with the scissors and add it to the bean mash. ", "Sprinkle over the dried cumin, you can add more if you really like the taste. Sprinkle over the plain flour and mix everything together well.  Now squeeze the mixture with your hands until it all starts to stick together. ", "Divide the mixture into four equal portions and shape them in your hands into four balls – squeeze them again so that they hold their shape. Put on the oiled baking sheet and dab the top with a little more oil.\t ", "Ask a grown-up to put them in the oven for 12-15 minutes. Leave to cool for about five minutes to allow them to set before eating. Serve warm or cold in pitta pockets with salad leaves."]}, {"isVegetarian": true, "title": "Falafel", "url": "www_bbc_co_uk_food_recipes_falafel_80242", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/16oz dried chickpeas, soaked overnight", "3 large cloves garlic, finely chopped", "¼ large bunch fresh parsley, leaves only", "1 small onion, finely chopped (about twice as much as the amount of garlic)", "2 medium potatoes, boiled until tender, then peeled", "salt and freshly ground black pepper ", "¼ tsp bicarbonate of soda, dissolved in a little cold water", "dried chilli flakes, to taste", "1-2 tsp ground cumin", "sunflower oil, for frying", "3 tbsp tahini (sesame paste)", "1 tbsp water, or as needed", "1-2 lemons, juice only", "1 clove garlic, finely chopped"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Drain, rinse and dry soaked the chickpeas. Place the chickpeas in a food processor with the garlic and the parsley and process until the mixture is roughly chopped. Add the onion and potatoes and the salt and freshly ground black pepper to taste and blend again. The mixture should retain some texture. Sprinkle the bicarbonate and water mixture over the top of the chickpea mixture and let it sit for about 30 minutes. Sprinkle the chilli flakes and cumin over the mixture and mix in lightly.", "Form the mixture into balls, place on a baking tray, cover and refrigerate for about half an hour.", "Heat enough oil to shallow fry in a deep, heavy-bottomed pan. The oil is ready when a breadcrumb dropped into it will sizzle gently. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) Carefully place a few balls of falafel into the hot oil and fry for a minute or two, until the outside is brown and crisp. Cook the falafel balls in batches, removing with a slotted spoon when cooked and draining on kitchen towels.", "For the sauce, put three tablespoons of tahini into a deep dish. Add water a teaspoon at a time, until you have a mixture the consistency of thick cream (you may need a little more or a little less water). Add the juice of 1-2 lemons, to taste, and mix again. If the mixture becomes too thick, add a little water. Add the chopped garlic and mix again.", "Serve the falafels with the tahini sauce."]}, {"isVegetarian": true, "title": "Falafel burger with hummus", "url": "www_bbc_co_uk_food_recipes_falafelburgerwithhou_72037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/falafelburgerwithhou_72037_16x9.jpg", "ingredients": ["250g/9oz chickpeas, soaked overnight", "1 medium onion, very finely chopped", "2 cloves garlic, crushed or finely chopped", "2 tsp ground cumin", "2 tsp ground coriander seed", "6 tbsp chopped parsley", "½ tsp chilli powder", "2 rounded tbsp plain flour", "1 tsp salt", "Oil for deep fat frying", "125g/4½oz hummus", "2 tbsp extra virgin olive oil", "1-2 tbsp lemon juice", "1 tbsp tahini", "4 large rolls (or hamburger buns)", "1 fat tomato, sliced", "1 red onion sliced", "4 leaves butter lettuce", "salad or fries, or sautéed potatoes"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Drain the chickpeas thoroughly and pulse in the food processor until lightly broken up.  ", "Add the remaining ingredients and continue to pulse until you have the texture of coarse breadcrumbs.  Gently form into patties approx. 10cm/4in in diameter by 2½cm/1in. thick.", "Fry in hot oil at 180C/350F for 4-5 minutes, or until crisp or golden.", "For the hummus and tahini sauce simply whisk together all the ingredients.  If you prefer a lighter sauce add a little water until it is the preferred consistency.", "To serve, split and warm the rolls.  Place in the top of each roll a leaf of lettuce, a slice of tomato, and some red onions.  ", "Place the falafel burger on the bottom side of the roll, and some of the sauce.  ", "Either serve side by side on a plate, or built up as a burger on a plate with your choice of accompaniment.", "Cook and refrigerate or freeze any left over burgers for a quick and easy snack."]}]