[{"ingredients": ["1 filete de caballa, cortado por la mitad", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 rebanada de chapata, a la plancha", "1 manojo cohete", "2 cucharaditas de semillas de sésamo", "1 cucharada de aceite de oliva", "2 cucharaditas de vinagre de vino tinto", "sal y pimienta negra recién molida"], "method": ["Enrolle cada pieza de caballa y asegúrela con un palito de cóctel.", "Caliente el aceite de oliva en una sartén pequeña a fuego medio. Agregue la caballa y fría por dos minutos en cada lado, luego retire de la sartén y ponga en una rebanada de pan ciabatta.", "Para hacer el pesto de rúcula, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, vierta el pesto de rúcula sobre los rollos de caballa."], "url": "www_bbc_co_uk_food_recipes_mackerelrollswithroc_81705", "title": "Rollos de caballa con pesto de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar en polvo", "2 clementinas, cáscara y jugo solamente", "Harina normal 300g / 10½ oz", "2 cucharaditas de polvo de hornear", "pizca de sal", "3 huevos de gallinas camperas", "2 cucharadas de azúcar en polvo, para el relleno"], "method": ["Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3. Unte con mantequilla y forre una lata de pan grande.", "Para untar la mantequilla, el azúcar en polvo y la ralladura de clementina, puede hacerlo en una batidora de pie o con batidores eléctricos de mano.", "Mezcle la harina y el polvo de hornear con una pizca de sal. Agregue los huevos uno por uno a la mezcla de azúcar y mantequilla, rociando un par de cucharadas de harina con cada adición y mezcle bien.", "Doble el resto de la harina seguido del jugo de clementina: la textura será un poco más firme que la consistencia que necesita para una esponja más liviana.", "Raspe la mezcla en la lata preparada y espolvoree con el azúcar impalpable. Hornee en el horno por entre 55-60 minutos, o hasta que salga limpio un pincho de pastel. El pastel tendrá un color dorado intenso y puede haberse agrietado longitudinalmente por la mitad; esto es normal para un pastel de Madeira.", "Retire del horno y deje enfriar en la lata antes de transferir a una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_madeira_cake_38104", "title": "pastel de Madeira", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 vaina de vainilla, solo semillas (o unas gotas de extracto de vainilla)", "175g / 6oz azúcar moreno claro y suave", "2 cucharadas de ron oscuro, bacalao o licor de grosella negra", "2 cucharaditas de canela molida", "2 cucharaditas de jengibre molido", "1 kg / 2 lb 4 oz de bayas frescas de verano (como una mezcla de frambuesas, arándanos, moras y grosellas rojas), sin tallos", "2 pasteles de pan de Madeira", "pequeño puñado de hojas de menta fresca, para decoración", "Crema doble de 125ml / 4oz", "100 g / 3½ oz de chocolate negro (o una mezcla de leche oscura y leche si se prefiere), finamente picado", "3 cucharadas de agua recién hervida"], "method": ["Ponga el azúcar en una sartén grande con 100 ml de agua, colóquelo a fuego medio y revuelva hasta que el azúcar se disuelva. Agregue el alcohol, las semillas de vainilla (o extracto) y luego suba el fuego y déjelo burbujear durante 3-4 minutos para hacer un almíbar diluido. Baje el fuego a bajo y agregue la canela y el jengibre.", "Reserve 250 g / 9 oz de las bayas para la decoración y coloque aproximadamente la cuarta parte del resto en un recipiente aparte. Agregue todas las bayas restantes a la sartén y revuélvalas suavemente. Deje que se cocine durante dos minutos, o hasta que la fruta esté suave pero manteniendo su forma. Retirar del fuego y dejar enfriar durante 20 minutos. La salsa ahora debe ser almibarada, de color rojo oscuro y muy brillante.", "Mientras tanto, forre una lata de hogaza de 900 g / 2 libras con una capa doble de película adhesiva, dejando cualquier exceso colgando sobre el borde. Rebana cada pastel de Madeira en ocho rebanadas de 2cm / ¾in.", "Revuelva el cuarto reservado de bayas suavemente en la salsa enfriada. Incline la mezcla en un tamiz grande colocado sobre un recipiente mediano. Deje actuar durante dos minutos para permitir que el jarabe se drene, pero no presione ya que no desea que la fruta se vuelva blanda. Siente el tamiz en la sartén para que pueda usar el jarabe con sabor a fruta que tiene en el tazón por ahora.", "Sumerja una rebanada de pastel de Madeira en el almíbar, voltéelo y deje que el exceso de jarabe gotee. Colóquelo contra uno de los lados largos del molde de pan. Continúe sumergiendo las rebanadas en el almíbar y use 3-4 rebanadas a lo largo de cada lado de la lata para cubrir. Coloque uno en cada extremo y luego 2-3 rebanadas a lo largo de la parte inferior, separándolo para ajustarlo, si es necesario. Reserve las rebanadas restantes para la parte superior.", "Incline las bayas del tamiz en la lata de hojaldre con la torta, extendiéndolas uniformemente. Agregue cualquier jarabe en la sartén al sirope restante en el tazón y sumerja las rebanadas restantes de Madeira para cubrir como antes. Presione las rebanadas en la parte superior de las bayas para cubrir por completo. Reserve cualquier jarabe restante y guárdelo cubierto en el refrigerador para usarlo más adelante.", "Cubra el pan con el exceso de película adhesiva y coloque una bandeja pequeña para hornear o una placa larga en la parte superior. Si tiene espacio en su refrigerador, puede pesar la bandeja con un par de latas de comida o algo similar para ayudar a comprimir la fruta. Coloque en el refrigerador durante aproximadamente seis horas, o durante la noche, hasta que esté firme.", "Aproximadamente 10 minutos antes de servir, prepare la salsa de chocolate. Coloque la crema en una sartén mediana a fuego medio y manténgala cerca, retire antes de que hierva. Rompa el chocolate en la crema y déjelo derretir durante cinco minutos antes de mezclarlo suavemente. Agregue el agua caliente para dar una consistencia fluida y fluida. Vierta en una jarra para servir y manténgase caliente.", "Abra la película adhesiva en la torta de Madeira, voltee un plato de servir al revés en la parte superior del pan y revuélvalos. Retire la lata y despegue la película adhesiva para revelar el pudin. Cepille todo con el jarabe reservado y decore la parte superior con las bayas reservadas y las hojas de menta. Sirve a la vez con la salsa de chocolate. El pan se puede cortar en ocho rebanadas con un cuchillo largo y afilado."], "url": "www_bbc_co_uk_food_recipes_madeira_summer_pudding_67882", "title": "Pudín de verano de Madeira con salsa de chocolate caliente", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeira_summer_pudding_67882_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla, a temperatura ambiente", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas", "Harina de auto aumento 250g / 9 oz", "2-3 cucharadas de leche", "1 limón, ralladura solamente", "1-2 piezas delgadas de cidra confitada o cáscara de limón, para decorar"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un molde para pastel redondo de 18 cm / 7 pulgadas, forre la base con papel resistente a la grasa y engrase el papel.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos y esponjosos. Batir los huevos, uno a la vez, batiendo bien la mezcla entre cada uno y agregando una cucharada de la harina con el último huevo para evitar que la mezcla se cuaje.", "Tamizar la harina y doblar suavemente, con suficiente leche para dar una mezcla que cae lentamente de la cuchara. Doble la ralladura de limón.", "Coloque la mezcla en la lata preparada y nivele ligeramente la parte superior. Hornee en el estante del medio del horno por 30-40 minutos, o hasta que se dore por arriba y una broche insertada en el centro salga limpia.", "Retírelo del horno y déjelo enfriar en la lata durante 10 minutos, luego póngalo en una rejilla y déjelo enfriar por completo.", "Para servir, decora el pastel con la cáscara confitada."], "url": "www_bbc_co_uk_food_recipes_madeiracake_73878", "title": "pastel de Madeira", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 torta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeiracake_73878_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mermelada de frambuesa 70 g / 3 oz", "Pastel madeira 225 g / 8 oz, en rodajas", "200g / 7oz de frambuesas frescas", "150ml / 5fl oz de vino de Madeira", "570ml / 1 litro de leche", "1 vaina de vainilla dividida", "50 g / 1 oz de azúcar en polvo", "6 yemas de huevo", "2 naranjas, solo cáscara", "400 ml / 14 fl oz crema doble", "25g / 1oz de almendras copos tostadas"], "method": ["Extienda la mermelada sobre las rebanadas de pastel de madeira y colóquela en el fondo de un plato grande de vidrio, o divídala de manera pareja entre seis vasos altos.", "Vierta la madeira sobre la torta y espolvoree las frambuesas frescas sobre la parte superior.", "Para hacer la crema pastelera, hierva la leche con la vaina de vainilla partida. En otro recipiente, mezcle el azúcar con las yemas de huevo.", "Una vez que la leche esté hirviendo, vierta sobre la mezcla de huevo y vuelva a la sartén. Regrese al fuego y revuelva hasta que cubra la parte trasera de una cuchara de madera (no permita que la mezcla hierva o se cuajará). Pase a través de un colador, agregue la cáscara de naranja y deje enfriar. Vierta sobre la torta de Madeira y las frambuesas.", "Batir la crema doble. Pipe o extender la crema doble en la parte superior.", "Refrigere durante la noche y espolvoree con las almendras copos tostadas justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_madeiratriflewithras_83891", "title": "Madeira bagatela con frambuesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de harina natural, más extra para espolvorear", "1 limón, jugo y ralladura", "¾ cucharadita de polvo de hornear", "100 g / 3½ oz de mantequilla, derretida y enfriada ligeramente, más extra para engrasar"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cepille la bandeja de madeleine con mantequilla derretida y luego agite con un poco de harina para cubrir, taponando el exceso.", "Batir los huevos y el azúcar en un bol hasta que estén espumosos. Batir ligeramente con los ingredientes restantes. Deje reposar por 20 minutos antes de verter cuidadosamente en la bandeja de madeleine preparada.", "Hornee por 8-10 minutos, o hasta que la mezcla se haya levantado un poco en el medio y esté completamente cocida. Transfiera las magdalenas a una rejilla y deje que se enfríen durante unos minutos. Estos se comen mejor a la hora de cocinar."], "url": "www_bbc_co_uk_food_recipes_madeleine_15211", "title": "magdalenas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12-16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeleine_15211_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal, derretida, más extra para engrasar", "Harina normal de 250g / 9oz, más extra para espolvorear", "Azúcar en polvo 360g / 12½oz", "1 cucharadita de extracto de vainilla", "3 huevos de gallinas camperas", "2 cucharadas de miel líquida", "Frambuesas 300 g / 11 oz", "1 cucharada de azúcar glas", "Helado de vainilla 500ml / 18fl oz, para servir"], "method": ["Precalienta el horno a 170 ° C / 325 ° F / Gas 3. Manteca y enharina una lata de magdalena.", "Para las magdalenas, coloque la harina y 250 g / 9 oz del azúcar impalpable en un tazón y agregue el extracto de vainilla, los huevos, la miel y la mantequilla derretida.", "Revuelva bien y agregue una cucharada colmada de la mezcla en una lata de madeleine.", "Hornee durante 15-20 minutos hasta que estén dorados y elásticos al tacto. Polvo con el azúcar impalpable restante.", "Para la compota de frambuesa, coloque las frambuesas y el azúcar glas en una sartén a fuego medio.", "Caliente hasta que las frambuesas estén comenzando a descomponerse, agregue un chorrito de agua si es necesario.", "Vierta la compota de frambuesa en un plato de sopa, coloque una bola de helado en el centro y coloque unas magdalenas al lado."], "url": "www_bbc_co_uk_food_recipes_madeleines_with_89100", "title": "Madeleines con compota de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "130g / 4½ oz de azúcar", "Harina normal de 200g / 7oz", "10g / ¼ oz de levadura en polvo", "1 limón sin cebar, ralladura fina solamente", "20 g / oz de miel", "4 cucharadas de leche", "200g / 7oz de mantequilla, derretida y enfriada", "cestito de frambuesas", "azúcar en polvo, para quitar el polvo", "1 limón sin cebar, ralladura fina y jugo solamente", "pizca de sal", "40g / 1½ oz de azúcar", "45g / 1¾oz de mantequilla", "2 yemas de huevo de gallinas camperas"], "method": ["Batir los huevos con el azúcar hasta que estén pálidos y espumosos. Coloque la harina y el polvo de hornear en un recipiente aparte y agregue la ralladura de limón.", "Mezcle la miel y la leche con la mantequilla enfriada, luego agregue a los huevos. En dos lotes, dobla la harina. Cubra y deje reposar en la nevera durante unas horas, o durante la noche.", "Mientras tanto, haz la cuajada de limón. Ponga la ralladura de limón y el jugo, la sal, el azúcar y la mantequilla en una cacerola pequeña y caliéntelo suavemente hasta que el azúcar y la mantequilla se hayan derretido. Retire del fuego.", "Batir las yemas de huevo en un recipiente, luego agregar a la sartén y batir con fuerza. Regrese la sartén a fuego lento y bata constantemente a medida que la cuajada comienza a espesarse. No deje de batir o los huevos se cuajarán (si la cuajada comienza a hervir, quite el fuego). Una vez que la cuajada se espesa y libera una o dos burbujas, retírela del fuego y pase la cuajada a través de un colador en un recipiente. Coloque la película adhesiva en contacto directo con la cuajada y refrigere durante al menos una hora, preferiblemente durante la noche.", "Cuando esté listo para hornear, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Unte con mantequilla y enharine una lata de madeleine de 12 caparazones. Ponga la cuajada de limón en una manga pastelera equipada con una boquilla pequeña y puntiaguda y colóquela en la nevera.", "Ponga una cucharada colmada de masa en cada capa de madeleine y presione una frambuesa en la masa.", "Hornee durante cinco minutos y apague el horno durante un minuto (las magdalenas obtendrán sus picos característicos), luego encienda el horno a 160 ° C / 325 ° F / Gas 3 y hornee por otros cinco minutos. Transfiera las magdalenas a una rejilla de alambre y déjelas durante unos minutos hasta que estén lo suficientemente frías para manipularlas. Mientras tanto, lava y seca la lata, luego repite la cocción como para el primer lote.", "Mientras el segundo lote se hornea, coloque la boquilla de la tubería en el montículo en cada magdalena al horno y chorree en una cucharada de cuajada de limón. Repita con el segundo lote, luego espolvoree con azúcar glas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_madeleines_with_lemon_65371", "title": "Magdalenas con cuajada de limón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 20-24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeleines_with_lemon_65371_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de semillas de cilantro", "2 cucharadas de semillas de alholva", "1 cucharada de semillas de mostaza", "1 cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "1 cucharadita de pimienta negra", "1 ramita de canela", "5 dientes", "3 vainas de cardamomo, semillas retiradas", "1 cucharada de cúrcuma molida", "2 hojas de laurel aplastadas", "2 cucharadas de aceite vegetal", "1 pollo entero", "1 cucharada de aceite vegetal", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "2 chiles rojos, sin grano y finamente picados", "2 cm / 1 en pieza de jengibre fresco y picado", "10 hojas de curry", "2 cucharaditas de pasta de tamarindo", "1 x 400 g / 14 oz de tomates de hojalata", "300ml / 10½fl oz de caldo de pollo", "2 cucharadas de cilantro fresco", "2 cucharadas de aceite vegetal", "1 cebolla, finamente rebanada", "3 vainas de cardamomo verde, aplastadas", "1 palito de canela, partido por la mitad", "4 dientes", "400g / 14oz de arroz basmati"], "method": ["Para el adobo, caliente una sartén pequeña, una vez caliente agregue las semillas de cilantro, semillas de alholva, semillas de mostaza, semillas de comino, semillas de hinojo, pimienta negra, canela, clavo de olor y semillas de cardamomo. Una vez que comiencen a pop, agrégalos a un molinillo de especias o a una mano de mortero y licúa hasta que tengas un polvo fino.", "Coloque las especias molidas, el polvo de cúrcuma y las hojas de laurel en un tazón pequeño y mezcle con el aceite. Extienda la mitad del adobo por todo el pollo y déjelo marinar durante 24 horas.", "Para cocinar el pollo, precaliente el horno a 180C / 350F / Gas 4.", "Ase el pollo durante 1-1½ horas, dependiendo del tamaño de su pollo. Para comprobar si el pollo está listo, perfore el pollo por la pierna y el muslo, si los jugos se limpian, el pollo estará cocido. Reservar para descansar", "Mientras tanto, para el curry, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue la pasta de adobo restante y cocine durante unos minutos. Agregue la cebolla, el ajo, el chile, el jengibre, las hojas de curry y la pasta de tamarindo y cocínelos durante 2-3 minutos más. Agregue los tomates y el caldo y cocine por 10-15 minutos.", "Corta el pollo en ocho porciones. Agregue el pollo a la salsa y cocine por 3-4 minutos, o hasta que el pollo esté caliente.", "Para el arroz pilaf, caliente el aceite en una cacerola grande y, una vez caliente, agregue la cebolla. Cocine hasta que las cebollas estén doradas, esto tomará aproximadamente 10 minutos.", "Agregue el cardamomo, la canela y el clavo de olor. Agregue el arroz y revuelva para cubrir con la mezcla de especias de cebolla. Agregue 600ml / 20fl oz de agua y lleve a ebullición, reduzca el fuego a bajo y cubra con una tapa. Cocine por 15 minutos, luego apague el fuego, dejando la tapa puesta, y deje que hierva durante otros 15 minutos.", "Para servir, coloca el curry en tazones poco profundos y espolvorea sobre el cilantro picado. Sirva el arroz en un recipiente aparte."], "url": "www_bbc_co_uk_food_recipes_madras_chicken_curry_82454", "title": "Pollo al curry madras con arroz pilaf", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal", "1 cucharada de semillas de mostaza amarilla", "1 cebolla grande, finamente picada", "3 dientes de ajo, finamente triturados", "30 hojas frescas de curry", "2 cucharaditas de chile en polvo Kashmiri", "2 cucharaditas de cilantro molido", "2 cucharaditas de cúrcuma molida", "400 g / 14 oz pueden cortar tomates", "100ml / 3½fl oz de líquido de tamarindo", "2 chiles verdes, cada uno cortado longitudinalmente en 6 piezas, con semillas", "1 cucharadita de sal", "Filetes de pargo de 700 g / 1 lb 9 oz, cortados en trozos de 5 cm / 2 pulgadas", "arroz basmati hervido, para servir"], "method": ["Calentar el aceite en una cacerola de base pesada o karahi a fuego medio. Cuando esté caliente, agregue las semillas de mostaza y fría por 30 segundos, luego mezcle la cebolla y el ajo y fríe suavemente durante unos 10 minutos, o hasta que estén suaves y ligeramente doradas.", "Agregue las hojas de curry, el chile en polvo, el cilantro y la cúrcuma y fría por dos minutos, luego agregue los tomates, el tamarindo líquido, los chiles verdes y la sal y cocine a fuego lento durante unos 10 minutos, o hasta que estén jugosos y reducidos. Agregue el pescado, cocine durante otros cinco minutos o hasta que esté recién cocido, y sirva con arroz natural."], "url": "www_bbc_co_uk_food_recipes_madras_fish_curry_of_82254", "title": "Pescado al curry Madrás de pargo, tomate y tamarindo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tallos de perejil picados", "1 x 105g / 3½ oz de salmón de hojalata", "1 cebolleta, en rodajas", "1 rebanada de pan rancio, rallado en pan rallado", "1 cucharada de ketchup de tomate", "aceite de oliva, para engrasar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle el salmón, el perejil, la cebolleta, una cucharada de pan rallado y el ketchup juntos en un tazón. Sazonar con pimienta negra recién molida y mezclar hasta que esté bien combinado.", "Divida la mezcla en dos y enrolle en bolas.", "Espolvoree las migas de pan restantes en un lugar y enrolle cada torta de pescado en las migas de pan hasta que estén cubiertas.", "Póngalos en una bandeja para hornear y aplaste ligeramente con las manos. Rocíe con un poco de aceite de oliva.", "Hornee durante 10-15 minutos o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_magic_mini_fishcakes_42086", "title": "Magic mini fishcakes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de arroz con leche sin cocinar", "250 g / 9 oz de carne de cordero", "buen azafrán pizcador", "1 cucharadita de sal", "1 cucharadita de pimienta negra recién molida", "1 cucharadita de comino molido", "½ cucharadita de polvo de cardamomo", "1 cucharada de ghee o aceite vegetal", "8 calabacines pequeños, sin corazón", "8 berenjenas bebé, sin corazón", "6 mini pimientos, sin corazón", "1 bulbo de ajo, clavos separados", "2 cucharadas de puré de tomate", "2 ramitas de menta fresca, hojas recogidas", "1 cucharada de ghee o aceite vegetal", "2 cebollas tiernas, finamente picadas", "1 cilantro fresco pequeño, finamente picado", "1 manojo pequeño de perejil fresco, finamente picado", "1-2 ramitas de menta fresca, hojas recogidas y finamente picadas", "Cohete 120g / 4½ oz", "8 panes pitta, tostados"], "method": ["Para hacer el relleno, mezcle los ingredientes en un tazón grande.", "Para hacer las verduras, rellenar los calabacines, las berenjenas y los pimientos con el relleno.", "Ponga el ghee en una olla grande con tapa y coloque las verduras rellenas en una sola capa si puede. Meta los dientes de ajo en y alrededor.", "Mezcle el puré de tomate con 800ml / 1pint 8fl oz de agua tibia y la menta, luego vierta en la sartén. Cubra con una tapa, deje que hierva, luego reduzca el fuego a fuego lento y cocine a fuego lento durante 40 minutos.", "Sirva las verduras rellenas y los jugos de cocina con cebolletas, hierbas y cohetes dispersos en la parte superior y los panes pitta en el lado para absorber los jugos."], "url": "www_bbc_co_uk_food_recipes_mahshi_lebanese_stuffed_94132", "title": "Mahshi (verduras rellenas libanesas)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva ligero o aceite vegetal", "3 zanahorias, peladas y picadas", "1 cebolla roja, cortada en cuñas", "5 alitas de pollo", "1 vaso grande de vino blanco (opcional)", "1-2 cucharadas de harina de mafz, dependiendo de qué tan grueso te guste tu salsa", "2 litros / 3½ pintas de caldo de pollo o pavo (de 2 cubos de reserva o macetas de gelatina)"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Mezcle el aceite, las zanahorias, la cebolla y las alitas de pollo en una lata para asar. Asar durante 45 minutos hasta que el pollo esté dorado y las verduras suaves.", "Coloque la lata de asar sobre la placa a fuego medio. Agregue el vino blanco, si está usando, o vierta un vaso de agua. De glasear la lata y raspar cualquier trozos caramelizados en el fondo de la lata. Retire del fuego.", "Use una cuchara con ranura para transferir las verduras y el pollo a una olla grande. Agregue la harina de maíz hasta que se combinen. Agregue el líquido de la lata de asar y el caldo. Llevar a ebullición y hervir a fuego lento durante 15-20 minutos. Mientras burbujea use un tenedor para romper el pollo y las verduras tanto como pueda.", "Cuele la salsa a través de un colador fino en un recipiente congelable, empujando a través de la mayor cantidad de pollo y verduras que pueda. Sazonar, al gusto, con sal y pimienta.", "Permita que la salsa se enfríe por completo. Luego cubra con una tapa y transfiéralo al congelador. (Se mantendrá en el congelador por hasta 3 meses). Descongele en el refrigerador la noche antes de que quiera servirlo.", "Recalentar en el microondas durante 4 minutos a temperatura alta. Alternativamente, si tiene tiempo, agréguelo a la bandeja de asar cuando el pavo esté en reposo. Calienta suavemente y revuelve bien para incorporar todos los sabores del pavo. Revuelva bien y transfiéralo a una jarra de servir."], "url": "www_bbc_co_uk_food_recipes_make-ahead_christmas_33532", "title": "Salsa de Navidad con anticipación", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/make-ahead_christmas_33532_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["375g / 13oz de hojaldre", "50g / 1¾oz de mantequilla, ablandada", "50 g / 1 oz de azúcar en polvo", "1 huevo de gallinas camperas, golpeado", "1 cucharada de harina normal", "50 g / 1¾oz de almendras molidas", "½ cucharadita de nuez moscada rallada o maza molida", "2 limones, solo cáscara", "Queso cuajado de 100 g / 3½ oz"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Haga rodar la masa un poco más delgada que una moneda de una libra, luego elimine doce rondas de 9cm / 3½ pulgadas y úsela para alinear una lata de empanada antiadherente de 12 agujeros. Coloque la bandeja de discos de pastelería en la nevera mientras realiza el llenado.", "Crema la mantequilla y el azúcar en un tazón hasta que quede pálido y esponjoso. Agregue el huevo, la harina, las almendras molidas, la nuez moscada (macis macerada) y la ralladura de limón. Agregue el queso cuajado, teniendo cuidado de no trabajar demasiado la mezcla ya que se puede partir.", "Coloque la mezcla en las cajas de tartas y hornee por 25 minutos, o hasta que se haya levantado y dorado ligeramente en la parte superior. Transfiera a una rejilla de alambre y deje enfriar completamente antes de servir."], "url": "www_bbc_co_uk_food_recipes_maids_of_honour_tarts_94296", "title": "Tartas de las Sirvientas de Honor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["botón de mantequilla", "2 cucharadas de aceite de oliva", "1 cebolla, finamente rebanada o picada", "1 cucharadita de canela molida", "½ cucharadita de nuez moscada molida (opcional)", "1 x 600 g / 1 libra de col roja de 5 onzas, desmenuzada finamente con un procesador de alimentos (núcleo blanco descartado)", "3 cucharadas de azúcar morena", "3 comiendo manzanas, peladas, sin corazón y en cubitos", "100ml / 3½fl oz de vinagre de vino tinto", "2 cucharaditas de grosella o salsa de arándano (opcional)"], "method": ["Caliente la mantequilla y el aceite en una olla grande con tapa. Cuando esté caliente, agregue la cebolla y freír suavemente hasta que se ablande. Revuelva en las especias. Agregue el repollo y fría por 3-4 minutos, revolviendo ocasionalmente, hasta que quede brillante.", "Agregue el azúcar, las manzanas y el vinagre de vino tinto. Cubra con una tapa y deje que se cocine suavemente durante 30 minutos.", "Agregue la salsa de grosella roja o de arándano (si se usa) y cocine por otros 10 minutos. Si no está usando la salsa, pruebe el repollo y agregue un poco más de azúcar si es demasiado ácido para su gusto."], "url": "www_bbc_co_uk_food_recipes_make-ahead_red_cabbage_13106", "title": "Repollo rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/make-ahead_red_cabbage_13106_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de azúcar en polvo", "2 cucharadas de vinagre de vino blanco", "Jengibre de raíz de 2.5cm / 1in, pelado y rebanado en una mandolina", "1 hoja de nori (algas secas japonesas)", "100 g / 3½ oz de arroz cocido o arroz de sushi japonés (arroz pegajoso y arroz de sushi están disponibles en algunas tiendas de comestibles asiáticas)", "Filete de atún 85g / 3oz, cortado en tiras finas", "4-5 palitos de pepino", "½ aguacate, rebanado longitudinalmente", "vinagre de vino blanco o vinagre de vino de arroz, para cepillar"], "method": ["Para el jengibre en escabeche, coloque el azúcar y el vinagre en una olla pequeña y caliente suavemente hasta que el azúcar se disuelva. Retire del fuego, agregue el jengibre rebanado y revuelva para cubrir. Poner a un lado y dejar enfriar durante cinco minutos.", "Para los rollos de maki, coloque la hoja de nori en una estera de bambú de sushi. Extiende el arroz sobre dos tercios de la hoja, dejando un borde de 1 cm / ½ pulgada en la parte superior.", "Extienda las tiras de atún y los palitos de pepino longitudinalmente sobre la sábana, luego coloque las rodajas de aguacate encima.", "Cepille el borde con vinagre y enrolle la lámina de nori muy apretada sobre el relleno usando la estera de bambú, para hacer una forma de cigarro, sellando a través del borde en la parte superior.", "Para servir, corte el rollo en rondas y colóquelo en un plato para servir con el jengibre en escabeche."], "url": "www_bbc_co_uk_food_recipes_makirollswithpickled_85325", "title": "Maki rueda con jengibre encurtido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 dientes", "10 granos de pimienta negra", "4 vainas de cardamomo", "1 ramita de canela", "4 chiles rojos secos", "4 cucharadas de semillas de cilantro", "2 cucharadas de semillas de comino", "1 cucharadita de semillas de hinojo", "1 estrella de anís", "1 cucharadita de polvo de cúrcuma", "2 cucharadas de aceite vegetal, o ghee", "Pierna de cordero de 500g / 1lb 2oz, cortada en cubos de 5cm / 2in", "2 cebollas, peladas, en rodajas finas", "1cm / ½en raíz de jengibre, pelado, rallado", "1 diente de ajo, pelado, aplastado", "1½ cucharadas de curry en polvo de Malasia (ver arriba)", "1 cucharadita de chile en polvo", "sal", "½ cucharadita de hilos de azafrán, empapados en 50 ml / 2 fl oz de agua tibia", "Anacardos 110g / 4oz, mezclados a una pasta con 2 cucharadas de agua", "1 ramita de canela", "250 ml / 9 fl oz oz yogur", "2 tomates, cortados en cuartos", "2 cucharadas de hojas de cilantro fresco picado", "Arroz basmati de 300g / 11oz, cocinado según las instrucciones del paquete, para servir"], "method": ["Para el polvo de curry de Malasia, tueste todas las especias, excepto la cúrcuma, en una sartén seca, durante 30 segundos-1 minuto, o hasta que se vuelvan fragantes. Dejar enfriar un poco.", "Moler las especias tostadas y la cúrcuma en un polvo con un mortero y un mortero.", "Para el korma malayo, caliente una cucharada de aceite en un wok con tapa, agregue el cordero, en tandas si es necesario, y saltee durante 2-3 minutos, o hasta que se dore por todas partes. Retire el cordero del wok y déjelo a un lado.", "Calentar el aceite restante en el wok utilizado para cocinar el cordero y freír la cebolla, el jengibre, el ajo, 1 ½ cucharadas de curry de Malasia en polvo y todo el chile en polvo durante 1-2 minutos, o hasta que esté fragante (NB: No dejes la mezcla se quema).", "Agregue el cordero reservado al wok y sazone al gusto, con sal. Revuelva hasta que esté bien combinado. Agregue los hilos de azafrán y el agua empapada, la pasta de anacardo, la rama de canela, luego vierta suficiente agua para cubrir el cordero en 2,5 cm. Ponga la mezcla a ebullición, luego reduzca el fuego, cubra el wok con la tapa y cocine a fuego lento, revolviendo ocasionalmente, durante 1¼-1½ horas. (Es posible que necesite agregar más agua si la mezcla comienza a secarse).", "Agregue el yogur y los tomates y vuelva a hervir a fuego lento durante 1-2 minutos.", "Para servir, coloca el arroz en una cuchara en cada uno de los 4 tazones para servir, tapa cada tazón con un poco de curry de cordero y decora con las hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_malaylambkorma_93512", "title": "Cordero malayo korma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas, descuartizadas", "Jengibre fresco de la raíz 20g / ¾oz, pelado, rallado grueso", "6 dientes de ajo, pelados", "2 cucharadas de polvo de curry medio", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de cúrcuma molida", "2 cucharadas de aceite de girasol", "8 muslos de pollo deshuesados, despellejados, partidos por la mitad", "1 ramita de canela", "Anís de 3 estrellas", "500g / 1lb 2oz de papas cerosas grandes, peladas, cortadas en trozos de 3cm / 1¼ en", "3 zanahorias, peladas, cortadas en 1.5cm / ½ en rondas", "2 cucharadas de harina de maíz", "Leche de coco de estaño 400ml", "150 g / 5 oz de judías verdes, recortadas y cortadas por la mitad", "pimienta negra recién molida"], "method": ["Coloque todos los ingredientes de pasta de curry en un procesador de alimentos y mezcle. Tendrá que quitar la tapa y empujar la mezcla hacia abajo un par de veces con una espátula de goma.", "Caliente una sartén grande y antiadherente a fuego medio. Vierta la pasta de curry y cocine por 2-3 minutos, revolviendo constantemente, hasta que esté fragante.", "Sazonar los muslos de pollo por todos lados con mucha pimienta.", "Agregue los muslos de pollo, la canela y el anís estrellado a la cacerola, revuelva bien y cocine por 2-3 minutos, volteando las piezas de pollo una o dos veces hasta que estén doradas.", "Agregue 100 ml / 3½ fl oz de agua y lleve la mezcla a ebullición. Transfiera a la olla de cocción lenta y agregue las papas y las zanahorias.", "En un recipiente, mezcle 2 cucharadas de agua con la harina de maíz para formar una pasta fina. Agregue la leche de coco y vierta sobre el curry. Revuelva bien para combinar.", "Cubra y cocine a fuego alto durante 3 horas, o hasta que el pollo y las verduras estén tiernos y la salsa se haya espesado. Justo antes del final del tiempo de cocción, agregue las judías verdes.", "Sirva el curry tal como está, o con pequeñas porciones de arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_malaysian-style_chicken_98338", "title": "Curry de pollo al estilo malayo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/malaysian-style_chicken_98338_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450g / 1lb de gambas crudas, sin cáscara y desvainadas", "Brotes de soja fresca 225 g / 8 oz, enjuagados", "Harina normal de 120g / 4½oz", "2 cucharaditas de polvo de hornear", "2 chiles rojos frescos y pequeños, sin semillas y finamente picados", "1 cucharadita de cilantro molido", "½ cucharadita de cúrcuma molida", "2 cucharadas de cebolletas finamente picadas", "2 cucharadas de cilantro fresco finamente picado", "1 cucharadita de sal", "2 huevos, golpeados", "400ml / 14fl oz de aceite, preferiblemente maní, para freír", "pimienta negra recién molida", "1.25 kg / 12 oz bok choy", "Aceite de cacahuete 900ml / 30fl oz", "1 cucharadita de sal", "2 cucharaditas de azúcar", "50g / 2oz de piñones, ligeramente asados"], "method": ["Cortar finamente la mitad de las gambas.", "Combine las gambas picadas con los brotes de soja, la harina, el polvo de hornear, los chiles, el cilantro molido, la cúrcuma, las cebolletas, el cilantro fresco, la sal, la pimienta y los huevos. Mezclar bien.", "Tome una cucharada sopera de la mezcla picada, coloque una gamba entera encima y presione en la mezcla para que la gamba esté lista. Continúe hasta que haya agotado toda la mezcla y los langostinos enteros.", "Caliente el aceite en una freidora o en un wok grande.", "Freír los buñuelos, unos pocos a la vez, durante 2-3 minutos, hasta que estén dorados. Escurrirlos en papel de cocina y servir a la vez.", "Para las algas marinas, separe los tallos del tallo del bok choi y luego corte las hojas verdes de los tallos blancos.", "Lave las hojas en varios cambios de agua fría, luego drene a fondo y seque en un centrifugador de ensalada.", "Haga rodar las hojas con fuerza, algunas a la vez, y triturelas finamente en tiras de 5 mm de ancho.", "Extiéndalos en una bandeja para hornear y colóquelos en un horno precalentado a 130 ° C / 250 ° F / Gas 1 durante 15 minutos para que se sequen ligeramente.", "No deben estar completamente secos o arderán cuando se fríen. Sacar del horno y dejar enfriar. Esto se puede hacer el día anterior.", "Caliente un wok a fuego alto, luego agregue el aceite. Cuando el aceite esté caliente y ligeramente humeante, fría los vegetales en tres o cuatro tandas. Después de unos 30-40 segundos, cuando se pongan crujientes y verdes, quítelos inmediatamente del wok y drene bien sobre papel de cocina.", "Deja enfriar.", "Mezcle los verdes crujientes con la sal y el azúcar.", "Adorne con los granos de pino y sirva."], "url": "www_bbc_co_uk_food_recipes_malaysianprawnfritte_71364", "title": "Buñuelos de gambas malayas con algas crujientes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (72%% 20cocoa% 20solids)", "250g / 9oz de mantequilla sin sal", "250 g / 9 oz de azúcar en polvo de oro", "2 huevos de gallinas camperas", "5 cucharadas de extracto de malta", "750g / 1lb 10 oz de harina de auto aumento", "6 cucharadas colmadas de bebida malteada en polvo", "2 naranjas, jugo y ralladura solamente", "1½ cucharadita de extracto de vainilla", "Azúcar de formación de hielo real 1kg / 2lb 4oz", "colorante de comida amarilla", "colorante negro de alimentos"], "method": ["Precaliente el horno a 175 ° C / 155 ° C Ventilador / Gas 4. Coloque dos bandejas grandes para hornear con papel de hornear.", "Rompa el chocolate en trozos pequeños usando un procesador de alimentos o un cuchillo afilado.", "Bata la mantequilla y el azúcar juntos en un tazón grande. Batir los huevos y el extracto de malta hasta que quede suave. Mezcle la harina (reservando 2 cucharaditas para espolvorear), polvo de bebida malteada, ralladura de naranja y chocolate. Usando sus manos junte la mezcla para formar una masa. Si está un poco seco, agrega el jugo de la naranja.", "Enharine ligeramente la superficie de trabajo con un poco de la harina restante y extienda la masa hasta aproximadamente 5 mm de grosor. Utilice el cortador de cerveza o la plantilla para cortar 24 bizcochos de cerveza o 48 x 7 cm / 2¾ en galletas redondas.", "Hornee durante 15-20 minutos, o hasta que estén pálidas doradas. Puede hornearlos en lotes si no tiene suficientes bandejas para hornear. Dejar enfriar sobre bastidores de alambre mientras se prepara la mezcla real de hielo", "Ponga 200ml / 7fl oz de agua en un recipiente y gradualmente agregue el azúcar glas real, batiendo hasta que quede suave. Debe ser bastante grueso y mantener su forma, pero lo suficientemente flojo como para cañer.", "Divida el glaseado entre tres cuencos y coloree un cuenco negro, uno de color amarillo brillante y deje el tercero blanco. Transfiera la formación de hielo a las bolsas de tubería equipadas con pequeñas boquillas llanas (la boquilla para el glaseado negro debe ser muy fina, pero las otras pueden ser un poco más grandes).", "Cuando los bizcochos estén completamente fríos, dibuje el contorno de la jarra de cerveza en cada uno usando el glaseado negro, sepárelo para que se seque. A continuación, inunde la parte inferior de la taza con amarillo. Cubra la jarra de cerveza con blanco y agregue detalles negros cuando se seque. Coloque en bastidores de alambre para permitir que la formación de hielo se establezca."], "url": "www_bbc_co_uk_food_recipes_malt_chocolate_and_09403", "title": "Galletas de malta, chocolate y naranja con cerveza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 24 galletas grandes en forma de jarra de cerveza", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/malt_chocolate_and_09403_16x9.jpg", "isVegetarian": true, "recommendations": 0}]