[{"isVegetarian": true, "title": "Tartaletas de alcachofa para bebé", "url": "www_bbc_co_uk_food_recipes_babyartichoketartlet_67913", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tarro de alcachofas baby en aceite, escurrido, reducido a la mitad", "1 paquete de hojaldre", "1 yema de huevo, batida", "pimentón ahumado (pimentón), para quitar el polvo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Corta la masa en pequeños cuadrados un poco más grandes que las alcachofas. Cepille la masa con la yema de huevo batida. Presione una mitad de alcachofa en la masa, con el lado cortado hacia arriba. Polvo con pimentón ahumado. Hornee hasta que la masa esté hinchada y dorada, aproximadamente 10 minutos. Servir caliente como un canapé."]}, {"isVegetarian": true, "title": "Bruschettas de bebé con peras escalfadas, gorgonzola y jarabe de puerto", "url": "www_bbc_co_uk_food_recipes_babybruschettaswithp_68099", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 peras pequeñas y firmes", "2 cucharadas de miel clara", "Puerto de 150ml / ¼ pinta", "150ml / ¼ de pinta de vino tinto", "225g / 8oz de gorgonzola (o un queso azul vegetariano similar), a temperatura ambiente", "24 rebanadas de baguette", "2 cucharadas de aceite de oliva virgen extra"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a caliente.", "Divide a la mitad y pela las peras, luego corta cada pera en 12 pequeñas cuñas. Coloque en una cacerola de base pesada con la miel, el puerto y el vino. Cocine por 10-15 minutos o hasta que las peras estén tiernas hasta la punta de un cuchillo, pero no suaves.", "Vacíe el líquido en una bandeja pequeña y deje que las cuñas de pera se drene completamente.", "Reduce el líquido en dos tercios, cuando debería ser una consistencia almibarada, esto llevará de 8 a 10 minutos. Colocar en un vaso pequeño y dejar enfriar.", "Para hacer las bruschettas, cepille cada rebanada de pan con aceite de oliva, y luego ase hasta que las bruschettas estén doradas por ambos lados. Esto solo toma uno o dos minutos, así que ¡mantente atento!", "Justo antes de que lleguen sus invitados, reparta generosamente cada bruschetta con gorgonzola y, a continuación, una rebanada de pera escalfada. Finalmente, usando una cucharadita de llovizna con el jarabe de puerto."]}, {"isVegetarian": false, "title": "Ensalada de cos de bebé con aderezo de limón en conserva", "url": "www_bbc_co_uk_food_recipes_babycossaladwithpres_12156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 dientes de ajo", "aceite de oliva virgen extra", "2 limones, solo jugo", "2 limones en conserva, finamente picados", "sal marina y pimienta negra recién molida", "2 lechuga baby cos", "2 huevos enteros de \\\"5 minutos\\\", pelados", "4 mejores anchoas de calidad", "8 aceitunas negras", "parmesano rallado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el aderezo, aplastar el ajo en un mortero y una maja o prensa de ajo.", "Agregue un poco de aceite de oliva junto con el jugo de limón, limón conservado, sal marina y pimienta. Mezclar bien.", "Para servir la ensalada, corte las lechugas por la mitad a lo largo y colóquelas en un plato para servir.", "Cortar los huevos por la mitad y colocar sobre la lechuga, seguido de anchoas enteras, aceitunas, un montón de pimienta y queso parmesano rallado.", "Termina con el aderezo en la parte superior."]}, {"isVegetarian": true, "title": "Calabacines y champiñones con albahaca", "url": "www_bbc_co_uk_food_recipes_babycourgettesandcha_91629", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/babycourgettesandcha_91629_16x9.jpg", "ingredients": ["gran puñado de champiñones frescos, lavados y limpios para eliminar la arena, sin tallos, desgarrados", "5 calabacines para bebés, cortados, cortados longitudinalmente en tiras finas", "3 cucharadas de aceite de oliva", "grandes copos de sal marina", "1 diente de ajo, pelado, finamente picado", "pimienta negra recién molida", "¼ limón, solo jugo", "pequeñas hojas de albahaca fresca, rasgada"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["En un tazón, mezcle los champiñones y las tiras de calabacín hasta que estén bien combinados. Rocíe más de dos cucharadas de aceite de oliva y sazone con sal, luego revuelva hasta que las verduras estén completamente cubiertas en el aceite.", "Calentar una sartén a fuego alto. Cuando la sartén esté humeando, agregue los calabacines, los champiñones y el aceite restante y fría por 6-8 minutos, sin remover, o hasta que el agua de las verduras se haya evaporado y las verduras se hayan suavizado y estén doradas. (NB: Si las verduras comienzan a pegarse al fondo de la sartén, agite la sartén de vez en cuando durante la cocción).", "Cuando los calabacines y los champiñones estén cocidos, retire la sartén del fuego y agregue el ajo picado. Sazonar, al gusto, con pimienta negra recién molida.", "Para servir, transfiera el contenido de la sartén a un tazón de sopa. Rocíe el resto del aceite de oliva y el jugo de limón, luego espolvoree sobre la albahaca."]}, {"isVegetarian": true, "title": "Papas baby con hinojo", "url": "www_bbc_co_uk_food_recipes_babypotatoeswithfenn_67361", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Papas para ensalada de bebé de 310 g / 11 oz", "3 cucharadas de aceite", "¼ cucharadita de semillas de hinojo (o ½ cucharadita de azúcar (si se prefiere)", "¼ cucharadita de sal", "pizca de garam masala", "¼ cucharadita de chile en polvo"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Par-hervir las papas durante 7-8 minutos, luego drenarlas.", "Déjalos enfriar.", "En una sartén caliente el aceite, agregue las especias y mezcle durante 1 minuto.", "Incline las papas y saltee durante 3-4 minutos."]}, {"isVegetarian": false, "title": "Vieiras con una corteza de migas de pan", "url": "www_bbc_co_uk_food_recipes_babyscallopswithabre_83814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 vieiras de bebé, en sus conchas", "55g / 2oz de pan rallado", "1 diente de ajo, pelado y aplastado", "puñado de perejil, picado", "Ralladura de 1 limón", "sal y pimienta negra recién molida", "dash aceite de oliva"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a mediano.", "Coloque las vieiras en una bandeja para hornear.", "En un procesador de alimentos, mezcle el pan rallado, el ajo, el perejil y la ralladura de limón.", "Sazonar la mezcla con sal y pimienta negra recién molida y espolvorear sobre las vieiras.", "Rocíe un poco de aceite sobre las vieiras y cocine bajo la parrilla durante un par de minutos hasta que estén crujientes y las vieiras estén bien cocidas."]}, {"isVegetarian": false, "title": "Ensalada de chipirones y batatas", "url": "www_bbc_co_uk_food_recipes_babysquidandsweetpot_91736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite vegetal", "Calamar bebé de 400g / 14oz, limpiado, rebanado en anillos gruesos", "sal y pimienta negra recién molida", "Fideos de huevo finos de 250 g / 9 oz, cocidos de acuerdo con las instrucciones del paquete", "250 g / 9 oz de batata dorada, pelada, cortada en cubos, cocida hasta que esté tierna", "4 cebolletas, finamente picadas", "1 cucharada de semillas de calabaza", "1 cucharadita de semillas de cebolla negra (nigella)", "2 tomates tomados por el sol, picados", "1 chile rojo, finamente picado", "25 ml / 1 fl oz de jugo de jengibre fresco (rallar jengibre fresco de la raíz y exprimir en un paño limpio para extraer el jugo)", "2 limas, solo jugo", "1 cucharada de aceite de sésamo", "2 cucharadas de vinagre de jerez", "150ml / 5½fl oz de aceite de oliva", "1 cucharada de menta fresca picada", "sal y pimienta negra recién molida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el bebé calamar y la ensalada de batata, caliente el aceite vegetal en una sartén y fría los anillos de calamar durante 2-3 minutos, o hasta que quede opaco. Sazonar bien con sal y pimienta negra recién molida y dejar de lado.", "Cortar los fideos en 5-7 cm / 2-2.75 en piezas y luego agregarlos a un tazón grande junto con los cubos de camote, cebolla de primavera, semillas de calabaza, semillas de cebolla y tomates tomados por el sol. Revuelva bien para combinar.", "Para el aderezo, coloque todos los ingredientes del aderezo en un frasco y agite hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida. Rocíe el aderezo sobre la ensalada y mezcle bien para cubrir. Agregue la menta picada.", "Para servir, divida la ensalada entre seis platos para servir y cubra cada ensalada con una porción de calamar."]}, {"isVegetarian": false, "title": "Calamar relleno con chorizo ​​y queso feta", "url": "www_bbc_co_uk_food_recipes_babysquidstuffedwith_89940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g / 7oz de salchichas de chorizo ​​crudas", "150ml / 5fl oz de vino blanco", "Queso feta o feta de 200g / 7oz", "20 calamares bebé, limpios, tubos y tentáculos solamente", "aceite vegetal, para freír", "2 bulbos de hinojo, en rodajas finas", "1 cucharada de aceite de oliva virgen extra de buena calidad, más extra para servir", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Coloque el chorizo ​​en una sartén con el vino blanco (el vino debe cubrir el chorizo). Llevar a ebullición, luego baje el fuego y cocine a fuego lento durante 15 minutos. Retire del fuego y deje que el chorizo ​​se enfríe en la sartén. Cuando esté frío, quite el chorizo, quíteles la piel y córtelo en cubos pequeños. Coloque en un tazón.", "Picar el queso feta en cubos de tamaño similar al del chorizo ​​y mezclar en el bol con el chorizo.", "Con cuidado cuchara el chorizo ​​y la mezcla de feta en los tubos de calamar a tres cuartas partes de llenar los tubos. Asegure la apertura cerrada con un palillo de cóctel", "Prepare un plato para hornear.", "Calentar el aceite en una sartén a fuego alto. Cuando esté muy caliente, agregue el calamar y cocine en tandas, chamuscándolas por un minuto en cada lado. Como cada lote de calamar está cocido, transfiéralo al plato. Cuando el último calamar esté cocido, coloque el plato en el horno para cocinar durante dos minutos.", "Mientras tanto, agrega los tentáculos de calamar a la sartén y freír durante 1-2 minutos, o hasta que estén recién cocidos.", "Poner a hervir una olla de agua con sal. Agregue el hinojo y hierva por un minuto. Escurra el hinojo y colóquelo en un tazón. Rocíe con aceite de oliva y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque porciones iguales de hinojo en el centro de cada plato. Cubra cada uno con cinco tubos de calamar rellenos y algunos tentáculos. Rocíe con un poco de aceite de oliva y sirva."]}, {"isVegetarian": false, "title": "Tocino-vodka con infusión de tomates cherry", "url": "www_bbc_co_uk_food_recipes_bacon-vodka_infused_21884", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 rebanadas de tocino rayado ahumado (alrededor de 150 g / 5½ oz)", "Vodka de 500ml / 18fl oz", "250g / 8oz de tomates cherry", "1 cucharada de azúcar", "dash salsa Worcestershire (opcional)", "salsa picante (opcional)", "sal de apio o condimento de pimienta de limón (ver consejo), para servir (opcional)"], "serves": "Sirve 4-6", "time": {"preparation": "durante la noche", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Para hacer el vodka con tocino, fríe el tocino lentamente en una sartén para que se cocine en su propia grasa y rinda tanto como sea posible; hazlo sin que el tocino tome demasiado color, ya que un tocino oscuro y casi carbonizado arruinar el sabor", "Coloque el tocino y toda la grasa de la sartén en un recipiente y cúbralo con el vodka. Realmente no necesitas el tocino ya que la mayor parte del sabor vendrá de la grasa, pero no dolerá. Déjelo durante varias horas para infundirlo (al menos seis, preferiblemente 12) y luego colóquelo en el congelador durante aproximadamente media hora o hasta que la grasa del tocino se haya solidificado.", "Alinee un tamiz con gasa o muselina - alternativamente use filtros de café. Cuele el vodka a través de la gasa, atrapará todos los sólidos aún congelados. Cuela una vez más, luego embotella.", "Para hacer los tomates cherry infusionados con bacon vodka, pellizque ligeramente los tomates con un palillo de cóctel. Poner en un frasco, cubrir con el vodka de tocino y espolvorear en el azúcar. Agregue salsa Worcestershire y salsa picante, al gusto, si le gusta.", "Deje que se infunda en la nevera hasta que esté listo para comer, al menos durante dos horas, pero durante el tiempo que desee, dando un batido cada cierto tiempo.", "Escurrir y servir en palitos de cóctel con sal de apio opcional o condimento de pimienta de limón."]}, {"isVegetarian": false, "title": "Bacon y pastel de huevo", "url": "www_bbc_co_uk_food_recipes_bacon_and_egg_pie_06890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_pie_06890_16x9.jpg", "ingredients": ["Harina normal de 275g / 9¾oz", "pizca de sal fina", "135g / 4½oz de mantequilla fría sin sal, en cubos", "1 huevo mediano de granja, golpeado", "1 cucharadita de jugo de limón", "1 cucharada de aceite vegetal", "1 cebolla grande, finamente picada", "1 diente de ajo, aplastado", "200g / 7oz tocino rayado sin ahumar, cortado en cubos", "Lomo de cerdo de 200 g / 7 oz, cortado en cubos de aproximadamente 1,5 cm / ½ in", "5 huevos medianos de granja", "100g / 3½oz de queso crema", "100g / 3½ oz de queso cheddar maduro, rallado", "1 cucharada de cebollino picado", "1 huevo de gallinas camperas, batido, para esmaltar", "sal y pimienta negra recién molida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la masa, ponga la harina y la sal en un tazón. Agregue la mantequilla y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Mezcle el huevo con el jugo de limón y tres cucharadas de agua. Haga un pozo en el centro de la mezcla y vierta un poco de la mezcla de huevo. Usando un cuchillo de mesa, trabaje con suficiente líquido para unir la masa. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la masa en una película adhesiva y colóquela en la nevera para que descanse durante aproximadamente 30 minutos.", "Para el relleno, caliente el aceite en una sartén grande a fuego medio-bajo y agregue la cebolla y el ajo. Cocine suavemente durante unos ocho minutos, o hasta que estén suaves.", "Agregue el tocino y la carne de cerdo, aumente un poco el fuego y cocine durante unos 10 minutos, hasta que se haya eliminado el líquido de la carne. Deje que se enfríe completamente.", "Precalentar el horno a 200C / 400F / Gas 6.", "Batir dos de los huevos con el queso crema hasta que quede suave. Agregue el queso cheddar y las cebolletas y sazone con sal y pimienta. Agregue la mezcla de tocino fría.", "Cuando esté listo para armar la tarta, despliegue dos tercios de la masa y úsela para alinear la lata de la torta. Estirar los pasteles restantes listos para formar la tapa.", "Coloque la mezcla de relleno en la caja de pastelería. Haga tres depresiones espaciadas uniformemente en el relleno y agriete los huevos restantes en ellas.", "Cepille el borde de la masa con huevo batido y coloque la tapa encima. Presione los bordes para sellar y recortar el exceso cuidadosamente. Cepille la parte superior del pastel con más huevo batido y haga un agujero de vapor en el centro.", "Hornee en el horno por 50-55 minutos, hasta que estén doradas. Deje reposar la tarta durante al menos 15 minutos antes de cortar. Es delicioso caliente o frío."]}, {"isVegetarian": false, "title": "Tocino y picaduras de huevo", "url": "www_bbc_co_uk_food_recipes_bacon_and_egg_bites_26820", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_bites_26820_16x9.jpg", "ingredients": ["12 medallones de tocino", "12 huevos de gallinas camperas", "12 tomates cherry pequeños, cortados por la mitad", "pimienta negra recién molida", "6 rebanadas de pan, para servir", "botón de mantequilla, para extender"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 8 y engrasar ligeramente una lata para muffins de 12 hoyos.", "Coloque los medallones de tocino entre dos hojas de film transparente y extiéndalas con un rodillo. Póngalos en el molde para muffins, creando una forma de caja.", "Agriete los huevos en el centro de cada caja de tocino, sazone con pimienta negra y cubra con dos mitades de tomate.", "Hornee en el horno durante 10 minutos hasta que el tocino esté cocido y el huevo recién cocinado por dentro. Si te gusta el huevo bien hecho, cocina durante 15 minutos.", "Tueste el pan a su gusto y luego unte con mantequilla ligeramente. Sirve dos bocados de huevo con una tostada por persona."]}, {"isVegetarian": false, "title": "Bacon y canapés de huevo", "url": "www_bbc_co_uk_food_recipes_bacon_and_egg_canapes_11283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_canapes_11283_16x9.jpg", "ingredients": ["Harina normal 150g / 5½ oz", "100g / 3½oz de mantequilla fría, cortada en cubos", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de aceite de girasol", "4 lonchas finas de tocino rayado sin corteza, cortado en tiras de 5cm / 2in", "2 huevos de gallinas camperas, hervidos, pelados", "4 cucharadas de mayonesa", "sal y pimienta negra molida", "6 huevos de codorniz, hervidos, pelados", "hojas frescas de cohetes"], "serves": "Hace 12", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para el pastel, pulse la harina y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Con el motor en marcha, agregue el huevo batido y mezcle hasta que la mezcla comience a unirse en una bola. Dale forma a la masa y aplástala ligeramente.", "Haga rodar la masa sobre una superficie de trabajo enharinada y, con un cortador de 7,5 cm / 3 in, corte 12 rondas. Úselos para alinear una lata de molinillo de 12 agujeros.", "Pinche la base de la masa con un tenedor, y congele por una hora.", "Precalentar el horno a 200C / 400F / Gas 6.", "Hornee las cajas de repostería durante 15-18 minutos o hasta que estén ligeramente doradas y cocidas. Retire del horno y transfiera a una rejilla para enfriar.", "Para el relleno de tocino y huevo, caliente el aceite en una sartén pequeña antiadherente y fríe el tocino a fuego medio durante 1-2 minutos por cada lado hasta que quede crujiente. Escurrir sobre papel de cocina.", "Mash los huevos de las gallinas con la mayonesa, agregando sal y pimienta negra recién molida al gusto.", "Coloque la mezcla en las cajas de pastelería.", "Corte los huevos de codorniz por la mitad y colóquelos encima. Agregue una tira de tocino a cada una y adorne los canapés con hojas de rúcula."]}, {"isVegetarian": false, "title": "Bacon y pajitas maduras de queso cheddar", "url": "www_bbc_co_uk_food_recipes_bacon_and_mature_cheddar_58920", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_mature_cheddar_58920_16x9.jpg", "ingredients": ["1 x 375 g / 13 oz de hojaldre", "harina común, para quitar el polvo", "1 cucharada de mostaza inglesa", "100g / 3½ oz de queso cheddar maduro, rallado", "pimienta negra recién molida", "14 rebanadas de tocino rayado de buena calidad", "1 huevo de gallinas camperas, ligeramente golpeado"], "serves": "Rinde 14", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cubra una bandeja para hornear con papel resistente a la grasa.", "Ruede los pasteles sobre una superficie de trabajo ligeramente enharinada hasta obtener un rectángulo grande de 0.5cm / ¼ de grosor.", "Gire la masa para que el lado más largo quede hacia usted, cubra la mostaza, espolvoree el queso y sazone con pimienta negra recién molida. Coloque las piezas de tocino en la masa, dejando un pequeño espacio entre cada pieza.", "Corta la masa entre cada rebanada de tocino. Con cuidado, gire cada trozo de masa 4-5 veces para que parezca una paja rizada, luego coloque en la bandeja de hornear.", "Repita el proceso hasta que todo el tocino se haya agotado. Enfríe los giros de la repostería en la nevera durante 15-20 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Retire los giros de la nevera y cepille con el huevo batido.", "Reduzca el horno a 200C / 400F / Gas 6 y hornee los giros durante 20-25 minutos, o hasta que el pastel esté bien levantado y dorado. Retirar del horno y reservar para enfriar."]}, {"isVegetarian": false, "title": "Frittata de tocino y champiñones", "url": "www_bbc_co_uk_food_recipes_bacon_and_mushroom_61984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_mushroom_61984_16x9.jpg", "ingredients": ["8 hongos Portobello o de castaño plano, alrededor de 500 g / 1 lb 2 oz en total", "1 diente de ajo, finamente picado", "aceite en aerosol bajo en calorías", "4 lonchas de tocino con abadejo sin grasa", "6 huevos grandes de gallinas camperas", "1 cucharada de cebollino picado, más extra para decorar", "1 cucharada de mostaza integral", "botón de mantequilla", "4 rebanadas grandes de pan de masa fermentada", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque los champiñones en una bandeja para hornear forrada con papel de aluminio y espolvoree sobre el ajo. Rocíe con un poco de aceite y sazone con sal y pimienta negra recién molida. Hornee en el horno durante 18-20 minutos o hasta que se ablanden. Deja hasta que se enfríe lo suficiente como para manejarlo.", "Mientras tanto, precalentar la parrilla a fuego medio. Coloque las lonjas de tocino en una bandeja para hornear con revestimiento de aluminio y cocine de 5 a 6 minutos o hasta que estén ligeramente crujientes. Enfriar un poco, luego cortar en rodajas gruesas. Deje la parrilla encendida para la frittata.", "Coloque los huevos, el cebollín y la mostaza en un bol, bata ligeramente y sazone con pimienta negra recién molida.", "Caliente una sartén antiadherente grande con un mango a prueba de horno a fuego medio. Agregue la mantequilla, cuando la mantequilla esté espumosa, vierta la mezcla de huevo y cocínela durante 1-2 minutos, luego agregue el tocino y las setas enteras, con el tallo hacia arriba. Cocine por otros 2-3 minutos o hasta que esté casi listo. Coloque la sartén debajo de la parrilla y cocine la frittata durante 2-3 minutos, o hasta que se asiente. Deje que se enfríe un poco.", "Tueste el pan y coloque los platos para servir. Cortar la frittata en trozos y servir en la masa madre tostada. Adorne con cebollino y sirva."]}, {"isVegetarian": false, "title": "Sopa de tocino y frijoles blancos", "url": "www_bbc_co_uk_food_recipes_bacon_and_white_bean_06748", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_white_bean_06748_16x9.jpg", "ingredients": ["1 cucharadita de aceite de oliva", "2 lonchas de tocino ahumado, picado", "2 dientes de ajo, aplastados", "1 cebolla picada", "3 ramitas de tomillo", "2 x 400 g latas de frijoles cannellini, escurridos y enjuagados", "850ml / 1½ pintas de caldo de verduras", "2 cucharadas de perejil picado", "pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una cacerola grande a fuego medio. Agregue el tocino, el ajo y la cebolla y fría por 3-4 minutos, o hasta que el tocino comience a dorarse y la cebolla se ablande.", "Agregue el tomillo y fría por un minuto más. Agregue los frijoles y el caldo a la sartén y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10 minutos.", "Transfiera la sopa a una licuadora o procesador de alimentos y mezcle con el perejil y la pimienta hasta que quede suave.", "Regrese la sopa a la sartén y caliéntela, luego haga una cucharada en 4 tazones y sirva inmediatamente."]}, {"isVegetarian": false, "title": "Bacon al horno en una bolsa de papel con zanahorias y cebollas con crema", "url": "www_bbc_co_uk_food_recipes_bacon_baked_in_a_paper_48335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 piezas de 400 g / 14 onzas de tocino rayado sin", "1-2 litros / 1¾-3½ pintas de caldo de pollo", "750g / 1lb zanahorias 10 oz, peladas", "8 tallos de apio", "1 manojo de tomillo fresco", "500 ml / 18 fl oz de ale", "50g / 2oz de mantequilla", "Cebollas baby 300g / 11oz, peladas, cortadas por la mitad", "Crema doble 110ml / 4fl oz", "1 pizca de nuez moscada recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 140C / 275F / Gas1.", "Coloque los pedazos de tocino en una olla grande, cubra con el caldo de pollo y lleve a ebullición. Retire los pedazos de tocino y seque con papel de cocina.", "Divida las zanahorias, el apio y el tomillo entre cuatro bolsas de papel grandes. Agregue un chorrito de cerveza a cada bolsa, coloque el tocino encima y luego enrolle las partes superiores de las bolsas para sellarlas.", "Asar en el horno durante 2-3 horas, o hasta que el tocino esté muy tierno. Retire el tocino y déjelo a un lado para que descanse durante 30 minutos.", "Mientras tanto, derrita la mantequilla en una sartén y agregue las cebollas bebé y una pizca de sal. Fría durante 1-2 minutos, sin colorear, luego agregue otro chorro de cerveza.", "Continúe cocinando hasta que la cerveza se haya reducido por completo, luego mezcle la crema y cocine por otros 30 segundos.", "Para servir, coloca una cucharada de cebollas en platos para servir y espolvorea sobre la nuez moscada. Tallar el tocino en rodajas gruesas y colocar una rodaja al lado de las cebollas. Arriba con las zanahorias."]}, {"isVegetarian": false, "title": "Chuleta de tocino con manzana y pastinaca hash", "url": "www_bbc_co_uk_food_recipes_bacon_chop_with_apple_85819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["puñado de papas asadas sobrantes (o 1 papa grande, picada y asada)", "25g / 1oz de mantequilla", "1 chalote, finamente picado", "1 chirivía, rallada", "1 manzana, pelada, sin corazón y cortada en cubos de 1cm / ½ en", "aceite de oliva, para freír", "2 chuletas de tocino", "2 huevos de gallinas camperas", "5-6 hojas frescas de salvia picada", "copos de sal marina y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Corta las papas asadas en cubos de 2cm / ¾en cubitos, aproximadamente. Derretir la mitad de la mantequilla en una sartén a fuego medio. Freír con cuidado las papas durante aproximadamente 6-8 minutos, o hasta que comiencen a dorarse.", "Agregue la chalota y continúe freír suavemente durante 3-4 minutos, está bien si se ponen un poco de color. Agregue la chirivía y las manzanas. Permita que todo se cocine a fuego lento, revolviendo cada 2 minutos aproximadamente, durante 10-12 minutos. Condimentar con sal y pimienta.", "Mientras tanto, caliente una sartén a fuego medio.", "Frote ligeramente un poco de aceite de oliva en las chuletas de tocino y sazone con sal y pimienta. Cocine las chuletas en la sartén de la plancha durante 3-4 minutos por cada lado hasta que estén cocidas y calientes, luego déjelas a un lado para descansar sobre una rejilla de alambre.", "Derretir la mantequilla restante en otra sartén y freír los huevos a su gusto.", "Para servir, termine el hash con una dispersión del sabio, luego divídalo entre dos platos para servir. Pon un chuleta encima y un huevo frito."]}, {"isVegetarian": false, "title": "Bacon o scones crujientes", "url": "www_bbc_co_uk_food_recipes_bacon_or_crackling_75198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60ml / 4 cucharadas de leche", "1 cucharadita de levadura seca", "250g / 9oz tocino rayado, picado", "500g / 1lb 2 oz de harina natural, más extra para espolvorear", "1 cucharadita de polvo de hornear", "½ cucharadita de sal", "2 cucharadas de queso parmesano, rallado", "1 cucharada de semillas de alcaravea", "120 g / 4½ oz de mantequilla sin sal", "120ml / 4fl oz de crema agria", "2 huevos, golpeados", "huevo batido y una gota de agua, para glasear"], "serves": "Hace 12", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Suavemente caliente la leche en una sartén hasta que esté tibia, luego viértala en una jarra y agregue la levadura. Déjalo por 15 minutos más o menos para poder trabajar y llenar de espuma.", "Mientras tanto, caliente una sartén de base pesada y fría los trozos de tocino hasta que estén crujientes y dorados. Quítelos de la sartén y déjelos enfriar.", "Tamiza la harina en un bol y mézclala con el polvo de hornear y la sal. Agregue las semillas de parmesano y alcaravea.", "Ponga la mantequilla en una sartén pequeña sobre un poco de calor y permita que se derrita hasta que quede solo líquido. Retire la sartén del fuego, agregue la crema agria y agregue los huevos batidos; asegúrese de que la mantequilla no esté demasiado caliente o que los huevos revoloteen. Agregue el tocino crujiente y revuelva en la leche de levadura.", "Vierta la mezcla mantecosa de huevo y tocino en un tazón grande, luego agregue la harina y otros ingredientes secos, poco a poco, hasta que todo esté combinado.", "Voltee la masa sobre una superficie de trabajo enharinada y amase durante 5 minutos más o menos hasta que quede elástica. Puede hacer esto con un mezclador y un gancho de masa si lo desea. Coloque la masa en un recipiente ligeramente engrasado, cubra con una película adhesiva untada y déjela en un lugar libre de corrientes de aire durante aproximadamente una hora y media hasta que haya duplicado su tamaño.", "Voltea la masa nuevamente y arrójala con tus nudillos. Espolvoree la masa con harina y extiéndala a aproximadamente 4 cm / 1½ de espesor. Recorta las rondas con un cortador de pasteles y colócalas en una hoja de papel para hornear de silicona en una bandeja para hornear. Con un cuchillo afilado, corte un patrón entrecruzado en la parte superior de cada uno, luego déjelo descansar durante otros 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cepille los bollos con el huevo batido y el agua para glasear y hornee durante 25-30 minutos hasta que estén dorados.", "Cómalos calientes, divídelos a la mitad y untalos con mantequilla. Perfecto con sopa de goulash de ternera."]}, {"isVegetarian": false, "title": "Chuletas de tocino con brócoli entero asado y salsa de tres quesos", "url": "www_bbc_co_uk_food_recipes_bacon_chops_with_whole_45650", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 brócoli entero", "6 dientes de ajo, rallados, mezclados con un poco de aceite", "1 manojo de tomillo fresco, hojas y tallos separados", "100 g / 3½ oz de mantequilla, cortada en cubitos", "pizca de nuez moscada recién rallada", "Harina blanca normal 30g / 1oz", "30g / 1oz de mantequilla", "285 ml / 10 fl oz de leche", "55g / 2oz de queso Stinking Bishop cortado en cubitos", "Queso Gruyère 55 g / 2 oz, rallado", "55g / 2oz de queso fuerte de su elección, rallado", "sal y pimienta negra recién molida", "1 cucharada de mostaza inglesa", "1 cucharada de crema", "75 g / 2½ oz de mantequilla", "2 x 250 g / 9 oz de tocino chuletas", "1 cucharada de perejil picado", "300g / 11oz de patatas nuevas, hervidas", "1 cucharada de aceite vegetal", "1 cebolla, finamente rebanada", "1 cucharadita de pimentón ahumado", "1 cucharada de perejil fresco picado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el brócoli tostado, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Retire el tallo del brócoli y córtelo por la mitad a lo largo. Pele los pedazos de madera dura de ella. Ponlo a un lado.", "Frote el ajo rallado en la cabeza de brócoli y colóquelo en una bandeja de asar profunda. Espolvorear con los tallos de tomillo y cubrir con la mantequilla.", "Asar durante 35-45 minutos hasta que esté cocido. Batir la mantequilla 3-4 veces mientras se tuesta.", "Sazonar con nuez moscada fresca y poner a un lado.", "Para la salsa de tres quesos, derrita la mantequilla en una cacerola y luego agregue la harina y cocine durante 1-2 minutos. Retire la sartén del fuego y mezcle gradualmente la leche hasta que tenga una salsa suave. Regrese al fuego y, revolviendo todo el tiempo, lleve a ebullición.", "Cuando la salsa esté suave, agregue los quesos hasta que se derritan. Sazonar con sal y pimienta y pasar por un colador. Agregue la mostaza y la crème fraîche y déjela a un lado.", "Para las chuletas de tocino, poner la mantequilla en una sartén con 100 ml / 3 ½ oz de agua y llevar a ebullición. Agregue las mitades de tallos de brócoli y las chuletas de tocino y cocine hasta que los tallos estén tiernos y el tocino esté bien cocido. Es posible que necesite agregar un poco más de agua. Escurrir y agregar el perejil picado.", "Caliente el aceite en una cacerola limpia y fríe con cuidado la cebolla y cocine las papas nuevas hasta que estén doradas y calientes. Sazonar con el pimentón ahumado.", "Sirva el tocino, los tallos de brócoli, el brócoli asado y las papas con la salsa."]}, {"isVegetarian": false, "title": "Pan de egol y tocino", "url": "www_bbc_co_uk_food_recipes_bacon_eggy_bread_22406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_eggy_bread_22406_16x9.jpg", "ingredients": ["1 huevo de gallinas camperas", "3 cucharadas de leche", "2 rebanadas de pan blanco crujiente, untado con mantequilla", "15 g / ½ oz de panceta ahumada o tocino, picado", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Rompe el huevo en una taza, agrega una pizca de sal y pimienta y bate bien. Batir en la leche. Rompa el pan en trozos y empújelo en la leche con huevo. Deje reposar durante 5 minutos (o durante la noche).", "Esparza la panceta sobre la parte superior y sazone con más pimienta.", "Microondas a alta potencia durante 2 minutos. Deje reposar por 30 segundos, luego cocine en el microondas por otro minuto. Dejar enfriar durante 1 minuto y ¡está listo para comer!"]}]