[{"ingredients": ["2 huevos", "5 cucharadas de mantequilla clarificada", "harina simple, para cubrir", "2 filetes de trucha de mar, piel sobre", "55g / 2oz de pan rallado fresco", "2 plátanos", "2 limones, 1 jugo, 1 rebanada fina", "55 g / 2 oz de mantequilla", "2 yemas de huevo", "2 tomates, en rodajas finas", "sal y pimienta blanca"], "method": ["Precalentar la parrilla para que se caliente. En un plato poco profundo, bata los huevos con 2 cucharadas de la mantequilla clarificada.", "Ponga un buen puñado de harina en un plato y sazone ligeramente con pimienta blanca y sal.", "Tome los filetes de trucha de mar y cúbralos con la harina sazonada, luego sumérjalos en la mezcla de huevo y finalmente colóquelos en pan rallado hasta que estén completamente cubiertos.", "Caliente una sartén hasta que esté muy caliente y luego agregue 2 cucharadas de la mantequilla clarificada. Coloque los filetes empanados en la sartén con la piel hacia arriba durante 2 minutos. Voltee los filetes y cocine por otros 3 minutos o hasta que estén dorados. Deje la sartén al fuego, transfiera los filetes a una placa resistente al calor, con la piel hacia abajo y colóquela debajo de la parrilla durante 5 minutos.", "Reduce a la mitad los plátanos, a lo largo. Agregue la mantequilla clarificada restante a la sartén caliente y coloque las mitades de plátano en la sartén durante 5 minutos, volteándolas ocasionalmente para evitar que se quemen.", "En un recipiente resistente al calor, sobre una fuente de agua caliente, mezcle el jugo de limón, la mantequilla y las yemas de huevo con una salsa cremosa. Sazonar con sal y pimienta al gusto.", "Saque los filetes de debajo de la parrilla y coloque las rodajas de tomate y limón sobre el lado de la carne, alternativamente y superponiéndolas para que cubran la mayor parte del pescado. Gire la parrilla hasta que esté llena y cocine los filetes por un minuto más.", "Sirva la trucha y los plátanos juntos en un plato, cubierto con salsa."], "url": "www_bbc_co_uk_food_recipes_troutorleans_11571", "title": "Trucha Orleans", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de dorada, alrededor de 150g-200g / 5½oz-7oz por filete, piel sobre", "1 limón no encerado, muy finamente cortado", "2 ramitas de romero fresco", "5 cucharadas de aceite de oliva", "1 x 400 g de tomate picado", "2 cucharadas de albahaca rasgada", "1 diente de ajo, finamente picado", "Bisque de langosta 150ml / 5fl oz (de una lata está bien)", "25 g / 1 oz de mantequilla de trufa negra (o mantequilla sin sal más un chorrito de aceite de trufa)", "puñado de porcini secos", "puñado de perifollo fresco o estragón picado, u otras hierbas frescas", "sal marina escamada y pimienta negra recién molida", "300g / 10½oz de harina blanca fuerte", "pizca de sal", "botón de mantequilla, derretido, para cepillar", "ramita de romero fresco, finamente picado"], "method": ["Precalentar el horno a 220 C / Fan 200C / Gas 7.", "Sazonar el lado de la carne de cada filete de besugo, luego sándwalos juntos para que la piel quede afuera. Coloque tres rodajas de limón seguidas de una ramita de romero en la parte superior. Ate el pez con dos o tres pedazos de cuerda, luego déjelo a un lado.", "Para la corteza de pan, ponga la harina en un recipiente grande y sazone con sal. Mezcle lentamente suficiente agua para hacer una masa blanda y maleable.", "Calienta 4 cucharadas de aceite de oliva en una cacerola. Una vez caliente agregue los tomates picados, la albahaca, sazone con sal y pimienta y cocine durante 10-15 minutos para hacer una salsa de tomate.", "Calienta un poco más de aceite en una cazuela. Agregue el ajo y cocine por unos segundos. Agregue la salsa de tomate y cocine durante 1-2 minutos. Verter la sopa de langosta y llevar a ebullición. Agregue la mantequilla de trufa. Agregue el porcini.", "Traiga la salsa a fuego lento y luego retírela del fuego. Sazone al gusto, mezcle las hierbas y agregue el pescado, no debe sumergirse por completo.", "Estirar la masa de pan y cubrir la cazuela hasta que esté sellada. Necesitas mucha masa solapando los lados de la cazuela. Colóquelo a través de las asas de la cazuela para asegurarlo bien, luego haga un pequeño orificio en la parte superior para permitir que el vapor escape", "Regrese la cazuela al fuego hasta que vea una columna de vapor que entra por el orificio de la masa. Transfiere al horno y hornea por 10 minutos.", "Cepille la corteza generosamente con la mantequilla derretida, luego hornee por otros 2 minutos. Espolvoree la corteza con sal marina y el romero picado. Hornee por 2 minutos más, luego sirva."], "url": "www_bbc_co_uk_food_recipes_truffle-baked_bream_39834", "title": "Besugo al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo entero, patas y alas retiradas pero guardadas", "200g / 7oz de mantequilla salada, suavizada", "1 trufa, en rodajas", "sal y pimienta negra recién molida", "4 zanahorias peladas y cortadas en porras", "2 cucharadas de aceite de colza", "1 cebolla, más o menos picada", "2 zanahorias pequeñas, peladas y picadas", "1 puerro pequeño, picado", "2 hojas de laurel", "2 ramitas de tomillo fresco", "50 g / 1¾oz de mantequilla sin sal", "2 chalotes, picados", "2 dientes de ajo picados", "150ml / 5fl oz de vino blanco", "300 ml / 10 fl oz doble crema", "¼ grupo de perifollo fresco, finamente picado", "75g / 2½oz de mantequilla sin sal", "1 col rizada cabeza, tallos bien cortados, resistentes eliminados", "300g / 10½oz de guisantes congelados, blanqueados"], "method": ["Precalentar el horno a 230C / 210C Fan / Gas 8.", "Coloque las patas y las alas en una bandeja de asar honda y tueste en el horno durante 15-20 minutos, luego déjelo a un lado.", "Reduzca la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque la mantequilla en un tazón grande, agregue la mitad de la trufa, un poco de sal y pimienta y mezcle.", "Levante la piel lejos de la corona de pollo (dejando la piel intacta) y empuje la mantequilla debajo de la piel.", "Coloque en una bandeja para asar hondo y tueste durante 1-1½ horas, o hasta que esté bien cocido. Cuando creas que quedan 30 minutos, agrega los bastones de zanahoria.", "Para la salsa, caliente una olla grande y agregue el aceite. Una vez caliente, agregue las cebollas, las zanahorias, los puerros, las hojas de laurel y el tomillo y cocine por 3-4 minutos.", "Agregue las patas y las alas y cocine por 2-3 minutos. Agregue 2 litros / 3½ litros de agua y cocine durante al menos 1 hora.", "Cuele y mantenga el líquido, pero deseche las verduras. Necesitará 500ml / 18fl oz de este caldo de pollo.", "Caliente una sartén y derrita la mantequilla. Agregue los chalotes y cocine durante 1-2 minutos. Agregue el ajo y cocine durante 1-2 minutos.", "Agregue el vino blanco y cocine hasta que se reduzca en volumen a la mitad, luego agregue el caldo de pollo y reduzca a la mitad nuevamente. Termina con la crema y el perifollo.", "Para la col rizada y los guisantes, caliente una sartén grande y derrita la mantequilla. Agregue la col rizada y los guisantes y cocine por 2-3 minutos, o hasta que la col rizada se haya marchitado.", "Coloque las zanahorias, la col rizada y los guisantes tostados en el centro del plato. Retire la pechuga de pollo, corte en rodajas y ventile sobre las verduras. Vierta la salsa cremosa, adorne con la trufa restante y sirva."], "url": "www_bbc_co_uk_food_recipes_truffle-stuffed_roast_27864", "title": "Pollo asado relleno de trufa con verduras y salsa de crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½ oz de parmesano (o queso vegetariano vegetariano alternativo), rallado", "450g / 1lb de queso ricotta, escurrido", "Trufa negra de 12.5 g, finamente picada", "aceite de trufa blanca, para lloviznar", "500 g / 1 libra de harina de sémola 2 oz", "375 g de guisantes congelados", "puñado de guisantes frescos", "puñado de habichuelas envasadas, pieles externas retiradas", "25g / 1oz de mantequilla", "2 ramitas de tomillo frescas", "2 Corazones de lechuga Little Gem, cortados a la mitad", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "brotes de guisantes, cortados, para adornar", "manojo de cebollino, cortado, para adornar"], "method": ["Alinee una bandeja para hornear con papel de hornear.", "Para hacer el gnudi, mezcla 25 g / 1 oz del parmesano con la ricota. Agregue la trufa y una llovizna de aceite de trufa y sazone. Cuchara en una manga pastelera.", "Espolvorea una superficie de trabajo con la harina de sémola y saca una forma larga de salchicha. Córtelo en trozos de 2.5cm / 1in y transfiéralos a la bandeja de hornear. Cubra y refrigere durante la noche, hasta que se forme una piel.", "Cuando esté casi listo para servir, incline los guisantes congelados en una licuadora y aplique un poco de sal hasta que quede suave. Pasarlos a través de un tamiz.", "Escalde los guisantes y los frijoles frescos en agua hirviendo durante 2 minutos, luego escurra.", "Derrita la mantequilla en una cacerola ancha y saltee los guisantes, las habas y el tomillo.", "Precalentar la parrilla a alto. Rocíe ligeramente los corazones de lechuga con aceite de oliva y sazone con sal y pimienta. Ase a la parrilla, corte hacia arriba, hasta que esté carbonizado. Dejar de lado.", "Blanquee el gnudi en agua hirviendo con sal durante unos minutos, luego escurra. Mezcle con los guisantes y las habas y colóquelos en un plato para servir. Agregue el puré de lechuga y guisante, adorne con los brotes de guisantes, el cebollino y el queso parmesano restante y sírvalo."], "url": "www_bbc_co_uk_food_recipes_truffle_gnudi_with_bread_54708", "title": "Gnudi de trufa con habas, lechuga de gema a la parrilla y puré de guisantes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "7 g de levadura de acción rápida", "10g de sal", "60g / 2½oz de mantequilla, ablandada", "75g / 3oz de azúcar en polvo", "pellizco polvo de masilla de goma", "pinch mahlab (también llamado mechlebe o mahlepi, disponible en delicatessen especializadas o en línea)", "pellizcar canela molida", "1 naranja, solo ralladura", "150ml / 5fl oz de agua tibia", "150ml / 5fl de leche en oz", "puñado de sultanas", "3 huevos de gallinas camperas, duros en sus caparazones con colorante rojo para alimentos", "1 huevo de gallinas camperas, batido para lavar huevos"], "method": ["Coloque la harina, la levadura, la sal, la mantequilla y el azúcar en un tazón grande. Agregue el polvo de masilla, mahlab y canela, luego la ralladura de naranja. Vierta la mitad del agua y la leche y mezcle brevemente, luego continúe agregando el líquido y mezcle hasta que tenga una masa blanda glutinosa.", "Mezcle las pasas a través de la masa, luego incline sobre una superficie ligeramente enharinada y amasar hasta que tenga una masa flexible. Forma una bola y descansa durante al menos una hora, o toda la noche en la nevera, hasta que duplique su tamaño.", "Alinee una bandeja para hornear con un pergamino para hornear. Divide la masa en tres y rueda en tres filamentos. Trenza las tiras juntas, colócalas en la bandeja de hornear y deja que se levanten durante otra hora o hasta que dupliquen su tamaño.", "Precaliente el horno a 210C / 400F / Gas 6. Cepille la parte superior del pan con un lavado de huevo y coloque los huevos de colores en el pan. Hornee por 20-25 minutos, luego transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_tsoureki_bread_greek_90667", "title": "Pan de Tsoureki (pan griego de Pascua)", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de chocolate negro", "300ml / 10½ fl oz crema doble", "1 huevo grande de gallinas camperas, solo blanco", "50 g / 1 oz de azúcar en polvo", "200g / 7oz de mantequilla, suavizada", "175g / 6oz de azúcar glas", "1 cucharadita de extracto de vainilla", "6 huevos grandes de gallinas camperas, solo blancos, ligeramente golpeados", "Harina normal de 200g / 7oz", "3 cucharaditas de cacao en polvo", "50g / 1¾oz de chocolate puro, derretido"], "method": ["Para hacer la mousse de chocolate, divide el chocolate en trozos pequeños y déjalo a un lado. En una olla pequeña, caliente la mitad de la crema hasta que esté hirviendo a fuego lento. Retire del fuego, agregue las piezas de chocolate y revuelva hasta que el chocolate se haya derretido y la mezcla esté suave.", "Vierta la mezcla en un recipiente y deje enfriar durante 15 minutos. Agregue la crema restante y con un batidor eléctrico de mano, bata la mezcla hasta que se formen picos suaves cuando se quite el batidor.", "En un recipiente limpio, bata la clara de huevo hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar, una cucharada a la vez, y continúe batiendo para hacer una mezcla de merengue suave. Con cuidado dobla el merengue a través de la mezcla de chocolate. Ponga la mousse en el refrigerador y déjela reposar.", "Para hacer la mezcla de tuiles, use una batidora eléctrica de mano para mezclar la mantequilla, el azúcar y el extracto de vainilla en una pasta. Poco a poco agregue las claras de huevo, batiendo todo el tiempo. Doble la harina un poco a la vez golpeando con una cuchara de madera entre cada adición.", "Transfiera una sexta parte de la mezcla a un tazón pequeño y agregue el cacao. Batir hasta que esté bien mezclado. Ahora tiene dos cuencos de pasta tuile, uno normal y uno de chocolate. Cubra ambos cuencos con film transparente y déjelos reposar durante 30 minutos.", "Para hornear los tuiles, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con un pergamino o una lámina de silicona y coloque la plantilla tuile en su posición.", "Extienda un poco de la pasta de tuile simple sobre las formas recortadas de la plantilla con una espátula. Dibuja la cuchilla a través de la plantilla para eliminar cualquier exceso de pasta. Retire la plantilla despegándose de la bandeja, dejándola con formas de pasta en la bandeja de hornear. Deberías poder hacer nueve tuiles. Reserve la pasta de tuile simple restante.", "Con una cuchara, coloque la pasta de chocolate en una pequeña bolsa con una boquilla para escribir. Patrones de tuberías (círculos concéntricos, puntos, líneas rectas, garabatos, líneas onduladas) en los tuiles.", "Cocine por 5-6 minutos, o hasta que se torne dorado por el borde. Retire del horno y, trabajando muy rápido, cubra los tuiles con un rodillo mientras aún estén calientes, de modo que se enfríen en una forma curva.", "Si los tuiles cocinados comienzan a endurecerse antes de que tenga la oportunidad de darles forma, devuélvalos al horno durante 30 segundos a un minuto para que se suavicen.", "Para los cigarros tuiles, haga otros nueve uniformes usando la plantilla como antes. Hornee por 5-6 minutos, o hasta que estén pálidas doradas. Reserve la pasta simple restante. Sáquelo del horno y, trabajando muy rápido, doble las capas tibias alrededor de las manijas de las cucharas de madera para hacer formas de cigarros. Sumerja los tuiles de cigarro en el chocolate puro derretido. Dejar de lado para establecer.", "Para la cesta tuile, vierta una cucharada de la pasta simple restante sobre una lámina de silicona y aplánela con el reverso de una cuchara en un círculo irregular de aproximadamente 8 cm / 3¼ pulgadas de diámetro. Cocine por 5-6 minutos, o hasta que el color marrón dorado sea pálido. Retire del horno y levante la bandeja para hornear. Moldee inmediatamente sobre una taza de panecillo o un molde para hacer una forma de cesto. Déjalos enfriar.", "Use una cucharada de sopa mojada en agua fría para colocar cucharadas de la mousse de chocolate en la cesta. Sirve con los tuiles curvos y en forma de cigarro."], "url": "www_bbc_co_uk_food_recipes_tuiles_with_chocolate_64665", "title": "Azulejos con mousse de chocolate", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 18 tuiles curvos, cigarros o cestas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuiles_with_chocolate_64665_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz almejas", "Mejillones 500g / 1lb 2oz", "Tubos de pasta de 320g / 12oz", "150ml / 5fl oz de vino blanco", "1 diente de ajo", "4 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "puñado de perejil, toscamente picado", "1 g bolsita de azafrán en polvo", "4 tomates de ciruela, sin semillas y picados", "1 chile rojo, finamente picado", "puñado de cohetes", "sal y pimienta negra recién molida"], "method": ["Enjuague las almejas y los mejillones con agua fría. Coloque en un recipiente con agua fría con sal y deje durante aproximadamente una hora. Notarás que las conchas se abren levemente. Enjuague nuevamente con agua fría.", "Mientras tanto, ponga a hervir una cacerola de agua ligeramente salada. Agregue la pasta y cocine hasta que esté al dente. Escurrir y apartar.", "Coloque las almejas enjuagadas y los mejillones en una olla grande junto con el vino, el ajo, el aceite y el perejil. Cubra con una tapa y cocine a fuego alto durante tres minutos, hasta que todas las conchas se hayan abierto.", "Retire las almejas del calor. Deseche inmediatamente cualquier caparazón sin abrir. Retire dos tercios de las almejas y los mejillones de sus caparazones, dejando el resto intacto. Dejar de lado.", "Cuele el licor de cocción a través de un tamiz fino para eliminar las impurezas. Devuelva el licor de cocción a la sartén con las almejas y mejillones sin cáscara y cocine a fuego medio hasta que se reduzca ligeramente.", "Agregue el azafrán, el tomate y el chile y sazone al gusto con sal y pimienta negra recién molida.", "Agregue la pasta drenada a la salsa.", "Mezcle en el cohete y sazone con sal y pimienta negra recién molida.", "Retire del fuego y agregue las almejas y los mejillones en el caparazón. Rocíe con aceite y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tubetti_pasta_with_clams_90088", "title": "Pasta tubetti con almejas, mejillones y rúcula", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 3cm / 1¼ en rebanada gruesa de pan blanco cuadrado", "80 g / 2¾oz de queso fontina, rallado", "2 yemas de huevo de rango medio", "1 cucharadita de aceite de trufa", "sal marina escamosa y pimienta negra"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Tueste ligeramente el pan en ambos lados.", "Pon el pan en una bandeja. Usa un cuchillo muy afilado para cortar cuidadosamente un pozo poco profundo en el centro del pan, alrededor de un cuadrado de 5 cm. Para hacer esto, corte los bordes y empuje hacia abajo en el centro. Recuerda que este es un pozo, no un hoyo. ¡Es importante que no corte todo el camino!", "Distribuya el fontina uniformemente alrededor del borde del pozo.", "Mezcle las yemas con el aceite de trufa y viértalo en el pozo, luego hornee por 3-5 minutos hasta que el queso se derrita.", "Saque la tostada y revuelva un poco la yema, luego salpique con sal y pimienta. Comer de inmediato"], "url": "www_bbc_co_uk_food_recipes_truffle_egg_toast_40065", "title": "Tostadas de huevo de trufa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de chocolate negro, roto en pedazos", "Crema doble 175ml / 6fl oz", "5 cucharadas de brandy, ron u otro licor de tu elección (opcional)", "cacao, azúcar glas o nueces finamente trituradas, para terminar"], "method": ["Cubra bien una bandeja para hornear con dos capas de película adhesiva para poner las trufas en el set.", "Incline las piezas de chocolate en un tazón.", "Vierta la crema en una sartén y deje que hierva.", "Vierta sobre el chocolate y revuelva hasta que todo el chocolate se derrita. Si desea agregar bebidas alcohólicas, mezcle en este punto.", "Permita que la mezcla se enfríe a temperatura ambiente; esto tomará alrededor de 1½ horas, momento en el que se debe configurar.", "Usando un baller de melón o una cucharilla, saca piezas del tamaño de un bocado. Espolvorea tus manos con azúcar glas para evitar que se peguen y enrolla las piezas en bolas.", "Pase el azúcar glas tamizada, el cacao o las nueces trituradas y colóquelos en la bandeja preparada.", "Una vez que estén listos, puede almacenarlos en un recipiente hermético en la nevera durante aproximadamente una semana."], "url": "www_bbc_co_uk_food_recipes_truffles_67741", "title": "Trufas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 12-15 trufas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 berenjenas medianas, cortadas en rondas de 1.5cm / ⅝in", "hasta 200ml / 7fl oz de aceite de oliva", "2 calabacines medianos, cortados en rodajas de 2cm / ¾in", "500g / 1lb 2oz de papas cerosas grandes (como Charlotte), finamente cortadas (alrededor de 3 mm / ⅛in)", "2 pimientos rojos asados ​​(de un tarro), cortados en tiras", "pequeño racimo de orégano fresco", "pequeño manojo de albahaca fresca", "2 cucharadas de aceite de oliva", "4 dientes de ajo, aplastados", "400g / 14oz de tomates maduros, pelados y picados", "1 cucharadita de tomillo seco", "sal y pimienta negra recién molida", "azúcar pizca (opcional)"], "method": ["Precalentar el horno a 200C / Fan 180C / Gas 6.", "Coloque las rodajas de berenjena en una bandeja grande para hornear y cepille con aceite de oliva. Sazonar con sal. Asar durante 20-25 minutos, o hasta que estén suaves y ligeramente dorados. Retirar del horno y dejar enfriar.", "Vierta una capa de aceite de oliva de 5 mm / ¼ de pulgada en la base de una sartén grande de base pesada. Freír los calabacines a fuego medio, durante unos minutos a cada lado, luego retirarlos y escurrirlos sobre la toalla de cocina. Sazonar ligeramente con sal.", "Agregue las rodajas de patata a la sartén y freír en ambos lados hasta que se ablanden completamente y un color dorado muy claro alrededor de los bordes. Esto tomará hasta 10 minutos. Escurrir en un plato forrado con papel de cocina.", "Para hacer la salsa, ponga el aceite de oliva en una cacerola y agregue el ajo. Cocine durante 3-4 minutos a fuego medio bajo hasta que esté suave y aromático, luego agregue los tomates y el tomillo. Condimentar con sal y pimienta.", "Llevar a ebullición, luego reduzca el fuego y cocine suavemente, sin cubrir, hasta que esté bien reducido - alrededor de 25 minutos. Pruebe después de 10 minutos: si la salsa tiene un sabor ácido, agregue una pizca de azúcar.", "Reduzca el horno a 180C / 160C Fan / Gas 4.", "Para ensamblar, unte un par de cucharadas de salsa de tomate en la base de un plato de horno. Espolvorea sobre orégano fresco y hojas de albahaca. Cubra con todas las berenjenas.", "Agregue más salsa de tomate, espolvoree con más hierbas y agregue los calabacines. Repita con más salsa de tomate, más hierbas y los pimientos, luego termine con la última salsa de tomate y hierbas, y cubra con las papas.", "Espolvoree más sal y pimienta y rocíe con un poco más de aceite de oliva. Hornee en el horno durante 25-30 minutos, o hasta que las papas estén crujientes y doradas y las verduras estén tiernas."], "url": "www_bbc_co_uk_food_recipes_tumbet_98868", "title": "Tumbet", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tumbet_98868_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["80g de atún de estaño en agua, escurrido", "1 cebolleta, finamente cortada", "½ pimiento rojo pequeño (40 g / 1½ oz), cortado en dados pequeños", "2 cucharaditas de mayonesa ligera", "2 x 30 g / 1 oz rebanadas de pan integral o granero", "sal y pimienta negra recién molida"], "method": ["Mezcle el atún, la cebolleta, el pimiento rojo y la mayonesa en un tazón. Sazonar ligeramente con sal y pimienta. Extienda una rebanada de pan y cubra con la segunda para hacer un sándwich."], "url": "www_bbc_co_uk_food_recipes_tuna_and_red_pepper_28066", "title": "Sándwich de atún y pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz formas secas de pasta corta, como fusilli o penne", "250g / 9oz pequeñas florecillas de brócoli congeladas", "40 g / 1½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "600 ml / 20 fl oz de leche semidesnatada", "75g / 2½oz de queso cheddar maduro", "sal y pimienta negra recién molida", "1 x 185 g de trozos de atún en agua o salmuera, escurridos", "2 tomates firmes y maduros, en rodajas (opcional)"], "method": ["Llene a la mitad una olla grande con agua y llévela a ebullición. Agregue la pasta, ponga el agua a hervir y cocine de acuerdo con las instrucciones del paquete hasta que esté tierna. Justo antes del final del tiempo de cocción, agregue las flores de brócoli congeladas a la sartén y cocine con la pasta durante los últimos 2-3 minutos, hasta que estén tiernas.", "Mientras tanto, caliente la mantequilla, la harina y la leche en una cacerola a fuego medio hasta que la mezcla solo burbujee, batiendo constantemente con un batidor de globo hasta que quede suave y espeso hasta formar un roux.", "Continúe cocinando el roux durante 2-3 minutos más, revolviendo constantemente hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara. Revuelva en la mitad del queso hasta que se derrita, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Precalentar la parrilla a su configuración más alta.", "Escurra la pasta y el brócoli en un colador grande y transfiéralo a un plato refractario de horno poco precalentado (un plato de lasaña es ideal). Escama el atún en la parte superior de la pasta y el brócoli.", "Vierta la salsa de queso sobre la mezcla de pasta, luego cubra con los tomates en rodajas, si los está usando. Espolvorea sobre el queso restante.", "Coloque la pasta horneada debajo de la parrilla caliente durante 4-5 minutos, o hasta que el queso se derrita y comience a dorarse. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tuna_and_broccoli_pasta_25783", "title": "Pasta de atún y brócoli hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_and_broccoli_pasta_25783_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14½oz de tomates picados enlatados", "1 cucharadita de orégano fresco, más extra para servir", "3 dientes de ajo, en rodajas", "50ml / 1¾fl oz de aceite de oliva virgen extra", "dash aceite de oliva", "mantequilla perilla", "500 g / 1 libra de papas para hornear de 1½ oz, peladas y finamente cortadas", "500 g / 1 libra de berenjena 1½ oz, en rodajas", "1 pimiento rojo", "1 pimiento verde", "sal y pimienta negra recién molida", "4 rebanadas de queso manchego"], "method": ["Para la salsa, coloque los tomates enlatados, el orégano, el ajo y el aceite de oliva en una sartén y cocine a fuego lento durante 25 minutos.", "Mientras tanto, para el tumbet, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Caliente el aceite y la mantequilla en una sartén grande. Agregue las papas y fría por 3-4 minutos hasta que estén coloreadas. Retire con una espumadera y escurra sobre papel de cocina.", "Repita con la berenjena, también escurriendo sobre papel de cocina.", "Cortar los dos pimientos por la mitad, raspar y desechar las semillas, luego freír durante dos minutos hasta que estén ligeramente ennegrecidas. Transfiera a un plato forrado con papel de cocina.", "En un plato a prueba de horno, divida las papas en cuatro pilas. Cubra cada uno con un poco de berenjena, una mitad de pimienta y una rebanada de queso. Seguro con un palito de cóctel.", "Para finalizar la salsa, enfríe un poco antes de licuar hasta que quede suave (usando una licuadora manual). Puede pasar la salsa a través de un fino tamiz de metal para obtener un acabado realmente suave.", "Coloque la salsa sobre el tumbet y cocine en el horno durante 20 minutos.", "Servir en trozos con más orégano."], "url": "www_bbc_co_uk_food_recipes_tumbetlayeredpeppera_88137", "title": "Tumbet (pimienta en capas y hornear manchego)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["80 g / 3 oz de judías verdes, a la mitad", "160g de atún de estaño en agua, escurrido", "50g / 1¾oz de pimiento rojo, cortado en dados", "1 cucharada de aderezo sin grasa"], "method": ["Cocine los frijoles en una olla con agua hirviendo durante 5 minutos o hasta que estén tiernos. Escurrir y colocar en un recipiente con agua fría. Cuando estén frescos, escurra el agua fría y mezcle los frijoles con el atún, la pimienta y el aderezo en un tazón. Servir."], "url": "www_bbc_co_uk_food_recipes_tuna_and_bean_salad_93054", "title": "Ensalada de atún y frijol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de judías verdes, reducidas a la mitad", "2 huevos de gallinas camperas", "400 g de frijoles mezclados en agua, escurridos y enjuagados", "100g / 3½oz de tomates cherry, cortados por la mitad", "4 cebollas de primavera, en rodajas finas", "160g filete de atún de lata en agua, escurrido", "1 cucharada de aceite de oliva extra virgen", "1 cucharadita de vinagre de vino tinto", "1 cucharadita de mostaza Dijon", "pimienta negra recién molida"], "method": ["Cocine las judías verdes en una olla con agua hirviendo durante 4 minutos. Sumérjalos en un recipiente con agua muy fría.", "Cocine los huevos en una olla con agua hirviendo durante 8 minutos. Escurrir en un colador con agua fría hasta que esté frío. Pelar y cortar los huevos en cuartos.", "Para el aderezo, mezcle el aceite, el vinagre y la mostaza en un tazón grande hasta que espese. Sazonar con pimienta negra.", "Agregue las judías verdes, los frijoles mezclados, los tomates cherry y las cebolletas al aderezo y mezcle. Agite el atún en la parte superior y agregue los huevos duros. Sazonar con pimienta negra."], "url": "www_bbc_co_uk_food_recipes_tuna_bean_salad_54783", "title": "Ensalada de frijoles de atún", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_bean_salad_54783_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lomo de atún fresco de 500g / 1lb 2oz, recortado", "2 cucharadas de aceite de oliva", "1 pan de masa fermentada, rebanado", "1 chalote, finamente cortado en cubitos", "pellizcar la mostaza Dijon", "½ limón, solo jugo", "4 cucharadas de cebollín, finamente picado"], "method": ["Coloque un pedazo de película adhesiva en la superficie de trabajo y coloque ¾ del atún en la parte superior. Coloque otra pieza de película adhesiva en la parte superior y, utilizando un rodillo, golpee el atún hasta que esté muy delgada.", "Retire la pieza superior de película adhesiva. Coloque una placa de 20 cm / 8 pulgadas de diámetro sobre el atún y córtelo alrededor. Voltea todo al revés para que la placa esté en la parte inferior.", "Calentar una sartén y agregar el aceite, una vez caliente, agregar el pan rebanado y cocinar a cada lado hasta que estén crujientes.", "Retire la película adhesiva restante y coloque la masa madre tostada sobre el atún.", "Coloque un plato de servir en la parte superior, boca abajo. Voltee los platos, para que el atún esté encima del pan, en el plato de servir.", "Para el tartar de atún, pique finamente el resto del atún y colóquelo en el tazón con la chalota, la mostaza, el jugo de limón y la mitad de las cebolletas.", "Para servir, decore el carpaccio de atún con el tartar de atún y el resto de las cebolletas."], "url": "www_bbc_co_uk_food_recipes_tuna_carpaccio_with_25315", "title": "Carpaccio de atún con masa madre y tartare de atún", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de anchoas en aceite", "400g / 14oz de aceitunas negras sin hueso", "Alcaparras de 75 g / 2½ oz, escurridas y enjuagadas", "2-3 dientes de ajo", "1 cucharadita de mostaza Dijon", "2 cucharaditas de jugo de limón", "2 cucharadas de aceite de oliva de buena calidad", "puñado de albahaca fresca, picada", "pimienta negra fresca", "2 cucharaditas de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "100ml / 3½oz de aceite de oliva virgen extra", "½ limón, solo jugo", "pizca de sal y pimienta", "4 lechuga Baby Gem", "Frijoles verdes de 200g / 7oz, coronados, cola y blanqueados", "4 cucharaditas de alcaparras, escurridas y enjuagadas", "200g / 7oz de patatas nuevas cocidas", "24 tomates baby ciruela, cortados por la mitad", "4 filetes de atún, aproximadamente 175 g / 6 oz cada uno", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "4 huevos medianos hervidos, pelados y partidos por la mitad", "1 cucharada de cebollino picado", "1 barra de pan de masa fermentada de oliva fougasse"], "method": ["Para hacer tapenade, combine todo menos la mitad de la albahaca y la pimienta negra en un procesador de alimentos y mezcle hasta que esté un poco desmenuzado, pero no puré. Verter en un plato y decorar con pimienta negra y las hojas restantes de albahaca.", "Para hacer el aderezo, coloque todos los ingredientes en un tarro de mermelada limpio. Ponle la tapa y agita bien hasta que el aderezo se haya emulsionado.", "Para hacer la ensalada, rasgue las hojas de Baby Gem y colóquelas en un tazón con los ingredientes restantes de la ensalada.", "Para hacer el atún, caliente una sartén hasta que esté caliente. Frote un poco de aceite de oliva en ambos lados de los filetes de atún y sazone con sal y pimienta negra recién molida.", "Freír el atún en una sartén caliente durante dos minutos por cada lado, o hasta que esté cocido a su gusto.", "Para servir, rocíe dos cucharadas de aderezo sobre la ensalada. Con mucha suavidad, con las manos, mezcle la ensalada para que quede cubierta con el aderezo. Arregle la ensalada en un plato o tabla grande. Coloque los huevos alrededor de la ensalada.", "Corta el atún en la diagonal y coloca rodajas encima de la ensalada. Espolvorea sobre las cebolletas. Vierta el aderezo restante en una jarra sobre la mesa al lado de la ensalada. Sirve con fougasse y tapenade."], "url": "www_bbc_co_uk_food_recipes_tuna_nicoise_87874", "title": "Atún Niçoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de trigo integral de 150g / 5oz, cocida según las instrucciones del paquete", "150g / 5oz de maíz dulce congelado o estañado", "Atún enlatado 150g / 5½oz en agua de manantial, escurrido", "2 cucharadas de yogur natural", "1 cucharada de mayonesa", "pimienta negra recién molida", "limón exprimidor (opcional)"], "method": ["Mezcle todos los ingredientes hasta que estén bien combinados. Transfiera a una tina de plástico sellada y guárdela en el refrigerador."], "url": "www_bbc_co_uk_food_recipes_tuna_and_sweetcorn_pasta_75779", "title": "Ensalada de pasta de atún y dulce de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_and_sweetcorn_pasta_75779_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ de sandía, pelada, cortada en rodajas de 1cm / ½ pulgada de espesor", "2 rebanadas finas de pan de masa fermentada", "4 filetes de lomo de atún fresco de 4 x 50-75 g / 2-3 onzas (pida al pescadero atún de grado sushi)", "1 limón, solo jugo", "2 cucharadas de cebollines frescos muy finamente picados, más extra para servir", "1 chalote, muy finamente picado, más extra para servir", "botón de mantequilla", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra, para servir"], "method": ["Coloque todas las rebanadas de sandía en una bolsa de alimentos con cierre hermético. Agregue una pizca de sal y enfríe en la nevera durante 2-3 días.", "Cuando la sandía esté lista, precaliente el horno a 150 ° C / 130 ° Ventilador / Gas 4.", "Tueste el pan, luego corte cada mitad por la mitad para crear cuatro rebanadas, cada una con un lado tostado y un lado sin tostar. Sándwich entre 2 bandejas de hornear limpias. Hornee en el horno por 5 minutos o hasta que esté duro y crujiente. Retire las bandejas del horno y deje el pan a un lado para que se enfríe, aún en forma de sándwich entre las bandejas.", "Coloque una hoja de película adhesiva sobre una superficie de trabajo limpia. Coloque los filetes de atún en la parte superior y cúbralos con una segunda hoja de película adhesiva. Aplanar los filetes de atún a un grosor de 2 mm con un mazo de carne o un rodillo. (Haga este bistec a la vez si es más fácil).", "Recorta cada pieza de atún aplastado en un círculo, usando un cuenco vuelto hacia arriba como guía. Dejar de lado.", "Corta los aderezos de atún muy finamente y colócalos en un bol. Exprima más de la mitad del jugo de limón y agregue cebollino y chalotes. Sazonar, al gusto, con sal y pimienta negra recién molida, luego mezclar bien.", "Caliente la mantequilla en una sartén a fuego alto hasta que empiece a dorarse. Picar las rebanadas de sandía en trozos pequeños y agregarlos a la sartén por lotes, freír durante 1-2 minutos en cada lado, o hasta que estén caramelizados y calientes. Sazonar con una pizca de sal. Retire de la sartén y déjela a un lado sobre un plato calentado mientras fríe la sandía restante.", "Para servir, espolvorea un poco de tartar de atún en cada tostada. Coloque en los platos de servir y cubra con una pieza de sandía cocida. Voltee cada círculo de carpaccio de atún aplastado, descartando la película adherida y coloque un círculo al lado de cada tostada. Cepille cada círculo de carpaccio de atún con un poco del aceite de oliva virgen extra, espolvoree sobre la chalota y el cebollín, exprima el jugo de limón y sazone al gusto con pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_tuna_carpaccio_with_42630", "title": "Carpaccio de atún con sandía caramelizada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de judías verdes, recortadas", "1 huevo de gallinas camperas (nevera fría)", "2 cucharadas de mayonesa light", "1 cucharada de alcaparras para bebés, escurridas", "4 pepinillos bebé, escurridos y en rodajas", "¼ cucharadita de hierbas mezcladas secas", "1 x 185 g / 6½ oz de atún en agua de manantial", "2 tortillas de harina grandes o envolturas (blancas, integrales o una combinación)", "pequeño puñado de hojas de espinaca bebé", "1 tomate maduro grande, cortado en 8 piezas", "20 g / ¾oz de aceitunas negras deshuesadas en salmuera, escurridas", "pimienta negra recién molida"], "method": ["Ponga a hervir una olla de agua, agregue los frijoles y cocine durante cuatro minutos.", "Levanta los frijoles con una espumadera y mételos en un tazón grande de agua fría. Alternativamente, incline los frijoles en un colador y enjuáguelos con agua corriente hasta que estén fríos. Desagüe.", "Para hervir el huevo, vuelva a colocar la sartén con el agua caliente sobre el fuego, agregue el huevo y vuelva a hervir el agua. Cocine durante ocho minutos, luego ponga el huevo en un colador con agua corriente hasta que esté frío. Deja el huevo en agua fría mientras preparas el resto del relleno.", "Mezcle la mayonesa, las alcaparras, los pepinillos, las hierbas y algunos giros de pimienta negra molida en un bol. Agregue el atún y mezcle todo a la ligera, sin triturar demasiado el atún.", "Pele el huevo, luego córtelo en cuartos, a lo largo.", "Coloque las tortillas en un tablero y cubra cada una con una capa de hojas de espinaca, dejando un espacio de aproximadamente 5 cm en la parte superior e inferior de la tortilla. Agregue las judías verdes, todas en una dirección.", "Divida la mezcla de atún entre las tortillas, luego las piezas de huevo y tomate. Espolvorea con las aceitunas, presionando cada una ligeramente entre tu pulgar y tu dedo para aplanarlas ligeramente.", "Doble la parte superior e inferior de cada envoltura hacia adentro para cubrir la mayor parte del relleno y luego enrolle con fuerza. Envuélvalos en papel de aluminio - no es necesario hacer esto si se come de inmediato - luego enfríe las tortillas envueltas hasta que estén listas para comer. Come dentro de las 24 horas y transporta con una bolsa de hielo si sirve como un almuerzo para llevar. Desenvuelve la lámina mientras te comes la envoltura.", "Si va a llevar la venda al trabajo, no se olvide de usar una bolsa de hielo y una bolsa de hielo para mantenerla fría y en condiciones óptimas hasta que esté listo para comer."], "url": "www_bbc_co_uk_food_recipes_tuna_nioise_wrap_20414", "title": "Abrigo de atún Niçoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_nioise_wrap_20414_16x9.jpg", "isVegetarian": false, "recommendations": 0}]