[{"isVegetarian": true, "title": "Freewheeling fruit fingers", "url": "www_bbc_co_uk_food_recipes_freewheeling_fruit_23409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small eating apple, peeled, core removed, grated", "30g/1¼oz mixed dried fruit", "50g/2oz rolled oats ", "1 heaped tbsp demerara sugar", "3 tbsp apple juice", "1 tsp vegetable oil, plus extra for greasing"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a loaf tin with a little vegetable oil.", "In a bowl, mix together the grated apple, dried fruit, oats and sugar until well combined. Stir in the apple juice and oil. ", "Scoop the mixture into the prepared loaf tin and flatten it into the corners using a palette knife. ", "Bake in the oven for about 25 minutes, or until the oats are golden-brown. Set aside to cool slightly, then turn out onto a wire rack to cool completely.", "To serve, cut into four fingers."]}, {"isVegetarian": true, "title": "Oaty bars", "url": "www_bbc_co_uk_food_recipes_freezer_oaty_bar_14307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freezer_oaty_bar_14307_16x9.jpg", "ingredients": ["knob of butter, for greasing", "225g/8oz jumbo rolled oats", "50g/2oz almonds, skin on", "60g/2¼oz mixed seeds", "60g/2¼oz dried cranberries", "50g/2oz plain or chocolate rice pops", "100g/3½oz agave syrup", "100g/3½oz peanut butter", "125g/4½oz honey"], "serves": "Makes 24 bars", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly grease a 33x23cm/13x9in baking tray that is about 3cm/1in deep. Line with cling film.", "Put the oats and almonds in a food processor and blend for 10–20 seconds, until fairly well broken down (you want some texture, but it should be slightly powdery). Tip into a large bowl then add the seeds, cranberries and rice pops and stir really well.", "Heat the agave syrup, peanut butter and honey in a small saucepan over a medium heat until melted. Stir, then pour this over the oat mixture and mix well with a spoon, until cooled slightly. Mix with your hands to make sure all the oats are coated.", "Tip into the tin and spread out evenly. Lay a sheet of cling film over the top, then press down firmly to squash the mixture flat. Leave in the freezer for 1 hour until set.", "Remove the top layer of cling film, then tip out onto a board, remove the remaining cling film and cut into 24 bars.", "To keep, layer them up between sheets of greaseproof paper and store in a sealed box in the fridge. They can also be kept in the freezer."]}, {"isVegetarian": false, "title": "Fregola con arselle (Sardinian pasta and clam soup)", "url": "www_bbc_co_uk_food_recipes_fregolaconarsellesar_89307", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp extra virgin olive oil, plus extra to serve", "3 garlic cloves, sliced", "4 tbsp chopped parsley", "¼ tsp chilli flakes", "1¼ litres/2 pints 4fl oz fish stock", "4 medium tomatoes, skins removed, de-seeded and finely chopped", "250g/9oz fregola pasta", "1kg/2lb 4oz small clams, rinsed and drained (discard any clams that remain open when tapped)", "large pinch saffron, infused in 1 tbsp hot water", "1 lemon, finely grated zest only"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a wide pan over a medium heat and add the garlic, parsley and chilli flakes. Heat, stirring, for one minute, until the garlic starts to colour.", "Add the stock and half of the tomatoes and bring to the boil.", "Add the fregola pasta and simmer for ten minutes (or to cook according to packet instructions), stirring frequently, until the pasta is just cooked.", "Meanwhile, pour enough water into a large clean pan with a lid to come about ½cm/¼in up the sides. Bring to the boil, then add the clams and cover tightly with the lid. Cook, shaking the pan occasionally, over a high heat, for 3-5 minutes, or until all of the clams have opened.", "Remove the clams from the pan with a slotted spoon. Discard any clams that have not opened.", "Carefully pour off most of the cooking liquor from the pan into a bowl, leaving behind any sand and grit that will have settled on the bottom of the pan.", "Add the clams, the strained cooking liquor, the infused saffron and its water, the lemon zest and the remaining tomatoes to the pan of simmering pasta and mix well.", "Remove from the heat and ladle into six soup bowls. Drizzle with a little olive oil and serve immediately."]}, {"isVegetarian": false, "title": "French-trimmed chicken breast with wild mushrooms", "url": "www_bbc_co_uk_food_recipes_french-trimmed_chicken_70337", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 corn-fed free-range chicken breasts, French-trimmed (see below for method)", "salt and freshly ground black pepper", "50g/1¾oz butter", "1 tbsp olive oil", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "50g/1¾oz trompettes de mort mushrooms, cleaned and trimmed", "50g/1¾oz chanterelle mushrooms, cleaned and trimmed", "50g/1¾oz girolles mushrooms, cleaned and trimmed", "75ml/3fl oz Madeira", "150ml/5fl oz reduced chicken stock", "75ml/3fl oz double cream", "2 tbsp finely chopped chives", "2 tbsp finely chopped chervil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "To French-trim your own chicken, cut the legs from the bird and set them aside to use in another dish. Place a sharp knife onto the front end of the chicken and cut down either side of the wishbone. Discard the wishbone.", "Slice down either side of the breast bone and remove the chicken breasts, with the wings still attached. Trim the ends off the wings and discard.", "Run the knife around the end of each wing, push the flesh down to reveal some of the bone and scrape the flesh from the revealed bone. You now have a French-trimmed chicken breast.", "Season the chicken breasts with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot, add half the butter then cook the chicken, skin side down, for 1-2 minutes or until the skin is golden-brown.", "Flip the chicken breasts over and cook for another minute then transfer to the oven and roast for 12-15 minutes or until the chicken is cooked through.", "Meanwhile, heat another frying pan, add the remaining butter, the shallots and garlic and cook gently for 1-2 minutes until just softened. Add the mushrooms, cook for one minute then add the Madeira, let it flambé then cook until reduced by half.", "Add the chicken stock and cook for another minute then add the cream. Season with salt and freshly ground black pepper then add the chives and chervil and stir them through the sauce.", "To serve, spoon the mushrooms onto a serving plate, carve the chicken into thick slices and place on the top."]}, {"isVegetarian": true, "title": "French apple tart with calvados and Chantilly cream", "url": "www_bbc_co_uk_food_recipes_french_apple_tart_with_70368", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/french_apple_tart_with_70368_16x9.jpg", "ingredients": ["200g/7oz ready-made puff pastry", "2 tbsp stewed apple, or sweet apple sauce", "6 apples (Cox or Granny Smith), peeled, quartered and cored", "2 tbsp caster sugar", "40g/1½oz butter, cubed", "1 free-range egg yolk, beaten", "250ml/9fl oz double cream", "1 tbsp icing sugar", "1 vanilla pod, seeds scraped out", "splash calvados"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Roll the puff pastry out on a clean work surface to a large sheet, 3mm thick. Using a bowl or plate, cut a circle about 25cm/10in in diameter. Crimp the edge before turning the whole sheet over and laying it directly onto a flat baking tray. Chill in the fridge for at least 10 minutes.", "Remove the pastry from the fridge and spread the apple compôte all over the base of pastry, leaving a 1cm/½in border at the edge.", "Slice the apples the thickness of a two-pound coin and place them onto the pastry sheet, fanning them out, starting from the outside and working in. The apples should overlap each other. Use the largest slices on the outside and place the smallest slices in the middle of the tart.", "Once all the apples have been laid out, sprinkle over the caster sugar and dot with the cubed butter. Brush the border with the beaten egg and bake in the oven for about 30 minutes, or until golden-brown and risen around the edge.", "For the Chantilly cream, whisk the cream, icing sugar and seeds from the vanilla pod in a bowl until very soft peaks form and set aside until ready to serve.", "When ready to serve, place the tart onto a serving plate. Warm the calvados in a small saucepan. Ignite the alcohol with a match (be careful of your fingers) and pour over the tart. Serve with Chantilly cream."]}, {"isVegetarian": true, "title": "Lighter French apple tarts", "url": "www_bbc_co_uk_food_recipes_french_apple_tarts_with_72842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz fat-free Greek-style yoghurt", "2 tbsp maple syrup", "2 tsp chia seeds", "200g/7oz ready-rolled light puff pastry", "2 tbsp apricot jam", "2 large sharp, green eating apples (300g/10½oz in total), quartered, cored, thinly sliced", "1 tbsp semi-skimmed milk", "2 tsp granulated sweetener", "½ tsp ground cinnamon", "½ tsp ground mace (or nutmeg)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the yoghurt, mix together all the ingredients in a small bowl. Cover and refrigerate for at least 2 hours, preferably overnight.", "Preheat the oven to 220C/200C Fan/Gas 7 and line a baking tray with baking paper.", "Cut the puff pastry into quarters (they should be about 10x13cm/4x5in) and place on the lined baking tray.", "Divide the jam between the pastry and spread with the back of a spoon, leaving a 1cm/½in margin all the way around each piece. Lay the apple slices, overlapping, on top of the jam. Brush the exposed edges of the pastry with the milk.", "Mix together the sweetener, cinnamon and mace and sprinkle liberally over each tart.", "Bake for 15–20 minutes, or until the pastry is golden-brown and crispy.", "Serve with a generous spoonful of the yoghurt on the side."]}, {"isVegetarian": false, "title": "French dip sandwich", "url": "www_bbc_co_uk_food_recipes_french_dip_sandwich_25385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp sea salt", "1 tsp black peppercorns, ground", "1 tsp dried mustard powder", "1 tsp dried thyme", "2kg/4lb 8oz piece of sirloin, rolled\t", "2 tbsp dripping or oil", "15g/½oz butter", "2 shallots, finely chopped", "250g/9oz button mushrooms, finely sliced", "1 garlic clove, sliced", "1 large sprig thyme, leaves only", "1 tbsp plain flour", "200ml/7fl oz red or white wine", "500ml/18fl oz beef stock (or consommé) ", "2 tbsp finely chopped fresh tarragon", "couple of large baguettes", "butter (or dripping)", "mustard or horseradish (optional)"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Mix the sea salt, pepper, mustard powder and thyme together and press it into the surface areas of the sirloin. ", "Put the dripping or oil in a roasting tin and heat over a fairly high heat until simmering. Sear the beef on all sides until fairly deep brown, then transfer to the oven. Cook to your liking (10 minutes per 500g/1lb 2oz for rare, 15 minutes per 500g/1lb 2oz for medium-rare, 20 minutes per 500g/1lb 2oz for medium and 25 minutes per 500g/1lb 2oz for well-done).", "Once the roast has finished cooking, remove from the tin and leave on a platter, covered with foil, to rest for at least 20 minutes. Strain off any fat and juices from the roasting tin and set aside.", "For the gravy, heat the butter in a saucepan. Add the shallots and button mushrooms and cook until the shallots are a light golden-brown. Add the garlic and thyme and stir for another 2 minutes. ", "Sprinkle in the flour, and stir for a couple of minutes. Add the wine and allow it to bubble and for the volume of liquid to reduce by half. Add the stock (or consommé) and cook until reduced by a third. Stir in the tarragon. ", "Taste and season with salt and pepper. Add any juices from the roast beef, and if you want to extract the most amount of the flavour from the roasting tin, add the sauce to the roasting tin and stir vigorously over a low heat to incorporate the caramelised cooking juices (this is called deglazing). Transfer to a warm jug.", "Serve the sirloin sliced with the gravy, piled into buttered baguette. Good with mustard or horseradish on the side."]}, {"isVegetarian": false, "title": "French onion soup with cheese mustard croûtes", "url": "www_bbc_co_uk_food_recipes_french_onion_soup_with_02884", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/french_onion_soup_with_02884_16x9.jpg", "ingredients": ["50g/1¾oz butter", "1 tbsp olive oil", "6 large white onions, thinly sliced", "1½ tbsp caster sugar", "200ml/7fl oz white wine", "2 litre/1¾ pint good rich beef stock", "3 bay leaves", "sprig rosemary", "salt and freshly ground black pepper", "½ thin baguette", "Dijon mustard", "25g/1oz gruyère cheese, grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter and oil in a deep saucepan. Add the onion and fry over high heat for few minutes. Cover, lower the heat and simmer for about 10 minutes.  ", "Remove the lid, sprinkle in the sugar and some salt and pepper, and fry for a few minutes. Cover, and simmer for at least 15 minutes, or until the onion is tender, golden-brown and caramelised.", "Add the wine and boil for a few minutes, add the stock and the herbs and cook for another 8–10 minutes.", "To make the croûtes, slice the baguette, toast one side under the grill. Spread the bread side with mustard and top with grated cheese. Grill until just melted.", "Remove the herbs, check the seasoning and serve in hot bowls with the cheese croûtes on top."]}, {"isVegetarian": false, "title": "Classic French onion soup", "url": "www_bbc_co_uk_food_recipes_french_onion_soup_with_75645", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "3 large onions, thinly sliced", "2 thyme sprigs, leaves picked", "1tbsp soft brown sugar", "2 garlic cloves, thinly sliced", "200ml/7fl oz white wine", "1 heaped tbsp plain flour", "50ml/2fl oz brandy", "50ml/2fl oz dry sherry", "1 litre/1¾ pint fresh dark beef stock", "1 baguette, sliced thickly ", "110g/4oz Gruyère cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan and add 2 tablespoons of the olive oil, the onions, thyme and sugar. Fry for 10-15 minutes over a medium-low heat, or until softened and golden-brown, stirring occasionally.", "Add the garlic and cook for 1 minute, then add the white wine and cook until the volume of liquid has reduced by half. Stir in the flour and cook for 2 minutes.", "Add the brandy and sherry, then pour in the stock and bring to the boil. Reduce the heat slightly and cook for about 10-15 minutes.", "Meanwhile, heat a griddle until hot. Drizzle the remaining olive oil over the bread and toast on one side. Set aside.", "Season the soup to taste, adding a little more sugar or alcohol if needed.", "Preheat the grill to high. ", "Ladle the soup into bowls and top with the bread, toasted side down. Add the cheese on top of the bread and grill until bubbling and golden-brown."]}, {"isVegetarian": false, "title": "French onion soup with Gruyère croûtons", "url": "www_bbc_co_uk_food_recipes_french_onion_soup_with_76295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "3 large onions, finely sliced", "2 sprigs thyme, leaves picked", "1 tbsp soft brown sugar", "2 garlic cloves, finely sliced", "200ml/7fl oz white wine", "1 heaped tbsp plain flour", "50ml/2fl oz brandy", "50ml/2fl oz dry sherry", "1 litre/1¾pints fresh dark beef stock", "1 baguette, sliced thickly ", "110g/4oz Gruyère cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan or sauté pan until hot, add two tablespoons of olive oil, the onions, thyme and soft brown sugar. Fry for 10-15 minutes over a medium-low heat, or until softened and golden-brown, stirring occasionally so it doesn’t catch on the bottom.", "Add the garlic and cook for a minute, then add the white wine and cook until the volume of liquid has reduced by half. Stir in the flour and cook for two minutes.", "Add the brandy and sherry, then pour in the stock and bring to the boil. Reduce the heat slightly and cook gently for about 10-15 minutes.", "While the soup simmers, heat a griddle until hot. Drizzle the remaining tablespoon of olive oil over the bread and toast on one side. Set aside.", "Check the seasoning of the soup, adding plenty of salt, a little black pepper, and more sugar or alcohol if necessary to suit your own taste.", "Preheat the grill to high.", "Ladle the soup into bowls and top with the toasted bread. Add the cheese on top of the bread and grill until bubbling and golden-brown."]}, {"isVegetarian": false, "title": "French partridge in a bread blanket, butternut crush and Brussels sprouts", "url": "www_bbc_co_uk_food_recipes_french_partridge_in_a_31092", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "50g/2oz onion, finely chopped", "110g/4oz button mushrooms, finely sliced", "25g/1oz bacon, finely chopped", "1 clove baked garlic, peeled and puréed", "30g/1¼oz Cumbrian ham, finely chopped", "10g/½oz chopped fresh chervil", "1½ tsp treacle vinegar", "4 French partridge breasts\t\t\t\t\t ", "4 slices air-dried ham", "4 slices white bread, crusts removed", "50g/2oz butter ", "150g/5oz onions, chopped", "10g/½oz butter", "150ml/5fl oz Madeira", "600ml/1 pint chicken stock", "1tsp potato flour, mix with a few drops of water before adding to the sauce to thicken", "½ pomegranate, seeds removed", "1 butternut squash, cut in half, seeds removed, scored", "3 garlic cloves, crushed", "2-3 tbsp olive oil", "150g/5oz small Brussels sprouts", "1 tsp bacon fat", "110g/4oz chestnuts, peeled and sliced", "25g/1oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the stuffing heat the butter in a heavy-based frying pan and fry the onions, bacon, mushrooms, garlic and Cumbrian ham for 3-4 minutes. Add the treacle vinegar. Cook until all the liquid has evaporated. Remove the pan from the heat and set aside to cool. Once the mixture has cooled add the chervil and season, to taste, with salt and freshly ground black pepper.", "Remove the small fillet from the partridge (this is the fillet on the underside of the breasts) and make a small incision to the thicker side of the breast to form a small pouch.", "Place the stuffing carefully into each pouch and fold the small fillet back over closing the pouch then wrap in the air dried ham.", "Feed the bread, one slice at a time, through the pasta machine. Repeat the process several times until the bread is thin. Put the bread flat onto a board and brush with melted butter then sprinkle with dried sage and onion.", "Place the seasoned stuffed partridge breast at the bottom of the bread, Fold in the sides of the bread and brush with melted butter, Fold the bread over to form a parcel and seal tight.", "Preheat the oven to 180C/350F/Gas 4.", "Heat the butter in a small frying pan and fry the partridge until golden-brown on all sides. (This may need to be done in batches.) Remove from the pan and cook in the oven for 6-8 minutes. Remove the partridge from the oven and set aside to rest for 2-3 minutes.", "For the Madeira sauce heat the butter in a frying pan over a medium heat and fry the onions until softened and golden-brown. Pour in the Madeira and reduce the sauce by two-thirds. ", "Add the chicken stock and reduce the mixture to 300ml/10fl oz. Stir in the potato flour mixture and strain the sauce through a fine sieve and into a clean saucepan. Blend the sauce with a hand blender. Season to taste with salt and black pepper and stir in the pomegranate seeds.", "For the crush, score the squash with a sharp knife. Rub with the garlic and drizzle over the olive oil. Season with salt and freshly ground black pepper. Bake in the oven for 30-40 minutes, or until tender. Remove the flesh and crush with the back of a fork. Set aside.", "Prepare the sprouts by removing the outer leaves. Remove the base of the sprout, and then with a sharp knife make a cross on the base. Place into boiling water and cook for 3-4 minutes, then remove the sprouts and plunge them into iced water. Drain and reserve.", "Heat the bacon fat in a frying pan and fry the chestnuts two minutes, or until golden-brown. Remove from the pan, place onto a piece of kitchen paper and set aside. Reheat the sprouts in a little butter, season with salt and freshly ground black pepper, and then add the chestnuts.", "Divide the butternut crush among four plates. Trim the ends of the partridge blankets and place at the side of the butternut crush. Add the sprouts alongside and spoon over the sauce."]}, {"isVegetarian": true, "title": "French toast with bananas and maple syrup", "url": "www_bbc_co_uk_food_recipes_french_toast_with_52720", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/french_toast_with_52720_16x9.jpg", "ingredients": ["50ml/2fl oz whole milk", "2 free-range eggs", "2 thick slices slightly stale brioche", "2 knobs unsalted butter", "1 tbsp caster sugar", "pinch - ½ tsp ground cinnamon, to taste", "1 ripe banana, peeled and sliced", "maple syrup, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk together the milk and eggs in a wide shallow bowl.", "Dip the brioche slices into the egg and milk mixture for one minute, making sure the liquid soaks into the brioche on both sides.", "Heat a knob of butter in a large, non-stick frying pan over a medium-high heat. Once the butter is melted, fry the brioche slices for two minutes on each side until golden-brown and crisp. Remove from the pan and place onto a serving plate.", "Combine the caster sugar and cinnamon in a small bowl and set aside. ", "Add another knob of butter to the pan over a high heat. Once melted, add the sliced banana to the pan, toss in the melted butter and fry for two minutes, or until caramelised lightly on the outside.", "Serve the French toast with the caramelised banana, a sprinkle of the cinnamon sugar (any extra can be stored and used again) and a drizzle of maple syrup."]}, {"isVegetarian": true, "title": "Apple tart with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_frenchappletartwithv_87178", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 Bramley apples, peeled, cores removed, roughly chopped", "2 tbsp water", "450g/1lb ready-made puff pastry", "1 free-range egg yolk, beaten", "2 Bramley apples, peeled, cores removed, thinly sliced", "75g/3oz butter, melted", "4 tbsp caster sugar", "vanilla ice cream", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the roughly chopped apples with two tablespoons of water into a lidded pan and cover. Place over a medium heat and bring to a simmer. Cook for a 3-4 minutes until the apples have become light and softened.", "Whisk the apples to a smooth purée, then set aside to cool.", "Meanwhile, roll the pastry to a circle about 30cm/12in in diameter. Lightly score an inner circle 1cm/½in inside the edge of the pastry.", "Brush the pastry with the beaten egg. Wait one minute, then brush the pastry again with more egg.", "When the apple purée is cold, spread it over the inner circle of pastry.", "Layer the thin slices of apple over the apple purée.", "Brush the apple slices with the melted butter and sprinkle over the caster sugar.", "Transfer to the oven to bake for 25-30 minutes, until the pastry is golden-brown and the apples are caramelised.", "To serve, cut out slices and place into the centre of plates with a ball of ice cream placed alongside. Dust with icing sugar and serve."]}, {"isVegetarian": false, "title": "French chicken with new potatoes", "url": "www_bbc_co_uk_food_recipes_frenchchickenwithnew_76870", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ poussin ", "4 tbsp butter ", "½ onion, sliced", "3 tbsp fresh tarragon, chopped", "1 tbsp fresh rosemary leaves, chopped", "5 tbsp white wine ", "70ml/2½fl oz double cream", "150g/5¼oz cooked new potatoes", "3 tbsp butter, melted ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Place the poussin on baking tray and cook for 10-15 minutes, or until cooked and golden.", "To make the sauce, melt the butter in a saucepan. Add the onion and soften for 2-3 minutes.", "Add the tarragon, rosemary, white wine and cream and reduce down for 4-5 minutes.", "For the new potatoes, mix the new potatoes with the melted butter and season.", "To serve, place the poussin on a serving plate and pour over the sauce. Serve with the new potatoes."]}, {"isVegetarian": true, "title": "French dressing", "url": "www_bbc_co_uk_food_recipes_frenchdressing_1314", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 tbsp wine vinegar", "1 tsp French mustard", "pinch of caster sugar", "salt and pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients into a clean jar with a secure lid. Shake well to emulsify the dressing and serve. If the dressing separates, just give it another shake.", "Add a crushed clove of garlic or 1 tbsp fresh herbs for variety."]}, {"isVegetarian": true, "title": "French martini", "url": "www_bbc_co_uk_food_recipes_frenchmartini_91740", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frenchmartini_91740_16x9.jpg", "ingredients": ["50ml/2fl oz vodka", "15ml/½fl oz raspberry liqueur", "35ml/1½fl oz fresh pineapple juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vodka, raspberry liqueur, pineapple juice into a cocktail shaker with some ice and shake vigorously. ", "Strain the mixture into a Martini glass and serve."]}, {"isVegetarian": true, "title": "French onion soup with cheesy croûtons", "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithc_79449", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "1 large onion, finely sliced", "100ml/3½fl oz red wine", "300ml/10fl oz hot beef stock (vegetarians can substitute with vegetable stock)", "salt and freshly ground black pepper", "2 slices bread", "1 tsp olive oil", "25g/1oz cheddar cheese, grated ", "1 tsp Dijon mustard", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt the butter in a medium saucepan over a low heat.", "Add the sliced onion, cover and gently cook until softened.", "Increase the heat, add the wine and stock and simmer until reduced by a third.", "To make the croutons, preheat the grill to the highest setting.", "Drizzle the bread with the olive oil and season, to taste, with salt and freshly ground black pepper.", "In a small bowl, mix together the grated cheddar, Dijon and season, to taste, with salt and freshly ground black pepper.", "Heat a griddle pan until smoking. Add the bread and griddle for one minute on each side, or until lightly toasted.", "Place the toast on a small baking tray, spread over the cheese mix and transfer to the grill to cook for two minutes, or until the cheese mix has melted.", "Remove from the grill and cut the cheese on toast into chunky croutons.", "To serve, pour the soup into a warm bowl and top with a few cheesy croutons."]}, {"isVegetarian": false, "title": "French onion soup with cheese croute, red onion compôte and shallot rings", "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithc_87385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 tbsp olive oil", "1kg/2lb 2oz white onions, finely sliced", "3 garlic cloves, finely chopped ", "2 sprigs fresh thyme, leaves only", "50ml/2fl oz dry sherry", "75ml/3fl oz brandy", "250ml/9fl oz white wine ", "1 tsp soft brown sugar", "1 litre/1¾ pints fresh beef stock", "salt and freshly ground black pepper ", "1 tbsp balsamic vinegar", "1 small baguette, cut into slices on the diagonal", "110g/4oz gruyère cheese, grated", "1 tbsp olive oil", "1 red onion, finely sliced", "½ tsp soft brown sugar", "1 tbsp balsamic vinegar", "½ lemon, juice only", "salt and freshly ground black pepper ", "vegetable oil, for deep-frying", "2 shallots, sliced into rings", "2 tbsp plain flour, seasoned with salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the butter and olive oil in a large deep pan and add the onions, garlic and thyme. Fry for 20-25 minutes over a medium-low heat, or until softened and golden-brown.", "Add the sherry, two thirds of the brandy and the wine and carefully flambé.", "When the flames have died out, add the sugar and beef stock to the pan. Bring to the boil, then reduce the heat and simmer for ten minutes.", "Season, to taste, with salt and freshly ground black pepper and stir in the balsamic vinegar and the remaining brandy.", "Preheat the grill to high.", "For the cheese croûtes, grill the baguette slices on one side, then turn, sprinkle with gruyère and grill until golden-brown and bubbling.", "For the compote, heat the oil in a pan and add the red onion. Fry for 5-8 minutes, or until just softened but not too browned.", "Stir in the sugar, vinegar and lemon juice and season, to taste, with salt and freshly ground black pepper.", "For the shallot rings, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the shallot rings into a bowl with the seasoned flour and mix well to coat the rings.", "Carefully place the shallot rings into the hot oil and deep fry for 1-2 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To serve, ladle the soup into serving bowls and top with the cheese croûtes. Top the croûtes with a spoonful of onion compote and a few shallot rings."]}, {"isVegetarian": false, "title": "French onion soup with Gruyère toast", "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithg_7922", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frenchonionsoupwithg_7922_16x9.jpg", "ingredients": ["5 onions ", "3 garlic cloves ", "20g/¾oz butter ", "2 or 3 glasses of red wine ", "750ml/1¼ pint fresh beef stock ", "4 tbsp balsamic vinegar ", "8 thick slices of bread ", "284g/10oz Gruyère, grated ", "2 shots of brandy (optional) ", "salt and pepper ", "10g/½oz flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and thinly slice the onions and garlic. Then using the butter sauté in a large pan for 15-20 minutes, until brown. Stir well before adding the red wine, stock, vinegar and brandy. Bring to the boil and simmer for about 10 minutes.", "Toast the bread and top with the grated cheese and place under the grill until the cheese is melted. ", "Season the soup with salt and pepper.", "Keeping the soup in the pan, top with the sliced bread and a sprinkle of cheese. Place under the grill until it turns brown and the cheese has melted.", "Scatter with fresh chopped parsley and serve from the pan at the table."]}, {"isVegetarian": false, "title": "French onion soup with Gruyère croûton", "url": "www_bbc_co_uk_food_recipes_frenchonionsoupwithg_83969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, finely sliced", "1 garlic clove, finely sliced", "200ml/8fl oz chicken stock", "1 tsp soy sauce", "½ tsp Worcestershire sauce", "1 tsp caster sugar", "1 small slice chargrilled ciabatta", "25g/1oz Gruyère cheese, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to to its highest setting.", "Heat the oil in a saucepan, add the onion and garlic and cook for five minutes, on a low heat, then turn up the heat for 2-3 minutes, to brown the edges of the onion.", "Add the stock, soy sauce, Worcestershire sauce and caster sugar, allow to simmer, until thickened.", "Meanwhile, top the ciabatta slice with the cheese and place under the grill to cook for 1-2 minutes, until bubbling and golden.", "To serve, spoon the soup into a bowl and top with the crouton."]}, {"isVegetarian": true, "title": "French toast with caramelised apples and sultanas", "url": "www_bbc_co_uk_food_recipes_frenchtoastwithcaram_84155", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs yolks", "150ml/6fl oz double cream", "½ vanilla pod,split, seeds scraped out", "1 tbsp caster sugar", "½ lemon, zest only", "2 thick slices of ready-made brioche, cut into 10cm/4in rounds ", "knob of butter", "15g/½oz butter", "2 tbsp caster sugar", "1 apple, cored and sliced into 8", "pinch cinnamon", "2 tbsp sultanas"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the French toast, place the egg yolks, cream, vanilla seeds, sugar and lemon zest into a large bowl and mix thoroughly. Dip the brioche into the egg mixture.", "Heat the butter in a pan until foaming. Add the brioche and fry for 2-3 minutes on each side, or until golden brown. Set brioche aside and keep warm. ", "For the sauce, melt the butter and sugar together in a pan until golden brown. Add the apple, cinnamon and sultanas to the pan and fry for 3-5 minutes, stirring occasionally to coat the apples.", "To serve, place the french toast onto a warmed plate and drizzle with the sauce."]}, {"isVegetarian": false, "title": "French-style peas with mint, onion and prawn 'scratchings'", "url": "www_bbc_co_uk_food_recipes_frenchstylepeaswithm_89051", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz fresh peas, out of their pods", "½ onion, finely sliced", "1 tbsp white wine", "salt and freshly ground black pepper ", "30g/1oz butter, softened", "30g/1oz plain flour", "small handful chopped fresh mint", "200g/7oz self-raising flour", "1 tsp dried chilli flakes", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper", "150ml/5½fl oz cold sparkling water", "300ml/10½fl oz vegetable oil, for deep-frying", "1 raw tiger prawn, peeled, chopped", "fresh mint sprigs, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the French-style peas, place the peas, onion and white wine into a small saucepan and cover with a little boiling water. Simmer over a low heat for 5-6 minutes, or until the onion and peas are tender and the liquid has reduced by half. ", "Mix the butter and flour together until it forms a paste (this is called a roux), then stir into the pan with the cooked peas to thicken the sauce. Stir in the chopped mint.", "For the prawn 'scratchings', place the flour, chilli flakes, chives, salt and freshly ground black pepper into a large bowl and then gradually whisk in the cold sparkling water until the mixture is smooth and reaches the consistency of double cream. (You may not need all of the water). ", "Pour the vegetable oil into a saucepan and heat until a small cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the chopped prawn pieces into the batter and then carefully lower into the hot oil. Fry for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "To serve, spoon the peas onto a serving plate and top with the crisp prawn 'scratchings'. Garnish with the mint sprigs and serve."]}, {"isVegetarian": true, "title": "French toast with caramelised apricots and brandy", "url": "www_bbc_co_uk_food_recipes_frenchtoastwithcaram_84241", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz caster sugar", "1 vanilla pod, split open", "splash brandy", "110g/4oz dried apricots, finely chopped", "100ml/3½fl oz double cream", "6 ready-made brioche rolls, halved through centre", "2 free-range eggs, beaten", "1 tbsp caster sugar"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, melt the sugar with vanilla pod in a frying pan over a high heat. ", "Once the sugar turns golden, add the brandy to the pan and letsimmer for 1-2 minutes.", "Add the apricots and the cream to the pan, bring to the boil, then reduce the heat to simmer for 3-4 minutes. ", "For the French toast, beat the sugar and eggs together in a clean bowl. Then dip the brioche into the mixture, to coat well. ", "Heat a griddle pan until smoking. Add the brioche and griddle for 2-3 minutes on each side.", "To serve, stack up the brioche onto a plate and drizzle with the sauce."]}, {"isVegetarian": true, "title": "Fresh farfalle with spinach, gorgonzola and walnuts", "url": "www_bbc_co_uk_food_recipes_fresh_farfalle_with_55621", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_farfalle_with_55621_16x9.jpg", "ingredients": ["200g/7oz 00 flour, plus extra for dusting", "2 free-range eggs", "pinch of salt", "200g/7oz Tenderstem broccoli, cut into florets ", "2 tbsp olive oil", "1 garlic clove, finely chopped", "large handful spinach", "50g/1¾oz gorgonzola, or a similar vegetarian blue cheese (such as dolcelatte)", "1 tbsp chopped fresh mint", "25g/1oz walnuts, broken into pieces"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, in a food processor mix the flour, eggs and a pinch of salt together until the mixture begins to hold together. If the dough is too dry add a little bit of water.", "Dust a wooden board or clean work surface with a little flour and knead the mixture until it forms a dough. Wrap the dough in cling film and place in the fridge for 30 minutes.", "Dust the pasta with a little four, then roll it through a pasta machine until it is about 2mm thick (around setting number five on the pasta machine). Alternatively roll out the dough using a rolling pin.", "Cut the pasta dough into rectangles approximately 5x2.5cm/2x1in. Pinch the rectangles in the middle to form a bow shape. (This can be done up to 24 hours before cooking the dish.)", "Blanch the broccoli in a pan of boiling water and then refresh in a bowl of cold water and drain.", "Heat a tablespoon of oil in a pan and add the garlic. After a minute add the spinach and broccoli. Tear the cheese into bite-size pieces and add to the spinach.", "Meanwhile, dry fry the walnuts in a separate pan. ", "Cook the pasta in a pan of boiling water for two minutes. Drain thoroughly.", "Add the drained pasta to the spinach, stir through the mint and top with the walnuts. "]}, {"isVegetarian": true, "title": "Fresh fruit flapjacks", "url": "www_bbc_co_uk_food_recipes_fresh_fruit_flapjacks_38970", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35g/1½oz rolled oats", "35g/1½oz wholemeal flour", "25g/1oz caster sugar", "25g/1oz butter, plus extra for greasing", "80g/3¼oz blueberries or other berries or soft fruit, mashed"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a loaf tin with a little butter.", "In a bowl, rub together the oats, flour, sugar and butter using your fingertips, until the mixture is crumbly.", "Scoop half of the mixture into the prepared loaf tin and flatten into an even layer using a palette knife. Spread the mashed blueberries on top.", "Spoon the remaining crumbly mixture on top of the blueberries, then press down firmly to flatten into an even layer.", "Transfer the flapjack to the oven and bake for 18-20 minutes, or until golden-brown. Set aside to cool completely, then cut into slices and remove from the tin."]}, {"isVegetarian": true, "title": "Raw cranberry sauce", "url": "www_bbc_co_uk_food_recipes_fresh_cranberry_sauce_88244", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_cranberry_sauce_88244_16x9.jpg", "ingredients": ["225g/8oz fresh cranberries", "150g/5½oz caster sugar", "1 small, thin-skinned orange, cut into quarters, pips removed", "½ tsp mixed spice", "pinch freshly grated nutmeg"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the cranberry sauce ingredients in a food processor until smooth. ", "Either serve cold or gently heat through. Serve with roast turkey or leftover cold cuts. "]}, {"isVegetarian": true, "title": "French toast with honey, cream and mint", "url": "www_bbc_co_uk_food_recipes_frenchtoastwithhoney_89138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 thick slice crusty white bread", "1 free-range egg, beaten", "25g/1oz butter", "2 tbsp icing sugar", "1 orange, peeled and sliced", "honey, for drizzling", "fresh mint leaves, to garnish", "double cream, lightly whipped, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dip the bread into the beaten egg, coating well all over. Melt the butter in a frying pan, add the eggy bread and fry for 1-2 minutes on both sides, or until lightly golden all over. ", "Sprinkle half the icing sugar over one side and flip over to fry for 1-2 more minutes, or until golden-brown. Sprinkle over the rest of the icing sugar and flip the toast over again and fry for 1-2 minutes, or until the toast is golden-brown all over. ", "Pile the French toast onto a serving plate, top with the orange slices, drizzle over the honey and garnish with the mint leaves. Serve with a large dollop of double cream on the side."]}, {"isVegetarian": true, "title": "Fresh fruit salad", "url": "www_bbc_co_uk_food_recipes_fresh_fruit_salad_61942", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_fruit_salad_61942_16x9.jpg", "ingredients": ["1 pink grapefruit", "1 orange", "1 pomegranate", "1 banana", "small bunch white grapes", "small bunch black grapes", "1 kiwi", "1 pear", "1 apple", "sprig mint, to decorate (optional)", "citrus juice (from above)", "1 lime", "100g/3½oz sugar ", "1 lemongrass stalk, sliced in half", "1 thumb-sized piece ginger, roughly sliced"], "serves": "Serves 4--6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fruit salad, segment the grapefruit and orange, catching the juices in a bowl. Squeeze more juice out of the remaining citrus fruit into the bowl. Set aside the orange and grapefruit segments.", "For the syrup, measure the juice and add water to make 100ml/3½fl oz. ", "Peel a large strip of lime zest from the lime, avoiding any of the white pith. Reserve the remaining lime.", "Combine the citrus juice/water mixture and the sugar in a small saucepan. Heat until the sugar has dissolved, stirring once or twice. Add the lemongrass, lime zest and ginger and then bring to a boil. Immediately reduce the heat to a simmer.", "Simmer over a low heat for 10 minutes. Turn off the heat and leave the syrup to cool.", "For the fruit salad, remove the seeds from the pomegranate and slice the banana. ", "Peel another slice of zest from the lime using a vegetable peeler, avoiding any of the white pith. Slice it very finely and reserve this for decoration. Set aside the remaining lime as you will need the juice.", "Cut the grapes in half and slice the kiwi. ", "Finally chop the pear and apple, pouring a little lime juice over the apple to retain its colour.", "Combine all the fruit in a large bowl or in individual serving dishes or Martini glasses. Pour over the syrup, to taste. You may not need to use all the syrup – any remaining syrup can be used in cocktails or added as a sweetener to herbal tea. Decorate with strips of lime and a sprig of mint."]}, {"isVegetarian": true, "title": "Fresh jam doughnuts", "url": "www_bbc_co_uk_food_recipes_fresh_jam_doughnuts_72122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour, sifted", "40g/1½oz caster sugar", "1 x 7g sachet fast-action yeast", "1 tsp salt", "1 free-range egg, lightly beaten", "150ml/5fl oz milk, warmed to about 38C", "50g/1¾oz unsalted butter, melted and cooled slightly", "vegetable oil, for deep-frying", "50g/1¾oz vanilla sugar or caster sugar", "350g/12oz jam, flavour of your choice"], "serves": "Makes 12 doughnuts", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour in a bowl, with the sugar and yeast on one side and the salt on the other. Mix to combine.", "Put the egg, warm milk and butter in a jug and mix well. Make a well in the centre of the dry ingredients and pour in the liquid. Mix with a spoon, then bring it together with your hands into a soft dough. ", "Lightly grease a clean work surface with vegetable oil and knead the dough for 10 minutes. The dough is ready when it is smooth, shiny and elastic.", "Grease the inside of a large bowl with a little oil, put the dough in, and cover with cling film. Leave in a warm place to double in size. This can take about an hour, sometimes more, sometimes less – it really does depend on the warmth of the room.", "Once doubled in size, knead the dough for a minute to knock the air out. Divide into 12 equal pieces and shape into balls. Place on a greased baking tray and cover with a piece of oiled cling film. Leave for 30 minutes to 1 hour until the dough doubles in size and springs back when you press with your finger.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 190C – a cube of bread should turn brown in one minute when dropped in. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Fry the doughnuts in batches, cooking for 3 minutes on each side, moving them around in the oil. Drain briefly on kitchen paper, then toss them in the vanilla sugar. Use a knife to make a small cut through the side and wiggle it around to make a hole in the centre. Carefully pipe in the jam, being careful not to overfill. Delicious. "]}, {"isVegetarian": true, "title": "Fresh herb fougasse", "url": "www_bbc_co_uk_food_recipes_fresh_herb_fougasse_70351", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_herb_fougasse_70351_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white bread flour, plus extra for dusting ", "10g/¼ fine salt ", "7g sachet instant yeast ", "2 tbsp olive oil, plus extra for greasing and drizzling ", "350ml/12fl oz warm water ", "2 tsp chopped fresh rosemary, plus extra to finish ", "2 tsp chopped fresh thyme ", "2 tsp chopped fresh sage ", "fine semolina, for dusting ", "½ tsp dried oregano ", "sea salt flakes, crushed, to finish "], "serves": "Makes 2 large loaves", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Grease a large plastic container with a little olive oil. Line two large baking sheets with baking parchment or silicone paper. ", "Put the flour, salt and yeast into the bowl of a freestanding electric mixer fitted with a dough hook. (Don’t put the salt directly on top of the yeast). Add the olive oil and three-quarters of the water. Begin mixing on a low speed. As the dough starts to come together, add the remaining water very slowly, then mix for another 8 minutes on a medium speed. Add the rosemary, sage and thyme and mix for a minute until the herbs are evenly distributed in the dough. When ready, the dough will be very elastic and you should be able to stretch it away from the bowl. ", "Tip the dough into the oiled container. Cover and leave to rise until at least doubled in size – about an hour. The dough should be bouncy and shiny. ", "Mix equal quantities of white flour and semolina together and use to heavily dust the work surface. Carefully tip out the dough. It will be quite loose and flowing, but don’t worry. Divide the dough in half. ", "Lift each piece of dough onto the prepared baking sheets and spread out into flat ovals. Using a pizza cutter make two cuts in a line down the middle of the ovals with a gap between them, stopping 2cm/1in from each end. Then make 12 diagonal cuts in the dough, 6 either side of the central cuts, forming a leaf design, then stretch the dough out slightly to emphasise the holes. ", "Place the baking sheets inside large plastic bags and leave to prove in a warm place for 20 minutes. Preheat the oven to 220C/200C Fan/Gas 7. ", "Spray a little olive oil over the top of the loaves using a water spray bottle, or just drizzle over the oil. Sprinkle over the oregano and bake for 15–20 minutes, or until the fougasse sounds hollow when tapped on the base. Remove from the oven and while still hot, brush with more olive oil and sprinkle with the sea salt."]}, {"isVegetarian": true, "title": "Fresh kaffir lime and coconut posset and cardamom butter biscuits", "url": "www_bbc_co_uk_food_recipes_fresh_kaffir_lime_and_02405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz double cream", "2 limes (preferably kaffir), zest and juice ", "140g/5oz caster sugar", "4 kaffir lime leaves, shredded", "2 lemons, juice only", "2 tbsp ground desiccated coconut", "200g/7oz self-raising flour, plus extra for dusting", "100g/3½oz unsalted butter, cut into cubes", "75g/2½oz caster sugar", "1½ tsp freshly ground cardamom", "¼ tsp ground ginger", "1 tsp lemon or orange zest (optional)", "pinch of salt", "1 free-range egg yolk", "caster sugar or icing sugar, to dust", "½ small honey mango, peeled and finely diced ", "sugar syrup (4 tbsp water and 2 tbsp sugar boiled together)", "2 tbsp lemon juice", "1 kaffir lime leaf, finely shredded"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the posset, bring the cream to the boil with the lime zest, sugar and lime leaves. ", "Add lemon and lime juice, bring back to boil and stir in the ground desiccated coconut. Strain through a fine sieve and pour into glasses to serve. ", "Chill in the fridge for 2-3 hours before serving.", "For the biscuits, rub the flour and butter together in a large bowl until the mixture resembles breadcrumbs. Stir in the caster sugar, ground cardamom, ginger, lemon or orange zest, salt and egg yolk and work together using your hands until it becomes a soft, smooth dough. (Add a splash of water if necessary to combine.) ", "Wrap the biscuit dough in cling film and transfer to the fridge to chill for an hour. ", "Preheat the oven to 180C/350F/Gas 4.", "Roll the dough out on a floured surface until it is approximately 5mm/¼in thick. ", "Using a 6cm/2½in round cutter, cut into rounds and place on baking trays lined with greaseproof paper. ", "Bake in the preheated oven for 10-12 minutes, or until lightly golden-brown. ", "Transfer to a wire rack to cool. Sprinkle with caster sugar or dust with icing sugar to serve. ", "For the mango salsa, carefully mix together all the salsa ingredients and refrigerate until ready to serve. ", "To serve, set each posset glass on a side plate with a couple of biscuits and carefully spoon some mango salsa on top of the posset."]}, {"isVegetarian": false, "title": "Fresh linguine with crab and mussels", "url": "www_bbc_co_uk_food_recipes_fresh_linguine_with_crab_93316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz 00 Italian pasta flour", "1 tsp sea salt", "4 medium free-range yolks", "25g/1oz semolina flour", "2 vine-ripened tomatoes, peeled, halved, seeds removed", "2 red peppers, cut in half lengthways, seeds removed", "1 garlic clove, finely chopped", "2 tbsp olive oil", "½ bunch fresh basil", "500g/1lb 2oz white potatoes, peeled and cut into four", "100g/3½oz unsalted butter", "50ml/2fl oz whole milk", "100g/3½oz fontina cheese, grated", "2 globe artichokes, peeled and trimmed ", "200g/7oz mussels", "2 tbsp olive oil", "1 red onion, finely diced", "3 garlic cloves, finely chopped ", "1 red chilli, seeds removed ", "75ml/2½fl oz white wine", "4 vine-ripened tomatoes, peeled, seeds removed, finely chopped", "½ onion, finely chopped", "75ml/2½fl oz white wine", "200g/7oz cooked white crabmeat", "2 tbsp fresh flat-leaf parsley, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pasta, place the flour and salt in a large food processor and mix. Add the egg yolks and mix again until you have a mixture that resembles breadcrumbs.", "Remove the mixture from the processor and gently knead until it comes together as a smooth dough. Wrap in cling film and rest in the fridge for at least an hour.", "For the Piedmont peppers, put half a tomato inside each halved pepper and sprinkle over the garlic, oil and basil and place in the oven for 20-30 minutes.", "For the fontina mash, place the potatoes in a large saucepan of boiling water and cook for 15-20 minutes. Once soft, drain and place back in the pan. Add the butter, milk and cheese and mash until smooth. Set aside.", "For the mussels, place the artichokes in a saucepan and add cold water just to cover the artichokes. Bring to a simmer and cook for 15-20 minutes. Drain and roughly chop the artichokes then set aside.", "To prepare the mussels, wash the shells in cold water and pull off any stringy beards. Discard any mussels with broken shells, or any open ones that do not close when given a sharp tap.", "For the pasta, roll the pasta though a pasta machine, put through the linguine setting and sprinkle with the semolina flour.", "For the mussels, place a large frying pan on the heat and add the oil. Once hot, add the red onion and cook for three minutes. Add two-thirds of the garlic, all the chilli and the artichokes and cook for five minutes. Add the wine and cook until the volume of liquid has reduced by half. Add the tomatoes and reduce the heat to a gentle simmer.", "Heat a large saucepan and add the onion, remaining garlic and the white wine. Cook for 3-4 minutes and then add the mussels. Place a lid on and cook until the mussels have opened. Discard any mussels that have not opened. Remove all but eight mussels from their shells.", "Heat a large saucepan of boiling salted water and add the pasta and cook for 2-3 minutes and drain. Toss the onion mix through the pasta and add parsley.", "To serve, pile the pasta at one end of the plate and dress the mussels and crab around the edge with the mash and peppers at the other end of the plate. Serve with a twist of black pepper."]}, {"isVegetarian": true, "title": "Fresh mint sauce", "url": "www_bbc_co_uk_food_recipes_fresh_mint_sauce_42585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small bunch fresh mint", "2 tbsp clear honey or golden syrup", "2 tbsp white wine vinegar or cider vinegar"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pick the leaves off the mint stalks and chop them as finely as possible, then mix with the honey or syrup and the vinegar."]}, {"isVegetarian": true, "title": "Fresh pasta with griddled asparagus and a lemon and breadcrumb topping", "url": "www_bbc_co_uk_food_recipes_fresh_pasta_with_19294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 4oz fine semolina flour, plus extra for dusting", "5 free-range eggs", "1 bunch asparagus, trimmed ", "2 tbsp olive oil", "50g/1¾oz butter", "1 lemon, juice only", "2 tbsp olive oil", "100g/3½oz homemade breadcrumbs", "1 lemon, zest only", "1 garlic clove, finely chopped", "1 tsp fresh thyme leaves", "2 tbsp finely chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour and eggs into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough in a bowl, cover with cling film and place in the fridge to rest for 30 minutes.", "Flour the pasta machine. Cut the pasta dough in half and pass it through the pasta machine at its widest setting. Repeat this process, decreasing the roller setting down grade by grade with each pass until the dough is thin enough to pass through your cutter. ", "Add your cutter to the pasta machine and pass the pasta through the machine to make your chosen shape. Dust the pasta with a little semolina.", "Repeat the process with the remaining dough, then place the shapes onto a plate and use immediately or refrigerate overnight.", "To cook the pasta, in a large pan of salted boiling water cook the pasta until al dente. Drain, reserving a little of the cooking water, and keep warm.", "For the griddled asparagus, preheat a griddle pan and drizzle olive oil over the asparagus. Season with salt and pepper to taste. Add the asparagus and, once marked with bars from the griddle pan, add the butter, a little of the pasta water and lemon juice. Season with salt and pepper to taste.", "For the lemon and breadcrumb topping, heat a large frying pan and add the olive oil. Once hot, add the breadcrumbs, lemon, garlic and thyme and cook until the crumbs are golden-brown. Just before serving, stir through the chopped parsley.", "To serve, remove the asparagus from the pan, cut into pieces and add back into the pan. Add to the pasta and toss until all the pasta is coated. Add a couple of tablespoons of the breadcrumb mixture and toss together.", "Serve in warm bowls topped with the remaining breadcrumb mixture."]}, {"isVegetarian": false, "title": "Fresh pasta with a classic ragú sauce", "url": "www_bbc_co_uk_food_recipes_fresh_pasta_with_a_98889", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz 00 flour", "4 medium free-range eggs ", "250g/9oz fine semolina flour ", "2 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 large carrot, peeled and finely chopped", "2 sticks celery", "handful basil leaves", "500g/1lb 2oz beef mince", "500g/1lb 2oz pork mince", "2 tbsp tomato purée", "100ml/3½oz red wine", "3 x 400g/14oz tins san marzano tomatoes", "2 little gem lettuces, washed and leaves separated", "1 head frisée lettuce, central leaves washed and removed", "3 tbsp extra virgin olive oil", "1 lemon, juice only  ", "salt and freshly ground black pepper", "75g/2½oz parmesan cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the fresh pasta, place the flour and eggs into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough in a bowl, cover with cling film and place in the fridge to rest for 30 minutes.", "Cut the pasta dough in half and pass it through a pasta machine at its widest setting. Repeat this process, decreasing the roller setting down grade by grade with each pass until the dough is thin enough to pass through your cutter. ", "Add your cutter to the pasta machine and pass the pasta through the machine to make your shape. Dust the pasta with a little semolina.", "Repeat the process with the remaining dough, then place the shapes onto a plate and chill in the fridge until ready to use.", "For the classic ragú sauce, heat a large casserole dish and add the oil. Once hot, add the onion and garlic and gently fry for 2-3 minutes. ", "Add the carrot, celery and basil and cook for a further two minutes.", "Add the meat and cook until brown.", "Add the tomato purée cook for a minute, then add the wine. Cook until the liquid is reduced by half, then add the tomatoes and cook for a couple of hours with the lid on.", "For the green salad, place the lettuce leaves in a large bowl. Whisk together the oil, lemon juice, salt and pepper. Pour over the salad leaves and toss to coat.", "For the pasta, in a large pan of salted boiling water cook the pasta until al dente.", "To serve, add the sauce to the cooked pasta and toss until all the pasta is coated. ", "Serve in a warm bowls topped with the parmesan cheese. Place the salad in a separate bowl and serve alongside."]}, {"isVegetarian": false, "title": "Fresh pea, broad bean and ham hock salad", "url": "www_bbc_co_uk_food_recipes_fresh_pea_broad_bean_and_99078", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_pea_broad_bean_and_99078_16x9.jpg", "ingredients": ["750g/1lb 10oz broad beans, podded", "750g/1lb 10oz fresh peas, podded", "200g/7oz mangetout, trimmed", "3 tbsp extra virgin olive oil", "1 tbsp cider vinegar", "1 mild red chilli, seeds removed and finely chopped", "2 spring onions, trimmed and finely sliced", "1 small bunch flat leaf parsley, roughly chopped", "1 tbsp chopped fresh mint", "180g/6oz pack pulled ham hock", "70g/2½oz pea shoots (optional)", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of water to the boil, add the broad beans and cook for two minutes. Remove the beans with a slotted spoon and place in a bowl of iced water to refresh.", "Re-boil the water, add the peas and mangetout, cook for one minute then drain well and refresh in another bowl of iced water.", "Drain all the vegetables, pat dry with kitchen paper then place them in a large bowl and stir in the olive oil and vinegar.", "Just before serving, stir the chilli, spring onions, parsley, mint and ham hock into the peas and beans and add the pea shoots, if using. Season to taste with sea salt and freshly ground black pepper and serve immediately."]}, {"isVegetarian": true, "title": "Raspberry tartlets", "url": "www_bbc_co_uk_food_recipes_fresh_raspberry_tartlets_06318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_raspberry_tartlets_06318_16x9.jpg", "ingredients": ["175g/6oz plain flour, plus extra for dusting", "2 tbsp icing sugar", "100g/3½oz butter, chilled, cut into small pieces", "1 free-range egg, beaten", "150ml/5fl oz whole milk", "1 tsp vanilla extract", "25g/1oz caster sugar", "25g/1oz plain flour", "1 free-range egg", "75ml/2½fl oz double cream", "4 tbsp raspberry jam", "450g/1lb raspberries"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the pastry, put the flour, icing sugar and butter in a food processor and pulse until the mixture resembles breadcrumbs. Add the egg and blend again until it is just combined and forms a ball.   ", "Dust a work surface with flour and tip the dough onto it. Roll the pastry out with a rolling pin. Cut it into eight rounds a little bigger than the tins (as you will need to line the sides also). Line each tin with a disc of pastry and chill in the fridge for 20 minutes.", "To bake blind, prick the pastry bases, line the tins with baking parchment, fill with baking beans and bake in the oven for 10 minutes. Carefully remove the beans and paper and return the bases to the oven for 5 minutes, until cooked and a pale golden-brown. Set aside to cool.", "Meanwhile, to make the crème pâtissière, put the milk and vanilla in a saucepan. Heat until it is just scalding (you'll just be able to dip your finger in). ", "Put the sugar, flour and egg in a mixing bowl and whisk. Pour in half the hot milk and whisk until smooth. Pour in the remaining hot milk.  ", "Pour the mixture back into the saucepan and cook over a low heat, stirring all the time, until very thick – this could take about 2–3 minutes. ", "Pour into a bowl, cover with cling film and chill in the fridge until cold. Once cold, pour in the double cream, while whisking constantly. Spoon the crème pâtissière into the tart cases and chill in the fridge.", "To make the glaze, heat the jam in a saucepan with a tablespoon of water and whisk to combine. Strain the liquid through a sieve into a small bowl.  ", "Arrange the raspberries standing upright on the crème pâtissière and brush the warm glaze over the top."]}, {"isVegetarian": true, "title": "Fresh pea, courgette and parmesan rosti with tangy tomato dressing", "url": "www_bbc_co_uk_food_recipes_fresh_pea_courgette_and_97855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz shelled fresh peas ", "350g/12oz courgettes, grated", "150g/5½oz ground rice", "3 tbsp shredded basil leaves, plus extra to serve", "70g/2½oz parmesan (or a vegetarian alternative), grated", "50g/1¾oz pine nuts, lightly toasted", "2 free-range eggs, lightly beaten", "sea salt and freshly ground black pepper", "2 tbsp olive oil", "6 tbsp olive oil", "1 ripe plum tomato, seeds removed and finely diced", "4 sun-dried tomatoes in oil, drained and finely chopped", "1 small shallot, finely chopped", "1 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the rosti, blanch the peas in a pan of boiling salted water for two minutes or until just tender then drain well. Refresh in a bowl of iced water and drain again. ", "Squeeze the courgettes in a clean tea towel and place in a large bowl. Mix in the blanched peas, ground rice, basil, parmesan and pine nuts then add the beaten eggs and season with sea salt and freshly ground black pepper. Divide the mixture into 16 evenly sized balls and slightly flatten each one.", "Heat one tablespoon of the olive oil in a large non-stick frying pan over a medium heat and fry half the rosti for 2-3 minutes on each side or until crisp and golden-brown. Drain on kitchen paper and keep warm. Repeat with the remaining oil and rostis.", "To make the dressing, place the ingredients in a bowl, mix until well combined and season with sea salt and freshly ground black pepper.", "Place a stack of rosti on each plate, drizzle a little dressing over and around the rosti and garnish with a sprinkling of shredded basil leaves."]}, {"isVegetarian": false, "title": "Fresh sardines on toast with sweet pickled red onion", "url": "www_bbc_co_uk_food_recipes_fresh_sardines_on_toast_31826", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fresh_sardines_on_toast_31826_16x9.jpg", "ingredients": ["4 whole sardines, cleaned, heads removed", "1 tbsp plain flour", "flaked sea salt", "freshly ground black pepper", "3 tbsp olive oil", "1 red onion, sliced", "1 tbsp caster sugar", "2 tbsp red wine vinegar", "1 tbsp small capers, drained", "1 heaped tbsp chopped fresh parsley ", "4 slices sourdough bread", "50g/1¾oz butter, softened", "2 tsp wholegrain mustard", "1 ripe tomato, finely sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a sharp knife, cut the sardines from the opening in the underside (where it has been cleaned) to the beginning of the tail, so the fish can be butterflied open. Trim off the tail and fins with scissors.", "Open the fish flat onto a board, skin side up. Carefully push the backbone of the sardine down onto the board with your fingertips all the way along the length of the fish until it flattens out. This will loosen the spine from the fish but if you press too hard, you will turn the sardine flesh to mush.", "Flip the fish onto its back and gently ease your finger underneath the spine, lifting it away from the flesh, taking out the little bones as you go. Use the point of a sharp knife to tease any bones away from the flesh if necessary. Run your hands up and down the flesh to check for any little bones. Set aside while you repeat the process with the other fish.", "Place the flour onto a plate and season with a pinch of salt and plenty of freshly ground black pepper. Coat each sardine in the seasoned flour, shaking off any excess flour as you go. Set aside until the pickled onion is almost ready", "For the sweet pickled onion, heat one tablespoon of the oil in a medium non-stick saucepan. Add the sliced onion and cook over a medium heat for 4-5 minutes, stirring regularly until softened but not coloured.  Stir in the sugar, vinegar, capers and cook for a few seconds more, stirring constantly. Remove from the heat and stir in the parsley.", "Heat the remaining oil in a large non-stick frying pan set over a medium high heat. Fry the sardines for a minute on each side. ", "To serve, toast the sourdough bread. Mix the softened butter with the mustard and slather over the hot toast. Top each piece of toast with a few slices of tomato, a sardine and the warm onion pickle. "]}, {"isVegetarian": true, "title": "Fresh asparagus and beef tomato salad with herb oil dressing", "url": "www_bbc_co_uk_food_recipes_freshasparagusandbee_89433", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch asparagus, trimmed", "large bunch fresh chervil", "75ml/2½fl oz olive oil", "salt and freshly ground black pepper ", "½ beef tomato, sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of salted water to the boil, add the asparagus and cook for 3-4 minutes, or until just tender, then drain.", "Blend the chervil, olive oil, salt and freshly ground black pepper in a food processor until smooth.", "To serve, place the beef tomato slices onto a serving plate and place the boiled asparagus on top of them. Pour the dressing over the top."]}, {"isVegetarian": true, "title": "Fresh asparagus, tomato and pine nut salad", "url": "www_bbc_co_uk_food_recipes_freshasparagustomato_85865", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "5 cherry tomatoes, quartered", "½ red chilli, seeds removed, finely chopped", "1½ tbsp pine nuts", "salt and freshly ground black pepper ", "1 bunch asparagus, blanched, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan and sauté the tomatoes and chilli for 2-3 minutes.", "Add the pine nuts and season, to taste, with salt and freshly ground black pepper.", "To serve, place the asparagus onto a plate and pour over the tomato sauce."]}, {"isVegetarian": false, "title": "Fresh crumpets with fried duck egg, mushrooms and pancetta", "url": "www_bbc_co_uk_food_recipes_freshcrumpetswithfri_85599", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7g/¼oz fresh yeast", "275ml/10fl oz warm water", "225g/8oz plain flour, sifted", "7g/¼oz salt", "light olive oil, for greasing", "20ml/¾fl oz red wine vinegar", "125ml/4½fl oz extra virgin olive oil", "60g/2½oz unsalted butter", "150g/5oz piece pancetta, sliced into lardons", "20 button mushrooms, cut into quarters", "sea salt", "1 tbsp chopped fresh flatleaf parsley", "freshly ground black pepper", "olive oil, for frying", "4 duck eggs"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the crumpets, place the yeast into a bowl and whisk in the warm water.", "Place the sifted flour in a separate bowl with the salt. Add the yeast mixture to the flour and whisk together until smooth.", "Cover the bowl tightly with cling film and leave to prove in a warm place for one hour or until at least doubled in volume.", "Preheat the oven to 170C/340F/Gas 3.", "Heat a thin layer of light olive oil in a non-stick pan over a low to medium heat.", "Lightly oil the inside of four 9cm/3.5in diameter by 2cm/0.75in high metal chefs' rings. Sit them inside the non-stick pan. ", "Pour or ladle enough of the proved batter into each of the four chefs' rings to come halfway up the sides. ", "Cook the crumpets in the chefs' rings in the pan until the top has completely set, then remove the chefs' rings and turn over. Cook for one minute until golden.", "Transfer to a baking tray, place in the centre of the oven and cook for a further five minutes.", "Remove from the baking tray and leave to cool on a wire rack until ready to serve.", "To prepare the finished dish, preheat the grill to medium.", "Place the vinegar and olive oil into a bowl and whisk together. Season, to taste, with salt and freshly ground black pepper. Set aside.", "Heat a frying pan until hot and add 25g/1oz of the butter and the pancetta and fry for about three minutes until crisp.", "Add the mushrooms, season with salt and fry for 3-4 minutes or until the mushrooms are golden brown. Add the chopped parsley and a grind of black pepper.", "Meanwhile, heat a second frying pan until hot and add a little light olive oil until just warm.", "Crack the duck eggs into the pan, making sure that the yolk is in the centre, and cook gently until the whites are fully cooked.", "Place the pan under the grill for one minute to warm the yolks.", "Meanwhile, toast the crumpets until crisp and golden brown. ", "Using an 8cm/3in plain-edged pastry cutter, cut the duck eggs into neat rounds. Season them with a little black pepper and sea salt. ", "Butter each of the toasted crumpets with the remaining butter and place them onto serving plates. Place a duck egg on top of each crumpet.", "Spoon the mushrooms and pancetta on top of the eggs and drizzle with some of the dressing. Serve."]}, {"isVegetarian": true, "title": "Freshly-salted cucumbers", "url": "www_bbc_co_uk_food_recipes_freshly-salted_cucumbers_84336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 garlic cloves", "2 tbsp horseradish", "2 horseradish leaves", "10 small pickling cucumbers, washed", "2 tbsp salt"], "serves": "Makes 1 jar of salted cucumbers", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Put the garlic, horseradish and horseradish leaves in the bottom of a large sterilised jar and add the cucumbers. ", "Add the salt to 2 litres/3½ pints water and mix thoroughly. Pour the salted water over the cucumbers, screw on the lid and leave to rest for 24 hours. ", "The cucumbers will keep in the fridge for one month. "]}, {"isVegetarian": true, "title": "Fresh lime curd", "url": "www_bbc_co_uk_food_recipes_freshlimecurd_4555", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["112g/3¾oz plus 1 tsp golden caster sugar", "25g/1oz plus 1 tsp cold unsalted butter, cut into pieces", "2 large eggs, lightly beaten", "juice of 2 limes", "freshly grated lime zest of 1 lime"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a heavy saucepan cook the sugar, butter, eggs and lime juice over a moderately low heat. Whisk frequently, until it is thick enough to hold marks of whisk, about 12-15 minutes. ", "Immediately pour the curd through a sieve into a bowl. Stir in the zest of one lime and cool. Lime curd can be made up to a week in advance, its surface covered with cling film."]}, {"isVegetarian": true, "title": "Fresh mango and lime syllabub", "url": "www_bbc_co_uk_food_recipes_freshmangoandlimesyl_86042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["90ml/3 fl oz double cream", "1 lime, zest and juice", "1 tbsp honey", "½ fresh mango, peeled and chopped", "1 tsp honey", "½ lime, juice only", "¼ fresh mango, peeled and sliced", "sprig mint"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the syllabub, whip the cream until slightly thickened and stir through the honey, lime juice and zest. Leave to sit for 2-3 minutes.", "For the purée, blend the mango, honey and lime juice in a blender or food processor until smooth.", "Spoon a third of the mango purée into the base of a tall wine glass.  Add a third of the whipped cream mixture. Continue to layer up to the top of the glass.", "Arrange the sliced mango around the top and garnish with mint.  Chill until ready to serve."]}, {"isVegetarian": false, "title": "Fresh mackerel with roasted rhubarb", "url": "www_bbc_co_uk_food_recipes_freshmackerelwithroa_92281", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshmackerelwithroa_92281_16x9.jpg", "ingredients": ["4-5 stalks rhubarb ", "good shake of light brown sugar", "2 fresh mackerel, filleted", "a little plain flour, seasoned with salt and freshly ground black pepper, for dusting ", "a couple of good glugs of fruity olive oil", "a few sprigs of rosemary, chopped", "1 tbsp capers, drained ", "splash sherry vinegar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted rhubarb, preheat the oven to 200C/400F/Gas 6. Cut the rhubarb into 15cm/6in or so lengths (about the length of a wooden spoon-handle) and place in a roasting tin with half a tea-cup of water and the light brown sugar. Roast until just soft enough to take the point of a knife, about 10-15 minutes. Allow to cool, then drain, reserving the cooking juices. ", "Dip the skin side of each mackerel fillet into the seasoned flour to lightly coat. Heat the oil in a large frying pan. Gently place the mackerel fillets in the hot pan, skin-side down, and scatter over the rosemary. Add the roasted rhubarb to the side of the pan to heat through and add the capers for a little vinegary flavour. ", "Turn the mackerel after just two or so minutes when you can see that the mackerel is cooked  halfway up the fillet. Cook for a further minute or two, then add the sherry vinegar for  richness and allow to just come to the boil in the pan before removing the mackerel and the  rhubarb. To the pan juices, add a little of the juices from the reserved roasted rhubarb  to just lift the crispy bits from the pan where all the flavour is. Serve straightaway, with the sauce over the mackerel with the rhubarb on the side."]}, {"isVegetarian": true, "title": "Freshly baked bread", "url": "www_bbc_co_uk_food_recipes_freshlybakedbread_92265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3¼oz type 'T55' strong white bread flour, plus extra for dusting", "550ml/1 pint water, at room temperature", "20g/¾oz fresh yeast", "15g/½oz salt", "vegetable oil, for greasing", "small dish of salted water", "butter and cheese, to serve (optional)"], "serves": "Makes 3 loaves", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Slowly mix the flour, water, yeast and salt in the bowl of a food processor using the dough hook attachment for 4-5 minutes, or until the mixture comes together as a soft, elastic dough. ", "Alternatively, mix the flour, water, yeast and salt together in a large mixing bowl, using your hands, until it comes together as a dough. Turn out the dough onto a lightly floured work surface and knead firmly for 8-10 minutes, pushing the dough away from you using the heel of your palm, then lifting the folding the stretched dough back over itself, until the dough is smooth and elastic. ", "Cover the dough, in its bowl, with a damp tea towel or a sheet of cling film. Set aside in a warm place for one hour, or until the dough has doubled in size (proved). ", "When the dough has proved, turn it out onto a lightly floured work surface and knock it back. Divide the dough into three equal pieces and flatten them into leaf-shaped loaves. ", "Grease a baking tray lightly with oil, then sprinkle it all over with flour. Place the loaves onto the baking tray, at least 20cm/8in apart.", "Brush the loaves all over with the salted water, then dust with more flour. Score the tops of the loaves several times using a sharp knife, then set aside for a further 15 minutes, or until they have proved again. ", "Meanwhile, preheat the oven to 240C/460F/Gas 9. ", "When the loaves have proved, bake them in the oven for eight minutes. ", "Open the oven door and continue to bake for a further two minutes. ", "Reduce the oven temperature to 190C/370F/Gas 5, then close the door and continue to bake for 30 minutes, or until the loaves are risen and pale golden-brown and make a hollow sound when tapped on the bottom.", "Remove the bread from the oven and set aside on a wire rack to cool. Serve warm with butter and cheese."]}, {"isVegetarian": false, "title": "Fresh pappardelle pasta with chicken, basil and parmesan sauce", "url": "www_bbc_co_uk_food_recipes_freshpapperdellepast_87340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/2oz plain flour, plus extra for dusting", "2 large free-range eggs", "2 tbsp olive oil", "½ chicken breast, skin removed, sliced into strips", "½ red onion, sliced into thin wedges", "1 garlic clove, peeled and crushed", "100ml/3½fl oz white wine", "200ml/7fl oz double cream", "salt and freshly ground black pepper", "small bunch fresh basil, chopped", "55g/2oz parmesan cheese, grated"], "serves": "Serves 2-3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour into a food processor, crack in the eggs and blend together until dough is formed. Tip onto floured work surface and knead for a few minutes. Cover with cling film and leave to rest in the fridge for one hour. ", "Remove the dough from the fridge. Slice in half. Roll out one piece very thinly on a floured work surface and then slice long thin strips. Repeat with the other half of pasta dough.", "For the sauce, heat the oil in a saucepan. Add the chicken and onion and sauté for 3-4 minutes until the chicken is just cooked through. Add the garlic, wine and cream. Lower the heat and cook until the sauce has thickened. Season with salt and freshly ground black pepper, then stir in the chopped basil and parmesan cheese. ", "Cook the pasta in boiling salted water for 2-3 minutes, drain and add to the sauce. Coat well and then spoon onto a serving plate or pasta bowl. Serve immediately."]}, {"isVegetarian": true, "title": "Fresh mango sorbet", "url": "www_bbc_co_uk_food_recipes_freshmangosorbet_86116", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 fresh mangos, peeled, stones removed", "250g/8¾oz icing sugar, sifted", "2 lemons, juice only"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Roughly chop the mango flesh and place into a food processor with the icing sugar and lemon juice. Blend to a purée.", "Transfer the mixture into an ice cream machine and churn to freeze, according to manufacturer's instructions.", "Once frozen, remove and place into a container. Cover and store in the freezer until ready to serve. It will keep for a couple of months."]}, {"isVegetarian": false, "title": "Fresh oysters, oysters Mornay and Essex cockle chowder", "url": "www_bbc_co_uk_food_recipes_freshoystersoystersm_92336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "4 rashers streaky bacon, finely chopped", "1 large onion, peeled, finely chopped", "250ml/9fl oz dry white wine ", "400g/14oz cooked picked cockles, rinsed thoroughly (or 1kg/2lb 2oz raw cockles, in the shells, cleaned thoroughly inside and out)", "3 floury potatoes, such as Maris Piper or King Edward, peeled and chopped", "500ml/17½l;fl oz milk", "2 tbsp chopped fresh curly-leaved parsley", "1 tbsp chopped fresh thyme leaves", "2 tbsp double cream", "sea salt flakes and freshly ground white pepper", "60g/2½oz unsalted butter ", "2 tbsp plain flour", "500ml/17½fl oz full-fat milk", "110g/4oz strong cheddar cheese, grated", "24 fresh, good-quality oysters, shucked, half the shells reserved (discard any oysters that are dry inside)", "2 tbsp chopped fresh curly-leaved parsley", "3 tbsp red wine vinegar", "5 tbsp finely chopped shallots", "12-24 native or rock oysters (to taste), shucked, shells and shell juices reserved", "dash Tabasco sauce, to taste", "dash Worcestershire sauce, to taste", "1 lemon, cut into wedges", "crushed ice", "buttered sourdough bread"], "serves": "4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the Essex cockle chowder, heat the butter and oil in a large saucepan over a medium heat. When the butter is foaming, add the bacon and onion and fry for 4-5 minutes, or until the bacon is crisp and golden-brown and the onions have softened but not coloured. Remove the onions and bacon from the pan and set aside.", "Add the wine to the pan the onions and bacon were cooked in and bring to a rolling boil.", "If using fresh cockles, add them to the pan and boil for 3-4 minutes, or the shells have opened (discard any cockles that do not open during cooking). (NB: If using cooked cockles, skip this step.)", "Remove the cockles from the pan using a slotted spoon, remove them from their shells and set aside to cool (reserve the cooking liquid). ", "Continue to boil the wine until it has reduced in volume by half. Set aside and keep warm.", "Meanwhile, in a separate saucepan, parboil the potatoes in salted, boiling water for 5-6 minutes, or until just tender. Drain well and set aside.", "Return the reduced cooking liquid to the heat, add the milk and parboiled potatoes and bring the mixture to a simmer. Continue to simmer until the potatoes are starting to fall apart. ", "Add the cooked cockles, parsley, thyme and cream to the mixture and return the cooked bacon and onion. Stir well. Heat through for 2-3 minutes, being careful not to overcook the cockles. Season, to taste, with sea salt flakes and ground white pepper. ", "Meanwhile, for the oysters Mornay, preheat the grill to its highest setting.", "Melt the butter in a pan over a medium heat. Whisk in the flour and heat until a smooth paste forms.", "Whisk in the milk a little at a time, making sure that each addition of milk has been incorporated into the mixture and the mixture has thickened slightly before adding the next.", "When all of the milk has been incorporated into the mixture and a smooth, thick white sauce has formed, stir in half of the grated cheese and season, to taste, with salt and freshly ground black pepper.", "Arrange the oysters, in their shells, in rows in a grill pan and spoon over the cheese sauce. Sprinkle over the remaining grated cheese and grill for 4-5 minutes, or until the cheese has melted and is golden-brown. ", "Just before serving, sprinkle over the parsley. ", "Meanwhile, for the traditional oysters, in a bowl, whisk together the red wine vinegar and shallots and set aside for five minutes. ", "Cover a serving platter with the ice. Push the shucked oysters (in their shells, with the shell juices) into the ice. ", "Serve the red wine and shallot mixture alongside in a ramekin, along with the lemon wedges and small bottles of Tabasco sauce and Worcestershire sauce. ", "To serve, spoon the Essex cockle chowder into 4-6 serving bowls. Place the bowls onto large serving plates and divide the oysters Mornay equally among the plates. Serve with the traditional oysters, sourdough bread and butter."]}]