[{"isVegetarian": true, "title": "Millionaire's shortbread", "url": "www_bbc_co_uk_food_recipes_millionaires_shortbread_76712", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/millionaires_shortbread_76712_16x9.jpg", "ingredients": ["225g/8oz plain flour", "175g/6oz unsalted butter, cold, cut into cubes", "75g/2¾oz caster sugar", "150g/5oz butter", "1 x 379g can condensed milk", "100g/3½oz golden syrup", "350g/12oz dark chocolate, or a mixture of dark and milk, chopped into small pieces"], "serves": "Makes 20 pieces", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Line a 23cm/9in square cake tin with baking parchment.", "Combine the flour and butter cubes in a food processor and pulse until the mixture resembles fine breadcrumbs. (Alternatively, you can rub the butter in by hand.)", "Add in the caster sugar and pulse again until combined. ", "Tip the mixture into the lined cake tin and spread it out evenly with the back of a spoon. Then press the shortbread down firmly with your knuckles so that it is tightly packed in the tin.", "Bake the shortbread for 30 minutes or until very light golden brown. Set aside to cool.", "Meanwhile, for the topping, heat the butter, condensed milk and golden syrup in a saucepan, stirring occasionally until the butter is melted and the mixture is smooth.", "Increase the heat and bring the mixture to the boil, stirring frequently. The caramel will thicken and turn golden-brown. Set aside to cool slightly, then pour over the cooled shortbread. Allow to cool completely.", "Melt the chocolate in a bowl set over a pan of simmering water (ensure that the bottom of the bowl does not touch the water), stirring occasionally.", "Pour the melted chocolate over the caramel and set aside until the chocolate has cooled completely.", "Cut into squares and serve."]}, {"isVegetarian": false, "title": "Millionaire’s amber shortbread", "url": "www_bbc_co_uk_food_recipes_millionaires_amber_59013", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz dried apricots", "1½ tbsp dark muscovado sugar", "2 gelatine leaves", "5 tbsp amaretto liqueur", "60g/2¼oz butter or margarine", "30g/1oz golden caster sugar", "15g/½oz ground almonds", "½ tsp almond extract", "80g/3oz plain flour", "140g/5oz icing sugar", "225g/8oz ground almonds", "squeeze lemon juice", "1 medium free-range egg", "drop almond extract", "120g/4½oz dark chocolate (around 50-60% cocoa solids)", "120g/4½fl oz double cream", "12g/⅓oz liquid glucose ", "100g/3½oz dark chocolate (around 51% cocoa solids)", "popping candy", "gold leaf (optional)"], "serves": "Makes 12 squares", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the apricot and amaretto preserve, put the apricots and sugar in a saucepan with around 150ml/5fl oz of boiling water.  Bring the apricots to the boil and simmer for 40 minutes, or until the apricots have plumped up.  Top up the water if you see it evaporating too quickly.  ", "Soak the gelatine leaves in a bowl of cold water for five minutes, or until softened.  Take the apricots off the heat and add the amaretto, to taste, before adding the gelatine leaves. Stir until dissolved.", "Place the mixture into a food processor and blend to a purée. Set aside.", "For the shortbread, preheat the oven to 190C/170C(fan)/Gas 5 and grease and line a 15cm/6in square tin with baking paper.  ", "In a free-standing mixer with the beater attachment, cream together the butter (or margarine), sugar, ground almonds and almond extract until light and fluffy.  Add the flour and beat until it just begins to clump together – don’t overbeat.  ", "Bring the dough together using your hands and press into the tin so that it’s flat and even. Prick the dough with a fork and bake in the middle of the oven for 15-20 minutes.  Remove from the tin, peel off the baking paper and cool on a wire rack.", "Once the shortbread has cooled sufficiently (around 20-30 minutes), pour the preserve on top and smooth so that it evenly coats the shortbread and then put in the fridge to set for around 20-30 minutes.", "For the marzipan, mix the sugar and almonds together in a bowl before adding the lemon juice, egg and almond extract.  Mix together using a knife, using your hands towards the end to create a ball.  Knead on a work surface until smooth, using a little icing sugar to stop the marzipan from sticking.  Wrap in cling film and chill until needed.", "To make the ganache, break the chocolate into squares and place in a bowl.  Bring the cream and liquid glucose to just below boiling point and then pour it over the chocolate.  Stir with a spatula until smooth and glossy.  Cool at room temperature until needed.", "Roll out the marzipan to a 3-5mm thickness and place on top of the shortbread. (The preserve should be sticky enough to hold the marzipan in place.) Put back into the fridge to set for 10 minutes.", "Spread the ganache on top of the marzipan, ensuring it’s as even and smooth as possible.  Chill in the fridge for at least 20 minutes.", "To make the chocolate decorations, place the chocolate in a bowl over a pan of simmering water, making sure the water does not touch the bottom of the bowl. When the chocolate looks nearly melted but there are still a few bits of unmelted chocolate on top, remove from the pan and stir the chocolate gently until smooth. It should have thickened slightly. It's now ready to use.  Line a baking tray with non-stick baking parchment.", "Transfer the chocolate into a small piping bag and snip off a very small hole at the bottom. Pipe 4 x 3cm/1½in parallel lines close together onto the lined baking tray. Pipe another four lines across these to create a lattice shape. Repeat to create twelve lattice shapes. Leave to set slightly. ", "Using a 2cm/¾in round cutter, cut out 12 circles from the chocolate lattice decorations, leaving them on the baking tray to set completely before using.", "When the millionaire’s shortbread is set, use a long and very sharp knife to cut the biscuit into 12 squares.  Neatly sprinkle popping candy onto one side of the squares.", "Carefully remove the small rounds of chocolate lattices from the paper and brush a small amount of gold leaf onto each of them (if using).  ", "Carefully place a disk onto every square, the opposite side to the popping candy and present on a tiered cake stand."]}, {"isVegetarian": true, "title": "Millionaire’s shortbread banoffee traybake", "url": "www_bbc_co_uk_food_recipes_millionaires_shortbread_88342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter, softened, plus extra for greasing", "100g/3½oz golden caster sugar", "300g/10½oz plain flour", "1 tsp vanilla extract", "100g/3½oz hard banana chips ", "150g/5½oz unsalted butter", "150g/5½oz golden caster sugar", "50g/1¾oz golden syrup", "1x 397g/14oz tin condensed milk", "1 large slightly ripe banana, mashed until smooth", "100g/3½oz chewy banana chips, cut up with scissors", "1 tbsp sea salt flakes", "250g/9oz dark chocolate ", "gold leaf-covered hard and chewy banana chips "], "serves": "Makes about 24 squares", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/fan 160C/350F/Gas 4 and lightly grease a 20x33cm/8x13in square-cornered Swiss roll tin.", "Place all the ingredients for the shortbread in a food processor and pulse to form a smooth dough. ", "Press the mixture firmly into the base of the tin, to create a flat surface and clean edge. Prick all over with a fork and bake for 20-30 minutes, or until lightly golden-brown and firm.", "For the topping, grind the hard banana chips in a food processor to a coarse powder. Set aside.", "To make the caramel, place the butter, sugar, syrup and condensed milk into a saucepan and stir over a low heat until the butter has melted, stirring all the time. Boil the mixture gently for 10 minutes, stirring all the time until deep golden-brown and thickened, stirring in the mashed banana a few minutes before the end. ", "Remove from the heat and allow to cool slightly before stirring through the banana chips and reserved banana powder. Pour over the baked shortbread base and sprinkle over the sea salt flakes. Allow to cool slightly while preparing the chocolate topping. ", "Melt the chocolate in a bowl set over a pan of simmering water (do not allow the bottom of the bowl to touch the water). Pour the chocolate over the banana salted caramel layer and leave to set in the fridge. ", "Cut into bars with a very sharp, heavy knife and stack up on a serving plate. Decorate with gold leaf-covered hard and chewy banana chips if you like."]}, {"isVegetarian": false, "title": "Mince and dumplings", "url": "www_bbc_co_uk_food_recipes_mince_and_dumplings_47431", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mince_and_dumplings_47431_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "1 large onion, thinly sliced", "2 garlic cloves, finely chopped", "2 celery sticks, peeled, finely sliced", "2 medium carrots, diced", "500g/1lb 2oz lean beef mince", "1 x 400g/14oz can chopped tomatoes", "2 tbsp tomato purée", "350ml/12fl beef stock ", "150ml/5fl oz red wine ", "pinch caster sugar", "1 bay leaf", "salt and freshly ground black pepper", "250g/10oz self-raising flour, plus extra for rolling", "125g/5oz shredded beef suet", "½ tsp fine sea salt", "2 tbsp chopped fresh parsley "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan or flameproof casserole and cook the onion, garlic, celery and carrots for 15 minutes, stirring occasionally until soft and pale golden-brown.", "Add the minceand cook for a further five minutes.", "Add the tomatoes, tomato purée, beef stock, red wine, sugar and bay leaf. Add a good pinch of salt and freshly ground black pepper. Bring to the boil, then reduce the heat and simmer gently for 20 minutes, stirring occasionally. ", "For the dumplings, put the flour in a bowl and stir in the suet, salt and parsley. Make a well in the centre and add enough cold water - you’ll need around 200ml/7fl oz - to mix to a soft, spongy dough. Use lightly floured hands to roll into 12 small balls.", "Place the dumplings carefully on top of the mince. Cover with a tight-fitting lid and cook over a medium heat for 18-20 minutes, or until the dumplings are cooked through and well risen."]}, {"isVegetarian": true, "title": "Milk chocolate salt caramel mousse", "url": "www_bbc_co_uk_food_recipes_milk_chocolate_salt_51156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz granulated sugar", "30g/1oz butter", "200ml/7fl oz double cream", "200g/7oz milk chocolate (38% cocoa solids), chopped", "3 large free-range eggs, separated", "sea salt flakes, to garnish"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["In a saucepan set over a low heat, make a caramel by slowly dissolving the sugar with 2 tablespoons water. Bring to a slow simmer without stirring. When the syrup starts to colour around the edges, swirl the saucepan gently, allowing the caramel to cook evenly. Do not stir, but let it become a nice dark brown. Remove from the heat and mix in the butter.", "Meanwhile, put the double cream into a large saucepan and bring to the boil.", "Pour the caramel over the hot cream and continue mixing until smooth. If there are any lumps of hardened caramel, let them dissolve in the warm cream before adding the other ingredients. Allow to cool slightly.", "Add the chocolate to the caramel cream and let it melt, then mix in gently. Stir in the egg yolks (making sure the caramel cream isn't too hot, or the eggs will scramble). ", "In a mixing bowl, whisk the egg whites until they form firm but not stiff peaks. (Don’t be tempted to whisk the egg whites too much, as a looser texture is best.) Fold into the chocolate mixture using a large metal spoon. ", "Divide the mousse between six ramekins. Chill for at least 6 hours. Finish with a pinch of sea salt flakes."]}, {"isVegetarian": true, "title": "Mince pie ice cream", "url": "www_bbc_co_uk_food_recipes_mince_pie_ice_cream_43784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["leftover mince pies", "vanilla ice cream"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the ice cream from the freezer and leave to soften.", "Break the mince pies up into small pieces and mix into the ice cream. Return the ice cream to the freezer. "]}, {"isVegetarian": true, "title": "Mince pies", "url": "www_bbc_co_uk_food_recipes_mince_pies_16839", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mince_pies_16839_16x9.jpg", "ingredients": ["150g/5½oz raisins", "150g/5½oz currants", "75g/2½oz chopped mixed peel", "3 tbsp brandy", "150g/5½oz cold butter, grated ", "125g/4½oz dark brown soft sugar or muscovado sugar", "1 vanilla pod, seeds scraped", "1 tsp ground mixed spice", "1 Bramley apple, peeled, grated, core discarded ", "1 orange, juice and zest", "1 lemon, juice and zest", "350g/12oz plain flour, plus extra for dusting", "150g/5½oz unsalted butter, softened, cut into cubes", "50g/1¾oz icing sugar, sifted", "1 orange, zest only", "2 free-range egg yolks", "2 free-range eggs, beaten", "50g/1¾oz demerara sugar"], "serves": "Makes 12 mince pies (plus leftover mincemeat)", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Combine all of the ingredients for the mincemeat in a large bowl and mix thoroughly. Cover with cling film and leave for 24 hours.", "For the pastry, sift the flour into a bowl, add the softened butter, icing sugar and orange zest and gently incorporate with your hands until the mixture resembles rough breadcrumbs.  Mix in the egg yolks and then add 2-3 tablespoons of water to help bring it together. Squeeze the pastry together gently until you have a soft ball of pastry. Flatten to a disc, wrap in cling film and refrigerate for 30 minutes.", "Preheat the oven to 180C/350F/Gas 4. ", "Grease a bun tin or muffin tin, depending on how deep you like your mince pies. Unwrap the pastry and roll out on a lightly floured work surface to the thickness of a one pound coin. Cut out 12 discs of pastry with a pastry cutter slightly bigger than the size of the bun tin holes. Press a round of pastry into the bottom of each hole. Fill each pastry case with mincemeat and then cut a further 12 rounds of pastry (this time one size smaller). Brush the rims of the pastry cases with a little beaten egg and press the lids on, pressing the edges with the ends of a fork to seal shut.", "Brush the lids with beaten egg and then use a small knife or skewer to make a slit in the top of each pie. Sprinkle with demerara sugar and then transfer the tray to the fridge for 30 minutes.", "Bake the mince pies for 20-25 minutes, or until golden-brown and crisp. Transfer to a wire rack to cool and then turn the mince pies out and serve. Any leftover mincemeat should be spooned into sterilised jars and sealed."]}, {"isVegetarian": true, "title": "Mince pie rolls", "url": "www_bbc_co_uk_food_recipes_mince_pie_rolls_61196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 410g/14½oz jar ready-made mincemeat", "150g/5oz morello cherries in kirsch (available from Continental delicatessens), drained", "150g/5oz dried, ready-to-eat apricots, diced", "1 lime, zest only, plus ½ lime, juice only", "4 fresh basil leaves, shredded", "pinch allspice", "plain flour, for dusting", "1 x 320g/12oz sheet ready-to-roll all-butter puff pastry", "1 free-range egg, beaten with a splash of double cream", "1 tbsp granulated sugar, to decorate", "butter, for greasing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "In a large bowl, mix together the mincemeat, cherries, apricots, lime zest and lime juice until well combined. Stir in the basil leaves and allspice.", "Roll out the pastry onto a lightly floured work surface to a rectangle measuring approximately 38x10cm/15x4in. With the long edge of the rectangle facing you, spoon the mincemeat mixture in a thick line across the middle of the puff pastry rectangle.", "Brush the pastry not covered by the mincemeat mixture with some of the beaten egg and cream mixture, then roll the pastry around the mincemeat, pressing to seal along the join and at each end. Trim off any excess pastry using a sharp knife.", "Brush the top of the mince pie roll with the remaining egg and cream mixture, then crimp the edges or snip with scissors. Sprinkle over the sugar.", "Transfer the mince pie roll to a baking tray lightly greased with butter. Bake the mince pie roll in the oven for 20-30 minutes, or until the pastry has risen and is light golden-brown, and the filling is piping hot. Remove from the oven and set aside to cool slightly for 10 minutes.", "To serve, cut the mince pie roll into slices, or tear and share."]}, {"isVegetarian": false, "title": "Mince with herb dumplings", "url": "www_bbc_co_uk_food_recipes_mince_with_herb_14547", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower oil", "1 large onion, halved, thinly sliced", "2 garlic cloves, finely chopped", "2 celery sticks, finely sliced", "2 medium carrots, diced", "500g/1lb 2oz beef mince", "1 x 400g/14oz can chopped tomatoes", "2 tbsp tomato purée", "450ml/16fl oz beef stock, fresh or made with a cube", "pinch caster sugar", "1 bay leaf", "sea salt and freshly ground black pepper", "250g/9oz self-raising flour", "125g/4½oz beef suet, shredded", "½ tsp fine sea salt", "2 tbsp finely chopped fresh parsley ", "1 tsp finely chopped rosemary ", "1 tsp finely chopped thyme "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mince, heat the oil in a large saucepan or flameproof casserole dish and cook the onion, garlic, celery and carrots for 15 minutes, stirring occasionally until softened and lightly coloured. Add the beef and cook with the vegetables for a further five minutes until the mince begins to brown, stirring regularly to break up the meat.", "Add the tomatoes, tomato purée, beef stock, sugar and bay leaf. Add a good pinch of salt and plenty of freshly ground black pepper. Bring to the boil, then reduce the heat and simmer gently for 20 minutes, stirring occasionally. ", "To make the dumplings, put the flour in a bowl and stir in the suet, salt and parsley, rosemary and thyme. Make a well in the centre and add enough cold water - you’ll need around 200ml/7fl oz - to mix to a soft, spongy dough. Lightly flour your hands and roll the mixture into 12 small balls.", "Stir the mince well and remove from the heat. Drop the dumplings carefully on top of the mince then cover with a tightly fitting lid and return the pan to a medium heat. Cook for 18-20 minutes or until the dumplings are well risen."]}, {"isVegetarian": false, "title": "Minced beef pinwheels", "url": "www_bbc_co_uk_food_recipes_minced_beef_pinwheels_78308", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minced_beef_pinwheels_78308_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "½ medium onion, peeled and finely chopped", "1 garlic clove, crushed", "500g lean beef mince", "1 tsp dried mixed herbs", "1 tbsp tomato purée", "1 tbsp plain flour, plus extra for rolling", "500g block of ready-made puff pastry", "50g mature Cheddar, finely grated (optional)", "1 medium egg, beaten", "salt and freshly ground black pepper"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a large baking tray (or two smaller baking trays) with greaseproof paper.", "Heat the oil in a small frying pan and gently fry the onion and garlic for 2–3 minutes until soft, stirring regularly. Tip the mixture into a large heatproof bowl and leave to cool for few minutes.", "Add the minced beef, dried herbs, tomato purée and the flour to the bowl with the onion and season with salt and freshly ground black pepper. Mix with clean hands until thoroughly combined. ", "Lightly  flour a clean surface with flour, and roll the puff pastry into a 34cm/13½in square. ", "Spread the mince mixture over the pastry, leaving a 2cm/¾in border around the edges. Sprinkle on the grated cheese, if using, and brush the pastry edges with a little of the beaten egg. ", "Firmly roll the pastry up, like a Swiss roll. ", "Cut the roll into 12 even slices using a serrated knife – a bread knife is ideal. ", "Place the pinwheels on the baking tray (or trays), spaced well apart to allow for rising. Flatten each pinwheel slightly with the palm of your hand. Brush the top of each pinwheel with the beaten egg to glaze, taking care not to allow the glaze to drip down the sides and onto the tray as this will make the pinwheels stick to the baking paper. Bake for 15 minutes or until well-risen and golden brown, and the beef is cooked through. ", "Allow to cool slightly, then remove from the baking paper using a palette knife.  Best served warm."]}, {"isVegetarian": false, "title": "Pork meatloaf with soured cream (Faschierter Rahmbraten)", "url": "www_bbc_co_uk_food_recipes_minced_pork_meatloaf_70199", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minced_pork_meatloaf_70199_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "1 large onion, finely diced", "1 garlic clove, crushed", "500g/1lb 2oz pork mince, or a mixture of beef and pork mince", "175g/6oz fresh white breadcrumbs", "1 tbsp dried marjoram or 2 tbsp fresh marjoram leaves, chopped", "1 tsp caraway seeds", "1 tsp flaked sea salt", "1 tsp coarsely ground black pepper", "2 medium eggs, beaten", "500ml/18fl oz beef stock (preferably fresh stock)", "150ml/5fl oz/¼ pint soured cream", "a few sprigs of fresh marjoram, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Heat the oil in a large frying pan and gently fry the onion for 5 minutes or until softened, stirring occasionally. Add the garlic and cook for 1 minute more, stirring constantly.", "Tip the onion and garlic into a large bowl and add the mince, 150g/5½ oz of the breadcrumbs, the marjoram, caraway seeds, salt and pepper. Mix everything well with clean hands, then add the beaten eggs and mix again. Form the mixture into a rough ball.", "Place the ball in the centre of a sturdy roasting tin and shape it into a long loaf, about 4cm/1½ in high. Sprinkle the reserved breadcrumbs on top and pat them lightly into the outside of the loaf. Pour 300ml/10fl oz/½ pint of the beef stock around the base of the meatloaf.", "Bake in the centre of the oven for 20 minutes, then pour the remaining stock into the tin and return to the oven for 10 minutes until cooked through. Transfer the meatloaf carefully to a warmed serving platter and cover loosely with foil.", "Place the roasting tin over a medium heat and simmer for a few minutes until the juices are well reduced – you should have about 100ml/3½fl oz of liquid in the tin. Stir in the soured cream and warm through gently, stirring constantly, then season to taste with salt and pepper. ", "Strain the sauce through a sieve into a small jug. ", "Garnish the meatloaf with some fresh marjoram sprigs, if you have some, and serve with the hot sauce."]}, {"isVegetarian": false, "title": "Minced beef pie", "url": "www_bbc_co_uk_food_recipes_mincedbeefpie_89198", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincedbeefpie_89198_16x9.jpg", "ingredients": ["2 tbsp vegetable oil ", "500g/1lb 2oz beef mince", "1 onion, chopped", "1 tbsp tomato purée 1½ tbsp plain flour, plus extra for dusting", "75g/2½oz mushrooms, chopped", "250ml/9fl oz stout or beef stock", "dash Worcestershire sauce", "400g/14oz ready-made shortcrust pastry", "1 free-range egg, yolk only, lightly beaten"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a deep frying pan and fry the beef mince for 4-5 minutes, breaking it up with a wooden spoon as it browns.", "Add the onion and cook for 2-3 minutes, then stir in the tomato purée and cook for 2-3 more minutes. Stir in the flour and cook for a further minute, then add the chopped mushrooms, the stout or beef stock and a couple of dashes of Worcestershire sauce. Bring to the boil, then reduce the heat, cover the pan with a lid and leave to simmer for 20 minutes. Set aside and leave to cool, then turn the meat mixture into a one litre pie dish.", "Roll out the pastry on a floured work surface until it is slightly larger than the pie dish. Gently drape the pastry over the dish, pressing firmly onto the edges.  Trim, then shape the edges into a fluted shape.", "Cut some leaf shapes out of the pastry trimmings and decorate the top of the pie, sticking them to the pastry with the beaten egg yolk.  ", "Make three or four slits in the pastry to allow the steam to escape, then brush the pie with the rest of the beaten egg yolk and bake in the oven for 20-25 minutes, or until golden-brown. ", "To serve, slice into wedges."]}, {"isVegetarian": false, "title": "Turkey mince stir fry with basil", "url": "www_bbc_co_uk_food_recipes_mincedturkeystirfrie_90232", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincedturkeystirfrie_90232_16x9.jpg", "ingredients": ["55g/2oz fresh holy basil leaves, or ordinary basil (weight after removing stems)", "vegetable oil for shallow-frying, plus 4 tbsp for stir frying", "5 garlic cloves, peeled and finely chopped", "75g/3oz shallots or onions, peeled and finely sliced", "2 fresh hot green cayenne chillies, or to taste, sliced", "2 fresh hot red cayenne chillies, or to taste, sliced", "2.5cm/1in cube fresh root ginger, finely grated", "450g/1lb turkey mince (from boned, skinned breast and/or legs)", "5 tsp fish sauce or 1 tsp salt, to taste", "1½ tsp palm sugar or dark brown sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the basil leaves and pat them dry. Set aside 15g/½oz of the whole leaves. Chop the rest very coarsely and set aside.", "Heat 1cm/½in depth of oil in a medium frying pan over a medium-high heat. Place a plate lined with kitchen paper near the hob. Have ready a splatter screen or an upturned sieve to cover the pan to prevent the oil from splattering.", "When the oil is hot, add the whole basil leaves. Cover immediately with the screen or sieve. Remove the cover as soon as the intense sizzling has died down (a matter of seconds) and stir the leaves once or twice. They will turn crisp very quickly.", "Remove with a slotted spoon and spread out on the kitchen paper to drain. Once the oil has cooled sufficiently, strain it and reserve for future use.", "Heat four tablespoons of oil in a large frying pan or wok over a medium heat. Add the garlic and shallots and fry, stirring, for about two minutes or until the shallots are lightly golden. Do not allow them to burn.", "Add the chillies and ginger and give a few vigorous stirs.", "Add the chopped basil and stir.", "Add the minced turkey, turn up the heat a bit and fry for about 3-4 minutes, stirring to break up the lumps as you do so. The turkey will lose its pink colour once it's cooked.", "Stir in the fish sauce (or salt), to taste, and the palm sugar (or dark brown sugar) and stir thoroughly to combine. If there is liquid remaining in the bottom of the wok, continue cooking until it boils off, but don't overcook the turkey.", "Transfer to a serving dish, top with the crisp-fried basil leaves and serve."]}, {"isVegetarian": true, "title": "Mincemeat", "url": "www_bbc_co_uk_food_recipes_mincemeat_2491", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_2491_16x9.jpg", "ingredients": ["225g/8oz vegetarian suet", "225g/8oz Bramley apples, peeled, cored and chopped", "125g/4oz candied peel, chopped", "225g/8oz sultanas", "225g/8oz raisins", "225g/8oz currants", "175g/6oz demerara sugar", "1 tsp mixed spice", "1 orange, zest and juice", "60ml/2fl oz brandy"], "serves": "Makes 1.8kg/4lb", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together.", "Pack into sterilised jars and seal.", "Store in a cool dark place until you want to use it."]}, {"isVegetarian": true, "title": "Mincemeat and orange feathered tarts", "url": "www_bbc_co_uk_food_recipes_mincemeat_and_orange_21941", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_and_orange_21941_16x9.jpg", "ingredients": ["175g/6oz plain flour", "75g/2½oz cold butter, cubed", "25g/1oz icing sugar, plus extra for dusting", "1 large orange, grated zest only", "1 free-range egg, beaten", "250g/9oz good-quality ready-made mincemeat", "100g/3½oz ready-to-eat dried apricots, finely chopped (do this in a food processor if you're short on time)", "125g/4oz uncoloured marzipan, grated"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and place a baking sheet inside to heat up. ", "For the pastry, either pulse the flour and butter in a food processor until the mixture resembles breadcrumbs, or rub the flour and butter together in a large bowl using your fingertips. ", "Stir in the icing sugar and orange zest, then stir in the beaten egg and mix until the ingredients just come together as a dough. Wrap the dough in greaseproof paper and chill in the fridge for 10-15 minutes, or until firm. ", "When the pastry has rested, unwrap it. Place the greaseproof paper on a work surface and lightly dust with icing sugar. Place the dough on top, dust with icing sugar, then cover with another sheet of greaseproof paper. Roll the pastry between the sheets of greaseproof paper to a thickness of 1-2mm. (If you are confident rolling out pastry you do not need to use the greaseproof paper, but it does help prevent the pastry tearing if the dough is a little sticky).", "Stamp 12 rounds from the pastry using a 8cm/3in fluted pastry cutter. (Any leftover pastry can be frozen and used to make jam tarts.) Line each hole of the muffin tin with one of the pastry rounds and prick the base of each with a fork.", "For the filling, mix the mincemeat with the chopped apricots until well combined. Divide the mixture equally among the pastry cases. Top each tart with some of the grated marzipan.", "Slide the muffin tin onto the hot baking sheet and bake in the oven for 12-15 minutes, or until golden-brown and crisp. Dust with icing sugar and serve warm."]}, {"isVegetarian": false, "title": "Mincemeat brownies with a chocolate ganache", "url": "www_bbc_co_uk_food_recipes_mincemeat_brownies_with_27556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz double cream", "190g/7oz dark chocolate (minimum 70% cocoa), broken into pieces", "50ml/2fl oz rum", "375g/13oz unsalted butter ", "375g/13oz dark chocolate (minimum 70% cocoa solids), broken into pieces", "500g/1lb 2oz caster sugar", "225g/8oz plain flour", "6 large free-range eggs ", "1 tbsp vanilla extract ", "1 tsp salt ", "1 x 410g jar mincemeat"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/Fan 140/Gas 2½. Line a 15x20cm/6x8in tin with baking paper.", "For the ganache, bring the cream just to the boil and then remove from the heat. Allow to cool for a couple of minutes, then stir in the chocolate until melted. Stir in the rum and pour into a container or large glass bowl. Allow to cool at room temperature for up to an hour. ", "Meanwhile, for the brownies, melt the butter and chocolate together in a large pan. Add the sugar and stir until dissolved. Remove from the heat and sift in the flour, then beat in the eggs one at a time.", "Mix in the vanilla, salt and mincemeat and pour into the prepared baking tin. Bake for 25 minutes, or until the brownie is firm but the inside still feels soft. Leave to cool completely in the tin, then remove from the tin and cut into squares.  ", "Just before serving, whisk the ganache until aerated and shiny.", "To serve, place a warm brownie on a serving plate and top with a spoonful of chocolate ganache."]}, {"isVegetarian": false, "title": "Mincemeat flan with orange Chantilly", "url": "www_bbc_co_uk_food_recipes_mincemeat_flan_with_96385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/8oz plain flour ", "pinch salt", "1 tbsp caster or icing sugar, plus extra for sprinkling", "125g/4oz butter, in cubes", "55g/2oz lard, in cubes ", "1 free-range egg, separated ", "2-3 tbsp water", "1 x 400g/14oz jar luxury mincemeat ", "150ml/¼ pint double cream", "2 tbsp orange liqueur, such as Cointreau or Grand Marnier", "2 tsp caster sugar", "1 small orange, finely grated zest only"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Make the pastry in a food processor: blend the flour with a pinch of salt and the sugar. Add the butter and lard to the processor and pulse briefly.", "Add the egg yolk and enough cold water to make a stiff dough (set aside the egg white). Use the pulse button on the processor to bring the mixture together.", "Roll out three-quarters of the pastry and line a 23cm/9in flan tin or pie plate with it. Fill the tin or pie plate with the mincemeat.  ", "Roll out the remaining portion of pastry to cover the top, cutting out a 7½/3in hole in the middle with a plain cutter. Place the pastry ring on top of the flan, crimp round the edge to decorate and seal.", "Cover the hole with a piece of foil cut to the same size as the hole and bake the flan in the oven for 35-40 minutes.", "About five minutes before the flan is cooked, lightly beat the egg white and brush the top of the flan with it. Sprinkle with caster sugar (or icing sugar) and return to the oven.", "To serve, whip the cream with the liqueur, caster sugar and orange zest in a bowl. Pile the cream into the middle of the warm flan and serve hot."]}, {"isVegetarian": true, "title": "Mincemeat palmiers", "url": "www_bbc_co_uk_food_recipes_mincemeat_palmiers_17610", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_palmiers_17610_16x9.jpg", "ingredients": ["200g/7oz ready-made mincemeat", "3 clementines, juice and zest", "1 x 375g/13oz pack ready-rolled puff pastry", "2 tbsp butter, melted", "4 tbsp icing sugar, sifted", "1 free-range egg, beaten"], "serves": "Makes 25", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Blend the mincemeat, clementine zest and juice in a food processor to a smooth paste.", "Put the puff pastry on a well-floured surface with the short side towards you.  Roll the pastry a little thinner and cut it in half widthways. Brush each piece of pastry with melted butter and sprinkle over the icing sugar.  Spread the mincemeat paste over the puff pastry.", "With the shortest end facing you, roll both long edges of one piece of pastry towards the centre. Brush a little beaten egg down the centre to stick the two halves together. Repeat with the remaining piece of pastry.", "Carefully lift the rolls onto a baking tray and leave to chill in the fridge for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the roll from the fridge and, using a very sharp knife, slice it into 1cm/½in thick pieces. Lay each slice on the baking tray, cut-side up, and brush well with the beaten egg and a further dusting of icing sugar, then bake in the oven for 15 - 20 minutes, or until puffed up, crisp and golden-brown.", "Remove the palmiers from the oven and leave to cool on the baking tray. Dust with more icing sugar before serving."]}, {"isVegetarian": true, "title": "Mincemeat panforte", "url": "www_bbc_co_uk_food_recipes_mincemeat_panforte_60354", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_panforte_60354_16x9.jpg", "ingredients": ["150g/5½oz blanched almonds (or any other whole nut of your choice)", "250g/9oz mincemeat", "1 tsp ground cinnamon ", "pinch finely grated nutmeg", "pinch ground cloves", "150g/5½oz dark chocolate (70% cocoa solids), chopped", "100g/3½oz dried figs, finely chopped", "1 tbsp cocoa powder", "60g/2¼oz plain flour or ‘00’ flour", "25g/1oz salted butter", "100g/3½oz runny honey", "100g/3½oz soft brown sugar ", "icing sugar, to serve"], "serves": "Serves 16", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Grease and line a 23cm/9in round springform cake tin with baking paper.", "Mix the almonds, mincemeat, spices, chocolate, figs, cocoa and flour in a large bowl.", "Heat the butter, honey and sugar in a medium saucepan until the butter has melted and the sugar has dissolved. Pour over the dry ingredients and mix until well combined. ", "Tip the mixture into the prepared tin and bake for 40–50 minutes. Leave to cool in the tin.", "Just before serving, transfer onto a serving plate, dust with icing sugar and cut into thin slices."]}, {"isVegetarian": true, "title": "Mincemeat trifle", "url": "www_bbc_co_uk_food_recipes_mincemeat_trifle_99318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeat_trifle_99318_16x9.jpg", "ingredients": ["250g/9oz butter ", "250g/9oz caster sugar ", "75g/2½oz ground almonds ", "100g/3½oz plain flour ", "4 large eggs, beaten", "organic or unwaxed orange, grated zest and juice", "100g/3½oz good quality mincemeat ", "5 lemons, zest and juice", "1 orange, zest and juice", "150g/5½oz unsalted butter, cut into cubes ", "300g/10½oz sugar ", "4 eggs and 2 egg yolks", "2 tbsp Marsala or dry sherry", "400ml/14fl oz ready-made custard  ", "300ml/10fl oz double cream ", "20 physalis (Cape gooseberries)", "handful pistachios, shelled and chopped "], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["You will need a shallow 23cm/9in cake tin, the base lined with baking parchment or greaseproof paper. Preheat the oven to 180C/350F/Gas 4.", "Beat the butter and sugar in an electric mixer until pale and fluffy. In another bowl, mix the almonds and flour together and set aside. ", "Add the eggs to the butter and sugar, a little at a time, with the beater on slow. Turn the machine off and add the zest and a third of the almonds and flour, then turn the mixer on slow until the dry ingredients are incorporated, then add the second, and then the third lot, switching the machine off each time. If you do this too quickly you will end up with a heavy cake. ", "Finally, the machine still on slow, mix in the orange juice and the mincemeat. Transfer the mixture with a rubber spatula to the lined cake tin and bake for 35 minutes. Run a palette knife around the edge of the tin and turn out onto sugared greaseproof paper. Leave to cool.", "For the orange and lemon curd, put the zest and juice, the sugar and the butter into a heatproof bowl set over a pan of simmering water, making sure that the bottom of the bowl doesn’t touch the water. Stir with a whisk from time to time until the butter has melted. ", "Mix the eggs and yolks lightly with a fork then stir into the lemon and orange mixture. Let the curd cook, stirring regularly, for about 10 minutes until it is thick and custard-like. It should feel heavy on the whisk. Remove from the heat and stir occasionally as it cools. ", "Break the mincemeat sponge into pieces and put them in the bottom of a serving dish. Sprinkle with a little sweet wine or Marsala or dry sherry. Pour over the custard then place in the fridge, covered. ", "When the curd is cool, pour it over the custard and chill for an hour. Whip the cream, spoon on top, then decorate the top of the trifle with orange zest and physalis and a scattering of chopped pistachios."]}, {"isVegetarian": true, "title": "Mincemeat, almond and pear tart", "url": "www_bbc_co_uk_food_recipes_mincemeatalmondandpe_8898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 11in/30cm loose-bottomed flan tin", "1 quantity sugar pastry (see separate recipe)", "4 tbspof mincemeat (see separate recipe)", "2 pears, peeled, cored and quartered", "4oz (100g) softened butter", "4oz (100g) soft light brown sugar", "4oz (100g) ground almonds", "few drops of vanilla extract", "2 large eggs", "3 tbsp  dark rum", "2 tbsp apricot glaze"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["preheat oven to 160C/325F/Gas 3/140C for fan oven", "Place your flan tin on a baking tray. Line the flan tin with the pastry. Make sure you let the excess pastry hang over the sides but do not trim it off. ", "Spread the mincemeat over the bottom of the pastry and then arrange the pears on top.", "Mix the butter and sugar together and then add the almonds and the eggs. Pour in the rum and add the vanilla extract. Spread this mixture over the top of the pears and bake in the oven for 40 - 45 minutes until the frangipane is set. It should be golden brown and firm.", "When cooled, warm through the apricot glaze and brush over the top of the tart."]}, {"isVegetarian": true, "title": "Mincemeat cake", "url": "www_bbc_co_uk_food_recipes_mincemeatcake_73208", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz self-raising flour, sifted", "150g/5½oz light muscovado sugar", "100g/3½oz unsalted butter, softened", "100ml/3½ fl oz milk", "200g/7oz high quality mincemeat", "2 medium free-range eggs", "grated zest of 1 unwaxed lemon", "200g/7oz high quality mincemeat", "50g/1¾oz light muscovado sugar", "50g/1¾oz whole rolled oats", "½ tsp ground cinnamon", "25g/1oz unsalted butter, melted"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and butter a deep springform 18cm/7in cake tin.", "Place the flour, sugar and butter in a food mixer with the milk, mincemeat, eggs and lemon zest. Add a pinch of salt and mix on a low speed for a couple of minutes until thoroughly combined. Alternatively, mix with a wooden spoon. Tip into the prepared tin and bake for 30 minutes.", "Meanwhile, mix the topping ingredients together in a bowl. Remove the cake and carefully sprinkle the crumble over the top with your fingers. Do it little by little, so that it does not sink into the cake. Return to the oven and continue to bake for a further 50 minutes or until a skewer inserted in the midlle comes out clean (80 minutes baking altogether). Cover loosely with foil for the last 10 minutes or so to prevent burning.", "Remove to a wire rack. Leave to cool for about 30 minutes before carefully removing the sides of the tin. Allow to cool completely and remove base if serving cold for tea, or eat barely warm if serving as pudding."]}, {"isVegetarian": true, "title": "Mincemeat parcels", "url": "www_bbc_co_uk_food_recipes_mincemeatparcels_84935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz vegetable oil, for deep frying", "75g/2½oz ready-made mincemeat", "2 sheets filo pastry, each cut into 3 strips", "1 free-range egg, beaten", "1 tbsp plain yoghurt", "icing sugar, to dust"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place a spoonful of mincemeat on each strip of filo pastry and roll up into triangle shapes, sealing the pastry at the edges. ", "Brush each triangle with the beaten egg. ", "Carefully place the mincemeat triangles into the hot oil and deep fry for three minutes. ", "Carefully remove with a slotted spoon and drain well by transferring to a bowl lined with kitchen paper. ", "Spoon onto a plate. Dollop the natural yoghurt into the middle of the mincemeat parcels and dust with icing  sugar."]}, {"isVegetarian": false, "title": "Mincemeat streusel", "url": "www_bbc_co_uk_food_recipes_mincemeatstreusel_73426", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincemeatstreusel_73426_16x9.jpg", "ingredients": ["100g/3½oz currants", "100g/3½oz raisins", "100g/3½oz sultanas", "100g/3½oz dried cranberries ", "100g/3½oz dried apricots, chopped", "50g/1¾oz mixed peel", "1 large cooking apple, peeled, cored and roughly chopped", "75g/2¾oz butter, cubed", "25g/1oz whole blanched almonds, roughly chopped", "125g/4oz light muscovado sugar", "¼ tsp ground cinnamon", "½ tsp ground mixed spice", "1 lemon, finely grated zest and juice of half a lemon", "100ml/3½fl oz brandy, rum or sherry", "175g/6oz plain white flour", "1½ tbsp icing sugar, sifted", "100g/3½oz butter, cubed, plus extra for greasing", "75g/3oz butter", "75g/3oz self-raising white flour", "40g/1½oz semolina", "40g/1½oz caster sugar", "fresh cream or brandy butter"], "serves": "Serves 16", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the mincemeat, place the currants, raisins, sultanas, cranberries, apricots, mixed peel, apple, butter, almonds, sugar, cinnamon, mixed spice, lemon zest and juice into a large pan and cook over a low heat, stirring occasionally for about 10 minutes. Remove from the heat, leave to cool, then stir in the brandy, rum or sherry.  ", "Preheat the oven to 200C/400F/Gas 6 (fan 180C) and grease a 23x33cm/9x13in Swiss roll tin or equivalent.", "For the pastry, sift the flour and icing sugar into a mixing bowl and rub in the butter until the mixture resembles coarse breadcrumbs. ", "Add just sufficient cold water to mix to a firm dough - if you prefer this can be made in a processor.  If time allows, wrap the dough in cling film and chill for about 30 minutes. ", "On  a lightly floured work surface, roll out the pastry to a rectangle slightly larger than the prepared tin, then line the base and sides of the tin with pastry.  ", "Trim the pastry level with the top edges of the tin and patch any gaps if necessary.  ", "Spread the mincemeat evenly over the pastry base.", "To make the topping, melt the butter and allow this to cool slightly.", "Put the remaining ingredients into a bowl and pour the melted butter over. Mix together until the ingredients combine to form a dough. If time allows, chill this mixture - this makes grating easier.", "Using a coarse grater, grate the topping over the mincemeat and spread evenly.", "Bake in the preheated oven for about 20-25 minutes, or until golden-brown.", "Cut into 16 slices, dust with icing sugar and serve warm with cream or brandy butter."]}, {"isVegetarian": false, "title": "Cheaty mince pies", "url": "www_bbc_co_uk_food_recipes_mincepies_2808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 batch sweet shortcrust pastry", "450g/1lb mincemeat", "icing or caster sugar, for dusting"], "serves": "Makes 18 pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6. Roll out the prepared pastry on a lightly floured surface to about 3mm/1/8in thick. Cut out 18 rounds with the large cutter and roll out again if necessary to cut out 18 lids with smaller cutter. Line the patty tins with the larger rounds.", "Fill the pastry to about half their depth with mincemeat taking care not to overfill. Dampen the edges with a little water and cover with the pastry lids. Seal the edges well. ", "Brush the tops with water and dredge with sugar. Make two small cuts in the top of each pie. Bake for 15-minutes or until golden brown.", "Remove the tins and leave to cool and then dredge with a little more sugar."]}, {"isVegetarian": true, "title": "Mince pies", "url": "www_bbc_co_uk_food_recipes_mincepies_73207", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mincepies_73207_16x9.jpg", "ingredients": ["350g/12oz high quality mincemeat, preferably homemade", "200g/7oz plain flour, sifted", "40g/1½oz golden caster sugar", "75g/2¾oz ground almonds", "125g/4½oz unsalted butter, diced", "1 large free-range egg, beaten", "milk, to glaze"], "serves": "Makes 12 pies", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Lightly butter a 12-hole pie or patty tin. Tip the mincemeat into a bowl and stir so that the liquid is evenly distributed.", "Place the flour, sugar, almonds and butter in a food processor and process briefly until resembling breadcrumbs, then slowly add the egg through the feeder tube. (Or rub the butter into the dry ingredients by hand and stir in the egg.)", "Bring the mixture together with your hands, wrap in clingfilm and chill for an hour or so. Thinly roll out the pastry on a floured surface. Cut out 12 circles with a fluted pastry cutter, large enough to fill the base of the prepared tin. Press gently into each hole, then fill with the mincemeat.", "Cut out another 12 slightly smaller discs and use to cover the mincemeat. Press the edges together to seal. Make a small slit in the top of each, then brush lightly with milk. Chill for about 30 minutes. Meanwhile, preheat the oven to 200C/400F/Gas 6.", "Bake the pies for 20 minutes until golden brown. Remove to a wire rack and serve warm."]}, {"isVegetarian": true, "title": "Gluten-free mince pies", "url": "www_bbc_co_uk_food_recipes_mincepies_77293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz raisins", "100g/3½oz sultanas", "100g/3½oz currants", "50g/2oz cherries (if you use dried cherries they will not have any extra sugar, but glace ones will have sugar)", "1 tsp ground ginger ", "1 tsp ground nutmeg", "½ tsp ground mace ", "2 tsp ground cinnamon ", "50g/2oz vegetable suet (optional)", "½ Bramley cooking apple, cored and chopped but not peeled", "1 lemon, cut into small pieces but not peeled", "1 orange, cut into small pieces but not peeled", "120ml/4fl oz brandy or whisky", "375g/13oz gluten-free and wheat-free flour with xanthan gum OR 200g/7oz chickpea (gram) flour with 175g/6oz rice flour", "150g/5oz butter OR dairy-free margarine", "1 egg (optional)", "caster sugar"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Mix all the dried fruits with the spices and suet if you are using it. ", "Put the apple, orange and lemon pieces in a food processor and purée. ", "Add this mixture to the dried fruit along with the brandy or whisky. ", "Mix well, cover and set aside for anywhere between two hours and 24 hours. Alternatively, you can place in sterilized jars and store for later use.", "To make the pastry, mix the flour and sieve into the bowl of a food processor.", "Cut in the butter or margarine and blend until it is forms crumbs. ", "Add 8-10 tablespoons cold water. Mix to a dough and blend until it forms a ball. ", "Remove from the processor and chill for 30 minutes.", "Pre-heat the oven to 180C/350F/Gas 4. Grease and flour your mince pie tins.", "Remove the pastry from the fridge, and roll out to a thickness of about 5mm. Cut the pastry in circles with a cutter slightly larger than the size of each pie, and line your mince pie tins with it, pushing the pastry up the edges.", "Spoon the mixture into each pie then rollout lids and top each pie, wetting the edges of the dough and pressing it together with your fingers.", "If you are using the egg, beat it in a bowl and brush the lid of each pie generously.", "Bake for around 20 minutes or until the pies are lightly browned and the pastry cooked.", "Remove from the oven and sprinkle with sugar if desired. Cool slightly before carefully lifting them out of the tins (running a sharp knife round the edges to loosen them helps) and cooling on a rack.", "When cold store in an airtight tin. Serve warm or cold."]}, {"isVegetarian": true, "title": "Minestrone", "url": "www_bbc_co_uk_food_recipes_minestrone_23211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "1 onion, chopped ", "2 carrots, chopped", "3 large celery sticks, chopped ", "2 garlic cloves, finely chopped", "2 tbsp tomato purée ", "1 x 400g/14oz tin chopped tomatoes", "1.2 litres/2 pints vegetable or chicken stock, made from a cube", "400g/14oz tin cannellini beans, drained and rinsed", "100g/3½ dried spaghetti, broken into short lengths", "¼ head green cabbage, finely shredded", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large lidded saucepan over a medium heat. Add the onion, carrots and celery, season with a little salt and pepper and cook for about 10 minutes, stirring occasionally until the vegetables have softened.  ", "Add the garlic and fry for another minute. Stir in the tomato purée and cook for a further three minutes. ", "Tip in the tomatoes and stock. Cover with a lid and bring slowly to the boil. Reduce the heat to a simmer and cook for 15 minutes.", "Add the beans and pasta and cook for a further 10 minutes, or until the pasta is cooked.  Add the cabbage and cook for another two minutes. If the soup is too thick, add some hot water to reach your preferred consistency.  ", "Season to taste with salt and pepper before serving.  "]}, {"isVegetarian": true, "title": "Minestrone primavera", "url": "www_bbc_co_uk_food_recipes_minestrone_primavera_28116", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz asparagus, chopped", "100g/3½oz shelled fresh peas", "100g/3½oz shelled fresh small broad beans ", "150g/5½oz fine green beans, chopped", "extra virgin olive oil", "2 spring onions, finely chopped", "¼ head celery, finely chopped ", "200g/7oz waxy potatoes, peeled and cut into 1cm/½in cubes ", "500ml/18fl oz fresh chicken stock (or vegetable stock)", "50ml/2fl oz double cream (optional)", "sea salt and freshly ground black pepper", "50g/1¾oz fresh basil leaves", "1 garlic clove, finely chopped, crushed with a little salt", "50ml/2fl oz olive oil", "2 tbsp pine nuts", "4 tbsp grated parmesan cheese (or vegetarian alternative)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the minestrone primavera, blanch the asparagus, peas, broad beans and green beans in a pan of boiling salted water for a few minutes until cooked but with a crunch. Drain and set aside on a tray. ", "Heat a drizzle of olive oil in a saucepan, add the spring onions, celery and potatoes and fry for about 10 minutes, or until the potatoes are soft, stirring occasionally.", "Pour in the chicken or vegetable stock (or you could simply use some of the water used to cook the vegetables). Add the blanched vegetables. Stir in the double cream (if using) and season with salt and pepper. Blend with a hand blender, but leave it chunky.", "For the pesto, place all the ingredients into a food processor with a tablespoon of water and blend to make a smooth pesto.", "Serve the minestrone in bowls with a drizzle of fresh pesto on top.   "]}, {"isVegetarian": true, "title": "Minestrone with butternut squash ‘noodles’", "url": "www_bbc_co_uk_food_recipes_minestrone_with_35108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minestrone_with_35108_16x9.jpg", "ingredients": ["1 tbsp ghee                                                           ", "2 large onions, diced                                                       ", "1 celery stick, trimmed, diced                                                         ", "1 bay leaf", "1 butternut squash, trimmed, peeled, deseeded", "3 garlic cloves, diced                                                       ", "1 large carrot, diced                                                        ", "½  tsp dried oregano                                                       ", "½  tsp dried basil                                                                                                                               ", "¼  tsp chilli flakes or chopped fresh chilli                                                   ", "800ml/1¾ pints vegetable stock ", "400g tin chopped tomatoes (or 6 large fresh tomatoes, deseeded and chopped)", "2 x 400g tins cooked chickpeas, drained, rinsed", "200g/7oz cavolo nero, tough stalks removed, leaves finely sliced ", "salt and freshly ground black pepper                                                                             ", "large handful grated parmesan (or vegetarian alternative)", "drizzle extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the ghee in a large, lidded saucepan over a low heat. Add the onion, celery and bay leaf and fry for 6-8 minutes, or until softened.", "Meanwhile, peel the butternut squash into spaghetti-like strands using a julienne peeler ", "Add the garlic, carrot, oregano, basil, chilli flakes and stock to the pan. Bring just to the boil, then reduce the heat immediately and simmer, covered, for 6-8 minutes.", "Add the tomatoes,chickpeas and squash strands and continue to simmer for 6-8 minutes, stirring occasionally.", "Stir in the cavolo nero and cook for 4-5 minutes, or until tender. Season with salt and pepper.", "Ladle the soup into serving bowls, then sprinkle with grated parmesan. Drizzle over a little extra virgin olive oil and serve."]}, {"isVegetarian": true, "title": "Mini-tiramisu cakes", "url": "www_bbc_co_uk_food_recipes_mini-tiramisu_cakes_73687", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini-tiramisu_cakes_73687_16x9.jpg", "ingredients": ["165g/5½oz soft butter", "100g/3½oz light brown sugar", "100g/3½oz caster sugar", "4 free-range eggs", "260g/9oz self-raising flour", "80g/3oz ricotta cheese", "3 tbsp coffee essence or 2 tbsp coffee dissolved in 4 tbsp water", "12 amaretti biscuits, roughly crumbled", "icing sugar and cocoa powder, for dusting", "500g/1lb 2oz mascarpone", "1 vanilla pod, seeds only (or 2 drops vanilla extract)", "4 tbsp icing sugar", "4 tbsp Marsala wine", "8 amaretti biscuits, roughly crumbled", "165g/5½oz granulated sugar", "165ml/5½fl oz water", "2 tbsp coffee essence or 2 tbsp coffee powder"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a muffin tin with 12 muffin cases.", "Put the butter and sugars in a large bowl and cream together until light and fluffy. Add half of the eggs, then tip in half of the flour and stir well. Repeat with the rest of the eggs, then sift in the remaining flour. Add the ricotta, coffee and biscuits and mix well.", "Using an ice-cream scoop or two dessertspoons, divide the mixture among the muffin cases. Spread the mixture flat with the back of a spoon. Bake in the oven for 25–30 minutes, or until a skewer inserted into the centre of the cupcake comes out clean. Remove from the oven and leave to cool.", "The filling and syrup can be made while the cakes are baking. Mix together all the filling ingredients in a bowl and set aside in the fridge.", "Put all the syrup ingredients in a pan over a low heat and let the sugar dissolve. Turn up the heat and boil for a couple of minutes or until thick, then remove the pan from the heat and leave to cool.", "Once the cakes are cooked, remove from the oven and leave to cool in the tin. Once you can handle them, remove each cake from the case and slice in half horizontally. Put the halves cut-side up on a large plate. Brush each liberally with the sugar syrup. Go mad here, the cakes should be really, really moist. Keep the rest of the syrup to pour over the cakes at the table.", "Sandwich the halves back together with a generous dollop of the mascarpone cream, dust the tops with icing sugar and cocoa powder and serve straightaway."]}, {"isVegetarian": true, "title": "Mini apple and almond cakes", "url": "www_bbc_co_uk_food_recipes_mini_apple_and_almond_10454", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_apple_and_almond_10454_16x9.jpg", "ingredients": ["75g/2¾oz butter, melted, plus extra for greasing", "100g/3½oz self-raising flour, plus extra for dusting", "100g/3½oz caster sugar", "1 free-range egg, beaten", " ½ tsp almond extract", "60g/2¼oz Bramley apples, peeled and thinly sliced ", "15g/½oz flaked almonds", "crème fraîche, to serve (optional)"], "serves": "Makes 6 cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Grease the inside of the cooking rings with a little butter and dust with flour. Arrange the cooking rings on a baking sheet lined with baking paper.", "Pour the melted butter into a large bowl. Add the sugar, flour, egg and almond extract and mix together until combined.", "Spoon a little of the mixture into the base of each ring, arrange some of the apple slices over the batter and spoon the remaining cake mixture on top, levelling with the back of a teaspoon.", "Scatter each cake with flaked almonds. Bake for 25–30 minutes, or until well risen and golden-brown. ", "Set aside to cool for about 10 minutes before removing the rings. Serve warm with a dollop of crème fraîche."]}, {"isVegetarian": false, "title": "Mini arancini", "url": "www_bbc_co_uk_food_recipes_mini_arancini_05304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, crushed", "250g/9oz arborio rice", "125ml/4½oz dry white wine", "700ml/1lb 9oz fresh chicken stock, hot", "pinch of saffron", "2 tbsp butter ", "30g/1oz parmesan, grated", "2 rashers pancetta", "1 fresh rosemary sprig, leaves only ", "150g/5½oz stale ciabatta, chopped into pieces", "30g/1oz unsalted pistachios, shelled and finely chopped", "50g/1¾oz ball Buffalo mozzarella, finely chopped", "25g/1oz fontina cheese, grated", "30g/1oz sundried tomatoes in oil, finely chopped", "1 egg, lightly beaten", "salt and freshly ground black pepper", "½ tbsp olive oil", "2 garlic cloves, crushed", "1 red chilli, finely chopped", "25g/1oz fresh basil, leaves picked, stalks finely chopped", "400g tin plum tomatoes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based pan over a medium heat and add the onion. Cook for 10 minutes, or until translucent. Stir in the garlic and rice and toast for a few minutes. Pour in the wine and cook, stirring, until evaporated. ", "Meanwhile, heat the chicken stock. Stir a ladleful of hot stock into the rice until it has been absorbed. Keep adding the stock, a ladleful at a time, adding the saffron halfway through cooking, until the rice is nearly cooked. ", "Remove the rice from the heat, stir in the butter and leave covered for 4 minutes. Stir in the Parmesan and then spread the mixture onto a cool baking sheet until ready to use.", "Meanwhile, to make the sauce, heat the oil in a pan over a medium heat and fry the garlic, chilli and basil stalks lightly for 5 minutes. Stir in the tomatoes and simmer for 20 minutes. ", "Remove the tomatoes from the heat and blend using a hand blender. Stir in the basil leaves and leave to one side in a warm place until ready to serve.", "Fry the rashers of pancetta with the rosemary until crisp in a pan. Tip into a food-processor with the ciabatta and blend into breadcrumbs. Tip the mixture into a bowl.", "In a bowl, combine all the remaining ingredients, other than the egg, mix well and form into 16 balls.", "Pack the cooled rice around the filling ball and brush each with beaten egg and then roll through the breadcrumb mixture until covered. ", "Heat a deep fryer to 180C, or until a cube of bread browns in 20 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended.). Deep fry the arancini in batches for 2–3 minutes until golden. Remove from the oil with a slotted spoon and drain on kitchen paper. ", "Serve with the arabiatta sauce. "]}, {"isVegetarian": true, "title": "Mini banoffee pies", "url": "www_bbc_co_uk_food_recipes_mini_banoffee_pies_39023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "125g/4½oz cold butter, diced", "2 tbsp sugar", "pinch salt", "2 free-range eggs yolks only", "1 tbsp double cream", "250g/9oz brown sugar", "50g/1¾oz butter", "142ml/¼ pint double cream", "2 ripe bananas", "500ml/18fl oz double cream", "4 tbsp icing sugar", "125g/4½oz good-quality plain chocolate, shaved with a knife"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 12-hole petit four tin", "For the pastry, place the flour, butter, sugar and salt into a food processor and pulse until the mixture resembles breadcrumbs. Add the egg yolks and enough cream to bring the mixture together to form a dough. Wrap the dough in cling film and place in the fridge for at least 30 minutes.", "Meanwhile, make the toffee. Heat the sugar and butter in a pan until the sugar has dissolved then stir in the cream and pour the mixture into a bowl. Set aside to cool.", "Roll the pastry out on a floured work surface, cut out 12 circles and use them to line the holes of the petit four tin. Bake in the oven for 12-16 minutes or until the pastry is golden-brown and crisp. Carefully transfer the pastry cases to a wire rack and set aside to cool.", "For the mousse, mash the bananas with a hand held blender. Whip the cream until it holds soft peaks then fold in the bananas and the sugar. Pour into a bowl and chill in the fridge.", "To assemble, spoon a little toffee into each pastry case. Spoon the mousse into a piping bag fitted with a plain nozzle and pipe on top of the toffee. Scatter over the shaved chocolate."]}, {"isVegetarian": false, "title": "Mini beef Wellington tartlets", "url": "www_bbc_co_uk_food_recipes_mini_beef_wellington_18819", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_beef_wellington_18819_16x9.jpg", "ingredients": ["2 x 25cm/10in square sheets ready-made filo pastry", "butter, melted, for brushing ", "125g/4½oz fillet tail steak, cut into 25 equally-sized cubes (about 1.5cm/½in)", "salt and freshly ground black pepper", "1 tsp clear honey ", "1 tbsp vegetable oil", "4 tbsp hot creamed horseradish sauce ", "1 tbsp chopped parsley, to garnish"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Brush both sheets of the filo pastry all over with the melted butter, then place them side by side. Using a 5cm/2in square pastry cutter, or a sharp knife, cut 25 squares from each sheet of pastry (there should be exactly the right amount of pastry to yield 50 squares with no trimmings). ", "Take one pastry square and place another on top of it, turning the top layer at an angle to create a star shape. Repeat this process with all of the pastry squares to create 25 stars.", "Press one pastry star, buttered-side down, into each of the moulds of the muffin tin to create 24 mini tartlet cases. (The remaining pastry star can be cooked separately in an individual muffin mould, or discarded.) ", "Bake the tartlet cases in the oven for 5-10 minutes, or until golden-brown and crisp. Remove from the oven and carefully transfer to a wire rack to cool completely.", "In a bowl, season the fillet steak cubes with salt and freshly ground black pepper, then drizzle over the honey and mix well to cover the meat.", "Heat the oil in a frying pan over a very high heat, then fry the steak for 1-2 minutes on all sides, or until browned all over but still pink in the middle. Transfer to a plate and set aside to rest for a minute or two.", "Spoon small, equally-sized dollops of the horseradish into the cooled pastry cases, then sit one warm cube of fillet steak on top of each. Sprinkle each tartlet with a pinch of chopped parsley just before serving."]}, {"isVegetarian": true, "title": "Mini blueberry Bakewell tarts", "url": "www_bbc_co_uk_food_recipes_mini_blueberry_bakewell_93838", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_blueberry_bakewell_93838_16x9.jpg", "ingredients": ["100g/3½oz blueberries, fresh or frozen", "1 tbsp caster sugar", "1 tbsp lemon juice", "100g/3½oz butter, chilled and cubed", "200g/7oz plain flour, sifted", "40g/1½oz icing sugar, sifted", "1 free-range egg, beaten", "55g/2oz butter or baking spread", "55g/2oz caster sugar", "1 free-range egg, beaten", "40g/1½oz ground almonds", "1 tbsp plain flour", "85g/3oz icing sugar", "fresh blueberries"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the jam, place all the ingredients in a small saucepan and heat gently until the berries start to burst. Cook for a few minutes until the mixture thickens, then remove from the heat, strain through a sieve and set aside to cool completely.", "For the pastry, rub the butter into the flour in a medium bowl until the mixture resembles fine breadcrumbs then stir in the sugar. Use a palette knife to cut in the beaten egg then press together to form a ball. Wrap in cling film and chill for at least 30 minutes.", "Grease a 12-hole muffin tin. Unwrap the pastry, place a large sheet of greaseproof paper on top and roll out the pastry to a thickness of 3mm/⅛ in. Use a 5cm/2in round cutter to cut 12 bases for the mini tarts and place one in each hole of the muffin tin. Make the sides by cutting 12 strips 1cm/½in  x 18cm/7in from the remaining pastry and gently press around the sides of each hole of the muffin tin.  Chill for 15 minutes.", "Preheat the oven to 170C/325F/Gas 3. ", "For the frangipane, place the ingredients in a bowl and beat with an electric mixer until smooth and thoroughly combined. ", "Prick the bases of the pastry cases then place half a teaspoon of the jam in each. Top with the frangipane mixture and bake in the oven for about 25 minutes until the frangipane is risen and golden. Cool in the tin for a few minutes then transfer to a wire rack.", "For the topping, mix the icing sugar with a little water to form a thick paste. Spread over the cooled tarts and top each with one or two fresh blueberries."]}, {"isVegetarian": false, "title": "Mini beef Wellingtons with morel mushrooms, sherry and thyme", "url": "www_bbc_co_uk_food_recipes_mini_beef_wellingtons_12665", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz packet ready-made puff pastry", "plain flour, for dusting", "20g/¾oz dried porcini mushrooms or large morels", "2 tbsp vegetable oil", "salt and freshly ground black pepper", "4 x 180g/6oz slices beef fillet", "4 small shallots, peeled and very finely chopped", "knob of butter", "500g/1lb 2oz chestnut mushrooms, finely chopped", "generous dash medium sweet sherry (optional)", "large handful fresh thyme leaves", "1 free-range egg, lightly beaten", "300ml/10fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Roll the puff pastry out on a floured work surface to a 5mm/¼in thickness. Trim the pastry into a 36cm/14in square. Then cut into four smaller squares and place onto two baking trays. Chill in the fridge for five minutes.", "Rinse the dried mushrooms in cold water, then put them into a bowl and cover with hot water. Leave to soak for 20 minutes.", "Meanwhile, heat the oil in a frying pan until very hot. Season the beef well all over with salt and freshly ground black pepper. Fry for one minute on each side. Remove from the pan and set aside.", "Place the shallots into the pan and fry for 4-5 minutes or until softened. Add the butter and chestnut mushrooms and cook for a few minutes.", "Meanwhile, drain the dried mushrooms and finely chop, then add them to the pan with the glug of sherry, if using. Increase the heat and cook until most of the sherry has evaporated.", "Add the thyme, cook for one minute, then remove the pan from the heat and set aside. Season, to taste, with salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6. ", "Remove the pastry from the fridge and place a tablespoon of the mushroom mixture into the middle of each piece of pastry; spread it out to the same size as the beef steak. Top with the steak and brush the edges with the beaten egg.", "Draw up the corners and edges of the pastry so they meet and overlap slightly in the middle. Turn it right-side up and shape it round the sides a little with your hands. If the pastry is soft, chill it in the fridge for 5-10 minutes to firm up. ", "Slash the tops of the Wellingtons with a knife and brush them all over with the remaining beaten egg. Bake for 12-14 minutes (for medium-rare), or until cooked to your liking.", "Five minutes before the Wellingtons are ready, reheat the remaining mushroom mixture. When it is hot, add the double cream and cook on a high heat for 2-3 minutes. Remove the pan from the heat, season, with salt and freshly ground black pepper, then cover with a lid to keep warm.", "Serve the Wellingtons with a spoonful of the sauce."]}, {"isVegetarian": false, "title": "Mini beef Wellingtons", "url": "www_bbc_co_uk_food_recipes_mini_beef_wellingtons_53236", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salted butter, cut into cubes and frozen", "100g/3½oz lard, cut into cubes and frozen", "250g/9oz plain flour", "½ tsp salt", "1 tbsp lemon juice", "garlic infused oil (available from most large supermarkets), for frying", "2 cloves smoked garlic, finely chopped", "1 shallot, finely chopped", "10g dried porcini mushrooms, soaked in boiling water for a few minutes", "125g/4½oz chestnut mushrooms, washed, sliced ", "small bunch of thyme", "50ml/2fl oz dry white wine", "1 tsp sea salt", "cracked black pepper", "6 x 80g/3oz pieces fillet steak", "salt and freshly ground black pepper", "6 slices prosciutto ham", "1 free-range egg, beaten"], "serves": "Makes 6 individual beef Wellingtons", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, in a food processor, mix together the butter, lard, flour and salt until it resembles breadcrumbs.  Add the lemon juice and enough cold water to bring the mixture together into a dough. ", "On a lightly floured work surface, roll out the dough into a large rectangle. With a short edge facing you, fold the bottom third up and the top third down. Rotate the dough by 90 degrees (a quarter turn) and repeat the rolling and folding. Wrap in cling film and place in the fridge for 20 minutes.", "For the mushroom duxelle, heat a little garlic oil in a frying pan. Add the garlic and shallot and gently fry until the shallot is soft and translucent. ", "Drain the porcini mushrooms and squeeze out any excess water. Add them to a food processor and pulse until they resemble breadcrumbs.", "For the pastry, repeat the rolling and folding process and return to the fridge for another 15-20 minutes.", "For the mushroom duxelle, put the porcini mushrooms and chestnut mushrooms in the pan with the garlic and shallot. Simmer for 10 minutes, then add the thyme and wine. Season with salt and pepper and, when the mixture is reduced to a paste, set aside to cool.", "For the beef, heat a heavy-based frying pan over a medium-high heat. When the pan is hot, season the steak and sear until just browned all over (you may need to do this in batches). Set aside to cool.", "When the steak is cool, wrap each piece tightly in a slice of ham.", "For the pastry, repeat the rolling and folding process one final time. Return to the fridge for 15 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "When chilled, on a lightly floured work surface roll out the pastry to a 30cm x 45cm/12in x 18in rectangle (around 5mm thick). Using a sharp knife, cut it into 6cmx15cm/2in x 6in rectangles and spread with the mushroom mixture. Place a piece of beef in the middle of each square and wrap tightly in the pastry, taking care to ensure the meat is completely encased. Crimp the seam of the pastry and tuck in the ends.", "Brush with beaten egg, score the tops and bake for about 25 minutes, or until the pastry is crisp and golden-brown. Serve hot or cold."]}, {"isVegetarian": true, "title": "Mini blueberry pies", "url": "www_bbc_co_uk_food_recipes_mini_blueberry_pies_19105", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz plain flour, plus extra for dusting", "pinch salt", "175g/6oz butter, cubed", "75-110ml/3-4fl oz cold water", "400g/14oz blueberries", "50g/2oz caster sugar", "2 vanilla pods, split , seeds scraped out", "2 free-range egg yolks, beaten", "200g/7oz clotted cream", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5floz milk", "150ml/5floz double cream", "150g/5oz blueberries", "50g/2oz caster sugar", "2 tbsp water"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pie, place the flour, salt and butter into a bowl and rub together until the mixture resembles breadcrumbs.", "Add the water a little at a time, until the mixture comes together as a dough. Knead lightly, shape into a thick disc, wrap in clingfilm and chill in the fridge for 30 minutes.", "Preheat the oven to 180C/350F/Gas 4. ", "Dust the work surface with a little flour then roll the pastry out to a 5mm/¼in thickness. Cut out four 15cm/6in and four 10cm/4½in circles from the pastry.", "Line each of four dariole moulds with the larger circles of pastry.", "Mix the blueberries, sugar and vanilla seeds together in a bowl until well combined. Divide the mixture among the dariole moulds, pressing down firmly.", "Brush the edge of the pastry with the beaten egg yolk then cover each mould with a 10cm/4in pastry circle. Press down the edges firmly and trim any excess. Crimp the edges and brush with the remaining egg yolk.", "Bake in the oven for 30-35 minutes, or until the pastry is cooked through and golden-brown.", "Remove the pies from the oven and set aside to cool for five minutes.", "For the custard, whisk the egg yolks and sugar in a bowl until well combined.", "Bring the milk and cream to the boil in a saucepan. Slowly whisk the cream mixture into the eggs until well combined. Return the mixture to the saucepan and heat slowly, stirring continuously, until the custard has thickened enough to coat the back of the spoon.", "For the compote, heat a frying pan until hot, add the blueberries, sugar and water and cook for 2-3 minutes, or until syrupy.", "To serve, spoon the custard in a pool in the centre of the plate then turn the pie out on top. Drizzle the compote around the plate and finish with a quenelle of clotted cream."]}, {"isVegetarian": true, "title": "Mini cheese munchies", "url": "www_bbc_co_uk_food_recipes_mini_cheese_munchies_61275", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil for greasing ", "1 free-range egg ", "1 tbsp polenta (quick cook) ", "1 large handful baby spinach ", "100g/3½oz plain cottage cheese ", "pinch mild chilli powder ", "45g/2oz plain flour ", "ground black pepper"], "serves": "Makes 6 munchies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First wash your hands and put on an apron.  Weigh and measure all the ingredients.  Ask a grown-up to preheat the oven to 200C/400F/Gas 5. Oil a mini-muffin tray using the pastry brush and vegetable oil.  ", "Break the egg into a bowl and beat it with the fork, then add the polenta.  This allows the polenta to soften slightly before cooking.  ", "Ask a grown-up to help you to snip the spinach leaves into small pieces using scissors. ", "Add the cottage cheese, chilli powder and black pepper to the mixing bowl.  Then stir in the egg and polenta mixture. Sprinkle the plain flour over the mixture and stir again until it is thoroughly combined  ", "Divide the mixture equally between the six parts of the muffin tin.  Bake for 12-15 minutes or until they are brown on top. Leave to cool. Serve one or two of these little savoury cakes with ham."]}, {"isVegetarian": true, "title": "Mini chestnut, apple and spinach Wellingtons", "url": "www_bbc_co_uk_food_recipes_mini_chestnut_apple_and_65851", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_chestnut_apple_and_65851_16x9.jpg", "ingredients": ["300g/10½oz cranberries", "2 Granny Smith apples, peeled, cored and cut into small cubes", "175g/6oz pitted Medjool dates, finely chopped", "2 tsp ground cinnamon", "2 oranges, finely grated zest and juice only", "2 tbsp balsamic vinegar", "sea salt and freshly ground black pepper", "225g/8oz plain or wholemeal spelt flour, plus extra for dusting", "75g/2½oz unsalted butter", "1 free-range egg", "pinch of salt", "1 tbsp of olive oil", "75g/2½oz peeled butternut squash and/or sweet potato, cut into small cubes", "1 small onion, finely chopped", "1 sprig thyme, leaves picked", "1 garlic clove, finely chopped", "75g/2½oz baby spinach", "300g/10½oz tinned Puy or green lentils, drained", "75g/2½oz cooked chestnuts, finely chopped (tinned is fine)", "25g/1oz toasted pine nuts", "1 red/green small apple, peeled, cored and very finely chopped", "large pinch freshly grated nutmeg", "1-2 tsp ground cinnamon", "½ tsp paprika (optional)", "1 free-range egg, beaten", "salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the sauce, stir all of the ingredients, including some salt and pepper, together in a medium pan. Add 100ml/3½fl oz water and bring to the boil. Reduce the heat and simmer for about 10 minutes, stirring occasionally, until the cranberries have burst and softened and the apples and dates have cooked down to give a chunky sauce.", "Remove from the heat and serve warm or cold. This will keep in an airtight container in the fridge for up to a month.", "For the pastry, place all the ingredients in a food processor and whizz them together until they start to form a smooth ball of dough. If using plain spelt flour, add 3 tablespoons water to help bring it together. If using wholemeal flour, you will need to add a further 1-2 tablespoons water. Alternatively, to make by hand, rub the flour into butter until the mixture resembles breadcrumbs. Lightly beat the egg in a small bowl and stir into the crumbs really well using a table knife until lumps start to form. Add the water (as above) to bring it together.", "Wrap the pastry in cling film and chill in the fridge for 30 minutes.", "For the mini Wellingtons, heat the oil in a large frying pan over a low-medium heat. Add the squash and/or sweet potato, onion and thyme leaves and cook for about 15 minutes, stirring from time to time, until the squash is tender.", "While this is cooking, lightly dust a work surface with flour and roll out the pastry to a 36cm/14in square, roughly 1mm thick (or as thin as you can get it). Make sure the edges are straight and neat, trimming them with a knife if necessary. Cut this square into quarters and arrange the 4 squares on a large baking tray lined with baking parchment (or double them up with parchment between each pair if the tray isn’t large enough). Cover with cling film and refrigerate for about 10 minutes.", "Once the vegetables are cooked, add the garlic and cook for a minute more, then tip the mixture into a large bowl. Return the pan to the heat, add half the spinach along with 1 tablespoon water. Cook for 1-2 minutes while stirring, until just wilted. Tip into a colander in the sink, then repeat with the remaining half of spinach. Rinse the whole lot under cold water until cool enough to handle, then picking up handfuls at a time, squeeze as much water out of the spinach as possible and add it to the vegetable mixture.", "Add the lentils, chestnuts, pine nuts, apple, nutmeg and cinnamon. Add the paprika if you fancy it – I love paprika in pretty much everything. Stir together well and then season, to taste, with salt and pepper", "Divide the filling mixture evenly among the 4 squares of pastry, spooning it into the middle of each. Allow a border of about 2cm/¾in around the mixture and brush with beaten egg (reserve the remaining egg). Fold 2 opposite corners of the pastry inwards to meet each other in the middle. Then fold the other opposite corners into the centre also, but just overlapping the first bit of pastry so they stick securely to form a pouch. Flip them over so the sealed side is down and use a small, sharp knife to slash the tops with 3 ‘cuts’. Lay them out in a single layer on a baking tray and pop them back in the fridge for 10 minutes to firm up.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Remove the Wellingtons from the fridge and brush the tops and sides with the remaining egg. Bake for 25-30 minutes or until the pastry is cooked and golden-brown and the filling is piping hot. Remove from the oven and serve with salad leaves."]}, {"isVegetarian": true, "title": "Mini coffee and walnut cakes", "url": "www_bbc_co_uk_food_recipes_mini_coffee_and_walnut_12591", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_coffee_and_walnut_12591_16x9.jpg", "ingredients": ["150g/5½oz butter, softened", "150g/5½oz light muscovado sugar", "3 large free-range eggs", "150g/5½oz self-raising flour", "1 level tsp baking powder", "1 tbsp coffee essence", "75g/2½oz chopped walnuts", "150g/5½oz butter, softened", "450g/1lb icing sugar, sifted", "2 tbsp milk", "1 tbsp coffee essence", "200g/7oz walnut halves, finely chopped", "16 chocolate-covered coffee beans"], "serves": "Makes 16 mini cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C(fan)/375F/Gas 5. Grease a 16-cup mini cake tin and line with baking parchment, or, alternatively, grease 16 chefs’ rings (5cm/2in diameter) and place them on a baking tray lined with baking parchment. ", "For the cakes, place the butter, sugar, eggs, flour, baking powder and coffee essence into a bowl and beat with a wooden spoon until thoroughly blended and smooth. Fold in the walnuts. ", "Divide or pipe the mixture equally between the mini cake tins. Bake for about 12-15 minutes, or until well-risen and the top of the cake springs back when lightly pressed with a finger. ", "Leave to cool in the tins for a few minutes.  When cool enough to handle, turn the cakes out of the tins and remove the parchment. Leave to cool completely on a wire rack. ", "For the filling and decoration, beat together the butter, icing sugar, milk and coffee essence in a bowl until smooth. ", "When the cakes are completely cold, trim the tops if domed. Slice in half horizontally, then sandwich them together with about a quarter of the buttercream. ", "Spread a thin coating of buttercream around the sides of each cake and then roll the sides in chopped walnuts. ", "Spoon the remaining buttercream into a piping bag fitted with a small star (2D) nozzle and pipe a rose on the top of each cake. Place a chocolate-covered coffee bean over the joins.", "Arrange the cupcakes on the nicest cake stand you have and serve.  "]}, {"isVegetarian": true, "title": "Mini fruit tarts", "url": "www_bbc_co_uk_food_recipes_mini_fruit_tarts_30208", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour", "75g/2½oz softened butter, cubed", "75g/2½oz caster sugar", "3 medium egg yolks", "400ml/14fl oz double cream", "1 tsp vanilla bean paste", "1 tbsp icing sugar, sifted", "3 tbsp apricot jam ", "3 punnets raspberries"], "serves": "Makes 12 small tartlets", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pâte sucrée, measure the flour into a bowl.  Rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Stir in the sugar, then add the egg yolks and mix until the ingredients come together to form a dough. Knead the mixture gently until smooth. ", "Wrap the dough in cling film and leave to rest in the fridge for about 30 minutes. ", "Preheat the oven to 190C/Fan 170C/Gas 5. ", "Meanwhile, make the glaze to finish the tarts later. Warm the apricot jam in a saucepan, then pass through a sieve into a bowl.  Add a splash of water if needed to make the glaze runny.  Set aside.", "Roll out the chilled pastry onto a lightly floured work surface and cut out about 12 rounds using a 7.5cm/3in round pastry cutter (preferably with smooth, rather than crimped edges). Any leftover pastry can be re-rolled once only.  ", "Ease the pastry rounds into the bun tin and prick the bases lightly using a fork. Cut twelve 10cm/4in square pieces of baking parchment and use them to line each pastry case (you will find the parchment sits better if you screw it up first). Fill each pastry case with uncooked lentils or rice (baking beans will be too large for the tins). ", "Bake the pastry cases for about 15 minutes, or until golden-brown. Allow to cool for a few minutes in the tin, then turn them out onto a wire rack. Remove the paper and lentils/rice, and leave to cool completely. ", "To make the filling, whip the cream, sugar and vanilla until it forms soft peaks when the whisk is removed. ", "To serve, spoon a little filling into each tartlet case. Arrange the raspberries on top and brush the jam liberally over the fruits to glaze.  "]}, {"isVegetarian": true, "title": "Mini cranberry panettones", "url": "www_bbc_co_uk_food_recipes_mini_cranberry_94888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz butter, softened, plus extra for greasing", "50g/1¾oz candied peel", "100g/3½oz golden sultanas", "100g/3½oz dried cranberries", "2 tbsp spiced rum", "425g/15oz strong white bread flour, plus extra for dusting", "60g/2¼oz caster sugar", "1 tsp salt", "18g fresh yeast", "160ml/5¼fl oz tepid water", "3 free-range eggs, 2 left whole and 1 beaten for egg wash", "1 orange, zest only", "500ml/18fl oz double cream", "125g/4½oz soft light brown sugar", "5 tbsp rum"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the panettone, grease a 12-hole, deep-sided muffin tin with butter. ", "In a bowl, mix the candied peel, sultanas and cranberries with the spiced rum until combined. Set aside.", "Add the flour, sugar and salt to the bowl of a food mixer. Whisk the yeast with a little of the water in a separate bowl until dissolved. Add the yeast mixture to the flour, then add the remaining water and the whole eggs and beat until the mixture comes together as a dough. (This can also be done by hand or using a hand-held electric whisk.)", "Beat in the butter a little at a time, then add the orange zest and continue to beat for 4-5 minutes, or until the dough is smooth. ", "Set the dough aside, covered, in its bowl, to prove for about 1 hour, or until it has doubled in size. ", "Knock back the dough, sprinkle over the dried fruit, then knead the fruit into the dough, either in the bowl, or on a lightly floured work surface (it will feel very sticky).", "Roll the dough into a ball and cut it into 10-12 equal-sized pieces. Roll each piece into a ball on a lightly floured work surface. Place one into each hole of the muffin tin. Cover the tin with cling film then set aside to prove again for about 45 minutes, until risen.", "Preheat the oven to 190C/170C Fan/Gas 5.", "Brush the top of the risen panettone dough with the egg wash, then bake in the oven for 18-20 minutes, or until golden-brown and risen. Remove from the tin and set aside to cool on a wire rack.", "For the rum butter, beat the double cream in the bowl of a free-standing food mixer for 3-5 minutes, or until it turns to solid fatty lumps with a liquid base. Cover the mixer with a clean tea towel or muslin cloth halfway through beating, because the liquid will spatter everywhere as it starts to separate!", "Line a large bowl with the same tea towel or muslin, then tip in the mixture. Bring the cloth together at the edges to encase the solid butter and squeeze out all the liquid. Discard the liquid.", "Tip the butter back into the bowl and beat in the soft light brown sugar for 3-4 minutes, or until pale and fluffy, adding the rum a little at a time.", "Spoon the rum butter into sterilised jars and seal. Chill in the fridge or freeze until needed, or serve immediately alongside the warm panettones."]}, {"isVegetarian": true, "title": "Mini lemon and thyme drizzle cakes", "url": "www_bbc_co_uk_food_recipes_mini_lemon_and_thyme_47253", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "2 large unwaxed lemons, zest and juice", "110g/4oz unsalted butter ", "175g/6oz caster sugar", "1 tsp cornflour", "cake release spray or butter, for greasing", "175g/6oz baking spread ", "175g/6oz caster sugar", "3 medium free-range eggs", "175g/6oz plain flour", "pinch salt", "1½ tsp baking powder ", "1 tbsp finely chopped lemon thyme leaves", "½ lemon, zest only ", "100g/3½oz caster sugar", "few sprigs fresh lemon thyme, leaves picked ", "1½ lemons, zest and juice only", "35g/1¼oz caster sugar", "1 unwaxed lemon, zest only", "12 candied lemon slices", "thyme leaves, for decoration", "50g/1¾oz unsalted butter, softened", "50g/1¾oz icing sugar", "100g/3½oz mascarpone cheese", "100ml/3½fl oz double cream, whipped"], "serves": "Makes 12 mini cakes", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the lemon curd, whisk the eggs together in a small saucepan. Add the lemon zest, lemon juice, butter, sugar and cornflour. Stir over a low heat until the curd thickens. Pour into a bowl and then chill in the fridge.", "For the sponge, preheat the oven to 180C/350F/Gas 4. Spray the muffin tin with cake release spray or grease with butter. Line the bottom of the trays with small circles of baking parchment.", "Put the baking spread and sugar in a freestanding mixer and cream together until smooth and pale. Mix in the eggs, then fold in the flour, salt, baking powder, thyme and lemon zest. ", "Fill each hole of the muffin tin until three-quarters full (it’s easiest to use an ice cream scoop, if you have one). Bake for 15-20 minutes, or until golden-brown and springy to the touch. ", "Allow the cakes to cool in the tins, then remove and place on wire racks to cool completely.", "For the syrup, heat the caster sugar, thyme, lemon zest and juice in a small saucepan until the sugar is dissolved and a syrup forms. ", "Using a fork or skewer, pierce the sponges then use a pastry brush to brush the warm syrup over the cakes. ", "For the topping, mix any remaining syrup with the sugar and lemon zest. Drizzle it over the tops of the mini cakes to create the classic lemon drizzle topping. ", "For the filling, use an electric whisk to cream the butter and sugar together. Stir in the mascarpone and then fold in the whipped cream. Spoon the filling into a piping fitted with a small round nozzle.", "Slice the cakes in half and pipe small rounds on top of the bottom half of each cake. Spread the lemon curd on the top halves and then place on top of the creamed bases. ", "Top with the candied lemon slices and a few thyme leaves and arrange on a serving plate or cake stand."]}, {"isVegetarian": true, "title": "Mini meringue nests with pistachios and raspberries", "url": "www_bbc_co_uk_food_recipes_mini_meringue_nests_with_63500", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg whites", "1 tsp lemon juice", "150g/5½oz caster sugar", "115g/4oz unsalted pistachios, blended to a fine powder", "115g/4oz white chocolate with dried raspberries, melted", "142ml/¼ pint double cream", "115g/4oz white chocolate, shaved with a knife", "12 fresh raspberries", "12 small mint leaves"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/225F/Gas ¼. Line a baking tray with greaseproof paper.", "Whisk the egg whites and lemon juice in a bowl until they form stiff peaks, then fold in the sugar and pistachios. Spoon the mixture into a piping bag fitted with a plain nozzle and pipe small nests onto the baking tray. Bake in the oven for two hours, lthen remove from the oven and set aside to cool completely. Carefully remove the meringues from the paper.", "Spoon the melted chocolate into the meringue nests. Whip the cream in a bowl until stiff peaks form when the whisk is removed. Spoon the cream into a piping bag fitted with a small nozzle and pipe into the middle of the nests.", "Shave the white chocolate over the nests and decorate each one with a raspberry and a mint leaf."]}, {"isVegetarian": true, "title": "Mini pear pies", "url": "www_bbc_co_uk_food_recipes_mini_pear_pies_77186", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_pear_pies_77186_16x9.jpg", "ingredients": ["200g/7oz plain flour, plus extra for rolling", "100g/3½oz butter, in a block, frozen", "100g/3½oz lard, in a block, frozen", "1 free-range egg, beaten", "2 tbsp granulated sugar", "6 large, firm pears (preferably ones that are straight and tall)", "300g/10½oz caster sugar", "500ml/18fl oz dry white wine", "2 cinnamon sticks", "1 orange, zest only"], "serves": "Makes 6 pies", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, measure the flour into a bowl and grate the butter and lard into the flour.  Use a knife to coat the butter and lard in the flour. Add 120-150ml/4-5fl oz cold water and mix until it comes together to form a firm dough.", "Roll out the pastry on a floured work surface to a rectangle. Fold the top third down and then fold the bottom third up and over. Turn it 90 degrees (a quarter turn) and repeat the rolling and folding. Set aside, covered, in the fridge for 20 minutes. ", "Repeat the rolling, folding and chilling twice more so you have a total of four folds and turns. Set aside, wrapped in cling film, in the fridge until ready to use.", "Meanwhile, for the poached pears, peel the pears, keeping the stems intact. Tip the caster sugar into a large saucepan with 400ml/14fl oz water, the white wine, cinnamon and orange zest and slowly bring to the boil, stirring until the sugar is dissolved.  Boil for three minutes.", "Add the pears to the pan.  Bring back to the boil, reduce the heat to a simmer and cook for 15 minutes. Reserving the syrup, remove the pears from the pan with a slotted spoon and set aside to cool on kitchen paper. Using a melon baller or small teaspoon remove the core from the pears.", "Return the syrup to the heat and boil rapidly for 10-15 minutes until the volume of the liquid is reduced by half and the syrup is thick. Remove from the heat and set aside to cool.", "When the fruit and syrup are cool, roll out the chilled pastry to a rectangle measuring 60x20cm/23½x8in and a thickness of no more than 5mm/¼in.  ", "Using a sharp knife and a ruler cut the pastry into long strips 8mm/⅓in wide. You will need about 18-20 strips. ", "Brush the pears with the cooled sugar syrup and starting from the bottom, wrap the pastry strips around the pears. When you come to the end of the pastry strip, brush the end lightly with syrup and press to adhere to the next pastry strip. Continue wrapping until you reach the top of the pear. (Three strips should cover each pear). Tuck the end of the last pastry piece behind the previous dough spiral. ", "Cut out six leaf shapes from the remaining pastry.  Draw veins on the leaves with a sharp knife and stick one leaf below the stem of each pastry pear, with a little sugar syrup. ", "Preheat the oven to 200C/180C(Fan)/400F/Gas 6.  Place the pastry covered pears on a baking tray.  Brush the pastry with beaten egg and sprinkle with the granulated sugar. Bake for 25-30 minutes.  ", "Remove from the oven and leave to cool for 10-15 minutes then serve with a drizzle of the reduced sugar syrup. "]}, {"isVegetarian": true, "title": "Mini pavlovas with vanilla cream and strawberry sauce", "url": "www_bbc_co_uk_food_recipes_mini_pavlovas_with_63854", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 medium free-range egg whites", "300g/10½oz caster sugar", "1 tsp cornflour", "1 tsp white wine vinegar", "400ml/14fl oz double cream", "1 vanilla pod, seeds only", "500g/1lb 2oz strawberries, hulled", "1-2 tbsp icing sugar, to taste", "1 lemon, juice only", "200g/7oz strawberries, hulled and cut into quarters", "200g/7oz raspberries", "2 sprigs fresh mint, leaves picked", "2 tbsp icing sugar"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 125C/250F/Gas ½.", "For the mini pavlovas, place the egg whites in the bowl of a large food processor with a whisk attachment (make sure the bowl is scrupulously clean). Whisk until soft peaks form when the whisk is removed. Gradually whisk in the sugar until the egg whites are firm. Fold in the cornflour and vinegar.", "Spoon the meringue into small nest shapes and place in the oven for 10 minutes. Reduce the heat to 100C/200F/Gas ¼ and cook for an hour. Leave in the oven overnight to cool completely.", "For the vanilla cream, place the cream and vanilla seeds in a large bowl and whisk until soft peaks form when the whisk is removed. Set aside.", "For the strawberry sauce, place the strawberries into a food processor with the icing sugar and lemon juice. Blend to a purée and then pass through a fine sieve.", "To serve, put the quartered strawberries in a bowl and stir in the strawberry sauce. Place the meringue nests onto serving plates and spoon the cream on top. Top with the strawberries in the sauce along with some fresh raspberries. Garnish with mint leaves and a dusting of icing sugar."]}, {"isVegetarian": false, "title": "Mini pizza flyers", "url": "www_bbc_co_uk_food_recipes_mini_pizza_flyers_02035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large white tortilla flatbread", "30g/1oz tomato passata", "Selection of toppings such as fresh basil, sliced peppers and shredded cooked chicken", "30g/1oz mature cheddar, grated "], "serves": "Makes 6 mini pizzas", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Use a 7cm/2¾in cookie cutter to cut six small circles out of the wrap and place on a baking tray.", "Spoon a teaspoon of passata onto each circle and spread it to the edge. Sprinkle over some toppings and top with some grated cheese.", "Bake in the oven for 10-15 minutes or until the cheese is melted and golden-brown."]}, {"isVegetarian": false, "title": "Black pudding sausage rolls", "url": "www_bbc_co_uk_food_recipes_mini_sausage_plaits_04508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_sausage_plaits_04508_16x9.jpg", "ingredients": ["600g/1lb 5oz plain flour\t", "pinch salt", "300g/10½oz butter, 100g/3½oz chilled and cut into cubes, 200g/7oz frozen", "300g/10½oz chestnut mushrooms, trimmed", "2 tbsp thyme leaves", "1 tbsp sunflower oil", "25g/1oz unsalted butter", "2 red onions, thinly sliced", "2 tsp soft brown sugar", "1 tbsp sherry vinegar", "300g/10½oz good-quality sausage meat", "100g/3½oz black pudding, cut into 2cm/1in pieces", "1 free-range egg, beaten, to glaze", "1 tbsp sesame seeds"], "serves": "Makes 12 sausage plaits", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the shortcut puff pastry, mix the flour and salt together in a bowl. Rub in the chilled butter using your fingertips until the mixture resembles breadcrumbs. Gradually add enough water to form a dough (about 4-6 tablespoons of water).", "Roll the dough out into a rectangle on a lightly floured work surface.", "Coarsely grate the frozen butter over the bottom two-thirds of the dough. Fold down the top third and fold up the bottom third as if folding a letter.", "Turn the folded dough 90 degrees on the work surface and roll out into a rectangle again.", "Fold again in thirds, wrap the dough in cling film and set aside to rest in the fridge for 30 minutes. Repeat the rolling, folding and turning process a further two times, chilling in between each turn. In total you will have done four turns. Rest the pastry in the fridge while you make the filling.", "Preheat the oven to 200C/400F/Gas 6. ", "For the filling, put the mushrooms in a food processor and season with salt and pepper. Pulse until the mushrooms are broken down to a rough paste. Add the thyme and give the mix a final pulse.", "Put the mushroom mixture into a dry frying pan set over a medium-high heat and cook, stirring often, until all the moisture has evaporated from the mushrooms.  Remove from the pan and leave to cool.", "Meanwhile, using the same pan, heat the oil and butter over a medium-low heat. Add the onions and sugar and cook slowly until the onions are very soft and sweet. This will take at least 20 minutes. Once caramelised, stir in the sherry vinegar.", "To assemble, roll out the pastry into a 60x45cm/24x18in rectangle, and cut into 12 squares.  ", "Divide the mushroom mixture into 12 portions and spread a portion down the centre of each square of pastry, leaving a 2cm/1in gap at the top and bottom.", "In a bowl, mix the sausage meat with the black pudding and mould into 12 sausage shapes. Place on top of the mushroom paste and then spread the caramelised onions on top of each sausage.", "Make two small diagonal cuts from each corner of the pastry, to remove a small triangle. Then fold the top and bottom 'wings' over the ends of the sausage meat. Cut a 1cm/½in fringe all the way down the pastry on each side of the filling. Bring one strip over the filling from one side, then one from the other and so on, crossing the strips over to form a plaited effect. Tuck the ends of the pastry under the plait, trimming off any excess if necessary. ", "Repeat with the remaining squares of pastry until you have 12 mini sausage plaits.  Place the plaits on a baking tray, brush with beaten egg and sprinkle with sesame seeds. ", "Bake for 20 minutes, until the pastry is golden-brown. Leave to cool for five minutes or so, then serve hot or cold."]}]