[{"isVegetarian": true, "title": "Watermelon ice lollies", "url": "www_bbc_co_uk_food_recipes_watermelonicelollies_89302", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/watermelonicelollies_89302_16x9.jpg", "ingredients": ["125g/4oz caster sugar", "125ml/4oz water", "1 vanilla pod, seeds only", "600ml/1 pint watermelon juice (made from the flesh of 1 watermelon, seeds removed, blended and sieved)", "4 limes, juice only"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar, water and vanilla seeds into a pan over a medium heat. Heat until the sugar dissolves, then remove from the heat and allow to cool.", "Transfer to the fridge and chill until very cold.", "Add the watermelon juice and lime juice and mix well.", "Pour the fruit mixture into eight ice lolly moulds and place into the freezer overnight until frozen."]}, {"isVegetarian": true, "title": "Watermelon sorbet with rosewater gulab jamun and marinated watermelon wedges", "url": "www_bbc_co_uk_food_recipes_watermelonsorbetwith_86357", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2lb10oz watermelon flesh", "200g /7oz caster sugar", "2 lemons, juice only", "200g/7oz strawberries, quartered", "225g/8oz powdered milk", "50g/2oz plain flour", "1¼tsp baking powder", "½tsp bicarbonate of soda", "175ml/6fl oz double cream", "25g/1oz melted butter", "75ml/3fl oz water", "200g/7oz caster sugar", "1 tsp rosewater", "4 sprigs of mint, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sorbet, roughly chop one kilogram (2lb 2oz) of the watermelon and place into a food processor with the sugar and lemon juice. Blend until smooth.", "Strain through a sieve into an ice cream machine and churn until frozen.", "Cut the remaining watermelon into thin wedges and set aside.", "For the gulab jamun, preheat a deep fat fryer to 170C/350F.", "Place the powdered milk, flour, baking powder and bicarbonate of soda into a bowl and mix to combine. Add half the cream and mix well.", "Add the butter and as much of the remaining cream as necessary to form a soft and slightly sticky dough.", "Form the dough into small balls and place in the deep fat fryer. Fry for 2-3 minutes until golden and cooked through.", "Remove with a slotted spoon and drain on kitchen paper.", "Meanwhile, make the syrup. Place the water, sugar and rosewater into a pan and bring to a boil. Reduce the heat and simmer for 1-2 minutes. ", "Divide the syrup between two bowls. Place the fried jamun into one of the bowls and toss to cover with the syrup. Leave to absorb the syrup for 10 minutes.", "Pour the remaining syrup over the reserved watermelon slices and the strawberry quarters and leave for 10 minutes.", "To serve, place several slices of watermelon in the centre of a serving plate, then scatter with some of the strawberries. Top with a few gulab jamun and a scoop of watermelon sorbet. Garnish with a sprig of fresh mint."]}, {"isVegetarian": false, "title": "Weeping lamb with boulangère potatoes and mint sauce", "url": "www_bbc_co_uk_food_recipes_weeping_lamb_with_79676", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.7kg/6lb leg of lamb", "3 stems rosemary", "3-4 garlic cloves, cut into slivers ", "6 large potatoes, peeled and sliced thinly", "4 onions, sliced thinly", "sea salt and freshly ground black pepper", "25g/1oz butter, plus a little extra for the gravy", "500ml/18fl oz chicken stock", "1 bottle (750ml/26fl oz) good red wine ", "1 litre/1¾ pints beef stock ", "75ml/3fl oz malt vinegar", "1 pinch caster sugar", "1 large bunch mint leaves, finely chopped", "salt"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Using a small sharp pointed knife, make a series of small deep slits about 4cm/1½in apart all over the leg of lamb. Into each cut insert a sliver of garlic and a small sprig of rosemary, pressing them right down inside.", "Drizzle with the olive oil and a good sprinkling of salt, then set aside while you build the potato dish.", "Layer the potatoes and onions in a large ovenproof tray, seasoning each layer with salt and black pepper, and finishing with a layer of potatoes.", "Dot with butter, then pour over the stock and press down lightly.", "Put the roasting dish into the bottom of the oven, and place the lamb on a small wire rack on the oven rack directly above the potatoes (so that any juices from the lamb will ‘weep’ onto the potatoes below).", "Leave to roast for 1½ hours, or until the potatoes are cooked through, pressing the potatoes down into the cooking liquid every 30 minutes as it cooks.", "Pour the red wine and beef stock into a sauté pan or large frying pan and set over a medium heat, bring to the boil and cook for 30-45 minutes, or until reduced to a quarter of the original volume and is thickened to make a glossy gravy.", "Add a little knob of butter and check the seasoning.", "Remove the lamb from the oven when cooked to your liking and let it rest for 15 minutes before carving.", "Meanwhile heat the malt vinegar, sugar and a pinch of salt in a clean pan until just simmering, then add the mint and stir until wilted.", "To serve, carve the lamb and serve with the potatoes, gravy and mint sauce."]}, {"isVegetarian": false, "title": "Weeping lamb with boulangere potatoes", "url": "www_bbc_co_uk_food_recipes_weepinglambwithboula_83920", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.7kg/6lb leg of lamb", "50g/2oz butter, softened", "3 stems rosemary", "3-4 cloves garlic, cut into slivers ", "50ml/1¾fl oz olive oil", "6 potatoes, peeled and sliced thinly", "4 onions, sliced thinly", "salt and black pepper", "450ml/16fl oz chicken or lamb stock", "300g/11oz mixed salad leaves", "1 lemon, juiced"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 230C/450F/Gas 8.", "Rub the meat with softened butter and place it in a roasting tin. ", "Using a small, sharp, pointed knife make a series of small deep slits about 4cm (1½in) apart all over the leg of lamb, inserting a sliver of garlic and a small sprig of rosemary in each slit.", "Pour a tablespoon or so of the olive oil over the meat and cook for about 30 minutes.", "While the meat is cooking, place the potatoes and onions in a bowl, toss together and season. ", "After 30 minutes, take the meat from the oven and lift it out of the tin.", "Layer the potatoes and onions into the fat in the tin and pour over the stock. ", "Return the roasting tin to the low shelf and place the lamb directly on the shelf immediately above - so that the juices will 'weep' onto the potatoes.", "Roast for about another hour depending on how well you like your meat cooked. ", "Dress the salad leaves with the lemon and remaining olive oil, then season with salt and pepper.", "Carve the lamb and serve with the potatoes and salad."]}, {"isVegetarian": false, "title": "Weeping lamb", "url": "www_bbc_co_uk_food_recipes_weepinglamb_67701", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.7kg/6lb leg of lamb", "olive oil", "55g/2oz butter softened", "3-4 cloves garlic, cut into slivers ", "6 potatoes", "4 onions", "455ml/16 fl oz chicken or lamb stock", "sprigs rosemary", "salt and black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/ 450F/Gas 8.", "Using a small sharp pointed knife make a series of small deep slits about 1½ inches apart all over the leg of lamb and insert a sliver of garlic and a small sprig of rosemary.", "Rub the meat with softened butter and place it in a roasting tin. Pour over some olive oil and cook for about 30 minutes.", "While the meat is cooking, peel and finely slice the potatoes and onions. Mix them together in a bowl and season. ", "After the first half-hour, take the meat from the oven and lift it out of the tin. ", "Layer the potatoes and onions in the fat and pour over the stock. Return the roasting tin to the low shelf and place the lamb on the shelf immediately above - so that the juices will 'weep' onto the potatoes.", "Roast for about another hour depending on how well you like your meat cooked. Serve with a dressed green salad."]}, {"isVegetarian": false, "title": "Weeping tiger fillet steak with noodles and shrimps", "url": "www_bbc_co_uk_food_recipes_weeping_tiger_fillet_47152", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp Thai fish sauce", "1 tbsp dark soy sauce", "2 tsp dark brown soft sugar", "2 garlic cloves, crushed", "¼ tsp ground coriander", "¼ tsp ground black pepper", "2 x 175g/6oz fillet steaks", "groundnut oil, for cooking", "2 tbsp rice wine vinegar", "1 tablespoon lime juice", "2 tsp Thai fish sauce", "2 tsp light brown soft sugar", "1 tbsp chopped fresh coriander", "1 tsp tamarind paste", "1 red chilli, finely chopped", "150g/5½oz dried egg noodles", "2 tbsp sesame oil", "1 tbsp groundnut oil", "1 tbsp chopped red chilli", "150g/5½oz cooked shrimps", "1 tbsp chopped fresh coriander", "2 spring onions, thinly sliced", "1 tbsp light soy sauce", "pinch sea salt", "pinch ground ginger"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the steak ingredients except the meat and oil together in a bowl until the sugar has dissolved.", "Place the steak in a sealable bag, add the marinade and gently massage it into the meat. Seal the bag with no air inside it and leave to marinate in the fridge for 6–8 hours. ", "To make the dressing, warm the vinegar, lime juice and fish sauce in a small saucepan over a low heat. Add the sugar and stir until dissolved, then stir in the coriander, tamarind paste and red chilli. ", "Half an hour before cooking, remove the steak from the bag and pat it dry with kitchen paper. ", "Place a griddle pan over a high heat and carefully rub it with groundnut oil using kitchen paper. Cook the steak for 2 minutes on each side, then turn it and cook for another minute, or until browned. Remove it from the pan and leave it to rest for 10 minutes. ", "Meanwhile, cook the noodles in a saucepan of boiling water for 2 minutes, then drain and set aside. Heat the sesame and groundnut oils in a large frying pan over a medium heat. Add the chilli and shrimps and cook for 3–4 minutes. Add the noodles, coriander and spring onions and stir in the soy sauce. Season with salt and ginger.", "To serve, place a twist of noodles on the plate. Slice the steak thinly and place it next to the noodles. Spoon some of the dressing over the noodles and serve. "]}, {"isVegetarian": true, "title": "Traditional Welsh cakes", "url": "www_bbc_co_uk_food_recipes_welsh_cakes_16706", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/welsh_cakes_16706_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "110g/4oz salted butter, diced", "85g/3oz caster sugar, plus extra for dusting", "handful of sultanas", "1 free-range egg, beaten", "milk, if needed", "extra butter, for greasing"], "serves": "Makes 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour into a bowl and add the diced butter. ", "Rub with your fingertips, or pulse in a food processor, until the mixture resembles breadcrumbs. ", "Add the sugar, sultanas and beaten egg and mix well to form a ball of dough, using a splash of milk if needed. ", "Roll the dough out on a floured board to a thickness of about 5mm/½in. ", "Cut into rounds with a 7.5–10cm/3-4in plain cutter.", "Rub a bakestone or heavy iron griddle with butter, wipe away the excess and place on the hob until it is heated through.", "Cook the Welsh cakes a few at a time for 2–3 minutes on each side, or until golden-brown. ", "Remove from the griddle and dust with caster sugar while still warm."]}, {"isVegetarian": true, "title": "Cherry and whiskey Welsh cakes", "url": "www_bbc_co_uk_food_recipes_welsh_cakes_28269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz dried cherries", "100ml/3½fl oz Welsh whiskey", "250g/9oz self-raising flour, plus extra for dusting", "50g/1¾oz caster sugar, plus extra for dusting", "125g/4½oz butter, chilled and cut into cubes", "1 tsp orange zest", "1 free-range egg, beaten", "lard or butter, for greasing"], "serves": "Makes 20  cakes", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the cherries in a small saucepan and pour over the whiskey. Heat until the whiskey starts to boil, then set aside to infuse for 1 hour.", "Put the flour, sugar and a pinch of salt in a bowl. Add the butter and rub it in using your fingertips until the mixture resembles fine breadcrumbs. Stir in the orange zest and the cherries, along with any whiskey that hasn’t been absorbed. Add the egg and cut it into the mixture using a knife – as soon as the mixture starts to come together as a dough, work it into a ball using your hands.", "Turn out the dough onto a lightly floured work surface and roll out to a thickness of about 5mm-1cm/¼-½in. Using a 6cm/2½in round cutter, cut out rounds of the dough. Reroll any leftover dough and repeat. The dough should yield around 20 cakes.", "Heat a flat griddle pan or heavy frying pan over a low-medium heat and lightly grease the surface with a little lard or butter. Cook the Welsh cakes in batches, for 2-3 minutes on each side, or until deep golden-brown and cooked through – do not have the heat too high or they will burn on the outside before they are cooked through. Cover a plate with caster sugar and coat the still hot Welsh cakes in the sugar. Serve warm or cold."]}, {"isVegetarian": false, "title": "Welsh rarebit", "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_12521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter", "20g/¾oz plain flour", "75ml/2½fl oz stout", "225g/8oz strong Cheddar, grated", "1½ tsp English mustard powder", "2 tsp Worcestershire sauce", "4 thick slices sourdough or other bread", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Melt the butter in a small pan over a medium heat. Add the flour and stir together, cooking for 1 minute.", "Whisk in the stout until there are no lumps. Add the cheese, a little at a time, stirring until it has melted into the sauce. Add the mustard powder and Worcestershire sauce and season to taste.", "Toast the bread and place on a baking tray. Top each slice of toast with a thick layer of the cheese mixture, ensuring it goes right to the edges. Place under the grill and cook until bubbling and golden."]}, {"isVegetarian": false, "title": "Welsh lamb in hay with tabbouleh salad", "url": "www_bbc_co_uk_food_recipes_welsh_lamb_in_hay_with_93565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/welsh_lamb_in_hay_with_93565_16x9.jpg", "ingredients": ["few handfuls of hay", "50ml/2fl oz vegetable oil", "4 sprigs rosemary", "1 garlic bulb, cut in half horizontally", "2 racks of lamb, cut into chops (to make 14-16 chops)", "salt and black pepper", "knob of butter", "250g/9oz bulgur wheat, soaked in cold water for 3-4 hours", "1-2 tbsp harissa paste", "100g/3½oz shelled almonds ", "4 apricots, stone removed and chopped", "100g/3½oz shelled pistachios", "1 large bunch fresh mint, chopped", "1 large bunch fresh flatleaf parsley, chopped", "1 pomegranate, seeds removed", "1 lemon, juice only", "salt and black pepper", "50ml/2fl oz olive oil"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place a large pan over a medium heat and put the hay in the bottom. Add the vegetable oil, rosemary and garlic. Top with the lamb chops and season with salt and freshly ground black pepper. Seal the pan tightly with aluminium foil and a lid (to prevent the smoke from escaping). Cook for 10-15 minutes, turning the lamb half way through. When cooked, add the butter to glaze the chops.", "For the salad, drain the bulgur wheat then just cover in boiling water and set aside for 10 minutes until all the liquid has been absorbed. Add the harissa paste and stir well. Stir through all the remaining ingredients and serve with the lamb chops."]}, {"isVegetarian": false, "title": "Welsh rarebit", "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_05821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter ", "25g/1oz plain flour ", "l00ml/3½fl oz strong, dark beer", "150g/5oz mature Cheddar cheese, grated", "1 free-range egg yolk", "1 tsp English mustard", "4 tsp Worcestershire sauce", "pinch cayenne pepper", "4 thick slices wholemeal or granary bread", "freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Melt the butter in a non-stick saucepan and stir in the flour. Cook over a low heat for 30 seconds, stirring constantly. Slowly add the beer. Simmer for 2-3 minutes, stirring constantly until the sauce is thick and smooth.", "Add the cheese, egg yolk, mustard, Worcestershire sauce and cayenne pepper, if using. Cook until the cheese melts, stirring constantly. Season with freshly ground black pepper and set aside to cool. ", "Place the bread on a baking tray lined with aluminium foil and toast on each side until golden-brown. Spread the cheese sauce thickly over the bread, making sure the slices are completely covered so the edges don’t burn.  Return to the grill for 20-30 seconds longer until lightly browned and bubbling. "]}, {"isVegetarian": false, "title": "Welsh rarebit", "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_29163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 tsp plain flour", "1 tsp mustard powder", "100ml/3½fl oz stout", "1 tsp Worcestershire sauce", "250g/9oz cheddar cheese, grated", "3 large egg yolks, beaten", "6 slices granary bread "], "serves": "Makes 6 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium heat.", "Melt the butter in a saucepan and whisk in the flour and mustard powder. Cook for a minute or two, then gradually add the stout and the Worcestershire sauce, stirring constantly until smooth. Bring to the boil and immediately reduce the heat. ", "Add the cheese and stir until it has melted. Remove from the heat and leave to cool a little. Add the egg yolks and mix well.", "Toast the bread, then arrange on a wire rack or baking tray. Spoon the sauce onto the toasted bread, spreading it out almost to the edges. Grill until browned and slightly puffed up. Serve immediately."]}, {"isVegetarian": false, "title": "Welsh rarebit with tomato and apple chutney", "url": "www_bbc_co_uk_food_recipes_welsh_rarebit_with_46839", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz caster sugar", "4 plum tomatoes, chopped", "2 tbsp sherry vinegar", "½ tsp dried chilli flakes", "50g/2oz apple, peeled, core removed, chopped", "2 sprigs fresh thyme, leaves only", "110g/4oz Ogleshield cheese, or similar firm cows' milk cheese", "110g/4oz cheddar cheese, grated", "50ml/2fl oz full-fat milk", "25g/1oz plain flour", "25g/1oz breadcrumbs", "dash Worcestershire sauce", "1 free-range egg", "1 free-range egg yolk", "½ tsp English mustard powder", "salt and freshly ground black pepper", "4 slices thick crusty white bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato chutney, heat a frying pan until hot, add the caster sugar and cook for 1-2 minutes, or until the sugar has melted and is pale golden-brown.", "Add the chopped tomatoes, vinegar, chilli flakes, apple and thyme and cook for 2-3 minutes. Season, to taste, with salt and freshly ground black pepper.", "For the Welsh rarebit, preheat the grill to high.", "Heat the cheese and milk in a saucepan, stirring regularly, until the cheese has melted.", "Add the flour and breadcrumbs and cook for a further 2-3 minutes stirring continuously. ", "Remove the pan from the heat and set aside to cool.", "Whisk in the Worcestershire sauce, egg, egg yolk and mustard. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, lightly toast the bread on one side. Spread the cheese mixture onto the un-toasted side of the bread and grill for 1-2 minutes, or until the cheese is bubbling and golden-brown. Serve the rarebit hot with the chutney."]}, {"isVegetarian": false, "title": "Welsh Black beef Wellington with goats' cheese, garlic and chervil mash and beer gravy", "url": "www_bbc_co_uk_food_recipes_welshblackbeefwellin_92243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz unsalted butter", "½ tbsp brown sugar", "4 onions, peeled, finely chopped", "1 tsp mustard powder", "250ml/9fl oz beef stock", "250ml/9fl oz strong beer or stout", "salt and freshly ground black pepper, to taste", "120g/4oz plain flour", "salt and freshly ground black pepper", "1 large free-range egg, beaten", "300ml/10½fl oz milk", "1 tbsp melted butter", "2 tsp chopped fresh parsley", "1 tsp chopped fresh thyme", "1 tsp chopped fresh chervil", "2-3 tbsp olive oil", "100g/3½oz unsalted butter", "3 shallots, peeled, finely chopped", "500g/17½oz mushrooms, finely chopped", "15g/½oz dried porcini mushrooms, soaked in hot water to soften", "1 tbsp double cream", "1 free-range egg white", "1 tbsp chopped fresh parsley ", "1kg/2lb 2oz beef fillet, centre cut (preferably Welsh Black beef)", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "1 packet ready-made puff pastry", "1 free-range egg, beaten", "2 tbsp melted butter", "2 garlic cloves, peeled, lightly crushed", "1kg/2lb 2oz floury potatoes, such as Maris Piper or King Edward, peeled, chopped", "salt and freshly ground white pepper.", "2 tbsp double cream", "100g/3½oz goats' cheese, cut into small cubes", "1 tbsp chopped fresh chervil", "50g/2oz butter", "2 shallots, peeled, finely chopped", "500g/17½oz broad beans, out of their pods, inner membranes removed, blanched", "150ml/5fl oz chicken stock", "4 heads Baby Gem lettuce, shredded"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the onion, beer and mustard gravy, melt the butter in a pan until foaming, then stir in the sugar. Add the finely chopped onions and cook over a low heat for 20-30 minutes, or until golden-brown and caramelised. ", "Stir in the mustard powder and pour in the stock and beer and simmer for 15-20 minutes, or until the liquid has reduced in volume by half. Season, to taste, with salt and freshly ground black pepper and keep warm. ", "For the pancakes, season the flour with salt and freshly ground black pepper and mix with the beaten egg until well combined. Gradually add the milk, whisking continuously, until the mixture comes together as a smooth batter with the consistency of double cream. Add the melted butter and beat until smooth. Stir in the chopped herbs and set aside to stand for 20 minutes. ", "Heat the olive oil in a non-stick pan and add a few tablespoons of the pancake batter, spreading it out into a circle. Cook for 1-2 minutes, or until golden-brown underneath, then carefully flip over and cook for a further 1-2 minutes, or until golden-brown all over and cooked through. Repeat with the remaining pancake mixture to make 2-3 pancakes, adding more oil to the pan as needed. ", "Cut the pancakes into squares, lay them flat on an oven tray lined with greaseproof paper and set aside. ", "For the duxelles, melt the butter in a frying pan until foaming, then add the shallots and fry for 3-4 minutes, or until softened. Add the mushrooms and cook with the lid on for 4-5 minutes, or until tender.", "Drain the soaked porcini mushrooms and finely chop, then add to the pan with the mushrooms. Stir in the cream and cook with the lid off for 4-5 minutes, or until most of the liquid has evaporated and the mixture is thick and creamy. ", "Set aside to cool. Once cooled, stir in the parsley and the egg white. Transfer the mixture to a food processor and blend until the mixture forms a coarse paste. ", "Spread the mushroom duxelles in an even layer over the pancakes, then cover the tray with cling film and chill in the fridge until the duxelles have set. ", "For the beef Wellington, preheat the oven to 180C/350F/Gas 4. ", "Season the beef with salt and freshly ground black pepper. Heat a frying pan until very hot, then add the vegetable oil. Sear the beef all over for 2-3 minutes, turning occasionally, until the beef is golden-brown all over. Set aside to cool. ", "Roll out the pastry to a 20cm x 30cm/8in x 10in rectangle and place the duxelles-lined pancakes over the pastry. Lay the seared beef fillet in the middle, then draw the pastry and pancakes over the beef, wrapping it completely. Seal the ends of the pastry with some of the beaten egg.", "Cut a few holes into the top of the pastry to allow steam to escape. Brush the pastry all over with the remaining beaten egg, then place the beef Wellington on a baking tray. Bake the Wellington in the oven for 25-30 minutes (for rare beef), or until the pastry is golden-brown and crisp. Keep warm. ", "For the goats' cheese, garlic and chervil mash, melt the butter in a pan and add the lightly crushed garlic. Remove from the heat and allow to infuse for 30 minutes. ", "Cook the potatoes in a pan of boiling salted water for 10-12 minutes, or until tender, then drain the potatoes and return to the pan. Place back over the heat to drive off any excess moisture, then mash with a potato masher until smooth. ", "Beat in the cream, goats' cheese and garlic-infused butter, then fold in the chopped chervil. Season, to taste, with salt and freshly ground black pepper. ", "For the broad beans, lettuce and shallots, melt the butter in a pan and fry the shallots for 3-4 minutes, or until softened. ", "Add the blanched broad beans and chicken stock to the pan and bring to a simmer. Stir the shredded Baby Gem lettuce into the pan and cook for 1-2 minutes, or until tender.  ", "To serve, thickly slice the beef Wellington and divide among serving plates. Spoon the goats' cheese, garlic and chervil mash alongside, followed by the broad beans, lettuce and shallots. Drizzle over the onion, beer and mustard gravy and serve immediately."]}, {"isVegetarian": true, "title": "Classic Welsh cakes", "url": "www_bbc_co_uk_food_recipes_welshcakes_67264", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/welshcakes_67264_16x9.jpg", "ingredients": ["225g/8oz self-raising flour, sieved", "110g/4oz (preferably Welsh) salted butter ", "1 free-range egg", "handful of sultanas ", "milk, if needed", "85g/3oz caster sugar", "extra butter, for greasing"], "serves": "Makes approx. 4-6 cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the fat into the sieved flour to make breadcrumbs. Add the sugar, dried fruit and then the egg. Mix to combine, then form a ball of dough, using a splash of milk if needed. ", "Roll out the pastry until it is a 5mm/¼in thick and cut into rounds with a 7.5-10cm/3-4in fluted cutter.  ", "You now need a bakestone or a heavy iron griddle. Rub it with butter and wipe the excess away. Put it on to a direct heat and wait until it heats up, place the Welsh cakes on the griddle, turning once. They need about 2-3 minutes each side. Each side needs to be caramel brown before turning although some people I know like them almost burnt.  ", "Remove from the pan and dust with caster sugar while still warm. Some people leave out the dried fruit, and split them when cool and sandwich them together with jam."]}, {"isVegetarian": false, "title": "Welsh cakes with roasted apricots and Welsh cake ice cream", "url": "www_bbc_co_uk_food_recipes_welshcakeswithroaste_82041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self-raising flour, plus extra for dusting", "½ tsp mixed spice", "pinch of salt", "85g/3oz caster sugar", "1 lemon, zest only", "115g/4oz butter ", "85g/3oz sultanas", "1 large free-range egg, beaten", "milk if needed", "lard, for greasing", "175g/6oz free-range egg yolks ", "90g/3½oz caster sugar", "375ml/13fl oz whipping cream ", "125ml/4fl oz milk", "1 vanilla pod, split lengthways and seeds scraped out", "ground cinnamon", "freshly grated nutmeg", "12 apricots, halved and stoned", "1 tbsp caster sugar", "knob of unsalted butter"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First make the Welsh cakes. Sift the flour, mixed spice and salt into a bowl and stir in the sugar and lemon zest. Rub in the butter until the mixture has a crumb-like texture. Add the sultanas and mix together, then mix in the beaten egg using a fork. Gather into a dough. If too dry add a dash of milk.", "Turn the dough onto a lightly floured board and roll out to about 5mm/¼in thick. Using a large side plate or a 10cm/4in round plain cutter, cut out four rounds. You also need to cut out four 2cm/1in rounds. Cut the remaining dough into rounds or other shapes of any size, re-rolling the trimmings as necessary (these cakes will be used for the ice cream).", "Lightly grease a griddle with lard, then heat on a low heat. Start with a cake or two for the ice cream to test the heat of the griddle. Lightly cook all the cakes for 20-30 seconds on each side or until golden brown. Leave to cool.", "To make the ice cream, beat together the eggs and sugar in a bowl until pale. Put the cream and milk in a saucepan and scrape in the seeds from the vanilla pod together with the pod. Heat until it just comes to the boil, then pour a little over the egg mixture and whisk together. ", "Pour this mixture into the rest of the hot cream mixture in the pan and cook, stirring, until thickened enough to coat the back of a wooden spoon. Take care not to let the custard boil. Remove from the pan and cool over ice, then strain.", "Churn the custard in an ice cream machine. Just as it is ready, sprinkle in 300g/10½oz of crumbled Welsh cakes and finish with ground cinnamon and nutmeg to taste. Transfer to a container and freeze for about two hours to harden.", "For the apricots, cook the apricots with the sugar and butter until soft. ", "To serve, spoon the warm apricots on top of the large Welsh cakes. Add a scoop of ice cream to each plate and garnish each with a small Welsh cake."]}, {"isVegetarian": false, "title": "Welsh rarebit with carrot chutney", "url": "www_bbc_co_uk_food_recipes_welshrarebitwithcarr_79156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 baby carrots, peeled and chopped", "2 tbsp vinegar", "2 tbsp soft brown sugar", "2 tbsp parsley, chopped", "¼ peach, chopped", "55g/2oz butter", "55g/2oz plain flour", "¼pint-½pint milk", "85g/3oz cheddar cheese, grated", "dash worchester sauce", "dash of Tabasco", "1 tsp mustard powder", "salt", "freshly ground black pepper", "2 slices of ciabatta/bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the chutney, heat the carrots in a small saucepan. Stir in the vinegar, sugar, parsley and peach pieces. Reduce the heat and simmer gently for 10-12 minutes, stirring occasionally. ", "For the rarebit, gently melt the butter in a pan. Stir in the flour to create a roux. Pour in the milk, and stir  continually to create a thick sauce. Remove from the heat and stir in the cheese until melted. ", "Add the Worcester sauce,  Tabasco, mustard powder and seasoning, and stir together, to create a thick, almost paste like mixture.", "Spread the rarebit mix onto the toasted bread and grill for 2-3 minutes, until golden. ", "Transfer to a serving plate and spoon the chutney on to serve."]}, {"isVegetarian": false, "title": "Wensleydale apple pie", "url": "www_bbc_co_uk_food_recipes_wensleydaleapplepie_83718", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4-5 large cooking apples", "100g/3½oz sugar", "1 tsp lard", "300g/10½oz shortcrust pastry ", "150g/5oz Wensleydale cheese, sliced", "whipped cream, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Peel the apples and slice thickly. ", "Place in a pan with two tablespoons of water and cook until softened - the apples need to retain their shape, but should be starting to fluff around the edges.", "Remove from heat and pour off any excess liquid. Add all but a teaspoon of the sugar to the apples and stir. Leave to cool.", "Grease a pie dish with lard. Roll out 200g/7oz of the pastry into a circle the shape of your pie dish, and then carefully line the dish with the pastry.", "Put half of the apple mixture into the pie dish and flatten. Arrange the slices of cheese on top. Place the remaining apples on top of the cheese.", "Roll out the rest of the pastry to the size of the pie dish. Dampen the edge of the pastry lining the pie dish with water. Cover with the prepared pastry lid. Press around the edges with the flat of your thumb to seal the pie. ", "Brush the top of the pie with water and sprinkle the remaining spoonful of sugar over the top.", "Cut two slits in the centre of the pie to allow steam to escape while the pie is cooking.", "Place in the bottom shelf of the oven and cook for around 35 minutes until golden brown - check the pie after 20 minutes and if it's getting too brown, reduce the temperature to 160C/300F/Gas 2). ", "Allow to cool and serve warm with whipped cream."]}, {"isVegetarian": false, "title": "Wensleydale mushrooms", "url": "www_bbc_co_uk_food_recipes_wensleydalemushrooms_83714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter ", "150g/5oz mushrooms, sliced", "3 rashers smoked bacon, chopped", "35g/1oz plain flour", "190ml/6½fl oz milk", "freshly ground black pepper", "150g/5oz Wensleydale cheese", "brown bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter over a medium heat, before adding the mushrooms and bacon.", "When the mushrooms and bacon are cooked through, add the flour and stir in well. Keep stirring for a further couple of minutes to cook the flour. ", "Remove from heat and pour in the milk and some freshly ground black pepper to taste.", "Preheat the grill to hot.", "Put the pan back onto the hob and stir continuously until boiling. Remove from heat and stir in three-quarters of the cheese.", "Divide the mixture into four ramekins, sprinkle over the remaining cheese and place under the hot grill until golden brown and bubbling. Serve with brown bread."]}, {"isVegetarian": false, "title": "Strawberry salad with a peppered Blackwater cheese basket", "url": "www_bbc_co_uk_food_recipes_wexfordstrawberrysal_83818", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz mature hard goats' cheese (such as Blackwater), grated ", "½ tsp cracked black pepper ", "2 tbsp olive oil", "2 slices streaky bacon, cut into 5mm/¼in thick slices", "1 garlic clove, finely sliced", "85g/3oz sourdough bread (or other bread of your choice), cut into 1cm/½in cubes", "220g/8oz soft goats' cheese (such as Mine Gabhar), cut into chunks ", "110g/4oz small strawberries, hulled and halved", "110g/4oz raspberries", "large handful fresh mixed summer herbs (e.g. chives, dill, mint and oregano)", "50g/2oz mixed baby salad leaves", "2-3 tbsp raspberry vinaigrette"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the cheese baskets, heat a non-stick frying pan until very hot. Sprinkle a quarter of the hard goats' cheese into the centre of the pan in a circle about 10cm/4in diameter. Sprinkle with some of the cracked black pepper and cook for 2-3 minutes until the fat starts to separate from the cheese and bubble. Remove from the heat and leave to cool for one minute.", "Using a spatula, remove the melted cheese disc from the pan. Shape the cheese disc into a basket around the end of a straight-sided tall glass and hold for 30 seconds to one minute, or until set hard enough to hold its shape. Transfer to a wire rack and allow to cool completely.", "Repeat with the remaining ingredients until you have four cheese baskets.", "Heat a frying pan until hot. Add the olive oil and bacon and fry for 1-2 minutes, until golden-brown.", "Add the garlic and the sourdough bread and stir-fry for 3-4 minutes until golden and crisp.", "To construct the salad, place the soft goats' cheese, strawberries, raspberries, herbs and mixed leaves into a bowl. Drizzle over enough of the raspberry vinaigrette to lightly coat the ingredients in the bowl.", "To serve, arrange the cheese baskets on serving plates and spoon in the dressed fruit and salad mixture. Garnish with the bacon and croutons."]}, {"isVegetarian": true, "title": "Wensleydale rarebit", "url": "www_bbc_co_uk_food_recipes_wensleydalerarebit_87211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz Wensleydale cheese, grated", "2 tbsp wholegrain mustard", "2 free-range egg yolks", "4 slices crusty bread", "chopped fresh parsley, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "Place the cheese, mustard and egg yolks into a small bowl and mix well.", "Place the bread slices onto a baking sheet and toast under the grill, turning once, until lightly golden-brown on both sides.", "Spread the cheese mixture onto one side of each slice of bread and place under the grill until golden-brown and bubbling.", "To serve, allow to cool slightly then place divide the rarebits between two serving plates and sprinkle with parsley."]}, {"isVegetarian": false, "title": "West country gratin", "url": "www_bbc_co_uk_food_recipes_west_country_gratin_08209", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/west_country_gratin_08209_16x9.jpg", "ingredients": ["250g/9oz potatoes, peeled and cut into 2.5cm/1in cubes ", "2 carrots, peeled and sliced into 7.5mm/⅜in thick rounds", "50g/1¾oz butter ", "1 leek, trimmed, cleaned and thinly sliced ", "200g/7oz cooking bacon pieces/diced cooking bacon, larger pieces cut into cubes", "50g/1¾oz plain flour  ", "200ml/7fl oz apple juice", "300ml/10½ml milk ", "salt and black pepper ", "1 bunch fresh thyme, leaves picked ", "2 tbsp olive oil "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a saucepan of boiling water, boil the potatoes for seven minutes, or until half cooked. Add the carrots and continue to boil for a further 7-8 minutes, or until both the carrots and potatoes are tender. Remove from the heat and drain.", "Meanwhile, heat a large saucepan over a medium heat. Add the butter and, once melted, gently fry the leek and bacon together for 7-8 minutes, or until the leeks are soft and the bacon golden-brown. ", "Preheat the grill to hot.", "Sprinkle the flour into the pan with the bacon, stir and cook on the heat for one minute. Gradually add the apple juice and milk, stirring as you add until you have a smooth sauce. Bring to a simmer and simmer for two minutes.", "Add the cooked potatoes and carrots to the pan and mix well so that everything is coated in the sauce. Taste and season with salt and pepper to taste. ", "Tip into a medium ovenproof baking dish (approximately 28x22cm/11x8½in in size).  Sprinkle generously with fresh thyme leaves and a drizzle of olive oil.  Place under the preheated grill for 10 minutes, or until golden and piping hot."]}, {"isVegetarian": false, "title": "Wheat-fed guinea fowl, brioche crumbs, gooseberries, asparagus, St George mushrooms and wild sorrel", "url": "www_bbc_co_uk_food_recipes_wheat-fed_guinea_fowl_09962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 wheat-fed guinea fowl breast (skin on)", "salt and freshly ground black pepper", "dash light fruity olive oil ", "skin from 1 guinea fowl (from above)", "20g/¾oz brioche crumbs", "5g toasted sunflower seeds, crushed", "400ml/14fl oz clear chicken consommé or strong chicken stock", "3 tsp puréed soft herbs", "1 knob butter ", "2 tsp crème fraîche", "large pinch finely shredded wild sorrel", "dash olive oil", "½ shallot, diced   ", "40g/1½oz small St George mushrooms ", "½ roasted garlic clove, crushed", "2 tsp snipped chives ", "3 spears asparagus, preferably Formby", "pinch sugar", "1 knob melted butter", "shredded wild sorrel, to taste", "few red vein sorrel leaves"], "serves": "Serves 1", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the guinea fowl, preheat the grill to high. Remove the skin from the guinea fowl breast. Set aside the guinea fowl breast.", "For the brioche crumb, preheat the oven to 180C/350F/Gas 4.", "Place the guinea fowl skin flat onto a non-stick baking tray and place another tray on top (this is to cook the skin evenly).", "Put the trays into the oven and cook for 5-8 minutes, or until crisp. Remove from the oven and take the skin off the tray to cool.", "When the skin is cool, thoroughly chop the skin to get a rough crumb.", "Place into a bowl with the brioche crumbs and toasted sunflower seeds. Lightly season with a little salt.", "For the guinea fowl, place the guinea fowl breast between two sheets of cling film and bat the breast with a heavy knife to even the thickness – try to retain the shape. ", "Preheat the grill to hot. Lightly season the guinea fowl breast with salt and freshly ground black pepper and place onto a roasting tray. Drizzle with a little olive oil and cook under the grill for five minutes, or until the breast is just cooked. ", "Once cooked, evenly coat the top of the guinea fowl with the brioche crumb and place back under the grill for 1-2 minutes, or until the brioche crumb is lightly golden-brown. ", "For the sorrel sauce, heat the chicken consommé or stock in a pan. Remove from the stove and blend in the soft herb purée, butter and crème fraîche using a hand-blender, until thoroughly dissolved. Taste and add salt and freshly ground black pepper if necessary.  Add the shredded wild sorrel.", "For the St George mushrooms, heat the oil in a small pan and fry the shallot until softened but without colour. ", "Add the mushrooms and garlic and season with a pinch of salt ", "Cook for 2-3 minutes, or until the mushrooms are tender. Remove from the pan, check the seasoning, and add salt or pepper if necessary, and finish with the snipped chives.", "For the asparagus, bend each stick of asparagus near the end. They will break naturally where the spear is no longer tough. For an elegant presentation, evenly shave the end of each stick of asparagus to make a spear.", "Bring a pan of water to the boil and season with salt and sugar ", "Place the asparagus into the water and cook for 1-2 minutes, or until the asparagus is just cooked. You should be able to just slip a small knife through the stem. ", "Remove from the water with a slotted spoon, brush with the melted butter and season with a little salt.", "To serve, cut the guinea fowl breast in half diagonally. Place in the centre of the plate slightly overlapping the two pieces (which gives the dish a bit of height)", "Arrange the mushrooms and asparagus tips around the breast. Drizzle the sauce around delicately and, sprinkle the shredded sorrel over the vegetables. Arrange the red vein sorrel on top and serve."]}, {"isVegetarian": true, "title": "Wheat tart (Pastiera di grano)", "url": "www_bbc_co_uk_food_recipes_wheattartpastieradig_91172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz whole wheat, soaked for 24 hours in several changes of water (or alternatively use 440g/15 oz canned cooked wheat, also called pastiera di grano, available from some Italian delicatessens)", "500ml/1 pint milk (if you are soaking the whole wheat)", "½ lemon, zest only", "1 tsp ground cinnamon", "2 tsp vanilla sugar (make your own by adding a vanilla pod to a pot of sugar, leave for 1-2 days for the flavour to develop)", "½ orange, zest only ", "300g/10oz ricotta cheese", "4 large free-range eggs, separated", "125ml/4½fl oz orange flower water (available from large supermarkets and specialist Middle Eastern delicatessens)", "150g/5oz candied peel, finely chopped", "225g/8oz caster sugar", "butter, for greasing", "icing sugar, for dusting", "150g/5oz caster sugar", "150g/5oz butter or lard", "3 large free-range egg yolks", "300g/10oz plain flour"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the filling, drain the soaked whole wheat (if using) and place in a pan with the milk and lemon zest. Simmer for 3-4 hours over a low heat. ", "When the grain is tender, add the ground cinnamon, vanilla sugar and orange zest. Remove from the heat, cool, cover and place in the fridge until the next day. ", "For the pastry, place the sugar, butter and eggs into a bowl and beat until smooth. Add the flour and stir to make a smooth pastry. Set aside in a cool place for at least one hour.", "Preheat the oven to 190C/375F/Gas 5.", "To continue making the filling, if you have soaked the whole wheat (according to the instructions above), remove it from the fridge. If you are using the canned cooked wheat, add it to the lemon zest, cinnamon, vanilla sugar and orange zest. ", "Beat the ricotta in a large mixing bowl with the egg yolks and the orange flower water. Add the candied peel pieces and the flavoured grain to the ricotta mixture.", "Beat the egg whites in a separate bowl with the sugar until light and fluffy. Fold them gently into the ricotta using a large metal spoon. ", "Butter a large flan tin 35cm/14in in diameter. ", "Roll two-thirds of the pastry out into a circle that will cover the base of the tin, as well as the sides. Press this pastry into the flan tin, covering the bottom and sides with an equal thickness. ", "Pour the ricotta mixture into the pastry case. Roll out the remaining pastry, cut into long strips and use these to make a lattice top for the tart. ", "Bake in the oven for about 45 minutes. ", "Allow to cool and dust with icing sugar. Serve in slices."]}, {"isVegetarian": true, "title": "Wheat cereal with banana and raisins", "url": "www_bbc_co_uk_food_recipes_wheat_cereal_with_banana_94651", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 wheat biscuit", "1 small banana (75g/2½oz peeled weight), sliced", "1 heaped tsp raisins", "125ml/4fl oz skimmed milk"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients into a cereal bowl and serve."]}]