[{"ingredients": ["1 cucharada de aceite de oliva", "50g / 2oz de mantequilla", "2 chalotes, pelados y picados", "1 bulbo de hinojo, finamente picado", "1 cucharada de harina normal", "1 cucharada de puré de tomate", "500 g / 1lb 2 oz de cáscaras de cangrejo cocidas", "2 cucharadas de aguardiente", "1 litro / 1¾ pintas de caldo de pescado", "2 hojas de laurel", "2 ramitas de perejil fresco de hoja plana", "sal y pimienta negra recién molida", "1 litro / 1¾ pintas de caldo de pescado", "25g / 1oz de mantequilla", "1 cebolla pequeña, finamente picada", "150 g / 5 oz de puerros, cortados en rodajas gruesas", "Arroz risotto arborio 250 g / 9 oz", "75ml / 3fl oz de vino blanco seco", "Colas de cangrejo cocidas 250 g / 9 oz", "50g / 2oz mascarpone", "Parmesano 50 g / 2 oz, rallado", "sal y pimienta negra recién molida"], "method": ["Para la sopa, caliente el aceite y la mantequilla en una sartén grande y saltee los chalotes y el hinojo durante 2-3 minutos.", "Agregue la harina y el puré de tomate y cocine, revolviendo, durante un minuto más.", "Agregue las cáscaras de cangrejo y el brandy y cocine por un minuto más.", "Agregue el caldo de pescado, las hojas de laurel y el perejil y cocine a fuego lento. Cocine por 20-25 minutos, o hasta que el líquido se haya reducido en un tercio. Retirar del fuego y dejar enfriar ligeramente.", "Vierta la mezcla en un procesador de alimentos y mezcle hasta obtener un puré fino.", "Pasar el puré a través de un colador en una cacerola limpia y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el risotto, coloque el caldo de pescado en una olla y cocine a fuego lento.", "Mientras tanto, caliente la mantequilla en una cacerola, agregue la cebolla y los puerros y cocine suavemente durante unos minutos, hasta que estén suaves pero no coloreados.", "Agregue el arroz y cocine por un minuto, revolviendo para cubrir el arroz en la mantequilla.", "Agregue el vino y cocine a fuego lento hasta que se reduzca a la mitad.", "Agregue el caldo tibio a cucharadas a la vez, revolviendo bien entre cada adición hasta que se absorba casi todo el caldo y el arroz esté tierno.", "Agregue dos tercios de las colas de cangrejo de río y 200 ml / 7 fl oz de la sopa de bizcocho y revuelva para combinar. Agregue el mascarpone, el parmesano y la sal y pimienta negra recién molida, al gusto.", "Para servir, vierta el risotto en el centro de un plato de sopa grande. Coloque las colas de cangrejo restantes alrededor del borde del risotto.", "Usando una licuadora de mano, mezcle la sopa restante hasta que esté espumosa. Cuchara la espuma sobre las colas de cangrejo."], "url": "www_bbc_co_uk_food_recipes_crayfishrisottowithc_87481", "title": "Risotto de cangrejo con sopa de cangrejo de río", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 gran puñado de pan de estilo rústico ligeramente rancio, roto en pedazos", "grandes avellanas", "1 limón, ralladura y jugo", "125g / 4oz de mantequilla, cortada en cubos pequeños", "2 dientes de ajo picados", "salpicaduras de pastis", "sal marina y pimienta negra recién molida", "gran puñado de hojas de perejil fresco, picado", "30 cangrejos de río en bruto (sustitutos con langostinos si no están disponibles)", "cuñas de limón, para servir"], "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque el pan en un procesador de alimentos y mezcle en pan rallado de tamaño mediano.", "Agregue los ingredientes de relleno restantes, a excepción del perejil, a las migas de pan y mezcle hasta que estén bien combinados. (Si se convierte en un bulto, retire la tapa y divídala un poco con una cuchara.) Agregue el trozo picado.", "Para el cangrejo de río, con un cuchillo afilado, corte todos los cangrejos a lo largo desde la punta hasta la cola. Retire cualquier saco de residuos del cangrejo de río.", "Coloque el cangrejo, uno al lado del otro, en una bandeja de asar. Aplique una cantidad generosa del relleno en el lado de la carne de cada mitad de cangrejo.", "Espolvoree el cangrejo de río con sal y colóquelo debajo de la parrilla. Grill durante 4-5 minutos, o hasta que esté completamente cocido. Las conchas se volverán completamente rojas cuando estén cocidas. Si quedan signos de color marrón oscuro o azul, no están listos y requieren unos minutos más.", "Para servir, transfiera el cangrejo cocido a un plato y organice en filas. Sirva con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_crayfishwithhazelnut_89777", "title": "Cangrejo con mantequilla de avellana y pastis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla", "1 cebolla, finamente picada", "Tocino rayado de 50 g / 2 oz, cortado en trozos pequeños", "2 dientes de ajo, finamente picados", "1 puerro, solo blanco, finamente picado", "1 apio en barra, finamente picado", "2 ramitas de tomillo, hojas recogidas", "Apioazul 700 g / 1 libra 8 oz, pelado y cortado en cubos pequeños", "1 litro / 1¾ pinta de caldo de pollo", "Crema doble 200ml / 7floz", "sal y pimienta blanca", "4 lonchas pancetta", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "Apioagudo 50 g / 2 oz, pelado y finamente cortado en juliana", "1 rebanada de pan blanco, cortado en dados de 1cm / ¼", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de crema doble"], "method": ["Para la sopa, caliente una sartén o una sartén grande hasta que esté medio caliente, agregue 25 g / 1 oz de la mantequilla, la cebolla y el tocino, y fríalos durante unos minutos para que se ablanden. Agregue las ramitas de ajo, puerro, apio y tomillo y fría por otro minuto; luego agregue el apionabo picado. Vierta el caldo y deje que hierva, luego reduzca el fuego a fuego lento y cocine durante 10-15 minutos, o hasta que el apionabo esté solo tierno.", "Mezcle la sopa en un puré fino con una batidora o una licuadora. Regrese al fuego en una sartén. Agregue la crema y mezcle con los otros 50 g / 2 oz de mantequilla.", "Sazonar con sal y pimienta blanca. Sirva la sopa caliente en tazones, o manténgala caliente en la sartén si hace la guarnición.", "Para la guarnición opcional, freír la panceta hasta que esté crujiente y reservar. Regrese la sartén al fuego, agregue la mitad de la mantequilla y el aceite de oliva y caliente hasta espumar. Agregue el apionabo y saltee durante 1-2 minutos, o hasta que se ablanden, luego retírelo de la sartén y escurra sobre papel de cocina. Agregue el resto de la mantequilla y el pan a la sartén y cocínelos hasta que estén dorados y crujientes, revolviéndolos para que se cocinen en cada lado. Escurrir en un plato forrado con papel de cocina y sazonar con sal y pimienta negra recién molida. Para servir, amontone el apionabo en juliana en el centro de cada uno de los cuatro platos de sopa. Cucharee la sopa alrededor. Desmenuce el tocino crujiente sobre la parte superior y luego esparza sobre los crotones. Termine con remolinos de aceite de oliva virgen extra y crema."], "url": "www_bbc_co_uk_food_recipes_cream_of_celeriac_soup_59784", "title": "Crema de sopa de apio nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cream_of_celeriac_soup_59784_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["45g / 1¾oz de mantequilla, ablandada, más extra para engrasar y servir", "Harina integral de 340g / 12oz", "Harina de pan blanco fuerte 340g / 12oz, más extra para quitar el polvo", "2 cucharaditas de bicarbonato de soda", "1½ cucharadita de sal", "1 cucharadita de granos de pimienta negra agrietada", "625ml / 1 pinta 1fl oz de suero de leche", "1 cucharada de aceite de colza", "1 cebolla, en rodajas", "2 dientes de ajo rallados", "1 patata harinosa, como Maris Piper, pelada y cortada en cubitos", "1 litro / 1¾ pintas de caldo de pollo caliente", "1 kg / 2 lb 4 oz de apio, tallos cortados y finamente rebanados, hojas reservadas", "1 manojo de perejil recién hecho, solo hojas", "Crema doble de 200 ml / 7 fl oz", "salpicar vinagre de vino blanco", "6 huevos de gallinas camperas", "llovizna aceite de colza", "sal de apio, al gusto"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Para el pan de soda, engrase una bandeja para hornear con un poco de mantequilla.", "Coloque las dos harinas, la mantequilla, el bicarbonato de sodio, la sal y la pimienta en un tazón grande. Poco a poco agregue el suero de leche, usando sus manos para unir la mezcla y formar una masa suave.", "Forme la masa en un pan duro y transfiérala a la bandeja de horneado preparada. Polvo la parte superior con harina de pan blanco fuerte. Hornee en el horno por 45-50 minutos, o hasta que estén doradas por completo y cocidas. (El pan de soda está cocido cuando suena hueco cuando se golpea firmemente en la base.) Transfiera el pan a una rejilla y déjelo enfriar por completo.", "Mientras tanto, para la sopa de apio, caliente el aceite de colza en una sartén grande de base pesada a fuego medio. Agregue las cebollas y el ajo y freír suavemente durante 4-5 minutos, o hasta que estén blandos.", "Agregue la papa y fría por otros 5-6 minutos, revolviendo regularmente.", "Vierte el caldo de pollo y lleva a ebullición, luego reduce el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 4-5 minutos, o hasta que las papas estén comenzando a ablandarse.", "Agregue el apio rebanado a la sartén y devuelva la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento por otros 5-8 minutos, o hasta que el apio esté solo tierno.", "Agregue las hojas de perejil y cocine a fuego lento durante 2-3 minutos más. Agregue la crema doble y caliente. Retire la sartén del fuego y deje a un lado para que se enfríe un poco.", "Cuando la sopa se haya enfriado un poco, mezcle en un procesador de alimentos hasta que quede suave, luego cuele a través de un colador fino y sazone al gusto con sal y pimienta negra recién molida.", "Para los huevos escalfados, ponga a hervir un sartén de agua con sal y agregue el chorro grande de vinagre de vino blanco. Reduzca el fuego hasta que el agua hierva a fuego lento.", "Revuelva el agua para crear un vórtice, luego agriete los huevos en el centro del vórtice uno por uno (o uno a la vez si lo prefiere). Cueza los huevos durante 3-5 minutos, o hasta que los blancos se acaban de poner. Retire con cuidado del agua con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Justo antes de servir, picar finamente las hojas de apio reservadas. Rocíe los huevos con un poco de aceite de colza, espolvoree la sal de apio y luego decore con las hojas picadas de apio.", "Para servir, divida la sopa de apio entre cuatro tazones para servir y coloque un huevo escalfado encima de cada porción. Sirva con rebanadas de pan de soda con mantequilla."], "url": "www_bbc_co_uk_food_recipes_cream_of_celery_soup_56670", "title": "Crema de sopa de apio con huevo escalfado y pan de soda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de queso crema", "½ limón, solo jugo", "1 cucharada de cebolla roja finamente picada", "25 g / 1 oz de eneldo fresco, finamente picado", "sal y pimienta negra recién molida", "2 remolachas cocidas en rodajas en cinco rondas de ½ cm de espesor", "½ limón, solo jugo", "1 cucharada de aceite de oliva", "1 remolacha cocida, finamente picada", "1 cucharada de cebolla roja, finamente picada", "1 cucharada de perifollo fresco finamente picado", "1 cucharada de eneldo fresco finamente picado", "sal y pimienta negra recién molida"], "method": ["Para preparar el queso crema y la remolacha, coloque el queso crema, el jugo de limón, la cebolla roja, el eneldo y la sal y la pimienta negra recién molida en un tazón grande y mezcle bien.", "Coloque 1 remolacha redonda en el centro de un plato, coloque 2 cucharadas de la mezcla de queso crema en la parte superior, luego coloque otra remolacha en la parte superior.", "Repita este proceso de estratificación tres veces más para crear una pila.", "Para hacer la salsa, coloque el jugo de limón y el aceite de oliva en un tazón y mezcle. Agregue la remolacha, la cebolla y las hierbas, condimente, sazone con sal y pimienta negra recién molida y mezcle.", "Para servir, cuchara la salsa alrededor de la pila."], "url": "www_bbc_co_uk_food_recipes_creamcheeseandbeetro_80191", "title": "Pila de queso crema y remolacha con salsa de remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de queso crema", "½ cucharadita de mostaza Dijon", "2 cucharadas de aceite de oliva", "30 ml / 1 fl oz de puré de tomate", "1 cucharadita de vinagre de vino blanco", "2 cebollas de primavera, en rodajas", "2 rebanadas de pan tostado"], "method": ["En un tazón, mezcle el queso crema con la mostaza de Dijon, aceite de oliva, vinagre de vino blanco y passata de tomate para formar una pasta espesa.", "Sirva en un plato con tostadas, espolvoreado con cebolletas."], "url": "www_bbc_co_uk_food_recipes_creamcheesedipwithto_78295", "title": "Dip de queso crema con pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 3¼ oz de coles de Bruselas, cortadas", "8 lonchas de tocino curado, cortado en lardons", "250ml / 8¾ fl oz crema doble", "2 dientes de ajo, aplastados", "sal y pimienta negra recién molida"], "method": ["Cocine las coles de Bruselas en una cacerola de agua con sal hirviendo durante 8-10 minutos. Escurrir y refrescar en un tazón con hielo y agua. Drene nuevamente cuando los brotes se hayan enfriado.", "Agregue los lardons de tocino a una sartén antiadherente y freír a fuego medio hasta que estén crujientes.", "Agregue la crema y el ajo triturado a una olla pequeña y deje que hierva.", "Revuelva los brotes en el tocino crujiente; luego agregue la crema caliente.", "Sazone con sal y pimienta y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_creamedbrusselssprou_84835", "title": "Crema de Bruselas brotes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamedbrusselssprou_84835_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalota", "botón de mantequilla", "1 cabeza de coliflor", "1 litro / 35 fl oz de caldo de pollo", "300g / 10½oz Stilton", "300g / 10½ fl oz doble crema", "pan crujiente"], "method": ["Sudor los chalotes en mantequilla hasta que estén blandos.", "Agregue las flores de coliflor y el caldo de pollo.", "Cocine hasta que la coliflor esté suave.", "Agregue el Stilton y la crema y lleve casi a ebullición", "Sazonar y retirar a un procesador de alimentos.", "Cuele la sopa, decore con hojas de perejil y sirva en un tazón tibio con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_creamedcaulifloweran_73306", "title": "Crema de coliflor y sopa de Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 diente de ajo, finamente picado", "100g / 3½oz de frijoles flageolet enlatados, enjuagados y escurridos", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco picado", "3 rebanadas de pan blanco crujiente, tostado", "echar aceite de oliva, para lloviznar", "perifollo fresco, para adornar"], "method": ["Calentar la mantequilla en una sartén, agregar el ajo y freír a fuego lento durante un minuto.", "Agregue los frijoles flageolet, sazonar, al gusto, con sal y pimienta negra recién molida y caliente a través de un calor suave.", "Mash con un triturador de patata y revuelva en el perejil.", "Para servir, unte la pasta de frijoles flageolet sobre el pan tostado y colóquelo en un plato para servir. Rocíe con aceite de oliva y decore con perifollo fresco."], "url": "www_bbc_co_uk_food_recipes_creamedflageoletbrus_88402", "title": "Bruschetta de flageleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ puerro, finamente picado", "1 diente de ajo, picado", "2 cucharadas de crema doble", "sal y pimienta negra recién molida", "2 rebanadas de chapata, rociadas con aceite de oliva", "2 lonchas de tocino rayado", "2 huevos de gallinas camperas", "55 g / 2 oz de brócoli, cortado en floretes y cocinado hasta que esté tierno"], "method": ["Caliente el aceite de oliva en una sartén, agregue el puerro y el ajo y fría por 3-4 minutos, o hasta que se ablanden.", "Agregue la crema y sazone bien con sal y pimienta negra recién molida y cocine a fuego lento durante un minuto.", "Caliente una sartén hasta que fume. Agregue la chapata y la plancha durante dos minutos por cada lado, o hasta que estén bien tostados.", "Agregue el tocino a la sartén de la plancha y cocínelo durante dos minutos en cada lado, o hasta que esté dorado y cocido.", "Rompe dos huevos en una olla con agua hirviendo a fuego lento. Cueza los huevos durante 3-4 minutos, o hasta que estén cocidos a su gusto, luego saque con una espumadera y déjelos a un lado.", "Para servir, coloque la chapata a la parrilla en un plato, cubra con la mezcla de puerro y coloque los huevos escalfados encima. Adorne con el tocino y el brócoli cocido."], "url": "www_bbc_co_uk_food_recipes_creamedleekcrostiniw_84524", "title": "Crostini de puerro con bacon y huevos escalfados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lomo de cerdo 75g / 2¾oz", "1 cucharada de aceite de oliva", "50g / 1¾oz de mantequilla", "4 puerros picados y blanqueados", "3 tallos de acelga, cortados de las hojas, finamente picados", "Crema doble 250ml / 9fl oz", "1 cucharada de salvia fresca, picada", "patatas nuevas, hervidas hasta que estén blandas"], "method": ["Para el cerdo, caliente el aceite en una sartén. Agregue el cerdo y cocine durante cinco minutos en cada lado, hasta que esté bien cocido.", "Para los puerros con crema, derrita la mantequilla en una sartén caliente. Agregue los puerros y la acelga y saltee durante tres minutos.", "Agregue la crema doble y la salvia, caliente y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque los puerros con crema en el centro de un plato calentado y cubra con la carne de cerdo. Coloque las papas nuevas alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_creamedleekswithpork_79328", "title": "Puerros batidos con carne de cerdo y patatas nuevas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hojas de espinaca baby 55g / 2oz", "1 cubo de caldo de verduras", "3 cucharadas de crema doble", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Coloque la espinaca, el cubo común y 300 ml / ½ pinta de agua en una sartén a fuego medio. Llevar a ebullición, luego reduzca el fuego y cocine suavemente durante 2-3 minutos, hasta que la espinaca esté tierna.", "Sazonar, al gusto, con sal y pimienta negra recién molida y agregar la crema y la nuez moscada.", "Mezcle la sopa con una batidora de mano hasta que quede suave.", "Para servir, ponga la sopa en un tazón calentado y sirva con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_creamedspinachsoupwi_87756", "title": "Sopa cremosa de espinacas con nuez moscada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, pelado", "125 g de espinaca, lavada", "200ml / 7¼fl oz de crema doble", "nuez moscada molida, al gusto", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una sartén a fuego medio y freír el ajo durante 1-2 minutos. Agregue las espinacas y continúe freír hasta que la espinaca se haya marchitado. Vierta la crema y condimente, al gusto, con nuez moscada, sal y pimienta negra recién molida.", "Continúe calentando por 2-3 minutos o hasta que el volumen del líquido se haya reducido un poco.", "Mezcle la mezcla con una batidora. Poner en un bol y decorar con nuez moscada rallada extra, al gusto."], "url": "www_bbc_co_uk_food_recipes_creamedspinachwithnu_92846", "title": "Espinacas batidas con nuez moscada y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "3-4 hojas de salvia", "150 g / 5½ oz de coles de Bruselas crudas, cortadas muy finas en una mandolina", "1 diente de ajo pequeño, aplastado", "125ml / 4fl oz de vino blanco", "50g / 1¾ oz crema doble", "100 g / 3½ oz de queso parmesano (o alternativa vegetariana), más extra por servir", "75g / 2½oz se desmoronaron Stilton", "350g / 12oz de pasta de penne cocida"], "method": ["Coloque la mantequilla y la salvia en una sartén, deje que hierva y deje que la mantequilla se vuelva marrón y la salvia hasta que quede crujiente.", "Agregue los brotes y fría por unos minutos, luego agregue el ajo. Vierta el vino y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Vierta la crema y deje que hierva, mezcle el queso parmesano y la mitad del Stilton. Agregue la pasta cocida, mezcle y agregue el resto del Stilton y una pizca de parmesano. Servir."], "url": "www_bbc_co_uk_food_recipes_creamed_sprouts_with_92621", "title": "Brotes de crema con Stilton y pasta penne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 batata", "50g / 1¾oz de Wensleydale, desmenuzado", "1 cucharada de crema doble", "15g / ½ oz de mantequilla", "sal y pimienta negra recién molida", "1 cucharada de perejil de flatleaf fresco picado, para servir"], "method": ["Envuelva la batata en papel para hornear húmedo y ponga en el microondas a temperatura alta durante 6-7 minutos, o hasta que se ablanden.", "Retire el papel, retire la carne de patata y revuelva con Wensleydale, crema y mantequilla. Sazone con sal y pimienta negra recién molida y vuelva a colocar la cuchara en la piel de la papa.", "Para servir, colóquelo en un plato para servir y espolvoree sobre el perejil."], "url": "www_bbc_co_uk_food_recipes_creamedsweetpotatowi_85705", "title": "Batata batida con Wensleydale y cebollino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "Florecillas de brócoli de 100g / 3½oz, blanqueadas", "150ml / 4½fl oz de caldo de verduras calientes", "50g / 1½oz Stilton", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una sartén, agregar la cebolla y el ajo y freír hasta que se ablanden.", "Agregue el brócoli y el caldo y cocine a fuego lento durante 8-10 minutos.", "Agregue el Stilton y condimente, al gusto, con sal y pimienta negra recién molida.", "Deje que se enfríe un poco, luego transfiera a un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, vierta en un recipiente tibio."], "url": "www_bbc_co_uk_food_recipes_creamofbroccoliandst_85825", "title": "Crema de brócoli y sopa de Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "¼ de cebolla, finamente picada", "½ cabeza de brócoli, cortada en florecillas", "sal y pimienta negra recién molida", "300ml / ½ pinta de pollo caliente o caldo de verduras", "Crema doble de 50 ml / 2 fl oz, más extra para servir"], "method": ["Calentar el aceite de oliva en una olla pequeña, agregar la cebolla y freír suavemente hasta que se ablande. Agregue los brotes de brócoli, la sal y la pimienta y el caldo negro recién molidos y cocine a fuego lento durante cinco minutos, o hasta que el brócoli esté tierno.", "Agregue la crema. Mezcle con una batidora de mano hasta que quede suave. Vierta en un recipiente y termine con un remolino de crema."], "url": "www_bbc_co_uk_food_recipes_creamofbroccolisoup_88262", "title": "Crema de brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "475 g / 1lb 1 oz de apionabos, pelados y cortados en cubos", "2 chalotes, en rodajas", "1 diente de ajo, picado", "50ml / 2fl oz de vino blanco", "1 litro / 2 pintas de caldo de pollo", "Crema doble 75ml / 3fl oz", "sal y pimienta negra recién molida", "12 vieiras, coral eliminado", "1 cucharadita de curry en polvo", "25g / 1oz de mantequilla", "Crema de 60 g / 2½ oz", "perifollo fresco, para adornar"], "method": ["Para la sopa, caliente el aceite en una sartén grande a fuego medio. Agregue el apio nabo, los chalotes y el ajo y fría con cuidado durante unos minutos, para suavizar sin dorar.", "Agregue el vino blanco, hierva y reduzca el líquido a la mitad.", "Agregue el caldo de pollo y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento durante 10-15 minutos, hasta que el apionabo esté suave. Retirar del fuego y dejar enfriar durante cinco minutos.", "Transfiera la sopa a un procesador de alimentos y mezcle hasta que quede suave.", "Regrese la sopa a la cacerola, agregue la crema y caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para las vieiras, espolvoree las vieiras con el curry en polvo.", "Caliente una sartén hasta que esté caliente, luego agregue la mantequilla. Cuando la mantequilla esté espumante, agregue las vieiras. Dore las vieiras por un minuto en cada lado, o hasta que estén recién cocidas, luego retírelas de la sartén.", "Para servir, coloque tres vieiras en cada una de las cuatro sopas de sopa anchas y poco profundas y ponga la sopa alrededor de las vieiras. No cubras las vieiras. Cubra las vieiras con una cucharada de crème fraîche y adorne con una ramita de perifollo."], "url": "www_bbc_co_uk_food_recipes_creamofceleriacsoupw_85344", "title": "Crema de sopa de apio con vieiras al curry fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite vegetal", "½ diente de ajo, picado", "½ cebolla de primavera, finamente picada", "¼ de chile rojo, sin semillas y finamente picado", "½ lima, solo ralladura", "3 gambas, cabezas y cáscaras solamente", "sal y pimienta negra recién molida", "150ml / ¼ pinta de leche de coco", "300 ml / ½ pinta de caldo de pollo", "pequeñas hojas de cilantro puñado"], "method": ["Calentar el aceite en una sartén y freír el ajo durante un minuto.", "Agregue la cebolla de primavera, el chile, la cáscara de limón, las cáscaras de gambas y sazone con sal y pimienta negra recién molida. Cocine por un minuto más.", "Agregue la leche de coco y el caldo de pollo y cocine a fuego lento durante cinco minutos.", "Vierta la sopa a través de un colador. Deseche las cáscaras de gambas pero agregue el resto de los ingredientes sólidos a la sopa.", "Transfiera la sopa a un recipiente y adorne con las hojas de cilantro para servir."], "url": "www_bbc_co_uk_food_recipes_creamofcoconutsoup_84419", "title": "Sopa de crema de coco", "time": {"preparation": "", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más extra para lloviznar", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 cabeza de brócoli, cortado en pequeños floretes", "500ml / 18fl oz de caldo de pollo o vegetal", "100ml / 3½ fl oz crema doble"], "method": ["Caliente el aceite en una sartén y fría la cebolla y el ajo durante 3-4 minutos hasta que se ablanden. Agregue el brócoli y revuelva.", "Vierta el caldo caliente y cocine a fuego lento durante 4-5 minutos, o hasta que el brócoli esté tierno.", "Agregue la crema y cocine a fuego lento. Deje que se enfríe un poco, luego mezcle hasta que quede suave con una batidora manual.", "Para servir, vierta la sopa en dos tazones de sopa y rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_creamofbroccolisoup_88693", "title": "Crema de brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]