[{"ingredients": ["Lomo de bacalao a 400g / 14oz, cortado en trozos de 1.5cm / ⅝in", "1 limón, ralladura solamente", "1½ cucharadas de aceite de oliva", "1 diente de ajo, en rodajas finas", "1 cebolla roja grande, finamente rebanada", "1 bulbo de hinojo, en rodajas finas", "1 zanahoria, finamente picada", "1 cucharadita de polvo de curry suave", "½ cucharadita de pimentón", "1 400 g de tomates picados en lata, escurridos", "400ml / 14fl oz de vino blanco Pinot Grigio", "2 cucharaditas de azúcar en polvo", "250ml / 9fl oz de caldo de pescado", "pequeño racimo de eneldo fresco, finamente picado", "Gambas crudas de 200g / 7oz, desvenaduradas", "20 g / oz de mantequilla", "15g / ½ oz de perejil de flatillo finamente picado", "cebollino pequeño, finamente picado", "pimienta negra recién molida", "2 yemas de huevo de gallinas camperas", "1 cucharada de jugo de limón fresco", "250ml / 9fl oz de aceite de girasol", "1 diente de ajo, aplastado", "sal y pimienta negra recién molida"], "method": ["Cubra el bacalao con la ralladura de limón y unas vueltas de pimienta y reserve.", "Caliente el aceite de oliva en una cacerola grande a fuego medio. Sudor el ajo, la cebolla, el hinojo y la zanahoria durante 10 minutos o hasta que estén suaves. Agregue el curry en polvo y el pimentón y fría por un minuto más.", "Agregue los tomates, el vino blanco, el azúcar, el caldo y 2 cucharadas de eneldo. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 25 minutos.", "Mientras la sopa hierve a fuego lento, prepare el alioli colocando dos yemas de huevo en un mini procesador de alimentos. Agregue el jugo de limón y mezcle. Poco a poco agregue el aceite, gota a gota durante la mezcla, durante aproximadamente 5 minutos o hasta que se espese. Agregue el ajo y sazone al gusto.", "Cuando la sopa ha estado cocinando durante 25 minutos, agregue el bacalao y cocine a fuego lento durante 3 minutos. Sazone al gusto.", "Mientras tanto, freír las gambas en la mantequilla durante 3 minutos, o hasta que estén rosadas y cocidas. Una vez cocinado, revuelva las gambas en la sopa.", "Para servir, divida la sopa entre cuatro tazones y adorne con el perejil, el cebollín, el eneldo y una porción del aoli."], "url": "www_bbc_co_uk_food_recipes_fish_soup_with_aoli_67591", "title": "Sopa de pescado con aïoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla roja pequeña, pelada, partida a la mitad y cortada en medias lunas", "2 limas, solo jugo", "125g / 4½ oz de mayonesa", "2 cucharaditas de pasta Gochujang, u otra salsa picante, al gusto", "1 x 198 g / 7 oz de maíz dulce de estaño, escurrido", "1 chile rojo fresco, finamente cortado en cubitos (sin semillas si no te gusta el calor)", "3 cucharadas de cilantro fresco picado", "sal al gusto", "4 filetes sin piel de pescado blanco firme, como la merluza o el eglefino (750-900g / 1lb10oz-2lb en total), del extremo más grueso del lomo", "1 cucharadita de comino molido", "½ cucharadita de pimentón", "1 cucharadita de copos de sal marina", "1 diente de ajo, pelado y finamente rallado o picado", "2 cucharadas de aceite de oliva normal", "8 tortillas de maíz blandas", "2 aguacates maduros", "1 lima, solo jugo", "hojas de ensalada de su elección", "1-2 cucharadas de cilantro fresco picado", "2 limas, cortadas en cuñas"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7 para el pescado, y comience preparando los lados para sus tacos. Coloque las rodajas de cebolla roja en un recipiente y cúbralas con el jugo de lima. Revuelva con un tenedor para mezclar bien la cebolla en el jugo. En realidad, si puede hacer esto antes de tiempo (hasta 1 día), mucho mejor, pero incluso 20 minutos están bien.", "Prepare la salsa picante mezclando la mayonesa y la pasta gochujang (u otra salsa picante) en un tazón pequeño. Dejar de lado.", "Para el condimento de maíz, ponga el maíz dulce enlatado en un tazón. Agregue la guindilla al maíz dulce, junto con el cilantro picado y un poco de sal al gusto. Dale un buen revuelo y deja de lado.", "Corta los filetes de pescado por la mitad a lo largo, para que tengas los dedos largos, y colocalos en una lata para asar poco profunda. Mezcle el comino, el pimentón y la sal, y espolvoree sobre los filetes de pescado. Mezcle el ajo y el aceite en un tazón pequeño. Rocíe el pescado con el aceite de ajo y tueste en el horno durante 8-10 minutos, dependiendo del grosor de los filetes. Verifique si el pescado está cocido (aunque solo sea justo) antes de sacarlo del horno.", "Una vez que haya sacado el pescado (aunque no deje que se enfríe) apague el horno y caliente las tortillas con el calor que se desvanece. Mientras tanto, pele, pique y corte los aguacates, luego rocíe con el jugo de la lima, listo para servir con los otros acompañamientos.", "Coloque el pescado en un plato (alineado con hojas de ensalada, si así lo desea), espolvoree con cilantro fresco picado y llévelo a la mesa junto con las tortillas calentadas. Si no desea agregar ninguna ensalada al pescado directamente, puede colocar un cuenco de iceberg rallado u otras hojas crujientes cerca.", "Ponga los tazones de soused, pero escurridos, cebollas rojas, el condimento de maíz, salsa picante y un plato de aguacates en rodajas sobre la mesa para que todos puedan cargar sus tortillas. Un plato de trozos de lima y una pila de servilletas también son buenas ideas."], "url": "www_bbc_co_uk_food_recipes_fish_tacos_33979", "title": "Tacos de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_tacos_33979_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chipotles en adobo, finamente picados", "3 cucharadas de mayonesa", "3 cucharadas de crema agria", "½ lima, solo jugo", "sal marina escamada y pimienta negra recién molida", "2 tomates grandes maduros, sin semillas y finamente picados", "½ cebolla, finamente picada", "puñado de cilantro fresco, toscamente picado", "1 chile verde serrano o jalapeño, finamente picado", "1 lima, solo jugo", "1 litro / 1¾ pintas de maíz o aceite vegetal", "Harina normal 300g / 10½ oz", "½ cucharadita de polvo de hornear", "275ml / 9½fl oz de cerveza fría helada", "600g / 1lb filete de bacalao de 5oz, preferiblemente islandés, cortado en trozos", "12 tortillas de maíz", "½ repollo blanco pequeño, finamente rallado", "1 aguacate, cortado en cubitos", "salsa de chile picante"], "method": ["Para hacer la crema de chipotle, mezcle los ingredientes con una pizca de sal en un tazón pequeño y déjelos a un lado.", "Para hacer la salsa, mezcle todos los ingredientes junto con ½ cucharadita de sal en un tazón pequeño y déjelo a un lado.", "Caliente el aceite en una sartén grande de base pesada a 190 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para hacer la mezcla, tamice 200g / 7oz de la harina, 1 cucharadita de sal y el polvo de hornear en un tazón grande. Batir en la cerveza hasta que quede suave. Incline la harina restante de 100 g / 3½ oz en un tazón pequeño y sazone bien con sal y pimienta.", "En tandas, cubra el pescado con la harina sazonada, sacuda el exceso, luego sumérjalo en la mezcla. Freír cada pieza durante 2-3 minutos, hasta que estén crujientes y doradas. Repita hasta que todo el pescado esté cocido. Escurra cada lote sobre papel de cocina para eliminar el exceso de aceite. Espolvorear ligeramente con sal.", "Caliente las tortillas en una sartén seca, en el microondas o en el horno.", "Sirva el pescado inmediatamente en las tortillas calientes, con el repollo, el aguacate, la salsa y las salsas a un lado."], "url": "www_bbc_co_uk_food_recipes_fish_tacos_ensenada_42309", "title": "Fish tacos 'Ensenada' (Tacos de Pescado Ensenada)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_tacos_ensenada_42309_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "1 x 200 g / 7 oz de filete de eglefino o pescado blanco similar", "salpicaduras de tomate ketchup", "4 aceitunas negras, picadas, picadas", "2 pequeñas setas de castaña picadas", "2 ramitas de perejil fresco de hojas rizadas, solo hojas, picadas", "1 cucharada de maíz dulce redondeado", "25g / 1oz de queso cheddar rallado", "1 rebanada de pan del día anterior, las cortezas eliminadas, ralladas", "pizca de pimienta negra recién molida", "vegetales verdes al vapor, para servir"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja para hornear con papel de hornear y cepille todo el papel con aceite vegetal.", "Coloque el filete de eglefino en la bandeja para hornear, coloque un poco de ketchup de tomate sobre la parte superior, luego espolvoree sobre las aceitunas picadas, los champiñones, el perejil y el maíz dulce.", "En el tazón, mezcle el queso cheddar y las migajas de pan, luego sazone con pimienta negra recién molida. Cubra el pescado con la mezcla de migas de pan.", "Transfiera el eglefino al horno y hornee durante 18-20 minutos, o hasta que el pescado esté completamente cocido y las migas de pan estén doradas. (El pescado se cuece cuando está opaco y se desmenuce fácilmente). Sirva con verduras al vapor."], "url": "www_bbc_co_uk_food_recipes_fish_triple_decker_52632", "title": "Fish triple decker", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de lenguado de limón (aproximadamente 150 g / 5 oz cada uno), piel eliminada", "3 cucharadas de harina común", "½ cucharadita de sal", "2 pizcas de pimienta negra recién molida", "1½ cucharadas de aceite de girasol", "45 g / 1½ oz de mantequilla, cortada en cubos", "½ limón, solo jugo", "1 cucharada de perejil de flatillo picado", "1 cucharada de alcaparras pequeñas (opcional)"], "method": ["Verifique los huesos pequeños en el pescado y use pinzas para sacar los que encuentre.", "Mezcle la harina con la sal y la pimienta y extiéndala sobre un plato grande. Pat los filetes de pescado en la harina para que estén uniformemente cubiertos, y sacuda el exceso.", "Caliente el aceite en una sartén grande a fuego alto. Cuando el aceite esté humeando, coloque los filetes de pescado en la sartén y baje el fuego a medio. Cocine durante 1-2 minutos en un lado hasta que estén dorados, luego voltee los filetes y cocine por 1-2 minutos más hasta que el segundo lado esté dorado. (Los filetes de lenguado solo necesitan 1 o 2 minutos de cocción en cada lado. Si está cocinando rebanadas o filetes más gruesos de una trucha parecida a pescado (2-3 cm / 1 pulgada), entonces 3-4 minutos de cada lado deberían estar bien).", "Cuando estén cocidos, retire el pescado de la sartén y envuélvalos en papel de aluminio para mantenerlos calientes.", "Limpie la sartén con toallas de papel y vuelva a calentar a fuego medio. Agregue los cubitos de mantequilla y calor hasta que se derritan y se vuelvan marrones claros, luego apague el fuego y agregue el jugo de limón (párese un poco hacia atrás ya que chisporrotea).", "Agregue el perejil y las alcaparras (si se usa) y agite el contenido de la sartén. Regrese el pescado a la sartén, espolvoree los jugos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fish_with_lemon_and_80186", "title": "Pescado con limón y salsa de mantequilla marrón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patata de 450g / 1lb, picada en trozos", "450 g / 1 libra de pescado congelado mixto, como bacalao, eglefino, salmón, abadejo ahumado", "2 cucharadas de perejil fresco picado", "1 huevo de gallinas camperas, golpeado", "aceite vegetal, para freír", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Para el puré de papa, ponga a hervir una olla de agua con sal. Agregue las papas a la olla y cocine hasta que estén tiernas, esto debería tomar alrededor de 15 minutos. Cuando esté cocido, escurrir en un colador y dejar escurrir durante unos minutos. Vuelve a la olla y machaca con un triturador de patatas hasta lograr una consistencia suave. Dejar de lado.", "Coloque el pescado congelado en una lata para asar y cocine en el horno durante unos 10-15 minutos hasta que esté opaco y empiece a formar copos. Cuando esté lo suficientemente frío para manipularlo, quite la piel y los huesos y desmenuce los peces en trozos grandes.", "Mezcle el pescado, el puré de papa, el perejil y el huevo juntos hasta que estén bien combinados. (Mezcle cuidadosamente para no romper demasiado el pescado). Sazone con sal y pimienta. Forme la mezcla en 8 a 12 hamburguesas, dependiendo de la cantidad que desee y reserve para enfriar en la nevera durante una hora.", "Calienta el aceite vegetal en una sartén y freír los pasteles de pescado hasta que estén dorados por cada lado y calentarlos completamente. Sirva con salsa tártara y una ensalada simple."], "url": "www_bbc_co_uk_food_recipes_fishcakes_1915", "title": "Pasteles de pescado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 8-12 tortas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fishcakes_1915_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas 400g / 14oz, picadas", "25g / 1oz de mantequilla", "sal y pimienta", "Filetes de pescado blanco congelados de 360 ​​g / 12 oz (como Coley o Pollock), descongelados, sin piel ni huesos", "2 cucharadas de harina normal", "1 huevo, golpeado", "Pan rallado de 150 g / 5½ oz (hecho de 4-5 rebanadas de pan, cortado en pan rallado y secado ligeramente)", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 cebolla, finamente rebanada", "300g / 10½oz de guisantes congelados", "100g / 3½oz de queso crema"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer los pasteles de pescado, cocine las papas en una olla grande de agua hirviendo hasta que estén tiernas. Escurrir y reservar para secar durante un par de minutos.", "Mash con un triturador de patata hasta que quede suave y luego mezcle la mantequilla. Pruebe y agregue sal y pimienta según sea necesario. Dejar de lado para enfriar.", "Mientras tanto, llene la mitad de una sartén con agua hirviendo y coloque a fuego medio. Agregue los filetes de pescado descongelados y cocine suavemente durante 5-6 minutos, o hasta que estén recién cocidos. Escurrir, secar con papel de cocina y dejar enfriar durante 10 minutos.", "Rompe el pescado en escamas y agrégalo al puré de patatas. Pruebe y agregue sal y pimienta según sea necesario.", "Ponga la harina en un recipiente poco profundo y sazone con una pizca de sal y pimienta. Pon el huevo batido en un recipiente poco profundo y las migas de pan en otro recipiente poco profundo. Forme la mezcla de papa y pescado en cuatro hamburguesas grandes.", "Pon una tarta de pescado en la harina, sacudiendo cualquier exceso, luego sumérgete en el huevo, asegurándote de que todos los lados estén cubiertos y finalmente rueda en las migas de pan, cubriendo todos los lados en migas. Ponlo a un lado mientras repites con las otras croquetas. En este punto, las croquetas de pescado se pueden enfriar durante hasta 24 horas hasta que se necesiten, pero de lo contrario se deben refrigerar durante al menos 20 minutos para que puedan reafirmarse.", "Cubra una bandeja para hornear con papel de hornear y coloque las croquetas de pescado en la parte superior. Rocíe con aceite de oliva y hornee por 15-20 minutos, volteándolo después de 10 minutos.", "Mientras los pasteles de pescado se cocinan, haga los guisantes cremosos. Caliente un sofrito o una sartén a fuego medio-alto. Agregue la mantequilla y, una vez caliente, agregue la cebolla junto con una pizca de sal. Freír suavemente hasta que las cebollas estén tiernas y translúcidas. Agregue los guisantes y aplaste ligeramente con la parte posterior de un tenedor. Una vez que los guisantes se hayan calentado, agregue el queso crema hasta que se derrita. Pruebe y agregue sal y pimienta según sea necesario.", "Sirva los pasteles de pescado calientes con los guisantes cremosos al lado."], "url": "www_bbc_co_uk_food_recipes_fishcakes_and_creamy_01930", "title": "Tortas de pescado y guisantes cremosos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "100 g / 3½ oz de trucha ahumada en caliente", "100g / 3½oz de puré de papa listo para usar", "pizca de copos de chile seco", "1 cucharada de cilantro fresco picado", "1 huevo de gallinas camperas", "2 cucharadas de semillas de sésamo", "1 cucharadita de cilantro fresco picado, para decorar", "2 cucharadas de alcaparras, finamente picadas", "75g / 2¾oz de yogur griego", "1 cucharadita de cebollines frescos finamente picados", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para hacer la torta de pescado, coloca el puré de papa, la trucha ahumada, los copos de chile, el cilantro y el huevo en un tazón grande y mezcle bien. Sazonar bien la mezcla con sal y pimienta negra recién molida y formar una bola.", "Enrolle la torta de pescado en las semillas de sésamo hasta que se cubra, luego aplánela en forma de patty.", "Calentar el aceite en una sartén a fuego medio. Agregue la torta de pescado y fría por tres minutos en cada lado, hasta que esté dorada y cocida.", "Para hacer el aderezo, coloca las alcaparras, el yogur, el cebollín y el jugo de lima en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la torta de pescado en el centro de un plato caliente, aplique un poco de aderezo alrededor del plato y espolvoree sobre el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_fishcakeswithlimeand_81289", "title": "Croquetas de pescado con aderezo de yogur y salsa de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de merluza de 500g / 17½oz", "sal marina y pimienta negra recién molida", "250ml / 9fl oz de leche, más extra para la salsa cheddar", "1 hoja de laurel", "Puré de patatas fritas de 500g / 17½oz", "3 huevos de gallinas camperas", "1 cucharada colmada de perejil fresco y picado", "pimienta blanca recién molida", "4 cucharadas de harina normal", "1 paquete de 200 g / 7 oz pan rallado dorado", "aceite vegetal, para freír poco", "50g / 2oz de mantequilla sin sal", "2 cucharadas de harina normal", "175g / 6oz de queso cheddar", "sal y pimienta negra recién molida"], "method": ["Coloque la merluza en una sartén grande y sazone con sal marina y pimienta negra recién molida. Verter sobre la leche y agregar la hoja de laurel, luego cubrir la bandeja con papel de aluminio y escalfar suavemente el pescado a fuego medio bajo durante 25 minutos, o hasta que el pescado esté bien cocido (la carne debe ser opaca y desmenuzarse fácilmente).", "Deja el pescado a un lado para que se enfríe, luego vierte la carne en un recipiente y descarta los huesos. Cuele el líquido que caza furtivamente en una jarra de medición, descartando cualquier sólido. Agregue suficiente leche al líquido para llevarlo a 500 ml / 17½ fl oz, luego reserve para hacer la salsa de queso más tarde.", "En un tazón grande, mezcle cuidadosamente el pescado, el puré de papas, un huevo batido y el perejil hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta blanca recién molida.", "Con las manos húmedas, divida la mezcla en cuatro porciones iguales y forme empanadas. Polvore las croquetas de pescado en la harina, sumerja en el huevo batido restante y revuelva en las migas de pan.", "Caliente unas cucharadas de aceite vegetal en una sartén y fríe las tortas de pescado durante 2-3 minutos en ambos lados, o hasta que estén doradas y crujientes por todos lados.", "Para la salsa de queso cheddar, derrita la mantequilla en una sartén a fuego medio, luego bata la harina. Cocine la mezcla durante 2-3 minutos, luego bata gradualmente en la mezcla de leche reservada hasta que quede suave. Cocine durante 10-12 minutos, o hasta que la salsa se espese un poco, luego agregue el queso cheddar rallado hasta que se derrita. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, espolvorea la salsa de queso cheddar sobre las croquetas de pescado."], "url": "www_bbc_co_uk_food_recipes_fishcakeswithcheddar_93165", "title": "Croquetas de pescado con salsa de queso cheddar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 4 tartas de pescado grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de pescado cocido surtido (salmón, merlán, abadejo)", "sal y pimienta negra recién molida", "Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas", "Polenta de 100 g / 3½ oz", "aceite vegetal, para freír poco", "200ml / 7fl oz de mayonesa lista para usar", "1 cucharada de mostaza inglesa", "1 cucharada de alcaparras, enjuagadas y escurridas", "1 cucharada de pepinillos finamente picados", "4 bollos de hamburguesa", "puñado de cohetes", "4 cuñas de limón"], "method": ["Rompe el pescado cocinado con un tenedor en un tazón. Sazonar con sal y pimienta negra recién molida.", "Divida la mezcla de pescado en 12 porciones iguales, luego moldee en forma de dedos de aproximadamente 7.5 cm / 3 pulgadas de largo y 2.5 cm / 1 pulgadas de espesor.", "Dragar los dedos de pescado en la harina, luego sumergir en el huevo batido.", "Sumerja los dedos de pescado en la polenta para cubrir completamente.", "Calentar el aceite en una sartén a fuego medio. Agregue los dedos de pescado recubiertos de polenta y fríalos por 2-3 minutos, volteándolos regularmente, hasta que estén dorados y se calienten.", "Para la salsa tártara, coloque todos los ingredientes de la salsa tartare en un tazón y mezcle bien.", "Para servir, coloca una cucharada de salsa tártara en cada panecillo, luego agrega un pequeño cohete.", "Cubra cada uno con tres dedos de pescado y un chorrito de limón."], "url": "www_bbc_co_uk_food_recipes_fishfingerbutty_89301", "title": "Butty de dedo de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de filetes de pescado blanco fresco, como lenguado o solla", "harina de maíz, para quitar el polvo", "150ml / 5fl oz de aceite de cacahuete", "150ml / 5 fl oz de caldo de pollo", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "1½ cucharada de salsa de soja oscura", "2 cucharadas de salsa de chile en grano (disponible en tiendas de comestibles asiáticas)", "½ cucharadita de pimienta blanca recién molida", "2 cucharadas de vinagre de sidra o vinagre de arroz negro chino", "2 cucharaditas de azúcar", "3 cucharadas de cebolletas finamente picadas"], "method": ["Retire la piel del pez. Corte el filete en el ancho y en una ligera diagonal en tiras de 2,5 cm (1 pulgada) de ancho. Espolvorea las piezas con harina de maíz, sacudiendo cualquier exceso.", "Calentar un wok hasta que esté muy caliente. Agregue el aceite y fríe las tiras de pescado suavemente durante 2-3 minutos hasta que estén doradas.", "Escurra las tiras de pescado cocinadas en papel de cocina.", "Vierte todo el aceite. Limpie el wok y vuelva a calentar. Agregue todos los ingredientes de la salsa agridulce, deje hervir y cocine a fuego lento.", "Agregue las tiras de pescado y cocine a fuego lento en la salsa durante dos minutos.", "Sirva en un plato caliente adornado con cebolletas."], "url": "www_bbc_co_uk_food_recipes_fishinahotandsoursau_74007", "title": "Pescado en salsa agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de aceite de oliva", "2 cebollas, peladas, finamente picadas", "Una pizca de sal marina", "3 dientes de ajo, pelados, finamente picados", "100 g / 3½ oz de chorizo ​​para cocinar, sin piel, picada", "1 chile rojo mediano, finamente cortado", "tallo de hinojo reservado, finamente picado (ver abajo)", "1 pimiento rojo, semillas eliminadas, en rodajas", "sal y pimienta negra recién molida", "2 patatas grandes harinosas, como Maris Piper o King Edward, peladas, picadas", "pellizque los hilos de azafrán, infundido en 1 vino blanco seco de vidrio", "500ml / 17fl oz de caldo de pescado o caldo de verduras", "1 x 400 g / 14 oz pueden cortar tomates", "8-12 gambas frescas, cabezas y cáscaras quitadas, sin espinas", "Filete de bacalao de 450 g / 1 lb, piel eliminada, picada", "8-12 mejillones, enjuagados, limpios, sin barba (descartar los mejillones que no se cierran herméticamente cuando se golpean)", "1 bulbo de hinojo, en rodajas finas, tallo reservado para la sopa de hojas, hojas verdes reservadas para la salsa piri-piri", "1 chile rojo, finamente picado", "manojo de perejil fresco de flatleaf, solo hojas", "½ limón, solo jugo", "hojas de hinojo verdes reservadas, finamente picadas (ver arriba)", "6 pequeños chiles rojos frescos, finamente picados", "3 tomates maduros, pieles eliminadas, picadas", "1 cucharadita de sal en escamas", "1 cucharada de ajo finamente picado, más 1 diente de ajo, pelado y cortado por la mitad", "4-6 cucharadas de aceite de oliva", "2 cucharadas de vinagre de vino tinto", "4-6 rebanadas gruesas de pan blanco crujiente", "4-6 cucharadas de aceite de oliva", "gran pizca de sal", "4-6 filetes de lubina salvaje (aproximadamente 500 g / 1 lb en total), piel anotada varias veces con un cuchillo afilado", "3-4 cucharadas de aceite de oliva", "sal al gusto", "½ limón"], "method": ["Para la sopa de pescado, caliente el aceite de oliva en una cacerola grande con tapa a fuego medio. Agregue las cebollas, la sal y el ajo y fría por 2-3 minutos, o hasta que estén blandos.", "Agregue el chorizo ​​y el chile y continúe freír durante 3-4 minutos, o hasta que el chorizo ​​esté crujiente y se haya oscurecido en color.", "Agregue el tallo de hinojo picado y el pimiento rojo y sazone al gusto con sal marina y pimienta negra recién molida. Continúa freír por 2-3 minutos.", "Agregue las papas picadas y fría por 3-4 minutos, o hasta que estén coloreadas.", "Agregue la mezcla de vino y azafrán a la sartén, raspando cualquier trozo dorado del fondo de la sartén para desglasar.", "Agregue el caldo y todos los tomates enlatados y lleve la mezcla a fuego lento. Continúe cocinando a fuego lento durante 15-20 minutos, o hasta que las papas estén tiernas y el volumen de líquido se haya reducido a la mitad.", "Agregue las gambas, el bacalao y los mejillones, cubra la olla con una tapa y deje que la mezcla hierva a fuego lento. Deje vaciar durante 4-5 minutos, o hasta que los mejillones se hayan abierto (deseche los mejillones que no se abren durante la cocción).", "Mientras tanto, para la ensalada de hinojo, en un tazón de vidrio o de cerámica, mezcle el hinojo en rodajas, el chile rojo picado y las hojas de perejil hasta que estén bien combinados. Exprima el jugo de limón y mezcle bien para cubrir las verduras. Dejar de lado.", "Mientras tanto, para la salsa de 'piri-piri', en un tazón, mezcle las hojas de hinojo, los chiles, los tomates y el ajo. Sazonar, al gusto, con sal. Rocíe el aceite de oliva y el vinagre de vino tinto y revuelva para combinar.", "Para el pan, frote las rebanadas de pan por todas partes con las mitades de ajo. Rocíe ambos lados de cada rebanada con una pizca de aceite de oliva.", "Caliente una sartén a fuego medio. Cuando la sartén esté caliente, agregue las rebanadas de pan, en lotes, y ase a la parrilla durante 1-2 minutos por cada lado, o hasta que aparezcan marcas doradas de la plancha en ambos lados. Repita el proceso con los lotes restantes de rebanadas de pan. Mantener caliente", "Para la lubina, rocíe los filetes de lubina con aceite de oliva y espolvoree la sal sobre la piel.", "Caliente una sartén a fuego alto. Cuando la sartén esté caliente, agregue los filetes de lubina, con la piel hacia abajo y la plancha durante 2-3 minutos, o hasta que la piel esté crujiente.", "Voltee los filetes de pescado y freír durante un minuto más, o hasta que la lubina esté cocida. Rocíe el jugo de limón.", "Para servir, cuchara la sopa de pescado por igual entre cuatro a seis tazones de servir. Coloque uno de los filetes de lubina encima de cada porción. Espolvorea sobre el perejil picado. Sirva el pan al lado, con la salsa de 'piri-piri' sobre ella."], "url": "www_bbc_co_uk_food_recipes_fishchowderwithpirip_92209", "title": "Sopa de pescado con salsa de piri piri y ensalada de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "1 filete de lenguado de limón, cortado en tiras", "Harina común 110g / 4oz", "1 huevo de gallinas camperas", "sal y pimienta negra recién molida", "salpicaduras de agua carbonatada", "110g / 4oz de yogur griego", "2 cucharadas de cebollín fresco, picado", "apretón de jugo de limón", "½ limón, cortado en cuñas"], "method": ["Calentar una olla de fondo grueso, un tercio lleno de aceite vegetal, hasta que una migaja de pan chisporrotee en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje desatendido).", "Coloque la harina en un tazón grande y bata al gusto con huevo y sal y pimienta negra recién molida.", "Agregue el agua carbonatada y bata para crear una mezcla con la consistencia de crema doble.", "Seca las únicas piezas en harina y luego sumerge las piezas en la masa para cubrirlas.", "Coloque en el aceite caliente y fría durante 2-3 minutos, hasta que estén crujientes y dorados. Retire con cuidado con una cuchara ranurada y drene las toallas de cocina.", "Para hacer el chapuzón, mezcle el yogur con el cebollín y el jugo de lima. Transfiera a un tazón de servir.", "Sirva los dedos de pescado en un plato con las rodajas de salsa y lima al lado."], "url": "www_bbc_co_uk_food_recipes_fishfingerswithchive_79025", "title": "Dedos de pescado con salsa de yogur y cebolleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pedazo de pan", "1 solomillo de solla", "puñado de eneldo", "100ml / 3½ fl oz crema doble", "1 huevo de gallinas camperas", "1 naranja, solo jugo", "100 ml / 3½ fl oz crema"], "method": ["Caliente el horno a 220C / 425F / Gas 7.", "Mezcle el pan, la crema, la solla, el eneldo y el huevo en un procesador de alimentos.", "Vierta en un plato redondo y engrasado de ramekin y colóquelo en un baño maría.", "Hornee en el horno durante 8-10 minutos.", "Para la crema, coloque la crema y el jugo en una olla. Llevar a ebullición y reducir durante 1-2 minutos.", "Poner en un plato y rociar con crema de naranja."], "url": "www_bbc_co_uk_food_recipes_fishmousse_75672", "title": "Mousse de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, picada", "2 dientes de ajo picados", "salpicar agua", "100ml / 3½fl oz de caldo de pescado caliente", "100g / 3½ oz de eglefino, piel removida, picada", "75ml / 2½ fl oz crema doble", "4 cucharadas de perifollo fresco picado", "sal y pimienta negra recién molida", "½ batata, pelada, cortada muy finamente en una mandolina"], "method": ["Calentar una cucharada de aceite de oliva en una sartén, agregar la cebolla y el ajo y freír durante 3-4 minutos hasta que se ablanden.", "Agregue el caldo de agua y pescado caliente y hiérvalos durante tres minutos.", "Agregue el eglefino picado y cocine durante tres minutos.", "Agregue la crema y tres cucharadas de perifollo y sazone al gusto con sal y pimienta negra recién molida. Cocine a fuego lento durante 1-2 minutos, luego vierta la mezcla en un plato gratinado.", "Coloque las rodajas de boniato sobre la mezcla de salsa de pescado, rocíe con el aceite de oliva restante y sazone al gusto con sal y pimienta negra recién molida. Coloque debajo de una parrilla mediana durante 4-5 minutos, o hasta que la parte superior esté crujiente y dorada.", "Sirva el pastel de pescado en la mesa en el plato gratinado y decore con el resto del perifollo picado."], "url": "www_bbc_co_uk_food_recipes_fishpiewithcrunchysw_89434", "title": "Pastel de pescado con cobertura de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de bacalao a 300 g / 10½ oz, pelado y cortado en cubitos", "Filete de salmón de 300 g / 10½ oz, desollado y finamente picado", "1 lima, jugo y ralladura solamente", "1 pequeño bulbo de hinojo, finamente picado", "1 manojo pequeño de cilantro fresco, finamente picado", "4-8 chiles verdes, finamente picados", "4 cebolletas, finamente picadas", "2 cucharadas de semillas de hinojo, finamente molidas", "2 cucharadas de semillas de cilantro, finamente molidas", "½ cucharadita de sal", "2 cucharadas de aceite vegetal", "1 cucharada de pasta de ajo", "1 cucharada de pasta de jengibre", "4 cucharaditas de pimienta negra molida", "1 pepino, rallado", "450 ml / 16 fl oz de yogur", "4 cucharadas de eneldo finamente picado", "½ cucharadita de ajo machacado", "1 cucharada de aceite vegetal", "½ cucharadita de semillas de mostaza", "½ cucharadita de semillas de comino", "pizca de asafétida", "4-5 hojas de curry", "arroz basmati, hervido, suficiente para 4"], "method": ["En un procesador de alimentos, mezcle el bacalao hasta que esté finamente picado.", "En un tazón grande mezcle el bacalao picado, el salmón picado y la ralladura de lima.", "Agregue el hinojo picado, cilantro picado, chiles verdes, cebollas de primavera, semillas de hinojo, semillas de cilantro, sal, dos cucharadas de aceite, pasta de ajo, pasta de jengibre, dos cucharaditas de pimienta negra molida y jugo de lima y mezcle bien.", "Moldee la mezcla de pescado en 12 brochetas, formando 12 kebabs de pescado.", "Para hacer la raita de pepino, exprima el exceso de agua del pepino rallado.", "Mezcle el pepino y el yogur, y mezcle el eneldo, el resto de la pimienta negra y el ajo.", "Calentar una cucharada de aceite en una sartén pequeña y freír las semillas de mostaza, las semillas de comino, asafoetida y las hojas de curry durante 2-3 minutos, revolviendo, hasta que estén fragantes.", "Mezcle la mezcla de semillas de mostaza frita en la raita.", "O bien, asa los kebabs en una barbacoa hasta que se doren por ambos lados o calienta una cucharada de aceite en una sartén grande y fríe los kebabs hasta que estén dorados por ambos lados.", "Sirve los kebabs recién hechos con pepino raita y arroz basmati."], "url": "www_bbc_co_uk_food_recipes_fishkebabswithcucumb_74039", "title": "Brochetas de pescado con raita de pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalote, pelado y picado", "aceite de oliva", "110ml / 4fl oz de caldo de pescado", "Crema doble 110ml / 4fl oz", "sal y pimienta negra recién molida", "300 g / 10½ oz de hojaldre listo para enrollar", "700g / 1½lb de pescado, cortado en trozos (salmón, bacalao, eglefino o mezcla)", "110 g / 4 oz de champiñones, en rodajas", "3 cucharadas de cebollín, picadas", "4 rebanadas de queso Emmental", "2 cucharadas de mostaza de grano", "1 huevo, golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Saltee la chalota en un poco de aceite de oliva. Después de unos minutos agregue el caldo de pescado y la crema y deje que hierva. Sazonar y dejar a un lado.", "Estirar la masa al doble del tamaño del plato resistente al horno.", "Coloque el pescado, champiñones y cebollín en el plato. Sazonar y cubrir con la salsa.", "Extienda la mitad de la masa con la mostaza y el queso. Dobla la otra mitad por encima, colocando la mostaza y el queso en el medio.", "Cubra el pastel con la masa, doble los bordes y luego lave los huevos.", "Hornea por 25-30 minutos."], "url": "www_bbc_co_uk_food_recipes_fishpiewithcheesepas_11071", "title": "Pastel de pescado con costra de hojaldre de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2¼lb huesos de pescado y piel", "1 zanahoria, pelada y picada", "1 cebolla, pelada y descuartizada", "1 tallo de apio, más o menos picado", "½ bulbo de hinojo, toscamente picada", "6 granos de pimienta negra", "1 hoja de laurel seca", "3 tallos frescos de perejil"], "method": ["Pon todos los ingredientes en una sartén grande y cúbrelos con agua. Llevar a ebullición y quitar toda la espuma que se haya formado. Cubra y cocine a fuego lento con cuidado durante 20-30 minutos. Colar en un tazón grande y dejar enfriar.", "Use dentro de 3 días o congele. Para congelar, reduzca el caldo a la mitad hirviéndola vigorosamente y enfríe. Verter en bandejas de cubitos de hielo y congelar. Cuando esté congelado, coloque los cubos en una bolsa, etiquételos, y cuando quiera usar uno, simplemente coloque una jarra y agregue agua hirviendo para disolver el cubo."], "url": "www_bbc_co_uk_food_recipes_fishstock_1296", "title": "Recursos pesqueros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 1-2 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Recortes de pescado de 250 g / 9 oz (puede incluir cabezas y huesos y la piel de la mayoría de los tipos de pescado, pero trate de evitar el salmón, el salmonete y el pescado azul)", "3 puerros", "1 bulbo de hinojo", "3 zanahorias", "gran puñado de perejil fresco", "175ml / 6fl oz de vino blanco seco"], "method": ["Enjuague los huesos de pescado y los restos de cualquier sangre, lo que haría que el caldo parezca turbio y tenga un sabor amargo. Pica los puerros aproximadamente y ponlos en una olla grande de fondo grueso.", "Picar el hinojo y las zanahorias aproximadamente y agregar a la olla.", "Pica el perejil, incluidos los tallos, y agrégalo a la olla.", "Agregue los restos de pescado a la olla.", "Vierta el vino blanco, luego agregue suficiente agua fría para cubrir el pescado y las verduras (aproximadamente 1 litro / 2 pintas).", "Coloque la olla a fuego alto y lleve el líquido a fuego lento. Después de cinco minutos, quite la espuma que se forma en la superficie con una cuchara y deséchela. Reduzca el fuego y cocine a fuego lento, cubierto, durante aproximadamente 25 minutos, rozando según sea necesario.", "Al final del tiempo de cocción, retire el caldo del fuego y colar, descartando los restos de pescado y las verduras.", "Enfríe y guárdelo en la nevera por hasta tres días o congélelo. Alternativamente, puede reducir aún más el stock y luego congelarlo en bandejas de cubitos de hielo (congelarlo de esta manera significa que puede descongelar tanto o tan poco como necesite a la vez)."], "url": "www_bbc_co_uk_food_recipes_fishstock_90209", "title": "Recursos pesqueros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde alrededor de 1 litro / 2 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla roja, finamente picada", "5 tomates, pieles y semillas retiradas, finamente picadas", "3-4 chiles, semillas retiradas y finamente picadas", "1 cucharadita de azúcar", "1 lima, solo jugo", "4 cucharadas de cilantro fresco picado", "pizca de sal", "1 aguacate grande, pelado, reducido a la mitad, piedra eliminada", "1 guindilla verde, sin semillas", "1 lima, solo jugo", "2 cebollas de primavera, picadas", "1 cucharada de cilantro fresco picado", "3 cucharadas de aceite vegetal", "½ cucharadita de sal", "2 x 325g / 12oz lubina, fileteada", "sal y pimienta negra recién molida", "Harina normal 225g / 8oz", "2 huevos de gallinas camperas", "200 ml / 7 fl oz de agua", "aceite de girasol, para freír", "8 tortillas de harina blandas, calentadas en un horno o microondas", "225 g / 8 oz de lechuga iceberg, finamente triturado", "300ml / 10 oz crema agria"], "method": ["Para la salsa, coloque todos los ingredientes de la salsa juntos en un tazón y mezcle bien para combinar. Dejar de lado.", "Para el guacamole, coloque todos los ingredientes de guacamole en un procesador de alimentos y mezcle hasta que quede suave.", "Para los tacos, corte los filetes de pescado en tiras de 1cm / ½ pulgada de ancho y sazone con sal y pimienta negra recién molida. (Puede usar el resto del pescado para hacer reservas de peces o para otra receta).", "Coloque la harina, los huevos, el agua y una pizca de sal en un procesador de alimentos y mezcle hasta que quede suave.", "Caliente una freidora a 190C / 375F. Alternativamente, llene a medias un sartén de espesor grueso con aceite de girasol y caliente hasta que un cubo de pan caiga en chispas y se vuelva dorado en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las tiras de pescado en la mezcla, luego fríe en lotes en el aceite durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque los envoltorios de tortilla sobre un plato o superficie plana y coloque algunas hojas de lechuga en el centro de cada envoltorio. Coloque el pescado frito sobre la lechuga, luego cubra con salsa y crema agria. Dobla los lados, enrolla todo lo que puedas y sirve cada taco con una cucharada de guacamole."], "url": "www_bbc_co_uk_food_recipes_fishtacoswithguacamo_90762", "title": "Tacos de pescado con guacamole", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]