[{"isVegetarian": true, "title": "Sweet potato steamed pudding", "url": "www_bbc_co_uk_food_recipes_sweetpotatosteamedpu_71406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter, for greasing", "110g/4oz self-raising flour", "110g/4oz caster sugar", "110g/4oz unsalted butter", "2 eggs", "½ sweet potato, diced and boiled until soft", "2.5cm/1 inch piece of ginger, peeled and finely chopped", "110g/4oz caster sugar", "5cm/2 inch piece of ginger, peeled and finely chopped", "1 orange, peeled and segmented, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a small pudding basin with butter.", "Place the flour, sugar, butter, eggs and sweet potato into a food processor. Blitz together until smooth and combined.", "Pour the mixture into the bowl and cover with cling film.", "Place in the microwave and cook on HIGH for four minutes.", "To make the ginger syrup, gently heat the sugar in a heavy-based pan and cook over a low heat until dissolved and a caramel has formed. Add the chopped ginger, shaking the pan until it is well coated in the caramel.", "Turn out the sponge pudding onto a serving dish and drizzle the ginger syrup over. ", "Garnish with the segmented orange and serve."]}, {"isVegetarian": true, "title": "Sweet potato tagine with lemon couscous", "url": "www_bbc_co_uk_food_recipes_sweetpotatotaginewit_89764", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, thickly sliced", "2 garlic cloves, finely chopped", "1 tsp ras-el-hanout", "½ tsp ground cinnamon", "½ tsp ground ginger", "½ tsp smoked sweet paprika", "½ tsp ground cumin", "¼ tsp freshly ground black pepper", "1kg/2lb 4oz sweet potatoes, peeled and cut into large chunks", "1 x 400g/14oz can chopped tomatoes", "2 tbsp honey", "½ tsp saffron", "200ml/7fl oz water", "40g/1½oz preserved lemons, finely chopped", "125g/4½oz dried apricots, halved", "110g/4oz green olives, stones removed", "40g/1½oz whole almonds", "1 small bunch coriander", "200g/7oz couscous", "2 tbsp extra virgin olive oil", "10g/½oz preserved lemons, rinsed, drained, pulp removed, flesh finely chopped", "½ lemon, juice only", "2 tbsp chopped fresh coriander leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tagine, heat a large, deep frying pan with a lid until hot. Add the olive oil, onions and garlic and cook for 2-3 minutes.", "Add all of the spices and fry for one minute.", "Add the sweet potatoes and stir well.", "Add all the remaining ingredients, except the coriander, stir well and bring the mixture to a simmer.", "Chop the coriander stalks, reserving the leaves for later, and add the stalks to the pan. Reduce the heat, cover with a lid, and simmer for 15-20 minutes, or until the sweet potato is just tender. ", "For the couscous, place the couscous into a heatproof bowl and pour over enough boiling water to cover the couscous by 1.5cm/½in. ", "Add the olive oil, preserved lemon and lemon juice and a pinch of salt. Stir well, then cover with cling film and set aside for 3-5 minutes, or until all the liquid has been absorbed.", "Remove the cling film and fluff the couscous up with a fork. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon some couscous onto each plate. Spoon the tagine onto the couscous and sprinkle over the reserved coriander leaves."]}, {"isVegetarian": true, "title": "Sweet potato wedges with cheese fondue", "url": "www_bbc_co_uk_food_recipes_sweetpotatowedgeswit_79688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sweet potato, peeled and cut into thick wedges", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp fresh chives, chopped ", "150g/5½oz St Agur blue cheese", "100ml/3½fl oz double cream", "50ml/2fl oz white wine", "1 tbsp fresh chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the wedges, place the sweet potato wedges into a saucepan of boiling water and blanch for two minutes. Drain and pat dry with kitchen towels.", "Place the sweet potato wedges on a baking sheet, drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper.", "Place in the oven and bake for ten minutes, or until cooked through.", "Remove from the oven, transfer to a warm bowl and sprinkle with chives.", "To make the fondue, place the cheese, cream and wine into a small saucepan over a medium heat. Once the cheese has melted, add the chopped chives and stir well. ", "Pour the sauce into a warm bowl and serve beside the sweet potato wedges for dipping."]}, {"isVegetarian": true, "title": "Sweet potato wedges", "url": "www_bbc_co_uk_food_recipes_sweetpotatowedges_83345", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetpotatowedges_83345_16x9.jpg", "ingredients": ["2 sweet potato, cut into wedges", "4 tbsp olive oil", "1 tbsp thyme leaves", "salt and freshly ground black pepper", "chervil, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Toss the wedges with the oil and thyme then season well with salt and freshly ground black pepper.", "Roast in the oven for 15-20 minutes, until lightly browned.", "Serve in a warm bowl and garnish with chervil."]}, {"isVegetarian": false, "title": "Sweet potato wedges with spiced beef", "url": "www_bbc_co_uk_food_recipes_sweetpotatowedgeswit_80802", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ sweet potato, skin on, cut into wedges ", "2 tbsp olive oil ", "salt and freshly ground black pepper", "1 tbsp soy sauce ", "1 tbsp ketchup ", "1 tsp Dijon mustard", "1 tbsp olive oil ", "100g/3½oz minced beef ", "1 clove garlic, chopped", "1 tbsp chopped chives", "2 tbsp chopped coriander ", "1 tbsp soy sauce", "100g/3½oz yoghurt", "½ clove garlic, chopped ", "handful of mint, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the sweet potato wedges on a baking tray and drizzle with the oil. Season with salt and freshly ground black pepper, then place into the oven for 15 minutes. ", "Remove from the oven and brush with the soy, ketchup and mustard.", "Make the spiced beef. In a hot non-stick frying pan, heat the oil, then add the beef. Cook for 5 minutes until browned and completely cooked through.", "Add the garlic and cook for a further 2 minutes. Finish by stirring in the chives, coriander and soy. Take off the heat.", "Make the yoghurt dip. In a bowl mix the yoghurt with the garlic and mint, then season with salt and freshly ground black pepper.", "To serve, place the sweet potato wedges on the plate and top with the spiced beef and a dollop of the yoghurt dip."]}, {"isVegetarian": false, "title": "Sweet potato and chicken stew with coriander and lime paste", "url": "www_bbc_co_uk_food_recipes_sweetraguwithcoriand_87299", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 onion, chopped", "1 sweet potato, peeled and chopped", "½ skinless chicken breast, sliced into strips", "3 cardamom pods, seeds removed and crushed ", "3 bay leaves", "1 tsp paprika", "100ml/3½fl oz white wine", "100ml/3½ fl oz water", "½ chicken stock cube", "100ml/3½fl oz double cream", "4 tbsp fresh coriander leaves", "2 garlic cloves", "1 lime, juice and zest only", "2 tbsp vegetable oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stew, heat the oil in a frying pan and add the onion and sweet potato. Sauté for 2-3 minutes then add the chicken, crushed cardamom seeds, bay leaves and paprika. Then add the wine, water, stock cube and cream, stirring well. Simmer for five minutes or until the chicken is cooked through and the sauce has reduced by half. Pour into a serving bowl and put aside.", "For the coriander and lime paste, place the ingredients into a mini food processor and blend together until smooth. ", "Spoon the paste over the stew and serve."]}, {"isVegetarian": true, "title": "Sweet saffron yoghurt (shrikand)", "url": "www_bbc_co_uk_food_recipes_sweetsaffronyoghurts_86570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints whole milk yoghurt OR 500ml/17½fl oz Greek-style yoghurt (It is necessary to have a larger quantity of whole milk yoghurt than of Greek-style yoghurt because whole milk yoghurt will lose more water when drained.)", "milk, for infusing", "½ tsp saffron threads ", "6-8 tbsp icing sugar, or to taste ", "¼ tsp freshly ground green cardamom seeds, or to taste", "2 tbsp chopped unsalted pistachios", "2 tbsp flaked or sliced almonds  ", "edible silver leaf (available from Asian grocers, optional)", "pomegranate seeds"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Line a large sieve with a double layer of paper kitchen roll. Place a bowl under the sieve and pour in the yoghurt. Refrigerate for as long as possible to allow the liquid to drain off the yoghurt. This will take a minimum of 5-6 hours.", "Heat a little milk in a small pan. Place two teaspoons of the milk into a small bowl and crumble the saffron strands into it (the rest of the milk can be used in another dish). Allow the saffron to infuse the milk for about ten minutes using the back of a spoon to crush the saffron further into the milk.", "Remove the yoghurt from the fridge (the liquid in the bowl below can be discarded). Sift the sugar into the thickened yoghurt, then add the saffron milk and ground cardamom. Cover and chill in the fridge.", "To serve, divide the yoghurt among four bowls and garnish with the nuts, silver leaf (if using) and pomegranate seeds."]}, {"isVegetarian": true, "title": "Sweet shallots", "url": "www_bbc_co_uk_food_recipes_sweetshallots_4952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter and a splash of olive oil", "200-300g/7-10oz shallots", "1 tsp honey or a heaped tsp of sugar", "water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the shallots in boiling water for a couple of minutes. This makes removing the skins easier. ", "Melt the butter with the oil in a frying pan and add the peeled shallots. Fry for a minute and then sprinkle with sugar or add the honey and coat the shallots. Take care that the shallots don t start to burn.", "Season well and then pour over enough cold water to cover. Bring to the boil and cook on a medium heat until all the liquid is reduced and the shallots are softened and caramelised."]}, {"isVegetarian": false, "title": "Sweet sticky spicy ribs with red onion salad", "url": "www_bbc_co_uk_food_recipes_sweetstickyspicyribs_85067", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetstickyspicyribs_85067_16x9.jpg", "ingredients": ["1.5kg/3lb 4oz meaty rack of pork spare ribs", "water, to cover", "1 onion, chopped", "2 garlic cloves, lightly crushed", "½ tsp black peppercorns", "2 tbsp olive oil", "2 onions, roughly chopped", "4 garlic cloves, crushed", "2 red chillies, finely chopped", "½ tsp dried chilli flakes", "2 tsp fennel seeds, crushed", "110g/4oz dark brown sugar", "600g/1lb 5oz tomato ketchup", "110ml/4fl oz dark soy sauce", "2 red onions, finely sliced", "6 tomatoes, cut into chunks", "1 small bunch fresh flatleaf parsley, leaves only", "3 tbsp extra virgin olive oil", "1 tbsp red wine vinegar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To poach the ribs, place the ribs into a large, wide saucepan or stockpot over a high heat. Cover with water and add the onion, garlic and peppercorns. Bring to the boil, then reduce the heat and simmer, covered, for one hour, or until the meat is tender.", "Preheat the oven to 180C/455F/Gas 4.", "For the marinade, heat a deep-sided frying pan until hot, then add the olive oil, onions and garlic. Fry for 4-5 minutes, or until the onion has softened.", "Add the chillies, chilli flakes, fennel seeds and brown sugar and cook for a further 1-2 minutes, until the sugar has melted.", "Add the tomato ketchup and soy sauce. Bring to the boil, then reduce the heat and simmer for ten minutes, until thickened. Remove from the heat and allow to cool slightly, then transfer to a food processor and blend to a smooth paste.", "Remove the ribs from the poaching liquor and place onto a baking tray. Spoon the marinade over the ribs, turning to make sure they are completely coated. Place into the oven to roast for 15 minutes, or until sticky and heated through.", "Remove from the oven and slice the rack into individual ribs.", "For the salad, place the red onion, tomatoes and parsley leaves into a bowl.", "Place the olive oil and vinegar into a separate bowl and whisk to combine. Pour the dressing over the salad and season, to taste, with salt and freshly ground black pepper.", "To serve, place the ribs onto plates and place a portion of salad alongside."]}, {"isVegetarian": true, "title": "Swiss roll with fresh blackberries and vanilla cream", "url": "www_bbc_co_uk_food_recipes_swiss_roll_with_fresh_97574", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium free-range eggs", "110g/4oz caster sugar, plus extra for dusting", "1 vanilla pod, seeds only", "75g/2½oz self-raising flour", "200ml/7fl oz double cream", "1 tsp vanilla extract", "200g/7oz whole blackberries", "250g/9oz blackberries", "100g/3½oz caster sugar", "icing sugar, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Swiss roll sponge, preheat the oven to 190C/375F/Gas 5 and line a 23x33cm/9x13in Swiss roll tin with baking parchment.", "Place the eggs, sugar and vanilla seeds into a bowl and whisk until very light, fluffy and thickened.", "Sift the flour over the mixture and fold in.", "Pour the mixture into the lined tin and smooth it out with a spatula until evenly spread.", "Bake the sponge for 10-12 minutes, or until just firm to the touch.", "Place a sheet of baking parchment that is slightly bigger than the tray onto the work surface and dust with some caster sugar", "Flip the sponge over onto the parchment paper, then peel off the parchment on the bottom of the sponge. Set aside to cool slightly.", "Whip the double cream with the vanilla extract in a bowl until soft peaks form when the whisk is removed.", "For the blackberry compôte, place the blackberries, sugar and four tablespoons of water in a small saucepan and simmer for five minutes, then leave it to cool and thicken.", "To assemble the Swiss roll, spread the blackberry compôte over the cooled sponge, leaving a 2cm/1in gap around the edge.", "Spread the whipped cream over the top of the jam and then sprinkle over the whole blackberries.", "Take the longest edge, then using the parchment paper underneath to start it off, roll up the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the parchment, dust with extra caster sugar and cut into slices to serve."]}, {"isVegetarian": true, "title": "Swiss roll with homemade raspberry jam", "url": "www_bbc_co_uk_food_recipes_swiss_roll_with_homemade_90772", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swiss_roll_with_homemade_90772_16x9.jpg", "ingredients": ["450g/1lb fresh raspberries", "400g/14oz jam sugar", "5 free-range eggs", "125g/4½oz caster sugar, plus extra for dusting", "2 vanilla pods, split, seeds scraped out using the tip of a sharp knife", "95g/3¼oz self-raising flour, sifted", "500ml/18fl oz double cream", "75g/2½oz fresh raspberries, for the garnish", "8 tiny sprigs fresh mint or lemon verbena, for the garnish", "1 tbsp chopped pistachios, for the garnish (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the raspberry jam, heat the raspberries, sugar and 3 tablespoons water in a large, heavy-based saucepan over a low heat for 2-3 minutes, or until the sugar has dissolved. Increase the heat and cook the mixture for a further 6-8 minutes, or until it has thickened enough to coat the back of a spoon. ", "Set aside 75g/2½oz of the jam to use in the Swiss roll. Pour the remaining jam into hot, sterilised jars, seal, and set aside to cool.", "For the sponge, preheat the oven to 190C/170C Fan/Gas 5. Line a 38x25cm/15x10in Swiss roll tin with baking parchment.", "In a large bowl, whisk together the eggs, sugar and half the vanilla seeds until very light, thick and fluffy. Fold in the sifted flour using a metal spoon, trying to retain as much air as possible in the batter.", "Pour the batter into the prepared tin and smooth the surface using a spatula. Bake in the oven for 10-12 minutes, or until the sponge has risen and is just firm to the touch (it should spring back when pressed lightly with a finger). ", "Place a clean, damp tea towel that is slightly bigger than the Swiss roll tin onto a work surface and dust it with caster sugar. Turn the sponge out onto the tea towel, then carefully peel away the baking parchment. ", "With the longest edge of the sponge facing you, roll up the sponge firmly but gently in the tea towel, making the roll as tight as you can. Carefully unroll the sponge and leave to cool completely.", "To assemble the Swiss roll, whip the double cream with the remaining vanilla seeds until firm peaks form when the whisk is removed.", "Spread the raspberry jam all over inside of the cooled sponge, leaving a 2cm/1in border at the long edge that’s furthest from you. Spread most of the cream on top of the jam.", "Roll up the sponge again, starting at the long edge closest to you (as before) and using the tea towel to guide you. Aim to make the Swiss roll as tight as possible without squeezing out the filling.", "Using the tea towel, lift the Swiss roll onto a serving plate, with the seam against the plate. Dust with a little more caster sugar and garnish with raspberries and the mint or lemon verbena sprigs. If desired, decorate the top of the Swiss roll with quenelles of the remaining whipped cream, then sprinkle with the pistachios, if using."]}, {"isVegetarian": true, "title": "Swiss muesli", "url": "www_bbc_co_uk_food_recipes_swissmuesli_7252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz rolled oats", "170g/6oz raisins or sultanas", "110g/4oz dried apricots, roughly chopped", "110g /4oz hazelnuts, split in half and roasted", "350ml/12fl oz fresh apple juice", "2 apples (coxes or granny smiths) peeled and coarsely grated", "1 small tub Greek or natural yoghurt", "4 ripe apricots, roughly chopped", "clear honey to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl mix together the oats, raisins, apricots and hazelnuts. Pour over the apple juice and leave for 10-15 minutes to allow the oats and dried fruit to soak up the juice.", "Divide the muesli between 6 glass bowls and top with the grated apple. Spoon on a dollop of yoghurt and drizzle over some honey. Serve immediately."]}, {"isVegetarian": true, "title": "Swiss cheese fondue", "url": "www_bbc_co_uk_food_recipes_swisscheesefondue_8925", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swisscheesefondue_8925_16x9.jpg", "ingredients": ["1 clove garlic, halved", "290ml/½ pint white wine", "1 tsp lemon juice", "225g/8oz emmental cheese grated", "225g/8oz gruyère cheese grated", "1 tsp cornflour", "1 tbsp kirsch (optional)", "cubed bread pieces, for dipping"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the inside of the fondue pot with the halves of garlic.", "Add the wine and lemon juice to the pot and heat until boiling. Lower the heat and gradually stir in the cheeses until melted, stirring all the time.", "If using kirsch, blend with the cornflour, otherwise use water. Add to the cheese mixture and cook gently until the mixture is smooth - don't let it boil or it will burn.", "Using the fondue prongs, dip the bread cubes into the cheese and serve."]}, {"isVegetarian": true, "title": "Syllabub", "url": "www_bbc_co_uk_food_recipes_syllabub_70037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["290ml/¼ pint double cream", "55g/2oz caster sugar", " ½ lemon, finely grated zest", "3 tbsp lemon juice", "150ml/5fl oz sweet white wine or Madeira"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Warm the sugar, juices and zest gently until the sugar is dissolved and allow to cook completely.  ", "Add the wine or Madeira.", "Whip the cream to soft peaks.  Fold in the wine mixture.  ", "Pour into tall-stemmed glasses and chill well.", "Serve decorated with grapes and a small sprig of rosemary."]}, {"isVegetarian": false, "title": "Syrian-inspired brunch", "url": "www_bbc_co_uk_food_recipes_syrian-themed_brunch_15028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/syrian-themed_brunch_15028_16x9.jpg", "ingredients": ["450g/1lb dried chickpeas, soaked overnight in cold water, with 1 tsp bicarbonate of soda ", "2 large Arabic flatbreads ", "1 beef tomato, sliced", "2 pickles, sliced", "handful fresh parsley leaves, finely chopped", "½ lemon", "salt and freshly ground black pepper", "handful fresh coriander leaves ", "handful fresh parsley leaves ", "1 garlic clove", "1 tsp ground cumin", "1 tsp coriander seeds  ", "25g/1oz sesame seeds ", "1 litre/1¾ pints vegetable oil", "good pinch sumac, to garnish", "3 tbsp tahini ", "3 tbsp plain yoghurt ", "good squeeze lemon juice", "1 tbsp tahini", "1 garlic clove", "drizzle olive oil", "2 tbsp plain yoghurt ", "1 lemon, juice only", "1–2 ice cubes ", "1½ tsp vegetable oil", "50g/1¾oz lamb mince", "good pinch sumac, to garnish", "handful fresh parsley leaves, to garnish ", "400g tin fava beans/broad beans, drained ", "handful fresh parsley leaves ", "1 beef tomato, roughly chopped", "squeeze lemon juice ", "2 tbsp pomegranate molasses ", "good pinch ground cumin", "2–3 spring onions, thinly sliced", "2 pitta breads", "good pinch sumac, to garnish", "drizzle olive oil, to garnish"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Drain the chickpeas and tip two-thirds of them into a saucepan, reserving the last third for the falafels. Cover with water and bring to the boil. Reduce the heat and simmer for 45–50 minutes, or until tender. Alternatively, cook in a pressure cooker for 20 minutes. Drain, reserving the cooking liquid. ", "Meanwhile, to make the falafels, put the reserved uncooked chickpeas in a food processor and blend with the fresh coriander, parsley, garlic, spices and sesame seeds. Add a little warm water if the mixture is too thick. Season to taste. Shape into 20 falafels. ", "To make the falafel sauce, mix the tahini with the yoghurt and lemon juice and season to taste. ", "To make the hummus, put half the cooked chickpeas in a food processor. Add the tahini, garlic, olive oil, yoghurt, lemon juice and some seasoning. Add the ice cubes and blend again, until you have a smooth hummus. Heat the vegetable oil in a small saucepan over a medium heat. Fry the lamb mince until golden brown, breaking it up as it cooks. ", "Spoon half the hummus into a dish and top with the cooked lamb. Garnish with the sumac and parsley. Keep the remaining hummus for the fatteh.", "To make the chickpea salad, mix half the remaining cooked chickpeas with the beans. Add the remaining ingredients and season to taste. ", "To make the fatteh, preheat the grill to high and toast the pitta breads. Leave to cool, then cut into cubes. Drizzle with a little chickpea cooking liquid. Spoon the remaining hummus into a small bowl and mix with a little chickpea cooking liquid – it should be a little thicker than double cream. Place the lightly soaked pittas on a serving dish. Cover with the last of the cooked chickpeas. Garnish with the sumac and olive oil. ", "Heat a deep saucepan of vegetable oil to 160°C, or until a cube of bread browns in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the falafel in batches for 5 minutes, or until golden brown. Drain on kitchen paper and sprinkle with sumac.", "Split the flatbreads in half so you have four large circles. Spoon falafel sauce along the middle, top each with five falafel, a quarter of the beef tomato and pickles, some parsley and a squeeze of lemon. Wrap. Repeat for the remaining wraps. ", "Place a griddle over a high heat and, when hot, cook the wraps until hot and charred. ", "Serve the flatbread wraps with the fatteh, chickpea salad and hummus. Serve with the chickpea salad, fatteh and hummus. "]}, {"isVegetarian": true, "title": "Syrup sponge", "url": "www_bbc_co_uk_food_recipes_syrupsponge_88975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz butter, plus extra for greasing ", "4 tbsp golden syrup", "100g/4oz caster sugar ", "½ lemon, juice and zest only", "2 medium free-range eggs ", "225g/8oz self raising flour, sifted ", "2 tbsp milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1 litre/2 pint pudding basin with butter. Pour the golden syrup into the basin.", "In a mixing bowl, cream together the butter and sugar until light and fluffy (a handheld electric whisk works best). Stir in the lemon zest. ", "Beat in the eggs, one at a time, alternating each egg with a tablespoon of flour. Fold in the remaining flour, lemon juice and milk and pour into the basin, covering the syrup. ", "Cut out a circle of greaseproof paper one and a half times as large as the diameter of the pudding basin. Fold a pleat along the middle of the greasproof paper and place over the top of the pudding basin. Tie securely with a piece of string and tie a separate loop of string across the top to form a handle. Trim off any excess greaseproof paper.", "Place an upturned saucer into the base of a large lidded saucepan. Sit the basin on the upturned saucer and carefully fill the pan with boiling water until it comes two-thirds of the way up the sides of the pudding basin. Make sure the water doesn't come into contact with the greaseproof paper, which could make the pudding soggy.", "Place the lid on the pan, place over a low-medium heat and bring the water to a gentle simmer. Steam for one-and-a-half hours, checking the water level from time to time and topping up with more boiling water if necessary. (Do not lift the lid for the first 30 minutes of cooking or the sponge may collapse.)", "Carefully lift the pudding basin out of the pan using the string handle. Remove the greaseproof paper, gently run a knife around the edge of the pudding basin and turn the syrup sponge out onto a serving plate. Serve at once."]}, {"isVegetarian": false, "title": "Sichuan beef with pickled cucumber salad", "url": "www_bbc_co_uk_food_recipes_szechwanbeefwithpick_85438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucumbers, peeled, seeds removed, cut into 5cm/2in long batons", "large pinch salt", "100ml/3½oz groundnut oil", "1 tsp chilli oil", "1 garlic clove, crushed", "Small red chilli, seeds removed, chopped", "25g/1oz sugar", "1 tsp Sichuan peppercorns, roasted in a dry frying pan, crushed", "0.5cm/quarter in piece fresh ginger, peeled, cut into matchsticks", "30ml/1fl oz rice wine vinegar", "2 spring onions, finely chopped ", "220g/7½oz bamboo shoots from a can, rinsed and drained", "100g/3½oz mangetout, finely sliced ", "2 tbsp bean sprouts", "1 tbsp Sichuan peppercorns, roasted in a dry frying pan, crushed ", "4 x 200g/7oz beef fillet steaks", "1 tbsp vegetable oil", "1 tbsp sesame seeds", "fresh coriander leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the cucumber batons into a colander and sprinkle with salt, tossing to cover evenly. Leave to drain for 20-25 minutes, to remove excess moisture, then rinse in cold water and pat dry.", "In a small saucepan warm the groundnut oil and chilli oil. Add the garlic and chilli and warm for a minute.", "Add the sugar, Sichuan peppercorns, ginger and rice wine vinegar, bring to the boil and simmer for five minutes.", "Add the cucumber and spring onions, increase the heat to high and boil for 10-15 seconds. Remove the pan from the heat and set aside to go completely cold.", "When the liquid is cold, add the bamboo shoots, mangetout and bean sprouts. ", "For the steak, season the steaks with salt. Brush the steaks with vegetable oil and then dip into the peppercorns to coat.", "Fry the steaks in a very hot frying pan for 3-4 minutes on each side, or until cooked to your liking.", "Remove the steak from the pan and sprinkle with sesame seeds. Allow to rest for five minutes, then cut into slices.", "To serve, place spoonfuls of the salad onto plates and top with slices of beef. Garnish with fresh coriander leaves."]}, {"isVegetarian": true, "title": "Syrup sponge in the microwave", "url": "www_bbc_co_uk_food_recipes_syrupspongewithprope_4983", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/syrupspongewithprope_4983_16x9.jpg", "ingredients": ["125g/4oz butter, melted, plus extra to grease the pudding bowl", "125g/4oz caster sugar", "2 eggs", "150g/5oz plain flour", "1 tsp baking powder", "2 small lemons, zest and juice", "1-2 tbsp milk", "4 tbsp golden syrup, or jam if preferred, to serve", "custard, optional, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1.2 litre/2 pint bowl (suitable for the microwave). Sieve together the flour and baking powder. Tip the butter, sugar, eggs, flour and baking powder into a food processor and mix to a paste. If you're not using a food processor beat the sugar and butter together in a bowl, then mix in the eggs, baking powder and flour.", "Add the lemon juice and zest, continue to mix and add enough milk for the mixture reach a dropping consistency. (Hold a spoonful of the mixture upside down and it should drop off after a slight pause.)", "Spoon the mixture into the greased bowl. Cover with cling film and microwave on full power for four minutes (or until the sponge begins to shrink from the sides and is springy to the touch).", "Leave to stand for 2-3 minutes before turning out and serving with golden syrup or jam and custard."]}, {"isVegetarian": false, "title": "T-bone steak with bearnaise sauce and a green salad", "url": "www_bbc_co_uk_food_recipes_t-bone_steak_with_38432", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp French dressing", "2 tbsp honey", "2 tbsp white balsamic vinegar", "500ml/18fl oz vegetable oil", "5g finely chopped shallot", "½ garlic clove, sliced", "1 tsp chopped fresh basil", "1 tsp chopped fresh thyme leaves", "1 tsp chopped chives", "1 tsp chopped fresh parsley leaves", "1 tsp fresh yeast", "400ml/14fl oz beer", "200g/7oz plain flour", "vegetable oil, for deep-frying", "2 small onions, finely sliced into rings", "2 x T-bone steaks", "4 tbsp rapeseed oil", "3 tbsp tarragon vinegar", "3 tbsp white wine", "¼ tsp white peppercorns", "½ small banana shallot, finely chopped", "125g/4½oz butter", "2 free-range egg yolks", "½ lemon, juice only", "1 tbsp chopped tarragon leaves ", "sea salt and freshly ground black pepper", "25g/1oz baby spinach leaves", "1 Little Gem lettuce", "½ head broccoli, florets finely sliced", "100g/3½oz French green beans, cooked"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place all the dressing ingredients in a food processor and blend until smooth. Set aside.", "For the deep-fried onion rings, whisk the yeast and beer together in a large bowl. Add the flour and whisk to a smooth batter. Set aside for 5 minutes. ", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Dip the onion rings in the batter then lower them carefully into the hot oil (you may need to do this in batches). When the onion rings are golden-brown, remove them from the oil using a slotted spoon and season with salt and pepper. Drain on kitchen roll and keep warm in a low oven until ready to serve.", "For the T-bone steak, heat a large frying pan and add the oil. Once hot, add the steak. Cook on each side for 2-3 minutes, depending on how you like your steak cooked. Set aside to rest in a warm place.", "For the béarnaise sauce, put the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Simmer until the volume of liquid has reduced to about one tablespoon. Strain the liquid into a bowl and then set aside to cool. ", "Meanwhile, melt 100g/3½oz of the butter in a small saucepan set over a medium heat. ", "Put the egg yolks in a bowl set over a pan of simmering water and whisk until thickened and light in colour. Gradually add the melted butter, whisking constantly. Season with salt and black pepper. Add the cooled shallot reduction, lemon juice and the chopped tarragon leaves and mix well. Turn off the heat and leave the bowl over the pan until ready to use.", "To serve, place the green salad ingredients in a bowl. Add the dressing and toss to coat. ", "Season the steak with salt and pepper. Cut the steak into slices and place on serving plates alongside the salad and a pile of onion rings. Put the sauce into a jug ready to serve at the table."]}, {"isVegetarian": true, "title": "Tabbouleh", "url": "www_bbc_co_uk_food_recipes_tabbouleh_91782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tabbouleh_91782_16x9.jpg", "ingredients": ["25g/1oz bulgur wheat", "2 large, ripe vine tomatoes", "large bunch fresh flatleaf parsley, leaves only, washed, dried, finely chopped ", "small bunch fresh mint leaves, washed, dried, finely chopped", "1 small red onion, peeled, finely chopped", "2-3 tbsp freshly squeezed lemon juice", "2-3 tbsp extra virgin olive oil", "sea salt flakes", "4 ready-made flatbreads, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bulgur wheat into a small bowl and cover with 50ml/2fl oz of boiling water. Stir, then set aside for 20 minutes, or until the bulgur wheat has absorbed all of the water. ", "Cut out the green stalks from the tomatoes and make a small cross at each of the bases. Place the tomatoes into a separate bowl and cover with boiling water. Set aside for 30 seconds, then drain away the water. ", "When the tomatoes are cool enough to handle, peel and discard the skins. Cut the tomatoes into quarters, discard the seeds and dice the flesh. Transfer the diced tomatoes to a serving bowl. ", "Add the parsley, mint and onion to the tomatoes and mix well until combined. ", "When the bulgur wheat has absorbed all of the water, fluff it using a fork until the grains are separated. Add the bulgur wheat to the tomato mixture.", "Drizzle over the lemon juice and olive oil and season, to taste, with salt. Mix well to coat the ingredients in the liquid. ", "To serve, divide the tabbouleh equally among four serving plates. Place one grilled flatbread alongside each."]}, {"isVegetarian": true, "title": "Tagliarini with artichoke and truffles", "url": "www_bbc_co_uk_food_recipes_tagliarini_with_18980", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small globe artichokes", "2 tbsp olive oil", "1 garlic clove, finely sliced ", "1 tbsp chopped parsley", "2 tbsp double cream", "salt and pepper", "250g/9oz fresh tagliarini pasta", "75g/2½oz parmesan (or a similar vegetarian cheese), grated", "50g/1¾oz fresh black truffle"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the outer leaves of the artichokes and cut the top off. Using a sharp knife, trim off any green, tough parts so you are left with the tender leaves and stem. Slice the artichokes in half and cut into fine slices. ", "Heat the olive oil in a frying pan and gently cook the artichoke and garlic for two minutes. Add four tablespoons of water, cover with a lid and cook for four minutes, or until the artichokes are tender. ", "When the artichokes are cooked, add the parsley and cream and season with salt and pepper. ", "In a pan of boiling salted water, cook the tagliarini for about three minutes or until al dente. Using a pair of tongs, transfer the tagliarini to the frying pan containing the artichokes. Add a couple of tablespoons of pasta water and half of the grated parmesan to the frying pan. Toss well and grate a little truffle into the pasta. Check the seasoning and add salt and pepper as required. Toss again so the truffle is absorbed into the sauce. ", "Serve in hot bowls with more truffle slices and the remaining parmesan on top."]}, {"isVegetarian": false, "title": "Tagliarini with red mullet, tomatoes, olives and pangrattato", "url": "www_bbc_co_uk_food_recipes_tagliarini_with_red_87558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower oil, for deep-frying", "100g/3½oz stale bread, roughly chopped into coarse crumbs", "5 tbsp extra virgin olive oil", "1 garlic clove, thinly sliced", "8 taggiasca or small niçoise olives, pitted", "10 datterini tomatoes, cut into quarters", "200g/7oz fresh tagliarini ", "2 red mullet fillets", "1 tsp finely chopped flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sunflower oil in a deep-fat fryer to 160C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the breadcrumbs for 1 minute until golden-brown. Drain on kitchen paper and sprinkle with salt. Set aside.", "Heat 3 tablespoons of the olive oil in a frying pan on a medium heat. Add the garlic, black olives and tomatoes and cook for 3–4 minutes or until the tomatoes break down. ", "Cook the tagliarini in a large pan of salted water according to the packet instructions. ", "Meanwhile, add the red mullet fillets to the tomatoes and continue to cook for 5 minutes. Stir in the parsley and season with salt and pepper. Remove from the heat and set aside. ", "When the pasta is just al dente, remove from the water using tongs and add to the tomatoes.", "Return the pan to a low heat and add a spoonful of the pasta water and the remaining olive oil. Toss the pasta with the other ingredients in the pan, breaking up the fish fillets. ", "Transfer to serving bowls and scatter over the pangrattato. "]}, {"isVegetarian": false, "title": "Tagliarini with prosciutto, peas, spring onions and parmesan", "url": "www_bbc_co_uk_food_recipes_tagliariniwithprosci_86297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Italian '00' flour", "1 free-range egg", "6 free-range egg yolks", "50g/2oz fine semolina flour", "50g/2oz butter", "6 spring onions, sliced thinly", "200g/7oz fresh peas, podded", "splash water", "75g/3oz prosciutto, sliced roughly", "50g/2oz parmesan, grated finely", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pasta, place the flour, egg and egg yolks into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough into a bowl, cover with cling film and place into the fridge to rest for 30 minutes.", "Cut the pasta dough in half and feed one of the pieces through a pasta machine according to the machine instructions, ending on the thinnest setting.", "Add the tagliarini cutter to the pasta machine and pass the pasta through the machine to make thin strips.", "Repeat the process with the remaining dough, then dust the pasta with semolina flour, place onto a plate and refrigerate overnight.", "When you're ready to cook the pasta, bring a large pan of salted water to the boil, add the tagliarini and cook for 2-3 minutes until tender.", "For the sauce, heat the butter in a frying pan, add the spring onions and fry for one minute.", "Add the peas and a splash of water and simmer for one minute, then add the prosciutto and cook for a further minute.", "Drain the pasta and add to the pan with the sauce. Add the parmesan, season, to taste, with salt and freshly ground black pepper and stir. Serve immediately."]}, {"isVegetarian": false, "title": "Tagliatelle with mushrooms and pancetta", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_23536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5g/¼oz dried porcini mushrooms", "2 tbsp olive oil, plus extra for drizzling", "70g/2½oz pancetta lardons", "¼ red chilli, thinly sliced", "1 large garlic clove, thinly sliced", "200g/7oz tagliatelle pasta", "¼ beef tomato, deseeded and finely chopped", "150g/5½oz mixed wild mushrooms", "1 handful flatleaf parsley, roughly chopped", "50g/1¾oz unsalted butter", "50g/1¾oz Parmesan, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cover the porcini mushrooms in cold water and leave to soak for 10 minutes. ", "Heat 2 tablespoons of olive oil in a large sauté pan, add the pancetta and cook for 5–7 minutes, or until crisp. Add the chilli and garlic and cook for a further 2–3 minutes.", "Cook the tagliatelle in a large saucepan of boiling salted water, according to the packet instructions, or until al dente. ", "Meanwhile, drain the porcini mushrooms, reserving the soaking liquor, and add the porcini to the sauté pan. Strain the soaking liquor into the pan and allow to bubble until reduced by half. Add the tomato and wild mushrooms and cook for 2 minutes. Scatter over the parsley. ", "Drain the tagliatelle and add to the sauce. Stir in the butter and cheese until the sauce emulsifies. ", "Divide between four bowls, drizzle with olive oil and serve."]}, {"isVegetarian": false, "title": "Tagliatelle with olives, anchovies and pangrattato", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_olives_33298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz tagliatelle pasta", "2 tbsp olive oil", "2 anchovy fillets", "¼ red chilli, finely chopped", "1 large garlic clove, thinly sliced", "70g/2½oz green or black pitted olives", "¼ beef tomato, deseeded and finely chopped", "50g/1¾oz unsalted butter", "150g/5½oz panko breadcrumbs", "½ lemon, zest only", "handful flatleaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the tagliatelle in a large saucepan of boiling salted water, according to the packet instructions, or until al dente. ", "Meanwhile, to make the pangrattato, melt the butter in a frying pan over a medium heat. Add the breadcrumbs and toast for a few minutes until crunchy and golden. Stir in the lemon zest and parsley.", "Heat the oil in a medium sauté pan. Add the anchovies, chilli and garlic and cook for 1 minute. Stir through the olives and tomatoes. ", "Drain the tagliatelle and add to the sauce. ", "Divide between four bowls, scatter over the pangraatto and serve. "]}]