[{"ingredients": ["150 g / 5½ oz de azúcar en polvo", "3 claras de huevo de gallinas camperas, batidas en un recipiente limpio hasta que se formen picos rígidos cuando se quite el batidor", "½ cucharadita de vinagre de jerez", "2 limones, jugo y ralladura", "3 limas, jugo y ralladura", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas, más 5 yemas de huevo de gallinas camperas", "150g / 5oz de mantequilla, ablandada", "Crema doble de 200g / 7oz, batida hasta que se formen picos suaves cuando se quita la batidora", "12 maracuyá, sólo pulpa, para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja de hornear con papel antigrasa.", "Para el merengue, bata el azúcar, una cucharada a la vez, en las claras de huevo endurecidas, hasta que la mezcla esté suave y brillante.", "Doble suavemente el vinagre de jerez.", "Coloque la mezcla de merengue en la bandeja de horno preparada para formar un círculo de aproximadamente 20 cm de diámetro. Vierta el merengue restante en masa alrededor del borde del merengue, formando remolinos y picos sobre la marcha.", "Transfiera el merengue al horno e inmediatamente reduzca la temperatura a 150C / 300F / Gas 2. Hornee por 45-50 minutos, o hasta que el merengue se haya endurecido por fuera, pero todavía esté suave y duro en el medio.", "Mientras tanto, para el relleno, coloque el jugo de limón y la ralladura, el jugo de limón y la ralladura, el azúcar en polvo, los huevos, las yemas de huevo y 75 g / 2¾ oz de la mantequilla en una sartén de base pesada. Batir a fuego medio hasta que el azúcar se haya disuelto y la mezcla esté suave y espesa para cubrir la parte posterior de una cuchara.", "Agregue la mantequilla restante, revolviendo continuamente. Continúe revolviendo hasta que toda la mantequilla se haya derretido y la mezcla se haya espesado considerablemente.", "Retire la mezcla del fuego y bata un poco, luego déjela a un lado hasta que esté completamente fría.", "Para servir, coloca el merengue en el centro de un plato de servir. Coloque la mezcla de relleno de limón y lima en el centro, luego cubra con la crema batida y la pulpa de maracuyá."], "url": "www_bbc_co_uk_food_recipes_lemonandlimepavlova_91318", "title": "Pavlova de limón y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonandlimepavlova_91318_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "1 diente de ajo, picado", "50g / 1¾oz de queso cheddar, rallado", "2 cucharaditas de hojas frescas de tomillo", "1 limón, jugo y ralladura solamente", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "150 g / 5½ oz de calabaza, pelada y picada en cubos de 1cm / ½ en cubitos", "2 dientes de ajo ahumado, pelados", "200ml / 7fl de leche en oz", "sal y pimienta negra recién molida", "Queso cheddar 85 g / 3 oz, rallado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo asado con limón y ajo, corte dos barras en la pechuga de pollo. Coloque el ajo y el queso en el bolsillo debajo del mini filete, cortándolo para hacerlo más grande si es necesario.", "Coloque las hojas de tomillo, el jugo de limón y la ralladura y el aceite de oliva en un bol, sazone con sal y pimienta negra recién molida y mezcle bien.", "Coloque el pollo en el recipiente y déjelo marinar durante diez minutos.", "Caliente una sartén a la plancha y cocine el pollo por 3-4 minutos en cada lado. Transfiera a una bandeja para hornear y tueste en el horno durante 12-14 minutos, o hasta que esté completamente cocido.", "Mientras tanto, para el puré de mostaza con queso, coloca la calabaza, el ajo y la leche en una sartén grande. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 10-12 minutos, o hasta que la calabaza esté tierna. Mash con un machacador de papas, sazonar bien con sal y pimienta negra recién molida y agregue el queso rallado.", "Para servir, coloque el puré en un plato, cubra con el pollo y vierta sobre los jugos de pollo para cocinar."], "url": "www_bbc_co_uk_food_recipes_lemonandgarlicroaste_85530", "title": "Pollo al limón y al ajo con puré de nogal cursi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "pomo de jengibre fresco, pelado y en rodajas", "Carne de res de 170 g / 6 oz, en rodajas finas", "3 hojas de limón, ralladas (o hojas de lima sustitutas)", "2 cucharaditas de aceite de sésamo", "2 cucharaditas de semillas de sésamo", "2 cucharadas de limón, solo cáscara", "cariño, llovizna"], "method": ["Calienta el aceite en un pequeño wok a fuego alto, hasta que fumes, y agrega el jengibre y la carne. Revuelva freír durante dos minutos, dorar.", "Baje el fuego ligeramente, agregue los ingredientes restantes y saltee durante otros dos minutos antes de transferirlos a un recipiente y servir."], "url": "www_bbc_co_uk_food_recipes_lemonandorangechines_79829", "title": "Carne de res al estilo chino de limón y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 limones, en rodajas finas", "450 g / 1 libra de mantequilla", "450 g / 1lb de azúcar en polvo", "6 huevos de gallinas camperas", "150 g / 5¼ oz de almendras molidas", "500g / 1lb 1½ oz de polenta de cocción rápida", "2 limones, cáscara y jugo solamente", "150 g / 5¼ oz de mascarpone", "200ml / 7¼fl oz de crema doble", "Vodka de limón 45 ml / 1½ fl oz", "30g / 1¼ oz de azúcar glas", "½ limón, solo jugo", "manojo de menta", "limón rallado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Alinee una lata de torta honda de 30 cm / 9 pulgadas con un pergamino para hornear.", "Calentar una sartén hasta que esté caliente y luego agregar el aceite y las rodajas de limón.", "Freír por 1-2 minutos hasta que esté caramelizado.", "Retire y coloque caramelizado hacia abajo en un patrón en el pergamino de la bandeja.", "Coloque la mantequilla y el azúcar en un tazón grande y mezcle hasta que esté suave y esponjoso.", "Agregue los huevos uno a la vez, mezclando bien.", "Doble las almendras molidas, la polenta, el jugo de limón y la ralladura y revuelva para combinar.", "Verter la mezcla sobre las rodajas de limón y extender uniformemente en la lata.", "Coloque en el horno durante 25-30 minutos hasta que esté recién levantado y dorado.", "Deje que se enfríe antes de dar vuelta en un plato, rodajas de limón en la parte superior.", "Para hacer la crema de limón, coloque el mascarpone en un bol y bata para ablandarlo.", "Vierta la crema doble, el vodka de limón, el azúcar glas y el jugo de limón.", "Batir hasta que la mezcla forme picos suaves.", "Sirva un trozo de pastel con una cucharada de crema, una ramita de menta y una pizca de ralladura de limón."], "url": "www_bbc_co_uk_food_recipes_lemonandpolentacakew_83693", "title": "Tarta de limón y polenta con crema de vodka y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 filete de caballa, cortado por la mitad, piel marcada con un cuchillo afilado", "1 ramita de romero fresco, picado", "sal y pimienta negra recién molida", "½ limón, solo jugo", "Aceitunas Kalamata 100 g / 3½ oz, hoyos eliminados", "1 diente de ajo, picado", "2 cucharadas de aceite de oliva", "hojas de albahaca fresca, para adornar"], "method": ["Para la caballa, caliente el aceite de oliva y la mantequilla en una sartén. Agregue la caballa y espolvoree con romero, sal y pimienta negra recién molida. Freír durante dos minutos en cada lado, o hasta que estén bien cocidos. Exprime el jugo de limón y retira del fuego.", "Para el aderezo, coloque las aceitunas, el ajo y el aceite de oliva en una mini licuadora y procese hasta que quede suave.", "Para servir, coloca la caballa en un plato de servir. Verter sobre el aderezo y decorar con hojas de albahaca fresca."], "url": "www_bbc_co_uk_food_recipes_lemonandrosemarymack_88380", "title": "Caballa de limón y romero con aderezo de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de trigo bulgar", "½ cubo de caldo de verduras", "agua hirviendo", "1 limón, ralladura y jugo", "2 cucharadas de romero fresco picado", "2 cucharadas de aceite de oliva", "3 cebollas de primavera, en rodajas", "puñado de hojas de ensalada mixtas, para adornar"], "method": ["Coloque el trigo bulgar en una sartén pequeña y desmenuce el cubo de la acción sobre él.", "Agregue agua hirviendo para alcanzar 1cm / ½ pulgada por encima del trigo y caldo de bulgar. Cubra con una tapa y cocine a fuego lento a fuego medio durante 12-15 minutos, o hasta que el trigo bulgar esté tierno y haya absorbido el agua.", "Pelusa el trigo con un tenedor y agregue los ingredientes restantes, mezcle bien hasta que se combinen.", "Presione la ensalada de trigo bulgar en un recipiente pequeño a prueba de calor para que el trigo se moldea en el recipiente y cubra con un plato.", "Para servir, coloque la ensalada en el plato de servir y decore con las hojas de ensalada mixta."], "url": "www_bbc_co_uk_food_recipes_lemonandrosemarybulg_89458", "title": "Ensalada de limón y romero bulgar wheat", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de vino blanco", "1 limón, solo jugo", "4 pechugas de pollo sin hueso", "harina común, para quitar el polvo", "120ml / 4fl oz de aceite de oliva", "2 cebollas pequeñas, finamente cortadas", "1 limón, cáscara y médula eliminados, finamente rebanados, más algunas rodajas de limón para adornar", "16 ramas de tomillo fresco, más unas ramitas para decorar", "10 hojas frescas de salvia", "sal", "pimienta negra recién molida", "1 diente de ajo", "1 chile rojo, sin semillas y finamente picado", "200g / 7oz de judías verdes", "1 limón, solo jugo"], "method": ["En un tazón pequeño, mezcle el vino y el jugo de limón, luego reserve.", "Sazone las pechugas de pollo con sal y pimienta y frote bien.", "Ligeramente en polvo con un poco de harina, sacudiendo cualquier exceso. Con la palma de tu mano, aplana los pechos ligeramente.", "Caliente el aceite de oliva en una sartén grande. Agregue el pollo y el sello en ambos lados (algunas pechugas de pollo contienen agua y pueden escupir durante la cocción. Para evitar esto, cubra con una tapa).", "Una vez que estén bien sellados y dorados, retire las pechugas de pollo de la sartén y déjelos a un lado.", "Baje el fuego, agregue las cebollas, sazone con sal y pimienta y sude hasta que las cebollas estén suaves.", "Agregue las rodajas de limón, el tomillo y las hojas de salvia y mezcle bien.", "Regrese el pollo a la sartén, cubra y cocine a fuego lento durante tres minutos. Levante el fuego (pero tenga cuidado de no quemar las cebollas y el limón).", "Agregue la mezcla de vino y jugo de limón, cubra y cocine durante 10-15 segundos, hasta que la mezcla burbujee.", "Retire la tapa y cocine a fuego lento hasta que el líquido se haya evaporado ligeramente. Verás el engrosamiento de la salsa.", "Pruebe y ajuste el aderezo si es necesario.", "Coloque las pechugas de pollo en un plato grande o en platos individuales y vierta la salsa.", "Adorne con rodajas de limón y ramitas de tomillo.", "Para preparar los frijoles, cocine hasta que estén tiernos, luego escurra y mezcle el ajo, el jugo de limón y el chile picado."], "url": "www_bbc_co_uk_food_recipes_lemonandthymechicken_70823", "title": "Pollo de limón y tomillo con frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 camote, pelado y cortado en rodajas de 1cm / ½ en gruesas", "3 cucharadas de agua", "ramita de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "½ limón, solo jugo", "cuña de limón, para servir"], "method": ["Caliente el aceite en una sartén pequeña y fríe con cuidado las rodajas de boniato, volteándolas con frecuencia, hasta que estén ligeramente doradas por ambos lados.", "Agregue el agua y las hojas de tomillo y sazone con sal y pimienta negra recién molida. Cubra y cocine a fuego lento durante 6-8 minutos, o hasta que estén tiernos. Exprime el jugo de limón y revuelve.", "Para servir, coloca el fondant de patata dulce en un plato y decora con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_lemonandthymesweetpo_85374", "title": "Fondant de patata dulce de limón y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 galletas digestivas", "75g / 3oz de mantequilla, derretida", "1 cucharada de miel clara", "700 g / 1½ lb de queso mascarpone", "2 limón, jugo y ralladura", "200g / 7oz de azúcar en polvo, más más a gusto", "4 cucharadas de azúcar glas", "menta, decorar", "450 g de frutas de verano congeladas, descongeladas", "azúcar glas, al gusto"], "method": ["Cepille la parte inferior de una lata con forma de resorte de 23 cm / 9 pulg. Con un poco de la mantequilla derretida y coloque una ronda de papel antigrasa en la base.", "Triture los bizcochos y colóquelos en un bol, agregue la mantequilla derretida y la miel y revuelva hasta que estén bien combinados.", "Incline la mezcla en el fondo de la lata de la torta. Usando la parte posterior de una cuchara, empuje suavemente las migajas desde el centro hacia afuera, hasta que estén suaves y niveladas. Esto formará la base de la tarta de queso. Enfríe en la nevera mientras hace el relleno.", "Para el relleno, mezcle el queso mascarpone, el jugo de limón y la ralladura y el azúcar en polvo en un tazón hasta que estén bien combinados. No mezcle demasiado la mezcla ya que esto hará que se separe. Pruebe la mezcla y agregue más azúcar al gusto.", "Coloque la mezcla en la lata encima de la mezcla de galletas heladas y deje enfriar en la nevera durante al menos 2 horas.", "Cuando esté listo para servir, coloque una tela caliente o un soplete alrededor de la lata y retire la tarta de queso.", "Para la salsa, mezcle la mayoría de las frutas con un poco de azúcar glas (al gusto) en un procesador de alimentos hasta que quede suave. Pase la salsa por un colador.", "Coloque la tarta de queso en un plato, decore la parte superior con las ramitas de menta fresca y coloque la salsa en un costado. Decora con las bayas restantes."], "url": "www_bbc_co_uk_food_recipes_lemoncheesecake_65665", "title": "Tarta de queso de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemoncheesecake_65665_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pechugas de pollo de 450 g / 1 lb, sin piel ni hueso - cortado en tiras", "1 clara de huevo", "2 cucharadas de harina de maíz", "buena pizca de sal", "aceite de sésamo", "250ml / 8fl oz de aceite de cacahuete", "3 limones, jugo y ralladura", "85ml / 2fl oz de caldo de pollo", "1 cucharada de azúcar", "1 cucharada de salsa de soja ligera", "splash de jerez seco (opcional)", "1 diente de ajo, aplastado", "1 chile rojo, finamente picado", "1 cucharadita de harina de maíz o arrurruz - mezclado con agua", "cebollas de primavera de racimo pequeño, ralladas", "Condimento"], "method": ["Combine la clara de huevo, la harina de maíz, la sal, un poco de aceite de sésamo y el pollo en un bol, revuelva para asegurarse de que el pollo esté bien cubierto. Deja por unos 20 minutos.", "Calentar un wok hasta que esté muy caliente, agregar un poco de aceite de cacahuate y calentar hasta que esté humeante. Retire del fuego y agregue el pollo - revuelva rápidamente para evitar que se pegue y cocine hasta que el pollo se ponga blanco. Vacíe el pollo sobre un recipiente resistente al calor, coloque el pollo a un lado, deje que el aceite se enfríe y deséchelo.", "Limpie el wok y prepare la salsa. Agregue el caldo, el jugo de limón y la ralladura, el azúcar, la soja y el jerez seco junto con el ajo y el chile. Llevar a ebullición y batir en la mezcla de harina de maíz o arrurruz. Cocine a fuego lento por unos momentos y luego agregue el pollo. Revuelva para asegurarse de que el pollo esté bien cubierto y calentado adecuadamente.", "Agregue un poco de aceite de sésamo como condimento final y sirva espolvoreado con cebolletas."], "url": "www_bbc_co_uk_food_recipes_lemonchicken_11654", "title": "Pollo al limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonchicken_11654_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo, sin piel, cortadas en tiras", "3-4 cucharadas de harina de maíz, sazonada con sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "Cebollitas pequeñas, cortadas en pedazos de 2cm / 1in", "1 diente de ajo, finamente cortado", "25 g / 1 oz de raíz fresca de jengibre, en rodajas finas", "1 limón, jugo y corteza finamente rebanada solamente", "1 cucharada de salsa de soja ligera", "85ml / 3fl oz de caldo de pollo", "dash jerez seco", "pimienta negra recién molida"], "method": ["Enrolle las tiras de pollo en la harina de maíz sazonada y sacuda el exceso.", "Caliente el aceite vegetal en una sartén, agregue el pollo y fría hasta que el pollo comience a dorarse. Agregue las cebollas de primavera, el ajo, el jengibre y la corteza de limón en rodajas.", "Exprime el jugo de medio limón en la sartén. Agregue la salsa de soja y caldo de pollo y una pizca de jerez seco. Revuelva y deje hervir a fuego lento durante 5-6 minutos, o hasta que el pollo esté bien cocido. Sazonar con pimienta recién molida negro. Revuelva bien y sirva."], "url": "www_bbc_co_uk_food_recipes_lemonchicken_89043", "title": "Pollo al limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de miel", "1 limón, ralladura y jugo solamente, más 1 limón, cortado en rodajas finas", "Pollo de corral de 2 kg / 4 lb 4 oz, cortado en 8 piezas", "sal y pimienta negra recién molida", "125g / 5oz de mantequilla", "1 cucharada de aceite de oliva", "4 dientes de ajo, dejados enteros, ligeramente triturados", "500ml / 17fl oz de caldo de pollo caliente", "2 ramitas de tomillo fresco", "250 g / 9 oz de espinaca de hoja de bebé"], "method": ["Precalentar el horno a 200 / 400F / Gas 6.", "Coloque la miel, la ralladura de limón y el jugo de limón en un tazón y bata hasta que estén bien combinados. Agregue los pedazos de pollo y dé vuelta hasta que estén completamente cubiertos en la mezcla. Sazonar bien con sal y pimienta negra recién molida y reservar al menos 10 minutos para marinar.", "Calienta 40 g / 1½ oz de la mantequilla y la mitad del aceite de oliva en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue la mitad de las piezas de pollo marinado y fría por 5-6 minutos, volteándolas de vez en cuando, hasta que estén doradas. Coloque las piezas de pollo a un lado en un plato caliente.", "Repita el proceso con otros 40 g / 1½ oz de mantequilla, el aceite restante y las piezas restantes de pollo. Cuando las piezas de pollo estén doradas, colóquelas a un lado.", "Agregue los dientes de ajo, las rodajas de limón y los jugos de marinado residual a la sartén y revuelva bien, raspando cualquier trozo quemado del fondo de la sartén con una cuchara de madera.", "Vuelva a colocar los trozos de pollo cocidos en la sartén, agregue el caldo de pollo caliente y las ramitas de tomillo y mezcle bien. Llevar la mezcla a ebullición, luego colocar en el horno para cocinar durante 30-35 minutos, o hasta que el pollo esté tierno y cocido. Retire los trozos de pollo de la sartén y déjelos a un lado en un plato caliente.", "Continúe cocinando a fuego lento la salsa de limón a fuego alto durante otros 5-10 minutos, o hasta que el líquido se haya reducido a la consistencia del almíbar fino.", "Cuele la salsa a través de un colador fino, presionando la pulpa de ajo a través del tamiz con el dorso de una cuchara de madera. Sazone el líquido tamizado, al gusto, con sal y pimienta negra recién molida y reserve.", "Caliente la mantequilla restante en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue las espinacas y fría, revuelva regularmente, durante 3-4 minutos, o hasta que se marchite.", "Para servir, coloque una porción de la espinaca marchita en el centro de cada plato. Coloque dos pedazos de pollo encima de cada porción de espinaca. Cuchara sobre la salsa de limón y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lemonchickencasserol_90144", "title": "Cazuela de pollo al limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo cortada en tres pedazos", "5 tomates secados al sol, picados", "75g / 2¾oz Stilton con albaricoques, desmenuzado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 limón, jugo y ralladura solamente", "Hojas de espinaca 100 g / 3½ oz, finamente cortadas", "½ limón, solo jugo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "2 dientes de ajo, finamente picados", "1 pimiento naranja, cortado en tiras", "½ cucharadita de copos de chile", "1 cucharada de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "1 naranja, solo jugo", "1 limón, reducido a la mitad"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo relleno de limón, coloque las tres piezas de pechuga de pollo en una hoja de película adhesiva. Cubra con otra hoja de película adhesiva y aplaste el pollo con un rodillo o mazo de carne.", "Retire la película adhesiva. Coloque los tomates picados y el queso en el centro de cada pieza de pollo. Sazone con sal y pimienta negra recién molida, luego enrolle el pollo alrededor del relleno, asegurando con un palillo de cóctel.", "Calienta el aceite en una sartén a prueba de horno y dore el pollo relleno por todos lados hasta que esté dorado, alrededor de 3-4 minutos. Espolvorea la ralladura de limón y exprime el jugo. Transfiera al horno y tueste por aproximadamente 10-12 minutos, o hasta que esté completamente cocido.", "Para la espinaca de cítricos, coloque la espinaca en un tazón con el jugo de limón, aceite, sal y pimienta negra recién molida y mezcle bien.", "Para la salsa de pimienta, caliente el aceite en una sartén y fríe con cuidado la cebolla, el ajo y la naranja durante 4-5 minutos.", "Agregue las hojuelas de chile, el azúcar, el vinagre de vino blanco y el jugo de naranja y cocine a fuego lento durante 6-7 minutos, o hasta que la salsa se reduzca y se vuelva pegajosa y los pimientos estén suaves.", "Para servir, caliente una sartén hasta que esté caliente y coloque las mitades de limón, con el lado del corte hacia abajo, en la sartén. Deja durante 4-5 minutos, hasta que queden carbonizados.", "Coloque una cama de espinacas cítricas en un plato para servir y cubra con el pollo relleno (retire los palitos de cóctel). Coloque las mitades de limón a la parrilla en un lado y la salsa de pimienta en un tazón pequeño en el otro lado."], "url": "www_bbc_co_uk_food_recipes_lemonchickenstuffedw_88628", "title": "Pollo de limón relleno de tomates secos y queso de albaricoque", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5½fl oz de caldo de pollo", "2 limones, ralladura y jugo", "1 cucharada de jerez seco", "1 diente de ajo, dejado entero", "4 pechugas de pollo de 150 g / 5½ oz, sin piel", "250ml / 9fl oz de caldo de pollo", "4 cucharadas de azúcar en polvo", "4 limones, ralladura y jugo", "1 cucharada de harina de maíz, mezclada en una pasta con un poco de agua", "sal y pimienta negra recién molida", "75g / 2¾oz de mantequilla", "200g / 7oz de arroz frito con huevo listo para usar", "4 cebolletas, cortadas, finamente picadas"], "method": ["Para el pollo, mezcle el caldo de pollo, la ralladura de limón y el jugo, el jerez y el diente de ajo en una cazuela grande. Llevar a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Agregue las pechugas de pollo y cubra la cacerola con una tapa. Cocine por 20-25 minutos, o hasta que esté cocido. Dejar enfriar un poco.", "Para la salsa de limón, hierva el caldo de pollo, el azúcar y la ralladura de limón y el jugo en una sartén, luego continúe cocinando durante 4-5 minutos.", "Agregue la pasta de harina de maíz hasta que la mezcla esté suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Calentar la mantequilla en una sartén a fuego medio. Agregue las pechugas de pollo fritas y fría por 2-3 minutos por cada lado, o hasta que estén doradas por ambos lados.", "Para servir, coloque una pechuga de pollo en cada uno de los cuatro platos. Vierta sobre la salsa de limón. Coloque una porción de arroz frito con huevo al costado. Espolvorea un poco de cebolleta."], "url": "www_bbc_co_uk_food_recipes_lemonchicken_91444", "title": "Pollo al limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo, pelada y aplanada con un mazo de carne", "2 cucharaditas de harina común, condimentada con sal y pimienta negra recién molida", "1 cucharada de mantequilla derretida", "½ limón", "1 cucharada de perejil fresco picado, para servir", "cuñas de limón, para servir", "½ calabaza, pelada y picada", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "1 cucharada de mantequilla", "1 cucharada de aceite de oliva", "3 cebolletas, finamente picadas", "125g / 4½oz de col rizada, picado", "3 cucharadas de vino blanco", "1 cucharadita de hojuelas de chile seco", "sal y pimienta negra recién molida"], "method": ["Para hacer el pollo al limón, enrolle el pollo en la harina sazonada.", "Derrita la mantequilla en una sartén, agregue el pollo enharinado, exprima la mitad del jugo del limón y cocine por 2-3 minutos.", "Dé la vuelta, exprima el resto del limón y cocine por 2-3 minutos o hasta que el pollo esté bien cocido. Sacar de la sartén y mantenga caliente.", "Para hacer puré de calabaza, hervir la calabaza en agua con sal hasta que esté suave.", "Escurrir y mezclar en un procesador de alimentos con crema doble, sal y pimienta negra recién molida.", "Derrita la mantequilla en una sartén, agregue la calabaza mezclada y saltee durante 1-2 minutos.", "Para hacer la col rizada picante, caliente el aceite de oliva en una sartén y agregue las cebolletas.", "Cocine suavemente hasta que se suavice un poco, agregue la col rizada y cocine por otro minuto, revolviendo con frecuencia.", "Agregue el vino blanco, los copos de chile, la sal y la pimienta negra recién molida y deje cocer durante 5 minutos o hasta que todo el líquido haya sido absorbido.", "Para servir, coloque un montón de puré de calabaza en un plato grande, cubra con el pollo con limón y una cuchara con la col rizada picante al costado. Espolvorear con perejil picado y servir con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_lemonchickenwithsqua_82107", "title": "Pollo de limón con puré de calabaza y kale rizado salteado y picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 galletas de jengibre", "100ml / 3½fl oz de champán o vino espumoso", "284ml / 10fl oz de crema doble", "4 cucharadas de azúcar glas", "8 cucharadas de cuajada de limón", "2 cucharadas de almendras en copos, tostadas", "fresas frescas"], "method": ["Desmenuce los bizcochos en el fondo de un plato de vidrio y humedezca con la mitad del champán o el vino espumoso.", "Comience a batir la crema con el azúcar y cuando llegue a los picos suaves, doble el champán restante y revuelva en la cuajada de limón, dejando un veteado de amarillo a través de la crema.", "Vierta la mezcla en el plato de vidrio y espolvoree con las almendras tostadas y las fresas."], "url": "www_bbc_co_uk_food_recipes_lemoncurdandchampagn_81036", "title": "Cuajada de limón y champán syllabub", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de requesón", "4 cucharadas de cuajada de limón", "azúcar en polvo, al polvo", "botón de mantequilla", "4 crepes confeccionados"], "method": ["Precaliente la parrilla a un ajuste medio.", "Coloque 1 cucharada de queso ricotta y 1 cucharada de cuajada de limón en el centro de cada uno de los cuatro crêpes preparados.", "Dobla hacia arriba para hacer que los paquetes triangulares se abran en la parte superior.", "Coloque estos en un plato a prueba de horno y espolvorear con un poco de azúcar en polvo. Salpique con mantequilla y cocine bajo una parrilla mediana, hasta que la mantequilla se derrita y el azúcar se fríe. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_lemoncurdpancakes_67267", "title": "Panqueques de cuajada de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10oz de masa dulce con brisa", "harina común, para quitar el polvo", "4 limones, cáscara y jugo solamente", "4 huevos de gallinas camperas, golpeados", "Azúcar en polvo 350g / 12oz", "110g / 4oz de mantequilla", "2 claras de huevo de gallinas camperas, batidas hasta que se formen picos suaves cuando se quite el batidor", "150 g / 5 oz de azúcar en polvo", "50 ml / 2 fl oz crema de maduro", "75g / 3oz de azúcar en polvo", "250 g / 9 oz zarzamoras", "4 ramitas de menta fresca, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las tartas de cuajada de limón, en una superficie de trabajo ligeramente enharinada, extienda la masa a un grosor de 0.5cm / ¼ pulgada. Recorta cuatro discos de 12cm / 5in de la masa y alinea cada uno de los cuatro pasteles de tartaletas de 10cm / 4in con uno de los discos de hojaldre. Enfriar en la nevera durante 30 minutos.", "Mientras tanto, en un tazón, bata la ralladura de limón y el jugo, los huevos y el azúcar impalpable hasta que estén bien combinados.", "Transfiera la mezcla a una cacerola y cocine a fuego lento a fuego medio, luego agregue la mantequilla y bata hasta que estén bien combinados.", "Continúe cocinando a fuego lento durante 4-5 minutos, revolviendo constantemente, hasta que la mezcla se espese, luego pase la mezcla a través de un colador fino en un recipiente limpio. Coloque la mezcla de cuajada de limón tamizada a un lado para enfriar.", "Cuando las cajas de tartas se hayan enfriado, forre cada una con un disco de papel resistente a la grasa o papel de aluminio y rellene con arroz o frijoles para hornear. Coloque las cuatro cajas agrias en una bandeja para hornear y hornee en el horno durante 12-15 minutos.", "Retire el papel a prueba de grasa y los frijoles para hornear y devuelva las cajas de tarta al horno por otros 4 a 5 minutos. Retire del horno y deje a un lado para que se enfríe un poco.", "Cuando las cajas de tartas se hayan enfriado, divida la mezcla de cuajada de limón por igual entre las cajas de repostería.", "Para el relleno de merengue, espolvoree el azúcar impalpable en una bandeja para hornear y hornéelo en el horno durante 4-5 minutos, o hasta que el azúcar esté caliente pero no se haya derretido.", "En un tazón grande, agregue gradualmente el azúcar caliente, un tercio a la vez, a las claras de huevo batidas, batiendo constantemente, hasta que se formen picos rígidos cuando se quite el batidor y la mezcla esté brillante.", "Coloque la mezcla de huevo batido en una manga pastelera.", "Comenzando por el medio y trabajando hacia afuera, coloque espirales de la mezcla de merengue en las cuatro tartas hasta que cubra la cuajada de limón.", "Usando una mini soplete, caliente el merengue hasta que se dore. (Alternativamente, precaliente la parrilla a su configuración más alta y caliente el merengue durante 2-3 minutos, o hasta que esté pálido dorado).", "Para la compota de mora, en una sartén, hierva a fuego lento el azúcar impalpable y la crema de leche.", "Continúe cocinando a fuego lento durante 1-2 minutos, luego agregue las moras y hierva a fuego lento por otros 2-3 minutos, o hasta que las moras estén tiernas y la mezcla se haya espesado.", "Para servir, coloque una tarta en cada uno de los cuatro platos de servir. Ponga una pequeña compota de zarzamora junto a cada tarta. Adorne cada uno con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_lemoncurdmeringuetar_90798", "title": "Tarta de merengue de cuajada de limón con compota de mora", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 paquete de hojaldre listo para enrollar", "lavado de huevos", "cuajada de limón"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tome un paquete de hojaldre listo para untar y corte por la mitad (reserve la otra mitad para otra receta). Con una media puntuación, una línea de aproximadamente 2,5 cm dentro del borde alrededor de la masa.", "Usando un tenedor pinchar la masa dentro de la línea.", "Cepille la masa fuera de la línea con un lavado de huevo y luego hornee la caja de tarta en el horno caliente durante 15-20 minutos hasta que esté bien coloreada.", "Dejar enfriar, luego extender sobre la cuajada de limón."], "url": "www_bbc_co_uk_food_recipes_lemoncurdtart_67268", "title": "Tarta de cuajada de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 limones, solo jugo", "75g / 2¾oz de azúcar en polvo", "200 g / 7 oz de azúcar en polvo", "200 g / 7 oz de mantequilla sin sal, más extra para engrasar", "2 limones, solo cáscara", "3 huevos de gallinas camperas, golpeados", "Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "2 yemas de huevo de gallinas camperas", "75g / 2¾oz de azúcar en polvo", "50 g / 1¾oz de mantequilla sin sal", "2 limones, jugo y ralladura", "100g / 3½ oz de mascarpone"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Engrasa una lata de molde con forma de resorte de 20 cm / 8 pulg con mantequilla, luego agrega una pequeña cantidad de harina, gira la lata de la torta para cubrir los lados y el fondo y sacude el exceso.", "Para la llovizna de limón, en un tazón, mezcle el jugo de limón y el azúcar hasta que la mezcla esté bien combinada y el azúcar se haya derretido. Dejar de lado.", "Para la esponja, bata el azúcar, la mantequilla y la ralladura de limón en un tazón para mezclar hasta que esté pálido y esponjoso, con un batidor eléctrico.", "Poco a poco agregue los huevos, batiendo después de cada adición hasta que el huevo esté completamente incorporado en la mezcla antes de agregar el siguiente. Con cuidado dobla la harina con una cuchara de metal.", "Vierta la masa de la torta en la lata de torta preparada y hornéela en el horno durante 30-40 minutos, o hasta que la esponja se haya levantado y esté bien cocida. (La esponja se cuece cuando una brocheta insertada en el centro del pastel sale limpia).", "Tan pronto como la torta esté cocida, retírela del molde de la torta Springform y pinche la parte superior con una barra de cóctel. Vierta sobre la mezcla de llovizna de limón para remojar la esponja, luego reserve para enfriar sobre una rejilla de alambre.", "Para el relleno, mezcle las yemas de huevo y el azúcar en una sartén a fuego medio o bajo hasta que el azúcar se haya derretido.", "Agregue la mantequilla, el jugo de limón y la ralladura, y continúe cocinando, batiendo continuamente, durante 4-5 minutos, o hasta que la mezcla se haya espesado y esté suave y bien combinada. Dejar de lado para enfriar por completo.", "Con una cuchara de metal, dobla cuidadosamente el mascarpone en la mezcla enfriada de cuajada de limón para crear un efecto marmoleado.", "Cuando la esponja se haya enfriado, corte el pastel por la mitad horizontalmente para crear dos tortas más finas. Extiende el relleno de limón por toda la mitad inferior de la torta, luego coloca la mitad superior (la mitad que se pinchó y remojó en la llovizna de limón) en la parte superior."], "url": "www_bbc_co_uk_food_recipes_lemondrizzlecake_91004", "title": "Pastel de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlecake_91004_16x9.jpg", "isVegetarian": true, "recommendations": 0}]