[{"isVegetarian": false, "title": "John Dory alla carlina", "url": "www_bbc_co_uk_food_recipes_john_dory_alla_carlina_43959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, chopped", "1 bulb fennel, sliced", "100g/3½oz celery, sliced", "100g/3½oz carrots, sliced", "25g/1oz button mushrooms, washed and sliced", "1 sprig thyme", "2¼ litres/4 pints water", "1kg/2lb 4oz flatfish bones (such as brill, sole, plaice) or fillet (ask your fishmonger for bones)", "6 tbsp olive oil", "4 garlic cloves, finely chopped", "1kg/2lb 4oz well-flavoured tomatoes, peeled or 2 x 400g tins chopped tomatoes", "salt and freshly ground black pepper", "4 John Dory fillets ", "50g/1¾oz plain flour", "2 tbsp olive oil, plus extra to serve", "1 lemon, halved", "1 tsp Worcestershire sauce", "2 small gherkins, finely chopped", "2 tbsp capers, 1 tbsp finely chopped and 1 tbsp whole", "2 tomatoes, peeled, de-seeded and finely chopped", "3 tbsp tomato sauce (see above)", "250ml/9fl oz fish stock (see above)", "small handful flatleaf parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish stock, put all the ingredients except the fish bones into a large pan, bring to the boil, then turn down the heat and simmer gently for 20 minutes. ", "Add the fish bones (or fish fillet) and bring back up to a simmer, skimming off any scum as it rises to the surface. Simmer for a further 20 minutes. Strain through a sieve into a clean pan and simmer a little longer, if necessary, until reduced to about 1.2 litres/2 pints. If not using immediately, cool and refrigerate or freeze for later use.", "For the tomato sauce, heat the olive oil and garlic in a saucepan. As soon as the garlic starts to sizzle, add the tomatoes and simmer for 15-20 minutes, breaking them up as they cook. Cook until the sauce has reduced and thickened, then season with salt and pepper. The sauce is ready to use. If not using immediately, leave to cool, then refrigerate for up to a week or freeze for later use.", "Season the John Dory fillets with some salt and pepper and lightly dust with flour. Heat the olive oil in a frying pan, add the fillets skin-side down and fry for 2-3 minutes until lightly browned. Season with a squeeze of lemon juice, turn the fish over and cook for a further minute. Remove from the pan and keep warm.", "Add the Worcestershire sauce, gherkins, whole and chopped capers, tomatoes, tomato sauce and fish stock to the pan, bring to the boil then reduce a little to create the sauce. Add the fish carefully back to the pan for a minute to warm through in the sauce.", "Serve immediately, drizzled with a little more olive oil and sprinkled with fresh parsley."]}, {"isVegetarian": true, "title": "Jerusalem artichoke soup with crisp leeks and rocket pesto", "url": "www_bbc_co_uk_food_recipes_jerusalemartichokeso_88168", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ onion, finely chopped", "1 garlic clove, finely chopped", "200g/7oz Jerusalem artichokes, peeled and chopped", "1 sprig fresh thyme, chopped", "75ml/2½fl oz white wine", "300ml/½ pint vegetable stock", "salt and freshly ground black pepper ", "2 tbsp Greek yoghurt", "150ml/5½fl oz vegetable oil, for shallow frying", "¼ leek, finely sliced into matchsticks", "salt ", "4 tbsp olive oil", "½ lemon, juice only", "small handful fresh rocket leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the oil and butter in a saucepan and gently soften the onion and garlic for 4-5 minutes. Add the artichokes and thyme and continue to cook for 3-4 minutes. Add the white wine and reduce for 2-3 minutes. Then add the stock and bring up to the boil. Reduce the heat and simmer until the artichoke is tender, about five minutes. Season with salt and freshly ground black pepper, and finally stir in the yoghurt.", "For the crisp leeks, heat the oil in a pan until a small cube of bread turns golden-brown in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) When the oil is hot, carefully lower the leek into the hot oil, using a slotted spoon, and fry for about 30 seconds or until starting to turn golden-brown. Remove with the slotted spoon and drain on kitchen paper. Sprinkle with salt to taste.", "For the rocket pesto, place the olive oil, lemon juice and rocket into a bowl. Using a hand-held blender, blend until smooth. Season with salt and freshly ground black pepper.", "To serve, pour the soup into a serving bowl, arrange the leeks on top and drizzle the pesto on top in a circle."]}, {"isVegetarian": false, "title": "John Dory, mousseron mushrooms, broad beans and wild strawberries", "url": "www_bbc_co_uk_food_recipes_john_dory_mousseron_78446", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 punnets wild strawberries ", "1-2 tbsp olive oil ", "1 puntarella (Italian chicory), finely chopped ", "salt and pepper ", "1.5kg/3lb 5oz small broad beans, podded ", "knob of butter, for frying", "drizzle olive oil, for frying ", "1 shallot, finely chopped ", "300g/10½oz mousseron mushrooms, cleaned ", "salt and pepper ", "4 John Dory fillets (about 200g/7oz each) ", "1 egg yolk, beaten ", "200g/7oz dried white breadcrumbs", "knob of butter, for frying", "drizzle olive oil, for frying", "1 sprig thyme ", "1 garlic clove, squashed and left whole", "salt and pepper ", "Lemon balm cress, lambs lettuce cress, bergamot cress, apple blossom cress, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, reserve around 12 of the most beautiful strawberries and mash the others with a little olive oil. Add the chopped puntarella and mix.", "For the vegetables, blanch the beans in a small saucepan of boiling water for 2 minutes and then drain. When cool enough to handle, pop the beans out of their leathery skins by squeezing gently. Discard the skins.", "For the fish, brush the skinless side of each fillet with beaten egg. Cover the same side with breadcrumbs. ", "Heat some oil and butter in a large frying pan with the garlic and thyme (you may need to use two pans). Fry the fish with the breaded side down. Cook for 6 minutes over a low heat. Season the fish with salt and pepper. ", "Meanwhile, heat some butter and oil in a large saucepan. Gently fry the shallots for 2 minutes then add the mousseron mushrooms and broad beans. Cook for 4 minutes over a medium heat. Season with salt and pepper. ", "To serve, divide the vegetables between serving plates, gently lay the fish on top, and add the dressing to the side. Garnish with the reserved strawberries and the cresses."]}, {"isVegetarian": false, "title": "John Dory with asaparagus, chilli and orange salad", "url": "www_bbc_co_uk_food_recipes_john_dory_with_52995", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 red onions, thinly sliced using a mandoline", "16 asparagus spears, woody parts removed, thinly sliced using a mandoline", "4 red chillies, halved, seeds removed, thinly sliced ", "1 orange", "4 x John Dory, about 500g/1lb 2oz each, gutted, filleted and skinned", "sea salt and freshly ground black pepper", "4 tbsp verjuice (available online)", "4 tbsp olive oil ", "1 tbsp Dijon mustard ", "1 tbsp honey ", "2 tbsp chopped coriander leaves", "2 tbsp chopped mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Put the red onion, asparagus and chillies in a large bowl. Finely grate the zest of the orange and add to the salad. Cut away the peel and pith (white part) from the orange and cut out the segments from between the membranes; add to the salad and toss to combine. ", "Season the fish all over with salt and pepper, then lay on the grill tray. Place under the grill for 3 minutes, then turn the fillets over and cook the other side for 3 minutes. ", "Meanwhile, for the dressing, whisk the ingredients together in a bowl and season with salt and pepper. Just before serving add half of the dressing to the asparagus salad and toss lightly. Taste and add more seasoning if required. ", "To serve, divide most of the salad between warmed plates. Place a grilled fish fillet on top, arrange the remaining salad on the fish and drizzle over the reserved dressing. Serve immediately. "]}, {"isVegetarian": false, "title": "John Dory with courgette shoestring fries", "url": "www_bbc_co_uk_food_recipes_john_dory_with_courgette_44843", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint vegetable oil, for deep-frying", "6 large courgettes", "500ml/18fl oz cold milk", "500g/1lb 2oz plain flour, seasoned with salt and pepper", "large pinch of fine salt", "extra virgin olive oil, for frying", "4 x John Dory fillets", "1 garlic clove, thinly sliced", "1 large handful of mixed herbs (mint, dill, basil and sage), finely chopped", "50ml/2fl oz fish stock", "70ml/2½fl oz lemon juice", "70ml/2½fl oz orange juice", "1 small handful of pink and green peppercorns", "1 small orange, cut into slices (optional)", "flaky sea salt and ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the zucchini shoestring fries, add the oil to a deep-fat fryer and heat to 190C (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Meanwhile, slice the courgettes lengthways using a mandoline to create 4mm thick strips.", "Carefully dredge the courgette strings in the milk and shake around in the seasoned flour to lightly coat. ", "Lower the cougette fries into the deep-fat fryer and cook for 3 minutes or until light golden-brown. Remove using a slotted spoon and leave to drain on kitchen paper. Sprinkle with fine salt and keep warm until ready to serve.", "Meanwhile for the John Dory, drizzle a generous glug of olive oil into a large shallow pan with a lid. Carefully add the John Dory fillets skin-side down with the garlic and a pinch of salt and pepper. Scatter the chopped herbs over the fish and place the pan over a medium heat. When the pan starts to sizzle, add the stock, lemon juice and orange juice and cover with a lid. After no more than 4 minutes, remove the fillets and place on warm plates.", "Turn the heat up to high, add the peppercorns and boil the juices until the volume of liquid starts to reduce (about 2 minutes). Take off the heat and pour the reduced juices onto the John Dory fillets. Garnish each fillet with a slice of orange, if using, and serve with the courgette fries alongside.", "To serve, put the John Dory onto a serving plate and the fries on the side."]}, {"isVegetarian": false, "title": "John Dory with orange, fennel and caper salad", "url": "www_bbc_co_uk_food_recipes_johndorywithorangefe_92735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz new potatoes, cut into 2.5cm/1in slices, parboiled", "2 tbsp olive oil", "200g/7oz flour", "salt and freshly ground black pepper", "4 fillets John Dory", "50g/1¾oz butter", "½ lemon, juice only", "2 fennel bulbs, thinly sliced, (set aside in a bowl of ice cold water)", "2 oranges, peeled, segmented, juice reserved", "2 tsp baby capers, drained", "1 bunch chopped fresh dill", "3 tbsp olive oil", "1 tbsp white wine vinegar", "8 salted anchovies, cut in half lengthways", "4 tsp caper berries"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the parboiled potatoes into a bowl with the olive oil and season, to taste, with salt and freshly ground black pepper. Stir until well combined.", "Heat a griddle pan over a medium heat until hot. Add the potatoes in batches and cook for four minutes on each side or until tender and golden-brown on both sides. Remove from the pan and keep warm. Repeat the process with the remaining batches of potatoes.", "Sprinkle the flour onto a plate. Season with salt and freshly ground black pepper. Dust the John Dory in the seasoned flour.", "Heat half the butter in a frying pan over a medium heat until foaming and fry the John Dory for three minutes on each side or until the fish is just cooked through (do this in batches if necessary). Add the remaining butter and the lemon juice to the pan and cook for another minute, basting the fish with the lemon and butter mixture.", "For the fennel and caper salad, drain the fennel thoroughly and place into a large bowl with the orange segments. Add the capers and one-third of the dill. Stir until well combined.", "To make the dressing, place the reserved juice from the oranges into a small bowl and add the oil, white wine vinegar and the remaining dill. Whisk until well combined. Drizzle the dressing over the fennel and orange salad and mix well.", "To serve, place one John Dory fillet onto each of four serving plates. Spoon the potatoes and orange and fennel salad alongside and garnish with the anchovy fillets and caper berries."]}, {"isVegetarian": true, "title": "Jollof rice with fried plantains", "url": "www_bbc_co_uk_food_recipes_jollof_rice_with_fried_79619", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jollof_rice_with_fried_79619_16x9.jpg", "ingredients": ["1 tbsp olive or vegetable oil", "2 large onions, sliced", "2 x 400g/14oz cans plum tomatoes", "1 red pepper, diced", "4 tbsp tomato purée", "¼ tsp cayenne pepper or chilli powder", "1 tsp curry powder", "1 bay leaf", "sprig fresh thyme", "1 stock cube", "225g/8oz long-grain or basmati rice", "salt and freshly ground black pepper", "2 plantains, cut into slices and deep fried", "green leaf salad"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the rice, heat the oil in a large pan and cook the onions over a gentle heat until translucent. ", "Stir in the canned tomatoes, red pepper and tomato purée, then season with salt, freshly ground black pepper and the cayenne or chilli. Add the curry powder, bay leaf and thyme, then pour in 550ml/19fl oz of water and crumble in the stock cube.", "Cover and bring to the boil, then reduce the heat and simmer for 20–30 minutes.", "Rinse the rice well to remove excess starch, then add it to the tomato mixture. ", "Bring to the boil, then reduce the heat to low. Cover and simmer for 25–30 minutes, or until the rice is cooked.", "Season to taste with salt and freshly ground black pepper and serve the joffol with fried plantains and a crisp green salad."]}, {"isVegetarian": false, "title": "Chicken fricassée", "url": "www_bbc_co_uk_food_recipes_julies_cchicken_fricase_68855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4 oz butter", "10 onions, chopped", "2.25kg/5lb closed cup mushrooms, sliced", "200g/7oz flour ", "2.8 litres/5 pints milk ", "2.8 litres/5 pints chicken stock ", "sea salt and freshly ground black pepper", "2.7kg/6lb chicken  - cut into 2.5cm/1in cubes", "10 tbsp chopped fresh parsley, plus extra to garnish"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt 100g/4oz of the butter in a very large frying pan and fry the pieces of chicken until golden-brown. Remove the chicken with a slotted spoon and transfer to a large plate. You will need to do this in batches. ", "In the same pan, melt 200g/8oz of butter and fry the onion gently until soft but not browned. Add half the mushrooms to the pan, fry for 2-3 minutes until just cooked, and then drain off the excess fat and set aside. Repeat with another 200g/8oz of butter and the remaining mushrooms.", "Melt the remaining butter in a large saucepan. Stir in the flour and cook for one minute, stirring constantly. Remove from the heat and gradually stir in the milk and the stock. Return to the heat and bring to the boil, stirring continuously.", "Season the sauce with salt and pepper and stir in the chicken pieces, parsley, mushrooms and onions. Cook for 3-4 minutes then remove from the heat. ", "Sprinkle with a little fresh parsley and serve with new potatoes and vegetables of your choice "]}, {"isVegetarian": true, "title": "Jumble biscuits", "url": "www_bbc_co_uk_food_recipes_jumble_biscuits_20028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumble_biscuits_20028_16x9.jpg", "ingredients": ["1 tsp caraway seeds ", "375g/13oz plain flour, plus extra for dusting ", "½ tsp ground aniseed ", "½ tsp ground mace ", "60g/2¼oz unsalted butter, cubed ", "150g/5½oz caster sugar ", "1 large or 2 small unwaxed lemons, finely grated zest only ", "3 free-range eggs, lightly beaten ", "1 free-range egg, lightly beaten ", "caster sugar, for sprinkling "], "serves": "Makes 8 large biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Line two large baking trays with baking parchment. ", "Place the caraway seeds in a spice grinder or a pestle and mortar and grind to a powder. Sieve the caraway, flour, aniseed and mace together into a bowl. ", "Rub the butter into the flour until it resembles fine breadcrumbs, then stir in the sugar and lemon zest. Add the eggs and bring the mixture together to form a soft dough. ", "Divide the dough into four balls weighing 65g/2½ and four balls weighing 85g/3oz (you might have a little leftover). Place the dough balls on one of the prepared trays, cover with cling film and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Knead the four smaller pieces of dough on a lightly floured surface and roll using your fingertips into a 30cm/12in rope. Knot into double knots and place on one of the lined trays. ", "Shape the remaining four larger pieces of dough into long ropes and cut away a quarter of each rope. Lay out (as pictured) into Celtic knots, using the reserved dough to make the rings that sit on top. Place them directly onto the other lined tray. (The double knots will take an extra 5–10 minutes longer to bake, so don’t mix shapes on the baking trays.) ", "Brush with beaten egg and sprinkle with caster sugar. Bake the Celtic knots for 15–20 minutes, until golden-brown and the double knots for 20–25 minutes. Remove from the oven and leave to cool on a wire rack."]}, {"isVegetarian": true, "title": "Jumbo couscous salad", "url": "www_bbc_co_uk_food_recipes_jumbo_couscous_salad_23940", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbo_couscous_salad_23940_16x9.jpg", "ingredients": ["300ml/10fl oz vegetable stock", "2 tsp olive oil", "100g/3½oz giant couscous", "200g/7oz broccoli", "100g/3½oz peas", "100g/3½oz broad beans, podded", "100g/3½oz salad leaves", "4 spring onions, halved length ways", "2–4 tbsp mint (or any soft herbs, such as tarragon)", "100ml/3½fl oz plain yoghurt", "pinch saffron", "½ tsp runny honey", "pinch caster sugar", "1 tbsp mint (or any soft herbs, such as tarragon)", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a barbecue or grill to it's highest setting.", "Pour the vegetable stock into a saucepan and bring to the boil.", "Heat 1 teaspoon oil in a frying pan over a medium heat and toast the couscous for a couple of minutes. Tip into a large bowl and add the hot vegetable stock. Cover with cling film and allow to stand for 5–10 minutes.", "Bring a large saucepan of salted water to the boil and blanch the broccoli, peas and broad beans for a couple of minutes and refresh in ice-cold water. ", "Remove the broccoli from the water, drain and toss in a bowl with the spring onions and 1 teaspoon oil. Place onto the barbeque or under the grill and char on all sides. Remove from the grill and set aside until ready to serve.", "To make the dressing, place all the ingredients in a medium glass bowl and mix well. ", "Scatter the leaves onto a serving platter and dress with the couscous, broccoli, peas, broad beans, spring onions and herbs. Top with the dressing and serve."]}, {"isVegetarian": false, "title": "Jumbo prawns with tomatoes and garlic", "url": "www_bbc_co_uk_food_recipes_jumbo_prawns_with_15297", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbo_prawns_with_15297_16x9.jpg", "ingredients": ["1 tbsp mild olive oil", "2 garlic cloves, very thinly sliced", "1 long red chilli, deseeded and finely chopped (or use ½ tsp dried chilli flakes)", "150g/5½oz cherry tomatoes, halved", "½ lemon, juice only", "250g/9oz jumbo king prawns, cooked, peeled and deveined", "3 heaped tbsp roughly chopped flat leaf parsley", "ground black pepper", "160g/6oz green beans, steamed, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan over a low heat. Add the garlic and chilli and cook very gently for five minutes or until the garlic is very soft but not coloured, stirring occasionally.", "Add the tomatoes and lemon juice and cook for two minutes or until beginning to soften. Stir in the prawns and cook for 2-3 minutes, stirring, until the tomatoes are well softened and the prawns are hot through.", "Remove the pan from the heat, stir in the parsley, season with lots of pepper and serve with the beans."]}, {"isVegetarian": false, "title": "Jumbo cheese and ham straws", "url": "www_bbc_co_uk_food_recipes_jumbocheesestraws_90633", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jumbocheesestraws_90633_16x9.jpg", "ingredients": ["375g/13oz ready-rolled puff pastry", "3 slices Parma ham, cut into strips", "100g/3½oz gorgonzola, crumbled", "1 tbsp celery seeds", "1 free-range egg, beaten"], "serves": "18", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "On a lightly floured work surface, roll out the puff pastry to a thin sheet. ", "Lay the strips of Parma ham onto one half of the pastry, then sprinkle over the gorgonzola. ", "Fold the pastry over the ham and gorgonzola, then roll out again to a thin sheet.", "Trim the edges of the filled pastry, brush all over with the beaten egg and sprinkle over the celery seeds. ", "Cut the filled pastry into 1cm/½in strips. ", "Twist the strips and transfer each to a baking tray. Press the ends of the pastry twists down to secure them to the tray and prevent them from unravelling. ", "Bake in the oven for 20-25 minutes, or until golden-brown. Set aside to cool slightly, then serve."]}, {"isVegetarian": false, "title": "Jump in the pan chicken", "url": "www_bbc_co_uk_food_recipes_jumpinthepanchicken_66045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3x140g/5oz chicken breasts, skinless", "2 tbsp plain flour", "sea salt and freshly ground black pepper", "2 tbsp olive oil", "1 tbsp butter", "1 garlic clove, crushed", "4 bay leaves", "125ml/4fl oz dry white wine", "2 tbsp capers, well-rinsed", "1 tbsp lemon juice", "2 tbsp flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a frying pan on the heat and add the oil and butter.", "Place the chicken breasts between two sheets of cling film and bash flat.", "Season the flour with the sea salt and black pepper.", "Tear the chicken into pieces, then toss in the seasoned flour. Fry the chicken until cooked through. Remove from the heat.", "Add the garlic, bay leaves, capers and seasoning to the frying pan. Add the wine and return to the heat.", "Add the lemon juice and parsley leaves.", "Plate up the chicken, drizzle over the sauce and serve with rocket leaves and bread."]}, {"isVegetarian": false, "title": "Jungle chicken curry with rice", "url": "www_bbc_co_uk_food_recipes_jungle_chicken_curry_49545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jungle_chicken_curry_49545_16x9.jpg", "ingredients": ["5 kaffir lime leaves (frozen, fresh or dried)", "½ chicken stock cube, dissolved in 300ml/10½fl oz just-boiled water ", "275g/9¾oz long-grain or basmati rice", "2 tbsp sunflower oil", "2 chicken breasts, boned, skinned, cut into small pieces", "1 large red pepper, cored, deseeded and cut into 2cm/¾in chunks", "200g/7oz fine green beans, trimmed, halved lengthways", "200g/7oz baby sweetcorn, trimmed, halved diagonally", "2 tbsp Thai red curry paste", "1 tbsp Thai fish sauce (nam pla)", "2 tsp cornflour", "50g/1¾oz fresh spinach leaves", "large handful fresh basil leaves (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Stir the lime leaves in to the stock and set aside to infuse. ", "Meanwhile, half-fill a large saucepan with water and bring to the boil. Add the rice, stir well and return to the boil, then cook according to the packet instructions. ", "Heat the oil in a large non-stick frying pan or wok over a high heat. Add the chicken, red pepper, green beans and baby sweetcorn and stir-fry for 2-3 minutes. ", "Add the curry paste and cook for a further 1-2 minutes. ", "Add the stock, lime leaves and fish sauce, bring the mixture to the boil. Reduce the heat and simmer for 2-3 minutes, or until the vegetables are just tender. ", "In a small bowl, whisk the cornflour with 1 tbsp cold water to form a smooth paste. Whisk into the curry and continue to simmer for 4-5 minutes, or until the curry sauce has thickened slightly. ", "Stir in the spinach and continue to simmer until just wilted. Stir in the basil leaves just before serving. Discard the lime leaves.", "To serve, drain the rice and spoon it onto serving plates. Top each portion with a ladleful of the curry."]}, {"isVegetarian": false, "title": "Jungle curry of guinea fowl with coconut and lime rice", "url": "www_bbc_co_uk_food_recipes_jungle_curry_of_guinea_73580", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz shrimp paste", "6 Thai shallots", "3 garlic cloves", "4 small yellow or green chillies, cut in half, seeds removed", "6 long red chillies, seeds removed", "50g/1¾oz galangal, peeled", "40g/1½oz palm sugar", "20g/¾oz fresh turmeric", "2 tsp fine salt", "30g/1oz dried shrimps, soaked for 30 minutes then drained", "2 tbsp vegetable oil", "12 green cardamom pods", "1 guinea fowl, divided into eight joints, skin slashed with a knife", "5 stems of krachai, shredded (a milder version of galangal and ginger, from the same family)", "3 lime leaves, spines removed, shredded", "50ml/2fl oz fish sauce", "100ml/3½fl oz Shaoxing rice wine", "500ml/18fl oz chicken stock", "caster sugar, to taste", "200g/7oz long grain rice", "50g/1¾oz thick coconut milk (chill the can of coconut milk in the refrigerator for 30 minutes, spoon the thick coconut milk from the top of the can)", "1 tsp salt", "pinch caster sugar", "6 lime leaves, torn", "4 snake beans, cut into 1cm/½in  pieces", "1 bamboo shoot, shredded", "2 lime leaves, shredded", "1 red chilli, sliced and seeds removed"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the curry paste, wrap the shrimp paste in a foil parcel and toast in a dry hot frying pan or directly on a gas burner until fragrant.", "In a large pestle and mortar, crush together the Thai shallots, garlic cloves, yellow or green chillies, red chillies, galangal, palm sugar, turmeric, salt and rehydrated dried shrimps.", "For the curry, in a large wok, heat the vegetable oil until hot. Add the curry paste and green cardamons and cook to a dry paste. Add the guinea fowl joints and fry for a few minutes. Add the krachai, the lime leaves, fish sauce, Shaoxing wine and chicken stock. Cook until the guinea fowl is cooked through. This will take around 30 minutes.  Taste and add caster sugar to taste.", "Meanwhile, cook the rice. Wash the rice three times and leave to sit for 10 minutes. Place all the ingredients for the rice into a pot and cover with water. Place a lid on, bring to the boil and cook for four minutes and turn off and allow to stand covered for 12 minutes, or until cooked to your liking.", "Garnish the finished dish with snake beans, bamboo shoots, lime leaves and sliced red chilli."]}, {"isVegetarian": false, "title": "Kadaifi-wrapped king prawns with pine nut tarator", "url": "www_bbc_co_uk_food_recipes_kadaifiwrappedkingpr_90790", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread, crusts removed", "200g/7oz pine nuts", "2 small garlic cloves, finely chopped", "½ small bunch parsley, finely chopped ", "1 lemon, juice only", "5 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "12 king prawns, shells and heads removed, de-veined", "2 tbsp lemon juice", "1 garlic clove, finely chopped", "½ tsp ground coriander", "½ tbsp Tabasco", "200g/7oz ready-made kadaifi pastry (also spelled 'kataifi'; available at some continental delicatessens and online specialists)", "24 fresh basil leaves", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the tarator, place the bread into a bowl, add enough cold water to cover the bread, then squeeze out the excess water. ", "Blend the soaked bread, pine nuts, garlic, parsley and lemon juice in a food processor until smooth and well combined. ", "Gradually add the olive oil and blend to a purée. Season, to taste, with salt and freshly ground black pepper and chill in the fridge until needed.", "For the prawns, in a bowl, mix together the prawns, lemon juice, chopped garlic, coriander and Tabasco until well combined. Chill in the fridge for two hours to marinate.", "Heat a deep fat fryer to 170C/325F/Gas 3, or until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Cut the kadaifi pastry into 12 equal pieces about 10cm/4in. Place a piece of kadaifi pastry onto a clean work surface. (Keep the remaining pastry pieces covered to prevent them drying out.) Place two basil leaves on top of the pastry. ", "Place a king prawn at one end of the pastry, then roll the pastry around the prawn until the prawn is covered in pastry. ", "Repeat the process with the remaining prawns.", "Carefully lower the wrapped prawns into the hot oil in batches. Fry for 3-4 minutes, or until the pastry is crisp and golden-brown. Remove the wrapped prawns from the oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm. ", "To serve, divide the tarator among four serving plates and arrange three prawns on top of each serving."]}, {"isVegetarian": true, "title": "Kaiserschmarrn with strawberry sauce", "url": "www_bbc_co_uk_food_recipes_kaiserschmarrn_with_86930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["950g/2lb 2oz strawberries, hulled and quartered", "175g/6oz caster sugar", "175ml/6fl oz orange juice", "1 star anise, lightly toasted", "1 tbsp Grand Marnier or other orange liqueur", "50g/2oz butter, softened to butter the pans", "175g/6oz caster sugar, plus 40g/1½oz for dusting the pans", "4 free-range egg yolks, at room temperature", "115g/4oz fromage blanc", "175g/6oz crème fraîche", "75ml/5 tbsp dark rum", "75g/3oz plain flour", "60g/2¼oz golden raisins, soaked in 4 tbsp white wine", "8 free-range eggs, whites only", "½ tsp cream of tartar", "60g/2¼oz icing sugar, for dusting "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For strawberry sauce, set aside 350g/12oz of the strawberries and 60g/2¼oz of the sugar.", "In a heavy saucepan, combine the remaining strawberries, 125ml/4fl oz water, 115g/4oz of the sugar, the orange juice, star anise and Grand Marnier.  ", "Bring to a boil over medium heat, stirring occasionally to prevent scorching.  Reduce the heat and simmer for 10 minutes.", "Remove the strawberries from the heat and cover with cling film. Set aside to infuse for 10 minutes.", "Remove the star anise and pour the strawberry mixture into a blender, and blend to a fine purée.", "Strain the sauce through a fine sieve and reserve in a pan ready to use, or refrigerate if not using right away.", "Preheat the oven to 210C/425F/Gas 7.", "For the kaiserschmarrn, generously butter two ovenproof dishes 22cm/8½ in diameter.  Dust each pan with sugar and tap out any excess.", "In a medium bowl with a hand mixer, beat the egg yolks with 25g/1oz of the caster sugar until mixture is light and lemony yellow.  ", "Beat in the fromage blanc and mix until well combined.  ", "Beat in the crème fraîche and rum, then beat in the flour. Stir through the raisins.", "In another bowl and using an electric whisk or stand mixer, whisk the egg whites on medium-low speed until they foam, then add the cream of tartar.  ", "Turn the speed up to medium and continue to beat while slowly pouring in the remaining 150g/5½oz sugar. Whisk until stiff peaks form when the whisk is removed.", "Whisk half the egg whites into the crème fraiche mixture, then gently fold in the remaining egg whites.  ", "Divide the mixture equally between the two sugared pans.", "Bake the kaiserschmarrn in the middle of the oven for 15 minutes. Turn the pans if browning unevenly and bake for another 5-8 minutes, until puffed and brown.  The center should be set and slightly firm.", "Meanwhile, in a large saucepan, bring the strawberry sauce to a boil over high heat.  Add the reserved 60g/2¼oz sugar and stir until the sugar has dissolved.  Cook the sauce over a high heat for a minute.  ", "Add the reserved 350g/12oz cut strawberries, and stir through the sauce to coat. To serve, divide the strawberry sauce among four serving plates.", "Using a serving spoon divide each one into two portions and spoon on top of the strawberry sauce. Dust with icing sugar and serve immediately."]}, {"isVegetarian": false, "title": "Kale and kohlrabi kimchi with pulled pork", "url": "www_bbc_co_uk_food_recipes_kale_and_kohlrabi_kimchi_63904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz kale", "1 tsp salt", "½ lemon, juice only", "1 tbsp honey", "2-3cm/1in piece fresh root ginger, finely chopped", "2 tbsp sesame seeds", "extra virgin olive oil (optional)", "4 tbsp rice flour (alternatively use spelt or plain flour)", "8 garlic cloves, chopped", "1 onion, roughly chopped", "50ml/2fl oz fish sauce", "4 tbsp Korean chilli powder, or 2 tbsp cayenne pepper", "1 small kohlrabi (about 250g/9oz), peeled and cut into 5mm/¼in matchsticks", "1 carrot, cut into matchsticks", "1 leek, thinly sliced", "raw kale with sesame seeds and honey (from above)", "sesame seeds (optional)", "500g/1lb 2oz leftover pulled pork or shredded belly pork ", "1 loaf sourdough bread, cut into thick slices", "1 whole bulb of garlic, cut in half", "2 tbsp sea salt"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the raw kale with sesame seeds and honey, pull the kale leaves off the thick stalks. Finely chop the stalks and roughly chop the leaves, then wash both. Drain well,", "Place the kale in a bowl with the salt, lemon juice and honey. Massage the dressing into the leaves for 2-3 minutes, bruising them so they soak up the juices. Leave for 30 minutes, then pour off the excess liquid. Add the ginger and sesame seeds, mix and dress with extra virgin olive oil, if using. ", "For the kale and kohlrabi kimchi, bring 400ml/14fl oz water to a gentle simmer and add the rice flour. Keep stirring for a few minutes until it thickens and starts to bubble. Simmer for another 1-2 minutes until it becomes an opaque porridge. ", "Using a hand-held blender or a food processor, blend the garlic, onion and fish sauce to a purée. Transfer to a bowl, add the flour mixture and chilli powder. Mix well, then add the kohlrabi, carrot and leek and finally the raw kale. Mix well.", "Put into a sterilised non-metallic tub, press down to pack it in and cover with a lid. Eat it fresh with sesame seeds sprinkled on top, or leave it in a cool room for 2-3 days. After two days, check if you can see any tiny bubbles; they will prove it is fermenting. If not, leave it out of the fridge a little longer, until the fermentation process starts.", "Keep the kimchi in a sealed container in the fridge and eat within three weeks. The raw kale is best eaten immediately.", "To serve, heat a griddle pan. Slightly oil and rub the garlic and salt into the bread and cook for 1-2 minutes on each side.", "Shred leftover pork and reheat it in a frying pan until hot right through. Serve on the bread with a spoonful of kimchi on top."]}, {"isVegetarian": true, "title": "Kale and quinoa sauté with orange tahini dressing", "url": "www_bbc_co_uk_food_recipes_kale_and_quinoa_saut_64469", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_and_quinoa_saut_64469_16x9.jpg", "ingredients": ["350g/12oz quinoa", "1 tbsp extra virgin olive oil", "2 tsp coconut oil", "600g/1lb 5½oz kale, tough stalks discarded, leaves shredded, washed", "1 fat garlic clove, finely chopped", "1 large handful chopped fresh coriander or flatleaf parsley, to garnish", "1 unwaxed orange, zest only, finely sliced", "2½ tbsp tahini", "2 tbsp extra virgin olive oil", "1 garlic clove", "6 tbsp warm (boiled) water", "4 tbsp orange juice", "freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the quinoa in a bowl and cover with approximately 700ml/1¼ pints cold water. Set aside to soak overnight (or for at least 8 hours).", "Drain the quinoa and transfer to a very large saucepan. Cover with 350ml/12fl oz water and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until the quinoa is tender. ", "Drain the quinoa and put in a large mixing bowl. Drizzle over the olive oil and season with sea salt. ", "Meanwhile, for the dressing, whisk together all of the dressing ingredients until smooth, creamy and well combined, adding a splash of warm water to loosen the mixture if necessary. Season with pepper. Set aside.", "Heat the coconut oil in a frying pan over a medium heat until melted. Add the kale and stir-fry for 1-2 minutes, adding  the garlic after 1 minute. Continue to fry until the kale is just tender, then tip it into the quinoa and stir to combine.", "To serve, divide the kale and quinoa sauté equally among 4 plates, garnish with the orange zest. Drizzle over the tahini dressing and scatter over the herbs. "]}, {"isVegetarian": true, "title": "Kale, lemon, honey and sesame seed salad", "url": "www_bbc_co_uk_food_recipes_kale_lemon_honey_and_69996", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_lemon_honey_and_69996_16x9.jpg", "ingredients": ["400g/14oz kale", "1 tsp salt", "½ lemon, juice only", "1 tbsp honey", "2-3cm/1in piece fresh root ginger, finely chopped", "2 tbsp sesame seeds", "extra virgin olive oil (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pull the kale leaves off the thick stalks. Finely chop the stalks and roughly chop the leaves, then wash both. Drain well.", "Place the kale in a bowl with the salt, lemon juice and honey. Massage the dressing into the leaves for 2-3 minutes, bruising them so they soak up the juices. Leave for 30 minutes, then pour off the excess liquid. Add the ginger and sesame seeds, mix and dress with extra virgin olive oil, if using. "]}, {"isVegetarian": true, "title": "Kale, pea and ricotta fritters", "url": "www_bbc_co_uk_food_recipes_kale_pea_and_ricotta_41792", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_pea_and_ricotta_41792_16x9.jpg", "ingredients": ["120g/4¼oz frozen peas, thawed and crushed", "150g/5½oz kale leaves, finely shredded", "240g/8½oz fresh ricotta", "3 free-range eggs", "50g/1¾oz chia seeds", "1 tbsp lemon zest (approx. 1 lemon)", "2 tbsp chopped fresh mint", "2 tbsp extra virgin olive oil", "sea salt and black pepper", "1 small bunch watercress", "4 lemon wedges"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put all the ingredients, except the oil, in a bowl and mix. Season with salt and pepper and set aside for 20 minutes.", "To cook the fritters, heat a little oil in a large frying pan over a medium heat. Take about 2 tablespoons of the mixture and shape into a patty, flatten slightly. Cook in batches for 2–3 minutes on each side until golden brown, adding more oil if necessary.", "Divide the fritters between serving plates. Serve with watercress and lemon wedges."]}, {"isVegetarian": false, "title": "Kale with sweet-and-sour pork belly and quince pureé", "url": "www_bbc_co_uk_food_recipes_kale_with_sweet_and_sour_21709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/2½oz acacia or Manuka honey", "50g/1¾oz tomato ketchup", "2 tbsp light soy sauce", "4 tsp rice wine vinegar", "10g root ginger, peeled and finely chopped", "½ red chilli, deseeded and finely chopped", "¼ shallot, finely chopped", "75g/2½oz quince (about ¼ large quince), peeled and cut into 2cm/¾in wedges", "500g/1lb 2oz pork belly, all bones removed, skin removed or scored", "20g/¾oz butter", "pinch sea salt", "280g/9¾oz Westland Winter or Red Curled kale leaves", "8 Nero di Toscana kale leaves", "150g/5½oz quince purée ", "1 tbsp sesame seeds, lightly toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ½.", "For the pork belly, in a medium lidded casserole, mix all the ingredients except the pork. Add the belly and baste with the sauce. Bake for 3 hours, basting with the sauce every 20 minutes. When cooked, the pork will be firm but offer a little resistance when a knife is inserted. Lift the pork out of the casserole and set aside to rest, loosely covered with foil.", "Strain the cooking juices into a saucepan over a high heat and bring to the boil. Reduce the volume of liquid by half so it thickly coats the back of a spoon. Remove from the heat and reserve.", "For the kale, in a large lidded saucepan, mix together 100ml/3½fl oz water, the butter and salt and bring to the boil. Add both varieties of kale and cook, covered with a lid, for 3–4 minutes, until barely cooked but still retaining a bit of bite and their wonderful colour. Drain well.", "To serve, spread a spoonful of the quince purée in the centre of each plate. Add the kale, then slice the pork belly and divide between the plates. Finish with a little more purée and scatter over the sesame seeds."]}, {"isVegetarian": true, "title": "Karara aloo chaat (crisp potato salad)", "url": "www_bbc_co_uk_food_recipes_karara_aloo_chaat_crisp_45821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz yoghurt", "50ml/2fl oz single cream", "50ml/2fl oz sugar syrup", "siphon with two charges ", "vegetable oil, for shallow and deep frying", "500g/1lb 2oz King Edward potatoes, peeled and cut into large cubes", "100g/3½oz purple or Peruvian potatoes, thinly sliced using a mandoline", "sea salt", "100g/3½oz granulated sugar", "2 tbsp mango powder", "1 tsp mild Kashmiri chili powder or sweet paprika", "1 tbsp black salt (kala namak)", "1 tsp toasted cumin powder (seeds toasted and ground to powder)", "1 tsp ground ginger ", "1 tsp powdered fennel seeds ", "salt, to taste", "½ pomegranate, seeds only", "1 tbsp coriander leaves, chopped", "1 tbsp mint leaves, chopped", "baby watercress", "chaat masala and red chilli powder, mixed together in a shaker to sprinkle "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the yoghurt foam, mix the yoghurt, cream and sugar syrup together. Put the mixture into a siphon bottle, making sure the bottle is at least half full, and charge with two nitro cartridges. Keep the bottle chilled for two hours before using.", "For the Karara aloo chaat, in a frying pan heat a little vegetable oil and fry the King Edward potatoes in medium hot oil until almost cooked. Remove them from the pan and put them on a tray lined with kitchen paper. Place another layer of kitchen paper on top and press them flat.   ", "Fry them again to make them light brown in color and crisp.  Remove and drain on a tray lined with kitchen paper.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C/350F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Deep fry the Peruvian potato slices to make crisps.  Sprinkle with sea salt and set aside until needed.", "For the spicy chutney, mix 100ml/3½fl oz of water with the sugar in a small pan and bring to the boil. Add the rest of the ingredients and simmer for 4-5 minutes, or until you have a fairly thick chutney. Add water to thin down, if required.", "To serve, toss the fried hot potatoes with the pomegranate seeds, coriander and 2-3 tablespoons of chutney. Place on a plate in 3-4 small clusters. Pipe the yoghurt foam in between and garnish with purple potato crisps, mint and watercress.  Sprinkle with chaat masala and red chilli powder."]}, {"isVegetarian": false, "title": "Kashmiri biryani", "url": "www_bbc_co_uk_food_recipes_kashmiri_biryani_14589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kashmiri_biryani_14589_16x9.jpg", "ingredients": ["2 tbsp ginger and garlic paste ", "430ml/15fl oz plain yoghurt", "½ tsp ground turmeric", "1 tbsp red chilli powder", "¼ nutmeg, grated", "1 tsp caster sugar", "1½ tsp salt", "1 lemon, juice only", "1kg/2lb 4oz mutton from leg or shoulder, bone removed, cut into 2.5cm/1in cubes", "500g/1lb 2oz basmati rice", "½ lime, juice only", "¼ tbsp salt", "150g/5½oz ghee, melted, or vegetable oil", "40g/1½oz raisins", "60g/2¼oz walnut halves", "4 green cardamom pods", "5cm/2in piece of cinnamon stick", "3 bay leaves", "1 tsp cumin seeds", "2 black cardamom pods (optional)", "2 tsp ground coriander", "1 tsp garam masala ", "½ tsp saffron strands, soaked in 120ml/4fl oz warm milk or water", "few drops rosewater or kewra water", "30g/1oz dried figs and apricots", "30g/1oz dried cranberries", "20g/¾oz fresh mint leaves"], "serves": "Serves 6–8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the marinade ingredients together in a large bowl, add the meat and stir to coat. Cover and put in the fridge to marinate for 30 minutes, or if possible overnight.", "Meanwhile, wash the rice in a couple of changes of water, then soak it for 20 minutes. Bring 2.5 litres/4½ pints of water to the boil in a large saucepan. Add the rice, lime juice and salt and boil for 6 minutes, until the rice is two-thirds cooked. Drain the rice and spread it out on a tray to cool.", "Heat two-thirds of the ghee or vegetable oil in a wide, heavy-based casserole dish. Add the raisins and fry for 30 seconds, or until they puff up, then remove them and drain on kitchen paper. Add the walnuts and fry for 30 seconds, then remove them and drain on kitchen paper.", "Add the cardamom pods, cinnamon and bay to the casserole and fry for 30–60 seconds. Add the cumin and black cardamom pods. Add the meat with its marinade and cook for 10–12 minutes over a high heat, stirring occasionally. Add the coriander, garam masala and 250ml/9fl oz of water and cook, covered, over a medium heat for 1 hour, or until the meat is tender and some sauce still remains in the pan. Add a little more water, if needed.", "To assemble, spread an even layer of the rice over the cooked meat and sauce, sprinkle the saffron milk, rose water, fried raisins and walnuts, cranberries and mint over the rice and the remaining ghee.", "Cover with a tightly fitting lid and cook over a medium–low heat for 10–15 minutes, until the dish is hot through. Set aside for another 5 minutes, then open the pot and serve."]}, {"isVegetarian": true, "title": "Katy's carrot and squash cookies", "url": "www_bbc_co_uk_food_recipes_katys_carrot_and_squash_66459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1¼oz butter, at room temperature", "70g/2¾oz plain flour, plus extra for dusting", "1 tsp golden caster sugar (optional)", "20g/¾oz grated carrot", "50g/2oz butternut squash pieces, roasted ", "3 small sprigs fresh rosemary"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a bowl, mix together the butter, flour and sugar, if using. Rub the  mixture with your fingertips until it resembles breadcrumbs.", "Stir in the grated carrot and roasted butternut squash using a fork. ", "Bring the mixture together as a dough using your hands, then turn out the dough onto a lightly floured work surface.", "Divide the dough into six equally sized pieces. Roll each piece into a sausage shape and place it onto a baking tray.", "Flatten the lengths of cookie dough into carrot shapes about 0.5cm/¼in thick, using your hands.", "Tear individual mini-sprigs off the rosemary sprigs and insert one into the top of each cookie to resemble the carrot tops.", "Bake the cookies in the oven for 15-20 minutes, or until crisp and golden-brown. Remove from the baking tray and set aside to cool on a wire rack."]}, {"isVegetarian": false, "title": "Katy's jelly boats", "url": "www_bbc_co_uk_food_recipes_katys_jelly_boats_23729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 seedless red grapes, cut in half", "1 orange, cut in half, flesh removed, skin shell reserved", "50ml/2oz warm, boiled water", "1 tsp gelatine granules", "100ml/3½fl oz orange juice ", "2 large fresh mint leaves"], "serves": "Makes 2", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place six grape halves into each half of the empty orange skin. Place the skins into cups, a muffin-tray or similar, so that they cannot tip over.", "In a bowl, mix together the warm water and gelatine granules and stir until the gelatine has completely dissolved. ", "Add the orange juice and stir well.", "Pour the jelly mixture into each half of orange skin, almost filling the skins. Carefully transfer to the fridge and chill for 2-3 hours, or until the jellies have set.", "Fold each mint leaf in half and pierce with a cocktail stick to make sails for the boats. Just before serving, push one sail into each set jelly."]}, {"isVegetarian": false, "title": "Kid's lasagne", "url": "www_bbc_co_uk_food_recipes_katys_lasagne_50975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil, plus extra for greasing", "200g/7oz tinned chopped tomatoes", "1 fresh lasagne sheet, cut in half", "6 fresh basil leaves", "1 slice ham", "¼ ball fresh mozzarella", "100g/3½ oz ricotta "], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a small lidded ovenproof dish with a little olive oil.", "Spoon a little chopped tomato into the dish and spread it over the bottom. Add half the lasagne sheet and cover with a little more chopped tomato, making sure it covers the sheet of lasagne.", "Tear half of the basil leaves and half of the ham into small pieces and sprinkle on top.", "Tear half of the mozzarella over the top, then dot small spoonfuls of half of the ricotta on top as well and season with freshly ground black pepper.", "Repeat the layering process with the remaining ingredients: lasagne, tomatoes, basil, ham, ricotta and mozzarella. Then drizzle over the olive oil.", "Cover with the lid and bake for 10 minutes, then remove the lid and cook for a further 10-12 minutes or until cooked through and golden-brown on top."]}, {"isVegetarian": true, "title": "Kid's shortbread", "url": "www_bbc_co_uk_food_recipes_katys_shortbread_35940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼ oz plain flour", "40g/1½ oz butter, cut into cubes, softened", "½ tsp vanilla extract", "20g/¾ caster sugar", "6 glacé cherries, chopped"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 180C/350F/Gas 4. Line a baking tray with greaseproof paper.", "Put the flour and butter into a mixing bowl and rub together with your fingers until the mixture resembles breadcrumbs. Stir in the vanilla, sugar and cherries.", "Squeeze the mixture into a ball with your hands.  Sprinkle a work surface with flour and roll the dough out to a 0.5cm/¼in thickness.", "Use a biscuit cutter to cut out shapes and place on the baking tray. Re-roll any leftover dough to make more biscuits.", "Bake the biscuits for 12-15 minutes or until pale golden-brown."]}, {"isVegetarian": true, "title": "Kid's apricot tarts", "url": "www_bbc_co_uk_food_recipes_katys_tarts_38582", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 tinned apricot halves", "250g/9oz ready-made puff pastry", "2 tsp apricot jam", "4 tsp raspberry jam"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with greaseproof paper.", "Pat four apricot halves dry with kitchen paper and set aside. Chop the remaining apricots into small pieces.", "Sprinkle flour on a work surface and roll the pastry out into a large rectangle. Use a 10cm/4in pastry cutter  (or a small bowl) to cut out four circles. Use a 8cm/3in pastry cutter to press down lightly in the middle of each circle, then place on the baking tray.", "Brush the apricot jam in the smaller circle of each piece of pastry, then top each with an apricot half. Arrange the chopped apricots around the half, ensuring the pastry border is clear.", "Drizzle over the raspberry jam.", "Bake in the oven for 10-15 minutes, or until the pastry is risen and golden-brown."]}, {"isVegetarian": true, "title": "Fruity kebabs", "url": "www_bbc_co_uk_food_recipes_kazimas_fruity_kebabs_62555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kazimas_fruity_kebabs_62555_16x9.jpg", "ingredients": ["8 strawberries, washed ", "2 kiwi fruits", "2 bananas", "1 mango", "16 grapes, washed", "50g/1¾oz good-quality dark chocolate (at least 70% cocoa solids)", "25g/1oz butter", "125ml/4fl oz double cream", "1 tsp orange zest", "1 tbsp orange juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Start by preparing the fruit, for the strawberries remove the stalk and cut in half if they are big. ", "For the kiwis, peel with either a potato peeler or a small sharp knife. Cut off the top and bottom of the kiwi and cut into 4 pieces. ", "For the banana, peel the bananas and cut into chunks. If you are preparing the banana beforehand you will need to drizzle it with lemon juice or it will go brown.", "For the mango, stand the mango so the pointed end is facing away from you and the cheeks either side. Slice using a small sharp knife downwards to remove the mango cheeks either side of the stone.  Score along the length of the cheek with the tip of the knife. Turn 90 degrees and score along again to make a crisscross pattern.  The squares should be bite size. Gently push out the flesh, slice off the cubes and throw away the skin. ", "Thread the fruit onto wooden kebab skewers, alternating the fruit. ", "To make the chocolate sauce, break the chocolate and put it in a heatproof bowl. Sit the bowl over a pan of barely simmering water, making sure the base of the bowl doesn't touch the water.", "Allow the chocolate to melt slowly, stirring occasionally. The melted chocolate should be smooth and glossy.", "Heat all the remaining ingredients in a small saucepan until evenly combined. Do not let the cream boil. Remove from the heat and stir through the melted chocolate. Stir until well combined and the sauce is smooth and glossy.  ", "Pour the chocolate sauce into a small bowl and serve as a dipping sauce for the kebabs."]}, {"isVegetarian": false, "title": "Kedgeree", "url": "www_bbc_co_uk_food_recipes_kedgeree_33844", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp coriander seeds", "½ tsp brown mustard seeds", "1 tbsp cumin seeds", "½ tsp chilli powder (such as cayenne)", "½ tsp ground turmeric", "¼ tsp cracked black peppercorns", "1 tsp grated fresh ginger", "2 garlic cloves, crushed", "75ml/2½fl oz white vinegar", "500ml/18fl oz milk ", "1 onion, cut in half", "2 cloves", "2 bay leaves", "500g/1lb 1oz smoked haddock fillet, pin boned", "500g/1lb 1oz basmati rice", "2 tsp turmeric                                                                                                                           ", "1 onion, chopped", "1 garlic clove", "2cm/1in piece ginger, finely chopped", "100ml/3½fl oz sunflower oil", "60g/2oz madras curry paste (from above) ", "1 red chilli, chopped", "1 star anise", "1 bay leaf", "400ml/14fl oz cream", "salt and freshly ground black pepper", "4 free-range eggs", "1 tsp white wine vinegar, for poaching", "2 tbsp chopped fresh parsley, for garnish ", "50g/1¾oz butter, melted ", "1 punnet coriander cress, for garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the madras curry paste, toast the coriander seeds, mustard seeds, cumin seeds, chilli powder and turmeric in a dry frying pan over a medium heat. When they start to pop and crackle in the pan, add the peppercorns and toast for another minute. Remove from the heat and set aside.", "Add the ginger and garlic to the spice mix and place in a mini blender or pestle and mortar. Add the vinegar and blend or pound to a smooth paste. ", "For the haddock and rice, place the milk and 500ml/18fl oz water in a large pan. Stud each half of the onion with a clove and bay leaf then add to the milk and bring to the boil. ", "Place the haddock in a deep roasting tin and pour over the hot milk. Cover with cling film very quickly to seal in the steam and heat. Set aside for approximately 45 minutes.", "Remove the cling film and transfer the haddock to a plate. Remove the fish skin and any bones and leave it chunky and as whole as possible.", "Wash the rice several times until the water becomes clear. Add the rice, 1 litre/1¾ pint water and the turmeric to a pan and bring to the boil. When boiled cover with a lid and remove from the heat. Set aside for 20 minutes, then spread the cooked rice over a tray to cool.", "For the sauce, in a large pan gently fry the onion, garlic and ginger in the sunflower oil until the onions are light golden-brown. Add the madras paste and cook for five minutes then add the chilli, star anise and bay leaf. Add 100ml/3½fl oz water and simmer until the volume of liquid has reduced by half.", "Add the double cream and simmer for 10 minutes then transfer to a blender and pulse until smooth. Season to taste with salt and freshly ground black pepper.", "To serve, transfer the sauce to a pan and bring to a simmer. Add the rice and gently reheat. Fold in three-quarters of the haddock and heat through. ", "Meanwhile, fill a large pan with boiling water and the white wine vinegar, and poach the eggs to your liking. ", "At the last minute, add the remaining haddock and chopped parsley and serve in warm bowls with a poached egg on top. Finish with a spoonful of melted butter, a sprinkle of coriander cress and a little salt and pepper."]}, {"isVegetarian": false, "title": "Kedgeree", "url": "www_bbc_co_uk_food_recipes_kedgeree_11358", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kedgeree_11358_16x9.jpg", "ingredients": ["½ onion,  finely chopped ", "55g/2oz butter", "300g/10½oz  basmati rice", "1 tsp madras curry powder", "freshly grated nutmeg", "200ml/7fl oz milk", "110ml/4fl oz double cream", "300g/10½oz naturally smoked haddock, (NOT dyed) picked over, bones removed and flesh cut  into chunks", "sea salt and cracked black pepper", "small bunch parsley, chopped", "3 hard-boiled eggs, shelled and halved ", "good pinch cayenne and freshly ground nutmeg (optional)", "knob of butter", "wedges of lemon"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the onion gently in the butter for a few minutes, then add the rice.", "Continue cooking gently and stirring, adding the curry powder and nutmeg.  After a few minutes, add the milk, cream and 250ml/9fl oz water.", "When the mixture begins to simmer, add the fish and continue simmering, stirring occasionally until the rice is cooked. (You may need to add a little water if the mixture becomes dry.)", "Season, add the parsley and stir.  Add the eggs and garnish with cayenne and nutmeg if using.  Serve topped with a knob of butter and wedges of lemon."]}, {"isVegetarian": false, "title": "Kedgeree", "url": "www_bbc_co_uk_food_recipes_kedgeree_88961", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "4 shallots, chopped", "1 clove garlic, chopped", "1 tsp mild curry powder", "250g/8oz basmati or long grain rice, cooked and drained", "500g/1lb 2oz salmon or smoked haddock, cooked, skinned and flaked", "150ml/¼ pint double cream", "salt and freshly ground black pepper", "3 free-range eggs, hard-boiled, cut into quarters", "small handful fresh coriander, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the shallots and garlic and fry gently until softened but not coloured.", "Add the curry powder and fry for 3-4 minutes.", "Add the shallots and garlic to the cooked rice and stir in the flaked fish and cream. Season with salt and freshly ground black pepper. ", "To serve, spoon into a serving dish and scatter the quartered hard-boiled eggs and fresh coriander leaves over the top."]}, {"isVegetarian": false, "title": "Kefta mkawra tagine (Meatballs with eggs on top)", "url": "www_bbc_co_uk_food_recipes_keftamkawrataginemea_86380", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz minced beef or lamb", "1 onion, very finely chopped", "3 cloves garlic, crushed", "1 tsp ground ginger", "1 tsp ground cumin", "½ tsp chilli powder", "1 tsp paprika ", "small handful finely chopped fresh coriander leaves", "small handful finely chopped fresh flatleaf parsley", "1 egg yolk", "2 tbsp olive oil", "1 small onion, finely chopped", "2 tbsp tomato purée ", "400g/14oz can chopped tomatoes, drained of excess juice", "2 tsp honey", "200g/7oz frozen peas", "4 free-range eggs", "chopped fresh parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, place the minced beef or lamb, onion, garlic, spices, fresh herbs, egg yolk and some salt and pepper into a large bowl.", "Use your hands to mix all the ingredients together until well combined. Shape into walnut-sized balls and set aside.", "For the sauce, heat the olive oil in a tagine or heavy-bottomed casserole dish. Add the onion and cook slowly over a low heat until translucent.", "Increase the heat to medium-high, add the meatballs and brown lightly.", "Stir the tomato purée into the chopped tomatoes then add to the tagine with the honey. ", "Stir gently, cover and simmer for ten minutes. ", "Stir in the peas, then break the eggs on top of the stew, turn the heat right down and cook with the lid on for about ten minutes, or until the eggs are cooked to your liking.", "Sprinkle over the chopped parsley and serve."]}, {"isVegetarian": true, "title": "Kentish cobnut cake and apple compôte", "url": "www_bbc_co_uk_food_recipes_kentishcobnutcakeand_92135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb self-raising flour", "225g/8oz butter, melted, plus extra butter for greasing", "1 tbsp ground ginger", "225g/8oz light soft brown sugar", "6 free-range eggs, beaten", "110g/4fl oz double cream", "150g/5oz cobnuts, shells removed, finely chopped", "50g/2oz butter", "4 apples, peeled, cores removed, finely chopped", "2-3 tbsp caster sugar", "½ tsp ground cinnamon", "200ml/7fl oz double cream, lightly whipped, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cobnut cake, preheat the oven to 160C/325F/Gas 2. Grease a 1kg/2lb 2oz loaf tin with butter.", "In a bowl, mix together the flour and melted butter until well combined.", "Add the ground ginger, sugar and beaten eggs and beat until well combined. ", "Add the cream and mix until the mixture forms a smooth, thick batter.", "Stir in the chopped cobnuts until well combined.", "Spoon the mixture into the prepared loaf tin, gently spreading the batter into all the corners and shaking the tin to make sure the mixture has settled.", "Transfer the loaf tin to the oven and bake for 1-1¼ hours, or until the cake has risen and is golden-brown, and a skewer inserted into the centre of the cake comes out clean. ", "Set the cake aside to cool slightly in the tin.", "Meanwhile, for the apple compôte, heat the butter in a frying pan over a medium heat. When the butter is foaming, add the apples, caster sugar and ground cinnamon and cook for 4-5 minutes, or until the apples have broken down slightly and the mixture has thickened.", "To serve, cut the cake into six to eight slices (it is best served still warm). Serve each slice with a dollop of whipped cream and a spoonful of warm apple compôte."]}, {"isVegetarian": false, "title": "Kent artichoke and dry cured smoked bacon soup with olive oil croûtons and crisp bacon", "url": "www_bbc_co_uk_food_recipes_kentartichokeanddryc_91092", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp freshly squeezed lemon juice", "900g/2lb Jerusalem artichokes", "2 tbsp sunflower oil", "100g/3½oz smoked streaky bacon, cut into lardons", "50g/1¾oz unsalted butter", "250g/8¾oz onions, peeled and finely chopped", "1.2 litres/2 pints boiling water", "1 tsp fine sea salt", "freshly ground black pepper", "3-4 tbsp finely chopped flatleaf parsley", "croutons fried in olive oil"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a bowl with cold water and add the lemon juice. Peel the Jerusalem artichokes using a potato peeler and immediately place them into the bowl of lemon water.", "Meanwhile, heat the oil in a large pan. Add the bacon and fry for 4-5 minutes or until golden-brown and crisp, occasionally stirring with a wooden spoon. Remove one tablespoon of the bacon lardons and set aside for garnish.", "Add the butter to the pan the bacon was cooked in. When the butter is foaming, add the onions and stir. Reduce the heat and sweat for 7-8 minutes.", "Thinly slice the artichokes and add them to the pan. ", "Add the water to the pan. Season, to taste, with salt and freshly ground black pepper. Bring the mixture back to the boil, then simmer for 35 minutes or until the artichokes are tender.", "Transfer the mixture to a food processor and blend until smooth. ", "To serve, divide the soup equally among six bowls. Garnish with chopped parsley, the reserved tablespoon of bacon and olive oil croutons."]}, {"isVegetarian": false, "title": "Kerala king prawn and coconut curry", "url": "www_bbc_co_uk_food_recipes_keralakingprawnandco_75325", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/keralakingprawnandco_75325_16x9.jpg", "ingredients": ["500g/1lb 2oz raw tiger prawns, shells off and de-veined", "1 tbsp fresh lemon juice", "3 tbsp sunflower oil", "1 onion, grated", "½ tsp ground turmeric", "6 whole cardamom pods, lightly crushed to split open", "1 tsp chilli powder", "1 cinnamon stick", "3 garlic cloves, finely grated", "2.5cm/1in piece root ginger, finely grated", "small bunch fresh coriander ", "175ml/6 fl oz coconut cream", "salt", "plain boiled rice or chapattis, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the prawns with the lemon juice in a shallow non-metallic dish and leave to marinate while you make the sauce. Heat a heavy-based pan with two tablespoons of the oil and then add the onion.  Cook for 2-3 minutes until softened but not coloured, then add the turmeric, cardamom pods and chilli powder. Cook for 1-2 minutes until fragrant, stirring constantly. ", "Stir the remaining oil into the pan with the cinnamon, garlic and ginger.  Cook for another 1-2 minutes until the garlic and ginger have softened and are cooked through.", "Reserve a few coriander sprigs for garnish and blend the remainder with the coconut cream in a mini food processor. ", "Stir into pan with the onion and spice mixture until well combined, then bring to the boil. Reduce the heat and simmer gently for 1-2 minutes, then stir in the marinated prawns and season with salt. Continue to simmer for 1-2 minutes until the prawns are just cooked through and tender, stirring constantly.", "Garnish the curry with the reserved coriander sprigs and serve with rice or chapattis."]}, {"isVegetarian": false, "title": "Keralan kozhi kuttan with lime and coriander rice and mint raita", "url": "www_bbc_co_uk_food_recipes_keralan_kozhi_kuttan_64529", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp ground turmeric ", "2 tbsp Greek-style yoghurt, lightly whisked", "800g/1lb 12oz whole chicken, skinned and jointed", "3 tbsp vegetable oil", "2 green bird's-eye chillies, slit lengthways", "1 onion (approximately 170g/6oz), thinly sliced", "2 tomatoes (approximately 140g/5oz total weight), puréed to a smooth paste", "100ml/3½fl oz thick coconut milk", "a pinch red chilli flakes or chopped fresh coriander, to garnish", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "2.5cm/1in piece fresh root ginger, roughly chopped", "8 garlic cloves, roughly chopped", "1 tbsp coriander seeds", "4 dried Kashmiri chillies (or other dried mild red chillies)", "2 heaped tsp fennel seeds", "½ tsp black peppercorns", "4cm/1½in piece cassia bark", "5 green cardamom pods, seeds only", "1 tsp cumin seeds, roasted and coarsely ground", "½ tsp black salt", "pinch sea salt", "30g/1oz fresh mint leaves", "10g/½oz coriander leaves and stems", "150g/5½oz Greek-style yoghurt", "2.5cm/1in piece fresh root ginger, roughly chopped", "2 spring onions, roughly chopped", "500g/1lb 2oz cold cooked basmati rice ", "1 tbsp vegetable oil", "1 green bird’s-eye chilli, roughly chopped", "½ lime, zest and juice", "2 tbsp finely chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Keralan kozhi kuttan, put the turmeric, yoghurt and a pinch of salt in a bowl and mix well. Add the chicken pieces and leave to marinate for an hour.", "Meanwhile, make the curry paste. Place a frying pan over a low heat and add the oil, followed by the ginger and garlic. Fry for about a minute, then add the remaining paste ingredients and fry for 5–6 minutes, or until lightly coloured. Leave to cool, then transfer to a blender, add 3–5 tablespoons water and blitz to a fine paste. Set aside.", "To finish the Keralan kozhi kuttan, place a heavy-based, non-stick pan over a medium heat and add the vegetable oil. When hot, add the chillies and let them sizzle for about 10 seconds. Add the onion and a pinch of salt and fry for 10–12 minutes, or until browned. Stir in the puréed tomatoes and cook for 3 minutes. Add the spice paste and fry for 4–5 minutes, stirring well, until the sauce thickens slightly. Increase the heat and add the marinated chicken pieces, stirring well to coat them with spice paste. Fry for 4 minutes, or until lightly coloured. Add 100ml/3½fl oz water and season with salt and pepper. Cover with a lid and simmer for 25 minutes, or until the chicken is cooked through. Add the coconut milk, stir well and simmer for a further 4–7 minutes, or until the sauce is slightly thickened. ", "For the raita, in a small bowl, mix together the crushed cumin seeds, black salt and sea salt. Set aside. ", "Add the mint, coriander, yoghurt, ginger, spring onions and 5 tablespoons water to a blender. Blend to a smooth paste, then transfer to a bowl and sprinkle over the spice mix. ", "For the lime and coriander rice, season the cooked rice with salt and pepper. Fork lightly to loosen the grains and set aside.", "Place a large heavy-based saucepan over a medium heat and add the oil. When hot, add the chopped chilli and fry for a few seconds. Add the rice and heat through, stirring well. Add the lime zest and fresh coriander. Mix well and turn off the heat. Stir through the lime juice.", "To serve, garnish the curry with chilli flakes or coriander and serve in bowls with the rice and raita alongside."]}, {"isVegetarian": false, "title": "Keralan seafood pie", "url": "www_bbc_co_uk_food_recipes_keralan_seafood_pie_15063", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp coconut oil or vegetable oil", "10 fresh curry leaves", "1 large onion, sliced", "2.5cm/1in fresh root ginger, cut into fine strips", "4 green chillies, split open lengthways", "500g/1lb 2oz mussels in the shell, cleaned", "½ tsp ground turmeric", "½ tbsp rice flour", "500ml/18fl oz extra thick coconut milk", "1 tsp salt", "250g/9oz peeled and deveined raw prawns", "200g/7oz undyed smoked haddock fillet, diced into 1 inch pieces", "200g/7oz cleaned squid tubes or cuttle fish, scored ", "375g/13oz all butter puff pastry – rolled 3mm/1/8in thick, 4 x 16cm diameter discs", "2 eggs, lightly beaten", "1 tbsp black onion seeds", "115g/4oz sprouted fenugreek seeds", "115g/4oz sprouted moong beans", "1 tomato, deseeded, cut into ½ cm/¼ in dice", "½ cucumber, deseeded, cut into ½ cm/¼ in dice", "1 green chilli (optional), finely chopped", "½ lemon, juice only", "½ tsp salt", "½ tsp sugar", "2-3 tbsp olive oil", "10 fresh curry leaves", "2 green chillies, split open lengthways"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pie, preheat the oven to 200C/400F/Gas 6.", "First make the sauce. Heat the oil in a large frying pan, add the curry leaves, onion, ginger and green chillies and cook, stirring, until the onion is soft. ", "Add the mussels and turmeric, followed by the rice flour. ", "Mix the rice flour in evenly, then add coconut milk and salt, and bring to a simmer. ", "Cook for 2-3 minutes, until the mussels open up and sauce begins to turn glossy. ", "Remove the mussels and take the meat out of the shell, discarding the shells. Set the mussels aside, and continue to cook the sauce until it thickens and becomes very thick.", "Remove the sauce from the heat, cool and mix the raw seafood and the mussel meat through the sauce.", "Divide the pie filling equally among four shallow cast-iron skillets, garnish with the green chillies and curry leaves and cover with the puff pastry disc.", "Brush the pies with egg, sprinkle with black onion seeds and bake in the oven for 15 minutes, or until the fish is cooked through and the pastry crisp and golden brown.", "For the salad, mix together all the ingredients for the salad.", "Serve the pie with the sprouted fenugreek and moong lentil salad alongside."]}, {"isVegetarian": false, "title": "Keralan crab with Currimbhoy salad", "url": "www_bbc_co_uk_food_recipes_keralancrabwithcurri_87982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp sunflower oil", "1 tsp mustard seeds", "2.5cm/1in fresh ginger, peeled and finely chopped", "1 garlic clove, finely chopped", "3-4 curry leaves, finely shredded", "1 green chilli, chopped", "1 small dried red chilli, soaked in water, then drained and finely sliced", "2 small shallots, finely chopped", "75g-110g/3oz-4oz fresh coconut, grated", "½ tsp red chilli powder", "¼ tsp ground turmeric ", "200g/7oz white crabmeat, picked and all shell removed", "1 plum tomato, seeds removed, finely chopped", "1 tbsp fresh coriander leaves, roughly chopped", "salt and freshly ground black pepper", "1 free-range egg yolk", "1 tsp white wine vinegar", "½ tsp Dijon mustard", "150ml/5fl oz rapeseed oil", "2 garlic cloves, finely chopped", "2 green chillies, finely chopped", "3 tbsp coriander leaves, roughly chopped", "½ lime, juice only", "salt and freshly ground black pepper", "2 tbsp olive oil", "4 thin slices white bread, cut into cubes", "4 hard boiled eggs, roughly chopped to about ½cm/0.2in ", "250g/9oz Cos lettuce or any large leafy lettuce, cut into 2.5cm/1in pieces", "small handful fresh coriander leaves, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the Keralan crab, make sure that all the ingredients are prepared before you start cooking. Place the oil in a wok or kadhai (a traditional Indian iron wok) and bring the heat up until it forms a haze. Add a couple of mustard seeds to check if they crackle immediately - take care doing this as they will pop as they hit the pan.", "When the oil is ready, carefully add the mustard seeds and, if possible, cover the pan with a lid for a few moments to prevent the seeds from flying off and hitting you. ", "As soon as the crackling dies down and the aroma resembles the smell of roasting, add the ginger, garlic, curry leaves and the green and red chillies.", "As soon as the garlic turns pale, but not deep golden-brown, add the shallots and continue to fry until soft.", "Add the coconut and fry for 3-4 minutes. Add the chilli powder and ground turmeric.", "Fry for a further 30 seconds before adding the crabmeat, mixing well with a wooden spoon for a further minute.", "Add the tomato and coriander and mix to combine. Add salt and freshly ground black pepper, to taste.", "For the Currimbhoy salad, start by making the mayonnaise. Place the egg yolk, vinegar and mustard into a food processor and blend until pale and creamy.", "With the motor running, gradually pour in the oil in a steady stream until the mayonnaise has thickened.", "Measure 200g/7oz of the mayonnaise into a large bowl (any remaining mayonnaise should be covered and placed in the fridge - do not keep it for longer than two days). ", "Add the garlic, chillies, coriander leaves and lime juice to the mayonnaise in the bowl and mix thoroughly. Season with salt and freshly ground black pepper and set aside.", "Heat a frying pan until hot and add the olive oil. Add the bread, season with salt and freshly ground black pepper and fry for 2-3 minutes or until golden-brown and crisp on all sides.", "Remove the fried bread (croûtons) from the pan and drain on kitchen paper.", "Add the chopped eggs and lettuce leaves to the flavoured mayonnaise and mix - take care not to over mix as the lettuce will go limp very rapidly. ", "Add half of the croûtons to the bowl while mixing, reserving the rest for garnish.", "To serve, pile the salad onto a plate, top with more croûtons and coriander leaves and spoon the crab alongside. Serve immediately."]}, {"isVegetarian": false, "title": "Kerala parathas and South Indian tiger prawns in coconut", "url": "www_bbc_co_uk_food_recipes_keralaparathasandsou_90784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz plain white flour, plus extra for dusting", "2 free-range eggs, beaten", "1 tsp salt", "1 tsp sugar", "2 tbsp unsweetened condensed milk", "150ml/5fl oz full-fat milk", "110g/4oz butter, melted", "2 tbsp sunflower oil", "1 onion, peeled and roughly chopped", "1 red chilli, trimmed, seeds removed", "2 garlic cloves ", "4cm/1½in piece fresh ginger, peeled", "2 tbsp sunflower oil", "12 fresh curry leaves (available from some supermarkets and Asian grocers)", "1 tsp black mustard seeds", "½ tsp methi powder (ground fenugreek)", "pinch asafoetida", "1 tbsp water", "½ tsp ground turmeric", "500g/1lb 2oz jumbo tiger prawns, heads removed, de-veined, tail intact, butterflied", "200ml/7fl oz coconut milk", "1 lime, juice only", "4 tbsp chopped fresh coriander leaves", "1 lime, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the parathas, blend the flour, eggs, sugar, salt and condensed milk in a food processor (fitted with a dough blade) until well combined. ", "Gradually add the full-fat milk in a thin stream, blending continuously, until the mixture comes together as a soft dough. ", "Wrap the dough in cling film and chill in the fridge for at least one hour. ", "When the dough has chilled, turn it out onto a lightly floured work surface. Roll small, golf-ball sized pieces of the dough into balls using your hands, then roll them into thin discs using a rolling pin. ", "Brush the dough discs with melted butter using a pastry brush. ", "Fold one dough disc tightly into a concertina shape. (NB. Do not allow the concertina to fan out. The folds should be 1cm/½in apart.) ", "With the thinnest side of the concertina facing upwards, shape the dough concertina into a coil, tucking the outer end of the coil back into the centre of the coil.", "Lightly squeeze the dough coil back into a ball, then roll it out using a rolling pin, until the disc is 0.5cm/¼in thick and 15cm/6in in diameter. ", "Repeat the process with the remaining pastry discs.", "Heat the sunflower oil in a frying pan over a medium heat. Add the parathas one at a time and fry for 1-2 minutes on each side, or until crisp and golden-brown on the outsides and soft and flaky on the insides. Keep warm.", "For the prawns in coconut, blend the onion, chilli, garlic and ginger to a paste in a food processor.", "Heat the sunflower oil in a frying pan over a medium heat, add the curry leaves, mustard seeds and methi powder and fry for 20-30 seconds, or until fragrant. ", "Add the onion, chilli and garlic paste and fry for 1-2 minutes.", "Add the water, turmeric and prawns and cook for 1-2 minutes or until the prawns are pink and the water has evaporated, stirring well to cover the prawns in the spice mixture. ", "Add the coconut milk and season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer for 1-2 minutes, or until the coconut has warmed through and the prawns are cooked. Squeeze over the lime juice.", "To serve, divide the parathas among four serving plates. Spoon the prawns in coconut alongside. Garnish with the chopped coriander and lime wedges."]}, {"isVegetarian": false, "title": "Kerala prawns", "url": "www_bbc_co_uk_food_recipes_keralaprawns_92902", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2 tsp mustard seeds", "20 fresh curry leaves", "4 pinches asafoetida", "4 tsp ground cumin", "1 tsp ground turmeric", "1 tsp fenugreek seeds", "2 tbsp ready-made tamarind paste", "4 fresh green chillies, finely diced", "4 tsp chopped fresh root ginger", "2 onions, peeled, finely chopped", "4 garlic cloves, peeled, finely diced", "1kg/2lb 2oz large tiger prawns, heads and shells removed, de-veined", "110g/4oz fresh coconut, shell removed, finely sliced", "2 limes, juice only", "4 tbsp chopped fresh coriander leaves", "salt and freshly ground black pepper", "250g/9oz shortgrain rice, steamed according to packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Kerala prawns, heat a large wok over a high heat. When the wok is hot, add the oil and heat until just smoking.", "Add the mustard seeds and curry leaves and stir-fry for 2-3 minutes, or until the seeds start to pop. (CAUTION: Popping seeds can be dangerous. Cover the pan with a lid and keep the pan well away from the eyes and face.)", "Add the spices and stir well. Continue to fry for a further minute, then add the tamarind paste, chillies and ginger and stir-fry for a 1-2 minutes.", "Add the onion and fry until pale golden-brown, about 2-3 minutes.", "Add the garlic and stir-fry for a further 20 seconds.", "Add the prawns, stir well to coat them in the spice mixture, then continue to stir-fry for a further 4-5 minutes, or until the prawns are cooked through. (NB: The prawns are cooked through when the flesh is pink.)", "Stir in the sliced coconut, lime juice and coriander leaves until well combined, then season, to taste, with salt and freshly ground black pepper. Heat through for one minute.", "To serve, divide the Kerala prawns equally among four serving plates. Spoon the steamed rice alongside."]}, {"isVegetarian": true, "title": "Key lime and elderflower pie", "url": "www_bbc_co_uk_food_recipes_key_lime_and_elderflower_59661", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/key_lime_and_elderflower_59661_16x9.jpg", "ingredients": ["175g/6oz digestive biscuits (or ginger biscuits)", "80g/3oz butter, melted", "50g/2oz caster sugar", "1 x 400g/14oz tin condensed milk", "100ml/3½fl oz freshly squeezed lime juice (about 3 limes)", "1 lime, zest only, finely grated ", "75ml/2½fl oz elderflower cordial (one that has a 1 to 10 dilution ratio)", "3 free-range egg yolks", "200ml/7fl oz double cream", "icing sugar, to taste", "mint sprigs, for garnish"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the biscuit base, finely crush the biscuits by placing into a sealed plastic bag and bashing with a rolling pin (alternatively, pulse to crumbs using a food processor). Transfer to a mixing bowl and add the sugar, stirring well to combine.", "Pour the melted butter over the biscuit crumbs and mix until thoroughly combined. Place the crumb mixture in a 23cm/9in springform cake tin, and press into the tin evenly with your fingers. Build up the sides of the crust to a height of about 4cm/1½in. Place in the fridge for 20 minutes, or until firm. ", "Preheat the oven to 170C/325F/Gas 3.", "For the filling, in a large mixing bowl whisk together the condensed milk with the lime juice, lime zest, elderflower cordial, egg yolks and half the cream until the mixture thickens.", "Pour mixture into the pie crust, give the tin a little shake to level the top and bake for 15-20 minutes. The pie is ready when the filling has a slight wobble. ", "Set aside to cool for half an hour in the baking tin, then chill the pie in a refrigerator for as long as possible. ", "When ready to serve, whip the remaining cream with icing sugar, to taste. Be careful not to overwhip it; the cream should remain soft and billowy.  Spoon the whipped cream onto the top of the pie. ", "Serve in slices with a few mint leaves for garnish."]}, {"isVegetarian": false, "title": "Karelian hotpot", "url": "www_bbc_co_uk_food_recipes_keralian_hotpot_28584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil or lard", "300g/10½oz pork, preferably pork shoulder, diced", "300g/10½oz stewing beef, diced", "300g/10½oz lamb or mutton, preferably shoulder or neck fillet, diced", "2 onions, sliced", "2 carrots, cut into chunks (optional)", "2 tsp black peppercorns", "1 tsp allspice berries (optional)", "3 bay leaves (optional)", "salt and freshly ground pepper", "mashed potato", "lingonberry jam"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2. ", "Heat the oil in a large frying pan. Brown all the meat thoroughly, in batches if necessary.", "Put a layer of meat at the bottom of a large casserole dish. Sprinkle over a layer of onions and carrots (if using). Sprinkle over the some of the black peppercorns, and the allspice berries and bay leaves (if using). Season with salt. Continue with these layers, remembering to season with salt and pepper, until you have used up all of the ingredients.", "Add enough cold water to almost cover the top layer of ingredients. Bring to the boil and then put in the oven. Cook for at least 2 hours, preferably longer – this can easily cook for up to 6 hours. Check regularly to see whether the meat is tender.", "Serve with mashed potato and lingonberry jam."]}, {"isVegetarian": true, "title": "Key lime pie", "url": "www_bbc_co_uk_food_recipes_keylimepie_5493", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/12oz plain or sweetmeal digestive biscuits, crushed", "150g/5oz unsalted butter", "grated zest and juice of 8 large limes", "570ml/1 pint double cream", "1 x 397g/14oz can sweetened condensed milk", "crystalised lime zest, to decorate"], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a small pan and stir in the crushed biscuits. Lightly press into the base of a 23cm/9in deep loosed-bottomed fluted flan tin. Chill whilst preparing the filling.", "To prepare the filling: place the lime juice into a large bowl, add the cream and condensed milk. Whisk for 1-2 minutes. Add the lime zest and lightly stir. Pour onto the prepared biscuit base. Place onto a tray and chill in the fridge for 1-2 hours.", "Decorate with crystalized lime zest and serve. "]}, {"isVegetarian": true, "title": "Key lime pie", "url": "www_bbc_co_uk_food_recipes_keylimepie_93185", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/keylimepie_93185_16x9.jpg", "ingredients": ["175g/6oz digestive biscuits", "80g/3oz butter", "50g/2oz caster sugar", "3 large free-range eggs, separated", "2 limes, finely grated zest", "125ml/4½fl oz lime juice", "210ml/7½fl oz condensed milk ", "80g/3oz caster sugar", "½ tsp vanilla extract", "pinch salt", "½ tsp cream of tartar", "handful fresh blueberries", "whipped cream"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pastry base, finely crush the biscuits by placing into a plastic bag and bashing with a rolling pin (alternatively, pulse to crumbs using a food processor). Transfer to a mixing bowl. ", "Melt the butter in a saucepan, then pour over the biscuit crumbs. Add the sugar, then mix well to combine. Evenly spread the biscuit mixture in a 23cm/9in pie case, making sure to cover the sides of the tin as well. Level off any excess biscuit mixture. ", "For the filling, whisk the egg yolks in a bowl until pale and fluffy. In a separate bowl, whisk together the lime zest, lime juice and condensed milk until smooth and creamy, then mix into the egg yolk mixture. Pour the mixture into the pie case. ", "In a clean bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl. Gradually fold in the sugar, vanilla extract, salt and cream of tartar, then whisk again until stiff peaks form. Spoon the meringue mixture over the filling in the pie case, using a fork to form the meringue into peaks. ", "Bake the pie in the oven for 15-20 minutes, or until the meringue is golden-brown. Remove from the oven and allow to cool. Place into the fridge to chill completely before serving. ", "To serve, cut slices of the key lime pie and serve with a scattering of blueberries and a few spoonfuls of whipped cream."]}, {"isVegetarian": false, "title": "Kharu pork with deep-fried potatoes and salad", "url": "www_bbc_co_uk_food_recipes_kharuporkwithdeepfri_91726", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower oil", "2 x 2.5cm/1in pieces cinnamon sticks ", "3-4 cardamom pods", "2-3 cloves", "2-3 whole dried red chillies, broken into pieces", "250g/9oz pork shoulder, cut into 1.5cm/0.5in pieces", "250g/9oz pork belly, cut into 1.5cm/0.5in pieces", "2 onions, peeled, finely chopped into 1.5cm/0.5in pieces ", "1 heaped tbsp ginger garlic paste, from a jar, or crush fresh ginger and garlic together to form a paste", "2 tsp ground cumin", "1 tbsp ground coriander", "½ tsp ground turmeric", "500-750ml/17½fl oz-1 pint 7fl oz chicken stock or water", "2 tomatoes, roughly chopped", "salt and freshly ground black pepper", "2 tbsp chopped fresh coriander leaves", "2-3 large potatoes, peeled and cut into four lengthways", "vegetable oil, for deep-frying", "salt, to taste", "2 tomatoes, cut into chunks", "4 spring onions, sliced", "½ cucumber, seeds removed, finely chopped", "2 fresh green chillies, finely chopped", "3 tbsp chopped fresh mint leaves", "3 tbsp chopped fresh coriander leaves", "1 lime, juice only", "1 tbsp malt vinegar", "½ tsp salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pork, heat the oil in a heavy casserole until smoking. Add the cinnamon sticks, cardamom pods, cloves and dried chillies to the casserole and gently fry until aromatic and starting to turn golden-brown (keep moving the spices around the casserole to prevent them from burning). ", "Add the pork shoulder and belly pieces to the casserole and fry for 1-2 minutes on all sides, or until golden-brown all over. Remove the pork from the casserole and set aside. ", "Add the chopped onions to the casserole and fry for 4-5 minutes, or until the onions are golden-brown. Return the pork to the pan and cook for a further 3-4 minutes, or until the casserole is quite dry, then stir in the ginger and garlic paste. ", "Mix the ground cumin, coriander and turmeric with a little of the stock or water to form a paste, then add to the pan and stir well. Cook for 2-3 minutes, or until the paste nearly dries up and bubbles of oil appear along the edges of the casserole. Pour in enough of the stock or water to cover the meat.", "Bring to a simmer, cover with a lid and cook for 30-35 minutes, or until the pork is tender. Add the chopped tomatoes and season, to taste, with salt and freshly ground black pepper. ", "Cook for a further 4-5 minutes, then add the chopped coriander and simmer for another 1-2 minutes. Keep warm. ", "For the potatoes, place the potatoes into a pan of salted water and bring to the boil. Reduce the heat to a simmer and cook for 8-10 minutes, or until tender. Drain, then return the potatoes to the pan and cook over a low heat to drive off any excess liquid.", "Half-fill a deep, heavy-based pan with the oil and heat until the temperature is 190C/375F (check using a digital thermometer), or use a deep-fat fryer. (NB: hot oil can be dangerous. Do not leave unattended.) Carefully lower the potato pieces into the oil and fry for 3-4 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Season the potatoes with salt. ", "For the salad, place the tomatoes, spring onions, cucumber, chillies, mint and coriander leaves into a large bowl and toss to combine. ", "In a small bowl, whisk together the lime juice, vinegar and salt until well combined, then drizzle over the salad. Gently mix until the salad is evenly coated with the dressing. ", "To serve, divide the potatoes and pork equally among four serving plates and serve the salad in a bowl alongside."]}, {"isVegetarian": true, "title": "Kheer", "url": "www_bbc_co_uk_food_recipes_kheer_71573", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kheer_71573_16x9.jpg", "ingredients": ["75g/2½oz basmati rice, washed", "1 litre/1¾ pints whole milk", "8 cardamom pods (or 1 tsp ground cardamom), lightly crushed", "50g/1¾oz slivered almonds", "75g/2½oz sultanas ", "2 tbsp caster sugar ", "handful pistachios, chopped, to decorate ", "gold leaf, to decorate (optional)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Tip the rice into a large saucepan and toast over a low heat for a few minutes.", "Stir in the milk, cardamom and almonds. Bring to a simmer and cook, uncovered, for 40 minutes.", "Stir in the sultanas and simmer for 15–20 minutes, or until the liquid has reduced by half and the mixture has thickened. ", "Stir in the sugar, to taste, remove from the heat and allow to cool. ", "Pour into a large bowl, cover with cling film and chill in the fridge for 1–2 hours, or overnight. Pick out the cardamom pods. ", "Serve in four bowls decorated with crushed pistachios and gold leaf (if using)."]}, {"isVegetarian": true, "title": "Vegan kibbe", "url": "www_bbc_co_uk_food_recipes_kibbe_2406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz bulgar wheat, soaked overnight in 570ml/1 pint water", "150ml/5fl oz water", "¼ tsp salt", "55g/2oz rolled oats", "2 garlic cloves, minced", "2 tbsp olive oil", "1 onion, chopped", "55g/2oz pimentos, chopped", "1 celery stick, finely chopped", "½ tsp dried sage,", "½ tsp dried oregano", "½ tsp dried thyme", "2 tbsp chopped fresh parsley"], "serves": "4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Bring 150ml/5fl oz water to the boil, add the salt and stir. Then add the oats and reduce the heat.", "Cover and simmer for 15-20 minutes, then remove from the heat and put into a bowl.  Preheat the oven to 180C/350F/Gas 4.", "Add the bulgar wheat and any water remaining from soaking to the bowl.", "Heat the olive oil in a frying pay, and saute the garlic, add the onions and pimentos and cook until soft.", "Put into a bowl along with the remaining ingredients. Season to taste, mix well and put in a greased baking dish.  Bake 1 hour."]}, {"isVegetarian": false, "title": "Kidneys in mustard sauce on toast", "url": "www_bbc_co_uk_food_recipes_kidneysinmustardsauc_85242", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lamb kidneys, membranes removed, sliced in half and core removed", "salt and freshly ground black pepper", "1 tsp olive oil", "1 tsp butter", "4 tbsp double cream", "2 tsp Dijon mustard", "salt and freshly ground black pepper", "small handful fresh chives, chopped", "1 slice bread, toasted, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the kidneys, season the kidneys with salt and freshly ground black pepper. Heat the oil and butter in a frying pan over a medium heat and fry the kidneys for 5-6 minutes, turning occasionally, until golden-brown on all sides and cooked through.", "For the sauce, place the cream into a small saucepan and bring to the boil. Reduce the heat, stir in the mustard and simmer until thickened. Season with salt and freshly ground black pepper and stir in the chopped chives.", "To serve, place a piece of toast onto a plate, top with the kidneys and pour over the sauce."]}]