[{"ingredients": ["1 gran faisán, desplumado y limpiado", "50 g / 1¾oz de avellanas peladas y tostadas, más extra para decorar", "115g / 4oz de mantequilla salada", "1 diente de ajo, pelado", "Harina normal de 25g / 1oz", "2 huevos, golpeados", "50g / 1¾oz de panko breadcrumbs", "2 cucharadas de aceite de colza", "Pancetta o panceta ahumada de 115 g / 4 oz, en una sola pieza con la piel puesta", "1 granizo, pelado y cortado en dados de 2cm / ¾in", "1 litro / 1¾ pinta de caldo de pollo blanco", "1 repollo Savoy pequeño, hojas externas retiradas y retenidas, cuartos internos", "1 salchicha de Toulouse", "1 cabeza de ajo", "½ manojo de tomillo fresco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Quita las piernas y los senos de la carcasa del faisán y deséchalos, descartando la piel.", "Corta la carne del muslo y los nervios lejos del hueso del muslo y deséchalo. Limpie el hueso hacia abajo, voltee la pierna y corte el hueso del muslo. Te quedarás con un muslo sin hueso unido a un hueso de baqueta.", "Para hacer la mantequilla de ajo, coloque las avellanas, 50 g / 1¾ oz de la mantequilla y el diente de ajo en un procesador de alimentos y mezcle.", "Haga una pequeña incisión en la parte inferior del pecho y rellene con la mantequilla de ajo, sazone bien con sal y pimienta negra recién molida y luego coloque el mini filete sobre la parte superior de la incisión para sellar.", "Coloque la pierna en la parte superior con el hueso hacia el extremo más delgado del seno.", "Pase con cuidado el faisán Kievs a través de la harina, luego los huevos y luego las migas de pan. Caliente el aceite de colza en una sartén a prueba de horno, fríe con cuidado los Kievs hasta que estén ligeramente coloreados en un lado y luego transfiéralos al horno durante 12-15 minutos.", "Retire la piel de la panceta y déjela a un lado, luego corte en rodajas gruesas la panceta.", "Mientras tanto, coloque el colinabo, la piel de panceta, 500 ml / 18 fl oz del caldo de pollo y la mantequilla restante en una sartén, sazone ligeramente y deje que hierva. Cocine a fuego lento durante 25-30 minutos y deje enfriar un poco.", "Cuela, descartando el caldo y la piel de panceta, luego devuelve el colinabo a la sartén y machaca bien.", "Coloque el repollo cuarteado en un plato a prueba de horno, coloque en capas la salchicha de Toulouse y la panceta, agregue la cabeza de ajo, el tomillo fresco y sazone bien con sal y pimienta negra recién molida.", "Vierta 500ml / 18fl oz del caldo de pollo en la parte superior y cúbralo con las hojas externas de col. Cubra con una tapa bien ajustada o papel de aluminio y deje que hierva, luego colóquelo en el horno por 45 minutos.", "Para servir, esculpe la salchicha en rodajas gruesas y colóquela en el plato con un pedazo de panceta. Coloca un trozo de repollo a un lado y luego coloca un poco de nabo al lado. Coloque el Kiev cocido encima y unas cuantas avellanas trituradas alrededor."], "url": "www_bbc_co_uk_food_recipes_pheaseant_kiev_crushed_76083", "title": "Faisán Kiev, colinabo triturado, mantequilla de avellana y repollo ahumado y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "3 higos, cortados a la mitad", "100 g / 3½ oz de hojaldre con mantequilla", "300g / 10½oz de higos negros o verdes maduros, enteros", "25g / 1oz de mantequilla, más extra para terminar", "2 cucharadas de puerto", "sal y pimienta negra recién molida", "2 coronas de faisán", "500ml / 18fl oz de caldo de pollo", "2 ramitas de tomillo", "2 dientes de ajo, aplastados", "2 cucharadas de aceite de oliva", "2 cucharadas de mantequilla sin sal", "½ cabeza de col rizada", "2 cucharadas de mantequilla sin sal", "200g / 7oz de setas silvestres mezcladas, como girolles, níscalos y trompetas", "salsa"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la tarta de higo, coloca el azúcar en una sartén y deja que hierva. Cocine hasta que el azúcar se derrita y un color caramelo profundo. (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Manipúlelo con cuidado. Use una sartén profunda para evitar burbujear).", "Con cuidado, vierte el caramelo en dos agujeros de un molde de muffin de silicona y coloca el lado cortado de higos en los agujeros. Estirar la masa a 1cm / ½ pulgada de espesor. Recorta los círculos que son un poco más grandes que los agujeros para muffins. Coloque la masa sobre la parte superior de los higos y meta los lados. Hornee por 10-15 minutos hasta que estén doradas.", "Para el puré de higos, corte los higos por la mitad y saque la carne. Calentar la mantequilla en una sartén hasta hacer espuma y agregar la carne de higo. Agregue el puerto y cocine durante 10-15 minutos. Transfiera a una licuadora y mezcle hasta que quede suave, luego pase a través de un colador. Termine con un poco más de mantequilla y sazone con sal y pimienta. Apartar y mantener caliente.", "Retire las tartas de higos del horno y deje reposar antes de servir. Mantenga el horno encendido para el faisán.", "Coloque las coronas de faisán en una olla y agregue el caldo, el tomillo y el ajo. Escurrir durante 6-8 minutos, luego escurrir. Calentar una sartén y agregar el aceite y la mantequilla. Agregue las coronas a la sartén y fría hasta que se doren por completo, luego transfiéralas al horno durante 2-3 minutos, o hasta que estén bien cocidas.", "Para los champiñones y la col rizada, ponga a hervir una cacerola grande de agua y blanquee la col rizada durante 1-2 minutos. Escurrir y apartar. Caliente una sartén grande y agregue la mantequilla. Cuando haga espuma, agregue los champiñones y fríalos durante 1-2 minutos antes de agregar la col rizada. Revuelva bien y sazone con sal y pimienta.", "Coloque un poco de puré de higo en platos para servir y cubra con las coronas de faisán. Coloque las tartas de higos al costado y adorne con los champiñones y la col rizada. Vierta un poco de salsa y sirva."], "url": "www_bbc_co_uk_food_recipes_phesant_with_mushroom_41689", "title": "Faisán con setas, col rizada e higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450g / 1lb de carne de faisán picada", "50 g / 1¾oz de avena", "8g de sal", "8g de pimienta blanca", "6 ramitas de tomillo, hojas recogidas y picadas", "4 hojas de salvia picadas", "1 huevo de gallinas camperas", "1 plato de vino blanco", "1 paquete de cuadrados de pasteles wonton", "1 cucharada de harina de maíz mezclada con agua fría para hacer una pasta fina", "250g / 9oz de mantequilla", "2 kabocha o calabaza bellota, pelada y picada en cubos pequeños", "1 chalote de plátano grande, picado", "1 diente de ajo, picado", "pizca de cayena", "500ml / 18fl oz de agua o caldo de verduras", "1 naranja, ralladura fina y jugo", "100 g / 3½ oz de semillas de calabaza", "Aceite de semilla virgen de calabaza 100ml / 3½fl oz", "1 naranja"], "method": ["Para las albóndigas, mezcle todos los ingredientes, excepto la masa y la harina de maíz. Enrolle la mezcla en bolas que pesen aproximadamente 35 g / 1¼ oz cada una.", "Coloque una hoja de pasta wonton en un tablero y cepille con la mezcla de harina de maíz. Coloque una bola de faisán en la parte superior y coloque otra hoja de hojaldre en la parte superior. Presione hacia abajo para sellar y pegar. Cortar alrededor de la mezcla de faisán con un cortador de pasteles para comer la bola de masa. Continúa este proceso hasta que hayas usado todas las bolas de faisán. Descanse las albóndigas en la nevera durante al menos una hora.", "Para el caldo, caliente la mitad de la mantequilla en una cacerola grande. Fríe muy suavemente la calabaza, los chalotes y el ajo hasta que se suavicen, pero no se coloreen (esto tomará alrededor de 20-30 minutos).", "Agregue la pimienta de cayena, el caldo o el agua, la mantequilla restante y un poco de sal y cocine durante unos 10 minutos a fuego medio hasta que estén tiernos. Agregue la ralladura de naranja y el jugo. Vierta en una licuadora, blitz y pase a través de un tamiz fino. Condimentar con sal y pimienta.", "Cueza al vapor las albóndigas en un vaporizador o en un colador sobre una olla de agua hirviendo durante aproximadamente 7-8 minutos, o hasta que el relleno esté cocido y lea 65C en un termómetro para cocinar.", "Mientras tanto, tuesta las semillas de calabaza en una sartén hasta que estén fragantes.", "Divida las albóndigas entre cuencos profundos y anchos y una cuchara sobre el caldo de calabaza. Adorne con las semillas tostadas y el aceite de semilla de calabaza. Rallar un poco de ralladura de naranja y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_phesant_dumplings_with_85842", "title": "Albóndigas de faisán con caldo de calabaza y aceite de calabaza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto aumento de 450g / 1lb", "60g / 2¼oz de coco desecado", "400 g / 14 oz de azúcar en polvo", "Margarina 400 g / 14 oz, más extra para engrasar", "7 huevos de gallinas camperas", "50ml / 2fl de leche en oz", "200g / 7oz de mantequilla, suavizada", "Azúcar glas de 400g / 14oz, tamizado", "2-3 cucharadas de ron con sabor a coco, como Malibu"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Para la torta de Madeira, engrase y forme una lata redonda de 20 cm / 8 pulgadas o de 23 cm / 9 pulgadas con papel de margarina y grasa.", "Coloque todos los ingredientes de la torta en un tazón grande. Usando un mezclador de manos eléctrico, junte todos los ingredientes en la configuración más lenta.", "Una vez que los ingredientes se combinan, aumente la velocidad y mezcle por un minuto.", "Coloque la mezcla en la lata preparada y alise la parte superior para nivelarla.", "Hornee en el medio del horno durante una hora, de 45 minutos a dos horas. La torta debe ser elástica al tacto y de color dorado.", "Dejar enfriar en la lata durante cinco minutos, retirar y transferir a una rejilla de alambre.", "Para la crema de mantequilla, bata la mantequilla en un bol hasta que esté suave. Poco a poco agregue el azúcar glas y mezcle hasta que se incorpore. Agregue el ron con sabor a coco.", "Corta la torta enfriada horizontalmente para crear tres capas. Sandwich estos junto con la crema de mantequilla. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_pia_colada_madeira_cake_39645", "title": "Piña colada Madeira cake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de cebolla en escabeche, florines de coliflor pelados y pepino sin semilla y judías verdes con cola y cola", "340g / 12oz de sal de roca gruesa", "Vinagre de malta blanca 750ml / 1¼ pinta", "1 cucharada de cada mostaza en polvo inglesa, jengibre molido y cúrcuma molida", "1 cucharada de semillas de mostaza amarillas enteras", "2 dientes de ajo picados", "175g / 6oz de azúcar mascabado ligero", "2-3 cucharadas de harina de maíz", "caliente grandes frascos de mermelada esterilizados con tapas de rosca - prepare los frascos lavándolos en agua caliente con jabón y dejándolos secar y calentar en un horno frío - 130 ºC / 250 F / Gas ½ por 10 a 15 minutos."], "method": ["Coloque las verduras en un recipiente no metálico. Espolvoree la sal sobre la parte superior, mezcle, cubra y deje en un lugar fresco durante 12 horas.", "Al día siguiente, coloque el vinagre en una cacerola grande o en una cacerola, agregue las especias y deje que hierva.", "Drene las verduras y enjuáguelas bien con agua corriente durante 3-5 minutos. Agregue al vinagre a fuego lento, cocine a fuego lento durante 20-25 minutos o hasta que los vegetales estén tiernos. Agregue el azúcar y continúe cocinando a fuego lento durante 1-2 minutos más.", "Mezcle 2 cucharadas de harina de maíz con un poco de agua y mezcle con las verduras calientes. Volver a hervir y cocinar por un minuto más, la mezcla debe ser brillante y espesa. Agregue la harina de maíz restante de la misma manera si es necesario.", "Retire los piccalilli del fuego y déjelos enfriar durante 15 minutos. Coloque una cuchara en los frascos calientes y cubra con un disco de papel encerado y una tapa con tapa de rosca, limpie los frascos y la etiqueta. Almacene en un lugar fresco y oscuro durante 3-4 semanas antes de comer."], "url": "www_bbc_co_uk_food_recipes_piccalilli_13702", "title": "Piccalilli", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace tarros de 3-4 x 450 g / 1 lb", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/piccalilli_13702_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de cebollas pequeñas en escabeche, peladas", "Florecillas de coliflor de 450 g / 1 libra", "Frijoles de 450 g / 1 lb, recortados y finamente cortados", "450g / 1lb de pepino, sin semillas y cortado en dados de 1cm / ½in", "450 g / 1 libra de calabaza, pelada, sin semillas y cortada en dados de 1 cm / ½ pulgadas", "450 g / 1 libra de calabacín o tuétano, cortado en dados de 1 cm / ½ pulgadas", "450g / 1lb de sal", "30 g / 1 oz de mostaza", "30g / 1 oz de jengibre molido", "30 g / 1 onza de curry en polvo - suave o caliente según el gusto", "15g / ½ oz de cúrcuma molida", "30 g / 1 oz de pimienta negra", "1l / 1¾pt de vinagre de malta", "30g / 1 oz de harina de maíz"], "method": ["Coloque todas las verduras en un tazón grande y mezcle con la sal. Cubra y deje toda la noche.", "Escurra y enjuague las verduras con agua corriente fría. Seco.", "Ponga ¾ del vinagre en una sartén grande y agregue las especias y verduras. Llevar a ebullición y cocine a fuego lento hasta que esté tierno.", "Mezcle la harina de maíz con el resto del vinagre y agregue a la sartén. Mezcle y cocine a fuego lento durante 5 minutos.", "Convierta en frascos esterilizados calientes, sellados y frescos.", "Almacene por tres meses en un armario fresco y oscuro antes de comer."], "url": "www_bbc_co_uk_food_recipes_piccalilli_7718", "title": "Piccalilli con especias de curry", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "6-8 frascos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de pan blanco 375g / 13oz", "1 cucharada de aceite de oliva", "pizca de sal fina", "325g / 11½ oz de mantequilla", "4 cucharadas de pimienta negra recién molida", "200 g / 7 oz de queso parmesano (u otro queso duro vegetariano), finamente rallado", "1 cucharadita de jugo de limón", "½ pomelo rosado, segmentado, cada segmento reducido a la mitad", "3 puñados de lechuga de cordero", "salpicar vinagre de vino tinto", "salpicar aceite de oliva", "4 cucharaditas de queso ricota salado, rallado grueso", "sal"], "method": ["Para hacer la masa de pasta, agregue la harina a un recipiente para mezclar y haga un pozo en el medio. Mezcle el aceite de oliva, la sal y 185ml / 6fl oz de agua fría y vierta en el centro de la harina. Comience a incorporar la harina en el líquido hasta que la masa comience a formarse. Convierta la masa en una superficie limpia y amasar hasta que quede suave. Forme la masa en un rectángulo, envuélvala en una película adhesiva y déjela reposar en un lugar fresco durante al menos 30 minutos.", "Para hacer el pici, corte la masa en tiras de 15 g / ½ oz (pese una para verificar y use como guía) y manténgala cubierta con una toalla de té húmeda.", "En una superficie de trabajo limpia y seca, comience a hacer rodar cada tira hacia afuera, con ambas palmas de las manos, aplicando la presión de manera uniforme y empujando hacia afuera, hasta que tenga un fideo del mismo grosor que un biro. Repita hasta que se agote toda la masa.", "Para hacer el pici cacio e pepe, ponga a hervir una cacerola grande de agua muy salada. Cocine el pici durante 5-6 minutos.", "Mientras tanto, coloca una cacerola a fuego medio. Agregue la mantequilla, pimienta negra y un poco de agua de cocción pici. Baje a fuego lento y cocine hasta que se emulsione.", "Cuando la pasta esté cocida, use pinzas para transferirla del agua a la mantequilla emulsionada, reservando el agua de la pasta.", "Agregue el queso parmesano y, sin remover, deje que se asiente y se derrita del calor residual de la sartén (esto evita que se convierta en bolas poco caseosas y masticables).", "Coloque el pomelo, la lechuga de cordero, el vinagre de vino tinto y el aceite de oliva en un recipiente para mezclar y mezcle. Sazonar con una pizca de sal. Distribuya uniformemente entre cuatro platos y espolvoree la ricota salada en la parte superior.", "Una vez que el parmesano se haya derretido en el pici, mezcle la salsa y la pasta para incorporar. Sazonar con sal si es necesario y servir inmediatamente junto con el pomelo rosado y la ensalada de ricotta."], "url": "www_bbc_co_uk_food_recipes_pici_cacio_e_pepe_16342", "title": "Queso Pici y pimienta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Espinaca 200 g / 7 oz, bien lavada", "300-350 g / 10½-12oz de harina italiana '00' (harina blanca fuerte)", "1 cucharada de aceite de oliva, más extra", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "Carne picada 300 g / 10½ oz", "300 g / 10½ onzas de carne de cerdo picada", "100g / 3½oz de pan rallado blanco", "50ml / 2fl oz de crema agria o crème fraîche", "2 cucharaditas de pimentón dulce ahumado", "1 cucharadita de pimentón ahumado en caliente (o al gusto)", "1 cucharadita de orégano seco", "2 cucharadas de perejil finamente picado", "1 huevo de gallinas camperas", "sal y pimienta negra recién molida", "400g / 14oz de tomates cherry, cortados a la mitad", "sal al gusto", "ramita de tomillo, solo hojas", "2 dientes de ajo, en rodajas finas", "2-3 cucharadas de aceite de oliva", "hojas frescas de albahaca", "parmesano rallado"], "method": ["Para hacer la pasta, sacuda el exceso de agua de la espinaca y colóquela en un procesador de alimentos con 300 g / 10½ oz de la harina. Mezcle hasta que la espinaca se haya descompuesto completamente y forme una masa. Es posible que deba empujar todo por los lados una o dos veces. Compruebe la masa, si es muy pegajosa (esto dependerá de qué tan húmeda esté la espinaca), agregue más harina. La mejor textura es suave y muy ligeramente pegajosa.", "Estirar la pasta. Haz esto sacando pequeñas bolas (del tamaño de una gran canica). Comience rodando entre sus manos y luego recostándose en una superficie de trabajo y rodando ligeramente con ambas manos, moviéndose desde el centro hacia afuera. Si está muy pegajoso, empolva tus manos con un poco de harina, pero trata de no utilizar demasiado ya que hace que la pasta sea mucho más difícil de rodar, se deslizará lejos de ti.", "La pasta se puede cocinar de inmediato, en una olla grande de agua salada hirviendo, o se puede secar. Si está cocinando en fresco, tomará cinco minutos; si está seco, tomará de 8 a 10 minutos.", "Para las albóndigas, caliente el aceite de oliva en una sartén y agregue la cebolla. Cocine a fuego medio a bajo hasta que esté muy suave y translúcido, luego agregue el ajo y continúe cocinando por uno o dos minutos más. Retirar del fuego y dejar enfriar.", "Coloque la carne de res y cerdo en un tazón grande con migas de pan, crema agria (o crema fresca), dos tipos de pimentón, hierbas y huevo. Agregue la cebolla y el ajo y condimente generosamente. Mezcle bien.", "Tome una pequeña cantidad de la mezcla y frítela. Cuando esté cocido, pruebe el condimento y ajústelo en consecuencia: la mezcla de albóndiga a menudo necesita más sal de lo que cree. Forme la mezcla en 20 bolas.", "Para cocinar, precaliente el horno a 200C / 180C Fan / Gas 6 y hornee durante 18-20 minutos, voltéelos hasta la mitad, hasta que estén dorados y calientes en el centro. O caliente un poco de aceite en una sartén grande y cocínelos en dos tandas, volteándolas regularmente.", "Para los tomates asados, coloque los tomates en una lata de asar o en un plato de horno de cerámica, con el lado cortado hacia arriba. Espolvorear con sal, hojas de tomillo, ajo y aceite de oliva, luego asar durante unos 10 minutos, o hasta que esté bien ablandado y ligeramente dorado alrededor de los bordes.", "Sirva las albóndigas y los tomates con todos los jugos de la bandeja sobre la pasta, adornada con abundante albahaca y parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_pici_verde_with_roast_30260", "title": "Pici verde con tomates asados ​​y albóndigas de pimentón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina fuerte, más extra para espolvorear", "pizca de sal", "1 huevo grande de gallinas camperas", "125ml / 4½floz de agua", "6 cucharadas de aceite de oliva virgen extra, más extra a llovizna", "2 dientes grandes de ajo, finamente picados", "200g / 7oz rancio, pan rallado blanco seco", "1 cucharadita de sal, más extra para el gusto", "pizca de pimienta negra recién molida", "1 manojo de perejil de hojaldre, cortado y picado grueso", "100 g / 3½ oz de parmesano rallado (o una alternativa vegetariana), más extra para servir"], "method": ["Primero haga el pici fresco. Mezcle la harina y la sal en un tazón grande, luego vierta en una tabla de repostería u otra superficie de trabajo. Haz un pozo con tus dedos en el centro. Rompe el huevo en este pozo. Poco a poco mezcle la harina y el huevo, agregue agua un poco a la vez hasta que la masa esté firme pero flexible. Es posible que no necesite usar toda el agua.", "Amasar la masa hasta que se mezcle bien y vuelva a saltar al tacto.", "Espolvoree ligeramente un rodillo con harina y extienda la masa hasta que tenga aproximadamente ½-1cm / ¼-½ pulgada de grosor. Déjalo reposar durante 20 minutos.", "Corta la masa en tiras anchas de 1 cm / ½ pulgadas con un cuchillo afilado. Pase las tiras a mano en hebras gruesas parecidas a spaghetti. Estos deben ser de aproximadamente 3 mm / octava pulgada de ancho.", "Para cocinar el pici, ponga a hervir una cacerola grande de agua salada. Agregue el pici y cocine durante unos 10-12 minutos. El tiempo exacto de cocción dependerá del ancho de los cordones.", "Mientras tanto, prepara la salsa. Caliente el aceite de oliva en una olla grande. Agregue el ajo y déjelo saborizar el aceite. Agregue las migas de pan y la sal y la pimienta negra recién molida. Saltear durante 2-5 minutos, revolviendo frecuentemente, hasta que el pan rallado esté dorado", "Escurra el pici y agregue a la mezcla de migas de pan. Agregue el perejil y el parmesano y revuelva para mezclar.", "Divida la mezcla entre los cuencos de pasta individuales. Si lo desea, agregue parmesano rallado o aceite de oliva para servir."], "url": "www_bbc_co_uk_food_recipes_piciallebriciole_82363", "title": "pequeñito", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos grandes de gallinas camperas", "350ml / 12fl oz de vinagre de sidra", "1 cucharada de sal", "1 cucharada de azúcar", "1 cucharadita de hojuelas de chile o unos chiles secos (opcional)"], "method": ["Primero esterilice una jarra lo suficientemente grande como para contener los seis huevos. O páselo a través de la configuración más caliente en su lavavajillas, o lave con abundante agua caliente y jabón, enjuague bien, luego póngalo en un horno bajo para que se seque completamente.", "Ponga a hervir una olla con agua y luego baje suavemente los huevos. Hierva por 7 minutos exactamente, luego retírelo del fuego, cuele y corra con agua fría para evitar que se cocinen. Cuando estén lo suficientemente fríos para manipularlos, pélelos con cuidado.", "Ponga el vinagre de sidra en una olla con 150ml / 5fl oz de agua, sal y azúcar. Lentamente llevar a ebullición, revolviendo para disolver el azúcar, luego cocine a fuego lento durante 5 minutos. Si usa la guindilla, agregue esto en el último minuto.", "Empaque los huevos en el tarro, luego vierta sobre la mezcla de vinagre. Selle y deje que se enfríe por completo. Deje por lo menos 2 semanas antes de comer, preferiblemente un mes, luego guárdelo en el refrigerador una vez abierto."], "url": "www_bbc_co_uk_food_recipes_pickled_eggs_79282", "title": "huevos en escabeche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 6 huevos en vinagre", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pizcas grandes de semillas de cilantro", "120ml / 4fl oz de vinagre balsámico blanco", "120ml / 4fl oz de vinagre de vino blanco", "4 cucharadas de azúcar morena suave y ligera", "4 caballas enteras (aproximadamente 250 g / 9 oz cada una), fileteadas y ligeramente anotadas", "1 cucharada de escamas de sal marina, más extra para condimentar", "1 cebolla roja pequeña, finamente cortada", "2 ramitas de cilantro fresco, más 2 cucharadas de hojas de cilantro fresco picado", "1 diente de ajo", "300g / 10½oz de papas nuevas pequeñas, como Charlotte o Pink Fir Apple, fregadas", "1 cucharada de yogurt natural de estilo griego", "1 lima, ralladura fina y jugo", "8 rábanos grandes, en rodajas finas", "1 cebolla tierna cortada en diagonal", "pimienta negra recién molida", "2 cucharadas de mostaza Dijon", "2 cucharadas de vinagre balsámico blanco", "4 cucharadas de aceite de oliva o aceite de girasol", "4 cucharadas de aceite de oliva virgen extra o aceite de girasol", "2 yemas de huevo", "1 cucharada de mostaza francesa", "algunas gotas de jugo de limón", "150ml / 5fl oz aceite de girasol o aceite de semilla de uva"], "method": ["Para la ensalada, caliente una sartén a fuego medio. Agregue las semillas de cilantro y las tostadas durante 1 minuto, agitándolas de vez en cuando, hasta que estén aromáticas. Inclínalas en un plato y aplasta ligeramente con una cuchilla.", "Vierta ambos vinagres en una olla pequeña, agregue el azúcar y cocine a fuego medio durante 2-3 minutos, o hasta que el azúcar se disuelva, revolviendo ocasionalmente. Retirar del fuego y agregar las semillas de cilantro, luego dejar hasta que estén frías.", "Coloque los filetes de caballa en un plato poco profundo y no metálico, con la piel hacia abajo y espolvoree con sal. Vierta sobre la mezcla de vinagre y cubra con tres cuartas partes de la cebolla roja. Cubra con una película adhesiva y deje marinar en el refrigerador durante 6 horas, o hasta que esté encurtido, volteando el pescado hasta la mitad.", "Justo antes de que la caballa esté lista, llene una olla un tercio llena de agua, coloque un vaporizador en la parte superior y cocine a fuego lento. Coloque la cebolla roja restante, las ramitas de cilantro y el ajo en el agua. Coloque las papas en el cocedor al vapor, cubra y cocine durante 12-18 minutos, o hasta que estén tiernas. Apague el fuego y hágalos vapor en el calor residual por otros 5 minutos, luego déjelos enfriar.", "Para el aderezo francés, mezcle la mostaza de Dijon, el vinagre y 2 cucharadas de agua en un tazón pequeño. Batir en ambos aceites de oliva hasta que estén gruesos y brillantes. Condimentar con sal y pimienta.", "Para la mayonesa, bata las yemas de huevo y la mostaza francesa juntas en un tazón grande. Agregue unas gotas de jugo de limón y sazone con sal y pimienta. Rocíe el aceite poco a poco, batiendo continuamente con un batidor eléctrico de mano, hasta que se espese.", "Mezcle 3 cucharadas de aderezo francés, 2 cucharadas de mayonesa y el yogur en un tazón. Agregue la ralladura de limón y el jugo y sazone con sal y pimienta.", "Cortar las papas en rodajas de 5 mm / ¼ en rebanadas y ponerlas en una ensaladera grande. Agregue los rábanos y las hojas de cilantro picado, luego rocíe con el aderezo y mezcle suavemente. Dispersión sobre la cebolla de primavera. Levante la caballa del licor de decapado y colóquela en platos para servir. Esparcir sobre una cebolla roja encurtida y servir con la ensalada de papa."], "url": "www_bbc_co_uk_food_recipes_pickled_mackerel_with_47640", "title": "Caballa en escabeche con ensalada de papa y rábano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de caballa atrapada en línea, hueso en", "Sal marina de 25g / 1oz, más extra para rociar", "Vinagre de vino de arroz de 200ml / 7fl oz", "Aceite de colza virgen extra 300ml / 10 fl oz, más extra para llovizna", "50g / 1¾oz de vinagre chardonnay", "1 pan de masa fermentada", "16 tomates cherry, en la vid", "100g / 3½oz de mantequilla salada", "2 ramitas de tomillo", "4 tomates de herencia mixta, cortados en cuñas", "hinojo silvestre, preferiblemente inglés, solo propinas, para servir", "1 achicoria amarilla, para servir"], "method": ["Ligeramente sal el lado de la carne de los filetes de caballa y deje marinar durante aproximadamente 2 horas antes de usar.", "Coloque los filetes de caballa en una bandeja poco profunda, con la piel hacia abajo. Vierta sobre el vinagre de arroz hasta que esté a medio camino de la caballa. Deje reposar durante 2 minutos y luego retire cuidadosamente la membrana alrededor de la piel. Vuelva a colocar los filetes en el vinagre, con la carne hacia abajo durante otros 1-2 minutos. Retirar del vinagre y cortar cuidadosamente los huesos.", "Mezcle el aceite de 200 ml / 7 fl con el vinagre de chardonnay en un frasco pequeño. Coloque la caballa en un plato para servir y rocíe con la colza y el aderezo de vinagre.", "Precaliente el horno a 150 ° C / 170 ° Ventilador / Gas 2.", "Coloque las rebanadas de masa fermentada en las bandejas para hornear, rocíe con un poco de aceite y espolvoree con un poco de sal marina. Hornee por 3-4 minutos hasta que estén doradas. Dejar de lado.", "Blanquee los tomates cherry en agua hirviendo durante 10 segundos y retire cuidadosamente las pieles.", "Coloque la mitad de los tomates en una olla con la mantequilla, el tomillo y algunas de las vides y caliente muy suavemente durante un par de minutos.", "Coloque la otra mitad de los tomates en un tazón y vístelos con el aderezo de colza. Refrigere el aderezo restante para usar en otros platos.", "Sople las rebanadas de tomate hasta que estén caramelizadas y salpique con sal marina.", "Coloque la caballa entre 4 platos, coloque los tomates alrededor del pescado y termine con el samphire, la achicoria y la masa crujiente."], "url": "www_bbc_co_uk_food_recipes_pickled_mackerel_with_50047", "title": "Caballa en vinagre con tomates y masa madre", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de vinagre de vino blanco", "1 cucharadita de sal", "1 cucharadita de azúcar", "2 dientes de ajo", "aceite de oliva", "½ cucharadita de pimienta negra", "1 hoja de laurel", "1 kg / 2lb 4 oz de champiñones silvestres, limpios y toscamente picados"], "method": ["Coloque todos los ingredientes excepto los champiñones en una cacerola y agregue 500 ml / 18 fl oz de agua.", "Llevar a ebullición y agregar los champiñones. Cocine por 12-15 minutos o hasta que estén cocidos.", "Retire los champiñones de la sartén con una espumadera y déjelos a un lado para que se sequen sobre una toalla de té limpia durante 3-4 horas, o hasta que estén completamente secos.", "Vierta un poco de aceite de oliva en un frasco esterilizado de 1 litro / 1¾, agregue los champiñones, luego cubra con más aceite de oliva. Mezcle suavemente hasta que todos los hongos estén cubiertos con aceite de oliva. Cubra bien con una tapa esterilizada.", "Los hongos se mantendrán durante dos meses sin abrir. Use dentro de 3-4 días una vez abierto."], "url": "www_bbc_co_uk_food_recipes_pickled_mushrooms_45080", "title": "Setas en escabeche", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 x 1 litro / 1¾ pintas jar", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de oliva", "1 cucharadita de vinagre de vino blanco", "½ calabacín, cortado en tiras finas con un pelador de verduras", "½ cebolla roja, finamente rebanada", "sal y pimienta negra recién molida", "1 cucharadita de perejil fresco de flatleaf recién picado", "25 g / 1 oz de queso azul, desmenuzado"], "method": ["Coloque el aceite de oliva y el vinagre de vino blanco en un tazón grande y mezcle.", "Agregue las cintas de calabacín y la cebolla roja. Mezcle para cubrir el aderezo y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada en el centro de un plato y espolvoree sobre el perejil y el queso azul."], "url": "www_bbc_co_uk_food_recipes_pickledcourgetteandb_81263", "title": "Ensalada de calabacín y queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pepino entero, pelado", "1 cucharadita de sal", "60ml / 2fl oz de vinagre blanco", "50 g / 2 oz de azúcar", "Jengibre fresco de 7.5cm / 3in", "4 tallo de jengibre en almíbar de azúcar"], "method": ["Use un tenedor para correr a través de la superficie del pepino, verticalmente hacia abajo, para obtener un patrón estriado cuando se corta en rodajas.", "Corte el pepino en rodajas finas y colóquelo en un tazón grande, espolvoréelo con sal y mezcle bien. Deje el pepino por 10 minutos para absorber la sal y luego enjuague con agua fría. Drene el exceso de líquido en un colador. Regrese el pepino al tazón grande.", "Ralla el jengibre fresco de raíz. Cortar el tallo de jengibre en rodajas finas.", "Combina el azúcar, el vinagre y los dos tipos de jengibre juntos. Agregue a las rodajas de pepino y mezcle bien.", "Decantar en un recipiente de plástico. Refrigere durante la noche o por algunas horas antes de servir."], "url": "www_bbc_co_uk_food_recipes_pickledcucumber_11033", "title": "Pepinillos en vinagre", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pickledcucumber_11033_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "5 chalotes, en rodajas finas", "2 ramitas de tomillo fresco, solo hojas", "1 hoja de laurel", "2 dientes de ajo, pelados y triturados", "Jengibre de 2.5cm / 1in, pelado, finamente picado", "2 cucharaditas de granos de pimienta rosa, aplastados", "Vinagre de vino blanco 450ml / 16fl oz", "500g / 1lb 2oz de judías verdes, tapas cortadas", "Azúcar 75g / 3 oz", "4 papas para hornear", "8 lonchas de tocino rayado ahumado, cortado en tiras o lardons", "4 pequeños filetes de caballa ahumada, despellejados, deshuesados ​​y desmenuzados en escamas", "4 cucharadas de crema fresca", "sal y pimienta negra recién molida", "300 g de queso Taleggio, cortado en cuatro rebanadas iguales"], "method": ["Para los frijoles, coloque una olla de fondo grueso a fuego medio y agregue el aceite de oliva, chalotes, hojas de tomillo, laurel, ajo, jengibre y pimienta. Freír suavemente durante 2-3 minutos, hasta que los chalotes estén suaves pero no coloreados.", "Agregue el vinagre a la sartén y agite para combinar. Retirar del fuego y dejar enfriar.", "Mientras tanto, ponga a hervir un sartén de agua ligeramente salada y blanquee los frijoles durante dos minutos. Escurrir y refrescar los frijoles en agua fría.", "Coloque los frijoles en un tazón grande y espolvoree con el azúcar, revolviendo suavemente para cubrir. Vierta la mezcla de vinagre frío sobre los frijoles y reserve.", "Para las patatas de chaqueta, precaliente el horno a 200C / 400F / Gas 6.", "Perforar las papas horneadas varias veces con un cuchillo afilado, luego colocar en el horno para hornear durante una hora, o hasta que estén crujientes por fuera, pero tiernas cuando se perforan con un cuchillo. Retirar del horno y dejar enfriar un poco.", "Precalentar la parrilla a su configuración más alta.", "Mientras tanto, caliente una sartén hasta que esté caliente. Agregue las tiras de tocino y fría, revolviendo de vez en cuando durante 3-4 minutos hasta que estén doradas y crujientes. Retire el tocino de la grasa con una cuchara ranurada y déjelo a un lado para escurrir sobre papel de cocina.", "Cuando las papas estén frías, colóquelas en un tablero y córtelas en rodajas. Con una cuchara, retire toda la carne de papa de las pieles y coloque la carne en un recipiente limpio.", "Mash la carne de patata hasta que quede suave, luego agregue el tocino cocido, la caballa en copos y crème fraîche. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Con cuidado, coloque la mezcla de papa nuevamente en la piel de la papa y colóquela en una bandeja para hornear. Cubra cada patata con un trozo de Taleggio y colóquelo debajo de la parrilla para que se cocine hasta que el queso esté dorado y burbujeante.", "Para servir, coloque las patatas en cuatro platos y coloque una cucharada de frijoles encurtidos al lado."], "url": "www_bbc_co_uk_food_recipes_pickledfrenchbeanswi_85427", "title": "Judías en escabeche con caballa, tocino y chaqueta de patata Taleggio", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de vinagre de malta", "250ml / 9fl oz de vinagre de vino tinto", "5 cucharadas de azúcar en polvo de oro", "3 cucharadas de sal marina", "20 cerezas surtidas o tomates pequeños", "4 dientes de ajo", "2 ramitas grandes romero", "1 hoja de laurel", "1 cucharada de semillas de cilantro", "1 cucharada de pimienta negra"], "method": ["Para el líquido decapante, en una sartén ponga a hervir todos los ingredientes líquidos decapantes y déjelos hervir a fuego lento.", "Esterilice una jarra de decapado de 1 litro / 1¾ de pulgada con una tapa de rosca y la tapa en una olla grande de agua hirviendo que hierva durante al menos 10 minutos. (O use varios frascos más pequeños con tapas.) Levante los frascos de su baño de agua con un par de pinzas para jarras. Vacíe el agua.", "Alternativamente, pueden esterilizarse en un lavavajillas.", "Para el pepinillo, llene rápidamente los frascos con los tomates, hierbas y especias.", "Con una jarra o un embudo vierta el líquido decapado caliente en el frasco, vierta todo el camino hasta la parte superior y selle, asegurando que quede el menor aire posible en el frasco.", "El encurtido se mantendrá por hasta un año.", "Mantenga refrigerado una vez abierto y termine dentro de dos semanas."], "url": "www_bbc_co_uk_food_recipes_pickled_tomatoes_56805", "title": "Tomates encurtidos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 litro / 1¾ pinta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos en escabeche", "2 cucharadas de sal de apio", "60g / 2oz de harina natural, condimentada con sal y pimienta", "Salchichas Cumberland 600 g / 1lb 5oz, carne de salchicha quitada de las pieles", "Pan rallado pancho japonés de 100 g / 3½ oz", "Paquete de 1 x 30 g de queso y cebolla frita, aplastado", "2 huevos de gallinas camperas, golpeados", "aceite vegetal, para freír"], "method": ["Tome un huevo en escabeche y revuélvalo en sal de apio y harina sazonada.", "Divida la carne de salchicha en seis porciones. Enrolle cada porción en una hamburguesa lo suficientemente grande como para envolver un huevo. Envuelva la carne de salchicha alrededor de los huevos y enrolle en forma de bola.", "Mezcle las migas de pan con las patatas fritas. Espolvoree el huevo recubierto de salchicha en harina, sumérjalo en huevo batido y luego revuelva en la mezcla de migas de pan.", "Caliente el aceite en una freidora de grasa profunda o una sartén profunda de fondo grueso a 160 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida).", "Freír los huevos durante aproximadamente 8-10 minutos hasta que estén dorados. Alternativamente, alevines poco profundos, volteándolos de vez en cuando, hasta que estén cocidos."], "url": "www_bbc_co_uk_food_recipes_pickled_scotch_eggs_68143", "title": "Huevos escoceses en escabeche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6 huevos escoceses", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2¼lb cebollas pequeñas en escabeche o chalotes, pelados", "30 g / 1 oz de sal", "1 cucharadita de hojuelas de chile seco", "1l / 1¾pt de vinagre de malta", "Azúcar granulada 180g / 6oz"], "method": ["Coloque las cebollas en un tazón grande con la sal y mezcle. Cubra y deje toda la noche.", "Enjuague bien en agua fría y deje secar tanto como sea posible.", "Empaque las cebollas en frascos esterilizados.", "Ponga el vinagre, las hojuelas de chile y el azúcar en una sartén y lentamente hierva para disolver el azúcar.", "Vierta el vinagre sobre las cebollas y selle los frascos.", "Almacene en un armario fresco y oscuro durante dos semanas antes de comer."], "url": "www_bbc_co_uk_food_recipes_pickledonions_7719", "title": "Cebollas en vinagre", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Hace 1 tarro grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de vinagre de vino blanco", "0.5 litros / 17½ fl oz de agua", "500 g / 1 lb 2 oz de azúcar en polvo", "Anís de 3 estrellas", "1 barra de canela grande, rota en tres pedazos", "1 cucharada de bayas de pimienta de Jamaica", "1 limón, cáscara pelada en tiras grandes con un pelador de patatas", "½ cucharadita de clavo de olor", "2 cucharaditas de bayas de enebro", "20 peras de conferencia, peladas, tallos intactos", "2 ramitas de romero fresco"], "method": ["Llevar a ebullición el agua, el vinagre, el azúcar, el anís estrellado, los palitos de canela, las bayas de pimienta, la ralladura de limón, el clavo de olor y las bayas de enebro en una sartén grande, con tapa y que no reaccione.", "Agregue las peras, luego cubra la olla con una tapa y reduzca el fuego hasta que la mezcla hierva a fuego lento. Cocine a fuego lento durante 10-15 minutos, o hasta que las peras estén tiernas. Retire las peras del líquido de caza furtiva con una cuchara ranurada y déjelas a un lado.", "Regrese el líquido de cocción a ebullición y hierva por 4-5 minutos, o hasta que el volumen del líquido se haya reducido y espesado.", "Divida las peras escalfadas entre dos jarras herméticas esterilizadas de 1.5 litros / 2 pintas de 13 fl. Vierta la mitad del líquido de cocción reducido en cada jarra, asegurándose de que las especias se distribuyan uniformemente entre cada jarra. Agregue una ramita de romero a cada jarra. Sella los frascos con fuerza. Las peras en vinagre se pueden almacenar durante un máximo de dos meses, pero se pueden comer después de una semana. Una vez abierto, guárdelo en el refrigerador y coma dentro de dos semanas."], "url": "www_bbc_co_uk_food_recipes_pickledpears_93088", "title": "Peras en escabeche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2 jarras de 1.5 litros", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]