[{"ingredients": ["3 papas harinosas, como King Edward o Maris Piper, peladas, picadas", "pequeño puñado de guisantes congelados", "botón de mantequilla", "2 cebollas tiernas, picadas", "25 ml / 1 fl oz de leche", "75 g / 3 oz de queso cheddar maduro, roto en trozos", "pizca de pimentón ahumado", "1 cucharada de aceite de oliva", "½ cebolla roja, más o menos picada", "1 diente de ajo, picado", "2 zanahorias pequeñas, peladas, cortadas en trozos pequeños", "1 tallo de apio, cortado, picado en trozos pequeños", "400g / 14oz de tomates de ciruela enlatados", "splash salsa Worcestershire (opcional)", "algunas gotas Tabasco", "pizca de pimentón ahumado", "1 hoja de laurel fresca", "85ml / 3fl oz de vino tinto", "100ml / 3½fl oz de caldo de verduras", "1 ramita de romero fresco", "salpicaduras de vinagre balsámico", "pequeño puñado de perejil fresco de flatleaf, toscamente picado", "400g / 14oz de lentejas Puy enlatadas", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Para el champ cubierto, caliente una sartén de agua con sal, agregue las papas y hierva suavemente hasta que hierva, luego cocine a fuego lento hasta que las papas estén casi cocidas, aproximadamente 15-20 minutos. Cuando las papas para el champ van a terminar, agregue los guisantes congelados y cocine por unos minutos más hasta que los guisantes estén tiernos. Escurrir y apartar.", "Mientras tanto, para la mezcla de lentejas, caliente el aceite de oliva en una sartén grande a fuego medio y fría la cebolla picada, el ajo, las zanahorias y el apio durante 5-10 minutos, hasta que se ablanden.", "Agregue los ingredientes restantes de la mezcla de lentejas a excepción de las lentejas y sazone al gusto con sal y pimienta negra recién molida. Llevar a ebullición a continuación, reduzca el fuego y cocine a fuego lento durante 10 minutos hasta que las verduras estén tiernas y la salsa se haya reducido. Revuelva las lentejas en la salsa de tomate.", "Derrita la mantequilla en una cacerola pequeña a fuego lento, luego fríe las cebollas hasta que se ablanden. Agregue la leche y caliente a través.", "Mash las patatas y los guisantes aproximadamente. Agregue la mezcla de leche tibia a las papas y continúe macerando hasta que se combinen, pero todavía grueso.", "Coloque la mezcla de lentejas en un plato mediano y cubra con el campeón. Esparza sobre el queso y el pimentón ahumado. Coloque el plato en una bandeja para hornear y hornee el pastel durante 25-30 minutos, o hasta que la papa esté dorada."], "url": "www_bbc_co_uk_food_recipes_lentilshepherdspiewi_93532", "title": "Pastel de pastor de lentejas con champ", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lentilshepherdspiewi_93532_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, solo yemas", "Azúcar 80 g / 3 oz", "1 vaina de vainilla, semillas raspadas", "500ml / 18fl de leche en oz", "½ cucharadita de pimienta molida o pimienta negra molida", "Azúcar 75g / 3 oz", "50g / 2oz de almendras troceadas", "2 huevos de gallinas camperas, solo blancos (60 g / 2¼ oz)", "45g / 1¾oz de azúcar glas, tamizado si tiene grumos", "un par de gotas de jugo de limón", "pizca de sal"], "method": ["Para hacer la crema inglesa, mezcle las yemas de huevo y el azúcar en un tazón.", "Coloque la vaina de vainilla y las semillas en una sartén con la leche y la pimienta y deje hervir.", "Retire la vaina (puede enjuagarla y secarla y utilizarla para obtener azúcar de vainilla). Luego vierta un poco de leche caliente sobre la mezcla de yema de huevo, batiendo continuamente.", "Poco a poco mezcle con el resto de la leche, luego vierta la mezcla en una sartén limpia, coloque un poco de calor y batir constantemente. No dejes que la natilla hierva a fuego lento en ningún punto o se dividirá.", "Después de cinco minutos, comenzará a espesarse ligeramente y convertirse en la consistencia de una sola crema (se espesará más cuando se enfríe).", "Transfiera a un tazón y relájese en la nevera durante al menos cuatro horas.", "Mientras tanto, para hacer el bombón, forra una bandeja para hornear con papel de hornear.", "Pon el azúcar y 25 ml / 1 onza de agua en una sartén grande, calienta suavemente hasta que el azúcar se disuelva, luego aumenta el fuego a un nivel alto.", "Cuando la mezcla empiece a burbujear, agregue las almendras y continúe cocinando durante cinco minutos, revolviendo continuamente para evitar que las almendras se peguen al fondo de la sartén y se quemen.", "Una vez que el azúcar y las nueces se hayan convertido en un color caramelo dorado oscuro, vierta en la bandeja preparada y extiéndalo tan finamente como sea posible con una espátula (sea rápido ya que se endurece rápidamente). Dejar de lado para enfriar.", "Para hacer las islas de merengue, ponga la mitad de las claras de huevo en un recipiente limpio de vidrio o metal.", "Agregue el azúcar, el jugo de limón y la sal y bata hasta que esté blanco como la nieve.", "Agregue el resto de las claras de huevo y continúe batiendo hasta que el merengue forme picos rígidos cuando se quite el batidor.", "Coloque cuidadosamente seis cucharadas de merengue en una olla grande de agua hirviendo a fuego lento y cocine a fuego lento durante unos minutos o hasta que estén un poco infladas y acaba de establecer. Retire con una espumadera y colóquelo en una hoja de papel para hornear hasta que lo necesite.", "Para ensamblar, vierta un cucharón de crème anglaise en cada uno de los seis vasos y coloque suavemente un merengue en el centro. Coloque la almendra garapiñada en trozos pequeños y espolvoree en la parte superior."], "url": "www_bbc_co_uk_food_recipes_les_flottantes_30026", "title": "Islas flotantes", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 rebanadas de pan crujiente blanco", "1 cucharada de aceite de oliva", "6 huevos medianos de granja", "3 lechuga pequeña gema", "50g / 2oz (aproximadamente 12) filetes de anchoa grandes en aceite de oliva, escurridos y cortados en diagonal en piezas de 2.5cm / 1in", "1 diente de ajo pequeño, aplastado", "1 yema de huevo grande de gallinas camperas", "1 cucharadita de mostaza Dijon", "2 cucharadas de jugo de limón", "½ cucharadita de azúcar en polvo", "150ml / 5fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Para los crotones, precalentar el horno a 180C / 350F / Gas 4.", "Corta las costras del pan y raspa el resto en trozos pequeños. Mézclelos en un tazón con aceite de oliva. Extiéndalo en una bandeja para hornear y hornee de 5 a 7 minutos o hasta que esté crujiente y dorado. Retire y deje enfriar, luego sazone ligeramente con sal.", "Mientras tanto, ponga los huevos en una olla con agua hirviendo y deje hervir durante ocho minutos. Escurrir y cubrir con agua fría.", "Para el aderezo, coloque el ajo, la yema de huevo, la mostaza, el jugo de limón, el azúcar y un poco de aderezo en un tazón pequeño. Mezcle brevemente con un batidor eléctrico de mano, luego bata lentamente en el aceite para hacer un aderezo suave.", "Deseche las hojas exteriores de la lechuga si es necesario y rasgue el resto en trozos pequeños. Lave y seque bien, luego extiéndalo sobre la base de seis platos medianos. Pele los huevos duros y córtelos en cuartos. Coloque cuatro pedazos sobre cada plato de hojas de lechuga con las cuatro tiras de filete de anchoa y algunos crutones. Rocíe una cucharada de aderezo sobre cada plato y sirva enseguida."], "url": "www_bbc_co_uk_food_recipes_lettuce_anchovy_and_egg_91029", "title": "Ensalada de lechuga, anchoa y huevo con una vinagreta cremosa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lettuce_anchovy_and_egg_91029_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla mediana picada", "un poco de mantequilla o aceite de oliva", "1 cos grande o 2 lechugas butterhead grandes (o las hojas exteriores de cuatro o más lechugas)", "250 g / 9 oz (peso desgranado) guisantes frescos o congelados", "1L / 1¾pt buen caldo de pollo o verdura", "5-6 hojas de apio fresco (más 4 más para decorar) o 3-4 ramitas de estragón fresco", "sal y pimienta"], "method": ["Sudor la cebolla en el aceite o la mantequilla hasta que esté suave, luego agregue los guisantes y la lechuga. Vierta más de dos tercios del caldo, deje hervir y cocine a fuego lento durante 4-6 minutos (hasta que los guisantes más gordos estén completamente tiernos).", "Retire del fuego y agregue las hojas de apio o el estragón, luego mezcle la sopa con una batidora o en un licuadora. Dejo de mezclar antes de que sea completamente suave, ya que me gusta ver y sentir algo de textura, pero una textura completamente lisa y aterciopelada también es agradable. Adelgace la sopa a su textura preferida con el caldo restante. Me gusta bastante grueso, pero de nuevo, es una cuestión de gusto personal.", "Para servir frío, enfríe en el refrigerador o, si tiene prisa, transfiéralo a un recipiente frío y colóquelo en un segundo recipiente más grande medio lleno de agua helada. Revuelva hasta que se enfríe, cambiando el agua y agregando más hielo según sea necesario.", "Para servir caliente, recaliente, revuelva ocasionalmente y no permita que hierva. En ambos casos, adornar con una sola hoja de apio o una pequeña ramita de estragón en cada plato."], "url": "www_bbc_co_uk_food_recipes_lettuceandlovagesoup_14299", "title": "Sopa de Lettice y apio de monte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de filete 150 g / 5½ oz, cortado en tiras", "1 cucharada de aceite de oliva", "½ cucharadita de hojuelas de chile seco", "2 cebollas tiernas, finamente cortadas", "sal y pimienta negra recién molida", "1 lechuga Little Gem, solo hojas grandes"], "method": ["Caliente una sartén hasta que esté caliente. Rocíe las tiras de carne en el aceite y las hojuelas de chile y fríe rápidamente en la sartén caliente durante 1-2 minutos. Agregue las cebollas de primavera, sazone con sal y pimienta negra recién molida y cocine por un minuto más.", "Para servir, coloque las hojas de lechuga en un plato para servir y rellene con la carne de res de chile salteada."], "url": "www_bbc_co_uk_food_recipes_lettucecupswithchill_88185", "title": "Tazas de lechuga con carne de res picante salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 ramitas de tomillo fresco, solo hojas", "3 cucharadas de hojas de menta fresca finamente picadas", "2 cebollas de primavera, solo parte verde, picadas", "½ Scotch bonnet chilli, semillas removidas, finamente picadas", "6 bayas de pimienta de Jamaica", "2 limas, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "4 pedazos de cordero del mismo tamaño (aproximadamente 500 g / 1 libra 2 onzas en total)", "3 cucharadas de aceite de girasol o maní", "75ml / 2½fl oz de agua fría", "125ml / 4fl oz de cerveza jamaicana (puede sustituir con cerveza irlandesa), mezclada con 1½ cucharada de azúcar moreno oscuro", "½ coco fresco, cortado abierto, carne cortada de la cáscara con un cuchillo afilado, rallado grueso (el líquido puede ser bebido o reservado para otra receta)", "325ml / 11½fl oz de agua fría", "200 g / 7 oz de frijoles negros enlatados, escurridos y enjuagados", "½ cebolla tierna, cortada, picada", "½ Scotch bonnet chilli", "½ diente de ajo, pelado", "1 ramita de tomillo fresco", "3-4 bayas de pimienta de Jamaica", "1 cucharada de mantequilla", "¼ de cebolla, más o menos picada", "Arroz basmati 225g / 8oz, enjuagado con agua corriente fría", "sal y pimienta negra recién molida", "ramitas de menta fresca, para adornar"], "method": ["Para la pasta de especias, moler todos los ingredientes de pasta de especias en un mortero y una mano de mortero hasta obtener una pasta homogénea. Transfiera la pasta de especias a un tazón grande.", "Para el cordero, lavar los trozos de cordero en agua fría y secar con papel de cocina.", "Agregue los trozos de cordero al cuenco de pasta de especias y mezcle hasta que estén completamente cubiertos en la mezcla de especias. Cubra y enfríe en el refrigerador durante al menos una hora, o idealmente durante la noche, para marinar.", "Cuando las piezas de la rabadilla de cordero se hayan marinado, caliente el aceite en una sartén tapada a fuego alto a fuego alto. Cuando el aceite esté humeando, agregue las piezas de la pechuga de cordero y fría durante 2-3 minutos, volteándolas regularmente, o hasta que se doren por todos lados (reserve el recipiente que contiene el adobo sobrante).", "Cubra la olla con una tapa y reduzca el fuego a medio. Continúe cocinando durante 4-5 minutos más.", "Agregue 75ml / 2½fl oz de agua fría al recipiente que contiene el adobo sobrante reservado. Agite el agua alrededor del recipiente, luego vierta el adobo diluido en la sartén con el cordero, vuelva a tapar y continúe cocinando a fuego medio durante otros 4-5 minutos.", "Retire la tapa y agregue la cerveza negra, luego lleve la mezcla a ebullición. Una vez que la mezcla esté hirviendo, reduzca el fuego a bajo y continúe cocinando durante 6-8 minutos más o hasta que la carne esté completamente cocida y la mayoría del líquido de cocción se haya evaporado para dejar una salsa espesa y brillante.", "Mientras tanto, para el arroz y los guisantes, coloque el coco recién rallado en un bol.", "Ponga el agua a hervir, luego vierta sobre el coco rallado. Déjalo a un lado por 15-20 minutos.", "Cuando el coco se haya mojado y el agua se haya enfriado, exprime todo el líquido de la pulpa del coco con las manos. Deseche la carne y reserve el líquido.", "Transfiera el agua de coco a una sartén y agregue todos los ingredientes restantes de arroz y guisantes aparte del arroz basmati. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 12-15 minutos, o hasta que el volumen del líquido se haya reducido y las verduras estén blandas.", "Agregue el arroz enjuagado al líquido de coco. El agua debe cubrir el arroz en 1.25 cm / ½ pulgada, por lo tanto, agregue más agua según sea necesario. Sazonar, al gusto, con sal y pimienta negra recién molida, luego llevar la mezcla a ebullición.", "Cuando el agua esté hirviendo, cubra la olla con la tapa. Reduzca el fuego a su nivel más bajo y cocine suavemente durante 15-20 minutos, o hasta que el arroz esté tierno y haya absorbido el líquido de coco. Deseche el chile Scotch bonnet.", "Para servir, divida el arroz y los guisantes entre dos platos para servir. Coloque dos trozos de cordero en la parte superior de cada porción de arroz y guisantes. Cuchara sobre la salsa. Adorne con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_levishomecominglambw_91689", "title": "El cordero de regreso de Levi con arroz y guisantes", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal, derretida", "Carne picada 150 g / 5½ oz (use uno con mucha fruta)", "125g / 4½oz de pera madura o enlatada, picada", "50g / 1¾oz de satsumas picadas", "2 cucharadas de harina de maíz", "5 hojas de pasta filo"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cepille las tazas de una lata de 12 tazas con un poco de mantequilla derretida.", "Mezcle la carne picada con la pera, satsumas y harina de maíz en un bol, revolviendo hasta que la harina de maíz se haya disuelto.", "Coloque una hoja de filo en la superficie de trabajo y cepille con mantequilla derretida. Coloque otra hoja de filo en la parte superior, y vuelva a cepillar con mantequilla. Coloque una tercera hoja de filo en la parte superior y cepille con mantequilla. Corta la pila de filo en 12 piezas (una rueda de pizza es buena para esto). Presione un trozo de filo en cada taza del molde.", "Divida la mezcla de carne picada a partes iguales entre las copas forradas de repostería.", "Unte con mantequilla las hojas restantes de filo por separado y corte cada pieza en 6. Arruine las piezas y coloque una encima de cada pastel de carne picada. Cuantas más arrugas, mejor.", "Hornee en el horno por 15 minutos, o hasta que la parte superior esté dorada y crujiente. Retire del horno y deje enfriar en la lata durante 5 minutos antes de transferirlo cuidadosamente a una rejilla de alambre. Estos realmente se comen mejor calientes del horno, ya que tienden a suavizarse cuando se enfrían. Pero los pasteles también pueden recalentarse durante 5 minutos para que se vuelvan a frotar."], "url": "www_bbc_co_uk_food_recipes_light_and_fruity_mince_77851", "title": "Pasteles de carne picada ligeros y afrutados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 tartas de filo picadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/light_and_fruity_mince_77851_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina integral", "1 huevo de gallinas camperas", "300ml / ½ litro de leche descremada", "1 cucharadita de aceite de oliva", "aceite en aerosol bajo en calorías", "bayas mezcladas (fresas, frambuesas, arándanos)", "4 cucharadas de yogur bajo en grasa"], "method": ["Coloque la harina en un tazón. Batir el huevo, la leche y el aceite juntos, luego agregar lentamente a la harina. Revuelva la mezcla hasta que se forme una pasta suave. Deje reposar durante unos 20 minutos, luego revuelva de nuevo.", "Rocíe una sartén antiadherente con aceite. Cuando el aceite esté caliente, agregue 2 cucharadas de la mezcla de panqueques y sacuda la sartén para que se extienda. Cocine la tortita durante 2 minutos, o hasta que la parte inferior esté ligeramente dorada. Voltee y cocine el otro lado por un minuto más.", "Mantenga la tortita caliente mientras cocina el resto. La mezcla debe hacer 8 panqueques en total. Divida los panqueques entre 4 platos, cubra los panqueques con las bayas mixtas y el yogur y sirva."], "url": "www_bbc_co_uk_food_recipes_light_n_low_pancakes_98483", "title": "Panqueques light 'n' low", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/light_n_low_pancakes_98483_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 hojas de gelatina", "Frambuesas 300g / 10½ oz", "4 huevos de gallinas camperas, separados", "75 g / 2½ oz de azúcar en polvo", "150ml / 5fl oz de crema doble", "algunas frambuesas, para adornar"], "method": ["Remoje la gelatina en un tazón pequeño de agua fría durante 5 minutos hasta que esté suave. Exprime el líquido e inclina todo menos 1 cucharada de agua.", "Coloque la gelatina en un recipiente resistente al calor con la cucharada de agua. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento durante unos minutos. Revuelva hasta que se disuelva y deje que gotee.", "Mezcle las frambuesas en un procesador de alimentos y pase a través de un tamiz en un recipiente, quitando las semillas.", "Batir las yemas y el azúcar impalpable en un bol con un batidor de mano eléctrico hasta obtener un color espeso, esponjoso y pálido. Esto llevará de 4 a 5 minutos.", "Batir la crema a los picos suaves en un recipiente aparte.", "Revuelva las frambuesas y la gelatina tamizadas en la yema de huevo y la mezcla de azúcar en polvo, luego doble cuidadosamente la crema.", "Batir las claras de huevo en un recipiente limpio hasta que se formen picos fuertes. Agregue 2 cucharadas en la mezcla de frambuesa, luego doble cuidadosamente el resto.", "Coloque la cuchara en un tazón de 1,2 litros / 2 pinta o 4-6 vasos. Coloque en la nevera durante 4 horas, o hasta que esté listo.", "Decorar con frambuesas y servir directamente desde la nevera."], "url": "www_bbc_co_uk_food_recipes_light_raspberry_mousse_73585", "title": "Mousse de frambuesa ligera", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/light_raspberry_mousse_73585_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pollo, con hueso, piel removida y cortada a través de la articulación para que tengas 4 muslos y 4 piernas", "1 ramita de tomillo", "2 hojas de laurel", "½ cubo de caldo de pollo", "500g / 1lb 2oz Jersey Royal potatoes", "2 ramitas de menta", "2 calabacines, cortados en cubitos", "Guisante pequeño de 250 g / 9 oz", "Habas de 250g / 9oz (piel encendida)", "250 g / 9 oz de judías verdes, cortadas en cuartos", "½ manojo de perejil flatleaf, solo hojas", "½ racimo de cilantro, solo hojas", "¼ manojo de menta", "½ limón, solo jugo", "1 diente de ajo, pelado", "2-3 anchoas saladas", "½ cucharadita de mostaza inglesa", "algunas gotas Tabasco", "1 cucharada de vinagre de vino tinto", "285 ml / 10 fl oz de aceite de oliva", "sal marina y pimienta negra recién molida", "4 espárragos de lanzas", "2 cucharadas de aceite de oliva", "2 cucharadas de brotes de guisantes"], "method": ["Para el caldo ligero de verano, coloque el pollo en una sartén grande con el tomillo, las hojas de laurel y el cubo de caldo y cúbralo con agua fría. Llevar a ebullición y quitar toda la espuma que sale a la superficie, luego sazonar con sal marina.", "Coloque las papas y la menta en una olla grande con agua y deje que hierva. Cocine por 10-15 minutos. Retire del fuego y drene. Dejar de lado.", "Cocine a fuego lento el pollo durante unos 20 minutos, luego agregue los calabacines, guisantes, habas y judías verdes. Vuelva a cocinar a fuego lento y cocine por 6-7 minutos, o hasta que los vegetales estén tiernos.", "Para el aderezo de hierbas, coloque todos los ingredientes aparte del aceite de oliva en una licuadora, luego mezcle por un minuto o así solo para romper un poco.", "Vierta el aceite y luego mezcle de nuevo, esta vez hasta que tenga una salsa verde suave y brillante.", "Para servir, divida las papas entre cuatro cuencos calientes. Cada porción debe tener una baqueta y un trozo de muslo, muchas verduras de color verde brillante y un poco de caldo de pollo. Vierta una cucharada sobre el aderezo de hierbas y sirva con las papas Jersey Royal vestidas con un poco del aderezo. Reserve cualquier vendaje restante en un frasco para usarlo como lo desee.", "Adorne la sopa con virutas de espárragos (rasurados longitudinalmente y vestidos con aceite de oliva) y brotes de guisantes."], "url": "www_bbc_co_uk_food_recipes_light_summer_broth_with_50097", "title": "Caldo ligero de verano con aderezo de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de dulces dulces", "Anillo de tarta 1x20cm / 8in", "300 g / 10½ oz de chocolate negro", "110g / 4oz de mantequilla sin sal", "Crema doble 110ml / 4fl oz", "4 huevos", "1 huevo, solo yema", "110 g / 4 oz de azúcar"], "method": ["Alinee el anillo de tarta con dulces y hornee a ciegas.", "Derrita el chocolate, la mantequilla y la crema en un recipiente sobre agua hirviendo.", "En una batidora, bata los huevos, la yema y el azúcar a velocidad máxima hasta que estén gruesos, livianos y esponjosos.", "Dobla los huevos a través de la mezcla de chocolate derretido con mucho cuidado y llena el molde de tarta hasta la parte superior.", "Cocine en un horno fresco a 150C / 300F / Gas 2 por 10 minutos. Deje que se enfríe completamente.", "No refrigere Sirva con sorbete de naranja o maracuyá."], "url": "www_bbc_co_uk_food_recipes_lightasafeatherchoco_67772", "title": "Luz como una tarta de chocolate de plumas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 parecía", "1 zanahoria", "½ cebolla grande", "varias ramitas de tomillo fresco", "1 cabeza de ajo", "10 granos de pimienta negra", "1 cadáver de pollo, cortado en 3", "20 alitas de pollo"], "method": ["Pique el puerro en tres pedazos grandes y colóquelo en una olla grande o en una sartén grande de fondo grueso (aún no encienda el fuego).", "Picar la zanahoria en trozos grandes y agregar a la olla.", "Pele la cebolla y agregue a la olla. Agregue el tomillo a la olla. Cortar la cabeza de ajo por la mitad, a través de los clavos, y agregar a la olla. Agregue los granos de pimienta.", "Agregue la carcasa de pollo y las alas a la olla. Vierta suficiente agua fría para cubrir el pollo, aproximadamente 2,8 litros / 5 pintas.", "Encienda el fuego a un calor suave y lleve el caldo a fuego lento. Cocine a fuego lento, cubierto, durante 1½-2 horas.", "Después de media hora más o menos, quite la espuma que sale a la superficie con un cucharón o una cuchara grande. Repita según sea necesario.", "Al final del tiempo de cocción, cuele el caldo, descartando los vegetales y las piezas de pollo. Dejar enfriar. Puede usar el caldo tal como está, almacenarlo en la nevera por hasta tres días o congelarlo por hasta tres meses para usarlo en el futuro."], "url": "www_bbc_co_uk_food_recipes_lightchickenstock_90221", "title": "Cómo hacer caldo de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 2 litros / 4 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo de 200 g / 7oz", "200ml / 7fl oz de leche semidesnatada, más ½ cucharada extra de glaseado", "¼ de cebolla, pelada", "1 hoja de laurel", "Hojaldre laminado listo para consumir reducido en calorías de 100g / 3½oz (aproximadamente una pieza de 10x25cm)", "aceite en aerosol bajo en calorías", "2 medallones de tocino, cortados en pequeños trozos", "Setas de botón de 200 g / 7 onzas, grandes cortadas por la mitad", "1 puerro, picado", "1 cucharada de harina normal", "brócoli al vapor, para servir"], "method": ["Coloque la pechuga de pollo en una sartén pequeña (debe ser una sartén pequeña para que el pollo se cueza en la leche). Agregue la leche, la cebolla y la hoja de laurel. Cubra con una tapa y cocine a fuego lento durante 15 minutos, o hasta que el pollo esté bien cocido.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Divida la masa en dos rectángulos iguales y extráigalos con cuidado hasta que queden lo suficientemente grandes como para cubrir la parte superior de dos platos individuales. Coloque los platos de pastel vueltos hacia arriba en la pastosa y corte alrededor de ellos para hacer las tapas de las empanadas. Corte cualquier exceso de hojaldre en tiras y presiónelos alrededor del borde superior de los platos de tarta (esto ayudará a que las tapas permanezcan en su lugar a medida que las tartas se hornean). Corta una cruz en el medio de las tapas de pastelería y reserva.", "Freír el tocino con un chorro de aceite en aerosol en una sartén antiadherente. Cuando esté dorado, agregue los champiñones y una cucharada de agua. Cocine por 2-3 minutos y luego agregue los puerros. Cocine por unos 5 minutos rompiendo los puerros a medida que se ablandan.", "Retire el pollo de la leche furtiva. Cuela y reserva la leche y corta el pollo en trozos del tamaño de un bocado.", "Revuelva el pollo en las verduras. Agregue la harina y revuelva bien. Cocine por 2 minutos, luego agregue la leche sazonada tensa revolviendo bien para incorporar. Continúe cocinando por 2-3 minutos, o hasta que la salsa se haya espesado un poco. Divida entre los platos de tarta.", "Cepille los bordes de la pastelería con un poco de leche y agregue las tapas de los pasteles. Cepille todo con más leche. Hornee durante 25 minutos o hasta que la tapa del pastel esté dorada. Sirva inmediatamente con brócoli al vapor."], "url": "www_bbc_co_uk_food_recipes_lighter_chicken_bacon_60415", "title": "Tartas más ligeras de pollo, tocino y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_chicken_bacon_60415_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas de 400g / 14oz, peladas y cortadas en chips", "1 cucharadita de aceite vegetal", "1 huevo grande, separado", "½ limón, solo ralladura", "puñado de tomillo fresco de limón", "2 x 150 g de filetes de lomo de bacalao sin piel y sin espinas", "Guisantes 150 g / 5½ oz, frescos o congelados, para servir", "1 limón, cortado en cuñas, para servir", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220 ° C / 200 ° Ventilador / Gas 7. Cubra una bandeja para hornear con papel de hornear.", "Hervir las patatas fritas durante 3-4 minutos, luego escurrir bien. Vierta 1 cucharadita de aceite en una bandeja para hornear y caliente en el horno. Agregue las virutas en una sola capa y hornee durante 20 minutos", "Mientras tanto, bata la yema de huevo, la ralladura de limón, el tomillo de limón, la sal y la pimienta en un bol. En un recipiente de vidrio limpio, bata la clara de huevo hasta que se formen picos suaves cuando se quite la batidora. Dobla la yema en el blanco.", "Sumerja el pescado en la mezcla de huevo, luego transfiera a la bandeja de horno forrada y hornee durante 15-20 minutos, o hasta que esté cocido y dorado.", "Hervir los guisantes en agua durante 2-3 minutos. Sirve el pescado y las patatas fritas con los guisantes y las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_lighter_fish_and_chips_06976", "title": "Peces y patatas fritas más ligeros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_fish_and_chips_06976_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Coliflor entera 750-800g / 1lb 10oz-1lb 12oz, cortada en pequeños floretes", "1 cubo de caldo de pollo", "250 ml / 9 fl oz de leche semidesnatada", "40 g / 1½ oz de queso parmesano, finamente rallado", "Penne seco 175g / 6oz u otra forma de pasta corta", "200g / 7oz de brócoli, cortado en pequeños floretes", "1 cucharada de aceite de oliva extra virgen", "2 pechugas de pollo sin huesos, sin piel (aproximadamente 300 g / 10½ oz), cortadas en tiras de 15 mm / ⅝ in", "½ cebolla, finamente picada", "200g / 7oz de tomates cherry, cortados a la mitad", "pimienta negra recién molida"], "method": ["Coloque los floretes de coliflor en una olla y cubra con agua fría. Desmenuce el cubo de reserva en la parte superior y llevar a ebullición. Cocine por 8-10 minutos, o hasta que la coliflor esté muy suave. Drene, reservando el agua de reserva, y devuelva la coliflor a la cacerola. Agregue la leche, 200 ml / 7 fl oz de la reserva reservada y la mitad de parmesano. Licuar con una licuadora de mano o transferir a un procesador de alimentos y licuar hasta que quede suave. Dejar de lado.", "Llene a la mitad una olla grande con agua y deje que hierva. Agregue la pasta, vuelva a hervir y cocine durante 8 minutos. Agregue el brócoli y cocine por otros 2 minutos, o hasta que la pasta y el brócoli estén tiernos. Escurrir y volver a la cacerola. Agregue los tomates y mezcle. Agregue la salsa de coliflor.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente el aceite en una sartén grande y antiadherente. Sofreír el pollo y la cebolla durante 3 minutos o hasta que estén ligeramente dorados.", "Incline la mitad de la mezcla de pasta en un recipiente para horno de 2 litros / 3½ pinta. Cubra con la mezcla de pollo y luego se extendió toda la mezcla de pasta restante en la parte superior. Espolvorear con el resto del queso parmesano y sazonar con pimienta.", "Hornee durante 20 minutos o hasta que estén dorados y burbujeantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lighter_chicken_pasta_23131", "title": "'Aligerar' pasta de pollo hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_chicken_pasta_23131_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "75g / 2½oz de pan rallado blanco", "pizca de pimentón", "Pescado blanco firme de 250g / 9oz, como merluza o bacalao, cortado en tiras del tamaño de un bocado", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida", "2 cucharadas de mayonesa", "½ cucharadita de curry en polvo", "apretón de jugo de limón", "4 panes pitta integrales", "1 lechuga Cos o gema bebé, hojas rotas en pedazos"], "method": ["En un tazón poco profundo bata el huevo. En otro recipiente combine las migajas y el pimentón, sazone con sal y pimienta.", "Sumerja los dedos de pescado en el huevo, asegurándose de que estén completamente cubiertos y sacuda el exceso. Luego, sumerja cuidadosamente los dedos de pescado en la mezcla de pan rallado para cubrirlos por completo.", "Caliente el aceite en una sartén grande a fuego medio-alto. Freír los dedos de pescado durante 2-3 minutos en cada lado hasta que estén dorados y cocidos. Retire de la sartén y escurra sobre papel de cocina.", "Mientras el pescado está cocinando, combine la mayonesa, el polvo de curry y el jugo de limón en un tazón pequeño y déjelos a un lado.", "Sirva los dedos de pescado en pittas integrales con la mayonesa y la lechuga."], "url": "www_bbc_co_uk_food_recipes_lighter_fish_finger_18584", "title": "Dedos de pescado con pan de pitta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_fish_finger_18584_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g de garbanzos de lata, escurridos", "100 g / 3½ oz de yogur natural sin grasa de estilo griego", "150g / 5½oz de pimiento rojo asado, escurrido", "½ limón, solo jugo", "1 nivel de tsp tahini", "pizca ahumada pizca (opcional)", "1 pimiento rojo, sin semillas, cortado en tiras, para servir", "1 zanahoria pequeña, pelada y cortada en palos, para servir"], "method": ["Ponga los garbanzos, el yogur, el pimiento rojo asado, el jugo de limón, el tahini y el pimentón ahumado, si está usando, en un procesador de alimentos. Mezclar hasta que esté suave.", "Transfiera a un tazón y sirva con los palitos de verduras o guárdelos en la nevera, cubiertos, hasta por tres días."], "url": "www_bbc_co_uk_food_recipes_lighter_hummus_54148", "title": "Hummus más ligero con palitos de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_hummus_54148_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharaditas de aceite de oliva", "600 g / 1 libra de filetes de pierna de cordero de 5 oz, toda la grasa visible eliminada (500 g / 1 lb 2 onzas después de cortar la grasa), cortada en trozos pequeños", "2 cebollas, más o menos picadas", "2 dientes de ajo, cortados en rodajas gruesas", "250g / 9oz de apio (alrededor de 4 tallos), en rodajas gruesas", "Zanahorias de 400g / 14oz (alrededor de 4 zanahorias medianas), peladas y rebanadas gruesas", "pequeño puñado de romero fresco, finamente picado", "algunas ramitas de tomillo fresco", "1 cucharada de harina normal", "1 caldero de carne diluido para hacer 500 ml / 18 fl oz de stock", "2 cucharadas de salsa Worcestershire", "2 cucharadas de puré de tomate", "650 g / 1 libra de papas harinosas de 7 oz, idealmente Maris Piper, cortadas en rodajas gruesas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Caliente 1 cucharadita de aceite en una cazuela grande de fondo grueso a fuego medio a alto. Dorar el cordero por todos lados en dos tandas durante 3-4 minutos por lote. Transfiera a un plato con una cuchara ranurada.", "Agregue otra cucharadita de aceite a la sartén y agregue las cebollas, el ajo, el apio y las zanahorias y fría, revolviendo, durante 3-4 minutos. Agregue el romero y el tomillo y fría por otro minuto. Espolvorea sobre la harina y cocina durante 2 minutos, revolviendo todo el tiempo para cocinar la harina.", "Regrese el cordero a la sartén, vierta el caldo y agregue la salsa Worcestershire y el puré de tomate, y luego llévelo a ebullición.", "Coloque las papas en la parte superior en dos capas superpuestas, sazonando entre las capas. Cubra con la tapa y hornee en el horno durante 1 hora y media, o hasta que el cordero y las papas estén tiernos.", "Retire la tapa y aumente la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6. Cepille las papas con la última cucharadita de aceite y hornee por otros 15 minutos o hasta que la parte superior esté dorada."], "url": "www_bbc_co_uk_food_recipes_lighter_lamb_hotpot_14339", "title": "Un caldo de cordero más liviano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_lamb_hotpot_14339_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de macarrones secos", "200g / 7oz de brócoli, cortado en pequeños floretes", "100 g / 3½ oz de espinaca para bebés, cualquier tallo más grueso eliminado", "2 cucharaditas de aceite de oliva", "2 cebollas de primavera, hojas externas eliminadas, en rodajas finas", "1 diente de ajo, en rodajas finas", "1 cucharada de harina normal", "300ml / 10 fl oz de leche desnatada", "2 hojas de laurel", "1 cucharadita de mostaza integral", "1 limón sin cebar, ralladura fina solamente", "100g / 3½ oz de queso parmesano (o alternativa vegetariana), finamente rallado", "sal y pimienta negra recién molida", "hojas de ensalada mixta vestidas con un chorrito de jugo de limón y 1 cucharadita de aceite de oliva, para servir"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6", "Cocine los macarrones en agua hirviendo durante 6 minutos. Agregue el brócoli y cocine por otros 2 minutos. Apague el fuego, agregue las espinacas y deje reposar con la tapa puesta durante 2 minutos. Escurrir bien y dejar reposar", "Caliente el aceite en una sartén de base pesada. Freír las cebolletas durante 2 minutos. Agregue el ajo y fría por otros 2 minutos. Agregue la harina y cocine, revolviendo todo el tiempo, durante 1-2 minutos. Vierta lentamente la leche, agregue las hojas de laurel y sazone con sal y pimienta. Continúe hirviendo a fuego lento durante 2-3 minutos, hasta que espese. Retire las hojas de laurel.", "Agregue la mostaza, la ralladura de limón y las tres cuartas partes del queso parmesano, luego sazone bien.", "Incline la pasta y el brócoli en un plato para hornear poco profundo. Vierta sobre la salsa y mezcle bien. Espolvorea sobre el queso restante y hornea por 15-20 minutos.", "Sirva con las hojas de ensalada vestidas."], "url": "www_bbc_co_uk_food_recipes_lighter_lemony_pasta_and_44522", "title": "Encendedor pasta con limón y espinacas hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_lemony_pasta_and_44522_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva", "1 cebolla pequeña (75 g / 2½ oz de peso pelado), aproximadamente picada", "1 diente de ajo, aplastado", "125g / 4½oz de guisantes congelados", "300ml / 10fl oz de caldo de verduras", "pimienta negra recién molida", "algunas cebolletas, cortadas, para servir (opcional)"], "method": ["Caliente el aceite en una olla pequeña a fuego medio-bajo. Agregue la cebolla y cocínela durante 3-4 minutos, hasta que se ablande. Agregue el ajo, las arvejas y el caldo, lleve a ebullición, baje la temperatura y cocine a fuego lento durante 20 minutos.", "Use una batidora o un procesador de alimentos para mezclar la sopa y sazone con pimienta negra. Sirva adornado con el cebollino, si lo usa."], "url": "www_bbc_co_uk_food_recipes_lighter_pea_soup_89447", "title": "Sopa de guisantes más ligera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_pea_soup_89447_16x9.jpg", "isVegetarian": true, "recommendations": 0}]