[{"isVegetarian": true, "title": "Celeriac remoulade", "url": "www_bbc_co_uk_food_recipes_celeriacremoulade_77607", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celeriacremoulade_77607_16x9.jpg", "ingredients": ["½ small celeriac, cut into thin strips", "½ lemon, juice only", "2 tbsp double cream ", "3 tbsp good-quality mayonnaise", "2 tsp Dijon mustard", "salt and white pepper"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Place the celeriac strips into a bowl along with the lemon and juice and toss to combine.", "Mix the double cream, mayonnaise and mustard together then stir into the celeriac.", "Season with salt and white pepper.", "Place in the fridge for a couple of hours for the flavours to develop before serving."]}, {"isVegetarian": true, "title": "Celeriac and  roast hazelnut soup with soda bread", "url": "www_bbc_co_uk_food_recipes_celeriacroasthazelnu_78846", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil", "450g/1lb plain flour", "1 tsp bicarbonate of soda", "1 tsp salt", "400ml/14fl oz (approx) buttermilk", "pinch Maldon sea salt", "30g/1oz butter", "110g/4oz onions, finely chipped", "140g/5oz potatoes, finely ", "salt and freshly ground black pepper", "425g/15oz celeriac, finely diced", "1.2 litres/2 pints chicken stock (vegetarians may substitute with vegetable stock or water)", "170ml/6fl oz milk", "60ml/2fl oz cream (optional)", "fresh flatleaf parsley, chopped, to garnish", "25g/1oz toasted hazelnuts, chopped for garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven 230C/450F/Gas 8. Brush a baking sheet generously with olive oil.", "For the soda bread, sift the plain flour and the bicarbonate of soda into a big bowl. Add the salt, and mix with your hands. Make a well in the centre of the flour mix, pour in most of the buttermilk, and with one hand stiff and your fingers spread out like a claw, start mixing in a full circle once the butter milk has gone in.", "Keep mixing like this until you have a soft dough. Do not knead it but work it very gently to bring it together.", "Transfer to a floured surface, and roll it out to about 35x20cm/14x8in and transfer it to the oiled tray.", "Brush the top of the dough with some more oil and sprinkle with a little sea salt. Transfer to the oven and cook for ten minutes. Then turn the oven down to 200C/400F/Gas 6 and cook for a further 8-12 minutes until cooked. When cooked, it should feel firm in the centre and be golden brown. ", "Transfer the soda bread from the oven to a wire rack and cool for a couple of minutes, then cut it into squares to serve.", "Meanwhile for the soup, melt the butter in a heavy saucepan over a medium heat. When it foams, add the potatoes and onions and toss them in the butter until evenly coated.  Season with salt and freshly ground pepper.  ", "Cover with a circle of baking paper (to keep in the steam) and the saucepan lid, and sweat over a gentle heat for about ten minutes, until the vegetables are soft but not coloured.", "Remove the paper lid.  Add the celeriac and chicken stock, bring to the boil, reduce the heat and simmer for 8-10 minutes, until the celeriac is soft.", "Liquidise the soup using a hand blender, adding a little more stock, milk (or cream) to thin to the required consistency.  Season to taste with salt and freshly ground black pepper.", "Serve the soup piping hot in a bowl with a scattering of chopped hazelnuts, and a little chopped parsley to garnish, accompanied by slices of soda bread."]}, {"isVegetarian": false, "title": "Celery trout en papillote", "url": "www_bbc_co_uk_food_recipes_celery_trout_en_54422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "1 small fennel bulb, thinly sliced", "1 onion, thinly sliced", "2 sticks celery, sliced", "2 firm ripe tomatoes, quartered", "2 small lemons, zest and juice", "2 tbsp chopped fresh dill", "2 tbsp capers (optional)", "4 x 175g/6oz trout fillets, pin bones removed", "8 tbsp white wine", "500g/1lb 2oz new potatoes ", "400g/14oz green beans, trimmed", "75g/2½oz unsalted butter", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the trout, preheat the oven to 180C/200C Fan/Gas mark 6. For each piece of fish prepare a parcel by cutting a 35cm/14in square of kitchen foil. On top of this put a square of baking parchment the same size.", "Put the fennel, onion, celery, tomato, lemon zest and juice, dill, capers and half the olive oil in a bowl and mix together. Season with salt and pepper.", "Divide the fennel mixture between the squares of parchment paper and place a trout fillet on top of each pile. Drizzle over the rest of the olive oil, then add a squeeze of lemon juice to each.", "Fold the foil and parchment paper over the trout fillets and double-fold each edge to make a sealed parcel, leaving a gap at the top. Pour 2 tablespoons of white wine into each parcel, then fully seal. The parcel should not be too tight, as steam will puff it up in the oven.", "Arrange the parcels on a large baking tray and bake for 20 minutes, or until the fish is just opaque and cooked through. ", "Put a steamer over a pan on the hob and add the potatoes. After 15 minutes add the green beans. Sream for another 5 minutes then drain. Add the butter and season with salt and pepper.", "Serve the parcels on warmed plates so they can be opened at the table. Have the steamed beans and potatoes in bowls to hand around separately."]}, {"isVegetarian": true, "title": "Celery and apple soup", "url": "www_bbc_co_uk_food_recipes_celeryandapplesoup_85782", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ stalk celery, chopped", "½ apple, chopped", "2 garlic cloves, chopped", "150ml/5¼ fl oz hot vegetable stock", "50ml/1¾ fl oz milk", "75ml/2½ fl oz double cream", "salt and freshly ground black pepper", "1 tbsp walnuts, chopped ", "drizzle olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the olive oil in a small pan and add the celery, apple and garlic and cook for three minutes. ", "Add the hot vegetable stock, milk, cream and salt and freshly ground black pepper to the pan, cover with a lid and cook for three minutes. ", "Pour the mixture into a blender and blitz until smooth. ", "Pour the soup into a serving bowl and garnish with chopped walnuts and a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Celery baked in vinaigrette with pancetta and shallots", "url": "www_bbc_co_uk_food_recipes_celerybakedinvinaigr_67190", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celerybakedinvinaigr_67190_16x9.jpg", "ingredients": ["1 head celery", "6 shallots, peeled (and split if the bulbs are dividing)", "1 or 2 thyme sprigs", "1 rosemary sprig", "4 sage leaves", "3 slices pancetta or smoked steaky bacon", "3 tbsp light olive oil", "1 dessertspoon white wine vinegar", "salt and freshly milled black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/475F/Gas 9.", "Begin by removing the tough outer layers of the celery, then pare the outside of the root off, but leave it attached. Now cut across the celery about 9cm/3½in from the base. Stand the lower half upright and cut vertically through the centre. Then cut each half into 4 to make 8 pieces, keeping them attached to the root. Save a couple of nice leaves (preferably attached to a small stem) and trim the top pieces of celery to a similar length to the base, cutting off any really tough and stringy edges. Now wash all the pieces and dry them on kitchen paper.", "Next heat one tablespoon of the oil in a frying pan, then lightly brown the celery and shallots, keeping them on the move so they brown evenly. Now transfer them to a plate. Increase the heat under the pan, add the pancetta and fry the slices until they're really crisp - it will take 2-3 minutes and you'll need to keep turning them.", "Next lay the silicone paper over the baking tray and lightly grease a circle of 23cm/9in on it. Arrange the celery in an attractive shape on the paper, putting the prettiest pieces on the top, add the shallots, thyme, rosemary and sage leaves in among it, and season with salt and pepper.", "Now combine the remaining olive oil and wine vinegar, sprinkle that over the vegetables, followed by the pancetta crumbled into pieces with your hands. Next fold the silicone paper over and seal, making pleats, all round - you may find a couple of metal (not plastic) paper clips useful here, as it's essential to keep the steam trapped inside. Place the parcel in the pre-heated oven for 20-25 minutes.", "After that carefully unwrap the paper - you may need scissors - and serve the vegetables with the juices spooned over."]}, {"isVegetarian": false, "title": "Celery heart wrapped in pork on spicy celery with smoked cheese sauce", "url": "www_bbc_co_uk_food_recipes_celeryheartwrappedin_78746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint chicken stock", "2 garlic cloves", "1 celery heart, ends removed and reserved", "1 pork fillet, bashed out with a mallet until thin", "1 tbsp olive oil", "celery ends from heart, chopped", "½ onion, diced", "½ tsp dried oregano", "½ tsp sweet paprika", "100ml/3½fl oz chicken stock", "3 garlic cloves, chopped", "4 dried apricots, diced", "2 tbsp parsley, chopped", "20g/¾oz butter", "20g/¾oz plain flour", "½ tsp mustard powder", "300ml/½pt milk", "100g/4oz smoked cheese, diced", "small bunch chives, finely chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the celery heart, bring the chicken stock to the boil and add the whole garlic cloves. Reduce to a simmer.", "Wrap the pork around the celery heart and secure with a cocktail stick. Add to the stock and poach for ten minutes, or until cooked through. Remove the pork-wrapped celery heart from the stock and set aside.", "For the spicy celery, heat the oil in a pan and sauté all of the ingredients, except for the apricot and parsley, for five minutes.", "Add the apricots and the parsley and stir to combine.", "For the cheese sauce, melt the butter in a small pan. Add the flour and mustard powder, beating for one minute to make a roux.", "Gradually add the milk, whisking all the time.", "Bring the mixture to the boil and add the smoked cheese, stirring well, until all has melted.", "Add the chives and stir though.", "To serve, place a bed of spicy celery on a plate, top with the pork-wrapped celery heart and spoon over the smoked cheese sauce."]}, {"isVegetarian": false, "title": "Celery soup", "url": "www_bbc_co_uk_food_recipes_celerysoup_85016", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celerysoup_85016_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 garlic clove, chopped", "½ red onion, chopped", "150g/5½oz celery, chopped", "200ml/7fl oz hot chicken stock", "2 slices toasted ciabatta, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and cook the garlic, onion and celery over a low heat for five minutes, until softened.", "Add the chicken stock and simmer for 10-12 minutes.", "Transfer the soup to a blender and liquidise.", "To serve, place the soup into a bowl with the toasted ciabatta alongside."]}, {"isVegetarian": true, "title": "Ceps tortellini with roasted nuts and sage butter", "url": "www_bbc_co_uk_food_recipes_cepstortelliniwithro_93488", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cepstortelliniwithro_93488_16x9.jpg", "ingredients": ["200g/7oz '00' pasta flour, plus extra for dusting", "2 free-range eggs", "2 tbsp olive oil", "250g/9oz fresh cep mushrooms, trimmed, rinsed and finely sliced", "sea salt and freshly ground black pepper", "1 banana shallot, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "3 large fresh sage leaves", "¼ lemon, juice only", "1 free-range egg, beaten", "10g/½oz pine nuts", "10 hazelnuts", "40g/1½oz unsalted butter", "8 fresh sage leaves, finely chopped", "50ml/2fl oz water", "½ lemon, juice only"], "serves": "4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour into a food processor, crack in the eggs and pulse to combine. Add a little water, if necessary, to make the dough come together (the dough should ball together when you rub a piece between your fingers). ", "Turn the dough out onto a floured work surface and knead lightly for 2-3 minutes, or until smooth and elastic. Flatten out the dough and roll to a 1cm/½in thickness. Wrap the dough in clingfilm and leave to rest in the fridge for 30 minutes to relax.", "Remove the cling film and cut the pasta dough into 2 equal pieces. Flatten each piece out slightly with a rolling pin the same width as your pasta machine. ", "Pass the dough through the pasta machine, starting with the thickest setting, then fold the ends of the pasta back into the middle, like a business letter. Turn 90 degrees and roll the pasta through the thickest setting once more. Change the setting on the pasta machine to the next thickeness and feed the dough through again. Repeat the rolling, passing the sheet through each setting until you reach the thinnest setting. Cut each sheet of pasta into 3 (the dough should yield enough pasta for approximately six sheets measuring 35cm x 10cm/14in x 4in). ", "Layer the sheets of pasta on a tray, separated by layers of cling film, and keep in the fridge until ready to use.", "For the filling, heat the olive oil in a large frying pan over a high heat and fry the ceps with a pinch of sea salt and freshly ground black pepper for 2-3 minutes, until tender. If you are unable to find fresh ceps you could use either button or field mushrooms. Or you could use some good quality dried ceps, soaked in advance.", "Add the shallots and cook for 1-2 minutes. Add the garlic, then mix the ceps and shallots together and cook for 1-2 minutes, or until the shallots are softened. Add the lemon juice and mix well. Remove from the heat and tip out onto a plate to cool down slightly, then chill in the fridge until cold.", "Take one pasta sheet and place 4 large teaspoons of the filling along the middle, making sure the mounds of filling are evenly spaced. Lightly brush the pasta around the filling with egg wash. Fold the top edge of the sheet over the filling to meet the bottom edge of the sheet, then press around the filling with your fingers to seal (make sure there are no air bubbles in the pasta). Repeat with the remaining sheets of pasta and the filling.", "Cut out the tortellini, using a medium size cutter to stamp out a half moon shape. Press the middle down lightly, then bring the bottom corners of the half-moon together to form a circle. Pinch the ends together to seal. Place the prepared tortellini onto a lightly floured plate until ready to cook.", "Preheat the oven to 170C/340F/Gas 3. ", "For the roasted nuts and sage butter, scatter the pine nuts and hazelnuts on a baking tray and roast in the oven for about 10 minutes, or until the nuts are golden-brown. Remove and set aside to cool. ", "Cook the tortellini, in batches, in a pan of boiling salted water for 2-3 minutes, or until al dente. Remove with a slotted spoon and transfer to warm serving plates. ", "Meanwhile, heat the butter in a pan over a medium heat until melted and hazelnut-brown in colour (be careful not to let the butter darken beyond nut-brown). Add the sage and cook for 5 seconds, then pour in the water and a squeeze of lemon juice and cook for 1-2 minutes. ", "To serve, spoon the sage butter over the tortellini and scatter over the roasted pine nuts and hazelnuts."]}, {"isVegetarian": false, "title": "Ceviche of tuna with lime and chilli with spinach salad and chips", "url": "www_bbc_co_uk_food_recipes_cervichetunawithlime_78025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fresh tuna, thinly sliced ", "1 lime, juice only", "1 tsp vegetable oil", "1 tbsp soy sauce", "salt and freshly ground black pepper", "2 tbsp orange pepper, diced", "1 lime wedge", "½ lemon, juiced", "½ tsp Tabasco sauce", "1tbsp olive oil", "½ red onion, finely sliced", "100g/3½oz spinach", "1 orange, segmented", "500ml/18fl oz vegetable oil", "1 large baking potato, chopped into wedges, skin left on", "salt and freshly ground black pepper, to taste"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the tuna, mix together the oil, lime juice and soy in a small bowl.", "Place the raw tuna slices flat around a plate. Drizzle over the marinade and season well with salt and freshly ground black pepper.", "Sprinkle over the diced orange pepper.", "Garnish with the lime wedge", "To make the salad, mix the lemon juice, olive oil, Tabasco sauce and red onion in a large bowl.", "Add the spinach, toss together and season to taste.", "Transfer to a plate and sprinkle with the segmented orange.", "To make the chips, heat the oil in a heavy-bottomed saucepan (CAUTION: hot oil can be dangerous. Do not leave unattended.). Check the oil has reached the correct temperature by dropping a crumb of bread into the oil. It should sizzle and brown in 20 seconds.", "Fry the potatoes until well browned and crisp. Remove and place on absorbent kitchen paper. ", "Sprinkle with salt, to taste, and place in a bowl.", "Serve hot with the ceviche and salad."]}, {"isVegetarian": false, "title": "Ceviche of sea bass", "url": "www_bbc_co_uk_food_recipes_cevicheofseabass_88623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sea bass fillet, skin on", "1 lime, zest and juice", "½ tsp caster sugar", "1 tbsp vegetable oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Slice the sea bass fillet thinly on the diagonal using a very sharp knife. ", "Spread out the bass slices on a plate and sprinkle over the lime zest and juice, sugar and vegetable oil. Season, to taste, with salt and freshly ground black pepper. Set aside to marinate in a cool place for about 15 minutes, but do not leave any longer or the fish flesh will begin to break down. Serve immediately."]}, {"isVegetarian": false, "title": "Ceviche of sea bass with lime and mango salsa", "url": "www_bbc_co_uk_food_recipes_cevicheofseabasswith_88780", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz very fresh sea bass fillet, skin removed, thinly sliced", "1 lime, zest and juice only", "olive oil, for drizzling", "salt and freshly ground black pepper ", "½ mango, skin and stone removed, chopped", "1 tsp dried chilli flakes", "1 tbsp soy sauce", "1 tbsp honey", "1 tbsp fresh coriander, chopped", "2 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the ceviche, place the thinly sliced sea bass onto a serving plate and sprinkle over the lime zest, then drizzle over the lime juice, olive oil, and season with salt and freshly ground black pepper. Cover and leave to marinate for ten minutes (no longer) in the fridge. ", "For the lime and mango salsa, mix all the ingredients together in a bowl and then transfer to a small serving dish.", "To serve, transfer the marinated sea bass onto a serving plate and serve with the salsa."]}, {"isVegetarian": true, "title": "Chai-spiced ginger and date tea loaf", "url": "www_bbc_co_uk_food_recipes_chai-spiced_ginger_and_38256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp chai tea", "100g/3½oz chopped dates", "60g/2¼oz unsalted butter, plus extra for greasing ", "135ml/4½fl oz full-fat milk, preferably organic", "60g/2¼oz soft dark brown sugar", "2 large free-range eggs, beaten", "15g/½oz fast-action dried yeast", "450g/1lb strong white flour", "pinch salt", "50g/1¾oz stem ginger in syrup, chopped, plus 2-3 tbsp syrup from the stem ginger for the glaze", "1 tbsp green cardamom pods, seeds only", "3 black cardamom pods, seeds only", "pinch black peppercorns", "1 whole star anise pods", "50g/1¾oz unsalted butter ", "50g/1¾oz jaggery (or palm sugar)", "1 tbsp ground cinnamon", "1 tsp ground ginger", "1 tbsp vanilla bean paste"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dates, in a small saucepan bring 150ml/5fl oz of water to the boil. Add the tea and boil for a minute. Strain the tea into a bowl and add the chopped dates. Set aside for ten minutes and then drain the dates using a sieve.", "Grease and line a 20cm/8in, round, loose-bottomed spring-form cake tin.", "For the dough, melt the butter in a small pan and warm the milk in a separate pan.", "In a bowl, combine the warm milk, butter, sugar and eggs. Stir in the yeast until thoroughly mixed. Set aside for five minutes. ", "Put the flour and salt in the bowl of a free-standing mixer fixed with a dough hook. Add the yeast mixture, drained dates and chopped stem ginger and mix to a soft, smooth and shiny dough. ", "For the spice blend, while the dough is mixing, crush the green and black cardamom seeds with the black pepper and star anise in a small pestle and mortar. Transfer to a small bowl and combine with the butter, jaggery (or palm sugar), cinnamon, ginger and vanilla paste to make a spreadable spiced butter. Set aside.", "When the dough is ready, roll it quite thin and at least 60cm/23½in long. With your fingers or the back of a spoon, spread the spiced butter all over the top of the dough. Roll up, quite tightly, from the long side, like a Swiss roll. ", "Cut into 3 x 20cm/8in long pieces and arrange them vertically on the counter. Plait the pieces in a simple three-braid plait. Carefully lift the plait and arrange it in a circle around the inside of the prepared cake tin. There may be a little gap in the centre but this will fill in as the bread proves. Cover the top of the tin with cling film and place in a warm place to prove for one hour. ", "Preheat the oven to 180C/fan oven 160C/350F/Gas 4.", "Place the tin in the oven and bake for about 35 minutes, or until golden-brown. While it is still hot, brush the top generously with the ginger syrup. Allow to cool in the tin for 10 minutes before sliding a butter knife around the edge of the tin to release it. ", "Remove the baking paper and leave on a cooling rack until completely cool."]}, {"isVegetarian": true, "title": "Chai bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_chai_bread_and_butter_75754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15 green cardamom pods", "8 cloves", "1 tsp freshly grated nutmeg (roughly half a whole nutmeg) ", "1½ tsp ground ginger", "½ tsp flaked sea salt", "400ml/14fl oz whole milk", "150g/5½oz golden caster sugar, plus 1 heaped tbsp for sprinkling", "1 tsp vanilla extract", "2 tbsp Indian leaf tea, preferably Assam", "1 long strip orange peel", "1 cinnamon stick, broken in half", "300g/10½oz brioche loaf, thickly sliced (or 10 slices of crustless, thickly cut white bread)", "50g/1¾oz softened butter, plus extra for greasing", "125g/4½oz mixed dried fruit", "4 large free-range egg yolks", "2 large free-range eggs", "300ml/10fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the cardamom pods and cloves in a pestle and mortar and pound for about a minute, or until the pods are split and the cloves are roughly crushed. Tip into a medium non-stick saucepan and add the nutmeg, ginger, salt and milk. Stir in the sugar, vanilla, leaf tea, orange peel and cinnamon stick. Bring to a gentle simmer and cook over a low heat for five minutes, stirring occasionally. Remove the pan from the heat and leave to stand for 10 minutes.", "Butter a 1.75-2 litre/3-3½ pint shallow ovenproof dish – a round one looks good. Spread one side of each slice of brioche with softened butter. Arrange the brioche slices in the dish, butter side up and slightly upright but leaning against each other, scattering the mixed dried fruit between the slices as you go.", "Whisk the egg yolks, whole eggs and cream together in a large jug or bowl until smooth. Strain the infused milk through a fine sieve onto the egg mixture and stir well to combine. Discard the spices and peel.", "Pour the creamy liquid slowly over the buttered brioche. (The bread will float, so press it down gently with a spatula for a few seconds to help it absorb the custard.) Leave to stand for 15 minutes. ", "Meanwhile, preheat the oven to 180C/350F/Gas 4. ", "Place the dish in a roasting tin. Pour boiled water into the roasting tin around the outside of dish to come half way up the sides. Sprinkle the pudding with sugar and bake for 35-40 minutes, or until the custard is just set, but still just a little creamy in the centre, and the bread is golden-brown and crisp on top. ", "Remove from the oven and carefully lift out of the roasting tin. Serve hot with cream, custard or good vanilla ice cream."]}, {"isVegetarian": true, "title": "Chai muffins", "url": "www_bbc_co_uk_food_recipes_chai_muffins_06244", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chai_muffins_06244_16x9.jpg", "ingredients": ["225ml/8fl oz unsweetened almond milk", "2 Chai teabags", "1 tsp ground cinnamon", "400g/14oz white spelt flour", "2½ tsp baking powder", "150g/5½oz soft light brown sugar", "75g/2½oz natural skin-on almonds, roughly chopped", "2 large free-range eggs", "150ml/5fl oz sunflower oil"], "serves": "Makes 12 muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Warm the almond milk with the contents of the 2 teabags (I just rip them open over the pan) and cinnamon – stirring to mix – and leave to cool.", "While the milk’s cooling, preheat the oven to 200C/180C Fan/Gas 6 and line a 12-hole muffin tin with paper cases.", "In a large bowl, measure out the flour, baking powder, sugar and all but 2 tablespoons of the chopped almonds, and combine well.", "When the milk has cooled, add the eggs and oil, then whisk well. ", "Add the liquid ingredients to the dry ingredients, using a wooden spoon. Don’t be too efficient about this: a slightly lumpy batter makes for lighter muffins. Divide the mixture between the muffin cases (it will fill them well), then sprinkle equally with the remaining almonds and bake for 20–25 minutes, or until a cake tester comes out clean and the muffins are slightly risen and pleasingly golden-brown on top.", "Remove to a wire rack to cool for about 10 minutes before devouring."]}, {"isVegetarian": true, "title": "Chamomile and mint tea", "url": "www_bbc_co_uk_food_recipes_chamomile_and_mint_tea_05991", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chamomile tea bags", "2 tbsp fresh mint leaves, plus extra for serving", " 1tbsp hyssop leaves, plus extra for serving", "1 litre/1¾ pints freshly boiled water"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the tea bags, mint and hyssop leaves into a tea pot and add the hot water. Steep for at least 5 minutes. ", "Serve the tea with the extra mint and hyssop leaves."]}, {"isVegetarian": true, "title": "Champ", "url": "www_bbc_co_uk_food_recipes_champ_67444", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/champ_67444_16x9.jpg", "ingredients": ["1.35kg/3lb potatoes, well scrubbed and left whole in their jackets", "290ml/½ pint milk", "85g/3oz butter", "salt and white pepper", "1 large bunch spring onions, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in salted water until soft.  Drain and remove from the pan.  Leave until just cool enough to peel.  Mash thoroughly. ", "Boil the milk and add to the potato, together with the spring onions.", "Season and stir well.  ", "Pile into a serving dish.", "Make a well in the centre and add the butter. Serve immediately."]}, {"isVegetarian": false, "title": "Chana gosht (rump with chickpeas with naan bread)", "url": "www_bbc_co_uk_food_recipes_chana_gosht_-_lamb_rump_99176", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp cumin seeds", "2 tbsp coriander seeds", "10 green cardamom pods, bruised", "4 black cardamom pods, bruised", "8 cloves", "½ tsp nutmeg powder", "4 blades of mace", "1 tbsp black pepper", "2 star anise", "4 bay leaves", "1 dried red chilli ", "150g/5½oz dry chickpeas, soaked in water overnight", "1 bay leaf", "1 black cardamom pod", "1 clove", "1 tsp salt", "100ml/3½fl oz vegetable", "6 cloves", "2 bay leaves", "3 black cardamom pods", "200g/7oz onions, sliced", "15g ginger-garlic paste", "1 tbsp coriander powder", "1 tsp mild red chilli powder", "1 tsp cumin powder", "1 tsp salt", "200g/7oz tomatoes, chopped", "2 tbsp coriander leaves, chopped", "½ tsp Punjabi garam masala", "1 tbsp sugar", "1 medium free-range egg", "300ml/10fl oz full-fat milk", "375g/13oz plain flour", "1 tsp baking powder", "½ tbsp salt", "2 tbsp vegetable oil", "3 tbsp melted ghee", "4 x 100g/3½oz lamb rump steaks ", "1½ tbsp Punjabi garam masala ", "salt, to taste", "1 red onion, sliced", "100g/3½oz baby plum tomatoes, sliced", "¼ cucumber, sliced ", "2 tbsp chopped fresh coriander leaves", "1 lime, juice only"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["To make the garam masala, put all the ingredients in a dry pan over medium heat, shaking the pan to toast the spices evenly.", "Cool the spices for a minute and tip them into an electric blender and grind to fine powder, or use a pestle and mortar. Pass through a sieve and set aside.", "To cook the chickpeas, drain away the soaking water. Put the chickpeas in a pan of clean water with the bay leaf, cardamom, clove and salt and boil until cooked. Set aside until required.", "For the sauce, in a clean pan heat the oil and gently fry the cloves, bay leaf and black cardamom. Add the onions and cook until translucent. Add the ginger-garlic paste and cook well. Add dried powdered spices, salt, tomatoes and enough water to cover the mixture add the chickpeas and simmer for 30 minutes, or until the gravy thickens.", "For the naan bread, preheat the oven to 225C/200C fan/Gas 8 and place a thick baking tray into the oven to heat.", "Whisk together the sugar, egg and milk in a mixing bowl. In a separate bowl, combine the flour, baking powder and salt.", "Add the milk mixture to the flour mixture and knead lightly to make a soft dough - take care not to work the dough too much or it will become too stretchy. ", "When all the ingredients are mixed thoroughly, cover with a damp cloth and leave to rest, in a warm place, for 15 minutes. ", "Once rested, pour over the oil and knock the air out of the dough.", "Divide the dough into 8 equal-sized balls and roll out into a circle of approximately 10cm/4in diameter.", "Spread the circles on the hot tray in the oven. Bake for 4-5 minutes - you might need to turn the bread to ensure it is all cooked. You will also most likely need to cook the bread in batches. Brush with melted ghee.", "For the lamb, turn the oven down to 200C/180C Fan/Gas 6.", "Sear the rump on a hot pan to colour it on all sides. Dust the rump with the garam masala mixed with salt. Roast in the oven for 5-7 minutes, remove and rest for 3-4 minutes then slice.", "In a bowl, mix together the garnish ingredients.", "Put the chickpeas on a serving dish and sit the sliced lamb on top. Top with the garnish and serve hot with the naan bread."]}, {"isVegetarian": false, "title": "Charentais melon, prosciutto, wild rocket and pecorino salad", "url": "www_bbc_co_uk_food_recipes_charentaismelonprosc_7353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 slices prosciutto", "1 charentais melon", "8-12 wild rocket leaves", "75ml/2½fl oz virgin olive oil", "sea salt and freshly ground black pepper", "100g/3½oz pecorino cheese"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the outer skin from the melon. Cut in half and remove and discard the seeds. Slice the melon thinly and arrange on the serving plate, together with the sliced prosciutto. Wash and drain the wild rocket, and sprinkle a few leaves over the top.", "Using a potato peeler, shave the pecorino cheese over the salad, drizzle with olive oil and a little sea salt before serving."]}, {"isVegetarian": false, "title": "Chard and leek soup", "url": "www_bbc_co_uk_food_recipes_chardandleeksoup_79330", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5½oz chard leaves, chopped", "3 baby leeks, chopped", "200ml/7fl oz chicken stock", "55ml/2fl oz double cream", "2 slices pancetta, chopped and fried until golden"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan. Add the chard and leeks and cook for three minutes.", "Add the chicken stock, bring to the boil and cook for a further five minutes.", "Add the double cream and stir well.", "To serve, place the soup in a bowl and top with the cooked pancetta."]}, {"isVegetarian": true, "title": "Charentais melon rasayana", "url": "www_bbc_co_uk_food_recipes_charantaismelonrasay_86646", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz Charentais melon flesh, skin removed, chopped", "225ml/8fl oz fresh or canned coconut milk ", "2 tbsp sugar, or to taste ", "1 pomegranate, fleshy seeds only", "2 handfuls crushed ice ", "1 handful flaked almonds, lightly toasted in the oven until just golden"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the melon pieces into a deep bowl. Using your fingers, crush them so that they are no longer regular in shape and start to  leak out their wonderful juice, but do not let them become mushy. ", "Add the coconut milk and sugar and mix well. The colour should be a beautiful pale peach.", "Stir in the pomegranate seeds and chill in the fridge until ready to serve. ", "To serve, place a tablespoon of crushed ice in the bottom of each of six serving bowls and top with the rasayana. Sprinkle over the flaked almonds."]}, {"isVegetarian": false, "title": "Chargrilled beef fillet with cabbage and truffle mash", "url": "www_bbc_co_uk_food_recipes_chargrilled_beef_fillet_50966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 180–200g/6–7oz pieces beef fillet, ideally cut as a circle from the centre of the fillet", "2 tbsp olive oil", "1 bunch fresh thyme, finely chopped", "1 rosemary sprig, leaves only", "2 garlic cloves, finely chopped", "salt and freshly ground black pepper", "1 tsp olive oil", "1 shallot, finely chopped", "5 black peppercorns ", "300ml/10fl oz Port", "1 litre/1¾ pints beef stock", "15g/½oz butter, chopped", "10g black winter truffles, sliced", "350g/12oz ready-rolled puff pastry", "1 free-range egg yolk, beaten", "15g/½oz butter", "250g/9oz chestnut mushrooms, quartered", "½ tsp olive oil", "1 savoy cabbage, finely shredded", "50ml/2fl oz double cream", "1kg/2lb 4oz potatoes, peeled and chopped", "100g/3½oz butter ", "250ml/9fl oz double cream ", "250ml/9fl oz milk ", "4 sprigs fresh thyme", "4 tbsp olive oil ", "40g/1½oz chicken liver parfait"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Rub the beef with the oil and season with salt and pepper. Put in a sealable container with the thyme, rosemary and garlic. Rub the meat with the marinade. Seal the container and leave in the fridge for 1–2 hours.", "To make the sauce, heat the oil and gently cook the shallot until softened. Add the peppercorns and Port. Cook until reduced in volume by a third.", "Add the stock and simmer for 20 minutes, or until reduced to a sauce-like consistency. Pass through a sieve into a clean saucepan. Season and whisk in the butter. Add the truffle slices. ", "For the pastry and mushrooms, preheat the oven to 200C/180C Fan/Gas 6. Cut four 7cm/2½in-diameter circles from the pastry. Brush with the egg and bake for 10 minutes, or until golden brown. ", "Heat the butter in a frying pan and cook the mushrooms until soft. Season to taste.", "For the cabbage, heat the oil in a clean saucepan and gently cook the cabbage until tender. Mix in the cream and season. Set aside.", "For the mashed potatoes, put the potatoes into a pan of cold, salted water and bring to the boil. Simmer for 15–20 minutes, or until cooked. Drain and put back into the pan to dry in the heat. ", "Mash the potatoes. Heat the butter and cream in a saucepan. When hot, add to the potatoes with the milk. Mash and season. ", "Take the beef out of the fridge and bring it to room temperature. Wipe away the marinade.", "Heat a griddle pan until very hot. Rub the beef with a little more oil and cook in the pan for a few minutes, then turn and cook for a few more minutes to make a criss-cross pattern. Turn the beef again, cook for a few minutes and repeat, until done to your liking. Remove from the pan and rest on a clean plate for 3–5 minutes.", "For the garnish, fry the thyme sprigs in the oil, or until crispy.", "To serve, place a large spoon of creamed cabbage in the centre of each serving plate. Spoon a generous amount of sauce around the cabbage. On top of the cabbage stack a pastry disc, then the mushrooms, then the beef. Garnish with a quenelle of chicken liver parfait and the crispy thyme and serve with the mashed potato."]}, {"isVegetarian": true, "title": "Chargrilled broccoli pasta with chilli and garlic", "url": "www_bbc_co_uk_food_recipes_chargrilled_broccoli_69096", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_broccoli_69096_16x9.jpg", "ingredients": ["100g/3½oz spaghetti", "3 tbsp olive oil", "100g/3½oz broccoli, cut into small florets", "1 garlic clove, finely sliced", "½ red chilli, finely sliced", "1 tbsp flaked almonds", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil and cook the spaghetti for 8 minutes, until al dente. ", "Meanwhile, heat the olive oil in a saucepan over a high heat and add the broccoli. Leave it for 1 minute before moving so the broccoli chars, then turn and char on the other sides for about 3 minutes. ", "Add the garlic, chilli and almonds and stir-fry for a further 3 minutes. Season with salt and pepper. ", "Drain the spaghetti and add to the broccoli pan, stir well to combine and serve. "]}, {"isVegetarian": false, "title": "Chargrilled gammon with parsnip, potato and bacon rösti, poached egg and mustard hollandaise", "url": "www_bbc_co_uk_food_recipes_chargrilled_gammon_with_65680", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 rashers back bacon", "1 potato, grated", "1 parsnip, cored and grated", "1 tbsp chopped fresh parsley", "50g/1¾oz unsalted butter", "1 tbsp olive oil ", "1 free-range egg yolk", "1 lemon, juice only", "110g/4oz butter", "1 tbsp wholegrain mustard", "½ tsp salt", "2 thick slices gammon", "2 tbsp sunflower oil", "1 tsp salt", "1 tsp white wine vinegar", "2 free-range eggs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the bacon in a dry frying pan until crisp. Drain on kitchen paper and roughly chop. ", "Put the potato and parsnip on a clean tea towel and squeeze over a bowl to remove the excess liquid. Place in a separate bowl and mix in the bacon and parsley.", "Melt the butter and oil in a frying pan over a medium heat. Add the potato mixture and press it down with the back of a spoon. Season with salt and pepper. Fry for 2-3 minutes on each side, using a fish slice to carefully turn it over, until crisp and golden-brown.", "For the hollandaise, melt the butter in a saucepan over a low heat, then skim off the froth to leave a clear yellow liquid. Put the egg yolk, lemon juice and one tablespoon water in a blender. Turn on the machine and slowly pour the warm clarified butter through the lid. Add the mustard and salt and blend.", "For the gammon, heat a large griddle pan over a medium-high heat and cook the gammon for 2-3 minutes on each side, until cooked through.", "For the poached egg, heat a large saucepan of simmering water, add the salt and vinegar and spin the water. Crack an egg into the pool of water and cook for 2-3 minutes, or until your liking. Repeat with the second egg. ", "Place a rösti on a plate. Top with chargrilled gammon and a poached egg and pour over the hollandaise."]}, {"isVegetarian": false, "title": "Chargrilled mackerel with new season pumpkin and romesco sauce", "url": "www_bbc_co_uk_food_recipes_chargrilled_mackerel_93477", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz toasted almonds", "30g/1oz toasted walnuts", "200g/7oz roasted, skinned red peppers from a jar such as piquillo", "¼ tsp hot smoked paprika", "¼ tsp cayenne pepper", "1 slice stale sourdough bread", "1 tsp tomato paste", "sherry vinegar to taste (about 2 tsp) ", "2 tbsp extra virgin olive oil", "sea salt and freshly ground black pepper", "olive oil", "1/5 small new season pumpkin, such as Ironbark, skin and seeds removed, cut into 1cm/½ in dice", "8 small porcini mushrooms, cleaned and trimmed and cut into thick slices                 ", "1 small hispi cabbage, cut into wedges and core removed", "juice of half a lemon", "4 thick mackerel fillets, cut into 2 on the angle and skin scored"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the romesco sauce put all the ingredients in a blender, season and blend until you have a coarse purée. Set aside.", "Heat a splash of olive oil in a sauté pan over a medium heat. Add the pumpkin and season well. Cook slowly for 5-6 minutes until lightly browned and just tender. Set aside.", "Heat a large griddle pan over a medium heat. Drizzle the porcini and cabbage wedges with oil and cook in the grill pan, turning as you go, until just cooked and lightly charred. Remove from the pan, squeeze over a little lemon juice and set aside.", "Clean the griddle pan and turn up to maximum heat. Rub the mackerel with olive oil and season well. Place skin side down and cook for 3 minutes to lightly char before turning and cooking for a further 2 minutes. The mackerel should still be a little pink.", "To serve, pile the porcini, pumpkin and cabbage onto a plate then top with the grilled mackerel and spoon around the romesco sauce."]}, {"isVegetarian": false, "title": "Chargrilled octopus with an artichoke salad", "url": "www_bbc_co_uk_food_recipes_chargrilled_octopus_with_73135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz octopus", "3 sprigs fresh thyme", "1 onion, thickly sliced", "2 bay leaves", "1 carrot, roughly chopped", "1 stalk celery, roughly chopped", "1 garlic bulb, cut in half horizontally", "8 black peppercorns, left whole", "4 tbsp olive oil", "1 red chilli, seeds removed and sliced", "1 lemon, zest and juice only", "2 tbsp fresh mint, roughly chopped", "2 tbsp fresh parsley, roughly chopped", "2 sprigs fresh thyme", "250ml/9fl oz chicken stock", "6 baby artichokes, peeled and choke removed, sliced", "1 fennel bulb, thinly sliced on a mandolin, fronds reserved ", "15g/½oz rocket leaves", "15g/½oz baby spinach", "1 tbsp Cabernet Sauvignon vinegar", "1 tsp clear honey", "3 tbsp extra virgin olive oil", "1 tbsp fresh parsley, chopped", "1 red chilli, thinly sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled octopus, place all the ingredients in a large saucepan and cover with water. Bring to the boil and simmer for 1½-2 hours.", "Remove from the pan and discard the vegetables, set aside the octopus to cool.", "Once cool, cut the octopus into pieces and place in a large bowl. Add the marinade ingredients and leave for at least two hours.", "For the artichoke salad, heat a large frying pan or sauté pan and add the thyme, stock and artichoke. Cover with a lid on and cook for 5-6 minutes.", "Heat a large griddle pan until hot. Place the marinated octopus on the griddle and cook for 1-2 minutes on each side, or until bar marks appear.", "Place the cooked baby artichokes and fennel slices and fronds in a large bowl along with the rocket and spinach.", "Place the vinegar, honey and oil in a small bowl and mix.", "Add the octopus and dressing to the salad and mix.", "To serve, place the salad into shallow serving bowls and sprinkle over the parsley and chilli."]}]