[{"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas grandes, más o menos picadas", "3 dientes de ajo, finamente picados", "1 cucharadita de jengibre molido", "½ cucharadita de pimienta blanca molida", "¼ cucharadita de canela molida", "¼ cucharadita de clavo de olor, aproximadamente roto", "pizca generosa de azafrán, empapado en un poco de agua", "300 ml / 10 fl oz de caldo de pollo o agua", "1 pollo entero, unido en 8 piezas", "2 limones preservados, cortados en tiras", "20 aceitunas verdes", "2 cucharadas de perejil fresco, finamente picado", "2 cucharadas de cilantro fresco, finamente picado"], "method": ["Caliente el aceite de oliva en un tagine grande, una cazuela o una sartén honda. Agregue las cebollas y suavemente a fuego medio hasta que estén suaves y ligeramente doradas.", "Agregue el ajo junto con todas las especias. Cocine por un minuto más, luego empuje todo a un lado en la sartén. Agregue las piezas de pollo con la piel hacia abajo y freír durante unos minutos en cada lado. Sazonar con sal y luego verter sobre el caldo o el agua.", "Llevar a ebullición y luego reducir el fuego. Cubra y cocine a fuego lento por alrededor de 45 minutos, o hasta que el pollo esté a punto de caerse del hueso. Voltee el pollo regularmente para evitar que se pegue.", "Agregue la mitad de los limones y las aceitunas en conserva y cocine a fuego lento sin tapar durante 5 minutos. Agregue el perejil y el cilantro justo antes de servir. Adorne con el limón conservado restante y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_tagine_with_27957", "title": "Tagine de pollo con limón en conserva y aceitunas verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas medianas, finamente picadas", "3-4 dientes de ajo, finamente picados", "algunas ramitas de cilantro fresco, finamente picado", "½ manojo de perejil fresco de flatleaf, finamente picado", "4 cucharadas de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida", "2 cucharaditas de jengibre molido", "5 cucharaditas de canela", "½ cucharadita de cúrcuma molida", "10 patas de pollo, despellejadas, enjuagadas con agua corriente fría y secadas con palmaditas", "pellizcar el azafrán", "1 cubo de caldo de pollo", "Ciruelas secas de 150g / 5½oz", "6 cucharadas de azúcar", "150 g / 5½ oz de albaricoques secos", "100 g / 3½ oz de almendras, blanqueadas, peladas y tostadas"], "method": ["En un tazón grande, mezcle la mitad de la cebolla, la mitad del ajo, la mitad del cilantro y la mitad del perejil. Agregue 2 cucharadas de aceite de oliva, el jugo de limón, 1 cucharadita de jengibre, 1 cucharadita de canela y la cúrcuma y sazone bien con sal y pimienta negra recién molida. Frote las patas de pollo con la mezcla para cubrir.", "Cubra el recipiente con film transparente y déjelo marinar durante 2-3 horas o, para obtener los mejores resultados, durante la noche en el refrigerador.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente 1 cucharada de aceite de oliva en una sartén. Freír el pollo en ambos lados hasta que esté ligeramente dorado y reservar.", "Pon el aceite de oliva restante, la cebolla, el ajo y 1 cucharadita de jengibre en un tagine o en una olla a prueba de horno con tapa. Revuelva la mezcla y coloque el pollo encima.", "Calentar el azafrán en una sartén seca y espolvorear sobre el pollo. Espolvoree un poco de pimienta negra recién molida y 2 cucharaditas de canela sobre el pollo y agregue un chorrito de agua. Desmenuce el cubo de caldo en el agua y espolvoree con el perejil y el cilantro frescos restantes.", "Hornee en el horno con la tapa puesta durante aproximadamente 1 hora, o hasta que esté tierno.", "En una cacerola, cubrir las ciruelas secas con agua y llevar a ebullición. Agregue la mitad del azúcar y 1 cucharadita de canela. Baje el fuego y deje que las ciruelas pasen a fuego lento hasta que estén caramelizadas.", "En otra sartén, cubrir los albaricoques con agua y llevar a ebullición. Agregue el resto del azúcar y el resto de la canela. Baje el fuego y deje que los albaricoques hiervan a fuego lento hasta que estén caramelizados.", "Controle la tajine regularmente, asegurándose de que la salsa no se seque.", "Para servir, adornar el tagine con las ciruelas pasas y los albaricoques y las almendras tostadas."], "url": "www_bbc_co_uk_food_recipes_chicken_tagine_with_65235", "title": "Tagine de pierna de pollo con ciruelas, albaricoques y almendras tostadas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_tagine_with_65235_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "6 muslos grandes de pollo", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "Jengibre fresco de la raíz de los 5cm / 2in, rallado", "½ cucharadita de azafrán", "1 cucharadita de cúrcuma molida", "1 cucharadita de cilantro molido", "1 Tbsb al trono", "½ ramita de canela", "500ml / 18fl oz de caldo de pollo", "1 chile rojo, finamente cortado", "2 tomates, toscamente picados", "2 cucharadas de miel clara", "2 cucharadas de hojas de menta picadas", "2 cucharadas de cilantro picado", "25g / 1oz de mantequilla", "sal y pimienta", "150 g / 5½ oz de trigo bulgur, empapado en agua fría durante la noche", "3 cucharadas de menta picada", "3 cucharadas de cilantro picado", "½ cebolla roja, finamente picada", "50 g / 1¾oz de pistachos, toscamente picados", "100g / 3½oz de almendras peladas enteras", "100 g / 3½ oz de albaricoques secos, toscamente picados", "1 granada, solo semillas", "2 limones, solo jugo"], "method": ["Para el tagine de pollo, caliente una olla grande de fondo grueso hasta que esté caliente. Agregue un poco de aceite de oliva y los muslos de pollo, con la piel hacia abajo, y freír hasta que estén dorados, luego voltee y dore en el otro lado antes de transferirlos a un plato.", "Agregue la cebolla, el ajo y el jengibre a la sartén y fría a fuego lento durante 2-3 minutos.", "Agregue todas las especias y cocine por un minuto, luego devuelva el pollo a la sartén y mezcle bien para cubrir.", "Agregue el caldo, el chile, los tomates y la miel y deje que hierva.", "Reduzca el fuego a fuego lento, cubra y cocine durante 20 minutos, o hasta que el pollo esté bien cocido.", "Agregue la menta y el cilantro, luego agregue la mantequilla. Sazonar, al gusto, con sal y pimienta.", "Para el tabbouleh de granada, escurra bien el trigo bulgur, presione ligeramente hacia abajo para asegurarse de que se haya eliminado todo el agua, luego coloque en un tazón grande.", "Agregue todos los demás ingredientes y mezcle bien, luego revise el condimento, agregue sal y pimienta al gusto.", "Para servir, amontone el tabbouleh en los platos y coloque sobre el plato un muslo de pollo y un poco de salsa."], "url": "www_bbc_co_uk_food_recipes_chicken_tagine_with_76052", "title": "Tagine de pollo con tabbouleh de granada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 3-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1,4 kg / 3 lb de pollo, carne extraída y picada, piel y huesos descartados", "110g / 4oz de jamón sin ahumar, picado", "Paletilla de cerdo de 300g / 11oz, picada", "Rabadilla de ternera de 300g / 11oz, picada", "300 ml / 11 fl oz crema doble, muy frío", "1 huevo de gallinas camperas", "75ml / 3fl oz de Armagnac o Cognac (opcional)", "2 cucharadas de hojas frescas de tomillo", "200ml / 7fl oz de vino blanco seco", "3 cucharaditas de sal", "pimienta negra recién molida", "100 g / 4 oz de mantequilla", "2 chalotes, finamente picados", "4 cucharadas de perejil fresco picado", "4 cucharadas de cebolletas frescas picadas", "2 cucharadas de estragón fresco picado", "1 pechuga de pollo de 250 g / 9 oz, cortada en tiras de 1 cm / ½ pulgada", "250 g / 9 oz de grasa de cerdo (disponible de su carnicero), en rodajas finas", "1 pan crujiente de pan, en rodajas, tostado"], "method": ["Pique el pollo, el jamón, la carne de cerdo y la ternera dos veces en una picadora usando un disco de cuchilla de picadora de tamaño mediano. Alternativamente, corta la carne en pedazos pequeños con un cuchillo afilado.", "Coloque la carne picada en un recipiente bien frío, ponga en un tazón grande de hielo y revuelva con una cuchara de madera hasta que esté bien combinada.", "Agregue la crema, el huevo, el Armagnac o el Cognac (si está usando), el tomillo y el vino blanco hasta que estén bien combinados.", "Agregue la sal y sazone al gusto con pimienta negra recién molida. Esto se llama farsa.", "Calienta 40 g / 1½ oz de la mantequilla en una cacerola pequeña y freír las chalotas durante 2-3 minutos, luego se deja enfriar. Agregue las hierbas.", "Derretir la mantequilla restante en una olla pequeña y retirar del fuego.", "Sumerja las tiras de pechuga de pollo en la mantequilla derretida, luego sumérjalas en la mezcla de chalote y hierbas hasta que estén bien cubiertas. Dejar de lado en un plato.", "Cubra las terrinas con tiras de grasa de cerdo.", "Extienda la mitad de la farsa en el fondo de las terrinas, luego agregue una capa de tiras de pechuga de pollo, cubra con la farsa restante y luego más rebanadas de grasa de cerdo.", "Cubra con la tapa y deje enfriar en la nevera durante 2 horas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las terrinas en una bandeja grande para hornear y llene a medias la bandeja de hornear con agua hirviendo.", "Cocine las terrinas durante 30 minutos sin cubrir, luego cubra con las tapas y cocine por otros 15 minutos.", "Retire las terrinas del horno, retire las tapas y coloque un tablero con peso (peso máximo de 250 g / 9 oz) en las terrinas para comprimirlas suavemente hasta que se hayan enfriado por completo. Dejar enfriar en la nevera.", "Servir con pan crujiente tostado."], "url": "www_bbc_co_uk_food_recipes_chicken_terrine_with_86075", "title": "Terrina de pollo con hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 14-16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["salpicaduras de aceite vegetal", "8 muslos de pollo, deshuesados, con piel", "sal", "3 yemas de huevo grandes de gallinas camperas", "15 g / ½ oz de azúcar en polvo", "½ vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "625 g / 1 libra de guisantes congelados 6 oz, descongelados", "Crema doble 25ml / 1fl oz", "100 g / 3½ fl oz de guisantes crudos frescos", "1 chalote, finamente picado", "½ manojo de mejorana, hojas recogidas", "pizca de curry en polvo", "pellizcar jengibre molido", "salpicaduras de aceite de oliva", "8-12 brotes de guisantes, para adornar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente una sartén a prueba de horno hasta que esté caliente, agregue un poco de aceite vegetal y fría el pollo, con la piel hacia abajo, hasta que la piel esté dorada. Transfiera la bandeja al horno y cocine por otros 15 minutos o hasta que esté cocida. Retirar del horno, sazonar al gusto con sal y dejar reposar en un lugar cálido.", "En un recipiente, mezcle las yemas de huevo, el azúcar y las semillas de vainilla.", "Blanquee 375 g / 13 oz de los guisantes congelados en una sartén de agua hirviendo con sal, luego drene y transfiera a una licuadora. Pulso a un puré.", "Caliente la crema y los guisantes en una cacerola, luego vierta sobre la mezcla de yema de huevo. Regrese el contenido a la cacerola y bata la mezcla a fuego medio hasta que espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Vierta en un tazón, cubra la superficie de la crema pastelera con film transparente para evitar que la piel se forme y se refrigere.", "Pon los guisantes congelados restantes en una licuadora y pulsa un par de veces para formar una pasta áspera. Agregue los guisantes frescos, el chalote y la mejorana. Sazone con curry en polvo, jengibre y sal, luego agregue un poco de aceite de oliva, al gusto, y mezcle.", "Para servir, vista cada plato con unas cucharadas de crema de guisantes, dos muslos de pollo y la ensalada de guisantes. Adorne con dos o tres brotes de guisantes."], "url": "www_bbc_co_uk_food_recipes_chicken_thighs_with_pea_92612", "title": "Muslos de pollo con crema de guisantes y ensalada de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800 g / 1 lb 12 oz piernas o pechugas de pollo sin hueso", "150g / 5½ oz de yogur", "50 g / 1¾oz de mantequilla sin sal", "80g / 2¾oz de jengibre fresco picado", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "½ cucharadita de chile en polvo, más extra si es necesario", "¼ cucharadita de cúrcuma", "2 limas, solo jugo", "2 cucharadas de puré de tomate", "½ cucharadita de polvo de garam masala", "50ml / 2fl oz de aceite", "sal y pimienta blanca, al gusto", "1 chile verde, sin semillas y finamente picado", "Pastel de 200g / 7oz", "2 cucharadas de tallos de cilantro fresco, picado", "1 cucharadita de cilantro molido", "100 g / 3½ oz de estilo griego sencillo o yogur vivo, a temperatura ambiente", "160ml / 5½fl oz de leche, a temperatura ambiente", "1-2 cucharaditas de sal", "1-2 cucharaditas de azúcar", "500g / 1lb de harina blanca de 2oz (preferiblemente piedra-molido orgánico), tamizada", "1 cucharada colmada de polvo de hornear", "3 cucharadas de aceite de colza extra virgen, más extra para amasar", "1 cucharada de mantequilla", "semillas de nigella y semillas de amapola, para dispersar (opcional)", "2 cucharadas de cilantro fresco, picado", "1 cebolla, finamente rebanada", "2 cucharadas de cilantro fresco, picado", "2 cucharadas de hojas de menta fresca picadas"], "method": ["Cortar el pollo en cubos lo suficientemente grandes como para ser ensartado (aproximadamente 4 cm / 1½ en cubos). Frote la sal y la pimienta en el pollo y reserve.", "En una licuadora, agregue la mitad del yogur y todos los demás ingredientes. Mezcle hasta obtener una pasta suave. Transfiera a un tazón grande y mezcle con el yogur restante. Pruebe comprobar si hay picante y agregue más chile si lo prefiere.", "Mezcle el pollo en la mezcla de yogur. De ser posible, deje el pollo para adobar en la nevera durante la noche, o al menos 4-5 horas.", "Para cocinar el pollo, precaliente una parrilla a fuego medio alto o prepare una barbacoa. (Si no hay otra opción, puede usar un horno configurado a su temperatura más alta). Pase las piezas de pollo por los pinchos de metal.", "Ase el pollo durante 8-10 minutos, rociando de vez en cuando con el adobo de yogur. Para verificar que el pollo esté bien cocido, toma una de las piezas más grandes y córtala a la mitad. Si no hay signos de color rosa y los jugos corren claros, el pollo está cocido.", "Para el relleno naan, ponga todos los ingredientes en una licuadora y pulse para formar una pasta espesa y suave.", "Para el pan naan, combine el yogur, la leche, la sal y el azúcar con 200 ml / 7 fl oz de agua.", "Tamiza la harina y el polvo de hornear en un tazón grande y haz un pozo en el centro. Vierta el líquido y 2 cucharadas de aceite de colza. Mezcle para formar una masa suave.", "Amasar durante 5-6 minutos, o hasta que la masa parezca irregular y se vuelva lisa. Cubra el recipiente con una toalla de té húmeda y déjelo a un lado para comprobarlo durante 30-40 minutos. Retire la masa y amasar durante un minuto o dos, luego regrese al recipiente. Cubra y deje en un lugar cálido durante 1-2 horas.", "Engrase ligeramente una superficie de trabajo y divida la masa en 4-6 bolas. Usando sus dedos o un rodillo engrasado, aplaste cada bola en una forma redonda de aproximadamente 1 cm / ½ pulgadas de espesor. Coloque 2 cucharadas de la mezcla de relleno en el centro de cada naan y doble por la mitad, presionando los bordes para encerrar el relleno. Mantenga las bolas restantes de masa debajo de la toalla de té húmeda mientras trabaja.", "Caliente una sartén grande y seca con una tapa bien ajustada a fuego medio. Transfiere un círculo de masa a la sartén y cúbrelo con la tapa. Cocine el naan durante 3-4 minutos. Cuando esté dorado, moteado e hinchado, voltéelo y cocine el otro lado durante 3-4 minutos. Repita con la masa restante.", "Mientras los panes naan se cocinan, derrita la mantequilla y mezcle con el aceite de colza restante. Tan pronto como los naans estén cocidos, esparza generosamente con la mezcla derretida de mantequilla y espolvorea con sal marina, semillas de nigella y semillas de amapola. Dejar de lado por unos minutos.", "Alternativamente, precaliente su horno a 250 ° C / 230 ° Ventilador / Gas 9. Coloque un naan crudo en una bandeja grande para hornear y hornee en el estante superior de a uno por vez. Gire cuando vea que el pan sube y sopla. Una vez dorado en ambos lados, aplique la mezcla de mantequilla como se indica arriba.", "Para la ensalada, combine todos los ingredientes en un tazón.", "Para servir, esparza los naans con cilantro picado y sirva con el pollo tikka y la ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_tikka_and_naan_30521", "title": "Tikka de pollo y pan naan", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 corona grande de pollo sin piel (1 kg / 2 lb 4 oz)", "½ limón, solo jugo", "Jengibre fresco de la raíz de los 5cm / 2in, finamente rallado", "4 dientes de ajo grandes, rallados", "2 cucharadas de polvo de curry Madras medio", "2 cucharaditas colmatadas de pimentón ahumado", "gran pizca de sal", "100g / 3% C2% BDoz% 200 %% 20fat% 20Greek-style% 20yoghurt% 20% 20", "1 cucharada de aceite de girasol", "2 cebollas grandes, finamente picadas", "2 dientes de ajo grandes, rallados", "Jengibre fresco de la raíz de 2.5cm / 1in, finamente rallado", "1 cucharadita de cúrcuma molida", "2 cucharaditas de pimentón molido", "2 cucharaditas de cilantro molido", "1 cucharada de puré de tomate", "400g de tomates cortados en lata", "1 pimiento rojo grande, sin corazón, sin semillas, finamente picado", "1 pimiento verde grande, sin corazón, sin semillas, finamente picado", "150g / 5% C2% BDoz% 200 %% 20fat% 20plain% 20yoghurt% 20", "2 cucharadas de cilantro finamente picado", "sal marina y pimienta negra recién molida", "1 cebolla roja pequeña, finamente picada", "2 tomates grandes, finamente picados", "⅓ pepino (150 g / 5½ oz), finamente picado", "½ lima, solo jugo", "1 cucharadita de chaat masala", "hojas de cilantro, aproximadamente desgarradas", "Arroz basmati de 320 g / 11½ oz, cocinado con sal y una pizca de hebras de azafrán (opcional)"], "method": ["Coloque el pollo en un tazón grande u otro plato no reactivo y barra las pechugas de pollo.", "Para el adobo, mezcle todos los ingredientes en un tazón pequeño. Extiende el adobo por toda la corona. Cubra con film transparente y colóquelo en el refrigerador para marinar durante la noche, o al menos 4 horas.", "Cuando esté listo para cocinar el pollo, precaliente el horno 140C / 120C Ventilador / Gas 1. Coloque el pollo marinado en un plato para asar y póngalo sobre el adobo restante. Hornea por 2 horas. (No se cocinará bien en esta etapa).", "Mientras tanto, prepara la salsa de curry. Calentar el aceite en una sartén grande. Mezcle las cebollas y cocine por 10 minutos, o hasta que estén doradas, agregando un chorrito de agua a la sartén si comienzan a pegarse. Agregue el ajo y el jengibre con un chorrito de agua, mezcle bien y cocine durante 1 minuto. Agregue las especias con un poco de sal y pimienta y cocine por otro minuto.", "Agregue el puré de tomate y cocine por un minuto más, luego incline los tomates en lata y vierta en 300 ml / 10 fl oz de agua. Llevar a ebullición, reducir el fuego a fuego lento y cocinar por 5-10 minutos. Agregue los pimientos picados y cocine por otros 5 minutos, luego retírelos del fuego.", "Saca el pollo del horno. Cuidadosamente agite el soplete de un cocinero sobre la superficie hasta que el adobo se haya ennegrecido levemente en algunos lugares. Dejar de lado por 10 minutos.", "Para la ensalada katchumber, mezcle todo en un bol y reserve.", "Quite las pechugas de pollo del hueso y corte la carne en trozos, aproximadamente 2,5 cm / 1 in. Vuelva a calentar la salsa de curry, luego agregue el pollo y cocine a fuego lento durante 5 minutos, o hasta que las piezas estén cocidas.", "Revuelva a través del yogur y el cilantro picado. Prueba para verificar el condimento.", "Sirva espolvoreado con cilantro, con arroz azafrán, si se usa, y la ensalada katchumber al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_tikka_masala_11482", "title": "Pollo tikka masala", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_tikka_masala_11482_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de sal masala", "1 cucharada de pimentón", "aceite vegetal, para freír", "4 pechugas de pollo, despellejadas, deshuesadas y cortadas en trozos del tamaño de un bocado", "200g / 7oz de arroz basmati", "1 cucharadita de cúrcuma molida, polvo de curry o pizca de hebras de azafrán (opcional)", "1 manojo de cebollas de primavera, cortadas y en rodajas finas", "2cm / ¾ en pieza de raíz de jengibre fresco, pelado y rallado", "2 dientes de ajo, finamente picados", "340 ml / 11 fl oz crema individual o yogur (opcional)", "200 g / 7 oz de pasta de tomate o puré", "2 cucharaditas de mostaza inglesa en polvo", "hojas frescas de cilantro o perejil, para adornar", "sal y pimienta negra recién molida", "4 tomates de ciruela en rodajas", "1 cebolla roja, en rodajas", "2 cucharadas de cilantro fresco picado", "azúcar pizca", "pizca de sal"], "method": ["Caliente una sartén grande a fuego medio a alto. Agregue el garam masala y el pimentón. Tueste durante un par de minutos y luego coloque las especias en un plato y déjelas a un lado.", "Rocíe un poco de aceite en la sartén. Agregue el pollo y fría, revolviendo de vez en cuando, hasta que se dore por todas partes, esto debería tomar aproximadamente 5 minutos.", "Mientras tanto, pon el hervidor de agua. Pon el arroz en una cacerola tapada de tamaño medio y agrega la cúrcuma. Vierta suficiente agua hervida para que quede a unos 2 cm por encima del arroz. Cubra con la tapa y deje que hierva. Reduzca el fuego a bajo y cocine según las instrucciones del paquete.", "Dale un poco de revolviendo el pollo, añade las cebolletas, el jengibre y el ajo, la crema, la pasta de tomate, la mostaza en polvo y las especias tostadas. Revuelva la salsa y déjela burbujear a fuego medio o bajo hasta que el pollo esté cocido, esto tomará entre 15 y 20 minutos.", "Comprueba que el arroz esté tierno y haya absorbido toda el agua. Fluff it up con un tenedor, y sazone con sal y pimienta. Cúbralo con la tapa y manténgalo caliente.", "Cuando el pollo esté cocido, pruebe la salsa, agregue más calor (con pimentón) o condimento. Si la salsa es demasiado espesa, agregue un poco de agua; si es demasiado delgada, déjela burbujear un poco más para espesar.", "Justo antes de servir, prepare la ensalada. Pon todos los ingredientes en un tazón grande y mezcla.", "Divida el arroz entre cuatro platos y cubra con el curry. Esparce sobre algunas hojas de cilantro y sirve junto con la ensalada."], "url": "www_bbc_co_uk_food_recipes_chicken_tikka_masala_35350", "title": "Tikka masala de pollo con ensalada de cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz preparado, pollo cocido tikka, en rodajas", "50g / 1¾oz de lentejas marrones o verdes en lata, escurridas y enjuagadas", "50g / 1¾oz de pepino, en rodajas finas", "2 cebollas de primavera, en rodajas finas", "puñado de cilantro fresco, toscamente picado (opcional)", "1 cucharada de tzatziki confeccionado"], "method": ["Combine el pollo, las lentejas, el pepino, las cebolletas y el cilantro, si se usa, en un plato. Sirve con el tzatziki."], "url": "www_bbc_co_uk_food_recipes_chicken_tikka_salad_70502", "title": "Ensalada de pollo tikka", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 alitas de pollo", "125ml / 4fl oz de vino blanco seco", "1 ramita de tomillo", "6 setas de botón", "1 litro / 1¾ pintas de caldo de pollo blanco", "4 cucharadas de crema fresca", "Crema doble de 200 ml / 7 fl oz", "250g / 9oz de papas harinas cocidas", "2 huevos de gallinas camperas", "1 cucharada de mantequilla", "100 g / 3½ oz de camembert, cortado en cubos", "2 cucharadas de harina normal", "8 cucharadas de pan rallado seco", "sal y pimienta negra recién molida", "algunas virutas de trufa, para servir"], "method": ["Coloque las alitas de pollo en una sartén con vino, tomillo, champiñones y caldo. Llevar a ebullición y cocine a fuego lento durante 30 minutos.", "Cuele el caldo en otra sartén. Recorte el exceso de piel de las alas y coloque las alas en una bandeja para hornear. Cubra con película adhesiva y luego coloque otra bandeja encima de eso. Coloque los pesos en la parte superior y presione y enfríe en la nevera hasta que sea necesario.", "Pase el caldo por un colador fino en una olla limpia. Coloque a fuego medio y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crème fraîche, crema doble y sazone con sal y pimienta. Mezcle con una batidora de mano hasta que aparezca espuma. Mantenga caliente hasta que esté listo para servir.", "Precalentar una sartén de plancha a caliente. Retire los huesos de las alas, luego la plancha hasta que estén crujientes por todos lados.", "Para hacer las croquetas, pasa la papa a través de un ricer de patata. Agregue un huevo, la mantequilla y el camembert. Mezclar bien.", "Batir el huevo restante en un recipiente poco profundo.", "Enrolle la mezcla de papa en cilindros, luego enrolle la harina, luego el huevo batido y luego el pan rallado.", "Precaliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las croquetas hasta que estén doradas.", "Divida el velouté entre dos cuencos hondos, raspe con una pequeña trufa y sirva con el pollo a la parrilla y las croquetas."], "url": "www_bbc_co_uk_food_recipes_chicken_velout_soup_with_87349", "title": "Sopa de velouté de pollo con croqueta de queso y trufa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "2 cebollas grandes, cortadas en cubitos", "8 muslos de pollo, hueso y piel eliminados", "1 cucharada de harina normal", "Nueces descascaradas de 600 g / 1 lb 5 oz, finamente molidas en un procesador de alimentos", "3 cucharadas de azúcar en polvo", "450ml / 16fl oz de melaza de granada", "1 granada, solo semillas, para adornar", "sal marina y pimienta negra recién molida", "500g / 1lb 2oz de arroz basmati", "llovizna de aceite de oliva ligero", "60 g / 2¼ oz de mantequilla", "sal marina copos"], "method": ["Caliente una cacerola grande a fuego medio. Vierta el aceite vegetal y fría las cebollas hasta que estén translúcidas y ligeramente doradas.", "Sazonar el pollo en ambos lados con sal y pimienta negra recién molida y agregar a la sartén. Aumente la temperatura y revuelva bien para asegurarse de sellar los muslos en ambos lados. Una vez que estén ligeramente dorados, apaga el fuego y déjalo a un lado.", "Calentar otra cacerola grande a fuego medio alto y tostar la harina hasta que se torne beige pálido. Agregue las nueces molidas y cocine la mezcla.", "Agregue 1,2 litros / 2 pintas de agua a la sartén, mezcle bien y hierva la mezcla a fuego lento, luego cubra con una tapa y cocine durante una hora a fuego medio-bajo. Esto cocinará las nueces y suavizará su textura; una vez que vea que los aceites naturales de las nueces suben a la superficie, la mezcla se cocina.", "Agregue la melaza de azúcar y granada y mezcle bien durante aproximadamente un minuto. Tenga cuidado de remover bien la melaza de granada ya que tardará un tiempo en disolverse.", "Agregue el pollo y las cebollas a la mezcla de nueces y granadas, cubra y cocine durante aproximadamente 2 horas, revolviendo a fondo cada 30 minutos para asegurarse de que las nueces no se peguen a la base de la sartén.", "Para el arroz, ponga a hervir una olla grande de agua. Agregue el arroz y una generosa pizca de sal. Hierva durante 6-8 minutos hasta que el arroz esté hervido. (El arroz está parcialmente hervido cuando el arroz es de un color blanco brillante y los granos han comenzado a ablandarse). Escurra el arroz y enjuague con agua fría por un par de minutos.", "Alinee la parte inferior de la olla utilizada para cocinar el arroz con papel de hornear antiadherente. Regrese a la placa y vierta el aceite, la mantequilla y una cucharada de sal marina triturada. Esparce el arroz en la olla. No sobrecargue el arroz, quiere que la ligereza del arroz que cae permita que el vapor se eleve.", "Envuelva la tapa de la sartén con una toalla de té (para bloquear el vapor y lograr un sello seguro y hermético). Asegúrese de que la toalla de té se mantenga lejos de las llamas.", "Cocine el arroz a fuego lento durante 45 minutos-1 hora. Los granos deben hincharse cuando estén cocidos. Voltea el arroz en un plato para servir, luego saca el crujiente tahdig (arroz en el fondo de la olla) y colócalo encima.", "Sirva el pollo junto con el arroz cubierto con semillas de granada."], "url": "www_bbc_co_uk_food_recipes_chicken_walnut_and_84591", "title": "Guiso de pollo, nuez y granada con arroz basmati persa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Chalotes de 250 g / 9 oz (los pequeños no chalotes de plátano)", "Pollo fresco listo para el horno 1.35kg / 3lb", "½ limón, reducido a la mitad", "1 hoja de laurel grande", "1 cucharada de tomillo fresco finamente picado", "25g / 1oz de mantequilla", "1 cucharada de aceite de girasol", "40 dientes de ajo (de 2 a 3 bulbos) sin pelar", "Vermouth de 150 ml / 5 fl oz", "250ml / 9fl oz de caldo de pollo (hecho con 1 cubo de reserva)", "2 cucharadas de hojas de estragón fresco picado", "100 ml / 3½ fl oz crema doble o crema", "sal marina escamada y pimienta negra recién molida", "1 baguette", "1 kg / 2 libras 4 oz de papas medianas y harinosas, preferiblemente Maris Piper o King Edward", "75 g / 2½ oz de mantequilla", "Lonchas de tocino rayado ahumado sin corteza 100g / 3½oz, cortadas en piezas de 2cm / ¾in", "300g / 10½oz de col rizada fresca", "6 cebolletas, cortadas y finamente rebanadas", "Crema doble de 200 ml / 7 fl oz", "sal marina escamada y pimienta negra recién molida"], "method": ["Precalienta el horno a 200C / 400F / Gas 6. Coloca las chalotas en un recipiente a prueba de calor, cúbrelas con agua recién hervida y déjalas reposar durante cinco minutos. Esto hará que las máscaras sean más fáciles de eliminar.", "Retire cualquier cadena del pollo y coloque el limón y la hoja de laurel dentro de la cavidad. Generoso sazonar el pollo por dentro y por fuera con abundante sal marina copos y pimienta negra recién molida. Espolvoree con el tomillo picado por todos lados.", "Derrita la mantequilla con el aceite en una cacerola a prueba de llamas grande. Dorar el pollo a fuego medio-alto por un par de minutos en cada lado.", "Escurra las chalotas y, una vez que estén lo suficientemente frías como para manejarlas, pele la piel y recorte, reduciendo a la mitad las más grandes. Agregue los dientes de ajo y los chalotes enteros a la cazuela, acurrucándose alrededor del pollo.", "Vierta el vermut y el caldo de pollo. Cubra la cazuela con una tapa hermética y deje que el líquido hierva a fuego lento sobre la placa, luego transfiéralo al horno por 1 ¼ horas o hasta que el pollo esté bien cocido y el ajo esté completamente ablandado.", "Transfiera el pollo, el ajo y los chalotes a un plato caliente y cubra con un trozo de papel de aluminio y un par de toallas de té secas. Sosteniendo la cacerola con una tela de horno, incline el licor de pollo hacia un lado. Elimine cualquier grasa que salga a la superficie y deséchela.", "Regrese la cazuela a la placa y agregue el estragón y la crema (o crema fresca). Llevar a fuego lento a fuego lento, revolviendo. Cocine por tres minutos. Sazone al gusto y vierta en una jarra calentada.", "Para el colcannon, pele las papas y córtelas en trozos de igual tamaño. Ponga en una olla grande y cubra con agua fría. Llevar a ebullición y cocinar durante unos 15 minutos, o hasta que esté muy tierno. Prueba con la punta de un cuchillo.", "Mientras las papas se cocinan, recorte los tallos gruesos y corte la mayor parte de la vena central resistente de cada hoja de col rizada. Raspe finamente las hojas y lave en un colador con agua corriente fría. Desagüe.", "Caliente 25 g / 1 oz de la mantequilla en una sartén grande antiadherente y fríe el tocino y la col rizada durante cuatro minutos, revolviendo regularmente hasta que la col rizada esté tierna. Si aún es un poco difícil después de cuatro minutos, agregue un par de cucharadas de agua fría y continúe cocinando por un par de minutos más. Agregue las cebollas de primavera y cocine por un minuto, revolviendo.", "Escurra las papas en un colador grande y vuelva a la cacerola. Deje reposar por un par de minutos. Caliente la crema y la mantequilla restante en una sartén pequeña. Mash las papas cocidas con la crema y la leche hasta que quede suave y sazone al gusto. Use un juego de batidores eléctricos si desea que su puré sea realmente esponjoso y ligero.", "Incline la col rizada suavizada en la misma sartén y mezcle hasta que esté ligeramente combinada. Transfiera a un plato calentado.", "Tallar el pollo en trozos gruesos y servir con la salsa y colcannon. Exprime el ajo de su piel y extiende sobre el pan como la mantequilla."], "url": "www_bbc_co_uk_food_recipes_chicken_with_40_cloves_22211", "title": "Pollo con cuarenta dientes de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_40_cloves_22211_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "2 cucharadas de aceite", "6 pechugas de pollo pequeñas deshuesadas", "6 chalotes de plátano, descuartizados longitudinalmente", "Harina normal de 30g / 1oz", "400ml / 14fl oz de caldo de pollo", "1½ cucharadas de hojas de tomillo limón picado", "12 lanzas de espárragos, extremos de madera arrancados", "1 limón grande, solo jugo", "200ml / 7fl oz crema de grasa", "2 cucharadas de perejil picado", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente la mitad de la mantequilla y la mitad del aceite en una sartén grande, profunda y resistente al horno. Sazonar las pechugas de pollo con sal y pimienta y freír, en tandas si es necesario, durante 2 minutos en cada lado hasta que estén doradas. Retire de la sartén y reserve.", "Agregue la mantequilla restante y el aceite a la sartén, incline las chalotas y fría a fuego alto durante 5-10 minutos o hasta que estén ligeramente doradas.", "Coloque la harina en un recipiente, mezcle en 8 cucharadas de caldo y mezcle hasta que quede suave. Agregue a la sartén y hierva, luego vierta el caldo restante. Agregue el tomillo de limón y devuelva el pollo a la sartén.", "Cubra con una tapa y cocine en el horno durante unos 20 minutos, o hasta que el pollo esté bien cocido.", "Justo antes de servir, recorte la punta de cada lanza de espárragos y corte el tallo en longitudes cortas y parejas. Cocine las puntas y los tallos en rodajas en agua hirviendo con sal durante 2-3 minutos. Drene, reservando los consejos para una guarnición.", "Revuelva el jugo de limón, la crème fraîche y el perejil en la sartén con el pollo. Agregue los tallos de espárragos en rodajas y deje hervir. Retire el pollo, corte cada pechuga en tres y organice en un plato. Vierta la salsa y coloque dos puntas de espárragos en una cruz sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_chicken_with_asparagus_44206", "title": "Pollo con espárragos y salsa crème fraîche de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_asparagus_44206_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75ml / 2½ fl oz aceite de colza", "1 pollo grande, unido en ocho piezas", "sal y pimienta negra recién molida", "200g / 7oz de panceta, cortada en cubitos", "Chalotes de 200g / 7oz, pelados y cortados por la mitad", "1 bulbo de ajo, cortado por la mitad", "500g / 1lb 2oz de setas (rebozuelos, girolles, ceps, champiñones, morelles), limpios", "50 g / 1¾oz de mantequilla sin sal", "50 ml / 2 fl oz en Madeira", "500ml / 18fl oz de caldo de pollo oscuro", "300ml / 10½ fl oz crema doble", "1 manojo de estragón fresco", "1kg / 2lb 4oz de patatas Maris piper, peladas y cortadas en trozos", "300ml / 10½fl oz de leche entera", "300ml / 10½ fl oz crema doble", "150 g / 5½ oz de mantequilla sin sal, más extra para aderezar las judías verdes", "150 g / 5½ oz de judías verdes finas, recortadas"], "method": ["Para el pollo con salsa cremosa de champiñones, caliente una sartén grande y agregue la mitad del aceite. Sazone las piezas de pollo con sal y pimienta. Una vez que el aceite esté caliente, cocine el pollo hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue la panceta al sartén en el que se cocinó el pollo, y fría hasta que esté crujiente, luego agregue los chalotes, el ajo y los champiñones y cocínelos durante 2-3 minutos.", "Regrese el pollo a la sartén y cocine por dos minutos.", "Agregue la mantequilla, Madeira, caldo, crema y estragón y cocine a fuego lento durante 15-20 minutos. Retire la cabeza de ajo antes de servir.", "Para el puré de papa, coloque las papas en una sartén grande con agua con sal y deje que hierva. Cocine durante 15-20 minutos, o hasta que esté suave cuando se prueba con la punta de un cuchillo.", "Escurra las papas y colóquelas de nuevo en la sartén para dejar que se disipe el vapor. Mash y agregue la leche, la crema y la mantequilla y mezcle hasta que quede suave.", "Caliente una olla de agua hirviendo y pula los frijoles, revuelva en agua helada.", "Caliente una sartén pequeña y agregue unos cuantos panecillos de mantequilla, una vez derretidos agregue los frijoles y cocine por unos minutos hasta que los frijoles estén cubiertos de mantequilla y tiernos.", "Para servir, coloca el puré en tazones para servir con el pollo, la salsa y las judías verdes."], "url": "www_bbc_co_uk_food_recipes_chicken_with_a_creamy_29335", "title": "Pollo con salsa cremosa de champiñones y puré de patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo grande alimentado con maíz, unido en 8 piezas", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "110g / 4oz de chorizo, pelado y rebanado", "3 pimientos rojos, cortados en cuadrados de 2.5cm / 1in", "2 dientes de ajo, aplastados", "1-2 cucharadas de salvia fresca picada", "2 cucharaditas de tomillo fresco picado", "1 limón, en jugo, zested", "2 berenjenas grandes, cortadas en trozos de 2.5cm / 1in", "125ml / 4fl oz de aceite de oliva", "2 cebollas rojas, finamente picadas", "4 tomates de ciruela, sin semillas y en cubitos", "2 cucharadas de vinagre de vino tinto", "buen comino pinch", "puñado de hojas de albahaca, desgarrado", "puñado de hojas de cilantro, recogidas de tallos", "1 cucharada de piñones, ligeramente tostados en una sartén", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas4.", "Sazonar las piezas de pollo con sal y pimienta negra recién molida. Caliente dos cucharadas de aceite de oliva en una sartén grande y dore el pollo en ambos lados durante 4-5 minutos. Cuando todas las piezas de pollo estén bien doradas, sáquelas de la sartén y déjelas a un lado.", "Caliente la cucharada restante de aceite de oliva en la misma sartén y cocine el chorizo ​​durante 2-3 minutos. Agregue los pimientos, el ajo, la salvia y el tomillo a la sartén y cocine por otros 2-3 minutos. Incline el chorizo ​​y los pimientos en una lata para asar y coloque los trozos de pollo encima.", "Extienda la ralladura de limón y el jugo de medio limón sobre el pollo. Hornee en el horno durante 30-40 minutos, voltee las piezas de pollo a la mitad del tiempo de cocción, o hasta que el pollo esté cocido.", "Mientras tanto, para la berenjena con especias, ponga las berenjenas en un colador, agregue aproximadamente ½ cucharadita de sal y déjelas escurrir durante media hora.", "Calienta 35ml / 1fl oz del aceite de oliva en una sartén y freír las cebollas rojas durante cinco minutos, o hasta que estén blandos. Agregue los tomates y cocine durante otros cinco minutos, o hasta que los tomates se hayan descompuesto en una salsa espesa. Sazonar con sal y pimienta negra recién molida, luego retirar de la sartén y reservar.", "Agregue tres cucharadas de aceite de oliva a la sartén y fría la mitad de las berenjenas durante 4-5 minutos, o hasta que estén tiernas. Retire las piezas de berenjena y déjelas a un lado para escurrirlas sobre papel de cocina. Agregue las tres cucharadas restantes de aceite a la sartén y fría las piezas restantes de berenjena durante 4-5 minutos, o hasta que estén tiernas.", "Regrese la mezcla de berenjena, tomate y cebolla a la sartén y agregue el vinagre de vino tinto, el comino, la albahaca y el cilantro. Sazone al gusto con sal y pimienta negra recién molida y espolvoree sobre los piñones.", "Para servir, coloca la berenjena en un plato y coloca el pollo al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_with_chorizo_17191", "title": "Pollo con chorizo, pimientos y salvia con berenjena con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_chorizo_17191_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½ oz de calabaza o carne de patata dulce, cortada en cubos", "1 pechuga de pollo sin piel pequeña (110 g / 3¾oz), más o menos picada", "5 tomates cherry", "1 cebolla muy pequeña (50g / 1¾oz de peso pelado), aproximadamente picada", "1 cucharadita de condimento cajún o fajita", "2 cucharaditas de aceite de oliva", "4 cucharadas de yogur natural sin grasa", "1 cucharadita de salsa de menta"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque la calabaza, el pollo, los tomates y la cebolla en un bol. Agregue el condimento de Cajun y el aceite y mezcle bien.", "Transfiera la mezcla a un plato refractario. Hornee durante 20-30 minutos o hasta que el pollo y las verduras estén cocidos.", "Para hacer el aderezo, mezcle el yogur y la salsa de menta en un tazón pequeño.", "Justo antes de servir, vierta el aderezo sobre el pollo y las verduras."], "url": "www_bbc_co_uk_food_recipes_chicken_with_butternut_57086", "title": "Pollo con calabaza, tomates cherry y aderezo de yogur de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_butternut_57086_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla sin sal ablandada", "1 limón grande, ralladura y jugo", "6 filetes de anchoa salados en aceite, finamente picados", "2 cucharaditas de harissa", "1 diente de ajo, aplastado", "½ cucharadita de semillas de cilantro, ligeramente tostadas en una sartén seca", "2 pechugas de pollo, con la piel puesta", "sal y pimienta negra recién molida", "aceite de oliva", "1 manojo de berros", "50g / 1¾oz de almendras saladas Marcona", "1 cucharada de pasas amarillas suaves", "3 cebollas tiernas, en rodajas finas", "vinagre de vino tinto, al gusto"], "method": ["Para la mantequilla de limón y anchoa, coloque la mantequilla en un recipiente y agregue la ralladura de limón, los filetes de anchoas, el ajo, las semillas de cilantro y una cucharadita de harissa. Aplástelos todos juntos y agregue el jugo de limón poco a poco. Verifica el condimento.", "Tome una doble capa de papel de aluminio. Coloque la mantequilla en forma de salchicha larga en un extremo y enróllela. Luego gire los extremos de la lámina en direcciones opuestas para formar un rollo apretado. Enfriar durante cuatro horas en la nevera para establecer.", "Para el pollo, precaliente el horno a 180C / 350F / Gas 4.", "Sazone el pollo con sal y pimienta y frote la harissa restante sobre la piel. Caliente una sartén pesada a prueba de horno en la placa junto con un chorrito de aceite. Una vez caliente, coloque el pollo con la piel hacia abajo y freír durante varios minutos hasta que esté ligeramente coloreado.", "Transfiera al horno y cocine por 30 a 40 minutos, o hasta que el pollo esté bien cocido. Retirar del horno y dejar reposar de 5 a 10 minutos en la olla de cocción, manteniéndolo caliente.", "Para servir, rasgue la parte superior de hojas de berros del racimo y ponga en una ensaladera. Agregue las almendras, las pasas y las cebolletas. Sazone con sal y pimienta y rocíe un poco de aceite de oliva y vinagre de vino tinto. Mezcle bien y apile en un plato para servir. Corta los senos por la mitad y apila en la parte superior de la ensalada. Finalmente, derrita unas rodajas finas de limón y mantequilla de anchoas y rocíe sobre el pollo."], "url": "www_bbc_co_uk_food_recipes_chicken_with_harissa_29438", "title": "Pollo con harissa, limón y mantequilla de anchoas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz muslos de pollo y baquetas", "sal y pimienta negra", "50g / 1¾oz de harina natural", "150ml / 5fl oz de aceite de oliva virgen extra", "1 bulbo de ajo, clavos separados y magullados", "1 gran puñado de ramitas de romero fresco", "150ml / 5fl oz de vino blanco seco", "1 pan de ciabatta, en rodajas", "2 cucharadas de aceite de oliva", "1 diente de ajo, pelado y reducido a la mitad"], "method": ["Sazonar las piezas de pollo con sal y pimienta y polvo con harina normal.", "Ponga el aceite de oliva en una sartén grande de base pesada y colóquelo a fuego medio-alto. Cuando esté caliente, agregue el pollo enharinado y fríalos durante 1-2 minutos por cada lado, o hasta que estén dorados y crujientes.", "Reduzca el fuego a medio-bajo, agregue el ajo y la mayor parte del romero (reserve unas hojas para decorar). Cubra con una tapa y cocine por 30 minutos, volteando el pollo de vez en cuando.", "Levante el fuego a lo alto, quite la tapa, agregue el vino y cocine a fuego lento hasta que se haya evaporado.", "Comprueba que el pollo esté cocido; la carne debe desprenderse fácilmente del hueso y no debe haber ningún signo de rosa cuando se perfora la parte más gruesa. Elimine cualquier aceite de la parte superior y reserve.", "Calentar una sartén y untar las rodajas de ciabatta. Ase el pan en ambos lados hasta que esté crujiente. Inmediatamente frótelos con el ajo y rocíe con un poco del aceite reservado del sartén de pollo.", "Sirve el pollo con la bruschetta. Adorne con algunas hojas de romero."], "url": "www_bbc_co_uk_food_recipes_chicken_with_garlic_36940", "title": "Pollo con ajo, romero y bruschetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, sin piel", "Harina normal de 40 g / 1½ oz", "50g / 1¾oz de mantequilla", "2 cucharadas de aceite de oliva", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "160 g / 5¾oz de champiñones castaños, en rodajas", "250ml / 9fl oz seco Marsala", "150ml / 5fl oz de caldo de pollo", "pequeño puñado de perejil picado flatleaf", "sal y pimienta negra recién molida"], "method": ["Coloque las pechugas de pollo entre las hojas de film transparente y bata, usando un mazo para carne o un rodillo, hasta obtener un grosor de aproximadamente 5 mm. Sazone con sal y pimienta en ambos lados.", "Ponga la harina en un plato y sumerja el pollo en ella para cubrir ligeramente, sacudiendo cualquier exceso.", "Derretir la mitad de la mantequilla y el aceite en una sartén a fuego medio-alto y freír el pollo durante 2-3 minutos por cada lado hasta que se dore. Dejar de lado.", "Limpie la sartén con papel de cocina. Caliente la mantequilla y el aceite restante a fuego medio y fría la chalota y el ajo por unos 5 minutos hasta que se ablanden. Agregue los champiñones y cocine durante 2 minutos. Agregue Marsala y aumente el fuego a alto. Cocine hasta que el líquido se haya reducido en volumen a la mitad. Vuelva a bajar el fuego a medio, agregue el caldo y el pollo. Cocine por unos 10 minutos. Servir espolvoreado con perejil."], "url": "www_bbc_co_uk_food_recipes_chicken_with_marsala_60943", "title": "Pollo con Marsala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_marsala_60943_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ratatouille en lata 200g / 7oz", "80 g / 3 oz de pechuga de pollo asada, sin piel, picada", "15g / ½ oz de pan rallado fresco", "1 nivel de cucharadita de parmesano finamente rallado"], "method": ["Precalentar una parrilla a fuego medio.", "Coloque el pisto en una cacerola a fuego medio. Agregue el pollo y cocine hasta que burbujee y el pollo esté caliente. Transfiera a un plato pequeño a prueba de horno.", "Mezcle las migas de pan y el queso parmesano juntos y espolvoree sobre el pollo pisto. Grill hasta que se dore. Servir."], "url": "www_bbc_co_uk_food_recipes_chicken_with_ratatouille_20444", "title": "Pollo con ratatouille hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]