[{"ingredients": ["350g / 12oz de cerezas glaseadas rojas o naturales, cortadas en cuartos", "1 x 225 g de piña de lata en jugo natural, drenado y toscamente picado", "Albaricoques secos listos para el consumo 350 g / 12 oz, picados", "100 g / 3½ oz de almendras blanqueadas, más o menos picadas", "Sultanas 350 g / 12oz", "2 limones, ralladura fina solamente", "250g / 9oz de mantequilla sin sal ablandada", "250 g / 9 oz de azúcar en polvo", "5 huevos grandes de gallinas camperas, ligeramente golpeados", "Harina de auto aumento 250g / 9 oz", "75g / 2½ oz de almendras molidas", "Almendras molidas 250 g / 9 oz", "150 g / 5½ oz de azúcar en polvo", "150g / 5½oz de azúcar glas, tamizado, más extra para enrollar", "1 huevo de gallinas camperas (preferiblemente pasteurizado)", "1 cucharadita de esencia de almendra", "3 claras de huevo (preferiblemente pasteurizadas)", "675g / 1lb 8oz de azúcar glas, tamizado", "colorante de alimentos de gel en rosa oscuro y hoja de otoño", "4 hojas de gelatina", "4 cucharadas de glucosa líquida", "1½ cucharadita de glicerina", "500g / 1lb 2oz de azúcar glas", "colorante de alimentos en gel en verde menta"], "method": ["Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 3. Engrase una lata rectangular de 23x15 cm / 9x6 pulgadas. Alinee la base y los lados con una doble capa de pergamino para hornear.", "Coloque las cerezas en un colador y enjuague con agua corriente y luego escurra bien. Seque muy bien la piña y las cerezas con papel de cocina.", "Coloque todas las frutas y nueces en un tazón con la ralladura de limón y mezcle suavemente.", "En otro recipiente, unte la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Batir los huevos de a uno por vez, con una cucharada de harina para evitar que la mezcla se cuaje. Dobla la harina restante y las almendras molidas. Doble ligeramente las frutas y nueces y luego vierta la mezcla en la lata de torta preparada. Nivela la superficie.", "Hornee durante 2 horas, o hasta que estén doradas y una brocheta insertada en el centro del pastel salga limpia. Cubra la torta flojamente con papel de aluminio después de 1 hora para evitar que la parte superior quede demasiado oscura.", "Deje que se enfríe en la lata durante 15 minutos, luego sáquelo, despegue el pergamino y termine de enfriar en una rejilla de alambre.", "Para la pasta de almendras, mezcle las almendras molidas, el azúcar impalpable y el azúcar glas en un tazón. Agregue la esencia de huevo y almendra. Amasar en el recipiente para formar una pasta dura pero no amase demasiado ya que esto hará que la pasta se vuelva oleosa. Envuelva en una película adhesiva y reserve.", "Para el glaseado real, bata las claras de huevo en un tazón grande hasta que se vuelvan espumosas. Mezcle el azúcar glas tamizado una cucharada a la vez. Puede hacerlo con un batidor eléctrico de mano, pero mantenga la velocidad baja. Batir la guinda hasta que esté muy tieso y blanco y se levanta en picos. Cubra la superficie de la formación de hielo con film transparente.", "Para el fondant, coloque la gelatina, 2 cucharadas de agua, glucosa y glicerina en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento hasta que la gelatina se haya disuelto (no permita que el agua hierva o la gelatina se caliente demasiado). Retire del fuego.", "Tamiza la mitad del azúcar glas en un tazón grande. Haga un pozo en el centro, agregue la mezcla de gelatina y mezcle con una cuchara de madera. Tamiza el azúcar restante en la superficie de trabajo e inclina la mezcla sobre ella. Amasar juntos hasta que el fondant sea suave y flexible. Reserve una pieza de tamaño de pulgar del fondant blanco y envuélvala en film transparente. Poco a poco, agregue colorante de menta verde para el fondant restante y amasar hasta un color verde pistacho pálido. Envuelva en film transparente para evitar que se seque.", "Estirar la pasta de almendras en una superficie de trabajo ligeramente espolvoreada con azúcar glas, en un rectángulo un poco más grande que la torta. Recorte cuidadosamente un rectángulo de 23x15 cm / 9x6 pulgadas y colóquelo sobre una lámina de silicona espolvoreada con azúcar glasé (esto le permitirá deslizar la pasta de almendras sobre la torta, una vez que la torta se haya enfriado).", "Estirar el fondant verde en una superficie ligeramente espolvoreada con azúcar glas, hasta formar un rectángulo ligeramente más grande que la torta. Recorta con cuidado un rectángulo de 23x15 cm / 9x6 pulgadas y colócalo cuidadosamente encima de la pasta de almendras.", "Divida el glaseado real por igual entre 3 cuencos. Coloree un cuenco de color rosa pálido oscuro y coloree el segundo cuenco con un color dorado claro, utilizando el color de la hoja otoñal. Deja el tercer cuenco blanco.", "Coloque la mayor parte del glaseado real blanco en una manga pastelera equipada con una boquilla de escritura número 3. Pipe el contorno de una cancha de tenis en la parte superior de la pasta de azúcar verde, dejando un espacio de 2cm / ¾in en el borde.", "En una hoja de papel impermeable o una estera de silicona, trace el contorno de 2 pequeñas raquetas de tenis (aproximadamente 5cm / 2½ pulgadas) y una red de tenis de aproximadamente 12x3cm / 4½x1¼in (debe ser del mismo ancho que la cancha que canalizó sobre la torta ) Coloque el glaseado blanco restante en una manga pastelera equipada con una boquilla simple número 2 y coloque las cuerdas de la raqueta de tenis dentro del contorno de la raqueta de tenis y las cuerdas de la red dentro del contorno de la red. Deje secar hasta que pueda despegarlos del papel.", "Con una cuchara, coloca el glaseado rosa en una manga pastelera equipada con la boquilla número 8 estrellas y coloca el glaseado dorado en una manga pastelera equipada con la boquilla número 7 estrellas. Usando el glaseado rosa y dorado, coloque un borde decorativo alrededor del borde del fondant.", "Cuando el pastel se haya enfriado, levante suavemente la capa decorativa helada de pasta de almendras y fondant sobre el pastel.", "Pase una línea de hielo blanco por el centro de la cancha de tenis. Quita la red del papel antigrasa y pégala en la línea de glaseado, para que se levante sobre la torta. Coloque las raquetas de tenis con hielo en cada extremo de la cancha y, finalmente, saque una pequeña pelota de tenis del fondant reservado."], "url": "www_bbc_co_uk_food_recipes_tennis_cake_09325", "title": "Pastel de tenis", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 torta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tennis_cake_09325_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de sal", "Salsa de salsa teriyaki de 110ml / 4fl oz", "Filete de salmón de 450g / 1lb, en una pieza, huesos de alfiler y piel removida", "250 g / 9 oz de azúcar en polvo", "250ml / 9fl oz de vinagre de vino blanco", "1 chile rojo, dividido longitudinalmente", "2 pimientos rojos, semillas y núcleo retirados, en rodajas finas", "2 pimientos amarillos, semillas y núcleo retirados, en rodajas finas", "250g / 9oz de mantequilla sin sal", "110ml / 4fl oz de zumo de lima recién exprimido", "1 huevo de gallinas camperas", "75 g / 3 oz de yema de huevo (alrededor de 4 yemas)", "75ml / 3fl oz crema batida", "Pasta de wasabi 30 g / 1 oz", "150ml / 5fl oz salsa de adobo teriyaki", "110ml / 4fl oz de zumo de lima recién exprimido", "Pasta de wasabi 50 g / 2 oz", "aceite de sésamo, para cepillar", "2 cabezas bebé pak choi, hojas separadas", "1 cucharada de aceite de sésamo", "2 cucharadas de berro de coriandro", "1 cucharada de semillas de sésamo, tostadas"], "method": ["Para la salmuera teriyaki, coloca la sal y dos litros de agua en una sartén. Es muy importante pesar la sal con precisión. Llevar a ebullición con una tapa para evitar la evaporación.", "Retirar del fuego, dejar enfriar y luego enfriar. Agregue la salsa de adobo teriyaki.", "Coloque el salmón en una bandeja profunda de plástico o acero inoxidable y vierta sobre la salmuera teriyaki. Asegúrese de que el salmón esté completamente sumergido.", "Cubra y reserve en el refrigerador por 24 horas. Retire el salmón de la salmuera y seque con papel de cocina. Corta el salmón en cuatro porciones.", "Para los pimientos agridulces, coloque el azúcar, el vinagre de vino blanco y el chile rojo en una cacerola, lleve a ebullición, luego retire y deseche la guindilla.", "Agregue los pimientos en rodajas al líquido hirviendo agridulce.", "Retirar del fuego y dejar enfriar en el líquido. Los pimientos y el líquido se pueden almacenar en el refrigerador en esta etapa hasta que se requiera.", "Cuando sirva, escurra todo el exceso de líquido de los pimientos.", "Para el wasabi holandesa, derrita la mantequilla en una cacerola y déjela enfriar un poco.", "Coloque el jugo de lima, el huevo entero y las yemas de huevo en un tazón.", "Coloque el recipiente sobre una fuente de agua hirviendo (asegúrese de que el recipiente no toque el agua). Batir continuamente hasta que la mezcla esté tibia, espesa y ligera (la temperatura de los huevos debe ser de aproximadamente 80 ° C).", "Retire el recipiente del fuego y mezcle la mantequilla derretida, la crema y el wasabi. Sazonar con sal al gusto.", "Coloque un cuadrado de estopilla en un tazón limpio. Tamizar la salsa holandesa acabada a través de la gasa.", "Vierta la salsa holandesa tamizada en un bote de crema batida de 500 ml / 18 fl oz adecuado para preparaciones calientes.", "Cargue la batidora de crema con dos cargadores de gas. Agite vigorosamente y deje a temperatura ambiente hasta que se requiera.", "Para el glaseado teriyaki, mezcle la salsa de adobo teriyaki, el jugo de lima y la pasta de wasabi.", "Caliente una sartén hasta que esté caliente. Ligeramente cepille el salmón con un toque de aceite de sésamo.", "Planche el salmón en sus lados sin trinchar durante tres minutos por lado. Retire de la sartén de la plancha y cepille generosamente con barniz teriyaki.", "Deja el pak choi en una sartén tibia con el aceite de sésamo y un poco de agua. Sazonar con sal al gusto.", "Para servir, divida los pimientos agridulces entre cuatro platos para servir, apilándolos en el centro. Coloque las hojas de pak choi marchitas alrededor del plato.", "Coloque un trozo de salmón teriyaki encima de los pimientos.", "Espolvoree el berro de cilantro y las semillas de sésamo tostado sobre el salmón.", "Cuchara un poco del glaseado teriyaki alrededor del plato.", "Vigorosamente agite la holandesa en el bote de crema batida y eche tres cucharadas de holandesa en cada plato. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_teriyaki_glazed_salmon_24085", "title": "Teriyaki glaseado de salmón con pimientos agridulces y salsa holandesa de wasabi", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de ostra mixta y hongos shiitake", "600ml / 20fl oz de caldo de pollo", "25g / 1oz de mantequilla", "2 chalotes, finamente picados", "2 dientes de ajo, finamente picados", "100g / 3½ oz de arroz risotto", "100ml / 3½fl oz de vino blanco", "2 cucharadas de aceite de oliva", "4 cucharadas de salsa teriyaki", "2 cucharadas de mascarpone", "2 cucharadas de parmesano recién rallado", "200ml / 7fl oz de leche entera", "4 hojas de lima finamente picadas", "1 cucharadita de lecitina", "sal marina y pimienta negra recién molida", "4 filetes de salmonete"], "method": ["Prepare los champiñones quitando la suciedad, recortando los tallos y rasgando los grandes a la mitad.", "Vierta el caldo en una cacerola con los recortes / tallos de los champiñones y caliente.", "Caliente una sartén grande o saltee la sartén hasta que esté a fuego medio. Agregue un pomo de mantequilla, los chalotes y el ajo y fríe con cuidado durante un par de minutos antes de agregar el arroz. Revuelva bien, luego agregue el vino y cocine hasta que el líquido haya sido absorbido.", "Agregue un par de cucharadas de caldo a la vez, hirviendo a fuego lento entre cada adición hasta que el arroz haya absorbido todo el caldo. Repita hasta que se haya usado todo el caldo y el arroz esté tierno, debería tomar entre 12 y 15 minutos.", "Mientras el arroz se cocina, caliente una sartén antiadherente hasta que esté caliente. Agregue la mantequilla restante y una cucharada de aceite de oliva, agregue los champiñones y cocine a fuego alto hasta que estén dorados y tiernos.", "Agregue los champiñones al risotto y revuelva, luego agregue la salsa teriyaki, el mascarpone y el parmesano.", "Vierta la leche en una cacerola con las hojas de lima y lecitina y traiga a fuego lento. Mezcle con una batidora para crear una espuma.", "Limpie la sartén, regrésela al fuego y agregue lo último del aceite de oliva. Cocine el salmonete con la piel hacia abajo con la piel hacia abajo durante un minuto antes de voltearse y cocinar durante otros 30 segundos en el lado de la carne.", "Coloque el risotto en recipientes para servir, cubra con un filete de salmonete, con la piel hacia arriba, y termine con una cucharada de espuma de hoja de lima."], "url": "www_bbc_co_uk_food_recipes_teriyaki_mushroom_42335", "title": "Risotto de hongos Teriyaki con salmonetes y espuma de hoja de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 11fl oz de salsa teriyaki", "12 gambas crudas, sin cáscara, pero con la cabeza puesta", "175g / 6oz de langostinos crudos, pelados", "75g / 3oz de carne picada de cerdo", "1 cucharada de aceite de sésamo", "1 cucharada de jerez seco o vino de arroz", "¼ cucharadita de pimienta blanca molida", "1 cucharadita de azúcar en polvo", "1 cucharadita de sal", "Envoltorios de 16 gyoza (disponibles en los supermercados asiáticos)", "aceite vegetal, para freír", "4 rebanadas de pan blanco", "200g / 7oz de langostinos crudos, pelados", "1 huevo blanco de corral", "50 g / 2 oz de semillas de sésamo", "125ml / 4½fl oz de vinagre de arroz", "25 g / 1 oz de azúcar", "pizca de sal", "2 chiles rojos, finamente picados"], "method": ["Para los langostinos teriyaki, caliente una sartén hasta que esté caliente, agregue la salsa teriyaki y cocine hasta que se reduzca a la mitad, luego mezcle las gambas y continúe cocinando durante 1-2 minutos, o hasta que las gambas estén cocidas.", "Para el dim sum de gambas, mezcle las gambas y el cerdo en un pequeño procesador de alimentos para hacer un puré.", "Transfiera la mezcla a un recipiente, agregue los ingredientes restantes, excepto las envolturas, y mezcle hasta que estén bien combinados.", "Para armar la dim sum, coloque una cucharada pequeña de mezcla de gambas en el medio de una gyoza, luego doblar por la mitad y sellar los bordes con los dedos húmedos. Engarce para formar un borde ondulado.", "Cueza al vapor el dim sum durante 4-5 minutos, o hasta que esté cocido.", "Para las tostadas de gambas, caliente 2,5 cm / 1 en aceite vegetal en una olla profunda de fondo grueso hasta que un pequeño cubo de pan chisporrotee y se dore al dejar caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Precalentar la parrilla a alto.", "Tueste las rebanadas de pan en un lado y déjelas a un lado.", "Mezcle las gambas y la clara de huevo en un procesador de alimentos con un puré fino.", "Extienda la mezcla sobre el lado tostado del pan, luego esparza sobre las semillas de sésamo y presione ligeramente hacia abajo.", "Coloque el pan con la gamba hacia abajo en el aceite y cocine durante 1-2 minutos, luego dé la vuelta y cocine por un minuto más. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Caliente el vinagre de arroz, el azúcar, la sal y el chile en una cacerola hasta que el azúcar se disuelva.", "Coloque las gambas teriyaki, dim sum y las tostadas de gambas en platos separados y sirva la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_teriyaki_prawns_prawn_05624", "title": "Langostinos teriyaki, dim sum de gambas y cerdo y brindis de gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de vino de arroz Shaoxing", "125ml / 4fl oz sake", "125ml / 4fl oz mirin", "125ml / 4fl oz de salsa de soja", "3 cucharadas de azúcar en polvo", "4 x 175 g / 6 oz de filetes de salmón, desollados y deshuesados", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado en juliana fino", "2 dientes de ajo, en rodajas finas", "2 chiles rojos largos, en rodajas finas", "2 pimientos rojos, finamente cortados en juliana", "1 pequeños brotes de bambú de hojalata, escurridos", "Col china 110g / 4oz, finamente triturada", "3 cucharadas de hojas frescas de cilantro", "1 cucharada de berro de coriandro", "3 cucharadas de azúcar de palma", "2 cucharadas de salsa de soja", "2 cucharaditas de salsa de pescado", "1 lima, solo jugo", "aceite vegetal, para freír", "12 rodajas muy finas de raíz de loto", "2 puñados de cilantro, toscamente picados", "200ml / 7floz colza o aceite de oliva ligero", "2 huevos de gallinas camperas, solo yemas", "1 cucharadita de vinagre de vino blanco", "½ cucharadita de mostaza en polvo", "1 cucharadita de sal", "1 limón, solo jugo"], "method": ["Para el salmón teriyaki, caliente una sartén hasta que esté caliente, agregue el vino de arroz, el sake, el mirin, la salsa de soja y el azúcar impalpable y deje que la mezcla hierva a fuego lento.", "Cocine a fuego lento durante 1-2 minutos, o hasta que la mezcla se haya espesado.", "Retirar del fuego y dejar enfriar a temperatura ambiente.", "Coloque el salmón en una bandeja poco profunda y vierta más de la mitad de la mezcla de teriyaki, gírelo para cubrir el salmón en la salsa y luego colóquelo en el refrigerador para marinar durante al menos una hora.", "Retire el salmón del refrigerador, caliente una sartén hasta que esté caliente, luego agregue el salmón, con la presentación hacia abajo y fríalos durante 1-2 minutos, luego dé la vuelta.", "Vierta sobre la salsa teriyaki restante y úsela para esmaltar el salmón mientras continúa cocinando por otros 2-3 minutos, o hasta que esté recién cocido.", "Retire la sartén del fuego y descanse el salmón durante unos minutos.", "Para la ensalada de cilantro, coloque el jengibre, el ajo, los chiles, los pimientos rojos, los brotes de bambú, el repollo, las hojas de cilantro y el berro en un bol y mezcle.", "Mezcle el azúcar de palma, la salsa de soja y pescado y el jugo de lima juntos hasta que se combinen, vierta sobre la ensalada y revuelva para cubrir.", "Caliente un wok separado con aproximadamente 2.5 cm / 1 in de aceite vegetal hasta que brille. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue la raíz de loto y fríalos hasta que estén dorados y luego escurra inmediatamente sobre papel de cocina.", "Sazonar con sal y un poco de pimienta negra.", "Para la mayonesa de cilantro, ponga a hervir una olla de agua, agregue el cilantro y cocine por un minuto.", "Escurrir y refrescar en un recipiente con agua helada y luego exprimir el exceso de líquido.", "Coloque en una licuadora con el aceite y mezcle hasta que esté verde y un puré fino.", "Coloque las yemas de huevo, el vinagre, la mostaza, la sal y el jugo de limón en un procesador de alimentos limpio.", "Mezcle para combinar, luego con el motor todavía en funcionamiento, agregue gradualmente el aceite de cilantro.", "Continúe hasta que se haya agregado todo el aceite y la mayonesa se haya espesado. Es posible que no necesite todo el aceite para lograr la consistencia correcta.", "Sazone con sal y pimienta negro.", "Para servir, vierta la mayonesa en el plato y cubra con una pila de ensalada.", "Coloque el salmón teriyaki encima y termine con unas patatas fritas de loto."], "url": "www_bbc_co_uk_food_recipes_teriyaki_salmon_with_07180", "title": "Salmón Teriyaki con ensalada de cilantro y mayonesa de cilantro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de vino de arroz Shaoxing", "125ml / 4fl oz sake", "125ml / 4fl oz mirin", "125ml / 4fl oz de salsa de soja", "3 cucharadas de azúcar en polvo", "4 x 175 g / 6 oz de filetes de salmón, desollados y deshuesados", "75g / 3oz de col rizada, recogido y desmenuzado", "½ pepino, pelado y finamente cortado", "50 g / 2 oz de hojas de mizuna", "4 cucharadas de hojas de menta ralladas", "1 chile rojo, finamente triturado", "2 limas, solo jugo", "1 cucharada de azúcar de palma", "2 cucharadas de aceite de sésamo", "1 cucharada de salsa de soja", "sal y pimienta negra recién molida"], "method": ["Para el salmón teriyaki, caliente una sartén hasta que esté caliente, agregue el vino de arroz, el sake, el mirin, la salsa de soja y el azúcar impalpable y deje que la mezcla hierva a fuego lento.", "Cocine a fuego lento durante 1-2 minutos, o hasta que la mezcla se haya espesado.", "Retirar del fuego y dejar enfriar a temperatura ambiente.", "Coloque el salmón en una bandeja poco profunda y vierta más de la mitad del teriyaki, gírelo para cubrir el salmón en la salsa y colóquelo en el refrigerador para marinar durante al menos una hora.", "Retire el salmón del refrigerador, caliente una sartén hasta que esté caliente, luego agregue el salmón, con la cara de presentación hacia abajo y espere 1-2 minutos, luego voltee.", "Vierta sobre la salsa teriyaki restante y úsela para esmaltar el salmón mientras continúa cocinando por otros 2-3 minutos hasta que esté cocido, acristalamiento con frecuencia.", "Retire la sartén del fuego y descanse el salmón durante unos minutos.", "Para la ensalada de col, ponga a hervir una sartén de agua con sal, agregue la col rizada rallada y blanqueada durante dos minutos, luego escurra y vuelva a enfriar.", "Presione en seco y colóquelo en un bol con pepino, mizuna, hojas de menta y chile y mezcle ligeramente.", "Batir el jugo de lima, el azúcar de palma, el aceite de sésamo y la salsa de soja juntos y sazonar con un poco de sal y pimienta negra recién molida.", "Rocíe la ensalada y mezcle para combinar.", "Para servir, amontone la ensalada en el plato y coloque el salmón al costado. Cuchara sobre la salsa extra teriyaki."], "url": "www_bbc_co_uk_food_recipes_teriyaki_salmon_with_25244", "title": "Salmón Teriyaki con ensalada de repollo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de vino de arroz Shaoxing", "125ml / 4fl oz sake", "125ml / 4fl oz mirin", "125ml / 4fl oz de salsa de soja", "3 cucharadas de azúcar en polvo", "4 x 150-200g / 5½-7oz trozos de solomillo", "2 cucharadas de aceite de colza", "Jengibre fresco de la raíz de los 5cm / 2in, finamente en juliana", "2 dientes de ajo, en rodajas finas", "2 chiles rojos largos, en rodajas finas", "3 cucharadas de hojas frescas de cilantro", "3 cucharadas de menta fresca", "3 cucharadas de azúcar de palma", "2 cucharadas de salsa de soja", "2 cucharaditas de salsa de pescado", "1 lima, solo jugo", "100g / 3½oz de judías verdes, dejadas enteras", "Mangetout de 100 g / 3½ oz, reducido a la mitad", "100 g / 3½ oz de frijoles edamame, envasadas", "100g / 3½ oz de guisantes frescos, envasadas", "1 cebolla roja, finamente rebanada", "½ manojo de berros frescos"], "method": ["Calentar una sartén hasta que esté caliente, agregar el vino de arroz, el sake, el mirin, la salsa de soja y el azúcar impalpable y llevar la mezcla a fuego lento. Cocine a fuego lento durante 1-2 minutos, o hasta que la mezcla se haya espesado. Retirar del fuego y dejar enfriar a temperatura ambiente.", "Coloque el bistec en una bandeja poco profunda y vierta más de la mitad de la mezcla de teriyaki, gírelo para cubrir el bistec con la salsa. Coloque en el refrigerador para marinar durante al menos una hora. Vierta la salsa teriyaki restante en el recipiente para servir.", "Calentar una sartén hasta que esté caliente, cortar el bistec y freír durante 1-2 minutos.", "Para la ensalada, ponga el jengibre, el ajo, los chiles, el cilantro, la menta, el azúcar de palma, la salsa de soja, la salsa de pescado y el jugo de lima en un almirez y mortero. Libra hasta que tengas un aderezo suave.", "Coloque los frijoles, el mangetout, los frijoles edamame, los guisantes, la cebolla y el berro en un tazón grande y mezcle para combinar. Justo antes de servir, agregue el aderezo y revuelva.", "Coloque el bistec en platos para servir junto con la ensalada y sirva con la salsa teriyaki restante."], "url": "www_bbc_co_uk_food_recipes_teriyaki_steak_with_35460", "title": "Teriyaki bistec con ensalada de frijoles asiáticos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de salsa Tabasco (opcional)", "2 cucharadas de miel clara", "2 cucharadas de aceite de sésamo", "2 cucharadas de salsa de soja", "4 muslos de pollo, hueso eliminado, en rodajas", "1 cucharada de aceite vegetal", "arroz hervido, para servir", "al vapor bok choi, para servir"], "method": ["Ponga la salsa Tabasco (si está usando), miel, aceite de sésamo y salsa de soya en un tazón y mezcle bien. Coloque las rodajas de pollo en el recipiente, revuelva bien para cubrir y deje macerar durante 5 minutos.", "Calentar el aceite vegetal en una sartén. Retire las rodajas de pollo del adobo, reservar el adobo y freír durante 3-4 minutos en cada lado, o hasta que estén completamente cocidos. Retire el pollo de la sartén y déjelo a un lado, manténgalo caliente.", "Vierta el adobo en la sartén y hierva rápidamente durante unos minutos hasta que se reduzca ligeramente.", "Para servir, ponga las rodajas de pollo en un plato y vierta sobre la salsa. Servir con arroz y bok choi al vapor."], "url": "www_bbc_co_uk_food_recipes_teriyakichicken_85358", "title": "Pollo teriyaki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/teriyakichicken_85358_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 filetes de pollo", "1 cucharada de aceite vegetal", "1 cucharadita de aceite de sésamo", "2 cucharaditas de miel clara", "1 cucharada de salsa de soja", "1 lima, solo jugo", "salpicaduras de agua", "6 cebollas de primavera", "2 cucharaditas de semillas de sésamo"], "method": ["Caliente el aceite vegetal en una sartén mediana.", "Freír los filetes de pollo durante 2-3 minutos.", "Agregue ½ cucharadita de aceite de sésamo, la miel y la soja y cocine hasta que el pollo se caramelice.", "Coloque una sartén al calor.", "Planche las cebolletas en ambos lados hasta que estén bien carbonizadas.", "Agregue el jugo de limón y agua al pollo. Retire la sartén del fuego.", "Rocíe el aceite de sésamo restante sobre las cebollas de primavera, luego espolvoree sobre las semillas de sésamo.", "Sirva el pollo teriyaki en una cama de cebollas de primavera a la plancha."], "url": "www_bbc_co_uk_food_recipes_teriyakichickenonabe_66005", "title": "Pollo Teriyaki en una cama de cebollas de primavera a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de sésamo", "2 cucharadas de salsa de soja", "2 cucharadas de miel", "12 champiñones, tallos eliminados", "1 hoja de col Savoy, para adornar"], "method": ["Coloque el aceite de sésamo, la miel y la salsa de soja en un bol y mezcle.", "Agregue los champiñones y deje macerar durante diez minutos.", "Caliente una sartén hasta que fume. Ensarte los champiñones en los pinchos y coloque en la plancha para cocinar durante dos minutos en cada lado.", "Para servir, coloque una hoja de repollo Savoy en la base de un plato y cubra con los pinchos de champiñones."], "url": "www_bbc_co_uk_food_recipes_teriyakimushrooms_80611", "title": "Setas Teriyaki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de res 150 g / 5 ¼ oz", "1 cucharada de salsa de soja", "1 cucharada de miel", "1 cucharada de jugo de lima", "2 pequeños pinchos de madera", "175 g / 6 oz de brócoli, cortado en trozos del tamaño de un bocado", "1 diente de ajo, finamente picado", "½ cucharadita de jengibre molido", "¼ cebolla roja, finamente rebanada", "½ tomate, picado", "1 cucharadita de aceite de sésamo", "2 cucharadas de salsa de soja"], "method": ["Para hacer los pinchos teriyaki, cubra la carne en trozos del tamaño de un bocado.", "Coloque la carne en los pinchos de madera.", "Caliente una sartén a fuego medio y agregue un chorrito de aceite.", "Coloque los pinchos en la sartén de la plancha y gírelos una vez dorados.", "Coloque el resto de los ingredientes teriyaki en un tazón para hacer la salsa.", "Cepille la salsa teriyaki en los pinchos y cocine durante 3-4 minutos.", "Quite el calor y deje reposar por un minuto.", "Para sofreír, blanquear el brócoli en agua caliente durante un minuto.", "Caliente un wok mediano hasta que esté casi ahumado y agregue todos los ingredientes salteados excepto el brócoli.", "Cocine por dos minutos. Agregue el brócoli y cocínelo por un minuto más.", "Para servir, coloque la salteada en un plato y agregue los pinchos en la parte superior."], "url": "www_bbc_co_uk_food_recipes_teriyakiskewerswiths_75727", "title": "Pinchos Teriyaki con verduras salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de salmón", "4-5 cucharadas de salsa de soja oscura", "1 lima, ralladura y jugo", "1 chili pequeño", "2 cucharadas de jarabe de arce", "1 diente de ajo graso, finamente picado", "1 pedazo de jengibre, finamente picado", "1 hoja de fideos de huevo", "manojo de cilantro, picado", "1 cucharada de aceite de sésamo", "jugo extra de lima"], "method": ["Calentar un poco de aceite de oliva en una sartén y freír el jengibre, el ajo y el chile picado.", "Agregue la ralladura y el jugo de la lima y vierta la salsa de soja. Agregue el jarabe de arce y cocine durante 1 minuto o hasta que esté reducido y pegajoso.", "Mientras tanto, freír las dos piezas de salmón durante 2 minutos a cada lado en una sartén caliente.", "Cuando la salsa esté reducida agregue el salmón a la sartén de salsa teriyaki.", "Cocine y escurra los fideos, agregue el aceite de sésamo, el condimento y el cilantro y un chorrito de lima. Sirva el salmón en una cama de fideos con más cilantro picado."], "url": "www_bbc_co_uk_food_recipes_teriyakisalmon_66107", "title": "Salmón teriyaki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/teriyakisalmon_66107_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz pasas", "100 ml / 3½ fl oz de vino espumoso Down St Mary, u otro vino espumoso", "300g / 10½oz de queso Capricornio de cabra u otro queso de cabra suave pero maduro similar que no sea demasiado blando", "200 g / 7 oz de yogur griego simple", "200ml / 7fl oz azotes o crema doble", "4 hojas de gelatina, empapadas en agua fría durante al menos 10 minutos", "60g / 2½oz de apio, finamente picado", "60 g / 2½ oz de manzana finamente picada", "sal y pimienta blanca recién molida", "Tronco de queso de cabra liso de 100 g / 3½ onzas, cortado en longitudes largas", "100ml / 3½ fl oz de aceite de nuez", "75ml / 3fl oz de aceite de cacahuete", "50ml / 2fl oz de vinagre de Champaña o vinagre de vino blanco", "sal y pimienta negra recién molida", "Mitades de nuez 80g / 3oz", "Leche", "1 manzana de Cox, pelada y cortada en rodajas, cortada en bastones finos y colocada en agua acidulada para evitar el pardeamiento", "hojas de ensalada mixtas, incluyendo rúcula silvestre, perifollo, acelga roja, frisée y hoja de roble"], "method": ["Primero ponga las pasas en remojo en el vino durante 24 horas.", "Para hacer la terrina, coloque el queso de cabra de 300 g / 10½ onzas en un procesador de alimentos y mezcle hasta que quede suave. Mezcle en el yogur, luego retire del procesador y colóquelo en un tazón.", "Caliente la crema hasta que esté caliente, pero no hirviendo. Suavemente exprima la gelatina ablandada en seco, luego agregue a la crema caliente y revuelva hasta que se derrita. Enfríe un poco, luego mezcle esto en la mezcla de yogur y queso de cabra. Agregue el apio y la manzana, y sazone con un poco de sal y pimienta blanca recién molida.", "Alinee un molde de terrina o una lata pequeña de pan con film transparente (o puede usar moldes individuales), luego llene hasta la mitad con la mezcla de queso y yogur, extendiéndolo uniformemente en las esquinas.", "Coloque el tronco de queso de cabra de 100 g / 3½ onzas en el medio. Cubra con la mezcla restante de queso y yogur, alisando la superficie plana. Toque la terrina en la superficie de trabajo para asegurarse de que no haya bolsas de aire. Cúbralo y déjelo en la nevera durante una hora.", "Para la vinagreta de nueces, mezcle todos los ingredientes para la vinagreta juntos, con sal y pimienta negra recién molida al gusto, y coloque en una botella o un vertedor de plástico. Antes de usar la vinagreta, agítela bien.", "Ahora haz la ensalada. Para preparar las nueces, colóquelas en un recipiente pequeño y cúbralas con una mezcla de la mitad de agua y la mitad de la leche. Llevar a ebullición, luego retirar del fuego y dejar en remojo durante unos minutos.", "Escurra y despegue las finas pieles marrones, usando un pequeño cuchillo de cocina. Tueste las nueces en una sartén seca, luego reserve.", "Escurra algunas de las pasas del vino y colóquelas en un tazón con algunas de las nueces. Agregue la manzana y un poco de la vinagreta y revuelva para cubrir.", "Combina las hojas de ensalada con las pasas drenantes restantes y las nueces tostadas en otro cuenco y viste con la vinagreta.", "Voltea la terrina fuera del molde y corta con un cuchillo caliente.", "Para ensamblar, coloque la terrina en un extremo de cada plato (idealmente utilice placas largas u ovaladas). Apila la ensalada en el otro extremo del plato. Coloque las pasas y las nueces en el medio y coloque los bastones de manzana en la parte superior, o espolvoréelos alrededor de la terrina."], "url": "www_bbc_co_uk_food_recipes_terrineofcapricorngo_81701", "title": "Terrina de Capricornio queso de cabra, manzanas y apio y una ensalada de nueces tostadas y pasas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de atún 150 g / 5½ oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de salsa de soja", "2 cucharadas de miel", "1 cucharadita de semillas de sésamo", "50g / 1¾oz de fideos de arroz", "500ml / 18fl oz de aceite vegetal"], "method": ["Para el atún, frote el filete de atún con el aceite y sazone ambos lados con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté muy caliente. Agregue el filete de atún y dore durante dos minutos en cada lado, hasta que se dore y se cocine completamente.", "Verter sobre la soja y la miel y dejar cocer y caramelizar durante 30 segundos. Retirar del fuego, espolvorear con semillas de sésamo y reservar.", "Para hacer los fideos, caliente el aceite vegetal en una cacerola honda profunda y profunda hasta que la miga de pan chisporrotee y se ponga marrón cuando se le agregue. (PRECAUCIÓN: el aceite caliente puede ser peligroso, no lo deje desatendido).", "Con cuidado agregue los fideos de arroz al aceite caliente. Se hincharán y cocinarán en unos segundos, luego cuidadosamente quitarán y drenarán los paños de cocina.", "Para servir, coloque el atún en un plato pequeño y caliente y coloque los fideos crujientes en un tazón al lado."], "url": "www_bbc_co_uk_food_recipes_teryakisearedtunawit_81381", "title": "Atún sellado Teriyaki con fideos crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles secos de chipotle", "¼-½ habanero de chile, al gusto", "generosos copos de sal marina", "4 cucharadas de aceite de oliva", "1 naranja, solo jugo", "2 cucharaditas de hojas frescas de orégano", "2 dientes de ajo, picados", "1 pollo entero grande, espolvoreado y deshuesado, solo quedan huesos de ala (pida a su carnicero que haga esto por usted)", "gran perilla de mantequilla", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "½ manojo de cilantro fresco, tallos picados, hojas reservadas para decorar", "2 x 400 g de latas de frijoles negros mexicanos de buena calidad", "1 chile rojo pequeño, finamente picado, para adornar", "4-8 tacos suaves", "un puñado de queso firme de estilo mexicano rallado, como el de Oaxaca (disponible en tiendas de queso especializadas o en línea; alternativamente, use mozzarella rallada firme)", "4-8 cucharadas de salsa de tomate lista para usar", "2 puñados de lechuga crujiente como Iceberg o lechuga romana, rallada"], "method": ["Para el pollo, caliente una sartén a fuego alto. Cuando la sartén esté caliente, agregue los chiles chipotle y habanero y fría, volteando regularmente, hasta que las pieles estén casi completamente ennegrecidas y con ampollas por todas partes. Transfiera los chiles a un recipiente y cúbralos con agua tibia (de un hervidor de agua). Déjalo a remojo durante 15-20 minutos, o hasta que esté suave.", "Cuando los chiles estén suaves, escurra con cuidado el agua y quite los tallos, las semillas y las pieles con los dedos. (PRECAUCIÓN: lávese bien las manos después de desollar y deshilar los chiles, y no toque sus ojos durante el proceso.) Cortar aproximadamente la pulpa de chile, luego transferirlo a un almirez y mortero y agregar la sal y el aceite de oliva. Batir los chiles en una pasta suave.", "Revuelva el jugo de naranja, el orégano y el ajo en la pasta de chile hasta que estén bien combinados.", "Coloque el pollo con espinas sobre una superficie de trabajo limpia. Extiende el adobo de chile por todas partes. Dejar de lado para marinar durante al menos 30 minutos, o preferiblemente durante la noche (cubierto y refrigerado).", "Mientras tanto, para los frijoles, derrita la mantequilla en una cacerola grande a fuego alto. Cuando la mantequilla esté espumosa, agregue la cebolla y el ajo y fría por 6-8 minutos, o hasta que estén suaves pero no coloreados.", "Agregue los tallos de cilantro picado a la mezcla y continúe freír durante 3-4 minutos más, revolviendo bien.", "Revuelva los frijoles negros y todos los contenidos de estaño (consulte la sugerencia) en la mezcla. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 12-15 minutos, revolviendo regularmente, hasta que los frijoles estén muy suaves y la salsa se haya espesado. (Adorne con las hojas de cilantro y el chile picado justo antes de servir).", "Cuando el pollo esté marinado, caliente una sartén o sartén grande de base pesada a fuego medio a alto. Cuando la sartén esté caliente, agrega el pollo marinado, con la piel hacia abajo.", "Envuelva un ladrillo en papel de aluminio (consulte la sugerencia). Coloque el ladrillo encima del pollo y continúe planchando, sin moverlo o volteándolo, durante 20-25 minutos, o hasta que el pollo esté completamente cocido (el pollo se cuece si los jugos se limpian cuando se inserta un pincho en la parte más gruesa de la carne y no hay restos de restos rosados).", "Retire los ladrillos del pollo, retire el pollo de la sartén y déjelo a un lado para que descanse antes de cortarlo en rodajas.", "Para servir, divida el pollo, los frijoles, el queso, la salsa de tomate y la lechuga por igual entre los tacos, o permita que las personas preparen sus propios tacos."], "url": "www_bbc_co_uk_food_recipes_tex-mex_brick_chicken_47381", "title": "Pollo de ladrillo Tex-Mex", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lata de 400g / 14oz de frijoles horneados", "1 cucharadita de azúcar moreno", "½ cucharadita de comino", "½ cucharadita de chile en polvo", "1 cucharadita de vinagre balsámico"], "method": ["Cuele los frijoles y colóquelos en una cacerola a fuego medio.", "Agregue el azúcar, las especias, el vinagre y el agua. Calentar durante cinco minutos y verter en un recipiente para servir."], "url": "www_bbc_co_uk_food_recipes_texmexchillibeans_79386", "title": "Judías chinas 'Tex-Mex'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["675g / 1½lb de papas harinosas, peladas y cortadas en cubos de 2.5cm (1in)", "6 lonchas de tocino ahumado y rayado, cocidas hasta que estén crujientes", "2 pepinos de eneldo grandes, cortados en cubitos", "2 huevos duros, picados", "4 cebolletas, picadas", "sal y pimienta negra recién molida", "1 cucharada de jugo de limón", "1 cucharada de eneldo picado", "1 cucharada de cebollines cortados", "1 cucharada de mayonesa", "3 cucharadas de crema agria"], "method": ["Cocine las papas en agua con sal hasta que estén suaves, luego drene y vuelva al fuego para secar. Es importante que las papas estén bien cocidas.", "Combine las papas con el tocino crujiente desmenuzado, el pepino cortado en cubitos, los huevos y las cebolletas. Temporada.", "Combina los ingredientes restantes para hacer el aderezo.", "Doble suficiente del aderezo en la ensalada para que quede cremosa.", "Intente doblar todo junto mientras las papas aún estén tibias, y permita que las papas se descompongan un poco en la mezcla.", "Servir."], "url": "www_bbc_co_uk_food_recipes_texturedpotatosalad_72996", "title": "Ensalada de papas con textura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5cm / 2in de jengibre fresco, pelado y muy finamente picado", "2 dientes de ajo, aplastados", "1 lima, solo jugo", "3 cucharadas de salsa de pescado tailandés (nam pla)", "4 bebé bok choy, rallado", "1 lubina grande, eviscerada y limpiada", "6 cebolletas, finamente picadas", "1 chile rojo, sin semillas, en rodajas finas", "Fideos de fideos de arroz 250 g / 9 oz", "3 lechuga Baby Gem, hojas separadas", "2 zanahorias grandes, en rodajas finas", "½ pepino, pelado longitudinalmente en cintas", "6 cebolletas, cortadas y finamente picadas", "60 g / 2¼ oz de cacahuetes tostados salados, toscamente picados", "grandes hojas de cilantro puñado", "grandes hojas de menta", "grandes hojas de albahaca puñado", "1 lima, solo jugo", "1 cucharada de azúcar en polvo", "3 cucharadas de salsa de pescado tailandés (nam pla)", "1 chile rojo, sin semillas, en rodajas finas", "1 diente de ajo, finamente picado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Batir el jengibre, el ajo, el jugo de lima y la salsa de pescado.", "Coloque el bok choi en una hoja grande de pergamino para hornear y agregue la lubina a un lado junto con un poco de cebolleta y chile. Vierta la mezcla de ajo y salsa de pescado sobre el pescado. Doble el papel de pergamino sobre el pescado y selle las esquinas con clips metálicos.", "Coloque en una bandeja para hornear y cocine en el horno durante unos 20-30 minutos.", "Para la ensalada de fideos de arroz, remoje los fideos en un recipiente con agua hirviendo de acuerdo con las instrucciones del paquete hasta que estén tiernos. Escurra los fideos, enjuague con agua fría y reserve.", "Para el aderezo, mezcle el jugo de lima y el azúcar impalpable en un tazón grande hasta que el azúcar se haya disuelto. Agregue la salsa de pescado, el chile y el ajo y mezcle bien.", "A continuación, agregue los fideos, la lechuga, las verduras, los cacahuetes y las hierbas frescas. Mezcle para combinar.", "Sirva la lubina directamente a la mesa, permitiendo a sus invitados abrir el papel para revelar la humeante lubina. Sirve los fideos al lado."], "url": "www_bbc_co_uk_food_recipes_thai-style_baked_seabass_00022", "title": "Lubina al horno estilo tailandés con bok choi y ensalada de fideos de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Azúcar mermelada de 225 g / 8 oz con pectina añadida", "3 cucharadas de vinagre de vino tinto", "2-3 chiles rojos largos, sin semillas, finamente picados", "2 dientes de ajo, finamente picados", "Jengibre fresco de la raíz del pedazo 15g / ½oz, finamente cortado", "100g / 3½oz de carne de cangrejo blanca", "100g / 3½oz de carne de cangrejo marrón", "200g / 7oz de gambas crudas peladas (u otras gambas crudas peladas)", "1 cucharada de pasta de curry verde tailandés", "1 cucharada de harina de maíz, más 1 cucharada extra de espolvorear", "6 cebollas de primavera, finamente rebanadas", "25g / 1oz de cilantro fresco, hojas finamente picadas", "6 cucharadas de aceite de girasol, para freír", "sal marina copos", "pimienta negra recién molida", "Cuñas de lima y cilantro fresco, para servir"], "method": ["Para la salsa de inmersión de chile, ponga el azúcar, el vinagre y 100 ml / 3½ fl oz de agua en una olla pequeña y calentar suavemente hasta que el azúcar se disuelva, revolviendo constantemente. Agregue el chile, el ajo y el jengibre y deje que hierva. Cocine por tres minutos. Retirar del fuego y verter en dos tazones de servir a prueba de calor. Se espesará a medida que se enfríe. (Cualquier mermelada de chile sobrante se puede tapar y guardar en el refrigerador hasta por dos semanas).", "Para hacer los pasteles de cangrejo, coloque la carne de cangrejo, gambas, pasta de curry, harina de maíz y un par de muy buenas pizcas de sal de mar copos y algunos giros de pimienta negra molida en un procesador de alimentos. Mezcle hasta que esté bien combinado. Es posible que deba quitar la tapa y empujar la mezcla hacia abajo un par de veces con una espátula de goma. No permita que la mezcla se vuelva demasiado fina o lisa o será difícil darle forma a las tortas de cangrejo.", "Retire la cuchilla y transfiera la mezcla a un tazón grande. Agregue las cebollas de primavera y el cilantro hasta que estén uniformemente mezclados. Espolvoree una bandeja o fuente pequeña con la cucharada extra de harina de maíz.", "Moje sus manos debajo del grifo frío para evitar que los pasteles de cangrejo se peguen. Tome un puñado de la mezcla, aproximadamente del tamaño de una pelota de golf. Enróllelo en una bola limpia y aplánelo hasta alrededor de 1.5 cm / ¾ de grueso y 6 cm / 2½ pulgadas de diámetro. Ponlo en la bandeja con harina de maíz. Continúa rodando y aplanando la mezcla hasta que hayas hecho 12 pasteles de cangrejo.", "Vierta el aceite en una sartén grande antiadherente y coloque a fuego medio. Cuando el aceite esté caliente, agregue seis de los pasteles de cangrejo y cocínelos durante dos minutos en cada lado o hasta que estén ligeramente dorados y cocinados. Transfiera a un plato calentado mientras el resto está cocinado.", "Divida los pasteles de cangrejo entre dos platos grandes o pequeños. Agregue un plato de mermelada de chile a cada una y adorne con trozos de lima y ramitas de cilantro fresco para servir."], "url": "www_bbc_co_uk_food_recipes_thai-style_crab_cakes_03454", "title": "Pasteles de cangrejo de estilo tailandés con mermelada de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 12 pasteles de cangrejo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo, sin piel, finamente cortadas en cubitos", "75ml / 3fl oz de salsa de pescado tailandés (nam pla)", "2 limas, solo jugo", "1 cucharada de gochujang (una pasta de chile coreana fermentada disponible en los supermercados asiáticos)", "4 pepinos, 3 afeitados en cintas usando un pelador de patatas, 1 cortado en bastones de 7,5 cm / 3 pulgadas", "75ml / 3fl oz de vinagre de vino de arroz japonés", "8 chiles de ojo de pájaro picados", "½ cabeza de brócoli, floretes en rodajas finas", "5 cebolletas, cortadas en rodajas de 1.5cm / ½ en diagonal", "6 chalotes, preferiblemente tailandeses, picados", "puñado de hojas de menta fresca, picada", "puñado de cilantro fresco, picado"], "method": ["Coloque el pollo en un tazón y vierta más de la mitad de la salsa de pescado tailandés, el jugo de una lima y la pasta de chile coreano. Mezcle hasta que esté bien combinado, luego enfríe en la nevera durante al menos dos horas, para marinar.", "Cubra todo el pepino con la salsa de pescado restante, el vinagre de vino de arroz, el jugo de media lima y todos los chiles picados. Mezcle bien y reserve durante dos horas, para marinar.", "Agregue el brócoli, las cebolletas y los chalotes al pollo marinado y deje marinar durante otros 30 minutos.", "Coloque la mezcla de pepino marinado en un colador colocado sobre un recipiente. Cuele y reserve el líquido de marinado.", "Caliente una sartén o un wok de base pesada a fuego alto. Cuando la sartén esté caliente, agregue la mezcla de pollo marinado y saltee hasta que esté bien cocida.", "Agregue el pollo cocido y las verduras a la mezcla de pepino marinado. Agregue las hierbas picadas y mezcle hasta que estén bien combinadas.", "Pruebe la mezcla y añada cucharadas del adobo reservado, a gusto, si es necesario. Exprima el jugo de lima restante y vuelva a saborear.", "Divida la ensalada entre dos platos y sirva."], "url": "www_bbc_co_uk_food_recipes_thai-style_cucumber_08091", "title": "Ensalada tailandesa de pollo y pepino", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]