[{"isVegetarian": false, "title": "Brisbane prawn soufflé", "url": "www_bbc_co_uk_food_recipes_brisbaneprawnsouffle_13045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter\t\t\t\t", "15g/½oz flour\t\t", "230ml/8fl oz milk\t", "3 eggs, separated, whites whipped stiffly\t\t\t", "85g/3oz cheese, grated\t\t", "1 tbsp brandy\t\t\t", "170g/6oz prawns (shelled weight), large shrimp, cut into 1cm/½in pieces\t", "30g/1oz butter\t\t\t", "1 tbsp brandy\t\t\t", "salt,white peppercorns, cayenne, nutmeg, to season"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a souffle dish well and preheat a baking sheet in the oven at 190C/375F/Gas 5.", "Melt the butter in a pan, add the flour to make a roux, then add milk gradually.", "Allow to cool.  Beat in the yolks and cheese until smooth.", "Chop 25g/1oz of the prawns very finely and add to the sauce, also add half the brandy.  Season quite highly with salt, pepper, cayenne and nutmeg.", "Fold the mixture into the stiffly-beaten whites.", "sauté the remaining prawns in clarified butter for 1 minute, add the remaining brandy and set alight.", "Place half the souffli mixture in the dish, place flamed prawns on top, and cover with the remaining mixture.", "Place in the preheated oven and bake 40 minutes."]}, {"isVegetarian": true, "title": "Broad bean and goats’ cheese bruschetta", "url": "www_bbc_co_uk_food_recipes_broad_bean_and_goats_69027", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_goats_69027_16x9.jpg", "ingredients": ["400g/14oz fresh broad beans, (about 300g/10½oz when podded)", "1 whole red chilli", "2 fat garlic cloves, finely chopped", "1 spring onion, thinly sliced", "1 lemon, zest and juice only \t", "1 tbsp dried oregano or 2 tbsp fresh chopped oregano", "½ loaf sourdough bread, sliced", "4 tbsp olive oil", "200g/7oz soft goats’ cheese"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan filled with boiling water. Blanch the beans very briefly (just to soften, not to cook them through).  Drain and set aside to cool.", "Roast the chilli over a direct flame on the hob until blackened a little, but not completely charred. Alternatively, char them under a hot grill. Slice open and remove the seeds. Cut the flesh into thin ribbons. ", "Mix the chilli, garlic, spring onion, lemon zest and juice together. Add the oregano and broad beans and lightly crush them as you mix. You don’t want a smooth purée, but it needs to hold together.", "Heat a large griddle pan and drizzle the sliced sourdough with a little olive oil. Place on the griddle and cook on both sides for 1-2 minutes, or until the bar marks appear.", "Remove from the heat and spread with the goats’ cheese. Top with the broad bean mixture and serve."]}, {"isVegetarian": false, "title": "British tapas", "url": "www_bbc_co_uk_food_recipes_british_tapas_94352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 camembert-style cheese such as Tunworth", "1 sprig rosemary", "1 tbsp clear honey", "freshly ground black pepper", "slices of baguette", "shop-bought pickle or chutney", "8 quails’ eggs, at room temperature ", "malt vinegar (enough to fill a small bowl)", "200g/7oz pork mince", "a few leaves fresh sage, chopped", "½ tsp salt", "½ tsp freshly ground black pepper", "1 free-range egg, beaten", "plain flour, for dusting", "100g/3½oz panko Japanese breadcrumbs", "vegetable oil, for deep frying", "brown sauce, to serve", "4 springs fresh mint, plus extra for garnish", "250g/9oz frozen peas", "1 tbsp crème fraîche", "salt and pepper, to taste"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked cheese and pickle, preheat the oven to 180C/350F/Gas 4. Take the plastic wrapper off the cheese and place it back in its box, or create a tin foil package for it to sit in. ", "Pierce the top of the cheese with a small, sharp knife. Push a few rosemary leaves into each hole, drizzle with honey and sprinkle with freshly ground black pepper. Bake for 15-20 minutes, or until the top is golden-brown and the cheese is bubbling up through the cracks. Serve with slices of baguette and shop-bought pickle.", "For the mini Scotch eggs, carefully place the quails’ eggs into a pan of boiling water and cook for two minutes. Remove from the pan straight into a bowl of iced water to stop them cooking further.", "Transfer the eggs to a bowl of malt vinegar to soak for around 10 minutes - this will make the shells easier to peel", "Meanwhile combine the mince, sage, salt and pepper in a bowl and set aside.", "Crack the egg into a bowl and beat. Place a few tablespoons of plain flour in another bowl and the breadcrumbs in a third bowl.", "Carefully peel the quails’ eggs. Roll them in flour and then mold a quarter of the meat mixture around each egg. Dip them in the beaten egg and then coat with the panko breadcrumbs. Place the prepared Scotch eggs in the fridge while you heat up the vegetable oil for frying.", "Fill a heavy-bottomed sauce pan with about 8cm/3in of vegetable oil and set over a medium heat. To test if the oil is ready, drop a pinch of breadcrumbs in. they should immediately sizzle and rise to the surface (CAUTION: hot oil is dangerous. Do not leave unattended.)", "Remove the Scotch eggs from the fridge and carefully lower into the oil using a slotted spoon. Fry for 3-4 minutes, or until golden-brown all over. Remove from the oil with the slotted spoon to a plate lined with kitchen paper to soak up any excess oil. Serve with brown sauce.", "For the pea and mint soup, pick the leaves off the sprigs of mint and set aside. Place the peas in a saucepan with the mint stalks and pour in just enough to water to cover them. Season with salt and bring to the boil. Cook for three minutes, or until the peas are tender. Drain and set aside a few of the peas to garnish.", "Add the peas to a blender with a splash of the cooking liquid, the mint leaves, crème fraîche and black pepper. Blend until smooth and taste for seasoning. Serve in small glasses with a few peas in the bottom and a leaf of mint on top."]}, {"isVegetarian": false, "title": "British seaside chowder with saffron", "url": "www_bbc_co_uk_food_recipes_british_seaside_chowder_59346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz white wine", "1kg/2lb 4oz mixed shellfish, such as cockles, clams, mussels and winkles, cleaned and soaked in cold water", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 fennel bulb, finely chopped", "½ leek, white part only, finely chopped", "250g/9oz waxy potatoes, peeled and cut into 5mm/¼in cubes", "2 pinches saffron strands", "1 star anise", "500ml/18 fl oz chicken stock", "175ml/6fl oz double cream", "75g/2½oz samphire", "2 ripe tomatoes, skin and seeds removed", "12 shelled cooked whelks", "2 tbsp finely chopped fresh chives", "handful celery leaves, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the wine to the boil in a large lidded saucepan. Add the shellfish, cover the pan with the lid, reduce the heat until the wine is simmering, and simmer the shellfish for 3-5 minutes, or until all the shells have opened (discard any that do not open). ", "Drain the shellfish, reserving the cooking liquor in a bowl. When the shellfish is cool enough to handle, pick the meat from the shells.", "Heat the butter in a large saucepan over a medium heat. Add the shallot and garlic and fry for 1-2 minutes, or until softened. Add the fennel, leek, potatoes, saffron and star anise and fry for a further 1-2 minutes.", "Add the reserved cooking liquor and the chicken stock and bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for 3-4 minutes, or until the potato cubes are just tender.", "Add the cream and samphire and continue to simmer for 1-2 minutes, or until the soup has thickened slightly. Reduce the heat to low, then add the tomatoes and shellfish meat, including the whelks. Heat until the meat is warmed through. ", "Stir in the chives and celery leaves, season, to taste, with a little salt and freshly ground black pepper, then serve."]}, {"isVegetarian": false, "title": "Crab and leek tart", "url": "www_bbc_co_uk_food_recipes_british_crab_and_leek_40568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/british_crab_and_leek_40568_16x9.jpg", "ingredients": ["100g/3½oz plain flour, plus extra for rolling", "100g/3½oz wholemeal flour", "125g/4oz cold butter, cubed", "1 free-range egg, beaten", "knob of butter", "2 medium leeks, trimmed, sliced thinly ", "50g/2oz butter", "300ml half-fat crème fraîche", "3 free-range eggs, beaten", "100g/3½oz fresh brown crab meat", "pinch sea salt flakes", "100g/3½oz fresh white crab meat", "50g/2oz mature cheddar, finely grated ", "freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the pastry, pulse the flours and butter in a food processor until the mixture resembles fine breadcrumbs. With the motor running, add the egg in a thin stream and blend until the mixture begins to form a ball. ", "Roll the pastry into a circle on a floured work surface and use it to line a 23cm/9in loose-based fluted tart tin. Press the pastry with your fingertips firmly into the base and sides. Trim any excess pastry and lightly prick the base of the tart using a fork. Chill in the fridge for 30 minutes.", "Line the pastry with a large sheet of crumpled baking parchment and half fill with baking beans. Bake the tart case for 25 minutes. Remove the beans and return the tart to the oven for a further 5-10 minutes or until the surface is dry and beginning to brown. Remove from the oven and reduce the oven to 180C/350F/Gas 4.", "For the filling, melt the butter in a large heavy-based frying pan over a low heat. Add the leeks and fry gently for 2-3 minutes, stirring until just softened. Remove from the heat and set aside.", "Put the eggs in a large jug and beat lightly with a whisk. Stir in the crème fraîche, season with salt and freshly ground black pepper. Beat together with a wooden spoon until thoroughly combined. Stir in the brown crab meat.", "Scatter the leeks over the pastry case and dot the white crab meat around them. Pour over the crème friache mixture and sprinkle with the cheese.  Cook on the baking tray for 25 minutes, or until the filling is golden-brown and just set. (It should still wobble a tiny bit in the centre as it will continue to set as it cools.) ", "Remove the quiche from the oven and leave to cool in the tin for 15 minutes before removing."]}, {"isVegetarian": true, "title": "Broad bean and runner bean risotto", "url": "www_bbc_co_uk_food_recipes_broad_bean_and_runner_93551", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_runner_93551_16x9.jpg", "ingredients": ["150g/5½oz runner beans", "dash olive oil", "1 large onion, finely chopped", "300g/10½oz risotto rice", "1 litre/1¾ pints vegetable stock ", "3 tbsp mascarpone (optional)", "50g/2oz parmesan (or similar vegetarian hard cheese), finely grated, plus extra to serve", "200g/7oz cooked broad beans", "3 knobs butter", "salt and freshly ground black pepper", "1 heaped tbsp chopped fresh herbs (a mixture of chervil, tarragon, chives and flatleaf parsley)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": [" String the runner beans, slice them into 2cm/¾in pieces and cook in a pan of boiling water until tender. Drain and set aside.", "Heat the olive oil in a large lidded saucepan, then add the onion and cook over a low heat for 3-4 minutes, or until softened. ", "Stir in the rice and cook for a further 2-3 minutes, stirring continuously. ", "Pour over the stock, stir the mixture and cover with the lid. Cook over a low heat for 15-17 minutes, or until the rice is just tender.", "Stir in the mascarpone (if using), parmesan, butter, broad beans and runner beans and season, to taste, with salt and freshly ground black pepper. Sprinkle over the herbs to serve."]}, {"isVegetarian": false, "title": "Broad bean and Little Gem salad", "url": "www_bbc_co_uk_food_recipes_broad_bean_and_little_99871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb thick slices white bread", "6 tbsp olive oil", "salt and pepper", "300g/10oz frozen baby broad beans", "6 Little Gem lettuces", "100g/3½oz parmesan cheese, or vegetarian hard cheese, cut into shavings with a vegetable peeler", "3 tbsp Dijon mustard ", "5 tbsp white wine vinegar", "8 tbsp olive oil ", "5 tbsp double or single cream ", "1 rounded tbsp caster sugar", "salt and pepper"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the croutons, preheat the grill to hot. Cut the crusts off the bread and discard. Cut the bread into even-sized small cubes. Sit a plastic bag in a bowl, pour in the oil and season with salt and pepper. ", "Add the cubed croutons to the bag, pick up the bag and shake, tossing the cubes in the seasoned oil. Tip the bread out on a baking tray and place under the grill. Turn until they’re evenly browned - watch them all the time to prevent scorching and shake occasionally to make sure they brown evenly.\r\n\r\n", "For the salad, cook the broad beans in boiling water for about 3-4 minutes, or until tender. Drain and refresh in cold water. Remove the beans from their pods, set aside. ", "Trim the very ends off of the Little Gem lettuces but keep the root intact. Slice each lettuce into six wedges. Arrange on a platter, scatter with beans and parmesan and season with salt and pepper.", "For the mustard dressing, measure all of the dressing ingredients into a clean jam jar, season with salt and pepper and seal with a lid and shake until combined. Pour over the dressing, toss and serve."]}, {"isVegetarian": true, "title": "Broad bean hummus", "url": "www_bbc_co_uk_food_recipes_broad_bean_hummus_29052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fresh broad beans, podded weight", "100g/3½oz tinned chickpeas, drained reserving 6 tbsp of the liquid from the can", "1 garlic clove, crushed", "2 heaped tbsp tahini ", "1 tbsp lemon juice", "½ tsp salt", "pinch ground cumin", "pinch ground white pepper", "pinch caster sugar (optional)", "4 tbsp extra virgin olive oil, plus extra for drizzling", "1 tsp sesame seeds, toasted", "melba toasts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the podded broad beans in a pan of boiling, salted water for a minute or two, or until tender. Drain and cool in iced water.", "Once cold, the beans are ready to drain and re-pod (double podding stage): remove the skin from the bright green beans.", "Place the broad beans (saving a few for garnish), chickpeas, crushed garlic, tahini paste, lemon juice, salt, cumin, white pepper and caster sugar, if using, in a food processor and blend until smooth, loosening with the reserved chickpea liquor.", "As the mix continues to purée, slowly pour in the olive oil until completely combined.", "Serve the homemade broad bean hummus spooned or piped into a bowl, topped with the saved broad beans, toasted sesame seeds and a little drizzle of olive oil with the melba toast."]}, {"isVegetarian": true, "title": "Warm salad of broad bean, mangetout, peas, roasted beetroot and mozzarella", "url": "www_bbc_co_uk_food_recipes_broad_bean_mange_tout_00471", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_mange_tout_00471_16x9.jpg", "ingredients": ["4 heritage beetroots", "2 shallots", "2 tbsp rapeseed oil", "500g/1lb 2oz broad beans, podded and outer skin removed", "200g/7oz fresh peas, podded", "200g/7oz mangetout, thinly sliced", "2 balls buffalo mozzarella, torn ", "few basil leaves, to garnish", "30g/1oz French dressing", "30g/1oz honey", "30g/1oz white balsamic vinegar", "pinch salt", "squeeze lemon juice", "1 garlic clove, crushed", "100g/3½oz blue cheese", "50g/1¾oz buttermilk", "40g/1½oz crème fraîche", "40g/1½oz mayonnaise", "dash worcestershire sauce (omit if cooking for vegetarians)", "dash Tabasco"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Put the beetroots and shallots, unpeeled, on a sheet of foil and drizzle with the oil. Wrap them up and seal to make a parcel and bake in the oven for 40-50 minutes, or until soft. ", "Remove from the oven and allow to cool. Once cool, peel the beetroots and shallots and cut into quarters.", "Make the mustard and honey dressing by blending all the ingredients together in a bowl or blender until smooth. ", "Blanch the broad beans in boiling water for a couple of minutes and then drain.", "Heat a large frying pan and add the broad beans, peas and mangetout. Add the mustard and honey dressing to the pan and cook for a couple of minutes.", "Make the blue cheese dressing by blending all the ingredients together in a blender until smooth. ", "Place the beans, mangetout and peas in a large serving bowl.", "Scatter over the pieces of torn mozzarella, shallots and beetroot.", "Dress the salad with a little of the blue cheese dressing, garnish with a few torn basil leaves and serve."]}, {"isVegetarian": true, "title": "Broad bean and courgette pilaf", "url": "www_bbc_co_uk_food_recipes_broadbeanandcourgett_91842", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broadbeanandcourgett_91842_16x9.jpg", "ingredients": ["1 tsp cumin seeds", "1 tsp coriander seeds", "50ml/2fl oz vegetable oil", "1 onion, peeled, finely chopped", "2 cloves garlic, peeled, crushed", "1 cinnamon stick", "1 tsp ground turmeric", "10 cardamom pods, lightly crushed", "2 cloves", "225g/8oz basmati rice, soaked in water for 20 minutes and drained", "200g/7oz broad beans, out of their pods, inner membranes removed", "400ml/14fl oz vegetable stock", "4 courgettes, cut into 3cm/1in rounds", "olive oil, for brushing", "salt and freshly ground black pepper", "50g/2oz butter", "chopped fresh parsley", "lemon juice", "yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dry frying pan and add the cumin and coriander seeds. Fry over a medium heat, moving the spices around the pan frequently to prevent them from burning, for 2-3 minutes, or until aromatic and lightly browned. Transfer to a mortar and grind with a pestle.", "In a pan, heat the vegetable oil and fry the onion and garlic over a medium-low heat for 6-8 minutes, or until softened. Add the ground toasted spices, the cinnamon stick, ground turmeric, cardamom pods and cloves and cook for 2-3 minutes.", "Add the rice, broad beans and stock, cover the pan with a lid and cook over a low heat for 12-15 minutes, or until the rice is tender.", "Meanwhile, heat a griddle pan until smoking. Brush the courgettes with the olive oil, season with salt and freshly ground black pepper then cook on the griddle for 2-3 minutes on both sides, or until charred and softened. Set aside.", "To serve, stir the butter into the pilaf until melted, then spoon into serving bowls and top with the griddled courgette pieces. Garnish with chopped fresh parsley, a squeeze of lemon juice and a dollop of yoghurt."]}, {"isVegetarian": true, "title": "Broad bean dip", "url": "www_bbc_co_uk_food_recipes_broadbeandip_68044", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz  broad beans", "150g/6oz cream  ", "salt and fresh groud pepper ", "pinch sugar", "1 tsp garlic, finely chopped ", "1 tbsp fresh oregano, chopped ", "1 tsp ground cumin ", "150ml/¼ pint extra virgin olive oil ", "spring onions, to garnish", "chilli powder, to garnish", "ground cumin, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Use a vegetable mouli to mash the broad beans - this will mash the bean flesh but leave the skins behind. ", "Add some cream, salt, pepper and a hint of sugar.", "Add the garlic, oregano, cumin, olive oil and pepper to the broad bean purée.  ", "Garnish with spring onions, chilli powder, ground cumin and olive oil."]}, {"isVegetarian": false, "title": "Broad bean, asparagus and potato salad with duck in parma ham", "url": "www_bbc_co_uk_food_recipes_broadbeanasparagusan_87236", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large potato, peeled, cut into cubes and boiled until tender", "handful broad beans, removed from pods and blanched", "handful asparagus, trimmed and blanched", "salt and freshly ground black pepper ", "55g/2oz goats' cheese", "2 tbsp double cream", "2 tbsp finely chopped fresh basil", "½ duck breast, skin removed, sliced into 4 strips", "2 slices parma ham, halved lengthways", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the cooked potato, broad beans and asparagus into a bowl and season with salt and freshly ground black pepper.", "For the dressing, heat the goats' cheese and cream in a saucepan over a gentle heat until the cheese has melted and the sauce is smooth. Stir in the basil.", "For the duck, wrap each duck strip in half a slice of parma ham.", "Heat the oil in a frying pan and fry for 6-8 minutes, or until crisp and golden-brown and the duck is cooked through.", "To serve, place the salad in the centre of a plate, top with the duck and drizzle over the dressing. Serve warm or cold."]}, {"isVegetarian": true, "title": "Broad bean salad", "url": "www_bbc_co_uk_food_recipes_broadbeansalad_76452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz podded broad beans, cooked, skins removed", "¼ red onion, peeled and chopped", "1 tbsp chives, chopped", "1 tbsp olive oil", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, mix the broad beans, red onion and chives in a bowl.", "Drizzle over the olive oil and lemon juice and then add the salt and freshly ground black pepper. ", "Toss together and then transfer to a serving plate."]}, {"isVegetarian": true, "title": "Broad beans with dill", "url": "www_bbc_co_uk_food_recipes_broadbeanswithdill_74757", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb young fresh broad beans in their pods", "50ml/2fl oz olive oil", "2 onions, chopped", "2 cloves garlic, peeled and finely chopped", "½ lemon, juice only", "250ml/½ pint vegetable stock", "2 tbsp fresh chopped dill", "a dollop of Greek-style yoghurt (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the beans, top, tail and string them where necessary. ", "Heat the oil in a large heavy-lidded pan and add the onions and garlic. Cook for 2-3 minutes to soften. Add the beans in their pods and the lemon juice and toss to combine. ", "Add the stock, bring to the boil and cook for 20-25 minutes until the pods are very tender. Cover and reduce heat to a gentle simmer.", "At the end of cooking, add the dill. Serve warm. Add a generous dollop of Greek-style yoghurt (optional)."]}, {"isVegetarian": true, "title": "Broad bean salad with dried tomatoes, feta cheese and turmeric potatoes", "url": "www_bbc_co_uk_food_recipes_broadbeansaladwithdr_89015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "85g/3oz broad beans, out of their pods", "½ onion, sliced", "100g/3½oz feta cheese, crumbled", "125g/4½oz cherry tomatoes, halved", "½ tsp sugar", "½ tsp salt", "100g/3½oz new potatoes, sliced", "1 tsp ground turmeric", "25g/1oz butter", "1 handful fresh parsley, chopped", "1 handful fresh basil, chopped", "1 handful fresh chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a pan and lightly fry the broad beans and onion for 6-8 minutes, or until onions aer softened. Remove from the heat and allow to cool slightly before stirring in the feta cheese. ", "Place half the tomatoes onto a plate and sprinkle over the sugar and salt. Place in the microwave for five minutes on a medium heat, or until dried. Remove from the microwave, drizzle over the remaining olive oil and allow to cool before stirring into the onion and broad bean mixture.", "Parboil the new potato slices in boiling salted water seasoned with the ground turmeric for 5-6 minutes, then drain. Melt the butter in a pan and fry the potatoes for 5-6 minutes, or until tender and golden-brown. ", "To serve, place the fresh herbs onto a serving plate and pile on the broad bean, onion, feta and dried tomato mixture. Scatter over the remaining tomato halves, arrange the turmeric potatoes around the edge of the plate and drizzle over any remaining oil from the pan."]}, {"isVegetarian": false, "title": "Broad beans with pata negra ham", "url": "www_bbc_co_uk_food_recipes_broadbeanswithpatane_91729", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broadbeanswithpatane_91729_16x9.jpg", "ingredients": ["120g/4½oz baby broad beans, pods removed (podded weight)", "55g/2oz very finely sliced pata negra or similar high-quality Spanish cured ham, torn (the slices will be so thin that it should result in small shavings of ham)", "1 small garlic clove, peeled, finely chopped", "1 tbsp extra virgin olive oil", "splash sherry vinegar", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the podded broad beans in a pan of boiling, salted water for 2-3 minutes, or until tender. Drain well, then refresh in cold water. When cool enough to handle, peel away the outer membranes. ", "In a bowl, mix together the cooked broad beans, pieces of pata negra ham and chopped garlic until well combined. ", "Drizzle over the olive oil and a splash of sherry vinegar, then season, to taste, with salt and freshly ground black pepper and stir well. (NB: Remember that the cured ham will be salty.) Serve immediately."]}, {"isVegetarian": true, "title": "Broad bean, yoghurt and mint soup", "url": "www_bbc_co_uk_food_recipes_broadbeanyoghurtandm_85610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb shelled broad beans, thawed if frozen, blanched and skins removed", "30g/1oz butter", "1 onion, chopped", "1 stick celery, thinly sliced", "2 tbsp pudding rice", "1 generous sprig fresh summer savory or thyme", "1 litre/1¾ pints hot chicken stock or vegetable stock", "salt and freshly ground black pepper", "115ml/4fl oz Greek-style yoghurt", "handful fresh mint leaves, chopped", "4 small sprigs fresh mint", "paprika or cayenne pepper, for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take about one-eighth of the blanched broad beans, chop roughly and set aside.", "Heat the butter in a heavy-bottomed, lidded pan. Add the onion and celery, cover and sweat over a low heat for about ten minutes, or until very tender.", "Add the rice and summer savory or thyme and cook for another minute, uncovered.", "Add the broad beans, except for the reserved chopped ones, and the stock. Season with salt and freshly ground black pepper, bring up to the boil, reduce the heat and simmer for about ten minutes, or until the rice is tender. Remove the savory or thyme stem, then allow to cool slightly.", "Pour the soup into a food processor in batches and blend until smooth.", "Shortly before serving, reheat the soup thoroughly, then take off the heat.", "Add a tablespoon of the yoghurt, together with the reserved beans and the chopped mint and stir well. Mix in a second tablespoon of yoghurt and continue stirring in, a spoonful at a time, until all the yoghurt is incorporated. Taste and adjust the seasoning.", "To serve, pour the soup into bowls and top with a sprig of mint and a light dusting of paprika or cayenne pepper."]}, {"isVegetarian": false, "title": "Broccoli and anchovy pasta", "url": "www_bbc_co_uk_food_recipes_broccoli_and_anchovy_27818", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoli_and_anchovy_27818_16x9.jpg", "ingredients": ["300g/10½oz wholemeal plain flour, plus extra for dusting", "3 free-range eggs", "1 tbsp olive oil", "½ tsp sea salt", "180g/6oz broccoli, cut into florets and the stem into thick slices", "3 tbsp extra virgin olive oil", "4 anchovies, roughly chopped", "20g/¾oz freshly grated Parmesan", "freshly ground black pepper"], "serves": "Serves 3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta (if making by hand), put the flour in a large bowl, then make a well in the centre. Add the eggs, olive oil and salt and whisk together in the centre. Gradually pull a little bit of flour in each time you stir the mixture. You want to gradually add the flour to the eggs to make a smooth firm dough. Flatten the dough into a disc about 1cm/½in thick, then wrap in cling film and chill for 20 minutes in the fridge. ", "When the pasta is chilled, remove and place on a lightly floured work surface. Cut in half then use a rolling pin to flatten the dough to a rectangle, turning the pasta as you go to make sure you have an even thickness. Roll each piece of pasta to about 2mm thick – the thinner the better. When the pasta is as thin as you can go, cut into strips about 3mm wide for tagliatelle or thinner for linguine.", "Hang over a rolling pin or similar so that the pasta can dry slightly while you make the sauce.", "To make the pasta by machine: tip the flour into a food processor, then add the eggs, olive oil and salt and pulse until the mixture forms small crumbs. Tip out on to a work surface and squash into a ball, then knead, pulling the dough together for a couple of minutes, until smooth. ", "Flour the rollers of the pasta machine. Cut the pasta in half and using a rolling pin, roll to about 5mm thick rectangle. Starting at the thickest setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again if needed and feed the pasta sheet through the machine the same way. Keep going, making the opening smaller each time – you might need to cut the pasta in half lengthways as it gets towards the end. Fold the pasta in half lengthways then cut into strips as above.", "For the sauce, add the broccoli to boiling water for 4-5 minutes until just tender.", "Meanwhile, bring a large saucepan of salted water to the boil. Add the pasta and cook for 3-4 minutes until it rises to the surface. Drain into a colander, reserving some of the cooking water.", "Add the broccoli to the pasta and add the anchovies and mix well to combine. Add 2 tablespoons of the cooking water and cook for 1 minute stirring as you go. The pasta should be coated in the broccoli and anchovy.", "Pile the pasta into serving bowls, then top with the Parmesan."]}, {"isVegetarian": true, "title": "Broccoli, almond and lemon penne", "url": "www_bbc_co_uk_food_recipes_broccolialmondandlem_89918", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz dried penne pasta", "500g/1lb 2oz broccoli, cut into florets", "110g/4oz butter", "75g/3oz flaked almonds", "50g/2oz white breadcrumbs", "1 lemon, juice only", "parmesan (or a vegetarian alternative), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil. Add the pasta and cook according to packet instructions.", "Meanwhile, bring a separate pan of salted water to the boil. Add the broccoli and boil for 2-3 minutes, until just tender. Drain the broccoli into a colander.", "Heat a frying pan over a medium heat. Add the butter and fry until it melts and begins to turn golden-brown.", "Add the almonds and breadcrumbs and heat until the breadcrumbs are golden-brown.", "Add the broccoli and stir well to coat in the almonds and breadcrumbs.", "Add the lemon juice and season, to taste, with salt and freshly ground black pepper.", "Add the cooked penne pasta and mix together well.", "To serve, spoon equal portions of the pasta and broccoli into bowls and garnish with freshly grated parmesan."]}, {"isVegetarian": false, "title": "Broccoli and cauliflower cheese bake", "url": "www_bbc_co_uk_food_recipes_broccoli_and_cauliflower_17520", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "50g/1¾oz plain flour", "450ml/16fl oz whole milk", "1 tsp English mustard", "1 tsp Worcestershire sauce", "200g/7oz cheddar, grated", "50g/1¾oz unsalted butter", "2 leeks, sliced", "½ loaf brioche, cut into 2cm/1in cubes", "200g/7oz broccoli, cut into florets", "200g/7oz cauliflower, cut into florets", "150g/5½oz Lincolnshire poacher cheese, grated", "3 tbsp olive oil", "1 tbsp sherry vinegar", "1 tsp Dijon mustard", "1 lemon, juice only", "salt and freshly ground black pepper", "2 heads baby gem lettuce, leaves separated", "150g/5½oz Tenderstem broccoli, boiled until just tender", "150g/5½oz romanesco broccoli, cut into florets, boiled until just tender"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "For the cheese sauce, melt the butter in a large pan, add the flour and cook for 2-3 minutes.", "Gradually add the milk, whisking all the time until the milk is completely incorporated and the sauce is thickened.", "Once you have a smooth sauce add the mustard, Worcestershire sauce and grated cheese.", "For the bake, melt 25g/1oz of the butter in a medium frying pan, then add the chopped leeks. Cook for 2-3 minutes until softened then add to the cheese sauce.", "Melt the rest of the butter in a clean frying pan and gently fry the brioche cubes.", "In a large pan of boiling water cook the broccoli and cauliflower for 2-3 minutes and drain.", "Take an ovenproof dish and lay the broccoli, cauliflower, sauce and brioche, finish with a layer of the Linconshire poacher cheese and brioche. Bake in the preheated oven for 25-30 minutes.", "For the dressing, pour the oil and vinegar in a small glass bowl and whisk in the mustard and lemon juice. Season with salt and pepper.", "To serve, place the baby gem leaves in a bowl, pour the dressing over and mix to combine.", "Spoon the bake onto a serving plate and serve the broccoli alongside and the salad in a small bowl."]}, {"isVegetarian": false, "title": "Broccoli and ham with poached egg", "url": "www_bbc_co_uk_food_recipes_broccoliandhamsalad_88904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "100g/3½oz broccoli florets, cut into pieces", "55g/2oz chestnut mushrooms, sliced", "55g/2oz Parma ham, cut into pieces", "2 tbsp balsamic vinegar", "1 free-range egg, poached to your liking", "55g/2oz Gorgonzola cheese, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the olive oil in a pan and fry the broccoli, mushrooms and ham for 5-6 minutes.", "Remove from the heat, add the balsamic vinegar and the remaining oil and stir to coat.", "Serve the broccoli, mushrooms and ham on a plate with the poached egg on top and the chopped Gorgonzola arranged around."]}, {"isVegetarian": true, "title": "Broccoli and potato soup with cheese, honey and thyme-stuffed bread", "url": "www_bbc_co_uk_food_recipes_broccoliandpotatosou_90315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, chopped", "½ potato, peeled and chopped", "1 head broccoli, chopped", "400ml/14 fl oz vegetable stock", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "½ small loaf country white bread", "salt and freshly ground black pepper", "2 tbsp olive oil", "85g/3oz cheddar cheese, chopped", "3 tbsp chopped fresh thyme", "2 tbsp honey", "1 tbsp double cream, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the soup, heat the olive oil in a frying pan and gently fry the onion and potato for 3-4 minutes, or until the onion is softened. Add the broccoli and stock. Bring to the boil, then reduce the heat and simmer gently for 5-6 minutes, or until the potato and broccoli are tender.", "Stir in the cream and season, to taste, with salt and freshly ground black pepper. Liquidise using a stick blender until smooth. ", "For the bread, hollow out the middle of the loaf and season well with salt and freshly ground black pepper. Drizzle over the oil, sprinkle in the cheese and thyme and finally drizzle in the honey. Place into the oven to bake for 4-5 minutes, or until the cheese is beginning to melt. ", "Serve alongside a bowl of the soup, garnished with a drizzle of cream."]}, {"isVegetarian": true, "title": "Broccoli and potato soup with creamy pistou", "url": "www_bbc_co_uk_food_recipes_broccoliandpotatosou_92460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "½ onion, peeled, chopped", "½ potato, peeled, sliced", "½ head broccoli, cut into small florets", "400ml/14fl oz chicken or vegetable stock", "2 tbsp double cream", "1 handful fresh basil leaves", "2 tbsp pine nuts, toasted", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "1 tbsp double cream", "1 tbsp chopped fresh flatleaf parsley leaves", "1 tbsp chopped fresh chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the butter in a pan over a medium heat and gently fry the onion for 3-4 minutes, until softened. ", "Add the potato and broccoli to the pan and stir. Add the chicken stock and bring the mixture to a simmer. Simmer for 8-10 minutes, or until the vegetables are tender, then stir in the cream.", "Blend the mixture with a stick blender until smooth.", "For the pistou, blend all the pistou ingredients in a food processor until smooth.", "Serve the soup in a bowl with the pistou and cream drizzled over the top. Garnish with the chopped parsley and chervil."]}, {"isVegetarian": true, "title": "Broccoli and Stilton soup with Stilton croûtons", "url": "www_bbc_co_uk_food_recipes_broccoliandstiltonso_76390", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandstiltonso_76390_16x9.jpg", "ingredients": ["350g/12oz broccoli, florets and stalks cut into small pieces", "400ml/14fl oz vegetable stock", "25g/1oz butter", "4 spring onions, finely sliced", "50g/1¾oz Stilton, crumbled, or to taste", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "pinch freshly grated nutmeg", "4 slices French bread", "100g/3½oz Stilton, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, place the pieces of broccoli into a glass bowl. Pour over the vegetable stock.", "Cover the bowl with cling film and place in the microwave. Cook on full power for four minutes, or until tender.", "Meanwhile, heat a frying pan until hot then add the butter. When it starts to foam, add the spring onions and cook for one minute.", "Transfer the cooked broccoli and stock to a food processor. Add the fried spring onions, Stilton and cream and blend until smooth.", "Transfer the blended mixture to a pan and bring gently to a simmer.", "Meanwhile, for the croûtons, toast the French bread under a grill until golden-brown on each side.", "Top the grilled bread with the slices of Stilton and return to the grill until golden-brown and bubbling.", "Season the soup with salt, freshly ground black pepper and a pinch of nutmeg.", "Divide the soup equally among four warm bowls and top each with a Stilton croûton. Serve."]}, {"isVegetarian": false, "title": "Broccoli and salmon bake", "url": "www_bbc_co_uk_food_recipes_broccoliandsalmonbak_77132", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandsalmonbak_77132_16x9.jpg", "ingredients": ["1 onion, chopped", "1 tsp olive oil", "20g/¾oz butter", "20g/¾oz plain flour", "150ml/5fl oz milk", "50g/1¾oz parmesan, grated", "150g/5¼oz salmon steak", "150g/5¼oz broccoli, cut into florets and steamed", "2 carrots, cut into batons and steamed", "6 cherry tomatoes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Gently fry the onions in the oil in a saucepan and cook until soft. Stir in the butter and the flour. Mix thoroughly, cooking on a low heat for one minute.", "Pour in the milk, gradually, until everything is combined. Cook for two minutes.", "Add half the cheese to the sauce and reserve the other half.", "Meanwhile, pan-fry the salmon steak for one minute on each side.", "Lay the salmon steak in a small oven-proof dish.", "Add the broccoli, carrots and cherry tomatoes to the dish.", "Pour over the sauce and top with the rest of the cheese.", "Bake in the oven for ten minutes or until bubbling and golden."]}]