[{"ingredients": ["3 rebanadas de jamón de Parma", "aceite de oliva", "2 rebanadas de pan blanco, cortezas eliminadas, en cubos", "sal y pimienta negra recién molida", "50g / 2oz de gorgonzola", "3 cucharadas de aceite de oliva", "½ limón, solo jugo", "pimienta negra recién molida", "2 puñados de cohete, para servir"], "method": ["Para la ensalada, coloque las rebanadas de jamón de Parma en una sartén caliente y fría durante 1-2 minutos hasta que estén crujientes. Retire de la sartén y reserve. Agregue un poco de aceite de oliva a la sartén, agregue el pan en cubos, sazone con sal y pimienta negra recién molida y fría por tres minutos, o hasta que estén crujientes y dorados.", "Para el aderezo, coloque el gorgonzola, el aceite, el jugo de limón y una buena molienda de pimienta negra en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, amontone el cohete en un plato de servir, cubra con los croutons y las rodajas de jamón de parma y vierta sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_crispyparmahamrocket_86216", "title": "Ensalada crujiente de jamón de parma, rúcula y croûton con aderezo de gorgonzola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de fideos de arroz delgados", "300ml / 10½fl oz de aceite vegetal", "½ chile rojo, sin semillas y picado", "1 diente de ajo, aproximadamente picado", "5 cucharadas de cilantro fresco picado", "2 cucharadas de anacardos picados", "2 cucharadas de aceite de sésamo", "½ chile rojo, sin semillas y finamente picado", "2 cucharaditas de salsa de soja"], "method": ["Para los fideos, caliente el aceite en una cacerola profunda de fondo grueso hasta que la miga de pan chisporrotee y se dore. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Baje los fideos en el aceite caliente y fría hasta que estén crujientes y dorados. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Para el pesto, coloque todos los ingredientes del pesto en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, coloque los fideos crujientes en un bol, agregue el chile y la salsa de soja y mezcle bien. Agregue una cucharada de pesto y sirva."], "url": "www_bbc_co_uk_food_recipes_crispynoodleswithsoy_84535", "title": "Fideos crujientes con salsa de soja y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, sin piel", "sal y pimienta", "harina, para quitar el polvo", "75g / 3oz de pan blanco fresco", "50 g / 2 oz de queso parmesano rallado", "2 huevos de gallinas camperas, golpeados", "aceite de oliva, para cocinar", "gran perilla de mantequilla", "6 tomates, cortados a la mitad", "1-2 dientes de ajo, en rodajas finas", "sal marina gruesa", "puñado de hojas de albahaca fresca", "4 rodajas de limón"], "method": ["Coloque las pechugas de pollo entre hojas de película adhesiva y ligeramente bat, hasta aproximadamente medio a un centímetro / cuarto a media pulgada de grosor. Sazonar con sal y pimienta negra recién molida. Polvo en harina para cubrir completamente, eliminando cualquier exceso.", "Mezcle el pan rallado y el parmesano.", "Sumerja las pechugas de pollo aplastadas (escalopes) en el huevo batido, seguido de las migas de pan de parmesano.", "Calentar un poco de aceite de oliva con la mantequilla en una sartén grande. Una vez que esté chisporroteando, agregue los escalopes molida y cocínelos de tres a cuatro minutos por cada lado hasta que estén crujientes y dorados.", "Para los tomates suaves de albahaca, precaliente la parrilla y coloque las mitades de tomate en una bandeja para hornear, cada una con una rodaja de ajo. Sazonar con un buen toque de pimienta negra fresca y una pizca de sal marina.", "Rocíe con aceite de oliva y la parrilla hasta que se haya exagerado, su suavidad proporciona los escalopes con una salsa para sumergir.", "Rasgue las hojas de albahaca y espárcelas sobre los tomates con un chorrito de aceite de oliva.", "Sirva los escalopes en un plato caliente con los tomates suaves de albahaca y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_crispyparmesanchicke_78047", "title": "Pollo parmesano crujiente con tomates suaves de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispyparmesanchicke_78047_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Picada de cerdo a 70 g / 3 oz", "1 cucharadita de comino molido", "½ cucharadita de copos de chile", "2 limas, solo jugo", "Una pizca de sal marina", "2 cucharadas de cilantro picado", "puñado de albahaca, cilantro, perejil y eneldo", "aceite, a llovizna"], "method": ["Para la carne de cerdo, caliente el aceite en una sartén hasta que esté muy caliente y agregue el cerdo con las especias y el jugo de lima y fría durante 8 minutos hasta que esté dorado y crujiente.", "Revuelva a través del cilantro y quite el fuego.", "Para la ensalada, mezcle las hierbas y rocíe con aceite.", "Para servir, coloque la ensalada en un plato y espolvoree sobre la carne de cerdo."], "url": "www_bbc_co_uk_food_recipes_crispyporksalad_80912", "title": "Ensalada de cerdo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pastinacas grandes", "2 patatas dulces", "1 gran apio nabo", "1 patata grande", "aceite vegetal para freír", "sal para sazonar"], "method": ["Pele las verduras y deseche las pieles.", "Usando el pelador, pele las verduras a lo largo para hacer chips de vegetales finos.", "Pele las chirivías hasta que llegue al núcleo interior resistente.", "precaliente el aceite vegetal a 175C / 325F.", "Pase cada uno de los sabores por separado en los pinchos de madera para cubrir los 10 cm superiores.", "Freír a fondo cada sabor en tandas hasta que estén crujientes y doradas.", "Escurrir sobre papel absorbente y espolvorear con sal."], "url": "www_bbc_co_uk_food_recipes_crispyrootvegetables_10294", "title": "Brochetas de vegetales crujientes de raíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 patatas sin pelar, cada una de aproximadamente 100 g / 3½ oz", "3 cucharadas de aceite de oliva", "1 cucharada de romero fresco finamente picado", "sal", "pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 392F / Gas 6. Pinche cada patata por completo y frote con un poco de aceite. Colóquelos directamente en el estante del horno y hornee por 40-45 minutos hasta que se sientan ligeramente suaves cuando los aprieten, luego déjelos enfriar.", "Corta cada patata por la mitad a lo largo y luego en cuartos. Saque la carne, reteniéndola para otro uso, como puré, y dejando una capa de papa de al menos 5 mm / ½ pulgada de espesor sobre la piel.", "Cepille todo con el aceite restante y colóquelo en una sola capa, con la piel hacia abajo, sobre una rejilla de alambre colocada sobre una lata de asar.", "Sazonar generosamente y espolvorear sobre el romero.", "Hornea durante 30 minutos, volteando hasta la mitad, hasta que estén crujientes y dorados. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_crispypotatoskins_72318", "title": "Pieles crujientes de papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispypotatoskins_72318_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "140g / 5oz de harina de auto crianza", "50ml / 2fl de leche en oz", "mantequilla, para engrasar", "2 rebanadas de tocino, fritas, a la parrilla o al horno hasta que estén crujientes.", "1 cucharada de miel, para servir"], "method": ["Batir los huevos, la harina y la leche en un bol hasta que se forme una mezcla suave y espesa.", "Engrase una sartén caliente con la mantequilla y agregue dos porciones de la mezcla a la sartén para crear panqueques gruesos. Cuando parezca que la superficie burbujea, dé la vuelta a los panqueques y cocínelos por un minuto más o hasta que estén dorados.", "Sirva en un plato caliente con el tocino crujiente al costado y rocíe con miel."], "url": "www_bbc_co_uk_food_recipes_crispysmokedbaconpan_83970", "title": "Crujientes tortas de tocino con miel", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de harina de maíz", "2 cucharadas de sémola o polenta", "1 cucharadita de pimentón ahumado", "Calamares de 200 g / 7 oz (tubos y tentáculos) cuando se descongelan, cortados en anillos", "aceite vegetal, para freír", "½ diente de ajo, aplastado con sal, al gusto", "4 cucharadas de mayonesa"], "method": ["Para el calamar crujiente, mezcle la harina de maíz, la sémola o la polenta y el pimentón en un bol.", "Sumerja los anillos de calamar y los tentáculos en la mezcla, algunos a la vez, para cubrir completamente.", "Caliente el aceite en una cacerola profunda de base pesada hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Cuando el aceite esté lo suficientemente caliente, fría el calamar en lotes durante 1-2 minutos, volteándolos una vez, hasta que estén dorados y crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Mientras tanto, para la mayonesa de ajo, mezcle el ajo triturado en la mayonesa.", "Para servir, coloque el calamar crujiente en un plato de servir con la mayonesa en un tazón pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_crispysquidwithgarli_86853", "title": "Calamar crujiente con mayonesa de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Harina normal de 100 g / 3½ oz", "sal y pimienta negra recién molida", "75ml / 2½fl oz de agua mineral con gas", "Filete de cerdo 100 g / 3½ oz cortado en tiras", "1 cucharada de miel clara", "1½ cucharada de ketchup de tomate", "½ limón, solo jugo", "1 tomate, picado", "½ mango, picado", "2 cucharadas de cilantro, picado", "aceite vegetal para freír", "½ yam, pelado", "sal"], "method": ["Llene la mitad de una olla de aceite de girasol de fondo grueso y caliente hasta que la miga de pan chisporrotee y se dore cuando la agregue (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Para el cerdo agridulce, coloque la harina, la sal y la pimienta negra recién molida en un recipiente grande y agregue gradualmente el agua con gas mientras bate. Batir los ingredientes hasta que la mezcla tenga la consistencia de una crema.", "Sumerja las tiras de carne de cerdo en la masa y sacuda suavemente el exceso de la mezcla.", "Agregue las tiras de carne de cerdo en lotes de dos o tres al aceite vegetal caliente. Cocine por tres minutos o hasta que estén doradas y cocidas. Retire las tiras del aceite con una espumadera y escurra sobre papel de cocina.", "Caliente una cacerola aparte y agregue la miel, la salsa de tomate, el jugo de limón, el tomate y el mango y cocine durante dos minutos mientras revuelve, hasta que estén combinados y caliente. Vierta la mezcla sobre el cerdo y agregue el cilantro picado.", "Para los chips de ñame, vuelva a calentar la cacerola llena de aceite de girasol hasta que la miga de pan chisporrotee y se ponga dorada cuando la agregue (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). 7. Corta el yam en tiras finas usando una mandolina. Enjuague las tiras con agua fría y seque con papel de cocina.", "Agregue las tiras al aceite caliente y cocine durante cinco minutos o hasta que estén doradas y cocidas. Retire las tiras del aceite con una espumadera y escurra sobre papel de cocina. Sazonar con sal al gusto.", "Para servir, coloca la carne de cerdo en un plato limpio y coloca los chips de ñame al lado."], "url": "www_bbc_co_uk_food_recipes_crispysweetandsourpo_84632", "title": "Crujiente de cerdo agridulce con chips de ñame", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chile, sin semillas y finamente picado", "½ puerro, finamente picado", "3 dientes de ajo picados", "1 manojo de raíz de cilantro, picado", "ralladura de 1 lima", "1 cucharadita de comino", "1 cucharadita de salsa de pescado (nam pla)", "200 g / 7 oz de carne picada de pavo", "2 cucharadas de aceite", "1 cucharada de pasta de curry (ver arriba)", "sal y pimienta negra recién molida", "½ mango, en rodajas", "½ chile rojo, sin semillas y en rodajas", "1 diente de ajo, en rodajas", "1 lechuga gema bebé, roto", "puñado de cilantro fresco", "puñado de albahaca fresca", "puñado de menta fresca", "Zumo de 1 lima", "1 cucharadita de azúcar", "1 cucharadita de salsa de soja", "2 cucharaditas de aceite de sésamo"], "method": ["Para la pasta de curry, use un mini procesador de alimentos para mezclar todos los ingredientes de la pasta.", "Para el pavo, caliente el aceite en un wok a fuego alto y luego agregue la carne picada de pavo, cocinando durante unos 5 minutos, hasta que se dore y se vuelva crujiente.", "Agregue una cucharada de pasta de curry y sazone al gusto con sal y pimienta negra recién molida. Revuelva bien para cubrir y calentar. Dejar de lado.", "Para la ensalada, mezcle los ingredientes en un recipiente y divídalos entre dos platos.", "Para el aderezo, mezcle todos los ingredientes.", "Mezcle el aderezo con el pavo crujiente y sirva en la ensalada."], "url": "www_bbc_co_uk_food_recipes_crispythaiturkeysala_78585", "title": "Ensalada de pavo crujiente tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de aceite vegetal, para freír", "100 g / 3½ oz de tofu, cortado en cubos", "50g / 1¾oz de harina natural", "½ cucharadita de pimienta de cayena", "½ cucharadita de cúrcuma", "½ cucharadita de cilantro molido", "½ cucharadita de jengibre molido", "½ cucharadita de curry en polvo", "1 cucharada de aceite vegetal", "2 dientes de ajo picados", "½ mango, en rodajas", "2 chiles rojos de ojo de pájaro, en rodajas", "3 setas, en rodajas", "2 cucharaditas de salsa de soja", "½ lima, en jugo", "½ cucharada de aceite de sésamo", "100 g / 3½ oz de espinaca baby"], "method": ["Para el tofu crujiente, caliente el aceite vegetal en una cacerola profunda de fondo grueso, hasta que esté muy caliente o hasta que se rompa el pan rallado. (PRECAUCIÓN: el aceite caliente es muy peligroso. No lo deje desatendido).", "Coloque la harina y las especias en una taza con sal y pimienta negra recién molida y mezcle bien.", "Coloque el tofu en la mezcla de especias y cubra los cubos de tofu.", "Con cuidado, baje el tofu en el aceite caliente y fría hasta que esté crujiente y dorado. Retire con una espumadera y escurra sobre papel de cocina.", "Para los champiñones, caliente el aceite en una sartén a fuego medio. Agregue el ajo, el mango, la mitad del chile y los champiñones rebanados. Mezcle bien y cocine por un minuto.", "Agregue la salsa de soja, el jugo de lima y el aceite de sésamo y cocine por un minuto más. Agregue la espinaca, mezcle bien y sazone con sal y pimienta negra.", "Para servir, coloque la mezcla de champiñones en un plato de servir y cubra con el tofu. Adorne con el chile rebanado."], "url": "www_bbc_co_uk_food_recipes_crispytofuwithchilli_84493", "title": "Tofu crujiente con chile, ajo, espinacas y setas de soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "Arroz Arborio de 450g / 1lb, enjuagado y escurrido", "salpicar vino blanco", "850ml / 1½ pintas de caldo de verduras, tibio", "100g / 3½oz de tomates secados al sol, picados", "2 cucharadas de crema doble", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "Mozzarella 150 g / 5½ oz, cortada en cubos", "harina común, para dragado", "1 huevo de gallinas camperas, golpeado", "Pan rallado fresco de 150g / 5oz", "hojas de cohete, rociadas con aceite de oliva, para servir"], "method": ["Derrita la mantequilla en una sartén grande de fondo grueso. Agregue el arroz y cocine a fuego lento durante un par de minutos. Cuando el arroz empiece a ser translúcido alrededor de los bordes, agregue el vino y cocine por un minuto.", "Agregue un cucharón lleno de caldo tibio (debe estar tibio para permitir que el arroz se cocine correctamente) y revuelva bien. Cuando el arroz haya absorbido la reserva, agregue otra cucharada de caldo y revuelva de nuevo hasta que se haya absorbido. Continúe agregando acciones de esta manera hasta que se hayan agregado todas las existencias y / o el arroz esté tierno.", "Agregue los tomates secados al sol y la crema y revuelva. Sazonar, al gusto, con sal y pimienta negra recién molida, luego retirar del fuego y dejar que el risotto se enfríe.", "Caliente el aceite vegetal en una cacerola profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Divida el risotto frío en seis y enrolle en bolas. El arroz debe ser bastante pegajoso. Haz un agujero en el centro de cada bola con tu dedo y presiona un poco de la mozzarella en él. Reformar la bola de arroz para cubrir el queso, luego aplanar ligeramente en forma de patty.", "Saque las empanadas en la harina, luego sumérjalas en el huevo batido y finalmente en las migas de pan. Repita la inmersión en el huevo y las migas de pan para asegurarse de que las hamburguesas de arroz estén completamente cubiertas.", "Con cuidado, coloque las hamburguesas en el aceite caliente y fríaselas durante 4-5 minutos o hasta que estén crujientes y doradas. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque una torta de tomate y mozzarella en el centro de seis platos con un puñado pequeño de hojas de rúcula rociadas con aceite de oliva colocadas al costado."], "url": "www_bbc_co_uk_food_recipes_crispytomatoandmozza_85087", "title": "Pasteles crujientes de tomate y mozzarella", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de aceite vegetal para freír", "1 cucharadita de canela", "2 cucharaditas de azúcar en polvo", "2 tortillas de harina listas para usar, cortadas en tiras de 1cm / ½ pulgada", "1 cucharada de yogur griego, para servir (opcional)"], "method": ["Calentar el aceite en una cacerola profunda de fondo grueso, hasta que esté muy caliente o hasta que se queme una migaja de pan (PRECAUCIÓN: El aceite caliente es muy peligroso. No lo deje desatendido).", "Mezcle la canela y el azúcar en un tazón.", "Con cuidado, baje las cintas de tortilla en el aceite caliente y fría hasta que estén crujientes y doradas. Con cuidado, quite con una espumadera y escurra sobre papel de cocina. Espolvorea con azúcar de canela cuando todavía esté caliente.", "Sirva amontonado en un bol con una cucharada de yogur encima"], "url": "www_bbc_co_uk_food_recipes_crispytortillaswithc_84254", "title": "Tortillas crujientes con azúcar canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 huevos grandes de gallinas camperas", "115 g / 4 oz de azúcar en polvo", "2 vainas de vainilla, solo semillas", "250ml / 9fl oz de leche entera", "750ml / 25fl oz de crema doble", "Azúcar demerara 55 g / 2 oz", "1 clara de huevo", "550g / 1lb 4oz de almendras enteras", "200 g / 7 oz de azúcar en polvo", "¼ cucharadita de sal marina", "Ruibarbo 300g / 10½oz, cortado en piezas de 2cm / ¾in", "1 cucharada de azúcar en polvo", "2 naranjas de sangre, solo jugo"], "method": ["Usando un cortador de huevos, corte la parte superior de los huevos grandes y vierta el contenido. Seca las cáscaras de huevo.", "Coloque las yemas de huevo en un bol, agregue el azúcar impalpable y las semillas de vainilla. Batir hasta que esté pálido, esponjoso y bien combinado.", "En una sartén pequeña, hierva suavemente la leche y la crema. Vierta gradualmente sobre la mezcla de huevo.", "Vierta la mezcla en la sartén y cocine hasta que se espese y cubra la parte posterior de una cuchara. Dejar de lado para refrescar.", "Cuidadosamente lavé la mezcla en las cáscaras de huevo secas. Justo antes de servir espolvorear el azúcar demerara en la parte superior y carmelise con un soplete de chef.", "Para las almendras, precaliente el horno a 130C / 110C Fan / Gas 1 y forre una bandeja para hornear.", "Batir ligeramente la clara de huevo con 1 cucharada de agua. Agregue las almendras y revuelva hasta que estén bien cubiertas. Mezcle el azúcar y la sal y espolvoree sobre las nueces. Mezcle para cubrir, y distribuya uniformemente en la bandeja.", "Cocine durante 1 hora en el horno, revolviendo ocasionalmente, hasta que estén doradas. Deja enfriar.", "Aumente la temperatura del horno a 200C / 180C Fan / Gas 6.", "Pon el ruibarbo en una lata de asar. Espolvorea sobre el azúcar, luego rocía sobre el jugo. Asar el ruibarbo en el horno durante 8-12 minutos, o hasta que esté tierno. Deja enfriar. Coloque en una licuadora y mezcle hasta que quede suave.", "Sirva el huevo crème brûlée en un plato al lado del puré de ruibarbo y almendras azucaradas."], "url": "www_bbc_co_uk_food_recipes_crme_brle_with_sugared_29116", "title": "Crème brûlée con almendras azucaradas y un puré de ruibarbo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de atún 8 oz", "2 huevos", "100ml / 3½ fl oz de leche", "Harina de 225g / 8oz", "Pan rallado de 110 g / 4 oz", "1 lima, ralladura rallada solamente", "1 cucharadita de orégano seco", "pizca de sal", "4 cucharadas de aceite vegetal", "4 tomates, toscamente picados", "225g / 8oz de calabacines, cortados en cubitos", "75ml / 3fl oz de aceite de oliva", "1 cebolla roja pequeña, más o menos picada", "1 diente de ajo, picado", "30g / 1oz de aceitunas sin hueso mezcladas, más o menos picadas", "1 filete de anchoa, picado", "½ cucharada de vinagre de vino blanco", "manojo de albahaca", "1 lima, solo jugo", "sal y pimienta"], "method": ["Caliente el aceite de oliva en una sartén y agregue la cebolla y el ajo, y cocínelos hasta que estén blandos.", "Suba el fuego y agregue los calabacines y cocine por otros 2 minutos.", "Reduzca el fuego y agregue los tomates, las aceitunas, la anchoa, el vinagre, las hojas de albahaca, el jugo de lima y el condimento.", "Revuelva todos los ingredientes y reduzca el fuego al mínimo posible y deje cocinar mientras prepara los dedos de pescado, revolviendo ocasionalmente.", "En un recipiente, romper los huevos y batir en la leche.", "En otro tazón mezcle las migajas de pan, la ralladura de lima y el orégano.", "En otro recipiente, coloque la harina.", "Cortar los filetes de atún en los dedos", "Cubra cada trozo de pescado en la harina, luego sumerja en la mezcla de huevo y finalmente en las migas de pan.", "En una sartén grande, caliente el aceite vegetal a fuego moderado y coloque los dedos de pescado recubiertos en el aceite.", "Cocine hasta que se dore por ambos lados y escurra.", "Sirva con una cucharada grande de compota y los dedos de pescado dispuestos a un lado."], "url": "www_bbc_co_uk_food_recipes_crispytunafingerswit_65893", "title": "Crujientes dedos de atún con compota de tomate, calabacín y oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de azúcar en polvo", "Crema doble de 425 ml / 15 fl oz", "1 vaina de vainilla, dividida por la mitad longitudinalmente", "4 huevos medianos de granja", "Harina normal de 250g / 9oz", "250 g / 9 oz de azúcar en polvo", "1½ cucharadita de polvo de hornear", "3 huevos medianos de granja, ligeramente golpeados", "Albaricoques secos de 150 g / 5½ oz, picados", "50 g / 1¾oz pasas, picadas", "125 g / 4½ oz de pistachos sin cáscara", "50 g / 1¾oz de avellanas sin cáscara", "1 limón, ralladura solamente"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para los crème caramels, ponga 175g / 6oz de azúcar y 3 cucharadas de agua en una sartén y llévela a ebullición. Cocine por 4-5 minutos, o hasta que el azúcar se disuelva y se vuelva de color caramelo. (PRECAUCIÓN: el azúcar en ebullición está muy caliente.) Con cuidado, vierta un poco del caramelo en el fondo de 4 moldes grandes o tazas, con cuidado agitando el caramelo por los lados. Aparta para enfriar y endurecer.", "Coloque la crema y la vaina de vainilla en la sartén en la que se hizo el caramelo y cocine a fuego lento.", "Coloque los huevos y el resto de 50 g / 1¾oz de azúcar en un bol y mezcle hasta que quede suave, luego vierta la crema caliente, batiendo todo el tiempo. Pase a través de un colador y vierta en los moldes revestidos de caramelo.", "Coloque los moldes en una lata honda para asar y vierta suficiente agua caliente en la lata de tostado para llegar a dos tercios de los lados de los moldes. Hornee durante 15-20 minutos, o hasta que estén listos, pero todavía tienen un poco de bamboleo (el tiempo exacto dependerá del tamaño de los moldes). Retirar de la lata de asar y dejar enfriar completamente antes de colocar en la nevera para enfriar durante 1-2 horas.", "Para biscotti, precaliente el horno a 180 ° C / 160 ° Fan / Gas 4 y forre una bandeja para hornear con papel para hornear.", "En un tazón grande, mezcle la harina, el azúcar y el polvo de hornear. Agregue la mitad de los huevos batidos y mezcle bien, luego agregue la mitad de lo que queda y vuelva a mezclar. Agregue los huevos restantes un poco a la vez hasta que la masa tome forma pero no esté demasiado mojada (es posible que no necesite todos los huevos). Trabaje la fruta, los frutos secos y la ralladura de limón hasta que estén bien combinados.", "Divida la masa en seis partes por igual. Moje sus manos y enrolle cada pieza en forma de salchicha de unos 5 cm / 2 pulgadas de ancho y colóquelas bien separadas en la bandeja de hornear.", "Aplanar ligeramente las \"salchichas\" y hornear durante unos 20 minutos, o hasta que estén doradas. Retirar del horno y dejar enfriar y endurecer durante 10 minutos.", "Con un cuchillo de sierra, corte las \"salchichas\" formando un ángulo en rodajas muy finas y colóquelas boca abajo en la bandeja de hornear. (Puede necesitar otra bandeja para hornear o hacer el siguiente paso por lotes).", "Devuelva las galletas al horno y hornee por 8 minutos, luego dé vuelta las rebanadas y cocine por otros 8-10 minutos, o hasta que tengan un color dorado pálido. Retirar del horno y enfriar en bastidores de alambre. Cuando está completamente frío, el biscotti se puede almacenar en frascos herméticos durante una semana.", "Para servir, voltee los caramelos de crema en platos para servir y coloque los biscotti al costado."], "url": "www_bbc_co_uk_food_recipes_crme_caramel_with_67126", "title": "Crema de caramelo con biscotti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["625g / 1lb 5oz de harina blanca fuerte, más extra para extender", "12 g / ½ oz de sal", "Azúcar 75g / 3 oz", "20 g / ¾oz de levadura seca", "500 g / 1lb de mantequilla 2oz, refrigerada", "8 barras de chocolate (opcional)", "1 huevo de gallinas camperas, golpeado"], "method": ["Coloque la harina, la sal, el azúcar y la levadura en un tazón grande. Con una cuchara de madera, mezcle lentamente un poco de agua hasta que la mezcla se convierta en una masa flexible.", "Coloque la masa sobre una superficie enharinada y amasar hasta que se sienta elástica.", "Regrese la masa al recipiente, cubra y enfríe en el refrigerador por una hora.", "Regrese la masa refrigerada a su superficie de trabajo enharinada y enrósquela en un rectángulo, alrededor de 60x30cm / 24x12 pulgadas.", "Extienda la mantequilla fría en un rectángulo de aproximadamente 1 cm / ½ pulgadas de espesor, alrededor de 20x30 cm / 8x12 pulgadas.", "Coloque el rectángulo de mantequilla en el centro del rectángulo de masa, por lo que cubre el tercio medio de la masa.", "Doble cada lado de la masa sobre la mantequilla, de modo que haya una capa de masa en la base, una capa de mantequilla y luego dos capas de masa.", "Envuelva la masa en una película adhesiva y enfríe en la nevera durante otra hora.", "Enharinar ligeramente la superficie de trabajo y extender la masa en un rectángulo, alrededor de 60x30 cm / 24x12 pulgadas. Repita el proceso de doblado, doblando los lados largos en el centro, luego devuelva la masa a la nevera durante una hora más.", "Repite este proceso de doblar y enfriar dos veces más, luego envuelve la masa en una película adhesiva y déjala a un lado para que descanse durante la noche.", "Usando un rodillo, extienda la masa descansada a 3 mm / 1 / 8pulg de grosor.", "Use un cortador de croissant para cortar triángulos o corte la masa enrollada en cuadrados, cada uno de 20cm / 8 pulgadas.", "Corta cada cuadrado diagonalmente, formando dos triángulos.", "Coloque los triángulos de masa sobre una superficie ligeramente enharinada con el ángulo recto lejos de usted.", "Haga rodar el croissant hacia el punto del ángulo derecho y enrolle el rollo de masa en una forma de media luna tradicional. Si usa chocolate, agregue el chocolate en la parte más ancha del triángulo, antes de enrollarlo.", "Coloque los cruasanes en forma de bandejas para hornear forradas con pergamino para hornear y deje que se levante durante 1 hora y media.", "Precalentar el horno a 200C / 425F / Gas 6.", "Ligeramente lavar con huevo los croissants y hornear durante 10-15 minutos hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_croissants_91574", "title": "Croissants", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cangrejos enteros pequeños, cocidos", "Queso cheddar Montgomery 35g / 13oz, rallado", "3 cucharadas de leche", "Pan rallado de 25 g / 1 oz", "25 g / 1 oz de harina", "pizca de salsa Worcestershire", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "½ cucharadita de mostaza en polvo inglesa", "25g / 1oz de mantequilla, derretida", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "2 patatas fritas grandes, peladas y cortadas en papas fritas", "2 lechugas Little Gem, solo hojas", "2 cucharadas de aceite de oliva virgen extra", "½ limón, solo jugo"], "method": ["Abra los cangrejos, retire toda la carne blanca y marrón y colóquelos en un tazón. Siente la presencia de pedazos pequeños de caparazón roto y retíralo de la carne. Lave las conchas principales de los cangrejos a fondo y séquelos con papel de cocina.", "Use un tenedor para triturar suavemente la carne de cangrejo marrón y blanca. Sazone con sal y pimienta y coloque la carne de cangrejo nuevamente en las conchas limpias.", "Para hacer la salsa de rarebit, coloque el queso y la leche en una olla pequeña y caliente, revolviendo ocasionalmente para evitar que se enganche, hasta que el queso se derrita. Agregue las migas de pan y la harina y cocine por 2-3 minutos, revolviendo todo el tiempo para evitar que se formen grumos.", "Retirar del fuego y dejar enfriar. Agregue la salsa Worcestershire, el huevo entero, la yema de huevo y el polvo de mostaza. Mezcle bien y sazone, al gusto, con sal y pimienta. Deja de lado mientras preparas las papas fritas.", "Precaliente la freidora a 180 ° C. (PRECAUCIÓN: la grasa caliente puede ser peligrosa. No la deje desatendida).", "Coloque las papas fritas en la grasa caliente y cocine por 3 minutos, o hasta que estén doradas y crujientes. Escurrir en el rollo de cocina y sazonar con sal.", "Para la rarebit de cangrejo, precaliente la parrilla a altura.", "Coloque las cáscaras de cangrejo llenas en una bandeja para hornear. Con una cuchara, coloca la salsa rarebit encima de la carne de cangrejo. Rocíe un poco de mantequilla derretida sobre la parte superior y colóquela debajo de la parrilla caliente durante unos minutos hasta que la rarebit burbujee y se dore.", "Cuando esté listo para servir, vista las hojas de Little Gem con el aceite de oliva y el jugo de limón.", "Sirve la rarebit de cangrejo en las conchas con ensalada y papas fritas al lado."], "url": "www_bbc_co_uk_food_recipes_cromercrabrarebitwit_87267", "title": "Cangrejo raro con papas fritas y una ensalada Little Gem", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para engrasar", "500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "10 g / ¼ oz de levadura de acción rápida", "10 g / ¼ oz de sal", "80g / 2¾oz de azúcar en polvo", "2 huevos medianos de granja", "125ml / 4½ oz de leche entera, calentada hasta que esté tibia", "250g / 9oz de mantequilla sin sal, refrigerada", "25 g / 1oz de mantequilla sin sal", "2 cucharadas de harina normal", "250ml / 9fl oz de leche entera", "1 cucharada de mostaza integral", "sal y pimienta negra recién molida", "½ cucharada de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "200 g / 7 oz de champiñones mixtos, en rodajas finas", "200g / 7oz de panceta, 12 lonjas dejadas enteras, el resto cortado en pedazos pequeños", "2 ramitas de tomillo fresco, hojas recogidas", "1 cucharadita de ajo finamente picado", "1 cucharadita de polvo de porcini (puede hacer los suyos pulsando setas porcini secas en un procesador de alimentos)", "Gruyère 150 g / 5½ oz, rallado", "Emmental de 75 g / 2½ oz, rallado", "1 huevo mediano de granja, batido con 2 cucharaditas de leche"], "method": ["Para hacer la masa, instale una mezcladora independiente con un accesorio de gancho de masa y engrase un recipiente grande con un poco de aceite de oliva.", "Agregue la harina, luego coloque la levadura a un lado del tazón y la sal y el azúcar en el lado opuesto.", "En una jarra, mezcle los huevos, la leche y 4 cucharadas de agua. Viértalo en la mezcla de harina y mezcle a baja velocidad durante 2 minutos (puede que tenga que empujar la masa hacia abajo del gancho de vez en cuando). Aumente la velocidad a medio y mezcle por otros 6 minutos.", "Enharine ligeramente una superficie de trabajo y saque la masa. Forma la masa en una bola suave. Transfiera al tazón engrasado y cubra con una toalla de té limpia o una película adhesiva engrasada. Deje probar durante una hora o hasta que duplique su tamaño.", "Mientras tanto, aplana la mantequilla en un rectángulo de aproximadamente 1 cm / ½ pulgada de grosor. Coloque entre 2 pedazos de papel para hornear y guárdelos en la nevera hasta que los necesite.", "Hierva la superficie de trabajo nuevamente, luego incline la masa levantada. Aplánelo y extiéndalo en un rectángulo de aproximadamente 40x15 cm / 16x6 pulgadas y aproximadamente 1 cm / ½ pulgada de grosor. Organiza la masa con uno de los bordes cortos más cercanos a ti. Coloque la mantequilla en el centro de la masa, doble la masa sobre la mantequilla en el centro para que la masa se superponga ligeramente. Pellizque todos los bordes para sellar la mantequilla en la masa. Coloque en una bolsa plástica para alimentos y enfríe en el congelador por 10 minutos.", "Coloque la masa fría sobre una superficie de trabajo ligeramente enharinada con uno de los bordes cortos más cercanos a usted. Estirar la masa en un rectángulo de 40x15 cm / 16x6 pulgadas y doblar en tres capas (como una letra). Coloque en una bolsa de plástico en el congelador durante 10 minutos. Repita el laminado y el plegado como antes, luego regrese al congelador por otros 10 minutos. Repita el laminado y doblado una vez final, luego enfríe la masa durante 30 minutos en una bolsa de plástico en la nevera.", "Mientras tanto, para la salsa bechamel, en una cacerola de fondo grueso, derrita la mantequilla a fuego medio. Agregue la harina y revuelva constantemente durante aproximadamente 3 minutos, hasta que esté completamente suave. Vierta la leche en un chorro delgado y constante, batiendo todo el tiempo, y cocine la salsa durante unos 5-10 minutos, o hasta que quede suave y espesa. Retirar del fuego e incorporar la mostaza, probar y sazonar con sal y pimienta.", "Agregue un tercio de los quesos rallados (de los ingredientes de relleno salados) y mezcle hasta que el queso se haya derretido y la salsa esté suave. Cubra la superficie de la salsa con film transparente para evitar que la piel se forme y deje que se enfríe.", "Para el relleno, caliente el aceite de oliva y la mantequilla en una cacerola a fuego medio. Una vez caliente, agregue los champiñones, la panceta en rodajas y el tomillo y fría por unos 3-5 minutos. Agregue el ajo y el polvo de porcini y fría por otros 3 minutos. Sazonar con sal y pimienta y dejar enfriar.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para ensamblar, extienda la masa hasta 5 mm / ¼ de grosor y colóquela en una bandeja grande para hornear. Enfriar en la nevera durante 15 minutos para permitir que la masa descanse y se endurezca. Vuelva a tirar si es necesario hasta que la masa sea 30x40cm / 12x16in. Usando un cuchillo afilado cortado en doce cuadrados de 10cm / 4 pulgadas.", "Deje un borde de 1 cm / ½ pulgada, corte un cuadrado de 4 cm en el centro de cada cuadrado, cortando a la derecha a través de dos esquinas opuestas del cuadrado interior, pero dejando las otras dos esquinas simplemente conectadas a cada lado de los puntos de las esquinas. Cepille el cuadrado interior con un pequeño lavado de huevos. Dobla la esquina de la esquina a la esquina, tirando una sobre la otra y presionando en la esquina opuesta del cuadro interior, luego repite con el otro lado (mira a Paul Hollywood hacia el final del video de la técnica a continuación - es fácil cuando tienes lo he visto hecho). Cepille toda la masa con la colada de huevo.", "En el medio de cada repostería coloque unas cucharadas del relleno de la panceta de champiñones. Coloque una barra de panceta sobre cada una, arrugada, luego cubra con 1-2 cucharaditas de salsa bechamel. Espolvoree con el gruyère y emmental restantes, luego sazone con pimienta negra.", "Hornee por 20-25 minutos, o hasta que la panceta esté cocida y la masa crujiente y dorada. Enfriar un poco en bastidores de alambre, los pasteles se pueden comer calientes o fríos."], "url": "www_bbc_co_uk_food_recipes_croque_monsieur_kites_99020", "title": "Cometas croque monsieur", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/croque_monsieur_kites_99020_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de ciabatta, cortezas", "25g / 1oz de mantequilla, ablandada", "2 rebanadas de jamón", "5 hojas de albahaca fresca", "Dolcelette 85g / 3oz, desmenuzado", "1 lechuga Little Gem, picada", "dash aceite de oliva", "dash vinagre balsámico"], "method": ["Coloque las rebanadas de pan ciabatta sobre una superficie plana, extienda un lado con mantequilla y dé vuelta, con la mantequilla hacia abajo.", "Cubra con prosciutto, albahaca y Dolcelatte, luego coloque la otra rebanada de pan encima, con la mantequilla hacia arriba.", "Calentar una sartén antiadherente, agregar el sándwich y freír en sartén durante tres minutos por cada lado. Transfiere a un plato y córtalo en triángulos.", "Para la ensalada, mezcle la lechuga Little Gem, el aceite de oliva y el vinagre balsámico en un tazón pequeño.", "Para servir, amontone la mezcla de lechuga Little Gem en un plato para servir, cubra con el croque monsieur y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_croquemonsieur_86892", "title": "Dolcelatte croque monsieur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]