[{"ingredients": ["Harina de auto crianza 110g / 4oz", "1 cucharadita de polvo de hornear", "2 huevos de gallinas camperas", "150ml / ¼ litro de leche", "1 cucharada de sultanas", "1 cucharada de aceite vegetal", "5 cucharadas de crema doble", "4 cucharadas de chocolate y avellanas", "2 cucharadas de licor de naranja", "1 cucharadita de ralladura de satsuma picada", "2 cucharadas de pistachos picados, para servir"], "method": ["Para los panqueques, coloque la harina, el polvo de hornear, los huevos y la leche en un tazón grande y mezcle para formar una masa suave. Agregue las sultanas y revuelva.", "Caliente el aceite vegetal en una sartén antiadherente y vierta un cucharón de masa, agitando la sartén para que la masa cubra la base en una capa fina. Freír durante 1-2 minutos en cada lado hasta que estén doradas. Retire el panqueque de la sartén y déjelo a un lado para mantenerlo caliente. Repita el proceso con la masa restante.", "Para la salsa de chocolate, coloque la crema, la mezcla de chocolate y avellanas, el licor de naranja y la ralladura de satsuma en una olla pequeña y caliéntelo suavemente, revolviendo con frecuencia, hasta que esté suave y bien combinado.", "Para servir, coloque los panqueques en platos para servir, rocíe sobre la salsa y espolvoree los pistachos."], "url": "www_bbc_co_uk_food_recipes_pancakeswithcrushedn_86112", "title": "Panqueques con nueces machacadas y salsa de chocolate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 170g / 6oz", "1 cucharada de levadura en polvo", "115 g / 4 oz de azúcar en polvo", "2 huevos", "275 ml / 10 fl oz de leche", "Tocino ahumado ahumado 230g / 8oz", "miel de maple", "mantequilla para freír"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina, el polvo de hornear y el azúcar impalpable en un tazón.", "Usando un batidor, agregue los huevos y la leche. Tenga cuidado de no overwhisk. Poner a un lado.", "Coloque el tocino en la bandeja del horno y hornee hasta que quede crujiente.", "Retire y cepille un poco del jarabe de arce.", "Para cocinar los panqueques, precaliente una sartén antiadherente. Agregue un poco de mantequilla y vierta alrededor de tres cucharadas de la mezcla en la sartén - los panqueques deben ser bastante pequeños. Cocine hasta que se doren y gírelo para colorear el otro lado. Retire y coloque en un plato grande.", "Para servir, amontone los panqueques en el plato y coloque el tocino por encima y encima. Rocíe con sirope de arce y sirva."], "url": "www_bbc_co_uk_food_recipes_pancakeswithcrispyma_72298", "title": "Panqueques con tocino de arce crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "½ naranja, solo ralladura", "100g / 3½ oz de harina de auto crianza", "½ cucharadita de polvo de hornear", "75ml / 2¾fl de leche en oz", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite vegetal", "azúcar en polvo, para quitar el polvo", "½ naranja, pelada y segmentada", "3 cucharadas de jarabe de arce"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los huevos, la ralladura de naranja, la harina, el polvo de hornear y la leche en un tazón grande y agítelos para formar una masa suave.", "Caliente la mantequilla y el aceite en una sartén poco profunda a fuego medio.", "Vierte un cuarto de la mezcla de la mezcla en la sartén para hacer un panqueque grande y grueso. Cocine por un minuto en cada lado, hasta que estén dorados.", "Transfiera a una bandeja para hornear y repita el proceso de fabricación de panqueques para cocinar tres panqueques más.", "Una vez que tenga cuatro panqueques colocados en la bandeja para hornear, coloque en el horno para hornear durante dos minutos.", "Para servir, apilar los panqueques en un plato caliente y espolvorear con azúcar glas. Coloque los segmentos de naranja alrededor del plato y rocíe los panqueques con jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_pancakeswithmaplesyr_79985", "title": "Panqueques con jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "125ml / 4½ fl oz de leche", "50g / 1¾oz de tocino", "1 cucharada de aceite, para freír", "25 g / 1 oz de queso parmesano", "Harina normal de 75g / 3oz", "1 cucharadita de chile en polvo (opcional)", "pizca de sal", "2 huevos de gallinas camperas"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Coloque dos bandejas para hornear con papel pergamino y déjelas a un lado.", "Pon una sartén pequeña a fuego medio para la panceta.", "Luego, ponga la mantequilla y la leche en una sartén mediana a fuego lento y deje que la mantequilla se derrita.", "Mientras tanto, incline la panceta en la sartén con un chorrito de aceite y cocine durante unos cuatro minutos, lanzando de vez en cuando.", "Una vez que la mantequilla se haya derretido en la leche, calienta el fuego y lleva a ebullición.", "Mientras tanto, ralla finamente el parmesano y colócalo en un tazón mediano. Agregue la harina, el chile en polvo (si se usa) y una pizca de sal.", "Tan pronto como hierva la leche mantecosa, retire la sartén del fuego y agregue la mezcla de harina. Batir muy duro con una cuchara de madera hasta que la mezcla comience a dejar los lados de la sartén. Luego colócalo en un tazón mediano, extiéndelo por todo el interior y déjalo unos minutos hasta que se enfríe al tacto.", "Una vez que la panceta esté crujiente y dorada, retírela del fuego y colóquela sobre la toalla de cocina para drenar el exceso de grasa. Luego finamente picarlo y reservarlo.", "Una vez que la mezcla de harina se haya enfriado un poco, agregue los huevos, uno por vez, batiendo con fuerza entre cada adición. Cuando el huevo entra por primera vez, la mezcla se verá un poco menos que agradable, como si no se mezclara, pero sigue latiendo muy fuerte y saldrá bien. Luego agregue la panceta.", "Ahora, aquí puedes dorar gotas de la pasta choux en las bandejas para hornear o, (mi método favorito con la obsesión de la manga pastelera), pipetear las burbujas con un corte desechable en una manga para dar una abertura de 3cm / 1¼in. De cualquier manera, hazlos de 2-3 cm / ¾-1¼ in de diámetro y sepáralos un poco. Esto produce alrededor de 25. Use un dedo ligeramente humedecido con agua para empujar hacia abajo las puntas de los extremos que puedan estar sobresaliendo (para que no se quemen en el horno). Luego hornea por 25 minutos.", "Las bocanadas deben estar crujientes y doradas en la parte superior cuando estén cocidas. En realidad, lo mejor es que estén calientes cuando aún están ligeramente húmedos, ya que están abiertos."], "url": "www_bbc_co_uk_food_recipes_pancetta_and_parmesan_96186", "title": "Soplos de Pancetta y parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 25 bocanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancetta_and_parmesan_96186_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["70g / 2½ oz de pan blanco fresco", "2 cucharadas de leche entera", "500 g / 1 libra de carne picada 2 oz", "1 diente de ajo, aplastado", "1 cucharada de puré de tomate", "1 cucharada de salsa Worcestershire", "2 cucharadas de hojas de perejil de flatleaf picadas", "12 rebanadas finas redondas pancetta", "sal y pimienta negra recién molida", "Mayonesa 150 g / 5½ oz", "1 cucharadita de mostaza Dijon", "1 cucharada de hojas de estragón fresco picado", "6 pan ciabatta o crujiente, reducido a la mitad", "60 g / 2¼ oz de hojas de espinaca", "150 g / 5½ oz de salsa de cebolla caramelizada, de un frasco", "Cheddar maduro de 150 g / 5½ oz, en rodajas finas", "6 pepinillos, en rodajas finas"], "method": ["Coloque las migas de pan y la leche en un recipiente, mezcle y deje a un lado durante 5 minutos, o hasta que la leche se absorba. Agregue la carne picada, el ajo, el puré de tomate, la salsa Worcestershire y el perejil, sazone con sal y pimienta y mezcle bien.", "Forme la mezcla en seis hamburguesas grandes y planas. Coloque una rodaja de panceta en ambos lados de cada hamburguesa. Caliente una sartén grande a fuego alto. Agregue las empanadas y cocine, en lotes, durante 4 minutos en cada lado, o hasta que la panceta esté cocida y las hamburguesas estén hechas a su gusto.", "Para la mayonesa de estragón, coloca la mayonesa, la mostaza y el estragón en un tazón y mezcla. Dejar de lado.", "Precalienta la parrilla a altura, luego tuesta los panecillos. Esparcirlos con la mayonesa de estragón y cubrir con espinacas, empanadas, cebolla caramelizada y Cheddar. Sirve con los pepinillos."], "url": "www_bbc_co_uk_food_recipes_pancetta_beef_burger_25307", "title": "Hamburguesa de carne Pancetta con mayonesa de estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancetta_beef_burger_25307_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de 85g / 3oz de levante", "1 huevo de gallinas camperas", "300 ml / ½ litro de leche (aprox)", "llovizna de aceite", "Azúcar en polvo de 55 g / 2 oz", "salpicar agua caliente", "30 g / 1¼ oz de cacao en polvo"], "method": ["Para hacer los panqueques, bata la harina, el huevo y la leche en un bol para hacer un batido.", "Caliente el aceite en una sartén y vierta la mezcla. Deje que la mezcla cubra la sartén y fría el panqueque durante 1-2 minutos en cada lado o hasta que esté dorado.", "Repita para hacer más panqueques.", "Para la salsa, mezcle el azúcar, el agua y el cacao en una sartén pequeña a fuego suave. Agregue agua extra dependiendo de qué tan grueso requiera la salsa.", "Para servir, transfiera los panqueques a un plato de servir y rocíe la salsa de chocolate."], "url": "www_bbc_co_uk_food_recipes_pancakeswithchocolat_76457", "title": "Panqueques con salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancakeswithchocolat_76457_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de harina de auto crianza", "½ cucharadita de polvo de hornear", "2 huevos de gallinas camperas", "60ml / 2¼fl de onza de leche", "½ cestones de arándanos", "2 cucharadas de azúcar glas", "25g / 1oz de mantequilla", "4 cucharadas de vino tinto", "4 cucharadas de azúcar", "2 dientes", "pizca de especias mixtas", "½ cestones de arándanos"], "method": ["Coloque en un tazón la harina de levante, el polvo de hornear, los huevos y la leche. Mezcle para formar una masa espesa.", "Agregue el azúcar glas y los arándanos.", "Derrita la mantequilla en una sartén y el cucharón en la tortita de arándanos mezcle un cucharón a la vez. Cocine los panqueques hasta que estén dorados, en ambos lados.", "Apila los panqueques de arándanos y déjalo a un lado.", "Para la salsa de arándanos, en una sartén agregue el vino tinto con azúcar, clavo de olor, especias mixtas y arándanos.", "Cocine a fuego lento durante cuatro minutos y quítese el fuego.", "Pon la salsa en un colador y quita los dientes.", "Para servir, coloque la pila de panqueques en el medio del plato y rocíe con la salsa de arándanos."], "url": "www_bbc_co_uk_food_recipes_pancakeswithblueberr_78335", "title": "Panqueques con salsa de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de girasol, para engrasar", "12 rebanadas de tocino", "3 huevos de gallinas camperas", "Crema doble 125ml / 4½fl oz", "20g / ¾oz de parmesano recién rallado", "pequeñas hojas de albahaca fresca, rasgada", "sal y pimienta negra recién molida", "240g / 8½oz de guisantes congelados", "3 cucharadas de menta fresca picada", "1 limón, solo jugo", "2 cucharadas de aceite de oliva", "50 g / 1¾oz de hojas de espinaca baby", "100 g / 3½ oz de queso feta, desmenuzado", "pan lavosh (panes planos), para servir"], "method": ["Para los huevos de panceta horneados, precaliente el horno a 180C / 350F / Gas mark 4 y engrase 4 orificios de una bandeja para muffins de 12 orificios.", "Alinea cada hojaldre con 3 rebanadas de panceta.", "Batir los huevos, la crema, el parmesano y las hojas de albahaca en un tazón hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Divida la mezcla entre los agujeros del panecillo y hornee en el horno durante 10-12 minutos, o hasta que los huevos estén listos.", "Mientras tanto, para la ensalada de guisantes y menta, vierta agua hirviendo sobre los guisantes congelados y déjela reposar durante 2 minutos. Escurrir, luego refrescar en agua fría.", "Mezcle los guisantes, la menta, el jugo de limón y el aceite de oliva en un bol hasta que estén bien combinados.", "Para servir, divida la espinaca entre cada uno de los 4 platos para servir y coloque encima una ensalada de guisantes y menta. Espolvorea sobre el queso feta desmenuzado. Sirva los huevos al horno junto con el pan lavosh."], "url": "www_bbc_co_uk_food_recipes_pancettabakedeggswit_93866", "title": "Huevos horneados con pan de pita con ensalada de guisantes y queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancettabakedeggswit_93866_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4½fl oz de crema individual", "2 peras, peladas, sin núcleo", "Queso de oveja 110 g / 4 oz, finamente rallado", "½ cucharadita de goma de xantano (disponible en tiendas naturistas y en línea)", "6 grandes langostinos crudos, pelados, desvainados", "6 pinchos de madera, empapados en agua durante diez minutos", "6 rebanadas finas de panceta ahumada", "2 cucharadas de harina", "1 cucharadita de pimentón ahumado", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de aceite vegetal, para freír", "4 remolachas pequeñas, cocidas, peladas, finamente picadas", "1 manzana Granny Smith, pelada, sin núcleo, finamente picada", "1 naranja mandarina, pelada, médula blanca eliminada, segmentada", "6 hojas de menta fresca, finamente picadas", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "½ pera, sin núcleo, cortado longitudinalmente en rodajas finas", "pequeño puñado de perejil de flatleaf fresco picado"], "method": ["Para el pecorino y la espuma de pera, mezcle la crema y las peras en un procesador de alimentos en un puré fino y cuele esta mezcla a través de un colador.", "Caliente la mezcla de pera y crema colada y el pecorino rallado en una cacerola a fuego lento, revolviendo constantemente, durante 1-2 minutos, o hasta que el queso se haya derretido. Agregue el chicle xanthum a la mezcla y bata para disolver y espesar la mezcla.", "Cuando la mezcla se enfríe, vierta en una pistola de espuma y cargue con dos cargadores de gas. Guárdelo en la nevera hasta que lo necesite. (Si no tiene una pistola de espuma, mezcle la salsa con una batidora de mano hasta que esté ligera y espumosa antes de servir).", "Para las gambas, pase las gambas a los pinchos de madera de arriba a abajo para que las gambas se enrosquen en los pinchos en línea recta. Envuelva cada pincho de gambas en un trozo de panceta.", "Mezcle la harina y el pimentón en un bol y sazone al gusto con sal y pimienta negra recién molida. Batir los huevos en un tazón. Saque cada brocheta de gambas en la harina, sacuda el exceso y luego sumérjalo en el huevo batido. Separe cada brocheta de gambas en la harina y sacuda el exceso.", "Calentar el aceite vegetal en una sartén y freír los pinchos de gambas durante 3-4 minutos, o hasta que las gambas estén cocidas, doradas y crujientes. (Puede necesitar hacer esto en lotes).", "Para la ensalada, mezcle todos los ingredientes en un bol hasta que estén bien combinados.", "Para servir, coloque la ensalada en un extremo de cada una de las dos placas de servir. Rocíe el pecorino y la espuma de pera en el medio de las placas y cubra con las gambas machacadas. Coloque las rodajas de pera en el otro lado de cada una de las placas y esparza con el perejil."], "url": "www_bbc_co_uk_food_recipes_pancettakingprawnspe_93112", "title": "Gambas Pancetta, pecorino y espuma de pera y una ensalada de remolacha y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla", "Hojas de espinaca baby 110g / 4oz", "nuez moscada recién rallada", "sal y pimienta negra recién molida", "4 rebanadas de tocino", "Registro de queso de cabra suave sin corteza 200g / 7oz", "Hojaldre de 250 g / 9 oz, laminado a 5 mm / ¼ de grosor", "1 huevo de gallinas camperas, golpeado", "110g / 4oz de azúcar mascabado ligero", "1 chalote, finamente picado", "1 cucharadita de jengibre fresco, finamente picado", "1 cucharadita de especias mixtas", "½ cucharadita de hojuelas de chile seco", "2 manzanas, sin corazón y picadas", "Sultanas 110 g / 4oz", "Vinagre de vino blanco 60ml / 2½fl oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el en croute, derrita la mantequilla en una sartén a fuego medio. Agregue las espinacas y cocínelas hasta que estén marchitas.", "Agregue una pizca de nuez moscada recién rallada y sazone bien con sal y pimienta negra recién molida. Retire de la sartén y deje enfriar.", "Envuelva las lonjas de panceta alrededor del queso de cabra.", "Coloque en la misma sartén caliente y cocine por dos minutos en cada lado, luego retírelo y póngalo a un lado para que se enfríe.", "Corta la masa de hojaldre en dos rondas grandes. Coloque la espinaca en el centro de una de las rondas de repostería.", "Cubra las espinacas con el queso de cabra enfriado con panceta y sazone bien con sal y pimienta negra recién molida.", "Cepille el borde de la masa de repostería con el huevo y coloque la porción restante de masa sobre la parte superior. Presione la pastelería hacia abajo y ribetee los bordes.", "Anota la parte superior de la masa en un patrón circular y cepilla con el resto de la colada de huevo. Coloque el paquete de repostería en una bandeja de horno y transfiéralo al horno para hornear por 20 minutos, o hasta que esté dorado y cocido.", "Para el chutney, caliente una sartén, agregue el azúcar y permita que se derrita.", "Agregue todos los ingredientes restantes de chutney y cocínelos durante 15-20 minutos, hasta que las manzanas estén blandas y la salsa picante se haya espesado ligeramente, luego retírela del fuego y deje que se enfríe.", "Para servir, coloque la mitad del queso de cabra en croute en cada plato con una cucharada de chutney colocada al costado."], "url": "www_bbc_co_uk_food_recipes_pancettawrappedgoats_85603", "title": "Queso de cabra envuelto en pancetta con salsa picante de manzana y chili", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paleta de cerdo o panceta de cerdo de 750 g / 1½ lb, cortada en cubos de 2,5 cm / 1 in", "2 cucharadas de jengibre y pasta de ajo (hecha de 1cm / ½ en ajo, 1cm / ½ en jengibre y ½-1 cucharadita de aceite vegetal, mezclado en una pasta)", "1 cucharadita de cúrcuma molida", "2 cucharaditas de sal", "8-10 granos de pimienta negros enteros", "3 hojas de laurel", "Anís de 2 estrellas", "4 cucharadas de miel clara", "3 cucharadas de salsa de soja", "Vainas de 10 kokum (kokum), empapadas en 110 ml / 4 fl oz de agua caliente para ablandar (disponible en algunas tiendas de comestibles asiáticas)", "1 Manzana Granny Smith, o manzana verde afilada similar, sin núcleo, carne picada finamente", "2 cabezas bebé hinojo, finamente picado", "1 cucharadita de semillas de hinojo, ligeramente tostadas en una sartén seca", "200 g / 7 oz de yogur griego", "½ cucharadita de sal", "1 cucharadita de azúcar en polvo", "2 cucharadas de aceite vegetal", "4 chiles rojos secos", "10 hojas de curry (disponibles en algunos supermercados asiáticos)", "2 chiles verdes frescos, divididos", "2 cebollas rojas medianas, en rodajas", "sal y pimienta negra recién molida", "½ lima, solo jugo", "berro de cilantro pequeño, u otras micro hojas, para servir"], "method": ["Para el cerdo, coloque los cubos de cerdo en un plato grande. Agregue los ingredientes restantes de cerdo, cúbralos y luego deje macerar durante la noche en la nevera.", "Cuando los cubitos de cerdo se hayan marinado, transfiéralos y el adobo a una sartén grande de base pesada. Agregue suficiente agua para cubrir los cubos de cerdo y cocine, tapado, a fuego muy lento durante 1-1½ horas o hasta que la carne se deshaga.", "Mientras tanto, para la raita de manzana e hinojo, mezcle todos los ingredientes de raita de hinojo y manzana en un bol hasta que estén bien combinados. Enfriar en la nevera hasta que sea necesario.", "Escurra el cerdo cocinado y déjelo a un lado (reserve el líquido para cocinar).", "Para sofreír, caliente el aceite en un wok a fuego alto. Cuando el aceite esté humeando, agregue los chiles rojos secos y saltee hasta que se hayan oscurecido y estén fragantes.", "Agregue las hojas de curry y saltee durante 30 segundos o hasta que estén crujientes y fragantes.", "Agregue los chiles verdes partidos y las rodajas de cebolla roja y saltee durante 2-3 minutos hasta que se ablanden.", "Agregue los cubos de cerdo cocidos y fría, revolviendo continuamente, durante 3-4 minutos o hasta que estén dorados. (Si la carne parece seca, agregue 1-2 cucharadas del líquido de cocción reservado y continúe cocinando hasta que se haya evaporado, esto esmaltará los cubos de cerdo). Sazone al gusto con sal y pimienta negra recién molida, luego exprímalo. el jugo de lima y revuelva para combinar.", "Para servir, espolvorea un poco de curry en el centro de cada uno de los cuatro platos para servir. Coloque una porción de raita de manzana e hinojo junto con cada porción. Espolvorea sobre las hojas de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_pandhicurrycoorgpork_91467", "title": "Curry Pandhi (salteado de cerdo al estilo Coorg) con raita de manzana e hinojo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 filete de merluza", "4 rebanadas de tocino", "30 g / 1 oz de mantequilla sin sal, más más si es necesario", "1 diente de ajo, pelado y aplastado", "4 cebolletas, finamente picadas", "salpicar vino blanco", "1 cucharadita de cebollín fresco, picado", "sal y pimienta negra recién molida", "150g / 5¼oz de patatas nuevas cocidas"], "method": ["Para hacer el pescado, caliente el aceite en una sartén antiadherente. Envuelva la merluza en las rebanadas de panceta y luego fríe en la sartén por 2-3 minutos en cada lado, o hasta que la panceta esté dorada.", "Para las papas, derretir suavemente la mantequilla en una sartén y saltear el ajo y la cebolla tierna durante dos minutos, para suavizar. Agregue el vino, el cebollín y la sal y pimienta negra recién molida. Con un suave batidor de calor, agregue un poco más de mantequilla para hacer una salsa.", "Agregue las papas nuevas a la sartén para calentarlas.", "Para servir, transfiera las papas mantecosas a un plato para servir y sirva el pescado envuelto al costado."], "url": "www_bbc_co_uk_food_recipes_pancettawrappedhakew_76449", "title": "Pancetta envuelve merluza con patatas nuevas y beurre blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "5g de sal", "125 g / 4½ oz de azúcar en polvo", "10g de levadura de acción rápida", "1 naranja, ralladura fina solamente", "1 limón, ralladura finamente rallada solamente", "150 g / 5½ oz de mantequilla ablandada, más extra para engrasar", "2 huevos medianos de granja (preferiblemente Burford Brown u otras variedades de yema oscura)", "2 yemas de huevo de gallinas camperas (preferiblemente Burford Brown u otras variedades de yema oscura)", "2 cucharaditas de pasta de vainilla", "100ml / 3½ fl oz de leche, calentada", "azúcar en polvo, para quitar el polvo"], "method": ["Coloque la harina en el cuenco de un mezclador independiente equipado con un gancho de masa. Agregue la sal y el azúcar en polvo a un lado del recipiente y la levadura al otro lado. Agregue la ralladura de naranja y limón, la mantequilla ablandada, los huevos, las yemas de huevo, la vainilla y la leche. Comience a baja velocidad y mezcle para formar una masa pegajosa húmeda.", "Aumente la velocidad en el mezclador y mezcle durante 10 minutos. La masa ahora debería tener una consistencia más espesa y adherirse al gancho de la masa. Si la masa cae desde la mezcla del gancho de masa durante otros 5 minutos, o hasta que se consiga la consistencia correcta.", "Rocíe ligeramente la superficie de trabajo con harina, incline la masa y amaselo suavemente para formar una bola. Coloque la masa en un recipiente ligeramente engrasado, cubra y deje probar hasta que duplique su tamaño. Esto puede tomar 4 horas, pero para obtener mejores resultados, déjelo de un día para otro.", "Engrase un molde pandoro de 500 g / 1 lb 2 oz con mantequilla. Incline la masa hacia una superficie de trabajo ligeramente enharinada y pliéguela unas cuantas veces para quitar el aire. Forme una bola y colóquela en la lata preparada, presionando suavemente en las esquinas de la lata. Cubra y deje que se levante hasta que llegue a la parte superior de la lata, esto tomará 1½-2 horas.", "Precaliente el horno a 190C / 170C Fan / Gas 5. Destape el pandora y hornee durante 35-40 minutos. Para probar que el pandoro esté cocido, inserte un pincho en el centro, si sale limpio, se cocina. Dejar enfriar en la lata durante 5 minutos, luego dejar enfriar en una rejilla", "Antes de servir, recorte la base para que quede plana sobre un plato para servir. Cortar en rebanadas gruesas horizontales y girar las rebanadas. Polvo con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_pandoro_93030", "title": "Pandoro", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 litros / 3½ pintas de leche entera", "200-250ml / 7-8¾fl oz de yogur fresco en vivo, o 2 cucharadas de jugo de limón"], "method": ["Llevar la leche a ebullición en una cacerola de base pesada.", "Una vez que la leche comience a hervir y levantarse, mezcle el yogur o el jugo de limón. Manteniendo la leche en el fuego, revuelva suavemente para ayudar a que la leche cuaje; solo debería tomar alrededor de un minuto. Si no se separa, agregue el resto del yogur y siga revolviendo. La cuajada se coagulará y separará del suero acuoso.", "Retire del fuego.", "Alinee un tamiz grande con muselina o gasa y coloque sobre un tazón grande o una cacerola. Cuele el queso en el tamiz y pase un poco de agua fría a través de él. Deseche el suero de leche o use para otro propósito.", "Envuelva el queso en la tela y cuelgue del grifo de la cocina sobre el fregadero para permitir que el exceso de agua se drene durante 20 minutos. Luego, manteniéndolo bastante apretado, coloque el paneer sobre una superficie de trabajo limpia. Coloque un peso pesado en la parte superior durante 30-40 minutos, o hasta que se aplana en un bloque firme. (Puede volver a llenar la misma olla con agua y colocarla encima como un peso). Luego córtelos en cubos o desmigajelos, dependiendo de cómo quiera usarlos.", "Guarde las piezas no utilizadas en el refrigerador en agua y cúbralas. También puedes congelar el paneer en un recipiente hermético. Descongele completamente antes de usar. Es delicioso cuando se sirve con una pizca de sal marina, pimienta recién molida y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_paneer_86451", "title": "Queso indio", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 250 g", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Rape de 200 g / 7 onzas", "2 cucharadas de romero fresco, picado", "sal y pimienta negra recién molida", "2 piezas de tocino", "2 cucharadas de aceite de oliva", "½ chili, picado", "2 dientes de ajo, mantenidos enteros", "½ cebolla, pelada y cortada en cuñas", "1 camote, pelado y cortado en cubitos", "30g / 1oz de mantequilla sin sal", "2 dientes de ajo, pelados y asados"], "method": ["Poner a hervir una olla de agua y cocinar la papa durante 10-12 minutos, hasta que esté tierna.", "Para el rape, caliente el aceite en una sartén.", "Espolvoree el romero y la sal y la pimienta negra recién molida sobre el rape y envuélvalos en la panceta.", "Cubre la panceta envuelta en la sartén durante 4-5 minutos o hasta que esté cocida.", "Para hacer el aceite de ajo, caliente el aceite de oliva en una sartén y agregue el chile, el ajo y las rodajas de cebolla. Caliéntelo durante 8-10 minutos.", "Escurra las papas y transfiera a la licuadora con la mantequilla, el aderezo y el ajo. Mezclar hasta que esté suave.", "Para servir, espolvorea el puré en un plato para servir y cubra con el rape envuelto. Sirva el aceite de ajo y chilli al lado."], "url": "www_bbc_co_uk_food_recipes_pancettawithmonkfish_76068", "title": "Pancetta con rape, aceite de ajo y puré de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4½fl oz de yogur al estilo griego", "pequeña perilla de jengibre fresco, pelado y más o menos picado", "2-3 dientes de ajo, pelados y finamente picados", "sal al gusto", "½ cucharadita de chile en polvo, o al gusto", "1 cucharadita de sal masala", "2 cucharadas de jugo de limón, o al gusto", "2 cucharadas de aceite vegetal", "1 cucharada de harina de garbanzo", "1 cucharadita de comino en polvo", "semillas de 6 cardamomo verde, molido", "300g / 10½oz paneer, cortado en cubos de 2.5cm / 1in", "1 cebolla grande, cortada en cubos de 2.5cm / 1in", "1 pimiento verde y 1 pimiento rojo, sin corazón y cortado en cubos de 2.5cm / 1in", "aceite, para engrasar", "6 pinchos de madera, empapados durante una hora", "2 cucharadas de mantequilla, derretida, para lloviznar", "chaat masala (una mezcla de especias secas disponible de tiendas de comestibles asiáticas), para rociar"], "method": ["Para el adobo, mezcle todos los ingredientes del adobo en un tazón y agregue el paneer, la cebolla y los pimientos. Cubra con una película adhesiva y deje que el paneer y las verduras se marinen durante 30-40 minutos o más en la nevera.", "Precaliente el horno a 200C / 400F / Gas 6 y engrase una bandeja para hornear.", "Pase las verduras y el paneer alternativamente por los pinchos. Hornee en el horno durante siete minutos, rocíe sobre la mantequilla derretida, dé vuelta y cocine por otros 5-7 minutos o hasta que esté carbonizado en los bordes.", "Espolvorear con chaat masala y servir. También son geniales servido con salsa picante verde."], "url": "www_bbc_co_uk_food_recipes_paneerandvegetablesk_86440", "title": "Pinchos Paneer y vegetales", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 6 pinchos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paneerandvegetablesk_86440_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "220g / 8oz paneer, en cubos", "2 cebollas, finamente cortadas", "sal y pimienta negra", "2 dientes de ajo, aplastados", "½-1 cucharadita de hojuelas de chile", "1 cucharada de polvo de curry suave", "Patatas fritas de 250g / 9oz, peladas y cortadas en cubos pequeños", "200g / 7oz de tomates enlatados", "500ml / 18fl oz de caldo de verduras (hecho de cubo en existencia)", "200g / 7oz de arroz"], "method": ["Caliente una sartén o una sartén grande (tapada) a fuego medio. Agregue el aceite y una vez caliente fría el paneer durante dos minutos por cada lado, o hasta que los cubos estén coloreados. Retire de la sartén y reserve.", "Ahora agregue las cebollas con una pizca de sal y fría hasta que estén doradas. Una vez dorado, agregue el ajo, los copos de chile, el polvo de curry y dos cucharadas de agua. Freír suavemente durante otros dos minutos a fuego lento. Agregue la papa.", "Vierta los tomates y el caldo, cocine a fuego lento, cubra con una tapa y cocine a fuego lento durante 15 minutos, o hasta que las papas estén completamente blandas y la salsa se haya espesado.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete.", "Agregue el paneer al curry y revuelva, asegurándose de que esté bien cubierto en salsa. Caliente durante 3-4 minutos y luego sirva con el arroz."], "url": "www_bbc_co_uk_food_recipes_paneer_and_potato_curry_63584", "title": "Paneer y patata al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojas de espinaca bebé 225g / 8oz, lavadas", "45g / 1¾oz de cilantro fresco, hojas y tallos", "6 dientes grandes de ajo, pelados", "Jengibre fresco de 5cm / 2in en pieza, pelado y aproximadamente picado", "6 cucharadas de cacahuetes tostados y salados", "2-3 cucharadas de jugo de limón, o al gusto", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida", "1-3 chiles verdes, sin semillas, picados (opcional)", "75ml / 2½fl oz de yogur al estilo griego", "1 cucharadita de garam masala, comino molido, semillas de hinojo molido y polvo de cardamomo verde", "2 cucharaditas de ajo machacado", "1 jengibre rallado de cucharadita redondeada", "2 cucharaditas de harina de gramo", "sal al gusto", "2 cucharaditas de jugo de limón", "¼-½ cucharadita de chile rojo en polvo, o al gusto", "2 cucharaditas de aceite vegetal", "2 cucharadas de agua", "200g / 7oz de champiñones portobello, limpios, hervidos durante 15 minutos, enfriados y rebanados de forma espesa", "2 cucharadas de aceite vegetal", "100 ml / 3½ fl oz de agua", "300-350g / 10-12oz paneer, cortado en cubos de 2.5cm / 1in", "½ cebolla pequeña, en rodajas finas", "5 tortillas de harina listas para usar, envueltas en papel de aluminio y colocadas en el horno durante los últimos cinco minutos de cocción", "Necesitará 5-6 pinchos de madera, empapados en agua durante media hora"], "method": ["Para la pasta de espinaca, coloque todos los ingredientes de la pasta de espinaca en una licuadora y mezcle hasta que quede suave.", "Para los hongos tandoori, coloque todos los ingredientes, excepto los champiñones, en una licuadora y mezcle hasta lograr una pasta homogénea. Agregue los champiñones a la pasta y déjelos marinar durante 20 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el paneer, caliente el aceite en una sartén grande antiadherente. Agregue la pasta de espinaca y el agua y cocine a fuego medio durante 8-10 minutos, o hasta que la pasta comience a espesarse. Agregue el paneer y la cebolla y cocine por otro minuto, o hasta que la cebolla empiece a ablandarse.", "Mientras tanto, ensarta los champiñones marinados en brochetas, colócalos en una bandeja para hornear engrasada y transfiéralos al horno. Hornee por 20 minutos, volteando a la mitad del tiempo de cocción. Una vez cocido, agregue los champiñones a la mezcla de paneer.", "Para servir, divida el relleno en cinco porciones y coloque cada porción sobre una tortilla calentada. Enrolle y corte la diagonal."], "url": "www_bbc_co_uk_food_recipes_paneermushroomandspi_86563", "title": "Paneer, champiñones y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 5", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pimientos rojos o verdes grandes, tallos eliminados, carne cortada por la mitad, semillas recogidas", "4 cucharadas de aceite vegetal", "1¼ cucharadita de semillas de comino", "1 cebolla picada", "3 tomates grandes, picados", "2 cucharaditas de jengibre finamente picado", "2 puñados de guisantes congelados", "70 g / 2½ oz de judías verdes picadas", "sal al gusto", "½ cucharadita de cúrcuma molida", "½ cucharadita de chile rojo en polvo", "2 cucharaditas de cilantro molido", "1½ cucharadita de sal masala", "250g / 9 oz de paneer fresco, desmenuzado", "100 ml / 3½ fl oz de agua", "5 cucharadas de crema doble", "puñado de cilantro picado fresco", "200g / 7oz de arroz basmati, cocido de acuerdo con las instrucciones del paquete, para servir"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque las mitades de pimiento en una bandeja para hornear, rocíe con una cucharada de aceite y hornee en el horno durante 20-25 minutos, o hasta que se ablanden. Una vez que los pimientos estén cocidos, quítelos del horno y déjelos a un lado.", "Mientras tanto, caliente el aceite restante en una sartén antiadherente. Agregue las semillas de comino y fría por 20-30 segundos, o hasta que estén fragantes.", "Agregue la cebolla picada y cocine por 3-4 minutos, o hasta que se dore.", "Agregue los tomates, jengibre, guisantes, frijoles, sal y especias y cocine a fuego lento durante 10-12 minutos, o hasta que los tomates se hayan ablandado y reducido a pulpa.", "Agregue el paneer desmenuzado y el agua y mezcle hasta que esté bien combinado. Deje que la mezcla hierva a fuego lento y cocine a fuego lento de 2 a 3 minutos.", "Agregue la crema doble y sazone bien con pimienta negra recién molida. Cocine a fuego lento hasta que se caliente por completo.", "Agregue el cilantro picado y continúe cocinando a fuego lento durante 4-5 minutos, agregando cucharadas de agua según sea necesario para evitar que la salsa se seque, ya que el paneer absorbe el líquido.", "Precalentar la parrilla a su configuración más alta. Mientras la parrilla se está calentando, llene cada una de las mitades de pimiento al horno con la mezcla de paneer. Cuando la parrilla esté caliente, asa los pimientos rellenos hasta que la mezcla de paneer se dore.", "Para servir, coloque una o dos mitades de pimientos rellenos en cada plato de servir. Coloque una porción de arroz basmati al lado de cada una."], "url": "www_bbc_co_uk_food_recipes_paneerstuffedpeppers_90032", "title": "Pimientos rellenos de Paneer", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paneerstuffedpeppers_90032_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Espinaca bebé 750g / 1½lb, lavado", "3 cucharadas de aceite vegetal", "1 cucharadita de semillas de comino", "1 cebolla grande, picada", "pedazo de jengibre fresco del tamaño de un pulgar, pelado y rebanado en juliana larga", "1½ cucharada de ajo picado", "1-2 chiles verdes, enteros", "2 cucharaditas de cilantro molido", "sal al gusto", "250 g / 8¾oz de paneer ready-made (disponible en algunos supermercados y tiendas de comestibles asiáticas), cortado en cubos", "½-1 cucharadita de sal masala", "6 cucharadas de leche entera o 4 cucharadas de crema doble", "1-2 cucharaditas de jugo de limón, o al gusto"], "method": ["Escalde las espinacas en agua caliente durante tres minutos o hasta que se marchiten. Drene en un colador y deje correr agua fría hasta que se enfríe. En un procesador de alimentos o licuadora, mezcle hasta obtener una pasta homogénea y déjela a un lado.", "Caliente el aceite en una sartén grande antiadherente. Agregue el comino y fría por unos 30 segundos, hasta que esté fragante, luego agregue la cebolla y fría a fuego lento durante unos seis minutos, hasta que esté suave. Agregue el jengibre, el ajo y los chiles y cocine por un minuto más.", "Agregue el cilantro molido y la sal al gusto. Cocine por otros 30 segundos y luego agregue las espinacas y un chorrito de agua si es necesario. La mezcla debe ser suelta pero no acuosa. Llevar a ebullición y luego cocine a fuego lento durante tres minutos.", "Agregue los panecillos paneer, garam masala y leche o crema. Revuelva y cocine durante unos minutos o hasta que la espinaca esté suave y cremosa. Agregue el jugo de limón al gusto. Sirva con arroz pilaff o pan naan."], "url": "www_bbc_co_uk_food_recipes_paneerwithspinach_86756", "title": "Paneer con espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paneerwithspinach_86756_16x9.jpg", "isVegetarian": false, "recommendations": 0}]