[{"isVegetarian": false, "title": "Lamb with green chillies", "url": "www_bbc_co_uk_food_recipes_lambwithsquatgreench_86625", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp ground turmeric", "1 tsp ground fennel seeds", "1 tsp garam masala", "1 tbsp white poppy seeds", "salt, to taste", "3 large garlic cloves", "1 tbsp peeled and roughly chopped fresh ginger", "1 medium onion, chopped", "2 medium tomatoes, chopped", "800g/1lb 12oz lamb shoulder, cut into small cubes", "3 tbsp vegetable oil", "¾ tsp nigella seeds (available from Asian grocers)", "1 tsp cumin seeds", "500ml/17fl oz water", "5-8 fat, short green chillies, slit through the middle, seeds removed, but otherwise left intact", "2-3 tsp fresh tamarind paste", "2 handfuls fresh coriander, leaves and stalks, chopped"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, place all the ingredients, excluding the lamb, for the marinade into a food processor and blend until smooth.", "Transfer the marinade to a bowl, add the lamb and leave to marinate for several hours, or overnight, if possible.", "For the curry, heat two tablespoons of the oil in a large pan, add the nigella and cumin seeds and stir fry for about 30 seconds, or until the cumin begins to brown.", "Add the marinated lamb and cook over a medium heat, stirring frequently, for about 12-14 minutes. Taste to ensure the spices have been cooked - it should have no harsh elements.", "Add the water and bring to the boil. Then lower the heat, cover and simmer for 35-40 minutes, or until the lamb is tender. Check on the pot regularly, stirring occasionally and adding more water if it gets too dry.", "Halfway through cooking the lamb, heat the remaining oil in a small pan and gently fry the chillies for two minutes, stirring often. Pour into the curry.", "Once the lamb is cooked, uncover and stir in the tamarind paste. Taste and adjust the seasoning, add a little extra water if necessary, and stir in the coriander. Serve with naan or rice."]}, {"isVegetarian": false, "title": "Lamb with sweet and sour plums and runner beans", "url": "www_bbc_co_uk_food_recipes_lambwithsweetandsour_80042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/5½oz lamb chop", "1 tbsp olive oil", "salt and freshly ground black pepper", "50ml/2fl oz red wine", "1 tbsp brown sugar", "1 tsp cinnamon", "2 plums, stoned and sliced", "50g/1¾oz long green beans, blanched", "1 tsp chopped chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To cook the lamb, rub the lamb chop with oil and season well. Place a small oven proof frying pan over a high heat, and fry the chop for two minutes on each side. ", "Roast in the oven for five minutes. Remove and allow to rest for one minute.", "To make the sauce, pour the red wine into the hot frying pan. Add the sugar, cinnamon and plums. Stir together and cook for eight minutes until sticky.", "To serve, place the beans in the centre of a warm plate, place the lamb on top, pour the sticky sauce over and sprinkle the chervil over."]}, {"isVegetarian": true, "title": "Lancashire cheese and prune filo parcels", "url": "www_bbc_co_uk_food_recipes_lancashirecheeseandp_87217", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 sheets ready-made filo pastry", "55g/2oz butter, melted", "100g/3½oz Lancashire cheese, grated", "12 prunes, stones removed"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut each sheet of filo pastry into three long strips and brush with melted butter.", "Place a small spoonful of cheese at one end of each strip and top with a prune.", "Fold one corner of the pastry over the filling to the opposite side to make a triangle. Continue folding up until all the pastry is used up and brush all over with butter. Repeat to make 12 parcels.", "Place onto a baking sheet and bake in the oven for 10-12 minutes, or until golden-brown and crisp.", "To serve, place onto a serving plate."]}, {"isVegetarian": false, "title": "Lamb with tabbouleh", "url": "www_bbc_co_uk_food_recipes_lambwithtabbouleh_88992", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz lamb rump steaks", "1 tbsp olive oil", "salt and freshly ground black pepper", "225g/8oz bulgar wheat, cooked according to packet instructions", "1 cucumber, finely chopped", "450g/1lb cherry tomatoes, quartered", "6 spring onions, finely chopped", "2 tbsp chopped parsley", "3 lemons, juice only", "100ml/3½fl oz olive oil", "1 chilli, finely chopped", "1 garlic clove, finely chopped", "Greek-style yoghurt, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the lamb with oil and season well with salt and freshly ground black pepper. ", "Heat a griddle pan until very hot, then add the lamb and griddle for 4-5 minutes on both sides, or until cooked to your liking.", "For the tabbouleh, place all of the tabbouleh ingredients, except the yoghurt, into a large bowl and stir to combine.", "To serve, place a generous portion of tabbouleh onto each plate and place a piece of griddled lamb on top.", "Add a dollop of Greek-style yoghurt to each plate and serve."]}, {"isVegetarian": true, "title": "Lancashire cheese sausages", "url": "www_bbc_co_uk_food_recipes_lancashirecheesesaus_85483", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz Lancashire cheese, grated", "200g/7oz fresh breadcrumbs", "6 spring onions, chopped", "30g/1oz fresh thyme leaves, chopped", "30g/1oz fresh parsley, chopped", "3 free-range eggs", "3 free-range egg yolks", "50ml/2fl oz milk, to bind", "2 garlic cloves, crushed", "salt and freshly ground black pepper", "400g/14oz Maris Piper (or similar) potatoes, peeled, cubed and boiled for ten minutes", "200g/7oz butter", "tomato chutney or tomato ketchup"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the sausages, place the cheese, breadcrumbs, onions, thyme, parsley, eggs, egg yolks, milk and garlic into a large bowl. Season well with salt and freshly ground black pepper, then mix your hands to combine the ingredients well.", "Place the sausage mixture into the fridge to chill for 2-3 hours, then remove and mould it into sausage shapes. (You should get about 12 normal-sized sausages from this quantity of mixture, depending how big you like your sausage.)", "Heat the oil in a deep frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully add the sausages to the oil and fry them, turning if necessary, for 4-5 minutes, or until golden-brown, then remove with a slotted spoon and drain onto kitchen paper. (NB: you can also shallow fry or grill the sausages.)", "For the potatoes, melt the butter in a separate frying pan. Add the potatoes and sauté for 4-5 minutes, or until crisp and golden. ", "To serve, place a few sausages onto each plate with a large spoonful of sautéed potatoes alongside. Add a dollop of tomato chutney or ketchup."]}, {"isVegetarian": false, "title": "Lancashire hotpot", "url": "www_bbc_co_uk_food_recipes_lancashirehotpot_88969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large red onions, chopped", "3 medium carrots, chopped", "1 turnip, chopped", "900g/2lb best end of neck of lamb chops, or cubed leg of lamb", "1 bay leaf ", "salt and freshly ground black pepper", "8 x 2.5cm/1in thick slices black pudding", "900g/2lb potatoes, sliced into 5mm/¼in thick slices", "570ml/1 pint hot lamb stock", "55g/2oz butter, melted"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Place the red onions, carrots and turnips into a heavy-based lidded casserole dish. Add the lamb and bay leaf and season with salt and freshly ground black pepper. ", "Cover the lamb and vegetables with the black pudding slices followed by a layer of potato slices, overlapping the slices to completely cover the lamb, vegetables and black pudding. ", "Add the hot stock to the casserole and brush the potatoes with melted butter.", "Cover the casserole and place in the oven to cook for about two hours. After two hours remove the lid and cook for another 30-45 minutes, until the potatoes are crisp and golden-brown.", "Take the casserole dish to the table and serve."]}, {"isVegetarian": false, "title": "Lancashire hot pot", "url": "www_bbc_co_uk_food_recipes_lancashirehotpot_92236", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lancashirehotpot_92236_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1kg/2lb 2oz neck of lamb, chopped into bite-sized pieces", "4 lambs' kidneys, cleaned, trimmed, cut into quarters", "2 onions, peeled, sliced", "½ tsp salt", "1 tbsp plain flour", "250ml/9fl oz lamb stock", "1 sprig fresh thyme ", "2 fresh bay leaves", "1 tbsp Worcestershire sauce", "50g/2oz butter, cut into cubes, plus extra for greasing", "2 x 250g/7oz black pudding rings, outer casing removed, thickly sliced", "1kg/2lb 2oz potatoes, peeled and sliced", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the olive oil in a pan and fry the lamb pieces and kidneys for 1-2 minutes on both sides, or until golden-brown all over. Remove from the pan and set aside. ", "In the same pan, cook the onions and salt for 2-3 minutes, or until the onions have softened. Stir in the flour until the onions are well coated with the flour. ", "Add the stock to the pan along with the thyme, bay leaves and Worcestershire sauce. Stir and simmer for 8-10 minutes, or until thickened slightly. ", "Butter a lidded flame-proof casserole dish and place a layer of potatoes (about a third) over the bottom of the dish and season with salt and freshly ground black pepper. Spoon in half of the browned lamb and lambs' kidneys, then lay over half of the black pudding slices and pour over half of the thickened stock mixture. Repeat the layering process until all of the potatoes, lamb pieces and kidneys, black pudding and stock have been used, finishing with a layer of potatoes on top. Dot the potatoes with the butter, then cover with a lid.", "Place the casserole into the oven to cook for 20 minutes, then remove the lid and cook for a further 20 minutes, or until the potatoes are golden-brown on top. ", "To serve, spoon into serving bowls."]}, {"isVegetarian": false, "title": "Lancashire hotpot with braised red cabbage", "url": "www_bbc_co_uk_food_recipes_lancashirehotpotwith_81803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large carrot, cut into 3 pieces", "1 onion, cut into quarters", "2 cloves garlic", "sprig rosemary", "sprig thyme", "1 bay leaf", "pinch rock salt ", "1 tbsp tomato purée", "2 litres/3½ pints water", "1 middle neck of lamb with bones, about 1kg/2¼lb", "plain flour, for dusting", "2 tbsp olive oil", "1 Spanish onion, thinly sliced", "2 carrots, thinly sliced", "1 clove garlic, thinly sliced", "salt and freshly ground black pepper", "1 tbsp thyme leaves", "1 tbsp chopped rosemary", "3 Maris Piper potatoes, very thinly sliced", "unsalted butter", "1 small red cabbage, cored and sliced", "1 red onion, finely chopped", "150g/5½oz unsalted butter", "200ml/7fl oz red wine vinegar", "50g/2oz clear honey", "100g/3½oz demerara sugar", "1 bay leaf", "sprig thyme", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "First make the stock. Remove the meat from the middle neck of lamb and set aside. Chop the bones and put them in a roasting tray. Roast until lightly browned.", "Meanwhile, cook the carrot, onion and garlic in a little olive oil in a large heavy-bottomed stockpot until lightly browned. Add the herbs and salt, then stir in the tomato purée and cook for a couple of minutes. Add the roasted bones and cover with the water. Bring to the boil, then turn down to a simmer and cook for one hour, skimming off any fat or scum regularly. Pass the liquid through a fine sieve into a clean pan. Return to the heat and reduce until you have 1 litre/1¾ pints of stock.", "Turn the oven down to 150C/300F/Gas 2.", "To make the hot pot, cut the lamb into 2cm/1in thick slices. Dust them with flour. Heat the oil in a pan and quickly fry until lightly coloured on both sides. Remove and set aside. ", "In the same oil, quickly fry the onion, carrots and garlic until lightly browned.", "Layer the lamb, onion and carrots in a heavy casserole dish, filling it to 1cm/½in from the top. Season each layer with salt and freshly ground black pepper, and the herbs, spooning liberal amounts of stock between each layer.", "Arrange the potatoes neatly all over the top of the dish. Dot a few small knobs of butter on the potatoes, cover with a tight-fitting lid and cook in the oven for 1½ hours. Remove the lid and cook for a further 45 minutes.", "Meanwhile, make the red cabbage. Mix together all of the ingredients. Put into a roasting tray and cover with foil. Place in the oven and cook for about 1½ hours, stirring regularly, until most of the liquid has evaporated.", "Serve the hot pot from the casserole onto warm plates with the cabbage."]}, {"isVegetarian": true, "title": "Langosi (sweet pancakes with hazelnut cream)", "url": "www_bbc_co_uk_food_recipes_langosipancakes_80201", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour ", "pinch salt", "2 tbsp caster sugar", "½ tsp baking powder", "2 free-range eggs", "375ml/13fl oz milk", "2 tbsp melted butter, plus extra for frying", "3 tbsp butter", "4 tbsp cocoa powder ", "3 tbsp caster sugar", "285ml/½pint milk", "½ tsp vanilla extract", "4 free-range egg yolks, lightly beaten", "225g/8oz chopped hazelnuts", "250ml/9fl oz whipping cream", "raspberries", "caster sugar, to taste", "2 tsp cherry brandy (optional)", "icing sugar, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pancake batter, mix the flour, salt, sugar and baking powder together in a large bowl. ", "Make a well in the centre and add the eggs and milk and mix together. Add the melted butter and mix well.", "For the hazelnut cream filling, place the butter, cocoa powder and sugar in a bowl placed over a pan of simmering water and mix together (do not let the bottom of the bowl touch the water).", "Add the vanilla and milk and stir well. Continue stirring over the hot water for about 15 minutes, or until the mixture has thickened.", "Stir in the beaten egg yolks and continue to cook for about 10 minutes, until mixture is creamy.", "Add the chopped nuts and mix together. Leave to cool.", "Whip the cream to soft peaks and fold into the cooled hazelnut mixture. ", "For the raspberry coulis, blend the raspberries with enough sugar to sweeten and the cherry brandy (optional). Sieve to remove the pips, if you like.", "To cook the pancakes, heat a small non-stick frying pan over a medium heat. Add a little melted butter then add a ladleful of the batter mixture. Cook for 1-2 minutes until golden, then flip over and cook the other side for about one minute. Place on a warm plate and repeat with the remaining batter.", "To serve, place a generous spoonful of the hazelnut cream filling on each pancake and roll up. Pour over the raspberry coulis and dust with icing sugar."]}, {"isVegetarian": false, "title": "Langoustine and salmon tart", "url": "www_bbc_co_uk_food_recipes_langoustine_and_salmon_72078", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz all-butter puff pastry", "600g/1lb 6oz salmon, skin and pin bones, about 2.5cm/1in thick", "1 free-range egg white", "50ml/2fl oz double cream", "20 langoustines, peeled, de-veined, shells reserved for the sauce", "125g/4½oz baby spinach leaves", "2 free-range egg yolks, beaten", "50g/2oz butter", "1 onion, roughly chopped", "1 carrot, roughly chopped", "½ head fennel, roughly chopped", "2 sprigs fresh thyme", "¼ tsp cayenne", "2 tsp tomato purée", "75ml/3fl oz white wine", "500ml/18fl oz fish stock ", "75ml/3fl oz double cream", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tart, preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out on a floured work surface to a 3mm/⅛in thickness. Cut out a 30cm x 10cm/12in x 4in rectangle and a 37.5cm x 15cm/15in x 6in rectangle.", "Trim the salmon into a 27.5cm x 7.5cm/11in x 3in rectangle", "Roughly chop the salmon trimmings (about 175g/6oz). Blend the salmon trimmings and egg whites to a purée in a food processor. Add the cream, salt and freshly ground black pepper and blend together until smooth.", "Place the smaller piece of pastry onto a baking tray and spread over the salmon purée. Cover with the langoustines and season with salt and freshly ground black pepper.", "Arrange the spinach leaves on top, then the piece of salmon. Cover with the larger piece of the pastry and crimp the edges. Trim the edges and brush with the beaten egg yolks. Score the pastry with a table knife.", "Bake in the oven for 30-35 minutes, or until the pastry is cooked through and golden-brown. Set aside to rest for five minutes.", "Meanwhile, for the sauce, heat a frying pan until hot and add the butter, onion, carrots, fennel and thyme and cook for 2-3 minutes, or until just softened but not coloured.", "Add the langoustine shells, cayenne and tomato purée and cook for a further minute. Add the white wine and continue to cook until the volume of the liquid is reduced by half.", "Add the fish stock, bring to the boil, then reduce the heat and simmer for 15 minutes.", "Blend the sauce in a blender until smooth, then pass through a sieve into a saucepan. Return the sauce to a simmer, add the cream and cook for a further minute. Season, to taste, with salt, lemon juice and freshly ground black pepper.", "To serve, carve the tart into slices and spoon over the sauce."]}, {"isVegetarian": false, "title": "Langoustine ravioli, heirloom carrots and ginger bisque", "url": "www_bbc_co_uk_food_recipes_langoustine_ravioli_57736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 langoustines ", "24 wonton wrappers", "1 free-range egg yolk ", "2 large yellow carrots ", "2 large orange carrots ", "2 large purple carrots ", "2 large red carrots", "100g/3½oz unsalted butter", "2 banana shallots, finely chopped", "1 garlic clove, finely chopped", "2 sprigs fresh thyme", "30g/1oz tomato purée ", "50g/1¾ oz fresh ginger, roughly chopped", "1 vanilla pod, split in two", "1 lime, zest only"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the langoustine ravioli, peel the langoustines, separating the heads. Take the vein out of the langoustine tails and set to one side. Crush the heads of the langoustines with the side of a heavy knife and set the heads aside separately.", "For the bisque, peel the carrots and slice them with a mandoline - use a small cutter to create tiny pellets. Keep all the trimmings from the yellow, orange, and red carrots. ", "For the langoustine ravioli, form the base of the ravioli using half of the wonton sheets. Place each of the langoustines tails, one by one, on the flat ravioli, then brush a small amount of egg yolk on the edge and place another sheet of wonton on top. Close it smoothly with your fingertips and cut the extra dough off. Set aside.", "To cook the bisque, heat the butter and reserved crushed langoustine heads in a pan until slightly golden in colour. ", "Add the shallots and carrot trimmings (still reserving the carrot pellets), garlic clove and thyme to the pan. Stir in the tomato purée and pour water in to the level of the ingredients. ", "Simmer for 20 minutes and then strain the broth through a fine sieve into a clean pan. Return to the heat and cook until reduced to a sauce consistency. Add the roughly chopped ginger and the vanilla pod. Set aside.", "In a large pan of boiling water, cook the carrot pellets for five minutes and then drain them and reserve. ", "Cook the ravioli in a large pan of boiling water for a few minutes, and carefully remove them with a slotted spoon or fish slice once cooked.  ", "To serve, place three ravioli in a bowl and then add the cooked carrot pellets. Strain the bisque and pour over the top. Finish with a sprinkle of lime zest."]}, {"isVegetarian": false, "title": "Langoustine scampi with lemon mayo", "url": "www_bbc_co_uk_food_recipes_langoustine_scampi_with_94412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "28 langoustines, shelled and de-viened", "110g/4oz self-raising flour", "110g/4oz cornflour", "275ml/9floz tonic water", "2 tbsp vodka", "2 free-range eggs, yolks only", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10fl oz rapeseed oil ", "1 lemon, juice only", "sea salt, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the scampi, heat a deep fat fryer to 190C/375F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Meanwhile, mix the flour and cornflour in a bowl until well combined. ", "Pour the tonic water into the flours and whisk in the vodka until the batter is about the consistency of double cream.", "Coat the langoustines in the batter and fry in the oil for 3-4 minutes, or until golden-brown and crisp. ", "Remove the scampi with a slotted spoon and drain on kitchen paper. ", "For the mayonnaise, place the eggs, white wine vinegar and mustard into a food processor and blend until pale and creamy. ", "With the motor running, pour in the oil, in a slow steady stream, until the mayonnaise is thick (you may not need all the oil). Mix in the lemon juice.", "To serve, pile the scampi in a serving bowl and serve the lemon mayonnaise alongside. Finish with a sprinkle of sea salt and a squeeze of lemon juice."]}, {"isVegetarian": false, "title": "Lobster tortellini with fennel sauce", "url": "www_bbc_co_uk_food_recipes_langoustine_tortellini_98795", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole lobsters, cooked", "150g/5½oz ‘00’ pasta flour, plus extra for dusting", "50g/1¾oz semolina, plus extra for dusting", "2 free-range eggs", "50g/1¾oz butter", "1 banana shallot, finely sliced", "½ bulb fennel, shaved ", "lobster shells (from above)", "1 star anise", "150ml/5fl oz white wine", "150ml/5fl oz fish stock", "150ml/5fl oz double cream", "1 plum tomato, skinned, seeds removed, chopped", "1 tbsp finely chopped tarragon", "1 tbsp finely chopped chives", "50g/1¾oz unsalted butter", "1 tsp olive oil", "1 yellow courgette, shaped into balls using a melon baller", "1 green courgette, shaped into balls using a melon baller", "1 tbsp chopped cress", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Remove the meat from the lobster, keeping the claw meat in one piece, and cut up the tail. Keep the shells for the sauce.", "For the pasta, mix the flour and semolina together on a clean work surface or in a large bowl. Make a well in the centre and break in the eggs. Using a fork or your hands, gradually mix the flour with the eggs to form a soft dough. Knead the dough for 5 minutes, or until smooth.", "Shape the dough into a ball, wrap in cling film and leave to rest in the fridge for at least 30 minutes.", "For the sauce, heat a frying pan to medium hot. Add the butter, shallot, fennel, lobster shells and star anise and fry for a couple of minutes, or until softened but not browned.", "Add the wine and cook until the volume of liquid has reduced by half. Add the fish stock and cook until reduced by half again. Add the cream and cook until reduced by one-third. ", "Strain the sauce through a sieve, the stir in the tomato and herbs. Taste and season with salt and freshly ground black pepper.", "Once the pasta has rested, divide it into 4 equal pieces. You can roll them out by hand using a rolling pin, or use a pasta machine. ", "To roll by hand, dust with semolina and use a rolling pin to roll out each piece, working slowly and dusting the pasta with semolina as you go to avoid tearing it.", "Alternatively, dust a pasta machine with semolina and starting at the lowest (thickest) setting, feed one piece of the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. ", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Repeat with the other pieces of dough.", "Once the pasta sheets have reached the ideal thickness, set aside and dust with semolina.", "To make the tortellini, use a circular cutter to make circles of pasta 9cm/4in in diameter. Place a piece of the tail meat on each circle. Brush a little water on the edge of the pasta and fold over the top to make a semi-circle. Press down lightly to seal. Wrap the corners of the semi-circle around your index finger and join together to make a tortellini shape. You need 6 tortellini per person.", "For the garnish, heat a large frying pan and once hot add the butter and oil. Add the courgette balls and cook for a couple of minutes, or until the courgettes have a little colour on them.", "To cook the pasta, bring a large saucepan of salted water to the boil. Add the pasta and simmer for 3-5 minutes until cooked, then drain immediately.", "To serve, place 6 of the tortellini in the centre of each serving bowl and spoon over the sauce. Garnish with the lobster claw meat, the courgette balls and cress."]}, {"isVegetarian": false, "title": "Langoustine linguine", "url": "www_bbc_co_uk_food_recipes_langoustinelinguini_84268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 whole langoustines ", "1 tbsp olive oil", "½ lemon, juice only", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 banana shallot, finely chopped ", "3 garlic cloves, chopped", "4 langoustine, heads and shells only", "1 tbsp tomato purée", "10 peppercorns", "5 fresh parsley stalks", "½ lemon, zest only", "50ml/2fl oz white wine", "50ml/2fl oz double cream", "250g/9oz linguine, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the baked langoustines, place the langoustines onto a large piece of aluminium foil on a baking sheet. Drizzle with oil, squeeze over the lemon juice and wrap up the foil to completely seal. Transfer to the oven and bake for 10-15 minutes, or until completely cooked through.", "For the linguini, heat the oil in a frying pan, add the shallot and garlic and fry until soft. Add the langoustine shells and heads and tomato purée and cook for 1-2 minutes.", "Add the peppercorns, parsley stalks, lemon zest and white wine, bring to the boil and reduce the wine by half its volume.", "Add 150ml/4½fl oz boiling water and cook to reduce the liquid again by half, then pass through a sieve into a large frying pan.", "Add the double cream, bring to the boil, then reduce until the sauce has thickened and season, to taste, with salt and freshly ground black pepper.", "Add the linguine and toss until well mixed into the sauce.", "To serve, place the linguine in a large bowl with the baked langoustines arranged on top."]}, {"isVegetarian": false, "title": "Langoustines en papillote with raw honey, ginger and lemon", "url": "www_bbc_co_uk_food_recipes_langoustines_en_61611", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 Jersey Royal potatoes     ", "3 tbsp cold-pressed rapeseed oil ", "12 asparagus spears, woody ends removed ", "100g/3½oz unpasteurised honey", "1 lemon, juice only", "200g/7oz fresh root ginger, finely grated, juice squeezed out and reserved", "24 langoustines, peeled and de-veined ", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½.", "Boil the Jersey Royals for 10–15 minutes, or until tender, then cool in cold water and set aside.  ", "To make six parcels, lay kitchen foil on top of greaseproof paper and cut out six 30x40cm/12x16in rectangles. Fold each rectangle in half and cut into half of a heart shape, then unfold into a heart.   ", "Lay the hearts foil side-up and brush each one with some rapeseed oil, then place three Jersey Royals in the middle of each piece of foil and crush lightly with a fork. Place two asparagus spears on top of each, season with salt and pepper and drizzle with a little more rapeseed oil. ", "Place the honey in a small saucepan over a low heat to warm through. Add the lemon and ginger juices and season with salt and pepper. Place six langoustines on top of each parcel and drizzle with the honey, lemon and ginger juice mixture. ", "Seal the pouches and bake for 7 minutes. Place each parcel in the centre of a plate, open and serve. "]}, {"isVegetarian": false, "title": "Langoustine soup", "url": "www_bbc_co_uk_food_recipes_langoustine_soup_59528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz butter", "1 shallot, finely chopped", "2 garlic cloves, finely chopped", "1 tbsp tomato purée", "1 carrot, chopped", "500g/1lb 2oz langoustine shells", "2 tbsp brandy", "250ml/9fl oz fish or chicken stock", "100ml/3½fl oz double cream", "salt and black pepper", "croûtons, to serve", "1 spring onion, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a frying pan and gently fry the shallot and garlic until the shallot is translucent. Add the tomato purée and cook for a further two minutes, then add the carrot, langoustine shells, brandy, stock and cream. Cook for 3-4 minutes.", "Place the mixture into a sturdy blender and pulse for two minutes until smooth. Pass through a fine sieve into a clean pan. Season, to taste, with salt and pepper.", "Serve in bowls topped with the croutons and spring onion."]}, {"isVegetarian": false, "title": "Langoustine ravioli, shimeji mushrooms and ginger broth", "url": "www_bbc_co_uk_food_recipes_langoustine_ravioli_53163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "75g/2½ oz butter", "1 carrot, thinly sliced ", "6 cooked langoustines, peeled, de-veined, heads and tails separated", "1 small bunch coriander, stalks and leaves separated ", "30g/1oz shimeji mushrooms, heads and stalks separated", "6cm/2½in fresh root ginger, cut into matchsticks", "30g/1oz broad beans, podded", "30g/1oz petit pois ", "1 free-range egg yolk, lightly beaten", "6 wonton wrappers, available from large supermarkets or specialist stores ", "4 spring onions, tops removed and sliced on the diagonal", "1 lemon, zest only", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and 50g/1¾oz butter in a saucepan and add the carrots to caramelise. Crush the langoustine heads and add to the pan with the coriander and mushroom stalks. Pour in 100ml/3½fl oz water and bring to a simmer.", "Add most of the ginger to the broth, reserving a little for garnishing, and simmer for 2 minutes. Strain into a clean pan, return to the heat and simmer until the volume of the liquid is reduced by half. Season well with salt and pepper. ", "Heat the remaining butter in a frying pan placed over a medium heat. Add the mushroom heads, broad beans and petit pois. Gently cook for 3 minutes and set aside. ", "Using a pastry brush, lightly brush the wonton wrappers with the egg. Place a langoustine tail on each wrapper and sprinkle with the coriander leaves. Fold in half and press the edges together firmly. ", "Place 100ml/3½fl oz water into a large, deep frying pan and bring to the boil. Slide in the ravioli, ensuring there is enough water to just cover them, and simmer for 2 minutes. Remove with a slotted spoon.", "To serve, divide the ravioli between two shallow bowls, pour over the broth and top with the vegetables. Sprinkle with the spring onions, lemon zest and remaining ginger. "]}, {"isVegetarian": false, "title": "Langoustines with orange-saffron butter and swede tahini mash", "url": "www_bbc_co_uk_food_recipes_langoustines_with_21304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz dry vermouth ", "pinch saffron strands", "½ orange, zest and juice", "½ lemon, zest only", "100g/4oz butter, softened", "4 garlic cloves, crushed", "50g/2oz fresh chives, finely chopped", "½ tsp crushed or ground sumac", "1 tsp cumin seeds, finely ground", "salt and freshly ground black pepper", "300g/11oz swede, peeled and chopped", "2 tbsp tahini paste", "3 garlic cloves, crushed", "3 tbsp cumin seeds, finely ground", "1 lemon, juice only", "4–6 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil ", "20 large langoustines, heads and shells removed, de-veined", "green salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the butter, pour the vermouth into a large bowl and add the saffron strands. Set aside for 2-3 minutes, then stir in the orange zest, orange juice and lemon zest. ", "Add the butter, garlic, chives, sumac and cumin and beat until combined. Season, to taste, with salt and freshly ground black pepper and beat again.", "Spread out a sheet of cling film onto a flat work surface. Spoon the flavoured butter mixture onto the cling film, then use the cling film to shape and roll the butter into a sausage shape. Roll the cling film around the butter and seal the ends tightly. Chill in the fridge for two hours, or until firm. ", "When the flavoured butter has been chilling for 1½ hours, prepare the mash. Bring the chopped swede to the boil in a pan of salted water, then reduce the heat and simmer for 15–20 minutes, or until the swede is tender. Drain well.", "Blend the drained swede in a food processor until smooth, then transfer the puréed swede to a large mixing bowl. Stir in the tahini, garlic, cumin, lemon juice and olive oil, then season, to taste, with salt and freshly ground black pepper.", "For the langoustines, heat the olive oil in a heavy-based frying pan over a medium to high heat. Add the langoustines, in batches if necessary, and fry for 1-2 minutes, stirring all the time, until pink and cooked through. Remove from the pan and set aside. ", "Add 75g/3oz of the chilled orange-saffron butter to the pan, then take the pan off the heat and set aside until the butter has melted. ", "To serve, pile the langoustines onto a serving platter. Drizzle over the melted orange-saffron butter. Slice the remaining chilled butter and place the slices on top of the langoustines. Spoon the swede mash into a large bowl and pile the salad leaves onto a large plate. Allow guests to help themselves."]}, {"isVegetarian": false, "title": "Langoustines with charred aubergine and red Thai curry", "url": "www_bbc_co_uk_food_recipes_langoustines_with_56864", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 cleaned tail-on langoustines (or large prawns)\t\t\t", "20g/¾oz ginger, cut into pieces, not peeled", "45g/1½oz lemon grass, cut into pieces ", "20g/¾oz galangal, cut into pieces", "20g/¾oz shallots, sliced", "20g/¾oz garlic, whole cloves", "2 red bird's eye chillies", "1 tbsp red curry paste", "20g/¾oz lime leaves", "20g/¾oz coriander leaves and stems", "1 tbsp rapeseed oil", "2 tsp black pepper, toasted and ground", "2 tsp cumin seeds, toasted and ground", "2 tsp coriander seeds, toasted and ground", "2 tsp sweet paprika, toasted and ground", "600ml/21fl oz coconut milk ", "140ml/5fl oz lime juice", "55ml/2fl oz fish sauce", "50g/1¾oz sugar (to taste)", "35g/1oz Thai basil leaves ", "20g/¾oz kaffir lime leaves", "4 large aubergines ", "2 tbsp rapeseed oil", "30g butter", "1 jalapeno chilli, seeds removed and very finely chopped ", "45g/1¾oz garlic, minced", "45g/1¾oz ginger, minced", "45g/1¾oz onion, minced very fine", "100g/3½oz tomatoes, peeled, deseeded and diced\t\t\t", "10g cumin, toasted and ground", "10g coriander seed, toasted and ground", "salt and freshly ground black pepper", "sugar, to taste", "45g/1¾oz fresh coriander, cut into thin strips (chiffonade)", "spring onions, sliced", "coriander Leaves ", "pea shoots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the red Thai curry sauce, put the ginger, lemongrass, galangal, shallots, garlic, chillies, red curry paste, lime leaves and coriander leaves and stems into a food processor. Pulse into a rough paste.", "Cook the paste in a saucepan over a medium heat with rapeseed oil for 2-3 minutes, taking care not to burn it. When fragrant, add the toasted and ground spices and cook until they release their aroma. Add the coconut milk, lime juice, fish sauce and half the sugar.", "Simmer for a few minutes, then taste. Add more sugar if necessary. Add Thai basil and kaffir lime leaves. Take off the heat and leave to stand for 20 minutes then strain the sauce and reserve. ", "For the aubergine, preheat the oven to 220C/200C Fan/Gas 7.", "With a fork, prick the aubergine several times. Rub with rapeseed oil and roast in the oven until completely tender (about 15-20 minutes).  Remove the pulp from the charred skin and roughly chop.", "In a medium pan over a low heat, add the butter and a little rapeseed oil. Once warm add the jalapeno, garlic, ginger and onion. Simmer gently until aromatic. Stir in the aubergine pulp. Add the cumin, coriander, salt, pepper and sugar. Adjust the seasonings to taste. Simmer for 5 minutes and add the tomatoes. Continue to cook on a very low heat, for 25 minutes, stirring occasionally. Remove from heat and set aside. When cool, add the coriander. ", "For the langoustine, heat a little oil in a frying pan and cook for 1-2 minutes until done.", "To serve, spoon the aubergine onto the plate and top with the langoustine. Spoon over the red curry sauce and garnish with peas shoots, spring onions and coriander leaves."]}, {"isVegetarian": false, "title": "Langoustines flamed in whisky sauce with dill and lemon potato cakes and salad with citrus dressing", "url": "www_bbc_co_uk_food_recipes_langoustinesflamedin_92112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 whole langoustines, shells on, split in half down the middle ", "2 garlic cloves, crushed", "75g/3oz unsalted butter, softened ", "salt flakes and freshly ground black pepper, to taste ", "1 tbsp olive oil ", "1kg /2lb 3oz langoustines, heads and shells removed, de-veined ", "2tbsp crème fraîche ", "2 tsp malt whisky ", "1 tbsp chopped fresh parsley", "500g/1lb 2oz waxy potatoes, such as Charlotte or Maris Peer, boiled in their skins for five minutes ", "1 free-range egg, beaten", "salt and freshly ground black pepper", "1 tbsp finely chopped dill ", "½ lemon, zest only, plus 1 tsp fresh lemon juice ", "3 tbsp olive oil ", "butter, for frying", "1 orange, juice only", "2 tbsp lemon juice", "2 tbsp white wine vinegar", "1 garlic clove, crushed ", "pinch English mustard powder", "1 tsp soft brown sugar, or more to taste", "salt and freshly ground black pepper", "3-4 punnets of micro salad leaves", "3-4 tbsp rapeseed oil, plus extra for serving"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Place the split whole langoustines, cut-side up, onto a grill pan.  ", "Mix together the crushed garlic and 50g/2oz of the softened butter. Spread the mixture evenly over the langoustine flesh and season, to taste, with salt flakes and freshly ground black pepper. Place under the preheated grill and cook until the langoustines are just cooked (the flesh will be opaque).  ", "Heat the remaining 25g/1oz unsalted butter and the olive oil in a large frying pan. Add the de-shelled langoustines and cook for 4-5 minutes.", "Add the whisky to the pan, then carefully light with a match. (NB: Keep hands and clothing well away from the flame.) Flame for a minute or so, then let the flames die away.  ", "Add the crème fraîche and parsley to the pan and stir well. Taste and season with salt or freshly ground black pepper, if needed. Keep warm until ready to serve.  ", "For the potato cakes, peel and grate the parboiled potatoes. Place the grated potatoes into a large bowl. ", "Add the egg, salt and freshly ground black pepper, to taste, dill, lemon zest and lemon juice and a tablespoon of the olive oil. Divide the mixture into four equal portions and form into cakes.", "Heat the remaining olive oil and a small knob of butter in a frying pan over a medium heat. Add the potato cakes to the pan and cook for 4-5 minutes, or until the bases are golden-brown. Carefully turn over and cook on the other side until golden-brown. Keep warm until ready to serve.", "For the salad dressing, shake together the orange juice, lemon juice, vinegar, garlic, mustard powder and sugar in a screw-top jar until well combined. Taste and season with salt and freshly ground black pepper as required. ", "Place the salad leaves into a large bowl and dress the leaves first with the rapeseed oil, then add the dressing and mix to coat the leaves (you may not need to add all of the dressing). ", "To serve, place a dill potato cake into the centre of each of four warmed serving plates. Place a spoonful of the sautéed langoustine on top and spoon over the whisky sauce. Place two grilled langoustine to the side, pile the salad alongside and drizzle additional rapeseed oil around the plate."]}, {"isVegetarian": false, "title": "Langoustines with Little Gem salad", "url": "www_bbc_co_uk_food_recipes_langoustineswithlitt_91763", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["24 langoustines", "250ml/9fl oz chicken stock", "200ml/7fl oz double cream", "110g/4oz butter", "1 lemon, juice only", "salt and freshly ground black pepper", "2 heads Little Gem lettuce, leaves separated", "110g/4oz assorted salad leaves", "4 tbsp chopped fresh mixed herbs (chives, chervil, flatleaf parsley)", "1 tbsp red wine vinegar", "3 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil, then add the langoustines and cook for one minute. Drain the langoustines and set aside to cool slightly before removing the tail meat. (Reserve the shells for another recipe, such as for making stock.)", "Place the chicken stock into a pan and bring to the boil. Cook for 6-8 minutes over a high heat, or until the stock has reduced in volume by half. Stir in the cream and cook for a further 6-8 minutes, or until the liquid has reduced in volume by half again. ", "Stir in two-thirds of the butter a little at a time, until the butter is incorporated into the sauce, then whisk in the lemon juice and season, to taste, with salt and freshly ground black pepper. Keep warm.", "Melt the remaining butter in a frying pan until foaming, then add the langoustine tail meat and fry for 2-3 minutes, or until golden-brown and heated all the way through. Remove from the heat and set aside.", "In a large bowl, mix together the Little Gem lettuce leaves, salad leaves and herbs. Whisk the red wine vinegar and olive oil together in a bowl until well combined, then drizzle over the salad and herbs and lightly mix to coat evenly.", "To serve, divide the salad among four serving plates, then place the langoustines alongside and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Languages of love wedding cake", "url": "www_bbc_co_uk_food_recipes_languages_of_love_35067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp grapeseed oil, plus extra for greasing", "3 large free-range eggs, separated", "180g/6¼oz sugar", "1 tbsp raspberry liqueur ", "red gel food colouring ", "175g/6oz plain flour", "½ tsp bicarbonate of soda", "50g/1¾oz freeze dried raspberries, crushed", "3 large free-range eggs", "225g/8oz golden caster sugar", "225g/8oz self-raising flour ", "1 tsp baking powder", "225g/8oz unsalted butter, softened", "pinch salt", "1 orange, zest only", "few drops orange extract", "85g/3oz ground almonds", "orange gel food colour", "3 large free-range eggs", "225g/8oz golden caster sugar", "225g/8oz self-raising flour", "1 tsp baking powder", "225g/8oz unsalted butter, softened", "pinch salt", "85g/3oz pistachios, shells removed, ground", "20g/1oz nibbed pistachios", "few drops almond extract", "1 orange, juice only", "1 tbsp icing sugar", "5 tbsp smooth marmalade ", "175g/6oz unsalted butter, melted, plus extra for greasing", "2 large free-range eggs ", "175g/6oz sugar ", "175g/6oz self-raising flour", "pinch salt", "1 unwaxed lemon, zest and juice", "185g/6½oz unsalted butter", "250g/9oz dark chocolate", "375g/13oz golden caster sugar", "pinch salt", "3 large free-range eggs", "1 tsp instant coffee granules", "220g/8oz self-raising flour", "40g/1½oz cocoa powder", "50g/1¾oz fresh raspberries", "400g/14oz unsalted butter", "800g/1lb 12oz icing sugar", "1-2 tbsp milk", "300g/10½oz mini marshmallows", "600g/1lb 5oz icing sugar, plus extra for dusting", "1kg/2lb 4oz ready-to-roll white fondant icing", "silver food paint", "teal gel food colour", "300g/10½oz white sugarpaste, for modelling", "400g/14oz marzipan", "50ml/2fl oz elderflower cordial", "50g/1¾oz poppy seeds", "few drops lemon extract", "125g/4½oz royal icing sugar ", "edible silver balls"], "serves": "Makes 1 three-tiered wedding cake", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the raspberry cake, preheat the oven to 160C/325F/Gas 3 and grease 12 cake pop moulds.", "In a bowl, combine the oil, egg yolks, sugar, and 100ml/3½fl oz water. Stir in the liqueur and the red gel food colouring. Sift in the flour and bicarbonate of soda. ", "Whisk the egg whites until stiff peaks form when the whisk is removed. Fold the egg whites and freeze-dried raspberries into the cake mixture. ", "Fill the cake pop moulds and bake for about 10 minutes, or until a skewer inserted into a cake pop comes out clean. Set aside to cool.", "To make the orange and pistachio cakes, grease and line two 18cm/7in springform cake tins and preheat the oven to 160C/325F/Gas 3. ", "For the orange cake, break the eggs into a large mixing bowl, then add the sugar, flour, baking powder and butter. Mix to combine, then add the remaining ingredients and mix again until well combined (the easiest way to do this is with an electric hand mixer, but a wooden spoon is sufficient). Pour the batter into one of the prepared cake tins and set aside while you make the pistachio cake.", "For the pistachio cake, break the eggs into a large mixing bowl, then add the sugar, flour, baking powder and butter. Mix to combine, then the rest of the ingredients and mix again until well combined. Pour the batter into the remaining 18cm/7in cake tin.", "Bake both cakes for 30 minutes, or until light and springy to the touch. When cooked, removed the cakes from the oven and place on a wire rack to cool completely.", "When the orange and pistachio cakes are completely cool, flatten the tops (don’t worry about taking off too much as the cakes will be sandwiched together to make a single tier of the final cake). Using the 12cm/5in cutter, cut out a round from the centre of each 18cm/7in cake. Then, using the 6cm/2½in cutter, cut out 6cm/2½in rounds from the centre of the 12cm/5in cakes. Swap the circles around and reassemble the cakes so that you end up with two 18cm/7in cakes that look like targets.", "For the orange syrup, heat the orange juice and icing sugar in a small pan to make a syrup. Brush the orange and pistachio cakes with the orange syrup. Warm the marmalade and brush over the cakes to glaze.  Stack cakes on top of each other. ", "For the lemon, poppy and elderflower cake, preheat the oven to 180C/350F/Gas 4 and grease and line two Swiss roll tins. ", "Whisk the eggs and sugar in large bowl with an electric whisk until the mixture is a very pale yellow, foamy and mousse-like. Add the melted butter. Fold in the flour, salt, lemon zest and juice. Divide the mixture between the prepared Swiss roll tins and bake for approximately 12 minutes. Set aside to cool, then use a 15cm/6in mousse ring cut out three circles of cake. ", "For the chocolate cake, preheat the oven to 160C/325F/Gas 3 and grease and line a 23cm/9in springform cake tin. ", "Melt the butter and chocolate in a microwave or a heatproof bowl suspended over a pan of simmering water. Once melted pour into a large mixing bowl and add the sugar, salt, eggs, coffee and 250ml/9fl oz water.", "Sift in the flour and cocoa powder. Mix to combine.", "Pour a layer of the cake batter into the bottom of the prepared cake tin, then add the cooked cake pops and fresh raspberries. Fill with the remaining chocolate cake batter. Bake for 90 minutes then set aside to cool completely. ", "Meanwhile, make the buttercream. Beat the butter in a large bowl until soft. Add half the icing sugar and beat until smooth. Add the remaining icing sugar and one tablespoon of the milk and beat the mixture until creamy and smooth. Beat in the remaining milk, if necessary, to loosen the mixture.", "To decorate the cakes, make a marshmallow fondant icing by melting the mini marshmallows for approximately 30 seconds in a microwave. Mix in the icing sugar and knead until you have a smooth paste (take care – the marshmallows will be hot). Set aside to cool completely.", "Place the cooled chocolate cake on the 23cm/9in cake board. Cover the cake with a crumb coat of buttercream. Lightly dust a work surface with icing sugar and roll out half the ready-to-roll fondant icing to the thickness of a pound coin. Make a pattern on the fondant by pressing one of the imprint mats into the icing. Drape the fondant over the cake, with the mat still attached so the pattern doesn’t stretch. Remove the mat and gently press the icing into the edges of the cake. Brush the smooth icing with silver food paint for an embossed effect. ", "Add a little teal gel colour to the sugarpaste and knead until the colour is evenly distributed. Lightly dust a work surface with icing sugar and roll out the sugarpaste to the thickness of a pound coin. Cut out letters to spell “LOVE” (these will sit on the top of the 15cm/6in cake) and set aside. ", "For the orange and pistachio cake, place the cake on the 18cm/7in cake board. On a work surface lightly dusted with icing sugar, roll out half the marzipan to the thickness of a pound coin. Drape over the cake and smooth down the sides. Roll out the remaining fondant icing in the same way then place the second imprint mat on top and press into the fondant. With the mat still attached drape the fondant over the cake. Carefully remove the mat and press the fondant into the sides of the cake. Brush with silver food paint and set aside. ", "To finish the lemon, poppy and elderflower cake, brush the cakes with elderflower cordial. Make a poppy seed buttercream by mixing the poppy seeds, lemon extract and the remaining buttercream together. Sandwich the three cake layers with the buttercream and place on the 15cm/6in cake board. To decorate, roll out the remaining marzipan and cover the cake.", "Roll out the cooled marshmallow fondant and cover the lemon, poppy and elderflower cake. Carefully score the icing to create a quilting effect. Make up a little royal icing according to packet instructions. Where ever the lines of the quilting cross, attach an edible silver ball using a little royal icing to help them stick.  ", "Stack the orange and pistachio cake on top of the chocolate cake, using straws or dowels to support the layers.  ", "Top the lemon cake with the letters, using a little royal icing to help them stick. Stack on top of the other cakes, again using straws or dowels to support the layers. ", "If you have time, make a book using any leftover sugarpaste in the shape of a notebook with a love story written on the inside. "]}, {"isVegetarian": true, "title": "Langues de chat biscuits", "url": "www_bbc_co_uk_food_recipes_langues_de_chat_biscuits_51182", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/langues_de_chat_biscuits_51182_16x9.jpg", "ingredients": ["125g/4½oz unsalted butter, softened", "125g/4½oz icing sugar, sifted", "125g/4½oz plain flour, sifted", "pinch salt", "1 tsp vanilla extract", "3 large egg whites"], "serves": "Makes about 20-25 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line two baking trays with baking parchment.", "Put the butter and icing sugar into a bowl and beat using an electric hand whisk until pale and smooth. Beat in the flour, one half at a time. Add the salt and vanilla extract and then beat in the egg whites.", "Spoon the mixture into a piping bag fitted with a 1cm/½in round nozzle and pipe straight lines of the mixture, about 8cm/3in long, onto the paper. Leave 5cm/2in between each biscuit as they will spread during cooking.", "Transfer the trays to the fridge for 15-20 minutes, or until the dough is firm to the touch. ", "Bake the biscuits for 10 minutes, or until light golden-brown around the edges. Use a palette knife to transfer to a wire rack to cool (so they don’t stick to the tray)."]}, {"isVegetarian": true, "title": "Lapsang souchong cupcakes", "url": "www_bbc_co_uk_food_recipes_lapsang_souchong_50355", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz semi-skimmed or skimmed milk", "8 Lapsang Souchong tea bags ", "220g/8oz unsalted butter", "450g/1lb granulated sugar", "2 large free-range eggs", "250g/9oz self-raising flour", "240g/8½oz plain flour", "230g/8¼oz unsalted butter, at room temperature", "120ml/4fl oz semi-skimmed milk", "2 tsp good quality vanilla extract", "500g/1lb 2oz icing sugar", "3 tbsp whisky, plus extra to taste", "100g/3½oz dark chocolate, finely grated, to decorate"], "serves": "Makes 24 cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/170C Fan/Gas 4 and line two 12-hole cupcake trays with cupcake cases.  ", "For the cupcakes, heat the milk in a saucepan until it begins to boil then remove the pan from the heat and add the teabags.  Cover and set aside for about 30 minutes.", "In a freestanding or handheld electric mixer, beat the butter and sugar together until light and fluffy. Add the eggs one at a time, mixing well after each addition. Sift the flours together into a separate bowl. ", "Add a third of the flours and a third of the tea-infused milk to the butter and sugar mixture. Mix well until combined, then add the remaining flour and milk in batches, mixing between each addition, until all the flour and milk has been combined.", "Divide the mixture equally between the 24 cupcake cases (use an ice-cream scoop to make this easier). Bake for about 22-25 minutes, or until springy to the touch.", "Cool the cupcakes in their tins for about 5 minutes, then place on a wire rack to cool completely.", "To make the whisky buttercream, beat the butter, milk, vanilla and half the icing sugar until smooth using an electric mixer. Add the rest of the icing sugar and beat until you have a smooth icing.  Mix in the whisky, adding more to taste if desired!  Transfer the buttercream to a piping bag fitted with a large star nozzle.", "When the cupcakes are completely cool, ice them with the whisky buttercream and grate a little dark chocolate over each one to decorate."]}, {"isVegetarian": false, "title": "Lardy cake", "url": "www_bbc_co_uk_food_recipes_lardy_cake_80839", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lardy_cake_80839_16x9.jpg", "ingredients": ["450g/1lb strong white flour", "1 tsp salt", "2 x 7g sachets instant yeast", "75g/2½oz lard", "300ml/10½fl oz water", "75g/2½oz butter", "225g/8oz mixed dried fruit including mixed peel", "50g/1¾oz soft brown sugar", "extra flour for dusting"], "serves": "Makes 12 slices", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the flour, salt and yeast in a mixing bowl. Rub in 20g/¾oz of the lard using your fingertips until there are no pieces of lard visible.", "Add three-quarters of the water and hand-mix the flour into the water to form a dough. Add as much of the remaining water as you need to get a dough that is soft and leaves the sides of the bowl clean.", "Tip the dough onto a lightly floured surface and knead for 5-10 minutes, or until the dough is smooth. Place in a clean bowl, cover and leave to rise until doubled in size. This depends on the temperature of the room, but should take 1-2 hours.", "Tip the dough onto a floured work surface and roll into a rectangle about 20x50cm/8x20in and about ½cm thick. ", "Dot a third of the remaining lard and a third of the butter over the surface of the dough. Scatter over a third of the fruit and a third of the sugar. Fold the top third of the dough down and the bottom third up so that the dough is folded in three and roughly square. Turn the dough a quarter turn. Roll out and repeat the out process twice more, to use up all the lard and fruit.", "Line a 23x23cm/9x9in square loose bottomed tin with baking parchment. Roll out the dough to fit the tin and place it inside. Cover with clingfilm, or place inside a large plastic bag, and leave to rise for 30 minutes. Preheat the oven to 220C/425F/Gas 7.", "Bake for 30-35 minutes, or until golden-brown.", "Leave to cool slightly before removing from the tin. Cut into squares and serve warm or cold, with butter."]}]