[{"ingredients": ["Avena de avena 250 g / 9 oz", "2 cucharaditas de ralladura de limón", "125g / 4½oz de mantequilla sin sal", "100g / 3½oz de azúcar mascabado", "100g / 3½ oz de jarabe dorado", "1kg / 2lb 4oz Granny Smith o manzanas para cocinar, peladas, sin corazón y cortadas en trozos", "40 g / 1½ oz de mantequilla sin sal", "1 cucharadita de canela", "1-2 cucharadas de azúcar mascabado", "1 limón, solo jugo", "1 cucharada de harina de maíz", "150 g / 5½ oz pasas", "600 ml / 1 pinta de leche entera", "1 cucharada de extracto de vainilla", "4 huevos de gallinas camperas, solo yema (aproximadamente 80 g / 3 oz)", "20 g / oz de azúcar en polvo", "2 cucharadas de harina de maíz"], "method": ["Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Para la cobertura de crumble, extender la avena en una bandeja grande para hornear y hornear durante 10-15 minutos, revolviendo una vez, hasta que estén tostados y dorados. Una vez tostado, ponga la avena en un recipiente y agregue la ralladura de limón. Deja el horno encendido.", "Derrita la mantequilla, el azúcar y el jarabe en una cacerola a fuego medio hasta que el azúcar se haya disuelto. Verter sobre la avena, darle una buena mezcla y dejar de lado.", "Coloque las manzanas, la mantequilla, la canela, 1 cucharada de azúcar y el jugo de limón en una sartén. Cocine por unos 10 minutos a fuego medio, hasta que las manzanas se hayan suavizado un poco. Agregue la harina de maíz y las pasas, luego incline la mezcla en una fuente para hornear cuadrada de 25 cm / 10 pulgadas o redonda. Cubra con la mezcla de flapjack en una capa uniforme. Hornee en el estante del medio del horno durante 40-45 minutos.", "Mientras tanto, para la crema pastelera poner la leche y la vainilla en una sartén y llevar a ebullición, luego baje a fuego lento a fuego lento. Coloque las yemas de huevo, el azúcar y la harina de maíz en un bol y bata hasta que la mezcla esté liviana. Poco a poco agregue la leche tibia en un flujo constante, batiendo todo el tiempo. Una vez que se haya agregado toda la leche, vuelva a verterla en la sartén a fuego medio y revuelva suavemente con una cuchara hasta que la mezcla se espese.", "Verter directamente en una jarra de servir y, si hay una espera, cubrir con película adhesiva, asegurándose de que la película toque la parte superior de la crema. A menos, por supuesto, que disfrutes de la piel, en cuyo caso déjala expuesta. Sirva el crumble junto con la crema pastelera."], "url": "www_bbc_co_uk_food_recipes_flapjack_cinnamon_apple_32656", "title": "Crumble de manzana canela Flapjack con crema de vainilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flapjack_cinnamon_apple_32656_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal, derretida", "50 g / 1 oz de azúcar en polvo", "50ml / 2fl oz de miel clara, más extra para lloviznar", "200 g / 7oz de avena", "azúcar glas, al polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cubra una bandeja para hornear con papel antigrasa.", "Coloque todos los ingredientes en un recipiente y mezcle.", "Coloque la mezcla de flapjack en la bandeja para hornear a prueba de grasas y colóquela en el horno para cocinar durante 10 minutos.", "Retire los flapjacks y transfiéralos al congelador por cinco minutos para que se asienten y firmen.", "Una vez que los flapjacks estén listos, retírelos del congelador y córtelos en trozos.", "Para servir, coloque en un plato de servir y espolvoree con azúcar glas y rocíe con miel."], "url": "www_bbc_co_uk_food_recipes_flapjacks_84370", "title": "Flapjacks", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla", "Jarabe dorado de 175g / 6oz", "175g / 6oz de azúcar mascabado", "Avena de avena 350g / 12oz", "½ limón, ralladura finamente rallada", "pellizcar jengibre molido"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2 y forre una bandeja para hornear cuadrada de 20 cm / 8 pulgadas con papel de hornear.", "Derrita la mantequilla en una sartén mediana a fuego lento. Sumerja un pincel en la mantequilla y cepille la lata de hornear con un poco de ella. Agregue el jarabe dorado y el azúcar a la mantequilla y caliente suavemente. Una vez que el azúcar se disuelva y la mantequilla se derrita, retire la sartén del fuego y agregue la avena, la ralladura de limón y el jengibre.", "Empaque la mezcla en la bandeja para hornear y aplaste. Hornee en el horno durante 40 minutos.", "Una vez cocinado, retíralo del horno, déjalo enfriar durante 15 minutos, luego ponlo en una tabla de cortar y córtalo en cuadrados.", "Estos flapjacks son deliciosos en un almuerzo para llevar o como un desayuno para llevar."], "url": "www_bbc_co_uk_food_recipes_flapjacks_86993", "title": "Flapjacks", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flapjacks_86993_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "1½ chalotes, finamente picados", "4 hongos Portobello, pulsados ​​en procesadores de alimentos", "125g / 4½ oz de azúcar demerara", "Vinagre de vino blanco 100 g / 3½ oz", "Crema doble 500ml / 18fl oz", "2 anchoas", "2 cucharadas de aceite", "Filetes de filete de cola de 2 x 250 g / 9 oz, aplastados a 1 cm / ½ pulgada de espesor", "sal de mesa, al gusto", "1 cucharadita de pimienta negra agrietada", "mantequilla perilla", "1 manojo de berros, recogido y lavado", "anillos de chalota crujientes"], "method": ["Para el ketchup de champiñones, caliente una sartén y agregue la mantequilla. Una vez derretido, freír los chalotes durante unos minutos. Agregue los champiñones mezclados y fría hasta que estén suaves.", "Agregue el azúcar y el vinagre y cocine hasta que el volumen del líquido se haya reducido, luego agregue la crema y reduzca nuevamente. Mezcle en un procesador de alimentos con las anchoas y luego pasar a través de un colador. Guárdelo en la nevera hasta que lo necesite.", "Para el bistec frito, en una sartén grande muy caliente, agregue un poco de aceite. Una vez caliente, sazone los filetes con sal y pimienta negra.", "Agregue un pomo de mantequilla a la sartén y luego agregue el bistec. Cocine por 30-40 segundos en un lado y luego 20 segundos en el otro lado.", "Deje los filetes descansar durante dos minutos y luego cortar.", "Para servir, servir el filete en rodajas con la salsa de tomate de champiñones, berros y anillos de chalote."], "url": "www_bbc_co_uk_food_recipes_flash_fried_steak_with_94231", "title": "Filete frito con salsa de tomate y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharada de aceite de oliva", "Filete de salmón 150 g / 5½ oz, cortado en trozos de 0,5 cm / ½ pulgada de espesor", "½ limón, solo jugo", "¼ de pimiento amarillo, finamente picado", "¼ de cebolla roja, finamente picada", "1 cucharadita de hojuelas de chile", "2 cucharadas de perejil fresco picado", "1 cucharada de aceite de oliva", "1 limón, ralladura y jugo"], "method": ["Para el salmón, caliente el aceite en una sartén pequeña a fuego alto y fría las rodajas de salmón durante 20 segundos en cada lado, o hasta que estén recién cocidas.", "Retire el salmón de la sartén a un plato de servir y exprima el jugo de limón.", "Para la salsa, mezcle todos los ingredientes de la salsa en un bol y sirva con el salmón."], "url": "www_bbc_co_uk_food_recipes_flashfriedsalmonwith_87243", "title": "Salmón frito con pimienta amarilla y salsa de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "4 zanahorias, 2 picadas finamente, 2 cubitos", "1 cebolla, finamente picada", "1 apio de palo grande, finamente picado", "1kg / 2lb 4oz de costilla plana o costillas cortas (incluido el hueso)", "125g / 4½oz de cebada perlada", "125g / 4½oz de guisantes partidos", "2 hojas de laurel", "sal y pimienta negra recién molida", "100g / 3½oz de lentejas", "1 puerro, en rodajas", "1 nabo pequeño, cortado en 1cm / ½ en dados", "2 papas medianas, cortadas en dados de 1 cm / ½ pulgadas"], "method": ["Caliente el aceite vegetal en una cacerola grande a fuego medio. Agregue las dos zanahorias picadas finamente, la cebolla y el apio y cocine por cinco minutos, o hasta que estén suaves. Agregue las costillas planas y 3 litros / 5¼ pintas de agua hirviendo a la sartén.", "Vuelva a hervir y agregue la cebada perlada, los guisantes partidos y las hojas de laurel. Coloque una tapa en la olla y reduzca el fuego. Cocine a fuego lento con la tapa puesta durante 1½ horas.", "Pruebe y agregue una buena pizca de sal y pimienta al gusto. Agregue las lentejas y cocine durante 20 minutos más, asegurándose de volver a colocar la tapa.", "Después de 20 minutos, agregue los puerros, la zanahoria en cubos reservada, el nabo y las papas y cocine por otros 20 minutos o hasta que estén tiernos.", "Ajuste el condimento agregando sal y pimienta si es necesario.", "Retire las costillas planas de la sartén y déjelas a un lado en un plato caliente.", "Agregue el caldo en tazones para servir y talle un trozo de costilla del hueso y colóquelo encima del caldo."], "url": "www_bbc_co_uk_food_recipes_flat_rib_broth_00443", "title": "Caldo de costilla plana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para espolvorear", "sal y pimienta negra", "2 cucharadas de aceite de oliva", "150-200ml / 5-7fl oz de agua tibia", "3 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "1 x 400g / 14oz de tomates picados en lata", "½ cucharadita de hierbas secas mezcladas", "1 calabacín (aproximadamente 200 g / 7 oz), rallado", "2 bolas de mozzarella, escurridas y rotas", "Rodajas de pepperoni 100 g / 3½ oz", "1 cebolla, muy finamente cortada"], "method": ["Para los panes planos, tamice la harina en un tazón y sazone con un par de pellizcos de sal y una pizca de pimienta. Agregue el aceite de oliva y mezcle en agua tibia, comenzando con 150 ml / 5 fl oz y agregando más si es necesario para unir la mezcla para formar una masa espesa. Amasar la masa en el tazón para unirlo.", "Amasar la masa en una superficie de trabajo enharinada durante 3-4 minutos o hasta que la masa esté ligeramente elástica. Cubre y deja reposar mientras preparas el resto del plato.", "Para las coberturas, caliente una olla pequeña a fuego lento. Agregue una pizca de aceite de oliva y agregue el ajo y fría por un minuto. Agregue los tomates, las hierbas secas y una pizca de sal y pimienta y cocine a fuego lento. Mash los tomates con un triturador de papas para crear una salsa más suave y cocine a fuego lento la mezcla durante 10-15 minutos, o hasta espesó a una salsa untable.", "Precaliente el horno a la temperatura más alta y coloque una bandeja para hornear antiadherente en el horno para calentar.", "Para los panes planos, divida la masa en cuatro bolas y ruede cada bola sobre una superficie enharinada hasta aproximadamente 5 mm / ¼ de grosor. Engrase ligeramente la bandeja de horno caliente, coloque las bases de pizza de pan plano en la parte superior y cocine en el horno caliente durante 2 o 3 minutos (es posible que deba hacerlo en lotes si no tiene espacio para hacerlos todos a la vez).", "Voltea las bases de pizza de pan plano. Pruebe la salsa de tomate y agregue sal y pimienta al gusto. Divida la mezcla de tomate entre las cuatro bases de pizza de pan plano, extendiéndolas hasta que casi llegue a los bordes pero dejando un borde de 2 cm / ¾ pulg alrededor del borde.", "Espolvoree sobre el calabacín rallado, cubra con la mozzarella desgarrada, las rodajas de pepperoni y la cebolla. Rocíe con un poco de aceite de oliva extra, sazone con sal y pimienta y coloque de nuevo en el horno caliente durante 6-7 minutos, o hasta que la base esté bien cocida y el queso se derrita y se ponga dorado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_flatbread_pizza_with_08542", "title": "Pizza Flatbread con pepperoni, calabacín y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 papas cerosas medianas (como Charlotte o Jersey Royal)", "Arroz poha 140g / 5oz (también llamado arroz copos o arroz aplastado grueso)", "3 cucharadas de aceite de oliva", "generosa pizca de tierra asafoetida", "½ cucharadita de urad dal", "½ semillas enteras de mostaza marrón", "½ cucharadita de semillas de comino entero", "1 chile picante seco", "10-15 hojas frescas de curry, ligeramente aplastadas", "½ cebolla, picada", "sal", "1 cucharadita de azúcar", "2-3 cucharadas de cilantro fresco picado, para adornar", "4 cuñas de limón o limón, para servir", "1 ronda de lechuga, lavado y hojas separadas", "¼ de pepino, picado", "3 tomates de ciruela picados"], "method": ["Hervir las papas hasta que estén cocidas. Escurrir y reservar para enfriar, luego pelar y cortar en cubos de 1cm / ½.", "Coloque el arroz en un colador y lávelo suavemente pero con abundante agua fría. Vacíe en un recipiente, cúbralo generosamente con agua y déjelo en remojo durante dos minutos. Escurrir y dejar en el tamiz colocado sobre un recipiente.", "Ponga el aceite en una sartén grande y antiadherente y colóquelo a fuego medio-alto. Cuando esté caliente, agregue asafétida y urad dal. Tan pronto como el dal comience a tomar un poco de color, agregue las semillas de mostaza, las semillas de comino y el chile (cualquiera que sea el tipo que esté usando). Tan pronto como las semillas de mostaza comiencen a aparecer, en cuestión de segundos, agregue las hojas de curry (tenga cuidado ya que chisporrotearán), luego la cebolla y las papas. Baje a fuego medio y fría, revolviendo de vez en cuando, durante 3-4 minutos o hasta que la cebolla y las papas estén ligeramente doradas.", "Espolvorea una pizca de sal sobre la parte superior y revuelve.", "Agregue el arroz poha, rompiendo suavemente los grumos y espolvoree ½ cucharadita de sal y una cucharadita de azúcar en la parte superior. Cocine a fuego lento durante 3-4 minutos, lanzando con frecuencia levantando todos los ingredientes del fondo de la sartén con una espátula plana y doblándolos, hasta que el poha se caliente. Cubra y reserve hasta que esté listo para comer.", "Para hacer la ensalada, mezcle todos los ingredientes en un tazón grande.", "Para servir, adornar las papas poha con cilantro fresco y servir con rodajas de limón o limón. Sirve la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_flattened_rice_with_poha_64857", "title": "Arroz aplastado con patatas poha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "botón de mantequilla", "1 bulbo de hinojo, finamente picado, hojas reservadas para decorar", "1 manojo de cebollas de primavera, picadas", "1 cucharadita de pimentón", "6 granos de pimienta enteros", "1 x 400 g de tomate picado", "6-8 papas recién nacidas (preferiblemente Jersey Royals), lavadas y partidas por la mitad", "4-8 mejillones, limpios y barba eliminados", "eglefino de filete pequeño (aproximadamente 150-170g), despellejado, deshuesado y cortado en trozos", "rape pequeño (aproximadamente 150-170g), despellejado, deshuesado y cortado en trozos", "12 vieiras o langostinos frescos (opcional)", "gran ramita de estragón fresco", "puñado de tomates cherry, reducido a la mitad", "sal y pimienta negra recién molida"], "method": ["Para hacer la base para el estofado, caliente un poco de aceite de oliva y un pomo de mantequilla en una olla grande. Cuando la mantequilla se derrita, agregue las verduras picadas y una pizca de sal.", "Cubra con una tapa y cocine a fuego lento durante 4-5 minutos, luego agregue una cucharadita de pimentón, un toque generoso de pimienta negra recién molida y toda la pimienta en grano. Vierta los tomates en lata, luego llene la lata vacía con agua y agregue eso a la olla también. Cocine a fuego lento con la tapa puesta durante 5 minutos más o menos, revolviendo ocasionalmente. Agregue las papas nuevas, vuelva a colocar la tapa y continúe cocinando a fuego lento durante otros 5 minutos, o hasta que las papas estén casi cocidas.", "Si hay mejillones abiertos, tóquelos ligeramente sobre una superficie dura. Si no se cierran, deséchelos. Agregue el pescado y los mejillones a la sartén. Si está utilizando vieiras reina o gambas frescas, deberían ir en un minuto o dos más tarde, ya que se cocinarán rápidamente.", "Agregue una ramita grande de estragón y cocine a fuego lento durante unos minutos más. Los mejillones se cocinan cuando se abren. Descarta cualquiera que no se abra.", "Sirva el guiso en tazones con guarnición de tomates cherry y hojas de hinojo."], "url": "www_bbc_co_uk_food_recipes_flexible_fish_stew_82833", "title": "Guiso de pescado flexible", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["botón de mantequilla, ablandada, para engrasar", "225g / 8oz de queso crema", "100g / 3½oz de azúcar glas, cernida", "1 limón, ralladura solamente, más un chorrito de jugo de limón", "Fresas de 200g / 7¼oz, cascos eliminados, cortados por la mitad", "Frambuesas 200g / 7¼ oz", "75g / 2½ oz de azúcar glas, cernida (o azúcar en polvo)", "220 g / 7¾oz de clara de huevo", "230 g / 8¼ oz de azúcar en polvo", "2 vainas de vainilla, semillas raspadas con un cuchillo afilado", "50 g / 2 oz de pistachos, conchas eliminadas, finamente picadas (opcional)", "100 g / 3½ oz de azúcar en polvo", "Frambuesas de 150g / 5¼ oz", "16 fresas, cascos eliminados, cortados en cuartos", "1 melón pequeño de pulpa blanca, como Honeydew, pelado, sin semillas, carne picada finamente", "1 melón pequeño de pulpa anaranjada, como canteloupe, pelado, sin semillas, carne muy finamente picada"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase el interior de seis moldes dariole cepillándolos con la mantequilla ablandada.", "Para la mezcla de queso crema, bata el queso crema, el azúcar glas, la ralladura de limón y un chorrito de jugo de limón en un tazón grande hasta que estén bien combinados. Enfriar en la nevera hasta que sea necesario.", "Para el coulis de fresa, caliente las fresas y las frambuesas en una sartén grande durante 4-5 minutos, o hasta que comiencen a descomponerse.", "Agregue el azúcar glaseado (o caster) y continúe cocinando la fruta por otros 2-3 minutos, o hasta que el azúcar se haya disuelto.", "Transfiera la mezcla de coulis a un procesador de alimentos y mezcle hasta que esté suave, agregando un chorrito de agua a la mezcla si es necesario para aflojar. Cuele el coulis a través de un colador y déjelo enfriar. Enfriar en la nevera hasta que sea necesario.", "Para las islas flotantes, haga una mezcla de merengue: bata las claras de huevo en un bol hasta que se formen picos suaves cuando se quite el batidor. Agregue las semillas de azúcar y vainilla y continúe batiendo hasta que se formen picos firmes y brillantes cuando se quite la batidora. Transfiera la mezcla a una manga pastelera y déjela a un lado.", "Para el caramelo, caliente una sartén antiadherente a fuego medio y agregue el azúcar. Cocine el azúcar hasta que se haya disuelto y forme un caramelo.", "Vierta un poco del caramelo en cada uno de los moldes dariole y la punta de los moldes para alinearlos con el caramelo.", "Pipe algo de la mezcla de merengue en cada molde.", "Coloque los moldes en una bandeja de asar. Agregue suficiente agua hirviendo para llegar a la mitad de los lados de los moldes y hornee en el horno durante 7-8 minutos, o hasta que el merengue se haya puesto.", "Para servir, rocíe un poco del coulis en cada uno de los seis tazones de servir. Espolvoree las frambuesas, las fresas y el melón en los tazones. Ponga una isla flotante en cada tazón y espolvoree cualquier exceso de caramelo del molde. Coloque una quenelle de la mezcla de queso crema junto a cada porción."], "url": "www_bbc_co_uk_food_recipes_floating_island_with_39422", "title": "Isla flotante con coulis de fresa y fruta de verano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750ml / 1⅓ pinta de leche", "1 vaina de vainilla, solo semillas", "8 yemas de huevo de gallinas camperas", "190g / 7oz de azúcar en polvo", "500ml / 18fl de leche en oz", "1 cucharada de azúcar en polvo", "8 claras de huevo de gallinas camperas", "190g / 7oz de azúcar en polvo", "75 g / 2½ oz de azúcar en polvo"], "method": ["Para la crème anglaise, caliente la leche y las semillas de vainilla en una cacerola a fuego medio. Cocine a fuego lento durante 4-5 minutos.", "Batir las yemas de huevo y el azúcar en un tazón.", "Vierta la mezcla de leche caliente en los huevos y el azúcar, poco a poco, para que los huevos no comiencen a cocinar, batiendo continuamente hasta que estén suaves y cremosos.", "Regrese la mezcla a la cacerola y coloque la sartén a fuego medio y revuelva continuamente durante 4-5 minutos, o hasta que la mezcla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara.", "Cuele la mezcla a través de un colador en un recipiente, deje enfriar y luego refrigere.", "Para el licor de caza furtiva, combine la leche y 500 ml / 18 fl oz de agua con el azúcar en una cacerola, revolviendo para disolver el azúcar.", "Para el merengue, con un batidor de mano eléctrico, bata los blancos en un bol hasta que se formen picos rígidos cuando se quite el batidor, pero la mezcla no debe verse demasiado seca. Agregue una cucharada de azúcar a las claras de huevo, y continúe batiendo hasta que la mezcla vuelva a los picos rígidos. Agregue el azúcar una cucharada a la vez hasta que se haya usado todo, y el merengue es grueso y brillante.", "Usando una cuchara para servir mojada en agua fría, forme las grandes quenellas del merengue y bata suavemente en la solución de leche y agua, volteándolas después de 4-5 minutos para asegurarse de que estén cocidas en ambos lados. Asegúrese de que el líquido no hierva o que los merengues se hinchen y luego colapsen. Cuando esté completamente cocinado, colóquelo suavemente sobre una rejilla para drenar.", "Para el caramelo, vierta el azúcar en una sartén limpia. Derrita el azúcar lentamente, revolviendo con una cuchara de madera a fuego lento hasta que el azúcar se vuelva de color cobre oscuro. Retire inmediatamente del fuego para asegurarse de que el caramelo no se quema.", "Vierta el caramelo sobre los merengues. Cuando esté listo, toma los merengues cubiertos de caramelo de la bandeja y sirve en un generoso grupo de crème inglaise."], "url": "www_bbc_co_uk_food_recipes_floating_islands_01988", "title": "Islas flotantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floating_islands_01988_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 claras de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "50g / 2oz de azúcar glasé", "1 vaina de vainilla, partido, semillas raspadas", "1 cucharada de miel"], "method": ["Coloque las claras de huevo en un recipiente limpio y seco y bata con un batidor de mano eléctrico hasta que se formen picos rígidos cuando se quite el batidor. Poco a poco agregue el azúcar una cucharada a la vez hasta que se incorpore todo el azúcar y la mezcla esté brillante.", "Llene a la mitad una olla mediana con agua hirviendo, agregue las semillas de vainilla y deje hervir suavemente.", "Usando dos cucharadas grandes, haga quenelles (cucharadas grandes) de la mezcla de merengue y luego deje caer las quenelles en el agua hirviendo de vainilla. Cueza durante 2-3 minutos, voltee, rocíe con miel y cocine por otros 2-3 minutos.", "Con cuidado, cuchara en un plato y repita con el resto de la mezcla de merengue."], "url": "www_bbc_co_uk_food_recipes_floatingislands_86219", "title": "Islas flotantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de té de manzanilla (preferiblemente flores enteras)", "120 g / 4½ oz de mantequilla sin sal", "8 huevos de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "Harina normal de 250g / 9oz", "420g / 15oz de margarina para hornear", "850g / 1lb 14oz de azúcar glas", "½ cucharadita de flor de saúco cordial", "2 gotas de extracto de flor de saúco (disponible en línea), opcional", "gel colorante para alimentos amarillos"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase y forme una lata de torta con forma de resorte de 20 cm / 8 pulg.", "Para la torta, triture el té en un molinillo de especias o en mortero hasta que se convierta en un polvo fino. Derrita la mantequilla en una cacerola y agregue el té. Cuando se derrita, retíralo del fuego.", "Agriete los huevos en un tazón grande y bata el azúcar con una batidora eléctrica. Batir hasta que la mezcla sea lo suficientemente espesa como para mantener su forma durante varios segundos cuando se rocía sobre su superficie (conocida como etapa de cinta, esto puede tomar alrededor de 15 minutos). Tamiza un tercio de la harina y dóblala con una cuchara grande de metal. Tamizar en otro tercio de la harina y doblar como antes. Tamizar la harina restante en la mezcla de mantequilla y mezclar bien, luego dóblela suavemente en el resto de la mezcla.", "Transfiera la mezcla a la lata y hornee durante 45 minutos (revisando regularmente para asegurarse de que no se dore). Cuando esté cocido, retírelo del horno y déjelo enfriar en la lata durante 5 minutos. Retirar de la lata y dejar enfriar en una rejilla de alambre.", "Para la crema de mantequilla, con una batidora eléctrica batir la margarina, el azúcar glas y los aromatizantes de flor de saúco en un tazón grande. Siga batiendo hasta que esté blanco y esponjoso, luego déjelo a un lado en el refrigerador hasta que lo necesite.", "Para ensamblar, si es necesario, recorte la parte superior de la torta para asegurarse de que quede plana. Corta el pastel por la mitad horizontalmente. Agregue una capa generosa de crema de mantequilla a la capa inferior de la torta y luego coloque la otra capa encima. Transfiera el pastel a una tabla de servir o a un puesto de pasteles.", "Extienda una capa delgada de crema de mantequilla por todo el pastel (también conocido como una capa de migajas).", "Coloque una manga larga con una boquilla de estrella cerrada. Frote las rayas del colorante amarillo en el interior de la manga con una brocha de pastelería o un cuchillo de punta redonda.", "Llene la manga pastelera con crema de mantequilla y pise algunos puntos de prueba hasta que la crema salga en dos tonos. Comenzando en la base de la torta, dibuje líneas de puntos alrededor de la torta para cubrir los lados, luego comience a pasar la parte superior en círculos de puntos empezando en el borde y trabajando hacia adentro. Coloque en la nevera entre los niveles de formación de hielo si encuentra que la crema de mantequilla se está derritiendo."], "url": "www_bbc_co_uk_food_recipes_floral_tea_cake_15741", "title": "Pastel de té floral", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace torta de 1 x 20 cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floral_tea_cake_15741_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pan de 40 g / 1½ oz (aproximadamente 1 rebanada gruesa)", "Filetes de pescado blanco sin piel 400g / 14oz (como bacalao, eglefino o abadejo)", "5 cucharadas de harina normal", "1 huevo grande de gallinas camperas, golpeado", "¼ cucharadita de pimentón (opcional)", "1 cucharadita de ajo en polvo (opcional)", "pimienta negra recién molida", "un poco de aceite de girasol, un aceite en aerosol también es bueno para usar"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja de hornear con papel pergamino antiadherente.", "Para hacer las migas de pan, coloca el pan en un procesador de alimentos y blitz en migas de pan finas. Si no tiene un procesador de alimentos, también podría intentar rallar el pan, pero necesitaría un adulto que lo ayude con esto.", "Seque el pescado con papel de cocina. Cortar cuidadosamente el pescado en tiras, las tiras deben ser de aproximadamente 2 cm de espesor y 8 cm de largo. Pase su dedo suavemente sobre el pez para asegurarse de que se hayan extraído todos los huesos, puede hacer que un adulto lo compruebe dos veces.", "Configure su línea de montaje. Obtenga 3 platos para cenar y un recipiente poco profundo listos.", "Pon la harina en el primer plato. Rompe el huevo en el recipiente poco profundo y bate suavemente con un tenedor. Coloque las migas de pan en el segundo plato y mezcle con el pimentón, el ajo en polvo y la pimienta negra. La tercera placa es para los dedos de pescado recubiertos.", "Mezcle cada dedo de pescado en la harina y sacuda el exceso. A continuación, sumerja los dedos de pescado en la mezcla de huevo y permita que cualquier líquido de huevo adicional gotee de vuelta al recipiente. Luego cubra los dedos de pescado con las migas de pan. Presione ligeramente los dedos de pescado en las migas de pan para asegurarse de que estén bien cubiertos y luego colóquelos en el tercer plato.", "Coloque los dedos de pescado en el refrigerador durante 10 minutos, esto ayudará a que el recubrimiento se adhiera mejor al pescado. Lávese las manos nuevamente antes de pasar al siguiente paso, es muy importante lavarse las manos siempre después de manipular pescado o carne crudos.", "Coloque los dedos de pescado en una sola capa en la bandeja de horno preparada. Rocíe o rocíe un poco de aceite sobre los dedos de pescado.", "Hornee en el horno durante 10-12 minutos, volteando hasta la mitad usando pinzas de cocina. Los dedos de pescado se cocinan cuando las migajas son doradas y el pescado se cocina a través.", "Estos dedos de pescado se sirven mejor con ketchup para mojar y con gajos de camote y guisantes al lado."], "url": "www_bbc_co_uk_food_recipes_floss_fantastic_fish_31623", "title": "Fantásticos dedos de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floss_fantastic_fish_31623_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de chocolate negro de buena calidad, picado en pedazos", "100 g / 3½ oz de mantequilla sin sal, más extra para engrasar", "4 huevos grandes de gallinas camperas, separados", "175g / 6½oz de azúcar glas, cernida"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un molde grande para hornear.", "En un recipiente pequeño que descansa sobre una olla de agua caliente, derrita el chocolate y la mantequilla (el recipiente no debe tocar el agua).", "En un recipiente aparte, bata las yemas de huevo con el azúcar glas hasta que estén pálidas y cremosas.", "Dobla el chocolate derretido en la mezcla de huevo.", "Con un batidor limpio, batir las claras de huevo hasta que se formen picos suaves, luego doblar gradualmente en la mezcla de chocolate.", "Con una espátula vierta la mezcla en el molde engrasado, luego hornee en el horno durante aproximadamente 30 minutos, hasta que se agriete ligeramente en la parte superior, pero todavía pegajoso en el medio. Servir."], "url": "www_bbc_co_uk_food_recipes_flourlesschocolateca_82362", "title": "Rico pastel de chocolate sin harina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 torta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10½fl oz de leche entera", "300ml / 10½ fl oz crema doble", "1 cucharadita de pasta de frijoles de vainilla", "6 huevos de gallinas camperas, solo yemas", "100 g / 3½ oz de azúcar en polvo", "6 huevos de gallinas camperas, solo para blancos", "150 g / 5½ oz de azúcar en polvo", "100 g / 3½ oz de azúcar en polvo"], "method": ["Para preparar el líquido de caza furtiva (y lo que se convertirá en la crème inglaise), caliente la leche y la crema en una sartén grande con tapa o en una sartén profunda. Agregue la pasta de frijoles de vainilla y deje hervir a fuego lento.", "Para los merengues, en un tazón grande sin grasa use un batidor de mano eléctrico para batir las claras de huevo juntas a alta velocidad, hasta que se formen picos rígidos cuando se quite el batidor. Agregue una cucharada de azúcar a las claras de huevo y continúe batiendo hasta que la mezcla vuelva a los picos rígidos. Siga agregando azúcar una cucharada a la vez hasta que se hayan usado 150 g / 5½ oz, y el merengue es grueso y brillante.", "Usando dos cucharadas grandes o sirviendo cucharas sumergidas en agua fría, forme seis quenelles grandes de la mezcla de merengue y coloque en el líquido de cocción, a fuego muy lento durante unos 9-10 minutos, volteando las quenelles hasta la mitad. Cubra la olla con una tapa mientras caza furtivamente. Asegúrate de que el líquido que caza furtivamente no hierva o los merengues se hinchen y luego colapsen.", "Cuando las quenelles estén hinchadas y cocidas, transfiéralas a una rejilla para drenarlas.", "Para la crème anglaise, pasa la leche furtiva a través de un tamiz en una jarra grande.", "En un tazón grande, bata las yemas de huevo y el azúcar impalpable hasta que estén pálidas y esponjosas. Vierta sobre la leche caliente de caza furtiva, batiendo continuamente. Vierta la mezcla en una sartén limpia de base pesada y cocine a fuego muy lento durante 3-4 minutos revolviendo continuamente hasta que quede suave y espeso para cubrir la parte posterior de una cuchara. Sáquelo del fuego y apártelo.", "Para el azúcar hilado, derrita el azúcar, sin remover, en una sartén pequeña de acero inoxidable a fuego medio. Engrase un rodillo o acero para cuchillas con aceite. Tenga cuidado ya que el azúcar estará muy caliente. Cuando se convierte en un oscuro dorado eliminar del calor. Deje que se enfríe un poco, luego, usando la parte posterior de un tenedor, mueva el caramelo hacia atrás y hacia adelante sobre el rodillo o el cuchillo de acero. Reúna los hilos en forma de bola rugosa y colóquelos en una hoja de papel pergamino.", "Para servir, vierta un poco de crema inglesa en cada tazón de servir y coloque una quenelle de merengue en la parte superior. Decora la quenelle con una bola de azúcar hilada."], "url": "www_bbc_co_uk_food_recipes_floating_islands_with_03517", "title": "Islas flotantes con azúcar hilado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floating_islands_with_03517_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de chocolate blanco, roto en pedazos", "225 g / 8 oz de azúcar en polvo", "175ml / 6fl oz de agua hirviendo", "225g / 8oz de mantequilla salada, cortada en cubos, más extra para engrasar", "6 huevos de gallinas camperas, separados", "1 cucharadita de café instantáneo en polvo", "2 cucharaditas de extracto de vainilla", "200 ml / 7 fl oz crema fresca", "Bayas de verano de 255 g / 9 oz", "1 cucharada de chocolate natural, rallado", "Glaseado de azúcar, al polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la torta, engrase y forme la base de una lata con forma de resorte de 23 cm / 9 pulg. Con pergamino para hornear.", "Mezcle el chocolate y el azúcar en un procesador de alimentos hasta que se forme un polvo fino. Agregue el agua hirviendo, la mantequilla, las yemas de huevo, el café en polvo y el extracto de vainilla y mezcle hasta que estén bien combinados.", "En un tazón limpio, bate las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor, luego, con una cuchara de metal, dobla suavemente en la mezcla de chocolate.", "Vierta la mezcla en el molde de pastel preparado y hornee durante 45-55 minutos, o hasta que un pincho insertado en el centro salga limpio.", "Retire la torta del horno y deje enfriar en la lata, luego transfiera a la nevera por 2-3 horas.", "Para servir, retire la torta de la lata y colóquela en un plato para servir o en un soporte para pasteles, esparza la crème fraîche encima, luego esparza sobre las bayas. Para decorar, rallar un poco de chocolate por encima, o espolvorear con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_flourlesschocolateca_93580", "title": "Pastel de chocolate sin harina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flourlesschocolateca_93580_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, ghee o aceite de coco, para engrasar", "Coliflor 140g / 5oz (aproximadamente ¼ de una cabeza sin tallo)", "1 clara de huevo, batida", "50 g / 1¾oz de almendras molidas", "Harina de alforfón 40 g / 1½ oz", "½ cucharadita de sal marina", "½ cucharadita de pimienta negra", "¼ cucharadita de bicarbonato de soda", "1 bola mediana de mozzarella", "2 puñados de tomates frescos (una mezcla de colores se ve bien)", "copos de chile (opcional)", "puñado de albahaca fresca", "llovizna de aceite de oliva, para servir"], "method": ["Precaliente el horno a un ventilador a 170 ° C / 190 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con pergamino para hornear y engrase ligeramente con mantequilla, ghee o aceite de coco.", "Rallar la coliflor en trozos del tamaño de un arroz con un rallador o procesador de alimentos.", "Coloque todos los ingredientes de la base de pizza en un tazón y mezcle bien con una cuchara, o agregue al procesador de alimentos y mezcle, para formar una masa pegajosa.", "Con la parte posterior de una cuchara, extienda la masa sobre el pergamino engrasado en la bandeja, y déle forma de círculo de 30 cm de ancho.", "Hornee en el horno durante unos cinco minutos, luego voltéelo y vuelva al horno por otros dos minutos.", "Separa la bola de mozzarella en trozos pequeños y colócalos sobre la base de la pizza.", "Cortar los tomates en rodajas de 1cm / ½ en gruesas y colocar sobre la pizza. Agregue los copos de chile, si lo desea.", "Hornee la pizza por 10-15 minutos más hasta que la mozzarella se derrita y burbujee.", "Espolvoree la albahaca sobre la parte superior de la pizza antes de servirla y rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_flower_power_pizza_13681", "title": "Pizzería Flower Power", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 pizza de 30cm / 12in", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flower_power_pizza_13681_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["135g / 4¾oz de harina común", "1 cucharadita de polvo de hornear", "½ cucharadita de sal", "2 cucharadas de azúcar en polvo", "130 ml / 4½ fl oz de leche", "1 huevo grande, ligeramente batido", "2 cucharadas de mantequilla derretida (se deja enfriar un poco) o aceite de oliva, más extra para cocinar", "miel de maple", "Mantequilla"], "method": ["Tamiza la harina, el polvo de hornear, la sal y el azúcar en polvo en un tazón grande. En un tazón o jarra por separado, mezcle ligeramente la leche y el huevo, luego mezcle la mantequilla derretida.", "Vierta la mezcla de leche en la mezcla de harina y, con un tenedor, bata hasta que tenga una mezcla suave. Cualquier bulto desaparecerá pronto con un poco de mezcla. Deje reposar la mezcla por unos minutos.", "Caliente una sartén antiadherente a fuego medio y agregue un poco de mantequilla. Cuando esté derretido, agregue un cucharón de masa (o dos si su sartén es lo suficientemente grande como para cocinar dos panqueques al mismo tiempo). Parecerá muy grueso, pero así es como debería ser. Espere hasta que la parte superior del panqueque comience a burbujear, luego voltee y cocine hasta que ambos lados estén dorados y el panqueque haya aumentado a aproximadamente 1 cm (½ pulgada) de grosor.", "Repita hasta que se agote toda la pasta. Puedes mantener los panqueques calientes en un horno bajo, pero saben mejor recién salidos de la sartén.", "Sirve con látigos de jarabe real de arce y mantequilla adicional si quieres."], "url": "www_bbc_co_uk_food_recipes_fluffyamericanpancak_74828", "title": "Panqueques mullidos americanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fluffyamericanpancak_74828_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco fuerte", "2 cucharaditas de sal", "2 saquitos de levadura de mezcla fácil y seca", "2 cucharadas de aceite de oliva", "400ml / 14fl oz de agua fría", "aceite de oliva, para lloviznar", "buena sal marina"], "method": ["Coloque la harina, la sal, la levadura, el aceite de oliva y 300 ml / 10 ½ oz del agua en un tazón grande. Revuelva suavemente con la mano o una cuchara de madera para formar una masa y amasar la masa en el recipiente durante cinco minutos, agregando gradualmente el agua restante.", "Estire la masa a mano en el recipiente, meta los lados en el centro, gire el recipiente 80 grados y repita el proceso durante unos cinco minutos.", "Incline la masa sobre una superficie de trabajo engrasada y continúe amasando durante cinco minutos más. Regrese la masa al recipiente, cubra y deje que se levante hasta que duplique su tamaño.", "Forre dos bandejas grandes para hornear con papel de hornear. Incline la masa fuera del tazón y divídala en dos porciones. Aplane cada porción en una bandeja para hornear, empujando hacia las esquinas, luego déjelo para probar durante una hora.", "Precaliente el horno a 220C / 425F / Gas 7. Rocíe los panes con aceite, espolvoree sal fina de mar y luego caliente en el horno por 20 minutos. Cuando esté cocido, rocíe con un poco más de aceite de oliva y sirva caliente o tibia."], "url": "www_bbc_co_uk_food_recipes_focaccia_08389", "title": "focaccia", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 2 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/focaccia_08389_16x9.jpg", "isVegetarian": true, "recommendations": 0}]