[{"isVegetarian": true, "title": "Jaffa cake tarts", "url": "www_bbc_co_uk_food_recipes_jaffa_cake_tarts_49771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz unsalted butter, softened", "200g/7oz icing sugar, sifted", "100g/3½oz beaten free-range eggs", "420g/15oz plain flour, sifted", "85g/3oz cocoa powder, sifted", "pinch salt", "125g/4½oz unsalted butter, softened", "125g/4½oz caster sugar", "125g/4½oz beaten free-range eggs", "125g/4½oz ground almonds", "25g/1oz plain flour, sifted", "115g/4oz Seville oranges ", "¼ unwaxed lemon", "200g/7oz jam sugar", "10g/⅓oz soft brown sugar", "200g/7oz caster sugar", "¼ unwaxed lemon, pared peel only", "seeds of ½ vanilla pod", "200ml/7fl oz orange-flavoured liqueur", "75ml/2½fl oz milk", "75ml/2½fl whipping cream", "30g/1oz beaten free-range egg yolks", "15g/½oz caster sugar", "150g/5½oz dark chocolate (66% coca solids), finely chopped", "15g/½oz leaf gelatine ", "300g/10½oz caster sugar ", "100g/3½oz cocoa powder, sifted ", "175ml/6fl oz whipping cream", "dried orange zest", "chocolate decoration", "gold leaf"], "serves": "Makes 12", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["To make the chocolate pâte sucrée, beat the butter in a mixing bowl until soft and smooth. Add the icing sugar and beat until smooth. Gradually incorporate the eggs and mix until fully emulsified. Mix in the flour, cocoa powder and salt until smooth. Turn the dough out onto a work surface, shape it into a block and wrap in cling film. Leave to rest in the fridge for 2–3 hours.", "Meanwhile, to make the almond cream, beat together the butter and sugar in a mixing bowl until smooth. Gradually beat in the eggs until combined. Fold in the ground almonds and flour and mix until smooth.", "To make the orange marmalade, use a peeler to remove the orange peel in long strips, then thinly slice it and place in a muslin bag. Seal. Roughly chop the oranges and lemon, put in a saucepan with the sugars, the muslin bag and 250ml/9fl oz of water. Simmer over a low heat, uncovered, for 2 hours, or until the fruit is tender. ", "Remove the muslin bag and set aside to drain. Line a colander with layers of muslin and set over a bowl. Strain the contents of the pan through the muslin and leave to drain for 30 minutes. Squeeze out the remaining liquid by twisting the cloth. Discard the pulp.", "Return the strained liquid and the peel from the muslin bag to a clean saucepan, bring to the boil and boil until it reaches 104°C, stirring continuously. To test the marmalade is setting, spoon a small amount onto a cold plate and leave to cool. If it sets, remove the pan from heat and spoon the marmalade into a sterilized jar. Leave to cool, then seal. ", "To make the orange syrup, put the sugar, lemon peel and vanilla in a saucepan with 225ml/8fl oz of water and bring to the boil. Cook for 2–3 minutes. Remove from the heat and allow to cool. Once cool, add the liqueur. ", "To make the chocolate mousse, put the milk and 75ml/2½fl oz of whipping cream in a saucepan and bring to the boil. Meanwhile, whisk together the egg yolks and sugar in a large mixing bowl for 2–3 minutes, or until light and pale. Pour half the boiled milk and cream into the egg mixture and mix well. Pour this back into the pan, mix and cook over a low heat, stirring continuously, until it is thick enough to coat the back of a spoon. ", "Put the chopped chocolate into a large bowl. Take the egg and cream mixture off the heat and pass through a fine sieve onto the chocolate. Use a spatula to mix until the chocolate has fully melted and the mixture has emulsified. Allow to cool. ", "Whisk the remaining 200ml/7fl oz of whipping cream in a large mixing bowl until soft peaks form. Carefully fold the whipped cream into the chocolate mixture and use immediately.", "To make the chocolate glaçage, soak the gelatine in a bowl of iced water for a few minutes, until soft. Squeeze to remove any excess water. Put the sugar in a saucepan with 225ml/8fl oz of water, bring to the boil and simmer on a low heat for 2–3 minutes. Add the cocoa powder and cream. Bring back to the boil and simmer for 4–5 minutes. Take the pan off the heat, add the soaked gelatine and stir until dissolved. Strain and allow to cool.", "To assemble, fill the mince pie tins with the chocolate mousse. Flatten the tops with a small stepped palette knife, cover and place in the freezer to set for at least 2 hours.", "Roll out the pastry to 3mm thickness and line the tartlet cases. Cover and rest in the fridge for 1 hour.", "Preheat the oven to 200C/180C Fan/Gas 6. Remove the tarts from the fridge and pipe 10g/⅓oz of marmalade into the base of each one. Pipe a bulb of almond cream on the top, cover and leave to rest in the fridge for 30 minutes.", "Bake the tarts for 15 minutes. Allow to cool, then remove them from their cases. If necessary, level off the tops using a serrated knife.", "Take the set mousses out of the mince pie moulds and place on a glazing rack. Glaze with the glaçage and place one on top of each tartlet. To serve, decorate with dried orange zest, a chocolate stick and gold leaf."]}, {"isVegetarian": true, "title": "Jaggery-caramelised walnuts", "url": "www_bbc_co_uk_food_recipes_jaggerycaramelisedwa_86678", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz jaggery (available in Asian stores and some supermarkets), chopped or pounded into smallish pieces", "50g/2oz walnut halves, shells removed"], "serves": "Serves 3-5", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the jaggery into a small pan and heat gently, stirring frequently, until melted and smooth.", "Add the walnut halves and stir to coat.", "Spread the walnut halves onto a sheet of baking paper or an oiled plate, working quickly before the jaggery starts to harden - if it does, return to the heat for a few seconds until melted again. Allow to cool completely, then break into pieces.", "When cold, store in an airtight container until needed. Serve as a snack or sprinkled over desserts and yoghurts."]}, {"isVegetarian": false, "title": "Jalapeño and anchovy ketchup", "url": "www_bbc_co_uk_food_recipes_jalapeo_and_anchovy_55819", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jalapeo_and_anchovy_55819_16x9.jpg", "ingredients": ["200g/7oz tomato purée", "7 anchovies, drained ", "5 tbsp olive oil ", "8 slices jalapeño pepper (from a jar), or to taste", "1 garlic clove, roughly chopped"], "serves": "Makes 1 jar", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the ingredients and 2-3 tbsp cold water together in a food processor until smooth. ", "Transfer to to a sterile, airtight jar. This ketchup will keep in the fridge for up to 2 weeks. "]}, {"isVegetarian": false, "title": "Jam doughnuts", "url": "www_bbc_co_uk_food_recipes_jam_doughnuts_90953", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jam_doughnuts_90953_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour", "50g/2oz caster sugar", "40g/1½oz unsalted butter", "2 free-range eggs", "2 x 7g sachets instant yeast", "10g/¼oz salt", "150ml/5fl oz warm milk", "130ml/4½fl oz water", "2 x jars strawberry jam"], "serves": "Makes 10", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, place all ingredients into a large bowl holding back a quarter of the water.", "Stir with your hands until a dough is formed.", "Slowly add the remaining water and knead the dough in the bowl for four minutes.  (Alternatively, you could mix with a stand mixer fitted with a dough hook).", "Tip dough onto a lightly floured surface and knead well for 10 minutes, until the dough is smooth and elastic.", "Place the dough into a clean bowl, cover with a damp tea towel and leave to rise for an hour.", "Tip the dough out onto a very lightly floured surface, and knock it back by kneading it a few times.", "Divide the dough into 10 equal portions and shape each portion into a ball.", "Place all balls onto a floured baking tray and allow to rise for an hour.", "Preheat a deep fat fryer, filled with sunflower oil, to 180C/350F.", "Lower each doughnut into the fryer, cooking each side for about five minutes or until golden brown. Remove the doughnuts from the oil with a slotted spoon and immediately roll in caster sugar so that the hot fat makes the sugar stick to the sides.", "Set aside and leave to cool.", "When completely cool, using a small, sharp, knife make a cut into the side of the doughnut, reaching to the centre.  ", "Spoon some smooth or sieved strawberry jam into a piping bag, or piping syringe. ", "Pipe, or syringe, the jam generously inside."]}, {"isVegetarian": false, "title": "Jam roly-poly", "url": "www_bbc_co_uk_food_recipes_jam_roly-poly_96342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.375/3lb 3oz self-raising flour ", "200g/7oz caster sugar", "550g/1lb 4oz shredded suet ", "about 700ml/1¼ pint water", "375g/13oz strawberry jam", "50ml/2fl oz whole milk"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas mark 6.", "Place the flour, sugar and suet into a bowl and mix thoroughly.", "Make a well in the centre of the mixture then gradually add enough water to make a soft dough. Knead lightly until smooth then divide into five portions of equal weight. ", "Turn each portion of dough onto a floured surface and roll out to an oblong about 1cm/½in thick. Spread about one fifth of the jam on the pastry leaving a 1cm/½in border.", "Roll up from the long side into a pinwheel, seal the ends well with a little water and place onto a greased baking sheet with the seal downwards. Brush with a little of the milk.", "Repeat with the remaining dough and jam, using another greased baking tray if necessary. Bake in the oven for 35-40 minutes, or until golden brown."]}, {"isVegetarian": false, "title": "Jam roly-poly", "url": "www_bbc_co_uk_food_recipes_jam_roly_poly_36901", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jam_roly_poly_36901_16x9.jpg", "ingredients": ["softened butter, for greasing", "200g/7oz self-raising flour, plus extra for dusting", "100g/3½oz shredded suet", "1 tbsp caster sugar", "good pinch salt", "150ml/5fl oz semi-skimmed milk or water", "6–7 tbsp raspberry or strawberry jam"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Butter a large sheet of greaseproof paper and set aside. ", "Stir the flour, suet, sugar and salt in a large bowl until well combined. Slowly stir in the milk or water to form a soft, spongy dough.", "Tip the dough out onto a floured surface and knead for a few minutes. Roll the dough out to a 22cm x 32cm/8½in x 13in rectangle. ", "Spread the jam onto the dough, leaving a 1.5cm/½in border. Gently roll the dough up from the short end and transfer to the greaseproof paper, seam-side down. Wrap the roly poly in the greaseproof paper, making a long pleat in the parchment to allow the pudding to expand as it cooks. Twist the ends of the parchment like a Christmas cracker and tie tightly with kitchen string, to seal the pudding inside.", "Repeat the process with a large piece of aluminium foil. ", "Place the pudding onto a roasting rack set on a roasting tin. Pour boiling water into the roasting tin until the half full. ", "Bake in the oven for 30-35 minutes.", "Remove the pudding from the oven, unwrap the aluminium foil, then snip the string and unwrap the paper.", "The pudding should be well risen and lightly browned in places. Don’t worry if the jam has made its way through to the outside of the pudding a little – it will taste all the more delicious. ", "Put on a board or serving plate and cut into thick slices. Serve with lots of hot custard or cream."]}, {"isVegetarian": true, "title": "Jam roly poly", "url": "www_bbc_co_uk_food_recipes_jam_roly_poly_48764", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jam_roly_poly_48764_16x9.jpg", "ingredients": ["150g/5½oz self-raising flour, sifted", "75g/3oz vegetable suet", "100ml/3½fl oz cold water", "pinch salt", "5 tbsp plum jam (or raspberry, damson)"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Mix the sifted flour, suet, and salt together in a large bowl. Add enough water to make a soft dough, but not sticky.", "Knead lightly on a lightly floured board for a few minutes before rolling out to a 1cm/½in thickness and a rough 20cm/8in square shape.", "Spread a thick layer of jam over one side of the dough, leaving 1cm/½in border, which you dampen with a little water.", "Roll up loosely, pinching the ends together as you go to stop the jam escaping.  Place the roll on a large lightly buttered piece of silicon baking parchment, sealed edge down.", "Join the ends of the paper and make a pleated join along the top to allow for the pudding to expand, then twist the ends like a sweet wrapper.", "Put the pudding into a large loaf tin or a brownie tin. Fill a roasting tin with boiling water and place on the base of the oven. Then put your roly poly on the top rack for 35-40 minutes.", "Serve a single thick slice, with homemade custard."]}, {"isVegetarian": true, "title": "Jam sponge pudding", "url": "www_bbc_co_uk_food_recipes_jam_sponge_pudding_30794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz strawberry or raspberry jam", "350g/12oz butter, softened, plus extra for greasing", "100g/3½oz golden syrup", "125g/4½oz caster sugar", "6 free-range eggs, lightly beaten", "350g/12oz self-raising flour", "85g/3oz strawberry or raspberry jam"], "serves": "Serves 16", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Generously butter the inside of two 1.2 litre/2 pint pudding basins.", "Spoon the jam into the base of the pudding basin and set aside.", "Beat the butter, golden syrup and sugar together in a mixer until light and fluffy.", "Beat in half the eggs followed by half the flour and when well combined, add the remaining eggs and flour. The mixture should be at a dropping consistency. Add a splash of milk if the mixture is too thick.", "Spoon the mixture into the pudding basins, only filling them three quarters full, then smooth the surface with the back of a spoon.", "Loosely cover with cling film, allowing room for the cling film to inflate as the mixture rises, and cook in the microwave for five minutes.The pudding is done when a skewer inserted into the centre of the pudding comes out clean. ", "Leave to stand for five minutes then run a blunt knife around the edge of the pudding to loosen the sides, carefully invert onto a deep plate and remove the basin.", "To serve, spoon the extra jam over the pudding, cut into generous wedges and serve with custard."]}, {"isVegetarian": false, "title": "Jamaican jerk chicken", "url": "www_bbc_co_uk_food_recipes_jamaican_jerk_chicken_06470", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamaican_jerk_chicken_06470_16x9.jpg", "ingredients": ["1 tbsp English mustard ", "1 tbsp red wine vinegar ", "2 limes, zest and juice", "3 tbsp brown sugar", "2 - 3 Habenero (scotch bonnet) chillies, deseeded ", "5 garlic cloves, peeled", "5 spring onions", "few sprigs fresh thyme", "1 tbsp jerk seasoning", "100ml/3½fl oz lager", "½  tsp sea salt", "1 large chicken (about 1.8kg/4lb), spatchcocked", "groundnut oil, for rubbing"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, place all the ingredients in a food processor and blitz together until smooth. Coat the chicken, cover and leave to marinate in the fridge for at least two hours, but preferably overnight.", "Preheat the oven to 200C/180C Fan/Gas 6. Wipe off the excess marinade and rub with oil. Griddle or barbecue the chicken, breast side down, until the skin starts to char and goes golden brown. Be very careful not to let it burn as it will very easily. ", "Place the chicken onto a baking tray and roast for 35 minutes,  in the oven or until the juices run clear when the thickest part of the leg, between the drumstick and the thigh, is pierced with a skewer and the chicken is cooked. ", "Remove from the oven and leave to rest for 10 minutes, then carve the chicken into 10 pieces. "]}, {"isVegetarian": false, "title": "Jam roly poly with proper custard", "url": "www_bbc_co_uk_food_recipes_jam_roly_poly_with_80748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz strawberries, hulled and quartered", "150g/5½oz caster sugar", "½ lemon, zest and juice ", "275g/9¾oz self-raising flour, plus extra for dusting ", "40g/1½oz caster sugar", "110g/4oz shredded suet ", "1 lemon, zest only", "4 free-range egg yolks", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150ml/5fl oz double cream", "1 vanilla pod, seeds removed"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. For the jam, heat a small frying pan until hot, then add the strawberries and cook for one minute. Add the sugar and lemon zest and juice and cook for 3-4 minutes, until the sugar has dissolved and the mixture has thickened slightly.", "Transfer half the mixture to a blender, blend to a purée, then return it to the pan with the remaining cooked strawberries, mix well and cook for a further 3-5 minutes, until thick. Remove from the heat and leave to cool.", "For the roly poly, put the flour, sugar, suet and lemon zest in a bowl and mix well. Make a well in the centre, then gradually mix in enough water to make a soft dough. Knead lightly until smooth. ", "Turn onto a floured surface and roll out to an oblong about 1cm/½in thick. Spread the jam onto the pastry leaving a 2.5cm/1in border. Roll up from the long side into a pinwheel. Place the roly-poly in a loaf tin and cover with kitchen foil, sealing tightly.", "Put a plate upside-down in the base of a large saucepan, place the loaf tin on top and fill the pan two-thirds full of water (do not allow the water to reach the top of the tin). Bring to the boil. Cover, reduce the heat and simmer for one hour. Remove the pudding from the tin and place on a baking tray. Bake for 15-30 minutes, or until browned.", "For the custard, put the egg yolks and sugar in a bowl and whisk until well blended. Put the milk, cream and vanilla pod in a saucepan and bring to the boil. Immediately reduce the heat and simmer for one minute. Pour the milk onto the egg mixture and whisk in. Return the mixture to the saucepan and heat slowly, until the custard has thickened enough to coat the back of the spoon. Remove and discard the vanilla pod. Serve the roly poly with the custard. "]}, {"isVegetarian": false, "title": "Jamaican beef patties with ginger, tomato and orange salad", "url": "www_bbc_co_uk_food_recipes_jamaican_beef_patties_28917", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "1½ tbsp Madras curry powder", "1½ tbsp ground turmeric", "pinch salt", "165g/5¾oz unsalted butter, chilled and diced", "1 large free-range egg, beaten", "2 tbsp rapeseed oil", "1 onion, finely diced", "4 large garlic cloves, crushed", "2 tsp Madras curry powder", "2½ tbsp snipped chives", "1½ tbsp chopped thyme leaves", "300g/10½oz lean minced beef", "125ml/4fl oz beef stock", "1 tsp molasses sugar", "1 tsp Scotch bonnet hot sauce or 1cm/½in piece Scotch bonnet chilli, finely chopped", "1 slice white or wholemeal bread, torn into tiny pieces", "salt and freshly ground black pepper", "2 tbsp rapeseed oil", "1 tbsp freshly squeezed orange juice", "2 tbsp lime juice", "1½ tsp honey", "1½ tsp caster sugar", "1½ tsp grated ginger", "salt and freshly ground black pepper", "8 heritage tomatoes, sliced ", "4 small oranges, peeled and sliced", "¼ red onion, finely sliced", "salt and freshly ground black pepper", "edible flowers", "micro coriander", "red amaranth"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/200 Fan/Gas 7. ", "For the pastry, sift together the flour, curry powder, turmeric and salt into the bowl of a food processor. Add the butter and pulse until the mixture looks like coarse sand. With the motor running, gradually add 4–6 tablespoons of ice cold water until the dough starts to come together. Add just enough water to bind the dough.", "Roll the dough into a ball and wrap in cling film. Leave to rest in the fridge for 30 minutes.  (You can also prepare the pastry for this recipe in advance, just bring it back to room temperature before rolling out).", "For the filling, heat the oil in a large saucepan, add the onion and a pinch of salt and cook for about 5–10 minutes until softened. Add the garlic, curry powder, chives and thyme (and if you are using fresh Scotch bonnet, add this now too). Leave to cook for another minute, until the aromas are released. Add the minced beef, breaking it up with a wooden spoon and allow it to brown all over for about 5 minutes.", "Add the stock, sugar and scotch bonnet hot sauce, bring to the boil and reduce the heat. Cover the pan with a lid and let the mixture simmer for about 10 minutes. Add the bread, return the lid to the pan and let the mixture continue to simmer for a further 10 minutes.  Remove the pan from the heat, season with salt and pepper and leave to cool.", "Remove the pastry from the fridge and roll out with a flour-dusted rolling pin onto a large sheet of greaseproof paper to a thickness of about 3mm. Cut out six circles from the pastry, using a side plate as a guide for the sizing. ", "Divide the filling between the six circles, spooning the mixture on to one half of each pastry circle and leaving space around the edge to allow for sealing the pastry. Wet the edges of the pastry and fold the non-filled half of the pastry over the filled half and use a fork to press down all around the edges. Leave to cool to room temperature. ", "Place the patties on a baking tray, brush with the egg and bake for 20 minutes, or until the pastry is golden and cooked through. ", "For the ginger-citrus dressing, whisk together all the ingredients, ensuring they are well combined.  Season with salt and pepper.", "For the salad, arrange the tomato, orange and red onion on serving plates and pour over the dressing.  Sprinkle over a pinch of sea salt and pepper.  Leave to sit for 20 minutes at room temperature, to allow the flavours to develop.  ", "Place the patties on the serving plates with the salad. Garnish with the flowers, coriander and red amaranth and serve immediately. "]}, {"isVegetarian": false, "title": "Jamaican curried snapper with coconut and lime served with clap-hand roti", "url": "www_bbc_co_uk_food_recipes_jamaicancurriedsnapp_79925", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp coriander seeds", "1 tsp cumin seeds", "1 tsp black mustard seeds", "1 tsp black peppercorns ", "½tsp cayenne pepper", "½tsp ground turmeric ", "3 tbsp sunflower oil", "40g/1½oz butter ", "1 large onion, finely chopped", "2 garlic cloves, crushed ", "5cm/2in piece fresh root ginger, peeled and finely grated", "1 tsp light brown soft sugar", "1 x 200g/7oz can chopped tomatoes ", "1 lime, juice only", "1 x 400ml/14fl oz can of coconut milk", "2 bay leaves", "4 x 225g/8oz pieces red snapper fillet", "salt and freshly ground black pepper ", "350g/12 oz basmati rice", "2 tbsp sunflower oil", "4 cloves", "4 green cardamom pods, cracked", "5cm/2in piece cinnamon stick", "bay leaf", "600ml/1 pint boiling water", "½ tsp salt", "225g/8oz plain flour ", "1 tsp baking powder", "1 tsp salt ", "40g/1½oz chilled butter", "vegetable oil or ghee for cooking"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the curried snapper, grind the whole spices into a powder using a pestle and mortar or mini food blender and mix with the cayenne pepper and turmeric.", "Heat the oil and butter in large shallow pan. Add the onion and fry gently until soft and just beginning to brown.", "Add the garlic, ginger, sugar and spice mix and cook for another 2-3 minutes.", "Add the tomatoes, lime juice, coconut milk, bay leaves and some salt and freshly ground black pepper and simmer gently for 10 minutes, stirring now and then, until slightly thickened.", "Add the snapper fillets, skin-side down, and spoon some of the sauce over them. Simmer uncovered for 10 minutes, carefully turning the fish over halfway through. Remove the bay leaves before serving.", "For the pilau, wash the rice in several changes of cold water until the water runs relatively clear. Cover with more cold water and leave to soak for seven minutes, then drain well.", "Heat the sunflower oil in a 20cm(8in) heavy-bottomed pan, add the cloves, cardamom pods, cinnamon stick and bay leaf and cook gently over a low heat for 2-3 minutes until they start to smell aromatic.", "Stir in the rice, add the boiling water and salt and quickly bring to the boil. Stir once, cover with a tight fitting lid and cook over a low heat for 12 minutes. ", "Uncover and fluff up the grains with a fork.", "For the roti, sift the flour, baking powder and salt into the bowl of a food processor. Add the butter and blend until the mixture looks like fine breadcrumbs.", "Transfer to a bowl and stir in five tablespoons of cold water to make a stiff, but soft, dough. Cover and leave in a warm place for 30 minutes.", "When ready, knead the dough on a lightly floured surface until smooth, then form into four balls. Flatten slightly and roll out into 23cm (9 inch) rounds about 5mm (0.2in) thick.", "Brush with the oil or ghee, fold in half, then in quarters, roll back into balls, and then roll out again.", "Heat a dry, heavy-based frying pan or flat griddle over a medium heat. ", "Brush each roti in turn with a little more oil or ghee, add a roti to the pan and cook for 3-4 minutes, turning frequently and brushing with oil each time you do.", "Remove from the pan, place in your palm and clap your hands together 3-4 times, taking care not to burn yourself (you may need to wear oven gloves for this).", "Wrap the roti in a tea towel and keep warm while you cook the rest.", "Serve the curried snapper with the pilau and roti."]}, {"isVegetarian": true, "title": "Jamaican rum truffles", "url": "www_bbc_co_uk_food_recipes_jamaican_rum_truffles_09151", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamaican_rum_truffles_09151_16x9.jpg", "ingredients": ["250ml/9fl oz whipping cream", "100g/3½oz milk chocolate, finely chopped", "200g/7oz dark chocolate, finely chopped ", "25g/1oz unsalted butter, diced", "2-3 tbsp dark rum", "5 tbsp cocoa powder, for dusting"], "serves": "Makes 40 truffles", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the cream in a small pan, removing it from the heat just before it comes to the boil. ", "Meanwhile, put the milk chocolate and dark chocolate in a large bowl and, once the cream comes off the heat, pour it over the chocolate. Stir well until melted and smooth. ", "Add the butter and enough rum to taste and mix well. Leave to cool and then cover the chocolate mixture with cling film and transfer to the fridge for at least four hours, or overnight – the chocolate will be set firm.", "Line a large tray with parchment paper. Sift half of the cocoa powder onto each of two large plates. One will be to dust your hands and the other to coat the truffles.", "Use a teaspoon or melon baller to scoop up walnut-sized pieces (about 15g/½oz) of the chocolate mixture. Press the palms of your hands into one of the cocoa powder plates to lightly coat and roll the truffle pieces quickly into a ball. Don’t roll the chocolate in your hands for too long or it will begin to melt. ", "Roll the truffle around in the cocoa powder on the other plate to lightly coat and place on the tray. Repeat until all of the mixture is used up to give about 40 truffles in total, pressing your hands into more cocoa powder when necessary to avoid sticking. It is best to wash your hands a few times throughout the process, but be sure to rinse them in cold water before drying so that they are nice and cold to avoid melting the truffles.", "Cover and chill in the fridge for at least 30 minutes before serving. "]}, {"isVegetarian": false, "title": "James Martin’s ultimate macaroni cheese", "url": "www_bbc_co_uk_food_recipes_james_martins_ultimate_60657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz dried macaroni", "40g/1¾oz butter", "40g/1¾oz plain flour", "500ml/18fl oz milk", "100g/3½oz blue cheese, preferably mild gorgonzola, grated or finely diced", "150g/5½oz cheddar, grated", "100g/3½oz Caerphilly, grated ", "½ tsp freshly grated nutmeg, or to taste", "90g/3oz pancetta, chopped", "100g/3½oz mozzarella, chopped", "75g/3oz fresh breadcrumbs", "25g/1oz freshly grated Parmesan", "large handful fresh basil leaves, roughly chopped, to serve", "1 tbsp wholegrain mustard", "1 tbsp white wine vinegar", "3 tbsp olive oil", "1 head Romaine lettuce, cut into chunks", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the macaroni cheese, preheat the grill to its highest setting.", "Cook the macaroni in a large saucepan of salted, boiling water according to the packet instructions.", "Meanwhile, in a separate saucepan, heat the butter until melted, then whisk in the flour until smooth and cook for 1-2 minutes, or until pale golden-brown. ", "Whisk in the milk a little at a time, waiting until the mixture has thickened after each addition before adding any more and whisking continually. After all of the milk has been added to the mixture, you should have a smooth sauce with the consistency of double cream.", "Add all of the blue cheese, 100g/3½oz of the cheddar and all of the Caerphilly to the sauce and heat gently, stirring all the time, until it has melted. Season, to taste, with salt, freshly ground black pepper and nutmeg.", "Drain the cooked pasta and tip it into the pan containing the cheese sauce. Stir well to coat the pasta. Set aside.", "Dry-fry the chopped pancetta in a frying pan over a high heat until golden-brown and crisp. Stir it into the macaroni cheese mixture.", "Transfer the macaroni cheese to a large ovenproof dish and top with the chopped mozzarella, breadcrumbs, and Parmesan. Grill for 2-3 minutes, or until the topping is golden-brown and bubbling.", "Meanwhile, for the salad, in a bowl, whisk together the mustard, vinegar and olive oil, then season, to taste, with salt and freshly ground black pepper. Add the lettuce and mix to coat it in the dressing. ", "Serve the macaroni cheese with the salad alongside, sprinkled with the chopped basil."]}, {"isVegetarian": true, "title": "James' sticky toffee pudding", "url": "www_bbc_co_uk_food_recipes_jamesstickytoffeepud_67654", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamesstickytoffeepud_67654_16x9.jpg", "ingredients": ["55g/2oz butter, plus extra for greasing", "170g/6oz demerara sugar", "1 tbsp  golden syrup", "2 free-range eggs", "2 tbsp black treacle", "200g/7oz self-raising flour, plus extra for flouring", "200g/7oz pitted dates", "290ml/10fl oz boiling water", "1 tsp  bicarbonate of soda", "½ tsp vanilla extract", "110ml/4fl oz double cream", "55g/2oz butter, diced", "55g/2oz dark muscovado sugar", "2 tbsp black treacle", "1 tbsp  golden syrup", "vanilla ice cream, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease and flour 6 individual pudding moulds.", "Cream the butter and sugar together in a food processor until pale and fluffy. Add the golden syrup, treacle and eggs, a little at a time, and blend until smooth.  Add the flour and blend, at a low speed, until well combined. Transfer to a bowl.", "Meanwhile, blend the dates and boiling water in a food processor to a smooth purée. Stir in the bicarbonate of soda and vanilla. ", "Pour the date mixture into the pudding batter and stir until well combined.", "Pour the mixture into the moulds and bake for 20-25 minutes, or until the top is springy and golden-brown.", "To make the sauce, heat all of the ingredients in a pan, stirring occasionally, until boiling. ", "To serve, remove the puddings from the moulds and place onto each of 6 serving plates. Pour over the sauce and serve with a scoop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Gingerbread garage", "url": "www_bbc_co_uk_food_recipes_jamess_gingerbread_92562", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jamess_gingerbread_92562_16x9.jpg", "ingredients": ["800g/1lb 12oz soft light brown sugar", "800g/1lb 12oz butter, softened", "4 tbsp treacle", "400g/14oz golden syrup", "4 tbsp ground ginger", "8 tsp ground mixed spice", "2 tsp ground cloves", "1 tsp bicarbonate of soda", "2kg/4lb 8oz plain flour, plus extra for dusting", "4-6 tbsp cold water", "2kg/4lb 8oz icing sugar", "9 free-range egg whites", "3 toy cars", "selection of brightly coloured chocolate and jelly sweets", "selection of milk and white chocolate buttons", "800g/1lb 12oz soft light brown sugar", "800g/1lb 12oz butter, softened", "4 tbsp treacle", "400g/14oz golden syrup", "4 tbsp ground ginger", "8 tsp ground mixed spice", "2 tsp ground cloves", "1 tsp bicarbonate of soda", "2kg/4lb 8oz plain flour, plus extra for dusting", "4-6 tbsp cold water", "2kg/4lb 8oz icing sugar", "9 free-range egg whites", "3 toy cars", "selection of brightly coloured chocolate and jelly sweets", "selection of milk and white chocolate buttons"], "serves": "Makes 1 large gingerbread garage", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the gingerbread, beat the sugar and butter together using a free-standing food mixer until pale, fluffy and well combined. ", "Add the treacle, golden syrup, ground ginger, mixed spice, ground cloves, bicarb of soda and flour. Beat slowly at first, then quickly until it comes together as a stiff dough. Add a little of the water and continue beating to bring the dough together. ", "Turn out the dough onto a lightly floured work surface and knead gently for a couple of minutes until soft and smooth. Set aside in a bowl, covered, to rest.", "Meanwhile, cut templates for the garage from pieces of card: one for the gables that is 20cm/8in(width)x14cm/5½in(height) with a 25cm/10in high triangle on top; one for the back that is 30cm/12in(width)x14½cm/6in(height) and one for the front that is 30cm/12in(width) x 14½cm/6in(height) with 3 equal-sized arches cut into it to resemble doors.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Divide the dough into 3 manageable-sized pieces. Roll each piece out onto a piece of silicone baking paper to a thickness of 3mm. Using the templates, cut out 4 gable shapes, 2 roof shapes, 1 back shape and 1 front shape. Transfer each shape, on its silicone paper, to a baking sheet. Bake, in batches if necessary, for 15-18 minutes, or until just starting to colour at the edges. Remove and set aside to cool slightly before trimming the edges so that they are straight. Set aside on a wire rack to cool completely.", "For the icing, place the icing sugar into the bowl of a food mixer; cover if possible. Whisk in the egg whites and beat until very smooth and thick enough to hold its own shape. This process should take 7-10 minutes. Spoon some of the mixture into a piping bag and set aside. Reserve the remaining icing.", "To assemble the garage, lay all of the shapes out next to each other. Stick the pieces together one by one by piping a line of icing along the edges of the sides you are ready to stick, then standing them on a stiff piece of board (or a presentation board) and pressing them together, holding in place until set (or use small tins of food to hold the pieces upright while they set). You need to ice the pieces as you need them, not all at once.", "Start by sticking one gable to each side of the back of the garage, with two at intervals along the back wall of the garage (avoiding the spaces where the doors will go). Stick the front of the garage onto the other side of the gables. ", "Ice all 4 edges of one piece of the roof and press gently on top of the gables to cover the back half of the garage. Repeat with the remaining roof shape, pressing it onto the front of the garage. ", "Leave the garage to set for 30 minutes, then decorate with the remaining icing and the coloured sweets. Park the toy cars in the garage."]}, {"isVegetarian": true, "title": "Jam fritters", "url": "www_bbc_co_uk_food_recipes_jamfritters_89143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz flour", "1 large free-range egg", "100ml/3½fl oz whole milk", "40ml/1½fl oz water", "8 slices bread, buttered", "3 tbsp raspberry jam, or to taste", "25g/1oz icing sugar ", "80g/3oz butter"], "serves": "2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Break the egg into the flour in a bowl and stir in the milk and water until a smooth batter is formed. Leave to stand for one hour.", "Spread the buttered slices of bread with raspberry jam, then sandwich two slices together, pressing down well. Repeat with the remaining slices of bread, then cut out squares or circles from the sandwiches using a pastry cutter.", "Melt the butter in a frying pan over a medium heat.", "Dip the sandwich shapes into the batter, then add to the pan to fry for 2-3 minutes each side, or until golden-brown all over. (You may have to do this in batches.)", "To serve, place onto a large serving plate and sprinkle with icing sugar."]}, {"isVegetarian": true, "title": "Jammy biscuits", "url": "www_bbc_co_uk_food_recipes_jammybiscuits_92180", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/3½oz butter, at room temperature, cut into cubes, plus extra for greasing", "75g/2¾oz sugar", "1 vanilla pod, split, seeds scraped out with the tip of a knife", "225g/8oz flour, plus extra for dusting", "100g/3½oz clotted cream", "100g/3½oz ready-made strawberry or red cherry jam"], "serves": "Makes 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "In a bowl, rub together the butter, sugar, vanilla seeds and flour, using your fingertips. ", "Bring the mixture together to form a dough, turn out onto a lightly floured work surface and knead until the dough is smooth. Roll into a ball, then wrap the dough in cling film and chill in the fridge for at least 15 minutes. ", "When the dough has chilled, roll it out onto a lightly floured work surface until it is about 6mm thick. ", "Cut 7.5cm/3in discs from the dough using a cookie cutter or upturned mug. ", "Divide the pastry discs into two portions. Cut a small 1.5cm/1¾in heart shape from each disc in the first portion using a shaped cookie cutter or sharp knife. Leave the remaining pastry discs whole.", "Lightly grease a baking tray and place all of the discs onto it. Bake in the oven for 12-15 minutes, or until crisp and pale golden-brown. Remove from the oven and place onto a wire rack. Set aside to cool.", "When the biscuits have cooled, place one teaspoonful of clotted cream onto each of the whole biscuits. Spoon a small dollop of jam on top of the cream. Place the biscuits with the heart-shaped holes on top and gently squeeze together."]}, {"isVegetarian": true, "title": "Jam roly-poly", "url": "www_bbc_co_uk_food_recipes_jamrolypoly_88984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/8oz self-raising flour", "pinch salt", "50g/2oz light brown sugar", "125g/4oz shredded suet (vegetarians may substitute vegetarian suet)", "6-8 tbsp water", "5 tbsp raspberry jam, warmed", "milk, for brushing", "1 free-range egg, beaten ", "demerara sugar, to glaze", "custard, to serve"], "serves": "6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour into a bowl with the salt and add the light brown sugar. Add the suet and just enough water to create a soft, but not sticky, dough.", "Place the dough onto a floured work surface and roll out into a rectangle about 20cm/8in x 30cm/12in.", "Brush one side of the pastry with the warmed raspberry jam, leaving a 1cm/½in border all around the edge. Fold the jamless border in and brush with milk.", "With the short side of the pastry sheet towards you, roll up the pastry loosely and seal the ends well.", "Place the pastry roll onto a greased baking sheet with the sealed edge underneath.", "Brush the pastry roll all over with beaten egg and sprinkle with demerara sugar.", "Place into the oven to bake for 35-40 minutes, or until golden-brown and cooked through.", "Remove from the oven and sprinkle on a little more demerara sugar.", "To serve, place generous slices of the roly-poly into bowls and serve hot with custard."]}, {"isVegetarian": false, "title": "Jam shortbreads", "url": "www_bbc_co_uk_food_recipes_jamshortbreads_73974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz icing sugar", "170g/6oz plain flour", "55g/2oz cornflour", "30g/1oz ground almonds", "225g/8oz butter, and extra for greasing", "almond essence", "icing sugar for dusting", "raspberry or strawberry jam"], "serves": "Makes 20", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4. ", "Sift the icing sugar, flour and cornflour together into a bowl. Add the ground almonds. ", "Cut the butter into cubes and add it to the dry ingredients. Using your fingers, a mixer or food processor, rub or mix the butter in until there are no visible lumps of butter. Add the almond essence. ", "Turn the mixture out onto a lightly floured surface and knead a few times, just to form a smooth dough.", "Butter a muffin tin. Roll the dough into small balls and place them in the muffin cups, flattening the tops slightly with  your fingers. The dough should come about one-third of the way up the side of the pan. 6. Bake the shortbreads until they are a light gold colour, about 8-12 minutes. Remove them from the oven and,  using your selected tool, make a small indentation in the top of each biscuit.  ", "Let the shortbreads cool for a few minutes, then turn the mould over and tap it over the bench so that the shortbreads fall out. Be gentle, as they are fragile while  they are still warm.", "When all the shortbreads are baked and cooled, dust the tops with some icing sugar. Using a teaspoon, fill the indentation with jam or your chosen filling."]}, {"isVegetarian": false, "title": "Jansson's frestelse (Jansson’s temptation)", "url": "www_bbc_co_uk_food_recipes_janssons_frestelse_24036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/janssons_frestelse_24036_16x9.jpg", "ingredients": ["9-10 medium-sized potatoes ", "2 tbsp butter ", "1 onion, finely sliced ", "about 20 tinned sprat fillets  ", "salt and pepper ", "150ml/5fl oz single cream ", "150ml/5fl oz whole milk ", "1 tbsp dried breadcrumbs"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to around 200C/400F/Gas 6. ", "Peel the potatoes and chop them into small 0.5cm/¼in piece sticks - a bit thinner than French fries. ", "Melt the butter in a saucepan, add the onion and cook until soft. Take care not to burn the onion - it should be cooked, but not turning brown. ", "Add the potatoes and cook for a few minutes. ", "Layer half of the onion and potato mixture in the bottom of an ovenproof dish, then top with 10 sprat fillets evenly across. Season with salt and pepper. ", "Add another layer of onion and potato, then another 10 sprats on top. Pour the remaining sprat juice over the dish. ", "Pour two-thirds of the milk and cream over the dish, then sprinkle the breadcrumbs on top. Season again. ", "Bake for about 45 minutes, or until the potatoes are cooked. Halfway through the cooking time, add the rest of the milk and cream. If the dish is looking dry, you can add more milk - the aim is to get a creamy consistency. ", "Serve as part of a traditional Swedish smörgåsbord. "]}, {"isVegetarian": false, "title": "Jansson’s parsnip temptation", "url": "www_bbc_co_uk_food_recipes_janssons_parsnip_52868", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 30g tin anchovies in oil", "50g/1¾oz roasted garlic (see tip)", "2 medium parsnips, thinly sliced on mandoline ", "2 medium potatoes, thinly sliced on mandoline", "1 medium white onion, thinly sliced on mandoline", "500ml/18fl oz double cream "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2.", "Tip the anchovies and garlic onto a board. Using the back of a knife, crush the two together to form a rough paste.  ", "In an ovenproof baking dish layer the vegetables – parsnips, potatoes, white onion and then a little of the anchovy and garlic paste. Repeat the layers until done. Pour over the cream.", "Bake for 45 minutes, or until the vegetables are tender and the top is golden-brown."]}, {"isVegetarian": false, "title": "January King cabbage with mussels and cockles", "url": "www_bbc_co_uk_food_recipes_january_king_cabbage_07669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz soft herbs, such as chervil, basil and parsley", "200g/7oz mussels", "200g/7oz cockles", "1 tsp olive oil", "1 garlic clove, chopped\t\t", "100ml/3½fl oz white wine", "1 tbsp chopped fresh parsley", "30g/1oz unsalted butter, softened", "small handful watercress, blanched, refreshed and chopped", "small pinch curry powder", "2g finely chopped fresh fennel", "squeeze lemon juice", "pinch sea salt", "50g/1¾oz crème fraîche  ", "1 lime, juice only", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh chervil", "½ January King cabbage ", "50g/1¾oz chicken fat", "squeeze lemon juice"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 80C/80C Fan/Gas ¼. Lay the herbs in a single layer on a baking sheet and cook for 1 hour or until dry. Once dried, blend to a fine powder, and place in a flour duster.", "To cook the shellfish, wash the mussels and remove any beards. Wash the cockles. Discard any open shellfish that do not close when given a sharp tap.", "In a hot pan add the olive oil and cook the garlic for 1 minute. Add the rest of the ingredients and the cockles and mussels. Cover with a lid.", "Cook for 2 minutes, or until the cockles and mussels have opened. Discard any that do not open.", "Pour through a colander lined with a muslin cloth into a clean pan. Keep the liquid to make the sauce. Pick out the shellfish. Chop 10g of the largest mussels for the mussel butter. Set aside the remaining shellfish.", "For the mussel butter, mix all the ingredients in a bowl with the 10g of chopped mussels.", "For the mussel sauce, in a saucepan, heat the shellfish cooking liquid until reduced to 50ml. Add the crème fraîche and lime juice. Add almost all the mussel butter, keeping back a tablespoon for the cabbage. Blend the sauce with a stick blender. Stir in the chives and chervil.", "For the cabbage, preheat the oven to 200C/180C Fan/Gas 6. Cut the cabbage into 8 wedges. Heat the chicken fat in an ovenproof, non-stick frying pan until hot. Fry the cabbage until coloured. Roast in the oven for 5–7 minutes.", "Remove from the oven and baste with a spoonful of mussel butter, until golden. Season with lemon juice and salt.", "To serve, place the cabbage in the middle of the plate. Reheat the shellfish in a little sauce, and spoon them over the cabbage. Pour over the remaining sauce and dust with the green powder."]}, {"isVegetarian": false, "title": "Japanese fried duck karaage on sushi rice", "url": "www_bbc_co_uk_food_recipes_japanese_fried_duck_04635", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x free-range duck legs, skin on, bone in", "1 tbsp fresh root ginger, grated", "2 garlic cloves, finely chopped", "4–6tbsp low sodium light soy sauce", "4–6tbsp Japanese Sake", "2tbsp caster sugar", "300g/10½oz sushi rice", "1 tbsp rice wine vinegar", "1 tbsp mirin", "1 tsp caster sugar", "100g/3½oz potato flour", "50g/1¾oz cornflour", "50g/1¾oz plain flour", "vegetable oil, for frying", "shiso leaves", "lime wedges", "black sesame seeds", "shichimi pepper flakes (togarashi shichimi)", "micro shisho leaves", "micro red amaranth"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 ", "To make the marinade, mix together the ginger, garlic, soy sauce and sake in a bowl.", "Score both sides of the duck in a criss-cross pattern, being careful not to cut through the meat. Add the duck to the marinade, cover and marinate in the fridge for at least 30 minutes.", "Drain any excess liquid from the duck, reserving the marinade.", "Heat at least 1cm/½ in of vegetable oil in a wok placed over a high heat. Fry the duck skin-side down for 5 minutes or until the skin is crisp.", "Place the duck flesh-side down into a roasting tin and finish in the oven for 30–35 minutes, or until well done, increasing the heat up to 220C/200C Fan/Gas 7 for the last 10 minutes. Allow to rest for 5 minutes.", "Wash the sushi rice well until the water runs clear. Fill a saucepan with 500ml/18fl oz water and bring to the boil. Place a bamboo steamer over the pan and add the rice. Put the on, turn the heat down to low and allow the rice steam cook for 15 minutes.", "Mix together the mirin, rice wine vinegar and sugar. Fluff up the rice with a fork, pour the dressing over and stir well. ", "Just before serving, coat the duck in the flour mix and shake off any excess. Coat in the flour once again.", "Preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep-fry the duck for 2 minutes or until golden brown.Drain the duck on a plate lined with a kitchen paper.", "To serve, line the plate with shiso leaves. Add a mound of steamed sushi rice. Place the duck legs on top and garnish with the black sesame seeds, shichimi pepper flakes and micro coriander leaves and lime wedges on the side. "]}, {"isVegetarian": false, "title": "Japanese marinated tuna with a ginger-spiced salad and ponzu dressing", "url": "www_bbc_co_uk_food_recipes_japanese_marinated_tuna_62473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 175g/6oz tuna steaks", "1 tbsp grated ginger", "2 tbsp dark soy sauce", "2 tbsp fish sauce", "2 tbsp mirin", "1 tbsp ground black pepper", "1 garlic clove, sliced", "1 lime, juice only", "vegetable oil, for frying", "50g/1¾oz bean sprouts", "1 carrot, julienned", "10 mangetout, thinly sliced", "50g/1¾oz mooli, thinly sliced", "2 tsp pickled ginger, finely chopped", "2 heads pak choi, halved", "1 tbsp sugar syrup (50/50 water and sugar dissolved)", "2 tsp dashi", "1 tbsp rice wine vinegar", "1 tbsp fish sauce", "½ lemon, juice only", "50ml/2fl oz dark soy sauce"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Put the tuna steaks in a sealable bag, add all the marinade ingredients, except for the oil, and gently massage them into the tuna. Seal the bag, making sure there is no air trapped inside and place in the fridge to marinate for 6–8 hours. ", "To make the salad, bring a large pan of salted water to the boil and blanch the beansprouts for 2 minutes then refresh in cold water, drain and set aside. ", "Mix the remaining salad ingredients together in a bowl, add the beansprouts and set aside. ", "To make the dressing, mix the sugar syrup, dashi, rice wine vinegar, fish sauce, a tablespoon of lemon juice and the soy sauce together in a bowl. ", "Remove the tuna from the fridge at least 30 minutes before cooking. ", "Heat a griddle pan over a high heat and rub with a little vegetable oil. Remove the tuna from the bag and pat dry, then cook the tuna for 2 minutes on each side. Remove from the pan and thinly slice. ", "Blanch the pak choi in boiling water for 2 minutes and refresh under cold water. Drain and place on the griddle pan next to the tuna for 2 minutes each side. ", "Divide the salad between the plates and top each one with some of the tuna and the pak choi. Spoon the dressing over and serve. "]}, {"isVegetarian": false, "title": "Japanese seafood hotpot with miso vegetables", "url": "www_bbc_co_uk_food_recipes_japanese_seafood_hotpot_53471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp soy sauce ", "2 tbsp mirin", "2 tbsp lemon juice ", "1 tbsp Bonito flakes (available online)", "1 thumb-sized piece dried kelp (kombu) (available online)", "100g/3½oz raw prawns, shelled", "2 scallops", "150g/5½oz salmon fillet, skinned and cut into bite-sized pieces", "150g/5½oz halibut fillet, skinned and cut into bite-sized pieces", "150g/5½oz sea bass fillet, skinned and cut into bite-sized pieces", "150g/5½oz red mullet fillet, skinned and cut into bite-sized pieces ", "handful shiitake mushrooms ", "handful dried Wood Ear mushrooms ", "200g/7oz oyster mushrooms ", "1 Chinese cabbage, thinly sliced", "2 carrots, thinly sliced", "200g/7oz purple sprouting broccoli ", "bunch spring onions, thinly sliced", "40g/1½oz dried dulse seaweed (available online), rehydrated in water and drained, to garnish", "3 tbsp white miso paste ", "2–3 tbsp runny honey", "3 tbsp mirin", "3 tbsp sunflower oil", "1 lemon, juice only", "1 aubergine, diced  ", "1 head broccoli, broken into small florets ", "1 tbsp sesame seeds, to garnish"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Make the dipping sauce by mixing together all the ingredients in a bowl. Cover and leave to steep for 24 hours.", "To make the miso vegetables, preheat the oven to 200C/180C Fan/Gas 6.", "Mix together the miso paste, honey, mirin, oil and lemon juice.", "Toss the aubergine and broccoli with the miso dressing in a large roasting tin. Roast for 30 minutes, then scatter over the sesame seeds.", "Meanwhile, to make the seafood hotpot, bring 400ml/14fl oz water to the boil and add the dried kelp. Set aside for an hour. ", "Put the seafood and vegetables in a serving dish. Strain the stock and pour it back into the pan. Bring back to the boil, drop in the seafood and vegetables, then remove from the heat and set aside for 15 minutes, or until the seafood is cooked through. Garnish with the seaweed.", "Serve the hotpot with the miso vegetables and dipping sauce. "]}, {"isVegetarian": true, "title": "Japanese-style glazed squash", "url": "www_bbc_co_uk_food_recipes_japaneseglazedsquash_77646", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ squash, chopped", "1 tbsp olive oil", "2 cloves garlic, crushed", "1 tsp soy sauce", "150ml/5fl oz vegetable or chicken stock", "1 tsp sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the squash in a pan with the oil, garlic, soy, chicken stock and sesame oil.", "Cover the pan and bring to the boil. ", "Once boiling point is reached, turn down and simmer for eight minutes or until softened. Remove the lid and finish cooking on high for 1-2 minutes or until the squash has a glazed appearance."]}, {"isVegetarian": true, "title": "Japanese vegetable stir-fried noodles (Yasai yaki soba)", "url": "www_bbc_co_uk_food_recipes_japanesevegetablesti_92442", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/japanesevegetablesti_92442_16x9.jpg", "ingredients": ["100ml/3½fl oz ready-made teriyaki sauce", "4½ tbsp ready-made crushed yellow bean sauce ", "1 lemongrass stalk, tough outer leaves removed, soft inner core crushed and finely sliced ", "1 tbsp freshly grated root ginger", "200g/7oz soba noodles", "2 free-range eggs, beaten", "½ green pepper, seeds removed, sliced", "½ red pepper, seeds removed, sliced", "1 onion, peeled, thinly sliced", "8 spring onions, trimmed, sliced", "10 mushrooms, sliced ", "2 garlic cloves, peeled, finely chopped", "handful fresh bean sprouts", "4 tbsp ready-made teriyaki sauce ", "3 tbsp vegetable oil", "½ tsp sesame seeds, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the yaki soba dressing, bring the teriyaki sauce, yellow bean sauce, lemongrass and ginger to the boil in a small pan, stirring well. ", "Reduce the heat until the mixture is just simmering, then continue to simmer for 8-10 minutes, or until the mixture has thickened. Set aside until ready to serve. ", "Meanwhile, for the noodles, cook the noodles in a large pot of boiling water for 2-3 minutes, or until just tender. Drain well, then refresh under cold running water until the noodles are completely cold. ", "In a bowl, mix together the eggs, peppers, onion, spring onions, mushrooms, garlic and bean sprouts until the vegetables are coated in the eggs. Stir in the teriyaki sauce until well combined. ", "Heat the oil in a wok over a medium heat. Add the egg and vegetable mixture and the cooked, cold noodles, and stir-fry for 3-4 minutes, or until the noodles have warmed through and the eggs and vegetables are cooked through. ", "To serve, divide the vegetables and noodles equally between two serving bowls. Drizzle over the yaki soba dressing. Sprinkle over the sesame seeds, if using."]}, {"isVegetarian": true, "title": "Japanese tofu, aubergine and lotus root stew", "url": "www_bbc_co_uk_food_recipes_japanese_tofu_aubergine_65332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fresh lotus root (medium size, about 400g/14oz)", "500ml/18fl oz vegetable oil, plus a little extra for cooking ", "flaked sea salt", "shichimi togarashi (Japanese seven-spice seasoning) ", "4 tbsp rice flour (or cornflour if none available)", "2 pieces firm tofu, about 375g/13oz, cut into 2.5cm/1in squares", "2 tbsp sesame oil", "1 medium onion, finely chopped", "2 medium leeks, trimmed, washed and sliced into 1cm/½in diagonal slices", "2 Japanese aubergine, cut into 2cm/¾in discs (alternatively you can use a normal aubergine cut into 2cm/¾in discs)", "4 garlic cloves, finely grated", "2 tbsp finely grated ginger ", "150g/5½oz brown shimeji mushrooms, trimmed ", "2 tbsp heaped miso paste ", "4 tbsp mirin", "5 tbsp soy sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of water to the boil. Peel the lotus root, cut off a third and set it aside. Add the rest of the lotus root to the pan. Turn the heat down and cook the root for 30 minutes at a very gentle simmer. Make sure you cook the root immediately after peeling as it will darken quickly. If preparing it in advance, put the lotus root in water with a little vinegar. Canned lotus root does not need preparing in this way and can be added straight to the stew.", "Finely slice the remaining third of the root on a mandolin or, using a very sharp knife, thinly to use it to make crisps.", "For the lotus root crisps, heat a wok or deep-fat fryer with 500ml/18fl oz of vegetable oil to about 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the thinly sliced lotus root in two or three batches for about five minutes, or until golden-brown. Remove with a slotted spoon and drain on a plate lined with kitchen paper. Season with salt and shichimi togarashi and set aside. ", "Carefully pour the hot oil out of the wok you used for the crisps, reserving about five tablespoons in the bottom.", "Sprinkle the rice flour onto a plate and coat the tofu evenly. Heat the oil in the wok and fry the tofu in a couple of batches on a medium heat, turning until lightly golden-brown, slightly crispy and a little puffy - this will take about eight minutes.  Drain on a plate lined with kitchen paper to absorb the excess oil, and keep warm.", "Clean the wok and add the sesame oil and two tablespoons of fresh vegetable oil. Fry the onion for a few minutes, add the leeks and cook until soft and just slightly golden-brown. Add the sliced aubergine and cook for further six minutes, or until soft.", "Add the grated garlic and the grated ginger.  Fry again for a further couple of minutes stirring continuously, so that the garlic doesn't burn.", "Cut the cooked lotus root into 5mm slices and add it to the onion and aubergine mixture. Tip in the shimeji mushrooms, add two heaped tablespoons of miso paste and fry for a minute.  Add the mirin, soy sauce and 300ml/10fl oz of boiling water.", "Bring back to the boil, and carefully fold in the tofu.  Place into serving bowls and top with the lotus root crisps."]}, {"isVegetarian": false, "title": "Jasmine tea-smoked trout with spelt salad and wasabi dressing", "url": "www_bbc_co_uk_food_recipes_jasmine_tea_smoked_trout_52946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz raw spelt", "300ml/10fl oz chicken stock", "2 x 150-200g/5½-7oz trout fillets, skin on pin-boned", "200g/7oz jasmine tea", "1 fillet smoked eel, cut into very thin strips", "150g/5½oz edamame beans, beans removed from their pods", "150g/5½oz fresh peas, removed from their pods", "1 punnet pea shoots, stalks removed", "2 tbsp chopped fresh coriander", "100ml/3½fl oz sour cream", "¼ tsp wasabi"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spelt place the stock and spelt into a saucepan and cook according to the packet instructions. Drain and leave to cool.", "For the trout, put some tin toil in the bottom of a smoker and spread the jasmine tea on top of the foil. Put the fish on a rack over the tea. Cook for 4-8 minutes until the fish is cooked through.", "Mix together all the salad ingredients and the cooked spelt in a large bowl. Mix together the sour cream and wasabi to make the dressing.", "To serve, serve the salad in the centre of the plate and top with the smoked trout, pieces if smoked eel and a little dressing."]}, {"isVegetarian": false, "title": "Barbecue ribs", "url": "www_bbc_co_uk_food_recipes_jennysbarbecuesparer_70172", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jennysbarbecuesparer_70172_16x9.jpg", "ingredients": ["12 pork spare ribs", "2 tbsp olive oil", "1 onion, finely chopped", "2 x 400g cans chopped tomatoes", "3 garlic cloves, finely chopped", "50g/2oz light muscovado sugar", "4 tbsp malt vinegar", "3 tbsp Worcestershire sauce", "1 tbsp tomato purée", "2 tsp Chinese five spice powder", "1 tsp ground cumin", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sauce, heat the oil in a saucepan and add the onion. Fry for 3-4 minutes, until softened, then stir in the rest of the ingredients. Mix well and bring to the boil. Reduce the heat and simmer gently for about 30 minutes, stirring occasionally, until thickened.", "Place the ribs on the barbecue and cook for 10-15 minutes, depending on the thickness of the meat. Brush the ribs liberally with the barbecue sauce every few minutes, until they have a thick, sticky coating, and serve."]}, {"isVegetarian": false, "title": "Jerk chicken and flatbreads", "url": "www_bbc_co_uk_food_recipes_jerk_chicken_and_20341", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerk_chicken_and_20341_16x9.jpg", "ingredients": ["8 boneless chicken thighs, skin on (if possible)", "5 Scotch bonnet chillies, seeds removed ", "1 bunch spring onions, thinly sliced", "50g/1¾oz fresh coriander, roughly chopped", "1 lime, juice only", "2 tbsp palm sugar or soft light brown sugar", "1 tbsp soy sauce", "1 tbsp ground allspice", "5 garlic cloves, roughly chopped", "1 tbsp dark rum", "10–12 sprigs fresh thyme, leaves only", "½ tbsp ground cinnamon", "2cm/¾in fresh root ginger, roughly chopped", "splash fresh orange juice", "3 tbsp vegetable oil, or enough to make a smooth paste", "salt and freshly ground black pepper", "50g/1¾oz butter, softened, cut into pieces", "180ml/6fl oz whole milk", "300g/10½oz plain flour, plus extra for dusting", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put the jerk paste ingredients in a food processor and blend until smooth, using enough oil and orange juice to create a thick paste. Smother the chicken in the paste, cover and leave in the fridge for at least 2 hours, or preferably overnight.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To make the flatbreads, beat the butter and milk together in a bowl. Slowly mix in the flour and ½ teaspoon salt until you have a dough consistency.", "Knead the dough on a lightly floured work surface until smooth. Wrap in cling film and chill in the fridge for 30 minutes.", "Meanwhile, place an ovenproof griddle pan over a high heat and cook the chicken on both sides until browned. Transfer the pan to the oven and bake for 40 minutes. ", "Place the rested dough on a lightly floured work surface and divide into quarters. Roll each quarter out to 3mm thick.", "Using a heavy-based frying pan or skillet, heat a little oil over a medium heat and add a flatbread. Cook for 1–2 minutes on each sides, or until you reach your desired level of crispness. Serve the chicken with the warm flatbreads."]}, {"isVegetarian": false, "title": "Jerk chicken and salad wraps", "url": "www_bbc_co_uk_food_recipes_jerk_chicken_and_salad_67570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 spring onion, finely chopped", "1 tbsp finely chopped fresh thyme", "1 tsp ground allspice or ground pimento", "1 tsp honey", "1 tsp soy sauce", "1 tsp vegetable oil", "½ tsp roughly chopped fresh garlic", "2 tsp roughly chopped scotch bonnets", "4 boneless chicken thighs, skin on", "4 ready-made rotis", "olive oil, for rubbing", "salt and freshly ground black pepper", "½ iceberg lettuce, shredded", "large handful rocket ", "1 x 198g tin sweetcorn, drained", "½ fresh coconut, flesh grated", "15 cherry tomatoes, halved ", "200g/7oz tin kidney beans, drained", "75g/2½oz red cabbage, shredded", "75g/2½oz white cabbage, shredded", "75g/2½oz carrots, peeled and grated", "1 tbsp finely chopped flatleaf parsley", "4-5 tbsp mango purée", "100ml/3½fl oz mayonnaise"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the jerk chicken, put the spring onion, thyme, allspice, honey, soy sauce, vegetable oil, garlic and chilli in a food processor and blend into a thick paste. Season with salt and pepper. ", "Put the chicken thighs in a large bowl and rub generously with the paste. Cover and leave to marinate in the fridge overnight. ", "Preheat a barbecue or griddle pan to high and rub the chicken thighs with a little olive oil. Cook the thighs for 10–15 minutes on each side, until  golden-brown, slightly charred and cooked through. Rest the chicken for 2–3 minutes and cut into slices.", "Meanwhile mix together the salad ingredients in a bowl. Put the coleslaw ingredients in another bowl and mix to combine. In a third bowl, mix together the mango purée and mayonnaise. ", "Heat the rotis in a hot frying pan or on the barbecue, until they colour and puff up on both sides. ", "Place the warm rotis on four plates. Put some  salad and coleslaw in the middle of each roti. Top with the jerk chicken, drizzle with the mango sauce, wrap and eat. "]}, {"isVegetarian": false, "title": "Jerk chicken, rice and pea cakes and slaw", "url": "www_bbc_co_uk_food_recipes_jerk_chicken_rice_and_99370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely chopped", "1 spring onion, finely chopped", "½ Scotch bonnet chilli, seeds removed, finely chopped", "2.5cm/1in piece of root ginger, grated", "1 tsp ground cinnamon", "1 tsp ground allspice", "2 tsp mixed herbs", "1 tsp salt", "1 tsp black pepper", "3 tbsp all-purpose seasoning", "1 tsp nutmeg", "2 garlic cloves, crushed", "2 tbsp chopped dried thyme leaves", "2 limes, juice only", "1 whole chicken, spatchcocked", "dash olive oil", "50g/1¾oz butter", "4 spring onions, finely chopped", "1 garlic clove, peeled but left whole", "¼ scotch bonnet chilli, finely diced", "2 sprigs fresh thyme", "250g/9oz risotto rice", "600ml/1 pint chicken stock", "200g/7oz fresh peas", "50g/1¾oz parmesan, grated", "2 tbsp olive oil", "2 medium free-range eggs, yolks only", "1 tsp Dijon mustard", "2 tbsp white wine vinegar", "300ml/10½fl oz sunflower oil", "1 celeriac, peeled and thinly sliced", "2 large carrots, peeled and thinly sliced", "1 lemon, juice only", "1 tbsp Dijion mustard", "2 tbsp chopped fresh chives"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the jerk chicken, preheat the oven to 200C/400F/Gas 6.", "Place all the ingredients for the jerk spice mix in a blender and blend until you have a rough paste.", "Spread the mixture all over the chicken and leave to marinade for at least an hour.", "Heat a large griddle pan, drizzle a little oil over the chicken and place skin-side down on the griddle. Cook for five minutes, turn over and place in the oven for 40-45 minutes, or until cooked through.", "For the rice and pea cakes, heat a large pan and add the butter. Add the onion, cook for a couple of minutes and then add the garlic, chilli and thyme and cook for a further minute.", "Add the rice and stir to coat the rice. Gradually add the stock a little at a time until all the stock has gone and you have a creamy risotto. Finish by adding the fresh peas and parmesan.", "Allow to go cold and then set aside in the fridge.", "To make the rice and pea cakes, heat a large frying pan and add the oil. Once hot take a tablespoon of cold risotto and shape into a small cake the size of a fish cake and fry for a couple of minutes each side.  ", "For the slaw, add the egg yolks to a small food processor and add the mustard and vinegar. Start the motor on the processor and gradually add the oil a little at a time to make mayonnaise.", "Place the sliced celeriac and carrot in a large glass bowl and add the mayonnaise, lemon juice, mustard and chives. ", "To serve carve the chicken into portions and place on a plate with the rice and pea cakes and slaw."]}, {"isVegetarian": false, "title": "Jerk pork belly with fresh pea and potato mash-up", "url": "www_bbc_co_uk_food_recipes_jerk_pork_belly_with_99669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz pork belly, rind removed", "1 tbsp dry jerk seasoning", "300ml/10fl oz dry cider", "475ml/17fl oz chicken stock", "1 onion, sliced into 1cm/½in rings", "4 garlic cloves, sliced", "4 sprigs fresh thyme", "sea salt and freshly ground black pepper", "hot pepper sauce, to serve", "675g/1lb 8oz new potatoes, scraped or scrubbed", "100ml/3½fl oz extra virgin olive oil", "225g/8oz fresh shelled peas"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Rub the pork belly with the jerk seasoning and place in a heavy-based frying pan, fat-side down. Cook for a few minutes until golden-brown then quickly sear on all sides to seal. Remove the pan from the heat and leave to rest for about five minutes.", "Pour the cider into a large jug with the chicken stock. Place the onion rings in a roasting tin and scatter over the garlic and thyme. Lay the rested pork belly on top, skin-side up, and pour the cider mixture around the meat. Season to taste with sea salt and freshly ground black pepper. Cover with tin foil and braise in the oven for 2½-3 hours, or until the pork is tender and completely soft.", "Remove the foil and turn the oven up to 230C/450F/Gas 8. Roast the meat for another 20-25 minutes until lightly crisp and golden-brown. Remove from the oven and set aside to rest.", "Meanwhile, place the potatoes in a large pan of salted water and bring to a boil. Cover and simmer for 12-15 minutes until tender then drain well. Tip the drained potatoes into a large bowl and gently crush each potato with the back of a fork until it just splits. Drizzle over the oil, season with sea salt and freshly ground black pepper and mix carefully until all the oil has been absorbed.", "Meanwhile, cook the peas in a separate pan of boiling, salted water for 3-4 minutes until tender then drain well. Mix the peas through the crushed potatoes and season to taste with sea salt and freshly ground black pepper. Arrange the mash-up on plates with slices of the pork belly. Serve at once with hot pepper sauce."]}, {"isVegetarian": false, "title": "Jerk lamb with chilli butternut squash and apple salad", "url": "www_bbc_co_uk_food_recipes_jerk_lamb_with_chilli_14546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp ground allspice", "½ tsp salt", "2 garlic cloves, crushed", "1 scotch bonnet chilli, seeds removed, finely chopped", "2 tsp chopped fresh thyme leaves", "2 tsp freshly ground black pepper", "½ tsp ground cinnamon", "¼ tsp cayenne pepper", "2 tbsp vegetable oil", "2 lamb fillets, fully trimmed", "4 tbsp vegetable oil", "2 spring onions, finely sliced", "½ tsp ground allspice", "2 green chillies, seeds removed, finely chopped", "1 sprig fresh thyme, leaves picked", "400g/14oz butternut squash, peeled, cut into 1cm/½in cubes", "1 tbsp caster sugar", "2 limes, juice only", "½ mango, peeled, finely chopped", "4 tbsp chopped fresh coriander", "4 tbsp fresh chopped fresh mint", "salt and freshly ground black pepper", "1 crisp apple, core removed, very finely sliced", "vegetable oil, for shallow frying", "salt", "1 tbsp English mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "1 frisée lettuce head, inner yellow leaves only, torn into small pieces", "1 pomegranate, seeds only", "2 tbsp coriander cress", "2 tbsp red amaranth cress"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the jerk lamb, blend all of the ingredients, except the lamb, in a food processor to a purée.", "Spread the mixture over the lamb until completely covered and set aside to marinate in the fridge for at least four hours. Remove the lamb from the fridge and allow to come to room temperature.", "Preheat the oven to 200C/400F/Gas 6.", "Heat an ovenproof frying pan until hot, add the lamb and fry on both sides until browned.", "Roast in the oven for 10-12 minutes (for medium), then remove and set aside to rest for 10 minutes.", "For the chilli butternut squash, heat the oil in a lidded frying pan and fry the spring onions, allspice, chillies and thyme for 1-2 minutes, or until the onion has just softened.", "Add the butternut squash and fry for 4-5 minutes, or until pale golden-brown.", "Cover the pan with a lid and continue to cook for 3-4 minutes, or until just softened.", "Add the sugar, lime juice and mango and cook for another 2-3 minutes, or until tender and slightly sticky.", "Stir in the coriander and mint and season with salt and freshly ground black pepper.", "For the apple salad, heat 1cm/½in of vegetable oil in a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "For the apple salad, fry the apple slices in the vegetable oil for 1-2 minutes, or until crisp. Remove with a slotted spoon, drain on kitchen paper and season with a little salt. (You may need to cook the apple slices in batches.)", "Whisk the mustard, vinegar and olive oil together in a bowl and season with salt and freshly ground black pepper.", "Mix the frisée leaves, pomegranate seeds and apple slices together in a bowl. Add some of the dressing and stir until well combined.", "To serve, spoon the butternut squash into the centre of the plate. Carve the lamb into thick slices and place a few slices across the pumpkin. Pile a little salad on top of the lamb and finish with a scattering of coriander and amaranth cress."]}, {"isVegetarian": false, "title": "Jerk pork chops with rice and peas", "url": "www_bbc_co_uk_food_recipes_jerk_pork_chops_with_68968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["bunch spring onions, roughly chopped", "1–2 scotch bonnet chillies, depending on how hot you want it, seeds removed", "6 garlic cloves", "5cm/2in piece fresh root ginger, chopped", "large sprig thyme, leaves only", "2 tbsp red wine vinegar", "2 tbsp vegetable oil", "2 tbsp soft dark brown sugar", "1 tbsp allspice berries, crushed", "1 tsp ground cinnamon", "1 tsp ground smoked paprika", "freshly grated nutmeg", "1 tsp freshly ground black pepper ", "4 large pork chops (preferably a fatty, on-the-bone cut)", "1 tsp salt", "1 tbsp vegetable or coconut oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 sprig thyme", "400g/14oz long grain rice", "100ml/3½fl oz coconut cream", "200g/7oz frozen gungo peas "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the marinade, put all the marinade ingredients into a food processor or blender, except the pork and salt, and blend until you have a fairly liquid paste. Put the pork chops in a bowl and season with the salt, then pour over the marinade. Cover and leave for at least a couple of hours, preferably overnight. If you are leaving the meat overnight, transfer it to the fridge.", "When you are ready to cook the chops, either heat your grill to medium-high or prepare a barbecue. Grill the chops on each side for 3–5 minutes on each side, depending on their thickness, then leave to rest for a few minutes.", "For the rice and peas, heat the oil in a large saucepan or casserole. Add the onion, and fry until soft and translucent. Add the garlic, thyme and rice and stir until the rice looks glossy. ", "Add 700ml/1¼ pint of water and the coconut cream, along with a generous amount of seasoning. Bring to the boil, cover, and reduce the heat to a low simmer. Cook for 10 minutes, then stir in the gungo peas. ", "Cook for a further 5 minutes, then remove from the heat and leave covered for another 10 minutes. Fluff up, and serve with the pork."]}, {"isVegetarian": false, "title": "Jerk pork with sweet potato mash and salsa", "url": "www_bbc_co_uk_food_recipes_jerk_pork_with_sweet_40784", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerk_pork_with_sweet_40784_16x9.jpg", "ingredients": ["2 tsp jerk seasoning", "1½ tsp runny honey", "100ml/3½fl oz pineapple juice (from 227g tin pineapple rings)", "300g/10½oz pork tenderloin", "1 tsp olive oil", "1 x 350g/12oz sweet potato, peeled and cut into 3cm/1¼in pieces", "2 tinned pineapple rings (about 100g/3½oz), drained and finely chopped", "3 spring onions, thinly sliced", "2 tbsp roughly chopped fresh coriander leaf", "½ lime, juice only", "1 tsp olive oil", "½ red chilli, deseeded and finely diced", "pinch salt"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the jerk seasoning, honey and pineapple juice in a shallow bowl large enough to hold the pork. Add the pork loin and place in the fridge, covered, for at least 30 minutes or overnight, turning the pork over a couple of times.", "Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with kitchen foil.", "Remove the meat from the marinade, reserving the liquid, and pat it dry with kitchen paper. Heat the oil in a frying pan over a high heat. Brown the meat on one side, turn over and brown on the other side.", "Place the meat in the baking tray, pour over the marinade and roast for 20–25 minutes, turning the pork over after 15 minutes. Cut into the thickest part of the steak to check that it is juicy but cooked through.", "Meanwhile, bring a saucepan of lightly salted water to the boil and simmer the sweet potato for 15 minutes until tender. Drain, mash and season with salt and pepper.", "To make the salsa, mix the pineapple, spring onion, coriander, a squeeze of lime juice, olive oil, chilli and salt together in a bowl and set aside for at least 10 minutes.", "Turn the meat over in its reduced marinade and leave to rest for 5 minutes. Cut the pork into 2cm/¾in-thick slices and serve with the mash and salsa."]}, {"isVegetarian": false, "title": "Jerk chicken", "url": "www_bbc_co_uk_food_recipes_jerkchicken_10680", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerkchicken_10680_16x9.jpg", "ingredients": ["6 chicken breasts, or chicken thighs, bones removed", "225g/8oz onions, quartered", "1-1½ scotch bonnet or other chillies according to taste, halved and seeded", "50g/2oz root ginger, peeled and chopped roughly  ", "½ tsp ground allspice", "small bunch fresh thyme, leaves only", "1 tsp freshly ground black pepper", "120ml/4fl oz white wine vinegar", "120ml/4fl oz dark soy sauce ", "rice and peas", "1 pineapple, peeled, cored and cut in wedges", "4 limes, 3 cut in wedges, 1 juice only"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the ingredients for the Jerk Sauce in a food processor and whiz until smooth.", "Place the chicken in a large shallow dish, pour over the sauce, cover and leave to marinate in the fridge overnight.", "On a hot griddle cook the chicken for 25-30 minutes, basting now and then with the leftover sauce. As it cooks, the thick sauce will go quite black in places, but don't worry, as it falls off it will leave behind a really well flavoured, crisp skin, with lovely moist tender meat underneath.", "Brush the pineapple lightly with oil and char grill until golden brown on all sides. Squeeze over the juice of one lime.", "Serve the jerk chicken with the rice and peas, pineapple and wedges of lime on the side. "]}, {"isVegetarian": false, "title": "Jerk chicken salad", "url": "www_bbc_co_uk_food_recipes_jerkchickensalad_83636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch spring onion, sliced finely ", "handful flatleaf parsley ", "1 tsp chilli flakes", "1 lime, juice only", "1 tsp mixed spice", "2 chicken breasts, boneless, skinless, sliced thickly", "2 tbsp olive oil", "1 bag salad leaves", "1 tbsp white wine vinegar", "100g/3oz mixed seeds and nuts"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place half the spring onion into a bowl with the flatleaf parsley, chilli flakes, lime and mixed spice. Using a hand blender, blend until smooth.", "Toss the chicken into the bowl and stir to coat.", "Heat a frying pan until hot, then add one tablespoon of olive oil and the chicken and stir fry for 2-3 minutes.", "Add the rest of the spring onions and cook for a further two minutes.", "Meanwhile, toss the salad leaves with the olive oil and vinegar and place on a serving plate.", "Add the chicken and scatter over the nuts. Serve."]}, {"isVegetarian": false, "title": "Jerk chicken with pomegranate rice", "url": "www_bbc_co_uk_food_recipes_jerkchickenwithpomeg_88341", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 part-boned chicken breasts, skin on (substitute boneless chicken breasts if part-boned are not available)", "½ large onion, roughly chopped", "2 scotch bonnet chillies, roughly chopped", "40g/1½oz ginger, peeled and chopped roughly ", "125ml/4½fl oz malt vinegar", "½ tsp ground cloves", "½ tsp ground cinnamon", "¼ tsp ground nutmeg", "½ tsp cracked black pepper", "3 garlic cloves, roughly chopped", "2 tsp fresh thyme leaves ", "3 tbsp dark soy sauce ", "200g/7oz basmati rice", "1 pomegranate, seeds only", "1 small bunch chervil leaves", "4 tbsp chives, roughly chopped", "50g/2oz frisée lettuce, roughly chopped", "1 lime, zest and juice", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "2 limes, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the jerk chicken, using a sharp knife, make deep cuts into the chicken flesh and place into a bowl.", "Place the remaining jerk chicken ingredients into a food processor and blend to a purée. Pour the marinade over the chicken and turn to coat all the pieces. Place into the fridge for at least four hours, but preferably overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a griddle pan until very hot. Add the chicken pieces and sear for 2-3 minutes on each side, then place onto a baking tray.", "Spoon the remaining marinade over the chicken and transfer to the oven to cook for 20-25 minutes, or until the chicken is completely cooked through.  Remove from the oven and leave to rest for 2-3 minutes before serving. ", "For the rice, place the rice into a saucepan with 400ml/14fl oz of cold water. Cover with a lid and place over a high heat. Bring to the boil, then reduce the heat and simmer very gently until all of the water has been absorbed and the rice is tender (about 10-15 minutes). Turn off the heat and leave to steam for 5-6 minutes.", "Place the rice into a bowl and add all the remaining rice ingredients and mix well to combine. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon a little of the rice onto each plate and top with a piece of jerk chicken. Garnish with a couple of wedges of lime."]}, {"isVegetarian": false, "title": "Jerk chicken with rice and peas", "url": "www_bbc_co_uk_food_recipes_jerkchickenwithricea_86519", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "12 chicken legs", "200g/7oz good-quality jerk seasoning ", "50ml/2fl oz vegetable oil", "1 onion, finely chopped ", "300g/10½oz long grain rice", "400ml/14fl oz water", "400ml/14fl oz coconut milk", "400g/14oz tin kidney beans, rinsed and drained", "3 tbsp chopped fresh thyme", "salt and freshly ground black pepper", "fresh coriander leaves, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the jerk chicken, place the vegetable oil into a deep, heavy- bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the chicken legs into a large bowl and dredge in the jerk  seasoning to coat all over. Carefully place into the hot oil and deep fry, turning occasionally, for about 12 minutes, or until golden-brown  and completely cooked through. Remove from the oil with a slotted  spoon and drain on kitchen paper.", "Meanwhile, for the rice and peas, heat the oil in a large lidded  pan and fry the onion until softened but not coloured.", "Add the rice and stir well, then add the water and bring to the boil.", "Add the coconut milk, kidney beans and thyme, reduce the heat and simmer,  covered, for about 20 minutes, or until the rice is cooked. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a good spoonful of the rice into a cup, then turn out onto a serving plate. Repeat with each serving and place 2-3 chicken legs on top of each pile of rice. Sprinkle with fresh coriander."]}, {"isVegetarian": false, "title": "Jerk Kiev with yam forestiere", "url": "www_bbc_co_uk_food_recipes_jerkkievwithyamfores_90443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz skinless chicken breasts with the wing bone retained", "1 tbsp olive oil", "2 tbsp jerk seasoning paste", "3 garlic cloves, crushed to a paste", "200g/7oz butter, softened", "2 shallots, finely diced", "2 tbsp finely chopped English parsley ", "½ lime, juice only", "salt and freshly ground black pepper", "vegetable oil, for deep frying", "4 free-range eggs, beaten", "110ml/4fl oz milk", "110g/4oz plain flour", "500g/1lb 2oz Japanese breadcrumbs", "500g/1lb 2oz yellow or white yams, peeled and cut into 1cm/½in chunks", "4 tbsp olive oil", "4 rashers smoked streaky bacon, roughly chopped ", "110g/4oz assorted wild mushrooms ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Kiev, make an incision in the top of each of the chicken breasts, then wiggle the knife around to create a pocket. Set aside.", "Heat the oil in a frying pan, add the jerk paste and garlic and cook for one minute or until fragrant. ", "Place the butter into a bowl, add the cooked jerk paste and garlic, along with the shallots, parsley and lime juice. Beat together until well combined. Season with salt and freshly ground black pepper, to taste.", "Place the mixture into a piping bag and pipe it into the pockets created in the chicken breasts.", "Place the chicken onto a plate, cover and place in the fridge for 30 minutes until the butter inside the chicken has just set.", "Heat the vegetable oil in a deep heavy-bottomed saucepan or deep fat fryer, to 190C/375F or until a breadcrumb sizzles and turns golden-brown when dropped in it (CAUTION: hot oil can be dangerous - do not leave unattended). Preheat the oven to 200C/390F/Gas 6.", "Beat the eggs and milk together in a small bowl; tip the flour onto one plate and the breadcrumbs onto another plate.", "Dip each chicken breast in the flour, then the egg mixture and finally in the breadcrumbs to coat entirely. ", "Place each breast in the deep fat fryer and cook for two minutes until golden-brown.", "Carefully remove the chicken from the fryer using a slotted spoon and drain on kitchen paper. Place onto a roasting tray and roast in the oven for 5-8 minutes, or until cooked through.", "For the yam forestière, bring a pan of salted water to the boil, add the chopped yams and simmer for 2-3 minutes, or until just tender.", "Drain the yams and set aside.", "Heat a frying pan, add the olive oil and yams and fry for 3-4 minutes, or until golden-brown on all sides.", "Heat a second frying pan until hot, add the bacon. Add the mushrooms and fry for 2-3 minutes, or until cooked through.", "Add the yams to the bacon and mushrooms and mix well to combine. Season with salt and freshly ground black pepper, to taste.", "To serve, spoon the yam mixture into the centre of each of four serving plates. Cut the Kiev in half on the diagonal and arrange on top. Serve."]}, {"isVegetarian": true, "title": "Jerk seasoning", "url": "www_bbc_co_uk_food_recipes_jerkseasoning_89190", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch fresh thyme, leaves only", "2 cinnamon sticks, roughly crushed", "2 tbsp chopped fresh coriander", "1 tsp coriander seeds, crushed", "2 tbsp black peppercorns, crushed", "1 tsp freshly grated nutmeg", "3 tsp allspice, crushed", "6 garlic cloves", "4 Scotch Bonnet chillies, seeds removed", "2 tsp chopped fresh ginger", "2 limes, zest of 1 lime, juice of 2", "140ml/¼ pint olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients in a blender or food processor and blend to make a smooth paste. ", "Use the paste as a seasoning for chicken, pork or fish. It will keep for two weeks if covered and refrigerated."]}, {"isVegetarian": false, "title": "Jerusalem artichoke soup with white truffle oil", "url": "www_bbc_co_uk_food_recipes_jerusalem_artichoke_soup_20395", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerusalem_artichoke_soup_20395_16x9.jpg", "ingredients": ["30g/1oz unsalted butter", "70g/2½oz onions, sliced", "250ml/9fl oz chicken stock", "400g/14oz Jerusalem artichokes, peeled and cut into small pieces", "1 bouquet garni", "50g/1¾oz butter ", "few drops truffle oil ", "1 tbsp chopped fresh chives ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan, add the onions and a pinch of salt and cook gently until soft, without colouring. Add 250ml/9fl oz water, the chicken stock, artichokes and bouquet garni and bring to the boil. Cook for about 30 minutes. Once the artichokes are soft, remove the bouquet garni. Transfer to a blender and blend to a fine purée, then pass through a fine sieve if needed.", "Whisk the butter into the soup, add a few drops of truffle oil, then season with salt and pepper.", "Serve with a sprinkling of fresh chives."]}, {"isVegetarian": false, "title": "Jersey Royal, asparagus and clam broth", "url": "www_bbc_co_uk_food_recipes_jersey_royal_asparagus_49654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1¼ litres/2 pints chicken stock", "300g/10½oz Jersey Royal potatoes, cleaned", "150g/5½oz pearl onions, left whole but peeled", "16 asparagus stems, trimmed", "600g/1lb 5oz clams, scrubbed and debearded", "75g/2¾oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the stock in a large lidded saucepan and bring to the boil. Add the potatoes and cook for 4-7 minutes, until nearly tender.", "Add the pearl onions and cook for 2 minutes. Add the asparagus and cook for a further 2 minutes, or until all the vegetables are tender. Remove the vegetables using a slotted spoon and set aside.", "Discard any clams with broken shells and any that refuse to close when tapped against the side of the sink. Reduce the stock by one-third, then add the clams. Cover and cook for 1-2 minutes, until they open. Discard any that remain closed. ", "Whisk in the butter, then return the vegetables to the pan and warm through. Season with salt, if needed, and black pepper. ", "Divide the broth and clams between 4 serving bowls and serve with crusty bread. "]}, {"isVegetarian": true, "title": "Jersey Royal and Double Gloucester tortilla", "url": "www_bbc_co_uk_food_recipes_jersey_royal_and_double_50135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash oil, for cooking", "1 onion, sliced ", "100g/3½oz crème fraîche, plus extra to serve", "salt and pepper", "2 tbsp chopped chives", "4 free-range duck eggs, whisked", "200g/7oz Jersey Royals, washed and scrubbed (not peeled), pre-cooked and halved", "1 bunch spring onions, sliced", "70g/2½oz Double Gloucester, grated", "30ml/1fl oz first press rapeseed oil ", "chive flowers"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dash of oil in a frying pan and fry the onion until softened. ", "Whisk the crème fraîche and chives together in a bowl. Season with salt and black pepper and set aside.", "Put the duck eggs, potatoes, spring onions, cooked onions and cheese in a mixing bowl and season with salt and pepper. ", "Add the rapeseed oil to a non-stick frying pan, heat and then pour in the tortilla mixture.", "With a heatproof spatula, stir the egg mix until you see the egg starting to set, then leave to fully set on the presentation side and lightly colour - draw the sides in around the tortilla to make it as round as possible ", "Once the tortilla has set, use a cake stand to help turn the tortilla over: put the stand on top of the firm egg mixture, then turn at the same time so that the pan is upside down and the cake stand is upright. Lift the pan off and you should have a lovely looking tortilla. Slide the tortilla back into the pan and finish cooking for 2-4 minutes until cooked to your liking.", "To serve, cut the tortilla into portions and then serve with a spoon of the crème fraîche and chive flowers on top."]}, {"isVegetarian": false, "title": "Jerusalem artichoke soup served with a game burger and Jerusalem crisps", "url": "www_bbc_co_uk_food_recipes_jerusalem_artichoke_soup_78921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 large onion, chopped", "salt and pepper", "10-12 Jerusalem artichokes, peeled and placed in acidulated water", "750ml/1¼ pint chicken stock", "150ml/5½fl oz whipping cream", "½ lemon, juice only", "50ml/2fl oz olive oil, plus extra to serve", "1 onion, finely chopped", "200g/7oz game livers", "200g/7oz pork fat", "200g/7oz pork throat or belly", "200g/7oz mixed game – such as pheasant, mallard and grouse", "50g/1¾oz dried apricots ", "1-2 free-range eggs ", "200ml/7fl oz cream", "200g/7oz breadcrumbs", "vegetable oil, for deep frying", "4 Jerusalem artichokes, sliced lengthways on a mandolin, skin on ", "50g/1¾oz plain flour", "2 tbsp fresh chives, sliced into 2mm pieces, to garnish "], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Jerusalem artichoke soup, heat the vegetable oil in a large pan and gently fry the onion and a pinch of salt for 5-6 minutes, or until soft. ", "Meanwhile, cut the artichokes into roughly 2cm/1in cubes. Add them to the onions and fry for a further 3-4 minutes. Pour in the chicken stock and cream and cook over a medium heat until the vegetables are soft. Add the lemon juice and cook for five more minutes.", "Transfer the cooked vegetables to food processor and blend to a smooth soup. If it is too thick, add a little more stock or water. Taste to check the seasoning and add salt and pepper as required. Keep warm until ready to serve.", "For the game burger, heat a dash of the olive oil in a frying pan. Once hot, add the onion and gently fry until soft and translucent. Set aside to cool.", "Put the livers, pork fat, throat (or belly), game and apricots through a mincer, or very finely chop them (alternatively, ask your butcher to do this for you). Add one egg, the cream and breadcrumbs and mix together. If the mixture doesn’t bind together add the other egg. Season with salt and pepper or, to test the seasoning of the burger, roll a small amount into a mini burger, fry and taste.", "When satisfied with the seasoning, mould the meat into burgers and fry in a large frying pan with the olive oil for 2-3 minutes on each side.", "For the Jerusalem crisps, fill a deep-fat fryer with vegetable oil and preheat to 180C/350F. (CAUTION: hot can be dangerous. Do not leave unattended.)", "Dry the slices of artichokes with a clean tea towel and dust with flour. Fry for two minutes, or until crisp and golden-brown. ", "Serve the Jerusalem artichoke soup with the game burger in the centre of each of the bowls, garnished with the artichoke crisps, chives and a swirl of olive oil. "]}, {"isVegetarian": true, "title": "Jerusalem artichoke broth", "url": "www_bbc_co_uk_food_recipes_jerusalemartichokebr_85618", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerusalemartichokebr_85618_16x9.jpg", "ingredients": ["1 large onion, halved and sliced", "675g/1½lb Jerusalem artichokes, peeled, halved and sliced", "2 tbsp extra virgin olive oil", "4 sprigs fresh thyme", "1 bay leaf", "1 litre/1¾ pints hot chicken or vegetable stock", "2 tbsp white wine vinegar", "salt and freshly ground black pepper", "2 tbsp roughly chopped parsley", "6 thick slices baguette (optional)", "150g/5oz single Gloucester, mature cheddar or gruyère cheese, coarsely grated (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the onion, artichokes and oil into a pan and add the thyme and bay leaf, tied together with string. Cover and sweat over a low heat for about 15 minutes, stirring occasionally.", "Add the stock and vinegar, season well with salt and freshly ground black pepper and bring up to the boil. Simmer for ten minutes, then taste and adjust the seasoning. Discard the thyme and bay leaf and pour into serving bowls.", "To serve, sprinkle with parsley. If using the bread and cheese, preheat the grill to medium. Toast the baguette lightly on both sides under the grill, then, just before serving, top with grated cheese and slide back under the grill to melt. Float a slice of cheese on toast in each bowl of soup as you serve."]}, {"isVegetarian": false, "title": "Jerusalem artichoke soup with pheasant and crispy shallot", "url": "www_bbc_co_uk_food_recipes_jerusalemartichokeso_79270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "3 Jerusalem artichokes, peeled and sliced", "½ shallot, peeled and sliced", "30ml/1fl oz white wine", "100ml/3½fl oz vegetable stock", "55ml/2fl oz double cream", "1 tbsp olive oil", "2 pheasant thighs", "2 tbsp olive oil", "½ shallot, peeled and finely sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan. Add the artichokes and shallot and sauté for a few minutes, to soften.", "Add the white wine and heat for a further two minutes.", "Pour in the vegetable stock, bring to the boil and then reduce the heat and simmer gently for 10-15 minutes.", "Add the cream and then, using a hand blender, blend until smooth.", "Meanwhile, for the pheasant garnish, heat one tablespoon of olive oil in a separate pan. Add the pheasant thighs and cook for 4-5 minutes on each side, until crisp and thoroughly cooked.", "In a separate pan, add the sliced shallot and sauté for 3-4 minutes until golden and crisp.", "To serve, ladle the soup into a bowl. Place the pheasant thighs in the middle and scatter the crispy shallots on top."]}]