[{"isVegetarian": true, "title": "Maple syrup sponge pudding with almond custard and blueberry compôte", "url": "www_bbc_co_uk_food_recipes_maple_syrup_sponge_37946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "2 tbsp maple syrup", "100g/3½oz flour, sifted", "1½ tsp baking powder", "2 large free-range eggs", "100g/3½oz brown sugar", "85g/3oz margarine", "1 tbsp whisky", "100ml/3½fl oz milk", "200ml/7fl oz double cream", "1 vanilla pod, split lengthways", "3 free-range eggs, yolks only", "55g/2oz caster sugar", "20ml/1fl oz almond liqueur", "150g/5½oz blueberries", "50g/1¾oz sugar", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the syrup sponge pudding, generously grease the inside of an 850ml/1½pt pudding basin with the butter and place in the fridge for five minutes. ", "Remove from the fridge and add the maple syrup to the base of the pudding basin.", "Put all the remaining ingredients into a large mixing bowl and mix until well combined. Pour into the basin over the maple syrup. Cover with a doubled piece of buttered foil, making a few pleats in the foil before pressing down firmly around the rim of basin. Secure the foil around the rim with string.", "Place the basin in a steamer over a large pot of boiling water and steam over a moderate heat for one and a half hours, ensuring that the saucepan does not boil dry. If you need to top up, use boiling water. ", "In a heavy-based saucepan heat together the milk, double cream and vanilla pod. ", "In a large bowl, whisk together the egg yolks and caster sugar until light and airy. Whisk in the almond liqueur. ", "Whisk half of the hot milk mixture into the egg mixture, then pour the egg mixture back into the saucepan with the remaining hot milk. ", "Over a very low heat, cook the mixture, stirring constantly, until thickened into a smooth custard.  Set aside.", "For the blueberry compôte, put all the ingredients into a saucepan with four tablespoons (60ml/2fl oz) of water and bring to the boil. Simmer gently for five minutes and remove from the heat.", "To serve, once the puddings are cooked, remove the foil, turn out the pudding and serve in wedges with hot almond custard and blueberry compôte."]}, {"isVegetarian": true, "title": "Maple and chilli roasted parsnips", "url": "www_bbc_co_uk_food_recipes_mapleandchilliroaste_87749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 parsnips, cut lengthways into eight pieces", "pinch dried chilli flakes", "drizzle maple syrup", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Drizzle the olive oil into a roasting tin and place in the oven until hot.", "Blanch the parsnips in a pan of boiling salted water for 2-3 minutes, then drain well.", "Remove the roasting tin from the oven, add the parsnips and stir to coat with the hot oil. Season with salt and freshly ground black pepper then add the chilli and maple syrup. Stir until evenly coated, then roast in the oven for 15-20 minutes until tender in the middle and golden brown on the outside.", "Transfer to a warm serving dish and serve at once."]}, {"isVegetarian": true, "title": "Maple, lime and mango syllabub", "url": "www_bbc_co_uk_food_recipes_maplelimeandmangosyl_88335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz double cream, softly whipped", "3 tbsp Greek-style yoghurt", "½ lime, juice only", "1 tbsp maple syrup, plus extra to serve", "½ mango, peeled and chopped", "lime wedges, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the whipped cream, yoghurt, lime juice and maple syrup together.", "To serve, spoon the mixture into a dessert glass. Top with the chopped mango, drizzle with extra maple syrup and garnish with lime wedges."]}, {"isVegetarian": true, "title": "Maple-roast parsnips", "url": "www_bbc_co_uk_food_recipes_mapleroastparsnips_84758", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mapleroastparsnips_84758_16x9.jpg", "ingredients": ["1kg/2¼lb parsnips", "125ml/4fl oz vegetable oil", "80ml/3½fl oz maple syrup"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Peel the parsnips and then halve them crosswise, then halve or quarter each piece lengthwise. ", "Place the parsnips into a roasting tin.  Pour the oil over the parsnips and mix them well so that the oil covers all of the pieces.", "Pour the maple syrup over the parsnips and transfer the roasting tin to the oven.  Roast the parsnips for 35 minutes, or until they are tender and golden-brown.", "To serve place on a clean serving dish."]}, {"isVegetarian": true, "title": "Marble cake", "url": "www_bbc_co_uk_food_recipes_marble_cake_64138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz butter or baking spread", "175g/6oz caster sugar", "3 free-range eggs, lightly beaten", "½ tsp vanilla extract", "225g/8oz self-raising flour", "pinch salt", "2 tbsp milk", "2 tbsp cocoa powder", "2 tbsp strong black coffee, cooled"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "Grease and line a small loaf tin or 20cm/8in round tin.", "Cream the butter and sugar with an electric whisk in a large mixing bowl until very pale and fluffy. ", "Add the beaten egg, a little at a time, whisking well after each addition.  Then whisk in the vanilla extract.", "Sift the flour and salt into a large bowl, then fold it gently into the butter and egg mixture.", "Divide the cake batter into two equal portions (about 350g each).", "Add the milk to one portion of the mixture, stirring in gently until well combined.", "Mix the cocoa powder and the coffee together in a mug to form a smooth paste. Stir this paste into the other portion of the cake batter until thoroughly combined.", "Spoon large blobs of each cake mixture into the prepared tin, alternating the flavours to give a marble effect.  Bake for 50-60 minutes until the cake is springy to the touch and a wooden skewer inserted into the centre of the cake comes out clean.", "Allow the cake to cool in the tin for ten minutes, then turn out onto a wire rack and cool completely before slicing. "]}, {"isVegetarian": false, "title": "Fideuà", "url": "www_bbc_co_uk_food_recipes_marias_fideu_61565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marias_fideu_61565_16x9.jpg", "ingredients": ["6 tomatoes, grated", "3 garlic cloves, skins left on, crushed", "2 onions, roughly chopped", "2 dried ñora peppers", "monkfish head and bones (or other white fish bones)", "1.5 litres/3¼ pints boiling water", "1 lemon, juice only", "pinch salt ", "4 tbsp olive oil ", "1 whole monkfish tail, cut into large chunks", "12 king prawns", "2 onions, finely chopped", "4 garlic cloves, finely chopped", "2 squid, cleaned, spines removed, flesh roughly chopped", "2 dried ñora peppers, finely chopped (available from Spanish delicatessens and online specialists)", "500g/1lb 2oz short vermicelli noodles (called 'fideo' in Spain)", "2 tbsp smoked paprika", "400g/14oz mussels, scrubbed and de-bearded (discard any mussels that do not shut tightly when tapped firmly)", "salt and freshly ground black pepper", "100g/3½oz almonds", "4 tbsp chopped fresh parsley", "2 lemons, cut into wedges, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the stock, place the grated tomato skins in a large saucepan, reserving the flesh for later, with the rest of the stock ingredients and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 30 minutes. Strain the stock and reserve the liquid.", "For the fideuà, heat half of the oil in a paella pan or large, heavy-based, shallow frying pan over a medium heat. Add the monkfish and prawns and fry for 1-2 minutes on each side, until browned on both sides, adding more oil if necessary. Remove from the pan and set aside.", "Heat the remaining oil in the frying pan, add the onions and fry for 3-4 minutes, or until softened. Add the garlic, tomato flesh and squid and continue cook over a low heat for 6-7 minutes, or until the squid is opaque.", "Add the ñora peppers and the noodles, mix well, and continue to cook for a further 2-3 minutes, or until the noodles are covered in the oil. Sprinkle over the smoked paprika.", "Pour in the stock and bring the mixture to a simmer. Simmer for 10 minutes.", "Return the monkfish and the prawns to the pan, then arrange the mussels over the top of the fideuà. Season, to taste, with salt and freshly ground black pepper, then cover the pan tightly with aluminium foil or greaseproof paper and continue to simmer for a further 4-5 minutes, or until the mussels have opened (discard any mussels whose shells do not open during cooking).", "Meanwhile, for the picada, grind the almonds and the chopped parsley in a mortar and pestle as finely as possible.", "To serve, sprinkle the picada over the fideuà, garnish with lemon wedges and spoon onto serving plates."]}, {"isVegetarian": true, "title": "Maple syrup, walnut and buttermilk wholemeal scones", "url": "www_bbc_co_uk_food_recipes_maplesyrupwalnutbutt_89621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz self-raising flour", "100g/3½oz medium oatmeal, plus extra for dusting", "100g/3½oz wholemeal flour", "50g/2oz caster sugar", "2 tsp baking powder", "½ tsp salt", "160g/5½oz unsalted butter, softened, plus extra for greasing", "100g/3½oz walnuts, roughly chopped", "125ml/4fl oz buttermilk", "150ml/5fl oz maple syrup"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 4.", "Mix the self-raising flour, oatmeal, wholemeal flour, caster sugar, baking powder and the salt in a bowl to combine.", "Add the butter and rub into the flour mixture until it resembles breadcrumbs.", "Fold in the walnuts.", "Place the buttermilk and maple syrup into a separate bowl and mix well.", "Add the buttermilk and maple syrup mixture to the dry mixture and mix well to make a dough.", "Roll the dough out on a floured work surface to 3cm/1½in thick. Using a pastry cutter, cut out 12 scones (or as many as the dough will provide).", "Place onto a greased baking tray and transfer to the oven to bake for 10-12 minutes, or until golden-brown.", "Eat while still warm from the oven."]}, {"isVegetarian": true, "title": "Marchpane petticoat", "url": "www_bbc_co_uk_food_recipes_marchpane_petticoat_07592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ground almonds", "200g/7oz icing sugar, plus extra for dusting", "2 tbsp rosewater ", "4-5 tbsp cold water", "200g/7oz icing sugar", "1 tbsp rosewater", "edible gold lustre spray", "edible red lustre spray"], "serves": "Makes 1", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2 and line two baking trays with greaseproof paper.", "Combine the ground almonds and icing sugar in a large bowl and whisk using a balloon whisk. Stir in the rosewater with a rubber spatula, then gradually add the water to make a smooth, stiff paste. Lightly dust a clean work surface with icing sugar, turn the dough out and roll out the mixture into a sheet just under 1cm/½in thick.", "Use a 20cm/8in fluted tart tin to cut out a large circle from the dough. Transfer to a prepared baking tray and bake for 20 minutes, or until pale golden and firm. ", "Gather up the scraps of paste, re-roll, then cut out decorative shapes such as hearts, flowers and stars. Transfer to the second baking tray and bake for 15 minutes. Leave the cooked disc and shapes to cool completely.", "Mix together the icing sugar, rosewater and enough water to make a pourable icing in a bowl. Place the disc on a wire cooling rack set over a baking tray, then pour the icing over to completely cover the disc, including the sides. Set a little of the icing aside. Gently shake the wire rack to even the surface then set aside for an hour to set.", "Spray the decorative shapes with the gold and red sprays and then stick them to the surface of the disc with dots of the excess icing. Leave to set for 30 minutes."]}, {"isVegetarian": false, "title": "Beef tartar, tomato jelly and sourdough crisps", "url": "www_bbc_co_uk_food_recipes_marinated_beef_tartare_10869", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz tomato ketchup", "7gm Dijon mustard (about 1 teaspoon)", "few drops Worcestershire sauce", "6 drops Tabasco", "50ml/2fl oz rapeseed oil ", "2 plum tomatoes, skinned, seeds removed and diced", "large pinch finally chopped chives", "175g/6oz aged beef fillet, finely chopped", "1 small banana shallot, peeled and finely chopped", "1 small gherkin, finely chopped", "1 tsp mini capers, washed", "pinch finely chopped flat leaf parsley", "1 tsp of spiced tomatoes (see above)", "1kg/2lb 4oz plum tomatoes ", "20g/¾oz celery, roughly chopped", "5g/⅛ garlic (about 1 clove), roughly chopped", "10g/¼oz shallots, roughly chopped", "sprig thyme", "sprig tarragon", "2 sprigs basil", "pinch of salt", "pinch of sugar", "pinch of cayenne pepper ", "splash of Worcestershire sauce", "4 drops Tabasco", "10g gelatine", "¼ loaf sourdough, finely sliced", "olive oil, for drizzling", "Oscietra caviar", "micro-rocket cress", "baby rocket", "baby lemon balm"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the tomato jelly, put all of the ingredients, except the gelatine, in a bowl and mix until well combined. Transfer the mixture to a blender and blitz to a pulp.", "Pour the pulp into a muslin cloth. Tie the cloth and hang it over a bowl overnight. Measure 250ml/8½  of the water collected in the bowl and lightly warm through in a saucepan. Add in the geletine and stir. ", "Line a flat tray with cling film and pour in the water mixture. Place in the fridge to set. ", "For the spiced tomatoes, whisk together the ketchup, mustard, Worcestershire sauce, Tabasco and rapeseed oil until emulsified.  Put the plum tomatoes and chives in a bowl and bind with a little of the ketchup mixture, the remaining mixture can be used to make a sauce.", "For the beef tartar, put the beef fillet in a bowl. Add the shallot, gherkin, capers and parsley. Add a little of the tomato sauce and season with salt and pepper.", "For the sourdough crisps, preheat the oven to 150C/130C Fan/Gas 2.", "Place the sourdough slices on a baking tray and drizzle with the oil. Season with salt and pepper. Bake until crisp, then remove and leave to cool. Meanwhile cut 6 circles from the set jelly.", "To serve, place 3 circles of jelly on a plate and top with the beef tartare and spiced tomatoes. Place the remaining jelly circles on top and spoon over the caviar. Dress the plate with the sourdough crisps, leaves and a drizzle of olive oil. "]}, {"isVegetarian": false, "title": "Marinated eels (anguilla alla scapece)", "url": "www_bbc_co_uk_food_recipes_marinated_eels_anguilla_70975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 8oz eels, heads removed, skin and guts removed, cut into 10cm/4in lengths", "plain flour, seasoned with salt and freshly ground black pepper", "150ml/5fl oz olive oil", "4-5 garlic cloves, sliced", "6 tbsp white wine vinegar", "handful fresh mint leaves"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the eel and seasoned flour into a food bag. Seal and shake the bag to coat the eel in the flour. Remove the eel from the bag and shake off any excess.", "Heat half the oil in a large frying pan over a medium heat. Add the floured eel and fry, in batches if necessary, for 1-2 minutes on each side, or until browned on all sides. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "Wipe the pan clean with a sheet of kitchen paper. Heat the remaining oil over a medium heat, then add the garlic and fry for 1-2 minutes, or until softened but not coloured.", "Add the vinegar to the pan, then season the garlic, to taste, with salt and freshly ground black pepper. Remove the pan from the heat and set aside until the contents have cooled.", "Stir the mint leaves into the cooled vinegar and garlic mixture.", "Place the drained pieces of fried eel into the bottom of a glass serving dish. Pour over the cooled marinade mixture. Cover and chill in the fridge for 5-6 hours, or preferably overnight, turning the pieces of eel in the marinade from time to time.", "Serve cold with a green salad and slices of good-quality crusty bread."]}, {"isVegetarian": true, "title": "Marinated feta, roasted pepper jam and lentil dressing", "url": "www_bbc_co_uk_food_recipes_marinated_feta_roasted_19610", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz feta cheese", "2 garlic cloves, cut into thin slices", "handful mint leaves", "150ml/5fl oz extra virgin olive oil", "freshly ground black pepper", "3-4 tbsp balsamic vinegar", "100-150ml/3½-5fl oz extra virgin olive oil", "freshly ground black pepper ", "55g/2oz Puy lentils, cooked", "2 tbsp olive oil", "2 red peppers, seeds removed, sliced", "2 yellow peppers, seeds removed, sliced", "2 orange peppers, seeds removed, sliced", "1 red chilli (left whole)", "1 bay leaf", "2 garlic cloves, peeled", "1 tbsp caster sugar", "1 lemon, juice and remaining wedges"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinated feta cheese, place the cheese in a large shallow bowl and sprinkle over the garlic. ", "Add the mint leaves, drizzle over the olive oil and season with black pepper. Cover and leave to marinate for one hour at room temperature. ", "For the lentil dressing, whisk the balsamic vinegar and extra virgin oil in a bowl. Season with black pepper and stir in the cooked lentils. Set aside.", "For the red pepper jam, heat the olive oil over a medium heat in a large pan. Add the peppers, chilli, bay leaf, garlic, sugar, lemon juice and juiced wedges. ", "Place a piece of wet greaseproof paper over the peppers and cover with a lid. Gently cook for 35-40 minutes, or until the peppers are really soft. ", "Remove the paper and lid from the pan and increase the heat. Simmer to reduce the liquid for about 3-4 minutes, taking care not to allow it to burn. Season to taste. "]}, {"isVegetarian": false, "title": "Marinated goat cutlets with roasted figs and goats’ curd", "url": "www_bbc_co_uk_food_recipes_marinated_goat_cutlets_08411", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 unwaxed lemon, finely grated zest only", "2 tbsp fresh oregano", "2 garlic cloves, finely chopped", "4 tbsp olive oil", "12 goat cutlets or 3 x 4-bone racks of goat cutlets", "75g/2½oz unsalted butter", "12 figs, halved or quartered depending on size", "4 tbsp honey", "1 tsp coarsely ground black pepper", "75g/2½oz unsalted butter", "75g/2½oz fresh nettles, chopped", "75g/2½oz fresh chard, chopped", "200ml/7fl oz chicken stock", "salt and freshly ground black pepper", "150g/5½oz goats’ curd"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the goat cutlets, mix the lemon zest, oregano, garlic and oil in a large bowl. Add the cutlets and marinate in the fridge for at least an hour (return to room temperature before cooking).", "For the figs, preheat the oven to 220C/200C Fan/Gas 7.", "Melt the butter in a large frying pan. Add the figs and toss to coat in the butter. Add the honey and black pepper and toss again. Roast for 4–6 minutes, or until the figs are sticky and glazed.", "Meanwhile, heat a large griddle pan or frying pan, then add the marinated cutlets and cook for 2–3 minutes on each side. Set aside to rest for about 3 minutes.", "For the braised nettles and chard, heat another large frying pan or a sauté pan and add the butter. Once melted, add the nettles and chard and coat in the butter. Pour in the stock and cook for 2–4 minutes, or until the liquid has reduced by half. Season with salt and pepper.", "To serve, put the cutlets and figs on plates and spoon over the braised nettles and chard. Finish with dots of goats’ curd."]}, {"isVegetarian": false, "title": "Marinated Ibérico pork fillet with sautéed potatoes and pimentón", "url": "www_bbc_co_uk_food_recipes_marinated_iberico_pork_50937", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil", "1 tsp bittersweet smoked paprika, plus extra to serve", "2 sprigs fresh oregano, leaves only, chopped", "1 garlic clove, finely chopped", "½ tsp ground cumin", "4 x 250g/9oz pork fillets (preferably Ibérico pork)", "1kg/2lb 4oz waxy potatoes, such as Desirée potatoes, peeled, cut into 7-8mm-thick slices", "2 tbsp olive oil, plus extra to serve", "1 small onion finely sliced", "3 garlic cloves, finely sliced ", "4 sprigs fresh thyme, leaves only, to serve ", "salt and freshly ground black pepper  "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork, preheat the oven to 200C/180C Fan/Gas 6.", "Mix together all of the pork ingredients, except for the pork, in a large bowl until well combined. Add the pork fillets and coat them in the mixture. Chill in the fridge for at least 12 hours, to marinate.", "When the meat has marinated, remove it from the fridge and set aside until is has returned to room temperature. ", "Heat an ovenproof frying pan over a medium heat. When the pan is hot, remove the pork fillets from the marinade, shaking off any excess, and fry for 1-2 minutes on each side, or until browned on all sides. ", "Transfer the pan to the oven and cook the pork fillets for a further 5 minutes (if you are using ibérico pork, the fillets will only need cooking in the oven for 2 minutes). Remove the meat from the pan and set aside on a warm plate for 5 minutes, to rest. Reserve the pan juices.", "Meanwhile, for the potatoes, boil the potato slices in a pan of salted water for 1-2 minutes, or until just tender. Drain well.", "Heat the oil in a frying pan over a medium heat, then add the drained potatoes and fry for 2-3 minutes, or until just coloured. ", "Add the onion and garlic and continue to fry for 1-2 minutes, or until golden-brown. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the potato mixture equally among 4 serving plates. Carve each pork fillet into slices and arrange the slices on top of the potatoes. Drizzle the pan juices and a splash of olive oil around the edge of each plate. Garnish with the thyme leaves."]}, {"isVegetarian": false, "title": "Marinated lamb chops with paneer", "url": "www_bbc_co_uk_food_recipes_marinated_lamb_chops_24406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints full-fat milk", "2 tbsp lemon juice", "5 large onions, thinly sliced ", "6 tomatoes, roughly chopped", "600ml/1 pint plain yoghurt ", "100g/3½oz fresh root ginger, grated", "8 garlic cloves, grated", "1 tbsp garam masala", "1 tbsp ground cumin", "1–2 tsp chilli powder, to taste", "2 tsp smoked paprika", "2 tsp ground turmeric", "1 tbsp runny honey", "1 unwaxed lemon, juice and finely grated zest", "12 lamb chops", "3 tbsp vegetable oil", "1 dried chilli ", "½ tsp cumin seeds", "5cm/2in piece fresh root ginger, thinly shredded", "3 small onions, thinly sliced", "1 fresh green chill, chopped", "1 tsp salt", "½ tsp ground turmeric", "1½ tsp chilli powder ", "200g/7oz cauliflower, cut into florets", "250g/9oz paneer (from above), cut into 2.5cm/1in cubes", "4 tomatoes, seeds removed, cut into strips", "½ tsp ground cumin", "½ tsp garam masala"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the paneer, line a large sieve with a double layer of muslin cloth. ", "Heat the milk in a large saucepan over a low heat for about 20 minutes, until it comes to the boil. This must be done slowly. As it starts to bubble add 1 tablespoon lemon juice. When the milk starts to split, remove from the heat, add the rest of the lemon juice and stir until the liquid separates from the curds. ", "Pour the mixture into the lined sieve and leave the whey to drain away. Run some cold water over the curd to rinse off any excess whey, then bring the muslin together and squeeze to remove any moisture. ", "Place into a plastic container, place another plastic container on top and use heavy weights such as tins of tomatoes to weigh it down. Leave for 2 hours to set. ", "For the lamb chops, combine all the ingredients apart from the lamb in a bowl. Coat the chops with the marinade, cover and set aside. ", "For the cooked paneer, heat the oil in a saucepan over a medium heat. Fry the chilli, cumin seeds and ginger for 1 minute. Add the onions, green chilli and salt and fry for 5 minutes, or until the onions are soft but not coloured. Add the turmeric, chilli powder and cauliflower and fry for 4 minutes. Lower the heat and add the paneer and tomatoes and cook for 5 minutes. Stir in the ground cumin and garam masala and set aside. ", "For the lamb chops, heat a large griddle pan over a high heat. Cook the chops for 2–3 minutes on each side, depending on how you like your lamb cooked. ", "Place the cooked paneer and cauliflower in the centre of a large serving platter, top with the lamb chops and serve. "]}, {"isVegetarian": false, "title": "Marinated lamb neck with roasted potatoes and tomatoes", "url": "www_bbc_co_uk_food_recipes_marinated_lamb_neck_with_87366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, finely chopped", "½ tbsp smoked Spanish paprika", "1 tbsp honey ", "5 tbsp olive oil, plus extra to serve", "pinch fresh oregano", "4 x 250-350g/9-12oz lamb neck fillets", "600g/1lb 5oz ripe tomatoes on the vine, halved", "4 garlic cloves, skin on", "olive oil, for drizzling", "1 banana shallot, finely chopped", "2 sprigs thyme ", "250ml/9fl oz chicken stock", "2 waxy potatoes, such as desirée, peeled and sliced into 6–8mm thick rounds", "½ large red pepper, sliced", "1 green pepper, sliced", "olive oil, for roasting", "1 red onion, sliced", "2 fat garlic cloves, thinly sliced", "1 fresh bay leaf", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the lamb, mix all the ingredients, except the lamb, to make a paste. Rub all over the lamb and leave to marinate in the fridge for at least 12 hours.", "When ready to cook, preheat the oven to 190C/170C Fan/Gas 5.", "For the tomatoes, put the tomatoes on a baking tray with the garlic. Drizzle with lots of olive oil and season generously with salt and pepper. Roast for 45–60 minutes, or until the tomatoes are starting to caramelise. ", "Meanwhile for the potatoes, mix the potatoes, peppers, onion, garlic and bay leaf on a baking tray. Season with sea salt and plenty of black pepper. Pour over about 3 tablespoons olive oil and toss to coat the vegetables.", "Roast on the top shelf of the oven for 15 minutes, then turn the vegetables over. Return to the oven and roast for another 15 minutes, or until the potatoes are golden-brown and the other vegetables are tender and nicely caramelised all over.", "When the tomatoes are ready, heat a little olive oil in a saucepan and gently fry the shallot for 10 minutes. Tip in the roasted tomatoes. Squeeze the roasted garlic from their skins and add to the pan. Add the thyme and stock. Bring to the boil and simmer for 10 minutes.", "Heat a large ovenproof frying pan over a medium heat. Add the lamb necks and fry until golden-brown on all sides (you don’t need any oil in the pan as this will come from the marinade). Transfer to the oven for 2–4 minutes, or until medium-rare. Set aside to rest for 2 minutes.", "To serve, put the roasted potatoes and vegetables in the middle of warmed serving plates. Top with some of the tomatoes. Slice the lamb and arrange on top of the potatoes. Season with salt and pepper and drizzle with a little olive oil."]}, {"isVegetarian": false, "title": "Marinated prawns with roasted lemon mayonnaise and asparagus", "url": "www_bbc_co_uk_food_recipes_marinated_prawns_with_15688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large raw king prawns, shell removed", "1 red chilli, finely chopped", "1 lemon, zest and juice", "2 garlic cloves, crushed", "3 tbsp olive oil", "3 tbsp chopped fresh coriander", "16 asparagus spears, woody stems trimmed", "2 bunches watercress, leaves picked", "3 lemons, cut in half", "2 free-range egg yolks ", "1 tsp white wine vinegar", "1 tsp dijon mustard", "200ml/7fl oz rapeseed oil or light olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, mix the prawns, chilli, lemon zest and juice, garlic, two tablespoons of the olive oil and coriander in a bowl until combined. Marinade in the fridge for at least two hours.", "Heat a griddle pan until hot and griddle the prawns for 1-2 minutes on each side, or until pink and just cooked through.", "Blanch the asparagus for 1-2 minutes in a pan of boiling water, or until just tender. Drain and toss in the remaining olive oil then griddle on the griddle pan for 1-2 minutes.", "For the roasted lemon mayonnaise, heat a griddle pan until hot and griddle the lemon halves, cut-side down, for one minute. ", "Blend the egg yolks, vinegar and mustard into a food processor, then squeeze in the juice from one of the charred lemons and blend until well combined. While the motor is running, gradually add the oil. Continue until all the oil has been added and the mayonnaise has thickened. Season with salt and freshly ground black pepper", "To serve, arrange the asparagus on serving plates and top with the prawns. Place the watercress alongside and finish with a spoonful of lemon mayonnaise and half a griddled lemon."]}, {"isVegetarian": false, "title": "Marinated minty lamb kebabs", "url": "www_bbc_co_uk_food_recipes_marinated_minty_lamb_61532", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinated_minty_lamb_61532_16x9.jpg", "ingredients": ["1 garlic clove, crushed", "2 tbsp chopped mint", "1 tbsp ready-made mint sauce", "150g/5½oz low-fat natural yoghurt", "375g/13oz lean lamb, cubed", "400g/14oz wholegrain couscous", "2 small onions, cut into wedges", "1 green pepper, cored, deseeded and cut into wedges", "lemon wedges, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the garlic, mint, mint sauce and yoghurt in a bowl, add the lamb and stir well. Cover and leave to marinate in a cool place for 10 minutes.", "Meanwhile, place the couscous in a heatproof bowl, pour 500ml/18fl oz of boiling water over the couscous. Leave to stand until the liquid has been absorbed. Season with salt and pepper and fluff the couscous with a fork. Set aside. ", "Preheat the grill to a hot setting. ", "Thread the lamb and onion and pepper wedges on to 8 metal skewers and cook under the grill for 8-10 minutes, or until cooked through.", "Serve the kebabs with lemon wedges and the couscous."]}, {"isVegetarian": false, "title": "Marinated red mullet with okra and pea fritters and fried plantain", "url": "www_bbc_co_uk_food_recipes_marinated_red_mullet_00871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz okra, sliced", "10g/⅓oz red onion, finely chopped", "25g/1oz frozen peas, chopped", "1 tbsp roughly chopped flatleaf parsley", "pinch finely chopped garlic", "pinch ground cumin", "40g/1½oz plain flour, sieved", "¼ tsp baking powder", "1 free-range egg, beaten", "2 tbsp whole milk", "2 tbsp crème fraiche", "vegetable oil, for shallow frying", "salt and freshly ground black pepper", "100ml/3½fl oz vegetable oil, plus extra for shallow frying", "100ml/3½fl oz olive oil", "3 lemons, juice only", "1 orange, juice only ", "pinch sugar", "¼ tsp coriander seeds, crushed", "30g/1oz carrots, thinly sliced", "4 small red mullet fillets, scaled and pin-boned", "pinch saffron strands ", "1 green or yellow plantain, peeled and sliced ", "vegetable oil, for deep-frying", "40g/1½oz micro coriander ", "40g/1½oz micro red basil", "40g/1½oz baby watercress", "40g/1½oz nasturtium leaves", "40g/1½oz nasturtium flowers", "20g/¾oz okra, thinly sliced", "¼ red chilli (optional)", "¼ green chilli (optional)", "2 tbsp olive oil", "165g/6oz Greek-style plain yoghurt", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "To make the fritters, mix together the okra, red onion, peas, parsley, garlic and cumin. Add the flour and baking powder and mix well. Add the egg, milk and crème fraiche and season.", "Heat the oil in a large frying pan and fry tablespoons of the batter (you may need to do this in batches). Once golden-brown on both sides, remove from the pan and drain on a kitchen paper. Finish in the oven for 3–4 minutes.", "To make the red mullet, mix together the two oils, lemon juice, orange juice, sugar, coriander seeds and a little seasoning. Add the carrots and stir well. Place in a small saucepan over a medium heat and warm through to infuse. Set aside to cool. ", "Cut the mullet fillets in half and rub with a little saffron and salt. Heat a little oil in a frying pan and fry the fillets skin-side down for 5 minutes, or until the skin is crisp and golden-brown. Turn over and cook for a few seconds. (The fish should be slightly undercooked.).", "Drain the fillets on kitchen paper and place flesh-side down into the cooled marinating liquid for 5 minutes.", "Meanwhile, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in 1 minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Deep-fry the plantain for 2 minutes, or until golden-brown on the outside and soft on the inside. Drain on kitchen paper and season with a little salt.", "To serve, mix with the herbs, flowers, okra and chillies, if using, together. Leave to sit for 1 minute. Place the fritters on a serving plate. Drizzle with the olive oil and all but 1 tablespoon of the yoghurt. Put the marinated fish alongside with the fried plantain, remaining yoghurt and lemon wedges. "]}, {"isVegetarian": false, "title": "Marinated ribs with tomatillo salsa, guacamole and tortilla chips", "url": "www_bbc_co_uk_food_recipes_marinated_ribs_with_55287", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinated_ribs_with_55287_16x9.jpg", "ingredients": ["4 beef ribs, flanken cut to 1cm/½in thickness", "1 bunch of coriander, stalks and leaves finely chopped", "4 limes, juice only", "2 banana shallots, chopped", "4 tbsp olive oil", "1–2 tsp ground cumin", "½ tsp ground coriander", "3 garlic cloves, chopped", "1 jalapeño chilli, chopped ", "2 corn on the cobs, husks removed", "4 tomatillos (or green tomatoes), finely chopped", "1 garlic clove, finely chopped", "2 tbsp finely chopped coriander", "2 tbsp white wine vinegar", "pinch sugar", "pinch salt", "1 ripe avocado, flesh chopped", "½ green chilli, finely chopped", "½ red onion, very finely chopped", "lime juice, to taste", "2 tbsp chopped coriander", "6 corn tortillas", "2 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the ribs into a large tray and add the remaining ingredients, reserving half the chilli for the salsa, and stir to combine. Leave to marinade at room temperature for at least 1 hour.", "Meanwhile, for the salsa, place the corn onto a large griddle pan and cook until browned all over. Remove the kernels and place into a large bowl. Add the remaining ingredients with the reserved chilli and mix.", "For the guacamole, put all the ingredients into a pestle and mortar and pound to combine.", "For the tortilla chips, preheat the oven to 200C/180C Fan/Gas 6. Cut the tortillas into triangles, place on a baking tray and drizzle with the oil. Bake for 6–8 minutes.", "For the ribs, heat a large griddle pan over a high heat, add the ribs and cook on each side of 1–2 minutes. Warm through the left over marinade in a small saucepan over a medium heat.", "Place the cooked ribs, salsa, guacamole and tortilla chips onto a large serving plate. Drizzle the warm marinade over the ribs and serve."]}, {"isVegetarian": false, "title": "Marinated salmon gravalax", "url": "www_bbc_co_uk_food_recipes_marinated_salmon_78063", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz caster sugar", "25g/1oz fine salt", "2 lemons, peel removed with a peeler, then finely sliced into julienne", "½ filleted side of salmon, weighing about 500g/1lb 2oz, skinned and pin boned", "300ml/11fl oz olive oil", "10g chopped fresh dill ", "200g/7¼ Greek-style yoghurt", "1 tsp wholegrain mustard", "pinch salt", "10g/½oz muscovado sugar", "1 tsp lemon juice", "freshly grated horseradish, to taste", "1 cucumber", "1 tsp wine vinegar", "salt, to taste", "2 tbsp olive oil", "1 tsp wholegrain mustard ", "5g/¼oz chopped fresh dill", "2 slices rye bread", "olive oil, to taste", "pinch salt", "2 tbsp chopped fresh dill", "1-2 tbsp mixed micro leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the sugar, salt and lemon peel together in a small bowl.", "Lay the salmon in a shallow dish and sprinkle the marinade over.", "Leave to marinate for one hour and then rinse off under cold running water.", "Divide the fish into four portions. ", "Put the olive oil in a large frying pan and heat to 45C/113F using a kitchen thermometer to check. If you don't have a thermometer, place the pan onto the heat, then dip a spoon in after 30 seconds. Feel the spoon to check the heat of the oil – it needs to be just warm. Keep the oil on the heat and keep checking every 30 seconds until the oil feels warm. Add the salmon to the pan, turn off the heat and leave the salmon for about 15-20 minutes.", "Set aside to cool, then transfer to a plate and leave in the fridge until ready to serve. ", "For the mustard sauce, mix all ingredients together in a small bowl and chill until required.", "For the cucumber salad, peel the cucumber and slice it into 1cm/½in cubes.", "Mix the cucumber with the vinegar, salt, olive oil and mustard in a bowl and set aside to marinate.", "Add the dill just before serving.", "For the rye croûtons, drizzle the bread slices with olive oil and sprinkle with salt. ", "Heat a frying pan and fry the rye bread until browned all over. Remove from the heat and transfer to a plate to cool slightly before breaking up into rustic croûtons. Sprinkle with the chopped dill.", "Sprinkle the chopped dill over the salmon and serve it with the rye croûtons, mustard sauce, cucumber salad and mixed micro leaves to garnish."]}, {"isVegetarian": true, "title": "Marinated beetroot", "url": "www_bbc_co_uk_food_recipes_marinatedbeetroot_67843", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marinatedbeetroot_67843_16x9.jpg", "ingredients": ["650g/1lb 7oz raw beetroot", "500ml/17fl oz white or red wine vinegar", "2 litre/3½ pints water", "pinch of salt", "2 garlic cloves, sliced", "1 tbsp dried oregano", "1 red chilli, finely chopped", "500ml/17fl oz olive oil"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Wash and scrub the beetroot under cold running water. Place them in a saucepan with the vinegar, salt and water and bring to the boil. Reduce the heat, cover then pan and simmer for about 1¼ hours until the beetroot is tender. Meanwhile, combine all the marinade ingredients in a bowl and set aside.", "Once the beetroot is cooked, drain, place on a cloth and pat dry. Remove the skins with the help of the cloth. Cut into slices, place in the marinade and mix well. Leave for a day before serving. The beetroot will keep for several days in a covered container in the fridge but should be brought to room temperature before serving.", "Serve with some salami or air dried tuna."]}, {"isVegetarian": false, "title": "Barbecued marinated chicken breast with lime, coriander, ginger and chilli", "url": "www_bbc_co_uk_food_recipes_marinatedchickenbrea_86535", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch fresh coriander, chopped ", "100ml/3½fl oz olive oil", "2 limes, zest of one only and juice of both ", "20g/¾oz grated ginger", "2 garlic cloves, crushed", "1 fresh chilli, chopped", "smoked cayenne pepper, to taste (if unavailable, substitute smoked hot paprika)", "4 chicken breasts"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, place the chopped coriander, olive oil, lime zest and juice, ginger, garlic and chili into a bowl.", "Season, to taste, with cayenne pepper and whisk thoroughly. ", "Place the chicken breasts into a deep dish. Pour the marinade over the chicken, covering completely. Cover the dish and leave the chicken to marinate for three hours.", "Preheat the barbecue until the coals are white hot.", "Place the chicken breasts on the barbecue and cook for 15-25 minutes, or until cooked all the way through, turning occasionally."]}, {"isVegetarian": false, "title": "Marinated lamb chops with chargrilled field mushrooms and garlic butter", "url": "www_bbc_co_uk_food_recipes_marinatedlambchopswi_86536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "2 garlic cloves, peeled and sliced ", "large sprig fresh thyme", "large sprig fresh rosemary  ", "8 lamb chops ", "salt and freshly ground black pepper ", "150g/5½oz unsalted butter, softened", "2 garlic cloves, peeled and crushed", "1 tbsp fresh flatleaf parsley, chopped", "8 fresh field mushrooms, stalks removed", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinated lamb chops, pour three tablespoons of olive oil into a deep dish or tray and add the sliced garlic. ", "Rub the thyme and rosemary between your hands to help release the herbs' aromatic oils, before placing into the oiled dish.", "Place the lamb chops on top of the herbs and garlic before covering with the remaining tablespoon of olive oil. Cover and place into a fridge to marinate overnight.", "For the garlic butter, mix the butter and crushed garlic in a bowl with the parsley.", "For the field mushrooms, spoon the garlic butter mix into the underside of the mushrooms. Season with salt and freshly ground black pepper.", "Preheat a barbecue until the coals are white hot. (Alternatively, cook on a very hot griddle pan or under a high grill.)", "Remove the lamb chops from the marinade and drain off any excess oil. Season with salt and freshly ground black pepper. Place onto the barbecue with a sprig of rosemary over each chop and cook to your liking.", "Meanwhile, place the mushrooms onto the barbecue, buttered side up, and cook slowly.", "To serve, place the mushrooms and lamb chops onto a serving plate."]}, {"isVegetarian": false, "title": "Marinated lamb", "url": "www_bbc_co_uk_food_recipes_marinatedlamb_10898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb neck fillets, get them cleaned by your butcher", "200ml/7fl oz spicy fruit chutney", "50ml/1½fl oz apricot jam", "1 can cola", "2 tbsp masala paste", "2tsp tumeric", "2 heaped tbsp tamarind paste", "malden salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the marinade ingredients in a large bowl.", "Submerge the lamb in the marinade for 2 hours.", "Take the lamb out of the marinade and shake off any excess.", "Place the griddle pan or frying pan on the hob and drizzle with olive oil, ensure the pan is hot.", "Place the neck fillets in the pan and griddle for 8-10 minutes."]}, {"isVegetarian": false, "title": "Marinated mackerel diamonds", "url": "www_bbc_co_uk_food_recipes_marinatedmackereldia_65552", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 mackerel fillets ", "½ lemon ", "10 juniper berries, lightly crushed ", "1 sprig thyme, leaves only ", "1 quantity sweet-sour marinade ", "salt and freshly ground black pepper ", "400ml/14fl oz water ", "110g/4oz caster sugar ", "100ml/3½fl oz lemon juice ", "2 small licorice sticks, lightly crushed ", "4 star anise"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Pull out any pin bones from the mackerel using tweezers, cut the fillets into large diamonds and put them in a deep dish. ", "Cut the lemon half vertically through the middle, then slice it into thin semi-circles. Place these in between the mackerel diamonds, then scatter over the crushed juniper berries, salt, pepper and thyme. ", "Combine the water, sugar and lemon juice for the marinade in a saucepan and bring to the boil. Toss in the licorice sticks and star anise and simmer for 1 minute. ", "Pour the marinade over the mackerel diamonds while still hot. Cover with cling film and leave at room temperature until completely cold, then refrigerate for 2-3 hours depending on the size of the fish, a maximum of 2½ hours for small fillets, otherwise the consistency of the fish suffers. ", "Serve the mackerel straight from the dish, allowing everyone to season their own fish."]}]