[{"isVegetarian": false, "title": "Paul Hollywood’s mince pies", "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_mince_04604", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_mince_04604_16x9.jpg", "ingredients": ["375g/13oz plain flour", "250g/9oz butter, softened", "125g/4oz caster sugar, plus extra for sprinkling", "1 medium free-range egg", "2 x 400g/14oz jars mincemeat", "2 tangerines, zest grated and flesh chopped", "1 apple, finely diced"], "serves": "Makes 12 pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. To make the sweet pastry, rub the flour, butter, sugar and egg together with a splash of cold water until it just comes together as a dough. Do not over work the dough. Wrap the pastry in cling film and set aside to chill in the fridge while you make the filling. ", "To make the filling, turn the mincemeat out into a bowl, grate the zest of the tangerines into the mincemeat, then peel and chop the fruit. Throw the tangerine and apple pieces into the bowl and blend by hand.", "Roll out the pastry to a 3mm/1/8in thickness. With a round pastry cutter, cut out 6 x 9cm/3½in discs of pastry. Press the pastry into the muffin cups and fill each one with a good helping of the mincemeat mixture, so that it reaches three-quarters of the way up the side of the pastry-lined cup. ", "With a fluted pastry cutter, cut out 6 x 8cm/3¼ in pastry circles for the lids (slightly bigger than the top of the muffin cups). Place a lid on top of each pie and gently push down. Sprinkle with caster sugar. ", "Bake for 20 minutes, then transfer to a wire rack to cool. Dust with icing sugar and serve warm with fresh cream. "]}, {"isVegetarian": true, "title": "Paul Hollywood's scones", "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_scones_70005", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_scones_70005_16x9.jpg", "ingredients": ["500g/1lb 1oz strong white flour, plus a little extra for rolling out", "80g/3oz softened butter, plus a little extra to grease the baking tray", "80g/3oz caster sugar", "2 free-range eggs ", "5 tsp baking powder", "250ml/8½fl oz milk", "1 free-range egg, beaten with a little salt (for glazing)", "butter", "good-quality strawberry or raspberry jam", "clotted cream"], "serves": "Makes 8 large or 15 small scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C (200C fan assisted)/425F/Gas 7. ", "Lightly grease a baking tray with butter and line it with baking or silicone paper (not greaseproof).", "Put 450g/15½oz of the flour into a large bowl and add the butter. Rub the flour and butter together with your fingers to create a breadcrumb-like mixture.", "Add the sugar, eggs and baking powder and use a wooden spoon to turn the mixture gently. Make sure you mix all the way down to the bottom and incorporate all of the ingredients.", "Now add half of the milk and keep turning the mixture gently with the spoon to combine. Then add the remaining milk a little at a time and bring everything together to form a very soft, wet dough. (You may not need to add all of the milk.)", "Sprinkle most of the remaining flour onto a clean work surface. Tip the soft dough out onto the work surface and sprinkle the rest of the flour on top. The mixture will be wet and sticky.", "Use your hands to fold the dough in half, then turn the dough 90 degrees and repeat. By folding and turning the mixture in this way (called 'chaffing'), you incorporate the last of the flour and add air. Do this a few times until you’ve formed a smooth dough. If the mixture becomes too sticky use some extra flour to coat the mixture or your hands to make it more manageable. Be careful not to overwork your dough.", "Next roll the dough out: sprinkle flour onto the work surface and the top of the dough, then use the rolling pin to roll up from the middle and then down from the middle. Turn the dough by 90 degrees and continue to roll until it’s about 2.5cm/1in thick. ‘Relax’ the dough slightly by lifting the edges and allowing the dough to drop back onto the work surface.", "Using a pastry cutter, stamp out rounds from the pastry and place them onto the baking tray. Dip the edge of the pastry cutter in flour to make it easier to cut out the scones without them sticking. Don’t twist the cutter – just press firmly, then lift it up and push the dough out.", "Once you’ve cut 4 or 5 rounds you can re-work and re-roll the dough to make it easier to cut out the remaining rounds. Any leftover dough can be worked and rolled again, but the resulting scones won’t be as fluffy. ", "Place the scones on the baking tray and leave them to rest for a few minutes to let the baking powder work. Then use a pastry brush (or your finger if you don’t have a brush) to glaze them with the beaten egg and salt mixture. Be careful to keep the glaze on the top of the scones. (If it runs down the sides it will stop them rising evenly.)", "Bake the scones in the middle of the oven for 15 minutes, or until the scones are risen and golden-brown.", "Leave the scones to cool, then split in half and add butter, jam and clotted cream to serve. "]}, {"isVegetarian": true, "title": "Paul’s chocolate éclairs", "url": "www_bbc_co_uk_food_recipes_pauls_chocolate_clairs_59944", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["65g/2½oz plain flour, sifted", "pinch salt", "50g/2oz unsalted butter, diced, plus extra for greasing", "2 free-range eggs, beaten", "200ml/7fl oz whipping cream", "5 tsp icing sugar, sifted", "1 tsp vanilla extract", "100g/3½oz milk chocolate, chopped"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Generously grease a baking tray with butter.", "Sift the flour onto a sheet of greaseproof paper. ", "Put 120ml/4fl oz water into a medium-sized pan with the salt and butter and heat gently until the butter has completely melted – don’t let the water boil and begin to evaporate. Quickly bring the mixture to the boil and tip in all the flour in one go. Remove the pan from the heat and beat furiously with a wooden spoon – don’t worry, the mixture will look messy at first but will soon come together to make a smooth heavy dough.", "Put the pan back on a low heat and beat the dough for about a minute to slightly cook the dough – it should come away from the sides of the pan to make a smooth, glossy ball. Tip the dough into a large mixing bowl and leave to cool until tepid. ", "Beat the eggs in a bowl until combined, then gradually beat them into the dough with an electric whisk or mixer, or a wooden spoon, beating well after each addition. (You may not need all the egg.) The dough should be very shiny and paste-like, and fall from a spoon when lightly shaken.", "Spoon the pastry into a piping bag fitted with a 1.25cm/½in plain nozzle and pipe 12 x 10cm/4in lengths onto the greased baking tray. ", "Sprinkle the tray, not the pastry, with a few drops of water, and bake in the oven for 15 minutes. Then, without opening the door, reduce the oven temperature to 170C/325F/Gas 3 and bake for 10 minutes, or until golden-brown and crisp.", "Remove the tray from the oven and carefully make a small hole in the side of each éclair to allow steam to escape. Return to the oven and bake for a further five minutes, or until the pastry is completely crisp. Remove from the oven and transfer to a wire rack to cool.", "For the filling, whip the cream with the sugar and vanilla extract in a bowl until just stiff. ", "Once the éclairs have cooled, cut down the length of one side of each éclair and pipe in the whipped cream.", "Melt the chocolate over a double boiler or a bowl suspended over a pan of simmering water (do not allow the bottom of the bowl to touch the water) and allow it to cool slightly. Dip the tops of the éclairs in the chocolate and let the chocolate set before serving."]}, {"isVegetarian": true, "title": "Flaounes", "url": "www_bbc_co_uk_food_recipes_pauls_flaounas_89782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_flaounas_89782_16x9.jpg", "ingredients": ["500g/1lb 2oz pecorino romano cheese (or a vegetarian alternative)", "250g/9oz halloumi cheese", "75g/2½oz plain flour", "90g/3¼oz fine semolina  ", "7g instant yeast", "2 tsp dried mint", "100g/3½oz sultanas", "4 large free-range eggs ", "4 tbsp milk", "1 tsp baking powder \t\t", "750g/1lb 10oz strong plain flour, plus extra for flouring", "1 tsp mastic powder (a plant resin used in baking, available from specialist stores online)", "2 tsp ground mahlepi, also known as mahleb (a Greek spice made from the ground stone of the St Lucie cherry)", "1 tsp caster sugar", "1 tsp salt ", "7g instant yeast ", "60g/2¼oz unsalted butter, softened", "450ml/16fl oz full-fat milk", "200g/7oz sesame seeds ", "dash of white wine vinegar ", "3 free-range egg yolks, lightly beaten"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the filling, grate the pecorino romana and halloumi into a large bowl. In a separate bowl, mix the plain flour, semolina, yeast, dried mint and sultanas together. Beat the eggs and milk together in a jug. ", "Tip the flour mixture over the cheese and pour over the egg mixture. Mix together with your hands. Cover and leave to stand while you make the pastry.  ", "For the pastry, tip the flour, mastic powder and mahlepi into a mixing bowl. Add the sugar and salt to one side of the bowl and the yeast to the other. Add the butter into the centre of the flour with 350ml/12fl oz of the milk. Combine the ingredients to form a soft dough. Gradually add the remaining milk - you may not need it all. ", "Place onto a floured surface and knead until smooth. Place back in the bowl, cover and leave to rest for 1 hour.  ", "For the glaze, place the sesame seeds, vinegar and enough water to cover in a small saucepan and bring to boil. Drain well and spread the seeds over a clean tea towel to dry.", "Preheat the oven to 200C/180C Fan/Gas 6. Line 3 baking trays with non-stick baking parchment. ", "Divide the pastry into large pieces and roll out on a lightly floured work surface until about 3mm/⅛in thick. Using a saucer as a template, cut into 12 x 15cm/6in rounds. Firmly press one side of the pastry rounds into the sesame seeds to coat.   ", "To finish the filling, add the baking powder to the filling mixture and divide the filling into 12. Place one portion of filling into the centre of each dough circle and fold in 3 sides to make a rounded triangle shape, leaving a gap in centre with the filling exposed.", "Place the flaounes on the baking trays, brush the tops with the beaten egg yolk and bake for 15 minutes. Reduce the oven temperature to 180C/160C Fan/Gas 4 and bake for a further 15 minutes, or until golden-brown and puffed up. Serve hot or cold."]}, {"isVegetarian": true, "title": "Paul’s Kanellängd", "url": "www_bbc_co_uk_food_recipes_pauls_kanellngd_49838", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_kanellngd_49838_16x9.jpg", "ingredients": ["75g/2¾oz unsalted butter, melted", "250ml/9fl oz full-fat milk, warmed ", "450g/1lb strong plain bread flour, plus extra for dusting", "1 tsp ground cardamom", "5g salt", "7g packet instant yeast", "40g/1½oz caster sugar", "½ free-range egg, beaten (approximately 1½ tbsp)", "75g/2¾oz unsalted butter, softened", "1 tsp vanilla paste", "1 tbsp ground cinnamon", "75g/2¾oz caster sugar", "½ free-range egg, beaten, (approximately 1½ tbsp), for brushing", "100g/3½oz caster sugar", "150g/5½oz icing sugar", "1 satsuma, finely grated zest only"], "serves": "Makes 1 large loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter and gently warm the milk in a saucepan. ", "Tip the flour and cardamom into a large mixing bowl and add the salt to one side of the bowl and the yeast to the other. Add the butter, milk, sugar and egg and turn the mixture round with your fingers. Continue to mix until you have picked up all the flour from the sides of the bowl. Use the mixture to clean the inside of the bowl and keep going until you have a soft dough.", "Tip the dough onto a lightly floured surface and begin to knead. Keep kneading for 10–12 minutes. Work through the initial wet stage until the dough starts to form a soft, smooth skin. When your dough feels smooth and silky, put it into a lightly oiled bowl. Cover and leave to rise for 30–40 minutes, until doubled in size.", "While the dough is rising, make the filling. Cream the butter and vanilla paste together in a bowl until soft and spreadable. In a separate bowl mix the cinnamon and sugar together.  ", "Line a baking sheet with baking paper. Turn the dough onto a lightly floured surface and knock it back. Roll out the dough into a rectangle, about 25x35cm/10x14in. Turn the dough 90 degrees if necessary, so you have a long edge facing you. Tack the back edge to the work surface, pushing down with your fingers, sticking the dough to the work surface.", "Spread the butter mixture evenly over the dough and sprinkle with the cinnamon sugar. Roll up the dough tightly like a Swiss roll, using the tacked edge to create tension. Place on the prepared tray.  ", "Using a clean pair of sharp scissors, cut the roll into 15 slices (approximately 2cm/¾in each) almost all the way through. Pull each slice out to alternate sides and press down gently with your hands. Put the tray inside a clean plastic bag and leave to prove for 20–25 minutes, or until the dough springs back if you prod it lightly with your finger. Do not over prove.", "For the sugar syrup, tip the sugar and 100ml/3½fl oz water into a small pan and bring to the boil stirring until the sugar has melted. Boil until reduced by half. ", "Preheat the oven to 220C/200C Fan/Gas 6. Brush the loaf with beaten egg and bake for 20–25 minutes until risen and golden-brown. Cover with aluminium foil after 10 minutes if it's browning too quickly. ", "For the icing, mix the icing sugar with enough water to make a thin icing, then stir in the satsuma zest.  ", "Place the loaf on a wire rack to cool.  Brush with the sugar syrup then drizzle over the icing. Leave to cool completely.  "]}, {"isVegetarian": true, "title": "Paul’s kransekake", "url": "www_bbc_co_uk_food_recipes_pauls_kransekake_83354", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_kransekake_83354_16x9.jpg", "ingredients": ["500g/1lb 2oz ground almonds", "500g/1lb 2oz icing sugar, sifted", "4 free-range egg whites, lightly whisked", "1 tsp almond extract", "vegetable oil, for greasing", "semolina, for dusting", "plain flour, for dusting", "3 free-range egg whites", "600g/1lb 5oz icing sugar, sifted", "few drops red food colouring, or pea-sized piece red food colouring paste", "red, green and silver edible glitter (available online or from specialist retailers)"], "serves": "Makes 1 large kransekake", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the ground almonds and icing sugar in a large electric mixer. Add the egg whites and almond extract and mix with a dough hook. This could be done by hand but is easier with a mixer due to the large quantities.  Cover the bowl with cling film and chill in the fridge for a minimum of two hours, or preferably overnight.", "Preheat the oven to 200C/400G/Gas 6. ", "Lightly brush the insides of the kransekake moulds with vegetable oil. Sprinkle a little semolina into each mould and tip the moulds to distribute the semolina evenly around the inside, shaking out any excess.", "Divide the chilled dough into six equal-sized pieces. ", "Divide one of the pieces of dough into three different-sized pieces: one small, one medium and one large. Dust a work surface lightly with flour and roll each piece out into finger-width lengths that are long enough to wrap round the kransekake moulds. ", "Fit the longest piece of dough inside the largest kransekake ring, pressing the ends together to seal. Do the same with the medium-sized and smallest pieces of dough. Repeat this process with the remaining five pieces of dough. ", "Bake the kransekakes in the oven for 8-10 minutes, or until golden-brown, then remove from the oven and set aside to cool in their moulds until hardened. Transfer to a wire rack to cool completely.", "Meanwhile, for the icing, whisk the egg whites in a large bowl until frothy. Gradually whisk in the icing sugar a spoonful at a time, until stiff, glossy peaks form when the whisk is removed. ", "Spoon half of the icing into a separate bowl and add the red food colouring. Whisk until the icing is bright red, then spoon the icing into a piping bag fitted with a small plain writing nozzle. Spoon the white icing into a separate piping bag fitted with a small plain writing nozzle.", "To assemble the kransekake, sort the cooked rings into size order. ", "Pipe a few dots of white icing onto the base of the largest ring and stick it to a large serving plate. ", "Pipe zig-zag patterns onto the largest ring using first the white, then the red icing, overlapping the two. Sprinkle with red, green and silver edible glitter.", "Place the second-largest ring on top of the largest ring and repeat the icing and decorating process. ", "Continue to stack the rings in decreasing size order until you have a tower of 18 iced and glittery rings. Allow the icing to set (this will stick the rings to each other), then serve."]}, {"isVegetarian": true, "title": "Mincemeat and marzipan couronne", "url": "www_bbc_co_uk_food_recipes_pauls_mincemeat_and_33176", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_mincemeat_and_33176_16x9.jpg", "ingredients": ["250g/9oz strong white bread flour, plus extra for dusting", "5g salt", "8g instant yeast", "50g/1¾oz unsalted butter, softened, plus extra for greasing", "135ml/4½fl oz whole milk", "1 free-range egg, lightly beaten", "90g/3¼oz caster sugar", "140g/5oz icing sugar, plus extra for dusting", "220g/7¾oz ground almonds", "1 orange, finely grated zest only", "1 free-range egg, beaten", "400g/14oz ready-made mincemeat", "50g/1¾oz apricot jam", "200g/7oz icing sugar", "50g/1¾oz pistachios, cut into slivers", "25g/1oz glacé cherries, roughly chopped"], "serves": "Serves 12", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the couronne, tip the flour into a large mixing bowl, then add the salt to one side of the bowl and the yeast to the other. Add the butter, milk and egg and stir the mixture with your fingers until it comes together as a dough. Continue mixing until the sides of the bowl are clean and the dough is soft.", "Turn out the dough onto a lightly floured surface and knead for 5-6 minutes, or until the dough has stopped feeling sticky and has a smooth, silky exterior. Return the dough to the bowl, cover with cling film and set aside to prove in a warm room for at least 30 minutes and up to one hour. ", "For the marzipan, mix the caster sugar, icing sugar and ground almonds together in a large bowl, then stir in the orange zest and beaten egg and mix again until the ingredients are well combined and have come together as a thick paste.", "Turn out the paste onto a work surface lightly dusted with icing sugar, then knead until smooth. Roll the marzipan into a ball, then wrap in cling film and chill until needed.", "When the couronne dough has about doubled in size, turn it out onto a lightly floured surface. Without knocking it back, roll out the dough into a rectangle 33x25cm/13x10in in size. ", "Turn the dough rectangle so that the long edge is facing you. Spread an even layer of mincemeat all over the dough. ", "Turn out the marzipan onto a lightly floured work surface and roll it out to a rectangle similar in size to the dough. Lay the marzipan over the mincemeat. ", "Roll the dough tightly like a Swiss roll, then cut the roll almost in half lengthways, all the way through. Twist the two lengths of dough together in a spiral, then join the ends to form a ring. ", "Line a baking tray with baking parchment, then place the couronne onto it and set aside to prove again for a further 30-60 minutes, or until the dough springs back quickly when lightly prodded. ", "When the couronne has proved, preheat the oven to 210C/425F/Gas 7.", "Bake the proved couronne for 20-25 minutes, or until risen and golden-brown. Transfer to a wire rack to cool. ", "While the couronne is cooling, heat the apricot jam with a splash of water in a small pan over a medium heat until runny. Pass through a sieve to remove any pieces of fruit, then brush the sieved jam all over the warm couronne to glaze. Set aside to cool completely.", "Just before serving, in a bowl mix the icing sugar with enough water to form a thin, runny icing (1-2 tablespoons of water). Drizzle or brush the icing over the couronne, then sprinkle over the pistachio slivers and chopped cherries."]}, {"isVegetarian": true, "title": "Paul’s mum’s ginger biscuits", "url": "www_bbc_co_uk_food_recipes_pauls_mums_ginger_72428", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_mums_ginger_72428_16x9.jpg", "ingredients": ["110g/4oz margarine, plus extra for greasing", "110g/4oz caster sugar", "110g/4oz golden syrup", "225g/8oz self-raising flour, plus extra for dusting", "2 tsp ground ginger"], "serves": "Makes 40 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and grease a baking tray.", "Melt the margarine, caster sugar and golden syrup gently in a pan over a medium heat. Once melted, remove from the heat and cool slightly. Add all of the dry ingredients to the pan to make a dough.", "Once cool enough to handle, with floured hands, roll the dough into 50p-size balls. Place these individual balls onto the greased baking tray with enough room between each biscuit to allow them to spread during cooking. Mark the top of each ball with a fork. The dough should make about 30 biscuits.", "Put the baking tray into the oven for about 10 minutes, or until the biscuits are golden-brown.", "Remove from the oven, leave to cool slightly and transfer to a wire rack to cool completely."]}, {"isVegetarian": true, "title": "Paul’s mum’s jam tarts", "url": "www_bbc_co_uk_food_recipes_pauls_mums_jam_tarts_68845", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_mums_jam_tarts_68845_16x9.jpg", "ingredients": ["85g/3oz unsalted butter or margarine", "170g/6oz self-raising flour, plus extra for dusting", "20 tsp jam, or to taste"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub together the butter or margarine with the flour in a bowl until it resembles breadcrumbs. Stir in a few tablespoons of water to form a dough.", "Roll out on a lightly floured surface. Use a pastry cutter to cut out about 15 circular shapes.", "Put each pastry case into an individual cupcake tray. Add a teaspoon of jam to each case – not too much or it will ooze everywhere.", "If there is any leftover pastry, re-roll it and cut smaller shapes, either circles or stars, and put over the jam to act as the lids.", "Put the tray of tarts into the oven and cook for about 30 minutes, or until the pastry has gone pale brown (check the tarts after 20 minutes)."]}, {"isVegetarian": false, "title": "Paul’s sausage rolls", "url": "www_bbc_co_uk_food_recipes_pauls_sausage_rolls_55041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "½ tsp salt", "200g/7oz butter, chilled and cubed ", "180ml/6fl oz chilled water", "½  lemon, juice only", "2 onions, sliced", "2 tbsp caster sugar", "2 tbsp balsamic vinegar", "600g/1lb 5oz sausagemeat", "1 tbsp chopped fresh thyme", "salt and freshly ground black pepper ", "1 free-range egg, beaten"], "serves": "Makes 6 sausage rolls", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Sift the flour and salt into a large bowl and add the butter. Mix the butter around with a large metal spoon to coat it in flour. Be careful to keep the butter in lumps.", "Mix the water and lemon juice together in a jug and gradually pour it into the flour and butter mixture.", "Using a round-tipped knife, cut across the contents of the bowl several times, turning the bowl continuously as you chop the butter into the flour, until the dough comes together. The dough is very wet at this point. ", "Tip it onto a lightly floured work surface and quickly shape it into a rectangle about 30cmx20cm/12inx8in.  With the pastry vertically on the board, fold the bottom third of the pastry up onto the middle third, then the top third down onto the other thirds.  Wrap in cling film and chill for 10 minutes.  ", "Bring the pastry out of the fridge and with the folded edge to the sides, roll the pastry again into the same proportions as the original narrow rectangle and fold in the same way again. Chill again.  Repeat this twice more. After the last folding stage, wrap the pastry in cling film and chill in the fridge for two hours.", "For the onion chutney, place the onions, caster sugar and balsamic vinegar into a medium saucepan. Cook gently, over a low heat, stirring occasionally, for 15 – 20 minutes or until the onions are soft, translucent and lightly caramelised.", "Place the sausagemeat, chopped thyme, salt and freshly ground black pepper into a large bowl and mix thoroughly.", "When the pastry is ready to use, if it is very firm, allow it to warm in the room for a few minutes.", "Pre-heat oven to 220C/425F/Gas 7.  Cover a large baking sheet with baking parchment.", "Place the pastry onto a lightly floured board and roll out to a rectangle about 36cmx30cm/15inx12in. Cut into 6 even rectangles measuring about 12cmx15cm/5inx6in. ", "On the short side of each small rectangle place a cylinder of seasoned sausage meat weighing about 100g/3½oz.  Spread some onion chutney onto the remaining pastry. ", "Wet the short edge of the pastry with a little water and roll up the sausagemeat in the pastry. Place onto the lined baking sheet with the seam underneath.  Repeat with the remaining sausagemeat and pastry.", "Glaze each sausage roll with the beaten egg.  Diagonally slash each sausage roll on the top seven times.", "Cook for 30 - 35 minutes or until the pastry is golden-brown and the sausage is cooked through. Eat warm or cold."]}, {"isVegetarian": true, "title": "St Lucia buns", "url": "www_bbc_co_uk_food_recipes_pauls_st_lucia_buns_04825", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_st_lucia_buns_04825_16x9.jpg", "ingredients": ["250ml/9fl oz milk", "1 tsp saffron threads", "50g/1¾oz unsalted butter", "500g/1lb 2oz strong white bread flour, plus extra for dusting", "1 tsp salt", "1 x 7g sachet instant yeast", "50g/1¾oz caster sugar", "100g/3½oz quark cheese", "vegetable oil, for greasing (optional)", "1 free-range egg yolk, for glazing", "24 raisins"], "serves": "Serves 12", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the milk in a small saucepan over a low heat until gently steaming. Remove the pan from the heat, add the saffron threads and butter and set aside for 10 minutes, or until the saffron has infused the milk and the milk has cooled slightly. ", "Tip the flour into a large mixing bowl, then add the salt to one side of the bowl and the yeast to the other. Add the sugar.", "Strain the saffron-infused milk over the bowl of flour, then add the quark. Stir the mixture using your fingers until it comes together as a soft dough and the sides of the bowl are clean.", "Turn out the dough onto a lightly floured work surface and knead for 5-6 minutes, or until the dough is no longer sticky and has a smooth, silky exterior. Transfer the dough to a lightly oiled bowl, cover the bowl with cling film and set aside in a warm place for 1½-2 hours, or until the dough has doubled in size. ", "Brush two baking sheets with vegetable oil or dust with flour.", "When the dough has proved, knock it back, then divide into 12 equally-sized pieces. Roll the pieces of dough into 30cm/12in-long sausage shapes. ", "Bend four of the pieces of dough into S-shapes, coiling each end of the S-shape tightly like a scroll. Place onto one of the prepared baking trays.", "Shape another four pieces of dough into S-shapes, but this time just tuck the ends of the S-shapes back on themselves rather than coiling them tightly. Place two of the S-shapes on one of the prepared baking trays, and place the other two on top of them to create cross shapes.  ", "The remaining pieces of dough can be shaped into traditional animal shapes including oxen, cats and birds - alternatively, bend them into S-shapes as before.", "Cover the dough shapes loosely with cling film and set aside to prove again for 30-45 minutes, or until they have doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.  ", "Brush the dough shapes all over with a little of the beaten egg yolk, then garnish each shape with two raisins (for the S-shaped buns, place the raisins in the centre of each coil of dough). ", "Bake the buns in the oven for 12-15 minutes, or until lightly golden-brown and cooked through. Set aside to cool on a wire rack."]}, {"isVegetarian": false, "title": "Paupiette of sole with wild mushrooms and herb sauce", "url": "www_bbc_co_uk_food_recipes_paupiette_of_sole_with_48945", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz salmon fillets, skinned and pin-boned, cut into pieces", "pinch salt", "1 small free-range egg white", "155ml/5fl oz double cream", "pinch cayenne pepper", "½ unwaxed lemon, finely grated zest only", "1 tbsp finely chopped fresh chives", "1 tbsp finely chopped fresh flatleaf parsley", "3 fillets Dover sole, pin-boned ", "250ml/9fl oz fish stock", "50ml/2fl oz dry white wine", "½ shallot, finely chopped", "knob of butter", "50g/1¾oz wild mushrooms, preferably chanterelles, torn up if large", "micro watercress", "salt and freshly ground black pepper", "3 tbsp double cream", "80g/2¾oz unsalted butter, cut into pieces", "1 tbsp chopped fresh flatleaf parsley", "1 tbsp chopped fresh chives", "lemon juice, to taste"], "serves": "Serves 3", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Blend the salmon with the salt in a food processor for 1–2 minutes, scrapping down the sides often. Add the egg white and blend for 20 seconds. Add half the cream gradually, blending all the time, until you have a smooth mousse. Put in a bowl and place over ice. Mix in the remaining cream, cayenne, lemon zest and herbs. Refrigerate for 10 minutes.", "Flatten the sole fillets slightly. Score the flesh side several times using a sharp knife. Season and spread the mousse all over, then roll up and secure with toothpicks. Refrigerate for at least an hour.", "Preheat the oven to 160C/140C Fan/Gas 3. ", "Put the fish rolls in an ovenproof pan with the stock, wine and shallot. Bring to a gentle simmer, then cover with a lid or buttered greaseproof paper. Bake for 7–8 minutes, remove and leave to rest in a warm place for 4–5 minutes.", "For the sauce, strain the cooking liquid into a clean pan and cook over a high heat until reduced to a sauce consistency. Add the double cream and gradually whisk in the butter. Stir in the herbs and lemon juice to taste. Keep warm. ", "Heat a knob of butter in a frying pan. When foaming, add the mushrooms and cook quickly, then drain. ", "Divide the sole fillets between warm plates, scatter over the mushrooms and spoon over the sauce. Top with the watercress and serve. "]}, {"isVegetarian": true, "title": "Tropical pavlova", "url": "www_bbc_co_uk_food_recipes_pavlova_2949", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pavlova_2949_16x9.jpg", "ingredients": ["8 large egg whites (at room temperature) ", "pinch of salt ", "350g/12oz caster sugar ", "2 tsps/10g cornflour ", "pinch of cream of tartar ", "1 tsp/5ml white wine vinegar ", "4 drops vanilla essence ", "300ml/½pint double cream, firmly whipped ", "selection of prepared tropical fruit e.g. mango, pineapple, passion fruit."], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas4. Line a baking tray with greaseproof paper. Draw a 20cm/8inch circle on the paper. ", "Whisk the egg whites with half the sugar and the salt in a clean bowl until soft peaks form. Continue beating while adding the remaining sugar until stiff and shiny. Sprinkle over the cornflour, cream of tartar, vinegar and vanilla essence and fold in gently with a metal spoon. ", "Mould the egg white mix onto the paper within the circle. Flatten the top and smooth the sides. Place in the oven and immediately reduce the heat to 150C/300F/Gas 2 and cook for 1¼ hours. ", "Turn off the oven, leave the door slightly ajar and allow to cool completely. Invert 'Pav' onto a plate, gently push down the meringue then pile on the cream and dress with the tropical fruit."]}, {"isVegetarian": true, "title": "Pavlova", "url": "www_bbc_co_uk_food_recipes_pavlova_53849", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pavlova_53849_16x9.jpg", "ingredients": ["4 large free-range egg whites", "225g/8oz caster sugar", "½ tsp vanilla extract", "1 tbsp cornflour", "400ml/14fl oz double cream", "400g/14oz strawberries, hulled, halved if large", "200g/7oz raspberries", "150g/5oz blueberries", "3 passion fruit (optional)", "Cape gooseberries (optional)", "mint sprigs, to decorate", "sifted icing sugar, to decorate"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Place a 25cm/10in dinner plate on a sheet of baking parchment and draw around it. Turn the paper over, and set to one side.", "Put the egg whites in a large, clean bowl and whisk with an electric whisk until stiff but not dry. They are ready when you can turn the bowl upside down without the eggs sliding out.", "Gradually whisk in the sugar, a tablespoon at a time, whisking for a few seconds between each addition. Adding the sugar slowly helps to build up volume in the meringue and make it stiff and shiny. Finally, whisk in the vanilla extract and cornflour until well combined.", "Dab a small amount of the meringue in the corners of a large, sturdy baking tray or sheet. Position the baking parchment, drawn side down, on the baking sheet, using the meringue dabs to secure it to the tray.You should be able to see the circle through the paper.", "Spoon the meringue into the circle and shape with the back of a serving spoon or rubber spatula to create a large meringue nest, with soft peaks rising on all sides. Place in the centre of the oven and bake for 1 hour until very lightly coloured and crisp on the outside. (If the meringue seems to be becoming too brown, reduce the temperature of the oven). After 1 hour, turn the oven off and leave the meringue for a further hour.", "Remove from the oven and leave to cool completely.", "Up to 2 hours before serving, carefully release the meringue from the baking parchment, using a spatula if necessary, and place onto a large serving plate. Whip the cream until soft peaks form and spoon into the centre of the meringue. Top with the strawberries,  raspberries and blueberries, and the gooseberries if using. Cut the passion fruit and scrape the pulp over. ", "Decorate with sprigs of mint and dust with sifted icing sugar to serve. "]}, {"isVegetarian": true, "title": "Pea and goats’ cheese risotto", "url": "www_bbc_co_uk_food_recipes_pea_and_goats_cheese_26536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre vegetable stock (made with a stock cube)", "50g/1¾oz butter", "1 onion, finely diced", "300g/10oz risotto rice", "200g/7oz frozen peas, defrosted", "125g/4½oz soft goats’ cheese", "salt and black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Keep the stock warm in a pan over a low heat while you prepare the rest of the risotto.", "Heat a large heavy-based saucepan over a medium heat. Add the butter and, once melted, add the onion along with a pinch of salt. Cook gently until the onion is softened and translucent. Turn up the heat a little and stir in the risotto rice, making sure each grain is coated in the melted butter. Cook the rice for 1-2 minutes, or until the grains become translucent at the outer edges.", "Pour in a ladleful of stock and stir to mix into the rice. Reduce the heat slightly to medium. Once the stock is absorbed add another ladleful and repeat, waiting for the stock to absorb before adding more. Stir continuously.", "Once three quarters of the stock has been incorporated, taste and check the rice. It should be soft but retaining a slight bite. Continue to add the remaining stock if it’s not quite cooked. Once ready, stir in the defrosted peas and reduce the heat to low. Mix well and leave to stand for 2-3 minutes to warm the peas through. Taste and adjust the seasoning as necessary.", "Just before serving, dot the risotto with three quarters of the goats’ cheese giving it a stir to slightly mix the cheese through. Serve hot with the remaining goats’ cheese dotted over the top."]}, {"isVegetarian": false, "title": "Pea and ham soup", "url": "www_bbc_co_uk_food_recipes_pea_and_ham_soup_55777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 banana shallots, peeled and finely chopped", "1 garlic clove, finely diced", "400g/14oz frozen peas", "350ml/12fl oz ham stock", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "125g/4½oz shredded ham hock", "4 tbsp crème fraîche", "small handful baby watercress", "small handful pea shoots", "2 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a saucepan until hot. Add the butter, shallots and garlic and gently fry for two minutes, or until the shallots have softened. Add the peas and stock and bring to the boil. Reduce the heat and simmer for 2-3 minutes.", "Cool slightly and then transfer to a blender. Add the cream and blend to a purée. Return the mixture to the saucepan to heat through, then season to taste with salt and freshly ground black pepper.", "To serve, pour the soup into serving bowls and top with a spoonful of shredded ham and crème fraîche. Top with some baby watercress and pea shoots and finish with a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Pea and pancetta soup", "url": "www_bbc_co_uk_food_recipes_pea_and_pancetta_soup_82240", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pea_and_pancetta_soup_82240_16x9.jpg", "ingredients": ["1 litre/1¾ pints chicken stock", "500g/1lb 2oz frozen peas", "10g/½oz fresh tarragon leaves", "pinch salt", "4 very thin slices pancetta (cut on the thinnest possible setting)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the chicken stock in a saucepan until it is simmering. Add the peas and simmer for 2 minutes, or until just tender. Stir in the tarragon and salt.", "Transfer the mixture to a food processor and blend for a few short blasts to a rough-textured soup. Return the soup to the saucepan and keep warm over a low heat.", "Using a pair of tongs, heat each slice of pancetta over the gas flame of your hob for a few seconds until it crisps up. (Alternatively, preheat your grill to its highest setting, lay the slices of pancetta onto a baking tray and grill for 1-2 minutes, or until crisp.)", "To serve, ladle the soup into bowls. Break the crisp pancetta into pieces and sprinkle on top of the soup. "]}, {"isVegetarian": true, "title": "Pea hummus", "url": "www_bbc_co_uk_food_recipes_pea_hummus_74694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz fresh peas", "2 tbsp tahini", "1-2 tbsp freshly squeezed lime juice", "¼ tsp ground cumin", "pinch salt, or to taste", "2 tbsp chopped fresh coriander ", "1-2 spring onions, trimmed, finely chopped", "vegetable crisps or tortilla chips, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the peas in a pan of lightly salted water for 2-3 minutes, or until tender. Drain well, then rinse under cold running water.", "Roughly crush half the peas and blend the remaining into a smooth purée using a hand-held blender.", "Mix the crushed and pureed peas together in a bowl, then stir in the tahini, lime juice, cumin and salt, to taste. Stir in the coriander and spring onions.", "Serve with vegetable crisps or tortilla chips."]}, {"isVegetarian": false, "title": "Pea, ham and mint salad with a crispy egg", "url": "www_bbc_co_uk_food_recipes_pea_ham_and_mint_salad_30019", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range eggs", "50g/1¾oz plain flour", "100g/3½oz Panko breadcrumbs", "vegetable oil, for deep-frying", "500g/1lb 2oz frozen peas, defrosted", "ladle warm ham stock, from cooking or from a cube", "handful fresh peas", "10 mangetout", "300g/10½oz cooked ham hock, shredded", "75g/2½oz pea shoots", "2 fresh mint sprigs, leaves picked", "25g/1oz Parmesan shavings", "3 tbsp olive oil", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook two eggs in a saucepan of boiling water for 4 minutes, until soft-boiled. Cool in cold water and carefully peel. ", "Beat the remaining egg in a shallow bowl. Put the flour in a second shallow bowl and season. Put the breadcrumbs in a third shallow bowl. Roll each boiled egg in the flour, then the beaten egg, then the breadcrumbs. ", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the vegetable oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Deep-fry the eggs for 3–4 minutes, until golden", "Meanwhile, blend the defrosted peas with the warm ham stock in a food processor. Pass the purée through a fine sieve. It should have the consistency of double cream.", "Blanch the fresh peas and mangetout in boiling water for 30 seconds. Drain and refresh under cold water. ", "In a bowl, mix together the blanched peas and mangetout, ham, pea shoots, mint and Parmesan. Dress with the olive oil and a squeeze of lemon juice. Check the seasoning. ", "To serve, spoon the pea purée into the bottom of four serving dishes. Pile on the ham salad and top with the crispy eggs. "]}, {"isVegetarian": true, "title": "Pea fritters", "url": "www_bbc_co_uk_food_recipes_peaandbriefritters_79903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, to deep-fry", "150g/5oz self-raising flour", "1 tsp baking powder", "50ml/2fl oz cream", "100g/4oz frozen peas, defrosted", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep, heavy-bottomed pan, one-third filled with vegetable oil, until a breadcrumb will sizzle gently in it. (CAUTION: hot oil can be dangerous! Do not leave unattended.) ", "Meanwhile place the flour and baking powder into a bowl. Add the cream and whisk well to make a thick batter.", "Add the peas and stir through. Season, to taste, with salt and freshly ground black pepper. ", "Carefully place spoonfuls of the batter into the hot oil and cook for 1-2 minutes, until golden. Remove with a slotted spoon and drain on kitchen paper and serve warm."]}, {"isVegetarian": false, "title": "Pea, mint and ricotta ravioli with a pancetta butter", "url": "www_bbc_co_uk_food_recipes_pea_mint_and_ricotta_06456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz  tipo ‘00’ pasta flour", "2 free-range eggs", "knob of butter", "2 banana shallots, finely chopped", "1 garlic clove, finely chopped", "100g/3½oz fresh peas, podded weight", "1 tbsp ricotta", "½ lemon, zest only", "15 mint leaves, finely chopped", "pinch salt", "pinch pepper", "pea shoots, for decoration", "50g/1¾oz clarified butter", "50g/1¾oz pancetta, cubed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, put the flour onto a work surface and make a well in the centre. Beat the eggs and pour the mixture into the well. Using two fingers bring the flour and egg together, working in a circular motion from the centre of the well, until it forms a dough. Knead until smooth. ", "Cut the dough into four equal pieces. Pass each piece of dough through a pasta machine; start on the widest setting and pass the dough through five times on each setting, moving it one setting at a time up to the narrowest. Repeat for all pieces of the dough. Lay the pasta sheets onto a floured surface and cut out rounds. Leave the pasta on the floured surface covered with a damp cloth until the filling is ready.", "For the filling, gently fry the shallots and garlic for a few minutes, add the peas and cook until soft. Take the mixture off the heat and stir in the ricotta, lemon zest and mint and set aside to cool.", "Put a teaspoon of the filling onto a pasta circle. Wet the edges of a second pasta circle and carefully place on top. Make sure you get all the air out of the ravioli, or it may cook unevenly or burst open during cooking. ", "For the butter sauce, cook the pancetta in a hot pan over a medium heat until golden brown. ", "Put the clarified butter in a small pan, add the cooked pancetta and heat gently to warm through.", "Meanwhile, cook the ravioli in boiling water for two minutes. Scoop the cooked ravioli out of the pan with a slotted spoon, and place in a bowl to dry off for a few seconds before draining any excess water from the bowl. Divide the pasta between two serving plates, pour the butter sauce over the pasta, scatter the pea shoots over and serve immediately."]}, {"isVegetarian": true, "title": "Pea and leek soup with spiced croûtons and fresh mint", "url": "www_bbc_co_uk_food_recipes_peaandleeksoupwithsp_86280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 leek, chopped", "1 garlic clove, finely chopped", "150g/5½oz fresh peas", "200ml/7fl oz hot vegetable stock", "salt and freshly black pepper", "2 tbsp olive oil", "½ tsp cayenne pepper", "1 slice white crusty bread, roughly torn", "salt and freshly ground black pepper", "small handful fresh mint, roughly chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the soup, heat the oil in a small saucepan, add the onion and leek and sauté for three minutes. Add the garlic and fry for one minute. Add the peas and stock and simmer gently for five minutes. Season to taste with salt and freshly ground black pepper.", "For the croutons, place the oil and cayenne pepper into a bowl, add the torn bread, season to taste with salt and freshly ground black pepper. Mix to coat. ", "Place the pieces of bread onto a baking sheet and bake in the oven for eight minutes or until crisp and golden.", "To serve, spoon the soup into a bowl, top with the croutons and garnish with roughly chopped mint leaves."]}, {"isVegetarian": false, "title": "Pea and marjoram risotto with chargrilled baby squid", "url": "www_bbc_co_uk_food_recipes_peaandmarjoramrisott_91606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "1 onion, peeled, finely chopped", "1 garlic clove, peeled, finely chopped", "250g/9oz Arborio or other Italian risotto rice", "150ml/5fl oz dry white wine", "1 litre/1 pint 15fl oz chicken stock", "175g/6oz fresh peas, out of their pods", "2 tbsp finely chopped fresh marjoram leaves", "2 tbsp mascarpone", "25g/1oz parmesan cheese, grated", "salt and freshly ground black pepper", "400g/14oz baby squid, cleaned", "2 tbsp olive oil", "½ lemon, juice only", "2 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large pan until foaming, then fry the onion and garlic for 2-3 minutes, or until softened. Add the risotto rice and stir well to coat in the butter. Cook for 1-2 minutes, or until the rice grains start to turn translucent.", "Add the wine and cook for 3-4 minutes, or until nearly all of the liquid has evaporated. Add a ladleful of the chicken stock to the pan and stir well. Cook for 1-2 minutes, or until nearly all of the stock has been absorbed, then add another ladleful of the stock. Repeat the process until the rice is cooked but still al dente. ", "Add the peas during the last 2-3 minutes of cooking, then stir in the chopped marjoram, the marscarpone and parmesan. Season, to taste, with salt and freshly ground black pepper. Keep warm. ", "Season the squid with salt and freshly ground black pepper, then toss in a bowl with the olive oil to coat. Heat a griddle pan until smoking, then cook the squid for 1-2 minutes on both sides, or until golden-brown and just cooked. ", "Remove the squid from the pan and place into a bowl with the lemon juice and parsley. Mix well. ", "To serve, spoon the risotto into the centre of four serving plates and top each serving with some of the baby squid."]}, {"isVegetarian": true, "title": "Pea and mint frittata", "url": "www_bbc_co_uk_food_recipes_peaandmintfritatta_11234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz fresh peas, shelled", "¼ bunch fresh mint, chopped roughly", "1 tsp young pecorino, grated", "55g/2oz parmesan, grated (or similar vegetarian cheese)", "1 lemon", "1-2 tbsp olive oil", "50g/2oz unsalted butter", "3 eggs, preferably free-range ", "1-2 tbsp crème fraîche", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 - 200C/400F/Gas 6.", "Quickly blanch or just plunge the peas into boiling water to soften or if small and sweet just wash. Place in a pestle and mortar with roughly chopped mint (reserving a few leaves for garnishing) and grated pecorino and pound to a paste. Add some salt, a little parmesan cheese, a squeeze of lemon juice and the olive oil.", "Melt the butter in a non-stick, ovenproof frying pan. Break the eggs into a bowl, mix lightly, add a splash of water and season. Add the mixture to the pan and then fold in some of the pea mix, stirring once or twice.", "Place the crème fraîche in the middle and bake in the oven for 3 minutes. Slide onto a plate and serve sprinkled with the reserved mint and the remaining parmesan."]}, {"isVegetarian": false, "title": "Pea and mint risotto with flaked salmon", "url": "www_bbc_co_uk_food_recipes_peaandmintrisottowit_84597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, chopped", "1 clove garlic, sliced", "200g/7oz risotto rice", "50ml/2fl oz white wine", "300ml/10fl oz hot chicken stock", "50g/1¾oz frozen peas", "1 small handful fresh mint, chopped", "2 tbsp double cream", "25g/1oz butter", "salt and freshly ground black pepper", "50g/1¾oz salmon fillet, cooked and flaked"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan. Add the onion and garlic and fry gently for three minutes or until the ingredients have softened but not coloured. ", "Add the rice to the saucepan and stir well for 2-3 minutes, oruntil the grains turn translucent. ", "Add the wine to the saucepan and turn up the heat.  Cook for 1-2 minutes, or until the wine has been absorbed. ", "Gradually add the hot chicken stock to the saucepan, a ladleful at a time and stir continuously, only adding the next ladleful of stock when the rice has fully absorbed the previous ladleful. Cook until all the stock has been absorbed and the rice is slightly al dente. ", "Add the peas, fresh mint, double cream and butter. Season with salt and freshly ground black pepper and mix well. Cover with a lid and leave to cook for 2-3 minutes. ", "To serve, spoon the rice into a bowl and place the salmon flakes on top."]}]