[{"ingredients": ["Azúcar granulado 340 g / 12 oz", "85g / 3oz de azúcar moreno", "100 g / 3½ oz de cacao en polvo", "Harina normal de 30g / 1oz", "½ cucharadita de sal", "1 x 400 g / 14 oz puede leche evaporada", "250ml / 9fl oz de agua", "2 cucharadas de mantequilla", "2 cucharaditas de extracto de vainilla"], "method": ["Coloque el azúcar granulado y marrón, cacao en polvo, harina y sal en una olla. Agregue la leche evaporada, el agua y la mantequilla y deje que hierva lentamente, revolviendo constantemente. Una vez que hierva, cocine por cinco minutos.", "Retire la salsa del fuego y deje que se enfríe un poco. Agregue el extracto de vainilla.", "Sirva servido sobre helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_hotfudgesauce_85722", "title": "Salsa de chocolate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "½ pimiento amarillo, en rodajas", "4 cebollas de primavera, despojadas", "50g / 1 ¾oz de azúcar guisantes rápidos", "1 x filete de solla, cortado en tiras", "Harina normal de 20g / ¾oz", "20 g / oz de harina de maíz", "aceite para freír", "2 cucharadas de salsa de soja", "1 lima, solo jugo", "1 cucharadita de aceite de sésamo", "2 cucharadas de aceite de girasol"], "method": ["Caliente el aceite en una sartén y saltee el ajo, el pimiento amarillo, la cebolla tierna y los guisantes de azúcar por 4-5 minutos para que se ablanden.", "Cubra el pescado en una mezcla de harina de maíz y harina natural. Caliente el aceite en una sartén y fría el pescado durante 2-3 minutos hasta que esté crujiente y dorado. (PRECAUCIÓN: El aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Para hacer el aderezo, mezcle todos los ingredientes.", "Sirva las verduras en un plato y cubra con los pescados. Rocíe con el aderezo."], "url": "www_bbc_co_uk_food_recipes_hotfishsalad_75673", "title": "Ensalada de pescado caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de hojaldre laminado", "1 huevo blanco de corral", "250 g / 9 oz de azúcar glas, más extra para quitar el polvo", "2 yemas de huevo de gallinas camperas", "4 cucharadas de azúcar en polvo", "450ml / 16fl de leche en oz", "1 vaina de vainilla, dividida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la masa en una bandeja para hornear antiadherente. En un tazón, mezcle la clara de huevo y el azúcar glas juntos, luego extiéndalos sobre la pasta. Transfiera al horno y hornee durante 15 minutos. Cortar en cuatro cuadrados.", "Para la crema, mezcle las yemas de huevo y el azúcar en un tazón hasta que estén pálidos y espumosos.", "Caliente la leche con la vaina de vainilla en una sartén hasta que alcance el punto de ebullición. Retire la vaina de vainilla. Vierta la leche caliente sobre los huevos y batir bien. Vierta la mezcla en una sartén limpia y revuelva a fuego lento hasta que espese.", "Para servir, coloque una rebanada de pastel en un plato de servir y vierta sobre un flan. Acomode las rebanadas de repostería y crema restantes. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_hotglazedcustardpast_87968", "title": "Pastelería de glaseado caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de azúcar moreno claro", "½ cucharadita de jengibre molido", "¼ cucharadita de nuez moscada rallada finamente", "4 plátanos medianos, pieles en", "20 g / oz de mantequilla, cortada en ocho rodajas finas", "1 lima grande, solo jugo", "crema batida o helado de vainilla, para servir"], "method": ["Encienda la barbacoa media hora antes de comenzar a cocinar.", "En un tazón, mezcle el azúcar morena, el jengibre molido y la nuez moscada rallada hasta que estén bien combinados.", "Haga una incisión profunda longitudinalmente por el lado curvo de cada plátano, desde el tallo hasta la base. Suavemente abra los plátanos y espolvoree la mezcla de azúcar y especias debajo de la piel de cada plátano.", "Coloque dos rebanadas de mantequilla en las incisiones hechas en cada plátano, luego exprima el jugo de limón.", "Cierre la piel alrededor de los plátanos y envuélvalos en papel de aluminio.", "Cuando las llamas de la barbacoa se hayan apagado y los carbones estén blancos como la ceniza, coloque los plátanos envueltos en papel de aluminio en la parrilla y cocínelos durante 10-12 minutos, de vez en cuando con pinzas, o hasta que los plátanos estén suaves al apretarlos con la tenazas. Retire los plátanos envueltos en papel aluminio del fuego y déjelos a un lado para que se enfríen un poco en los platos para servir.", "Cuando la lámina esté lo suficientemente fría para manipularla, abra los paquetes de plátano y deseche la lámina. Sirva los plátanos con una porción de crema batida o una bola de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_hothotbananas_91712", "title": "Plátanos calientes calientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol o aceite de cacahuete", "3 cebollas, peladas, finamente picadas", "4 dientes de ajo, pelados, triturados hasta formar una pasta con el filo de un cuchillo", "4 cm / 1½ en pieza de jengibre fresco de raíz, pelado, finamente picado o rallado", "1 guindilla Scotch, sin semillas, picada", "½ cucharadita de pimienta negra recién molida", "1 cucharadita de cúrcuma molida", "1½ cucharadita de cilantro molido", "1 palito de canela, partido por la mitad", "Zanahorias de 300g / 10½oz, peladas, cortadas en pedazos de igual tamaño", "300g / 10½ oz chirivías, peladas, cortadas en trozos de igual tamaño", "300g / 10½ oz de batatas, peladas, cortadas en trozos de igual tamaño", "Papas cerosas pequeñas de 400g / 14oz, cortadas a la mitad longitudinalmente", "1 litro / 1¾ pintas de caldo de verduras o agua", "2 hojas frescas de laurel", "2 cucharadas de puré de tomate", "pellizcar azúcar morena oscura", "Anacardos de 75 g / 2½ oz, aplastados, más extra, picado, para servir", "sal y pimienta negra recién molida", "100g / 3½oz de judías verdes, recortadas, cortadas por la mitad", "Hojas de espinaca bebé 200 g / 7 oz, lavado", "4 cucharadas de crema doble", "1 lima, solo jugo", "75g / 2½oz de coco desecado, recién cubierto con agua hirviendo y separado para remojar durante 30 minutos", "½ cucharadita de semillas de mostaza", "2 cucharaditas de azúcar en polvo", "½ cucharada de ron", "pizca de sal", "2 mangos maduros, pelados, sin piedras, en juliana", "2 chiles rojos, cortados por la mitad, sin semillas, muy finamente rebanados", "1-2 limas, solo jugo", "puñado de hojas de menta fresca"], "method": ["Para las raíces calientes y calientes, caliente el aceite en una cazuela a fuego medio y agregue las cebollas. Freír durante 4-5 minutos, o hasta que se doren, revolviendo bien para asegurarse de que no se quemen. Agregue el ajo, el jengibre y el chile y cocine por otros 5-6 minutos, revolviendo regularmente, luego agregue las especias y cocine por un minuto más, o hasta que estén fragantes.", "Agregue las zanahorias, chirivías, batatas y patatas y continúe cocinando durante 4-5 minutos, o hasta que estén suaves y dorados. Agregue el caldo de verduras (o agua), las hojas de laurel, el puré de tomate, el azúcar moreno oscuro y los anacardos molidos y revuelva para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 15-20 minutos, o hasta que las verduras estén tiernas, agregando más caldo si la mezcla se vuelve demasiado seca. (La salsa debe ser lo suficientemente espesa para cubrir las verduras).", "Agregue los frijoles y las espinacas, cocine durante otros tres minutos, o hasta que los frijoles estén tiernos, luego agregue la crema. Agregue la mitad del jugo de lima y sazone, al gusto, con sal y pimienta negra recién molida, agregando más jugo de lima, al gusto, según sea necesario.", "Mientras tanto, para el sabor del mango y el coco, transfiera el coco empapado a un procesador de alimentos (exprima el coco para eliminar el exceso de agua). Agregue las semillas de mostaza, el azúcar impalpable, el ron y la sal y mezcle hasta obtener una pasta gruesa.", "Coloque las rodajas de mango con cucharadas de la pasta de coco en un plato para servir, exprima el jugo de limón y una pizca de chile entre cada capa. Espolvorea la menta sobre la salsa. (Si está preparando el condimento antes de tiempo, agregue la menta justo antes de servir).", "Sirva las raíces picantes calientes esparcidas con nueces de anacardo picadas y espolvoree el condimento al costado."], "url": "www_bbc_co_uk_food_recipes_hothotrootswithfresh_92668", "title": "Raíces calientes y calientes con mango fresco y salsa de coco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hothotrootswithfresh_92668_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de pan", "1 cucharada de aceite de oliva", "1 huevo de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Haga un agujero del tamaño de una yema de huevo en el centro de la rebanada de pan.", "Calentar el aceite en una sartén, agregar el pan y freír el pan y el corte en ambos lados durante 2-3 minutos, o hasta que estén dorados.", "Justo antes de que el pan esté completamente frito en el segundo lado, rompe el huevo en el hoyo del pan. Freír por 1-2 minutos, luego voltee cuidadosamente la tostada y el huevo y fríalos del otro lado por un minuto más, o hasta que el huevo esté cocido a su gusto.", "Deslice la tostada en un plato de servir y sirva con la ronda tostada en el lado. Sazone al gusto con sal y pimienta negra recién molida y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hothouseeggs_88980", "title": "Huevos de casa caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cebollas grandes, en rodajas finas", "150ml / 5fl oz de cerveza oscura o amarga", "1 cucharada de azúcar demerara", "1 cucharada de mostaza integral", "gran perilla de mantequilla", "1 ramita grande de tomillo", "sal y pimienta negra recién molida", "8 salchichas gruesas y de buena calidad (experimento con algunas de las muchas variedades que se ofrecen)", "8 panecillos o pedazos de pan francés"], "method": ["Tome una hoja grande de papel de aluminio y dóblela por la mitad. Esparce las cebollas en el medio y levanta los lados de la lámina para crear un \"plato\" poco profundo. Mezcle la cerveza, el azúcar y la mostaza, luego vierta sobre las cebollas. Agregue la mantequilla y el tomillo y sazone con sal y pimienta. Aprieta los bordes de la lámina para sellar el paquete, asegurándote de no dejar huecos. Esto permitirá que las cebollas cuezan al vapor y la barbacoa al mismo tiempo.", "Coloque cuidadosamente en la barbacoa. Dejar cocinar durante 25-30 minutos hasta que las cebollas se ablanden y la mayoría de la cerveza se haya reducido a una consistencia almibarada. Durante el tiempo de cocción, abra cuidadosamente la lámina unas cuantas veces y revuelva las cebollas. Si hay mucho líquido en la lámina cuando las cebollas están casi cocidas, abra la parte superior de la lámina y cocine durante otros 5 minutos para permitir que el líquido se evapore.", "Coloque las salchichas en una barbacoa medianamente caliente y cocínelas durante 8-10 minutos, volteándolas cada cierto tiempo. Verifique que estén cocidos antes de servir. Coloque las salchichas cocidas en los rollos o el pan francés y agregue las cebollas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_hothoundswithbeerand_67589", "title": "Sabuesos calientes con cebollas barbied cerveza y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hothoundswithbeerand_67589_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 tortillas de harina", "Filete de solomillo de 200g / 7oz", "100g / 3½ oz de queso cheddar maduro, rallado", "2 cebollas tiernas, finamente cortadas", "2 cucharadas de cilantro fresco picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite en una sartén a prueba de horno y freír el bistec en ambos lados durante aproximadamente 1-2 minutos. Retire de la sartén, corte en rodajas finas y déjelas a un lado.", "Coloque una tortilla de harina en la sartén. Coloque capas de queso, cebolletas, cilantro y carne en la parte superior de la tortilla. Cubra con la otra tortilla y espolvoree sobre una capa final de queso.", "Coloque la sartén en el horno durante unos cinco minutos, hasta que el queso se haya derretido y las capas se hayan pegado.", "Retire del horno, corte en rodajas y colóquelo en un plato para servir."], "url": "www_bbc_co_uk_food_recipes_hotlayeredtortillasa_88186", "title": "Sándwich de tortilla con capas calientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos grandes", "2 oz (50 g) de azúcar en polvo de oro y 1 cucharada sopera de azúcar en polvo de oro", "ralladura de ralladura y jugo 1 limón mediano (2 cucharadas de jugo)", "ralladura de ralladura y jugo 1 limón pequeño", "1 huevo grande", "1½ oz (40 g) de azúcar en polvo de oro", "1 oz (25 g) de mantequilla fría sin sal, cortada en cubos pequeños", "1 cucharadita de cucharada de harina de maíz", "un poco de azúcar glas tamizada, para servir:"], "method": ["Precaliente el horno a 170C / 325F / Gas 3.", "Antes que nada, haga la cuajada de limón batiendo ligeramente el huevo en una cacerola de tamaño mediano, luego agregue el resto de los ingredientes de la cuajada de limón y coloque la cacerola a fuego medio. Ahora batir continuamente con un batidor de globo hasta que la mezcla se espese; esto no tomará mucho", "Cuando estés listo para hacer los soufflés, separa los huevos, coloca las yemas en un tazón mediano y las claras en una más grande. Ahora, usando un batidor de mano eléctrico, bata los blancos a la etapa de pico rígido, que tomará de 4 a 5 minutos comenzar a baja velocidad, aumentando gradualmente a medio y luego a alto. A continuación, agregue la cucharada de azúcar en polvo y mezcle a alta velocidad durante 30 segundos más. A continuación, agregue la ralladura y el jugo de limón y los 2 onzas restantes (50 g) de azúcar a las yemas y mezcle brevemente. Ahora tome una cucharada de los blancos y dóblelos en las yemas para aflojar la mezcla, luego doble el resto de los blancos con un movimiento de corte y doblado ligero para no perder el precioso aire. Coloca la mezcla en los moldes preparados, amontonándola como una pirámide, y pasa el dedo por el borde interior de cada uno.", "Luego colóquelos en la bandeja para hornear y colóquelos en el horno en el estante central durante 15-17 minutos o hasta que los bordes estén dorados. Luego retírelos y déjelos reposar durante aproximadamente 5 minutos para permitir que la cuajada de limón se enfríe. Se hundirán un poco, pero eso es normal. Justo antes de servir, colocarlos en platos más pequeños y darles un ligero polvo de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_hotlemoncurdsouffls_68026", "title": "Soplos de cuajada de limón caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "100g / 3½ oz de harina de auto crianza", "2 huevos de gallinas camperas", "2 cucharadas de leche", "4 cucharadas de mermelada", "190ml / 4 fl oz de leche", "1 vaina de vainilla, división y semillas retiradas", "2 yemas de huevo de gallinas camperas", "2 cucharadas de harina de maíz", "2 cucharadas de azúcar en polvo"], "method": ["Para la mermelada, engrase un tazón de vidrio a prueba de horno de 12 cm / 5 pulgadas de diámetro con mantequilla.", "Combina la mantequilla y el azúcar en una licuadora o procesador de alimentos hasta que esté pálida y cremosa.", "Agregue la harina y los huevos, la leche y dos cucharadas de la mermelada y mezcle de nuevo hasta que se combinen.", "Vierta las dos cucharadas restantes de mermelada en la base del recipiente engrasado. Agrega la mezcla.", "Cubra con película adhesiva y cocine a máxima potencia en el microondas durante 4-5 minutos hasta que la torta esté lista y un pincho salga limpio.", "Para la crema pastelera, caliente la leche y la vaina de vainilla en una cacerola, hasta que alcance el punto de ebullición. Retírelo del calor.", "Batir las yemas de huevo, el azúcar y la harina de maíz en un bol.", "Retire la vaina de vainilla de la leche y vierta la leche en el recipiente con los huevos, bata continuamente hasta que la mezcla forme un líquido suave.", "Regrese la mezcla a la cacerola a fuego medio, revuelva constantemente hasta que la crema espese lo suficiente como para cubrir la parte posterior de una cuchara. Quítese el fuego inmediatamente y vierta en una jarra.", "Para servir, coloca la esponja en un plato y vierte sobre la crema pastelera."], "url": "www_bbc_co_uk_food_recipes_hotmarmaladespongewi_86045", "title": "Esponja de mermelada caliente con crema pastelera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 patatas grandes, cortadas en cubos de aceite de oliva", "vinagre de vino", "cebolla mediana, picada", "1-2 dientes de ajo, aplastados", "puñado de hierbas frescas, picadas", "sal y pimienta"], "method": ["Hervir las papas hasta que estén cocidas.", "Invente una viniagrette simple usando 3 partes de aceite por 1 parte de vinagre.", "Agregue las cebollas, ajo, hierbas y condimentos.", "Escurra las papas y mientras aún estén calientes, colóquelas en el aderezo. Revuelva bien y sirva."], "url": "www_bbc_co_uk_food_recipes_hotpotatosalad_8643", "title": "Ensalada de papa caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Cebada de pot de 100g / 3½oz", "3 cebollas medianas", "2 tallos grandes de apio", "1 pastinaca grande", "2 zanahorias", "4-5 papas medianas", "8 cuello grueso de chuletas de cordero", "algunas ramitas de tomillo y algunas hojas de laurel", "½ carne en conserva de lata, cortada en trozos gruesos", "pimienta blanca", "agua o existencias para cubrir", "pequeño puñado de perejil", "sal y pimienta negra recién molida"], "method": ["Hervir la olla de cebada en agua sin sal durante 25 minutos, luego drenarla.", "Precalentar un horno a 160C / 320F / Gas 3.", "Pelar las cebollas y cortarlas en anillos gruesos.", "Cortar el apio en trozos cortos.", "Pele la chirivía, la zanahoria y las papas y córtelas en trozos gruesos.", "Apila las verduras en una olla grande y profunda, luego agrega las chuletas, el tomillo y las hojas de laurel.", "Agregue la carne en conserva.", "Sazone con un poco de pimienta blanca, sin sal, luego vierta la cebada drenada y suficiente agua o caldo para cubrir la carne y las verduras por completo. Llevarlo a ebullición lentamente.", "Elimine la espuma que se acumula en la superficie con una espumadera.", "Cubra la parte superior del guiso con una hoja de papel resistente a la grasa, luego con una tapa. Transfiera la olla al horno y cocine durante dos horas.", "Retire la tapa. El licor debe ser delgado, espesado solo ligeramente por las papas. Picar el perejil y mezclarlo cuidadosamente, para no romper las verduras, sazonar con sal y pimienta negra recién molida.", "Deja toda la noche. Al día siguiente, quite la grasa de la parte superior, luego vuelva a calentar lentamente en la estufa hasta que la carne esté bien caliente y el caldo burbujee suavemente. Sazone según sea necesario y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_hotpot_83828", "title": "Estofado de cordero y cebada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite vegetal", "2 cebollas, finamente picadas", "2 dientes de ajo picados", "pizca de sal fina", "200g / 7 oz de champiñones, descuartizado", "500-600g / 1lb 2oz-1lb filete de estofado de 5oz", "2-3 cucharadas de harina común sazonada con sal y pimienta negra recién molida", "200ml / 7fl oz de vino tinto", "600ml / 1 pinta de caldo de carne caliente", "4 cucharadas de salsa marrón", "dash salsa Worcestershire", "1 pequeño racimo de tomillo fresco", "2 hojas de laurel", "sal marina y pimienta negra recién molida", "500g / 1lb 2oz de patatas nuevas, peladas y cortadas en trozos", "Harina blanca normal 200g / 7oz", "pizca de sal fina", "100 g / 3¾oz de mantequilla sin sal fría, cortada en cubitos", "400ml / 14fl oz de vinagre de malta", "1 cebolla española grande, finamente cortada en anillos"], "method": ["Caliente el horno a 160 ° C / 320 ° F / gas 3. Caliente dos cucharadas de aceite en una cazuela a prueba de llamas de dos litros (3 pintas 10 fl oz).", "Agregue las cebollas y el ajo con un poco de sal fina, y freír hasta que estén doradas. Retirar con una cuchara ranurada, colocar en un recipiente y reservar.", "Agregue otras dos cucharadas de aceite a la sartén y fría los champiñones hasta que estén cocidos. Incline los champiñones cocidos en el recipiente que contiene las cebollas.", "Pica la carne en cubos grandes y cúbrela con la harina sazonada.", "Caliente el aceite restante en la cacerola y fría la carne, en dos tandas, hasta que se dore bien por todas partes. Retire de la sartén y reserve.", "Vierta el vino y raspe la sartén con una cuchara de madera para aflojar los trozos dorados. Cocine a fuego lento hasta que tenga una consistencia almibarada, luego agregue el caldo, las salsas y las hierbas. Revuelva bien y cocine a fuego lento.", "Regrese las cebollas, los champiñones y la carne a la sartén, y agregue sal marina y pimienta negra recién molida al gusto. Cubra y coloque en el horno para estofar durante dos horas, agregando las papas después de una hora.", "Para la masa, tamiza la harina y la sal en un tazón. Frote la mantequilla, luego mezcle lentamente en 3-4 cucharadas de agua fría para hacer una masa dura, juntando la masa para formar una bola con las manos. Envuelva la masa en una película adhesiva y refrigere durante al menos una hora: retire la masa 15 minutos antes de usarla.", "Para las cebollas de vinagre, caliente suavemente el vinagre en una sartén, colóquelo en un tazón grande y mezcle las cebollas. Cubra y reserve.", "Retire la cazuela del horno y descanse durante aproximadamente 30 minutos. Aumente la temperatura del horno a 200 ° C / 390 ° F / gas 6. Estire la masa y, con un cuchillo afilado, corte una tapa de aproximadamente 2.5 cm por encima del diámetro de la cazuela.", "Deseche las hierbas de la cazuela, pruebe y ajuste el condimento si es necesario.", "Cepille agua alrededor del borde de la cazuela. Coloque la tapa de la pastelería en la parte superior, sellando bien hasta el borde, y cepille todo con agua. Perfore un agujero en el centro.", "Regrese al horno para cocinar durante 20-30 minutos hasta que la masa tenga un color dorado profundo. Deje reposar en un lugar cálido durante 10 minutos.", "Sirve el caldo con las cebollas de vinagre en un lado."], "url": "www_bbc_co_uk_food_recipes_hotpotwithvinegaroni_88764", "title": "Hotpot con cebollas de vinagre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, pelados, finamente picados", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado fino", "½ cucharadita de sal marina", "1 lima", "Filete de salmón de 500 g / 17½ oz, desollado y deshuesado", "50 g / 2 oz de hojas de espinaca", "1 cilantro fresco pequeño racimo", "1 manojo pequeño de menta fresca", "3 chiles verdes, picados", "1 lima, solo jugo", "aceite vegetal", "1 cucharada de harina de gramo (también se vende como besan o harina de garbanzo)", "2 cucharadas de yogurt grueso", "3 chalotes de plátano, pelados, rebanados en anillos", "1 cucharadita de azúcar", "1 x 340 g / 12 oz de remolacha becerro en escabeche, drenado y finamente picado, 2 cucharadas de líquido decapado reservado", "1 cucharadita de jugo de lima", "1 cilantro fresco de racimo pequeño, solo hojas"], "method": ["Para el salmón, usando un mano de mortero y machacar el ajo y el jengibre con la sal para formar una pasta suave. Vierta la cuchara en un plato poco profundo y mezcle el jugo de lima.", "Picar el salmón en cubos de 2,5 cm / 1 in y agregarlo al plato. Mezcle suavemente para cubrir uniformemente en la mezcla. Deje marinar durante aproximadamente 10 minutos.", "Para el adobo de cilantro, coloque la espinaca, el cilantro y la menta en un procesador de alimentos. Agregue los chiles, un chorrito de jugo de lima y un chorrito de aceite vegetal. Mezcle hasta que quede suave, agregando un poco más de aceite si la mezcla es demasiado espesa. Poner en un bol y mezclar la harina y el yogur. Sazone con un poco de sal, luego agregue el salmón marinado, cubriendo uniformemente en la mezcla.", "Precalentar el horno a 200C / 390F / gas 6. Engrasar 1-2 bandejas de hornear grandes con aceite de oliva.", "Coloque las piezas de salmón marinado en las bandejas preparadas, separándolas. Asar durante 8-10 minutos, o hasta que esté recién cocido. Retire del horno y reserve. Precalentar la parrilla a alto.", "Para la guarnición, mezcle el azúcar, el líquido decapado reservado de la remolacha, el jugo de lima y las hojas de cilantro en un tazón. Agregue los anillos de chalote y mezcle bien para cubrir.", "Coloque las bandejas de salmón debajo de la parrilla y cocine durante 3-4 minutos, o hasta que estén doradas.", "Para servir, coloque el salmón a la parrilla en pequeños platos y decore con la mezcla de chalote y remolacha picada."], "url": "www_bbc_co_uk_food_recipes_hotsalmonwithlimechi_93821", "title": "Salmón caliente con lima, chile y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 30", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110ml / 4fl oz de aceite de oliva virgen extra", "1 repollo blanco, finamente triturado", "2 dientes de ajo, aplastados", "1 hoja de laurel", "200ml / 7fl oz de caldo de verduras", "2 cucharadas de sultanas", "600g / 1lb 5 oz de salmón ahumado en caliente"], "method": ["Precalentar el horno a 210C / 410 / Gas 7.", "Para el choucroute, caliente una sartén grande sobre fuego suave y agregue el aceite de oliva, el repollo, el ajo y la hoja de laurel. Mezcle durante 1-2 minutos para combinar y luego agregue el caldo de verduras.", "Ponga a hervir el caldo, luego reduzca el fuego a fuego lento. Cubra con una tapa y cocine durante 40 minutos.", "Retire la tapa, agregue las pasas sultanas y continúe cocinando hasta que todo el líquido se haya evaporado.", "Para el salmón, coloque el salmón ahumado en caliente en una bandeja para hornear y coloque en el horno para cocinar durante 5-10 minutos, o hasta que se caliente por completo.", "Para servir, corte el salmón ahumado en caliente y colóquelo en los platos. Coloque una cucharada generosa de chucrut al lado."], "url": "www_bbc_co_uk_food_recipes_hotsmokedsalmonwithc_85463", "title": "Salmón ahumado en caliente con choucroute", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 claras de huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "1½ cucharada de harina de auto crianza, tamizada", "1 cucharada de aceite de oliva", "3 cucharadas de tomates bañados por el sol, picados", "6 hojas de albahaca fresca, rotas", "100 ml / 3½ fl oz oz yogur", "sal y pimienta negra recién molida", "85 g / 3 oz de salmón ahumado en caliente, en copos", "exprimir jugo de limón", "1 cebolleta, picada", "sal y pimienta negra recién molida", "6 tomates tomados por el sol", "1 cucharada de cebolletas frescas picadas", "½ limón, cortado en cuñas"], "method": ["Para los blinis, bata las claras de huevo con un batidor de mano eléctrico hasta que se formen picos rígidos cuando se quite el batidor.", "Dobla la yema de huevo y la harina en las claras de huevo.", "Caliente el aceite en una sartén y vierta cuatro cucharadas separadas de la mezcla de blini en la sartén. Freír durante 3-4 minutos a cada lado, girando con una rebanada de pescado. Retire de la sartén y reserve.", "Para la cobertura de tomate que se tiña por el sol, coloque los tomates picados al sol, la albahaca y el yogur en un bol. Mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para el relleno de salmón, coloque el salmón, el jugo de limón y la cebolla en un bol. Mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque los blinis en un plato y cubra dos de ellos con la cobertura de tomate y dos con la cobertura de salmón. Adorne los blinis con tomates enteros a la luz del sol, cebolletas y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_hotsmokedsalmonandsu_85063", "title": "Blinis de tomate ahumado en caliente y salmón ahumado en caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "150 g / 5 oz de conchas en gambas", "100g / 3½oz de salmón ahumado", "pizca de copos de chile seco", "½ diente de ajo, picado", "2 puñados de cohete", "½ jugo de limón solamente", "1 cucharadita de rábano picante fresco rallado", "6 huevos de codorniz, fritos"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue las gambas, el salmón ahumado, los copos de chile y el ajo y fría por tres minutos.", "Coloque el cohete, el jugo de limón y el rábano picante en un bol y mezcle bien.", "Sirva la ensalada de cohetes en un plato, cubra con la mezcla de salmón ahumado y gambas y cubra con los huevos de codorniz fritos."], "url": "www_bbc_co_uk_food_recipes_hotprawnandsmokedsal_84904", "title": "Ensalada de gambas calientes y salmón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2x140g / 5oz filetes de salmón", "pomo de jengibre, finamente picado", "1 diente de ajo, finamente picado", "1 chalote, finamente picado", "1 cucharada de salsa de soja oscura y dulce (ketjap manis)", "1 cucharada de jarabe de arce", "1 lima, solo jugo", "sal y pimienta negra recién molida", "310g / 11oz nuevas patatas", "140g / 5oz comen todo", "1 limón, solo jugo", "botón de mantequilla", "aceite de oliva", "puñado de cilantro rallado y albahaca", "¡virutas ahumadas del roble usadas para fumar, NO COMBUSTIBLE!"], "method": ["Mezcle el jengibre, el ajo, el chalote, la salsa de soja, el jarabe de arce y el jugo de lima.", "Tome una hoja de papel aluminio, de 30cm / 12 pulgadas de largo, coloque la pieza de salmón sin untar en una mitad de papel de aluminio, rocíe el adobo y sazone bien.", "Doble la lámina y gírela en un sobre para que el salmón quede completamente sellado. Tome otra hoja de papel de aluminio, espolvoree las virutas por la mitad - coloque la bolsa que contiene el salmón encima de las virutas.", "Tome un cuchillo afilado y pinche la parte superior de la bolsa interior 20 veces, doble la lámina exterior sobre la parte superior y séllela.", "Coloque el paquete de papel aluminio en una sartén caliente. Humo durante aproximadamente 7-10 minutos", "Puedes ponerlo en el horno para terminarlo o puedes ponerlo en la barbacoa.", "Hervir las papas nuevas hasta que estén tiernas y hacer lo mismo con la tintura de sarna", "Mezcle las papas con un poco de aceite de oliva, jugo de limón y un poco de mantequilla. Mezcle las hierbas y sirva con el salmón."], "url": "www_bbc_co_uk_food_recipes_hotsmokedsalmonwithw_70010", "title": "Salmón ahumado caliente con ensalada de papas fritas y mange tout", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pato, con la piel puesta", "1 cucharada de salsa de soja oscura", "1 cucharada de miel", "1 cucharada de jugo de lima fresco", "2 piezas grandes de papel de aluminio", "gran puñado de astillas de madera aptas para cocinar, disponibles en cocinas especializadas", "2 pak choi, cortado en cuartos a lo largo", "1 pedazo de jengibre del tamaño de un pulgar, cortado en tiras finas", "1 cucharadita de aceite de sésamo", "1 lima, solo jugo"], "method": ["Mezcle la soja, la miel y el jugo de lima para formar un adobo bastante grueso.", "Marca la piel de la pechuga de pato con un cuchillo afilado media docena de veces.", "Precaliente una sartén e introduzca la mitad del adobo. Inmediatamente burbujeará y humeará, que es el momento de agregar el pato, con la piel hacia abajo.", "Cocine el pato por un minuto en cada lado para tomar el color, luego sáquelo de la sartén.", "Tome una hoja de papel aluminio de 30 cm de largo. Coloque el pato en la mitad de la lámina y sazone bien.", "Dobla la lámina y arrástrala alrededor de los bordes para formar un \"sobre\" para que el pato esté completamente sellado.", "Tome otra hoja de papel más grande para hacer la \"bolsa de fumar\". Espolvoree las virutas de madera en el medio de este trozo de papel de aluminio y coloque el sobre de papel de aluminio que contiene el pato encima de estas virutas.", "Tome un cuchillo afilado y pinche la parte superior de la bolsa interior, que contiene el pato, 20 veces, para permitir que el sabor del humo llegue a la carne. Ahora doble la lámina exterior sobre la parte superior y séllela para crear una \"bolsa para fumar\" alrededor del paquete de pato.", "Precalentar una sartén a fuego medio-alto y colocar el paquete de aluminio en la sartén. Fuma a fuego medio durante ocho minutos hasta que el pato esté cocido pero aún bien y rosado. Puede ponerlo en un horno precalentado o en la barbacoa para terminarlo si lo desea (NOTA: fumar alimentos de esta manera puede producir mucho humo por lo que es aconsejable abrir ventanas o una puerta exterior durante la cocción y no salir la comida desatendida).", "Mientras el pato está fumando, pula el pak choi en agua hirviendo con sal durante un minuto, luego escurra y vierta el aceite de sésamo, el jugo de lima y el jengibre.", "Para servir, coloque el pak choi en el plato, corte el pato en siete u ocho rebanadas y coloque el pato encima. Rocíe el resto del adobo."], "url": "www_bbc_co_uk_food_recipes_hotsmokedteriyakiduc_73664", "title": "Pato teriyaki ahumado caliente con pak choi y jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 35fl oz de sidra", "4 cucharadas de miel", "1 naranja, pelar solo", "2 palitos de canela", "pequeño puñado de clavos enteros", "2 cucharaditas de pimienta de Jamaica", "toque generoso de Somerset Cider Brandy"], "method": ["Coloque todos los ingredientes en una cacerola, caliéntelos suavemente y revuelva ocasionalmente durante aproximadamente 15 minutos (no los hierva).", "Cuando esté caliente, cuele en copas a prueba de calor (dejando los aromatizantes si lo desea) y disfrute."], "url": "www_bbc_co_uk_food_recipes_hotspicedcider_72957", "title": "Sidra caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]