[{"isVegetarian": false, "title": "Beef, asparagus and mangetout stir fry", "url": "www_bbc_co_uk_food_recipes_beefasparagusandmang_85921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz scotch beef fillet, sliced thinly", "20ml/¾fl oz sake", "20ml/¾fl oz soy sauce", "1 tsp grated fresh ginger", "½ tsp soft brown sugar", "½ garlic clove, finely chopped", "1 small red chilli, finely chopped", "110g/4oz asparagus, chopped into thin sticks (julienne)", "75g/3oz mangetout, chopped into thin sticks (julienne)", "2 tsp sesame oil", "salt and freshly ground black pepper ", "2 tsp sesame seeds, to serve", "2 sprigs fresh coriander, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the beef fillet, sake, soy sauce, ginger, sugar, garlic and chilli into a bowl and mix together well. Set aside and marinate for 30 minutes.", "Heat a wok until hot and add the beef mixture. Stir-fry for two minutes, until the meat is browned all over.", "Add the asparagus and mangetout and continue to stir-fry for a further 2-3 minutes, until the vegetables are just tender and the beef is cooked through.", "Add the sesame oil and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the stir fry onto two plates and sprinkle each with the sesame seeds and garnish with a sprig of coriander."]}, {"isVegetarian": false, "title": "Beef curry with lemon and sweet potato mash", "url": "www_bbc_co_uk_food_recipes_beefcurrywithlemonan_86071", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5½oz rump steak, cut into bite-sized chunks", "½ red onion, chopped", "1 tsp curry powder", "1 bay leaf", "¼ tsp chilli flakes", "4 tbsp red wine", "salt and freshly ground black pepper ", "1 tbsp chopped fresh coriander ", "1 sweet potato, peeled and cut into cubes, boiled until tender and drained", "2 tbsp double cream", "½ lemon, juice only", "salt and freshly ground black pepper ", "55g/2oz green beans, topped and tailed, blanched"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef curry, heat the oil in a large pan and fry the steak pieces, stirring frequently, until browned all over.", "Add the onion and cook until softened.", "Add the spices and cook for a further minute.", "Add the red wine and cook for 8-10 minutes, or until the beef is cooked through. Season, to taste, with salt and freshly ground black pepper and stir in the coriander.", "For the sweet potato mash, place the cooked sweet potato into a bowl with the cream and lemon juice. Season, to taste, with salt and freshly ground black pepper and mash with a potato masher until smooth.", "To serve, place the mash onto a serving plate with the blanched green beans and top with the curry."]}, {"isVegetarian": false, "title": "Beef curry with jasmine rice", "url": "www_bbc_co_uk_food_recipes_beefcurrywithjasmine_83224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz rib-eye steak, cut into 5cm/2in pieces", "salt and freshly ground black pepper", "3 shallots, finely sliced", "1 clove garlic, chopped", "1 tsp tomato purée", "1 tsp chilli powder", "½ tsp turmeric powder", "200ml/7fl oz coconut milk", "250g/9oz jasmine rice, boiled until tender", "20g/1oz chopped fresh coriander, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan until almost smoking. Season the steak with salt and freshly ground black pepper and add to the pan. Brown on all sides, then remove. ", "Add two of the sliced shallots together with the garlic and cook until softened but not coloured. Add the tomato purée and spices, stir well and cook for one minute. ", "Put the steak back in the pan and add the coconut milk. Bring to the boil, then turn down the heat and simmer gently for 10 minutes. ", "Add the remaining shallot to the cooked and drained jasmine rice.", "To serve, stir the coriander through the curry and serve with the jasmine rice."]}, {"isVegetarian": false, "title": "Beef empanadas", "url": "www_bbc_co_uk_food_recipes_beefempanadas_86767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "1 garlic clove, crushed", "1 carrot, finely chopped", "225g/8oz extra lean beef mince", "1 tbsp tomato purée", "¾ tsp ground cumin", "1 tsp chilli powder", "1 medium potato, peeled, cut into cubes", "100ml/3½fl oz dark Mexican beer, brown ale or stout ", "salt and freshly ground black pepper", "225g/8oz plain flour, plus extra for dusting", "½ tsp turmeric", "½ tsp chilli flakes", "75g/3oz chilled butter, cut into cubes", "pinch salt", "50ml/2fl oz milk", "1 free-range egg yolk", "1 free-range egg, beaten", "sweet chilli dipping sauce"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the onion, garlic and carrot and fry until softened.", "Add the mince and fry for 3-4 minutes, until golden-brown all over.", "Add the tomato purée, cumin and chilli powder, stir well and cook for 3-4 minutes.", "Add the potatoes and the beer and bring to the boil. Reduce the heat and simmer for 25 minutes, or until potatoes are cooked.", "Remove from the heat and leave to cool.", "For the pastry, place the flour, turmeric, chilli flakes, butter and salt into a food processor and pulse to a breadcrumb-like consistency. ", "Add the milk and egg yolk and pulse together until the mixture just comes together as a dough.", "Turn the dough out onto a lightly floured work surface and knead for a few minutes, then wrap in cling film and transfer to the fridge to chill for an hour.", "Preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out onto a lightly floured work surface and cut out 12 circles of 10cm/4in diameter.", "Place a spoonful of the filling into the centre of each pastry circle.", "Brush the edge of one half of each of the circles with some of the beaten egg, then fold over the other side and seal - make sure you don't trap any air inside.", "Mark around the edges of the sealed pastry with the tines of a fork.", "Place the empanadas onto a baking tray and transfer to the oven to cook for 10 minutes, or until the pastry is cooked and the filling is hot.", "To serve, place the empanadas onto a large serving plate with sweet chilli dipping sauce in a bowl in the centre."]}, {"isVegetarian": false, "title": "Beef fillet in coconut milk with crispy noodles and dipping sauce", "url": "www_bbc_co_uk_food_recipes_beeffilletwithcoconu_87454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz beef fillet, sliced thinly", "sal and freshly ground black pepper", "olive oil", "75ml/3fl oz coconut milk", "2.5cm/1in piece fresh ginger", "110ml/4fl oz rice wine vinegar", "110g/4oz caster sugar", "50ml/2fl oz Thai fish sauce (nam pla)", "2 tsp dried chilli flakes", "50g/2oz cashew nuts, finely chopped", "1 small bunch fresh coriander, roughly chopped", "vegetable oil for deep frying", "40g/1½oz ready-made rice noodles", "2 Little Gem lettuces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the beef slices, salt and freshly ground black pepper and olive oil into a bowl and mix well.", "Heat a frying pan and add the beef. Avoid turning the meat too much - you want it to develop a nice crust. ", "Once the beef is golden-brown all over, add the coconut milk. Bring to the boil, then reduce the heat and simmer for 4-5 minutes, stirring occasionally. The coconut milk will reduce down to give a sticky consistency, coating the beef. Remove from the heat and set aside.", "Grate the ginger onto the middle of a sheet of muslin. Fold over the muslin to seal around the ginger, then squeeze out the juice over a clean bowl by slowly twisting the muslin with the ginger inside.", "Place the rice wine vinegar and caster sugar into a pan over a medium heat and stir until the sugar has dissolved.", "Add the Thai fish sauce, chilli flakes, and the squeezed ginger juice and cook over a low heat for five minutes. ", "Add the chopped nuts and heat for one minute.", "Add the chopped coriander and heat for one minute.  ", "Heat a deep fat fryer to 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Add the noodles to the oil - they will expand quickly and dramatically. Once the noodles are all crisp and golden-brown remove them from the oil with a slotted spoon and transfer to a baking sheet lined with a paper towels to drain.", "Divide up the leaves from the Little Gem lettuces and arrange on serving plates.", "To serve, spoon the beef into the 'cups' of the Baby Gem leaves, and then drizzle the dipping sauce over. Gently crumble a handful of the crispy noodles over each dish and serve."]}, {"isVegetarian": false, "title": "Beef fillets with wasabi pikelets and spicy beetroot", "url": "www_bbc_co_uk_food_recipes_beeffilletwithwasabi_67767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4x170g/6oz beef fillets", "4 small cooked beetroot", "½ tsp fennel seeds", "700ml/1¼ pints malt vinegar", "55g/2oz dark brown sugar", "1 clove minced garlic", "1 tbsp minced ginger", "2 large potatoes", "1 tbsp horseradish sauce", "1 tsp wasabi", "2 eggs, yolks only", "1 tbsp chopped chives", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grate the beetroot into a metal bowl.", "Dry fry the fennel seeds in a pan and grind to a powder in a spice grinder. Mix with the vinegar, sugar, garlic, ginger and chilli.", "Boil together for 20 minutes, and pour over the grated beetroot. Allow to cool. Boil the potatoes in their skins until soft, allow to cool slightly and peel.", "Crush the potatoes with a fork and add the wasabi, horseradish, yolks and chives, mix well and season.", "Heat a non-stick frying pan and lightly oil it. Spoon mixture into 4 oiled egg rings and cook over a moderate heat until golden brown, turn over and repeat.", "Heat a grill pan, brush the beef fillets with a little oil and cook for 3-4 minutes on each side and allow to rest in a warm place.", "Place a potato cake onto a warm dinner plate; slice the beef and place on top. Spoon the beetroot mix on top and drizzle some of the juice all around and serve."]}, {"isVegetarian": false, "title": "Beef flank steaks with crisp shallots and wild mushroom and watercress salad", "url": "www_bbc_co_uk_food_recipes_beefflankwithcrispsh_89942", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "110g/4oz plain flour, for dusting", "salt and freshly ground black pepper ", "5-6 shallots, peeled and sliced into thin rings", "110ml/4fl oz milk", "2 x 300g/10oz beef flank steaks", "2 tbsp olive oil", "150g/5oz mixed wild mushrooms, cleaned", "1 tbsp good quality cider vinegar", "3 tbsp rapeseed oil", "1 tsp English mustard", "salt and freshly ground black pepper ", "110g-150g/4oz-5oz watercress, washed, thick stalks removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Half-fill a deep heavy-based pan with vegetable oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Season the flour with salt and freshly ground black pepper.", "Dredge the shallot rings in the seasoned flour to coat, shaking off any excess. Dip into the milk and then dredge in the flour again, shaking off any excess.", "Deep-fry the shallot rings in the hot oil in batches for 3-4 minutes, until crisp and golden-brown, then carefully remove with a slotted spoon and drain on kitchen paper.", "Heat a griddle pan (or, ideally, a barbecue).", "Season the steaks with salt and freshly ground black pepper and place onto the griddle pan. Cook for 3-4 minutes on each side for rare, or until cooked to your liking. Remove from the heat and allow to rest for five minutes.", "Heat a frying pan until hot, add the olive oil and mushrooms and sauté for 2-3 minutes, until softened and turning golden-brown.", "Meanwhile, for the watercress salad, whisk the cider vinegar, rapeseed oil and mustard together in a bowl and season, to taste, with salt and freshly ground black pepper. Drizzle the dressing over the watercress in a bowl and mix well.", "To serve, place equal portions of the watercress salad onto four plates. Slice the steaks and place an equal number of slices onto each of the four portions of watercress. Arrange the wild mushrooms and crisp shallots on top of each and serve."]}, {"isVegetarian": false, "title": "Beef goulash", "url": "www_bbc_co_uk_food_recipes_beefgoulash_10656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb sirloin steak, trimmed and cut in strips", "olive oil", "1 medium onion, peeled and sliced thinly", "½ red pepper, de-seeded and sliced", "½ green pepper, de-seeded and sliced", "25g/1oz butter", "sea salt and black pepper", "2 tbsp tomato purée", "200ml/7fl oz beef stock", "3 tbsp paprika", "small bunch flatleaf parsley", "100ml/3½fl oz soured cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Warm a frying pan on the stove until very hot, then brown the steak (in batches) in a little olive oil.", "Colour the onions and peppers in the butter and season. Place in one large pan, together with the browned steak. ", "Pour in the tomato purée, stock and paprika, season and bring to the boil. Cook for between 20 and 40 minutes. Garnish with sour cream and the flatleaf parsley."]}, {"isVegetarian": false, "title": "Beef in designer beer", "url": "www_bbc_co_uk_food_recipes_beefindesignerbeer_67198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb braising steak cut into 2 inch (5 cm) squares ", "425ml/15fl oz designer beer ", "1 tbsp olive oil ", "350g/12oz  onions, peeled and cut in quarters ", "2 garlic cloves, crushed ", "1 heaped tbsp plain flour ", "a few fresh thyme sprigs  ", "2 bay leaves ", "salt and freshly milled black pepper  ", "1 tbsp olive oil ", "1 garlic clove, crushed ", "6x2.5cm/1in thick slices French bread cut slightly diagonally ", "6 level tsp wholegrain mustard ", "110g/4oz grated Gruyère cheese "], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["You can make the croûtons well ahead of time and, to do this, preheat the oven to 180C/350F/Gas 4. Drizzle the olive oil on to the baking sheet add the crushed garlic, then using either your hands or a piece of kitchen paper, spread the oil and garlic all over the baking sheet. Now place the bread slices on top of the oil, then turn them over so that both sides have been lightly coated with the oil. Bake for 20-25 minutes till crisp and crunchy.", "When you're ready to cook the beef, lower the oven temperature to 150C/300F/Gas 2. Take the flameproof casserole, place it over direct heat, then heat the oil until sizzling hot and fry the meat, 3 or 4 pieces at a time, until they turn a dark mahogany colour on all sides. Make sure you don't overcrowd the pan or they will create steam and never become brown. As you brown the meat remove it to a plate then, when all the meat is ready, add the onions to the pan, still keeping the heat high. Toss them around until they become darkly tinged at the edges - this will take about 5 minutes. After that add the crushed garlic, let that cook for about 30 seconds or so, then turn the heat down, return the meat to the casserole and sprinkle in the flour. Using a wooden spoon, stir until all the flour has been absorbed into the juices. It will look rather stodgy and unpromising at this stage but not to worry - the long slow cooking will transform its appearance.", "Now gradually stir in the beer and, when it's all in, let the whole thing gently come up to simmering point, and while that's happening add salt, freshly milled black pepper and the thyme and bay leaves. Then, just as it begins to bubble, put the lid on, transfer it to the centre shelf of the oven and leave it there for 2½ hours. Don't be tempted to taste it now or halfway through the cooking as it does take 2½ hours for the beer to mellow and become a luscious sauce.", "Just before you want to serve the beef, preheat the grill, spread the croûtons with the mustard and sprinkle them with the grated gruyère, then arrange them on top of the meat and pop the casserole under the grill until the cheese is bubbling. Then serve straight away."]}, {"isVegetarian": false, "title": "Beef in oyster sauce", "url": "www_bbc_co_uk_food_recipes_beefinoystersauce_89263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefinoystersauce_89263_16x9.jpg", "ingredients": ["350g/12oz beef fillet", "1 tsp light soy sauce", "1½ tbsp oyster sauce ", "pinch sugar", "salt and freshly ground black pepper", "2 tbsp groundnut oil ", "3 cloves garlic, finely chopped", "1 chilli, de-seeded, finely chopped", "200g/7oz baby spinach leaves", "1 tbsp Shaoxing rice wine or dry sherry", "pinch dried chilli flakes ", "1 tsp groundnut oil ", "100g/3½oz oyster mushrooms", "dash Chinese black rice vinegar or balsamic vinegar", "dash light soy sauce"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, place the fillet in between two sheets of cling film and bash with a meat mallet or rolling pin until half as thin. Slice the beef into thin pieces and place into a bowl, then season with the light soy sauce, oyster sauce, sugar and salt and freshly ground black pepper. Set aside. ", "Heat a wok until smoking and add one tablespoon of the groundnut oil, then add the garlic and chilli. Stir-fry for a few seconds, then add the spinach leaves and toss for a few seconds, until warmed through. Pile onto a large serving plate. ", "Place the wok back on the heat and add the remaining oil, then add the beef slices and stir fry for 2-3 minutes, or until the beef is cooked to your liking. Pour in the Shaoxing rice wine and sprinkle over the dried chilli flakes. Pile the beef over the spinach leaves. ", "For the oyster mushrooms, heat the oil in the wok and add the oyster mushrooms, stir frying for one minute. Add a small splash of water to create some steam to help the mushrooms cook, then season, to taste, with the black rice vinegar and light soy sauce. ", "Spoon the oyster mushrooms over the beef and serve."]}, {"isVegetarian": false, "title": "Beef kebabs with harissa and lemon rice", "url": "www_bbc_co_uk_food_recipes_beefkebabswithhariss_90875", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz dried red chillies, soaked in cold water, drained and roughly chopped", "50g/2oz fresh red chillies, seeds removed, roughly chopped", "2 tsp ground cumin", "2 tsp ground caraway seeds", "1 tbsp smoked sweet paprika", "2 garlic cloves", "2 tbsp tomato purée", "3 tbsp red wine vinegar", "4 tbsp olive oil", "800g/1lb 12oz rump steak, cut into large cubes", "1 tbsp olive oil", "salt and freshly ground black pepper ", "2 red onions, cut into wedges", "1 lemon, juice only", "50g/2oz butter", "2 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "275g/10oz basmati rice", "1 lemon, zest and juice", "450ml/16fl oz chicken stock", "salt and freshly ground black pepper ", "3 tbsp coriander leaves, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the harissa, place all of the harissa ingredients into a food processor and blend to make a smooth paste. Set aside.", "For the kebabs, heat a griddle pan until hot. Place the steak cubes in a bowl and add the olive oil and salt and freshly ground black pepper, to taste. Mix to coat the steak in the seasoning and oil.  ", "Thread the meat onto metal skewers, alternating with the wedges of red onion.", "Place the skewers onto the griddle and cook on each side for 1-2 minutes, or until cooked to your liking. Baste with a little of the harissa every 30 seconds or so. Once the meat is cooked, squeeze over the lemon juice.", "For the lemon rice, heat a lidded sauté pan over a medium heat, add the butter, olive oil, onion and garlic and sauté for two minutes until the onion and garlic are just softened, but not browned.", "Add the rice, lemon zest and juice to the pan and mix well. Add the chicken stock and bring to a simmer. ", "Cover, reduce the heat and simmer for 12-15 minutes until the rice is tender and all the liquid has been absorbed. Season with salt and freshly ground black pepper, to taste, then stir in the coriander.", "Serve the skewers with the rice alongside and with a dollop of harissa."]}, {"isVegetarian": false, "title": "Beef tortilla wraps", "url": "www_bbc_co_uk_food_recipes_beefkoftasandguacamo_89140", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefkoftasandguacamo_89140_16x9.jpg", "ingredients": ["150g/5½oz lean beef mince", "1 garlic clove, finely chopped", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 ripe avocado, peeled, stone removed, chopped", "½ lime, juice only, plus extra to serve", "1½ tbsp chopped fresh coriander leaves", "2 flour tortillas", "3 tbsp plain yoghurt", "1 Little Gem lettuce, leaves separated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the beef mince, garlic, salt and pepper together in a bowl. Then roll the mince into about 6 balls using your hands. Rub the beef with olive oil. Cook in a hot frying pan for 8-10 minutes, turning regularly, until golden-brown and cooked through.", "For the guacamole, put all of the guacamole ingredients in a bowl and mash to a rough mixture with a fork.", "Spread the tortillas with the guacamole, fill with the hot beef and add some yoghurt. Squeeze over a little more lime juice to taste, add a few lettuce leaves, then roll the tortilla up."]}, {"isVegetarian": false, "title": "Beef koftas with grilled fig and halloumi salad", "url": "www_bbc_co_uk_food_recipes_beefkoftaswithgrille_89762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["475g/1lb 1oz beef mince", "1 garlic clove, chopped", "½ tsp ground coriander", "1 tsp ground cumin", "salt and freshly ground black pepper", "4 figs, thickly sliced", "200g/7oz halloumi, thickly sliced", "½ lemon, juice only", "3 tbsp extra virgin olive oil", "1 bunch mixed salad leaves of your choice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak eight small wooden skewers for ten minutes in cold water.", "Place the mince, garlic, coriander and cumin into a bowl and season well with salt and freshly ground black pepper. Mix together well, then divide the mixture into eight equal portions.", "Press each portion of the mince mixture around a wooden skewer to form a sausage, three quarters the length of the skewer, then place onto a plate in the fridge to chill.", "Heat a griddle pan until hot. Place the skewers onto the griddle and cook for 2-3 minutes on each side, or until completely cooked through.", "Heat a separate frying pan until hot. Add the fig slices and fry on each side for 30 seconds.", "Remove the figs and set aside, then add the halloumi and cook on each side for one minute, or until golden-brown all over.", "Whisk the lemon juice, olive oil, salt and freshly ground black pepper together in a clean bowl, then add the salad leaves. Toss well to coat.", "To serve, place arrange slices of fig and halloumi onto the centre of each plate. Place a pile of the dressed salad leaves on top, then top each dish with two koftas. Drizzle over a little of the remaining dressing and serve."]}, {"isVegetarian": false, "title": "Beef, onion and potato pasty-pie", "url": "www_bbc_co_uk_food_recipes_beefonionandpotatopa_77606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb2oz potatoes", "salt", "300g/10oz rump steak, cut into 1cm/0.5in dice or strips", "2 onions, peeled and chopped ", "4 thyme sprigs, leaves removed ", "1 garlic clove, chopped", "200ml/7fl oz beef stock", "1 tbsp tomato ketchup", "splash red wine", "2 x 28cm/11in circles of shortcrust pastry (ready-made pastry is fine)", "salt and freshly ground black pepper", "2 eggs, beaten"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Peel and slice the potatoes and boil them in salted water for 10 minutes until parboiled. Drain and put to one side.", "In a hot pan, sear the beef until well browned, then remove from the pan. Cook the onions, thyme and garlic until softened and add the beef.", "Pour in the stock, the tomato ketchup and a splash of red wine and allow most of the moisture to boil away. Make sure the mixture is not too runny.", "Preheat the oven to 200C/400F/Gas 6. Lay the sliced potatoes on the bottom circle of pastry leaving a 3.5cm/1½in margin around the edge.", "Season the potato slices as you layer them on top of the pastry - you should end up with a layer of potatoes about 2.5cm/1in thick. Now spoon the moist beef and onion mix over the top and spread it out.  If you have reduced it enough, the juices will not run off the edges.  ", "Lay the other circle of pastry on top and crimp the edges well.", "Brush liberally with egg wash and score any pattern you like into the pastry. Cut a tiny hole in the top to allow steam to escape and bake for 30 minutes."]}, {"isVegetarian": false, "title": "Beef Madras", "url": "www_bbc_co_uk_food_recipes_beefmadras_67360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp groundnut oil\t\t\t ", "2 green cardamoms (or black if you can get them)", "5cm/2in length cassia bark or cinnamon stick\t\t", "1 medium onion, peeled and sliced\t\t\t ", "255g/9oz rib-eye steak, trimmed and cut into thin strips ", "1 green chilli, chopped", "2 garlic cloves, peeled and sliced", "¼ tsp turmeric", "¼ tsp salt", "½ tsp ground cumin", "½ tsp ground coriander", "2 tsp tomato purée", "½ tsp peeled and grated root ginger", "pinch of garam masala", "30g/1oz fresh coriander leaves, washed and chopped, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok or large frying pan, then add the cardamoms and cassia bark. Fry for 1 minute. ", "Tip in the onions and fry for 1 minute. ", "Add the beef, followed by the chilli and garlic and fry on a medium heat for 4 minutes.", "Then add the turmeric, salt, cumin and coriander and stir for another minute.", "Mix the tomato purée with 150ml/5fl oz of hot water (double this amount if you want more sauce) from the kettle and add to the pan. Cook for 3 minutes. ", "Mix in the ginger and sprinkle over the garam masala and the coriander leaves. ", "Serve immediately with a naan or in hot pitta breads."]}, {"isVegetarian": false, "title": "Beef rendang", "url": "www_bbc_co_uk_food_recipes_beefrendang_78767", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefrendang_78767_16x9.jpg", "ingredients": ["1 onion, roughly chopped", "1 tbsp chopped fresh ginger", "1 tbsp chopped galangal (or another tbsp of the above)", "1 tbsp chopped garlic", "1 lemongrass stalk, tough outer layer removed and roughly chopped", "1 tsp turmeric", "6 long red dried chillies, soaked in water and roughly chopped", "2 tbsp sunflower oil", "1 cinnamon stick", "6 cardamom pods", "650g/1lb 7oz braising steak, cut into 2cm/1inch cubes", "4 kaffir lime leaves", "zest of a kaffir lime or lime", "400ml/14fl oz coconut milk", "1 tbsp of tamarind paste or juice of a lime", "50g/2oz desiccated coconut flakes", "coriander sprigs to garnish", "1 tbsp sunflower oil", "1 cinnamon stick", "4 cardamom pods", "250g/9oz basmati rice", "600ml/1pint 1½fl oz water ", "2 tbsp chopped fresh coriander", "sea salt", "deep-fried shallots", "1 deep-fried red chilli"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the rendang paste, place the onion, ginger, galangal, garlic, lemongrass, turmeric and chillies into a food processor.  Blend to form a smooth purée.", "Heat a wok and add the oil.  Fry the paste over a high heat until the paste turns darker and is highly aromatic. ", "Add the cardamom pods (crush the cardamom pods gently with the back of a spoon before frying) and the cinnamon stick broken in half and cook for another minute then add the meat. ", "Fry the meat in the paste stirring all the time, until it is well browned.", "Pour over the coconut milk and tamarind purée and bring to a gentle simmer, add the kaffir lime leaves and zest. ", "Season with salt, stir well then reduce to a simmer. ", "Cook for between one hour and one hour and a half, stirring frequently during this time.  The meat should be really tender and the sauce really reduced and rich.", "Meanwhile toast the coconut flakes in a dry pan.  Keep a close eye on this, as it will burn really quickly. It should be a lovely deep brown colour when ready.  Blend to a powder in a small blender or pound in a pestle and mortar.  When the rendang is ready stir into the mixture making sure it is well mixed in.", "For the herby rice, wash the rice really well under cold water, the water will run clear when it is washed enough. Allow to drip dry Heat the oil in heavy-based saucepan that has a tight fitting lid. ", "Add the spices and fry for a minute. ", "Add the rice and fry until the grains begin to turn an opaque white. ", "Add the water and a good pinch of salt.  ", "Bring to the boil then allow to bubble away until nearly all the water has been absorbed and air holes are beginning to appear. ", "At this point pop the lid on. Leave the heat on underneath for a minute (this will create lots of steam) then allow to stand for five minutes (do not remove the lid). ", "Keep warm until everything else is ready. You can hold rice like this for up to half an hour.", "To serve, mix the herbs into the rice and divide between four warmed serving dishes.  Next spoon on the rendang, finish with a few sprigs of coriander and serve immediately, garnished with the deep-fried shallots and chilli."]}, {"isVegetarian": false, "title": "Beef, oyster and ale pie", "url": "www_bbc_co_uk_food_recipes_beefoysterandalepie_92453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz beef braising steak, chopped", "salt and freshly ground black pepper", "50ml/2floz vegetable oil ", "175g/6oz smoked bacon, cut into large lardons", "125g/4½oz onion, chopped ", "125g/4½oz carrots, peeled, cut into batons ", "1-2 garlic cloves, peeled, chopped ", "125g/4½oz baby button mushrooms", "25g/1oz plain flour ", "500ml/17½fl oz dark ale", "1 tbsp chicken bouillon powder", "2 litres/3½ pints boiling water ", "1 large bouquet garni (bay leaves, parsley and thyme, tied together with kitchen string) ", "1 tbsp wholegrain mustard", "350g/12oz new potatoes, larger ones halved", "1 tsp tarragon, leaves only, chopped", "12 large fresh oysters, shucked", "250g/9oz ready-rolled puff pastry", "1 free-range egg, plus 1 egg yolk, beaten together with a pinch of salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the beef with salt and freshly ground black pepper. Heat a large pan until hot, then add the vegetable oil and fry the beef for 2-3 minutes, turning occasionally, until browned all over.", "Add the smoked bacon and fry for a further 1-2 minutes, then add the onion, carrots, garlic and mushrooms. Fry for 2-3 minutes, then add the flour and stir well to prevent any lumps from forming. Cook for a further minute. ", "Pour in the dark ale, bring to the boil and cook for 8-10 minutes, or until reduced by half. Dissolve the chicken bouillon powder in the water, then add to the pan along with the bouquet garni, wholegrain mustard and new potatoes. Bring to the boil and season with salt and freshly ground black pepper, then reduce to a simmer and cook for two hours, or until the beef is tender.  ", "Add the chopped tarragon to the pan and season, to taste, if necessary. Remove the pan from the heat and set aside to cool. Discard the bouquet garni.", "Preheat the oven to 200C/400F/Gas 6. ", "Spoon the beef mixture into a 20cm x 15cm/8in x 6in pie dish and add the oysters, folding them gently into the beef mixture. ", "Roll out the puff pastry until it is 3mm thick, then cut out pieces of pastry large enough to fit over the top of the pie dishes as a lid, with a bit of overhang. Crimp the edges with your fingers, securing the pastry to the dish. ", "Prick the surface of the pastry with a fork, then brush with the beaten egg. Place the pies onto a baking tray and bake in the oven for 20 minutes, or until the pastry is golden-brown and crisp.", "Serve the pies with sides of lightly boiled seasonal green vegetables, such as green beans, broccoli or spinach."]}, {"isVegetarian": false, "title": "Beef rendang with Thai herb salad and sticky rice", "url": "www_bbc_co_uk_food_recipes_beefrendangwithlemon_90061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemongrass stalks, roughly chopped", "20g/¾oz coriander seeds", "½tsp cumin seeds", "½tsp turmeric powder", "50g/2oz block coconut cream", "1½ large onions, sliced", "3 garlic cloves, chopped", "3 red chillies, seeds removed, chopped", "1 thumb-sized piece ginger, peeled and chopped", "1 bay leaf", "750g/1lb 10oz boneless beef shin, cut into 2.5cm/1in cubes", "400g/14oz canned coconut milk", "250ml/8¾fl oz strong veal or beef stock, heated", "110g/4oz Chinese cabbage, shredded", "2 lime leaves, sliced into thin strips", "2 red chillies, seeds removed, sliced into thin strips", "25g/1oz pea shoots", "50g/2oz mizuna leaves", "small handful mint leaves", "1 spring onion, sliced diagonally", "50g/2oz green beans, cut into 2cm/1in pieces", "small handful fresh coriander leaves", "small handfulfresh Thai basil leaves (or normal basil leaves)", "small handful bean sprouts", "1 lime, juice only", "1 tsp sunflower oil", "1 tsp fish sauce", "1 red chilli, finely diced", "1 garlic clove, finely sliced", "200g/7oz Thai jasmine rice", "200g/7oz Thai sticky rice", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the beef rending, pound the lemongrass to a pulp using a pestle and mortar. Tip the lemongrass into a small bowl. ", "Heat the frying pan over a medium heat. Add the coriander, cumin seeds and turmeric and dry fry until fragrant. Tip the spices into a spice grinder or the pestle and mortar. Grind the spices to a powder if using a grinder, or pound in a pestle and mortar until the spices are as smooth as possible. Set aside.", "In a wide pan or cast-iron wok, heat the block of coconut cream until it melts, keeping the heat low so that it does not burn. ", "Add the onions, garlic, chillies, ginger and pounded lemongrass to the pan and cook gently until the onions have softened and the mixture is fragrant. ", "Add the reserved ground spices and the bay leaf and fry for a few minutes more.", "Add the meat and increase the heat so that it browns on all sides. Stir until the meat is completely coated with the spices - this will take a few minutes. ", "Add the coconut milk, bring to the boil, then add the hot stock. ", "Turn the heat up to high and continue cooking for at least 1- 1½ hours, stirring occasionally until the sauce becomes thick and coats the meat well.", "For the salad, combine all the salad ingredients in a salad bowl and mix well. Set aside.", "For the dressing, whisk together all the dressing ingredients in a bowl. Set aside.", "For the sticky rice, tip the rice into a sieve and wash the two varieties of rice three times, draining each time. ", "Place the rice into a saucepan and cover with water to leave 1cm/½in water above the level of the rice. Add the salt and cover with a lid. Place over a high heat and bring to the boil.", "Boil the rice for five minutes, then, without removing the lid, turn the heat off and leave to steam for 20 minutes.", "To serve, pour the dressing into the salad and mix to combine. Pile the rice onto four plates and spoon the beef rending alongside. Serve the salad separately."]}, {"isVegetarian": false, "title": "Beef rolls in tomato ragù", "url": "www_bbc_co_uk_food_recipes_beefrollsintomatorag_67356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 small sirloin steaks", "30g/1oz parmesan cheese, grated", "4 garlic cloves, finely chopped", "handful flatleaf parsley, torn", "salt and freshly ground pepper", "6 tbsp olive oil", "150ml/¼ pint red wine", "1 onion, finely chopped", "1 celery stalk, very finely chopped", "2 tbsp tomato purée, diluted in 400ml/14fl oz lukewarm water", "2x400g cans chopped tomatoes", "handful fresh basil leaves, torn"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Arrange the slices of meat on a chopping board or a clean work surface and flatten them with a meat tenderiser (if you don't have one, place a flat wooden spatula  over the meat and bash with the palm of your hand).  Season with salt and pepper, then sprinkle with the grated parmesan, garlic, and parsley.  Roll each slice up tightly and secure well with toothpicks.", "For the sauce, heat the olive oil in a large saucepan.  When hot, lower the heat, add the meat rolls and seal well on all sides.  Increase the heat again, add the wine and  simmer until it has reduced by half.  Remove the meat and set aside.", "Add the onion and celery to the pan and stir well.  Cook until the remainder of the wine has nearly evaporated, then put the meat back in the pan and pour over the  diluted tomato concentrate and the chopped tomatoes.  Season with salt and pepper and stir in the basil. Lower the heat and cover with a lid, but not completely, so some  of the steam can escape.  Cook gently for 2 hours, stirring from time to time.  Check the seasoning.", "Serve the tomato sauce with some cooked pasta such as tagliatelle or large rigatoni. Then serve the meat rolls as a main course with a mixed leaf salad."]}, {"isVegetarian": false, "title": "Beef satay with crisp noodles", "url": "www_bbc_co_uk_food_recipes_beefsataywithcrispyn_87139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rib-eye beef, cut into strips", "½ tbsp soy sauce", "2 tbsp honey", "½ tsp chilli flakes", "1 tbsp sesame oil", "1 lime, zest and juice", "1 tbsp olive oil", "300ml/½ pint vegetable oil, for deep frying", "50g/2oz rice noodles", "1 tbsp chopped peanuts, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef satay, place the beef into a small bowl with the soy sauce, honey, chilli flakes, sesame oil, lime juice and zest and leave to marinate for ten minutes. ", "Thread the beef onto skewers that have been soaked in water. Heat the olive oil in a pan, add the skewers and brown them on all sides for 1-2 minutes. ", "For the noodles, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully drop in the noodles and cook for two minutes, or until puffed up and crisp. Carefully remove with a slotted spoon and drain on kitchen paper.", "To serve, pile the noodles onto a serving plate, top with the beef satay kebabs and sprinkle with chopped peanuts."]}, {"isVegetarian": false, "title": "Beef sausage toad-in-the-hole with onion gravy", "url": "www_bbc_co_uk_food_recipes_beefsausagetoadinthe_86522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "8 free-range eggs", "570ml/1 pint milk", "1 tbsp olive oil", "6 beef sausages", "75g/3oz beef dripping", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper", "50g/2oz butter", "2 onions, sliced", "1 tbsp instant gravy granules", "1 tbsp yeast extract", "400ml/14fl oz vegetable stock", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the toad-in-the-hole, place the plain flour into a bowl and make a well in the centre. Whisk in the eggs and milk to make a smooth batter. Place in the fridge overnight.", "The next day, when you're ready to cook the toad-in-the-hole, preheat the oven to 220C/425F/Gas 7.", "Heat the olive oil in a frying pan, add the sausages and cook, turning frequently, until browned on all sides.", "Place the beef dripping into a roasting tin and place in the oven. Remove the batter from the fridge and whisk lightly until smooth and combined - it may have separated slightly overnight. Add the thyme leaves and season with salt and freshly ground black pepper.", "Remove the roasting tin from the oven, add the sausages and pour over the batter. Transfer to the oven and bake for 35-40 minutes, then open the oven door to remove the steam. Lower the oven temperature to 180C/350F/Gas 4 and cook for a further ten minutes, until golden-brown. Remove from the oven and leave to stand for a few minutes.", "For the gravy, heat most of the butter in a pan, add the onions and cook for ten minutes, or until soft.", "Add the gravy granules and yeast extract and stir to combine. Add the vegetable stock and bring to the boil. Reduce the heat and simmer for five minutes until thickened. Season with salt and freshly ground black pepper and stir in the remaining knob of butter.", "To serve, place portions of the toad-in-the-hole onto serving plates and pour over the gravy."]}, {"isVegetarian": false, "title": "Beef slices cooked with oloroso sherry", "url": "www_bbc_co_uk_food_recipes_beefslicescookedwith_92904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 2oz potatoes, such as King Edward or Maris Piper, peeled, cut into equal-sized pieces", "2 garlic cloves, peeled", "2 bay leaves", "salt and freshly ground black pepper", "75-110ml/3-4fl oz extra virgin olive oil", "4 x 200g/7oz slices fillet steak, sliced into 1cm/½in wide strips", "salt and freshly ground black pepper ", "2 tbsp extra virgin olive oil, plus extra for drizzling", "1 garlic clove, peeled, finely diced", "1 fresh rosemary sprig", "1 x 225g/8oz jar piquillo peppers, drained, sliced", "6 tbsp dry oloroso sherry", "4 fresh flatleaf parsley sprigs, leaves only, chopped", "4 fresh mint sprigs, chopped", "2 heads crisp lettuce, such as Romaine lettuce, leaves separated, sliced", "25g/1oz flaked toasted almonds", "1 pinch hot smoked paprika"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the olive oil mash, place the potatoes into a large saucepan and just cover with cold water. Add a pinch of salt, the garlic, bay leaves and two tablespoons of the olive oil, then bring the water to the boil. Reduce the heat until the liquid is simmering, then continue to simmer for 10-15 minutes, or until the potatoes are tender. Drain well.", "Return the drained potatoes to the pan, then place the pan over the residual heat for a few seconds to drive off any excess moisture.", "Mash the potatoes until smooth using a potato masher or ricer. Stir in the olive oil until well combined, then season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the beef, season the strips of beef, to taste, with salt and freshly ground black pepper. ", "Heat the oil in a non-stick frying pan or wok over a high heat until it is almost smoking. Add the garlic, beef strips and rosemary and stir-fry for 1-2 minutes, or until the beef has browned.", "Add the piquillo pepper slices and continue to stir-fry for a further minute, then pour in the sherry and boil for 2-3 minutes, or until most of the liquid has evaporated.", "Remove the pan or wok from the heat, then stir in the chopped parsley and mint leaves. ", "To serve, divide the sliced lettuce leaves equally among four serving plates. Spoon over the beef, vegetables and cooking juices. Drizzle over a little more extra virgin olive oil and sprinkle over the flaked almonds and smoked paprika. Spoon the olive oil mash alongside."]}, {"isVegetarian": false, "title": "Beef steak with griddled vegetables and chilli pesto", "url": "www_bbc_co_uk_food_recipes_beefsteakwithgriddle_71404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sweet potato, peeled and cut into 2.5cm/1inch dice", "1 courgette, peeled and cut into 2.5cm/1inch dice", "1 banana shallot, peeled and diced", "1 red chilli, de-seeded and diced", "4 tbsp olive oil", "few sprigs rosemary", "few sprigs thyme", "2 garlic cloves, peeled", "2 tbsp olive oil ", "2 beef steaks", "salt", "freshly ground black pepper", "1 red chilli, de-seeded and diced", "1 chilli, deseeded and roughly chopped", "4 tbsp olive oil", "small handful fresh basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the vegetables, place the potato, courgette, shallot and chilli into a large bowl and coat with the olive oil. ", "Add the rosemary, thyme sprigs and garlic and toss together.", "Heat an ovenproof griddle pan over a high heat and char-grill the vegetables for 4-5 minutes. ", "Transfer the pan to the oven and roast for 8-10 minutes or until the vegetables are soft.", "Meanwhile, generously season the beefsteaks with salt and freshly ground black pepper.", "Heat a griddle pan until searing hot.", "Fry the beefsteaks with the chilli for 2-3 minutes either side, or according to personal taste.", "To make the chilli pesto, place the chilli, olive oil and basil leaves into a mini-food processor and blitz until smooth.", "Serve the steak alongside the vegetables and drizzle with the chilli pesto."]}, {"isVegetarian": false, "title": "Beef stew with dumplings", "url": "www_bbc_co_uk_food_recipes_beefstewwithdumpling_87333", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstewwithdumpling_87333_16x9.jpg", "ingredients": ["2 tbsp olive oil", "25g/1oz butter", "750g/1lb 10oz beef stewing steak, chopped into bite-sized pieces ", "2 tbsp plain flour ", "2 garlic cloves, crushed ", "175g/6oz baby onions, peeled", "150g/5oz celery, cut into large chunks ", "150g/5oz carrots, cut into large chunks", "2 leeks, roughly chopped ", "200g/7oz swede, cut into large chunks", "150ml/5fl oz red wine", "500ml/18fl oz beef stock ", "2 fresh bay leaves", "3 tbsp fresh thyme leaves ", "3 tbsp chopped fresh flatleaf parsley ", "Worcestershire sauce, to taste ", "1 tbsp balsamic vinegar, or to taste", "salt and freshly ground black pepper ", "125g/4½oz plain flour, plus extra for dusting", "1 tsp baking powder", "pinch salt", "60g/2½oz suet", "water, to make a dough", "mashed potato ", "1 tbsp chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.", "Sprinkle over the flour and cook for a further 2-3 minutes.", "Add the garlic and all the vegetables and fry for 1-2 minutes.", "Stir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.", "Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.", "For the dumplings, sift the flour, baking powder and salt into a bowl.", "Add the suet and enough water to form a thick dough.", "With floured hands, roll spoonfuls of the dough into small balls.", "After two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)", "To serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley."]}, {"isVegetarian": false, "title": "Beef stew with Lyonnaise potatoes", "url": "www_bbc_co_uk_food_recipes_beefstewwithlyonnais_85110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, chopped", "100g/3½oz beef fillet, chopped into 2.5cm/1in cubes", "salt and freshly ground black pepper ", "1 tbsp tomato ketchup", "100ml/3½fl oz red wine", "75g/2¾oz tinned borlotti beans, drained", "1 carrot, peeled and chopped", "75g/2¾oz ratte potatoes (or other small, waxy potatoes), peeled and sliced", "1 tbsp fresh breadcrumbs, to serve", "50g/1¾oz unsalted butter", "1 tbsp olive oil", "100g/3½oz ratte potatoes (or other small, waxy potatoes), blanched and sliced", "1 garlic clove, sliced", "½ onion, thinly sliced", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef stew, melt the butter with the oil in a frying pan over a low heat and fry the onion and garlic until soft.", "Add the beef pieces and cook, stirring frequently, until browned on all sides. Season with salt and freshly ground black pepper.", "Add the ketchup and wine and stir well.", "Add the beans, carrot and potatoes and simmer for 10-12 minutes. ", "For the Lyonnaise potatoes, melt the butter with the oil in a frying pan over a medium heat and fry the potatoes for 8-10 minutes, until golden-brown.", "Add the garlic and onion, season with salt and freshly ground black pepper and cook gently until softened.", "To serve, place the stew into a bowl and sprinkle over the breadcrumbs. Place the potatoes alongside and sprinkle over the parsley."]}, {"isVegetarian": false, "title": "Beef stew with dumplings", "url": "www_bbc_co_uk_food_recipes_beefstewwithdumpling_89212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz fresh suet, finely chopped, or 85g/3oz shredded suet", "175g/6oz plain flour, plus extra for dusting", "1 tsp salt", "½ tsp baking powder", "1 tsp horseradish sauce (optional)", "1 handful fresh parsley, chopped (optional)", "dash milk or water", "2kg/4½lb beef brisket", "3 onions, thickly sliced", "3 carrots, thickly sliced", "1 celery stick, cut into 2cm/1in pieces", "350g/12oz potatoes, cut into chunks", "1 bay leaf", "6 sprigs fresh parsley", "water or beef stock, to cover the meat"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the dumplings, mix the suet, flour, salt and baking powder together in a bowl and stir in the horseradish and parsley, if using. Gradually add milk or water to the mixture, mixing well to form a soft dough. With floured hands, roll small pieces of the dough into dumpling-sized balls. Set aside. ", "For the stew, place the beef brisket into a large saucepan and scatter around the onions, carrots, celery, potatoes, bay leaf and parsley. Add enough water or beef stock to cover, then bring to the boil. ", "Cover with a lid, reduce the heat to its lowest and simmer for at least 1-2 hours, or until the meat is tender. Add the dumplings to the stew 20 minutes before the stew is finished cooking. Cover with a lid and do not lift again until the end of the cooking time, or until the dumplings are cooked through. ", "To serve, spoon the stew and dumplings into bowls."]}, {"isVegetarian": false, "title": "Beef stir-fry", "url": "www_bbc_co_uk_food_recipes_beefstirfry_75730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "½ red onion", "1 tomato, cut into wedges", "½ broccoli stem, sliced", "1 garlic clove", "½ tsp ground turmeric", "½ tsp fresh ginger, grated", "150g/5½ oz beef, sliced", "2 tbsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the stir-fry, heat the vegetable oil in a hot wok. Add the red onion and cook for one minute.", "Add the tomato, broccoli, garlic and spices cook for one more minute.", "Add the beef and soy sauce and cook for a further minute.", "Serve immediately."]}, {"isVegetarian": false, "title": "Beef stock", "url": "www_bbc_co_uk_food_recipes_beefstock_1295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb beef bones", "2 carrots, peeled and roughly chopped", "2 onions, peeled and quartered", "2 sticks celery, roughly chopped", "1 tbsp vegetable oil", "8 peppercorns", "2 dried bay leaves", "3-4 fresh parsley stalks", "1 sprig fresh thyme"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6.", "Put the bones in a roasting tin and bake until well browned.", "Put the carrot, onion and celery in another roasting tin and toss in the oil. Bake until well browned.", "Put the vegetables and the bones in a large pan and add the peppercorns, bay leaves, parsley and thyme. Cover with water. ", "Bring to the boil and skim off any scum that has formed. Cover and simmer very gently for 3-4 hours. From time to time, skim off any scum that forms. Strain into a large bowl and allow to cool. Chill overnight. Skim off any fat that has formed on the surface.", "Use within 3 days or freeze. To freeze, reduce the stock by half by boiling vigorously and cool. Pour into ice-cube trays and freeze. When frozen put the cubes into a bag, label it, and when you want to use one, just put in a jug and add boiling water to dissolve the cube."]}, {"isVegetarian": false, "title": "Beef stroganoff with matchstick potatoes", "url": "www_bbc_co_uk_food_recipes_beefstroganoffwithma_71568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstroganoffwithma_71568_16x9.jpg", "ingredients": ["675g/1½ lb beef fillet, preferably cut from the tail end", "65g/2½oz unsalted butter", "1½ tbsp paprika (hot Hungarian, if you like a little subtle heat)", "1 large onion, very thinly sliced", "350g/12oz button mushrooms, thinly sliced", "3 tbsp sunflower oil", "300ml/10fl oz soured cream", "2 tsp lemon juice", "small handful of parsley leaves, finely chopped", "salt", "freshly ground black pepper", "450g/1lb floury potatoes, such as Maris Piper, peeled", "sunflower oil, for deep-frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the steak into slices 1cm/0.5in thick, then cut each slice across the grain into strips 1cm/0.5in wide.", "For the matchstick potatoes, cut the potatoes by hand into short sticks 3mm/0.2in thick or use a mandoline. Set aside in a bowl of cold water.", "Heat the sunflower oil for deep-frying, either in a large pan or in a deep-fat fryer, to 190C/375F.", "Meanwhile, melt the butter in a large frying pan, add the paprika and onion and cook slowly until the onion is soft and sweet, but not browned.", "Add the mushrooms and fry gently for three minutes. Transfer the mixture to a plate and keep warm.", "Drain the matchstick potatoes and dry thoroughly in a clean tea towel or a salad spinner. ", "Plunge the potatoes into the hot oil and fry for three minutes, until crisp and golden. Drain briefly on kitchen paper and keep hot in a low oven.", "Using the same pan you cooked the onion mixture in, heat one and a half tablespoons of sunflower oil until very hot. ", "Add half the fillet steak and fry quickly, seasoning and turning it as you do so, for just over one minute. Transfer to a plate and repeat with the rest of the oil and steak.", "Return the onion mixture to the pan and pour in the soured cream. Bring to the boil and simmer for a minute or so, until thickened.", "Return the steak to the pan and heat very gently for one minute - the beef should not be cooked any further.", "Stir in the lemon juice and parsley and serve with the matchstick potatoes."]}, {"isVegetarian": false, "title": "Beef stroganoff with sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_beefstroganoffwithsa_89439", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstroganoffwithsa_89439_16x9.jpg", "ingredients": ["75g/3oz butter", "1 onion, finely sliced", "150g/5oz white mushrooms, finely sliced", "2 tbsp tomato purée", "1½ tsp Dijon mustard", "½ tsp smoked hot paprika", "110ml/4fl oz beef stock", "500g/1lb 2oz beef fillet, cut into strips", "salt and freshly ground black pepper ", "150ml/5fl oz brandy", "200ml/7fl oz soured cream", "2 tbsp flatleaf parsley", "3 tbsp olive oil", "3 large potatoes, peeled and cubed", "½ onion, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot, then add half the butter. When foaming, add the onion and fry for 2–3 minutes, or until just softened.", "Add the mushrooms and cook for 1–2 minutes.", "Add the tomato purée, mustard and paprika and cook for a further minute.", "Add the beef stock and bring to the boil, then reduce the heat and simmer for 3–4 minutes.", "Season the beef with salt and freshly ground black pepper.", "Heat a separate frying pan and add the remaining butter. When foaming, add the beef and fry for 2–3 minutes on both sides, until browned all over.", "Add the brandy and carefully allow to flambé in the pan. (CAUTION: make sure there are no flammable materials above the pan when flaming.)", "Add the soured cream to the onion and mushroom mixture and mix well.", "When the flames have subsided, add the beef to the soured cream and mushroom mixture and cook for one minute. Season, to taste, with salt and freshly ground black pepper and add the parsley.", "For the sautéed potatoes, heat the oil in a frying pan until hot, then add the potatoes and cook for 2–3 minutes on each side, or until tender and golden-brown all over. Season well with salt and freshly ground black pepper and add the onions. Stir gently to combine.", "To serve, place two spoonfuls of the sautéed potatoes onto each plate and spoon equal portions of the beef stroganoff alongside."]}, {"isVegetarian": false, "title": "Beef suet puddings with cauliflower cheese and kidneys cooked in sherry", "url": "www_bbc_co_uk_food_recipes_beefsuetpuddingswith_92133", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/2oz streaky bacon, finely chopped", "2 tbsp plain flour", "salt and freshly ground black pepper", "1kg/2lb 4oz braising steak or shin, trimmed, cut into 1cm/½in cubes", "2 onions, peeled, finely chopped", "300ml/11fl oz red wine", "500ml/18fl oz good beef stock", "1 bouquet garni (2 sprigs thyme, 1 small bunch parsley and 2 bay leaves tied with cooking string)", "2 tsp Worcestershire sauce", "2 tsp brandy", "butter, for greasing", "375g/13oz self-raising flour, plus extra for dusting", "200g/7oz beef suet", "1 tsp dried thyme", "pinch dried sage", "1 tsp sea salt", "110-150ml/4-5fl oz cold water", "1 free-range egg yolk, plus 1 egg, beaten, for egg wash", "2 large potatoes, unpeeled", "50g/2oz butter", "2 tbsp olive oil", "½ medium onion, peeled, finely chopped", "1 celery stalk, trimmed, finely chopped", "1 carrot, peeled, finely chopped", "2 garlic cloves, crushed", "2 tsp fresh thyme leaves", "8 lambs' kidneys, outer membranes removed, cut in half", "4 tbsp dry sherry", "2 tbsp crème fraîche", "salt and freshly ground black pepper", "2 tbsp chopped fresh flatleaf parsley", "1 head cauliflower, core removed, broken into florets", "2 tbsp double cream", "salt and freshly ground black pepper", "150g/5oz Lincolnshire Poacher cheese, grated", "500g/1lb 2oz frozen peas", "1 tsp dried oregano", "knob of butter"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, heat the oil in a heavy-based pan over a medium heat. Add the bacon and fry for 6-8 minutes, or until crisp and golden-brown. ", "Sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Dredge the cubes of beef in the seasoned flour until coated.", "Add the coated beef cubes to the pan with the bacon in it and fry for 4-5 minutes, turning regularly, until browned. ", "Add the onions and continue to fry for 3-4 minutes, or until softened but not coloured. ", "Add the wine, stock, bouquet garni, Worcestershire sauce and brandy and stir to combine. Cover the pan with a lid and bring the mixture to a simmer. Continue to simmer until the meat is tender and falling apart (about two hours if using braising steak, or three hours if using shin). ", "When the meat is tender, increase the heat and bring the cooking liquid to the boil. Continue to cook for 25-30 minutes, or until the volume of liquid has reduced by about half. Remove from the heat and set aside to cool.", "Meanwhile, for the suet puddings, grease eight small pudding basins with butter.", "In a bowl, mix together the flour, suet, thyme, sage and salt until well combined. ", "Gradually add just enough water until the mixture comes together as a firm dough (you may not need to use all of the water). ", "Add the egg yolk and knead it into the dough until well combined. Cover the bowl and chill the dough in the fridge for at least 30 minutes.", "When the dough has chilled, pinch off eight equal portions of the dough. ", "Roll the first portion of dough into a ball and pinch off about a quarter of it. Roll the larger ball of dough out onto a lightly floured work surface into a large thin circle (set the smaller portion aside).", "Line one of the prepared pudding basins with the suet pastry disc. ", "Fill the lined pudding basin with some of the beef and red wine sauce until it is three-quarters full. ", "Roll out the smaller portion of suet pastry onto a lightly floured work surface until it is just larger than the top of the pudding basin. ", "Brush the rim of the lined pudding basin with a little of the beaten egg. Cover the pudding basin with this pastry 'lid', pressing the edges of the pastry together to seal. Trim off any excess.", "Brush the pastry 'lid' all over with a little more of the beaten egg. ", "Repeat the process with the remaining suet pastry and filling mixture until you have prepared eight individual puddings and all of the beef has been used up (reserve any leftover red wine sauce).", "Wrap each pudding basin tightly in two sheets of aluminium foil. ", "Prepare a steamer large enough to hold all of the pudding basins (alternatively, cook the puddings in batches). Steam the puddings for 25-30 minutes, or until cooked through. ", "Meanwhile, for the parmentier potatoes, boil the potatoes, whole and in their skins, in a large pan of salted water for 18-20 minutes, or until tender. Drain well and set aside to cool. Once cool, peel away the skins and cut the potatoes into 1cm/½in cubes. Set aside to cool, then chill in the fridge.", "Heat the butter in a frying pan over a medium heat. Add the cold diced potatoes and fry for 3-4 minutes, or until golden-brown on all sides. Remove from the heat and set aside.", "Meanwhile, for the kidneys, heat one tablespoon of the oil in a frying pan over a medium heat. Add the onion, celery and carrot and fry for 4-5 minutes, or until softened. ", "Add the garlic and thyme and fry for a further 1-2 minutes. ", "In a separate frying pan, heat the remaining tablespoon of olive oil over a medium heat. Add the kidneys and cook for 5-6 minutes, or until just browned.", "Add the browned kidneys to the pan with the vegetables in it. ", "Add the sherry to the pan the kidneys were cooked in and bring to a simmer, scraping up any browned bits from the bottom of the pan using a wooden spoon to deglaze. Add the sherry and pan juices to the vegetables and kidneys and stir well to combine. Continue to cook for a further 1-2 minutes.", "Stir in the crème fraîche and heat through. Season, to taste, with salt and freshly ground black pepper. Stir in the parsley. Keep warm.", "For the cauliflower cheese, boil the cauliflower florets in a pan for 4-5 minutes, or until tender. Drain well and pat dry with kitchen paper.", "Transfer the cauliflower florets to a food processor. Add the cream and blend to a purée. Season, to taste, with salt and freshly ground black pepper.", "Return the mixture to a clean pan and warm over a low heat. Stir in the cheese until melted.", "For the peas, boil the peas in a pan of boiling water until tender. Drain well and return the peas to the pan. Stir in the oregano and butter. Season, to taste, with salt and freshly ground black pepper. Crush lightly with a potato masher. Set aside and keep warm.", "Just before serving, heat the remaining red wine sauce in a pan until warmed through.", "Strain the sauce through a fine sieve. Add a knob of butter to the strained liquid and stir until melted. ", "To serve, unwrap one beef suet pudding and turn it out of its mould and onto a serving plate. Spoon some of the kidneys alongside. Press a portion of the crushed peas into a chefs' ring and remove the ring. Spoon the cauliflower cheese purée and parmentier potatoes alongside. Drizzle over the red wine sauce."]}, {"isVegetarian": false, "title": "Beef 'tagliata'", "url": "www_bbc_co_uk_food_recipes_beeftagliata_87876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/11fl oz soy sauce ", "1 red chilli, roughly chopped", "3 garlic cloves, roughly chopped", "110ml/4fl oz sunflower oil", "1.35kg/3lb beef fillet, trimmed", "1 bunch coriander", "6 tbsp soy sauce ", "1 tbsp ginger root, finely chopped", "1 red chilli, finely chopped", "2 garlic cloves, finely chopped", "½ lemon, juice only", "1 tbsp Thai fish sauce", "1 tbsp soft light brown sugar", "4 tbsp coriander leaves, roughly chopped", "4 large handfuls mixed peppery winter leaves (such as rocket, Golden Streaks mustard, Osaka Purple mustard, Treviso, chicory or Variegata del Castelfranco), refreshed in cold water and dried"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the beef, place the soy sauce, chilli, garlic and oil in a blender or food processor and blend until smooth. ", "Place the beef in a non-reactive bowl and pour the marinade over the beef. Cover with cling film and leave the beef to marinate for several hours or overnight in the fridge. Turn the beef in the marinade from time to time. When you are ready to cook, remove the beef from the fridge and bring it to room temperature.", "Preheat the oven to 220C/430F/Gas 7.", "Heat a large ovenproof frying pan until hot, carefully lift the beef out of the marinade (discarding the marinade), place the beef in the pan and sear on each side until brown. Place in the oven and roast for 20-25 minutes.", "Remove the beef from the oven and allow it to cool in the frying pan.", "For the salad, place the soy sauce, ginger, chilli, garlic, lemon juice, fish sauce and sugar in a bowl and whisk to combine.", "To serve, arrange the leaves on a plate. Thinly slice the beef fillet and arrange it over the salad leaves. Drizzle with the dressing and serve."]}, {"isVegetarian": false, "title": "Beef tagliata with crushed hot Jerseys", "url": "www_bbc_co_uk_food_recipes_beeftagliatawithcras_83002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 small Jersey Royals or other new potatoes, scrubbed", "olive oil, for drizzling", "1 tsp caraway seeds", "1 tbsp thyme sprigs", "salt and freshly ground black pepper", "2 branches small tomatoes on the vine", "½ tsp sea salt", "½ tsp cracked black peppercorns", "1 tsp chopped rosemary needles", "2 x 200g/7oz rib-eye steaks, about 2cm/1in thick", "olive oil, for brushing", "100g/3½oz rocket leaves", "1 tbsp olive oil", "1 lemon, quartered"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8. ", "Cook the potatoes in boiling salted water for 15 minutes or until just tender, then drain. ", "Place on a baking tray and squash each potato with a potato masher. Drizzle with olive oil, scatter with caraway seeds, thyme, salt and freshly ground black pepper and bake in the oven alongside the tomatoes for 30 minutes or until very crisp and golden brown, removing the tomatoes when soft. ", "For the steaks, mix the sea salt, pepper and rosemary together on a plate. Brush the steaks with olive oil and press into the seasoning on both sides.", "In a frying pan, briskly sear the steaks on one side until well-browned, then turn once and cook briefly for a medium rare result. Set aside to rest. ", "To serve, toss the rocket with the olive oil. Slice the steak into fingers, loosely arrange over a large platter, strew with the roasted tomatoes and lemon quarters, and serve with the potatoes and rocket."]}, {"isVegetarian": false, "title": "Beef Wellington", "url": "www_bbc_co_uk_food_recipes_beefwellington_2063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefwellington_2063_16x9.jpg", "ingredients": ["1 piece of beef fillet - approx 1.35kg/ 3lb ", "a little olive oil", "15g/½oz unsalted butter", "salt and pepper", "175g/6oz chicken liver pate", "4 shop bought pancakes ", "1 small free-range egg, beaten ", "55g/2oz unsalted butter ", "150g/5oz shallots, peeled and finely diced", "250g/9oz flat black mushrooms, chopped", "3 tbsp double cream", "salt and pepper", "1 packet shop bought, ready rolled (all butter)puff pastry"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a non-stick frying pan, when hot add the seasoned beef and seal on sides. Remove from the pan and allow to cool completely.", "To make the duxelle stuffing, in the same frying pan add the butter and when", "hot and foaming, add the shallots and cook until softened and golden. Add the mushrooms and cook until all the liquid evaporates.  ", "Add the cream, salt and pepper. Continue to gently heat until it has reduced to a thick purée.  Set aside to cool completely.", "preheat the oven to 230C/450F/Gas8. ", "Roll the pastry to fit the beef and lay two of the pancakes on top, slightly overlapping. Spread a strip of chicken liver pate across the centre of the pancakes - to the same width as the beef fillet.", "Make a cut about ¾ of the way through the beef into the centre of the beef fillet and fill with the cooled duxelle mix. Place the beef on to the pancakes and cover with the remaining two pancakes. Cut away the middle of the ends of the pastry. Fold over the main part of the meat and then neatly fold the ends.", "Brush the edges with a little water. Place seam side down on a large baking tray.  Decorate the top with extra pastry if desired and then brush all over with the beaten egg.", "Place it in the oven for 10 minutes, then reduce the heat to 190C/375F/Gas 5 and continue to cook for another 20 minutes, until the pastry is golden. ", "Remove from the oven to a carving board and allow to rest for 5 minutes before carving into thick slices."]}, {"isVegetarian": false, "title": "Beef taquitos", "url": "www_bbc_co_uk_food_recipes_beeftaquitos_83669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 large onion, finely sliced", "2 cloves garlic, peeled and finely chopped", "500g/1lb 2oz sirloin steak, cut into 1cm/½in cubes", "1 tsp dried oregano", "1 tsp ground cumin", "1 tsp caster sugar", "3 tbsp tomato purée", "salt and freshly ground black pepper ", "100ml/3½fl oz beef stock", "2 tbsp chopped fresh coriander", "8 ready-made flour tortillas", "250g/9fl oz soured cream", "1 tsp cayenne pepper", "2 tbsp warm water", "3 tbsp chopped fresh chives", "salad leaves of your choice", "squeeze lemon juice"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the taquitos, heat the olive oil in a large saucepan over a medium heat. Add the onion and garlic and fry until softened.", "Add in the steak and fry for two minutes, until the meat starts to brown.", "Add the oregano, cumin, sugar and tomato purée. Season with salt and freshly ground black pepper, stir well and leave to cook for a further minute.", "Add the beef stock, bring to the boil and reduce the heat to simmer for a further 5-6 minutes, until the sauce thickens and the meat is cooked through.", "Add the coriander and stir in.", "Fill the centre of each flour tortilla with the beef mixture and roll each up like a big cigar. Place two onto each of four plates.", "For the dressing, place the soured cream, cayenne pepper, warm water and chives into a bowl and mix well.", "To serve, drizzle the dressing over the taquitos and serve with a lemon juice-dressed salad of your choice."]}, {"isVegetarian": false, "title": "Beef Wellington", "url": "www_bbc_co_uk_food_recipes_beefwellington_74657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 4 oz middle cut beef fillet, trimmed", "¼ bunch of thyme, finely chopped", "sea salt and freshly ground black pepper", "55g/2oz butter", "1 clove of garlic, finely chopped", "500g/1lb 2oz flat field mushrooms, finely chopped", "a few drops of truffle oil", "1 tbsp finely chopped parsley", "English mustard, to taste", "500g/1lb 2oz block puff pastry", "1 egg, lightly beaten, to seal the pastry", "melted butter, to glaze"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the beef with the thyme, sea salt and pepper and rest for 30 minutes.", "Heat a pan and sear each side of the beef until golden brown.", "Allow to cool to room temperature.", "For the Duxelles, sweat the butter, garlic and mushrooms in a pan over a low heat until all the moisture evaporates.", "Add the truffle oil and parsley, and season to taste.", "Remove from the heat and allow to cool to room temperature.", "Smear the beef with an even coating of English mustard.", "Lightly dust a sheet of baking paper with flour.", "Roll the pastry so it is a little wider than the beef, and the beef can be completely rolled in pastry.", "Place the pastry so the longest half is facing you. ", "Spread the Duxelle mixture evenly over the half of the pastry closest to you.", "Place the beef on top of the mushroom mix.", "Roll the beef up in the pastry, leaving a slight overlap of 3cm/1¼in. Brush this with beaten egg and seal.", "Trim the ends of the pastry so they are flush with the beef.", "Cut a sheet of baking paper to the size of the beef Wellington. ", "Place the beef Wellington on the paper, lightly brush the top with melted butter and refrigerate for 30 minutes.", "Put the beef Wellington in the oven and cook for 25 minutes or until dark golden in colour.", "Serve with steamed spinach or roast vegetables of your choice."]}, {"isVegetarian": false, "title": "Beef Wellington", "url": "www_bbc_co_uk_food_recipes_beefwellington_87631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz piece beef fillet, trimmed ", "salt and freshly ground black pepper ", "2 tbsp vegetable oil ", "1 tbsp fresh thyme leaves", "350g/12oz coarse duck pâté", "2 tbsp English mustard ", "250g/9oz ready-made puff pastry ", "1 free-range egg, beaten", "2 tbsp butter"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Season the beef with the salt and freshly ground black pepper and sprinkle with the thyme.", "Heat a large frying pan until very hot, then drizzle with the oil. Add the beef and cook briefly, turning occasionally, until golden-brown on all sides. ", "Remove the beef and allow to cool.", "Spread the mustard all over the beef, then spread the pâté evenly over one side of the beef.", "Roll the puff pastry out to dimensions that will wrap around the beef to completely enclose it.", "Place the beef on top of the pastry and roll it up to form a parcel. Brush the edges with beaten egg and press down to seal.", "Trim away any excess overlapping pastry and brush the beef Wellington all over with beaten egg. Transfer to the fridge to chill for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6. Place a baking tray in the oven to preheat.", "Place the beef Wellington onto a sheet of buttered baking parchment, then transfer onto the hot baking tray (so that the beef Wellington cooks evenly).", "Transfer to the oven to bake for 30 minutes, until the pastry is golden-brown and the beef is cooked to your liking. (A meat thermometer is a good guide in this case.)", "Remove from the oven and allow to rest for five minutes, then serve in slices with your chosen vegetables."]}, {"isVegetarian": false, "title": "Beef Wellington with purple broccoli and jus", "url": "www_bbc_co_uk_food_recipes_beefwellingtonwithne_84172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4½floz ice-cold water", "2 free-range egg yolks, beaten, for egg wash", "2 free-range eggs", "4 tbsp plain flour", "100ml/3½fl oz milk", "knob of butter", "25g/1oz butter", "4 Portobello mushrooms, finely chopped", "250g/9oz large leaf spinach, blanched", "500g/1lb 2oz beef fillet, middle section", "freshly ground black pepper", "200g/7oz chicken liver pâté", "400g/14oz purple sprouting broccoli", "2 tbsp olive oil", "500ml/18fl oz beef stock", "150ml/5fl oz red wine"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, place the flour in a mound on a clean work surface and make a well in the centre. ", "Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated, but don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly.", "Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes. ", "Flour the work surface and roll out the pastry into a 40x20cm/16x8in rectangle.", "Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn. ", "Roll the block of pastry into a 40x20cm/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes.", "Give the chilled pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap the pastry in cling film and refrigerate for at least 30 minutes before using.", "For the pancakes, place the eggs and flour into a bowl and whisk together.", "Gradually add the milk, whisking constantly, to create a smooth batter that will coat the back of a spoon.", "Heat a frying pan over a high heat and add the butter. When the butter is foaming, add a ladleful of the pancake batter and swirl the pan to evenly coat the base. Fry for 1-2 minutes, or until the underside is golden-brown. Carefully flip the pancake over and cook for a further minute, or until the pancake is cooked through and golden-brown all over. Slide the pancake out onto a plate lined with greaseproof paper, then cover with another layer of paper. Repeat with the remaining pancake batter to make another pancake.", "For the duxelle, heat the butter in the frying pan until foaming, then add the mushrooms and fry for 3-4 minutes, or until the mushrooms are golden-brown. Season well with salt and freshly ground black pepper, then set aside to cool.\t", "For the beef Wellington, preheat the oven to 200C/400F/Gas 6.", "Season the beef fillet with black pepper then place into a frying pan over a high heat. Turn the fillet to ensure even cooking. Remove when browned on each side and leave to rest in a warm place.", "Roll out the puff pastry until 5mm/¼in thick. Take two pancakes and place into the centre of the pastry, and cover with a layer of chicken liver pâté, then a layer of the cooked mushrooms, then a layer of spinach on top.", "Beat the beaten egg and egg yolk together in a bowl, then brush the egg over the clear area of the pancakes and pastry and fold the pastry around to enclose the beef. Press the open ends together to seal the pastry covering and make it a close fit to the beef. Trim off any excess pastry.", "Place the beef Wellington seam-side down onto a baking tray lined with baking parchment and brush with the beaten egg. Place in the fridge to cool for 30 minutes.", "Remove from the fridge and brush with egg once more.", "Place into the oven and bake for 25 minutes (if you do not like your beef rare cook for 30-35 minutes for medium), or until the pastry is golden-brown, then remove and leave to rest on a serving plate for 15 minutes.", "For the purple sprouting broccoli and jus, place a large pan of boiling water on the hob. Once boiling, place the broccoli in the pan and cook for 3-4 minutes. ", "Drain the broccoli and heat a large frying pan and add the oil. Once hot, add the broccoli and cook for 2-3 minutes.", "Place the stock in a pan and boil to reduce in volume by half. Add the red wine and reduce again to half the volume.", "To serve, cut the Wellington into portions and place on a plate serve with the broccoli and jus."]}, {"isVegetarian": false, "title": "Beef with onion and green pepper", "url": "www_bbc_co_uk_food_recipes_beefwithonionandgree_70528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz roast beef or roast lamb, cooked and boneless ", "¼ tsp freshly ground black pepper", "¼ - ½ tsp chilli powder", "1 tsp ground cumin", "1 tsp ground coriander", "¼ tsp ground turmeric", "1 tsp red wine vinegar", "salt", "3 tbsp vegetable oil  ", "½ tsp cumin seeds", "½ tsp black or yellow mustard seeds", "10 fenugreek seeds (optional)", "115g/4¼oz green pepper, deseeded and cut, lengthways, into 3mm slivers", "140g/5oz onions peeled and cut into fine half-rings", "1 tsp Worcestershire sauce"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the cooked meat into 5 mm slices. Stack a few slices together at a time and cut into 5 mm slivers. This does not have to be done too evenly.  ", "Combine the black pepper, chilli powder, ground cumin, ground coriander, turmeric, vinegar, ½ tsp salt and 2 tb water in a small cup.  Mix and set aside.", "Put the oil in a large frying pan over medium-high heat.  ", "When hot, put in the cumin, mustard and fenugreek seeds.", "As soon as the mustard seeds begin to pop, put in the green pepper and onion.  Stir and fry until the onion has browned quite a bit and the mass of vegetables has reduced.  ", "Sprinkle about 1/8 tsp salt over the top and stir.  ", "Add the meat and the spice mixture from the cup. Stir rapidly on the same medium-high heat for a minute or so until the meat has heated thorough.  ", "Add the Worcestershire sauce and stir to mix."]}, {"isVegetarian": false, "title": "Beef with cashew crust and wild mushroom sauce", "url": "www_bbc_co_uk_food_recipes_beefwithcashewcrusta_85588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz beef fillet", "salt and freshly ground black pepper ", "1 tbsp wholegrain mustard", "50g/2oz breadcrumbs", "50g/2oz cashew nuts, roughly crushed", "2 tbsp chopped fresh parsley ", "50g/2oz unsalted butter", "1 tbsp olive oil", "½ onion, finely chopped", "1cm/½in piece fresh ginger, finely chopped", "1 garlic clove, finely chopped", "100g/3½oz wild mushrooms", "dash soy sauce", "50ml/2fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the beef with cashew crust, rub the beef all over with olive oil and season well with salt and freshly ground black pepper.", "Heat an ovenproof frying pan until hot and fry the beef for 2 minutes on each side. Spread the mustard over the top of the beef.", "Place the breadcrumbs, cashew nuts and parsley into a bowl and mix well. Press this mixture onto the mustard-covered beef, then transfer to the oven and bake for five minutes, or until the crust is golden-brown and the beef is cooked to your liking.", "For the wild mushroom sauce, heat the butter and oil in a frying pan and gently fry the onion, ginger and garlic until softened but not coloured.", "Add the wild mushrooms and soy sauce and cook until the mushrooms have softened. Add the cream, season, to taste, with salt and freshly ground black pepper and stir well.", "To serve, place the beef onto a plate and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Beef with whisky and mushroom cream, wilted spinach and crushed tatties", "url": "www_bbc_co_uk_food_recipes_beefwithwhiskyandmus_84588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp black peppercorns, coarsely ground, sieved, dust discarded", "4 x 175g/6oz fillet steaks, cut in half", "4 tsp Dijon mustard", "freshly ground sea salt and freshly ground pepper", "2 tbsp sunflower oil", "50g/2oz butter", "200g/7oz fresh cep (porcini) mushrooms, thickly sliced", "450g/1lb new potatoes, scrubbed, boiled until tender", "50g/2oz butter", "salt and freshly ground white pepper", "3 tbsp chopped flatleaf parsley", "25g/1oz butter", "500g/1lb 2oz baby leaf spinach", "3 tbsp water", "salt and freshly ground white pepper", "50ml/2fl oz whisky", "50ml/2fl oz beef stock", "50ml/2fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the steaks, spread the coarse black pepper pieces over a small plate. Coat all sides of the steaks with the Dijon mustard and then press them into the crushed peppercorns to coat.", "Heat a large frying pan until very hot and add the sunflower oil. Season the steaks with salt, then add to the pan to cook for 1-2 minutes. Turn once to brown both sides (don't move the steaks around once they are in the pan or the peppercorn crust will fall off - cook to achieve a good crusty coating on each side.)", "Add the butter and allow it melt and turn nut-brown in colour, but don't let it burn.", "Add the mushrooms and stir in the butter. As the mushrooms start to absorb the pan juices, turn the steaks again and allow them to cook for 3-4 minutes on each side, or until cooked to your liking. ", "Remove the steaks and place onto a baking tray and leave to rest in a warm place.", "For the tatties, place the potatoes into a large mixing bowl. Add the butter and gently crush each potato with a fork until it just splits. Season, to taste, with salt and freshly ground white pepper, and add the parsley. Mix until all the butter has been absorbed, but don't over-mash the potatoes.", "For the spinach, heat a medium frying pan or wok until hot. Add the butter and the spinach and stir-fry for one minute, then add the water. Continue to stir until the spinach has wilted. Remove from the heat, season, to taste, with salt and freshly ground white pepper and set aside until ready to serve.", "For the whisky sauce, add the whisky to the pan used to cook the steaks, and cook over a very high heat for one minute to boil off the alcohol. (CAUTION: the whisky may catch fire, which is perfectly acceptable, but if this worries you, have a large lid handy to place onto the pan to prevent the flames. And make sure you have your extractor fan turned off.)", "Add the stock and boil to reduce the liquid volume, until thickened, then add the cream. Boil to reduce the liquid volume again, scraping and stirring to loosen the stuck bits from the bottom of the pan.", "Pour any juices released by the resting steaks into the sauce and stir well.", "To serve, place a chefs' ring into the centre of each of four plates. Fill with the crushed potatoes and carefully remove the ring. Place a small pile of spinach onto the potatoes, and arrange two medallions of steak on top of each pile. Spoon the sauce and the mushrooms over the steak, and serve."]}, {"isVegetarian": false, "title": "Beer-battered mackerel with beetroot salad", "url": "www_bbc_co_uk_food_recipes_beer-battered_mackerel_44962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz olive oil", "50ml/1¾fl oz balsamic vinegar", "1 large cooked red beetroot, cut into cubes", "1 medium yellow beetroot, thinly sliced", "1 medium candied beetroot, thinly sliced", "½ bunch fresh dill, roughly chopped", "250g/9oz crème fraîche", "405g/15oz plain flour, plus extra for dusting", "300ml/10fl oz beer", "oil, for deep frying", "2 mackerel fillets, bones removed, halved lengthways", "salt and freshly ground black pepper", "150g/5½ozrocket, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the oil and vinegar with all the beetroot and season well.", "Mix the dill with the crème fraîche and season.", "Place the flour in a large bowl and whisk in the beer, a little at a time, until smooth.", "Preheat a deep-fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended).", "Dust the mackerel with flour, shaking off the excess, dip into the batter and fry for 3–5 minutes, or until golden-brown. Drain on kitchen paper and season well.", "Divide the beetroots between two plates and top with the dill crème fraîche. Place the mackerel on top and garnish with rocket. "]}, {"isVegetarian": false, "title": "Beer-battered scampi with tartare sauce", "url": "www_bbc_co_uk_food_recipes_beer-battered_scampi_68196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16-20 wild Scottish scampi tails, peeled and thawed (if frozen)", "4 tbsp plain flour", "½ tsp fine sea salt", "lemon wedges, to serve", "75g/3oz cornflour", "200g/7oz plain flour", "1 tsp fine sea salt", "330ml/12fl 0z bottle of real ale", "2 tbsp white wine vinegar", "2 free-range egg yolks", "1 tbsp white wine vinegar", "2 tsp Dijon mustard", "¼ tsp caster", "pinch fine sea salt", "150ml/5fl oz sunflower oil", "50ml/2fl oz extra virgin olive oil", "50g/2oz capers, drained and roughly chopped", "50g/2oz mini gherkins (cornichons), drained and thinly sliced", "2 tbsp chopped fresh parsley ", "1 tbsp chopped fresh tarragon "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tartare sauce, whisk the egg yolks, vinegar, mustard, sugar and salt in a bowl with a large metal whisk until well combined. Gradually add the oil, a few drops at a time, whisking until the mayonnaise is smooth and very thick. ", "Stir in the capers, gherkins, parsley, tarragon and plenty of freshly ground black pepper. Cover the surface of the sauce with clingfilm and set aside for 20 minutes.", "For the batter, mix the cornflour, plain flour and salt together in a large bowl. Make a well in the centre and stir in two-thirds of the ale. Beat with a large metal whisk to make a smooth batter. Gently whisk in the remaining ale and the vinegar. Set aside.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 190C/375F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "For the scampi, put four tablespoons of flour in a large, plastic food bag and season with salt. Add the scampi tails, one at a time, and shake to coat in the seasoned flour.", "Stir the batter and then dip one piece of floured scampi into the batter until thoroughly coated. Remove with tongs and gently place it in the hot oil. Repeat the process with a further 3-4 pieces of scampi and add to the pan. Cook for 3-4 minutes until golden-brown and crisp. ", "Remove the scampi and drain on kitchen paper. Keep warm. Bring the oil back to temperature, and cook the remaining tails in 2-3 more batches.", "Spoon the sauce into four small dishes – ramekins are good – and put on four warmed plates. Divide the scampi amongst them, add lemon wedges for squeezing and serve. "]}, {"isVegetarian": false, "title": "Beer-marinated rack of pork with Swiss-chard gratin", "url": "www_bbc_co_uk_food_recipes_beer-marinated_rack_of_35117", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beer-marinated_rack_of_35117_16x9.jpg", "ingredients": ["2 tbsp sea salt flakes", "2 tbsp dark brown sugar", "1 tsp black peppercorns", "4 garlic cloves, lightly crushed", "2 bay leaves", "2 tbsp yellow mustard seeds, 1 tbsp soaked in cold water overnight", "4 sprigs fresh thyme", "4 sprigs fresh flatleaf parsley", "500ml/18fl oz beer, preferably a good-quality ale", "1 x 1-1.2kg/2lb 4oz-2lb 10oz six-rib pork loin rack, French-trimmed (ask your butcher to do this for you)", "75g/2½oz unsalted butter", "100g/3½oz brioche, roughly torn", "1 tsp English mustard powder", "1 tbsp brown mustard seeds, soaked in water overnight", "700g/1lb 9oz Swiss chard, trimmed, chopped into 2cm/¾in slices", "2 large potatoes, peeled and cut into 1.5cm/½in pieces", "1 onion, sliced", "50g/1¾oz unsalted butter", "50g/1¾oz plain flour", "400ml/14fl oz full-fat milk", "200ml/7fl oz chicken stock", "100g/3½oz Gruyère, grated", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork, pour 100ml/3½fl oz cold water into a large saucepan. Add the sea salt flakes and sugar and heat over a low heat until dissolved, stirring well. Remove the pan from the heat and add 400ml/14fl oz cold water, the peppercorns, garlic, bay leaves, unsoaked yellow mustard seeds, thyme, parsley and beer.", "If the pork loin rack fits into the pan, add it to the pan. Otherwise, place the pork loin rack in a large bowl and pour over the liquid. Cover and chill in the fridge for 24 hours to marinate, turning the pork occasionally.", "When the pork has marinated, preheat the oven to 200C/180C Fan/Gas 6. ", "Remove the pork from the marinade and pat dry with kitchen paper. ", "Heat 50g/1¾oz of the butter in a large frying pan over a medium heat. When the butter is foaming, add the pork loin rack and fry for a few seconds on all sides, or until lightly browned all over. Transfer the pork loin rack to a roasting tray and roast in the oven for 15 minutes.", "Meanwhile, blend the brioche, English mustard powder and soaked yellow and brown mustard seeds to a paste in a food processor with the remaining butter. Season, to taste, with salt and freshly ground black pepper, then set aside.", "For the gratin, arrange half of the Swiss chard in a layer at the bottom of an ovenproof dish and top with half the potatoes. Sprinkle over the onion, then top with layers of the remaining Swiss chard and potatoes.", "Melt the butter in a saucepan over a medium heat. Add the flour and whisk well to combine with the melted butter. Continue to cook for 1-2 minutes, whisking regularly, then gradually pour in the milk, whisking continuously, until all of the milk has been incorporated and the mixture has thickened to a smooth sauce. ", "Whisk in the stock and half of the Gruyère and stir until melted. Season, to taste, with salt and freshly ground black pepper.", "Pour the sauce all over the chard and potatoes. Sprinkle over the remaining Gruyère. ", "After the pork has been cooking for 15 minutes, remove it from the oven and decrease the temperature to 180C/160C Fan/Gas 4. ", "Spread the brioche and mustard paste all over the top of the pork loin rack in a thick layer, then return the pork to the oven, along with the Swiss-chard gratin. Cook both for a further 45 minutes, or until the pork is cooked to your liking and the crumb has crisped up and turned golden-brown, and the Swiss-chard gratin is bubbling and golden-brown.", "When the pork is cooked to your liking, set it aside to rest for 15 minutes (keep warm). Continue cooking the Swiss-chard gratin for a further 15 minutes, if necessary; otherwise, keep warm.", "To serve, carve the pork loin rack into six chops. Place one onto each serving plate and spoon the Swiss-chard gratin alongside."]}, {"isVegetarian": false, "title": "Beer-splashed jerk chicken with chargrilled sweetcorn and herby rice", "url": "www_bbc_co_uk_food_recipes_beer-splashed_jerk_23004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in fresh ginger, chopped", "2 garlic cloves, roughly chopped", "1 Scotch bonnet chilli, seeds removed and finely chopped", "2 tbsp jerk seasoning", "50-75ml/2-2½fl oz dark soy sauce", "1 tsp thyme leaves", "2-3 tbsp olive oil", "1 onion, roughly chopped", "4 skinless, boneless chicken pieces, cut into bite-sized pieces", "2 bell peppers of various colours, seeds removed and roughly chopped", "2 tbsp honey ", "2 tbsp dark brown sugar  ", "1 x 330ml/11fl oz bottle of beer", "300ml/10fl oz chicken stock", "salt and freshly ground black pepper", "2 ears sweetcorn on the cob, each cut into 4 pieces ", "drizzle olive oil", "300g/10½oz basmati rice", "6 cloves", "2 bay leaves", "handful chopped coriander and parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the jerk chicken, blend the ginger, garlic, chilli, jerk seasoning, dark soy sauce and thyme leaves in a food processor until smooth. ", "Heat the olive oil in a large pan and fry the onions for 2-3 minutes or until softened. Add the chicken pieces and peppers and fry until browned. ", "Add the jerk paste to the pan and cook for a further few minutes. Stir in the honey, sugar and pour in the beer. Deglaze by scraping the base of the pan to release any caramelised residue. Stir in the chicken stock, season with salt and black pepper and reduce the heat. Cook for 20-25 minutes, or until the sauce has thickened and the chicken is cooked through. ", "Drizzle the sweetcorn pieces with a touch of olive oil and char-grill on a hot griddle pan for a few minutes on each side, until nicely charred. Season with salt and black pepper. Keep warm in the oven if necessary.", "For the herby rice, place the basmati rice in a sieve and wash with cold water until the water runs clear. Drain. Place the rice in a saucepan with the cloves and bay leaves. Cover with water until it is ½in/1cm above the rice and bring to the boil. Reduce the heat, cover with a lid and simmer gently for 12-15 minutes or until cooked. Once cooked, stir through the coriander and parsley. ", "To serve, spoon the herby rice onto serving plates. Spoon the jerk chicken alongside and add the char-grilled sweetcorn pieces."]}, {"isVegetarian": true, "title": "Beer and honey rye flour oatcakes", "url": "www_bbc_co_uk_food_recipes_beer_and_honey_rye_flour_42117", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["90g/3¼oz rye flour", "90g/3¼oz strong white flour", "180g/6¼oz oats, blended to a coarse powder in a food processor", "10g/¼oz fast action dried yeast", "1½ tsp sea salt", "1 tbsp runny honey", "1½ tsp sunflower oil", "300ml/10fl oz warm water", "450ml/16fl oz pale ale ", "butter or oil, for frying"], "serves": "Makes 12-16", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a large bowl combine both flours, the blended oats, yeast and salt.  In a separate jug mix together the honey, sunflower oil and the warm water.  Make a well in the dry ingredients and add the liquid mixture.  ", "Add the beer and mix well. The dough will be runny, like a thick sauce.  Cover with a damp tea towel and leave in a warm place for an hour.  The mixture will start to bubble and thicken.", "To cook the oatcakes, melt a little bit of butter in a large non-stick frying pan over a medium heat. Pour a ladle full of the mixture and turn it round in the pan, as if you’re making a pancake. ", "Cook until the oatcake is brown and crisp on the underside and you can confidently turn it over (approximately five minutes).  Flip it over and cook the other side in the same way.  ", "Transfer to a cooling rack until ready to serve.  ", "Repeat with the remaining mixture."]}, {"isVegetarian": false, "title": "Beer battered hake with mushy peas and tartare sauce", "url": "www_bbc_co_uk_food_recipes_beer_battered_hake_with_37004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dried marrowfat peas", "1 tsp bicarbonate of soda", "25g/1oz butter", "sea salt and freshly ground black pepper", "1 lemon, cut into wedges", "200g/7oz plain flour", "15g/½oz fresh yeast", "pinch salt", "pinch caster sugar", "200ml/7fl oz beer", "1 tbsp cider vinegar", "vegetable oil, for deep frying", "4 x 200g/7oz hake fillet, skin on, pin boned and trimmed", "1 onion, sliced into rings", "4 slices thick white bread", "butter, for the bread, optional", "3 free-range egg yolks", "1 tbsp Dijon mustard", "2 tbsp cider vinegar", "300ml/11fl oz rapeseed oil", "50g/1¾oz capers", "75g/2½oz gherkins, chopped", "1 shallot, finely chopped", "1 small bunch dill, chopped", "2 tbsp chopped flatleaf parsley ", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the mushy peas, soak the peas in a large bowl, in three times their volume of water for at least 1½ hours or, if you have the time, overnight.", "Drain the peas, rinse under the tap, and place on the stove in a large pan and cover with the water. Add the bicarbonate of soda. Cover and bring to the boil and once boiled, reduce the heat and simmer the peas for 1½-2 hours, stirring from time to time. ", "The peas should be soft and mushy in texture but not too dry. If they are wet, continue cooking over the heat with the lid off to dry out a little. Beat in the butter and season with salt and pepper.", "For the beer battered hake, combine the flour, yeast, salt and sugar in a bowl.", "Add the beer and vinegar and whisk until it forms a thick batter.", "Set aside to ferment for about 30 minutes. It is ready to use when the mixture starts to bubble. ", "Heat a deep fat fryer to 190C/375F or heat the oil for deep-frying in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Dip each piece of onion into the batter to coat thoroughly. Cook them in batches in the fat fryer, and cook for 2-3 minutes until golden-brown and cooked through.\r\n", "Dip each piece of fish into the batter to coat thoroughly. Lower them carefully into the fryer, and cook one at a time. Cook for 4-6 minutes until the fish is cooked through and the batter is golden-brown.", "Drizzle the remaining batter into the fat to make scraps.", "Butter the bread with the softened butter and cut in half.", "For rapeseed tartare sauce, whisk together the egg yolks, mustard and vinegar in a bowl or small processor.", "Still whisking, start adding the rapeseed oil very slowly to make a mayonnaise - the mixture should be thick and light once the oil is incorporated. ", "Stir in the capers, gherkins, shallot and herbs. ", "Season with salt and pepper and a touch of lemon juice. ", "To serve, place the fish on plates, with a spoonful of mushy peas alongside. Pile the bread and butter next to it and finish with a squeeze of lemon juice and spoonful of tartare sauce."]}, {"isVegetarian": false, "title": "Beer braised shin of beef with creamy mash", "url": "www_bbc_co_uk_food_recipes_beer_braised_shin_of_12682", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beer_braised_shin_of_12682_16x9.jpg", "ingredients": ["6 tbsp rapeseed oil ", "2 large onions, thinly sliced", "4 carrots, sliced", "3 celery sticks, sliced ", "½ garlic bulb, bashed", "3 tbsp plain flour, for dusting", "2kg/4lb 8oz shin of beef, bone in (ask your butcher to cut it into 3cm/1¼in slices)", "568ml/1 pint ale", "300ml/½ pint beef stock", "3-4 sprigs rosemary ", "salt and freshly ground black pepper", "1kg/2lb 4oz floury potatoes, such as King Edward or Maris Piper, cut into 4cm/1½in cubes ", "150g/5½oz salted butter ", "splash milk or cream, to taste"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. ", "Heat 2 tablespoons of the oil in a large heavy-bottomed frying pan over a medium heat. Add the onions, carrots, celery and garlic and fry until they start to colour. Transfer to a large lidded casserole dish. ", "Put the flour on a plate and season with salt and pepper. Coat the beef in the seasoned flour and shake off any excess flour. Turn the heat up to high, then add the remaining oil to the frying pan. Fry the beef, in batches, for 1 minute on each side until browned all over. Add the beef to the casserole dish. ", "Add a splash of ale to the frying pan and scrape off any cooked on pieces of food, then pour it all into the casserole dish. Pour in the remaining ale, the beef stock and rosemary. Put in the oven and cook for 3-4 hours, or until the meat falls easily from the bone.", "Meanwhile, bring a pot of lightly salted water to the boil and add the potatoes. Cook for 15-20 minutes until tender. Drain and return to the pot. Mash until smooth. Mix in the butter and milk. Season to taste with salt and pepper. ", "Serve the braised shin with the mash."]}, {"isVegetarian": true, "title": "Beer and cheese bread", "url": "www_bbc_co_uk_food_recipes_beerandcheesebread_89613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tsp sugar", "2 tsp dried yeast", "450ml/16fl oz brown ale, at room temperature", "520g/1lb 2½oz strong white bread flour, plus extra for dusting", "320g/11oz wholemeal flour", "200g/7oz cheddar, grated", "75g/2½oz parmesan (or similar vegetarian hard cheese), grated", "50g/2oz powdered milk", "1½tsp salt", "1½tsp mustard powder", "2 free-range eggs, beaten", "2 tsp fennel seeds", "1 free-range egg, white only, for glazing"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl dissolve the sugar and yeast in the brown ale and set aside for 5-6 minutes.", "Mix the bread flour, the wholemeal flour, cheddar, parmesan, powdered milk, salt, mustard powder, eggs and fennel seeds in a large mixing bowl. Add the yeast and beer mixture and mix well with your hands until the mixture forms a soft dough.", "Using floured hands, knead the dough on a clean, floured work surface for 20-25 minutes until smooth and elastic. If the dough becomes too dry add a little warm water.", "Divide the dough into two loaves and place them onto a large baking tray. Using a sharp knife, score the top of the loaves with a criss-cross pattern. Cover with a clean damp tea towel and leave for two hours in a warm, dry and draught-free place, until the dough has risen and doubled in size. ", "Preheat the oven to 200C/400F/Gas 6. When the loaves have expanded, brush each with the egg white.", "Transfer the loaves to the oven and bake for 25-30 minutes, or until the bread has cooked through and the crust is golden-brown. ", "To serve, slice the loaves and serve with a big bowl of soup."]}, {"isVegetarian": false, "title": "Beer can chicken with garlic butter jacket potatoes", "url": "www_bbc_co_uk_food_recipes_beer_can_chicken_with_27487", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1½ tbsp sweet smoked paprika", "½ tbsp hot smoked paprika", "½ tsp chilli flakes", "2 tbsp Dijon mustard", "1 tbsp red wine vinegar", "3 limes, juice only, plus extra lime wedges for serving", "3 lemons, juice only, plus extra lemon wedges for serving", "5 tbsp olive oil", "2kg/4lb 8oz chicken", "4 baking potatoes, scrubbed", "2 garlic bulbs", "440ml can of beer, half full", "3 tbsp finely chopped chives", "250g/9oz butter, softened", "sea salt and freshly ground black pepper", "1 head lettuce, root removed, leaves separated and washed", "4 ripe tomatoes, cut into chunks", "¼ cucumber, cut in half lengthways, then into half-moon slices", "2 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the paprikas, chilli flakes, mustard, vinegar and lemon and lime juices in a bowl to a smooth paste. ", "Transfer the marinade to a large plastic food bag, add 4 tablespoons of the olive oil and the chicken, then seal the bag and shake it carefully to cover the chicken in the marinade. Set aside to marinate for as long as possible.", "Prick the potatoes with a fork, then rub them in some of the remaining oil and season with salt and pepper. Wrap each one in aluminium foil. ", "Place one garlic bulb onto another sheet of foil and drizzle with more of the remaining oil. Wrap the bulb tightly in the foil. ", "Light the barbecue. Allow the flames to flare up and die down, then wait until the coals are glowing and starting to turn white. ", "Cut the second garlic bulb in half horizontally and stuff the two halves inside the chicken. Manoeuvre the half-full beer can to fit just inside the chicken, so that the bottom half of the can is sticking out of the chicken. ", "Nestle the wrapped potatoes and garlic bulb into the coals, then stand the chicken upright on its beer can in the centre of the barbecue. Wrap a piece of aluminium foil around the base of the chicken to form a protective collar, then cover the barbecue with the lid and cook for 15 minutes. ", "Remove the garlic bulb and set aside to cool. Continue to cook the chicken and potatoes for a further 30 minutes, or until the chicken is completely cooked through and the potatoes are tender.", "Unwrap the garlic and squeeze the roasted garlic from the cloves into a bowl. Stir in the chives and butter.", "For the salad, mix the lettuce leaves, tomatoes and cucumber together in a large serving bowl then drizzle with the olive oil.", "To serve, transfer the cooked chicken, still standing upright on its beer can, to a large serving platter. Unwrap the potatoes, cut a cross in the top of each, squeeze gently and spoon over the garlic butter. Arrange the potatoes around the chicken, garnish the plate with the lemon and lime wedges, then serve with the salad."]}]