[{"ingredients": ["10g / 3½oz de queso cheddar", "50g / 2oz de chiles jalapeños verdes encurtidos", "20 chips de tortilla de maíz salados", "2 cucharadas de salsa de chile", "hojas frescas de cilantro, para servir"], "method": ["Caliente el horno a 200C / 400F / Gas 6.", "Rallar gruesamente el queso cheddar y cortar finamente los chiles jalapeños.", "Coloque las virutas de maíz intactas en una bandeja para hornear, y cubra cada una con un poco de queso rallado y dos rebanadas de chile jalapeño.", "Hornee durante 5-10 minutos o hasta que el queso se derrita y las virutas de maíz estén calientes y crujientes.", "Agregue un poco de salsa de chile y una hoja de cilantro, y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_cocktailnachos_73331", "title": "Nachos de cóctel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pan blanco rebanado", "Mantequilla sin sal 110g / 4oz, ablandada", "300ml / 10fl oz de leche entera", "300 ml / 10 fl oz doble crema", "1 gota de extracto de vainilla", "1 cucharadita de canela molida", "20 g / 1 oz de cacao en polvo", "5 huevos de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de azúcar en polvo", "100g / 3½oz de mantequilla sin sal", "100ml / 3½ fl oz crema doble", "2 peras, núcleo eliminado y rebanado", "Crema doble de 200 ml / 7 fl oz", "25g / 1oz de azúcar glas", "1 gota de extracto de vainilla", "50 g / 2 oz de cacao en polvo", "100 ml / 3½ fl oz de agua", "2 cucharaditas de crema doble"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pudín de pan de cacao y mantequilla, quite todas las cortezas del pan y extienda un lado de cada rebanada con mantequilla. Corta en triángulos y colócalos, superpuestos, en el fondo de un plato a prueba de horno ligeramente engrasado con mantequilla.", "Coloque la leche, la crema, la vainilla, la canela y el cacao en polvo en una cacerola grande y caliente.", "Pon los huevos y el azúcar en un tazón grande y bate hasta que estén pálidos y doblados de tamaño.", "Poco a poco agregue el líquido a los huevos batiendo todo el tiempo. Vuelva a colocar en la sartén y cocine suavemente hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Vierta la mezcla de natillas sobre el pan y deje reposar durante 30 minutos, luego cocine en el horno durante 20-30 minutos.", "Para las peras asadas al caramelo, coloca el azúcar y la mantequilla en una sartén mediana y calienta hasta que se derrita.", "Agregue la crema y cocine por 3-4 minutos, luego agregue las peras y cocine por otros 10 minutos.", "Para hacer que la crema de Chantilly ponga la crema, el azúcar glas y el extracto de vainilla en un tazón grande y bata hasta que se formen picos duros cuando se quite la batidora.", "Para la salsa de chocolate, coloque el cacao y el agua en una olla pequeña y cocine hasta que se espese. Agrega la crema.", "Para servir, coloque un cuadrado del budín en un tazón, vierta sobre la salsa y cubra con una cucharada de crema."], "url": "www_bbc_co_uk_food_recipes_cocoa_cinnamon_bread_and_32214", "title": "Pudín de cacao y mantequilla de canela con peras de caramelo, crema de Chantilly y salsa de chocolate caliente", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "1 cebolla roja pequeña, pelada, finamente cortada", "1 berenjena pequeña, cortada, cortada en cubitos de 2cm / ¾in", "1 cucharada de sal masala", "1 cucharadita de comino molido", "1 cucharadita de semillas de cilantro", "Okra de 150 g / 5 oz", "Florecillas de coliflor de 150g / 5oz", "75g / 3oz de guisantes congelados", "1 cucharadita de cúrcuma molida", "50g / 2oz de coco seco, rallado", "½ cubo de caldo de verduras, disuelto en 200 ml / 7 fl oz de agua", "sal y pimienta negra recién molida"], "method": ["Caliente dos cucharadas de aceite vegetal en una olla grande con tapa a fuego medio. Agregue la cebolla roja, la berenjena y el garam masala y fría hasta que comience a dorarse, alrededor de 8-10 minutos.", "Seque las semillas de comino y cilantro en una sartén pequeña hasta que estén fragantes, luego agregue a la mezcla de cebolla y revuelva bien.", "Agregue los ingredientes restantes, revuelva bien para combinar, luego cubra la olla con una tapa.", "Deje que la mezcla hierva a fuego lento y cocine de 15 a 20 minutos, revolviendo ocasionalmente, hasta que los flósculos de coliflor estén tiernos. Sazonar, al gusto, con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_coconut-curried_82286", "title": "Verduras al curry de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 caja de pastelería readymade (22cm / 8½ pulgadas)", "25g / 1oz de coco fresco, finamente rallado, para decorar", "pequeñas hojas de menta fresca, para decorar", "200 g / 7 oz de azúcar en polvo", "Crema doble 370ml / 13fl oz", "3 huevos de gallinas camperas, golpeados", "2 limas, jugo y ralladura finamente rallada", "2 limones no encerados, jugo y ralladura finamente rallada", "200g / 10½oz de coco desecado", "100 g / 3½ oz de cerezas frescas, sin hueso", "Frambuesas 100g / 3½ oz", "100g / 3½oz de piña, cortada en pedazos del tamaño de un bocado", "100 ml / 3½ fl oz de jarabe de vainilla", "2 guiones angostura amargos"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja para hornear con papel de hornear y coloque la caja de repostería encima.", "Batir todos los ingredientes de relleno agrio juntos y verter en la caja de pastelería. Hornee durante 40-50 minutos o hasta que estén listos.", "Para hacer la ensalada de frutas, ponga toda la fruta en un tazón grande y agregue el jarabe de vainilla y los amargos de angostura.", "Sirva la tarta en rodajas, con la ensalada de frutas a un lado, decorada con hojas de menta y coco."], "url": "www_bbc_co_uk_food_recipes_coconut_and_citrus_tart_19669", "title": "Tarta de coco y cítricos con ensalada de frutas de cereza, piña, frambuesa y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 limas, jugo y ralladura solamente", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas molidas", "½ cucharadita de clavo de olor molido", "100g / 3½oz de coco desecado", "Harina de auto aumento 230g / 8oz", "2 cucharaditas de polvo de hornear", "230g / 8oz de azúcar en polvo de oro", "230g / 8oz de mantequilla", "70g / 2½ oz de mantequilla de coco", "4 huevos grandes de gallinas camperas, ligeramente batidos", "50 g / 1¾oz de mantequilla sin sal", "175g / 6oz de azúcar glas", "250 g / 9 oz de queso mascarpone", "glaseado de fondant verde", "glaseado de fondant marrón", "granos de chocolate", "1 lima, ralladura solamente"], "method": ["Precaliente el horno a 180 ° C / 170 ° Ventilador / Gas 4 y forre una bandeja para hornear de 30x23x4 cm / 12x9x1½ pulgadas con dos pedazos de papel de aluminio, solapando en el medio.", "En un tazón, mezcle el jugo de limón, la ralladura, las especias y el coco desecado y déjelos en remojo.", "Tamiza la harina y el polvo de hornear en un tazón grande aparte y déjalo a un lado.", "Coloque el azúcar, la mantequilla y la manteca de coco en un procesador de alimentos y pulse hasta que quede suave. Transfiera al tazón de ingredientes secos y mezcle hasta que estén bien combinados. Doble los huevos y la mezcla de coco empapada.", "Coloque la mezcla en la lata preparada y hornee durante unos 30 minutos, o hasta que una brocheta insertada en el centro salga limpia.", "Dejar enfriar en la lata durante unos 5 minutos y luego colocar en una rejilla. Retire la lámina y deje que se enfríe por completo.", "Para la guinda, ponga todos los ingredientes en un procesador de alimentos y pulse hasta que quede suave.", "Cuando el pastel esté completamente frío, extiende el glaseado por toda la parte superior. Corta el pastel y córtalo en 12 cuadrados de igual tamaño.", "Para la decoración, despliegue ambos fondants de color. Use el verde para cortar 48 'hojas' y el marrón para cortar 12 'troncos'.", "Decora cada cuadrado de pastel con los fondants para hacer un 'tronco' y 'hojas' de palmera. Usa los frijoles de chocolate para representar los cocos y termina salpicando un poco de ralladura de lima."], "url": "www_bbc_co_uk_food_recipes_coconut_and_lime_56467", "title": "Bandeja de coco y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 bandeja de 12 rebanadas traybake", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Arroz pegajoso tailandés 200g / 7oz", "1 x 400 ml / 14fl oz puede leche de coco", "¼ cucharadita de sal", "50g / 1¾oz de azúcar de palma, aproximadamente picado si de un bloque", "5 hojas de lima kaffir", "1 papaya mediana madura, sin semillas, pelada, cortada en rodajas ordenadas de 5 mm / ¼", "2 limas, cáscara y jugo solamente", "4 ramitas de menta, para adornar (opcional)"], "method": ["Remoje el arroz en 300 ml / 10 fl oz de agua durante al menos 30 minutos, pero durante un máximo de cuatro horas antes de usar.", "Escurra el arroz y lávese bien.", "Cubra un vapor de bambú (con una tapa) con papel resistente a la grasa, una hoja de plátano o una sábana limpia de muselina. Si usa papel a prueba de grasa o una hoja de plátano, perfore algunos agujeros con un pincho (no haga los agujeros demasiado grandes, pero sí desea que pasen el vapor).", "Coloque aproximadamente 425 ml / ¾ de agua (5 cm / 2 pulgadas de profundidad) en una olla o un wok y coloque el arroz en la olla de cocción al vapor. Poner la tapa, llevar el agua a ebullición y luego reducir el fuego a bajo-medio y vaporizar durante unos 20 minutos.", "Mientras tanto, agregue la leche de coco, la sal, el azúcar de palma y las hojas de lima kaffir a una cacerola. Calentar a fuego medio - no hervir.", "Revuelva con frecuencia durante unos 5-7 minutos para infundir los sabores. Una vez infundido, retirar del fuego.", "Coloque la papaya preparada en cuatro platos o un plato de servir adecuado y vierta sobre la ralladura y el jugo de las limas.", "Una vez que el arroz esté cocido, colóquelo en un recipiente para mezclar y gradualmente agregue tres cuartas partes de la leche de coco infundida. Reserve el trimestre restante.", "Mezcle bien y deje enfriar por 10-15 minutos. Transfiera el arroz en tazones individuales o un plato adecuado y rocíe sobre la leche de coco infundida restante.", "Sirve la ensalada de papaya junto con el arroz. Adorne con una ramita de menta si le gusta."], "url": "www_bbc_co_uk_food_recipes_coconut_and_sticky_rice_52999", "title": "Pudín de coco y arroz con ensalada de lima y papaya", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 nido de fideos de huevo medianos", "3 cebollas de primavera, picadas", "200ml / 7fl oz de leche de coco", "200ml / 7fl oz de caldo de pollo hecho con ½ de un cubo de reserva", "1-2 muslos de pollo o baquetas, sin piel", "sal y pimienta negra recién molida"], "method": ["Hervir el hervidor. Rompe los fideos y ponlos en un tazón. Cúbralo con agua hirviendo, déjelo a un lado y deje que los fideos se ablanden por completo, aproximadamente 10 minutos.", "Mientras tanto, agregue la parte blanca de la cebolla tierna a una cacerola con la leche de coco, caldo y un toque de pimienta negra. Llevar a fuego lento, agregar los muslos de pollo y cocinar por 15-20 minutos. No lo hierva o el pollo estará duro y la leche de coco se separará (si utiliza muslos de pollo sin hueso cocine a fuego lento durante 8-10 minutos).", "Retire el pollo de la cacerola y verifique que esté completamente cocido. Si es rosado cerca del hueso, devuélvalo a la reserva por otros 5 minutos. Cuando esté cocido, coloque los muslos de pollo a un lado para que se enfríen un poco.", "Escurra los fideos y agréguelos al líquido de coco. Pica el pollo del hueso y revuelve en la sopa con la parte verde de la cebolla tierna. Sazone con sal y pimienta negro."], "url": "www_bbc_co_uk_food_recipes_coconut_chicken_noodle_20610", "title": "Sopa de fideos de pollo y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_chicken_noodle_20610_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½ harina lisa", "15 g / ½ oz de azúcar en polvo", "pizca de sal", "4 huevos medianos de granja", "350ml / 12fl oz de leche entera", "2 cucharadas de coco desecado, tostado", "mantequilla, para freír", "8 yemas de huevo grandes de gallinas camperas", "120 g / 4½ oz de azúcar en polvo", "Jugo de mango de 160ml / 5½fl oz", "Jugo de fruta de la pasión 110ml / 3½fl oz", "250g / 9oz de mantequilla sin sal", "piña fresca, en rodajas finas", "menta fresca, hojas recogidas", "espolvorear azúcar glas"], "method": ["Para los panqueques, combine la harina, el azúcar y la sal, luego mezcle los huevos con un batidor. Agregue la leche gradualmente para evitar grumos, luego agregue el coco tostado. Deja reposar mientras preparas la cuajada.", "Para hacer la cuajada, mezcle los huevos, el azúcar, el mango y los zumos de maracuyá en una cacerola. Coloque a fuego medio y revuelva continuamente hasta que la mezcla se espese, no hierva. Batir la mantequilla, cortar en trozos pequeños. Cubra y deje enfriar.", "Para cocinar los panqueques, agregue un poco de mantequilla derretida a una sartén antiadherente y un cucharón en un poco de masa, revolviéndolo para cubrir la sartén; podría tomar uno o dos panqueques de prueba antes de que tenga la cantidad justa de masa. Cocine cada panqueque en ambos lados hasta que estén dorados y luego retírelos a un plato mientras cocina el próximo panqueque.", "Para ensamblar, reparta cada panqueque con la cuajada de frutas y luego enrolle los cigarros. Sirva con piña fresca, hojas de menta y una capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_coconut_pancakes_with_70485", "title": "Tortitas de coco con cuajada de mango y maracuyá", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de coco desecado", "200 g / 7 oz de azúcar en polvo", "4 claras de huevo de gallinas camperas", "200g / 7oz de queso bajo en grasa", "2½ cucharaditas de azúcar glas", "1 vaina de vainilla, solo semillas", "2 perillas de tallo de jengibre (de un tarro en almíbar), muy finamente picadas, más 1 cucharada de jarabe de jengibre", "8 fresas medianas y grandes, con cascos, extremos puntiagudos recortados y cada una cortada en 3 discos"], "method": ["Para los merengues, precaliente el horno a 110C / 225F / Gas ¼ (ventilador 80C). Forre dos bandejas grandes para hornear con papel pergamino y reserve.", "Caliente una sartén grande (sin aceite) a fuego medio y tueste el coco por unos minutos hasta que esté dorado y tostado. Incline en un recipiente y reserve.", "Los merengues se pueden hacer a mano, pero lleva mucho tiempo. Usar un batidor manual o un mezclador independiente hace que todo sea mucho más agradable. Coloque el azúcar y una de las claras de huevo en un recipiente limpio y bata durante unos 30 segundos a alta velocidad. Agregue otra clara de huevo y mezcle por aproximadamente dos minutos más. La mezcla comenzará a ponerse bastante espesa. Agregue las claras de huevo restantes, una a la vez, latiendo muy bien entre cada adición. Batir hasta que la mezcla sea realmente, muy dura, blanca y brillante. ¡Debería ponerse tan rígido que si voltease el cuenco no salga el merengue! Toma un poco más de tiempo batirlo de esta manera y es una forma atrasada de hacer merengues, pero la belleza de esto es que no se puede batir esta mezcla incluso si se apagó y se dejó durante 15 minutos más o menos, por lo que este método parece para trabajar bien para mi! Finalmente, doble suavemente el coco hasta que esté bien combinado.", "Con una cuchara grande, coloque la mezcla en una manga pastelera que tenga una boquilla lisa de 1½ cm / ¾in. Extraiga 48 burbujas separadas en las bandejas de horneado, cada una de las cuales mide 3-4 cm / 1¼-1½ pulgadas de ancho y con un pequeño pico en la parte superior (a unos 2 cm de altura). Hornee por alrededor de 1 hora 30 minutos, o hasta que los merengues estén crujientes por fuera pero aún un poco suaves por dentro. Cambie las bandejas en los estantes a la mitad del tiempo de cocción para asegurar una cocción pareja.", "Cuando los merengues estén cocidos, sácalos del horno y déjelos a un lado para que se enfríen. Mientras se enfrían, haz la jengibre potra Chantilly. Mezcle todos los ingredientes, excepto las fresas, bien en un tazón y vierta la mezcla en una bolsa de plástico con una boquilla normal de 1½ cm / ¾in. Pop en la nevera hasta que esté listo para ensamblar.", "Una vez que los merengues estén completamente fríos, coloca una pequeña gota de jengibre en el fondo de dos piezas de merengue. Coloque una rodaja de fresa en una de las potrancas Chantillys y luego siéntela junto con el otro merengue. Repita con los merengues restantes y el relleno para hacer 24 en total, organizándolos en un plato grande sobre la marcha. Servir de inmediato"], "url": "www_bbc_co_uk_food_recipes_coconut_kisses_with_93280", "title": "Besos de coco con potra de jengibre Chantilly y una rebanada de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_kisses_with_93280_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["35 g / 1¼ oz de chips de coco", "120 g / 4½ oz de pistachos sin sal, sin cáscara", "4 cucharadas de semillas de hinojo", "110 g / 4 oz de mantequilla sin sal, a temperatura ambiente", "200 g / 7 oz de azúcar en polvo", "2 huevos grandes de gallinas camperas", "1 cucharadita de esencia de coco", "440 g / 15½ oz harina natural", "1 cucharadita de polvo de hornear", "½ cucharadita de sal de mesa", "200g / 7oz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20powder)", "330 g / 11½ oz de azúcar en polvo", "50 g / 1¾oz de mantequilla sin sal", "200g / 7oz de coco desecado, tostado", "½ cucharadita de bicarbonato de soda"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque las virutas de coco en una sartén seca y tueste hasta que estén doradas, revolviendo regularmente. Tueste los pistachos y las semillas de hinojo de la misma manera, luego transfiera los pistachos y las semillas de hinojo a un procesador de alimentos y pulse hasta que se rompan. Dejar de lado para enfriar.", "En un tazón grande, unte la mantequilla y el azúcar hasta que quede pálido y esponjoso. Mezcle los huevos y la esencia de coco.", "Combine la harina, el polvo de hornear, la sal, el coco tostado, los pistachos y las tres cuartas partes de las semillas de hinojo. Agregue a la mezcla de mantequilla y mezcle hasta que esté bien combinada (la mezcla será bastante dura para que le resulte más fácil usar una batidora eléctrica). Divida la masa en 2 montículos iguales.", "Línea 2 bandejas para hornear con pergamino para hornear. Coloque un montículo de masa en cada bandeja y déles forma en un rectángulo de aproximadamente 25x8cm / 10x3¼ pulgadas. Hornea por 35 minutos.", "Retire la masa del horno y déjela enfriar en la bandeja durante 15 minutos. Reduzca la temperatura del horno a 160 C / 140 C Fan / Gas 2.", "Corte cada tronco en pedazos de aproximadamente 1 cm / ½ pulgada de espesor. Cada registro debe producir aproximadamente 12 biscotti.", "Coloque las piezas con el lado del corte hacia abajo sobre las bandejas para hornear y vuelva a colocarlas en el horno. Hornee durante 10 minutos por cada lado, o hasta que estén dorados y crujientes. Dejar enfriar sobre una rejilla.", "Para el coco quebradizo, forra una bandeja para hornear con papel para hornear antiadherente.", "Agregue el azúcar, la mantequilla y 125ml / 4½ oz de agua a una cacerola grande. Calienta suavemente hasta que el azúcar se disuelva. Con un termómetro de azúcar, continúe calentando la mezcla a 160 ° C o hasta que se forme un caramelo. Retire del fuego de inmediato y agregue el coco. Agregue el bicarbonato de soda: el caramelo comenzará a formar espuma, así que tenga cuidado de no quemarse, el azúcar derretido está muy caliente. Vierta sobre la bandeja preparada y deje enfriar.", "Cuando esté frío, divida los quebradizos en pedazos grandes y agréguelos a un procesador de alimentos. Agregue las semillas de hinojo reservadas y el pulso hasta que se rompa en un polvo grueso. Transfiera a un plato poco profundo.", "Derretir el chocolate negro en un recipiente a prueba de calor sobre una olla de agua hirviendo. Sumerja el lado largo de la biscotti en el chocolate derretido y luego en el coco quebradizo. Reserve a un lado hasta que el chocolate esté listo, luego sirva."], "url": "www_bbc_co_uk_food_recipes_coconut_fennel_and_40895", "title": "Biscotti de coco, hinojo y pistacho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 24 biscotti", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5oz de coco desecado", "4 dientes", "2 ramitas de hojas de curry, hojas recogidas", "1 cucharadita de cúrcuma", "2 cucharadas de aceite vegetal", "2 cebollas, finamente cortadas", "2 chiles verdes, finamente rebanados", "2 cucharadas de pasta de tamarindo", "2 cucharadas de azúcar de palma", "Leche de coco 400ml / 14fl oz", "Carne de cangrejo blanca fresca de 300g / 11oz, escogida", "2 cucharadas de hojas de cilantro, picadas", "1 lima, solo jugo", "4 x 200 g / 7oz de filete de piedra, piel sobre", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de berro de coriandro"], "method": ["Calentar una sartén hasta que esté medio caliente, agregar dos tercios del coco, con los dientes de ajo, las hojas de curry y la cúrcuma y freír hasta que estén doradas.", "Coloque en un procesador de alimentos pequeño o molinillo y blitz a un polvo fino.", "Caliente una sartén o wok hasta que esté caliente, agregue el aceite vegetal y las cebollas y fría hasta que estén doradas.", "Agregue los chiles y el coco desecado restante y fría por un minuto.", "Agregue la pasta de tamarindo, azúcar de palma y leche de coco y cocine a fuego lento.", "Cocine durante 2-3 minutos hasta que espese, luego agregue la carne de cangrejo y el cilantro y sazone con un poco de jugo de limón, sal y pimienta negra.", "Sazonar el filete de piedra con sal y pimienta negra.", "Caliente una sartén hasta que esté medianamente caliente, agregue la piel de róbalo bajo y cocine durante dos minutos, luego voltee y cocine el otro lado durante dos minutos más.", "Para servir, espolvorea el curry con cangrejo en el plato, luego completa con el bajo de piedra y termina con una pizca de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_coconut_crab_with_stone_52229", "title": "Cangrejo de coco con róbalo de piedra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 250ml / 9fl oz", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "225ml / 8fl oz de leche de coco", "2 hojas de gelatina, empapadas en agua durante al menos cinco minutos", "300ml / 10fl oz de suero de leche", "250g / 9fl oz de harina blanca fuerte", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "30 g / 1 oz de mantequilla, ablandada", "1 cucharadita de levadura de acción rápida", "aceite vegetal, para freír", "50 g / 1¾oz de mantequilla sin sal", "3 naranjas de sangre, 1 zested, luego peladas y cortadas en rodajas, y 2 juiced", "1 limón, cáscara y jugo solamente", "3 cucharadas de azúcar en polvo", "2 cucharadas de licor de naranja", "2 cucharadas de azúcar glas", "2 cucharadas de aguardiente", "25g / 1oz de coco fresco, rallado", "25 g / 1 oz de azúcar en polvo", "4 ramitas de menta fresca"], "method": ["Para el panna cotta de coco, caliente la crema doble, la vaina de vainilla y las semillas y la leche de coco en una cacerola hasta que hierva. Retire la sartén del fuego, agregue la gelatina remojada y el suero de leche. Batir hasta que esté bien combinado.", "Pasar la mezcla a través de un tamiz fino y luego verter la mezcla en moldes dariole o moldes y enfriar en la nevera durante al menos dos horas.", "Para las mini donuts, combine la harina, la sal y el azúcar en polvo en un tazón grande. Mezcle la mantequilla, 150ml / 5½fl oz de agua y la levadura hasta que la mezcla se una para formar una masa suave. Cubra con una película adhesiva y déjela en un lugar cálido durante aproximadamente una hora, o hasta que duplique su tamaño.", "Divida la masa en 12 porciones iguales y enrolle cada una en una bola.", "Caliente el aceite en una freidora a 150C / 320F. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: no deje el aceite caliente desatendido).", "Con cuidado, baje las rosquillas en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Mientras tanto, para las naranjas y la salsa, caliente una sartén hasta que esté caliente, agregue la mantequilla, la ralladura de naranja y el jugo, la ralladura de limón y el jugo y el azúcar impalpable. Agregue el licor de naranja y el brandy. Cocine por unos minutos hasta que espese y burbujee, luego retire la sartén del fuego.", "Espolvorea las naranjas en rodajas con azúcar glas y carbón usando un soplete o una parrilla caliente hasta que estén caramelizadas.", "Para servir, cuando el exceso de aceite haya drenado las rosquillas, colóquelas en un plato y espolvoree con el azúcar impalpable y el coco hasta que estén completamente cubiertas.", "Retire la panna cotta de los moldes y colóquelos en el centro de los platos para servir. Sirva con las mini rosquillas y naranjas chamuscadas y salsa. Adorne con menta fresca."], "url": "www_bbc_co_uk_food_recipes_coconut_panna_cotta_with_35812", "title": "Panna cotta de coco con naranjas y donas de sangre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva light", "1 cebolla, más o menos picada", "2 dientes de ajo, finamente picados", "Pasta de curry medio de 2 niveles de tbsp", "2 cucharadas de puré de tomate", "200ml / 7fl oz de caldo de pollo o vegetal", "Leche de coco reducida en grasa de estaño 200ml", "1 calabacín, cortado en cubos de 1cm / ½ en", "400g / 14oz de gambas de tigre crudas, peladas (descongeladas si están congeladas)", "sal y pimienta negra recién molida", "Flor de coliflor de 800 g / 1 lb 12 oz", "1 cucharadita de aceite de oliva ligero", "1 cucharada de condimento de especias de pilau", "6 cucharadas de cilantro fresco picado"], "method": ["Calentar el aceite en una sartén grande. Agregue la cebolla y el ajo y cocine a fuego medio durante 2-3 minutos, o hasta que se ablanden. Agregue la pasta de curry y fría por 30 segundos. Agregue el puré de tomate, caldo, leche de coco y calabacín y cocine a fuego lento durante 10 minutos.", "Agregue las gambas y cocine durante 4-5 minutos, o hasta que estén doradas y cocidas. Temporada.", "Mientras tanto, para hacer el pilau, pulsa la coliflor en un procesador de alimentos hasta que tenga el tamaño del arroz. Coloque en un tazón grande y resistente al calor, cubra con una película adhesiva, luego perfore y cocine en el microondas a temperatura alta durante 6-8 minutos.", "Caliente el aceite en una sartén ancha a fuego medio. Freír el condimento pilaf y el \"arroz\" de coliflor durante 6-7 minutos, o hasta que esté bien caliente. Retire del fuego y agregue el cilantro.", "Sirve el curry con el 'arroz'."], "url": "www_bbc_co_uk_food_recipes_coconut_prawn_curry_with_58477", "title": "Curry de gambas al coco con coliflor 'arroz'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_prawn_curry_with_58477_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de semillas de mostaza negra", "4-6 cucharadas de aceite vegetal", "1 cebolla, finamente rebanada", "1 cucharadita de cúrcuma molida", "Leche de coco 250ml / 9fl oz", "250 g / 9 oz de carne de coco fresca o congelada, bombardeada en un procesador de alimentos o rallada", "1 cucharadita de sal", "350g / 12oz de gambas crudas peladas", "4 chiles verdes frescos, con semillas, cortados longitudinalmente en sextas", "puñado de cilantro picado, para terminar"], "method": ["Coloque las semillas de mostaza en un procesador de mini alimentos y agregue dos cucharadas de agua. Mezcle por un minuto y luego agregue otras dos cucharadas de agua y continúe licuando hasta que las semillas comiencen a romperse (esto puede tomar uno o dos minutos de mezcla persistente, agregue más agua si tiene problemas). Siga mezclando hasta que tenga una pasta áspera que se asemeje a la mostaza integral, y agregue un poco más de agua si es necesario. Dejar de lado.", "Caliente el aceite vegetal en una cacerola de base pesada o karahi a fuego medio-bajo. Agregue la cebolla y fría por 10 minutos. Agregue la pasta de mostaza mezclada, la cúrcuma, la leche de coco, el coco rallado y la sal. Llevar a ebullición y cocine a fuego lento durante 4-5 minutos.", "Agregue las gambas y los chiles verdes y cocine a fuego lento durante 3-4 minutos adicionales, o hasta que las gambas estén rosadas y cocidas. Dispersar con cilantro y servir."], "url": "www_bbc_co_uk_food_recipes_coconut_prawn_curry_69561", "title": "Gambas con coco recién rallado, chiles verdes y semillas de mostaza (Chingri daab)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_prawn_curry_69561_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 huevos medianos de granja, separados", "250 g / 9 oz de azúcar en polvo", "½ cucharadita de sal", "Harina normal 230g / 8oz", "1 cucharadita de polvo de hornear", "Frambuesas 50g / 1¾oz, aplastadas", "2 cucharadas de coco desecado", "mantequilla, para engrasar", "4 limones no encerados", "100g / 3½oz de mantequilla sin sal", "200 g / 7 oz de azúcar en polvo sin refinar", "3 huevos medianos enteros de rango libre, más 1 yema de huevo de gallinas camperas", "50g / 1¾oz de azúcar", "3 cestitas de frambuesas, picadas", "3 cestones de fresas, picadas", "600ml / 20fl oz de leche entera", "Crema doble 600ml / 20fl oz", "1 vaina de vainilla", "3 cucharadas de harina de maíz", "4 yemas de huevo grandes de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "Crema doble 600ml / 20fl oz", "1 centavo de frambuesas", "50ml / 2fl oz de leche de coco", "13 cucharadas de azúcar glas", "10 cucharadas de almendras molidas", "2 claras de huevo de rango medio", "pizca de crema de tártaro", "3 cucharadas de azúcar en polvo", "coloración en gel amarillo", "2 claras de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "10-15 frambuesas, para decorar"], "method": ["Para los dedos de dama de frambuesa y coco, precaliente el horno a 190C / 170 (ventilador) / Gas 5.", "En un tazón grande, bata las yemas de huevo con la mitad del azúcar hasta que estén suaves y esponjosas.", "En otro recipiente, bata las claras de huevo hasta que se formen picos suaves cuando se retire el batidor del recipiente. Poco a poco agregue la sal y el azúcar restante hasta que se formen picos firmes cuando se quite la batidora.", "Dobla las claras de huevo en la mezcla de yema de huevo. Tamizar la harina y el polvo de hornear sobre la mezcla y doblar hasta que se incorpore. Doble las frambuesas trituradas y el coco.", "Llene una manga pastelera con la mezcla y la tubería de 10 cm / 4 pulgadas de longitud en una bandeja de horno engrasada.", "Hornee durante 15 minutos o hasta que estén doradas. Retire del horno y deje enfriar en una rejilla de alambre.", "Para la cuajada de limón, la ralladura y el jugo de los limones. Agregue la ralladura y el jugo, la mantequilla y el azúcar a un recipiente resistente al calor. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el agua no toque el fondo del recipiente. Revuelva hasta que la mantequilla se derrita.", "Batir ligeramente los huevos y la yema en un tazón. Bátelos en la mezcla de limón y luego cocine durante 10-13 minutos, o hasta que espese, revolviendo ocasionalmente. Retire la cuajada de limón del fuego y déjela enfriar. Cualquier cuajada de limón que no se use para esta receta se puede poner en recipientes esterilizados, sellar y guardar en el refrigerador.", "Para el glaseado de fresa y frambuesa, agregue el azúcar a 50ml / 1¾fl oz de agua en una sartén y disuelva el azúcar a fuego lento. Cocine a fuego lento hasta que la mezcla se haya espesado, luego vierta sobre la fruta suave en un tazón. Dejar de lado.", "Para la crema pastelera, calienta la leche, la crema y la vainilla en una sartén hasta justo debajo del punto de ebullición.", "Mezcle la harina de maíz y dos cucharadas de agua fría en un tazón pequeño. Dejar de lado.", "Batir las yemas de huevo y el azúcar en un tazón grande. Agregue lentamente la mezcla de leche y, una vez combinado, vuelva a verter la mezcla en la sartén y vuelva al fuego.", "Cocine durante 8-10 minutos, o hasta que sea lo suficientemente grueso como para cubrir la parte posterior de una cuchara. Rápidamente mezcle la mezcla de harina de maíz. Cocine por 1-2 minutos más, o hasta que esté muy espeso. Dejar de lado para enfriar.", "Para la crema de coco y frambuesa, bata la crema en un tazón grande. Aplastar con las frambuesas y agregar la leche de coco.", "Para los macarrones de limón y frambuesa, mezcle el azúcar glas y las almendras molidas en un procesador de alimentos.", "Batir las claras de huevo en un recipiente grande con un batidor eléctrico. Cuando esté espumoso, agregue una pizca de crema de tártaro. Agregue lentamente el azúcar impalpable, batiendo con cada adición, hasta que se formen picos firmes cuando se retire la batidora del bol.", "Doble el colorante de alimentos y mezcle el azúcar glas y almendras molidas. Pipe círculos de la mezcla en una bandeja de horno forrada con papel de hornear, aproximadamente del tamaño de una moneda de 50 peniques.", "Deje que se asiente a temperatura ambiente (en un entorno no húmedo) durante al menos media hora, hasta que se forme una capa sobre los macarrones. Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Hornee por 5-12 minutos (dependiendo del tamaño). Los macarrones no deberían atrapar ningún color.", "Para el relleno de merengue, bata las claras de huevo en un tazón alto y luego agrega gradualmente el azúcar en polvo, batiendo sobre la marcha, hasta que se formen picos rígidos cuando se retire el batidor del tazón.", "Para armar, coloque la mitad de los dedos de dama en el fondo de un bol de vidrio. Cubra con la mitad de la cuajada de limón, seguido de toda la natilla, la mitad restante de los dedos de la dama, el glaseado de fresa y frambuesa, crema de coco y frambuesa y el resto de cuajada de limón. Termine con el relleno de merengue. Use un soplete para dorar el relleno de merengue. Coloque los macarrones en la parte superior y agregue algunas frambuesas en el centro para decorar."], "url": "www_bbc_co_uk_food_recipes_coconut_raspberry_and_77291", "title": "Bagatela de merengue de coco, frambuesa y limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 gran cosa", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 g / 10½ onzas de arroz", "170ml / 6fl oz de leche de coco", "170 ml / 6 fl oz de stock", "sal al gusto", "azúcar al gusto", "Pimienta al gusto"], "method": ["Lave bien el arroz con agua corriente fría para eliminar el exceso de almidón y transfiéralo a una cacerola que tenga una tapa hermética.", "Mezcle la leche de coco y el caldo y viértalo sobre el arroz lavado.", "Cubra la cacerola con una tapa y hierva el arroz a fuego alto.", "Una vez que hierva vigorosamente, cámbielo a fuego lento, cúbralo con la tapa y déjelo cocer a fuego lento durante 10 minutos, o hasta que el nivel del agua sea el mismo que el de la parte superior del arroz.", "En este punto, apague completamente el calentador y déjelo descansar otros 10 minutos, manteniendo la tapa encendida todo el tiempo. Use una cuchara de madera para esponjar el arroz antes de servir. Agregue sal, azúcar y pimienta al gusto."], "url": "www_bbc_co_uk_food_recipes_coconut_rice_40744", "title": "Arroz de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "200g / 7oz de coco rallado o rallado", "15g / ½ oz de mantequilla clarificada (ghee)", "1½ cucharadita de semillas de hinojo", "aceite vegetal, para freír", "sal"], "method": ["Ponga la harina, 200 ml / 7 fl oz de agua y una pizca de sal en un tazón grande y mezcle para formar una masa. Amasar durante 1-2 minutos. Hierva una superficie de trabajo y extienda la masa hasta que esté muy delgada. Recorta los círculos con un cortador redondo de 6 cm / 2½ pulgadas.", "Ponga el coco, la mantequilla clarificada, el hinojo y una pizca de sal en una sartén grande. Deje que hierva a fuego lento, luego cocine durante 4-5 minutos, o hasta que esté completamente seco. Dejar de lado para enfriar.", "Divida el relleno entre los círculos de la masa. Doble la masa sobre el relleno para encerrarlo, pellizcando los bordes para sellar. Ruede y doble los bordes.", "Caliente el aceite en una sartén de fondo grueso o freidora hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las samosas en lotes durante 4-5 minutos, o hasta que se doren. Retire con una espumadera y escurra sobre papel de cocina. Espolvorea con sal y sirve."], "url": "www_bbc_co_uk_food_recipes_coconut_samosas_81366", "title": "Samosas de coco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 15-20 samosas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_samosas_81366_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400ml / 14fl oz puede leche de coco", "5-10 chiles verdes calientes, rebanados densamente", "1 cucharadita de cúrcuma molida", "2 cucharadas de hojas de cilantro, finamente picadas", "1 cucharadita de pimienta negra recién molida", "3 cucharadas de cilantro molido", "1½ cucharadita de comino molido", "4 cucharadas de aceite vegetal", "2 cebollas, finamente cortadas", "2 dientes de ajo, cortados en finas rodajas", "1cm / ½ en raíz de jengibre, cortado en pequeños fósforos", "1 lima, solo jugo", "1 cucharadita de sal", "120ml / 4fl oz de agua", "Gambas crudas peladas de 900g / 2lb", "Arroz jazmín tailandés, cocido, para servir"], "method": ["Abra la lata de coco sin agitarla.", "Retire la crema en la parte superior y colóquela a un lado.", "Ahora agregue suficiente agua a la lata para llenarla nuevamente.", "Remueva para combinar y verter en un tazón.", "Coloque los chiles, la cúrcuma, las hojas de cilantro, la pimienta, el cilantro molido y el comino molido en un procesador de alimentos junto con cuatro cucharadas de leche de coco diluida, luego mezcle hasta que quede suave.", "Agregue esta mezcla al tazón de leche de coco diluida y revuelva.", "Caliente una sartén hasta que esté caliente, luego agregue el aceite, la cebolla, el ajo y el jengibre.", "Revuelva freír durante 6-7 minutos hasta que se dore en los bordes.", "Vierta la leche de coco aderezada diluida, sal y agua.", "Llevar a ebullición, luego reduzca el fuego, cubra y cocine a fuego lento durante 10 minutos.", "Agregue las gambas y la crema de coco espesa reservada.", "Revuelva para combinar y vuelva a hervir a fuego lento.", "Cocine hasta que las gambas se pongan rosadas.", "Sirve inmediatamente con arroz."], "url": "www_bbc_co_uk_food_recipes_coconutandgreenchill_74808", "title": "Coco y gambas verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de azúcar en polvo", "Ron oscuro de 100ml / 3½fl oz", "1 chile rojo, sin semillas, cortado en tiras finas", "1 vaina de vainilla, solo semillas", "1 estrella de anís", "1 piña, pelada y cortada en dados pequeños", "250g / 9oz de masa dulce con brisa", "harina común, para extender", "2 huevos de gallinas camperas, golpeados", "2 limones no encerados, jugo y ralladura finamente rallada", "200 g / 7 oz de azúcar en polvo", "375 ml / 13 fl oz crema doble", "180g / 6oz de coco recién rallado"], "method": ["Para la piña de ron con especias, coloque el azúcar en una capa uniforme en una sartén de fondo grueso. Caliente a fuego medio, sin remover. Cuando el azúcar comience a derretirse en los bordes, agite la sartén y continúe calentando. Mezcle con una cuchara de madera hasta que todo el azúcar se haya derretido y convertido en caramelo. Agregue cuidadosamente el ron, el chile, las semillas de vainilla y el anís estrellado.", "Pon la piña en un recipiente y vierte sobre el caramelo. Cubra y reserve por al menos una hora.", "Para la tarta de coco, precalentar el horno a 180C / 160C Fan / Gas 4.", "Estirar la masa en una superficie enharinada al grosor de una moneda de una libra. Úselo para revestir una lata agria de fondo suelto y afelpado de 25 cm / 10 pulg. Pincha la base con un tenedor. Cubra con papel de hornear y rellene con frijoles para hornear.", "Hornea por 15-20 minutos. Retire los frijoles y el papel y hornee durante 5-10 minutos más, o hasta que estén cocidos. Reduzca la temperatura del horno 160 ° C / 140 ° Ventilador / Gas 3.", "En un tazón grande, mezcle los huevos, el jugo de limón y la ralladura, el azúcar, la crema y el coco. Vierta en la caja de repostería y hornee durante 40 minutos, o hasta que se haya puesto.", "Sirva rebanadas de la tarta con la piña de ron con especias."], "url": "www_bbc_co_uk_food_recipes_coconut_tart_with_spiced_06324", "title": "Tarta de coco con piña de ron con especias", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Nueces de macadamia 200g / 7oz", "Harina de auto aumento de 40g / 1½ oz", "pizca de sal", "6 huevos, separados", "165g / 5¾oz de azúcar", "1 lima, ralladura solamente, finamente rallada", "45g / 1½oz de coco desecado", "125g / 4½oz de azúcar glas (confitería) tamizada", "2 cucharadas de jugo de lima", "1 cdita de ralladura de lima, finamente rallada"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las nueces, la harina y la sal en el recipiente de un procesador de alimentos y procese hasta que las nueces se muelen.", "Coloque las yemas de huevo y el azúcar en un recipiente aparte y bata durante tres minutos, o hasta que la mezcla esté pálida y cremosa. Dobla a través de la ralladura y el coco, luego la mezcla de nueces.", "Coloque las claras de huevo en un recipiente limpio, seco, de acero inoxidable y bata hasta que se formen picos fuertes. Con una cuchara grande de metal, dobla ligeramente a través de la masa de nuez.", "Extienda la mezcla uniformemente en una lata de pastel con forma de resorte engrasada o antiadherente de 23 cm (9 pulg.). Hornee durante 40 minutos o hasta que el pastel esté ligeramente dorado.", "Mientras tanto, haz la guinda. Combine todos los ingredientes de glaseado en un bol y mezcle hasta que quede suave y brillante.", "Retire del horno y deje reposar durante 10 minutos en la lata. Coloque la torta en un plato de servir. Extiende el glaseado de lima sobre la torta caliente, permitiendo que rocíe por los lados.", "Servir."], "url": "www_bbc_co_uk_food_recipes_coconutandlimemacada_73762", "title": "Torta de macadamia de coco y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace una torta de 1 x 23 cm (9 pulgadas)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]