[{"isVegetarian": true, "title": "Chocolate orange swirl bread", "url": "www_bbc_co_uk_food_recipes_chocolate_orange_swirl_41752", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_orange_swirl_41752_16x9.jpg", "ingredients": ["120g/4oz unsalted butter, softened, plus extra for greasing ", "150g/5½oz caster sugar ", "1½ oranges, finely grated zest only", "4 green cardamom pods, seeds only, ground", "1½ tsp salt flakes, ground", "330ml/11fl oz full-fat milk, at room temperature", "90g/3¼oz 0%-fat Greek strained yoghurt", "700g/1lb 9oz strong white flour, plus extra for dusting", "12g/⅓oz fast-action yeast", "115g/4oz dark chocolate (80% cocoa solids), roughly chopped", "75g/2½oz ground almonds", "75g/2½oz flaked almonds", "¾ tsp cocoa powder", "⅔ bird’s-eye chilli, finely chopped and seeds removed", "¾ tsp ground ginger", "¾ tsp ground cinnamon", "large pinch freshly grated nutmeg", "1 free-range egg, lightly beaten ", "1 tbsp cacao nibs"], "serves": "Makes 1 sweet loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, in the bowl of a freestanding mixer cream the butter, sugar, orange zest, cardamom and salt until pale and fluffy. ", "Mix the milk and yoghurt together, then warm until it reaches body temperature or 37C if using a food thermometer. In a separate bowl, mix the flour with the yeast. Slowly mix the milk mixture into the butter mixture. If it curdles, add a little of the flour mixture, then go back to adding the milk. ", "Change the attachment on the mixer to a dough hook, then tip the flour on top of the wet ingredients and knead on a low speed until combined. Increase the speed to medium and knead for 10 minutes. ", "Transfer the dough to a large greased bowl and cover with cling film. Leave to prove in a warm place for 45 minutes. ", "For the filling, in a food processor combine the chocolate, both kinds of almonds, cocoa powder, chilli and spices. Pulse until it forms the consistency of breadcrumbs.", "Grease a 30x20x6cm/12x8x2½in baking tray and line with greased baking parchment.", "Flour the work surface and tip the dough out onto it. Cut away a third of the dough and set aside. Stretch the remaining dough into a rectangle approximately 40x20cm/16x8in.", "Cover the dough with two-thirds of the filling mixture, leaving a 1cm/½in gap at the long edge closest to you. Tightly roll up the dough starting with the long edge which is farthest away from you. Use the 1cm/½in strip (that is not covered with filling) to seal the join. Cut the roll into twelve 3cm/1¼in-thick slices and place on the prepared tray. ", "Stretch out the remaining dough into a 10x30cm/4x12in rectangle. Cover with the remaining filling, leaving a 1cm/½in gap at the long edge closest to you. Cut into six 4cm/1½in thick slices and use them to fill the gaps between the larger rolls. Place in a warm place to prove for a further 20 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To finish, brush the top of the buns with beaten egg and sprinkle with cocoa nibs. Bake in the middle of the oven for 30-40 minutes.", "Remove from the baking tray and set aside to cool on a wire rack."]}, {"isVegetarian": true, "title": "Chocolate panettone baked Alaska with a cherry compôte and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_chocolate_panettone_34099", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz dark cherries, pitted, stones reserved", "2 lemons, juice only", "500g/1lb 2oz jam sugar", "75g/2½oz caster sugar", "200g/7oz dark chocolate, chopped", "3 medium free-range egg whites", "90g/3¼oz caster sugar", "90g/3¼oz icing sugar, plus extra to serve", "1x 200g/7oz chocolate panettone", "2 tbsp kirsch", "500ml/18fl oz vanilla ice cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cherry compôte, place the cherry stones in a small square of muslin, gather into a bag and tie with string. Put the cherries in a preserving pan or a large heavy saucepan with the bag of cherry stones and pour in 300ml/10fl oz water. Bring to a boil then reduce to a simmer and cook for 10–15 minutes, or until the cherries are tender and are beginning to soften. Discard the stones. If you prefer some of the cherries to remain chunky in the compôte, don’t cook them for too long.", "Pour in the lemon juice and add the jam sugar. Heat gently, stirring until all the sugar has dissolved. Bring to a boil and keep at a steady rolling boil, stirring occasionally, for about 10 minutes, or until the jam reaches setting point. ", "To test if the jam has reached setting point, first remove the pan from the heat while you test the jam – this is very important. Spoon a little of the jam onto a cold saucer, leave to cool for a few minutes, then push your finger into the jam. If it wrinkles, it is ready. If not, return the pan to the heat and cook the jam for a minute or two more and test again. Allow to cool.", "Preheat the oven to 220C/450F/Gas 7.", "For the chocolate sauce, place the sugar and 75ml/2½fl oz water in a saucepan and cook until the sugar is melted. Add the chocolate and continue to cook for a couple of minutes, stirring well until you have a glossy sauce.", "For the chocolate panettone baked Alaska, whisk the egg whites with the caster sugar in a clean bowl until the mixture forms stiff peaks when the whisk is removed. ", "Add the icing sugar and whisk again until the mixture is smooth and shiny. Transfer to a piping bag.", "Slice the panettone and, using an 8cm/3¼in round pastry cutter, cut out four discs (each baked Alaska will serve two people. Use a smaller cutter if you want individual portions). Place onto serving plates and drizzle over the kirsch. Top with a large scoop of ice cream.", "Pipe the meringue around the ice cream, ensuring it is completely covered from top to bottom.", "Glaze the meringue briefly in a hot oven (alternatively use a chef’s blowtorch).", "To serve, spoon the chocolate sauce around the edge of each baked Alaska. Dust with icing sugar and serve with the cherry compôte alongside."]}, {"isVegetarian": true, "title": "Chocolate orange tart", "url": "www_bbc_co_uk_food_recipes_chocolate_orange_tart_25486", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_orange_tart_25486_16x9.jpg", "ingredients": ["100g/3½oz plain flour, plus extra for dusting", "50g/1¾oz icing sugar", "50g/1¾oz butter, diced, plus extra for greasing", "1 large free-range egg yolk", "75g/2½oz butter", "115g/4oz dark chocolate (no more than 60% cocoa solids), finely chopped", "115g/4oz golden caster sugar", "55g/2oz plain flour", "4 medium free-range eggs", "25g/1oz butter", "50g/1¾oz white chocolate", "1 orange, finely grated zest only ", "35g/1¼oz golden caster sugar", "25g/1oz plain flour", "2 medium free-range egg yolks"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Grease a 23cm/9in fluted tart tin with butter. ", "For the pastry, measure the flour, icing sugar and butter into the bowl of a food processor and pulse until the mixture resembles fine breadcrumbs. Add the egg yolk and a tablespoon of cold water and mix until it comes together to form a soft dough.", "Wrap the dough in cling film and leave to rest in the fridge for about 30 minutes.", "Preheat the oven to 200C(180C fan)/400F/Gas 6. ", "Dust the work surface with flour then roll out the pastry as thinly as you can to a circle about 5cm/2in larger than your flan tin. ", "Line the tin with the pastry. Don’t worry if the pastry breaks a little, it is easy to patch up. Chill for 15 minutes.", "Prick the base of the pastry with a fork, line the pastry case with baking paper or foil and fill with baking beans. Bake the pastry blind for 10 minutes, or until just lightly golden-brown. Remove the paper and beans and return the tart to the oven to cook for a further 5-7 minutes, or until pale golden-brown and the base is cooked.", "To make the chocolate filling, melt the butter and chocolate in a heatproof bowl set over a pan of gently simmering water until melted and smooth. Remove from the heat and stir in the sugar and flour. Beat in the eggs, one at a time, and leave to stand.", "To make the orange filling, melt the butter and white chocolate in a heatproof bowl set over a pan of gently simmering water until melted and smooth. Remove from the heat and stir in the orange zest, sugar and flour. Beat in the egg yolks, one at a time and pour the mixture into a jug.", "Place the pastry case on a baking tray. Pour the chocolate mixture into the pastry case. Drizzle or pipe  the orange filling over the chocolate filling to create a swirl effect. Draw a cocktail stick through the filling to create a marbled effect.", "Bake for 10-12 minutes, or until just set around the edges, but still slightly wobbly in the centre. ", "Remove from the oven and allow to cool slightly, until warm but not piping hot, then serve."]}, {"isVegetarian": true, "title": "Chocolate pasta with caramel and pecans", "url": "www_bbc_co_uk_food_recipes_chocolate_pasta_with_64143", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_pasta_with_64143_16x9.jpg", "ingredients": ["100g/3½oz cocoa or chocolate pasta", "pinch salt", "50g/1¾oz pecans, roughly broken up", "50g/1¾oz unsalted butter, softened", "50g/1¾oz dark brown sugar", "100ml/3½fl oz double cream, plus extra to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put water on to boil for the pasta and, when it’s boiling, add a pinch of salt and cook the pasta, setting a timer for two minutes before the packet instructions say it will be ready.", "Put a medium-sized, non-stick frying pan on the stove and tumble in the pecans, then toast them over a medium heat. Once you can smell their scent wafting up from the pan, remove them to a cold plate.", "Now stir the butter and sugar together in the frying pan until you have a hot, treacly syrup. Carefully pour in the cream, stir and let the caramel mixture bubble up, add the toasted pecans and a pinch of salt, then turn off the heat.", "Just before draining the pasta, lower in a cup to remove a little pasta-cooking water, then toss the drained pasta back into the frying pan with the dark and nutty butterscotch sauce, adding a tablespoon or two of the cooking water if needed to help coat the pasta.  Stir to combine before dividing between two bowls. Serve with a little double cream in a small jug to pour over as you eat, if wished."]}, {"isVegetarian": true, "title": "Chocolate pot with ginger", "url": "www_bbc_co_uk_food_recipes_chocolate_pot_with_54547", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_pot_with_54547_16x9.jpg", "ingredients": ["150ml/5fl oz double cream", "½ vanilla pod, split in half lengthways, seeds scraped with a sharp knife", "100ml/3½fl oz milk", "125g/4oz dark chocolate (70 per cent cocoa solids), broken into pieces ", "2 free-range egg yolks", "1 heaped tbsp icing sugar", "1 rounded tsp ground ginger", "30g/1oz preserved stem ginger, chopped into small pieces"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1. ", "Warm the cream and vanilla pod and seeds in a saucepan. Whisk lightly to disperse the vanilla seeds, turn off the heat and cover with a lid. Set aside to infuse for 30 minutes.  ", "Meanwhile, over a low heat, melt the chocolate in the milk in a small saucepan. ", "Beat the egg yolks, icing sugar and ground ginger together in a large bowl until light and fluffy. Add the chocolate mixture and vanilla-infused cream, remove the vanilla pod and whisk together until well combined. ", "Place the chopped ginger and a little ginger syrup into the bottom of the ramekins. Top with the chocolate mixture. Place the ramekins into a deep roasting tin and pour in enough hot water to come up to at least two-thirds up the side of the pots. Bake for 45-60 minutes, or until slightly puffed-up and spongy to the touch of a finger. The surface of the pot should form a little crust.", "Remove the pots from the oven, allow to cool for a few moments and lift the pots from the water onto a clean tray. Chill in the fridge for at least six hours before serving. Serve straight from the fridge."]}, {"isVegetarian": true, "title": "Chocolate pecan tart", "url": "www_bbc_co_uk_food_recipes_chocolate_pecan_tart_86249", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_pecan_tart_86249_16x9.jpg", "ingredients": ["125g/4½oz plain flour", "2 tbsp icing sugar", "2 tbsp cocoa powder", "1 medium free-range egg", "1 tsp lemon juice", "135g/4¾oz cold unsalted butter, cut into roughly 1cm/½in cubes", "80g/3oz dark chocolate, broken into pieces  ", "45g/1½oz unsalted butter  ", "160g/5¾oz granulated sugar  ", "235ml/8¼fl oz golden syrup  ", "3 free-range eggs  ", "1 tsp vanilla extract  ", "235g/8¼oz pecans, chopped", "vanilla ice cream or double cream, to serve"], "serves": "Serves 10", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put the flour, icing sugar and cocoa powder into a large bowl and mix them together. Lightly beat the egg with the lemon juice and 2 tablespoons very cold water in a measuring jug with a fork. Set aside. ", "Add the butter to the flour and toss the cubes to coat them in the flour. Rub the butter into the flour, using your fingertips. (Lift your hands above the bowl, rubbing the fat and flour together then letting the crumbs fall back into the bowl. Keep going until the mixture looks like fine breadcrumbs.) Make a well in the centre of the mixture and pour in the egg mixture. Incorporate the liquid into the flour and butter mixture, using one hand. Avoid overworking the dough as this will make your pastry tough. If it is too dry, add a splash more cold water. ", "When the dough just sticks together in clumps, form it into a ball. Knead it very lightly on a lightly floured surface to bring it together into a smooth dough. Again, don’t overwork it. You can test it by taking a little bit of pastry and rolling it out. If it starts to crack easily, it needs just a touch more kneading to develop the gluten slightly more. Wrap the pastry in cling film and leave it in the fridge to chill for about 30 minutes.", "Preheat the oven to 190C/170C Fan/Gas 5. Heat a heavy, flat baking tray. ", "Roll the pastry out on a floured surface and use it to line a 25cm/10in fluted flan tin. Leave any excess overhanging and prick the base of the pastry using a fork. Chill the pastry for 10 minutes. ", "Line the pastry case with parchment paper and fill with ceramic baking beans or uncooked rice. Place the tin on the hot baking tray and bake blind for about 15 minutes until set and pale golden-brown. Remove the beans and paper and return to the oven for about 10-12 minutes until the base is cooked. Reduce the oven temperature to 180C/160C Fan/Gas 4.  ", "For the filling, melt the chocolate and the butter together in a heatproof bowl over a pan of simmering water. When melted, set aside to cool slightly.", "In a medium saucepan, combine the sugar and golden syrup and bring to the boil, stirring constantly. Set aside to cool. ", "Beat the eggs in a large bowl, then stir in the chocolate mixture. Whisk in the sugar syrup mixture and thoroughly combine. (It’s important to cool the melted chocolate and sugar syrup or they will scramble the eggs.) Add the vanilla extract and stir in the pecans.  ", "Pour the pecan filling into the baked pastry and bake in the oven for 30-40 minutes until set. Cool and serve with vanilla ice cream or double cream."]}, {"isVegetarian": true, "title": "Chocolate peanut butter cheesecake", "url": "www_bbc_co_uk_food_recipes_chocolate_peanut_butter_74370", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_peanut_butter_74370_16x9.jpg", "ingredients": ["200g/7oz digestive biscuits", "50g/2oz salted peanuts", "100g/3½oz dark chocolate chips", "50g/2oz unsalted butter, softened", "500g/1lb 1oz cream cheese", "3 free-range eggs", "3 free-range egg yolks", "200g/7oz caster sugar", "125ml/4¼fl oz soured cream", "250g/9oz smooth peanut butter", "250ml/9fl oz soured cream", "100g/3½oz milk chocolate chips", "30g/1¼oz soft brown sugar"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. ", "For the base, process the biscuits, peanuts, dark chocolate chips and butter in a food processor. Once the mixture comes together in a clump, turn it out into a 23cm/9in springform tin and press it into the bottom of the tin and up the sides, using your fingers, to make a crunchy crust. Chill in the fridge while you make the filling.", "For the filling, process the cream cheese, eggs and egg yolks, sugar, soured cream and peanut butter in a food processor, whizzing to a smooth mixture.", "Pour and scrape the filling mixture into the cheesecake base in the chilled springform tin and cook for 1 hour, checking after 50 minutes. The top – only – should feel set and dry. When cooked, take the cheesecake out of the oven while you make the topping. ", "For the topping, warm the soured cream and chocolate chips with the brown sugar gently in a small saucepan over a low heat, whisking to blend in the chocolate as it melts. Once the mixture is melted and well combined, take off the heat.", "Spoon and spread the topping very gently over the top of the cheesecake, being as careful as you can in case you break the surface of the cheesecake. (Not that anything bad will happen; you’ll just have chocolate marbling the cake a bit.) Put it back in the oven for a final 10 minutes.", "Once out of the oven, let the cheesecake cool completely in its tin, then cover and put into the fridge overnight. When you are ready to eat the cheesecake, take it out of the fridge slightly in advance, just to take the chill off: this will make it easier to spring from the tin. Don’t let it get too warm, though, as it will become a bit gooey and be hard to slice."]}, {"isVegetarian": true, "title": "Chocolate profiteroles", "url": "www_bbc_co_uk_food_recipes_chocolate_profiteroles_33570", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_profiteroles_33570_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter", "60g/2oz plain flour, sifted", "2 large free-range eggs, at room temperature, beaten", "2 tsp caster sugar ", "350ml/12fl oz double cream", "1 tbsp icing sugar", "1 tsp vanilla extract", "200g/7oz dark chocolate, broken into pieces", "knob of butter ", "100g/3½oz finely chopped toasted almonds"], "serves": "Makes 25 profiteroles", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/190C Fan/Gas 7.", "To make the choux pastry, put 110ml/4fl oz water in a saucepan with the butter and bring to a rolling boil. Remove from the heat and tip in the flour. Stir vigorously with a wooden spoon until the mixture comes away from the sides of the pan into a ball. Return to a low heat and cook the pastry for a few minutes, beating it constantly. Tip into a large bowl to cool. ", "Beat the eggs into the pastry in stages, beating until the egg is incorporated before adding more. You may not need all the egg, you are looking for the mixture to fall from the wooden spoon in a reluctant drop (about 5–7 seconds). Your mixture must not become too loose or it will spread and not rise. ", "Place the mixture into a piping bag with a plain 1cm/½in nozzle. ", "Line a large baking sheet (or two) with baking paper and pipe 25 small balls, allowing each enough room to rise. Gently smooth the top of each ball with a wet finger as this will make it crisper.", "Bake for 20–30 minutes, or until deep golden and crisp.", "Turn the oven down to 180C/160C Fan/Gas 4. Make a small hole in the bottom of each choux bun with a skewer – move it about in the middle, but do not pierce through the other side. Place the buns back on the baking sheet and return them to the oven for 5 minutes. Allow to cool on a wire rack. ", "To make the filling, lightly whisk the cream, icing sugar and vanilla until it just holds its shape. Place it in a piping bag with a plain nozzle. Put the nozzle into the hole and pipe until the cavity fills with cream. The bun should feel heavy. ", "To make the topping, melt the chocolate and butter in a heatproof bowl over a pan of barely simmering water, making sure the bottom of the bowl does not touch the water, or in a microwave. Leave to cool slightly, then dip the top of each choux bun halfway into the chocolate and allow the excess to drip off. ", "Sprinkle the chopped almonds over the chocolate before it sets. Once the chocolate has set, assemble the profiteroles in a stack to serve."]}, {"isVegetarian": true, "title": "Chocolate quick bread with salted caramel sauce", "url": "www_bbc_co_uk_food_recipes_chocolate_quick_breads_07222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "80g/3oz good-quality cocoa powder", "½ tsp sea salt", "1 tsp baking powder", "1 tsp baking soda", "50g/1¾oz pecan nuts, chopped", "115g/4oz unsalted butter, softened", "200g/7oz caster sugar", "200ml/7fl oz buttermilk", "2 large free-range eggs", "50g/1¾oz sugar", "10g/¼oz unsalted butter", "120ml/4fl oz whipping cream", "½ tsp flaked sea salt", "200g/7fl oz caster sugar", "20 pecan nuts, shelled"], "serves": "Makes 1 sweet loaf", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with non-stick baking paper. ", "For the quick bread, sift together the flour, cocoa, salt, baking powder and baking soda in a medium bowl. Mix in the chopped pecan nuts.", "Melt the butter with the sugar in a pan, then pour into a clean bowl. Add the buttermilk. Mix the eggs in, one at a time, beating well after each addition. ", "Gradually mix the wet ingredients into the dry using your hands or a freestanding mixer. Turn the dough out on to a lightly floured surface and shape into a loaf. Score the top into portions using a knife. Place on the prepared tray and bake for 30-40 minutes, or until the base sounds hollow when tapped. Leave to cool on a wire rack. ", "For the salted caramel sauce, in a medium saucepan, heat the sugar over a medium heat. Do not stir it and let it slowly caramelise, take care as the sugar will be extremely hot. It will start browning around the edges of the pan first.", "Meanwhile in another plan, slowly warm the butter and cream.", "With the sugar pan, gently swirl the sugar around the pan to ensure the caramel cooks evenly. Once the sugar has caramelised to a golden-brown colour, carefully add a small amount of the cream. Take care as it will bubble vigorously. Stir constantly. Add the remaining cream, bit by bit.  Bring to a boil on a low heat and simmer for 5 minutes until the sauce becomes smooth and thick. Sprinkle in the salt and pour the sauce into a serving jug. ", "For the caramelised pecans, line a baking tray  with non-stick baking paper. Dissolve the sugar in a pan to make a dark caramel. Take care as the mixture will be extremely hot. Lay the pecans on the prepared tray and carefully pour the caramel over the pecans. Leave to set.", "Top the loaf with the caramelised pecans and serve with the salted caramel sauce"]}, {"isVegetarian": false, "title": "Chocolate reflection cake", "url": "www_bbc_co_uk_food_recipes_chocolate_reflection_23487", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_reflection_23487_16x9.jpg", "ingredients": ["50g/1¾oz cocoa powder", "6 tbsp boiling water", "3 large free-range eggs", "50ml/2fl oz full-fat milk", "175g/6oz self-raising flour", "1 tsp baking powder", "100g/3½oz baking spread, plus extra for greasing", "275g/9¾oz caster sugar", "7 sheets (11g) leaf gelatine", "225g/8oz caster sugar", "75g/2¾oz cocoa powder", "5 tbsp double cream", "50g/1¾oz dark chocolate, chopped into chunks", "2 tbsp apricot jam, sieved", "300ml/10fl oz double cream, whipped until stiff peaks form", "10 strawberries"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line the base of two 20cm/8in loose-bottomed cake tins with baking paper and grease the sides with baking spread. ", "Sieve the cocoa powder into a large mixing bowl. Add the water and stir until you have a smooth paste. Add the remaining ingredients. Whisk together using an electric hand whisk until light and fluffy. Spoon into the two tins and level the tops. ", "Bake for 20–25 minutes, until well risen and coming away from the sides of the tins. Transfer to a wire rack to cool. ", "To make the icing, put the gelatine leaves in a shallow bowl of cold water for 5 minutes until soft.", "Put the sugar, cocoa powder, cream and 125ml/4fl oz water into a saucepan over a medium heat. Stir until melted, then bring up to the boil and stir until smooth. Remove from the heat and stir in the chocolate. Leave to cool for 5 minutes.  ", "Squeeze any liquid from the gelatine leaves and stir into the chocolate mixture until dissolved. Pour through a sieve into a bowl and leave to cool and thicken in the fridge for about an hour, until it reaches the consistency of thick mayonnaise. ", "Slice each cake in half horizonatally. Put one cake half on a wire rack and smooth a layer of whipped cream on top. Continue this process so you have four layers of cake and three layers of cream. Press the cakes down between each layer so the cream comes right to the edges and the cakes are level at the sides. Smooth around the edges with a palette knife so the excess cream very lightly covers the sides and gives a smooth edge.  ", "Gently warm the apricot jam and brush lightly over the cake, covering the sides and top. Chill in the fridge for 15 minutes.", "Put about 100ml/3½fl oz of the icing in a heatproof bowl and gently melt over a pan of simmering water. Dip half of each strawberry in the melted icing. Put on baking paper to set.", "Once the cake has finished cooling in the fridge, transfer to a wire cooling rack placed on a large baking tray to catch any excess glaze as you pour it over the cake. Pour the remaining icing over the cake and smooth over the top and sides. Be very careful doing this, you want a smooth shiny icing.  Leave for an hour or so to set. Arrange the glazed strawberries around the bottom edge of the cake."]}, {"isVegetarian": true, "title": "Chocolate roulade", "url": "www_bbc_co_uk_food_recipes_chocolate_roulade_79152", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_roulade_79152_16x9.jpg", "ingredients": ["175g/6oz good-quality dark chocolate, finely chopped", "6 free-range eggs, separated", "175g/6oz caster sugar ", "2 tbsp cocoa powder ", "300ml/10fl oz double cream", "icing sugar, to dust"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160 Fan/Gas 4. Lightly grease a 33cm x 23cm/13in x 9in Swiss roll tin then line the base and sides of the tin with a large sheet of greaseproof paper, pushing it into the corners. Make a small diagonal snip in each corner of the paper; this helps to fit the paper snugly into the corners of the tin.", "Melt the chocolate in a bowl set over a pan of barely simmering water. (Do not let the base of the bowl touch the water.)", "Place the egg whites in a large bowl and whisk until stiff but not dry. If you turn the bowl upside down, the whites should be stiff enough not to fall out. ", "Put the egg yolks in a separate bowl with the sugar and whisk using the same whisk (no need to wash it) on high speed for 2-3 minutes or until thick and creamy and the mixture leaves a thick ribbon-like trail when the beaters are lifted. Pour in the cooled chocolate and gently fold together until well combined. ", "Gently stir two large spoonfuls of the egg whites into the chocolate mixture to loosen the mix, then fold in the remaining egg whites using a large metal spoon (you don’t want to squash out the air you have just beaten in). Sift the cocoa over the top and lightly fold it in. Pour the mixture into the prepared tin and gently move the tin around until the mixture is level. ", "Bake in the preheated oven for about 20-25 minutes until risen and the top feels firm and slightly crisp. Remove from the oven, leave in the tin (expect the roulade to fall and crack a little) and set aside until cold. ", "Whip the cream until it just holds its shape. Lay a large piece of greaseproof paper on the work surface and dust it lightly with icing sugar. Turn the roulade out on to the paper so its lining paper is on top, then carefully peel off the paper. Spread the roulade with the whipped cream, leaving a border of about 2cm/¾in all the way around the edges. With one of the shortest edges facing you, make a cut along it with a sharp knife, going about half way through the sponge. This will help to start the rolling up. Now roll this cut edge over tightly to start with and use the paper to help continue the tight rolling, by pulling it away from you as you roll. Don’t worry if the roulade cracks - that is quite normal and all part of its charm. ", "Finish with the join underneath then lift the roulade onto a serving plate or board using a large wide spatula or two fish slices. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Chocolate salame", "url": "www_bbc_co_uk_food_recipes_chocolate_salame_17894", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_salame_17894_16x9.jpg", "ingredients": ["250g/9oz dark chocolate (minimum 70% cocoa solids)", "250g/9oz amaretti (crunchy ones) or rich tea biscuits", "100g/3½oz unsalted butter, softened", "150g/5½oz caster sugar", "3 free-range eggs", "2 tbsp amaretto liqueur", "2 tbsp cocoa powder", "75g/2½oz almonds, roughly chopped", "75g/2½oz hazelnuts, roughly chopped", "50g/2oz pistachios, roughly chopped", "1 tbsp icing sugar, to decorate"], "serves": "Makes about 20 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In the microwave (following the manufacturer’s instructions) or in a heatproof bowl suspended over a saucepan of simmering water (but not touching the water), melt the chocolate until smooth. While the chocolate’s melting, put the biscuits into a large freezer bag, seal and bash them with a rolling pin until you have a bag of rubble – not dust. When the chocolate’s melted, remove it to a cold place (not the fridge) and set aside to cool.", "Cream the butter and sugar together: I do this in a freestanding mixer, but you don’t have to. You just need to use a large bowl and make sure the mixture is soft and superlight.", "Gradually, and one by one, beat in the eggs. Don’t worry if the mixture looks curdled at this stage: all manner of ills will be righted once the chocolate is added later. Then beat in the amaretto liqueur.", "Push the cocoa powder through a little sieve or tea strainer into the cooled chocolate, and, with a small rubber spatula, stir till combined, then beat this into the egg mixture too.", "When you have a smooth chocolate mixture in front of you, tip in the chopped nuts and crushed biscuits. Fold these in firmly but patiently to make sure everything is chocolate-covered. Transfer this mixture, still in its bowl, to the fridge to firm up a bit for 20-30 minutes. Don’t leave it for much longer than this or it will be difficult to get out of the bowl to shape.", "Unroll and slice off two large pieces of cling film, overlapping them, so that you have a large cling-covered surface to roll the chocolate salame out on. Tip the chocolate mixture out in the middle of this and – using your hands, messy though this is – mould the mixture into a fat salame-like log, approximately 30cm/12in long.", "Cover the chocolate log completely with the cling film, and then firmly roll it, as if it were a rolling pin, to create a smooth, rounded cylinder from the rough log you started with. Twist the ends by grasping both ends of the cling film and rolling the sausage-log towards you several times. Then put it in the fridge for at least six hours – though preferably overnight – to set.", "Now – one it’s set – for the exciting bit: tear off a large piece of greaseproof paper and lay it on a clear kitchen surface. Take the salame out of the fridge and sit it on the paper. Measure out a piece of string at least six times longer than the length of the salame, and tie one end of the string firmly round the twisted knot of cling film at one end of the salame. Then trim away as much cling film as you can, but without cutting either of the tapered, nose ends, so that you can attach the string to these.", "Dust your hands with a little icing sugar and then rub two tablespoons of icing sugar (more if needed) over the unwrapped salame to stop it getting sticky as you string it up. Plus it makes it look more like a salame.", "Make a loop with the string, a little wider than the salame, and feed it over the end of the salame, close to where it is tied on. Pull on the trailing end to tighten (but not too tightly) and form another loop of string as before. Work this second loop around the sausage, 4cm or so further along from the first, tighten again and repeat until you reach the far end of the salame, then tie the string firmly round the other twisted nose of cling film.", "With your remaining length of string, start to feed it back along the salame, twisting it around the encircling string each time it crosses a loop, then tie it again when you come to the end. Repeat these lengths as many times as you want, to make the authentic-looking pattern, but two or three times would be enough to get the effect.", "Transfer it to a wooden board, and cut some slices, fanning them out as if they were indeed slices of salame, leaving a knife on the board, too, for people to cut further slices, as they wish. Obviously, when you cut the salame, you will need to cut through the string, but the many knots and twists keep it securely tied. Serve fridge cold, or very near to it."]}, {"isVegetarian": true, "title": "Chocolate sponge pudding", "url": "www_bbc_co_uk_food_recipes_chocolate_sponge_pudding_16237", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz golden syrup", "350g/12oz butter, softened, plus extra for greasing", "125g/4½oz caster sugar", "100g/3½oz cocoa powder", "6 free-range eggs, lightly beaten", "350g/12oz self-raising flour"], "serves": "Serves 16", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Generously butter the inside of two 1.2 litre/2 pint pudding basins.", "Spoon half the golden syrup into the base of each pudding basin and set aside.", "Beat the butter, sugar and cocoa powder together in a mixer until fluffy.", "Beat in half the eggs followed by half the flour and when well combined, add the remaining eggs and flour. The mixture should be at just dropping consistency. Add a splash of milk if the mixture is too thick.", "Spoon the mixture into the pudding basins only filling them three quarters full, then smooth the top with the back of a spoon.", "Loosely cover with cling film, allowing room for the cling film to inflate as the mixture rises, and cook in the microwave on high power for five minutes. The pudding is done when a skewer inserted into the centre of the pudding come out clean. ", "Leave to stand for five minutes then run a blunt knife around the edge of the pudding to loosen the sides, carefully invert onto a deep plate and remove the basin.", "Cut the puddings into 8 generous wedges each and serve with custard."]}, {"isVegetarian": true, "title": "Chocolate traybake with feather icing", "url": "www_bbc_co_uk_food_recipes_chocolate_tray_bake_with_69567", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_tray_bake_with_69567_16x9.jpg", "ingredients": ["50g/1¾oz cocoa powder", "6 tbsp boiling water", "100g/3½oz baking spread or soft butter", "275g/9¾oz caster sugar", "3 large free-range eggs", "125ml/4fl oz milk", "175g/6oz self-raising flour", "1 tsp baking powder", "3-4 tbsp warmed, sieved apricot jam", "100ml/3½fl oz double cream", "200g/7oz milk chocolate, finely chopped or grated ", "100g/3½oz white chocolate "], "serves": "Makes 21 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 (160C fan).", "Put the cocoa in a large bowl, add the boiling water and mix until smooth. Add the baking spread or butter and beat into the cocoa until smooth, then add the remaining cake ingredients and mix until combined – this can be done in a mixer or by hand.", "Pour into the tin, spread evenly and bake in the preheated oven for about 30-35 minutes, or until well risen, just firm to the touch and shrinking away from the sides of the tin. Leave to cool in the tin for 10 minutes, then turn out and peel off the baking parchment. Brush the top of the cake with apricot jam and leave to cool completely", "For the icing, warm the cream in a small pan until hot, then add the milk chocolate and stir until completely melted and smooth. Leave to cool a little so that it is a thick pouring consistency (this won’t take long depending on room temperature). Pour the icing over the cake, spreading out with a palette knife to cover the cake completely. ", "To decorate, melt the white chocolate in a small bowl over a pan of gently simmering water. Place in a small piping bag, snip the end and pipe in lines down the cake, about 1cm/½in apart. Using a cocktail stick, drag through the white chocolate in opposite directions across the cake to give a feathered effect."]}, {"isVegetarian": true, "title": "Chocolate truffles", "url": "www_bbc_co_uk_food_recipes_chocolate_truffles_00494", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_truffles_00494_16x9.jpg", "ingredients": ["300g/10½oz assorted chocolate bars, including dark chocolate, milk chocolate and raisin and nut chocolate, broken into pieces", "30g/1oz unsalted butter", "250ml/8¾fl oz double cream", "pinch salt", "100g/4oz chopped mixed nuts, such as pistachios, roasted hazelnuts and almonds"], "serves": "Makes 30", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Bring a little water to a simmer in a pan. Place the chocolate and butter in a large bowl, then set the bowl over the simmering water. (Do not allow the base of the bowl to touch the water.) Stir until melted and glossy.", "Heat the cream in a separate saucepan until almost boiling (but do not allow the cream to reach boiling point).  Remove from the heat and allow to cool for 5 minutes.", "Pour the warm cream over the melted chocolate and mix together until smooth and well combined. Stir in a pinch of salt.", "Line a roasting tray with greaseproof paper and pour in the melted chocolate. Set aside to cool, then chill in the fridge until set. ", "Once the chocolate mixture has cooled and set, mix the chopped nuts together and sprinkle onto a baking tray. ", "Scoop out small portions of the chilled chocolate mixture with a teaspoon, then roll them into balls with your hands.  Roll each ball in the chopped nuts until completely coated. Place the truffles onto a baking tray or plate and chill until ready to serve.  The truffles will keep for 1-2 weeks."]}, {"isVegetarian": true, "title": "Chocolate truffle pots", "url": "www_bbc_co_uk_food_recipes_chocolate_truffle_pot_53461", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_truffle_pot_53461_16x9.jpg", "ingredients": ["100g/3½oz dark chocolate, minimum 70% cocoa solids, broken into pieces", "50g/1¾oz caster sugar", "2 free-range egg yolks", "1 tbsp Irish cream liqueur", "300ml/10fl oz pouring double cream", "4 digestive biscuits, finely crushed", "dash Irish cream liqueur", "100g/3½oz white chocolate", "cocoa powder, for dusting"], "serves": "Makes 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Whizz the chocolate in a food processor. ", "Put the sugar and 6 tablespoons of water in a small saucepan and heat gently, stirring, until the sugar has dissolved. Boil for a few seconds until it becomes a thin syrup.  ", "Set the food processor running and pour the hot syrup through the funnel on to the chocolate so it melts. Add a little boiling water if some unmelted chocolate remains. Add the egg yolks and process for a few seconds before adding the Irish cream liqueur. ", "In a separate bowl, whip the cream until soft peaks form, then fold in the chocolate mixture. Reserve 3 tablespoons of mousse in a small bowl. Spoon the remaining mousse into small glasses or pots. Leave in the fridge to set for 6 hours or overnight.", "To make the chocolate truffles, add the crushed biscuits to the reserved mousse with a splash of Irish cream liqueur. Mix well and shape into six truffle-size balls. Put on a plate in the fridge for 30 minutes. ", "Melt the white chocolate in a small heatproof bowl over a pan of gently simmering water, making sure the bowl doesn't touch the water. Insert a cocktail stick into the balls, dip into the melted white chocolate and swirl around until coated. Put on a piece of baking paper, and place in the fridge for 30 minutes, or until firm. ", "Place one truffle on top of each mousse before serving and dust with cocoa. Serve straight from the fridge."]}, {"isVegetarian": true, "title": "Chocolate truffles with cinder toffee", "url": "www_bbc_co_uk_food_recipes_chocolate_truffles_with_97104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350ml/12fl oz double cream", "400g/14oz dark chocolate, about 60% cocoa solids, broken into pieces", "3-4 tbsp sifted cocoa powder", "200g/7oz caster sugar", "50ml/1¾fl oz clear honey", "1 tbsp liquid glucose", "¾ tsp bicarbonate of soda"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the chocolate truffles, place the cream into a saucepan and bring to the boil.", "Put the chocolate into a bowl, then when the cream is boiling pour it over the chocolate and mix well until the mixture is smooth.", "Set aside to cool, then cover and place into the fridge to chill and become firm for about two hours.", "Sift the cocoa powder onto a plate and, using a teaspoon, curl balls of chocolate and drop straight into the cocoa and then roll to coat them", "Place on a plate to firm up, then serve, or keep in a sealed container in the fridge until ready to serve.", "For the cinder toffee, line a baking tray with baking parchment.", "Place the sugar, honey, glucose and 50ml/1¾fl oz of water into a saucepan and bring to a boil.", "Continue to cook until the temperature reaches 160C/320F on a sugar thermometer.", "Remove from the heat, allow to cool for 30 seconds so that the bubbles disperse, then quickly beat in the bicarbonate of soda, stirring constantly.", "Pour onto the lined baking tray and leave to cool for 30 minutes.", "Break into shards and store in a sealed container until you want to serve it."]}, {"isVegetarian": true, "title": "Chocolate volcanoes", "url": "www_bbc_co_uk_food_recipes_chocolate_volcanoes_37330", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_volcanoes_37330_16x9.jpg", "ingredients": ["2-3 tbsp cocoa powder, for dusting", "165g/5¾oz dark chocolate (70 percent cocoa solids), chopped into small pieces", "165g/5¾oz unsalted butter, cut into small pieces, plus extra for greasing", "3 medium free-range eggs", "3 medium free-range egg yolks", "85g/3oz caster sugar", "2 tbsp plain flour", "double cream, to serve"], "serves": "Makes 6 individual puddings", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Grease six small pudding moulds with butter and dust the insides with cocoa powder, then refrigerate for 30 minutes.", "Melt the chocolate and butter in a heatproof bowl set over a pan of simmering water (do not let the bowl touch the water). Set aside to cool slightly.", "Using an electric whisk, whisk the eggs, egg yolks and caster sugar together for several minutes until a thick, pale mousse-like consistency.", "Carefully fold the cooled melted chocolate and butter into the egg and sugar mix. Finally fold in the flour carefully so as not to knock any air out of the mixture.", "Divide the mixture equally between the prepared moulds. Place in the fridge for at least two hours or until firm. You can make the puddings up to 24 hours in advance and leave them in the fridge until you are ready to cook them.", "Preheat the oven to 200C (180C fan)/400F/Gas 6. Place the puddings on a baking tray and bake for eight minutes, or until the puddings are risen but not cracked. ", "Turn out the puddings on to individual plates and serve, with pouring cream."]}, {"isVegetarian": true, "title": "Chocolate whoopie pies and salted peanut brittle", "url": "www_bbc_co_uk_food_recipes_chocolate_whoopie_pies_37636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "350g/12oz salted peanuts", "230g/8oz plain flour", "65g/2¼oz cocoa powder", "1 tsp baking powder", "¼ tsp bicarbonate of soda", "¼ tsp fine salt", "170g/6oz butter, softened", "150g/5½oz caster sugar", "1 large free-range egg, beaten", "1 tsp vanilla extract", "4 tbsp buttermilk", "100ml/3½fl oz strong coffee", "400ml/14fl oz double cream", "50g/1¾oz icing sugar", "100g/3½oz marshmallows, roughly chopped", "4 tbsp smooth peanut butter", "2 scoops vanilla ice cream", "280ml/9½fl oz full-fat milk"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Line a baking tray with a silicone sheet. Line another tray with baking parchment.", "Place the sugar in a large frying pan over a medium heat. Melt the sugar and cook, without stirring, until it turns golden brown, then add the peanuts. Pour the mixture onto the silicone sheet. Leave to set.", "For the whoopie pies, place the flour, cocoa, baking powder, bicarbonate of soda, salt, butter, sugar, eggs, vanilla extract, buttermilk and coffee in a free-standing food mixer and mix until well combined.", "Place the mixture in a piping bag with a plain round nozzle and pipe 4cm/1½in circles, leaving a 3cm/1¼in gap between them on the baking parchment.", "Bake the whoopie pies for 10 minutes until springy to the touch. Leave to cool on a wire rack.", "For the filling, whisk the cream with the sugar in a large bowl and stir in the marshmallows.", "For the peanut butter milkshake, place all the milkshake ingredients in a blender and blend until smooth.", "To serve, take one of the whoopies and spoon on a tablespoon of the cream and sandwich with another whoopie. Smash the brittle and serve some on the side. Pour the milkshake in a shot glass and serve alongside."]}, {"isVegetarian": false, "title": "Chocolate whoopie pies", "url": "www_bbc_co_uk_food_recipes_chocolate_whoopies_67418", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_whoopies_67418_16x9.jpg", "ingredients": ["125g/4½oz butter", "150g/5½oz chocolate, minimum 70% cocoa solids, plus extra for melting (optional)", "225g/8oz sugar", "3 free-range eggs", "1 tsp vanilla extract", "250g/8¾oz flour", "30g/1¼oz cocoa powder", "½ tsp baking powder", "18 marshmallows", "Cocoa powder", "Icing sugar"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper.", "Melt the butter and chocolate in a bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water.)", "Whisk the sugar, eggs and vanilla together in a separate bowl then fold in the chocolate mixture.", "Sift the flour, cocoa and baking powder together, then fold into the chocolate and egg mixture.", "Place tablespoonfuls of the mixture onto the baking tray (the mixture should make 36 biscuits) and bake in the oven for 6-8 minutes.", "Remove from the oven and set aside half of the biscuits on a cooling rack. Turn the remaining biscuits over and place a marshmallow on top of each. Return to the oven for 2-3 minutes, or until the marshmallows have softened.", "Remove from the oven and set aside on a cooling rack to cool slightly. Press the cooled biscuits on top.", "Optional: Melt 100g/3½oz extra chocolate and pour this over the cookies, then set aside to cool."]}, {"isVegetarian": true, "title": "Chocolate yuzu miso", "url": "www_bbc_co_uk_food_recipes_chocolate_yuzu_miso_80775", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz good quality milk chocolate (minimum 40% cocoa solids)", "2 tbsp sunflower oil", "125ml/4fl oz yuzu juice", "150ml/5fl oz sugar syrup", "5½g agar-agar", "salt, for seasoning ", "citric acid, for seasoning", "10g/¼oz dried miso powder", "20g/¾oz sea salt flakes"], "serves": "Serves 16-20", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the aerated chocolate, melt the chocolate with the sunflower oil and leave to infuse for 1 hour.", "Strain into an espuma gun and charge with 2 bulbs.", "Spray 100g/3½oz into a plastic container and place into a vacuum pack machine. Then place in a sous-vide machine and turn off when the chocolate reaches the top of the container.", "Leave in the fridge for at least 2 hours. Remove from container and cut into 4 portions.", "For the yuzu purée, mix the yuzu juice, sugar syrup and agar-agar together. Place in a pan and bring up to the boil. Pour into a container and leave to set.", "Once set, transfer to a blender and blend until smooth. Strain and if needed, season with a little salt and citric acid.", "For the miso salt, gently coat the salt in the miso powder and store in an airtight container until needed.", "To serve, pipe 5 dots of the yuzu purée across each portion of the aerated chocolate and dust with 4 to 5 grains of the miso salt. "]}, {"isVegetarian": true, "title": "Chocolate and chilli mousse", "url": "www_bbc_co_uk_food_recipes_chocolateandchillimo_87986", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolateandchillimo_87986_16x9.jpg", "ingredients": ["100g/3½oz milk chocolate, chopped", "1 red chilli, chopped", "300ml/½ pint double cream, whipped to soft peaks", "icing sugar, to dust"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chocolate into a bowl set over a pan of gently simmering water and heat, stirring occasionally, until melted.", "Stir in almost all of the chilli. Remove from the heat and leave to cool slightly. ", "Fold the melted chocolate into the whipped cream in a large bowl, then spoon into a serving dish. Chill until needed.", "To serve, scatter with the reserved chilli and dust with icing sugar."]}, {"isVegetarian": true, "title": "Chocolate and caramel puddings", "url": "www_bbc_co_uk_food_recipes_chocolateandcaramelp_89233", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["120g/4oz unsalted butter, plus extra for greasing", "120g/4oz dark chocolate (minimum 70 per cent cocoa solids)", "4 free-range eggs", "220g/7½oz caster sugar", "75g/2½oz plain flour", "½ tsp baking powder", "50g/2oz cocoa powder", "200g/7oz sugar", "100g/3½oz butter", "100ml/3½fl oz double cream", "whipped or clotted cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Grease four ovenproof coffee or tea cups (or ramekins) with butter.", "Place the dark chocolate and the butter into a heatproof bowl placed over a pan of barely simmering water (make sure the water doesn't touch the bottom of the bowl).", "Stir the chocolate and butter mixture until melted and combined, then remove from the heat and allow to cool slightly.", "Beat the eggs in a separate bowl until foamy, then add the sugar and beat until pale and thick.", "Gradually add the melted chocolate and butter mixture to the eggs, stirring continuously. ", "Sift the flour, baking powder and cocoa powder together, then fold into the chocolate and egg mixture.", "Pour the mixture into the prepared cups and bake for 8-12 minutes (depending on the size of the cups), or until cooked but still gooey in the middle. ", "For the sauce, melt the sugar in a heavy-based pan over a medium heat, stirring continuously.", "Add the butter and whisk well until combined, then remove from the heat and whisk in the cream. ", "To serve, place the puddings in their cups onto small serving plates. Pour over the caramel sauce and finish with a dollop of whipped or clotted cream."]}, {"isVegetarian": true, "title": "Chocolate and hazelnut meringues", "url": "www_bbc_co_uk_food_recipes_chocolateandhazelnut_86256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg whites", "300g/10½oz caster sugar", "50g/2oz chocolate (70 per cent cocoa solids), grated ", "3 tbsp cocoa powder", "1 tsp sherry vinegar", "150g/5oz hazelnuts, shelled, toasted, roughly chopped", "400ml/14fl oz double cream, whipped until soft peaks form when the whisk is removed", "1 vanilla pod, split, seeds scraped out", "1 tbsp sugar", "200g/7oz ready-made chocolate hazelnut spread", "100g/3½oz unsalted butter", "200ml/7fl oz double cream", "2 tbsp hazelnut liqueur"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/365F/Gas 4. ", "For the meringues, beat the egg whites in a bowl until stiff peaks form when the whisk is removed.", "Add the sugar, one tablespoon at a time, whisking well.", "Add the chocolate, cocoa powder, vinegar and nuts and gently fold into the meringue mixture.", "Line a baking tray with greaseproof paper and spoon small mounds of meringue mixture onto it.", "Transfer the tray to the oven and turn down the heat to 150C/300F/Gas 2 immediately and bake for 45-50 minutes. (The meringues should be crisp on the outside and chewy in the middle.)", "For the filling, place the cream, vanilla seeds and sugar into a clean bowl and mix together well.", "For the sauce, place the chocolate hazelnut spread, butter, double cream and hazelnut liqueur into a pan over a low heat. Allow the ingredients to melt, stirring occasionally, until combined.", "To serve, place a dollop of filling mixture between two meringues. Place onto a plate and pour the sauce over the top. Repeat with the remaining meringues and serve."]}, {"isVegetarian": true, "title": "Chocolate and hazelnut torte", "url": "www_bbc_co_uk_food_recipes_chocolateandhazelnut_90185", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolateandhazelnut_90185_16x9.jpg", "ingredients": ["200g/7oz dark chocolate, chopped", "3 large free-range eggs", "110g/4oz unsalted butter, diced", "150g/5oz caster sugar", "90g/3oz ground hazelnuts", "60g/2oz self-raising flour", "3 tbsp orange liqueur", "pinch salt", "freshly whipped cream, to serve", "100g/3½oz dark chocolate (70% cocoa solids), chopped", "60g/2oz unsalted butter, diced", "1 tbsp orange liqueur (optional)", "10-12 whole toasted hazelnuts, to decorate"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line the base of a 23cm/9in cake tin with baking paper and grease the sides.", "Place the chopped chocolate in a heat-proof bowl over a pan of simmering water, ensuring the bowl doesn't touch the water. Stir gently until the last lumps have disappeared then remove from the heat. Add the butter and stir until completely incorperated.", "Separate the egg whites from the egg yolks, placing each into separate bowls. Add the sugar to the egg yolks and whisk with an electric whisk until pale and fluffy. Carefully fold in the chocolate, ground hazelnuts and the flour.  Finally, add the orange liqueur.", "Using an electric whisk, whisk the egg whites with the salt until stiff peaks form. Stir a spoonful of the egg white into the chocolate batter until completely incorporated, then fold the remaining egg whites into the batter with a metal spoon.", "Pour the cake mixture into the prepared tin and bake for 40-50 minutes, until firm to the touch. (It will still be moist in the centre so the usual skewer test won't work.) Cool for 5-10 minutes, then turn out onto a wire rack to finish cooling. When cool place on a serving plate.", "To make the glaze, melt the chocolate in a heat-proof bowl over a pan of simmering water, ensuring the bowl doesn't touch the water. Remove the bowl from the heat and beat in the butter bit by bit with a wooden spoon. Add the liqueur, if using. Let cool for 5-10 minutes, until it begins to thicken, but is still runny. ", "Spread the glaze over the cake and down the sides, using a palette knife. Decorate the top with the whole hazelnuts before the glaze sets. Serve with some freshly whipped cream."]}]