[{"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "250g / 9oz de arroz basmati", "300ml / ½ litro de caldo de verduras calientes", "50g / 1¾oz de margarina", "un puñado de eneldo fresco, perejil, perifollo, picado", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una cacerola, agregar la cebolla y freír suavemente hasta que se ablande.", "Agregue el ajo y cocine por un minuto, luego agregue el arroz y mezcle bien para cubrir los granos.", "Agregue un cucharón de caldo caliente a la sartén y mezcle bien hasta que casi todo el caldo haya sido absorbido. Repita con el resto del caldo hasta que todo el caldo haya sido absorbido y el arroz esté tierno.", "Agregue la margarina y las hierbas, reserve algo para la guarnición y sazone bien con sal y pimienta negra recién molida.", "Para servir, transfiera el risotto a un recipiente y adorne con las hierbas restantes."], "url": "www_bbc_co_uk_food_recipes_herbrisotto_85056", "title": "Risotto de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 ramita de romero fresco, picado", "pequeño puñado de perejil fresco, picado", "½ diente de ajo, picado", "sal y pimienta negra recién molida, al gusto", "1 muslo de pollo", "dash aceite de oliva", "10 patatas nuevas, peladas y partidas por la mitad", "¼ de cebolla, finamente picada", "2 cucharadas de mantequilla", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida, al gusto", "1 cucharada de crema doble", "dash aceite de oliva", "55g / 2oz de tomates cherry", "3 cucharadas de vino tinto", "1 cucharada de vinagre balsámico", "pequeño brócoli puñado, cortado en floretes, al vapor, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo, mezcle las hierbas, el ajo y el condimento en un tazón y luego empuje la mezcla debajo de la piel del muslo de pollo.", "Caliente una pizca de aceite de oliva en una sartén a prueba de horno, agregue el pollo y fría por cuatro minutos. Voltee y coloque en un horno caliente durante diez minutos, o hasta que los jugos estén limpios cuando inserte la punta de un cuchillo en el pollo y esté completamente cocido.", "Para las papas, hierva las papas en agua hirviendo con sal durante diez minutos o hasta que estén suaves. Escurra bien, agregue la cebolla, la mantequilla, el cebollín, la sal y la pimienta negra recién molida y doble crema y mastique hasta que quede suave.", "Para la salsa, vierta un chorrito de aceite de oliva en una sartén limpia. Agregue los tomates cherry y fría por cinco minutos. Agregue el vino tinto y el vinagre balsámico a la sartén y cocine a fuego lento durante un minuto.", "Para servir, apile las papas trituradas en un plato para servir, cubra con el muslo de pollo y vierta la salsa de vino tinto sobre la parte superior. Sirva con el brócoli al vapor."], "url": "www_bbc_co_uk_food_recipes_herbstuffedchickenwi_86838", "title": "Pollo relleno de hierbas con patatas trituradas y salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de azúcar en polvo", "1 limón, ralladura y jugo", "6 hojas de verbena de limón, magulladas ligeramente, más extra para servir", "1 cucharadita de agua de azahar", "400ml / 14fl oz de agua de soda", "Vodka 100 ml / 3½ fl oz", "hielo"], "method": ["Para hacer un jarabe de azúcar, ponga el azúcar, la ralladura de limón y el jugo, y 200 ml / 7 fl oz de agua en una olla grande colocada a fuego medio-bajo. Caliente hasta que el azúcar se haya disuelto.", "Mezcle el jarabe de azúcar, las hojas de verbena magulladas, el agua de azahar, el agua de soda y el vodka en una jarra.", "Verter en vasos llenos de hielo y terminar con hojas de verbena de limón."], "url": "www_bbc_co_uk_food_recipes_herby_cocktail_97456", "title": "Cóctel Herby", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina natural, más extra para espolvorear", "1 cucharadita de sal marina fina", "50g / 1¾oz de mantequilla, derretida", "400g / 14oz de mantequilla sin sal muy fría", "1 huevo de gallinas camperas, batido, para lavar huevos", "1 cucharada de romero fresco finamente picado", "1 cucharada de tomillo fresco finamente picado", "1 cucharada de sabio fresco finamente picado", "50g / 1¾oz de pan rallado fino", "pimienta negra recién molida", "½ limón sin cebar, solo cáscara", "100g / 3½oz de pimientos rojos asados ​​de una jarra, escurridos, finamente picados", "Queso duro de cabra de 140g / 5oz, finamente rallado"], "method": ["Para la masa, tamizar la harina en un tazón grande y hacer un pozo en el centro. Agregue la sal, 225ml / 8fl oz de agua helada y la mantequilla derretida en el medio del pozo. Con las puntas de los dedos, revuelva gradualmente el líquido e incorpore la harina. Una vez que la mezcla se haya juntado en una masa, amásala un par de veces con firmeza para ponerla en forma de bola. Envuélvala en una película adhesiva y déjela enfriar durante 10 minutos en el congelador.", "Retire la mantequilla del refrigerador y colóquela entre dos hojas de papel resistente a la grasa. Use un rodillo para batir el bloque de mantequilla en un cuadrado de 19 cm / 7½. Enfríe en el congelador por 10 minutos.", "Retire la masa del congelador y la punta sobre una superficie ligeramente enharinada. Estirar la masa en forma de diamante que es un poco más grande que el tamaño del bloque de mantequilla. Coloque la mantequilla en el centro de la masa (con los lados planos del bloque frente a las puntas del diamante) y tire de las solapas sobre la parte superior y pellizque para sellarlas.", "Ruede los pasteles lejos de usted en un rectángulo de 75x30 cm / 30x12 pulgadas. Mueva la masa con frecuencia para evitar que se pegue y trabaje rápidamente para evitar calentar la masa.", "Para hacer girar una letra, coloque la masa enrollada en la superficie con el lado corto más cercano a usted. Tire del tercio superior de la masa hacia abajo sobre el tercio medio y luego levante el tercio inferior sobre la parte doblada, al igual que una letra A4. Asegúrese de que los bordes coincidan y sean cuadrados. Quite el exceso de harina con un cepillo de pastelería. Coloque la masa en una bolsa de congelador y colóquela en el congelador por 10 minutos. Este es el primer turno. Tome nota de la cantidad de vueltas que se ha realizado en cada etapa.", "Repita el giro, doblando y girando cuatro veces más para dar cinco giros de letras en total. Divida la masa en dos porciones iguales y refrigere hasta que esté listo para usar.", "Precaliente el horno a 210C / 190C Fan / Gas 6½. Línea dos bandejas para hornear con papel de hornear.", "Para los giros herbales, mezcle las hierbas en un tazón pequeño con pan rallado, pimienta y ralladura de limón y revuelva para combinar.", "Ruede una pieza de la masa en una superficie ligeramente enharinada a aproximadamente 40x30cm / 16x12 pulgadas con el lado más corto más cercano a usted. Debe ser el grosor de una moneda de una libra. Cepille el huevo sobre la masa y luego espolvoree la mezcla de hierbas sobre la masa. Presione ligeramente el relleno en la masa con un rodillo.", "Gire con firmeza los dos tercios inferiores de la masa como si fuera un rollo suizo para que el relleno quede adentro. Para el último tercio, arrástralo debajo de sí mismo en la dirección opuesta para que el relleno quede en el exterior.", "Coloque el rollo en una bandeja para hornear, deslícelo en una bolsa grande para congelar y congele por 10 minutos.", "Use un cuchillo filoso para cortar los extremos irregulares y luego córtelos en rodajas de 1cm / ½ y colóquelos sobre una de las bandejas preparadas, dejando al menos 5 cm entre cada uno, ya que se esparcirán durante la cocción.", "Hornee durante 11 minutos, voltéelos y hornee por otros 11 minutos hasta que estén dorados e hinchados. Transfiera a un estante de enfriamiento.", "Para las palmeras de queso de pimientos y cabras, enrolle una pieza de hojaldre sobre una superficie ligeramente enharinada a aproximadamente 40x30 cm / 16x12 pulgadas con el lado corto hacia usted. Extienda el queso de cabra y los pimientos sobre la masa. Presione ligeramente el relleno en la masa con un rodillo ligeramente engrasado.", "Dobla la sexta parte inferior de la masa hacia arriba y presiona hacia abajo, luego repite este pliegue una vez más hacia arriba y deberías estar cerca del punto medio de la masa. Repita este doble pliegue para la parte superior de la masa que baja. Ligeramente cepille un huevo batido a lo largo de la parte superior de las porciones dobladas, luego dóblelas como un libro. Toda la cobertura debe estar en el interior.", "Coloque el rollo en una bandeja para hornear, deslícelo en una bolsa grande para congelar y congele por 10 minutos.", "Use un cuchillo afilado para cortar los extremos deshilachados, luego corte 1cm / ½ en rebanadas y déjelos planos en la bandeja preparada. Limpie el cuchillo con papel de cocina entre cada rebanada. Deje al menos 5 cm / 2 pulgadas entre cada uno, ya que se extenderán durante la cocción.", "Hornee durante 11 minutos, luego voltee y hornee por otros 11 minutos hasta que estén dorados y envanecidos. Transfiera a un estante de enfriamiento."], "url": "www_bbc_co_uk_food_recipes_herby_puff_twists_and_39016", "title": "Herby puff twists y pimienta y queso de cabra palmiers", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 25 de cada variedad", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_puff_twists_and_39016_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo deshuesadas y sin piel", "Skyr simple de 75 g / 2½ oz o yogur griego", "1 cucharada de aceite de oliva, más extra para cocinar", "puñado de perejil plano, picado", "1 cucharadita de jengibre molido", "¼ limón, solo jugo", "sal y pimienta negra recién molida", "250g / 9oz de patatas nuevas", "1 calabacín, rallado", "1 zanahoria grande, cortada en cintas con un pelador de verduras", "50g / 1¾oz skyr simple o yogur griego", "25ml / 1fl oz de aceite de oliva", "1 cucharadita de mostaza Dijon", "1-1½ cucharadita de vinagre de sidra", "½-1 cucharadita de miel líquida", "4 cucharadas de cebollines frescos finamente picados, más extra para decorar"], "method": ["Para hacer el pollo marinado, corte el centro de cada seno longitudinalmente, teniendo cuidado de no cortar completamente. Abra cada pecho como un libro y aplane con la palma de su mano.", "Ponga el skyr o yogur, aceite, perejil, jengibre, jugo de limón y un poco de sal y pimienta en un procesador de alimentos y mezcle hasta que quede suave.", "Coloque las pechugas de pollo en una bolsa de congelador y agregue el adobo, mezclándolo bien para cubrir el pollo. Sello y frío en la nevera.", "Mientras tanto, para hacer la ensalada, hierva las papas durante 15 minutos, o hasta que estén tiernas, y escurra. Cúbralo con agua fría y déjelo enfriar.", "Para preparar el aderezo, mezcle el skyr o yogur, el aceite, la mostaza, 1 cucharadita de vinagre y ½ cucharadita de miel, junto con una pizca de sal y pimienta. Si la mezcla es un poco espesa, agregue una cucharada de agua a la vez hasta alcanzar la consistencia deseada. Agregue el cebollín y ajuste el aderezo, o agregue un poco más de vinagre y / o miel si es necesario.", "Corte a la mitad las papas fritas y mezcle con un poco del aderezo en un recipiente, hasta que se cubra. Coloque el calabacín y la zanahoria en un tazón para servir y agregue las papas vestidas.", "Caliente una pizca de aceite en una sartén grande de base pesada a fuego medio-alto. Sacuda el adobo sobrante y cocine el pollo, abierto, durante 4 minutos a cada lado, o hasta que esté bien cocido. Reduce el calor si se dora demasiado.", "Cortar el pollo y colocar encima de la ensalada. Rocíe el resto del aderezo, adorne con más cebolletas picadas y sirva."], "url": "www_bbc_co_uk_food_recipes_herby_skyr_chicken_salad_90551", "title": "Ensalada de pollo y papa Herby", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_skyr_chicken_salad_90551_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 huevos grandes de corral", "2 cebollas de primavera, en rodajas finas", "2 cucharadas de cebollines picados", "2 cucharadas de perifollo picado", "20 g / oz de mantequilla", "4 rebanadas finas de salmón ahumado, cortado en tiras finas, o trozos de salmón ahumado de 125g / 4½oz", "100g / 3½oz de hojas de ensalada", "pimienta negra recién molida"], "method": ["Ponga los huevos, cebolletas y hierbas en un tazón, bata ligeramente y sazone con pimienta negra recién molida.", "Caliente una sartén de tamaño mediano a fuego medio-bajo, agregue un cuarto de la mantequilla y derrita hasta que comience a formar espuma. Vierta un cuarto de la mezcla de huevo y revuelva para cubrir la base de la sartén. Revuelva suavemente durante 2-3 minutos o hasta que esté casi listo.", "Espolvoree más de un cuarto de las tiras de salmón ahumado y cocínelas durante 30 segundos más, o hasta que estén listas. Doble y deslice hacia un plato de servir. Repita para hacer 3 tortillas más. Sirva cada tortilla con hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_herby_smoked_salmon_77028", "title": "Herby tortilla de salmón ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_smoked_salmon_77028_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de trigo bulgur, empapado en agua fría durante la noche", "3 cucharadas de menta picada", "3 cucharadas de cilantro picado", "2 cucharadas de perejil picado", "½ cebolla roja, finamente picada", "50 g / 1¾oz de pistachos, toscamente picados", "100 g / 3½ oz de frambuesas frescas", "100 g / 3½ oz de albaricoques secos, toscamente picados", "1 granada, solo semillas", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Escurra bien el trigo bulgur, presionando ligeramente para asegurar que se elimine todo el agua. Poner en un tazón grande.", "Agregue todos los otros ingredientes y mezcle bien. Sazonar, al gusto, con sal y pimienta y servir."], "url": "www_bbc_co_uk_food_recipes_herby_tabbouleh_16740", "title": "Herby tabbouleh", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, pelada, finamente picada", "2 dientes de ajo, pelados, finamente picados", "½ cucharadita de pimienta de cayena", "1 cucharadita de jengibre molido", "1 cucharadita de cilantro molido", "2 cucharaditas de comino molido", "1 ramita de canela", "1 cucharadita de cúrcuma molida", "1 calabaza, pelada, sin semillas, cortada en cubos de 1cm / ½ en cubitos", "200g / 7oz de tomates picados en lata", "200ml / 7fl oz de caldo de verduras", "3 limones preservados, solo corteza, más o menos picados", "1 cucharada de miel clara", "sal y pimienta negra recién molida", "400g / 14oz de cuscús", "600ml / 1 pinta 2fl oz de caldo de verduras calientes", "2 limones, solo cáscara", "100g / 3½oz de almendras copos tostadas", "1 cucharada de cada perejil fresco picado, cebolleta y cilantro", "1 cucharada de aceite de oliva", "pequeño cilantro puñado, para adornar"], "method": ["Para el tagine de calabaza, caliente una cucharada de aceite de oliva en una sartén a fuego medio. Agregue la cebolla y fría por 4-5 minutos. Agregue el ajo y fría por 3-4 minutos o hasta que se ablanden.", "Agregue la pimienta de cayena, jengibre molido, cilantro molido, comino molido, canela y cúrcuma molida y revuelva bien. Continúe cocinando durante 3-4 minutos, o hasta que las especias sean fragantes.", "Agregue los cubos de calabaza y mezcle bien para cubrir la calabaza en las especias.", "Agregue los tomates picados, el caldo, los limones y la miel en conserva, luego condimente, al gusto, con sal y pimienta negra recién molida. Deje que la mezcla hierva a fuego lento y cocine durante 10 minutos, o hasta que la calabaza esté tierna pero aún mantenga su forma.", "Mientras tanto, para el cuscús herby, coloque el cuscús en un tazón grande y vierta sobre el caldo de pollo caliente. Cubra el tazón con film transparente y déjelo a un lado hasta que el cuscús haya absorbido todo el caldo, aproximadamente tres minutos.", "Pelusa el cuscús con un tenedor, luego agregue la ralladura de limón, almendras en hojuelas, hierbas picadas y aceite de oliva hasta que estén bien combinados.", "Sirva el cuscús con tagine en la parte superior y un poco de cilantro picado para decorar."], "url": "www_bbc_co_uk_food_recipes_herbycouscouswithbut_92552", "title": "Tagine de calabaza con cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbycouscouswithbut_92552_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Papas de 150g / 5½oz, peladas y cortadas en cubos", "1 cucharada de aceite de oliva", "1 ramita de romero fresco", "pequeño puñado de perejil fresco de flatleaf", "pequeño cilantro fresco", "2 rebanadas de pan blanco", "1 cucharada de aceite de oliva", "Lomo de bacalao 150 g / 5½ oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las papas, ponga a hervir una olla de agua con sal, agregue las papas y cocine a fuego lento durante cinco minutos. Desagüe.", "Caliente el aceite de oliva en una sartén pequeña antiadherente y saltee las papas con el romero durante diez minutos o hasta que estén doradas y tiernas.", "Para los peces, coloque las hierbas y el pan en un pequeño procesador de alimentos y pulse para hacer migas de pan. Ruede el pescado en las migas para cubrir bien.", "Caliente el aceite de oliva en una sartén antiadherente pequeña y refrésquelo durante dos minutos en cada lado, o hasta que esté crujiente y dorado.", "Transfiera al horno durante 4-5 minutos o hasta que esté cocido.", "Sirva el pescado encima de las patatas salteadas."], "url": "www_bbc_co_uk_food_recipes_herbycrustedcodloinw_86860", "title": "Lomo de bacalao con costra de hierbas y papas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de vinagre de vino blanco", "50 g / 1 oz de azúcar en polvo", "1 cucharada de hojas de estragón fresco picado", "10 semillas de cilantro", "1 estrella de anís", "1 manojo de zanahorias de herencia amarilla", "100 g / 3½ oz de avena, tamizados", "50 g / 1¾oz de avellanas blanqueadas, más o menos picadas, más 4 avellanas, ralladas, para decorar", "1 cucharada de aceite de semilla de uva", "1 manojo de zanahorias de herencia naranja, hojas reservadas", "2 cucharadas de aceite de oliva", "1 cucharadita de sal", "1 cucharada de hojas de tomillo fresco picado", "100ml / 3½fl oz de jugo de zanahoria", "30g / 1oz de mantequilla", "60g / 2¼ oz de crema", "300g / 11oz de queso de cabra, mezclado con un poco de leche", "hojas de capuchina, para adornar"], "method": ["Para las zanahorias en vinagre, coloca el vinagre, el azúcar, el estragón, las semillas de cilantro y el anís estrellado en una olla mediana con 50 ml / 2 onzas de agua y calienta hasta que el azúcar se haya derretido.", "Calentar una olla grande de agua hirviendo y blanquear las zanahorias amarillas hasta que estén cocidas pero aún con un poco de crujiente. Coloque en agua helada, escurra y luego póngalos en la solución decapante.", "Para la avena y las avellanas, precaliente el horno a 150C / 300F / Gas 2.", "Extienda la avena y las avellanas picadas en una bandeja grande para hornear y rocíe sobre el aceite de semilla de uva. Asar durante 10-15 minutos, o hasta que estén dorados, luego dejar de lado.", "Aumente la temperatura del horno a 170C / 340F / Gas 3½.", "Coloque las zanahorias anaranjadas en una bandeja para hornear por separado, rocíe con el aceite y espolvoree sobre la sal y el tomillo. Asar por 20-25 minutos.", "Mientras tanto, calentar el jugo de zanahoria en una sartén hasta que se reduzca en volumen a una consistencia pegajosa.", "Caliente la mantequilla y la crema en una cacerola grande separada y bata continuamente. Redúzcalo en volumen y cocínelo hasta que tome un color marrón toffee. Agréguelo al jugo de zanahoria reducido.", "Escurra las zanahorias en vinagre del líquido decapante.", "Sirva la cuajada de cabra, las zanahorias en vinagre, las zanahorias asadas, la avena, las nueces, las hojas de zanahoria y las hojas de capuchina, aderezadas con jugo de zanahoria y adornadas con avellanas ralladas."], "url": "www_bbc_co_uk_food_recipes_heritage_carrots_goats_73817", "title": "Zanahorias de patrimonio, cuajada de cabra, avena y avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 ml / 7 fl oz de agua", "200ml / 7fl oz de aceite de oliva", "55ml / 2fl oz de vinagre de estragón", "1 ramita de tomillo", "1 hoja de laurel", "1 diente de ajo"], "method": ["Mezcle todos los ingredientes y déjelos en infusión a temperatura ambiente durante 1-2 días antes de usarlos."], "url": "www_bbc_co_uk_food_recipes_herbysaladdressing_67766", "title": "Aderezo para ensalada Herby", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace 400ml / 14fl oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Tomates Heritage de 1.2kg / 2lb 7oz (Marmande, Coeur de Boeuf, Darby Striped Yellow / Green y Russian Russian)", "1 cebolla Rose de Roscoff, cortada en rodajas de 3 mm", "20 hojas de albahaca, más o menos picadas", "3 cucharadas de cebollines finamente picados", "1 diente de ajo, picado", "2 cucharadas de vinagre de vino blanco", "6 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida", "1 cabeza Lechugas pecas, hojas recogidas", "1 cabeza de lechuga Seurat, hojas recogidas", "1 cabeza de lechuga Lollo Rosso, hojas recogidas", "1 cabeza Reine des Glaces lechuga, hojas recogidas", "1 cucharada de vinagre de vino blanco", "2 cucharadas de aceite de oliva virgen extra, más un poco más para terminar", "3 x 120 g / 4¼ oz de mozzarella de búfala", "50g / 1¾oz de aceitunas Kalamata, deshuesadas, secadas al horno durante 1 hora a 100C / 90C Fan / Gas ¼, finamente picadas"], "method": ["Para los tomates, con un cuchillo de cocina pequeño, cortar el núcleo duro de cada tomate, luego cortar cada uno en cuartos. Transfiera a un tazón grande. Sazonar con una pizca de sal y pimienta. Revuelva para que el condimento cure ligeramente los tomates, que luego producirán un jugo hermoso. Mezcle la cebolla, las hierbas, el ajo, el vinagre y el aceite. Revuelva y deje marinar durante un mínimo de 10 minutos para que los sabores se infundan.", "Para la ensalada, en el último momento, mezcle las hojas en un tazón grande. Sazone con una pizca de sal y pimienta, luego mezcle las hojas con el vinagre y el aceite de oliva.", "Arregle las hojas en un plato grande. Con una cuchara grande, levante la mezcla de tomate en la ensalada. Corta la mozzarella por la mitad y espárzala alrededor de la ensalada. Espolvoree sobre las aceitunas secas y termine con un chorrito de su mejor aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_heritage_tomato_and_03417", "title": "Ensalada Heritage de tomate y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de arroz, cocido", "2 cucharaditas de salsa de soja", "puñado de cilantro fresco, picado", "1 lima, jugo y ralladura"], "method": ["Mezcle todos los ingredientes y sirva."], "url": "www_bbc_co_uk_food_recipes_herbyrice_75769", "title": "Arroz Herby", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "sal y pimienta negra recién molida", "pequeño puñado de albahaca fresca, cilantro fresco, perejil fresco, picado", "Fideos de huevo frescos de 150g / 5½oz", "25g / 1oz de mantequilla", "dash aceite de oliva", "dash aceite de oliva", "¼ de cebolla, en rodajas", "1 diente de ajo, pelado y picado", "½ chile rojo fresco, finamente cortado", "1 cucharadita de vinagre de vino blanco", "3 cucharadas de salsa de soja", "2 cucharadas de frijoles edamame", "1 cucharada de anacardos picados"], "method": ["Para la tortilla, romper los huevos en un bol, sazonar con sal y pimienta negra recién molida y batir bien. Agregue las hierbas y los fideos de huevo.", "Caliente la mantequilla y el aceite en una sartén mediana, agregue la mezcla de huevo y fideos y cocínelos durante aproximadamente 3-4 minutos, o hasta que estén listos. Deslice sobre un plato y deje enfriar un poco antes de cortar.", "Para el aderezo, caliente el aceite en una cacerola pequeña, agregue la cebolla y saltee durante 3-4 minutos. Agregue el ajo y cocine durante 1-2 minutos más. Agregue el resto de los ingredientes y caliente durante 1-2 minutos.", "Para servir, coloque las rodajas de la tortilla en un plato para servir y rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_herbynoodletortillaw_87403", "title": "Herby fideos tortilla con salsa de maní y chiles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 g / 14oz de hojaldre con mantequilla y listo para usar", "harina común, para quitar el polvo", "1 yema de huevo de gallinas camperas, golpeada", "Gruyère 200g / 7oz, rallado", "400g / 14oz de tomates de herencia mixta, gruesos en rodajas", "4 ramitas de tomillo fresco, solo hojas", "1 cucharada de aceite de colza", "sal y pimienta negra recién molida", "300g / 10½oz de tomates de herencia", "1 cebolla roja, espesamente cortada", "2 cabezas de lechuga romana, sin raíces, cortadas en rodajas gruesas", "4 cucharadas de aceite vegetal", "1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "1 yema de huevo"], "method": ["Para la tarta de tomate, precaliente el horno a 210C / 190C Fan / Gas 7.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada para formar un cuadrado grande de aproximadamente 3 mm de grosor.", "Corta 4 x 17.5cm / 7 en círculos de la masa usando un tazón volteado o una lata de pastel. Transfiéralos a una bandeja para hornear.", "Con un cuchillo afilado, marque un borde de 1.5 cm / ½ pulgada alrededor del borde de cada círculo de repostería. Cepille cada borde con un poco de la yema de huevo.", "Apile una cuarta parte del Gruyère rallado en el centro de cada círculo de repostería. Coloque las rodajas de tomate en círculos concéntricos encima del queso. Sazonar, al gusto, con sal y pimienta negra recién molida, luego esparcir sobre las hojas de tomillo y rociar con un poco de aceite de colza.", "Hornee las tartas en el horno durante 12-15 minutos, o hasta que los bordes de la masa hayan subido, estén doradas y el relleno burbujee.", "Mientras tanto, para la ensalada de tomate, ponga los tomates, la cebolla roja y la lechuga en una bandeja para hornear y rocíe un poco del aceite vegetal. Mezcle bien para cubrir todo en el aceite.", "Coloque la bandeja de tostado sobre una superficie resistente al calor y, utilizando un soplete de chefs, hágalo hasta que esté caramelizado, esto debería demorar de 4 a 5 minutos. Alternativamente, precalentar la parrilla a su nivel más alto y grill las verduras durante 4-5 minutos.", "Agite el vinagre, la mostaza, la yema de huevo y el aceite vegetal restante en un tarro de mermeladas sellado y limpio hasta que estén bien combinados, luego sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque una tarta en cada plato de servir. Transfiera las verduras quemadas por soplado a un tazón grande y rocíe una cantidad suficiente del aderezo para cubrir las hojas. Mezcle la ensalada para cubrirla en el aderezo, luego sirva."], "url": "www_bbc_co_uk_food_recipes_heritage_tomato_tart_49741", "title": "Tarta de tomate Heritage con ensalada de tomate sopleteada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz pequeñas patatas nuevas", "50g / 2oz de col rizada, muy picado", "¼ de pepino, cortado por la mitad longitudinalmente, semillas recogidas con una cuchara, cortadas en rodajas gruesas", "1-2 cebollas de primavera, cortadas y cortadas", "1 cucharada de vinagre balsámico blanco", "2 cucharadas de aceite de colza prensado en frío", "exprimir jugo de limón", "sal y pimienta negra recién molida", "2 puñados de avena \"mediana\"", "sal y pimienta negra recién molida", "6 filetes de arenque, escamas y línea central de huesos retirados (pídale a su pescadero que haga esto por usted)", "dollop mostaza inglesa", "30 g / 1¼ oz de mantequilla", "salpicar aceite de colza", "cuñas de limón, para servir"], "method": ["Para la ensalada de papa, hierva las papas nuevas en una olla grande de agua con sal hasta que estén tiernas (aproximadamente 12 minutos). Agregue la col rizada y el pepino a la olla tres minutos antes de que las papas estén listas y hiérvalas hasta que todos los ingredientes estén tiernos. Escurrir bien y dejar reposar.", "Para el aderezo, mezcle el vinagre, el aceite de colza y el jugo de limón en una jarra hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Para el arenque, espolvoree la avena en un plato y sazone con sal y pimienta negra recién molida.", "Cepille ambos lados de cada filete de arenque con un poco de mostaza, luego enrolle la avena sazonada hasta que esté completamente cubierto.", "Caliente la mantequilla y el aceite en una sartén grande de base pesada a fuego medio. Agregue los filetes de arenque recubiertos a la sartén, con la cara hacia arriba (haga esto en tandas si es necesario). Presione suavemente hacia abajo sobre cada uno de los filetes de arenque con una rebanada de pescado para que se mantengan planos. Freír durante 1-2 minutos, o hasta que la avena esté dorada, luego darle la vuelta y continuar freír en el otro lado durante 1-2 minutos más, o hasta que los arenques estén cocidos y la avena esté dorada.", "Retire los filetes de arenque de la sartén con una espumadera y déjelos a un lado para escurrirlos sobre papel de cocina.", "Coloque las papas hervidas, la col rizada y el pepino en un tazón para servir, mezcle las cebolletas y vierta sobre el aderezo. Mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el arenque por igual entre dos platos para servir. Coloque la ensalada de papas al lado y sirva con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_herring_in_oats_with_84871", "title": "Arenque en avena con ensalada de papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "1 cucharadita de polvo de hornear", "100 g / 3½ oz de cacao en polvo", "Harina de auto crianza de 200g / 7oz", "8 cerezas, piedras eliminadas, más 4 cerezas extra para adornar", "100 g / 3½ oz de cacao en polvo", "150ml / ¼ pinta de agua", "2 cucharadas de azúcar en polvo", "2 cucharadas de crema doble"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase con mantequilla el interior de dos anillos de cocineros de 7,5 cm / 3 in y coloque en una bandeja para hornear forrada con papel antiadherente para babking.", "Coloque la mantequilla, el azúcar, el polvo de hornear, el cacao y la harina en un procesador de alimentos y mezcle hasta que estén completamente combinados.", "Agregue las ocho cerezas y mezcle bien con una cuchara de madera.", "Divida la mezcla entre los anillos de los dos chefs, luego transfiera al horno para hornear durante 10-12 minutos, o hasta que se haya levantado y cocinado completamente.", "Para la salsa, caliente el cacao en polvo, el agua y el azúcar en una sartén hasta que el azúcar se haya disuelto y la salsa esté brillante y suave.", "Para servir, transfiera los fondants a las placas de postre y quite los anillos.", "Vierta sobre la salsa de chocolate y rocíe una cucharada de crema sobre cada una y adorne con dos cerezas adicionales."], "url": "www_bbc_co_uk_food_recipes_hhh_87203", "title": "Fondants de chocolate caliente y cereza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz de agua", "2 limas, solo jugo", "100ml / 3½fl oz de vino blanco", "1 cucharadita de granos de pimienta blanca", "2 hojas de laurel", "1 cucharada de vinagre de vino blanco", "1 cucharadita de sal", "Filetes de arenque 4 x 100 g / 3½ oz", "250 g / 9 oz de patatas nuevas cocidas", "100ml / 3½fl oz de mayonesa", "1 cucharada de eneldo fresco picado", "1 cucharada de mostaza integral", "½ limón, solo jugo", "½ cucharadita de pasta de curry", "sal y pimienta negra recién molida", "algunas ramitas de eneldo fresco", "Rodajas de limón"], "method": ["Para el arenque, lleve el agua, el jugo de lima, el vino blanco, los granos de pimienta, las hojas de laurel, el vinagre de vino blanco y la sal a ebullición lenta en una sartén. Baje el fuego a fuego lento, agregue el pescado y cocine por unos 12 minutos, o hasta que esté cocido.", "Para la ensalada de papas, corte las papas cocidas a la mitad y colóquelas en un tazón grande.", "En otro tazón, combine la mayonesa, el eneldo, la mostaza, el jugo de limón, la pasta de curry, la sal y la pimienta negra recién molida. Agregue al tazón con las papas y revuelva para cubrir.", "Escurra el pescado, luego colóquelo encima de la ensalada de papas. Adorne con más eneldo y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_herringwithdillandmu_88218", "title": "Arenque con ensalada de eneldo y patata mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herringwithdillandmu_88218_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, finamente picada", "400 g / 14 oz de carne de cordero", "2 cucharadas de harina normal", "2 zanahorias (aproximadamente 100 g / 3½ oz cada una), peladas, finamente ralladas", "2 calabacines (aproximadamente 175 g / 6 oz cada uno), pelados, finamente rallados", "400g de tomates cortados en lata", "2 cucharadas de puré de tomate", "200ml / 7fl oz de agua recién hervida", "½ cucharadita de hierbas secas mezcladas", "1 cubo de caldo de cordero", "sal y pimienta negra recién molida", "800g / 1lb 12oz de patatas harinas, peladas, picadas en cubos", "50g / 2oz de mantequilla", "4 cucharadas de leche", "Queso Cheddar maduro de 100 g / 3½ oz, rallado grueso", "1 coliflor pequeña (aproximadamente 650 g / 1 libra 7 onzas), cortada, sin tallo, finamente rallada"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente una cacerola grande y antiadherente a fuego medio. Agregue la cebolla y la carne picada y fría por 8-10 minutos, revolviendo regularmente hasta que la carne se haya dorado.", "Espolvorea la harina sobre el cordero y revuelve bien. Agregue las zanahorias, los calabacines, los tomates, el puré de tomate, el agua y las hierbas y mezcle nuevamente para combinar. Desmenuce el cubo común, sazone con sal y pimienta.", "Llevar a ebullición, luego cocine a fuego lento durante 25-30 minutos, revolviendo regularmente, hasta que la salsa se haya espesado y las verduras se hayan desmenuzado casi por completo.", "Mientras tanto, trae una olla de agua a ebullición. Agregue las papas y cocínelas durante 15-20 minutos, o hasta que estén suaves pero no se caigan.", "Transfiera la mezcla de relleno a un plato de horno poco profundo de 2 litros / 3½ pinta y colóquelo en una bandeja para hornear.", "Escurra las papas y vuelva a la sartén. Agregue la mantequilla y el puré hasta que quede suave, luego bata en la leche hasta que quede esponjoso. Revuelva en la mitad del queso. Mezcle en la coliflor y sazone con sal y pimienta. Agregue un poco de leche extra si es necesario.", "Vierta el puré sobre el cordero y extiéndalo uniformemente. Espolvorea sobre el queso restante. Hornee durante 25-30 minutos, o hasta que el queso se haya derretido y se haya dorado y el relleno esté burbujeante."], "url": "www_bbc_co_uk_food_recipes_hidden_vegetables_05418", "title": "Pastel de pastor de verduras escondidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 5-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hidden_vegetables_05418_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 300 g / 10½oz solomillo o solomillo", "sal y pimienta negra recién molida", "25 ml / 1 fl oz aceite de colza", "1 chile rojo, finamente picado", "1 cucharada de azúcar de palma", "2 dientes de ajo, en rodajas", "2 cucharadas de cilantro fresco, más extra para la ensalada", "2 cucharadas de menta fresca", "1 cucharadita de salsa de pescado", "1 cucharada de salsa de soja", "1 lima, jugo y ralladura", "1 lechuga redonda", "50g / 1¾oz de guisantes azucarados, cortados a la mitad", "6 rábanos, en rodajas"], "method": ["Precalentar una barbacoa o una sartén a fuego lento.", "Sazone el bistec con mucha pimienta negra, rocíe con aceite y colóquelo en una parrilla caliente o en una sartén de plancha durante cinco minutos, girando a la mitad.", "Para hacer el aderezo, ponga el chile, el azúcar de palma, el ajo y una cucharadita de sal en un mortero. Moler durante 1-2 minutos, luego agregar el cilantro y la menta y moler por otro minuto. Mezcle la salsa de pescado, la salsa de soja, el jugo de limón y la ralladura.", "Cortar la lechuga en seis cuñas y colocar en un tazón. Cubra con los guisantes, los rábanos y algunas hojas de cilantro. Vierta el aderezo sobre la ensalada y revuelva para cubrir. Corta la carne y ponla encima de la ensalada."], "url": "www_bbc_co_uk_food_recipes_highland_beef_salad_45037", "title": "Ensalada de carne de montaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/highland_beef_salad_45037_16x9.jpg", "isVegetarian": false, "recommendations": 0}]