[{"isVegetarian": false, "title": "Arnold Bennett omelette", "url": "www_bbc_co_uk_food_recipes_arnoldbennettishomel_93629", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz undyed smoked haddock fillet, skin on, pin boned ", "100ml/3½fl oz milk ", "knob of butter", "2 fresh bay leaves ", "8-10 black peppercorns ", "2 tbsp crème fraîche", "1 lemon, zest only", "55g/2oz parmesan, finely grated ", "small bunch fresh chives, finely chopped", "sea salt and freshly ground black pepper ", "3 large free-range eggs, beaten ", "knob unsalted butter ", "2 tbsp extra virgin olive oil ", "small handful fresh watercress", "1 tbsp lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the haddock fillet into an ovenproof dish, pour over the milk and add the butter, bay leaves and peppercorns.", "Transfer to the oven and poach for 10-12 minutes, then remove from the oven and set aside to cool slightly.", "Meanwhile, mix the crème fraîche with the lemon zest, grated parmesan and most of the chives. Season, to taste, with salt and freshly ground black  pepper.  ", "Heat the butter with half of the oil in a large ovenproof frying pan over a medium heat, and pour in the eggs, stirring slightly as they cook to loosen  them from the sides of the pan. ", "Flake the haddock from the skin while the eggs are cooking, taking care to remove any remaining bones.", "When the eggs are still slightly runny on top but have started to set, spread over the crème fraîche mixture, then scatter over the haddock and transfer the omelette to the oven for 4-5 minutes, or until cooked through and slightly risen. Remove from the oven.", "To serve, drizzle the remaining oil over the watercress in a small bowl and add the lemon juice, turning to coat the leaves. Slide the omelette onto a serving plate, sprinkle over the remaing chives and arrange the dressed watercress on the side."]}, {"isVegetarian": false, "title": "Aromatic beef curry", "url": "www_bbc_co_uk_food_recipes_aromatic_beef_curry_90850", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_90850_16x9.jpg", "ingredients": ["125ml/4fl oz ghee or vegetable oil", "400g/14oz beef braising steak, diced into 3cm chunks", "1 medium onion, diced", "2 garlic cloves, finely chopped", "1 tsp ground cumin", "1 tsp ground coriander", "1 tsp ground turmeric", "1 tsp ground black pepper", "1 tsp chilli powder", "½ tsp ground ginger", "3 cloves", "3 cardamom pods (optional)", "½ tsp ground cinnamon", "½ x 400g/14oz can chopped tomatoes", "125g/4½oz natural yoghurt", "1 tbsp vinegar", "salt", "pinch sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a lidded frying pan over a medium heat and add the ghee or oil. Fry the meat until lightly browned on all sides, then remove from the pan with a slotted spoon, cover and set aside.", "Add the onion and garlic to the pan and fry over a low heat until soft. Turn the heat up slightly, add the spices and fry for 1 minute, they should start to smell aromatic, without burning.", "Return the beef to the pan, add the tomatoes and bring to the boil. Take the pan off the heat and stir in the yoghurt and vinegar, then season to taste with the salt and the sugar. ", "Return the pan to the heat, bring back to the boil and simmer, covered, for 1½ hours, or until the meat is tender."]}, {"isVegetarian": false, "title": "Aromatic Thai green chicken and autumn vegetable curry", "url": "www_bbc_co_uk_food_recipes_aromatic_thai_green_31771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, finely chopped ", "1 garlic clove, finely chopped", "2cm/1in piece fresh ginger, finely chopped", "8 chicken thighs, skin removed, boned and cut into 3cm/1¼in chunks", "100g/3½oz Thai green curry paste", "½ butternut squash, peeled, seeds removed and cut into 3cm/1¼in chunks", "1 large sweet potato, peeled and cut into 3cm/1¼in chunks", "1 small aubergine, end removed and cut into 3cm/1¼in chunks", "1 courgette cut into 3cm/1¼in chunks", "200ml/7fl oz coconut milk", "200ml/7fl oz chicken stock", "100ml/3½fl oz double cream", "100g/3½oz fine green beans cut into 2cm/1in lengths", "400g/14oz basmati rice", "400g/14oz plain flour", "2 tsp sea salt", "2 tbsp olive oil, plus extra for frying", "splash of warm water to bind mix", "2 tbsp roughly chopped fresh coriander", "4 spring onions, root removed and finely sliced"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan and, once hot, add the oil and then the onion, garlic and ginger. Cook for four minutes, then add the chicken thighs and cook for a further 3-4 minutes. Stir in the Thai curry paste and cook for a further 3-4 minutes.", "Add the squash, sweet potato, aubergine and courgette. Stir, then add the coconut milk and chicken stock. ", "Cook for 15 minutes, then add the cream and beans. Cook for further 10 minutes.", "Meanwhile, put the rice in a large saucepan and cook to packet instructions.", "For the flatbread, place the flour, salt and oil in a large bowl and add enough water to bring it together to form a dough. Knead until smooth then divide into four balls.", "Flour a work surface and roll out each ball into a large circle.", "Heat a griddle or frying pan and add the oil. One at a time, place each flatbread into the pan and cook on both sides for a few minutes.", "To serve, place the rice on serving plates topped with the curry. Place the bread on the side and garnish with fresh coriander and spring onions."]}, {"isVegetarian": true, "title": "Aromatic blackeye bean curry", "url": "www_bbc_co_uk_food_recipes_aromaticblackeyebean_73019", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromaticblackeyebean_73019_16x9.jpg", "ingredients": ["2 x 410g/14oz tins of black eyed beans (or use 225g/8oz dried beans, soaked overnight and cooked)", "1 tbsp cumin seeds", "1 tbsp coriander seeds", "1 tsp fennel seeds", "¼ tsp fenugreek seeds", "1cm/½in stick cinnamon", "½ - 2 tsp crushed chilli flakes", "4 tbsp vegetable oil", "1 tsp black mustard seeds", "10 curry leaves (fresh or dried)", "1 medium onion, finely chopped", "2 garlic cloves, crushed", "5cm/2in piece fresh ginger, grated", "salt to taste", "550ml/1pint water", "2 tbsp coriander leaves", "2 tbsp fresh coconut, grated (optional, but do not use desiccated)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Drain and rinse the beans, and mash a few lightly with fork.", "Put the cumin, coriander, fennel and fenugreek seeds with the cinnamon stick into a small heavy-based frying pan. Roast on a medium heat, stirring frequently until the spices change colour and become aromatic, taking care not to burn them.", "Grind the roasted spices into a fine powder in a coffee grinder, and add crushed chilli flakes.", "Heat the oil over medium heat. When hot, add the mustard seeds and curry leaves. Remove the pan immediately from heat, cover, and let the seeds and leaves crackle and pop.", "Put the pan back on heat, add the onion and cook until light golden. Add the ginger and garlic, and cook for a further 30 seconds.", "Add the beans, ground spice mixture, salt, and water, and bring to the boil.", "Turn the heat to low, cover and simmer for 20 minutes. ", "Top with coriander leaves and fresh coconut, if using, and serve with rice or flatbreads."]}, {"isVegetarian": true, "title": "Aromatic couscous", "url": "www_bbc_co_uk_food_recipes_aromaticcouscous_86271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 courgette, sliced lengthways", "½ red pepper, cut into strips", "olive oil, for drizzling", "200g/7oz couscous, cooked according to packet instructions", "1 orange, juice and zest", "1 lemon, juice and zest", "small handful fresh mixed herbs such as parsley, mint, basil and coriander, chopped", "2 tbsp black olives, stones removed", "2 tbsp pine nuts", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the courgette and red pepper slices with olive oil. Heat a griddle pan and griddle the courgette and pepper pieces for 2-3 minutes, turning frequently, until softened and lightly charred all over. Remove from the heat and chop up into small pieces.", "Place the couscous into a large bowl. Add the courgette and pepper pieces and all the remaining ingredients and mix well.", "To serve, place into a serving dish."]}, {"isVegetarian": false, "title": "Aromatic salmon cooked in coconut milk", "url": "www_bbc_co_uk_food_recipes_aromaticsalmoncooked_1608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 thick salmon steaks", "2.5cm/1in piece root ginger, peeled and cut into small, very thin slices", "2 large cloves garlic, peeled and cut into small, very thin slices", "350g/12oz tomatoes, peeled and halved", "1 fresh red chilli, de-seeded and sliced as finely as possible", "1 small yellow pepper, de-seeded and thinly sliced", "4-6 cardamom pods, roughly crushed", "400ml/14fl oz tinned coconut milk", "sea salt", "2 limes, juice only", "handful of fresh mint leaves, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the fish steaks in a fairly shallow ovenproof dish with a lid, into which they fit quite closely.  ", "Scatter the ginger, garlic, tomato, chilli and yellow pepper over and around the fish and the cardamom pods in between.  ", "Empty the coconut milk into a separate bowl, add a good sprinkling of sea salt and gradually stir in the lime juice.  Pour the mixture gently over and around the fish and cover the dish.", "Preheat the oven to 150C/300F/Gas 2.  Put the dish on the centre shelf and cook for 40-50 minutes, until the fish is lightly done. To discover this insert a small, sharp knife into the centre of one of the steaks - if the flesh is slightly darker pink in the centre it will be perfectly cooked.  Remove from the oven.  ", "Before serving scatter the mint leaves on top."]}, {"isVegetarian": true, "title": "A return to the Black Forest", "url": "www_bbc_co_uk_food_recipes_areturntotheblackfor_67199", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dark chocolate (75 per cent cocoa solids) ", "2 large eggs, separated", "1 jar pitted morello cherries ", "2 tbsp cherry brandy ", "225ml/8fl oz  double cream ", "6 large eggs, separated ", "150g/5oz caster sugar ", "50g/2oz cocoa powder, sifted ", "100g/3½oz dark chocolate (75 % cocoa solids) ", "1 level tbsp morello cherry jam ", "a little cocoa powder "], "serves": "Serves 10-12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "Break the chocolate into a basin and add 2 tbsp of water. Place the basin over a saucepan of barely simmering water, making sure the basin isn't touching the water. Remove the pan from the heat and wait for the chocolate to melt before beating it with a wooden spoon until smooth.", "Next beat the 2 egg yolks, first on their own and then into the warm chocolate mixture. As soon as the mixture has cooled, whisk the egg whites to the soft-peak stage then gently fold them into the chocolate mixture. Cover the bowl with clingfilm and leave it in the fridge for a minimum of an hour.", "Drain the cherries, discard the syrup, then place them in a shallow dish, spoon over the cherry brandy and leave aside till needed.", "To make the base: first place the egg yolks in a bowl and whisk them with an electric hand whisk until they begin to thicken. Then add the caster sugar and continue to whisk, but be careful not to overdo this, stop when it falls off the whisk in ribbons. Now fold in the sifted cocoa powder. Then, using a clean bowl and beaters, whisk the egg whites to the soft-peak stage. Then take 1 large spoonful, fold it into the chocolatey mixture to slacken it, and gently fold in the rest of the egg whites.", "Now pour the mixture into the prepared tin and bake the cake on the middle of the oven for about 20 minutes or until it's springy in the centre. It will look very puffy, but a little finger gently pressed into the centre should reveal that it is cooked. It's important not to overcook it, otherwise it will be difficult to roll.", "Remove it from the oven and leave it until it's absolutely cold, then turn it out on a sheet of greaseproof paper, which has been lightly dusted with sieved cocoa powder. Then carefully peel away the silicone paper.", "Drain the cherries again in a sieve placed over a bowl to catch the brandy and sprinkle all but 1 tbsp of the liqueur all over the base. Next remove the chocolate filling from the fridge and spread it carefully over the surface of the base. Next whip the double cream softly, and spread this over the chocolate filling, leaving a 2.5cm/1in border all round, then press the cherries into the cream.", "Take hold of one edge of the greaseproof paper beneath the cake, lift it and, as you lift, it will begin to come up. Just gently roll it over, pulling the paper away as it rolls. ", "Melt the chocolate as before, taking great care not to overheat it, then pour it on to an upturned plate 15cm/6in in diameter. Then place in the fridge for about 45 minutes until it's set. The chocolate should be firm when you touch it. ", "To make the curls use a cheese slicer, or a very sharp knife. Start at one end and just pull the slicer or knife along the surface of the chocolate towards you until curls form. Place them in a plastic container. Put the container in the fridge.", "Now you can decorate the cake: spoon the jam into a small saucepan, add the reserved liqueur, warm gently and then brush over the surface. Place the chocolate curls all over. Finally dust the surface lightly with cocoa powder."]}, {"isVegetarian": false, "title": "Aromatic pork belly hotpot", "url": "www_bbc_co_uk_food_recipes_aromaticporkbellyhot_10468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz belly pork, with rind still on", "570ml/1 pint pork or chicken stock (if available, otherwise water)", "12 spring onions", "100ml/3½fl oz light soy sauce", "75ml/2½fl oz Chinese rice wine", "25ml/1fl oz rice wine vinegar", "2 tbsp demerera (or light brown) sugar", "3 star anise", "10cm/4in piece of fresh ginger root, peeled and sliced in rounds", "a good pinch of dried chilli flakes"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pork belly in large rectangular chunks (2.5x5cm/1x2in), put in a large pan, pour over enough boiling water just to cover, then bring back to the boil. Simmer gently for about 5 minutes, skimming off the scum that rises to the surface, then drain through a colander. ", "Rinse out the pan if necessary, return the pork to it and pour over enough boiling hot stock (if available) or water to cover it again. ", "Cut 5 of the spring onions in half and add to the pan with the soy sauce, rice wine, vinegar, sugar, star anise, ginger and chilli flakes. Cover tightly and simmer very slowly for about 2 hours, turning the meat occasionally, until the pork is very tender, soft and succulent.", "Remove the pork with a slotted spoon and set aside. Strain the cooking liquid, ideally through muslin or a fine chinois, into a clean pan. Skim off as much fat as you can (but dont worry about leaving a little), then boil the stock hard to reduce and concentrate the flavours. It should be lightly syrupy and intensely aromatic, but don't over reduce as the soy sauce may make it very salty.", "Thinly slice the remaining spring onions on the diagonal. Return the pork to the sauce and heat through.", "Serve over plain noodles in a warmed soup bowl, with plenty of the sauce ladled over, and the sliced spring onions scattered over the meat."]}, {"isVegetarian": false, "title": "Arrabiata pork meatball spaghetti", "url": "www_bbc_co_uk_food_recipes_arrabiataporkmeatbal_90149", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 400g/14oz cans tomatoes", "3 tbsp extra virgin olive oil", "2 garlic cloves, finely chopped", "1 tsp dried chilli flakes", "4 tbsp roughly chopped fresh basil", "salt and freshly ground black pepper", "1 tsp caster sugar", "500g/1lb 2oz pork mince", "90g/3oz streaky bacon, finely chopped", "2 tsp thyme leaves", "2 tbsp flatleaf parsley, roughly chopped", "300g/10½oz dried spaghetti"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot, then add the tomatoes and olive oil and bring to a gentle simmer.", "Add the garlic, chilli and half of the basil and cook for 10 minutes, until reduced and thickened. Season, to taste, with salt, freshly ground black pepper and a little sugar.", "Place the pork mince, bacon, thyme and parsley into a bowl and mix thoroughly. Season with a little salt and plenty of freshly ground black pepper.", "Divide the mixture into 16 and shape each portion into a small ball, using your hands.", "Place the meatballs into the tomato sauce and simmer for 5-8 minutes, or until the meatballs are completely cooked through.", "Meanwhile, bring a large pan of salted water to the boil. Add the spaghetti and cook according to packet instructions.", "Drain the spaghetti, then add to the tomato and meatball sauce. Season, to taste, with salt and freshly ground black pepper and add the remaining basil.", "To serve, spoon equal portions of the spaghetti and meatballs into warmed bowls."]}, {"isVegetarian": false, "title": "Arroz verde", "url": "www_bbc_co_uk_food_recipes_arroz_verde_49624", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arroz_verde_49624_16x9.jpg", "ingredients": ["1kg/2lb 4oz fish bones, such as lemon sole, brill and plaice", "1 onion, roughly chopped", "1 fennel bulb, roughly chopped", "100g/3½oz celery, sliced", "100g/3½oz carrot, roughly chopped", "25g/1oz button mushrooms, sliced", "1 sprig fresh thyme", "4 tbsp olive oil", "60g/2¼oz shallots, finely chopped", "12 garlic cloves, finely chopped", "1 litre/1¾ pints fish stock (see above)", "100g/3½oz finely chopped flatleaf parsley ", "1½ tsp salt", "400g/14oz short-grain paella rice, such as calasparra", "30 raw clams, preferably palourdes (vongole), scrubbed", "200g/7oz raw small prawns, peeled", "4 garlic cloves, crushed", "½ tsp fine table salt", "1 medium free-range egg yolk", "175ml/6fl oz extra virgin olive oil"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish stock, put all the ingredients and 2½ litres/4½ pints water in a large pan and simmer gently for 30 minutes. Strain through a fine or muslin-lined sieve. If not using immediately, leave to cool, then refrigerate or freeze.", "For the arroz verde, heat the oil in a 28–30cm/11–12in shallow flameproof casserole over medium heat. Add the shallots and fry for 5 minutes, or until soft. Add the garlic and fry for 40–60 seconds, then stir in the fish stock, parsley and salt and bring to the boil.", "Sprinkle in the rice, stir once, then leave to simmer vigorously over medium–high heat for 6 minutes. Put the clams and prawns on top and shake the pan briefly so they sink into the rice a little. Lower the heat and simmer gently for 12 minutes. Almost all the liquid should be absorbed and the rice should be pitted with small holes. Discard any clams that do not open after cooking.", "Meanwhile, for the aioli, mix the garlic and salt together to form a paste. Put in a food processor and add the yolk. Turn on the machine and very slowly trickle the oil through the hole in the lid until you have a thick emulsion. ", "Serve the arroz verde with the aioli. "]}, {"isVegetarian": false, "title": "Artichoke à la Parisienne with bordelaise sauce", "url": "www_bbc_co_uk_food_recipes_artichoke__la_parisienne_80499", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 banana shallots", "50ml/2fl oz olive oil, plus extra for drizzling", "10g/¼oz thyme ", "100g/3½oz butter ", "1 bottle red wine, preferably Merlot", "500ml/18fl oz veal stock ", "10 baby artichokes ", "1 lemon, juice only", "6 slices prosciutto cotto ", "2 burrata ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, thinly slice 6 of the shallots. Heat the oil in a heavy-bottomed pan. Sweat the shallots and half the thyme with a pinch of salt and butter until translucent. ", "Add the wine and reduce until a syrup consistency then add in the veal stock and season. Pass through a fine sieve and reduce to a sauce consistency. ", "Meanwhile, peel off the dry outer leaves of the artichokes and discard. Cut off the top and peel into the heart with a small paring knife. Mix the lemon juice with cold water and keep the peeled artichokes in the water to keep their colour.  ", "Dice the ham and remaining shallots. Drain the artichokes. Use a mandolin to thinly slice the artichokes lengthways. Sweat the ham and shallots in the remaining butter and add the sliced artichokes (keep a few slices for garnish).", "Slice the burrata in half and season with olive oil, salt and a twist of black pepper. ", "Spoon the cooked artichoke over the burrata and finish with the sauce. Dress a few slices of raw artichokes with olive oil and garnish on top. "]}, {"isVegetarian": true, "title": "Artichoke and broad bean risotto", "url": "www_bbc_co_uk_food_recipes_artichoke_and_broad_bean_49121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 baby purple artichokes", "1 lemon, cut in half, one half left intact, one half zested and juiced", "200ml/7fl oz extra virgin olive  oil", "25g/1oz butter", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "3 sprigs fresh thyme, leaves only", "100g/3½oz risotto rice", "200ml/7fl oz white wine", "750ml/1¼ pints chicken or vegetable stock, warmed", "150g/5oz broad beans, skins and inner membranes removed", "4 heaped tbsp freshly grated parmesan (or vegetarian alternative), plus extra to serve", "2 tbsp finely chopped fresh chives", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "1 chive flower, leaves separated, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the stalks from one artichoke, then cut the top one-third from the bulb and discard. Immediately rub the artichoke all over with the intact half of the cut lemon to stop it from browning. Repeat the process with the remaining artichokes.", "Bring 200ml/7fl oz of water and all of the olive oil to the boil in a lidded saucepan. Reduce the heat until the mixture is simmering.", "Cut the artichokes in half lengthways and add them to the pan. Cover the pan with the lid and simmer for 10-15 minutes, or until the artichokes are tender (when you pierce them with the tip of a knife there should be no resistance).", "Remove the artichokes from the pan using a slotted spoon and set aside to cool slightly, then cut in half again lengthways.", "Meanwhile, heat the butter in a frying pan over a medium heat. When the butter is foaming, add the shallots, garlic and thyme and fry for 1-2 minutes, or until softened but not coloured. ", "Add the rice and stir well to coat it in the butter. Cook for a couple of minutes, then pour in the white wine and bring the mixture to the boil. Reduce the heat until the mixture is just simmering.", "Add a couple of ladlefuls of stock to the pan at a time and return the mixture to a simmer each time, stirring occasionally, until the rice has absorbed all the stock. Continue adding stock and letting the rice absorb it for 5-6 minutes, then stir in the broad beans and continue to add ladles of stock until the stock has been absorbed by the rice, the mixture is loose and the rice is tender; this should take 12-15 minutes.", "When the rice is cooked through, add the artichokes, parmesan, chives, lemon zest and juice, and cream. Season, to taste, with salt and freshly ground black pepper. ", "Serve the risotto with extra parmesan grated over the top, and garnished with the chive flower leaves, if using."]}, {"isVegetarian": true, "title": "Artichoke and lemon dip", "url": "www_bbc_co_uk_food_recipes_artichoke_and_lemon_dip_66140", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz Parmesan (or a similar vegetarian hard cheese), broken into chunks", "1 large garlic clove, roughly chopped", "175g/6oz grilled artichoke hearts, drained weight, roughly chopped ", "1 small preserved lemon, pulp and pips removed, chopped", "small handful of parsley leaves, roughly chopped, plus extra for garnish", "100ml/3½fl oz extra virgin olive oil ", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the Parmesan and garlic in the bowl of a food processor and pulse until the consistency of coarse breadcrumbs. Add the drained artichokes, preserved lemon and parsley and whizz again.", "Gradually add the olive oil in a steady stream until the mixture reaches a dippable consistency (you might not need all the oil). Season to taste with lemon juice, salt and freshly ground black pepper. Spoon into a bowl and sprinkle with extra parsley. "]}, {"isVegetarian": true, "title": "Artichoke, broad bean and pea risotto", "url": "www_bbc_co_uk_food_recipes_artichoke_broad_bean_and_32691", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, juice only or 1 tbsp white wine vinegar", "3 globe artichokes", "1.2 litres/2 pints vegetable stock", "40g/1½oz butter", "3 tbsp olive oil", "1 onion, chopped", "1 garlic clove, chopped or grated", "300g/10½oz Arborio or carnaroli rice", "125ml/4fl oz dry white wine", "200g/7oz fresh broad beans, double podded if not young (600–700g/1lb 5oz–1lb 9oz weight in pods)", "200g/7oz fresh peas, podded (about 600g/1lb 5oz weight in pods)", "½ small unwaxed lemon, juice and grated zest only", "½–1 tsp salt", "8 turns black peppermill", "70g/2½oz freshly grated pecorino (or other vegetarian hard cheese)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["First prepare the globe artichokes. Put the lemon juice or vinegar in a bowl of cold water. Remove the stem of the artichoke to within 1cm/½in of the base. Peel off the outer leaves until you reach the pale coloured centre. Cut the body of the artichoke in half horizontally. Remove the hairy choke with a teaspoon. Pare off any remaining outer leaves with a sharp knife. Cut into six wedges and put them into the lemon water to stop them going brown. ", "Heat the stock in a saucepan. ", "Melt the half the butter with the olive oil in a wide pan over medium-low heat and sweat the onion and garlic for 5–10 minutes until soft. ", "Add the rice and stir well to coat the grains. Add the white wine and stir until it has been absorbed by the rice. Start adding the vegetable stock a ladleful at a time, stirring until it is absorbed, which will take about 20 minutes. The rice should be cooked through but retain bite (you may not need all of the stock).", "After about 12 minutes, bring a pot of water to the boil, add the artichoke and cook for 5–7 minutes until tender. Remove and set aside. Add the broad beans and peas and boil for about 3 minutes, then drain. Add all the vegetables to the risotto and heat through.", "Remove from the heat and stir through the lemon zest, juice and remaining butter. Season with salt, pepper and half the pecorino. Serve immediately with the remaining pecorino."]}, {"isVegetarian": false, "title": "Artichoke hearts filled with salt cod", "url": "www_bbc_co_uk_food_recipes_artichoke_hearts_filled_77022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz salt cod", "1 large baking potato", "2 globe artichokes, outer leaves removed", "1 tsp lemon juice", "500ml/18fl oz milk", "1 garlic clove, thinly sliced", "1 bay leaf", "1 thyme sprig", "50ml/2fl oz olive oil", "4 tbsp fresh breadcrumbs", "salt and freshly ground black pepper", "1 castelfranco lettuce, leaves separated", "½ lemon, juice only", "3 tbsp olive oil "], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the cod in a large container and cover with cold water. Leave to soak at room temperature for 24 hours, changing the water at least four times.", "Preheat the oven to 180C/200C Fan/Gas 4. Place the potato on a baking tray, wrapped in kitchen foil, and bake for 1¼ –1½ hours, or until cooked through. Keep the oven on. Once the potato is cooled, remove the flesh and pass it through a ricer. Set aside. ", "Meanwhile, bring a saucepan of salted water to the boil and add the artichokes and lemon juice. Cook for 25–30 minutes, or until the outer leaves are easily detached. Leave to cool then cut in half and remove some of the central leaves. ", "Place the salt cod in a shallow dish and add the milk, garlic, bay leaf and thyme. Leave to poach for 10 minutes, then remove and flake the fish into a small bowl and reserve the milk. ", "Stir in the potato, oil and some of the reserved milk. Season with salt and pepper and spoon the mixture into the artichoke. Sprinkle the breadcrumbs over the top and bake in the oven for 10–15 minutes, or until golden. ", "Whisk the lemon juice, oil and salt and pepper in a small bowl. Put the leaves in a large bowl and dress with the dressing. ", "Serve the baked artichokes on a serving plate with the dressed leaves scattered around the edge."]}, {"isVegetarian": false, "title": "Artichoke with smoked bacon mayonnaise", "url": "www_bbc_co_uk_food_recipes_artichoke_with_smoked_62303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 globe artichokes", "2 lemons, halved", "pinch salt", "100g/3½oz plain flour", "8 rashers smoked streaky bacon, roughly chopped", "2 free-range egg yolks", "1 tsp Dijon mustard", "400ml/14fl oz rapeseed oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the artichokes, remove the tough outer leaves from the artichokes and cut off the stalks and the top. Using a sharp knife, trim off any green, tough parts, discarding everything except the tender leaves and stem. Rub each artichoke with the cut side of one of the lemon halves to stop the flesh from discolouring. Set aside in a bowl of water. Repeat the process with the remaining artichokes.", "Squeeze the juice from the lemons into a large saucepan. Add a pinch of salt, the flour and the artichokes. Fill the pan with enough cold water to cover the artichokes. ", "Bring the water to the boil, then reduce the heat until the water is simmering and continue to simmer for 15 minutes, or until the artichokes are tender when pierced with a sharp knife. The flour will rise to the surface of the water to create a crust - this will prevent the artichokes from discolouring during cooking. ", "Meanwhile, for the mayonnaise, fry the bacon in a frying pan over a high heat until the fat has melted and the meat is crisp. Set the pan aside to cool.", "Blend the egg yolks and mustard in a food processor until pale and creamy. With the motor still running, gradually add the rapeseed oil in a thin stream, until the mixture thickens to a mayonnaise (you may not need to add all of the oil).", "Gradually add the melted fat from the bacon pan to the mayonnaise, drop by drop. Add the fried bacon and pulse the food processor until it has been incorporated into the mayonnaise. Season the mayonnaise with salt and freshly ground black pepper.", "When the artichokes have cooked, remove them from the pan and drain on kitchen paper.", "Serve the artichokes with a dollop of the mayonnaise."]}, {"isVegetarian": false, "title": "Artichoke and three cheese pizza", "url": "www_bbc_co_uk_food_recipes_artichokeandthreeche_89363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "½ tsp salt", "1 tsp caster sugar", "7g dried yeast (or 4g fresh yeast)", "300ml/11fl oz water", "oil, for greasing", "2 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "2 x 400g/14oz cans chopped tomatoes", "2 tsp caster sugar", "1 bunch fresh basil, leaves chopped", "12 violet baby artichokes, peeled, trimmed and finely sliced", "350g/12oz buffalo mozzarella, thickly sliced", "1 chunk parmesan", "4 x 115g/4oz Little Wallop, or similar hard goats' cheeses, skinned and cut into chunks", "12 slices Parma ham", "1 bunch fresh basil, leaves only"], "serves": "Makes 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, place the flour, salt and sugar into a large bowl and stir to combine.", "Crumble the yeast into a small bowl and add four tablespoons of the water. Whisk to combine and set aside for one minute.", "Pour the yeast mixture into the centre of the flour mixture, and add the remaining the water. Mix well to form a soft dough.", "Tip the dough out onto a floured work surface and knead until smooth and elastic.", "Place the dough into a lightly greased bowl, cover with cling film and leave to rise for one hour.", "Remove the dough from the bowl and knead for a minute on a floured work surface, then divide into four pieces and roll into circles, 0.5cm/¼in thick.", "For the topping, heat a frying pan until hot, then add the oil, onions and garlic and fry for 3-4 minutes.", "Add the tomatoes, sugar and the chopped basil and bring to the boil. Reduce the heat and simmer for 20 minutes, until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper and leave to cool.", "Preheat the oven to 220C/425F/Gas 7. Place a heavy baking tray or a pizza stone into the oven to preheat.", "Place the pizza bases onto an upturned, floured baking tray. Spoon the cooled tomato sauce thinly over the pizza.", "Sprinkle over the artichokes, mozzarella, parmesan, goats' cheese and Parma ham and season with salt and freshly ground black pepper.", "Carefully transfer the pizzas into the oven, pushing the pizzas from the floured tray onto the hot tray pizza stone. Cook for 15 minutes, or until the base is crisp and the topping is cooked through.", "Remove from the oven and sprinkle with the basil leaves. Serve immediately."]}, {"isVegetarian": true, "title": "Artichoke pasta", "url": "www_bbc_co_uk_food_recipes_artichokepasta_1398", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/artichokepasta_1398_16x9.jpg", "ingredients": ["110g/4oz artichokes, marinated in oil", "1 clove garlic, peeled and crushed", "1 tbsp finely chopped parsley ", "1 tbsp  finely chopped thyme, leaves only", "450g/1lb linguine pasta, cooked ", "½ lemon, juice only ", "parmesan shavings, to serve (or similar vegetarian hard cheese)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the artichokes, with their oil into a pan and mash them down with a fork. ", "Add the garlic, parsley and thyme and heat through for a couple of minutes and then pour over the warm pasta. ", "Add the lemon juice and toss thoroughly.", "Serve in bowls topped with shavings of parmesan cheese."]}, {"isVegetarian": true, "title": "Arctic roll", "url": "www_bbc_co_uk_food_recipes_arctic_roll_48010", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arctic_roll_48010_16x9.jpg", "ingredients": ["a little sunflower oil, for greasing", "500ml/18fl oz vanilla ice cream", "200g/7oz raspberry jam", "3 medium free-range eggs", "100g/3½oz caster sugar, plus extra for dusting", "100g/3½oz self-raising flour"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat your oven to 200C/400F/Gas 6 and line a Swiss roll tin, 22x32cm/8½x13in or similar, with baking parchment. Oil this very lightly with sunflower oil.", "Put the ice cream in a large bowl and beat it with a rolling pin or something similar until soft enough to mould. Put it on a piece of baking parchment and shape it into a thin sausage 25–30cm/10-12in long and about 5cm/2in in diameter. Wrap in the parchment and put in the freezer until solid.", "To make the Swiss roll, use an electric whisk or a mixer with a whisk attachment to whisk the eggs and sugar together for several minutes until pale, moussey and almost tripled in volume. The mixture should ‘hold a trail’ when the whisk is removed. Sift the flour over the egg mixture and fold it in lightly. Fold in one tablespoon of warm water.", "Pour the mixture into the prepared tin and smooth it out so that it reaches the corners. Bake for 10-12 minutes, or until golden-brown and just firm to the touch.", "Cut a sheet of parchment slightly larger than the Swiss roll tin and lay it on your work surface. Sprinkle the parchment with sugar. Tip the cooked sponge onto the parchment, base upwards. Carefully peel the parchment from the base of the sponge. Leave to cool completely.", "To assemble the roll, first trim the two long sides of the sponge into neat, straight lines. Spread the jam over the sponge, leaving a 2cm/¾in gap at each short edge and a 4cm/1½in gap along one of the long edges.", "Unwrap the ice cream and place it lengthways across the sponge, close to the jammy edge. Use the parchment to help you roll the sponge around the ice cream. Use a bread knife to neatly trim each end of the roll. Place on a plate and serve straight away, in thick slices. You can wrap any uneaten roll and return it to the freezer. Take it out and let it stand for a few minutes so the sponge can soften slightly, before slicing again."]}, {"isVegetarian": true, "title": "Artichoke, pepper and broad bean salad with lemon dressing", "url": "www_bbc_co_uk_food_recipes_artichokepepperandbr_88448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ onion, very finely sliced", "¼ red pepper, finely sliced", "4 artichoke hearts in oil, drained and cut into wedges", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh coriander", "50g/1¾oz broad beans, skins removed", "½ lemon, juice only", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the onion, pepper, artichoke hearts, chives, coriander and broad beans in a bowl.", "In a separate bowl, whisk together the lemon juice, olive oil and salt and freshly ground black pepper. Pour over the salad, stirring to coat everything. Serve."]}, {"isVegetarian": false, "title": "Artichokes barigoule with snails and winkles", "url": "www_bbc_co_uk_food_recipes_artichokes_barigoule_07740", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for shallow frying", "6 baby artichokes, peeled, choke removed", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 tsp fennel seeds", "100g/3½oz celeriac, peeled and cut into 1cm/¼in pieces ", "1 small carrot, peeled and cut into 1cm/¼in pieces ", "100ml/3½fl oz dry white wine", "100ml/3½fl oz vegetable stock", "2 cooked winkles, shells removed", "2 cooked snails, shells removed", "1 orange, peel julienned only", "1 tbsp basil shoots", "1 tbsp garlic shoots", "salt and freshly ground pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a little olive oil in a large saucepan over a high heat and sear the artichokes on all sides. When coloured reduce the heat  and add the onion, garlic, fennel seeds, celeriac and carrot and cook for 5 minutes. ", "Add the wine and half the vegetable stock and cover with greaseproof paper. Simmer for 10 minutes, season with salt and pepper and mix in a little more olive oil.", "Heat a little olive oil and the rest of the stock in a frying pan and reheat the winkles and snails until hot. ", "Bring a small pan of water to the boil and blanch the orange peel for 2 minutes then drain on kitchen paper. ", "To serve, divide the artichokes between two serving bowls. Pour some of the other vegetables over the top along with the winkles and snails. Drape over the orange peel and garnish with the basil and garlic shoots. "]}, {"isVegetarian": false, "title": "Artichokes Romana style", "url": "www_bbc_co_uk_food_recipes_artichokes_romana_style_30594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 artichokes, preferably Mammole variety", "1 lemon, cut in half", "4 garlic cloves", "1 tbsp salt", "6 anchovy fillets", "20 leaves fresh mint, finely chopped", "20 leaves fresh parsley, finely chopped", "20 leaves fresh marjoram, finely chopped", "2 tbsp grated pecorino ", "2 tbsp breadcrumbs ", "2 tbsp olive oil ", "2 potatoes, peeled and cut into chunks", "200ml/7fl oz white wine", "50ml/2fl oz vegetable stock "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Pull off the tough outer leaves from each artichoke and cut off the stalks. Trim off the tops of the leaves with a pair of kitchen scissors and rub each artichoke with the cut lemon to prevent them from discolouring.", "Finely chop one of the garlic cloves and mix it with the salt and the anchovy fillets in a bowl to form a paste. ", "Add the chopped herbs to the paste with the pecorino and breadcrumbs; mix well.", "Rinse the artichokes under cold running water, shake off any excess water and gently prise the artichokes leaves open.", "Sprinkle the artichokes with a pinch of salt and rub the paste inside the leaves.", "Heat the olive oil in an ovenproof pan. Thinly slice the remaining garlic cloves and add them to the pan, then add the artichokes and potatoes.", "Add the white wine, let it bubble and then add the vegetable stock. ", "Cover the artichokes with greaseproof paper and place a lid on the pan. Bake in the oven for 35-45 minutes. Serve hot or warm."]}, {"isVegetarian": false, "title": "Artichokes with scallops and beurre blanc", "url": "www_bbc_co_uk_food_recipes_artichokes_with_scallops_46921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, juice only", "450g/1lb baby artichokes", "5 tbsp olive oil", "salt and freshly ground black pepper", "6 scallops, cleaned", "25g/1oz butter", "2 shallots, finely sliced", "1 tbsp white wine vinegar", "4 tbsp white wine", "225g/8oz salted butter, cubed ", "4 tbsp chopped fresh chives", "2 tomatoes, peeled, seeds removed, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the artichokes with scallops, pour the lemon juice into a bowl of cold water. Snap off and discard any tough outer leaves from the artichokes. Using a sharp paring knife, peel off the outer layer of the artichokes, including the stem, until you reach the whitish inner layer. Cut the artichokes in half lengthwise, and place them in the lemon water. Set aside. ", "For the beurre blanc, add the shallots, white wine vinegar and white wine to a saucepan and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan. ", "Add a tablespoon of cold water and continue to simmer until the volume of liquid remaining in the pan is approximately one tablespoon. ", "Reduce the heat to low, then gradually whisk in the butter, 25g/1oz at a time, waiting until the butter has melted and is incorporated into the mixture before adding more. ", "Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it through a fine sieve into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the chives and tomatoes. Set aside until needed ", "For the artichokes with scallops, heat two tablespoons of olive oil in a large frying pan and gently fry the artichokes until crisp. Season, to taste, with salt and pepper. ", "Heat another frying pan and add the remaining oil. Once hot, add the scallops and cook for two minutes on each side. Add the butter and, when melted, glaze the scallops.", "To serve, place the scallops and artichokes on serving plates and spoon over the beurre blanc."]}, {"isVegetarian": false, "title": "Artichoke salad with beef carpaccio", "url": "www_bbc_co_uk_food_recipes_artichokesaladwithbe_91506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz beef fillet, trimmed", "1 tbsp olive oil", "2 tsp chopped fresh oregano", "1-2 tbsp extra virgin olive oil", "4-6 baby violet artichokes, trimmed", "250g/9oz Jerusalem artichokes, peeled ", "2 lemons, juice only", "2 tsp Dijon mustard", "2 tbsp white wine vinegar", "6 tbsp extra virgin olive oil", "2 tbsp olive oil", "4 slices white bread, crusts removed, cubed", "4 tbsp flatleaf parsley, roughly chopped", "3 tbsp toasted pine nuts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef carpaccio, season the beef fillet with salt and freshly ground black pepper. Heat a frying pan until smoking, add the olive oil and sear the beef for 2-3 minutes on all sides, or until golden-brown.", "Remove the beef from the pan and roll in the chopped oregano to coat. Cover in cling film and roll into a barrel shape, twisting tightly at both ends to seal, then place into the freezer for one hour, or until firm.", "For the artichoke salad, thinly slice the baby violet artichokes and Jerusalem artichokes, placing them into a bowl of water with half of the lemon juice to prevent them from browning.", "Whisk the mustard, vinegar and remaining lemon juice together in a small bowl, then whisk in the extra virgin olive oil until well combined. Season, to taste, with salt and freshly ground black pepper.", "Heat a frying pan until smoking, then add the olive oil and fry the bread cubes for 3-4 minutes, shaking the pan frequently, until the bread is golden-brown and crisp. Drain on kitchen paper. ", "Drain the artichokes and mix in the parsley and pine nuts. Drizzle over the dressing and mix well to coat, then scatter over the crisp bread cubes. ", "To serve, slice the beef as thinly as possible, then arrange around the edges of a serving plate. Pile the artichoke salad into the centre of the plate. Drizzle the beef with a little extra virgin olive oil and season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Artichokes alla Romana", "url": "www_bbc_co_uk_food_recipes_artichokesallaromana_91747", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/artichokesallaromana_91747_16x9.jpg", "ingredients": ["8 small globe artichokes, outer leaves peeled, stems trimmed ", "2 lemons, juice only", "1 tsp fennel seeds", "1 tsp coriander seeds", "4 carrots, peeled, chopped", "1 onion, peeled, finely sliced", "4 garlic cloves, peeled, finely sliced", "2 celery sticks, trimmed, stringy parts peeled away, sliced ", "3 bay leaves", "6 black peppercorns, left whole", "300ml/10½fl oz white wine", "1 tsp caster sugar", "sea salt flakes ", "100ml/3½fl oz water", "dash extra virgin olive oil", "handful chopped fresh parsley leaves"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the peeled, trimmed artichokes in half lengthways and scoop out the hairy 'chokes' using a teaspoon. Rub the artichoke halves all over with the lemon juice to prevent them from discolouring. Set aside.", "Heat a heavy-based, lidded ovenproof casserole over a medium heat. When the casserole is hot, add the fennel and coriander seeds and dry fry for 30 seconds to one minute, or until the seeds begin to pop. (CAUTION: Keep the pan away from the eyes and face as popping seeds can be dangerous.)", "Add the carrots, onion, garlic, celery, bay leaves, peppercorns, wine and sugar and season, to taste, with salt. Stir well to combine. ", "Place the artichoke halves into the casserole, then pour over the water. Bring the mixture to a gentle simmer, then cover the casserole with a lid and cook for 25-30 minutes, or until the vegetables are tender. ", "When the vegetables are tender, remove the casserole from the heat and set aside, uncovered, until cooled slightly. ", "When the casserole contents have cooled slightly, drizzle over the olive oil, then sprinkle over the parsley. Serve the artichokes alla Romana with steamed fish or barbecued meat."]}]