[{"ingredients": ["480g / 17oz de remolacha mixta como Candy, Bull's Blood y Golden, lavadas, hojas reservadas (ver abajo)", "2 cucharadas de aceite de oliva virgen extra", "2 cucharaditas de vinagre balsámico envejecido", "30g / 1½ oz chalote, pelado, finamente cortado", "4 pizca de sal marina", "2 pizcas de pimienta negra recién molida", "100g / 3½ oz de crema", "1 cucharadita de rábano picante fresco finamente rallado", "2 cucharadas de eneldo fresco picado", "2 pizcas de sal marina", "120g / 4½oz de salmón ahumado en caliente, como bradon rost, carne toscamente copos", "2 cucharadas de eneldo fresco picado", "1 pequeño puñado de hojas de remolacha fresca u otras hojas de bebé"], "method": ["Para la ensalada de remolacha, traiga una olla grande de agua con una tapa hermética al hervor, coloque un inserto de vapor en la parte superior. Agregue la remolacha, cubra la sartén y deje hervir durante 35-40 minutos o hasta que esté tierna. (La remolacha se cuece cuando un cuchillo insertado en el centro no encuentra resistencia).", "Retire la remolacha y déjela enfriar un poco antes de pelarla (es posible que desee usar guantes cuando pele la remolacha para evitar que las manos se manchen). Cortar la remolacha en trozos del tamaño de un bocado (aproximadamente 0,5 cm / ½ pulgada), luego colocar en un recipiente con aceite de oliva, vinagre balsámico y chalota. Mezcle bien, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Para la crème fraîche de rábano picante, mezcle todos los ingredientes crème fraîche de rábano picante juntos, pruebe y ajuste el aderezo, si es necesario.", "Para servir, divida la ensalada de remolacha entre 4 platos para servir, esparza el salmón por encima y espolvoree un poco de eneldo picado. Arregle algunas hojas de remolacha frescas en el lado. Con una cuchara, mezcle la crema de rábano picante en pequeños tazones y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_brandonrostsmokedsal_93502", "title": "Salmón ahumado caliente, ensalada de remolacha y crème fraîche con rábano picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandonrostsmokedsal_93502_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de azúcar blanda y oscura", "50g / 2oz de sirope dorado", "50g / 2oz de mantequilla", "50g / 2oz de harina natural, más extra para quitar el polvo", "1 cucharadita de jengibre molido", "Crema doble de 300 ml / 10 fl oz, batida a picos firmes"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una bandeja para hornear con papel para hornear.", "Derrita el azúcar, el sirope dorado y la mantequilla en una cacerola. Cuando los gránulos de azúcar se hayan disuelto, retire la sartén del fuego.", "Agregue la harina y el jengibre molido y mezcle bien para formar una pasta espesa.", "Coloque una película adhesiva sobre una superficie de trabajo y termine la pasta. Haga rodar la mezcla en forma de bola, luego cubra la película adhesiva y déjela enfriar en la nevera hasta que fragüe (aproximadamente 30 minutos).", "Retire la masa de brandy fría del refrigerador y gírela en bolas del tamaño de una nuez con las manos; debe obtener al menos cuatro de esta mezcla.", "Polvore una superficie de trabajo con harina. Ruede cada bola de masa en un disco de aproximadamente 2 mm / 1/16 pulg. De grosor, luego coloque en la bandeja de hornear.", "Hornee el brandy en el horno durante 6-8 minutos, o hasta que esté crujiente y dorado. Retire del horno y deje enfriar por aproximadamente un minuto.", "Con cuidado, levante cada brondy de la bandeja y gire el extremo de una cuchara de madera, dejándolo enfriar por un minuto antes de quitarlo. Si es posible, es mejor moldear las brochetas de brandy alrededor de varias cucharas al mismo tiempo mientras todavía estén calientes.", "Para servir, coloque la crema en una bolsa de plástico con una boquilla en forma de estrella. Pipe la crema en las brochetas de brandy y apilar en un plato. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_brandy_snaps_17321", "title": "Brochetas hechas en casa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de azúcar glas", "50g / 1¾oz de mantequilla", "Crema doble 25ml / 1fl oz", "Brandy 25ml / 1fl oz"], "method": ["Mida el azúcar glas en un tazón, luego derrita la mantequilla por unos segundos en el microondas o en una sartén pequeña a fuego lento, teniendo cuidado de no quemarla.", "Vierta la mantequilla derretida con la crema y el brandy en el azúcar y mezcle hasta que quede suave.", "Úselo para cubrir un pastel mientras está caliente, luego déjelo reposar antes de cortar el pastel."], "url": "www_bbc_co_uk_food_recipes_brandy_butter_frosting_23164", "title": "Glaseado de mantequilla de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para una torta redonda de 18cm / 7in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "Azúcar demerara 55 g / 2 oz", "Jarabe de oro de 55g / 2oz", "50g / 1¾oz de harina natural", "½ cucharadita de jengibre molido", "½ cucharadita de jugo de limón"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Pasa dos bandejas para hornear con pergamino para hornear, luego enjabona un mango grueso de una cuchara de madera y colócalo en una rejilla para enfriar.", "Mida la mantequilla, el azúcar y el jarabe en una sartén pequeña de base pesada. La forma más fácil es medir la mantequilla, luego el azúcar en la balanza (en la sartén si tiene balanzas digitales), luego medir el jarabe en la parte superior para obtener hasta 165g / 6oz de peso total.", "Calienta suavemente hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Esto llevará unos 15 minutos a fuego lento. No deje que la mezcla hierva, ya que puede cristalizar. Para comprobar cuándo se ha disuelto el azúcar, revuelva ocasionalmente, tirando de la cuchara por el fondo de la sartén hasta que ya no pueda oír los gránulos arenosos raspados y la mayoría de ellos hayan desaparecido.", "Deje que la mezcla se enfríe un poco, unos 2-3 minutos, luego tamice con la harina y el jengibre. Vierta el jugo de limón y mezcle bien para mezclar bien. Ponga cuatro cucharaditas de la mezcla en cada una de las bandejas preparadas para hacer círculos limpios, a unos 10 cm de separación.", "Hornee en el horno precalentado durante aproximadamente 10-15 minutos, o hasta que la mezcla esté bien extendida, se ve de encaje y tiene un color dorado oscuro. Una vez horneado, debe trabajar rápido para dar forma a las brock snaps, por lo que es más fácil hornear una bandeja a la vez. Retire cada bandeja del horno y déjela reposar durante un minuto aproximadamente, luego levante del pergamino para hornear con una rebanada de pescado. La mezcla debe ser lo suficientemente firme como para eliminarla, pero lo suficientemente flexible para darle forma. Revise soltando alrededor y debajo de los bordes con un pequeño cuchillo de paleta.", "Haga rodar rápidamente un círculo de la mezcla caliente alrededor del mango de la cuchara de madera, con la unión debajo. Presione ligeramente la junta para sellar, luego deslice el brandy de la cuchara y déjela endurecer sobre la rejilla, una vez más con la unión debajo. Si alguno de los círculos de la hoja se endurece demasiado para trabajar, vuelva a colocarlos en el horno durante unos segundos para que se suavicen nuevamente. Repita hasta que se haya usado toda la mezcla. Si la mezcla en la sartén se vuelve demasiado firme para dejar caer cucharadas ordenadas, coloca una cucharadita de té en una pequeña bola lisa en tus manos, siéntala en la bandeja de hornear y aplástala ligeramente con los dedos. Cuando esté frío, guarde los brondy snaps en una lata hermética o en un recipiente; se mantendrán durante al menos una semana."], "url": "www_bbc_co_uk_food_recipes_brandy_snaps_47363", "title": "Brandy Snaps", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 brandy snaps", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandy_snaps_47363_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["70 g / 2½ oz de mantequilla, más extra para engrasar", "70 g / 2½ oz de azúcar en polvo", "3 cucharadas de jarabe de oro", "Harina normal de 70 g / 2½ oz", "1 cucharadita de jengibre molido", "2 cucharaditas de brandy", "½ limón, solo ralladura", "Crema doble de 300 ml / ½ pinta", "4 bolas de tallo de jengibre en almíbar, escurrido y finamente picado", "100g / 3½oz de chocolate negro liso de buena calidad, roto en cuadrados"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos bandejas para hornear con papel antigrasa.", "Derrita la mantequilla con el azúcar y el jarabe, revolviendo a fuego lento hasta que el azúcar se disuelva. Retire la sartén del fuego y agregue la harina, el jengibre, el brandy y la ralladura de limón.", "Coloque cuatro cucharadas soperas de la mezcla en una de las bandejas para hornear, dejando suficiente espacio para que la mezcla se extienda. Hornee en el centro del horno durante 10-12 minutos o hasta que esté burbujeante y dorado. Mientras se cocinan los brandy, engrase dos cucharas de madera con mantequilla y envuelva una banda elástica alrededor de ellas para unirlas. Coloque cuatro cucharadas más pequeñas de la mezcla de brandy en la segunda bandeja para hornear.", "Saque los brandy del horno y coloque la segunda bandeja para hornear por la misma cantidad de tiempo. Deje que el brandy encaje en seco durante 30-60 segundos, luego levante cuidadosamente uno con una espátula y enrolle las cucharas, superponiéndolas un poco. Sostenga por alrededor de 30 segundos hasta que la galleta se ponga en forma de tubo, luego deslice suavemente las cucharas y colóquelas en una rejilla para que se enfríen. Repite el método con los brocks de brandy restantes. Si las galletas se vuelven demasiado difíciles de rodar en cualquier etapa, simplemente regrese al horno por unos segundos para suavizarlas. Continúe horneando y haciendo rodar las colaciones de brandy hasta que se use toda la mezcla.", "Para preparar el relleno, batir la crema hasta que se formen picos suaves. Agregue el jengibre picado y la cuchara en una bolsa grande con una boquilla simple. Pase la crema de jengibre por cada extremo de las brochetas de brandy y colóquelas bastante juntas sobre una rejilla colocada sobre una tabla.", "Derrita el chocolate en un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento, teniendo cuidado de que el fondo del recipiente no toque el agua. Retire del fuego y, con una cuchara de postre, rocíe chocolate derretido sobre los brondy broches. Coloque en el refrigerador por 15 minutos o hasta que el chocolate se ponga. Con cuidado, transfiera los brondy snaps a un plato de servir cuando esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_brandy_snaps_with_ginger_51104", "title": "Brandy se rompe con crema de jengibre y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de azúcar en polvo de oro", "75g / 3oz de almendra molida", "Harina normal 150 g / 5oz, tamizada", "110 g / 4 oz de mantequilla, en cubitos", "1 huevo grande de gallinas camperas", "1 sémola de cbs tbsp", "750 g / 1 libra de zarzamoras de 10 oz", "250 g / 9 oz de dulce de leche o caramelo enlatado", "Harina normal de 75g / 3oz, tamizada", "50 g / 2 oz de avena mediana", "75g / 3oz de azúcar granulada dorada", "75g / 3oz de mantequilla, cortada en cubitos", "450 g / 1 libra de zarzamoras / moras", "buena babosa de Drambuie", "azúcar al gusto"], "method": ["Haga los pasteles de la manera habitual: ya sea a mano o en un procesador de alimentos procesando el azúcar, las almendras, la harina y la mantequilla juntas, y luego agregue el huevo.", "Una vez amalgamado, combine en sus manos, envuélvalo en film transparente y relájese bien. (La masa es suave). Luego, extiéndala para que quepa en una lata de flan con fondo de 23 cm / 9 pulg. Con fondo de mantequilla. Pise la base y vuelva a enfriar, durante al menos 3 horas, preferiblemente durante la noche.", "Espolvorea la sémola sobre la masa y luego espárzala sobre las zarzas. Caliente el dulce de leche o el caramelo y espolvoree las bayas.", "Haga la cobertura de crumble mezclando la harina, la avena y el azúcar y frote la mantequilla. Espolvorea sobre las bayas y presiona muy ligeramente. Hornee a 200C / 400F / Gas 6 por 15 minutos y luego reduzca a 180C / 350F / Gas 4 por 25 minutos hasta que estén doradas. Deja hasta que apenas se caliente antes de decantar cuidadosamente a un plato.", "Cueza las zarzas en el Drambuie, agregando azúcar al gusto. Excreta muy brevemente, solo 3-5 minutos, por lo que las bayas aún están firmes. Sirva caliente, no caliente, con la tarta y un poco de crema espesa."], "url": "www_bbc_co_uk_food_recipes_brambleandbutterscot_67688", "title": "Tarta de crumble de zarzamora y caramelo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4oz de mantequilla sin sal ablandada", "125g / 4oz de azúcar glasé", "2 cucharadas de agua hirviendo", "3 cucharadas de brandy"], "method": ["Crema la mantequilla y el azúcar glas.", "Batir el agua hirviendo y el brandy hasta que quede suave.", "Enfríe hasta que sea necesario y sírvelo con pasteles de carne picada o budines de Navidad."], "url": "www_bbc_co_uk_food_recipes_brandybutter_2535", "title": "Mantequilla de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandybutter_2535_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mantequilla sin sal 110g / 4oz, ablandada", "85g / 3oz de azúcar mascabado ligero", "85g / 3oz de azúcar glas, tamizado", "3 cucharadas de brandy o coñac"], "method": ["Pon la mantequilla en un tazón. Batir bien con una cuchara de madera hasta que esté suave o para usar rápidamente un batidor de mano eléctrico (y si usa un procesador de alimentos, entonces no es necesario tamizar el azúcar glas).", "Batir los azúcares hasta que estén suaves, luego agregar el brandy. Si es demasiado generoso con el brandy, se cuajará, así que simplemente agregue más azúcar en polvo tamizado y volverá a ser suave.", "Sirva con el pudín de Navidad o incluso como una descarada adición a un pastel de carne picada."], "url": "www_bbc_co_uk_food_recipes_brandybutter_65615", "title": "Mantequilla de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace aprox. 110 g / 4 oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "Harina normal de 55g / 2oz", "570ml / 1 litro de leche", "4 cucharadas de aguardiente o ron oscuro", "Azúcar en polvo de 55 g / 2 oz"], "method": ["Derrita la mantequilla y agregue la harina. Cocine por 2 minutos y luego agregue la leche. Llevar a ebullición, revolviendo todo el tiempo, y cocine a fuego lento durante 10 minutos.", "Agregue el brandy (o ron) y el azúcar y sirva con pudín de Navidad."], "url": "www_bbc_co_uk_food_recipes_brandysauce_2534", "title": "Salsa de brandy (o ron)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandysauce_2534_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 compraron cestas de brandy", "200g / 8oz de chocolate blanco continental", "Crema doble 200ml / 7floz", "200 m / 7 fl oz de crema fresca con mucha grasa", "Frambuesas o fresas frescas de 200g / 8oz y otras frutas suaves mezcladas"], "method": ["Derrita el chocolate blanco con la crema doble en un tazón sobre agua caliente (no hirviendo) hasta que el chocolate se derrita (no permita que se caliente demasiado o se volverá granulado y no se endurecerá cuando esté frío).", "Dejar de lado para enfriar.", "Mezcle con la crème fraîche hasta que quede suave.", "Vierta en los estuches de brandy.", "Cubra con las frutas para servir."], "url": "www_bbc_co_uk_food_recipes_brandysnapbasketswit_70818", "title": "Cestas de broche con chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 cestas de broche de brandy", "Crema doble 450ml / 16fl oz", "ralladura de 1 naranja", "2 cucharadas de licor de naranja, como Grand Marnier"], "method": ["Batir la crema doble, agregar la ralladura de naranja y Grand Marnier y la cuchara en las cestas."], "url": "www_bbc_co_uk_food_recipes_brandysnapbasketswit_70819", "title": "Cestas de broche con crema de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 4oz de mantequilla sin sal", "100 g / 4 oz de azúcar en polvo", "100g / 4 oz de jarabe de oro", "Harina de 100g / 4oz, tamizada", "½ cucharadita de jengibre molido", "1 cucharada de jugo de lima", "una lima, solo cáscara", "Crema doble 250ml / 9fl oz", "pizca de chile en polvo", "2 frutas de la pasión, cortadas a la mitad y pulpa sacadas", "2 cucharadas de azúcar glas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En una sartén, derrita la mantequilla con el azúcar impalpable y el sirope dorado.", "Retire del fuego y doble suavemente la harina y el jengibre con el jugo de limón y la ralladura.", "Deje que se enfríe completamente.", "Coloque grandes cucharadas de la mezcla en una bandeja para hornear de base pesada. Asegúrese de mantener la mezcla bien espaciada, ya que se extenderá durante la cocción.", "Cocine durante unos cinco minutos hasta que los brandy estén dorados y lacy. Retire del horno y deje enfriar durante unos minutos en la bandeja, luego retire con cuidado con una espátula. Levante cada uno suavemente sobre una cuchara de madera, luego ruede alrededor del mango para formar un tubo.", "Dejar enfriar sobre una rejilla.", "Mientras tanto, bate la crema en un bol hasta que hayas logrado los picos suaves, luego agrega el chile en polvo, la pulpa de la fruta de la pasión y el azúcar glas.", "Coja en una manga pastelera y déjela en la nevera hasta que esté listo para servir.", "Para servir, vierta cada broche de presión con la crema de chile y maracuyá y luego coloque tres en cada plato de servir.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_brandysnapswithchill_74819", "title": "Brandy se rompe con crema de chile y maracuyá", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz de leche", "1 vaina de vainilla", "2 yemas de huevo de gallinas camperas", "Azúcar en polvo de 65 g / 2¼ oz", "40 g / 1½ oz de harina de maíz", "1 cucharada de licor de naranja (como Grand Marnier), melocotón dorado eau de vie gold kirsch", "algunas gotas de extracto de almendra", "50g / 1¾oz de harina natural", "1 cucharadita de polvo de hornear", "50 g / 1¾oz de almendras molidas", "pizca de sal", "4 huevos grandes de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "algunas gotas de extracto de almendra", "1 cucharada de licor de naranja, como Grand Marnier u otro aguardiente", "2 cucharadas de azúcar en polvo, para quitar el polvo", "4 cucharadas de mermelada de cereza o albaricoque", "2 cucharadas de azúcar glas", "3 cucharadas de almendras en copos, ligeramente tostadas"], "method": ["Para la crème pâtissière, vierta la leche en una cacerola y agregue la vaina de vainilla. Llevar a ebullición, luego retirar del fuego y dejar en infusión hasta que vuelva a la temperatura ambiente.", "Coloque las yemas de huevo y el azúcar en un tazón y bata hasta que estén bien combinados y empiecen a ponerse pálidos. Batir en la harina de maíz.", "Vuelva a calentar la leche, luego transfiera a una jarra, descartando la vaina de vainilla. Enjuaga la olla. Vierta la leche en la mezcla de huevo y azúcar desde una altura, batiendo constantemente, luego transfiera de vuelta a la cacerola.", "Revuelva a fuego bajo a medio hasta que espese. Transfiera a un tazón y cubra con una película adhesiva, asegurándose de que la película adhesiva se asiente sobre la superficie de la crema pastelera para evitar que forme una capa. Cuando se haya enfriado, transfiéralo a la nevera para enfriarlo.", "Precaliente el horno a 180 ° C / Fan 160 ° C / Gas 4. Cubra una lata de rollo suizo de 30x20 cm / 12x8 in con papel para hornear.", "Tamiza la harina común y el polvo de hornear en un bol con las almendras molidas. Añade una pizca de sal.", "Batir los huevos y el azúcar junto con un batidor de mano eléctrico o en una batidora de pie hasta que la mezcla esté pálida con una textura aireada tipo mousse, también debe dejar un rastro de cinta. Agregue el extracto de almendra.", "Agregue la mezcla de harina y almendras y doblar muy suavemente pero a fondo con una cuchara de metal.", "Vierta la mezcla en la lata de rollo suizo preparada y unte con un cuchillo para el paladar para asegurarse de que esté bien. Hornee durante unos 10-12 minutos, o hasta que estén ligeramente dorados y elásticos para tocar.", "Retire del horno y colóquelo en una rejilla para enfriar. Despegue el pergamino para hornear y deje enfriar.", "Para ensamblar, transfiera la esponja a una toalla de té ligeramente humedecida. Extienda la mermelada y luego cubra con la crema pastelera. Separe uniformemente con un cuchillo para el paladar, dejando un borde ancho (al menos de 5 cm) en la parte superior (de lo contrario, el relleno se derramará) y uno más angosto (2 cm) en cada lado.", "Con cuidado, enrolle desde abajo, tirando del rollo hacia arriba y hacia arriba para tratar de detener el llenado, hasta que tenga una vuelta. No te preocupes si se agrieta un poco.", "Espolvorear con azúcar glas y las almendras tostadas. Servir."], "url": "www_bbc_co_uk_food_recipes_bras_de_gitan_63262", "title": "Bras de gitan", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace alrededor de 8 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bras_de_gitan_63262_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 naranjas", "300 ml / ½ litro de leche", "Crema doble de 300 ml / ½ pinta", "1 vaina de vainilla, dividida", "15 vainas de cardamomo verde, aplastadas con una mano de mortero", "90 g / 3½ oz de mantequilla, suavizada", "15 rebanadas de pan blanco, preferiblemente ligeramente rancio", "8 huevos de gallinas camperas", "175g / 6oz de azúcar en polvo", "55 g / 2 oz de pistachos sin cáscara, picados", "85 g / 3¼ oz de sultanas doradas", "4 cucharadas de mermelada de naranja de Sevilla, tirada para quitar la cáscara", "azúcar en polvo", "crema fresca (opcional)"], "method": ["Retire la ralladura de las naranjas y coloque el resto de las naranjas a un lado. Vierta la leche y la crema en una sartén, agregue la ralladura de naranja, la vaina de vainilla y los cardamomos triturados y deje que hierva. Apague el fuego y deje en infusión durante una hora.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y coloque una lata de asar grande dentro para calentar. La lata debe ser lo suficientemente grande como para contener una fuente para hornear de 30 x 22 x 5 cm / 12 x 9 x 2 pulgadas con espacio restante alrededor del borde.", "Unte con mantequilla el pan y córtelo en triángulos. Segmenta las naranjas con un cuchillo afilado y descarta la cáscara. Retire la piel exterior translúcida de cada segmento y deséchela. Corta cada segmento por la mitad. Batir los huevos y el azúcar juntos en un tazón. Vierta la leche infundida a través de un colador fino sobre la mezcla de huevo.", "Coloca una capa de pan, untada con mantequilla, en la fuente para hornear, luego agrega una capa de pedazos de pistacho, pasas y segmentos de naranja. Repita las capas, terminando con el pan y haciendo que la capa final se superponga perfectamente. Vierta la mezcla de leche y huevo en la parte superior. Poner un hervidor de agua a hervir.", "Coloque el plato en la lata de asar en el horno. Cuidadosamente vierta agua hirviendo en la lata de asar para que llegue a la mitad de los lados del plato, teniendo cuidado de no dejar que nada de agua entre en el pudin. Hornee durante 30-40 minutos, o hasta que estén casi listos.", "Caliente la mermelada colada en una sartén pequeña sobre fuego suave hasta que esté líquida, y use para cepillar la parte superior del budín de pan y mantequilla. Para servir, saque cada porción y espolvoree con azúcar glas, más una cucharada de crema fresca si lo desea."], "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_07166", "title": "Budín de pan y mantequilla con naranja y cardamomo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de azúcar en polvo", "Crema doble 600ml / 20fl oz", "75 g / 2½ oz pasas", "75g / 2½oz sultanas", "75 g / 2½ oz de grosella", "75 g / 2½ oz de cáscara mixta seca, picada", "150 g / 5½ oz de mantequilla", "1 panecillo blanco suave pan de molde, en rodajas", "5 huevos de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "300 ml / 10 fl oz de leche", "1 vaina de vainilla, dividida", "300 ml / 10 fl oz doble crema", "100ml / 3½fl oz de mermelada de albaricoque"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Para hacer la crema de caramelo, caliente el azúcar en una sartén, revolviendo cada cierto tiempo, hasta que tenga un caramelo oscuro. Vierta 300ml / 10fl oz de crema doble. Batir la crema doble restante hasta que se cae del batidor en cintas, y luego doblar en la mezcla de crema de caramelo. Tamizar en un recipiente limpio, cubrir y dejar reposar durante la noche.", "Para hacer el pudin de pan y mantequilla, esparza parte de la fruta seca en el fondo de una fuente para horno poco profunda. Derretir la mantequilla a fuego medio. Cepille generosamente las rebanadas de pan con la mantequilla derretida y coloque una capa encima de la fruta seca. Continúa con la capa así hasta que la fruta y el pan se hayan agotado, terminando con una capa de pan.", "Mezcle los huevos y el azúcar en un tazón grande y resistente al calor. Traiga la leche y la vainilla a fuego lento y viértala sobre la mezcla de huevo. Vierta la crema y mezcle, luego cuele a través de un colador fino, descartando la vaina de vainilla. Vierta la mezcla sobre el pan, empujándolo hacia abajo para absorber todo el líquido.", "Hornee durante 40-50 minutos, hasta que se haya fraguado. Una vez que esté frío, caliente suavemente el atasco en una cacerola a fuego lento. Esmalte la parte superior del pudín con la mermelada de albaricoque caliente.", "Para servir, corta el pudin de pan y mantequilla en pociones. Transfiera a los tazones para servir y agregue una cucharada de crema de caramelo al costado."], "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_95777", "title": "Pudín de pan y mantequilla con crema de caramelo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, ablandada, más extra para engrasar", "2 rebanadas de pan blanco de un día", "2 mitades de pera en lata, escurridas, picadas, más extra para servir", "4 cucharaditas de gotas de chocolate con leche", "1 huevo de gallinas camperas", "125ml / 4½ fl oz de leche", "25 g / 1 oz de azúcar en polvo", "yogur natural, para servir"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase un plato a prueba de horno de 400ml / 14fl con mantequilla. Coloque el plato engrasado en una bandeja para hornear.", "Unte con mantequilla un lado de cada pedazo de pan, luego corte cada pieza en cuatro triángulos. Coloque una capa de cuatro triángulos en el fondo del plato.", "Espolvorea más de la mitad de las gotas de pera y chocolate picadas.", "Repite el proceso con las gotas restantes de pan, pera y chocolate.", "Batir el huevo y el azúcar juntos hasta que estén pálidos y bien combinados, luego batir en la leche. Vierta la mezcla en el plato para cubrir las capas de pan y frutas. Presione cualquier pan no cubierto por la mezcla de huevo en el líquido para remojar, usando un tenedor.", "Hornee el pudín en el horno durante 25-30 minutos, o hasta que la crema se haya puesto y esté dorada en la parte superior.", "Sirva con yogurt natural y piezas extra de pera, para adornar."], "url": "www_bbc_co_uk_food_recipes_bread_and_butter_60669", "title": "Pan y mantequilla sorpresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz pasas", "100ml / 3½fl oz de té frío", "3 manzanas o 3 peras o una mezcla de ambos", "exprimir jugo de limón", "400ml / 14fl oz de leche entera", "125g / 4½ oz de mantequilla sin sal, más extra para engrasar", "3 huevos", "100 g / 3½ oz de azúcar morena suave", "2 cucharaditas de canela", "1 cucharadita de nuez moscada, recién rallado", "1 cucharadita de extracto de vainilla", "½ pan de molde grande, puede ser un poco rancio (o brioche)", "1 cucharada de cristales de azúcar moreno"], "method": ["Primero ponga las pasas en un tazón pequeño, agregue el té frío y déjelo en remojo.", "Pele, base y corte las manzanas o las peras y manténgalas frescas en un tazón de agua con un chorrito de jugo de limón.", "Engrase una fuente para horno y precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Suavemente caliente la leche en una cacerola, luego agregue la mantequilla y permita que se derrita. Coloque la leche y la mantequilla a un lado para enfriar a tibio.", "Coloque los huevos, el azúcar, la canela, la nuez moscada y la vainilla en un bol y bata con un batidor de mano eléctrico hasta que estén bien combinados. Batir en la leche mantecosa.", "Rompa el pan en trozos, manteniendo las cortezas encendidas o apagadas dependiendo de cuán elegante sea, y póngalos en capas en la fuente para hornear engrasada. Cuele las pasas, descarte el té, y espárcelas sobre el pan, luego cubra con la fruta rebanada. Vierta la mezcla y espolvoree cristales de azúcar moreno.", "Hornee en el horno precalentado durante aproximadamente 30 minutos hasta que el pudín se haya endurecido y tenga una costra dorada en la parte superior.", "Sirva con helado o natillas, o pruebe un poco de crema agria para variar."], "url": "www_bbc_co_uk_food_recipes_bread_pudding_zemlovka_35608", "title": "Pudín de pan (Zemlovka)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de pan fuerte 250 g / 9 oz, más extra para amasar", "7 g de levadura seca de acción rápida", "1 cucharadita de sal", "2 cucharadas de aceite de oliva", "½ zampone (trotón de cerdo deshuesado y precocido), hervido durante 20 minutos y picado (disponible en algunas tiendas de delicatessen italianas)", "¼ col de col rizada, rebanada y blanqueada", "2 salchichas de hinojo, cocidas y en rodajas", "2 salchichas ahumadas, cocidas y en rodajas", "150g / 5½ oz de patatas nuevas, cocidas y en rodajas", "100-150 g / 3½-5½ oz crema de crema agria", "100-150 g / 3½-5½ oz queso beaufort o queso reblochon"], "method": ["Para la masa de pan, coloque la harina en un tazón grande y agregue la levadura y la sal y mezcle. Agregue lentamente 150-200 ml de agua hasta que se una como una masa. Amasar durante al menos 5 minutos hasta que tenga una masa suave. Coloque en un tazón grande ligeramente enharinado, cubra y deje probar durante aproximadamente una hora o hasta que duplique su tamaño.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Calentar una sartén mediana y agregar el aceite, freír el trotón con la col durante 2-3 minutos.", "Elimine el aire de la masa y extiéndalo formando un círculo sobre una superficie enharinada.", "Coloque todos los ingredientes de relleno en la mitad del círculo de masa enrollado, mézclelos y luego doble la otra mitad para hacer un semicírculo. Engarce los bordes hasta que queden bien sellados y colóquelos en una bandeja para hornear forrada con papel de hornear.", "Hornee en el horno por 15-20 minutos o hasta que estén doradas. Cuando toca la parte inferior, debe sonar hueco.", "Para servir, coloque el pan cocido en un plato para servir y desgarre."], "url": "www_bbc_co_uk_food_recipes_bread_stuffed_with_53425", "title": "Pan relleno de salchicha y zampone", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "3 cucharadas de azúcar en polvo", "2 tazas de leche y crema mezcladas juntas, mitad y mitad", "½ cucharadita de extracto de vainilla", "1 pan blanco, croissants, brioche o panettone", "Mantequilla 50g / 20z", "grandes pasas, empapadas en Marsala", "crema doble o crema pastelera, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Mezcle los huevos, el azúcar, la leche y el extracto de vainilla en un tazón grande.", "Corta el pan que prefieras, tueste y póngalo a la mantequilla y acomódelo en rodajas superpuestas en el fondo de un plato resistente al horno, dejando algunos bordes sobresalientes en la parte superior para que queden crujientes. Esparza las pasas remojadas sobre la parte superior y luego vierta la mezcla de huevo.", "Hornee durante 30 minutos en el horno precalentado y sirva caliente con crema o crema pastelera."], "url": "www_bbc_co_uk_food_recipes_breadandbutterpuddin_88983", "title": "Pudin de pan y mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadandbutterpuddin_88983_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, más extra para engrasar", "8 rebanadas finas de pan", "50g / 2oz sultanas", "2 cucharaditas de canela en polvo", "350ml / 12fl oz de leche entera", "Crema doble 50ml / 2fl oz", "2 huevos de gallinas camperas", "25g / 1 oz de azúcar granulada", "nuez moscada rallada, al gusto"], "method": ["Engrase un plato de 1 litro / 2 pinta de pastel con mantequilla.", "Corta las cortezas del pan. Extienda cada porción con un lado con mantequilla, luego córtela en triángulos.", "Coloque una capa de pan con la mantequilla hacia arriba en el fondo del plato y luego agregue una capa de sultanas. Espolvorea con un poco de canela, luego repite las capas de pan y sultanas, espolvoreando con canela, hasta que hayas agotado todo el pan. Termine con una capa de pan, luego reserve.", "Suavemente caliente la leche y la crema en una sartén a fuego lento hasta el punto de escaldar. No lo dejes hervir", "Agriete los huevos en un bol, agregue tres cuartos del azúcar y bata ligeramente hasta que estén pálidos.", "Agregue la mezcla caliente de leche y crema y revuelva bien, luego cuele la crema pastelera en un tazón.", "Verter la crema sobre las capas de pan preparado y espolvorear con nuez moscada y el azúcar restante y dejar reposar durante 30 minutos.", "Precalentar el horno a 180C / 355F / Gas 4.", "Coloque el plato en el horno y hornee durante 30-40 minutos, o hasta que la crema se haya endurecido y la parte superior esté dorada."], "url": "www_bbc_co_uk_food_recipes_breadandbutterpuddin_85936", "title": "Pudin de pan y mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadandbutterpuddin_85936_16x9.jpg", "isVegetarian": true, "recommendations": 0}]