[{"ingredients": ["½ botella de vino tinto", "6 x 300g tarrinas de carne de vacuno lista para usar", "2 cucharadas de vinagre balsámico", "sal y pimienta negra recién molida", "1 cebolla pequeña, finamente picada", "Setas de castaña de 200g / 7oz, frotadas y picadas", "2 tomates, sin semillas y finamente picados", "2 dientes de ajo picados", "2 cucharadas de perejil picado", "botón de mantequilla", "450 g / 1lb de papas para hornear, peladas", "sal y pimienta negra recién molida", "100 g / 3½ oz de mantequilla, derretida en una sartén", "8 ciruelas listas para comer, picadas", "Filetes de solomillo de 4 x 225 g / 8oz", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "Hojas de espinaca 80g / 3oz"], "method": ["Para hacer la salsa de vino tinto, coloque el vino, el caldo de carne y el vinagre balsámico en una olla grande. Llevar a ebullición y mantener a fuego lento hasta que la salsa se haya reducido a la mitad. Sazonar con sal y pimienta negra recién molida y dejar a un lado.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para las tortas de papa, dales forma de barril a las papas y luego córtalas muy finas con una mandolina o un cuchillo afilado. Usando una lata de budín de Yorkshire, forra cada hoyo con una capa de papa, sazona con sal y pimienta negra recién molida y vierte sobre un poco de mantequilla derretida. Esparza las ciruelas pasas en la parte superior, luego termine con las papas restantes y el condimento, vertiendo la mantequilla derretida entre cada capa. No se preocupe si la papa es más alta que los agujeros, colapsará durante la cocción.", "Hornee los pasteles de patata en el horno durante 30 minutos o hasta que estén cocidos. Retire del horno y deje enfriar, luego retírelo de las latas y déjelo a un lado.", "Para la carne de res, sazone los filetes con pimienta pero sin sal. Para cocinar los filetes, caliente la mantequilla y el aceite en una sartén y, una vez que la mantequilla esté espumante, agregue los filetes. Coloree bien en un lado antes de voltearse y cocinar por otros 5-6 minutos, o hasta que esté cocido a su gusto.", "Retire los filetes de la sartén y déjelos reposar en un lugar cálido.", "Agregue la espinaca a la sartén, los filetes se cocinaron y se cocieron durante el tiempo suficiente para que se marchiten, luego se quitan de la sartén y se reservan. Saltee la cebolla, los champiñones, los tomates, el ajo y el perejil en la misma sartén durante unos minutos a fuego alto para que se ablanden ligeramente. Vierta la salsa de vino tinto y un pomo de mantequilla para dar a la salsa un brillo encantador, y cocine a fuego lento durante un minuto más o menos. Verifica el condimento.", "Para servir, divida la espinaca entre 4 platos, cubra con los pasteles de patata calentados y los filetes de carne, y termine cuchareando la salsa y las verduras en la parte superior."], "url": "www_bbc_co_uk_food_recipes_panfriedfilletofbeef_81087", "title": "Filete de ternera frito con torta de ciruela y patata", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 suela de limón, fileteada", "sal y pimienta negra recién molida", "75g / 3oz de mantequilla", "8 cebollas bebé, peladas", "1 chalote, finamente picado", "1 ramita de tomillo, solo hojas", "75ml / 3fl oz de vino blanco", "110ml / 4fl oz de caldo de pescado", "Crema doble 75ml / 3fl oz", "Guisantes de 110 g / 4 oz", "1 manojo de acedera, finamente cortado"], "method": ["Sazonar la planta del pie con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y agregar un tercio de la mantequilla a la sartén.", "Coloque el pescado en la sartén y cocine durante dos minutos por cada lado. Apartar y mantener caliente.", "Mientras tanto, caliente una sartén por separado y agregue otro tercio de la mantequilla a la sartén, junto con las cebollas baby.", "Freír las cebollas hasta que estén doradas por todos lados y tiernas, unos cinco minutos.", "Calentar otra sartén hasta que esté solo caliente y agregar la mantequilla restante, chalotes y tomillo.", "Cocine por dos minutos, luego agregue el vino blanco. Suba el fuego y cocine hasta que se reduzca a la mitad.", "Agregue el caldo de pescado a la sartén y permita reducirlo un poco más. Agregue la crema y cocine a fuego lento durante 3-4 minutos.", "Cuele la salsa a través de un colador y vuelva a colocarla en la sartén. Agregue los guisantes y la acedera y cocínelos hasta que la acedera se marchite y los guisantes estén calientes.", "Para servir, coloque un poco de salsa en cada plato y coloque el pescado en la parte superior. Cuchara las cebollas alrededor del borde y servir a la vez."], "url": "www_bbc_co_uk_food_recipes_panfriedfilletoflemo_87934", "title": "Filete frito de limón con salsa de guisantes y acedera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de pimienta negra", "200g / 7oz de espesor yogur de estilo griego", "2 cucharadas de miel", "6 pequeños higos maduros", "1 cucharada de mantequilla", "1 cucharada de azúcar en polvo"], "method": ["Aplastar gruesamente los granos de pimienta y agitar a través de un colador para eliminar el polvo fino. Dejar de lado.", "Combina el yogur y la miel, revolviendo bien. Cortar los higos por la mitad y espolvorear los lados cortados con azúcar.", "Derrita la mantequilla en una sartén antiadherente y huela los higos por un minuto o dos, con la parte del corte hacia abajo.", "Coloque tres mitades de higos en cada plato y agregue una cucharada de yogur. Disperse con los granos de pimienta triturados y sirva."], "url": "www_bbc_co_uk_food_recipes_panfriedfigswithblac_72907", "title": "Higos fritos con yogur de pimienta negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Frijoles de 300g / 11oz, enjuagados, escurridos, luego a la izquierda para remojar en agua durante la noche", "1.5 litros / 2½ pepitas de caldo de pescado", "2 ramitas de tomillo fresco", "2 hojas de laurel", "300g / 11oz de gambas de tigre crudas, con cáscara", "1 cucharada de aceite de oliva", "1 diente de ajo, aproximadamente picado", "1 chalote de plátano, aproximadamente picado", "1 puerro, solo blanco, más o menos picado", "2 cucharaditas de puré de tomate", "¼ cucharadita de pimienta de cayena", "75 ml / 3 fl oz de vermut seco vs Noilly Prat", "110ml / 4fl oz crema batida", "Salchicha para cocinar chorizo ​​150g / 5oz, picada", "2 cebollas tiernas, finamente cortadas", "40 g / 1½ oz de mantequilla sin sal", "1 limón, solo jugo", "6 ramitas de perifollo fresco, más o menos picadas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 x 120 g / 4 oz de filetes de lubina salvaje", "1 lechuga Baby Gem, hojas separadas", "4 ramitas de perifollo fresco, para servir"], "method": ["Para el cassoulet, escurrir y enjuagar las alubias empapadas. Coloque en una sartén y cubra con la mitad del caldo de pescado. Agregue el tomillo y las hojas de laurel y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 30 minutos, o hasta que los frijoles estén tiernos. Escurra y deseche el tomillo, las hojas de laurel y el licor de cocción, deje los frijoles a un lado.", "Concha la mitad de los langostinos tigre, reservando las conchas. Coloque las gambas peladas a un lado.", "Cortar aproximadamente las langostinos enteros restantes en sus conchas y agregar a las conchas de gambas reservadas.", "Calentar una sartén hasta que esté caliente, luego agregar el aceite de oliva, el ajo, la chalota y el puerro y cocinar por un minuto.", "Agregue los langostinos con cáscara cortada y las cáscaras de gambas reservadas y cocine por un minuto más.", "Agregue el puré de tomate y la pimienta de cayena y cocine por un minuto.", "Agregue el vermut y flambeado para quemar el alcohol.", "Agregue el caldo de pescado restante y deje que hierva. Reduzca el fuego a fuego lento durante 5-8 minutos, luego agregue la crema. Revuelva bien y retírelo del fuego. Deje que se enfríe durante 1-2 minutos, luego vierta en una licuadora y mezcle hasta obtener un puré.", "Pase la mezcla a través de un tamiz fino en una sartén limpia.", "Mientras tanto, caliente una sartén limpia hasta que esté caliente, luego agregue el chorizo ​​y cocine durante 1-2 minutos.", "Agregue los frijoles cocidos, las gambas sin cáscara y la cebolla tierna y cocine por 2-3 minutos.", "Agregue 1-2 cucharadas de la salsa colada a la mezcla de chorizo ​​y frijoles y revuelva para combinar, luego cocine a fuego lento hasta que las gambas se hayan puesto rosadas y estén bien cocidas. Reserve la salsa restante para servir.", "Agregue la mantequilla, el jugo de limón y el perifollo a la cassoulet y revuelva bien para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la lubina y la lechuga, coloque los filetes de lubina en una tabla de cortar y, con un cuchillo afilado, marque la piel, a 1 cm / ½ en intervalos.", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva y los filetes de lubina, con la piel hacia abajo, y cocínelos durante dos minutos. Con cuidado, voltee los filetes de lubina y cocine por otros dos minutos.", "Agregue las hojas Little Gem al pescado y cocínelas hasta que se marchiten un poco, luego retírelas de la sartén y escurra sobre papel de cocina. Verifique que la lubina esté bien cocida, luego retírela del fuego.", "Para servir, coloque cucharadas de cassoulet en dos cuencos y cubra con las hojas de lechuga marchitas. Coloque un filete de lubina encima de cada uno y ponga la salsa reservada alrededor. Adorne con ramitas de perifollo fresco."], "url": "www_bbc_co_uk_food_recipes_panfriedfilletofseab_89000", "title": "Filete de lubina frito, salteado de lechuga Baby Gem con gambas y cassoulet de chorizo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 limas, solo jugo", "2 cucharadas de hojas de cilantro fresco picado", "3 ramitas de perejil fresco", "5 ramitas de tomillo fresco, solo hojas", "½ cucharadita de pimienta de Jamaica molida", "1 cucharadita de salsa Worcestershire", "1 guindilla Scotch, sin semillas, picada", "2 cebolletas, cortadas, finamente picadas", "3 cucharadas de aceite de oliva, más extra para servir", "sal y pimienta negra recién molida", "4 x 100 g / 3½ oz de filetes de lubina", "800g / 1¾lb de polenta lista para usar", "Harina normal de 100 g / 3½ oz, para cubrir", "sal o pimienta negra recién molida", "2 cucharadas de aceite vegetal", "4 ramitas de tomillo fresco, solo hojas", "30g / 1oz de mantequilla", "Quina de 125 g / 4½ oz, recortada, picada en longitudes de 2 cm / ¾ pulgadas", "1 cebolla", "2 dientes de ajo picados", "pizca de sal", "1 cucharada de aceite vegetal", "2 tomates maduros grandes, cortados en cubos de 2cm / ¾in", "2 cebolletas, cortadas, picadas", "1 guindilla Scotch, semillas removidas, rebanadas", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Para el adobo de lubina, mezcle el jugo de lima, cilantro, perejil, tomillo, pimienta de Jamaica, salsa Worcestershire, chile, cebolletas y la mitad del aceite de oliva en un procesador de alimentos hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque los filetes de lubina en un vaso o plato de cerámica poco profundo y vierta sobre el adobo de lubina. Cubra el plato con film transparente y deje enfriar en la nevera durante 15-20 minutos. (NB: No deje el pescado por más tiempo o el ácido cítrico del jugo de lima comenzará a 'cocinarlo').", "Mientras tanto, para el cou-cou, corta el bloque de polenta preparada en cuatro piezas largas. Espolvoree la harina en un plato y sazone, al gusto, con sal y pimienta negra recién molida. Dragar los bloques de polenta en la harina sazonada hasta que estén completamente cubiertos.", "Caliente el aceite vegetal en una sartén a fuego medio a alto. Agregue los bloques de polenta y espolvoree sobre las hojas de tomillo. Freír por 1-2 minutos en cada lado, o hasta que estén pálidas doradas por todos lados.", "Caliente la mantequilla en una sartén separada a fuego medio. Agregue la okra, la cebolla, el ajo, el tomillo restante y la sal y fría por 4-5 minutos, o hasta que se ablanden. Retire la sartén del fuego y reserve.", "Caliente el aceite vegetal restante para la lubina en una sartén de base pesada a fuego medio. Agite los filetes de lubina para eliminar el exceso de marinado, luego agréguelos a la sartén, con la piel hacia abajo, y fría durante 1-2 minutos, o hasta que estén crujientes.", "Con cuidado, voltee los filetes de lubina y fríalos durante 1-2 minutos o hasta que estén completamente cocidos.", "Para la salsa de tomate y lima, caliente el aceite vegetal en una sartén separada a fuego medio. Agregue los tomates, las cebollas tiernas y el chícharo de bonete escocés y fría durante 3-4 minutos, o hasta que se ablanden.", "Verter sobre el jugo de limón y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque un filete de lubina en cada uno de los cuatro platos de servir. Rocíe sobre el aceite de oliva. Coloque el cou-cou, okra y salsa de tomate y lima al costado."], "url": "www_bbc_co_uk_food_recipes_panfriedfilletsofsea_91705", "title": "Filetes de lubina a la plancha con salsa de tomate y lima y cou-cou", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de filete 125 g / 4½ oz", "sal y pimienta negra recién molida", "15g / ½ oz de mantequilla", "1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "½ cebolla roja, en rodajas", "100g / 3½oz de patatas nuevas", "100g / 3½oz de zanahorias Chantenay o zanahorias pequeñas similares", "Lanzas de espárragos 85g / 3oz", "25g / 1oz de mantequilla", "2 cucharadas de agua hirviendo", "150ml / 5fl oz de vino tinto", "100ml / 3½fl oz de caldo de carne", "½ cucharadita de arrurruz, mezclado con unas gotas de agua fría", "25g / 1oz de mantequilla"], "method": ["Ponga a hervir una olla de agua con sal.", "Para el filete, caliente una sartén a fuego medio. Frote el aceite en el bistec y sazone al gusto con sal y pimienta negra recién molida. Agregue el bistec y la mantequilla a la sartén y fríe la carne durante 2-3 minutos por cada lado, luego retírela de la sartén para que descanse.", "Para las cebollas caramelizadas, agregue el aceite de oliva, la mantequilla y las rodajas de cebolla en la misma sartén y cocínelas durante 8-10 minutos, o hasta que las cebollas se ablanden y estén doradas. Dejar de lado.", "Para las verduras untadas con mantequilla, cocine las papas, las zanahorias y los espárragos en agua salada y hirviendo durante 5-6 minutos, o hasta que estén tiernas, pero no estén bien cocidas. Escurra las verduras y vacía la cacerola. Regrese las verduras parcialmente cocidas a la cacerola vacía, agregue la mantequilla y el agua y continúe cocinando las verduras a fuego medio durante 4-5 minutos, o hasta que estén tiernas.", "Para la salsa de vino tinto, caliente el vino tinto en una cacerola pequeña a fuego medio hasta que el volumen se haya reducido a la mitad, y luego agregue el caldo de carne. Agregue la arrurruz y revuelva hasta que la salsa se haya espesado. Agregue la mantequilla y mezcle hasta que se haya derretido.", "Para servir, espolvoree las cebollas caramelizadas en un plato para servir y coloque el filete en la parte superior. Coloque las verduras untadas con mantequilla y rocíe la salsa de vino tinto alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_panfriedfilletsteako_89396", "title": "Filete frito en cebolla caramelizada con verduras untadas y salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de pescado blancos sin espinas, de 450 g / 1 libra, como el bacalao, la lubina o el fletán,", "pelado y dividido en 4 piezas iguales", "sal", "pimienta recién molida", "harina común, para quitar el polvo", "450g / 1lb de tomates enteros en lata", "3 cucharadas de aceite de oliva extra virgen", "3 cucharadas de ajo picado grueso", "2 cucharadas de chalotes finamente picados", "1 cucharada de vino de arroz Shaoxing o jerez seco", "1 cucharada de salsa de soja ligera", "1 cucharada de salsa de frijoles", "2 cucharaditas de azúcar", "puñado de hojas de albahaca fresca para decorar"], "method": ["Pat el pescado seco con papel de cocina. Espolvoree uniformemente con sal, pimienta y polvo con harina, sacudiendo cualquier exceso.", "Escurra los tomates, reserve el jugo y pique la carne en trozos pequeños. Mida la cantidad de jugo, guarde la mitad y reserve. Descarta el resto", "Caliente un wok a fuego alto hasta que esté caliente. Agregue el aceite de oliva, y cuando esté moderadamente caliente, agregue los filetes de pescado y fríelos en un sartén por 3-5 minutos, dependiendo del grosor de los filetes. Luego voltéelas y dore el otro lado (esto también tomará de 3 a 5 minutos). Cuando esté cocido, retire y escurra sobre papel de cocina. Gire a un plato caliente.", "Vierta todas menos una cucharada de aceite del wok, agregue el ajo y las chalotas, y saltee por un minuto.", "Agregue los tomates, el jugo de tomate reservado, el vino de arroz o el jerez, la salsa de soja, la salsa de frijoles y el azúcar, y cocine a fuego lento durante cinco minutos.", "Vierta la salsa sobre el pescado, adorne con la albahaca y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_panfriedfishinspicyt_70985", "title": "Pescado frito en salsa de tomate picante", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60 g / 2¼ oz de harina lisa (multiuso)", "1 cucharadita de sal marina", "4 filetes de pescado blancos firmes (como el pargo rojo)", "60ml / 2¼fl oz de aceite", "mitades de lima, para servir", "2 chiles rojos frescos grandes, sin semillas y cortados en diagonal.", "15g / ½ oz de hojas frescas de cilantro", "12 hojas de menta fresca", "4 chalotes finamente cortados", "20 mangetout, blanqueados y finamente cortados", "1 lima, ralladura solamente", "2 cucharadas de azúcar moreno", "2 cucharadas de azúcar", "2 cucharadas de agua", "2 cucharadas de salsa de pescado", "2 cucharadas de jugo de lima"], "method": ["Mezcle la harina y la sal juntas en un tazón.", "Agregue los filetes de pescado y vuélvalo a cubrir bien.", "Caliente el aceite en una sartén antiadherente grande a fuego medio a alto hasta que esté caliente.", "Agregue el pescado y cocine por dos minutos en cada lado, o hasta que el pescado esté cocido, volteándolo solo una vez.", "Para la ensalada, mezcle los chiles, el cilantro y las hojas de menta, los chalotes, el mangetout y la ralladura de lima en un tazón.", "Para el aderezo, mezcle los azúcares y las dos cucharadas de agua en una sartén pequeña a fuego lento hasta que los azúcares se hayan disuelto.", "Continúe cocinando a fuego medio hasta que esté ligeramente dorado.", "Retire del fuego, agregue la salsa de pescado y el jugo de lima y revuelva para combinar.", "Sirva el pescado cubierto con ensalada verde y aderezo agridulce en la parte superior y sirva con mitades de lima."], "url": "www_bbc_co_uk_food_recipes_panfriedfishwithgree_73071", "title": "Pescado frito con ensalada verde y aderezo agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Espagueti 200 g / 7 oz, cocinado de acuerdo con las instrucciones del paquete", "1 cucharada de queso parmesano rallado", "Filete de salmón sin piel de 55g / 2oz, picado", "pequeño racimo de perejil fresco, picado", "3 huevos de gallinas camperas, golpeados", "sal marina y pimienta negra recién molida", "1 cucharada de aceite de oliva", "cebollino fresco, picado, para servir"], "method": ["Coloque los espaguetis, parmesano, salmón y perejil en un bol y agregue los huevos. Mezcle bien para cubrir y sazone con sal marina y pimienta negra recién molida.", "Caliente el aceite en una sartén antiadherente de 15 cm / 6 in y agregue la mezcla de huevo. Cocine por 3-4 minutos, hasta que la parte inferior esté dorada.", "Voltee la frittata colocando un plato grande sobre la sartén para cubrirla, luego voltee cuidadosamente la sartén para atrapar la frittata. Con cuidado, devuelva la frittata a la bandeja sin cocer, hacia abajo y continúe cocinando por otros 2-3 minutos, hasta que esté dorada y cocida.", "Servir en un plato limpio, adornado con cebolletas."], "url": "www_bbc_co_uk_food_recipes_panfriedfrittatawith_83962", "title": "Frittata frita con espagueti y salmón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 175 g / 6 oz de filetes de salmonete, piel anotada con un cuchillo afilado", "sal y pimienta recién molida", "1 cucharada de aceite de oliva", "1 lima, solo jugo", "2 cucharadas de aceite de sésamo", "60g / 2½oz de brotes de soja", "Setas shiitake de 60 g / 2½ oz, finamente cortadas", "Mangetout de 60 g / 2½ oz, finamente cortado", "2 cucharadas de semillas de sésamo tostadas", "50g / 2oz de mantequilla sin sal", "Chalotes 50g / 2oz, en rodajas", "75g / 3oz lemongrass, rallado", "pizca de sal", "175g / 6 oz champiñones, en rodajas", "2-3 ramitas de tomillo de limón, picado finamente", "50ml / 2fl oz de caldo de pescado", "250ml / 9fl oz de vino blanco seco", "Crema doble 250ml / 9fl oz", "sal y pimienta recién molida"], "method": ["Para el filete de salmonete frito en sartén, sazone el lado de carne del salmonete con sal y pimienta recién molida.", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva y coloque el pescado en la sartén, con la piel hacia abajo. Cuando la piel del salmonete es dorada y crujiente, voltee el pescado para terminar de cocinar y luego agregue un chorrito de lima.", "Mientras tanto, para las verduras, caliente el aceite de sésamo en una sartén, agregue los brotes de soja, los hongos shiitake y el mangetout, junto con una pizca de sal. Revuelva freír durante unos minutos.", "Una vez que los vegetales se hayan suavizado, agregue las semillas de sésamo tostadas y mezcle bien.", "Para la salsa de limoncillo y vino blanco, caliente una sartén hasta que esté caliente y agregue la mitad de la mantequilla, los chalotes, la hierba de limón y una pizca de sal.", "Freír suavemente hasta que los chalotes estén suaves, pero no dorados.", "Agregue el caldo de pescado y cocine hasta que el líquido se reduzca a la mitad.", "Coloque el vino en una sartén por separado y cocine a fuego lento hasta que se reduzca en un tercio. Agregue el vino al caldo reducido.", "Agregue la crema, hierva y luego baje inmediatamente el fuego a fuego lento. Cocine hasta que espese un poco; luego pasar a través de un tamiz en una sartén limpia.", "Agregue la mantequilla restante y sazone con sal y pimienta recién molida, al gusto.", "Apila las verduras en cada plato. Coloque el pescado en las verduras y póngalo en la salsa una y otra vez. Servir."], "url": "www_bbc_co_uk_food_recipes_panfriedgreymulletwi_88172", "title": "Salmonetes grises con mangetout salteado y setas shiitake con salsa de limoncillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 urogallos frescos, senos extraídos y desollados (ver las instrucciones a continuación - patas y restos de animales almacenados)", "50g / 2oz de mantequilla", "1 cebolla roja mediana, finamente picada", "Remolacha joven 500g / 1lb, pelado y cortado en cubitos", "Sal Maldon y pimienta negra recién molida", "50g / 2oz de grasa de tocino, o goteo de ternera o pato", "1 cebolla mediana, finamente picada", "125g / 4½oz de avena mediana o gruesa", "300ml / 10fl oz de vino tinto", "450ml / 15fl oz grouse stock", "1 cucharada de jarabe de rowan o grosella", "25 g / 1oz de mantequilla sin sal, refrigerada y cortada en cubitos", "aceite de oliva"], "method": ["Las pechugas grouse son fáciles de quitar. Primero corte las piernas a través de la articulación al lado de la caja torácica. Luego, con un pequeño cuchillo afilado, corte a lo largo del esternón y con pequeños golpes rápidos, manteniéndolos paralelos a los senos, gradualmente alivie la carne y libérela del cuerpo. Quítese la piel y están listos para cocinar.", "Para la remolacha glaseada, derrita la mantequilla en una cacerola y agregue la cebolla. Cocine por cinco minutos, hasta que se ablanden, luego agregue la remolacha. Vierta 150 ml / 5 fl oz de agua y cocine a fuego lento durante 15 minutos, suba el fuego y evapore el líquido restante. Cuando el líquido haya desaparecido, mezcle la remolacha a fuego alto durante 2-3 minutos o hasta que comience a caramelizar. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para el skirlie, derrita el goteo o la grasa en una sartén y agregue la cebolla. Cocine a fuego lento hasta que empiece a dorarse. Agregue la harina de avena y revuelva por un par de minutos, hasta que la grasa se absorba y la avena huela a toastie. Mantener caliente", "Para la salsa, coloque el vino tinto y la gelatina de serbal en una cacerola y reduzca a aproximadamente dos cucharadas de líquido. Agregue el caldo de gallina y hierva para reducir a la mitad. Sabor y temporada. Agregue la mantequilla y no permita que la salsa hierva. Mantener caliente", "Sazonar los pechugas con sal y pimienta negra recién molida. Caliente una sartén de base pesada hasta que esté muy caliente. Agregue una cucharada de aceite a la sartén y luego los pechos, con la piel hacia abajo. Freír durante dos minutos, luego dar vuelta y freír durante dos minutos más. Saque la bandeja del calor sobre una superficie resistente al calor (esto les permitirá descansar y mantenerse calientes).", "Para servir, cortar los senos y colocar las rodajas en la parte superior de la espuma y verter la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedgrousewithsk_9525", "title": "Gallo frito con skirlie y remolacha glaseada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 litros / 2 pintas 13 fl oz de caldo de pollo", "2 coronas de gallina de guinea (el cuerpo principal del ave con las patas y alas retiradas)", "2 ramitas de tomillo fresco", "2 dientes de ajo", "25g / 1oz de mantequilla", "2 cucharadas de aceite de oliva", "750g / 1lb de papas harinas de 10oz (como King Edwards o Maris Piper), peladas y cortadas en trozos", "sal y pimienta negra recién molida", "Repollo Savoy de 300g / 11oz, solo dentro de las hojas, en rodajas finas", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "nuez moscada, recién rallado", "25g / 1oz de mantequilla", "Salchichas de cóctel 300 g / 11oz (chipolatas)", "12 cebollas baby, peladas", "Tocino rayado de 200 g / 7oz, cortado en lardons", "2 ramitas de tomillo fresco", "75ml / 3fl oz de vinagre de jerez", "1 cebolla grande", "6 dientes", "1 hoja de laurel", "450 ml / 1 pinta de leche entera", "200 g / 7 oz de brioche fresco, mezclado en pan rallado", "1 cucharada de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para la gallina de Guinea, coloque el caldo de pollo en una cacerola y agregue la pintada, el tomillo y el ajo. Llevar a ebullición y luego reducir el fuego a fuego lento durante unos 15 minutos, o hasta que las gallinas de guinea estén completamente cocidas.", "Retire la gallina de Guinea del líquido de cocción y seque con papel de cocina. Retire los senos del cadáver y déjelos a un lado. (Puede usar los cadáveres para otro fin, como hacer inventario).", "Calentar una sartén hasta que esté caliente, luego agregar la mantequilla y el aceite de oliva. Agregue las gallinas de Guinea y pan frito en cada lado hasta que estén doradas en ambos lados. Retire y reserve en un lugar cálido.", "Para la burbuja y el chirrido, coloque las papas en una cacerola y cúbralas con agua. Agregue un poco de sal y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos o hasta que esté cocido.", "Drene y devuelva las papas cocidas a la sartén a fuego lento para eliminar el exceso de humedad. Mash las patatas ligeramente y sazone con sal y pimienta negra recién molida.", "Mientras tanto, coloca el repollo Savoy en un recipiente resistente al calor y cúbrelo con agua hirviendo. Déjalo por 1-2 minutos, luego drene y seque con papel de cocina.", "Caliente una sartén hasta que esté caliente, luego agregue el aceite de oliva, las papas y el repollo. Revuelva freír durante 4-5 minutos, hasta que esté crujiente y dorado por todas partes. Sazonar con sal y pimienta negra recién molida y nuez moscada recién rallada.", "Para los chipolatas, caliente una sartén limpia hasta que esté caliente. A continuación, agregue la mantequilla, las salchichas y las cebollas y cocínelas durante 1-2 minutos, hasta que comiencen a dorarse.", "Agregue el tocino lardons y el tomillo y cocine durante 4-5 minutos, hasta que los lardones estén dorados y los chipolatas estén completamente cocidos.", "Agregue el vinagre de jerez y revuelva para eliminar los restos de cocción de la sartén (esto se llama deglazing). Sazonar con sal y pimienta negra recién molida.", "Para la salsa de pan, espárzala con los dientes y luego colócala en una sartén. Agregue la hoja de laurel y la leche y coloque a fuego alto. Llevar a ebullición, luego retirar del fuego y dejar enfriar.", "Retire la cebolla y la hoja de laurel de la leche y agregue las migas de brioche. Vuelva a colocar a fuego muy lento durante 5-10 minutos, revolviendo ocasionalmente hasta que las migas de brioche hayan absorbido todo el líquido.", "Agregue la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, cuchara una burbuja y chirrido en cada plato y cubra cada uno con un pecho de gallina de Guinea. Coloque la mezcla de chipolata al costado, agregue una cucharada de salsa de pan y sirva."], "url": "www_bbc_co_uk_food_recipes_panfriedguineafowlwi_87938", "title": "Gallina de Guinea frita con burbuja y chirrido, chipolatas de lardons y salsa de pan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "100g / 3½ oz de eglefino, sin piel", "1 cucharada de jugo de limón", "sal y pimienta negra recién molida", "1 chile rojo, finamente picado", "4 cucharadas de perejil fresco picado", "½ batata, finamente picada", "2 cucharadas de guisantes frescos", "25g / 1oz de mantequilla"], "method": ["Ponga a hervir una olla de agua con sal.", "Calentar el aceite de oliva en una sartén a fuego medio, agregar el eglefino y freír durante 2-3 minutos en cada lado, o hasta que esté bien cocido.", "Agregue el limón, luego sazone al gusto con la sal y la pimienta negra recién molida. Agregue la guindilla y el perejil y fría por 1-2 minutos.", "Agregue la batata picada al agua hirviendo y cocine durante 5-6 minutos. Agregue los guisantes y cocine durante 1-2 minutos más, o hasta que los guisantes se hayan suavizado pero aún estén firmes, y las papas estén tiernas.", "Escurra las batatas y los guisantes cocidos y agrégalos a la sartén con el eglefino. Agregue la mantequilla y caliente durante 2-3 minutos.", "Para servir, espolvorea el perejil y la salsa de chile sobre un plato para servir y coloca el eglefino encima."], "url": "www_bbc_co_uk_food_recipes_panfriedhaddockwithc_89435", "title": "Eglefino a la sartén picante con batatas y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de halibut 100 g / 3½ oz", "sal y pimienta negra recién molida", "dash aceite de oliva", "2 tomates frescos, cortados por la mitad", "pizca de pimentón", "pizca de curry en polvo", "pellizcar canela molida", "sal y pimienta negra recién molida"], "method": ["Para el halibut, caliente el aceite de oliva en una sartén. Agregue el halibut, sazone con sal y pimienta negra recién molida y fría por 2-3 minutos en cada lado, o hasta que esté bien cocido.", "Para los tomates especiados, caliente el aceite de oliva en una sartén. Coloque los tomates con el lado del corte hacia abajo en la sartén y freír a fuego lento durante 2-3 minutos. Voltee y sazone con especias, sal y pimienta negra recién molida.", "Para servir, coloque los tomates especiados en un plato de servir y cubra con el fletán."], "url": "www_bbc_co_uk_food_recipes_panfriedhalibutonspi_88398", "title": "Fletán frito en tomates especiados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 1kg / 2lb 2 oz, lavados, limpios, barba eliminados (deseche los mejillones que permanecen abiertos después del lavado)", "2 cucharaditas de hojas frescas de tomillo", "250ml / 9fl oz de vino Moscatel, o vino dulce similar", "4 x 175g / 6oz filetes de fletán", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "1 cucharada de aceite de oliva", "3 chalotes, toscamente picados", "1 bulbo de hinojo, aproximadamente picado", "1 puerro pequeño, más o menos picado", "½ cucharadita de curry en polvo", "Setas de castaña de 200g / 7oz, cepilladas, cortadas en cuartos", "25ml / 1fl oz pastis o licor de anís similar", "3 tomates, pelados, sin semillas, picados", "Crema doble 110ml / 4fl oz", "½ cucharadita de hilos de azafrán", "2 cucharadas de perejil fresco de flatleaf", "2 cucharadas de perifollo fresco picado"], "method": ["Caliente una sartén con tapa grande hasta que esté caliente, luego agregue los mejillones, el tomillo y 75 ml / 3 fl oz del vino. Cubra con la tapa y cocine por 2-4 minutos, o hasta que todos los mejillones se hayan abierto. Deseche cualquier mejillón que no se haya abierto.", "Cuele los mejillones sobre un recipiente, reservando el líquido.", "Recoge los mejillones de sus caparazones y ponlos a un lado. Deseche los caparazones vacíos.", "Sazone los filetes de halibut con sal y pimienta negra recién molida.", "Caliente una sartén por separado hasta que esté caliente, agregue la mitad de la mantequilla y todo el aceite de oliva. Cuando la mantequilla esté espumosa, agregue los filetes de fletán y freír durante 2-3 minutos en cada lado, o hasta que estén recién cocidos.", "Mientras tanto, agregue la mantequilla restante a una sartén por separado a fuego medio. Cuando la mantequilla esté espumosa, agregue los chalotes, el hinojo y los puerros y cocine por 2-3 minutos, o hasta que se ablanden.", "Agregue el polvo de curry, los champiñones y los pastis y cocine por 3-4 minutos.", "Agregue los 175ml / 6fl oz restantes del vino Muscat y llévelo a ebullición. Cocine hasta que casi todo el líquido se haya evaporado.", "Retire los filetes de halibut de la sartén en la que se cocinaron. Agregue el líquido de cocción reservado de los mejillones y deje que hierva. Raspe el fondo de la sartén con una cuchara de madera para desglasar la sartén y continúe hirviendo hasta que el líquido se reduzca a la mitad.", "Agregue la salsa a la cacerola de la mezcla de puerro e hinojo.", "Agregue los tomates, la crema, el azafrán y los mejillones cocidos reservados. Cocine por un minuto, condimentar, al gusto, con sal y pimienta negra recién molida.", "Agregue el perejil y el perifollo y mezcle bien.", "Para servir, coloque la mezcla de verduras en cuatro platos y cubra cada uno con un filete de halibut."], "url": "www_bbc_co_uk_food_recipes_panfriedhalibutwithl_89982", "title": "Fletán frito con verduras y mejillones a finales del verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 remolachas crudas enteras", "200ml / 7fl oz de aceite de oliva virgen extra", "1 lima, solo jugo", "75ml / 3fl oz de vinagre de cabernet sauvignon", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "300g / 10½ oz de queso halloumi, rebanadas gruesas", "Alcaparras 50g / 2oz en vinagre, escurridas", "bebé cohete, para servir"], "method": ["Cortar finamente la remolacha en una mandolina y colocarla en un recipiente poco profundo.", "Mezcle el aceite de oliva virgen extra, el jugo de lima y el vinagre, y sazone al gusto con sal y pimienta negra recién molida. Verter la mezcla sobre la remolacha, cubrir y enfriar durante 30 minutos en la nevera.", "Cuando esté listo para servir, caliente el aceite de oliva en una sartén. Sazonar el halloumi con sal y pimienta negra recién molida y freír durante 2-3 minutos en ambos lados, o hasta que se dore por todas partes. Retire de la sartén y escurra sobre papel de cocina.", "Para servir, coloca un anillo de remolacha en cada uno de los cuatro platos para servir, luego completa la remolacha con el halloumi. Espolvorea sobre las alcaparras y cubre cada plato con un pequeño puñado de cohete para bebés."], "url": "www_bbc_co_uk_food_recipes_panfriedhalloumiwith_91547", "title": "Queso halloumi frito con remolacha", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7oz también", "1 huevo, golpeado", "100g / 3½ oz de pan rallado fresco", "2 cucharadas de hierbas frescas mezcladas picadas, (albahaca, perejil, cebollín)", "1 cucharada de aceite de oliva", "2 cucharaditas de aceite de oliva", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "¼ de camote, pelado, finamente picado y hervido hasta que esté suave", "75g / 2½oz Brie, picado", "1 cucharada de crema doble", "sal y pimienta negra recién molida"], "method": ["Calienta el horno a 200C / 400F / Gas 6. Tira el hoki en el huevo batido, luego en las migas de pan y luego en las hierbas picadas mixtas. Pat con las manos para asegurar las hierbas.", "Calentar el aceite de oliva y freír el pescado durante dos minutos por cada lado. Coloque en una bandeja para hornear en el horno y tueste durante cinco minutos o hasta que esté cocido.", "Para hacer la salsa, caliente el aceite, agregue la chalota y el ajo y cocine suavemente durante dos minutos. Agregue la batata y cocine por otro minuto, revolviendo bien. Agregue el Brie y la crema doble, mezcle para combinar y sazone bien. Cocine por dos minutos.", "Para servir, coloque el hoki en un plato y póngalo sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedhokiwithherb_82522", "title": "Hoki frito con corteza de hierbas y salsa Brie y camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla", "2 filetes de John Dory", "100 g / 3½ oz de mantequilla", "1 chalote, finamente picado", "250ml / 9fl oz de vino blanco", "Crema doble de 150 ml / 1/4 de pinta", "1 limón, jugo y ralladura solamente", "sal y pimienta negra recién molida", "200g / 7oz de arroz basmati", "1 chalote, finamente picado", "100ml / 3½fl oz de vino blanco", "100ml / 3½ fl oz crema doble", "1 cucharada de cebolletas frescas picadas", "rodajas de limón"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los filetes de John Dory, caliente la mantequilla en una sartén grande hasta que burbujee. Agregue los pescados y fríalos por cinco minutos en cada lado, o hasta que estén ligeramente dorados y cocidos. Apartar y mantener caliente.", "Para la salsa, caliente la mantequilla en una sartén, agregue la chalota y fríela suavemente durante 1-2 minutos.", "Agregue el vino blanco y cocine a fuego lento hasta que el volumen se reduzca a la mitad.", "Agregue la crema y el zumo y la ralladura de limón y cocine a fuego lento durante 2-3 minutos para que se caliente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el pilaf, hierva el arroz de acuerdo con las instrucciones del paquete, escurra bien y coloque en un recipiente.", "Agregue la chalota, el vino y la crema al arroz y revuelva para combinar. Ponga una cuchara en un plato pequeño a prueba de horno y hornee en el horno durante cinco minutos.", "Para servir, divida el arroz pilaf entre dos platos para servir, cubra con un filete de pescado y vierta sobre la salsa. Adorne con cebolletas picadas y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_panfriedjohndoryfill_87077", "title": "Filetes John Dory fritos en sartén con salsa de chile cítrico y arroz pilaf", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de hojas de menta fresca", "50g / 2oz de hojas frescas de cilantro", "50g / 2oz de hojas de espinaca baby", "10g / ½ oz de jengibre, pelado, más o menos picado", "2 chiles verdes, más o menos picados", "1½ cucharadita de semillas de alholva molida", "2 cucharaditas de chaat masala (un polvo de especias mezclado disponible en algunas tiendas de comestibles asiáticas)", "1 cucharadita de chile rojo en polvo", "½ cucharadita de sal", "2 cucharadas de harina de gramo (garbanzo)", "4 filetes John Dory", "2 cucharadas de jugo de limón", "½ cucharadita de sal", "4 cucharadas de aceite vegetal", "2 cucharadas de mantequilla", "1 cucharada de aceite de oliva", "1 cucharada de cebollas rojas finamente picadas", "¼ cucharadita de semillas de cilantro tostadas, aplastadas", "¼ cucharadita de semillas de comino tostadas, aplastadas", "1 cucharadita de semillas de sésamo negro", "2 manzanas de tamaño mediano Queen Cox (o similar), cortadas en 6x1x1cm / 2½x½x½ en bastones", "1 cucharadita de jugo de lima", "½ cucharadita de curry en polvo", "2 cucharadas de mayonesa", "½ cucharada de chutney de mango finamente picado", "1 cucharada de hojas de menta fresca finamente picadas", "bebé mezclado (micro) berro"], "method": ["Para la pasta de especias verdes, coloque todos los ingredientes de la pasta de especias en un procesador de alimentos y mezcle hasta formar una pasta.", "Para John Dory, marinar el pescado en una mezcla del jugo de limón y la sal durante cinco minutos, para drenar el exceso de humedad.", "Pat el pescado seco y coloque en la pasta de especias verde y marinado durante 40 minutos.", "Calentar una sartén a fuego medio-alto. Agregue el aceite, raspe el adobo en exceso del pescado, luego agregue a la sartén, con la piel hacia abajo. Fría por un minuto, luego gire el filete y fría el otro lado durante dos minutos o hasta que el pescado esté bien cocido. Agregue la mantequilla a la sartén e hilvane el pescado con los jugos, luego retírelo de la sartén y colóquelo en un plato forrado con papel de cocina para remojar el exceso de grasa.", "Para la ensalada de manzana, caliente el aceite de oliva en una sartén pequeña a fuego medio. Agregue las cebollas y fría por 1-2 minutos, para ablandar. Agregue el cilantro, el comino y las semillas de sésamo y fría por un minuto más, luego agregue los bastones de manzana, el jugo de lima y el polvo de curry. Cocine las manzanas por un minuto y luego agregue el chutney de mango picado y la mayonesa. Retirar del fuego y espolvorear sobre la menta picada.", "Para servir, coloque la ensalada de manzana caliente en el medio de un plato calentado, coloque el pescado encima y adorne con berros mixtos (micro)."], "url": "www_bbc_co_uk_food_recipes_panfriedjohndoryingr_85340", "title": "John Dory frito en pasta de especias verdes con ensalada de manzana tibia", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes grandes de John Dory", "sal y pimienta negra recién molida", "Harina normal de 50g / 2oz", "1 cucharada de aceite de oliva", "4 cucharadas de aceite de oliva virgen extra", "2 chalotes grandes, finamente picados", "1 diente de ajo, finamente picado", "2 tomates, semillas retiradas, picadas", "110g / 4oz de camarones marrones cocidos, pelados", "3 cucharadas de estragón fresco picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "3 cucharadas de aceite de colza", "Patatas de 250g / 9oz, peladas y finamente picadas", "sal", "2 cucharadas de perejil de flatleaf fresco picado"], "method": ["Sazonar los filetes de John Dory con sal y pimienta negra recién molida, luego dragar los filetes en la harina en cada lado.", "Calentar el aceite en una sartén hasta que esté caliente. Agregue el pescado, con la piel hacia abajo y cocine en cada lado durante 1-2 minutos, hasta que esté recién cocido. Retire de la sartén y déjelo a un lado para que descanse en un lugar cálido.", "Para la salsa vierge de camarón, caliente el aceite de oliva en una sartén por separado a fuego muy lento. Cuando el aceite esté tibio (pero no demasiado caliente), agregue los chalotes y el ajo y caliente durante un minuto.", "Agregue los tomates y las gambas y caliente durante otros dos minutos.", "Agregue el estragón, el jugo de limón y la sazón, al gusto, con sal y pimienta negra recién molida.", "Para las papas salteadas, caliente una sartén por separado hasta que esté caliente, luego agregue el aceite de colza y las papas. Saltee durante 5-6 minutos, hasta que estén doradas y tiernas. Retire con una espumadera y escurra las papas sobre papel de cocina. Sazonar, al gusto, con sal y espolvorear con el perejil.", "Para servir, coloque el John Dory en el centro del plato, luego cubra con la salsa de gambas vierge. Coloque una cucharada de las papas salteadas al lado."], "url": "www_bbc_co_uk_food_recipes_panfriedjohndorywith_90063", "title": "John Dory frito en sartén con vierge de salsa de langostinos y papas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]