[{"isVegetarian": true, "title": "Mini stollen", "url": "www_bbc_co_uk_food_recipes_mini_stollen_10408", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_stollen_10408_16x9.jpg", "ingredients": ["175g/6oz dried mixed fruits", "50g/2oz glacé cherries, chopped", "50g/2oz almonds, chopped", "2 unwaxed lemons, finely grated zest only", "¼ tsp ground nutmeg", "1 tbsp vanilla extract", "2 tbsp brandy", "375g/13oz strong white bread flour, plus extra for dusting", "1 x 7g/⅛oz sachet fast-action dried yeast", "50g/2oz caster sugar", "1 free-range egg, beaten", "70g/2½oz unsalted butter, melted", "150ml/5fl oz warm milk, plus extra for glazing", "200g/7oz marzipan", "icing sugar, for dusting"], "serves": "Makes 6 loaves", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the dried fruits, cherries, almonds, lemon zest, nutmeg, vanilla extract and brandy together in a bowl. Cover with clingfilm and set aside.", "Put the flour, yeast and sugar in a mixing bowl. Add the egg, 50g/2oz of the melted butter and the milk.  Mix the ingredients together to form a dough, adding a further 1-2 tablespoons of milk if the dough is a little dry.", "Turn the mixture out onto a lightly floured surface and knead for 10 minutes, or until smooth and elastic.  Place in a lightly oiled bowl, cover with oiled clingfilm and leave to rise in a warm place for 1-1¼ hours, until the dough has doubled in size.", "Turn the dough out on to a lightly floured surface. Gradually knead in the fruit mixture until it is evenly distributed through the dough. Cover with a damp tea towel and leave to rest for 20 minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Divide the marzipan into six pieces and roll each one into a 10cm/4in log.", "Knead the dough lightly for one minute. Divide into six pieces and roll each piece out into a rectangle. Place a marzipan log just off centre of each piece of dough, brush the edges with a little milk, then fold the dough over the marzipan and press to seal.", "Arrange the stollen on baking trays, cover loosely with lightly oiled clingfilm and leave in a warm, draught-free place until doubled in size. ", "Bake the stollen, on the middle shelf of the oven for 20-25 minutes, or until risen and golden-brown. Cool on wire racks, then dust liberally with icing sugar."]}, {"isVegetarian": true, "title": "Mini three-way biscuits", "url": "www_bbc_co_uk_food_recipes_mini_three-way_biscuits_95845", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_three-way_biscuits_95845_16x9.jpg", "ingredients": ["175g/6oz butter, softened", "75g/2½oz caster sugar", "175g/6oz plain flour, plus extra for dusting", "75g/2½oz semolina", "50g/1¾oz milk or plain chocolate chips", "1 lemon, finely grated zest only ", "1–2 tbsp demerara sugar", "1 tsp almond extract ", "40g/1½oz flaked almonds"], "serves": "Makes 20 of each variety", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line three baking trays with baking paper. ", "To make the biscuit dough, measure the butter, sugar, flour and semolina into the bowl of an electric food mixer and mix until a soft dough is formed, taking care not to over-beat. Alternatively, add the butter and sugar to a mixing bowl and beat with a wooden spoon until soft and creamy, then stir in the flour and semolina. Divide the dough evenly into three and dust your work surface with flour before kneading each batch.", "For the chocolate chip biscuits, knead the chocolate chips into one portion of dough, shape into 20 balls and arrange, spaced well apart, on one of the baking trays. Press down with the back of a fork into discs about 5cm/2in in diameter and bake in the oven for 10 minutes, or until golden-brown.", "For the lemon biscuits, knead the lemon zest into the second portion of dough. Roll into a long sausage shape (about 20cm/8in long) and roll in the demerara sugar. Wrap in cling film and leave in the freezer for about 30 minutes, or until firm and nearly frozen. Slice into 20 even rounds, each about 1cm/½in thick.  Arrange on a baking tray, spaced well apart, and bake for about 10 minutes, or until pale golden-brown.", "For the almond biscuits, knead the almond extract into the remaining portion of dough, along with most of the flaked almonds. Shape into 20 small balls and arrange on the third baking tray, spaced apart. Place a few almonds on top of each ball of dough and press flat with the back of a fork into discs about 5cm/2in in diameter. Bake for about 10 minutes, or until golden-brown."]}, {"isVegetarian": true, "title": "Mini veggie burgers and salsa", "url": "www_bbc_co_uk_food_recipes_mini_veggie_burgers_and_22803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½ vegetarian mince", "75g/1¾oz cooked, mashed sweet potato", "1 spring onion, sliced", "1 slice bread, grated into breadcrumbs", "1 free-range egg", "2 tbsp olive oil", "10 cherry tomatoes, quartered", "5 basil leaves"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Mix the mince, sweet potato and spring onion, breadcrumbs and egg together in a bowl until well combined.", "Divide the mixture into four equal portions, then roll each portion into a ball and gently squash into a burger shape. Put each burger onto a baking tray and drizzle with a little of the oil.", "Bake in the oven for 18-20 minutes, or until cooked through.", "To make the salsa, mix the tomatoes, basil and remaining oil in a bowl. Season with freshly ground black pepper.", "Serve the burgers wth the salsa spooned alongside."]}, {"isVegetarian": true, "title": "Mini Victoria sandwiches", "url": "www_bbc_co_uk_food_recipes_mini_vicotria_sandwich_38131", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_vicotria_sandwich_38131_16x9.jpg", "ingredients": ["450g/1lb strawberries, chopped", "300g/10½oz jam sugar", "225g/8oz self-raising flour", "4 free-range eggs", "225g/8oz caster sugar", "225g/8oz margarine", "vanilla extract", "250g/9oz icing sugar, plus extra for dusting", "65g/2¼oz butter", "1 tbsp milk"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line two Swiss roll tins with greaseproof paper.", "For the jam, place the strawberries and sugar in a heavy-based saucepan, bring to a boil and cook for 10 minutes. Transfer to a bowl and set aside to cool.", "For the sponge, beat all of the ingredients in a bowl until light and fluffy. Spread the mixture out into a Swiss roll tin, flatten with a palette knife and bake in the oven for 18-20 minutes or until golden-brown and cooked through.", "Carefully turn the sponge cake out onto a wire rack, peel off the paper and set aside to cool.", "For the buttercream, sift the icing sugar into a bowl. Add the butter and milk and beat until smooth. Spoon the buttercream into a piping bag fitted with a small star nozzle.", "Cut 24 x 5cm/2in circles from the sponges, then cut each circle into two sandwich halves. Spread twelve halves with the strawberry jam and pipe on a little buttercream. Sandwich together with the remaining sponge circles. Dust icing sugar over the top of each sandwich."]}, {"isVegetarian": true, "title": "Mini Victoria sponge cakes", "url": "www_bbc_co_uk_food_recipes_mini_victoria_sponge_61310", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_victoria_sponge_61310_16x9.jpg", "ingredients": ["500g/1lb 2oz strawberries, hulled and halved ", "500g/1lb 2oz jam sugar", "175g/6oz unsalted butter, at room temperature, plus extra for greasing", "175g/6oz caster sugar ", "3 large free-range eggs, beaten", "1 tsp vanilla extract", "175g/6oz self-raising flour ", "300ml/10½fl oz double cream ", "icing sugar, for dusting"], "serves": "Makes 12 mini cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, place the strawberries in a large saucepan and crush with a potato masher. ", "Add the jam sugar and heat gently, stirring continuously, until the sugar dissolves. ", "Keep stirring, increasing the heat, bringing it to a full rolling boil, one that bubbles vigorously, rises in the pan and cannot be stirred down. ", "Start timing and boil for four minutes only. Remove from the heat and set aside to cool. ", "For the sponge, preheat the oven to 190C(170C fan)/375F/Gas 5. Lightly grease the tins with butter. ", "To make the cakes, cream the butter and caster sugar together until the mixture is pale and light. Gradually add the beaten eggs, mixing well between each addition and scraping down the sides of the bowl from time to time. Add the vanilla extract and mix to combine. ", "Sift the flour into the bowl and fold in until the mixture is glossy and smooth. ", "Divide the mixture between the mini sandwich tin cups and level with a teaspoon. ", "Bake on the middle shelf of the oven for about 15 minutes until golden-brown and springy to the touch. ", "Leave the cakes to cool in the tin for two minutes and then ease onto a wire cooling rack and leave to cool completely. ", "Whip the cream to soft peaks and spoon into a piping bag fitted with a small plain nozzle. ", "Cut each cake in half horizontally with a bread knife. ", "Pipe one dot of the cream in the middle of each cake base and the rest in dots around the edges. Drizzle the jam over the cream, place the sponge tops on and lightly sift icing sugar over the cakes. "]}, {"isVegetarian": true, "title": "Miniature coffee and walnut cakes", "url": "www_bbc_co_uk_food_recipes_miniature_coffee_and_70008", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["unsalted butter, for greasing ", "75g/2½oz walnut pieces ", "225g/8oz caster sugar ", "225g/8oz unsalted butter ", "175g/6oz plain flour ", "3 tsp instant decaffeinated coffee granules, dissolved in 1 tbsp boiling water ", "2½ tsp baking powder ", "½ tsp bicarbonate of soda ", "4 large free-range eggs ", "4 tsp whole milk ", "500g/1lb 2oz icing sugar", "175g/6oz unsalted butter", "2½ tsp instant decaffeinated coffee, dissolved in enough boiling water to make a smooth paste", "3-4 tsp lustre dust (optional)", "100g/3½oz walnut pieces, crushed  ", "chocolate coffee beans, to decorate (optional)"], "serves": "Makes 18 mini cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sponge, preheat the oven to 170C/325F/Gas 3 and grease and line three 23x33cm/9x13in baking trays with baking parchment.", "For the sponge, put the walnuts and sugar in a food processor and grind to a coarse powder consistency. Transfer to a large bowl or a freestanding mixer. ", "Add butter to the bowl and cream until smooth and light. Sift in the flour and continue to mix.  Add all the remaining ingredients and mix to a smooth consistency. ", "Divide the mixture equally between the prepared tins and smooth the surface. Bake for 10-12 minutes, or until golden-brown and springy to touch. Leave to cool for a few minutes before turning out of the tins onto wire racks. ", "When the cakes are completely cool, cut out 54 circles using a 5cm/2in round cutter. ", "For the filling, sift 350g/12oz icing sugar into a large bowl or a freestanding mixer. Add the butter, half the coffee mixture and the lustre dust and mix until you have a smooth buttercream icing with a soft golden shimmer. Transfer to a piping bag fitted with a plain nozzle. ", "For the topping, mix the remaining coffee paste with four tablespoons of water. Sift the remaining icing sugar into a bowl and stir in the coffee mixture to make glacé icing for the tops of the cakes. If the icing is very thick add more water until the icing runs off a spoon in thick ribbons.", "To assemble the cakes, take a third of the cake circles and pipe coffee buttercream icing on top. Top with another circle of cake and pipe more buttercream on top. Add a final layer of cake and drizzle the glacé icing over. Top with crushed walnut pieces and chocolate coffee beans, if using."]}, {"isVegetarian": true, "title": "Miniature raspberry and basil financiers", "url": "www_bbc_co_uk_food_recipes_miniature_raspberry_and_44358", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz plain flour, sifted", "¼ tsp baking powder", "120g/4¼oz icing sugar, sifted, plus extra for dusting", "45g/1½oz ground almonds", "4 free-range eggs, whites only", "65g/2¼oz butter", "12 basil leaves, finely shredded", "12 - 24 raspberries, cut in half"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/350F/Gas 4. Grease the financier moulds and set onto a baking tray.", "Sift the flour and baking powder into a bowl. Add the icing sugar and ground almonds and stir to mix. ", "Add the egg whites and whisk everything thoroughly for one minute with a wire whisk.", "Heat the butter in a small pan until the solids just start to brown. Tip the butter into the financier mix through a tea strainer.", "Add the finely shredded basil leaves.", "Leave the mixture to rest for 5-10 minutes.", "Transfer the mixture to a piping bag fitted with a 1cm/½in plain nozzle.", "Pipe into the silicone financier moulds, filling them three-quarters full. ", "Place two raspberries (if small) or one (if large) cut into two halves into the basil financiers. ", "Bake for 10-12 minutes until just golden-brown (may need up to 15 minutes to cook).", "Remove from the oven and leave the baked financiers in their moulds for 1-2 minutes before turning out onto a wire rack to finish cooling.", "When cooled, lightly dust the financiers with sifted icing sugar.  "]}, {"isVegetarian": true, "title": "Mini black forest gâteaux", "url": "www_bbc_co_uk_food_recipes_miniblackforestgatea_90437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz unsalted butter, plus extra for greasing", "175g/6oz caster sugar", "6 free-range eggs, separated", "125g/4oz self-raising flour", "75g/2½ cocoa powder", "1 tsp instant coffee powder (or 1 tsp coffee granules dissolved in 1 tsp hot water)", "50ml/2fl oz blackcurrant liqueur", "50g/2oz black cherry jam", "400ml/14fl oz whipping cream", "50g/2oz caster sugar", "25g/1oz icing sugar", "1 vanilla pod, seeds scraped out ", "400g/14oz black cherries in syrup, drained", "50g/2oz dark chocolate (at least 70 per cent cocoa solids), grated"], "serves": "Makes 4 small cakes", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "For the sponges, in a bowl beat the butter and sugar together until pale and fluffy.", "Add the egg yolks and mix well.", "In a separate bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Fold the whisked egg whites into the butter and egg yolk mixture.", "Sift the flour and cocoa powder into the mixture.", "Add the instant coffee and fold the mixture until just combined. ", "Divide the sponge mixture equally between four greased and lined 7.5cm/3in spring-form cake tins.", "Place into the oven and bake for 20-25 minutes. Test the cakes with a metal skewer pushed into the centre of each cake. If the cakes are cooked through the skewer will come out clean. ", "Remove the cakes from the oven and allow to cool. Slice each in half across the centre to create two sponge circles from each cake.", "Drizzle one half of each cake with the blackcurrant liqueur, then spread the jam over the same half.", "Meanwhile whip the cream, caster sugar, icing sugar and vanilla seeds together in a mixing bowl until soft peaks form when the whisk is removed, then fold in half of the cherries.", "Spread a little of the vanilla cream over the jam-covered half of each cake, then place the other half on top.", "Top each cake with more vanilla cream and garnish with the remaining cherries.", "Sprinkle each cake with grated chocolate and serve."]}, {"isVegetarian": true, "title": "Mini cheese and rocket soufflés", "url": "www_bbc_co_uk_food_recipes_minicheeseandrockets_84488", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs, separated", "75g/2½ oz cheddar cheese, grated", "3 tbsp double cream", "handful rocket, chopped", "½ tsp cornflour", "salt and freshly ground black pepper", "2 tbsp chopped chives, plus extra to garnish", "2 tsp butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven, and a baking sheet to 200C/400F/Gas 6.", "Place the egg yolks, cheese, cream, rocket and cornflour into a bowl and mix together. ", "Place the egg whites into a clean bowl and whisk, until the egg whites form stiff, glossy peaks when the whisk is removed.", "Fold the egg white mixture into the egg yolk mixture and season well with salt and freshly ground black pepper.", "Fold one tablespoon of the chopped chives into the egg mixture. ", "Melt a teaspoon of butter in two small omelette pans over a medium heat. Divide the mixture between the two pans.", "Place the pans onto the preheated baking sheet and place into the oven to cook for six minutes, until risen and golden.", "Serve immediately, garnished with the rest of the chopped chives."]}, {"isVegetarian": false, "title": "Mini filo fish pies", "url": "www_bbc_co_uk_food_recipes_minifilofishpie_92714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp vegetable oil", "1 onion, peeled, sliced", "1 garlic clove, crushed to a paste with the edge of a knife", "500g/1lb 2oz assorted fish fillets (such as salmon, whiting, pollack), skin removed, cut into pieces", "125g/5¼oz cooked shrimp or prawns", "75ml/3fl oz white wine", "½ lime, juice and zest", "250g/9oz crème fraîche", "1 tbsp chopped fresh parsley leaves", "1 tbsp wholegrain mustard", "salt and freshly ground black pepper", "2 ripe tomatoes, finely chopped", "4-6 sheets filo pastry", "125g/4½oz butter, melted", "mixed baby salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 6.", "For the filling, heat the oil in frying pan over a medium heat. Add the onion and garlic and fry for 4-6 minutes, or until softened. ", "Add the mixed fish and shrimp or prawns, then pour in the wine and bring to mixture to the boil. Reduce the heat until the mixture is simmering, and continue to simmer for 2-3 minutes.", "Add the lime juice, lime zest, crème fraîche, parsley and mustard, then season, to taste, with salt and freshly ground black pepper. Stir well and simmer for a further 2-3 minutes.", "Divide the filling mixture equally among four small pie dishes or ramekins. Sprinkle over the chopped tomatoes.", "For the topping, scrunch up 1-2 sheets of filo pastry, using your hands, so that the scrunched pastry fits over the ramekin or pie dish. Repeat the process with the remaining sheets of filo pastry. Place one filo pastry 'lid' on top of each pie dish or ramekin. Brush the pastry lids generously all over with melted butter. ", "Place the pies onto a baking tray and cook in the oven for 10-12 minutes, or until the pastry is crisp and golden-brown and the filling is bubbling.", "Serve the individual pies on plate with a portion of baby salad leaves alongside."]}, {"isVegetarian": false, "title": "Mini ham and egg pies", "url": "www_bbc_co_uk_food_recipes_minihamandeggpies_71267", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil or butter", "12 slices good quality ham", "12 large eggs", "2 tbsp cream", "sea salt", "freshly ground black pepper", "2 tbsp roughly chopped parsley", "4 tbsp grated parmesan"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4. ", "Lightly oil or butter a 12 hole muffin tray. Line the base and most of the sides of each mould with a slice of ham, then break an egg into the hollow. ", "Drizzle with the cream, and scatter with sea salt, pepper, parsley and parmesan.", "Bake for 15-20 minutes until the egg is just set and starting to shrink away from the sides of the tin. ", "Leave to cool for five minutes, then run a knife around each mould to loosen the ham and egg, and remove to a wire tray. Eat warm, or at room temperature.", "Serve with a handful of herb and baby leaf salad."]}, {"isVegetarian": false, "title": "Mini fry-up", "url": "www_bbc_co_uk_food_recipes_minifryup_90126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ Portobello mushroom", "½ red onion, sliced into thick rings", "½ vine tomato", "2 rashers smoked bacon", "2 quails' eggs", "2 slices white bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and fry the mushroom and red onion for 5-6 minutes, or until browned. In the same pan, fry the tomato half and the bacon for 3-4 minutes, or until the bacon is crisp, then add the quails' eggs and cook to your liking. ", "Serve the mushrooms and onions on the toast, with the tomato, bacon and eggs on top."]}, {"isVegetarian": true, "title": "Mini pitta bread pizzas", "url": "www_bbc_co_uk_food_recipes_minipittabreadpizzas_90715", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed", "1 tomato, seeds removed, chopped", "4 tbsp tomato ketchup", "3 mini pitta breads, split in half horizontally", "½ yellow pepper, seeds removed, cut into strips", "½ red pepper, seeds removed, cut into strips", "55g/2oz Manchego cheese, sliced", "1 handful iceberg lettuce, shredded, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the olive oil in a pan and fry the onion and garlic for 2-3 minutes, or until softened. Stir in the tomato and ketchup and simmer for 3-4 minutes, or until reduced slightly. ", "Spread the tomato mixture onto one side of the pitta halves, arrange the pepper strips on top and lay over the cheese. Transfer to a baking sheet and bake in the oven for 3-4 minutes, or until the cheese starts to melt.", "Serve the pitta bread pizzas on a serving plate alongside the shredded iceberg lettuce."]}, {"isVegetarian": true, "title": "Mini primavera flatbread 'pizzas'", "url": "www_bbc_co_uk_food_recipes_miniprimaveraflatbre_91325", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["120-125ml/3½-4fl oz warm water", "1 tbsp dried fast-action yeast", "½ tbsp caster sugar", "1 tbsp olive oil", "150g/5½oz '00' type flour, plus extra for dusting", "1 tbsp salt", "25g/1oz polenta", "150g/5½oz peas, blanched in boiling water, drained", "150g/5½oz broad beans, blanched in boiling water, drained, pods removed, skins removed", "pinch freshly ground black pepper", "200g/7oz pecorino cheese, crumbled", "squeeze lemon juice", "225g/8oz cream cheese", "5 asparagus spears, grilled, cut in half lengthways", "100g/3½oz pea shoots", "small bunch fresh mint leaves", "drizzle extra virgin olive oil, to serve"], "serves": "Makes 10 mini pizzas", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the flatbread 'pizza' bases, in a large bowl, mix together the water, yeast, sugar and olive oil until well combined. ", "In a separate bowl, mix together the flour, salt and polenta until well combined. ", "Add the wet ingredients to the dry ingredients and mix to combine. Knead until the mixture comes together as a dough, then set aside to rest for 30 minutes.", "When the dough has rested and risen slightly, knock it back on a lightly floured work surface. Divide the dough into ten equal portions, each about the size of a golf ball. ", "Roll the dough balls out onto a lightly floured work surface, one at a time, until 10-12cm/4-5in in diameter and 3mm thick (they should resemble flatbread). ", "Heat a griddle pan over a high heat. Add the flatbread 'pizza' bases to the griddle pan in batches. Cook for 1-2 minutes on each side, or until the flatbreads are cooked through and have golden-brown griddle marks on both sides. Remove from the pan and set aside to cool slightly. Repeat the process with the remaining flatbread 'pizza' bases.", "For the topping, blend the blanched peas and broad beans, black pepper, pecorino and lemon juice to a rough paste in a pestle and mortar. ", "Spread a layer of cream cheese over each flatbread base, then spread over a layer of the pea and bean paste. Lay one of the asparagus halves onto each base, then arrange the pea shoots and mint leaves around it. Drizzle over a dash of olive oil.", "Transfer the mini primavera flatbread 'pizzas' to serving plates and serve immediately."]}, {"isVegetarian": false, "title": "Mini pitta pizzas", "url": "www_bbc_co_uk_food_recipes_minipizzas_85388", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz tinned tomatoes, drained and chopped", "salt and freshly ground black pepper", "3 mini-pitta breads", "55g/2oz Jarlsberg cheese, grated", "2 Polish Kabanos sausages, sliced", "olive oil, for drizzling", "small handful fresh basil, chopped, to serve"], "serves": "Makes 3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the tomatoes with salt and freshly ground black pepper and spread over the pitta breads. Sprinkle over the cheese and sliced sausage.", "Drizzle each mini pizza with a little olive oil and place onto a non-stick baking sheet. Transfer to the oven and bake for 6-8 minutes, or until the cheese is melted and golden-brown.", "To serve, place the mini pizzas onto plates and sprinkle over the basil."]}, {"isVegetarian": false, "title": "Mini smoked salmon and dill cakes", "url": "www_bbc_co_uk_food_recipes_minismokedsalmonandd_68058", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/minismokedsalmonandd_68058_16x9.jpg", "ingredients": ["250g/9oz floury potatoes, such as maris piper, desirée or king edward, cut into large chunks", "2 tbsp cream cheese", "200g/7oz smoked salmon", "2 tbsp roughly chopped fresh dill ", "1 lemon, zest only, finely grated", "1 tsp horseradish sauce ", "1 tbsp drained capers, chopped (optional)", "salt and freshly ground black pepper", "4 heaped tbsp fresh breadcrumbs", "olive oil"], "serves": "Makes 16", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Boil the potatoes in unsalted water for about 20 minutes until tender. There's no need to add salt to the water as the smoked salmon will provide the required saltiness. Drain, leave to cool for a couple of minutes, allowing the steam to evaporate, and then mash with the cream cheese until smooth.", "Chop the smoked salmon and mix with the mashed potatoes, dill, lemon zest, horseradish and capers, if using, and season with salt and pepper. Shape into walnut-sized balls and flatten gently. Lightly coat each one with the breadcrumbs and place on an oiled baking sheet. Either cook straight away or refrigerate until needed.", "To cook, drizzle over a little olive oil and bake in the oven for 10-12 minutes, turning after 5 minutes or until golden."]}, {"isVegetarian": true, "title": "Mini Victoria sponge cakes", "url": "www_bbc_co_uk_food_recipes_minivictoriaspongeca_88683", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, unsalted, plus extra for greasing ", "225g/8oz caster sugar", "4 free-range eggs", "225g/8oz self-raising flour", "90g/3oz butter", "1 vanilla pod, split, seeds scraped out", "175g/6oz icing sugar, sifted", "150g/5oz raspberries", "75g/2½oz raspberry jam"], "serves": "Makes 3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4. Grease and line six 7.5cm/2in x 10cm/3in spring-sided cake tins with baking parchment.", "For the cake, place the butter and sugar into a bowl and beat together until pale and fluffy.", "Add the eggs, one at a time, beating well to combine before adding the next.", "Add the flour and mix well. ", "Divide the cake batter among the six cake tins and place into the oven to bake for 25-30 minutes. Test by pushing a metal skewer into the centre of the cake; if it comes out clean the cakes are ready.", "Remove from the oven and when cool enough to handle, remove from the tins and leave to cool on a wire rack.", "For the filling, place the butter, vanilla seeds and sugar into a clean bowl and beat together until thick.", "To serve, spread the raspberry jam onto three of the cakes. Top the jam layer with raspberries, then then add a dollop of buttercream topping to each.", "Place one of the remaining cakes on top of each of the layered cakes and dust generously with icing sugar."]}, {"isVegetarian": false, "title": "Mini Yorkshire puddings with roast beef and horseradish cream", "url": "www_bbc_co_uk_food_recipes_miniyorkshirepudding_11253", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/miniyorkshirepudding_11253_16x9.jpg", "ingredients": ["1 egg", "85g/3oz plain flour", "85ml/3fl oz milk and water mixed", "vegetable oil", "1 tub crème fraîche", "2 tbsp fresh horseradish", "salt and pepper", "2-3 beef fillets (depending on size)", "flat leaf parsley, to garnish"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the Yorkshire puddings, gently add the egg to the flour. Slowly add the water and milk to the mix, stirring continuously to keep it smooth.", "Put a few drops of oil into each small muffin tray and put into a medium hot oven to heat. When the tray is hot, pour 2.5cm/1in of mixture into each space and replace in the oven. Cook for about 8-10 minutes until the mixture has puffed up. Then cool on a cooling rack.", "To make the horseradish cream, simply mix all the ingredients together.", "Cook fillet of beef rare (or more done if you prefer), slice thinly and arrange on the baby Yorkshire puddings. Add a dollop of horseradish cream and decorate with a sprig of flat leaf parsley."]}, {"isVegetarian": true, "title": "Mint chocolate cremosa, raspberry purée, chocolate soil and dressed raspberries", "url": "www_bbc_co_uk_food_recipes_mint_chocolate_cremosa_95030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750ml/1⅓ pint full-fat milk ", "250ml/9fl oz double cream ", "40g/1½oz fresh mint", "420g/15oz dark chocolate (70% cocoa solids) ", "240g/8½oz egg yolks ", "100g/3½oz caster sugar ", "250g/9oz raspberries", "50g/1¾oz icing sugar ", "1 tsp vanilla extract ", "50g/1¾oz caster sugar ", "50g/1¾oz ground almonds ", "30g/1oz plain ﬂour ", "25g/1oz cocoa powder ", "3g table salt ", "35g/1oz salted butter, melted and cooled", "1 punnets fresh raspberries", "4 basil leaves, chopped ", "4 mint leaves, chopped ", "1 tbsp raspberry vinegar or balsamic vinegar", "2 tbsp icing sugar ", "black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the mint chocolate cremosa, in a large saucepan bring the milk, cream and mint to a boil. Remove from the heat and set aside to infuse for 15 minutes.", "Bring a saucepan of water to the boil and place a heatproof bowl over the top (do not allow the bowl to touch the water). Add the chocolate. When melted, remove from the heat.", "In a large bowl, whisk the egg yolks and sugar together until pale and ﬂuffy. Pour half the milk infusion over the yolk mix and whisk to fully incorporate. Add the remaining milk mixture and whisk together. Transfer to a large saucepan and gently heat until it reaches 82C or is thick enough to coat the back of a wooden spoon.", "Pour 1 litre of the custard into a measuring jug and pour this onto the melted chocolate, whisking all the time until incorporated. Cover the surface with cling film to prevent a skin forming and place in the fridge for 4 hours to set. ", "For the raspberry purée, wash and dry the raspberries then place 250g/9oz in a medium saucepan with the icing sugar, vanilla and 2 tablespoons water. Place over a medium heat and bring to a simmer, stirring frequently. When the raspberries are soft, remove from the heat and transfer to a blender. Blend until smooth, then pass through a sieve. Reserve in fridge until needed.", "For the chocolate soil, preheat the oven to 160C/140C Fan/Gas 3.", "Sieve the sugar, almonds, ﬂour, cocoa powder and salt together into the bowl of a freestanding mixer. Add the melted butter and mix on a low-medium speed for 3-4 minutes, or until smooth.", "Spread the mixture on to a baking tray lined with non-stick paper. Bake for 15 minutes. Remove from the oven and leave to cool completely.", "Once completely cooled, blend to a ﬁne crumb in a food processor. Store in an air tight container and use within 2 weeks.", "For the dressed raspberries, mix all the ingredients together.", "To serve, drizzle some of the raspberry sauce onto a serving plate and top with a quenelle of the cremosa. Garnish with the dressed raspberries and chocolate soil."]}, {"isVegetarian": true, "title": "Mint chocolate sablés", "url": "www_bbc_co_uk_food_recipes_mint_chocolate_sabls_03965", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mint_chocolate_sabls_03965_16x9.jpg", "ingredients": ["275g/9¾oz plain flour", "40g/1½oz cocoa powder", "¾ tsp bicarbonate of soda", "½ tsp flaked sea salt", "200g/7oz unsalted butter, softened and diced", "50g/1¾oz caster sugar", "200g/7oz light brown sugar", "½ tsp vanilla extract", "85g/3oz dark chocolate (60–70% cocoa solids), finely chopped", "40g/1½oz mint-flavoured candy cane, roughly crushed", "250g/9oz dark chocolate (60–70% cocoa solids)", "3-4 mint-flavoured candy canes, crushed to a coarse powder, to sprinkle (optional)"], "serves": "Makes about 40 biscuits", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, sift the flour, cocoa and bicarbonate of soda into a medium bowl. Grind in the salt and stir. Set aside.", "Put the butter in large mixing bowl and, using an electric mixer, beat until smooth and light. Add the sugars and vanilla extract, and beat for 2 minutes, or until smooth. Add the dry ingredients to the bowl and mix until the dough looks sandy (which is what sablé means in English). ", "Add the chocolate and candy cane to the bowl, then mix. The dough should look almost like soil; it should not have formed into one large ball. If mixed for too long the biscuits will be tough.", "Tip out the dough onto a work surface and gently press together. Divide in half and roll into two logs, about 4cm/1½in thick. Wrap each log in cling film and chill for 3 hours, or until firm. (Alternatively, wrap the second log in brown paper and tie the ends up. Freeze the dough for baking at a later date.)", "Preheat the oven to 180C/160C Fan/Gas 4. Line three baking trays with baking paper.", "Using a thin, sharp knife, cut the logs into rounds about 1cm/½in thick. Put the biscuits onto the baking trays, leaving 2cm/¾in between each one. Bake for 10–12 minutes, or until set on the outside but soft in the centre.", "Leave the biscuits to cool on the trays for 10 minutes, then transfer to a wire rack to cool completely.", "To decorate, line a baking tray with baking paper. Temper or melt the chocolate. Dip each biscuit halfway into the chocolate, allowing the excess to drip off. Put onto the prepared baking trays and sprinkle with a little crushed candy cane. Leave to set. The biscuits will keep for up to a week stored in an airtight container."]}, {"isVegetarian": true, "title": "Mint lemonade", "url": "www_bbc_co_uk_food_recipes_mint_lemonade_67943", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mint_lemonade_67943_16x9.jpg", "ingredients": ["large handful fresh mint, leaves picked", "6 lemons, juice and zest of 3", "3 tbsp sugar cane syrup", "sparkling mineral water, to top up"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mint leaves into a tea towel and bruise with a rolling pin. ", "Add the mint to a pitcher, with the lemon juice and zest and sugar cane syrup.", "Top up with sparkling water. Mix the cocktail well and add more sugar cane syrup, to taste.", "Chill in the fridge."]}, {"isVegetarian": false, "title": "Mint-stuffed lamb shoulder with boulangère potatoes and mint sauce", "url": "www_bbc_co_uk_food_recipes_mint_stuffed_lamb_33581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter ", "75g/2½oz onion, finely chopped", "2 garlic cloves, finely chopped", "10g finely chopped mint leaves", "25g/1oz clarified butter", "100g/3½oz lamb mince", "25g/1oz  fresh white breadcrumbs", "100g/3½oz toasted peeled hazelnuts, roughly chopped", "1 lemon, zest only", "1 x 2.5kg /2lb 12oz shoulder of lamb, boned out", "6 potatoes, peeled and thinly sliced", "4 onions, thinly sliced", "salt and freshly ground black pepper", "100g/3½oz unsalted butter", "350ml/12fl oz chicken or lamb stock", "1 large bunch fresh mint, leaves picked, finely chopped", "75ml/2½fl oz malt vinegar", "25g/1oz caster sugar", "250ml/9fl oz lamb jus or gravy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mint-stuffed lamb shoulder, preheat the oven to 170C/340F/Gas 3½.", "Heat a frying pan and add the butter. Once hot, add the onion and garlic and cook for 3-4 minutes until soft.", "Put the onion and garlic in a bowl and allow to cool, then add the rest of the ingredients, apart from the lamb shoulder, and mix together to make stuffing.", "Place the lamb shoulder on a board and spread the mint stuffing inside the lamb. Roll up and tie with kitchen string.", "Place the lamb directly on the rack in the oven and cook for one hour while you prepare the potatoes.", "For the boulangère potatoes, mix the potatoes and onions in a bowl and season with salt and pepper.", "Use the butter to cover the bottom of a deep baking tin. Layer the potatoes and onions on top and pour over the stock. ", "Put the roasting tin on a low shelf in the oven and place the lamb directly on the shelf immediately above - so that the juices will drip onto the potatoes. ", "Cook the lamb and potatoes for another two hours.", "For the mint sauce, put the chopped mint into a small bowl.", "Heat the vinegar and sugar in a saucepan until simmering and pour the mixture onto the mint. Stir until well combined.", "To serve, carve the lamb shoulder and place on a plate. Serve the potatoes alongside and pour over the mint sauce and lamb jus or gravy."]}, {"isVegetarian": false, "title": "Minted lamb pasties", "url": "www_bbc_co_uk_food_recipes_minted_lamb_pasties_54960", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz salted butter, chilled and cut into 1cm/½in cubes", "75g/2½oz lard, chilled and cut into 1cm/½in cubes", "200g/7oz plain flour, sifted, plus extra for dusting", "½ tsp salt", "1 tsp lemon juice ", "1 large free-range egg, beaten, for egg wash ", "bunch of fresh mint, leaves picked", "pinch table salt ", "1 tbsp caster sugar", "50ml/2fl oz white wine vinegar", "100g/3½oz lamb leg steak, diced into 1.5cm/⅝in cubes ", "1 garlic clove, crushed", "½ tsp dried rosemary ", "salt and freshly ground black pepper ", "½ large red onion, finely chopped", "½ large sweet potato, chopped into small cubes", "1 medium carrot, chopped into small cubes", "½ bunch fresh flatleaf parsley, leaves picked and chopped", "½ tsp dried oregano", "50g/2oz frozen peas, defrosted"], "serves": "Makes 6 pasties", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the rough puff pastry, put the butter and lard in a bowl and briefly mix. Put the flour and salt in a large mixing bowl and, using your fingertips, briefly rub about a quarter of the butter and lard mixture into the flour (you should still see lumps of butter). ", "Add 50ml/2¾ fl oz cold water and the lemon juice and mix until it comes together to form a dough. Roughly shape the dough into a rectangle.", "On a lightly floured work surface, roll out the dough into a rectangle about the thickness of a pound coin. With a short end of the rectangle facing you, scatter the remaining lard and butter over the top two thirds of the dough. Fold the bottom third over the butter, then fold the top third down. Rotate the dough 90 degrees, then roll out the dough into a rectangle as before and repeat the folding. Turn, roll and fold the dough another two times, then wrap in cling film and refrigerate for 20 minutes.", "For the mint sauce, sprinkle the mint leaves with a little salt and finely chop. Transfer to a jug and pour over about 100ml/3½fl oz boiling water. Add the sugar, stir well and leave to cool. When cooled, stir in the white wine vinegar.", "For the rough puff pastry, take the cooled pastry from the fridge and repeat the rolling and folding one more time, then return it to the fridge for another 20 minutes.", "For the filling, in a medium bowl combine the lamb, garlic and dried rosemary. Add half of the mint sauce and season with salt and pepper. Cover with cling film and set aside.", "Add the onion, sweet potato, carrots, parsley and oregano to a separate bowl. Add the rest of the mint sauce, season with salt and pepper and mix well. Finally add the frozen peas and mix again.", "Preheat the oven to 180C/350F/Gas 4 and line two large baking trays with baking parchment.  ", "Roll out the pastry to about 3mm thickness.  Cut out 6 circles, approximately 13cm/5in in diameter using a small saucer or bowl as a guide. Any offcuts can be rolled out again to make more circles. ", "Put a few spoonfuls of the vegetable filling to one side of each circle and top with a few pieces of lamb – you need enough to fill the pastry but not so full that the pastry will split open. Fold the pastry over the filling (to encase the filling) and use a little water to help the edges of the pastry stick. Crimp the edges using your fingers and place on a baking tray.  Repeat until each baking sheet has six pasties on them.  ", "Brush each pasty with beaten egg and bake for about 40 minutes, or until golden-brown. When cooked, use a fish slice to lift the pasties onto wire racks to cool before serving."]}, {"isVegetarian": true, "title": "Feta, rocket and olive pasta salad", "url": "www_bbc_co_uk_food_recipes_mintedfetarocketando_67597", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mintedfetarocketando_67597_16x9.jpg", "ingredients": ["350g/12oz penne, rigatoni or other similar shaped pasta", "8-10 large sprigs of mint, leaves removed, and chopped/torn if large", "150g/5oz frozen peas ", "200g/7oz feta cheese, crumbled", "50g/2oz bag of rocket leaves ", "1 lemon, grated zest and juice ", "flaked sea salt and freshly ground black pepper", "extra virgin olive oil", "20-30 good-quality marinated green olives, pitted"], "serves": "6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in boiling salted water with 2 sprigs of the mint for the time given on the packet. 3 minutes before the end of the cooking time, add the peas. Once the pasta and peas are cooked, drain in a colander and shake under cold running water until cool. Discard the mint sprigs.", "Transfer to a large bowl and add the feta cheese, rocket, remaining mint, the lemon zest and half the juice, salt and pepper and a good glug of olive oil. Either roughly chop or smash the olives in a pestle and mortar and add to the pasta. Toss well and add more lemon juice, seasoning or olive oil, if preferred. ", "Pack in suitable containers for taking on a picnic or serve warm as part of a main course or starter with a barbecue."]}, {"isVegetarian": true, "title": "Minted pea soup", "url": "www_bbc_co_uk_food_recipes_mintedpeasoup_92883", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, peeled, chopped", "500ml/18fl oz chicken or vegetable stock", "85g/3oz frozen peas", "3 tbsp double cream", "3 tbsp chopped fresh mint", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat and gently fry the onion for 2-3 minutes, or until softened. Pour in the stock and bring to the boil.", "Add the peas and cook for 2-3 minutes. Stir in the cream and two tablespoons of the mint, then blend until smooth using a hand-held blender. Season, to taste, with salt and freshly ground black pepper.", "Serve the soup in a bowl, garnished with the remaining chopped mint and the parsley."]}]