[{"ingredients": ["Harina normal de 200g / 7oz", "40g / 1½oz de harina blanca fuerte", "50g / 1¾oz de mantequilla", "1 cucharadita de sal", "60 g / 2¼ oz de manteca de cerdo", "1 huevo de gallinas camperas, batido, para lavar huevos", "1 kg / 2 lb 4 oz de carne de caza (como pechuga de faisán, paloma, pato o carne de venado magra), en cubitos", "500g / 1lb 2oz de carne de salchicha", "Hígados de pollo a 200 g / 7 oz, finamente picados", "2 puñados de pan rallado blanco", "1 huevo de gallinas camperas, golpeado", "3 cucharadas de perejil fresco picado", "algunas ramitas de tomillo fresco, hojas recogidas", "2 dientes de ajo picados", "splash brandy", "salpicaduras de vino tinto", "50g / 1¾oz de mantequilla", "8 chalotes de plátano, rebanados en anillos", "75g / 2½ oz de azúcar moreno oscuro", "2 ramitas de tomillo fresco, hojas recogidas", "200ml / 7fl oz de vinagre balsámico"], "method": ["Para la masa de la masa de agua caliente, combine las harinas en un tazón grande para mezclar, luego frote la mantequilla con las yemas de los dedos.", "Mezcle 130ml / 4¼fl oz de agua hirviendo con la sal y la manteca de cerdo en una olla pequeña. Calienta suavemente hasta que la manteca se derrita, revolviendo todo el tiempo para combinar.", "Vierta la mezcla de manteca de cerdo y agua sobre la mezcla de harina, revolviendo con una cuchara hasta que todo se una para formar una masa suave.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y junte para formar una bola. Deje reposar durante aproximadamente 10 minutos hasta que esté lo suficientemente frío como para manipularlo.", "Tome un tercio de la masa, envuélvala en una película adhesiva y transfiérala a la nevera para enfriarla. Alinee un molde de terrina con papel de hornear. Estirar la pieza más grande de pasta para adaptarse al molde de terrina. Coloque la masa en el papel de hornear y use las manos para tirar de la masa por los lados, de manera que alinee el molde hacia arriba. Coloque en la nevera durante 20 minutos.", "Para la terrina del juego, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Ponga todos los ingredientes en un bol y mezcle para combinar.", "Estirar el tercio reservado de la masa para formar la tapa del pastel y dejar de lado.", "Llene el molde de terrina refrigerada con el relleno del juego y coloque la parte superior de la repostería en el pastel. Engarce alrededor de los lados, para sellar completamente. Cepille la tapa del pastel con la colada de huevo.", "Hornea por 1-1¼ horas.", "Para la salsa picante de chalota, coloque la mantequilla en una sartén grande y caliente hasta que se derrita. Agregue los chalotes, cubra y cocine a fuego lento hasta que los chalotes se hayan suavizado y se hayan caramelizado.", "Agregue el azúcar, el tomillo y el vinagre y cocine por otros 10 minutos.", "Para servir, corta unas rebanadas del pastel de terrina del juego y sírvelo con la tostada de melba y la salsa picante de chalote."], "url": "www_bbc_co_uk_food_recipes_hot_water_crust_game_pie_28965", "title": "Pastel de pastel de agua caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de harina de pan blanco fuerte", "50 g / 1¾oz de harina de sémola de trigo duro", "6 g de levadura fresca", "¼ cucharadita de azúcar en polvo", "90ml / 3fl oz de agua tibia", "450g / 1lb de harina de pan blanco, más extra para espolvorear", "Harina de sémola de trigo duro 450g / 1lb", "2½ cucharadita de sal", "475ml / 17fl oz de agua tibia", "150g / 5½oz de hojas de cohete", "gran manojo de albahaca fresca, solo hojas", "1 diente de ajo, pelado", "50 g / 1¾oz de queso parmesano, rallado", "125ml / 4½fl oz de aceite de oliva virgen extra", "50g / 1¾oz de piñones, tostados", "rebanadas de baguette (ver arriba)", "3 bolas de mozzarella, escurridas y en rodajas finas", "150g / 5½oz de jamón serrano rebanado", "pimienta negra recién molida"], "method": ["Para la esponja de pan, en un recipiente, mezcle las harinas, la levadura y el azúcar hasta que estén bien combinados. Batir en el agua para formar una masa espesa, luego cubrir y reservar para fermentar durante 1 ½ horas.", "Para el pan, cuando la esponja de pan ha fermentado, raspe la esponja de pan en una batidora independiente equipada con un gancho de masa. Agregue la harina, harina de sémola y sal, luego encienda la máquina (cubra el recipiente si es posible).", "Vierta 300ml / 10½fl oz del agua, agregando el agua restante poco a poco una vez que la mezcla se haya unido como una masa suave.", "Extienda la masa de pan en una superficie de trabajo ligeramente enharinada y amase durante unos minutos hasta que quede suave y elástica, luego vuelva a colocar la masa en el bol, cúbralo con una película engrasada y déjelo a un lado durante 1½ horas.", "Elimine la masa golpeando el aire varias veces, luego divida la masa por la mitad. Amasar cada mitad ligeramente y luego enrollar ambos en forma de baguette con extremos puntiagudos.", "Transfiera las baguettes a una bandeja para hornear y haga varias barras en la parte superior de cada una con un cuchillo afilado. Coloque las baguettes a un lado para probar nuevamente durante 1 hora.", "Cuando las baguettes hayan sido probadas, precaliente el horno a 220C / 200C Fan / Gas 7. Hornee el pan en el horno por 45 minutos, luego déjelo enfriar antes de cortarlo.", "Para el sándwich enlatado en caliente, reduzca la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una lata de pan de 1 kg / 2 libras y 4 onzas con papel de aluminio engrasado (el lado engrasado debe mirar hacia arriba).", "Mezcle tres cuartas partes del cohete, la mitad de la albahaca y todo el ajo, el queso parmesano y el aceite de oliva hasta conseguir una consistencia suave pero granulosa en un procesador de alimentos, o póngalo en una maza y mortero. Agregue los piñones y sazone, al gusto, con pimienta negra recién molida, luego mezcle o machaque el pesto nuevamente hasta que estén bien combinados.", "Extienda dos rebanadas de baguette con pesto, luego llene este sándwich con una capa de hojas de rúcula, hojas de albahaca, mozzarella y jamón serrano. Repite el proceso con el pan restante y los rellenos.", "Empaque los sándwiches bien apretados en la lata de hogaza preparada, luego doble la lámina sobre la parte superior para que los sándwiches queden completamente encerrados en la lámina.", "Cocine los sándwiches en el horno durante 25-30 minutos, o hasta que el queso se haya derretido y los sándwiches estén completamente calientes.", "Desenvuelva los sándwiches y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hot_tinned_sandwiches_58874", "title": "Sándwiches enlatados calientes con jamón serrano, mozzarella, rúcula y pesto", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 plátanos, pelados y partidos por la mitad", "4 higos, cortados a la mitad", "30g / 1oz de mantequilla, derretida", "4 hojas de pasta filo", "azúcar en polvo", "4 cucharadas de helado de vainilla", "4 cucharadas de miel", "menta fresca, para adornar"], "method": ["Primero, corte cada hoja de hojaldre por la mitad y superpóngalas una encima de la otra.", "Cepille la masa de filo con la mantequilla derretida y agregue una bola de helado de vainilla en el centro.", "Agrupe el filo para hacer un paquete, espolvoree con azúcar glas y colóquelo en un horno precalentado a 220 C / 425 F / Gas 7 durante 2-3 minutos.", "Mientras las parcelas de filo se cocinan, precaliente una sartén de plancha y cepille los plátanos y los higos con un poco de mantequilla.", "Planche las bananas e higos en ambos lados y cuando estén cocidos, colóquelos en un plato.", "Retire las parcelas del horno y sirva en el lado del plato. Rocíe con la miel, un poco más de azúcar en polvo y adorne con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_hotandcoldicecreamwi_65667", "title": "Helado frío y caliente con higos y plátanos a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15 chiles chile de árbol, lavados, tallos y semillas removidos", "4 chiles guajillo, lavados, tallos y semillas removidos", "3 dientes de ajo", "2 tomates, descuartizados", "80ml / 1¾oz de vinagre de sidra", "½ cucharadita de comino molido", "4 bayas de pimienta de Jamaica, molidas (o una buena pizca de pimienta molida)", "1 cucharadita de orégano seco", "1 cucharadita de sal", "1 cucharada de azúcar moreno claro"], "method": ["Tueste los chiles en una sartén a fuego alto durante unos minutos hasta que estén fragantes. Coloque los chiles en una olla, agregue el ajo y 700 ml / 1¼ de agua. Llevar a ebullición y cocine a fuego lento durante 15 minutos. Retirar del fuego y dejar enfriar. (PRECAUCIÓN: cocine en un área bien ventilada).", "Coloque los chiles, el ajo y 250ml / 9fl oz de chile en el procesador de alimentos. Agregue los tomates, el vinagre, el comino, la pimienta de Jamaica, el orégano, la sal y el azúcar y mezcle hasta que esté completamente suave. Si todavía es de textura gruesa, cuela la salsa a través de un colador.", "Vierta la salsa en una olla limpia y cocine durante 5-7 minutos a fuego medio-alto hasta que se haya reducido y espesado ligeramente.", "Embudo en una botella de vidrio esterilizado o frasco y sello. Se mantendrá durante aproximadamente 3 meses en la nevera."], "url": "www_bbc_co_uk_food_recipes_hot_red_chilli_sauce_44104", "title": "Salsa de chile rojo caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 400ml / 14fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_red_chilli_sauce_44104_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["16 grandes gambas de tigre crudas", "4 limas, cáscara y jugo solamente", "2 chiles rojos, cortados en cubitos", "1 pieza de tamaño jengibre jengibre, rallado", "3 cucharadas de aceite vegetal", "1 cabeza pak choi, triturada", "pequeño racimo de cilantro", "1 cucharadita de aceite de sésamo", "50g / 1¾oz de maní, picado", "Fideos de huevo 100g / 3½ oz, cocidos, enfriados y engrasados", "sal y pimienta negra recién molida", "3 chiles, cortados en tiras", "2 cucharadas de salsa de chile dulce", "2 maracuyá, solo jugo"], "method": ["Separe las gambas por el medio y colóquelas, con la parte partida hacia arriba, en un tazón.", "Pique dos de los chiles y la mitad del jengibre. Agregue la mitad del aceite vegetal al chile picado y al jengibre. Vierta esto sobre las gambas y mezcle bien.", "Coloque las gambas cortadas hacia abajo en una sartén caliente. Gire las gambas después de dos minutos. En este punto, vierta la mitad del jugo de limón y la ralladura sobre ellos y déjelos cocinar por otros dos minutos.", "Mientras tanto, prepara la ensalada de fideos. Agregue el pak choi rallado, el cilantro, el aceite de sésamo, un chorrito de aceite vegetal, el jugo de lima restante (reservando una cucharadita) y la ralladura y los cacahuetes a los fideos cocidos.", "Corta el jengibre y los chiles restantes en tiras finas y agrégalos a los fideos. Sazone al gusto.", "Para la salsa de inmersión, mezcle dos cucharadas de salsa de chile dulce con el jugo de maracuyá y una cucharadita de jugo de limón.", "Servir en una fuente grande, con los fideos en un extremo y una pila de gambas en el otro, con la salsa de inmersión en un plato pequeño en el medio."], "url": "www_bbc_co_uk_food_recipes_hotandsourprawnswith_72269", "title": "Gambas agridulces con ensalada de fideos asiáticos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de hojaldre", "16 manzanas de Cox", "azúcar glas", "2 vainas de vainilla", "250g / 9oz de mantequilla sin sal"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Primero tendrá que desplegar la masa de hojaldre. Tenga cuidado al hacer esto, ya que tiene un alto contenido de grasa que hace que sea difícil trabajar con él, si está demasiado caliente. Si compra hojaldre congelado, lo mejor es descongelarlo durante la noche en el refrigerador el día antes de usarlo.", "Estire la masa de hojaldre aproximadamente 3 mm / 1 / 8pulg. De grosor y con un cortador de 12 cm / 4½ pulgadas o cortando alrededor de un plato, corte 4 círculos. Coloque directamente sobre la bandeja de hornear y déjela reposar durante 10 minutos en la nevera.", "Con un pelador, pele las manzanas y córtelas por la mitad de arriba a abajo. Retire el núcleo y luego corte las manzanas finamente.", "Retire la masa de la nevera y, con un tenedor, pinche la superficie.", "Coloque una compota de manzana en el centro y ventile la manzana alrededor de la base de tarta, luego termine colocando algunas rebanadas en el medio de la tarta.", "Para la mantequilla de vainilla, simplemente raspe las semillas de las vainas de vainilla reservadas y luego mezcle con 150 g / 5 oz de mantequilla sin sal ablandada.", "Con un pincel de pastelería, ligeramente mantequilla las manzanas y luego espolvorear ligeramente con azúcar.", "Coloque en el horno precalentado durante 10 minutos, retire y cepille con la mantequilla de vainilla y coloque de nuevo en el horno durante 8-10 minutos más.", "Retire del horno, cepille con mantequilla y déjelo reposar por 10 minutos.", "Sirve con crema cuajada."], "url": "www_bbc_co_uk_food_recipes_hotappletartwithvani_11370", "title": "Tarta de manzana caliente", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "Pechuga de pato de 100 g / 3½ onzas, sin piel, en rodajas", "sal y pimienta negra recién molida", "¼ de cebolla roja, en rodajas", "½ chile rojo, picado", "300ml / 10½fl oz de caldo de pollo caliente", "1 cucharadita de miel", "1 lima, solo jugo", "1 cucharada de salsa de soja", "55g / 2oz de guisantes frescos, fuera de sus vainas", "Fideos de huevo de 55 g / 2 oz, cocinados de acuerdo con las instrucciones del paquete", "ramitas de cilantro fresco, para adornar"], "method": ["Caliente una pizca de aceite de oliva en una cacerola, agregue las rodajas de pato, sazone con sal y pimienta negra recién molida y fríe durante 3-4 minutos, o hasta que estén doradas por todas partes. Retire de la sartén y déjela a un lado, luego agregue la cebolla a la sartén y fría por 2-3 minutos, o hasta que esté blanda pero no coloreada.", "Vuelva a agregar el pato en la sartén y mezcle el chile, el caldo de pollo, la miel, el jugo de lima y la salsa de soja, reduzca el fuego y cocine a fuego lento durante cinco minutos o hasta que el pato esté bien cocido. Agregue los guisantes y los fideos cocidos y caliente durante 1-2 minutos, o hasta que los guisantes estén tiernos.", "Para servir, vierta la sopa en un recipiente para servir y decore con las ramitas de cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_hotandsourduckbroth_89148", "title": "Caldo de pato agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 lonchas de tocino, picadas", "2 chalotes, finamente cortados en cubitos", "2 tomates pelados, cortados en cubitos", "1 cucharada de miel mostaza granulada (o mezcle un poco de miel con mostaza granulada)", "175ml / 6fl oz de aceite de oliva virgen extra", "Jugo de limón 40ml / 1½fl oz", "2 cucharadas de cebollines cortados", "sal", "pimienta negra recién molida", "2 aguacates pelados rebanados por la mitad"], "method": ["Freír el tocino hasta que esté crujiente y luego agregar las chalotas y el tomate a la sartén y cocinar por cinco minutos.", "Agregue la miel de mostaza, el aceite de oliva virgen extra, el jugo de limón, el cebollín y el condimento.", "Revuelva bien y, mientras aún está caliente, vierta sobre las mitades de aguacate.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hotbacondressing_71744", "title": "Aderezo de tocino caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1x400g puede corazones de alcachofas, drenados, trozos gruesos", "250ml / 9fl oz de mayonesa", "140g / 5oz de parmesano fresco, rallado", "2 chiles verdes, sin semillas y picados", "chips de tortilla simples, para recoger"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "En un tazón, mezcle las alcachofas, la mayonesa, el queso y los chiles. Extiéndalo en un plato para hornear ancho en una capa de no más de 2 cm de grosor.", "Hornee la mezcla hasta que esté burbujeante y dorada, aproximadamente 15 minutos. Sirve con chips de tortilla para servir."], "url": "www_bbc_co_uk_food_recipes_hotartichokesin_67912", "title": "Hot artichoke sin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fideos de hilo de frijol 110g / 4oz (transparentes)", "1 cucharada de aceite de maní (maní)", "3 cucharadas de cebolla tierna, finamente picada", "2 cucharadas de ajo, finamente picado", "450 g / 1 lb de carne picada", "455ml / 16flo oz de caldo de pollo", "1½ cucharada de salsa de frijoles", "1 cucharada de salsa de frijoles enteros", "2 cucharadas de salsa de soja ligera", "2 cucharaditas de salsa de soja oscura", "½ cucharadita de sal", "½ cucharadita de pimienta negra recién molida", "2 cucharaditas de aceite de sésamo", "2 cucharaditas de cebollas de primavera, picado grueso"], "method": ["Remoje los fideos en un tazón grande de agua tibia durante 15 minutos. Cuando drene suavemente y deseche el agua. Cortar en longitudes de 7.5cm / 2in con tijeras o un cuchillo.", "Caliente un wok o una sartén grande hasta que esté muy caliente. Agregue el aceite y cuando esté muy caliente y ligeramente humeante, agregue las cebollas tiernas y el ajo y saltee durante 15 segundos. Agregue la carne y saltee durante 8 minutos o hasta que esté cocida.", "Agregue todos los ingredientes de la salsa, excepto el aceite de sésamo, y cocine a fuego lento durante aproximadamente 5 minutos. Ahora agregue los fideos drenados y el aceite de sésamo y cocine por otros 5 minutos o hasta que la mayoría del líquido se haya evaporado. Vierte los fideos en cuencos individuales, decora con las cebolletas y sirve a la vez."], "url": "www_bbc_co_uk_food_recipes_hotbeefandbeanthread_67794", "title": "Fideos calientes de carne de res y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["70g / 2½ oz de pan blanco fresco", "Pollo picado de 500 g / 17½ oz", "6 lonchas de tocino rayado, finamente picadas", "1 limón, ralladura y jugo", "6 ramitas de tomillo fresco, solo hojas, más o menos picadas", "3 cucharadas colmadas de queso parmesano recién rallado", "sal y pimienta negra recién molida", "1-2 cucharadas de aceite de oliva", "mayonesa", "Hojas de lechuga"], "method": ["Coloque el pan rallado, el pollo y el tocino picado en un tazón. Rallar la ralladura de limón con el pollo y el tocino, luego reducir a la mitad y exprimir el limón. Agregue el jugo de limón a la mezcla con las hojas de tomillo toscamente picadas. Sugerencia en el parmesano rallado. Sazone la mezcla con un poco de sal, luego más generosamente con pimienta negra. Mezcle bien.", "Forme la mezcla en bolitas o hamburguesas. Caliente el aceite de oliva en una sartén antiadherente. Fría en el aceite, alrededor de ocho a la vez, durante 4-5 minutos hasta que estén crujientes y doradas por todos lados. Baje el fuego y déjelo cocer hasta el medio, unos 6-8 minutos más. Tiendo a convertirlos no más de una o dos veces durante la cocción para que tengan un exterior crujiente y ligeramente pegajoso.", "Retire las tortas de la sartén y coloque sobre hojas de lechuga crujientes grandes, agregue una cucharada de mayonesa y envuelva los pasteles en las hojas."], "url": "www_bbc_co_uk_food_recipes_hotchickencakeswithh_92226", "title": "Tortas de pollo calientes con lechuga y mayonesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hotchickencakeswithh_92226_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ berenjena, reducido a la mitad longitudinalmente", "pizca de sal", "4 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "½ cucharadita de copos de chile", "Pechuga de pollo 100 g / 3½ oz, picada", "2 tomates de vid, sin semillas y picados", "2 cucharadas de perejil fresco picado", "2 rebanadas de pan de ciabatta", "½ limón, solo ralladura", "1 cucharada de cebolletas frescas picadas, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las mitades de berenjena en una bandeja para hornear y anote el lado cortado de la carne con la punta de un cuchillo afilado. Sazone con una pizca de sal, rocíe sobre una cucharada de aceite de oliva, y colóquelo en el horno para asar durante 15-20 minutos, o hasta que comience a ablandarse.", "Retire la berenjena del horno, saque la pulpa del centro y corte. Calentar otra cucharada de aceite de oliva en una sartén y freír ligeramente la carne picada de berenjena, luego agregar el ajo, los copos de chile, el pollo y el tomate. Freír durante 5-6 minutos, o hasta que el pollo esté bien cocido. Agregue el perejil picado.", "Rocíe el aceite de oliva restante sobre el pan ciabatta y ase a la parrilla durante 2-3 minutos en ambos lados, o hasta que el pan esté tostado por todos lados.", "Ponga la mezcla de pollo, berenjena y tomate sobre el pan tostado y adorne con la ralladura de limón y el cebollino picado."], "url": "www_bbc_co_uk_food_recipes_hotbruschettawithchi_89108", "title": "Bruschetta caliente con pollo, berenjena y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de chile", "1 cucharada de chile en polvo caliente", "1 cucharada de pimentón", "una pizca de azúcar", "ralladura y jugo de 1 lima", "4 pechugas de pollo", "4 tomates grandes, sin semillas y finamente cortados en cubitos", "1 chile rojo, finamente picado", "Zumo de 1 lima", "1 cebolla roja pequeña finamente picada", "2 aguacates medianos maduros, apedreados, pelados y finamente cortados en cubitos", "2 cucharadas de aceite de oliva", "120g / 8 cucharadas de cilantro recién picado", "sal y pimienta", "4-8 tortillas medianas de harina, calentadas", "1 pequeña lechuga iceberg, rallada", "Crema agria 150ml / ¼pt", "8 pinchos de bambú, empapados en agua durante la noche"], "method": ["Mezcle el aceite de chile, pimentón, chile en polvo, azúcar y el jugo de limón y la ralladura. Corta cada pechuga de pollo longitudinalmente en seis tiras. Agregar a la pasta de chile, cubrir y dejar macerar durante 1-2 horas.", "Mientras tanto, prepara la salsa de tomate y aguacate. Coloque todos los ingredientes en un tazón grande y revuelva suavemente para combinar. Sazonar con sal y pimienta y colocar en un tazón para servir.", "Calienta una barbacoa o una sartén de plancha acanalada.", "Pase tres pedazos de pollo por cada brocheta, colóquelos en la barbacoa o en la sartén y cocínelos durante 3-4 minutos por cada lado hasta que el pollo esté bien cocido.", "Coloque los pinchos de pollo en un plato para servir y dele la salsa de tomate y aguacate, las tortillas calentadas, la lechuga y la crema agria y permita que cada persona ensamble las fajitas."], "url": "www_bbc_co_uk_food_recipes_hotchillichickenfaji_6908", "title": "Fajitas de pollo picante", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 vaina de vainilla, división y semillas raspadas", "1 ramita de canela", "1 litro / 1¾ pintas de leche", "150g / 5½oz de chocolate puro, picado en trozos pequeños", "azúcar al gusto", "nuez moscada recién rallada, para quitar el polvo"], "method": ["Caliente la vaina de vainilla y las semillas, la ramita de canela y la leche en una cacerola hasta que hierva.", "Retire la sartén del fuego y agregue las piezas de chocolate, revolviendo hasta que el chocolate se derrita.", "Batir el chocolate caliente vigorosamente hasta obtener espuma en la parte superior y agregar azúcar, al gusto. Sirve con un poco de nuez moscada."], "url": "www_bbc_co_uk_food_recipes_hotchocolate_81425", "title": "Chocolate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hotchocolate_81425_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "3 cucharadas de agua", "30g / 1oz de cacao", "1½ cucharadas de agua hirviendo", "3 cucharadas de miel clara", "55 g / 2 oz de harina", "55 g / 2 oz de mantequilla, derretida", "1 clara de huevo de granja, ligeramente batida", "Azúcar en polvo de 110 g / 4 oz", "½ cucharadita de extracto de vainilla", "papel de hornear antiadherente", "15 g / ½ oz de harina", "15g / ½ oz de harina de maíz", "Azúcar en polvo de 55 g / 2 oz", "1 yema de huevo de gallinas camperas", "55g / 2oz de chocolate, derretido y enfriado", "3 claras de huevo, batidas hasta formar picos", "30 g / 1 oz de nueces de macadamia", "mantequilla para engrasar", "ramita de menta, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Prepare una bandeja para hornear forrándola con papel de hornear antiadherente.", "Para el azúcar hilado, caliente el azúcar y el agua en una cacerola limpia a fuego medio, sin remover, hasta que el azúcar se disuelva.", "Aumente el fuego y hierva rápidamente hasta que el azúcar disuelto se espese y se oscurezca en color.", "Con cuidado sumerja un tenedor engrasado en el azúcar líquido caliente y déjelo pasar sobre una cuchara de madera engrasada para crear finas hebras de azúcar. (NB: Cubra las superficies circundantes con periódico de antemano ya que el azúcar se puede dispersar).", "Para el glaseado de chocolate, coloque el cacao y el agua en un tazón y combine para hacer una pasta. Usando un cuchillo de paleta, extiende una fina capa sobre un plato para servir.", "Talla los diseños en el borde de la pasta de chocolate, con un tenedor mientras aún está ligeramente suave, luego déjalo reposar. Una vez que esté listo, use un pincel de pastelería para glasear con miel.", "Coloque los ingredientes de vainilla tuille en un tazón y mezcle. Con un cuchillo, extiende tiras finas sobre un trozo de papel de hornear antiadherente en la bandeja para hornear, colócalo en el horno y hornea de cinco a ocho minutos, hasta que se dore alrededor de los bordes. Retire inmediatamente y doble cuidadosamente cada tuille alrededor de un rodillo para darle forma. Dejar enfriar.", "Engrase el interior de los anillos de dos cocineros con mantequilla y colóquelos en una bandeja para hornear engrasada.", "Para el fondant, coloque la harina, harina de maíz, azúcar en polvo, yema de huevo y chocolate en un procesador de alimentos y mezcle hasta que se combinen.", "Transfiera la mezcla de chocolate a un recipiente y doble suavemente las claras de huevo y rellene los dos anillos de los cocineros engrasados.", "Coloque las nueces de macadamia encima de cada pasta de azúcar, transfiéralas a una bandeja para hornear y colóquelas en el horno para que se cocinen durante 8-10 minutos, hasta que estén doradas y cocidas por fuera, pero aún moqueando en el centro.", "Levante con cuidado los anillos de los cocineros y deje que se enfríe un poco. Coloque sobre la placa de glaseado de chocolate.", "Coloque la doille de vainilla doblada y el azúcar hilado encima.", "Para servir, decorar con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_hotchocolateandmacad_84378", "title": "Fondant de chocolate caliente y macadamia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla, más extra para engrasar", "Harina normal de 30g / 1oz", "100ml / 3½ fl oz de leche", "1 yema de huevo de gallinas camperas", "55g / 2oz de chocolate, derretido", "2 cucharadas de jarabe de arce, más extra para servir", "3 claras de huevo de gallinas camperas, batidas hasta que se forman picos rígidos cuando se retira el batidor", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque una bandeja para hornear en el horno para precalentar.", "Engrase dos moldes con mantequilla y reserve.", "Derrita la mantequilla en una cacerola pequeña a fuego medio. Agregue la harina y revuelva para formar una pasta espesa o roux. Cocine por un minuto y luego retírelo del fuego.", "Poco a poco agregue la leche, batiendo continuamente, hasta que se forme una salsa espesa y suave.", "Mezcle la yema de huevo, el chocolate y el jarabe de arce en un recipiente aparte.", "Poco a poco agregue la salsa blanca a la mezcla de chocolate, revolviendo constantemente.", "Con cuidado, doblar las claras de huevo en la mezcla de chocolate, luego llene los dos moldes con la mezcla de soufflé. Pase una manija de miniatura o cucharilla por el borde interior de los moldes.", "Coloque los moldes en la bandeja para hornear precalentada y hornee durante 8-10 minutos, hasta que los soufflés hayan subido.", "Para servir, coloca cada soufflé en el centro de un plato, espolvorea con azúcar glas y rocía con jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_hotchocolatesoufflew_84539", "title": "Soufflé de chocolate caliente con jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de crema doble", "½ naranja, jugo y ralladura finamente rallada", "250 g / 8 oz de chocolate puro, finamente picado", "Azúcar en polvo de 90 g / 3 oz o azúcar de vainilla", "4 yemas de huevo", "6 claras de huevo", "pizca de sal", "azúcar en polvo, para quitar el polvo", "mantequilla sin sal", "azúcar glas", "crema batida", "Grand Marnier"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Unte con mantequilla 6 platos o moldes de soufflé pequeños, resistentes al horno, cada uno lo suficientemente grande como para tomar 200-300ml (1/3-½ pinta) y polvo con azúcar en polvo.", "Ponga la crema, la ralladura de naranja y el jugo en una cacerola lo suficientemente grande como para tomar el chocolate y deje que hierva.", "Incline el chocolate, luego retire el fuego y revuelva hasta que se derrita.", "Ahora agregue el azúcar y luego las yemas de huevo, una a la vez.", "Batir las claras de huevo con la sal hasta que estén tieso. Dobla en la salsa de chocolate.", "Vierta en los platos de soufflé preparados, luego deslícelos directamente al congelador (cubierto con film transparente) o al horno caliente.", "Hornee durante 15-20 minutos (para descongelar) o 20-25 minutos (para congelar) hasta que estén bien elevados.", "Polvo con azúcar glasé y servir a la vez con un poco de crema batida, mezclado con algunas salpicaduras de Grand Marnier."], "url": "www_bbc_co_uk_food_recipes_hotchocolateandorang_73216", "title": "Soufflé de chocolate caliente y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 200g / 7oz", "1 cucharada de azúcar glas", "2 huevos de gallinas camperas", "150ml / 5fl de leche en oz", "25g / 1oz de mantequilla", "150ml / 5fl oz de crema doble", "1 cucharada de azúcar glas", "2 cucharadas de aguardiente", "55 g / 2 oz de chocolate negro, derretido, para servir"], "method": ["Tamiza la harina y el azúcar glas juntos en un tazón grande y agrieta los huevos. Mezcle bien, usando un batidor, mientras vierte lentamente en la leche hasta que la mezcla se convierta en un batido suave, la consistencia de la crema doble - es posible que no necesite toda la leche.", "Derrita la mantequilla en una sartén y vierta un cucharón de la mezcla, agitando la sartén para cubrir la superficie de manera uniforme. Freír por un minuto hasta que estén doradas por un lado, luego dar vuelta y freír por otro minuto hasta que estén doradas por ambos lados. Repita hasta que haya agotado toda la masa.", "En un tazón, batir la crema junto con el azúcar glas y el brandy hasta que se formen picos suaves cuando se quite el batidor del tazón.", "Para servir, doble el panqueque en cuartos y rocíe sobre el chocolate derretido. Vierta la crema de brandy batida en un lado y sirva."], "url": "www_bbc_co_uk_food_recipes_hotchocolatedrizzlep_88840", "title": "Crepe de chocolate caliente con crema de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 yemas de huevo de gallinas camperas", "2 huevos de gallinas camperas", "150 g / 5 oz de azúcar en polvo", "300ml / ½ pinta de leche entera", "Crema doble de 300 ml / ½ pinta", "1 vaina de vainilla, partido, semillas raspadas", "75 g / 2½ oz de mantequilla", "8 bollos cruzados calientes listos para usar, cortados a la mitad", "Sultanas de 25g / 1oz", "25 g / 1oz de pasas", "25g / 1 oz de azúcar demerara"], "method": ["Para la crema pastelera, mezcle las yemas de huevo, los huevos enteros y el azúcar en un bol.", "Coloque la leche, la crema y la vaina de vainilla y las semillas en una sartén a fuego lento y lentamente cocine a fuego lento. Retire del fuego y retire la vaina de vainilla.", "Vierta la leche y la crema en la mezcla de huevo y mezcle bien.", "Unte con mantequilla los bollos cruzados calientes, luego corte en cuartos.", "Coloque una capa de los panecillos cruzados calientes en un plato a prueba de horno de 22cm / 9in x 10cm / 4in, 5cm / 2in.", "Espolvoree con pasas y pasas y el azúcar demerara. Repita las capas y termine con una capa final de bollos.", "Vierta la crema sobre los panecillos y deje reposar durante 20 minutos.", "Precalentar el horno a 180C / 355F / Gas 4.", "Coloque el plato en una bandeja de asar honda y agregue suficiente agua a la bandeja para llegar un tercio del camino hacia arriba del plato (esto es un baño María). Cubra con papel de aluminio.", "Coloque con cuidado el pudín y el baño maría en el horno y hornee durante 20-30 minutos, o hasta que la crema se haya solidificado. Retire la lámina durante los últimos cinco minutos de cocción para dorar la parte superior.", "Sirve el budín con crema o mascarpone."], "url": "www_bbc_co_uk_food_recipes_hotcrossbunandbakedc_85970", "title": "Pan de bollo crujiente y pudín de mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hotcrossbunandbakedc_85970_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["625g / 1.3lb de harina blanca fuerte, más extra para quitar el polvo", "1 cucharadita de sal", "2 cucharaditas de especias mixtas molidas", "45 g / 1.5 oz de mantequilla sin sal, cortada en cubos, más extra para engrasar", "85g / 3 oz de azúcar", "1 limón, ralladura solamente", "1½ cucharadita de levadura de acción rápida", "1 huevo de gallinas camperas", "275ml / 10fl oz de leche tibia", "125g / 4oz de fruta seca mixta", "2 cucharadas de harina normal", "aceite vegetal, para engrasar", "1 cucharada de sirope dorado, suavemente calentado, para glasear"], "method": ["Para los bollos, tamice la harina, la sal y la tierra mezclada en un tazón grande, luego frote la mantequilla con las puntas de los dedos. Haga un bien en el centro de la mezcla, luego agregue el azúcar y la ralladura de limón y la levadura.", "Batir el huevo y agregar a la harina con la leche tibia. Mezclar para formar una masa suave y flexible.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada. Con cuidado, mezcle la fruta seca en la masa hasta que esté bien combinada. Amasar ligeramente durante 5 minutos o hasta que quede suave y elástico.", "Engrase un bol grande y tibio con mantequilla. Forme la masa en forma de bola y colóquela en el recipiente preparado, luego cúbrala con una toalla de té limpia y déjela en un lugar cálido durante una hora para probarla.", "Ponga la masa probada en una superficie de trabajo ligeramente enharinada y derriba la masa. Dale forma a una pelota otra vez y regrésala al tazón, luego cúbrela nuevamente con la toalla de té y déjala a un lado por otros 30 minutos para que se levante.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y divídala en 12 piezas iguales. Haga rodar cada pieza en forma de bola, luego aplaste ligeramente en forma de bollo con las palmas de sus manos. Cubra los bollos de nuevo con la toalla de té y déjelos a un lado para que descanse de 5 a 10 minutos.", "Engrase una bandeja para hornear con mantequilla y transfiera los panecillos a la bandeja. Envuelva la bandeja con los bollos sin apretar en papel resistente a la grasa, luego coloque dentro de una bolsa grande de polietileno. Ate el extremo de la bolsa con fuerza para que no entre aire y se guarde en un lugar cálido durante otros 40 minutos.", "Precalentar el horno a 240C / 475F / Gas 8.", "Mientras tanto, para el relleno, mezcle la harina común en una pasta suave con 2 cucharadas de agua fría.", "Cuando los panecillos hayan salido, retire la bolsa de polietileno y el papel antigrasa. Vierta la mezcla de harina en una manga pastelera y coloque una cruz en cada panecillo.", "Transfiera los bollos al horno y hornee por 8-12 minutos, o hasta que estén pálidos dorados. Tan pronto como retire los panecillos del horno, frótelos con el jarabe dorado caliente, luego déjelos a un lado para que se enfríen en una rejilla."], "url": "www_bbc_co_uk_food_recipes_hotcrossbuns_397", "title": "Bollos cruzados calientes", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hotcrossbuns_397_16x9.jpg", "isVegetarian": true, "recommendations": 0}]