[{"isVegetarian": true, "title": "Mushroom omelette", "url": "www_bbc_co_uk_food_recipes_mushroomomelette_79134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "100g/1¾oz  mixed mushrooms", "2 eggs, beaten", "salt and freshly ground black pepper", "3 tbsp butter", "100g/1¾ enoki mushrooms"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In small non stick frying pan melt the butter and add the mushrooms. Cook for three minutes until soft.", "Add the egg and season. Cook on a low heat for 4-5 minutes until the egg is cooked.", "Turn out onto a plate upside down. ", "To make the topping, melt the butter in a small pan, add the mushrooms and cook for four minutes until soft and golden. ", "Serve on top of the omelette."]}, {"isVegetarian": false, "title": "Mushroom pancake mamon", "url": "www_bbc_co_uk_food_recipes_mushroompancakemamon_83638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "1 free-range egg yolk", "110g/4oz flour", "300ml/10½fl oz milk", "1 tbsp sunflower oil (for pancake mix)", "extra sunflower oil (for cooking)", "olive oil", "½ onion, finely sliced", "60g/2oz smoked bacon, finely chopped", "sprig fresh thyme", "200g/7oz field mushrooms, halved and sliced", "200g/7oz Stilton", "25g/1oz unsalted butter", "2 free-range egg yolks", "salt and freshly ground black pepper", "2 tbsp double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, place the egg and egg yolk and flour into a bowl and mix together to form a paste.", "Gradually whisk in the milk, and the tablespoon of sunflower oil to form a smooth batter.", "Heat a non-stick frying pan. Add a small amount of sunflower oil, swill round to coat the base of the pan and tip out the excess.", "Pour some of the pancake mixture into centre of the pan and tip the pan in a circular motion to thinly coat the base. Cook the pancake until it sets, and turns a light golden colour. Turn the pancake over with a palette knife, and cook the other side for another minute, or until golden.", "Tip out onto a plate and cover with a damp tea towel to prevent the pancake from drying out while you cook the rest of the pancakes.", "For the mushroom filling, preheat the grill to its highest setting.", "Heat a frying pan until hot, then add the olive oil, onion, bacon and thyme and fry for 3-4 minutes.", "Add the mushrooms and cook for a further 1-2 minutes.", "For the blue cheese glaze, place all the ingredients in a food processor and blend to form a smooth paste.", "To finish, lay a pancake flat onto a clean flat surface. Spoon the mushroom mixture into the centre and top with a spoonful of cream. Roll the pancake up, like a cigar, then place into a serving dish, and repeat with the second pancake.", "Spoon the Stilton glaze over the pancakes, and place under the hot grill to cook until the blue cheese glaze is melted and golden brown.", "Serve in the dish at the table."]}, {"isVegetarian": false, "title": "Mushroom ravioli with a white wine, spinach and tarragon cream sauce", "url": "www_bbc_co_uk_food_recipes_mushroomravioliwitha_92175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz '00' flour, plus extra for dusting", "3 free-range egg yolks, lightly beaten", "¼ tsp salt ", "1 tbsp olive oil ", "1 tbsp water", "1 tbsp olive oil ", "100g/3½oz chestnut mushrooms, cleaned and finely chopped ", "1 onion, peeled, finely chopped", "1 garlic clove, peeled, finely chopped", "1 tsp fresh picked thyme leaves", "100g/3½oz skinless, boneless chicken breast, chopped", "1 free-range egg", "30ml/1½fl oz double cream", "pinch grated nutmeg ", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 onion, peeled, finely chopped", "2 shallots", "1 clove garlic, finely chopped", "125ml/4½fl oz white wine", "150ml/5fl oz double cream", "1 tsp chopped fresh tarragon leaves", "1 tbsp butter", "spinach", "pinch grated nutmeg"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pasta dough, tip the flour and salt into a large mixing bowl and make a well in the middle. Add some of the beaten egg yolks, all of the olive oil and the water and slowly mix the ingredients together, adding more beaten egg as necessary to make a smooth dough (you may not need all of the egg). ", "Shape the dough into a ball and turn out onto a floured work surface. Knead the dough for 10-15 minutes, or until smooth and elastic. Shape into a ball, cover with cling film and leave to rest in the fridge for one hour. ", "For the filling, heat the olive oil in a pan and fry the onion and garlic over a medium-low heat for 8-10 minutes, or until softened and golden-brown. Add the mushrooms and the thyme and fry for a further 2-3 minutes, or until the mushrooms are tender. Transfer the mixture to a bowl and set aside until needed. ", "Place three-quarters of the chopped chicken breast meat into a food processor along with the egg and cream and blend until smooth to make a mousse. Add the chicken mousse to the bowl with the mushrooms and remaining chopped chicken and mix well to combine. Set aside.", "Remove the pasta dough from the fridge and divide into four equal pieces. Cover the other three pieces with a clean, damp tea towel and dust the fourth piece in flour. ", "Flour the pasta machine. Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before, until the dough has reached the desired thickness (about 1-2mm thick). Repeat with the remaining dough until you have four sheets of thin pasta. ", "Lay one sheet of pasta on a floured work surface and place spoonfuls of the filling on top, ensuring there is at least an inch of space between and around each spoonful. Lay a second sheet of pasta on top and seal the edges, making sure that there are no air bubbles trapped in between the layers. Cut out the individual ravioli with a pasta wheel. Place on a floured tray, cover and refrigerate until ready to cook. Repeat with the remaining sheets of pasta and the filling until all are used up. ", "For the sauce, heat the olive oil in a pan and fry the onion for 10-15 minutes, or until softened and golden-brown. Season with salt and freshly ground black pepper, add the chopped shallots, garlic and wine and cook for 3-4 minutes, or until some of the alcohol has evaporated. Stir in the cream and add the tarragon, then remove from the heat. ", "For the spinach, melt the butter in a pan until foaming, then add the spinach and fry for 1-2 minutes, or until wilted. Season with salt and a pinch of nutmeg. ", "To cook the pasta, bring a large pan of salted water to just below the boil and gently cook the ravioli, in batches, for 4-5 minutes with the lid on the pan, until the pasta is al dente. Drain.", "To serve, spoon the spinach into serving bowls and place the ravioli on top. Spoon over the sauce."]}, {"isVegetarian": true, "title": "Classic mushroom risotto", "url": "www_bbc_co_uk_food_recipes_mushroomrisotto_85882", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter, plus a knob extra", "3 shallots, chopped", "1 garlic clove, chopped", "350g/12oz Arborio rice", "175ml/6fl oz white wine", "600ml/1 pint 1½fl oz hot vegetable stock", "150g/5oz mushrooms, chopped", "30g/1oz freshly grated parmesan, or a similar vegetarian hard cheese", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a pan over a medium heat. Add the shallots and garlic and fry until softened but not coloured.", "Add the rice, stir well and cook for 1-2 minutes, or until the rice is slightly translucent.", "Add the white wine and stir well until the wine is almost completely absorbed.", "Add a ladleful of stock and allow the rice to absorb this liquid, stirring constantly. Add further ladlefuls of stock, stirring and allowing the rice to absorb almost all of the stock before adding the each ladleful.", "Once all the stock has been added and absorbed, add the mushrooms and stir well.", "Once the rice is cooked, but slightly al dente, add an extra knob of butter and the parmesan and stir well.", "Season, to taste, with salt and freshly ground black pepper, then spoon into warmed dishes and serve immediately."]}, {"isVegetarian": true, "title": "Mushroom salad", "url": "www_bbc_co_uk_food_recipes_mushroomsalad_73189", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz mixed, wild mushrooms (e.g. porcini, chanterelles, hedgehog, wood blewits)", "1 litre/35¼fl oz water", "2 large lemons, juice only", "salt (preferably sea salt)", "6 tbsp extra virgin olive oil", "2 garlic cloves, finely chopped", "handful of flatleaf parsley, finely chopped ", "10 large black or green olives, sliced", "lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mushrooms with a cloth or brush (do not wash them or the flavour disappears).", "Roughly chop any large mushrooms and leave the smaller ones intact.", "Put the water, lemon juice and some salt into a saucepan.", "Bring to the boil and add the mushrooms.", "Simmer for approximately four minutes.", "Meanwhile, in a bowl, combine the olive oil, garlic, parsley and olives.", "Drain the mushrooms and add immediately to the olive oil marinade.", "Mix well, check for seasoning and leave to cool.", "Serve with lemon wedges."]}, {"isVegetarian": true, "title": "Mushrooms on toast", "url": "www_bbc_co_uk_food_recipes_mushroomsontoast_83304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 clove garlic, finely chopped", "¼ red onion, finely sliced", "100g/3½oz mushrooms, chopped in half", "50ml/2fl oz double cream", "1 tbsp chopped flatleaf parsley ", "salt and freshly ground black pepper", "2 thick slices toast", "1 tbsp olive oil", "pinch paprika, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large frying pan, then fry the garlic and onion until soft.", "Add the mushrooms and cook until soft.", "Add the double cream and parsley then season with salt and freshly ground black pepper and reduce until thick.", "To serve, drizzle the toast with the olive oil and spoon over the mushroom mixture. Garnish with a pinch of paprika."]}, {"isVegetarian": true, "title": "Mushroom on toast with spinach pesto", "url": "www_bbc_co_uk_food_recipes_mushroomsontoastwith_90123", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "3 slices bread", "1 Portobello mushroom, sliced", "salt and freshly ground black pepper", "55g/2oz Wensleydale cheese, crumbled", "1 handful spinach", "1 garlic clove, crushed", "3 tbsp olive oil", "6 fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the mushroom on toast, drizzle three tablespoons of the oil over the bread and place onto a baking sheet. Place in the oven to toast for 3-4 minutes, or until golden-brown and crisp.", "Heat the olive oil in a pan and fry the mushrooms for 2-3 minutes, then season with salt and freshly ground black pepper.", "For the pesto, place all of the pesto ingredients into a food processor and pulse until smooth.", "Serve the mushrooms on the toast, with the pesto drizzled over the top."]}, {"isVegetarian": true, "title": "Mushroom soup", "url": "www_bbc_co_uk_food_recipes_mushroomsoup_77788", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroomsoup_77788_16x9.jpg", "ingredients": ["50g/2oz butter", "2 leeks, chopped", "3 garlic cloves, chopped", "300g/9 oz mushrooms, sliced", "2 -3  sprigs fresh thyme, leaves only", "600ml/1 pint chicken or vegetable stock"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large pot and gently cook the leeks and garlic for 4-5 minutes or until softened. Add the mushrooms and thyme and cook on high for 2-3 minutes.", "Pour over the stock and cook for 5 minutes.", "Remove from the heat, carefully pour into a food processor and blend until smooth. Alternatively, keep in the pot and use a stick blender to blitz until smooth. ", "Divide between four bowls and serve. "]}, {"isVegetarian": true, "title": "Mushroom soup", "url": "www_bbc_co_uk_food_recipes_mushroomsoup_83366", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter, chopped ", "1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, finely chopped", "1 Portobello mushroom, finely chopped", "salt and freshly ground black pepper", "50ml/2fl oz white wine", "200ml/7fl oz hot chicken or vegetable stock", "50ml/2fl oz double cream", "1 tsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the olive oil in a frying pan and fry the onion and garlic until soft.", "Add the mushroom and cook until soft, then season well with salt and freshly ground black pepper.", "Add the white wine and cook to reduce by half.", "Add the stock and simmer for five minutes, then add the cream and parsley. ", "Allow to cool slightly, then iquidise until smooth in a blender. Serve in a warm bowl, reheating if necessary."]}, {"isVegetarian": false, "title": "Mushroom stroganoff on garlic bruschetta with seared beef", "url": "www_bbc_co_uk_food_recipes_mushroomstroganoffon_88527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ onion, finely chopped", "125g/4½oz chestnut mushrooms, quartered", "1 tsp paprika", "75ml/2½fl oz white wine", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "½ lemon, juice only", "2 tbsp chopped fresh chives", "2 slices white bread", "4 tbsp olive oil", "1 garlic clove, finely chopped", "150g/5½oz sirloin steak", "1 tbsp olive oil", "1 tbsp natural yoghurt", "1 tbsp chopped fresh chives", "pinch paprika", "lemon wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the mushroom stroganoff, heat the oil and butter in a pan and gently fry the onion until it starts to soften.", "Add the mushrooms and paprika and continue to fry for 4-5 minutes.", "Add the white wine and simmer until slightly reduced, then pour in the cream and bring to simmering point. Season with salt and freshly ground black pepper and add the lemon juice and chives.", "Meanwhile, for the bruschetta, heat an ovenproof griddle pan until smoking hot. Drizzle the bread with olive oil and sprinkle over the garlic. Place into the pan, weighing the bread down with a saucepan. Griddle until the bread is golden-brown on each side. Remove from the pan, but leave the pan on the heat.", "For the beef, rub the beef with olive oil and place into the hot griddle pan. Sear the beef quickly on each side and then transfer the pan to the oven to continue cooking for about five minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place for a few minutes.", "To serve, cut both slices of grilled bread in half and arrange the four pieces on a plate. Pour over the mushroom stroganoff.", "Slice the beef and arrange in a fan over the top of the mushrooms. Serve with a dollop of natural yoghurt on top, sprinkle over the chives and paprika and garnish with lemon wedges."]}, {"isVegetarian": true, "title": "Mushroom stuffed with spinach, breadcrumbs, garlic and herbs", "url": "www_bbc_co_uk_food_recipes_mushroomstuffedwiths_86057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large flat mushroom ", "1 tbsp olive oil", "50g/1¾oz fresh breadcrumbs", "handful fresh parsley, chopped", "1 garlic clove, finely chopped", "handful spinach, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Remove the stalk from the mushroom and chop it finely. Heat the oil in a frying pan and gently fry the chopped mushroom stalk for one minute.", "Add the breadcrumbs, parsley and garlic and fry for 2-3 minutes. Add the chopped spinach, season, to taste, with salt and freshly ground black pepper and fry for a further minute.", "Place the mushroom onto a baking sheet and fill with the breadcrumb mixture. Transfer to the oven and bake for 6-8 minutes, or until the topping is golden-brown and the mushroom is softened.", "To serve, place the stuffed mushroom onto a serving plate."]}, {"isVegetarian": true, "title": "Mushrooms with creamy mustard on fried bread", "url": "www_bbc_co_uk_food_recipes_mushroomswithcreamym_84463", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 thick slice bread", "2 tbsp chopped parsley", "½ onion,finely chopped", "1 tbsp olive oil", "1 large mushroom, chopped", "½ tsp wholegrain mustard", "splash white wine", "splash double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan over a medium heat. Sprinkle the bread with the chopped and then fry on both sides for 1-2 minutes.", "Remove the fried bread from the pan and keep warm. Add the onion, extra oil and mushrooms to the pan and fry over a high heat for three minutes.", "Stir through the mustard, white wine and double cream and season with sea salt and freshly ground black pepper. Leave to simmer on a low heat until the mixture thickens.", "To serve, place the fried bread onto a serving plate and spoon over the creamy mushroom mixture."]}, {"isVegetarian": false, "title": "Mu shu chicken", "url": "www_bbc_co_uk_food_recipes_mushuchicken_89297", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushuchicken_89297_16x9.jpg", "ingredients": ["4 tbsp groundnut oil", "2 free-range eggs, lightly beaten", "1 garlic clove, finely chopped ", "1 tbsp grated fresh root ginger ", "250g/9oz skinless chicken breast fillets, chopped into small pieces ", "1 tbsp Shaoxing rice wine or dry sherry", "2 dried Chinese mushrooms, pre-soaked in hot water for 20 minutes, drained and finely chopped ", "1 small carrot, carrot", "50g/2oz gherkins or preserved mustard greens, finely diced", "50g/2oz dried wood ear mushrooms, pre-soaked in hot water for 20 minutes, drained and finely chopped", "120g/4oz canned bamboo shoots, drained and chopped ", "1 handful dry-roasted peanuts", "2 tbsp light soy sauce", "1 tsp toasted sesame oil ", "2-3 pinches ground white pepper", "12 Iceberg lettuce leaves or 12 small wheat flour Chinese pancakes, steamed in a bamboo steamer for 5-6 minutes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add two tablespoons of the groundnut oil, then add the eggs and cook for one minute, or until scrambled. Remove from the wok and put to one side. Wipe the wok clean.", "Heat the remaining groundnut oil in the wok until smoking, then add the garlic and ginger and stir fry for a few seconds. Add the chicken and cook for 1-2 minutes, or until lightly golden, then add the rice wine or sherry and stir well. Stir fry for a few seconds, then add the dried Chinese mushrooms and carrot and stir-fry for 1-2 minutes, or until the carrots are tender but with a bit of bite. ", "Add the gherkins, dried wood ear mushrooms, bamboo shoots and peanuts and mix well. Stir in the scrambled eggs. Season with the soy sauce, sesame oil and pepper and transfer to a serving dish. ", "To serve, place the dish in the centre of the table together with the lettuce leaves. Stuff each lettuce leaf with the filling and eat immediately."]}, {"isVegetarian": false, "title": "Mussakhan", "url": "www_bbc_co_uk_food_recipes_mussakhan_80246", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small chicken", "1 lemon, juice only", "scant ½ tsp ground allspice", "1 medium onion, roughly chopped", "1 fresh bay leaf", "olive oil, for brushing", "700g/1½lb onions", "3-4 tbsp olive and sunflower oil, mixed, plus extra for frying pine nuts", "2-3 tbsp sumac ", "475-700ml/16-25fl oz/3/4-1¼ pints chicken stock", "2 large handfuls pine nuts", "Lebanese flatbread or similar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Cut the chicken in half. Rub the skin with the lemon juice and place chicken in a casserole with about 2-3cms/1½-2 inches water, the allspice, the roughly chopped onion and the bay leaf. Cover the casserole with a tight-fitting lid, place on the hob and simmer the chicken on a medium heat for about 45 minutes, until just cooked. (You may need to add more water to stop the casserole from drying out.)", "Drain the chicken and reserve the stock. Brush the chicken pieces with olive oil, place in a roasting tin and place in the preheated oven until the skin is lightly browned (this should take about 20 minutes).", "While chicken is roasting, finely chop the 700g/1½lbs onions. Heat the olive oil and sunflower oil in a large pan, add onions and fry gently for about 10-15 minutes until soft and golden. Add the sumac and sauté, stirring constantly, for three or four minutes, adding more olive oil if the mixture seems dry. Add the chicken stock, cover and simmer very slowly, uncovered for 20 minutes.", "Meanwhile, fry the pine nuts in a little oil.", "At the end of cooking time, remove the browned chicken from the roasting tin. Brush the tin with olive oil and cover the bottom of the roasting tin with a layer of the flatbread and spoon over most of the onion/sumac mixture, reserving some to go on top of the chicken. Replace the chicken on top of the bread, spoon over reserved onion/sumac mixture and return to the oven for a further 10-15 minutes.    ", "Serve the chicken, sprinkled with the pine nuts, on top of the bread."]}, {"isVegetarian": false, "title": "Mussel and pea paella", "url": "www_bbc_co_uk_food_recipes_mussel_and_pea_paella_42918", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil ", "2 onions, finely sliced", "salt and black pepper ", "2 garlic cloves, finely sliced ", "¼-½ tsp chilli flakes, to taste ", "200g/7oz tinned tomatoes ", "250g/9oz paella rice ", "500ml/18fl oz chicken or vegetable stock ", "175g/6oz cooked mussels ", "200g/7oz frozen peas, defrosted "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large thin-based frying pan over a medium heat. Add the oil and, once hot, add the onions and a pinch of salt. Cook for 5-6 minutes, or until the onions are soft and translucent, then add the garlic and chilli flakes and cook for a further two minutes.", "Stir through the tinned tomatoes, breaking up any large bits with the back of a wooden spoon. Add the rice and a pinch of salt and pepper and stir well to mix. Pour over the stock and leave the pan for seven minutes without stirring. Turn the heat down to medium-low if the liquid looks like it is evaporating too quickly.", "Scatter over the mussels and the peas - do not mix through (you are trying to create a crisp bottom to the rice). Cover with a lid and cook for a further five minutes, or until the liquid is all absorbed, the rice is tender but still with a very slight bite, and the mussels and peas are hot all the way through.", "Serve the paella hot, making sure everyone has a bit of the crunchy rice stuck to the bottom of the pan."]}, {"isVegetarian": false, "title": "Mussel and sweetcorn soup with foccacia, tomatoes and dill", "url": "www_bbc_co_uk_food_recipes_mussel_and_sweetcorn_31015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz mussels, scrubbed and debearded", "2 sprigs fresh thyme", "200ml/7fl oz dry white wine", "50g/1¾oz butter", "1 tbsp olive oil ", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 leek, roughly chopped", "1 fennel bulb, roughly chopped keep the fronds from the top", "200g/7oz sweetcorn kernals", "250ml/9fl oz chicken or fish stock", "100ml/3½fl oz double cream", "4 long slices foccocia bread, left to go stale", "2 tomatoes, small cross made on the bottom", "iced water, for refreshing", "4 tbsp finely chopped fresh dill", "2 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Discard any broken mussels, and any that don't close tightly when you tap them.", "Heat a large saucepan over a medium-high heat. Add the mussels, thyme and wine and place a lid on. Cook for 3-4 minutes, or until the mussels have opened. Drain, reserving the cooking liquor, and discard any mussels that remain closed. Pick the mussels from their shells. Set aside the liquor and the mussels.", "Heat a large frying pan and add the butter and oil. Add the shallot and garlic and cook for two minutes. Add the leeks and fennel and cook for a further 2-3 minutes. Stir in the sweetcorn, then add the stock, retained liquor and three-quarters of the mussel meat. Cook for 2-3 minutes. ", "Place the soup in a blender and blend until smooth. Pour back into the pan and stir in the cream. Toast the bread.", "Drop the tomatoes into a bowl of boiling water for two minutes. Lift out with a slotted spoon and refresh in iced water. Peel and de-seed the tomatoes, then dice the flesh. Transfer it to a small bowl and mix in the dill, olive oil and remaining mussels. ", "Serve the soup with the toast and tomato mixture. "]}, {"isVegetarian": false, "title": "Mussel broth", "url": "www_bbc_co_uk_food_recipes_mussel_broth_61515", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz mussels", "dash olive oil", "4 shallots, cut into 1cm/½in dice ", "1 garlic clove, finely grated ", "10g pickled ginger, finely chopped ", "10g fresh root ginger ", "2 red chillies, seeds removed, cut into finely sliced rings", "3 kaffir lime leaves", "15g/½oz palm sugar", "1 stick lemongrass, finely chopped ", "1 litre/1¾ pints fish stock, cooked until reduced to 500ml/18fl oz ", "½ x 200ml/7fl oz tin coconut milk ", "soy sauce, to taste  ", "1 lime, zest and juice", "1 loaf good-quality sourdough bread", "10g basil leaves torn ", "10g coriander leaves (knife run through gently)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the mussels under plenty of cold, running water. Discard any open ones that won't close when lightly tapped.", "Pull out the tough, fibrous beards protruding from between the tightly closed shells and then knock off any barnacles with a large knife. Give the mussels another quick rinse to remove any little pieces of shell.  Set aside.", "Over a low to medium heat, fry the shallots in a large pan in a little olive oil until soft, but still colourless. Add the garlic, both the pickled and fresh ginger, sliced chillies, kaffir lime leaves, palm sugar and lemongrass. Cook this gently for another eight minutes, adding a little water if the mixture starts to colour.  ", "Pour in the fish stock, bring to a simmer and cook until the volume of liquid has reduced (about five minutes). Add the coconut milk and simmer for a further 5-8 minutes. Taste the broth, check the seasoning and adjust with soy sauce and lime juice, to taste. Leave to cool. ", "Heat a wok or a medium-sized saucepan on a medium heat. Add the mussels, turn down the heat and cook gently with a lid on until all the mussels are open (discard any that do not open). Add the broth.", "Cut the sourdough bread into slices and rub it all over with olive oil. Heat a griddle pan and chargrill the bread on both sides.", "Sprinkle the broth with freshly chopped basil and coriander and lime zest and serve in bowls with the sourdough. "]}, {"isVegetarian": false, "title": "Mussel pie", "url": "www_bbc_co_uk_food_recipes_mussel_pie_14813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz white bread flour", "1 tsp salt", "1 x 7g sachet dried yeast ", "1 tbsp extra virgin olive oil", "1 tbsp olive oil", "1 tbsp butter", "2 shallots, sliced", "2 garlic cloves, sliced", "1 fennel bulb, finely sliced", "1 large carrot, peeled into strips", "2 plum tomatoes, peeled, seeds removed and chopped", "300ml/10½fl oz white wine", "300ml/10½fl oz double cream", "1 tsp fresh thyme leaves – not used?", "1 tbsp flat-leaf parsley, chopped", "1 tbsp chervil, chopped", "300g/11oz mussels in their shells, cleaned", "2 egg yolks, beaten"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the bread dough, place the flour, salt and yeast into a large bowl and stir. Make a well in the centre of the flour and gradually pour in the oil and 350ml/12fl oz water, mixing in the flour to form a soft dough.", "Tip out and knead on an oiled work surface for about 10 minutes or until the dough is smooth and elastic. Place it into a bowl, cover and leave to rise for 2 hours, or you can leave it in the fridge overnight.", "For the mussel pie, preheat the oven to 220C/425F/Gas 7.", "Clean the mussels and pull of any ‘beards’. If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them.", "Heat a 23cm/9in ovenproof frying pan or casserole dish and once hot add the oil and butter. ", "Fry the shallots, garlic and fennel in the oil and butter for 2-3 minutes until soft. Add the carrot and the tomatoes and cook for another minute.", "Turn the heat up and add the white wine, stirring well to scrape up any bits stuck on the bottom of the pan.", "Cook until the wine has reduced in volume by half then add the cream. Simmer to reduce by half.", "Add the fresh herbs and mussels and remove from the heat.", "Roll the dough out on a floured surface until you have a circle a little larger than the pan. Cover the casserole with the dough and tuck the edges in around the sides. ", "Brush the top of the dough with the beaten egg and place in the oven for 15-20 minutes until golden-brown.", "To serve, take the pan to the table and serve straight away. (Do not eat any mussels that have not opened during cooking.)"]}, {"isVegetarian": false, "title": "Mussel pilav", "url": "www_bbc_co_uk_food_recipes_mussel_pilav_38570", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussel_pilav_38570_16x9.jpg", "ingredients": ["250g/9oz baldo rice", "30g/1oz butter", "3 tbsp olive oil", "4 tbsp orzo (or arpa sehriye)", "500ml/18fl oz chicken stock", "500g/1lb 2oz mussels, scrubbed and debearded", "30g/1oz fresh dill, roughly chopped"], "serves": "Serves 2–3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the rice in cold running water. ", "Warm the butter and olive oil in a large shallow pan with a lid. Add the orzo and cook for 1 minute, until it starts to turn golden-brown. Add the washed rice and cook for 2 minutes, stirring constantly.", "Pour over the chicken stock, bring to the boil and then simmer for 10–15 minutes, or until softened but still with a little bite.", "Discard any mussels with broken shells and any that refuse to close when tapped. Scatter the mussels over the rice, put the lid on the pan and simmer for an extra 4–5 minutes.", "Check that the mussles have opened. Discard any mussels that remain closed.", "Fold the dill into the rice and mussels before serving."]}, {"isVegetarian": false, "title": "Mussel, pumpkin and saffron soup", "url": "www_bbc_co_uk_food_recipes_mussel_pumpkin_and_73735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 onion, roughly chopped", "250ml/9fl oz white wine", "500g/1lb 2oz mussels (rinsed, de-bearded, discard any mussels that do not close tightly when tapped)", "500g/1lb 2oz pumpkin, peeled, seeds removed, roughly chopped", "2 garlic cloves, roughly chopped", "2 sprigs fresh thyme, leaves only", "400ml/14fl oz vegetable stock", "125ml/4½fl oz double cream", "2 star anise", "small pinch saffron", "1 lime, juice only", "salt and freshly ground black pepper", "1 tbsp red-veined sorrel cress or chopped fresh herbs, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the butter in a lidded casserole over a medium to high heat. When the butter is foaming, add half of the onion and fry for 2-3 minutes, until softened. ", "Pour in half of the wine and bring to the boil. Add the mussels, cover the casserole with the lid, then simmer for 2-3 minutes, or until the mussels have opened.", "Strain the mussels through a colander suspended over a clean saucepan. Collect the cooking liquid in the pan. Set aside to cool. ", "Add the remaining butter to the casserole. Fry the remaining onion for 2-3 minutes, or until softened, then add the add the pumpkin and fry for a few more minutes. ", "Add the garlic, thyme, the remaining wine, the stock and the reserved cooking juices (except for any gritty residue at the bottom of the pan). Add two-thirds of the cream, the star anise and the saffron and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 6-8 minutes, or until the pumpkin is tender.", "While the soup cooks, pick the meat from the mussels. Discard the shells and any mussels that haven’t opened.", "When the pumpkin is tender, remove the soup from the heat and discard the star anise. Add two-thirds of the mussel meat and allow the soup to cool slightly. ", "Blend the soup, in batches, in a food processor, to a fine purée. Warm through in a clean saucepan if necessary. Season, to taste, with the lime juice and salt and freshly ground black pepper. ", "Serve the soup in bowls, scattered with the remaining mussels and garnished with a swirl of the remaining cream and a little cress, if using."]}, {"isVegetarian": false, "title": "Mussel soup", "url": "www_bbc_co_uk_food_recipes_mussel_soup_84311", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 3oz  fresh mussels", "200ml/7fl oz white wine", "1 tbsp olive oil", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 fennel bulb, roughly chopped", "pinch saffron", "50ml/2fl oz aniseed liqueur", "300ml/10½fl oz fish stock", "100ml/3½fl oz double cream", "2 tsp coriander cress (or finely chopped coriander)", "1 loaf white bread, sliced", "2 tbsp olive oil", "1 garlic clove, halved"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels by thoroughly scrubbing them under plenty of running water, pulling away and discarding the 'beards', the seaweed-like stringy threads. Discard any broken mussels, and any mussels that don't close tightly when you tap them. ", "Place the mussels in a saucepan, add the white wine and cook for 3-4 minutes.", "Drain, reserving the cooking liquor, and pick the mussels from their shells. Set aside the liquor and the mussels, but discard the shells.", "Heat a large frying pan and add the oil. Add the finely chopped shallot, garlic and fennel and cook for 3-4 minutes.", "Add the saffron, aniseed liqueur, stock, three-quarters of the mussel meat, finish with the cream", "Cook for a further 3-4 minutes until warmed through, then blend with a stick blender until smooth.", "Heat a large griddle pan and drizzle the sliced bread with oil and rub with the halved clove of garlic. Toast the bread on the griddle for 2-3 minutes."]}, {"isVegetarian": false, "title": "Mussel stew with garlic", "url": "www_bbc_co_uk_food_recipes_mussel_stew_with_garlic_31460", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussel_stew_with_garlic_31460_16x9.jpg", "ingredients": ["6 garlic cloves", "2 free-range egg yolks", "half a lemon, juice only", "salt and pepper", "1 tsp Dijon mustard", "200ml/7fl oz oil, (mix sunflower and olive oil, to taste. Olive oil makes it a heavier taste.)", "750g/1lb 10oz mussels ", "2 tbsp olive oil", "1 onion, thinly sliced ", "2 bay leaves", "250ml/9fl oz dry white wine", "1 leek", "1 fennel, thinly sliced", "1 carrot, thinly sliced", "2 pinches saffron ", "salt and pepper", "250ml/9fl oz aïoli (see above)", "large chunks of stale bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aïoli, peel the garlic and remove the central green germ from any of the cloves. Grate into a food processor and add the egg yolks, lemon juice, a generous pinch of salt and pepper and the mustard. Blend until smooth, then gradually add the oil, until you have a smooth paste. Set aside in the fridge.", "For the mussels, clean and de-beard the mussels. If any are open, and do not shut when tapped firmly, then discard immediately.", "Heat a large pan with a lid over a high heat. ", "Add the oil and half the onion. Gently fry until soft then add the bay leaves and a generous splash of wine.", "Once hot, add the mussels immediately followed by 200ml/7fl oz of water. Quickly clamp the lid on and steam the mussels for 3-5 minutes, or until they have just opened. Tip the mussels into a colander set over a bowl, so that you retain the cooking juices, discarding any that haven’t opened.", "When cool enough to handle, pick the mussel meat from the shells and place in a bowl. Reserve the strained cooking liquid.", "Wash the leek and finely slice the white part. Fry the remaining onion, leek, fennel and carrot in a large pan with a little olive oil until tender. Add a splash more white wine, the reserved cooking liquid from the mussels and 100ml/3½fl oz water. Add the saffron and a little salt and pepper to taste and simmer for 10 minutes.", "Once the broth has simmered for 10 minutes, whisk in a large spoonful of the aïoli to thicken. Follow with the picked mussels and allow them to warm through before serving.", "To serve, put a thick slice of stale bread in each serving bowl and pour over the stew."]}, {"isVegetarian": false, "title": "Mussel, fennel and saffron broth", "url": "www_bbc_co_uk_food_recipes_musselfennelandsaffr_67648", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "1 small leek, finely diced", "1 bulb fennel, finely sliced", "200g/7oz chestnut mushrooms, sliced (optional)", "3 shallots, finely chopped", "pinch curry powder", "pinch saffron strands", "sprigs of thyme", "250ml/9fl oz white wine", "590g/1lb 5oz fresh mussels, cleaned and beards removed", "200ml/7fl oz double cream", "small bunch parsley, snipped and finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan, melt the butter and add the leek, fennel and mushrooms (if using) the shallots, curry powder, saffron and thyme. Cover the pan and gently sweat the vegetables for about 5 minutes, or until soft but not coloured.", "Add the wine and bring to the boil, then add the mussels. Cover and cook, shaking occasionally until all the mussels are open. Discard any which remain closed.", "Strain and return the liquor to the pan. Cook uncovered for 5 minutes to reduce before adding the cream and parsley. ", "Bring back to the boil, return the mussels to the pan, allow to heat for a minute or so and serve immediately with crusty bread."]}, {"isVegetarian": false, "title": "Mussels", "url": "www_bbc_co_uk_food_recipes_mussels_1399", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1-2 shallots, peeled and finely chopped", "1 clove garlic, peeled and crushed", "1kg/2¼lb mussels, cleaned and de-bearded (broken or opened ones discarded)", "1 bottle beer", "2-3 tbsp finely chopped, parsley for garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large, lidded saucepan and add the olive oil. ", "Add the shallots and garlic and cook for one minute. ", "Add the mussels and pour in the beer. Mix through, turn up the heat and put the lid on.", "Cook, shaking the pan every now and again until all the mussels have opened and are cooked. Remove any mussels that remain closed.", "Spoon into serving bowls with the juices, sprinkle with parsley and serve with rustic bread."]}, {"isVegetarian": false, "title": "Mussels, kumquats and rosemary with sprouting broccoli, anchovy and burnt-butter bread", "url": "www_bbc_co_uk_food_recipes_mussels_kumquats_and_66812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large bunch rosemary", "800g/1lb 12oz semolina", "200g/7oz white polenta", "1kg/2lb 4oz mussels, steamed and mussel meat removed", "fine salt", "300g/10½oz kumquats, very thinly sliced", "vegetable oil, for deep-frying", "10 brown anchovies plus the oil from the tin, preferably Natoora or Brindisa", "40g/1½oz Parmesan, grated", "1 bulb garlic, roasted", "2 tbsp Unio Moscatel vinegar", "230g/8oz crème fraîche", "3 tbsp olive oil", "500g/1lb 2oz purple or white sprouting broccoli", "1 jar capers, preferably Lilliput capers, drained and rinsed", "200g/7oz Parmesan (preferably 24 month aged), grated", "large bunch rosemary, leaves removed, finely chopped", "500g/1lb 2oz unsalted butter", "500g/1lb 2oz focaccia, torn", "200g/7oz boquerones ", "sea salt flakes", "extra virgin olive oil, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the mussels, kumquats and rosemary. Heat the vegetable oil in a deep-fat fryer or a deep-sided, heavy-bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Pick the top heads off the rosemary sprigs and put in the hot oil, remove straight away with a slotted spoon and drain on kitchen paper. Set aside.", "Mix the semolina and polenta. Pat the mussel meat dry and toss in the semolina and polenta mix to coat, shake off any excess.", "Increase the deep-fat fryer temperature to 190C. Put the mussels in the deep-fat fryer, fry for 1-2 minutes, or until crispy. Remove and drain on kitchen paper. Season with fine salt and toss with the kumquats and rosemary.", "For the anchovy dressing, put all the ingredients in a food processor and blend.", "For the purple sprouting broccoli, remove the woody ends and leaves, reserve the leaves. Slice the stems vertically, taking care to keep the florets attached. Put under a damp cloth and set aside.", "Put the capers, reserving a few for garnish, the Parmesan, rosemary and a pinch of salt in a bowl and mix.", "Put the butter in a saucepan, melt until it bubbles and turns nutty brown. Keeping on a low heat, add the focaccia and toss every so often until the bread is evenly dark-brown. Remove the bread with a slotted spoon and put on a tray. Sprinkle the capers and Parmesan mix over the bread while it is still hot so that it sticks to the bread.", "Put the broccoli in a large bowl, spoon over a little dressing to coat the florets and leaves. Fold through the capers, torn anchovies, croûtons and a couple of shaves of Parmesan. I crush a little extra bread to garnish and a few more Parmesan shavings and finish with extra virgin olive oil.", "Serve the fried mussels on a serving platter and season. On a separate plate, serve the coated broccoli garnished with the reserved capers. "]}]