[{"ingredients": ["Filete de grupa 100 g / 3½ oz", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 zanahoria, pelada y cortada en cintas con un pelador", "1 cucharada de cilantro fresco picado", "1 cucharada de menta fresca picada", "1 cucharada de albahaca fresca picada", "½ cucharadita de sal", "½ lima, solo jugo", "1 cucharada de vinagre balsámico", "2 cucharadas de aceite de oliva", "hojas frescas de cilantro"], "method": ["Remoje tres brochetas de madera en un tazón de agua fría durante 10-12 minutos, luego drene y reserve.", "Para el bistec, corta la carne en tiras y ensarta en los pinchos. Sazonar con sal y pimienta negra recién molida y rociar con el aceite. Caliente una bandeja de carbón hasta que esté humeando, luego agregue los pinchos y fríalos durante 1-2 minutos en cada lado, o hasta que se doren por todos lados y cocinen a su gusto.", "Para la ensalada, combine la zanahoria y las hierbas en un recipiente y agregue el resto de los ingredientes. Mezcle bien para cubrir, luego transfiera a un plato de servir.", "Sirva los pinchos en la parte superior de la ensalada, adornado con las hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakskew_90316", "title": "Pinchos de carne a la parrilla con ensalada de zanahoria, cilantro y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chirivía, pelada y descuartizada", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "Patata de 100g / 3½oz, cortada en rondas de 1cm y blanqueada", "1 cucharada de aceite de oliva", "1 cucharada de romero, picado", "Medallón de filete de grupa de 100 g / 3½ oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 yema de huevo de gallinas camperas", "150ml / ¼ pinta de aceite vegetal", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200c / 400F / Gas 6.", "Para las pastinacas, póngalas en agua hirviendo durante un minuto. Escurra y transfiera a una lata para asar, mezcle con aceite de oliva y tueste en el horno durante diez minutos.", "Para las papas, caliente una sartén y cubra las papas con aceite y romero. Coloque en la plancha y cocine durante dos minutos en cada lado, o hasta que esté cocido.", "Para la carne, caliente una sartén de plancha por separado. Frote la carne con el aceite y el condimento y coloque en la plancha. Cocine por dos minutos en cada lado, o hasta que esté cocido a su gusto. Retire del fuego y deje reposar.", "Mientras tanto, para la mayonesa, mezcle la yema de huevo en un procesador de alimentos y agregue gradualmente el aceite y el vinagre de vino blanco.", "Una vez mezclado en mayonesa, revuelva a través de la mostaza y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque las papas en un plato caliente, cubra con las chirivías asadas y luego agregue el bistec. Termine con una cucharada de mayonesa."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_78946", "title": "Filete a la brasa con chirivía asada, patatas salteadas y mayonesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo de 100g / 3½oz", "1 cucharada de aceite de oliva", "25 g / 1 oz de mantequilla sin sal, picada", "1 cucharada de aceite de oliva", "¼ de cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "1 hongo Portobello, en rodajas", "50ml / 2fl oz de vino tinto", "50ml / 2fl oz de caldo de carne caliente", "1 cucharadita de perifollo fresco picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el bistec, caliente una sartén hasta que fume. Frote la carne con el aceite y sazone ambos lados con sal y pimienta negra recién molida. Agregue el bistec a la plancha caliente y cocine a fuego lento durante 3-4 minutos por cada lado, o hasta que esté cocido a su gusto. Retire del calor para descansar durante 2-3 minutos.", "Para hacer la salsa, derrita la mantequilla con el aceite en una sartén a fuego medio. Agregue las cebollas y el ajo y cocine hasta que se ablanden.", "Agregue la seta y saltee hasta que esté cocida.", "Agregue el vino tinto y el caldo de carne y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que el líquido se haya reducido y espesado, luego agregue el perifollo y revuelva.", "Para servir, coloca el bistec en el medio de un plato caliente y coloca la salsa alrededor."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_83609", "title": "Filete a la parrilla con salsa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "½ cebolla, picada", "½ batata, pelada y picada en cubos pequeños", "1 cucharada de perejil picado", "1 cucharada de cebollino picado", "100ml / 3½fl oz de vinagre de vino tinto", "2 cucharadas de mantequilla", "1 cucharada de miel", "110ml / 4fl oz de caldo de carne", "Guisantes 40 g / 1½ oz", "Filete de lomo 140 g / 5 oz", "aceite, a llovizna"], "method": ["Para el puré, coloca la mantequilla en una cacerola para que se derrita. Agregue la cebolla y las batatas. Cubra y cocine por diez minutos, o hasta que se ablanden. Agregue el perejil y cebollín y machaque hasta que quede suave. Mantener en un lugar cálido.", "Para la salsa, coloque el vinagre, la mantequilla, la miel y el caldo de carne en una cacerola. Una vez que hierva, reduzca el fuego a fuego lento y deje que espese la salsa. Después de 5-6 minutos agregue los guisantes.", "Sazone el bistec con sal marina y pimienta negra recién molida. Caliente una sartén a fuego alto y agregue el bistec y cocine por 3-4 minutos en cada lado, o hasta que esté cocido.", "Para servir, coloque el bistec en un plato, agregue el puré y rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_84091", "title": "Filete a la brasa con puré de camote, guisantes y salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de grupa 100 g / 3½ oz", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharadita de mostaza integral", "1 cucharada de cebolletas frescas picadas", "1 cucharada de granos de pimienta verde, aplastados", "3 cucharadas de aceite de oliva", "1 cucharada de agua", "1 cucharadita de azúcar en polvo", "sal y pimienta negra recién molida", "Harina normal 150g / 5oz", "200ml / 7fl oz de agua con gas", "aceite vegetal, para freír", "1 chalote, pelado, cortado en anillos gruesos", "1 puñado de judías verdes, recortadas", "½ papa para hornear, pelada, rallada", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para el bistec, sazone el bistec con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente, cepille la carne con el aceite de oliva y fría en la plancha durante 3-4 minutos en ambos lados (para el medio) o hasta que esté cocida a su gusto. Retirar de la sartén y dejar reposar sobre un plato tibio cubierto con papel de aluminio.", "Para el aderezo, mezcle todos los ingredientes del aderezo en un tazón y déjelos a un lado.", "Para la tempura, mezcle la harina con suficiente agua en un tazón para hacer una mezcla con la consistencia de una sola crema.", "Llene a la mitad una sartén profunda de base pesada con aceite y calor hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja los aros de chalote y los frijoles en la mezcla antes de freírlos en aceite por 2-3 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para los rösti, coloque la papa rallada en una toalla de té limpia y exprima el exceso de humedad. Caliente el aceite de oliva y la mantequilla juntos en una sartén pequeña y empaquete la papa rallada en la sartén. Sazonar bien con sal y pimienta negra recién molida y freír a fuego medio-bajo durante 5-7 minutos en ambos lados, o hasta que estén dorados y cocidos.", "Para servir, coloque los chalotes de tempura y las judías verdes junto al filete. Coloque el rösti al lado del filete, luego rocíe sobre el aderezo de mostaza y pimienta."], "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_92435", "title": "Filete a la parrilla con aderezo de mostaza y pimienta, chalotes tempura y judías verdes y un rosti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 gambas grandes, con mariposa, conchas, pero sin cabeza", "Una pizca de sal marina", "rociar aceite vegetal", "gran cilantro fresco puñado", "1 lima, solo jugo", "4-5 cucharadas de vinagre de vino blanco", "3-4 cucharadas de azúcar en polvo", "4 cm / 1 en pieza de jengibre fresco, sin pelar", "1 chile rojo suave, finamente picado"], "method": ["Para marzar los langostinos, primero quite la cabeza girándola, luego deséchela. No quites el caparazón. Coloque la gamba sobre su espalda en una tabla de cortar. Usando un cuchillo pequeño y afilado, corte a través del centro del cuerpo desde debajo de la cabeza hasta la cola. No corte todo el camino a través de la carne. Repita con las gambas restantes.", "Para la salsa agridulce, vierta el vinagre en una sartén pequeña (no de aluminio) a fuego medio. Agregue el azúcar y caliente a través.", "Cortar el jengibre en rodajas gruesas y agregar a la salsa en la sartén.", "Cortar la guindilla y agregar a la sartén. Cocine a fuego lento la salsa hasta que el azúcar se disuelva y la salsa se reduzca y se vuelva pegajosa, aproximadamente cinco minutos. Pruebe y ajuste el sabor según sea necesario agregando un toque más de azúcar o vinagre, según sea necesario.", "Mientras tanto, caliente una parrilla con rejilla hasta que esté caliente. Espolvorea la sal marina sobre las gambas preparadas. Vierta sobre el aceite, luego frótelo en las gambas.", "Coloque las gambas en la parrilla caliente y la parrilla hasta que estén cocidas y ligeramente carbonizadas (esto tomará alrededor de 2 a 3 minutos). Presione ligeramente con tenazas para asegurar una cocción pareja. Voltee las gambas y cocine por otros 2-3 minutos en el otro lado.", "Picar el cilantro fresco. Cuando los langostinos estén cocidos, transfiéralos a la sartén con la salsa reducida.", "Agregue el cilantro y un chorrito de jugo de lima fresco en la sartén.", "Revuelva hasta que las gambas estén cubiertas con la salsa. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chargrilledsweetands_90198", "title": "Gambas agridulces a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledsweetands_90198_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tomate, semillas eliminadas, picadas", "1 cucharadita de puré de tomate", "1 cucharadita de miel clara", "grandes pizcas de chile seco", "salpicar agua", "sal y pimienta negra recién molida", "1 mazorca de maíz", "1 cucharada de aceite de oliva"], "method": ["Para la mermelada de chile, coloque el tomate, puré de tomate, miel, hojuelas de chile y un chorrito de agua en una olla pequeña. Sazonar con sal y pimienta negra recién molida y calentar suavemente hasta que se combine y espese.", "Para el maíz dulce a la parrilla, caliente una sartén hasta que esté caliente. Frote el maíz con aceite de oliva y cocine durante 10-12 minutos, volteándolo ocasionalmente, hasta que estén tiernos.", "Para servir, cuidadosamente corta el maíz en trozos y colócalo en un plato con una cucharada de mermelada de chile."], "url": "www_bbc_co_uk_food_recipes_chargrilledsweetcorn_85322", "title": "Maíz a la parrilla con mermelada de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ batata, pelada y cortada en rondas de 6 1cm / 0.5in", "1 cucharada de aceite de oliva", "3 yemas de huevo", "Crema doble 50ml / 2fl oz", "100g / 3½oz de queso cheddar rallado", "Florecillas de coliflor de 50g / 1¾oz blanqueadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la papa, en un recipiente grande, revuelva las papas en aceite de oliva y sazone bien.", "Caliente una sartén hasta que fume.", "Coloque a fuego lento los medallones de patatas durante dos minutos por cada lado. Transfiera al horno y tueste por 10 minutos.", "Retire del horno y coloque en un plato para horno.", "Para hacer la coliflor, en un tazón grande mezcle las yemas, crema, queso y coliflor. Sazonar con sal y pimienta negra recién molida.", "Coloque la mezcla sobre la batata y vuelva al horno para cocinar por otros cinco minutos.", "Servir en el plato del horno."], "url": "www_bbc_co_uk_food_recipes_chargrilledsweetpota_80051", "title": "Medallones de camote a la brasa con queso de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de arroz jazmín, crudo", "2 chiles rojos secos", "Filete de solomillo de 500 g / 1 lb 2 oz", "2 cucharadas de aceite de sésamo", "75 ml / 2½ fl oz de salsa de soja dulce (salsa de soja dulce de Indonesia)", "2 cucharaditas de azúcar", "4 cucharadas de jugo de lima", "3 cucharadas de salsa de pescado tailandesa", "1 pepino pequeño, pelado, sin semillas, cortado a la mitad longitudinalmente y cortado en rodajas de 1cm / 0.5in", "4 chalotas rojas, finamente cortadas", "12 tomates cherry, cortados por la mitad", "2 chiles rojos, finamente cortados", "1 puñado de hojas de menta fresca", "1 puñado de hojas frescas de cilantro", "2 cucharadas de hojas de albahaca fresca, rasgadas", "4 cebolletas, finamente cortadas"], "method": ["Caliente una sartén seca, agregue el arroz y las tostadas hasta que estén doradas, pero no quemadas. Moler el arroz en un molinillo de café limpio o en polvo y dejar de lado.", "Vuelva a calentar la sartén y agregue los chiles rojos secos. Tueste hasta que estén ahumados, luego muela o machaque y deje de lado.", "Cocine a fuego lento o fríe la carne en un sartén por unos 12 minutos, hasta que quede bien marcada afuera y dentro de rara o medianamente rara. Coloque en un recipiente y déjelo reposar por 10 minutos. Mientras tanto, combine el aceite de sésamo con el manis kecap y cepille sobre el filete. Marinar durante dos horas.", "Disuelva el azúcar en el jugo de limón y la salsa de pescado. Combina media cucharadita de chile molido en polvo seco con media cucharadita de arroz molido y reserva. Combine el pepino, los chalotes, los tomates cherry, los chiles rojos, las hierbas y las cebolletas en un tazón grande. Agregue la mezcla de jugo de lima y salsa de pescado y revuelva para combinar.", "Corta la carne finamente. Mezcle la carne de res y la mezcla de arroz molido a través de la ensalada con los jugos de cocina que se hayan recolectado en el recipiente. Apile en un plato grande y sirva con una ensalada de lechuga cruda crujiente."], "url": "www_bbc_co_uk_food_recipes_chargrilledthaibeefs_73736", "title": "Ensalada de carne tailandesa a la brasa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de pollo mini 150 g / 5½ oz", "1 cucharada de aceite de oliva", "1 cucharada de estragón fresco picado", "sal y pimienta negra recién molida", "1 cucharada de mostaza Dijon", "75ml / 3fl oz de caldo de pollo", "Crema doble 75ml / 3fl oz", "½ paquete de remolacha cocida, enjuagada, escurrida y picada", "2 cucharadas de azúcar demerara", "1 cucharadita de vinagre balsámico", "1 cucharada de aceite de oliva", "75g / 3oz de panceta, frita hasta que quede crujiente", "100g / 3½ oz de croutones listos para usar", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo, coloque los filetes de pollo, el aceite de oliva y el estragón en un bol y mezcle. Sazonar con sal y pimienta negra recién molida.", "Caliente una sartén a fuego alto, hasta que fume, luego asa el pollo durante tres minutos por cada lado.", "Agregue la mostaza y el caldo de pollo, revuelva y reduzca a la mitad.", "Agregue la crema y reduzca, hasta que espese, luego, sazone con sal y pimienta negra recién molida.", "Para la remolacha y el tocino, coloque la remolacha en un tazón con el azúcar y el vinagre balsámico, luego sazone con sal y pimienta negra recién molida.", "Caliente el aceite de oliva en una sartén a prueba de horno a fuego medio y agregue la mezcla de remolacha. Freír durante dos minutos, luego coloque en el horno durante cinco minutos.", "Para servir, coloque el pollo en un plato de servir y vierta sobre la salsa. Adorne con la panceta y los crutones crujientes. Sirva la remolacha en un tazón para servir a un lado."], "url": "www_bbc_co_uk_food_recipes_chargrilledtarragonc_84393", "title": "Pollo de estragón a la brasa, remolacha asada y panceta crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ chile verde, sin semillas, finamente picado", "1 diente de ajo, picado", "2 cucharadas de azúcar moreno", "1 cm / ½ en galanga (o jengibre), pelado y finamente picado", "¼ stick lemongrass, capa externa eliminada, finamente picada", "2 cucharadas de vinagre de vino blanco", "1 cucharada de aceite de oliva", "Anacardos sin sal de 55g / 2oz, aplastados", "1 cucharada de salsa de soja", "1 lima, solo jugo", "1½ cucharadas de aceite de oliva", "1 x 150 g / 5½ oz atún filete", "1 calabacín, cortado en tiras muy finas", "2 cucharaditas de aceite de sésamo", "2 cucharaditas de semillas de sésamo", "100 g / 3½ oz de arroz jazmín (arroz tailandés), cocido de acuerdo con las instrucciones del paquete, para servir"], "method": ["Para el atún de estilo tailandés, coloque todos los ingredientes, excepto el atún en un bol y mezcle bien.", "Coloque el atún en el recipiente y déjelo marinar durante unos minutos. Retire el atún y reserve el aderezo.", "Caliente una sartén hasta que esté caliente y dore el atún durante 2-3 minutos por cada lado, o hasta que esté cocido a su gusto.", "Coloque el aderezo en una olla pequeña y caliente suavemente hasta que hierva a fuego lento, luego reduzca el fuego.", "Para las cintas de calabacín, coloque las cintas de calabacín en una sartén con el aceite de sésamo y suavemente calentar a través. Espolvorea sobre las semillas de sésamo.", "Para servir, coloque el arroz cocido en un plato para servir, cubra con las cintas de atún y calabacín y vierta sobre el aderezo tibio."], "url": "www_bbc_co_uk_food_recipes_chargrilledthaistyle_85305", "title": "Atún a la brasa de estilo tailandés con cintas de calabacín y arroz fragante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 tomates de ciruela, pelados, cortados en cuartos", "2 cebollas rojas, aproximadamente en rodajas", "2 cucharadas de aceite de oliva light", "1 cucharadita de semillas de cilantro, trituradas", "½ cucharadita de sal", "125ml / 4½fl oz de aceite de oliva virgen extra", "2 cucharadas de jugo de limón", "4 filetes de atún x 175 g / 6 oz", "pizca de sal", "1 cucharada de semillas de cilantro, trituradas", "1 cucharada de granos de pimienta negra, agrietada", "2 cucharadas de aceite de oliva light", "2 papas para hornear grandes, finamente cortadas en tiras", "sal y pimienta negra recién molida", "2 cucharadas de cilantro fresco, toscamente picado", "Hojas de cohete de 125 g / 4½ oz"], "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque los tomates, la cebolla roja, el aceite de oliva liviano, las semillas de cilantro y la sal en un tazón y mezcle suavemente.", "Transfiera la mezcla de tomate a una bandeja para hornear y colóquela debajo de la parrilla durante 10-12 minutos, hasta que se ponga dorada, volteándola de vez en cuando.", "Transfiera la mezcla de tomate a la parrilla a un tazón grande y agregue el aceite de oliva virgen extra y el jugo de limón. Mezclar suavemente para combinar y cubrir, luego reservar.", "Para el atún, precaliente una sartén hasta que esté caliente.", "Sazone el atún ligeramente con sal.", "Mezcle las semillas de cilantro molidas y los granos de pimienta juntos y espolvoree uniformemente en un plato. Presione los filetes de atún en la mezcla de especias para cubrir uniformemente en ambos lados, luego rocíe con el aceite de oliva.", "Coloque los filetes de atún en la sartén de la plancha y cocínelos durante 1-2 minutos en cada lado, o hasta que estén cocidos a su gusto.", "Para las patatas sin cordones, precaliente una freidora a 190C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque las tiras de patata en un recipiente con agua fría y déjelas en remojo durante cinco minutos, luego retírelas del agua y séquelas con papel de cocina.", "Coloque las papas en la freidora y cocine por 2-3 minutos, o hasta que estén doradas y crujientes. Con cuidado, quite con una espumadera y escurra sobre papel de cocina. Sazonar, al gusto, con sal y pimienta negra.", "Para servir, agregue el cilantro fresco a la mezcla de tomate y cebolla. Con una cuchara, coloque la mezcla de tomate y cebolla sobre las placas calentadas, luego coloque una pila de hojas de cohete en el centro de cada plato.", "Cubra cada montón de cohete con un filete de atún, y coloque una cucharada grande de papas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chargrilledtunawithr_86657", "title": "Atún a la parrilla con cebolla roja asada, vinagreta de tomate y cilantro y papas muy finas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 paquete de gelatina de frambuesa", "Frambuesas 400 g / 14 oz", "25g / 1oz de azúcar glas", "150ml / 5fl de leche en oz", "100 g / 3½ oz de azúcar en polvo", "3 yemas de huevo de gallinas camperas", "6 hojas de gelatina de hoja, empapada en agua fría durante 5 minutos, escurrida", "300ml / 10½ fl oz crema doble", "8 huevos de gallinas camperas", "150 g / 5½ oz de azúcar en polvo, más extra para quitar el polvo", "1½ cucharadita de pasta de vainilla", "Harina normal 150g / 5½ oz", "150 g / 5½ oz de mermelada de frambuesa", "4-5 fresas maduras, cortadas a la mitad", "2-3 ramitas de menta fresca"], "method": ["Para la charlotte, prepare la gelatina de frambuesa de acuerdo con las instrucciones del paquete, y deje reposar en un tazón pequeño y redondo en la nevera durante 1 hora.", "Mezcle las frambuesas y el azúcar glas en un puré en un procesador de alimentos, luego cuele el puré a través de un tamiz fino en un recipiente, descartando las semillas.", "Caliente la leche y la mitad del azúcar en una cacerola hasta que hierva a fuego lento. Mientras tanto, bata el azúcar impalpable restante y todas las yemas de huevo en un bol hasta que estén pálidas y gruesas.", "Vierta la leche tibia sobre la mezcla de yema de huevo, batiendo todo el tiempo, hasta que esté bien combinada.", "Regrese la mezcla de crema a la cacerola y cocine, batiendo bien, hasta que se espese lo suficiente como para cubrir la parte posterior de una cuchara, asegúrese de que no hierva. Agregue la gelatina escurrida y exprimida a la crema pastelera y revuelva hasta que se disuelva.", "Batir la crema caliente con el puré de frambuesa hasta que esté suave y bien combinado. Dejar enfriar, luego enfriar en la nevera durante al menos 30 minutos.", "Mientras tanto, para el rollo suizo, precaliente el horno a 190C / 170C Ventilador / Gas 5. Línea 2 x 25x38cm / 10x15 en latas suizas con pergamino para hornear.", "Batir los huevos, el azúcar y la pasta de frijoles de vainilla en un tazón grande hasta que queden muy livianos, esponjosos y espesos. Doble la harina en la mezcla con la mano, levante y mezcle cuidadosamente hasta que se haya incorporado.", "Divida la mezcla de rodillo suizo entre las latas preparadas y alise la parte superior hasta que se distribuya uniformemente. Hornea por 10-12 minutos, o hasta que esté flojo y firme al tacto.", "Moje 2 toallas de té limpias y escúrrelas. Colóquelos en una superficie de trabajo y espolvoree con azúcar en polvo. Coloque las esponjas en las toallas de té, luego quite el pergamino.", "Extienda la mermelada de frambuesa por todas las esponjas, dejando un borde de 2 cm / 1 pulg en uno de los extremos angostos. Apriete bien las esponjas, comenzando por el extremo con un borde y usando el paño de cocina para ayudarlo.", "Engrase un budín grande o un bol pequeño con un poco de aceite vegetal y cúbralo con 3 hojas de película adhesiva.", "Corte los rollos suizos en rodajas de 1cm / ½ pulgada de grosor y úselos para revestir los lados y la base del tazón del pudín, comenzando por la parte inferior y ascendiendo para cubrir todo el interior del tazón, asegurándose de que no haya agujeros.", "Agregue la gelatina del set al tazón del pudín, separándolo si es necesario.", "Batir la crema doble hasta que se formen picos suaves cuando se quita la batidora. Dobla la crema en la crema de frambuesa fría, luego coloca la mezcla sobre la gelatina. Enfriar en la nevera durante al menos 4 horas.", "Para servir, agítelo en un plato de servir. Retire la película adhesiva y decore con las fresas y la menta. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_charlotte_royale_69785", "title": "Royal Charlotte", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/charlotte_royale_69785_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 30 g de rodajas de Montenebro o cualquier otro queso de cabra", "Berenjenas a la parrilla 200g / 7oz", "200g / 7oz de calabacines a la parrilla", "200g / 7oz de alcachofas a la parrilla", "200g / 7oz de pimientos rojos asados ​​en madera o pimientos rojos asados ​​convencionalmente", "Aceitunas negras aragonesas de 30g / 1oz o cualquier otra aceituna negra", "20g / ¾oz de piñones tostados", "80g / 3oz de pesto fresco", "10g / ½ oz de orégano fresco, eneldo y albahaca, picado", "vinagre balsámico", "aceite de oliva virgen", "sal", "pimienta negra recién molida"], "method": ["Coloque las verduras en un recipiente y agregue las aceitunas.", "Coloque las hierbas, el pesto y el aceite de oliva en un recipiente aparte y agregue el balsámico para hacer un aderezo. Sazonar y dejar a un lado.", "Coloque las rebanadas del queso en una bandeja de parrilla y sazone con aceite de oliva, sal y pimienta.", "Coloque debajo de una parrilla caliente durante aproximadamente cuatro minutos hasta que estén dorados en la parte superior y suaves en el medio. Mientras cocina vierta el aderezo en las verduras y mezcle con un poco de aderezo.", "Coloque las verduras en los cuatro platos y rocíe con los piñones tostados.", "Cubra con el queso de cabra y sirva con el resto del aderezo rociado alrededor del borde de los platos."], "url": "www_bbc_co_uk_food_recipes_chargrilledvegetable_70903", "title": "Verduras a la brasa y aceitunas de Aragón con Montenebro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 400g / 14oz, descascadas y picadas", "500g / 1lb de azúcar de mermelada 2 oz", "botón de mantequilla", "6 huevos grandes de gallinas camperas", "150 g / 5½ oz de azúcar en polvo, más extra para rociar", "150g / 5½ oz de harina de auto crianza", "9 hojas de gelatina", "Frambuesas de 550g / 1lb 4 oz", "2 cucharadas de licor de frambuesa", "600ml / 20fl oz de leche entera", "8 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "Crema doble 450ml / 16fl oz", "Fresas pequeñas de 100g / 3½oz", "75 g / 2½ oz de azúcar en polvo", "1 cucharada de arrurruz", "150ml / 5fl oz de crema doble", "25g / 1oz de azúcar glas", "10 fresas medianas"], "method": ["Para la mermelada, coloque las fresas en una olla pequeña con el azúcar y cocine a fuego lento hasta que el azúcar se haya derretido. Agregue la perilla de mantequilla. Llevar a ebullición y hervir vigorosamente durante cuatro minutos, o hasta que la temperatura en un termómetro de azúcar alcance 104C / 219F (punto de ajuste). Retire del fuego y agregue la mantequilla. Transfiera a un tazón grande y déjelo reposar.", "Para los rollos de esponja, precaliente el horno a 220C / ventilador 200C / 425F / Gas 7. Engrase y forme dos latas de rollo suizo de 33cm x 23cm / 13 x 9in con papel para hornear. Batir los huevos y el azúcar juntos en un tazón grande hasta que la mezcla esté liviana y espumosa y el batidor deje un rastro cuando se levante. Tamiza la harina en la mezcla y dóblala con cuidado. Divide la mezcla entre las latas preparadas y agita suavemente para que la mezcla tenga su propio nivel, asegurándose de que se haya extendido uniformemente a las esquinas.", "Cueza al horno en las dos latas suizas del rodillo por 10-12 minutos, o hasta que las esponjas estén doradas y comiencen a encogerse de los bordes del estaño. Mientras se cocinan los pasteles, coloque dos pedazos de pergamino para hornear un poco más grandes que el tamaño de la lata en la superficie de trabajo y espolvoree con azúcar en polvo.", "Voltea los pasteles en el pergamino azucarado y quita el papel. Recorte los bordes de las esponjas con un cuchillo afilado y puntúe 2 cm / ¾ pulg del borde corto, teniendo cuidado de no cortar el borde.", "Dejar enfriar un poco, luego extender con mermelada y enrollar los pasteles firmemente desde el extremo marcado y reservar.", "Para los bavarois, remoje la gelatina en agua fría hasta que esté suave. Puré 450 g / 1 libra de las frambuesas en el tazón de un procesador de alimentos. Pase las frambuesas por un colador sobre un recipiente y deseche las semillas. Revuelva el licor de frambuesa en el puré y déjelo a un lado.", "Verter la leche en una sartén y calentar hasta justo por debajo del punto de ebullición. Batir las yemas de huevo y el azúcar impalpable hasta que estén pálidas y cremosas. Vierta la leche caliente sobre los huevos y mezcle. Escurra la gelatina, exprima el exceso de humedad y agréguela a la crema pastelera. Regrese la crema pastelera a la sartén y cocine hasta que la mezcla cubra la parte posterior de la cuchara. No hierva ya que esto dividirá la crema y evitará que la gelatina se endurezca. Retirar del fuego, transferir a un recipiente limpio y dejar enfriar un poco antes de doblar en el puré de frambuesa. Dejar enfriar durante al menos 30 minutos.", "Mientras tanto, alinee la base de un recipiente redondo de 2 litros / 3½ pinta con película adhesiva, para ayudar a apagar el royale de Charlotte. Cortar los rollos suizos en rodajas de 1,5 cm / ⅝ en rebanadas y utilizar para revestir la base y los lados de un cuenco. Empaque las rebanadas juntas para que no se filtre ningún relleno, reservando suficientes rebanadas para cubrir la parte superior (que se convertirá en la base).", "En un bol, batir la crema hasta que se formen picos suaves cuando se quite el batidor del bol y mezclar con el bavarois de frambuesa. Doble los 100g / 3½oz restantes de frambuesas y las fresas pequeñas y la cuchara en el tazón revestido.", "Cubra con las rebanadas de pastel restantes. Cubra con film transparente y enfríe en la nevera durante la noche hasta que fragüe.", "Apague el royale de Charlotte en una rejilla para enfriar.", "Para decorar, incline el azúcar impalpable en una sartén con 125 ml / 4 fl oz de agua y deje que hierva. Disuelva el arrurruz en dos cucharadas de agua fría y agregue el jarabe de azúcar. Llevar a ebullición, retirar del fuego y dejar enfriar un poco antes de pasar el glacial sobre Charlotte para esmaltar.", "Batir la crema y el azúcar glas en un bol hasta que se formen picos suaves cuando se retire la batidora del bol y la cuchara en una manga pastelera equipada con una boquilla de estrella mediana.", "Pase un diseño de crema de festón continuo alrededor de la base de Charlotte royale y decore con fresas en abanico y glaseadas."], "url": "www_bbc_co_uk_food_recipes_charlotte_royale_85654", "title": "Royal Charlotte", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/charlotte_royale_85654_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla española grande, dejada entera", "50 g / 1 oz de azúcar en polvo", "600 g / 1 libra 5 piezas de carne colgador", "50 g / 1 oz de azúcar en polvo", "60 g / 2¼ oz de sal marina fina", "2 bayas de enebro, aplastadas", "1 diente de ajo, aplastado", "1 hoja de laurel", "50 g / 1¾oz de albahaca, hojas recogidas, lavadas y secadas", "125g / 4½ oz de aceite vegetal u otro aceite neutro", "pizca de sal", "25 g / 1 oz de sal", "25 g / 1 oz de azúcar en polvo", "8 lanzas de espárragos, recortadas y tallos fregados", "45 g / 1½ oz de queso azul, preferiblemente queso azul Garstang, más extra para decorar", "20g / ¾oz de cuajada de cabras, preferiblemente cuajada de cabras de Leagram", "2 cucharadas de suero de leche", "Crema agria de 25 g / 1 oz", "Mayonesa 25 g / 1 oz", "25g / 1oz% 20stock% 20syrup% 20 (no% 20too% 20sweet;% 20ratio% 20of% 2030 %% 20sugar% 20to% 2070 %% 20water)% 20", "1 diente de ajo pequeño, finamente picado", "sal al gusto", "Salsa Worcestershire, al gusto", "vinagre de vino blanco, al gusto", "selección de hierbas frescas de jardín", "ajo silvestre o flores de cebollino"], "method": ["Para el glaseado de cebolla caramelizada, precalentar el horno a 240 ° C / 220 ° Ventilador / Gas 9. Asar la cebolla en una bandeja durante 1 hora o hasta que la cebolla se haya suavizado y caramelizado.", "Mientras tanto, para el bistec colgado, ponga el azúcar, la sal, las bayas de enebro, el ajo, la hoja de laurel y 500 ml / 18 fl oz de agua en una cacerola grande y ajústelos a fuego medio-alto. Revuelva continuamente mientras lleva el agua al punto de ebullición para ayudar a que el azúcar y la sal se disuelvan. Retirar del fuego y dejar enfriar por completo. Coloque el bistec colgado en la salmuera y déjelo durante 1 hora a temperatura ambiente.", "Para el aceite de albahaca, cortar aproximadamente las hojas de albahaca y colocar en la licuadora. Vierta el aceite en la licuadora y agregue una pizca de sal. Mezcle a máxima potencia durante un par de minutos hasta que las hojas de albahaca se hayan descompuesto por completo. Pase el aceite a través de un colador forrado con muselina (gasa) y déjelo escurrir. Transfiera a una pequeña botella o jarra.", "Para los espárragos, vierta 1 litro / 1¾ pintas de agua en una sartén, deje hervir y sazone con sal y azúcar. Cuando hierva, deje caer los espárragos en el agua y cocínelos durante 1-2 minutos, o hasta que los espárragos estén recién cocinados. Debería poder deslizar un cuchillo pequeño a través del tallo. Retire de la sartén con una cuchara ranurada y sumérjala en un recipiente con agua helada (esto es para evitar que se cocine más y conserve el color).", "Para el aderezo, coloque el queso, cuajada, suero de leche, crema agria, mayonesa, sirope y ajo en una licuadora (alternativamente coloque en una jarra y procese con una batidora). Pulse hasta que quede suave.", "Sazone el aderezo al gusto con un poco de sal, salsa Worcestershire y vinagre de vino blanco. Mezcle bien y luego guárdelo en un frasco o en una botella apretada en la nevera. Usar dentro de 4 días", "Cuando la cebolla esté suave y caramelizada, retírela del horno, pero déjela encendida. Retire la piel y exprima todo el jugo de la cebolla que pueda. Reserve el jugo Agregue el azúcar impalpable y 25 ml / 1 fl oz de agua en una olla pequeña y caliente hasta que se forme un caramelo. Agregue el jugo de cebolla reservado y reduzca hasta que esté lo suficientemente grueso como para cubrir la parte posterior de una cuchara.", "Cuando esté listo para cocinar el bistec, precaliente una sartén resistente al horno y de base pesada a fuego alto. Retire el bistec de la salmuera y séquelo con papel de cocina. Rocíe un poco de aceite en la sartén caliente y cocine hasta que el bistec esté bien carbonizado. Cepille un poco de caramelo de cebolla sobre el bistec y transfiera la sartén al horno. Asar por unos 4 minutos.", "Regrese la sartén del horno a fuego alto. Vierta un poco más de caramelo de cebolla sobre el bistec y cocine a fuego alto hasta que el bistec se haya vuelto caramelizado y pegajoso, rociándolo con caramelo de cebolla. Permita descansar en un lugar cálido durante 5 minutos antes de tallar.", "Para servir, rocíe un aderezo de queso azul en el centro del plato y coloque los espárragos calientes encima. Adorne con unos trozos de queso azul.", "Cortar el bistec en porciones y colocar los platos para servir. Vístase con los jugos de cocina del filete, un chorrito de aceite de albahaca y las hierbas y el ajo silvestre o las flores de cebollino. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_charred_hanger_steak_99567", "title": "Solomillo de bistec con espárragos y aderezo de queso azul", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 plátanos maduros, sin pelar", "2 ramitas de romero fresco", "2 cucharadas de helado de vainilla listo para usar de buena calidad", "1 fruta de la pasión, semillas recogidas", "aceite vegetal, para freír", "75g / 2½ oz de harina de maíz", "125ml / 4½fl oz de agua con gas", "1 plátano maduro, pelado y cortado por la mitad a lo largo", "150 g / 5 oz de azúcar en polvo", "2 cucharadas de semillas de sésamo", "25g / 1oz de mantequilla, ablandada, para engrasar", "2 cucharadas de azúcar en polvo, para quitar el polvo", "3 claras de huevo de gallinas camperas", "50ml / 2fl oz de crema de vainilla lista para usar, más extra para servir", "2 maracuyá, semillas recogidas", "1 cucharada de azúcar glas", "2 cucharadas de helado de vainilla listo para usar de buena calidad"], "method": ["Para los plátanos y el helado carbonizados (el postre de los niños), precaliente el horno a 200C / 180C Fan / Gas 6.", "Con un cuchillo afilado, haga una pequeña hendidura en un extremo de cada plátano. Coloque una ramita de romero en cada hendidura.", "Caliente una sartén a fuego alto. Agregue los plátanos y cocínelos durante 4-5 minutos por cada lado, o hasta que estén ennegrecidos por todos lados y calientes.", "Para servir, divida los plátanos longitudinalmente y ábralos un poco, luego colóquelos en platos para servir (puede devolverlos a sus pieles para servir, si lo desea). Cubra con una bola de helado y espolvoree con las semillas de maracuyá.", "Para los plátanos de sésamo y caramelo (postre de los adultos), caliente el aceite en una freidora a 190 ° C. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje sin supervisión.) Mientras tanto, prepare un recipiente con agua helada.", "En un tazón, mezcle la harina de maíz y el agua con gas hasta que estén suaves y bien combinados. Agregue las mitades de plátano y mezcle suavemente hasta que esté cubierto.", "Con cuidado, baje los plátanos maltratados en aceite caliente y fríalos por 2-3 minutos, o hasta que estén muy dorados. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina.", "Mientras tanto, caliente el azúcar, sin remover, en una sartén de base pesada a fuego alto. Agita la sartén hasta que el azúcar se derrita y se vuelva un caramelo dorado claro. Agregue las semillas de sésamo, luego sumerja la base de la sartén en un recipiente lleno de agua fría para evitar que el caramelo se siga cocinando.", "Con una cuchara, con cuidado enrolle las maltas mitades de plátano en el caramelo caliente, una a la vez, hasta que estén completamente cubiertas. (PRECAUCIÓN: el azúcar derretido es extremadamente caliente.) Transfiera al recipiente con agua helada hasta que esté completamente frío, luego déjelo a un lado para drenar.", "Para el suflé, precalentar el horno a 230 ° C / 210 ° Ventilador / Gas 8. Engrasar dos moldes grandes con mantequilla y luego espolvorear el interior con una capa de azúcar.", "Batir las claras de huevo en un recipiente limpio hasta que se formen picos firmes cuando se quite el batidor.", "Dobla las semillas de natillas y fruta de la pasión en las claras de huevo batidas, luego coloca la mezcla cuidadosamente en los moldes, alisa las puntas con una espátula y colócalas en una bandeja para hornear.", "Hornee los soufflés en el horno durante 8-10 minutos, hasta que se levanten y se doren.", "Espolvoree los soufflés con el azúcar glas y sirva inmediatamente, con una cucharada de flan, una de las mitades de plátano de sésamo y una bola de helado al lado."], "url": "www_bbc_co_uk_food_recipes_charred_bananas_and_ice_46997", "title": "Plátano carbonizado y helado con suflé de maracuyá y plátano de sésamo y caramelo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas (2 adultos y 2 niños)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 puerros, cortados por la mitad a lo largo", "800ml / 1⅓ pinta de aceite vegetal", "55 g / 2 oz de yemas de huevo pasteurizadas", "1 cucharada de mostaza Dijon", "500 g / 1 libra de aceite de puerro 2 oz (desde arriba)", "4 cucharaditas de vinagre de vino blanco", "2 cucharaditas de jugo de limón", "1 puerro mediano, extremos cortados", "sal y pimienta", "1 baguette delgado, finamente cortado", "2-3 cucharadas de aceite de oliva", "2 yemas de huevo", "aceite vegetal o mantequilla, para freír", "50g / 1¾oz pequeños girolles (champiñones)", "100ml / 3½fl oz de caldo de verduras", "vinagreta (hecha de 3 cucharadas de aceite de oliva, 1 cucharada de vinagre de vino blanco y 1 cucharadita de mostaza Dijon mezcladas)", "algunas ramitas cebolletas, tapas verdes solamente", "algunas ramitas perifollo, hojas recogidas", "sal y pimienta"], "method": ["Para el aceite de puerro carbonizado, caliente una plancha. Cuando esté caliente, agregue los puerros con el lado cortado hacia abajo y cocine hasta que queden carbonizados. Dé la vuelta a los puerros y cocínelos del otro lado hasta que estén suaves. Coloque en un recipiente con el aceite y déjelo en un lugar cálido (idealmente a alrededor de 50 ° C / 122 ° F) durante 4-5 horas. Luego, déjalo toda la noche para infundir. Cuele el aceite antes de usar.", "Para la mayonesa de puerro, en un procesador de alimentos, mezcle las yemas de huevo y la mostaza para combinar. Con el motor encendido, agregue el aceite de puerro en una corriente fina y constante hasta que la mezcla emulsione y forme una mayonesa. Agregue el vinagre de vino blanco y el pulso para combinar. Sazone con sal, pimienta y un poco de jugo de limón, al gusto. Guarde en el refrigerador hasta que esté listo para servir.", "Para los puerros y girolles, sazone todo el puerro con sal y pimienta y póngalo sobre una plancha caliente hasta que esté todo carbonizado y suave. Transfiera a una bandeja para hornear y cubra con una película adhesiva para mantenerse caliente.", "Sazone las rebanadas de baguette con sal y pimienta y cepille con aceite de oliva. Tueste ambos lados en la plancha para hacer croûtons.", "Caliente el aceite de puerro restante en una sartén pequeña a fuego lento. Baje suavemente las yemas de huevo en el aceite y cocine muy suavemente durante unos seis minutos.", "Calentar la mantequilla en una sartén y, al hacer espuma, freír los girolles hasta que estén blandos. Agregue el caldo de verduras, luego apague el fuego y agregue un poco de vinagreta a la mezcla.", "Para servir, corte el puerro caliente por la mitad y elimine la capa exterior ennegrecida. En recipientes poco profundos, mezcle el puerro en la vinagreta restante. Coloque las yemas de huevo encima, seguidas de los champiñones y una cucharada de mayonesa de puerro. Si lo desea, espolvoree un poco del licor de cocción de los champiñones.", "Adorne con la baguette tostada y las hierbas."], "url": "www_bbc_co_uk_food_recipes_charred_leeks_with_40366", "title": "Puerros carbonizados con girolles y mayonesa de puerro", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175ml / 6fl oz de salsa de soja oscura", "120ml / 4fl oz de sake", "3 cucharadas de mirin", "2 cucharadas de salsa de ostras o teriyaki", "75g / 2½ oz de azúcar", "Vientre de cerdo de la pieza de la piel de 500g / 1lb 2oz, rodado", "½ puerro, en rodajas (o 1 cebolla pequeña, en rodajas)", "4 dientes de ajo enteros, pelados", "4 cm / 1½ en pieza de jengibre, en rodajas gruesas"], "method": ["Ponga la salsa de soja, sake, mirin, salsa de ostras (o salsa teriyaki) y azúcar en una sartén pequeña. Llevar a fuego lento para disolver el azúcar.", "Precalentar el horno a 140C / 300F / Gas 2.", "Coloque la carne de cerdo en una pequeña lata de asar profunda. Vierta sobre el líquido caliente. Agregue el puerro (o cebolla), el ajo y el jengibre. Dependiendo del ancho de la lata, agregue 400-500ml / 14-18fl oz de agua caliente, suficiente para no cubrirlo por completo, ya que se girará de vez en cuando.", "Cubra ligeramente con una doble capa de papel de aluminio y deje un pequeño espacio para que escape el vapor.", "De vez en cuando, revuelva la carne de cerdo y cocine hasta que la carne de cerdo esté tierna, alrededor de 2 a 2 horas y media.", "Una vez cocido, retire del horno, deje enfriar en el líquido y colóquelo en un recipiente sellado con los jugos. Deje que se enfríe antes de ponerlo en la nevera; es más fácil tallar cuando está frío en la nevera. Si lo usa de inmediato, déjelo descansar durante 20 minutos."], "url": "www_bbc_co_uk_food_recipes_chashu_japanese_braised_37473", "title": "Chashu (cerdo estofado japonés)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla", "1 maíz en la mazorca, sin cáscara", "1 cucharada de cebollino picado", "½ cucharadita de pimienta de cayena", "sal y pimienta negra recién molida", "pequeño puñado de cada flatleaf perejil, albahaca y eneldo", "exprimir jugo de limón", "1 cucharada de aceite de oliva"], "method": ["Calentar la mantequilla en una sartén pequeña. Con un cuchillo afilado, corte con cuidado los granos de la mazorca de maíz, agregue a la sartén y cocine suavemente durante 1-2 minutos.", "Agregue el cebollín y la pimienta de cayena, sazone bien con sal y pimienta negra recién molida y cocine durante un minuto más.", "Coloque las hierbas en un recipiente, rocíe con el jugo de limón y aceite de oliva y revuelva bien.", "Para servir, apile las hierbas vestidas en un plato para servir y cubra con el maíz."], "url": "www_bbc_co_uk_food_recipes_charredcornwithcayen_87224", "title": "Maíz carbonizado con mantequilla de cayena y ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]