[{"isVegetarian": false, "title": "Fruits de mer with homemade rye bread and whipped butter", "url": "www_bbc_co_uk_food_recipes_fruits_de_mer_with_26114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz wholegrain rye flour, plus extra for dusting", "25g/1oz dark brown muscovado sugar", "10g salt", "10g fast-action dried yeast", "200g/7oz unsalted butter, softened", "12 langoustines", "12 razor clams, scrubbed", "400g/14oz clams in their shells, scrubbed", "1 x 1kg/2lb 4oz cooked lobster", "1 medium-sized cooked brown crab", "8 oysters, shucked", "16 cooked shrimps in their shells", "200g/7oz cooked brown shrimps", "3 free-range egg yolks", "1 tbsp Dijon mustard", "2 tbsp cider vinegar", "1 unwaxed lemon, juice and finely grated zest", "300ml/10½fl oz rapeseed oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rye bread and butter, place the flour, sugar and salt in a large bowl or a food mixer fitted with a dough hook. Pour 200ml/7fl oz tepid water into a jug and sprinkle over the yeast, mixing to combine. Gradually add the yeasted water to the dry ingredients, mixing continuously, until all of the yeasted water has been incorporated. Add another 150ml/5fl oz water and mix until it comes together as a dough.", "Turn the dough out onto a lightly floured work surface and knead well for 5-10 minutes, or until smooth and elastic. Roll the dough into a long sausage shape, then transfer to a baking tray lined with baking parchment, cover loosely with cling film, and set aside to prove for at least 6 hours, but preferably overnight, until the dough has doubled in size.", "When the dough has proved, preheat the oven to 220C/200C Fan/Gas 7. Uncover the dough and dust with a little rye flour, then slash the top diagonally a few times using a sharp knife. Bake the loaf in the oven for 30 minutes, or until golden-brown and the base sounds hollow when tapped firmly. Set aside to cool slightly.", "Meanwhile, blend the softened butter in a food processor until pale and fluffy, then transfer to a serving dish.", "For the fruits de mer, steam the langoustines, razor clams and clams for 5-8 minutes, or until cooked through (discard any clams that do not open during cooking). To do this you can place the different ingredients into separate layers of a steamer and suspend the stack over a pan half-filled with boiling water. Alternatively, steam each ingredient separately using a steamer insert. Set aside.", "Cut the lobster in half lengthways and remove the legs and claws. Discard the head contents, leaving just the body meat. Crack the lobster claws and knuckles by bashing them with a rolling pin, then pick out the meat and pile it back into the body shell.", "Open the shell of the crab and discard the dead man’s fingers (the sponge-like gills). Remove the claws and crack by bashing them with a rolling pin. Pick out the meat and pile it back into the crab shell.", "For the mayonnaise, whisk the egg yolks, mustard, vinegar and lemon juice in a bowl until well combined. Gradually add the oil in a thin stream, whisking continuously, until it has all been incorporated into the mixture to form a thick mayonnaise. Stir in the lemon zest and season, to taste, with salt and freshly ground black pepper. ", "To serve, pile the seafood, including the oysters and shrimps, onto a large serving platter. Serve the lemon mayonnaise and whipped butter in bowls alongside, with the sliced rye bread."]}, {"isVegetarian": true, "title": "Fruit salad", "url": "www_bbc_co_uk_food_recipes_fruitsalad_67181", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp amaretto liquor", "200g/7oz strawberries, halved", "200g/7oz blueberries", "200g/7oz melon, cubed", "mint, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Soak all the fruit in the amaretto for at least 1 hour.", "Serve the fruit in a glass and spoon over a bit of the amaretto used to marinate the fruit in.", "Garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Gluten-free fruit scones", "url": "www_bbc_co_uk_food_recipes_fruitscones_74767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["275g/10oz rice flour", "50g/2oz tapioca flour", "4 tsp gluten-free baking powder", "2 tsp xanthan gum", "1 tsp salt", "4 tbsp caster sugar", "110g/4oz butter", "110g/4oz sultanas", "2 eggs, preferably free-range", "125ml-175ml/4-6fl oz natural yoghurt", "1 egg, beaten, for egg wash"], "serves": "Makes 15", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 250C/475F/Gas 9.", "Sift all the dry ingredients into a large bowl and mix well. Rub in the butter. Add the sultanas and gently mix together. ", "Lightly whisk the eggs and natural yoghurt together.", "Make a well in the centre of the dry ingredients and add the egg and yoghurt mixture. Mix to soft dough, adding a little more natural yoghurt if necessary. ", "Turn onto a rice-floured board and knead lightly, just enough to shape into a round. Roll out to about 2.5cm/1in thick and cut out rounds using a 5.5cm/2¼in cutter. Place on a rice-floured baking sheet and brush with a little egg wash. ", "Bake for approximately 10 minutes until golden brown on top. Leave to cool on a wire rack. ", "Serve split in half with butter and homemade raspberry jam."]}, {"isVegetarian": true, "title": "Fruity bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_fruity_bread_and_butter_22104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing and buttering the brioche", "10–12 slices square brioche loaf", "300g/10½oz raspberries", "125g/4½oz caster sugar", "1–2 tbsp raspberry liqueur, such as framboise (optional)", "4 free-range eggs", "400ml/14oz milk", "400ml/14oz double cream", "1 large orange, zest only", "1–2 tbsp demerara sugar"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Butter a large shallow ovenproof pie dish. Butter the brioche slices and cut in half on the diagonal. Arrange a layer of the slices, butter side up, in the dish. Put 100g/3½oz of the raspberries in a small bowl and sprinkle with the raspberry liqueur if using and 2 tablespoons of the caster sugar. Crush very lightly, then spoon this over the brioche layer. ", "Sprinkle over a few more whole raspberries. Top with the remaining brioche slices, then arrange the remaining raspberries over the brioche, tucking a few in between the slices as well as leaving a fair few on top.", "Whisk the remaining sugar with the eggs, then add the milk, double cream and orange zest. Make sure everything is well combined, then pour this mixture over the brioche and raspberries. ", "Leave the pudding to stand for around half an hour. Preheat the oven to 180C/160C Fan/Gas 4. Dot the pudding with a few knobs of butter, then sprinkle over the demerara sugar.", "Bake in the oven for 35–45 minutes, or until well set, golden-brown and lightly toasted in places. Eat hot or cold."]}, {"isVegetarian": true, "title": "Fruity filo parcels", "url": "www_bbc_co_uk_food_recipes_fruity_filo_parcels_52065", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tinned pear, drained, juice reserved", "4 tsp mixed dried fruit ", "30g/1oz unsalted butter ", "large pinch of mixed spice ", "1 tsp caster sugar ", "4 sheets fresh filo pastry"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to heat the oven to 200C/400F/Gas 6. Measure the dried mixed fruit into a cup then add some pear juice from the tinned fruit – put to one side for five minutes while you chop up the pear. ", "Chop up the pear into a bowl with the scissors – ask a grown-up to help you use the scissors. Drain the mixed fruit and add it to the pear. ", "Ask a grown-up to help you melt the butter in small saucepan, then place into a mixing bowl with the mixed spice and the sugar. Stir with the pastry brush. Spread out a sheet of filo with the short side nearest to you and brush the filo with the butter mixture.", "Place a quarter of the fruit mix in the centre at the edge nearest to you and then fold in the long sides to cover the mixture. ", "Brush the filo again with some more of your butter mix, then roll up the length of the pastry to make a parcel.", "Repeat to make four parcels and brush the top of each with the remaining butter mixture. Place onto a baking tray. Ask a grown-up to put them in the preheated oven and bake for 10 minutes. Leave to cool before eating as the filling is very hot! Serve the parcels with plain yoghurt."]}, {"isVegetarian": true, "title": "Fruity fritters", "url": "www_bbc_co_uk_food_recipes_fruity_fritters_83168", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruity_fritters_83168_16x9.jpg", "ingredients": ["200g/7oz self-raising flour (white or wholemeal)", "2 free-range eggs", "150ml/5fl oz milk", "1 tbsp butter, for cooking", "2 bananas, sliced or 2 large apples, cored and sliced into 1cm/½in rings or a handful of frozen soft fruits (or a mixture)", "½ tsp cinnamon", "2 tsp caster sugar "], "serves": "Makes 10-12 fritters", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Kid’s job: Sift the flour into a large bowl. ", "Kid’s job: Knock the egg gently on the work surface to crack it – cracking on a flat surface will create less little bits of shell. Pull the egg open over a small bowl. Pull out any bits of shell that have fallen into the bowl. (Wash your hands after handling eggs.)", "Kid’s job: Add the eggs and a little bit of the milk to the sifted flour and stir with a whisk or fork. Add the rest of the milk bit by bit, mixing as much as you can to get rid of any lumps. Leave the mixture to stand for a few minutes. ", "Kid’s job: Gently stir in the fruit that you want to use. Dip the apple rings into the batter so they are coated on both sides. Be careful – they are fragile!", "Adult’s job: Melt a teaspoon of butter in a frying pan over a medium heat.", "Adult’s job: Carefully drop four large spoonfuls of the fritter batter onto the frying pan making sure you leave space around each spoonful as the fritters with spread as they cook. Apple rings will make one fritter each.", "Adult’s job: Cook for 3-4 minutes on one side. You should see bubbles forming and the mixture should begin to set around the edges.", "Adult’s job: Carefully flip over the fritters and cook on the other side until they are golden-brown and cooked through this should take another 3-4 minutes. Repeat until you have used all of the batter mix, adding a little more butter each time you add more fritters to the pan.", "Kid’s job: While the fritters are cooking, mix the cinnamon and sugar together in a small bowl. Sprinkle the cooked fritters with cinnamon sugar and tuck in."]}, {"isVegetarian": true, "title": "Fruity fromage frais cake", "url": "www_bbc_co_uk_food_recipes_fruity_fromage_frais_48250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 45g/1¾oz pot fruit-flavoured fromage frais (pot washed and reserved for measuring the sugar and flour, see below)", "1 free-range egg", "½ pot caster sugar", "3 pots self-raising flour", "1 fresh peach or nectarine, stone removed, chopped", "2 tbsp vegetable oil plus some extra for brushing loaf tin"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a loaf tin with a little vegetable oil. ", "Beat the fromage frais with the egg until smooth and well combined.", "Add half a pot of the sugar and three pots of the flour to the egg mixture and beat well. Add the chopped peach and vegetable oil and beat again.", "Scrape the cake mixture into the prepared loaf tin and place the tin onto a baking tray. Bake in the oven for 25-30 minutes, or until the top of the cake is golden-brown and a skewer inserted into its centre comes out clean. Set aside to cool, then slice."]}, {"isVegetarian": true, "title": "Fruity prize pie", "url": "www_bbc_co_uk_food_recipes_fruity_prize_pie_78823", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/5oz shortcrust pastry", "plain flour", "2 heaped tsp rolled oats", "140g/5oz fresh cherries", "2 heaped tbsp demerara sugar ", "pinch of cinnamon "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Put some baking paper on the baking tray. Ask a grown-up to preheat the oven to 200C/400F/Gas 6.", "Flour your worktop or table with a little plain flour.  Shape the pastry in your hands into a rough disc shape.  You can turn it on its side and roll it or use the palm of your hands to pat the corners until it is round.", "Roll the pastry out, turning the pastry often so that it stays round. It should be about 5mm thick and about 20cm across.  Put onto the baking tray.", "Sprinkle the centre of the pastry with the oats, leaving space all around – like an island of oats – these will soak up the fruit juices!", "Pull the stalks off the cherries and put them into a plastic bag. Bash gently with the rolling pin to split them. Tip the cherries and their juices into the mixing bowl and pick out the stones – be sure to double check that all the stones have been removed. Add one tablespoon of the demerara sugar and a pinch of cinnamon, then stir.  ", "Place the cherries into the middle of the pastry on top of the oats, leaving the edge of the pastry free of fruit. Brush the edge with cherry juice.", "Now bring the edges of the pastry up over the cherries and pinch the pastry together to hold it in place. You should still be able to see some of the fruit at the top of the pie. Now brush the pastry with the juice again. Sprinkle a little more sugar on top.", "Ask a grown-up to put it in the preheated oven for 20–25 minutes.  Serve warm or cold with yoghurt or ice cream."]}, {"isVegetarian": true, "title": "Fruity Swedish tea ring", "url": "www_bbc_co_uk_food_recipes_fruity_swedish_tea_ring_19325", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["420g/15oz strong white flour, plus extra for dusting", "7g salt (approximately a teaspoon)", "10g/⅓oz fast-action yeast", "25g/1oz unsalted butter, softened and cut into cubes, plus extra for greasing", "35g/1¼oz caster sugar", "2 medium free-range eggs", "100ml/3½fl oz full-fat milk, warmed", "75g/2½oz dried cherries", "75g/2½oz mixed peel", "75g/2½oz sultanas", "75g/2½oz dried apricots, chopped", "100g/3½oz pecans, chopped", "60g/2¼oz caster sugar", "3 tsp ground cinnamon", "2 tbsp apricot jam ", "1 lemon, juice only", "100g/3½oz icing sugar"], "serves": "Makes 1 large loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, salt, yeast, butter, sugar, eggs, milk and 50ml/1¾fl oz water in a bowl. Mix with a spoon until combined.", "Add another 50ml/1¾fl oz water and knead in a freestanding mixer with a dough hook attachment for five minutes, or until you have a smooth soft dough. Cover with a tea towel and leave to prove for 45 minutes in a warm place. ", "For the filling, combine the fruit and nuts in one bowl, and the sugar and cinnamon in another. ", "When the dough is proved, turn it out onto a lightly floured work surface. Knock back the dough and lightly knead. ", "Roll the dough out into a 40x60cm/16x23½in rectangle, taking care not to knock all the air out. ", "Sprinkle the sugar and cinnamon mixture evenly over the dough and then cover with the fruit and nuts. ", "Starting at a long side, carefully roll the dough up into a cylinder (like a Swiss roll). Shape into a ring then use water to stick the two ends together.", "Grease a large baking tray with butter. Lift the dough onto the tray and, using scissors, make vertical cuts around the outer edge of the ring, leaving a 4cm/1½in gap between each cut. ", "Put the formed ring into a proving bag and leave to rise for 40 minutes.", "Preheat the oven to 190C/375F/Gas 5.", "Bake the proved loaf for 15 minutes, then check if the loaf is browning too quickly. Cover it with aluminium foil (to prevent it burning) if necessary and return to the oven for another 5-10 minutes, or until cooked through and golden-brown. ", "For the decoration, gently heat the apricot jam to make a glaze.", "Once baked, remove the tea ring from the oven and brush it with the apricot glaze. Set aside to cool completely on a wire rack.", "Make an icing by combining the lemon juice and the icing sugar until smooth. When fully cooled, drizzle the lemon icing over the loaf and serve."]}, {"isVegetarian": false, "title": "Fruity beef casserole with parsley dumplings", "url": "www_bbc_co_uk_food_recipes_fruitybeefcasserolew_72908", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb beef cut into 5cm/2inch pieces", "seasoned flour for dusting", "2 tbsp vegetable oil or beef dripping", "175g/6oz smoked bacon, diced", "2 stalks celery, finely chopped", "1 large onion, finely diced", "2 cloves garlic, finely chopped", "2 sprigs thyme", "2 tbsp redcurrant jelly", "275ml/10fl oz of red wine", "500ml/1 pint game or beef stock", "150ml/5fl oz port", "1 tbsp Worcestershire sauce", "12 stoned prunes", "55g/2oz dried cherries", "55g/2oz dried cranberries", "225g/8oz chestnuts, cooked and peeled", "115g/4oz button mushrooms", "2 bay leaves", "organic orange, zest only", "1 tbsp tomato purée", "2 tbsp rough chopped parsley", "salt", "freshly black ground pepper", "250g/9oz plain flour, plus extra for dusting", "1 tsp salt", "2 tsp baking powder", "2 tbsp olive oil", "4 tbsp fresh flatleaf parsley, chopped, plus extra for garnish", "4 tbsp fresh chives, snipped", "150ml/¼ pint milk", "new potatoes and braised red cabbage"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1. ", "Meanwhile, toss the beef in the seasoned flour. Heat the oil or dripping in an ovenproof casserole dish and brown the beef all over. ", "Add the bacon, celery, onion, garlic and thyme and cook for 6-8 minutes without browning. Add the redcurrant jelly, wine, stock, port and Worcestershire sauce along with the dried fruit, chestnuts, mushrooms, bay leaves, orange zest and tomato purée.", "Bring slowly to simmering point then cover and cook in the oven for two to two and a half hours or until the beef is tender. ", "Turn the oven up to 180C/350F/Gas Mark 4 after about an hour-and-a-half to two hours. ", "To make the dumplings - sift the flour, salt and baking powder into a large bowl. Make a well in the centre and add the olive oil and herbs, then pour in the milk and, using a fork, mix to form a soft dough. ", "Place the dough on a lightly floured surface and knead briefly. Divide and shape into 16 teaspoon-sized dumplings. ", "Place the dumplings on the surface of the casserole, cover and place in the oven (now at the higher temperature) for the last 35-40 minutes, or until the dumplings have risen and are golden brown.", "Remove the casserole from the oven and allow to rest for five minutes. Skim off any fat that has risen to the surface.  Season to taste and fold in the parsley.", "Serve with new potatoes and red braised cabbage."]}, {"isVegetarian": false, "title": "Fruity yoghurt jellies", "url": "www_bbc_co_uk_food_recipes_fruity_yoghurt_jellies_38771", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruity_yoghurt_jellies_38771_16x9.jpg", "ingredients": ["4 sheets leaf gelatine", "6 tbsp sugar-free lemon or orange squash", "½ lemon, zest only, finely grated", "150g/5½oz fat-free natural yoghurt", "200g/7oz mixed fresh berries (alternatively use frozen berries)", "small handful fresh mint leaves"], "serves": "Makes 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Put the gelatine sheets in a medium bowl and cover with cold water. Leave to soak for five minutes or until they soften. Turn them a couple of times to make sure they don’t stick together.", "Pour the squash, lemon zest and 100ml/3½fl oz of water into a small saucepan and heat very gently until just warm. Remove from the heat. ", "Squeeze the gelatine sheets to remove excess water and then add to the pan, stirring until it melts in to the liquid. ", "Stir in 250ml/9fl oz water and the yoghurt until they are thoroughly combined. ", "Pour the jelly into four glass tumblers or dishes, cover with cling film and chill for 5-6 hours or overnight until set.", "Serve the jellies topped with fresh berries and mint leaves to decorate."]}, {"isVegetarian": false, "title": "Frutti di mare with saffron fregola", "url": "www_bbc_co_uk_food_recipes_frutti_di_mare_with_55525", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz shell-on prawns", "4 tbsp olive oil", "300ml/10fl oz fish stock", "500g/1lb 2oz fregola", "1 onion, finely chopped", "2 garlic, finely chopped", "1 red chilli, finely chopped or ½ tsp dried red chilli flakes", "sprig thyme", "1 tsp dried oregano", "pinch ground saffron", "100ml/3½fl oz white wine or vermouth", "4 medium tomatoes, skinned and roughly chopped", "200g/7oz clams, cleaned", "200g/7oz mussels, cleaned and beards removed ", "12 small scallops", "small bunch basil, leaves only", "small bunch parsley, leaves only", "lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take the heads and shells off the prawns and devein them. Set aside the peeled prawns.", "Heat a tablespoon of olive oil in a large, lidded frying pan and add the prawn shells and heads. Fry for 1–2 minutes until they have turned pink, then pour in the fish stock. Allow it to bubble up, stirring vigorously, then simmer for 5 minutes. ", "Remove from the heat and strain. Discard the prawn shells and heads and reserve the liquor.", "Bring a large pot of water to the boil and add plenty of salt and the fregola. Simmer until just al dente – around 10 minutes. Drain and set aside.", "While you are cooking the fregola, heat two tablespoons of olive oil in the frying pan. Add the onion and fry until softened. Add the garlic, chilli, herbs and saffron, then pour in the white wine. ", "Cook for a couple of minutes until reduced in volume, then add the reserved stock and the tomatoes. Simmer for 5 minutes. ", "Gently tap any clams and mussels with open shells against the counter top. Discard any that do not close their shells within a few minutes or that have cracked or chipped shells. ", "Stir the fregola into the tomato mixture. Put the clams and mussels on top and cover. Cook for a further 2–3 minutes or until the clams and mussels have opened – discard any shellfish that don't open.", "In a separate frying pan, heat the remaining tablespoon of olive oil. Fry the reserved prawns on both sides very quickly, then add them to the fregola. Repeat with the scallops.", "To serve, stir in the basil and parsley and serve immediately with lemon wedges on the side."]}, {"isVegetarian": true, "title": "Frying pan apple custard crumble", "url": "www_bbc_co_uk_food_recipes_fryingpanapplecustar_65966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large knob of butter", "4 dessert apples, peeled and sliced", "1 tbsp light muscovado sugar", "4-6 tbsp fresh custard", "large knob of butter", "50g/2oz jumbo porridge oats", "1 tbsp desiccated coconut", "25g/1oz pecan nuts, roughly chopped", "pinch ground cinnamon", "2 tbsp light muscovado sugar", "1 tbsp sunflower oil ", "1-2  tbsp maple syrup"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two large non-stick frying pans and add a knob of butter to each. Once melted add the apple slices and sugar to one pan and cook for 3-4 minutes until softened.", "Add the porridge oats, coconut, pecan, cinnamon and light muscovado to the other and cook for 3-4 minutes over a high heat until golden - add the oil if the mixture feels too dry.", "Once the apples have softened, stir in the custard, warm through, then divide between two serving dishes. Stir the maple syrup into the crumble, then spoon over the apple custard. Serve warm."]}, {"isVegetarian": true, "title": "Fudgy walnut cake", "url": "www_bbc_co_uk_food_recipes_fudgy_walnut_cake_63895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fudgy_walnut_cake_63895_16x9.jpg", "ingredients": ["75g/2½oz walnuts", "225g/8oz butter, softened, plus extra for greasing", "225g/8oz light brown muscovado sugar", "4 large free-range eggs", "225g/8oz self-raising flour", "1 tsp baking powder", "150g/5½oz butter, softened", "150g/5½oz icing sugar, sifted", "250g/9oz fudge, roughly chopped", "25g/1oz walnut halves"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the cake, preheat the oven to 190C/375F/Gas 5. Butter two 20cm/8in loose-based sandwich tins and line the bases with discs of baking parchment. ", "Put the walnuts in a food processor and blend on the pulse setting until chopped into very small pieces, but not at all fine or powdery. Don’t worry if there are a few larger pieces of nut remaining, these will add texture to the sponge. Tip the nuts into a bowl.", "Put the butter and brown sugar, eggs, flour and baking powder into the food processor and blend on the pulse setting until well combined. You may need to remove the lid once or twice and push the mixture down with a rubber spatula. (If you don't have a food processor, tip all the ingredients into a large mixing bowl - then beat like hell!)", "Add the chopped nuts to the batter and mix until just combined. Spoon the mixture evenly into the two tins and smooth the surface. Bake on the same shelf in the centre of the oven for 25 minutes, or until well-risen and just beginning to shrink back from the sides of the tin.", "Remove the tins from the oven and leave to cool for five minutes before running a knife around the edge of each cake and turning out onto a wire rack. Peel off the baking parchment and leave to cool completely.", "To make the icing, put the butter in a food processor, or mixing bowl, add the icing sugar and 150g/5½oz of the chopped fudge. Blend until the icing is smooth and creamy. Add an extra 2-3 teaspoons of milk if necessary, so that the icing is light and spreadable. Don’t worry if some of the fudge remains chunky.", "Place one of the sponges onto a plate or cake stand and spread with half of the fudgy icing. Top with the second sponge and spread with the remaining icing, creating soft swirls and peaks. Decorate with the walnut halves and chopped fudge."]}, {"isVegetarian": false, "title": "Full English Wellington", "url": "www_bbc_co_uk_food_recipes_full_english_wellington_63948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour", "pinch salt", "225g/8oz unsalted butter, chilled", "1 free-range egg, beaten, to glaze", "10 quail's eggs", "200g/7oz chestnut mushrooms, chopped", "knob of butter", "100g/3½oz  sun-blushed tomatoes", "8 large pork sausages ", "200g/7oz black pudding", "200g/7oz Parma ham", "oil spray to grease the baking tray"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour and salt into a bowl. Divide the butter into four equal pieces and put three back in the fridge. Rub the remaining quarter of the butter into the flour until the mixture resembles fine bread crumbs.", "Add 125ml/4fl oz of water and bring it together to form a dough. Do not knead or over work the dough.", "Wrap the dough in cling film and place in the fridge to rest for 15 minutes.", "For the filling, bring a pan of water to the boil. Lower the eggs into the boiling water and immediately set a timer for two minutes and 45 seconds.", "Remove the eggs with a slotted spoon and place into a sieve. Put the eggs under running cold water for a minute and then place in a bowl of cold water for a few minutes.", "Peel the eggs and return them to the cold water and set aside.", "In a medium sized frying pan, fry the mushrooms in a knob of butter until golden-brown and softened.", "In a food processor, blend the sun-blushed tomatoes to a purée. Stir into the cooked mushrooms and put the mixture in the fridge to cool.", "Remove the pastry from the fridge along with one of the remaining three pieces of butter. On a lightly floured surface roll out the pastry to form a long rectangle.", "Dot the butter over the top two-thirds of the dough. Fold the bottom third over the butter and the top third over the top (like a letter ready to go into an envelope).", "Turn the dough 90 degrees and roll out to a long rectangle. Repeat the and folding, then wrap the pastry in cling film and chill for 15 minutes.", "Remove the skins from the sausages and black pudding. Crumble the black pudding into the sausage meat and stir to combine.", "Lay a large piece of cling film on the work surface. Place the Parma ham on the cling film, over-lapping at the edges to form a neat rectangle 28x20cm/11x8in.", "Spread the tomato and mushroom mixture over the ham leaving a 1cm/½in border. Spread the sausage meat on top of this. Then line up the boiled eggs lengthwise down the centre of the rectangle.", "Using the cling film to help, roll into a tight sausage, keeping the eggs in a line and in the middle of the sausage meat. Twist the ends of the cling film to seal and and chill in the fridge for 15 minutes.", "Take the pastry from the fridge with a remaining quarter of the butter. Repeat the process of dotting with butter, rolling the pastry, folding and chill again for a further 15 minutes.", "Unwrap the sausage and place it on a lightly oiled baking tray. Bake in the oven for 15-20 minutes.  Remove the sausage from the oven and cool completely.", "Take the pastry from the fridge and repeat the rolling, dotting and folding for the final time. Chill until ready to use.", "When the sausage is cold, roll out the pastry thinly. Cut into a neat rectangle around 38x25cm/15x10in and reserve the trimmed edges for decorating.", "Place the sausage in the middle of the pastry and cut off small squares at each corner to avoid too much pastry at the ends.", "Fold the pastry at each end up and over the sausage, then wrap the long sides of the pastry up and around. Brush the overlapping edges with water and gently press the pastry to seal.", "Place the Wellington on a baking tray seam side down and brush all over with beaten egg.", "Cut thin strips from the pastry trimmings and make a lattice pattern over the Wellington. Brush the decoration with the beaten egg and bake for 45 minutes. Check the Wellington after 30 minutes and cover with foil if it is browning too much.", "Allow to rest for 10 minutes before serving."]}, {"isVegetarian": true, "title": "Funfetti strawberry birthday cake", "url": "www_bbc_co_uk_food_recipes_funfetti_strawberry_03188", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/funfetti_strawberry_03188_16x9.jpg", "ingredients": ["250g/9oz unsalted butter, softened ", "250g/9oz caster sugar ", "250g/9oz free-range eggs, weighed in their shells (about 4 medium eggs)", "250g/9oz self-raising flour, sieved", "3 medium free-range egg whites ", "250g/9oz caster sugar ", "pinch salt ", "300g/10½oz unsalted butter, softened and cubed ", "3 tbsp strawberry milkshake powder", "75g/2½oz rainbow-coloured sprinkles ", "3 strawberry-filled sandwich biscuits, cut in half"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Grease and line a 14x20cm/5½x8in cake tin or 900g/2lb loaf tin.", "For the cake, put the butter, sugar, eggs and flour into a large mixing bowl. Using an electric hand whisk, beat for 3 minutes on medium speed until smooth and shiny. ", "Spoon the batter into the prepared tin. Level off the top, then bake on the middle shelf for 45–50 minutes, or until a skewer inserted comes out clean and the cake is golden-brown and well risen. Leave to cool for 10 minutes in the tin, then turn out to cool completely on a wire rack.", "Meanwhile, for the strawberry Swiss meringue buttercream, put the egg whites, sugar and salt into a heatproof bowl.  Place over a pan of gently simmering water (do not let the bottom of the bowl touch the water). ", "Using an electric hand whisk, mix on high speed for 5 minutes, or until glossy and thick. Remove from the heat and beat for 2 minutes, or until cooled to room temperature.", "Now quickly add the butter a cube at a time until you have used up all of it. The mixture may look quite loose and split, but don’t be alarmed – keep beating until it has cooled, thickened and come together. Beat in the strawberry milkshake powder until well incorporated. ", "Once the cake has cooled completely, trim the top and sides if necessary so the rectangle is neat and flat. Turn the cake upside down onto a cake board or stand. ", "Put half the buttercream in a piping bag with a large round tip nozzle attached and set aside. With the remaining buttercream cover the sides of the cake using an offset spatula. ", "Pipe tall peaks around the top edge of the cake. Scatter the sprinkles over the centre. Decorate the tops of some of the icing peaks with halved sandwich biscuits . "]}, {"isVegetarian": true, "title": "Funky beet muffins", "url": "www_bbc_co_uk_food_recipes_funky_beet_muffins_24134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "50ml/2fl oz vegetable oil", "30ml/1¼fl oz orange juice", "100g/3½oz cooked beetroot, patted dry with kitchen paper, grated", "100g/3½oz wholemeal flour", "1 tsp baking powder", "3 tbsp caster sugar", "50g/2oz sunflower seeds", "1 tsp mixed spice "], "serves": "Makes 6 large muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a 6-hole muffin tray with paper cases. ", "In a large mixing bowl, beat together the egg, oil and orange juice until well combined. Stir in the grated beetroot.", "In a separate mixing bowl, mix together the flour, baking powder, sugar, sunflower seeds and mixed spice until well combined. ", "Add the wet ingredients to the dry ingredients one tablespoon at a time, mixing well after each addition.", "Divide the muffin mixture equally among the six muffin cases. Bake in the oven for 20-25 minutes, or until the muffins are cooked through (a skewer inserted into the centre should come out clean). Set aside to cool, then serve."]}, {"isVegetarian": false, "title": "Fusilli con le noci (fusilli with walnuts)", "url": "www_bbc_co_uk_food_recipes_fusilliconlenocifusi_84340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz butter", "1 garlic clove, crushed", "160g/5½oz pancetta, roughly chopped", "150g/5oz walnuts (shelled weight), roughly chopped", "1 free-range egg, beaten", "150ml/5fl oz single cream", "300g/11oz fusilli pasta", "salt and freshly ground black pepper", "freshly grated pecorino cheese (optional)", "thyme leaves, for garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of lightly salted water to the boil.", "Meanwhile, melt the butter in a large frying pan, add the garlic and sauté for 1-2 minutes, or until golden. Remove the garlic clove and discard.", "Add the pancetta and walnuts to the pan and sauté for 3-4 minutes, until the pancetta turns a golden-brown colour, taking care not to let the walnuts burn.", "In a bowl, mix together the beaten egg and single cream.", "Cook the fusilli according to packet instructions, until al dente, then drain.", "Add the pasta to the walnut and pancetta mixture, then stir in the egg and cream mixture. Season, to taste, with salt and freshly ground black pepper.", "Serve immediately in warmed bowls. Finish with freshly grated pecorino cheese and garnish with a couple of thyme leaves (optional)."]}, {"isVegetarian": false, "title": "Gado gado Indonesian vegetable salad", "url": "www_bbc_co_uk_food_recipes_gadogadoindonesianve_71808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz coconut cream", "300g/10½oz simple peanut sauce ", "1 red pepper, roasted, peeled and sliced", "1 bunch French beans, trimmed and cooked", "8 new potatoes, peeled and cooked and quartered lengthways", "1 green mango, cut into batons", "1 cup bean sprouts", "1 avocado, sliced lengthways", "1 iceberg lettuce, cut into wedges"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Warm the coconut cream until it splits and add the peanut sauce.", "Transfer the sauce to a bowl and serve with the above selection of cooked and raw vegetables on the side", "The vegetables and sauce can be wrapped in the lettuce leaves and eaten as a wrap."]}, {"isVegetarian": false, "title": "Gala picnic pie", "url": "www_bbc_co_uk_food_recipes_gala_picnic_pie_60853", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 quails’ eggs", "4 pork sausages (about 250g/9oz) ", "200g/7oz pork mince", "2 rashers rindless steaky bacon, cut into 1cm/½in pieces", "½ tsp ground ginger", "½ tsp ground mace", "freshly ground black pepper", "1 tbsp plain flour, for dusting", "225g/8oz plain flour, plus extra for rolling", "½ tsp freshly ground black pepper", "25g/1oz cold butter, cut into cubes, plus extra for greasing the terrine", "75g/2½oz cold lard, cut into cubes", "1 tsp flaked sea salt", "1 medium free-range egg, beaten, to glaze"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Half-fill a saucepan with cold water and bring to the boil. Carefully add the quails’ eggs to the boiling water and boil for 2½ minutes. Drain the eggs through a sieve and rinse under running water until completely cold. Leave until the filling is made.", "Squeeze the sausages out of their skins and into a large mixing bowl. Add the bacon pieces, pork mince, ginger and mace. Season with plenty of freshly ground black pepper. Mix with your hands until very well combined. Divide the mixture into two portions. Gently peel the shells from the eggs, taking care to keep the eggs as whole as possible. Put in a bowl and toss lightly with the flour until lightly coated. This will stop them being too slippery when they are put in the filling.", "Preheat the oven to 200C/180C (fan)/Gas 6. Line a large, flat metal baking tray with baking parchment. If you don’t have a completely flat tray, turn your baking tray over. ", "For the pastry, put the flour and pepper in a food processor with the butter and 25g/1oz of the lard. Use the pulse setting to blend until the mixture resembles coarse breadcrumbs. ", "Put the remaining lard, four tablespoons cold water and salt in a small saucepan.  Bring to a simmer, then add to the flour mixture with the motor running and blend until the dough comes together. Turn out onto a floured surface and knead lightly to make a smooth, pliable dough", "Dust the baking parchment-lined tin with flour. Form the dough into rectangular block, and place on the baking tray. Dust a rolling pin with flour and roll out the pastry until it is around 6mm thick and makes a rectangle of 30 x 28cm/12 x 11in. You’ll need to turn the pastry a few times to roll it to the right size, working fairly quickly, before the pastry has a chance to stiffen. ", "Place half of the pork mixture lengthways down the middle of the pastry, leaving a 1.5cm/¾in boarder at each end. The pork should be roughly 25cm/10in long and 10cm/4in wide. Top with the floured eggs, standing on their ends and running next to each other all the way down the length of the pastry. Cover with the remaining pork mixture, making sure that all the eggs are completely enclosed, and press down lightly.", "Brush one of the long pastry edges lightly with beaten egg and bring both sides to in the middle to encase the filling. (You may need to use the baking parchment to help you lift the pasty.) Press the all edges very firmly together to seal and trim the top neatly with a sharp set of kitchen scissors, leaving 1cm/½in or so for the crest. Crimp the top edge into a wiggly line on top of the pie.", "Brush the pastry parcel evenly with beaten egg and bake for 15 minutes. Take out of the oven and brush with more beaten egg. The beaten egg will also help mend any cracks, if you have any. Return to the oven for a further 15 minutes or until the pie is golden-brown and the pastry and filling are completely cooked. Leave to cool."]}, {"isVegetarian": true, "title": "Galaktoboureko with orange syrup", "url": "www_bbc_co_uk_food_recipes_galaktoboureko_with_27774", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/galaktoboureko_with_27774_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, melted, plus extra for greasing", "3 free-range eggs, separated", "125g/4½oz golden caster sugar", "½ tsp vanilla extract", "90g/3¼oz semolina", "1 litre/1¾ pint full-fat milk, warmed", "7 sheets filo pastry", "3 oranges", "440g/15½oz caster sugar", "2 tbsp lemon juice"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Lightly grease a 20cm/8in springform cake tin.", "In a large bowl, whisk together the egg yolks, golden caster sugar and vanilla extract with an electric whisk until pale and creamy. Gradually beat in the semolina and the warmed milk. Put this mixture into a clean pan and cook over a low heat for up to 10 minutes until thickened, stirring constantly.", "In a clean bowl, whisk the egg whites using an electric whisk until stiff but not dry peaks form when the whisk is removed. Loosen the semolina custard with a spoonful of the egg whites, then fold in the rest.", "Brush each sheet of filo pastry with the melted butter and lay in the springform tin, alternating the direction the excess will drape over the sides (don’t trim it off), until you’ve used 6 sheets. ", "Pour the custard mixture into the pastry-lined tin and fold the overhanging sheets over the top, tucking in the ends. Place the final sheet of filo, buttered and folded in half, on top. Tuck in the sides and butter the top. ", "Bake for 45–50 minutes until the custard mixture has set. Check after 30 minutes and cover with foil if the top is getting too brown.", "Zest the oranges, then peel them and cut the fruit across into thin slices, removing excess pith. ", "Heat the caster sugar and 190ml/6¾fl oz water in a pan. When the sugar has dissolved, add the orange zest and lemon juice and simmer for 8–10 minutes until you have a thick syrup. Add the orange slices to the syrup, then set aside.", "Allow the pie to cool to room temperature before releasing from the tin. Cut into slices using a serrated knife and serve with the oranges in syrup."]}, {"isVegetarian": false, "title": "Galician pie (Empanada Gallega)", "url": "www_bbc_co_uk_food_recipes_galician_pie_empanada_98891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "good pinch fine sea salt", "1 tsp baking powder", "4 tbsp olive oil, plus extra for greasing", "1 medium egg, beaten", "125ml/4fl oz water", "1 egg, beaten, to seal and glaze", "2 tbsp olive oil", "1 large onion, finely diced", "1 green pepper, halved, seeded and cut into thin strips", "1 red pepper, halved, seeded and cut into thin strips", "150g/5½oz shelled scallops, patted dry with kitchen paper and cut into 5mm/¼in strips", "200g/7oz thickly sliced cooked ham, cut into 1cm/½in cubes", "4 tbsp fresh flat-leaf parsley, chopped", "1 lemon, freshly squeezed juice", "1 tsp fine sea salt", "½ tsp coarsely ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, place the flour, salt and baking powder in a bowl and make a well in the centre. Add the oil and beaten egg and gradually incorporate the flour into the liquid. Start adding the water a little at a time until the mixture forms a slightly sticky (but not wet) and elastic dough, you may not need all the water depending on the size of the egg you are using. Bring the dough together with your hands. Put it on a plate, sprinkle with a little flour, cover with cling film and chill in the fridge for 30–60 minutes.", "To make the filling, heat the oil in a frying pan and fry the onion until soft but not coloured, stirring regularly. Add the peppers and cook for 3 minutes, stirring, then add the scallops and fry for 30 seconds, stirring constantly. Take the pan off the heat, quickly add the ham, parsley, lemon juice, salt and pepper and mix everything together. Leave to cool for 20–30 minutes.", "Preheat the oven to 200C/400F/Gas 6 and lightly oil a baking sheet.", "Weigh the pastry and divide the weight by 5. Roll two-fifths of the pastry into a ball and put it to one side. Form the rest into a slightly larger ball. Roll out the larger ball of pastry until it forms a circle about the size of a dinner plate and place it on the lightly oiled baking sheet. Spoon the cooled filling into the centre of the pastry and spread it out towards the edge, leaving a 2cm/1in border all the way around. Brush the border lightly with beaten egg.", "Roll out the remaining pastry slightly smaller than the base of the pie and gently place it over the filling. Bring the base up to meet the smaller pastry disc and fold it over, pressing and crimping into a rope shape to make a sealed pastry edge. ", "Brush the pastry with beaten egg and make a couple of small slits in the top to allow the steam to escape. ", "Bake in the centre of the oven for 20–25 minutes until the pastry is golden brown and the filling is hot. ", "Serve warm or cold."]}, {"isVegetarian": false, "title": "Galinha à Portuguesa", "url": "www_bbc_co_uk_food_recipes_galinha__portuguesa_35227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb boneless, skinless chicken thighs, cut into 2.5cm/1in pieces", "1½ tbsp light soy sauce", "2 tbsp white wine ", "2 tsp salt", "2 tsp sesame oil", "2 tsp cornflour", "1½ tbsp olive oil", "1 tbsp finely chopped fresh root ginger", "2 tsp finely chopped garlic", "1 tbsp light soy sauce", "1 tbsp dark soy sauce", "1 tbsp Shaoxing rice wine or dry sherry ", "3 tbsp Madras curry paste or curry powder", "1 tbsp turmeric ", "1 tsp salt", "1 x 400ml tin coconut milk", "200ml/7fl oz chicken stock ", "250g/9oz carrots, cut into 5cm/2in pieces", "250g/9oz potatoes, peeled and cut into large chunks", "1 onion, chopped", "2 tomatoes, chopped ", "50g/1¾oz cooking chorizo, sliced ", "2 bay leaves", "salt and freshly ground white pepper, to taste", "2 tbsp desiccated coconut", "100g/3½oz black olives "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, combine the chicken with the marinade ingredients in a large bowl and mix well. Let it marinate for an hour in the fridge.", "After an hour, drain the chicken and reserve the marinade. ", "For the galinha à Portuguesa, heat a wok or a large frying pan over high heat then add the olive oil.  When the oil is hot and slightly smoking, add the ginger and garlic and stir-fry for 20 seconds. Add the chicken, and stir-fry for 3 minutes, or until the chicken is lightly browned. ", "Transfer the contents of the wok to a large saucepan, then add the rest of the galinha à Portuguesa ingredients, including the reserved marinade, and bring to the boil. Lower the heat and simmer for 20 minutes.  ", "Garnish with the coconut and olives and serve immediately. "]}, {"isVegetarian": false, "title": "Gamberones Fritti", "url": "www_bbc_co_uk_food_recipes_gamberonesfritti_89450", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp chickpea or plain flour", "½ tsp salt", "½ tsp cayenne pepper", "4 raw tiger prawns, shells removed, de-veined", "1 tbsp olive oil", "1 handful chopped fresh parsley", "1 handful chopped fresh coriander", "1 handful chopped fresh chervil", "1 lime, cut in half"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the flour, salt and cayenne pepper in a bowl. Dredge the prawns in the flour mixture to coat.", "Heat the oil in a frying pan over a medium heat. Fry the prawns for 4-5 minutes, or until they have turned pink.", "To serve, sprinkle the herbs onto a serving plate and place the prawns on top of them. Garnish with the lime halves."]}, {"isVegetarian": false, "title": "Game pie", "url": "www_bbc_co_uk_food_recipes_game_pie_38689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz diced mixed game, such as partridge, pheasant, pork shoulder, venison, rabbit and hare ", "4 tbsp olive oil", "1 onion, diced ", "4 celery sticks, diced", "1 garlic clove, finely chopped", "few sprigs fresh tarragon, leaves chopped", "few sprigs fresh parsley, leaves chopped", "1 bay leaf ", "sprig fresh thyme", "2 handfuls Paris Brown mushrooms, diced", "2 tbsp plain flour", "100ml/3½oz Madeira ", "100ml/3½oz red wine", "150ml/5½oz port", "500ml/1lb 2oz beef stock ", "4 slices Parma ham, thinly sliced", "450g/1lb readymade shortcrust pastry", "1 free-range egg, lightly beaten", "knob butter", "1 medium Savoy cabbage, leaves shredded, ", "2 tbsp freshly chopped parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan and fry the meat to brown it all over. Remove from the pan and set aside. ", "Add the onion and celery and cook for 10 minutes, or until softened.", "Add the garlic, herbs and mushrooms. Cook for another five minutes. Add the meat back to the pan, along with the flour and cook for a few minutes.", "Pour in the Madeira and cook until reduced to half the volume. Add the red wine and then the port. Cook until reduced to below half. Add the stock and simmer for 1-2 hours, until the meat is tender. Stir in the Parma ham.", "Tip the mixture into a 22-24cm/8½-9½in pie dish and roll out the shortcrust pastry.", "Cut out a lid of pastry for the pie dish and a strip of pastry large enough to cover the edge of the pie dish all the way round. Brush the edge of the dish with water, press the strip on top and then cover the pie with the lid. Crimp, using one finger to push the pastry down towards the outside of the dish. Pinch around that finger with the finger and thumb of your other hand. Brush with egg and chill for ten minutes in the fridge. Preheat the oven to 180C/160C Fan/Gas 4.", "Cook the pie for 25-30 minutes until golden. ", "To serve, heat a large sauté pan and add the butter. Tip in the cabbage and cook for 2-3 minutes and then sprinkle over the parsley. ", "Cut a slice of the pie and serve it with the cabbage."]}]