[{"ingredients": ["1 manzana, sin corazón y cortada en rondas de 1cm / ½", "1 cucharada de azúcar glas", "30g / 1oz de mantequilla, derretida", "85g / 3oz de tocino, picado", "1 rebanada de pan blanco, cortado en cubos", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "puñado de perejil fresco, cilantro y albahaca, hojas rotas", "2 cucharaditas de mostaza integral", "1 cucharada de vinagre de vino tinto", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 huevo de gallina, escalfado, para servir"], "method": ["Para la ensalada, espolvoree la manzana con azúcar glas y rocíe con mantequilla derretida. Caliente una sartén a la plancha y cocine los anillos de manzana durante 2-3 minutos en cada lado, o hasta que estén ligeramente carbonizados y suavizados.", "Coloque las piezas de tocino en una sartén y freír hasta que estén crujientes, luego retire de la sartén y déjelas a un lado. Agregue el pan en cubos, el aceite de oliva y el condimento a la sartén y fría durante cinco minutos, o hasta que estén crujientes.", "Coloque el tocino y los crutones en un tazón con las hierbas y mezcle bien.", "Para el aderezo, mezcle todos los ingredientes del aderezo en un tazón. Vierta sobre la ensalada y mezcle bien.", "Para servir, coloque las manzanas a la brasa en un plato, cubra con la ensalada y termine con un huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_chargrilledapplebaco_87233", "title": "Ensalada de manzana, beicon y croûton a la brasa con vinagreta de mostaza y grano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla roja picada", "puñado de semillas de granada", "2 cucharadas de albahaca fresca picada", "2 cucharadas de perejil fresco picado", "1 cucharada de vinagre balsámico", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "100 g / 3½ oz de cordero, cortado en cubitos", "½ cebolla, picada", "1 diente de ajo, picado", "pizca de semillas de comino", "pizca de cúrcuma molida", "1 hoja de laurel", "3 cucharadas de vinagre de vino tinto", "100ml / 3½fl oz de caldo de verduras calientes", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 patata, pelada y cortada en cubos", "pizca de semillas de comino", "pizca de pimentón", "pizca de chile en polvo", "pizca semillas de cilantro", "1 hoja de laurel", "2 chuletas de cordero", "1 cucharada de aceite de oliva"], "method": ["Para el deleite, coloque todos los ingredientes en un recipiente, mezcle bien y deje que se maceren.", "Para el cordero guisado, caliente el aceite en una sartén, coloque el cordero, la cebolla, el ajo, el comino, la cúrcuma y la hoja de laurel picados en la sartén y cocínelos durante 4-5 minutos.", "Agregue el vinagre de vino tinto, el caldo de verduras y la mantequilla y cocine a fuego lento durante 10-12 minutos, o hasta que el cordero esté tierno.", "Para las papas con especias, caliente el aceite en una sartén, agregue la papa picada y todas las especias, cubra con una tapa y cocine suavemente durante 10-12 minutos, o hasta que la papa esté tierna.", "Para las chuletas de cordero, caliente una sartén de plancha, cepille las chuletas de cordero con aceite y hágalo durante 4-5 minutos por cada lado, o hasta que esté cocido a su gusto. Deje reposar por unos minutos antes de servir.", "Para servir, coloque las papas con especias en un plato, cubra con el cordero guisado y coloque las chuletas de cordero y condimente al costado."], "url": "www_bbc_co_uk_food_recipes_chargrilledandstewed_84998", "title": "Cordero a la brasa y guisado con salsa de granada y papas con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8-10 lanzas de espárragos", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharaditas de vinagre balsámico, para servir"], "method": ["Rocíe los espárragos con el aceite de oliva y sazone bien con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente y cocine los espárragos por unos cinco minutos o hasta que estén carbonizados por todos lados.", "Para servir, coloque los espárragos en un plato y rocíe con vinagre balsámico."], "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_86249", "title": "Espárragos a la brasa con aceite de oliva y vinagre balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 manojo de espárragos, recortado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de vinagre de vino blanco", "4 yemas de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "225 g / 8oz de mantequilla sin sal, derretida", "jugo de limón, al gusto", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, frito"], "method": ["Para los espárragos, precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque los espárragos en un recipiente, agregue el aceite de oliva y sazone con sal y pimienta negra recién molida. Revuelva bien para cubrir. Caliente una bandeja de horno a la plancha hasta que esté caliente, agregue los espárragos y la plancha durante 3-4 minutos, agitando la sartén de vez en cuando. Coloque la sartén en el horno y tueste durante diez minutos hasta que los espárragos estén tiernos.", "Para el holandés, mezcle el vinagre de vino blanco, las yemas de huevo y la mostaza en un bol hasta que estén bien combinados. Coloque el recipiente sobre una olla de agua hirviendo, asegurándose de que el fondo del recipiente no toque el agua, y bata la mezcla hasta que espese un poco.", "Vierta la mantequilla derretida un poco a la vez en el recipiente, batiendo continuamente hasta que toda la mantequilla se haya agregado y la mezcla se haya emulsionado. Agregue el jugo de limón, la sal y la pimienta negra recién molida al gusto.", "Para servir, coloque los espárragos tostados en un plato para servir, vierta sobre la salsa holandesa y cubra con un huevo frito."], "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_88792", "title": "Espárragos a la brasa con salsa holandesa y huevo frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "4 lanzas de espárragos", "55g / 2oz tomates sunblush", "sal y pimienta negra recién molida", "2 cucharadas de cebolletas frescas picadas", "2 cucharadas de hojas de cilantro fresco picado", "2 cucharadas de vinagre balsámico"], "method": ["Calentar una sartén a fuego medio. Vierta el aceite de oliva en un recipiente poco profundo y cubra los espárragos con el aceite.", "Coloque los espárragos engrasados ​​y los tomates en una sartén. Sazonar, al gusto, con sal y pimienta negra recién molida. Planche durante 4-5 minutos, voltee hasta la mitad de la cocción o hasta que aparezcan marcas doradas en los espárragos y los tomates.", "Esparce las cebolletas y el cilantro sobre los espárragos y los tomates. Transfiera a un plato de servir.", "Agregue el vinagre a la sartén y cocine a fuego lento durante 10-20 segundos, revolviendo hasta que se reduzca ligeramente. Vierta el vinagre reducido sobre los espárragos y los tomates y sirva."], "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_92472", "title": "Espárragos a la brasa con tomates sunblush", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de harina de chapati o harina integral", "1 cucharadita de sal", "250ml / 9 fl oz de agua fría", "mantequilla para untar, opcional"], "method": ["Guarde 200 g / 7 oz de la harina y reserve para formar los chapatis.", "Coloque la harina restante y la sal en un recipiente hondo. Llene otro recipiente con agua fría.", "Agregue el agua al cuenco de harina, poco a poco, amasando a medida que avanza, hasta que tenga una masa suave y elástica. Cuanto más tiempo amases la masa, más suaves serán los chapatis.", "Espolvoree un poco de la harina reservada sobre una superficie plana o tabla. Divide la masa en ocho y dale forma de bola a cada pieza. Aplaste las bolas ligeramente, luego coloque una sobre la tabla enharinada. Extiéndalo en un disco plano de aproximadamente 15 cm (6 pulgadas) de diámetro, enharinando el tablero cuando sea necesario.", "Caliente una plancha o una sartén poco profunda. Coloque el chapatti en la plancha o sartén y cocine durante unos 20-30 segundos o hasta que la superficie burbujee.", "Déle vuelta con pinzas y cocine el otro lado durante 10-15 segundos. Tan pronto como aparecen manchas marrones en la parte inferior, el chapati está hecho.", "Repita con las otras siete bolas, usando la harina restante para extenderlas. Apilarlos mientras se cocinan, colocando una hoja de toalla de cocina entre cada uno para absorber la humedad.", "Unta mantequilla por un lado, si quieres."], "url": "www_bbc_co_uk_food_recipes_chapatis_77146", "title": "Chapatis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chapatis_77146_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 espárragos de lanzas, pelados y pelados gruesos", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza Dijon", "½ limón, solo jugo", "55 g / 2 oz de mantequilla, derretida", "1 huevo, frito o escalfado a tu gusto", "1 cucharada de cebolletas frescas picadas"], "method": ["Para los espárragos, rocíe los espárragos con el aceite de oliva y caliente una sartén hasta que esté muy caliente. Coloque los espárragos en la sartén de la plancha y sazone bien con sal y pimienta negra recién molida. Cocine, volteando con frecuencia durante 5-6 minutos, hasta que estén tiernos y rayados con las marcas de la plancha.", "Para el holandés, mezcle las yemas de huevo, la mostaza y el jugo de limón en una jarra con una licuadora de mano. Con la licuadora aún en funcionamiento, vierta gradualmente la mantequilla derretida, hasta que la holandesa alcance la consistencia de una mayonesa suelta.", "Sirva los espárragos alineados en un plato con el huevo frito o escalfado colocado en la parte superior. Coloque la holandesa en un lateral y adorne con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_88900", "title": "Espárragos a la brasa con huevo frito y salsa holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Castañas 110g / 4oz", "2 pechos de faisán, huesos retirados", "2 muslos de faisán, sin huesos", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "200g / 7 oz de tocino ahumado lardons", "250 g / 9 oz de coles de Bruselas, finamente trituradas", "400 ml / 14 fl oz crema doble", "150ml / 5fl oz de vino tinto"], "method": ["Precalentar el horno a 200 C / Gas 6.", "Con un cuchillo afilado, corte cuidadosamente una cruz en el fondo de cada castaña, esto evitará que exploten al tostar.", "Coloque las castañas en una bandeja para hornear y transfiéralas al horno para asar durante 20 minutos o hasta que estén tiernas, luego retírelas del horno y déjelas enfriar. Despegue las cáscaras de castaño y corte las nueces finamente y déjelas a un lado.", "Sazonar el faisán con sal y pimienta negra recién molida y rociar ligeramente con aceite de oliva.", "Caliente una sartén hasta que esté caliente, luego agregue las piezas de faisán con la piel hacia abajo y ligeramente la plancha hasta que estén doradas. Voltee los senos y los muslos y continúe cocinando, hasta que estén completamente cocidos, pero aún un poco rosados ​​(o por más tiempo de acuerdo con su gusto) Los muslos tardarán más en cocinarse que los senos, por lo tanto, asegúrese de cocinarlos durante más tiempo. Los jugos se ejecutarán claros cuando se perforan con un pincho.", "Mientras tanto, caliente una sartén hasta que esté caliente, luego agregue los lardons de tocino y fría hasta que estén dorados por todos lados.", "Escurra los lardons de cualquier grasa y colóquelos en una cacerola.", "Agregue las castañas, los brotes y la crema y deje que hierva. Cocine durante 4-5 minutos, o hasta que los brotes estén tiernos y la crema se haya reducido y espesado.", "Coloque el vino tinto en una sartén pequeña y colóquelo a fuego medio. Llevar a ebullición y cocinar hasta que se reduzca en dos tercios del volumen original.", "Para servir, coloca los brotes y las castañas a la crema en dos platos calientes. Cubra cada uno con un pechuga de faisán y el muslo y cuchara un poco de la reducción de vino tinto alrededor."], "url": "www_bbc_co_uk_food_recipes_chargrilledbreastofp_84876", "title": "Pechuga de faisán a la parrilla con brotes de Bruselas a la crema, castañas y tocino ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patata de 150g / 5½oz, pelada y rallada", "1 cucharada de yogur", "1 yema de huevo de gallinas camperas", "15 g / ¼ onza de mantequilla", "sal y pimienta negra recién molida", "1½ cucharadas de aceite de oliva", "100 g / 3½ oz de hígado de terneros", "pequeño ramo de hojas frescas de salvia"], "method": ["Para los rösti, exprime la papa rallada en una toalla de té limpia hasta que se seque, luego colócala en un tazón.", "Coloque la yema de huevo y el yogur en un recipiente aparte y mezcle. Agregue la papa rallada y sazone bien con sal y pimienta negra recién molida.", "Derretir la mantequilla en una sartén pequeña. Agregue la mezcla de papa a la sartén, presionándola hacia abajo en forma de disco en la sartén. Cocine a fuego medio hasta que quede dorado por debajo, luego voltee el rösti y cocine el otro lado hasta que se dore.", "Para el hígado, caliente una sartén hasta que fume. Rocíe la sartén de la plancha con una cucharada de aceite, luego agregue el hígado y la plancha de los terneros durante 3-4 minutos por cada lado, o hasta que estén completamente cocidos. Retire de la sartén y deje reposar en un lugar cálido.", "Agregue la otra mitad de cucharada de aceite a una sartén y agregue las hojas de salvia. Freír la salvia durante 1-2 minutos, o hasta que estén crujientes.", "Para servir, coloque el rösti en el centro de un plato y coloque el hígado encima. Adornar con las hojas de salvia."], "url": "www_bbc_co_uk_food_recipes_chargrilledcalvesliv_84528", "title": "Hígado de ternera a la brasa con salvia y patata rosti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin piel", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "2-3 corazones de cos o lechuga romana, rallado", "45 g / 1½ oz de virutas de parmesano", "8 envolturas de tortilla de harina", "1 diente de ajo pequeño, aplastado", "3 filetes de anchoa", "1 yema de huevo grande", "½ cucharadita de mostaza Dijon", "2 cucharaditas de jugo de limón", "sal y pimienta negra recién molida", "150ml / 5¼fl oz de aceite de oliva"], "method": ["Aplanar las pechugas de pollo ligeramente con un mazo de carne. Cepillar con aceite de oliva y sazonar.", "Precaliente la parrilla hasta que esté caliente y cocine el pollo durante 10-15 minutos, volteándolo una vez. Retire del fuego y reserve para descansar ..", "Para hacer el aderezo, machaque el ajo y las anchoas en un mortero y una mano usando una licuadora manual.", "Coloque en un recipiente y agregue la yema de huevo, la mostaza, el jugo de limón y el condimento.", "Batir el aceite lentamente para hacer un aderezo cremoso grueso.", "Cortar el pollo caliente en tiras gruesas y la punta en el tazón con la lechuga.", "Eche las virutas de parmesano y suficiente aderezo para cubrir y mezcle bien.", "Coloque un buen puñado de la mezcla en cada una de las envolturas de tortilla de harina y dobla sobre un extremo antes de enrollarlo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chargrilledchickenca_74783", "title": "César de pollo a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 patata, pelada, picada, hervida y escurrida", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "1 diente de ajo", "½ cebolla, finamente rebanada", "50ml / 2fl oz de vino tinto", "100ml / 3½fl oz de caldo de carne caliente", "sal y pimienta negra recién molida", "150 g / 5½ oz de hígado de ternera", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharadita de cebollín picado, para decorar"], "method": ["Para hacer el puré, coloca la papa, la mantequilla y el aceite en un tazón grande. Sazonar, al gusto, con sal y pimienta negra recién molida y macerar según su consistencia preferida.", "Para hacer la salsa, caliente el aceite de oliva con la mantequilla en una sartén a fuego medio. Agregue el ajo y la cebolla y fría por 3-4 minutos, hasta que estén dorados.", "Agregue el vino tinto y cocine a fuego lento hasta que el volumen se reduzca a la mitad.", "Agregue el caldo de carne y cocine a fuego lento para reducir de nuevo, hasta que la salsa se espese, luego la temporada, al gusto, con sal y pimienta negra recién molida.", "Para el hígado de la ternera, frote el hígado de la ternera con el aceite de oliva y sazone ambos lados con sal y pimienta negra recién molida.", "Caliente una sartén hasta que fume. Agregue el hígado y el carbón durante cuatro minutos en cada lado, hasta que estén cocidos, luego descanse durante un minuto en un plato caliente.", "Para servir, coloca el puré en el centro de un plato caliente. Coloque el hígado encima del puré, ponga la salsa sobre la salsa y espolvoree con cebolletas frescas picadas."], "url": "www_bbc_co_uk_food_recipes_chargrilledcalfslive_81625", "title": "Hígado de ternera a la plancha con salsa de puré y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de tomillo, picado", "aceite de oliva", "6 pechugas de pollo deshuesadas o muslos", "sal y pimienta negra triturada", "2-3 dientes de ajo, pelados y picados", "pequeño racimo de perejil picado", "60g / 2oz de mantequilla, ablandada", "1 limón"], "method": ["Caliente una sartén a fuego alto. Combina el tomillo con un poco de aceite de oliva y frota sobre el pollo.", "Sazonar y cocinar durante 8-10 minutos hasta que esté bien cocido.", "Mientras tanto, mezcle el ajo, el perejil y la mantequilla.", "Cuando el pollo esté cocido, agregue la mantequilla con sabor y reduzca el fuego.", "Corta el limón por la mitad y exprime el jugo sobre el pollo.", "Sirva las piezas de pollo con los jugos de la sartén con una cuchara sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_chargrilledchickenwi_10959", "title": "Pollo a la brasa con tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "2 cucharadas de cilantro fresco picado", "2 cucharadas de aceite de oliva", "1 cucharada de miel clara", "2 cucharaditas de semillas de sésamo", "½ aguacate, pelado, piedra removida", "pequeño racimo de cilantro fresco", "½ chile rojo, picado", "1 cucharada de leche"], "method": ["Remoje tres pinchos de madera en agua durante diez minutos.", "Corta la pechuga de pollo longitudinalmente en tres pedazos.", "Espolvorear con cilantro fresco picado y rociar con aceite de oliva, luego enrosque longitudinalmente en los pinchos.", "Rocíe con miel.", "Caliente una sartén hasta que fume. Agregue las brochetas de pollo y el carbón durante 4-5 minutos, doblándolas por todos lados, o hasta que estén bien cocidas.", "Espolvorear con semillas de sésamo y colocar en un plato.", "Para la inmersión, coloque todos los ingredientes dip en un procesador de alimentos y mezcle hasta que quede suave. Sirva en un tazón pequeño junto con los pinchos de pollo."], "url": "www_bbc_co_uk_food_recipes_chargrilledchickensk_84250", "title": "Pinchos de pollo a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, finamente picado", "200g / 7oz de tomates cherry, cortados a la mitad", "1 cucharadita de vinagre de vino tinto", "2 cucharaditas de azúcar en polvo", "1 cucharada de ketchup de tomate", "1 cucharada de puré de tomate", "pequeño puñado de albahaca fresca, picada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Frote el pollo con aceite de oliva y sazone bien con sal y pimienta negra recién molida. Caliente una sartén a la plancha y cocine al pollo por 4-5 minutos en cada lado.", "Transfiera a una bandeja para hornear y hornee en el horno durante 12 minutos o hasta que el pollo esté completamente cocido.", "Para la salsa, caliente el aceite de oliva en una olla pequeña, agregue la cebolla y fríela suavemente durante 3-4 minutos. Agregue el ajo y fría por un minuto.", "Agregue los tomates y cocine por un minuto más. Agregue el vinagre, el azúcar, el ketchup de tomate y el puré de tomate y cocine a fuego lento durante cinco minutos. Agregue la albahaca, reservar algo para adornar y sazonar al gusto con sal y pimienta negra recién molida.", "Para servir, vierta la salsa de tomate en un plato para servir y cubra con el pollo a la parrilla. Adornar con las hojas de albahaca reservadas."], "url": "www_bbc_co_uk_food_recipes_chargrilledchickenwi_86252", "title": "Pollo a la brasa con salsa de tomate grueso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo sin piel", "1 cucharada de aceite de oliva", "1 cucharada de perejil fresco picado", "1 ramita de romero fresco, picado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ cebolla, en rodajas", "1 diente de ajo, picado", "4 tomates de ciruela enlatados, escurridos, picados", "sal y pimienta negra recién molida", "1 ramita de romero fresco, picado", "pequeño puñado de perejil fresco picado"], "method": ["Para el pollo, coloque la pechuga de pollo entre dos hojas de película adhesiva y aplánela a 1 cm / ½ pulgadas de espesor con un rodillo. Deseche la película adhesiva.", "Rocíe la pechuga de pollo en aceite de oliva, espolvoree con perejil picado y romero y sazone con sal y pimienta negra recién molida. Caliente una sartén hasta que esté humeante, agregue el pollo y fría por 2-3 minutos en cada lado, o hasta que esté completamente cocido.", "Para los tomates, caliente el aceite de oliva en una cacerola, agregue la cebolla y freír suavemente hasta que esté blanda pero no coloreada. Agregue el ajo y fría por un minuto. Agregue los tomates picados, la sal y la pimienta negra recién molida, el romero y el perejil y cocine a fuego lento durante tres minutos.", "Para servir, coloque los tomates en un plato para servir y cubra con la pechuga de pollo."], "url": "www_bbc_co_uk_food_recipes_chargrilledchickenwi_88278", "title": "Pollo a la brasa con tomates infusionados con romero y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 achicoria, hojas separadas", "50g / 2oz de queso Dolcelatte, desmenuzado", "1 cucharada de cebollín, picado", "1 naranja, pelada, segmentada", "puñado de perejil fresco, picado"], "method": ["Precalentar la parrilla a fuego medio.", "Frote las hojas de achicoria con aceite de oliva, caliente una sartén hasta que se caliente, agregue la achicoria y la plancha durante dos minutos.", "Coloque la achicoria a la plancha en una bandeja para hornear, cubra con la Dolcelatte y colóquela debajo de la parrilla durante dos minutos, o hasta que el queso comience a derretirse.", "Para servir, espolvorear con cebollino y colocar la achicoria a la parrilla en el medio de un plato de servir. Coloque los segmentos de naranja alrededor del borde y adorne con el perejil picado."], "url": "www_bbc_co_uk_food_recipes_chargrilledchicorywi_86127", "title": "Achicoria a la parrilla con Dolcelatte derretido y aderezo de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 calabacines, extremos cortados, cortados en tiras largas", "1-2 cucharadas de aceite de oliva virgen extra, más extra para aderezo", "1 chile rojo fresco, sin semillas, finamente picado (o 5 cucharadita de hojuelas de chile secas)", "sal marina y pimienta negra recién molida", "½ limón, solo jugo", "puñado de menta fresca, más o menos picada", "puñado de albahaca fresca, más o menos picada"], "method": ["Mezcle las tiras de calabacín en un tazón con el aceite de oliva (lo suficiente para cubrir el calabacín), el chile, la sal marina y la pimienta negra recién molida.", "Caliente una parrilla con reborde hasta que esté caliente y cocine los calabacines por lotes, aproximadamente cuatro minutos por lado, teniendo cuidado de no llenar la sartén de la parrilla. Deben ser tiernos, pero con una crisis en el medio. Si las tiras no están bien cocidas, déjelas en la sartén de la parrilla por más tiempo, pero observe el calor ya que no quiere que se quemen. No tengas la tentación de mover el calabacín mientras se cocina o no obtendrás las marcas de chargrill en la carne. Escurrir sobre papel de cocina.", "Mezcle los calabacines a la plancha en el jugo de limón, menta, albahaca y una buena dosis de su mejor aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_chargrilledcourgette_85172", "title": "Calabacín a la parrilla con albahaca, menta, guindilla y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledcourgette_85172_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filetes de filete 4 x 150 g / 6oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "225 g / 8oz de mantequilla sin sal, a temperatura ambiente", "2 cucharadas de jugo de limón", "2 cucharadas de perejil fresco picado, romero y tomillo", "2 anchoas en conserva, escurridas y finamente picadas", "1 cucharada de chalote finamente picado", "4 cucharadas de salsa de barbacoa ahumada ya preparada", "2 chiles chipotle ahumados (disponibles en algunos supermercados y proveedores en línea) o chiles frescos en rodajas", "½ cucharadita de sal", "¼ cucharadita de pimienta blanca molida", "60 g / 2½ oz de mantequilla", "Papas pequeñas de 400g / 14oz, hervidas hasta que estén tiernas, peladas y cortadas a la mitad a lo largo", "1 cucharada de perejil de flatleaf fresco picado", "sal y pimienta negra recién molida", "Setas girolle 200 g / 7 oz, cortadas y cortadas", "Brócoli brotación 200g / 7oz púrpura, blanqueado"], "method": ["Para el bistec, coloque los filetes en una superficie de trabajo limpia, cubra con película adhesiva y aplánelos con un rodillo hasta 1 cm / ½ pulgada de grosor. Cepillar con aceite de oliva y sazonar con sal y pimienta negra recién molida.", "Caliente una sartén a la parrilla y carme el bistec durante 2-3 minutos por cada lado, para carne rara o más larga, hasta que esté cocido a su gusto. Retire de la sartén y déjelo a un lado para que descanse en un lugar cálido.", "Para la mantequilla de chile ahumado, coloque todos los ingredientes de la mantequilla de chile en un procesador de alimentos y mezcle hasta que quede suave. Coloque en un plato pequeño.", "Para las verduras, caliente la mitad de la mantequilla en una sartén y saltee las papas durante 4-5 minutos, hasta que estén doradas y crujientes. Espolvorea sobre el perejil, sazona bien con sal y pimienta negra recién molida y revuelve.", "Calentar la mantequilla restante en otra sartén y agregar los champiñones. Revuelva freír durante 2-3 minutos hasta que esté tierno, luego agregue el brócoli brotación púrpura y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida las papas y las verduras por igual entre cuatro platos para servir. Coloque un bistec en cada plato y cubra con una cucharada de mantequilla de chile ahumado."], "url": "www_bbc_co_uk_food_recipes_chargrilledfilletste_86298", "title": "Filete a la parrilla con mantequilla de chile ahumado, setas girolle y brócoli con brotes morados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de pierna de cordero 225 g / 8 oz", "sal y pimienta negra recién molida", "½ limón, cortado en cuñas", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de semillas de comino", "½ cucharadita de cúrcuma molida", "100ml / 3½fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "150 g / 5½ oz de lentejas Puy listas para cocinar (peso cocido)", "sal y pimienta negra recién molida", "1 cucharada de hojas frescas de cilantro"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cordero, caliente el aceite de oliva en una sartén a prueba de horno hasta que fume. Sazonar el filete de pierna de cordero con sal y pimienta negra recién molida, luego dorar en la sartén durante 3-4 minutos en cada lado, o hasta que se dore por todas partes. Agregue las rodajas de limón a la sartén y transfiéralas al horno durante 10-12 minutos, o hasta que el cordero esté cocido a su gusto.", "Para las lentejas, caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 3-4 minutos, o hasta que comience a ablandarse, luego mezcle las semillas de comino y la cúrcuma molida.", "Vierta el vino, luego reduzca el fuego y cocine a fuego lento durante 1-2 minutos. Agregue la crema doble, las lentejas y sazone con sal y pimienta negra recién molida. Deja cocinar a fuego lento durante otros 5-6 minutos, hasta que el líquido comience a reducirse y las lentejas se calientan.", "Para servir, coloque las lentejas a la crema en un plato de servir y coloque el filete de cordero encima. Adorne con las hojas frescas de cilantro."], "url": "www_bbc_co_uk_food_recipes_chargrilledlambsteak_88919", "title": "Filete de cordero a la brasa con cúrcuma, comino y lentejas a la crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "2 chuletas de cordero", "sal y pimienta negra recién molida", "55g / 2oz de queso brie, picado", "pequeño puñado de pan rallado blanco", "1 cucharada de perejil fresco picado", "1 cucharada de menta fresca picada", "sal y pimienta negra recién molida", "1 camote, pelado, picado", "25g / 1oz de mantequilla", "1 cucharada de leche", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar un chorrito de aceite de oliva en una sartén a prueba de horno, sazonar las chuletas de cordero con sal y pimienta negra recién molida y freír durante 2-3 minutos en ambos lados, o hasta que estén doradas.", "Para el aderezo, mezcle el Brie, el pan rallado, el perejil, la menta, la sal y la pimienta negra recién molida en un tazón pequeño y extienda la mezcla sobre las chuletas de cordero. Hornee durante cinco minutos, o hasta que la cobertura esté dorada y el cordero esté cocido a su gusto.", "Para el puré de boniato, cocine la batata en agua hirviendo con sal durante 6-8 minutos o hasta que esté tierna. Escurrir, luego machacar con la mantequilla y la leche hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el puré de batata en un plato y cubra con la chuleta de cordero."], "url": "www_bbc_co_uk_food_recipes_chargrilledlambchops_89071", "title": "Chuletas de cordero a la brasa con Brie, pan rallado y relleno de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]