[{"ingredients": ["4 vainas de cardamomo, ligeramente trituradas", "1 clementina, cortada en rodajas, enriquecida con 8 dientes", "1 limón, cortado en rodajas, aderezado con 8 dientes", "100 ml / 4 fl oz de whisky", "Licor de naranja 100ml / 4fl oz", "3 cucharadas de miel clara", "1 litro / 1 pinta 15¼ fl oz de sidra", "4 palitos de canela", "nuez moscada recién rallada, para adornar"], "method": ["Caliente todos los ingredientes de siddy de sidra a fuego lento hasta que se caliente.", "Vierta el toddy de sidra en 4 vasos de café con leche u otras copas a prueba de calor.", "Termine con un poco de nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_cidertoddy_90492", "title": "La sidra caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cidertoddy_90492_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "75g / 2½ oz de azúcar granulada", "100g / 4oz de glucosa líquida", "25 g / 1 oz de jarabe dorado", "15 g / ½ oz de bicarbonato de soda"], "method": ["Use el aceite para engrasar una lata para hornear cuadrada de 23 cm / 9 pulgadas de 4 cm / 1½ pulgadas de profundidad. Cuélalo con pergamino para hornear, luego vuelve a engrasar con un poco de aceite.", "Coloque el azúcar, la glucosa líquida, el jarabe dorado y una cucharada de agua en una sartén profunda de fondo grueso. (Asegúrese de que la sartén esté muy profunda, ya que la mezcla burbujeará más tarde.) Caliente suavemente para disolver el azúcar, luego aumente el fuego muy levemente, hasta que la mezcla se haya convertido en un almíbar.", "Mire la sartén con mucho cuidado a partir de este punto, hirviéndola constantemente a fuego lento, hasta que la mezcla se vuelva ámbar. Debe ser el color de la mermelada. Esto tomará aproximadamente 15 minutos.", "Apaga el fuego y obtén un batidor de globo a mano. Agregue el bicarbonato de soda y mezcle todo. Va a burbujear hasta la parte superior de la sartén, así que tenga cuidado de no quemarse ya que el caramelo estará muy caliente.", "Inmediatamente vierta el caramelo en la lata preparada y deje enfriar por completo (aproximadamente dos horas).", "Cuando esté frío, saque el toffee de la lata con un cuchillo plano y divídalo en trozos. Si es difícil liberarlo del estaño, golpéelo con un martillo."], "url": "www_bbc_co_uk_food_recipes_cinder_toffee_33877", "title": "Toffee Cinder", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace alrededor de 30 terrones de caramelo", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinder_toffee_33877_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de leche entera", "2 huevos medianos de granja, ligeramente golpeados", "735g / 1lb 9½oz harina de pan muy fuerte, más extra para quitar el polvo", "80g / 2¾oz de azúcar en polvo", "1¼ cucharadita de sal", "3 cucharaditas de levadura seca de acción rápida", "80g / 2¾oz de mantequilla sin sal, ablandada", "200 g / 7 oz de azúcar en polvo", "20g / ¾oz de glucosa líquida", "180ml / 6½fl oz de leche entera", "180ml / 6½ fl oz doble crema", "4 yemas de huevo grandes de gallinas camperas", "3 cucharadas de harina de maíz", "6 clementinas, jugo y cáscara solamente (se requiere jugo de 250 ml / 9 fl oz), cáscara cortada en tiras finas", "300ml / 10fl oz de jugo de naranja y sangre", "175ml / 6fl oz de jugo de limón (alrededor de 6 limones)", "225 g / 8 oz de azúcar en polvo", "6 cucharadas de pectina de manzana", "500g / 1lb 2oz manzanas Bramley, peladas, sin corazón y ralladas", "125 g / 4½ oz de azúcar en polvo", "75ml / 2½fl oz de jugo de manzana nublado", "1 cucharadita de canela molida", "pellizcar clavos de tierra", "Crema doble 400ml / 14oz", "2 cucharaditas de pasta de vainilla", "60g / 2¼ oz de azúcar glas", "Azúcar glas fondant 250g / 9oz", "colorante de comida verde", "colorante de comida naranja"], "method": ["Para la masa, combine la leche con 175 ml / 6 fl oz de agua hirviendo en una jarra, luego batir en los huevos.", "Agregue los ingredientes secos a un tazón de un mezclador independiente equipado con un gancho de masa y mezcle brevemente para combinar. Agregue la mantequilla y la mezcla de huevo, y mezcle durante 5 minutos.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar a mano durante unos minutos. Transfiera a un tazón grande y cubra con una película adhesiva. Pruebe la masa en un lugar cálido durante aproximadamente una hora, o hasta que duplique su tamaño.", "Una vez probado, divide la masa en 16 piezas. Rodar en forma de salchichas y colocar en 2 bandejas para hornear forradas con papel de hornear antiadherente. Pruébelo nuevamente durante aproximadamente una hora o hasta que se duplique su tamaño.", "Precalentar el horno a 210C / 190C Fan / Gas 6.", "Una vez probado, hornee la masa durante 9 minutos, luego cambie las bandejas en el horno y hornee por otros 4 minutos (esto es para asegurar que el color sea uniforme). Dejar de lado para enfriar.", "Para hacer la pastelería de toffee crème, forre una lata grande para asar con papel para hornear antiadherente.", "Agregue el azúcar, la glucosa y 4 cucharadas de agua a una cacerola. Calentar suavemente hasta que el azúcar se derrita, luego aumentar el fuego y hervir hasta que se convierta en un color caramelo profundo. (PRECAUCIÓN: el azúcar en ebullición está muy caliente. No lo deje desatendido). Vierta cuidadosamente en la lata de tueste preparada y déjelo enfriar. Cuando el caramelo esté frío y duro, divídalo en trozos y transfiera un procesador de alimentos. Pulsa hasta que tengas un polvo grueso.", "En una cacerola grande, mezcle la leche, la crema, las yemas de huevo, la harina de maíz y 135 g / 5 oz del caramelo en polvo a fuego medio. Cocine hasta que la mezcla esté espesa (o hasta que mida 85C en un termómetro de cocina). Poner a un lado para enfriar, cubriendo la superficie con una película adhesiva para detener la formación de la piel. Cuando se enfrió la cuchara en una manga pastelera equipada con una gran boquilla simple.", "Para la mermelada, agregue todos los ingredientes a una cacerola grande y profunda y cocine a fuego medio-bajo durante 1 hora y media, o hasta que la mezcla alcance 104C en un termómetro de azúcar y la cáscara se haya ablandado. Dejar de lado para enfriar.", "Para la compota especiada de manzana, mezcle todos los ingredientes en una cacerola grande y cocine a fuego lento durante unos 20 minutos, o hasta que la manzana se haya ablandado y la mayor parte del líquido se haya evaporado.", "Para la crema Chantilly, ponga todos los ingredientes en un tazón grande y látigo hasta que se formen picos rígidos cuando se quite la batidora. Transfiera a una manga pastelera equipada con una boquilla grande y lisa.", "Para armar los bollos helados, corte todos los bollos por la mitad a lo largo. Extienda una capa de mermelada en 8 de los rollos y luego pinte la crema pastelera en la parte superior. Coloque la otra mitad del rollo en la parte superior.", "Extienda una capa de compota de manzana en los rollos restantes y luego vierta la crema Chantilly en la parte superior. Coloque la otra mitad del rollo en la parte superior.", "Para el glaseado real, bata el azúcar glas con 2-3 cucharadas de agua con una cuchara de madera hasta que quede suave y espeso. Pon la mitad del glaseado en un recipiente aparte y agrega el colorante verde para alimentos. Agregue el colorante de comida naranja a la formación de hielo restante. Transfiera a bolsas de tubería separadas equipadas con boquillas anchas de punta plana. Pase el glaseado verde por encima de los bollos de manzana con especias y el glaseado de naranja en los panecillos de mermelada. Sirva una vez que se haya establecido el glaseado."], "url": "www_bbc_co_uk_food_recipes_cinnamon_and_apple_iced_95601", "title": "Bollos con helado de canela y manzana y panecillos con helado de toffee y mermelada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 16 bollos helados", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["625g / 1lb 6oz de harina de pan blanco fuerte, más extra para espolvorear", "75 g / 2½ oz de azúcar en polvo", "1 pizca de sal", "20 g / ¾oz de levadura seca", "500g / 1lb 2oz de mantequilla fría, cortada en rodajas de 1cm / ½ in de espesor, más extra para engrasar", "300g / 10½oz de queso crema con toda su grasa", "1 vaina de vainilla, dividida por la mitad longitudinalmente, semillas raspadas con un cuchillo afilado", "1 cucharadita de canela molida", "2 yemas de huevo, ligeramente batidas, para lavar huevos", "200g / 7oz de azúcar glas, tamizado", "100ml / 3½fl oz de jarabe de arce", "25ml / 1fl oz de whisky bourbon"], "method": ["Para la masa, engrase una lata redonda de 23cm / 9 pulgadas en forma de resorte con mantequilla y alinee con el pergamino para hornear.", "Mezcle la harina, el azúcar, la sal y la levadura en un recipiente hasta que estén bien combinados. Haga un pozo en el centro, luego vierta lentamente 450 ml / 16 fl oz de agua tibia, revuelva bien y lleve los bordes de los ingredientes secos hacia el agua mientras se mezcla. (Puede que no necesite usar toda el agua, siga agregando el agua hasta que la masa se adhiera al borde del recipiente y se sienta elástica). Alternativamente, mezcle la masa con un mezclador independiente con un gancho para masa.", "Cubra el recipiente con una toalla de té limpia y ponga la masa a un lado para comprobar durante 18-20 minutos, o hasta que haya duplicado su tamaño.", "Cuando la masa haya subido, colócala en una superficie de trabajo ligeramente enharinada y retírala. Ruede la masa a un rectángulo de 60x30 cm / 24x12 pulgadas.", "Cubra la mitad de la masa con las losas de mantequilla, luego doble la otra mitad de la masa sobre la mantequilla, presionando ligeramente los bordes para sellar.", "Polvore la superficie de trabajo con harina nuevamente. Batir la masa con un rodillo para aplanarla, luego extenderla hacia otro rectángulo que mida 60x30 cm / 24x12 pulgadas en el rectángulo nuevamente.", "Doble los lados cortos del rectángulo hacia adentro para que los bordes del rectángulo se encuentren en el medio. Dobla de nuevo, a lo largo.", "Repita el proceso de batido, doblado y laminado dos veces más, luego envuelva la masa en una película adhesiva y enfríe en la nevera durante 1 hora.", "Pase la masa fría sobre una superficie de trabajo ligeramente enharinada hasta un rectángulo de 30x45 cm / 12x8 pulgadas con un grosor de aproximadamente 1 cm / ½ pulg.", "Para el relleno, en un recipiente, mezcle el queso crema, las semillas de vainilla y la canela hasta que estén bien combinados.", "Extiende la mezcla de relleno por todo el rectángulo de masa, luego, comenzando con un borde largo, rueda la masa como un rollo suizo. Corte el rollo en 9 rebanadas, cada una de aproximadamente 5 cm / 2 pulgadas de grosor.", "Gire las rodajas de rodillo suizo sobre sus lados para que el remolino quede hacia arriba. Coloque un remolino en el centro de la lata de torta preparada, luego coloque los remolinos restantes alrededor del borde, asegurándose de que no estén demasiado apretados. Reserve para probar durante 35-40 minutos, o hasta que los remolinos hayan duplicado su tamaño.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Cepille la masa con la colada de huevo, luego hornéela en el horno por 45 minutos o hasta que los panecillos estén dorados y se hayan expandido y unido.", "Mientras tanto, para el glaseado, en un tazón, mezcle el azúcar glas, el jarabe de arce y el bourbon hasta que quede suave y bien combinado.", "Para servir, quite el borde de la lata de pastel, separe los rollos y colóquelos en un plato de servir. Rocíe el glaseado sobre la parte superior de cada uno, moviéndolo hacia adelante y hacia atrás para que los rollos estén cubiertos con líneas de glaseado entrecruzadas. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_cinnamon_and_soft_cheese_54104", "title": "Rollos de canela y queso con glaseado de arce y whisky", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Avena de avena 40 g / 1½ oz", "½ manzana, rallada o finamente picada", "pequeñas pacanas, picadas", "150ml / 5fl oz de leche o leche de soja", "¼ cucharadita de canela molida", "1 cucharada de mantequilla de la fecha (ver abajo)", "Fechas de 100 g / 3½ oz, finamente picadas", "3 cucharadas de agua hirviendo", "pellizcar canela molida"], "method": ["Para la mantequilla de la fecha, ponga las fechas en un tazón a prueba de calor y agregue lentamente el agua hirvienda. Mash las fechas con un tenedor para hacer una pasta cremosa. Agregue la canela. Dejar de lado para enfriar.", "Para la avena de la noche, ponga todos los ingredientes en un frasco, revuelva, coloque la tapa y guárdelo en la nevera durante la noche. Si prefieres tu avena calentada, coloca la mezcla en el microondas durante 30 segundos para liberar los aromas y sabores."], "url": "www_bbc_co_uk_food_recipes_cinnamon_apple_overnight_75730", "title": "Avena canela noche avena con mantequilla de la fecha", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_apple_overnight_75730_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de leche entera", "50ml / 2fl oz de crema individual", "½ cucharadita de pasta de vainilla", "50g / 1¾oz de azúcar en polvo de oro", "2 yemas de huevo de rango medio", "20g / ¾oz de harina de maíz", "1 naranja, jugo y ralladura", "100 g / 3½ oz de sultanas", "3 manzanas rojas, sin corazón, descuartizadas y cortadas en rodajas finas como papel", "1 limón, solo jugo", "4 cucharadas de azúcar moreno claro", "½ cucharadita de canela molida", "½ cucharadita de pasta de vainilla", "perilla de mantequilla sin sal", "500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "10 g / ¼ oz de levadura de acción rápida", "10 g / ¼ oz de sal", "80g / 2¾oz de azúcar en polvo", "2 huevos medianos de granja", "125ml / 4fl oz de leche entera, calentada hasta que esté tibia", "250g / 9oz de mantequilla sin sal, refrigerada", "aceite de oliva, para engrasar", "50g / 1¾oz de conserva de albaricoque", "licor de almendras, al gusto", "100g / 3½oz de azúcar glasé", "¼ cucharadita de canela", "¼ cucharadita de pasta de vainilla", "hojas de menta fresca, para adornar"], "method": ["Para la crème pâtissière, en una cacerola grande de base pesada, combine la leche, la crema y la vainilla. Llevar a ebullición.", "Mientras tanto, agregue el azúcar, las yemas de huevo y la harina de maíz en un tazón grande y bata hasta que quede suave. Tan pronto como la mezcla de leche hierva, retírela del fuego y vierta aproximadamente una cuarta parte de la mezcla de huevo. Batir hasta que estén combinados, luego verterlo en la sartén y batir continuamente a fuego lento hasta que esté suave y espeso. Pase a través de un colador en un recipiente limpio. Cubra la superficie de la crema pastelera con film transparente para evitar que se forme una piel. Dejar enfriar y colocar en la nevera.", "Para el relleno de manzana, mezcle el jugo de naranja y la ralladura con las pasas sultanas y deje reposar para remojar.", "En un tazón grande combine las rodajas de manzana con jugo de limón, azúcar moreno, canela, vainilla y mantequilla. Cubra y cocine en el microondas a potencia media durante aproximadamente 4 minutos, o hasta que las manzanas se hayan suavizado pero aún mantengan su forma. Dejar de lado para enfriar. Enrolle las manzanas en rodajas para que se asemejen a las rosas y asegúrelas con un palito de cóctel. Dejar de lado en la nevera.", "Para hacer la masa, instale un mezclador independiente con un accesorio de gancho de masa. Agregue la harina, luego coloque la levadura a un lado del tazón y la sal y el azúcar en el lado opuesto.", "En una jarra, mezcle los huevos, la leche y 4 cucharadas de agua. Viértalo en la mezcla de harina y mezcle a baja velocidad durante 2 minutos (puede que tenga que empujar para amasar el gancho de vez en cuando). Aumente la velocidad a medio y mezcle por otros 6 minutos.", "Transfiera a un tazón grande y ligeramente engrasado y cubra con una toalla de té limpia o una película adhesiva engrasada. Deje probar durante una hora o hasta que duplique su tamaño.", "Mientras tanto, coloque el bloque de mantequilla entre dos hojas de papel de hornear y golpee con un rodillo para aplanar la mantequilla en un rectángulo de aproximadamente 1 cm / ½ de espesor. Guárdelo en la nevera hasta que lo necesite.", "Convierta la masa levantada en una superficie de trabajo ligeramente enharinada. Aplánelo y extiéndalo en un rectángulo de aproximadamente 40x15 cm / 16x6 pulgadas y aproximadamente 1 cm / ½ pulgada de grosor. Organiza la masa con uno de los bordes cortos más cercanos a ti. Coloque la mantequilla en el centro de la masa, doble la masa hacia arriba y hacia abajo sobre la mantequilla en el medio para hacer un rectángulo ordenado. Pellizca los bordes para sellar la mantequilla en la masa. Coloque en una bolsa plástica para alimentos y enfríe en el congelador por 10 minutos.", "Coloque la masa fría sobre una superficie de trabajo ligeramente enharinada con uno de los bordes cortos más cercanos a usted. Estirar la masa en un rectángulo de 40x15 cm / 16x6 pulgadas y doblar en tercios iguales como doblar una carta para un sobre de negocios. Coloque en una bolsa de plástico en el congelador durante 10 minutos.", "Repita el laminado y el plegado como antes, luego regrese al congelador por otros 10 minutos. Repita el laminado y doblado una vez final, luego enfríe la masa durante 30 minutos en una bolsa de plástico en la nevera.", "En una superficie de trabajo ligeramente enharinada, extienda la masa en un rectángulo de 5 mm / ¼ de grosor, 30x40 cm / 12x16 in. Con un cuchillo afilado, corte en doce cuadrados de 10cm / 4 pulgadas.", "Para dar forma a los pasteles, doble cada esquina un poco hacia el centro y presione hacia abajo firmemente (ahora debe tener forma de hexágono). Transfiera a una bandeja para hornear (necesitará 2-3 bandejas para hornear). Cubra las bandejas con film transparente o una toalla de té húmeda y déjelo reposar a temperatura ambiente durante 30-60 minutos hasta que se eleve ligeramente.", "Precaliente el horno a 210C / 190C Fan / Gas 6½.", "En cada panecillo, esparza un poco de la crème pâtissière enfriada y luego coloca una manzana 'rosa' en el centro y presiónala hacia abajo para mantenerla en su lugar.", "Para el glaseado, coloque todos los ingredientes, excepto la menta, en una cacerola pequeña y tibia hasta que goteen. Cepille los pasteles con el glaseado y luego espolvoree sobre las pasas sultanas.", "Hornee durante 15-20 minutos, o hasta que estén dorados y crujientes. Coloque en los estantes de enfriamiento. Cuando esté completamente frío, coloque dos hojas de menta a cada lado de las rosas de manzana para que se parezcan a las hojas."], "url": "www_bbc_co_uk_food_recipes_cinnamon_apple_and_25914", "title": "Canela, manzana y flan danés", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_apple_and_25914_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "2 cucharaditas de polvo de hornear", "1 cucharadita de canela molida, más ½ cucharadita extra de topping", "pizca de sal", "2 plátanos maduros, puré", "150g / 5oz de arándanos", "3 cucharadas de miel", "3 cucharadas de aceite vegetal", "1 huevo grande de gallinas camperas", "Leche de 185ml / 6fl oz", "50 g / 2 oz de azúcar en polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Haga una línea de ocho agujeros de una lata de muffin con cajas de muffin de papel.", "Tamiza la harina, el polvo de hornear, la canela y la sal en un tazón grande. Agregue el plátano y los arándanos y, utilizando un tenedor, mezcle ligeramente la fruta con la harina.", "En un recipiente aparte, mezcle ligeramente la miel, el aceite vegetal, el huevo y la leche.", "Agregue los ingredientes líquidos a los ingredientes secos y revuelva hasta que se combinen (no mezcle demasiado o sus muffins no tendrán una textura ligera). Coloque la mezcla en los casos individuales de muffin.", "Mezcle la media cucharadita extra de canela y el azúcar impalpable y espolvoree sobre la masa.", "Hornee en el horno durante 20 minutos, hasta que estén ligeramente dorados. Sirva caliente del horno."], "url": "www_bbc_co_uk_food_recipes_cinnamon_banana_and_80291", "title": "Magdalenas de canela, plátano y arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_banana_and_80291_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["650g / 1lb 7oz de harina blanca fuerte, más extra para espolvorear", "12 g de sal", "75 g / 2½ oz de azúcar en polvo", "20 g / ¾oz de levadura seca, desmenuzada", "500g / 1lb 2oz de mantequilla fría", "300g / 10½oz de queso crema", "1 vaina de vainilla, semillas raspadas", "2 cucharaditas de canela molida", "1 huevo de gallinas camperas, ligeramente batido (huevo lavado)", "25 g / 1 oz de azúcar", "25ml / 1fl oz de jarabe de arce", "25ml / 1fl oz de whisky bourbon", "200g / 7oz de azúcar glasé"], "method": ["Precalentar el horno a un ventilador de 200C / 400F / 180C / Gas 6.", "Coloque la harina, la sal, el azúcar y la levadura desmigajada en un mezclador independiente con un gancho de masa y mezcle lentamente en aproximadamente 450 ml / 16 fl oz de agua tibia, poco a poco. Es posible que no necesite todo el líquido, o puede necesitar un poco más. Mezcle hasta que la masa esté suave y comience a pegarse al borde del tazón.", "Retire el tazón de la mezcladora y cubra con film transparente. Dejar de lado.", "Deje que la masa se eleve durante aproximadamente 20 minutos o hasta que duplique su tamaño. Cuando la masa haya subido, saque el aire de ella y ruede sobre una superficie enharinada en una forma rectangular que mida 60cm x 30cm / 24in x 12in.", "Cortar la mantequilla en rectángulos de aproximadamente 1 cm / ½ pulgadas de espesor y colocarlos de un extremo a otro sobre la masa, cubriendo dos tercios de la superficie. Deje un margen lo suficientemente grande como para doblar los bordes más cortos de la masa sobre la mantequilla de modo que los dos bordes se encuentren en el centro. La masa se verá como las páginas de un libro abierto.", "Dobla la masa por la mitad otra vez como si estuvieras cerrando el libro.", "Coloque la masa sobre una superficie bien enharinada. Golpee y enrolle la masa en un tamaño rectangular de 60cm x 30cm / 24in x 12in nuevamente. Repita el proceso de golpeteo, plegado y laminado tres veces. Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante la noche.", "Después de que la masa ha descansado, enrolle la salida en un cuadrado de aproximadamente 5 mm / ¼ de grosor.", "Para el relleno, mezcle el queso crema y las semillas de vainilla en un tazón. Cubra las dos terceras partes inferiores de la masa en la mezcla de queso crema y espolvoree con canela. Enrolle la masa y córtela en rodajas de 4 cm / 1½ pulgadas de espesor.", "Engrase y forme una lata redonda de 23cm / 9 pulg. Coloque los panecillos alrededor del borde y uno en el medio, asegurándose de que no estén demasiado apretados. Deje probarlo hasta duplicar su tamaño.", "Cepille los panecillos con la colada de huevo y hornee en el horno durante 20 minutos.", "Para el glaseado, mientras la torta se está enfriando, agregue azúcar y jarabe de arce, más 25 ml / 1 fl oz de agua en una sartén y caliente suavemente, revolviendo hasta que el azúcar se disuelva. Agregue el bourbon y cocine a fuego lento hasta que el glaseado se reduzca y se vuelva pegajoso. Cepille generosamente la mezcla de glaseado en todo el pastel.", "Mezcle el azúcar glas y una cucharada de agua en un bol hasta que la mezcla forme un chorrito de hielo. (Es posible que necesite un poco más de agua.) Poner en una manga pastelera y rociar el pastel con la guinda.", "Deshaga la captura de resorte y transfiera los panecillos a un tablero o plato de pan. Rasgue y comparta, preferiblemente con una taza fuerte de té o café."], "url": "www_bbc_co_uk_food_recipes_cinnamon_cream_cheese_48034", "title": "Remolinos de queso crema canela con glaseado de bourbon", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 8 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para espolvorear", "40 g / 1½ oz de azúcar en polvo", "2 cucharadita de sal marina fina", "20g / ¾oz de levadura fresca o 10g / ¼ oz de levadura seca de acción rápida", "140ml / 4½fl oz de leche entera entera, ligeramente calentada", "5 yemas de huevo grandes", "90g / 3¼oz de mantequilla sin sal, cortada en cubos, ablandada,", "aceite de maní o vegetal, para freír", "½ limón, solo jugo", "750g / 1lb 10oz Bramley manzanas", "225 g / 8 oz de azúcar en polvo", "25 g / 1oz de mantequilla sin sal", "4 cucharaditas de jarabe de arce", "100g / 3½oz de azúcar glas, cernida", "100 g / 3½ oz de azúcar en polvo", "1 cucharadita de canela molida", "Crema doble 250ml / 9fl oz", "½ vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "Azúcar en polvo de 65 g / 2½ oz", "3 yemas de huevo grandes"], "method": ["Para las rosquillas, ponga la harina, el azúcar y la sal en el cuenco de una batidora eléctrica equipada con un gancho de masa (si usa levadura seca, agréguela al bol ahora). Revuelva para mezclar, luego haga un bien en el medio.", "En un tazón pequeño, mezcle la levadura fresca con un poco de leche hasta que quede cremosa, luego déjela reposar durante unos minutos hasta que quede espumosa. Agregue al pocillo en la harina junto con las yemas de huevo y la leche restante. Mezcle a baja velocidad para combinar, luego aumente ligeramente la velocidad y continúe mezclándose hasta que se forme una masa.", "Reduzca la velocidad un poco antes de agregar la mantequilla, poco a poco, y continúe mezclando hasta que esté completamente incorporada. Si la masa parece demasiado húmeda, mezcle un poco más de harina, una cucharada a la vez. Aumenta la velocidad y amasa la masa durante unos minutos hasta que esté suave y elástica. Cubra el tazón con película adhesiva y deje que la masa se eleve en un lugar cálido durante 1-2 horas o hasta que duplique su tamaño.", "Mientras tanto, haz que la manzana se llene. Agregue el jugo de limón a un recipiente grande de agua. Pelar, cortar y cortar las manzanas aproximadamente. Cuando los corte, colóquelos inmediatamente en el recipiente con agua acidulada para evitar que se doren.", "Escurra las manzanas y seque con una toalla de cocina, luego incline en una sartén de base pesada y agregue el azúcar y la mantequilla. Cocine a fuego lento, revolviendo ocasionalmente, durante aproximadamente 30 minutos o hasta que las manzanas estén muy suaves. Si parece que hay demasiado líquido, continúe cocinando a fuego lento hasta que la mezcla se espese. Transfiera las manzanas guisadas a un procesador de alimentos y mezcle hasta que queden uniformes, parando la máquina para que raspe los lados una o dos veces. Pasar el puré de manzana a través de un colador en un recipiente y dejar enfriar por completo, luego cuchara en una botella de plástico con una punta larga (o una manga con una boquilla larga y delgada). Dejar de lado.", "Derriba la masa y amasa suavemente sobre una superficie enharinada. Estirar la masa a una forma cuadrada o rectangular de 1cm / ½ pulgada. Línea dos bandejas para hornear con pergamino para hornear. Coloque la masa en una de las bandejas para hornear y deje enfriar en el congelador durante aproximadamente 30 minutos o hasta que la masa esté semicongelada (esto hará que sea más fácil cortarla).", "Con un cuchillo afilado, corte la masa en cuadrados de 4cm / 1½. Colóquelos, separados un poco, en las bandejas forradas. Cubra con película adhesiva ligeramente engrasada y deje en un lugar cálido durante aproximadamente una hora o hasta que la masa sea una vez y media el tamaño original.", "Mientras tanto, haga el glaseado de arce, combine los ingredientes en un tazón con una cucharada de agua y mezcle hasta que quede suave. Si el esmalte parece demasiado espeso, agregue un poco más de agua, un pequeño chorro a la vez, y mezcle bien hasta obtener la consistencia deseada.", "Para el azúcar de canela, mezcle el azúcar impalpable y la canela en un plato.", "Para la crema inglesa, caliente la crema con las semillas de vainilla y la vaina en una cacerola hasta que empiece a hervir. Retire del fuego y deje que la vainilla infunda la crema a medida que se enfría. Mientras tanto, bata el azúcar y las yemas de huevo juntas en un tazón grande. Cuando la crema de vainilla se haya enfriado, pesca la vaina, luego mezcla la crema con las yemas azucaradas. Vierta la mezcla a través de un colador fino en una olla limpia. Coloque a fuego lento y cocine, revolviendo constantemente con una cuchara de madera, hasta que la mezcla se espese en una crema fina que cubra ligeramente la parte posterior de la cuchara.", "Calienta 4-5 cm / 1½-2 in de aceite en una sartén profunda de fondo grueso, o una freidora de grasa profunda, a 170 ° C. Freír a fuego lento las rosquillas, en pequeños lotes, durante aproximadamente 2 minutos o hasta que estén doradas por todas partes. Retirar con una espumadera y escurrir sobre una bandeja forrada con varias capas de papel de cocina. Mientras las rosquillas aún estén tibias, coloca el relleno de manzana en el centro de cada una, luego coloca el azúcar canela.", "Una vez que todas las donas hayan sido fritas, rellenas y azucaradas, glasearlas en varios lotes. Coloque unos pocos en una sola capa en un estante de alambre colocado sobre una bandeja de horno grande. Rocíe el glaseado de arce sobre ellos y deje que se asiente ligeramente antes de transferirlos a un plato de servir. Sirva caliente o a temperatura ambiente con la crema de vainilla Anglaise."], "url": "www_bbc_co_uk_food_recipes_cinnamon_doughnuts_with_48492", "title": "Donuts de canela con relleno de manzana, glaseado de arce y crema de vainilla", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 30 rosquillas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cabeza de ajo", "1 manojo de tomillo fresco, aproximadamente picado", "3 cucharadas de jengibre rallado, incluida su piel", "6 chiles rojos secos, toscamente rotos", "4 cucharadas de sal marina", "12 alas de pollo, piel en", "2 x 4 cm / 1½ en ramas de canela", "500-700ml / 17fl oz-1¼ pintas de aceite vegetal o aceite de colza", "3 cucharaditas de salvia frotada o salvia seca triturada", "1 cucharada de ajo en polvo (opcional)", "1 cucharada de caldo de verduras en polvo", "1 cucharadita de chile en polvo", "1 cucharadita de tomillo seco", "½ cucharada de sal marina", "ensalada de col, como el repollo asiático de Hairy Bikers '"], "method": ["Para la cura, corte la cabeza de ajo varias veces en el ancho y deseche la mayor cantidad posible de la piel de papel. Coloque el ajo en un plato grande y poco profundo y agregue todos los ingredientes restantes del curado. Con un mortero, magulle suavemente la mezcla para liberar los sabores. Agregue las alitas de pollo y masajee la cura en ellas. Cubra y refrigere durante al menos seis horas, durante la noche si es posible.", "Cuando esté listo para cocinar el pollo, precaliente el horno a 150 ° C / 300 ° F / Gas 2. Retire las alitas de pollo de la nevera, limpie la solución con papel de cocina y seque lo más posible. Colóquelos en una olla profunda a prueba de horno con una tapa bien ajustada, agregue las ramas de canela y aceite suficiente para cubrir las alas. Cubra con la tapa y cocine en el horno precalentado durante tres horas; no hay necesidad de molestar el plato durante este tiempo.", "Retire la olla del horno y deje que el pollo se enfríe un poco en el aceite mientras lo limpia. El pollo necesitará una última cocción rápida en el horno, por lo que si desea servirlos inmediatamente, aumente la temperatura a 220C / 425F / Gas 7.", "Mezcle los ingredientes para quitar el polvo en un procesador de alimentos y reserve.", "Cuando las alitas de pollo se hayan enfriado, forra un plato con una doble capa de papel de cocina. Con una cuchara ranurada, retire las alitas de pollo del aceite (con cuidado, ya que estarán muy tiernas) y coloque sobre el papel de cocina durante unos minutos. Con cuidado, transfiera las alas a una lata para asar, y tueste durante 12 minutos más o hasta que estén crujientes.", "Retire las alas del horno y toque nuevamente con papel de cocina. Agítelo sobre la mezcla para quitar el polvo y sirva, permitiendo tres alitas de pollo por persona. ¡Sirve polvo adicional en caso de que quieras agregar aún más!"], "url": "www_bbc_co_uk_food_recipes_cinnamon_ginger_and_red_42146", "title": "Canela, jengibre y alitas de chile rojo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla, más extra para engrasar", "1 vaina de vainilla", "250g / 9 oz de azúcar, más 75 g / 2½ oz para quitar el polvo", "Harina normal de 250g / 9oz", "2 cucharadas de miel clara", "3 huevos de gallinas camperas", "½ cucharadita de canela molida, para quitar el polvo", "100 g / 3½ oz de azúcar en polvo", "Crema doble 350ml / 12fl oz", "1 estrella de anís", "½ ramita de canela", "25g / 1oz de mantequilla"], "method": ["Para las magdalenas, precalentar el horno a 170 ° C / 325 ° F / Gas 5 y untar con mantequilla las latas de Madeline.", "Calienta la mantequilla hasta que se derrita.", "Separe las vainas de vainilla y raspe las semillas, reservando la vaina.", "Coloque el azúcar y la harina en un tazón, luego agregue las semillas de vainilla, la miel y los huevos, luego mezcle con la mantequilla derretida hasta que tenga una mezcla suave y agradable.", "Coloque la masa en las latas, llenando solo la mitad de cada sangría.", "Hornee por 12-15 minutos o hasta que estén doradas. (Dependiendo del tamaño de las magdalenas, las pequeñas pueden tomar solo 8-10 minutos.)", "Mezcle la canela molida y el azúcar para quitar el polvo de un plato, luego enrolle las magdalenas rápidamente en el azúcar para cubrirlas completamente.", "Para la salsa de caramelo de invierno, caliente el azúcar en una sartén hasta que se vuelva dorado claro. Vierta la mitad de la crema y deje que hierva, revolviendo bien.", "Agregue el anís estrellado, la canela, la vaina de vainilla reservada y la mantequilla y el resto de la crema. Cocine por 2-3 minutos hasta que espese y suavice.", "Cuele a través de un tamiz fino en un recipiente.", "Sirve las magdalenas con la salsa. Se pueden guardar en un recipiente hermético por hasta una semana."], "url": "www_bbc_co_uk_food_recipes_cinnamon_madeleines_with_16096", "title": "Magdalenas de canela con salsa de caramelo de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60 g / 2 oz de avena jumbo avena", "¼ cucharadita de canela molida, más un poco para espolvorear", "300 ml / 10 fl oz de leche semidesnatada", "1 pera mediana madura", "1 limón de cuña"], "method": ["Ponga la avena y la canela en una olla antiadherente con la leche y cocine a fuego medio bajo durante 4-5 minutos, revolviendo constantemente hasta que esté rico y cremoso. Vierta en dos cuencos profundos.", "Rallar gruesamente la pera y colocar encima de la papilla. Exprima el jugo de limón y espolvoree con una pizca de canela molida."], "url": "www_bbc_co_uk_food_recipes_cinnamon_porridge_with_53154", "title": "Gachas de canela con pera rallada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_porridge_with_53154_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["625g / 1lb 6oz de harina blanca fuerte, más extra para espolvorear", "75 g / 2½ oz de azúcar en polvo", "1 pizca de sal marina", "20 g / ¾oz de levadura seca", "500g / 1lb 2oz de mantequilla fría", "300g / 11oz de queso crema con alto contenido de grasa", "1 vaina de vainilla, semillas raspadas", "1 cucharadita de canela molida", "2 yemas de huevo de gallinas camperas, ligeramente batidas para lavar huevos", "200g / 7oz de azúcar glas, tamizado", "100ml / 3½fl oz de jarabe de arce", "25ml / 1fl oz de whisky bourbon"], "method": ["Para hacer la masa, coloque la harina, el azúcar, la sal y la levadura en un mezclador equipado con un gancho para masa y mezcle lentamente en 450 ml / 16 fl oz de agua, agregando más o menos según sea necesario, hasta que la masa se adhiera al borde del bol y se siente elástico.", "Cubra el recipiente con una toalla de té limpia y deje que la masa se levante durante aproximadamente 20 minutos, o hasta que duplique su tamaño.", "Cuando la masa haya subido, saque el aire de ella y ruede sobre una superficie enharinada en una forma rectangular que mida 60x30 cm / 24x12 in.", "Cortar la mantequilla en rectángulos de aproximadamente 1 cm / ½ de espesor y colocar en dos tiras que cubren la mitad de la masa. Dobla la masa y presiona ligeramente los bordes para sellar.", "Sobre una superficie bien enharinada, golpee la masa con el rodillo y luego gírela en un rectángulo de 60x30cm / 24x12 pulgadas. Doble cada extremo para que se encuentre en el medio, luego doble y repita el proceso de golpeo, plegado y laminado dos veces más. Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante una hora.", "Ruede la masa en un rectángulo de aproximadamente 1 cm / ½ pulgada de grosor. El rectángulo debe tener 30 x 45 cm / 12 x 8 pulgadas de largo.", "Para el relleno, mezcle el queso crema, las semillas de vainilla y la canela en un tazón.", "Cubra la masa con la mezcla de relleno, luego enrolle desde el lado más largo para formar un rollo suizo de 45cm / 18 pulgadas de largo. Cortar en nueve rebanadas cada 5cm / 2 pulgadas de largo.", "Engrase y forme una lata redonda de forma de primavera de 23 cm / 9 pulg. Coloque los círculos alrededor del borde, de pie y uno en el medio, asegurándose de que no estén demasiado apretados. Deje que se pruebe durante aproximadamente 40 minutos o hasta que duplique su tamaño.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cuando esté listo para hornear, cepille la masa con un lavado de huevo y hornee por 45 minutos o hasta que se dore. Los rollos se expandirán y se unirán.", "Para el glaseado, mientras los panecillos se enfrían, mezcle el azúcar glas, el jarabe de arce y el bourbon en un tazón hasta que quede suave.", "Levante los rollos de la lata y coloque un plato de servir. Rocíe el glaseado sobre la parte superior, hacia adelante y hacia atrás. Arranca los rollos para separarlos y sirve caliente."], "url": "www_bbc_co_uk_food_recipes_cinnamon_rolls_67339", "title": "Rollos de canela", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 2 oz de cerdo de vientre, grasa anotada con un cuchillo afilado", "1 cucharada de escamas de sal marina", "3 palitos de canela", "6 dientes", "2 manzanas Granny Smith, peladas, sin corazón y en rodajas", "2 naranjas Navel grandes, gruesas en rodajas", "200 ml / 7 fl oz de sidra mediana ecológica, más extra para hilvanar", "25g / 1oz de mantequilla", "1 cebolla, pelada, finamente rebanada", "1 ramita de canela", "¼ cucharadita de nuez moscada recién rallada", "Anís de 2 estrellas", "1 hoja de laurel", "Repollo rojo de 500g / 1lb 2oz, sin núcleo, finamente rebanado", "125 ml / 4½ fl oz de sidra mediana ecológica", "2 cucharadas de azúcar mascabado ligero", "sal y pimienta negra recién molida", "2 cucharadas de jalea de grosella", "110g / 4oz de almendras blanqueadas", "2 cucharaditas de aceite de cacahuete"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el vientre de cerdo, hierva un hervidor y vierta el agua hirviendo sobre la piel de cerdo, descartando el agua.", "Seque el vientre de cerdo, use papel de cocina, frote la sal sobre la piel y apriételos en las marcas.", "Coloque los palitos de canela, los clavos de olor, las manzanas en rodajas, las naranjas y la sidra en el fondo de una lata para asar. Coloque la barriga de cerdo encima y tueste durante una hora en el medio del horno. Luego, reduzca la temperatura a 140 ° C / 275 ° F / Gas 1 y cocine durante 2 horas. Agregue más sidra al fondo de la lata de tueste si todo el líquido se evapora.", "Una vez cocido, retire la barriga de cerdo del horno y déjela reposar durante 15 minutos.", "Mientras tanto, para la col sidra mulled, derrita la mantequilla en una sartén con tapa a fuego medio y fría la cebolla durante 4-5 minutos, o hasta que se ablande. Agregue la ramita de canela, la nuez moscada, el anís estrellado y la hoja de laurel y continúe cocinando durante otros 1-2 minutos. Agregue el repollo, la sidra y el azúcar hasta que estén bien combinados y el azúcar se haya disuelto. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Llevar la mezcla a ebullición y reducir el fuego hasta que la mezcla esté hirviendo a fuego lento. Cubra la olla con una tapa y cocine a fuego lento, revolviendo ocasionalmente, durante 1-1½ horas, o hasta que el repollo esté tierno y el líquido se haya evaporado. Retire el anís estrellado y la ramita de canela y agregue la jalea de grosella.", "Para las almendras saladas, mezcle las almendras y el aceite en un tazón y sazone, al gusto, con sal y pimienta negra recién molida. Transfiera a una bandeja para hornear y tueste en el horno por 10 minutos o hasta que se dore. Retirar del horno y reservar para enfriar.", "Para servir, esculpe el vientre de cerdo en cuadrados. Ponga un poco de col de sidra caliente en el centro de cada uno de los 8 platos para servir, cubra con un trozo de panza de cerdo y una cuchara sobre algunos jugos de cocina. Adornar con las almendras tostadas."], "url": "www_bbc_co_uk_food_recipes_cinnamonandapplepork_93116", "title": "Vientre de cerdo con canela y manzana con col de sidra molida y almendras tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz de azúcar morena suave", "25g / 1oz de mantequilla", "1 manzana, sin corazón, reducido a la mitad, en rodajas finas", "25 g / 1oz de pasas", "½ cucharadita de canela molida", "4 hojas de pasta de filo lista para usar", "1 huevo de gallinas camperas, golpeado", "1 cucharada de azúcar glas", "crema lista para usar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque el azúcar y la mantequilla en una sartén y derrita a fuego medio. Agregue la manzana, las pasas y la canela y mezcle bien para cubrir.", "Mientras tanto, coloque dos hojas de hojaldre para cubrirlas en una bandeja para hornear. Las dos hojas de filo se cruzan con las otras dos hojas. Para crear estrella puntiaguda y cepillar todo con huevo batido.", "Coloca la mezcla de manzana en el centro de la masa y dobla sobre todos los extremos, en el centro que cubre la manzana.", "Cepille la parte superior de la masa con huevo. Coloque en el horno y hornee durante diez minutos, o hasta que la masa esté dorada.", "Para servir, espolvorear la manzana con azúcar glas y servir con una cucharada de crema."], "url": "www_bbc_co_uk_food_recipes_cinnamonandappleturn_84027", "title": "Volumen de ventas de canela y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de sultanas verdes", "1.2kg / 2lb 10¼ oz de manzanas de postre mezcladas, peladas, sin corazón, cortadas en trozos", "100g / 3½oz de azúcar morena suave", "50 g / 1¾oz de pistachos sin sal, conchas eliminadas, picadas, más extra para espolvorear en la parte superior", "1 cucharadita de canela molida", "200 g / 7 oz de azúcar en polvo", "200 g / 7¼ oz de mantequilla sin sal", "3 huevos de gallinas camperas", "200 g / 7¼ oz de almendras molidas", "5 cucharadas de almendras en copos", "helado de vainilla, para servir"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Remoje las pasas sultanas en un tazón pequeño de agua tibia durante 30 minutos.", "Coloque las manzanas en una cacerola mediana con el azúcar moreno y cocine a fuego lento hasta que estén suaves. Escurrir las sultaninas y agregarlas a la sartén, luego agregar los pistachos picados y la canela. Dejar de lado.", "En un tazón grande, bata la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Batir los huevos uno por uno y luego doblar en las almendras molidas. Revuelva ligeramente para hacer una mezcla suave.", "Coloque las manzanas en una fuente para hornear y extender la mezcla de crema sobre la parte superior. Cocine en el horno durante 30 minutos, luego espolvoree con las almendras en copos y los pistachos reservados. Regrese al horno y cocine por otros 10 minutos.", "Sirva un trozo de pastel con una bola de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_cinnamonandpistachio_91062", "title": "Tarta de manzana con canela y pistacho con helado de vainilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina blanca fuerte", "pizca de sal", "1½ cucharadita de canela molida", "115 g / 4¼ oz de azúcar en polvo", "25g / 1oz de mantequilla, ablandada", "150ml / 5fl oz de agua", "20g / ¾oz de levadura fácil de mezclar", "aceite vegetal, para freír", "300ml / ½ pinta de leche entera", "2 palitos de canela", "1 cucharadita de canela molida", "1 vaina de vainilla, partido, semillas raspadas usando un cuchillo", "6 yemas de huevo de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz", "Crema doble de 300 ml / 10½ fl oz, batida hasta que se formen picos suaves cuando se quita la batidora", "75g / 3oz de azúcar en polvo", "110 ml / 4 fl oz de agua", "200 g / 7 oz de chocolate negro, toscamente picados"], "method": ["Para las rosquillas de canela, en un tazón grande, mezcle la harina, la sal, media cucharadita de canela molida, 40 g / 1½ oz de azúcar en polvo y toda la mantequilla, el agua y la levadura hasta que estén bien combinados. Siga mezclando durante 4-5 minutos, o hasta que la mezcla se una como una masa homogénea. Cubra con película adhesiva y déjela a un lado durante una hora para probarla.", "Cuando la masa de rosquilla haya duplicado su tamaño, divídala en ocho porciones iguales y enrolle cada una en una bola.", "Alinee una bandeja con pergamino para hornear y coloque las bolas de masa sobre ella, dejando espacio suficiente entre cada bola. Reserve en un lugar cálido para que se eleve durante otros 20 minutos.", "Caliente el aceite en una freidora a 150C / 320F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje las bolas de masa en el aceite caliente en lotes y fría durante 6-8 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Cuando el exceso de aceite haya drenado las donas, mezcle la cucharada restante de canela molida y los restantes 75 g / 2¾ oz de azúcar y espolvoree sobre un plato. Dragar las donas en la mezcla hasta que estén completamente cubiertas.", "Para el helado de canela, lleve la leche, los palitos de canela, la canela molida, la vaina de vainilla y las semillas de vainilla a fuego lento en una sartén, revolviendo regularmente. Cuando la leche esté hirviendo a fuego lento, retire la vaina de vainilla y los palitos de canela y deséchelos (pueden limpiarse bien y reutilizarse en otra receta).", "Mientras tanto, mezcle las yemas de huevo y el azúcar en un tazón hasta que estén pálidos y esponjosos.", "Vierta la mezcla de leche sobre la mezcla de huevo y azúcar, batiendo continuamente hasta que esté bien combinado. Regrese la mezcla a la cacerola y continúe cocinando por 2-3 minutos a fuego medio, o hasta que espese. Retirar del fuego y dejar enfriar un poco.", "Cuando la mezcla de helado se haya enfriado un poco, cuela a través de un colador fino sobre la crema batida. Batir hasta que esté suave y bien combinado, luego vierta la mezcla en una máquina de helados. Revuelva durante 40-50 minutos, o hasta que esté casi sólido, luego transfiéralo a un recipiente congelable y enfríelo en el congelador.", "Para la salsa de chocolate, traiga el azúcar y el agua a fuego lento en una sartén. Cocine a fuego lento durante 1-2 minutos, revolviendo continuamente, hasta que todo el azúcar se haya disuelto.", "Agregue las piezas de chocolate y bata hasta que el chocolate se haya derretido y la mezcla esté suave. Sáquelo del fuego y apártelo.", "Para servir, coloca dos rosquillas de canela en el centro de cada una de las cuatro placas para servir. Sirva una bola de helado de canela al costado y rocíe sobre la salsa de chocolate."], "url": "www_bbc_co_uk_food_recipes_cinnamondoughnutswit_91336", "title": "Donuts de canela con helado de canela y salsa de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½ fl oz de leche", "1 huevo de gallinas camperas", "pellizcar canela molida", "1 soda farl, cortado por la mitad", "30g / 1oz de mantequilla", "50 g / 1 oz de azúcar en polvo", "1 vaina de vainilla, cortada por la mitad", "100ml / 3½fl oz de vino blanco", "1 melocotón, cortado en cuñas", "cariño, llovizna"], "method": ["Para la tostada francesa, coloque la leche, el huevo y la canela en un bol y mezcle bien.", "Sumerja las mitades de soda farl en la mezcla de huevo hasta que se empape.", "Caliente la mantequilla en una sartén y cocine las sodas durante 2-3 minutos por cada lado, o hasta que estén doradas. Apartar y mantener caliente.", "Para los melocotones, coloque el azúcar impalpable, la vaina de vainilla y el vino blanco en una cacerola y deje que hierva. Agregue las piezas de melocotón a la sartén y cocine a fuego lento durante 4-5 minutos, o hasta que el melocotón esté tierno.", "Para servir, coloca la tostada francesa en un plato de servir. Retire los melocotones del almíbar con una espumadera y colóquelos encima de la tostada, rociados con miel."], "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_84863", "title": "Tostada francesa de canela con melocotones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "100ml / 3½ fl oz crema doble", "100ml / 3½ fl oz de leche", "1 cucharada de azúcar glas", "½ cucharadita de canela molida", "2 rebanadas de pan blanco", "25g / 1oz de mantequilla", "150ml / 5fl oz de crema doble", "1 cucharada de azúcar glas", "85g / 3 oz de grosellas rojas", "50ml / 2fl oz de vino tinto", "1 cucharada de azúcar glas", "ramita de grosellas rojas", "ramita de menta fresca"], "method": ["Para la tostada francesa, mezcle los huevos en un tazón junto con la crema, la leche, el azúcar glas y la canela hasta que estén bien combinados. Remoje las rebanadas de pan en la mezcla.", "Derrita la mantequilla en una sartén y fríe el pan remojado durante 2-3 minutos en ambos lados, o hasta que esté dorado y crujiente. Retire el pan frito de la sartén y escurra sobre papel de cocina.", "Para la crema, batir ligeramente la crema con el azúcar glas hasta que se formen picos suaves cuando se quite la batidora del bol.", "Para la salsa de grosellas rojas, coloque las grosellas, el vino y el azúcar glas en un procesador de alimentos y mezcle hasta que quede suave. Empuja la mezcla a través de un colador para eliminar cualquier pepita.", "Para servir, coloque la tostada francesa en un plato, cubra con la crema y la cuchara alrededor de la salsa de grosella. Adorne con la ramita de grosellas y menta."], "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_90386", "title": "Tostada francesa a la canela con crema de chantilly y salsa de grosella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "150ml / 5fl de leche en oz", "1 cucharada de azúcar en polvo", "½ cucharadita de canela molida", "2 rebanadas de pan blanco", "25g / 1oz de mantequilla", "1 naranja, pelado y rebanado", "azúcar en polvo, para quitar el polvo", "2 cucharadas de miel clara", "3 cucharadas de crema doble"], "method": ["Batir el huevo, la leche, el azúcar y la canela en un bol hasta que estén bien combinados, luego remojar las rebanadas de pan en la mezcla.", "Derrita la mantequilla en una sartén, agregue las rebanadas de pan y fría por 1-2 minutos en ambos lados, o hasta que estén doradas por todas partes.", "Para servir, coloque las rodajas de naranja en un plato para servir, coloque la tostada encima y espolvoree con azúcar glas. Rocíe la miel y la crema."], "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_90685", "title": "Tostada francesa de canela con miel, crema y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]