[{"isVegetarian": false, "title": "Chargrilled lamb steak with rosemary and black pepper and a feta and green bean salad", "url": "www_bbc_co_uk_food_recipes_chargrilledlambsteak_92429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp chopped fresh rosemary leaves", "½ tsp black peppercorns, cracked", "100g/3½oz lamb leg steak", "pinch salt", "1 tbsp olive oil", "85g/3oz green beans, trimmed and blanched", "¼ onion, peeled, finely sliced", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "55g/2oz feta, crumbled", "2 tbsp pistachio nuts"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled lamb, heat  a griddle pan until hot. Rub the rosemary and black pepper into both sides of the lamb leg steak, season with the salt and drizzle over the olive oil. ", "Cook the lamb on the griddle over a medium heat for 4-5 minutes on each side (for medium), or until golden-brown all over and cooked to your liking. Remove the meat from the pan and leave to rest on a warm plate.", "For the feta green bean salad, gently mix together all of the salad ingredients in a bowl. ", "To serve, spoon the feta and green bean salad onto a serving plate and place the lamb leg steak alongside."]}, {"isVegetarian": false, "title": "Chargrilled lamb with rocket pesto, roasted tomatoes and crushed sweet potato", "url": "www_bbc_co_uk_food_recipes_chargrilledlambwitha_88296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz lamb fillet", "dash olive oil", "salt and freshly ground black pepper", "large handful fresh rocket leaves", "55g/2oz feta cheese, crumbled", "2 tbsp sesame seeds, toasted in a hot pan", "2 garlic cloves", "3-4 tbsp olive oil", "salt and freshly ground black pepper", "2 fresh vine tomatoes, halved", "dash olive oil", "salt and freshly ground black pepper", "1 tsp fresh thyme leaves", "½ sweet potato, peeled, finely chopped", "2 tbsp Greek-style yoghurt", "1 tbsp chopped fresh coriander", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/ Gas 4.", "For the chargrilled lamb, rub the lamb with olive oil and season well with salt and freshly ground black pepper. Place onto the hot griddle pan to chargrill for 2-3 minutes on both sides, or until cooked to your liking. Remove from the heat and leave to rest in a warm place for five minutes and then slice.", "For the rocket pesto, place the rocket, feta, olive oil, sesame seeds, garlic, salt and freshly ground black pepper into a food processor and blend until smooth.", "For the roasted tomatoes, place the halved tomatoes onto a baking sheet, drizzle with olive oil and season with salt and freshly ground black pepper. Sprinkle with the thyme leaves and place into the oven to roast for 10-12 minutes.", "For the crushed sweet potatoes, place the sweet potato cubes into a small pan of boiling salted water and boil for five minutes, or until tender. Drain and allow to steam dry.", "Add the yoghurt and coriander and roughly crush the potatoes with a fork. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the crushed sweet potato onto a serving plate and top with the lamb slices. Place the roasted tomatoes alongside and drizzle over the rocket pesto."]}, {"isVegetarian": false, "title": "Chargrilled lamb with curried butternut squash and cabbage", "url": "www_bbc_co_uk_food_recipes_chargrilledlambwithc_77969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/ 5¼oz butternut squash (base section)", "2tbsp olive oil", "salt and freshly ground black pepper ", "50g/1¾oz unsalted butter", "1tbsp curry powder", "1 garlic clove, sliced", "25g/1oz unsalted butter", "200g/7oz cabbage, shredded", "150g/5¾oz lamb (leg steak)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the butternut squash curry, preheat the oven to 200C/400F/Gas 6.", "Leaving the skin on, remove the seeds from the butternut squash and cut into wedges. Toss in the olive oil and season well.", "Heat a griddle pan. Place the butternut squash wedges onto the griddle, cooking for four to five minutes, turning to create grill marks.", "Place the butternut on a baking-sheet. Sprinkle the curry powder over and distribute the unsalted butter in small knobs. Place in the oven and bake for ten minutes.", "To make the cabbage, heat a medium frying pan, melt the butter and add the sliced garlic. Cook for one minute.", "Add the shredded cabbage and cook for ten minutes, allowing to wilt down. ", "To cook the lamb steak, put the griddle pan onto a high heat. Season the lamb steak on both sides, place in the pan and cook for one and a half minutes on each side or until cooked to your liking.", "To serve, arrange a cabbage base on a warm plate. Place the curried butternut on top and serve the lamb steaks on the side."]}, {"isVegetarian": true, "title": "Chargrilled peaches with fresh basil sabayon", "url": "www_bbc_co_uk_food_recipes_chargrilledpeacheswi_84530", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz tin peach halves, drained and patted dry", "1 tbsp olive oil", "3 free-range egg yolks", "1 tbsp caster sugar", "1 tbsp white wine", "6-8 fresh basil leaves, shredded"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting. Heat a griddle pan until smoking.", "Drizzle the peaches with the olive oil and place cut-side down into a hot griddle pan and chargrill for 2-3 minutes, or until golden-brown. Transfer to serving plates and set aside in a warm place.", "For the sabayon, place the egg yolks, sugar and wine into a bowl placed over a saucepan of simmering water. Whisk vigorously and constantly until the mixture becomes thick and foaming.", "Add the fresh basil and fold through the mixture.", "Place the peaches onto a baking sheet. Spoon the sabayon over the peaches and place under the grill to cook for three minutes, or until golden brown.", "Place the peaches onto a plate and serve."]}, {"isVegetarian": false, "title": "Chargrilled leek, spring onion and halloumi salad with tea-smoked chicken", "url": "www_bbc_co_uk_food_recipes_chargrilledleeksprin_86959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 leeks, trimmed", "12 spring onions", "250g/9oz halloumi cheese, cut into slices", "1 tbsp capers, rinsed, drained and roughly chopped", "20g/¾oz sun-dried tomatoes, roughly chopped", "4 tbsp extra virgin olive oil", "1 tbsp white wine vinegar", "½ lemon, juice only", "2 baby Little Gem lettuces, cut into wedges", "75g/3oz rocket", "1 onion, cut into quarters", "1 carrot, cut into chunks", "2 sprigs fresh thyme", "2 sprigs fresh flatleaf parsley", "4 chicken breasts, boneless and skinless", "100g/4oz basmati rice", "2 tbsp jasmine tea", "2 tbsp demerara sugar", "oil, for greasing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, heat a pan of water until boiling, then place a steamer on top. Place the leeks and spring onions into the steamer, cover with a lid and steam for 2-3 minutes, until just tender.", "Meanwhile, heat a griddle pan until hot and griddle the halloumi for one minute on each side, or until charred. Remove from the griddle and set aside. Griddle the leeks and spring onions until charred on all sides, then set aside.", "Place the capers and sun-dried tomatoes into a bowl, add the olive oil, vinegar and lemon juice and mix well.", "Cut the charred vegetables and cheese into chunks and place into a large bowl. Add the lettuce and rocket, pour over the dressing and stir to coat.", "For the chicken, fill a large saucepan with water and add the onion, carrot, thyme and parsley. Bring to a simmer, then add the chicken. Bring back to a simmer and poach for 6-8 minutes, or longer for larger chicken breasts. Remove from the water and pat dry with kitchen paper.", "Place a piece of foil in the bottom of a wok, top with the uncooked rice, tea and sugar and cover with a lid. Place on the heat for 3-4 minutes, until the tea starts to smoke. (NB: Tea-smoking generates a lot of smoke. Be sure that you open the windows and get as much ventilation as you can.)", "Place the poached chicken onto an oiled piece of foil in a steamer, then set the steamer inside the wok. Place a lid on the steamer and heat for 2-3 minutes, or until the chicken is lightly smoked and completely cooked through.", "To serve, divide the salad among four serving plates. Cut the chicken into slices and place on top of the salad on each plate."]}, {"isVegetarian": true, "title": "Chargrilled peaches with honey, yoghurt and sugar-glazed pine nuts", "url": "www_bbc_co_uk_food_recipes_chargrilledpeacheswi_92427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 peaches, halved, stones removed", "2 tbsp olive oil", "1 tbsp butter", "3 tbsp pine nuts", "1 tbsp soft brown sugar", "3 tbsp greek-style yoghurt", "2 tbsp honey", "1 sprig fresh mint"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until hot. Drizzle the cut-side of the peaches with the olive oil and fry in the hot pan for 5-6 minutes, or until the peaches have grill marks on the bottom.", "Melt the butter in a small frying pan add the pine nuts and sugar and stir until the sugar is melted and is bubbling and golden-brown. Pour onto a silicone or similar non-stick sheet and leave to cool completely. When cooled, break into small pieces with your fingers.", "To serve, place the peaches on a plate and spoon over the yoghurt. Drizzle over the honey, sprinkle ove the sugar-glazed pine nuts and garnish with the sprig of mint."]}, {"isVegetarian": false, "title": "Chargrilled peach salad", "url": "www_bbc_co_uk_food_recipes_chargrilledpeachsala_84862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz blue cheese", "2 tbsp milk", "1 tbsp olive oil", "1 peach, cut into wedges ", "2 handfuls fresh rocket", "1 tbsp chopped fresh chives", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 slice Parma ham, chopped", "2 tbsp black olives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place all of the dressing ingredients into a mini-food processor and blend until smooth.", "For the salad, heat a griddle pan and cook the peach pieces for 3-4 minutes on each side, or until chargrilled and tender.", "Place the rocket, chives and oil into a bowl, mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, place the herb salad onto a plate and top with the chargrilled peach pieces, Parma ham and olives. Drizzle over the dressing."]}, {"isVegetarian": true, "title": "Chargrilled pears with herb salad and Stilton port dressing", "url": "www_bbc_co_uk_food_recipes_chargrilledpearswith_79093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pear, thinly sliced ", "25g/1oz butter ", "3 kumquats, juice only", "1 egg yolk ", "25ml/1fl oz port ", "100ml/4fl oz olive oil ", "50g/5oz crumbled blue cheese ", "1 handful fresh coriander ", "1 handful fresh chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pears, heat a chargrill pan. Add the butter and the slices of pear and chargrill for four minutes until golden.", "To finish, squeeze the kumquat juice on top.", "In a bowl, mix the egg yolk with the port, then whisk in the olive oil gradually. Finish by adding the crumbled cheese and the fresh herbs.", "To serve, place the pears on a plate and top with herb salad and any extra dressing around the plate."]}, {"isVegetarian": true, "title": "Chargrilled pears with spinach and coriander salad and tomato chutney", "url": "www_bbc_co_uk_food_recipes_chargrilledpearswith_79476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pear, cut into quarters, cored and skin left on", "4 thin slices ciabatta brushed with olive oil", "100g/3½oz baby leaf spinach", "small bunch fresh coriander, roughly chopped", "2 slices toast, cut into thick croutons and tossed in olive oil", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "¼ onion, chopped", "1 garlic clove, finely sliced", "50g/1¾oz brown sugar", "150g/5½oz cherry tomatoes, halved", "3 tbsp white wine vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking. Add the pear quarters and griddle on both sides for one minute to create grill lines, then remove from the heat and set aside.", "Place the ciabatta bread onto the griddle pan and cook for one minute on each side to create grill lines. Remove and set aside.", "To make the salad, take two of the griddled pear quarters and chop them into small dice.", "Place the spinach, coriander, croutons and diced pear in a large bowl and mix together well.", "Add the olive oil, season, to taste, with salt and freshly ground black pepper and set aside.", "To make the chutney, place the olive oil in a frying pan over a medium heat. Add the onion and garlic and fry for one minute.", "Add the brown sugar and cherry tomatoes and cook for a further minute.", "Add the white wine vinegar and heat to simmer and cook to reduce for five minutes.", "To serve, place the salad on a plate with the remaining chargrilled pear pieces and ciabatta placed around the salad. Pour the chutney into a small bowl and serve beside the salad."]}, {"isVegetarian": false, "title": "Chargrilled steak with beer, mustard and watercress salad", "url": "www_bbc_co_uk_food_recipes_chargrilledribeyeste_91464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledribeyeste_91464_16x9.jpg", "ingredients": ["150ml/5f loz cider vinegar", "5 tbsp caster sugar", "60g/2½oz yellow mustard seeds", "25g/1oz brown mustard seeds", "2 tbsp English mustard powder", "110ml/4fl oz beer", "2 x 250g/9oz ribeye steaks", "2 tbsp olive oil", "salt and freshly ground black pepper", "½ small wholegrain loaf, cut into 1.5cm/3in cubes", "2 tsp cider vinegar", "1½ tbsp rapeseed oil", "salt and freshly ground black pepper", "1 bunch watercress, leaves only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the homemade beer mustard, place the vinegar and sugar into a non-reactive pan and bring to a simmer. Add the yellow and brown mustard seeds and the mustard powder and stir well. Simmer over a high heat for three minutes, until the volume of liquid has reduced by half and the seeds have softened slightly.", "Pour the mustard mixture into the bowl of a food processor and blend to a purée. It will take a few minutes for the seeds to break down and the mustard to become creamy.", "Add the beer to the mustard mixture and blend once more. Season to taste with salt and freshly ground black pepper. Use immediately or spoon into jars, seal and store in the refrigerator. (NB This recipe makes more mustard than required for the dish.)", "For the steak, heat a griddle pan until hot. Rub the steaks with one tablespoon of the olive oil, then season to taste with salt and freshly ground black pepper.", "Place the steaks onto the hot griddle and cook without moving for 1-2 minutes, then turn 90 degrees with tongs and cook for a further minute, to give the steaks a lattice pattern of griddle marks. Turn the steaks over and repeat the process on the other side. Remove the steaks from the pan and place onto a plate to rest; keep warm.", "Meanwhile, for the salad, heat the remaining oil in a frying pan, add the bread cubes and fry for 2-3 minutes, turning occasionally, until crisp and golden-brown. Remove the croûtons with a slotted spoon, drain onto kitchen paper and season to taste with salt and freshly ground black pepper.", "Place one teaspoon of the homemade mustard into a large bowl. Add the cider vinegar, whisk in the rapeseed oil and season to taste with salt and freshly ground black pepper. Add the croutons and watercress and mix well.", "To serve, cut the steaks into thick slices and spoon the mustard into 2 small pots. Pile the salad onto the centre of each plate. Lay the steak over the salad and serve with a mustard pot on the side."]}, {"isVegetarian": false, "title": "Chargrilled salmon with creamed garlic peas and a balsamic reduction", "url": "www_bbc_co_uk_food_recipes_chargrilledsalmonwit_88191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salmon fillet, skin removed", "dash olive oil", "salt and freshly ground black pepper", "100g/3½oz fresh peas", "15g/½oz butter", "1 garlic clove, finely chopped", "3 tbsp double cream", "1 sprig fresh thyme, leaves only", "salt and freshly ground black pepper ", "3 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, rub the salmon with olive oil, salt and freshly ground black pepper. Heat a griddle pan until hot, add the salmon and griddle for 1-2 minutes on each side, or until charred on the outside and just cooked through.", "For the creamed garlic peas, place the peas into a pan of boiling salted water and boil for 2-3 minutes, or until tender and then drain. Place the cooked peas into a small pan, add the butter and garlic and fry gently for 1-2 minutes. Add the cream, thyme, salt and freshly ground black pepper and simmer for two minutes.", "For the balsamic reduction, pour the balsamic vinegar into a small pan and simmer for ten minutes, or until reduced and sticky.", "To serve, spoon the peas onto a serving plate. Top with the chargrilled salmon and drizzle the balsamic reduction onto the plate."]}, {"isVegetarian": false, "title": "Chargrilled sea bass with potato rosti, sautéed vegetables and sauce vierge", "url": "www_bbc_co_uk_food_recipes_chargrilledseabasswi_88624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 sea bass fillet, skin scored", "salt and freshly ground black pepper", "½ lemon, juice only ", "½ large red potato, peeled and grated", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 tbsp olive oil", "½ carrot, cut into batons", "½ courgette, cut into batons", "salt and freshly ground black pepper", "5 tbsp olive oil", "1 tomato, seeds removed, chopped", "1 garlic clove, finely chopped", "2 tbsp balsamic vinegar", "1 handful fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled sea bass, heat the oil in a griddle pan until hot. Season the fish with salt and freshly ground black pepper and fry for about three minutes, skin-side down. Turn the fillet over and remove from the heat. Squeeze over the lemon juice and allow to continue cooking in the residual heat, until cooked through. ", "For the potato rösti, place the grated potato into a clean tea towel and squeeze out the excess water. Season the potato with salt and freshly ground black pepper. Heat the oil in a small frying pan and pack the seasoned potato into the pan. Allow to cook through without stirring, turning once, until golden-brown on both sides, about 4-5 minutes per side.", "For the sautéed vegetables, heat the oil in a wok and stir fry the carrot and courgette for about 4-5 minutes. Season with salt and freshly ground black pepper.", "For the sauce vierge, place all the ingredients into a small pan and heat gently for about 3-4 minutes.", "To serve, place the rösti in the centre of a serving plate and top with the bass fillet. Arrange the vegetables to one side and spoon the sauce vierge around the edge."]}, {"isVegetarian": false, "title": "Chargrilled sesame tiger prawn skewers with broccoli", "url": "www_bbc_co_uk_food_recipes_chargrilledsesametig_90507", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 raw tiger rawns, shelled but heads and tails left on", "1 lime, half cut into wedges, half juiced", "1 tbsp soy sauce", "1 tbsp honey", "1 tbsp sesame seeds", "½ head broccoli, cut into florets and cooked", "1 pinch chilli flakes", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak a wooden skewer in cold water for 10-15 minutes. Drain.", "For the prawns, thread the prawns onto the skewer, alternating with two wedges of lime. Heat a chargrill pan until smoking and grill the skewers for 1-2 minutes, then turn over. Sprinkle the lime juice, soy sauce, honey and sesame seeds over the prawns and cook for a further 1-2 minutes, or until the prawns are pink and cooked through. ", "For the broccoli, toss the broccoli with the chilli flakes and oil, and season well with salt and freshly ground black pepper.", "To serve, spoon the broccoli arrabiata onto a serving plate and top with the prawn skewer."]}, {"isVegetarian": false, "title": "Chargrilled smoked salmon with rocket and parmesan", "url": "www_bbc_co_uk_food_recipes_chargrilledsmokedsal_10015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz fresh parmesan", "4 tbsp olive oil", "2 tbsp balsamic vinegar", "sea salt and freshly ground black pepper", "200g/7oz rocket leaves", "225g/8oz sliced smoked salmon"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a potato peeler, shave the parmesan into thin strips, set to one side.", "Mix the olive oil together with the vinegar and some seasoning. Mix into the rocket leaves and place on the plates.", "Heat a griddle pan to a high heat. Fold each slice of smoked salmon into three to make one thicker slice. Season with black pepper and drizzle on one side with a little olive oil.", "When the pan is very hot, place the salmon on it, oiled side down, and leave for about 15 seconds and then turn a quarter turn and cook for a further 15 seconds and then remove. Do not turn it over, only cook on one side.", "Sprinkle the rocket with the parmesan shavings and place the salmon, charred side up, on the top. Serve immediately."]}, {"isVegetarian": false, "title": "Chargrilled spiced salmon with sauce vierge and broccoli", "url": "www_bbc_co_uk_food_recipes_chargrilledspicedsal_92387", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp coriander seeds, crushed", "½ tsp cumin seeds, crushed", "salt and freshly ground black pepper", "100g/3½oz salmon fillet, skin removed", "1 tbsp olive oil", "1 tomato, skin and seeds removed, cut into small dice", "½ lemon, juice only", "½ lime, juice only", "salt and freshly ground black pepper", "½ tsp coriander seeds", "handful fresh basil leaves, torn", "handful cooked broccoli florets", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, combine the coriander and cumin seeds in a bowl with the salt and freshly ground black pepper. Press the salmon fillets into the mixture on both sides. ", "Heat the olive oil in  a griddle pan and cook the salmon for 5-7 minutes or until cooked through, turning it over halfway through. (NB The salmon is cooked when the flesh is opaque.)", "For the sauce vierge, heat all the ingredients gently in a pan for 1-2 minutes until warmed through.", "To serve, put the spiced salmon onto a plate with the broccoli florets alongside. Drizzle the sauce vierge around the outside of the plate and garnish with the chopped chives."]}, {"isVegetarian": false, "title": "Chargrilled squid", "url": "www_bbc_co_uk_food_recipes_chargrilledsquid_74747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ squid, cleaned", "drizzle of oil", "squeeze of lime juice", "pinch of chilli flakes", "85g/3oz cooked couscous (cooked weight)", "1 lemon, juice only", "salt and freshly ground black pepper", "handful of dill", "55g/2oz pine nuts, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut slits in the squid flesh to make a criss-cross pattern. Drizzle with oil and the lime juice and sprinkle with a pinch of chilli flakes. Leave to marinate for a few minutes (or longer if time allows).", "Heat a griddle pan until hot. Griddle the squid for 1-2 minutes on each side.", "Place the couscous in a bowl and stir in the lemon juice, seasoning, dill and pine nuts. ", "Spoon onto a serving plate and serve the squid on top."]}, {"isVegetarian": false, "title": "Chargrilled squid with chilli oil and salsa", "url": "www_bbc_co_uk_food_recipes_chargrilledsquidwith_75828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large tube of squid, skin scored ", "1 tbsp vegetable oil", "1 tbsp dried chilli flakes", "salt and freshly ground black pepper", "1 tbsp dried chilli flakes", "75g/2¾oz pineapple into chunky pieces", "1 lemon, juice only ", "1 lime, juice only ", "1 tbsp icing sugar", "15g/½oz Drunken Lady lettuce (substitute mixed salad leaves or seasonal leaves)", "15g/½oz Lazy Blonde lettuce (substitute mixed salad leaves or seasonal leaves)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the squid, cut it into three equal pieces.", "Place a griddle pan on a high heat.", "Coat the squid with oil and chilli flakes and season with salt and freshly ground black pepper.", "Place onto the hot griddle pan.  Turn off after one minute and take the squid off the heat.", "To make the salsa, combine the chilli, pineapple, lemon and lime juices and the icing sugar in a medium sized bowl.", "Garnish with the lettuce and place the squid on top."]}, {"isVegetarian": false, "title": "Chargrilled squid with sauce vierge", "url": "www_bbc_co_uk_food_recipes_chargrilledsquidwith_85077", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz squid, cleaned, scored to make a diamond pattern", "1 tbsp olive oil", "salt and freshly ground black pepper ", "100g/3½oz green olives, pits removed, chopped", "1 tomato, chopped", "1 garlic clove, chopped", "pinch chilli flakes", "1 tbsp capers, chopped", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chargrilled squid, rub the squid with the olive oil and season with salt and freshly ground black pepper. ", "Heat a griddle pan and cook the squid over a high heat for 1-2 minutes until lightly charred and cooked through.", "For the sauce vierge, place all of the sauce vierge ingredients into a small saucepan and warm through.", "To serve, place the chargrilled squid onto a plate with the sauce in a small bowl alongside."]}, {"isVegetarian": false, "title": "Chargrilled steak kebabs with tomato chutney", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakkeba_88675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rump steak, cut into large cubes", "salt and freshly ground black pepper", "2 tbsp olive oil", "25g/1oz butter", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, chopped", "1 tbsp red wine vinegar", "1 tsp caster sugar", "1 tbsp tomato purée", "1 beef tomato, seeds removed, chopped", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the steak kebabs, soak two wooden skewers in a bowl of water for about 20 minutes, so that they don't burn during cooking.", "Thread the steak chunks onto the skewers and season well with salt and freshly ground black pepper, then rub with oil. Heat a griddle pan until hot and sear the kebabs until golden-brown on all sides. Transfer to the oven and bake for 5-7 minutes, or until cooked to your liking.", "For the tomato chutney, heat the butter and oil in a pan and gently fry the onion and garlic for 4-5 minutes.", "Stir in the vinegar, sugar, tomato purée and chopped tomato and season, to taste, with salt and freshly ground black pepper. Simmer gently for 6-8 minutes, or until the tomato starts to break down. Stir in the chopped herbs. ", "Serve the kebabs on a plate with the tomato chutney in a bowl on the side for dipping."]}, {"isVegetarian": false, "title": "Chargrilled steak and chips with roasted mushrooms, onion and crisp parsley", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakandc_88816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "125g/4½oz rump steak", "salt and freshly ground black pepper", "½ large baking potato, peeled and cut into chips", "6 cloves garlic, in their skins, crushed", "3 tbsp olive oil", "1 tbsp olive oil", "125g/4½oz closed cup mushrooms, quartered", "½ onion, thickly sliced", "handful flatleaf parsley leaves", "1 tsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the steak, heat a griddle pan until smoking. Rub the oil over the steak and season well with salt and freshly ground black pepper. Fry for 3-4 minutes on each side (for rare), or until cooked to your liking, then remove from the pan and allow to rest on a warm plate.", "For the chips, parboil the potato in boiling water for 4-5 minutes, then drain and place on a baking sheet. Place the crushed garlic on the baking tray and drizzle over the oil, then bake in the oven for about 12-15 minutes, or until the chips are golden-brown and crisp.", "For the mushrooms and onion, heat the oil in an ovenproof frying pan and fry the mushrooms and onion for 3-4 minutes before transferring to the oven to roast for 4-5 minutes.", "For the crisp parsley, rub the parsley leaves with the oil and place on a cling film covered plate. Heat in the microwave on high for 30 seconds, then remove to cool. ", "To serve, pile the chips and garlic onto the serving plate with the steak. Spoon the roasted mushrooms and onions onto the plate, and garnish with the crisp parsley."]}, {"isVegetarian": false, "title": "Chargrilled steak skewers with carrot, coriander and mint salad", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakskew_90316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rump steak", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 carrot, peeled and sliced into ribbons with a peeler", "1 tbsp fresh chopped coriander", "1 tbsp fresh chopped mint", "1 tbsp fresh chopped basil", "½ tsp salt", "½ lime, juice only", "1 tbsp balsamic vinegar", "2 tbsp olive oil", "fresh coriander leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak three wooden skewers in a bowl of cold water for 10-12 minutes, then drain and set aside. ", "For the steak, cut the meat into strips and thread onto the skewers. Season with salt and freshly ground black pepper and drizzle with the oil. Heat a chargrill pan until smoking, then add the skewers and fry for 1-2 minutes on each side, or until browned all over and cooked to your liking.", "For the salad, combine the carrot and herbs in a bowl and add the rest of the ingredients. Toss well to coat, then transfer to a serving plate. ", "Serve the skewers on top of the salad, garnished with the coriander leaves."]}, {"isVegetarian": false, "title": "Char-grilled steak with roast parsnip, sauté potatoes and mayonnaise", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_78946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 parsnip, peeled and quartered", "1 tbsp olive oil", "salt and freshly ground black pepper", "100g/3½oz potato, cut into 1cm rounds and blanched", "1 tbsp olive oil", "1 tbsp rosemary, chopped", "100g/3½oz rump steak medallion", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 free-range egg yolk", "150ml/¼ pint vegetable oil", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200c/400F/Gas 6.", "For the parsnips, blanch in boiling water for one minute. Drain and transfer to a roasting tin, toss in olive oil and roast in the oven for ten minutes.", "For the potatoes, heat a griddle pan and coat the potatoes in the oil and rosemary. Place on the griddle and cook for two minutes on each side, or until cooked through.", "For the beef, heat a separate griddle pan. Rub the steak with the oil and the seasoning and place on the griddle. Cook for two minutes on each side, or until cooked to your liking. Remove from the heat and allow to rest.", "Meanwhile, for the mayonnaise, blend the egg yolk in a food processor and gradually add the oil and white wine vinegar.", "Once blended into mayonnaise, stir through the mustard and season to taste with salt and freshly ground black pepper.", "To serve, place the potatoes on a warm dish, top with the roast parsnips and then add the steak. Finish with a dollop of mayonnaise."]}, {"isVegetarian": false, "title": "Chargrilled steak with mushroom sauce", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_83609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sirloin steak", "1 tbsp olive oil", "25g/1oz unsalted butter, chopped", "1 tbsp olive oil", "¼ red onion, finely chopped", "1 clove garlic, finely chopped", "1 Portobello mushroom, sliced", "50ml/2fl oz red wine", "50ml/2fl oz hot beef stock", "1 tsp chopped fresh chervil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the steak, heat a griddle pan until smoking. Rub the steak with the oil then season both sides with salt and freshly ground black pepper. Add the steak to the hot griddle and chargrill for 3-4 minutes on each side, or until cooked to your liking. Remove form the heat to rest for 2-3 minutes.", "To make the sauce, melt the butter with the oil in a frying pan over a medium heat. Add the onions and garlic and cook until softened.", "Add the mushroom and sauté until cooked through.", "Add the red wine and beef stock and bring to the boil. Reduce the heat and simmer until the liquid has reduced and thickened, then add the chervil and stir.", "To serve, place the steak in the middle of a warm plate and spoon the sauce around."]}, {"isVegetarian": false, "title": "Chargrilled steak with sweet potato mash, peas and red wine sauce", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_84091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "½ onion, chopped", "½ sweet potato, peeled and chopped into small cubes", "1 tbsp chopped parsley", "1 tbsp chopped chives", "100ml/3½fl oz red wine vinegar", "2 tbsp butter", "1 tbsp honey", "110ml/4fl oz beef stock", "40g/1½oz peas", "140g/5oz rump steak", "oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mash, place the butter into a saucepan to melt. Add the onion and sweet potatoes. Cover and cook for ten minutes, or until softened. Add the parsley and chives and mash until smooth. Keep in a warm place. ", "For the sauce, place the vinegar, butter, honey, and beef stock into a saucepan. Once boiling reduce the heat to simmer, and let sauce thicken. After 5-6 minutes add the peas. ", "Season the steak, with sea salt and freshly ground black pepper. Heat a griddle pan on a high heat and add the steak and cook for 3-4 minutes on each side, or until cooked toyour liking.", "To serve, place the steak on a plate, add the mash and drizzle with the sauce."]}, {"isVegetarian": false, "title": "Chargrilled steak with mustard and peppercorn dressing, tempura shallots and green beans and a rosti", "url": "www_bbc_co_uk_food_recipes_chargrilledsteakwith_92435", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rump steak", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tsp wholegrain mustard", "1 tbsp chopped fresh chives", "1 tbsp green peppercorns, crushed", "3 tbsp olive oil", "1 tbsp water", "1 tsp caster sugar", "salt and freshly ground black pepper", "150g/5oz plain flour", "200ml/7fl oz fizzy water", "vegetable oil, for deep frying", "1 shallot, peeled, cut into thick rings", "1 handful green beans, trimmed", "½ baking potato, peeled, grated", "1 tbsp olive oil", "1 tbsp butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the steak, season the steak with salt and freshly ground black pepper. Heat a griddle pan until hot, brush the steak with the olive oil and fry on the griddle for 3-4 minutes on both sides (for medium), or until cooked to your liking. Remove from the pan and leave to rest on a warm plate covered with foil.", "For the dressing, whisk all of the dressing ingredients together in a bowl and set aside.", "For the tempura, mix the flour with enough water in a bowl to make a batter with the consistency of single cream. ", "Half-fill a deep, heavy-based pan with the oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Dip the shallot rings and beans into the batter before deep-frying in the oil for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "For the rösti, place the grated potato into a clean tea towel and wring out any excess moisture. Heat the olive oil and butter together in a small frying pan and pack the grated potato into the pan. Season well with salt and freshly ground black pepper and fry over a medium-low heat for 5-7 minutes on both sides, or until golden-brown and cooked through.", "To serve, place the tempura shallots and green beans alongside the steak. Place the rösti next to the steak, then drizzle over the mustard and peppercorn dressing."]}]