[{"isVegetarian": true, "title": "Lazybones buns (Luilakbollen)", "url": "www_bbc_co_uk_food_recipes_lazybones_buns_47431", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾ oz caster sugar", "50g/1¾ oz butter, cut into cubes", "150ml/¼ pt milk", "1 x 7g sachet of fast-action dried yeast", "375g/13oz strong white flour, plus extra for dusting", "½ tsp fine sea salt", "1 tsp ground cinnamon", "1 lemon, zest finely grated", "1 large egg, beaten", "125g/5oz raisins or 100g/4oz raisins and 25g/1oz currants", "sunflower oil, for greasing", "butter and syrup or honey, to serve"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the sugar, butter and milk in a small saucepan and heat very gently for a few seconds until just warm. Take care that the milk doesn’t get too hot or the yeast won’t work. ", "Pour the milk mixture into a heatproof bowl and stir in the yeast. Leave for 10 minutes or until a light foam forms on the surface.", "Mix the flour, salt, cinnamon and lemon zest in a large bowl and make a well in the centre.", "Whisk the egg into the warm milk mixture, then pour it all on to the flour. Stir with a wooden spoon until the mixture forms a ball. ", "Turn the mixture out on to a very lightly floured surface and knead for 5 minutes to make a smooth, pliable dough. ", "Knead the fruit into the dough for a couple of minutes until it is evenly distributed. ", "Place the dough in a lightly oiled bowl and cover with oiled clingfilm. Leave to rise in a warm place for 1½ hours, or until it has doubled in size and is spongy to touch.", "Return the dough to the work surface and knock it back with your knuckles. Knead lightly, then divide the dough into 8 portions. Roll each of these into a ball, then pull the dough from around the sides and tuck it underneath the bun to give it a neat shape.", "Place the buns on a large baking tray lined with baking parchment and flatten them slightly.  If your tray isn’t large enough to take all of the buns at once, bake them in a couple of batches.", "Cover with oiled clingfilm and leave to prove for a further 45 minutes.", "Preheat the oven to 190°C/375F/Gas 5. Remove the clingfilm and bake the buns in the centre of the oven for about 20 minutes until risen and golden brown. ", "Serve warm the day they’re made – great spread with butter and drizzled with syrup or honey."]}, {"isVegetarian": true, "title": "Leafy salad with feta and pomegranate", "url": "www_bbc_co_uk_food_recipes_leafysaladwithfetaan_83561", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leafysaladwithfetaan_83561_16x9.jpg", "ingredients": ["200g/7oz feta", "splash lemon juice", "1-2 garlic cloves, crushed", "100g/3½oz flaked almonds, toasted", "120g bag mixed rocket, spinach and watercress", "3 tbsp olive oil", "salt and freshly ground black pepper", "2 pomegranates, seeds only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the feta in a shallow dish, squeeze over the lemon juice and scatter over the garlic. Leave to marinate while you prepare the rest of the salad.", "Toast the almonds under a medium grill until lightly browned, then leave to cool. Cut the pomegranate in half and pop the seeds out into a bowl by bashing the skin with a spoon.", "Toss together the rocket, spinach and watercress in a large salad bowl with the olive oil, and salt and freshly ground pepper. Crumble in the marinated feta, and scatter the pomegranate seeds and toasted almonds over. Serve immediately."]}, {"isVegetarian": false, "title": "Lean pork stir fry", "url": "www_bbc_co_uk_food_recipes_leanporkstirfry_83698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz medium ready-made egg noodles", "250g/10½oz lean pork, cut into cubes", "1 tbsp olive oil ", "1 red onion, peeled and sliced ", "½ green pepper, core and seeds removed, sliced ", "2 garlic cloves, peeled and crushed ", "½ mango, peeled, stone removed and chopped ", "1 tsp freshly grated ginger ", "squeeze lime juice ", "splash water ", "1 tsp soy sauce", "1 vegetable stock cube ", "1 tsp sesame oil ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Cook the egg noodles according to packet instructions and drain. ", "Place the pork pieces onto a baking sheet and place under a heated grill. Grill for about 10 minutes, turning occasionally to brown all over, until cooked through.", "Heat the olive oil in a wok over a high heat. Add the onion and stir-fry for a few minutes to soften.", "Add the green pepper, garlic, mango and ginger to the wok and stir-fry for a few minutes.  ", "Add the lime juice, splash of water and soy sauce. Stir well and crumble in the stock cube. 7. Add the sesame oil and salt and freshly ground black pepper and continue to heat for a few minutes. ", "Add the cooked noodles to the pan and cook for 1-2 minutes, or until heated through. ", "Add the cooked pork pieces to the pan, stir again, then transfer the noodles to a large bowl and serve hot."]}, {"isVegetarian": false, "title": "Lebanese-spiced lamb flatbread", "url": "www_bbc_co_uk_food_recipes_lebanese-spiced_lamb_56436", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lebanese-spiced_lamb_56436_16x9.jpg", "ingredients": ["400g/14oz type ‘00’ flour, plus extra for dusting", "100g/3½oz semolina flour", "½ tsp salt", "1½ tsp caster sugar", "7g sachet fast-action yeast", "325ml/11fl oz warm water", "1 tbsp vegetable oil", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 tsp ground coriander", "1 tsp ground cumin", "1 tbsp ground baharat spice mix", "500g/1lb 2oz lamb mince", "75g/2½oz sultanas", "300ml/10½fl oz chicken stock", "250ml/9fl oz plain yoghurt", "2 green chillies, finely chopped", "salt and freshly ground black pepper", "4 fresh mint sprigs, leaves only", "16 coriander sprigs, leaves only"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the dough, the day before you want to eat the flatbreads, mix the flours, salt and sugar in a large bowl. ", "In a jug, mix the yeast to a paste with a little of the water, then stir in the remaining water until the yeast has completely dissolved.", "Make a well in the centre of the flour mixture and pour in the yeasted water, gradually bringing more and more of the flour into the wet mixture, until all of the flour has been incorporated and the mixture has come together as a soft dough.", "Turn out the dough onto a lightly floured work surface and knead well until smooth and elastic.", "Divide the dough into four equally sized pieces and roll each into a ball. Place the dough balls onto a lightly greased baking tray, cover with a loose sheet of cling film or a clean tea towel, and leave to prove in the fridge for 24 hours.", "When the dough has proved (doubled in size), make the topping. ", "For the topping, heat the oil in a frying pan over a medium heat. Add the shallot, garlic and spices and fry for 1-2 minutes, or until softened.", "Add the lamb mince and increase the heat to high. Fry for 4-5 minutes, breaking up the mince with a spoon and stirring frequently, until browned all over.", "Add the sultanas and chicken stock to the pan and bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 18-20 minutes, or until the lamb is tender and the liquid has almost all evaporated. Season, to taste, with salt and freshly ground black pepper, then remove the pan from the heat and set aside to cool completely.", "Preheat the oven to its highest setting. Place a heavy baking tray or pizza stone in the oven and allow to heat up.", "Roll each piece of dough out onto a lightly floured work surface into an oval roughly 20x15cm/8x6in, and about 0.5cm/¼in thick.", "Spread the lamb mixture onto the dough bases, then top with dollops of the yoghurt. Sprinkle over the chopped chillies and season, to taste, with salt and freshly ground black pepper.", "Transfer the flatbreads, in batches if necessary, to the baking tray or pizza stone and cook for 5-10 minutes, or until the bases are golden-brown and crisp. Remove from the ove and sprinkle over the herbs. Serve immediately."]}, {"isVegetarian": true, "title": "Leek and brioche bake", "url": "www_bbc_co_uk_food_recipes_leek_and_brioche_bake_21766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz butter", "500g/1lb 2oz leeks, sliced and washed", "3 sprigs fresh thyme, leaves picked", "150ml/5fl oz white wine", "200ml/7fl oz double cream", "75g/2¾oz brioche loaf, cut into 1cm/½in cubes", "50g/1¾oz Gruyère, finely grated", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat 50g/1¾oz of the butter in a frying pan and fry the leeks and thyme for 2-3 minutes, or until softened.", "Add the wine and cook until the volume of the liquid has reduced by two-thirds. Add the cream and reduce again by half. Season with salt and pepper and pour into an ovenproof dish.", "Heat a separate frying pan until hot. Add the remaining butter and the brioche. Cook until golden-brown on all sides. Season with salt and pepper and scatter over the top of the leeks.", "Sprinkle the cheese on top of the dish and cook in the oven for 20-30 minutes, or until golden-brown and bubbling."]}, {"isVegetarian": true, "title": "Leek and egg salad, mushrooms and crusty bread", "url": "www_bbc_co_uk_food_recipes_leek_and_egg_salad_14872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 eggs  ", "500g/1lb 2oz leeks, washed ", "5 tbsp olive oil ", "250g/9oz mushrooms (such as white closed cap), wiped clean and sliced ", "salt and pepper ", "1 garlic clove, finely chopped ", "1 tbsp white wine vinegar", "1 tsp mustard ", "1 small baguette (labelled ‘baton’ in shops), cut into slices "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the eggs into a pan of boiling water. Boil for eight minutes exactly, then drain and cool under cold running water. Peel the eggs and set them aside.", "Trim the very tops off the leeks and then cut two-thirds of the way down. Discard any of the coarse outer leaves of the upper two-thirds, cut in half lengthways and horizontally and separate the inner green stems into strips.", "Cut the lower white part of the leek into rounds. Steam the white round and green strips in a steamer placed over salted boiling water for four minutes, or until tender.", "Run the leeks under cold water to cool. Squeeze them out if they are at all watery.", "Meanwhile, heat a small frying pan and add a tablespoon of the oil. Once hot, add the sliced mushrooms to the pan with a pinch of salt. Cook over a medium heat for 4-5 minutes, or until tender and lightly golden-brown. Add the garlic and fry for another minute.", "Whisk the remaining olive oil together with the vinegar and mustard in a small bowl to make a dressing. Taste and season as necessary. Cut the peeled eggs into wedges. Put the cooled leeks in a bowl and top them with the eggs. Season with salt and pepper", "Dress the egg and leek with the dressing. Taste and adjust the seasoning if needed. Serve with the mushrooms and baguette."]}, {"isVegetarian": true, "title": "Leek and Stilton quiche", "url": "www_bbc_co_uk_food_recipes_leek_and_stilton_quiche_08524", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_and_stilton_quiche_08524_16x9.jpg", "ingredients": ["225g/8oz plain flour", "125g/4½oz butter", "1 free-range egg", "1 tbsp water", "1 tbsp olive oil", "2 leeks, thinly sliced", "2 sticks celery, thinly sliced", "4 free-range eggs", "450ml/16fl oz double cream", "150g/5½oz Stilton cheese, coarsely grated", "2 tbsp chopped parsley", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180 Fan/Gas 6.  ", "To make the pastry, measure the flour and butter into a food processor and blend until the mixture resembles breadcrumbs. Add the egg and water and blend again until it forms a smooth dough ball. Roll on a lightly floured work surface and use the pastry to line a 28cm/11in loose-bottomed, deep quiche tin. Form a little lip around the top and prick the base with a fork. Place in the fridge for 15 minutes.", "Line with baking paper and baking beans and bake for 15 minutes. Remove the beans and paper and return to the oven for a further 5–10 minutes, or until just cooked and pale golden-brown. Reduce the oven temperature to 180C/160 Fan/Gas 4.", "To make the filling, heat the oil in a wide-based frying pan, add leeks and celery and fry over a high heat for few minutes.  ", "Lower the heat, cover and simmer for about 25 minutes, or until the vegetables are completely tender. Remove the lid, increase the heat and fry for a minute to cook off any excess water.    ", "Beat the eggs and cream together in a jug and season with salt and pepper.", "Spoon the soft leeks and celery into the pastry case, scatter with cheese and parsley and season with salt and pepper. Pour over the cream.  ", "Bake for about 35–40 minutes, or until golden-brown and just set on top. Leave to sit for about 5–10 minutes before turning out."]}, {"isVegetarian": true, "title": "Leek soup", "url": "www_bbc_co_uk_food_recipes_leek_soup_66968", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_soup_66968_16x9.jpg", "ingredients": ["1 carrot, grated", "1 onion, grated", "2 sticks celery, grated", "2 garlic cloves, roughly chopped", "salt and pepper", "stalks from a small bunch of parsley", "olive oil", "1 onion, finely chopped", "200g/7oz floury potatoes, peeled and chopped into cubes", "350g/12oz celeriac, peeled and chopped", "1 sprig thyme, leaves only", "4 leeks, finely sliced", "sea salt and freshly ground black pepper", "1 small bunch chives, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the stock, put the grated carrot, onion, celery and garlic into a large heatproof bowl. Add a pinch of salt and pepper and pour over 1 litre/1¾ pints of boiling water. Set aside to steep for 10-15 minutes while you prepare the soup.", "Heat a large heavy-based saucepan or casserole dish over a medium heat. Add a dash of oil and, once hot, add the onion, potatoes, celeriac and thyme leaves. Cook over a medium heat for 10 minutes, or until the vegetables have softened.", "Strain the stock through a sieve into the pan of celeriac. Simmer gently for 10-15 minutes until the celeriac is nearly tender. ", "Add the leeks, cover the pan and cook for a further 5-7 minutes, or until the leeks are wilted and tender but still bright green.", "Remove from the heat and blend in batches until really smooth. (Blend for a minute or longer for a really velvety texture.) The soup can be stored in the fridge or frozen at this stage.", "Transfer the blended soup to a clean pan. Reheat the soup if necessary, taste and season with salt and pepper to taste.To serve, spoon into bowls and garnish with chopped chives. "]}, {"isVegetarian": true, "title": "Leek and caper soup", "url": "www_bbc_co_uk_food_recipes_leekandcapersoup_85786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 leek, finely sliced", "1 garlic clove, finely chopped", "100ml/3½fl oz white wine", "150ml/¼ pint hot chicken stock (vegetarians can substitute vegetable stock)", "75ml/2½fl oz double cream", "1 tbsp capers, rinsed and drained", "salt and freshly ground black pepper ", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan over a medium heat, add the leek and sauté until softened. Add the garlic and fry for one minute.", "Add the white wine, turn up the heat and simmer for 2-3 minutes.", "Add the stock, double cream and capers and simmer for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper.", "To serve, pour the soup into a serving bowl and garnish with chopped chives."]}, {"isVegetarian": true, "title": "Leek and potato strudel", "url": "www_bbc_co_uk_food_recipes_leek_and_potato_strudel_70345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp vegetable oil, plus extra for greasing ", "285g/10¼oz plain flour, plus extra for dusting", "pinch salt", "½ tsp hot, smoked paprika", "1 medium free-range egg", "100g/3½oz butter", "450g/1lb potatoes, peeled and diced", "olive oil for frying", "1 medium onion, finely chopped", "3 leeks, washed and finely chopped", "¾ tsp ground turmeric", "1 large chilli, finely chopped ", "1 tsp harissa ", "50g/1¾oz whole pistachios", "75ml/5 tbsp whipping or double cream ", "100g/3½oz Gruyère, grated", "50g/1¾oz breadcrumbs (approximately two slices of bread) ", "1½ tsp sea salt", "freshly ground black pepper", "1 tsp hot, smoked paprika", "1 tbsp nigella seeds (available from large supermarkets)", "large handful fresh coriander ", "75ml/2½fl oz olive oil ", "100g/3½oz cherry tomatoes on the vine", "large handful fresh rocket ", "1 radicchio head, trimmed"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the filo pastry, lightly oil a large bowl.  Sift the flour, paprika and salt into a clean bowl and make a well in the centre. Add the egg and oil then gradually stir in 150ml/5fl oz water, or enough to make a soft dough.", "Lightly flour the work surface, turn out the dough and knead for 15 minutes (this dough is best kneaded by pulling it up from the counter and throwing it down - don’t leave it in contact with the counter for too long or it will stick). The dough is ready when it loses its stickiness and is elastic enough to be stretched by approximately 50cm. Place the dough in the oiled bowl, cover with cling film and leave to relax for an hour.", "For the leek and potato filling, steam the diced potatoes for approximately five minutes, or until they are cooked through but still hold their shape. Remove from the heat and set aside to cool. ", "In a frying pan, cook the onions and leeks in a little olive oil until they are soft and the onions are translucent. Add the turmeric, chilli, harissa, potatoes, pistachios and cream to the pan. Remove from the heat, stir in the cheese and breadcrumbs, then season to taste with salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6, line a baking tray with parchment paper and cover the work surface with a table cloth generously dusted with flour. ", "Melt the butter and use a rolling pin to roll out the dough to a thickness of 1cm/½in. Stretch the dough by hand taking care not to tear it, pull the dough gently by running your hands under the dough from the centre outwards. The finished dough should be very thin, transparent enough to read through and at least 50cm wide.", "Trim the dough edges with scissors to make a neat rectangle then scatter the dough liberally with melted butter from a flicked pastry brush.", "Place the cooled filling at one of the narrow ends of the pastry and, using the table cloth to help, gently roll up the strudel. Fold the pastry edges under the strudel and place on the lined baking tray. Curve into a horseshoe shape if it is too big for the tray.", "Sprinkle with melted butter and scatter over the paprika and nigella seeds. Bake on the top shelf of the oven for 30-40 minutes or until golden brown.", "To serve, blend the coriander with 50ml warmed olive oil in a food processor. Transfer the strudel to a serving plate. Place the cherry tomatoes on a baking tray and brush with oil. Use a blowtorch to char the tomato skin then arrange around the strudel with the rocket, radicchio and coriander oil blend. "]}, {"isVegetarian": true, "title": "Lebanese rice pudding", "url": "www_bbc_co_uk_food_recipes_lebanese_rice_pudding_16994", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lebanese_rice_pudding_16994_16x9.jpg", "ingredients": ["150g/5½oz pudding rice", "250ml/9fl oz double cream", "250ml/9fl oz full-fat milk ", "2 tbsp golden caster sugar", "1 vanilla pod, split", "16 dried apricots", "1 cinnamon stick", "½ unwaxed lemon", "2 tsp rosewater", "2 tsp orange blossom water", "50g/1¾oz shelled pistachios, roughly chopped", "2 tbsp food-grade rose petals"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the rice in a medium-sized, heavy-based pan, then pour in the cream, milk and sugar and add the vanilla pod.", "Bring to the boil over a medium heat, then reduce the heat until the milk is bubbling gently. Allow to simmer for 25 minutes, or until tender, giving it the occasional stir.", "Fill another pan with 300ml/10fl oz water, add the dried apricots, cinnamon stick and the lemon half. Bring to the boil and simmer for 10 minutes.", "When the rice is soft, remove the vanilla pod and stir in the rosewater and orange blossom water. ", "Divide the rice pudding between four bowls. Spoon four apricots into each bowl with a little of the juice from the pan. Scatter over the pistachios and a few rose petals and serve. "]}, {"isVegetarian": true, "title": "Leek and asparagus soup", "url": "www_bbc_co_uk_food_recipes_leekandasparagussoup_80982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, cleaned and finely chopped", "4 asparagus spears, chopped", "150ml/5fl oz vegetable stock ", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan over a medium heat. Add the leek and asparagus and sauté for 2-3 minutes, to soften.", "Add the vegetable stock, bring to the boil, then reduce the heat to simmer gently for 8-10 minutes, until the asparagus is cooked through.", "Transfer to a food processor, add the cream and blend until smooth.", "Return the soup to the pan, season, to taste, with salt and freshly ground black pepper and warm through gently.", "To serve, pour into a soup bowl with the crusty bread placed on a plate alongside."]}, {"isVegetarian": false, "title": "Leek and lamb koftas", "url": "www_bbc_co_uk_food_recipes_leekandlambkoftas_77205", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/8¾oz lamb mince", "½ leek, chopped", "handful breadcrumbs", "½ tsp paprika", "½ tsp chilli flakes", "½ tsp ginger", "1 free-range egg yolk", "1 tbsp oil", "herb salad, to serve"], "serves": "Makes 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Mix together all of the ingredients thoroughly and mould around three skewers.", "Heat the oil in a frying pan and cook the lamb skewers for 1-2 minutes to seal on all sides.", "Place into the oven for ten minutes, until golden and cooked through.", "Serve with a herb salad."]}, {"isVegetarian": false, "title": "Leek and lamb pie with buttered new potatoes and carrots", "url": "www_bbc_co_uk_food_recipes_leekandlambpiewithbu_85341", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "½ tsp salt ", "1 tbsp icing sugar ", "1 free-range egg, beaten ", "200ml/7fl oz water ", "75g/3oz butter, chopped", "75g/3oz lard, chopped", "25g/1oz butter", "1kg/2lb 2oz leeks, thinly sliced", "2 fresh thyme sprigs, leaves only", "450g/1lb boneless leg of lamb, cut into chunks", "2 tbsp chopped fresh flatleaf parsley", "2 tbsp chopped fresh mint", "salt and freshly ground black pepper", "1 free-range egg, beaten ", "new potatoes, cooked ", "chantenay carrots, cooked"], "serves": "8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 225C/440F/Gas 8.", "Place a heavy baking tray into the oven to preheat.", "Mix the flour, salt and icing sugar in a large bowl. Make a well in the middle of the dry ingredients and pour the egg into it. Scoop a liberal amount of flour over to cover the egg. ", "Place the water, butter and lard into a saucepan over a low heat and bring slowly to the boil.", "Gradually pour the boiling liquid into the flour mixture, stirring with a knife constantly to combine, then knead on a clean, floured surface until the egg is completely combined and the pastry is smooth. (NB: use the pastry immediately to make your pie because when the pastry cools it will harden and become unmanageable.)", "Cut off one third of the pastry and set this aside for the lid. Roll out the remaining pastry into a flat round shape large enough to line the base and sides of a 25cm/10in loose-bottomed cake tin, allowing an overhang of pastry of about 2cm/1in.", "Roll out the pastry set aside for the lid to fit the top of the pie and set aside.", "For the filling, heat a frying pan until hot, then add the butter, leeks and thyme and gently fry for 5-8 minutes, or until the leeks are tender. Set aside and allow to cool slightly.", "Place the lamb into a food processor along with the parsley and mint leaves and pulse to chop finely. Season well with salt and freshly ground black pepper.", "Spread the lamb mixture into the pastry case in a thick layer and then spread the leeks over the top.", "Brush the edges of the pastry with a little beaten egg. Place the pastry lid on top of the filling and pinch and crimp the edges of the case and lid together to seal.", "Trim away any excess pastry from the pie with a sharp knife and use the pastry trimmings to make decorative leaves for the top of the pie.", "Brush the top of the pie with beaten egg and make a hole in the centre to allow the steam to escape. Arrange the pastry leaves on top and brush these with the beaten egg.", "Place in the oven to cook for 15 minutes, then reduce the oven temperature to 180C/355F/Gas 4 and continue to bake for one hour. Remove from the oven and allow to cool for five minutes before serving.", "To serve, cut out a wedge of pie and place onto a plate accompanied by buttered new potatoes and chantenay carrots."]}, {"isVegetarian": true, "title": "Leek and mushroom risotto", "url": "www_bbc_co_uk_food_recipes_leekandmushroomrisot_84317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, finely chopped", "1 leek ,(white only) ,chopped", "50g/1¾oz chestnut mushrooms, chopped", "100g/3½oz risotto rice", "50ml/2fl oz white wine", "300ml/10fl oz hot chicken stock (vegetarians may substitute vegetable stock)", "50g/1¾oz Dolcelatte", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a saucepan over a medium heat.", "Add the onion, garlic, leek and mushroom and fry for two minutes, or until soft.", "Add the rice and wine and bring to the boil. Turn down the heat slightly and simmer until the wine is completely absorbed.", "Add the stock and simmer for 12 minutes, or until the stock is absorbed and the rice is completely cooked through.", "Add the Dolcelatte and stir with a spoon until melted. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon onto a serving plate."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_14556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 leeks ", "340g/¾lb potatoes ", "1 onion, chopped ", "1 garlic clove, thinly sliced ", "30g/1oz butter ", "570ml/1 pint water ", "1 bay leaf ", "1 sprig of thyme ", "salt and freshly ground black pepper ", "100ml/3½fl oz milk", "100ml/3½fl oz double cream ", "2 tbsp fresh chives, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim and slice the leeks in thin rounds. Rinse in a colander under cold water. ", "Peel the potatoes and cut into chunks. ", "Melt the butter in a pan and gently sauté the onion and garlic. ", "Add the leek, potatoes, bay leaf and thyme. Season. ", "Cover with the water and bring to the boil. ", "Simmer for 12 minutes until the potatoes and leeks are tender. ", "Remove the bay leaf. ", "Just before serving add the milk and cream and stir over a low heat, check the seasoning. ", "Serve in bowls and sprinkle with the chives."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_1920", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leekandpotatosoup_1920_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "1 onion, sliced", "225g/8oz potatoes, cubed", "2 medium leeks,sliced", "1.2 litres/2 pints vegetable stock", "150ml/5fl oz double cream or crème fraîche", "salt and freshly ground black pepper"], "serves": "4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan and add the onions, potatoes and leeks. Cook for 3-4 minutes until starting to soften.", "Add the vegetable stock and bring to the boil. Season well and simmer until the vegetables are tender.", "Whizz with a hand blender or in a blender until smooth. Reheat in a clean pan, stir in the cream or crème fraîche, heat through and serve."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_75793", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ potato, diced", "¼ leek, sliced", "1 tbsp butter", "150ml/5fl oz milk", "150ml/5fl oz double cream", "handful of fresh chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients, except the chives into a saucepan and cook for 15 minutes or until cooked through. ", "Add the chives and serve."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_79045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ potato, peeled and diced", "1 garlic clove, peeled and diced", "1 leek, diced", "55ml/2fl oz white wine", "150ml/5fl oz vegetable stock", "55ml/2fl oz double cream ", "salt and freshly ground black pepper", "1 slice of bread", "35g/1½oz blue cheese"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and fry the potato and garlic for 3-4 minutes, to soften. ", "Add the leeks and cook for a further few minutes.", "Stir in the wine with the stock and cream then reduce the heat and simmer gently for 10-12 minutes, or until the potatoes are tender.", "Using a hand blender, blend the soup until smooth and season to taste. ", "To serve, toast the bread on one side, under a hot grill, until golden. Turn over and lay the blue cheese on top. Return to the grill and cook until melted and golden.", "Serve the cheese toast on top of the soup."]}, {"isVegetarian": true, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_85731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ leek, finely chopped", "1 garlic clove, finely chopped", "sprig fresh thyme, leaves only", "½ vegetable stock cube, crumbled", "150ml/¼ pint milk", "1 small potato, peeled and chopped", "1 tbsp double cream", "salt and freshly ground black pepper", "1 tbsp chopped fresh chives, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small pan, add the leek and sauté for 3-4 minutes, until softened. Add the garlic and thyme and fry for a further minute.", "Add the half stock cube, the milk and potato. Bring to the boil, reduce the heat and simmer for 6-8 minutes, or until the potato is tender.", "Stir in the cream, season, to taste, with salt and freshly ground black pepper and allow to cool slightly.", "Pour the soup into a food processor and blend until smooth. If necessary, gently reheat the soup before serving.", "To serve, pour the soup into a bowl or cappuccino cup and sprinkle with chives."]}, {"isVegetarian": false, "title": "Leek and potato soup", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoup_85929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz unsalted butter", "½ onion, finely sliced", "1 garlic clove, chopped ", "1 leek, trimmed and chopped ", "1 potato, peeled and chopped", "150ml/4½fl oz hot vegetable stock", "50g/2oz bacon lardons, or chopped smoked bacon ", "1 garlic clove, chopped", "1 tsp smoked paprika", "salt and freshly ground black pepper", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the leek and potato soup, heat the butter in a pan and sauté the onion, garlic and leek until softened.", "Add the potato and stock and bring to the boil. Reduce the heat and simmer for ten minutes, or until the potato is tender. Remove from the heat and allow to cool slightly.", "Pour the soup into a blender and blend until smooth.", "For the spicy pork fat, heat the pork fat in a pan with the garlic and paprika. Season with salt and freshly ground black pepper and fry gently until the fat has rendered and the texture is crisp. Remove the fat pieces with a slotted spoon and drain on kitchen paper.", "To serve, pour the soup into a bowl, top with the spicy pork fat and garnish with chervil."]}, {"isVegetarian": false, "title": "Leek and potato soup with poached oysters", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoupwit_81984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chickens, cut into portions ", "1 leek, roughly chopped", "1 celery stick, roughly chopped", "1 onion, roughly chopped", "1 head of garlic, cut in half crossways", "sprig of thyme", "1 bay leaf", "25g/1oz butter", "1 tbsp olive oil", "1 small onion, finely chopped", "4 large leeks, finely sliced", "2 large potatoes, peeled and cut into cubes", "1 bouquet garni", "8 small rock oysters ", "250ml/9fl oz fish stock", "snipped chives, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["First make the chicken stock. Place the chickens, chopped vegetables, garlic and herbs in a large pan. Cover with cold water and bring to the boil. Skim off any fat that rises to the surface, then leave to simmer for 1½-2 hours. ", "Strain the stock through a colander set in a bowl, then pass through a sieve. You need 700ml/1¼ pints of stock for the soup; keep the remainder for another use. ", "Remove the 'oysters' (the small oyster-shaped piece of meat above the thigh) from the chicken back portions and leave to one side for use later as a garnish. Discard all the remaining contents of the colander.", "For the soup, melt the butter with the olive oil in a saucepan. Add the onion and slowly cook without colouring. After a couple of minutes add the leeks, then cover and sweat for about five minutes over a low heat. Do not allow the vegetables to colour.", "Add the potatoes and bouquet garni and cook uncovered for two minutes, then pour in the hot stock. Bring to the boil and cook until the potatoes are soft.", "Remove the bouquet garni, then carefully blitz the soup in a food processor or blender. Pour into a bowl and set over ice to cool. Chill in the fridge until ready to serve.", "Remove the rock oysters from their shells and lightly poach in the fish stock. Drain and allow to cool. ", "To serve, place the sea oysters and chicken 'oysters' in large soup bowls and ladle the soup on top. Finish with a sprinkling of chives."]}, {"isVegetarian": false, "title": "Leek and potato soup with crisp ox tongue and poached egg", "url": "www_bbc_co_uk_food_recipes_leekandpotatosoupwit_93783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, peeled, diced", "1 carrot, peeled, diced", "4 stalks celery, diced", "2 leeks, diced", "1 bunch fresh parsley, stalks only", "1 head garlic, broken into cloves", "1 bouquet garni", "2kg/4lb 6½oz ox tongue", "1 tsp vegetable oil", "150g/5¼oz unsalted butter", "2 onions, peeled, finely sliced", "4 leeks, finely sliced", "3 medium potatoes, peeled, finely sliced", "4 free-range eggs, poached", "100g/3½oz leeks, white part only, finely sliced", "knob of butter", "100g/3½oz potato, peeled, cut into 2cm/1in cubes, boiled until tender, drained"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ox tongue, place the vegetables, parsley stalks, garlic and bouquet garni into a large saucepan. Cover with water and bring to the boil. ", "Add the ox tongue, reduce the heat and simmer for 4 hours, or until the meat is very tender.", "Carefully remove the tongue from the pan. Remove the skin and any glands or excess fat and gristle. Set aside to rest in the fridge for at least 30 minutes, then, cut the tongue into cubes.", "Heat a frying pan until hot, add the tongue cubes and fry until golden-brown and crisp on all sides.", "Meanwhile, for the leek and potato soup, melt the butter in a saucepan over a gentle heat, until foaming. Fry the onions for 4-5 minutes, or until softened. ", "Add the leeks and fry for a further 2-3 minutes. Stir in the potatoes and cover with 1 litre/1pint 15¼fl oz water. Bring the mixture to the boil and cook for 10-15 minutes, or until the potatoes are tender.", "Remove the pan from the heat and blend the mixture in a blender until smooth. Season, to taste, with salt and freshly ground black pepper.", "To serve,  heat the butter in a frying pan and fry the leeks  for 4-5 minutes, or until softened. Season, to taste with salt and freshly ground black pepper.", "Spoon some fried leeks and cooked potato into each of 4 serving bowls and top with a poached egg. Ladle the soup around the egg and top with the crisp ox tongue."]}, {"isVegetarian": true, "title": "Leek and smoked cheese pancakes", "url": "www_bbc_co_uk_food_recipes_leekandsmokedcheesep_91738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, sifted, plus extra for dredging", "pinch salt", "4 free-range eggs", "400ml/14fl oz milk", "150ml/5½fl oz water", "100g/3½oz butter, melted", "vegetable oil, for frying", "2 free-range eggs, beaten ", "125g/4½oz polenta (cornmeal)", "50g/2oz butter", "250g/9oz leeks, sliced into rounds ", "150g/5½oz smoked cheese, grated", "1 tbsp chopped fresh thyme", "1 tbsp chopped fresh sage", "100g/3½oz frozen peas", "100g/3½oz ricotta ", "1 red onion, peeled, chopped ", "1 cucumber, chopped", "12 cherry tomatoes, chopped", "200ml/7fl oz tomato passata ", "1 red chilli, finely chopped ", "50ml/2fl oz sherry vinegar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, sift the flour and salt into a large bowl and make a well in the centre. Break the eggs into the well, then gradually mix the eggs into the flour with a fork. Gradually add the milk and water to the mixture, whisking continuously, until the mixture is smooth and has the texture of double cream. Finally, whisk in the butter. ", "Heat a drizzle of the oil in a 18cm/7in non-stick frying pan over a high heat until smoking, then turn the heat down to medium. Spoon in about two tablespoons of the pancake batter into the pan, swirling it around to evenly coat the bottom of the pan.", "Cook for about 30 seconds, then flip the pancake over and cook for a further 15-20 seconds, or until cooked through. Place the pancake onto a plate lined with greaseproof paper, then place another layer of greaseproof paper on top. Repeat the cooking process with the remaining pancake batter, adding more oil to the pan if necessary, and making sure each pancake sits between two layers of greaseproof paper to prevent them from sticking to each other. Set aside. ", "Preheat the oven to 180C/350F/Gas 4.", "For the filling, melt the butter in a pan until foaming, then gently fry the leeks for 4-5 minutes, or until softened. Drain well, then place into a bowl. ", "Add the smoked cheese, thyme, sage, peas and ricotta to the bowl of leeks and mix together until well combined. ", "Spread about three tablespoons of the filling over one pancake. Roll up the bottom, then the two sides; roll the pancake upwards to form a cylindrical shape like a spring roll. Repeat with the remaining filling and pancakes.", "Dredge each pancake roll in flour, then dip into the beaten egg and roll in the polenta to coat. ", "Heat a drizzle of oil in a frying pan and fry the pancake rolls for 3-4 minutes on each side, or until golden-brown all over. Place the pancakes into the oven to cook for 10-12 minutes, or until heated through. Set aside.", "For the salsa, mix together all of the salsa ingredients in a bowl. ", "To serve, arrange the pancake rolls on serving plates with the salsa in small bowls alongside for dipping."]}, {"isVegetarian": false, "title": "Leek and smoked salmon tart with salad", "url": "www_bbc_co_uk_food_recipes_leekandsmokedsalmont_89896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz ready-made shortcrust pastry", "50g/2oz butter", "750g/1lb 10½oz trimmed leeks, finely sliced", "5 sprigs fresh thyme, leaves only", "200ml/7fl oz double cream", "1 free-range egg", "1 free-range egg yolk", "salt and freshly ground black pepper", "200g/7oz smoked salmon", "75g/3oz gruyère cheese, grated", "1 tbsp wholegrain mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "2 Little Gem lettuces, leaves trimmedseparated", "50g/2oz watercress"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tart, preheat the oven to 200C/400F/Gas 6.", "On a lightly floured surface, roll out the pastry to line a 20cm/8in diameter, 2.5cm/1in deep loose-bottomed tart tin. Line the inside of the tin with the pastry, then cover and chill in the fridge for 30 minutes.", "Remove the tart case from the fridge. Line the pastry tart case with greaseproof paper and fill with baking beans or uncooked rice. Bake blind in the oven for 15 minutes.", "Remove the baking beans or rice and greaseproof paper and return the tart case to the oven to bake for a further 5-6 minutes, or until it is just cooked and becoming golden-brown.", "Reduce the oven temperature to 180C/360F/Gas 4.", "Meanwhile, melt the butter in a large frying pan over a low heat. Add the leeks and fry until just softened. Remove from the heat and leave to cool.", "Place the cream, egg and egg yolk into a bowl and whisk to combine.", "Add the egg and cream mixture to the cold leeks and mix together well. Season well with salt and freshly ground black pepper.", "Pour the leek mixture into the cooked pastry case.", "Place the smoked salmon over the top of the leek mixture filling, to cover the filling completely.", "Sprinkle the grated gruyère over the top of the smoked salmon layer. Bake in the oven for 20 minutes, or until the filling is just set and the top is golden-brown.", "For the salad, whisk the mustard, vinegar and olive oil together in a bowl. Add the Little Gems and watercress and mix well.", "To serve, place a slice of tart onto each plate and place a portion of salad alongside."]}]