[{"isVegetarian": false, "title": "Individual toad in the holes", "url": "www_bbc_co_uk_food_recipes_individualtoadintheh_88684", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large cup plain flour", "pinch salt", "½ cup water", "½ cup milk", "1 cup free-range eggs", "1 tbsp malt vinegar", "125g/4oz beef dripping (you can substitute with vegetable oil)", "6 just cooked top quality sausages", "1 tbsp vegetable oil", "2 onions, sliced", "1 tbsp sugar", "1 tbsp tomato purée", "1 tbsp gravy browning or soy sauce", "1 tbsp Worcestershire sauce", "150ml/5fl oz dark ale or beer", "250ml/9fl oz beef stock", "50g/2oz cold butter, cut into cubes"], "serves": "Makes 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour and salt into a bowl.", "Combine the water and milk in a jug.", "Add the eggs and half of the milk and water mixture to the flour and whisk until smooth.", "Add the rest of the milk and water mixture and the vinegar and whisk to combine. Leave to stand for 30 minutes.", "Preheat the oven to 200C/440F/Gas 6.", "Place a tablespoonful of dripping (or vegetable oil) into each of six holes of a muffin tin. Place the tin into the oven to heat the dripping to smoking hot.", "Carefully pour a sixth of the batter into each hole with dripping or oil, then add a sausage to each.", "Return to the oven to cook for 25 minutes. Do not open the oven door during this time!", "For the gravy, heat the oil in a frying pan and fry the onions until soft.", "Add the sugar and tomato purée and cook for five minutes.", "Add the gravy browning or soy sauce, Worcestershire sauce, ale and stock. Bring to the boil, then reduce the heat to simmer for 25 minutes.", "Remove from the heat and add the butter a little at a time, whisking to combine to make a glossy sauce.", "Remove the toad in the holes from the oven and place each onto a plate. Pour over a generous amount of gravy and serve."]}, {"isVegetarian": true, "title": "Mushroom and stout veggie puddings", "url": "www_bbc_co_uk_food_recipes_individualvegetarian_92054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz self-raising flour, plus extra for dusting", "100g/3½oz vegetable suet", "pinch salt", "1 tbsp finely chopped fresh parsley", "120ml/4fl oz water", "2 tbsp olive oil", "4 large shallots, peeled, roughly chopped", "2 garlic cloves, peeled, chopped", "2-3 sprigs fresh thyme, leaves only, chopped", "2 tbsp mushroom ketchup", "150ml/5fl oz Irish stout ", "200ml/7fl oz vegetable stock", "500g/1lb 2oz mixed mushrooms (such as chestnut, Portobello, chanterelle and girolle), brushed clean, chopped", "salt and freshly ground black pepper", "steamed courgettes and carrots, to serve"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the suet pastry, in a large bowl, mix together the flour, suet, salt and chopped parsley. ", "Gradually add the water in a thin stream, stirring continuously with a fork, until the mixture comes together as a dough. (NB: You may not need to use all of the water.) ", "Turn the dough out onto a lightly floured work surface and knead lightly for 1-2 minutes. Wrap the dough in cling film and chill in the fridge for 15-20 minutes. ", "Meanwhile, for the filling, heat the oil in a pan over a medium heat. Add the shallots and chopped garlic and fry for 8-10 minutes, or until softened.", "Add the thyme leaves, mushroom ketchup and Irish stout. Continue to cook for 2-3 minutes, stirring well. ", "Add the stock and mushrooms and bring the mixture to a simmer. Continue to simmer for 10-12 minutes, or until the volume of liquid has reduced slightly and the filling mixture has thickened. Season, to taste, with salt and freshly ground black pepper. Set aside to cool slightly. ", "Once the pastry has chilled, divide it into four equal pieces ", "Pinch off a quarter of the first portion of pastry and set aside to use as the pudding lid. Roll out the remaining pastry portion onto a lightly floured work surface until it forms a circle large enough to line one of the pudding basins. ", "Carefully lift the pastry using a rolling pin and line the pudding basin with it. Allow any excess pastry to hang over the sides of the basin.", "Spoon a quarter of the filling mixture into the pudding basin. ", "Roll out the reserved pastry lid onto a lightly floured work surface until it is slightly larger in diameter than the pudding basin. ", "Brush the rim of the lined pudding basin with water. Cover the pudding with the pastry lid and press the edges of the pastry together to seal. Trim away any excess pastry, then cover the exposed lid of the pudding with a double sheet of aluminium foil, pleated in the middle to allow room for expansion as the pudding cooks.", "Repeat the process with the remaining three portions of pastry, the remaining filling and the remaining pudding basins.", "Prepare a steamer pan, then steam the puddings in the pan for 40-45 minutes, or until cooked through. ", "When the puddings are cooked through, carefully remove them from the steamer pan using oven gloves. Set aside.", "When the pudding basins are cool enough to handle, unwrap the top of the puddings. Remove the foil from each pudding basin. Invert one pudding onto each of four serving plates. ", "Serve immediately with steamed courgettes and carrots."]}, {"isVegetarian": false, "title": "Indo-Chinese stir-fried chicken with dried chillies", "url": "www_bbc_co_uk_food_recipes_indo-chinese_stir-fried_62572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1lb 9oz chicken thighs, skinned, boned and cut in 3-4 pieces each", "oil for deep-frying", "3 garlic cloves, peeled and chopped", "4 tbsp cornflour", "1 tbsp light soy sauce", "1 tbsp dark soy sauce", "1 tbsp rice vinegar", "pinch ground cumin", "pinch chilli powder", "pinch ground coriander", "½ chicken stock cube, crushed to a powder", "½ tsp salt", "3 tbsp vegetable oil", "2 dried red chillies, broken into pieces", "1 tsp whole cumin seeds", "3 garlic cloves, finely chopped", "2 red onions, finely chopped", "½ red or green pepper, diced into 2.5cm/1in pieces", "1 tsp salt", "1½ tsp sugar", "1 tsp red chilli powder", "1 tsp ground cumin", "2 tsp dark soy sauce", "1 tbsp cornflour, mixed to a paste with a little water", "½ lemon, juice only", "2 tbsp chopped wild garlic (when in season) or spring onions", "baby watercress, rocket or similar young leaf salad, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix together all the ingredients for the marinade, then rub them all over the chicken thighs, cover and set aside in the fridge to marinate for 30 minutes.", "Heat enough oil for deep-frying in a deep-fat fryer or a deep, heavy-based saucepan to 190C/375F (CAUTION: Hot oil can be dangerous. Do not leave unattended).  Add the chicken pieces and deep-fry for about five minutes, or until they are crisp, golden-brown and just cooked through.  Drain on a plate lined with kitchen paper and set aside.", "For the stir-fry, heat the oil in a heavy pan until it reaches smoking point.  Add the dried red chillies and move them around quickly.  As they darken, add the cumin and garlic and stir quickly.", "As soon as the garlic starts to change colour, add the onions and the red or green pepper and stir-fry for about two minutes until softened.  Then add the fried chicken, salt, sugar, red chilli powder and cumin and continue stir-frying on a high heat for 1-2 minutes.  Finally, add the soy sauce and mix well.", "When all the vegetables are softened and the spices well combined, add the cornflower paste and stir quickly to mix evenly.  This gives the dish an attractive glaze and also thickens the sauce. Squeeze in the lemon juice, add the chopped wild garlic or spring onions and stir to mix. ", "Serve immediately with steamed rice or noodles if serving as a main, or with a simple salad of watercress as a starter. Alternatively serve on skewers as party food or to go with cocktails."]}, {"isVegetarian": false, "title": "Indonesian pork curry", "url": "www_bbc_co_uk_food_recipes_indonesianporkcurry_412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "750g/1½lb pork strips or pork shoulder steaks, diced into 2cm/1in squares", "1 onion, peeled and sliced thinly", "1 garlic clove, peeled and crushed", "2.5cm/1in piece root ginger, peeled and finely grated", "1 tsp fennel seeds", "1 stick fresh lemongrass, sliced thinly", "6 tbsp red or green Thai curry paste", "300ml/½ pint creamed coconut", "350g/12oz pumpkin, peeled and cut into 2.5cm/1in cubes", "1 tbsp fresh coriander, coarsely shredded", "1 tbsp fresh basil, coarsely shredded", "300g/10oz fresh spinach leaves, picked and washed", "1 tbsp lime juice", "salt and  freshly ground black pepper"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in the wok or heavy based frying pan until smoking.", "Cook the pork in batches until browned all over and golden, remove, keep warm.", "Add the onion and garlic and cook over a gentle heat until softened.", "Add the pumpkin, ginger, fennel seeds and lemongrass and cook for 5 minutes on a low heat.", "Stir in the Thai curry paste and cook together until fragrant.", "Return the pork to the pan with the coconut milk, bring to the boil, simmer for 10-12 minutes.", "Finally stir in the spinach, herbs and season to taste, stir in the lime juice and serve with fluffy steamed or boiled rice."]}, {"isVegetarian": false, "title": "Insalata di baccalà (salt cod salad)", "url": "www_bbc_co_uk_food_recipes_insalata_di_baccal_salt_37547", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz flaked sea salt", "1 bay leaf", "5 white peppercorns ", "3 juniper berries", "500g/1lb 2oz black cod loin or good-quality cod loin ", "50g/1¾oz freshly pitted black olives", "500g/1lb 2oz small new potatoes", "1 red chilli, seeds removed, cut into thin strips", "about 100ml/3½fl oz iced water", "80g/3oz spring onions, trimmed", "70ml/2½fl oz extra virgin olive oil, plus extra for frying", "1 fresh thyme sprig ", "1 tbsp lemon juice", "1 tbsp white wine vinegar", "1 tbsp runny honey", "freshly ground black pepper", "½ pomegranate, seeds removed ", "handful edible cornflowers", "pinch smoked paprika"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the salt, bay, peppercorns and juniper berries in a large casserole. Add 1 litre/1¾ pints water and bring to the boil. As soon as it starts to boil, take it off the heat and leave to cool completely. When the water is cold, submerge the cod, cover and marinate at room temperature for 4 hours.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Put the olives on a small baking tray and put the potatoes in a roasting tin. Bake the olives for 20 minutes, then leave to cool. Bake the potatoes for 30 minutes, or until soft, then leave to cool. Peel and crush the potatoes into almond-sized pieces by hand. ", "Put the chilli in iced water for 10 minutes. ", "Slice the white part of the spring onions and set aside, then cut the green stems into very thin strips and add them to the iced water.", "When you are ready to cook the cod, preheat the oven to 200C/180C Fan/Gas 6. Drain the cod well and dry it on kitchen paper.", "Heat a large frying pan with a few drops of oil and the thyme over a high heat. Add the cod and fry for 1 minute on each side, or until golden. ", "Transfer the cod to a piece of baking paper, fold the paper over the top and finish the cooking in the oven for 6 minutes. Allow to cool a little, then flake the flesh. ", "To make the dressing, whisk the lemon juice, oil, vinegar and honey in a bowl, until creamy. Season with salt and pepper.", "Lay the cod flakes in a serving dish, then scatter over the potatoes, olives and white onion slices. ", "Pour over the dressing and garnish with the drained chilli curls and green onion strips, pomegranate seeds, edible flowers and smoked paprika."]}, {"isVegetarian": false, "title": "Insalata di rinforzo", "url": "www_bbc_co_uk_food_recipes_insalata_di_rinforzo_16631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5 litres/2½ pints white wine vinegar", "50g/1¾oz salt", "50g/1¾oz sugar", "6 cloves", "10 bay leaves", "200g/7oz pickling onions", "2 carrots, cut into small rounds", "1 small cauliflower, cut into florets", "1 yellow pepper, cut into strips", "1 red pepper, cut into strips", "30g/1oz large salted capers, soaked 30 for minutes in water, drained", "100g/3½oz anchovies ", "100g/3½oz black olives", "4 tbsp olive oil", "1 red chilli, finely chopped", "12 slices salami", "12 slices prosciutto"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the insalata di rinforzo, put the vinegar, 1 litre/1¾ pints water, the salt and sugar in a pan with the cloves and bay leaves and bring to the boil. Add the onions and carrots and cook for 10 minutes, then add the cauliflower and peppers and cook for another 20 minutes. Drain and cool.", "To assemble, combine the capers, anchovies and olives in a bowl. Drizzle over the olive oil and add the chopped chilli. Mix all the ingredients well.", "Add some of the pickle to the salad and combine.", "To serve, place the sliced salami and prosciutto on a serving plate along with the salad. Any remaining pickle can be reserved in a fridge in the jar or eaten alongside."]}, {"isVegetarian": false, "title": "Instant coffee meringue gâteau", "url": "www_bbc_co_uk_food_recipes_instant_coffee_meringue_53900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg whites", "200g/7oz caster sugar", "100g/3½oz icing sugar, sifted, plus extra for dusting", "2 tbsp coffee essence", "500g/1lb 2oz mascarpone", "175ml/6fl oz double cream", "1 vanilla pod, split lengthways, seeds scraped out using a sharp knife", "2 large sponge flan cases (about 250g/9oz each, or 25cm/10in across)", "175ml/6fl oz cold espresso", "2 tbsp cocoa powder", "10 small ready-made meringue shells, crushed", "4 white marshmallows, cut into quarters", "50g/2oz dark chocolate, finely grated"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg whites in a large bowl until soft peaks form when the whisk is removed. ", "Tip in the caster sugar and icing sugar and continue to whisk for 4-5 minutes more, or until stiff, glossy peaks form when the whisk is removed.", "Whisk in the coffee essence, then set the mixture aside.", "In a separate bowl, beat together the mascarpone, double cream and vanilla seeds until smooth and well combined.", "Using the ring from the tart tin, stamp out the centres of the flan cases. Cut each disc of sponge in half horizontally to form two thinner discs (four in total).", "Place the ring from the loose-bottomed tart tin onto a serving plate, then lay one sponge disc on top of it. Brush over one-quarter of the cold espresso, then spread over one-third of the mascarpone cream mixture.", "Repeat the layering process with the remaining sponge discs, cold espresso, and mascarpone mixture, topping the cake with the final sponge disc.", "Spoon the egg-white mixture on the cake and spread all over the top and sides in an even layer using a palette knife.", "Using a chefs' blow torch, heat the meringue until crisp and light golden-brown. ", "To serve, dust the top of the gâteau with cocoa powder. Sprinkle over the marshmallows and crushed meringue shells, then garnish with grated dark chocolate. Dust with icing sugar just before serving."]}, {"isVegetarian": true, "title": "Instant soufflé with caramelised bananas", "url": "www_bbc_co_uk_food_recipes_instant_souffl_with_94231", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "3 tbsp caster sugar", "4 tbsp ready-made custard", "4 free-range egg whites", "1 tsp banana liqueur", "4 small bananas, peeled and cut on a angle", "50g/1¾oz butter", "75g/2½oz caster sugar ", "150ml/5fl oz double cream", "1 sprig mint, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the banana soufflé, preheat the oven to 200C/400F/Gas 6 and grease four ramekins using half of the butter and one tablespoon of caster sugar.", "In a large bowl, mix the remaining sugar with the custard.", "In a clean, large bowl whisk the egg whites until stiff peaks form when the whisk is removed.", "Carefully fold the egg whites into the custard mix, stir in the banana liqueur and spoon into the prepared ramekins. Put on a baking tray and place in the oven for 6-8 minutes.", "For the caramelised bananas, heat a frying pan until hot. Add the bananas, cut-side down, and fry for 1-2 minutes, or until caramelised. Remove from the pan and set aside. ", "Add the butter to the pan and heat until foaming, then add the sugar and cook until the mixture is a caramel colour.", "Add the cream, bring to the boil, then reduce the heat until the mixture is simmering. Simmer for 2-3 minutes, or until golden-brown. Return the bananas to the pan and heat through.", "To serve, place the soufflés on serving plates and place the caramelised bananas next to them. Garnish with mint leaves."]}, {"isVegetarian": true, "title": "Instant Punjabi-style pickle", "url": "www_bbc_co_uk_food_recipes_instantpunjabistylep_90220", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/instantpunjabistylep_90220_16x9.jpg", "ingredients": ["3 tbsp jaggery (cane sugar) or palm sugar (both available from Asian grocers) or light brown sugar", "175ml/6fl oz cider vinegar", "120ml/4fl oz extra virgin olive oil (you can use peanut oil or vegetable oil)", "1-2 garlic cloves, peeled and crushed", "1 tsp finely grated fresh ginger", "400g/14oz small cauliflower florets", "5 medium carrots, peeled and cut into 5cm/2½in pieces", "225g/9oz baby turnips, peeled and halved", "2 tsp whole brown mustard seeds, ground in a clean coffee grinder", "2 tsp salt", "a mixture of 1 tsp chilli powder and 1½ tsp bright red paprika", "½ tsp garam masala"], "serves": "1 litre/2 pints", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the sugar and vinegar in a small pan set over a low heat, stirring occasionally. Heat until the sugar has dissolved, then turn off the heat.", "Pour the oil into a large pan set over a medium heat. When the oil is hot, add the garlic and ginger and stir for 30 seconds.", "Add the cauliflower, carrots and turnips to the pan. Stir and cook for about a minute or until the vegetables are coated with oil and still fairly crisp.", "Reduce the heat to low and add the ground mustard, salt, chilli powder and paprika mixture and garam masala. Stir and mix for a minute or two until the vegetables are coated in the spices.", "Pour in the palm sugar-vinegar mixture and stir. Take off the heat and allow the pickle to cool.", "Spoon the finished pickle into one or two clean jars, with its juices, then refrigerate. The pickle may be eaten immediately but will keep in the fridge for 3-4 weeks."]}, {"isVegetarian": true, "title": "Intense chocolate pots", "url": "www_bbc_co_uk_food_recipes_intense_chocolate_pots_39697", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/intense_chocolate_pots_39697_16x9.jpg", "ingredients": ["80g/3oz dark chocolate (80% cocoa solids), cut into small pieces ", "120ml/4fl oz double cream ", "2 drops vanilla extract"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Divide the chocolate and cream between four ramekins. Microwave on a medium heat for 20 seconds. Stir the mixture with a fork until combined. If there are still lumps of chocolate after stirring, microwave for another 5–10 seconds.", "Stir in the vanilla, cover with cling film and place in the fridge for 1 hour, or until set. "]}, {"isVegetarian": true, "title": "Instant banana ice cream", "url": "www_bbc_co_uk_food_recipes_instantbananaicecrea_86115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/instantbananaicecrea_86115_16x9.jpg", "ingredients": ["4 very ripe bananas, peeled, cut into chunks ", "¼ tsp vanilla essence", "3-4 tbsp sugar, honey or sweetener, to taste", "150ml/5fl oz buttermilk or 150g/5½oz Greek-style yoghurt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Spread the banana chunks out on a tray and transfer to the freezer. Leave the banana in the freezer until frozen all the way through (about one hour).", "Place the frozen banana chunks into a food processor. Add the vanilla, sugar, honey or sweetener and half of the buttermilk (or yoghurt). Turn on the processor and blend for a few moments. Then, while the processor is still running, pour in the remaining buttermilk in a thin, steady stream (if you are using yoghurt, just tip it all in and blend).", "Blend until the mixture is smooth and creamy. Serve at once."]}, {"isVegetarian": true, "title": "Intense chocolate cookies", "url": "www_bbc_co_uk_food_recipes_intensechocolatecook_87336", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/intensechocolatecook_87336_16x9.jpg", "ingredients": ["125g/4oz dark chocolate ", "150g/5¼oz plain flour", "30g/1oz cocoa, sifted", "1 tsp bicarbonate of soda", "½ tsp salt", "125g/4oz unsalted butter, softened", "75g/2½oz light brown sugar", "50g/2oz caster sugar", "1 tsp vanilla extract", "1 free-range egg, cold from the fridge", "350g/12¼oz dark chocolate chips"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Break the 125g/4oz dark chocolate into pieces and place into a heatproof bowl set over a pan of barely simmering water. Heat, stirring occasionally, until melted.", "Place the flour, cocoa, bicarbonate of soda and salt into a large bowl and mix well.", "In another bowl, cream the butter and two sugars together until light and fluffy. Add the melted chocolate and stir well.", "Beat in the vanilla extract and crack in the egg, then mix in the dry ingredients. Finally stir in the chocolate chips.", "Scoop out 12 equal portions of the mixture - an ice cream scoop and a palette knife are the best tools for the job - and place onto a lined baking sheet about 6cm/2½in apart. Do not flatten them.", "Transfer to the oven and bake for 18 minutes, then test with a skewer - it should come out semi-clean and not wet with batter. If you pierce a chocolate chip, try again.", "Leave the cookies to cool on the baking sheet for 4-5 minutes, then transfer them to a cooling rack to harden as they cool."]}, {"isVegetarian": true, "title": "Iranian stuffed aubergines with coconut and almond sauce", "url": "www_bbc_co_uk_food_recipes_iranianstuffedauberg_2405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp cumin", "1 tsp cinnamon", "1 tsp ground ginger", "1 tsp ground nutmeg", "1 tsp turmeric", "3 medium aubergines", "1 medium onion, peeled and finely chopped", "1 tbsp olive oil", " 4 garlic cloves, chopped", "1 red chilli, finely sliced", "1 green pepper, diced finely", "60 ml/2fl oz orange juice", "100g/3½oz chickpeas, cooked weight", "150g/5oz roasted cashews", "100g/3½oz dried apricots", "100g/3½oz dates, chopped", "2 tomatoes, diced", "1 tbsp lemon juice", "2 tbsp of fresh coriander, chopped", "salt and lots of freshly ground black pepper", "1 tbsp sunflower margarine", "1 small onion, peeled and chopped", "2 cloves garlic, peeled and chopped", "2cm ginger, peeled and finely chopped", "1 tsp turmeric", "1 tsp cayenne", "1 tin/400ml coconut milk", "750ml water", "1 cinnamon stick", "100g/3½oz ground almonds", "zest and juice of 1 lime", "salt"], "serves": "6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["preheat the oven to 220C/425F/Gas7.", "Cut the aubergines in half lengthways, place on a roasting tray cut side uppermost and cover with silver foil", "Roast in the preheated oven until soft and cooked through (about 30 minutes). Leave the aubergines to cool, then scoop out the middles leaving enough flesh for support. Coarsely chop the innards and set aside.", "Re-hydrate the apricots in boiling water for 30 minutes, then finely chop.", "Fry the onion in the olive oil until translucent. Add the garlic and chilli and stir-fry for a couple of minutes.", "Add the spice mix and stir-fry until fragrant. Add the green pepper and orange juice, stir well. Fry until the pepper is soft.", "Roast or toast the cashews - be careful they don t burn.", "Mix the cashews with the cooked chickpeas, chopped apricots, chopped dates and diced tomatoes.", "Add the cashew mix to the onion spice mix along with the chopped aubergine innards, lemon juice, coriander, salt and lots of black pepper. Reserve some coriander for the garnish.", "Pile the filling into the aubergine skins and bake for 15 minutes.", "For the coconut and almond sauce: Gently fry the onion in the margarine until soft, add the garlic and ginger and fry very gently. Make sure the onion and the garlic don t brown as this will ruin the colour of the sauce.", "Add the spices, stir into the onion mixture, then add the coconut milk, water and cinnamon stick. Bring to the boil and simmer gently for 15 minutes.", "Take off the heat and remove the cinnamon stick", "Add the ground almonds, lime zest, juice and a pinch of salt.", "Blend the sauce in a liquidizer. Check the seasoning.", "Serve the aubergine, garnished with fresh coriander with the coconut and almond sauce and a green salad."]}, {"isVegetarian": false, "title": "Irene Cleaves' southern fried chicken", "url": "www_bbc_co_uk_food_recipes_irenecleavessouthern_70533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["flour, for dusting", "salt and freshly ground black pepper ", "2 eggs, beaten", "milk ", "1.4kg/3lb chicken, jointed", "oil, for frying", "flour ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the flour with salt and freshly ground black pepper and combine the eggs with milk.", "Dust the chicken pieces with flour then dip in the eggwash. ", "In a large frying pan heat the oil and fry chicken gently to begin with, raising the temperature until it is as brown and cooked after 10-15 minutes. Remove from the pan and keep warm. ", "For the gravy, add a little flour to the oil in the pan and brown slowly. ", "Add cold water, stirring until the gravy is of a required thickness, plus salt and freshly ground black pepper. ", "Simmer for a few minutes then pour over chicken."]}, {"isVegetarian": true, "title": "Irish cream ice cream", "url": "www_bbc_co_uk_food_recipes_irish_cream_ice_cream_63791", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irish_cream_ice_cream_63791_16x9.jpg", "ingredients": ["300ml/10fl oz whipping cream", "125g/4½oz sweetened condensed milk", "2 tbsp Irish cream liqueur", "pinch ground cinnamon"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Pour the cream into a large bowl and whisk until stiff peaks form.", "Carefully fold in the condensed milk, Irish cream liqueur and cinnamon. ", "Transfer to a lidded container and freeze for 4–6 hours, or until solidified."]}, {"isVegetarian": false, "title": "Irish fish chowder with soda bread", "url": "www_bbc_co_uk_food_recipes_irish_fish_chowder_with_08587", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irish_fish_chowder_with_08587_16x9.jpg", "ingredients": ["200g/7oz wholemeal flour", "275g/9¾oz strong white flour, plus extra for sprinkling", "1 heaped tsp bicarbonate of soda", "pinch salt", "200ml/7fl oz buttermilk", "1 large free-range egg", "1 tsp honey", "1 large potato", "250g/9oz un-dyed smoked haddock fillets, skin on", "1 bay leaf", "1 shallot, halved", "650ml/22fl oz full-fat milk", "30g/1oz unsalted butter", "1 onion, chopped", "1 clove garlic, sliced", "150g/5½oz sweetcorn kernels (thawed, if frozen)", "handful runner beans, sliced", "6 scallops, sliced", "12 steamed clams", "200g/7oz pollock fillet, diced", "150g/5½oz raw king prawns  ", "1 tbsp chopped fresh flat-leaf parsley", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Grease and flour a 900g/2lb loaf tin.", "Combine the flours, bicarbonate of soda and salt in a mixing bowl. ", "In a measuring jug, combine the buttermilk with the egg and honey.", "Make a well in the center of the dry ingredients, and then pour in the wet mixture. Add a little extra flour if you find the dough is too wet and sticky.", "Using a wooden spoon, bring the mix together to form a dough. Shape into a rough oval and place in the loaf tin.", "Sprinkle a little flour on top and bake in the oven for 35-40 minutes. Turn the loaf out on a wire rack to cool before slicing.", "For the chowder, place the potato in a saucepan, cover with water, bring to the boil and simmer for 15-20 minutes until tender. Cut the cooked potato into small pieces and set aside.", "Place the smoked haddock, skin side up, in a pan with the bay leaf and shallot and cover with the milk. Bring to a simmer for a few minutes, then take off the heat and leave in the milk to finish cooking.", "In a large pan, gently fry the onions in the butter until softened. Stir in the sliced garlic, cooked potato, sweetcorn, then add a handful of the sliced runner beans.", "Lift the haddock out of the milk with a slotted spoon and place on a plate. Peel away the skin and tear into pieces. Strain the milk through a sieve into the onion potato mixture and simmer for about 20 minutes.", "Add the cooked haddock, sliced scallops, steamed clams, pollock and the prawns and warm through, then stir in the parsley and season with lots of black pepper.", "To serve, ladle the chowder into bowls and serve with thick slices of soda bread."]}, {"isVegetarian": true, "title": "Irish rarebit", "url": "www_bbc_co_uk_food_recipes_irish_rarebit_65884", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irish_rarebit_65884_16x9.jpg", "ingredients": ["150ml/5fl oz whole milk", "1½ tbsp plain flour", "400g/14oz Irish cheddar cheese, grated", "160g/6oz breadcrumbs", "1 tsp English mustard powder", "120ml/4fl oz stout", "2 free-range eggs, yolks only", "4 spring onions, finely chopped", "6 slices toasted soda bread"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Warm the milk in a saucepan and whisk in the flour. Keep stirring and bring to the boil. Reduce the heat to a simmer. The milk should thicken slightly.", "Add the cheese and stir over a low heat until it has melted. Add the breadcrumbs, mustard and stout. Continue stirring until the mixture comes together, it should leave the sides of the pan.", "Remove from the heat and tip into a bowl, leave to cool slightly. Once cooled add the egg yolks and beat vigorously with a wooden spoon until the egg is thoroughly mixed in. Add the chopped spring onions.", "Spread the rarebit on toasted soda bread and place under a hot grill until bubbling and golden-brown."]}, {"isVegetarian": true, "title": "Irish coffee", "url": "www_bbc_co_uk_food_recipes_irishcoffee_8924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["a good glug of Irish whiskey", "1 tsp brown raw cane sugar", "1 heaped tbsp whipped cream", "hot strong coffee to fill the glass"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Use warmed coffee glasses and add the whiskey.", "Add the sugar and dissolve in the whiskey.", "Add the coffee and stir well.", "Float the whipped cream on top and serve."]}, {"isVegetarian": false, "title": "Irish beef stew", "url": "www_bbc_co_uk_food_recipes_irishbeefstew_73826", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irishbeefstew_73826_16x9.jpg", "ingredients": ["1½kg/3lb 5oz stewing beef, cut into cubes", "175g/6oz streaky bacon", "3 tbsp olive oil", "12 baby onions, peeled", "18 button mushrooms, left whole", "3 carrots, cut into quarters or 12 baby carrots, scrubbed and left whole", "salt and freshly ground black pepper", "1 tbsp chopped thyme", "2 tbsp chopped parsley", "10 cloves of garlic, crushed and grated", "425ml/15fl oz red wine", "425ml/15fl oz chicken or beef stock", "50g/2oz butter", "50g/1¾oz flour", "champ, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Brown the beef and bacon in the olive oil in a hot casserole or heavy saucepan.", "Remove the meat and toss in the onions, mushrooms and carrots, one ingredient at a time, seasoning each time.", "Place these back in the casserole, along with the herbs and garlic.", "Cover with red wine and stock and simmer for one hour or until the meat and vegetables are cooked.", "To make the roux, in a separate pan melt the butter, add the flour and cook for two minutes.", "When the stew is cooked, remove the meat and vegetables.", "Bring the remaining liquid to the boil and add one tbsp of roux.", "Whisk the mixture until the roux is broken up and the juices have thickened, allowing to boil.", "Replace the meat and vegetables, and taste for seasoning.", "Sprinkle with chopped parsley and serve with champ."]}, {"isVegetarian": true, "title": "Irish cream bread and butter pudding with cream", "url": "www_bbc_co_uk_food_recipes_irishcreambreadandbu_90971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, softened", "½ loaf white farmhouse bread, sliced", "60g/2¼oz sultanas", "3 large free-range egg yolks", "2 large free-range eggs", "40g/1½oz caster sugar", "300ml/10½fl oz double cream", "300m/10½fl oz milk", "2 drops vanilla extract", "5 tbsp Irish cream liqueur", "20g/¾oz demerara sugar", "double cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Butter a 1½ litre/2 pints 12¾fl oz ovenproof dish with half of the butter.", "Spread the bread slices with the remaining butter on both sides. Cut the bread into triangles and overlap layers of bread with the sultanas in the greased dish. ", "Beat the egg yolks, whole eggs and sugar together in a large bowl until creamy. Beat in the cream, milk, vanilla extract and Irish cream liqueur.  ", "Pour the mixture over the bread, and press down the bread slices until submerged. Leave to stand for 20 minutes to allow the bread to soak up the liquid. ", "Place the dish into a roasting tray and add enough water to come halfway up the dish (this is called a bain-marie). Sprinkle with demerara sugar and bake for 35-40 minutes until golden-brown.", "To serve, place a portion of bread and butter pudding on each plate and pour over the double cream."]}, {"isVegetarian": true, "title": "Irish soda bread", "url": "www_bbc_co_uk_food_recipes_irishsodabread_67445", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irishsodabread_67445_16x9.jpg", "ingredients": ["170g/6oz self-raising wholemeal flour", "170g/6oz plain flour", "½ tsp salt", "½ tsp bicarbonate of soda", "290ml/½ pint buttermilk"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 400F/200C/Gas 6.", "Tip the flours, salt and bicarbonate of soda into a large mixing bowl and stir.", "Make a well in the centre and pour in the buttermilk, mixing quickly with a large fork to form a soft dough. (Depending upon the absorbency of the flour, you may need to add a little milk if the dough seems too stiff but it should not be too wet or sticky.)", "Turn onto a lightly floured surface and knead briefly.", "Form into a round and flatten the dough slightly before placing on a lightly floured baking sheet.", "Cut a cross on the top and bake for about 30 minutes or until the loaf sounds hollow when tapped. Cool on a wire rack."]}, {"isVegetarian": false, "title": "Irish stew", "url": "www_bbc_co_uk_food_recipes_irishstew_67437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["about 1kg/2¼ lb scrag end or neck of lamb on the bone", "2 carrots", "1 large onion", "2  celery sticks", "1 leek", "2-3 garlic cloves, crushed", "1 large bay leaf", "1 large sprig fresh thyme", "sea salt and freshly ground black pepper", "150g/5oz small carrots", "150g/5oz baby or pickling onions", "1 large floury potato, about 300g/10oz weight, peeled and diced finely", "2 spring onions, thinly sliced", "a little fresh chopped parsley"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Using a sharp thin boning knife, remove as much meat from the lamb bones as possible. Chop finely and set aside.", "Put the bones into a large pot. Roughly chop the carrots, large onion, celery and leek then place in the pot with the garlic and herbs. Cover with at least 4 litres/7 pints cold water. Bring to the boil, season lightly, then simmer gently, uncovered for up to two hours. Skim with a large tablespoon if necessary. Let the liquid simmer down until reduced by nearly two thirds. You need about 1.2 litres/2 pints of lovely sweet stock.", "Strain and discard the bones etc. Ideally, cool and chill the stock then you can scrape off any fat that has settled on top.", "Place the lamb meat into a large saucepan and cover with cold water. Bring slowly to the boil, skim off any scum, then immediately drain into a colander and rinse in cold running water. This scalding removes fat.", "Return the meat to the pan and cover with the stock and bring to the boil. Turn down the heat and simmer partially covered, for about 30 minutes, or until tender. ", "Meanwhile, peel the carrots and cut into small chunks or shape into neat 'barrels'. Peel the baby onions, it helps to blanch them in boiling water for a minute for easy peeling. Add the small carrots and baby onions to the soup and cook for another five minutes.", "Then add the diced potato and cook for another 10-15 minutes, until it starts to dissolve into the soup and thicken it. Finally check the seasoning, adding lots of aromatic black pepper and a little sea salt. Garnish with sliced spring onion and parsley."]}, {"isVegetarian": true, "title": "Irish stout punch", "url": "www_bbc_co_uk_food_recipes_irishstoutpunch_87001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/17fl oz Irish stout", "200ml/7fl oz condensed milk", "10 ice cubes", "ground cinnamon or freshly grated nutmeg, for sprinkling"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the Irish stout and the condensed milk into a blender and add the ice. Pulse for one minute until light and frothy.", "To serve, pour into glasses and sprinkle with a little ground cinnamon or freshly grated nutmeg."]}, {"isVegetarian": false, "title": "Isaan-style grilled chicken (kai yaan) and Nonya-style bean curd salad (taukwa goreng)", "url": "www_bbc_co_uk_food_recipes_isaanstylegrilledchi_91586", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lemongrass stalks, tough outer layer removed, inner layers finely sliced", "1 tsp salt", "1 tsp caster sugar", "6 garlic cloves, finely chopped ", "3 fresh coriander roots or 6 coriander stems, finely chopped", "1 tbsp crushed black peppercorns", "1 tbsp fish sauce", "4 boneless chicken breasts, skin on, each cut into 4 pieces", "4 boneless chicken thighs, skin on, halved", "4 tbsp skinless raw peanuts or raw cashew nuts", "3cm/1¼in piece fresh root ginger, finely chopped", "2 fresh chillies, seeds removed, finely chopped", "4 shallots, finely chopped", "1 tbsp palm sugar or soft brown sugar", "1 tbsp dark soy sauce", "3 tbsp tamarind pulp", "3 tbsp warm water", "vegetable oil, for deep-frying", "250g/9oz firm bean curd", "200g/7oz mangetout, trimmed, finely sliced", "150g/5oz bean sprouts, trimmed, rinsed", "1 large cucumber, seeds removed, finely sliced", "1 red sweet pepper, seeds removed, finely sliced ", "2 spring onions, finely chopped", "handful fresh coriander leaves"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken, using a mortar and pestle, pound the lemongrass with the salt and sugar  to make a rough paste. Add the garlic and coriander root or stems and continue to pound to  a paste. Add the crushed black peppercorns and pound until you have a semi-smooth paste. Finally,  add the fish sauce and mix until well blended. ", "Rub the chicken pieces thoroughly with the paste, and marinate, covered, in the refrigerator for at least two hours.", "Preheat a ridged cast-iron grill pan until hot, but not too hot. Alternatively, light a  barbecue outdoors and wait until the flames have died down and the coals are turning white. ", "Place the chicken in the pan or on the barbecue where it is not too close to the direct heat. Cook the chicken in the grill pan or over the barbecue slowly in order to impart a smoky savoury character and allow the marinade to caramelise. ", "Turn the chicken pieces frequently (every three minutes or so) to prevent them from burning. Cook for 10-15 minutes, or until cooked through and caramelised (the chicken is  cooked when the juices run clear when the chicken is pierced in  the thickest part with a skewer).", "For the dressing, dry-roast the nuts in a heavy-based pan (without oil) over a medium heat until  golden-brown. Shake the pan occasionally, being careful not to scorch the nuts. Remove from  the heat and allow the nuts to cool. ", "Using a mortar and pestle, grind the ginger, chillies and shallots to a paste. Add the roasted nuts and continue to crush, then add the palm sugar and work until smooth. Add the remaining dressing ingredients and mix together. The dressing will be sweet, hot, salty and  sour.", "For the bean curd salad, half-fill a deep, heavy-based pan with the vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Pat the bean curd dry with kitchen paper, then deep-fry in the hot oil for 4-5 minutes, or until golden-brown all over. Remove with a slotted spoon, drain on kitchen paper and cut into ½cm/¼in slices.", "Bring a pan of salted water to the boil. Cook the mangetout and bean sprouts in the boiling water for 30 seconds, then quickly refresh under cold running water to stop them from cooking further. Mix the blanched vegetables with the cucumber and red pepper. Scatter  over the fried slices of bean curd, the spring onions and coriander leaves. ", "To serve, spoon the roasted nut and tamarind dressing over the top of the salad and pile  the chicken alongside. The salad is best eaten straightaway."]}, {"isVegetarian": false, "title": "Isle of Wight stuffed tomatoes", "url": "www_bbc_co_uk_food_recipes_isle_of_wight_stuffed_79263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/isle_of_wight_stuffed_79263_16x9.jpg", "ingredients": ["5 beef tomatoes", "1 shallot, finely chopped", "500g/1lb 2oz lamb mince", "25g/1oz fresh breadcrumbs", "300g/10½oz button mushrooms, finely chopped", "3 tbsp chopped fresh tarragon", "salt and black pepper", "25ml/1fl oz olive oil ", "8 medium tomatoes (preferably Island Beauty tomatoes), cut into quarters", "50ml/2fl oz rapeseed oil", "2-3 garlic cloves, finely chopped"], "serves": "Serves 5", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 or prepare a barbecue.", "Slice the tops off the beef tomatoes, reserving the tops to use as lids later. Scoop out the flesh and seeds from the centre and place into a saucepan.", "Mix the shallot, mince, breadcrumbs, mushrooms and tarragon in a bowl. Season with salt and freshly ground black pepper. ", "Stuff the tomatoes with the mince mixture (do not overfill as the mixture will expand when cooking and could split the skin), drizzle with oil and place the lids on top. ", "Place the stuffed tomatoes onto a barbecue for 10-15 minutes, or until the mince is fully cooked. Alternatively bake in the oven for the same time.", "To make the sauce, add the tomatoes to the saucepan containing the flesh from the beef tomatoes, then add the oil and garlic. Season with salt and pepper and bring to the boil. Simmer for 10 minutes.", "To serve, place the stuffed tomatoes onto a large serving platter and drizzle around the sauce."]}]