[{"isVegetarian": true, "title": "Bara brith soufflés", "url": "www_bbc_co_uk_food_recipes_bara_brith_souffls_91119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz freshly brewed strong black tea", "40g/1½oz soft dark brown sugar", "100g/3½ oz mixed dried fruit", "4 large free-range eggs", "50g/1¾oz caster sugar, plus extra for dusting", "30g/1oz cornflour", "250ml/9fl oz milk", "1 tsp ground mixed spice", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the tea and soft dark brown sugar in a heatproof bowl and stir until the sugar has dissolved. Stir in the dried fruit and cover with cling film. Leave to soak for 1 hour. ", "Drain the fruit, tip into a food processor and blend until smooth.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Separate the egg whites and yolks into two separate bowls. Whisk the yolks together with the caster sugar and cornflour.", "Put the milk and mixed spice into a saucepan and bring to a gentle simmer. Pour over the egg yolks, whisking to combine then return to the pan over a high heat. Bring to the boil and cook for 3 minutes, whisking constantly. Remove from the heat and leave to cool. Beat in the fruit purée until smooth.", "Whisk the egg whites with a handheld electric whisk until soft peaks form. Fold into the pastry cream mixture one third at a time, being careful not to knock out the air.", "Divide the mixture between four ramekins and smooth the tops over with a palette knife. Bake for 18 minutes until risen and golden-brown, then dust with icing sugar and serve immediately."]}, {"isVegetarian": false, "title": "Barbary duck with cherries and chocolate ganache", "url": "www_bbc_co_uk_food_recipes_barbaryduckwithcherr_91549", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz cabernet sauvignon vinegar", "125g/4½ oz plain chocolate", "110g/4oz unsalted butter, softened", "2 barbary ducks", "1 litre/1 pint 15fl oz duck fat", "2 cloves garlic", "6 sprigs fresh thyme", "1 tbsp olive oil", "3 shallots, chopped", "1 tsp caster sugar", "300ml/10½fl oz port", "300ml/10½fl oz chicken stock", "salt and freshly ground black pepper", "200g/7oz fresh cherries, stones removed", "1 punnet lamb's cress, to serve (substitute mustard cress if unavailable)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the chocolate ganache, place the vinegar into a non-reactive saucepan and bring to the boil. Cook until the volume of liquid has reduced to 110ml/4fl oz.", "Place the chocolate into a bowl over a pan of simmering water (do not let the water touch the bottom of the bowl). Heat until melted.", "Remove the bowl from the heat, then gently stir in the butter and the reduced vinegar. Mix until well combined. Place in the fridge until firm, about two hours.", "For the duck, preheat the oven to 150C/300F/Gas 2. Remove the legs and breasts from the duck. (You will not need the carcass for this recipe; save to make stock for another dish.)", "Heat a large ovenproof frying pan until just warm, then add the duck legs, skin-side down, and cook for one minute until just browned. Add the duck fat, one clove of garlic and half of the thyme.", "Cook in the preheated oven for 1-1½ hours, then carefully remove the duck legs from the fat and keep warm. ", "Meanwhile, heat another frying pan until hot. Add the olive oil, shallots and the remaining garlic and thyme. Cook for 2-3 minutes, or until softened, then add the sugar and cook for a further minute, stirring until the sugar has dissolved. Add the port and cook until reduced to a sticky glaze. Add the chicken stock and cook until the volume is reduced by half (the sauce should be thick enough to coat the back of a spoon).", "Pass the sauce through a sieve back into the pan and season, to taste, with salt and freshly ground black pepper. Add the cherries and cook for one minute.", "Remove the skin from the duck breast and add the skin to the pan with the duck legs and fat. Return to the oven and cook until soft, 2-3 minutes. Scrape the fat from the cooked duck skin. Place onto a baking tray, then weigh down with another heavy baking tray to keep it flat. Return to the oven and cook for 4-5 minutes, or until crisp. ", "Season the duck breast with salt and freshly ground black pepper. Heat a frying pan until hot, add a little of the duck fat and add the duck breast. Cook on each side for 2-3 minutes or until cooked to your liking. Remove from the pan and leave to rest for 2-3 minutes. Keep warm.", "To serve, place a duck leg into the centre of each of four plates. Carve the breasts into three pieces and place around the leg.", "Place a piece of the crisp duck skin onto the pieces of duck breast. Using two spoons, form the chocolate ganache into oval-shaped quenelles and place one on top of each piece of crisp duck skin. Spoon the cherries and sauce around the duck, scatter over the lamb's cress and serve."]}, {"isVegetarian": false, "title": "Barbecue baby back ribs with celeriac slaw", "url": "www_bbc_co_uk_food_recipes_barbecue_baby_back_ribs_42228", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecue_baby_back_ribs_42228_16x9.jpg", "ingredients": ["2kg/2lb 4oz baby back pork ribs, in racks", "2 celery stalks, trimmed, halved", "1 onion, thickly sliced", "2 red chillies, cut in half lengthways", "1 garlic bulb, cut in half horizontally", "250ml/9fl oz apple juice", "125ml/4½fl oz tomato ketchup", "150g/5oz dark muscovado sugar", "2 tbsp Worcestershire sauce", "1 tsp smoked hot paprika", "1 tsp smoked sweet paprika", "75ml/2½fl oz white wine vinegar", "50ml/2fl oz bourbon whiskey", "3 free-range egg yolks", "1 tbsp Dijon mustard", "2 tbsp cider vinegar", "300ml/10½fl oz rapeseed oil", "1 celeriac, julienned and placed in acidulated water", "2 tbsp roughly chopped fresh flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, place the rib racks into a large, wide, heavy-based saucepan with the celery, onion, chillies, garlic and apple juice. Pour over just enough water to cover the pan contents. Bring the mixture to the boil, then reduce the heat until the mixture is just simmering. Simmer very gently for 1-1½ hours, or until the meat is tender. From time to time, skim off any scum that rises to the surface during cooking.", "Meanwhile, for the barbecue sauce, heat the ketchup and muscovado sugar in a frying pan over a medium heat for 2-3 minutes, or until the sugar has dissolved into the ketchup. ", "Add the Worcestershire sauce, smoked paprikas and vinegar and bring the mixture to the boil. Reduce the heat until the mixture is simmering and cook for 4-5 minutes, or until thickened. Stir in the bourbon, then remove from the heat and set aside. Refrigerate when cool.", "For the slaw, whisk together the egg yolks, mustard and vinegar in a large bowl until well combined. Gradually add the oil in a very thin stream, whisking continuously, until the mixture has thickened to a light mayonnaise and all of the oil has been fully incorporated into it.", "Drain the celeriac thoroughly and remove any excess moisture using kitchen paper. Stir the celeriac and parsley into the mayonnaise and season, to taste, with salt and freshly ground black pepper. Chill in the fridge until needed.", "When the ribs are poached, preheat the oven to 240C/220C Fan/Gas 9, or as hot as it will go.", "Remove the ribs from the poaching liquor using a slotted spoon and transfer to a large roasting tray. Brush the ribs all over with the barbecue sauce, then roast in the oven for 10-15 minutes, turning every five minutes, until the ribs are sticky and charred around the edges.", "To serve, pile the ribs on a serving platter and serve the celeriac slaw and the remaining barbecue sauce alongside."]}, {"isVegetarian": false, "title": "Barbecue sweetcorn with smoked chilli garlic butter", "url": "www_bbc_co_uk_food_recipes_barbecue_sweetcorn_with_51495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 sweetcorn cobs", "225g/8oz unsalted butter, at room temperature", "2 tbsp lemon juice", "2 tbsp chopped fresh herbs, such as coriander or parsley", "2 anchovies, finely chopped", "1 tbsp chopped shallot", "4 tbsp smoked barbecue sauce (or smoked ketchup )", "2 sliced smoked chipotle chillies, or fresh chillies ", "½ tsp salt", "¼ tsp ground white pepper"], "serves": "Makes 12 cobs", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the barbecue to hot. Barbecue the corn until cooked through.", "For the smoked chilli garlic butter, place all the ingredients in a food processor and blend for 30 seconds, or until the mixture is shiny and smooth.  ", "Turn into a bowl and reserve.", "To serve, top the corn with a spoonful of the soft butter, and serve immediately."]}, {"isVegetarian": false, "title": "Barbecued turbot and leeks, girolles and fresh almonds", "url": "www_bbc_co_uk_food_recipes_barbecue_turbot_and_14289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucumber, peeled, deseeded and finely chopped", "120g/4½oz caster sugar", "175g/6oz rice vinegar", "250g/9oz unsalted butter, softened", "1 tbsp Dijon mustard", "1 lemon, zest and juice", "1 garlic clove, crushed", "1 tbsp lemon thyme leaves ", "1 tsp salt", "pinch cayenne pepper", "15g/½oz ground almonds", "1 x 2kg/4lb 8oz–3kg /6lb 8oz whole turbot (portioned into 6 tranche)", "3 slender leeks, cut in half lengthways", "150g/5½oz small girolles, cleaned", "50g/1¾oz butter", "2 lemons, juice only", "100g/3½oz fresh almonds, husks removed", "2 lemons, segmented and cut into 2cm/¾in pieces", "200ml/7fl oz chicken stock", "20g/¾oz lilliput capers", "20g/¾oz pickled cucumber, from above", "1 tbsp finely chopped parsley", "1 tsp finely chopped tarragon", "salt and freshly ground black pepper "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the barbecue. ", "To make the pickled cucumber, place a small saucepan over a medium heat. Add the sugar and vinegar and heat until the sugar has dissolved. Remove from the pan and add the cucumber. Set aside. ", "Mix together the lemon butter ingredients in a small bowl. ", "Lightly oil the turbot on both sides, season and place white skin-side down on the barbecue. Cook for 4 minutes and turn over. Add a spoon of the lemon butter onto each tranche and cook for a further 5 minutes or until cooked through. Take off the barbecue and allow to rest. Remove the dark skin.", "Place the leeks on the barbecue until charred. Spoon some of the lemon butter onto each leek and cook for a further 2 minutes.", "Sauté the girolles in a saucepan with a splash of olive oil and a knob of lemon butter.", "For the sauce, place a frying pan over a medium heat. Add the butter and cook until it turns a nut-brown colour. Add the lemon juice, fresh almonds and the remaining the ingredients. Season with salt and pepper. ", "To serve, place the turbot on a serving platter. Arrange the leeks and girolles around the edge and pour over the sauce."]}, {"isVegetarian": false, "title": "Barbecued lamb belly wraps", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_belly_15029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 carrot, roughly chopped", "1 onion, roughly chopped", "2 star anise ", "1 garlic bulb, cut in half horizontally", "small bunch fresh parsley", "1 dried smoked chipotle chilli", "1 x 1.75kg/3lb 14oz lamb belly, bones removed ", "2 red onions, finely sliced", "200ml/7fl oz cider vinegar", "2 tbsp caster sugar", "½ tsp black mustard seeds", "½ tsp sea salt", "¼ cucumber, finely sliced ", "75g/2¾oz chipotle paste", "275ml/9¾fl oz tomato ketchup", "175ml/6fl oz maple syrup", "1 tbsp Worcestershire sauce", "1 tbsp cider vinegar", "5 tbsp light soy sauce ", "8-12 naan breads or pides (Turkish breads)", "small bunch fresh coriander sprigs"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, put the carrot, onion, star anise, garlic, parsley and chipotle chilli into a large saucepan. Half-fill the pan with cold water, then lay the lamb belly on top and pour over just enough water to cover the meat. Bring the mixture to the boil, then reduce the heat until simmering and simmer for 1 hour, until the meat is really tender. ", "Meanwhile, for the pickled red onions, put the sliced red onions into a bowl, then heat the cider vinegar, caster sugar, mustard seeds and salt in a non-reactive pan until the sugar has dissolved and the mixture is just simmering. ", "Pour the liquid over the onions, then add the cucumber, stir well and set aside to cool. ", "For the barbecue sauce, heat a non-reactive frying pan over a medium heat until hot, then add the chipotle paste and stir-fry for a 1-2 minutes. Add the ketchup and maple syrup and stir-fry for a further 2-3 minutes, or until bubbling. Add the Worcestershire sauce, cider vinegar and soy sauce, bring the mixture to the boil, then reduce the heat until simmering and simmer for 5-6 minutes, or until thickened. Set aside.", "When the lamb has cooked, remove it from the pan using a slotted spoon and set aside to drain and cool.", "Preheat the oven to 200C/180C Fan/400F/Gas 6. Warm the naan bread or pide in the oven for a few minutes. ", "To serve, coarsely shred the lamb meat and fold the meat into the warm barbecue sauce. Spoon the mixture on top of the warmed bread, with some of the pickled red onions and coriander leaves scattered on top."]}, {"isVegetarian": false, "title": "Barbecued lamb, salsa verde, tomato salad, toasted couscous and fromage blanc", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_salsa_59620", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 double lamb rump, boned and butterflied to equal thickness ", "half bunch fresh parsley", "half bunch fresh mint ", "half bunch fresh oregano", "1 garlic clove, peeled", "1 small green chilli, deseeded", "4 tsp capers", "250ml/9fl oz olive oil, plus extra to drizzle ", "200g/7oz large pitted green olives, roughly chopped", "100g/3½oz fromage blanc", "sea salt flakes and freshly ground black pepper", "50g/13/4oz butter", "50ml/2fl oz olive oil", "150g/51/2oz couscous", "10g/1/2oz almonds, toasted", "6 heirloom tomatoes, cut into equal size shapes ", "4 tsp white balsamic vinegar", "small handful fresh basil, roughly torn"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the lamb in a large shallow dish. Blend the parsley, mint, oregano, garlic, chilli, capers and 150ml/5fl oz oil in a food processor. Pour two thirds of the mixture over the lamb, cover with clingfilm and marinate in the fridge for 24 hours. Reserve the remaining mixture in the fridge, covered.", "When you are ready to cook, preheat your barbecue to hot.", "For the couscous, melt the butter with the oil in a heavy-based saucepan over a medium heat. Add the couscous and fry until dark and well toasted. Pour in 300ml/10fl oz cold water and cover with cling film, then set aside.  ", "Mix the olives with the remaining 100ml/31/2fl oz oil, cover and set aside. For the salad, put the tomatoes in a shallow serving dish, then sprinkle over the vinegar, basil and a pinch of salt. Cover and set aside. ", "Cook the lamb on the barbecue for 4 minutes on each side, or until well browned but still pink in the middle. Transfer it to a serving plate, drizzle with oil and leave to rest for 20 minutes.", "To finish the couscous, toast the almonds in a hot frying pan for 2-3 minutes. Fluff the couscous up using a fork, mix in the almonds, a drizzle of oil and a spoon of the reserved salsa verde and season with salt and pepper. ", "Arrange the tomatoes and couscous on plates and garnish with the olives. Add a quenelle of the salsa verde. Carve the lamb and divide equally between the plates. Spoon on the fromage frais and drizzle with the resting juices."]}, {"isVegetarian": false, "title": "Barbecued lamb with baked squashes, anchovy, capers and brown butter", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_with_55922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1lb 9oz of lamb neck fillet or lamb leg steaks, cut into 4 even portions", "olive oil, for cooking", "sea salt and pepper", "2 butternut squash, or about 1.2kg/2lb 12oz mixed onion/spaghetti squash, unpeeled and cut into thin wedges", "1 red chilli, seeds removed, roughly chopped", "2 garlic cloves, peeled and roughly chopped", "110g/4oz unsalted butter, softened ", "1 tbsp blossom honey", "1 large head cavolo nero, leaves only", "extra virgin olive oil, for drizzling", "30g/1¼oz pickled capers", "½ lemon, zest and juice only", "4 tinned anchovies, finely chopped"], "serves": "Serves 4 as a main, 6-8 as a tapa", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the lamb portions in a bowl and drizzle over some olive and season with salt and pepper. Leave to marinade while the squash is cooking.", "Place the squash pieces on a baking tray. Drizzle over a little olive oil and add the chilli, garlic, 50g/1¾oz of the butter and a good amount of seasoning. Mix the squash with your hands ensuring it’s fully coated. ", "Place the tray in the oven and cook until the squash starts to caramelise, then turn the heat down to 160C/325F/Gas 3 and continue to cook until the squash becomes tender and soft. You should turn the squash twice during this process to ensure even colouring, and so that the squash doesn’t stick. ", "When the squash is ready, drizzle it with the honey and set aside.", "Heat a barbecue or grill pan to maximum heat. Place the lamb on the grill or barbecue and cook for 3-4 minutes on each side, or until nicely charred and the meat still has a spring when pushed with a finger. The meat should be rosy pink inside. Leave the meat to rest for at least five minutes.", "Blanch the cavolo nero in a pan of salted boiling water, drain well and toss with some seasoning and extra virgin olive oil.", "Place a small saucepan on a high heat and add the remaining butter. Cook the butter until it turns a nut-brown colour and then immediately add the capers, lemon juice and zest and the anchovies. Season with salt and pepper and then turn off the heat.", "To serve, slice the lamb into 12 pieces, divide onto serving plates with the squash and cabbage and then spoon over the butter sauce. "]}, {"isVegetarian": false, "title": "Barbecued sardines", "url": "www_bbc_co_uk_food_recipes_barbecued_sardines_27707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucumber, cut in half lengthways, seeds scraped out, flesh finely diced", "1 banana shallot, finely diced", "2 garlic cloves, crushed", "4 tbsp extra virgin olive oil", "3 tbsp chopped fresh dill", "3 tbsp chopped fresh mint leaves", "3 tbsp chopped fresh coriander leaves", "2 limes, juice only", "16 sardines, scales and guts removed (ask your fishmonger to do this for you)", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Soak four pieces of clean thick untreated wood in cold water, preferably overnight.", "Thirty minutes before you want to eat, light the barbecue. Allow the flames to flare up and die down.", "Meanwhile, mix the cucumber, shallot, garlic, oil, herbs and lime juice together in a bowl, then season, to taste, with salt and freshly ground black pepper. Set aside.", "When the barbecue coals are red hot, nail four sardines by the tail to each plank of wood. Place the pieces of wood onto the coals (or alternatively on a rack near the coals) and cook for 5-6 minutes, or until the sardines are charred and cooked through.", "To serve, place four sardines onto each serving plate. Spoon the salsa alongside."]}, {"isVegetarian": false, "title": "Barbecued langoustines in garlic and parsley marinade", "url": "www_bbc_co_uk_food_recipes_barbecuedlangoustine_91732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp olive oil", "3 tbsp white wine vinegar ", "4 garlic cloves, crushed to a paste with the edge of a knife", "small bunch parsley, leaves only, finely chopped", "salt and freshly ground black pepper ", "24 langoustines, or tiger prawns, cleaned, heads and shells removed (reserve), de-veined"], "serves": "Makes 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a bowl, mix together the oil, white wine vinegar, garlic and parsley in a bowl. Season, to taste, with salt and freshly ground black pepper. ", "Add the langoustines and reserved langoustine shells to the marinade mixture, cover and chill in the fridge for at least an hour.", "Meanwhile, light the barbecue 30 minutes before you want to eat. Soak 12 wooden skewers in water for 30 minutes, then shake off any excess water.", "When the barbecue coals are ash-white and the langoustines have marinated, thread three langoustines onto each skewer and place onto the barbecue grill. Cook, turning regularly and basting with the remaining marinade mixture, until pink and completely cooked through, then serve."]}, {"isVegetarian": false, "title": "Barbecued sirloin with chimichurri sauce", "url": "www_bbc_co_uk_food_recipes_barbecuedsirloinwith_91627", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecuedsirloinwith_91627_16x9.jpg", "ingredients": ["2-3 long red chillies, seeds removed, finely chopped", "10-12 garlic cloves, peeled, finely chopped", "2 large handfuls finely chopped curly-leaved parsley, leaves only", "4 heaped tsp dried oregano", "2 tsp sea salt flakes", "5 tbsp red wine vinegar", "4-5 tbsp extra virgin olive oil", "5 tbsp cold water", "1 x 2kg/4½lb well-hung boneless beef sirloin, not rolled (weight after bone removed)", "freshly ground black pepper"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the chimichurri sauce, place the chopped chillies and garlic into a bowl. ", "Add the remaining chimichurri sauce ingredients and stir well until combined. Cover the bowl with a sheet of cling film, then set the mixture aside for 4-6 hours to allow the flavours to infuse, or preferably overnight.", "One and a half hours before serving the meal, light the barbecue outdoors and leave the coals to heat through for one hour. ", "When the coals are white hot and the flames have died down, suspend a cooking rack 25cm/10in above the coals. ", "Season the beef sirloin all over with salt flakes and freshly ground black pepper, then place the seasoned beef sirloin, fatty-side down, onto the cooking rack. (NB: Ideally, during cooking, the barbecue should be covered with a lid and the vents should be open.)", "Sear the fatty side of the sirloin for 4-6 minutes, or until golden-brown, then turn the beef over and continue to cook for 20-25 minutes. ", "Turn the sirloin steak over again and continue to cook for a further 20 minutes (for medium), or until the sirloin is barbecued to your liking. ", "When the beef sirloin is cooked to your liking, remove it from the barbecue and set aside to rest for ten minutes, before carving into thick slices.", "To serve, arrange 2-3 slices of the barbecued beef sirloin onto serving plates and spoon over the chimicurri sauce."]}, {"isVegetarian": false, "title": "Barbecued veal chops with fresh herbs and salmoriglio", "url": "www_bbc_co_uk_food_recipes_barbecuedvealchopswi_91628", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecuedvealchopswi_91628_16x9.jpg", "ingredients": ["4 x 200g/7oz thick-cut rose veal loin chops ", "4 tbsp extra virgin olive oil ", "2 tbsp fennel seeds", "large bunch fresh sage, roughly torn ", "6-8 sprigs fresh thyme, broken into smaller lengths ", "4 large sprigs fresh rosemary, broken into smaller lengths", "2 garlic bulbs, cut in half horizontally, then broken into smaller pieces", "2 unwaxed lemons, rind peeled from the fruit in long strips", "freshly ground black pepper", "sea salt flakes", "large handful finely chopped fresh marjoram leaves", "5 tbsp extra virgin olive oil", "½ lemon, juice only, plus lemon wedges, to serve", "½ tsp sea salt flakes"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Rub the veal chops all over with the olive oil. Place them into a large, shallow dish, then sprinkle over the fennel seeds. ", "Sprinkle the sage leaves, thyme sprigs, rosemary sprigs, garlic and strips of lemon rind over the veal chops. Season, to taste, with freshly ground black pepper. ", "Cover the dish with cling film and chill in the fridge for 4-6 hours, turning the veal chops over after three hours. ", "Thirty minutes before you want to start cooking, light the barbecue outdoors.", "When the coals are white hot and the flames have died down, season the marinated veal chops with salt, then place them onto a rack set over the hot coals. Sprinkle over the herbs used in the marinade, allowing them to smoke and burn where they fall. ", "Cook the veal chops for 5-6 minutes on each side, or until charred on both sides but tender, pink and juicy inside (cut one of the veal chops open to check).", "When the veal chops are cooked to your liking, remove from the coals and set aside to rest for 4-5 minutes. ", "Meanwhile, for the salmoriglio, in a bowl, mix together the chopped marjoram, olive oil, lemon juice and sea salt flakes until well combined. Stir well and set aside for 8-10 minutes to allow the flavours to infuse.", "To serve, place one veal chop into the centre of each of four serving plates. Spoon over the salmoriglio sauce."]}, {"isVegetarian": false, "title": "Barbecue baked beans on bruschetta with bacon", "url": "www_bbc_co_uk_food_recipes_barbequebakedbeanson_84001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz baked beans", "1 garlic clove, crushed", "1 tbsp soft brown sugar", "pinch dried chilli flakes", "1 tbsp soy sauce", "4 thick slices ciabatta", "110g/4oz cheddar, cut into four slices", "55g/2oz streaky bacon, cut into strips and fried until crisp"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the beans, gently cook all of the beans ingredients in a small saucepan over a medium heat for ten minutes, stirring occasionally.", "Meanwhile, for the bruschetta, heat a griddle pan until smoking. Add the ciabatta slices and toast for two minutes on each side.", "Remove the ciabatta from the griddle and place a slice of cheese on each piece. Place onto a baking sheet and place into the oven to bake for five minutes, or until the cheese has melted.", "To serve, carefully remove the ciabatta from the oven and place onto plates. Pour over the beans and garnish with the bacon pieces."]}, {"isVegetarian": false, "title": "Barbecue belly pork", "url": "www_bbc_co_uk_food_recipes_barbeque_belly_pork_40196", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbeque_belly_pork_40196_16x9.jpg", "ingredients": ["1.5kg/3lb5oz belly of pork", "3 tbsp sea salt", "2 star anise, ground", "1 large orange, zest only", "2 fresh bay leaves", "8 garlic cloves", "1 tbsp Sichuan peppercorns", "½ tsp Chinese five-spice powder", "200ml/7fl oz olive oil", "2 tbsp sesame oil"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Make sure you or your butcher score the pork skin well (using a small, sharp kitchen knife or a clean DIY knife) - nice fine scores make better crackling. Mix the salt, ground star anise and the orange zest together and rub well into the skin, making sure the salt goes into all the cuts of the pork rind.", "Using a mini-blender or a pestle and mortar, add the bay leaves, garlic, Szechuan peppercorns, five spice and blend to a paste, then slowly add the olive oil while mixing.", "Leave the pork to dry overnight in the fridge; do not cover as you want it to dry.", "Heat a barbecue or griddle and slice the pork into thin slices. Place the pork slices onto the hot griddle or barbeque and brush with the marinade. Cook each side for a few minutes, or until cooked through and the skin is crisp."]}, {"isVegetarian": false, "title": "Pork tenderloin with crushed potatoes and mustard sauce", "url": "www_bbc_co_uk_food_recipes_barbequedporkwithcru_90713", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz pork tenderloin", "2 sprigs fresh rosemary", "salt and freshly ground black pepper", "1 tbsp olive oil", "15g/½oz butter", "8 Anya potatoes, halved", "15g/½oz butter", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper", "100ml/3½fl oz double cream", "1 tsp Dijon mustard", "1 tbsp lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pork, make two incisions in the tenderloin with the tip of a sharp knife and poke the rosemary sprigs into the holes. Season well with salt and freshly ground black pepper.", "Heat the olive oil in an ovenproof frying pan and sear the meat all over for 2-3 minutes, or until golden-brown. Add the butter to the pan, then transfer to the oven to roast for 10-12 minutes, or until the pork is cooked through. (The juices will run clear when the pork is pierced in the thickest part with a skewer.) Remove from the pan and allow to rest on a warm plate. ", "For the potatoes, cook the potatoes in a pan of boiling water for 7-8 minutes, or until tender, then drain and crush lightly, adding the butter and chives. Season, to taste, with salt and freshly ground black pepper. ", "For the sauce, place the cream into a small pan and simmer for 4-5 minutes, or until reduced by about a third in volume, then stir in the mustard and lemon juice. ", "To serve, spoon the crushed potatoes onto a serving plate. Thickly slice the pork and arrange on top of the potatoes, then spoon the sauce around the edges of the plate."]}, {"isVegetarian": true, "title": "Barmbrack parfait with whisky prunes", "url": "www_bbc_co_uk_food_recipes_barmbrack_parfait_with_87190", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz mixed dried fruit", "250ml/9fl oz cold tea", "50ml/2fl oz Irish whiskey", "knob of butter, for greasing", "225g/8oz plain flour", "2 tsp baking powder", "125g/4½oz light brown sugar", "½ tsp mixed spice", "1 large free-range egg", "2 tbsp golden caster sugar", "3 medium free-range egg yolks", "2 tbsp whole milk", "275ml/9½fl oz double cream", "¼ vanilla pod, split and seeds removed", "85g/3oz white chocolate, broken into pieces ", "2 tbsp Irish whiskey or Irish cream liqueur", "1 large orange, finely grated zest and juice", "175g/6oz caster sugar", "115g/4oz pitted prunes", "4–6 tbsp Irish whiskey"], "serves": "6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the barmbrack, put the dried fruit in a bowl and pour over the cold tea and whiskey. Cover and leave to soak overnight.", "Preheat the oven to 170C/150C Fan/Gas 3. Butter and line a 900g/2lb loaf tin.", "Put the flour, baking powder, sugar and mixed spice in a mixing bowl. Make a well in the middle and crack in the egg. Mix well using a wooden spoon. Add a little liquid from the fruit mixture and stir. Continue adding liquid and stirring until you have a wet dough – you may not need all the liquid. Drain the dried fruit and mix it into the dough until well combined.", "Spoon the dough into the prepared loaf tin and level off the top. Bake on the middle shelf of the oven for 1 hour, or until a skewer inserted comes out clean. Leave to cool in the tin slightly, then turn out onto a wire rack to cool completely.", "For the parfait, preheat the oven to 200C/180C Fan/Gas 6. Cut the crusts off the bambrack, then crumble 175g/6oz of the barmbrack into a roasting tin. Sprinkle over 1 tablespoon of sugar. Bake for 10 minutes, or until crisp, then leave to cool.", "Whisk the egg yolks with the remaining 1 tablespoon of sugar. ", "Put the milk, 85ml/3fl oz cream and the piece of vanilla pod in a heavy-bottomed saucepan and bring to the boil. Remove from the heat and pour over the yolk mixture, whisking all the time. Return the pan to the heat and cook gently until the custard coats the back of the spoon, stirring. ", "Strain the custard into a bowl through a fine sieve. Leave to cool. ", "Melt the chocolate in a heatproof bowl over a pan of gently simmering water, making sure the bowl doesn’t touch the water. Fold the melted chocolate and crumbs into the custard, cover and chill for 30 minutes.", "Whisk the remaining cream until soft peaks form. Fold the cream and whiskey into the custard mixture. Pour into six plastic see-through cups, cover and freeze for 2-3 hours, or overnight if you have the time.", "For the prunes, bring 200ml/7fl oz water to the boil in a medium saucepan. Add the orange zest and juice and the sugar and return to the boil. Add the prunes, cover and simmer for 20 minutes, or until softened. Stir in the whiskey. Set aside to cool.", "To serve, spoon the prune mixture on top of each cup and grate a little orange zest on top."]}, {"isVegetarian": true, "title": "Béarnaise sauce", "url": "www_bbc_co_uk_food_recipes_barnaise_sauce_89217", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barnaise_sauce_89217_16x9.jpg", "ingredients": ["300g/10½oz butter", "4 tbsp white wine vinegar", "4 shallots, chopped", "3 tbsp chopped fresh tarragon, plus 2 tbsp whole tarragon leaves", "salt and freshly ground black pepper", "4 free-range egg yolks", "1 tsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clarify the butter by melting it in a small, heavy-based saucepan over a low heat. When the butter is foaming, remove the pan from the heat and leave it to stand for a few minutes so that the white solids sink to the bottom of the pan. Sieve the butter through a fine sieve and discard the solids.", "Pour the vinegar into a non-reactive saucepan. Add the shallots, chopped tarragon and salt, to taste. Heat gently over a medium heat until the volume of liquid has reduced by more than half.  Strain and set aside until completely cooled.", "Lightly beat egg yolks with one teaspoon of water. Stir the egg yolk mixture into the cooled vinegar, then add the lemon juice.", "Pour the mixture into a bowl suspended over a pan of simmering water (do not allow base of the bowl to touch the water). Whisk constantly until the sauce has thickened enough to coat the back of a spoon and has increased in volume.", "Remove the bowl from the heat and slowly pour in the clarified butter in a steady stream, whisking continuously, until the mixture is thick and smooth. Fold in the tarragon leaves and season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Barnsley chops with Cumberland sauce", "url": "www_bbc_co_uk_food_recipes_barnsley_chops_with_60141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barnsley_chops_with_60141_16x9.jpg", "ingredients": ["2 tbsp chopped fresh thyme", "1 tbsp chopped fresh rosemary", "4 tbsp chopped fresh mint", "1 tsp sea salt", "freshly ground black pepper", "4 x 375g/13oz Barnsley chops", "2 tbsp sunflower oil", "1 orange, zest cut into matchsticks, juiced", "1 piece stem ginger, drained and cut into very fine strips", "50ml/2fl oz ruby port", "150g/5fl oz redcurrant jelly", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chops, mix all the herbs with the salt and plenty of freshly ground black pepper in a bowl. Place a quarter of the herb mixture onto a plate and rub into both sides of one of the chops. Repeat with the rest of the herb mixture and the remaining three chops until all are coated with the herbs. ", "For the Cumberland sauce, put the orange zest in a small saucepan, cover with 250ml/10fl oz cold water and bring to the boil for 8-10 minutes, then drain in a sieve and set aside. ", "Bring the orange juice, port, redcurrant jelly and lemon juice to a simmer in a small saucepan. Cook for 8-10 minutes over a low heat, or until the jelly dissolves. ", "Stir in the orange and ginger strips and continue simmering gently for a further 2-3 minutes until the sauce is slightly darker in colour and syrupy. Remove from the heat and leave to stand at room temperature. The sauce will continue to thicken as it cools. Serve warm or cold. (If the sauce thickens too much, add a little water and reheat gently before serving.)", "Preheat the oven to 180C/350F/Gas 4. ", "Heat the oil in a large heavy-based frying pan and fry the chops over a high heat for three minutes on each side until browned but not cooked through. ", "Prop up the chops on the fat and cook for 2-3 minutes more until the fat is browned and rendered slightly. Transfer to the chops to a baking tray and cook in the centre of the oven for a further six minutes for medium and 8-10 minutes for well done. Remove from the oven and leave to rest for five minutes before serving. ", "Put the chops on warmed plates and spoon over a little of the warm Cumberland sauce. Garnish with fresh herbs."]}, {"isVegetarian": true, "title": "Basic tomato sauce", "url": "www_bbc_co_uk_food_recipes_basic_tomato_sauce_66556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil", "4 garlic cloves, peeled, roughly chopped", "2 x 400g/14oz tins chopped tomatoes", "large handful fresh basil", "salt and freshly ground black pepper", "200g/7oz fresh penne"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the basic tomato sauce, heat the oil in a frying pan over a medium heat, add the garlic and fry for 1-2 minutes, or until softened. ", "Add the tinned tomatoes and basil and bring to the boil, then reduce the heat until the mixture is simmering and simmer for 12-15 minutes. Season, to taste, with salt and freshly ground black pepper.", "Remove two thirds of the tomato sauce from the pan and set aside to be used in another recipe (it can be frozen for up to six weeks).", "Cook the pasta in a pan of salted, boiling water until al dente, then drain well and stir it into the sauce. Warm through for a further minute, then serve."]}, {"isVegetarian": true, "title": "Basic tortellini with ricotta and pine nuts", "url": "www_bbc_co_uk_food_recipes_basic_tortellini_with_38575", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basic_tortellini_with_38575_16x9.jpg", "ingredients": ["200g/7oz ‘00’ pasta flour, plus extra for dusting", "2 free-range eggs, lightly beaten", "12 large fresh basil leaves, plus 18-20 small basil leaves, plus extra to serve", "225g/8oz buffalo-milk ricotta (or cows’ milk ricotta)", "60g/2¼oz toasted pine nuts, to serve", "grated parmesan (or a similar vegetarian hard cheese), to serve", "50g/1¾oz fresh basil leaves, chopped", "10g/¼oz toasted pine nuts", "25g/1oz parmesan, grated", "1 garlic clove, crushed", "25ml/1fl oz extra virgin olive oil", "50ml/2fl oz olive oil", "salt and freshly ground black pepper"], "serves": "Makes 20", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Blend the flour and eggs together in a food processor until the mixture resembles breadcrumbs. Turn the mixture out onto a lightly floured work surface and squash the crumbs into a ball of dough. Knead the dough for 4-5 minutes, or until smooth and elastic. Wrap the dough in cling film and chill in the fridge for 20 minutes.", "For the pesto, grind the basil, pine nuts, parmesan and garlic to a rough paste in a pestle and mortar. Gradually pour in both the oils, stirring as you add them. Season, to taste, with salt and freshly ground black pepper. Set aside, covered, until needed.", "To prepare the pasta, dust the rollers of a pasta machine with flour. Cut the chilled pasta into three pieces and flatten each out to a thickness of about 1cm/½in. ", "Set the pasta machine to its widest setting and feed one piece of dough through the machine, turning the handle with one hand and collecting the rolled dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next thickest setting, dust the rollers with a little flour, then feed the same pasta sheet through the machine again, as before. Repeat this process three or four more times, flouring the machine and changing the setting down each time, until you reach the penultimate setting. As your pasta sheet becomes longer, cut it in half so that the rolling process is more manageable. ", "Repeat the rolling process with the remaining two pieces of dough. Once all of the dough has been rolled out, you should have six long sheets of pasta. ", "To make the tortellini, place one long sheet of the pasta onto the work surface with the longest side facing you. Place two large basil leaves in the bottom half of the pasta, then fold the top half over the basil leaves. Set the pasta machine to its finest setting and pass the sheet through the machine again. Repeat the process with the remaining pasta sheets and large basil leaves.", "Cut the pasta sheets into 9cm/4in discs using a cookie cutter. Place one small basil leaf into the centre of each, and top with one teaspoonful of ricotta.", "One by one, brush the edges of each pasta disc with a little water. Bring the edges of each disc together to form a semi-circular shape, pressing the edges together with your fingertips to seal. Bring the pointed ends of the tortellini towards each other around your fingertip to form a ring, then press the corners together using your other hand. ", "Repeat the process with the remaining pasta discs, basil and ricotta; you should end up with 20 tortellini.", "Bring a large pan of salted water to the boil. Carefully lower the tortellini into the boiling water, in batches, and cook for 3-4 minutes, or until they float to the surface of the water. Remove from the pan using a slotted spoon and set aside in a bowl, keeping warm. Cook the remaining tortellini. ", "Add the pesto to the tortellini and mix gently until coated. Sprinkle over the pine nuts.", "To serve, spoon the tortellini and pesto onto serving plates. Sprinkle some grated parmesan over each and garnish with a few small basil leaves."]}, {"isVegetarian": false, "title": "How to make beef stock", "url": "www_bbc_co_uk_food_recipes_basicbeefstock_90181", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicbeefstock_90181_16x9.jpg", "ingredients": ["2-2.5kg/4lb 6oz-5lb 8oz of beef bones (rib, leg marrowbones - you can buy these from your butcher)", "3 onions, unpeeled", "1 whole head garlic", "large bouquet garni of parsley, sage and thyme", "2 leeks, cut in half", "2 carrots, cut in half", "1 stalk celery, including the leaves, roughly chopped", "2 large tomatoes, roughly chopped", "1 tsp sea salt", "1 tbsp peppercorns"], "serves": "Makes 2.5 litres/4 pints 8fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. If your butcher hasn't done so already, chop the bones into manageable pieces with a cleaver. Place the bones in a large roasting tin.", "Cut the onions in half and add them to the tray with the bones. Cut the garlic in half across the middle and add to the pan. Pour half an inch of water into the tin and roast the bones and vegetables in the oven for 40-45 minutes, topping up the water occasionally, if necessary.", "Meanwhile, place a large stockpot on the biggest hob ring. Fill with 4-5 litres/7-9 pints of cold water (about two-thirds full) and bring the water up to simmering point.", "When the water is simmering and the bones are roasted, remove the bones, onions and garlic from the oven and add them to the water, scraping in the browned bits from the tin.", "Add the bouquet garni, leeks, carrots, celery, tomatoes, salt and peppercorns.", "Gently simmer the stock, covered, for 4-6 hours, or even longer if you have time, topping up with water if necessary. Six hours will give you a good strong stock to work with.", "At the end of cooking time, strain the stock of all solid ingredients and discard them.", "To reduce the stock, pour the liquid stock back into the pot and turn the heat up to medium. Cook until the liquid is reduced by half, which will take about one hour, perhaps longer. The further you reduce the stock, the stronger and more intense it will be. The stock can be used as is, or can be reduced further or frozen for future use."]}, {"isVegetarian": false, "title": "Basic buttercream icing", "url": "www_bbc_co_uk_food_recipes_basicbuttericing_73263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicbuttericing_73263_16x9.jpg", "ingredients": ["140g/5oz butter, softened", "280g/10oz icing sugar", "1-2 tbsp milk", "few drops food colouring"], "serves": "Makes enough icing for 1 medium cake or 12 fairy cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Beat the butter in a large bowl until soft. Add half of the icing sugar and beat until smooth.", "Add the remaining icing sugar and one tablespoon of the milk and beat the mixture until creamy and smooth. Beat in the milk, if necessary, to loosen the mixture.", "Stir in the food colouring until well combined."]}, {"isVegetarian": true, "title": "Raymond Blanc's chocolate mousse", "url": "www_bbc_co_uk_food_recipes_basicchocolatemousse_93648", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicchocolatemousse_93648_16x9.jpg", "ingredients": ["170g/6oz good-quality dark chocolate, minimum 60 per cent cocoa solids, roughly chopped (dairy free, if necessary)", "7 free-range egg whites (use pasteurised egg white in a carton if you have any concerns about raw egg)", "¼ tsp lemon juice", "40g/1½oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the chocolate in a heatproof bowl set over a pan of simmering water (do not allow the base of the bowl to touch the water). ", "Whisk the egg whites and lemon juice in a large, clean bowl until they form soft peaks. The lemon juice will stabilise the egg whites, make them easier to work with and help to prevent over-whisking.", "Add the sugar and continue to whisk until firm peaks form when the whisk is removed. Do not whisk beyond this stage - the egg whites will start to collapse and separate into dry froth and runny liquid, and you'll lose all the air that you've whisked in.", "When the chocolate has melted, remove the bowl from the heat. Whisk one-third of the egg whites into the hot chocolate quickly and vigorously, until thick and well combined - if you add the egg whites in too slowly, their cold temperature  can make the hot chocolate seize, solidify and result in a lumpy mousse. ", "Fold the remaining egg whites into the chocolate mixture, using a spatula, until all of the egg white has been completely incorporated into the chocolate. Don't overmix at this stage as you'll knock out the air bubbles and the mousse will be dense. ", "Spoon the mousse mixture into four Martini glasses. Chill in the fridge for 2-3 hours, or until set. ", "Alternatively, use the mousse to make a hot chocolate soup. Preheat the oven to 180C/350F/Gas 4. Divide the mousse among four small ovenproof pudding bowls or ramekins. Place the pudding bowls into the oven and bake the chocolate mousses for 3-5 minutes, or until puffed slightly and warmed through."]}, {"isVegetarian": true, "title": "How to cook Chinese sticky rice", "url": "www_bbc_co_uk_food_recipes_basicglutinousrice_89293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz washed glutinous rice", "500ml/18fl oz water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a pan, add the rice and water, cover and cook on high heat for 15 minutes. ", "Turn the heat to low and simmer the rice for a further 3-4 minutes, making sure all the water has been absorbed and the rice is tender. ", "Take off the heat and, using a spatula, fluff up the rice grains. Serve."]}, {"isVegetarian": true, "title": "Basic muesli", "url": "www_bbc_co_uk_food_recipes_basicmuesli_67724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz jumbo porridge oats", "25g/1oz flaked bran or wheat germ", "75g/3oz barley or rye flakes (optional, you can always add more oats instead)", "50g/2oz hazelnuts, lightly crushed", "50g/2oz flaked almonds", "50g/2oz sultanas", "50g/2oz dried, ready-to-eat apricots, roughly chopped", "50g/2oz dried, ready-to-eat figs, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.", "Place the oats, flaked bran or wheat germ, barley or rye flakes, hazelnuts and almonds on a large baking tray and toast in the oven for 10 minutes, shaking and turning in the tray halfway through. Take the tray from the oven and leave to cool: this should take only about 10 minutes. ", "Mix the toasted ingredients with the sultanas, apricots and figs. These fruits are only suggestions: you can use whatever you prefer, for example dried apple, mango, papaya, dates or cherries. ", "You can eat this muesli straight away with milk or yoghurt, or you can store in an airtight container."]}]