[{"ingredients": ["1 cucharada de bayas de enebro", "4 perdices listas para el horno", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 cucharada de aceite de girasol", "1 cebolla mediana, finamente rebanada", "4 lonchas de tocino rayado sin corteza, cortadas en rodajas de 2cm / 1 in", "3-4 ramitas espesas tomillo fresco", "2 cucharadas de harina normal", "5 cucharadas de ginebra seca", "100ml / 3½fl oz de jugo de naranja (alrededor de 1 naranja grande)", "200ml / 7fl oz de vino tinto", "350ml / 12fl oz de caldo de pollo, fresco o hecho con 1 cubo de caldo", "2 cucharadas de salsa de arándanos o gelatina de grosella", "2 cucharaditas de ralladura de naranja finamente rallada", "200g / 7oz de castañas cocidas y peladas, reducidas a la mitad", "½ repollo Savoy medio, hojas exteriores duras retiradas"], "method": ["Pon las semillas de enebro en un mortero y machaca hasta que se aplasten. Espolvoree las semillas de enebro sobre todas las perdices, presionando ligeramente sobre la piel y sazone con sal y pimienta negra recién molida.", "Derrita la mantequilla con el aceite en una cacerola a prueba de llamas grande o su cacerola más grande a fuego medio. Agregue las perdices a la cazuela, con la pechuga hacia abajo y fríe durante 1-2 minutos, o hasta que estén bien doradas. Gire y fríe en cada uno de los tres lados restantes por un minuto más hasta que se dore por todas partes. Retire de la cazuela y ponga en un plato.", "Reduzca el fuego y agregue la cebolla, el tocino y el tomillo a la cazuela. Freír suavemente durante 5-6 minutos, o hasta que las cebollas estén blandas y el tocino comience a dorarse, revolviendo regularmente.", "Espolvorea la harina en la sartén y revuelve bien. Cocine durante unos cinco minutos, luego agregue la ginebra y el jugo de naranja y la burbuja durante unos segundos antes de revolver lentamente en el caldo de vino y pollo. Coloque la salsa de arándanos rojos o la mermelada de grosella roja en la parte superior, agregue la ralladura de naranja y las castañas y cocine a fuego lento, revolviendo constantemente. Suavemente devuelva las perdices a la sartén y cubra con una tapa. Cocine a fuego lento durante 30 minutos.", "Corte la col en cuatro cuñas y retire el núcleo central duro. Retire la cazuela del fuego y dé vuelta las perdices. Coloque la col entre las aves, cúbrala y continúe cocinando por otros 30-40 minutos, o hasta que las aves estén tiernas, la col se haya ablandado y la salsa se haya espesado. Elija los tallos de tomillo y ajuste el condimento al gusto."], "url": "www_bbc_co_uk_food_recipes_one_pot_partridge_with_69897", "title": "Una olla de perdiz con tocino y castañas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.25kg / 2lb 11oz calabaza pelada, cortada en trozos pequeños", "½ gran barra de canela", "1 nuez moscada pequeña pieza", "4 dientes", "¼ cucharadita de maceta de tierra", "375 g / 13 oz de azúcar en polvo", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "Recortes de carne de res 90 g / 3½ oz (de los filetes, ver a continuación - puede que tenga que pedirle a su carnicero grasa adicional)", "3 chalotes de plátano, pelados, finamente picados", "¼ de bulbo de ajo", "2 ramitas de tomillo fresco", "1 hoja de laurel fresca", "½ cucharadita de granos de pimienta blanca", "pizca de sal", "Brandy 25ml / 1fl oz", "150ml / 5fl oz de vinagre de jerez", "750ml / 1 pinta 7fl oz de vino tinto", "500ml / 18fl oz de caldo de pollo", "500ml / 18fl oz de carne de ternera o de res", "sal y pimienta negra recién molida", "3 cucharadas de perejil de flatleaf fresco picado", "3 cucharadas de alcaparras finas, escurridas y enjuagadas, finamente picadas", "1 kg / 2lb 2 oz de grasa de res picada", "1 bulbo de ajo", "6 ramitas de tomillo fresco", "4 hojas frescas de laurel", "Papas enteras de Ratte (o Asparges) de 300 g / 11 oz, o papas cerosas pequeñas y similares, piel que queda, limpiada", "sal y pimienta negra recién molida", "110g / 4oz de mantequilla", "250 g / 9 oz de hongos girolle, preferiblemente escoceses, limpios, con tallos raspados limpios y enjuagados sin suciedad", "Setas trompette de la mort 250g / 9oz, limpiadas y enjuagadas sin suciedad", "Col rizada de 500g / 1lb 2oz, tallos eliminados", "sal y pimienta negra recién molida", "1 cucharadita de aceite de oliva", "4 x 250 g / 9 oz 35 filetes de onglet de edad, recortados", "sal y pimienta negra recién molida"], "method": ["Para la mermelada de calabaza, traiga una pequeña cantidad de agua a fuego lento en el fondo de una sartén. Suspender una canasta humeante sobre el agua. (NB: No permita que la base de la canasta de vapor toque el agua).", "Coloque las piezas de calabaza en la cesta de cocción al vapor y cubra la olla con una tapa. Cueza al vapor la calabaza durante 10-15 minutos, o hasta que esté tierna.", "Transfiera la calabaza al vapor a un procesador de alimentos y mezcle hasta que quede completamente lisa.", "Mientras tanto, muela la canela, la nuez moscada, el clavo de olor y la macis en polvo en un molinillo de especias o usando un mortero.", "Vierta la calabaza en una sartén, agregue el azúcar y muela las especias. Cocine a fuego lento, revolviendo regularmente, durante 1¼-1½ horas, o hasta que la mezcla se espese a la consistencia del atasco.", "Retire la mermelada de calabaza del calor y la temporada, al gusto, con sal y pimienta negra recién molida. Enfriar en la nevera hasta que sea necesario.", "Mientras tanto, para la salsa de carne, caliente una sartén no reactiva a fuego medio. Cuando la sartén esté caliente, agregue la mantequilla y, cuando se derrita, agregue los restos de carne. Freír los cortes de carne durante 8-10 minutos o hasta que se doren por todos lados.", "Agregue dos tercios de los chalotes picados y todo el ajo, el tomillo, la hoja de laurel, los granos de pimienta blanca y una pizca de sal. Continúe cocinando por 2-3 minutos, o hasta que la cebolla esté dorada y caramelizada.", "Agregue el brandy y enciéndalo con un fósforo. (PRECAUCIÓN: Mantenga la ropa bien limpia y mantenga las llamas lejos de los ojos y la cara). Deje que las llamas se inflaman y luego se apaguen. Revuelva bien, raspando cualquier trozo dorado del fondo de la sartén para desglasar. Deje que el líquido hierva a fuego lento y continúe cocinando a fuego lento hasta que el volumen de líquido se haya reducido casi por completo.", "Agregue el vinagre de Jerez y vuelva la mezcla a fuego lento, raspando cualquier trozo dorado del fondo de la sartén para desglasar nuevamente. Continúe cocinando a fuego lento la mezcla hasta que el volumen del líquido se haya reducido en dos tercios.", "Agregue el vino tinto y vuelva la mezcla a fuego lento. Continúe cocinando a fuego lento la mezcla hasta que el volumen del líquido se haya reducido en dos tercios.", "Agregue los caldos de pollo y ternera o carne de res, mezcle bien y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante 20-30 minutos, o hasta que la mezcla se haya espesado.", "Cuele la mezcla de salsa de carne a través de un paño de muselina en una olla limpia, luego regrese el líquido filtrado al fuego y cocine a fuego lento. Continúe cocinando a fuego lento hasta que la mezcla esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara, luego vuelva a colar.", "Sazone la salsa, al gusto, con sal y pimienta negra recién molida, luego agregue la chalota picada, el perejil y las alcaparras.", "Mientras tanto, para las papas, coloque la grasa de res, el bulbo de ajo, las ramitas de tomillo y las hojas de laurel en una sartén profunda a fuego medio y cocine hasta que la grasa se haya derretido por completo.", "Agregue las papas (deben cubrirse con grasa líquida), luego reduzca el fuego hasta que la temperatura de la grasa sea de 100 ° C (use un termómetro para cocinar para verificar la temperatura). Continúe cocinando durante 20-25 minutos, o hasta que las papas estén tiernas.", "Retire las papas de la grasa con una espumadera y déjelas a un lado para escurrirlas sobre papel de cocina. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para los champiñones y la col rizada, caliente una sartén a fuego medio. Agregue la mitad de la mantequilla y, cuando la mantequilla se haya derretido, agregue los hongos girolle y trompette de la mort y fríalos por 2-3 minutos.", "Cocine las hojas de col rizada en una sartén de agua hirviendo con sal durante 1-2 minutos, o hasta que estén tiernas, luego escurra bien.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla restante. Cuando la mantequilla esté espumosa, agregue la col rizada hervida y fría por otros 1-2 minutos, o hasta que se marchite.", "Retirar del fuego y sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para los filetes de onglet, frota los filetes con un poco de aceite de oliva. Sazonar, al gusto, sal y pimienta negra recién molida.", "Caliente una sartén a fuego alto. Cuando la sartén esté caliente, coloque los filetes en la plancha y cocine durante 2-3 minutos por cada lado (para raros), o hasta que se cocinen a su gusto. Retirar de la sartén y dejar reposar durante 2 o 3 minutos.", "Para servir, talle cada bistec en dos pedazos y colóquelos en el centro de cada uno de los cuatro platos para servir. Coloque una cucharada de mermelada de calabaza fría a cada lado del filete. Coloca un poco de la col rizada marchita en la parte superior de cada bistec, luego echa una cuchara sobre los champiñones. Coloque tres o cuatro papas al lado. Rocíe la salsa de carne."], "url": "www_bbc_co_uk_food_recipes_ongletsteakswithpump_92614", "title": "Filetes de bistec con mermelada de calabaza, patatas Ratte y setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "4 filetes de onglet de 4 x 175 g / 6 onzas, recortados", "4 huesos de médula, reducidos a la mitad horizontalmente", "4 huevos de gallinas camperas", "Patatas bermejas de 600 g / 1 lb 5 oz, ralladas", "1 cucharada de harina normal", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de hojas de tomillo finamente picadas", "1 cucharadita de hojas de romero finamente picadas", "sal marina y pimienta negra", "50 g / 1¾oz de mantequilla sin sal, para freír", "2 cucharadas de aceite de colza, para freír"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6. Derrita la mantequilla en una sartén. Retire del fuego, agregue los filetes, cubra y deje a temperatura ambiente durante 30 minutos.", "Coloque los huesos de médula en una lata para asar y tápelos durante 20-25 minutos. Apague el horno y déjelos adentro para mantener el calor.", "Mientras tanto, para los latkes, ponga las papas ralladas en una toalla de té limpia y exprima la mayor cantidad de líquido posible. Póngalos en un tazón con harina, huevo y hierbas y sazone con sal y pimienta. Forme cuatro empanadas grandes y delgadas (no las haga demasiado gruesas o estarán crudas en el medio).", "Caliente la mantequilla y el aceite en una sartén grande a fuego medio. Freír los latkes en ambos lados hasta que estén dorados. Escurrir sobre papel de cocina.", "Caliente una plancha de hierro fundido de base pesada hasta que se humee. Levante los filetes de onglet de la mantequilla y seque el exceso de grasa con papel de cocina (reserve la mantequilla de bistec). Sazone los filetes con sal y pimienta. Escúrralos por 2 minutos en cada lado, luego transfiérelos a un tablero y déjalo reposar en un lugar cálido.", "Caliente la mantequilla de carne en su sartén y úsela para freír los huevos. Condimentar con sal y pimienta.", "Para servir, divida los filetes, latkes y médula ósea entre cuatro platos para servir y cubra con los huevos."], "url": "www_bbc_co_uk_food_recipes_onglet_and_latkes_72417", "title": "Onglet y latkes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tomates maduros de 1 kg / 2¼ lb, tallos cortados, corte transversal en la parte inferior de cada uno con un cuchillo afilado", "100-150ml / 3½-5fl oz de aceite de oliva", "4 chalotes grandes, pelados, finamente picados", "4 dientes de ajo, triturados hasta formar una pasta", "ramita de tomillo fresco, solo hojas", "2 cucharadas de aceite de oliva", "1 cabeza de hinojo, picada", "2 zanahorias, peladas, picadas", "1 pimiento rojo, picado", "4 dientes de ajo, pelados, picados", "1 cebolla, pelada, picada", "pizca de copos de chile seco", "175ml / 6fl oz de vino tinto", "1½ cucharadita de pimentón ahumado", "Carne picada de cerdo 750g / 1½lb", "1 cucharadita de semillas de hinojo trituradas", "2 cucharaditas de comino molido", "2 chorizos medianos de cocina, picados", "1 x 400g / 14fl oz de alubias blancas enlatadas (como judías o alubias), escurridas, enjuagadas"], "method": ["Para la salsa de tomate, ponga a hervir una olla de agua. Baje los tomates en agua hirviendo y hiérvalos durante diez segundos, luego retírelos de la sartén con una espumadera e inmediatamente sumérjalos en un recipiente con agua helada.", "Cuando los tomates se hayan enfriado, pele y deseche las pieles. Pique los tomates y deseche las semillas. (Alternativamente, congele las semillas y úselas en caldos y salsas). Continúe cortando la pulpa del tomate.", "Caliente la mitad del aceite de oliva en una cacerola a fuego medio. Agregue los chalotes, las hojas de tomillo y el ajo y fría por 2-3 minutos, o hasta que estén suaves pero no coloreados.", "Agregue el aceite de oliva restante y la pulpa de tomate picada, luego revuelva bien para combinar.", "Corte un disco de papel a prueba de grasa de 1 cm / ½ en un tamaño inferior al diámetro de su cacerola. Cubra la superficie de la salsa de tomate con el disco de papel resistente a las grasas (esto evitará que la salsa se seque, ya que se reduce y se cocina). Reduzca el fuego a su nivel más bajo y cocine suavemente durante al menos una hora, o hasta que la salsa se espese.", "Cuando la mezcla se haya cocinado y espesado, reserve. (NB: Cualquier salsa que no use en esta receta puede dejarse enfriar, luego dividir en porciones y congelar hasta que se necesite).", "Para el estofado, caliente una cucharada de aceite en una cazuela a fuego medio. Agregue el hinojo, las zanahorias, la pimienta, el ajo, la cebolla y el chile seco, y fría, revolviendo regularmente, durante 6-8 minutos, o hasta que estén suaves pero no coloreados.", "Agregue el vino tinto y lleve la mezcla a fuego lento.", "Agregue la salsa de tomate y el pimentón ahumado y vuelva a hervir a fuego lento. Cubra la olla y cocine a fuego lento durante 8-10 minutos, o hasta que el volumen del líquido se haya reducido y la salsa se haya espesado.", "En un tazón, mezcla la carne picada de cerdo, las semillas de hinojo trituradas y el comino molido, con las manos.", "Pellizque piezas de la mezcla del tamaño de bolas de ping-pong y rodar en bolas.", "Caliente la cucharada restante de aceite de oliva en una sartén separada a fuego medio. Agregue las albóndigas, en tandas, y fría por 2-3 minutos, volteándolas regularmente, hasta que se doren por todas partes. Repita el proceso con las albóndigas restantes.", "Agregue las albóndigas doradas y el chorizo ​​picado a la mezcla de guiso de tomate. Continúe cocinando a fuego lento, sin tapar, durante 25-30 minutos, o hasta que la salsa se haya reducido y espesado.", "Agregue los frijoles blancos y caliente durante 1-2 minutos más.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_onepottomatostewwith_92187", "title": "Estofado de tomate a una olla con albóndigas de carne de cerdo, chorizo ​​y alubias blancas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 litros / 3½ pintas de caldo de pollo", "huesos de ternera, ligeramente asados", "1 cebolla, más o menos picada", "1 zanahoria, partida a la mitad", "1 palo de apio, reducido a la mitad", "4 cebollas grandes, más o menos picadas", "40 g / 1½ oz de mantequilla", "100ml / 3½fl oz de vino blanco", "1 cucharada de harina normal", "1 papa grande, picada", "Col negra de col 250g / 9oz", "75g / 2½oz de queso azul", "Queso Gruyère de 75 g / 2½ oz, finamente rallado", "1 baguette"], "method": ["Poner el caldo en una sartén grande con los huesos de carne, una cebolla, la zanahoria y el apio. Cocine a fuego lento con la tapa puesta durante dos horas. Cuele el caldo a través de un tamiz fino y colóquelo a un lado.", "En una sartén grande, cocine las cuatro cebollas grandes picadas en la mantequilla a fuego lento hasta que comiencen a caramelizar (unos 15 minutos). Agregue un tercio del vino blanco y desglasifique la sartén revolviendo la parte inferior para aflojar toda la cebolla dorada.", "Permita que las cebollas se caramelicen de nuevo y luego glasear con otro tercio de vino blanco. Repita este proceso usando el vino y hasta que las cebollas estén realmente blandas.", "Agregue la harina y cocine por un minuto, antes de agregar 1.5 litros / 2½ pintas del caldo. Revuelva bien, agregue la papa y cocine a fuego lento durante 40 minutos.", "Retire la sopa del fuego, deje que se enfríe un poco y luego mezcle con una licuadora de mano hasta que quede suave. Verifique la consistencia, y si parece demasiado grueso, agregue un poco más de caldo o agua.", "Blanquee el cavolo nero en una sartén del caldo hirviendo restante. Vierta este caldo y repollo en la sopa.", "Mezcle los quesos en un tazón pequeño y precaliente una parrilla a fuego.", "Cortar la baguette en rodajas finas y luego tostadas en ambos lados. Sirva la sopa en tazones y cubra con una rebanada de baguette con la mezcla de queso rociada. Coloque debajo de una parrilla caliente hasta que el queso burbujee."], "url": "www_bbc_co_uk_food_recipes_onion_and_cavalo_nero_42439", "title": "Sopa de cebolla y cavolo nero con costra de queso azul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de harina natural, más un poco extra para quitar el polvo", "pizca de sal", "50 g / 1¾oz de mantequilla fría, cortada en trozos pequeños", "50g / 1¾oz de mantequilla", "750 g / 1 libra de cebollas de 10 oz, peladas y finamente cortadas", "3 ramitas de tomillo fresco, solo hojas", "2 huevos de gallinas camperas, golpeados", "100ml / 3½ fl oz crema doble", "sal y pimienta recién molida"], "method": ["Para la masa, tamizar la harina en un recipiente para mezclar y agregar una pizca de sal. Agregue la mantequilla y frote con la punta de los dedos hasta que la mezcla se asemeje a pan rallado y toda la mantequilla se combina.", "Agregue una o dos cucharadas de agua y mezcle para juntar la mezcla como una masa. Si parece demasiado seco agregue otra cucharada de agua. Forma una bola y aplástala en un disco, envuélvela en papel film y déjala reposar en la nevera durante media hora.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, caliente una sartén grande o una sartén a fuego medio. Agregue la mantequilla y, una vez derretida, mezcle las cebollas con una pizca de sal. Reduzca el fuego a medio bajo y cocine las cebollas durante 20-30 minutos, o hasta que estén doradas y completamente blandas. Revuelva con frecuencia y asegúrese de que no se queme ni pegue al fondo de la sartén. Revuelva en el tomillo.", "Retire la masa de la nevera y extiéndala hasta obtener el grosor de una moneda de 1 £. Engrase una lata agria de 20cm / 8in o 23cm / 9in con mantequilla y forre la lata con la masa, presionándola en los bordes. Coloque en el horno precalentado y hornee durante 10 minutos. Retire, cepille la base y los bordes interiores con un poco del huevo batido, vuelva a colocar en el horno durante cinco minutos y luego retírelo.", "Mezcle el huevo batido restante con la crema y las cebollas cocidas. Sazonar con una pizca de sal y pimienta. Coloque la mezcla de cebolla en la caja de la torta y extiéndala de manera uniforme.", "Vuelva a colocar en el horno precalentado y cocine durante 30-35 minutos, o hasta que se establezca el relleno, pero con un ligero bamboleo cuando se golpea. Retire del horno y deje enfriar durante 10 minutos antes de cortar en rodajas y servir. Esto también es delicioso frío."], "url": "www_bbc_co_uk_food_recipes_onion_and_thyme_tart_25588", "title": "Cebolla y tarta de tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco sin blanquear, más extra para espolvorear", "1 cucharadita de sal", "2 cucharaditas de levadura seca", "300ml / 10fl oz de agua tibia", "4 cucharadas de mermelada de cebolla"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Ponga la harina, la sal y la levadura en un mezclador con un accesorio de gancho de masa y mezcle. Poco a poco agregue el agua hasta que se forme una masa y amasar en el procesador de 5 a 8 minutos.", "Dejar crecer durante al menos una hora. Luego tira la masa hacia atrás y amasa la mermelada.", "Engrase 8 macetas de arcilla limpias con mantequilla y cúbralas con pergamino para hornear. Divide la masa en 8 piezas y colócala en las macetas. Deje probar nuevamente por 30 minutos.", "Coloque las macetas en una bandeja para hornear y hornee por 10-15 minutos, o hasta que estén doradas y cocidas."], "url": "www_bbc_co_uk_food_recipes_onion_marmalade_bread_34888", "title": "Panecillos de mermelada de cebolla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 8 panecillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jengibre de raíz 30g / 1oz, pelado", "30 g / 1 oz de dientes de ajo, pelados", "2 cucharadas de aceite vegetal", "2 cardamomo negro", "10 granos de pimienta negra", "3 dientes", "4 cardamomo verde", "2 cucharaditas de semillas de comino", "2 palitos de canela", "1 hoja de laurel", "500 g / 1 libra de cebollas de 2 oz, picadas", "1 cucharada de pasta de ajo y jengibre (desde arriba)", "1 cucharadita de cúrcuma molida", "½ cucharadita de chile rojo en polvo", "1 cucharada de cilantro molido", "1 cucharadita de sal masala", "sal al gusto", "2 cucharadas de puré de tomate"], "method": ["Primero prepara la pasta de ajo y jengibre. Mezcle el jengibre y el ajo con una cucharadita de agua en una licuadora. Guarde cualquiera que no use para esta receta en el refrigerador.", "Para hacer la salsa de masala, caliente el aceite en una sartén grande. Agregue las especias enteras (cardamomo negro, granos de pimienta, clavo de olor, cardamomo verde, semillas de comino, canela y laurel) y fría hasta que empiecen a crujir, luego agregue las cebollas.", "Cocine las cebollas suavemente y lentamente hasta que estén caramelizadas y muy marrón oscuro.", "Agregue una cucharada de pasta de ajo y jengibre y fríe suavemente durante 3-4 minutos. Pruebe para asegurarse de que el jengibre y el ajo estén bien cocidos, de lo contrario su sabor será demasiado fuerte.", "Agregue todas las especias en polvo y mezcle bien.", "Agregue 100-150 ml / 3½-5 fl oz de agua si la salsa es demasiado espesa.", "Finalmente agregue el puré de tomate y cocine hasta que el aceite salga a la superficie de la salsa."], "url": "www_bbc_co_uk_food_recipes_onion_masala_sauce_45651", "title": "Salsa de masala de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace aproximadamente 500 g / 1lb 2oz de salsa", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1kg / 2lb 4 oz cebollas, finamente cortadas", "sal y pimienta negra", "1 cucharada de harina normal", "1.2 litros / 2 litros de caldo (idealmente carne pero pollo o vegetales también estarían bien)", "1 baguette, cortado en rebanadas de 1cm / ½", "Queso Gruyère 150g / 5½oz, rallado"], "method": ["Caliente una cacerola grande a fuego alto, agregue la mantequilla y derrita sin dorar. Agregue las cebollas y fría con cuidado durante cinco minutos, revolviendo con frecuencia. Sazonar con media cucharadita de sal y un par de pizcas de pimienta.", "Continúe cocinando las cebollas a fuego medio durante 20-30 minutos, o hasta que tengan un color caramelo marrón rico y uniforme. Revuelva cada 2-3 minutos para que no se quemen. ¡Se paciente! Tomará aproximadamente 20 minutos obtener las cebollas del color que dará el mejor sabor a la sopa. Una vez cocido, revuelva la harina en las cebollas caramelizadas y mezcle bien.", "Agregue 200ml / 7fl oz de caldo y bata bien para crear una salsa espesa y raspe cualquier trozo pegajoso del fondo de la sartén. Agregue el material restante, batiendo mientras lo agrega y lleve a ebullición, eliminando cualquier espuma en la superficie. Luego reduzca el fuego y cocine a fuego lento durante 15 minutos. Pruebe y sazone con sal y pimienta según sea necesario.", "Mientras tanto, caliente la parrilla a fuego. Coloque la baguette rebanada en una bandeja para hornear y espolvoree dos tercios del queso rallado sobre ellos. Coloque debajo de la parrilla caliente durante 3-4 minutos, o hasta que el queso se derrita y se dore.", "Sirva la sopa caliente en un tazón con los crotones de Gruyère flotando en la parte superior. Espolvoree sobre el gruyere restante y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_onion_soup_with_gruyere_53281", "title": "Sopa de cebolla con crutones de Gruyère", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de aceite vegetal, para freír", "150g / 5½oz de queso de cabra, rebanado en una ronda", "1 cebolla roja, pelada y rebanada en una ronda", "4 cucharadas de harina de auto crianza", "sal y pimienta negra recién molida", "agua mineral carbonatada", "½ repollo rojo, finamente picado", "1 cucharada de vinagre balsámico", "1 puñado de perejil fresco, picado", "1 diente de ajo, picado", "1 cucharada de aceite de oliva", "2 cucharadas de vino tinto", "1 cucharadita calvados", "sal y pimienta negra recién molida"], "method": ["Para los buñuelos, vierta el aceite vegetal en una cacerola grande de fondo grueso o freidora y caliente hasta que la miga de pan chisporrotee y se ponga dorada cuando se agregue (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Coloque una rodaja de queso de cabra encima de una rodaja de cebolla y luego coloque otra rodaja de cebolla sobre el queso. Presione juntos bien para asegurar la pila. Repita este proceso con el resto del queso de cabra y las rodajas de cebolla, hasta que tenga dos pilas.", "Tamiza la harina en un tazón grande. Agregue la sal y la pimienta negra recién molida y bata gradualmente en el agua con gas hasta que la mezcla se haya convertido en un batido suave con la consistencia de la crema doble. Deja descansar durante cinco minutos.", "Sumerja los trozos de queso y cebolla de las cabras en la mezcla y sacuda el exceso de masa. Agregue al aceite caliente y cocine durante seis minutos, o hasta que estén doradas. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Para la col roja marinada, coloque todos los ingredientes de la col en un recipiente grande y limpio y, si es posible, déjelos reposar toda la noche, o durante al menos quince minutos, para marinar.", "Para servir, coloque una pequeña pila de repollo marinado en dos platos limpios y coloque un queso de cabra y un buñuelo de cebolla encima de cada montón."], "url": "www_bbc_co_uk_food_recipes_onionandgoatscheeses_84610", "title": "Buñuelos de queso de cebolla y cabra con col roja marinada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "3 cebollas en rodajas", "Harina normal de 120g / 4oz", "1 cucharadita de cilantro molido", "1 cucharadita de semillas de comino", "3 cucharadas de aceite vegetal, más extra si es necesario"], "method": ["Batir los huevos en un tazón.", "Agregue los aros de cebolla y mezcle bien.", "Agregue la harina, el cilantro molido y las semillas de comino y revuelva bien para combinar.", "Caliente el aceite en una sartén profunda a fuego medio. Cuando esté caliente agregue una cucharada grande de la mezcla de bhaji y fría por 30-45 segundos, hasta que se dore.", "Dale la vuelta al bhaji y fríe por otros 30 segundos, hasta que esté crujiente y dorado por todas partes. Retire y escurra sobre papel de cocina.", "Repita con la mezcla de bhaji restante, reponiendo el aceite en la sartén si se agota y permitiendo que se caliente nuevamente después de una nueva adición."], "url": "www_bbc_co_uk_food_recipes_onionbhaji_85976", "title": "Cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/onionbhaji_85976_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de cebolla blanca picada", "25 g / 1 oz de espinaca, picada", "35 g / 1¼ oz de harina de gramo", "1 cucharadita de jengibre fresco en raíz, finamente cortado en cubitos", "1 cucharadita de semillas de cilantro, tostadas y molidas", "½ chile verde, sin semilla y finamente cortado en cubitos", "pizca de sal", "pellizcar ají rojo en polvo", "pizca de cúrcuma", "aceite de girasol, para freír", "chaat masala, para servir (una mezcla de especias molidas disponible de muchos tenderos asiáticos - opcional)"], "method": ["Mezcle la cebolla, la espinaca, la harina de gramo, el jengibre, las semillas de cilantro molidas y el chile verde junto con suficiente agua para unirlo a una mezcla espesa de masa.", "Agregue la sal, el chile en polvo y la cúrcuma y mezcle bien.", "Caliente el aceite de girasol en un wok para freír. El aceite debe venir a unos 2,5 cm (1 pulgada) por los lados del wok.", "Con cuidado, vierta un poco de la mezcla de bhaji en el aceite caliente para comprobar si está lo suficientemente caliente.", "Cuando esté listo, coloque cantidades de la mezcla en el aceite. Reduce el fuego y freír suavemente hasta que adquiera un color dorado.", "Retirar del aceite y escurrir sobre papel de cocina.", "Aumente el calor del aceite y devuelva los bhajis cocidos al wok y fríalos por segunda vez hasta que estén crujientes y dorados.", "Espolvoree con chaat masala, si lo desea, y sirva."], "url": "www_bbc_co_uk_food_recipes_onionbhajis_77149", "title": "Bhajis de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de maní o vegetal", "5 dientes de ajo, pelados, en rodajas", "1 cucharadita de semillas de especias mezcladas (como semillas de mostaza, semillas de comino, semillas de cilantro y vainas de cardamomo)", "250 g / 9 oz de arvejas secas, amarillas o verdes", "750ml / 1¼ pintas de agua", "150ml / 5fl oz yogur griego", "75 g / 2¾ oz de harina de gramo (besan) o harina normal, más 2 cucharadas extra, para quitar el polvo", "½ cucharadita de comino molido", "½ cucharadita de sal masala", "pizca de sal", "1-2 chiles rojos o verdes, finamente rebanados", "1 cebolla blanca grande, en rodajas", "30g / 1oz de cilantro, solo hojas, lavado y picado", "1 lima, solo jugo", "¾ cucharadita de cúrcuma molida", "1 litro / 1¾ pintas de aceite de girasol", "2 cucharadas de mantequilla", "80g / 3oz de almendras en copos", "350g / ¾lb de arroz basmati", "500ml / 17fl oz de agua", "yogur natural o de estilo griego", "chutney de mango listo para usar", "4 ramitas de cilantro fresco"], "method": ["Para el tarka dhal, caliente el aceite en una cacerola mediana de base pesada a fuego medio a bajo. Agregue las semillas de ajo y especias y freír durante 4-5 minutos, o hasta que estén doradas. (PRECAUCIÓN: Las semillas de especias pueden explotar durante la cocción. Cubra la bandeja con una tapa y mantenga los ojos y la cara alejados).", "Agregue los guisantes partidos y revuelva bien para cubrirlos en aceite y especias.", "Verter sobre el agua y llevar a ebullición, quitando espuma blanca de la parte superior del líquido a intervalos.", "Cuando el agua esté hirviendo, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cubra la sartén y continúe cocinando a fuego lento durante 35-45 minutos, revolviendo ocasionalmente, hasta que los guisantes estén tiernos y hayan absorbido toda el agua.", "Mientras tanto, para la cebolla bhajis, en un tazón grande, mezcle el yogur, el gramo o la harina común, el comino molido, el garam masala y la sal. Agregue tres cucharadas de agua y revuelva hasta que esté suave y bien combinado. Reserve para descansar por 15 minutos.", "Cuando la mezcla de bhaji haya descansado, agregue los chiles, la cebolla, el cilantro, el jugo de lima y la cúrcuma molida hasta que estén bien combinados. Reserve por otros 15 minutos.", "Mientras tanto, para el arroz almendrado, mida el arroz en una jarra medidora y tome nota del volumen; necesitará el doble de esta cantidad de agua para cocinar el arroz.", "Calentar la mantequilla en una sartén a fuego lento. Cuando la mantequilla se haya derretido, agregue las almendras y fríaselas suavemente durante 2-3 minutos, o hasta que estén pálidas doradas.", "Agregue el arroz y luego vierta sobre el agua. Cubra y traiga la mezcla a fuego lento.", "Reduzca el fuego a fuego lento, cubra con la tapa y continúe cocinando durante 8-10 minutos. Apague el fuego y deje que el arroz hierva al vapor sobre el calor residual por otros 4-5 minutos, luego esponje los granos con un tenedor antes de servir.", "Para los bhajis, caliente el aceite en una sartén profunda de base gruesa o en una freidora hasta que la migas de pan chisporrotee y se ponga dorada cuando se la deje caer.", "Usando una cucharada de postres, baje las cucharadas de la mezcla de bhaji en el aceite caliente en tandas de cuatro. Freír durante 3-4 minutos en cada lado, o hasta que estén crujientes y doradas por ambos lados y cocidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Mantener caliente", "Repita el proceso con la masa bhaji restante hasta que tenga doce bhajis.", "Cuando el tarka dhal esté listo, machaque ligeramente los guisantes partidos con un tenedor. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el arroz con almendras por igual entre cuatro platos para servir. Cuchara sobre el tarka dhal. Coloca tres cebollas bhajis al lado de cada porción. Sirva el yogur y la salsa picante de mango en los tazones para mojar al lado. Adorne con ramitas de cilantro."], "url": "www_bbc_co_uk_food_recipes_onionbhajistarkadhal_92047", "title": "Anian Bhajis, Lógica y Arroz almendrado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "2 cucharaditas de semillas de comino", "2 cucharaditas de semillas de cilantro", "2 vainas de cardamomo negro, divididas", "2 cucharaditas de semillas de mostaza negra", "2 cucharaditas de semillas de mostaza amarilla", "2 chiles secos, toscamente picados", "1 cucharadita de sal", "1 cebolla, finamente rebanada", "Harina de gramo 110g / 4oz (también se vende como harina de garbanzo o besan)", "1 limón, solo jugo", "4 cucharadas de agua", "pequeño cilantro fresco puñado, picado", "pimienta negra recién molida", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de comino", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de semillas de cilantro", "1 mango verde, pelado y en rodajas", "2 mangos maduros, pelados y en rodajas", "125g / 4½oz de azúcar moreno claro y suave", "Vinagre de malta 110ml / 4fl oz", "1 limón, cortado en cuñas, para servir"], "method": ["Para los bhajis, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotea y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Alternativamente, precaliente una freidora a 190C / 375F.", "Coloque el comino, el cilantro, el cardamomo y las semillas de mostaza, los chiles secos y la sal en un almirez y mortero, y mézclelos hasta obtener un polvo grueso.", "Coloque la mezcla de especias en un recipiente junto con la cebolla en rodajas y la harina de gramos y mezcle bien para combinar.", "Agregue el jugo de limón y el agua y mezcle para formar una masa muy pegajosa. Agregue el cilantro fresco y una pizca de pimienta negra recién molida y mezcle bien.", "Con cuidado, vierta cucharadas de la mezcla en el aceite caliente y fría durante 2-3 minutos, o hasta que estén doradas y crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la salsa picante de mango, caliente una sartén hasta que esté caliente. Coloque todas las especias en la bandeja seca y tueste durante 30 segundos, agite la sartén con frecuencia, hasta que las semillas de mostaza comiencen a reventar.", "Agregue los mangos y cocine por un minuto más.", "Agregue el azúcar y cocine hasta que se disuelva, luego agregue el vinagre. Cubra la sartén y cocine a fuego lento durante 25 minutos, o hasta que la mezcla se espese y el mango se haya descompuesto. Retirar del fuego y dejar enfriar ligeramente.", "Coloque la mitad de la salsa picante en un procesador de alimentos y mezcle con un puré, luego regrese a la sartén y mezcle para combinar.", "Vierta la salsa picante en frascos esterilizados y deje enfriar.", "Para servir, divida los bhajis entre cuatro platos y sirva con rodajas de limón y una cucharada de chutney de mango."], "url": "www_bbc_co_uk_food_recipes_onionbhajiswithmango_87874", "title": "Bhajis de cebolla con chutney de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "½ cebolla roja, finamente rebanada", "2 cucharaditas de miel clara", "100 g / 3½ oz de hojaldre listo para enrollar", "75g / 2½oz de queso de cabra", "50g / 1¾oz de piñones", "gran puñado de hojas frescas de albahaca", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la cebolla confitada, derrita la mantequilla en una sartén pequeña a prueba de horno a fuego medio, agregue las cebollas y cocine suavemente durante cinco minutos hasta que se ablanden.", "Agregue la miel y cocine por dos minutos.", "Recorta un círculo de hojaldre, del mismo ancho que la sartén. Coloque la masa sobre las cebollas cocidas y pique la masa con un tenedor. Coloque en el horno para cocinar durante 10 minutos.", "Para el pesto, coloque las hojas de albahaca y los piñones en un procesador de alimentos y mezcle. Poco a poco vierta el aceite de oliva, hasta que el pesto alcance una consistencia de vertido. Sazonar bien con sal y pimienta negra recién molida.", "Retire la tarta del horno y transfiera a un plato de servir. Coloque el queso de cabra en la parte superior.", "Para servir, vierta el pesto alrededor de la tarta y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_onionconfittartwithm_84453", "title": "Tarta confitada de cebolla con queso de cabra derretido y pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 cebolla grande, en rodajas", "200ml / 7fl oz de vino tinto", "100 ml / 3½ fl oz de caldo de carne (o caldo de verduras para una versión vegetariana)", "1 cucharadita de mostaza francesa", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una sartén y agregar la cebolla. Freír a fuego lento durante 30-45 minutos, revolviendo ocasionalmente, o hasta que la cebolla esté dorada pero no quemada.", "Vierta el vino y el caldo, reduzca el fuego y deje cocer a fuego lento durante 20 minutos o hasta que el líquido se haya reducido a la mitad. Agregue la mostaza y sazone, al gusto, con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_oniongravy_73662", "title": "Salsa de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oniongravy_73662_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de sésamo", "1 cucharada de aceite vegetal", "100 g / 3½ oz de anacardos", "3 cebollas de primavera, picadas", "gran puñado de cada perifollo, cilantro y menta fresca", "½ lima, ralladura y jugo"], "method": ["Caliente los aceites en un wok y tueste suavemente los anacardos por 2-3 minutos. Agregue las cebollas de primavera y fría por dos minutos.", "Para servir, mezcle las hierbas juntas, apile en un plato para servir, cubra con los anacardos y las cebolletas y exprima el jugo de limón y la ralladura."], "url": "www_bbc_co_uk_food_recipes_onionherbandtoastedc_86844", "title": "Ensalada de cebolla de cítricos, hierbas y anacardos tostados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite para freír", "½ cebolla, rebanada en anillos", "50ml / 1¾fl de leche en oz", "Harina normal de 100 g / 3½ oz"], "method": ["Calentar el aceite en una sartén profunda. (PRECAUCIÓN: El aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Remoje los aros de cebolla en leche.", "Coloque la harina en el plato.", "Retire los aros de cebolla de la leche y cúbralos con la harina.", "Freír en aceite por 2-3 minutos o hasta que estén crujientes y dorados."], "url": "www_bbc_co_uk_food_recipes_onionrings_75768", "title": "Aros de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600ml / 1 pinta de aceite vegetal", "½ cebolla, rebanada gruesa y separada en anillos", "150ml / ¼ pinta de leche entera", "Harina normal de 100 g / 3½ oz, sazonada", "Sal y pimienta negra recién molida"], "method": ["Caliente el aceite vegetal en un wok a 180 ° C / 350 ° F o hasta que la miga de pan chisporrotee y se ponga marrón. (PRECAUCIÓN: el aceite caliente puede ser peligroso, no lo deje desatendido).", "Remoje los aros de cebolla en la leche por un minuto, luego sumerja los aros de cebolla en la harina sazonada y cubra bien.", "Sumerja los aros de cebolla en la leche una y otra vez en la harina.", "Con cuidado, deje caer los aros de cebolla en el aceite caliente y cocínelos durante dos minutos o hasta que estén dorados por todos lados.", "Retirar con una cuchara ranurada, escurrir sobre papel de cocina y servir inmediatamente, salpicado con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_onionrings_81863", "title": "Aros de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / ½ de aceite vegetal, para freír", "150g / 5½ oz de harina de levante", "100 ml / 3½ fl oz de agua con gas", "45 g / 3 cucharadas de cebollín fresco, picado", "Pellizcar la cúrcuma", "1 cebolla roja, pelada y cortada en anillos", "Sal marina para rociar"], "method": ["Calentar el aceite en una cacerola profunda de fondo grueso, hasta que esté muy caliente o hasta que se queme una migaja de pan (PRECAUCIÓN: El aceite caliente es muy peligroso. No lo deje desatendido).", "Coloque la harina y el agua con gas en un tazón y agítelos para formar una masa.", "Agregue las cebolletas y la cúrcuma y mezcle bien.", "Sumerja los aros de cebolla en la mezcla y luego baje cuidadosamente en el aceite caliente y fría hasta que estén crujientes y dorados. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Para servir, colocar en un plato de servir y espolvorear con sal marina."], "url": "www_bbc_co_uk_food_recipes_onionrings_84353", "title": "Aros de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]