[{"isVegetarian": true, "title": "Bara brith soufflés", "url": "www_bbc_co_uk_food_recipes_bara_brith_souffls_91119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz freshly brewed strong black tea", "40g/1½oz soft dark brown sugar", "100g/3½ oz mixed dried fruit", "4 large free-range eggs", "50g/1¾oz caster sugar, plus extra for dusting", "30g/1oz cornflour", "250ml/9fl oz milk", "1 tsp ground mixed spice", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the tea and soft dark brown sugar in a heatproof bowl and stir until the sugar has dissolved. Stir in the dried fruit and cover with cling film. Leave to soak for 1 hour. ", "Drain the fruit, tip into a food processor and blend until smooth.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Separate the egg whites and yolks into two separate bowls. Whisk the yolks together with the caster sugar and cornflour.", "Put the milk and mixed spice into a saucepan and bring to a gentle simmer. Pour over the egg yolks, whisking to combine then return to the pan over a high heat. Bring to the boil and cook for 3 minutes, whisking constantly. Remove from the heat and leave to cool. Beat in the fruit purée until smooth.", "Whisk the egg whites with a handheld electric whisk until soft peaks form. Fold into the pastry cream mixture one third at a time, being careful not to knock out the air.", "Divide the mixture between four ramekins and smooth the tops over with a palette knife. Bake for 18 minutes until risen and golden-brown, then dust with icing sugar and serve immediately."]}, {"isVegetarian": false, "title": "Barbary duck with cherries and chocolate ganache", "url": "www_bbc_co_uk_food_recipes_barbaryduckwithcherr_91549", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz cabernet sauvignon vinegar", "125g/4½ oz plain chocolate", "110g/4oz unsalted butter, softened", "2 barbary ducks", "1 litre/1 pint 15fl oz duck fat", "2 cloves garlic", "6 sprigs fresh thyme", "1 tbsp olive oil", "3 shallots, chopped", "1 tsp caster sugar", "300ml/10½fl oz port", "300ml/10½fl oz chicken stock", "salt and freshly ground black pepper", "200g/7oz fresh cherries, stones removed", "1 punnet lamb's cress, to serve (substitute mustard cress if unavailable)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the chocolate ganache, place the vinegar into a non-reactive saucepan and bring to the boil. Cook until the volume of liquid has reduced to 110ml/4fl oz.", "Place the chocolate into a bowl over a pan of simmering water (do not let the water touch the bottom of the bowl). Heat until melted.", "Remove the bowl from the heat, then gently stir in the butter and the reduced vinegar. Mix until well combined. Place in the fridge until firm, about two hours.", "For the duck, preheat the oven to 150C/300F/Gas 2. Remove the legs and breasts from the duck. (You will not need the carcass for this recipe; save to make stock for another dish.)", "Heat a large ovenproof frying pan until just warm, then add the duck legs, skin-side down, and cook for one minute until just browned. Add the duck fat, one clove of garlic and half of the thyme.", "Cook in the preheated oven for 1-1½ hours, then carefully remove the duck legs from the fat and keep warm. ", "Meanwhile, heat another frying pan until hot. Add the olive oil, shallots and the remaining garlic and thyme. Cook for 2-3 minutes, or until softened, then add the sugar and cook for a further minute, stirring until the sugar has dissolved. Add the port and cook until reduced to a sticky glaze. Add the chicken stock and cook until the volume is reduced by half (the sauce should be thick enough to coat the back of a spoon).", "Pass the sauce through a sieve back into the pan and season, to taste, with salt and freshly ground black pepper. Add the cherries and cook for one minute.", "Remove the skin from the duck breast and add the skin to the pan with the duck legs and fat. Return to the oven and cook until soft, 2-3 minutes. Scrape the fat from the cooked duck skin. Place onto a baking tray, then weigh down with another heavy baking tray to keep it flat. Return to the oven and cook for 4-5 minutes, or until crisp. ", "Season the duck breast with salt and freshly ground black pepper. Heat a frying pan until hot, add a little of the duck fat and add the duck breast. Cook on each side for 2-3 minutes or until cooked to your liking. Remove from the pan and leave to rest for 2-3 minutes. Keep warm.", "To serve, place a duck leg into the centre of each of four plates. Carve the breasts into three pieces and place around the leg.", "Place a piece of the crisp duck skin onto the pieces of duck breast. Using two spoons, form the chocolate ganache into oval-shaped quenelles and place one on top of each piece of crisp duck skin. Spoon the cherries and sauce around the duck, scatter over the lamb's cress and serve."]}, {"isVegetarian": false, "title": "Barbecue baby back ribs with celeriac slaw", "url": "www_bbc_co_uk_food_recipes_barbecue_baby_back_ribs_42228", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecue_baby_back_ribs_42228_16x9.jpg", "ingredients": ["2kg/2lb 4oz baby back pork ribs, in racks", "2 celery stalks, trimmed, halved", "1 onion, thickly sliced", "2 red chillies, cut in half lengthways", "1 garlic bulb, cut in half horizontally", "250ml/9fl oz apple juice", "125ml/4½fl oz tomato ketchup", "150g/5oz dark muscovado sugar", "2 tbsp Worcestershire sauce", "1 tsp smoked hot paprika", "1 tsp smoked sweet paprika", "75ml/2½fl oz white wine vinegar", "50ml/2fl oz bourbon whiskey", "3 free-range egg yolks", "1 tbsp Dijon mustard", "2 tbsp cider vinegar", "300ml/10½fl oz rapeseed oil", "1 celeriac, julienned and placed in acidulated water", "2 tbsp roughly chopped fresh flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, place the rib racks into a large, wide, heavy-based saucepan with the celery, onion, chillies, garlic and apple juice. Pour over just enough water to cover the pan contents. Bring the mixture to the boil, then reduce the heat until the mixture is just simmering. Simmer very gently for 1-1½ hours, or until the meat is tender. From time to time, skim off any scum that rises to the surface during cooking.", "Meanwhile, for the barbecue sauce, heat the ketchup and muscovado sugar in a frying pan over a medium heat for 2-3 minutes, or until the sugar has dissolved into the ketchup. ", "Add the Worcestershire sauce, smoked paprikas and vinegar and bring the mixture to the boil. Reduce the heat until the mixture is simmering and cook for 4-5 minutes, or until thickened. Stir in the bourbon, then remove from the heat and set aside. Refrigerate when cool.", "For the slaw, whisk together the egg yolks, mustard and vinegar in a large bowl until well combined. Gradually add the oil in a very thin stream, whisking continuously, until the mixture has thickened to a light mayonnaise and all of the oil has been fully incorporated into it.", "Drain the celeriac thoroughly and remove any excess moisture using kitchen paper. Stir the celeriac and parsley into the mayonnaise and season, to taste, with salt and freshly ground black pepper. Chill in the fridge until needed.", "When the ribs are poached, preheat the oven to 240C/220C Fan/Gas 9, or as hot as it will go.", "Remove the ribs from the poaching liquor using a slotted spoon and transfer to a large roasting tray. Brush the ribs all over with the barbecue sauce, then roast in the oven for 10-15 minutes, turning every five minutes, until the ribs are sticky and charred around the edges.", "To serve, pile the ribs on a serving platter and serve the celeriac slaw and the remaining barbecue sauce alongside."]}, {"isVegetarian": false, "title": "Barbecue sweetcorn with smoked chilli garlic butter", "url": "www_bbc_co_uk_food_recipes_barbecue_sweetcorn_with_51495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 sweetcorn cobs", "225g/8oz unsalted butter, at room temperature", "2 tbsp lemon juice", "2 tbsp chopped fresh herbs, such as coriander or parsley", "2 anchovies, finely chopped", "1 tbsp chopped shallot", "4 tbsp smoked barbecue sauce (or smoked ketchup )", "2 sliced smoked chipotle chillies, or fresh chillies ", "½ tsp salt", "¼ tsp ground white pepper"], "serves": "Makes 12 cobs", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the barbecue to hot. Barbecue the corn until cooked through.", "For the smoked chilli garlic butter, place all the ingredients in a food processor and blend for 30 seconds, or until the mixture is shiny and smooth.  ", "Turn into a bowl and reserve.", "To serve, top the corn with a spoonful of the soft butter, and serve immediately."]}, {"isVegetarian": false, "title": "Barbecued turbot and leeks, girolles and fresh almonds", "url": "www_bbc_co_uk_food_recipes_barbecue_turbot_and_14289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucumber, peeled, deseeded and finely chopped", "120g/4½oz caster sugar", "175g/6oz rice vinegar", "250g/9oz unsalted butter, softened", "1 tbsp Dijon mustard", "1 lemon, zest and juice", "1 garlic clove, crushed", "1 tbsp lemon thyme leaves ", "1 tsp salt", "pinch cayenne pepper", "15g/½oz ground almonds", "1 x 2kg/4lb 8oz–3kg /6lb 8oz whole turbot (portioned into 6 tranche)", "3 slender leeks, cut in half lengthways", "150g/5½oz small girolles, cleaned", "50g/1¾oz butter", "2 lemons, juice only", "100g/3½oz fresh almonds, husks removed", "2 lemons, segmented and cut into 2cm/¾in pieces", "200ml/7fl oz chicken stock", "20g/¾oz lilliput capers", "20g/¾oz pickled cucumber, from above", "1 tbsp finely chopped parsley", "1 tsp finely chopped tarragon", "salt and freshly ground black pepper "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the barbecue. ", "To make the pickled cucumber, place a small saucepan over a medium heat. Add the sugar and vinegar and heat until the sugar has dissolved. Remove from the pan and add the cucumber. Set aside. ", "Mix together the lemon butter ingredients in a small bowl. ", "Lightly oil the turbot on both sides, season and place white skin-side down on the barbecue. Cook for 4 minutes and turn over. Add a spoon of the lemon butter onto each tranche and cook for a further 5 minutes or until cooked through. Take off the barbecue and allow to rest. Remove the dark skin.", "Place the leeks on the barbecue until charred. Spoon some of the lemon butter onto each leek and cook for a further 2 minutes.", "Sauté the girolles in a saucepan with a splash of olive oil and a knob of lemon butter.", "For the sauce, place a frying pan over a medium heat. Add the butter and cook until it turns a nut-brown colour. Add the lemon juice, fresh almonds and the remaining the ingredients. Season with salt and pepper. ", "To serve, place the turbot on a serving platter. Arrange the leeks and girolles around the edge and pour over the sauce."]}, {"isVegetarian": false, "title": "Barbecued lamb belly wraps", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_belly_15029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 carrot, roughly chopped", "1 onion, roughly chopped", "2 star anise ", "1 garlic bulb, cut in half horizontally", "small bunch fresh parsley", "1 dried smoked chipotle chilli", "1 x 1.75kg/3lb 14oz lamb belly, bones removed ", "2 red onions, finely sliced", "200ml/7fl oz cider vinegar", "2 tbsp caster sugar", "½ tsp black mustard seeds", "½ tsp sea salt", "¼ cucumber, finely sliced ", "75g/2¾oz chipotle paste", "275ml/9¾fl oz tomato ketchup", "175ml/6fl oz maple syrup", "1 tbsp Worcestershire sauce", "1 tbsp cider vinegar", "5 tbsp light soy sauce ", "8-12 naan breads or pides (Turkish breads)", "small bunch fresh coriander sprigs"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, put the carrot, onion, star anise, garlic, parsley and chipotle chilli into a large saucepan. Half-fill the pan with cold water, then lay the lamb belly on top and pour over just enough water to cover the meat. Bring the mixture to the boil, then reduce the heat until simmering and simmer for 1 hour, until the meat is really tender. ", "Meanwhile, for the pickled red onions, put the sliced red onions into a bowl, then heat the cider vinegar, caster sugar, mustard seeds and salt in a non-reactive pan until the sugar has dissolved and the mixture is just simmering. ", "Pour the liquid over the onions, then add the cucumber, stir well and set aside to cool. ", "For the barbecue sauce, heat a non-reactive frying pan over a medium heat until hot, then add the chipotle paste and stir-fry for a 1-2 minutes. Add the ketchup and maple syrup and stir-fry for a further 2-3 minutes, or until bubbling. Add the Worcestershire sauce, cider vinegar and soy sauce, bring the mixture to the boil, then reduce the heat until simmering and simmer for 5-6 minutes, or until thickened. Set aside.", "When the lamb has cooked, remove it from the pan using a slotted spoon and set aside to drain and cool.", "Preheat the oven to 200C/180C Fan/400F/Gas 6. Warm the naan bread or pide in the oven for a few minutes. ", "To serve, coarsely shred the lamb meat and fold the meat into the warm barbecue sauce. Spoon the mixture on top of the warmed bread, with some of the pickled red onions and coriander leaves scattered on top."]}, {"isVegetarian": false, "title": "Barbecued lamb, salsa verde, tomato salad, toasted couscous and fromage blanc", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_salsa_59620", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 double lamb rump, boned and butterflied to equal thickness ", "half bunch fresh parsley", "half bunch fresh mint ", "half bunch fresh oregano", "1 garlic clove, peeled", "1 small green chilli, deseeded", "4 tsp capers", "250ml/9fl oz olive oil, plus extra to drizzle ", "200g/7oz large pitted green olives, roughly chopped", "100g/3½oz fromage blanc", "sea salt flakes and freshly ground black pepper", "50g/13/4oz butter", "50ml/2fl oz olive oil", "150g/51/2oz couscous", "10g/1/2oz almonds, toasted", "6 heirloom tomatoes, cut into equal size shapes ", "4 tsp white balsamic vinegar", "small handful fresh basil, roughly torn"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the lamb in a large shallow dish. Blend the parsley, mint, oregano, garlic, chilli, capers and 150ml/5fl oz oil in a food processor. Pour two thirds of the mixture over the lamb, cover with clingfilm and marinate in the fridge for 24 hours. Reserve the remaining mixture in the fridge, covered.", "When you are ready to cook, preheat your barbecue to hot.", "For the couscous, melt the butter with the oil in a heavy-based saucepan over a medium heat. Add the couscous and fry until dark and well toasted. Pour in 300ml/10fl oz cold water and cover with cling film, then set aside.  ", "Mix the olives with the remaining 100ml/31/2fl oz oil, cover and set aside. For the salad, put the tomatoes in a shallow serving dish, then sprinkle over the vinegar, basil and a pinch of salt. Cover and set aside. ", "Cook the lamb on the barbecue for 4 minutes on each side, or until well browned but still pink in the middle. Transfer it to a serving plate, drizzle with oil and leave to rest for 20 minutes.", "To finish the couscous, toast the almonds in a hot frying pan for 2-3 minutes. Fluff the couscous up using a fork, mix in the almonds, a drizzle of oil and a spoon of the reserved salsa verde and season with salt and pepper. ", "Arrange the tomatoes and couscous on plates and garnish with the olives. Add a quenelle of the salsa verde. Carve the lamb and divide equally between the plates. Spoon on the fromage frais and drizzle with the resting juices."]}, {"isVegetarian": false, "title": "Barbecued lamb with baked squashes, anchovy, capers and brown butter", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_with_55922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1lb 9oz of lamb neck fillet or lamb leg steaks, cut into 4 even portions", "olive oil, for cooking", "sea salt and pepper", "2 butternut squash, or about 1.2kg/2lb 12oz mixed onion/spaghetti squash, unpeeled and cut into thin wedges", "1 red chilli, seeds removed, roughly chopped", "2 garlic cloves, peeled and roughly chopped", "110g/4oz unsalted butter, softened ", "1 tbsp blossom honey", "1 large head cavolo nero, leaves only", "extra virgin olive oil, for drizzling", "30g/1¼oz pickled capers", "½ lemon, zest and juice only", "4 tinned anchovies, finely chopped"], "serves": "Serves 4 as a main, 6-8 as a tapa", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the lamb portions in a bowl and drizzle over some olive and season with salt and pepper. Leave to marinade while the squash is cooking.", "Place the squash pieces on a baking tray. Drizzle over a little olive oil and add the chilli, garlic, 50g/1¾oz of the butter and a good amount of seasoning. Mix the squash with your hands ensuring it’s fully coated. ", "Place the tray in the oven and cook until the squash starts to caramelise, then turn the heat down to 160C/325F/Gas 3 and continue to cook until the squash becomes tender and soft. You should turn the squash twice during this process to ensure even colouring, and so that the squash doesn’t stick. ", "When the squash is ready, drizzle it with the honey and set aside.", "Heat a barbecue or grill pan to maximum heat. Place the lamb on the grill or barbecue and cook for 3-4 minutes on each side, or until nicely charred and the meat still has a spring when pushed with a finger. The meat should be rosy pink inside. Leave the meat to rest for at least five minutes.", "Blanch the cavolo nero in a pan of salted boiling water, drain well and toss with some seasoning and extra virgin olive oil.", "Place a small saucepan on a high heat and add the remaining butter. Cook the butter until it turns a nut-brown colour and then immediately add the capers, lemon juice and zest and the anchovies. Season with salt and pepper and then turn off the heat.", "To serve, slice the lamb into 12 pieces, divide onto serving plates with the squash and cabbage and then spoon over the butter sauce. "]}, {"isVegetarian": false, "title": "Barbecued sardines", "url": "www_bbc_co_uk_food_recipes_barbecued_sardines_27707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucumber, cut in half lengthways, seeds scraped out, flesh finely diced", "1 banana shallot, finely diced", "2 garlic cloves, crushed", "4 tbsp extra virgin olive oil", "3 tbsp chopped fresh dill", "3 tbsp chopped fresh mint leaves", "3 tbsp chopped fresh coriander leaves", "2 limes, juice only", "16 sardines, scales and guts removed (ask your fishmonger to do this for you)", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Soak four pieces of clean thick untreated wood in cold water, preferably overnight.", "Thirty minutes before you want to eat, light the barbecue. Allow the flames to flare up and die down.", "Meanwhile, mix the cucumber, shallot, garlic, oil, herbs and lime juice together in a bowl, then season, to taste, with salt and freshly ground black pepper. Set aside.", "When the barbecue coals are red hot, nail four sardines by the tail to each plank of wood. Place the pieces of wood onto the coals (or alternatively on a rack near the coals) and cook for 5-6 minutes, or until the sardines are charred and cooked through.", "To serve, place four sardines onto each serving plate. Spoon the salsa alongside."]}, {"isVegetarian": false, "title": "Barbecued langoustines in garlic and parsley marinade", "url": "www_bbc_co_uk_food_recipes_barbecuedlangoustine_91732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp olive oil", "3 tbsp white wine vinegar ", "4 garlic cloves, crushed to a paste with the edge of a knife", "small bunch parsley, leaves only, finely chopped", "salt and freshly ground black pepper ", "24 langoustines, or tiger prawns, cleaned, heads and shells removed (reserve), de-veined"], "serves": "Makes 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a bowl, mix together the oil, white wine vinegar, garlic and parsley in a bowl. Season, to taste, with salt and freshly ground black pepper. ", "Add the langoustines and reserved langoustine shells to the marinade mixture, cover and chill in the fridge for at least an hour.", "Meanwhile, light the barbecue 30 minutes before you want to eat. Soak 12 wooden skewers in water for 30 minutes, then shake off any excess water.", "When the barbecue coals are ash-white and the langoustines have marinated, thread three langoustines onto each skewer and place onto the barbecue grill. Cook, turning regularly and basting with the remaining marinade mixture, until pink and completely cooked through, then serve."]}, {"isVegetarian": false, "title": "Barbecued sirloin with chimichurri sauce", "url": "www_bbc_co_uk_food_recipes_barbecuedsirloinwith_91627", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecuedsirloinwith_91627_16x9.jpg", "ingredients": ["2-3 long red chillies, seeds removed, finely chopped", "10-12 garlic cloves, peeled, finely chopped", "2 large handfuls finely chopped curly-leaved parsley, leaves only", "4 heaped tsp dried oregano", "2 tsp sea salt flakes", "5 tbsp red wine vinegar", "4-5 tbsp extra virgin olive oil", "5 tbsp cold water", "1 x 2kg/4½lb well-hung boneless beef sirloin, not rolled (weight after bone removed)", "freshly ground black pepper"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the chimichurri sauce, place the chopped chillies and garlic into a bowl. ", "Add the remaining chimichurri sauce ingredients and stir well until combined. Cover the bowl with a sheet of cling film, then set the mixture aside for 4-6 hours to allow the flavours to infuse, or preferably overnight.", "One and a half hours before serving the meal, light the barbecue outdoors and leave the coals to heat through for one hour. ", "When the coals are white hot and the flames have died down, suspend a cooking rack 25cm/10in above the coals. ", "Season the beef sirloin all over with salt flakes and freshly ground black pepper, then place the seasoned beef sirloin, fatty-side down, onto the cooking rack. (NB: Ideally, during cooking, the barbecue should be covered with a lid and the vents should be open.)", "Sear the fatty side of the sirloin for 4-6 minutes, or until golden-brown, then turn the beef over and continue to cook for 20-25 minutes. ", "Turn the sirloin steak over again and continue to cook for a further 20 minutes (for medium), or until the sirloin is barbecued to your liking. ", "When the beef sirloin is cooked to your liking, remove it from the barbecue and set aside to rest for ten minutes, before carving into thick slices.", "To serve, arrange 2-3 slices of the barbecued beef sirloin onto serving plates and spoon over the chimicurri sauce."]}, {"isVegetarian": false, "title": "Barbecued veal chops with fresh herbs and salmoriglio", "url": "www_bbc_co_uk_food_recipes_barbecuedvealchopswi_91628", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecuedvealchopswi_91628_16x9.jpg", "ingredients": ["4 x 200g/7oz thick-cut rose veal loin chops ", "4 tbsp extra virgin olive oil ", "2 tbsp fennel seeds", "large bunch fresh sage, roughly torn ", "6-8 sprigs fresh thyme, broken into smaller lengths ", "4 large sprigs fresh rosemary, broken into smaller lengths", "2 garlic bulbs, cut in half horizontally, then broken into smaller pieces", "2 unwaxed lemons, rind peeled from the fruit in long strips", "freshly ground black pepper", "sea salt flakes", "large handful finely chopped fresh marjoram leaves", "5 tbsp extra virgin olive oil", "½ lemon, juice only, plus lemon wedges, to serve", "½ tsp sea salt flakes"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Rub the veal chops all over with the olive oil. Place them into a large, shallow dish, then sprinkle over the fennel seeds. ", "Sprinkle the sage leaves, thyme sprigs, rosemary sprigs, garlic and strips of lemon rind over the veal chops. Season, to taste, with freshly ground black pepper. ", "Cover the dish with cling film and chill in the fridge for 4-6 hours, turning the veal chops over after three hours. ", "Thirty minutes before you want to start cooking, light the barbecue outdoors.", "When the coals are white hot and the flames have died down, season the marinated veal chops with salt, then place them onto a rack set over the hot coals. Sprinkle over the herbs used in the marinade, allowing them to smoke and burn where they fall. ", "Cook the veal chops for 5-6 minutes on each side, or until charred on both sides but tender, pink and juicy inside (cut one of the veal chops open to check).", "When the veal chops are cooked to your liking, remove from the coals and set aside to rest for 4-5 minutes. ", "Meanwhile, for the salmoriglio, in a bowl, mix together the chopped marjoram, olive oil, lemon juice and sea salt flakes until well combined. Stir well and set aside for 8-10 minutes to allow the flavours to infuse.", "To serve, place one veal chop into the centre of each of four serving plates. Spoon over the salmoriglio sauce."]}, {"isVegetarian": false, "title": "Barbecue baked beans on bruschetta with bacon", "url": "www_bbc_co_uk_food_recipes_barbequebakedbeanson_84001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz baked beans", "1 garlic clove, crushed", "1 tbsp soft brown sugar", "pinch dried chilli flakes", "1 tbsp soy sauce", "4 thick slices ciabatta", "110g/4oz cheddar, cut into four slices", "55g/2oz streaky bacon, cut into strips and fried until crisp"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the beans, gently cook all of the beans ingredients in a small saucepan over a medium heat for ten minutes, stirring occasionally.", "Meanwhile, for the bruschetta, heat a griddle pan until smoking. Add the ciabatta slices and toast for two minutes on each side.", "Remove the ciabatta from the griddle and place a slice of cheese on each piece. Place onto a baking sheet and place into the oven to bake for five minutes, or until the cheese has melted.", "To serve, carefully remove the ciabatta from the oven and place onto plates. Pour over the beans and garnish with the bacon pieces."]}, {"isVegetarian": false, "title": "Barbecue belly pork", "url": "www_bbc_co_uk_food_recipes_barbeque_belly_pork_40196", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbeque_belly_pork_40196_16x9.jpg", "ingredients": ["1.5kg/3lb5oz belly of pork", "3 tbsp sea salt", "2 star anise, ground", "1 large orange, zest only", "2 fresh bay leaves", "8 garlic cloves", "1 tbsp Sichuan peppercorns", "½ tsp Chinese five-spice powder", "200ml/7fl oz olive oil", "2 tbsp sesame oil"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Make sure you or your butcher score the pork skin well (using a small, sharp kitchen knife or a clean DIY knife) - nice fine scores make better crackling. Mix the salt, ground star anise and the orange zest together and rub well into the skin, making sure the salt goes into all the cuts of the pork rind.", "Using a mini-blender or a pestle and mortar, add the bay leaves, garlic, Szechuan peppercorns, five spice and blend to a paste, then slowly add the olive oil while mixing.", "Leave the pork to dry overnight in the fridge; do not cover as you want it to dry.", "Heat a barbecue or griddle and slice the pork into thin slices. Place the pork slices onto the hot griddle or barbeque and brush with the marinade. Cook each side for a few minutes, or until cooked through and the skin is crisp."]}, {"isVegetarian": false, "title": "Pork tenderloin with crushed potatoes and mustard sauce", "url": "www_bbc_co_uk_food_recipes_barbequedporkwithcru_90713", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz pork tenderloin", "2 sprigs fresh rosemary", "salt and freshly ground black pepper", "1 tbsp olive oil", "15g/½oz butter", "8 Anya potatoes, halved", "15g/½oz butter", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper", "100ml/3½fl oz double cream", "1 tsp Dijon mustard", "1 tbsp lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pork, make two incisions in the tenderloin with the tip of a sharp knife and poke the rosemary sprigs into the holes. Season well with salt and freshly ground black pepper.", "Heat the olive oil in an ovenproof frying pan and sear the meat all over for 2-3 minutes, or until golden-brown. Add the butter to the pan, then transfer to the oven to roast for 10-12 minutes, or until the pork is cooked through. (The juices will run clear when the pork is pierced in the thickest part with a skewer.) Remove from the pan and allow to rest on a warm plate. ", "For the potatoes, cook the potatoes in a pan of boiling water for 7-8 minutes, or until tender, then drain and crush lightly, adding the butter and chives. Season, to taste, with salt and freshly ground black pepper. ", "For the sauce, place the cream into a small pan and simmer for 4-5 minutes, or until reduced by about a third in volume, then stir in the mustard and lemon juice. ", "To serve, spoon the crushed potatoes onto a serving plate. Thickly slice the pork and arrange on top of the potatoes, then spoon the sauce around the edges of the plate."]}, {"isVegetarian": true, "title": "Barmbrack parfait with whisky prunes", "url": "www_bbc_co_uk_food_recipes_barmbrack_parfait_with_87190", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz mixed dried fruit", "250ml/9fl oz cold tea", "50ml/2fl oz Irish whiskey", "knob of butter, for greasing", "225g/8oz plain flour", "2 tsp baking powder", "125g/4½oz light brown sugar", "½ tsp mixed spice", "1 large free-range egg", "2 tbsp golden caster sugar", "3 medium free-range egg yolks", "2 tbsp whole milk", "275ml/9½fl oz double cream", "¼ vanilla pod, split and seeds removed", "85g/3oz white chocolate, broken into pieces ", "2 tbsp Irish whiskey or Irish cream liqueur", "1 large orange, finely grated zest and juice", "175g/6oz caster sugar", "115g/4oz pitted prunes", "4–6 tbsp Irish whiskey"], "serves": "6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the barmbrack, put the dried fruit in a bowl and pour over the cold tea and whiskey. Cover and leave to soak overnight.", "Preheat the oven to 170C/150C Fan/Gas 3. Butter and line a 900g/2lb loaf tin.", "Put the flour, baking powder, sugar and mixed spice in a mixing bowl. Make a well in the middle and crack in the egg. Mix well using a wooden spoon. Add a little liquid from the fruit mixture and stir. Continue adding liquid and stirring until you have a wet dough – you may not need all the liquid. Drain the dried fruit and mix it into the dough until well combined.", "Spoon the dough into the prepared loaf tin and level off the top. Bake on the middle shelf of the oven for 1 hour, or until a skewer inserted comes out clean. Leave to cool in the tin slightly, then turn out onto a wire rack to cool completely.", "For the parfait, preheat the oven to 200C/180C Fan/Gas 6. Cut the crusts off the bambrack, then crumble 175g/6oz of the barmbrack into a roasting tin. Sprinkle over 1 tablespoon of sugar. Bake for 10 minutes, or until crisp, then leave to cool.", "Whisk the egg yolks with the remaining 1 tablespoon of sugar. ", "Put the milk, 85ml/3fl oz cream and the piece of vanilla pod in a heavy-bottomed saucepan and bring to the boil. Remove from the heat and pour over the yolk mixture, whisking all the time. Return the pan to the heat and cook gently until the custard coats the back of the spoon, stirring. ", "Strain the custard into a bowl through a fine sieve. Leave to cool. ", "Melt the chocolate in a heatproof bowl over a pan of gently simmering water, making sure the bowl doesn’t touch the water. Fold the melted chocolate and crumbs into the custard, cover and chill for 30 minutes.", "Whisk the remaining cream until soft peaks form. Fold the cream and whiskey into the custard mixture. Pour into six plastic see-through cups, cover and freeze for 2-3 hours, or overnight if you have the time.", "For the prunes, bring 200ml/7fl oz water to the boil in a medium saucepan. Add the orange zest and juice and the sugar and return to the boil. Add the prunes, cover and simmer for 20 minutes, or until softened. Stir in the whiskey. Set aside to cool.", "To serve, spoon the prune mixture on top of each cup and grate a little orange zest on top."]}, {"isVegetarian": true, "title": "Béarnaise sauce", "url": "www_bbc_co_uk_food_recipes_barnaise_sauce_89217", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barnaise_sauce_89217_16x9.jpg", "ingredients": ["300g/10½oz butter", "4 tbsp white wine vinegar", "4 shallots, chopped", "3 tbsp chopped fresh tarragon, plus 2 tbsp whole tarragon leaves", "salt and freshly ground black pepper", "4 free-range egg yolks", "1 tsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clarify the butter by melting it in a small, heavy-based saucepan over a low heat. When the butter is foaming, remove the pan from the heat and leave it to stand for a few minutes so that the white solids sink to the bottom of the pan. Sieve the butter through a fine sieve and discard the solids.", "Pour the vinegar into a non-reactive saucepan. Add the shallots, chopped tarragon and salt, to taste. Heat gently over a medium heat until the volume of liquid has reduced by more than half.  Strain and set aside until completely cooled.", "Lightly beat egg yolks with one teaspoon of water. Stir the egg yolk mixture into the cooled vinegar, then add the lemon juice.", "Pour the mixture into a bowl suspended over a pan of simmering water (do not allow base of the bowl to touch the water). Whisk constantly until the sauce has thickened enough to coat the back of a spoon and has increased in volume.", "Remove the bowl from the heat and slowly pour in the clarified butter in a steady stream, whisking continuously, until the mixture is thick and smooth. Fold in the tarragon leaves and season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Barnsley chops with Cumberland sauce", "url": "www_bbc_co_uk_food_recipes_barnsley_chops_with_60141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barnsley_chops_with_60141_16x9.jpg", "ingredients": ["2 tbsp chopped fresh thyme", "1 tbsp chopped fresh rosemary", "4 tbsp chopped fresh mint", "1 tsp sea salt", "freshly ground black pepper", "4 x 375g/13oz Barnsley chops", "2 tbsp sunflower oil", "1 orange, zest cut into matchsticks, juiced", "1 piece stem ginger, drained and cut into very fine strips", "50ml/2fl oz ruby port", "150g/5fl oz redcurrant jelly", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chops, mix all the herbs with the salt and plenty of freshly ground black pepper in a bowl. Place a quarter of the herb mixture onto a plate and rub into both sides of one of the chops. Repeat with the rest of the herb mixture and the remaining three chops until all are coated with the herbs. ", "For the Cumberland sauce, put the orange zest in a small saucepan, cover with 250ml/10fl oz cold water and bring to the boil for 8-10 minutes, then drain in a sieve and set aside. ", "Bring the orange juice, port, redcurrant jelly and lemon juice to a simmer in a small saucepan. Cook for 8-10 minutes over a low heat, or until the jelly dissolves. ", "Stir in the orange and ginger strips and continue simmering gently for a further 2-3 minutes until the sauce is slightly darker in colour and syrupy. Remove from the heat and leave to stand at room temperature. The sauce will continue to thicken as it cools. Serve warm or cold. (If the sauce thickens too much, add a little water and reheat gently before serving.)", "Preheat the oven to 180C/350F/Gas 4. ", "Heat the oil in a large heavy-based frying pan and fry the chops over a high heat for three minutes on each side until browned but not cooked through. ", "Prop up the chops on the fat and cook for 2-3 minutes more until the fat is browned and rendered slightly. Transfer to the chops to a baking tray and cook in the centre of the oven for a further six minutes for medium and 8-10 minutes for well done. Remove from the oven and leave to rest for five minutes before serving. ", "Put the chops on warmed plates and spoon over a little of the warm Cumberland sauce. Garnish with fresh herbs."]}, {"isVegetarian": true, "title": "Basic tomato sauce", "url": "www_bbc_co_uk_food_recipes_basic_tomato_sauce_66556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil", "4 garlic cloves, peeled, roughly chopped", "2 x 400g/14oz tins chopped tomatoes", "large handful fresh basil", "salt and freshly ground black pepper", "200g/7oz fresh penne"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the basic tomato sauce, heat the oil in a frying pan over a medium heat, add the garlic and fry for 1-2 minutes, or until softened. ", "Add the tinned tomatoes and basil and bring to the boil, then reduce the heat until the mixture is simmering and simmer for 12-15 minutes. Season, to taste, with salt and freshly ground black pepper.", "Remove two thirds of the tomato sauce from the pan and set aside to be used in another recipe (it can be frozen for up to six weeks).", "Cook the pasta in a pan of salted, boiling water until al dente, then drain well and stir it into the sauce. Warm through for a further minute, then serve."]}, {"isVegetarian": true, "title": "Basic tortellini with ricotta and pine nuts", "url": "www_bbc_co_uk_food_recipes_basic_tortellini_with_38575", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basic_tortellini_with_38575_16x9.jpg", "ingredients": ["200g/7oz ‘00’ pasta flour, plus extra for dusting", "2 free-range eggs, lightly beaten", "12 large fresh basil leaves, plus 18-20 small basil leaves, plus extra to serve", "225g/8oz buffalo-milk ricotta (or cows’ milk ricotta)", "60g/2¼oz toasted pine nuts, to serve", "grated parmesan (or a similar vegetarian hard cheese), to serve", "50g/1¾oz fresh basil leaves, chopped", "10g/¼oz toasted pine nuts", "25g/1oz parmesan, grated", "1 garlic clove, crushed", "25ml/1fl oz extra virgin olive oil", "50ml/2fl oz olive oil", "salt and freshly ground black pepper"], "serves": "Makes 20", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Blend the flour and eggs together in a food processor until the mixture resembles breadcrumbs. Turn the mixture out onto a lightly floured work surface and squash the crumbs into a ball of dough. Knead the dough for 4-5 minutes, or until smooth and elastic. Wrap the dough in cling film and chill in the fridge for 20 minutes.", "For the pesto, grind the basil, pine nuts, parmesan and garlic to a rough paste in a pestle and mortar. Gradually pour in both the oils, stirring as you add them. Season, to taste, with salt and freshly ground black pepper. Set aside, covered, until needed.", "To prepare the pasta, dust the rollers of a pasta machine with flour. Cut the chilled pasta into three pieces and flatten each out to a thickness of about 1cm/½in. ", "Set the pasta machine to its widest setting and feed one piece of dough through the machine, turning the handle with one hand and collecting the rolled dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next thickest setting, dust the rollers with a little flour, then feed the same pasta sheet through the machine again, as before. Repeat this process three or four more times, flouring the machine and changing the setting down each time, until you reach the penultimate setting. As your pasta sheet becomes longer, cut it in half so that the rolling process is more manageable. ", "Repeat the rolling process with the remaining two pieces of dough. Once all of the dough has been rolled out, you should have six long sheets of pasta. ", "To make the tortellini, place one long sheet of the pasta onto the work surface with the longest side facing you. Place two large basil leaves in the bottom half of the pasta, then fold the top half over the basil leaves. Set the pasta machine to its finest setting and pass the sheet through the machine again. Repeat the process with the remaining pasta sheets and large basil leaves.", "Cut the pasta sheets into 9cm/4in discs using a cookie cutter. Place one small basil leaf into the centre of each, and top with one teaspoonful of ricotta.", "One by one, brush the edges of each pasta disc with a little water. Bring the edges of each disc together to form a semi-circular shape, pressing the edges together with your fingertips to seal. Bring the pointed ends of the tortellini towards each other around your fingertip to form a ring, then press the corners together using your other hand. ", "Repeat the process with the remaining pasta discs, basil and ricotta; you should end up with 20 tortellini.", "Bring a large pan of salted water to the boil. Carefully lower the tortellini into the boiling water, in batches, and cook for 3-4 minutes, or until they float to the surface of the water. Remove from the pan using a slotted spoon and set aside in a bowl, keeping warm. Cook the remaining tortellini. ", "Add the pesto to the tortellini and mix gently until coated. Sprinkle over the pine nuts.", "To serve, spoon the tortellini and pesto onto serving plates. Sprinkle some grated parmesan over each and garnish with a few small basil leaves."]}, {"isVegetarian": false, "title": "How to make beef stock", "url": "www_bbc_co_uk_food_recipes_basicbeefstock_90181", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicbeefstock_90181_16x9.jpg", "ingredients": ["2-2.5kg/4lb 6oz-5lb 8oz of beef bones (rib, leg marrowbones - you can buy these from your butcher)", "3 onions, unpeeled", "1 whole head garlic", "large bouquet garni of parsley, sage and thyme", "2 leeks, cut in half", "2 carrots, cut in half", "1 stalk celery, including the leaves, roughly chopped", "2 large tomatoes, roughly chopped", "1 tsp sea salt", "1 tbsp peppercorns"], "serves": "Makes 2.5 litres/4 pints 8fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. If your butcher hasn't done so already, chop the bones into manageable pieces with a cleaver. Place the bones in a large roasting tin.", "Cut the onions in half and add them to the tray with the bones. Cut the garlic in half across the middle and add to the pan. Pour half an inch of water into the tin and roast the bones and vegetables in the oven for 40-45 minutes, topping up the water occasionally, if necessary.", "Meanwhile, place a large stockpot on the biggest hob ring. Fill with 4-5 litres/7-9 pints of cold water (about two-thirds full) and bring the water up to simmering point.", "When the water is simmering and the bones are roasted, remove the bones, onions and garlic from the oven and add them to the water, scraping in the browned bits from the tin.", "Add the bouquet garni, leeks, carrots, celery, tomatoes, salt and peppercorns.", "Gently simmer the stock, covered, for 4-6 hours, or even longer if you have time, topping up with water if necessary. Six hours will give you a good strong stock to work with.", "At the end of cooking time, strain the stock of all solid ingredients and discard them.", "To reduce the stock, pour the liquid stock back into the pot and turn the heat up to medium. Cook until the liquid is reduced by half, which will take about one hour, perhaps longer. The further you reduce the stock, the stronger and more intense it will be. The stock can be used as is, or can be reduced further or frozen for future use."]}, {"isVegetarian": false, "title": "Basic buttercream icing", "url": "www_bbc_co_uk_food_recipes_basicbuttericing_73263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicbuttericing_73263_16x9.jpg", "ingredients": ["140g/5oz butter, softened", "280g/10oz icing sugar", "1-2 tbsp milk", "few drops food colouring"], "serves": "Makes enough icing for 1 medium cake or 12 fairy cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Beat the butter in a large bowl until soft. Add half of the icing sugar and beat until smooth.", "Add the remaining icing sugar and one tablespoon of the milk and beat the mixture until creamy and smooth. Beat in the milk, if necessary, to loosen the mixture.", "Stir in the food colouring until well combined."]}, {"isVegetarian": true, "title": "Raymond Blanc's chocolate mousse", "url": "www_bbc_co_uk_food_recipes_basicchocolatemousse_93648", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicchocolatemousse_93648_16x9.jpg", "ingredients": ["170g/6oz good-quality dark chocolate, minimum 60 per cent cocoa solids, roughly chopped (dairy free, if necessary)", "7 free-range egg whites (use pasteurised egg white in a carton if you have any concerns about raw egg)", "¼ tsp lemon juice", "40g/1½oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the chocolate in a heatproof bowl set over a pan of simmering water (do not allow the base of the bowl to touch the water). ", "Whisk the egg whites and lemon juice in a large, clean bowl until they form soft peaks. The lemon juice will stabilise the egg whites, make them easier to work with and help to prevent over-whisking.", "Add the sugar and continue to whisk until firm peaks form when the whisk is removed. Do not whisk beyond this stage - the egg whites will start to collapse and separate into dry froth and runny liquid, and you'll lose all the air that you've whisked in.", "When the chocolate has melted, remove the bowl from the heat. Whisk one-third of the egg whites into the hot chocolate quickly and vigorously, until thick and well combined - if you add the egg whites in too slowly, their cold temperature  can make the hot chocolate seize, solidify and result in a lumpy mousse. ", "Fold the remaining egg whites into the chocolate mixture, using a spatula, until all of the egg white has been completely incorporated into the chocolate. Don't overmix at this stage as you'll knock out the air bubbles and the mousse will be dense. ", "Spoon the mousse mixture into four Martini glasses. Chill in the fridge for 2-3 hours, or until set. ", "Alternatively, use the mousse to make a hot chocolate soup. Preheat the oven to 180C/350F/Gas 4. Divide the mousse among four small ovenproof pudding bowls or ramekins. Place the pudding bowls into the oven and bake the chocolate mousses for 3-5 minutes, or until puffed slightly and warmed through."]}, {"isVegetarian": true, "title": "How to cook Chinese sticky rice", "url": "www_bbc_co_uk_food_recipes_basicglutinousrice_89293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz washed glutinous rice", "500ml/18fl oz water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a pan, add the rice and water, cover and cook on high heat for 15 minutes. ", "Turn the heat to low and simmer the rice for a further 3-4 minutes, making sure all the water has been absorbed and the rice is tender. ", "Take off the heat and, using a spatula, fluff up the rice grains. Serve."]}, {"isVegetarian": true, "title": "Basic muesli", "url": "www_bbc_co_uk_food_recipes_basicmuesli_67724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz jumbo porridge oats", "25g/1oz flaked bran or wheat germ", "75g/3oz barley or rye flakes (optional, you can always add more oats instead)", "50g/2oz hazelnuts, lightly crushed", "50g/2oz flaked almonds", "50g/2oz sultanas", "50g/2oz dried, ready-to-eat apricots, roughly chopped", "50g/2oz dried, ready-to-eat figs, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.", "Place the oats, flaked bran or wheat germ, barley or rye flakes, hazelnuts and almonds on a large baking tray and toast in the oven for 10 minutes, shaking and turning in the tray halfway through. Take the tray from the oven and leave to cool: this should take only about 10 minutes. ", "Mix the toasted ingredients with the sultanas, apricots and figs. These fruits are only suggestions: you can use whatever you prefer, for example dried apple, mango, papaya, dates or cherries. ", "You can eat this muesli straight away with milk or yoghurt, or you can store in an airtight container."]}, {"isVegetarian": true, "title": "Basic jasmine rice", "url": "www_bbc_co_uk_food_recipes_basicjasminerice_89261", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz jasmine rice, rinsed until the water runs clear", "600ml/1 pint boiling water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rice into a heavy-based saucepan and add the boiling water.  Bring to the boil and then cover with a tight-fitting lid and reduce to a low heat. Simmer for 15-20 minutes, or until all of the water has been absorbed and the rice is tender.", "Uncover the pan and remove from the heat. Fluff up the rice grains with a fork and serve immediately."]}, {"isVegetarian": true, "title": "Basic pancakes with sugar and lemon", "url": "www_bbc_co_uk_food_recipes_basicpancakeswithsuga_66226", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicpancakeswithsuga_66226_16x9.jpg", "ingredients": ["110g/4oz plain flour, sifted", "pinch of salt", "2 eggs", "200ml/7fl oz milk mixed with 75ml/3fl oz water", "50g/2oz butter", "caster sugar", "lemon juice ", "lemon wedges"], "serves": "Makes 12-14 small pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large mixing bowl with a sieve held high above the bowl so the flour gets an airing. Now make a well in the centre of the flour and break the eggs into it. Then begin whisking the eggs - any sort of whisk or even a fork will do - incorporating any bits of flour from around the edge of the bowl as you do so.", "Next gradually add small quantities of the milk and water mixture, still whisking (don't worry about any lumps as they will eventually disappear as you whisk). When all the liquid has been added, use a rubber spatula to scrape any elusive bits of flour from around the edge into the centre, then whisk once more until the batter is smooth, with the consistency of thin cream. Now melt the 50g/2oz of butter in a pan. Spoon 2 tbsp of it into the batter and whisk it in, then pour the rest into a bowl and use it to lubricate the pan, using a wodge of kitchen paper to smear it round before you make each pancake.", "Now get the pan really hot, then turn the heat down to medium and, to start with, do a test pancake to see if you're using the correct amount of batter. I find 2 tbsp is about right for an 18cm/7in pan. It's also helpful if you spoon the batter into a ladle so it can be poured into the hot pan in one go. As soon as the batter hits the hot pan, tip it around from side to side to get the base evenly coated with batter. It should take only half a minute or so to cook; you can lift the edge with a palette knife to see if it's tinged gold as it should be. Flip the pancake over with a pan slice or palette knife - the other side will need a few seconds only - then simply slide it out of the pan onto a plate.", "Stack the pancakes as you make them between sheets of greaseproof paper on a plate fitted over simmering water, to keep them warm while you make the rest.", "To serve, sprinkle each pancake with freshly squeezed lemon juice and caster sugar, fold in half, then in half again to form triangles, or else simply roll them up. Serve sprinkled with a little more sugar and lemon juice and extra sections of lemon."]}, {"isVegetarian": true, "title": "Basic tomato and basil sauce for pasta", "url": "www_bbc_co_uk_food_recipes_basictomatoandbasils_67840", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basictomatoandbasils_67840_16x9.jpg", "ingredients": ["3 tbsp extra virgin olive oil", "1 large onion, chopped", "2 garlic cloves, crushed", "3 x 400g cans of chopped tomatoes", "¼ - ½ tsp dried chilli flakes", "2 tsp balsamic vinegar", "2 tsp sugar", "1 large handful basil leaves, torn into small pieces", "Salt and freshly ground black pepper", "Grated parmesan, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and gently cook the onion and garlic until softened. Stir in the tomatoes, chilli flakes, balsamic vinegar and sugar. Bring to a simmer and cook slowly for 45 minutes-1 hour. Stir in the basil and season with salt and pepper. This can be left chunky or blended in a food processor for a smooth sauce.", "Serve spooned over cooked pasta with plenty of parmesan cheese."]}, {"isVegetarian": true, "title": "Basic tomato sauce", "url": "www_bbc_co_uk_food_recipes_basictomatosauce_92186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb ripe tomatoes, stalks cut out, cross cut in the bottom of each using a sharp knife", "100-150ml/3½-5fl oz olive oil", "4 large shallots, peeled, finely chopped", "sprig fresh thyme, leaves only", "4 garlic cloves, crushed to a paste with the edge of a knife"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil. Lower the tomatoes into the boiling water and boil for ten seconds, then remove them from the pan using a slotted spoon and immediately plunge them into a bowl of ice-cold water. ", "When the tomatoes have cooled, peel and discard the skins. Chop the tomatoes and discard the seeds. (Alternatively freeze the seeds and use them in stocks and sauces.) Continue to chop the tomato flesh to a pulp.", "Heat half of the olive oil in a saucepan over a medium heat. Add the shallots, thyme leaves and garlic and fry for 2-3 minutes, or until softened but not coloured. ", "Add the remaining olive oil and the chopped tomato pulp, then stir well to combine. ", "Cut a disc of greaseproof paper 1cm/½in smaller than the diameter of your saucepan. Cover the surface of the tomato sauce with the greaseproof paper disc (this will prevent the sauce from drying out as it reduces and cooks). Reduce the heat to its lowest setting and cook gently for at least an hour, or until the sauce has thickened. ", "When the mixture has cooked and thickened, set aside to cool slightly. (NB: The sauce can be split into portions and frozen until needed.)"]}, {"isVegetarian": true, "title": "Basic white rolls", "url": "www_bbc_co_uk_food_recipes_basicwhiterolls_89612", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basicwhiterolls_89612_16x9.jpg", "ingredients": ["500g/1lb 2oz unbleached strong white organic bread flour, plus extra for dusting", "1 tsp salt", "2 tsp dried yeast", "30g/1oz butter or lard, softened", "75ml/2½fl oz milk, warmed ", "225ml/8fl oz warm water", "oil, for greasing", "rice flour, for dusting", "butter, to serve"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["With your fingers, mix the white flour, salt and dried yeast in a bowl. ", "Rub the softened butter or lard into the flour mixture until the mixture resembles breadcrumbs. ", "Mix the warm milk with the water. ", "Add the milk mixture to the flour mixture and mix together with your hands until the dough is well combined. Bring the dough together into a ball.", "Using floured hands, knead the dough on a clean, floured work surface for 20-25 minutes, or until the dough is elastic and smooth. If necessary add a little more warm water to loosen the dough. ", "Return the dough to the bowl and cover with a clean damp tea towel or cling film. Set aside for 1-1½ hours in a warm place until the dough has doubled in size.", "When the dough has risen, return it to a floured work surface and knock it back. ", "Separate the mixture into eight parts and roll each into a ball. Flatten each slightly with the palm of your hand and transfer the rolls to a baking tray, placing them close together. Cover the tray with cling film and set aside for another hour, or until the rolls have doubled in size again. ", "Meanwhile, preheat the oven to 220C/425F/Gas 7.", "When the rolls have expanded, dust them with the rice flour and transfer them to the oven. Bake for 8-10 minutes, or until golden-brown and cooked through.", "To serve, separate the rolls and serve warm with butter."]}, {"isVegetarian": true, "title": "Basil and parsley-dressed pasta", "url": "www_bbc_co_uk_food_recipes_basilandparsleydress_86891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz basil leaves, finely chopped", "30g/1oz flatleaf parsley, finely chopped", "2 tbsp olive oil", "salt and freshly ground black pepper", "150g/5½oz dried pasta of your choice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chopped herbs in a bowl with the olive oil and season with salt and freshly ground black pepper.  Leave to infuse.", "Cook the pasta according to the instructions on the packet.  When the pasta is cooked, drain and stir in the oil and herbs. Serve immediately."]}, {"isVegetarian": true, "title": "Basil and summer fruit pudding with basil syrup", "url": "www_bbc_co_uk_food_recipes_basilandsummerfruitp_83779", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz mixed frozen fruits, defrosted", "1 punnet mixed fresh berries: strawberries, blackberries and raspberries, (strawberries trimmed and cut into quarters)", "50g/2oz caster sugar", "10 fresh basil leaves, roughly chopped", "14 thin slices white bread", "200g/7oz caster sugar", "110ml/4fl oz water", "1 large bunch fresh basil"], "serves": "Makes 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Place 150g/5½oz of the defrosted mixed fruit into a bowl.", "Add half the fresh berries, half the caster sugar and the basil leaves.", "Stir well and set to one side.", "Place the remainder of the frozen fruit and the sugar into a food processor and blend to a purée. ", "Pour the sauce through a fine sieve and set aside.", "Remove the crusts from the bread and, using a chefs' ring, cut out four circles to fit the bottom of four ramekins. Repeat this process to create lids for the pudding.", "With the remaining bread cut out slices to line the inner edge of each ramekin.", "Lightly oil the inside of each ramekin, then line with cling film. ", "Dip the small bread circles on one side in the fruit purée and place in the bottom of the mould, dipped-side down.", "Repeat with the bread slices to cover the sides, overlapping slightly.", "Fill the centre with the reserved basil-infused fruits and a drizzle of fruit purée (reserving some for the final rounds of bread) between the contents and press down well.", "Dip one side of the four remaining rounds of bread in the last of the fruit purée.", "Place in the fridge until ready to serve.", "To make the basil syrup, place the sugar and water into a saucepan over a high heat and bring to a simmer.", "Simmer for 6-8 minutes until a thick sugar syrup is formed, without caramelising the sugar.", "Add the basil leaves, then remove from the heat and leave to infuse and cool.", "Once cool, place into a food processor and blend to a sauce.", "Strain the basil syrup into a jug through a muslin-lined sieve.", "To serve, turn the puddings out onto a plate and garnish with any remaining fruit purée and place the remaining fresh berries over the top. Finish with a drizzle of basil syrup."]}, {"isVegetarian": true, "title": "Basil sorbet with individual blackberry and basil cream tarts", "url": "www_bbc_co_uk_food_recipes_basilsorbetwithindiv_88521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz caster sugar", "300ml/11fl oz water", "125g/4½oz basil leaves and stalks", "1 tbsp lemon juice", "300ml/11fl oz whole milk", "4 large stems fresh basil", "2 free-range egg yolks", "75g/3oz caster sugar", "20g/¾oz cornflour", "500g/1lb 2oz ready made puff pastry, rolled to 3mm/1/8in-thick", "1 free-range egg yolk, lightly beaten", "500g/1lb 2oz blackberries", "3 tbsp flaked almonds", "4 sprigs fresh basil, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sorbet, place the sugar, water and basil into a saucepan over a high heat. Bring to a boil and boil until the sugar has dissolved.", "Remove from the heat and leave to cool slightly before pouring the basil syrup into a food blender. Blend to a smooth consistency then pass through a sieve into a clean bowl using the back of a spoon to push the mixture through.", "Pour through a second sieve, lined with a piece of clean muslin or a clean kitchen cloth, into a clean bowl. Leave to cool.", "Once the mixture has cooled completely, transfer to an ice cream machine and churn until just frozen according to the manufacturer's instuctions. Transfer to a bowl and freeze until solid.", "Preheat the oven to 220C/428F/Gas 7. ", "For the basil cream, place the milk and basil into a saucepan and bring to the boil.", "Place the egg yolks, sugar and cornflour into a bowl and whisk to combine. Pour the hot milk onto the egg mixture and whisk until smooth.", "Return the mixture to the saucepan and cook over a gentle heat, stirring continuously, for 1-2 minutes, or until thick enough to hold its shape. Leave to cool.", "Meanwhile, for the tart, cut the pastry into four 13cm/5in squares and place onto a baking sheet. Brush the pastry with the beaten egg yolk. Use a sharp knife to score a line 1cm/0.5in in from the edge of the pastry, all the way round the squares, taking care not to cut all the way through (this will rise to create a crust around the edge when cooked).", "Divide the cooled basil cream evenly among each of the four pastry squares, spreading it gently up to the scored edges.", "Arrange the blackberries in rows over the top of the cream, scatter over the flaked almonds and transfer to the oven. Bake for 15-20 minutes, or until the pastry is crisp and golden-brown.", "To serve, place each tart on a serving plate and top each one with a ball of sorbet. Garnish with a sprig of basil."]}, {"isVegetarian": false, "title": "Basque beef with koji, creamed corn, grilled lettuce, enoki hay and red wine sauce", "url": "www_bbc_co_uk_food_recipes_basque_beef_with_koji_75586", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz beef trim from sirloin steak (see below)", "1-2 tbsp vegetable oil", "4 large banana shallots, sliced", "½ garlic clove", "1 bay leaf", "½ bunch thyme", "12 black peppercorns, cracked (optional)", "1 tbsp fennel seeds", "750ml/26fl oz veal or beef stock", "750ml/26fl oz red wine", "1½ tbsp extra virgin olive oil", "1 garlic clove, thinly sliced", "1 small banana shallot, thinly sliced", "3 thyme sprigs tied together with kitchen string", "200g/7oz sweetcorn", "1 tbsp unsalted butter", "4 tbsp shio koji (available online)", "250ml/9fl oz double cream", "salt and white pepper, to taste", "1 clump white enoki mushroom ", "2 x 250g/9oz Basque sirloin beef steaks", "100g/3½oz shio koji", "1 tbsp clarified butter", "1 Little Gem lettuce", "olive oil", "salt", "4 baby carrots, thinly sliced on a mandoline"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the red wine sauce, cook the beef trim in a pan with the oil until browned all over. Put the beef into a 3 litre/5¼ pints pressure cooker. ", "Using the same pan, cook the shallots with a little oil until caramelised. Add the garlic, bay leaf, thyme, peppercorns and fennel seeds. Cook out for 2-3 minutes to release the aromas. In the meantime heat up the stock in a pan to a simmer.", "Add the red wine to the shallot pan and bring to a boil. Cook until nearly all of the wine is reduced. Remove any scrum from the surface as you do so. ", "Add the stock and the wine mixture to the pressure cooker and set it up according to instructions. Cook under pressure for 2 hours. ", "Strain the liquid and add back to a pan. Cook to reduce the liquid until the sauce is silky and shiny. This should coat the back of a spoon.", "If you don’t have a pressure cooker, add the stock, red wine mixture and beef to the same pan. Heat and reduce in volume slowly. When the liquid starts to get thicker in consistency strain the herbs and shallots from the mixture and continue to reduce, removing any scrum as you go. This will make a red wine sauce but not as intensely flavoured as the pressure cooker version. ", "For the creamed corn, heat a small saucepan with the olive oil. Gently cook the garlic and shallot until translucent.", "Add the thyme and sweetcorn. Stir constantly for a couple of minutes until the sweetcorn is cooked, then add the koji. Cook for another couple of minutes to cook the koji.", "Stir occasionally to prevent the corn from catching on the bottom of the pan then add the cream. ", "Cook for 5 minutes or until thick and creamy, stirring occasionally. Season to taste.  Remove the thyme from the corn. Blend in a blender, in batches if necessary, keeping some corn aside to add back in after blending to give texture.", "For the enoki mushroom ‘hay’, discard the top and bottom of the mushrooms, and pull apart until separated into strands. Dehydrate in a dehydrator or dry oven (no fan), at 54C. This takes 30 minutes. Store in a dry space.", "To prepare the dish, preheat an oven to 120C/100C Fan/Gas ½.", "Marinate the beef in the shio koji for at least 10 minutes. Don’t wash off the koji, but place the meat onto a tray and gently bash it with your hand or a pan to flatten it (to make sure the meat is even, but don’t squash it entirely.", "Set up a griddle (flat side) to very hot.", "Start cooking the sirloin on the griddle. Keep moving the steak around on different spots of the griddle. The steak is finished when there is an even golden-brown colour on each side. ", "Place on a tray with the clarified butter and cook in the oven for 1-2 minutes (rare), 3-4 (medium rare).", "Cut the Little Gem lettuce in half, gently oil and season and place straight onto the very hot griddle. It will take 1-2 minutes to colour.", "Once the steak is cooked, rest for a couple of minutes on a board before carving. Check the seasoning - the meat shouldn’t need any salt but you could add some cracked black pepper, to taste.", "Cut lettuce by the base and break apart into leaves.", "Place the creamed corn, steak and lettuce on serving plates. Pour over some red wine sauce and finish with the dried mushroom hay on top and sliced carrots."]}, {"isVegetarian": false, "title": "Basque chicken pie", "url": "www_bbc_co_uk_food_recipes_basque_chicken_pie_70267", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basque_chicken_pie_70267_16x9.jpg", "ingredients": ["4 boneless, skinless chicken thighs, cut into bite-sized pieces", "2 tsp smoked paprika", "2 tsp flaked sea salt", "freshly ground black pepper", "2 tbsp olive oil", "2 medium onions, cut into 12 wedges", "1 green pepper, halved, seeded and sliced", "1 red pepper, halved, seeded and sliced", "3-4 sprigs fresh thyme", "2 bay leaves", "150g/5½oz chorizo sausage, skinned and cut into thin slices", "3 garlic cloves, crushed", "4 large ripe tomatoes (each about 100g/4½oz), skinned and roughly chopped", "2 tbsp flour", "225g/8oz plain flour, plus extra for dusting", "1 tsp baking powder", "½ tsp fine sea salt", "75g/2¾oz unsalted butter, plus extra for greasing", "1 medium egg yolk", "4–5 tbsp cold water", "1 egg, beaten, or full-fat milk, to glaze"], "serves": "Serves 4 - 5", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken pieces in a bowl and sprinkle over the paprika, salt and plenty of freshly ground black pepper. Rub the seasoning into the meat and set aside.", "Heat the oil in a large frying pan and fry the onions and peppers with the thyme and bay leaves for 3 minutes, while stirring. Add the chicken and seasoning and cook for another 3 minutes, turning the chicken regularly until it is starting to colour. Add the chorizo and garlic and fry for 2 minutes more. Add the tomatoes and cook for 5 minutes or until they are softened and juicy, stirring regularly.", "Tilt the pan so that the liquid runs to one side and sprinkle the flour over the vegetables, chicken and chorizo. Stir it in quickly, then set the pan level and stir the cooking liquor into the flour. Doing it this way should prevent little clumps of flour – but don’t worry if you do have a few, no-one will notice. Add more salt and pepper if necessary and continue to cook for one minute, stirring until the sauce thickens. Remove from the heat and tip everything into a roasting tin or ovenproof dish, measuring about 25x30cm/10x12in and at least 4cm/1½in deep. Leave to cool.", "For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. Slowly pour in the water with the motor running, blending until the mixture just comes together as a dough (you may not need to use all of the water). Form the dough into a ball. ", "Preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out into a rectangle about the same size as the tin. Place it over the pie filling and tuck the sides of the pastry down around the filling. Brush with beaten egg or milk to glaze.", "Bake for about 30 minutes or until the pastry is golden and the filling is hot."]}, {"isVegetarian": false, "title": "Basque chicken with artichoke and pepper salad", "url": "www_bbc_co_uk_food_recipes_basque_chicken_with_21426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 small red onions, cut into quarters", "1 red bell pepper, cored, seeds removed, cut into 1cm/½in thick strips", "1 green bell pepper, cored, seeds removed, cut into 1cm/½in thick strips", "6 garlic cloves, thinly sliced", "1 chicken, weighing about 1.6kg/3lb 8oz, cut into 8 pieces", "2 tsp piment d’Espelette (red chilli powder), available online or in specialty food stores", "1 tsp crushed red pepper flakes", "250ml/9fl oz dry white sherry", "1 lemon, juice only", "125g/4½oz fresh chorizo, cut into 5mm/¼in thick pieces", "extra-virgin olive oil", "250ml/9fl oz chicken stock or water", "4 plum tomatoes, halved lengthwise ", "sea salt and freshly ground black pepper", "2 large globe artichokes ", "5 tbsp extra-virgin olive oil", "1½ tbsp sherry vinegar", "1 tsp piment d’Espelette ", "2 garlic cloves, finely chopped", "125g/4½oz frisée leaves, white and light yellow parts only", "2 red bell peppers, cored, seeds removed, diced", "2 bunches of spring onions, trimmed, thinly sliced", "1 small red onion, thinly sliced", "4 tbsp fresh flatleaf parsley leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Basque chicken, put the red onion, peppers, and garlic in a single layer on a shallow roasting tin. Season the chicken pieces all over with salt, pepper, piment d’Espelette and the crushed red pepper flakes and add to the tin. Pour the sherry and lemon juice over the chicken. Cover the pan with cling film and leave to marinate in the fridge for at least 6 hours.  ", "When the chicken is almost ready to cook preheat the oven to 160C/140C Fan/Gas 3 and put a rack in the lower third of the oven", "Remove the chicken from the marinade. Strain the liquid and reserve, reserve the vegetables also. Pat the chicken dry and season it with salt and pepper once more. Put a casserole dish over medium-high heat and add olive oil to coat the base of the dish. Add the chorizo, cook for about 3 minutes and then remove and set aside. In the same pot, sear the chicken, skin-side down first, until golden-brown, then remove and set aside.  ", "Add the vegetables from the marinade to the same pan and cook until tender, this should take about 5 to 6 minutes. Pour the reserved marinade liquid into the pot and cook over a high heat until the volume of liquid has reduced by half. Return the chicken and the chorizo to the pot and stir in the stock, and tomatoes. Bring to a simmer, and transfer to the oven, uncovered. Braise until the chicken legs are tender and the chicken is fully cooked through, this should take about 45 minutes.", "Meanwhile prepare the salad. Peel the outer layer of the artichokes, trim the stem and scoop away the inside. Place the artichokes in water with a little lemon juice to stop them going brown.", "In a small bowl, whisk together the olive oil, sherry vinegar, piment d’Espelette and garlic. Season with salt. Thinly slice the artichokes, preferably on a mandolin, and add the whisked oil. Toss to combine and season with more salt if necessary.", "In a large salad bowl, toss together the frisée leaves, bell peppers, spring onions, red onion and parsley. Serve the Basque chicken with the salad alongside."]}, {"isVegetarian": true, "title": "Batata vada with tamarind sauce", "url": "www_bbc_co_uk_food_recipes_batata_vada_with_68469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 floury potatoes, left whole", "1 tbsp vegetable oil", "100g/3½oz urid dal lentils (black gram)", "1 tsp black mustard seeds", "8–10 curry leaves", "pinch ground turmeric", "1 tbsp finely grated fresh root ginger", "2 garlic cloves, crushed", "1 green chilli, finely chopped", "pinch salt", "squeeze lemon juice", "100g/3½ gram flour (chickpea flour)", "pinch salt", "¼ tsp ground turmeric", "1 tsp baking powder ", "½ tsp chilli powder", "sunflower oil, for deep frying", "50g/1¾oz tamarind purée", "1 tsp ground cumin, roasted", "½ tsp hot red chilli powder", "pinch ground ginger ", "pinch salt", "4–5 tbsp jaggery"], "serves": "Makes 16", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of water to the boil and cook the potatoes for 20 minutes, or until tender to the point of a knife. Allow to cool. Remove the skins and mash the flesh, then set aside.", "Add the vegetable oil to a large saucepan over a low heat and stir in the urad dal to toast for a few minutes. Add the mustard seeds, curry leaves, turmeric, ginger, garlic and chilli and cook for 30 seconds.", "Add the mashed potatoes, mix well and season with salt and lemon juice. Remove from the heat and make 12–16 balls using a mini ice-cream scoop. Cover and refrigerate until firm.", "Meanwhile, to make the batter, mix everything together with 110ml/4fl oz water in a bowl. Cover and chill until ready to use.", "To make sauce, put all the ingredients except the jaggery, in a large saucepan with 100ml/3½fl oz water. Bring to the boil over a high heat, simmer for 1 minute then add the jaggery and bubble until thickened. ", "Heat the oil in a deep saucepan to 170C or until a cube of bread browns in 30 seconds. Taking one ball at a time, dip into the batter, shake off any excess and deep-fry for 4–5 minutes, or until golden. Serve with the tamarind sauce."]}, {"isVegetarian": true, "title": "Battenberg cake", "url": "www_bbc_co_uk_food_recipes_battenburg_cake_60878", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/battenburg_cake_60878_16x9.jpg", "ingredients": ["175g/6oz softened butter, plus extra for greasing", "175g/6oz golden caster sugar", "3 free-range eggs", "175g/6oz self-raising flour", "½ tsp vanilla extract", "red food colouring paste", "6 tbsp apricot jam", "500g/1lb 2oz ready-made marzipan", "2–3 tbsp icing sugar, for rolling."], "serves": "Makes 1 cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Grease a 20cm/8in square, loose-based cake tin with butter. ", "Take a 30cm x 20cm/12in x 8in strip of baking parchment and make a 8cm/3in fold in the centre. This will create a division in the cake so that the two differently coloured sponges can be cooked at the same time. ", "Line the tin with the baking parchment, keeping the division in the centre.", "Put the butter, sugar, eggs, flour and vanilla in a food processor and pulse until well combined. ", "Transfer the batter to a bowl set on scales, remove half of the batter and put it in a different bowl. ", "Add a small dab of red food colouring to one bowl and fold it into the batter until it is well blended.", "Spoon the cake batters into each side of the prepared tin and smooth the surface with the back of a spoon. ", "Bake in the centre of the oven for about 25 minutes, or until the sponges have risen. Cool in the tin for five minutes, then slide a knife around the outside of each sponge and turn them out onto a wire rack. If the sponges have risen unevenly, press the surface gently until level. Leave until completely cold.", "To assemble the cake, first place one sponge on top of the other and trim off the crusty edges so they are both the same size. Cut the sponges in half lengthways to make four long rectangles. ", "Warm the apricot jam in a saucepan then press through a fine sieve. ", "Brush the long side of one of the sponges with jam and sandwich together with a sponge of a contrasting colour. Do the same with the other two sponges. ", "Sandwich the two pairs of sponges together like a checker board and brush the top and sides with jam.", "Place the marzipan on a surface dusted with icing sugar and roll into a rectangle of about 40cm x 20cm/16in x 10in; it should be large enough to wrap the cake completely, leaving the ends exposed, and be about 5mm/¼in thick. ", "Turn the cake upside down on the marzipan and brush the underside of the sponges with jam. ", "Wrap the marzipan around the cake, pressing it gently onto the surface of the sponges, and press the edges together to make a firm join. ", "Turn back over with the seam underneath, trim a thin slice off each end and place on a serving plate."]}, {"isVegetarian": false, "title": "Battered cod with chips and homemade tomato ketchup", "url": "www_bbc_co_uk_food_recipes_battered_cod_with_chips_15260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9floz red wine vinegar", "1 bay leaf", "½ tsp ground coriander", "½ tsp ground cinnamon", "75g/3oz light soft brown sugar", "4 x 400g/14oz tinned tomatoes", "1 tsp salt", "1 tbsp English mustard powder", "1 garlic clove, crushed", "Tabasco sauce, to taste", "2 tbsp tomato purée", "1-2 tbsp cornflour", "400g/14oz floury potatoes, peeled and cut into thick batons 6cm/2½in long and dried on kitchen paper", "15g/2/3oz fresh yeast", "pinch sugar", "200ml/7floz beer", "1 tsp cider vinegar", "200g/7oz plain flour", "pinch salt", "4 x 175g/6oz cod fillet, skinned and pin bones removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato ketchup, place the vinegar, bay leaf, spices and sugar in a heavy-based pan and bring to a simmer. ", "Add the remaining ingredients and bring to the boil, stirring to prevent any sticking. ", "Reduce the temperature and simmer, stirring frequently for 30 minutes - be careful the mix doesn’t catch and burn.", "Blend in a food processor or liquidizer and strain the sauce through a sieve.", "If you find the sauce too thin once cold, then simply re-boil and thicken with a little cornflour mixed to a paste with water, being careful not to make it to starchy and too thick. This will prevent the tomato water separating from the sauce.", "Heat a deep fat fryer to 170C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended). ", "Place the potatoes into the fat fryer in batches and cook for 2-3 minutes until just tender but not coloured.", "Drain onto kitchen paper and turn up the fat fryer to 190C/375F.", "Sprinkle the yeast and sugar into a mixing bowl. ", "Pour over the beer and vinegar and whisk in the flour.and salt  ", "Leave to ferment – it is ready to use when the mixture starts to bubble. ", "Dip the cod fillets into the batter and fry until golden-brown and cooked through – about 3-4 minutes. ", "Remove with a slotted spoon and drain on kitchen paper.  ", "Keep warm on a tray in the oven if necessary.", "Place the semi cooked chips back into the fat fryer in batches and cook for another 2-3 minutes until golden-brown and crisp.", "To serve, pile the chips onto the plate and place the cod alongside. Serve with a dollop of tomato ketchup."]}, {"isVegetarian": false, "title": "Battered pollock baguettes with mushy peas and lemon mayonnaise", "url": "www_bbc_co_uk_food_recipes_battered_pollock_81633", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dried marrowfat peas", "1 tsp bicarbonate of soda", "25g/1oz butter", "salt and freshly ground black pepper ", "2 free-range egg yolks", "1 tsp English mustard", "300ml/10½fl oz rapeseed oil", "2 lemons, zest and juice", "200g/7oz plain flour", "15g/½oz fresh yeast", "pinch caster sugar", "pinch salt", "1 tbsp cider vinegar", "200ml/7fl oz beer", "dripping or vegetable oil, for deep frying", "1kg/2lb 4oz pollock fillets, skin on, pin bones removed, cut into 5cm/2in fishfingers ", "sea salt, to taste", "1 long baguette, cut in half lengthways", "50g/1¾oz butter, softened"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the mushy peas, measure the peas in a jug. Pour them into a large bowl and cover with 3 times their volume of cold water. Add the bicarbonate of soda and soak for at least 12 hours, or preferably overnight.", "Drain the soaked peas and rinse them under cold water. ", "Bring the soaked peas to the boil in a large pan of cold water. Reduce the heat until the water is simmering and simmer for 1½-2 hours, covered, stirring from time to time, or until the peas are mushy in texture but not too dry. If they are still wet in texture after 2 hours, continue cooking, uncovered, to dry out a little. ", "Beat in the butter and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the lemon mayonnaise, blend the eggs and mustard in a food processor until pale and creamy. With the motor still running, gradually add the oil in a thin stream, until the mixture thickens to a smooth, thick mayonnaise (you may not need all of the oil). Stir in the lemon zest and juice and season, to taste, with salt and freshly ground black pepper. Chill in the fridge until needed. ", "For the battered pollock, mix the flour, yeast, sugar, salt and vinegar together in a large bowl until well combined. Whisk in the beer until the mixture comes together as a thick, smooth batter.", "Set the batter aside to ferment for about 30 minutes. It is ready to use when the mixture starts to bubble.", "Heat the dripping or vegetable oil in a deep-fat fryer to 190C, or heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Dip each piece of fish in the batter to coat thoroughly. Lower the fish fingers into the hot oil in batches, and fry for 4-6 minutes, or until the fish is cooked through and the batter is golden-brown. Remove the fish fingers from the oil using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt.", "When all of the fish has been cooked, drizzle the remaining batter into the hot oil and fry until crisp and golden-brown. ", "To serve, butter the baguette halves, then spread them with the mushy peas. Fill the baguette with the pieces of pollock, then drizzle over the lemon mayonnaise. Sprinkle over the scraps of batter. Cut the filled baguette into slices and serve on a platter for people to help themselves."]}, {"isVegetarian": false, "title": "Bauble and squeak", "url": "www_bbc_co_uk_food_recipes_bauble_and_squeak_09032", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bauble_and_squeak_09032_16x9.jpg", "ingredients": ["50g/2oz butter ", "1 red onion, sliced", "6 juniper berries", "200g/7oz leftover goose, torn into pieces", "200g/7oz leftover ham, torn into pieces", "200g/7oz leftover roast pumpkin, cut into chunks", "100g/3½oz leftover stuffing", "8 leftover roast potatoes, cut into chunks", "5 rashers leftover bacon, chopped into large pieces", "6-8 raw Brussels sprouts, halved"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large pan and fry the red onion until softened.", "Crush the juniper with a mortar and pestle and add to the onions.", "When the onions are browning, stir in the remaining ingredients. With a fork, mash the potatoes and pumpkin, distributing it evenly to bind the meat. ", "Add the Brussels sprouts and cook through for 15 minutes, adding more butter if needed. (If you only have leftover cooked Brussels, you can add these, but cook for about five minutes.)"]}, {"isVegetarian": false, "title": "Battered sea bream with mushy peas, bread and butter", "url": "www_bbc_co_uk_food_recipes_battered_sea_bream_with_99418", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dried marrowfat peas", "1 tsp bicarbonate of soda", "75g/3oz butter", "4 fillets sea bream, pin boned", "3 free-range eggs, yolks and whites separated", "75g/3oz plain flour", "75ml/3fl oz sparkling water", "sea salt", "freshly ground black pepper", "4 slices thick white bread", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Soak the peas in a large bowl, in three times their volume of water with the bicarbonate of soda for at least four hours or, if you have the time, overnight.", "Drain the peas, rinse under the tap, and place on the stove in a large pan and cover with the water. Cover and bring to the boil and once boiled, reduce the heat and simmer the peas for 1½-2 hours, stirring from time to time. ", "The peas should be soft and mushy in texture but not too dry. If they are wet, continue cooking over the heat with the lid off to dry out a little. Beat in the butter and season.", "Heat the oil for deep-frying in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the egg yolks and flour into a bowl and whisk to combine to a thick batter.", "Whisk the egg whites in a separate bowl until soft peaks form when the whisk is removed.", "Fold this into the batter, alternating with the sparkling water to make a light fluffy batter.", "Dip the sea bream through the batter and fry for 3-4 minutes, or until golden-brown. (You may need to do this in batches.) Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. ", "To serve, place the fish onto the plate, butter the bread and set alongside. Finish with a spoonful of mushy peas and wedge of lemon."]}, {"isVegetarian": true, "title": "Christmas cocktail", "url": "www_bbc_co_uk_food_recipes_bbc_four_cocktail_68933", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbc_four_cocktail_68933_16x9.jpg", "ingredients": ["50ml/2fl oz good-quality bourbon whiskey", "1 tbsp cherry juice", "1 tsp cherry brandy", "1 tbsp orange liqueur", "35ml/1¼fl oz pink grapefruit juice", "dash of grapefruit bitters (10 drops)", "dash of Peychauds bitters (10 drops)", "ice, to serve", "grenadine, for frosting", "caster sugar, for frosting", "1 red chilli, preferably bird's eye", "ribbon of grapefruit zest"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To frost the rim of the cocktail glass, pour a little grenadine into a shallow bowl and put a little sugar on a plate. Dip the rim of the glass in the grenadine and then coat with the sugar. ", "Put all the cocktail ingredients in a cocktail shaker and shake.", "Put ice in the glass and pour over the cocktail.", "Decorate with the chilli and grapefruit. "]}, {"isVegetarian": false, "title": "BBQ ‘beer-can’ chicken", "url": "www_bbc_co_uk_food_recipes_bbq_beer-can_chicken_80142", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbq_beer-can_chicken_80142_16x9.jpg", "ingredients": ["4 tbsp light golden ale, plus 500ml/17floz to marinade the chicken, plus 300ml/10½fl oz light golden ale for roasting (reserve the empty beer can)", "90g/3oz malt extract", "½ tsp chilli powder", "½ tsp English mustard powder", "½ tsp crushed garlic", "½ tsp smoked paprika", "½ tsp muscovado sugar", "1 x 2kg/4lb 4oz chicken, preferably free-range", "160g/5½oz butter", "pinch salt"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the chicken, mix four tablespoons of the ale, the malt extract, chilli powder, mustard, garlic, smoked paprika and sugar together in a bowl to make a paste.", "Rub the paste all over the chicken and set aside to marinate for three hours. Pour over 500ml/18fl oz of ale and leave to marinade overnight", "Preheat the barbecue (it is best to use a barbecue with a lid) or alternatively preheat the oven to 190C/375F/Gas 5.", "Rinse the marinade off the chicken and pat dry. Carefully smear the butter under the chicken skin and over the thighs and season with salt. Pour the 300ml/10½fl oz ale into the reserved beer can, then carefully place the chicken onto the beer can, so that the chicken is sitting upright, with the can in its cavity.", "Roast the chicken for 40-45 minutes, basting a couple of times. Remove the chicken from the barbecue or oven and set aside to rest for 15 minutes."]}, {"isVegetarian": false, "title": "B.B.L.T (belly, brioche, lettuce and tomato)", "url": "www_bbc_co_uk_food_recipes_bblt_belly_brioche_70548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-1.5kg/2lb 4oz-3lb 5oz pork belly", "1 bulb garlic", "1 Spanish onion, peeled and halved", "½ head celery, roughly chopped", "20 peppercorns", "2 bay leaves", "small bunch thyme", "250ml/9fl oz vegetable oil", "125g/4½oz streaky bacon, coarsely chopped", "1 large egg yolk", "½ tsp rice wine vinegar", "½ tsp Dijon mustard", "1 tbsp lemon juice", "2 tbsp light soy sauce", "20ml/¾fl oz olive oil", "1 small red onion, finely chopped", "2 small garlic cloves, crushed", "1 tsp smoked paprika", "1 lemongrass stalk, trimmed and finely chopped", "2 tsp caster sugar, or to taste", "1 tsp red wine vinegar", "2 tsp fish sauce", "1 tsp lime juice", "200g/7oz vine-ripened plum tomatoes", "olive oil", "4 brioche burger buns, halved", "4 crisp Little Gem lettuce leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork belly, place all the ingredients in a large pan and pour in enough water to cover the pork by 3-4cm/1-2in. Bring the liquid to a simmer and skim off any froth or scum that rises to the surface. Once the water is reasonably clear, place a crumpled piece of baking parchment, cut to the diameter of the pan, on top of the pork belly. This will help to keep the moisture in the pan during cooking.", "Gently simmer the pork belly for two hours until it is very tender. There should be no resistance when you pierce it with a knife. Let the belly cool completely in the cooking liquid. ", "Lift the cooled pork out of the pan and place on a baking tray. Cover with cling film and refrigerate for at least an hour until it has firmed up, which will make it easier to slice. Once firm, remove the pork belly from the refrigerator and cut into individual portions. ", "While the pork is cooking, make the bacon mayonnaise. Heat the oil in a small pan over a low heat, add the bacon and gently fry until it has rendered all of its fat. ", "Strain the bacon through a fine sieve and reserve the bacon flavoured oil. (The bacon is not used in this recipe.) Let the oil cool to room temperature before you begin to make the mayonnaise or it may split. ", "Whisk the egg yolk, vinegar and mustard together in a large bowl. Whisking continuously, drizzle the cooled bacon oil slowly into the bowl in a steady stream to create an emulsion. Once all the oil has been incorporated, add the lemon juice and soy sauce, which will thin down the mayonnaise. Taste and adjust the seasoning to taste. Cover the bowl and refrigerate until ready to use.", "For the tomato chutney, heat the oil in saucepan and add the onion. Cook the onion over a medium heat for 8-10 minutes, stirring occasionally, until soft and translucent. Add the garlic, paprika and lemongrass, and stir well. Gently cook for another five minutes, stirring every once in a while. ", "Heat the sugar in another dry pan until it melts and begins to caramelise to a golden-brown colour. Add the red wine vinegar and fish sauce to the caramel. If the caramel hardens upon contact with the liquid, stir the mixture for a few minutes until it dissolves. Pour this over the onion mixture and add the lime juice. Cook for a minute and add the diced tomatoes and stir well. Cook for a further minute then remove the pan from the heat.", "When you are about ready to serve, remove the thick rind from the pork belly. Heat a thin layer of olive oil in a frying pan. Add the pork belly pieces and fry for about two minutes on each side until golden-brown and warmed through. Toast the brioche buns and spread some bacon mayonnaise on the bottom halves.  Arrange a few lettuce leaves on each brioche base, then place pork belly pieces and a generous spoonful of tomato chutney on top. Cover with the brioche lids and serve at once."]}, {"isVegetarian": false, "title": "BBQ chicken with coleslaw", "url": "www_bbc_co_uk_food_recipes_bbq_chicken_with_52315", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbq_chicken_with_52315_16x9.jpg", "ingredients": ["100ml/3½fl oz cider vinegar", "2 tbsp dark brown sugar", "1 tsp smoked paprika", "1 tbsp Dijon mustard", "1 tbsp dark soy sauce", "½ tsp sea salt and black pepper", "4 boneless chicken thighs, skin on", "½ small red cabbage, finely sliced", "2 carrots, coarsely grated", "1 small/½ large red onion, finely sliced", "8 radishes, sliced", "3 spring onions, very finely sliced", "2 limes, juice only ", "2 tsp black onion seeds", "1 tbsp sunflower seeds ", "1 tbsp pumpkin seeds  ", "small bunch fresh coriander, finely chopped", "small bunch fresh mint, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the glaze for the chicken, combine the vinegar with 100ml/3½fl oz water in a saucepan. Add the sugar, smoked paprika, mustard and soy sauce. Stir to combine then bring to the boil. Reduce the heat and simmer for 10 minutes, or until thickened. Remove from the heat and season to taste with salt and pepper.", "Meanwhile, add the ingredients for the coleslaw to a large bowl, toss to combine and season to taste.", "Heat a griddle pan over a high heat until smoking hot. Open the chicken thighs out and season with salt and pepper. Place the chicken skin-side down on the griddle and fry for 3-4 minutes. ", "Brush the chicken with a little glaze then turn and cook for a further 3-4 minutes, brushing occasionally with the glaze as you cook. Turn off the heat and rest for five minutes. ", "Slice thickly and serve with the coleslaw. Drizzle with any sticky cooking juices before serving."]}, {"isVegetarian": false, "title": "BBQ fillet steak with grilled mushrooms and peppercorn sauce", "url": "www_bbc_co_uk_food_recipes_bbq_fillet_steak_with_56885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz floury potatoes, cut into large chunks", "2 x 150–200g/5–7½oz beef fillet steaks", "2 Portobello mushrooms", "50ml/2fl oz Madeira ", "40g/1½oz butter, cut into cubes", "2 fresh thyme sprigs", "350ml/12fl oz double cream", "100ml/3½fl oz olive oil", "1 bay leaf", "2 garlic cloves, 1 whole and 1 thinly sliced", "200g/7oz wild mushrooms", "2 tsp finely chopped fresh parsley", "100ml/3½fl oz Worcestershire sauce", "2 tbsp green peppercorns, crushed", "salt and freshly ground black pepper "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in salted water for 15–20 minutes, or until tender. ", "Meanwhile, heat a barbecue or griddle to hot. Grill the beef fillets and Portobello mushrooms for 3–4 minutes on each side for medium-rare. Increase the cooking time for well done. ", "Heat the Madeira in a frying pan and whisk in most of the butter until you have a smooth sauce. Add a thyme sprig and then the cooked steaks. Remove from the heat, cover and allow the steaks to rest in the sauce. Keep the Portobello mushrooms warm.", "Pour 100ml/3½fl oz of double cream into a saucepan. Add the olive oil, remaining thyme sprig, the bay leaf and whole peeled garlic clove. Bring to a simmer, turn off the heat and set aside to infuse for 15 minutes. ", "Drain the potatoes and mash well until smooth. Strain the herby cream through a sieve and beat it into the potatoes until you have a very soft mash. ", "Melt the remaining butter in a large frying pan and add the sliced garlic. Add the wild mushrooms and sauté, stirring occasionally, for 5–10 minutes. Season and stir in the parsley.", "Remove the steaks from the sauce and slice into thin strips. Add the Worcestershire sauce to the Madeira sauce and reduce until you have about 3 tablespoons. Stir in the remaining double cream and the peppercorns. ", "Spoon the mashed potato into the middle of two serving dishes. Place the Portobello mushroom in the centre and lay the beef sliced on top. Spoon over the wild mushrooms and serve with the sauce. "]}, {"isVegetarian": false, "title": "BBQ raspberry marshmallows with raspberry sauce", "url": "www_bbc_co_uk_food_recipes_bbq_raspberry_24234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb granulated sugar", "1 tbsp liquid glucose", "9 gelatine sheets, soaked in 140ml/4¾fl oz water", "2 free-range egg whites", "1 tsp vanilla extract", "vegetable oil, for greasing", "125g/4½ oz raspberries, lightly crushed", "5-6 tbsp icing sugar", "5-6 tbsp corn flour", "250g/9oz raspberries ", "2 tbsp\ticing sugar"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the marshmallows, place the granulated sugar, glucose and 200ml/7fl oz water into a heavy-based saucepan and bring to the boil. Heat until a sugar thermometer shows 127C/260F.", "Add the soaked gelatine sheets and water to the hot sugar syrup. Stir the mixture and pour it into a jug.", "Place the egg whites into a grease-free bowl and whisk until firm peaks. ", "Continue to whisk the egg whites, then pour the sugar syrup onto the egg whites, whisking all the time until the whites are shiny.", "Add the vanilla extract and continue to whisk for about 5-10 minutes until the mixture is thick enough to hold its shape on a whisk.", "Lightly oil a shallow 30cm x 20cm/12in x 8in baking tray. Dust the tray with icing sugar and corn flour. ", "Spoon in half the mixture and scatter the raspberries over the top. Cover with the remaining mixture, smoothing the top with a wet palette knife. Chill in the fridge for at least one hour.", "For the raspberry sauce, place all of the ingredients into a food processor and blend until a smooth purée. Pass the mixture through a fine sieve using a spatula or spoon.", "Remove the marshmallow from the fridge, dust some more icing sugar and corn flour over the work surface. Loosen the edge of the marshmallow then turn out onto the dusted work surface.", "Cut into squares and roll the marshmallows in the icing sugar and corn flour to coat.", "Preheat the grill to high or use a barbecue.", "Carefully place the marshmallows onto a wooden skewer. Grill for 1-2 minutes until slightly charred and gooey. ", "Serve the skewers of marshmallows with a bowl of raspberry sauce."]}, {"isVegetarian": false, "title": "BBQ Mackerel with a radish salad, cucumber and borage", "url": "www_bbc_co_uk_food_recipes_bbq_mackerel_with_a_97497", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8-12 radishes, with their tops on ", "6 tbsp cider vinegar", "3 tbsp cold pressed rapeseed oil, plus extra for the mackerel ", "1 tbsp caster sugar", "salt and freshly ground black pepper", "½ cucumber, peeled, slit down the middle and seeds removed, thinly sliced", "15g/½oz chives, finely chopped ", "4 mackerel fillets, pin-boned", "handful borage flowers, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the radishes well, cut off their tops and tear up to use as the salad leaf. (If your radishes are already trimmed then regular salad leaves will do as your salad). Thinly slice all the radishes, keep to one side.", "In a bowl place the vinegar, the rapeseed oil and sugar. Then season with salt and pepper and mix.", "Add the radishes and mix, then add the cucumber and chives and mix well. ", "Preheat a barbecue or, alternatively, heat a grill or a non-stick pan if it's raining. Season the mackerel with salt, pepper and drizzle it with a little more oil. Cook for about three minutes each side, depending on the cooking method.", "While the fish is cooking, add the radish leaves (or salad leaves if using) to the bowl and mix well.", "To serve, share the salad between four plates and add the dressing. Place a fillet of cooked mackerel on each plate and, garnish with the borage flowers."]}, {"isVegetarian": false, "title": "BBQ chicken breast with zucchini sauce", "url": "www_bbc_co_uk_food_recipes_bbqchickenbreastwith_12161", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts, skin off", "3 large zucchinis (courgettes), sliced ½cm/¼in thick", "4 cloves garlic, chopped roughly", "extra virgin olive oil", "sea salt and freshly ground black pepper", "290ml/½ pint water or chicken stock", "50g/2oz softened butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat plenty of extra virgin olive oil in a large frying pan.", "Add the garlic and sea salt, and fry for a couple of minutes.", "Add the zucchini and a touch more salt, and continue frying, stirring continuously to get the zucchinis moving.", "Add the water or stock and allow to simmer for 2 or 3 minutes, until the zucchini is well softened.", "Remove half the zucchini from the pan and blend roughly with the butter. Return this to the pan and add pepper, salt and a dash more olive oil.", "Meanwhile, sprinkle the chicken breasts well with salt and extra virgin olive oil and char-grill for a couple of minutes on each side to produce a criss-cross effect. Be sure to add another dash of salt to the chicken breasts when you turn them. This melts into the meat as it rests. Rest the chicken breasts for 2 minutes.", "To serve, spoon the zucchini sauce onto serving plates and place the chicken over the top with a dash of extra virgin olive oil and a sprinkling of freshly ground black pepper."]}]