[{"isVegetarian": true, "title": "Pea and mint soup", "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_76612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ red onion, peeled and diced", "2 garlic cloves, peeled and crushed", "½ pt vegetable stock", "handful fresh mint ", "handful fresh peas", "drizzle cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and sauté the onion and garlic for 2-3 minutes, to soften.", "Pour in the stock and bring to the boil. Add the mint and peas.  Reduce the heat and simmer gently for 8-10 minutes.", "Transfer the mixture to a liquidiser and blend until smooth.", "Return to the pan to warm through and add the cream, salt and freshly ground black pepper.", "Ladle into soup bowls to serve."]}, {"isVegetarian": true, "title": "Pea soup", "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_81285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 clove garlic, chopped", "½ onion, chopped", "200g/7oz frozen peas", "300ml/10fl oz hot chicken stock (vegetarians may substitute vegetable stock)", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "mint leaf, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the onion and garlic and fry for 3-4 minutes, until softened.", "Add the frozen peas and chicken stock and bring to the boil. Reduce the heat and simmer for ten minutes.", "Add the cream and use a hand blender to liquidise the soup.", "Season, to taste, with salt and freshly ground black pepper and serve in a warm bowl, garnished with a mint leaf."]}, {"isVegetarian": false, "title": "Pea and mint soup", "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_84089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "½ onion, chopped", "1 garlic clove, finely chopped", "300ml/½pint chicken stock", "300g/10½oz peas", "2 tbsp double cream", "2 tbsp fresh mint, chopped", "Fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan over a medium heat, and when bubbling add the onion and garlic and cook, for five minutes, or until softened. ", "Add the chicken stock, peas, cream and mint to the saucepan and simmer for two minutes.", "Blend the soup mixture with a hand blender and pour into a clean bowl.", "To serve, garnish with chives."]}, {"isVegetarian": false, "title": "Pea and mint soup", "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_89420", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peaandmintsoup_89420_16x9.jpg", "ingredients": ["1 litre/1 pint 15fl oz water", "salt", "large handful fresh mint, leaves only", "500g/1lb 2oz fresh peas (shelled weight)", "salt and freshly ground black pepper", "drizzle olive oil", "200ml/7fl oz crème fraîche", "4 slices Parma ham, fried or grilled until crisp (optional), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the water to the boil in a large pan and add a generous pinch of salt.  ", "Add the mint leaves and bring the liquid back to the boil. ", "Add the peas and cook for 2-3 minutes, until the peas are just tender and bright green.", "Strain the mint and peas, reserving the cooking liquid, and transfer the peas and mint to a food processor. Allow to cool for 3-4 minutes. ", "Add just enough of the cooking liquid to cover the peas and mint, then blend for 1-2 minutes, to create a smooth, bright green purée.", "Season, to taste, with salt and freshly ground black pepper and add a generous drizzle of olive oil. ", "Add 140ml/4½fl oz of the crème fraîche to the pea and mint purée and pulse in the blender for a few seconds, until combined.", "To serve, pour equal amounts of the soup into four warmed bowls. Add a neat tablespoon of crème fraîche into the centre of each and, if you wish, garnish with the crisp Parma ham."]}, {"isVegetarian": true, "title": "Pea and mint soup with a soft poached egg", "url": "www_bbc_co_uk_food_recipes_peaandmintsoupwithas_90681", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 garlic clove, crushed to a paste in a mortar and pestle", "100g/3½ oz fresh peas", "400ml/14fl oz chicken or vegetable stock", "2 tbsp chopped fresh mint", "3 tbsp double cream", "salt and freshly ground black pepper", "3 tbsp white wine vinegar", "1 free-range egg"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the olive oil in a pan and gently fry the onion and garlic for 3-4 minutes, or until softened. Add the peas and stock and leave to simmer for 4-5 minutes, or until the peas are tender. ", "Stir in the mint and cream and season, to taste, with salt and freshly ground black pepper. Using a stick blender, process the soup until smooth. Keep warm. ", "For the soft poached egg, bring a pan of water to the boil, then add the vinegar and reduce to a gentle simmer. Crack the egg into a bowl. Using a ladle, swirl the water in the pan to create a whirlpool, then carefully pour the egg into the centre of the whirlpool. Poach for 2-3 minutes, or until the whites are just set, then remove with a slotted spoon and drain on kitchen paper. ", "To serve, spoon the soup into a bowl and top with the poached egg."]}, {"isVegetarian": true, "title": "Pea and mint soup with toast", "url": "www_bbc_co_uk_food_recipes_peaandmintsoupwithto_85317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "½ onion, finely chopped", "1 garlic clove, chopped", "100g/3½oz frozen peas", "150ml/¼ pint vegetable stock", "handful fresh mint leaves, chopped", "2 tbsp double cream", "salt and freshly ground black pepper ", "2 slices crusty white bread", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the butter in a saucepan and gently fry the onion until softened but not coloured. Add the garlic and cook for one minute.", "Add the peas and vegetable stock. Bring to the boil, reduce the heat and simmer for 4-5 minutes.", "Add the mint and double cream and simmer until slightly thickened.", "Pour the mixture into a food processor, season, to taste, with salt and freshly ground black pepper and blend until smooth.", "For the toast, heat a griddle pan until hot. Drizzle the bread with olive oil and chargrill on both sides until crisp and toasted.", "To serve, place the soup into a bowl with the toast alongside."]}, {"isVegetarian": false, "title": "Pea and pecorino risotto", "url": "www_bbc_co_uk_food_recipes_peaandpecorinorisott_70243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "50g/2oz butter", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "400g/14oz risotto rice", "150ml/5oz white wine", "1.5 litres/2½ pints hot chicken stock", "450g/1lb frozen peas", "25g/1oz grated pecorino cheese", "handful fresh mint, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large heavy-based saucepan and add the oil and half the butter. Heat until it is foaming then  add the onion and gently cook for about 5 minutes until beginning to soften. Add the garlic and cook for  a few minutes then stir in the rice and heat through for a minute until shiny and opaque.", "Pour in the wine and boil for 1 minute to allow the alcohol to evaporate, stirring constantly. Turn  down the heat to medium heat and begin to add the stock a ladleful at a time allowing the liquid to be absorbed into the rice before adding more. ", "After 15 minutes of cooking, add the frozen peas and cook for another 5-7 minutes.", "When the rice feels soft and fluffy and the texture is creamy but each grain is still firm to the bite in the centre the risotto is ready. At this point take the risotto of the heat and stir in the  remaining butter, cheese and mint and season to taste. Leave to rest with the lid on for a few minutes  then serve immediately."]}, {"isVegetarian": false, "title": "Pea and spinach risotto with pan-fried sea bream and pea oil", "url": "www_bbc_co_uk_food_recipes_peaandspinachrisotto_93617", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "1 onion, peeled, finely chopped", "1 garlic clove, peeled, finely chopped", "250g/9oz arborio rice ", "150ml/5fl oz dry white wine", "1 litre/1 pint 15fl oz hot chicken stock", "200g/7oz podded fresh peas", "250g/9oz baby spinach leaves", "3 tbsp mascarpone", "25g/1oz parmesan cheese, grated", "salt and freshly ground black pepper", "110g/4oz petit pois", "3 tbsp chopped fresh mint leaves", "175ml/6fl oz extra virgin olive oil", "4 x 175g/6oz sea bream fillets", "salt", "25g/1oz butter", "1 tbsp olive oil", "1 punnet fresh pea shoots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pea and spinach risotto, melt the butter in a large pan until foaming, then fry the onion and garlic for 2-3 minutes, or until softened.", "Add the rice and stir well to coat in the butter. Cook for a further 1-2 minutes, or until the rice is translucent. Add the wine and cook for 3-4 minutes, or until nearly all of the liquid has been absorbed. Meanwhile, keep the chicken stock hot in a pan set over a low heat.", "Add a ladleful of the chicken stock to the rice and stir well. Cook for 1-2 minutes, or until nearly all of the stock has been absorbed, then stir in another ladleful of the stock. Repeat the process until the rice is cooked but still al dente. (You may not need all of the stock.)", "Add the peas during the last 2-3 minutes of cooking, then stir in the baby spinach leaves, mascarpone and parmesan. Gently stir until the cheese has melted and the rice has a creamy texture. Season, to taste, with salt and freshly ground black pepper. ", "For the pea oil, bring a small pan of salted water to the boil, then add the peas and mint and blanch for 1-2 minutes. Drain and refresh under cold running water, then drain again and place the peas and mint into a food processor. Add the olive oil and blend to a smooth purée. ", "Pass the pea mixture through a fine sieve, pressing down lightly, into a small bowl. Discard the solids left behind in the sieve. Set the pea oil aside.", "For the sea bream, season the sea bream fillets with a little salt. Heat a frying pan until hot and add the butter and olive oil. When the butter is foaming, add the sea bream fillets, skin-side down. Fry for 2-3 minutes, or until the skin is crisp and golden-brown. (The fish should be half-cooked at this stage.) Turn the fish over and cook for a further 1-2 minutes, or until the fish is completely cooked through (the flesh should be opaque all the way through and flake easily). ", "Spoon the risotto into the centre of four serving plates and top with the sea bream fillets. Dress the pea shoots with a spoonful of the pea oil and arrange a small pile on top of each piece of fish. Drizzle some more pea oil around the plates and serve."]}, {"isVegetarian": true, "title": "Pea and spring onion champ", "url": "www_bbc_co_uk_food_recipes_peaandspringonioncha_73827", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1½kg/3lb 5oz potatoes, scrubbed", "100g/3½oz butter", "500ml/18fl oz milk (if you want it rich use ¾ milk to ¼ cream)", "450g/1lb peas", "75g/2¾oz spring onions, chopped", "4 tbsp chopped parsley", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the champ, cook the potatoes in salted water for 5-10 minutes, until tender.", "Drain three-quarters of the water and continue to cook on a low heat. Avoid stabbing the potatoes with a knife, because if they're floury potatoes they'll break up if you do.", "When cooked, drain all the water off, peel and mash with most of the butter while hot.", "Meanwhile, place the milk in a saucepan with the peas and spring onion and boil for four or five minutes, until cooked.", "Add the parsley and take off the heat.", "Add the potatoes, keeping some of the milk back in case you don't need it all.", "Season to taste and beat until creamy and smooth, adding more milk if necessary.", "Serve piping hot with the remaining butter melting in the centre."]}, {"isVegetarian": false, "title": "Pea-breaded hake with sun-dried tomato salsa", "url": "www_bbc_co_uk_food_recipes_peabreadedhakewithsu_82784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25ml/1oz sun-dried tomato oil (the oil from a jar of sun-dried tomatoes)", "1 clove garlic, finely chopped", "1 tbsp chopped red onion", "pinch dried chilli flakes", "50g/2oz sun-dried tomatoes", "50g/2oz fresh peas", "50g/2oz fresh breadcrumbs", "100g/3½oz hake", "50g/2oz plain flour", "1 free-range egg, beaten", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the tomato salsa, heat the oil in a frying pan and cook the garlic, onion and chilli until soft.", "Add the tomatoes and cook for five minutes.", "To make the hake, place the peas and breadcrumbs in a food processor and blend together. ", "Toss the hake in the flour, dip in the egg then roll in the pea crust until coated all over.", "Heat the olive oil in a frying pan and fry the hake for one minute on each side until coloured.", "Place in the oven and roast for five minutes or until cooked through. Season with salt and freshly ground black pepper.", "Serve the hake in the middle of a warm plate and spoon the salsa around."]}, {"isVegetarian": true, "title": "Peach and blueberry streusel cake", "url": "www_bbc_co_uk_food_recipes_peach_and_blueberry_06916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4oz self-raising flour", "75g/3oz unsalted butter", "75g/3oz soft light brown sugar", "½ tsp ground cinnamon", "1 tbsp demerara sugar", "250g/8oz butter, plus extra for greasing", "250g/8oz plain flour", "125g/4oz granulated sugar", "150g/5oz light soft brown sugar", "2 tsp baking powder", "½ tsp salt", "3 free-range eggs, separated", "250ml/8floz whole milk", "200g/7oz fresh blueberries", "1 x 400g/7oz tin peach slices in syrup, drained", "200g/7oz blueberries", "1 x 400g/7oz tin peach slices in syrup, drained", "65g/2½oz caster sugar", "1½ tbsp plain flour", "1½ tsp lemon juice"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the crumble topping, place all of the crumble ingredients into a large bowl. Rub the butter into the flour until the mixture resembles breadcrumbs. Set aside. ", "For the cake preheat the oven to 180C/350F/Gas 4. Grease a 23cmx30cm/9inx12in baking dish with a little of the butter", "Sift the flour into a bowl and stir in the sugars. Rub the butter into the flour mixture until it resembles breadcrumbs. Stir in the baking powder, salt, egg yolks and milk and stir until well combined.", "Whisk the egg whites in a bowl until soft peaks form when the whisk is removed. Fold the egg whites into the cake mixture. ", "Spoon the cake batter into the baking dish and scatter over the blueberries and peach slices.", "Sprinkle over half of the crumble topping and bake for 40-50 minutes, or until golden-brown on top and a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes.", "Meanwhile for the jam, heat the peaches and the juice from the can, blueberries, sugar, flour and juice in a saucepan over a medium heat until boiling. Reduce the heat and simmer for 8-10 minutes, or until the mixture is thick and jammy. Remove the pan from the heat.", "Spread the jam over the cake and sprinkle over the remaining crumble topping.", "Return the cake to the oven and bake for a further 8-10 minutes, or until the topping is crisp and golden-brown."]}, {"isVegetarian": true, "title": "Peach and lemon thyme cream horns", "url": "www_bbc_co_uk_food_recipes_peach_and_lemon_thyme_35829", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "250g/9oz unsalted butter, chilled", "50g/1¾oz caster sugar", "1 medium free-range egg, beaten to glaze", "110g/4oz unsalted butter", "4 tbsp lemon juice (roughly 4 large lemons)", "175g/6oz caster sugar ", "2 large free-range eggs ", "1 tsp cornflour", "2 tbsp freshly chopped lemon thyme leaves", "250ml/9fl oz double cream", "100g/3½oz mascarpone", "2 tbsp peach syrup (from a tin of peaches)", "200g/7oz caster sugar", "1 ripe peach (or 2 peach halves from a tin), stone removed", "50g/1¾oz shelled pistachio nuts, chopped", "fresh lemon thyme, to serve"], "serves": "Makes 12 cream horns", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, beat the flour and 125ml/4fl oz ice-cold water in a freestanding mixer until smooth. Shape into a rectangle, wrap in cling film and put in the freezer for 10 minutes.  Place the butter between two pieces of greaseproof paper and use a rolling pin to flatten it into a rectangle. Chill in the fridge for 10 minutes.", "Once the dough has rested, roll it out on a lightly floured work surface to make a larger rectangle (roughly 2.5cm/1in thick and double the size of the butter). Remove the butter from the greaseproof paper, and put it on the top half of the dough.  Fold the remaining dough over it and press to seal. Turn the pastry so a short edge is closest to you. Roll it out again to form a longer rectangle, then fold the top third into the middle and fold the bottom third up to cover. Repeat this rolling and folding process once more then chill the pastry in the freezer for 15 minutes. Repeat the rolling and folding process a further 2 times.", "To make the curd, heat the butter, lemon juice and half the sugar until fully melted. In a separate bowl, beat the eggs, remaining sugar and cornflour until smooth then pour over the hot liquid. Whisk to combine then return to the pan and heat gently, stirring constantly, until thickened. Add the thyme, to taste, and set aside to infuse for 15 minutes before sieving. ", "Preheat the oven to 220C/200C Fan/Gas 7.", "For the pastry horns, roll out the puff pastry out to form a large rectangle about 2mm thick. Cut long strips (about 2cm/¾in wide and 40cm/16in long) and spiral them around the metal moulds overlapping the edges slightly. Brush with a little beaten egg and sprinkle with sugar before placing seam-side down on a baking tray. Cook for 15-20 minutes until the pastry is crisp and golden-brown. Set aside to cool slightly, then remove from the moulds and cool completely on a wire rack. ", "For the peach cream, whisk all the ingredients together until soft peaks form when the whisk is removed. ", "For the caramel wafers, heat the sugar with 2 tablespoons water until the sugar dissolves and turns to caramel. Pour onto a silicone sheet and set aside to cool and set. ", "Preheat the oven to 200C/180C Fan/Gas 6.", "Break the caramel into chunks and place in a food processor, blitz to very fine crumbs. Sieve into a bowl and then spread in an even layer on a sheet of silicone.  Place in the oven for 2 minutes, or until melted. Allow to cool for 1 minute, then cut into wafers using a sharp knife. ", "To assemble the cream horns, place the pastry horns into mugs to help them stand upright on the tip. Chop half the peach into small chunks and divide between the 12 horns. Add a spoonful of lemon curd and sprinkle half of the chopped pistachio nuts on top. Using an ice cream scoop, add the peach cream (to create a dome on top as you would on an ice cream). Add a caramel wafer. Finely slice the remaining peach half. Decorate the horns with a few peach slices. Finish with a sprig of lemon thyme and the remaining chopped pistachio nuts. Serve immediately."]}, {"isVegetarian": true, "title": "Peach and marzipan tarts with amaretto ice cream", "url": "www_bbc_co_uk_food_recipes_peach_and_marzipan_tarts_07241", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["568ml/1 pint double cream", "1 vanilla pod, split lengthways", "6 egg yolks", "150g/5½oz caster sugar", "2 tbsp amaretto liquor", "250g/9oz caster sugar ", "250g/9oz ground almonds", "1 egg, white only, lightly whisked", "¼ tsp almond extract", "200g/7oz caster sugar", "150g/5½oz blanched almonds", "250g/9oz plain flour, plus extra for dusting", "250g/9oz cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz iced water", "1 egg, beaten", "4 peaches, stoned and very thinly sliced", "75g/2½oz butter", "55g/2oz caster sugar", "4 tbsp apricot jam", "4 sprigs fresh mint, to decorate"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["First make the ice cream. Put the cream and vanilla pod and seeds in a large saucepan and heat gently until it just starts to simmer. ", "Meanwhile, whisk the egg yolks with the sugar in a large bowl until thick and pale. Slowly add the hot cream, whisking continuously. ", "Pour the custard back into the pan and stir in the amaretto. Cook over a low heat until thick enough to coat the back of a spoon. Be careful not to let it get too hot or it might split. ", "Leave to cool completely. Churn in an ice cream machine according to manufacturer’s instructions until thick. Transfer to an airtight container and freeze.", "For the marzipan, gently heat the sugar and 5 tablespoons of water together in a saucepan gently until the sugar is dissolved. Bring the syrup to the boil, then heat until it reaches 100C/220F (use a sugar thermometer to measure this). When a drop of the syrup is placed in cold water to cool down it should form a soft ball.", "Mix the almonds, egg white and almond extract together in a bowl. Pour over the syrup and mix vigorously until it forms a thick paste. Cover, leave to cool to room temperature then chill in the refrigerator for 1-2 hours, or until firm.", "For the praline, melt the sugar in a frying pan over a medium heat, without stirring, until it forms a golden caramel. Remove from the heat and stir in the almonds. Pour the praline on to a large sheet of baking paper and set aside to cool and harden.", "To make the pastry, tip the flour on to a work surface and make a well in the centre. Put the butter and salt in the well, then rub them into the flour using your fingertips of one hand, gradually drawing the flour into the centre using the other hand. When the mixture is grainy, gradually mix in the iced water. Don’t overwork the dough. You should have a marbled effect without mixing the butter in fully. Roll it into a ball, wrap in clingfilm and refrigerate for 20 minutes. ", "Dust the work surface with flour and roll the pastry out into a 40x20cm/16x8-inch rectangle. Fold the top third down to the centre, then the bottom third up and over it. Give the dough a quarter-turn. Repeat the folding and rolling, then wrap the block in clingfilm and refrigerate for 30 minutes.", "Repeat the folding, turning and rolling twice more, then wrap the pastry in clingfilm again and refrigerate for at least 30 minutes before using. ", "Preheat the oven to 210C/190C Fan/Gas 7. Line a baking tray with baking paper. Dust the work surface with flour and roll the pastry out thinly. Cut out four 12cm/4½in diameter circles and lay them on the baking tray. Leaving a gap of about a centimetre round the edge, lightly score the middles of each pastry circle, making a grid of lines. This will stop the pastry puffing up too much in the middle. Brush each circle with the beaten egg.", "Roll the marzipan out to 5mm/¼in thick. Cut out four 11cm/4in diameter circles and place each circle on top of a pastry circle. Arrange the peaches, overlapping in concentric circles, on the marzipan circles. ", "Melt the butter in a saucepan, then brush it over the peaches. Sprinkle with the remaining sugar. Bake for 15-18 minutes, or until the pastry is risen and golden. ", "Meanwhile, mix the apricot jam and 1 tablespoon of water together in a saucepan and heat until melted. Pass through a fine sieve into a bowl. Brush this mixture over the tarts.  ", "Serve the tarts with quenelle of ice cream on top and a sprinkle of broken almond praline, garnished with the mint."]}, {"isVegetarian": true, "title": "Peach and maple syrup jam", "url": "www_bbc_co_uk_food_recipes_peach_and_maple_syrup_31372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz (about 5) fresh peaches ", "250g/9oz Bramley apples", "50ml/2fl oz maple syrup", "400g/14oz granulated or caster sugar", "1 small lemon, juice only"], "serves": "Makes about 600ml/20fl oz (about 2 jam jars)", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil, and with a sharp knife score the peaches around the groove that runs around from the stalk to the tip, then again at right angles so the skin is marked in quarters. Drop the peaches into the boiling water for a minute, then remove and peel off the skin. Chop all the flesh away from the pips and discard the skin (reserve the pips).", "Peel the apples and grate them, discarding the core and pips. Place the grated apple in a pan with 300ml/½ pint of water, bring to the boil and then cook for 10 minutes, or until the water has almost evaporated.", "Add the peach flesh and the stones and cook for a further 10-15 minutes, or until the peach pieces fall apart and the mixture is thick. Pick the stones out with a spoon and discard them.", "Add the maple syrup, sugar and lemon juice, bring to a boil then cook until the mixture reaches 105C/220C on a sugar thermometer. Stir frequently to stop it catching on the bottom.", "Leave to cool for a few minutes, spoon into hot, clean jars and seal immediately."]}, {"isVegetarian": true, "title": "Peach melba with a pistachio and almond caramel and vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_peach_melba_with_a_05968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole peaches", "50g/1¾oz unsalted butter", "75g/2½oz caster sugar", "1 orange, juice only", "25g/1oz flaked almonds", "25g/1oz pistachio nuts, shells removed", "100g/3½oz raspberries", "300g/10½oz vanilla ice cream", "25g/1oz pistachio nuts, shelled and roughly chopped", "25g/1oz flaked almonds, roughly chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the peach melba and pistachio and almond caramel, preheat the oven to 200C/400F/Gas 6.", "Place the peaches on a baking tray and use a blow torch to blister the skins (alternatively place under a hot grill, turning occasionally). Set aside until cool enough to handle, then remove the skins. Cut in half and remove the stone.", "Place the peaches in a baking tray, cut-side up, and dot butter on top. Roast for 15-20 minutes, or until soft but still holding their shape.", "Heat a frying pan until hot, add the caster sugar and melt until it forms a caramel, swirling the pan occasionally. Add the orange juice and swirl to combine. (CAUTION: boiling sugar is extremely hot. Handle very carefully.)", "Add the flaked almonds, pistachio nuts and raspberries and heat through for two minutes only – you don’t want the raspberries to break down.", "To serve, place the cooked peaches into a shallow serving bowls and pour over the sauce. Serve with vanilla ice cream and sprinkle over the nuts."]}, {"isVegetarian": true, "title": "Peach melba with sugar roasted doughnuts and vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_peach_melba_with_sugar_32731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour", "25g/1oz caster sugar, plus 75g/2½oz for dusting", "pinch salt", "25g/1oz butter, softened", "14g/½oz fast-action dried yeast", "oil, for deep frying", "75g/2½oz caster sugar", "2 tbsp brandy", "1 orange, juice only", "½ x 400g/12oz tin sliced peaches, drained", "25g/1oz flaked almonds", "25g/1oz pistachio nuts", "100g/3½oz raspberries", "500g/1lb 2oz vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the doughnuts, place the flour, sugar, salt and butter into a bowl. Put the yeast into a jug and mix with 150ml/5fl oz of water until smooth, then pour into the flour mixture.", "Mix well, then knead until a smooth dough is formed.", "Set aside in a bowl, cover and rest for an hour until doubled in size.", "When the dough has proved, heat the oil in a deep-fat fryer to 150C/300F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Take golfball-sized pieces of the dough and roll into balls.", "Carefully lower the dough balls into the hot oil in batches and deep fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "Roll in the reserved sugar.", "For the sauce, heat a frying pan until hot, add the caster sugar and heat until it forms a caramel, swirling occasionally to combine the sugar with the melted sugar.", "Add the brandy and flambé by setting light to the mixture. Let the flames flare up then die down. (CAUTION: make sure there are no flammable materials above the pan when flaming.) Add the orange juice and swirl to combine.", "Add the tinned peaches, flaked almonds, pistachio nuts and raspberries and heat through for two minutes only – you don’t want to let the raspberries break down.", "To serve, place two scoops of ice cream in each of four bowls, add a few doughnuts then pour the sauce over the top."]}, {"isVegetarian": true, "title": "Peach posset", "url": "www_bbc_co_uk_food_recipes_peach_posset_80865", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peach_posset_80865_16x9.jpg", "ingredients": ["4 just-ripe peaches", "2 tbsp brandy", "2 tbsp light muscovado sugar", "300ml/10fl oz double cream", "75g/2½fl oz caster sugar", "1 large unwaxed lemon, finely grated zest and juice only", "borage or mint leaves, to decorate"], "serves": "Makes 8", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the peaches in a bowl of boiling water for 30 seconds, or just until the skin starts to peel away. Carefully remove from the bowl and dip immediately into cold water. Dry and peel off the skin. ", "Cut the peach flesh into 5mm/¼in cubes. Put into a bowl and add the brandy and light muscovado sugar. Toss well, then divide among eight small tumblers or pretty water glasses. ", "Meanwhile, add the cream into a heavy-bottomed saucepan, add the caster sugar, lemon zest and juice and heat over a medium heat, stirring until the sugar has dissolved. Simmer for 2 minutes while stirring, then pour into a jug and set aside to cool until lukewarm.", "Pour the lemon cream into the glasses over the fruit. Transfer to the fridge to set for at least 4 hours, or ideally overnight.", "Decorate with borage flowers or mint."]}, {"isVegetarian": true, "title": "Peach and apricot puffs", "url": "www_bbc_co_uk_food_recipes_peachandapricotpuffs_91845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz soft light brown sugar", "200g/9oz peaches, stones removed, chopped", "150g/5oz apricots, stones removed, chopped", "1 vanilla pod, split, seeds scraped out", "1 tbsp butter", "250g/9oz ready-rolled puff pastry", "1 free-range egg, lightly beaten ", "100g/3½oz caster sugar, for sprinkling ", "ready-made caramel sauce", "clotted cream ", "fresh raspberries"], "serves": "Makes 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Place the sugar into a non-stick pan over a medium-low heat. Leave to melt (avoid stirring the sugar until it has done so), then when the sugar begins to caramelise and turn golden-brown, add the fruit, vanilla seeds and butter. Stir and cook for a further 1-2 minutes, then remove from the heat. ", "Lay the puff pastry out onto a clean work surface and cut out 15cm/6in circles with a cutter (the pastry will yield around 4-6 circles). Spoon about a tablespoon of the fruit mixture onto one half of each circle, then brush the edges with the beaten egg and fold the other half of the pastry over. Seal the edges, then brush the parcel all over with the beaten egg. Crimp the edges with a fork and sprinkle with sugar. Place the pastry parcels onto a baking tray.", "Bake the pastry puffs in the oven for 13-15 minutes, or until golden-brown. ", "To serve, place the peach and apricot puffs on serving plates and spoon some clotted cream alongside. Drizzle over some caramel sauce and garnish the plate with some raspberries."]}, {"isVegetarian": false, "title": "Peach and champagne jelly", "url": "www_bbc_co_uk_food_recipes_peachandchampagnejel_86313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 sheets leaf gelatine", "cold water, to cover", "1 x 750ml/1¼ pint bottle champagne", "1 lemon, juice only", "100g/3½oz caster sugar", "2 tbsp finely sliced fresh basil leaves", "400g/14oz peaches, chopped", "8 sprigs fresh basil", "8 small strawberries"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the gelatine sheets into a bowl and cover with cold water.", "Meanwhile, pour 150ml/5fl oz of the champagne into a pan with the lemon juice and sugar and heat gently, stirring frequently to dissolve the sugar.", "Remove the gelatine from the cold water, squeezing out any excess water, then add to the pan and whisk until dissolved. Pass the mixture through a sieve into a bowl and allow to cool slightly.", "Add the remaining champagne and the basil to the mixture and stir. Leave until the jelly is cold and just on the point of setting.", "To serve, divide the chopped peaches equally among eight champagne flutes and carefully pour in the setting jelly. Top each jelly with a sprig of fresh basil and a strawberry."]}, {"isVegetarian": true, "title": "Peach and tomato chutney", "url": "www_bbc_co_uk_food_recipes_peachandtomatochutne_75792", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "½ peach, peeled and chopped", "1 tomato, deseeded and chopped", "1 shallot, finely chopped", "2 tbsp white wine vinegar", "1 tbsp white wine", "1 tbsp honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a small saucepan heat the butter. ", "Add the peach and tomato and cook for 2-3 minutes or until they start to soften. Add the white wine vinegar, white wine and honey and cook rapidly for a further five minutes.", "The chutney is ready, once the fruits have broken down slightly and the liquid has been reduced."]}, {"isVegetarian": false, "title": "Peach and raspberry roly-poly with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_peachandraspberryrol_86416", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz jam sugar", "1 lemon, juice only", "1 kg/2lb 4oz fresh peaches, skins and stones removed, cut into chunks", "175gm/6oz self-raising flour ", "25g/1oz caster sugar", "85g/3oz shredded suet ", "125-150ml/4-5fl oz water", "150g/5oz peach jam ", "75g/3oz raspberries", "85g/3oz caster sugar", "50ml/2fl oz water", "4 tbsp flaked almonds, toasted ", "vanilla ice cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Place two clean jam jars into the oven to heat and sterilise.", "For the jam, place the sugar and lemon juice into a large pan over a low heat and heat until the sugar has melted.", "Add the peaches and stir gently. Increase the heat to bring to the boil and cook for ten minutes. Check the temperature with a sugar thermometer - it should reach 105C/220F.", "Leave to cool slightly, skimming off any froth with a clean spoon, to prevent the jam from going cloudy.", "Carefully remove the hot jam jars from the oven. Spoon the jam into the sterile jars, seal and label with the date. They should keep for a few months in a cool, dark place.", "For the roly-poly, place the flour, sugar and suet into a bowl and mix thoroughly. Make a well in the centre of the mixture and gradually add enough water, mixing from the centre, until a soft dough is formed.", "Turn the dough out onto a floured work surface and knead lightly until smooth. Roll the dough out into an oblong shape about 1cm/½in thick.", "Slide the pastry onto a sheet of greaseproof paper.", "Spread the peach jam onto the pastry, leaving a 2.5cm/1in border all around, then add the raspberries evenly across the jam.", "Roll up the dough into a pinwheel, keeping the greaseproof paper on the outside, until all of the pastry is enclosed. Twist the ends of the greaseproof paper tight.", "Place the parcel into a bamboo or metal steamer, then place over a large pan of boiling water. Reduce the heat and steam for one hour, or until the pastry is completely cooked.", "To serve, place the sugar and water into a saucepan over a medium heat and bring to the boil. Reduce the heat and simmer until the sugar has melted and the liquid has turned a light caramel colour.", "Drizzle the caramel over each serving plate and top with a spoonful of ice cream and a scattering of toasted almonds.", "Cut the roly-poly into thick slices and place alongside each portion of ice cream."]}, {"isVegetarian": true, "title": "Peach crumble tarts with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_peachcrumbletartwith_85165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "4 free-range egg yolks", "600ml/1 pint milk", "4-6 tbsp caster sugar", "flour, for dusting", "450g/1lb ready-made puff pastry", "1 free-range egg, beaten", "8 fresh peaches, sliced", "50g/2oz butter, melted, plus extra for greasing", "50g/2oz butter", "50g/2oz demerara sugar", "100g/3½oz plain flour", "ready-made vanilla ice cream", "fresh mint sprigs"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the crème patissière, place the flour and egg yolks into a large bowl and whisk until smooth.", "Heat the milk and sugar in a pan and slowly bring to the boil. ", "Pour the milk mixture onto the egg yolk mixture, stirring constantly. Mix well, then return the mixture to the pan.", "Stir over a low heat until the mixture thickens, then remove from the heat and set aside.", "Preheat the oven to 200C/400F/Gas 6.", "For the tarts, roll out the pastry on a lightly floured surface, then lightly prick all over with a fork. Cut out 4 x 15cm/6in rounds and place them into the fridge to rest for 10-15 minutes.", "Remove the pastry rounds from the fridge. Lightly grease a non-stick baking sheet and place the pastry discs onto the baking sheet. ", "Lightly brush the edges of the pastry rounds with the beaten egg and spread a spoonful of the crème patissière onto the middle of each disc. ", "Place the sliced peaches on top of the crème patissière and drizzle over the melted butter.", "Transfer the tarts to the oven and bake for 8-10 minutes.", "Meanwhile, for the crumble topping, place all the crumble ingredients into a food processor and pulse until the mixture resembles breadcrumbs.", "Remove the tarts from the oven and sprinkle over the crumble mixture. Return to the oven for 10-15 minutes, or until golden-brown.  ", "To serve, remove the tarts from the oven and place onto four serving plates, garnished with a spoonful of ice cream and a sprig of fresh mint."]}, {"isVegetarian": false, "title": "Peaches and nectarines crumble with yoghurt sorbet", "url": "www_bbc_co_uk_food_recipes_peachesandnectarines_13612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz Greek yoghurt", "100ml/3½fl oz milk                  ", "65g/2½oz caster sugar", "65g/2½oz caster sugar ", "75g/3oz butter", "65g/2½oz flour                  ", "25g/1oz cornflour", "20g/1oz ground almond (optional)", "1kg/2¼lb strawberries", "100g/3½oz sugar", "6g/¼oz gelatine       ", "peaches (enough for ½ per person)", "nectarines (enough for ½ per person)", "80g/3oz roughly chopped pistachio", "vanilla sugar"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "For the yoghurt sorbet, mix all the ingredients and churn in an ice cream maker.", "To make the crumble dough, mix all the ingredients together and divide the mix into nugget-sized pieces. Put on a baking tray and put in the oven for 8-10 minutes.", "For the jelly, put the strawberries and sugar in a bain marie and heat gently for 2 hours. ", "Let the juice strain through a muslin cloth into a bowl for 2 hours.", "Melt the gelatine and add to the juice. Leave to set in the fridge.", "Wash the fruit, cut into bite-size pieces and dust with vanilla sugar. Add the pistachios, crumble and strawberry jelly. Top with sorbet."]}, {"isVegetarian": true, "title": "Peaches in Sauternes", "url": "www_bbc_co_uk_food_recipes_peachesinsauternes_91630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 fresh unsprayed lavender heads, rinsed", "1 unwaxed lemon, rind peeled from the fruit in long strips", "8 firm, ripe peaches, peeled, stones removed, sliced", "375ml/13fl oz Sauternes, or similar sweet dessert wine, chilled", "crème fraîche, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Arrange the peach slices into the bottom of a large serving dish. Sprinkle over the lavender heads and add the strips of lemon rind. ", "Pour over enough dessert wine to cover the peaches. Turn the peach slices over a couple of times to coat them in the liquid, then cover the dish and chill the mixture in the fridge for at least four hours, or preferably overnight. ", "To serve, spoon a portion of peaches in Sauternes into each of six serving bowls. Serve with a dollop of crème fraîche, if using."]}, {"isVegetarian": true, "title": "Peach, lemon and mascarpone trifle", "url": "www_bbc_co_uk_food_recipes_peachlemonandmascarp_87176", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lemons", "400g/14oz caster sugar", "200ml/7fl oz hot water, from a kettle", "4 sponge fingers, broken into pieces", "100g/3½oz mascarpone", "1 additional lemon, zest and juice", "75ml/2½fl oz double cream", "1 tbsp icing sugar, sifted", "1 peach, peeled and sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut one of the lemons into quarters and juice the other lemons. Place the quartered lemon and the lemon juice, sugar and hot water into a non-reactive saucepan and bring to the boil. Boil until the mixture is thick and syrupy then remove from the heat and allow to cool. ", "Dip the sponge fingers into the sugar syrup and place in the base of a glass serving dish. (There will be sugar syrup left over to use on another occasion.).", "Mix the mascarpone, lemon zest and a squeeze of lemon juice from the aditional lemon, double cream and icing sugar together. ", "Place a third of the peach slices on top of the sponge finger base and then top with half the cream mix. ", "Place another third of the peach slices on top of the cream and cover with the rest of the cream mix. ", "Decorate with the rest of the peaches and serve."]}]