[{"ingredients": ["200g / 7oz de harina italiana '00'", "2 huevos de gallinas camperas", "500ml / 18fl oz de leche entera", "40 g / 1½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "1 cucharadita de nuez moscada recién molida", "sal y pimienta blanca recién molida", "2 cucharadas de aceite de oliva", "250g / 9oz de espárragos, finamente rebanados", "1-2 dientes de ajo, aplastados", "400ml / 14fl oz de caldo de pollo o vegetal", "40 g / 1½ oz de mantequilla", "Harina normal de 20g / ¾oz", "Bolas de mozzarella 250 g / 9 oz, rotas", "250 g / 9oz de jamón cocido, desgarrado", "6 cucharadas de parmesano recién rallado, más extra para servir", "pimienta negra"], "method": ["Para hacer la pasta, coloque la harina en un procesador de alimentos y pulse. Agregue los huevos uno por uno y siga pulsando durante 2-3 minutos, hasta que la mezcla se asemeje a migas de pan finas. Incline la masa sobre una superficie ligeramente enharinada y amase durante 1 minuto (debe ser bastante dura y difícil de amasar). Envuelva la película de la cocina y déjela reposar en la nevera durante 20 minutos.", "Mientras tanto, prepara la salsa Béchamel. Caliente la leche en una cacerola pequeña y derrita la mantequilla en una sartén por separado a fuego medio. Agregue la harina a la mantequilla derretida y mezcle bien. Cocine por 2 minutos. Incline la leche caliente en la harina revolviendo continuamente. Condimentar con sal, pimienta y nuez moscada. Deje enfriar hasta que esté listo para servir.", "Para hacer la salsa de espárragos, coloque una sartén a fuego medio y agregue el aceite de oliva. Freír los espárragos y el ajo por 2-3 minutos.", "Caliente el caldo en una sartén pequeña. Derrita la mantequilla en una sartén por separado a fuego medio. Mezcle la harina en la mantequilla y cocine durante 1-2 minutos. Agregue el caldo caliente y agregue los espárragos. Deja enfriar.", "Llevar a ebullición una sartén grande de agua salada. Estirar la pasta en un círculo grande (de unos 40 cm de diámetro y tan delgado como puedas). Cocine con cuidado la pasta redonda durante 1-2 minutos y luego drene en un paño de cocina.", "Para armar los nidos, extienda la mitad de Béchamel fría sobre la pasta, cubra con la mozzarella, el jamón y 4 cucharadas de queso parmesano. Enrolle en forma de tronco y envuélvala en un paño de cocina. Refrigere por al menos 30 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Vierta la mitad de la salsa de espárragos en un plato hondo para hornear. Cortar el rollo de pasta en 9 piezas y colocar en el plato. Cuchara sobre la salsa de espárragos restante y todo el Béchamel. Espolvorear con parmesano y pimienta negra y hornear durante 20-30 minutos, o hasta que se dore por la parte superior. Espolvorear con un poco de parmesano y servir."], "url": "www_bbc_co_uk_food_recipes_ham_and_asparagus_pasta_69827", "title": "Nidos de pasta de jamón y espárragos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "Harina normal de 200g / 7oz", "500ml / 18fl de leche en oz", "sal y pimienta negra recién molida", "75g / 2½ oz de pan rallado fresco", "150 g / 5½ oz jamón, picado", "Queso cazador furtivo de Lincolnshire 100g / 3½oz", "1 manojo pequeño de perejil fresco, picado", "Harina normal de 75 g / 2½ oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado japonés panko 100g / 3½oz", "aceite de colza, para freír", "3 yemas de huevo de gallinas camperas", "1-2 cucharaditas de mostaza inglesa", "100ml / 3½fl oz de aceite de colza", "1 cucharada de vinagre de vino blanco"], "method": ["Para las croquetas de jamón y queso, derrita la mantequilla en una cacerola grande, luego mezcle con la harina y cocine por 2-3 minutos. Batir la leche gradualmente para hacer una salsa espesa. Condimentar con sal y pimienta.", "Agregue el pan rallado, el jamón, el queso y el perejil. Coloque en el refrigerador para enfriar durante 3-4 horas.", "Forme la mezcla enfriada en cilindros de 7cm / 2¾. Coloque la harina, los huevos batidos y las migas de pan en tres cuencos separados. Cubra cada croqueta en la harina, luego huevo y termine con una capa de Panko breadcrumbs.", "Agregue el aceite a una freidora y precaliente a 170 ° C / 338 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las croquetas en lotes hasta que estén doradas. Retire y escurra en un plato forrado con papel de cocina.", "Para hacer la mayonesa, bata las yemas de huevo con la mostaza en un tazón y luego muy gradualmente agrega el aceite, batiendo continuamente. Revuelva a través del vinagre, luego sazone con sal y pimienta.", "Sirva las croquetas en un tablero con un tazón de la mayonesa para mojar."], "url": "www_bbc_co_uk_food_recipes_ham_and_cheese_croquetas_52671", "title": "Croquetas de jamón y queso con colza mayo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 30 g / 1 oz rebanada de jamón", "4 hojas de albahaca fresca", "1 cucharada de crema semidescremada", "1 huevo grande de gallinas camperas", "1 cucharada de Red Leicester rallado", "sal marina y pimienta negra recién molida", "hojas de ensalada", "aceite de oliva, para lloviznar", "apretón de limón"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Coloque el jamón en el fondo de un plato de molde para que forme una taza y coloque la albahaca dentro. Cuchara en la crème fraîche y crack en el huevo. Espolvorear sobre Red Leicester y sazonar con sal y pimienta.", "Coloque el molde en una bandeja para hornear y hornee durante 15 minutos, o hasta que esté cocido, pero la yema todavía está un poco líquida.", "Ponga las hojas de ensalada en un plato, aliñada con un chorrito de aceite y un chorrito de jugo de limón y sirva con el jamón y la olla de huevo."], "url": "www_bbc_co_uk_food_recipes_ham_and_egg_pots_63131", "title": "Ollas de jamón y huevo al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_and_egg_pots_63131_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tomate grande de res", "sal y pimienta negra recién molida", "dash aceite de oliva", "3 rebanadas de jamón", "2 rebanadas de pan de masa fermentada", "3 huevos de gallinas camperas", "50ml / 2fl oz crema", "botón de mantequilla"], "method": ["Precalentar la plancha a caliente. Cortar el tomate por la mitad, sazonar con sal y pimienta negra recién molida, rociar con aceite y colocar en un molde para asar con el jamón. Ase hasta que el tomate se ablande y el jamón esté crujiente.", "Tueste ligeramente el pan de masa fermentada.", "Rompe los huevos en un tazón. Sazonar con sal y pimienta y batir bien. Batir en la crema.", "Vierta la mezcla en una sartén antiadherente y cocine los huevos revueltos hasta que alcancen una consistencia descuidada. Retire del fuego.", "Vierta los huevos revueltos en la tostada de masa fermentada y coloque el jamón a la parrilla encima. Coloque los tomates a la parrilla en un lado y sirva."], "url": "www_bbc_co_uk_food_recipes_ham_and_eggs_with_88506", "title": "Jamón y huevos con tomate a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1 persona hambrienta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_and_eggs_with_88506_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de guisantes frescos en la vaina, envasadas, con las vainas reservadas", "100 g / 3½ oz de miel que moquea", "100 ml / 3½ fl oz de salsa de soja", "1.5 litros / 2½ pintas de caldo de pollo", "1 repollo Savoy", "aceite vegetal, para freír", "300g / 10½oz de jamón de buena calidad, cortado en cubitos", "½ manojo de menta fresca, hojas recogidas y desgarradas", "2 puntas de brotes de guisantes", "1 manojo de cebollas en rodajas", "1 chile verde, picado"], "method": ["Cocine los guisantes en agua hirviendo durante 1-2 minutos o hasta que estén cocidos. Desagüe.", "Caliente la miel en una cacerola de fondo grueso hasta que tenga un color caramelo. Agregue con cuidado la salsa de soja y el caldo de pollo y lleve la mezcla a ebullición. Agregue las vainas de guisantes reservadas y retire la cacerola del fuego.", "Cubra con clingfilm, deje de lado para infundir durante 10 minutos, luego pase la mezcla a través de un tamiz fino y déjelo a un lado.", "Mientras tanto, quite las hojas exteriores del repollo (use el resto del repollo para otra receta). Cortar finamente las hojas y blanquear en agua hirviendo durante 1-2 minutos. Drene y seque.", "Caliente el aceite en una freidora a 140C / 285F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Fríe los trozos de repollo hasta que estén crujientes, luego retíralos del aceite y ponlos a un lado para escurrirlos sobre papel de cocina. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida los guisantes, el jamón, la menta, los brotes de guisantes, las cebolletas y el chile entre cuatro tazones para servir. Regrese la mezcla madre al hervor y viértala en los tazones, luego cubra con la col crujiente."], "url": "www_bbc_co_uk_food_recipes_ham_and_pea_broth_79831", "title": "Caldo de jamón y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 corvejón de jamón", "4 muslos de pollo, piel sobre", "1 cebolla, más o menos picada", "2 zanahorias, aproximadamente picadas", "2 palitos de apio, más o menos picados", "tomillo pequeño racimo", "pequeños racimos de tallos de perejil", "2 hojas de laurel", "10-12 cangrejos de río crudos (cocidos pueden ser sustituidos, pero tendrá que usar el caldo de pescado)", "rociar aceite de oliva", "1 cucharada de puré de tomate", "estragón pequeño racimo", "50 g / 1¾oz de mantequilla sin sal", "2 cucharadas de harina normal", "cebollino pequeño, finamente picado", "300g / 10½oz de hojaldre con mantequilla comprado en la tienda", "1 huevo de gallinas camperas, golpeado", "1-2 ramitas de tomillo"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque el jamón, el pollo, la cebolla, la zanahoria y el apio en una olla y cúbralos con agua. Ate el tomillo, los tallos de perejil y las hojas de laurel con una cuerda de cocina y agregue a la olla. Llevar a ebullición y luego cocinar a fuego lento durante aproximadamente 1 ½ horas, o hasta que la carne esté bien cocida.", "Retire la carne y luego cuele y reserve el líquido de cocción. Triture la carne en trozos del tamaño de un bocado y déjela a un lado.", "Pele el cangrejo de río y reserve. Coloque las cáscaras en una sartén caliente para dorar con un chorrito de aceite de oliva. Agregue el puré de tomate y cocine por un minuto. Mide 1 litro / 1¾ pintas del líquido de cocción de carne y agrégalo a la sartén, junto con unas pocas hojas de estragón fresco. Llevar a ebullición y cocinar a fuego lento durante 20 minutos antes de pasar a través de un colador. Deseche las cáscaras y reserve la reserva.", "Haga un roux derritiendo la mantequilla y batiendo la harina. Poco a poco agregue el caldo, batiendo para evitar que se formen grumos. Pruebe si hay aderezo y agregue más estragón en este punto si lo desea.", "Para ensamblar, coloque el jamón, el pollo y el cangrejo en un plato para pastel y vierta sobre la salsa y esparza sobre el cebollino picado. Reserve algunas cabezas de cigalas.", "Estirar la masa a un grosor de 5 mm y cubrir el plato de tarta con ella. Recorta los bordes y presiónalos firmemente en el borde del plato. Cepillar con la yema de huevo batida y espolvorear sobre algunas hojas frescas de tomillo. Haga un par de incisiones en la masa e inserte las cabezas de cangrejo reservadas para que el vapor salga del interior del pastel.", "Hornee durante 30 minutos o hasta que la masa esté hinchada y dorada."], "url": "www_bbc_co_uk_food_recipes_ham_chicken_and_crayfish_02352", "title": "Pastel de jamón, pollo y cangrejo de río", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_chicken_and_crayfish_02352_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "Harina normal de 200g / 7oz", "500ml / 18fl de leche en oz", "sal y pimienta negra recién molida", "75g / 2½ oz de pan rallado fresco", "100 g / 3½ oz jamón, picado", "50g / 2oz de jamón serrano, picado", "1 manojo pequeño de perejil fresco, picado", "Harina normal de 75 g / 2½ oz", "2 huevos de gallinas camperas, golpeados", "Pan rallado japonés panko 100g / 3½oz", "aceite de colza, para freír", "3 yemas de huevo de gallinas camperas", "1-2 cucharaditas de mostaza inglesa", "100ml / 3½fl oz de aceite de colza", "1 cucharada de vinagre de vino blanco", "½ cucharadita de ajo picado (aproximadamente 1 diente pequeño)", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una cacerola grande, luego bata la harina y cocine por 2-3 minutos. Batir la leche lentamente hasta que tenga una salsa muy espesa. Condimentar con sal y pimienta.", "Agregue las migas de pan, los jamones y el perejil. Coloque en el refrigerador para enfriar durante 3-4 horas.", "Forme la mezcla enfriada en cilindros de 7cm / 2¾. Coloque la harina, los huevos batidos y las migas de pan en tres cuencos separados. Cubra cada uno en la harina, luego huevo y terminar con una capa de pan rallado.", "Agregue el aceite en una freidora y precaliéntelo a 170 ° C / 338 ° F. (Precaución: no deje el aceite caliente desatendido).", "Freír las croquetas en lotes hasta que estén doradas. Retire y escurra sobre papel de cocina.", "Para hacer la mayonesa, bata las yemas de huevo con la mostaza en un tazón y luego muy lentamente y gradualmente agrega el aceite, batiendo continuamente. Revuelva a través del vinagre y el ajo, luego sazone con sal y pimienta.", "Sirva las croquetas en un tablero con un tazón de mayonesa para mojar."], "url": "www_bbc_co_uk_food_recipes_ham_croquetas_with_98714", "title": "Croquetas de jamón con mayonesa de ajo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_croquetas_with_98714_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 patatas grandes adecuadas para desmenuzar", "aceite vegetal, para freír", "sal y pimienta negra recién molida", "4 rebanadas gruesas de jamón de buena calidad", "75g / 3oz de mantequilla", "4 huevos de pato", "2 cucharadas de perejil fresco picado"], "method": ["Recorta los extremos de las papas y corta en trocitos. Cocine en agua hirviendo con sal durante 5-6 minutos, o hasta que estén tiernos, luego drene.", "Caliente el aceite en una freidora a 140C / 285F (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje desatendido). Freír las virutas durante 8-10 minutos, luego retirarlas del aceite y dejarlas a un lado para escurrirlas sobre papel de cocina.", "Para servir, recaliente el aceite a 180 ° C / 350 ° F y fría las patatas durante 4-5 minutos, o hasta que estén crujientes y doradas. Retirar del aceite, reservar para escurrir sobre papel de cocina y sazonar con sal.", "Llene una sartén con 1cm / ½ en agua y deje que hierva. Agregue la mantequilla y una vez que se haya derretido, agregue el jamón en rodajas y cocine durante 1-2 minutos.", "Retire las rebanadas de jamón y coloque en platos para servir. Sazonar con pimienta recién molida negro.", "En una sartén, agrega un poco de aceite vegetal y freír los huevos de pato hasta que estén cocidos a tu gusto. Coloque en los platos para servir, sazone con sal y pimienta negra recién molida y sirva las patatas al lado."], "url": "www_bbc_co_uk_food_recipes_ham_fried_duck_egg_and_97182", "title": "Jamón, huevo de pato frito y chips cocidos triples", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de miel", "50g / 1¾oz de azúcar moreno claro y suave", "100ml / 3½fl oz de vinagre de vino blanco", "75 g / 2½ oz de semillas de mostaza negra", "75 g / 2½ oz de semillas de mostaza amarillas", "100ml / 3½ fl oz de cerveza", "400 g / 14 oz astillas de patatas, peladas y cortadas en porras", "aceite vegetal, para freír", "4 huevos de gallinas camperas", "½ corcho de jamón cocido, rallado", "sal marina"], "method": ["Primero haz la mostaza. Coloque la miel, el azúcar y el vinagre en una cacerola y caliente hasta que la miel se haya disuelto.", "Coloque las semillas de mostaza y la cerveza en un recipiente y vierta sobre la mezcla tibia de miel. Revuelva para combinar y reservar en la nevera durante dos horas o durante la noche.", "Vierta en un procesador de alimentos y pulse para formar un puré: tomará aproximadamente cinco minutos para que las semillas se descompongan y la mostaza se vuelva cremosa.", "Puedes guardar la mostaza en el refrigerador en un frasco esterilizado sellado por hasta dos semanas.", "Para hacer las virutas, caliente una freidora a 160C / 325F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque las papas en la freidora y cocine durante 8-10 minutos, o hasta que estén doradas y cocidas.", "Escurra las papas fritas sobre papel de cocina y espolvoree con sal marina.", "Mientras se cocinan las patatas fritas, freír los huevos. Calentar una sartén hasta que esté caliente, agregar un poco de aceite vegetal y romper los huevos directamente sobre la sartén. Con una cuchara, ponga el aceite sobre la parte superior de los huevos de vez en cuando hasta que se haya formado y crujiente alrededor de los bordes. Agregue el jamón a la sartén mientras los huevos se fríen para calentar y crujientes ligeramente.", "Para servir, apile los chips en los platos para servir, coloque un huevo al costado. Agregue un poco de jamón triturado al lado y termine con una cucharada de mostaza."], "url": "www_bbc_co_uk_food_recipes_ham_fried_egg_beer_49630", "title": "Jamón, huevo frito, mostaza de cerveza y patatas fritas caseras", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 corvejón de jamón pequeño (aproximadamente 1 kg / 2 lb 4 oz)", "1 cebolla grande, espesamente cortada", "1 chalote, en rodajas gruesas", "1 cabeza de ajo, cortado por la mitad horizontalmente", "2 zanahorias, cortadas en trozos", "1 palo de apio, cortado en trozos", "3 ramitas de perejil", "1 ramita de tomillo", "6 granos de pimienta enteros", "1 hoja de laurel", "25g / 1oz de mantequilla", "Guisantes congelados de 400g / 14oz", "1 perejil grande de hojaldre, toscamente picado", "750 ml / 1¼ litro de caldo de jamón (desde arriba)", "150ml / 5fl oz doble crema, más extra para servir", "sal y pimienta negra", "2 cucharadas de aceite de colza", "1 baguette largo, cortado por la mitad a lo largo, luego a lo ancho", "2 dientes de ajo, cortados por la mitad"], "method": ["Para los corvejones de jamón, coloque el jamón en una cacerola profunda, agregue todos los demás ingredientes para el corvejón de jamón y cubra con agua. Deje que hierva lentamente, luego cocine a fuego lento durante 1½-2 horas, luego retírelo del fuego y deje que se enfríe un poco.", "Retire los corvejones de jamón del caldo y triture la carne del hueso, reservando el caldo de jamón para hacer la sopa.", "Para la sopa, caliente una sartén grande hasta que esté caliente, agregue la mantequilla, los guisantes y el perejil y añada 750 ml / 1/4 de pinta del licor de cocción del corvejón del jamón. Agregue la crema y cocine a fuego lento.", "Transfiera a una licuadora y pulse para formar un puré.", "Regrese a la cacerola para calentar, luego sazone con sal y pimienta negra.", "Caliente una sartén hasta que esté caliente, rocíe la mitad del aceite de colza sobre el pan, luego coloque sobre la plancha, con el lado del corte hacia abajo, y cocine hasta que se queme.", "Para servir, ponga la sopa en cuencos para servir, cubra con algo del jamón rallado, una llovizna de crema y el último aceite de colza."], "url": "www_bbc_co_uk_food_recipes_ham_hock_and_pea_soup_18013", "title": "Jamón y sopa de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Empalme gammon de 2,5-3 kg / 5-6 lb 8 oz, ahumado o sin ahumar, laminado y atado", "1 cebolla grande", "6 dientes", "4 hojas de laurel", "1 ramita de tomillo", "algunas bayas de pimienta de Jamaica", "2 zanahorias, peladas y picadas", "2 palitos de apio, más o menos picados", "pocos granos de pimienta", "clavos, para tachonar", "150g / 5½oz de conserva de cereza", "100ml / 3½fl oz de whisky bourbon", "Jengibre de raíz de 3 cm / 1¼ en pieza finamente rallado", "1 cucharada de azúcar morena suave y ligera", "½ cucharadita de canela molida"], "method": ["Pon el gammon en una olla grande y cúbrelo con agua. Llevar a ebullición, luego escurrir. Enjuague cualquier almidón blanco del jamón y la cacerola, luego devuelva el jamón a la cacerola. Cubre con agua otra vez.", "Stud la cebolla con los dientes de ajo, y agregue a la sartén con todos los ingredientes restantes.", "Llevar a ebullición, reducir el fuego y hervir a fuego lento, tapado, durante 2-2½ horas, o hasta que el jamón esté cocido, la temperatura interna debe alcanzar 68C / 154F (puede usar un termómetro para carne para verificar). Retire del fuego y deje enfriar en el licor o transfiéralo inmediatamente a la superficie de trabajo.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para preparar el jamón para el glaseado, corte la cuerda y corte la corteza exterior, dejando al menos la mitad del grosor de la grasa debajo del jamón. Marca un patrón de diamantes en la grasa y clavos en cada esquina.", "Para hacer el glaseado, mezcle la conserva de cereza con un procesador de alimentos o licuadora de mano para que quede lo más suave posible, luego colóquela en una cacerola con bourbon, jengibre, azúcar y canela.", "Llevar a ebullición y cocinar a fuego lento durante 15 minutos, o hasta que el líquido se haya reducido lo suficiente como para cubrir la parte posterior de una cuchara. Cepille el glaseado sobre el jamón, asegurándose de que lo use todo.", "Coloque el jamón en una lata para asar y tueste en el horno durante 20-25 minutos, o hasta que esté bien dorado. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_ham_glazed_with_cherries_83650", "title": "Jamón glaseado con cerezas y bourbon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ham_glazed_with_cherries_83650_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 rebanadas de jamón, cortadas a la mitad", "1 bola de mozzarella de búfala, desgarrada en 12 piezas", "12 hojas de albahaca", "4 higos a la brasa, descuartizados", "aceite de oliva", "sal marina"], "method": ["Al final de cada rebanada de jamón, coloque un trozo de mozzarella, hojas de albahaca y un cuarto de higos.", "Rocíe con aceite de oliva y sazone con sal marina y pimienta negra recién molida.", "Enrolle y asegure con un palillo de cóctel.", "Refrigere hasta que se requiera."], "url": "www_bbc_co_uk_food_recipes_hamcheeseandfigskewe_10297", "title": "Brochetas de jamón, queso y higo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1¾oz de glucosa líquida, calentada (disponible en proveedores de horneado especializados y en línea)", "Guisantes congelados de 400g / 14oz", "2 ramitas de menta, más o menos picadas", "pellizcar azúcar en polvo, si es necesario", "pizca de sal, si es necesario", "4 huevos de pato a campo abierto muy frescos, a temperatura ambiente", "8 rebanadas finas de obleas Baguette francés", "rociar aceite de oliva", "3-4 cucharadas de caldo de pollo de buena calidad", "10g / ½oz de mantequilla salada", "100g / 4oz de guisantes recién desgranados", "pizca de sal", "4 rebanadas finas de obleas de jamón británico secado al aire, o similar, como jamón Serrano o Parma", "Brotes de guisantes frescos de 100 g / 4 oz, refrigerados"], "method": ["Para hacer el sorbete de guisante, hierva la glucosa líquida y 200 ml / 7 fl oz de agua en una cacerola para hacer un sirope común. Agregue el petit pois congelado y la menta. Deje que se enfríe un poco y luego vierta en un procesador de alimentos o licuadora. Procese a alta velocidad para hacer un puré. Enfríe, luego viértalo en una máquina para hacer helados y revuelva por 20-30 minutos o hasta que el sorbete alcance una textura de helado suave. Pruebe el condimento y ajuste con una pizca de azúcar y sal si es necesario. Transfiera a un contenedor de congelador y congele.", "Luego, poche los huevos. Una olla arrocera es lo mejor para usar, pero si no tiene una, caliente una fuente de agua a alrededor de 62 ° C / 143 ° F, idealmente controle la temperatura con una sonda digital. Con cuidado, agregue los huevos en sus caparazones y déjelos a 62 ° C / 143 ° F durante aproximadamente 1 hora y media; los blancos serán firmes y las yemas estarán líquidas. Retire los huevos con una espumadera y déjelos a un lado.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque las rebanadas de pan en una bandeja grande para hornear, cepille con aceite de oliva y hornee durante aproximadamente 12 minutos o hasta que estén doradas.", "Vierta el caldo de pollo en una cacerola mediana y agregue la mantequilla, guisantes pelados y una buena pizca de sal. Cocine a fuego lento durante 3-4 minutos para estofar los guisantes hasta que estén tiernos.", "Para servir, pelar con cuidado las conchas de los huevos de pato. Coloque los guisantes estofados en el centro de los cuencos de sopa poco profundos y calientes. Siente los huevos encima de los guisantes. Coloque una rebanada de jamón sobre cada huevo y coloque una cucharada de sorbete de guisantes a un lado. Coloque un par de tostadas encima del jamón. Viste los brotes de guisantes con un chorrito de aceite de oliva y una pizca de sal, luego espárzalos por todas partes."], "url": "www_bbc_co_uk_food_recipes_hameggandpeas_85942", "title": "Jamón, huevo y guisantes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 4oz jamón corvejones", "1 cebolla, más o menos picada", "1 zanahoria, más o menos picada", "½ cucharadita de pimienta negra", "1 cucharadita de sal", "2 hojas de laurel", "2 ramitas de perejil fresco de hoja plana", "2 ramitas de romero fresco", "Agua para cubrir", "2 hojas de gelatina", "1 manojo de cebollas de primavera, recortadas", "250ml / 9fl oz vinagre de malta decapado", "125 g / 4½ oz de azúcar en polvo", "1 cucharada de aceite de oliva", "1 cucharada de semillas de mostaza", "½ cucharadita de copos de chile", "Calabacines 400g / 14oz, pelados, sin semillas y cortados en rondas de 1cm / ½", "½ cucharadita de sal", "pizca de pimienta negra recién molida"], "method": ["Para la terrina, coloca los corvejones de jamón en una olla profunda con cebolla, zanahoria, pimienta, sal y hierbas. Cubra con agua y hierva, luego reduzca el fuego y cocine a fuego lento durante dos horas. Retirar del fuego y dejar enfriar.", "Saca los jamones de jamón de la sartén y ponlos a un lado. Cuele el licor de cocción a través de un colador fino y vierta 250ml / 9fl oz de él en una cacerola (el resto podría guardarse y usarse como una base de sopa).", "Pon a hervir una olla de agua. Coloque las cebolletas en un recipiente de vapor colocado sobre la sartén y deje hervir durante cinco minutos, o hasta que estén tiernas. Retirar del vaporizador y dejar enfriar.", "Coloque las hojas de gelatina en un recipiente con agua fría y remoje durante cinco minutos hasta que estén flexibles, luego drene.", "Lleva el licor de cocción reservado de 250 ml / 9 onzas líquidas a fuego lento y mezcla la gelatina remojada. Batir hasta que la gelatina se haya disuelto.", "Retire el jamón de los huesos y córtelo en rodajas gruesas de 2.5 cm. Cubra un molde de terrina con una película grande y extienda la mitad del jamón sobre la base.", "Extienda las cebolletas sobre el jamón, luego cubra con el jamón restante.", "Verter la mezcla de gelatina sobre el jamón y darle un toque suave al molde para asentar el contenido y eliminar las bolsas de aire.", "Doble la película adhesiva sobre la terrina y coloque dos latas en la parte superior para pesarlo. Coloque en el refrigerador durante al menos dos horas, o hasta que esté listo.", "Para la médula en escabeche, coloque el vinagre y el azúcar en una cacerola y deje que hierva. Retire del fuego.", "Caliente el aceite de oliva en una sartén y agregue las semillas de mostaza y las hojuelas de chile. Revuelva freír durante un minuto, hasta que las semillas comiencen a reventar.", "Agregue la médula y fría por 2-3 minutos, o hasta que se ablanden. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque la médula en un recipiente, vierta sobre la mezcla de vinagre y revuelva bien. Deje que se enfríe completamente, luego coloque en la nevera. La médula en escabeche se mantendrá durante varios días en el refrigerador si se almacena en frascos esterilizados sellados.", "Para servir, retire la película adhesiva de la terrina y corte la terrina en rodajas. Coloque sobre los platos para servir con una cucharada de médula en escabeche, drenada de su vinagre."], "url": "www_bbc_co_uk_food_recipes_hamhockterrinewithpi_87047", "title": "Terrina de jamón con médula en escabeche", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla picada", "25 g / 1 oz de gammon picados", "4 puerros tiernos, picados", "100g / 3½oz de guisantes frescos", "150ml / 5fl oz de caldo de pollo", "sal y pimienta negra recién molida", "1 cucharada de crema doble"], "method": ["Calentar el aceite en una olla mediana. Agregue la cebolla, gammon y puerros y cocine durante cuatro minutos.", "Agregue los guisantes y el caldo a la cacerola y cocínelos durante 3-4 minutos.", "Transfiera la mezcla al recipiente de un procesador de alimentos y sazone con sal y pimienta negra recién molida. Mezcle la mezcla hasta que la sopa tenga una textura suave. Vierta la sopa en una olla y cocine a fuego lento hasta que esté caliente todo el tiempo, pero no hirviendo.", "Para servir, vierta la sopa en un tazón limpio y adorne con la crema doble."], "url": "www_bbc_co_uk_food_recipes_hamleekandpeasoup_84643", "title": "Sopa de jamón, puerro y guisante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 2 oz de carne picada de cerdo", "1 cucharadita de chile rojo picado", "1 diente de ajo, finamente picado", "1 cucharadita de semillas de hinojo", "110ml / 4fl oz de vino tinto", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 pimientos rojos grandes", "2 pimientos amarillos grandes", "1 cucharada de alcaparras saladas, remojadas durante 30 minutos, luego escurridas", "1 diente de ajo, en rodajas", "½ chile rojo, finamente picado", "5 anchoas", "aceite de oliva"], "method": ["Mezcle el cerdo, el chile, el ajo, las semillas de hinojo, el vino tinto, la sal y la pimienta negra recién molida en un bol hasta que estén bien combinados.", "Con las manos, divida la mezcla en 12 y enrolle cada pieza en forma de salchicha de aproximadamente 8 cm de largo y 3 cm de diámetro.", "Para la salsa, caliente una plancha de hierro fundido en la placa. Ase los pimientos en todos los lados hasta que las pieles estén negras. Poner a un lado para enfriar, pelar las pieles y eliminar las semillas.", "Mezcle la pimienta con todos los demás ingredientes (excepto el aceite) en un procesador de alimentos hasta que quede suave.", "Con el motor en marcha, vierta suficiente aceite hasta que el vendaje se vuelva coherente.", "Caliente una cucharada de aceite en una sartén antiadherente grande, coloque suavemente las salchichas en la sartén y fría a fuego medio durante 10 minutos, volteándolas con frecuencia, hasta que estén doradas por todos lados.", "Sirve las salchichas junto con la salsa."], "url": "www_bbc_co_uk_food_recipes_hand-made_skinless_03476", "title": "Salchichas sin piel hechas a mano con salsa de pimienta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de jamón, recogido de una espiga de jamón cocida", "Patatas de 250 g / 9 oz, hervidas hasta que estén tiernas, escurridas y luego trituradas", "1 cucharada de perejil fresco picado", "1 chile, finamente picado", "4 pepinillos, finamente picados", "sal y pimienta negra recién molida", "150g / 5oz de harina natural, más extra para espolvorear", "2 huevos de gallinas camperas, golpeados", "150g / 5oz de polenta", "2 cucharadas de aceite vegetal", "25 g / 1 oz de mantequilla, sin sal", "Harina normal de 25g / 1oz", "200ml / 7fl oz de leche entera", "3 cucharadas de perejil fresco picado", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Coloque el jamón, el puré de patatas, el perejil, el chile y los pepinillos en un recipiente y mezcle para combinar bien. Sazonar bien con sal y pimienta negra recién molida.", "Con las manos enharinadas, moldee pequeñas cantidades de la mezcla en cilindros de 7.5cm / 3 pulgadas.", "Dragar las croquetas en la harina, sumergir en el huevo batido y finalmente sumergir en la polenta para cubrir por completo.", "Calentar el aceite en una sartén a fuego medio. Agregue las croquetas y fría, volteándolas ocasionalmente, hasta que estén crujientes y doradas por todas partes. Retire de la sartén y escurra sobre papel de cocina.", "Para la salsa, derrita la mantequilla en una sartén a fuego medio, luego agregue la harina. Cocine, revolviendo bien, durante 2-3 minutos.", "Agregue la leche, poco a poco, revolviendo constantemente. Continúa agregando la leche y cocina hasta que tengas una salsa suave.", "Agregue el perejil y el jugo de limón, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque unas croquetas en cada plato y rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_hamshankcroquettes_89235", "title": "Croquetas de jamón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, tamizada, más extra para quitar el polvo", "100g / 3½oz de harina blanca fuerte, tamizada", "1 cucharadita de sal", "75g / 2½oz de mantequilla fría, cortada en cubos", "150 g / 5½ oz de manteca de cerdo, cortadas en cubos, más extra para engrasar", "1 huevo de gallinas camperas, batido, para esmaltar", "Relleno de sobras de 400g / 14oz (salvia y cebolla o sabor de su preferencia)", "500g / 1lb 2 oz de pavo cocido, carne blanca y marrón, picada", "sal y pimienta negra recién molida", "Arándanos 200 g / 7 oz (frescos, congelados y descongelados)", "150 g / 5½ oz de salsa de arándanos"], "method": ["Tamiza la harina lisa y fuerte y la sal en un recipiente para mezclar. Usando las puntas de los dedos, frote la mantequilla en la harina hasta que la mezcla se asemeje a pan rallado. Haz un pozo en el centro de la mezcla.", "Caliente la manteca y 200 ml / 7 fl oz de agua en una cacerola pequeña a fuego medio. Cuando la mezcla esté hirviendo, viértala en el pocillo de la mezcla de harina y revuelva con una cuchara de madera, y gradualmente arrastre la mezcla seca al líquido, hasta que la mezcla se mezcle como una masa.", "Engrase una lata para pasteles con forma de resorte de 18 cm / 7 pulg. O un molde de pastel levantado con manteca derretida. Asegúrate de engrasar generosamente la lata para evitar que la pastelería se pegue.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amasar hasta que quede suave y flexible. Estirar tres cuartas partes de la masa y usarla en una línea de la lata preparada. Presione la masa en la base y los lados de la lata para evitar la formación de burbujas de aire. Deje el exceso de hojaldre colgando sobre el borde de la lata.", "Para el relleno, coloque la mitad del relleno en la caja de repostería y presione hacia abajo con el dorso de la cuchara. Acomode la mitad del pavo sobre el relleno, luego sazone con sal y pimienta. Mezcle los arándanos y la salsa de arándanos y mezcle la mitad sobre el pavo. Repite las capas una vez más, presionando hacia abajo como antes.", "Estirar los pasteles restantes hasta que estén lo suficientemente grandes como para cubrir el pastel. Cepille los bordes que sobresalen con agua y coloque la tapa en la parte superior, apretándola en los bordes para sellarla. Corte la mayor parte del exceso de hojaldre con tijeras o un cuchillo, y engarce para crear un borde decorativo. Haga un pequeño orificio en el centro de la tapa y relájese durante 30 minutos.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador 160 ° C).", "Coloque la tarta helada en una lata para asar (para atrapar los jugos que puedan salir de la lata del pastel) y cocine durante 45 minutos. Retire del horno y cepille con huevo batido para glasear. Vuelve al horno por 15 minutos.", "Cuando el pastel esté cocido, retírelo del horno y déjelo enfriar sobre una rejilla de alambre durante 10 minutos. Deje que se enfríe durante otros 30 minutos antes de retirarlo de la lata de resorte o del molde para pastel."], "url": "www_bbc_co_uk_food_recipes_hand-raised_boxing_day_84945", "title": "Pastel del día del boxeo levantado a mano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hand-raised_boxing_day_84945_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "40 g / 1½ oz de harina fuerte", "50g / 1¾oz de mantequilla", "130ml / 4¼fl oz de agua hirviendo", "1 cucharadita de sal", "60 g / 2¼ oz de manteca de cerdo", "1 huevo de gallinas camperas, batido, para lavar huevos", "300 g / 10½ oz de pechuga de pollo y muslo, cortadas en trozos", "300 g / 10½ oz lonchas de tocino ahumado", "2 ramitas de tomillo fresco", "sal y pimienta negra recién molida", "Albaricoques secos 240 g / 8½ oz cortados", "2 hojas de gelatina", "¼ de agua caliente", "1 cubo de caldo de pollo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón grande, combine las harinas y frote la mantequilla con las puntas de los dedos.", "Mezcle el agua hirviendo, la sal y la manteca de cerdo en una olla pequeña. Caliente y mezcle hasta que la manteca se derrita.", "Vierta la mezcla de manteca y agua sobre la mezcla de harina, revolviendo con una cuchara hasta que todo se una.", "Incline la masa sobre una superficie enharinada y junte en una bola.", "Envuelva un trozo de película adhesiva alrededor de dos recipientes de mermelada limpios, vacíos y de lados rectos (aproximadamente 340 g de tamaño). Divida la masa en dos, luego quite un cuarto de cada mitad para las tapas de los pasteles.", "Con las tres cuartas partes restantes de la masa, colóquela en una superficie plana y coloque un tarro de mermelada en la parte superior de la masa en el medio. Esculpa la masa aún caliente alrededor de la plataforma rodante, prueba y asegúrate de que la masa tenga un grosor homogéneo. Asegúrese de que el fondo no sea demasiado grueso y que no haya agujeros en la masa.", "Enfríe las bases de tarta en la nevera durante unos 20 minutos.", "Despliegue el cuarto de pastel reservado en un círculo para que coincida con el tamaño del pastel. Haga un agujero en el centro de cada uno y relájese en la nevera.", "Saque las cajas de los pasteles del refrigerador y cuidadosamente vierta agua hirviendo de un hervidor de agua en cada tarro de mermelada para ablandar los pasteles y libérelos del molde. Si se ablanda demasiado y comienza a ceder, es posible que deba enfriar de nuevo durante 10 minutos más o menos. Recorte la parte superior de las cáscaras para asegurarse de que estén parejos.", "Manteniéndolos separados, sazone bien el pollo y el tocino con sal, pimienta y tomillo fresco.", "Ahora empaca el relleno en el pastel, comienza con tocino, luego pollo, luego una capa de albaricoques picados. Repita hasta que el relleno se haya agotado.", "Coloque sobre la tapa y engarce alrededor de los lados, sellando completamente.", "Cepille las tapas de los pasteles con huevo lavado. Coloque en una bandeja para hornear y cocine durante 50-60 minutos, o hasta que la masa esté bien y crujiente por completo.", "Mientras los pasteles se hornean, disuelva un cubo de caldo de pollo en 150 ml / 5 fl oz de agua caliente.", "Remoje dos hojas de gelatina en agua fría durante cinco minutos. Cuando esté suave, exprima el exceso de agua y mezcle con el caldo tibio.", "Cuando los pasteles estén cocidos, colóquelos en una rejilla para enfriar y deje que se enfríen durante 10 minutos.", "Con cuidado, vierta el caldo en la ranura de la tapa del pastel, para rellenar cualquier espacio dentro del pastel con (lo que será) jalea de caldo de pollo. Esto debe hacerse cuando el pastel está caliente, si lo hace cuando esté frío, la gelatina simplemente se colocará en la parte superior y no se empapará en cada rincón y grieta.", "Dejar reposar durante la noche antes de comer."], "url": "www_bbc_co_uk_food_recipes_hand-raised_chicken_and_12433", "title": "Pastel de pollo y tocino a mano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 2 pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hand-raised_chicken_and_12433_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de uvas rojas, divididas en pequeños racimos", "Filetes de suspensión de 700 g / 1 lb 9 oz (o bavette o onglet)", "sal y pimienta negra recién molida", "1 coliflor grande, quebrada en florecillas, tallo toscamente picado", "400 ml / 14 fl oz crema doble", "2 dientes de ajo, pelados", "75 g / 2½ oz de mantequilla", "100g / 3½oz de queso raclette", "1 cucharadita de extracto de levadura", "15g / ½ oz Parmesano", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Elija alrededor de 200 g / 7 oz de las florecillas de coliflor pequeñas y medianas que tienen una buena forma circular y se reservan.", "Para hacer el puré de coliflor, coloque los flósculos restantes y el tallo en una olla. Vierta la crema, agregue el ajo y 50 g / 1¾ oz de la mantequilla. Cocine a fuego medio durante 10 minutos. Agregue el queso de raclette y mucha sal y pimienta. Cocine por otros 5 minutos o hasta que la coliflor esté suave.", "Agregue el contenido de la sartén a la licuadora y mezcle con un puré. Empuja a través de un tamiz en una sartén limpia, listo para recalentar para servir.", "Para hacer la coliflor asada, ponga a hervir una olla grande de agua, agregue los floretes reservados y cocine por 2-3 minutos, o hasta que estén tiernos. Escurrir y volver a la sartén con la mantequilla restante y el extracto de levadura. Revuelva hasta que la mantequilla se haya derretido y las flores estén cubiertas. Incline en una lata pequeña para asar y tueste en el horno por 20 minutos. Ralla el parmesano por todas partes antes de servir.", "Mientras tanto, coloque las uvas en una lata para asar por separado y tueste en el horno durante 15 minutos, o hasta que estén pegajosas y suaves.", "Caliente una sartén a fuego muy alto y sazone los filetes con sal y pimienta. Cocine por 1-2 minutos por cada lado - este tipo de bistec se sirve mejor rara o se volverá difícil.", "Descanse los filetes durante 10 minutos, antes de cortarlos y servirlos con puré de coliflor, floretes tostados y uvas."], "url": "www_bbc_co_uk_food_recipes_hanger_steak_with_23801", "title": "Bistec colgante con coliflor y uvas tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]