[{"ingredients": ["60 g / 2¼ oz de mantequilla", "300 g / 10½oz de corazones de alcachofa cocidos (disponibles en frascos de delicatessen), cortados por la mitad, escurridos, secados con palmaditas y papel de cocina", "Tocino tocino 100 g / 3½ oz (opcional)", "1 diente de ajo, pelado, aplastado ligeramente con el filo de un cuchillo", "Harina normal de 50g / 2oz", "800 ml / 1 pinta 7 fl oz de leche", "1 cucharada de mostaza integral", "2 pellizcos de nuez moscada molida", "160g / 5½oz de queso duro fuerte, rallado", "sal y pimienta negra recién molida", "350g / 12½oz de macarrones, cocidos de acuerdo con las instrucciones del paquete hasta que estén al dente (agregue una pizca de aceite al agua de cocción para evitar que los macarrones se peguen), escurridos", "4-6 tomates maduros, en rodajas finas con un cuchillo de sierra", "40 g / 1½ oz de queso parmesano, finamente rallado", "3-4 pizcas de hierbas secas mezcladas (como orégano, tomillo o romero)", "sal y pimienta negra recién molida", "rociar aceite de oliva virgen extra"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el queso macarrones, caliente 20 g / ¾ oz de mantequilla en una cacerola mediana a fuego medio. Cuando la mantequilla esté espumosa, agregue las mitades de alcachofa y los lardons, si está usando, y fría, revuelva regularmente, durante 10-12 minutos, o hasta que las alcachofas y el tocino estén doradas y el tocino esté crujiente. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Caliente las 40 g / 1½ oz restantes de mantequilla en una cacerola grande a fuego medio hasta que forme espuma. Agregue el diente de ajo y fría por un minuto, o hasta que se ablanden.", "Agregue la harina y revuelva para combinar, luego continúe cocinando por un minuto más, revolviendo vigorosamente, o hasta que la harina se haya oscurecido ligeramente en color.", "Agregue 3-4 cucharadas de la leche y revuelva hasta que la mezcla se una como una pasta espesa.", "Agregue la leche restante, poco a poco, batiendo cada adición para incorporarla a la mezcla y espere hasta que la mezcla se haya espesado un poco antes de agregar más leche. Cuando toda la leche se ha incorporado a la mezcla, el resultado debe ser una salsa suave con la consistencia de crema doble (esto se conoce como roux).", "Reduzca el fuego levemente y agregue la mostaza y la nuez moscada. Retire el diente de ajo de la mezcla y deséchelo.", "Agregue el queso rallado y revuelva bien hasta que se derrita por completo. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue los macarrones cocidos, las mitades de alcachofa y los lardons de tocino, si se usan, a la salsa de queso y revuelva bien para combinar. Retire la sartén del fuego. Transfiera el queso macaroni a un plato refractario.", "Para el relleno, coloque los tomates en rodajas sobre el queso macarrones. Espolvoree sobre el parmesano rallado y las hierbas secas. Sazonar, al gusto, con sal y pimienta negra recién molida y rociar sobre una pizca de aceite de oliva virgen extra.", "Cubra una bandeja para hornear con papel de aluminio y coloque el plato a prueba de horno en la parte superior para atrapar cualquier goteo. Hornee el queso macarrones en el medio del horno durante 30-40 minutos, o hasta que la cubierta esté dorada y el queso macarrones burbujee."], "url": "www_bbc_co_uk_food_recipes_macaronicheesewithar_91967", "title": "Queso macarrones con corazones de alcachofa y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "500ml / 17½ fl oz de leche", "Queso cheddar 100 g / 3½ oz, rallado", "50g / 2oz de queso parmesano o queso duro vegetariano similar, rallado", "Pasta de macarrones de trigo integral 400g / 14¼ oz, cocida de acuerdo con las instrucciones del paquete"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Derrita la mantequilla en una cacerola a fuego medio. Una vez que la mantequilla se derrita, agregue la harina y cocine durante unos tres minutos, o revuelva continuamente. Poco a poco agregue la leche, poco a poco, a la mezcla de harina y mantequilla, revolviendo con una cuchara de madera hasta que los grumos se hayan derretido y la salsa esté brillante antes de agregar más leche. Una vez que se ha incorporado toda la leche, reduzca el fuego a bajo y cocine a fuego lento durante aproximadamente tres minutos. Agregue el queso cheddar y la mitad del queso parmesano hasta que se derrita.", "Agregue la pasta cocida a la salsa de queso y transfiera la mezcla a una fuente honda para hornear. Alternativamente, alinee los orificios de un molde para muffins con seis envoltorios de cupcake de silicona y divida la mezcla de manera uniforme entre ellos. Espolvoree con el queso parmesano restante y colóquelo en el horno para cocinar durante unos 20 minutos o hasta que se dore. Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_macaronicheese_91063", "title": "Macarrones con queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 (o hace 6 tazas de macarrones)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaronicheese_91063_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar glas de 340g / 12oz", "120 g / 4½ oz de almendras molidas", "200g / 7oz de avellanas tostadas y despellejadas", "240 g / 9 oz de claras de huevo de campo (de alrededor de 4 huevos medianos)", "100 ml / 3½ fl oz de agua", "320g / 11½ oz de azúcar granulada", "2 cucharaditas de colorante para alimentos de castaña", "Crema doble 480ml / 17fl oz", "440 g / 1 libra de chocolate negro, finamente picado", "100g / 3½oz de mantequilla sin sal, ablandada a temperatura ambiente", "400g / 14oz de avellanas peladas asadas, picadas", "Azúcar glas de 340g / 12oz", "Almendras molidas 320 g / 11½ oz", "240 g / 9 oz de claras de huevo (de aproximadamente 4 huevos medianos)", "100 ml / 3½ fl oz de agua", "320g / 11½ oz de azúcar granulada", "2 cucharaditas de colorante de frambuesa en polvo para alimentos", "240ml / 9fl oz de crema doble", "220 g / 8 oz de chocolate negro, finamente picado", "50g / 2oz de mantequilla sin sal ablandada a temperatura ambiente", "150 g / 5½ oz de mermelada de frambuesa"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Línea cuatro bandejas grandes para hornear con papel resistente a la grasa. (Una cosa inteligente es tener una plantilla con círculos uniformemente espaciados que pueda deslizar debajo del papel resistente a la grasa al cavar los macarons; luego, puede deslizarla cuando termine y volver a usarla).", "Para los macarrones de castaño, mezcle el azúcar glas, las almendras molidas y las avellanas en un procesador de alimentos hasta que esté realmente suave.", "Batir las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor.", "Mientras tanto, caliente el agua y el azúcar en una cacerola hasta que alcance 118C / 240F (verifique esto con un termómetro de azúcar).", "Batir las claras de huevo nuevamente y agregar lentamente el jarabe de azúcar. Continúe batiendo hasta que se formen picos rígidos cuando se quite la batidora.", "Doble la mezcla de almendras hasta que quede suave (tenga cuidado de no mezclar en exceso), luego agregue el colorante de comida de castaña. Coloque la mezcla en bolsas de plástico y pinte 4cm / 1½ en rondas en las bandejas para hornear.", "Los macarrones deben reposar durante al menos 20 minutos antes de entrar en el horno, ya que ayuda a formar una piel. Hornea de 13 a 15 minutos. (Puede necesitar hacer esto por lotes, pero los macarrones pueden descansar durante 1-2 horas).", "Retirar del horno y reservar para enfriar. Con cuidado, despegue los macarrones del papel resistente a la grasa.", "Para el relleno de ganache, caliente la crema doble en una cacerola hasta que hierva, luego retírela del fuego. Vierta la crema sobre el chocolate picado y revuelva hasta que el chocolate se haya derretido y la mezcla esté suave.", "Agregue la mantequilla y las avellanas picadas. Coloque el ganache en bolsas de plástico y déjelo enfriar.", "Pipe una pequeña cantidad de ganache en la mitad de los macarrones y sándwich junto con los macarrones restantes.", "Para los macarrones de frambuesa, alinee cuatro bandejas grandes para hornear con papel resistente a la grasa. (Una cosa inteligente es tener una plantilla con círculos uniformemente espaciados que pueda deslizar debajo del papel resistente a la grasa al cavar los macarons; luego, puede deslizarla cuando termine y volver a usarla).", "Mezcle el azúcar glas y las almendras molidas en un procesador de alimentos hasta que estén realmente suaves.", "Batir las claras de huevo en un bol hasta que se formen picos rígidos cuando se quite el batidor.", "Mientras tanto, caliente el agua y el azúcar en una cacerola hasta que alcance 118C / 240F (verifique esto con un termómetro de azúcar).", "Batir las claras de huevo nuevamente y agregar lentamente el jarabe de azúcar. Continúe batiendo hasta que se formen picos rígidos cuando se quite la batidora.", "Doble la mezcla de almendras hasta que quede suave (tenga cuidado de no mezclar en exceso), luego doble el colorante de la comida frambuesa. Coloque la mezcla en bolsas de plástico y pinte 4cm / 1½ en rondas en las bandejas para hornear.", "Los macarrones deben reposar durante al menos 20 minutos antes de entrar en el horno, ya que ayuda a formar una piel. Hornea de 13 a 15 minutos. (Puede necesitar hacer esto por lotes, pero los macarrones pueden descansar durante 1-2 horas).", "Retirar del horno y reservar para enfriar. Con cuidado, despegue los macarrones del papel resistente a la grasa.", "Para el relleno de ganache de frambuesa, caliente la crema doble en una cacerola hasta que hierva, luego retírela del fuego. Vierta la crema sobre el chocolate picado y revuelva hasta que el chocolate se haya derretido y la mezcla esté suave.", "Agregue la mantequilla y la mermelada de frambuesa. Coloque el ganache en bolsas de plástico y déjelo enfriar.", "Pipe una pequeña cantidad de ganache en la mitad de los macarrones y sándwich junto con los macarrones restantes.", "Para crear la torre de macarrones, cubra el cono de espuma con papel artesanal. Inserte los palillos de dientes por todo el cono de espuma en un patrón regular, con 1cm / ½ pulgada de cada mondadientes sobresaliendo. Con cuidado, empuje los macarrones en los mondadientes hasta cubrir todo el cono."], "url": "www_bbc_co_uk_food_recipes_macaroon_wedding_tower_64304", "title": "Torre de bodas de macarrones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 30", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroon_wedding_tower_64304_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de azúcar glasé", "125g / 4½ oz de almendras molidas", "90 g / 3½ oz de claras de huevo de gallinas camperas", "2 cucharadas de agua", "Azúcar en polvo de 110 g / 4 oz", "Colorante alimentario (opcional)", "coco desecado, para rociar (opcional)", "150ml / 5fl oz crema doble o batida, batida"], "method": ["Precaliente el horno a 170 / C / 325F / Gas 3 y forre una bandeja grande para hornear con papel de hornear.", "Coloque el azúcar glas, las almendras molidas y las claras de huevo de 40 g / 1½ oz en un tazón grande y mezcle hasta obtener una pasta.", "Ponga el agua y el azúcar en una sartén pequeña y caliente suavemente para derretir el azúcar, luego suba el fuego y hierva hasta que la mezcla comience a espesar y espese. No uso un termómetro, pero si prefiere usar uno, debería leer 115C / 239F en esta etapa.", "Batir las claras de huevo restantes de 50 g / 2 oz en un tazón pequeño hasta que se formen picos de rigidez media cuando se retire el batidor del tazón, luego vierta el jarabe de azúcar, batiendo hasta que la mezcla se vuelva dura y brillante. Para macarrones de colores, agregue unas gotas de colorante para alimentos. Incline esta mezcla de merengue en la mezcla de pasta de almendras y revuelva suavemente hasta que se vuelva tieso y brillante de nuevo.", "Con una cuchara en la manga pastelera. Pipe una pequeña mezcla debajo de cada esquina del papel de hornear para evitar que se deslice. Con la bolsa sostenida verticalmente, pase 4 cm / 1½ pulgadas en círculos planos sobre la bandeja alineada, aproximadamente a 2 cm / ¾ pulgada, girando la bolsa después de cada una. La mezcla debe ser bastante suelta para dar un acabado suave. La tubería dejará una pequeña \"punta\" en cada círculo, de modo que, cuando estén todos entubados, dele a la bandeja 2-3 golpes en una superficie plana para aplanarlos. En esta etapa, espolvoree con coco desecado si lo desea.", "Dejar reposar durante 30 minutos para formar una cáscara y luego hornear en el horno durante 12-15 minutos con la puerta entreabierta hasta que esté firme. Retire del horno, levante el papel de la bandeja de hornear y deje que los macarrones se enfríen en el papel.", "Cuando esté frío, empareda los macarrones con crema batida. ¡Se pueden guardar por un par de días, si se quedan tanto tiempo!"], "url": "www_bbc_co_uk_food_recipes_macaroons_04669", "title": "macarrones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 24 macarrones (12 si están intercalados)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroons_04669_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4 oz de almendras molidas", "200g / 7oz de azúcar glasé", "3 claras de huevo de gallinas camperas", "2 cucharadas de azúcar en polvo", "½ cucharadita de crema de tártaro", "pellizcar colorante de comida en polvo rojo", "200 g / 7 oz de chocolate negro, picado", "Crema doble de 200 ml / 7 fl oz", "1 cucharadita de brandy", "15 g / ½ oz de mantequilla sin sal"], "method": ["Mezcle las almendras molidas y el azúcar glas en un procesador de alimentos hasta que estén bien combinados. Dejar de lado.", "Usando un batidor eléctrico, bata lentamente las claras de huevo en un tazón grande a baja velocidad hasta que se formen picos rígidos cuando se quite el batidor. Bata lentamente la crema de tártaro y el azúcar impalpable hasta que la mezcla esté suave y brillante, aumentando la velocidad del batidor a medida que la mezcla se endurece.", "Doble suavemente la coloración de los alimentos y mezcle las almendras molidas y el azúcar glas hasta que la mezcla se asemeje a la espuma de afeitar.", "Con una cuchara, coloque la mezcla de macarrones en una manga pastelera con una boquilla redonda de 1 cm / ½ pulgada. Pipe 5cm / 2in círculos en la bandeja de horno forrada con papel resistente a la grasa. Si se forma un pico, humedezca su dedo y alisarlo. Toque con fuerza la parte inferior de la bandeja para liberar las burbujas de aire de los macarrones, luego déjela a un lado durante 60 minutos (las cáscaras de los macarrones están listas para entrar en el horno cuando ya no estén pegajosas al tacto).", "Mientras tanto, precalentar el horno a 160 ° C / 315 ° F / Gas 2½.", "Hornee los macarrones en el horno durante 10-15 minutos o hasta que estén cocidos. Retire del horno y deje enfriar por 5 minutos. Retire con cuidado el papel antigrasa y déjelo a un lado para que se enfríe por completo.", "Mientras tanto, para el relleno de chocolate, caliente la crema doble y el chocolate en una cacerola a fuego lento, revolviendo ocasionalmente, hasta que estén suaves y bien combinados. Agregue el brandy y la mantequilla y revuelva hasta que quede suave, luego retírelo del fuego y déjelo a un lado para que se enfríe por completo.", "Use el relleno para emparedar los macarrones y luego enfríe en la nevera durante 30 minutos."], "url": "www_bbc_co_uk_food_recipes_macaroons_16105", "title": "macarrones", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 10 macarrones", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroons_16105_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, pequeña y dulce", "3 cucharadas de vinagre de vino blanco", "500 g / 1lb de papas pequeñas para ensalada", "2 cucharaditas de mostaza Dijon", "1 alcaparras colmadas de tsp", "2 cucharadas de vinagre de vino blanco", "6 cucharadas de aceite de oliva", "4 eneldo espeso eneldo", "6 lonchas finas de tocino ahumado ahumado", "2 caballa ahumada entera (o 4 filetes)"], "method": ["Precalentar la parrilla a fuego medio alto. Cubra una bandeja para hornear con papel antigrasa.", "Pelar y cortar finamente la cebolla en anillos. Póngalos en un tazón pequeño con el vinagre de vino blanco y déjelos a un lado por 10 minutos o más, lanzándolos de vez en cuando. Esto elimina cualquier aspereza y suavizará ligeramente la carne de la cebolla.", "Hervir las papas en agua profunda y generosamente salada durante 15 minutos hasta que estén tiernas. Coloque el tocino sobre la bandeja para hornear forrada y ase a la parrilla durante 10 minutos hasta que quede crujiente.", "Toma toda la caballa ahumada y despega la piel. En un tazón grande, desmenuce la caballa del hueso en trozos grandes.", "Mientras las papas estén hirviendo y el tocino asado, prepare el aderezo. Vierta la mostaza en otro cuenco. Enjuague brevemente las alcaparras y agregue a la mostaza. Vierta el vinagre de vino blanco; agregue un poco de pimienta y unos generosos glugs de aceite de oliva. Dale un revuelo.", "Picar el eneldo y agregar la mitad al aderezo y la otra mitad al tazón con la caballa. Ahora saca las cebollas blandas del vinagre y agrégalas al aderezo.", "Cuando las papas estén suaves hasta el punto de la navaja, escurralas y córtelas por la mitad, dejando la piel puesta, e inclínela en el aderezo para que se absorba. Mezcle y luego cuchara sobre la caballa copos.", "Cuando el tocino esté crujiente, corte pequeños cuadrados de 4cm / 1½ en la ensalada y mezcle por completo antes de servir."], "url": "www_bbc_co_uk_food_recipes_mackerel_and_bacon_salad_10923", "title": "Ensalada de caballa y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerel_and_bacon_salad_10923_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de azúcar en polvo", "50g / 2oz sultanas", "2 ramitas de tomillo frescas, solo hojas", "40g / 1¾oz de pieza de raíz de jengibre fresco, pelado y finamente picado", "½ chalota, finamente picada", "100ml / 3½fl oz de vinagre de sidra", "300 g / 10½ oz de grosellas espinosas frescas, coronadas y de cola", "sal marina y pimienta negra recién molida", "Filete de salmón de 250 g / 9 oz, huesos de piel y alfiler extraídos, carne picada", "1 limón, solo jugo", "Crema doble 110ml / 4fl oz", "4 caballas enteras, cabezas y tripas extraídas, deshuesadas (puedes pedirle a tu pescadero que haga esto por ti)", "4 ramitas de estragón fresco, solo hojas", "600g / 1lb 5 oz de hojaldre con mantequilla listo para usar", "2 yemas de huevo de gallinas camperas, ligeramente batidas", "sal marina y pimienta negra recién molida"], "method": ["Para la salsa picante, caliente el azúcar en una sartén grande de base pesada a fuego lento, revuelva bien hasta que se haya derretido y se haya dorado (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado. Use una sartén profunda para evitar rebosando.). Agregue las sultaninas, tomillo, jengibre y chalota.", "Agregue el vinagre de sidra y las grosellas a la sartén, mezcle bien y deje que la mezcla hierva. Reduzca el fuego y cocine a fuego lento durante 8-10 minutos, revolviendo ocasionalmente, hasta que las grosellas se hayan ablandado y desmenuzado. Sazonar, al gusto, con sal y pimienta negra recién molida, luego reservar para que se enfríe un poco.", "Para la caballa, precaliente el horno a 220C / 200C Fan / Gas 7.", "Mezcle el salmón y el jugo de limón con una pasta fina en un procesador de alimentos. Con el motor todavía en funcionamiento, agregue gradualmente la crema en una corriente delgada hasta que toda la crema se haya incorporado a la mezcla y la pasta se haya espesado hasta obtener una espuma esponjosa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Uno por uno, rellene cuidadosamente las cavidades de la caballa primero con las hojas de estragón, luego con la mousse de salmón.", "Ruede los pasteles en una superficie de trabajo ligeramente enharinada a un grosor de 0.5cm / ¼in. Cortar la masa en cuatro rectángulos: estos deben ser lo suficientemente largos como para envolver el pescado relleno y la mitad de ancho que el pescado (alrededor de 15 cm x 18 cm / 6 pulgadas x 7 pulgadas).", "Cepille cada rectángulo de repostería con un poco del huevo batido, luego envuelva un rectángulo alrededor del centro de cada pez, presionando los extremos de la masa juntos debajo del pescado para sellar (use un poco más de huevo batido para esto si es necesario).", "Coloque el pescado relleno y relleno en una bandeja para hornear. Envuelva la cola de cada pez en papel de aluminio engrasado para evitar que se queme. Espolvorea un poco de sal marina sobre cada pez.", "Hornee la caballa rellena en el horno durante 18-20 minutos, o hasta que la masa se haya levantado y dorada y los pescados estén bien cocidos. Retire del horno y deje enfriar por unos cinco minutos.", "Para servir, corte cada caballa a la mitad y sirva con una cucharada de chutney de grosella."], "url": "www_bbc_co_uk_food_recipes_mackerel_en_crote_with_62948", "title": "Mackerel en croûte con salsa picante de grosella espinosa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 puñados de fresas (escocés si es posible)", "4 puñados de frambuesas (escocés si es posible)", "2 puñados de tayberries (escocés si es posible)", "1 cestito pequeño de grosellas rojas (escocés si es posible)", "1 cestito de grosellas blancas (escocés si es posible)", "una buena ducha de Cointreau", "270 g / 9½ oz de azúcar en polvo", "350ml / 12fl oz de agua fría", "2 cucharadas de jugo de naranja fresco", "250 g / 9 oz de queso mascarpone", "3 ramitas de menta", "espolvorear azúcar glas"], "method": ["Disuelva el azúcar impalpable y el agua juntos, lleve a ebullición hasta que esté ligeramente reducido y frío. Agregue el jugo de naranja.", "Batir el jarabe en el mascarpone. Tamizar y batir en una máquina de helados. Si lo hace a mano, colóquelo en una caja a prueba de congelación y revuelva / bata cada 30 minutos durante aproximadamente 1 ½ horas.", "Elija entre todas las bayas, corte las fresas y las grosellas rojas y blancas. Coloque las bayas en un tazón grande y moje con Cointreau. Deja cubierto con película adhesiva para macerar durante 1-1½ horas.", "Para servir, simplemente distribuye las bayas en cuatro cuencos refrigerados. Saque el sorbete y colóquelo en el centro de los tazones. Puede servir una galleta con este plato, por ejemplo, brochetas de cantuccini o brandy. Adorne con una ramita de menta y azúcar glas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_maceratedscottishber_12131", "title": "Bayas escocesas maceradas con sorbete de mascarpone", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ manojo de nabos para bebé, cortados en rodajas finas con mandolina", "½ racimo de rábanos, preferiblemente rábanos de desayuno, cortados en rodajas finas con mandolina", "¼ de pepino, pelado, finamente cortado con una mandolina", "Vinagre de vino blanco 110ml / 4fl oz", "1 cucharadita de azúcar", "1 cucharadita de sal", "½ manojo de perejil fresco, más o menos picado", "½ manojo de cebollín fresco, más o menos picado", "½ grupo de cilantro fresco, toscamente picado", "200ml / 7fl oz de aceite", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10½fl oz de aceite vegetal", "Carne de cangrejo blanca 150 g / 5 oz", "2 filetes de caballa, piel encendida, huesos de alfiler eliminados", "2 cucharadas de alazán de madera fresca picada, para adornar", "sal y pimienta negra recién molida"], "method": ["Coloque las verduras en un recipiente resistente al calor. En una cacerola, caliente 110 ml / 4 fl oz de agua y todo el vinagre de vino blanco, revolviendo el azúcar y la sal hasta que se disuelva. Vierta la mezcla de vinagre sobre las verduras en rodajas y deje a un lado para encurtir durante 2 horas. Drene las verduras, descartando el líquido decapante.", "Mientras tanto, para el aceite de hierbas, mezcle todos los ingredientes en un procesador de alimentos hasta que quede suave. Colar a través de un tamiz fino, luego dejar de lado.", "Para el cangrejo vestido, mezcle las yemas de huevo, el vinagre y la mostaza en un procesador de alimentos hasta que quede pálido y cremoso. Con el motor todavía en funcionamiento, vierta gradualmente el aceite en una corriente fina, hasta que la mezcla forme una mayonesa espesa. (Puede que no necesite usar todo el aceite).", "Coloque la carne de cangrejo en un recipiente pequeño de vidrio y cubra con la mayonesa. Sazonar, al gusto, con sal y pimienta. Enfríe en el refrigerador hasta que esté listo para servir.", "Justo antes de servir, coloque los filetes de caballa, con los costados hacia arriba, en una bandeja para hornear. Caliente la piel de la caballa por todas partes con un soplete de cocineros, hasta que los filetes de pescado estén completamente cocidos. Alternativamente, precalentar la parrilla a su nivel más alto y asar los filetes de caballa hasta que estén cocidos.", "Rocíe cada porción del plato con el aceite de hierbas. Coloque un filete de caballa en el centro de cada plato. Con una cuchara, coloque la mitad de la mayonesa de cangrejo en un lado del pescado, luego coloque las verduras en escabeche en el otro lado. Adorne con la acedera de madera y sirva."], "url": "www_bbc_co_uk_food_recipes_mackerel_fillet_with_45038", "title": "Filete de caballa con cangrejo, vegetales en escabeche y aceite de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 filetes grandes de caballa, todos los huesos retirados", "2 cucharadas de hojas de orégano fresco finamente picadas (o 1 cucharadita seca)", "1 limón, ralladura solamente", "1 cucharada de vinagre de vino tinto", "2 cucharadas de aceite de oliva", "pizca de chile en polvo o copos (opcional)", "2 cebollas rojas pequeñas, cada una cortada en cuartos", "1 limón, cortado en cuartos, para servir"], "method": ["Asegúrese de que cada filete de caballa no tenga huesos. (Elimine los huesos del vientre y de los alfileres con alicates para huesos de pescado o pinzas limpias, o siga la línea de los huesos, cortando cada lado de ellos lo más cerca posible del hueso y luego retírelos).", "Ponga las hojas de orégano, la ralladura de limón, el vinagre de vino tinto y el aceite de oliva en un tazón grande y sazone con sal y pimienta negra. Agregue la guindilla, si la está usando.", "Coloque los filetes de caballa en el adobo y refrigéralos durante al menos media hora, volteándolos una o dos veces para asegurarse de que estén completamente cubiertos con la salsa. Ensarte los filetes en brochetas largas, estilo concertina, agregando cuñas de cebolla roja en cada extremo.", "Si cocina en una barbacoa, caliente los carbones hasta que estén blancos, luego cocine la caballa por alrededor de 10 a 12 minutos o hasta que esté cocida. Hilvane con cualquier adobo sobrante y gírelo regularmente. También puede cocinarlos bajo una parrilla caliente o en una sartén de plancha por 10 minutos, dando vuelta 2-3 veces. Sirva con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_mackerel_kebabs_with_42322", "title": "Kebabs de caballa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerel_kebabs_with_42322_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 caballas medianas, con mariposa, huesos de alfiler retirados", "sal y pimienta negra recién molida", "4 salchichas de cerdo de buena calidad, relleno exprimido, pieles descartadas", "1 manojo de estragón fresco, picado", "1 manojo de perejil fresco de flatleaf, picado", "Hojaldre de mantequilla de 500g / 1lb 2oz", "2 yemas de huevo de gallinas camperas, batidas", "½ pepino, pelado, cortado a la mitad longitudinalmente, semillas recogidas, en rodajas", "azúcar pizca", "2 cucharadas de vinagre de sidra", "½ cucharadita de sal", "2 manojos de berro", "1 cucharada de aceite de oliva", "exprimir jugo de limón"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar la caballa con sal y pimienta negra recién molida.", "Mezcle la salchicha, el estragón y la mitad del perejil en un bol.", "Extiende la mezcla sobre el lado cortado de la caballa, luego dobla cada caballa por la mitad a lo largo de la columna vertebral. Enfríe en la nevera.", "Mientras tanto, corte la masa de hojaldre en cuatro pedazos y ruede cada pieza a un espesor de 5 mm / ¼.", "Envuelva cada pescado en un trozo de masa, dejando la cola de caballa asomando, recorte cualquier exceso y ribetee el borde como un pastel.", "Cepille la parte superior de las empanadas con el huevo batido y hornee en el horno durante 25-30 minutos, o hasta que la masa esté bien cocida y dorada.", "Mezcle el pepino, el azúcar, el vinagre y la sal en un bol y póngalo a un lado durante cinco minutos, agregue el perejil restante.", "Para servir, mezcle el berro con el aceite de oliva y exprima el jugo de limón. Sirve las empanadas con la ensalada de berros y pepino al lado."], "url": "www_bbc_co_uk_food_recipes_mackerel_pasty_with_13084", "title": "Caballa pastosa con berros", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 caballas enteras, fileteadas y deshuesadas", "6 cebollas encurtidas, en rodajas finas", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "Jengibre fresco de 2½cm / 1in de la pieza, pelado y destrozado", "1 cucharada de azúcar morena suave", "500 g / 1 libra 2 onzas de uva", "generosa dosis de vino de jengibre o cordial", "1 cucharadita de semillas de hinojo", "1-2 ramitas de tomillo, hojas recogidas y picadas", "2 cebollas baby, cortadas y cortadas", "200g / 7oz de crema fresca", "2 cucharadas de cebollín fresco"], "method": ["Para la caballa, coloque los filetes de caballa en una bandeja para hornear y coloque las cebollas en escabeche sobre la parte superior. Use una antorcha de cocinero para cocinar el pescado y la cebolla. Alternativamente cocine bajo una parrilla muy caliente por 2-3 minutos.", "Para el chutney de grosella espinosa, caliente el aceite de oliva en una cacerola de base pesada. Agregue la cebolla y freír suavemente hasta que se ablanden, aproximadamente tres minutos. Luego agregue el jengibre y espolvoree el azúcar.", "Cocine suavemente, revolviendo a menudo, durante dos minutos. Agregue las grosellas y el vino de jengibre o cordial. Llevar a ebullición, tapar y cocinar a fuego lento durante 10-15 minutos, revolviendo de vez en cuando hasta que la mezcla se espese en una salsa picante.", "Agregue las semillas de hinojo y las hojas de tomillo en los minutos finales de la cocción. Transfiera la salsa picante caliente a un recipiente tibio y esterilizado. Enfriar y sellar la tapa.", "Para servir, coloque la caballa en platos para servir y sirva con la salsa picante y unas rodajas de cebollas para bebés. Mezcle las cebolletas y la crème fraîche y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_mackerel_with_83219", "title": "Caballa con grosellas, cebollas encurtidas y ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 tomates maduros de vid, picados", "2 cucharadas de vinagre de vino blanco", "2 dientes de ajo picados", "1 cucharada de azúcar", "1 chile rojo, sin semilla, picado", "3 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "1 cucharadita de vinagre de vino blanco", "300ml / 10½fl oz de aceite de oliva ligero", "Crema doble 50ml / 2fl oz", "2 caballas, destripadas, fileteadas, con espinas", "4 lonchas de tocino rayado ahumado, a la parrilla hasta que estén crujientes y cortadas en trozos pequeños", "8 tomates cherry", "2 lechugas Little Gem, hojas separadas", "Savia de 110 g / 4 oz", "10 hojas de albahaca, arrancadas"], "method": ["Para el caldo de tomate, coloque los tomates, el vinagre, el ajo, el azúcar y el chile en un bol. Sazone con un poco de sal y mezcle hasta que esté bien combinado. Coloque los tomates en una pieza grande de muselina y colóquelos sobre un tazón en la nevera durante la noche o durante al menos seis horas. Reserve el líquido recolectado de los tomates (los tomates pueden usarse en otra receta).", "Para la salsa, mezcle las yemas de huevo, la mostaza y el vinagre en un tazón hasta que estén bien combinados. Bata lentamente en el aceite hasta que la mezcla se espese en mayonesa. Batir en la crema.", "Agregue un cucharón del caldo de tomate reservado, luego caliente la salsa en una cacerola a fuego lento, batiendo continuamente, hasta que se caliente.", "Calentar una sartén hasta que esté caliente y freír la caballa, con la piel hacia abajo, con el tocino durante un minuto. Agregue los tomates cherry, rocíe con un poco de aceite y una pizca de sal y cocine durante 3-4 minutos más.", "Retire la caballa y los tomates de la sartén y déjelos a un lado.", "Agregue la lechuga y el hinojo a la sartén que se usa para cocinar el pescado y cocínelo durante un minuto.", "Para servir, cuchara los tomates y la mezcla de lechuga en platos para servir. Cubra con la caballa y la cuchara sobre la salsa. Espolvorea sobre las hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_mackerel_tomato_and_49040", "title": "Ensalada de caballa, tomate y samphire", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 paquete de pasta filo", "100g / 3½ oz de mantequilla clarificada", "4 ostras, descascaradas y picadas", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida", "1 par de mostaza Dijon", "1 lima, solo jugo", "1 cucharada de aceite vegetal", "2 caballas enteras fileteadas, despellejadas y deshuesadas", "25g / 1oz de chalote picado", "30g / 1oz mini alcaparras", "20g / ¾oz de jengibre recién rallado", "1 cucharada de salsa de soja", "1 cucharada de cebollino picado", "Samphire, para adornar (opcional)", "Vinagre de vino de arroz 350g / 12oz", "240g / 8½ oz de azúcar", "1 chile rojo, picado", "25 g / 1 oz de jengibre fresco, pelado y picado", "1 pepino, pelado, cortado a la mitad y sin semillas"], "method": ["Para los casos de pastelería, precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque una hoja de filo en una superficie de trabajo limpia y cepille con mantequilla derretida y derretida. Coloque otra hoja de filo en la parte superior (asegurándose de que no haya arrugas) y cepille con mantequilla más clara. Repita hasta que tenga cuatro capas de pasta filo.", "Recortar círculos con un cortador de pasteles de 10 cm / 4 in. Presione suavemente los círculos en los moldes de tartaleta (o bollo de estaño). Agregue una capa de película adhesiva a prueba de calor o papel de pergamino sobre la masa y rellene con alubias para hornear. Cocine durante 15 minutos, o hasta que estén doradas, para hornear.", "Para el relleno, en un procesador de alimentos combine las ostras, yema de huevo, mostaza Dijon, sal, pimienta, un chorrito de jugo de lima y aceite vegetal. Mezcle según la consistencia de la mayonesa (si es necesario, agregue un poco de jugo de las ostras para aflojar la mezcla). Transfiera a la nevera para enfriar hasta que esté listo para usar.", "Corta los filetes de caballa y ponlos en un bol. Agregue los chalotes picados, las alcaparras, el jengibre, la salsa de soja, un chorrito de jugo de lima y 1-2 cucharadas de la mayonesa de ostra. Agregue las cebolletas picadas y sazone con sal y pimienta negra recién molida.", "Para el pepinillo en vinagre, en una sartén ponga a hervir el vinagre, el azúcar, el chile y el jengibre. Use un pelador de verduras para cortar el pepino en tiras largas de 7cm / 3 pulgadas. Enfríe la mezcla de vinagre, luego agregue al pepino.", "Para servir, llene las tartaletas con la mayonesa de ostras y cubra con el pepinillo y algo de salmón si lo desea."], "url": "www_bbc_co_uk_food_recipes_mackerel_tartar_tartlets_94473", "title": "Tartaletas tartare de caballa con pepinillos encurtidos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "200ml / 7fl oz de aceite de semilla de uva", "1 pomelo rosado, ralladura finamente rallada y fruta segmentada, jugo reservado", "Carne de cangrejo blanca 150 g / 5½ oz", "3 cucharadas de aceite de oliva", "1 pomelo blanco, segmentado, jugo reservado", "1 cucharadita de mostaza Dijon", "2 caballas enteras, fileteadas y deshuesadas", "1 manojo de espárragos ingleses, pelados y cortados", "agua helada, para refrescar", "50 g / 1¾oz de mantequilla sin sal", "1 pomelo, segmentado", "algunas hojas de berro, para adornar"], "method": ["Para la mayonesa, ponga las yemas de huevo en un procesador de alimentos y mezcle. Agregue el vinagre y la mostaza y mezcle de nuevo. Agregue lentamente el aceite, hasta que tenga una mayonesa espesa. Agregue la mitad de la ralladura de pomelo y el cangrejo, reserve la ralladura de pomelo restante para el aderezo.", "Para el aderezo de pomelo, mezcle el aceite con los jugos reservados del pomelo y la cáscara de uva reservada. Agregue la mostaza y batir.", "Precalentar la parrilla a alto. Coloque la piel de caballa boca arriba en una bandeja para hornear y ase de 2 a 4 minutos.", "Pon a hervir una olla grande de agua y blanquear los espárragos durante 1-2 minutos. Ponga el agua helada en un tazón, luego sumerja los espárragos en el agua. Caliente una sartén o sartén y agregue la mantequilla. Cocine los espárragos en la sartén durante 1-2 minutos, hasta que estén coloreados.", "Coloque los espárragos y la caballa en los platos para servir y cubra con una cucharada de mayonesa. Coloque los segmentos de pomelo y pomelo alrededor del plato y rocíe con el aderezo. Adorne con los berros y sirva."], "url": "www_bbc_co_uk_food_recipes_mackerel_with_asparagus_07149", "title": "Caballa con espárragos y pomelo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de caballa", "Copos de sal marina de 100g / 3½oz", "100 g / 3½ oz de azúcar en polvo", "½ daikon rábano", "1 chalote, finamente cortado", "50ml / 2fl oz de vinagre de vino tinto", "100ml / 3½ fl oz crema doble", "2 cucharadas de yogur natural", "50 g / 1¾oz de rábano picante fresco, finamente rallado", "1 limón, solo jugo", "aceite de colza, para freír", "Pasta de miso 100 g / 3½ oz", "50g / 1¾oz de miel líquida", "50ml / 2fl oz de salsa de soja", "30ml / 1fl oz", "30ml / 1fl oz de vinagre de vino de arroz", "1 hoja de alga nori", "5 rábanos, 3 rebanadas finas, 2 dejadas enteras", "2 cebollas de primavera, cortadas diagonalmente", "5g / ¼ oz de amaranto rojo", "5g / ¼ oz de berros, hojas recogidas y lavadas", "5g / ¼ oz de cilantro", "rociar aceite de oliva"], "method": ["Coloque los filetes de caballa en un recipiente con sal y azúcar y mezcle bien. Cubra y refrigere por hasta 2 horas.", "Corta finamente el daikon y ponlo en un recipiente con agua helada. Dejar de lado.", "Para la crema de rábano picante, coloque el chalote y el vinagre de vino tinto en una cacerola a fuego medio y reduzca hasta que toda la humedad se haya evaporado. Deje de lado para enfriar. Batir ligeramente la crema en un tazón mediano. Agregue el yogur y el rábano picante y agregue los chalotes enfriados. Sazonar con sal y la mitad del jugo de limón. Dejar de lado.", "Lave suavemente los filetes de caballa en agua y séquelos. Calentar una pizca de aceite de colza en una sartén grande a fuego medio y freír el lado de la piel de caballa durante 3-4 minutos. Retire del fuego y deje reposar.", "Batir el miso y la miel en un tazón limpio hasta que se combinen. Poco a poco agregue la salsa de soja, el mirin y el vinagre de vino de arroz y sazone con el jugo de limón restante. Escurra el daikon y agrégalo al apósito miso.", "Coloque la hoja de alga nori en un procesador de alimentos y blitz hasta que tenga una miga fina. Dejar de lado.", "Para servir, divida la mezcla de daikon y miso entre dos platos y esparza sobre el rábano rojo en rodajas y la cebolla tierna. Coloque los filetes de caballa encima y espolvoree la crema de rábano picante. Adorne con amaranto rojo, micro cilantro, hojas de berro, rábanos rojos enteros, miga de alga nori y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_mackerel_with_honey_miso_49383", "title": "Caballa con miel de miso, daikon rábano, cebolla de primavera y crema de rábano picante", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2⅔oz de azúcar en polvo", "Sultanas de 25g / 1oz", "algunas ramitas de romero fresco", "Jengibre de raíz de 2cm / ¾in, pelado y finamente picado", "1 chalote, pelado y finamente picado", "3 palos de ruibarbo", "5 cucharadas de vinagre de sidra", "1 naranja, solo jugo", "sal y pimienta negra", "2 caballas enteras, destripadas, fileteadas y deshuesadas", "aceite de colza, para cocinar", "1 naranja, segmentado", "2 cabezas de achicoria, separadas en hojas", "Brotes de guisantes de 100 g / 3½ oz", "pequeñas tapas de apio puñado", "1 cucharada de eneldo fresco picado", "aceite de colza, para vestir", "sal y pimienta negra", "1 palo de ruibarbo, cortado en cintas con un pelador de verduras"], "method": ["Para la salsa picante, en una sartén de base pesada derretir el azúcar hasta que se forme un caramelo dorado. Retire del fuego y agregue las pasas sultanas, ramitas de romero, jengibre, chalota y ruibarbo.", "Agregue el vinagre de sidra y el jugo de naranja. Vuelva a hervir y cocine suavemente durante 8-10 minutos. Sazonar con sal y pimienta y reservar para enfriar.", "Para hacer la ensalada, mezcle los segmentos de naranja, hojas de achicoria, brotes de guisantes, tapas de apio y eneldo. Vístase con aceite de colza y sazone con sal y pimienta.", "Para la caballa, coloque los filetes de caballa con la piel hacia arriba en la bandeja del horno. Cepíllese con aceite de colza y use un soplete para cocinar uniformemente. Voltee y repita del otro lado (alternativamente coloque los filetes debajo de una parrilla caliente). Condimentar con sal y pimienta.", "Sirva una cucharada de chutney con los filetes de caballa cocida y la ensalada. Adornar con cintas de ruibarbo."], "url": "www_bbc_co_uk_food_recipes_mackerel_with_rhubarb_97633", "title": "Caballa con salsa picante de ruibarbo y naranja y achicoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerel_with_rhubarb_97633_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "1 cucharadita de semillas de mostaza", "1 cucharadita de jengibre molido", "½ cucharadita de cúrcuma molida", "½ cucharadita de cardamomo molido", "Anís de 2 estrellas", "4 tomates, pelados, semillas retiradas y picadas", "100ml / 3½fl oz de vinagre de vino blanco", "50g / 1¾oz de azúcar", "sal", "12 greengages, más o menos picados", "4 filetes de caballa", "aceite vegetal, para freír"], "method": ["Para hacer el chutney, caliente el aceite de oliva en una sartén grande y cocine la cebolla y el ajo hasta que estén blandos. Agregue las semillas de mostaza, el jengibre molido, la cúrcuma, el cardamomo y el anís estrellado y mezcle bien.", "Agregue los tomates, el vinagre, el azúcar y la sal y cocine a fuego lento todo lo que se espese. Cuando esté espeso, agregue las bayas verdes y cocine hasta que estén suaves. Retirar del fuego y dejar enfriar un poco.", "Para freír la caballa, caliente el aceite en una sartén grande y pesada. Coloque cada filete de caballa, con la piel hacia abajo, y fría durante aproximadamente cinco minutos o hasta que esté cocido.", "Sirva la caballa con cucharadas de salsa picante templada."], "url": "www_bbc_co_uk_food_recipes_mackerel_with_warm_78395", "title": "Caballa con chutney de green green caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lata de filetes de caballa, escurrida", "30g / 1oz de mantequilla", "½ cucharadita de copos de chile", "1 cucharada de perejil fresco picado", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Coloque todos los ingredientes juntos en un procesador de alimentos, pulse hasta que quede suave y sazone con sal y pimienta negra recién molida.", "Para servir, transfiera la mezcla de caballa a un recipiente pequeño con pan tostado o galletas saladas en el costado."], "url": "www_bbc_co_uk_food_recipes_mackerelpate_87059", "title": "Paté de caballa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pepino, pelado, finamente cortado en una mandolina", "sal", "4 cucharadas de rábano picante fresco rallado", "2 cucharadas colmadas de crema fresca", "2 cucharaditas de mostaza inglesa en polvo", "4 filetes de caballa fresca", "sal y pimienta negra recién molida", "botón de mantequilla", "4 rebanadas de pan de soda, tostadas, untadas con mantequilla", "1 cebolla roja pequeña, finamente cortada", "½ limón pequeño"], "method": ["Para el pepino salado y el rábano picante, coloque las rodajas de pepino en un colador y espolvoree con abundante sal. Mezcle bien y deje que el contenido se drene sobre el fregadero durante media hora.", "Enjuague la sal del pepino con agua fría, luego déjela escurrir. Escurra suavemente el exceso de humedad del pepino con las manos, luego déjelo a un lado.", "En un tazón limpio, mezcle el rábano picante con la crème fraîche y la mostaza en polvo, asegurándose de que el polvo de mostaza esté bien combinado y sin grumos. Dejar de lado.", "Sazonar los filetes de caballa en el lado de la piel con sal y pimienta negra recién molida.", "Caliente la mantequilla en una sartén hasta que esté espumante, luego agregue los filetes con la piel hacia abajo. Coloque una placa a prueba de calor en los filetes de cocción, ya que esto se asegurará de que se mantengan planos y se cocinen uniformemente. Cocine durante 4-5 minutos, o hasta que esté casi cocido, luego gire los filetes y cocine durante 30 segundos, o hasta que estén recién cocidos.", "Para servir, coloque un puñado de pepino en la tostada. Coloque los filetes de caballa cocidos en el pepino. Coloque una cucharada de salsa de rábano picante en la parte superior y adorne con un poco de la cebolla roja en rodajas y un chorrito de limón."], "url": "www_bbc_co_uk_food_recipes_mackerelontoastwiths_90005", "title": "Caballa sobre pan tostado con pepino salado y rábano picante", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerelontoastwiths_90005_16x9.jpg", "isVegetarian": false, "recommendations": 0}]