[{"isVegetarian": false, "title": "Lardy cake crown", "url": "www_bbc_co_uk_food_recipes_lardy_cake_crown_97389", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lardy_cake_crown_97389_16x9.jpg", "ingredients": ["450g/1lb strong white flour", "5g salt", "14g/½oz fast-action yeast", "75g/2½oz butter, cubed, plus extra for greasing", "75g/2½oz lard, cubed", "50g/1¾oz soft dark brown sugar", "225g/8oz mixed dried fruit"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour into a large mixing bowl. Add the salt to one side and the yeast to the other. Mix together then rub in the butter using your fingertips. Pour in 225ml/7½fl oz of water and mix to form a dough. Add a little extra water to form a soft dough that leaves the sides of the bowl clean.", "Tip the dough out onto a lightly floured work surface and knead for 5-10 minutes, or until the dough is smooth. Place in a clean bowl and leave to rise for at least 3-4 hours, or until doubled in size.", "Preheat the oven to 200C/400F/Gas 6 and grease a 20cm/8in springform tin with butter.", "Tip the dough onto a lightly floured work surface. Press with your fingers to flatten out into a rectangle, about 50x20cm/20x8in.  Scatter the lard to cover two thirds of the dough and sprinkle the sugar over the lard. Cover the sugar with the dried fruit.  Bring the uncovered section over into the centre, then fold the other third on top.", "Turn the dough so a long edge is facing you and roll into a large rectangle. Tack the bottom of the dough to the work surface by pressing the edge with your fingers. Roll the dough into a long sausage shape, starting at the long edge furthest away from you. Cut down the entire length of the roll, to form two long strips and reveal the fruit inside. ", "Hold the pieces firmly at each end and twist tightly together, moving your hands in opposite directions. Now coil the twisted dough together into a circle and press the ends firmly together.", "Place the crown into the prepared tin. Leave to prove until it reaches the top of the tin. This will take approximately 1½ hours.", "Bake for 25-30 minutes, or until golden-brown."]}, {"isVegetarian": false, "title": "Lardy cakes", "url": "www_bbc_co_uk_food_recipes_lardy_cakes_15603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170ml/6fl oz milk", "40g/1½oz unsalted butter, cubed plus extra for greasing tin", "340g/12oz strong bread flour", "1 tsp salt", "2 tbsp caster sugar, plus extra for dusting tin", "9g/¼oz dried yeast", "1 free-range egg", "200g/7oz caster sugar, plus extra for sprinkling on the cakes after baking", "250g/9oz lard, cubed", "ground cinnamon, to taste", "150g/5½oz mixed dried fruit (currants, raisins, sultanas), soaked in a little water"], "serves": "Makes 10 cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the milk with the butter until the butter has melted.  Remove from heat and let it cool to 45C/113F.  Meanwhile mix the flour, salt, sugar and yeast in a mixing bowl for a freestanding mixer. ", "Beat the egg into the milk, then pour the liquid gradually into the flour mixture and mix into a dough that is not too sticky - you might not need all the liquid.  Knead the dough in a freestanding mixer with a dough hook for five minutes.", "Cover the dough with cling film and set aside to rise until double in size (about one hour).", "Meanwhile for the lard and sugar mix, combine the sugar and cubed lard to form a soft paste. Add ground cinnamon to taste. ", "Preheat the oven to 200C/400F/Gas 6. Line two baking trays with baking parchment.  Line 10 chefs rings, 8cm/3¼in diameter, with parchment paper, then butter and sugar the paper and set aside.", "Cut the dough into 10 equal pieces, weighing them to ensure they are the same size.  Roll each piece into a ball with your hands, then roll out out each ball into a 14cm/6in circle. Brush some of the lard and sugar paste on the top. Fold an edge of the circle to the centre, rotate and repeat so that a small hexagon is formed. Roll out to a 14cm/6in circle again. Repeat for all 10 and set them aside to rest for 10 minutes. Once rested, brush on more lard and sugar mix and sprinkle on the dried fruit.  Repeat the folding into a hexagon procedure. Place each hexagon into a chef ring on the baking tray, with the folded sides facing up. Cover in cling film and set aside to rest until double in size (about 40 minutes).", "Brush the lardy cakes with milk and place in the hottest part of the oven. Bake for 20 minutes or until golden-brown.", "Remove from oven and rest them in the tin for 15 minutes. Turn out the lardy cakes and sprinkle a mix of half sugar, half ground cinnamon on top of the lardy cakes."]}, {"isVegetarian": false, "title": "Lardy cake with black pepper strawberry jam", "url": "www_bbc_co_uk_food_recipes_lardycakewithblackpe_88763", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz sultanas", "90g/3½oz lard, plus 1 tbsp extra for greasing", "125g/4½oz light muscovado sugar ", "2 tbsp golden syrup", "225ml/8fl oz water", "225g/8oz wholemeal flour", "1 tsp baking powder", "½ tsp bicarbonate of soda", "¼ tsp ground nutmeg", "1 tsp ground allspice", "4 free-range eggs, lightly beaten", "600g/1lb 5oz jam sugar (not to be confused with preserving sugar)", "1 lemon, zest and juice only", "1kg/2lb 4oz strawberries, whole, hulled ", "1 tsp crushed black pepper"], "serves": "4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cake, preheat the oven to 180C/350F/Gas 4.", "Place the sultanas, lard, muscovado sugar, golden syrup and water into a saucepan and bring to the boil, stirring constantly. Remove from the heat and cool - ideally overnight.", "Grease and line a small loaf tin with lard. Sift the flour, baking powder, bicarbonate of soda and spices into a large bowl. Mix the cooled fruit mixture into the dried ingredients along with the eggs, beating well to combine.", "Tip the cake mixture into the prepared cake tin and level the top. Place in the oven to bake for 1-1¼ hours until the top is golden-brown and a skewer inserted into the centre comes out clean.", "Cool in the tin for 30 minutes, before turning out and cooling completely on a wire rack.", "For the black pepper strawberry jam, place the sugar, lemon zest and juice into a large pan and heat until the sugar has dissolved. Add the strawberries and black pepper, bring to the boil and cook for five minutes. ", "Turn off the heat and leave the jam to cool, before skimming off any froth. Spoon into sterilised jars (about 2-3 jars, depending on their size).", "To serve, slice the cake and spread generously with some of the jam."]}, {"isVegetarian": true, "title": "Large shell pasta with aubergines and tomatoes", "url": "www_bbc_co_uk_food_recipes_largeshellpastawitha_73734", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large aubergines", "½ litre/17½fl oz pomace oil, for frying (or olive oil)", "1 clove garlic, finely chopped", "2 tbsp Italian olive oil", "400g/14¼oz tinned Italian chopped tomatoes", "3 tbsp sliced fresh basil", "300g/10½oz conchiglioni pasta (pasta shells)", "100g/3½oz pecorino romano cheese", "salt and freshly ground black pepper, to taste", "green salad"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Cut the aubergine into cubes approximately 2cm (0.75in), place in a sieve, sprinkle with 3-4 pinches of salt and leave to rest, allowing the excess water to drain. ", "Once ready, preheat the pomace or olive oil in a tall saucepan and fry the aubergines until golden and crisp (approximately three minutes).  ", "Drain the excess oil and place aubergines in a bowl ready to use.", "In a saucepan, gently fry the garlic in the olive oil, immediately add the aubergines and the chopped tomatoes and stir well.  ", "Add the basil, season with salt and pepper and allow to cook on a low heat for approximately 20 minutes.", "In the meantime, cook the pasta in salted boiling water until al dente. ", "Drain the pasta and place back into the same large saucepan.", "Add the aubergine sauce to the pasta, mix well and serve immediately with pecorino romano shavings and a green salad."]}, {"isVegetarian": false, "title": "How to make lasagne", "url": "www_bbc_co_uk_food_recipes_lasagne_22392", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lasagne_22392_16x9.jpg", "ingredients": ["olive oil", "1 onion, finely chopped", "1 carrot, chopped", "2 sticks celery, chopped", "1 bay leaf", "3 garlic cloves, crushed", "500g/1lb 2oz beef mince", "2 tbsp tomato purée", "125ml/4fl oz red wine", "1 x 400g/14oz tin chopped tomatoes", "400-500ml/14-18fl oz beef stock ", "sea salt and freshly ground black pepper", "75g/2½oz unsalted butter", "75g/2½oz plain flour", "1 litre/1¾ pint full-fat milk", "¼ tsp freshly grated nutmeg ", "250-300g/9-10½oz dried lasagne sheets that don’t require soaking", "150g/5½oz parmesan, to serve", "extra virgin olive oil, for drizzling"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the sauce, heat a heavy-based saucepan or casserole over a medium-high heat. Once hot, add a glug of oil and then add the onion, carrot, celery and bay leaf and cook for 5-6 minutes, or until softened. Add the garlic and continue to cook for two minutes.", "Turn the heat up and add the mince to the pan and continue to fry, breaking up any large chunks, until the meat is brown all over. Season with salt and pepper. Once completely browned, add the tomato purée, mixing well. Cook for two minutes and then pour in the red wine and turn up the heat to bubble the wine. Cook for 3-4 minutes, scraping any bits stuck to the bottom of the pan.", "Add the tomatoes to the pan, mix well and bring to a simmer then pour in 400ml/14fl oz of the stock. Bring to a rapid simmer, reduce the heat to low and leave to cook gently for an hour, stirring every now and again until thickened and reduced, but still moist. If at any point the mixture looks too dry then add the remaining stock along with a little water, if needed, to top up. Taste and adjust the seasoning as necessary then set to one side while you make the béchamel sauce. ", "Preheat the oven to 190C/375F/Gas 5. In a medium heavy-based saucepan melt the butter, stir in the flour and cook for 3-4 minutes, or until the mixture turns a light golden colour that resembles ground almonds. Gradually whisk the milk in batches until smooth. Taste and season as necessary with salt and pepper. Add the nutmeg and then cook over a gentle heat for 4-5 minutes until thickened, stirring now and again.", "Spread one-third of the meat sauce across the bottom of a medium lasagne dish (approx 2-2.5 litres/3½-4½ pints in volume) and top with a quarter of the béchamel, then cover with lasagne sheets, breaking any as necessary to fit so that everything is covered. (It doesn't matter if the sheets overlap a little.) Sprinkle over a quarter of the parmesan.", "Repeat the process to create a further two layers. Finish with a final layer of lasagne sheets and the remaining béchamel, making sure that all the lasagne sheets are completely covered. Sprinkle over the remaining parmesan.", "Drizzle with a little extra virgin olive oil, put onto a baking tray and place in the preheated oven to bake for 30-40 minutes, or until golden-brown and bubbling. Serve in hearty wedges with a crisp green salad."]}, {"isVegetarian": false, "title": "Lasagne", "url": "www_bbc_co_uk_food_recipes_lasagne_82381", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lasagne_82381_16x9.jpg", "ingredients": ["4 tbsp olive oil", "4 celery sticks, finely chopped", "2 carrots, finely chopped", "1 medium onion, finely chopped", "2 garlic cloves, peeled and crushed", "1 sprig rosemary", "700g/1lb 9oz beef mince", "340g/12oz pork mince", "1 bottle red wine (750ml/26½fl oz)", "2 x 400g/14oz cans tomatoes, roughly chopped", "200ml/7fl oz beef stock", "salt and freshly ground black pepper", "1 litre/1¾ pints whole milk", "2 bay leaves", "¼ onion", "pinch freshly grated nutmeg", "50g/2oz butter", "50g/2oz plain flour", "14 sheets fresh lasagne pasta ", "3 125g/4½oz balls mozzarella, cut into small cubes", "small handful grated parmesan", "freshly ground black pepper ", "2 tbsp butter"], "serves": "6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the ragu, heat the olive oil in a frying pan over a low heat and fry the celery, carrots and onion for approximately 15 minutes, until softened and golden. Add the garlic and rosemary and fry for two more minutes.", "Add the beef and pork mince and cook until the liquid from the meat has been absorbed. ", "Pour in approximately 400ml/14fl oz of red wine and stir well. Cook for approximately 45 minutes.", "Once the wine has evaporated, add the tomatoes and stock. Leave the mixture uncovered to cook slowly for two hours. Top up with more warm stock if necessary. Season with salt and freshly ground black pepper to taste.", "To make the bechamel sauce, place the milk in a large non-stick saucepan, add the bay leaves, onion and nutmeg and gently bring to the boil. ", "In a separate saucepan melt the butter and add the flour. Beat well and cook for two minutes. Remove the milk from the heat and add a little to the flour mixture. Combine well, and when all the milk has been absorbed, add a little more. Continue to do this until all the milk has been added, whisking continually. ", "For the lasagne, blanch the pasta in salted boiling water for three minutes. Spoon a third of the bechamel sauce into the bottom of a lasagne dish in a layer, then place some of the pasta strips over the top. Follow this with some of the mozzarella and parmesan, and sprinkle over freshly ground black pepper. Follow with a layer of ragu. Repeat this step twice until all the ingredients have been used up. Dot knobs of butter over the surface and cook in the oven for 30 minutes, or until golden-brown on top and completely cooked through."]}, {"isVegetarian": false, "title": "Lasagne", "url": "www_bbc_co_uk_food_recipes_lasagne_40419", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "250g/9oz beef mince ", "1 onion, diced ", "3 carrots, grated ", "75g/2½oz butter ", "75g/2½oz plain flour ", "1 tsp English mustard ", "750ml/1⅓ pint milk ", "2 garlic cloves, crushed ", "2 x 400g/14oz tin tomatoes ", "250g/9oz lasagne sheets ", "salt and pepper  "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6", "Heat a large frying pan over a medium heat and add the olive oil. Once hot, add the mince along with a good pinch of salt and pepper. Brown the mince for 5-6 minutes until coloured all over and beginning to crisp. Remove the mince from the pan and set to one side.", "Add the onion and carrot to the frying pan along with a pinch of salt. Cook gently for 10 minutes, or until everything is softened.", "Meanwhile, melt the butter in a saucepan over a medium heat. Once melted, add the flour and mustard, stir to mix well. Leave to cook over a medium heat for two minutes, or until the mixture makes a paste. ", "Pour the milk in batches into the saucepan, whisking as you add to create a smooth white sauce. Once all the milk is added season with a pinch of salt and black pepper, turn the heat down and leave to simmer very gently for seven minutes.", "Once the onions and carrots are softened, add the garlic to the frying pan and cook for two minutes. Return the meat (plus any juices) to the pan and add the tomatoes. Mix everything together, cover with a lid and simmer the sauce for 10 minutes until thickened slightly.", "To assemble the lasagne, place a quarter of the tomato sauce into the bottom of a small/medium baking dish. Top with a layer of lasagne sheets. Spoon over another quarter of the tomato sauce and top with a third of the white sauce. Repeat this twice more, finishing at the top with the last layer of white sauce. (You should have three sets of layers of lasagne, tomato and white sauce, all on a bed of tomato sauce.)", "Place into the preheated oven and bake for 30 minutes or until bubbling and the top is golden-brown. Serve the lasagne in slices while hot."]}, {"isVegetarian": false, "title": "Lasagne", "url": "www_bbc_co_uk_food_recipes_lasagne_99783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints full-fat milk ", "75g/3oz unsalted butter", "125g/4½oz 00 flour", "1 bay leaf", "125g/4½oz grated parmesan cheese", "2 free-range eggs yolks", "110g/4oz unsalted butter", "2 tbsp chopped celery", "2 tbsp chopped carrots", "2 tbsp chopped red onion", "110g/4oz smoked pancetta", "1 sprig fresh rosemary, leaves picked, chopped", "1 kg/2lb 2oz trimmed veal or beef flank, finely chopped", "50g/2oz prosciutto, roughly chopped", "1 x 400g/14oz good-quality chopped tomatoes", "125ml/4½fl oz white wine", "110ml/4fl oz full-fat milk", "1 x 250g/9oz pack fresh lasagne sheets", "olive oil, for greasing", "large handful grated parmesan"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the béchamel pour the milk into a saucepan and bring to a simmer, turn off the heat and set aside.", "In a heavy saucepan, melt the butter, then whisk in the flour and hot milk. Whisk rigorously until smooth. Add the bay leaf, cover with a circle of greaseproof paper and cook slowly for 30-40 minutes. Remove the paper and bay leaf and season with salt and freshly ground black pepper. Stir in the parmesan and egg yolks and set aside to cool. ", "For the ragu, melt the butter in a large casserole dish until foaming. Add the celery, carrots, onion, pancetta and rosemary and fry for five minutes. Stir in the veal and prosciutto and cook for a further five minutes.", "Add the tomatoes, white wine and milk and bring to the boil. Reduce the heat and cook slowly for 1½ hours - the meat should be broken down into small pieces and the sauce should have a rich thick consistency.", "Preheat the oven to 170C/325F/Gas 3", "Blanch the pasta sheets in boiling salted water for one minute, then refresh in cold water.", "Rub olive oil into the sides of a baking dish. Place a layer of pasta onto the base of the dish and then add an even layer of beef ragu, followed by a layer of béchamel sauce. Repeat this process until you have used all the pasta and finish with a thick layer of béchamel on top. Sprinkle the top with a generous layer of parmesan cheese. ", "Bake in the oven for 40-45 minutes, or until bubbling and pale golden-brown on top.", "Cut the lasagne into squares and serve."]}, {"isVegetarian": true, "title": "Latvian salad", "url": "www_bbc_co_uk_food_recipes_latvian_salad_50575", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/latvian_salad_50575_16x9.jpg", "ingredients": ["100g/3½oz barley, rinsed", "1 tbsp olive oil", "2 large handfuls dark salad leaves including spinach", "200g/7oz green beans, topped and tailed", "4 radishes, sliced", "2 cooked beetroot, diced", "small bunch of dill, leaves only", "small bunch of parsley, leaves only", "small bunch of mint, leaves only", "100g/3½oz crumbly Latvian cheese or feta", "50g/2oz walnuts, lightly toasted", "100ml/3½fl oz buttermilk", "1 tbsp sour cream", "1 tbsp lemon juice or wine vinegar", "½ garlic clove, crushed or finely chopped", "1 tsp honey", "salt and freshly ground black pepper", "1 pomegranate, seeds only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the barley in a saucepan, cover with cold water. Season with salt and bring to the boil. Simmer for around 30 minutes until the barley is just cooked through – it should still have a bite. Drain, drizzle with the olive oil and leave to cool.", "Bring a pot of water to the boil and blanch the green beans for a couple of minutes. Drain and place in a bowl of cold water. ", "For the dressing, whisk the ingredients together and season with salt and pepper. ", "Arrange the salad leaves on a large platter. Add the beans, radishes and beetroot, then sprinkle over the herbs, barley, cheese and walnuts, tossing very slightly to combine well.", "Drizzle over the salad dressing, garnish with the pomegranate seeds and serve. "]}, {"isVegetarian": false, "title": "Last minute Christmas chutney", "url": "www_bbc_co_uk_food_recipes_last_minute_christmas_08523", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/last_minute_christmas_08523_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "2 red onions, sliced", "2 garlic cloves, finely chopped", "2 tsp finely chopped fresh root ginger (or stem ginger in syrup, drained and finely chopped)", "200g/7oz ready to eat dried apricots, quartered", "150g/5½oz soft dried figs, quartered ", "100g/3½oz raisins  ", "150g/5½oz demerara sugar", "150ml/5fl oz white wine vinegar", "¼ whole nutmeg, finely grated", "1 cinnamon stick", "1 tsp sea salt flakes", "freshly ground black pepper"], "serves": "Makes 1-2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-reactive saucepan and fry the onions over a low heat for 10 minutes, or until very soft but not coloured.", "Add the garlic and ginger, and cook for a further 2-3 minutes.", "Increase the heat slightly and fry for a further 4-5 minutes, until the onions begin to brown, stirring constantly.", "Add the apricots, figs and raisins to the pan and cook for 2-3 minutes, or until the dried fruit begins to plump up a little.  ", "Sprinkle over the sugar, add the vinegar, spices and season to taste with salt and freshly ground black pepper.", "Stir well and bring to a gentle simmer, and cook, uncovered, for 30 minutes, stirring occasionally.  (The chutney is more likely to stick towards the end of the cooking time so pay particular attention to stirring then.)", "The chutney is ready when the liquid has reduced to just 4-5 tablespoons, and the fruit looks plump and glossy.  Remove from the heat and set aside to cool.  As the chutney cools stir it a little to distribute the moisture.", "Spoon the chutney into sterilised jars."]}, {"isVegetarian": true, "title": "Latvian Christmas yellow bread", "url": "www_bbc_co_uk_food_recipes_latvianchristmasyell_9353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/15fl oz full fat milk", "675g/1¼lb plain flour", "pinch of salt", "75g/3oz unsalted butter", "75g/3oz caster sugar", "80g/3¼oz sultanas", "2 sachets of dried yeast", "5g/¼oz saffron, ground", "2 medium eggs", "fine zest of ½ lemon", "50g/2oz nibbed or chopped almonds", "beaten egg yolks to glaze", "cardamom, freshly ground", "icing sugar to dredge"], "serves": "Makes 1 loaf", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Bring milk and butter to room temperature. ", "Dissolve the yeast in half of the milk with 5g/1 tsp of the weighed sugar, leave in a warm place to foam (should take about 15 minutes).", "Beat in the remaining ingredients except the flour and the almonds.", "Mix in the flour till you have a smooth and elastic dough. Cover well with plastic film and place in fridge overnight.", "Remove from the fridge and divide the dough into three. Knock back, on a lightly floured board, and roll into even lengths, a few feet long.", "Plait the dough and pinch the ends to seal. Form into a ring and place on baking parchment on a tray, cover lightly with plastic film and prove till double in size.", "Brush with the beaten yolk (let down with a little milk), then scatter over the almonds and a good pinch of the ground cardamom.", "Place in the oven which has been preheated to 190C/375F/Gas 5 and bake for about 30 minutes till golden. When the base is tapped and sounds hollow, the loaf is done.", "Remove from the oven and dredge generously with the icing sugar."]}, {"isVegetarian": true, "title": "Lavender and apple tarte tatin", "url": "www_bbc_co_uk_food_recipes_lavender_and_apple_tarte_90753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["335g/11¾oz plain flour", "65g/2¼oz unsalted butter, chilled", "10g/¼oz salt", "10g/¼oz white wine vinegar, cold", "250g/9oz butter, chilled", "200g/7oz golden caster sugar", "2 tsp dried lavender flowers (available in the spice section of large supermarkets)", "8 apples (preferably Russet or Braeburn), peeled and cored ", "1 lemon, juice only", "50g/1¾oz unsalted butter", "pinch salt", "clotted cream, to serve"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, rub the 65g/2¼oz butter into the flour and salt with your fingertips until it resembles breadcrumbs. In a separate bowl lightly mix the vinegar with 150g/5½oz water then add this to the dry mix and combine to make a dough. Transfer to the freezer for 10 minutes.", "While the dough is chilling in the freezer, flatten the remaining 250g/9oz butter by placing it between two sheets of greaseproof paper and using a rolling pin to squash it into a square shape less than 1cm/½in thick.", "Roll out the chilled pastry dough to form a rectangle twice the size of the flattened butter square. Fold the pastry over the butter, then turn it 90 degrees and roll it out until it has doubled in length. Fold both ends into the middle, then fold once more (to ‘close the book’). Transfer to the fridge for 20 minutes.", "For the topping, mix the lavender with the caster sugar to infuse. Take four of the apples, slice them into wedges and set aside. Cut the remaining apples into halves and place them on a cooling rack. Transfer to the fridge to oxidise slightly. ", "For the pastry, repeat the rolling and folding process another three times and return to the fridge. ", "Preheat the oven to 200C/400F/Gas 6.", "For the topping, add the lavender sugar, 20g/¾oz water and lemon juice to a heavy oven-proof frying pan and heat until the sugar has dissolved and a light caramel has formed. Remove from heat, add the butter and salt and swirl the pan occasionally until combined (don’t stir as this can make the caramel crystalise). ", "Place the halved apples in the centre of the pan, cut side down. Arrange the apples wedges around the halves and return the pan to a low heat for five minutes, then set aside to cool slightly.", "For the pastry, repeat the rolling and folding process one more time, then carefully roll it out to fit the pan. Place the pastry on top of the pan, trim any excess - leaving a small overhang to tuck down the inside of the pan. ", "Bake for 30 minutes, or until the pastry is golden and crisp. Remove the tarte tatin from the oven and turn out onto a plate (take care with this as the caramel will still be very hot) and allow to cool for five minutes before serving with a spoonful of clotted cream."]}, {"isVegetarian": false, "title": "Make and freeze lasagne", "url": "www_bbc_co_uk_food_recipes_lasagne_95631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz ‘00’ pasta flour, plus extra flour for dusting", "10 free-range eggs", "about 5 tbsp olive oil", "6 onions, very finely chopped", "8 carrots, very finely chopped", "8 garlic cloves, roughly chopped", "2kg/4lb 8oz beef mince", "1kg/2lb 4oz pork ribs", "2 litres/3½ pints beef stock", "4 x 400g/14oz tins chopped tomatoes", "handful fresh oregano", "few bay leaves", "1 litre/1¾ pints double cream", "300g/10½oz cheddar, grated", "2 tbsp English mustard", "50g/1¾oz basil leaves", "400ml/14fl oz olive oil", "300g/10½oz breadcrumbs "], "serves": "Makes 20 portions", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, put the flour into a large mixing bowl, make a well in the middle and crack the eggs into it. Bring together with a wooden spoon until it combines into one mass.", "Knead on a floured surface for a good ten minutes, or until the dough is smooth and glossy all over and there are no dry or damp patches.", "Cut a piece of dough off, roughly the size of an egg and keep the remaining dough under a slightly damp cloth.", "Feed the piece of dough through a pasta machine on the largest setting. There are nine settings going from thick to very fine, so repeat the process nine times gradually decreasing the setting. Hang the sheets of pasta – a clothes horse works well for this.", "Repeat this process until you have converted all your dough into sheets", "Leave to dry for two hours – the sheets will be firm but slightly bendy.", "Use the base of the foil trays as a template and cut the pasta into rectangles to fit the tray. You should cut about 60 in total.", "For the ragù, heat five tablespoons of olive oil in a large frying pan over a moderate heat.", "Fry the onions, carrots and garlic until golden-brown and then transfer to a large stock pot.", "In the same pan, brown the mince in batches adding the browned meat to the pot as you go.", "Cut the ribs into manageable sizes and then brown them in the pan with a little more oil if necessary. Transfer the ribs to the pot.", "Deglaze the pan with a little beef stock and add to the pot.", "Finally add the tinned tomatoes, the remaining stock and the oregano and bay leaves.", "Bring to the boil and then simmer for two hours", "Slide the meat easily off the rib bones with set of tongs and a fork. Discard the bones.", "For the cheese sauce, put the double cream, mustard and 200g/7oz of grated cheddar in a pan. Allow to melt for five minutes on a low heat, stirring occasionally.", "For the basil oil, process the oil and the basil in a food processor and reserve.", "To assemble the lasagne, place a small ladleful of the ragù (about three heaped tablespoons) into the base of each foil tray. Place a sheet of pasta on top. Brush the pasta sheet with basil oil.", "Add another ladleful of ragù and a second pasta sheet and brush again with oil. Add a third ladleful of ragù and place one more pasta sheet on top.", "Pour over a ladleful of cheese sauce.", "Scatter over a small handful of the remaining grated cheese, then a small handful of breadcrumbs. Finish with a little drizzle of basil oil.", "To cook straightaway, preheat the oven to 180C/350F/Gas 4 and cook for 25 minutes.", "To prepare the lasagne for freezing, allow to cool, cover each portion with the lid and then freeze. They will keep for up to one month.", "To cook from frozen, preheat the oven to 180C/350F/Gas 4, but cook for one hour."]}, {"isVegetarian": true, "title": "Lavender and sunflower seed brittle", "url": "www_bbc_co_uk_food_recipes_lavender_and_sunflower_27355", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/2¾oz sunflower seeds", "splash light soy sauce", "115g/4oz unsalted butter", "225g/8oz granulated sugar", "100g/3½oz light brown sugar", "pinch salt", "1-2 tsp lavender flowers, finely chopped"], "serves": "Makes 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over a low heat. Add the sunflower seeds and dry fry for 1-2 minutes, or until toasted. Stir in the soy sauce and cook until evaporated. Remove the seeds and set aside.", "Heat the butter, sugars, salt and 2 tablespoons water in a saucepan over a low heat until the butter has melted and the sugar has dissolved. ", "Bring the mixture to the boil, then reduce the heat to moderate and continue to cook until the temperature reaches 150C. Remove the pan from the heat and stir in the lavender flowers, then set aside to cool slightly.", "Pour the brittle mixture into silicone ice-cube trays, then sprinkle over the sunflower seeds. Set aside to harden, then remove from the moulds and serve."]}, {"isVegetarian": true, "title": "Lavender and tea shortbread biscuits", "url": "www_bbc_co_uk_food_recipes_lavender_and_tea_43954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter", "100g/3½oz caster sugar", "250g/9oz plain flour, plus extra for dusting", "40g/1½oz ground rice", "pinch salt", "1½ tsp dried lavender, ground (ensure it has been produced specifically for eating)", "2 Lady Grey teabags, leaves only (or 1 tsp tea leaves, ground)"], "serves": "Makes 18 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "In a mixing bowl, cream the butter with a handheld electric mixer until soft and creamy.  Add the sugar in a bit at a time until well mixed.", "Sift the flour, ground rice and salt into another bowl. Stir the lavender and Lady Grey tea leaves into the flour mixture. ", "Lightly work the lavender flour into the creamed butter with fingers until the dough just comes together. ", "Shape the dough into a ball and cover with clingfilm. Set aside in the fridge for 15 minutes. ", "When the dough is chilled, remove the clingfilm and and roll out onto a floured surface to a thickness of approximately ¾cm/¼in. Cut out heart-shaped biscuits with a cutter.", "Place the biscuits onto a baking tray and place in the fridge for 30 minutes.", "Bake the biscuits in the oven for 20 minutes or until a very pale gold colour. Allow to cool on the tray for ten minutes before transferring to a wire rack to cool completely."]}, {"isVegetarian": true, "title": "Lavender crème caramel with lavender shortbread", "url": "www_bbc_co_uk_food_recipes_lavender_crme_caramel_96589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lavender_crme_caramel_96589_16x9.jpg", "ingredients": ["225g/8oz caster sugar", "150ml/5fl oz full-fat milk", "300ml/10fl oz double cream", "½-1 tbsp dried lavender tips (to taste)", "4 free-range eggs, lightly beaten", "175g/6oz unsalted butter, softened, plus extra for greasing", "100g/3½oz icing sugar", "½-1 tbsp dried lavender tips (to taste)", "100g/3½oz cornflour", "200g/7oz plain flour", "2 tbsp caster sugar (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place six ramekins (7.5cm/3in wide and 4cm/1½in deep) in a deep-sided roasting tray. Preheat the oven to 150C/130C Fan/Gas 2.", "Put 150g/5½oz of the caster sugar in a clean, heavy-based saucepan and heat over a high heat without stirring until the sugar melts and a golden-brown caramel forms. If you need to move the mixture to prevent it from burning, swirl the pan from time to time instead of stirring. (Caution: Melted sugar is very hot. Take care when cooking with it.)", "Remove the pan from the heat and carefully add two tablespoons of recently boiled water to the caramel - it will spit and splutter a little, so keep your face at a safe distance from the pan. Swirl the pan until the sugar and water have combined to form a runnier caramel, then pour a little into the bottom of each ramekin, tipping them each this way and that until the caramel has evenly coated the base and sides. Set aside.", "Heat the milk, cream and lavender in a separate saucepan over a low heat until just simmering. ", "Meanwhile, whisk the eggs and the remaining 75g/2¾oz sugar in a bowl until pale and fluffy. ", "Pour the hot milk mixture onto the egg mixture, whisking continuously until smooth. Strain the mixture into a jug through a fine sieve, then pour the strained mixture into the ramekins.", "Add enough boiling water to the roasting tray to reach two-thirds of the way up the sides of the ramekins. Carefully transfer the roasting tray to the oven and bake the crème caramels for 40-45 minutes, or until just set. Remove from the oven and set aside in the roasting tray until cooled to room temperature. ", "When the ramekins are cool enough to handle, remove from the roasting tray and chill in the fridge for at least an hour.", "For the shortbread, increase the oven temperature to 180C/160C Fan/Gas 4. Grease a 30x20cm/12x8in baking tin with butter.", "Beat the butter and icing sugar in a bowl until light and fluffy, using an electric whisk. Fold in the lavender, cornflour and plain flour until the mixture comes together as a firm dough. ", "Press the dough into the prepared baking tin using your fingertips to form an even layer of dough about 1cm/½in thick. Prick the dough all over with a fork and sprinkle with the caster sugar, if using.", "Bake the shortbread in the oven for 12-15 minutes, or until pale golden-brown and cooked through. Set aside to cool in the tin for a little while, then break into pieces.", "To serve, remove the crème caramels from the ramekins by running a knife around the inside of each, then pressing the knife gently into one side of the crème caramels, and inverting the ramekins onto upturned serving plates. Serve with pieces of the shortbread alongside."]}, {"isVegetarian": true, "title": "Lavender shortbread hearts", "url": "www_bbc_co_uk_food_recipes_lavender_shortbread_43952", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lavender_shortbread_43952_16x9.jpg", "ingredients": ["125g/4½oz lavender caster sugar, plus extra for sprinkling (see Top recipe tip below)", "225g/8oz unsalted butter, softened ", "300g/10½oz plain flour, plus extra for dusting", "50g/1¾oz ground rice"], "serves": "Makes 15", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Line two large baking trays with baking paper.", "Sieve the sugar into a bowl and reserve the lavender (this stops the lavender seeds getting broken when creaming the butter and sugar).  Add the butter and cream the sugar and butter together.", "Sift the flour and ground rice into the mixture, add the reserved lavender seeds and mix with a wooden spoon until the mixture resembles breadcrumbs.", "Using floured hands, work the mixture together to form a smooth paste. ", "Tip onto a lightly floured work surface and knead gently until the dough is smooth. Chill the dough in the fridge for 15 minutes.", "Roll the dough out to a 5mm/¼in thickness, and cut out biscuits using a heart-shaped cutter. Place the hearts onto the baking trays, and sprinkle with a little extra lavender sugar. ", "Leave to chill for a further 30 minutes in the fridge.", "Meanwhile, preheat the oven to 180C/ 350F/Gas 4. ", "Bake for 15-20 minutes, or until pale golden-brown. Carefully place the biscuits onto a cooling rack., sprinkle with extra lavender sugar and set aside to cool completely."]}, {"isVegetarian": true, "title": "Lavender and white chocolate ice cream with lavender custard and hot chocolate fondant", "url": "www_bbc_co_uk_food_recipes_lavenderandwhitechoc_85602", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 free-range egg yolks", "200g/7oz caster sugar", "600ml/1pint 1fl oz full fat milk", "2 tsp lavender flowers, crumbled", "600ml/1pint 1fl oz double cream", "250g/9oz white chocolate, roughly chopped", "175g/6oz dark chocolate (at least 70 per cent cocoa solids)", "110g/4oz softened butter", "40g/1½oz ground almonds", "2 large free-range eggs, separated", "40g/1½oz cornflour", "90g/3½oz caster sugar", "4 good quality dark chocolate truffles", "cocoa powder, for dusting"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the ice cream, place the egg yolks and sugar in a bowl and whisk together until combined.", "Place the milk and lavender into a pan and bring to the boil.", "Pour the boiling milk onto the egg yolks and whisk well, then pour back into the pan and return to the heat.", "Add the cream and continue to cook until the mixture has thickened, but do not allow to boil.", "Place the white chocolate into a large heatproof bowl. Pour three quarters of the lavender custard mixture through a sieve onto the white chocolate and stir well. Allow the mixture to cool, then place into an ice cream machine to churn to ice cream.", "Place the remaining quarter of the custard into a clean bowl and transfer to the fridge to chill.", "For the fondant, preheat the oven to 180C/355F/Gas 4.", "Grate 40g/1½oz of the dark chocolate into a bowl and set aside.", "Melt half of the butter and brush liberally around the inside of four ramekins. Dust the ramekins well with the grated chocolate, shaking out any excess, then place onto a baking sheet and set aside.", "Place the remaining chocolate, including any shaken out excess, and the remaining butter into a heatproof bowl and place over a pan of barely simmering water to melt.", "Add the ground almonds, egg yolks and cornflour to the melted chocolate and stir well.", "In a separate bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Gradually add the caster sugar, whisking constantly.", "Gently fold the egg white mixture into the melted chocolate mixture, taking care to retain volume in the whites. ", "Spoon half the chocolate and egg mixture into the base of each prepared ramekin. Place a chocolate truffle on top, then fill each ramekin with the remaining mixture.", "Smooth the tops of the fondants with a palette knife, then transfer to the oven to bake for 10-15 minutes, until risen (the surface should be slightly wobbly), then remove from the oven and serve immediately.", "To serve, strain the reserved, chilled custard mixture and place a spoonful onto the centre of each of four plates. Turn out the chocolate fondants and place into the centre of the sauce. Dust the top of the fondant with the cocoa powder and place a spoonful of lavender ice cream alongside."]}, {"isVegetarian": true, "title": "Lavender cream meringues", "url": "www_bbc_co_uk_food_recipes_lavendercreammeringu_91783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lavendercreammeringu_91783_16x9.jpg", "ingredients": ["3-4 fresh unsprayed lavender stems, flowers only", "2 large free-range egg whites", "100g/3½oz caster sugar", "1-2 drops of red food colouring, mixed with 1-2 drops of blue food colouring (optional)", "150ml/5fl oz double cream", "½ tbsp icing sugar"], "serves": "Makes 16", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 130C/250F/Gas ½. Line a large baking tray with baking paper. ", "Grind the lavender flowers in a mortar and pestle for 1-2 minutes, or until fragrant. ", "In a large bowl, whisk the egg whites using an electric whisk until stiff peaks form when the whisk is removed. ", "Gradually whisk in the caster sugar, a tablespoonful at a time, until all of the caster sugar has been incorporated into the mixture and the mixture is thick and glossy. ", "Sprinkle one tablespoonful of the ground lavender flowers over the egg white mixture and whisk until combined. ", "Dip a cocktail stick into the food colouring mixture and shake off a drop of food colouring into the egg white mixture. Whisk well, adding more food colouring until the egg whites are a uniform pale mauve colour. (NB: You may not need all of the food colouring.) ", "Spoon the meringue mixture into a piping bag fitted with a large plain nozzle. Pipe 32 small swirls of the meringue mixture onto the prepared baking tray. ", "Transfer the meringues to the oven and immediately reduce the temperature to 100C/225F/Gas ¼. Bake the meringues for two hours, or until crisp but not coloured. Turn off the oven and leave the meringues inside until the oven is cool. When the meringues have cooled, store them in an airtight tin until needed.", "No more than 30 minutes before serving, pour the cream into a mixing bowl and sift over the icing sugar. Whip using an electric whisk until soft peaks form when the whisk is removed.", "Place a teaspoonful of the cream mixture onto the base of one of the lavender meringues, then sandwich the cream between a second meringue. Place onto a large serving plate. Repeat the process with the remaining meringues, then serve immediately."]}, {"isVegetarian": false, "title": "Lavender, garlic and honey roast loin of lamb with mint sauce", "url": "www_bbc_co_uk_food_recipes_lavendergarlicandhon_81883", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lamb boneless loin fillets", "2 cloves garlic", "2 x 75g/3oz cans of anchovy fillets in olive oil", "bunch lavender, freshly picked", "salt and freshly ground black pepper", "2 tsp lavender honey (or other runny honey if unavailable)", "50ml/2fl oz/3½tbsp lavender honey (or other runny honey if unavailable)", "50ml/2fl oz/3½tbsp olive oil ", "450g/1lb new potatoes, washed, skins left on, cut into chunky slices", "453g/1lb parsnips, washed, skins left on, cut into chunky slices", "453g/1lb carrots, washed, skins left on, cut into chunky slices", "225g/8oz red onions, quartered", "225g/8oz fennel, thickly sliced", "1 lemon, cut in half", "2 sprigs rosemary", "3 tbsp olive oil", "75ml/3fl oz clear honey", "10 tbsp fresh mint, finely chopped ", "pinch salt ", "pinch sugar ", "90ml/3¼fl oz malt vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 5.", "For the lamb, use a sharp knife to make about 20 small incisions, about 2cm (1in) deep, in each loin of lamb.", "Peel the garlic cloves and cut into thin strips. Insert a slither of garlic, half an anchovy fillet and a sprig of lavender into each incision until they are all filled.", "Place the lamb in a roasting tray, season with salt and freshly ground black pepper and drizzle with the lavender honey. Roast in the oven for 20-30 minutes, or until cooked to your liking, basting with the juices every few minutes to keep the meat moist and prevent the honey from burning. Remove for the oven and leave to rest for ten minutes before serving.", "For the lavender honey glaze, warm the honey in a small pan. Add the olive oil and whisk to combine.", "For the roasted vegetables, place all the vegetables into an oven tray with the lemon halves and drizzle with the olive oil and honey. Add the sprigs of fresh rosemary and season well.", "Place in the oven and cook for about 20-40 minutes, or until the vegetables are cooked. Stir well to coat in the honey glaze.", "For the mint sauce, mix all the ingredients together.", "To serve, slice the lamb on the diagonal and serve on warm plates with a spoonful of roasted vegetables, a drizzle of honey glaze and a spoon of mint sauce."]}, {"isVegetarian": false, "title": "Laverbread cakes", "url": "www_bbc_co_uk_food_recipes_laverbread_cakes_82849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp laverbread", "4 tbsp rolled oats", "2 tsp olive oil", "8 thin rashers streaky bacon"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a small bowl, mix the laverbread and oats together. Divide the mixture into 8 peices and roll into small balls. Flatten the balls into small patties, roughly 4cm/1½ in diameter.", "Heat the olive oil in a large pan over a medium heat. Fry the bacon until crispy and the fat has rendered. Remove from the pan with a slotted spoon and drain on kitchen paper. ", "Add the cakes to the pan and fry on each side for 2–3 minutes, or until golden brown.", "Serve the laverbread cakes with the crispy bacon on top."]}, {"isVegetarian": false, "title": "Kohlrabi soup", "url": "www_bbc_co_uk_food_recipes_laxa_82664", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 salad onions, finely sliced", "1 garlic clove, finely chopped", "½ red chilli, finely chopped", "1 kohlrabi, peeled and diced", "1 tbsp soy sauce", "1 tbsp sesame oil", "1 tsp ginger, finely chopped", "200ml/7fl oz chicken stock, heated (vegetarians can substitute vegetable stock)", "salt and freshly ground black pepper", "1 tbsp chopped fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small saucepan. Fry the salad onions with the garlic and chilli until soft.", "Add the diced kohlrabi and cook until soft. ", "Add the soy, sesame oil, ginger and chicken stock and season with salt and freshly ground black pepper, to taste. Simmer for eight minutes. ", "To serve, stir through the chopped coriander and serve in a warm bowl."]}, {"isVegetarian": false, "title": "Layered beef and mushroom suet pudding", "url": "www_bbc_co_uk_food_recipes_layered_beef_and_36022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower oil", "2 medium onions, chopped ", "200g/7oz button mushrooms, wiped and sliced", "4 tbsp plain flour", "1 tsp flaked sea salt", "2 tsp dried mixed herbs", "750g/1lb 10oz well-marbled braising steak, such as chuck and blade", "1 bay leaf", "440ml/15½fl oz stout", "300ml/10fl oz beef stock, made with 1 stock cube", "2 tbsp tomato purée", "2 tsp caster sugar", "freshly ground black pepper", "325g/11½oz self-raising flour", "150g/5½oz shredded suet", "25g/1oz bunch fresh parsley, tough stalks removed and leaves finely chopped", "1 tsp fine sea salt", "knob of butter, for greasing"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "To make the filling, heat the oil in a large flameproof casserole dish. Fry the onions and mushrooms over a medium heat for about five minutes, or until lightly browned, stirring regularly. ", "Put the flour, salt and dried herbs in a large bowl. Season with lots of freshly ground black pepper and mix well. Trim the beef of any hard fat and sinew. Cut the beef into roughly 2.5cm/1in cubes. Toss the meat in the flour until coated evenly all over.  Tip the beef and all the flour into the pan with the onions and mushrooms. Fry for 3-5 minutes.", "Add the bay leaf, stout, stock, tomato purée and sugar. Stir well and bring to the boil. Cover with a lid and carefully transfer to the oven. Cook for 2¼ hours, or until the beef is very tender, stirring halfway through the cooking time. If the beef remains a little tough, return to the oven and cook for longer.", "Take five ladlefuls (around 450ml/16fl oz) of the sauce and set aside in a small saucepan to use for gravy later. (When cooled, put in the fridge until needed.) Return the pan to the hob and simmer for 2-3 minutes, or until the sauce is thickened enough not to run out over the plate when the pudding is cut, but not too thick or the pudding will taste dry. ", "Remove from the heat, tip into a large mixing bowl, discard the bay leaf and leave to cool completely.", "To make the suet pastry, put the flour in a large bowl and stir in the suet, parsley and salt. Stir in enough water to make a soft, spongy dough - you'll probably need around 250ml/9fl oz. Turn out onto a floured surface and bring the dough together to form a ball. Knead lightly, then use scales to divide the dough into four portions of about 100g/3½oz, 150g/5½oz, 200g/7oz and 275g/9¾oz.  ", "Butter a 1.5 litre/2½ pint pudding basin and line the base with a small disc of baking parchment – this will make the pudding easier to remove once cooked. Roll out the smallest portion of pastry into a disc roughly 1.5cm/½in thick. Place in the base of the pudding basin. Cover with a layer of the beef and mushroom mixture. Roll the 150g/5½oz portion into a disc large enough to cover the beef and press gently on top, making sure it reaches the sides. Repeat the same process with the remaining pastry and filling until the basin is layered with four discs of pastry and three layers of beef, ending with the final layer of pastry, trimmed neatly to fit if necessary.", "Cover the dish with a large circle of baking parchment, with a pleat in the middle to allow for expansion. Cover the parchment with a circle of foil, again with a pleat. Tie both tightly in place with string. Create a carrying handle by tying the excess string across the top of the basin - this will help you lift the pudding once it's cooked.", "Place on an upturned saucer or small trivet in a large, deep saucepan and add enough just-boiled water to come halfway up the sides of the basin. (Alternatively, cook in a large hob-top steamer.) Cover the pan with a tight-fitting lid and place over a medium heat. Allow to steam in simmering water for two hours, adding more water when necessary.", "When the pudding is done, turn off the heat and carefully lift the basin from the water. Stand for five minutes. Heat the reserved sauce until bubbling, stirring constantly and adding a little extra water if needed.", "Cut the string, and peel the foil and paper off the basin. Loosen the sides of the pudding right down to the bottom with a blunt-ended knife and, holding with an oven-cloth, invert onto a deep plate. Peel off the lining disc. Pour a little of the gravy over the top and then serve in generous wedges with more hot gravy."]}, {"isVegetarian": false, "title": "Layered sole with langoustines and cauliflower", "url": "www_bbc_co_uk_food_recipes_layered_sole_with_06011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 whole lemon sole, filleted, skin removed ", "275ml/9¾fl oz double cream", "1 cauliflower, cut in half, one half left intact, one half separated into small florets", "1 free-range hard-boiled egg, peeled", "1 tbsp finely chopped fresh chives", "1 tbsp white balsamic vinegar", "3 tbsp extra virgin olive oil", "8 cooked langoustines ", "salt and freshly ground black pepper", "fennel fronds, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Blend four of the pieces of lemon sole and all of the offcuts in a food processor with 75ml/2¾fl oz of the cream, until the mixture has been reduced to a fine paste. Season with salt and freshly ground black pepper and pulse once more until smooth, then transfer the mixture to a piping bag.", "Lay 4 pieces of the lemon sole onto separate sheets of aluminium foil and season all over with salt and freshly ground black pepper.", "Pipe a layer of the fish and cream mixture all over each piece of lemon sole. Top each with another piece of lemon sole and top that with another layer of the fish and cream mixture. Finish each with a third piece of lemon sole. You should end up with four stacks of fish, each containing 3 rectangles of lemon sole and 2 layers of filling.", "Wrap each lemon sole stack in its sheet of foil, then chill in the fridge until ready to cook. ", "Meanwhile, add half of the cauliflower florets to a saucepan and pour over the remaining cream. Bring to the boil, then reduce the heat and simmer for 4-5 minutes, or until the cauliflower florets are tender. ", "Transfer the cauliflower and cream to a clean food processor and blend to a fine purée. Season, to taste, with salt and freshly ground black pepper. Set aside until needed.", "Bring a pan of salted water to the boil and cook the remaining cauliflower florets for 2-3 minutes, or until just tender. Drain well.", "Finely grate the remaining raw cauliflower into a bowl, then grate over the boiled egg and stir in the chives until well combined.", "In a separate bowl, whisk the white balsamic vinegar and olive oil together until well combined. Set aside.", "Suspend a steamer over a pan of simmering water. Add the sole parcels to the steaming basket, cover and steam for 6-8 minutes, or until just cooked through. Remove from the steamer and, when cool enough to handle, carefully unwrap and discard the foil,", "Just before serving, spoon two-thirds of the dressing over the cauliflower and egg salad and mix to coat. Season with salt and freshly ground black pepper. ", "Mix the remaining dressing with the drained cauliflower florets and cooked langoustines and stir gently to coat.", "To serve, drizzle a line of the cauliflower and cream purée across the centre of each plate. Place one lemon sole stack on top of each line, in the centre. Spoon a portion of the cauliflower and egg mixture on one side, and the cauliflower and langoustines on the other side. Garnish with fennel fronds, if desired."]}, {"isVegetarian": false, "title": "Layered pancake sausage stew", "url": "www_bbc_co_uk_food_recipes_layeredpancakesausag_85467", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp plain flour", "1 free-range egg", "pinch of salt", "3-4 tbsp milk", "1 tbsp vegetable oil", "150ml/¼pint red wine", "1 sausage"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancake, whisk the flour, egg, salt and enough milk together in a bowl to form a smooth batter.", "Heat the oil in a shallow frying pan, then wipe any excess oil away with kitchen paper.", "Spoon in the batter and swirl to cover the base of the pan.", "Fry until the underside of the pancake is golden, then turn over and cook the other side until golden-brown.", "For the filling, place the red wine into a small saucepan and boil to reduce the liquid volume by half.", "Add the sausage and enough water to cover. Simmer for 8-10 minutes, or until the sausage is cooked through.", "To serve, place the pancake onto a plate. Place the sausage mixture intp the centre and fold the pancake over."]}]