[{"isVegetarian": true, "title": "Overnight muesli with apple and nuts", "url": "www_bbc_co_uk_food_recipes_overnight_muesli_with_57876", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/overnight_muesli_with_57876_16x9.jpg", "ingredients": ["50g/1¾oz porridge oats", "2 apples, coarsely grated", "20g/¾oz blanched hazelnuts, roughly chopped", "¼ tsp ground cinnamon", "¼ tsp ground nutmeg", "200g/7oz 0% fat Greek yoghurt", "100ml/3½fl oz skimmed milk", "100g/3½oz blueberries ", "10g/¼oz flaked almonds, toasted"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["In a bowl mix the oats, apples, hazelnuts, cinnamon and nutmeg. Stir in the yoghurt and milk, then cover the bowl and chill in the fridge for several hours or overnight. ", "Spoon into two bowls and top with the blueberries and almonds. "]}, {"isVegetarian": false, "title": "Ox cheeks braised in red wine with creamy mash and sautéed asparagus", "url": "www_bbc_co_uk_food_recipes_ox_cheeks_braised_in_red_60794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "2 ox cheeks, trimmed ", "1 onion, diced", "2 carrots, diced", "4 sticks celery, diced", "2 tbsp tomato purée ", "750ml bottle red wine", "2 garlic bulbs, halved", "2 bay leaves", "small bunch fresh thyme", "2 star anise", "3–4 cloves", "500ml/18fl oz dark chicken or veal stock", "salt and freshly ground black pepper", "1 bunch watercress", "2 tbsp light olive oil, plus more if needed", "4 asparagus spears, stalks roughly chopped, tips still intact", "10g/⅓oz butter", "1 braised ox tongue, diced ", "splash Madeira", "mashed potato, made very soft with lots of butter and double cream. ", "micro watercress, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a large flameproof casserole dish over a medium heat. Brown the ox cheek on all sides, remove and set aside.", "Throw in the vegetables with the garlic, herbs and spices and fry for 10 minutes, until golden-brown. Stir in the tomato purée and add the wine. Simmer until the volume of the liquid is reduced by half. ", "Return the cheek to the pan, add the stock, bring to a simmer, cover and braise for 2–3 hours or until the cheek is tender. ", "Remove the cheek and keep warm. Strain the sauce into a clean pan and reduce to a glossy, coating consistency. Season to taste.  ", "To make the watercress oil, blanch the watercress for a couple of minutes and refresh under cold water. Remove the stalks and put into a blender with the olive oil and salt. Blitz well and pass through a sieve. ", "To make the tongue and asparagus, blanch the asparagus for 2 minutes and refresh under cold water. Heat the butter in a pan, add the asparagus and braised tongue and sauté for 2–3 minutes. Add the Madeira to glaze.  ", "To serve, divide the mashed potato between two shallow bowls and top with the cooked cheeks. Spoon over the sauce, garnish with the tongue and asparagus, drizzle with the watercress oil and garnish with the micro watercress. "]}, {"isVegetarian": false, "title": "Oxtail poutine and butter-fried steak with golden garlic", "url": "www_bbc_co_uk_food_recipes_oxtail_poutine_and_07033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz beef dripping", "2kg/4lb 8oz short ribs, cut into 500g/1lb 2oz portions", "1 onion, chopped", "1 carrot, peeled and chopped", "1 celery stick, chopped", "2 garlic cloves, finely chopped", "250ml/9fl oz red wine", "2 litres/3½ pints beef stock", "4 tbsp olive oil", "2kg/4lb 8oz oxtail", "250g/9oz floury potatoes, such as Maris Piper, cut into 2cm/¾in-thick chips", "500g/1lb 2oz beef dripping", "75g/2½oz curd cheese ", "2 x 550g/1lb 4oz bone-in steaks, such as T-bone or prime rib ", "100g/3½oz beef dripping", "250g/9oz unsalted butter ", "4 fresh thyme sprigs", "1 fresh rosemary sprig", "2 heads garlic, peeled, cloves separated", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3", "To make the oxtail gravy, heat the dripping in a large casserole dish over a medium heat. Add the ribs in batches and seal until brown all over. Add the onion, carrot, celery and garlic and cook for 5–6 minutes. Add the red wine and simmer until the volume has reduced by half. Add the stock, return the ribs to the pan, cover and place in the oven for an hour.", "Meanwhile, roast the oxtail in a frying pan and add it to the casserole pan and continue to cook for a further 3 hours. Remove from the oven and carefully flake the meat using a fork and stir. It should be a little lumpy.", "Rinse the cut potatoes in plenty of cold water to remove the startch and place in a saucepan of boiling salted water and cook for 7 minutes. Drain in a colander and allow to dry.", "Put the beef dripping in a deep-fat fryer or a large, deep, heavy-bottomed saucepan. Heat to 140C. (CAUTION: Hot fat can be dangerous. Do not leave unattended.) Fry the chips for 4–5 minutes, ensuring they are submerged. Remove from the fryer and drain. Shake the chips to chuff the edges and allow to cool completely in the basket.", "Meanwhile, season the steaks all over with salt and pepper. Heat the dripping in a large cast-iron frying pan over a high heat. Once it is foaming, add the steaks and cook for 5 minutes, or until crusty on the bottom. Turn the steaks and add half the butter, the thyme, rosemary and garlic. Cook over a high heat, basting the steaks with the foaming butter, garlic and herbs, for 5–7 minutes, or until medium-rare. Transfer the steaks to a plate and leave to rest for 10 minutes. Meanwhile, remove the herbs from the pan and keep frying the garlic until soft and golden, adding the remaining butter. ", "Reheat the deep-fat fryer or heavy-bottomed saucepan to 190C. (CAUTION: Hot fat can be dangerous. Do not leave unattended.) Fry the chips again for 4–5 minutes, or until golden. ", "Strain 2 ladles of oxtail gravy into a pan places over a medium heat and simmer until thickened and heated through.", "Cut the steaks off the bone and slice the meat across the grain. Serve with the fried garlic and the resting meat juices poured over. Toss the cooked chips with the cheese curds and place in a serving dish, pour over the gravy and serve with the steaks."]}, {"isVegetarian": false, "title": "Oxtail soup", "url": "www_bbc_co_uk_food_recipes_oxtail_soup_71917", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oxtail_soup_71917_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1.25kg/2lb 12oz oxtail, trimmed of fat and cut into pieces", "1 onion, roughly chopped", "1 celery stalk, roughly chopped", "1 large carrot, roughly chopped", "1 bay leaf", "3 thyme sprigs", "10 black peppercorns", "2 tsp tomato purée", "300ml/10½fl oz red wine", "1.5 litres/2½ pints litres beef stock", "1 tbsp plain flour"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the oil in a large, flameproof casserole dish. Add the oxtail pieces and fry over a high heat until browned all over – you may have to do this in batches. Take the oxtail out of the dish and put it on a plate.", "Add all the vegetables to the casserole and cook for 4-5 minutes, stirring occasionally. Add the herbs, peppercorns and tomato purée and cook for another minute. Pour in the wine and allow to bubble for a few minutes.", "Return the oxtail to the pan and pour in the stock. Bring to the boil, then turn down the heat to a gentle simmer. Cover and cook for 2½-3 hours, until the oxtail is really tender and falling off the bone. Using tongs or a slotted spoon, transfer the oxtail pieces to a plate and leave to cool.", "Strain the cooking liquor through a sieve into a bowl and leave to cool. Shred the oxtail meat and discard the bones. Place in a bowl and cover. Cover the bowl of cooking liquor and leave in the fridge, along with the oxtail meat, overnight.", "The next day, scrape away and discard the layer of fat on top of the cooking liquid. Spoon the remaining jellified soup into a pan and heat through until simmering. In a small bowl, blend the flour and three tablespoons of the hot soup until smooth. Whisk into the soup and simmer for two minutes. Add the oxtail meat to the pan and heat through for a minute or two before serving."]}, {"isVegetarian": false, "title": "Oxtail soup with mini parsley dumplings", "url": "www_bbc_co_uk_food_recipes_oxtail_soup_with_mini_37306", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole oxtail (around 1.3kg/3lb), cut into chunky pieces ", "3 tbsp plain flour", "flaked sea salt and freshly ground black pepper", "3-4 tbsp sunflower oil", "2 onions, halved and sliced", "2 garlic cloves, finely chopped ", "3 carrots, peeled and diced", "2 sticks celery, trimmed and diced", "1 tsp dried thyme", "2 bay leaves", "300ml/10fl oz red wine", "2 litres/3½ pints beef stock, made with 2 beef stock cubes", "2 tbsp tomato purée", "2 tbsp cream sherry", "2 tbsp yeast extract, such as Marmite", "200g/7oz self-raising flour", "100g/3½oz shredded suet", "3 tbsp finely chopped parsley", "½ tsp flaked sea salt", "150ml/5fl oz cold water"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/3140F/Gas 3-4.", "Wash the oxtail pieces and pat dry with kitchen paper. Trim off as much excess fat as possible. Put the flour in a strong plastic food bag and season well with salt and freshly ground black pepper. Drop half of the oxtail pieces into the seasoned flour and shake to coat. Transfer to a plate. Repeat with the remaining oxtail pieces.", "Heat two tablespoons of the oil in a large non-stick frying pan. Brown the oxtail pieces over a medium heat for about 10 minutes, or until deeply coloured, turning every now and then. You may need to add extra oil or cook the beef in batches depending on the size of your pan. Put the oxtail pieces in a large, flame-proof casserole.", "Return the frying pan to the hob and add the onions, garlic, carrots and celery, with a little extra oil if necessary. Cook gently for 10 minutes, or until softened and lightly browned, stirring occasionally. ", "Tip the vegetables on top of the beef and add the thyme and bay leaves. Stir in the wine, beef stock and tomato purée. Season with salt and pepper and bring to a gentle simmer. Cover the casserole with a lid and cook in the centre of the oven for three hours, stirring and turning the oxtail pieces halfway through the cooking time until the meat is falling off the bones.", "Remove the casserole from the oven and transfer the oxtail pieces to a board. Leave to cool slightly. Skim off the fat from the soup that will have pooled on the surface and discard. Pull the meat off the bones and discard any gristly bits. Cut the beef into small chunks and return to the casserole. Stir in the sherry and yeast extract.", "To make the dumplings, mix the flour, suet, parsley and salt in a large bowl. Stir in enough water to mix to a soft, spongy dough. ", "Roll the dough into 18 small balls and put to one side. Bring the soup to a gentle simmer, stirring occasionally. Add plenty of seasoning and drop the dumplings gently on top of the soup. Cover tightly with a lid and simmer for 15-18 minutes, or until the dumplings are well-risen and fluffy. Ladle the soup into deep bowls to serve."]}, {"isVegetarian": false, "title": "Oxtail stew", "url": "www_bbc_co_uk_food_recipes_oxtail_stew_91956", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oxtail_stew_91956_16x9.jpg", "ingredients": ["1.3kg/3lb oxtail, cut into chunky pieces (ask your butcher to do this for you)", "3 tbsp plain flour", "salt and freshly ground black pepper", "3–4 tbsp sunflower oil", "2 medium onions, sliced", "2 garlic cloves, finely chopped", "2 medium carrots, diced", "2 celery stalks, diced", "4–5 sprigs fresh thyme (or ½ tsp dried thyme)", "2 bay leaves", "300ml/½pint red wine", "500ml/18fl oz beef stock", "2 tbsp tomato purée", "1 tbsp chopped fresh parsley, to serve (optional)"], "serves": "Serves 5-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Wash the oxtail pieces and pat dry with kitchen paper. Trim off as much excess fat as possible. Put the flour in a freezer bag and season well with salt and pepper. Put half the oxtail pieces into the seasoned flour, toss well to coat then put aside on a plate. Repeat with the remaining oxtail pieces.", "Heat two tablespoons of the oil in a large non-stick frying pan. Brown the oxtail over a medium heat for about 10 minutes, turning every now and then, until dark brown all over. You may need to add extra oil if the pan looks dry at any point during the browning step. Put the browned oxtail into a flameproof casserole dish. (You may need to do this in batches.)", "Return the frying pan to a low heat and add the onions, garlic, carrots and celery. Add a little extra oil if necessary. Cook gently for 10 minutes, or until softened and lightly browned, stirring occasionally. ", "Tip the vegetables on top of the beef and add the thyme and bay leaves. Stir in the wine, beef stock and tomato purée. Season with salt and pepper, put the casserole on the heat and bring to a gentle simmer. Cover the casserole dish with a lid and cook in the centre of the oven for 3 hours. Stir after 1½ hours, turning the oxtail in the sauce.", "After 3 hours, the meat should be falling off the bones and the sauce should be thick. Remove the casserole dish from the oven and transfer the oxtail pieces to a plate, set aside and keep warm.", "Skim any fat that has pooled on the surface of the sauce.", "Divide the oxtail pieces between six warmed plates and spoon over the sauce. Sprinkle with the chopped parsley (if using) and serve with mashed potato and fresh vegetables."]}, {"isVegetarian": false, "title": "Oxtail salad with summer vegetables", "url": "www_bbc_co_uk_food_recipes_oxtailsaladwithsumme_86396", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz oxtail, cut into 2.5cm/1in thick pieces, trimmed of any excess fat ", "salt and freshly ground black pepper", "50g/2oz flour, plus extra for dusting the oxtail", "60g/2½oz butter, plus extra for the carrots ", "1 onion, finely chopped", "2 garlic cloves, crushed ", "1 tsp fresh thyme leaves ", "2 tsp tomato purée ", "100ml/3½fl oz red wine ", "2 litres/3½ pints beef stock (or 2 good quality beef stock cubes, dissolved in 2 litres/3½ pints hot water ", "1 tbsp cider vinegar", "½ tsp English mustard ", "3 tbsp extra virgin rapeseed oil", "handful pea shoots", "handful small salad and herb leaves (for example, silver sorrel, bittercress, amaranth, corn salad or baby spinach)", "60g/2½oz (shelled weight) fresh peas, boiled", "80-100g/3-4oz (shelled weight) fresh broad beans, boiled"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/400F/Gas 7.", "For the oxtail, season the pieces of oxtail with salt and freshly ground black pepper and lightly dust them with a little flour.", "Place the oxtail into a roasting tin and roast in the oven for 30 minutes, turning the oxtail pieces after 15 minutes to make sure they are nicely coloured on both sides.", "Meanwhile melt the butter in a pan over a low heat and gently cook the onion, garlic and thyme for 3-4 minutes until soft, stirring occasionally.", "Add the flour and the tomato purée and stir well.", "Gradually pour in the red wine and stock, stirring well between additions to avoid lumps forming, then bring the mixture to the boil.", "Add the pieces of roasted oxtail to the pan, then cover and simmer gently over a low heat for about two hours. Check the pieces of oxtail - the meat should be tender and easily removed from the bone. If not, replace the lid and cook for another 15 minutes and test again.", "Drain the oxtail into a colander over a bowl to reserve the sauce.", "When the oxtail is cool enough to handle, remove the pieces of meat from the bone and place into a clean saucepan and cover with the reserved sauce. Bring to the boil, then reduce the heat and simmer until the sauce has reduced enough to just coat the meat.", "Meanwhile, for the dressing, whisk all of the dressing ingredients together in a clean bowl and season, to taste, with salt and freshly ground black pepper.", "For the salad, place the pea shoots, salad and herb leaves, peas and broad beans into a bowl and cover with most of the dressing. Mix well to coat and arrange a little salad in the centre of each serving plate.", "To serve, spoon a little of the warm oxtail meat around the salad with a small amount of sauce just coating the meat, then spoon a little of the remaining dressing over the oxtail."]}, {"isVegetarian": false, "title": "Oyster loaves", "url": "www_bbc_co_uk_food_recipes_oysterloaves_67845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 miniature cottage loaves or brioches", "110g/4oz butter", "12 fresh oysters ", "salt and freshly ground pepper", "pinch of grated nutmeg", "150ml/5fl oz double cream", "1 tsp fresh lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Slice the tops off the rolls or brioches and scoop out most of the bread inside. Melt 55g/2oz of the butter. Brush the undersides of the lids and the hollows of the rolls inside and out generously with the melted butter. ", "Place the loaves on a baking sheet. Bake for about 10 minutes or until lightly brown. Meanwhile clean and open the oysters, drain off the liquor and reserve to one side. ", "While the loaves are browning, heat the remaining butter in a large frying pan. Sauté the oysters in the pan about 1 minute. ", "Remove the oysters from the pan with a draining spoon, cut them into 3 pieces and set aside. Add the reserved oyster liquor to the pan with the cream. Season with salt, pepper and nutmeg. Boil down steadily, stirring constantly, to form a very thick sauce, adding in the lemon juice. ", "Return the chopped oysters to the pan and gently reheat. Spoon the oysters and the sauce into the warmed rolls. Top with the lids and serve at once."]}, {"isVegetarian": false, "title": "Oyster po'boys", "url": "www_bbc_co_uk_food_recipes_oysterpoboys_80061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 freshly shucked oysters, or more if you like", "grapeseed oil or vegetable oil, for deep frying", "1 small jar mayonnaise, or make your own", "1 tbsp chopped fresh tarragon", "1 tbsp capers", "1 tbsp finely chopped shallots", "1 tsp French mustard", "dash Tabasco", "1 tbsp tomato purée", "2 tbsp lemon juice", "1 tsp red wine vinegar", "½ tsp cayenne pepper", "1 tbsp horseradish sauce", "225g/8oz cornmeal", "1 tbsp ground cumin", "1 tsp ground fennel", "1 tsp cayenne pepper", "salt and freshly ground black pepper", "2 eggs", "285ml/½pint milk ", "French stick, warmed", "butter", "crisp lettuce, such as cos, torn"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the remoulade mix all the ingredients together. Taste and adjust any of the ingredients you think necessary.", "For the cornmeal crust, combine all the ingredients in a bowl. Add salt and freshly ground black pepper to taste. ", "In a separate bowl, combine the egg and milk in a bowl for the egg wash. ", "Dry the freshly shucked oysters with kitchen towel then dip in the egg wash and then in the cornmeal crust mixture, coating liberally.", "Heat the grapeseed or vegetable oil in a large pan for deep frying until a breadcrumb sizzles gently in it (CAUTION: hot oil can be dangerous - do not leave unattended).", "Deep-fry the coated oysters until golden, about 2-3 minutes. Remove with a slotted spoon and drain on kitchen towel.", "Take a freshly warmed French stick, split down the middle and butter. Top with a layer of lettuce then drizzle over the remoulade sauce. Add the deep-fried oysters and cover with the other half of the French loaf.", "Eat at once."]}, {"isVegetarian": false, "title": "Oysters thermidor", "url": "www_bbc_co_uk_food_recipes_oysters_thermidor_69288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["24 native oysters in their shells", "55g/2oz butter", "1 shallot, finely chopped", "1 tbsp vermouth", "140ml/4½fl oz chicken stock", "140ml/4½fl oz fish stock", "140ml/4½fl oz double cream", "1 tbsp Dijon mustard, to taste", "2 egg yolks", "1 tbsp chopped fresh parsley", "55g/2oz parmesan, finely grated", "200g/7oz samphire"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Open the oysters carefully, retaining the juice. Cover the oysters with a clean cloth, but do not refrigerate.", "Melt the butter in a pan and add the shallot. Cook gently without colouring.", "Add the vermouth, oyster juice and stocks. Cook until the volume of liquid has reduced by two thirds.", "Add the cream and cook until the volume has reduced by half.", "Shuck the oysters, pry them from the shells and set aside. Clean the deeper shells and lay them on a tray, then put a little of the sauce in the base of each shell. Lay an oyster in each shell and transfer to the oven for two minutes. Preheat the grill to hot.", "Stir the mustard into the remaining sauce. Remove the sauce from the heat and stir in the egg yolks, followed by the parsley and half of the parmesan.", "Take the oysters out of the oven and pour a little sauce over each one. Sprinkle the remaining parmesan over the top. ", "Cook the samphire in a pan of boiling salted water for 1-2 minutes, or until tender. Drain well. ", "Meanwhile grill the oysters to glaze them. Serve with the samphire."]}, {"isVegetarian": false, "title": "Oysters Rockefeller", "url": "www_bbc_co_uk_food_recipes_oystersrockefeller_85977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 fresh oysters in their shell", "55g/2oz butter", "½ small onion, chopped", "1 tbsp chopped fresh parsley", "55g/2oz spinach, chopped", "55g/2oz fine breadcrumbs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Open the oyster shells with a shucker. Discard the top and loosen each oyster from the base of its shell. Set aside and keep cool.", "Melt the butter in a small frying pan. Fry the onion and the parsley for 2-3 minutes, until softened.", "Add the spinach and cook until wilted.", "Add the breadcrumbs and cook for 1-2 minutes.", "Place a teaspoon of spinach and breadcrumb mixture onto each half oyster shell to cover the oyster and place a small lump of butter on top of each.", "Place the oysters onto a baking tray and transfer to the grill to cook until golden-brown."]}, {"isVegetarian": false, "title": "Oysters with a coriander and passion fruit relish", "url": "www_bbc_co_uk_food_recipes_oysterswithacoriande_87075", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 rock oysters", "1 lemon, juice only", "1 lime, juice only", "150ml/¼ pint olive oil", "1 passion fruit, pulp scraped out", "1 tsp chilli flakes", "1 shallot, finely chopped", "small handful fresh coriander, finely chopped", "1 lime, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully open the oysters using an oyster shucker and place on a serving plate.", "Place all the remaining ingredients, except the lime wedges, into a small bowl and mix well.", "To serve, pour the relish over the oysters and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Oysters with tagliolini", "url": "www_bbc_co_uk_food_recipes_oysterswithtagliolin_73313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large oysters, preferably Colchester oysters", "55g/2oz butter", "200g/7oz tagliolini pasta, preferably fresh", "2 tbsp white wine vinegar", "½ lemon, juice only", "1 small bunch of chives, finely chopped", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of salted water to the boil. With an oyster knife, open the oysters and scoop the oysters' flesh out of the shell. Cut them in half and put them back in their own water, taking care not to leave any bits of shell in the oyster water.", "Gently melt the butter in a large saucepan. ", "Meanwhile, add the pasta to the pan of boiling salted water. It should take two minutes to cook, if you're using fresh pasta, or according to packet instructions. Drain the cooked pasta, reserving some of the cooking water.", "Add the drained pasta to the pan with melted butter. Then add the oysters and the oyster water. Add the chives, vinegar and lemon. Stir for a couple of minutes, just to warm the oysters up. Add more water or butter if needed. ", "Serve immediately."]}, {"isVegetarian": false, "title": "Pad Thai", "url": "www_bbc_co_uk_food_recipes_pad_thai_36788", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pad_thai_36788_16x9.jpg", "ingredients": ["250g/9oz flat rice noodles ", "3 garlic cloves, roughly chopped ", "good handful coriander leaves and stalks ", "1 red chilli, seeds removed, roughly chopped ", "2 limes, zest and juice", "2 tbsp sunflower oil ", "20 raw tiger prawns, de-shelled, heads and black vein removed ", "6 spring onions, trimmed and finely sliced ", "100g/3½oz beansprouts ", "3 tbsp Thai fish sauce (Nam Pla) ", "1 tbsp light soft brown sugar ", "2 large free-range eggs, beaten ", "lime wedges, to garnish ", "4 tbsp toasted sesame seeds, roughly chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles according to the packet instructions then drain them and set aside.", "In a pestle and mortar, make a paste from the garlic, coriander stalks, red chilli and lime zest.", "Heat the oil in a wok or a large non-stick frying pan over a high heat. When the oil is just at smoking point, add the paste and fry for about one minute, or until it becomes aromatic. ", "Add the prawns, half of the spring onions and half of the beansprouts and stir-fry for two minutes.", "Add the drained noodles and mix through. Stir in the lime juice, fish sauce and brown sugar and cook for two minutes. Pour in the beaten eggs and mix through the noodles until just cooked.", "Tumble the noodles out onto warmed serving plates and serve garnished with the coriander leaves, lime wedges, toasted sesame seeds, and the remaining spring onions and bean sprouts."]}, {"isVegetarian": false, "title": "Pad Thai", "url": "www_bbc_co_uk_food_recipes_pad_thai_38349", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pad_thai_38349_16x9.jpg", "ingredients": ["250g/9oz flat rice noodles", "3 garlic cloves, roughly chopped", "1 handful fresh coriander, chopped, leaves and stalks seperated", "1 red chilli, seeds removed, roughly chopped", "2 limes, juice and zest", "2 tbsp sunflower oil", "1 cooked chicken breast, skin removed and thinly sliced", "6 spring onions, thinly sliced", "100g/3½oz bean sprouts", "3 tbsp fish sauce", "1 tbsp soft light brown sugar", "2 large free-range eggs, beaten", "1 handful salted peanuts, roughly chopped, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles according to the packet instructions, then drain and set aside. ", "In a pestle and mortar, grind the garlic, coriander stalks, chilli and lime zest to a paste. ", "Heat the oil in a wok or a large frying pan until just at smoking point. Add the paste and fry for 1 minute, or until aromatic. Add the chicken, half the spring onions and half the bean sprouts and cook for 2 minutes, stirring well to coat everything in the paste.", "Add the drained noodles and mix well. Stir in the lime juice, fish sauce and sugar and cook for 2 minutes. ", "Pour in the egg and mix until just cooked. Serve the pad Thai with the coriander leaves, lime wedges, peanuts and remaining spring onions and bean sprouts."]}, {"isVegetarian": false, "title": "Pad Thai salad", "url": "www_bbc_co_uk_food_recipes_pad_thai_salad_01326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz medium rice noodles", "3 Thai shallots, roughly chopped", "2 garlic cloves, roughly chopped", "2 tbsp fresh coriander root", "1 tsp chilli powder", "50ml/1¾oz sunflower oil", "200g/7oz minced chicken", "50g/1¾oz dried shrimps", "4 spring onions, finely chopped", "150g/5½oz bean sprouts", "25ml/2 tbsp soy sauce", "25ml/2 tbsp oyster sauce ", "2 medium free-range eggs", "3 limes, juice only", "10 leaves Pak chee laos (dill)", "75g/2½oz roasted peanuts, roughly chopped", "100g/3½oz beansprouts", "4 spring onions, green part only, finely chopped", "1 red chilli, julienned", "fresh coriander, picked", "1 tbsp pickled turnip, shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the noodles in a large, heatproof bowl and pour over boiling water until they are submerged. Leave for 2–3 minutes, then drain well and place in cold water to cool.", "Grind the shallots, garlic, coriander root and chilli powder in a mortar, adding a touch of water to bring it to a paste.", "Heat the oil in a large frying pan, add the chicken and cook until brown. Add the shrimps, spring onions and beansprouts and cook for a further minute.", "Stir in the soy sauce and oyster sauce and cook for another minute.", "Add the drained noodles, eggs, lime juice and leaves. Toss gently until the eggs are cooked.", "To serve, place the pad Thai salad into a large serving bowl and top with all the garnishes."]}, {"isVegetarian": true, "title": "Padron peppers", "url": "www_bbc_co_uk_food_recipes_padron_peppers_93262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive or vegetable oil", "150g/5½oz padron peppers", "flaky sea salt", "2 tbsp extra virgin olive oil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large (preferably cast iron) frying pan over a high heat. When the air above the oil starts to shimmer and the pan is too hot to comfortably hold your hand over, add the padron peppers.", "Cook on one side for 1 minute, or until the skins to start to blacken and blister, then turn over. ", "Cook for a further minute then continue to cook, shaking the pan regularly, for another 2–3 minutes, or until the peppers are blistered all over but have softened to the point that they are just tender.", "Remove from the pan and drizzle over the extra virgin olive oil. Sprinkle over a generous pinch of flaky sea salt. Serve immediately or at room temperature. "]}, {"isVegetarian": false, "title": "Pad Thai", "url": "www_bbc_co_uk_food_recipes_padthai_67953", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/padthai_67953_16x9.jpg", "ingredients": ["1 tbsp dried shrimps (optional)", "100g dried rice stick noodles", "3 tbsp vegetable oil", "2 eggs, lightly beaten", "2 garlic cloves, smashed", "200g small fresh prawns, peeled", "100g bean sprouts, rinsed", "2 spring onion greens, chopped into 3cm/1in lengths", "3 tbsp Thai fish sauce (nam pla)", "1 tbsp tomato ketchup", "2 tbsp lime juice", "½ tsp dried chilli flakes or cayenne", "1 tbsp palm or brown sugar", "2 tbsp roasted peanuts, lightly crushed", "2 tbsp coriander sprigs", "1 lime, quartered"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grind the dried shrimps to a fluffy powder in an electric coffee grinder (you can clean out the grinder by whizzing raw rice in it).", "Cover the noodles with boiling water and leave for 15 minutes or until al dente.  Rinse in cold water and drain well, then use 1 tsp of oil to coat your hands and run them through the noodles to help prevent sticking.", "To make the omelette, heat 1 tbsp of the oil in a wok and swirl to coat the surface. Pour in the beaten eggs and swirl to make a very thin omelette. Run a knife around the edge, turn out, slice into strips and set aside.", "To cook the noodles, add remaining oil to the wok and heat. Add the garlic and the prawns and toss over high heat. Set the prawns aside.", "In turn, add the noodles, omelette strips, bean sprouts, spring onions, shrimp powder, fish sauce, ketchup, lime juice, chilli and sugar, tossing constantly over high heat.", "To serve, scatter with crushed peanuts, coriander leaves and quartered limes."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_67269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 chicken breasts, cut into 8 pieces", "4 raw king prawns, shell and head on", "20 mussels, cleaned", "1 garlic clove, roughly chopped", "3 tomatoes, blanched, peeled, seeded and roughly chopped", "200g/7oz paella rice ", "a pinch of saffron", "1 litre/1¾ pints chicken stock, boiling", "8 small cherry tomatoes", "110g/4oz broad beans, fresh or frozen"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a paella pan, heat the olive oil and fry the chicken pieces for 1-2 minutes.", "Add the prawns, then stir; add the mussels and  stir again, then add the garlic and tomatoes. Fry for a couple more minutes.", "Sprinkle in the rice. NOTE: Do not stir the ingredients, just shake them.", "Add a good pinch of saffron, and pour on up to 1 litre/1¾ pints of boiling chicken stock (about 1cm/½in above the level of the rice).", "Finally add the small cherry tomatoes and broad beans and season and simmer for 20 minutes.", "Serve with a rocket salad and crusty bread."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_89059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz olive oil", "175g/6oz chorizo cut into 5mm/¼inch slices", "8 chicken thighs, de-boned, cut in half, rolled in plain flour", "1kg/2lb 4oz mussels, cleaned and debearded", "1 large Spanish onion, finely chopped", "3 cloves garlic, chopped", "½ tsp dried red chilli flakes", "1 red pepper, chopped", "400g/14oz paella rice (such as calasparra), rinsed and drained", "3 bay leaves", "1 tsp smoked paprika", "1 tsp saffron threads, toasted in a dry frying pan for 1-2 minutes", "125ml/4fl oz white wine", "1 tbsp lemon juice", "2.8 litres/5 pints chicken stock made from mussel cooking broth + water and a chicken stock cube", "115g/4½oz frozen peas, thawed", "18 small fresh clams, cleaned (discard any with broken shells or that do not close when firmly tapped)", "4 large tomatoes, de-seeded and chopped", "5 tbsp chopped flatleaf parsley", "1 lemon, zest only", "55g/2oz unsalted butter", "12 raw king prawns, in their shells", "450g/1lb squid, cleaned and cut into small pieces", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the olive oil in a paella dish or large heavy-based pan over a medium heat, add the chorizo and fry for 2-3 minutes, then remove and set aside.", "Add the chicken pieces to the same pan and cook for 2-3 minutes until the skin is browned. Remove and set aside.", "Place the mussels into a pan of boiling water, cover and boil until they open. Discard any that do not open. Strain and reserve the mussels and the broth.", "Add half the remaining olive oil to the paella pan and fry the onion, two of the cloves garlic, the chilli flakes and the red pepper. Cook slowly until the onion has softened but not browned, about eight minutes.", "Add the rice to the pan, stirring well to coat it in the oil, for two minutes, then add the bay leaves, paprika, the toasted saffron, white wine, lemon juice and prepared stock. Cook gently for five minutes.", "Add the fried chicken and chorizo, cover with a piece of dampened greaseproof paper and simmer gently for ten minutes.", "Stir in the peas and add the clams. Cover and simmer until all the clams have opened, about five minutes (discard any clams that have not opened).", "Remove the greaseproof paper from the pan and stir in the tomatoes, parsley, lemon zest and butter.", "Add the remaining olive oil to a separate frying pan over a medium-high heat. Add the remaining clove of garlic and the prawns and fry for 2-3 minutes, adding the squid for the last minute. Season to taste with salt and freshly ground black pepper and add to the paella. Serve immediately."]}, {"isVegetarian": true, "title": "Pain au chocolat blanc with raspberries and cream cheese", "url": "www_bbc_co_uk_food_recipes_pain_au_chocolat_blanc_37035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz full-fat milk ", "500g/1lb 2oz strong white flour ", "2 tsp fast-action yeast ", "80g/3oz caster sugar ", "2 medium free-range eggs ", "2 tsp fine sea salt ", "250g unsalted butter, chilled, in a block ", "120g/4¼oz white chocolate, chopped ", "150g/5½oz full fat cream cheese", "1 lemon, zest only", "200g/7oz raspberries", "1 large free-range eggs, beaten, for glazing"], "serves": "Makes 12 pastries", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, warm the milk and 90ml/3fl oz water in a small saucepan until lukewarm. ", "Place all the other ingredients, except the butter, in the bowl of a freestanding mixer with a dough hook attachment, making sure the yeast doesn’t touch the salt. Add three-quarters of the milk and water mixture. ", "Start the mixer on a low speed until all the ingredients are incorporated. Add a bit more liquid if the dough seems too dry; you want a slightly sticky dough. Increase the speed and mix for seven minutes. ", "Spread the dough out onto a baking tray lined with baking parchment. Cover with cling film and place in the freezer to cool. ", "Using a rolling pin, flatten the butter out between two pieces of baking parchment into a rectangle 33x19cm/13x7½in and place in the freezer. ", "After 15 minutes remove the dough from the freezer and roll it out to a rectangle 50x20cm/19½x8in. With a short edge towards you place the flattened butter on the lower two-thirds of the dough. ", "Fold the top third of dough over the butter and then fold the bottom third upwards so all the butter is encased. Press the edges of the dough firmly together. ", "Turn the block of dough 90 degrees and roll out to 50x20cm/19½x8in. Fold the top third down and the bottom third up and place back in freezer for 15 minutes. ", "Repeat the rolling and folding twice more, placing the dough in the freezer for 15 minutes in between.", "Cut the pastry in half and roll out one half on a well-floured work surface to a 42x20cm/16½x8in rectangle.", "For the filling, with the long edge of the dough towards you, place a 1cm/½in row of white chocolate right across the dough about 2.5cm/1in away from the edge. Roll up the bottom edge of the dough to cover the chocolate. ", "Mix together the cream cheese and lemon zest in a bowl until smooth and airy. ", "Place the cream cheese mixture in a piping bag fitted with a 7mm nozzle and pipe two rows right across the dough just above the encased chocolate. Place a row of raspberries on top of the cream cheese. Roll the dough again to encase the filling and trim off any excess dough. ", "Cut the roll of dough into six even pieces, each one 7cm/2¾in long. Place each one on a baking tray lined with non-stick baking paper. ", "Repeat the filling process for the second half of the dough so you end up with 12 pastries. Cover the pastries with cling film and allow to prove at room temperature for 40 minutes. ", "Preheat the oven to 200C/400F/Gas 6. (Do not use a fan-assisted oven.)", "Brush the pastries with the beaten egg. Bake for 25 minutes, or until well-risen and golden-brown. Remove from the oven and allow to cool slightly before transferring to a cooling rack."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_85931", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 shallot, chopped", "1 garlic clove, chopped", "½ tsp smoked paprika", "½ red pepper, chopped", "400g/14oz risotto rice (such as arborio or carnaroli)", "pinch saffron strands", "150ml/5½fl oz white wine", "500ml/18fl oz hot vegetable stock", "4 raw king prawns, shells removed, cleaned", "1 squid, cleaned and cut into rings", "handful fresh parsley, chopped", "salt and freshly ground black pepper", "1 lemon, cut into wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan and gently fry the shallot, garlic, paprika and red pepper until softened.", "Add the rice and stir until coated in oil.", "Add the saffron and wine and simmer until the liquid has reduced by half.", "Add the stock and simmer for ten minutes, or until most of the stock has been absorbed.", "Add the prawns and squid rings and cook for a further 3-4 minutes, or until the rice is tender and the prawns and squid are cooked through.", "Sprinkle over the parsley, season, to taste, with salt and freshly ground black pepper and stir well.", "To serve, place servings of the paella onto plates and garnish with lemon wedges."]}, {"isVegetarian": true, "title": "Pain au lait", "url": "www_bbc_co_uk_food_recipes_pain_au_lait_22273", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5½fl oz lukewarm full-fat milk", "5g fast-action yeast", "275g/9¾oz plain flour", "75g/2½oz strong bread flour", "45g/1¾oz sugar", "1 tsp salt", "75g/2½oz unsalted butter, softened", "1 large free-range egg, beaten, plus extra for glazing", "nibbed sugar (pearl sugar), for sprinkling"], "serves": "Makes 12 buns", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a small bowl, mix the milk and yeast together, and set aside for five minutes.", "In a large bowl, mix the flours, sugar and salt until thoroughly combined.", "Pour in the yeast and milk mixture, softened butter and beaten egg and stir to combine.", "Turn out onto a lightly floured work surface and knead (use a dough scraper) for 10 minutes, or until smooth and no longer sticky.", "Put the dough into a clean bowl, cover with a clean tea towel and leave to prove for 30 minutes.  ", "Preheat the oven to 210C/410F/Gas 6½.  ", "Weigh the dough and cut into 12 equal pieces.  Roll into balls and leave to rest, covered, for 10 minutes.  ", "Using a rolling pin, roll each dough ball out into an 8cm/3in circle.  Fold one-third of the circle into the centre and press with your thumb to stick it down. Then fold the opposite third of the circle into the centre. Fold this shape in half lengthwise to form a cylinder. Roll gently to seal the sides together, pressing slightly harder at the ends to make them slightly pointed. Place the buns, seam-side down, onto baking trays lined with baking parchment.  ", "Cover the dough with cling film and allow to rise for 30 minutes. ", "Brush each of the buns with egg and, using scissors, snip a zig-zag shape onto the top. Sprinkle with nibbed sugar and bake for 10-12 minutes."]}, {"isVegetarian": false, "title": "Pain perdu, caramelised pineapple and candy floss", "url": "www_bbc_co_uk_food_recipes_pain_perdu_caramelised_35024", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "30g/1oz caster sugar", "250ml/9fl oz milk", "1 vanilla pod, split in half lengthways and seeds scraped out", "2 tbsp rum, plus extra to flambé", "2 thick slices brioche", "100g/3½oz brown sugar", "½ pineapple, peeled and cut into cubes", "60g/2¼oz butter ", "200ml/7fl oz whipping cream", "50g/1¾oz icing sugar", "1 vanilla pod, split in half lengthways and seeds scraped out", "candy floss (optional), to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pain perdu and pineapple, mix the eggs, caster sugar, milk, vanilla and rum in a large bowl. Add the brioche and leave to soak.", "Heat the sugar in a pan until melted and slightly coloured.  Add the pineapple and a little extra rum. Allow to heat briefly, then slowly tilt the pan towards the flame, or light with a match. Let the flames flare up then die down (CAUTION: be careful of flames and keep your face away from the pan).  Add the butter and cook for 2 minutes.", "For the topping, whip the cream, icing sugar and vanilla together until soft peaks form when the whisk is removed.", "Place the soaked brioche in a hot frying pan and cook for 2 minutes on each side until golden-brown.", "Put the brioche in serving dishes, cover with the caramelised pineapple, add a spoonful of the whipped cream and cover with candy floss."]}, {"isVegetarian": true, "title": "Pain perdu with roasted fruits and glazed almond sabayon", "url": "www_bbc_co_uk_food_recipes_pain_perdu_with_roasted_54564", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange, juice only", "1 vanilla pod, seeds only", "150g/5½oz caster sugar ", "2 white peaches, pitted and cut into wedges", "150g/5½oz raspberries ", "3 free-range eggs and 1 free-range yolk, beaten", "75g/2½oz salted butter", "2 slices fruit bread or brioche ", "1–2 drops almond essence ", "4 free-range egg yolks ", "50g/1¾oz caster sugar ", "3 tbsp dark rum"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the orange juice, half the vanilla pod and most of the sugar in a saucepan to make a syrup. Add the peaches, remove from the heat after a few minutes and add the raspberries. Set aside. ", "To make the sabayon, place a glass bowl over a saucepan of barely simmering water. Add all the ingredients and whisk continuously, until pale and thick. Remove the bowl from the heat and whisk the mixture until cool.", "To make the pain perdu, mix the eggs and egg yolk with the other half of the vanilla seeds. Add the bread slices and soak for 2 minutes. ", "Melt the butter in a large frying pan. When foaming, add the soaked bread and fry until golden on both sides. Sprinkle with sugar.", "Top the pain perdu with the fruits and spoon over the sabayon. Glaze with a blow torch and serve. "]}]