[{"ingredients": ["275g / 10oz de papas, cortadas en cubos pero sin pelar", "3 cucharadas de aceite", "1 cebolla, en rodajas", "1 diente de ajo, aplastado", "Carne en conserva enlatada 225g / 8oz, cortada en cubos", "3 cucharadas de salsa Worcestershire", "1 pepinillo encurtido grande, picado", "1 cucharadita de mostaza integral", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "4 huevos escalfados", "salsa marrón y salsa de tomate"], "method": ["Hervir las papas en una sartén de agua con sal durante cinco minutos, luego escurrir.", "Calienta dos cucharadas de aceite en una sartén y freír la cebolla y el ajo durante 6-8 minutos, o hasta que estén suaves y ligeramente dorados.", "Incline la mezcla de cebolla en un tazón con la carne en conserva, salsa Worcestershire, pepinillo picado y mostaza. Sazonar con sal y pimienta negra recién molida y mezclar bien.", "Transfiera esta mezcla a un plato refractario.", "Caliente la cucharada restante de aceite con la mantequilla en una sartén y fría las papas hasta que estén tiernas y doradas.", "Precalentar la parrilla a alto.", "Coloque las papas en la parte superior de la mezcla de carne en el plato, luego colóquelas debajo de la parrilla durante 4-6 minutos, o hasta que estén crujientes y doradas.", "Para servir, divida el hash de carne en conserva entre cuatro platos para servir. Cubra cada porción con un huevo escalfado y sirva con salsa marrón y ketchup de tomate."], "url": "www_bbc_co_uk_food_recipes_cornedbeefhash_87542", "title": "Hash de carne en conserva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "125g / 4oz de harina común", "½ cucharadita de cúrcuma", "1 cucharadita de sal", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "285 ml / 10 fl oz de leche entera", "1 cucharada de aceite de oliva", "1 clara de huevo de granja, batida hasta que se formen picos suaves cuando se quite la batidora", "Carne en conserva de 400 g / 14oz de una lata, cortada en piezas de 2,5 cm / 1 in de espesor", "50ml / 2fl oz de aceite de oliva", "2 cebollas grandes, picadas", "2 guindillas rojas, finamente picadas", "4 dientes", "1 diente de ajo, aplastado", "1 naranja, jugo y ralladura solamente", "150ml / 5fl oz de vinagre de jerez", "150g / 5oz azúcar moreno claro", "sal y pimienta negra recién molida", "4 huevos escalfados de campo abierto"], "method": ["Caliente el aceite en una cacerola profunda y pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Tamiza la harina, la cúrcuma y la sal en un tazón.", "Haga un pozo en el centro de la mezcla de harina. Agregue el huevo entero y la yema de huevo y bata desde el centro hacia afuera para crear una pasta.", "Agregue la leche y el aceite de oliva y doble en la mezcla de harina y huevo para crear una mezcla suave.", "Dobla la clara de huevo en la masa.", "Sumerja las rebanadas de carne en conserva en la mezcla de pasta y con cuidado agregue al aceite caliente. Freír durante seis minutos, o hasta que estén crujientes y doradas, luego retirar con cuidado con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la mermelada de cebolla, caliente el aceite de oliva en una sartén a fuego medio.", "Agregue las cebollas, los chiles, el clavo de olor y el ajo y fríalos suavemente durante 15-20 minutos, hasta que las cebollas se hayan suavizado y se hayan caramelizado a un color marrón oscuro.", "Agregue el jugo de naranja y la ralladura, el vinagre de jerez y el azúcar y deje que hierva.", "Cocine la mezcla durante 10-12 minutos, o hasta que la mezcla tenga consistencia de mermelada. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida los buñuelos en partes iguales entre cuatro platos y cubra con un huevo escalfado. Coloque una cucharada de mermelada al costado."], "url": "www_bbc_co_uk_food_recipes_cornedbeeffritterswi_86924", "title": "Buñuelos de carne en lata con mermelada de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 papas, cortadas en cubitos", "3 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "Carne en conserva 340g / 12oz, enlatada", "Sal y pimienta negra recién molida, al gusto", "1 cucharada de vinagre", "1-2 huevos de gallinas camperas (por persona)", "Ketchup de tomate, para servir", "Harina normal 300g / 10½ oz", "Harina de maíz de 315g / 11oz", "200g / 7oz de azúcar glasé", "1 cucharada de levadura en polvo", "1 huevo de gallinas camperas", "Leche 250ml / 9fl oz", "200g / 7oz de mantequilla, derretida"], "method": ["Para el hash de carne en conserva, coloque las papas en una olla y cúbralas con agua. Llevar a ebullición y cocine a fuego lento hasta que esté tierno. Escurrir y apartar.", "Calentar una sartén hasta que esté caliente. Agregue una cucharada de aceite de oliva, la cebolla y el ajo y fría por dos o tres minutos.", "Agregue las papas y fría por un minuto más.", "Mezcle en la carne en conserva y mezcle.", "Vierta la mezcla en una fuente de sopa y colóquela debajo de la parrilla de tres a cuatro minutos, hasta que esté crujiente.", "Poner a hervir una olla de agua, agregar el vinagre y hacer girar el agua.", "Rompe un huevo en un cucharón. Vierta el huevo en la sartén y cocine a fuego lento durante dos minutos, hasta que esté listo. Retire de la sartén y drene.", "Retire el hash de la parrilla y cubra con el huevo.", "Cubra con un chorrito de ketchup y sirva con pan de maíz caliente y con mantequilla.", "Para el pan de maíz, mezcle la harina, la harina de maíz, el azúcar glas y el polvo de hornear.", "Haga un pozo en el centro de los ingredientes secos y agregue la leche y el huevo. Mezcle desde el centro hacia afuera, incorporando los ingredientes secos en la humedad gradualmente para crear una pasta similar a la masa. Agregue la mantequilla derretida último.", "Coloque en una lata caliente para hornear. Coloque en un horno caliente durante unos 15 minutos hasta que estén doradas.", "Retire del horno, deje que se enfríe un poco. Sal, corta en rodajas y sirve con el hash de carne en conserva."], "url": "www_bbc_co_uk_food_recipes_cornedbeefhashwithfr_78048", "title": "Hash de carne en conserva con huevos escalfados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornedbeefhashwithfr_78048_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hojaldre de pasta brisa de 900g / 2lb", "450 g / 1 libra de cebollas, peladas y en rodajas", "450 g / 1 libra de carne en conserva, en cubos", "2 cucharadas de ketchup de tomate", "2 cucharadas de aceite vegetal", "sal y pimienta", "huevo batido para glasear"], "method": ["Caliente el horno a 200C / 400F / Gas 6.", "Estirar los pasteles y cortar círculos de 20cm / 8in de diámetro.", "Calentar el aceite y cocinar las cebollas hasta que comience a ablandarse.", "Quítate el calor y enfríe. Agregue la carne en conserva y el ketchup de tomate y sazone bien.", "Divida la mezcla entre los 6 círculos y junte los bordes. Cepille con un poco del huevo batido.", "Ponga una bandeja para hornear y hornee en el horno durante 20-30 minutos hasta que la masa esté dorada. Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_cornedbeefpasties_13552", "title": "Pastel de carne en lata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 empanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1,5kg / 3lb 3 oz de carne en conserva, espesamente en rodajas", "sal y pimienta negra recién molida", "1-2 cebollas, finamente cortadas", "8 ramitas de tomillo fresco, hojas recogidas", "1kg / 2lb 2oz de papas cerosas, como Cara y Charlotte, peladas y en rodajas finas", "175ml / 6fl oz de caldo de pollo", "Frijoles de 300g / 11oz, recortados y cortados en piezas diagonales de 6cm / 2.5in", "50g / 2oz de mantequilla", "2 chalotes, en rodajas finas", "sal y pimienta negra recién molida", "5 cucharadas de perejil de flatleaf fresco picado", "50g / 2oz de mantequilla", "1,5kg / 3lb 3 oz de carne en conserva, espesamente en rodajas", "sal y pimienta negra recién molida", "1-2 cebollas, finamente cortadas", "8 ramitas de tomillo fresco, hojas recogidas", "1kg / 2lb 2oz de papas cerosas, como Cara y Charlotte, peladas y en rodajas finas", "175ml / 6fl oz de caldo de pollo", "Frijoles de 300g / 11oz, recortados y cortados en piezas diagonales de 6cm / 2.5in", "50g / 2oz de mantequilla", "2 chalotes, en rodajas finas", "sal y pimienta negra recién molida", "5 cucharadas de perejil de flatleaf fresco picado"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Para el caldo, engrase el interior de un plato mediano a prueba de horno con un poco de mantequilla, luego coloque una capa de carne en conserva en el fondo. Sazonar con sal y pimienta negra recién molida entre cada capa, cubrir con una capa de cebollas, espolvorear sobre el tomillo y cubrir con una capa de patatas. Repita las capas, terminando con las papas en la parte superior.", "Vierte el caldo por encima, luego salpica con la mantequilla restante. Cubra el plato con papel de aluminio y coloque en el horno para hornear durante una hora, o hasta que las papas estén tiernas. Retire la lámina y vuelva al horno para que se cocine durante 15 minutos, o hasta que se dore por la parte superior.", "Para los frijoles, ponga a hervir un sartén de agua con sal, agregue los frijoles y cocine por 2-3 minutos, o hasta que estén tiernos.", "Derrita la mantequilla en una sartén, agregue las chalotas y fría por 1-2 minutos, o hasta que se ablanden. Agregue los frijoles cocidos y fría por un minuto más, luego sazone con sal y pimienta negra recién molida. Agregue el perejil y mezcle bien para cubrir.", "Para servir, cuchara el caldo de carne en conserva en un plato de servir y coloque los frijoles al lado."], "url": "www_bbc_co_uk_food_recipes_cornedbeefhotpotwith_90598", "title": "Estofado de carne en conserva con judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["un poco de aceite de oliva", "50g / 1¾oz de puerros cortados en cubitos", "1 diente de ajo, picado", "Papas 400 g / 14 oz, puré", "1 yema de huevo", "150 g / 5¼ oz de carne en conserva rallada", "un poco de harina natural", "sal y pimienta negra recién molida", "aceite de oliva", "100g / 3½oz de cebolla roja, cortada en cubitos", "1 chile rojo seco", "50g / 1¾oz de tomate, cortado en cubitos y sin semillas", "50g / 1¾oz de azúcar moreno", "sal y pimienta negra recién molida"], "method": ["Calentar un poco de aceite de oliva en una sartén y dorar los puerros y el ajo.", "Retire del fuego y agregue el puré de patatas junto con la yema de huevo y la carne en conserva. Mezclar bien.", "Cubra sus manos con un poco de harina para que la papa no se pegue, y forme la mezcla en cuatro hamburguesas iguales, de aproximadamente 5 cm de diámetro. Agregue sal y pimienta y fría las hamburguesas en un poco más de aceite de oliva hasta que estén doradas por ambos lados.", "Para hacer el chutney, caliente una olla con un chorrito de aceite de oliva, la cebolla roja y el chile. Cocine hasta que se dore.", "Agregue el tomate, el azúcar moreno y el condimento, y deje que se caramelice durante cinco minutos.", "Sirva caliente o frío con las tortas de patata y algunas hojas de ensalada rotas."], "url": "www_bbc_co_uk_food_recipes_cornedbeefpotatocake_72292", "title": "Tortas de patata en conserva con cebolla roja y chutney", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 dientes de ajo, cortados en cubitos", "2 chiles rojos largos, cortados en cubitos", "Jengibre fresco de raíz de 2½ cm / 1 en pieza, pelado y cortado en cubitos", "4 cucharadas de aceite de girasol", "4 cangrejos (alrededor de 1.5kg / 3lb 5oz cada uno)", "4 cucharadas de ketchup de tomate", "1 cucharadita de Marmite o extracto de levadura similar", "4 cucharadas de salsa de soja oscura", "4 cebollas de primavera, en juliana", "2 cucharadas de cilantro picado"], "method": ["Caliente una olla con agua sobre la placa y coloque un vaporizador encima.", "Coloque el ajo, el chile, el jengibre y el aceite de girasol en un tazón pequeño y mezcle.", "Pica el cangrejo, quita la carne marrón y descarta los dedos del muerto (agallas). Coloque la carne en el vaporizador durante 4-5 minutos.", "Mientras tanto, agregue dos cucharadas de aceite aromatizado a un wok a fuego alto. Freír sin colorear, luego agregar el ketchup de tomate, el extracto de levadura y la salsa de soja. Cuando comience a caramelizar, agregue el cangrejo y mezcle hasta que esté cubierto.", "Agregue 150 ml / 5 fl oz de agua, cubra con una tapa y cocine por otros tres minutos.", "Retire del fuego, agregue la cebolleta y el cilantro y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cornish_chilli_crab_27091", "title": "Cangrejo de Cornualles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "Filetes de pescado o guarniciones de bajo costo 400 g / 14 oz, como perlón, merluza, abadejo, sardinas o salmonete", "100g / 3½oz de gambas crudas pequeñas, cáscara dejada en", "1 bombilla de hinojo grande, recortada y picada", "2 chalotes de plátano, picados", "1 zanahoria, pelada y picada", "1 tallo de apio, cortado y picado", "1 cucharada de puré de tomate", "250g / 9 oz de tomates de ciruela, picados", "1 estrella de anís", "pellizcar hilos de azafrán", "½ cucharadita de pimienta de cayena", "300ml / 10½fl oz de vino blanco seco", "2 cucharadas de pastis", "600ml / 20fl oz de caldo de pescado", "600ml / 20fl oz de caldo de pollo", "Filetes de lubina de 400g / 14oz, cortados en 4 piezas", "Filete de bacalao a 400g / 14oz, cortado en 4 piezas", "Filete de fletán 300 g / 10½ oz, cortado en 4 piezas", "12 berberechos, limpios (descartar cualquier berberecho que no se cierre herméticamente cuando se golpee firmemente en el costado del fregadero)", "8 langostinos cocidos o langostinos cocidos, cáscara dejada en", "1 limón, solo jugo", "3 dientes de ajo, pelados y dejados enteros", "200g / 7oz de mantequilla, suavizada", "1 baguette, diagonalmente cortado en 8-12 rebanadas", "2 dientes de ajo, aplastados", "2 yemas de huevo de gallinas camperas", "pequeñas hebras de azafrán", "75ml / 2½fl oz de aceite de oliva", "75ml / 2½fl oz de aceite vegetal", "1 cucharadita de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Para el estofado de pescado, caliente 2 cucharadas de aceite en una cacerola ancha de base pesada a fuego medio. Agregue los restos de pescado (o filetes) y las gambas pequeñas y sazone al gusto con sal y pimienta negra recién molida. Freír durante 8-10 minutos, o hasta que se dore por todas partes, luego retire de la sartén y déjelo a un lado en un plato.", "Agregue 2 cucharadas más de aceite a la misma cacerola y aumente el fuego a alto. Freír el hinojo, los chalotes, la zanahoria y el apio durante 8-10 minutos, revolviendo ocasionalmente, hasta que comiencen a dorarse.", "Agregue el puré de tomate y continúe cocinando durante 1-2 minutos. Agregue los tomates picados, anís estrellado, azafrán y pimienta de cayena y cocine durante 3-4 minutos más.", "Verter el vino blanco y los pastis y llevar a ebullición, raspando cualquier trozo quemado del fondo de la sartén con una cuchara de madera para desmenuzar. Continúe hirviendo hasta que el líquido se reduzca a un jarabe espeso.", "Agregue las existencias y devuelva la mezcla a ebullición. Continúe hirviendo hasta que el volumen del líquido se haya reducido en un tercio, aproximadamente 10-15 minutos.", "Retire la sartén del fuego y deje a un lado para que se enfríe un poco. Agregue el líquido en un procesador de alimentos y mezcle hasta obtener un puré suave en tandas, teniendo cuidado de cubrir y mantener presionada la tapa del procesador de alimentos con un paño de cocina para evitar escaldarse.", "Cuele la mezcla a través de un tamiz fino en una sartén limpia, luego vuelva a calentar a fuego medio.", "Sazonar las piezas de lubina, bacalao y fletán en ambos lados con sal y pimienta negra recién molida.", "Caliente el aceite restante en una sartén grande a fuego medio. Agregue las piezas de pescado, en lotes si es necesario, y freír durante 1-2 minutos en cada lado, o hasta que estén doradas por ambos lados. Agréguelos al estofado colado.", "Agregue los berberechos al cocido colado y cocínelos hasta que se abran las cáscaras (deseche los berberechos cuyas cáscaras no se abren durante la cocción). Agregue las gambas cocidas y revuelva hasta que se caliente. Exprima un poco de jugo de limón, luego condimente, al gusto, con sal y pimienta negra recién molida. Agregue las guarniciones de pescado frito (o los filetes) y las gambas cocidas.", "Para la tostada con ajo, precaliente la parrilla a su nivel más alto.", "Blanquee los dientes de ajo en una olla de agua hirviendo durante 20 segundos. Escurra bien, luego triture los dientes hasta obtener una pasta fina.", "En un tazón, mezcle el ajo machacado con la mantequilla ablandada. Extienda la mantequilla de ajo en las rebanadas de baguette.", "Coloque las rebanadas de baguette en una bandeja para hornear y ase a la parrilla durante 1-2 minutos, o hasta que estén ligeramente tostados.", "Para el aoli, mezcle el ajo, las yemas de huevo y los hilos de azafrán en una pasta en un procesador de alimentos. Vierta los dos aceites en una jarra, mezcle los dos juntos y, con el motor en marcha, agréguelos gradualmente al aoli ​​en una corriente fina hasta que todo el aceite se haya incorporado y se haya espesado a la consistencia de la mayonesa. Agregue el vinagre unas gotas a la vez, al gusto. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, ponga el guiso de pescado en cuencos para servir. Vierte una cucharadita del aoli ​​sobre cada tostada de ajo y deja 2 o 3 tostadas encima de cada porción. Sirva el resto del alioli en tazones para mojar al lado."], "url": "www_bbc_co_uk_food_recipes_cornish_fish_stew_with_36730", "title": "Guiso de pescado de Cornualles con tostadas de ajo y aoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de quinua", "3 cucharadas de aceite de oliva", "1 cucharadita de sal", "½ cucharadita de semillas de eneldo", "½ cucharadita de semillas de hinojo", "¼ cucharadita de semillas de comino", "¼ cucharadita de canela molida", "1 cucharadita de perejil plano, finamente picado", "1 cucharadita de eneldo, finamente picado", "1 cucharadita de cebollín, finamente picado", "sal y pimienta negra recién molida", "150 g / 5½ oz de hojas de ensalada de invierno", "1 cucharada de vinagre balsámico", "4 x 125g / 4½oz de piezas de Cornish ling, peladas", "sal al gusto", "2 cucharadas de aceite de oliva", "jugo de limón, al gusto", "115 g / 4 oz de yogur de estilo griego", "50ml / 2fl oz de jugo de toronja", "50ml / 2fl oz de aceite de oliva", "pizca de sal", "50g / 2oz de gambas cocidas peladas", "1 cucharada de perejil de flatleaf", "10g / ½ oz de alcaparras"], "method": ["Para la quinua, coloque todo menos una cucharadita de quinua en una cacerola con 200 ml / 7 fl oz de agua, una cucharada de aceite de oliva y la sal y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10 minutos, luego cubra con una película adhesiva y deje que hierva en un lugar tibio hasta que la quinua se haya enfriado. Coloque la quinua enfriada en un tazón grande.", "Caliente una sartén hasta que esté medianamente caliente, agregue una cucharada de aceite, la quinoa reservada, la semilla de eneldo, la semilla de hinojo, la semilla de comino, la canela molida y la tostada por un minuto.", "Vierta la mezcla en la quinua cocida y luego agregue las hierbas. Mezcle bien y sazone al gusto con sal y pimienta negra recién molida.", "Mezcle las hojas de invierno con un poco de la quinua, el vinagre balsámico y lo último del aceite de oliva.", "Para el ling, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Sazonar bien el ling con sal.", "Caliente una sartén antiadherente hasta que esté caliente, agregue el aceite de oliva. Agregue el ling y cocine en cada lado hasta que esté ligeramente dorado.", "Retire la marihuana de la sartén y colóquela en una bandeja para hornear. Hornee en el horno durante 3-4 minutos.", "Retire la bandeja para hornear del horno y sazone con un poco de sal y jugo de limón.", "Coloque el yogur en un recipiente y sazone, al gusto, con jugo de limón y sal. Mezclar bien.", "Para el aderezo de pomelo y gambas, coloca el jugo de toronja, el aceite de oliva, 25 ml / 1 onza de agua y la sal en una jarra y revuelve hasta que la sal se disuelva. Vierta el aderezo en una olla pequeña y caliente, luego agregue las gambas, el perejil y las alcaparras.", "Para servir, espolvoree yogur con limón alrededor de 4 platos y coloque una pila de quinua en el centro de cada plato. Cubra con una pieza de marihuana y espolvoree el aderezo de pomelo y gambas en la parte superior. Sirve las hojas de ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_cornish_ling_with_a_60914", "title": "Aliño de Corn, pomelo y gambas, quinua con especias y yogur de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vinagre de vino blanco 150ml / 5fl oz", "150ml / 5fl oz de azúcar en polvo", "50ml / 2fl oz de aceite de oliva", "1 cucharadita de sal", "1.5kg / 3lb 5oz hombro de cordero", "3 limones, cortados a la mitad", "3 dientes de ajo", "6 ramitas de tomillo", "6 ramitas de romero", "2 hojas de laurel", "100 g / 3½ oz de mantequilla", "1 cucharada de aceite de oliva", "400ml / 14fl oz de vino blanco", "sal marina", "3 rebanadas grandes de masa madre de buena calidad", "1 cebolla roja finamente rebanada", "1 chile rojo, finamente cortado en ángulo", "1 chile verde, finamente cortado en ángulo", "4 cebolletas, finamente cortadas en ángulo", "12 tomates cherry, cortados por la mitad", "1 diente de ajo", "1 cucharada de cilantro finamente picado", "puñado de hojas de albahaca en rodajas", "1 lima, jugo y ralladura", "1 limón, solo jugo", "aceite de oliva", "sal y pimienta negra recién molida", "300 g / 10½ oz de yogur griego de buena calidad", "verbena fresca (recién picado al gusto)", "menta recién picada (recién picado al gusto)", "1 lima, jugo y ralladura"], "method": ["Para hacer el pepinillo frío, coloque todos los ingredientes en una olla con 600 ml / 1 de agua y caliente a una temperatura tibia para disolver el azúcar. Transfiera a un recipiente y deje enfriar.", "Agregue la cebolla roja, cubra con una película adhesiva y déjela en la nevera durante la noche.", "Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Caliente el aceite de oliva en una cazuela con tapa a fuego medio. Agregue la mantequilla y deje espuma. Sazonar abundantemente el cordero y agregarlo a la sartén, sellando cada lado hasta que esté todo caramelizado.", "Retire el cordero y reserve. Agregue los dientes de ajo y la mitad de limones a la cazuela y deje que se caramelice. Agregue las hierbas y cocine por otros 2 minutos. Escurra la mantequilla y agregue el vino blanco. Llevar a ebullición y reducir a fuego lento.", "Regrese el hombro de cordero a la cazuela. Sazonar con sal, poner la tapa y colocar en el horno durante 4 horas, hilvanando regularmente, agregando un poco de agua si es necesario para que la sartén nunca se seque.", "Retire las cebollas rojas del pepinillo frío y colóquelas en un tazón. Agregue los chiles, las cebolletas, el cilantro picado y la albahaca en rodajas y mezcle para hacer una salsa.", "Cuando el tiempo de cocción del cordero haya terminado, aumente la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6 para que la piel quede crujiente. Permita que el cordero se enfríe y separe con dos tenedores.", "Precalentar la parrilla a la configuración más alta.", "Rocíe el aceite de oliva sobre las rodajas de masa fermentada y déjelo cocer a dorado y marrón, quítelo y frótelo con un diente de ajo fresco.", "Agregue los tomates a la salsa y mezcle bien. Agregue un chorrito de limón y jugo de limón y sazone.", "En un tazón, mezcle el yogur, la menta picada, la verbena, la ralladura de lima y el jugo a su gusto.", "Extienda la salsa sobre la tostada y cubra con el cordero."], "url": "www_bbc_co_uk_food_recipes_cornish_shoulder_of_lamb_77252", "title": "Paleta de cordero de Cornualles, bruschetta de salsa de chile y yogur de verbena de limón", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 225 g / ½ lb, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "½ cucharadita de sal", "60g / 2½oz de mantequilla sin sal", "1 huevo de gallinas camperas, solo yema", "60ml / 2½fl oz de agua", "1 huevo de gallinas camperas, batido, para glasear", "50 g / 2 oz de colinabo, finamente picado", "Patata de 150g / 5½oz, pelada y cortada en cubos", "Cebolla 50g / 2oz, finamente picada", "Filete de costilla de 100 g / 3½ onzas, cortado en trozos pequeños", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Para la masa, pulse la harina, el polvo de hornear, la sal, la mantequilla y la yema de huevo en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Poco a poco agregue el agua, una cucharada a la vez, mezclando continuamente hasta que la mezcla se una como una masa. (Puede que no necesite usar toda el agua.) Haga rodar la masa en forma de bola, luego envuélvala en una película adhesiva y déjela enfriar en la nevera durante una hora.", "Mientras tanto, para el relleno, ponga a hervir una sartén de agua hirviendo con sal. Agregue el colinabo y la papa picada y cocine por 4-5 minutos, hasta que estén tiernos, luego escurra bien, revierta en agua fría y reserve.", "Precalentar el horno a 180C / 350F / Gas 4.", "Pase el pastel frío sobre una superficie de trabajo limpia y enharinada. Corta un disco grande de la masa usando un plato como plantilla. Coloque las cebollas en una línea en el centro del disco de pastelería. Coloque el bistec picado en la parte superior, luego espolvoree la papa cocida y sólela sobre ella. Espolvorear con el perejil picado y sazonar, al gusto, con sal y pimienta negra recién molida.", "Cepille el borde del disco de repostería con algo del huevo batido. Dibuje los bordes de la masa juntos y péguelos con los dedos para sellar de manera que el sello quede encima del relleno. Con un cuchillo, haga un pequeño orificio en la parte superior de la pasta y cepille todo con el huevo batido restante.", "Coloque la pasta en una bandeja para hornear y hornéela en el horno por 25-30 minutos, o hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_cornishpasty_89627", "title": "Pastel de carne", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pasty grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornishpasty_89627_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["525g / 1lb 5 oz harina de maíz mediana, harina de maíz o polenta", "Rábano mooli blanco de 25g / 1oz (disponible en algunas fruterías), rallado", "2 cebolletas, cortadas y finamente picadas", "1 cucharada de hojas de cilantro fresco picado", "sal al gusto", "agua tibia", "1 cucharada de aceite de girasol, para engrasar", "mantequilla sin sal, para servir"], "method": ["Coloque todo menos 25 g / 1 oz de la harina de maíz, el mooli, la cebolleta, el cilantro y la sal en un tazón grande y revuelva para combinar. Poco a poco agregue el agua, poco a poco, hasta que la mezcla se una para formar una masa suave y lisa; la cantidad de agua dependerá de la textura de la harina de maíz. Amasar ligeramente, luego dejar de lado.", "Cubra la superficie de trabajo con una película adhesiva y tamice uniformemente la harina restante de 25 g / 1 oz.", "Engrase sus palmas con aceite, luego divida la masa en 12 bolas del tamaño de un limón y aplánelas con sus manos.", "Estirar un trozo de masa aplastada en una ronda de 0.5cm / ¼ de pulgada en la superficie de trabajo preparada. Repita el proceso con la masa restante.", "Caliente una plancha o sartén y cocine cada pieza de masa a medida que avanza. Freír en ambos lados hasta que estén ligeramente hinchados y moteados con manchas marrones.", "Sirva inmediatamente, unte con mantequilla o envuélvalos en papel de aluminio para usarlos más adelante."], "url": "www_bbc_co_uk_food_recipes_cornmealflatbreads_86122", "title": "Panes de harina de maíz", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ maíz en la mazorca", "85g / 3oz de mantequilla", "½ cucharadita de pimienta de cayena", "½ lima, solo ralladura", "1 cucharada de cilantro, finamente picado"], "method": ["Coloque el maíz en la olla en una olla con agua hirviendo y deje hervir durante 8-10 minutos o hasta que el maíz esté cocido y tierno. Retire el maíz en la mazorca de la sartén y manténgalo caliente.", "En otra sartén, caliente la mantequilla, la pimienta de cayena, la ralladura de limón y el cilantro hasta que se derritan.", "Para servir, inmediatamente vierta la salsa sobre el maíz caliente en la mazorca."], "url": "www_bbc_co_uk_food_recipes_cornonthecobwithlime_84071", "title": "Maíz en la mazorca con lima y mantequilla de cayena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de mantequilla sin sal", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de hojas de tomillo", "½ pimiento verde, finamente picado", "2 chiles verdes, finamente cortados en cubitos", "granos de maíz de 3 mazorcas", "2 cucharadas de harina normal", "150ml / ¼ litro de leche", "3 huevos", "Crema doble de 300 ml / ¾ de pinta", "1 cucharadita de sal", "¼ cucharadita de pimienta negra recién molida", "¼ cucharadita de nuez moscada recién rallada", "pizca de pimienta de cayena", "2 cucharadas de perejil picado de hoja plana", "1 cucharada de cebollines cortados", "55 g / 2 oz de parmesano, recién rallado", "Queso gruyere 55 g / 2 oz, rallado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente la mantequilla en una sartén, agregue la cebolla, el ajo, el tomillo, el pimiento verde y el chile, y cocine a fuego medio durante ocho minutos.", "Agregue la mitad del maíz y cocine por diez minutos. Dejar de lado.", "Coloque el resto del maíz en un procesador de alimentos con la harina, la leche y los huevos, y mezcle hasta que quede suave. Dejar de lado.", "Para el maíz en la sartén, agregue la crema, sal, pimienta, nuez moscada y cayena. Incorpore el puré de maíz, las hierbas y ambos quesos.", "Vierta la mezcla en un plato de soufflé de grasas de 1.7 litros / 3 pinta, coloque en un Bain Marie caliente y hornee hasta que la mezcla esté firme, aproximadamente una hora.", "Deje reposar el pudin por diez minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_cornpudding_70982", "title": "Pudín de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 maíz en la mazorca", "1 cucharada de agua", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "2 cucharadas de cilantro fresco picado", "¼ de chile rojo fresco, picado", "1 lima, solo jugo", "1 lima, cortada en rodajas, para adornar"], "method": ["Para los pinchos de maíz, coloque el maíz en la mazorca en un tazón pequeño, espolvoree con agua y cocínelo en el microondas a temperatura alta durante seis minutos. Cortar en pedazos de 2cm / 1in con un cuchillo grande y afilado.", "Ensarte los pedazos de maíz en brochetas, rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente y pásele los pinchos de maíz hasta dorar por todos lados.", "Para la llovizna de chile, mezcla todos los ingredientes en un tazón pequeño.", "Para servir, coloque los pinchos de maíz en un plato para servir y vierta sobre la hierba chilli llovizna. Adorne con rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_cornskewerswithchill_88428", "title": "Brochetas de maíz con chile chilli y llovizna", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo de corral, sin piel", "1 cucharada de aceite de oliva", "1 limón, jugo y ralladura", "sal marina y pimienta negra recién molida", "botón de mantequilla", "1 chalote, finamente picado", "1 chile rojo, sin grano y finamente picado", "2 cucharaditas de curry madras en polvo", "2 cucharadas de puré de tomate", "100 ml / 3½ fl oz de vino blanco seco", "100 ml / 3½ fl oz de caldo de pollo", "1 cucharada de mermelada de albaricoque", "150ml / 5fl oz mayonesa", "75 ml / 3 fl oz crema fresca", "1 mango grande, pelado, sin hueso, carne cortada en cubitos", "4 cebolletas, finamente picadas", "2 cucharadas de cilantro fresco picado", "dash salsa Tabasco", "50g / 2oz de almendras en copos (sartén ligeramente seca y tostada)", "hojas de ensalada verde, para servir"], "method": ["Frote el aceite de oliva por todo el pollo. Esparcir sobre la ralladura de limón y sazonar con sal y pimienta negra.", "Cueza al vapor el pollo durante 20-25 minutos, o hasta que esté cocido, luego déjelo enfriar.", "Derrita la mantequilla en una sartén, agregue la chalota y el chile y fría por cinco minutos. Agregue el polvo de curry y cocine por 2-3 minutos. Agregue el puré de tomate y cocine por un minuto más. Agregue el vino y continúe cocinando hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el atasco y el caldo, continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad. Dejar de lado para enfriar.", "Mezcle la mayonesa y la crema fresca en un recipiente hasta que estén bien combinados, luego agregue el aderezo de curry. Doble el mango, las cebolletas, el jugo de limón y el cilantro.", "Corta el pollo en trozos del tamaño de un bocado. Dobla esto en la mezcla de mayonesa. Sazonar con sal, pimienta negra recién molida y tabasco al gusto. Servir con una ensalada verde y vestir con los copos de almendras tostadas."], "url": "www_bbc_co_uk_food_recipes_coronation_chicken_30402", "title": "pollo adobado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coronation_chicken_30402_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de hojaldre", "1 huevo de gallinas camperas, batido, más 1 yema de huevo de gallinas camperas", "15g / ½ oz de mantequilla", "50g / 1¾oz de harina natural", "200ml / 7fl oz de caldo de pescado caliente", "1 cucharada de pasta de curry, mezclada con 1 cucharada de agua para formar una pasta suave", "sal y pimienta negra recién molida", "75ml / 2¾ fl oz crema doble", "18 langostinos, cocidos, pelados", "1 cucharada de almendras en copos", "3 cebollas de primavera, picadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ruede los pasteles sobre una superficie enharinada a 5 mm / ¼ de grosor. Recorte 12 círculos con un cortador normal de 9cm / 3½ pulgadas. Corta un círculo más pequeño del centro de seis de los círculos.", "Coloque los seis círculos completos en una bandeja para hornear y cepille con un poco de huevo batido. Coloque los seis círculos con un agujero recortado en la parte superior de cada uno de los círculos completos y transfiéralos al horno durante 10-15 minutos, o hasta que se levanten y se doren.", "Mientras tanto, derrita la mantequilla en una sartén, mezcle la harina y cocine hasta que la mezcla forme una pasta suave.", "Retire del fuego y bata gradualmente el caldo de pescado caliente y la pasta de curry. Regrese al fuego, condimente, al gusto, con sal y pimienta negra recién molida y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento, revolviendo constantemente, durante 10-12 minutos, o hasta que espese.", "Batir la yema de huevo y la crema juntos en un bol, luego batir en la salsa.", "Mezcle las gambas, las nueces y las cebolletas en la salsa y la cuchara en las cáscaras de pastelería cocidas.", "Vuelve al horno y hornea por 10-12 minutos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_coronationprawnvolau_93068", "title": "Coronación gamba vol-au-vents", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coronationprawnvolau_93068_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo de corral de 1.5kg / 4lb", "4 cebolletas, en rodajas", "6 dientes de ajo, pelados, dejados enteros", "1 cucharada de sal marina", "10 granos de pimienta negros enteros", "1 cucharada de aceite vegetal", "1 cebolla picada", "1 cucharada de curry en polvo", "1 cucharada de puré de tomate", "85ml / 3fl oz de vino tinto", "150ml / ¼ de agua", "1 hoja de laurel", "sal y pimienta negra recién molida", "azúcar glas", "2 rebanadas de limón", "apretón de jugo de limón", "Mayonesa de buena calidad 425 ml / 15 fl oz", "2 cucharadas de puré de albaricoque (hecho al mezclar 4-5 polvos, albaricoques secos con 3 cucharadas de agua)", "3 cucharadas de crema batida", "1 cucharada de cilantro picado", "arroz, cocinado según las instrucciones del paquete"], "method": ["Coloque el pollo en una cacerola con una tapa ajustada, cúbralo con agua y agregue las cebolletas, el ajo, la sal y los granos de pimienta.", "Llevar a ebullición y cocinar a fuego lento durante 30 minutos, volteando el pollo una vez durante el proceso de cocción. Cubra con una tapa y apague el fuego. Deja durante una hora, luego retira el pollo, deja que se enfríe por completo, y arranca el pollo de los huesos en pedazos ásperos.", "Mientras tanto, para la salsa, caliente el aceite en una sartén a fuego medio. Agregue la cebolla y cocine suavemente durante 3-4 minutos. Agregue el polvo de curry y cocine por otros dos minutos, revolviendo bien. Agregue el puré de tomate, el vino, el agua y la hoja de laurel.", "Llevar la mezcla a ebullición. Sazone con sal y pimienta negra recién molida, luego agregue el azúcar, las rodajas de limón y el jugo de limón, al gusto. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y esté a fuego lento, sin tapar, durante 5-10 minutos. Cuele la salsa a través de un fino tamiz de malla y déjela enfriar.", "Poco a poco agregue la mayonesa y el puré de albaricoque, al gusto. Agregue más jugo de limón, según sea necesario.", "Dobla la crema batida.", "Para servir, coloque el pollo en porciones en un plato grande, vierta la salsa sobre la parte superior, espolvoree con el cilantro y sirva inmediatamente, con arroz."], "url": "www_bbc_co_uk_food_recipes_coronationchicken_72328", "title": "pollo adobado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coronationchicken_72328_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka 35 ml / 1½ fl oz", "Licor de naranja de 15 ml / ½ fl oz", "exprimir jugo de limón fresco", "25ml / 1fl oz de jugo de arándano", "tuerza la cáscara de naranja para adornar"], "method": ["Coloque el vodka, el licor de naranja, el jugo de lima y el jugo de arándano en una coctelera y llénelo con hielo. Agite bien y luego cuele en un vaso de cupé o un pequeño vaso de Martini.", "Sostenga el trozo de cáscara de naranja sobre el vidrio y flamee cuidadosamente con una cerilla. Adorne el cóctel con la cáscara de naranja flameada y sirva."], "url": "www_bbc_co_uk_food_recipes_cosmopolitan_88567", "title": "Cosmopolita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cosmopolitan_88567_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["180ml / 6fl de leche en oz", "Harina normal 180g / 6oz", "2 huevos de gallinas camperas", "3 cucharadas de carne goteando (pero cualquier aceite servirá si quieres que sea vegetariano)", "4 chalotes de plátano grandes, cortados por la mitad a lo largo", "4 zanahorias, aproximadamente picadas", "6 dientes de ajo, pelados pero dejados enteros", "6 ramitas de tomillo, solo hojas", "sal y pimienta negra recién molida"], "method": ["Para la mezcla, mezcle la leche, la harina, los huevos y 120ml / 4½ fl oz de agua en un tazón. Cubra y refrigere durante al menos 20 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Caliente la carne goteando en una sartén grande a fuego moderado.", "Coloque las chalotas en la sartén con el lado del corte hacia abajo y cocine hasta que se ablanden.", "Agregue las zanahorias y el ajo y cocínelos hasta que estén dorados y caramelizados, aproximadamente cinco minutos.", "Transfiera los ingredientes de la bandeja a un plato para hornear, agregue el tomillo, sazone con sal y pimienta negra recién molida y colóquelo en el horno para calentar durante cinco minutos.", "Una vez que el goteo esté hirviendo, abra la puerta del horno e incline la mezcla sobre las verduras lo más rápido posible, para no perder demasiado calor.", "Hornee durante 20-30 minutos, o hasta que el pudín esté bien levantado y dorado.", "Sirva rápidamente ya que de lo contrario el pudin se desinflará."], "url": "www_bbc_co_uk_food_recipes_cotswold_pudding_25532", "title": "Pudín de Cotswold", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]