[{"ingredients": ["5 cucharadas de aceite de oliva", "1 bulbo de hinojo, picado", "2 tallos de apio, picados", "2 zanahorias picadas", "1 chile rojo, picado", "2 dientes de ajo picados", "Anís de 2 estrellas", "1 cucharadita de pimienta de cayena", "½ cucharadita de chile en polvo", "Tomates 500g / 1lb 2 oz, picados", "1 cucharada de puré de tomate", "2 tiras de cáscara de naranja", "400ml / 14fl oz de vino blanco", "1kg / 2lb 4oz huesos de pescado, aproximadamente picados (pregunte a su pescadero por estos)", "1 cucharada de perejil fresco picado", "1 cucharada de estragón fresco picado", "Gambas peladas de 100 g / 3½ oz, conchas reservadas", "Filetes de pescado de 300 g / 10½ onzas (dorada, perca y merluza), en rodajas", "100g / 3½ oz de calamar fresco, en rodajas", "2 dientes de ajo, aplastados", "1 yema de huevo de gallinas camperas", "150ml / 5fl oz de aceite de chile (reservado de la sopa, agregue aceite extra si es necesario para llegar a 150 ml / 5 fl oz)", "pizca de cayena", "sal marina", "2 cucharadas de aceite de oliva", "pizca de chile en polvo", "pizca de cayena", "Baguette de 4 rebanadas, tostado"], "method": ["Para la bouillabaisse, caliente el aceite en una sartén grande, agregue el hinojo, el apio y la zanahoria y fríalos durante 6-8 minutos, o hasta que estén suaves pero no coloreados. Agregue el chile y el ajo y cocine durante dos minutos hasta que estén suaves.", "Agregue las especias y fría por dos minutos hasta que estén fragantes. Agregue los tomates, el puré de tomate, la cáscara de naranja, el vino blanco y los huesos de pescado. Llevar a ebullición y hervir a fuego lento durante una hora.", "Desnata el aceite rojo oscuro de la superficie de la bouillabaisse con una cuchara y reserva para la rouille.", "Cuele el caldo a través de un colador fino, presionando firmemente para extraer algunas de las verduras. Regrese el caldo colado a la sartén y manténgalo caliente hasta que esté listo para servir.", "Para el rouille, coloca el ajo y la yema de huevo en un procesador de alimentos. Encienda el motor y gradualmente agregue el aceite de chile en una corriente lenta y constante hasta que la mezcla se parezca a la mayonesa. Sazonar con una pizca de pimienta de cayena y sal, al gusto.", "Para los croûtons, precaliente una parrilla a fuego medio-alto. Combine el aceite, el chile en polvo y la pimienta de cayena y cepille generosamente sobre las rebanadas de baguette. Caliente bajo la parrilla por dos minutos o hasta que esté crujiente.", "Para la bullabesa, devuelva la sartén al fuego y cocine a fuego lento. Agregue el perejil, el estragón, las gambas, el pescado y el calamar y cocine suavemente durante cinco minutos. Divida el pescado cocinado entre cuatro tazones para servir y vierta el líquido sobre la parte superior. Cubra cada plato con un cuscurro de chile y una cucharada de rouille."], "url": "www_bbc_co_uk_food_recipes_bouillabaisse_of_sea_62124", "title": "Bouillabaisse con gambas frescas y calamar, croûtons de chile y rouille", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litre / 2 pintas de caldo de pescado", "Mejillones de 1kg / 2lb 3¾oz, frotados y sin barba", "pellizcar el azafrán", "¼ cucharadita de curry en polvo", "Crema doble 500ml / 1pint", "Abadejo ahumado de 250 g / 9 oz, cortado en cubos de 1,5 cm", "Salmón 200g / 7oz, cortado en cubos de 1.5cm", "4 zanahorias, cortadas en cubos de 1cm y blanqueadas", "2 papas, cortadas en cubos de 1cm y blanqueadas", "1 puerro, cortado en cubos de 1cm", "2 cucharadas de perejil de flatleaf, aproximadamente picado", "sal y pimienta negra recién molida", "4 rebanadas de pan de campo, a la plancha"], "method": ["Llevar el caldo a ebullición, luego agregar los mejillones y cocinar por 3-4 minutos hasta que los mejillones estén abiertos. Deseche cualquier mejillón que no se abra.", "Cuele el caldo en una cacerola, reservando los mejillones.", "Tire de las conchas de mejillón a la mitad, descartando las mitades sin la carne de mejillón, y mantener a un lado.", "Coloque la sartén con el caldo de nuevo en el fuego y reduzca la temperatura a fuego lento.", "Agregue el azafrán, el polvo de curry y la crema, luego vuelva a hervir a fuego lento.", "Agregue el pescado, las zanahorias, las papas y el puerro y cocine a fuego lento durante 2-3 minutos hasta que estén tiernos.", "Agregue el perejil y los mejillones cocidos y revuelva.", "Sazonar con sal y pimienta negra recién molida.", "Sirve con el pan a la plancha."], "url": "www_bbc_co_uk_food_recipes_bouillabaissestylefi_78625", "title": "Mejillones, eglefinos y estofado de salmón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharaditas de leche malteada en polvo", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "6 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "1kg / 2lb 4oz de harina de pan blanco fuerte, más extra para espolvorear", "100 g / 3½ oz de azúcar en polvo", "250 g / 9 oz de mantequilla, más extra para engrasar", "600ml / 1pt 1 fl oz de leche", "18 g de levadura fresca", "Azúcar demerara 200 g / 7 oz", "1 cucharada de canela molida", "200g / 7oz de azúcar glasé", "2 cucharadas de whisky bourbon"], "method": ["Para el helado, en una sartén, bata la leche en polvo malteada con un chorrito de leche hasta que se disuelva, luego agrega la leche restante y la crema y lleva la mezcla a fuego lento.", "En un recipiente, bata las yemas de huevo y el azúcar impalpable hasta que estén pálidos y esponjosos, luego vierta la mezcla de leche tibia sobre la mezcla de huevo, batiendo continuamente hasta que esté bien combinado.", "Regrese la mezcla a la cacerola y cocine a fuego lento, batiendo todo el tiempo, hasta que la mezcla se espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Si usa una máquina Pacojet, llene (pero no llene) el contenedor, luego colóquelo en el congelador durante al menos 4 horas o hasta que se solidifique. Alternativamente, vierta la mezcla en una máquina para hacer helados y revuelva hasta que se congele, luego transfiera el helado a un recipiente hermético y congelable y congélelo hasta que lo necesite.", "Mientras tanto, para el donut, mezcle la harina y el azúcar en un tazón grande o en el tazón de un mezclador independiente.", "Calienta 100 g / 3½ oz de la mantequilla y la mitad de la leche en una cacerola a fuego lento. Cuando la mantequilla se esté derritiendo, retire la sartén del fuego y mezcle con la levadura hasta que se disuelva. Dejar de lado.", "Agregue la leche restante a la sartén que contiene la mezcla de levadura, luego vierta todo el líquido sobre los ingredientes secos. Mezcle durante 5 minutos en la batidora independiente o con una batidora eléctrica con un accesorio de gancho de pan, a velocidad media, hasta que la mezcla se una como una masa suave y pegajosa. Alternativamente, amase a mano sobre una superficie de trabajo ligeramente enharinada durante 5 minutos.", "Coloque la masa en un tazón grande y cubra con una película adhesiva, luego déjela a un lado a temperatura ambiente para probar durante 1 hora, o hasta que esté bien levantada, esponjosa y casi duplicada en tamaño.", "Engrase el interior de una lata para torta antiadherente de 38 cm / 15 pulg. De lado profundo con mantequilla, y engrase el borde exterior de una lata para pasteles de 12.5 cm / 5 pulg. O de un molde para horno. Coloque uno dentro del otro.", "Derretir los restantes 150 g / 5 oz de mantequilla y verter en una gran bandeja de tostado de alta cara.", "Mezcle el azúcar demerara y la canela en otra bandeja de tostado de alta cara.", "Ponga la masa probada en una superficie de trabajo ligeramente enharinada. Amasar suavemente por un par de minutos hasta que quede suave y elástico, luego enrollarlo en forma de un gran bollo. Con un par de tijeras, recorte la masa en el centro para crear un orificio que llegue desde la parte superior hasta la parte inferior del moño; usa tus dedos para aumentar suavemente el tamaño del agujero.", "Sumerja la rosquilla de monstruo en la mantequilla derretida hasta que esté completamente cubierta, luego espolvoréela por todos lados con el azúcar de canela. Transfiera la rosquilla a la lata preparada, aliviando el agujero de la rosquilla alrededor de la lata de pastel o del molde. Cubra la rosquilla sin apretar con una película adhesiva y déjela a temperatura ambiente durante 40-45 minutos, o hasta que la masa esté bien subida.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Una vez que haya probado la rosquilla monstruosa, retire la película adhesiva y hornéela en el horno durante 25-30 minutos, o hasta que se dore por encima y se caliente. Retire con cuidado la lata interior, luego gire todo el donut en un plato grande.", "Mezcle el azúcar glas y el bourbon juntos en un tazón hasta que queden suaves, luego coloque la mezcla en una bolsa de plástico pequeña y rocíelo sobre la rosquilla.", "Llene un molde lo suficientemente pequeño como para caber dentro del agujero de la rosquilla con el helado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bourbon-glazed_monster_11608", "title": "Buñuelo monstruo esmaltado a la borbona con helado de leche malteada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10-14", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla, más o menos picada", "2 dientes de ajo, picados", "1 cucharadita de semillas de hinojo", "½ cucharadita de pimienta de cayena", "½ cucharadita de hilos de azafrán, empapados en 1 cucharada de agua caliente", "4 langostinos tigre con caparazón, toscamente picados", "Merluza de 400g / 14oz, deshuesada y sin piel, cortada en trozos", "Licor con sabor a anís 50ml / 2fl oz (como Pernod)", "110ml / 4fl oz de vino blanco", "1 x 400g / 14oz de tomates enlatados", "500ml / 18fl oz de caldo de pescado", "Mejillones de 1kg / 2lb 4 oz, limpios", "1kg / 2lb 4 oz almejas, limpiadas", "sal y pimienta negra recién molida", "4 chipirones, limpiados y cortados en triángulos", "1 baguette, cortado en diagonal en rebanadas gruesas de 5 mm / ¼ in", "2 yemas de huevo de gallinas camperas", "2 dientes de ajo, aplastados", "¼ cucharadita de pimienta de cayena", "½ cucharadita de hilos de azafrán, empapados en 1 cucharada de agua caliente", "¼ limón, solo jugo", "125ml / 4½fl oz de aceite de oliva ligero", "Gruyère 200g / 7oz, finamente rallado"], "method": ["Para la bouillabaisse, caliente una sartén grande hasta que esté medianamente caliente, agregue dos cucharadas de aceite de oliva, más la cebolla y el ajo y sofríalos suavemente durante un par de minutos, o hasta que se ablanden.", "Agregue las semillas de hinojo y la pimienta de cayena y fría por un minuto. Agregue el azafrán, las gambas y la mitad de la merluza y saltee durante dos minutos.", "Agregue el licor con sabor a anís y el flambeado para quemar el alcohol (PRECAUCIÓN: mantenga la cara y el cabello alejados de las llamas. No los deje solos). Agregue el vino blanco y cocine hasta que el volumen del líquido se reduzca a la mitad.", "Agregue los tomates enlatados y el caldo de pescado, lleve a ebullición, reduzca a fuego lento y cocine durante ocho minutos, o hasta que el pescado esté bien cocido.", "Coloque la mezcla en una licuadora de alimentos y mezcle hasta lograr un puré fino, luego vuelva a colar a través de un tamiz hasta una sartén limpia.", "Vuelva a hervir a fuego lento, agregue la merluza restante, los mejillones y las almejas y cocine hasta que todas las conchas se hayan abierto y la merluza esté recién hecha. Sazone al gusto con sal y pimienta negra recién molida.", "Mientras tanto, caliente una sartén hasta quemar y calentar ligeramente el calamar con el aceite de oliva restante. Coloque el calamar en la plancha y dore en cada lado durante 30 segundos hasta que esté recién cocido. Retirar y sazonar con sal y pimienta negra recién molida.", "Para la guarnición, caliente la parrilla a fuego alto. Tueste el pan en cada lado hasta que quede dorado claro.", "Coloque las yemas de huevo, el ajo, la cayena y el azafrán en un procesador de alimentos y mezcle con un puré. Mantenga el procesador en funcionamiento y muy gradualmente agregue el aceite de oliva hasta que se forme una mayonesa espesa de color amarillo brillante. Luego sazone al gusto con sal y pimienta negra recién molida.", "Para servir, ponga la bouillabaisse en cada plato de sopa y cubra con trozos del calamar sellado. Coloque la tostada en un tablero y sirva el Gruyère y la mayonesa en tazones al lado."], "url": "www_bbc_co_uk_food_recipes_bouillabaisse_with_26852", "title": "Bullabesa con calamar chamuscado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz costillitas de cerdo para bebé, cortadas en 12 estantes pequeños iguales (2 o 3 costillas por estante)", "80g / 2¾oz de sal marina gruesa", "4cm / 1½ en una pieza de jengibre, pelada y cortada en tiras pequeñas", "1 cebolla mediana, más o menos picada", "6 dientes de ajo, aplastados", "8 anís estrellado", "1 ramita de canela", "1 cucharadita de pimienta negra entera", "1½ litros / 2½ pintas de caldo de pollo", "100ml / 3½fl oz de vino de arroz Shaoxing", "100ml / 3½fl oz de vinagre de arroz", "4 mazorcas de maíz grandes en sus cáscaras", "15 ramitas de tomillo de limón", "3 cucharadas de jugo de lima", "2 cucharaditas de jarabe de arce", "4 cucharadas de aceite de oliva", "1 chile verde, sin semillas y en rodajas finas", "Hojas de cilantro de 20g / ¾oz", "20g / ¾oz de hojas de menta", "20g / ¾oz de hojas de perejil", "4 cebollas de primavera, en rodajas finas", "sal marina gruesa", "3 chalotes de plátano, pelados y en rodajas finas", "350ml / 12fl oz de bourbon", "4 cucharadas de jarabe de arce", "2 cucharaditas de pimienta de Szechuan", "1½ cucharada de jugo de limón", "2 cucharadas de aceite de sésamo", "3 cucharadas de ketchup de tomate", "1½ cucharadas de vinagre de arroz", "2 chiles rojos secos", "2 dientes de ajo, ligeramente triturados"], "method": ["Coloque las costillas en un tazón grande con la sal. Frote todo sobre la carne y reserve por 1 hora.", "Enjuague bien las costillas con agua fría, frote suavemente toda la sal y seque. Ponlos en una olla grande con tapa. Agregue el jengibre, la cebolla, el ajo, el anís estrellado, la canela y la pimienta en grano. Vierta sobre el caldo, el vino de arroz y el vinagre de arroz. Llevar a ebullición, luego reduzca el fuego a medio-bajo y cocine a fuego lento, tapado, durante 1 hora.", "Levante las costillas y reserve. Si no los está sirviendo en las próximas dos horas, deje enfriar las costillas y guárdelas en el refrigerador, tapadas, hasta que estén listas para usar. Si hace esto, asegúrese de volver a ponerlos a temperatura ambiente antes de cubrirlos con glaseado antes de servirlos.", "Cuele el líquido, descarte la cebolla, el ajo y las especias, y vuelva a colocarlo en la sartén. Coloque a fuego alto y cocine durante 30-35 minutos, hasta que el líquido se haya reducido a aproximadamente 200 ml / 7 fl oz. Sáquelo del fuego y apártelo. Enfríe si no está sirviendo las costillas en las próximas 2 horas.", "Para la ensalada de maíz ahumado, quite las cáscaras del maíz y úselas para revestir la base de una olla o sartén con tapa grande que sea lo suficientemente profunda como para caber en un colador o en una canasta metálica para cocinar al vapor. Agregue el tomillo limón y coloque la sartén a fuego alto. Una vez que las cáscaras y el tomillo comiencen a humear (aproximadamente 6 minutos) coloque el colador en la sartén y coloque las mazorcas de maíz dentro. Use una tapa para sellar la sartén y fume durante 5 minutos. Retirar del fuego y dejar a un lado, tapado, durante otros 5 minutos. Retire la tapa y déjela a un lado para que se enfríe.", "Coloque cada mazorca de maíz en una tabla de cortar y use un cuchillo grande y afilado para cortar filas de granos, cortando de arriba a abajo. Corte lo suficientemente profundo en la mazorca para que algunos de los granos permanezcan en racimos, esto no es esencial, simplemente se ve bien. Deja los granos de maíz a un lado y descarta las mazorcas.", "Haga el glaseado unos 45 minutos antes de que esté listo para servir, coloque todos los ingredientes para el glaseado, junto con 100 ml / 3½ fl oz de la reducción de la acción, en una sartén grande. Llevar a ebullición, luego cocine a fuego lento a fuego medio-alto durante 20-25 minutos, hasta que el líquido se haya reducido a aproximadamente 200 ml / 7fl oz y tenga la consistencia de jarabe. Regrese las costillas de cerdo a la salsa y revuelva suavemente para que todas se cubran. Cocine por unos 7 minutos más a fuego medio, revolviendo una o dos veces hasta que las costillas estén calientes y pegajosas.", "Justo antes de servir, termine la ensalada colocando el jugo de lima, el jarabe de arce, el aceite de oliva y el chile en un tazón grande con 1 cucharadita de sal marina. Batir para combinar, luego mezclar los granos de maíz, las hierbas y la cebolleta. Coloque dos pequeños bastidores de costillas en cada plato, uno apoyado contra el otro, y sirva con la ensalada de maíz al lado."], "url": "www_bbc_co_uk_food_recipes_bourbon_glazed_spare_56802", "title": "Bourbon esmaltado costillas con ensalada de maíz ahumado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 5kg / 11lb de buena calidad, pavo de corral, articulado en una corona y patas (alas puestas)", "4 cucharadas de sal", "8 semillas de enebro, aplastadas", "2 ramitas de tomillo, solo hojas", "2 dientes de ajo picados", "8 granos de pimienta, aplastados", "grasa de pato, para cubrir las piernas", "150g / 5½ oz de azúcar moreno", "150ml / 5fl oz de whisky bourbon", "2 cucharadas de salsa de soja", "30g / 1oz de mantequilla", "2 cucharaditas de pimentón ahumado", "1 cucharada de aceite vegetal"], "method": ["Para confitar las piernas, combine la sal, el enebro, el tomillo, el ajo y la pimienta en un bol. Frote la mezcla sobre las piernas. Enfríe en el refrigerador por 24 horas, dando vuelta dos o tres veces.", "Limpie las piernas con papel de cocina y séquelas, pero no lave el adobo. Poner en una cazuela de hierro fundido y cubrir con la grasa de pato. Caliente la cocina a fuego lento. Coloque la tapa y cocine por 2-3 horas, hasta que la carne esté tierna. Retirar del fuego y dejar enfriar en la grasa.", "Para el glaseado, caliente el azúcar morena, el bourbon y la salsa de soya en una sartén y cocínelos hasta que el volumen del líquido se haya reducido a la mitad, pero no del todo. Agregue la mantequilla y el pimentón.", "Para cocinar la corona de pavo, precaliente el horno a 170 ° C / 150 ° C Ventilador / Gas 3. Sazone la corona con sal y pimienta, frote con aceite, transfiera a un plato para asar y tueste durante 1 hora. Retire del horno y cepille con el esmalte. Continúe cepillándose con esmaltes periódicamente durante el resto del tiempo de cocción, reservando parte del glaseado para las patas confitadas. Cocinar tomará aproximadamente 2 horas en total, pero revise perforando la parte más gruesa de la carne con un pincho. Cuando los jugos se ponen limpios, se cocinan. Retire del horno, cubra y deje reposar.", "Mientras la corona descansa, quite cuidadosamente las patas de la grasa. Póngalos en una bandeja para hornear y tueste durante 20 minutos hasta que estén crujientes. Esmalte e hilvane las patas confitadas por otros 20 minutos o hasta que estén doradas.", "Sirva la corona de pavo y confite las piernas en rodajas con todos los adornos."], "url": "www_bbc_co_uk_food_recipes_bourbon-glazed_turkey_28426", "title": "Pavo glaseado con pavo confitado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5kg / 3lb 5 oz costillas de carne de vaca", "1 cucharadita de pimienta negra entera", "3 hojas de laurel", "1 manojo pequeño de perejil fresco de hojaldre, solo hojas", "1 cebolla, más o menos picada", "1 zanahoria, picada", "175g / 6oz de ketchup de tomate", "150g / 5oz de chile chipotle, salsa de tomate", "110ml / 4fl oz de salsa de soja oscura", "175g / 6oz de miel clara", "4 cucharadas de salsa teriyaki lista para usar", "4 cucharadas de whisky bourbon", "2 yemas de huevo de gallinas camperas", "1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "pizca de sal", "200ml / 7fl oz de aceite de colza", "90ml / 3½fl oz de aceite de oliva", "2 cucharadas de agua fría", "½ limón, solo jugo", "sal y pimienta negra recién molida", "250 g / 9 oz de zanahorias, finamente trituradas en una mandolina", "Col blanca de 300g / 11oz, finamente triturada en una mandolina", "1 cebolla blanca dulce, finamente rebanada", "4 papas para hornear grandes, lavadas y pinchadas con un tenedor", "1 cucharada de aceite de oliva", "1 cucharadita de sal marina Maldon", "250ml / 9fl oz de crema agria", "4 cucharadas de hojas de perejil fresco y picado"], "method": ["Para las costillas, coloque la carne de res costillas, granos de pimienta, hojas de laurel, perejil de hoja plana, cebolla y zanahoria en una sartén grande. Cubra con agua y lleve a ebullición.", "Una vez que la mezcla esté hirviendo, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Cocine a fuego lento durante 1 hora y media, revolviendo ocasionalmente para evitar que se pegue.", "Precalentar el horno a 200C / 400F / Gas 6.", "Mientras tanto, para la salsa de bourbon, coloque el ketchup de tomate, el ketchup de chile, la salsa de soya, la miel, la salsa teriyaki y el bourbon en una sartén por separado, mezcle bien y deje que la mezcla hierva a fuego lento. Cocine a fuego lento durante 1-2 minutos, luego retire del fuego.", "Cuando las costillas se cuecen a fuego lento durante 1 hora y media, sumérgelas en la salsa de bourbon, luego colócalas en una bandeja para hornear, reservando la salsa restante. Asar en el horno durante 10-12 minutos, luego cuchara más de la salsa de bourbon. Continúe asando durante 10-12 minutos más, luego retírelo del horno y déjelo a un lado en un plato caliente.", "Para la ensalada de col, mezcle las yemas de huevo, el vinagre de vino blanco, la mostaza de Dijon y la sal en un procesador de alimentos hasta que estén suaves y bien combinados.", "Con el motor del procesador de alimentos todavía en funcionamiento, vierta gradualmente el aceite de colza y el aceite de oliva en una corriente fina hasta que la mezcla espese hasta la consistencia de la mayonesa espesa. (Puede que no necesite todos los dos aceites).", "Transfiera la mezcla de mayonesa a un tazón limpio. Poco a poco agregue el agua fría y el jugo de limón en una corriente delgada, batiendo continuamente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque las zanahorias, el repollo y la cebolla en un tazón grande y añada suficiente mayonesa para cubrir las verduras. Revuelva hasta que esté bien combinado y déjelo a un lado.", "Para las papas al horno, frote las papas para hornear con aceite de oliva y espolvoree sobre la sal.", "Coloque las papas en el estante superior del horno y hornee por una hora, o hasta que estén tiernas (deje más tiempo para papas grandes).", "Para servir, divida las costillas pegajosas entre los cuatro platos de servir y coloque una porción de ensalada de col al costado. Separe las papas por la mitad y coloque una en cada plato. Cubra con una cucharada de crema agria y decore con el perejil rizado picado."], "url": "www_bbc_co_uk_food_recipes_bourbonglazedstickyr_90440", "title": "Costillas pegajosas glaseadas con col y patatas al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo grandes de campo abierto (a temperatura ambiente)", "1 diente de ajo pequeño, finamente picado o triturado para untar", "1 cucharadita de jugo de limón", "¼ cucharadita de sal marina fina", "150ml / 5fl oz de aceite de oliva virgen extra", "12-16 mejillones grandes, bien lavados y barba eliminados", "Filete de abadejo sin piel de 600 g / 1 lb 5 oz", "1 cucharada de aceite vegetal", "2 chalotes, finamente picados", "¼ de pimiento rojo, en rodajas finas", "1 cucharada de apio finamente picado", "2 pellizcos hilos de azafrán", "1 guindilla roja, sin semillas y finamente picada", "½ naranja, ralladura fina solamente", "500ml / 18fl oz de caldo de pollo", "5 cucharadas de aïoli (desde arriba)", "4 rebanadas gruesas de pan blanco", "30g / 1oz de mantequilla", "1 ramita de tomillo fresco", "1 diente de ajo,", "sal marina y pimienta negra recién molida", "hojas de cilantro, para adornar"], "method": ["Para el aoli, mezcle las yemas de huevo en un tazón con el ajo, el jugo de limón y la sal. Agregue el aceite de oliva gota a gota, hasta que tenga una salsa brillante con la consistencia de la mantequilla suave. (También puede usar un procesador de alimentos para esto).", "Para el bourride, deseche los mejillones que estén dañados o abiertos y que no se cierren cuando se golpean bruscamente. Enjuague el filete de abadejo, seque con papel de cocina y córtelo en trozos de 5cm / 2in. Reservar con mejillones.", "Caliente el aceite vegetal en una sartén grande con tapa a fuego lento. Agregue los chalotes, el pimiento rojo y el apio y fríalos suavemente durante 5 minutos o hasta que se ablanden.", "Agregue el azafrán, el chile y la ralladura de naranja y cocine por otros 3 minutos. Vierta el caldo de pollo y deje hervir, luego reduzca el fuego y cocine a fuego lento durante 3 minutos. Agregue los mejillones, ponga la tapa en la sartén y cocínelos durante 3-4 minutos, hasta que se abran las cáscaras. Ahora agregue las piezas de abadejo y cocine durante 3-4 minutos, o hasta que estén recién cocidas.", "Retire la sartén del fuego y transfiera los mejillones y el colín a un recipiente tibio, usando una cuchara ranurada. (Deseche los mejillones sin abrir). Reserve para mantener el calor.", "Vierta el líquido de cocción en una licuadora y mezcle hasta que esté suave, luego con el motor en marcha, agregue lentamente 5 cucharadas de aoli ​​a través del embudo. Cuando la mezcla comience a espesarse, deje de mezclar y vuelva a verter en la cacerola. Caliente la bourride suavemente y bata con un batidor de globo o una batidora de mano hasta que esté espumosa. Agrega el pescado y los mejillones. Sazonar, al gusto, con sal y pimienta negra recién molida y mantener el calor.", "Con un cortador de pasteles de 4 cm / 1½ pulgadas, corte 8 rondas de las rebanadas de pan. Derrita la mantequilla en una sartén antiadherente y agregue el tomillo y el ajo. Agregue las rondas de pan y cocine hasta que estén doradas y crujientes por ambos lados. Retire de la sartén y escurra sobre papel de cocina.", "Divida el bourride entre cuatro tazones para servir. Extienda los croûtons con un poco del resto de aoli ​​y coloque dos encima de cada tazón. Sazonar con pimienta negra y decorar con cilantro."], "url": "www_bbc_co_uk_food_recipes_bourride_of_pollock_and_91840", "title": "Bourride de colín y mejillones con ajo y croûtons de tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["llovizna ligera aceite de colza", "50 g / 1¾oz de mantequilla sin sal", "2 chalotes, finamente picados", "1 puerro, solo parte blanca, en rodajas finas", "1 tallo de apio, en rodajas finas", "1 diente de ajo, picado", "300g / 10½oz de grano largo o arroz basmati, lavado y escurrido", "700 ml / 1 pinta 4½ fl oz de pollo o pavo", "2 hojas de laurel", "pellizcar hilos de azafrán", "½ cucharadita de polvo de curry mediano", "200g / 7oz de pavo sobrante cocido, carne de pierna solamente, cortada en pedazos", "200g / 7oz de jamón cocido, cortado en trozos", "200 g / 7oz de salchichas cocidas o carne de embutido, cortadas en trozos", "3 huevos de gallinas camperas", "2 cucharaditas de perejil fresco picado", "2 cucharaditas de salvia fresca picada", "sal y pimienta negra recién molida", "cuñas de limón, para servir"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente el aceite y la mantequilla en una cacerola tapada a prueba de horno a fuego medio. Cuando la mantequilla esté espumosa, agregue los chalotes, el puerro, el apio y el ajo y fríalos durante 2-3 minutos, revolviendo bien, hasta que estén suaves pero no coloreados.", "Agregue el arroz y continúe cocinando, revolviendo bien, durante 1 minuto.", "Vierta el caldo, luego agregue las hojas de laurel, el azafrán y el polvo de curry y caliente hasta que hierva a fuego lento.", "Agregue las carnes sobrantes cocidas, vuelva a hervir a fuego lento la mezcla, luego cubra la sartén con la tapa.", "Transfiera la sartén al horno y cocine durante 12-15 minutos, hasta que el arroz esté tierno.", "Mientras tanto, baje cuidadosamente los huevos en una olla con agua hirviendo a fuego lento y cocine durante 6 minutos. Escurrir bien y ejecutar los huevos bajo un grifo de agua fría. Pelar los huevos y cortarlos en cuartos a lo largo.", "Cuando el kedgeree esté cocido, remueve el perejil y la salvia, luego dobla en los cuartos de huevos. Condimentar con sal y pimienta.", "Para servir, llevar la sartén a la mesa y ponerla en tazones. Adorne con una rodaja de limón y sirva con pan y mantequilla, si lo desea."], "url": "www_bbc_co_uk_food_recipes_boxing_day_brunch_89678", "title": "Boxing Day brunch 'kedgeree'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Colcannon de 250g / 9oz o puré de patatas", "Papas de 250 g / 9 oz (como el gallo), peladas y ralladas", "Harina normal de 100 g / 3½ oz", "125ml / 4fl de leche en oz", "botón de mantequilla", "aceite de colza, para freír", "sal marina y pimienta negra recién molida", "4 caballa pequeña, eviscerada y con mantequilla o fileteada", "2-3 cucharadas de aceite de oliva", "3 dientes de ajo, finamente picados", "botón de mantequilla", "eneldo, picado, para adornar", "1 limón, solo jugo, para servir", "½ cabeza de lechuga frisée, hojas internas retiradas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon"], "method": ["Para la caja, coloque el colcannon (o puré), la papa rallada y la harina en un tazón y mezcle hasta que estén combinados. Agregue la leche, poco a poco, hasta que tenga una consistencia húmeda. Condimentar con sal y pimienta.", "Calentar una sartén a fuego medio-alto. Agregue un poco de mantequilla y aceite, cuando la mantequilla comience a formar espuma, coloque cucharadas de la mezcla en la sartén y fríe durante 3-4 minutos por cada lado hasta que estén doradas.", "Retire y coloque en un plato caliente forrado con papel de cocina. Repita con la mezcla restante. Mantenga los panqueques calientes en un horno bajo, si es necesario.", "Para la caballa, cubrir los filetes de caballa con un poco de aceite y ajo. Condimentar con sal y pimienta.", "Calentar una sartén a fuego alto y agregar un chorrito de aceite y la mantequilla. Cuando la mantequilla esté espumosa, agregue la caballa con la piel hacia abajo y fríe durante 3-4 minutos hasta que la piel esté crujiente y la carne esté opaca.", "Mientras tanto, prepara la ensalada. Coloque las hojas de lechuga en un tazón grande. Mezcle el aceite, el vinagre y la mostaza en un tazón pequeño. Sazonar con sal y pimienta y verter sobre las hojas. Mezcle para cubrir.", "Sirve la caballa con los panqueques de papa. Termine con un poco de eneldo sobre los panqueques y un chorrito de jugo de limón sobre el pescado."], "url": "www_bbc_co_uk_food_recipes_boxty_colcannon_pancakes_13555", "title": "Boxty con caballa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tomates de 1kg / 2lb 2oz, puré en un procesador de alimentos", "Pasta de tomate 175g / 6oz", "425 ml / 15 fl oz de agua", "1 cucharadita de sal de ajo", "1 cucharadita de pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de hierbas italianas secas mezcladas", "110g-175g / 4oz-6oz hueso de cerdo con un poco de carne en la izquierda", "¼ cucharadita de sal, o al gusto", "Filete de grupa de 900 g / 2 lb, 5 mm / ¼ de grosor, cortado en cuatro rebanadas", "1 perejil grande de hojaldre, toscamente picado", "1 manojo pequeño de hojas de albahaca, más o menos picadas", "150 g / 5oz de pan rallado seco", "3 cucharadas de ajo, finamente picado", "150 g / 5 oz de parmesano, recién rallado", "75ml / 3fl oz de aceite de oliva", "3 naranjas grandes", "3 cucharadas de aceite de oliva", "pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre balsámico", "gran puñado de hojas verdes mezcladas"], "method": ["Para la salsa de tomate, coloque los tomates en puré, la pasta de tomate y el agua en una cacerola grande a fuego medio y deje que la mezcla hierva a fuego lento.", "Agregue la sal de ajo, pimienta negra recién molida y aceite de oliva y mezcle bien.", "Agregue las hierbas italianas secas mezcladas y mezcle bien una vez más.", "Mientras tanto, caliente el aceite de oliva en una sartén hasta que esté caliente, luego agregue el hueso de cerdo. Sazonar bien con la sal y freír, volteando ocasionalmente, hasta que se dore por todas partes.", "Agregue el hueso de cerdo a la salsa de tomate y cocine durante 3-4 horas a fuego muy lento. Retire el hueso de cerdo de la salsa y deséchelo.", "Para el braciole, coloque las piezas de carne entre dos hojas de película adhesiva sobre una superficie de trabajo resistente. Usando un mazo de carne o un rodillo, golpee los filetes para que se ablanden y aplanen.", "Coloque el perejil y la albahaca en un procesador de mini alimentos y mezcle en una pasta áspera. Extienda la mezcla de hierbas en la carne.", "Mezcle las migas de pan y el ajo picado en un bol. Coloque la mezcla de migas de pan en la carne, presionándola en la pasta de hierbas.", "Agregue el parmesano y la sal y la pimienta encima de la mezcla de pan rallado.", "Enrolle los pedazos de carne, meta los extremos y asegure con la cuerda de los cocineros.", "Calentar el aceite de oliva en una sartén hasta que esté caliente y agregar los trozos de carne enrollada. Cocine por un minuto en cada lado, hasta que se vuelva dorado por todas partes.", "Transfiera la carne a la cacerola de salsa de tomate, mezcle y deje hervir a fuego lento por 45-60 minutos, o hasta que la carne esté tierna.", "Para servir, retire la carne de la sartén y colóquela en una tabla de cortar. Retire la cuerda y permita que la carne descanse durante unos cinco minutos, luego corte la carne en rebanadas gruesas de 5 cm / 2 pulgadas.", "Para la ensalada, pele las naranjas y corte en rodajas de 5 mm / ¼ de grueso. Retire cualquier pepita.", "Coloque las naranjas en un plato y rocíe con aceite y sazone, al gusto, con pimienta negra recién molida.", "Batir el aceite de oliva y el vinagre balsámico juntos en un tazón limpio grande. Agregue las hojas de la ensalada verde y mezcle bien para cubrir.", "Para servir, coloque varias rebanadas del braciole en las placas. Vierta una llovizna de salsa de tomate sobre cada uno. Coloque 2-3 rodajas de naranja al lado y arriba con las hojas de ensalada vestidas."], "url": "www_bbc_co_uk_food_recipes_bracioleintomatosauc_85462", "title": "Braciole en salsa de tomate con ensalada verde y naranjas con pimienta agrietada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de papa, pelada, rallada", "500g / 1lb 2oz de puré de papa frío", "Harina simple 420g / 15oz", "1 cucharada colmada de polvo de hornear", "1-2 cucharadas de mantequilla derretida", "sal y pimienta negra recién molida", "200ml / 7fl de leche en oz", "1-2 cucharadas de aceite de oliva", "8-12 lonchas de tocino rayado ahumado", "jarabe de arce, para servir"], "method": ["Envuelva la papa rallada en una toalla de té limpia y exprímala bien para eliminar el exceso de líquido.", "Transfiera la papa rallada a un recipiente para mezclar, agregue el puré de papa frío y mezcle hasta que esté bien combinado.", "Agregue la harina y el polvo de hornear a la mezcla de patata y mezcle hasta que estén bien combinados. Agregue la mantequilla derretida y sazone, al gusto, con sal y pimienta negra recién molida.", "Agregue la leche, poco a poco, a la mezcla de patata, batiendo después de cada adición hasta que la leche se haya incorporado por completo a la mezcla. Cuando toda la leche se haya incorporado a la mezcla de patata, se asemejará a una masa espesa y espesa. Si la mezcla es demasiado pegajosa, agregue más leche según sea necesario. Dejar de lado.", "Mientras tanto, caliente el aceite en una sartén antiadherente grande a fuego medio a alto. Agregue las lonjas de tocino y fría por 6-8 minutos, o hasta que estén crujientes y doradas por ambos lados. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Agregue cucharadas de la pasta cuadrada en el mismo aceite en el que se cocinó el tocino, dejando suficiente espacio alrededor de cada cucharada para que la mezcla se extienda. Freír los boxties a fuego medio a alto durante 3-4 minutos en cada lado, o hasta que los boxties estén dorados y la papa rallada esté bien cocida. Retire los boxties de la sartén con una espumadera, déjelos a un lado para escurrirlos sobre papel de cocina y manténgalos calientes. Repite el proceso con la mezcla de caja restante.", "Para servir, divida los boxties por partes iguales entre cuatro a seis platos para servir. Coloque dos lonchas de tocino crujiente junto a cada una. Rocíe sobre el jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_boxtywithcrispstreak_91836", "title": "Boxty con panceta crujiente y jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz de espinilla en el hueso", "1kg / 2lb 4oz rabo de toro en el hueso", "2 zanahorias, cortadas por la mitad", "1 cebolla, cortada en cuartos", "2 palitos de apio", "1 cabeza pequeña de ajo, cortada por la mitad", "3 hojas de laurel", "1 ramita de tomillo", "200 g / 7 oz de goteo de carne, para freír", "8 rebanadas gruesas de pan de masa fermentada", "3 cucharadas de mostaza Dijon, o mostaza inglesa si lo prefiere", "Cheddar 150 g / 5½ oz, rallado", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "8 cabezas pequeñas de brócoli que brota púrpura (aproximadamente 300 g / 10½ oz)", "Mayonesa 150 g / 5½ oz", "40 g / 1½ oz crema de rábano picante", "300 ml / 10 fl oz de leche", "Harina normal de 200g / 7oz para cubrir"], "method": ["Para la carne, precalentar el horno 130C / 110C Ventilador / Gas ¾.", "En un plato de fondo grueso, a prueba de horno con una tapa ajustada, agregue la espinilla, el rabo de buey, las verduras y las hierbas. Cubra con 2 litros / 3½ litros de agua y coloque un círculo de papel de pergamino en la parte superior. Cubra con la tapa y cocine en el horno durante 5 horas.", "Cuando esté cocido, retire la espinilla de res, el rabo de buey, las zanahorias y el apio del licor de cocción y déjelo a un lado hasta que esté lo suficientemente frío como para manipularlo.", "Retire la carne de los huesos. Deseche los huesos y coloque la carne a un lado. Coloque la mitad del licor de cocina a un lado para servir. Caliente la otra mitad en el plato, o una sartén, en la placa, para reducir el volumen en tres cuartos.", "Para el pudin, precaliente el horno a 160C / 140C Fan / Gas 3.", "Caliente el goteo en una sartén. Freír el pan hasta que quede dorado y crujiente en ambos lados, pero no frito durante todo el proceso. Cepille generosamente con mostaza.", "Rompe la espinilla de buey cocida y el rabo de toro en copos ásperos. Corta bastante las zanahorias cocidas y el apio.", "Haga una capa de pan frito en el fondo de la fuente para hornear. Espolvoree con un tercio del queso, la mitad de la carne cocida y la mitad de las verduras. Condimentar con sal y pimienta. Haga otra capa de pan y queso, luego otra capa de carne y vegetales. Termine con una última capa de pan y queso.", "Verter suavemente sobre el caldo de carne reducido y hornear durante 20 minutos. Retire del horno y deje reposar durante 5 minutos antes de servir.", "Para el brócoli, caliente el aceite en una freidora a 180 ° C, o llene hasta la mitad una sartén con aceite y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (Precaución: El aceite caliente puede ser peligroso. desesperado.)", "Cocine el brócoli en agua hirviendo con sal hasta que esté tierno, pero aún con una mordida. Refresque en agua helada y drene.", "Mezcle la mayonesa y el rábano picante juntos. Agregue un poco de agua caliente para darle una consistencia de vertido.", "Sumerja el brócoli en la leche, sacudiendo cualquier exceso, luego cubra uniformemente en harina. Repita el proceso una vez más y luego cuidadosamente baje a la freidora. Cocine por unos minutos hasta que se dore. Escurra sobre papel de cocina y sazone con un poco de sal. Colocar en un plato de servir y vestir con la mezcla de rábano picante y mayonesa.", "Sirva el brócoli inmediatamente con el pudín caliente."], "url": "www_bbc_co_uk_food_recipes_braised_beef_bread_and_31824", "title": "Pudín de ternera, pan y queso estofado con brócoli frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 costillas cortas de carne de vaca de 300 g / 10½ oz", "aceite de oliva, para freír", "2 cucharadas de semillas de sésamo", "500ml / 18fl oz de carne de ternera", "2 cucharadas de cilantro fresco tostado", "2 cebollas de primavera, finamente cortadas en ángulo", "1 chile jalapeño, en rodajas finas", "1 lima, cortada en cuñas, para servir", "500gkg / 1lb 2oz de sal", "manojo de tomillo fresco", "½ bulbo de ajo, reducido a la mitad", "115g / 4oz de pimentón ahumado", "60g / 2¼oz de azúcar moreno claro", "30g / 1oz de sal fina", "1 cucharada de ajo en polvo", "1 cucharada de cebolla en polvo", "1 cucharada de pimienta negra recién molida", "1 cucharadita de chile en polvo", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "400ml / 14fl oz de ketchup de tomate", "100ml / 3½fl oz de mostaza americana", "4 cucharadas de vinagre de sidra", "4 cucharadas de salsa Worcestershire", "4 cucharadas de miel líquida", "120g / 4½oz de azúcar moreno claro"], "method": ["Para hacer la salmuera, mezcle 2,5 litros / 4½ pintas de agua con la sal, el tomillo y el ajo en una olla grande. Llevar a ebullición, luego cocine a fuego lento hasta que la sal se haya disuelto. Deja enfriar.", "Coloque las costillas en un recipiente tupperware grande y vierta sobre la salmuera. Cubra con una tapa y refrigere durante 4 horas. Cuando esté listo para cocinar, lave las costillas con agua corriente fría durante 30 minutos.", "Mientras tanto, para hacer la mezcla de especias, coloque todos los ingredientes en un tazón y mezcle bien.", "Para hacer la salsa de barbacoa, freír la cebolla y el ajo en una olla con un poco de aceite a fuego medio durante 3-4 minutos, hasta que estén blandos. Agregue 20 g / ¾oz de la mezcla de especias y fría por 2 minutos. Agregue los ingredientes restantes de la salsa y mezcle bien. Cocine a fuego lento durante 1 hora. Mezcle la salsa en un procesador de alimentos mientras aún esté caliente y pase por un colador fino.", "Precalentar el horno a 140C / 120C Fan / Gas 2.", "Seque las costillas con papel de cocina y frote con un poco de la mezcla de especias restante. Freír en un poco de aceite a fuego medio hasta que se dore por ambos lados. Coloque las costillas en una cazuela honda y cubra con el caldo de ternera. Estofar en el horno durante 4 horas, o hasta que estén tiernas. Reservar para descansar", "Aumente la temperatura del horno a 180 ° C / 160 ° C / Gas 4 y esparza las semillas de sésamo sobre una bandeja para hornear. Asar durante 5 minutos o hasta que esté dorado y aromático.", "Cepille las costillas cocidas con la salsa de barbacoa y espolvoree con cilantro fresco, cebollas tiernas, chile jalapeño y semillas de sésamo. Sirva con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_braised_bbq_irish_short_35047", "title": "Costillas de ternera estofadas de barbacoa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_bbq_irish_short_35047_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 grandes mejillas de res", "2 cebollas, más o menos picadas", "5 zanahorias, 4 dejadas enteras, 1 cortadas en trozos", "1 bulbo de ajo, cortado por la mitad", "3 ramitas de tomillo", "2 botellas de cerveza de portador de botella de x 500ml / 18fl oz", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "150 g / 5½ oz de mantequilla", "750ml / 1¼ pinta de existencias de carne", "Anís de 5 estrellas", "50 g / 1 oz de azúcar en polvo", "1kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de leche entera o crema", "sal y pimienta negra recién molida"], "method": ["Para las mejillas de carne, coloca las mejillas en un tazón grande con las cebollas, la zanahoria picada, el ajo y el tomillo. Vierta sobre la cerveza, cubra y coloque en la nevera durante al menos 12 horas, pero preferiblemente durante la noche.", "Precalentar el horno a 150C / 300F / Gas 2.", "Levante las mejillas de la carne de las verduras, seque con palmadita, y sazone con sal y pimienta. Reserve el adobo.", "Caliente una cazuela grande o una sartén a prueba de horno hasta que esté caliente, agregue el aceite de oliva y un poco de mantequilla. Cuando haga espuma, agregue las mejillas de res de dos a la vez y freírlas en cada lado hasta que estén doradas. Eliminar y reservar.", "Regrese la carne a la sartén con el adobo reservado y agregue el caldo de carne.", "Deje que hierva a fuego lento y cubra con una tapa, dejando la tapa ligeramente entreabierta para que tenga un espacio de 1 cm / ½ pulgadas en el costado. Cocine en el horno durante 4-5 horas.", "Mientras tanto, coloca las zanahorias enteras, anís estrellado, 100 g / 3½ oz de la mantequilla, una pizca de sal y el azúcar en una sartén y agrega suficiente agua para cubrir. Ponlo a fuego lento y cocina durante 20-30 minutos, o hasta que las zanahorias estén tiernas y glaseadas.", "Retire la cazuela del horno y cuele la salsa en una cacerola, colóquela sobre el fuego y cocínela hasta que el volumen del líquido se haya reducido y sea lo suficientemente grueso para cubrir la parte posterior de la cuchara.", "Agregue la mantequilla restante hasta que la salsa esté brillante. Sazonar con sal marina y pimienta negra recién molida, al gusto.", "Para el puré, coloque las papas en una sartén con agua fría y salada y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Drene y vuelva a la sartén, luego coloque a fuego lento durante un par de minutos para secar ligeramente las papas.", "Mientras tanto, ponga la mantequilla y la leche en una cacerola y cocine a fuego lento hasta que la mantequilla se derrita.", "Pase las papas a través de un ricer, luego agregue la mantequilla caliente y la leche (o crema) y bata para formar un puré muy suave. Sazonar, al gusto, con sal y pimienta negra.", "Para servir, levante las mejillas de carne y coloque en recipientes poco profundos. Vierta el puré al lado y termine con una generosa cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_braised_beef_cheeks_with_50441", "title": "Mejillas de res cocidas con cerveza y puré", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 grandes mejillas de res", "1 cebolla pequeña, descuartizada", "1 zanahoria pequeña, descuartizada", "1 bulbo de ajo, reducido a la mitad horizontalmente", "2 ramitas de tomillo frescas", "1 hoja de laurel fresca", "granos de pimienta negra", "Cerveza 500ml / 18fl oz", "2 cucharadas de aceite vegetal", "1 litro / 1¾ pintas de caldo de pollo", "1 chalota, en rodajas", "½ limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de perejil de flatleaf fresco picado"], "method": ["Coloque las mejillas de ternera en un tazón grande agregue las verduras, hierbas y granos de pimienta; Verter sobre la cerveza y mezclar hasta que estén bien combinados, luego enfriar en la nevera durante 24 horas.", "Precalentar el horno a 140C / 275F / Gas 1.", "Cuele la cerveza de la mezcla de carne y reserve.", "Sazonar las mejillas de ternera con sal y pimienta negra recién molida.", "Caliente una cazuela a prueba de llamas, agregue el aceite vegetal y dore las mejillas de res, por completo, retire del plato y deje a un lado.", "Reduzca el fuego, agregue las cebollas, las zanahorias y el ajo y cocine por 4-6 minutos, o hasta que estén pálidas doradas.", "Agregue las hierbas y los granos de pimienta, luego agregue la cerveza reservada y continúe cocinando hasta que el volumen se haya reducido a la mitad.", "Regrese la carne al plato, agregue el caldo de pollo y deje que hierva, luego cocine en el horno por tres horas o hasta que la carne esté tierna.", "Para la ensalada de perejil, coloque la chalota en un recipiente, sazone con sal y pimienta negra recién molida, agregue el jugo de limón, el aceite de oliva y el perejil.", "Para servir, ponga las mejillas en platos para servir, amontone la ensalada junto con una cucharada de puré."], "url": "www_bbc_co_uk_food_recipes_braised_beef_cheeks_and_14349", "title": "Mejillas de vaca estofadas y ensalada de perejil", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pequeñas mejillas de res cortadas", "500ml / 18fl oz de vino tinto", "3 hojas de laurel", "2 dientes de ajo, aplastados", "4 chalotes, cortados a la mitad", "1 cucharada de aceite de oliva", "700 ml / 1¼ pinta de buen caldo de carne", "1 barra de canela", "3 dientes", "55g / 2 oz de miel", "½ naranja, ralladura fina solamente", "1 membrillo, pelado, sin corazón y descuartizado", "sal marina y pimienta negra recién molida", "2 papas Desirée grandes, peladas y cortadas en trozos uniformes", "75ml / 2½ fl oz crema doble", "20 g / ¾oz de mantequilla sin sal, en cubos", "100 ml / 3½ flf oz de Arbequina u otro aceite de oliva fresco y herboso"], "method": ["Coloque las mejillas de res en un plato y cubra con vino, laurel, ajo y chalotes. Cubra y marinado en la nevera durante la noche o durante al menos 6 horas.", "Retire las mejillas de res y deje a un lado. Vierta el adobo en una cazuela y coloque a fuego medio. Llevar a ebullición y cocine a fuego lento hasta que el volumen del líquido se haya reducido en tres cuartas partes.", "Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Caliente el aceite en una sartén a fuego alto. Dore las mejillas de res durante 4 minutos por cada lado, o hasta que estén caramelizadas.", "Transfiera las mejillas al adobo reducido y vierta el caldo. Agregue la canela, los clavos de olor y la miel y deje que hierva. Cubra con una tapa y transfiéralo al horno por aproximadamente 2 horas. Limpia la superficie de vez en cuando para eliminar cualquier grasa.", "Agregue la ralladura y el membrillo y cocine durante 1 hora más o hasta que las mejillas y el membrillo estén suaves y tiernos. Condimentar con sal y pimienta.", "Mientras tanto, para hacer el puré, cocine las papas en agua ligeramente salada durante 20 minutos, o hasta que estén tiernas. Escurrir, luego pasar a través de un tamiz o molino de verduras.", "Suavemente caliente la crema en una cacerola, luego viértala en las papas. Agregue la mantequilla y el aceite de oliva Arbequina y mezcle bien. Condimentar con sal y pimienta.", "Para servir, divide las mejillas y el membrillo entre cuatro platos. Agregue una cucharada de puré y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_braised_beef_cheeks_with_54459", "title": "Mejillas de res cocidas con membrillo, laurel, canela y puré de aceite de oliva", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz de carne de res", "1 diente de ajo", "2 hojas de laurel", "2 ramitas de romero", "8 granos de pimienta negra", "1 cebolla grande, finamente picada", "3 zanahorias, finamente picadas", "2 tallos de apio, finamente picados", "1 botella de vino tinto", "90 ml / 6 cucharadas de aceite de oliva virgen extra", "sal al gusto"], "method": ["Paté suavemente la carne con papel de cocina para que se seque. Coloque en un tazón grande junto con todos los demás ingredientes a excepción del aceite y la sal. Cubra con clingfilm y deje marinar en la nevera durante la noche, o durante al menos 12 horas.", "Retire la carne del adobo, manteniendo el adobo para más tarde. Pat la carne seca con papel de cocina. Calentar el aceite en una cacerola grande, agregar la carne y sellar bien todo. Eliminar y reservar.", "En la misma sartén, agregue las verduras y las hierbas del adobo y sude por unos minutos. Regrese la carne a la sartén, agregue un poco de sal y cocine a fuego medio durante 10 minutos.", "Agregue el vino del adobo, lleve a ebullición, luego reduzca el fuego a bajo y cubra con una tapa. Cocine durante aproximadamente dos horas, hasta que la carne esté tierna y el líquido se haya reducido, controlando de vez en cuando y volteando suavemente durante la cocción. Una vez que la carne esté cocida a su gusto, retírela de la sartén y manténgala caliente. Si la salsa necesita espesarse continúe cocinando a fuego lento hasta que se haya reducido a la consistencia de la salsa.", "Para servir, cortar la carne y colocar en un plato para servir junto con las verduras y la salsa."], "url": "www_bbc_co_uk_food_recipes_braised_beef_in_red_wine_79613", "title": "Carne estofada en vino tinto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_beef_in_red_wine_79613_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cebollas blancas, en rodajas", "Grupa de ganado de 1.5kg / 3lb 5oz, cortada en rebanadas de 5cm / 2in", "2 hojas de laurel", "250 g / 9 oz de mantequilla sin sal, más extra para engrasar", "3 dientes de ajo, pelados y picados", "1-2 cucharaditas de vinagre de vino tinto", "6 cucharadas de aceite de oliva", "6 filetes de anchoa", "2 chiles rojos secos", "puñado de perejil flatleaf", "sal y pimienta negra recién molida", "1 calabacín amarillo, cortado en tiras con un pelador de verduras", "1 calabacín verde, cortado en tiras con un pelador de verduras", "4 flores de calabacín en rodajas", "1 zanahoria, cortada en tiras con un pelador de verduras", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de Jerez", "1 cucharada de albahaca, desgarrada", "1 cucharada de perejil picado", "2 cucharadas de hojas de capuchina"], "method": ["Precaliente el horno a 140C / 120C Fan / Gas 1 y engrase una cazuela con mantequilla.", "Para la pierna de vaca estofada, cubra la cazuela con cebollas y carne de res con puntos de mantequilla. Sazone con sal y pimienta entre las capas y deje caer las hojas de laurel. Cubra con la tapa y coloque en el horno durante 1-2 horas, o hasta que la carne esté muy tierna.", "Mientras tanto, ponga el ajo, el vinagre de vino tinto, el aceite, las anchoas, los chiles y el perejil en un procesador de alimentos y mezcle hasta obtener una pasta. Una vez que la carne esté cocida, agregue la pasta y revuelva.", "Coloque los calabacines, las flores de calabacín y las zanahorias en un tazón grande. Mezcle el aceite, el vinagre de jerez y la sal y la pimienta en un tazón pequeño. Justo antes de servir agregue la albahaca, el perejil y el aderezo a la ensalada y mezcle.", "Para servir, coloque la carne en un recipiente para servir poco profundo y coloque la ensalada de calabacín al lado. Adornar con las hojas de capuchina."], "url": "www_bbc_co_uk_food_recipes_braised_beef_rump_with_89208", "title": "Pierna de ternera estofada con cebolla, bahía, anchoas y chiles servidos con ensalada de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de estofado 250 g / 9 oz", "½ cebolla, más o menos picada", "1 diente de ajo, aplastado", "1 zanahoria pequeña, más o menos picada", "2 ramitas de tomillo", "1 hoja de laurel", "400ml / 14fl oz de caldo de carne", "sal y pimienta negra recién molida", "300g / 10½oz '00' harina de pasta, más extra para espolvorear", "4 huevos", "1 cucharada de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "1 diente de ajo, picado", "250 g / 9 oz de setas (rebozuelos, girolles, ceps, champiñones, morillas)", "3 cucharadas de Madeira", "500ml / 18fl oz de caldo de pollo oscuro", "300 ml / 10 fl oz doble crema", "puñado de hojas frescas de estragón, picadas", "2 cucharadas de hojas frescas de perifollo, para decorar"], "method": ["Para el relleno de carne estofada, precaliente el horno a 150 ° C / 130 ° C (ventilador) / Gas 2.", "Coloque todos los ingredientes en un plato con tapa para horno y cocine por 2-3 horas, o hasta que la carne esté tierna. Retire la carne del plato y triture en tiras pequeñas. Coloque en un tazón con un poco de licor de cocina y reserve.", "Ponga la harina, tres huevos y aceite de oliva en un procesador de alimentos y pulse hasta que se forme pequeñas migas. Incline la mezcla sobre una superficie de trabajo ligeramente enharinada y agréguela para formar una masa. Amasar ligeramente durante 2-3 minutos o hasta que quede suave y elástico. Ruede en una bola, envuélvala en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Ligeramente la harina de su máquina de pasta para evitar que la masa se pegue. Saca la bola de masa del refrigerador, aplástala ligeramente con un rodillo, luego comienza con la configuración más baja (más gruesa), pasa la masa por la máquina, gira el mango con una mano y sujeta la masa a medida que pasa por la máquina con el otro.", "Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes. Repita este proceso, enharinando la máquina y cambiando la configuración cada vez, hasta llegar a la configuración más delgada. Puede cortar la pasta en hojas individuales más pequeñas y trabajarlas individualmente, manteniendo la masa restante sin usar cubierta debajo de una película adhesiva para evitar que se seque.", "Batir el huevo restante en un recipiente. Recorta los círculos de las hojas de pasta con un cortador de pasteles de 6cm / 2½ pulgadas, luego cepilla cada círculo con el huevo batido. Coloque una cucharadita colmada del relleno de carne en la mitad del círculo, luego doble sobre la otra mitad y presione juntos para sellar. Junta las dos esquinas para crear un anillo y pellizca para sellar. Repita con la pasta restante y la mezcla de relleno, colocando los tortellini completados en una bandeja forrada con papel resistente a la grasa. Cubra con película adhesiva hasta que esté listo para cocinar.", "Para la salsa de champiñones, caliente la mantequilla en una sartén grande hasta que forme espuma. Agregue el ajo y cocine por 2-3 minutos. Agregue los champiñones y cocínelos durante 3-4 minutos, o hasta que estén dorados y se haya liberado el líquido de los champiñones. Vierta en el Madeira y cocine hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el caldo y vuelva a reducir a la mitad. Agregue la crema y el estragón y cocine a fuego lento durante 5-7 minutos.", "Para cocinar los tortellini, ponga a hervir un sartén grande de agua con sal, agregue los tortellini y cocínelos durante 1-2 minutos o hasta que floten en la superficie, luego retírelos con una espumadera y escurra.", "Coloque los tortellini en un tazón para servir y vierta sobre la salsa. Adorne con perifollo fresco."], "url": "www_bbc_co_uk_food_recipes_braised_beef_tortellini_29785", "title": "Tortellini de ternera estofado con salsa de setas silvestres", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]