[{"isVegetarian": true, "title": "Parkin with cider and golden syrup sauce", "url": "www_bbc_co_uk_food_recipes_parkin_with_cider_and_65702", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parkin_with_cider_and_65702_16x9.jpg", "ingredients": ["110g/4oz self-raising flour", "pinch salt", "2 tbsp ground ginger", "½ tsp ground nutmeg", "½ tsp mixed spice", "75g/2½oz oat flakes", "175g/6oz golden syrup", "50g/1¾oz black treacle", "110g/4oz unsalted butter", "110g/4oz soft brown sugar", "1 free-range egg, beaten", "2 tsp milk", "200g/7oz golden syrup", "50ml/2fl oz apple juice", "1 tsp mixed spice", "50ml/2fl oz cider", "ice cream, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the parkin, preheat the oven to 140C/275F/Gas 1 and butter a 20cm/8in square cake tin. ", "Sieve the flour, salt, ginger, nutmeg and mixed spice together into a large bowl. Mix in the oat flakes.", "Put the syrup, treacle, butter and sugar into a small saucepan and melt over a gentle heat. Bring up to a simmer but do not boil. When the butter and sugar have melted, pour into the flour mixture and stir to combine.", "Mix in the beaten egg and milk to create a soft, almost pouring consistency batter. ", "Pour into the buttered tin and bake for 50 minutes, or until firm in the centre. ", "Remove from the oven and leave to cool in the tin for 5-10 minutes before turning out and cutting into squares.", "For the sauce, place all the ingredients in a saucepan, bring to the boil and simmer until a syrup consistency is formed.", "Serve a square of parkin on each plate, then spoon over the syrup. Finish with a scoop of ice cream."]}, {"isVegetarian": false, "title": "Parma ham and spinach salad with croûtons and balsamic dressing", "url": "www_bbc_co_uk_food_recipes_parmahamandspinachsa_84882", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "3 slices parma ham", "4 thin slices ciabatta", "200g/7oz baby spinach, washed", "½ beef tomato, seeds removed, chopped", "1 tbsp chopped fresh chives", "1 tbsp balsamic vinegar", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, heat one tablespoon of the oil in a large non-stick frying pan and fry the parma ham for one minute on each side, or until golden-brown. Remove from the pan and drain on kitchen paper.", "In the same pan, heat the remaining oil, place the ciabatta slices into the pan and cook until golden-brown.", "Place the spinach and tomato into a large bowl. Place the dressing ingredients into a small bowl, mix together well and pour over the salad. Mix well to combine.", "Transfer the salad to a large plate and top with the croutons and parma ham."]}, {"isVegetarian": false, "title": "Parma ham, camembert and mozzarella pizza", "url": "www_bbc_co_uk_food_recipes_parmahamcamembertand_86322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour", "1 tsp salt", "30g/1oz fresh yeast", "200ml/7fl oz tepid water", "3-6 tbsp olive oil, plus extra for greasing", "25g/1oz butter", "400g/14oz baby spinach leaves", "2 garlic cloves, finely chopped", "salt and freshly ground black pepper ", "250g/9oz camembert, roughly chopped", "1 ball fresh buffalo mozzarella, torn into large pieces", "16 slices Parma ham", "4 tbsp double cream", "1 small bunch fresh coriander, chopped ", "75g/3oz Parma ham", "1 small ciabatta, cut into 2cm/1in cubes", "3 tbsp olive oil", "salt and freshly ground black pepper ", "50g/2oz mizuna leaves", "50g/2oz baby spinach leaves", "25g/1oz parmesan, shaved", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pizza, place the flour, salt and yeast into a large bowl and add the water and three tablespoons the olive oil and mix together to form a dough.", "Knead the dough for at least five minutes, until elastic. Add more oil if necessary.", "Cover the dough with cling film, then set aside and allow to prove for one hour.", "Divide the dough into four equal pieces and roll each piece into a ball, then roll out onto a floured work surface until about 5mm/¼in thick.", "Place onto a greased baking tray and set aside to prove for 30 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Heat a frying pan until hot and add the butter, spinach and garlic and stir-fry until the spinach has wilted down. Remove from the heat, allow to cool, then squeeze out any excess liquid. Season, to taste, with salt and freshly ground black pepper and divide among the four circles of dough.", "Place the camembert, mozzarella and the Parma ham on top of the spinach. Season well with salt and freshly ground black pepper.", "Place the pizzas into the oven to bake for ten minutes, then remove and spoon over the double cream and scatter over the coriander leaves. Return the pizzas to the oven for a further five minutes until the pizzas are cooked through.", "For the salad, place the Parma ham onto a baking tray and place into the oven for 3-4 minutes, or until crisp.", "Place the ciabatta cubes into a bowl and drizzle with the olive oil and season with salt and freshly ground black pepper. Place onto a separate baking tray and place into the oven to bake for five minutes, or until golden and crisp.", "Remove the ciabatta pieces from the oven place into a clean bowl with the mizuna and spinach leaves.", "Crumble the crisp Parma ham over and sprinkle with the parmesan.", "Add the lemon juice and toss once more.", "To serve, place a pizza onto each of four plates and place a small portion of salad alongside."]}, {"isVegetarian": false, "title": "Parma ham, red onion and gorgonzola tart", "url": "www_bbc_co_uk_food_recipes_parmahamredonionandg_86218", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 sheets ready-made filo pastry", "50g/2oz butter, melted", "1 tbsp olive oil", "½ red onion, thinly sliced", "2 slices parma ham, chopped", "75g/2½oz gorgonzola, cubed", "handful fresh basil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Brush the filo sheets with melted butter and then layer into a small tart tin on a baking sheet. Place in the oven and bake for five minutes, or until crisp and golden. Remove from the oven and set aside.", "Heat the olive oil in a frying pan, add the onion and fry for four minutes, then spoon into the prepared flan. Top with the parma ham, gorgonzola and basil and bake in the oven for six minutes, or until the cheese has melted.", "Slide onto a plate and serve."]}, {"isVegetarian": false, "title": "Parma ham and rocket rolls", "url": "www_bbc_co_uk_food_recipes_parmahamrocketrolls_78031", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz rocket leaves", "2 slices Parma ham", "1tbsp olive oil", "½ lemon, juiced", "3 sun-dried tomatoes", "salt and freshly ground black pepper, to taste"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Separate the rocket into two equal bunches.", "Lay the Parma ham slices flat on a clean surface.", "Wrap the rocket in the Parma ham.", "Drizzle over with the oil and lemon juice.", "To serve lay the wraps across each other in the centre of the plate. Place the tomatoes around and season to taste."]}, {"isVegetarian": false, "title": "Parmesan-stuffed sardines with tomato salad", "url": "www_bbc_co_uk_food_recipes_parmesan-stuffed_18531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium slices soft white bread, crusts cut off", "large splash milk\t", "large handful fresh basil", "large handful fresh flat-leaf parsley", "1 tbsp extra-virgin olive oil", "30g/1oz breadcrumbs", "20g/¾oz parmesan, freshly grated", "1 garlic clove, peeled, chopped", "salt and freshly ground black pepper", "4 tbsp extra virgin olive oil", "6 tbsp white wine vinegar", "salt and freshly ground black pepper", "8 small, vine-ripened tomatoes", "12 small or 8 large sardines, scaled, gutted, backbone removed, butterflied, heads attached (ask your fishmonger to do this for you)", "salt and freshly ground black pepper", "2 tbsp olive oil", "3 large handfuls rocket", "15-20 black olives, stones removed, halved", "small bunch fresh chives, cut into short lengths, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the stuffing, put the slices of bread into a bowl and pour over enough milk to completely wet them through. Place the wet bread into a fine sieve and set aside to drain for 4-5 hours, or preferably overnight, until the bread is moist but not wet. Squeeze out any excess milk before using.", "Once the bread has drained, prepare the tomatoes. Make a small cross in the bottom of each tomato using a sharp knife. Prepare a large pan of boiling water and a large bowl of iced water. Add the tomatoes to the boiling water and blanch for 1-2 minutes. Drain and immediately add them to the bowl of iced water. When the skins of the tomatoes have loosened, remove the tomatoes from the water and peel away the skins. Cut each skinned tomato into quarters and remove the seeds. ", "For the vinaigrette, whisk all of the vinaigrette ingredients together until well combined. Season, to taste, with salt and freshly ground black pepper.", "Sprinkle the quartered tomatoes with four tablespoons of the vinaigrette and set aside to marinate for at least 30 minutes.", "Continue with the stuffing: blend the basil and parsley in a food processor with the olive oil until the herbs are finely chopped. Add the breadcrumbs, soaked bread, parmesan and garlic and pulse until the mixture comes together as a paste. Season, to taste, with salt and freshly ground black pepper.", "To stuff the sardines begin by dividing the stuffing into 8 or 12 equal balls. ", "Place one filleted sardine onto a chopping, place one stuffing ball at the head end of the fish, and secure the fillets on either side of the stuffing ball using cocktail sticks so that the stuffing is inside the sardine. Smooth the stuffing that is still visible at the top and bottom of the fish using your fingertips. Repeat the process with the remaining sardines and stuffing balls.", "Season the sardines with a little salt and freshly ground black pepper.", "To cook the sardines, heat half of the olive oil in a large, non-stick frying pan over a medium to high heat. Fry half of the stuffed sardines until browned on one side, about 1–2 minutes. ", "Turn the fish over and fry for a further 1-2 minutes on the other side, or until the sardines are cooked through and golden-brown on both sides. Make sure the stuffing is heated through by inserting a sharp knife into the centre of the stuffing and testing the heat of the knife tip carefully with your fingertip. ", "Remove the sardines from the pan and set aside on a warm plate or in a warm oven.", "Repeat the frying process with the remaining oil and stuffed sardines. When cooked, gently remove the cocktail sticks from the sardines. ", "Just before serving, drizzle two tablespoons of the vinaigrette over the rocket leaves and combine to coat the leaves. Arrange the marinated tomato quarters and the olives alternately around the edge of each of four serving plates.", "To serve, place a handful of the dressed rocket into the centre of each of four serving plates. Divide the sardines equally among the four plates, stacking them on top of the rocket. Sprinkle with the chives. Spoon over the remaining vinaigrette."]}, {"isVegetarian": false, "title": "Parma ham-wrapped chicken with spicy pomegranate dip", "url": "www_bbc_co_uk_food_recipes_parmahamwrappedchick_85038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cooked chicken fillets", "2 slices parma ham", "½ pomegranate, seeds only", "2 tbsp caster sugar", "1 tbsp white wine vinegar", "pinch dried chilli flakes", "2 tsp vegetable oil", "1 tbsp water", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint", "fresh coriander, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the chicken, wrap the chicken fillets in the parma ham and place onto a baking sheet. Transfer to the oven and bake for five minutes, or until hot all the way through.", "To make the pomegranate dip, place the pomegranate seeds, sugar, vinegar, chilli flakes and oil into a small saucepan and simmer for 3-4 minutes. Remove from the heat, stir in the remaining dip ingredients and pour into a small dipping bowl.", "To serve, place the chicken fillets onto a serving plate with the dipping sauce alongside and garnish with coriander."]}, {"isVegetarian": false, "title": "Parmesan and poppy seed biscuits with a chorizo and red wine chutney", "url": "www_bbc_co_uk_food_recipes_parmesan_and_poppy_seed_32812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 stalk rosemary, leaves removed and chopped finely", "280g/10oz plain flour", "60g/2¼oz Parmesan, grated", "210g/7½oz unsalted butter, softened", "½ tsp salt", "black pepper", "3 tbsp poppy seeds", "1 red onion, chopped", "250g/9oz cooking chorizo, diced", "1 red chilli, seeds removed, finely chopped", "1½ tbsp tomato purée", "100ml/3½fl oz apple juice", "pinch salt and pepper", "pinch herbes de Provence", "5 tbsp red wine", "2½ tbsp dark brown sugar", "½ tsp balsamic vinegar"], "serves": "Makes 25-30 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Parmesan and poppy seed biscuits, using your hands, lightly work all the ingredients together (except the poppy seeds) into a dough. You can also pulse all the ingredients together in a food processor. Shape the dough into a log about 3cm/1¼in diameter.", "Gently spread out the poppy seeds on a chopping board and roll the dough log in the poppy seeds.Wrap in cling film and place in the fridge for at least 30 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Remove the dough from the fridge and slice into rounds the thickness of a pound coin. Press the edges gently with your fingers to create a dome in the middle.", "Lay the biscuits onto a baking tray lined with baking paper and leave in the fridge to chill for a further 20 minutes minimum. You may need two trays to fit all the biscuits.", "Bake in the preheated oven for 10-12 minutes, or until golden. Leave to cool.", "For the chorizo and red wine chutney, bring all the ingredient to a simmer over a medium heat. Cook until the liquid has evaporated and the chutney is a thick but spreadable consistency. ", "To serve, place the biscuits on a serving board and the chutney in a serving bowl on the side."]}, {"isVegetarian": true, "title": "Parmesan and poppy seed lollipops", "url": "www_bbc_co_uk_food_recipes_parmesan_and_poppy_seed_44968", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_and_poppy_seed_44968_16x9.jpg", "ingredients": ["butter, for greasing ", "80g/3oz parmesan, finely grated (or similar alternative vegetarian hard cheese)", "1 tsp poppy seeds ", "1 tsp sesame seeds "], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7, line two large baking trays with baking paper and grease them with butter.", "Toss the cheese and seeds together in a small bowl. Sit a 9cm/3½in chefs’ ring or cookie cutter on one of the baking trays and sprinkle a small handful of the cheese mixture into it, in a thin layer. Carefully lift the ring off to reveal a neat-edged disc of parmesan and lay a lollipop stick on top, with the tip of the stick touching the middle of the disc. ", "Repeat with the remaining cheese and sticks to make 10 in total (leaving about 3cm/1¼in spaces between them to allow for any spreading during cooking).", "You should have a little parmesan left over, so use it to cover up the part of the lollipop stick resting on the disc. ", "Bake in the oven for five minutes, swapping the lollipops to a different shelf halfway through. The cheese should be lightly golden-brown and bubbling. ", "Remove from the oven and slide the paper off the baking trays and onto a rack to help speed up cooling. Leave to cool for 1–2 minutes, or until the lollipops have become crisp. Very carefully remove each one with a palette knife. I like to serve these stuck upright into a box with holes in the top. "]}, {"isVegetarian": false, "title": "Parma ham wrapped mozzarella with plum chutney", "url": "www_bbc_co_uk_food_recipes_parma_ham_wrapped_91632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz caster sugar", "500g/1lb 2oz plums, stoned and roughly chopped", "1 onion, diced", "50ml/2fl oz malt vinegar", "1 star anise", "½ tsp ground cinnamon ", "salt and freshly ground black pepper", "8 slices Parma ham, cut in half lengthways", "4 balls buffalo mozzarella, drained and cut into quarters", "3 tbsp olive oil", "2 tsp sesame seeds", "8 slices ciabatta"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the plum chutney, heat a frying pan until hot, add the caster sugar and cook until melted and a light golden-brown colour.", "Add the chopped plums, onion, vinegar, star anise and cinnamon and cook for 5-8 minutes, or until the plums are tender and slightly pulpy.", "Season with a little salt and freshly ground black pepper and set aside to cool. If making in advance, store the chutney in an air-tight container in the fridge.", "For the mozzarella, wrap the slices of Parma ham around the mozzarella and set aside.", "Heat a large frying pan until hot, add one tablespoon of the olive oil and fry the parcels on each side until just crisp and the mozzarella is just starting to ooze.", "Sprinkle over the sesame seeds.", "Heat a griddle pan until searing hot, then drizzle the rest of the olive oil over the ciabatta and place onto the griddle.", "Char-grill on each side for 1-2 minutes, or until golden-brown. ", "To serve, spoon some chutney onto each of four plates, lay the wedges of mozzarella alongside and serve with the bread."]}, {"isVegetarian": true, "title": "Parmesan biscuits", "url": "www_bbc_co_uk_food_recipes_parmesan_biscuits_54963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_biscuits_54963_16x9.jpg", "ingredients": ["100g/3½ oz cold unsalted butter, cut into chunks", "100g/3½ oz plain flour, plus extra for flouring", "pinch salt", "pinch cayenne pepper", "1 heaped tsp mustard powder", "50g/1¾ oz  finely grated mature cheddar", "50g/1¾ oz finely grated parmesan, or similar vegetarian hard cheese, plus a little extra", "1 egg, beaten"], "serves": "Makes about 25-30 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the butter and flour into the bowl of a food processor with the salt, cayenne, mustard powder and cheeses. Process together to begin with, and then finely pulse the mixture in short spurts as you notice the mixture coming together - it will eventually bind without the need for egg or water. Wrap in cling film and leave to chill in the fridge for at least 30 minutes.", "Lightly flour a work surface and gently roll out the pastry to about the thickness of two pound coins. Cut out the biscuits to the size and shape you wish - anything between 3cm/1¼in and 5cm/2in, depending on the occasion. Lay them out on a greased baking tray about 2cm/¾in apart - it may take two lots of baking to use up the entire mixture.", "Carefully brush the surface of each biscuit with the egg and sprinkle over a little finely grated parmesan. Bake for 10 minutes, or until they are a gorgeous golden-brown colour; the superb smell will also inform you that they are ready.", "Carefully lift the biscuits off the tray using a palette knife and place on a rack to cool. Although the biscuits will keep well in a sealed container for a few days, I have never known this to happen!"]}, {"isVegetarian": false, "title": "Parmesan chicken with red cabbage and kale salad", "url": "www_bbc_co_uk_food_recipes_parmesan_chicken_with_95119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, skin removed", "130g/4½oz Parmesan, grated", "1 ball mozzarella, cut into 12 strips", "4 slices prosciutto or Parma ham, each cut into 3 strips", "75g/2¾oz plain flour", "4 free-range eggs", "70g/2½oz dried breadcrumbs", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 free-range egg yolk", "2 tsp Dijon mustard", "2 tsp red wine vinegar or raspberry vinegar", "2 tbsp vegetable oil", "1 small red cabbage, root removed, leaves very thinly sliced", "75g/2¾oz kale, stalked removed, leaves thinly sliced", "1 tsp cumin seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Cut a large pouch in each of the chicken breasts, using a small sharp knife.", "Divide 100g/3½oz of the Parmesan and the mozzarella into 4. Pile the Parmesan on top of the mozzarella and wrap each pile with the prosciutto pieces. Stuff each chicken breast with the prosciutto-wrapped cheese and press down the edges of the breast so the pouch is sealed (you can use a cocktail stick to help secure it).", "Sprinkle the flour onto a plate and season with salt and pepper. Beat the eggs in a bowl and sprinkle the breadcrumbs and remaining Parmesan on a separate plate. Dredge each cutlet in the flour, then dip into the eggs and coat in the cheese and breadcrumbs.", "Heat a frying pan until hot, add the olive oil and fry the chicken for 2-3 minutes on each side, or until golden-brown. Transfer to a roasting tray and roast in the oven for 15-20 minutes until cooked through. ", "Meanwhile for the salads, to make the dressing whisk the egg yolk, Dijon mustard, red wine vinegar and 250ml/9fl oz water together in a bowl until combined. Gradually whisk in 1 tablespoon of the vegetable oil, whisking all the time, until emulsified. Season with salt and pepper. Place the red cabbage into a large bowl, then pour over 100ml/3½fl oz of the dressing and mix well.", "Place the kale in a large bowl. Heat a small frying pan and add the remaining tablespoon of oil. Once hot add the cumin seeds. Once they start to jump remove from the heat and pour over the raw kale.", "Put the chicken on serving plates and place the red cabbage and kale salads alongside."]}, {"isVegetarian": false, "title": "Parmesan crusted chicken escalope with slow roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_parmesan_crusted_chicken_56186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tomatoes on the vine, halved widthways", "4 tbsp olive oil", "6 sprigs thyme, leaves picked", "salt and freshly ground black pepper", "60g/2½oz Japanese panko breadcrumbs", "25g/1oz parmesan cheese, freshly grated", "1 lemon, zest only", "4 chicken breasts, boneless and skinless", "75g/3oz plain flour", "2 free-range eggs, beaten", "50g/2oz butter", "1 bunch watercress, leaves picked", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 1.", "Place the tomatoes, cut side up onto a roasting tray and drizzle with the olive oil.", "Season with salt and black pepper then scatter half the thyme leaves over the top.", "Place in the oven and roast for 4-6 hours until slightly dried out. Turn the oven off and allow to cool, preferably overnight in the oven.", "For the chicken, place the breadcrumbs, parmesan, lemon zest and remaining thyme leaves into a food processor and blitz to fine crumbs.", "Butterfly the chicken breasts (Place the chicken onto what would have been the skin side, then cut down the centre line to half the way through. Turn the knife sideways and cut horizontally almost to the side of the breast to open it out, then repeat with the other side so you have a chicken breast, twice the size it was and half the thickness.)", "Season the flour with salt and black pepper then dust the chicken in the flour.", "Dip into the egg then into the breadcrumbs, making sure to coat each side thoroughly.", "Heat the olive oil and the butter in a large frying pan then add the chicken breasts, one at a time, and fry until golden-brown, about two minutes on each side. Place onto kitchen paper to drain.", "To serve, pile some tomatoes onto the plate, add the chicken and a handful of watercress then finish with a wedge of lemon."]}, {"isVegetarian": false, "title": "Parmesan French toast", "url": "www_bbc_co_uk_food_recipes_parmesan_french_toast_87497", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_french_toast_87497_16x9.jpg", "ingredients": ["1 large free-range egg ", "3 tbsp finely grated Parmesan ", "¼ tsp paprika ", "1 tsp Dijon mustard ", "½ tsp Worcestershire sauce ", "3 tbsp full-fat milk ", "2 slices white sourdough bread (see recipe tip)", "1 tbsp unsalted butter ", "½ tsp olive oil ", "flatleaf parsley, for sprinkling (optional)", "1 spring onion, thinly sliced, for garnishing (optional)"], "serves": "Serves 1–2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg, Parmesan, paprika, mustard, Worcestershire sauce and milk together in a shallow dish that the slices of bread will fit in. ", "Sit the bread in this mixture for about 2 minutes each side, pressing down on it every now and again. You want the slices to be soaked through and softened, but not falling to pieces. Spoon any remaining egg mixture over. ", "When the bread is soaked, warm the butter and oil in a frying pan over a medium heat. Once the butter is beginning to bubble, fry the bread for about 2 minutes each side – keep a good eye on it – until it is cooked through with patches of golden-brown on the surface. ", "Remove from the pan, and eat just as it is, or sprinkle with chopped parsley and thinly sliced spring onion, if desired."]}, {"isVegetarian": false, "title": "Parmesan roast parsnips and carrots", "url": "www_bbc_co_uk_food_recipes_parmesan_roast_parsnips_63627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7-8 carrots, peeled and trimmed", "7-8 parsnips, peeled and trimmed", "3 tbsp olive oil ", "30g/1oz Parmesan, grated", "salt and freshly ground black pepper"], "serves": "Serves 7-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Cut the carrots and parsnips in half lengthways and cut any particularly large pieces in half again. Bring a large saucepan of water to the boil and add the vegetables. Boil for 3 minutes, or until the vegetables are just beginning to soften (you want them to keep their shape while roasting).", "Drain well and divide between 2 roasting trays (if the tray is crowded the vegetables won’t crisp up as well). Add the oil and mix to coat the vegetables. Season with salt and pepper and top with the Parmesan. ", "Roast for 25 minutes or until the carrots and parsnips are golden-brown at the edges. "]}, {"isVegetarian": true, "title": "Parmesan shortbreads", "url": "www_bbc_co_uk_food_recipes_parmesan_shortbreads_86971", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_shortbreads_86971_16x9.jpg", "ingredients": ["150g/5½oz plain flour", "75g/2¾oz parmesan (or similar vegetarian hard cheese), grated", "100g/3½oz unsalted butter, softened", "1 free-range egg yolk"], "serves": "Makes 35-40", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together – using bowl and spoon, electric mixer or food processor as wished – until a golden dough begins to form a clump.", "Turn it out onto a surface and knead for about 30 seconds until smooth, then divide into two.", "Take the first half and, using your hands, roll it into a cylinder, as uniform as possible without stressing over it, about 3cm/1¼in diameter. Make sure the ends are flat, too, so that the cylinder resembles a roll of coins. Now wrap this up in a piece of cling film, twisting the cling film at the ends, like a Christmas cracker, and put the roll in the fridge, then proceed in the same way with the remaining half of the dough.", "Preheat the oven to 180C/375F/Gas 4 while the dough rests in the fridge for about 45 minutes, by which time you should be able to cut them into thick slices easily; aim for about 1cm, think fat pound coins or similar.", "Arrange on a baking sheet lined with baking parchment and put in the oven for 15-20 minutes, when they should be just beginning to turn a pale gold at the edges.", "Remove from the oven, then leave to cool (if you can) before eating."]}, {"isVegetarian": false, "title": "Parmesan and Parma ham crusted lamb chops with leek and mint purée", "url": "www_bbc_co_uk_food_recipes_parmesanandparmahamc_83101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz fresh white breadcrumbs", "50/2oz Parma ham, very finely chopped", "4 tbsp freshly grated Parmesan", "1 tbsp chopped fresh flatleaf parsley ", "salt and freshly ground black pepper", "4 boneless lamb chops or 8 lamb cutlets ", "1 free-range egg ", "4 tbsp light olive oil", "25g/1oz butter", "4 tbsp vegetable stock ", "4 leeks, finely sliced", "salt and freshly ground black pepper", "6 tbsp double cream", "2 tbsp fresh mint leaves (optional)", "1 tsp white pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the chops, tip the breadcrumbs into a bowl and mix in the Parma ham, parmesan and parsley. Season generously with freshly ground black pepper.  ", "Trim any excess fat off the chops or cutlets, then beat out a little bit with a meat tenderizer or a rolling pin (a frying pan would also do the job).", "Beat the egg in a separate dish and season generously with salt and freshly ground black pepper, then use to coat the chops or cutlets. ", "Cover with the breadcrumb mixture, ensuring they are evenly coated.  Leave to chill and set in the fridge for one hour. Remove half an hour before cooking to allow the meat to come back to room temperature.", "Heat the olive oil in a large heavy-based frying pan. Add the chops or cutlets and cook for 3-4 minutes each side for large chops and 1-2 minutes each side if using cutlets.  They should be crisp on the outside but still pink in the middle. Drain on kitchen towel.", "For the leek purée, bring the butter and stock to the boil in a pan with a lid until it thickens to form an emulsion.", "Add the leeks with a good pinch of salt, cover and cook for 3-4 minutes until just tender but still vibrant green in colour, shaking the pan occasionally and stirring once or twice. ", "Transfer to a food processor or liquidiser, then add the cream and mint (if using) with the white pepper. ", "Blend to a smooth purée and season to taste with salt and freshly ground black pepper. Transfer to a clean pan.", "Gently reheat the leek purée and divide among warmed serving plates. Arrange a crisp chop on top of each one to serve."]}, {"isVegetarian": true, "title": "Parmesan biscuits", "url": "www_bbc_co_uk_food_recipes_parmesanbiscuits_609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz chilled butter, cubed", "125g/4½oz plain flour", "25g/1oz freshly grated parmesan (or vegetarian alternative)", "salt and freshly ground black pepper", "pinch cayenne pepper"], "serves": "Makes 30 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Rub the butter into the flour, by hand or in a food processor, until the mixture looks like fine breadcrumbs.", "Stir in the parmesan, seasoning and cayenne pepper.", "Work the mixture together into a ball and then knead briefly on a work surface lightly dusted with flour until smooth.", "Cut the dough in half, flatten each piece slightly, then roll out thinly between 2 large sheets of cling film.", "Lift off the top piece of cling film and cut into 5cm/2in biscuits. ", "Carefully lift them onto a lightly buttered baking sheet, then knead together and re-roll the trimmings to make more biscuits. You should make about 30 biscuits in total.", "Bake the biscuits for 8-10 minutes until crisp and golden. Leave to cool on the baking sheets. Store in an airtight tin."]}, {"isVegetarian": false, "title": "Parmesan-crusted halibut, sag aloo and lime emulsion", "url": "www_bbc_co_uk_food_recipes_parmesancrustedhalib_91767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz parmesan, finely grated", "½ tsp mild Madras curry powder", "¼ tsp garam masala", "¼ tsp ground turmeric", "½ tsp sea salt flakes", "500g/1lb halibut fillet, cut into 16 equal-sized cubes ", "2 limes, juice and zest, plus 1 lime, juice only", "25g/1oz butter", "25g/1oz sugar", "2 tbsp vegetable oil", "1 banana shallot, finely chopped", "1 garlic clove, grated", "1 heaped tsp garam masala", "1 heaped tsp mild Madras curry powder", "¼ tsp ground turmeric", "500g/1lb 2oz new potatoes, cut into quarters, boiled for 8-10 minutes until just tender", "50g/2oz baby spinach leaves", "salt, to taste", "1 x 20g/¾oz punnet coriander cress, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the parmesan-crusted halibut, in a bowl, mix together the parmesan, curry powder, garam masala, turmeric and salt until well combined.", "Dredge one side of each cube of halibut in the parmesan mixture until thickly coated. ", "Heat a heavy, non-stick frying pan over a low to medium heat. When the pan is warm, add the halibut cubes, parmesan-coated sides down, and dry fry for 4-5 minutes, or until the parmesan crusts are crisp and golden-brown.", "Season the halibut cubes, to taste, with salt, then turn them over and remove the pan from the heat. (NB: The residual heat from the pan will cook the other sides of the halibut cubes.) ", "For the lime emulsion, immediately add all of the lime emulsion ingredients to the pan containing the halibut cubes and set aside for 2-3 minutes.", "Meanwhile, for the sag aloo, heat the oil in a large frying pan over a high heat. Add the shallot and garlic and cook for 2-3 minutes, or until softened.", "Add the spices and continue to fry for 1-2 minutes, or until fragrant. ", "Add the cooked new potatoes and continue to cook for a further minute, or until warmed through. ", "Remove the pan from the heat and add the baby spinach. Stir well until the spinach has wilted, then season, to taste, with salt.", "To serve, divide the sag aloo equally among each of four serving plates. Place four cubes of parmesan-crusted halibut on top of each portion of sag aloo. Transfer the lime emulsion mixture from the pan to a bowl and whisk until well combined, then drizzle it over the halibut cubes and around the edge of the plates. Garnish with the coriander cress."]}, {"isVegetarian": false, "title": "Parmesan-crusted passata mussels", "url": "www_bbc_co_uk_food_recipes_parmesancrustedpassa_90478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz live mussels, debearded, cleaned and rinsed", "2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "175ml/6fl oz white wine", "2 tbsp olive oil", "¼ onion, finely chopped", "2 tomatoes, seeds removed and chopped", "1 tbsp tomato purée", "100ml/3½fl oz white wine", "6 fresh basil leaves, torn", "55g/2oz parmesan, grated", "crusty white bread"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the mussels, tap the mussels against a hard surface and discard any that do not close. ", "Heat the oil in a pan and gently fry the onions and garlic for 5-6 minutes, or until softened. Pour in the white wine and bring to a simmer, then add the mussels and cover with a lid for 4-5 minutes, or until the mussels have opened. Strain through a sieve, reserving the cooking liquor and discarding any unopened mussels. ", "For the passata sauce, heat the oil in a pan and gently fry the onions for 3-4 minutes, or until softened. Add the tomatoes, tomato purée and wine. Measure out 100ml/3½fl oz of the mussel cooking liquor and add to the passata. Cook for a further 3-4 minutes, then stir in the basil and cooked mussels.", "Spoon the mussels into a gratin dish, sprinkle over the parmesan and bake for 4-5 minutes, or until golden-brown and bubbling on top. Serve with crusty white bread."]}, {"isVegetarian": false, "title": "Parmesan-crusted pork chops with roasted red peppers", "url": "www_bbc_co_uk_food_recipes_parmesancrustedporkc_74758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 red peppers, cut into thin strips", "1 tbsp parsley, roughly chopped", "2 tbsp extra virgin olive oil", "60g/2¼oz fresh breadcrumbs", "30g/1¼oz parmesan cheese", "4 x 100g/3½oz escalopes of pork", "25g/1oz plain flour", "3 free-range eggs, beaten", "1 tbsp olive oil", "30g/1¼oz butter", "50g/1¾oz extra fine capers ", "1 lemon, segmented ", "4 large baking potatoes (peeled, diced and boiled)", "6 leaves savoy cabbage (blanched, refreshed and cut into strips)", "3 spring onions, finely chopped ", "200ml/7¼fl oz milk", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To roast the red peppers, preheat oven to 220C/430F/Gas 7. ", "Place the red peppers in a hot pan with a little olive oil and warm over a low heat. ", "Once they are warm, place them in the hot oven and turn every five minutes for 15-20 minutes.", "Remove peppers, place in a bowl and cover with cling film for approximately 20 minutes. This will make them easy to peel.", "Once the peppers are cool, remove the skin and seeds and cut them into strips. ", "Mix together the extra virgin olive oil and parsley and warm gently on stove while you cook the escalopes.", "For the potatoes, place the potatoes, savoy cabbage and spring onions in a small saucepan.", "Warm gently and slowly add milk as required. ", "Season and keep warm. ", "For the pork, mix the breadcrumbs and the parmesan together in a small bowl.", "Dip the pork escalopes into flour, then into the beaten egg and finally into the parmesan and breadcrumbs. ", "In a large non-stick frying pan, cook the pork escalopes over a medium heat in the olive oil and butter, until golden brown.", "Turn pork escalopes and cook on the other side, turning as necessary until thoroughly cooked.", "Transfer the pork onto kitchen paper and drain. ", "Return to the pan and add the warmed oil and parsley and the lemon segments and capers.", "To serve, place a pile of the peppers on each plate and place a pork escalope on top of the peppers. ", "Drizzle a little of the capers, lemon and butter mixture around the plate to serve."]}, {"isVegetarian": false, "title": "Parmesan crusted salmon", "url": "www_bbc_co_uk_food_recipes_parmesancrustedsalmo_77131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1¼oz breadcrumbs", "30g/1¼oz parmesan cheese", "handful fresh parsley, chopped", "2 garlic cloves, crushed", "150g/5¼oz salmon steak", "150g/5¼oz broccoli, cut into florets"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the breadcrumbs, cheese, parsley and garlic in a food processor and blend until combined. The mixture should form fine crumbs.", "Coat the top of the salmon with the crumbs and bake in the oven for ten minutes or until the salmon is cooked through and the crumb is golden and crisp.", "Meanwhile, boil a saucepan full of salted water and drop in the broccoli.", "Cook the broccoli for four minutes or until just tender. Drain.", "Serve on a plate topped with the salmon."]}, {"isVegetarian": false, "title": "Parmesan gnocchi with tomato and basil sauce and pan-fried lemon sole", "url": "www_bbc_co_uk_food_recipes_parmesangnocchiwitht_87581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp extra virgin olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "500g/1lb 2oz fresh tomatoes, roughly chopped", "400g/14 oz can chopped tomatoes", "1 tbsp sun-dried tomato paste", "12 basil leaves", "salt and freshly ground black pepper ", "600g/1lb 5oz King Edward potatoes, peeled and cut into chunks", "pinch salt", "110g/4oz plain flour", "75g/3oz parmesan cheese, finely grated", "3 tbsp olive oil", "salt and freshly ground black pepper ", "2 fillets lemon sole, skinned and split lengthways into 2", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato sauce, heat a large pan until hot and add the olive oil, onion and garlic and fry for 4-5 minutes until softened. ", "Add the fresh tomatoes, canned tomatoes and sun-dried tomato paste and bring to the boil.", "Reduce the heat and simmer for 10-15 minutes.", "Halfway through the cooking time, add the basil leaves. ", "Season with salt and freshly ground black pepper to taste. Leave to cool slightly before transferring to a food processor or blender. Blend until smooth and set aside.", "For the gnocchi, place the potatoes into a pan and cover with water. Add a pinch of salt and bring to the boil.", "Simmer for 10-15 minutes or until the potatoes are tender.", "Drain and return to the pan then place back over a low heat for a few seconds to remove any excess moisture.", "Pass the boiled potato through a potato ricer or sieve into a mixing bowl to make a very fine mash.", "Add the flour, parmesan and one tablespoon of the olive oil and beat together until smooth. Season with salt and freshly ground black pepper.", "Place a large nozzle into a piping bag and then add the potato dough to the bag.", "Bring a large pan of water to the boil. Take the bag of dough and hold it above the boiling water. As you squeeze the back of the bag with your right hand, hold a small sharp knife in your left hand and cut off 2.5cm/1in lengths of dough, allowing the gnocchi to drop into the pot. Pipe in about 12 gnocchi per batch. ", "The gnocchi will sink when it hits the water. As soon as it floats to the top, poach for a further 1-2 minutes.", "Remove the gnocchi from the water with a slotted spoon and drain on kitchen paper. Repeat the process with any remaining dough.", "Heat a frying pan until hot then add the remaining olive oil. Add the gnocchi and fry until golden-brown. Set the pan aside in a warm place.", "For the lemon sole, season the sole with salt and freshly ground black pepper.", "Heat a frying pan until hot and add the olive oil.", "Add the lemon sole to the pan and cook for 2-3 minutes until golden-brown.", "Carefully turn the lemon sole and cook for a further minute on the other side.", "To serve, add the tomato sauce to the gnocchi pan, enough to just coat the gnocchi, and heat slightly.", "Spoon the gnocchi into the centre of each of four plates and top each with half a fillet of lemon sole. Serve at once."]}, {"isVegetarian": true, "title": "Parmesan polenta crostini with caramelised onions", "url": "www_bbc_co_uk_food_recipes_parmesanpolentacrost_82322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["190g/7oz instant quick cook polenta", "750ml/1 pint 7fl oz boiling water mixed with 3 tsp vegetable stock powder", "75g/3oz Parmesan (or a similar vegetarian hard cheese), grated", "salt and freshly ground black pepper", "2 large red onions, peeled and thinly sliced", "2 tbsp olive oil", "2 tsp fresh thyme leaves, plus extra for garnishing", "2 tbsp balsamic vinegar", "1 tbsp brown sugar", "160g/5oz Taleggio cheese (or a vegetarian alternative), cut into cubes"], "serves": "Makes 20 canapés", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the stock to the boil in a large pan.  Gradually add the polenta in a thin stream, whisking continuously. Reduce the heat to medium and stir with a wooden spoon until the polenta is very thick (this should take about four minutes).  ", "Remove from the heat, stir in the Parmesan and season well with salt and freshly ground black pepper.  You should season generously as the flavour tends to become less strong as the polenta cools.  Using a palette knife spread the polenta onto an oiled baking tray to a thickness of about 1cm/0.5in. When cool, place the baking tray in the fridge for about one hour for the polenta to firm up.  You can place the baking tray in the freezer before you spread out the polenta to speed up the cooling process. The cheesy polenta base can be made up to three days in advance.", "For the onion topping, sauté the onions in the olive oil together with the fresh thyme leaves in a large frying pan over a low heat for about 30 minutes, or until softened. ", "Add the balsamic vinegar and brown sugar.  Turn up the heat to medium and cook for about five minutes or until the vinegar has evaporated.  Season with salt and freshly ground black pepper.", "Heat the grill. Cut out 20 circles from the polenta using a 5cm fluted pastry cutter and place these on two oiled baking sheets.", "Spoon about one teaspoon of the red onion mixture on top of each polenta base and arrange the cubes of Taleggio on top.  ", "Place under the grill for 3-4 minutes until the cheese has melted and is turning golden brown.  Transfer onto serving plates and decorate with sprigs of thyme."]}, {"isVegetarian": false, "title": "Mini parmesan, mascarpone and cranberry scones", "url": "www_bbc_co_uk_food_recipes_parmesansconeswithma_92587", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesansconeswithma_92587_16x9.jpg", "ingredients": ["200g/7¼oz self-raising flour, sifted with 1 tsp salt, plus extra for dusting", "50g/1¾oz parmesan, grated", "50g/1¾oz caster sugar ", "2 tsp baking powder ", "50g/1¾oz butter", "125ml/4½fl oz tepid milk, plus extra for glazing", "110g/4oz dried cranberries (reserve 24 cranberries for garnish)", "250g/8¾oz tub mascarpone", "24 small fresh basil leaves"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the parmesan scones, place all of the scone ingredients, apart from the milk and cranberries, into a bowl. Work the ingredients together with your fingertips until the mixture resembles breadcrumbs. ", "Add the dried cranberries and the milk, a bit at a time (you may not need all of the milk). Using floured hands, knead the mixture into dough and place on a floured work surface. Roll out to a thickness of about 1cm/½in. Using a cutter, cut into 5cm/2in rounds and place on a baking tray lined with greaseproof paper. Brush with a little milk (you can also use beaten egg).", "Transfer to the oven and bake for 15 minutes, or until risen and golden-brown. Transfer to a wire rack and leave to cool", "To serve, spread a thin layer of mascarpone on the top of each scone and top with a small basil leaf. Using a piping bag with a star-shaped nozzle, pipe a swirl of mascarpone on top of the basil leaf. Decorate with a cranberry."]}, {"isVegetarian": false, "title": "Parsee-style lamb cutlet served with tomato gravy and salad", "url": "www_bbc_co_uk_food_recipes_parsee-style_lamb_cutlet_13755", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 6-bone rack of lamb, each cut into 3-bone pieces", "1 tsp crushed ginger", "1 tsp crushed garlic", "1 tsp ground cumin", "1½ tsp ground coriander", "½ tsp ground turmeric", "½ tsp garam masala", "2 tbsp sunflower or rapeseed oil", "½ lime, juice only", "pinch salt", "4-5 large Maris Piper potatoes, peeled and cut into cubes 0.5cm/¼in thick", "1 tsp butter", "1 tsp cumin seeds", "2 garlic cloves, finely chopped", "1 heaped tbsp chopped fresh coriander leaves", "110g/4oz plain flour", "3-4 free-range eggs, beaten", "200g/7oz breadcrumbs", "vegetable oil, for frying", "500g/1lb 2oz tomatoes, roughly chopped", "25g/1oz butter", "1 tbsp sunflower or rapeseed oil ", "2-3 large red chillies, seeds removed, cut into 2-3 pieces", "3 garlic cloves, chopped", "7.5-10cm/3-4in piece cassia bark (or cinnamon stick)", "250g/9oz red onion, finely chopped", "2 tbsp malt vinegar", "2 tbsp raw cane sugar or jaggery", "1 tbsp tamarind paste", "pinch salt", "2 tbsp ready-made mango chutney relish with mint", "½ lime, juice only", "1 tbsp vegetable oil", "pinch salt", "½ cucumber, diced", "1 beef tomato, seeds removed, finely diced", "1 medium green chilli, finely chopped", "1 small banana shallot, finely sliced", "1 lettuce, leaves finely chopped", "1 tbsp chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, remove the two outer bones from each 3-bone rack of lamb, leaving only the centre bone on each piece of meat.", "Flatten the lamb cutlets between two sheets of cling film using a meat mallet or rolling pin. ", "Scrape all the meaty bits off the top of the bones with the back of your knife.", "Mix the ginger, garlic, ground cumin, coriander, turmeric, garam masala, sunflower (or rapeseed) oil, lime juice and salt together in a bowl, then rub the mixture all over the cutlets.", "Cover the cutlets and chill in the refrigerator overnight, or for at least a few hours, to marinate.", "When the cutlets have marinated, shake off any excess marinade.", "Heat a heavy-based non-stick frying pan over a medium to high heat. When the pan is hot, add the marinated lamb chops and fry quickly until browned all over. (Be careful not to burn the spices in the marinade.)", "Remove the cutlets from the pan and place onto a plate lined with kitchen paper. Set aside for 30-40 minutes to cool.", "Meanwhile, bring a pan of salted water to the boil, then add the potatoes. Return to a simmer and cook for 5-8 minutes, or until tender. Drain off the water and return the potatoes to the pan. Return to the heat briefly to drive off any excess moisture. As the potatoes cook, crush them lightly with a wooden spoon. Mash the potatoes with a masher or ricer until smooth. Set aside.", "Heat a frying pan over a medium heat, then add the butter, cumin seeds and garlic and fry for 1-2 minutes, or until the garlic has softened. Add the mixture to the mashed potatoes along with the coriander leaves and mix well. Set aside. ", "For the tomato gravy, blend the tomatoes to a pulp in a food processor. ", "Heat a frying pan over a medium heat. Add the butter and oil. When the butter is foaming, add the chillies, garlic and cassia bark (or cinnamon stick) and fry for 1-2 minutes, or until the garlic is golden-brown.", "Add the red onions and fry for a further 3-4 minutes, or until softened.", "Add the tomato pulp and bring the mixture to the boil. Simmer for 3-4 minutes, or until the mixture has thickened slightly, then add the vinegar, sugar and tamarind paste and reduce the heat until the mixture is simmering. Simmer until the mixture has thickened to a rich sauce.", "Remove the cassia bark (or cinnamon stick), then return the sauce to the food processor and blend to a purée. Season, to taste, with salt and freshly ground black pepper. Keep warm. ", "When the lamb cutlets have cooled, cover each one all over in a 1.5cm/½in layer of the spiced mashed potato.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto a separate plate.", "Dredge each lamb and potato cutlet in the flour, dusting off any excess. Then dip them in the beaten egg and finally roll them in the breadcrumbs.", "Heat 5cm/2in of the oil in a deep-sided, heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous; do not leave unattended.) Fry the coated cutlets until browned on both sides and cooked through, about 6-8 minutes in total. Remove from the pan and set aside to drain on kitchen paper. Keep warm.", "For the salad, whisk the mango chutney, lime juice, oil and salt together until well combined, then mix with the rest of the ingredients. ", "To serve, pile some salad onto each of four serving plates. Rest one lamb cutlet alongside each portion of salad, then spoon over the tomato gravy."]}, {"isVegetarian": true, "title": "Parnsip rosti", "url": "www_bbc_co_uk_food_recipes_parnsip_rosti_83149", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parnsip_rosti_83149_16x9.jpg", "ingredients": ["300g/10½oz parsnips, grated", "300g/10½oz sweet potatoes, grated ", "pinch dried chilli flakes", "1 small bunch fresh coriander, leaves reserved, stalks finely chopped ", "1 garlic clove, crushed", "½ tsp ground coriander ", "½ tsp ground cumin", "1 tsp black onion seeds ", "1–2 tbsp plain flour", "1 medium free-range egg, beaten", "4 tbsp olive oil", "150g/5½oz Greek-style yoghurt", "harissa paste, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients, apart from the oil, yoghurt and harissa, in a large bowl and mix to combine. The mixture should hold together. It it doesn't, add an extra tablespoon of flour. Using your hands, divide the mixture into four and shape into 8cm/3¼in flat rounds.", "Place a large frying pan over a medium heat, add the oil and fry each rosti on both sides until golden and crisp. The rostis will probably need to be cooked in batches. If so, place the cooked rosti on a plate lined with kitchen paper and keep warm in an oven on a low temperature until ready to serve.", "Mix the yoghurt and harissa in a small bowl.", "To serve, put the rosti on serving plates and spoon the harissa yoghurt over the top."]}, {"isVegetarian": false, "title": "Parsee fish in banana leaf with egg and peanut salad", "url": "www_bbc_co_uk_food_recipes_parseefishinbananale_90849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp salt", "½ tsp ground turmeric", "4 grey mullet, head and backbone removed (ask your fishmonger to do this)", "1 fresh coconut, flesh grated (or 200g/7oz desiccated coconut, soaked in water and squeezed dry)", "2 large bunches fresh coriander, leaves only", "4-5 long green chillies", "6-8 garlic cloves", "7.5cm/3in piece fresh ginger, peeled and roughly chopped", "1 heaped tsp cumin seeds, toasted", "1 tbsp caster sugar", "1-2 limes, juice only", "1 large bunch fresh mint, leaves only", "3-4 tbsp water, as necessary", "4 banana leaves, trimmed, any hard stem removed (available from some Asian grocers, sometimes frozen)", "4 tbsp malt vinegar", "5 free-range eggs, hard boiled, cooled, peeled", "6 tbsp freshly grated coconut (or desiccated coconut, soaked in water and squeezed dry)", "1-2 large green chillies, trimmed, finely chopped", "2 tbsp chopped fresh coriander", "1 tbsp tamarind pulp (or 1½ tsp tamarind concentrate, available from Asian grocers)", "3-4 tbsp chopped roasted peanuts", "1 tbsp chopped shallots", "2 tbsp chopped fresh tomatoes", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Parsee fish, preheat the oven to 190C/375F/Gas 5.", "In a bowl, mix together the salt and ground turmeric until well combined, then rub the spice mixture into the fish.", "Blend the grated coconut, coriander, chillies, garlic, ginger, cumin seeds, sugar, lime juice and mint to a paste in a food processor. If necessary, gradually add enough water, a tablespoon at a time, to loosen the mixture.", "Rub the paste all over each seasoned grey mullet, both on the outside skin of the fish and inside the belly cavities.", "Pass one side of each of the banana leaves over the flame of a gas cooker (5-10 seconds is sufficient) to soften the leaves. Alternatively, soften the leaves using a chefs' blow torch. ", "Place one piece of fish into the centre of each banana leaf. Fold the leaves over to make four parcels. Tie each parcel securely with string.", "Place the banana leaf parcels into a roasting tray. Sprinkle over the malt vinegar and a few drops of cold water. Bake in the oven for 15-20 minutes.", "For the egg and peanut salad, cut each of the hard-boiled eggs in half. Remove the yolks from the whites. Crumble the yolks, then finely chop the whites.", "In a bowl, mix together the diced egg whites, crumbled egg yolks and the remaining egg and peanut salad ingredients. Season, to taste, with salt and freshly ground black pepper.", "To serve, place one banana leaf parcel into the centre of each of four serving plates. Remove the string from the banana leaf parcels and open them up. Serve a portion of the egg and peanut salad alongside each Parsee fish portion, inside the banana leaf."]}, {"isVegetarian": false, "title": "Parsley and asparagus soup with poached egg and pork scratchings", "url": "www_bbc_co_uk_food_recipes_parsley_and_asparagus_39884", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "2 shallots, chopped", "2 sprigs fresh thyme", "600ml/20fl oz vegetable stock ", "300g/10½oz asparagus, stalks roughly chopped, tips set aside ", "115g/4oz flatleaf parsley, leaves picked", "50g/2oz watercress", "1 tbsp olive oil", "115g/4oz pork rind, patted dry and cut into small pieces", "115g/4oz streaky bacon, cut into small lardons", "1 tbsp white wine vinegar", "4 free-range eggs", "2 tbsp parsley cress", "2 tbsp watercress cress"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, fry the butter, shallots and thyme in a medium saucepan for two minutes.", "Add the vegetable stock and bring to the boil.", "Add the asparagus stalks, reserving the tips, and cook for a minute.", "Add the parsley and watercress and simmer for two minutes, until the asparagus is just tender.", "Remove from the heat and blend with a hand blender, or allow to cool for 3-4 minutes and place into a food blender. Blend the soup until smooth.", "Return the soup to the hob over a medium heat and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, bring a pan of salted water to the boil, add the asparagus tips and simmer for 2-3 minutes until just tender.", "Drain the asparagus tips and mix with a little olive oil, salt and black pepper.", "For the garnish, preheat a deep fat fryer to 160C/325F, or alternatively heat vegetable oil in a deep sided, heavy based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the dried pieces of pork rind into the fat fryer and cook for 2-3 minutes until golden-brown and puffed. Lift out with a slotted spoon and set aside on a plate.", "Increase the temperature of the fat fryer to 190C/375F.", "Return the pork rind to the fat fryer and fry for another 2-3 minutes until crisp. Lift out with a slotted spoon and drain onto kitchen paper. Sprinkle with salt.", "In aa frying pan, fry the bacon until brown and crisp, then set aside onto kitchen paper to drain. ", "Bring a small pan of water to a gentle simmer then add the vinegar.", "Stir the simmering water vigorously to create a vortex, then carefully crack two of the eggs into the water. Poach for 2-3 minutes, or until the eggs are cooked to your liking, then carefully remove from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "Repeat the poaching process with the remaining two eggs.", "Alternatively, if using later, drop the poached eggs straight into iced water and chill in the fridge until ready to use. Bring a pan of water to the boil, then add the poached eggs and cook for a minute just to heat through. Drain onto kitchen paper.", "To serve, lay the asparagus tips into the centre of the soup plate then nestle the poached egg in the centre of the pile. Ladle in the soup around the edge then scatter over the pork scratchings and bacon. Finish by scattering the parsley and watercress cress over the top."]}, {"isVegetarian": false, "title": "Parsley and pea soup with smoked salmon fish cakes", "url": "www_bbc_co_uk_food_recipes_parsley_and_pea_soup_58491", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 shallot, chopped", "2-3 garlic cloves, finely chopped", "500g/1lb 2oz flatleaf parsley, roughly chopped", "400g/14oz frozen peas", "1 litre/1¾ pints hot vegetable stock (or water)", "50ml/2fl oz double cream", "25ml/1fl oz olive oil", "handful of pea shoots, to serve", "oil, for deep-fat frying", "225g/8oz floury potatoes, peeled and cut into chunks", "40g/1½oz butter", "6 spring onions, thinly sliced", "1 tbsp chopped flatleaf parsley", "1 lemon, zest and juice", "salt and freshly ground black pepper", "375g/13oz smoked salmon, diced", "110g/4oz plain flour", "2 free-range eggs, beaten", "110g/4oz panko breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsley and pea soup, heat the butter in a frying pan over a medium heat. Add the shallot and garlic and fry gently for about 3-4 minutes, or until softened. ", "Add the parsley, peas and hot stock (or water), bring the mixture to the boil, then reduce the heat until the mixture is simmering and continue to simmer for three minutes, or until the peas are bright green and just tender.", "Place in a blender and blend until smooth.", "For the smoked salmon fish cakes, heat a deep-fat fryer to 180C/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Boil the potatoes in a pan of boiling water for 12-18 minutes, or until tender. Drain and return the pan to the heat for one minute to drive off any excess moisture. Mash the potatoes, or pass through a potato ricer into a bowl. Set aside to cool slightly.", "Melt the butter in a frying pan and fry the spring onions for 2-3 minutes, or until just softened.", "Stir the spring onions, parsley, lemon zest and juice into the potatoes and stir until well combined.", "Season with plenty of salt and freshly ground black pepper, then add the salmon and carefully fold together.", "Divide the mixture into 16 small fishcakes, each one the size of a thumb nail.", "Put the flour, beaten egg and panko breadcrumbs into three separate bowls.", "Coat the fish cakes in the flour, then beaten egg and finally in the breadcrumbs. Deep fry them (in batches if necessary) for 1-2 minutes, or until golden-brown.", "Remove from the fryer and place on kitchen paper to drain away any excess fat.", "To serve, pour the soup into shallow bowls and place the fish cakes in the centre. Garnish with the pea shoots and drizzle with cream and olive oil."]}, {"isVegetarian": true, "title": "Parsley pesto", "url": "www_bbc_co_uk_food_recipes_parsleypestowithpota_11633", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz flatleaf parsley leaves (no stalks)", "1-2 garlic cloves, crushed", "40g/1½oz freshly grated parmesan", "30g/1oz pine nuts", "75ml/2½fl oz extra virgin olive oil", "salt"], "serves": "Makes 1 portion", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients except the oil and salt into the food processor.  Whiz for a second or two, add the oil and a little salt.  Taste and correct seasoning."]}, {"isVegetarian": true, "title": "Parsley sauce", "url": "www_bbc_co_uk_food_recipes_parsleysauce_1300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "25g/1oz plain flour", "600ml/1 pint milk", "salt and white pepper", "2 tbsp parsley, freshly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan. ", "Stir in the flour and cook for 1-2 minutes.", "Take the pan off the heat and gradually stir in the milk to get a smooth sauce. Return to the heat and, stirring all the time, bring to the boil. ", "Simmer gently for 8-10 minutes and season with salt and white pepper.", "Stir in the parsley and serve."]}, {"isVegetarian": true, "title": "Parsley, tomato and bulgar wheat salad", "url": "www_bbc_co_uk_food_recipes_parsleytomatoandburg_73147", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsleytomatoandburg_73147_16x9.jpg", "ingredients": ["30g/1¼oz fine bulgar wheat", "600g/1lb 5¼oz firm ripe tomatoes, diced into small cubes, 0.5cm/¼in square", "½ bunch spring onions, trimmed and very thinly sliced", "2 bunches flatleaf parsley, (about 400g/14lb¼oz on the stalk), very finely chopped", "small bunch mint, (about 70g/2½oz on the stalk), leaves only, very finely chopped", "¼ tsp ground cinnamon ", "½ tsp ground allspice", "½ tsp finely ground black pepper", "salt ", "1 lemon, juice only", "5 tbsp extra virgin olive oil", "4 Little Gem lettuces, washed and quartered (or fresh tender vine leaves or white cabbage leaves, washed and dried)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Rinse the bulgar wheat in several changes of cold water, drain well and put in a large salad bowl.Spread the diced tomatoes and their juice over the bulgar then add the sliced onions.  Put the chopped parsley over the spring onions, looking out for big pieces, if there are any, take them out and chop them finely. Add the chopped mint to the parsley, cover with a clean kitchen towel and leave for about half an hour for the bulgar wheat to absorb the tomato juices and soften. ", "Season with cinnamon, allspice, pepper and salt to taste.  Add the lemon juice and olive oil and mix well together. Taste, adjust seasoning if necessary and serve immediately with either Little Gem lettuce or fresh vine leaves."]}, {"isVegetarian": true, "title": "Parsley sauce", "url": "www_bbc_co_uk_food_recipes_parsleysauce_70894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint béchamel sauce", "5 heaped tbsp fresh parsley, finely chopped ", "1 tbsp single cream ", "1 tsp lemon juice ", "salt ", "freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Warm up the béchamel sauce, add the chopped parsley, cream and lemon juice, taste and season, then serve."]}, {"isVegetarian": true, "title": "Parsnip, apple and raisin mini-muffins", "url": "www_bbc_co_uk_food_recipes_parsnip_apple_and_raisin_68466", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsnip_apple_and_raisin_68466_16x9.jpg", "ingredients": ["130g/4½oz plain flour", "130g/4½oz plain wholemeal flour", "2 tsp baking powder", "1 tsp mixed spice", "pinch salt", "1 free-range egg, lightly beaten", "70g/2½oz butter, melted and cooled slightly", "1 parsnip (about 125g/4½oz pre-peeled weight), peeled and grated", "1 small apple, grated", "75g/2¾oz raisins", "5 tbsp clear honey", "100ml/3½fl oz apple juice ", "125g/4½oz unsalted butter, softened", "125g/4½oz full-fat cream cheese", "2 tbsp clear honey", "1 tsp vanilla extract"], "serves": "Makes 24 mini-muffins", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4. Line two mini-muffin tins with squares of baking parchment, pushing them down to make little cases (alternatively use shop-bought mini-muffin cases).", "Mix the flours, baking powder, mixed spice and salt together in a bowl.", "Whisk together the egg and butter in a separate bowl. Stir in the parsnips, apple, raisins and honey and then add to the dry ingredients. Add the apple juice and stir to combine, but take care not to overmix.", "Spoon the mixture into the muffin tins and bake for 18-20 minutes, or until risen (check after 15 minutes).", "For the topping, beat the butter in a bowl until smooth and creamy.", "In another bowl, beat the cream cheese until creamy then stir in the honey and vanilla extract. Add the creamed butter and stir to combine. Transfer the topping into a piping bag fitted with a large star tip. Refrigerate the piping bag for about 30 minutes (leaving the piping bag in the fridge makes the topping easier to pipe). ", "Pipe the topping onto the muffins."]}, {"isVegetarian": false, "title": "Parsnip and chestnut soup", "url": "www_bbc_co_uk_food_recipes_parsnip_and_chestnut_03556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter", "600g/1lb 5oz parsnips, chopped", "1 small leek, trimmed and chopped", "150ml/5fl oz white wine", "200g/7oz cooked chestnuts (sold vacuum-packed)", "1.5 litre/2 pints vegetable stock (preferably homemade)", "salt and freshly ground black pepper", "8 scallops"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt half of the butter in a large heavy-based saucepan over a gentle heat but do not allow it to colour. Add the parsnips and leek and let them fry gently for about 4-5 minutes, or until the parsnip is soft.", "Add the white wine and chestnuts (reserving a few for garnish) and fry gently for a further 7-8 minutes. Season the mixture with salt and pepper to taste.", "Add the stock to the saucepan and bring to the boil, then simmer for 5-6 minutes. Remove the pan from the heat and blend with an immersion blender or in a food-processor until it’s nice and smooth. (If you’re using a food processor, allow the soup to cool a little before you blend it.) Pass the soup through a fine sieve and set aside.", "Heat a large frying pan and add the butter. Once melted, add the scallops and cook on each side for 1-2 minutes.", "Divide the seared scallops among four shallow serving bowls and ladle the soup around. Grate the reserved chestnuts on top."]}, {"isVegetarian": false, "title": "Parsnip soup with spinach and scallops", "url": "www_bbc_co_uk_food_recipes_parsnip_soup_with_10440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "1 shallot, roughly chopped", "1 garlic clove, roughly chopped ", "500g/1lb 2oz parsnips, peeled, cut into medium chunks", "2 sprigs fresh thyme", "1 tbsp honey", "2 tsp medium curry powder", "400ml/14fl oz vegetable stock ", "100ml/3½fl oz double cream", "1 tbsp rapeseed oil", "50g/1¾oz spinach ", "2 tbsp rapeseed oil", "4 hand-dived scallops in their shells, meat removed and cleaned", "4 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt the butter in a large saucepan. Add the shallot and garlic and cook for 2-3 minutes. Add the parsnips, thyme, honey and curry powder and cook for a further 2-3 minutes. Pour in the stock and cook for 8-10 minutes, or until the parsnips are tender. ", "Transfer to a blender and blend until smooth. Pour back into the pan, stir in the cream and gently warm though.", "Meanwhile, heat the oil in a large frying pan. Add the spinach and a few tablespoons water, then cook until wilted. Keep warm.", "For the scallops, heat the oil in a large frying pan. Once hot, add the scallops and cook for 1 minute on each side, or until just cooked through. Remove from the pan and season with salt and pepper. Set aside to rest for a few minutes before serving.", "To serve, divide the wilted spinach between shallow serving bowls and pour over the hot soup. Garnish with the scallops and coriander cress."]}, {"isVegetarian": true, "title": "Parsnip, sprout and chestnut hotpot with cider and sprout top pesto", "url": "www_bbc_co_uk_food_recipes_parsnip_sprout_and_73857", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz pearl barley or pearled spelt", "2 tbsp olive or rapeseed oil", "250g/9oz shallots or baby onions, peeled and cut in half", "300g/10½oz Brussels sprouts, trimmed and outer leaves removed", "400g/14oz parsnips, peeled and cut into 2.5 cm/1in chunks", "150g/5½oz cooked, peeled chestnuts", "150ml/5fl oz medium-dry cider", "2 bay leaves, torn", "2 thyme sprigs ", "750ml/26fl oz hot vegetable stock ", "extra virgin olive oil, for drizzling", "sea salt and freshly ground black pepper", "leafy tops from 1–2 Brussels sprout stems ", "½ garlic clove, finely chopped or grated", "25g/1oz walnuts or pumpkin seeds", "1 lemon, juice and zest", "2–3 tbsp extra virgin olive or rapeseed oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the pearl barley into a large bowl, cover with cold water and leave to soak for 15 minutes. ", "Heat the oil in a flameproof casserole dish over a medium heat. Add the shallots, Brussels sprouts, parsnips, chestnuts, and season with salt and pepper. Cook for 15 minutes, stirring only occasionally, until you get a golden-brown colour on the vegetables.", "Add the cider and simmer for a couple of minutes, stirring and scraping the bottom of the pan to deglaze it, until the liquid has reduced to almost nothing. ", "Drain the pearl barley and rinse well. Add to the casserole dish with the bay leaves, thyme and stock. Stir well, bring to a simmer, then reduce the heat to low.  Cover and simmer for 35–40 minutes, or until the barley is tender. Check the seasoning. ", "Meanwhile, to make the pesto, strip any tough stalks from the Brussels leaves. Roughly shred or chop the leaves and place into a food processor. Add the garlic, walnuts or pumpkin seeds and some salt and pepper. Blend until finely chopped, stopping once or twice to scrape down the sides. ", "Add a squeeze of lemon juice and slowly trickle in the oil, whilst the processor is on. Stop when the ingredients have formed a coarse pesto – it’s nicest if it’s still a bit leafy and textured, rather than a smooth puree. Taste and add more salt, pepper or lemon juice as needed. Place into a bowl and finish with a few fine gratings of lemon zest. ", "To serve, spoon the hotpot into warmed bowls and top with the sprout top pesto. "]}, {"isVegetarian": false, "title": "Parsnip soup with mini crab beignets", "url": "www_bbc_co_uk_food_recipes_parsnip_soup_with_mini_24382", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "500g/1lb 2oz parsnips, peeled, roughly chopped", "2 banana shallots, roughly chopped", "2 garlic cloves, finely chopped", "2 fresh thyme sprigs, leaves only", "½ tsp curry powder", "750ml/1pt 7fl oz chicken stock", "75ml/3fl oz double cream, plus extra to garnish", "salt and freshly ground black pepper", "vegetable oil, for frying", "125ml/4½fl oz water", "50g/2oz butter, diced", "75g/3oz plain flour", "½ tsp cayenne pepper", "2 free-range eggs", "75g/3oz white crabmeat", "25g/1oz brown crabmeat", "salt and freshly ground black pepper", "2 tsp extra-virgin olive oil", "2 tbsp fresh coriander cress", "1 tbsp flaked almonds, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, melt half of the butter in a large saucepan until foaming. Add the parsnips and fry for 4-5 minutes, or until pale golden-brown.", "Add the shallots, garlic and thyme and fry for 2-3 minutes, then stir in the curry powder and fry for another minute.", "Pour in the chicken stock and cook for 8-10 minutes, or until the parsnips are tender.", "Add the double cream, cool the soup slightly and blend the soup in a blender until smooth.", "Strain the soup through a sieve into a clean saucepan and season, to taste, with salt and freshly ground black pepper. Whisk in the remaining butter.", "For the mini crab beignets, heat the oil in a deep-fat fryer to 180C/350F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Heat the water and butter in a saucepan until the mixture boils, then boil for another minute.", "Remove the pan from the heat and beat in the flour and cayenne with a wooden spoon until smooth, or until the mixture comes away from the side of the pan.  Return the pan to the heat and cook for 1-2 minutes, stirring continuously.", "Remove the pan from the heat and beat in the eggs, one at a time, beating well before adding the other egg.", "Stir in the white and brown crabmeat until well combined, then season with salt and freshly ground black pepper.", "Spoon the mixture into a piping bag and pipe 1.5cm/½in long sections into the oil and fry for 1-2 minutes, or until golden-brown and crisp. Remove the beignets from the pan with a slotted spoon, set aside to drain on kitchen paper and season with salt.", "To serve, ladle the soup into soup bowls, scatter over some crab beignet and finish with a swirl of double cream. Drizzle the soup with olive oil and sprinkle over the coriander cress and flaked almonds."]}, {"isVegetarian": false, "title": "Parsnip soup with steamed clams", "url": "www_bbc_co_uk_food_recipes_parsnipsoupwithsteam_93513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 slices streaky bacon, roughly chopped", "1.5kg/3lb 4oz clams, cleaned (discard any clams that remain open after rinsing)", "175ml/6fl oz white wine", "salt and freshly ground black pepper", "2 tbsp chopped fresh flatleaf parsley", "50g/2oz butter", "1 onion, peeled, roughly chopped", "2 garlic cloves, peeled, finely chopped", "500g/1lb 2oz parsnips, peeled, roughly chopped", "2 fresh sprigs thyme, leaves only", "750ml/1pint 7fl oz chicken stock", "75ml/3fl oz double cream", "1 tbsp olive oil", "4 thin slices baguette, rubbed with a little oil and toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over a medium heat and fry half of the bacon for 1-2 minutes, or until golden-brown. Remove from the pan, using a slotted spoon, and set aside to drain on kitchen paper.", "Meanwhile, heat a lidded frying pan over a medium heat. Add the clams and white wine, cover the pan with a lid and steam the clams for 2-3 minutes, or until all of the clams have opened. (Discard any clams that have not opened during cooking.) ", "Strain the clams through a colander and reserve the cooking liquor. Pick the clam meat from the shells, place into a bowl, season, to taste, with freshly ground black pepper. Stir in the parsley and cooked bacon and set aside.", "Heat half of the butter in a saucepan until foaming and fry the onion, garlic and the remaining half of the bacon for 2-3 minutes, or until softened. Add the parnsips and thyme and cook a further 2-3 minutes. Pour in the reserved cooking liquor from the clams, bring the mixture to the boil and cook until the volume of the liquid has reduced by one-third.", "Pour in the chicken stock and return the mixture to the boil. Reduce the heat and simmer for 8-10 minutes, or until the parsnips are tender.", "Stir in the double cream and blend the mixture in a blender until smooth. ", "Pass the blended soup through a sieve into the saucepan and return to the heat. Season, to taste, with salt and freshly ground black pepper and whisk in the remaining 25g/1oz butter.", "To serve, spoon some of the clams into the middle of each of 4 serving bowls. Ladle the soup around the clams and top with a slice of toast."]}, {"isVegetarian": true, "title": "Cheesy parsnip and sweet potato tarts", "url": "www_bbc_co_uk_food_recipes_parsnip_sweet_potato_and_66305", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parsnip_sweet_potato_and_66305_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "pinch salt", "150g/5½oz cold butter, cut into cubes", "50g/1¾oz Parmesan (or alternative vegetarian hard cheese), finely grated", "2½-3½ tbsp iced water", "10g butter", "1 onion, finely chopped", "2 parsnips, peeled and cut into 1cm cubes", "1 sweet potato, peeled and cut into 1cm cubes", "2 free-range eggs", "200ml/7fl oz double cream", "2 sage leaves, finely chopped", "1 tsp fresh thyme leaves, plus 12 thyme sprigs to garnish", "60g/2¼oz Parmesan (or alternative vegetarian hard cheese), finely grated", "30g/1oz blanched hazelnuts, roughly chopped", "salt and freshly ground black pepper"], "serves": "Makes 6 tarts", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour and salt into a mixing bowl. Rub in the butter, then mix in the Parmesan and bring together with the water. Wrap in clingfilm and put in the fridge for 30 minutes.", " Preheat the oven to 200C/180C Fan/Gas 6.", "Roll out the pastry on a lightly floured surface to 2-3mm thick. Cut out six circles using an 11cm/4in cutter and use to line six tart tins, rerolling the pastry if you need to. Line each pastry case with baking paper, add baking beans and blind bake for 12 minutes. ", "Remove the paper and beans and bake for a further minute. Remove from the oven and reduce the temperature to 180C/160C Fan/Gas 4.", "Meanwhile for the filling, heat the butter in a heavy-bottomed frying pan. Add the onion and cook for 1–2 minutes. Add the parsnip and sweet potatoes and cook, stirring from time to time, for 15 minutes, or until almost cooked through and caramelised. Spoon into the pastry cases. ", "Mix the eggs, cream, sage, thyme and half the Parmesan together in a jug and season well. Pour over the vegetables in the pastry cases. ", "Sprinkle the hazelnuts and remaining Parmesan over the pastry cases and decorate each one with two thyme sprigs. Bake for 35–40 minutes until golden-brown. Serve."]}, {"isVegetarian": false, "title": "Partridge with Jerusalem artichoke purée, caramelised apple and chicken sauce", "url": "www_bbc_co_uk_food_recipes_partridge_with_jerusalem_01583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz rapeseed oil", "200ml/7fl oz chardonnay or white wine vinegar", "100g/3½oz caster sugar               ", "6 sprigs thyme  ", "2 Jerusalem artichokes, peeled and thinly sliced", "1 tbsp rapeseed oil", "4 chicken wings", "2 banana shallots, peeled and sliced                                             ", "30g/1oz button mushrooms, sliced ", "1 garlic clove, sliced", "1 sprig thyme", "100ml/3½fl oz Madeira", "300ml/10½fl oz dark chicken stock        ", "100ml/3½fl oz double cream, to finish  ", "1 lemon, juice only  ", "350g/12½oz Jerusalem artichokes, peeled and diced                 ", "150g/5½oz celeriac, diced             ", "3 banana shallots, chopped                        ", "1 garlic clove, peeled            ", "150g/5½oz unsalted butter              ", "200ml/7fl oz double cream", "1.1 litres/2 pints chicken stock", "3 garlic cloves, peeled and left whole", "6 sprigs thyme ", "2 partridge crowns", "1 tbsp rapeseed oil", "salt and freshly ground black pepper", "knob of butter", "vegetable oil, for deep frying", "100g/3½oz kale leaves", "salt, to taste", "1 tbsp rapeseed oil", "50g/1¾oz smoked pancetta, diced into 1cm/½in cubes", "50g/1¾oz girolle mushrooms, trimmed ", "knob of butter", "10g finely chopped chives    ", "100g/3½oz sugar", "1 Granny Smith apple, cored and cut into rings", "50g/1¾oz butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinated artichoke discs, put all the ingredients apart from the artichokes into a large pan. Bring to a simmer, add the artichoke discs and bring back to a simmer. Pour into a deep container and leave to marinate for an hour.", "For the chicken sauce, heat the oil in a deep pan over a medium-high heat. Add the wings and cook until caramelised. Set the wings aside. ", "Drain the pan and add the shallots. Cook the shallots until caramelised then add the mushrooms, garlic and thyme.", "When they have turned golden-brown de-glaze the pan with the Madeira and continue to cook to reduce it in volume down to a syrup.", "Add the stock, put the wings back into the pan and bring to the boil. Simmer for 30 minutes and then pass through a fine sieve.", "To finish, add the cream and cook to reduce the volume of liquid down to a sauce consistency. Finish with lemon juice, to taste.", "For the Jerusalem artichoke purée, put all the ingredients into a pan with 560ml/1 pint of water and bring to the boil. Cook over a high heat to rapidly reduce the volume of liquid until the butter and water have absorbed into the vegetables. Add cream, to taste, and blend to a smooth purée using a stick blender.", "For the partridge, bring the chicken stock, garlic and thyme to the boil in a pan. Once boiling, remove the pan from the heat and place the partridge crowns into the stock, cover and leave for 10 minutes.", "Remove the partridge crowns from the pan and pat dry. Carefully remove the breasts from the partridge crowns using a thin, sharp knife.", "Heat a non-stick frying pan and add a little oil. Season the partridge breasts with salt and pepper and place skin-side down in the pan. Cook until golden-brown, then add a little butter and turn the partridge over. Baste for 20 seconds, remove the breasts from the pan and set aside in a warm place.", "For the kale, prepare a deep-fat fryer or fill a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 160C/300F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Deep fry the kale for approximately 30 seconds or until the kale is crisp. Remove and drain on kitchen paper. Season with a little salt and leave to cool.", "For the mushroom and smoked bacon garnish, in a hot pan add a touch of rapeseed oil and fry the pancetta until just golden-brown. Add the mushrooms and a little butter and cook for a further minute. Add the chopped chives and season if needed.", "For the caramelised apple, heat the sugar in a pan until it turns a light caramel colour.", "Add the apple rings and a little butter and cook for 30 seconds, flip the apple over and turn off the heat of the pan, after 20 seconds remove the apple from the pan.", "To serve, on large serving plates trim the partridge and neatly place off centre, and put the apple next to the partridge. Spoon the Jerusalem artichoke purée next to the them. Spoon the smoked bacon and mushrooms over and around the breast. Finish with a little drizzle of chicken sauce and arrange a few pieces of deep-fried kale and artichoke discs around the plate."]}, {"isVegetarian": false, "title": "Partridge with cobnut crust and potted game", "url": "www_bbc_co_uk_food_recipes_partridge_with_cobnut_86862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash vegetable oil", "3 whole partridge, jointed (ask your butcher to do this)", "300g/10½oz mixed game", "1 x 340g/12oz tin goose fat, melted", "100g/3½oz oats", "100g/3½oz plain flour, plus extra for flouring", "50g/1¾oz grated parmesan", "½ tsp cayenne pepper", "salt and freshly ground black pepper", "1 tbsp olive oil", "100g/3½oz shelled cobnuts", "200g/7oz melted butter", "50g/1¾oz finely chopped chive", "1 punnet blackberries", "fresh herbs, for garnish"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Heat the oil in a pan and fry the partridge legs to colour them all over.", "Place the partridge legs in an ovenproof dish. ", "Add the mixed game and pour over the goose fat. Set aside the partridge breasts.", "Place in the oven for two hours to gently confit. ", "Once cooked, carefully remove the partridge from the fat with a slotted spoon. Season the confit and press it together to form a slim sausage shape and wrap tightly in cling film. Place in the fridge to set.", "Set the oven to 180C/350F/Gas 4.", "Mix the oats, flour, parmesan, cayenne pepper, salt and pepper in a bowl. ", "Add just enough boiling water to make a dough that is not sticky. ", "On a lightly floured surface, roll out the dough and cut into rounds. ", "Grease a baking tray with olive oil and place the rounds on the prepared baking tray. Cook for 12-15 minutes", "Gently fry the cobnuts in a frying pan. Chop them finely and set aside for the crust.", "Season the partridge breasts, brown lightly in a pan before placing in the oven for 6-8 minutes, or until the partridge is cooked but still slightly pink in the middle. Brush with some of the melted butter and dip into the cobnuts to form a crust. ", "To assemble the dish, slice a small round of the confit game, brush with a little melted butter and dip in chopped chives. Put the game, breast and oatcakes onto each plate and garnish with blackberries and fresh herbs."]}, {"isVegetarian": false, "title": "Partridge croustillant", "url": "www_bbc_co_uk_food_recipes_partridge_croustillant_20604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz caster sugar", "250ml/9fl oz cider vinegar", "1 sprig fresh tarragon", "1 sprig fresh thyme", "2cm/¾in piece fresh root ginger", "½ red chilli", "500g/1lb 2oz fresh blackberries", "500g/1lb 2oz carrots, sliced", "1 litre/1¾ pint fresh carrot juice", "salt and freshly ground black pepper", "450g/1lb large-leaf spinach, stalks removed, leaves blanched briefly in lightly salted water", "6 partridge breasts (off the bone)", "6 feuilles de brick pastry circles (available online and from specialist retailers)", "4 Maris Piper potatoes, cut into strings using a spiraliser", "vegetable oil, for deep-frying", "1 free-range egg, beaten ", "1 shallot, finely chopped", "75g/2½oz unsalted butter", "150g/5½oz girolles, cleaned", "150g/5½oz chanterelles, cleaned", "2 tbsp chopped fresh tarragon", "6 circles sliced bread, fried in lard", "6 leaves hispi cabbage, cooked and refreshed in ice water", "partridge jus or gravy"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pickled blackberries, mix the sugar, cider vinegar, tarragon, thyme, ginger and chilli in a saucepan. Bring to the boil then cool a little before adding the blackberries. Allow to infuse for a few hours and for up to 2 weeks.", "For the carrot purée, put the carrots in a large saucepan and cover with enough carrot juice to cover. Bring to the boil and then simmer until the carrots are soft. Transfer to a blender and pulse until smooth. Push through a sieve, season with salt and pepper. Keep warm until ready to serve.", "For the partridge, preheat a deep-fat fryer to 160C. Or until a small piece of bread turns crisp and golden-brown within a minute. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Lay out 6 spinach leaves on a work surface. Put a partridge breast in the middle of each leaf and season with salt and pepper. Wrap up into a parcel, then layout 2 circles of the brick pastry and cut each circle into quarters. Wrap each spinach parcel in a quarter of pastry, brushing the edges with beaten egg to help them stay in place. ", "Wrap the parcels completely in potato strings. Lower each parcel into the fryer and cook for 3 minutes. Remove using a slotted spoon and set aside to rest and drain on kitchen paper.  ", "Heat the butter in a large frying pan, then fry the shallot until soft. Add the mushrooms and when cooked, finish with the tarragon.", "When ready to serve, if necessary, fry the parcels again briefly to ensure they are hot. To serve, lay a leaf of hispi cabbage in centre of each plate. To one side place the fried bread, on top of this add the mushrooms. Slice the croustilliant parcels in 2 and lay them on the cabbage. Drain the blackberries and arrange them around the plates. Spoon over partridge jus and finish with a neat spoonful of carrot purée.\t"]}, {"isVegetarian": false, "title": "Parsnip-stuffed roast saddle of lamb with fondant potatoes, roast beetroot and red wine sauce", "url": "www_bbc_co_uk_food_recipes_parsnipstuffedroasts_86957", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "400g/14oz parsnips, cut into 3cm x 10cm (1¼in x 4in batons)", "2 tbsp honey", "2 sprigs fresh thyme", "2 sprigs fresh rosemary", "salt and freshly ground black pepper ", "1.5kg/3lb 4oz boned saddle of lamb", "6 large potatoes, cut into cylinders about 5cm/2in long", "1 tbsp water", "2 sprigs fresh thyme", "50g/2oz butter", "3 large beetroot, cut into wedges", "1 tbsp olive oil", "salt and freshly ground black pepper ", "200ml/7fl oz red wine", "300ml/11fl oz beef stock", "salt and freshly ground black pepper ", "50g/2oz butter"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lamb, heat the oil in an ovenproof frying pan and add the parsnips. Fry for 2-3 minutes, then add the honey, thyme and rosemary. Stir to coat and season, to taste, with salt and freshly ground black pepper.", "Transfer to the oven and roast for 20-25 minutes, or until just tender and golden-brown. Remove from the oven and allow to cool.", "Open up the lamb and season with salt and freshly ground black pepper. Place the parsnips down the centre of the lamb. Fold the lamb over the parsnips, then turn over so that the join is on the bottom and tie securely with string to enclose the filling.", "Heat a large frying pan until hot. Place the lamb into the pan and cook on each side for 2-3 minutes, until lightly browned all over. Place in the oven for 30-40 minutes, until the lamb is cooked through but still pink, or until cooked to your liking. Remove from the oven and leave to rest for five minutes.", "For the fondant potatoes, place the potatoes into a heat-resistant plastic food bag with the water and thyme and seal tightly.", "Place a pan of water over a high heat and place the bag of potatoes into it. Bring to the boil, then reduce the heat and simmer for 20-25 minutes, or until the potatoes are just tender. Remove the bag from the water and take the potatoes out of the bag, taking care as there will be steam.", "Heat the butter in a frying pan and fry the potatoes, turning frequently, until golden-brown all over.", "Meanwhile, for the roast beetroot, place the beetroot into a roasting pan, drizzle with olive oil and season with salt and freshly ground black pepper. Place in the oven along with the lamb and roast for 30 minutes, or until just tender.", "For the sauce, heat the red wine in a small pan. Bring to the boil, then reduce the heat and simmer until reduced by half.", "Add the beef stock and simmer until reduced by two thirds. Season, to taste, with salt and freshly ground black pepper and whisk in the butter.", "To serve, slice the lamb and place onto serving plates with the fondant potatoes and beetroot. Pour over the sauce."]}, {"isVegetarian": false, "title": "Party eggs", "url": "www_bbc_co_uk_food_recipes_party_eggs_72598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs, hard-boiled, peeled, halved lengthways", "2 tsp salad cream", "cherry tomatoes, chopped", "cooked bacon bits", "cress", "spring onion, sliced"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully remove the yolk from the eggs and put in a bowl. Mash in the salad cream and a little of the toppings. ", "Spoon the yolk mixture back into the halved eggs and place on a serving plate."]}, {"isVegetarian": false, "title": "Party vol-au-vents", "url": "www_bbc_co_uk_food_recipes_party_vol-au-vents_60239", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz ready-made puff pastry", "plain flour, for rolling", "225g/8oz un-dyed smoked haddock fillet", "300ml/10fl oz whole milk", "100g/3½oz cooked, peeled prawns", "2 tbsp chives, finely sliced", "½ onion, cut into quarters", "2 bay leaves", "3 sprigs fresh thyme", "25g/1oz butter", "25g/1oz plain flour", "5 tbsp crème fraîche", "sea salt flakes", "freshly ground black pepper", "2 boneless chicken breasts, roasted, skin removed, cut into small pieces", "1 tbsp fresh tarragon leaves", "1 tbsp white wine"], "serves": "Makes 30", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, preheat the oven to 200C/400F/Gas 6 and line a large baking tray with greaseproof paper.  Roll out the pastry on a lightly floured surface and cut into 30 x 6cm/2½in squares. Score a smaller square inside each one, leaving a 75mm/¼in border.  (Take care not to cut the pastry all the way through.)", "Bake the pastry squares in the oven for 18-20 minutes, or until puffed up and golden-brown. ", "Remove from the oven and transfer to a wire rack to cool.  When cool carefully remove the central square of pastry from each one. ", "Meanwhile, for the smoked haddock and prawn filling, place the haddock in a saucepan with the milk, bring to a simmer, switch off the heat and leave the fish to cook in the residual heat for ten minutes.", "Drain the haddock, reserving the milk. Set the haddock aside to cool slighly, then remove the skin. ", "For the sauce, pour the reserved milk into a saucepan and add the onion, bay leaves and thyme.  Bring to a gentle simmer, then remove from the heat and leave to infuse for ten minutes.   Strain the milk through a sieve into a jug and discard the onion and herbs.", "Melt the butter in a non-stick saucepan over a low heat, add the flour and cook for a few seconds, stirring constantly.  Stir in the hot infused milk slowly,  and cook for 1-2 minutes or until the sauce is smooth and thick.   Season, to taste, with salt and freshly ground black pepper, remove from the heat and stir in the crème fraîche.   Cover with clingfilm and leave to cool. ", "Divide the sauce into two portions, flake the haddock into one half of the sauce, checking for any remaining bones and stir in the prawns and chives.  For the chicken and tarragon filling, stir the chicken, tarragon and wine into the other half of the sauce. ", "To assemble the vol-au-vents preheat the oven to 200C/400F/Gas 6.   Put the pastry squares onto a baking tray, spoon in the fillings and warm in the oven for 8-10 minutes or until the filling is bubbling.  Serve warm or cold."]}, {"isVegetarian": false, "title": "Passion fruit and chocolate tart", "url": "www_bbc_co_uk_food_recipes_passion_fruit_and_76131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["270g/9¾oz plain flour, plus extra for dusting", "30g/1oz cocoa powder", "30g/1oz ground almonds", "65g/2½oz icing sugar", "170g/6oz unsalted butter, cubed", "1 medium free-range egg", "1 free-range egg white, for egg wash", "40g/1½oz ground almonds", "60g/2¼oz icing sugar", "1 large free-range egg white", "1 tbsp caster sugar", "orange or yellow gel or paste food colouring", "125ml/4fl oz double cream", "4 tbsp sieved passion fruit ", "2 free-range egg yolks", "1 large free-range egg", "55g/2oz caster sugar", "200g/7oz milk chocolate drops ", "50g/1¾oz dark chocolate drops ", "50g/1¾oz unsalted butter", "150g/5½oz mini white marshmallows", "200ml/7fl oz double cream", "100g/3½oz caster sugar", "3 large passion fruits, seeds scooped out", "3 gelatine leaves, soaked in cold water for 10 minutes", "50g/1¾oz butter", "125g/4½oz icing sugar", "1 tbsp sieved passion fruit", "50ml/2fl oz double cream ", "200g/7oz dark chocolate drops", "50ml/2fl oz sieved passion fruit ", "small yellow and purple edible pansies (optional)"], "serves": "Makes 1 large tart", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put all the ingredients, except the egg white, in a food processor and briefly blitz to combine. Add a few drops of water and pulse to bring the dough together. Cover with cling film and chill for 20 minutes. ", "To make the macarons, blitz the ground almonds and icing sugar to a fine powder using a food processor. In a separate bowl, whisk the egg white until stiff peaks form when the whisk is removed. Add the caster sugar and whisk until glossy. Add a drop of the food colouring and stir through. Fold the powder mixture into the egg whites. Transfer to a piping bag fitted with a plain nozzle.", "Line a baking tray with non-stick baking paper. Pipe small rounds of the macaron mixture about the size of a 10p coin then set aside until they form a skin. Preheat the oven to 160C/140C Fan/Gas 3.", "Bake the macarons for 12-15 minutes, or until they are no longer sticky to the touch.  Place the macarons on wire racks to cool. ", "Roll out the chilled pastry on a lightly floured work surface until it is about 4mm thick. Line a 23cm/9in tart tin with the pastry. Chill for 20 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6.", "For the passion fruit layer, put all the ingredients in a saucepan and whisk gently over a low heat until it thickens. ", "Line the pastry case with baking parchment and fill with baking beans. Bake for 10 minutes, then remove from the oven and reduce the temperature to 180C/160C Fan/Gas 4. Remove the baking beans and brush the pastry with the egg white. ", "Pour in the passion fruit layer and return to the oven for 10 minutes, or until set. Allow to cool slightly then place in the fridge to chill. ", "For the chocolate mousse layer, melt the chocolate drops, butter and marshmallows together until combined. Leave to cool. ", "Whip the cream until stiff peaks form when the whisk is removed. Fold in the chocolate mixture then whisk it in the bowl of a freestanding mixer for approximately 10 minutes, or until very pale in colour and fluffy. Pour on top of the passion fruit layer, smooth the surface and chill again. ", "To make the jelly, combine the sugar and passion fruit in a pan with 100ml/3½fl oz water. Bring to the boil then squeeze any excess water from the gelatin and add to the pan.  When the gelatin is dissolved, pour the mixture into a 23cm/9in sandwich tin lined with cling film. Chill until set. ", "To make the buttercream for the macarons mix all the ingredients together until smooth. Transfer to a piping bag fitted with a 1cm/½in plain nozzle. Use the buttercream to sandwich the macarons together.", "For the passion fruit ganache, heat the cream in a pan then add the chocolate drops. When the chocolate is melted, stir in the passion fruit, leave to cool slightly then smooth on top of the chocolate mousse and chill in the fridge until set. ", "To assemble the tart, cut the jelly into cubes. Decorate the top of the tart with the macarons, some squares of jelly and pansies. "]}, {"isVegetarian": false, "title": "Passion fruit cream with coconut and cherry biscotti", "url": "www_bbc_co_uk_food_recipes_passion_fruit_cream_with_05122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint double cream", "250g/9oz caster sugar", "1 lime, juice only", "150ml/5fl oz passion fruit pulp, passed through a fine sieve", "2 gelatine leaves, soaked in cold water", "300g/10½oz plain flour, plus extra for dusting", "250g/9oz caster sugar", "100g/3½oz shelled pistachios", "60g/2¼oz fresh coconut, grated", "50g/2oz natural glacé cherries, roughly chopped", "1 lemon, zest and juice", "1¼ tsp baking powder", "pinch salt", "3 free-range eggs"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the passion fruit cream, bring the double cream and 150g/5oz of the sugar gently to the boil in a large saucepan, then remove from the heat. Whisk in the lime juice and half of the sieved passion fruit pulp.", "Pour the cream mixture into four large Martini glasses (do not fill to the top) and chill in the fridge for at least two hours, or until set.", "Meanwhile, drain the gelatine leaves and shake dry. Bring 100ml/3½fl oz of water and the remaining sugar to the boil in a large saucepan. Add the gelatine leaves and whisk until completely dissolved. ", "Add the remaining sieved passion fruit pulp to the sugar syrup mixture, then set aside to cool.", "When the gelatine mixture has cooled and the cream has set, pour one-quarter of the gelatine mixture on top of each portion of set cream to form a thin layer about 0.5cm/¼in thick. Return to the fridge for another hour, or until set.", "Meanwhile, for the biscotti, preheat the oven to 180C/350F/Gas 4. Line a baking tray with baking parchment.", "Place all of the biscotti ingredients into a large bowl and stir until the mixture comes together as a soft, sticky dough.", "Divide the dough in half and roll each portion out into a sausage shape on a lightly floured work surface. ", "Place the pieces of dough onto the prepared baking tray and bake for 20-30 minutes, or until golden-brown. Remove from the oven and set aside for 10 minutes to cool and firm up.", "Using a serrated knife, slice 1cm/½in-thick discs from the pieces of dough, slicing them at an angle. Lay the discs onto the same baking tray (use an extra baking tray if necessary). Return the biscotti to the oven and cook for 6-8 minutes, then turn the slices over and cook for a further 10-15 minutes, or until crisp and pale golden-brown on both sides. Remove from the oven and transfer to wire racks to cool. ", "Serve the passion fruit creams with the biscotti alongside."]}, {"isVegetarian": false, "title": "Passion fruit delice with tuiles", "url": "www_bbc_co_uk_food_recipes_passion_fruit_delice_69401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz caster sugar", "110g/4fl oz water", "10g/½oz glucose syrup", "175g/6oz caster sugar", "5 tbsp water", "3 free-range egg whites", "300ml/10fl oz passion fruit purée", "100ml/3½fl oz sugar syrup (see above)", "4½ gelatine leaves, soaked in cold water for 15 minutes, drained, squeezed dry", "½ vanilla pod", "3 free-range egg yolks", "25g/1oz caster sugar", "25cm/10in ready-made sponge flan case", "20ml/¾fl oz passion fruit liqueur", "400ml/14fl oz double cream, whipped until soft peaks form when the whisk is removed", "100g/3½oz unsalted butter", "100g/3½oz icing sugar", "1 tbsp clear honey", "3 free-range egg whites", "100g/3½oz plain flour", "50ml/2fl oz sugar syrup (see above)", "50ml/2fl oz passion fruit purée", "2 gelatine leaves, soaked in cold water for 15 minutes, drained", "4 passion fruit", "12g/½oz powdered milk"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the sugar syrup, place all the ingredients into a pan and slowly bring to the boil, stirring occasionally with a wooden spoon. ", "Boil for about 2-3 minutes, skimming the surface if necessary. Pass the syrup through a fine sieve and leave until completely cold before using. ", "For the Italian meringue, place the sugar and water into a pan and slowly bring to the boil until the syrup reaches 110C/230F on a sugar thermometer.", "At this stage, whisk the egg whites in the bowl of an electric mixer until firm peaks form when the whisk is removed.", "As soon as the sugar reaches 121C/250F, remove the pan from the heat. ", "Immediately resume whisking the egg whites - with the beater at its lowest speed, pour in the melted sugar, in a thin, steady stream. CAUTION: Ensure the syrup is clear of the beaters, as it could be splashed on your hands. Continue beating for about five minutes, until the meringue is tepid. ", "For the passionfruit delice, blend the passion fruit pulp and the sugar syrup in a food processor until smooth. Strain the mixture through a fine sieve.", "Reserve four tablespoons of the passion fruit purée and place the rest into a pan. Add the milk powder and vanilla pod and bring to the boil. ", "Whisk the egg yolks and sugar in a bowl until the mixture forms a ribbon when the whisk is removed. ", "Pour half of the passion fruit mixture onto the egg mixture, whisking continuously, then pour this custard mixture back into the pan. ", "Heat gently, stirring continuously with a spatula, until the custard is thick enough to coat the spatula. Do not allow it to boil.", "Remove the pan from the heat and stir in the drained gelatine leaves.  Set aside to cool slightly.", "Discard the vanilla pod, and then pass the custard through a conical sieve into a bowl and leave to cool, stirring occasionally to prevent a skin forming. ", "For the base of the delice, place the sponge flan base onto a board or baking tray. ", "Mix together 50ml/2fl oz of the cold sugar syrup and the reserved passion fruit purée and brush this mixture over the sponge. ", "Place a 25cm/10in flan ring (6cm/2½in deep) onto the sponge and press down to cut out a circle, leaving the sponge as the base of the flan ring.", "When the custard is lukewarm, gently fold in half of the Italian meringue (the remaining meringue can be used in another recipe). Stir in the passion fruit liqueur, and then fold in the whipped double cream. (You must now assemble the dessert immediately, before the gelatine causes the mixture to set.)", "Fill the flan ring with the passion fruit custard mixture, leaving a small gap at the top, and carefully smooth the surface with a palette knife. Transfer to the freezer and chill for several hours.", "Preheat the oven to 200C/400F/Gas 6.", "For the tuiles, beat the butter, icing sugar and honey in a bowl until smooth.", "Gradually beat in the egg whites, one at a time, until well combined. Then carefully fold in the flour using a metal spoon. ", "Take a piece of silicone or plastic and cut out long thin leaf shapes to create a stencil. Line a baking tray with baking parchment then place the stencil onto the tray. Using a palette knife, spread a thin layer of the tuile mixture into the cut-out part of the stencil. Carefully remove the template and repeat with the remaining mixture.", "Place the tray into the oven and bake for 3-4 minutes, or until pale golden-brown.", "For the glaze, place the sugar syrup and the passion fruit pulp into a pan and heat gently, then remove from the heat, stir in the drained gelatine and set aside to cool. Once cool, remove the delice from the freezer and spread the glaze over the top of the passion fruit filling. Transfer to the fridge to chill again before serving. ", "To serve, remove the flan ring by heating the outside of the ring with a blowtorch for a few seconds, then slide the ring upwards, rotating it slightly. Spoon the remaining passion fruit seeds into the centre of the delice. Place the tuiles upright around the edge of the delice to form a ring. Cut into slices to serve."]}]