[{"isVegetarian": false, "title": "Beef fillet with chicory and blue cheese salad and celeriac chips", "url": "www_bbc_co_uk_food_recipes_beef_fillet_on_the_bone_66102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz egg white (3 small free-range eggs whites)", "500g-1kg/1lb 2oz-2lb 4oz fine salt", "1 celeriac, approx 650g/1lb 7oz", "390g jar pickled walnuts", "100g/3½oz tapioca flour", "vegetable oil, for deep-frying", "olive oil, for frying", "1 fillet of beef on the bone ", "1 red chicory", "1 white chicory", "1 frisée lettuce", "75g/2¾oz of blue cheese, crumbled", "1 tbsp 2.5cm/1in chopped chives", "2 tbsp walnut oil, for drizzling", "salt and freshly ground black pepper ", "300ml/10fl oz jus or beef gravy, to serve", "2 walnuts, roughly chopped, to serve"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Mix the egg whites and salt into a paste. Put the paste around the celeriac to form a salt crust and place on a baking tray. Bake for 1½ hours, then set aside to cool completely. (This can be done the night before, if preferred.).", "Drain the pickled walnuts, reserving the liquid, and blend in a food processor. Slowly add the liquid, blending all the time, until a thick, smooth purée forms. Sieve the mixture into a clean bowl and set aside.", "For the celeriac chips, break up the salt crust and discard. Cut the celeriac into chip-sized pieces and dust in the tapioca flour. Heat the oil in a deep-fat fryer to 190C (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the celariac chips until golden, then drain on kitchen paper.", "Heat a little olive oil in a frying pan over a high heat. Season the beef, then fry for 2 minutes on each side, or until done to your liking. Set aside to rest somewhere warm. ", "Cut the base off the chicory and lettuce and remove the outer leaves. Separate the inner leaves and place in a large bowl. Sprinkle over the blue cheese and chives, season and drizzle with a little walnut oil.", "To serve, heat the jus until hot. Remove the bone from the beef fillet and slice the meat in half, then place it on two warmed plates and spoon the jus over it. Add the chips and salad with a spoonful of walnut ketchup on the side. Sprinkle with chopped walnuts. "]}, {"isVegetarian": false, "title": "Beef fillet with black-pepper miso and pickled Japanese mushroom salad", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_13708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5½fl oz sake", "150ml/5½fl oz mirin", "20g fresh root ginger, peeled and finely chopped", "2 tsp crushed garlic", "3 tsp freshly ground black pepper", "200g/7oz red miso paste", "4 x 200g/7oz beef fillet steaks \t\t\t\t\t\t\t\t\t", "freshly grated wasabi, to serve", "1 tbsp vegetable oil", "300g/10½oz mix Japanese mushrooms (keep the shiitake separate) ", "350ml/12fl oz mirin", "100ml/3½fl oz rice vinegar", "50ml/2fl oz light soy sauce ", "1 onion, cut into 1cm/½in rings"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the beef with miso, heat the sake and mirin together in a small saucepan for 3-4 minutes, or until the alcohol has evaporated. Add the ginger and garlic and cook for 2-3 minutes, or until tender. Add the pepper and miso paste and stir until blended. Remove from the heat.", "Brush the steaks lightly with the mixture. If possible, marinade, covered, in the fridge for 2-3 hours, but bring back to room temperature before cooking. ", "For the pickled Japanese mushroom salad, heat the oil in a frying pan and fry the shiitake mushrooms until coloured. Add the remaining mushrooms and fry for 2-3 minutes. ", "Deglaze the pan by pouring in 100ml/3½fl oz mirin, then bubble until reduced by half. Pour in the vinegar and soy sauce, then stir, remove from the heat and set aside. ", "Preheat a griddle pan to hot. Cook the onion rings for 5-7 minutes, turning halfway, until caramelised on both sides. Transfer to a heatproof lidded container and set aside.", "Bring the remaining 250ml/9fl oz mirin to the boil, then pour it over the onions. Seal the container and leave to cool. ", "For the beef with miso, preheat a heavy-based griddle pan over a medium heat. Cook the steaks until a crust has formed. Continue cooking and turning, brushing the steaks with more black-pepper miso each time they are turned, until cooked to your taste. Be careful not to let them catch, or the miso will go bitter. Leave to cool for at least 20 minutes. ", "Slice the steaks and arrange on a platter. Serve with the mushrooms, onions and wasabi. "]}, {"isVegetarian": false, "title": "Beef fillet with potato rosti and Madeira sauce", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_potato_43905", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large Maris Piper potatoes, peeled and coarsley grated", "2 tbsp crème fraîche", "1 free-range egg, yolk only", "salt and freshly ground black pepper", "25g/1oz butter, melted", "25g/1oz butter", "1 banana shallot, halved lengthways", "sprig fresh thyme", "85g/3oz butter ", "1 banana shallot, finely chopped", "1 garlic clove, chopped", "50ml/2fl oz Madeira", "100ml/3½fl oz beef stock", "1 tbsp chopped fresh tarragon ", "1 tbsp rapeseed oil", "2 x 150g-200g/5½-7oz thick-cut beef fillets", "200g/7oz wild mushrooms", "2 tbsp chopped fresh parsley", "50g/1¾oz baby spinach"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the rosti, wrap the grated potatoes in a clean tea towel and squeeze out as much liquid as you can.", "Put the grated potato in a bowl with the crème fraîche and egg yolk. Season with salt and pepper. Stir to combine.", "Heat the butter in a frying pan over a medium heat and place two 7.5cm/3in chefs' rings into the pan. (If you don’t have chef’s rings just shape the potato mix into two patties.) Spoon the potato mixture into the rings, press down well using a spoon, and cook for 3-4 minutes, or until golden-brown, then remove the rings (if using). ", "Turn the rosti over, press the mixture down and cook for 3-4 minutes on the other side, or until cooked through. ", "For the shallot, dot knobs of butter in a roasting tin. Sit the shallot halves on the butter, cut-side down, and put the thyme sprig on top. Roast in the preheated oven for 5-10 minutes until soft.", "For the sauce, heat a frying pan and add 55g/2oz butter. Once hot add the shallot and garlic and cook for 2-3 minutes. Add the Madeira and stock. Cook until the volume of liquid has reduced by half and you have a thick sauce (homemade stock, or stock bought as liquid works best for this, rather than stock made from powder which is more watery). ", "Add the tarragon and stir in the rest of the butter, to give the sauce a glossy finish.", "For the beef, heat a frying pan and add the rapeseed oil. Once hot add the fillet steak and cook on each side for 3-4 minutes.", "When the beef is almost done, add the mushrooms to the pan. Baste the beef with the pan juices while cooking. When the beef is cooked to your liking remove it from the pan and set aside to rest. ", "Add the parsley to the mushrooms and cook for another couple of minutes until the mushrooms are cooked.", "In a separate pan, add the spinach and two tablespoons of water. Cook until wilted.", "To serve, place a rosti in the centre of each plate and top with the mushrooms and spinach. Place the beef on top and spoon over the sauce."]}, {"isVegetarian": false, "title": "Beef fillet with wild garlic purée and a fricasse of wild mushrooms", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_wild_74776", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "4 small shallots, sliced", "1 garlic clove, crushed", "300g/10½oz wild garlic ", "30g/1oz fresh chervil, chopped", "30g/1oz fresh tarragon, chopped", "150ml/5fl oz double cream ", "pinch salt", "2 tbsp olive oil/rapeseed oil", "75g/2½oz unsalted butter", "4 x 120g/4oz beef fillets", "100g/3½oz unsalted butter", "1 garlic clove, crushed", "1 shallot, finely chopped", "200g/7oz assorted wild mushrooms", "2 tbsp Madeira ", "100ml/3½fl oz beef stock or brown chicken stock", "1 tsp wholegrain mustard ", "1 tomato, peeled, de-seeded and finely chopped", "1 tsp chopped fresh tarragon ", "2-3 tbsp olive oil or rapeseed oil", "12 asparagus tips", "whole fresh wild garlic leaves "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the wild garlic purée, melt the butter in a sauce pan. Add the shallots and garlic in and cook gently without colouring them. Add the wild garlic, chervil and tarragon and cook until the wild garlic is tender. ", "Transfer to a blender. In a small pan bring the cream to the boil. Add this to the blender. Blend until smooth. Season with salt, to taste. Put into a plastic bottle and keep warm until serving. ", "For the beef, season the beef with salt. Heat the oil and butter in a frying pan until foaming. Cook the beef for a few minutes on each side until cooked to your liking. Set it aside to rest before serving.", "For the fricassee of wild mushroom, melt 20g/¾oz of the butter in a pan, add the garlic and chopped shallot and cook until transparent. Add the mushrooms, season with salt and pepper and cook gently for 3 minutes. Add the Madeira to the pan and scrape the bottom of the pan. Cook until reduced by a third in volume. Add the stock and bring to the boil. Whisk in the mustard and then the rest of the butter. Season with salt and pepper and then and the tomato and tarragon just before serving. ", "For the asparagus tips, heat a griddle pan to hot. Coat the asparagus in the oil, season with salt and pepper, then place onto the hot griddle, turning occasionally. Cook for about 5 minutes until done and ready to serve. ", "To serve, pipe the wild garlic purée onto the plate from the plastic bottle. Cut the beef in half, add to the plate with the mushroom fricassee and asparagus. Garnish with wild garlic leaves. "]}, {"isVegetarian": false, "title": "Beef hotpot", "url": "www_bbc_co_uk_food_recipes_beef_hotpot_59730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_hotpot_59730_16x9.jpg", "ingredients": ["1kg/2lb 2oz braising steak, trimmed, cut into 5cm/2in chunks", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "75g/3oz butter", "150g/5oz baby onions, peeled", "4 carrots, peeled, cut into chunks", "1 tbsp plain flour", "200ml/7floz red wine", "400ml/14fl oz fresh beef stock", "2 fresh thyme sprigs", "1kg/2lb 2oz potatoes, cut into 5mm/¼in slices"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Season the meat with salt and freshly ground black pepper.", "Heat a large casserole dish until very hot then add the oil and a small knob of butter. Fry the beef until browned all over, then remove from the pan and set aside. (You may need to do this in batches.)", "Add the onions and another knob of butter to the pan and fry for 2-3 minutes, or until lightly browned. Add the carrots and cook for a further minute.", "Stir in the flour then gradually add the red wine, stirring until smooth.  Add the browned beef and the stock, season with salt and freshly ground black pepper and bring to the boil. Stir in the fresh thyme, then arrange the potatoes on top. Dot the surface with the remaining butter.", "Cover with a lid and cook in the oven for one hour.", "Remove the lid and increase the heat to 200C/400F/Gas 6 for 30 minutes."]}, {"isVegetarian": false, "title": "Beef jhal faraizi, karhai broccoli and sweet and sour squash", "url": "www_bbc_co_uk_food_recipes_beef_jhal_faraizi_karhai_92693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz small floury potatoes, unpeeled", "2 tbsp olive or rapeseed oil", "½ tsp whole cumin seeds", "1 medium onion, cut into 7mm/⅓in cubes", "2-3 fresh, hot green chillies (such as bird’s-eye chillies), chopped", "340g/12oz leftover roast beef, 7mm/⅓in cubes", "1 tsp salt ", "freshly ground black pepper", "3 tbsp olive or rapeseed oil", "⅛ tsp ground asafoetida", "¼ tsp whole cumin seeds", "¼ tsp whole mustard seeds", "400g/14oz trimmed broccoli florets", "½ tsp salt", "¼ tsp cayenne pepper", "3 tbsp olive oil", "generous pinch ground asafoetida", "½ tsp whole brown or yellow mustard seeds", "560g/1¼lb peeled and de-seeded butternut squash, cut into 2.5cm/1in pieces", "¾-1 tsp salt", "1½ tsp caster sugar", "⅛-¼ tsp cayenne pepper", "1 tbsp plain yoghurt", "2 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef jhal faraizi, boil the potatoes in a pan of salted water and set aside to cool. Once cool, peel them and cut into 7mm/⅓in cubes.", "Heat the oil in a large frying pan, preferably non-stick, over a medium-high heat. When hot, add the cumin seeds. Let them sizzle for five seconds, then add the onion, cooked potatoes and chillies. ", "Lower the heat to medium and stir-fry the mixture for 4-5 minutes, or until the onion has softened and is translucent. Add the beef, salt and lots of freshly ground black pepper, then stir-fry for a further minute. ", "Reduce the heat to medium-low. Press down on all the ingredients in the pan with a spatula to form a flat cake that fills the pan. Continue to cook for 12-15 minutes, turning the pan so that the bottom of the ‘cake’ browns evenly. Keep warm. ", "For the karhai broccoli, heat the oil in a karhai (or lidded wok or frying pan) over a medium-high heat. ", "When the oil is hot, add the asafoetida, cumin and mustard seeds (be aware of mustard seeds popping out of the pan into your eyes). As soon as the mustard seeds begin to pop, add the broccoli. Stir-fry for one minute, then add the salt and cayenne pepper. ", "Pour in four tablespoons of water and bring the mixture to a simmer. Cover the pan with a lid, lower the heat until the mixture is simmering gently and cook for 7-8 minutes, or until the broccoli is just tender, stirring now and then.", "Meanwhile, for the sweet-and-sour butternut squash, heat the oil in a lidded pan over a medium heat. When hot, add the asafoetida and mustard seeds. As soon as the seeds start to pop - a matter of seconds - add the squash. ", "Stir-fry the squash for 2-3 minutes, or until the pieces just start to brown. Add 50ml/2fl oz water, cover the pan with a lid, lower the heat and cook for 8-10 minutes, or until the squash is tender.", "Add the salt, sugar, cayenne pepper and yoghurt. Stir until well combined and cook, uncovered, over a medium heat, until the yoghurt mixture has warmed through. Stir in the fresh coriander.", "To serve, break up the the beef jhal faraizi into four equal portions and serve it hot with the karahi broccoli and squash."]}, {"isVegetarian": false, "title": "Beef goulash soup (Gulyas leves)", "url": "www_bbc_co_uk_food_recipes_beef_goulash_soup_gulyas_16159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_goulash_soup_gulyas_16159_16x9.jpg", "ingredients": ["1kg/2lb 4oz braising steak or venison", "2 tbsp plain flour", "vegetable oil", "2 medium onions, diced", "4 medium carrots, diced", "2 celery sticks, leaves and all, diced", "1 red pepper, seeded and diced", "5 garlic cloves, crushed", "4 tbsp good sweet Hungarian paprika", "2 tbsp caraway seeds, crushed", "60g/4 tbsp tomato purée", "3 bay leaves", "2 litres/3½ pints good beef stock", "4 potatoes, peeled and chopped into small cubes", "flaked sea salt", "freshly ground black pepper", "soured cream and flat-leaf parsley, to garnish"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the meat and cut it into bite-sized chunks. In a large bowl, mix the flour with a teaspoon each of salt and pepper. Add the beef and toss so that all the chunks are dusted with flour. ", "Heat a tablespoon of oil in a large frying pan and brown the beef in small batches, setting each batch aside while you brown the next. Take care not to crowd the pan or the beef will steam rather than brown.", "Meanwhile, heat a little oil in a large heavy-bottomed pan, add the onions, carrots, celery, red pepper and garlic. Cook gently for about 10 minutes until they start to soften.", "Add the beef, paprika, caraway seeds, tomato purée and bay leaves, then pour in the beef stock.", "Stir well, cover the pan and simmer for at least 1½ hours until the beef is starting to get tender. Add the potatoes and continue to simmer for another 30 minutes. Check the seasoning before serving.", "Serve the soup in bowls with a generous swirl of soured cream and a good sprinkling of parsley."]}, {"isVegetarian": false, "title": "Beef olives and onion beer gravy", "url": "www_bbc_co_uk_food_recipes_beef_olives_and_onion_11851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil, for frying", "1 shallot, finely chopped", "2 tbsp chopped mushrooms", "120g/4½oz beef mince", "2 tbsp breadcrumbs", "1 tbsp Dijon mustard", "2 x 80g/3oz slices silverside or rump beef steak ", "2 onions, finely chopped", "1 tbsp plain flour", "100ml/3½fl oz dark ale", "250ml/9fl oz beef stock", "2 tbsp olive oil", "1 leek, roughly chopped ", "4 carrots, peeled and roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a dash of oil in a pan and fry the shallot and mushrooms until soft, then leave to cool.", "Mix the fried vegetables with the mince, breadcrumbs and mustard.", "Shape into two sausages the length of the beef slices, then roll the beef slice around the mixture. Tie with kitchen string, and season with salt and pepper.", "Heat a little more oil in a pan and fry until golden-brown all over. Add the onions and cook until they have coloured a little, then add the flour and beer. Simmer for 5 minutes, then add the stock. Loosely cover and simmer for 30 minutes.", "Meanwhile, toss the leeks and carrots in olive oil and roast in the oven for 25-30 minutes. ", "Serve the beef olives with the leeks and carrots."]}, {"isVegetarian": false, "title": "Beef pasties", "url": "www_bbc_co_uk_food_recipes_beef_pasties_45473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4.5kg/10lb plain flour, plus extra for dusting", "3 tbsp salt", "2.25kg/5lb lard", "1.2 litres/2 pints cold water", "3kg/6lb 8oz beef skirt or braising steak, chopped into 2cm/1in cubes", "150g/5½oz plain flour", "salt and freshly ground black pepper.", "4.5kg/10lb potato, peeled, roughly chopped", "1.5kg/3lb 5oz swede, peeled, roughly chopped", "1.5kg/3lb 5oz onion, peeled, finely chopped", "10 free-range eggs, beaten"], "serves": "Makes 40 pasties", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, combine the flour, salt and lard and rub together until the mixture resembles breadcrumbs - this can be done in an industrial food processor or in batches. ", "Either by hand, or with the motor still running, gradually add the water in a thin stream until the mixture comes together as a dough. ", "Wrap the pastry in cling film and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/350F/Gas 4.", "For the filling, place the chopped beef and flour in a large bowl and mix until the meat is coated in the flour. Season, to taste, with salt and freshly ground black pepper.", "When the pastry has chilled, divide it into 40 even sized pieces. Roll out each piece of pastry onto a lightly floured work surface until it is just larger than a dinner plate. Make sure not to tear the pastry. ", "Using a dinner plate as a template, trim the edges of each piece of pastry to form a disc. ", "Spoon some of the chopped potato onto one half of each pastry disc, leaving 1.5cm/¾in free along the edges. ", "Spoon some of the chopped swede on top of the layer of potato, and then spoon some of the chopped onion on top of the layer of swede. Finally, spoon over some of the beef.", "Brush all round the edges of the pastry lightly  with a little of the beaten egg. ", "Fold the empty half of the pastry disc over the filled half and either press the edges together with a fork, or twist the edges to seal.", "Brush the top of each pasty with more beaten egg. Using a sharp knife, cut a small cross shape in the top of the pasties through which the steam can escape. Repeat the process with the remaining pastry, vegetables and meat.", "Place the pasties onto a baking tray and transfer to the oven. Bake for 45-50 minutes, or until the pastry is crisp and golden-brown and the filling is cooked through and piping hot.", "When the pasties are cooked, remove them from the oven and set aside to rest for 5-10 minutes before serving."]}, {"isVegetarian": false, "title": "Beef pithivier", "url": "www_bbc_co_uk_food_recipes_beef_pithivier_74073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz leftover cooked vegetables, roughly chopped", "1 tbsp chopped flatleaf parsley", "sea salt and freshly ground black pepper", "50ml/2fl oz leftover beef gravy, plus extra to serve", "2 x 375g/13oz ready-made all-butter puff pastry", "plain flour, for dusting", "2 tsp wholegrain mustard", "300g/10½oz leftover cooked beef, cut into thin slices", "2 free-range egg yolks, beaten"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Line a large baking sheet with silicone baking paper.", "Mix the vegetables and parsley together in a bowl, then season, to taste, with salt and freshly ground black pepper. Squashing the mixture slightly into a mass, adding enough of the leftover gravy for it to stick together.", "Roll out one piece of pastry onto a lightly floured work surface to a thickness of 3mm. Upturn a dinner plate onto the pastry and cut round it using a sharp knife to create a large pastry disc. Find a bowl that is about 3cm/1¼in smaller in diameter than the pastry disc, then upturn it in the centre and use it as a template to score a smaller circle on the pastry. Transfer the pastry disc to the prepared baking tray.", "Prick the inner pastry circle several times with a fork. Spread over some of the mustard, then arrange some of the cooked beef on top, then spread some of the vegetable mixture on top of that, always keeping inside the scored circle.", "Spoon alternate layers of the mustard, beef, and vegetable mixture in the centre of the pastry disc until everything is used up.", "Brush the pastry border with some of the beaten egg.", "Roll out the second piece of pastry onto a lightly floured work surface to a thickness of about 5mm/¼in. Lay the pastry over the top of the dome of filling, pressing down gently around the edges to seal the two pieces of pastry together.", "Trim away any excess pastry. Use any offcuts to decorate the top of the pithivier with a flower shape. Use a butter knife to score details into the petals and stem, if desired.", "Brush the surface of the pithivier all over with the remaining beaten egg. Bake in the oven for 20 minutes, or until the filling is piping hot and the pastry is crisp and golden-brown.", "Serve the pithivier with the remaining leftover gravy."]}, {"isVegetarian": false, "title": "Beef pho", "url": "www_bbc_co_uk_food_recipes_beef_pho_34022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 star anise", "4 cloves ", "2 tbsp coriander seeds", "1 large onion, unpeeled, halved", "1 large thumb-sized piece fresh root ginger, unpeeled and halved", "1.5 litres/2¾ pints beef stock", "1 bone marrow, cleaned ", "3 tbsp fish sauce", "250g/9oz flat rice noodles", "400g/14oz best-quality sirloin steak, fat removed, very thinly sliced", "large handful beansprouts ", "3 spring onions, thinly sliced", "1 red chilli, thinly sliced", "small handful mint leaves", "small handful basil leaves", "small handful coriander leaves", "2 limes, quartered"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to the medium-high setting.", "Place a frying pan over a high heat. When hot, add the star anise, cloves and coriander seeds and toast until aromatic. Transfer to a plate and set aside.", "Put the onion and ginger on a grill pan and place under the grill, turning from time to time, until soft and slightly caramelised, but lightly charred on all sides. Leave to cool a little, then peel the onion and ginger and discard the skins. ", "Put the onion, ginger and toasted spices into a large, lidded pot. Add the stock and bone marrow and bring to a steady simmer. Cover, lower the heat a little and simmer for 30 minutes to allow the flavours to develop and infuse the broth. Add the fish sauce for the last 10 minutes of the cooking time. ", "Strain the broth through a sieve into a clean saucepan and return to the boil.", "Meanwhile, cook the noodles according to the packet instructions, drain and refresh under cold running water to stop the cooking process. ", "Put the noodles in deep bowls and top with the sirloin. Ladle the hot broth over the top. Add the beansprouts, spring onions, chilli, herbs and a wedge of lime at the table. "]}, {"isVegetarian": false, "title": "Beef ragù and courgetti", "url": "www_bbc_co_uk_food_recipes_beef_rag_and_courgetti_60735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp ghee or butter ", "2 onions, finely chopped ", "2 garlic cloves, finely chopped", "2 dried bay leaves", "¼ tsp mixed spice (or try a tiny pinch of nutmeg)", "2 tsp dried oregano", "400g/14oz beef mince (chuck or braising steak - not lean meat)", "100g/3½oz chicken livers, trimmed and chopped", "250ml/9fl oz red wine", "14 large tomatoes, roughly chopped, or 2 x 400g/14oz tins chopped tomatoes or 800g/1lb 12oz tomato passata ", "2 tsp tomato purée ", "200ml/7fl oz bone broth or water (you won’t need much if using tinned tomatoes)", "2 large carrots, finely grated ", "sea salt and freshly ground black pepper ", "1 large handful fresh parsley, finely chopped", "4 large courgettes ", "knob of butter", "extra virgin olive oil, to serve", "100g/3½oz parmesan, grated, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the ghee or butter in a large saucepan and gently fry the onion over a low heat until softened but not browned (about 10 minutes). Add the garlic, bay leaves, mixed spice, oregano and fry for a further two minutes. ", "Increase the heat and add the beef to the pan, using a wooden spatula to break it up as you cook.", "After five minutes, add the chicken livers, pour in the red wine and stir to deglaze the pan, then add the tomatoes, tomato purée and bone broth or water.", "Bring to the boil, cover with a lid, leaving the lid just slightly off, then reduce to a gentle simmer, stirring occasionally, for 2½ hours, or until rich and thickened. It is even better after 3-4 hours. Keep an eye on it and add more liquid if needed.", "Add the grated carrots 15 minutes before the end of cooking. Turn up the heat to a medium simmer and season with sea salt, a good grind of pepper and the fresh parsley.", "Meanwhile, use a spiralizer or julienne peeler to make the spaghetti from the courgettes. This is the courgetti. Or you can use a regular vegetable peeler to slice the courgettes lengthways into very wide ribbons, which you can then slice in half. You might want to cut the long strands in half to make them easier to eat.", "Soften the courgetti in a pan with a little butter, stirring over a low heat for three minutes. Alternatively, save washing up another pan by just running some of the hot sauce through your spirals – the heat and salt in the sauce will soften them.", "Serve the courgette and beef ragù in bowls. Drizzle each bowl with extra virgin olive oil and serve with grated parmesan."]}, {"isVegetarian": false, "title": "Beef ragu with linguine", "url": "www_bbc_co_uk_food_recipes_beef_ragu_with_linguine_27254", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_ragu_with_linguine_27254_16x9.jpg", "ingredients": ["300g/10½oz '00' flour, plus extra for dusting", "3 free-range eggs", "2 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 large carrot, finely chopped", "1 celery stalk, trimmed, finely chopped", "200g/7oz smoked bacon lardons", "500g/1lb 2oz beef mince", "2 tbsp tomato purée", "1 x 400g tin tomatoes", "150ml/5fl oz red wine", "handful fresh basil leaves, roughly torn", "salt and freshly ground black pepper", "3-4 tbsp freshly grated Parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the homemade pasta, tip the flour onto a clean work surface and make a well in the centre. Crack the eggs into the well, then gradually draw the flour into the eggs until the mixture comes together as a sticky dough. Knead the dough on a lightly floured work surface until all of the flour has been incorporated and the dough is smooth. Alternatively, blend the flour and eggs in a food processor until the mixture forms small crumbs. Tip it out onto a clean, lightly floured work surface and squish into a ball, then knead for a few minutes until smooth. ", "Wrap the pasta dough in cling film and chill for 20 minutes in the fridge.", "Dust the rollers of your pasta-rolling machine with flour.", "Cut the chilled pasta dough into 3 equally sized pieces and flatten them with the palms of your hand to a thickness of 1cm/½in. ", "Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3 or 4 more times, flouring the machine and changing the setting down each time until the last but one setting. You should end up with a long sheet of pasta.", "Repeat the rolling process with the remaining pieces of pasta dough.", "Fold the rolled pasta sheets over into a manageable size, then cut them lengthways to form strips of linguine about 3mm thick. Hang the linguine over a rack so that it can dry out slightly while you make the ragu.", "For the ragu, heat the oil in a large flameproof casserole over a medium heat. Add the onions and garlic and fry for 2-3 minutes, or until softened but not coloured.", "Add the carrot and celery and fry for another 2-3 minutes. Add the bacon and fry for a further 1-2 minutes. ", "Add the beef mince and fry for 2-3 minutes on each side, or until just browned.", "Stir in the tomato purée and continue to cook for 1-2 minutes, then pour in the tinned tomatoes and red wine and bring the mixture to the boil. ", "Stir in half of the basil leaves, then reduce the heat until the mixture is simmering. Simmer for 45 minutes, or until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. Stir in the remaining basil leaves just before serving. ", "To serve, bring a large pan of salted water to the boil. Add the pasta and cook for 3-4 minutes, or until tender. Drain well, then add the pasta to the pan of ragu and mix well to coat the pasta in the sauce. Serve sprinkled with the Parmesan."]}, {"isVegetarian": false, "title": "Beef rendang", "url": "www_bbc_co_uk_food_recipes_beef_rendang_62793", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_rendang_62793_16x9.jpg", "ingredients": ["2 lemongrass stalks, dry outer leaves removed, roughly chopped ", "3 medium-sized red onions, quartered", "6 garlic cloves, peeled", "25g/1oz fresh root ginger, peeled and roughly chopped", "75g/2½oz chunk galangal, peeled and roughly chopped ", "3 plump red chillies, roughly chopped without deseeding ", "3 tbsp sunflower oil", "2 tsp ground cumin", "1 tbsp ground coriander", "1 tsp ground turmeric", "1.5kg/3lb 5oz beef chuck steak (or any good braising beef), trimmed and cut into 3cm/1¼in cubes", "400ml/14fl oz can coconut milk", "4 fresh kaffir lime leaves", "1 cinnamon stick", "1 tbsp soft light brown sugar or palm sugar", "2 tsp tamarind paste or freshly squeezed juice of 1 lime", "2 tbsp dark soy sauce", "2 tsp flaked sea salt, plus extra to season", "ground black pepper", "toasted coconut flakes, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a food processor combine the lemongrass, onions, garlic, ginger, galangal and chillies. Blend to a fine paste (you may need to remove the lid and push the mixture down a couple of times with spatula until the right consistency is reached).", "Heat the sunflower oil in a large flame-proof casserole and fry the paste gently for 3-4 minutes, stirring constantly. Add the cumin, coriander and turmeric and cook for two minutes.", "Add the beef to the pan and stir to coat in the paste and spices. Cook for five minutes, stirring constantly until the meat is very lightly coloured all over. Pour the coconut milk and 400ml/14fl oz cold water into the casserole. Add the lime leaves, cinnamon stick, sugar, tamarind paste or lime juice, soy sauce and salt and bring to a simmer. ", "Reduce the heat and leave to gently simmer uncovered for about 2½-3 hours, or until the meat is meltingly tender and the sauce is very thick, glossy and rich. Stir the beef occasionally towards the beginning of the cooking time then more often as the coconut milk reduces. You don’t want the sauce to stick. Season to taste with more salt and freshly ground black pepper.", "Spoon the curry into warm serving dishes, pick out the kaffir lime leaves and cinnamon stick, and sprinkle with the toasted coconut, if using."]}, {"isVegetarian": false, "title": "Beef rendang with mango chutney and sticky rice", "url": "www_bbc_co_uk_food_recipes_beef_rendang_with_mango_78223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemongrass stalks, roughly chopped", "20g/¾oz coriander seeds", "½ tsp cumin seeds", "½ tsp ground turmeric", "1 star anise", "3 cardamom pods, crushed and seeds removed", "50g/1¾oz coconut cream", "1½ large onions, sliced", "3 garlic cloves, chopped", "3 red chillies, seeds removed, chopped", "1 thumb-sized piece fresh root ginger, peeled and chopped", "1 bay leaf", "750g/1lb 10oz beef shin, boneless and cut into 2.5cm/1in cubes", "1 x 400g/14oz tin coconut milk", "250ml/9fl oz strong veal or beef stock, heated", "1 tsp black mustard seeds", "1 tsp black peppercorns", "1 tsp cumin seeds", "1 tsp dried chilli flakes", "1 tsp coriander seeds", "1 green (under ripe) mango, sliced", "2 ripe mangoes, sliced", "125g/4½oz light soft brown sugar", "110ml/3¾fl oz malt vinegar", "400g/14oz sticky rice", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef rendang, pound the lemongrass to a pulp in a pestle and mortar. ", "Gently toast the coriander seeds, cumin seeds and turmeric, star anise and cardamom in a dry frying pan until fragrant, then grind until the spices are as smooth as possible.", "In a wide pan (or cast-iron wok), heat the block of coconut cream until it melts, but keep the heat low so it does not burn. Add the onions, garlic, chillies, ginger and pounded lemongrass and cook gently until the onions have softened and the mixture starts to smell beautiful and fragrant. ", "Add the ground spices and the bay leaf and fry for a few minutes more until the mixture is really bursting with aroma. Stir in the beef and increase the heat so that it browns it well and is completely coated with the spices – this will take a few minutes. ", "Add the coconut milk, bring to the boil and then add the hot stock. Turn the heat up to high and continue cooking - the amount of liquid will quickly reduce. Only stir occasionally until the sauce reduces to a thick paste. Reduce the heat and keep cooking and stirring until the sauce becomes thick like lava and really coats the meat – at least 1-1½ hours.", "For the mango chutney, heat a frying pan until hot. Add all the spices and toast for 30 seconds, or until the mustard seeds start to pop. Add the green mango and ripe mangoes and cook for 1-2 minutes. Add the sugar and cook until dissolved into the mango juices, then add the vinegar.", "Cover with a lid and reduce the heat. Simmer for 25 minutes, or until the mango has broken down and the mixture resembles chutney.", "For the sticky rice, rinse the rice three times and drain thoroughly.", "Cook the rice according to the packet instructions, or place it in a saucepan and cover with water up to the first knuckle on your finger. Add the salt, cover with a lid and bring to the boil. Boil for five minutes, then, without opening the lid, turn the heat off and let the rice steam for 20 minutes. ", "To serve, pile the rice onto serving plates, and add the beef rendang alongside with a spoonful of the mango chutney."]}, {"isVegetarian": false, "title": "Beef ribs with barbecue sauce, baked potato and chive soured cream", "url": "www_bbc_co_uk_food_recipes_beef_ribs_with_bbq_sauce_80391", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_ribs_with_bbq_sauce_80391_16x9.jpg", "ingredients": ["4 Jacob’s ladder beef ribs", "1 onion, chopped", "1 head of garlic, cut in half horizontally", "1 tsp fennel seeds", "2 star anise", "4 baking potatoes", "a little oil", "sea salt and freshly ground black pepper", "200ml/7fl oz double cream", "1 lemon, juice only", "3 tbsp chives, finely sliced", "25g/1oz butter, plus extra to serve", "1 onion, roughly chopped", "1 garlic clove, crushed", "2 red chillies, finely sliced", "1 tsp fennel seeds, crushed", "2 star anise", "150g/5½oz light muscovado sugar", "300g/10½oz tomato ketchup", "150g/5½oz chipotle chilli ketchup", "150ml/5fl oz dark soy sauce"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ribs in a large, wide saucepan. Cover with water and add the onion, garlic, fennel seeds and star anise.", "Bring to a boil, then reduce the heat and simmer very gently for three hours, or until the meat is tender, skimming any scum off occasionally.", "Preheat the oven to 200C/400F/Gas 6.", "Rub the baking potatoes with a little oil. Create four small piles of sea salt in a baking tray then place the potatoes on top. Bake for 1-1½ hours, or until tender.", "Meanwhile, make the bbq sauce. Heat a sauté pan until hot and add the butter, onions and garlic and fry for 4-5 minutes, or until softened.", "Add the chillies, fennel seeds, star anise and sugar. Cook for a further 3-4 minutes until the sugar has dissolved. ", "Add the ketchups and soy sauce and bring to the boil. Reduce the heat and simmer for five minutes, or until thickened.", "Remove from the heat and cool slightly before placing in a blender. Pulse to form a smooth pureé.", "Dip the ribs into the sauce then place into a roasting tray and spoon some more sauce over the top. Place in the oven with the potatoes for 15-20 minutes until sticky. ", "While the ribs cook, put the double cream, lemon juice, chives and a pinch of salt into a large bowl and whisk until thickened.", "Serve the ribs with the jacket potato topped with a dollop of butter and soured cream."]}, {"isVegetarian": false, "title": "Beef shin and blue cheese cobbler", "url": "www_bbc_co_uk_food_recipes_beef_shin_and_blue_34138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz shin of beef", "plain flour, for dusting", "1 tbsp olive oil", "100g/3½oz butter", "150g/5½oz smoked panetta, roughly chopped", "4 onions, thinly sliced", "½ head celery, thinly sliced", "2 tbsp soft brown sugar", "2 tbsp red wine vinegar", "500ml/18fl oz dark Belgian beer", "1–2 bay leaves", "2 thyme sprigs", "1 head garlic, cut in half", "salt and freshly ground black pepper ", "1 tbsp finely chopped parsley, to garnish", "250g/9oz self-raising flour", "50g/1¾oz butter, chopped", "1 tsp salt", "1 tsp finely chopped thyme", "150g/5½oz Stilton, crumbled", "150ml/5fl oz milk"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Season the beef and roll in a little flour.", "Heat the oil in a large casserole dish and sear the beef all over. Remove the beef and set aside. ", "Melt the butter, then add the pancetta, onions and celery and cook until the onions are soft and the pancetta is crisp. ", "Return the beef to the pan, then add the sugar and vinegar. Allow to bubble then pour in the beer. Add the herbs and garlic and cook for 2–3 hours, or until the beef is tender and falling apart.", "Remove the dish from the oven and increase the oven temperature to 200C/180C Fan/Gas 6. ", "To make the topping, rub the flour and butter together with the salt and thyme. Stir in the cheese and slowly add the milk. Mix until you have a rough dough. ", "Roll the dough into a 3cm/1¼in thick log. Cut it into slices and layer it over the beef stew.", "Cook for 25–30 minutes. Sprinkle over the parsley and serve."]}, {"isVegetarian": false, "title": "Beef steak burger with truffle mayonnaise, tomato chutney in a brioche bun with fries", "url": "www_bbc_co_uk_food_recipes_beef_steak_burger_with_02716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz minced beef steak", "2 large chipping potatoes, peeled and cut into thin fries", "vegetable oil, for deep-frying", "4 brioche rolls", "8 gherkins, sliced", "4 beef tomatoes, sliced", "½ round lettuce, leaves separated", "1 red onion, sliced", "1 tbsp olive oil", "½ shallot, chopped", "1½ tomatoes, chopped", "1 garlic clove, crushed", "1 tbsp balsamic vinegar", "1 tsp brown sugar", "3 egg yolks ", "2 tsp Dijon mustard ", "150ml/5fl oz light olive oil ", "100ml/3½fl oz sunflower oil ", "50ml/2fl oz truffle oil", "2 tbsp lemon juice ", "few shavings of black truffle (optional)", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the burger and fries, put the mince in a large bowl and season with salt and pepper. Use your hands to shape the mince into four burger-shaped patties. Wrap the patties individually in cling film and place in the fridge for an hour.", "Meanwhile, for the tomato chutney, heat the oil in a small pan. Add the shallot, tomatoes and garlic and cook for 5-8 minutes until softened. Add the vinegar and sugar and cook for 3-5 minutes until the chutney has caramelised slightly.", "For the truffle mayonnaise, put the egg yolks, mustard and a pinch of salt and pepper in a food processor and combine. Mix the oils in a jug, then, with the motor running, slowly pour oil through the feed tube until you have a thick emulsion. Mix in the lemon juice and a little warm water to loosen, if necessary. ", "The mayonnaise will keep for up to 2 days in the fridge. Just before serving, stir in the truffle shavings.", "When you are ready to cook the burger and fries, heat the vegetable oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep saucepan until a cube of bread sizzles and turns brown when dropped in. (CAUTION: Hot oil can be dangerous; do not leave unattended.) ", "Carefully add the potatoes to the fryer and cook for 2-3 minutes, or until just coloured and crisp. Remove from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper. Season with salt.", "Heat a large frying pan with a little oil. Cook the burgers on each side for 2-3 minutes, or until cooked to your liking (you can serve the burger rare as you are using fresh steak mince).", "To serve, put each burger in a brioche roll topped with the gherkins, tomato slices, chutney, lettuce, a few onion slices and the truffle mayonnaise. Secure with a wooden skewer and serve with the fries."]}, {"isVegetarian": false, "title": "Beef stew and dumplings with Vichy carrots", "url": "www_bbc_co_uk_food_recipes_beef_stew_and_dumplings_09183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "25g/1oz unsalted butter", "750g/1lb 10oz stewing steak, cut into 2-3cm/¾-1¼in pieces", "2 tbsp plain flour", "2 garlic cloves, chopped", "250g/9oz round shallots, peeled and left whole", "150ml/5½fl oz red wine", "500ml/18fl oz beef stock", "2 fresh bay leaves", "3 tbsp fresh thyme leaves", "Worcestershire sauce, to taste", "salt and black pepper", "125g/4½oz plain flour", "1 tsp baking powder", "pinch salt", "60g/2¼oz suet", "4 medium carrots, peeled and left whole", "50g/1¾oz unsalted butter", "1 tbsp sugar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.", "Sprinkle over the flour and cook for a further 2-3 minutes. Add the garlic and shallots and fry for 1-2 minutes.", "Stir in the wine, stock and herbs, then add the Worcestershire sauce to taste. Season to taste with salt and freshly ground black pepper.", "Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.", "For the dumplings, sift the flour, baking powder and salt into a bowl. Add the suet and enough water to form a thick dough. With floured hands, roll spoonfuls of the dough into small balls.", "After two hours, remove the lid from the stew and place the dumpling balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)", "For the Vichy carrots, place the carrots, butter, sugar and four tablespoons of water into a pan and bring to a simmer.", "Cover with a lid or cartouche (a circle of greaseproof paper arranged so that it covers the top of the carrots) and cook gently for 4-5 minutes, or until the carrots are tender. Season with salt and black pepper.", "To serve, place a spoonful of the stew onto a plate and place one whole carrot and a dumpling next to it."]}, {"isVegetarian": false, "title": "Beef in oyster sauce", "url": "www_bbc_co_uk_food_recipes_beef_in_oyster_sauce_14507", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_in_oyster_sauce_14507_16x9.jpg", "ingredients": ["450g/1 lb fillet of beef, cut into 5cm/2in thin strips", "1 tbsp light soy sauce", "2 tsp sesame oil", "1 tbsp Shaoxing rice wine or dry sherry", "2 tsp cornflour", "3 tbsp groundnut or vegetable oil", "3 tbsp oyster sauce", "1½ tbsp finely chopped spring onions", "2 tsp Dijon mustard", "2 tsp Madras curry powder", "2 tbsp light soy sauce ", "2 tsp salt", "1 tsp freshly ground black pepper", "4 tbsp extra virgin olive oil ", "100g/3½oz broccoli florets, cut into small florets", "100g/3½oz French beans, trimmed ", "100g/3½oz cauliflower florets, cut into small florets", "100g/3½oz peas", "225g/8oz fresh tomato, peeled, seeds removed, chopped", "50g/2 oz fresh water chestnuts, peeled, sliced", "3 tbsp finely chopped shallots, squeezed dry through a linen cloth ", "3 tbsp finely chopped fresh chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the beef, soy sauce, sesame oil, Shaoxing rice wine or dry sherry and cornflour into a bowl and mix together until well combined. Set aside to marinate for 20 minutes.", "Heat a wok or large frying-pan until it is very hot. ", "Add the oil, and when it is very hot and slightly smoking, add the beef slices and stir-fry for 5-6 minutes or until they are pale golden-brown. ", "Remove the beef strips and set aside to drain in a colander over a bowl. Discard the drained oil.", "Wipe the wok or pan clean and reheat it over a high heat until it is hot. ", "Add the oyster sauce, and bring to a simmer. ", "Return the drained beef slices and mix them thoroughly with the sauce. ", "Turn the mixture onto a serving platter and garnish with the spring onions.", "Meanwhile, for the salad, mix the mustard, curry powder, soy sauce, salt, pepper and olive oil together in a bowl. ", "Cook the broccoli, green beans and cauliflower in boiling water for 2-3 minutes, then add peas and cook for 1-2 minutes.", "Drain the vegetables into a warm bowl, then add the water chestnuts and tomatoes, shallots and chives.  Drizzle over the salad dressing and mix until well combined.", "Serve the salad alongside the beef."]}, {"isVegetarian": false, "title": "Beef stew with fluffy dumplings", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_fluffy_95002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_fluffy_95002_16x9.jpg", "ingredients": ["1kg/2lb 4oz silverside beef, cut into large pieces", "1 tsp plain flour", "2 tbsp vegetable oil", "2 onions, cut into chunks", "3 carrots, scrubbed and cut into large pieces", "4 sticks celery, cut into large pieces", "1 tbsp tomato purée", "300ml/10½fl oz red wine", "500ml/18fl oz beef stock", "2 sprigs fresh parsley", "1 bay leaf", "3 sprigs fresh thyme", "2 garlic cloves, finely sliced", "25g/1oz butter", "1 tsp redcurrant jelly", "200g/7oz plain flour, plus extra for dusting", "1½ tsp baking powder", "100g/3½oz suet, shredded ", "2 tbsp finely chopped flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dredge the beef in the flour until coated.", "Heat half of the vegetable oil in a large, lidded casserole dish over a high heat. Fry the beef, in batches, until browned on all sides, about 3-4 minutes. Remove and set aside.", "Add the onions, carrots and celery to the casserole and fry for 2-3 minutes. Add the tomato purée, stir well, then cook for a further 1-2 minutes.", "Pour in the red wine, bring it to the boil, then reduce the heat until the mixture is simmering and simmer until it has reduced in volume by half. Add the beef stock and return the mixture to a simmer. Return the beef to the casserole and stir well. ", "Tie the herbs together as a bouquet garni using cooking string and add it to the casserole. Finally, stir in the garlic. ", "Cover the stew with the lid and simmer gently for 1½ hours, or until the beef is really tender.", "For the dumplings, in a bowl, mix together the flour, baking powder, suet, chopped parsley and a pinch of salt, then gradually add 3-5 tablespoons water, mixing as you do so, until the mixture comes together as a slightly sticky dough (you might not need to use all of the water). ", "Turn out the dough onto a lightly floured work surface and roll into small balls, each half the size of a golf ball. Set aside until the stew is ready.", "Remove the bouquet garni from the stew, season, to taste, with salt and freshly ground black pepper, then stir in the butter and redcurrant jelly.", "Top the stew with the dumplings, cover the casserole with the lid, then return to the oven for 10-15 minutes, or until the dumplings have puffed up and are cooked through. Serve in bowls."]}, {"isVegetarian": false, "title": "Beef stew with light herby dumplings", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_light_80291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_light_80291_16x9.jpg", "ingredients": ["spray oil, for frying", "600g/1lb 5oz lean stewing beef, all visible fat removed", "1 litre/1¾ pints beef stock, made from 2 low-sodium cubes", "1 large onion, finely chopped", "2 garlic cloves, crushed", "2 celery sticks, finely chopped", "3 carrots, 1 finely chopped, rest cut into chunks", "1 tbsp tomato purée", "1 tbsp balsamic vinegar", "1 parsnip, cut into chunks", "300g/10½oz butternut squash (about half a squash)", "150g/5½oz self-raising flour", "pinch salt and freshly ground black pepper", "2 tbsp chopped fresh parsley or thyme (depending on preference) ", "1 egg yolk, lightly beaten", "1 tsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Preheat a casserole dish on the hob, then spray with oil. Add the beef in batches, cooking each batch until browned all over and spraying with more oil as needed. Transfer the beef to a plate using a slotted spoon and set aside. Add a little stock to the dish, turn the heat up to high, and deglaze by scrubbing off the cooked-on bits with a spatula. ", "Turn down the heat and spray the dish with more oil. Add the onion and cook until softened. Add the garlic and cook for 1-2 minutes. Add the celery and finely chopped carrot and cook for 3-4 minutes. Stir in the tomato purée and balsamic and cook for 2-3 minutes more. Return the meat to the pan and stir in the rest of the stock, then bring to the boil.", "Put the dish in the oven (without a lid) and cook for 1 hour. ", "Add the parsnip, butternut squash and carrot chunks, put the lid on the dish and cook for another 30 minutes.", "For the dumplings, put the flour in a mixing bowl with the salt and pepper. Mix in the herbs. Add the egg and oil and mix, adding just enough cold water to bring it together as a dough (about 4 tbsp). Be careful not to add too much water as this will make the dumplings heavy. Knead the mixture a little.", "Shape into eight golf-ball-sized pieces and put on top of the stew, pushing down a little to coat in the juices. Cover with the lid and return to the oven for 15 minutes, then remove the lid and cook for a further 15 minutes. ", "When the dumplings are golden-brown, lift them out of the stew into serving bowls and stir the stew (the squash will be very tender, which will thicken and flavour the sauce). Serve immediately."]}, {"isVegetarian": false, "title": "Beef stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_stroganoff_16029", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stroganoff_16029_16x9.jpg", "ingredients": ["½ tbsp light olive oil ", "1 large onion, finely sliced", "3 garlic cloves, finely chopped", "1 beef stock cube", "2 tsp sweet smoked paprika", "1 tbsp tomato purée", "400g tin beef consommé", "150g/5½oz chestnut mushrooms, thinly sliced", "1 tbsp Dijon mustard", "2 rump steaks (175g/6oz each), visible fat trimmed", "olive oil spray", "60g/2¼oz cornichons or small gerkins, sliced", "75ml/2½fl oz half-fat crème fraîche", "2 tbsp finely chopped flatleaf parsley", "2 tbsp roughly chopped chervil", "2 tbsp dried onion flakes", "sea salt and freshly ground black pepper", "160g/5¾oz basmati rice, freshly cooked"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the light olive oil in a large frying pan over a low–medium heat. Add the onion and cook gently for 10 minutes, or until softened and starting to caramelise.", "Stir in the garlic and cook gently for 2 minutes. Crumble in the stock cube and stir in the paprika and tomato purée. Cook, stirring, for 2 minutes. Add the beef consommé, mushrooms and mustard. Bring to the boil then lower the heat and simmer for 10–15 minutes, or until the volume of liquid has reduced by half.", "Meanwhile, place a griddle pan over a high heat. Bash the steaks between two sheets of cling film, until about 5mm/¼in thick. Spray each side with six sprays of oil and season with salt and pepper. When the griddle is smoking hot, add the steaks and cook for 1 minute on each side. Remove and set aside to rest.", "Once the sauce has reduced, remove from the heat and stir through the cornichons, crème fraîche, and most of the parsley and chervil (reserving some for garnishing). Stir in the juices from the resting meat and check the seasoning. Cut the meat into thick slices and stir into the sauce.", "Mix together the dried onion flakes and reserved chopped parsley and chervil. Serve the stroganoff sprinkled with the onion and herb mix, with the rice on the side, if you like."]}, {"isVegetarian": false, "title": "Beef stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_stroganoff_21900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz vegetable oil ", "4kg/8lb 12oz braising steak, cut into thin strips", "10 large onions, sliced", "15 red peppers, seeds removed and sliced ", "2.5kg/5lb 8oz button mushrooms, sliced", "2 tbsp paprika", "1 litre/1¾ pints water", "2.5 litres/4½ pints plain yoghurt"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the vegetable oil in large frying pans and add the meat. Fry for 2-3 minutes, turning once or twice, until the meat is browned all over then remove the meat from the pan and set aside. ", "Add a little more oil if necessary and fry the onions for 3-4 minutes or until just starting to soften, then stir in the peppers and cook for a further 3-4 minutes. Add the mushrooms and cook for a further five minutes.", "Sprinkle in the paprika and stir to coat the vegetables then add the water and yoghurt and reduce the heat.  ", "Stir in the beef and any resting juices. Transfer to ovenproof dishes, cover with aluminium foil and cook in the oven for about one and a half hours or until the meat it tender and the sauce is thick."]}, {"isVegetarian": false, "title": "Beef sukiyaki", "url": "www_bbc_co_uk_food_recipes_beef_sukiyaki_84557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175ml/6fl oz liquid instant dashi ", "150ml/5fl oz soy sauce", "50ml/1¾fl oz mirin ", "2 tbsp groundnut oil ", "2 tsp sesame oil", "450g/1lb fillet or well-trimmed rib-eye beef steak, thinly sliced (a little thicker than carpaccio)", "1½ tbsp sugar ", "12 button mushrooms, sliced", "4 brown cap mushrooms sliced", "100g/3½oz enoki mushrooms, split into 4", "6 fresh shiitake mushrooms (remove stalks and cut in ½)", "½ Chinese cabbage (ideally Napa cabbage) sliced 2.5cm/1in thick ", "1½ sticks celery, sliced on a diagonal 5mm/¼in thick ", "160-175g/5¾-6oz block firm tofu, cubed ", "200g/7oz sliced bamboo shoots sliced, vacuumed-packed (alternatively used canned and drained bamboo shoots) ", "6 spring onions, cut into 2.5cm/1in pieces on a slant ", "cooked rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, mix the liquid dashi with 175ml/6fl oz of water in a jug to bring the total liquid to 375ml/13fl oz. Stir in the remaining ingredients for the sauce. Set aside.", "For the beef, heat a large lidded frying pan that’s suitable to serve at the table. Heat the groundnut oil and sesame oil until hot. Add the beef and sprinkle the sugar over. The sugar will help caramelise the meat.  Turn the meat over after about 30 seconds - as the beef is so thin it will cook very quickly.", "Remove the meat from the pan. Add the mushrooms, cabbage, celery, tofu and bamboo shoots to the same pan and cook for another two minutes - just to brown the tofu slightly and to wilt the cabbage. You do not want to over-cook as you still want to retain the textures of the celery.", "Add the sukiyaki sauce to the pan, put the lid on and simmer for two minutes.", "Remove the lid, turn the vegetables and the tofu over and then combine the beef into the vegetables. Add the spring onions and simmer for a further two minutes.", "Serve in the pan at the table so that everyone can help themselves, or divide the mixture into four bowls with a bowl of rice each."]}]