[{"ingredients": ["1 cucharada de mantequilla suave", "Papas cerosas de 500 g / 1 lb 2 oz, p. Maris Peer o Charlotte", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 hoja de laurel", "200 g / 7oz de lardons o cubitos de tocino ahumado", "100 ml / 3½ fl oz de vino blanco seco", "250 g / 9 oz de queso Reblochon, en cubos"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y cepille una lata para muffins de seis hoyos con la mantequilla suave.", "Pele las papas y use la cuchilla juliana en una mandolina para hacer los fósforos finos (o corte a mano).", "Coloque la cebolla, el ajo, la hoja de laurel y los lardons en una sartén antiadherente grande y cocínelos hasta que los lardones estén dorados. Agregue el vino y reduzca hasta que solo queden un par de cucharadas de líquido. Retire la hoja de laurel.", "Agregue los fósforos de patata y quite el fuego, luego agregue los cubos Reblochon.", "Divida la mezcla de papa entre los seis agujeros en la lata de panecillos y hornee durante 15-20 minutos o hasta que estén dorados y burbujeantes. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_cheese_and_potato_nests_20525", "title": "Nidos de queso y patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_potato_nests_20525_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de queso parmesano (o alternativa vegetariana), rallado", "10 g de albahaca fresca (alrededor de un puñado) o 1 cucharada de albahaca seca", "10 g de cebollín fresco (alrededor de un puñado) o 1 cucharada de cebollín seco", "½ cucharadita de hojas de tomillo", "Harina de auto aumento 250g / 9 oz", "1 cucharadita de bicarbonato de soda", "85ml / 3fl oz de aceite de girasol", "2 huevos de gallinas camperas", "100 ml / 3½ fl oz leche semidesnatada", "100ml / 3½fl oz yogur natural bajo en grasa"], "method": ["Lave y pique finamente las hierbas con un cuchillo afilado o unas tijeras.", "Mezcle la harina y el bicarbonato de soda en un recipiente para mezclar y agregue el parmesano y las hierbas picadas.", "Mida el aceite en la jarra medidora.", "Batir los huevos por separado en un recipiente y luego añadir al aceite.", "Agregue la leche y el yogur a la mezcla de aceite y huevo.", "Vierta los ingredientes húmedos en los ingredientes secos y revuelva hasta que se combinen.", "Coloque la mezcla en las seis tazas, llenando cada una un tercio por completo.", "Coloque tres tazas en el microondas y cocine durante cuatro minutos a máxima potencia, o hasta que estén levantadas y firmes para tocarlas. Es posible que deba ajustar los tiempos ligeramente según el tamaño y el diseño de la taza.", "Repita con la mezcla restante para hacer su segundo lote de muffins en una taza.", "Estas magdalenas son deliciosas, servidas tibias, sacadas con cuchara de la taza, o usan un cuchillo para anotar alrededor del borde de la taza y tirar el muffin tibio sobre una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_cheese_and_herb_muffin_43619", "title": "Muffin de queso y hierbas en una taza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde muffins de 6 tazas, cada panecillo sirve para 2 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_herb_muffin_43619_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de crianza de 375 g / 13 oz, más extra para enrollar", "½ cucharadita de sal marina fina", "75g / 2½oz de mantequilla fría, cortada en cubos", "225ml / 8fl oz de leche entera", "Brie de 180 g / 6oz Somerset", "8-9 cucharadas de chutney de tomate fresco", "300 ml / 10 fl oz de aceite de girasol, para freír"], "method": ["Para hacer la masa, coloque la harina y la sal en un tazón grande para mezclar y frote la mantequilla con la yema de los dedos hasta que la mezcla se asemeje a migas de pan gruesas. Agregue lentamente la leche, revolviendo constantemente hasta que la mezcla se una y forme una masa suave y esponjosa. Amasar ligeramente y formar una pelota.", "Estirar la mitad de la masa sobre una superficie ligeramente enharinada hasta que tenga aproximadamente 3 mm de grosor. Tome un platillo, o un recipiente vuelto hacia arriba, de unos 14 cm / 5½ pulgadas de diámetro y córtelo alrededor para hacer tres círculos de masa. Puede volver a amasa y enrollar la masa si es necesario. Repita con la masa restante.", "Retire y deseche la corteza del queso. Cortar el queso en trozos de aproximadamente 1cm / ½ en trozos. Coloque una cucharada colmada de chutney en el medio de cada ronda de masa extendiéndola pero dejando un borde de 1 cm / ½ pulgada alrededor del borde.", "Coloque un sexto del queso en un lado de cada círculo. Cepille los bordes de la masa con un poco de agua. Doblar para cubrir el relleno, expulsar el aire y juntar los bordes. Presione los dientes de un tenedor alrededor del borde de la masa, presionando firmemente a través de ambas capas, para asegurar que el pastel esté sellado.", "Vierta el aceite en una sartén antiadherente grande, debe tener alrededor de 1 cm / ½ de profundidad. Coloque a fuego medio y deje actuar durante unos minutos, o hasta que el aceite esté lo suficientemente caliente como para dorar un cubo de pan blanco en 15 segundos. Necesita estar alrededor de 150C / 300F si prueba la temperatura con un termómetro de cocina. No permita que el aceite se sobrecaliente y no deje el aceite desatendido. (Use una freidora de grasa si lo prefiere).", "Usando una espátula a prueba de calor, coloque dos de los empaques en el aceite caliente y cocínelos por unos dos minutos por cada lado, o hasta que estén ligeramente dorados y ligeramente hinchados. El queso dentro será encantador y se derretirá cuando se corten las pérdidas de balón. Si el aceite está demasiado caliente, la masa se dorará demasiado antes de que el relleno esté listo. Retire las pérdidas de balón y drene en un papel de cocina forrado de placa. Cubra con papel de aluminio y mantenga caliente mientras cocina el resto.", "Las pérdidas de balón también pueden recalentarse en un horno caliente durante aproximadamente 10 minutos si no necesita servirlas todas al mismo tiempo."], "url": "www_bbc_co_uk_food_recipes_cheese_and_tomato_07140", "title": "Entregas de chutney de queso y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_tomato_07140_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 75g / 3oz", "gran pizca de pimentón dulce", "20g / 1oz de mantequilla, ablandada", "1 cebolla de primavera", "20g / 1oz de queso cheddar rallado", "2-3 cucharadas de jugo de tomate"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja para hornear con un poco de papel para hornear.", "Coloque la harina en el recipiente para mezclar y agregue el pimentón y la mantequilla. Frote la mantequilla en la harina.", "Corta la cebolla de primavera en trozos pequeños con las tijeras (pregúntale a un adulto que te ayude) - quítate primero las raíces y las hojas de color verde oscuro; esto se llama topping y tailing. Comience cortando en trozos, luego agregue al tazón y pique más en el tazón.", "Agregue el queso rallado y mezcle la mezcla con un tenedor. Agregue dos cucharadas de jugo de tomate y mezcle bien con una cuchara. Si la masa no se pega, agrega un poco más de jugo de tomate hasta que la mezcla se convierta en una masa homogénea.", "Ruede la masa sobre una superficie enharinada a un grosor de aproximadamente 1 cm / ½ pulgada. A continuación, corte los círculos con un cortador de galletas redondo de 5 cm / 2 pulgadas. Coloque los bizcochos en la bandeja de horno revestida.", "Pídale a un adulto que ponga el queso y el tomate en el horno durante 10-15 minutos o hasta que esté firme. Deje que se enfríe antes de comer. Servirlos con rebanadas de manzana."], "url": "www_bbc_co_uk_food_recipes_cheese_and_tomato_melts_99595", "title": "El queso y el tomate se derriten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6-8 derrite", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["180 g / 6¼ oz de hojaldre listo para el rollo", "harina común, para quitar el polvo", "4 hojas de espinaca picadas", "30g / 1¼oz de queso cheddar rallado, más extra para el relleno", "pellizcar nuez moscada molida", "2 cucharaditas de pistolas preparadas con cucharadita (o salsa de tomate y verdura lista para usar similar)"], "method": ["Precalentar el horno a 220C / 450F / Gas 7. Cubra una bandeja para hornear con papel para hornear.", "Extienda la masa de hojaldre en una superficie de trabajo ligeramente espolvoreada. Corta cuatro círculos de la masa con un cortador de galletas. Pincha cada círculo de repostería varias veces con un tenedor.", "En un tazón, mezcle bien la espinaca, el queso cheddar, la nuez moscada y el pisto de rape preparados hasta que estén bien combinados.", "Coloque dos de los círculos de hojaldre en la bandeja de horno revestida. Coloque la mitad de la mezcla de relleno en el centro de ambos círculos de repostería.", "Moja un poco de agua alrededor del borde de ambos círculos de repostería con un pincel de pastelería. Coloque uno de los círculos de repostería restantes sobre cada uno, presionando hacia abajo en los bordes para sellar.", "Espolvoree cada pastoso con un poco de agua, luego cubra con un poco más de queso cheddar rallado.", "Hornee las empanadas en el horno durante 12-15 minutos, o hasta que la masa se haya levantado y esté dorada. Dejar enfriar un poco antes de comer con una ensalada de tomate."], "url": "www_bbc_co_uk_food_recipes_cheese_and_vegetable_14635", "title": "Pastel de queso y vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 510g / 1lb 2oz, más extra para enharinar", "sal pizca generosa", "2¼ cucharadita de polvo de hornear", "1 cucharadita de mostaza inglesa en polvo", "65 g / 2½ oz de mantequilla sin sal, más extra para servir", "380g / 13oz de queso cheddar fuerte", "4½ cucharadas de cebollines cortados frescos", "300 ml / 10 fl oz de leche", "1 huevo de gallinas camperas, batido con un poco de leche para glasear", "4 manzanas rojas, para servir"], "method": ["Precalentar el horno a 220C / 425F / Gas 7. Enharinar ligeramente una bandeja para hornear.", "Tamiza la harina, la sal, el polvo de hornear y la mostaza en un bol.", "Frote la mantequilla hasta que la mezcla se asemeje a migas de pan finas. (Puede hacerlo rápidamente en un procesador de alimentos).", "Rallar la mitad del queso muy finamente, y cortar aproximadamente la otra mitad. Revuelva en la mezcla de harina con las cebolletas picadas.", "Poco a poco agregue leche para hacer una masa blanda pero no pegajosa (es posible que no necesite toda la leche).", "Convierta la masa en una superficie enharinada y amasar ligeramente, luego enrolle la masa en un espesor de menos de 2.5 cm / 1 in. Use un cortador de 6cm / 2½ pulgadas para cortar los bollos, volviendo a enrollar los recortes según sea necesario. Manipule la masa lo menos posible para mantenerla ligera.", "Coloque los bollos en la bandeja para hornear enharinada, dejando por lo menos 2.5 cm entre ellos y glaseados con la mezcla de huevo y leche.", "Hornea por 10 minutos o hasta que se levante y dore.", "Para servir, cortar finamente las manzanas rojizas y abanicar media docena de rebanadas en el plato con el bollo de queso y una pequeña porción de mantequilla."], "url": "www_bbc_co_uk_food_recipes_cheese_chive_and_mustard_48610", "title": "Scones de queso, cebollín y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 18 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de azúcar mascabado ligero", "1 cebolla, finamente picada", "100 g / 3½ oz de sultanas", "150ml / 5¼fl oz de vinagre de jerez", "2 tomates, toscamente picados", "300g / 10½oz de uvas rojas sin semillas, cortadas a la mitad", "sal marina y pimienta negra recién molida", "1 yema de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "2 cucharaditas de miel líquida", "2 cucharadas de vinagre de sidra", "150ml / 5¼fl oz de aceite vegetal", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente picado", "2 cucharadas de hojas frescas de perejil de flatleaf", "1 cucharada de hojas de menta fresca finamente picadas", "1 cucharada de hojas de albahaca fresca finamente picada", "1 cucharada de hojas de tomillo fresco finamente picado", "sal y pimienta negra recién molida", "100 g / 3½ oz de azúcar en polvo", "100g / 3½ oz de nueces de pacana", "2 cabezas de lechuga Little Gem, lavadas, hojas separadas", "aceite vegetal, para freír", "aceite vegetal, para freír (ver arriba)", "125g / 4½oz de harina natural", "4 huevos de gallinas camperas, ligeramente golpeados", "150 g / 5¼ oz de pan rallado fresco", "400g / 14oz de queso surtido, cortado en trozos de 3cm / 1in"], "method": ["Para la salsa picante, caliente el azúcar mascabado en una sartén grande a fuego medio o bajo, sin remover, hasta que se derrita y forme un caramelo dorado, agite la sartén para mover el azúcar en lugar de removerla (PRECAUCIÓN: azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado. Use una sartén profunda para evitar burbujear).", "Agregue la cebolla y las pasas al caramelo, luego vierta el vinagre de jerez y revuelva con una cuchara de madera.", "Agregue los tomates y las uvas y cocínelos durante 12-15 minutos, o hasta que las uvas estén tiernas y la mezcla se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Transfiera la salsa picante a un recipiente hermético y esterilizado y déjela a un lado. (Cuanto más tiempo deje la salsa picante, más se desarrollarán los sabores).", "Mientras tanto, para el aderezo de la casa, mezcle la yema de huevo, la mostaza, la miel y el vinagre de sidra en un bol hasta que estén bien combinados. Poco a poco agregue el aceite vegetal en una corriente delgada, batiendo continuamente, hasta que la mezcla espese a una mayonesa cremosa.", "Agregue la chalota, el ajo y las hierbas, luego condimente, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Para la ensalada de nuez, forre un plato con papel resistente a la grasa.", "Vierta 100 ml / 3½ fl oz de agua en una olla y agregue el azúcar. Llevar la mezcla a ebullición, luego reduzca la temperatura hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 4-5 minutos, o hasta que el azúcar se haya disuelto y la mezcla se haya espesado hasta obtener un jarabe. (Precaución: el jarabe caliente puede ser peligroso. No lo deje desatendido).", "Agregue las pacanas al almíbar y continúe cocinando durante 2-3 minutos, luego coloque las pacanas y el jarabe en el plato forrado y déjelos a un lado para enfriarlos y endurecerlos.", "Caliente el aceite en una freidora a 180 ° C. Alternativamente, caliente el aceite en una cacerola de base pesada a fuego alto hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje las pacanas azucaradas en el aceite caliente, en lotes, y cocine durante 1-2 minutos, o hasta que estén doradas. Retire del aceite con una espumadera y déjelo a un lado para drenar y enfriar en papel de cocina.", "Cuando las nueces de pecan se hayan enfriado, coloque las hojas de lechuga en un tazón grande, rocíe sobre dos cucharadas de aderezo de la casa, luego espolvoree sobre las pacanas. Mezcle las hojas para cubrirlas en el aderezo. Dejar de lado.", "Para las pepitas de queso, espolvorear la harina en un plato y las migas de pan en otro plato. Espolvorea cada trozo de queso primero en la harina, luego sumérgelo en el huevo batido, luego rueda en las migas de pan hasta que esté completamente cubierto.", "Usando el mismo aceite que antes, baje cuidadosamente las porciones de queso recubiertas en el aceite caliente en lotes. Freír durante 30-60 segundos, o hasta que las migas estén doradas y el queso se haya derretido. Retire cada lote del aceite caliente con una espumadera y déjelo a un lado para escurrirlo sobre papel de cocina. Mantenga caliente mientras cocina los lotes restantes.", "Para servir, coloque las pepitas de queso en un plato grande con un tazón de chutney al lado. Sirve con la ensalada."], "url": "www_bbc_co_uk_food_recipes_cheese_nuggets_with_15188", "title": "Nuggets de queso con ensalada de pacanas y chutney de uva", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_nuggets_with_15188_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "1 cucharada de levadura en polvo", "150g / 5½oz de queso de cabra suave, cortado en trozos pequeños", "80g / 2¾oz de pistachos, aproximadamente picados", "Ciruelas pasas 100 g / 3½ oz, picadas", "4 huevos de gallinas camperas", "150ml / 5fl oz de aceite de oliva", "100ml / 3½ fl oz de leche", "50g / 1¾oz de yogurt natural", "1 cucharadita de sal", "pizca de pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una lata de pan de 22x11 cm / 8½x4¼in en la parte superior y 6 cm / 2½ pulgadas de profundidad con papel de hornear.", "En un tazón, mezcle la harina, el polvo de hornear, el queso de cabra, los pistachos y las ciruelas pasas.", "En un recipiente aparte, bata los huevos hasta que estén esponjosos y de color pálido. Luego, mezcle gradualmente el aceite, la leche y el yogur. Sazone con sal y pimienta negra recién molida.", "Dobla la mezcla de harina en los huevos batidos. Trata de no exagerar ya que esto hará que el resultado final sea difícil (es mejor mezclarlo por debajo).", "Vierta la mezcla en la lata preparada.", "Hornee durante 30-40 minutos o hasta que un pincho de metal insertado en el centro del pastel salga limpio.", "Dejar enfriar en la lata."], "url": "www_bbc_co_uk_food_recipes_cheese_pistachio_and_85849", "title": "Pastel de queso, pistacho y ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_pistachio_and_85849_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "75g / 2½oz de mantequilla fría sin sal, cortada en aproximadamente 1cm / ½ en dados", "Grasa vegetal blanca de 75 g / 2½ onzas, cortada en trozos pequeños", "25 g / 1 oz de parmesano (o alternativa vegetariana), finamente rallado", "25g / 1oz de queso cheddar maduro, finamente rallado", "1 huevo de gallinas camperas, golpeado, para terminar", "1kg / 2lb 4oz Papas Desiree, peladas y cortadas en trozos grandes", "1 cebolla, finamente picada", "375g / 13oz de queso cheddar maduro, rallado", "50ml / 2fl de leche en oz", "2 cucharadas de cebollines picados", "sal y pimienta blanca"], "method": ["Para hacer la masa, poner la harina en un tazón. Agregue la mantequilla y la grasa vegetal y frótelas ligeramente con las puntas de los dedos hasta que la mezcla parezca pan rallado grueso (esta masa es más rica y pegajosa que una pasta estándar). Alternativamente, frote la grasa usando un procesador de alimentos o un mezclador, y luego transfiera a un tazón.", "Agregue los quesos a la harina y la grasa y mezcle bien. Ahora, usando un cuchillo de mesa, trabaje con suficiente agua fría para unir la masa en una masa. Probablemente necesites 2-3 cucharadas soperas. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la película adherida y colóquela en el refrigerador para enfriarla mientras realiza el llenado.", "Precalentar el horno a 200C / 400F / Gas 6 y tener listo un plato de metal para hornear, aproximadamente 24x20cm / 10x8 pulgadas grandes y 5 cm / 2 pulgadas de profundidad.", "Para el relleno, coloque las papas en una cacerola, cúbralas con agua, agregue un poco de sal y deje hervir. Reduzca a fuego lento y cocine hasta que las papas estén lo suficientemente tiernas como para macerar, alrededor de 12-15 minutos.", "Escurra bien las papas y póngalas a través de un ricer en un tazón grande (esto le dará un macerado suave y sin grumos, pero puede usar un machacador de papas estándar si lo prefiere). Agregue la cebolla, el queso, un poco de sal y una buena pizca de pimienta blanca. Batir con una cuchara de madera para que el queso esté bien incorporado. Agregue la leche y el cebollín y revuelva bien la mezcla.", "Ponga el puré en la lata y use la parte posterior de una cuchara para extenderla hasta que esté suave y pareja.", "En una superficie ligeramente enharinada, extienda la masa para que quede en la parte superior del puré. Debe ser de 8-10 mm / 1/3 pulgadas de espesor. Colócalo encima del puré, corta los bordes prolijamente y marca la masa en seis porciones anotándola con un cuchillo.", "Cepille la masa con el huevo batido y hornee por 20-25 minutos, o hasta que estén doradas. Deje reposar el pastel por 15 minutos antes de cortarlo y servirlo."], "url": "www_bbc_co_uk_food_recipes_cheese_potato_and_onion_96190", "title": "Pastel de queso, papa y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_potato_and_onion_96190_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de hojaldre con mantequilla", "4 yemas de huevo, batidas con un chorrito de agua", "150 g / 5½ oz de queso cheddar rallado", "pimentón, para rociar"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque dos bandejas para hornear con papel para hornear o papel resistente a la grasa.", "Estirar la masa a un cuadrado de 30cm / 12in.", "Usando un pincel de pastelería, cepille la mezcla de huevos por todo el pastel. Espolvorea sobre el queso y presiona ligeramente. Cubra con una película adhesiva y enfríe la masa en la nevera durante 15 minutos.", "Espolvoree el queso con pimentón, córtelo por la mitad, luego corte cada mitad en tiras de 1cm / ½ en tiras.", "Gire cada tira en forma de pajita de queso y colóquela en la bandeja para hornear forrada.", "Hornee durante 15 minutos, o hasta que estén dorados y crujientes."], "url": "www_bbc_co_uk_food_recipes_cheese_straws_40324", "title": "Palitos de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_straws_40324_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "4 cucharaditas de polvo de hornear", "85g / 3oz de mantequilla fría, en cubos", "350ml / 12fl oz de leche, más extra para acristalamiento", "250 g / 9 oz de quesos variados, desmenuzados en trozos pequeños, más queso rallado extra para espolvorear en la parte superior"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina y el polvo de hornear en un tazón grande.", "Frote la mantequilla en la harina con las puntas de los dedos, hasta que la mezcla se asemeje a migas de pan gruesas y frescas.", "Vierta la leche y mezcle con una cuchara de madera para crear una masa suave.", "Agregue el queso desmenuzado y asegúrese de que esté distribuido uniformemente amasando suavemente la masa con las manos.", "Forme la masa en una ronda áspera y colóquela en una bandeja para hornear espolvoreada con harina.", "Presione hacia abajo sobre la parte superior de la bola para aplanarla ligeramente, luego cepíllela con un poco de leche para glasear.", "Ralla un poco de queso extra por encima, luego marca una cruz profunda en la masa con un cuchillo afilado para permitir que se rompa en pedazos individuales cuando se cocina.", "Hornee en el horno precalentado durante unos 30 minutos, o hasta que el relleno de queso se vea dorado y crujiente.", "Sirva caliente con su chutney o pepinillo favorito."], "url": "www_bbc_co_uk_food_recipes_cheese_scone_62849", "title": "Bollo de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_scone_62849_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 375g / 13oz", "pizca de sal", "225g / 8oz de mantequilla, cortada en cubitos", "150g / 5½oz de queso cheddar maduro", "50 g / 1¾oz de queso parmesano recién rallado (o un queso duro vegetariano similar)", "pizca de mostaza inglesa en polvo", "pizca de cayena pequeña pizca", "2 huevos de gallinas camperas, solo yemas"], "method": ["Tamiza la harina y una pizca de sal en un tazón. Con las yemas de los dedos, frote la mantequilla hasta que todos los grumos hayan desaparecido y la textura quede como pan rallado fino. Agregue el queso, la mostaza en polvo, la pimienta de cayena y las yemas de huevo. Agregue 4-5 cucharadas de agua fría y mezcle con una masa firme. Envuelva la película adherida y deje enfriar en la nevera durante 30 minutos.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Cubra una bandeja para hornear con papel para hornear. Estirar la masa a un cuadrado, más o menos del grosor de una moneda de £ 2. Corta el cuadrado por la mitad, luego corta cada mitad en tiras de 1cm / ½. Transfiera cuidadosamente a la bandeja para hornear forrada y hornee durante 10-15 minutos, hasta que estén crujientes, luego déjelos enfriar en la bandeja."], "url": "www_bbc_co_uk_food_recipes_cheese_straws_79467", "title": "Palitos de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace aproximadamente 36 pajitas de queso", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_straws_79467_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["375g / 13oz de hojaldre listo para enrollar", "Manchego 100 g / 3½ oz, rallado", "12 rodajas de chorizo", "1 cucharadita de hojuelas de chile rojo seco", "1 huevo de gallinas camperas, ligeramente golpeado"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Desenrolle la masa en una bandeja para hornear con el borde más largo de la masa hacia usted.", "Distribuye el manchego sobre la mitad derecha de la masa. Cubra el queso con 10-12 rebanadas de chorizo ​​y espolvoree con hojuelas de chile. Doble sobre la masa restante y aplaste con sus manos.", "Gire la pastelería 45 grados para que quede en el medio del papel de hornear. Enrolle ligeramente con un rodillo para sellar.", "Corta la masa en trozos de 1cm / ½ en pulgadas y gira 4-5 veces. Cepille los giros con el huevo batido y hornee en el horno durante 15-20 minutos, o hasta que estén dorados.", "Retirar del horno y reservar para enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_cheese_twists_30316", "title": "Giros de queso y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15 giros", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_twists_30316_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75ml / 2½ fl oz crema doble", "3 espárragos picados finamente picados", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida", "Queso doble Gloucester 100 g / 3½ oz, rallado", "3 huevos de gallinas camperas, separados", "mantequilla, para engrasar", "harina, para quitar el polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la crema doble en una olla pequeña y deje que hierva. Agregue las espárragos y las cebolletas, sazone con sal y pimienta negra recién molida y cocine durante 1-2 minutos. Agregue el queso rallado y revuelva hasta que se derrita. Retirar del fuego y dejar enfriar un poco.", "Agregue dos de las yemas de huevo a la mezcla y bata bien (la tercera yema de huevo se puede usar en otro plato).", "Coloque las claras de huevo en un tazón grande y limpio y bata hasta que se formen picos rígidos cuando se quite el batidor. Doble suavemente las claras de huevo en la mezcla de queso.", "Engrase una bandeja pequeña a prueba de horno con mantequilla, polvo con harina normal y sacuda el exceso. Coloque la mezcla de soufflé en la sartén, luego transfiérala al horno y hornee durante 6-8 minutos, o hasta que se levante y se dore.", "Servir inmediatamente en la sartén o en un plato."], "url": "www_bbc_co_uk_food_recipes_cheeseandasparagusso_86251", "title": "Soufflé de queso y espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cabeza de brócoli, cortada en florecillas, blanqueada", "3 huevos de gallinas camperas, separados", "2 cucharadas de queso cheddar, rallado, más extra para rociar", "sal y pimienta negra recién molida", "mantequilla ablandada, para engrasar", "harina, para quitar el polvo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja de horno dentro para calentar.", "Coloque el brócoli en una licuadora pequeña y mezcle hasta que esté finamente picado. Agregue las yemas de huevo y mezcle hasta que se combinen. Vierta en un tazón.", "En un recipiente aparte, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor, luego dobla cuidadosamente las claras de huevo en el brócoli mezclado.", "Incorpore el queso y sazone bien con sal y pimienta negra recién molida.", "Unte con mantequilla dos moldes y polvo con harina. Vierta la mezcla de soufflé en los moldes. Espolvoree con un poco de queso rallado extra.", "Coloque los moldes en la bandeja de horno calentada y colóquelos en el horno durante ocho minutos, o hasta que estén dorados.", "Servir de inmediato, en los moldes."], "url": "www_bbc_co_uk_food_recipes_cheeseandbroccolisou_87165", "title": "Soufflé de queso y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "Calabacín de 100 g / 3½ oz, rallado", "sal y pimienta negra recién molida", "100g / 3½ oz de queso cheddar maduro, rallado", "175ml / 6fl de leche en oz", "1 huevo de gallinas camperas", "55ml / 2fl oz de aceite de oliva", "10 tomates cherry", "tocino crujiente a la parrilla", "huevos revueltos"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, combine la harina, el calabacín, la sal, la pimienta negra recién molida y el queso cheddar y mezcle bien.", "En otro recipiente, mezcle la leche, el huevo y el aceite de oliva. Agregue esta mezcla a los ingredientes secos y mezcle bien.", "Engrase diez moldes para muffins y llene a la mitad cada uno con la mezcla.", "Pincha cada tomate cherry - esto los detiene cuando se cocinen - y coloca un tomate en la parte superior de cada cucharada de mezcla.", "Vierta la mezcla restante sobre cada panecillo para ocultar el tomate. Cocine durante unos 20 minutos hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_cheeseandcherrytomat_84142", "title": "Magdalenas de queso y tomate cherry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseandcherrytomat_84142_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble de 150 ml / 1/4 de pinta", "Queso cheddar 100 g / 3½ oz, rallado", "2 huevos de gallinas camperas, separados", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida", "mantequilla, para engrasar"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja para hornear en el horno.", "Vierta la crema en una cacerola pequeña a fuego lento. Agregue el queso y las yemas de huevo y mezcle hasta que espese un poco. Retire del fuego y deje enfriar durante cinco minutos.", "En un tazón limpio y separado, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Dobla las claras de huevo en la mezcla de crema. Agregue el cebollín y sazone bien con sal y pimienta negra recién molida.", "Engrase dos moldes pequeños y vierta la mezcla de soufflé hasta que los moldes estén tres cuartos llenos.", "Coloque los moldes en la bandeja de horneado precalentada, transfiéralos al horno y hornee durante 8-10 minutos, o hasta que estén bien elevados y dorados en la parte superior. Sirve inmediatamente en los moldes."], "url": "www_bbc_co_uk_food_recipes_cheeseandchivesouffl_84979", "title": "Soufflé de queso y cebolleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan crujiente blanco", "100 g / 3½ oz Brie, en rodajas", "2 rebanadas de jamón", "2 huevos de gallinas camperas, golpeados", "1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "hoja de roble y lechuga de cordero", "rociar aceite de oliva"], "method": ["Toma una rebanada de pan, coloca las rebanadas de Brie encima y luego cúbrelo con el jamón. Coloque la segunda rebanada de pan en la parte superior, luego sumerja el sándwich en el huevo batido y cubra bien.", "Caliente el aceite y la mantequilla en una sartén y fría el sándwich hasta que se doren por ambos lados.", "Para servir, corte a la mitad y coloque en un plato para servir. Adorne con hojas de lechuga y rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_cheeseandhamcroquemo_88066", "title": "Queso y jamón croque monsieur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1½ oz de harina común", "2 huevos de gallinas camperas", "50ml / 2fl oz de leche entera", "1 cucharada de aceite de oliva", "50 g / 1½ oz de lentejas cocidas", "Queso cheddar 50g / 1½oz, rallado", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Para el panqueque, coloque la harina, los huevos y la leche en un bol y mezcle bien para hacer una mezcla suave.", "Caliente el aceite en una sartén y vierta la mezcla, agitando la sartén para cubrir la base. Freír el panqueque por dos minutos.", "Coloque las lentejas y el queso en el centro del panqueque y dóblelos por la mitad para encerrar la mezcla. Freír durante 2-3 minutos más.", "Para el aceite de hierbas, coloque el aceite y el perejil en un tazón, mezcle bien y sazone con sal y pimienta negra recién molida.", "Para servir, coloque el panqueque en un plato y rocíe sobre el aceite de hierbas."], "url": "www_bbc_co_uk_food_recipes_cheeseandlentilcanne_85050", "title": "Crepe de queso y lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pechuga de pollo, sin piel", "sal y pimienta negra recién molida", "1 ramita fresca de romero", "2 dientes de ajo, pelados, dejados enteros, ligeramente aplastados con el lado de un cuchillo", "2 cucharadas de queso crema con ajo y hierbas", "100 g / 3½ oz de chorizo, en rodajas", "½ cebolla, pelada, finamente rebanada", "2 dientes de ajo, pelados, finamente picados", "1 ramita de romero fresco", "85g / 3oz de garbanzos enlatados, escurridos y enjuagados", "sal y pimienta negra recién molida", "2 cucharadas de vinagre balsámico", "4 cucharadas de aceite de oliva virgen extra"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén a prueba de horno y dore la pechuga de pollo durante 2-3 minutos en cada lado. Agregue el romero y el ajo a la sartén.", "Transfiera la sartén al horno y cocine el pollo durante 10-12 minutos.", "Extienda el queso crema de ajo y hierbas sobre la parte superior del pollo. Mantener caliente", "Mientras tanto, para los garbanzos y el chorizo, tueste el chorizo ​​en el horno en una bandeja para asar durante 3-4 minutos, o hasta que estén crujientes. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mezcle la cebolla, el ajo, el romero y los garbanzos en el chorizo ​​y tápelos durante 5-7 minutos más. Agregue el vinagre balsámico y el aceite de oliva virgen extra.", "Para servir, cuchara los garbanzos y el chorizo ​​en un plato. Corte la pechuga de pollo en tres pedazos y colóquela encima."], "url": "www_bbc_co_uk_food_recipes_cheeseandherbcrusted_92403", "title": "Pechuga de pollo con costra de queso y hierbas con garbanzos calientes y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]