[{"isVegetarian": true, "title": "Tarta de queso crumble de manzana", "url": "www_bbc_co_uk_food_recipes_apple_crumble_cheesecake_79571", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_crumble_cheesecake_79571_16x9.jpg", "ingredients": ["Harina normal de 100 g / 3½ oz", "100g / 3½oz de azúcar morena suave", "½ cucharadita de canela molida", "50g / 2oz de mantequilla sin sal", "1 cucharadita de leche", "100 g / 3½ oz de mantequilla", "250 g / 9 oz de galletas de avena, aplastadas", "1 manzana Bramley grande, pelada, sin núcleo, rebanada, mezclada con 1 cucharada de jugo de limón", "500 g / 1 lb 2 oz de queso mascarpone", "400 g / 14 oz de queso crema", "125 g / 4½ oz de azúcar en polvo", "1 vaina de vainilla, dividida longitudinalmente, solo semillas", "1 x 150ml / 5fl oz de crema agria para tina", "4 huevos de gallinas camperas", "Sultanas 100 g / 3½ oz (opcional)", "½ cucharadita de canela molida", "¼ cucharadita de nuez moscada rallada"], "serves": "Sirve 8-12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la cobertura de crumble, incline la harina, el azúcar y la canela en un tazón. Frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue la leche y reserve.", "Para la base de galletas, mezcle la mantequilla derretida y las galletas trituradas juntas en un recipiente, luego presione la mezcla en la base de 23cm / 9 en la lata con forma de resorte. Dejar enfriar en la nevera durante 30 minutos.", "Para el relleno, cocine las rebanadas de manzana en una sartén de agua hirviendo durante 1-2 minutos, o hasta que estén tiernas pero manteniendo su forma. Drenado y genial.", "Batir el mascarpone y el queso crema en un tazón grande hasta que quede suave. Batir el azúcar, las semillas de vainilla y la crema agria y batir hasta que quede suave. Batir los huevos, uno a la vez, hasta que estén bien combinados.", "Coloque la mitad del relleno en la base de galletas refrigerada. Cubra con las rodajas de manzana y pasas sultanas (si usa) y espolvoree sobre las especias, luego cubra con la cuchara la mezcla restante.", "Hornee durante 30 minutos, luego abra la puerta del horno, saque la tarta de queso un poco y espolvoree la migaja sobre la parte superior. Cierre la puerta y hornee por otros 40-45 minutos, o hasta que la tarta de queso esté casi lista con un ligero bamboleo en el medio.", "Apague el horno y deje la torta de queso en el horno durante dos horas, luego retírela del horno y déjela enfriar por completo."]}, {"isVegetarian": true, "title": "Crumble de manzana con crema de cardamomo", "url": "www_bbc_co_uk_food_recipes_apple_crumble_with_63159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_crumble_with_63159_16x9.jpg", "ingredients": ["150 g / 5½ onzas de mantequilla, suavizadas", "60g / 2¼ oz de azúcar en polvo", "1 cucharada de harina normal", "70g / 2½oz de almendras en copos", "½ cucharadita de canela molida", "Pan rallado panko de 60 g / 2¼ oz", "5 manzanas Royal Gala grandes, toscamente ralladas", "5 vainas de cardamomo, solo semillas", "300 ml / 10 fl oz crema batida", "1 cucharadita de extracto de vainilla", "2 yemas de huevo de gallinas camperas", "1½ cucharada de azúcar en polvo", "½ cucharadita de harina de maíz"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Batir la mantequilla y el azúcar juntos en un tazón grande.", "Mezcle la harina, las almendras, la canela y las migas de pan en otro recipiente. Incline esto en la mezcla de mantequilla y azúcar y frótelo con los dedos para formar una masa espesa y desmenuzable.", "Coloque las manzanas ralladas en un plato cuadrado a prueba de horno de 20 cm / 8 pulgadas. Extiende la mezcla de crumble encima y hornea por 30 minutos, o hasta que se dore.", "Mientras tanto, para hacer la crema de cardamomo, moler las semillas de cardamomo en polvo con un mortero. Coloque una cacerola de fondo grueso a fuego medio y agregue la crema, el cardamomo y la vainilla. Llevar a ebullición, reducir el fuego y cocinar a fuego lento durante 3 minutos. Déjelo a un lado para que se enfríe un poco, luego cuele en un bol usando un colador fino.", "Batir las yemas de huevo, el azúcar y la harina de maíz en un tazón grande. Vierta la mezcla de crema caliente, batiendo constantemente. Vierta esta mezcla nuevamente en la cacerola y cocine a fuego lento durante 6-8 minutos, o hasta que la crema se espese.", "Sirva el crumble de manzana caliente con la crema de cardamomo."]}, {"isVegetarian": true, "title": "Crumble de manzana con nueces y semillas de girasol", "url": "www_bbc_co_uk_food_recipes_apple_crumble_with_81274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_crumble_with_81274_16x9.jpg", "ingredients": ["1,5 kg / 3 lb 5 oz manzanas de cocina", "½ limón, solo jugo", "100g / 3½oz de azúcar mascabado ligero", "50g / 1¾oz de harina natural", "Avena de avena 50g / 1¾oz", "150g / 5½oz de azúcar mascabado ligero", "Nueces 150g / 5½oz, más o menos picadas", "50g / 1¾oz semillas de girasol", "100g / 3½ oz de mantequilla ablandada"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador de 160 ° C).", "Pele y base las manzanas, luego córtelas en rodajas finas. Coloque en una cazuela pequeña a prueba de llamas con el jugo de limón, azúcar y seis cucharadas de agua. Llevar a ebullición, luego poner en el horno y cocinar durante unos 20 minutos, o hasta que la manzana esté tierna, pero no se haya reducido a una pulpa.", "Coloque los ingredientes de cobertura secos en un tazón y frote la mantequilla hasta que esté distribuida uniformemente y la mezcla haya formado pequeños grumos. Extienda la mezcla de manera uniforme sobre una bandeja para hornear y hornee por unos 20 minutos, o hasta que esté dorada y crujiente.", "Revuelva para romper la migaja y espolvoree sobre la manzana caliente."]}, {"isVegetarian": true, "title": "Crumble de manzana con anís estrellado", "url": "www_bbc_co_uk_food_recipes_apple_crumble_with_star_50461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 300g / 10½ oz", "200g / 7oz de azúcar moreno", "Mantequilla sin sal 200 g / 7oz, en cubos y ablandada a temperatura ambiente, más extra para engrasar", "pizca de sal", "75g / 3oz de mantequilla sin sal, más extra para untar", "1 kg / 2lb 4oz comiendo manzanas (como russet o cox), peladas, sin corazón y cortadas en trozos grandes", "150 g / 5 oz de azúcar en polvo", "Anís de 5 estrellas", "1 ramita de canela", "nata", "semillas de granada"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalienta el horno a 200 ° C / 400 ° F / Gas 6. Para hacer que la migaja se desmigaje, coloca la harina y el azúcar moreno en un tazón grande y mezcla bien. Tomando unos cuantos cubitos de mantequilla a la vez, frótalos en la mezcla de harina hasta que se asemeje a pan rallado.", "Espolvorea la mezcla sobre una bandeja de horno en una capa delgada, usando dos hojas si es necesario. Hornee en el horno precalentado durante 5-6 minutos, o hasta que esté ligeramente dorado. Retire del horno y rompa con un tenedor, luego vuelva al horno y repita el proceso un par de veces, hasta que tenga una cubierta de galleta crujiente encantadora. Dejar de lado; si continúa cocinando el crumble de manzana inmediatamente, deje el horno encendido.", "Para hacer el relleno, caliente una sartén ancha, poco profunda y de fondo grueso y derrita la mantequilla hasta que se forme espuma. Agregue el anís estrellado y cocine a fuego lento hasta que la mantequilla se condimente con el anís estrellado. Agregue las manzanas, el azúcar y la canela (si está usando) y cocine, revolviendo con frecuencia, hasta que el azúcar se haya disuelto y la manzana esté suave en los bordes. Retire la canela (si está usando) y el anís estrellado, y agregue un poco más de azúcar si lo desea.", "Para ensamblar, un plato mediano a prueba de horno. Con una cuchara, vierta la mezcla de fruta en el fondo, luego espolvoree la mezcla de crumble encima. Asegúrese de que el horno esté precalentado a 200 ° C / 400 ° F / Gas 6 y hornee por 20 minutos hasta que el crumble esté dorado y la mezcla de fruta burbujee. Dejar enfriar un poco.", "Para servir, ponga un poco de crème fraîche en un tazón pequeño y cubra con algunas semillas de granada. Servir junto con el crumble."]}, {"isVegetarian": true, "title": "Apple dappy", "url": "www_bbc_co_uk_food_recipes_apple_dappy_68570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina 100g / 3½ oz de levante automático, más extra para quitar el polvo", "30g / 1oz de mantequilla", "1 cucharada de azúcar en polvo", "4 cucharadas de crema individual", "1 manzana que come, pelada, sin núcleo, carne rallada", "pellizcar canela molida", "2 cucharaditas colmadas de azúcar demerara"], "serves": "Hace 7 rebanadas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 450F / Gas 7. Cubra una bandeja para hornear con papel para hornear.", "Frote la harina y la mantequilla juntas en un tazón con la punta de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar impalpable hasta que esté bien combinado.", "Mezcle la cucharada de crema con una cucharada hasta que el contenido del recipiente se una como una masa blanda. Puede que no necesites toda la crema.", "En un recipiente aparte, mezcle la manzana rallada, la canela y una cucharadita de azúcar demerara hasta que estén bien combinados.", "Rocíe ligeramente una superficie de trabajo con un poco de harina. Ruede la masa en una forma rectangular del grosor de 0.5cm / ¼in.", "Retire la mezcla de manzana del tazón con una cuchara ranurada, de modo que quede la cantidad máxima de jugo posible en el tazón. Extiende la mezcla de manzana por todo el pastel.", "Con el lado largo del rectángulo de pastelería hacia usted, enrolle la masa como si fuera un rollo suizo. Con un cuchillo afilado, corte el rollo de pastelería en siete rebanadas gruesas.", "Coloque cada repostería en forma de remolino sobre la bandeja para hornear forrada, dispuestas en círculo con una en el centro. Espolvorea sobre el azúcar restante demerara. Hornee en el horno durante 20-25 minutos, o hasta que estén crujientes en la parte superior y doradas. Servir inmediatamente."]}, {"isVegetarian": true, "title": "Tarta de frangipane de manzana", "url": "www_bbc_co_uk_food_recipes_apple_frangipane_tart_14091", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_frangipane_tart_14091_16x9.jpg", "ingredients": ["Galletas digestivas de 175g / 6oz", "75g / 3oz de mantequilla", "Manzanas Bramley 200g / 7oz", "75g / 3oz de mantequilla, ablandada", "75g / 3oz de azúcar en polvo", "2 huevos de gallinas camperas, golpeados", "75g / 3oz de almendra molida", "1 cucharadita de extracto de almendra", "50g / 1¾oz de almendras en copos"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Ponga los bizcochos en una bolsa de congelador con cierre hermético y golpéelos con un rodillo en migas finas. Derrita la mantequilla en una sartén pequeña, luego agregue las migas de galletas y revuelva hasta que esté cubierto con mantequilla. Incline en la lata de tarta y, con la parte posterior de una cuchara, presione sobre la base y los lados de la lata para obtener una capa uniforme. Enfríe en la nevera mientras realiza el llenado.", "Crema la mantequilla y el azúcar hasta que esté suave y esponjoso. (Puede hacer esto en un procesador de alimentos si tiene uno. Procese durante 2-3 minutos.) Mezcle los huevos, luego agregue las almendras molidas y el extracto de almendras y mezcle hasta que estén bien combinados.", "Pelar las manzanas y cortar finas rebanadas de manzana. (Haga esto en el último minuto para evitar que la manzana se ponga marrón). Coloque las rebanadas sobre la base de la galleta. Extender el relleno de frangipane uniformemente en la parte superior. Nivele la superficie y espolvoree con las almendras en copos.", "Hornee durante 20-25 minutos hasta que estén dorados y listos.", "Retirar del horno y dejar enfriar durante 15 minutos. Retire los lados de la lata. (Una forma fácil de hacerlo es colocar la lata sobre una lata de frijoles y presionar suavemente sobre los bordes de la lata.) Transfiera la tarta, con la base de estaño, a un plato de servir. Sirva caliente con crema, crema fresca o helado."]}, {"isVegetarian": true, "title": "Pastel al revés de manzana, avellana y Calvados", "url": "www_bbc_co_uk_food_recipes_apple_hazelnut_and_37011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de sultanas", "50g / 1¾oz de manzana seca picada", "90 ml / 6 cucharadas Calvados", "100 g / 3½ oz de avellanas blanqueadas", "Harina de 175g / 6oz de auto crianza", "175g / 6oz de margarina", "175g / 6oz de azúcar mascabado", "3 huevos medianos de granja", "½ cucharada de pasta de vainilla (o 1 cucharadita de extracto de vainilla)", "1 cucharadita de polvo de hornear", "1 cucharadita de canela", "100 g / 3½ oz de azúcar en polvo", "30g / 1oz de mantequilla sin sal", "5 manzanas Granny Smith, peladas, sin corazón y cortadas en rodajas de 1cm / ½ en cuñas", "100 g / 3½ oz de avellanas blanqueadas", "200 g / 7 oz de azúcar en polvo"], "serves": "Hace 12 rebanadas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Mezcle las pasas y las manzanas secas con cinco cucharadas de Calvados y déjelas en remojo durante la noche.", "Para el pastel, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase un molde de resorte de 23 cm / 9 pulg. Tueste las nueces en una sartén seca y caliente hasta que estén doradas. Transfiera a un procesador de alimentos, pulse hasta que se corte y reserve.", "Para el aderezo de la fruta, derrita el azúcar en una cacerola de base pesada para formar un caramelo dorado. Retire del fuego y agregue la mantequilla, revolviendo suavemente hasta incorporarlo en el caramelo (tenga cuidado de no salpicarlo ya que el caramelo está muy caliente). Coloque la lata pre-preparada en una bandeja para hornear y vierta el caramelo. Coloque con cuidado las rebanadas de manzana en la parte superior hasta que la base de la lata esté completamente cubierta.", "Para el pastel, bata la harina, la margarina, el azúcar, los huevos, la vainilla, el polvo de hornear y la canela hasta que se combinen y aireen. Doble las avellanas picadas y la fruta empapada antes de verter sobre las manzanas y alisar suavemente la superficie.", "Hornee en el horno durante 40-50 minutos o hasta que estén dorados claros y elásticos al tacto. Dejar de lado para enfriar en la lata.", "Para el praliné, llena un tazón grande con agua fría. En una sartén de base pesada, derrita el azúcar con un caramelo dorado, agitando la sartén de vez en cuando para que no se queme y usando un pincel de pastelería húmedo para eliminar los cristales de azúcar del borde de la sartén. Retire del fuego y sumerja la base de la sartén en agua fría para evitar que se cocine el caramelo.", "Coloque una tabla de cortar pesada en el borde de la superficie de trabajo y distribuya el periódico en el piso debajo. Lanza la mitad de las avellanas sobre los palitos de cóctel. Cuidadosamente sumerja cada nuez en el caramelo antes de asegurar el extremo libre del cóctel debajo de la tabla de cortar, de modo que la tuerca sobresalga de la superficie de trabajo permitiendo que se forme una punta de caramelo y se endurezca (el papel atrapará cualquier gota).", "Suavemente recalentar el caramelo restante hasta que se vuelva a mojar de nuevo. Agregue las avellanas restantes, agite para recubrir y vierta en una bandeja para hornear forrada. Reserve en un lugar fresco y seco. Cuando esté completamente listo, mezcle un procesador de alimentos para hacer un praliné.", "Cuando el pastel esté frío, pique con un palito de cóctel y una cuchara sobre el Calvados. Deja en la lata durante 5-10 minutos para permitir que Calvados infunda el pastel.", "Pase un cuchillo afilado alrededor del borde de la torta y coloque un plato para servir sobre la parte superior. Voltee rápidamente la cubierta de la torta, retire la lata y vuelva a colocar las manzanas que puedan haber salido.", "Para servir, espolvorear con praliné y decorar con las avellanas puntiagudas."]}, {"isVegetarian": true, "title": "Tarta de fideos de manzana con almendras tostadas y jengibre crème fraîche", "url": "www_bbc_co_uk_food_recipes_apple_noodle_tart_with_75363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200 g / 7 oz de almendras molidas", "¼ cucharadita de sal", "¼ cucharadita de bicarbonato de soda", "¾ tbsp jarabe de arce", "15 g / ½ onza de mantequilla, ablandada", "1 huevo de gallinas camperas", "2 comiendo manzanas, peladas", "1 cucharadita de extracto de vainilla", "35 g / 1¼ oz pasas", "1 cucharadita de canela molida", "2 cucharaditas de jarabe de arce", "10 g / ½ oz de mantequilla fría, cortada en cubitos", "Copos de almendra 50g / 1¾oz", "400g / 14oz de crema entera en grasa", "Jengibre fresco de 2cm / 5in de la pieza, pelado y rallado fino"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la masa de almendras, precaliente el horno a 170C / 150C Fan / Gas 3½.", "En un tazón grande, mezcle todos los ingredientes de la repostería hasta que se juntan como una masa suave. Envuelva con film transparente y deje enfriar en la nevera durante al menos 30 minutos.", "Para el relleno, utilizando un espiralizador establecido en juliana, corte las manzanas en largas espirales que se asemejan a los fideos (alternativamente ralle las manzanas gruesas). Colóquelos en un tazón. Espolvorea sobre el extracto de vainilla, pasas, canela, jarabe de arce y mantequilla y mezcla para combinar.", "Enrolle la masa fría en un trozo de pergamino para hornear ligeramente espolvoreado con harina para formar un rectángulo de 3-4 mm de grosor. Transfiera el papel y la masa enrollada a una bandeja para hornear.", "Apila los \\\"fideos\\\" de manzana en un lado del rectángulo de repostería. Dobla la otra mitad de la masa sobre la parte superior, usando el papel para hornear para ayudarte. Presione suavemente en los bordes para sellar.", "Hornee la tarta de fideos de manzana en el horno en el estante del medio durante 12-15 minutos, luego retire la tarta del horno y espolvoree sobre las almendras. Vuelva al horno durante 4-5 minutos, o hasta que la masa esté crujiente y dorada, y el relleno se haya suavizado. Retire del horno y deje enfriar por 10-15 minutos.", "Mientras tanto, para el jengibre crème fraîche, mezcle la crème fraîche y el jengibre en un bol hasta que estén bien combinados.", "Para servir, corte la tarta de fideos de manzana en trozos y cubra cada uno con una cucharada de crema de jengibre."]}, {"isVegetarian": true, "title": "Tarta de manzana con crema pastelera", "url": "www_bbc_co_uk_food_recipes_apple_pie_with_custard_29696", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "125g / 4½oz de mantequilla sin sal, refrigerada, cortada en cubos", "1 naranja, solo ralladura", "75 g / 2½ oz de azúcar en polvo", "pizca de sal", "2 yemas de huevo de gallinas camperas", "1kg / 2lb 4oz de manzanas Cox, peladas, sin corazón y cortadas en trozos grandes", "Manzanas Bramley de 250g / 9oz, peladas, sin corazón y cortadas en trozos grandes", "Manzanas Royal Gala de 250g / 9oz, peladas, sin corazón y cortadas en trozos grandes", "200 g / 7 oz de azúcar en polvo", "1 cucharada de harina de maíz", "2 cucharaditas de extracto de vainilla", "1 cucharadita de canela molida", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, dividida longitudinalmente y semillas raspadas", "2 yemas de huevo de gallinas camperas", "50 g / 1 oz de azúcar en polvo"], "serves": "", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la masa, combine la harina, la mantequilla, la ralladura de naranja, el azúcar y la sal en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue las yemas de huevo y pulse hasta que la mezcla se una para formar una masa áspera. Dale la vuelta a una superficie de trabajo enharinada y amasa suavemente hasta que quede suave. Forme la masa en un disco, envuélvala en una película adhesiva y refrigérela mientras realiza el relleno.", "Para el llenado, coloque las manzanas y el azúcar en una cacerola y caliéntelos suavemente durante cinco minutos, o hasta que las manzanas empiecen a romperse ligeramente. Agregue la harina de maíz, la vainilla y la canela y cocine por otros dos minutos. Dejar de lado para enfriar por completo.", "Precalentar el horno a 200C / 400F / Gas 6.", "En una superficie de trabajo enharinada, divida la masa en tres partes. Extienda dos tercios de la masa al grosor de una moneda de una libra y úsela para revestir una lata de pastel de 23 cm. Cubra con papel resistente a la grasa, rellene con frijoles para hornear y hornee durante 15 minutos (esto se conoce como cocción ciega). Retire los frijoles para hornear y el papel y hornee por otros 10 minutos, o hasta que la masa esté crujiente y apenas comience a colorear.", "Extienda la masa remanente al grosor de una moneda de una libra, en un círculo áspero. Vierta el relleno en la base de repostería horneada y cubra con la masa restante. Hornee durante 20-25 minutos, o hasta que la masa esté dorada y crujiente.", "Mientras tanto, prepara la crema pastelera. En una sartén a fuego medio, agregue la leche, la crema y la vaina de vainilla y las semillas. Llevar a fuego lento y luego eliminar del fuego.", "Batir las yemas de huevo y el azúcar en un bol. Cuele la mezcla de leche caliente a través de un colador y vierta lentamente sobre la mezcla de yema, batiendo todo el tiempo. Regrese la mezcla a una olla limpia y cocine suavemente durante cinco minutos hasta que espese, revolviendo constantemente. Sirva inmediatamente, vierta sobre una rebanada del pastel de manzana caliente."]}, {"isVegetarian": true, "title": "Pastel de manzana, ciruela y canela", "url": "www_bbc_co_uk_food_recipes_apple_plum_and_cinnamon_59262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 675g / 1½lbs, más extra para quitar el polvo", "pizca de sal", "175g / 6oz de manteca vegetal, como Trex, cortada en cubos", "225g / 8oz de mantequilla ligeramente salada, cortada en cubos", "1 huevo de corral, separado", "6 Bramley cocinando manzanas, peladas, sin corazón y picadas", "3 manzanas dulces (como Golden Delicious), peladas, sin corazón y picadas", "1 limón, solo jugo", "6 ciruelas rojas, piedras removidas y descuartizadas", "2 cucharadas de harina de maíz", "175g / 6 oz de azúcar", "115g / 4oz de azúcar morena suave", "1 cucharadita de pimienta de Jamaica molida", "1 cucharadita de canela molida", "pizca de nuez moscada recién rallada", "1-2 cucharadas de leche", "30g / 1 oz de azúcar"], "serves": "Sirve 10", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa, tamice la harina y la sal en el tazón de un procesador de alimentos. Agregue la manteca y la mantequilla y procese hasta que la mezcla se asemeje a migas de pan finas.", "Agregue la yema de huevo y el pulso, la mezcla debe unirse para formar una masa. Si tu mezcla está demasiado seca agrega un poco de agua y vuelve a pulsar.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase brevemente. Traiga la masa en una bola, colóquela en una bolsa de plástico y refrigérela durante 20-30 minutos.", "Mientras tanto, prepare el relleno, coloque las manzanas en una cacerola y agregue el jugo de limón para evitar que se doren. Agrega las ciruelas.", "Mezcle la harina de maíz con los azúcares, la pimienta de Jamaica, la canela y la nuez moscada rallada. Coloque en la sartén con la fruta y mezcle para cubrir la fruta en la mezcla seca.", "Coloque a fuego medio y cocine hasta que los azúcares se derritan para formar un caramelo. Llevar a fuego lento a fuego lento durante dos minutos y luego reservar para enfriar.", "Precalentar el horno a 180C / 350F / Gas 4.", "Enharine ligeramente una superficie de trabajo y un rodillo. Retire los pasteles del refrigerador y reserve un tercio para la tapa del pastel. Estire los pasteles restantes hasta que queden lo suficientemente grandes como para que quepan generosamente en el plato para pasteles (aproximadamente 40 cm). Utilice el rodillo para ayudarlo a levantar la masa dentro del plato de pastel y presiónelo suavemente hacia los lados, dejando cualquier exceso de hojaldre colgando sobre los lados. Regrese a la nevera para enfriar por unos minutos.", "Cuando esté frío, retire la caja de la nevera y colóquela en una bandeja para hornear. Cubra con pergamino para hornear y rellene con frijoles para hornear y luego hornee durante aproximadamente 10 minutos, o hasta que la masa apenas comience a colorear y se seque. Retire el pergamino para hornear y los frijoles para hornear.", "Batir ligeramente la clara de huevo y untar sobre la masa para glasear. Regrese la masa al horno y cocine durante otros cinco minutos, o hasta que la masa tenga un color marrón dorado pálido y se seque.", "Extienda la masa restante para la tapa de la pastelería, usando una placa para cortar un círculo que sea aproximadamente del tamaño correcto. Use cualquier exceso de pastel para formar una tira de 1x26cm / ½x10½in y formas para decorar el pastel.", "Corte el exceso de hojaldre del borde del plato para pastel, dejando alrededor de 1 cm / ½ pulgada del borde del plato para pastel.", "Con una cuchara ranurada, coloque la fruta enfriada en la caja de repostería, descartando cualquier exceso de líquido.", "Coloque la tira delgada de masa en la parte superior del borde expuesto de la fuente para pastel. Cepille con un poco de agua, luego coloque la tapa del pastel en la parte superior y corte para darle forma.", "Engarce los bordes para sellar y coloque las formas decorativas en la parte superior. Haga un pequeño agujero en el medio para dejar escapar cualquier vapor mientras cocina.", "Esmaltar con leche y espolvorear con azúcar. Hornee durante 40-45 minutos, o hasta que la masa esté dorada y crujiente."]}, {"isVegetarian": true, "title": "Anillos de manzana con jengibre, limón y pimienta negra en tahini", "url": "www_bbc_co_uk_food_recipes_apple_rings_with_ginger_57928", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_rings_with_ginger_57928_16x9.jpg", "ingredients": ["5 cucharadas de tahini", "2 cucharaditas de jengibre finamente rallado", "2 cucharaditas de miel", "½ cucharadita de pimienta negra recién molida", "pizca de sal", "2 manzanas, peladas, sin corazón, cortadas en rodajas"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle todos los ingredientes excepto las rodajas de manzana en un tazón pequeño hasta que estén bien combinados.", "Extienda la mezcla sobre las rodajas de manzana y sirva."]}, {"isVegetarian": true, "title": "Galettes de alforfón de Apple, cohetes y queso feta", "url": "www_bbc_co_uk_food_recipes_apple_rocket_and_feta_26780", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_rocket_and_feta_26780_16x9.jpg", "ingredients": ["100 g / 3½ oz de harina de alforfón", "1 huevo de gallinas camperas", "50g / 2oz de mantequilla, derretida", "1 cucharada de ghee", "dash aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de mantequilla", "2 cebollas rojas grandes, en rodajas finas", "2 manzanas verdes, peladas, sin corazón, cortadas en trozos de 3cm / 1¼ pulgadas", "pellizcar copos de sal marina", "pimienta negra recién molida, al gusto", "exprimir jugo de limón", "Cohete de bolsa de 70 g, lavado y secado", "200g / 7oz hecha"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 5. Cubra una bandeja para hornear con papel para hornear.", "Tamiza la harina en un tazón y sazone con sal y pimienta. Grieta en el huevo. Poco a poco agregue 300ml / 10½ fl oz de agua en una corriente delgada, batiendo continuamente hasta que la mezcla forme una pasta espesa y suave. Reserve a un lado durante 1 hora para descansar.", "Mientras tanto, para el relleno, caliente la mantequilla en una sartén a fuego medio. Agregue las cebollas y fría por 4-5 minutos, o hasta que estén suaves pero no coloreadas.", "Agregue las manzanas y continúe cocinando, revolviendo regularmente, durante 10-15 minutos, o hasta que las manzanas se ablanden y empiecen a dorarse. Sazone con sal, pimienta y jugo de limón. Poner a un lado (mantener caliente).", "Cuando la masa ha descansado, mezcle la mantequilla derretida hasta que esté bien combinada.", "Caliente el ghee y una pizca de aceite de oliva en una sartén de cerámica o de fondo grueso a fuego medio-alto. Cuando la grasa esté humeando, agregue una cucharada de masa a la sartén y hágalo girar hasta que la masa cubra la base de la sartén.", "Freír la galette durante 2-3 minutos, o hasta que esté dorada en su parte inferior y fácil de aflojar desde el fondo de la sartén. Voltee y fríe por un minuto en el otro lado, o fríalos hasta que estén cocidos. Retire de la sartén y manténgalo caliente en el horno. Repita el proceso con la masa restante.", "Ponga un puñado de hojas de cohetes en el centro de cada galette. Divida la mezcla de manzanas por igual entre las galettes. Desmenuza el feta.", "Doble los bordes de cada galette para crear una forma cuadrada. Transfiéralos a la bandeja de horneado preparada y hornea en el horno durante 6-7 minutos, o hasta que estén crujientes. Sirva con una simple ensalada verde aderezada con aceite de oliva y un toque de vinagre de sidra de manzana."]}, {"isVegetarian": true, "title": "Strudel de manzana", "url": "www_bbc_co_uk_food_recipes_apple_strudel_03967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de pasas", "1 naranja grande, jugo y ralladura", "800 g / 1 libra 12 oz manzanas de cocina, peladas, sin corazón, cortadas en pequeños trozos", "50g / 2oz de mantequilla sin sal", "100 ml / 3½ fl oz de agua", "100 g / 3½ oz de azúcar en polvo", "1 cucharadita de canela molida", "gran puñado de migas de pan frescas", "50g / 2oz de mantequilla sin sal, derretida", "4 hojas de pasta filo", "azúcar en polvo, para quitar el polvo", "crema doble, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el relleno, remoje las pasas en el jugo de naranja y la ralladura.", "Cocine las manzanas en una sartén con la mantequilla, el agua y el azúcar durante 8-10 minutos, o hasta que las manzanas se hayan suavizado un poco, pero aún conserven su forma.", "Retire la sartén del fuego, agregue la canela, las pasas y el jugo y las migas de pan y revuelva para combinar (las migas de pan unirán todo junto). Dejar de lado para enfriar.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para la masa, cepille la bandeja de hornear con un poco de la mantequilla derretida, extienda una hoja de filo en la bandeja de hornear, y cepille con un poco más de la mantequilla. Repita el proceso con las cuatro hojas, colocándolas una encima de la otra, cepillándolas con mantequilla derretida cada vez.", "Con una cuchara, coloque la mezcla de manzana en el centro de la masa y enrolle, el lado más largo primero, en un paquete, con la costura hacia abajo. (Si lo desea, puede preparar algunos pasteles de filo adicionales para hacer una decoración para la parte superior).", "Cepille todo con la mantequilla restante y hornee en el horno durante 15-20 minutos, o hasta que la parte superior esté crujiente y dorada. (Compruebe el strudel después de 10 minutos, si se está dorando demasiado rápido, reduzca un poco el fuego).", "Polvo con azúcar glas y servir con crema doble."]}, {"isVegetarian": true, "title": "Strudel de manzana", "url": "www_bbc_co_uk_food_recipes_apple_strudel_24124", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_strudel_24124_16x9.jpg", "ingredients": ["750g / 1lb 10oz Bramley manzanas, peladas, sin corazón, descuartizadas y en rodajas", "1½ cucharadita de canela molida", "½ limón sin cebar, solo cáscara", "2 cucharaditas de jugo de limón", "100 g / 3½ oz de azúcar en polvo de oro", "75 g / 2½ oz pasas", "95 g / 3½ oz de mantequilla", "Pan rallado blanco 40g / 1½ oz", "6 hojas grandes de pasta filo", "1 cucharada de azúcar glas"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 190 ° C / 170 ° Ventilador / Gas 5. Cubra una bandeja para hornear con papel para hornear.", "Mezcle las manzanas con la canela, la ralladura de limón y el jugo, el azúcar y las pasas. En una sartén pequeña, derrita 20g / ¾oz de mantequilla y fría las migas de pan hasta que estén doradas, luego agregue a la mezcla de manzana.", "Derretir la mantequilla restante en una sartén. En una toalla de té limpia y seca, coloque una hoja del filo y cepille con un poco de la mantequilla derretida. Coloque otra hoja encima y repita hasta que haya usado todo el filo.", "Apile el relleno a lo largo de la masa a lo largo de un lado a unos 2-3 cm / 1 pulgada del borde y con la toalla de té para ayudarlo, enrolle la masa para encerrar el relleno. Meta los extremos y ruede con la costura hacia abajo sobre la bandeja para hornear forrada. Cepille con la mantequilla derretida restante.", "Hornea durante 40-45 minutos, hasta que estén doradas. Dejar enfriar a temperatura ambiente y espolvorear con azúcar glas. Rebane y sirva con crema, helado o natillas."]}, {"isVegetarian": true, "title": "Remolinos de manzana, sultana y canela", "url": "www_bbc_co_uk_food_recipes_apple_sultana_and_48182", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_sultana_and_48182_16x9.jpg", "ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "10g / ¼ oz de sal marina fina", "50 g / 1 oz de azúcar en polvo", "Levadura de acción rápida 9g / ⅓oz", "1 huevo grande de gallinas camperas, más 1 yema de huevo grande, ligeramente batido", "150ml / 5fl oz de leche entera, calentada a 43C", "1 cucharadita de aceite de oliva o aceite vegetal ligero, para engrasar", "250g / 9oz de mantequilla sin sal, refrigerada", "Mantequilla sin sal 110g / 4oz, ablandada", "160g / 5¾oz de azúcar en polvo", "4 cucharaditas de canela molida", "250 g / 9 oz manzanas Bramley peladas, sin corazón y picadas (alrededor de 2 manzanas)", "50g / 1¾oz sultanas", "1 naranja, zarzuela y jugo pequeños sin cera", "½ limón sin cebar, solo cáscara", "1 cucharadita de extracto de vainilla", "50g / 1¾oz de conserva de albaricoque", "2 cucharaditas de jugo de limón", "1 huevo de gallinas camperas, batido con 2 cucharadas de leche entera", "150g / 5½oz de azúcar glas, tamizado", "2 cucharadas de agua hirviendo", "½ cucharadita de extracto de vainilla"], "serves": "Hace 12", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa de hojaldre, coloque la harina, la sal y el azúcar en un lado de un tazón grande y la levadura en el lado opuesto. Agregue los huevos, la leche tibia y 50ml / 1¾ fl oz de agua y mezcle durante un minuto con un tenedor hasta que se combinen. Agregue un poco más de agua si es necesario para formar una masa suave.", "Espolvoree una superficie de trabajo con harina y termine la masa. Polvo con un poco de harina y amasar durante 5 minutos, luego formar una bola.", "Engrase ligeramente un recipiente para mezclar y una gran pieza de película adhesiva. Coloque la masa en el recipiente y cubra con la película adhesiva. Ponga a un lado en un lugar cálido para probar durante una hora, o hasta casi duplicar su tamaño.", "Para el relleno, bata la mantequilla y 110 g / 4 oz del azúcar en un tazón. Agregue la canela y reserve.", "Coloque las manzanas en una cacerola y agregue el azúcar restante. Cocine a fuego medio durante unos 10 minutos, revolviendo regularmente, hasta que las manzanas comiencen a descomponerse. Agregue las pasas sultanas, el jugo de naranja, la ralladura de naranja y la ralladura de limón. Calienta suavemente durante 5 minutos y luego déjalo enfriar. Cuando esté frío, agregue el extracto de vainilla.", "Para el glaseado, combine la conserva de albaricoque y el jugo de limón con 2 cucharadas de agua en una cacerola de base pesada. Lentamente lleve a ebullición, (no lo agite demasiado o se formarán burbujas y el glaseado aparecerá turbio), transfiera el glaseado a un recipiente resistente al calor y colóquelo sobre una fuente de agua hirviendo a fuego lento hasta que el glaseado esté mojado. Pase a través de un colador y luego regrese a la sartén y déjelo a un lado.", "Para terminar la masa, extender la masa sobre una superficie de trabajo ligeramente enharinada hasta 1 cm / ½ pulgada de espesor.", "Batir la mantequilla fría con un rodillo, hasta que se aplana en un rectángulo de aproximadamente la mitad del tamaño del rectángulo de la masa. Arregle la masa con un borde corto cerca de usted y ponga la mantequilla en el medio. Doble la parte superior e inferior de la masa sobre la mantequilla y presione hacia abajo los bordes para asegurarse de que la mantequilla quede sellada dentro de la masa. Con un rodillo, golpee la masa desde el centro hacia arriba y desde el centro hacia abajo. Esto asegura que la mantequilla se distribuye de manera uniforme.", "Estirar la masa a un rectángulo grande de aproximadamente 1 cm / ½ pulgada de grosor. Voltee la masa para que tenga un borde largo cerca de usted, luego pliegue el tercero derecho en el centro y cúbralo con el tercio izquierdo. Enfriar en la nevera durante 30 minutos. Haga esto girando, doblando y enfriando dos veces más.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque dos bandejas grandes para hornear con papel para hornear antiadherente.", "Para armar los pasteles, enrolle los pasteles en un rectángulo de aproximadamente 36x30 cm / 10x8 pulgadas y 1 cm / ½ pulgadas de espesor. Extiéndalo con la mezcla de canela y mantequilla dejando aproximadamente 2 cm / ¾in de masa libre de la mezcla en el lado más cercano a usted. Enrolla la masa hacia ti. Cepilla el último trozo de masa con un poco de huevo para que se pegue.", "Corte los extremos desaliñados y luego corte el rollo en 12 piezas pares con un cuchillo filoso. Coloque los pasteles en las bandejas preparadas, dejando suficiente espacio alrededor de cada una. Enharina ligeramente las manos y aplaste cada rebanada ligeramente, haciendo una pequeña sangría en el medio. Con una cuchara, una cucharadita de la mezcla de manzana en el centro de cada hojaldre. Cubra con una toalla de té limpia o una bolsa de plástico y déjelo en un lugar cálido durante 10 minutos.", "Cepille con un lavado de huevo y luego hornee durante 15-20 minutos, o hasta que estén crujientes y doradas.", "Coloque los pasteles cocidos en los estantes de enfriamiento y cepíllelos con glaseado de albaricoque mientras aún estén calientes. Deje que se enfríe completamente.", "Mientras tanto, mezcle todos los ingredientes de glaseado hasta que quede suave. Transfiera a una manga pastelera de papel y líneas de tubería a través de la masa para terminar."]}, {"isVegetarian": true, "title": "Tarta de manzana con helado de morera y mora", "url": "www_bbc_co_uk_food_recipes_apple_tart_with_mulberry_25791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250 g / 9 oz de moras y moras mixtas", "Azúcar 95g / 3 oz", "150ml / 5fl oz crema", "150ml / 5fl de leche en oz", "½ vaina de vainilla, cortada por la mitad a lo largo y semillas raspadas", "3 yemas de huevo de gallinas camperas", "3 manzanas Bramley, peladas, sin corazón y picadas", "450 g / 1 libra de hojaldre confeccionado", "1 yema de huevo de gallinas camperas, golpeada", "2 manzanas Pink Lady, peladas, sin corazón y en rodajas finas", "75g / 2½oz de mantequilla, derretida", "4 cucharadas de azúcar en polvo"], "serves": "Sirve 4-6", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para el helado de mora y mora, agregue las moras, las moras, 15 g / ½ oz del azúcar y una cucharada de agua fría a una sartén y caliente durante cinco minutos, o hasta que las bayas se hayan suavizado. Dejar de lado para enfriar.", "Vierta la crema y la leche en un recipiente resistente al calor. Agregue las semillas de vainilla y mezcle bien. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Caliente la mezcla suavemente pero no hierva.", "En otro recipiente, bata las yemas de huevo y 80 g / 2¾ oz del azúcar hasta que estén suaves. Agregue la crema caliente y la mezcla de leche y mezcle bien. Regrese la mezcla de crema al recipiente utilizado para calentar la crema y continúe cocinando suavemente sobre el agua hirviendo. Revuelva regularmente, hasta que la mezcla sea lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Escurra las bayas a través de un tamiz colocado sobre un recipiente y reserve el líquido. Coloque el tamiz sobre otro recipiente y empuje las bayas a través del tamiz para formar un puré, agregue un poco del líquido reservado si el puré es muy espeso.", "Reserve un poco de puré y crema de vainilla para decorar.", "Revuelva el puré restante en la crema pastelera. Transfiera a una máquina para hacer helados y revuelva según las instrucciones del fabricante.", "Para la tarta de manzana, precalentar el horno a 200C / 400F / Gas 6.", "Coloque las manzanas toscamente picadas y dos cucharadas de agua en una sartén y cúbralas con una tapa. Colocar a fuego medio y llevar a fuego lento. Cocine por 3-4 minutos, o hasta que las manzanas estén blandas.", "Batir las manzanas hasta obtener un puré suave, luego reservar para enfriar.", "En una superficie de trabajo ligeramente enharinada, extienda la masa en un círculo de aproximadamente 30 cm de diámetro. Marque ligeramente un círculo interior de 1 cm / ½ pulg dentro del borde de la masa.", "Cepille la parte superior de la masa con huevo batido. Espere un minuto, luego cepille la masa nuevamente con más huevo.", "Cuando el puré de manzana esté frío, extiéndalo sobre el círculo interior de la masa. Coloque las finas rebanadas de manzana sobre el puré de manzana. Cepille las rebanadas de manzana con mantequilla derretida y espolvoree el azúcar impalpable.", "Hornee durante 25-30 minutos, o hasta que la masa esté dorada y las manzanas estén caramelizadas.", "Para servir, corte la tarta en rodajas y colóquela en el centro de los platos para servir con una bola de helado al costado."]}, {"isVegetarian": true, "title": "Tarta de manzana con salsa de caramelo especiado", "url": "www_bbc_co_uk_food_recipes_apple_tart_with_spiced_69773", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Hojaldre con mantequilla de 450g / 1lb", "1 yema de huevo de gallinas camperas, golpeada", "Mazapán 300g / 10½ oz", "4 manzanas de postre, peladas, sin corazón y en rodajas finas", "50g / 1¾oz de mantequilla", "4 cucharadas de miel clara", "helado de vainilla, para servir", "150 g / 5½ oz de azúcar en polvo", "Anís de 2 estrellas", "½ cucharadita de clavo de olor", "¼ cucharadita de nuez moscada recién rallada", "½ cucharadita de bayas de enebro", "Crema doble 175ml / 6fl oz"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 210C / 425F / Gas 7.", "Sobre una superficie de trabajo ligeramente enharinada, extender la masa de hojaldre a 3-4 mm / ⅛ de espesor. Recorta cuatro círculos de 12cm / 4½ pulgadas con un cortador de pasteles y transfiéralos a una bandeja para hornear.", "Marque un círculo en el centro de la masa con un cuchillo (dejando un borde de 1 cm / ½ pulgadas) y luego cepille con un lavado de huevos.", "Ruede el mazapán a 5 mm / ¼ de grosor y córtelo en cuatro círculos de 11 cm / 4¼ pulgadas y colóquelo en el centro de la masa. Cuidadosamente coloque las manzanas en un anillo superpuesto sobre el mazapán para cubrirlo todo.", "Coloque la mantequilla y la miel en una olla pequeña y cocine a fuego lento, revolviendo para combinar. Cepilla la mayor parte sobre la parte superior de las manzanas.", "Ponlo en el horno y hornea por 15-18 minutos, o hasta que la masa se levante y se dore.", "Cepille con la mantequilla derretida restante y la miel para glasear.", "Para la salsa de caramelo con especias, coloque el azúcar y las especias en una sartén y cocine hasta que el azúcar se derrita y se dore. Agregue la crema doble y cocine a fuego lento.", "Cocine por 3-5 minutos, o hasta que se espese, luego pase a través de un colador fino en una sartén limpia.", "Para servir, coloca las tartas en el centro de los platos para servir y coloca la salsa alrededor del borde. Termine con una cucharada de helado en la parte superior."]}, {"isVegetarian": true, "title": "Chaussons de manzana, nuez y pasas con queso Cheshire", "url": "www_bbc_co_uk_food_recipes_apple_walnut_and_raisin_79143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "2 cucharaditas de levadura de acción rápida", "Azúcar en polvo 80g / 3oz", "125ml / 4fl oz de leche entera", "2 huevos medianos de granja", "2 cucharadita de sal marina fina", "250g / 9oz de mantequilla sin sal, refrigerada", "3 tartas comiendo manzanas (como Granny Smith), sin corazón y peladas", "1 limón, ralladura solamente", "2 cucharaditas de especias mixtas", "20 g / ¾oz de mantequilla sin sal", "50 g / 1oz de pasas", "Nueces de 35g / 1¼oz, picado grueso", "4 cucharadas de azúcar en polvo", "Queso Cheshire 100 g / 3½ oz, rallado", "pimienta recién molida", "1 huevo grande de granja, batido, para glasear"], "serves": "Hace 12 pasteles", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa, caliente la leche y 90 ml / 3 fl oz de agua en una olla pequeña hasta que esté tibio.", "Coloque todos los demás ingredientes, excepto la mantequilla, en el recipiente de una batidora independiente con un accesorio de gancho de masa, asegurándose de que la levadura no toque la sal. Agregue tres cuartas partes de la mezcla de leche y agua.", "Encienda el mezclador a baja velocidad hasta que todos los ingredientes estén incorporados. Agregue un poco más de líquido si la masa parece demasiado seca; quieres una masa un poco pegajosa Aumenta la velocidad y mezcla durante siete minutos.", "Extiende la masa en una bandeja para hornear forrada con pergamino para hornear. Cubra con una película adhesiva y colóquelo en el congelador para que se enfríe.", "Con un rodillo, aplaste la mantequilla entre dos pedazos de pergamino para hornear en un rectángulo de 33x19 cm / 13x7½ pulgadas y colóquelo en el congelador.", "Después de 15 minutos retire la masa del congelador y extiéndala en un rectángulo de 50x20cm / 19½x8 pulgadas. Con un borde corto hacia usted, coloque la mantequilla aplanada sobre los dos tercios inferiores de la masa.", "Dobla el tercio superior de la masa sobre la mantequilla y luego pliega el tercio inferior hacia arriba para que toda la mantequilla quede envuelta. Presione los bordes firmemente juntos.", "Gire el bloque de masa 90 grados y extiéndalo a 50x20cm / 19½x8in. Doble el tercio superior hacia abajo y el tercero inferior hacia arriba y vuelva a colocar en el congelador durante 15 minutos.", "Repita el laminado y doblar dos veces más, colocando la masa en el congelador durante 15 minutos en el medio. Almacene cubierto en el refrigerador hasta que esté listo para usar.", "Mientras tanto, para el relleno, corte la manzana en trozos de 5 mm y colóquela en un tazón grande y resistente al calor. Agregue la ralladura de limón, especias mixtas, mantequilla, pasas, nueces y azúcar.", "Cubra con película adhesiva y coloque en un microondas en la configuración más alta durante seis minutos (también puede hacerlo en una olla, cocinando hasta que las manzanas se ablanden). Revuelva para combinar, luego extienda el relleno en un plato para que se enfríe por completo.", "Cortar la masa en dos partes iguales y extender una mitad sobre una superficie de trabajo bien enharinada a un grosor de 4 mm.", "Con un cortador redondo de 11 cm / 4½ pulgadas, corte seis círculos. Coloque una cucharada de relleno de manzana en el centro de cada círculo y espolvoree un poco de queso Cheshire en la parte superior. Sazonar con pimienta.", "Cepille un poco de huevo batido alrededor del borde de cada círculo de masa. Doble por la mitad para encerrar el relleno y presione para sellar.", "Coloque cada hojaldre en una bandeja para hornear forrada con papel de hornear antiadherente. Repita el proceso de laminación, corte y llenado con el segundo lote de masa para hacer 12 chaussons. Cubra los chaussons con film transparente y deje que se demuestre a temperatura ambiente durante 40 minutos.", "Precaliente el horno a 200C / 400F / Gas 6. (No use un horno asistido por ventilador).", "Haga tres cortes en la parte superior de cada chasis para permitir que escape el vapor y cepille con el huevo batido. Hornee por 20 minutos o hasta que esté bien dorado.", "Retire del horno y deje que se enfríe un poco antes de transferirlo a un estante de enfriamiento."]}, {"isVegetarian": true, "title": "Zapatero de manzana y arándano", "url": "www_bbc_co_uk_food_recipes_appleandblueberrycob_12556", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g / 1lb 10oz Bramley manzanas", "250 g / 9 oz de arándanos", "200g / 7oz de mantequilla sin sal", "200 g / 7 oz de azúcar en polvo", "200 g / 7 oz de almendras molidas", "3 huevos", "55 g / 2 oz de almendras, en rodajas finas"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pelar, cortar y cortar las manzanas en trozos. Cocine en una sartén a fuego medio con 1 cucharada de agua y azúcar al gusto, hasta que se derrumbe.", "Bata la mantequilla y el azúcar con un batidor hasta que esté suave y esponjoso.", "Agregue las almendras molidas, luego agregue los huevos uno a la vez (esperando hasta que cada huevo se haya incorporado).", "Llene una fuente de horno de cerámica hasta la mitad con manzana cocida, esparza los arándanos sobre la parte superior, luego una la crema de almendras sobre la fruta (se extenderá durante la cocción).", "Espolvoree las almendras rebanadas sobre la crema de almendras y hornee a 180 ° C / 350 ° F / Gas 4 durante aproximadamente 40 minutos.", "Sirva con una bola gigante de helado de vainilla y polvo con azúcar glas."]}, {"isVegetarian": true, "title": "Pastel de manzana y arándanos", "url": "www_bbc_co_uk_food_recipes_appleandblueberrypie_85998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450 g / 1 libra de pasta brisa lista para usar", "100 g / 3½ oz de azúcar en polvo, más extra para rociar", "½ limón, ralladura y jugo", "550g / 1lb 3½oz de manzanas Bramley", "25g / 1oz de mantequilla, más extra para engrasar los moldes", "½ cucharadita de canela molida (opcional)", "150 g / 5¼ oz de arándanos", "1 huevo mediano de granja, ligeramente golpeado", "crema coagulada, para servir"], "serves": "6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mantequilla 6 x 7,5 cm / 3 en moldes dariole (o un plato a prueba de horno de 22 cm / 9 pulgadas si desea hacer una tarta grande).", "Estirar dos tercios de la masa sobre una superficie de trabajo enharinada usando un rodillo. Con un cortador de hojaldre del tamaño de los moldes dariole, corte seis discos lo suficientemente grandes como para revestir los moldes dariole; alinee el fondo y los lados de los moldes con mantequilla con los discos de hojaldre (o si hace un pastel, recorte un círculo grande de masa para alinear el plato con mantequilla). Transferir a la nevera para enfriar.", "Coloque el azúcar, el jugo de limón y la ralladura de limón en un bol.", "Pele, corte y apelmace las manzanas, luego córtelas en rodajas gruesas en el tazón con el limón y el azúcar. Mezclar todo junto.", "Calentar una sartén a fuego medio. Agregue la mezcla de manzana, la mantequilla y la canela (si está usando) y cocínelos durante 3-4 minutos. Agregue los arándanos y cocine por unos minutos más, antes de retirarlos del fuego para que se enfríen.", "Precalentar el horno a 200C / 400F / Gas 6.", "Llene los moldes de dario con forro de bollos o el plato para pastel con la mezcla fría de manzana y arándano.", "Extienda la masa restante sobre una superficie de trabajo enharinada y recorta los discos un poco más grandes que los moldes dariole o el plato para pastel. Coloque la masa en la parte superior de los moldes dariole o plato de pastel y sellar bien los bordes. Haga un pequeño orificio en la parte superior para permitir que escape el vapor.", "Haga decoraciones (como hojas) cortando cualquier guarnición de pastelería con un cuchillo afilado y péguelas con un poco de agua. Cepille las tapas de los pasteles con un poco de huevo ligeramente batido y luego drague con azúcar impalpable.", "Hornee durante 15 minutos, hasta que la fruta esté tierna y la parte superior esté dorada. Servir caliente con crema cuajada"]}]