[{"isVegetarian": true, "title": "Banana crumble tart with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_bananacrumbletartwit_71447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "100g/3½oz unsalted butter", "100g/3½oz icing sugar", "2 medium eggs", "1 vanilla pod - cut and split", "35g/1oz plain flour", "35g/1oz caster sugar", "pinch of cinnamon", "5 bananas", "180g/6oz butter", "180g/6oz sugar", "6 tbsp cream", "100ml/3½fl oz cream", "50g/1¾oz chocolate"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Rub flour and butter together, add icing sugar.  ", "Beat the eggs and vanilla seeds and add to mix.  Bring mix together and wrap in cling film. Leave to rest in the fridge for one hour. ", "After resting, roll out the pastry, line 20cm/8in tart ring and blind bake at 180C/360F/Gas 4 for 15-20 minutes. ", "Slice bananas lengthways and, in a hot non-stick pan, add the sugar and butter and take to a caramel stage.   ", "Add sliced bananas, add cream and coat bananas all over.  Put mix in tart case.  ", "Rub flour, castor sugar and cinnamon together and sprinkle on top.   ", "Bake for ten minutes until golden.  ", "Heat cream, take off heat and add chocolate.   ", "Mix until chocolate is melted.   ", "Slice tart and drizzle the chocolate sauce around it."]}, {"isVegetarian": true, "title": "Banana drop scones", "url": "www_bbc_co_uk_food_recipes_bananadropscones_76052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["45g/2¾oz self-raising flour", "1 free-range egg", "150ml/5fl oz milk", "1 tbsp vegetable oil", "1 tbsp butter", "2 tbsp caster sugar", "4 tbsp double cream", "1 banana, cubed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the drop scones, place all the ingredients together in a bowl. ", "Mix until well combined, to create a thick batter.", "Heat the vegetable oil in a medium non-stick frying pan on a medium heat.", "Ladle the mixture into the pan in small dollops.  Cook for 1-2 minutes and turn over.  Cook until golden brown.", "To make the caramelised bananas, in a medium sized frying pan on a medium heat melt the butter.", "Add the sugar and cook for two minutes until golden.", "Add the cream and banana and cook for one more minute.", "Serve the drop scones with the caramelised bananas on top."]}, {"isVegetarian": true, "title": "Banana millionaire's shortbread with banana 'ice cream'", "url": "www_bbc_co_uk_food_recipes_bananamillionairessh_87979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter", "200g/7oz caster sugar", "2 x 400g/14oz cans condensed milk", "250g/8oz unsalted butter, softened", "150g/5oz caster sugar", "150g/5oz cornflour", "300g/10oz plain flour", "500g/1lb 2oz milk chocolate, chopped", "6-8 large bananas, peeled and sliced lengthways", "4 bananas, peeled and chopped", "¼ tsp vanilla essence", "3-4 tbsp caster sugar", "150ml/5fl oz buttermilk", "1 banana, sliced diagonally"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the caramel, place the butter and sugar into a non-stick pan over a low heat, stirring until the butter melts and the sugar dissolves. Add the condensed milk and slowly bring to the boil, stirring continuously, to make the caramel. As soon as the mixture thickens and begins to smell of caramel, remove from the heat.", "For the shortbread, preheat the oven to 200C/400F/Gas 6.", "Place the butter and sugar into a bowl and whisk together until light and fluffy.", "Add the cornflour and plain flour and mix to form a smooth dough. Gently knead the dough until it comes together as a ball.", "Line a 20cm x 30cm/8in x 12in baking tin with baking parchment.", "Flatten the dough lightly with a rolling pin, then place the dough into the bottom of the tin, evening it out and into all of the corners.", "Transfer to the oven and bake for 25 minutes. Remove from the oven and spread the caramelised condensed milk evenly over the top of the shortbread. Return to the oven for 5-6 minutes.", "Meanwhile, place the chocolate into a bowl and place over a pan of barely simmering water (do not let the water touch the bowl). Cook for 5-8 minutes, or until the chocolate has melted.", "Remove the shortbread from the oven and place the bananas on top of the caramel.", "Pour the chocolate over the bananas until they are just covered. Set aside to cool until the chocolate is firm.", "For the banana 'ice cream', place the bananas onto a baking sheet and place in the freezer. Freeze for at least one hour - until firm.", "When ready to serve the shortbread, place the frozen banana into a food processor. Add the vanilla essence, caster sugar and buttermilk and blend to a purée. The mixture should be frozen but slightly soft.", "To serve, cut the shortbread into even squares in the tin. Remove a square and place onto a serving plate. Top with a ball of the banana 'ice cream' and a slice of banana."]}, {"isVegetarian": true, "title": "Banana muffins", "url": "www_bbc_co_uk_food_recipes_bananamuffins_71268", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bananamuffins_71268_16x9.jpg", "ingredients": ["75g/3oz melted butter ", "250g/9oz self-raising flour ", "1 tsp baking powder ", "½ tsp bicarbonate of soda ", "pinch of salt ", "½ tsp ground cinnamon ", "½ tsp ground nutmeg ", "115g/4oz caster sugar ", "1 tsp vanilla extract ", "2 large, ripe bananas ", "2 medium eggs", "125ml/4fl oz milk ", "10 walnut kernels (optional) ", "2 bananas, sliced ", "50g/2oz walnut kernels ", "2 tbsp crème fraïche or yoghurt ", "2 tbsp runny honey"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 190C/375F/Gas 5. Melt the butter and allow to cool. Mash the bananas well. Sift the flour, baking powder, bicarbonate of soda, salt, cinnamon and nutmeg together in a large bowl, add caster sugar and stir through. ", "With a fork, beat together the eggs, vanilla extract, melted butter and milk in a second bowl. Add the mashed banana and stir through. ", "Make a well in the centre of the dry ingredients and add the egg mixture, stirring roughly with a fork (don't over mix) until it is a lumpy paste. ", "Set paper cases into the moulds, or grease the moulds well with a little extra oil or butter and spoon in the mixture until almost full. Top each one with a walnut kernel if you like. ", "Bake for 20 to 25 minutes or until the muffins come away from the side of the pan when touched. Rest the muffin tray on a wire rack for five minutes then remove the muffins and leave on the rack for another five minutes before serving. ", "Serve the muffins with sliced banana and a dollop of creme fraiche, scattered with walnuts and drizzled with honey (or with Caramel yoghurt)."]}, {"isVegetarian": true, "title": "Bananas Foster", "url": "www_bbc_co_uk_food_recipes_bananasfoster_85138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2½oz butter ", "125g/4½oz brown sugar ", "½ tsp ground cinnamon ", "4 tbsp banana liqueur ", "4 bananas, peeled and quartered ", "4 tbsp dark rum ", "4 scoops ready-made vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over a medium heat and cook the butter, sugar and cinnamon until the sugar has melted.", "Stir in the banana liqueur, then add the banana pieces and cook, stirring carefully, until softened and beginning to turn golden-brown.", "Add the rum and stir to combine. Turn up the heat and carefully flambé the rum until the flames die out.", "To serve, place a scoop of ice cream onto four serving plates. Top with the banana pieces and pour over the sauce from the pan."]}, {"isVegetarian": true, "title": "Bandera", "url": "www_bbc_co_uk_food_recipes_bandera_84328", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700ml/ 1 pint 5fl oz tomato juice", "200ml/7fl oz orange juice", "75ml/3fl oz fresh lime juice", "8 dashes Tabasco sauce", "2 level teaspoons of cayenne pepper", "50ml/2fl oz sangrita", "50ml/2fl oz blanco Tequila", "50ml/2fl oz lime juice"], "serves": "Makes 1 litre", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the sangrita, pour all of the sangrita ingredients into a jug and mix well.", "To serve, pour each of the three drinks into a shot glass, then line up the three glasses.", "Sip from each glass in turn - first the lime, then the tequila, and finally the sangrita."]}, {"isVegetarian": false, "title": "Bang bang turkey", "url": "www_bbc_co_uk_food_recipes_bang_bang_turkey_30047", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bang_bang_turkey_30047_16x9.jpg", "ingredients": ["1 tbsp soy sauce", "1 tbsp lime juice", "pinch palm or light soft brown sugar", "pinch hot chilli powder", "pinch Chinese five-spice powder", "250g/9oz cooked turkey meat, preferably breast, in long strips", "1 tbsp vegetable or groundnut oil", "2 shallots, finely chopped", "3 garlic cloves, crushed or grated", "5cm/2in piece fresh ginger, peeled and grated", "2 red chillies, seeds removed (according to taste), finely chopped", "200ml/7fl oz turkey (or chicken) stock", "150ml/5fl oz coconut milk", "75g/2½oz crunchy peanut butter", "2 tbsp soy sauce", "1 tbsp rice wine vinegar", "1 tsp palm sugar or soft light brown sugar", "1 tbsp kecap manis (optional)", "1 tbsp lime juice", "1 large Chinese lettuce or cabbage, shredded", "1 large carrot, julienned", "1 large courgette, julienned", "small bunch radishes, cut into matchsticks", "1 red pepper, cut into thin strips", "4 spring onions, halved lengthways and cut into thin strips", "2–3 red chillies, sliced", "small bunch fresh coriander", "few fresh mint leaves", "1 tbsp roasted, unsalted peanuts, lightly crushed"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["First marinade the turkey. Whisk the soy sauce, lime juice, sugar, chilli powder and five-spice together. Put the turkey in a dish, pour over the marinade and toss. Cover with cling film and leave to stand.", "For the peanut sauce, heat the oil in a frying pan and add the shallots. Cook on a medium heat until they are translucent and have taken on some colour, then add the garlic, ginger and chillies. ", "Continue to cook, stirring regularly, for another 2–3 minutes, then add the remaining sauce ingredients. Stir, then simmer until the sauce has reduced down. Leave to cool.", "To assemble the salad, arrange all the vegetables over a large serving platter. Use a tablespoon or so of the sauce to coat the turkey, then place this on top. Drizzle over a little more of the sauce, then garnish with the chillies, herbs and peanuts."]}, {"isVegetarian": false, "title": "Bang bang chicken", "url": "www_bbc_co_uk_food_recipes_bangbangchicken_82544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 shallots, finely sliced", "35g/1¼oz chopped fresh coriander", "1 cooked chicken breast, shredded", "½ lime, juice only", "1 garlic clove, crushed", "1 tsp sesame oil", "1 tsp soy sauce", "25g/1oz cashews, toasted", "1 tbsp vegetable oil", "2 pak choi leaves, shredded", "1 lime, halved, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the shallots, coriander and chicken breast in a bowl.", "In a mini blender, blend the lime juice, garlic, sesame oil, soy sauce and toasted cashews. ", "Place into a frying pan and cook gently until golden. Toss the sauce with the chicken salad.", "Heat the vegetable oil in a wok and stir fry the pak choi for one minute. ", "To serve, pour the warm salad onto the pak choi leaves on a large plate and garnish with lime halves."]}, {"isVegetarian": false, "title": "Bangers and mash", "url": "www_bbc_co_uk_food_recipes_bangers_and_mash_16021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 baking potatoes", "knob of butter, plus extra to serve", "2 Cumberland sausage rings", "sea salt and black pepper", "olive oil", "25g/1oz butter", "2 red onions, finely sliced", "2 tsp dark brown soft sugar", "2 tsp plain flour", "200ml/7fl oz red wine", "500ml/18fl oz chicken stock", "½ tsp English mustard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Light the barbecue and let the coals die down until they’re white, ashy and glowing. Pierce the potatoes several times each with a skewer, then smear with butter. ", "Season the potatoes with plenty of salt and pepper, then wrap each in a double layer of kitchen foil. Push the coals to one side, lay the potatoes in the bottom of the barbecue, then carefully rake the coals back over to cover. The potatoes will take around 40 minutes to cook, but check them every now and again by piercing with a skewer or the tip of a knife.", "Once the potatoes have been buried, set the grill over the top to heat. Secure the sausages with skewers to stop them from unravelling, then grill for 5 minutes on each side until caramelised. Move them to the side of the grill where there are no coals beneath, throw a handful of soaked wood chips onto the coals, then cover with a lid and leave to cook slowly for 20 minutes.", "For the gravy, heat a little oil in a saucepan, add the butter and onions and fry gently for 10 minutes. Add the sugar and cook for a further 3-4 minutes. Add the flour, cook for a further 2 minutes, then pour in the wine. ", "Bring to the boil, cook for 10 minutes and then pour in the stock. Simmer for a further 15 minutes, or until thickened slightly. Whisk in the mustard just before serving.", "Take the sausages off the grill and set aside on a board or warm plate. Dig the potatoes out of the charcoal, carefully unwrap, then cut in half and scoop out the flesh. Roughly mash the potatoes with a knob of butter and plenty of salt and pepper. Serve the sausages with the mashed potatoes and gravy."]}, {"isVegetarian": false, "title": "Bangers and mash", "url": "www_bbc_co_uk_food_recipes_bangers_and_mash_58475", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bangers_and_mash_58475_16x9.jpg", "ingredients": ["1kg/2lb 4oz potatoes", "8 large good-quality sausages", "1 tbsp vegetable oil", "250g/9oz Savoy cabbage", "4 spring onions\t", "5 tbsp milk ", "50g/1¾oz unsalted butter", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and dice the potatoes then tip into a large pan of salted cold water. Bring to the boil over a high heat. Reduce the heat and simmer gently for 10–15 minutes or until they are tender when pierced with a fork.", "Meanwhile, cook the sausages. Pierce the sausages with a fork then heat the oil in a large frying pan over a medium heat and fry the sausages gently for 10-12 minutes or until golden-brown and cooked through.", "Separate the cabbage leaves, cut out the stalks and discard, then finely slice. Bring a separate pan of water to the boil, add the cabbage and cook for 3-4 minutes until tender. Drain thoroughly. Finely slice the spring onions.", "Drain the potatoes, return them to the pan and add the milk and butter. Using a potato masher, mash until smooth and creamy. You may want to add a little bit more, or less, milk and butter, according to taste.", "Stir the spring onion in to the mash and season with salt and pepper. Serve the cabbage mash topped with the cooked sausages."]}, {"isVegetarian": false, "title": "Bangers and mash with onion gravy and peas", "url": "www_bbc_co_uk_food_recipes_bangers_and_mash_with_80175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 sausages ", "2 onions, sliced ", "½ tsp dried mixed herbs ", "½ tsp English mustard ", "600ml/20fl oz stock (ideally beef, although chicken or vegetable is fine)", "salt and black pepper ", "2 tsp softened butter ", "2 tsp plain flour ", "900g/2lb potatoes, peeled and chopped into equally sized cubes", "50g/1¾oz butter ", "100ml/3½fl oz milk ", "300g/10½oz frozen peas"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the sausages into a roasting tin and place in the preheated oven. Cook for 10 minutes then turn the sausages and cook for a further five minutes, or until they have a good colour on the outside. ", "Add the sliced onions to the tin. Mix the dried herbs, mustard and stock together and pour over the sausages and onions. Return the tin to the oven for a further 20 minutes, or until the sausages are cooked through and the onion gravy thickened. Season to taste with salt and pepper.", "For the mash, boil the potatoes in a pan of boiling water until tender. Drain and mash. ", "Heat the butter and milk until the butter has melted. Add a pinch of salt and pepper then pour over the mashed potato and mix until smooth. Set aside until ready to serve.", "Cook the peas in a saucepan of boiling water for 2-3 minutes, or steam them for 1-2 minutes.  Drain thoroughly and set aside. ", "For the sausages and onion gravy, mix the softened butter and plain flour together to form a paste. Remove the sausages from the baking tray, set aside and cover to keep warm. Place the baking tray onto the hob, add the flour and butter mix and whisk until combined. Stir over a medium-high heat for 2-3 minutes, or until the gravy has thickened slightly. Add the sausages back to the tray and warm through for 1-2 minutes.", "Serve the sausages, mash and peas with the onion gravy spooned over."]}, {"isVegetarian": false, "title": "Bangers with herby mash and onion gravy", "url": "www_bbc_co_uk_food_recipes_bangerswithgreenmash_2962", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bangerswithgreenmash_2962_16x9.jpg", "ingredients": ["900g/2lb floury potatoes, peeled and cubed ", "1 tbsp sunflower oil ", "1 large onion, finely chopped ", "1 tsp Dijon mustard ", "½pint chicken stock (from a stock cube) ", "1 tsp gravy browning (optional) ", "8 pork sausages ", "50g/1½oz unsalted butter ", "50ml/2fl oz double cream or milk ", "1 tbsp each, fresh parsley and chives ", "3 spring onions, finely chopped ", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in boiling salted water for 10-12 minutes or until soft. ", "Heat the sunflower oil in a heavy-based saucepan. Add the onion and cook until soft , but not coloured. Stir in the mustard then pour in the stock. Bring the mixture to the boil, then add the gravy browning. Reduce for 10 minutes or until the liquid is reduced by half. ", "Heat up a frying pan, add a little sunflower oil and fry the sausages for 6-8 minutes or until cooked through. ", "Drain the potatoes and mash with the butter and the cream. Blend the blanched herbs with the olive oil to form a paste and then stir into the mashed potato. ", "Pile the mash onto four warmed serving plates. Place two sausages in the centre of each mound of mash and finally drizzle over the gravy. ", "Serve immediately. "]}, {"isVegetarian": false, "title": "Bangladeshi venison curry", "url": "www_bbc_co_uk_food_recipes_bangladeshi_venison_74580", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bay leaf", "10 black peppercorns", "5cm/2in piece of cinnamon stick", "6 green cardamom pods", "4 cloves", "¼ tsp grated nutmeg", "1 blade of mace", "2 garlic cloves, peeled", "1 tbsp vegetable oil", "2 tbsp vegetable oil", "3 onions, finely sliced", "1 tbsp ginger-garlic paste (pound equal quantities of garlic and ginger with a little water)", "salt, to taste", "1 tsp red chilli powder", "1 tsp ground cumin", "1 tsp ground coriander", "1 tsp medium curry powder", "3 plum tomatoes, roughly chopped", "2 tbsp finely chopped fresh coriander", "2 tbsp vegetable oil", "500g/1lb 2oz venison fillet", "4 tbsp coriander cress, to garnish", "steamed basmati rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the garam masala paste, blend or pound the ingredients for the garam masala with 50ml/2fl oz water to make a paste.", "For the Bangladeshi venison curry, heat the oil in a large saucepan and fry the onions gently until lightly coloured. Add the ginger-garlic paste and cook for 2-3 minutes to cook out the raw flavours, then add the garam masala paste and salt to taste. Cook, stirring, for a further 3-4 minutes or until fragrant.", "Add the ground spices, tomatoes and stir to mix. Pour in about 750ml/1¼ pints of water. Bring to the boil, then cook on a low heat until the sauce has thickened. Add the chopped coriander a few minutes from the end of the cooking time.", "For the venison, preheat the oven to 240C/450F/Gas8. Heat a medium frying pan and add the oil, place the venison fillet in the pan and cook for a couple of minutes on each side then place in oven for eight minutes. Remove from the oven and leave to rest for 10 minutes before serving.", "Serve the sauce on plates, and cut the venison into batons and arrange the venison pieces on top of the sauce and garnish with coriander cress. Serve with steamed basmati rice."]}, {"isVegetarian": false, "title": "Banh xeo (crispy pancake)", "url": "www_bbc_co_uk_food_recipes_banh_xeo_crispy_pancake_58695", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp caster sugar", "4 tbsp fish sauce", "1 lime, juice only", "3 garlic cloves", "1 bird’s-eye chilli ", "1 carrot, julienned", "220g/8oz rice flour", "2 tbsp cornflour", "1 tsp turmeric", "1 x 400ml tin coconut milk", "2 tbsp peanut oil", "4 banana shallots, halved and cut into thin wedges", "4 garlic cloves, finely chopped", "300g/10½oz pork loin, thinly sliced", "12 king prawns, peeled, halved", "130g/4½oz beansprouts", "1 Cos lettuce, washed and leaves separated", "1 cucumber, cut into thin batons", "bunch fresh mint", "bunch fresh coriander", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the dipping sauce, pour 120ml/4fl oz water into a bowl. Add the sugar and whisk until dissolved.  Stir in the fish sauce and lime juice.", "Using a pestle and mortar, bash the garlic and chilli together until well combined.  Mix into the fish sauce and add the julienned carrot. Set aside.", "For the banh xeo, mix the rice flour, cornflour and turmeric together. Season with a pinch of salt and pepper. Stir in the coconut milk and 310ml/10½fl oz water to make a thin batter. Set aside.", "Heat a little peanut oil in a lidded non-stick frying pan set over a high heat. When hot, add shallot and garlic, and cook until fragrant, but not coloured. Add the sliced pork and fry for a few minutes, until cooked through. Add the prawns and fry until cooked through. Transfer to a bowl.", "Add a ladleful of the batter and about an eighth of the filling mixture. Cover the pan with the lid. Cook until golden-brown and crisp on the under-side. Put some beansprouts on one half of the pancake. Replace the lid and cook for another minute. Remove from the heat and fold the pancake in half. Repeat with the remaining batter and filling to make eight pancakes.", "To serve, divide the lettuce leaves between serving plates. Top each leaf with some cucumber, mint and coriander. Finely slice the pancakes and divide between the lettuce leaves. Serve with the dipping sauce in a bowl."]}, {"isVegetarian": true, "title": "Bannock", "url": "www_bbc_co_uk_food_recipes_bannock_75424", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bannock_75424_16x9.jpg", "ingredients": ["1 x 7g sachet fast-action yeast", "1 tsp caster sugar", "500g/1lb 2oz strong white flour", "125g/4½oz unsalted butter, melted ", "250g/9oz dried mixed fruit", "50g/2oz light muscovado sugar", "beaten egg, for glazing"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the yeast, caster sugar and 250ml/9fl oz lukewarm water in a large bowl.  Leave to stand for 10 minutes until the mixture is frothy.", "Add the flour and butter and mix thoroughly.  Tip onto a lightly floured surface and knead for about five minutes to form a smooth elastic dough.   ", "Place the dough into a clean, lightly oiled bowl and cover with a damp tea towel.  Leave to prove in a warm place for about one hour or until doubled in size.", "When the dough has risen, remove the tea towel and punch the dough down.  Tip onto a lightly floured surface and knead in the fruit and muscovado sugar until well combined. ", "Shape the dough into a round shape and place on a lightly greased baking sheet. Cover again with a damp tea towel and leave to rise in a warm place again for 30 minutes or until it has doubled in size.", "Preheat the oven to 180C/350F/Gas 4.", "Brush the bannock with a little beaten egg to glaze. Bake for 45-50 minutes until risen and a rich brown colour. If the bread is getting too dark, cover lightly with parchment paper or foil. When the bread is ready it should sound hollow when the underneath is tapped gently. ", "Leave to cool slightly before slicing and serving warm with plenty of butter."]}, {"isVegetarian": false, "title": "Banoffee cheesecake with ginger crumb, caramelised bananas and banana tarte tatin", "url": "www_bbc_co_uk_food_recipes_banoffee_cheesecake_with_11022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz ginger cake", "300g/10½oz cream cheese", "50g/1¾oz crème fraîche", "50ml/2fl oz double cream", "4 tbsp icing sugar", "1 tbsp maple syrup", "225g/8oz tinned caramel or dulce de leche", "4 sprigs fresh mint, to decorate", "200g/7oz caster sugar", "2 large bananas, peeled and cut into chunks", "iced water, in a bowl", "250g/9oz plain flour, plus extra for dusting", "½ tsp salt", "275g/9¾oz cold butter, cut into small cubes", "125ml/4fl oz iced water", "115g/4oz caster sugar", "2-3 small bananas, peeled and sliced"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the banoffee cheesecake, put the ginger cake in a food processor and whizz to crumbs. Set aside.", "Put the cream cheese, crème fraîche, double cream, icing sugar and maple syrup in a large bowl and mix. Gently stir in the tinned caramel to create a ripple effect. Refrigerate until ready to serve.", "For the caramelised bananas, cook the 200g/7oz caster sugar in a large frying pan over a low-medium heat without stirring until it has melted. Increase the heat until the caramel turns a light golden-brown. Remove from the heat, add the bananas and, using two spoons, carefully coat them in the caramel. (CAUTION: boiling sugar is extremely hot. Handle very carefully.) Put the bananas in the bowl of iced water to set.", "For the banana tarte tatin, put the flour in a mound on a clean work surface and make a well in the centre. Add the salt and 250g/9oz of the butter to the well. Work the flour into the butter using the fingertips of one hand, gradually drawing the flour into the centre with the other hand. When the cubes of butter have become small pieces and the dough is grainy, gradually work in the water until it is all incorporated. Don’t overwork the dough – you should have a marbled effect with the butter. Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes. ", "Lightly flour a clean work surface and roll out the pastry to a 40x20cm/16x8in rectangle. Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn. Roll the pastry into a 40x20cm/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes.", "Give the pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap it in cling film and refrigerate for at least 30 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 6. Divide the 115g/4oz caster sugar evenly between two very small ovenproof frying pans (alternatively use one large frying pan). Cook over a low heat without stirring until the sugar has melted. Increase the heat until the caramel turns a light golden-brown. Remove from the heat, put half the remaining butter in each pan and stir gently. Carefully arrange the sliced bananas in each pan.", "On a lightly floured work surface, roll out the pastry to the thickness of a pound coin. Cut out two circles slightly larger than the circumference of the small frying pans (or one circle if using a single larger pan). Any leftover pastry can be frozen and used in other dishes. Cover each pan with a pastry round, pushing the edges down around the bananas. Bake for 10-12 minutes, or until the pastry is golden-brown and cooked through. Remove from the oven and set aside to cool slightly.", "To serve, invert a plate over the frying pans and turn out the tarts. Put a pile of ginger cake crumbs on each plate and a quenelle of the cream cheese mixture on top. Place a few chunks of caramelised banana next to it. Garnish with fresh mint."]}, {"isVegetarian": true, "title": "Banoffee pie", "url": "www_bbc_co_uk_food_recipes_banoffee_pie_90466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour ", "75g/3½oz chilled butter, cubed", "100g/3½oz butter", "100g/3½oz light muscovado sugar", "2 x 397g/14oz cans condensed milk", "300ml/10fl oz double cream", "1 large banana", "a little lemon juice", "a little grated Belgian milk or plain chocolate, for sprinkling"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the shortcrust pastry, put the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add 2-3 tablespoons of cold water gradually, mixing to form a soft dough. ", "Roll out the dough on a lightly floured work surface and use it to line a 20cm/8in flan tin. Cover in cling film and place in the fridge to chill for 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6.", "Line the pastry case with foil and fill with baking beans. Bake blind in the oven for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.  Remove from the oven.", "For the toffee filling, put the butter and sugar in a large non-stick pan. Heat gently until the butter has melted and the sugar has dissolved, then add the condensed milk. Stir continuously and evenly with a flat-ended wooden spoon for about five minutes, or until the mixture is thick and has turned a golden toffee colour – take care, as it burns easily. Turn the filling into the cooked pastry case and leave to cool and set.", "For the topping, whip the double cream in a large bowl until it just holds its shape and spread evenly over the cold toffee mixture. Peel and slice the banana and dip it into a little lemon juice to prevent discolouring.", "Pile the banana slices on top of the cream and sprinkle the whole pie with grated chocolate. Remove the ring of the flan and transfer to a flat plate. Serve well chilled. "]}, {"isVegetarian": false, "title": "Banoffee pie with marshmallows and caramelised bananas", "url": "www_bbc_co_uk_food_recipes_banoffee_pie_with_78481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "75g/2¾oz cold unsalted butter, diced", "2-3 tbsp ice cold water", "150g/5½oz salted butter, diced", "150g/5½oz light soft brown sugar", "300g tin condensed milk", "400ml/14fl oz double cream, whipped", "2 small bananas, sliced", "100g/3½oz dark chocolate, grated", "vegetable oil, for greasing", "5-6 tbsp icing sugar, sieved, for dusting", "5-6 tbsp cornflour, sieved, for dusting", "9 sheets leaf gelatine  ", "450g/1lb granulated sugar  ", "1 tbsp liquid glucose  ", "2 large free-range egg whites  ", "1 tsp vanilla extract  ", "100g//3½oz caster sugar", "1 bunch baby bananas", "vanilla ice cream", "fresh mint, chopped"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the banoffee pie, put the flour in a bowl and rub in the unsalted butter with your fingertips until the mixture resembles fine breadcrumbs. Add the cold water gradually, mixing to form a soft dough. Roll out the dough on a lightly floured work surface and use it to line a 20cm/8in fluted flan tin. Put in the fridge to chill for 30 minutes. ", "Line the pastry case with baking paper and fill with baking beans or rice. Blind bake for 15 minutes, then remove the beans and baking paper and cook for a further 5 minutes to dry out the base. Remove from the oven and leave to cool.", "Meanwhile, put the butter and sugar in a large saucepan and melt over a medium heat. Once melted add the condensed milk and mix. Pour into the cooled pastry case. Leave to set and cool.", "Lay the sliced bananas on top of the caramel sauce, top with the whipped cream and garnish with the grated chocolate.", "To make the marshmallows, lightly oil a shallow baking tray, about 30x20cm/12x8in and dust it with icing sugar and cornflour. ", "Soak the gelatine sheets in 140ml/4½fl oz cold water. ", "Put the sugar, glucose and 200ml/7fl oz water into a heavy-based pan. Bring to the boil and continue cooking for about 12-15 minutes until the mixture reaches 127C on a sugar thermometer. When the syrup is up to temperature, carefully slide in the softened gelatine sheets and their soaking water. The syrup will bubble up so take care not to burn yourself. Pour the syrup into a metal jug. ", "Whisk the egg whites until stiff, preferably with an electric whisk in a mixing bowl. Continue whisking while pouring in the hot syrup from the jug. The mixture will become shiny and start to thicken. Add the vanilla extract and continue whisking for about 5-10 minutes, until the mixture is stiff and thick enough to hold its shape on the whisk. ", "Spoon the mixture into the prepared tin and smooth with a wet palette knife if necessary. Leave for at least 1 hour to set. ", "Dust a work surface with icing sugar and cornflour. Loosen the marshmallow around the sides of the tray with a palette knife, and turn it out on to the dusted surface. Cut into squares and roll in the icing sugar and cornflour. Leave to dry a little on a wire rack.", "For the caramelised bananas, heat a large frying pan and add the sugar, leave on the heat until it turns to caramel (CAUTION: boiling sugar is extremely hot. Handle very carefully.) Once turned to a caramel carefully add 4 tablespoons water to create a little sauce. Add the chopped baby bananas to the sauce and stir to coat. ", "To serve, put a slice of the banoffee pie in the centre. Garnish with a scoop of ice cream, squares of marshmallows, some caramelised bananas and sprinkle over the mint."]}, {"isVegetarian": true, "title": "Banoffee cheesecake with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_banoffeecheesecakewi_85024", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banoffeecheesecakewi_85024_16x9.jpg", "ingredients": ["150g/6oz chocolate oat biscuits, crushed", "75g/3oz butter", "2 tbsp clear honey ", "4 bananas, peeled and cut into chunks", "400g/14oz cream cheese", "4 tbsp icing sugar", "1 tbsp maple syrup", "1 x 225g/8oz dulce de leche or canned caramel", "40g/1½oz butter", "175ml/7fl oz double cream", "225g/8oz milk chocolate, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheesecake, place the crushed chocolate biscuits into a bowl. Add a third of the butter and all the honey to the crushed biscuits and mix everything together well with a wooden spoon.", "Spoon the biscuit crumb mixture into a 23cm/9in springform cake tin and flatten with the back of a spoon.", "Heat a frying pan until hot then add the remaining butter and the bananas and fry for 2-3 minutes, until golden-brown.", "Remove the bananas from the pan and leave to one side to cool.  Arrange the bananas on top of the biscuit base, reserving a few to serve.", "Place the cream cheese and icing sugar into a bowl and whisk until smooth. Stir in the maple syrup and the dulce de leche or caramel.", "Spoon the sweet cream cheese mixture into the cake tin on top of the bananas.", "Place in the fridge and leave to set for at least 30 minutes, preferably overnight.", "Meanwhile, for the chocolate sauce, place the butter and cream into a saucepan and bring to a simmer over a medium heat.", "Add the chopped chocolate and stir to combine.", "Turn the heat to low and keep the buttery chocolate on the hob until the chocolate has melted and the mixture is smooth and glossy.", "To serve, remove the cheesecake from the fridge, remove the tin and place onto a serving plate. Top with the reserved fried bananas and a spoonful of chocolate sauce."]}, {"isVegetarian": true, "title": "Banoffee pie", "url": "www_bbc_co_uk_food_recipes_banoffeepiewithpecan_86926", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banoffeepiewithpecan_86926_16x9.jpg", "ingredients": ["150g/5½ oz digestive biscuits (about 10)", "75g/2¾oz butter", "75g/2¾oz butter", "75g/2¾oz light muscovado sugar", "1 x 397g/14oz full-fat condensed milk (see tip)", "1 tsp vanilla extract", "300ml/10fl oz double cream", "3 small just-ripe bananas, sliced", "50g/1¾oz dark chocolate, melted or cocoa powder"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Line the base of a deep 20cm/8in spring form tin with baking paper.", "To make the base, crush the biscuits to fine crumbs and melt the butter over a low heat. Pour into a bowl and mix to combine. Spoon into the base of the tin and press down with the back of a spoon until level. Place in the fridge for 15 minutes.", "To make the filling, heat the butter and sugar in a small non-stick saucepan and stir over a low heat until combined. Add the condensed milk and bring to the boil, stirring for 2–3 minutes – do not over-boil or it will become grainy and fudge-like. Add the vanilla and pour into the tin. Place in the fridge for at least 1 hour. ", "Whip the cream in a bowl until soft peaks form. ", "Arrange the banana slices in neat rounds on top of the toffee. Spoon or pipe the cream on top and level. Set in the fridge for an hour.", "Remove from the tin, and zig zag the melted chocolate over the top or dust with cocoa powder."]}, {"isVegetarian": true, "title": "Easy banoffee pie", "url": "www_bbc_co_uk_food_recipes_banoffeepie_89031", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz digestive biscuits", "100g/4oz butter, melted, plus extra for greasing", "400g/14oz dulce de leche (sometimes sold as caramel)", "2 bananas, peeled and sliced", "300ml/½ pint whipping cream, whipped until soft peaks form", "2 tbsp grated dark chocolate"], "serves": "4-6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Place the biscuits into a food processor and pulse until the mixture resembles fine breadcrumbs. Transfer to a mixing bowl and stir in the melted butter, mixing well to combine. ", "Place the mixture into a lightly greased 20cm/8in loose-bottomed cake tin and press down into the base and up along the sides. Place in the fridge to chill for 30 minutes. ", "Spoon the dulce de leche over the biscuit base, and then cover with a layer of sliced bananas. Spoon the whipped cream on top and decorate with grated chocolate. ", "Slice into wedges and serve."]}, {"isVegetarian": true, "title": "Bara brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_24607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb strong white flour", "7g salt ", "20g/¾oz fresh yeast", "75g/2½oz butter, plus extra for greasing and to serve", "50g/1¾oz brown sugar", "2 tsp mixed spice ", "350g/12oz mixed dried fruit, such as raisins, currants, sultanas and cranberries", "1 free-range egg ", "225ml/8fl oz strong warm tea", "oil, for greasing", "butter, to serve (optional)", "50g/1¾oz caster sugar"], "serves": "Serves 8-10", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour, salt and yeast in a large mixing bowl and then rub in the butter using your fingers until the mixture resembles fine breadcrumbs.  Mix in the sugar, mixed spice and dried fruit until evenly distributed.  ", "Add the egg and tea and bring the mixture together to form a dough.  Knead on a clean work surface until smooth. Place back in the bowl, cover with oiled cling film and leave until doubled in size - at least one hour.", "Preheat the oven to 200C/180C fan/400F/Gas 6 and grease a 900g/2lb loaf tin.", "Knock back the dough, then shape it and fit it into the loaf tin. Cover again with oiled cling film and prove for a further 30 minutes. Remove the cling film and bake in the centre of the oven for 20 minutes.  ", "Cover the bara brith with aluminium foil and continue to bake for a further 25 minutes.  Remove from the oven, turn it out of the tin and leave to cool on a wire rack for 20 minutes.  ", "For the sugar syrup, bring 50ml/1¾fl oz of water and the sugar to the boil in a small saucepan and cook until syrupy. Remove from the heat and brush the loaf with the glaze. Leave to cool completely before cutting. Serve in slices with butter, if you like"]}, {"isVegetarian": true, "title": "Bara brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_33441", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bara_brith_33441_16x9.jpg", "ingredients": ["450g/1lb dried mixed fruit", "250g/9oz brown sugar", "300ml/½ pint warm black tea", "2 tsp mixed spice", "450g/1lb self-raising flour", "1 free-range egg, beaten"], "serves": "Makes 1 cake", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["In a large bowl soak the fruit and sugar in strained tea and leave overnight.", "Next day preheat the oven to 170C/325F/Gas 3. Line a 900g/2lb loaf tin with baking parchment.", "Mix the remaining ingredients into the fruit mixture and beat well.", "Pour the mixture into the loaf tin and bake the oven and bake for 1½ hours or until a skewer inserted into the middle comes out clean."]}, {"isVegetarian": true, "title": "Bara brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_40487", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bara_brith_40487_16x9.jpg", "ingredients": ["375g/13oz dried mixed fruit", "1 medium orange, zest and juice ", "1 heaped tsp ground mixed spice", "25g/1oz clear honey", "225ml/8fl oz Earl Grey tea, hot", "unsalted butter, for greasing", "1 medium free-range egg, beaten", "1 large eating apple (approximately 200g/7oz), cored, grated ", "175g/6oz wholemeal self-raising flour, sifted", "200g/7oz white self-raising flour, sifted"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the dried fruit, orange zest, mixed spice and honey into a large mixing bowl. Pour over the hot tea and stir to combine. Cover the bowl with cling film and leave to soak for 4-5 hours, or overnight.", "Preheat the oven to 160C/325F/Gas 3. Lightly grease a 900g/2lb loaf tin with butter and line with baking paper.  ", "Mix in the orange juice, beaten egg and the grated apple with the soaked fruit. Fold in the sifted flour until completely combined.", "Spoon the mixture into the lined loaf tin and place into the oven on the middle shelf for 45 minutes.", "Remove from the oven and cover the cake tightly with a double layer of foil to prevent the top from browning too much. Continue to bake for a further 1½ hours, or until a skewer inserted into the centre of the cake comes out clean. ", "Remove from the tin and transfer to a wire rack. Cover with a tea towel and set aside to cool completely. "]}, {"isVegetarian": true, "title": "Bara brith sheep biscuits", "url": "www_bbc_co_uk_food_recipes_bara_brith_sheep_54510", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bara_brith_sheep_54510_16x9.jpg", "ingredients": ["10 tea bags", "splash orange liqueur", "6 tbsp mixed dried fruit ", "1 orange, finely grated zest only", "½ lemon, finely grated zest only", "500g/1lb 2oz self-raising flour, plus extra for dusting", "125g/4½ oz caster sugar", "½ tsp mixed spice", "½ tsp dried ginger", "½ tsp cinnamon", "½ tsp salt", "350g/12oz unsalted butter, cubed", "1-2 tbsp buttermilk, to loosen", "700g/1lb 9oz icing sugar", "pearlescent white food colour ", "1½ tsp almond extract", "black food colour paste", "metallic light silver food colour paste"], "serves": "Makes 24 large biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. Line a large baking tray with baking parchment.", "Put the teabags in a bowl, cover with boiling water and brew for 5 minutes, until very strong. Remove the teabags and add a splash of orange liqueur. Soak the mixed fruit in the tea for 10-15 minutes, then drain well and set aside. ", "When cool, chop the dried fruit very finely, add both citrus zests and transfer to a pestle and mortar. Grind the mixture to a paste. ", "Put the flour, sugar, spices and salt in a large bowl. Rub in the butter using your fingertips. Add 3 teaspoons of the ingredients from the pestle and mortar. Mix and combine with your fingertips until the mixture resembles fine breadcrumbs. Add just enough buttermilk to bring the mixture together as a dough.", "Roll out on lightly floured work surface until the dough is about ½cm/¼ in thick. Cut out shapes using a sheep shaped biscuit cutter and transfer to the prepared tray. Prick all over with a fork and bake for 10-12 minutes or until pale golden-brown. Leave to cool slightly, then transfer to a wire rack to cool completely.", "For the icing, sift two-thirds of the icing sugar into a bowl and mix in enough water to make a thick but pourable icing. Stir in a little pearlescent food colour. Spoon into a squeezy bottle and cover the bodies of the sheep evenly to make the fleeces. Set aside in a cool place to allow the icing to set.", "Sift remaining icing sugar and mix with the almond extract and enough water to make a thick icing. Transfer half the icing to a separate bowl. Add the black food colour to one and the silver to the other. Put into two disposable piping bags with small plain nozzles attached. Use the black icing to decorate the heads and legs of the sheep and the silver to pipe swirls on their fleeces. Allow the icing to set, then serve."]}]