[{"isVegetarian": false, "title": "Grilled cardamom and horseradish mackerel with autumn salad", "url": "www_bbc_co_uk_food_recipes_grilledcardamomandho_89899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large mackerel fillets", "8 cardamom pods, seeds only, crushed", "3cm/1in piece fresh horseradish, grated", "salt and freshly ground black pepper ", "1kg/2lb 2oz new potatoes, washed", "300g/11oz cauliflower, cut into florets", "300g/11oz green beans, trimmed", "3 tbsp extra virgin olive oil", "12 salted anchovy fillets, rinsed and drained", "20g/¾oz salted capers, soaked in water for 2 hours", "1 garlic clove, finely sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the mackerel fillets flesh-side up onto a grill tray. Sprinkle with crushed cardamom seeds and the grated horseradish and season lightly with salt and freshly ground black pepper.", "Place under the grill for 3-4 minutes, then turn and cook the other side for 30 seconds, or until the fish is just cooked through.", "For the salad, place the potatoes into a pan of water, bring to the boil and simmer until tender. Drain and leave until cool enough to handle, then peel off the skins.", "Meanwhile, bring a large pan of salted water to the boil. Add the cauliflower and cook for three minutes.", "Add the beans and cook the cauliflower and beans for three minutes, or until just tender. Drain and set aside.", "Heat a frying pan until hot, add the olive oil, anchovy fillets, capers and garlic and fry for one minute.", "Add the potatoes, cauliflower and green beans and mix together well.", "To serve, place equal portions of the salad into the centre of each dish. Top each with two mackerel fillets and drizzle over any pan juices from the salad."]}, {"isVegetarian": false, "title": "Grilled feta chicken with roast cherry tomatoes and roast potatoes", "url": "www_bbc_co_uk_food_recipes_grilledchickentopped_86839", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "dash olive oil", "salt and freshly ground black pepper", "85g/3oz feta cheese, crumbled ", "1 sprig fresh thyme, chopped", "1 slice ciabatta, toasted", "85g/3oz cherry tomatoes on the vine", "dash olive oil", "dash balsamic vinegar", "2 new potatoes, halved", "dash olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, heat a griddle pan. Rub olive oil onto the chicken breast, season with salt and freshly ground black pepper, to taste, and then place in the griddle pan skin-side-down for 4-5 minutes, or until golden. Turn over, top with the feta cheese and thyme and season, to taste, with salt and freshly ground black pepper. Place on a baking tray, transfer to the oven and bake for eight minutes, or until the chicken is cooked through. Place the chicken breast on a slice of toasted ciabatta.", "For the roasted cherry tomatoes, place the tomatoes on a baking sheet, drizzle over the olive oil and roast for ten minutes. Add the balsamic vinegar and roast for a further 2-3 minutes.", "For the roast potatoes, boil the potatoes in boiling salted water for ten minutes, or until softened, and drain. Heat a little olive oil in a frying pan and fry until golden.", "To serve, place the chicken onto a serving plate, top with the roasted cherry tomatoes and serve the roasted potatoes on the side."]}, {"isVegetarian": false, "title": "Grilled chicken with charred broccoli", "url": "www_bbc_co_uk_food_recipes_grilledchickenwithch_86875", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast, skinless", "2 tbsp olive oil", "1 tbsp chopped chervil ", "salt and freshly ground black pepper", "100g/3½oz purple sprouting broccoli", "½ lemon, juice only", "sprig fresh dill, to garnish"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Using a meat tenderiser or the base of a heavy saucepan, put the chicken breast on a chopping board and flatten out to 1cm/½in thickness.", "Place the chicken in a small glass bowl with one tablespoon of the olive oil and the chervil. Season with salt and freshly ground black pepper.", "Bring a pot of salted water to the boil, add the broccoli and cook for one minute.  Drain and immediately rinse under cold water.  When it has cooled, drain again and dry off with kitchen towel.  ", "Heat a griddle pan until hot. Place the chicken on the pan and cook for 3-4 minutes on each side, or until cooked through.", "Toss the broccoli in the remaining one tablespoon of olive oil and place in the hot griddle pan. Cook for 1-2 minutes, or until tender.", "To serve, arrange the broccoli on a plate and top with the chicken. Squeeze over the lemon juice and garnish with dill."]}, {"isVegetarian": false, "title": "Grilled chicken with crispy pancetta, white asparagus and brown butter", "url": "www_bbc_co_uk_food_recipes_grilledchickenwithcr_74661", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken supremes (breasts with the small bone still attached), skin on", "2 tbsp olive oil", "75g/2½oz pancetta ", "8 spears of white asparagus", "120g/4¼oz chestnut mushrooms, quartered", "60g/3oz unsalted butter", "½ a lemon, juice only", "1 small bunch of Italian parsley, chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Season the chicken supremes with salt and freshly ground black pepper and brush with a little of the olive oil. ", "Heat a frying pan over a medium heat and add the chicken. Fry for about two minutes on each side, or until golden.", "Transfer the chicken to a baking tray (keep the pan to one side for use later in the recipe) and cook in the oven for 20-25 minutes, or until cooked through. ", "At the same time, place the pancetta on a separate baking tray and cook in the oven for about 15 minutes, or until crispy. Remove and set aside on kitchen paper.", "Meanwhile, trim the woody ends off the asparagus. Bring a large pan of salted boiling water to the boil and blanch the asparagus. Drain the asparagus then refresh in cold water and set aside.", "Heat the remaining olive oil in the pan you used to cook the chicken and add the mushrooms. Cook for 4-5 minutes until just softened. Turn up the heat and add the blanched asparagus and the butter and allow to brown.", "Add the lemon juice and parsley.", "To serve, divide the asparagus and mushrooms between two warm plates. Top each with a chicken supreme, drizzle over any juices left in the pan and garnish with the crispy pancetta."]}, {"isVegetarian": false, "title": "Chicken with spiced carrot purée, green bean salad and orange, cardamom and vanilla dressing", "url": "www_bbc_co_uk_food_recipes_grilledchickenwithsp_88187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "1 chicken breast, skin scored", "salt and freshly ground black pepper", "1 tbsp red wine vinegar", "½ carrot, grated", "pinch ground cinnamon", "pinch ground ginger", "1 tsp caster sugar", "salt and freshly ground black pepper ", "85g/3oz green beans", "2 tbsp olive oil", "15g/½oz fresh root ginger, finely chopped", "1 garlic clove, finely chopped", "salt and freshly ground black pepper", "2 oranges, juice only", "2 cardamom pods, crushed", "1 vanilla pod, split", "1-2 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat the olive oil in a frying pan, season the chicken with salt and freshly ground black pepper and fry for five minutes on each side, or until completely cooked through. Remove from the heat and then slice thickly.", "For the spiced carrot purée, place the red wine vinegar, grated carrot, cinnamon, ginger, sugar, salt and freshly ground freshly ground black pepper into a small pan and simmer for 3-4 minutes, or until the carrot has softened. Spoon into a mini blender and process until smooth.", "For the green bean salad, drop the green beans into a pan of boiling salted water and boil for four minutes, or until tender. Drain, top and tail and then split in half lengthways. Heat the olive oil in a small pan, add the ginger and garlic and remove from the heat. Stir the beans in the hot oil and set aside.", "For the dressing, squeeze the orange juice into a small pan, add the cardamom pods and split vanilla pod and place over a medium heat for ten minutes, or until reduced. Strain through a sieve and stir in the olive oil.", "To serve, pile the dressed beans onto a serving plate and top with the chicken. Spoon the carrot purée on the side and pour over the dressing."]}, {"isVegetarian": false, "title": "Grilled corn-on-the-cob with spring onions and crab gratin", "url": "www_bbc_co_uk_food_recipes_grilledcornonthecobw_88760", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sweetcorn cob, cut into four pieces", "olive oil", "salt and freshly ground black pepper ", "4 spring onions", "50ml/2fl oz white wine", "2 free-range egg yolks", "150ml/5½fl oz double cream", "pinch cayenne pepper", "55g/2oz white crabmeat"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the grilled corn-on-the-cob, drizzle the corn cob pieces in olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until hot and griddle the corn for 4-5 minutes. Add the spring onions and griddle until chargrilled on all sides. Remove from the pan and place into a small gratin dish.", "For the gratin, place the white wine, egg yolks and cream into a bowl set over a pan of gently simmering water and whisk constantly until the mixture begins to thicken.", "Remove from the heat and pour the sauce over the chargrilled vegetables in the dish. Sprinkle over the cayenne pepper and crabmeat, then glaze the top with a mini-blowtorch until golden-brown and bubbling. Serve immediately."]}, {"isVegetarian": true, "title": "Baked plums with mascarpone", "url": "www_bbc_co_uk_food_recipes_grilledfruitwithmasc_72274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledfruitwithmasc_72274_16x9.jpg", "ingredients": ["6 ripe plums", "2 meringue nests", "250g tub mascarpone cheese", "4 tbsp caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 200C/180C Fan/Gas 6.", "Halve and stone the plums and put them, hollow side up, in a heatproof dish.", "Break up the meringues and sprinkle them over the top, making sure lots fall into the hollows of the fruit.", "Place dollops of mascarpone cheese on top of the meringues and fruit.", "Sprinkle with the sugar and place the dish in the oven.", "Cook for 20 minutes, removing from the oven when the fruit is tender with a crisp crust.", "Serve warm."]}, {"isVegetarian": false, "title": "Gammon with double egg and oven chips", "url": "www_bbc_co_uk_food_recipes_grilledgammonwithdou_87779", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp oil", "1 potato", "1 large tomato", "150g/5½oz gammon steak", "salt and freshly ground black pepper ", "2 free-range eggs"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut the potato into chips and drizzle with two tablespoons of oil. Place on a baking sheet. Cut the tomato in half and sit it on the side of the baking sheet. Bake for 30-40 minutes, or until the chips are golden-brown and crisp and the tomato is softened.", "Heat one tablespoon of the oil in a frying pan. Season the gammon with salt and freshly ground black pepper and fry on both sides for 5-6 minutes, or until completely cooked through. Set aside to rest in a warm place.", "Heat the remaining oil in a frying pan and fry the eggs until the yolk is just set.", "To serve, place the gammon onto a plate with the chips and tomato. Top with the eggs."]}, {"isVegetarian": false, "title": "Grilled haggis 'koftas' with yoghurt, mint and lime dressing", "url": "www_bbc_co_uk_food_recipes_grilledhaggiskoftasw_88669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ cooked haggis, chopped", "1 tsp ground ginger", "1 tsp chilli powder", "1 tsp ground turmeric", "1 tsp ground coriander", "1 free-range egg", "1 tbsp plain flour", "salt and freshly ground black pepper", "1 tbsp olive oil", "4 tbsp plain yoghurt", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh mint", "1 lime, zest and juice", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the haggis koftas, place all the ingredients, except the olive oil, in a food processor and pulse until combined. ", "Soak four wooden skewers in a bowl of water for about 20 minutes to prevent them from burning. ", "Shape the haggis mixture around the skewers and rub with the oil. Heat a griddle pan until hot and cook the koftas until browned on all sides and cooked through, about 5-7 minutes.", "For the dressing, place all the dressing ingredients into a bowl and mix well.", "Serve the koftas on a plate with the dressing in a bowl on the side."]}, {"isVegetarian": false, "title": "Grilled lamb chop with curried parsnip batons, parsnip crisps and thyme oil", "url": "www_bbc_co_uk_food_recipes_grilledlambchopwithc_88756", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lamb chop", "dash olive oil", "salt and freshly ground black pepper ", "1 parsnip, peeled, cut into batons", "25g/1oz butter", "pinch curry powder", "85ml/3fl oz double cream", "splash white wine", "salt and freshly ground black pepper", "4 tbsp vegetable oil", "1 small parsnip, finely sliced into rounds on a mandoline", "salt, for sprinkling", "4 tbsp olive oil", "2 sprigs fresh thyme"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the grilled lamb chop, heat a griddle pan until hot. Brush the lamb with olive oil and season well with salt and freshly ground black pepper. Place the lamb into the hot griddle pan and griddle for 3-4 minutes on each side, or until golden-brown but slightly pink in the middle. Remove from the pan and leave to rest for five minutes, covered with aluminium foil.", "For the curried parsnip batons, place the parsnip batons into a pan of boiling salted water and blanch for 2-3 minutes. Remove with a slotted spoon and dry on kitchen paper.", "Melt the butter in a frying pan, add the blanched parsnips and curry powder and stir to coat in the melted butter. Gently fry for 2-3 minutes.", "Add the cream and wine, season, to taste, with salt and freshly ground black pepper and simmer until the sauce is thickened and the parsnips are tender.", "For the parsnip crisps, heat the oil in a pan, add the parsnip slices and fry until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Sprinkle with salt.", "For the thyme oil, place the oil and thyme into a small saucepan and heat gently for ten minutes. Remove from the heat and leave to infuse. Just before serving, remove the thyme.", "To serve, spoon the curried parsnips onto a serving plate and top with the grilled lamb. Drizzle over the thyme oil and garnish with the parsnip crisps."]}, {"isVegetarian": false, "title": "Grilled lamb cutlets filled with parma ham and herbs", "url": "www_bbc_co_uk_food_recipes_grilledlambcutletsfi_70345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 lamb cutlets", "salt and freshly black ground pepper", "10 fresh sage leaves", "handful fresh rosemary needles", "handful fresh flat-leaf parsley leaves", "handful fresh basil leaves", "1 garlic clove, finely chopped", "6 tbsp freshly grated parmesan cheese", "110g/4oz butter, slightly softened (remove from the fridge about an hour in advance)", "6 slices parma ham"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Place all the herbs on a chopping board and chop very finely together. Place them in a bowl with the garlic, parmesan, butter and some salt and pepper and mix well until you get a smooth paste.", "Arrange the parma ham slices overlapping slightly on a piece of clingfilm and spread the paste evenly over them with a spatula. Then, with the help of the clingfilm, roll up the ham into a sausage shape, and tie the ends so the filling doesn't escape. Place in the fridge for at least half an hour.", "Slice each lamb cutlet horizontally through the centre, leaving it joined at one end, and open it up like a butterfly. With a meat tenderiser, flatten each piece. You can ask your butcher to do this for you if you prefer.", "Remove the filling from the fridge and discard the clingfilm. Cut the filling into 2.5cm/1in slices, pressing slightly so it becomes flat.", "Place on one side of each cutlet and fold the other side over the top. Press together well, making sure that none of the filling escapes. ", "Transfer the cutlets to a baking tray lined with foil and season with salt and freshly ground black pepper. ", "Place under a hot grill and grill for about 2 minutes on each side for rare, 4 minutes for medium or, for well done, as long as you like."]}, {"isVegetarian": false, "title": "Grilled lamb kofta kebabs", "url": "www_bbc_co_uk_food_recipes_grilledlambkoftakeba_92066", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/17½oz strong bread flour, plus extra for dusting", "10g/½oz quick yeast (not dried active yeast)", "5g/¼oz sugar", "5g/¼oz salt", "200ml/7fl oz room temperature water", "olive oil, for brushing", "50g/2oz sugar ", "150ml/5fl oz water", "1in/2cm piece fresh root ginger, peeled and grated", "½ chilli, sliced ", "2 cloves garlic, peeled, finely chopped", "splash rice wine vinegar ", "splash fish sauce", "1 x 410g/14½oz can chickpeas, drained ", "3 tsp tahini paste ", "1 lemon, juice only", "1 garlic clove, peeled, finely chopped ", "3 tbsp olive oil ", "1 small bunch fresh coriander, chopped", "salt, to taste", "500g/17½oz lean minced lamb", "3 tsp paprika", "2 tsp ground coriander ", "2 tsp ground cumin", "1 clove garlic, peeled, chopped", "½ chilli, finely chopped", "pinch cayenne pepper", "salt and freshly ground black pepper, to taste", "1 small bunch spring onions, chopped", "2 tomatoes, chopped", "2-3 jalapeño peppers, finely chopped", "1 cucumber, chopped", "1 large bunch lettuce leaves, torn into pieces", "1 small bunch fresh coriander, chopped"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pitta bread dough, place the strong bread flour, yeast, sugar and salt into a mixing bowl and mix together. ", "Make a well in the centre and add half of the water. Using your hands, bring the mixture together, adding a little bit of water at a time, until the mixture forms a dough (you may not need all of the water). Turn the dough out onto a floured work surface and knead the dough for about ten minutes, or until the dough is smooth and elastic. ", "Dust the dough with some more flour and place it back into the bowl and cover with a damp tea towel. Set aside for one hour in a warm, dry place, or until the dough has risen. (You can also lightly brush the outsides of the dough with olive oil to prevent the dough from drying out too much.)", "Preheat the oven to 200C/400F/Gas 6. Grease a baking sheet with some olive oil.", "Roll the dough out into a very thin layer about 3-5mm thick, and cut out long ovals from the sheet (the dough should yield approximately ten pitta breads). Place the pitta breads onto the oiled baking tray and bake in the oven for 5-6 minutes, or until the pitta bread begin to puff up and turn golden-brown. Remove from the oven and set aside. Cover the pitta breads with a slightly damp clean tea towel to prevent the breads from drying out and becoming brittle.", "For the chilli sauce, place the sugar and water into a non-reactive saucepan and bring to a gentle simmer. Cook for 5-6 minutes, or until the sugar has dissolved and the liquid has reduced to a thick syrup. ", "Add the grated ginger, chilli and garlic to the pan and add a splash of rice wine vinegar and a splash of fish sauce. Stir well and bring to the boil, then reduce the heat and simmer for 4-5 minutes.", "Transfer the chilli sauce mixture into a food processor and blend until smooth, then  cover and chill in the fridge until needed.", "For the coriander hummus, place the chickpeas, tahini paste, garlic and olive oil into a food processor and blend until smooth. Add the chopped fresh coriander and the lemon juice and blend again to combine. ", "Preheat the grill to high. ", "For the lamb kofta kebabs, place all of the kebab ingredients together in a bowl and mix together with your hands until the meat sticks together. ", "With damp hands, take a handful of the kebab mixture and shape into a long sausage shape around a metal skewer. Repeat with the remaining kebab mixture, using a new skewer each time (or fit two kebabs onto each skewer, if space allows).", "Place the skewers under the grill for 10-12 minutes, turning them halfway, until the lamb is golden-brown and cooked through. Slide the kebabs off the skewers and set aside. ", "For the salad, mix all of the salad ingredients together in a large bowl. ", "To serve, place a few pitta breads onto each serving plate along with a few lamb kofta kebabs. Arrange the salad alongside and place the chilli sauce and hummus into small bowls for sharing."]}, {"isVegetarian": false, "title": "Grilled lamb steak on creamed leeks", "url": "www_bbc_co_uk_food_recipes_grilledlambsteakoncr_86143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz lamb steak", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp olive oil", "¼ onion, finely chopped", "1 garlic clove, chopped", "¼ leek, chopped", "1 tbsp white wine", "2 tbsp double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the grilled lamb steak, rub the steak with the olive oil and season with salt and freshly ground black pepper.", "Heat a griddle pan and chargrill the lamb for 4-5 minutes on each side, or until cooked to your liking. Remove from the pan and set aside to rest in a warm place.", "For the creamed leeks, heat the oil in a pan and gently fry the onion until softened but not coloured.", "Add the garlic and cook for one minute.", "Add the leeks and white wine and simmer for 2-3 minutes.", "Add the double cream and simmer for a further 2-3 minutes, until slightly thickened. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the creamed leeks onto a serving plate and top with the grilled lamb steak."]}, {"isVegetarian": false, "title": "Grilled lamb steak with rosemary butter and chargrilled broccoli", "url": "www_bbc_co_uk_food_recipes_grilledlambsteakwith_87206", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz boneless lamb leg steak, trimmed", "1 sprig fresh rosemary, leaves only", "2 garlic cloves, lightly crushed", "2 tbsp olive oil", "salt and freshly ground black pepper", "100g/3½oz Tenderstem broccoli, blanched and drained ", "30g/1oz butter, melted", "2 tbsp chopped fresh parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the lamb steak into a bowl with the rosemary, garlic and oil and stir. Leave to marinate for ten minutes, or longer if possible.", "Heat a griddle pan until very hot. Remove the lamb steak from the marinade and season with salt and freshly ground black pepper. Griddle for two minutes on each side for medium-rare meat, or longer if you like it well done. Remove the lamb from the pan and leave to rest.", "Place the broccoli onto the griddle and cook, turning frequently, until chargrilled.", "To serve, place the broccoli onto a serving plate and top with the lamb steak. Drizzle over the melted butter and sprinkle with parsley."]}, {"isVegetarian": false, "title": "Grilled lamb with aubergine and basil ratatouille", "url": "www_bbc_co_uk_food_recipes_grilledlambwithauber_87005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz lamb leg steak", "1 sprig fresh thyme, chopped", "½ garlic clove, chopped", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp olive oil", "½ aubergine, cut into cubes", "½ onion, chopped", "1 garlic clove, finely chopped", "200g/7oz canned cherry tomatoes", "pinch chilli flakes", "2 tbsp white wine", "handful fresh basil, chopped", "salt and freshly ground black pepper", "sprig fresh thyme, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the grilled lamb steak, place the lamb into a shallow glass dish or bowl. Add the thyme, garlic, olive oil and seasoning to the lamb and massage into the meat. Leave aside to marinate for five minutes, or up to an hour if time permits. ", "Heat a griddle pan until hot, then add the steak and griddle on both sides for 3-4 minutes, or until cooked to your liking. Set aside to rest for five minutes before serving.", "To make the ratatouille, heat one tablespoon of the olive oil in a non-stick frying pan and add the aubergine. Fry for ten minutes, or until softened and golden-brown all over. ", "In a separate non-stick frying pan, heat the remaining one tablespoon of olive oil, add the onion to the pan and fry over a gentle heat for five minutes, or until softened but not coloured.", "Add the garlic to the pan and cook for a further one minute. ", "Add the fried aubergine, canned cherry tomatoes and chilli flakes to the pan and cook for three minutes.", "Add the white wine to the pan and cook for another two minutes. ", "Stir in the basil to the pan and season well with salt and freshly ground black pepper. ", "To serve, spoon the ratatouille onto a plate and top with the griddled lamb. Garnish with sprig of thyme."]}, {"isVegetarian": false, "title": "Grilled lamb with couscous and yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_grilledlambwithcousc_72147", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb neck fillets (about 100g/4oz each)", "2 tbsp olive oil", "1 clove garlic, chopped", "4 tbsp balsamic vinegar", "½ glass red wine", "4 sprigs of rosemary", "300ml/½ pint meat stock", "a pinch of sugar", "salt and freshly ground black pepper", "a good pinch of celery salt", "a good pinch of dried oregano ", "½ lemon, juice only", "2 handfuls of green beans", "½ cucumber", "1 clove garlic", "salt", "a bunch of mint, chopped", "½ lemon, juice only", "1 tbsp olive oil", "250ml/9fl oz Greek yoghurt", "85g/3oz couscous", "60g/2¼oz pine nuts, toasted", "2 handfuls of seedless raisins", "a small bunch of flatleaf parsley, chopped", "2 lemons, juice of both and zest of 1 only", "8 tbsp olive oil", "a pinch of ground cumin"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the tzatsiki, chop the cucumber into small cubes, place in a sieve and allow to drain. Smash the garlic into a paste with the flat of a knife.  ", "In a large bowl, mix the garlic, a good pinch of salt and a third of the chopped mint.   ", "Add a squeeze of lemon juice and the olive oil, mix well and then add the yoghurt, followed by the drained cucumber. Mix gently and chill in the fridge. ", "Trim any sinew from the lamb fillets.  Heat two tablespoons of  oil in a large pot and seal the lamb.  Remove the fillets from the pot and place to one side.  ", "Add the garlic to the pot and quickly add the balsamic vinegar and red wine.  Bring to the boil, then add the rosemary and half the remaining chopped mint.  Now add the meat stock and sugar with salt and pepper to taste and allow to simmer until reduced by half.  ", "While it simmers, dust the lamb fillets with celery salt and dried oregano and place in the simmering juices.  Cover with a lid and cook gently for five minutes.  ", "Remove the lamb fillets and reduce the sauce by half, squeezing in the lemon juice.", "To prepare the couscous, soak it as per the packet instructions, then add the toasted pine nuts, raisins, chopped parsley, the remaining chopped mint, the lemon juice and zest, olive oil, cumin and salt and pepper to taste. Mix well.", "While the couscous soaks, cook the green beans in boiling salted water for 4-5 minutes until just tender. Drain well.", "Slice each lamb fillet into pieces and place over the couscous and green beans. Spoon over the lamb juices and finish with a big dollop of tzatsiki.  Serve."]}, {"isVegetarian": false, "title": "Grilled lamb with feta and lemon", "url": "www_bbc_co_uk_food_recipes_grilledlambwithfetaa_92373", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledlambwithfetaa_92373_16x9.jpg", "ingredients": ["1 small handful fresh oregano sprigs", "1 small handful fresh thyme sprigs ", "fruity olive oil, for drizzling and frying", "salt and freshly ground black pepper", "1 block good-quality feta cheese", "1 lemon, juice only, to taste", "6-8 lamb cutlets"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rip the tender little leaves off the oregano and thyme sprigs, place into a bowl and drizzle over some olive oil. Crumble in the feta (large chunks are fine as they will break up slightly when everything is stirred together in the bowl). Season, to taste, with freshly ground black pepper and lemon juice and mix everything together gently.", "Heat a griddle pan until hot, season the lamb cutlets with salt and freshly ground black pepper, and brush each cutlet with a little olive oil before placing on the hot griddle. Cook for a few minutes one each side, or until lightly crisp - I like mine still pink and a little springy in the middle.", "Divide the cutlets between a two warm plates, and while the cutlets are still sizzling, gently spoon over the feta and herb dressing. Eat immediately, while all is hot, herbal and piquant."]}, {"isVegetarian": false, "title": "Grilled lamb with green beans and beetroot", "url": "www_bbc_co_uk_food_recipes_grilledlambwithgreen_84128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 lamb steak, cut in half", "½ tsp chopped fresh rosemary", "½ tsp chopped fresh thyme leaves", "25g/1oz unsalted butter", "2 cooked beetroot, quartered", "100g/3½oz green beans, blanched and refreshed", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, place the oil, lamb, rosemary and thyme into a bowl and mix well. Season with salt and freshly ground black pepper. ", "Heat a griddle pan until smoking then add the lamb. Cook for three minutes on each side, or until cooked through, then remove from the heat and leave to rest for two minutes.", "For the beans and beetroot, melt the butter in a frying pan over a medium heat. Add the beetroot and cook for three minutes.", "Add the beans and cook for three more minutes and season, to taste, with salt and freshly ground black pepper.", "To serve, place the beans in the middle of a plate and place the lamb on top."]}, {"isVegetarian": false, "title": "Grilled leeks with crunchy ham and cheese topping", "url": "www_bbc_co_uk_food_recipes_grilledleekswithcrun_87410", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large leek, trimmed and halved lengthways", "300ml/½ pint double cream", "150g/5½oz parmesan cheese, grated", "freshly ground black pepper", "2 slices ham, torn", "55g/2oz fresh breadcrumbs"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "Place the halved leek into boiling salted water and cook until tender. Remove with a slotted spoon and drain well. Place on a baking sheet.", "Place the double cream into a pan and simmer until it has reduced by half. Add half of the parmesan and season with black pepper. ", "Place the torn ham over the top of the cooked leek and then pour over the creamy parmesan sauce. Scatter over the breadcrumbs and the rest of the parmesan and place under the grill until golden-brown and bubbling.", "Place the grilled leek on a serving plate and serve immediately."]}, {"isVegetarian": false, "title": "Grilled lemongrass beef", "url": "www_bbc_co_uk_food_recipes_grilledlemongrassbee_79306", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 stalks lemongrass, finely chopped", "2 cloves garlic, crushed", "2 shallots, finely chopped", "1 chilli, finely chopped", "2 tbsp Thai fish sauce (nam pla)", "1 tbsp lime juice", "1 tbsp water", "1 tbsp sesame seed oil", "450g/1lb beef fillet", "2 tbsp sesame seeds", "2 limes, juice only", "2 tbsp Thai fish sauce (nam pla)", "2 tbsp water", "2 tbsp cider vinegar", "1 tsp sugar", "1 garlic clove, crushed", "1 chilli, chopped", "1 carrot, finely grated"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the marinade ingredients together in a large bowl.", "Roll the beef tightly in cling film to form a round roll and leave to sit in the fridge for 30 minutes. Remove from the fridge when 'set' in a roll.", "Unwrap the beef and slice into 5mm thick discs. Place the discs in the marinade and leave for 30 minutes.", "Place the beef slices onto cocktail sticks, to resemble lollipops, and sprinkle with sesame seeds.", "Heat a griddle pan. Add the beef discs and griddle for 1-2 minutes on each side, until sesame seeds have taken colour.", "Meanwhile for the dipping sauce, mix all ingredients together in a bowl.", "To serve, place the beef slices onto a serving plate with the bowl of dipping sauce alongside."]}, {"isVegetarian": false, "title": "Grilled lemon sole with Choron sauce", "url": "www_bbc_co_uk_food_recipes_grilledlemonsolewith_93714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp white wine vinegar", "3 tbsp white wine", "10 black peppercorns, lightly crushed", "2 tbsp shallots, peeled, finely chopped", "1 tsp finely chopped fresh tarragon leaves", "1 tbsp water", "1 tbsp tomato purée", "3 free-range egg yolks", "200g/7oz butter, melted", "1 tbsp finely chopped fresh flatleaf parsley", "2 tbsp olive oil", "8 lemon sole fillets", "salt and freshly ground black pepper", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp rapeseed oil", "salt and freshly ground black pepper", "150g/5oz watercress, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Choron sauce, place the white wine vinegar, white wine, black peppercorns, shallots and tarragon into a non-reactive saucepan and bring to the boil. Reduce the heat and simmer until the liquid in the pan has reduced to about 1 tablespoon. ", "Add the water and tomato purée to the pan and whisk to combine. Beat in the egg yolks, whisking for 3-4 minutes over a low heat, or until frothy. Gradually pour in the butter in a thin, steady stream, whisking continuously until all of the butter has been incorporated and the sauce is thickened. ", "Season, to taste, with salt and freshly ground black pepper, then strain the sauce through a fine sieve. Discard the solids left behind in the sieve. Keep warm until ready to serve. Stir the parsley into the sauce just before serving.", "Preheat the grill to high. Lightly grease a roasting tray with olive oil. ", "For the lemon sole, place the sole fillets skin-side up onto the prepared roasting tray and season with salt and freshly ground black pepper. Grill for 3-4 minutes, or until the skin is crisp and golden-brown and the fish is cooked through. (When the fish is cooked, the flesh should be opaque all the way through and flake easily with a fork.) Remove the fish from the grill and set aside to rest for 1-2 minutes. ", "For the watercress, whisk the Dijon mustard, white wine vinegar and rapeseed oil together in a small bowl until emulsified. Season, to taste, with salt and freshly ground black pepper. Place the watercress in a bowl, pour over the dressing and toss well to coat.", "To serve, place 2 fillets on each serving plate. Arrange the watercress alongside, then spoon the Choron sauce over the fish."]}, {"isVegetarian": false, "title": "Grilled loin of pork with rosti potato and spiced apricots", "url": "www_bbc_co_uk_food_recipes_grilledloinofporkwit_85927", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5½oz pork loin, cut into medallions", "salt and freshly ground black pepper ", "½ potato, peeled and grated", "salt and freshly ground black pepper", "50g/2oz unsalted butter", "1 tbsp olive oil", "1 apricot, stone removed, chopped", "pinch chilli flakes", "1 tbsp white wine vinegar", "1 tbsp clear honey", "1 tbsp water", "1 tbsp vegetable oil", "¼ leek, finely sliced", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pork, heat a griddle pan until smoking hot.", "Rub the pork with the oil and season well with salt and freshly ground black pepper. Chargrill for 2-3 minutes on each side, or until completely cooked through (there should be no pink in the centre). Remove from the heat and set aside to rest in a warm place.", "For the rösti, place the grated potato into a clean tea towel and squeeze out the excess water. Season well with salt and freshly ground black pepper.", "Heat half of the butter in a small ovenproof frying pan. Place the grated potato into the pan, press down and fry until lightly golden underneath. Turn over, add the remaining butter to the edges of the rösti and fry on the other side until lightly golden.", "Transfer to the oven and bake for 6-8 minutes, or until crisp.", "For the spiced apricots, heat the oil in a pan and add the apricot, chilli flakes, vinegar, honey and water. Simmer gently until thickened.", "For the leek garnish, heat the oil in a wok or large frying pan until very hot. Add the sliced leek, season with salt and freshly ground black pepper and stir fry until golden-brown and crisp.", "To serve, place the rösti onto a serving plate and top with the pork. Spoon over the apricots and garnish with the leeks."]}, {"isVegetarian": false, "title": "Grilled mackerel fillets with yoghurt kadhi and curry leaf spinach poriyal", "url": "www_bbc_co_uk_food_recipes_grilledmackerelfille_89359", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175ml/6fl oz full fat plain yoghurt", "1 tbsp gram flour (also called besan)", "250ml/9fl oz water", "½ tsp salt", "¼ tsp ground turmeric", "1 tbsp ghee", "1 whole red chilli", "½ tsp cumin seeds", "20-25 fresh curry leaves", "1 tsp cloves", "1 tsp fennel seeds", "½ tsp pepper", "5cm/2in cinnamon stick", "1 tsp cumin seeds", "½ tsp red chilli powder", "4 large mackerel fillets, bones picked out with tweezers, trimmed", "1 tsp salt", "½ lemon, juice only", "1 tbsp vegetable oil", "2 tbsp vegetable oil", "1 tsp mustard seeds", "1 sprig fresh curry leaves", "1 onion, finely chopped", "½ tsp salt", "1 fresh green chilli, finely chopped", "150g/5oz spinach, finely shredded", "60g/2½oz fresh coconut, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the yoghurt kadhi, place the yoghurt, gram flour, water, salt and turmeric into a bowl and whisk to combine, then pass the mixture through fine sieve. ", "Place the yoghurt mixture into a pan over medium heat and bring to the boil, whisking constantly. Reduce heat and simmer for 5-8 minutes, or until the sauce turns glossy and begins to coat the back of a wooden spoon. Skim the yoghurt kadhi to remove any scum or impurities that may appear on the surface. ", "Place the ghee into a small pan and heat to smoking point. Add the red chilli, cumin and curry leaves and as they crackle and cook (almost immediately), pour the oil and spices over the yoghurt kadhi. Set aside.", "For the mackerel, preheat the grill to its highest setting.", "Place all the spices into a pestle and mortar (or a spice grinder) and grind to a coarse mixture.", "Sprinkle the spice mixture over both sides of the mackerel fillets.", "Mix the oil and lemon juice together, then drizzle over the mackerel fillets.", "Place the mackerel fillets onto a tray and place under the grill, skin side-up, and cook for 8-10 minutes, or until the mackerel is just cooked through.", "For the spinach poriyal, heat the oil in a frying pan over a medium heat. Add the mustard seeds and curry leaves and fry for 10-15 seconds (they should crackle and pop.", "Add the onions and fry for 5-6 minutes over a low heat, or until translucent. ", "Add the salt and green chilli and stir-fry for one minute. ", "Add the spinach leaves and stir-fry for 2-3 minutes, until wilted down.", "Add the grated coconut and mix well. Cook for one minute then remove from the heat.", "To serve, pour or ladle equal amounts of the yoghurt kadhi into serving bowls and place a mackerel fillet on top of each. Place some of the spinach poriyal over each mackerel fillet and serve immediately."]}, {"isVegetarian": true, "title": "Grilled lettuce with goats' cheese", "url": "www_bbc_co_uk_food_recipes_grilledlettucewithgo_14300", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledlettucewithgo_14300_16x9.jpg", "ingredients": ["6 Little Gem lettuces ", "2 tbsp olive oil ", "salt and freshly ground black pepper ", "250g/9oz  goats' cheese, or taleggio ", "¼ lemon"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the lettuces in half leaving the base of the stem intact to hold the leaves together. Brush the lettuces with the olive oil, well-seasoned with salt and pepper.", "Then place cut side down on a preheated barbecue rack or one of those cast iron griddle pans with raised ridges. Cook for 3-5 minutes. They are ready when the outer leaves are well-charred, striped from the grill and the thick stems are just becoming tender. ", "Arrange the 12 lettuce halves in a dish and lay over thin slices of the cheese. Add a few more twists of pepper and a drizzle of leftover olive oil. Throw in a hot oven or under a grill until the cheese starts to bubble. ", "Serve at once. Two lettuce halves, smothered in bubbling cheese, per person."]}, {"isVegetarian": false, "title": "Grilled mackerel with new potatoes and salad", "url": "www_bbc_co_uk_food_recipes_grilledmackerelwithj_86201", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledmackerelwithj_86201_16x9.jpg", "ingredients": ["150g/5oz new potatoes, such as Jersey Royals, scrubbed", "pinch salt ", "2 mackerel fillets", "1 tbsp wholegrain mustard", "salt and freshly ground black pepper", "1 tsp English mustard", "1 tbsp white wine vinegar", "3 tbsp rapeseed oil, or olive oil", "squeeze lemon juice", "2 Little Gem lettuces"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil. Add the potatoes and cook for 8-10 minutes until just tender. Drain and return to the pan to keep warm.", "For the mackerel, preheat the grill to high.", "Put the mackerel fillets on the grill tray, brush with the wholegrain mustard and season with salt and pepper. Grill them for 2-3 minutes, then turn over and grill for a further minute, or until the mackerel is cooked through.", "For the dressing and salad, whisk the English mustard, white wine vinegar, rapeseed oil and lemon juice together in a bowl. Season with salt and pepper. Add the lettuce leaves to the bowl and mix to combine.", "Divide the mackerel between two plates, along with the potatoes and the salad. Serve straightaway."]}]