[{"ingredients": ["Harina de 200 g / 7 oz de levante automático (blanca o integral)", "2 huevos de gallinas camperas", "150ml / 5fl de leche en oz", "1 cucharada de mantequilla, para cocinar", "2 bananas, rebanadas o 2 manzanas grandes, sin corazón y rebanadas en anillos de 1cm / ½ en un puñado de frutas suaves congeladas (o una mezcla)", "½ cucharadita de canela", "2 cucharaditas de azúcar en polvo"], "method": ["El trabajo de los niños: tamiza la harina en un tazón grande.", "El trabajo de los niños: golpea el huevo suavemente sobre la superficie de trabajo para romperlo; el agrietamiento en una superficie plana creará menos pedazos de concha. Abra el huevo sobre un tazón pequeño. Saca cualquier trozo de concha que haya caído en el recipiente. (Lávese las manos después de tocar los huevos)", "El trabajo de los niños: Agregue los huevos y un poco de leche a la harina tamizada y revuelva con un batidor o tenedor. Agregue el resto de la leche poco a poco, mezclando todo lo que pueda para eliminar los grumos. Deje la mezcla reposar durante unos minutos.", "El trabajo de los niños: agite suavemente la fruta que desea usar. Sumerja los anillos de manzana en la masa para que estén recubiertos en ambos lados. Ten cuidado, ¡son frágiles!", "El trabajo de un adulto: Derrita una cucharadita de mantequilla en una sartén a fuego medio.", "Trabajo para adultos: coloque con cuidado cuatro cucharadas grandes de la mezcla de buñuelos en la sartén, asegurándose de dejar espacio alrededor de cada cucharada mientras los buñuelos se extienden mientras se cocinan. Los anillos de manzana harán un buñuelo cada uno.", "Trabajo de un adulto: Cocine por 3-4 minutos en un lado. Debería ver cómo se forman burbujas y la mezcla debería comenzar a formarse alrededor de los bordes.", "El trabajo de un adulto: voltee con cuidado los buñuelos y cocine por el otro lado hasta que estén dorados y cocinados, esto debería tomar otros 3-4 minutos. Repita hasta que haya utilizado toda la mezcla de la mezcla, agregando un poco más de mantequilla cada vez que agregue más buñuelos a la sartén.", "El trabajo de los niños: Mientras los buñuelos se cocinan, mezcle la canela y el azúcar en un tazón pequeño. Espolvorea los buñuelos cocidos con azúcar de canela y mételos."], "url": "www_bbc_co_uk_food_recipes_fruity_fritters_83168", "title": "Buñuelos con sabor a fruta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde de 10 a 12 buñuelos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruity_fritters_83168_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 45g / 1¾oz de fragancia de frijoles con sabor a fruta (olla lavada y reservada para medir el azúcar y la harina, ver abajo)", "1 huevo de gallinas camperas", "½ marmita de azúcar en polvo", "3 potes de harina de auto crianza", "1 melocotón fresco o nectarina, piedra removida, picada", "2 cucharadas de aceite vegetal más algunos extra para cepillar pan de molde"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de pan con un poco de aceite vegetal.", "Batir el queso fresco con el huevo hasta que esté suave y bien combinado.", "Agregue media olla de azúcar y tres ollas de harina a la mezcla de huevo y bata bien. Agregue el durazno picado y el aceite vegetal y bata nuevamente.", "Raspe la mezcla de torta en la lata de hogaza preparada y coloque la lata en una bandeja para hornear. Hornee en el horno por 25-30 minutos, o hasta que la parte superior de la torta esté dorada y un pincho insertado en su centro salga limpio. Dejar de lado para enfriar, luego cortar."], "url": "www_bbc_co_uk_food_recipes_fruity_fromage_frais_48250", "title": "Tarta de queso fresco con sabor a fruta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 5oz de hojaldre", "harina común", "2 cucharaditas colmadas de avena", "140g / 5oz de cerezas frescas", "2 cucharadas colmadas de azúcar demerara", "pizca de canela"], "method": ["Antes de cocinar, lávese las manos y colóquese un delantal. Pesar o medir todos los ingredientes. Ponga un poco de papel de hornear en la bandeja de horno. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 6.", "Harina su encimera o mesa con un poco de harina. Forma la masa en tus manos en forma de disco rugoso. Puede girarlo hacia un lado y girarlo o usar la palma de sus manos para acariciar las esquinas hasta que esté redondo.", "Ruede la masa, girando la masa a menudo para que quede redonda. Debe tener aproximadamente 5 mm de grosor y aproximadamente 20 cm de ancho. Ponlo en la bandeja de horno.", "Espolvoree el centro de la masa con la avena, dejando espacio alrededor, como una isla de avena, ¡estos absorberán los jugos de fruta!", "Quita los tallos de las cerezas y ponlos en una bolsa de plástico. Golpea suavemente con el rodillo para dividirlos. Incline las cerezas y sus jugos en el tazón y extraiga las piedras; asegúrese de verificar que se hayan eliminado todas las piedras. Agregue una cucharada de azúcar demerara y una pizca de canela, luego revuelva.", "Coloque las cerezas en el medio de la masa sobre la avena, dejando el borde de la masa libre de fruta. Cepille el borde con jugo de cereza.", "Ahora coloque los bordes de la masa sobre las cerezas y pellizque la masa para mantenerla en su lugar. Todavía debería poder ver algunas de las frutas en la parte superior del pastel. Ahora cepille la masa con el jugo de nuevo. Espolvorea un poco más de azúcar en la parte superior.", "Pídale a un adulto que lo coloque en el horno precalentado durante 20-25 minutos. Sirva caliente o frío con yogur o helado."], "url": "www_bbc_co_uk_food_recipes_fruity_prize_pie_78823", "title": "Pastel con sabor a fruta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["420g / 15oz de harina blanca fuerte, más extra para espolvorear", "7g de sal (aproximadamente una cucharadita)", "10g / ⅓oz de levadura de acción rápida", "25g / 1oz de mantequilla sin sal, ablandada y cortada en cubos, más extra para engrasar", "35 g / 1 oz de azúcar en polvo", "2 huevos medianos de granja", "100ml / 3½fl oz de leche entera en grasa, calentada", "75g / 2½oz de cerezas secas", "Cáscara mezclada 75g / 2½oz", "75g / 2½oz sultanas", "75 g / 2½ oz de albaricoques secos, picados", "Pacanas de 100g / 3½oz, picadas", "60g / 2¼ oz de azúcar en polvo", "3 cucharaditas de canela molida", "2 cucharadas de mermelada de albaricoque", "1 limón, solo jugo", "100g / 3½oz de azúcar glasé"], "method": ["Ponga la harina, la sal, la levadura, la mantequilla, el azúcar, los huevos, la leche y 50 ml / 1¾ fl oz en un recipiente. Mezcle con una cuchara hasta que se combinen.", "Agregue otros 50 ml / 1¾ fl oz de agua y amasar en un mezclador independiente con un accesorio de gancho de masa durante cinco minutos, o hasta que tenga una masa suave y suave. Cubra con un paño de cocina y deje probar durante 45 minutos en un lugar cálido.", "Para el relleno, combine la fruta y las nueces en un tazón, y el azúcar y la canela en otro.", "Cuando la masa esté probada, apáguela sobre una superficie de trabajo ligeramente enharinada. Rechaza la masa y amasa suavemente.", "Extienda la masa en un rectángulo de 40x60cm / 16x23½ pulgadas, teniendo cuidado de no eliminar todo el aire.", "Espolvoree uniformemente la mezcla de azúcar y canela sobre la masa y cubra con la fruta y las nueces.", "Comenzando por un lado largo, cuidadosamente enrolle la masa en un cilindro (como un rollo suizo). Forme un anillo y luego use agua para unir los dos extremos.", "Engrase una bandeja grande para hornear con mantequilla. Levante la masa en la bandeja y, con unas tijeras, realice cortes verticales alrededor del borde exterior del anillo, dejando un espacio de 4 cm / 1½ pulgadas entre cada corte.", "Coloque el anillo formado en una bolsa de prueba y deje que se levante durante 40 minutos.", "Precalentar el horno a 190C / 375F / Gas 5.", "Hornee el pan probado durante 15 minutos, luego verifique si el pan se dora demasiado rápido. Cúbralo con papel de aluminio (para evitar que se queme) si es necesario y vuelva al horno durante otros 5-10 minutos, o hasta que esté cocido y dorado.", "Para la decoración, caliente suavemente la mermelada de albaricoque para hacer un glaseado.", "Una vez horneado, retire el anillo de té del horno y cúbralo con el glaseado de albaricoque. Poner a un lado para enfriar completamente en una rejilla de alambre.", "Prepare una guinda combinando el jugo de limón y el azúcar glas hasta que quede suave. Cuando esté completamente frío, rocíe el glaseado de limón sobre el pan y sirva."], "url": "www_bbc_co_uk_food_recipes_fruity_swedish_tea_ring_19325", "title": "Anillo de té sueco afrutado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 kg / 2lb de carne cortada en trozos de 5cm / 2 pulgadas", "harina sazonada para espolvorear", "2 cucharadas de aceite vegetal o goteo de carne", "Tocino ahumado 175 g / 6 oz, cortado en cubitos", "2 tallos de apio, finamente picados", "1 cebolla grande, finamente picada", "2 dientes de ajo, finamente picados", "2 ramitas de tomillo", "2 cucharadas de jalea de grosella", "275 ml / 10 fl oz de vino tinto", "Juego de 500 ml / 1 pinta o caldo de carne", "150ml / 5fl oz puerto", "1 cucharada de salsa Worcestershire", "12 ciruelas pasas", "55g / 2oz de cerezas secas", "55g / 2oz de arándanos secos", "Castañas 225g / 8oz, cocidas y peladas", "115 g / 4 oz champiñones", "2 hojas de laurel", "naranja orgánica, solo ralladura", "1 cucharada de puré de tomate", "2 cucharadas de perejil picado", "sal", "pimienta molida recién molida", "Harina normal de 250g / 9oz, más extra para espolvorear", "1 cucharadita de sal", "2 cucharaditas de polvo de hornear", "2 cucharadas de aceite de oliva", "4 cucharadas de perejil fresco de flatleaf, picado, más extra para decorar", "4 cucharadas de cebollín fresco, cortado", "150ml / ¼ litro de leche", "patatas nuevas y col roja estofada"], "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Mientras tanto, mezcle la carne con la harina sazonada. Caliente el aceite o goteando en una cazuela para horno y dore la carne por completo.", "Agregue el tocino, el apio, la cebolla, el ajo y el tomillo y cocínelos durante 6-8 minutos sin dorar. Agregue la mermelada de grosella, el vino, el caldo, el puerto y la salsa Worcestershire junto con la fruta seca, las castañas, los champiñones, las hojas de laurel, la ralladura de naranja y el puré de tomate.", "Lleve lentamente al punto de cocción a fuego lento, luego cubra y cocine en el horno de dos a dos horas y media o hasta que la carne esté tierna.", "Encienda el horno a 180C / 350F / Gas Mark 4 después de aproximadamente una hora y media o dos horas.", "Para hacer las albóndigas, tamice la harina, la sal y el polvo de hornear en un tazón grande. Haga un pozo en el centro y agregue el aceite de oliva y las hierbas, luego vierta la leche y, con un tenedor, mezcle para formar una masa suave.", "Coloque la masa sobre una superficie ligeramente enharinada y amase brevemente. Divida y dé forma en 16 albóndigas del tamaño de una cucharadita.", "Coloque las albóndigas en la superficie de la cazuela, cubra y coloque en el horno (ahora a la temperatura más alta) durante los últimos 35-40 minutos, o hasta que las albóndigas se hayan levantado y estén doradas.", "Retire la cazuela del horno y deje reposar durante cinco minutos. Elimina cualquier grasa que haya salido a la superficie. Sazonar al gusto y doblar en el perejil.", "Sirva con papas nuevas y repollo estofado rojo."], "url": "www_bbc_co_uk_food_recipes_fruitybeefcasserolew_72908", "title": "Cazuela de carne con sabor a fruta con albóndigas de perejil", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 hojas de gelatina de hoja", "6 cucharadas de calabaza sin azúcar o naranja sin azúcar", "½ limón, ralladura solamente, finamente rallado", "150g / 5½oz de yogur natural sin grasa", "200 g / 7 onzas de bayas frescas mezcladas (alternativamente, use bayas congeladas)", "pequeño puñado de hojas de menta fresca"], "method": ["Coloque las hojas de gelatina en un recipiente mediano y cúbralas con agua fría. Déjalo en remojo durante cinco minutos o hasta que se ablanden. Déles vuelta un par de veces para asegurarse de que no se peguen.", "Vierta la calabaza, la ralladura de limón y 100 ml / 3½ fl oz de agua en una olla pequeña y caliente muy suavemente hasta que esté tibia. Retire del fuego.", "Exprime las láminas de gelatina para eliminar el exceso de agua y luego agrégalas a la sartén, revolviendo hasta que se derrita en el líquido.", "Agregue 250ml / 9fl oz de agua y el yogur hasta que estén completamente combinados.", "Vierta la gelatina en cuatro vasos o platos de vidrio, cubra con film transparente y deje enfriar durante 5-6 horas o durante la noche hasta que se asiente.", "Sirva las gelatinas cubiertas con bayas frescas y hojas de menta para decorar."], "url": "www_bbc_co_uk_food_recipes_fruity_yoghurt_jellies_38771", "title": "Jaleas de yogur con sabor a fruta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruity_yoghurt_jellies_38771_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5 oz gambas con caparazón", "4 cucharadas de aceite de oliva", "300ml / 10fl oz de caldo de pescado", "500g / 1lb 2 oz de fregola", "1 cebolla, finamente picada", "2 ajos, finamente picados", "1 chile rojo, finamente picado o ½ cucharadita de chile rojo seco", "tomillo de ramita", "1 cucharadita de orégano seco", "pellizcar azafrán molido", "100 ml / 3½ fl oz de vino blanco o vermut", "4 tomates medianos, desollados y toscamente picados", "200 g / 7 oz de almejas, limpiadas", "Mejillones de 200 g / 7 oz, limpios y barbados", "12 vieiras pequeñas", "albahaca pequeña, solo hojas", "pequeño racimo de perejil, solo hojas", "Rodajas de limón"], "method": ["Quita las cabezas y los caracoles de las gambas y destrúyelos. Ponga a un lado las gambas peladas.", "Caliente una cucharada de aceite de oliva en una sartén grande con tapa y agregue las cáscaras y las cabezas de gambas. Freír durante 1-2 minutos hasta que se hayan vuelto rosa, luego vierta el caldo de pescado. Deje que burbujee, revuelva vigorosamente, luego cocine a fuego lento durante 5 minutos.", "Retirar del fuego y colar. Deseche las cáscaras y las cabezas de gambas y reserve el licor.", "Ponga a hervir una olla grande de agua y agregue mucha sal y la fregola. Cocine a fuego lento hasta que esté al dente, alrededor de 10 minutos. Escurrir y apartar.", "Mientras cocinas la fregola, calienta dos cucharadas de aceite de oliva en la sartén. Agregue la cebolla y fría hasta que se ablande. Agregue el ajo, el chile, las hierbas y el azafrán, luego vierta el vino blanco.", "Cocine por un par de minutos hasta que se reduzca en volumen, luego agregue el caldo reservado y los tomates. Cocine a fuego lento durante 5 minutos.", "Toque suavemente cualquier almeja y mejillón con conchas abiertas contra el mostrador. Deseche todos los que no cierren sus caparazones en unos minutos o que tengan conchas rotas o astilladas.", "Revuelva la fregola en la mezcla de tomate. Pon las almejas y los mejillones en la parte superior y cúbrelos. Cocine por otros 2-3 minutos o hasta que las almejas y los mejillones se hayan abierto - deseche los mariscos que no se abren.", "En una sartén separada, caliente la cucharada restante de aceite de oliva. Freír los langostinos reservados en ambos lados muy rápidamente, luego agregarlos a la fregola. Repita con las vieiras.", "Para servir, agregue la albahaca y el perejil y sirva inmediatamente con rodajas de limón en un lado."], "url": "www_bbc_co_uk_food_recipes_frutti_di_mare_with_55525", "title": "Mariscos con azafrán fregola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["gran perilla de mantequilla", "4 manzanas de postre, peladas y en rodajas", "1 cucharada de azúcar mascabado ligero", "4-6 cucharadas de flan fresco", "gran perilla de mantequilla", "Avena jumbo avena 50 g / 2 oz", "1 cucharada de coco desecado", "Nueces pecanas de 25g / 1oz, más o menos picadas", "pellizcar canela molida", "2 cucharadas de azúcar mascabado ligero", "1 cucharada de aceite de girasol", "1-2 cucharadas de jarabe de arce"], "method": ["Calienta dos sartenes antiadherentes grandes y agrega una perilla de mantequilla a cada una. Una vez fundido, agregue las rebanadas de manzana y el azúcar en una sartén y cocine durante 3-4 minutos hasta que se ablanden.", "Agregue la gachas de avena, el coco, las nueces, la canela y el moscovado ligero al otro y cocine por 3-4 minutos a fuego alto hasta que estén dorados, agregue el aceite si la mezcla se siente demasiado seca.", "Una vez que las manzanas se hayan ablandado, agregue la crema pastelera, cállela y luego divídala entre dos platos para servir. Mezcle el jarabe de arce en la migaja, luego cuchara sobre la crema de manzana. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_fryingpanapplecustar_65966", "title": "Sartén crumble de manzana y natilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Nueces de 75 g / 2½ oz", "225g / 8oz de mantequilla, ablandada, más extra para engrasar", "225g / 8oz de azúcar morena mascabado", "4 huevos grandes de gallinas camperas", "Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear", "150 g / 5½ onzas de mantequilla, suavizadas", "150g / 5½oz de azúcar glas, tamizado", "250 g / 9 oz de dulce de azúcar, más o menos picados", "Mitades de nuez 25g / 1oz"], "method": ["Para hacer la torta, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Ponga a mantequilla dos latas de emparedado sueltas de 20 cm / 8 pulgadas y forre las bases con discos de papel para hornear.", "Ponga las nueces en un procesador de alimentos y mezcle la configuración del pulso hasta que se corte en trozos muy pequeños, pero para nada finos o polvorientos. No se preocupe si quedan unos trozos más grandes de nuez, estos agregarán textura a la esponja. Incline las nueces en un tazón.", "Coloque la mantequilla y el azúcar morena, los huevos, la harina y el polvo de hornear en el procesador de alimentos y mezcle la configuración del pulso hasta que se combinen bien. Es posible que deba quitar la tapa una o dos veces y empujar la mezcla hacia abajo con una espátula de goma. (Si no tiene un procesador de alimentos, incline todos los ingredientes en un tazón grande para mezclar, ¡luego golpéelos como el infierno!)", "Agregue las nueces picadas a la mezcla y mezcle hasta que se combinen. Cuchara la mezcla de manera uniforme en las dos latas y suavizar la superficie. Hornee en el mismo estante en el centro del horno durante 25 minutos, o hasta que esté bien levantado y apenas empiece a encogerse hacia atrás desde los lados de la lata.", "Retire las latas del horno y deje que se enfríen durante cinco minutos antes de pasar un cuchillo por el borde de cada torta y girar sobre una rejilla de alambre. Despegue el pergamino para hornear y deje que se enfríe por completo.", "Para hacer la guinda, ponga la mantequilla en un procesador de alimentos o en un tazón para mezclar, agregue el azúcar glas y 150g / 5½ oz del dulce de azúcar picado. Mezcle hasta que la formación de hielo esté suave y cremosa. Agregue 2-3 cucharaditas adicionales de leche si es necesario, para que la formación de hielo sea ligera y untable. No se preocupe si parte del dulce de azúcar sigue siendo grueso.", "Coloque una de las esponjas en un plato o base de pastel y unte con la mitad de la cobertura de chocolate. Cubra con la segunda esponja y extienda con la formación de hielo restante, creando suaves remolinos y picos. Decora con las mitades de nueces y chocolate picado."], "url": "www_bbc_co_uk_food_recipes_fudgy_walnut_cake_63895", "title": "Tarta de nuez Fudgy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fudgy_walnut_cake_63895_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "pizca de sal", "225 g / 8oz de mantequilla sin sal, refrigerada", "1 huevo de gallinas camperas, batido, para esmaltar", "10 huevos de codorniz", "Setas de castaña 200g / 7oz, picadas", "botón de mantequilla", "100g / 3½oz de tomates enrojecidos por el sol", "8 salchichas de cerdo grandes", "200 g / 7 oz de morcilla", "200g / 7oz de jamón de Parma", "aceite en aerosol para engrasar la bandeja de horno"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina y la sal en un tazón. Divida la mantequilla en cuatro pedazos iguales y coloque tres en la nevera. Frote el cuarto restante de la mantequilla en la harina hasta que la mezcla se asemeje a finas migas de pan.", "Agregue 125ml / 4fl oz de agua y agréguelo para formar una masa. No amasar ni trabajar la masa.", "Envuelva la masa en una película adhesiva y colóquela en la nevera para que repose durante 15 minutos.", "Para el llenado, ponga a hervir un recipiente con agua. Baje los huevos al agua hirviendo e inmediatamente configure un temporizador durante dos minutos y 45 segundos.", "Retire los huevos con una cuchara ranurada y colóquelos en un colador. Ponga los huevos bajo agua fría por un minuto y luego colóquelos en un recipiente con agua fría durante unos minutos.", "Pele los huevos y regréselos al agua fría y déjelos a un lado.", "En una sartén de tamaño mediano, freír los champiñones en un pomo de mantequilla hasta que estén dorados y suavizados.", "En un procesador de alimentos, mezcle los tomates bañados por el sol en un puré. Agregue los champiñones cocidos y ponga la mezcla en la nevera para que se enfríe.", "Retire la masa de la nevera junto con una de las tres piezas restantes de mantequilla. En una superficie ligeramente enharinada, extienda la masa para formar un rectángulo largo.", "Coloca la mantequilla sobre los dos tercios superiores de la masa. Dobla el tercio inferior sobre la mantequilla y el tercio superior sobre la parte superior (como una carta lista para entrar en un sobre).", "Gire la masa 90 grados y extiéndala en un rectángulo largo. Repita y dobla, luego envuelva la masa en una película adhesiva y enfríe durante 15 minutos.", "Retire las pieles de las salchichas y la morcilla. Desmenuce la morcilla en la carne de salchicha y revuelva para combinar.", "Coloque una gran pieza de película adhesiva en la superficie de trabajo. Coloque el jamón de Parma sobre la película adhesiva, superponiendo los bordes para formar un rectángulo ordenado de 28x20cm / 11x8 pulgadas.", "Extienda la mezcla de tomate y champiñones sobre el jamón dejando un borde de 1cm / ½ pulgada. Extiende la carne de salchicha encima de esto. Luego alinee los huevos duros a lo largo del centro del rectángulo.", "Usando la película adhesiva para ayudar, enrolle en una salchicha apretada, manteniendo los huevos en línea y en el medio de la carne de salchicha. Gire los extremos de la película adhesiva para sellar y enfriar en la nevera durante 15 minutos.", "Tome la masa de la nevera con el restante cuarto de la mantequilla. Repita el proceso de salpicar con mantequilla, enrollar la masa, doblarla y enfriarla nuevamente durante otros 15 minutos.", "Desenvuelva la salchicha y colóquela en una bandeja para hornear ligeramente engrasada. Hornee en el horno por 15-20 minutos. Retire la salchicha del horno y deje enfriar por completo.", "Saca la masa de la nevera y repite la laminación, el punteado y el plegado por última vez. Enfríe hasta que esté listo para usar.", "Cuando la salchicha esté fría, extender la masa finamente. Corte en un rectángulo ordenado alrededor de 38x25cm / 15x10in y reserve los bordes recortados para decorar.", "Coloque la salchicha en el medio de la masa y corte los cuadrados pequeños en cada esquina para evitar demasiados pasteles en los extremos.", "Doble la masa en cada extremo hacia arriba y sobre la salchicha, luego envuelva los lados largos de la masa hacia arriba y alrededor. Cepille los bordes superpuestos con agua y presione suavemente la masa para sellar.", "Coloque el Wellington en una bandeja de horno con la costura hacia abajo y cepille todo con huevo batido.", "Corta tiras finas de los adornos de pastelería y haz un patrón de celosía sobre el Wellington. Cepille la decoración con el huevo batido y hornee durante 45 minutos. Compruebe el Wellington después de 30 minutos y cúbralo con papel de aluminio si se dora demasiado.", "Permita descansar por 10 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_full_english_wellington_63948", "title": "Inglés completo Wellington", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla sin sal ablandada", "250 g / 9 oz de azúcar en polvo", "Huevos de 250g / 9oz de campo abierto, pesados ​​en sus caparazones (alrededor de 4 huevos medianos)", "Harina de auto crianza 250 g / 9 oz, tamizada", "3 claras de huevo de rango medio", "250 g / 9 oz de azúcar en polvo", "pizca de sal", "300g / 10½oz de mantequilla sin sal, suavizada y en cubos", "3 cucharadas de batido de fresa en polvo", "75 g / 2½ oz de chispas de colores del arco iris", "3 galletas sándwich rellenas de fresa, cortadas por la mitad"], "method": ["Precaliente el horno a 190C / 170C Ventilador / Gas 5. Engrase y forre una lata para pastel de 14x20cm / 5½x8 in o una lata de hogaza de 900 g / 2 lb.", "Para el pastel, coloca la mantequilla, el azúcar, los huevos y la harina en un tazón grande. Con un batidor de mano eléctrico, bata durante 3 minutos a velocidad media hasta que esté suave y brillante.", "Vierta la mezcla en la lata preparada. Nivele la parte superior, luego hornee en el estante del medio durante 45-50 minutos, o hasta que el pincho insertado salga limpio y el pastel esté dorado y bien levantado. Dejar enfriar durante 10 minutos en la lata y luego enfriar completamente en una rejilla de alambre.", "Mientras tanto, para la crema de mantequilla de merengue suizo de fresa, ponga las claras de huevo, el azúcar y la sal en un recipiente resistente al calor. Colóquelo sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua).", "Con un batidor de mano eléctrico, mezcle a alta velocidad durante 5 minutos o hasta que esté brillante y espeso. Retirar del fuego y batir durante 2 minutos, o hasta que se enfríe a temperatura ambiente.", "Ahora agregue rápidamente la mantequilla un cubo a la vez hasta que haya agotado todo. La mezcla puede parecer bastante suelta y dividida, pero no se alarme: siga latiendo hasta que se enfríe, espese y se una. Batir el batido de fresa en polvo hasta que esté bien incorporado.", "Una vez que la torta se haya enfriado por completo, recorte la parte superior y los lados si es necesario para que el rectángulo quede limpio y plano. Voltea la tarta boca abajo en un tarta de pastel o ponte de pie.", "Coloque la mitad de la crema de mantequilla en una manga pastelera con una boquilla grande de punta redonda unida y colocada a un lado. Con la crema de mantequilla restante cubra los lados de la torta usando una espátula compensada.", "Haga picos altos alrededor del borde superior del pastel. Dispersa las chispas sobre el centro. Decora la parte superior de algunos de los picos de formación de hielo con galletas sándwich a la mitad."], "url": "www_bbc_co_uk_food_recipes_funfetti_strawberry_03188", "title": "Pastel de cumpleaños Funfetti fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/funfetti_strawberry_03188_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "50ml / 2fl oz de aceite vegetal", "30ml / 1¼fl oz de jugo de naranja", "Remolacha cocida 100g / 3½oz, secada con papel de cocina, rallado", "100g / 3½oz de harina integral", "1 cucharadita de polvo de hornear", "3 cucharadas de azúcar en polvo", "50 g / 2 oz de semillas de girasol", "1 cucharadita de especias mixtas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para muffins de 6 orificios con cajas de papel.", "En un tazón grande, bata el huevo, el aceite y el jugo de naranja hasta que estén bien combinados. Agregue la remolacha rallada.", "En un tazón para mezclar por separado, mezcle la harina, el polvo de hornear, el azúcar, las semillas de girasol y la mezcla de especias hasta que estén bien combinados.", "Agregue los ingredientes húmedos a los ingredientes secos una cucharada a la vez, mezclándolos bien después de cada adición.", "Divida la mezcla de muffins por igual entre los seis casos de muffins. Hornee en el horno durante 20-25 minutos o hasta que los panecillos estén cocidos (una brocheta insertada en el centro debe salir limpia). Dejar de lado para enfriar, luego servir."], "url": "www_bbc_co_uk_food_recipes_funky_beet_muffins_24134", "title": "Muffins de remolacha cobardes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 muffins grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla", "1 diente de ajo, aplastado", "160g / 5½oz de panceta, más o menos picada", "Nueces 150g / 5oz (peso sin cáscara), más o menos picadas", "1 huevo de gallinas camperas, golpeado", "150ml / 5fl oz de crema individual", "Fusilli fusilli 300 g / 11 oz", "sal y pimienta negra recién molida", "queso de oveja recién rallado (opcional)", "hojas de tomillo, para adornar (opcional)"], "method": ["Llevar a ebullición una cacerola grande de agua ligeramente salada.", "Mientras tanto, derrita la mantequilla en una sartén grande, agregue el ajo y saltee durante 1-2 minutos, o hasta que esté dorado. Retire el diente de ajo y deseche.", "Agregue la panceta y las nueces a la sartén y saltee durante 3-4 minutos, hasta que la panceta se ponga dorada, teniendo cuidado de no quemar las nueces.", "En un tazón, mezcle el huevo batido y la crema individual.", "Cocine el fusilli de acuerdo con las instrucciones del paquete, hasta que esté al dente, luego drene.", "Agregue la pasta a la mezcla de nuez y panceta, luego agregue la mezcla de huevo y crema. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva inmediatamente en tazones calientes. Termine con queso de oveja recién rallado y adorne con un par de hojas de tomillo (opcional)."], "url": "www_bbc_co_uk_food_recipes_fusilliconlenocifusi_84340", "title": "Fusilli con nueces (fusilli con nueces)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema de coco 225g / 8oz", "300g / 10½oz de salsa de maní simple", "1 pimiento rojo, asado, pelado y en rodajas", "1 manojo de judías verdes, cortadas y cocidas", "8 patatas nuevas, peladas y cocidas y descuartizadas longitudinalmente", "1 mango verde, cortado en porras", "1 taza de brotes de soja", "1 aguacate, rebanado longitudinalmente", "1 lechuga iceberg cortada en rodajas"], "method": ["Caliente la crema de coco hasta que se disuelva y agregue la salsa de maní.", "Transfiera la salsa a un tazón y sirva con la selección anterior de verduras cocidas y crudas en el lado", "Las verduras y la salsa se pueden envolver en las hojas de lechuga y se comen como una envoltura."], "url": "www_bbc_co_uk_food_recipes_gadogadoindonesianve_71808", "title": "Gado gado ensalada de verduras indonesia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 huevos de codorniz", "4 salchichas de cerdo (alrededor de 250 g / 9 oz)", "200 g / 7 oz de carne picada de cerdo", "2 lonchas de tocino rayado sin corteza, cortadas en trozos de 1cm / ½ en trozos", "½ cucharadita de jengibre molido", "½ cucharadita de maceta de tierra", "pimienta negra recién molida", "1 cucharada de harina normal, para quitar el polvo", "Harina normal de 225 g / 8oz, más extra para enrollar", "½ cucharadita de pimienta negra recién molida", "25g / 1oz de mantequilla fría, cortada en cubos, más extra para engrasar la terrina", "75 g / 2½ oz de manteca fría, cortada en cubos", "1 cucharadita de sal marina en copos", "1 huevo mediano de granja, batido, para glasear"], "method": ["Llene a la mitad una cacerola con agua fría y llévela a ebullición. Con cuidado, agregue los huevos de codorniz al agua hirviendo y deje hervir durante 2 minutos y medio. Escurra los huevos a través de un tamiz y enjuague con agua corriente hasta que estén completamente fríos. Deja hasta que se complete el llenado.", "Exprime las salchichas de sus pieles y dentro de un tazón grande. Agregue las piezas de tocino, carne picada de cerdo, jengibre y macis. Sazonar con abundante pimienta negra recién molida. Mezcle con sus manos hasta que esté bien combinado. Divida la mezcla en dos porciones. Pele suavemente las cáscaras de los huevos, teniendo cuidado de mantener los huevos lo más completos posible. Poner en un tazón y mezcle ligeramente con la harina hasta que esté ligeramente cubierto. Esto evitará que estén demasiado resbaladizas cuando se pongan en el relleno.", "Precaliente el horno a 200 ° C / 180 ° C (ventilador) / Gas 6. Cubra una bandeja grande de metal para hornear con pergamino para hornear. Si no tiene una bandeja completamente plana, voltee la bandeja de hornear.", "Para la masa, coloque la harina y la pimienta en un procesador de alimentos con la mantequilla y 25 g / 1 oz de la manteca de cerdo. Use la configuración de pulso para mezclar hasta que la mezcla se asemeje a migas de pan gruesas.", "Coloque la manteca restante, cuatro cucharadas de agua fría y sal en una olla pequeña. Deje que hierva a fuego lento, luego agregue a la mezcla de harina con el motor en marcha y mezcle hasta que la masa se una. Poner en una superficie enharinada y amasar ligeramente para hacer una pasta suave y flexible", "Espolvorea la lata forrada de pergamino con harina. Forme la masa en un bloque rectangular y colóquela en la bandeja para hornear. Espolvoree un rodillo con harina y extienda la masa hasta que tenga alrededor de 6 mm de grosor y haga un rectángulo de 30 x 28 cm / 12 x 11 pulgadas. Tendrá que voltear la masa un par de veces para hacerla girar al tamaño correcto, trabajando bastante rápido, antes de que la masa tenga la posibilidad de endurecerse.", "Coloque la mitad de la mezcla de cerdo longitudinalmente en el centro de la masa, dejando un borde de 1.5cm / ¾in en cada extremo. El cerdo debe tener aproximadamente 25 cm de largo y 10 cm de ancho. Cubra con los huevos enharinados, de pie en sus extremos y corriendo uno junto al otro a lo largo de la masa. Cubra con la mezcla de cerdo restante, asegurándose de que todos los huevos estén completamente cerrados, y presione ligeramente hacia abajo.", "Cepille ligeramente uno de los largos bordes de la masa con huevo batido y ponga ambos lados en el medio para cubrir el relleno. (Puede que necesite usar el pergamino para hornear para ayudar a levantar la pasta.) Presione los bordes muy firmemente para sellar y recortar la parte superior con un juego de tijeras de cocina, dejando 1 cm / ½ pulgada o más para la cresta. Engarce el borde superior en una línea ondulada en la parte superior del pastel.", "Cepille el paquete de pastelería de forma pareja con huevo batido y hornee durante 15 minutos. Saque del horno y cepille con más huevo batido. El huevo batido también ayudará a reparar cualquier grieta, si tiene alguna. Vuelva al horno por otros 15 minutos o hasta que el pastel esté dorado y la masa y el relleno estén completamente cocidos. Deja enfriar."], "url": "www_bbc_co_uk_food_recipes_gala_picnic_pie_60853", "title": "Pastel de picnic Gala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal, derretida, más extra para engrasar", "3 huevos de gallinas camperas, separados", "125 g / 4½ oz de azúcar en polvo de oro", "½ cucharadita de extracto de vainilla", "90 g / 3¼ oz de sémola", "1 litro / 1¾ pinta de leche entera, calentada", "7 hojas de pasta filo", "3 naranjas", "440 g / 15½ oz de azúcar en polvo", "2 cucharadas de jugo de limón"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase ligeramente una lata de torta con forma de resorte de 20 cm / 8 pulg.", "En un tazón grande, mezcle las yemas de huevo, el azúcar impalpable y el extracto de vainilla con un batidor eléctrico hasta que estén pálidos y cremosos. Poco a poco golpee la sémola y la leche calentada. Ponga esta mezcla en una olla limpia y cocine a fuego lento durante 10 minutos hasta que espese, revolviendo constantemente.", "En un tazón limpio, bata las claras de huevo con un batidor eléctrico hasta que se formen picos rígidos pero no secos cuando se quita el batidor. Afloja la crema de sémola con una cucharada de claras de huevo, luego dobla el resto.", "Cepille cada hoja de masa de filo con la mantequilla derretida y coloque en la lata de forma de resorte, alternando la dirección en que el exceso caerá sobre los lados (no la recorte), hasta que haya usado 6 hojas.", "Vierta la mezcla de crema en la lata revestida de pastelería y doble las hojas colgantes sobre la parte superior, metiendo los extremos. Coloque la última hoja de filo, untada con mantequilla y doblada por la mitad, en la parte superior. Meta los lados y unte la parte superior.", "Hornee durante 45-50 minutos hasta que la mezcla de natillas se haya solidificado. Verifique después de 30 minutos y cúbralo con papel de aluminio si la parte superior se está poniendo marrón.", "Rallar las naranjas, pelarlas y cortar la fruta en rodajas finas, eliminando el exceso de médula.", "Caliente el azúcar impalpable y 190ml / 6¾fl oz de agua en una sartén. Cuando el azúcar se haya disuelto, agregue la ralladura de naranja y el jugo de limón y cocine a fuego lento durante 8-10 minutos hasta que tenga un jarabe espeso. Agregue las rodajas de naranja al almíbar y deje a un lado.", "Permita que el pastel se enfríe a temperatura ambiente antes de soltarlo del molde. Cortar en rodajas con un cuchillo de sierra y servir con las naranjas en almíbar."], "url": "www_bbc_co_uk_food_recipes_galaktoboureko_with_27774", "title": "Galaktoboureko con jarabe de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/galaktoboureko_with_27774_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "buena pizca de sal marina fina", "1 cucharadita de polvo de hornear", "4 cucharadas de aceite de oliva, más extra para engrasar", "1 huevo mediano, golpeado", "125ml / 4fl oz de agua", "1 huevo, batido, para sellar y glasear", "2 cucharadas de aceite de oliva", "1 cebolla grande, finamente picada", "1 pimiento verde, cortado a la mitad, sin semillas y cortado en tiras finas", "1 pimiento rojo, cortado a la mitad, sin semillas y cortado en tiras finas", "Conchas de peregrino sin cáscara de 150 g / 5½ onzas, secadas con papel de cocina y cortadas en tiras de 5 mm / ¼ pulgadas", "200g / 7oz de jamón cocido grueso rebanado, cortado en cubos de 1cm / ½ en cubitos", "4 cucharadas de perejil fresco de hoja plana, picado", "1 limón, jugo recién exprimido", "1 cucharadita de sal marina fina", "½ cucharadita de pimienta negra molida"], "method": ["Para hacer la masa, coloque la harina, la sal y el polvo de hornear en un bol y haga un pozo en el centro. Agregue el aceite y el huevo batido e incorpore gradualmente la harina en el líquido. Comience a agregar el agua un poco cada vez hasta que la mezcla forme una masa ligeramente pegajosa (pero no mojada) y elástica, es posible que no necesite toda el agua según el tamaño del huevo que esté usando. Junta la masa con tus manos. Ponlo en un plato, espolvoréalo con un poco de harina, cúbrelo con una película adhesiva y déjalo enfriar en la nevera durante 30-60 minutos.", "Para hacer el relleno, caliente el aceite en una sartén y fríe la cebolla hasta que esté suave pero no coloreada, revolviendo regularmente. Agregue los pimientos y cocine durante 3 minutos, revuelva, agregue las vieiras y fría por 30 segundos, revolviendo constantemente. Saque la sartén del fuego, agregue rápidamente el jamón, el perejil, el jugo de limón, la sal y la pimienta y mezcle todo junto. Deja enfriar por 20-30 minutos.", "Precaliente el horno a 200C / 400F / Gas 6 y engrase ligeramente una bandeja para hornear.", "Pese la masa y divida el peso por 5. Haga rodar dos quintas partes de la masa en una bola y póngala a un lado. Forma el resto en una bola un poco más grande. Estire la bola de masa más grande hasta que forme un círculo del tamaño aproximado de un plato y colóquelo en la bandeja para hornear ligeramente engrasada. Coloque el relleno enfriado en el centro de la masa y extiéndalo hacia el borde, dejando un borde de 2 cm / 1 pulgada alrededor. Cepille el borde ligeramente con huevo batido.", "Extienda la masa restante un poco más pequeña que la base de la tarta y colóquela suavemente sobre el relleno. Traiga la base hacia arriba para que coincida con el disco de pastelería más pequeño y pliéguelo, presionando y engarzando en forma de cuerda para hacer un borde de pastelería sellado.", "Cepille la masa con huevo batido y haga un par de pequeñas aberturas en la parte superior para permitir que salga el vapor.", "Hornee en el centro del horno durante 20-25 minutos hasta que la masa esté dorada y el relleno esté caliente.", "Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_galician_pie_empanada_98891", "title": "Galician pie (Empanada Gallega)", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Muslos de pollo deshuesados, sin piel, 450 g / 1 lb, cortados en piezas de 2.5 cm / 1 in", "1½ cucharada de salsa ligera de soja", "2 cucharadas de vino blanco", "2 cucharaditas de sal", "2 cucharaditas de aceite de sésamo", "2 cucharadas de harina de maíz", "1½ cucharadas de aceite de oliva", "1 cucharada de jengibre fresco de raíz finamente picado", "2 cucharaditas de ajo finamente picado", "1 cucharada de salsa de soja ligera", "1 cucharada de salsa de soja oscura", "1 cucharada de vino de arroz Shaoxing o jerez seco", "3 cucharadas de pasta de curry Madrás o polvo de curry", "1 cucharada de cúrcuma", "1 cucharadita de sal", "1 x 400 ml de leche de coco de estaño", "200ml / 7fl oz de caldo de pollo", "Zanahorias de 250g / 9oz, cortadas en piezas de 5cm / 2in", "Papas de 250 g / 9 oz, peladas y cortadas en trozos grandes", "1 cebolla picada", "2 tomates, picados", "50g / 1¾oz de chorizo ​​para cocinar, rebanado", "2 hojas de laurel", "sal y pimienta blanca recién molida, al gusto", "2 cucharadas de coco desecado", "100g / 3½oz de aceitunas negras"], "method": ["Para el adobo, combine el pollo con los ingredientes del adobo en un tazón grande y mezcle bien. Déjalo marinar durante una hora en la nevera.", "Después de una hora, drene el pollo y reserve el adobo.", "Para la galinha à Portuguesa, caliente un wok o una sartén grande a fuego alto y luego agregue el aceite de oliva. Cuando el aceite esté caliente y ligeramente humeante, agregue el jengibre y el ajo y saltee por 20 segundos. Agregue el pollo y saltee por 3 minutos o hasta que el pollo esté ligeramente dorado.", "Transfiera el contenido del wok a una cacerola grande, luego agregue el resto de los ingredientes galinha à Portuguesa, incluido el adobo reservado, y llévelo a ebullición. Baje el fuego y cocine a fuego lento durante 20 minutos.", "Adorne con el coco y las aceitunas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_galinha__portuguesa_35227", "title": "El pollo portugués", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de garbanzo o harina común", "½ cucharadita de sal", "½ cucharadita de pimienta de cayena", "4 gambas de tigre crudas, conchas eliminadas, desvainadas", "1 cucharada de aceite de oliva", "1 puñado de perejil fresco picado", "1 puñado de cilantro fresco picado", "1 puñado de perifollo fresco picado", "1 lima, cortada a la mitad"], "method": ["Mezcle la harina, la sal y la pimienta de cayena en un tazón. Dragar las gambas en la mezcla de harina para cubrir.", "Calentar el aceite en una sartén a fuego medio. Freír las gambas durante 4-5 minutos, o hasta que se hayan puesto rosadas.", "Para servir, espolvorea las hierbas en un plato para servir y coloca las gambas encima de ellas. Adorne con las mitades de lima."], "url": "www_bbc_co_uk_food_recipes_gamberonesfritti_89450", "title": "Gamberones fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz juego mixto en cubitos, como perdiz, faisán, paleta de cerdo, venado, conejo y liebre", "4 cucharadas de aceite de oliva", "1 cebolla, cortada en cubitos", "4 palitos de apio, cortados en cubitos", "1 diente de ajo, finamente picado", "algunas ramitas de estragón fresco, hojas picadas", "algunas ramitas de perejil fresco, hojas picadas", "1 hoja de laurel", "ramita de tomillo fresco", "2 puñados de setas Brown Paris, en cubitos", "2 cucharadas de harina normal", "100ml / 3½oz Madera", "100 ml / 3½ oz de vino tinto", "Puerto 150ml / 5½oz", "500ml / 1lb 2 oz de caldo de carne", "4 rebanadas de jamón de Parma, en rodajas finas", "450 g / 1 libra de masa de copos de brisa lista", "1 huevo de gallinas camperas, ligeramente golpeado", "mantequilla perilla", "1 repollo Savoy medio, hojas desmenuzadas,", "2 cucharadas de perejil recién picado"], "method": ["Calentar el aceite de oliva en una sartén y freír la carne para dorarla por completo. Retire de la sartén y reserve.", "Agregue la cebolla y el apio y cocine durante 10 minutos, o hasta que se ablanden.", "Agregue el ajo, hierbas y champiñones. Cocine por otros cinco minutos. Agregue la carne a la sartén, junto con la harina y cocine durante unos minutos.", "Vierta en el Madeira y cocine hasta que se reduzca a la mitad del volumen. Agregue el vino tinto y luego el puerto. Cocine hasta que esté reducido a menos de la mitad. Agregue el caldo y cocine a fuego lento durante 1-2 horas, hasta que la carne esté tierna. Agregue el jamón de Parma.", "Incline la mezcla en un molde para pastel de 22-24 cm / 8½-9½ pulgadas y extienda la masa de pasta líquida.", "Corta una tapa de pastel para el plato de pastel y una tira de hojaldre lo suficientemente grande como para cubrir el borde del plato para pastel en todos los sentidos. Cepille el borde del plato con agua, presione la tira en la parte superior y luego cubra el pastel con la tapa. Engarce, usando un dedo para empujar la masa hacia el exterior del plato. Pellizque alrededor de ese dedo con el dedo y el pulgar de la otra mano. Cepillar con huevo y enfriar durante diez minutos en la nevera. Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cocine el pastel durante 25-30 minutos hasta que esté dorado.", "Para servir, caliente una sartén grande y agregue la mantequilla. Incline el repollo y cocine por 2-3 minutos y luego espolvoree sobre el perejil.", "Corta una porción del pastel y sírvelo con el repollo."], "url": "www_bbc_co_uk_food_recipes_game_pie_38689", "title": "Pastel de juego", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]