[{"isVegetarian": false, "title": "Honey and mustard glazed chicken salad with olive oil and balsamic dressing", "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_87339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "½ chicken breast, skin removed, sliced into strips", "½ red onion, sliced into thin wedges", "2 tbsp clear honey", "1 tbsp Dijon mustard", "85g/3½oz fresh rocket leaves", "balsamic vinegar, for drizzling"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the olive oil in a frying pan. Fry the chicken for 5-6 minutes, until golden-brown and cooked through, and then transfer to a plate. ", "Fry the onion in the pan until soft. ", "Mix the honey and mustard together in a large bowl. Add the rocket to the bowl along with the chicken and onion. Toss together and drizzle with a little balsamic vinegar. ", "Place onto a large serving plate and serve."]}, {"isVegetarian": false, "title": "Honey and sesame beef skewers with balsamic glazed chicory", "url": "www_bbc_co_uk_food_recipes_honeyandsesamebeefsk_87036", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz sirloin steak, sliced into 1cm/¼in strips", "1 tbsp olive oil", "salt and freshly ground black pepper", "wooden skewers", "1 tbsp clear honey", "2 tsp sesame seeds", "1 head chicory, halved", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef skewers, place the steak in a small bowl, drizzle with the olive oil and season with salt and freshly ground black pepper. ", "Thread the beef strips onto the skewers.", "Heat a non-stick frying pan and fry the beef strips for two minutes.", "Drizzle the honey and sprinkle the sesame seeds over the skewers and fry for a further two minutes until glazed and cooked through.", "For the glazed chicory, heat a frying pan until hot. Drizzle the chicory halves with the olive oil and place, cut-side down, in the frying pan for two minutes on each side.", "Add the balsamic vinegar to the pan and cook for a further two minutes on each side, or until wilting.", "To serve, place the chicory alongside the beef skewers on a serving plate and garnish with the chervil."]}, {"isVegetarian": false, "title": "Honey and sesame beef with coriander, mint and lime noodle salad", "url": "www_bbc_co_uk_food_recipes_honeyandsesamebeefwi_88638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz fillet steak, cut into chunks", "2 tbsp sesame seeds", "1 lime, juice and zest only", "2 garlic cloves, finely chopped", "2 tbsp honey", "½ yellow Scotch Bonnet chilli, finely sliced", "1 tbsp vegetable oil", "85g/3oz rice noodles, cooked", "1 lime, juice and zest only", "2 tbsp soy sauce", "2 tbsp chopped fresh mint", "2 tbsp chopped fresh coriander", "4 asparagus spears", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the honey and sesame beef, place all the ingredients, except the oil, into a bowl and stir well to coat the beef. Set aside to marinate for 5-10 minutes, or longer if possible.", "Heat the vegetable oil in a wok or frying pan and stir fry the marinated beef for 3-4 minutes, or until cooked through.", "For the noodle salad, cook the rice noodles according to packet instructions and refresh under cold running water. Drain, then place into a bowl. Add the remaining salad ingredients to the bowl and stir well.", "For the roasted asparagus, place the asparagus onto a baking sheet, drizzle over the oil and season, to taste, with salt and freshly ground black pepper. Place into the oven and roast for 8-10 minutes, until lightly charred and tender.", "To serve, place the noodles in the centre of a serving plate and arrange the beef on top. Garnish with the roasted asparagus spears."]}, {"isVegetarian": false, "title": "Honey and sesame chicken skewers with griddled squash and spicy curly kale", "url": "www_bbc_co_uk_food_recipes_honeyandsesamechicke_82108", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, skinned and cut into 1in cubes", "salt and freshly ground black pepper", "1 tbsp honey", "1½ tbsp sesame seeds", "1 tbsp olive oil", "1 tbsp olive oil", "½ butternut squash, par-boiled for 5 minutes and drained", "salt and freshly ground black pepper", "1 tbsp olive oil", "3 spring onions, finely chopped", "125g/4½oz curly kale, chopped", "3tbsp white wine", "1 tbsp dried chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the chicken skewers, season the chicken pieces with salt and freshly ground plack pepper.  Thread the chicken pieces onto two or three skewers. Drizzle with honey, sprinkle with sesame seeds and finally drizzle with olive oil. ", "Heat a griddle pan until smoking hot and add the chicken skewers. Cook for 4-5 minutes, turning frequently until they are golden brown all over and the chicken is cooked through. ", "To make the griddled butternut squash, cut the squash into cubes, brush the squash with olive oil and season well with salt and freshly ground black pepper. Heat a griddle pan until smoking hot and cook for 3 minutes on each side, until tender.", "To make the spicy curly kale, heat the olive oil in a sauté pan and add the spring onions. Cook gently until softened slightly, add the curly kale and cook for another minute, stirring frequently. ", "Add the white wine, chilli flakes, salt and freshly ground black pepper and leave to cook for five minutes or until all the liquid has been absorbed.", "To serve, put a large pile of spicy curly kale on a large plate, top with the chicken skewers and place the griddled butternut squash on the side."]}, {"isVegetarian": true, "title": "Honey and soy glazed Quorn with spinach and peppers and cheese crisp", "url": "www_bbc_co_uk_food_recipes_honeyandsoyglazedquo_88852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz Wensleydale cheese, grated", "2 tbsp soy sauce", "2 tbsp clear honey", "300g/10½oz Quorn 'chicken' pieces", "dash olive oil", "½ yellow pepper, sliced", "1 tomato, chopped", "small handful spinach", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheese crisp, sprinkle the grated cheese into a small non-stick frying pan and fry until melted and turning slightly crisp. Carefully remove from the pan and mould around a rolling pin to create a curled shape. Leave to cool.", "For the Quorn, place the soy sauce, honey and Quorn into a small bowl, stir well and leave to marinate for ten minutes. Drain, reserving the marinating liquid.", "Heat the olive oil in a wok and fry the Quorn for 2-3 minutes, or until golden-brown. Add the pepper and tomato and cook for 2-3 minutes, then add the marinating liquid and spinach. Season, to taste, with salt and freshly ground black pepper. Cook for a further 1-2 minutes, then spoon into a serving bowl. ", "To serve, top the glazed Quorn with the cheesy crisp."]}, {"isVegetarian": false, "title": "Honey and soy-roasted pork with cashew nut crust on pineapple 'carpaccio' and crisp cabbage", "url": "www_bbc_co_uk_food_recipes_honeyandsoyroastedpo_85573", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz pork tenderloin", "salt and freshly ground black pepper ", "2 tbsp olive oil", "1 garlic clove, lightly crushed", "1 tbsp soy sauce", "1 tbsp honey", "85g/3oz cashew nuts, crushed", "300ml/10fl oz vegetable oil, for deep frying", "¼ savoy cabbage, very finely sliced", "½ pineapple, peeled and very thinly sliced", "1 orange, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the honey and soy-roasted pork, season the pork all over with salt and freshly ground black pepper. Heat the oil in an ovenproof frying pan, add the pork and garlic and fry the pork, turning frequently, until lightly browned on all sides. Transfer the frying pan to the oven and cook the pork for five minutes, or until almost cooked through.", "Remove the pan from the oven and put back on the heat. Add the soy sauce and honey to the pan and fry for one minute. Remove the pork from the pan and roll in the crushed cashew nuts to coat on all sides. Return to the pan and fry for one minute on each side, then set aside to rest in a warm place.", "For the crisp cabbage, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the sliced cabbage into the oil and deep fry for 2-3 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To serve, place the pineapple slices onto a serving plate. Slice the pork and place it on top of the pineapple 'carpaccio'. Top with the crisp cabbage and garnish with orange wedges."]}, {"isVegetarian": false, "title": "Honey and walnut cream with apple and quince slice", "url": "www_bbc_co_uk_food_recipes_honeyandwalnutcreamw_83885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz double cream", "25g/1oz diced walnuts", "3 tbsp clear honey", "450g/1lb ready made puff pastry", "50g/2oz melted butter", "110g/4oz quince jelly", "6 golden delicious apples, peeled, cored and cut into thin slices", "25g/1oz caster sugar", "4 sprigs mint, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl whip the cream with an electric whisk until thick. Fold in the walnuts and honey, and place in the fridge.  ", "Preheat the oven to 200C/400F/Gas 6.", "Roll out the puff pastry thinly and prick the surface with a fork.", "Cut out four rectangles sized 10cm/4in by 20cm/8in.", "Place the rectangles onto a non-stick greased baking tray.  ", "Lightly brush the edges of the tarts with a little of the melted butter and spread the quince jelly on the middle. ", "Layer on the apple slices.", "Drizzle the top with most of the remaining melted butter and sprinkle with the  sugar.", "Place in the oven for 5-6 minutes until golden brown.  ", "Remove the slices from the oven and glaze with a little of the remaining butter.  ", "Place on the plates and serve with a spoonful of the honey and walnut cream."]}, {"isVegetarian": true, "title": "Honey and whisky porridge", "url": "www_bbc_co_uk_food_recipes_honeyandwhiskyporrid_85195", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz porridge oats", "3 tbsp double cream, plus extra to serve", "250ml/9fl oz milk", "1 tbsp soft brown sugar", "dash whisky", "1 tbsp clear honey, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oats, cream, milk, sugar and whisky into a small saucepan and cook over a gentle heat for 6-7 minutes, until thickened and smooth. ", "To serve, pour the porridge into a bowl and drizzle with honey and cream."]}, {"isVegetarian": false, "title": "Honey-baked chicken with hoi sin plantain and wilted garlic stems", "url": "www_bbc_co_uk_food_recipes_honeybakedchickenwit_83880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 skinless, boneless chicken breasts", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 tbsp butter", "1 plantain, peeled and sliced lengthways", "1 tbsp ground cinnamon", "40g/1½oz hoi sin sauce from a jar", "110g/4oz wild garlic stem or garlic chives, blanched for 15 seconds then refreshed", "20g/¾oz honey"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the chicken breast with salt and freshly ground black pepper.", "Heat an oven-proof frying pan until hot, then add the olive oil and half the butter.", "When the butter is foaming add the chicken and fry, turning once, until golden-brown on both sides.", "Transfer to the oven to roast for 10-12 minutes, or until completely cooked through. Remove from the oven and leave to rest in a warm place for five minutes.", "For the plantain, heat a frying pan until hot, then add the remaining butter.", "Dust the plantain with cinnamon and place into the frying pan to fry for 1-2 minutes on each side, until golden and tender.", "To serve, place the wilted garlic stem onto one side of the plate. Place the plantain in the centre of the plate. Drizzle with hoi sin sauce.", "Slice the chicken into three pieces on the diagonal and place it across the plantain. Finish by drizzling the honey over the chicken."]}, {"isVegetarian": false, "title": "Honey and za'atar-glazed spring lamb with salsify and wild garlic purée", "url": "www_bbc_co_uk_food_recipes_honeyandzaatarglazed_91314", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp dried thyme leaves", "2 tsp dried oregano", "pinch ground sumac (available from Middle Eastern stores)", "½ tsp toasted sesame seeds ", "pinch red chilli flakes", "pinch sea salt", "1 tsp ground cumin", "2 tbsp finely grated fresh root ginger", "3 tbsp clear honey", "4 x 125g/4½oz spring lamb tenderloin, trimmed", "4 tbsp butter", "300g/11oz salsify, peeled and chopped (keep in a bowl of acidulated water to prevent browning)", "110ml/4fl oz water", "200ml/7fl oz milk", "salt and freshly ground black pepper", "25g/1oz butter", "2 tbsp thick double cream", "1 tbsp olive oil", "4-5 tbsp wild garlic leaves, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the za'atar, mix together all of the za'atar ingredients in a small bowl until well combined.", "For the lamb, add the cumin, ginger and honey to the za'atar mixture and mix until well combined. Rub the mixture all over the lamb tenderloin. ", "Heat the butter in a frying pan over a medium heat. Add the lamb and fry for 6-8 minutes on each side (for medium), or until cooked to your liking. Remove the lamb from the pan and set aside to rest on a warm plate. Reserve any cooking juices left behind in the pan. ", "For the salsify and wild garlic purée, drain the salsify and place into a pan. Pour over the water and milk and season with salt and freshly ground black pepper. Bring to the boil. Reduce the heat until the mixture is simmering and cook for 20 minutes, or until the salsify is tender. Drain, then place the salsify into a food processor with the butter and cream and blend until smooth. ", "Heat the oil in a a frying pan until smoking, add the wild garlic leaves and fry for 1-2 minutes, or until just wilted. Stir the wild garlic into the salsify purée and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the salsify and wild garlic purée onto four serving plates. Carve the lamb into thick slices and arrange alongside the purée, drizzling over some of the reserved pan juices."]}, {"isVegetarian": true, "title": "Honey-baked figs with Manchego cheese", "url": "www_bbc_co_uk_food_recipes_honeybakedfigswithma_87282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 fresh figs, stalks removed", "2 tbsp balsamic vinegar", "1 tbsp clear honey", "2 tsp chopped fresh thyme leaves", "salt and freshly ground black pepper", "30g/1oz Manchego cheese, grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Using a sharp knife, cut a cross into the top of each fig. Push the fig down on a chopping board to open it slightly, then place in a 25 x 25cm/10 x 10in square of foil. Spoon over the vinegar, honey and thyme and season with salt and freshly ground black pepper. Fold the foil over to make a parcel and seal the edges. ", "Place the parcel in a small frying pan over a medium heat and cook for 8-10 or until the figs have softened. Open the parcel and sprinkle with the cheese to serve."]}, {"isVegetarian": true, "title": "Honey cake", "url": "www_bbc_co_uk_food_recipes_honeycake_67599", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycake_67599_16x9.jpg", "ingredients": ["170g/6oz clear honey", "140g/5oz butter", "85g/3oz light muscovado sugar", "2 eggs, beaten", "200g/7oz self raising flour, sieved", "water", "55g/2oz icing sugar", "1 tbsp clear honey", "hot water"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 3 and butter and line the bottom of a 7in/18cm cake tin.", "Measure the honey, butter and sugar into a large pan.  Add a tablespoon of water and heat gently until melted.", "Remove from the heat and mix in the eggs and flour. ", "Spoon into the cake tin and bake for 40-45 minutes until the cake is springy to the touch and shrinking slightly from the sides of the tin.", "Cool slightly in the tin before turning out onto a wire rack.", "While the cake is still warm, make the icing by mixing the sugar and honey together with 2-3 teaspoons of hot water. Trickle over the cake in whatever design takes your fancy."]}, {"isVegetarian": true, "title": "Honey cheesecake", "url": "www_bbc_co_uk_food_recipes_honeycheesecake_80809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 ready-made sponge fingers ", "50g/2oz Greek yoghurt ", "100g/3½oz mascarpone ", "2 tbsp runny honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Line the base of a metal medium-size chefs' ring with the sponge fingers cut to size.", "In a bowl, mix the Greek yoghurt with the mascarpone and honey.", "Lay this mixture on top of the sponge fingers and smooth with a palette knife or spoon.", "Using a blow torch to warm the sides, release the cheesecake from the mould. Serve."]}, {"isVegetarian": false, "title": "Honey chicken skewers", "url": "www_bbc_co_uk_food_recipes_honeychickenskewers_87807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 skinless chicken breast, cut into chunks", "1 courgette, cut into chunks", "1 tbsp olive oil", "1 tbsp clear honey", "salt and freshly ground black pepper", "handful fresh flatleaf parsley leaves", "dash balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat an ovenproof griddle pan until very hot. Soak two bamboo skewers in water for a few minutes.", "Thread the chicken and courgette onto the bamboo skewers. Brush the griddle pan with a little of the oil and place the chicken skewers into the pan.", "Drizzle over most of the remaining oil. Season well with salt and freshly ground black pepper and griddle for a few minutes, turning frequently until lightly charred all over.", "Drizzle the honey over the skewers and transfer to the oven for 6-8 minutes, or until the chicken skewers are cooked through and lightly caramelised.", "Place the parsley leaves into a bowl and drizzle with the remaining oil and the balsamic vinegar.", "To serve, place the chicken skewers onto a warmed plate and scatter over the dressed herbs."]}, {"isVegetarian": true, "title": "Honeycomb", "url": "www_bbc_co_uk_food_recipes_honeycomb_80005", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycomb_80005_16x9.jpg", "ingredients": ["1tbsp vegetable oil, for oiling baking tray  ", "80g/3oz butter ", "160g/5½oz caster sugar ", "80g/3oz golden syrup ", "2 tsp bicarbonate of soda"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 20cm/8in square baking tin with vegetable oil.", "Gently heat the butter, sugar and golden syrup in a large heavy-based pan until the sugar has dissolved. Turn up the heat and boil rapidly, without stirring. If the mixture goes darker at one side of the mix, then gently swirl the pan to mix it all together. Keep boiling until the mixture goes a golden-brown colour – this will take about 5 minutes. ", "Add the bicarbonate of soda and stir it for a few seconds, which will make the mixture expand and fizz (take care, the mixture will expand a lot). Tip the honeycomb into the oiled baking tin and leave until cold and set. ", "To serve, cut the honeycomb into pieces and stir into ice creams or decorate puddings. You can put the honeycomb in a food processor and sprinkle it over desserts. "]}, {"isVegetarian": true, "title": "Honeycomb parfait", "url": "www_bbc_co_uk_food_recipes_honeycomb_parfait_95221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "50ml/2fl oz clear honey", "1 tbsp liquid glucose", "¾ tsp bicarbonate of soda", "oil, for greasing", "300g/11oz dark chocolate, roughly chopped", "3 free-range eggs, separated", "150g/5½oz caster sugar", "450ml/16fl oz double cream ", "2 vanilla pods, seeds removed"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the honeycomb, line a baking tray with a little oil and baking parchment. ", "Place the sugar, honey, glucose and 50ml/2fl oz water into a saucepan and bring to a boil. Continue to cook until the temperature reaches 160C/320F on a sugar thermometer.", "Remove from the heat and quickly beat in the bicarbonate of soda, stirring constantly. Pour the mixture onto the lined baking tray.", "Set aside until completely cool and then break into large pieces.", "Melt the chocolate in a bowl suspended over a pan of simmering water (do not allow the bottom of the bowl to touch the water), or in the microwave. ", "Line a baking tray with greaseproof paper.", "Dip each piece of honeycomb into the melted chocolate and then place onto the lined tray. Leave for one hour until the chocolate is set and hard.", "For the parfait, grease a loaf tin with a little vegetable oil and then line with two layers of cling film.", "In a clean mixing bowl, whisk the egg whites until soft peaks form when the whisk is removed. Gradually whisk in half of the sugar and continue to whisk until firm peaks are formed.", "Whisk the egg yolks and remaining sugar in a bowl over a pan of simmering water for about 5-6 minutes, or until the mixture thickens.", "Place the cream and scraped vanilla seeds into a separate bowl and whisk until soft peaks form when the whisk is removed from the bowl. ", "Gently fold the meringue, egg yolks and cream together in a bowl gently until just mixed together.", "Roughly chop the chocolate honeycomb and then fold it into the mixture, making sure it’s distributed evenly.", "Pour the mixture into the lined loaf tin and place in the freezer for at least for hours, or until firm.", "To serve, remove the parfait from the freezer and leave for one hour to soften slightly before slicing and serving."]}, {"isVegetarian": false, "title": "Honeycomb crunchies", "url": "www_bbc_co_uk_food_recipes_honeycomb_crunchies_45484", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycomb_crunchies_45484_16x9.jpg", "ingredients": ["1 tsp bicarbonate of soda", "75g/2½oz caster sugar", "2 tbsp golden syrup ", "flavourless oil (such as vegetable oil), for greasing", "250g/9oz dark or milk chocolate, or a mixture", "100g/3½oz unsalted butter, cut into 1cm cubes", "2 tbsp golden syrup", "150g/5½oz digestive biscuits"], "serves": "Makes 12-16 squares", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Make the honeycomb first. Have the bicarbonate of soda measured and ready for when you need it, plus a wire whisk and an oiled baking tray. Put the sugar and golden syrup into a saucepan and set it on a very low heat. Warm gently for 10 minutes until all the sugar has melted, stirring occasionally with the wooden spoon.  ", "When the sugar is completely melted, turn up the heat to medium. Once the mixture has started to boil, leave to bubble without stirring until it turns golden-brown.  ", "Turn off the heat under the pan. Cover one of your hands with a dry tea towel or oven glove for protection, then take hold of the pan handle. Add the bicarbonate of soda and quickly whisk it in for a couple of seconds only. The mixture will froth up massively and you need to take great care as it’s extremely hot. ", "Quickly pour it into the middle of the oiled baking tray. Don’t spread it out or touch it or the tray. Leave it to cool and harden, which will take about 30 minutes. Line a square 20.5cm/8in tin with baking paper.", "Use a rolling pin to break or bash up the chocolate into small pieces. Put them in a heatproof bowl and add the butter and golden syrup. Melt gently, over a pan of hot water, giving it a stir now and then. When the chocolate mixture is smooth, carefully lift the bowl off the pan and place it on a heatproof surface.", "Put the biscuits into a plastic food bag and use the rolling pin to break them up into chunks the size of your thumbnail. Bash up the set honeycomb into chunks roughly the same size. Add the biscuits and honeycomb to the melted chocolate and mix well so all the chunks are coated.  ", "Scoop the whole lot into the lined tin and spread it evenly, right into the corners. Cover with cling film, then chill in the fridge for about two hours, or until firm and set. Cut into 16 squares with a sharp knife. Store, tightly covered, in the fridge and eat within two days. "]}, {"isVegetarian": true, "title": "Honeycomb cheesecake", "url": "www_bbc_co_uk_food_recipes_honeycombcheesecake_76812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz double cream", "few drops of vanilla essence", "2 tbsp caster sugar", "110g/4oz cream cheese", "55g/2oz cinder toffee (also called honeycomb), broken into pieces"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Whip the cream with the vanilla essence and sugar in a large bowl, to thicken.", "Fold in the cream cheese to combine, and then stir in the cinder toffee.", "Spoon the mixture into a chefs ring, lined on a serving plate and smooth off the top using a palette knife. ", "Transfer to the fridge, and allow to set.", "Once chilled, remove from the fridge and remove the ring. Serve."]}, {"isVegetarian": true, "title": "Honeycomb fool", "url": "www_bbc_co_uk_food_recipes_honeycombfool_76811", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz double cream", "100g/3½oz cream cheese", "drop of vanilla essence", "2 tbsp caster sugar", "55g/2oz cinder toffee (also called honeycomb), crushed", "¼ mango, peeled and diced", "30g/1oz cinder toffee (also called honeycomb), crushed and toasted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly whip the cream in a large bowl, to thicken. Fold in the cream cheese with the vanilla essence and sugar, to combine.", "Carefully fold in the honeycomb and mango.", "Spoon the mixture into two serving bowls or glasses.", "Sprinkle the toasted honeycomb over, to serve."]}, {"isVegetarian": false, "title": "Honeyed crispy duck", "url": "www_bbc_co_uk_food_recipes_honeyedcrispyduck_67600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts", "2 tsp honey", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a frying pan large enough to fry the duck breasts side by side.", "Add the honey and allow to bubble gently.", "Season both sides of the duck breast. Place into the frying pan skin-side down and cook gently until crisp.", "Preheat  the oven 180C/350F/Gas 4.", "Place the duck breasts into a baking dish, skin side up. Bake for 8-10 minutes (longer if you want them well done).", "Remove from the oven and leave to one side to rest for a few minutes before serving."]}, {"isVegetarian": false, "title": "Grilled squid with noodles", "url": "www_bbc_co_uk_food_recipes_honeycombsquidwithno_82145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz squid, cleaned and cut into rings", "salt and freshly ground black pepper", "2 garlic cloves, finely chopped", "½ red chilli, finely chopped", "½ stalk lemongrass, finely chopped", "1 lime, juice only", "1 tbsp soy sauce", "2 tsp sesame oil", "100g/3½oz egg noodles, cooked and drained", "1 free-range egg, beaten", "1 tsp caster sugar", "2 tbsp chopped fresh coriander (reserve some for garnish)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the squid in olive oil and season with salt and freshly ground black pepper. ", "Heat a griddle pan until smoking hot, add the squid and cook for 1-2 minutes, shaking the pan continuously, until chargrilled on all sides. Remove from the heat and keep warm.", "Heat a little olive oil in a sauté pan, add the chilli, garlic and lemongrass and cook gently for one minute. ", "Add the lime juice, soy, sesame oil and egg noodles. Stir well, and then add the beaten egg and sugar. Cook for 1-2 minutes, stirring to coat the noodles in the egg. Stir in most of the coriander.", "To serve, place a pile of noodles on a plate and top with the squid. Garnish with the remaining coriander."]}, {"isVegetarian": false, "title": "Honeyed duck confit with crispy seaweed and creamy mash", "url": "www_bbc_co_uk_food_recipes_honeyedduckconfitwit_68106", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck legs, confited in their own fat, homemade or from a can or jar", "4 tbsp clear honey", "3 tbsp olive oil", "2-3 sprigs fresh thyme, leaves stripped", "310g/11oz mashing potatoes, peeled and chopped", "3 tbsp hot milk", "120ml/4fl oz red wine", "250ml/9fl oz chicken stock ", "55g/2oz crispy seaweed", "small knob butter", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make duck confit, take 2 duck legs and weigh them.  Measure 15g of salt per 1kg meat and sprinkle the salt with fresh thyme over the legs.  Store in a fridge for at least 12 hours.  Melt duck fat (available tinned from delis) in a pan over a low heat and bring to a simmer.  Place the chilled duck legs in the fat and cook very gently for 1½-2 hours, do not boil.  Take off the heat and leave to cool in the fat.", "Heat the oven to 180C/350F/Gas 4. Scrape the fat from the legs and place in a roasting pan.  (Reserve the fat - it's good for roast potatoes or frying eggs).", "Whisk together the honey and oil and smear over the duck legs.  Sprinkle over the thyme leaves.  Roast the legs in the oven for about 20 minutes, spooning the honey glaze over the legs 2-3 times. ", "Meanwhile, boil the potatoes in a pan of lightly salted water for about 15 minutes or until just tender.  Drain, then mash with a fork, gradually beating in the hot milk, butter and plenty of seasoning.", "Place the wine and stock into the saucepan, bring to the boil and continue boiling until reduced by two thirds. Season well.", "Spoon the mashed potato onto the centre of warm serving plates, sprinkle the seaweed around the mash and sit the duck legs on top.  Scrape any meaty bits from the roasting pan and sprinkle over, then pour over the reduced red wine sauce and serve immediately."]}, {"isVegetarian": true, "title": "Honeyed yoghurt with rosewater scented peaches", "url": "www_bbc_co_uk_food_recipes_honeyedyoghurtwithro_70433", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 20z caster sugar ", "1 tbsp rosewater ", "4 peaches ", "360ml/13oz Greek yoghurt", "3 tbsp honey"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the caster sugar and rose water in a pan with 1 litre/1¾ pints of water and bring to the boil. Cut a small cross in the top of each peach, then add to the pan and simmer for 5 minutes. Take the peaches out of the syrup and slip off the skins, then return to the syrup and cook for 10 minutes until the syrup has reduced by half. Strain and cool. ", "Make the honeyed yoghurt by mixing together the yoghurt and honey, then serve with the rose-scented peaches and drizzle over some of the remaining syrup."]}, {"isVegetarian": true, "title": "Honey flapjacks", "url": "www_bbc_co_uk_food_recipes_honeyflapjacks_73203", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeyflapjacks_73203_16x9.jpg", "ingredients": ["200g/7¼oz unsalted butter", "200g/7¼oz demerara sugar", "200g/7¼oz honey", "400g/14¼oz porridge oats", "50g/1¾oz nuts, dried fruits or glacé ginger, chopped or desiccated coconut (optional)", "You will also need a 20cm x 30cm (8in x 12in) cake tin, greased"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the butter, sugar and honey in a saucepan and heat, stirring occasionally, until the butter has melted and the sugar has dissolved. Add the oats and nuts, fruit, ginger or coconut, if using, and mix well.", "Transfer the oat mixture to the prepared cake tin and spread to about 2cm (¾in) thick. Smooth the surface with the back of a spoon. Bake in a preheated oven at 180C/350F/Gas 4 for 15-20 minutes, until lightly golden around the edges, but still slightly soft in the middle. Let cool in the tin, then turn out and cut into squares."]}, {"isVegetarian": true, "title": "Honey, garlic and red pepper dressing", "url": "www_bbc_co_uk_food_recipes_honeygarlicandredpep_67768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper, chopped", "2 garlic cloves, chopped", "4 tsp clear honey", "salt and pepper", "1 cup hot water", "olive oil, to blend"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat down the red pepper and garlic in a hot pan for 2-3 minutes.", "Add the honey and then the hot water, simmer for about 1 minute.", "Blend the mixture and slowly add the olive oil to a smooth sauce consistency. Pass the dressing through a sieve, season and use."]}]