[{"isVegetarian": false, "title": "Luxury fish pie", "url": "www_bbc_co_uk_food_recipes_luxuryfishpie_67647", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/luxuryfishpie_67647_16x9.jpg", "ingredients": ["900g/2lb baking potatoes, peeled and cut into chunks", "150ml/¼ pint single cream", "55g/2oz butter, plus extra for greasing", "salt and white pepper", "pinch freshly grated nutmeg", "225g/8oz skinless, boneless haddock fillet ", "450g/1lb salmon, cut from the tail piece, skinless and boneless", "squeeze lemon juice", "4 hard-boiled eggs, shells removed, quartered", "85g/3oz butter", "large bunch of parsley, leaves only, finely chopped", "30g/1oz plain flour", "570ml/1 pint milk", "splash of single cream, to taste"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in boiling salted water until soft.  ", "Drain well and mash. Add the cream and butter, then season with salt and pepper and nutmeg. Mix well until smooth and creamy. Taste, adding more seasoning if required, then set to one side.", "For the parsley sauce, heat the butter in a heavy-based pan over a very low heat then stir in the parsley. Cook for about ten minutes. ", "Add the flour and stir well. Cook, stirring regularly, for about three minutes. Do not let the mixture brown.", "In another pan, bring the milk to the boil. Pour this into the \"roux\" (the butter and flour mixture) a little at a time, whisking or beating after each addition until completely smooth. Whisk in single cream, to taste. Bring the sauce to the boil, then reduce the heat and simmer over a low heat for 5-6 minutes.", "While the sauce is cooking, pre-heat the oven to 200C/400F/Gas 6 and generously butter a deep ovenproof dish.", "Cut the haddock and salmon into serving piece, lay in the dish, season lightly and squeeze over a little lemon juice.  ", "Pour the hot parsley sauce over the top, place the quartered eggs evenly over the sauce and spoon over the mashed potatoes.", "Bake for 35-40 minutes, until the top is crisp and brown. Serve at once."]}, {"isVegetarian": true, "title": "Lychee drop scones with sautéed lychees and mango", "url": "www_bbc_co_uk_food_recipes_lycheedropsconeswith_92168", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz milk", "1 free-range egg", "50g/2oz caster sugar", "200g/7oz self-raising flour", "pinch salt", "110g/4oz fresh lychees, peeled, stones removed, finely chopped", "50g/2oz butter", "2 mangoes, peeled, stones removed, cut into chunks", "75g/3oz unsalted butter", "500g/1lb 2oz fresh lychees, peeled, stones removed, halved", "75g/3oz caster sugar", "vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the scones, place the milk, egg and sugar together in a bowl and whisk until well combined. ", "In a separate bowl, sieve in the flour and salt and make a well in the centre. Gradually pour in the milk, egg and sugar mixture, whisking until the mixture becomes a thick batter (you may not need all of the milk, egg and sugar mixture). ", "Stir in the lychees and mix well. ", "Heat a large frying pan or flat griddle pan until medium hot. Add half of the butter and swirl it around the pan to coat. When the butter is melted and foaming, drop spoonfuls of the scone mixture into the frying pan, making sure there is plenty of space between each spoonful. ", "Fry the drop scones for 2-3 minutes, or until bubbles begin to form on the surface of the batter. Carefully flip the drop scones over and cook for a further 1-2 minutes, or until golden-brown all over and cooked through. Remove and drain on kitchen paper. Repeat with the remaining scone batter, adding more of the remaining butter to the pan if necessary. ", "For the sautéed lychees and mango, place a third of the chopped mango into a food processor and blend to a smooth purée.", "Melt the butter in a frying pan until foaming, then add the remaining mango and lychees and fry for 1-2 minutes. Add the sugar to the pan and toss to coat, then fry for a further 2-3 minutes, or until the fruit begins to caramelise. Remove the fruit from the pan and set aside, then add the mango purée and stir to mix with the remaining caramelised sugar in the pan. ", "To serve, pile a few drop scones each onto four serving plates. Top with the sautéed lychees and mango and drizzle over some of the mango sauce. Serve immediately with a scoop of vanilla ice cream alongside."]}, {"isVegetarian": true, "title": "Ma’amoul", "url": "www_bbc_co_uk_food_recipes_maamoul_93602", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maamoul_93602_16x9.jpg", "ingredients": ["100g/3½oz butter or ghee", "350g/12oz fine semolina ", "100g/3½oz plain flour", "½ tsp fast action dried yeast", "2 tbsp caster sugar", "pinch salt", "2 tbsp orange blossom water", "130ml/5oz milk", "200g/7oz dates, roughly chopped", "25g/1oz butter", "½ tsp ground cinnamon", "½ tsp ground cardamom", "2 tbsp icing sugar, to serve"], "serves": "Makes 30", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough, melt the butter and pour into a food processor with the semolina, flour, yeast, sugar, salt. Pulse until the mixture has the texture of fine sand. ", "Add the orange blossom water and milk and blend until the mixture comes together to form a stiff dough. Transfer to a clean bowl, cover with a clean tea towel and leave to rest at room temperature for 1 hour.", "Meanwhile, to make the filling, place the dates, butter and spices in a saucepan with  50ml/2fl oz of water, and bring to the boil. Reduce the heat and stir for 4–5 minutes until a thick paste has formed. Remove from the heat and set aside to cool.", "Preheat the oven to 180C/160C Fan/Gas 4 and line a baking tray with baking paper.", "Break off walnut-sized balls of dough and flatten against a clean surface. Cup the flattened dough in your hand and stuff with a teaspoon of the date mixture. Fold the dough around the filling and seal. ", "If using a ma’amoul mould, press the filled dough into the cavity of the mould. Tap it sharply against a hard surface to release the shaped dough. If moulding free-hand, flatten the filled dough into a round and create an indentation in the centre with your thumb. If desired, use a sharp knife or cocktail stick to trace a pattern in the dough. ", "Continue to fill and shape the biscuits until all the dough and paste has been used. Place the rounds onto the tray and bake for 15 minutes until just cooked through. They should not colour and will harden as they cool.", "Transfer to a wire rack to cool completely. Dust with a little icing sugar before serving.  "]}, {"isVegetarian": false, "title": "Mac 'n' cheese", "url": "www_bbc_co_uk_food_recipes_mac_n_cheese_70611", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mac_n_cheese_70611_16x9.jpg", "ingredients": ["100g/3½oz butter, plus extra for greasing", "100g/3½oz plain flour", "1 tsp Dijon mustard", "1.2 litres/2 pints full-fat milk", "75ml/2½fl oz double cream", "1 bay leaf", "400g/14oz mature cheddar, grated", "pinch freshly grated nutmeg", "500g/1lb 2oz dried macaroni", "100g/3½oz smoked bacon lardons or smoked pancetta cubes", "60g/2¼oz white breadcrumbs", "50g/1¾oz Parmesan, grated", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and grease a 35x20cm/14x8in ovenproof dish..", "Melt the butter in a large saucepan over a low heat. Stir in the plain flour and cook for 1 minute. Add the mustard, take the pan off the heat and gradually whisk in the milk and cream. Add the bay leaf.", "Put the pan back over the heat, stirring constantly, until it boils and thickens. Take the pan off the heat again, remove the bay leaf and add the cheddar. Stir until the cheese has melted. Season with lots of black pepper and some nutmeg. ", "Bring a large pan of salted water to the boil and stir in the macaroni. Cook for 10 minutes, or until al dente, drain well and add to the sauce.", "Fry the bacon in a frying pan until crisp. Stir into the macaroni cheese and pour the mixture into the ovenproof dish. ", "Mix the breadcrumbs with the Parmesan and scatter over the top. Bake for 25–30 minutes, or until golden-brown and bubbling. Serve immediately."]}, {"isVegetarian": true, "title": "Macadamia nut brittle", "url": "www_bbc_co_uk_food_recipes_macadamianutbrittle_85003", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "150g/5½oz macadamia nuts, toasted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sugar in a saucepan for 4-5 minutes, until melted and turning golden-brown.", "Add the macadamia nuts, stir well and take the pan off the heat.", "Pour the mixture onto a non-stick baking sheet and leave to cool completely.", "To serve, break the brittle up into pieces."]}, {"isVegetarian": true, "title": "Macaroni cauliflower cheese", "url": "www_bbc_co_uk_food_recipes_macaroni_cauliflower_53315", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroni_cauliflower_53315_16x9.jpg", "ingredients": ["1 small cauliflower (approximately 775g/1¾lb), leaves and stalk removed, cut into florets", "250g/9oz dried macaroni or similar small pasta shapes", "50g/2oz butter, plus extra for greasing", "50g/2oz plain flour ", "500ml/17fl oz milk", "150g/5oz mature cheddar, finely grated", "salt (optional) and freshly ground black pepper "], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Lightly grease a 2 litre/3½ pint shallow ovenproof dish with butter. ", "Half fill a large saucepan with water and bring to the boil. Add the cauliflower florets and boil for 10-12 minutes, or until very soft. Drain and set aside.", "Half-fill the same pan with water and return to the boil. Add the macaroni and cook for 8-10 minutes, or until al dente. ", "Meanwhile, melt the butter in a saucepan over a low heat, then whisk in the flour until the mixture forms a smooth paste. Cook, whisking constantly, for 30 seconds. ", "Gradually whisk in the milk a little at a time, bringing the mixture to a gentle simmer and waiting for it to thicken after each addition. Continue to cook, stirring constantly, until all of the milk has been incorporated and the sauce has thickened enough to coat the back of a spoon (about 6-8 minutes).  ", "Stir in two-thirds of the cheese, then season with salt and pepper. ", "Add the cauliflower to the sauce, blend until smooth using a hand-held blender. Warm the mixture through gently, adding a little more seasoning or milk, as required. The finished sauce should have the consistency of pouring custard.", "Drain the pasta and transfer to the ovenproof dish. Pour over the sauce and stir to combine. Sprinkle over the remaining cheese. Bake for 20-25 minutes, or until the top is golden-brown and the sauce is bubbling."]}, {"isVegetarian": false, "title": "Macanese grilled prawns", "url": "www_bbc_co_uk_food_recipes_macanese_grilled_prawns_11527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4-6 large uncooked, unpeeled prawns", "5 tbsp olive oil", "3 tbsp garlic, finely chopped", "150g/5½oz onion, finely chopped\t", "2 tbsp finely chopped spring onions", "50g/1¾oz red chillies, finely chopped", "salt and freshly ground black pepper, to taste", "100g/3½oz cold butter, cut into small cubes", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 5.", "For the Macanese prawns, using a very sharp knife, carefully butterfly the prawns but cutting them in half horizontally.  Keep the shell intact and, using the tip of the knife, remove the dark digestive cord. Gently rinse the prawns in cold water and pat them dry with kitchen paper.", "Heat a wok until it is hot. Add 2 tablespoons olive oil, the garlic, onion, spring onions and chillies. Stir-fry for about 2 minutes. Season with salt and pepper to taste. Transfer to a bowl and set aside while you cook the prawns. ", "Reheat the wok and add the remaining 3 tablespoons olive oil. Gently fry the prawns for about 30 seconds on each side.", "Place the prawns on a baking tray and stuff each of the prawns with the garlic and onion mixture. Reserve any remaining stuffing for the sauce.", "Put the prawns in the oven for about 3-4 minutes, or until cooked.", "For the sauce, add the remaining stuffing to a small saucepan set over a medium heat. Gently incorporate the butter and simmer gently for about 3 minutes.", "To serve, put the prawns on a serving platter and serve with the lemon wedges and butter sauce. "]}, {"isVegetarian": false, "title": "Macaroni cheese", "url": "www_bbc_co_uk_food_recipes_macaroni_cheese_51582", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroni_cheese_51582_16x9.jpg", "ingredients": ["300g/10½oz dried macaroni", "2 leeks", "45g/1½oz butter", "45g/1½oz flour", "600ml/1 pint milk", "1 tsp mustard", "dash Worcestershire sauce", "200g/7oz cheddar cheese, grated", "60g/2¼oz breadcrumbs", "250g/9oz frozen peas, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Bring a large pan of salted water to the boil and add the macaroni. Cook for 5 minutes then drain.", "Meanwhile trim the leeks, discarding the green parts, then thinly slice. Melt the butter in a large saucepan, add the leeks and cook gently for 5 minutes, or until soft. Add the flour and cook for 2 minutes, stirring constantly. Add the milk little by little, stirring constantly, then cook gently for 5 minutes, stirring all the time until the sauce is thickened. Add the mustard and Worcestershire sauce then remove from the heat. Stir in the grated cheese and season with salt and pepper. ", "Add the pasta to the sauce, stir to combine then pour into a 2 litre/3½ pint ovenproof dish. Sprinkle over the breadcrumbs and bake for 25 minutes until golden-brown.", "Towards the end of cooking, bring a pot of water to the boil. Add the peas, cook for 3-4 minutes then drain. Serve the macaroni cheese with the peas."]}, {"isVegetarian": true, "title": "Macaroni cheese", "url": "www_bbc_co_uk_food_recipes_macaronicheese_83784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["570ml/1 pint milk", "½ onion", "6 whole black peppercorns", "2 bay leaves", "1 tsp thyme ", "½ tsp grated nutmeg", "50g/2oz low-fat spread", "25g/1oz flour", "salt and freshly ground black pepper", "175g/6oz whole wheat macaroni", "175g/6oz low-fat cheddar cheese, grated ", "1 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the milk into a saucepan over a medium heat. Add the onion, peppercorns, bay leaves and thyme and bring to the boil to infuse the flavours. ", "Remove the pan from the heat, cover with a lid and allow the milk to stand for 10-15 minutes. Strain the milk through a sieve into a bowl and discard the solid ingredients.", "Place the low-fat spread into a clean saucepan over a gentle heat. Once melted, add the flour and cook, stirring well, for 2-3 minutes.", "Add the infused milk, stirring all the time and bring the sauce gradually to the boil.", "Season with salt and freshly ground black pepper, then allow the sauce to simmer for 3-5 minutes, stirring occasionally.", "Meanwhile, cook the macaroni according to packet instructions. When it is just cooked, drain and place into a warm earthenware or heatproof dish.", "Add 110g/4oz of the grated cheddar cheese and all of the chopped parsley to the white sauce, stir well, then pour this over the cooked macaroni. ", "Cover with the remaining grated cheese and place the dish under the grill to cook for 5-7 minutes, until the cheese is bubbling and golden-brown.", "Serve at the table in the dish."]}, {"isVegetarian": true, "title": "Macaroni cheese", "url": "www_bbc_co_uk_food_recipes_macaronicheese_83521", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaronicheese_83521_16x9.jpg", "ingredients": ["250g/9oz macaroni ", "40g/1½oz  butter", "40g/1½ plain flour", "600ml/1pint 1½fl oz milk", "250g/9oz grated cheddar ", "50g/2oz grated parmesan (or a similar vegetarian alternative)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the macaroni in a large saucepan of boiling salted water for 8-10 minutes; drain well and set aside.", "Melt the butter over a medium heat in a saucepan slightly larger than that used for the macaroni. Add the flour and stir to form a roux, cooking for a few minutes.", "Gradually whisk in the milk, a little at a time. Cook for 10-15 minutes to a thickened and smooth sauce.", "Meanwhile, preheat the grill to hot.", "Remove the sauce from the hob, add 175g/6oz of the cheese and stir until the cheese is well combined and melted.", "Add the macaroni to the sauce and mix well. Transfer to a deep suitably-sized ovenproof dish.", "Sprinkle over the remaining cheddar and the parmesan and place the dish under the hot grill. Cook until the cheese is browned and bubbling. Serve straightaway."]}, {"isVegetarian": false, "title": "Macaroni cheese with artichoke hearts and bacon", "url": "www_bbc_co_uk_food_recipes_macaronicheesewithar_91967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz butter", "300g/10½oz cooked artichoke hearts (available in jars from delicatessens), cut in half, drained, patted dry with kitchen paper", "100g/3½oz bacon lardons (optional)", "1 garlic clove, peeled, crushed slightly with the edge of a knife", "50g/2oz plain flour", "800ml/1 pint 7 fl oz milk", "1 tbsp wholegrain mustard", "2 pinches ground nutmeg", "160g/5½oz strong hard cheese, grated", "salt and freshly ground black pepper", "350g/12½oz macaroni, cooked according to packet instructions until just al dente (add a dash of oil to the cooking water to prevent the macaroni from sticking together), drained", "4-6 ripe tomatoes, thinly sliced with a serrated knife", "40g/1½oz parmesan, finely grated", "3-4 pinches dried mixed herbs (such as oregano, thyme or rosemary)", "salt and freshly ground black pepper", "drizzle extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the macaroni cheese, heat 20g/¾oz of butter in a medium saucepan over a medium heat. When the butter is foaming, add the artichoke halves and lardons, if using, and fry, stirring regularly, for 10-12 minutes, or until the artichokes and bacon are both golden-brown and the bacon is crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "Heat the remaining 40g/1½oz of butter in a large saucepan over a medium heat until foaming. Add the garlic clove and fry for one minute, or until softened. ", "Add the flour and stir to combine, then continue to cook for a further minute, stirring vigorously, or until the flour has darkened slightly in colour. ", "Add 3-4 tablespoons of the milk and stir until the mixture comes together as a thick paste. ", "Add the remaining milk, a little at a time, whisking after each addition to incorporate it into the mixture and waiting until the mixture has thickened slightly before adding more milk. When all of the milk has been incorporated into the mixture, the result should be a smooth sauce with the consistency of double cream (this is called a roux). ", "Reduce the heat slightly and stir in the mustard and nutmeg. Remove the garlic clove from the mixture and discard.  ", "Add the grated cheese and stir well until completely melted. Season, to taste, with salt and freshly ground black pepper. ", "Add the cooked macaroni, artichoke halves and bacon lardons, if using, to the cheese sauce and stir well to combine. Remove the pan from the heat. Transfer the macaroni cheese to an ovenproof dish. ", "For the topping, arrange the sliced tomatoes on top of the macaroni cheese. Sprinkle over the grated parmesan and dried herbs. Season, to taste, with salt and freshly ground black pepper and drizzle over a dash of extra virgin olive oil. ", "Line a baking tray with aluminium foil and place the ovenproof dish on top to catch any drips. Bake the macaroni cheese in the middle of the oven for 30-40 minutes, or until the topping is golden-brown and the macaroni cheese is bubbling."]}, {"isVegetarian": true, "title": "Macaroni cheese", "url": "www_bbc_co_uk_food_recipes_macaronicheese_91063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaronicheese_91063_16x9.jpg", "ingredients": ["25g/1oz butter", "25g/1oz plain flour", "500ml/17½fl oz milk", "100g/3½oz cheddar cheese, grated", "50g/2oz parmesan cheese, or similar vegetarian hard cheese, grated", "400g/14¼oz whole wheat macaroni pasta, cooked according to packet instructions"], "serves": "Serves 4 (or makes 6 macaroni cups)", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Melt the butter in a saucepan over a medium heat. Once the butter is melted, add the flour and cook for about three minutes, or stirring continuously. Gradually add the milk, a little at a time, to the flour and butter mixture, stirring with a wooden spoon until any lumps have melted and the sauce is glossy before adding more milk. Once all the milk has been incorporated, reduce the heat to low and simmer for about three minutes. Stir in the cheddar and half the parmesan until it's melted.", "Add the cooked pasta to the cheese sauce and transfer the mixture to a deep baking dish. Alternatively, line the holes of a muffin tin with six silicone cupcake wrappers and divide the mixture evenly between them. Sprinkle with the remaining parmesan and place in the oven to cook for about 20 minutes, or until golden-brown. Serve hot or cold."]}, {"isVegetarian": true, "title": "Macaroon wedding tower", "url": "www_bbc_co_uk_food_recipes_macaroon_wedding_tower_64304", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroon_wedding_tower_64304_16x9.jpg", "ingredients": ["340g/12oz icing sugar", "120g/4½oz ground almonds", "200g/7oz roasted, skinned hazelnuts", "240g/9oz free-range egg whites (from about 4 medium eggs)", "100ml/3½fl oz water", "320g/11½oz granulated sugar", "2 tsp chestnut gel food colouring ", "480ml/17fl oz double cream", "440g/1lb dark chocolate, finely chopped", "100g/3½oz unsalted butter, softened at room temperature", "400g/14oz roasted skinned hazelnuts, chopped", "340g/12oz icing sugar", "320g/11½oz ground almonds", "240g/9oz egg whites (from about 4 medium eggs)", "100ml/3½fl oz water", "320g/11½oz granulated sugar", "2 tsp powdered raspberry food colouring", "240ml/9fl oz double cream", "220g/8oz dark chocolate, finely chopped", "50g/2oz unsalted butter, softened at room temperature", "150g/5½oz raspberry jam"], "serves": "Serves 30", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Line four large baking trays with greaseproof paper. (A clever thing to do is to have a template with evenly spaced circles that you can slip under the greaseproof paper when piping the macaroons; then you can just slide it out when you are finished and re-use it.)", "For the chestnut macaroons, blend the icing sugar, ground almonds and hazelnuts together in a food processor until really smooth. ", "Whisk the egg whites in a bowl until stiff peaks form when the whisk is removed. ", "Meanwhile, heat the water and sugar in a saucepan until it reaches 118C/240F (check this with a sugar thermometer).", "Whisk the egg whites again and slowly add the sugar syrup. Continue whisking until stiff peaks form when the whisk is removed. ", "Fold in the almond mixture until smooth (be careful not to overmix), then stir in the chestnut food colouring. Spoon the mixture into piping bags and pipe 4cm/1½in rounds onto the baking trays. ", "The macaroons must stand for at least 20 minutes before going into the oven as it helps to form a skin. Bake for 13-15 minutes. (You may need to do this in batches, but the macaroons can rest for 1-2 hours.)", "Remove from the oven and set aside to cool. Carefully peel the macaroons off the greaseproof paper.", "For the ganache filling, heat the double cream in a saucepan until just boiling, then remove from the heat. Pour the cream over the chopped chocolate and stir until the chocolate has melted and the mixture is smooth. ", "Stir in the butter and chopped hazelnuts. Spoon the ganache into piping bags and set aside to cool.", "Pipe a small amount of ganache onto half of the macaroons and sandwich together with the remaining macaroons. ", "For the raspberry macaroons, line four large baking trays with greaseproof paper. (A clever thing to do is to have a template with evenly spaced circles that you can slip under the greaseproof paper when piping the macaroons; then you can just slide it out when you are finished and re-use it.)", "Blend the icing sugar and ground almonds together in a food processor until really smooth. ", "Whisk the egg whites in a bowl until stiff peaks form when the whisk is removed. ", "Meanwhile, heat the water and sugar in a saucepan until it reaches 118C/240F (check this with a sugar thermometer).", "Whisk the egg whites again and slowly add the sugar syrup. Continue whisking until stiff peaks form when the whisk is removed. ", "Fold in the almond mixture until smooth (be careful not to overmix), then fold in the raspberry food colouring. Spoon the mixture into piping bags and pipe 4cm/1½in rounds onto the baking trays. ", "The macaroons must stand for at least 20 minutes before going into the oven as it helps to form a skin. Bake for 13-15 minutes. (You may need to do this in batches, but the macaroons can rest for 1-2 hours.)", "Remove from the oven and set aside to cool. Carefully peel the macaroons off the greaseproof paper.", "For the raspberry ganache filling, heat the double cream in a saucepan until just boiling, then remove from the heat. Pour the cream over the chopped chocolate and stir until the chocolate has melted and the mixture is smooth. ", "Stir in the butter and raspberry jam. Spoon the ganache into piping bags and set aside to cool.", "Pipe a small amount of ganache onto half of the macaroons and sandwich together with the remaining macaroons. ", "To create the macaroon tower, cover the foam cone with craft paper. Insert toothpicks all over the foam cone in a regular pattern, with 1cm/½in of each toothpick sticking out. Carefully push the macaroons onto the toothpicks until the entire cone is covered."]}, {"isVegetarian": true, "title": "Macaroons", "url": "www_bbc_co_uk_food_recipes_macaroons_04669", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroons_04669_16x9.jpg", "ingredients": ["125g/4½oz icing sugar", "125g/4½oz ground almonds", "90g/3½oz free-range egg whites", "2 tbsp water", "110g/4oz caster sugar", "food colouring (optional)", "desiccated coconut, for sprinkling (optional)", "150ml/5fl oz double or whipped cream, whipped"], "serves": "Makes 24 macaroons (12 if sandwiched together)", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170/C/325F/Gas 3 and line a large baking tray with baking paper.", "Put the icing sugar, ground almonds and 40g/1½oz egg whites together in a large bowl and mix to a paste.", "Put the water and caster sugar in a small pan and heat gently to melt the sugar, then turn up the heat and boil until the mixture starts to go syrupy and thickens - I don’t use a thermometer but if you prefer to use one, it should read 115C/239F at this stage.", "Whisk the remaining 50g/2oz egg whites in a small bowl until medium-stiff peaks form when the whisk is removed from the bowl, then pour in the sugar syrup, whisking until the mixture becomes stiff and shiny. For coloured macaroons, add a few drops of food colouring. Tip this meringue mixture into the almond paste mixture and stir gently until the becomes stiff and shiny again.", "Spoon into the piping bag. Pipe a little mixture under each corner of the baking paper to stop it sliding around. With the bag held vertically, pipe 4cm/1½in flat circles onto the lined tray, about 2cm/¾in apart, twisting the bag after each one. The mixture should be quite loose to give a smooth finish. The piping will leave a small ‘tip’ on each circle so, when they’re all piped, give the tray 2–3 slams on a flat surface to flatten them. At this stage, sprinkle with desiccated coconut if you want.", "Leave to stand for 30 minutes to form a skin then bake in the oven for 12–15 minutes with the door slightly ajar until firm. Remove from the oven, lift the paper off the baking tray and leave the macaroons to cool on the paper.", "When cool, sandwich the macaroons together with whipped cream. They can be kept for a couple of days, if they hang around that long!"]}, {"isVegetarian": true, "title": "Macaroons", "url": "www_bbc_co_uk_food_recipes_macaroons_16105", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroons_16105_16x9.jpg", "ingredients": ["125g/4oz ground almonds ", "200g/7oz icing sugar", "3 free-range egg whites ", "2 tbsp caster sugar", "½ tsp cream of tartar", "pinch red powdered food colouring", "200g/7oz dark chocolate, chopped", "200ml/7fl oz double cream", "1 tsp brandy", "15g/½oz unsalted butter"], "serves": "Makes 10 macaroons", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Blend the ground almonds and icing sugar in a food processor until well combined. Set aside.", "Using an electric whisk, slowly whisk the egg whites in a large bowl at a low speed until stiff peaks form when the whisk is removed. Slowly whisk in the cream of tartar and caster sugar until the mixture is smooth and glossy, increasing the speed of the whisk as the mixture stiffens.", "Gently fold in the food colouring and blended ground almonds and icing sugar until the mixture resembles shaving foam. ", "Spoon the macaroon mixture into a piping bag fitted with a 1cm/½in round nozzle. Pipe 5cm/2in circles onto the baking tray lined with greaseproof paper. If a peak forms, wet your finger and smooth it down. Sharply tap the bottom of the tray to release any air bubbles from the macaroons, then set aside for 60 minutes (the macaroon shells are ready to go in the oven when they are no longer sticky to the touch).", "Meanwhile, preheat the oven to 160C/315F/Gas 2½. ", "Bake the macaroons in the oven for 10-15 minutes, or until cooked through. Remove from the oven and set aside to cool for 5 minutes. Carefully peel away the greaseproof paper and set aside to cool completely.", "Meanwhile, for the chocolate filling, heat the double cream and chocolate in a saucepan over  a low heat, stirring occasionally, until smooth and well combined. Add the brandy and butter and stir until smooth, then remove from the heat and set aside to cool completely.", "Use the filling to sandwich the macaroons together then chill in the fridge for 30 minutes."]}, {"isVegetarian": false, "title": "Mackerel and bacon salad", "url": "www_bbc_co_uk_food_recipes_mackerel_and_bacon_salad_10923", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerel_and_bacon_salad_10923_16x9.jpg", "ingredients": ["1 onion, small and sweet", "3 tbsp white wine vinegar ", "500g/1lb small salad potatoes ", "2 tsp Dijon mustard ", "1 heaped tsp capers ", "2 tbsp white wine vinegar ", "6 tbsp olive oil ", "4 bushy sprigs dill", "6 thin rashers smoked streaky bacon ", "2 whole smoked mackerel (or 4 fillets)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium high heat. Line a baking sheet with greaseproof paper.", "Peel and finely slice the onion into rings. Put them into a small bowl with the white-wine vinegar and set aside for 10 minutes or more, tossing occasionally. This removes any harshness and will slightly soften the onion's flesh.", "Boil the potatoes in deep, generously salted water for 15 minutes until they are tender. Lay the bacon out flat on the lined baking sheet and grill for 10 minutes until crisp.", "Take the whole smoked mackerel and peel off the skin. Into a large bowl, flake the mackerel off the bone in large chunks. ", "While the potatoes are boiling and the bacon is grilling make the dressing.  Spoon the mustard into another bowl. Briefly rinse the capers and add to the mustard. Pour in the white wine vinegar; add a little pepper and a few generous glugs of olive oil. Give it a stir. ", "Chop the dill and add half to the dressing and half to the bowl with the mackerel. Now take the softened onions out of the vinegar and add to the dressing.", "When the potatoes are soft to a knifepoint, drain and slice them in half, leaving the skin on, and tip into the dressing to absorb. Mix together and then spoon over the flaked mackerel.", "When the bacon is crisp, snip little 4cm/1½in squares over the salad and toss it altogether before serving."]}, {"isVegetarian": false, "title": "Mackerel en croûte with gooseberry chutney", "url": "www_bbc_co_uk_food_recipes_mackerel_en_crote_with_62948", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz caster sugar", "50g/2oz sultanas", "2 fresh thyme sprigs, leaves only", "40g/1¾oz piece fresh root ginger, peeled and finely chopped", "½ shallot, finely chopped", "100ml/3½fl oz cider vinegar", "300g/10½oz fresh gooseberries, topped and tailed", "sea salt and freshly ground black pepper", "250g/9oz salmon fillet, skin and pin bones removed, flesh roughly chopped", "1 lemon, juice only", "110ml/4fl oz double cream", "4 whole mackerel, heads and guts removed, de-boned (you can ask your fishmonger to do this for you)", "4 sprigs fresh tarragon, leaves only", "600g/1lb 5oz ready-made all-butter puff pastry", "2 free-range egg yolks, lightly beaten", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat the sugar in a large, heavy-based pan over a low heat, stirring well until it has melted and turned golden-brown (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.). Stir in the sultanas, thyme, ginger and shallot.", "Add the cider vinegar and gooseberries to the pan, stir well and bring the mixture to the boil. Reduce the heat and simmer gently for 8-10 minutes, stirring occasionally, until the gooseberries have softened and broken down. Season, to taste, with salt and freshly ground black pepper, then set aside to cool slightly.", "For the mackerel, preheat the oven to 220C/200C Fan/Gas 7.", "Blend the salmon and lemon juice to a fine paste in a food processor. With the motor still running, gradually add the cream in a thin stream until all of the cream has been incorporated into the mixture and the paste has thickened to a fluffy mousse. Season, to taste, with salt and freshly ground black pepper.", "One by one, carefully stuff the cavities of the mackerel first with the tarragon leaves, then with the salmon mousse.", "Roll the pastry out onto a lightly floured work surface to a thickness of 0.5cm/¼in. Cut the pastry into four rectangles - these should be long enough to wrap around the stuffed fish and half as wide as the fish (about 15cm x 18cm/6in x 7in). ", "Brush each pastry rectangle with a little of the beaten egg, then wrap one rectangle around the middle of each fish, pressing the ends of the pastry together underneath the fish to seal (use a little more beaten egg for this if necessary). ", "Place the wrapped, stuffed fish onto a baking tray.  Wrap the tail of each fish in greased aluminium foil to stop them from burning. Sprinkle a little sea salt over each fish.", "Bake the stuffed mackerel in the oven for 18-20 minutes, or until the pastry is risen and golden-brown and the fish are cooked through. Remove from the oven and set aside to cool for about five minutes.", "To serve, cut each mackerel in half and serve with a dollop of gooseberry chutney. "]}, {"isVegetarian": true, "title": "Macerated Scottish berries with mascarpone sorbet", "url": "www_bbc_co_uk_food_recipes_maceratedscottishber_12131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 handfuls of strawberries (Scottish if possible)", "4 handfuls of raspberries (Scottish if possible)", "2 handfuls of tayberries (Scottish if possible)", "1 small punnet of redcurrants (Scottish if possible)", "1 small punnet of white currants (Scottish if possible)", "a good dousing of Cointreau", "270g/9½oz caster sugar", "350ml/12fl oz cold water", "2 tbsp fresh orange juice", "250g/9oz mascarpone cheese", "3 sprigs of mint", "dusting of icing sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Dissolve the caster sugar and water together, bring to the boil until slightly reduced and cool. Add the orange juice. ", "Whisk the syrup into the mascarpone. Sieve and churn in an ice cream machine. If making by hand put into a freezer-proof box and stir/whisk every 30mins for about 1½ hours.", "Pick through all the berries, hull the strawberries and red and white currants. Place the berries in a large bowl and douse with Cointreau. Leave covered with cling film to macerate for 1-1½ hours.", "To serve, simply ladle out the berries into four chilled bowls. Scoop the sorbet and place into the centre of the bowls. You can serve a biscuit with this dish - for example, cantuccini or brandy snaps. Garnish with a sprig of mint and icing sugar. Serve immediately."]}, {"isVegetarian": false, "title": "Mackerel fillet with dressed crab, pickled vegetables and herb oil", "url": "www_bbc_co_uk_food_recipes_mackerel_fillet_with_45038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bunch baby turnips, trimmed, thinly sliced with a mandoline", "½ bunch radishes, preferably Breakfast radishes, trimmed, thinly sliced with a mandoline", "¼ cucumber, peeled, thinly sliced with a mandoline", "110ml/4fl oz white wine vinegar", "1 tsp sugar", "1 tsp salt", "½ bunch fresh parsley, roughly chopped", "½ bunch fresh chives, roughly chopped", "½ bunch fresh coriander, roughly chopped", "200ml/7fl oz oil", "2 free-range egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "300ml/10½fl oz vegetable oil", "150g/5oz white crab meat", "2 mackerel fillets, skin on, pin bones removed", "2 tbsp chopped fresh wood sorrel, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the vegetables in a heatproof bowl. In a saucepan, heat 110ml/4fl oz of water and all of the white wine vinegar, stirring in the sugar and salt until dissolved. Pour the vinegar mixture over the sliced vegetables and set aside to pickle for 2 hours. Drain the vegetables, discarding the pickling liquid.", "Meanwhile, for the herb oil, blend all of the ingredients in a food processor until smooth. Strain through a fine sieve, then set aside.", "For the dressed crab, blend the egg yolks, vinegar and mustard in a food processor until pale and creamy. With the motor still running, gradually pour in the oil in a thin stream, until the mixture forms a thick mayonnaise. (You may not need to use all of the oil.)", "Put the crab meat in a small glass bowl and cover with the mayonnaise. Season, to taste, with salt and pepper. Chill in the fridge until ready to serve.", "Just before serving, lay the mackerel fillets, skin-sides facing upwards, on a baking tray. Heat the skin of the mackerel all over using a chefs' blow torch, until the fish fillets are completely cooked through. Alternatively, preheat the grill to its highest setting and grill the mackerel fillets until cooked through.", "Drizzle each serving plate with the herb oil. Place one mackerel fillet in the centre of each plate. Spoon half of the crab mayonnaise on one side of the fish, then spoon the pickled vegetables on the other side. Garnish with the wood sorrel and serve. "]}, {"isVegetarian": false, "title": "Mackerel kebabs", "url": "www_bbc_co_uk_food_recipes_mackerel_kebabs_with_42322", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerel_kebabs_with_42322_16x9.jpg", "ingredients": ["8 large mackerel fillets, all bones removed", "2 tbsp finely chopped fresh oregano leaves (or 1 tsp dried)", "1 lemon, zest only", "1 tbsp red wine vinegar", "2 tbsp olive oil", "pinch chilli powder or flakes (optional)", "2 small red onions, each cut into quarters", "1 lemon, cut into quarters, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Make sure each mackerel fillet is bone-free. (Either remove the belly and pin bones with fish bone pliers or clean tweezers, or follow the line of bones, cutting either side of them as close to the bone as possible, and lift them out.) ", "Put the oregano leaves, lemon zest, red wine vinegar and olive oil into a large bowl and season with salt and black pepper. Add the chilli, if using.", "Place the mackerel fillets into the marinade and refridgerate for at least half an hour, turning once or twice to make sure they are completely covered in the sauce. Thread the fillets onto long skewers, concertina style, adding wedges of red onion at each end. ", "If cooking on a barbecue, heat the coals until white, then cook the mackerel for around 10-12 minutes, or until cooked through. Baste with any leftover marinade and turn regularly. You can also cook these under a hot grill or on a griddle pan for 10 minutes, turning 2-3 times . Serve with lemon wedges."]}, {"isVegetarian": false, "title": "Mackerel pasty with watercress", "url": "www_bbc_co_uk_food_recipes_mackerel_pasty_with_13084", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium mackerel, butterflied, pin bones removed", "salt and freshly ground black pepper", "4 good-quality pork sausages, filling squeezed out, skins discarded", "1 bunch fresh tarragon, chopped", "1 bunch fresh flatleaf parsley, chopped", "500g/1lb 2oz all-butter puff pastry", "2 free-range egg yolks, beaten", "½ cucumber, peeled, halved lengthways, seeds scooped out, sliced", "pinch sugar", "2 tbsp cider vinegar", "½  tsp salt", "2 bunches watercress", "1 tbsp olive oil", "squeeze lemon juice"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the mackerel with salt and freshly ground black pepper.", "Mix the sausagemeat, tarragon and half of the parsley together in a bowl. ", "Spread the mixture over the cut side of the mackerel, then fold each mackerel in half along the spine. Chill in the fridge.", "Meanwhile, cut the puff pastry into four pieces and roll each piece out to a 5mm/¼in thickness.", "Wrap each fish in a piece of pastry, leaving the mackerel tail poking out, trim any excess and crimp the edge like a pasty.", "Brush the top of the pasties with the beaten egg and bake in the oven for 25-30 minutes, or until the pastry is cooked through and golden-brown. ", "Mix the cucumber, sugar, vinegar and salt together in a bowl and set aside for five minutes, stir in the remaining parsley. ", "To serve, toss the watercress with the olive oil and squeeze of lemon juice. Serve the pasties with the watercress and cucumber salad alongside."]}, {"isVegetarian": false, "title": "Mackerel with gooseberries, pickled onions and salad", "url": "www_bbc_co_uk_food_recipes_mackerel_with_83219", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole mackerel, filleted and pin boned", "6 pickled onions, thinly sliced", "1 tbsp olive oil  ", "1 onion, finely chopped  ", "2½cm/1in piece fresh root ginger, peeled and shredded  ", "1 tbsp soft brown sugar  ", "500g/1lb 2oz gooseberries  ", "generous dash of ginger wine or cordial  ", "1 tsp fennel seeds", "1-2 sprigs thyme, leaves picked and chopped  ", "2 baby onions, trimmed and sliced", "200g/7oz crème fraîche", "2 tbsp fresh chives"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, place mackerel fillets on a baking tray and lay the pickled onions over the top. Use a chef’s blow torch to cook the fish and onions. Alternatively cook under a very hot grill for 2-3 minutes. ", "For the gooseberry chutney, heat the olive oil in a heavy-based saucepan. Add in the onion and fry gently until softened, approximately three minutes. Then add in the ginger and sprinkle over the sugar. ", "Cook gently, stirring often, for two minutes. Add the gooseberries and the ginger wine or cordial. Bring to the boil, cover and simmer gently for 10-15 minutes, stirring now and then until the mixture has thickened into a chutney.", "Stir in the fennel seeds and thyme leaves in the final minutes of cooking. Transfer the hot chutney into a warm, sterilised jar. Cool and seal the lid.", "To serve, place the mackerel on serving plates and serve with the chutney and a few slices of baby onions. Mix the chives and crème fraîche and serve alongside."]}, {"isVegetarian": false, "title": "Mackerel, tomato and samphire salad", "url": "www_bbc_co_uk_food_recipes_mackerel_tomato_and_49040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 ripe vine tomatoes, chopped", "2 tbsp white wine vinegar", "2 garlic cloves, chopped", "1 tbsp sugar", "1 red chilli, de-seeded, chopped", "3 free-range egg yolks", "1 tsp English mustard", "1 tsp white wine vinegar", "300ml/10½fl oz light olive oil", "50ml/2fl oz double cream", "2 mackerel, gutted, filleted, pin-bones removed", "4 rashers smoked streaky bacon, grilled until crisp and cut into small pieces", "8 cherry tomatoes", "2 Little Gem lettuces, leaves separated", "110g/4oz samphire", "10 basil leaves, ripped up"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the tomato stock, place the tomatoes, vinegar, garlic, sugar and chilli into a bowl. Season with a bit of salt and stir until well combined. Spoon the tomatoes into a large piece of muslin and hang it over a bowl in the fridge overnight or for at least six hours.  Reserve the liquid collected from the tomatoes (the tomatoes can be used in another recipe).", "For the sauce, mix the egg yolks, mustard and vinegar together in a bowl until well combined. Slowly whisk in the oil until the mixture thickens into mayonnaise. Whisk in the cream. ", "Add a ladleful of the reserved tomato stock, then heat the sauce in a saucepan over a low heat, whisking continuously, until warmed through.", "Heat a frying pan until hot and fry the mackerel, skin-side down, with the bacon for one minute. Add the cherry tomatoes, drizzle with a little oil and a sprinkling of salt and cook for a further 3-4 minutes. ", "Remove the mackerel and tomatoes from the pan and set aside. ", "Add the lettuce and samphire to the pan used to cook the fish and cook for one minute.", "To serve, spoon the tomatoes and lettuce mixture onto serving plates. Top with the mackerel and spoon over the sauce. Sprinkle over the basil leaves."]}, {"isVegetarian": false, "title": "Mackerel tartare tartlets with pickled cucumber", "url": "www_bbc_co_uk_food_recipes_mackerel_tartar_tartlets_94473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet filo pastry", "100g/3½oz clarified butted", "4 oysters, shucked and chopped", "1 free-range egg yolk", "salt and freshly ground black pepper", "1tsp Dijon mustard", "1 lime, juice only", "1 tbsp vegetable oil", "2 whole mackerel, filleted, skinned and pin boned", "25g/1oz chopped shallot", "30g/1oz mini capers", "20g/¾oz freshly grated ginger", "1 tbsp soy sauce", "1 tbsp chopped chives", "samphire, to garnish (optional) ", "350g/12oz rice wine vinegar", "240g/8½oz sugar", "1 red chilli, chopped", "25g/1oz fresh ginger, peeled and chopped", "1 cucumber, peeled, halved and seeds removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry cases, preheat the oven to 180C/350F/Gas 4.", "Lay one sheet of filo on a clean work surface and brush with melted clarified butter. Lay another sheet of filo on top (ensuring there are no creases) and brush with more clarified butter. Repeat until you have four layers of filo pastry.  ", "Cut out circles using a 10cm/4in pastry cutter.  Gently press the circles into the tartlet moulds (or bun tin). Add a layer of heat proof cling film or parchment paper over the pastry and fill with baking beans. Cook for 15 minutes, or until light golden-brown, to blind bake.  ", "For the filling, in a food processor combine the oysters, egg yolk, Dijon mustard, salt, pepper, a squeeze of lime juice and vegetable oil. Blend to the consistency of mayonnaise (if needed, add some juice from the oysters to loosen the mixture).  Transfer to the fridge to chill until ready to use.", "Dice the mackerel fillets and put in a bowl. Add the chopped shallots, capers, ginger, soy sauce, a squeeze of lime juice and 1-2 tablespoons of the oyster mayonnaise. Add the chopped chives and season with salt and freshly ground black pepper.", "For the pickled cucumber, in a pan bring the vinegar, sugar, chilli and ginger to a boil.  Use a vegetable peeler to slice the cucumber into 7cm/3in long strips.  Cool the vinegar mixture, then add to the cucumber.", "To serve, fill the tartlets with the oyster mayonnaise and top with the pickled cucumber and some samphire if you like. "]}, {"isVegetarian": false, "title": "Mackerel with asparagus and grapefruit", "url": "www_bbc_co_uk_food_recipes_mackerel_with_asparagus_07149", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 egg yolks", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "200ml/7fl oz grapeseed oil", "1 pink grapefruit, zest finely grated and fruit segmented, juice reserved", "150g/5½oz white crab meat", "3 tbsp olive oil", "1 white grapefruit, segmented, juice reserved ", "1 tsp Dijon mustard", "2 whole mackerel, filleted and pin-boned", "1 bunch English asparagus, peeled and trimmed", "iced water, for refreshing", "50g/1¾oz unsalted butter", "1 pomelo, segmented", "a few watercress leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the mayonnaise, put the egg yolks in a food processor and blend. Add the vinegar and mustard and blend again. Slowly add the oil, until you have a thick mayonnaise. Stir in the half of the grapefruit zest and the crab, reserve the remaining grapefruit zest for the dressing.", "For the grapefruit dressing, mix the oil with reserved juices from the grapefruit and the reserved grapefuit zest. Add the mustard and whisk. ", "Preheat the grill to high. Put the mackerel skin side-up on a baking tray and grill for 2-4 minutes.", "Bring a large pot of water to the boil and blanch the asparagus for 1-2 minutes. Put the iced water into a bowl, then plunge the asparagus into the water. Heat a griddle pan or frying pan and add the butter. Cook the asparagus in the pan for 1-2 minutes, until coloured.", "Put the asparagus and mackerel on serving plates and top with a spoonful of the mayonnaise. Dot the grapefruit and pomelo segments around the plate and drizzle with the dressing. Garnish with the watercress and serve. "]}, {"isVegetarian": false, "title": "Mackerel with honey miso, daikon radish, spring onion and horseradish cream", "url": "www_bbc_co_uk_food_recipes_mackerel_with_honey_miso_49383", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 mackerel fillets", "100g/3½oz sea salt flakes", "100g/3½oz caster sugar ", "½ daikon radish", "1 shallot, finely sliced", "50ml/2fl oz red wine vinegar ", "100ml/3½fl oz double cream", "2 tbsp plain yoghurt ", "50g/1¾oz fresh horseradish, finely grated", "1 lemon, juice only", "rapeseed oil, for frying", "100g/3½oz miso paste", "50g/1¾oz runny honey", "50ml/2fl oz soy sauce", "30ml/1fl oz mirin ", "30ml/1fl oz rice wine vinegar", "1 sheet nori seaweed", "5 radishes, 3 thinly sliced, 2 left whole", "2 spring onions, sliced diagonally", "5g/¼oz red amaranth ", "5g/¼oz watercress, leaves picked and washed", "5g/¼oz micro coriander ", "drizzle olive oil"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the mackerel fillets in a bowl with the salt and sugar and stir well. Cover and refrigerate for up to 2 hours. ", "Thinly slice the daikon and put in a bowl of iced water. Set aside.", "For the horseradish cream, put the shallot and red wine vinegar in a saucepan over a medium heat and reduce until all the moisture has evaporated.Set aside to cool. Lightly whisk the cream in a medium-sized bowl. Add the yoghurt and horseradish and stir in the cooled shallots. Season with salt and half of the lemon juice. Set aside.", "Gently wash the mackerel fillets in water and pat dry. Heat a dash of rapeseed oil in a large frying pan over a medium heat and fry the mackerel skin side down for 3–4 minutes. Remove from the heat and allow to rest. ", "Whisk the miso and honey in a clean bowl until combined. Gradually add the soy sauce, mirin and rice wine vinegar and season with the remaining lemon juice. Drain the daikon and add to the miso dressing.", "Put the nori seaweed sheet into a food processor and blitz until you have a fine crumb. Set aside. ", "To serve, divide the daikon and miso mixture between two plates and scatter over the sliced red radish and spring onion. Place the mackerel fillets on top and spoon over the horseradish cream. Garnish with the red amaranth, micro coriander, watercress leaves, whole red radishes, nori seaweed crumb and a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Mackerel with rhubarb chutney and orange and chicory salad", "url": "www_bbc_co_uk_food_recipes_mackerel_with_rhubarb_97633", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerel_with_rhubarb_97633_16x9.jpg", "ingredients": ["75g/2⅔oz caster sugar", "25g/1oz sultanas", "few sprigs fresh rosemary", "2cm/¾in piece root ginger, peeled and finely chopped", "1 shallot, peeled and finely chopped", "3 sticks rhubarb", "5 tbsp cider vinegar", "1 orange, juice only", "salt and black pepper", "2 whole mackerel, gutted, filleted and pin boned", "rapeseed oil, for cooking", "1 orange, segmented", "2 heads chicory, separated into leaves", "100g/3½oz pea shoots", "small handful celery tops", "1 tbsp chopped fresh dill", "rapeseed oil, for dressing", "salt and black pepper", "1 stick rhubarb, sliced into ribbons using a vegetable peeler"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, in a heavy-based pan melt the sugar until a golden-brown caramel forms. Remove from the heat and stir in the sultanas, rosemary sprigs, ginger, shallot and rhubarb.", "Stir in the cider vinegar and orange juice. Bring back to the boil and cook gently for 8-10 minutes. Season with salt and pepper and set aside to cool.", "To make the salad, mix together the orange segments, chicory leaves, pea shoots, celery tops and dill. Dress with rapeseed oil and season with salt and pepper.", "For the mackerel, place the mackerel fillets skin-side up on an oven tray. Brush with rapeseed oil and use a blow torch to cook evenly. Turn over and repeat on the other side (alternatively place the fillets under a hot grill). Season with salt and pepper.", "Serve a spoonful of chutney with the cooked mackerel fillets and salad. Garnish with ribbons of rhubarb."]}, {"isVegetarian": false, "title": "Mackerel with warm greengage chutney", "url": "www_bbc_co_uk_food_recipes_mackerel_with_warm_78395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 tsp mustard seeds", "1 tsp ground ginger", "½ tsp ground turmeric", "½ tsp ground cardamom", "2 star anise", "4 tomatoes, peeled, seeds removed and chopped", "100ml/3½fl oz white wine vinegar", "50g/1¾oz sugar", "salt", "12 greengages, roughly chopped", "4 mackerel fillets", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the chutney, heat the olive oil in a large pan and cook the onion and garlic until soft. Add the mustard seeds, ground ginger, turmeric, cardamom and star anise and stir well.", "Add the tomatoes, vinegar, sugar and salt and simmer everything thickens. When thick, add the greengages and cook until soft. Remove from the heat and let cool slightly.", "To fry the mackerel, heat the oil in a large, heavy frying pan. Place each mackerel fillet, skin side down, and fry for about five minutes or until cooked through. ", "Serve the mackerel with spoonfuls of warm chutney."]}, {"isVegetarian": false, "title": "Mackerel pâté", "url": "www_bbc_co_uk_food_recipes_mackerelpate_87059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 can mackerel fillets, drained", "30g/1oz butter", "½ tsp chilli flakes", "1 tbsp chopped fresh parsley", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients together in a food processor, pulse until smooth and season with salt and freshly ground black pepper. ", "To serve, transfer the mackerel mixture to a small serving bowl with toasted bread or crackers on the side."]}, {"isVegetarian": false, "title": "Mackerel on toast with salted cucumber and horseradish", "url": "www_bbc_co_uk_food_recipes_mackerelontoastwiths_90005", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mackerelontoastwiths_90005_16x9.jpg", "ingredients": ["½ cucumber, peeled, thinly sliced on a mandoline", "salt", "4 tbsp grated fresh horseradish", "2 heaped tablespoon crème fraîche", "2 tsp English mustard powder", "4 fresh mackerel fillets", "salt and freshly ground black pepper", "knob of butter", "4 slices soda bread, toasted, buttered", "1 small red onion, thinly sliced", "½ small lemon"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the salted cucumber and horseradish, place the cucumber slices into a colander and sprinkle with plenty of salt. Mix well and leave the contents to drain over the sink for half an hour.", "Rinse the salt off the cucumber with cold water, then leave to drain. Gently wring out any excess moisture from the cucumber with your hands, then set aside.", "In a clean bowl, mix the horseradish with the crème fraîche and mustard powder, making sure the mustard powder is well combined with no lumps. Set aside.", "Season the mackerel fillets on their skin side with salt and freshly ground black pepper.", "Heat the butter in a frying pan until it is foaming, then add the fillets skin-side down. Place a heat-proof plate onto the cooking fillets, as this will make sure they stay flat and cook evenly. Cook for 4-5 minutes, or until nearly cooked through, then turn the fillets and cook for 30 seconds, or until just cooked through.", "To serve, place a small handful of the cucumber onto the toast. Place the cooked mackerel fillets onto the cucumber. Place a dollop of the horseradish sauce on top and garnish with a little of the sliced red onion and a squeeze of lemon."]}, {"isVegetarian": false, "title": "Mackerel rolls with rocket pesto", "url": "www_bbc_co_uk_food_recipes_mackerelrollswithroc_81705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 mackerel fillet, cut in half", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 slice ciabatta, griddled", "1 bunch rocket", "2 tsp sesame seeds", "1 tbsp olive oil", "2 tsp red wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll up each piece of mackerel and secure with a cocktail stick.", "Heat the olive oil in a small frying pan over a medium heat. Add the mackerel and fry for two minutes on each side, then remove from the pan and put onto a slice of griddled ciabatta.", "To make the rocket pesto, place all the ingredients into a food processor and blend until smooth.", "To serve, pour the rocket pesto over the mackerel rolls."]}, {"isVegetarian": true, "title": "Madeira cake", "url": "www_bbc_co_uk_food_recipes_madeira_cake_38104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz butter, softened, plus extra for greasing", "200g/7oz caster sugar", "2 clementines, zest and juice only", "300g/10½oz plain flour", "2 tsp baking powder", "pinch salt", "3 free-range eggs", "2 tbsp caster sugar, for the topping"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. Butter and line a large loaf tin.", "Cream together the butter, caster sugar and clementine zest – you can do this either in a stand mixer or with hand-held electric beaters. ", "Mix the flour and baking powder together with a pinch of salt. Add the eggs one at a time to the sugar and butter mixture, sprinkling over a couple of tablespoons of flour with each addition and mixing well. ", "Fold in the rest of the flour followed by the clementine juice – the texture will be slightly firmer than the dropping consistency you need for a lighter sponge.", "Scrape the batter into the prepared tin and sprinkle with the caster sugar. Bake in the oven for between 55–60 minutes, or until a cake skewer comes out clean. The cake will be a rich golden-brown and may have cracked lengthways down the middle – this is normal for a madeira cake. ", "Remove from the oven and leave to cool in the tin before transferring to a wire rack."]}, {"isVegetarian": true, "title": "Madeira summer pudding with warm chocolate sauce", "url": "www_bbc_co_uk_food_recipes_madeira_summer_pudding_67882", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeira_summer_pudding_67882_16x9.jpg", "ingredients": ["1 vanilla pod, seeds only (or a few drops of vanilla extract)", "175g/6oz soft light brown sugar ", "2 tbsp dark rum, port or a blackcurrant liqueur", "2 tsp ground cinnamon", "2 tsp ground ginger", "1kg/2lb 4oz fresh summer berries (such as a mixture of raspberries, blueberries, blackberries and redcurrants), stalks removed", "2 Madeira loaf cakes", "small handful of fresh mint leaves, for decoration", "125ml/4oz double cream", "100g/3½oz dark chocolate (or a mix of dark and milk if preferred), finely chopped", "3 tbsp just-boiled water"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the sugar in a large pan with 100ml/3½fl oz water, place over a medium heat and stir until the sugar dissolves. Stir in the alcohol, vanilla seeds (or extract) and then turn up the heat and let it bubble away for 3-4 minutes to make a thin syrup. Turn down the heat to low and stir in the cinnamon and ginger. ", "Set aside 250g/9oz of the berries for decoration and place about a quarter of the remainder in a separate bowl. Add all the remaining berries to the pan, stirring them gently through. Leave to cook for two minutes, or until the fruit is soft but still holding its shape. Remove from the heat and leave to cool for 20 minutes. The sauce should now be syrupy, a deep-browny, red colour and very glossy.", "Meanwhile, line a 900g/2lb loaf tin with a double layer of cling film, leaving any excess hanging over the edge. Slice each Madeira cake into eight 2cm/¾in slices.", "Stir the reserved quarter of berries gently into the cooled sauce. Tip the mixture into a large sieve placed over a medium bowl. Leave for two minutes to allow the syrup to drain through but do not press as you don’t want the fruit to become mushy. Sit the sieve on the pan so you can use the fruity syrup you have in the bowl for now. ", "Dip a slice of Madeira cake into the syrup, flip it over and then allow excess syrup to drip off. Place it against one of the long sides of the loaf tin. Continue to dip the slices in the syrup and use 3-4 slices along each side of the tin to cover. Place one on each end and then 2-3 slices along the bottom, breaking up to fit, if necessary. Reserve the remaining slices for the top. ", "Tip the berries from the sieve into the cake lined loaf tin, spreading them evenly. Add any syrup in the pan to the remaining syrup in the bowl and dip the remaining Madeira slices to coat as before. Press the slices on top of the berries to completely cover. Reserve any remaining syrup and store it covered in the fridge for use later. ", "Cover the loaf with the excess cling film and place a small baking tray or a long plate on top. If you have room in your fridge, you can weigh the tray down with a couple of cans of food or something similar to help compress the fruit. Place in the fridge for about six hours, or overnight, until set firm.", "About 10 minutes before serving, make the chocolate sauce. Put the cream in a medium pan over a medium heat and keep a close eye on it, remove just before it comes to the boil. Break the chocolate into the cream and leave to melt for five minutes before gently stirring together. Stir in the hot water to give a smooth, pourable consistency. Pour into a serving jug and keep warm. ", "Open out the cling film on the Madeira cake, turn a serving plate upside down on top of the loaf and turn both over. Remove the tin and peel off the cling film to reveal the pudding. Brush all over with the reserved syrup and decorate the top with the reserved berries and mint leaves. Serve at once with the chocolate sauce. The loaf can be cut into eight slices using a long sharp knife."]}, {"isVegetarian": true, "title": "Madeira cake", "url": "www_bbc_co_uk_food_recipes_madeiracake_73878", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeiracake_73878_16x9.jpg", "ingredients": ["175g/6oz butter, at room temperature", "175g/6oz caster sugar", "3 free-range eggs", "250g/9oz self-raising flour", "2-3 tbsp milk", "1 lemon, zest only", "1-2 thin pieces of candied citron or lemon peel, to decorate"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4. Grease an 18cm/7in round cake tin, line the base with greaseproof paper and grease the paper.", "Cream the butter and sugar together in a bowl until pale and fluffy. Beat in the eggs, one at a time, beating the mixture well between each one and adding a tablespoon of the flour with the last egg to prevent the mixture curdling.", "Sift the flour and gently fold in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the lemon zest. ", "Spoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown on top and a skewer inserted into the centre comes out clean.  ", "Remove from the oven and set aside to cool in the tin for 10 minutes, then turn it out on to a wire rack and leave to cool completely. ", "To serve, decorate the cake with the candied peel."]}, {"isVegetarian": true, "title": "Madeira trifle with raspberries", "url": "www_bbc_co_uk_food_recipes_madeiratriflewithras_83891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/3oz raspberry jam", "225g/8oz madeira cake, sliced", "200g/7oz fresh raspberries", "150ml/5fl oz madeira wine", "570ml/1 pint milk", "1 vanilla pod split", "50g/1¾oz caster sugar", "6 egg yolks", "2 oranges, zest only", "400ml/14fl oz double cream", "25g/1oz toasted flaked almonds"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Spread the jam over the slices of madeira cake and place in the bottom of a large glass dish, or divide evenly between six tall glasses.", "Pour the madiera over the cake and sprinkle the fresh raspberries evenly over the top. ", "To make the custard, bring the milk to the boil with the split vanilla pod. In a separate bowl mix the sugar with the egg yolks.", "Once the milk is boiling, pour onto the egg mixture and return to the pan. Return to the heat and stir until it coats the back of a wooden spoon (do not allow the mixture to boil or it will curdle). Pass through a sieve, add the orange zest and allow to cool. Pour over the Madeira cake and raspberries.", "Whip the double cream. Pipe or spread the double cream over the top.", "Refrigerate overnight, and sprinkle with the toasted flaked almonds just before serving."]}, {"isVegetarian": true, "title": "Madeleines", "url": "www_bbc_co_uk_food_recipes_madeleine_15211", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeleine_15211_16x9.jpg", "ingredients": ["2 free-range eggs", "100g/3½oz caster sugar", "100g/3½oz plain flour, plus extra for dusting", "1 lemon, juice and zest ", "¾ tsp baking powder", "100g/3½oz butter, melted and cooled slightly, plus extra for greasing"], "serves": "Makes 12-16", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Brush the madeleine tray with melted butter then shake in a little flour to coat, tapping out the excess.", "Whisk together the eggs and the sugar in a bowl until frothy. Lightly whisk in the remaining ingredients. Leave to stand for 20 minutes before carefully pouring into the prepared madeleine tray.", "Bake for 8-10 minutes, or until the mixture has risen a little in the middle and is fully cooked through. Transfer the madeleines to a wire rack and leave for a few minutes to cool slightly. These are best eaten within an hour of cooking."]}, {"isVegetarian": true, "title": "Madeleines with raspberry compôte", "url": "www_bbc_co_uk_food_recipes_madeleines_with_89100", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, melted, plus extra for greasing", "250g/9oz plain flour, plus extra for dusting", "360g/12½oz caster sugar", "1 tsp vanilla extract", "3 free-range eggs", "2 tbsp runny honey", "300g/11oz raspberries", "1 tbsp icing sugar", "500ml/18fl oz vanilla ice cream, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Butter and flour a madeleine tin.", "For the madeleines, place the flour and 250g/9oz of the caster sugar into a bowl and add the vanilla extract, eggs, honey and melted butter. ", "Stir well and add a heaped tablespoon of the batter into a madeleine tin. ", "Bake for 15-20 minutes until golden-brown and springy to the touch. Dust with the remaining caster sugar.", "For the raspberry compôte, place the raspberries and icing sugar into a pan over a medium heat.", "Heat until the raspberries are just starting to break down – adding a splash of water if needed.", "Pour the raspberry compôte into a soup plate, place a scoop of ice cream in the centre and place a few madeleines alongside."]}, {"isVegetarian": false, "title": "Madeleines with lemon curd", "url": "www_bbc_co_uk_food_recipes_madeleines_with_lemon_65371", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/madeleines_with_lemon_65371_16x9.jpg", "ingredients": ["3 free-range eggs\t", "130g/4½oz sugar", "200g/7oz plain flour", "10g/¼oz baking powder", "1 unwaxed lemon, finely grated zest only", "20g/¾oz honey", "4 tbsp milk", "200g/7oz butter, melted and cooled", "punnet of raspberries", "icing sugar, for dusting", "1 unwaxed lemon, finely grated zest and juice only ", "pinch of salt", "40g/1½oz sugar", "45g/1¾oz butter", "2 free-range egg yolks"], "serves": "Makes 20-24", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Beat the eggs with the sugar until pale and frothy. Put the flour and baking powder into a separate bowl and add the lemon zest. ", "Mix the honey and milk with the cooled butter, then add to the eggs. In two batches, fold in the flour. Cover and leave to rest in the fridge for a few hours, or overnight.", "Meanwhile, make the lemon curd. Put the lemon zest and juice, salt, sugar and butter into a small saucepan and heat gently until the sugar and butter have melted. Remove from the heat. ", "Whisk the egg yolks in a bowl, then add to the pan and whisk vigorously. Return the pan to a low heat and whisk constantly as the curd starts to thicken. Don’t stop whisking or the eggs will curdle (if the curd starts to boil, take off the heat). Once the curd thickens and releases a bubble or two, remove from the heat and pass the curd through a sieve into a bowl. Place cling film in direct contact with the curd and refrigerate for at least an hour, preferably overnight.", "When you are ready to bake, preheat the oven to 190C/375F/Gas 5. Butter and flour a 12-shell madeleine tin. Put the lemon curd into a piping bag fitted with a small, pointed nozzle and place in the fridge.", "Put a heaped tablespoon of batter into each madeleine shell and press a raspberry deep into the batter. ", "Bake for five minutes and turn the oven off for one minute (the madeleines will get their signature peaks), then turn the oven on to 160C/325F/Gas 3 and bake for a further five minutes. Transfer the madeleines to a wire rack and leave for a few minutes until cool enough to handle. Meanwhile, wash and dry the tin, then repeat the baking as for the first batch. ", "While the second batch is baking, pop the piping nozzle into the mound in each baked madeleine and squirt in a teaspoon’s worth of lemon curd. Repeat with the second batch, then dust with icing sugar and serve straightaway."]}, {"isVegetarian": false, "title": "Madras chicken curry with pilau rice", "url": "www_bbc_co_uk_food_recipes_madras_chicken_curry_82454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp coriander seeds", "2 tbsp fenugreek seeds", "1 tbsp mustard seeds", "1 tsp cumin seeds", "½ tsp fennel seeds", "1 tsp black peppercorns", "1 cinnamon stick", "5 cloves", "3 cardamom pods, seeds removed", "1 tbsp ground turmeric", "2 bay leaves, crushed", "2 tbsp vegetable oil", "1 whole chicken", "1 tbsp vegetable oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "2 red chillies, deseeded and finely chopped", "2cm/1in piece fresh root ginger, chopped", "10 curry leaves", "2 tsp tamarind paste", "1 x 400g/14oz tin tomatoes", "300ml/10½fl oz chicken stock", "2 tbsp fresh coriander", "2 tbsp vegetable oil", "1 onion, thinly sliced", "3 green cardamom pods, crushed", "1 cinnamon stick, broken in half", "4 cloves", "400g/14oz basmati rice"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, heat a small frying pan, once hot add the coriander seeds, fenugreek seeds, mustard seeds, cumin seeds, fennel seeds, black peppercorns, cinnamon stick, cloves and cardamom seeds. Once they start to pop add them to a spice grinder or pestle and mortar and blend until you have a fine powder.", "Place the ground spices, turmeric powder and bay leaves in a small bowl and mix in the oil. Spread half the marinade all over the chicken and leave to marinate for 24 hours.", "To cook the chicken, preheat the oven to 180C/350F/Gas 4.", "Roast the chicken for 1-1½ hours, depending on the size of your chicken. To check if the chicken is ready pierce the chicken by the leg and thigh, if the juices run clear the chicken is cooked. Set aside to rest.", "Meanwhile, for the curry, heat a large frying pan and add the oil. Once hot, add the remaining marinade paste and cook for a few minutes. Add the onion, garlic, chilli, ginger, curry leaves and tamarind paste and cook for a further 2-3 minutes. Add the tomatoes and stock and cook for 10-15 minutes.", "Cut the chicken into eight portions. Add the chicken to the sauce and cook for 3-4 minutes, or until the chicken is hot.", "For the pilau rice, heat the oil in a large saucepan and, once hot, add the onion. Cook until the onions are golden-brown, this will take approximately 10 minutes.", "Stir in the cardamom, cinnamon and cloves. Add the rice and stir to coat in the onion spice mix. Add 600ml/20fl oz water and bring to the boil, reduce the heat to low and cover with a lid. Cook for 15 minutes then turn off the heat, leaving the lid on, and leave to steam for another 15 minutes.", "To serve, place the curry in shallow serving bowls and sprinkle over the chopped coriander. Serve the rice in a separate bowl."]}, {"isVegetarian": false, "title": "Madras fish curry of snapper, tomato and tamarind", "url": "www_bbc_co_uk_food_recipes_madras_fish_curry_of_82254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp vegetable oil", "1 tbsp yellow mustard seeds", "1 large onion, finely chopped", "3 garlic cloves, finely crushed", "30 fresh curry leaves", "2 tsp Kashmiri chilli powder", "2 tsp ground coriander", "2 tsp ground turmeric", "400g/14oz can chopped tomatoes", "100ml/3½fl oz tamarind liquid", "2 green chillies, each sliced lengthways into 6 pieces, with seeds", "1 tsp salt", "700g/1lb 9oz snapper fillets, cut into 5cm/2in chunks", "boiled basmati rice, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based saucepan or karahi over a medium heat. When hot, add the mustard seeds and fry for 30 seconds, then stir in the onion and garlic and fry gently for about 10 minutes, or until softened and lightly golden-brown. ", "Add the curry leaves, chilli powder, coriander and turmeric and fry for two minutes, then stir in the tomatoes, tamarind liquid, green chillies and salt and simmer for about 10 minutes, or until rich and reduced. Add the fish, cook for a further five minutes or until just cooked through, and serve with plain rice."]}, {"isVegetarian": false, "title": "Magic mini fishcakes", "url": "www_bbc_co_uk_food_recipes_magic_mini_fishcakes_42086", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 stalks parsley, chopped", "1 x 105g/3½ oz tin salmon ", "1 spring onion, sliced", "1 slice stale bread, grated into breadcrumbs", "1 tbsp tomato ketchup", "olive oil, for greasing "], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Mix the salmon, parsley, spring onion, one tablespoon breadcrumbs and tomato ketchup together in a bowl. Season with freshly ground black pepper and stir together until well combined.", "Divide the mixture into two and roll into balls. ", "Sprinkle the remaining breadcrumbs onto a place and roll each fishcake in the breadcrumbs until coated.", "Put them on a baking tray and squash them slightly with your hands. Drizzle with a little olive oil.", "Bake for 10-15 minutes or until golden-brown."]}, {"isVegetarian": false, "title": "Mahshi (Lebanese stuffed vegetables)", "url": "www_bbc_co_uk_food_recipes_mahshi_lebanese_stuffed_94132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz uncooked pudding rice", "250g/9oz lamb mince ", "good pinch saffron ", "1 tsp salt", "1 tsp freshly ground black pepper", "1 tsp ground cumin ", "½ tsp cardamom powder", "1 tbsp ghee or vegetable oil", "8 small courgettes, cored ", "8 baby aubergines, cored ", "6 mini peppers, cored ", "1 bulb garlic, cloves separated", "2 tbsp tomato purée", "2 fresh mint sprigs, leaves picked ", "1 tbsp ghee or vegetable oil ", "2 spring onions, finely chopped", "1 small bunch fresh coriander, finely chopped", "1 small bunch fresh parsley, finely chopped", "1–2 fresh mint sprigs, leaves picked and finely chopped", "120g/4½oz rocket", "8 pitta breads, toasted"], "serves": "Serves 6–8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the stuffing, mix the ingredients together in a large bowl. ", "To make the vegetables, stuff the cored courgettes, aubergines and peppers with the stuffing.", "Put the ghee into a large lidded saucepan and lay the stuffed vegetables in a single layer if you can. Tuck the garlic cloves in and around. ", "Mix the tomato purée with 800ml/1pint 8fl oz warm water and the mint, then pour into the pan. Cover with a lid, bring to the boil then reduce the heat to low and simmer for 40 minutes.", "Serve the stuffed vegetables and the cooking juices with the spring onions, herbs and rocket scattered over the top and the pitta breads on the side to soak up the juices. "]}, {"isVegetarian": false, "title": "Make-ahead Christmas gravy", "url": "www_bbc_co_uk_food_recipes_make-ahead_christmas_33532", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/make-ahead_christmas_33532_16x9.jpg", "ingredients": ["1 tbsp light olive oil or vegetable oil", "3 carrots, peeled and roughly chopped", "1 red onion, cut into wedges", "5 chicken wings", "1 large glass white wine (optional)", "1-2 tbsp cornflour, depending on how thick you like your gravy", "2 litres/3½ pints chicken or turkey stock (from 2 stock cubes or jelly pots)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Mix the oil, carrots, onion and chicken wings in a roasting tin. Roast for 45 minutes until the chicken is golden-brown and the vegetables soft. ", "Put the roasting tin on the hob over a medium heat. Add the white wine, if using, or pour in a glass of water. De-glaze the tin and scrape off any caramelised bits on the bottom of the tin. Remove from the heat.", "Use a slotted spoon to transfer the vegetables and chicken to a large saucepan. Stir in the cornflour until combined. Add the liquid from the roasting tin and the stock. Bring to the boil and simmer for 15-20 minutes. As it bubbles away use a fork to break up the chicken and vegetables as much as you can.", "Strain the gravy through a fine sieve into a freezeable container, pushing through as much of the chicken and vegetables as you can. Season, to taste, with salt and pepper.", "Allow the gravy to cool completely. Then cover with a lid and transfer to the freezer. (It will keep in the freezer for up to 3 months). Defrost in the fridge the night before you want to serve it. ", "Reheat in the microwave for 4 minutes on high. Alternatively, if you have the time, add it to the roasting tray when the turkey is resting. Heat gently, and stir thoroughly to incorporate all the flavours from the turkey. Stir well and transfer to a serving jug. "]}, {"isVegetarian": true, "title": "Maids of Honour tarts", "url": "www_bbc_co_uk_food_recipes_maids_of_honour_tarts_94296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz puff pastry", "50g/1¾oz butter, softened", "50g/1¾oz caster sugar", "1 free-range egg, beaten", "1 tbsp plain flour", "50g/1¾oz ground almonds", "½ tsp grated nutmeg or ground mace", "2 lemons, zest only", "100g/3½oz curd cheese"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Roll the pastry out slightly thinner than a one pound coin, then stamp out twelve 9cm/3½in rounds and use to line a 12-hole non-stick patty tin. Place the tray of pastry discs in the fridge while you make the filling.", "Cream together the butter and sugar in a bowl until pale and fluffy. Beat in the egg, flour, ground almonds, nutmeg (or ground mace) and lemon zest. Stir in the curd cheese, being careful not to overwork the mixture as it can split. ", "Spoon the mixture into the tart cases and bake for 25 minutes, or until risen and lightly browned on top. Transfer to a wire rack and leave to cool completely before serving."]}, {"isVegetarian": true, "title": "Make-ahead red cabbage", "url": "www_bbc_co_uk_food_recipes_make-ahead_red_cabbage_13106", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/make-ahead_red_cabbage_13106_16x9.jpg", "ingredients": ["knob of butter", "2 tbsp olive oil", "1 onion, finely sliced or chopped", "1 tsp ground cinnamon", "½ tsp ground nutmeg (optional)", "1 x 600g/1lb 5oz red cabbage, shredded finely using a food processor (white core discarded)", "3 tbsp soft brown sugar ", "3 eating apples, peeled, cored and diced", "100ml/3½fl oz red wine vinegar", "2 tsp redcurrant or cranberry sauce (optional)"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a large lidded saucepan. When hot, add the onion and fry gently until softened. Stir in the spices. Add the cabbage and fry for 3-4 minutes, stirring occasionally, until glossy.", "Stir in the sugar, apples and red wine vinegar. Cover with a lid and let it cook gently for 30 minutes.", "Stir in the redcurrant or cranberry sauce (if using) and cook for a further 10 minutes. If you aren’t using the sauce, taste the cabbage and add a little more sugar if it’s too tart for your taste. "]}, {"isVegetarian": false, "title": "Maki rolls with pickled ginger", "url": "www_bbc_co_uk_food_recipes_makirollswithpickled_85325", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp caster sugar", "2 tbsp white wine vinegar", "2.5cm/1in piece root ginger, peeled and thinly sliced on a mandoline", "1 sheet nori (Japanese dried seaweed)", "100g/3½oz cooked sticky rice or Japanese sushi rice (sticky rice and sushi rice are available at some Asian grocers)", "85g/3oz tuna steak, sliced into thin strips", "4-5 sticks cucumber", "½ avocado, sliced lengthways", "white wine vinegar or rice wine vinegar, to brush"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickled ginger, place the sugar and vinegar into a small saucepan and heat gently until the sugar is dissolved. Remove from the heat, add the sliced ginger and stir to coat. Set aside and allow to cool for five minutes.", "For the maki rolls, lay the nori sheet on a bamboo sushi mat. Spread the rice over two-thirds of the sheet, leaving a 1cm/½in border at the top.", "Spread the tuna strips and cucumber sticks lengthways across the sheet, then place the avocado slices on top.", "Brush the border with vinegar and roll the nori sheet up very tightly over the filling using the bamboo mat, to make a cigar shape, sealing across the border at the top.", "To serve, slice the roll into rounds and place onto a serving plate with the pickled ginger."]}, {"isVegetarian": false, "title": "Malay lamb korma", "url": "www_bbc_co_uk_food_recipes_malaylambkorma_93512", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 cloves ", "10 black peppercorns ", "4 cardamom pods ", "1 cinnamon stick", "4 dried red chillies ", "4 tbsp coriander seeds", "2 tbsp cumin seeds ", "1 tsp fennel seeds ", "1 star anise ", "1 tsp turmeric powder", "2 tbsp vegetable oil, or ghee", "500g/1lb 2oz lamb leg, cut into 5cm/2in cubes ", "2 onions, peeled, thinly sliced ", "1cm/½in root ginger, peeled, grated", "1 clove garlic, peeled, crushed", "1½ tbsp Malaysian curry powder (see above)", "1 tsp chilli powder ", "salt", "½ tsp saffron strands, soaked in 50ml/2fl oz warm water", "110g/4oz cashew nuts, blended to a paste with 2 tbsp water", "1 cinnamon stick", "250ml/9fl oz plain yoghurt", "2 tomatoes, cut into quarters", "2 tbsp chopped fresh coriander leaves", "300g/11oz basmati rice, cooked according to packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the Malaysian curry powder, toast all of the spices, except the turmeric, in a dry frying pan, for 30 seconds-1 minute, or until they become fragrant. Set aside to cool slightly.", "Grind the toasted spices and turmeric to a powder using a pestle and mortar.", "For the Malay korma, heat one tablespoon of the oil in a lidded wok, add the lamb, in batches if necessary, and stir-fry for 2-3 minutes, or until browned all over. Remove the lamb from the wok and set aside.", "Heat the remaining oil in the wok used to cook the lamb and fry the onion, ginger, garlic, 1 ½ tablespoons of the Malaysian curry powder and all of the chilli powder for 1-2 minutes, or until fragrant (NB: Do not let the mixture burn).", "Add the reserved lamb to the wok and season to taste, with salt. Stir until well combined. Stir in the saffron strands and soaking water, cashew nut paste, cinnamon stick, then pour in enough water to cover the lamb by 2.5cm/1in. Bring the mixture to the boil, then reduce the heat, cover the wok with the lid and simmer, stirring occasionally, for 1¼-1½ hours. (You may need to add more water if the mixture begins to dry out.)", "Stir in the yoghurt and tomatoes and return the mixture to a simmer for 1-2 minutes.", "To serve, spoon the rice into each of 4 serving bowls, top each bowl with some lamb curry and garnish with the coriander leaves."]}, {"isVegetarian": false, "title": "Malaysian-style chicken curry", "url": "www_bbc_co_uk_food_recipes_malaysian-style_chicken_98338", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/malaysian-style_chicken_98338_16x9.jpg", "ingredients": ["2 onions,  quartered", "20g/¾oz fresh root ginger, peeled, coarsely grated", "6 garlic cloves, peeled", "2 tbsp medium curry powder", "1 tsp dried chilli flakes", "1 tsp ground turmeric", "2 tbsp sunflower oil", "8 chicken thighs, boned, skinned, halved", "1 cinnamon stick", "3 star anise", "500g/1lb 2oz large waxy potatoes, peeled, cut into 3cm/1¼in chunks", "3 carrots, peeled, sliced into 1.5cm/½in rounds", "2 tbsp cornflour", "400ml tin coconut milk", "150g/5oz green beans, trimmed and cut in half", "freshly ground black pepper"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put all of the curry paste ingredients in a food processor and blend. You will need to remove the lid and push the mixture down a couple of times using a rubber spatula.", "Heat a large, non-stick frying pan over a medium heat.  Spoon in the curry paste and cook for 2-3 minutes, stirring constantly, until fragrant.  ", "Season the chicken thighs on all sides with lots of pepper.", "Add the chicken thighs, cinnamon and star anise to the pan, stir well and cook for 2-3 minutes, turning the chicken pieces once or twice until they are pale golden-brown. ", "Stir in 100ml/3½fl oz water and bring the mixture to the boil. Transfer to the slow cooker and add the potatoes and carrots.", "In a bowl, whisk 2 tablespoons water with the cornflour to form a thin paste. Stir in the coconut milk and pour over the curry. Stir well to combine.", "Cover and cook on high for 3 hours, or until the chicken and vegetables are tender and the sauce has thickened. Just before the end of the cooking time, stir in the green beans. ", "Serve the curry just as it is, or with small portions of steamed rice."]}, {"isVegetarian": false, "title": "Malaysian prawn fritters with crispy seaweed", "url": "www_bbc_co_uk_food_recipes_malaysianprawnfritte_71364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb raw prawns, shelled and de-veined", "225g/8oz fresh bean sprouts, rinsed", "120g/4½oz plain flour", "2 tsp baking powder", "2 small, fresh red chillies, seeded and finely chopped", "1 tsp ground coriander", "½ tsp ground turmeric", "2 tbsp finely chopped spring onions", "2 tbsp finely chopped fresh coriander", "1 tsp salt", "2 eggs, beaten", "400ml/14fl oz oil, preferably groundnut, for deep-frying", "freshly ground black pepper", "1.25kg/12oz bok choi", "900ml/30fl oz groundnut oil", "1 tsp salt", "2 tsp sugar", "50g/2oz pine kernels, lightly roasted"], "serves": "Makes 20", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Finely chop half the prawns. ", "Combine the chopped prawns with the bean sprouts, flour, baking powder, chillies, ground coriander, turmeric, spring onions, fresh coriander, salt, pepper and eggs. Mix well.", "Take a dessertspoonful of the chopped mixture, place one whole prawn on top and press it into the mixture so that the prawn is set in. Continue until you have used up all the mixture and whole prawns.", "Heat the oil in a deep-fat fryer or a large wok. ", "Deep-fry the fritters, a few at a time, for 2-3 minutes, until they are golden brown. Drain them on kitchen paper and serve at once.", "For the seaweed, separate the stalks from the stem of the bok choi and then cut the green leaves from the white stalks.  ", "Wash the leaves in several changes of cold water, then drain them thoroughly and dry in a salad spinner.  ", "Roll the leaves up tightly, a few at a time, and finely shred them into strips 5mm wide.  ", "Spread them out on a baking sheet and put them in an oven preheated to 130C/250F/Gas 1 for 15 minutes to dry slightly.", "They should not be completely dry or they will burn when fried.  Remove from the oven and leave to cool.  This can be done the day before.  ", "Heat a wok over a high heat, then add the oil.  When the oil is hot and slightly smoking deep-fry the greens in three or four batches.  After about 30-40 seconds, when they turn crisp and green, remove them immediately from the wok and drain well on kitchen paper.  ", "Leave to cool.  ", "Toss the crispy greens with the salt and sugar. ", "Garnish with the pine kernels and serve."]}, {"isVegetarian": true, "title": "Malt, chocolate and orange iced ‘beer’ biscuits", "url": "www_bbc_co_uk_food_recipes_malt_chocolate_and_09403", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/malt_chocolate_and_09403_16x9.jpg", "ingredients": ["150g/5½oz dark chocolate (72% cocoa solids)", "250g/9oz unsalted butter", "250g/9oz golden caster sugar", "2 free-range eggs", "5 tbsp malt extract", "750g/1lb 10oz self-raising flour", "6 heaped tbsp malted drink powder", "2 oranges, juice and zest only", "1½ tsp vanilla extract", "1kg/2lb 4oz royal icing sugar", "yellow food colouring", "black food colouring "], "serves": "Makes 24 large beer-mug shaped biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 175C/155C Fan/Gas 4. Line two large baking trays with baking paper.", "Break the chocolate into small pieces using a food processor or a sharp knife. ", "Cream the butter and sugar together in a large bowl. Beat in the eggs and the malt extract until smooth. Mix in the flour (reserving 2 teaspoons for dusting), malted drink powder, orange zest and chocolate. Using your hands bring the mixture together to form a dough. If it’s a bit dry add the juice from the orange. ", "Lightly flour the work surface with some of the remaining flour and roll out the dough to about 5mm thick. Use the beer cutter or template to cut out 24 beer mug biscuits or 48 x 7cm/2¾in round biscuits.", "Bake for between 15—20 minutes, or until pale golden-brown. You can bake them in batches if you don’t have enough baking trays. Cool on wire racks while you make the royal icing mixture", "Put 200ml/7fl oz water in a bowl and gradually add the royal icing sugar, beating until smooth. It should be fairly thick and hold its shape, but loose enough to pipe. ", "Divide the icing between three bowls and colour one bowl black, one bright yellow and leave the third white. Transfer the icing to piping bags fitted with small plain nozzles (the nozzle for the black icing should be very fine, but the others can be a little bigger). ", "When the biscuits are completely cool, draw the outline of the beer mug on each one using the black icing, set aside to dry. Then flood the bottom part of the mug with yellow. Top the beer mug with white and add black details when dried. Place on wire racks to allow the icing to set. "]}]