[{"isVegetarian": true, "title": "Classic chocolate éclair", "url": "www_bbc_co_uk_food_recipes_classic_chocolate_clair_21075", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter", "1 tsp caster sugar", "pinch salt", "150g/5oz strong flour", "4 eggs", "100g/3½oz dark chocolate", "150g/5½ oz fondant icing sugar", "4 tbsp cocoa powder", "1.2 litres/2 pints double cream", "2 vanilla pods, seeds only"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a baking sheet with baking paper, and line a tray with baking paper.", "Put 250ml/9floz water into a pan with the salt, sugar and butter and bring to the boil. Add the flour in one go and cook for a few minutes, beating all the time, until the mixture comes away from the sides of the pan cleanly and is smooth. It will sound like bacon frying in a pan when it’s ready!", "Tip out onto the lined tray and leave to cool in the fridge for 5 minutes.", "Transfer to a kitchen mixer or large bowl and beat in the eggs, one at a time, then continue to beat until the mixture is rich and smooth.", "Spoon the mixture into a piping bag fitted with a large, plain nozzle, then pipe 8 to 12 strips, to make long éclair shapes, onto the prepared baking sheet. Smooth out any bumps with the tip of a wet finger then sprinkle them with a little water.", "Bake in the oven for 25-30 minutes until golden-brown and crisp. ", "Remove from the oven and transfer the éclairs from the baking tray to a wire rack to cool.", "Meanwhile, put the chocolate in a bowl set over a pan of water and simmer until the chocolate has melted.", "Remove from the heat and add the icing sugar and cocoa and beat together. Add 2 tablespoons of hot water from the saucepan and beat until smooth then add 3-4 more tablespoons, a little at a time, until you have a smooth shiny pourable icing. Place back over the pan of water, off the heat, to keep warm until ready to use. ", "Whip the double cream until soft peaks form when the whisk is removed and spoon into a piping bag.", "Using the end of a clean, ink free biro, make a hole on the top of the éclair at either end. Carefully insert the nozzle into the holes, and fill with the cream.", "Dip the éclairs into the fondant chocolate to cover the top evenly and leave to set before serving."]}, {"isVegetarian": true, "title": "Classic chocolate éclair", "url": "www_bbc_co_uk_food_recipes_classic_chocolate_clair_72793", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz water", "115g/4oz butter", "200g/7oz plain flour", "1 tsp caster sugar", "pinch salt", "4 free-range eggs", "50g/2oz dark chocolate, chopped", "150g/5½oz fondant icing sugar", "2 tbsp dark cocoa powder", "450ml/16fl oz double cream"], "serves": "Makes 8-12 éclairs", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with greaseproof paper.", "Heat the water and butter in a saucepan until the butter has melted.  ", "Beat in the flour, sugar and salt until the mixture is smooth, then continue to cook for 2-3 minutes. Remove the pan from the heat and beat in the eggs, one at a time, until smooth and glossy. ", "Set aside to cool, then spoon the dough into a piping bag fitted with a medium size nozzle.", "Pipe 12.5cm/5in lines onto the baking tray and bake in the oven for 20-25 minutes, or until golden-brown and crisp.", "Remove the éclairs from the oven and set aside to cool on a wire rack.", "Meanwhile, heat the dark chocolate and two tablespoons of water in a saucepan until the chocolate has melted.", "Sieve the icing sugar and cocoa into a bowl, then add the melted chocolate and water and beat until the mixture is smooth and thickened.", "Spoon the mixture into a piping bag.", "Whip the double cream in a bowl until stiff peaks just form when the whisk is removed. Spoon the mixture into a piping bag fitted with a small nozzle. Carefully insert the nozzle into the base of the éclairs and fill with cream. ", "Pipe the fondant chocolate on top of the éclairs and set aside until set."]}, {"isVegetarian": true, "title": "Mary Berry's classic Christmas cake", "url": "www_bbc_co_uk_food_recipes_classic_christmas_cake_04076", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_christmas_cake_04076_16x9.jpg", "ingredients": ["175g/6oz raisins", "350g/12oz natural glacé cherries, halved, rinsed, and thoroughly dried ", "500g/1lb 2oz currants", "350g/12oz sultanas", "150ml/¼pt brandy or sherry, plus extra for feeding", "2 oranges, zest only", "250g/9oz butter, softened", "250g/9oz light muscovado sugar", "4 free-range eggs, at room temperature", "1 tbsp black treacle", "75g/3oz blanched almonds, chopped", "250g/9oz plain flour", "1½ tsp mixed spice", "about 3 tbsp apricot jam, warmed and sieved", "icing sugar", "675g/1lb 8oz marzipan ", "3 free-range eggs, whites only", "675g/1½lb icing sugar, sifted", "3 tsp lemon juice", "1½ tsp glycerine"], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the cake, place all the dried fruit, including the cherries, into a large mixing bowl, pour over the brandy and stir in the orange zest. Cover with clingfilm and leave to soak for three days, stirring daily.", "Grease and line a 23cm/9in deep, round tin with a double layer of greased greaseproof paper. Preheat the oven to 140C/275F/Gas 1.", "Measure the butter, sugar, eggs, treacle and almonds into a very large bowl and beat well (preferably with an electric free-standing mixer). Add the flour and ground spice and mix thoroughly until blended. Stir in the soaked fruit. Spoon into the prepared cake tin and level the surface. ", "Bake in the centre of the preheated oven for about 4-4½ hours, or until the cake feels firm to the touch and is a rich golden brown. Check after two hours, and if the cake is a perfect colour, cover with foil. A skewer inserted into the centre of the cake should come out clean. Leave the cake to cool in the tin.", "When cool, pierce the cake at intervals with a fine skewer and feed with a little extra brandy. Wrap the completely cold cake in a double layer of greaseproof paper and again in foil and store in a cool place for up to three months, feeding at intervals with more brandy. (Don’t remove the lining paper when storing as this helps to keep the cake moist.)", "The week before you want to serve, begin covering the cake.", "For the covering, stand the cake upside down, flat side uppermost, on a cake board which is 5cm/2in larger than the size of the cake.", "Brush the sides and the top of the cake with the warm apricot jam. ", "Liberally dust a work surface with icing sugar and then roll out the marzipan to about 5cm/2in larger than the surface of the cake. Keep moving the marzipan as you roll, checking that it is not sticking to the work surface. Dust the work surface with more icing sugar as necessary. ", "Carefully lift the marzipan over the cake using a rolling pin. Gently level and smooth the top of the paste with the rolling pin, then ease the marzipan down the sides of the cake, smoothing it at the same time. If you are careful, you should be able to cover the cake with no excess marzipan to trim but, if necessary, neatly trim excess marzipan from the base of the cake with a small sharp knife. Cover the cake loosely with baking parchment and leave for a few days to dry out before adding the royal icing. ", "For the royal icing, whisk the egg whites in a large bowl until they become frothy. Mix in the sifted icing sugar a tablespoonful at a time. You can do this with a hand-held electric whisk, but keep the speed low.", "Stir in the lemon juice and glycerine and beat the icing until it is very stiff and white and stands up in peaks.", "Cover the surface of the icing tightly with clingfilm and keep in a cool place until needed. ", "To ice the cake, place all the icing onto the top of the cake. Spread evenly over the top and sides of the cake with a palette knife. For a snow-peak effect, use a smaller palette knife to rough up the icing. ", "Leave the cake loosely covered overnight for the icing to harden a little, then wrap or store in an airtight container in a cool place until needed. "]}, {"isVegetarian": false, "title": "Classic coq au vin", "url": "www_bbc_co_uk_food_recipes_classic_coq_au_vin_52046", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp plain flour", "1 x 2kg/4lb 8oz good-quality chicken, jointed into 10 pieces", "175g/6oz butter", "1 white onion, roughly chopped", "225g/8oz smoked streaky bacon, cut into lardons", "500ml/17fl oz red wine", "50ml/2fl oz brandy", "2 garlic cloves, lightly crushed", "3 bay leaves", "4 sprigs fresh thyme", "1kg/2lb 4oz King Edward potatoes", "200ml/7fl oz double cream", "100g/3½oz silverskin onions, left whole", "200g/7oz baby button mushrooms", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the flour onto a plate and dredge the chicken pieces in the flour to coat thoroughly.", "Heat 50g/2oz of the butter in a large ovenproof casserole over a high heat. When the butter is foaming, add the chicken pieces, in batches, skin-side down, and fry for 2-3 minutes, or until browned on each side. Remove the chicken from the pan, then add the chopped white onion and fry for 1-2 minutes.", "Return the chicken to the pan, add the bacon lardons and fry for a further 1-2 minutes, or until just starting to crisp. ", "Pour in the red wine and brandy, add the garlic, bay leaf and thyme, then bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for 1 hour, or until the chicken is tender and cooked through to the bone, with no trace of pink remaining.", "While the chicken cooks, bring the potatoes to the boil in a pan of cold, salted water. Reduce the heat and simmer the potatoes for 12-15 minutes, or until tender. Drain well and return to the pan, then place the pan over a low heat for a couple of minutes to dry the potatoes slightly.", "Mash the potatoes through a ricer until very smooth, then beat in 100g/3½oz of the remaining butter and all of the cream. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "When the chicken is tender, heat the remaining butter in a frying pan over a medium heat. Add the silverskin onions and button mushrooms and fry until golden-brown, then stir them into the coq au vin and season again.", "To serve,ladle the coq au vin onto serving plates with a dollop of mashed potatoes alongside."]}, {"isVegetarian": false, "title": "Classic Cornish pasty", "url": "www_bbc_co_uk_food_recipes_classic_cornish_pasty_67037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_cornish_pasty_67037_16x9.jpg", "ingredients": ["500g/1lb 1oz strong bread flour ", "120g/4oz vegetable shortening or suet", "1 tsp salt ", "25g/1oz margarine or butter", "175ml/6fl oz cold water ", "1 free-range egg, beaten with a little salt (for glazing)", "350g/12oz good-quality beef skirt, rump steak or braising steak ", "350g/12oz waxy potatoes", "200g/7oz swede", "175g/6oz onions", "salt and freshly ground black pepper", "knob of butter or margarine"], "serves": "Makes 4 large pasties", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Tip the flour into the bowl and add the shortening, a pinch of salt, the margarine or butter and all of the water.", "Use a spoon to gently combine the ingredients. Then use your hands to crush everything together, bringing the ingredients together as a fairly dry dough. ", "Turn out the dough onto a clean work surface (there’s no need to put flour or oil onto the surface because it’s a tight rather than sticky dough).", "Knead the dough to combine the ingredients properly. Use the heel of your hand to stretch the dough. Roll it back up into a ball, then turn it, stretch and roll it up again. Repeat this process for about 5-6 minutes. The dough will start to become smooth as the shortening breaks down. If the dough feels grainy, keep working it until it’s smooth and glossy. Don’t be afraid to be rough – you’ll need to use lots of pressure and work the dough vigorously to get the best results.", "When the dough is smooth, wrap it in cling film and put it in the fridge to rest for 30–60 minutes.", "While the dough is resting, peel and cut the potato, swede and onion into cubes about 1cm/½in square. Cut the beef into similar sized chunks. Put all four ingredients into a bowl and mix. Season well with salt and some freshly ground black pepper, then put the filling to one side until the dough is ready.", "Lightly grease a baking tray with margarine (or butter) and line with baking or silicone paper (not greaseproof).", "Preheat the oven to 170C (150C fan assisted)/325F/Gas 3. ", "Once the dough has had time to relax, take it out of the fridge. The margarine or butter will have chilled, giving you a tight dough. Divide the dough into four equal-sized pieces. Shape each piece into a ball and use a rolling pin to roll each ball into a disc roughly 25cm/10in wide (roughly the same size as a dinner plate).", "Spoon a quarter of the filling onto each disc. Spread the filling on one half of the disc, leaving the other half clear. Put a knob of butter or margarine on top of the filling.", "Carefully fold the pastry over, join the edges and push with your fingers to seal. Crimp the edge to make sure the filling is held inside – either by using a fork, or by making small twists along the sealed edge. Traditionally Cornish pasties have around 20 crimps. When you’ve crimped along the edge, fold the end corners underneath.", "Put the pasties onto the baking tray and brush the top of each pasty with the egg and salt mixture. Bake on the middle shelf of the oven for about 45 minutes or until the pasties are golden-brown. If your pasties aren't browning, increase the oven temperature by 10C/25F for the last 10 minutes of cooking time."]}, {"isVegetarian": true, "title": "Classic crème caramel", "url": "www_bbc_co_uk_food_recipes_classic_crme_caramel_44792", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_crme_caramel_44792_16x9.jpg", "ingredients": ["160g/6oz sugar", "unsalted butter, for greasing the ramekins", "4 free-range eggs", "1 tsp vanilla extract", "25g/1oz caster sugar", "600ml/1 pint full-fat milk", "pouring cream, to serve"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat oven 150C/300F/Gas 2.  Warm the ramekins in the oven, so they are warm when the caramel is poured in.", "First make the caramel. Pour the sugar and six tablespoons of water into a clean stainless steel pan.", "Dissolve the sugar slowly, stirring with a wooden spoon over a low heat.  ", "When there are no sugar granules left, stop stirring and boil until the sugar turns a dark copper colour. ", "Remove immediately from the heat to ensure the caramel does not burn.  Quickly pour the caramel into the warmed ramekins.  ", "Set aside to cool and become hard.  (Do not put in the fridge because the sugar will absorb moisture and go soft and tacky).", "Once hard, butter the sides of the ramekins above the level of the caramel.", "For the custard, whisk the eggs, vanilla extract and caster sugar together in a bowl until well mixed.", "Pour the milk into a saucepan, gently heat over a low heat until you can still just dip your finger in for a moment, then strain the milk through a fine sieve onto the egg mixture in the bowl.  ", "Whisk together until smooth, then pour the mixture into the prepared ramekins.", "Stand the ramekins in a roasting tin and fill the tin half-way with boiling water from a kettle.  ", "Cook in the oven for about 20-30 minutes or until the custard has set.  Do not overcook the custard – check around the edges of the dishes, to make sure no bubbles are appearing.", "Take the crème caramels out of the oven, remove the ramekins from the tray and set on a cooling rack.  When cool, transfer to the fridge overnight so that the caramel is absorbed into the custard.", "To serve, loosen the sides of the custard by tipping the ramekin and loosen with a small palette knife round the edges.  Place a serving dish on top of the ramekin and turn upside down.  Serve with pouring cream."]}, {"isVegetarian": false, "title": "Classic fish pie with peas", "url": "www_bbc_co_uk_food_recipes_classic_fish_pie_with_86482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium baking potatoes", "1 tbsp vegetable oil", "handful rock salt", "1 onion, thinly sliced", "½ tsp black peppercorns", "2 bay leaves", "500g/1lb 2oz boneless, skinless smoked haddock", "400g/14oz haddock, bones and skin removed", "400g/14oz cod, bones and skin removed", "200g/7oz butter", "3 heaped tablespoons plain flour", "475ml/17fl oz milk", "1 lemon, zest and juice", "small bunch flatleaf parsley, leaves roughly chopped", "250g/9oz cooked peeled prawns", "grated cheese, for topping", "200g/7oz peas", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Prick the potatoes all over with a fork, then rub each one with a little of the oil. Sprinkle a roasting tray with the rock salt and place the potatoes on top. Bake for 1-1½ hours, or until tender.", "Meanwhile, half-fill a large frying pan with water and bring to a simmer. Add the onion, black peppercorns, bay leaves and all of the fish, poach for 3-4 minutes. Lift the fish from the pan using a slotted spoon, and set aside. Strain the fish stock through a sieve suspended over a large bowl. Reserve the strained stock and discard the onion, bay leaves and peppercorns.", "Melt 100g/3½oz of the butter in a saucepan over a medium heat. Whisk in the flour to form a smooth paste, then cook for a further 1-2 minutes. ", "Whisk in 50ml/2fl oz of the milk until it is fully incorporated into the roux. Continue to add 350ml/12fl oz of the remaining milk to the roux little by little, whisking after each addition, until the sauce is smooth and thick.", "Pour 750ml/25fl oz of the fish stock to the roux sauce, stir well and cook for 4-5 minutes, or until the sauce is smooth and just thick enough to coat the back of a spoon. Any remaining fish stock can be chilled and frozen for use in another dish.", "Stir in the lemon zest and juice, and the parsley, then season with salt and pepper. Remove from the heat. Stir the prawns into the sauce, then flake in the poached fish, keeping it in reasonably large pieces. Transfer the pie filling to a large ovenproof dish.", "When the potatoes are cooked, remove them from the oven and increase the oven temperature to 220C/200C Fan/Gas 7.", "When the potatoes are just cool enough to handle, slice them in half, scoop out the flesh and pass it through a potato ricer into a pan set over a medium heat. Add 75g/2¾oz of the butter and the remaining of milk to the potatoes and beat over the heat until the mash is smooth and thick and not too soft. ", "Spoon the mash into a piping bag with a large star-shaped nozzle and pipe the mashed potato all over the fish pie filling. Sprinkle over the grated cheese. Alternatively, just spread the mashed potato onto the filling using a palette knife.", "Place the ovenproof dish onto a baking sheet and cook in the oven for 5-10 minutes, or until the cheese and potatoes are golden-brown and the pie is heated through.", "While the fish pie heats through, bring a pan of salted water to the boil, add the peas and cook for 2-3 minutes, until tender. Drain well and return to the pan, then stir in the remaining butter and season with salt and pepper. Serve the fish pie with the peas alongside."]}, {"isVegetarian": false, "title": "Classic lasagne", "url": "www_bbc_co_uk_food_recipes_classic_lasagne_07638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp extra virgin olive oil ", "300g/10½oz beef mince", "300g/10½oz pork mince ", "1 large glass red wine", "1 small onion, finely chopped ", "2 carrots, finely chopped ", "1 stick celery, finely chopped", "salt and freshly ground black pepper", "1 x 400g/14oz tin chopped plum tomatoes ", "40g/1½oz butter ", "40g/1½oz plain flour ", "500ml/18fl oz milk ", "salt and pepper ", "100g/3½oz grated parmesan cheese ", "8-10 sheets fresh egg lasagne  ", "1 ball mozzarella "], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the ragù sauce, in a large pan, heat the olive oil, add the mince and brown well. Add the red wine to deglaze the pan and cook until it has almost evaporated. ", "Tip in the onion, carrots and celery and fry for a couple of minutes. Season with salt and pepper, then add the chopped tomatoes and rinse the tin out with water and add the water from the tin to the pan. Lower the heat, cover with a lid and gently simmer for two hours, stirring from time to time.  ", "Preheat the oven to 200C/400F/Gas 6.  ", "For the white sauce, melt the butter in a small pan on a medium heat, stir in the flour with either a wooden spoon or small hand whisk (this will avoid lumps from forming) to form a paste and stir in a little of the milk.  ", "Add the remaining milk, stirring all the time until it begins to thicken to a creamy consistency.  Remove from the heat, add salt and pepper and stir in 20g/¾oz of the grated parmesan cheese.    ", "Line an ovenproof rectangular dish of about 22 x 26cm/8½ x 10½in with a little of the ragù sauce, arrange sheets of lasagne over followed by ragù sauce, dots of mozzarella and white sauce and a sprinkling of grated parmesan. Continue to make layers like this until you have finished all the ingredients, ending with a topping of white sauce. Hold back some of the ragù to dot over the top and sprinkle with parmesan cheese.  ", "Cover with foil and bake for 35-40 minutes, or until golden-brown.  Remove the foil for the last five minutes of cooking.  Allow to rest for a couple of minutes before serving.  "]}, {"isVegetarian": true, "title": "Classic rum baba", "url": "www_bbc_co_uk_food_recipes_classic_rum_baba_38141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz self-raising flour", "10g salt ", "100g/3½oz caster sugar", "20g/¾oz fast-action dried yeast", "6 free-range eggs", "2 tsp warm milk", "150g/5½oz unsalted butter, softened", "100ml/3½fl oz dark rum ", "200g/7oz caster sugar ", "150ml/5fl oz thick vanilla cream, to taste", "dark rum, to taste"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the flour, salt and sugar in a large mixing bowl. ", "Mix the yeast with 150ml/5fl oz warm water in a small bowl to dissolve the yeast.", "Beat the eggs and milk together with a whisk. Add to a medium saucepan and bring to a simmer. Remove and cool immediately.", "Using a free-standing electric mixer, tip the yeast into the flour mixture and gradually add the eggs and milk, beating all the time, to make a batter. Gradually add the soft butter to make a dough. Place in a bowl and cover for one hour.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Knock back the dough and kneed for a few minutes. Leave in a non-stick 20cm/8in savarin tin to rise for 20 minutes or so, covered. ", "Bake for 30 minutes or more - depending on the tin depth - until risen and golden. Leave to cool for 10 minutes before turning out of the tin.", "For the glaze, heat the rum, 300ml/10fl oz water and the sugar in a saucepan until reduced to a thick glaze.", "To serve, pour over the glaze over the baba. Serve with thick vanilla cream and more neat rum."]}, {"isVegetarian": true, "title": "Classic sourdough", "url": "www_bbc_co_uk_food_recipes_classic_sourdough_21029", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_sourdough_21029_16x9.jpg", "ingredients": ["375g/13oz strong white flour, plus extra for dusting", "250g/9oz sourdough starter", "7.5g salt", "130-175ml/4-6fl oz tepid water", "olive oil, for kneading"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the flour, starter and salt in a large mixing bowl. Add the water, a little at a time, and mix with your hands to make a soft dough (you may not need all of the water).", "Coat a chopping board or work surface with olive oil, then tip the dough onto it and knead the dough for 10-15 minutes, or until the dough forms is smooth and elastic. ", "Tip the dough into a lightly oiled bowl and cover with cling film. Leave to rise in a warm place for five hours, or until at least doubled in size. ", "Knead the dough until it’s smooth, knocking the air out. Roll into a ball and dust with flour. ", "Tip the dough into a well-floured round banneton or proving basket and leave to rise for 4-8 hours.", "Put a tray half filled with water on the bottom oven shelf and preheat the oven to 220C/425F/Gas 7. ", "Gently tip the risen dough onto a lined baking tray.  Bake the loaf for 30 minutes at this heat, then reduce the heat to 200C/400F/Gas 6 and bake for a further 15-20 minutes. Cool on a cooling rack.  "]}, {"isVegetarian": true, "title": "Chocolate and ginger oat biscuits", "url": "www_bbc_co_uk_food_recipes_classic_stem_ginger_83286", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_stem_ginger_83286_16x9.jpg", "ingredients": ["225g/8oz unsalted butter", "100g/3½oz golden syrup", "200g/7oz soft brown sugar", "150g/3½oz plain flour", "2 tsp baking powder", "1 tsp sea salt flakes ", "4 tsp ground ginger", "2 tsp ground cinnamon", "400g/14oz rolled oats", "2 free-range eggs, beaten", "50g/1¾oz stem ginger, chopped", "115g/4oz good quality dark chocolate"], "serves": "Makes 24 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line two baking trays with non-stick parchment. Melt the butter and the golden syrup in a pan over a low heat. Set aside to cool slightly.  ", "Combine the sugar, flour, baking powder, salt and spices and mix well to combine. Stir in the rolled oats and mix thoroughly. Pour in the melted butter and syrup and stir until well combined. Then stir in the beaten eggs and the stem ginger.", "Spoon in even, heaped teaspoons onto the lined baking trays, leaving room for them to spread. Bake in the oven for 8-10 minutes. Remove the biscuits from the oven and set aside to cool completely.", "Melt the chocolate in a bowl suspended over a pan of barely simmering water (do not let the bottom of the bowl touch the water). Dip the biscuits in the melted chocolate and place on a cooling rack until the chocolate has set."]}, {"isVegetarian": false, "title": "Classic toad in the hole", "url": "www_bbc_co_uk_food_recipes_classic_toad_in_the_hole_67862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "8 free-range eggs", "1 tbsp wholegrain mustard", "570ml/1 pint milk", "75g/2¾oz beef dripping (or lard)", "6 good quality sausages", "200ml/7fl oz good quality veal jus/stock (alternatively use beef jus)", "salt and freshly ground black pepper", "50g/1¾oz butter", "pinch salt", "pinch sugar", "1 bunch baby carrots, trimmed", "300g/10½oz garden peas"], "serves": "", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put the flour in a bowl and make a well in the centre. Whisk in the eggs and mustard and continue to whisk until just smooth. Gradually add the milk and a pinch of salt and whisk to a smooth batter. Place in the fridge for at least four hours, but preferably overnight.", "Preheat the oven to 220C/200C Fan/Gas 7.", "Pour three-quarters of the beef dripping in a roasting tin and heat in the oven. Heat a frying pan and add the remaining dripping. When it’s melted, add the sausages and fry on each side until browned.", "Remove the batter from the fridge and whisk once more to combine.", "Put the sausages in the roasting tin and pour over the batter. Place in the oven for 30 minutes. Briefly open the oven door to allow the steam to escape and cook for a further 10 minutes.", "Meanwhile for the vegetables, put the butter, salt, sugar and 200ml/7fl oz of water in a deep sauté pan. When the butter has melted add the carrots and cook for 3-4 minutes.", "Bring a large pot of salted water to the boil, add the peas and cook for 2-3 minutes. Drain the peas and add a little butter.", "Heat the veal jus and season with salt and pepper.", "Cut a section of the toad in the hole and place on a plate, pour over the jus and serve the vegetables alongside. "]}, {"isVegetarian": true, "title": "Classic Victoria sponge cake", "url": "www_bbc_co_uk_food_recipes_classic_victoria_sponge_45518", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for greasing", "200g/7oz butter", "200g/7oz caster sugar", "½ tsp vanilla essence", "4 free-range eggs", "200g/7oz self-raising flour, sifted", "½ jar raspberry jam", "175ml/6fl oz double cream, whipped", "250g/9oz raspberries", "2-3 tbsp icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/350F/Gas 5. Grease and line 2 x 20cm/8in sandwich tins.", "Mix the butter, sugar and vanilla essence in a bowl or food processor until well combined. ", "Slowly beat in the eggs one by one. Fold in the sifted flour and carefully pour the mixture into the prepared tins. ", "Bake for 20-25 minutes until golden-brown. Test by pushing a skewer into the centre of the cake. If the skewer comes out clean the cake is ready.", "Turn the cake out onto a wire rack and set aside to cool. ", "Spread one cake with the raspberry jam, followed by a layer of whipped cream. Cover with the raspberries and place the other cake on top.", "To serve, dust with icing sugar and cut the cake into slices."]}, {"isVegetarian": true, "title": "Classic victoria sponge cake with strawberry jam", "url": "www_bbc_co_uk_food_recipes_classic_victoria_sponge_54621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz jam sugar", "1 lemon, zest and juice", "500g/1lb 2oz fresh strawberries, hulled, cut in half only if large", "oil, for greasing the tins", "flour, for dusting the tins", "250g/9oz butter", "250g/9oz caster sugar", "½ tsp vanilla essence", "4 free-range eggs", "250g/9oz self-raising flour, sifted", "175ml/6fl oz double cream, whipped", "250g/9oz strawberries", "2-3 tbsp icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, heat the sugar, lemon juice and zest and three tablespoons water in a large pan, slowly, until the sugar has melted.", "Add the strawberries and stir gently. ", "Bring the jam up to the boil and cook for 3-4 minutes, or up to 10 minutes if you prefer a thicker jam.", "Check the temperature with a sugar thermometer – it should reach 105C/220F.", "Remove the jam from the heat and leave to cool slightly. Skim off any froth with a clean spoon, to stop the jam from going cloudy.", "Spoon the jam into a sterile jam jar, seal and label.", "For the cake, preheat the oven to 190C/375F/Gas 5. ", "Grease and flour two 20cm/8in sandwich tins. ", "Combine the butter, sugar and vanilla essence in a bowl or food processor, and mix well to a creamy consistency. ", "Slowly beat in the eggs one by one. ", "Fold in the sifted flour then pour the mixture into the prepared tins. ", "Bake for 20-25 minutes until the sponge is well-risen, golden-brown and springs back when pressed. ", "Remove the cakes from the oven, turn them out of their tins onto a wire rack and leave to cool. ", "Spread one cake with strawberry jam, followed by a layer of whipped cream.", "Layer on the fresh strawberries then place the other cake on top.", "Dust with icing sugar to finish."]}, {"isVegetarian": true, "title": "Deep-dish Bakewell tart with cream", "url": "www_bbc_co_uk_food_recipes_classicbakewelltart_92618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz sweet shortcrust pastry ", "3 tbsp icing sugar, plus extra for dusting", "175g/6oz butter, softened", "175g/6oz caster sugar", "4 free-range eggs", "175g/6oz ground almonds", "300g/11oz ready-made raspberry jam", "40g/1½oz flaked toasted almonds", "200g/7oz clotted cream", "250ml/9fl oz double cream"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Roll the sweet shortcrust pastry out onto a lightly dusted work surface to a 0.5cm/¼in thickness.", "Carefully line a 23cm/9in, deep-sided tart tin with the pastry, pressing the pastry into the edges of the tin.", "Line the pastry case with greaseproof paper and fill with baking beans or rice.", "Place the tart tin onto a baking tray, then bake in the oven for 15 minutes.", "Remove the greaseproof paper and baking beans or rice, then return the tart case to the oven and bake for a further 8-10 minutes, or until the pastry is crisp and pale golden-brown. Remove from the oven and set aside to cool slightly.", "Meanwhile, beat the butter and sugar together in a bowl until pale and fluffy.", "Crack in the eggs, one at a time, beating well after each addition, until all of the eggs have been fully incorporated into the mixture.", "Fold in the ground almonds until well combined.", "When the pastry case has cooled, spread the raspberry jam in an even layer all over the bottom of the tart.", "Spoon in the almond mixture and smooth the surface with a palette knife.", "Dust the top of the tart with icing sugar, then sprinkle over the flaked almonds.", "Return the tart to the oven and continue to cook for 25-30 minutes, or until the filling has risen and is cooked through and the surface is pale golden-brown. (NB: The filling is cooked through when a skewer inserted into the centre comes out clean.)", "Remove the tart from the oven and set aside to cool slightly before serving.", "To serve, place one slice of Bakewell tart into the centre of each of 10-12 serving plates. Place a spoonful of clotted cream on top of each slice. Drizzle the double cream around the edge of each plate."]}, {"isVegetarian": false, "title": "Classic champagne cocktail", "url": "www_bbc_co_uk_food_recipes_classicchampagnecock_84499", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicchampagnecock_84499_16x9.jpg", "ingredients": ["1 white sugar cube", "2 dashes bitters", "20ml/¾fl oz cognac", "enough champagne to fill the glass"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar cube onto a spoon and add the bitters.", "Drop the soaked sugar cube into a champagne flute and add the cognac.", "Top up the glass with champagne and serve."]}, {"isVegetarian": false, "title": "Classic chicken Caesar salad", "url": "www_bbc_co_uk_food_recipes_classicchickencaesar_86187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x chicken breasts, skin and knuckle bone still attached", "salt and freshly ground black pepper", "1 tbsp olive oil ", "150ml/5fl oz chicken stock", "200g/7oz white bread, cut into small cubes ", "pinch salt", "80ml/3fl oz olive oil", "150g/5oz parmesan, grated ", "2 tbsp white wine vinegar", "250g/10½oz ready-made mayonnaise", "3 tbsp Dijon mustard", "2 anchovy fillets, rinsed", "pinch salt", "1 garlic clove, crushed", "50ml/2fl oz olive oil", "1 cos lettuce, torn up", "12 anchovies (stored in vinegar) ", "50g/2oz parmesan shavings"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the salad, season the chicken well with salt and freshly ground black pepper.", "Heat the oil in a frying pan over a medium heat and add the chicken breasts, skin-side down. Fry for 4-5 minutes, until the skin is crisp and golden-brown.", "Turn the breasts over and fry for 1-2 minutes.", "Transfer the breasts, skin-side up, to an ovenproof dish and pour the stock around the meat. Try not to pour the stock over the meat.", "Place into the oven to cook for 20 minutes, or until completely cooked through. Test the meat with a skewer at the thickest part- the juices should run clear. Remove from the oven and allow to cool slightly.", "Meanwhile, for the croutons, place the cubes of bread onto a baking tray, sprinkle with salt and drizzle with the oil.", "Place into the bottom of the oven and bake for 5-6 minutes, or until the croutons are golden-brown.", "For the dressing, place the parmesan and vinegar into a food processor and blend until very smooth.", "Add the mayonnaise, mustard, anchovy fillets, salt, garlic and olive oil and blend again until smooth.", "To serve, place the lettuce into a large bowl, pour on some dressing and gently turn the leaves to coat.", "Add the croutons and transfer the salad to four separate bowls.", "Add three anchovies to each bowl and drizzle over a little more dressing.", "Carve each chicken breast into thick slices and place half of the chicken over each bowl of salad.", "Sprinkle with parmesan shavings and serve."]}, {"isVegetarian": false, "title": "Classic cottage pie", "url": "www_bbc_co_uk_food_recipes_classiccottagepie_90765", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "650g/1lb 7oz minced beef", "3-4 banana shallots or 7-8 small round shallots, finely chopped", "4 sprigs fresh thyme, leaves only", "2 tbsp tomato purée", "1 tbsp plain flour", "150ml/5fl oz red wine", "400ml/14fl oz beef stock", "salt and freshly ground black pepper ", "Worcestershire sauce, to taste", "900g/2lb King Edward potatoes, peeled and chopped", "115g/4oz butter", "125ml/4½fl oz double cream", "salt and freshly ground black pepper", "150g/5½oz frozen peas", "50g/1¾oz butter"], "serves": "2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan until smoking, add half of the olive oil and fry the minced beef, in batches, for 4-5 minutes, or until browned all over. ", "Heat a separate pan over a gentle heat, add the remaining olive oil and fry the shallots and thyme for 2-3 minutes, or until just softened. Stir in the tomato purée and flour and cook for a further minute, then add the cooked beef.", "Deglaze the frying pan used to cook the beef with the red wine, scrapingup any caramelised bits with a wooden spoon. Cook for 3-4 minutes, or until the wine has reduced by half, then pour the wine into the pan with the beef. ", "Add the stock to the pan and leave to simmer for 45 minutes, or until the beef is tender and the mixture is thickened. Season, to taste, with salt, freshly ground black pepper and a few dashes of Worcestershire sauce. Keep warm over a very low heat.", "Preheat the grill to high.", "For the mash, place the potatoes into a pan of salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender. ", "Drain and return the potatoes to the pan, then place over the heat for about one minute to drive off any excess moisture. Mash well with a potato masher or ricer, then add the butter and milk, beating to form a smooth mash. Season, to taste, with salt and freshly ground black pepper. Spoon the mash into a piping bag.", "Place the mince mixture into a baking dish and pipe the mash over the top. Place under the grill for 8-10 minutes, or until the top is golden-brown. Serve spooned onto serving plates.", "Place the peas in water in a small saucepan and cook for 3-4 minutes, drain and add the butter.", "To serve, serve a spoonful of the cottage pie on plates with the peas alongside. "]}, {"isVegetarian": true, "title": "Classic crêpes suzette", "url": "www_bbc_co_uk_food_recipes_classiccrepessuzette_66236", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classiccrepessuzette_66236_16x9.jpg", "ingredients": ["110g/4oz plain flour, sifted", "pinch of salt", "2 eggs", "200ml/7fl oz milk mixed with 75ml/3fl oz water", "50g/2oz butter", "1 medium orange, grated zest only", "1 tbsp caster sugar ", "150ml/5fl oz orange juice (from 3-4 medium oranges)", "1 medium orange, grated zest only", "1 small lemon, grated rind and juice", "1 tbsp caster sugar", "3 tbsp Grand Marnier, Cointreau or brandy", "50g/2oz unsalted butter", "a little extra Grand Marnier, for flaming"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large mixing bowl with a sieve held high above the bowl so the flour gets an airing. Now make a well in the centre of the flour and break the eggs into it. Then begin whisking the eggs - any sort of whisk or even a fork will do - incorporating any bits of flour from around the edge of the bowl as you do so.", "Next gradually add small quantities of the milk and water mixture, still whisking (don't worry about any lumps as they will eventually disappear as you whisk). When all the liquid has been added, use a rubber spatula to scrape any elusive bits of flour from around the edge into the centre, then whisk once more until the batter is smooth, with the consistency of thin cream. Now melt the 50g/2oz of butter in a pan. Spoon 2 tbsp of it into the batter and whisk it in, then pour the rest into a bowl and use it to lubricate the pan, using a wodge of kitchen paper to smear it round before you make each pancake. Stir the orange zest and caster sugar into the batter.", "Now get the pan really hot, then turn the heat down to medium and, to start with, do a test pancake to see if you're using the correct amount of batter. These little crêpes should be thinner than the basic pancakes, so when you're making them, use ½ tbsp of batter at a time in a 18cm/7in pan. It's also helpful if you spoon the batter into a ladle so it can be poured into the hot pan in one go. As soon as the batter hits the hot pan, tip it around from side to side to get the base evenly coated with batter. It should take only half a minute or so to cook; you can lift the edge with a palette knife to see if it's tinged gold as it should be. Flip the pancake over with a pan slice or palette knife - the other side will need a few seconds only - then simply slide it out of the pan onto a plate. If the pancakes look a little bit ragged in the pan, no matter because they are going to be folded anyway. You should end up with 15-16 crêpes.", "Stack the pancakes as you make them between sheets of greaseproof paper on a plate fitted over simmering water, to keep them warm while you make the rest.", "For the sauce, mix all the ingredients - with the exception of the butter - in a bowl. At the same time warm the plates on which the crêpes are going to be served. Now melt the butter in the frying pan, pour in the sauce and allow it to heat very gently. Then place the first crêpes in the pan and give it time to warm through before folding it in half and then in half again to make a triangular shape. Slide this onto the very edge of the pan, tilt the pan slightly so the sauce runs back into the centre, then add the next crêpe. Continue like this until they're all re-heated, folded and well soaked with the sauce.", "You can flame them at this point if you like. Heat a ladle by holding it over a gas flame or by resting it on the edge of a hotplate, then, away from the heat, pour a little liqueur or brandy into it, return it to the heat to warm the spirit, then set light to it. Carry the flaming ladle to the table over the pan and pour the flames over the crêpes before serving on the warmed plates."]}, {"isVegetarian": true, "title": "Classic Daiquiri", "url": "www_bbc_co_uk_food_recipes_classicdiaquari_86314", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz white rum ", "35ml/1½fl oz fresh lime juice ", "4 tsp sugar syrup (often sold as 'gomme' syrup)", "1 wedge lime"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rum, lime juice and sugar syrup into a cocktail shaker and shake well to combine.", "Pour into a Martini glass and serve garnished with a wedge of lime."]}, {"isVegetarian": true, "title": "Classic mojito", "url": "www_bbc_co_uk_food_recipes_classicmojito_72225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20ml/¾fl oz fresh lime juice (or 1-2 limes, chopped)", "1 tbsp caster sugar", "2-3 tbsp fresh mint leaves, left whole", "50ml/1¾fl oz Cuban (or other) rum  ", "plenty of crushed ice", "330ml/12fl oz glass", "fresh mint sprig to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the lime juice into the glass.", "Add the sugar and stir until it dissolves in the lime juice. (If using freshly chopped limes instead of lime juice, crush them with the sugar using a pestle until the sugar dissolves.)", "Throw in the whole mint leaves, letting them fall where they may, even letting them stick to the sides of the glass.  The glass should be loosely full of mint. ", "Pour crushed ice over the mint leaves to fill the glass.", "Using a spoon, stir the ice with the mint and lime until the mint starts to break.  Do not break the mint until this point.", "Top with 50ml of rum and stir until evenly mixed and the ice is slightly slushy. ", "Serve with a sprig of mint on top."]}, {"isVegetarian": true, "title": "Classic mayonnaise", "url": "www_bbc_co_uk_food_recipes_classicmayonnaise_81725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar", "1 tbsp parsley stalks, roughly chopped", "1 tbsp chervil, chopped", "2 free-range egg yolks", "1 tsp English mustard powder", "150ml/5fl oz light olive oil", "150ml/5fl oz vegetable oil", "salt and freshly ground black pepper", "squeeze lemon juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vinegar, parsley stalks and chervil into a small saucepan and bring to the boil. Simmer until the volume is reduced to one tablespoon of liquid. ", "Strain the liquid through a sieve and discard the parsley and chervil.", "Place the egg yolks, mustard powder and infused vinegar into a food processor and blend.", "With the blender still running, gradually add the oils. Continue to blend the mixture until all the oil has been incorporated and the mixture has thickened.", "Season with salt and freshly ground black pepper and add a squeeze of lemon juice.", "Spoon into a small serving bowl and serve."]}, {"isVegetarian": true, "title": "Classic Margarita", "url": "www_bbc_co_uk_food_recipes_classicmargarita_84327", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicmargarita_84327_16x9.jpg", "ingredients": ["35ml/1¼fl oz Reposado Tequila", "20ml/¾fl oz Cointreau", "35ml/1¼fl oz fresh lime juice", "handful ice cubes", "lime wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the Tequila, Cointreau and lime juice into a cocktail shaker.", "Add a handful of ice cubes and shake vigorously for 10-15 seconds.", "Strain into a Martini glass with half the rim damped with water, then dipped in salt.", "Add a lime wedge on the rim by way of garnish."]}, {"isVegetarian": true, "title": "Classic lemon tart", "url": "www_bbc_co_uk_food_recipes_classiclemontart_86198", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classiclemontart_86198_16x9.jpg", "ingredients": ["5 free-range eggs", "190g/6¾oz caster sugar", "250ml/9fl oz double cream", "4 lemons, juice and zest", "butter, for greasing", "flour, for dusting", "225g/8oz ready-made sweet shortcrust pastry", "icing sugar, for dusting", "110g/4oz mild goats' cheese", "50ml/2fl oz double cream", "2 tbsp icing sugar"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lemon tart, crack the eggs into a bowl and whisk gently to break up the yolks. Add the sugar and mix well. Add the cream and the lemon juice and stir. Pass the mixture through a sieve, then add the lemon zest and set aside.  ", "Grease a 20cm/8in flan ring with butter. Roll out the pastry on a lightly floured surface to make a circle large enough to fit over the flan ring. Using the rolling pin, carefully lift the pastry over the ring and gently press into the ring. Allow the pastry to overhang the edges of the ring slightly. Line with a circle of greaseproof paper and fill with rice or baking beans.", "Transfer to the oven and bake for about 15 minutes. Remove from the oven and remove the beans and greaseproof paper, then return to the oven for five minutes, or until the tart case is lightly browned.", "Turn the oven down to 150C/300F/Gas 2 and pour the lemon mixture into the tart case. Bake in the oven for about an hour, or until the filling is just set and the pastry is golden-brown.", "Remove the tart from the oven and trim off the edges of the pastry. Leave to cool completely, then place in the fridge to chill for about two hours.", "Preheat the grill to medium.", "Dust the top of the tart generously with icing sugar then place under the grill until caramelised.", "For the goats' cheese cream, place the goats' cheese into a bowl with the cream and icing sugar and mix well.", "To serve, cut the tart into wedges and serve with a spoonful of the goats' cheese cream."]}, {"isVegetarian": false, "title": "Classic moules marinières", "url": "www_bbc_co_uk_food_recipes_classicmoulesmarinie_90477", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "175ml/6fl oz white wine", "250g/9oz live mussels, debearded, cleaned and rinsed", "3 tbsp double cream", "2 tbsp chopped fresh parsley", "crusty white bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Tap the mussels against a hard surface and discard any that do not close.", "Heat the oil in a pan and gently fry the onions and garlic for 3-4 minutes, or until softened. Pour in the white wine and bring to a simmer, then add the mussels and cover with a lid for 4-5 minutes, or until the mussels have opened.  Discard any unopened mussels.", "Stir in the cream and parsley and spoon into a serving bowl. Serve immediately with the bread to mop up the juices."]}, {"isVegetarian": false, "title": "Classic prawn cocktail with toasted rustic bread", "url": "www_bbc_co_uk_food_recipes_classicprawncocktail_91163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7¼oz mayonnaise", "2-3 tbsp tomato ketchup", "pinch cayenne pepper", "squeeze lemon juice", "dash Tabasco, to taste", "dash Worcestershire sauce, to taste", "splash brandy, to taste", "½ iceberg lettuce, finely chopped", "250g/8¾oz cooked large and small peeled prawns", "cayenne pepper, to taste", "4 slices Braeburn apple ", "4 sprigs fresh dill", "lemon wedges, to garnish", "1 ciabatta, cut into thin slices and toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the marie-rose sauce, mix the mayonnaise, ketchup, cayenne pepper and lemon juice together in a large bowl. Season, to taste, with Tabasco, Worcestershire sauce and a splash of brandy. Stir to combine.", "For the prawn cocktail, place a spoonful of marie-rose sauce into the bottom of four serving glasses. Divide the lettuce equally among the glasses. Spoon another layer of sauce on top.", "Arrange the prawns on top and finish with a final spoonful of sauce (any remaining sauce can be covered and stored in the fridge for 2-3 days and used for other recipes). ", "Sprinkle with a little cayenne pepper, and top with a slice of apple and a sprig of dill. Garnish with a lemon wedge and serve with a slice of toasted ciabatta."]}, {"isVegetarian": true, "title": "Classic rich chocolate sauce", "url": "www_bbc_co_uk_food_recipes_classicrichchocolate_93211", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicrichchocolate_93211_16x9.jpg", "ingredients": ["200g/7oz good-quality dark chocolate, minimum 70 per cent cocoa solids, chopped", "175ml/6fl oz milk", "2 tbsp double cream ", "30g/1¼oz caster sugar", "30g/1¼oz chilled butter, cut into cubes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the chocolate and melt slowly, stirring occasionally, until very smooth. Remove the bowl from the heat.", "Bring the milk, cream and sugar to the boil in a saucepan over a medium heat, whisking continuously.", "Pour the boiling cream mixture over the melted chocolate, whisking continuously until the mixture is smooth and well combined.", "Return the chocolate and cream mixture to the pan and heat until just simmering, stirring continuously. Allow to bubble over the heat for a few seconds, then turn off the heat and whisk in the butter, a cube at a time, until the sauce is smooth and glossy and all the butter has melted. ", "Strain the chocolate sauce through a fine sieve, then serve immediately. (Serving suggestion: pour the chocolate sauce over ready-made meringues.)"]}, {"isVegetarian": true, "title": "Classic summer berry sorbet", "url": "www_bbc_co_uk_food_recipes_classicsummerberryso_70045", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicsummerberryso_70045_16x9.jpg", "ingredients": ["500g fresh summer fruits", "juice and grated rind of 1 large orange", "2 - 3 tbsp orange liqueur such as Cointreau or Grand Marnier", "2 egg whites", "100g caster sugar"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the fruit, orange rind and juice, liqueur and 175ml water in a food processor and blend until smooth. I like to leave to seeds in but you can sieve your mixture if you prefer.", "If you have an ice cream machine, churn the mixture until it starts to freeze, alternatively pour into a rigid container and freeze, stirring every 30 minutes or so until ice crystals start to form and it feels slushy.", "Whisk the egg whites until stiff then gradually add the sugar beating until firm and glossy. Fold the meringue into the freezing fruit mixture and continue to freeze and stir until completely frozen. If making in advance, transfer the mixture to the fridge 30 minutes before serving."]}, {"isVegetarian": false, "title": "Clear mushroom broth", "url": "www_bbc_co_uk_food_recipes_clearmushroombroth_79268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["290ml/½pt water", "1 poussin carcass", "3 garlic cloves, slightly crushed", "handful fresh herbs (rosemary, sage, parsley)", "1 tbsp olive oil", "½ red onion, peeled and chopped", "110g/4oz mushrooms, sliced", "1 tsp sesame oil", "1 tsp soy sauce", "1 tsp red wine vinegar", "dash Tabasco sauce", "pinch chilli flakes", "handful fresh flatleaf parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stock, place the water, poussin carcass, garlic and herbs in a pan and bring to the boil. Boil for 8-10 minutes then strain the stock, discarding the bones and reserving the liquid.", "Heat the oil in a medium pan and sauté the red onion for a few minutes to soften. Add the mushroom and sauté for a further 1-2 minutes.", "Add the sesame oil, soy sauce, vinegar, Tabasco sauce, chilli and parsley and stir well. ", "Pour in the stock, bring to the boil, then reduce the heat and simmer gently for 10-12 minutes.", "Ladle into a bowl and serve."]}, {"isVegetarian": true, "title": "Clear mushroom broth with choy sum and crispy noodle cake", "url": "www_bbc_co_uk_food_recipes_clearmushroombrothwi_86857", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp olive oil", "½ red chilli, finely chopped", "1 garlic clove, crushed", "2 tsp soy sauce", "1 lime, zest and juice", "150ml/¼ pint vegetable stock", "100g/3½oz shiitake mushrooms", "150g/5½oz rice noodles", "3 choy sum leaves, roughly chopped", "300ml/½ pint vegetable oil, for deep frying", "150g/5½oz medium rice noodles"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the broth, heat the olive oil in a pan and fry the chilli and garlic for one minute.", "Add the soy sauce, lime zest and vegetable stock and bring to the boil.", "Add the shiitake mushrooms and the rice noodles and reduce to a gentle simmer. Cook for a further three minutes or until tender.", "Add the choy sum and lime juice and gently simmer for a further two minutes.", "Pour into a bowl and keep warm.", "For the crispy noodle cake, heat the oil in a heavy based saucepan, until a breadcrumb sizzles gently.  (CAUTION: hot oil can be dangerous! Do not leave unattended.)", "Fry the noodles for 1-2 minutes, until puffed up and crisp.  Remove with a slotted spoon and drain on kitchen paper.", "Serve the broth topped with the crispy noodle cake."]}, {"isVegetarian": true, "title": "Clementine and almond cake", "url": "www_bbc_co_uk_food_recipes_clementine_and_almond_72249", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clementine_and_almond_72249_16x9.jpg", "ingredients": ["2 large clementines (about 200g/7oz), cleaned", "4 large free-range eggs", "1 large lemon, zest only", "160g/5¾oz golden caster sugar", "100ml/3½fl oz olive oil", "175g/6oz ground almonds", "2 tsp baking powder", "15g/½oz caster sugar", "1 large lemon, juice only", "icing or caster sugar, for dusting", "250ml/9fl oz whipped cream (optional)", "2–3 oranges, segmented"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the clementines in a saucepan and cover with water. Bring to the boil and simmer gently for 20–30 minutes until tender. Remove and set aside until cool enough to handle. Cut the clementines in half and discard the pips. ", "Put the clementines, including the skin, into a food processor and blend to a paste. ", "Preheat the oven to 180C/160C Fan/Gas 4, grease a 20cm/8in spring-form cake tin and line the bottom with baking paper. ", "Whisk together the eggs, lemon zest and caster sugar in a bowl. Add the olive oil and beat until light and well combined. Stir in the clementine paste then fold in the ground almonds and baking powder. ", "Spoon the mixture into the tin and bake for 50 minutes or until well risen and golden-brown. The cake should have slightly shrunken from the sides and be springy to the touch. Leave it to cool in the tin on a wire rack.", "Meanwhile, to make the syrup, warm the sugar and lemon juice in a small pan over a low heat until the sugar has dissolved. Make lots of small holes all over the cake with a piece of uncooked spaghetti or cocktail stick, and drizzle over the lemon syrup. Let the cake cool completely in the tin, turn it out on to a serving plate, dust with icing sugar and serve with whipped cream and orange segments."]}, {"isVegetarian": true, "title": "Clementine and chestnut torte", "url": "www_bbc_co_uk_food_recipes_clementine_and_chestnut_64080", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large free-range eggs, separated", "190g/6¾oz caster sugar", "300g/10½oz full fat crème fraîche", "2 unwaxed lemons, zest only ", "½ tsp fiori di Sicilia or arome di panetone (both available online)", "190g/6¾oz chestnut flour (available online)", "3 tsp baking powder", "3 tbsp caster sugar", "10 clementines, segmented", "2 lemons ", "1 orange ", "2 limes ", "verbena leaves for decoration (optional)", "1 free-range egg, white only", "2 tbsp caster sugar", "1 x 250g/9oz tin of vanilla flavoured chestnut spread (such as Creme de Marrons de L’Ardeche)", "325g/11½oz butter, softened, plus extra for greasing the cake tins", "450g/1lb icing sugar", "190g/6¾oz cream cheese, full fat", "2 tsp lemon oil extract"], "serves": "Serves 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Grease two 23cm/9in round cake tins and line the sides and bottom with parchment paper.   ", "For the torte, in a mixing bowl beat the egg yolks and caster sugar until light and fluffy.  Add the crème fraîche, lemon zest and the fiori di Sicilia or arome di panettone. Mix together and sift in the flour and baking powder (it is essential to sift chestnut flour as it clumps together easily). In a clean bowl, whisk the egg whites to stiff peaks. In three batches fold the eggs whites into the batter using a metal spoon.  Pour the batter into the prepared tins, smooth the tops and bake in the oven for 23–30 minutes. ", "For the topping, simmer 250ml/9fl oz water with the caster sugar in a pan for two minutes until a syrup forms. Remove the rind from the lemons, orange and limes and cut into fine strips (julienne). Segment the oranges. Add the rind strips to the syrup, simmer for three minutes, remove from the heat and set aside to cool. ", "Remove the torte from the oven and cool in the tins for five minutes before turning out on to a cooling rack to cool completely. ", "Lightly paint each verbena leaf with a little egg white, dip into caster sugar and place on a lined tray. Dry the verbena leaves in the oven at the lowest possible oven temperature for approximately 20 minutes,  until crisp. Set aside to harden.", "For the lemon cheese icing, whisk the softened butter for two minutes. Add the icing sugar and lemon oil extract. Mix well before adding the cream cheese, then beat for 5-6 minutes until light and creamy.  Cover and transfer to the fridge until needed.", "To assemble the torte, spread the chestnut spread on both torte layers. Spread a layer of lemon icing on top of the chestnut spread on both cakes, leaving a 1cm/½in gap at the edge.", "On the bottom layer of the torte arrange the clementine segments around the edge of the cake with their ‘backs’ facing outwards and 1cm/½in space between each one. ", "Fill a piping bag with the remaining lemon icing and pipe a rosette into the gaps between the clementines. Arrange two concentric rings of orange segments and pipe some icing in between the rings (to avoid holes). ", "Place the second layer of torte on top, with the lemon icing facing upwards. Fill the 1cm/½in border with piped rosettes of lemon icing. ", "Drain the citrus rinds and pat dry with kitchen towel. On each lemon icing rosette apply a small amount of the citrus rinds. Arrange the remaining orange segments in centre of cake. Pipe small rosettes of cream in any gaps, and scatter some of the mixed zest over. Place crystallised verbena leaves on top in a radiating pattern."]}, {"isVegetarian": false, "title": "Clementine and cod curry", "url": "www_bbc_co_uk_food_recipes_clementine_and_cod_curry_32911", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clementine_and_cod_curry_32911_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "2 garlic cloves, crushed", "1 small onion, chopped", "2 green chillies, split lengthways", "1 tbsp tomato purée", "1 tsp turmeric", "½ tsp chilli powder", "½ tsp curry powder", "3 clementines, peel only", "400g/14oz cod fillet, cut into bite-size chunks", "large handful fresh coriander leaves", "fine sea salt", "180g/6oz spinach, rinsed", "2 cloves crushed garlic"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry, place a large lidded pan over a medium heat and add the oil. Add the garlic and onion and cook until softened. Add 1 teaspoon salt and if the onions stick to the pan add splashes of water. ", "Add the chillies and tomato purée and cook for 2 minutes. Add the turmeric, chilli powder and curry powder. Add a little water and cook for 5–7 minutes, or until the oil rises to the surface.", "Meanwhile, thinly slice the clementine peel and add it to the pan with the 200ml/7fl oz water (or clementine juice). Cook for 10 minutes, or until the peel has melted down. ", "Add the cod, stir and put the lid on. Cook for a few minutes, or until firm, white and cooked through. Remove from the heat and add the coriander.", "Put the spinach in a large pot with the garlic and a pinch of salt. Dry steam on a low heat for 3 minutes, until wilted right down; it should keep its bright-green colour. Dry steaming is cooking without any oil; rinsed spinach has enough moisture on it to steam it and cook the garlic. ", "Serve the fish curry with the spinach on the side. "]}, {"isVegetarian": true, "title": "Clementine curd tart with a white chocolate mousse", "url": "www_bbc_co_uk_food_recipes_clementine_curd_tart_94470", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz unsalted butter, melted", "250g/9oz digestive biscuits, crushed", "4 clementines, juice and finely grated zest", "225g/8oz unsalted butter, roughly chopped", "350g/12oz caster sugar", "4 medium free-range eggs, beaten", "600ml/1 pint full-fat milk", "600ml/1 pint double cream", "1 vanilla pod, seeds removed", "150g/5½oz caster sugar", "100g/3½oz cornflour", "3 medium free-range eggs plus 3 yolks", "50g/13/4oz unsalted butter, cubed", "175g/6oz white chocolate, finely chopped ", "2 medium free-range egg yolks ", "2 tbsp caster sugar ", "320ml/11fl oz double cream"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the base, mix the biscuits and melted butter together in a bowl, then press into a 20cm/8in loose-bottomed tart tin. Cover and chill in the fridge for 20 minutes, or until firm.", "For the clementine curd, put the clementine juice and zest, butter and half the sugar in a saucepan and bring to a gentle simmer to dissolve the sugar and melt the butter, then remove from the heat. Allow to cool slightly. Put the remaining sugar and the beaten eggs in a large bowl and slowly pour in the warm juice mixture, beating constantly using an electric hand-held mixer. Return the pan to the heat and cook over a low heat, stirring constantly, for 5 minutes, or until thickened. Strain through a sieve into a bowl, cover and chill in the fridge until needed.", "For the crème pâtissèrie, put the milk, cream, vanilla seeds and pod into a large heavy-based saucepan and bring to the boil. Put the sugar and cornflour in a large heatproof bowl and whisk in the eggs and yolks. Pour the warm milk mixture over the eggs, whisking constantly. Pour the mixture back into the saucepan and cook gently over a low heat, stirring constantly, until thickened. Pass through a sieve and set aside.", "For the mousse, put the white chocolate in a large bowl and set aside. Whisk together the egg yolks and sugar in a separate bowl until pale in colour. Put 50ml/2fl oz of the cream in a pan and bring to a simmer over a low heat. Slowly pour the hot cream into the egg yolk mixture, stirring constantly. Pour the mixture back into the pan and cook very gently until it coats the back of a wooden spoon. Strain through a fine mesh sieve onto the white chocolate. Stir until smooth. ", "In another bowl, whip the remaining cream to almost stiff peaks. Fold half the whipped cream into the white chocolate mixture, then fold in the rest. ", "To assemble, combine the clementine curd and crème pâtissèrie and pile into the biscuit base. Spoon the white chocolate mousse over the top, cover and chill in the fridge for at least 2 hours before serving."]}, {"isVegetarian": true, "title": "Clementine rumtopf", "url": "www_bbc_co_uk_food_recipes_clementine_rumtopf_35771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "100ml/3½fl oz dark rum", "300–400g/10½–14oz clementine segments", "100g/3½oz light soft brown sugar", "300g/10½oz unsalted butter, softened", "4 clementines, peeled and halved", "200g/7oz caster sugar", "200g/7oz self-raising flour", "1 vanilla pod, seeds removed, or 1 tsp vanilla extract", "4 free-range eggs", "vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Bring 150ml/5fl oz water and the sugar to the boil in a saucepan until the sugar has dissolved. Remove from the heat and leave the syrup to cool.", "Pour the syrup into a large bowl. Add the rum and the clementines to the syrup. Cover and store in the fridge for a week before using.", "For the upside-down cake, preheat the oven to 180C/160C Fan/Gas 4. Line a 23cm/9in cake tin with baking parchment.", "In a large bowl beat together the brown sugar and 100g/3½oz of the butter until smooth. Spread in the base of the lined tin. Arrange the clementine halves on top. Beat the remaining butter together with the rest of the cake ingredients. Pour the batter over the clementines and bake for 35–40 minutes. Remove from the oven and set aside to cool for 10-15 minutes.", "Put the marinated clementines into bowls serve with ice cream and a slice of upside-down cake."]}, {"isVegetarian": true, "title": "Clementine syllabub and crêpes Suzette", "url": "www_bbc_co_uk_food_recipes_clementine_syllabub_and_53372", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clementine_syllabub_and_53372_16x9.jpg", "ingredients": ["250g/9oz mascarpone", "1 heaped tbsp icing sugar, sifted", "400ml/14fl oz double cream", "2 clementines, 1 juiced, 1 sliced", "200g/7oz ready-made orange or passion fruit curd", "2 sprigs fresh mint", "125g/4½oz plain flour", "1 free-range egg", "300ml/10½fl oz milk", "25g/1oz butter", "75g/2¾oz caster sugar", "50ml/2fl oz brandy", "4 clementines", "1 lemon, juice only", "25g/1oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the syllabub, whisk the mascarpone and icing sugar together in a large bowl until smooth. Gradually pour in the double cream, whisking continuously until the mixture is pale and thick.", "Fold in the clementine juice and orange or passion fruit curd to create a ripple effect.", "Spoon the syllabub mixture into a piping bag and pipe it into glass serving dishes. Top each with a slice of clementine and a sprig of mint. Chill in the fridge until ready to serve – the syllabubs will keep in the fridge for 3-4 days, covered.", "For the crêpes, whisk the flour and egg together in a large bowl. Gradually add the milk to form a smooth batter with the consistency of double cream.", "Heat a little of the butter in a frying pan over a medium heat. Add a ladleful of the crêpe batter to the pan and swirl to coat the bottom evenly. Fry for 1-2 minutes, then flip the pancake and cook for a further minute, or until golden-brown on both sides. Remove the crêpe from the pan and place on a sheet of greaseproof paper. Keep warm. ", "Repeat the process with the remaining butter and crêpe batter, stacking the crêpes between layers of greaseproof paper. ", "For the sauce, heat the sugar in a frying pan over a medium heat until the sugar melts and caramelises. Add the brandy and set alight with a match. Allow the flames to flare up and die down. (Caution: Keep the flames away from your eyes and face and make sure the extractor fan is not turned on). Stir in the juice from 2 of the clementines, the lemon juice, and the zest from 1 clementine, then segment the last 2 clementines and add them to the pan. Finally, stir in the butter until it has melted and the sauce has thickened.", "To serve, fold the crêpes into quarters and arrange on serving plates. Spoon over the warm orange sauce. Serve the syllabub alongside."]}, {"isVegetarian": false, "title": "Clootie pudding", "url": "www_bbc_co_uk_food_recipes_clootiepudding_9528", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/clootiepudding_9528_16x9.jpg", "ingredients": ["225g (8oz) plain flour, plus 25g (1oz) for sprinkling", "1 tsp bicarbonate of soda", "1 tsp mixed spice", "1 tsp ground cinnamon", "1 tsp ground ginger", "¼tsp sea  salt", "175g/6oz caster sugar, plus 1 tbsp for sprinkling", "100g/4oz shredded suet", "100g/4oz sultanas", "75g/3oz currants", "75g/3oz chopped stoned dates", "50g/2oz Muscatel raisins", "1 apple or carrot, coarsely grated", "1 tbsp black treacle", "1 medium farm-fresh egg", "150ml/5fl oz buttermilk", "225g/8oz clotted cream"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour, bicarbonate of soda, spices and salt into a bowl and stir in the sugar, suet, dried fruits, and the grated carrot or apple.   ", "Mix the black treacle with the egg and some of the buttermilk and mix into the dry ingredients to give soft mixture with a cake-like dropping consistency.", "Dip a large piece of muslin, an old pillowcase, a pudding cloth or a tea towel into boiling water, remove it and squeeze out the excess water. Lay it out on a surface and sprinkle a 30cm/12in circle in the centre with the 25g/1oz of flour and the 1 tbsp of caster sugar. Spoon pudding mixture on top and tie securely with string, leaving a little room for the pudding to expand. ", "Rest a large heatproof trivet or container in the base of a large pan so that the pudding is not in direct contact with the heat. Place the pudding on the trivet/container, knotted side up.  Pour in enough water almost to cover the pudding, cover with a tight-fitting lid and simmer gently for 3-4 hours. Take a peek every now and then and then to check the water level and top it up if necessary.", "Preheat the oven to 180C/350F/Gas 4. Lift the pudding out of the pan and dip it briefly in a bowl of cold water (to ensure that the outside of the pudding does not stick to an ovenproof serving plate). Then remove remove the cloth and place the pudding on an ovenproof dish/plate. Slide it into the oven and leave it for 15 minutes until the outside of the pudding has dried off.  ", "Serve in chunky wedges with scoops of clotted cream and perhaps a small glass of whisky."]}, {"isVegetarian": true, "title": "Clementine and goats' cheese soufflé-filled crêpes", "url": "www_bbc_co_uk_food_recipes_clementinegoatschees_77965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large free-range egg yolks", "300ml/10fl oz/½pint milk", "115g/4oz plain flour", "pinch salt", "small knob of butter", "icing sugar to garnish", "3 large free-range egg whites", "25g/1oz caster sugar", "100g/3½oz crumbled goats cheese", "1 clementine, peeled and segmented"], "serves": "Serves 1", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the crepe mix, combine the egg yolks, flour, milk and salt. Whisk vigorously to form a batter.", "Place a crepe pan over a medium heat, add a small knob of butter to melt. Add a ladle of the crepe batter and swirl to cover the pan. Cook for one minute, flip over and cook for a further minute.", "For the soufflé, whisk the egg whites in a large bowl until stiff.", "Gradually add the sugar and continue whisking until light and fluffy. Stop when the mixture is thick enough to leave a ribbon trail when the whisk is lifted.", "Fold in the goats' cheese and clementine segments making sure to maintain volume.", "Spoon the soufflé mix over half of the crepe and fold over to contain the mixture.", "Place in the oven and cook for ten minutes.", "To serve, slide the crepe soufflé onto a warm plate and dust with icing sugar."]}, {"isVegetarian": true, "title": "Clotted cream rice pudding with caramelised pineapple", "url": "www_bbc_co_uk_food_recipes_clotted_cream_rice_03146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "200g/7oz pudding rice", "125g/4½oz caster sugar", "600ml/20fl oz full-fat milk", "500ml/18fl oz double cream", "1 vanilla pod, seeds removed", "110g/4oz clotted cream", "2 baby pineapples, peeled, core removed, thinly sliced", "1 lemon, juice only", "75g/3oz caster sugar", "55g/2oz butter"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the rice pudding, melt the butter in a saucepan until foaming and fry the rice for one minute. Add 50g/2oz of the sugar, 500ml/16floz of the milk, the double cream and vanilla pod and bring the mixture to the boil.", "Reduce the heat to a simmer and cook for 30-40 minutes until tender and all the liquid is absorbed. (If you’re cooking  the rice pudding in advance, spread the rice onto a tray and set aside to cool, chill in the fridge until needed.)", "Return the rice to a saucepan, add the remaining milk and slowly bring to the boil. Stir in the clotted cream until well combined.", "Spoon the mixture into a baking dish, sprinkle over the remaining sugar and caramelise with a cook’s torch or under a hot grill.", "Meanwhile, for the caramelised pineapple, heat a frying pan until hot, add the pineapple and cook for 1-2 minutes on each side. Add the lemon juice, sugar and butter and cook for a further 1-2 minutes, or until the sauce is bubbling and thickened. ", "To serve, spoon some pineapple slices onto serving plates, spoon the rice pudding alongside and finish with a drizzle of the pineapple caramel."]}, {"isVegetarian": true, "title": "Clotted cream rice pudding with berry sauce and mini doughnuts", "url": "www_bbc_co_uk_food_recipes_clotted_cream_rice_37046", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz pudding rice", "600ml/21fl oz full-fat milk", "500ml/18fl oz double cream", "1 vanilla pod, split", "125g/4½oz caster sugar", "freshly grated nutmeg", "30g/1oz butter, plus extra for greasing", "110g/4oz clotted cream", "125g/4½oz raspberries", "125g/4½oz strawberries ", "2 tbsp icing sugar", "250g/9oz strong white flour", "pinch salt", "50g/1¾oz caster sugar", "30g/1oz butter, softened", "7g instant yeast", "vegetable oil, for deep frying", "50g/1¾oz caster sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the clotted cream rice pudding, preheat the oven to 180C/350F/Gas 4.", "Lightly grease a 1 litre/1¾ pint pudding basin or ovenproof dish.", "Wash the rice under cold water and drain.", "Place the milk and cream in a saucepan with the vanilla pod and bring slowly to the boil.", "Add the rice and sugar and stir well.", "Pour the mixture into the pudding basin or dish and grate over a little nutmeg.", "Cut the butter into small pieces and place over the top of the rice mixture.", "Transfer the dish to the oven and bake for about 15 minutes, add the clotted cream and mix and then lower the temperature to 150C/300F/Gas 2.", "Bake for another hour, or until golden-brown on top and creamy underneath.", "For the berry sauce, place all the ingredients in a saucepan with 50ml/2fl oz water and cook for 3-4 minutes.", "For the mini doughnuts, combine the flour, salt, and caster sugar in a large bowl.", "Mix in the butter, 150ml/5½fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with clingfilm and set aside in a warm place for about an hour, or until doubled in size.", "Divide the dough into 12 equal portions and roll each into a ball.", "Line a baking tray with baking parchment and place the dough balls onto it, leaving plenty of room between each ball. Cover and set aside in a warm place to prove for a further 20 minutes.", "When the dough has proved, heat the oil in a deep-fat fryer to 150C/300F. Alternatively, heat the oil in a deep, heavy-based saucepan. (Caution: Hot oil can be dangerous. Do not leave it unattended.)", "Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "When the excess oil has drained off the doughnuts, put them on a plate and dust with the caster sugar until completely coated.", "To serve, place a spoonful of rice pudding in shallow serving bowls with the berry sauce and mini doughnuts."]}, {"isVegetarian": true, "title": "Clotted cream rice pudding with raspberries and orange caramel", "url": "www_bbc_co_uk_food_recipes_clottedcreamricepudd_89100", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "200g/7oz pudding rice", "50g/2oz caster sugar", "600ml/1 pint 2fl oz milk", "500ml/18fl oz double cream", "1 vanilla pod, seeds scraped out", "110g/4oz clotted cream", "50g/2oz caster sugar", "300g/10oz raspberries", "75g/3oz caster sugar", "1 orange, juice only"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the rice pudding, heat a saucepan until hot. Add the butter and rice and cook for one minute, stirring to coat the rice with the melted butter.", "Add the sugar, milk, double cream, vanilla pod and seeds. Stir well and bring to the boil.", "Reduce the heat to a simmer and simmer gently for 30-40 minutes until the rice is tender and all the liquid has been absorbed by the rice. Remove the vanilla pod and discard (or rinse and dry thoroughly to use in another recipe of your choice). ", "Meanwhile, for the raspberries, heat a frying pan until hot and add the sugar and raspberries. Cook for 2-3 minutes until the raspberries are soft and the sugar has melted. Set aside to cool slightly.", "For the orange caramel, heat a frying pan until hot. Add the sugar and heat until the sugar melts and starts to caramelise. Add the orange juice (take care as the caramel may spit) and whisk to combine.", "When ready to serve, stir the clotted cream into the rice pudding and heat through. Spoon the raspberries into the bottom of a serving dish, top with the clotted cream rice pudding and pour the orange caramel over the top. Serve immediately."]}, {"isVegetarian": true, "title": "Cobbled loaf", "url": "www_bbc_co_uk_food_recipes_cobbled_loaf_02891", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cobbled_loaf_02891_16x9.jpg", "ingredients": ["250g/9oz strong white flour", "5g salt", "7g sachet fast-action yeast", "30g/1oz caster sugar", "1 orange, finely grated zest only", "120ml/4fl oz full-fat milk", "50g/1¾oz unsalted butter", "6 cardamom pods, seeds removed and crushed", "1 medium free-range egg, beaten", "120g/4¼oz dark chocolate, broken into 24 equal pieces", "250g/9oz strong white flour", "15g/½oz cocoa powder ", "5g salt", "7g sachet fast-action yeast", "30g/1oz caster sugar", "120ml/4fl oz full-fat milk", "50g/1¾oz unsalted butter", "1 tsp vanilla extract", "1 medium free-range egg", "120g/4¼oz white chocolate, broken into 24 equal pieces", "2 tbsp fine semolina", "vegetable oil, for greasing ", "50g/1¾oz caster sugar", "2 wide strips orange peel", "2 cardamom pods, crushed"], "serves": "Makes 1 large sweet loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the orange dough, put the flour in the bowl of a freestanding mixer fitted with a dough hook. Add the salt, yeast, sugar and zest. Mix on a slow speed. Alternatively, put these ingredients into a large mixing bowl and mix well to combine.", "Gently warm the milk, butter and cardamom until the butter is melted, then add to the dry mixture. Gradually add the egg, mixing for about 5 minutes until the dough is soft and smooth. Keep kneading the dough until it is smooth and elastic. Alternatively, knead the dough by hand inside a large bowl for 5—10 minutes, until smooth and elastic, the dough will be quite wet. Tip the dough into a lightly oiled bowl and cover with cling film. Place in a warm place for 1 hour, or until the dough has doubled in size and springs back when you press it.", "For the chocolate and vanilla dough, put the flour and cocoa powder in the bowl of a freestanding mixer fitted with a dough hook. Add the salt, yeast and sugar. Mix on a slow speed. Alternatively, put these ingredients into a large mixing bowl and mix well to combine.", "Gently warm the milk, butter and vanilla until the butter is melted, then add to the dry mixture. Gradually add the egg, mixing for about 5 minutes until the dough is soft and smooth. Keep kneading the dough until it is smooth and elastic. Alternatively, knead the dough by hand inside a large bowl for 5—10 minutes, until smooth and elastic. Tip the dough into a lightly oiled bowl and cover with cling film. Place in a warm place for 1 hour, or until the dough has doubled in size and springs back when you press it.", "Oil a 25cm/10in round deep-sided springform tin and dust the inside with semolina. ", "Divide each type of dough into 12 equal portions. Flatten each portion into a disk approximately 8cm/3¼in in diameter and place two pieces of chocolate one on top of the other in the middle. Gather up the edges of the dough to form a sack and pinch together to seal. Gently roll the ball in your hands and then place in the tin with the sealed edge downwards. Roll the remaining dough in the same way, alternating balls of orange and chocolate dough in the tin. Start from the outside of the tin, where there will be 14 balls, then 8 in the middle, and 2 inside. Cover the tin with cling film and prove for 30-40 minutes in a warm place.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Meanwhile, for the syrup. Put the caster sugar, 50ml/2fl oz water, orange peel and cardamom pods in a small sauce pan. Warm gently until the sugar dissolves then bring to the boil for 1 minute. Remove from the heat and set aside.", "Bake the loaf for 20 minutes, or until the top has browned. Remove from the tin and carefully place upside down on a baking tray lined with baking paper. Return to the oven for a further 10—12 minutes until baked through. Put the loaf the right-side up on a wire rack and leave to cool slightly before brushing with the syrup. Serve the bread warm while the chocolate filling is still oozy."]}, {"isVegetarian": false, "title": "Cockles and mussels cooked in West Country cider and clotted cream", "url": "www_bbc_co_uk_food_recipes_cockles_and_mussels_81006", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz mussels, de-bearded and cleaned under cold running water ", "400g/14oz cockles (washed and filtered from sand and slit)", "300ml/½ pint good dry West Country cider ", "3 banana shallots, peeled and diced ", "6 sticks celery, peeled and diced", "100g/3½oz clotted cream ", "1 lemon, juice only", "2 tbsp chopped fresh chervil", "salt and freshly ground black pepper", "bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them. Do the same with any cockles that remain open when tapped.", "Add the cockles and the mussels to a large lidded saucepan, add the cider, put on the lid and steam over a medium-high heat until the seafood opens – discard any that don’t open.", "Remove the mussels and cockles from the pan. Drain the liquid and set the cider stock to one side. Put the pan back on the heat and cook the shallot and celery until soft.", "Pour the cider stock back onto the vegetables and cook until the volume of liquid has reduced by half. Stir in the clotted cream. ", "Add the cockles and mussels back to the pan, and bring them back up to heat. Finish with lemon juice, chervil, black pepper and salt.", "Serve the cockles and mussels in shallow bowls with a wholesome chunky bread like a poppy and linseed bloomer."]}, {"isVegetarian": false, "title": "Cobnut, wild mushroom and chestnut stir fry", "url": "www_bbc_co_uk_food_recipes_cobnutwildmushrooman_84174", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 onion, finely sliced", "2 sprigs fresh thyme", "150g/5oz mixed wild mushrooms, sliced", "50g/2oz shelled fresh cobnuts", "150g/5oz chestnuts, roasted, peeled", "salt and freshly ground black pepper ", "1 roast chicken"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a frying pan over a high heat. Add the butter and, when melted and foaming, add the onions. Fry for 2-3 minutes, until softened, then add the thyme and wild mushrooms. Sauté for another 2-3 minutes, until tender.", "Add the cobnuts and chestnuts and fry for 1-2 minutes until heated through, then season, to taste, with salt and freshly ground black pepper.", "Serve a spoonful with a plateful of roast chicken."]}, {"isVegetarian": false, "title": "Cock-a-leekie soup", "url": "www_bbc_co_uk_food_recipes_cock-a-leekie_soup_03663", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cock-a-leekie_soup_03663_16x9.jpg", "ingredients": ["1 x 1.5kg/3lb 5oz ready-to-cook chicken", "2 litres/3½ pints chicken stock (or water)", "3 bay leaves", "4 leeks, halved lengthways, thinly shredded", "2 carrots, peeled, halved lengthways, thinly sliced", "2 sticks celery, halved lengthways, sliced", "12 ready-to-eat dried prunes, shredded", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sit the chicken in a large saucepan so it fits snugly and add the stock; you need enough to cover the chicken. ", "Add the bay and season with salt and pepper. Bring to the boil on a high heat. Cover and simmer for 1–1¼ hours, or until cooked through. Remove the chicken from the liquid and check the juices run clear with no trace of pink when the thickest part of the leg, between the drumstick and the thigh, is pierced with a skewer (if not, cook for a little longer). Pull it apart slightly so it cools quickly. ", "Add the leeks, carrots, celery and prunes to the cooking liquid (if you used water, add a couple of chicken stock cubes at this stage). ", "Bring to the boil, then cover and cook for 20 minutes, or until the vegetables are tender.", "Pull the meat from the chicken carcass into bite-sized pieces, discarding any skin and bone. Remove the bay leaves from the pan, add a little salt and pepper if needed, return the chicken to the pan and stir. Heat until piping hot. Serve in warmed bowls or mugs."]}, {"isVegetarian": false, "title": "Cock-a-leekie soup", "url": "www_bbc_co_uk_food_recipes_cockaleekie_9506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium chicken", "1 carrot, peeled and diced", "1 onion, peeled and diced", "2 sticks of celery, diced", "1 leek, washed and diced", "1 bouquet garni ", "For clarifying:", "150g/6oz chicken, minced", "2 egg whites", "For finishing:", "1 large leek, cut into 10-12.5cm/4-5in lengths about 1cm/½in wide", "15 prunes, julienned", "salt and pepper"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sit the chicken on a rack set over a roasting tray and roast for 15-20 minutes until golden brown.", "Transfer the chicken to a large heavy based pan, reserving the fat caught in the roasting tray. Scatter the diced vegetables over and pour in enough cold water to just cover. Add the bouquet garni in and season. Bring to the boil and simmer for 40-45 minutes until tender.", "Remove the chicken from the stock and leave to rest and cool slightly. Remove all the meat from the carcass and shred the chicken into small pieces.", "Meanwhile, strain the stock through a fine sieve, discarding the vegetables. Return the passed stock to a clean pan. Mix the minced chicken and egg whites together to combine and whisk the mixture quickly into the stock. Very slowly bring the stock to a simmer. Avoid stirring, but whisk once as the stock is coming up to temperature. The chicken and egg white mixture will solidify and rise to the top of the stock. As the stock simmers any impurities will rise to the top and thus clarify the stock. Pass the stock through a fine sieve once again. ", "Bring a pan of salted water to the boil and blanch the leek strips for 1-2 minutes until softened. Drain and refresh in ice cold water. Drain again.", "To serve, arrange some chicken shreds in the center of each serving bowl. Sit the leeks and prunes on top. Ladel the warm stock over (which will warm the other ingredients through). Drizzle some of the reserved chicken fat over and serve at once."]}, {"isVegetarian": false, "title": "Cockles, laverbread and Welsh bacon", "url": "www_bbc_co_uk_food_recipes_cockleslaverbreadand_92241", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz ready-prepared laverbread (available in cans from online shops)", "50g/2oz oatmeal", "freshly ground white pepper, to taste", "225g/8oz picked cockle meat, cooked ", "25g/1oz butter", "1 leek, finely chopped", "50g/2oz bacon fat", "8 smoked bacon rashers, fried until crisp, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix together the laverbread and oatmeal until well combined. Season, to taste, with freshly ground white pepper and set aside for 20 minutes. ", "Melt the butter in a frying pan until foaming, then add the leek and fry for 3-4 minutes, or until softened. Add the picked cockle meat and cook for a further 1-2 minutes, or until heated through. ", "With damp hands, pinch off pieces of the laverbread mixture and roll into golf ball-sized balls. Flatten the balls slightly to make small patties. ", "In a separate pan, heat the bacon fat over a medium heat. Fry the laverbread patties, in small batches, for 2-3 minutes on both sides or until golden-brown all over. ", "To serve, divide the laverbread patties among four serving plates and spoon over the cockles and leeks. Top each serving with two rashers of crisp bacon."]}, {"isVegetarian": false, "title": "Cockles marinière on garlic toast", "url": "www_bbc_co_uk_food_recipes_cocklesmariniereserv_87151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "200g/7oz cockles", "100ml/3½fl oz white wine", "30g/1oz butter", "1 garlic clove, chopped", "3 slices farmhouse bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan, add the onion and gently fry for four minutes. ", "Add the cockles and white wine, cover with a lid and leave for 3-4 minutes or until all the cockle shells have opened. ", "Discard any that have not opened or the shells that are damaged. ", "Add the butter and garlic to the pan and cook for one minute. ", "To serve, place the toasted bread onto a serving plate. Pour the cockles and sauce over the bread."]}, {"isVegetarian": true, "title": "Cobnut, pear and sticky toffee tart", "url": "www_bbc_co_uk_food_recipes_cobnut_pear_and_sticky_68333", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cobnut_pear_and_sticky_68333_16x9.jpg", "ingredients": ["200g/7oz plain flour", "2 tbsp icing sugar", "100g/3½oz unsalted butter, chilled, cut into 1cm/½in cubes", "1 free-range egg, lightly beaten", "1 tsp lemon juice", "200g/7oz dates, stones removed, roughly chopped ", "150ml/5½fl oz full-fat milk", "3 ripe medium pears (approximately 500g/1lb 2oz),  peeled, quartered and cored", "50g/1¾oz unsalted butter, softened", "1 tsp vanilla extract", "100g/3½oz plain flour", "1 tsp bicarbonate of soda", "50g/1¾oz ground almonds", "2 large free-range eggs", "100g/3½oz light muscovado sugar", "2 tbsp treacle", "100g/3½oz shelled cobnuts or hazelnuts, roughly chopped", "200g/7oz light muscovado sugar", "50g/1¾oz unsalted butter", "250ml/9fl oz double cream"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, mix the flour and icing sugar together in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor and then transfer to a bowl.", "In a separate bowl, mix the egg with the lemon juice and two tablespoons of water. Make a well in the centre of the flour mixture and pour in the egg mix. Using a table knife, work the liquid into the flour to bring the pastry together. If it seems too dry, add a splash more water. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap in cling film and rest in the fridge for at least 15 minutes.", "For the filling, put the chopped dates and milk in a pan. Bring to the boil, and then set aside for 30 minutes to soak.", "For the toffee sauce, heat the sugar, butter and cream together in a pan over a low heat until melted and smooth, then bring to a simmer and let it bubble for five minutes to thicken. Leave to cool.", "Preheat the oven to 180C/350F/Gas 4 and put a baking tray on the middle shelf to warm up.", "Roll out the pastry on a lightly floured work surface and use it to line the tart tin. Prick the base with a fork. Slice each quarter of pear in two. Arrange in a circular fan pattern in the tart case. Drizzle over four tablespoons of the toffee sauce and put the tart in the fridge while you prepare the rest of the filling.", "For the filling, mash the date mixture to a coarse purée with a potato masher. Tip it into a bowl with the softened butter, vanilla, flour, bicarbonate of soda, ground almonds, eggs, sugar and treacle. Whisk together with an electric whisk until just combined. Stir in the chopped nuts.", "Spoon the mixture over the pears in the pastry case, spreading it out evenly. Bake the tart on the hot baking tray for 40-45 minutes, or until the filling is well risen and browned. Leave to stand for 10 minutes before removing from the tin.", "Serve the tart warm, with clotted cream or ice cream and the rest of the toffee sauce."]}, {"isVegetarian": false, "title": "Cockles with smoked chilli broth", "url": "www_bbc_co_uk_food_recipes_cockleswithsmokedchi_90043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½oz olive oil", "½ red onion, chopped", "4 garlic cloves ", "1 dried, smoked habanero chilli, chopped", "900g/2lb fresh cockles, cleaned and drained (discard any cockles that remain open after cleaning)", "250ml/9fl oz white wine", "150ml/5fl oz passata", "salt and freshly ground black pepper", "bunch fresh parsley, chopped", "crusty bread, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry for 5-6 minutes, or until softened and just starting to brown.", "Add the dried chilli, the cockles, white wine, passata and season, to taste, with salt and freshly ground black pepper.", "Cover the pan with a lid and steam the cockles for 4-5 minutes, shaking the pan occasionally, until all of the cockles have opened. Discard any cockles that have not opened after five minutes.", "To serve, stir in the fresh parsley and spoon into bowls. Serve with crusty bread."]}]