[{"ingredients": ["2 cucharadas de aceite de oliva", "4 cebolletas, picadas", "200ml / 7fl oz de vino blanco", "200ml / 7fl oz de caldo de verduras", "Hojas de cohete de 85g / 3oz, más extra para decorar", "1 cabeza de lechuga Little Gem, picada", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "1 rebanada de pan blanco", "1 diente de ajo, aplastado", "2 hojas de menta fresca cortadas, para servir"], "method": ["Precalentar la parrilla a alto.", "Caliente una cucharada de aceite en una sartén y fríe las cebollas tiernas por 2-3 minutos, o hasta que se ablanden. Agregue el vino y cocine a fuego lento durante 5-6 minutos, o hasta que el líquido se haya reducido a la mitad.", "Agregue el caldo, lleve a ebullición y agregue el cohete y la lechuga. Reduzca el fuego y cocine a fuego lento durante 3-4 minutos, mezcle la crema y sazone, al gusto, con sal y pimienta negra recién molida. Mezcle hasta que quede suave con una batidora.", "Rocíe el aceite restante sobre la rebanada de pan, esparza el ajo y tueste por debajo de la parrilla hasta que estén dorados y crujientes.", "Para servir, devuelve la sopa a la sartén para que se caliente si es necesario, luego ponla en un tazón para servir y sírvela con el cuscurrón de ajo. Adorne con hojas de rúcula y hojas de menta picadas."], "url": "www_bbc_co_uk_food_recipes_creamyrocketlettucea_90119", "title": "Sopa cremosa de rúcula, lechuga y menta con croûtons de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, en rodajas", "2 dientes de ajo, finamente picados", "½ Scotch Bonnet chilli, finamente cortado", "115 g / 4 oz de champiñones shiitake, rebanadas gruesas", "100ml / 3½fl oz de vino blanco", "100ml / 3½ fl oz crema doble", "Filete de filete 150 g / 5½ oz, cortado en tres piezas", "2 cucharadas de aceite de sésamo", "pimienta negra recién molida", "½ lima, solo jugo"], "method": ["Para el caldo de shiitake cremoso, caliente el aceite en una sartén y fría la cebolla y el ajo durante 2-3 minutos.", "Agregue el chile en rodajas y los champiñones y continúe freír durante 4-5 minutos más. Agregue el vino y la crema y lleve a fuego lento. Cocine a fuego lento durante 3-4 minutos.", "Para la carne de sésamo a la parrilla, frote el aceite de sésamo en la carne y sazone bien con pimienta negra recién molida. Caliente una sartén hasta que esté caliente, coloque la carne en la plancha y frótela en ambos lados hasta que esté cocida a su gusto. Exprima el jugo de lima hacia el final de la cocción.", "Para servir, vierta el caldo en un recipiente hondo poco profundo y coloque la carne a la parrilla en la parte superior."], "url": "www_bbc_co_uk_food_recipes_creamyshiitakebrothw_88640", "title": "Caldo de shiitake cremoso con carne de sésamo a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 250ml / 9fl oz", "1 cucharada de mostaza Dijon", "1 limón, solo jugo", "sal y pimienta negra recién molida", "Filete de salmón 100 g / 3½ oz, piel eliminada, en rodajas", "Pasta de pelo de ángel de 250 g / 9 oz, cocida", "2 cucharadas de cebolletas frescas picadas, para adornar"], "method": ["Coloque la crema, la mostaza, el jugo de limón y la sal y pimienta negra recién molida en una cacerola y deje que hierva.", "Agregue el salmón y cocine por 2-3 minutos.", "Agregue la pasta cocida caliente a la salsa y mezcle bien.", "Para servir, revuelva y cuchara en dos tazones de servir. Adorne con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_creamysalmonpastawit_87109", "title": "Pasta cremosa de salmón con salsa de mostaza, nata y cebolleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla picada", "1 diente de ajo, aplastado", "150ml / ¼ pinta de agua", "200 g / 7 oz de espinacas frescas", "sal y pimienta negra recién molida", "2 cucharadas de crema", "1 cucharada de perejil fresco picado"], "method": ["Calentar el aceite de oliva en una olla. Agregue la cebolla, el ajo y el sudor durante unos minutos.", "Agregue el agua y las espinacas, y revuelva hasta que la espinaca se haya marchitado. Sazone con sal y pimienta negra recién molida, luego agregue la crème fraîche. Calienta completamente.", "Mezcle con una batidora pequeña hasta que quede suave. Pase a través de un colador en un tazón de sopa caliente y espolvoree con perejil. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_creamyspinachsoup_87349", "title": "Sopa cremosa de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cebolla roja, finamente picada", "2 dientes de ajo, finamente picados", "100ml / 3½fl oz de vino blanco", "125g / 4½ oz de queso taleggio, picado", "150ml / 5fl oz de crema doble", "Tagliatelle 200g / 7oz", "Brócoli brotación púrpura de 150 g / 5½ oz", "1 pan pequeño bloomer blanco, parte superior cortada y ahuecada (sigue para hacer migas de pan)", "1 diente de ajo, pelado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la cebolla y el ajo en una cacerola y vierta sobre el vino. Cocine a fuego lento durante 3-4 minutos, o hasta que la cebolla y el ajo comiencen a ablandarse. Agregue el queso, revuelva hasta que se derrita, luego agregue la crema. Cocine a fuego lento durante 6-8 minutos, o hasta que el líquido se haya reducido a una salsa espesa.", "Cocine la pasta y el brócoli en agua hirviendo con sal hasta que estén tiernos, luego drene y mezcle con la salsa de crema de queso.", "Coloque el pan ahuecado en una bandeja para hornear y colóquelo en el horno durante 2-3 minutos, o hasta que esté crujiente y ligeramente dorado. Frote el interior del pan con el ajo, luego coloque el pan en una porción tarde. Rellene con la pasta, el brócoli y la mezcla de crema de queso y sirva."], "url": "www_bbc_co_uk_food_recipes_creamytagliatellewit_89124", "title": "Tagliatelle cremoso con brócoli que brota púrpura servido en un pan de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 coliflor, cortada y cortada en piezas de 1cm / 0.5in", "10oz / 300g de queso crema", "1 cucharadita de mostaza Dijon", "4oz / 125g de queso azul, desmenuzado", "1oz / 25g de nueces, toscamente picadas", "Queso cheddar de 2oz / 50g, rallado", "sal", "pimienta negra recién molida", "ensalada de berros"], "method": ["Ponga a hervir 5 cm / 2 pulgadas de profundidad en una cacerola, agregue la coliflor y cocine por unos 8 minutos o hasta que esté tierna. Escurrir, y devolver la coliflor a la sartén.", "Mezcle el queso crema y la mostaza con la coliflor, luego agregue el queso azul. Sazonar con un poco de sal si es necesario y mucha pimienta.", "Vierta la mezcla en un plato gratinado poco profundo. Esparce las nueces encima y luego cúbrelas con el queso cheddar (esto ayuda a evitar que las nueces se quemen). Coloque debajo de una parrilla caliente precalentada durante 10-15 minutos, o hasta que la parte superior esté dorada y el interior caliente y burbujeante.", "Servir a la vez con una ensalada de berros."], "url": "www_bbc_co_uk_food_recipes_creamythreecheesecau_72958", "title": "Cremoso queso de coliflor con nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamythreecheesecau_72958_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla grande, picada", "2 dientes de ajo, aplastados", "2 palitos de apio picados", "200 g / 7 oz de zanahorias, picadas", "1 hoja de laurel", "1 ramita grande de tomillo fresco", "750g / 1½lb de ciruela madura o tomates maduros, cortados en trozos", "½ cucharadita de azúcar", "sal y pimienta negra recién molida", "200ml / 7fl oz pasados", "500ml / 17fl oz de caldo de verduras", "100 ml / 3½ fl oz crema individual o crème fraîche baja en grasa", "salpicar jerez seco", "pan crujiente y mantequilla, para servir"], "method": ["Caliente el aceite de oliva en una cacerola grande y cocine la cebolla durante 5-6 minutos a fuego lento hasta que esté casi blanda pero no dorada. Agregue el ajo, el apio, las zanahorias, la hoja de laurel y el tomillo y cocine durante 6-7 minutos más, revolviendo ocasionalmente, asegurándose de que las verduras no se peguen a la base de la sartén.", "Agregue los tomates picados y el azúcar y sazone bien con sal y pimienta. Cocine por unos minutos, luego mezcle la passata y el caldo de verduras. Traiga a fuego lento, cubra con una tapa y cocine durante 35-40 minutos, hasta que todas las verduras estén tiernas.", "Retire la hoja de laurel y el tomillo, luego mezcle la sopa en un licua- dor o procesador de alimentos. Esto probablemente tendrá que hacerse en dos lotes. Vierta la sopa en una olla limpia, pasándola a través de un colador si lo quiere realmente suave. Agregue la crema, un chorrito de jerez y condimento extra si es necesario.", "Vierta en tazas grandes o tazones y sirva con pan crujiente con mantequilla fresco."], "url": "www_bbc_co_uk_food_recipes_creamytomatosoup_67508", "title": "Sopa cremosa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamytomatosoup_67508_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 450ml / 16fl oz", "50ml / 2 fl oz de leche entera", "2 vainas de vainilla, partidas, semillas raspadas (o unas gotas de extracto de vainilla)", "5 huevos de gallinas camperas", "75g / 2½ oz de azúcar en polvo, más 40 g / 1½ oz más, para el relleno"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Vierta la crema y la leche en una sartén de fondo grueso a fuego medio y cocine a fuego lento.", "Separe las vainas de vainilla por el medio con un cuchillo afilado. Raspe las semillas con el cuchillo y agregue las semillas y las vainas (o el extracto de vainilla) a la mezcla de crema y leche. Revuelva bien para combinar.", "Separe las yemas de huevo y las claras de huevo. Solo las yemas se usan en esta receta, por lo que puede usar las claras de huevo para otro plato o congelarlas para usarlas en el futuro.", "Vierta el azúcar impalpable en el recipiente con las yemas. Batir las yemas de huevo y el azúcar impalpable hasta que estén bien combinados.", "Cuando la mezcla de crema y leche esté llegando a fuego lento, viértala (incluidas las vainas de vainilla, si se usa) en el bol con la mezcla de yema de huevo. Revuelva bien por un minuto o dos para disolver el azúcar. En esta etapa, puede enfriar la mezcla en el refrigerador y hacer las bruleas al día siguiente, o continuar con la receta.", "Vierte la mezcla brûlée en el plato (o platos). Deseche las vainas de vainilla.", "Coloque los platos de crème brûlée en una bandeja honda para hornear y vierta agua caliente en la bandeja, hasta que el agua llegue a la mitad de los lados de los platos (esto se conoce como baño maría).", "Coloque el bain-marie en el horno precalentado y cocine las creme brulees durante aproximadamente 30-35 minutos, hasta que quede firme, pero aún con un ligero bamboleo. Dejar enfriar. Puede colocar los brûlées en el refrigerador en esta etapa si no los está sirviendo inmediatamente.", "Para el aderezo, espolvorea la mitad del azúcar impalpable restante sobre los brûlées. Caliente la superficie con un mini soplete hasta que forme una fina capa de caramelo.", "Espolvorea sobre el resto del azúcar en una capa final y carameliza con el mini-soplete una vez más, para formar una capa gruesa y crujiente. Las crème brûlées están listas para servir inmediatamente o en 2-3 horas."], "url": "www_bbc_co_uk_food_recipes_cremebrulee_90204", "title": "Cómo hacer crème brûlée", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cremebrulee_90204_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 450ml / 16fl oz", "50ml / 2fl oz de leche entera", "2 vainas de vainilla, partidas, semillas raspadas con un cuchillo", "115 g / 4 oz de azúcar en polvo", "5 yemas de huevo de gallinas camperas"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Llevar la crema y la leche a fuego lento en una sartén de base pesada a fuego medio.", "Agregue las semillas de vainilla y las vainas y revuelva bien para combinar.", "Batir juntos 75 g / 2½ oz del azúcar impalpable y todas las yemas de huevo en un tazón grande hasta que estén pálidas, esponjosas y bien combinadas.", "Retire las vainas de vainilla de la mezcla de leche y crema. Vierta la mezcla caliente de leche y crema sobre el huevo batido y la mezcla de azúcar, revolviendo continuamente hasta que el azúcar se haya disuelto.", "Vierta la mezcla de crème brulée en cuatro moldes. Coloque los moldes en una lata de tostado profunda. Con cuidado, agregue suficiente agua hirviendo a la lata de asar para llegar a la mitad de los lados de los moldes. (Esto se llama bain-marie).", "Transfiera el baño maría al horno y cocínelo durante 30-35 minutos, o hasta que la crema se haya endurecido, pero todavía tenga un ligero bamboleo. Retire la crème brulées del bain-marie y déjela enfriar.", "Una vez frío, enfríe la crème brulées en la nevera hasta que sea necesario.", "Cuando la crème brulées esté lista para servir, espolvoree 20 g / ¾oz del azúcar impalpable restante sobre la superficie de la crema brulées. Usando un soplete de cocineros, caliente el azúcar hasta que se derrita y caramelice, luego déjelo enfriar.", "Repita el proceso con el azúcar restante, hasta que el azúcar se haya caramelizado y endurecido. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cremebrulee_91228", "title": "Crema catalana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Leche entera 75ml / 2½fl", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, división y semillas retiradas", "4 yemas de huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo, más extra para cubrir", "25g / 1oz de mantequilla", "25 g / 1 oz de azúcar", "2 cucharadas de glucosa líquida o jarabe de oro", "65 g / 2½ oz de almendras, pieles eliminadas, picadas"], "method": ["Precalentar el horno a 120C / 250F / Gas ¼.", "Coloque la leche, la crema doble, las semillas de vainilla y la vaina en una sartén. Llevar a ebullición.", "En un tazón grande bata las yemas de huevo y el azúcar hasta que estén bien combinados, luego agregue la leche.", "Cuele la mezcla a través de un tamiz y divídala entre cuatro moldes a prueba de horno. Coloque los moldes en una bandeja de asar y llene la bandeja con agua hasta que llegue a la mitad de los lados de los moldes. Coloque la bandeja en el horno y cocine durante 30-40 minutos, o hasta que la mezcla esté firme al tacto. Una vez cocinado, retíralo del horno y déjalo enfriar. Coloque en la nevera para enfriar.", "Para las galletas, precaliente el horno a 160 ° C / 325 ° F / Gas 2. Derrite la mantequilla en una sartén, luego agregue el azúcar y la glucosa líquida o el jarabe dorado y deje que hierva. Retire la sartén del fuego y agregue las almendras. Vierta la mezcla en una bandeja cubierta con papel de hornear y coloque en la nevera para enfriar durante 2-3 minutos, hasta que la masa esté firme y flexible.", "Retire la bandeja de la nevera y moldee la mezcla de almendras en aproximadamente 25 formas de tamaño de mármol. Coloque en una bandeja para hornear limpia. Deje suficiente espacio entre ellos para que las galletas se extiendan. Coloque la bandeja en el horno y cocine durante 4-5 minutos. Deja enfriar.", "Para servir, espolvorea cada nata quemada con un azúcar para cubrir y caramelizar la parte superior con un mini soplete. Alternativamente, puede colocar los moldes debajo de una parrilla caliente hasta que estén dorados y caramelizados. Sirve con un broche de almendra."], "url": "www_bbc_co_uk_food_recipes_cremebruleewithalmon_86596", "title": "Crème brûlée con galletas de almendra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de azúcar en polvo", "5 yemas de huevo de gallinas camperas", "75ml / 3fl de leche en oz", "3 vainas de vainilla, partidas, semillas raspadas", "Crema batida de 500ml / 18fl oz", "100g / 3½ oz de azúcar Demerara", "100 g / 3½ oz de fresas", "Frambuesas 100g / 3½ oz", "100 g / 3½ oz de grosellas rojas", "100 g / 3½ oz de grosellas negras", "100 g / 3½ oz zarzamoras", "100 g / 3½ oz de azúcar en polvo", "pequeño manojo de menta fresca", "300ml / 11fl de leche en oz", "2 cucharadas de crema de menta"], "method": ["Coloque el azúcar impalpable y las yemas de huevo en un bol y bata hasta que estén pálidos y claros.", "Coloque la leche en una cacerola con las vainas de vainilla y deje que hierva, luego retírela del fuego.", "Poco a poco agregue la leche a los huevos batidos y el azúcar, batiendo constantemente, luego agregue la crema y bata suavemente para combinar. Coloque en el refrigerador y déjelo durante 12 horas para infundir.", "Precalentar el horno a 140C / 285F / Gas 1.", "Alinee las bases de ocho anillos de cocineros pequeños con dos capas de película adhesiva y colóquelas en una bandeja para hornear. Divida la mezcla entre los anillos de los chefs y colóquela en el horno para que se cocine durante 45 minutos, o hasta que la mezcla se haya solidificado como un flan de huevo. Sacar del horno y dejar enfriar.", "Espolvorea la parte superior de la crema brûlées con azúcar Demerara. Coloque cada anillo en un plato y luego retire con cuidado el anillo y la película adhesiva.", "Caliente la parte superior del azúcar con un mini soplete, hasta que el azúcar se derrita y se ponga dorado.", "Para las frutas marinadas, quite los tallos de las frutas y corte las fresas en cuartos.", "Tome un cuarto de cada fruta y coloque en un tazón grande. Agregue el azúcar impalpable y, usando un tenedor, mezcle las frutas.", "Agregue el resto de la fruta, mezcle bien y agregue la menta. Deje reposar durante cinco minutos.", "Pruebe la mezcla de frutas y agregue un poco de azúcar si la fruta está demasiado afilada.", "Para el caldo de menta, coloque la leche y la crema de leche en una cacerola y caliente hasta que estén calientes, pero no hierva.", "Con una batidora de mano, espuma la leche para producir un efecto de \"capuchino\".", "Para servir, coloque la fruta en cada plato alrededor de la crème brûlées, luego espolvoree el caldo de menta sobre la fruta y alrededor de los platos."], "url": "www_bbc_co_uk_food_recipes_cremebruleewithmarin_84170", "title": "Nata quemada con fruta marinada y caldo de menta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 yemas de huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "Leche de 85ml / 3fl oz", "3 vainas de vainilla, partidas y semillas raspadas", "500ml / 17fl oz crema batida fría", "azúcar demerara, para rociar", "Fresas de 100g / 3½oz, descascadas y descuartizadas", "Frambuesas 100g / 3½ oz", "100 g / 3½ oz de grosellas rojas", "100 g / 3½ oz de grosellas negras", "100 g / 3½ oz zarzamoras", "azúcar en polvo, al gusto", "pequeño puñado de menta fresca, picado"], "method": ["Para la crème brûlées, coloque las yemas de huevo en un bol con el azúcar y mezcle hasta que estén bien combinadas.", "Coloque la leche en una sartén y deje hervir con las vainas de vainilla y las semillas.", "Vierta la leche en el recipiente con la mezcla de huevo y mezcle bien. Agregue la crema fría, cúbrala y luego déjela infundir durante 12 horas.", "Precalentar el horno a 100C / 200F / Gas ½.", "Retire las vainas de vainilla y divida la mezcla entre ocho moldes, llenando cada uno justo debajo del borde. Coloque los moldes en una bandeja para hornear, transfiéralos al horno y hornee por aproximadamente una hora, o hasta que se asienten. Sacar del horno y dejar enfriar.", "Para las frutas de verano marinadas, lave las frutas y déjelas escurrir en un colador. Coloque un puñado grande de la fruta en un tazón con azúcar en polvo, al gusto, y mastique con un tenedor. Agite suavemente la fruta restante y la menta picada y deje reposar durante cinco minutos. Pruebe y agregue un poco más de azúcar si la fruta está demasiado afilada.", "Espolvorea la parte superior de la crème brûlées con azúcar demerara, luego calienta con un mini soplete hasta que esté caramelizado. (Alternativamente, colóquelos bajo una parrilla muy caliente durante 30 segundos o hasta que el azúcar se haya carbonizado).", "Para servir, coloque la crème brûlées en platos para servir con una cucharada de frutas marinadas."], "url": "www_bbc_co_uk_food_recipes_cremebruleewithmarin_86528", "title": "Crème brûlée con frutas de verano marinadas y un caldo de menta", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110 g / 4 oz de crema fresca", "75g / 3oz de berros, más o menos picados", "sal y pimienta negra recién molida", "1 pollo grande, con un peso de 2-3 kg / 4 lb 4 oz-6 lb 8 oz, preferiblemente orgánico", "40 g / 1½ oz de mantequilla, ablandada", "2 cucharadas de aceite de oliva virgen extra", "18 rebanadas de tocino rayado", "3 cucharadas de harina común", "150ml / 5fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo", "12 salchichas de chipolata", "10 patatas King Edward, peladas y cortadas en trozos grandes", "50 g / 2 oz de manteca de cerdo, goteo o aceite vegetal", "6 zanahorias, peladas y cortadas en trozos grandes", "1 cabeza de brócoli, cortada en grandes floretes", "1 cabeza de coliflor, cortada en grandes floretes", "150g / 6oz de judías verdes, recortadas", "2 manojos de espárragos, recortados", "110g / 4oz de mantequilla", "1 cebolla grande, pelada", "6 dientes", "1 hoja de laurel", "6 granos de pimienta negra", "450 ml / 1 pinta de leche entera", "Pan rallado blanco fresco de 110g / 4oz", "40 g / 1½ oz de mantequilla", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "1 papa grande para hornear, cortada muy finamente en una mandolina", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo asado, mezcle la crème fraîche y el berro juntos en un tazón y sazone con sal y pimienta negra recién molida. Coloque la mezcla en una manga pastelera.", "Coloque el pollo en una lata de asar. Deslice su mano hacia arriba debajo de la piel del pollo y coloque la boquilla de la manga pastelera debajo de la piel. Exprime la mezcla de relleno, alisando el pecho y la pierna.", "Frote la mantequilla y el aceite de oliva sobre el ave y sazone con sal y pimienta negra recién molida. Coloque seis rebanadas de tocino sobre el pecho del pollo.", "Transfiera el pollo al horno y tueste durante 20 minutos por 450 g / 1 libra, hilvanando con frecuencia. Para verificar si el pollo está cocido, inserte un pincho en el muslo en el punto más grueso. Si los jugos se aclaran, el pájaro está listo. De lo contrario, regrese al horno por otros cinco minutos a la vez. Retire del horno, coloque en un plato de servir y reservar en un lugar cálido durante 15 minutos.", "Para hacer la salsa, coloque la lata de asar sobre la placa y caliéntela suavemente, revuelva con una cuchara de madera y retire todos los trozos del fondo de la sartén.", "Agregue la harina común y cocine, revolviendo, durante 1-2 minutos.", "Agregue el vino y cocine a fuego lento hasta que se reduzca a la mitad. Agregue el caldo y cocine a fuego lento durante cinco minutos. Sazonar, al gusto, con sal y pimienta negra recién molida, luego pasar la salsa a través de un colador en una jarra y mantener caliente hasta que esté listo para servir.", "Envuelva las rebanadas de tocino restantes alrededor de las salchichas chipolata. Coloque en una bandeja para hornear y hornee en el horno durante los últimos 15 minutos, mientras el ave está descansando.", "Mientras tanto, para las verduras, coloque las papas en una olla grande. Cubra con agua, agregue una pizca de sal y deje hervir. Reduzca el fuego y cocine a fuego lento durante 3-4 minutos. Escurre en un colador y sacúdalo un poco para hacer que los bordes se vuelvan ásperos.", "Coloque una lata de tueste profunda sobre el fuego y vierta la grasa. Agregue las papas y fría en cada lado hasta que comiencen a dorarse. Espolvorear con sal, luego transferir al horno y asar durante 50 minutos, una hora, girando a la mitad del tiempo de cocción, hasta que estén dorados y crujientes.", "Cocine todas las verduras restantes en agua hirviendo con sal hasta que estén tiernas, luego drene y revuelva en agua helada. Cuando todas las verduras estén cocidas y hayan sido enfriadas, colóquelas en un plato grande en el refrigerador, tapadas.", "Para la salsa de pan, adornar la cebolla con los dientes, colocar en una olla junto con la hoja de laurel, granos de pimienta y leche. Llevar a ebullición, luego retirar del fuego y dejar enfriar e infundir.", "Retire la cebolla, la hoja de laurel y los granos de pimienta y deséchelos. Agregue las migas de pan a la sartén y revuelva. Regrese la sartén al fuego y caliente muy suavemente durante 5-10 minutos, revolviendo ocasionalmente hasta que las migas de pan hayan absorbido todo el líquido. Agregue la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida.", "Cuando esté casi listo para servir el asado, haga las fichas del juego. Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, coloque las rodajas de patata en el aceite caliente y fríalo durante 1-2 minutos hasta que estén doradas. Retirar del aceite con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con sal y pimienta negra recién molida. Apila las fichas del juego en el plato de pollo.", "Ponga a hervir una olla grande de agua. Saque los vegetales de la nevera y drene, luego colóquelos en la cacerola con agua hirviendo y cocínelos por 30-45 segundos hasta que estén calientes.", "Drene las verduras y regrese a la sartén. Agregue la mantequilla, sazone con sal y pimienta negra recién molida y revuelva bien para cubrir.", "Para servir, coloque las verduras y las patatas asadas en platos para servir. Vierta la salsa de pan en una jarra de servir. Esculpe el pollo, colóquelo en platos para servir y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_cremefraicheandwater_87457", "title": "Crème fraîche y berro pollo asado con todos los adornos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de azúcar en polvo", "3 cucharadas de agua", "Crema doble de 425 ml / 15 fl oz", "1 vaina de vainilla, dividida", "50 g / 2 oz de azúcar en polvo", "4 huevos de gallinas camperas", "250 g / 9 oz de cerezas, piedras removidas", "250ml / 9fl oz de vino tinto", "1 cucharada de Kirsch", "75g / 3oz de azúcar en polvo", "½ limón, solo jugo", "150ml / 5fl oz de crema doble", "2 cucharadas de jarabe de cereza (ver a continuación)"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los crème caramels, coloque el azúcar y el agua en una sartén y deje que hierva. Cocine por 4-5 minutos, o hasta que el azúcar se haya disuelto y haya dado un color caramelo.", "Vierta un poco del caramelo en el fondo de cada uno de los cuatro moldes grandes o tazas, con cuidado agitando el caramelo por los lados de la taza.", "Coloque la crema y la vaina de vainilla en la sartén en la que se hizo el caramelo y cocine a fuego lento.", "Coloque los huevos y el azúcar en un tazón y mezcle hasta que estén suaves, luego vierta la crema caliente sobre la mezcla de huevo, batiendo todo el tiempo. Colar en los moldes revestidos de caramelo.", "Coloque los moldes en una lata de asar profunda y llene la lata de asar con agua caliente a dos tercios del camino hasta los lados de los moldes.", "Coloque en el horno de 15 a 20 minutos, dependiendo del tamaño de los moldes, o hasta que esté listo.", "Retire del horno, saque la lata de asar y deje que se enfríe completamente antes de colocarla en la nevera para enfriar durante 1-2 horas.", "Para las cerezas escalfados, coloque las cerezas, el vino tinto, Kirsch, azúcar y jugo de limón en una sartén y deje que hierva. Cocine a fuego lento durante 2-3 minutos hasta que las cerezas estén tiernas. Con una cuchara ranurada, retire las cerezas del líquido y déjelas a un lado.", "Encienda el fuego debajo de la sartén y vuelva a hervir el líquido. Cocine por 4-5 minutos, o hasta que esté solo almíbar.", "Vierta el almíbar sobre las cerezas, reservando dos cucharadas y déjelo enfriar.", "Para la crema de cereza, coloque la crema en un bol y bata hasta que se formen picos suaves cuando se quite la batidora. Agregue el jarabe de cereza reservado y bata suavemente para combinar.", "Para servir, voltea los caramelos de crema en cuatro platos para servir. Ponga un poco de cerezas a un lado, rocíe el almíbar y sirva con una cucharada de crema de cereza."], "url": "www_bbc_co_uk_food_recipes_cremecaramelwithpoac_86696", "title": "Caramelos de crema con cerezas escalfadas y crema de cereza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "2 cebollas, peladas, finamente picadas", "4 dientes de ajo, pelados, picados", "1 pimiento verde, semillas eliminadas, picadas", "1 pimiento rojo, semillas eliminadas, picadas", "3 berenjenas grandes, cortadas en cubos", "¼ cucharada de pimentón caliente", "¼ cucharada de pimentón dulce", "2 cucharaditas de comino molido", "800g / 1lb 12¼ oz de tomates cherry enlatados", "½ cucharadita de azúcar morena blanda", "sal y pimienta negra recién molida", "2 cucharadas de hojas de perejil fresco picado", "8 cuñas de lima"], "method": ["Caliente dos cucharadas de aceite en una sartén a fuego medio. Agregue las cebollas picadas, el ajo y los pimientos y fría en el aceite, revolviendo bien, hasta que se ablanden, alrededor de 3-4 minutos.", "Mientras tanto, caliente el aceite restante en una sartén o cacerola y fría los cubos de berenjena, en tandas, durante 4-6 minutos, o hasta que estén doradas por completo. Retire de la sartén con una cuchara ranurada y déjelo a un lado en un plato calentado. Repita el proceso con los lotes restantes de cubos de berenjena.", "Mezcle el pimentón picante, el pimentón dulce y el comino en la mezcla de cebolla y cocine por un minuto, o hasta que las especias estén fragantes. Agregue los tomates enlatados, el azúcar y las berenjenas cocidas, y sazone al gusto con sal y pimienta negra recién molida.", "Vierta 350ml / 12½fl oz de agua en la sartén, revuelva bien y hierva, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 15-20 minutos, o hasta que la mezcla se haya espesado y esté bien cocida.", "Sirva las berenjenas criollas espolvoreadas con perejil picado y adornadas con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_creoleaubergines_92669", "title": "Berenjenas criollas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creoleaubergines_92669_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "15 g / ½ oz de azúcar en polvo", "pizca de sal", "2 huevos medianos de granja", "325ml / 11½ fl oz de leche", "50ml / 1¾fl oz de crema doble", "algunas gotas de agua de flor de naranja", "20 g / oz de mantequilla clarificada", "10 naranjas, 6 jugo, 4 segmentadas", "100g / 3½oz de azúcar glasé", "125g / 4½oz de mantequilla, picada en cubitos, ablandada", "4 ramitas de menta fresca"], "method": ["Para los crêpes, bata la harina, el azúcar, la sal, los huevos y un tercio de la leche en un tazón hasta obtener una masa homogénea.", "Poco a poco agregue el resto de la leche y toda la crema. Deje reposar en un lugar cálido durante aproximadamente una hora.", "Justo antes de cocinar, agregue el agua de la flor de naranja.", "Cepille una pequeña sartén de 18cm-20cm / 7in-8in con un poco de mantequilla clarificada y coloque a fuego medio. Agregue un cucharón de la mezcla e incline la bandeja para cubrir la base finamente; cocine la crepe por un minuto por cada lado.", "Transfiera el crêpe a un plato y repita, apilando las creppes entre hojas de papel a prueba de grasa, hasta que toda la pasta se haya agotado.", "Para la salsa de mantequilla de naranja, cuele el jugo de naranja a través de un colador en una cacerola y agregue el azúcar glas.", "Poco a poco llevar la mezcla a ebullición y cocinar hasta que el volumen de líquido se haya reducido a la mitad.", "Apague el fuego y bata la mantequilla, poco a poco.", "Para servir, esparza los segmentos de naranja sobre cada crêpe y enrolle. Cuchara sobre la salsa de naranja y decorar con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_crepes_with_orange_97791", "title": "Crêpes con salsa de mantequilla de naranja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crepes_with_orange_97791_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina común 110g / 4oz", "pizca de sal", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas", "300 ml / ½ litro de leche", "1 cucharada de aceite vegetal", "Frambuesas 55g / 2oz", "Crema doble de 150 ml / 1/4 de pinta batida"], "method": ["Tamiza la harina y la sal en un tazón grande. Haz un pozo en medio de la harina.", "Agregue el huevo, la yema de huevo y la leche al pozo en la harina y bata hasta que la mezcla esté suave. Déjalo reposar por unos minutos.", "Caliente una plancha plana o una sartén y frote con aceite vegetal. Vierta un cucharón de masa en la sartén y revuelva para cubrir la base. Cocine durante 1-2 minutos, luego voltee y cocine en el otro lado durante un minuto.", "Coloque el panqueque en un plato y repita con el resto del batido.", "Para servir, dobla cada panqueque en cuatro. Coloque sobre los platos y sirva con frambuesas y crema batida."], "url": "www_bbc_co_uk_food_recipes_crepeswithraspberrie_88005", "title": "Crêpes con frambuesas y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina común 110g / 4oz", "pizca de sal", "2 huevos de gallinas camperas, golpeados", "Leche 200ml / 7floz", "75ml / 3floz de agua", "2 cucharadas de mantequilla, derretida", "1 cucharada de aceite vegetal, para freír", "1 cucharada de mermelada de fresa", "2 cucharadas de crema doble, batida", "azúcar en polvo, para quitar el polvo"], "method": ["Tamiza la harina y la sal en un tazón grande y haz un pozo en el medio de la harina. Vierte los huevos en el pozo y bate suavemente.", "Poco a poco agregue la leche y el agua hasta que tenga una mezcla suave.", "Agregue la mantequilla derretida y deje reposar durante unos minutos, o media hora si el tiempo lo permite.", "Agregue el aceite vegetal a una sartén o una sartén antiadherente, limpie el exceso con papel de cocina y agregue un cucharón de masa a la sartén.", "Agite la mezcla alrededor de la sartén hasta que haya una capa pareja que cubra la base de la sartén. Freír durante dos minutos, dar vuelta y freír durante dos minutos más en el otro lado.", "Retire la crepé de la sartén y repita con el resto de la mezcla.", "Coloque los crêpes en un plato, unte con mermelada, cubra con la crema batida y doble en triángulos.", "Servir inmediatamente, espolvoreado con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_crepeswithstrawberri_87013", "title": "Crêpes con fresas y nata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos grandes de gallinas camperas", "Harina de levante 225g / 8oz", "225 g / 8 oz de azúcar en polvo", "225 g / 8 oz de mantequilla o pasta para hornear, ablandada y picada, más extra para engrasar", "1 limón sin cebar, ralladura fina solamente", "1 cucharadita de polvo de hornear de nivel", "500g / 1lb 2oz de fresas, cascadas (dejando 3 enteros)", "Crema doble 450ml / 16fl oz, batida", "6 cucharadas de cuajada de limón"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Coloque dos latas tipo sándwich de 20 cm / 8 pulg. Con discos de papel para hornear antiadherente y engrase bien.", "Ponga los huevos, la harina, el azúcar, la mantequilla, la ralladura de limón y el polvo de hornear en un tazón y bata hasta que estén suaves y combinados. Divida entre las latas y nivele la parte superior.", "Hornee por unos 25 minutos, o hasta que el pastel esté bien levantado, dorado y encogiéndose lejos de los lados de las latas. Dejar enfriar durante 15 minutos en las latas. Retire de la lata en una rejilla de enfriamiento de alambre y deje que se enfríe por completo.", "Cortar las tres o cuatro fresas enteras por la mitad a través del tallo y reservar para decorar. Corta las fresas restantes.", "Rebana cada pastel por la mitad horizontalmente y siéntate una rebanada en un soporte para pasteles. Unte con un cuarto de crema batida, luego 2 cucharadas de cuajada de limón y luego un tercio de las fresas en rodajas.", "Continúa colocando el pastel en capas. Termine con una cucharada grande de crema en el centro de la rebanada superior, luego decore con las fresas reservadas con tapa verde. Cortar en trozos para servir."], "url": "www_bbc_co_uk_food_recipes_cricket_cake_with_30136", "title": "Pastel de Cricket con fresas y crema de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cricket_cake_with_30136_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de girasol, para freír", "2 lonchas de tocino ahumado, cortadas en trozos pequeños", "1 cebolla pequeña, finamente cortada", "500g / 1lb 2 oz patatas harinosas, ralladas gruesas", "2 huevos de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Caliente 1 cucharada de aceite en una sartén con tapa de 20 cm / 8 pulgadas, agregue el tocino y fría a fuego alto hasta que estén crujientes. Retire el tocino y reserve. Agregue la cebolla a la sartén y fría por 1 minuto. Cubra, baje el fuego y cocine durante 15 minutos, hasta que esté suave y tierno.", "Coloque las papas dentro de una toalla de té limpia y exprima la mayor cantidad de agua posible apretando la toalla, esto evita que el rosti se moje. Coloque la papa en un bol, agregue la cebolla y el tocino. Sazonar con sal y pimienta y mezclar bien.", "Regrese la sartén al fuego y agregue 1 cucharada de aceite. Cuando el aceite esté caliente agregue la mezcla de papa. Usando el reverso de una cuchara, presione la mezcla en la sartén para que haya una capa pareja que cubra toda la sartén.", "Cocine a fuego lento durante 5-10 minutos, luego voltee con cuidado. La manera más fácil es ponerlo boca abajo en un plato y luego deslizarlo de nuevo en la sartén (es posible que deba agregar un poco más de aceite en la sartén primero). Cocine el otro lado durante 5-10 minutos, hasta que esté dorado y crujiente.", "Caliente el aceite en una sartén y fríe los huevos hasta que estén cocidos a su gusto.", "Corte los rosti en trozos y divídalos entre platos, cubra con los huevos y sirva."], "url": "www_bbc_co_uk_food_recipes_crisp_bacon_rosti_with_84695", "title": "Crujiente tocino rosti con huevos fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisp_bacon_rosti_with_84695_16x9.jpg", "isVegetarian": false, "recommendations": 0}]