[{"isVegetarian": true, "title": "Sweet potato steamed pudding", "url": "www_bbc_co_uk_food_recipes_sweetpotatosteamedpu_71406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter, for greasing", "110g/4oz self-raising flour", "110g/4oz caster sugar", "110g/4oz unsalted butter", "2 eggs", "½ sweet potato, diced and boiled until soft", "2.5cm/1 inch piece of ginger, peeled and finely chopped", "110g/4oz caster sugar", "5cm/2 inch piece of ginger, peeled and finely chopped", "1 orange, peeled and segmented, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a small pudding basin with butter.", "Place the flour, sugar, butter, eggs and sweet potato into a food processor. Blitz together until smooth and combined.", "Pour the mixture into the bowl and cover with cling film.", "Place in the microwave and cook on HIGH for four minutes.", "To make the ginger syrup, gently heat the sugar in a heavy-based pan and cook over a low heat until dissolved and a caramel has formed. Add the chopped ginger, shaking the pan until it is well coated in the caramel.", "Turn out the sponge pudding onto a serving dish and drizzle the ginger syrup over. ", "Garnish with the segmented orange and serve."]}, {"isVegetarian": true, "title": "Sweet potato tagine with lemon couscous", "url": "www_bbc_co_uk_food_recipes_sweetpotatotaginewit_89764", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, thickly sliced", "2 garlic cloves, finely chopped", "1 tsp ras-el-hanout", "½ tsp ground cinnamon", "½ tsp ground ginger", "½ tsp smoked sweet paprika", "½ tsp ground cumin", "¼ tsp freshly ground black pepper", "1kg/2lb 4oz sweet potatoes, peeled and cut into large chunks", "1 x 400g/14oz can chopped tomatoes", "2 tbsp honey", "½ tsp saffron", "200ml/7fl oz water", "40g/1½oz preserved lemons, finely chopped", "125g/4½oz dried apricots, halved", "110g/4oz green olives, stones removed", "40g/1½oz whole almonds", "1 small bunch coriander", "200g/7oz couscous", "2 tbsp extra virgin olive oil", "10g/½oz preserved lemons, rinsed, drained, pulp removed, flesh finely chopped", "½ lemon, juice only", "2 tbsp chopped fresh coriander leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tagine, heat a large, deep frying pan with a lid until hot. Add the olive oil, onions and garlic and cook for 2-3 minutes.", "Add all of the spices and fry for one minute.", "Add the sweet potatoes and stir well.", "Add all the remaining ingredients, except the coriander, stir well and bring the mixture to a simmer.", "Chop the coriander stalks, reserving the leaves for later, and add the stalks to the pan. Reduce the heat, cover with a lid, and simmer for 15-20 minutes, or until the sweet potato is just tender. ", "For the couscous, place the couscous into a heatproof bowl and pour over enough boiling water to cover the couscous by 1.5cm/½in. ", "Add the olive oil, preserved lemon and lemon juice and a pinch of salt. Stir well, then cover with cling film and set aside for 3-5 minutes, or until all the liquid has been absorbed.", "Remove the cling film and fluff the couscous up with a fork. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon some couscous onto each plate. Spoon the tagine onto the couscous and sprinkle over the reserved coriander leaves."]}, {"isVegetarian": true, "title": "Sweet potato wedges with cheese fondue", "url": "www_bbc_co_uk_food_recipes_sweetpotatowedgeswit_79688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sweet potato, peeled and cut into thick wedges", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp fresh chives, chopped ", "150g/5½oz St Agur blue cheese", "100ml/3½fl oz double cream", "50ml/2fl oz white wine", "1 tbsp fresh chives, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the wedges, place the sweet potato wedges into a saucepan of boiling water and blanch for two minutes. Drain and pat dry with kitchen towels.", "Place the sweet potato wedges on a baking sheet, drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper.", "Place in the oven and bake for ten minutes, or until cooked through.", "Remove from the oven, transfer to a warm bowl and sprinkle with chives.", "To make the fondue, place the cheese, cream and wine into a small saucepan over a medium heat. Once the cheese has melted, add the chopped chives and stir well. ", "Pour the sauce into a warm bowl and serve beside the sweet potato wedges for dipping."]}, {"isVegetarian": true, "title": "Sweet potato wedges", "url": "www_bbc_co_uk_food_recipes_sweetpotatowedges_83345", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetpotatowedges_83345_16x9.jpg", "ingredients": ["2 sweet potato, cut into wedges", "4 tbsp olive oil", "1 tbsp thyme leaves", "salt and freshly ground black pepper", "chervil, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Toss the wedges with the oil and thyme then season well with salt and freshly ground black pepper.", "Roast in the oven for 15-20 minutes, until lightly browned.", "Serve in a warm bowl and garnish with chervil."]}, {"isVegetarian": false, "title": "Sweet potato wedges with spiced beef", "url": "www_bbc_co_uk_food_recipes_sweetpotatowedgeswit_80802", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ sweet potato, skin on, cut into wedges ", "2 tbsp olive oil ", "salt and freshly ground black pepper", "1 tbsp soy sauce ", "1 tbsp ketchup ", "1 tsp Dijon mustard", "1 tbsp olive oil ", "100g/3½oz minced beef ", "1 clove garlic, chopped", "1 tbsp chopped chives", "2 tbsp chopped coriander ", "1 tbsp soy sauce", "100g/3½oz yoghurt", "½ clove garlic, chopped ", "handful of mint, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the sweet potato wedges on a baking tray and drizzle with the oil. Season with salt and freshly ground black pepper, then place into the oven for 15 minutes. ", "Remove from the oven and brush with the soy, ketchup and mustard.", "Make the spiced beef. In a hot non-stick frying pan, heat the oil, then add the beef. Cook for 5 minutes until browned and completely cooked through.", "Add the garlic and cook for a further 2 minutes. Finish by stirring in the chives, coriander and soy. Take off the heat.", "Make the yoghurt dip. In a bowl mix the yoghurt with the garlic and mint, then season with salt and freshly ground black pepper.", "To serve, place the sweet potato wedges on the plate and top with the spiced beef and a dollop of the yoghurt dip."]}, {"isVegetarian": false, "title": "Sweet potato and chicken stew with coriander and lime paste", "url": "www_bbc_co_uk_food_recipes_sweetraguwithcoriand_87299", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 onion, chopped", "1 sweet potato, peeled and chopped", "½ skinless chicken breast, sliced into strips", "3 cardamom pods, seeds removed and crushed ", "3 bay leaves", "1 tsp paprika", "100ml/3½fl oz white wine", "100ml/3½ fl oz water", "½ chicken stock cube", "100ml/3½fl oz double cream", "4 tbsp fresh coriander leaves", "2 garlic cloves", "1 lime, juice and zest only", "2 tbsp vegetable oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stew, heat the oil in a frying pan and add the onion and sweet potato. Sauté for 2-3 minutes then add the chicken, crushed cardamom seeds, bay leaves and paprika. Then add the wine, water, stock cube and cream, stirring well. Simmer for five minutes or until the chicken is cooked through and the sauce has reduced by half. Pour into a serving bowl and put aside.", "For the coriander and lime paste, place the ingredients into a mini food processor and blend together until smooth. ", "Spoon the paste over the stew and serve."]}, {"isVegetarian": true, "title": "Sweet saffron yoghurt (shrikand)", "url": "www_bbc_co_uk_food_recipes_sweetsaffronyoghurts_86570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints whole milk yoghurt OR 500ml/17½fl oz Greek-style yoghurt (It is necessary to have a larger quantity of whole milk yoghurt than of Greek-style yoghurt because whole milk yoghurt will lose more water when drained.)", "milk, for infusing", "½ tsp saffron threads ", "6-8 tbsp icing sugar, or to taste ", "¼ tsp freshly ground green cardamom seeds, or to taste", "2 tbsp chopped unsalted pistachios", "2 tbsp flaked or sliced almonds  ", "edible silver leaf (available from Asian grocers, optional)", "pomegranate seeds"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Line a large sieve with a double layer of paper kitchen roll. Place a bowl under the sieve and pour in the yoghurt. Refrigerate for as long as possible to allow the liquid to drain off the yoghurt. This will take a minimum of 5-6 hours.", "Heat a little milk in a small pan. Place two teaspoons of the milk into a small bowl and crumble the saffron strands into it (the rest of the milk can be used in another dish). Allow the saffron to infuse the milk for about ten minutes using the back of a spoon to crush the saffron further into the milk.", "Remove the yoghurt from the fridge (the liquid in the bowl below can be discarded). Sift the sugar into the thickened yoghurt, then add the saffron milk and ground cardamom. Cover and chill in the fridge.", "To serve, divide the yoghurt among four bowls and garnish with the nuts, silver leaf (if using) and pomegranate seeds."]}, {"isVegetarian": true, "title": "Sweet shallots", "url": "www_bbc_co_uk_food_recipes_sweetshallots_4952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter and a splash of olive oil", "200-300g/7-10oz shallots", "1 tsp honey or a heaped tsp of sugar", "water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the shallots in boiling water for a couple of minutes. This makes removing the skins easier. ", "Melt the butter with the oil in a frying pan and add the peeled shallots. Fry for a minute and then sprinkle with sugar or add the honey and coat the shallots. Take care that the shallots don t start to burn.", "Season well and then pour over enough cold water to cover. Bring to the boil and cook on a medium heat until all the liquid is reduced and the shallots are softened and caramelised."]}, {"isVegetarian": false, "title": "Sweet sticky spicy ribs with red onion salad", "url": "www_bbc_co_uk_food_recipes_sweetstickyspicyribs_85067", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetstickyspicyribs_85067_16x9.jpg", "ingredients": ["1.5kg/3lb 4oz meaty rack of pork spare ribs", "water, to cover", "1 onion, chopped", "2 garlic cloves, lightly crushed", "½ tsp black peppercorns", "2 tbsp olive oil", "2 onions, roughly chopped", "4 garlic cloves, crushed", "2 red chillies, finely chopped", "½ tsp dried chilli flakes", "2 tsp fennel seeds, crushed", "110g/4oz dark brown sugar", "600g/1lb 5oz tomato ketchup", "110ml/4fl oz dark soy sauce", "2 red onions, finely sliced", "6 tomatoes, cut into chunks", "1 small bunch fresh flatleaf parsley, leaves only", "3 tbsp extra virgin olive oil", "1 tbsp red wine vinegar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To poach the ribs, place the ribs into a large, wide saucepan or stockpot over a high heat. Cover with water and add the onion, garlic and peppercorns. Bring to the boil, then reduce the heat and simmer, covered, for one hour, or until the meat is tender.", "Preheat the oven to 180C/455F/Gas 4.", "For the marinade, heat a deep-sided frying pan until hot, then add the olive oil, onions and garlic. Fry for 4-5 minutes, or until the onion has softened.", "Add the chillies, chilli flakes, fennel seeds and brown sugar and cook for a further 1-2 minutes, until the sugar has melted.", "Add the tomato ketchup and soy sauce. Bring to the boil, then reduce the heat and simmer for ten minutes, until thickened. Remove from the heat and allow to cool slightly, then transfer to a food processor and blend to a smooth paste.", "Remove the ribs from the poaching liquor and place onto a baking tray. Spoon the marinade over the ribs, turning to make sure they are completely coated. Place into the oven to roast for 15 minutes, or until sticky and heated through.", "Remove from the oven and slice the rack into individual ribs.", "For the salad, place the red onion, tomatoes and parsley leaves into a bowl.", "Place the olive oil and vinegar into a separate bowl and whisk to combine. Pour the dressing over the salad and season, to taste, with salt and freshly ground black pepper.", "To serve, place the ribs onto plates and place a portion of salad alongside."]}, {"isVegetarian": true, "title": "Swiss roll with fresh blackberries and vanilla cream", "url": "www_bbc_co_uk_food_recipes_swiss_roll_with_fresh_97574", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium free-range eggs", "110g/4oz caster sugar, plus extra for dusting", "1 vanilla pod, seeds only", "75g/2½oz self-raising flour", "200ml/7fl oz double cream", "1 tsp vanilla extract", "200g/7oz whole blackberries", "250g/9oz blackberries", "100g/3½oz caster sugar", "icing sugar, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Swiss roll sponge, preheat the oven to 190C/375F/Gas 5 and line a 23x33cm/9x13in Swiss roll tin with baking parchment.", "Place the eggs, sugar and vanilla seeds into a bowl and whisk until very light, fluffy and thickened.", "Sift the flour over the mixture and fold in.", "Pour the mixture into the lined tin and smooth it out with a spatula until evenly spread.", "Bake the sponge for 10-12 minutes, or until just firm to the touch.", "Place a sheet of baking parchment that is slightly bigger than the tray onto the work surface and dust with some caster sugar", "Flip the sponge over onto the parchment paper, then peel off the parchment on the bottom of the sponge. Set aside to cool slightly.", "Whip the double cream with the vanilla extract in a bowl until soft peaks form when the whisk is removed.", "For the blackberry compôte, place the blackberries, sugar and four tablespoons of water in a small saucepan and simmer for five minutes, then leave it to cool and thicken.", "To assemble the Swiss roll, spread the blackberry compôte over the cooled sponge, leaving a 2cm/1in gap around the edge.", "Spread the whipped cream over the top of the jam and then sprinkle over the whole blackberries.", "Take the longest edge, then using the parchment paper underneath to start it off, roll up the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the parchment, dust with extra caster sugar and cut into slices to serve."]}, {"isVegetarian": true, "title": "Swiss roll with homemade raspberry jam", "url": "www_bbc_co_uk_food_recipes_swiss_roll_with_homemade_90772", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swiss_roll_with_homemade_90772_16x9.jpg", "ingredients": ["450g/1lb fresh raspberries", "400g/14oz jam sugar", "5 free-range eggs", "125g/4½oz caster sugar, plus extra for dusting", "2 vanilla pods, split, seeds scraped out using the tip of a sharp knife", "95g/3¼oz self-raising flour, sifted", "500ml/18fl oz double cream", "75g/2½oz fresh raspberries, for the garnish", "8 tiny sprigs fresh mint or lemon verbena, for the garnish", "1 tbsp chopped pistachios, for the garnish (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the raspberry jam, heat the raspberries, sugar and 3 tablespoons water in a large, heavy-based saucepan over a low heat for 2-3 minutes, or until the sugar has dissolved. Increase the heat and cook the mixture for a further 6-8 minutes, or until it has thickened enough to coat the back of a spoon. ", "Set aside 75g/2½oz of the jam to use in the Swiss roll. Pour the remaining jam into hot, sterilised jars, seal, and set aside to cool.", "For the sponge, preheat the oven to 190C/170C Fan/Gas 5. Line a 38x25cm/15x10in Swiss roll tin with baking parchment.", "In a large bowl, whisk together the eggs, sugar and half the vanilla seeds until very light, thick and fluffy. Fold in the sifted flour using a metal spoon, trying to retain as much air as possible in the batter.", "Pour the batter into the prepared tin and smooth the surface using a spatula. Bake in the oven for 10-12 minutes, or until the sponge has risen and is just firm to the touch (it should spring back when pressed lightly with a finger). ", "Place a clean, damp tea towel that is slightly bigger than the Swiss roll tin onto a work surface and dust it with caster sugar. Turn the sponge out onto the tea towel, then carefully peel away the baking parchment. ", "With the longest edge of the sponge facing you, roll up the sponge firmly but gently in the tea towel, making the roll as tight as you can. Carefully unroll the sponge and leave to cool completely.", "To assemble the Swiss roll, whip the double cream with the remaining vanilla seeds until firm peaks form when the whisk is removed.", "Spread the raspberry jam all over inside of the cooled sponge, leaving a 2cm/1in border at the long edge that’s furthest from you. Spread most of the cream on top of the jam.", "Roll up the sponge again, starting at the long edge closest to you (as before) and using the tea towel to guide you. Aim to make the Swiss roll as tight as possible without squeezing out the filling.", "Using the tea towel, lift the Swiss roll onto a serving plate, with the seam against the plate. Dust with a little more caster sugar and garnish with raspberries and the mint or lemon verbena sprigs. If desired, decorate the top of the Swiss roll with quenelles of the remaining whipped cream, then sprinkle with the pistachios, if using."]}, {"isVegetarian": true, "title": "Swiss muesli", "url": "www_bbc_co_uk_food_recipes_swissmuesli_7252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz rolled oats", "170g/6oz raisins or sultanas", "110g/4oz dried apricots, roughly chopped", "110g /4oz hazelnuts, split in half and roasted", "350ml/12fl oz fresh apple juice", "2 apples (coxes or granny smiths) peeled and coarsely grated", "1 small tub Greek or natural yoghurt", "4 ripe apricots, roughly chopped", "clear honey to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl mix together the oats, raisins, apricots and hazelnuts. Pour over the apple juice and leave for 10-15 minutes to allow the oats and dried fruit to soak up the juice.", "Divide the muesli between 6 glass bowls and top with the grated apple. Spoon on a dollop of yoghurt and drizzle over some honey. Serve immediately."]}, {"isVegetarian": true, "title": "Swiss cheese fondue", "url": "www_bbc_co_uk_food_recipes_swisscheesefondue_8925", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swisscheesefondue_8925_16x9.jpg", "ingredients": ["1 clove garlic, halved", "290ml/½ pint white wine", "1 tsp lemon juice", "225g/8oz emmental cheese grated", "225g/8oz gruyère cheese grated", "1 tsp cornflour", "1 tbsp kirsch (optional)", "cubed bread pieces, for dipping"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the inside of the fondue pot with the halves of garlic.", "Add the wine and lemon juice to the pot and heat until boiling. Lower the heat and gradually stir in the cheeses until melted, stirring all the time.", "If using kirsch, blend with the cornflour, otherwise use water. Add to the cheese mixture and cook gently until the mixture is smooth - don't let it boil or it will burn.", "Using the fondue prongs, dip the bread cubes into the cheese and serve."]}, {"isVegetarian": true, "title": "Syllabub", "url": "www_bbc_co_uk_food_recipes_syllabub_70037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["290ml/¼ pint double cream", "55g/2oz caster sugar", " ½ lemon, finely grated zest", "3 tbsp lemon juice", "150ml/5fl oz sweet white wine or Madeira"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Warm the sugar, juices and zest gently until the sugar is dissolved and allow to cook completely.  ", "Add the wine or Madeira.", "Whip the cream to soft peaks.  Fold in the wine mixture.  ", "Pour into tall-stemmed glasses and chill well.", "Serve decorated with grapes and a small sprig of rosemary."]}, {"isVegetarian": false, "title": "Syrian-inspired brunch", "url": "www_bbc_co_uk_food_recipes_syrian-themed_brunch_15028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/syrian-themed_brunch_15028_16x9.jpg", "ingredients": ["450g/1lb dried chickpeas, soaked overnight in cold water, with 1 tsp bicarbonate of soda ", "2 large Arabic flatbreads ", "1 beef tomato, sliced", "2 pickles, sliced", "handful fresh parsley leaves, finely chopped", "½ lemon", "salt and freshly ground black pepper", "handful fresh coriander leaves ", "handful fresh parsley leaves ", "1 garlic clove", "1 tsp ground cumin", "1 tsp coriander seeds  ", "25g/1oz sesame seeds ", "1 litre/1¾ pints vegetable oil", "good pinch sumac, to garnish", "3 tbsp tahini ", "3 tbsp plain yoghurt ", "good squeeze lemon juice", "1 tbsp tahini", "1 garlic clove", "drizzle olive oil", "2 tbsp plain yoghurt ", "1 lemon, juice only", "1–2 ice cubes ", "1½ tsp vegetable oil", "50g/1¾oz lamb mince", "good pinch sumac, to garnish", "handful fresh parsley leaves, to garnish ", "400g tin fava beans/broad beans, drained ", "handful fresh parsley leaves ", "1 beef tomato, roughly chopped", "squeeze lemon juice ", "2 tbsp pomegranate molasses ", "good pinch ground cumin", "2–3 spring onions, thinly sliced", "2 pitta breads", "good pinch sumac, to garnish", "drizzle olive oil, to garnish"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Drain the chickpeas and tip two-thirds of them into a saucepan, reserving the last third for the falafels. Cover with water and bring to the boil. Reduce the heat and simmer for 45–50 minutes, or until tender. Alternatively, cook in a pressure cooker for 20 minutes. Drain, reserving the cooking liquid. ", "Meanwhile, to make the falafels, put the reserved uncooked chickpeas in a food processor and blend with the fresh coriander, parsley, garlic, spices and sesame seeds. Add a little warm water if the mixture is too thick. Season to taste. Shape into 20 falafels. ", "To make the falafel sauce, mix the tahini with the yoghurt and lemon juice and season to taste. ", "To make the hummus, put half the cooked chickpeas in a food processor. Add the tahini, garlic, olive oil, yoghurt, lemon juice and some seasoning. Add the ice cubes and blend again, until you have a smooth hummus. Heat the vegetable oil in a small saucepan over a medium heat. Fry the lamb mince until golden brown, breaking it up as it cooks. ", "Spoon half the hummus into a dish and top with the cooked lamb. Garnish with the sumac and parsley. Keep the remaining hummus for the fatteh.", "To make the chickpea salad, mix half the remaining cooked chickpeas with the beans. Add the remaining ingredients and season to taste. ", "To make the fatteh, preheat the grill to high and toast the pitta breads. Leave to cool, then cut into cubes. Drizzle with a little chickpea cooking liquid. Spoon the remaining hummus into a small bowl and mix with a little chickpea cooking liquid – it should be a little thicker than double cream. Place the lightly soaked pittas on a serving dish. Cover with the last of the cooked chickpeas. Garnish with the sumac and olive oil. ", "Heat a deep saucepan of vegetable oil to 160°C, or until a cube of bread browns in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the falafel in batches for 5 minutes, or until golden brown. Drain on kitchen paper and sprinkle with sumac.", "Split the flatbreads in half so you have four large circles. Spoon falafel sauce along the middle, top each with five falafel, a quarter of the beef tomato and pickles, some parsley and a squeeze of lemon. Wrap. Repeat for the remaining wraps. ", "Place a griddle over a high heat and, when hot, cook the wraps until hot and charred. ", "Serve the flatbread wraps with the fatteh, chickpea salad and hummus. Serve with the chickpea salad, fatteh and hummus. "]}, {"isVegetarian": true, "title": "Syrup sponge", "url": "www_bbc_co_uk_food_recipes_syrupsponge_88975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz butter, plus extra for greasing ", "4 tbsp golden syrup", "100g/4oz caster sugar ", "½ lemon, juice and zest only", "2 medium free-range eggs ", "225g/8oz self raising flour, sifted ", "2 tbsp milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1 litre/2 pint pudding basin with butter. Pour the golden syrup into the basin.", "In a mixing bowl, cream together the butter and sugar until light and fluffy (a handheld electric whisk works best). Stir in the lemon zest. ", "Beat in the eggs, one at a time, alternating each egg with a tablespoon of flour. Fold in the remaining flour, lemon juice and milk and pour into the basin, covering the syrup. ", "Cut out a circle of greaseproof paper one and a half times as large as the diameter of the pudding basin. Fold a pleat along the middle of the greasproof paper and place over the top of the pudding basin. Tie securely with a piece of string and tie a separate loop of string across the top to form a handle. Trim off any excess greaseproof paper.", "Place an upturned saucer into the base of a large lidded saucepan. Sit the basin on the upturned saucer and carefully fill the pan with boiling water until it comes two-thirds of the way up the sides of the pudding basin. Make sure the water doesn't come into contact with the greaseproof paper, which could make the pudding soggy.", "Place the lid on the pan, place over a low-medium heat and bring the water to a gentle simmer. Steam for one-and-a-half hours, checking the water level from time to time and topping up with more boiling water if necessary. (Do not lift the lid for the first 30 minutes of cooking or the sponge may collapse.)", "Carefully lift the pudding basin out of the pan using the string handle. Remove the greaseproof paper, gently run a knife around the edge of the pudding basin and turn the syrup sponge out onto a serving plate. Serve at once."]}, {"isVegetarian": false, "title": "Sichuan beef with pickled cucumber salad", "url": "www_bbc_co_uk_food_recipes_szechwanbeefwithpick_85438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucumbers, peeled, seeds removed, cut into 5cm/2in long batons", "large pinch salt", "100ml/3½oz groundnut oil", "1 tsp chilli oil", "1 garlic clove, crushed", "Small red chilli, seeds removed, chopped", "25g/1oz sugar", "1 tsp Sichuan peppercorns, roasted in a dry frying pan, crushed", "0.5cm/quarter in piece fresh ginger, peeled, cut into matchsticks", "30ml/1fl oz rice wine vinegar", "2 spring onions, finely chopped ", "220g/7½oz bamboo shoots from a can, rinsed and drained", "100g/3½oz mangetout, finely sliced ", "2 tbsp bean sprouts", "1 tbsp Sichuan peppercorns, roasted in a dry frying pan, crushed ", "4 x 200g/7oz beef fillet steaks", "1 tbsp vegetable oil", "1 tbsp sesame seeds", "fresh coriander leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the cucumber batons into a colander and sprinkle with salt, tossing to cover evenly. Leave to drain for 20-25 minutes, to remove excess moisture, then rinse in cold water and pat dry.", "In a small saucepan warm the groundnut oil and chilli oil. Add the garlic and chilli and warm for a minute.", "Add the sugar, Sichuan peppercorns, ginger and rice wine vinegar, bring to the boil and simmer for five minutes.", "Add the cucumber and spring onions, increase the heat to high and boil for 10-15 seconds. Remove the pan from the heat and set aside to go completely cold.", "When the liquid is cold, add the bamboo shoots, mangetout and bean sprouts. ", "For the steak, season the steaks with salt. Brush the steaks with vegetable oil and then dip into the peppercorns to coat.", "Fry the steaks in a very hot frying pan for 3-4 minutes on each side, or until cooked to your liking.", "Remove the steak from the pan and sprinkle with sesame seeds. Allow to rest for five minutes, then cut into slices.", "To serve, place spoonfuls of the salad onto plates and top with slices of beef. Garnish with fresh coriander leaves."]}, {"isVegetarian": true, "title": "Syrup sponge in the microwave", "url": "www_bbc_co_uk_food_recipes_syrupspongewithprope_4983", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/syrupspongewithprope_4983_16x9.jpg", "ingredients": ["125g/4oz butter, melted, plus extra to grease the pudding bowl", "125g/4oz caster sugar", "2 eggs", "150g/5oz plain flour", "1 tsp baking powder", "2 small lemons, zest and juice", "1-2 tbsp milk", "4 tbsp golden syrup, or jam if preferred, to serve", "custard, optional, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1.2 litre/2 pint bowl (suitable for the microwave). Sieve together the flour and baking powder. Tip the butter, sugar, eggs, flour and baking powder into a food processor and mix to a paste. If you're not using a food processor beat the sugar and butter together in a bowl, then mix in the eggs, baking powder and flour.", "Add the lemon juice and zest, continue to mix and add enough milk for the mixture reach a dropping consistency. (Hold a spoonful of the mixture upside down and it should drop off after a slight pause.)", "Spoon the mixture into the greased bowl. Cover with cling film and microwave on full power for four minutes (or until the sponge begins to shrink from the sides and is springy to the touch).", "Leave to stand for 2-3 minutes before turning out and serving with golden syrup or jam and custard."]}, {"isVegetarian": false, "title": "T-bone steak with bearnaise sauce and a green salad", "url": "www_bbc_co_uk_food_recipes_t-bone_steak_with_38432", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp French dressing", "2 tbsp honey", "2 tbsp white balsamic vinegar", "500ml/18fl oz vegetable oil", "5g finely chopped shallot", "½ garlic clove, sliced", "1 tsp chopped fresh basil", "1 tsp chopped fresh thyme leaves", "1 tsp chopped chives", "1 tsp chopped fresh parsley leaves", "1 tsp fresh yeast", "400ml/14fl oz beer", "200g/7oz plain flour", "vegetable oil, for deep-frying", "2 small onions, finely sliced into rings", "2 x T-bone steaks", "4 tbsp rapeseed oil", "3 tbsp tarragon vinegar", "3 tbsp white wine", "¼ tsp white peppercorns", "½ small banana shallot, finely chopped", "125g/4½oz butter", "2 free-range egg yolks", "½ lemon, juice only", "1 tbsp chopped tarragon leaves ", "sea salt and freshly ground black pepper", "25g/1oz baby spinach leaves", "1 Little Gem lettuce", "½ head broccoli, florets finely sliced", "100g/3½oz French green beans, cooked"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place all the dressing ingredients in a food processor and blend until smooth. Set aside.", "For the deep-fried onion rings, whisk the yeast and beer together in a large bowl. Add the flour and whisk to a smooth batter. Set aside for 5 minutes. ", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Dip the onion rings in the batter then lower them carefully into the hot oil (you may need to do this in batches). When the onion rings are golden-brown, remove them from the oil using a slotted spoon and season with salt and pepper. Drain on kitchen roll and keep warm in a low oven until ready to serve.", "For the T-bone steak, heat a large frying pan and add the oil. Once hot, add the steak. Cook on each side for 2-3 minutes, depending on how you like your steak cooked. Set aside to rest in a warm place.", "For the béarnaise sauce, put the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Simmer until the volume of liquid has reduced to about one tablespoon. Strain the liquid into a bowl and then set aside to cool. ", "Meanwhile, melt 100g/3½oz of the butter in a small saucepan set over a medium heat. ", "Put the egg yolks in a bowl set over a pan of simmering water and whisk until thickened and light in colour. Gradually add the melted butter, whisking constantly. Season with salt and black pepper. Add the cooled shallot reduction, lemon juice and the chopped tarragon leaves and mix well. Turn off the heat and leave the bowl over the pan until ready to use.", "To serve, place the green salad ingredients in a bowl. Add the dressing and toss to coat. ", "Season the steak with salt and pepper. Cut the steak into slices and place on serving plates alongside the salad and a pile of onion rings. Put the sauce into a jug ready to serve at the table."]}, {"isVegetarian": true, "title": "Tabbouleh", "url": "www_bbc_co_uk_food_recipes_tabbouleh_91782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tabbouleh_91782_16x9.jpg", "ingredients": ["25g/1oz bulgur wheat", "2 large, ripe vine tomatoes", "large bunch fresh flatleaf parsley, leaves only, washed, dried, finely chopped ", "small bunch fresh mint leaves, washed, dried, finely chopped", "1 small red onion, peeled, finely chopped", "2-3 tbsp freshly squeezed lemon juice", "2-3 tbsp extra virgin olive oil", "sea salt flakes", "4 ready-made flatbreads, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bulgur wheat into a small bowl and cover with 50ml/2fl oz of boiling water. Stir, then set aside for 20 minutes, or until the bulgur wheat has absorbed all of the water. ", "Cut out the green stalks from the tomatoes and make a small cross at each of the bases. Place the tomatoes into a separate bowl and cover with boiling water. Set aside for 30 seconds, then drain away the water. ", "When the tomatoes are cool enough to handle, peel and discard the skins. Cut the tomatoes into quarters, discard the seeds and dice the flesh. Transfer the diced tomatoes to a serving bowl. ", "Add the parsley, mint and onion to the tomatoes and mix well until combined. ", "When the bulgur wheat has absorbed all of the water, fluff it using a fork until the grains are separated. Add the bulgur wheat to the tomato mixture.", "Drizzle over the lemon juice and olive oil and season, to taste, with salt. Mix well to coat the ingredients in the liquid. ", "To serve, divide the tabbouleh equally among four serving plates. Place one grilled flatbread alongside each."]}, {"isVegetarian": true, "title": "Tagliarini with artichoke and truffles", "url": "www_bbc_co_uk_food_recipes_tagliarini_with_18980", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small globe artichokes", "2 tbsp olive oil", "1 garlic clove, finely sliced ", "1 tbsp chopped parsley", "2 tbsp double cream", "salt and pepper", "250g/9oz fresh tagliarini pasta", "75g/2½oz parmesan (or a similar vegetarian cheese), grated", "50g/1¾oz fresh black truffle"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the outer leaves of the artichokes and cut the top off. Using a sharp knife, trim off any green, tough parts so you are left with the tender leaves and stem. Slice the artichokes in half and cut into fine slices. ", "Heat the olive oil in a frying pan and gently cook the artichoke and garlic for two minutes. Add four tablespoons of water, cover with a lid and cook for four minutes, or until the artichokes are tender. ", "When the artichokes are cooked, add the parsley and cream and season with salt and pepper. ", "In a pan of boiling salted water, cook the tagliarini for about three minutes or until al dente. Using a pair of tongs, transfer the tagliarini to the frying pan containing the artichokes. Add a couple of tablespoons of pasta water and half of the grated parmesan to the frying pan. Toss well and grate a little truffle into the pasta. Check the seasoning and add salt and pepper as required. Toss again so the truffle is absorbed into the sauce. ", "Serve in hot bowls with more truffle slices and the remaining parmesan on top."]}, {"isVegetarian": false, "title": "Tagliarini with red mullet, tomatoes, olives and pangrattato", "url": "www_bbc_co_uk_food_recipes_tagliarini_with_red_87558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower oil, for deep-frying", "100g/3½oz stale bread, roughly chopped into coarse crumbs", "5 tbsp extra virgin olive oil", "1 garlic clove, thinly sliced", "8 taggiasca or small niçoise olives, pitted", "10 datterini tomatoes, cut into quarters", "200g/7oz fresh tagliarini ", "2 red mullet fillets", "1 tsp finely chopped flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sunflower oil in a deep-fat fryer to 160C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the breadcrumbs for 1 minute until golden-brown. Drain on kitchen paper and sprinkle with salt. Set aside.", "Heat 3 tablespoons of the olive oil in a frying pan on a medium heat. Add the garlic, black olives and tomatoes and cook for 3–4 minutes or until the tomatoes break down. ", "Cook the tagliarini in a large pan of salted water according to the packet instructions. ", "Meanwhile, add the red mullet fillets to the tomatoes and continue to cook for 5 minutes. Stir in the parsley and season with salt and pepper. Remove from the heat and set aside. ", "When the pasta is just al dente, remove from the water using tongs and add to the tomatoes.", "Return the pan to a low heat and add a spoonful of the pasta water and the remaining olive oil. Toss the pasta with the other ingredients in the pan, breaking up the fish fillets. ", "Transfer to serving bowls and scatter over the pangrattato. "]}, {"isVegetarian": false, "title": "Tagliarini with prosciutto, peas, spring onions and parmesan", "url": "www_bbc_co_uk_food_recipes_tagliariniwithprosci_86297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Italian '00' flour", "1 free-range egg", "6 free-range egg yolks", "50g/2oz fine semolina flour", "50g/2oz butter", "6 spring onions, sliced thinly", "200g/7oz fresh peas, podded", "splash water", "75g/3oz prosciutto, sliced roughly", "50g/2oz parmesan, grated finely", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pasta, place the flour, egg and egg yolks into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough into a bowl, cover with cling film and place into the fridge to rest for 30 minutes.", "Cut the pasta dough in half and feed one of the pieces through a pasta machine according to the machine instructions, ending on the thinnest setting.", "Add the tagliarini cutter to the pasta machine and pass the pasta through the machine to make thin strips.", "Repeat the process with the remaining dough, then dust the pasta with semolina flour, place onto a plate and refrigerate overnight.", "When you're ready to cook the pasta, bring a large pan of salted water to the boil, add the tagliarini and cook for 2-3 minutes until tender.", "For the sauce, heat the butter in a frying pan, add the spring onions and fry for one minute.", "Add the peas and a splash of water and simmer for one minute, then add the prosciutto and cook for a further minute.", "Drain the pasta and add to the pan with the sauce. Add the parmesan, season, to taste, with salt and freshly ground black pepper and stir. Serve immediately."]}, {"isVegetarian": false, "title": "Tagliatelle with mushrooms and pancetta", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_23536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5g/¼oz dried porcini mushrooms", "2 tbsp olive oil, plus extra for drizzling", "70g/2½oz pancetta lardons", "¼ red chilli, thinly sliced", "1 large garlic clove, thinly sliced", "200g/7oz tagliatelle pasta", "¼ beef tomato, deseeded and finely chopped", "150g/5½oz mixed wild mushrooms", "1 handful flatleaf parsley, roughly chopped", "50g/1¾oz unsalted butter", "50g/1¾oz Parmesan, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cover the porcini mushrooms in cold water and leave to soak for 10 minutes. ", "Heat 2 tablespoons of olive oil in a large sauté pan, add the pancetta and cook for 5–7 minutes, or until crisp. Add the chilli and garlic and cook for a further 2–3 minutes.", "Cook the tagliatelle in a large saucepan of boiling salted water, according to the packet instructions, or until al dente. ", "Meanwhile, drain the porcini mushrooms, reserving the soaking liquor, and add the porcini to the sauté pan. Strain the soaking liquor into the pan and allow to bubble until reduced by half. Add the tomato and wild mushrooms and cook for 2 minutes. Scatter over the parsley. ", "Drain the tagliatelle and add to the sauce. Stir in the butter and cheese until the sauce emulsifies. ", "Divide between four bowls, drizzle with olive oil and serve."]}, {"isVegetarian": false, "title": "Tagliatelle with olives, anchovies and pangrattato", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_olives_33298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz tagliatelle pasta", "2 tbsp olive oil", "2 anchovy fillets", "¼ red chilli, finely chopped", "1 large garlic clove, thinly sliced", "70g/2½oz green or black pitted olives", "¼ beef tomato, deseeded and finely chopped", "50g/1¾oz unsalted butter", "150g/5½oz panko breadcrumbs", "½ lemon, zest only", "handful flatleaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the tagliatelle in a large saucepan of boiling salted water, according to the packet instructions, or until al dente. ", "Meanwhile, to make the pangrattato, melt the butter in a frying pan over a medium heat. Add the breadcrumbs and toast for a few minutes until crunchy and golden. Stir in the lemon zest and parsley.", "Heat the oil in a medium sauté pan. Add the anchovies, chilli and garlic and cook for 1 minute. Stir through the olives and tomatoes. ", "Drain the tagliatelle and add to the sauce. ", "Divide between four bowls, scatter over the pangraatto and serve. "]}, {"isVegetarian": false, "title": "Tagliatelle with mussels", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_mussels_64767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz Italian ‘00’ flour, plus extra for flouring", "50g/2oz semolina, plus extra for dusting", "2 free-range eggs", "6 tbsp extra virgin olive oil", "1 anchovy fillet, finely chopped", "1 tbsp capers, finely chopped", "3 garlic cloves, finely chopped", "1 x 400g/14oz tin plum tomatoes, chopped", "½ tsp dried oregano", "¼ red chilli, finely chopped", "800g/1lb 12oz mussels, cleaned and de-bearded (discard any mussels that do not close tightly when tapped)", "handful fresh parsley, finely chopped", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, mix the flour and semolina together on a clean work surface or in a large bowl.", "Make a well in the centre and break in the eggs.", "With a fork or with your hands, gradually mix the flour with the eggs to form a soft dough. Knead the dough for five minutes, or until smooth.", "Shape the dough into a ball, wrap in cling film and leave to chill in the fridge for at least 30 minutes.", "Flour the pasta machine with semolina and divide the pasta into four equal pieces. Starting at the lowest (thickest) setting, feed one piece of the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Repeat with the other pieces of dough.", "Once the pasta sheets have reached the ideal thickness, cut into long strips and dust with semolina", "For the sauce, heat the olive oil in a large lidded frying pan and fry the anchovy, capers and garlic for 2-3 minutes.", "Add the chopped tomatoes, oregano, chilli and mussels. Stir well, partially cover with the lid and cook on a medium heat for 4-6 minutes, or until most of the mussels have opened (discard any mussels that have not opened during cooking).", "Remove most of the mussels from their shells and discard the shells, keeping some aside to garnish. Return the shelled mussels to the sauce.", "Meanwhile, cook the pasta in a large pan of boiling water for 2-3 minutes, or until al dente.", "Drain the pasta, reserving a little of the pasta water. Tip the pasta into the tomato sauce and stir until well combined. If necessary, loosen the sauce with a little reserved pasta water.", "To serve, spoon the pasta into pasta bowls, sprinkle over the parsley and the un-shelled mussels."]}, {"isVegetarian": false, "title": "Tagliatelle with squid and bottarga", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_squid_09531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Italian '00' flour", "7 free-range eggs - 1 whole, 6 yolks only", "50g/2oz fine semolina flour", "2 courgettes, finely sliced using a mandolin, and cut to the same size as the tagliatelle", "200g/7oz fresh tagliatelle (made above)", "2 tbsp olive oil", "8 datterini tomatoes, or other small tomatoes, peeled", "1 garlic clove, finely chopped", "200g/7oz fresh squid, cleaned, scored, sliced as thick as the tagliatelle", "1 tsp chopped parsley", "1 pinch dried chilli", "salt and freshly ground black pepper", "20g/¾oz bottarga, shaved"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour, egg and egg yolks into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough into a bowl, cover with cling film and place into the fridge to rest for 30 minutes.", "Cut the pasta dough in half and feed one of the pieces through a pasta machine according to the machine instructions, ending on the thinnest setting.", "Add the tagliatelle cutter to the pasta machine and pass the pasta through the machine to make thin strips.", "Repeat the process with the remaining dough, then dust the pasta with semolina flour, place onto a plate and refrigerate overnight or use immediately.", "For the sauce, bring a large saucepan of salted water to the boil, add the tagliatelle and sliced courgettes and return to the boil for two minutes.", "Heat a frying pan until medium hot, add the olive oil, tomatoes, garlic, squid and parsley cook gently for two minutes.", "Add the pasta and courgettes to the frying pan and stir together.", "Season with chilli, salt and freshly ground black pepper and scatter the bottarga on top."]}, {"isVegetarian": false, "title": "Tagliatelle with sweet-and-sour sardines (Tagliatelle alle sarde in saor)", "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_42197", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz olive oil", "1 fresh bay leaf", "1 sprig fresh rosemary", "2 juniper berries", "3 whole black peppercorns", "2 garlic cloves", "8 white onions, peeled, thinly sliced", "salt and freshly ground black pepper", "10 medium-sized sardines, scales removed, gutted, filleted, heads removed", "2-3 tbsp flour", "vegetable oil, for deep-frying", "5 tbsp white wine vinegar", "2 tbsp sultanas, soaked in water for 30 minutes", "300-400g/10½-14oz fresh pasta dough"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["For the sauce, heat the oil, bay leaf, rosemary, juniper berries, peppercorns and garlic in a deep, heavy-based, non-reactive saucepan over a very gentle heat. As the oil heats, increase the heat a little to allow the flavours to infuse the oil. ", "When the herbs start to sizzle, add the onion and season, to taste, with salt and freshly ground black pepper. Cook very gently without frying fiercely or letting the onions brown, for 15-20 minutes, or until the onion slices have softened and are covered by the oil.", "Meanwhile, season the sardine fillets with salt and freshly ground black pepper. Sprinkle the flour onto a plate and dredge each sardine fillet in the flour until they are all coated on both sides.", "Heat the vegetable oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep-fat fryer.", "Gently lower the sardines into the hot oil in batches and fry for one minute. The sardines shouldn’t colour or cook through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining batches of sardines.", "Increase the heat of the pan containing the onions and gradually add the vinegar to the pan in a thin stream. Remove the pan from the heat. Drain the sultanas then stir them into the onion mixture.", "Spoon half of the warm onion mixture in a thin layer at the bottom of a deep ovenproof dish. Arrange the half-cooked sardines in a single layer on top, then cover with the remaining onion mixture. Cover the dish with cling film and set aside to cool and marinate. This should take 2-3 hours (the marinade will cook the fish). If marinating the sardines overnight, put them in the fridge and remove half an hour to bring them back to room temperature before continuing.", "Meanwhile, for the pasta, take the chilled pasta dough and cut into pieces if necessary (to make it more manageable). Flatten each piece of pasta, then roll to a thickness of about 0.5cm/¼in using a rolling pin. ", "Pass one piece of pasta dough through a pasta machine set to its widest setting. Fold each edge of the rolled pasta dough over the middle section of the dough (so that it ends up one-third of its original width and three times its original height) and re-roll through the same setting. ", "Repeat this process without changing the setting of the pasta machine until the pasta is shiny and rectangular in shape. Then repeat the process with the remaining piece(s) of pasta dough.", "Decrease the roller setting of the pasta machine by one grade and pass the piece(s) of pasta dough through the rollers once more. Each time you pass the pasta through the rollers, decrease the setting by one grade until you reach the penultimate or final setting and the pasta dough is smooth and supple. ", "Using a sharp knife, cut away any ragged edges from the pasta sheets, to create several sheets that are 20cm/8in in length. ", "If your pasta machine has a tagliatelle cutter, feed the pasta sheets through the machine one at a time, draping the strands of tagliatelle over a pasta drier or similar until needed. Repeat the process using the remaining pasta strips. Alternatively, cut the tagliatelle by hand using a sharp knife.", "When the sardines have marinated, boil a large pan of salted water in preparation for the pasta.", "Remove the garlic, herbs, peppercorns and berries from the marinade mixture. ", "Using a slotted spoon, transfer the sardine-and-onion mixture to a large, heavy-based pan. Heat over a low heat to warm the mixture through, stirring regularly and gently breaking the sardines into pieces as you do so.", "Boil the tagliatelle in the salted, boiling water for 2-3 minutes, or until al dente. Drain, reserving a little of the cooking water.", "Stir the tagliatelle into the sardine-and-onion mixture, stirring to coat the pasta in the sauce. Add a little of the reserved cooking water to the mixture if necessary, to loosen the sauce.", "Serve immediately."]}, {"isVegetarian": false, "title": "Tagliatelle alla carbonara", "url": "www_bbc_co_uk_food_recipes_tagliatelleallacarbo_84655", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp extra virgin olive oil", "300g/10½oz prosciutto slices, cut into strips 1cm/½in wide", "100g/3½oz unsalted butter", "150ml/5fl oz white wine", "6 free-range egg yolks", "50g/2oz parmesan, freshly grated, plus extra for serving", "50g/2oz aged pecorino, freshly grated", "salt and freshly ground black pepper ", "350g/12oz egg tagliatelle"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a thick-bottomed saucepan. Add two-thirds of the prosciutto and fry for one minute.", "Add 50g/2oz of the butter to the pan and allow to melt, then add the wine and simmer for 2-3 minutes, just to combine with the butter and the prosciutto juices.", "Place the egg yolks, parmesan and pecorino into a bowl and season, to taste, with salt and freshly ground black pepper.  ", "Cook the tagliatelle according to the packet instructions, or until al dente, then drain, reserving a few tablespoons of the cooking water.", "Immediately add the pasta to the prosciutto mixture, then stir in the egg mixture - the heat of the pasta will cook the egg.", "Add the reserved cooking water if the sauce seems too thick, then stir in the remaining prosciutto and reserved butter.", "To serve, spoon into warmed bowls and sprinkle with a little extra parmesan."]}, {"isVegetarian": true, "title": "Tagliatelle with broccoli and tomato sauce", "url": "www_bbc_co_uk_food_recipes_tagliatellewithbrocc_84782", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour, plus extra for dusting", "1 free-range egg", "1 tbsp olive oil", "½ onion, chopped", "1 garlic clove, chopped", "½ broccoli head, cut into florets", "2 tomatoes, chopped", "1 tbsp tomato purée", "1 tbsp hot water", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tagliatelle, place the flour and the egg into the bowl of a food processor and blend the ingredients until they have combined and the mixture has formed a dough.", "Place the dough onto a floured surface and knead it for one minute.", "Wrap the dough in cling film and transfer it to the fridge to rest for five minutes.", "Remove the dough from the fridge and roll through a pasta machine twice, or until a flat sheet of pasta has formed.", "Cut the pasta into five ribbons and place it into a saucepan of salted boiling water.  Cook for 30 seconds and then drain off any excess water. ", "For the sauce, heat the oil in a saucepan and add the onion and garlic.  Fry the ingredients until they become soft and golden in colour.", "Add the broccoli, tomatoes, purée and water to the saucepan and mix the ingredients well.  Cook for five minutes then season, to taste, with salt and freshly ground black pepper.", "To serve, place the tagliatelle into a clean bowl and spoon the sauce over the top of the pasta."]}, {"isVegetarian": false, "title": "Tagliatelle with tomatoes, chilli, pancetta, broad beans and basil", "url": "www_bbc_co_uk_food_recipes_tagliatellewithtomat_89045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "3 pancetta rashers, chopped", "55g/2oz cherry tomatoes, halved", "pinch dried chilli flakes", "salt and freshly ground black pepper ", "30g/1oz fresh broad beans, out of the pods, inner membrane removed, blanched", "large handful chopped fresh basil", "100g/3½oz tagliatelle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dash of olive oil in a saucepan, add the chopped pancetta and fry for 2-3  minutes, or until just crisp. Add the tomatoes, chilli flakes, salt and freshly ground black pepper, reduce the heat and simmer for 4-5 minutes. Stir in the broad beans and basil.", "Cook the tagliatelle in boiling salted water for 8-10 minutes, or according to the packet instructions, until al dente. Drain, then add to the sauce and stir well to coat.", "Pile the tagliatelle into a serving bowl and serve."]}, {"isVegetarian": false, "title": "Tagliatelle with garlic clams", "url": "www_bbc_co_uk_food_recipes_tagliatellewithgarli_82151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, crushed", "75ml/2½fl oz white wine", "125g/4½oz clams, rinsed in clean cold water", "50ml/2fl oz boiling water", "100g/4oz tagliatelle, cooked", "2 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the garlic, white wine, clams and boiling water into a medium saucepan, cover with a lid and cook for five minutes, or until all the clams have opened. Drain and discard any that haven't opened.", "Toss the clams with the cooked tagliatelle, place in a bowl and sprinkle with parsley, to serve."]}, {"isVegetarian": false, "title": "Tagliarini with sea bass, squid, mussels, clams, brown shrimps, tomato and parsley", "url": "www_bbc_co_uk_food_recipes_taglieriniwithseabas_92548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "1 garlic clove, peeled, finely sliced", "1 x 400g/14oz can chopped tomatoes", "300g/10½oz small clams, cleaned (discard any clams that don't close tightly when firmly  tapped)", "300g/10½oz mussels, cleaned and de-bearded (discard any mussels that don't close when firmly tapped) ", "175ml/6fl oz dry white wine", "2 x 220g/8oz sea bass fillets, skin removed, thinly sliced", "250g/9oz squid (tentacles included), cleaned and finely sliced", "100g/3½oz brown shrimps", "1 tbsp chopped fresh flatleaf parsley", "pinch dried chilli flakes", "salt and freshly ground black pepper", "250g/9oz fresh tagliarini"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat a frying pan over a medium heat and add one tablespoon of the olive oil. Add half of the sliced garlic and cook for one minute, without browning. Add the chopped tomatoes, stir and cook for ten minutes, or until the volume of liquid has reduced slightly. Set aside.", "Heat two lidded sauté pans over a medium heat and add one tablespoon of the olive oil to each pan. Divide the remaining sliced garlic equally between the two pans. Fry the garlic for one minute, without browning. Add the clams to one pan and the mussels to the other, then cover both pans with a  lid. (Cooking the mussels and clams beforehand and straining the liquid will prevent any grit  from the shellfish making its way into the finished dish.) ", "Cook the mussels and clams for two minutes, then add half of the white wine to each pan and cover again with the lids. Cook for for an additional four minutes, or until all the clams and mussels have opened (discard any shellfish that remain closed).", "Strain the mussels and clams, discarding the liquid from the cooked clams but retaining the liquid from the cooked mussels. Set aside the mussels and clams, in their shells.", "Heat the reserved liquid from the cooked mussels in a small saucepan until the volume of liquid has reduced by half.", "Once the mussels and clams are cool enough to handle, remove the meat from the shells  and set aside.", "In a large frying pan heat the remaining tablespoon of olive oil over a high heat. Add the sea bass and squid slices and cook for two minutes (the squid should colour slightly).", "Add the cooked mussels and clams, the strained juice from cooking the mussels, the brown shrimps, chopped parsley and chilli flakes, then season, to taste, with salt and freshly ground black pepper. Reduce the heat and stir in the tomato sauce until warmed through.", "Meanwhile, bring a large pan of salted water to the boil. Add the taglierini and cook for 2-3 minutes, or until al dente.", "Drain the pasta and add it to the sauce in the pan. Toss well to combine and add more freshly ground black pepper, to taste. Divide equally among four serving plates."]}, {"isVegetarian": false, "title": "Taglierini with squid and oven-roasted tomato sauce", "url": "www_bbc_co_uk_food_recipes_taglieriniwithsquida_93785", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz type '00' pasta flour (available from most supermarket baking sections and some delis), plus extra for dusting", "salt and freshly ground black pepper ", "3 free-range egg yolks", "3 free-range eggs", "1 tbsp olive oil", "4 plum tomatoes, halved lengthways", "4 tbsp olive oil", "salt and freshly ground black pepper", "2 shallots, peeled, finely chopped", "1 garlic clove, peeled, thinly sliced", "100ml/3½fl oz white wine", "8 basil leaves, plus extra to serve", "300g/10½oz squid, cleaned (spines and beaks removed), tentacles removed and reserved, body sliced into rings"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the taglierini pasta, place the '00' flour, some salt and freshly ground black pepper, egg yolks, eggs and oil into a food processor and process for one minute, or until the mixture comes together to form a smooth dough. Tip the dough out into a bowl, cover with cling film and chill in the fridge for 30 minutes. ", "After 30 minutes, remove the dough from the fridge and turn out onto a floured work surface. Divide the dough into two equal pieces. ", "Flour the pasta machine and, starting at the lowest (thickest) setting, feed one piece of the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Repeat with the other piece of dough until you have two sheets of pasta (cover the first sheet with a clean tea towel while you work on the second one, to prevent it from drying out).", "Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the taglierini cutter attachment to the pasta machine, flouring it well. Feed the sheets of dough through the machine once again, cutting them into 3mm-thick strands of taglierini. Dust the pasta with flour, place on a tray, cover and place in the fridge overnight.", "Preheat the oven 150C/300F/Gas 2.", "For the squid and oven-roasted tomato sauce, place the tomato halves onto a baking sheet, cut-sides up, and drizzle with half of the olive oil and season with salt and freshly ground black pepper. Roast in the oven for 1½ hours, or until the tomatoes are soft and slightly dried out. (You can prepare the tomatoes a few days in advance, storing them in olive oil in a sterilised jar. Keep in the fridge until needed.)", "Heat a large frying pan and add 1 tablespoon of the remaining olive oil. Fry the shallots and garlic 2-3 minutes, or until softened. Turn up the heat and add the white wine, scraping up any browned bits from the bottom of the pan with a wooden spoon to deglaze. Simmer for 3-4 minutes, or until the liquid has reduced in volume by one-third. Add the roasted tomatoes to the pan, along with the basil leaves.", "Heat a medium frying pan and add the remaining olive oil. Add the squid rings and tentacles and fry for 2-3 minutes, or until just-cooked. ", "To serve, bring a large pan of salted water to the boil, add the taglierini and cook for 2-3 minutes, or until al dente. Drain the pasta and add to the pan with the tomato sauce. Add the cooked squid and mix well. Pile the pasta onto serving plates and garnish with a few basil leaves."]}, {"isVegetarian": false, "title": "Tail fillet of beef with blue cheese 'bonbons'", "url": "www_bbc_co_uk_food_recipes_tail_fillet_of_beef_with_25038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "8 shallots, roughly chopped", "50ml/2fl oz chicken stock", "2 sprigs fresh thyme", "50g/2oz blue cheese", "5oz/150g potatoes, peeled, boiled and passed through a potato ricer", "2 tsp double cream", "vegetable or sunflower oil, for deep-frying", "3oz/200g plain flour", "2 free-range egg yolks", "100ml/3½fl oz milk", "120g/4oz breadcrumbs", "2 x 450g/16oz beef tail fillets, on the bone ", "150g/5oz butter", "300ml/10½fl oz reduced beef stock", "100ml/3½fl oz red wine", "salt and freshly ground black pepper", "150g/5oz rocket", "olive oil, for drizzling "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the shallot purée, melt 50g/2oz of the butter in a pan until foaming, then add the shallots and gently fry for 2-3 minutes, or until softened but not coloured. Pour in the chicken stock and simmer for 1-2 minutes, then transfer to a food processor. Remove the thyme sprigs and blend until smooth. Pass through a fine sieve into a clean bowl and set aside. ", "For the blue cheese bonbons, crumble the blue cheese into the smooth potato. Add the splash of cream and beat together until smooth. Divide the mixture into 12 equal portions. ", "Dust each ball in the flour, then dip into the egg wash and roll in the breadcrumbs. Repeat the process twice. ", "Heat the sunflower or vegetable oil in a deep-fat fryer until it reaches 165C/330F. Alternatively, half-fill a deep, heavy-based pan with the oil and heat until the required temperature, checking using a digital thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the blue cheese bonbons, in batches, for 1-2 minutes, or until golden-brown all over. Be careful not to fry the bonbons for too long as they may burst in the hot oil. Remove with a slotted spoon and drain on kitchen paper. Keep warm. ", "Pre-heat the oven to 250C/500F/Gas 9. ", "For the tail fillet, place the tail fillets bone-side down in a roasting tin and roast for 10-15 minutes (for medium rare), or until cooked to your liking. Set aside to rest in a warm place for 15 minutes. ", "Place the roasting tin over a medium-high heat and add the butter. When melted, add the red wine and scrape up any browned bits from the bottom of the pan with a wooden spoon to deglaze. Simmer until the liquid has reduced to a thick syrup. ", "Add the beef stock and thyme and simmer until the liquid has reduced in volume by two-thirds. Pass the gravy through a fine sieve. ", "To serve, carve the fillet from the bone and season with salt and freshly ground black pepper. Spoon the shallot purée onto serving plates and arrange the beef slices on top. Place three blue cheese bonbons on each plate. Dress the rocket with olive oil, season with salt and freshly ground black pepper and arrange alongside the beef. "]}, {"isVegetarian": true, "title": "Tagliatelle with cavolo nero, chickpeas and pecorino", "url": "www_bbc_co_uk_food_recipes_taglioliniwithlemono_70911", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/taglioliniwithlemono_70911_16x9.jpg", "ingredients": ["large handful cavolo nero, or kale", "100ml/3½fl oz olive oil", "2 lemons, zest only", "½ lemon, juice only", "200g/7oz cooked chickpeas", "500g/1lb 2oz fresh tagliatelle pasta, or similar", "salt ", "freshly ground black pepper", "100g/3½oz pecorino or other hard cheese, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a deep saucepan of water to a rolling boil and blanch the cavolo nero for one minute. Drain, and when cool enough to handle, chop finely.", "Heat the olive oil in a wide pan and fry the cavolo nero in it for a few minutes, over a moderately high heat, stirring constantly.", "At the same time, bring a pot of water to a boil and drop in the pasta to cook for two or three minutes until just tender.", "Drain the pasta and stir it into the kale with the lemon zest and juice, the chickpeas and half of the grated pecorino. Season, to taste, with salt and freshly ground black pepper.", "Serve the pasta in deep bowls with more cheese scattered over."]}, {"isVegetarian": true, "title": "Taleggio and rocket pesto tart", "url": "www_bbc_co_uk_food_recipes_taleggioandrocketpes_85294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 10cm/4in squares ready-made filo pastry", "1 free-range egg, beaten", "85g/3oz Taleggio cheese, sliced", "1 tbsp chopped rocket", "2 tbsp olive oil", "3 tbsp pine nuts", "1 garlic clove, peeled", "large handful rocket", "salt and freshly ground black pepper", "1 free-range egg, poached"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place one square of filo pastry onto a non-stick baking sheet, crumple slightly and brush with beaten egg. Place another piece of pastry on top and again brush with egg. Repeat with the remaining pastry and egg.", "Place the baking sheet into the oven and bake the pastry for 5-6 minutes, or until golden-brown and crisp.", "Sprinkle the top of the pastry with the Taleggio slices and rocket and set aside.", "For the rocket pesto, place all the pesto ingredients into a small food processor and blend until smooth. ", "To serve, place the tart onto a serving plate, drizzle with the rocket pesto and top with a poached egg."]}, {"isVegetarian": true, "title": "Taleggio cheese on toast with a tomato and herb salsa", "url": "www_bbc_co_uk_food_recipes_taleggiocheeseontoas_89125", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices white bread", "85g/3oz taleggio cheese, sliced", "2 vine tomatoes, de-seeded and chopped", "1 clove garlic, finely chopped", "2 tbsp chopped fresh parsley", "1 handful fresh basil leaves, torn", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cheese on toast, toast the bread in the oven for 3-4 minutes, or until lightly golden. Lay the slices of cheese on top of the toast then grill for 2-3 minutes, or until the cheese is melted and bubbling.", "For the tomato and herb salsa, combine all of the salsa ingredients together in a bowl and mix well to combine.", "To serve, place the cheese on toast on a serving plate and spoon over the tomato and herb salsa."]}, {"isVegetarian": true, "title": "Taleggio toasts with roasted vine tomatoes", "url": "www_bbc_co_uk_food_recipes_taleggiotoastswithro_85297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 vine tomatoes", "olive oil, for drizzling", "salt and freshly ground black pepper", "3 slices ciabatta, toasted", "100g/3½oz Taleggio cheese, sliced", "salt and freshly ground black pepper", "6 fresh basil leaves, to serve"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Preheat the grill to medium.", "For the roasted vine tomatoes, place the tomatoes onto a baking sheet, drizzle with olive oil and season with salt and freshly ground black pepper.", "Transfer to the oven and roast for 10-12 minutes, until softened.", "For the Taleggio toasts, top the toasted ciabatta slices with the Taleggio and season with salt and freshly ground black pepper.", "Place under the grill for 3-4 minutes, or until the Taleggio has melted.", "To serve, place a slice of Taleggio toast onto three serving plates and place two roasted tomatoes on top of each slice. Top with the basil leaves."]}, {"isVegetarian": true, "title": "Taleggio, artichoke and sun-dried tomato pizza with Italian salad", "url": "www_bbc_co_uk_food_recipes_talegioartichokesund_78030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "2 tbsp olive oil", "1 tsp salt", "150ml/5fl oz water", "1tbsp tomato purée", "1tbsp tomato ketchup ", "2 tbsp olive oil", "100g/3½oz Taleggio cheese, grated", "50g/1¾oz cooked artichoke hearts", "50g/1¾oz sun-dried tomatoes", "1tsp chives, chopped ", "salt and freshly ground black pepper, to taste"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pizza dough, place the flour, olive oil and salt into a large mixing bowl.", "Add the water gradually, while mixing together. Make sure not to add too much water. Stop when the dough has bound together.", "Transfer to a floured surface and knead for one minute.", "Place a crepe pan over a high heat.", "Roll the dough into a thin round to fit the pan. Place in the crepe pan and cook in the crepe pan for one minute on each side.", "For the topping, spread the tomato purée and ketchup over the base. Scatter over the Taleggio, artichokes and tomatoes.", "Drizzle with the olive oil, season with salt and freshly ground black pepper, to taste, and bake for five minutes.", "Serve sprinkled with the chives and cut into quarters."]}, {"isVegetarian": true, "title": "Taleggio fondue with ciabatta", "url": "www_bbc_co_uk_food_recipes_talegiofonduewithcia_78032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz white wine", "100g/3½oz Taleggio cheese, grated", "30ml/1fl oz double cream", "pinch ground nutmeg", "3 cooked artichoke hearts", "5 sun-blushed tomatoes", "2tbsp parsley, chopped ", "5 slices ciabatta", "1 tbsp olive oil", "2 tbsp chervil, chopped", "2 tbsp parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the wine, cheese, cream and nutmeg in a medium saucepan.", "Bring to simmering point and add the artichokes, tomatoes and parsley. Simmer for two minutes and set aside.", "To make the ciabatta, heat a griddle pan over a high heat until smoking.", "Drizzle the ciabatta slices with the olive oil and season well. Place in the pan and char grill for one minute on each side.", "To serve, pour the fondue into a bowl and serve the ciabatta slices aside."]}, {"isVegetarian": false, "title": "Tamarind-baked back ribs with stuffed baked onions", "url": "www_bbc_co_uk_food_recipes_tamarind-baked_back_ribs_91368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 pork back rib backs, about 1.5-2kg", "110g/4oz tamarind paste", "110g/4oz pomegranate molasses", "6 garlic cloves, peeled and crushed", "60g/2¼oz root ginger, peeled and grated", "½ tbsp ground cumin", "4 medium sized red onions, peeled", "a good knob of butter", "75g/3oz fatty minced pork", "salt and freshly ground black pepper", "2 tsp ground cumin", "30g/1¼oz fresh white breadcrumbs", "2 tbsp chopped parsley", "vegetable or corn oil, for brushing"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Smear the ribs with the marinade ingredients mixed together in a bowl. Cover the bowl with cling film and leave to marinate in the fridge for at least 24 hours (the longer the better).", "Preheat the oven to 190C/375F/Gas 5. Transfer the marinated ribs to a baking or roasting tin and cook for 30 mins, basting as they are cooking. ", "Turn the oven down to 160C/325F/Gas 3, cover the tray with foil and continue cooking and basting for another hour, then remove the foil and cook, basting regularly, for a further 30-45 minutes. ", "Remove the ribs from the oven, cover and keep warm until ready to serve.", "For the stuffed onions, preheat the oven to 200C/400F/Gas 6.", "Wrap the onions in foil, stand them on a baking tray and bake for about 45-50 minutes, or until they are fairly soft. Remove from the oven, take off the foil and leave to cool a little. ", "Meanwhile, prepare the stuffing. Melt the butter in a frying pan. Season the pork with salt, pepper and ground cumin, add to the pan and fry over a medium heat for a few minutes, stirring, until lightly coloured. Add 125ml/4½fl oz water and simmer gently for about 10 minutes or until the water has evaporated. Transfer to a bowl and leave to cool.", "Once the onions are cool enough to handle, chop about 1cm/½in off the top of each, then carefully remove the skins, keeping the onions intact. Scoop out the centre of each onion with a spoon, leaving a couple of layers of flesh to hold them together. Reserve both the onion tops and scooped flesh. ", "Finely chop the scooped onion flesh and mix it together with the pork, breadcrumbs and parsley. Season to taste. Spoon the filling into the onions and replace the tops. Place on a baking tray, brush with oil and bake for about 15-20 minutes, until the onions are lightly-coloured and the filling is hot.  "]}, {"isVegetarian": false, "title": "Tamarind-glazed mackerel with lemongrass noodles", "url": "www_bbc_co_uk_food_recipes_tamarind-glazed_mackerel_79383", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mackerel, cleaned and filleted", "3 tbsp tamarind paste", "1 tbsp ginger, grated", "2 garlic cloves, crushed", "½ tsp salt", "½ tsp ground coriander", "1 tbsp clear honey", "450g/1lb egg noodles", "2 tbsp olive oil", "1 stem lemongrass, finely sliced", "2 garlic cloves, crushed", "5cm/2in piece ginger, peeled and finely diced", "2 long green chillies, finely diced", "4 spring onions, sliced", "½ Chinese leaf, finely shredded", "2 tbsp oyster sauce", "2 tbsp soy sauce", "3 tbsp sesame oil", "2 limes, juice only", "3 tbsp fresh coriander, roughly chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, place the mackerel fillets onto a grill pan or flat tray. Mix the remaining ingredients together and brush over both sides of the fillets. Set aside to marinade for 30 minutes.", "To cook the mackerel, heat the grill to its highest setting. Grill the fillets for two minutes on each side, basting with the marinade as you turn them. ", "For the lemongrass noodles, cook the egg noodles in a large pan of boiling water according to the packet instructions then drain, refresh in iced water and drain again thoroughly. Toss the noodles with half of the olive oil and set aside.", "Heat a frying pan until medium hot, add the remaining olive oil, lemongrass, garlic, ginger, chilli and spring onions and cook gently for 1-2 minutes, or until the vegetables have just softened. Mix the noodles into the vegetables and stir in the Chinese leaf.", "Whisk the oyster and soy sauces with the sesame oil and lime juice, then mix into the noodles and season to taste with salt.", "To serve, pile the noodles onto each plate, top with the grilled mackerel and serve garnished with chopped coriander."]}, {"isVegetarian": false, "title": "Tamarind-marinated bavette steak", "url": "www_bbc_co_uk_food_recipes_tamarind-marinated_90215", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tamarind-marinated_90215_16x9.jpg", "ingredients": ["50g/1¾oz tamarind paste", "4 tbsp soy sauce", "4 tbsp hot water, from a recently boiled kettle", "2 tbsp sunflower oil", "1 tbsp runny honey", "750g/1lb 10oz (whole piece) bavette steak"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Put the tamarind paste, soy and hot water into the smallest saucepan you have, and stir over a low heat to dissolve the tamarind. When it’s as smooth as you think you can get it – the tamarind paste I use says it’s without stones, but I do find the odd one, and I don’t bother to get rid of them – remove to a bowl or jug, whisk in the oil and honey, and leave to cool. Do not use until it is cold.", "Put the bavette steak into a resealable freezer bag, pour in the cold marinade and squelch it about so that the thin steak is covered on both sides, then seal, lay on a plate and put in the fridge overnight or for 1 day.", "Bring it back to room temperature, prepare a large piece of kitchen foil, then heat a ridged griddle till very, very hot. Lift the steak out of its marinade, letting any excess (and there will be a lot) drip back into the bag and then slap the meat on the griddle and cook for 2 minutes a side.", "Immediately (I use tongs for all this) transfer the steak to the piece of foil and make a tightly sealed but baggy parcel, and let the meat rest, on a chopping board, or any surface that is not too cold, for 5 minutes. Then unwrap the foil, transfer the steak to a board, and carve in thin slices against the grain."]}, {"isVegetarian": false, "title": "Tamarind and miso onglet steak with besan chips", "url": "www_bbc_co_uk_food_recipes_tamarind_and_miso_onglet_10358", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz sake", "100ml/3½fl oz mirin", "600g/1lb 6oz white miso", "300g/11oz caster sugar", "125g/4½oz tamarind paste", "75ml/3fl oz den miso (see recipe above)", "2 garlic cloves, finely sliced", "1 tsp chopped fresh thyme ", "6 x 150-175g/5-6oz onglet steaks, trimmed", "50ml/2fl oz olive oil", "1 tbsp vegetable oil, plus extra for greasing and deep-frying", "1 tsp cumin seeds", "15 fresh curry leaves", "1 tsp ground turmeric", "1 tbsp finely minced ginger", "½ green chilli, finely chopped", "½ bunch fresh coriander, finely chopped", "200g/7oz gram flour (besan or chickpea flour)", "600ml/1pint 2fl oz water", "½ tsp salt", "¼ tsp freshly ground black pepper", "1 tsp nigella seeds", "2-3 tbsp polenta", "1 tbsp pomegranate molasses ", "2 tbsp cider vinegar", "5 tbsp extra virgin olive oil", "2 bunches watercress"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the den miso, place all the ingredients into a saucepan and whisk over a medium heat until the sugar and miso have dissolved. Remove the pan from the heat and set aside to cool. Store in an airtight container in the fridge.", "For the steak, mix the tamarind paste, den miso, garlic and thyme in a bowl until well combined. Add the steaks, make sure they are well coated in the marinade and set aside to marinate for at least three hours, preferably overnight.", "Meanwhile, for the besan chips, heat the oil in a heavy-based saucepan. Add the spices, ginger, chilli and coriander and cook for a few minutes until aromatic.", "Sift the besan into a bowl, then whisk in the water until smooth.", "Pour the paste into the saucepan, add the salt and pepper and stir over a moderate heat with a wooden spoon or spatula for 10-12 minutes, or until the mixture thickens and comes away from the sides of the pan (the process is similar to making firm polenta, but the besan takes a little longer to thicken). ", "Grease a small oven tray and sprinkle with the nigella seeds and a little polenta. Pour over the besan mixture, cover with a piece of greaseproof and quickly flatten out the mixture. Chill in the fridge until the mixture has hardened.", "Heat a griddle or a heavy-based frying pan over a high heat until hot but not smoking (if the pan is too hot, the outside of the meat will burn before it has cooked enough.) ", "Brush the steaks with the oil and season with salt and freshly ground black pepper. Cook for 2-4 minutes on each side, or until cooked to your liking.", "Transfer the steaks from the pan to a rack, cover with foil and set aside to rest in a warm place for up to 10 minutes (this helps the meat to ‘relax’ and maximises taste and tenderness). ", "Preheat a deep-fat fryer to180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully turn the hardened besan out onto a chopping board and cut into chips. Dust the chips with polenta.", "Deep-fry the chips for 2-3 minutes, or until golden-brown. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. ", "For the watercress salad, whisk the pomegranate molasses, vinegar and olive oil together in a bowl until well combined, then season with salt and freshly ground black pepper. Coat the watercress with the dressing.", "To serve, place the steak onto serving plates with the chips and watercress alongside."]}, {"isVegetarian": false, "title": "Tamarind and coconut lamb and vegetable stir-fry", "url": "www_bbc_co_uk_food_recipes_tamarind_and_coconut_82562", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lamb fillets, trimmed", "sea salt and freshly ground black pepper", "2 tbsp vegetable oil", "2 red chillies, finely shredded", "2 cloves garlic, roughly chopped", "5cm/2in piece ginger, roughly chopped", "6 spring onions, sliced", "1 leek, sliced", "150g/5½oz spring cabbage, finely shredded", "4 tbsp tamarind paste ", "200ml/7fl oz coconut milk", "2 tbsp fish sauce", "3 tbsp roughly chopped mint leaves", "3 tbsp roughly chopped coriander leaves", "75g/3oz mizuna leaves", "1 lime, juice only", "banana leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the lamb fillets with salt and black pepper.", "Heat a frying pan until hot, add one tablespoon of the oil and fry the lamb on all sides until browned. Remove from the pan and set aside.", "Heat a wok until hot, add the remaining oil, then add the chillies, garlic, ginger and spring onions and stir fry for one minute.", "Add the leek and spring cabbage and stir fry for another two minutes then add the fish sauce, tamarind paste and coconut milk and bring to a simmer.", "Cut the lamb into thick slices then add to the vegetables and toss through to combine.", "Cook for one more minute then remove from the heat and add the mint, coriander and mizuna leaves and toss to combine. Add the lime juice and check the seasoning.", "To serve, lay a banana leaf into each of four soup plates then spoon the stir-fry on top."]}, {"isVegetarian": false, "title": "Tamarind and lemongrass beef", "url": "www_bbc_co_uk_food_recipes_tamarind_and_lemongrass_62200", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tamarind_and_lemongrass_62200_16x9.jpg", "ingredients": ["1 tbsp oil", "500g/1lb 2oz lean beef, cut into strips", "2 lemongrass stalks, chopped", "6 shallots, chopped", "2 green chillies, chopped", "3 tbsp tamarind paste", "2 tbsp lime juice", "2 tsp Thai fish sauce", "2 tsp brown sugar", "200g/7oz shredded green papaya"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok or frying pan, toss in the beef and cook over a high heat for 2-3 minutes.", "Add the lemongrass, shallots and chillies and stir-fry for a 5 minutes, or until the meat is well browned.", "Add the tamarind paste, lime juice, fish sauce, sugar and papaya and stir-fry for 4 minutes.", "Divide between four bowls and serve."]}, {"isVegetarian": false, "title": "Tamarind prawns", "url": "www_bbc_co_uk_food_recipes_tamarind_prawns_40510", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz tamarind paste", "75g/2½oz clear honey", "2 garlic cloves, crushed ", "2 tbsp light brown sugar ", "3–4 tbsp chilli oil, or olive oil if preferred", "sea salt flakes", "800g/1lb 12oz raw tiger prawns (the biggest you can find), ideally peeled but with tails left on", "vegetable oil, for frying", "2 heaped tsp toasted sesame seeds", "10g fresh coriander, leaves picked and roughly chopped", "3 spring onions, trimmed and thinly sliced from root to tip"], "serves": "Serves 4–6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To prepare the marinade, thoroughly mix the ingredients in a bowl until the sugar dissolves. ", "Add the prawns and work the marinade into them using your hands. Cover the bowl with cling film and allow to marinate at room temperature for 30 minutes.", "Heat a large frying pan over a medium-high heat and drizzle in a little vegetable oil. Drain any excess marinade from the prawns then fry them quickly on both sides until they are cooked through and slightly charred. (Cooking times will vary depending on the size of the prawns – if using standard supermarket prawns you won't need to cook them for more than 1 minute or so on each side, but if you are using larger prawns you may need to reduce the heat slightly and allow them to cook for a little longer.) The marinade is sticky and sweet which means it will blacken, so don’t panic if the prawns look a little charred.", "Serve sprinkled with toasted sesame seeds, coriander and sliced spring onions. "]}, {"isVegetarian": false, "title": "Tamarind prawns with mushrooms, pak choi and bulgur wheat", "url": "www_bbc_co_uk_food_recipes_tamarind_prawns_with_36430", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tamarind_prawns_with_36430_16x9.jpg", "ingredients": ["100g/3½oz bulgur wheat", "1 garlic clove, finely chopped", "2 spring onions, thinly sliced", "4cm/1.5in fresh root ginger, peeled and finely grated ", "150g/5½oz shiitake mushrooms, halved if large", "180g/6½oz raw prawns", "1 tbsp tamarind paste", "1 tbsp runny honey", "3 pak choi, thinly sliced", "10g fresh coriander, roughly chopped "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Mix the bulgur wheat, garlic, spring onions and two-thirds of the ginger with 200ml/7fl oz water in a roasting tin. Top with the mushrooms. Cover tightly with kitchen foil and bake for 15 minutes.", "In a bowl, mix the prawns with the remaining ginger, then cover and refrigerate. ", "In a separate bowl, mix the tamarind with the honey and set aside. ", "Add the pak choi and prawns to the roasting tin and bake for 7–8 minutes, or until the pak choi has wilted and the prawns are cooked through. ", "Spoon the traybake onto two plates, pour over the tamarind dressing, scatter with the coriander and serve immediately. "]}, {"isVegetarian": false, "title": "Tamarind seared tuna steak with melon salad and zingy dressing", "url": "www_bbc_co_uk_food_recipes_tamarind_seared_tuna_97406", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ watermelon, peeled and sliced", "½ cantaloupe melon, peeled and sliced", "150g/5½oz edamame beans, podded", "75g/2½oz sugar-snap peas, thinly sliced", "75g/2½oz mangetout, thinly sliced", "tuna steak (weighing approximately 500g/1lb 2oz), cut into 4 pieces", "2 tbsp tamarind paste", "1 tbsp rapeseed oil", "1 red chilli, finely chopped", "2 garlic cloves, crushed", "2cm/¾in piece root ginger, peeled and roughly chopped", "2 tbsp palm sugar (also known as jaggery)", "6 tbsp soy sauce", "4 tbsp fish sauce", "2 tbsp finely chopped fresh mint leaves", "2 tbsp finely chopped fresh coriander leaves", "2 limes, juice only", "½ pomegranate, seeds removed"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the salad, place the sliced melons in a vac-pac bag and seal in a vac-pac machine. Leave in the fridge overnight.", "For the tuna steak, brush the tuna with tamarind paste and leave to marinate for at least 1 hour.", "Meanwhile, for the salad, heat a large frying pan and add the chilled melon, cook on each side for 1-2 minutes. Cut into 2-3cm/¾-1¼in pieces and place in a large bowl with the beans, sugar-snap peas, and mangetout. Set aside. ", "Heat a large griddle pan and lightly brush the tuna with the oil. Cook on the griddle for 6-8 minutes, depending on the size of the steaks and how you like your tuna cooked. Leave to rest, then thinly slice.", "For the dressing, put all the ingredients in a pestle and mortar and mix until smooth.", "To serve, toss the salad in the dressing. Put the salad on serving plates with the tuna alongside. Garnish with pomegranate seeds."]}]