[{"ingredients": ["6 ostras frescas en su caparazón", "55 g / 2 oz de mantequilla", "½ cebolla pequeña picada", "1 cucharada de perejil fresco picado", "55 g / 2 oz de espinaca, picada", "Migajas de pan fino de 55 g / 2 oz"], "method": ["Precalentar la parrilla a su configuración más alta.", "Abra las conchas de ostra con un shucker. Deseche la parte superior y afloje cada ostra de la base de su caparazón. Aparta y mantén la calma.", "Derretir la mantequilla en una sartén pequeña. Freír la cebolla y el perejil durante 2-3 minutos, hasta que se ablanden.", "Agregue la espinaca y cocine hasta que se marchite.", "Agregue las migas de pan y cocine durante 1-2 minutos.", "Coloque una cucharadita de espinacas y una mezcla de migas de pan en cada caparazón de ostra para cubrir la ostra y coloque un pequeño trozo de mantequilla encima de cada una.", "Coloque las ostras en una bandeja para hornear y transfiéralas a la parrilla para que se cocinen hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_oystersrockefeller_85977", "title": "Ostras Rockefeller", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 ostras de roca", "1 limón, solo jugo", "1 lima, solo jugo", "150ml / ¼ pinta de aceite de oliva", "1 fruta de la pasión, pulpa raspada", "1 cucharadita de hojuelas de chile", "1 chalote, finamente picado", "pequeño puñado de cilantro fresco, finamente picado", "1 lima, cortada en cuñas, para servir"], "method": ["Abra con cuidado las ostras con un shucker de ostras y colóquelas en un plato para servir.", "Coloque todos los ingredientes restantes, excepto las rodajas de lima, en un tazón pequeño y mezcle bien.", "Para servir, vierta la salsa sobre las ostras y adorne con rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_oysterswithacoriande_87075", "title": "Ostras con cilantro y maracuyá", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 ostras grandes, preferiblemente ostras Colchester", "55 g / 2 oz de mantequilla", "Pasta tagliolini 200 g / 7 oz, preferiblemente fresco", "2 cucharadas de vinagre de vino blanco", "½ limón, solo jugo", "1 pequeño manojo de cebollín, finamente picado", "sal", "pimienta negra recién molida"], "method": ["Poner a hervir una olla de agua con sal. Con un cuchillo de ostra, abre las ostras y saca la carne de las ostras del caparazón. Córtelos por la mitad y colóquelos en su propia agua, teniendo cuidado de no dejar ningún trozo de concha en el agua de ostra.", "Suavemente derrita la mantequilla en una olla grande.", "Mientras tanto, agrega la pasta a la sartén de agua salada hirviendo. Le tomará dos minutos cocinar, si está usando pasta fresca o según las instrucciones del paquete. Escurra la pasta cocida, reservando parte del agua de cocción.", "Agregue la pasta drenada a la sartén con mantequilla derretida. Luego agregue las ostras y el agua de ostras. Agregue cebollino, vinagre y limón. Revuelva por un par de minutos, solo para calentar las ostras. Agregue más agua o mantequilla si es necesario.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_oysterswithtagliolin_73313", "title": "Ostras con tagliolini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de arroz planos de 250g / 9oz", "3 dientes de ajo, toscamente picados", "buenas hojas y tallos de cilantro puñado", "1 guindilla roja, sin semillas, más o menos picadas", "2 limas, cáscara y jugo", "2 cucharadas de aceite de girasol", "20 langostinos tigre crudos, sin cáscara, cabezas y vena negra eliminados", "6 cebolletas, cortadas y finamente rebanadas", "100g / 3½oz de brotes de soja", "3 cucharadas de salsa de pescado tailandés (Nam Pla)", "1 cucharada de azúcar morena suave y ligera", "2 huevos grandes de gallinas camperas, golpeados", "cuñas de lima, para adornar", "4 cucharadas de semillas de sésamo tostadas, más o menos picadas, para adornar"], "method": ["Cocine los fideos de acuerdo con las instrucciones del paquete, luego escúrralos y déjelos a un lado.", "En una maja y mortero, haga una pasta del ajo, tallos de cilantro, chile rojo y ralladura de limón.", "Caliente el aceite en un wok o una sartén antiadherente grande a fuego alto. Cuando el aceite esté justo en el punto de ahumado, agregue la pasta y fría por aproximadamente un minuto, o hasta que se vuelva aromático.", "Agregue las gambas, la mitad de las cebolletas y la mitad de los frijoles y saltee durante dos minutos.", "Agregue los fideos escurridos y mezcle. Agregue el jugo de lima, la salsa de pescado y el azúcar moreno y cocine por dos minutos. Vierte los huevos batidos y mezcla a través de los fideos hasta que estén recién cocinados.", "Coloque los fideos sobre platos para servir calentados y sirva adornado con hojas de cilantro, rodajas de lima, semillas de sésamo tostadas y las cebolletas restantes y los brotes de soja."], "url": "www_bbc_co_uk_food_recipes_pad_thai_36788", "title": "Pad Thai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pad_thai_36788_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de arroz planos de 250g / 9oz", "3 dientes de ajo, toscamente picados", "1 puñado de cilantro fresco, picado, hojas y tallos separados", "1 guindilla roja, sin semillas, más o menos picadas", "2 limas, jugo y ralladura", "2 cucharadas de aceite de girasol", "1 pechuga de pollo cocida, sin piel y en rodajas finas", "6 cebollas de primavera, en rodajas finas", "100 g / 3½ oz de brotes de soja", "3 cucharadas de salsa de pescado", "1 cucharada de azúcar moreno claro", "2 huevos grandes de gallinas camperas, golpeados", "1 puñado de cacahuetes salados, más o menos picados, para servir"], "method": ["Cocine los fideos de acuerdo con las instrucciones del paquete, luego drene y reserve.", "En una maja y mortero, muele el ajo, los tallos de cilantro, el chile y la ralladura de lima hasta obtener una pasta.", "Caliente el aceite en un wok o en una sartén grande hasta que esté en el punto de ahumado. Agregue la pasta y fría por 1 minuto, o hasta que esté aromático. Agregue el pollo, la mitad de las cebollas de primavera y la mitad de los brotes de soja y cocine durante 2 minutos, revolviendo bien para cubrir todo en la pasta.", "Agregue los fideos drenados y mezcle bien. Agregue el jugo de lima, la salsa de pescado y el azúcar y cocine durante 2 minutos.", "Vierta el huevo y mezcle hasta que esté cocido. Sirve el taco tailandés con hojas de cilantro, rodajas de lima, cacahuates y cebollas de primavera restantes y brotes de soja."], "url": "www_bbc_co_uk_food_recipes_pad_thai_38349", "title": "Pad Thai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pad_thai_38349_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de fideos de arroz medianos", "3 chalotes tailandeses, toscamente picados", "2 dientes de ajo, picados", "2 cucharadas de raíz de cilantro fresco", "1 cucharadita de chile en polvo", "50ml / 1¾oz de aceite de girasol", "200g / 7oz de pollo picado", "50g / 1¾oz de camarones secos", "4 cebolletas, finamente picadas", "Brotes de soja 150 g / 5½ oz", "25 ml / 2 cucharadas de salsa de soja", "25ml / 2 cucharadas de salsa de ostras", "2 huevos medianos de granja", "3 limas, solo jugo", "10 hojas de Pak chee laos (eneldo)", "75g / 2½oz de cacahuetes tostados, toscamente picados", "100g / 3½oz de brotes de soja", "4 cebollas de primavera, solo parte verde, finamente picadas", "1 chile rojo, en juliana", "cilantro fresco, recogido", "1 cucharada de nabo en escabeche, triturado"], "method": ["Coloque los fideos en un tazón grande y resistente al calor y vierta sobre agua hirviendo hasta que estén sumergidos. Deja durante 2-3 minutos, luego drenar bien y colocar en agua fría para enfriar.", "Moler los chalotes, el ajo, la raíz de cilantro y el chile en polvo en un mortero, agregando un toque de agua para ponerlo en una pasta.", "Caliente el aceite en una sartén grande, agregue el pollo y cocínelo hasta que se dore. Agregue las gambas, cebollas y brotes de soja y cocine por un minuto más.", "Agregue la salsa de soja y la salsa de ostras y cocine por un minuto más.", "Agregue los fideos, los huevos, el jugo de lima y las hojas drenados. Mezcle suavemente hasta que los huevos estén cocidos.", "Para servir, coloque la ensalada tailandesa en un tazón grande y cubra con todas las guarniciones."], "url": "www_bbc_co_uk_food_recipes_pad_thai_salad_01326", "title": "Ensalada Pad Thai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva o vegetal", "Pimientos padron 150g / 5½oz", "sal marina escamosa", "2 cucharadas de aceite de oliva virgen extra"], "method": ["Caliente el aceite de oliva en una sartén grande (preferiblemente de hierro fundido) a fuego alto. Cuando el aire sobre el aceite comience a brillar y la sartén esté demasiado caliente para sostener cómodamente la mano, agregue los pimientos de padrón.", "Cocine por un lado durante 1 minuto, o hasta que las pieles empiecen a ennegrecerse y formar ampollas, luego voltee.", "Cocine por un minuto más y continúe cocinando, agitando la sartén con regularidad, durante otros 2 o 3 minutos, o hasta que los chiles estén cubiertos de ampollas, pero se hayan ablandado hasta el punto de que estén tiernos.", "Retire de la sartén y rocíe sobre el aceite de oliva virgen extra. Espolvorea sobre una generosa pizca de sal marina escamosa. Sirva inmediatamente o a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_padron_peppers_93262", "title": "Pimientos de Padrón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de camarones secos (opcional)", "100 g de fideos secos de arroz", "3 cucharadas de aceite vegetal", "2 huevos, ligeramente batidos", "2 dientes de ajo, aplastados", "200g pequeños langostinos frescos, pelados", "100 g de brotes de soja, enjuagados", "2 cebolletas tiernas cortadas en trozos de 3cm / 1in", "3 cucharadas de salsa de pescado tailandés (nam pla)", "1 cucharada de ketchup de tomate", "2 cucharadas de jugo de lima", "½ cucharadita de hojuelas de chile seco o cayena", "1 cucharada de palma o azúcar moreno", "2 cucharadas de cacahuetes tostados, ligeramente triturados", "2 cucharadas de ramitas de cilantro", "1 lima, descuartizado"], "method": ["Moler los camarones secos en un polvo esponjoso en un molinillo de café eléctrico (puede limpiar el molinillo haciendo zumbar arroz crudo).", "Cubra los fideos con agua hirviendo y déjelos durante 15 minutos o hasta que estén al dente. Enjuague con agua fría y drene bien, luego use 1 cucharadita de aceite para cubrir sus manos y páselos por los fideos para ayudar a prevenir que se peguen.", "Para hacer la tortilla, caliente 1 cucharada de aceite en un wok y hágalo girar para cubrir la superficie. Vierta los huevos batidos y revuelva para hacer una tortilla muy fina. Pase un cuchillo por el borde, gírelo, corte en tiras y déjelo a un lado.", "Para cocinar los fideos, agregue el aceite restante al wok y caliente. Agregue el ajo y las gambas y mezcle a fuego alto. Deja las gambas a un lado.", "A su vez, agregue los fideos, las tiras de tortilla, los brotes de soja, las cebolletas, el polvo de camarón, la salsa de pescado, el ketchup, el jugo de lima, el chile y el azúcar, y tiéndalos constantemente a fuego alto.", "Para servir, esparza los cacahuetes triturados, las hojas de cilantro y las limas en cuartos."], "url": "www_bbc_co_uk_food_recipes_padthai_67953", "title": "Pad Thai", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/padthai_67953_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 pechugas de pollo, cortadas en 8 piezas", "4 gambas crudas, caparazón y cabeza", "20 mejillones, limpiados", "1 diente de ajo, aproximadamente picado", "3 tomates, blanqueados, pelados, sin semillas y toscamente picados", "200g / 7oz de paella de arroz", "una pizca de azafrán", "1 litro / 1¾ pintas de caldo de pollo, hirviendo", "8 pequeños tomates cherry", "110 g / 4 oz de habas, frescas o congeladas"], "method": ["En una sartén de paella, caliente el aceite de oliva y fría las piezas de pollo durante 1-2 minutos.", "Agregue las gambas, luego revuelva; agregue los mejillones y revuelva de nuevo, luego agregue el ajo y los tomates. Fría por un par de minutos más.", "Espolvorea en el arroz. NOTA: No revuelva los ingredientes, solo agítelos.", "Agregue una buena pizca de azafrán y vierta hasta 1 litro / 1¾ pintas de caldo de pollo hirviendo (aproximadamente 1 cm / ½ pulgada por encima del nivel del arroz).", "Finalmente agregue los tomates cherry pequeños y las habas, sazone y cocine a fuego lento durante 20 minutos.", "Sirve con ensalada de rúcula y pan crujiente."], "url": "www_bbc_co_uk_food_recipes_paella_67269", "title": "Paella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de aceite de oliva", "175g / 6oz de chorizo ​​cortado en rodajas de 5 mm / ¼ de pulgada", "8 muslos de pollo, deshuesados, cortados por la mitad, enrollados en harina común", "Mejillones de 1kg / 2lb 4 oz, limpios y ordenados", "1 cebolla grande española, finamente picada", "3 dientes de ajo picados", "½ cucharadita de hojuelas de chile rojo seco", "1 pimiento rojo, picado", "Arroz de paella 400 g / 14 oz (como calasparra), enjuagado y escurrido", "3 hojas de laurel", "1 cucharadita de pimentón ahumado", "1 cucharadita de hilos de azafrán, tostados en una sartén seca durante 1-2 minutos", "125ml / 4fl oz de vino blanco", "1 cucharada de jugo de limón", "2,8 litros / 5 pintas de caldo de pollo hecho de agua de caldo de mejillón y un cubo de caldo de pollo", "115g / 4½oz de guisantes congelados, descongelados", "18 pequeñas almejas frescas, limpiadas (deseche las que tengan cáscaras rotas o que no se cierren al golpearlas firmemente)", "4 tomates grandes, sin semilla y picados", "5 cucharadas de perejil de flatillo picado", "1 limón, ralladura solamente", "55g / 2oz de mantequilla sin sal", "12 gambas crudas, en sus caparazones", "Calamares de 450 g / 1 libra, limpiados y cortados en trozos pequeños", "sal y pimienta negra recién molida"], "method": ["Caliente la mitad del aceite de oliva en un plato de paella o una sartén grande de base pesada a fuego medio, agregue el chorizo ​​y fría por 2-3 minutos, luego retírelo y déjelo a un lado.", "Agregue las piezas de pollo a la misma sartén y cocínelas durante 2-3 minutos hasta que la piel esté dorada. Eliminar y reservar.", "Coloque los mejillones en una olla con agua hirviendo, cubra y hierva hasta que se abran. Descarta cualquiera que no se abra. Cuele y reserve los mejillones y el caldo.", "Agregue la mitad del aceite de oliva restante a la paella y fríe la cebolla, dos de los dientes de ajo, los chiles y el pimiento rojo. Cocine lentamente hasta que la cebolla se haya ablandado pero no dorado, aproximadamente ocho minutos.", "Agregue el arroz a la sartén, revuelva bien para cubrirlo con aceite, durante dos minutos, luego agregue las hojas de laurel, el pimentón, el azafrán tostado, el vino blanco, el jugo de limón y el caldo preparado. Cocine suavemente durante cinco minutos.", "Agregue el pollo frito y el chorizo, cubra con un pedazo de papel humedecido a prueba de grasa y cocine a fuego lento durante diez minutos.", "Agregue las arvejas y agregue las almejas. Cubra y cocine a fuego lento hasta que todas las almejas se hayan abierto, unos cinco minutos (deseche las almejas que no se hayan abierto).", "Retire el papel resistente a la grasa de la sartén y mezcle los tomates, el perejil, la ralladura de limón y la mantequilla.", "Agregue el aceite de oliva restante a una sartén por separado a fuego medio-alto. Agregue el diente de ajo restante y las gambas y fría por 2-3 minutos, agregando el calamar durante el último minuto. Sazone al gusto con sal y pimienta negra recién molida y agregue a la paella. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_paella_89059", "title": "Paella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de leche entera", "500g / 1lb 2oz de harina blanca fuerte", "2 cucharaditas de levadura de acción rápida", "Azúcar en polvo 80g / 3oz", "2 huevos medianos de granja", "2 cucharadita de sal marina fina", "250 g de mantequilla sin sal, refrigerada, en un bloque", "120g / 4¼oz de chocolate blanco, picado", "150g / 5½oz de queso crema con alto contenido de grasa", "1 limón, ralladura solamente", "Frambuesas 200 g / 7 oz", "1 huevos grandes de granja, batidos, para glasear"], "method": ["Para la masa, caliente la leche y 90 ml / 3 fl oz de agua en una olla pequeña hasta que esté tibio.", "Coloque todos los demás ingredientes, excepto la mantequilla, en el recipiente de una batidora independiente con un accesorio de gancho de masa, asegurándose de que la levadura no toque la sal. Agregue tres cuartas partes de la mezcla de leche y agua.", "Encienda el mezclador a baja velocidad hasta que todos los ingredientes estén incorporados. Agregue un poco más de líquido si la masa parece demasiado seca; quieres una masa un poco pegajosa Aumenta la velocidad y mezcla durante siete minutos.", "Extiende la masa en una bandeja para hornear forrada con pergamino para hornear. Cubra con una película adhesiva y colóquelo en el congelador para que se enfríe.", "Con un rodillo, aplaste la mantequilla entre dos pedazos de pergamino para hornear en un rectángulo de 33x19 cm / 13x7½ pulgadas y colóquelo en el congelador.", "Después de 15 minutos retire la masa del congelador y extiéndala en un rectángulo de 50x20cm / 19½x8 pulgadas. Con un borde corto hacia usted, coloque la mantequilla aplanada sobre los dos tercios inferiores de la masa.", "Dobla el tercio superior de la masa sobre la mantequilla y luego pliega el tercio inferior hacia arriba para que toda la mantequilla quede envuelta. Presione los bordes de la masa firmemente juntos.", "Gire el bloque de masa 90 grados y extiéndalo a 50x20cm / 19½x8in. Doble el tercio superior hacia abajo y el tercero inferior hacia arriba y vuelva a colocar en el congelador durante 15 minutos.", "Repita el laminado y doblar dos veces más, colocando la masa en el congelador durante 15 minutos en el medio.", "Corte la masa por la mitad y extienda una mitad sobre una superficie de trabajo bien enharinada a un rectángulo de 42x20cm / 16½x8in.", "Para el relleno, con el borde largo de la masa hacia usted, coloque una hilera de chocolate blanco de 1 cm / ½ en toda la masa a unos 2,5 cm del borde. Enrolle el borde inferior de la masa para cubrir el chocolate.", "Mezcle el queso crema y la ralladura de limón en un bol hasta que esté suave y aireado.", "Coloque la mezcla de queso crema en una manga pastelera equipada con una boquilla de 7 mm y pipe dos filas a través de la masa justo encima del chocolate en caja. Coloque una fila de frambuesas encima del queso crema. Voltee la masa de nuevo para cubrir el relleno y recortar el exceso de masa.", "Corta el rollo de masa en seis piezas pares, cada una de 7cm / 2¾ de largo. Coloque cada uno en una bandeja para hornear forrada con papel de hornear antiadherente.", "Repite el proceso de llenado de la segunda mitad de la masa para que termines con 12 pasteles. Cubra los pasteles con film transparente y deje probar a temperatura ambiente durante 40 minutos.", "Precaliente el horno a 200C / 400F / Gas 6. (No use un horno asistido por ventilador).", "Cepille los pasteles con el huevo batido. Hornee durante 25 minutos o hasta que estén bien dorados y dorados. Retire del horno y deje que se enfríe un poco antes de transferirlo a un estante de enfriamiento."], "url": "www_bbc_co_uk_food_recipes_pain_au_chocolat_blanc_37035", "title": "Pain au chocolat blanc con frambuesas y queso crema", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12 pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 chalote, picado", "1 diente de ajo, picado", "½ cucharadita de pimentón ahumado", "½ pimiento rojo, picado", "Arroz risotto 400 g / 14 oz (como arborio o carnaroli)", "pellizcar hilos de azafrán", "150ml / 5½fl oz de vino blanco", "500ml / 18fl oz de caldo de verduras calientes", "4 gambas crudas, conchas eliminadas, limpiadas", "1 calamar, limpiado y cortado en anillos", "puñado de perejil fresco, picado", "sal y pimienta negra recién molida", "1 limón, cortado en cuñas, para servir"], "method": ["Caliente el aceite en una sartén grande y fría la chalota, el ajo, el pimentón y el pimiento rojo hasta que se ablanden.", "Agregue el arroz y revuelva hasta que esté cubierto de aceite.", "Agregue el azafrán y el vino y cocine a fuego lento hasta que el líquido se haya reducido a la mitad.", "Agregue el caldo y cocine a fuego lento durante diez minutos, o hasta que la mayoría del caldo haya sido absorbido.", "Agregue las gambas y los anillos de calamar y cocine durante 3-4 minutos más, o hasta que el arroz esté tierno y las gambas y el calamar estén bien cocidos.", "Espolvorea sobre el perejil, condimenta al gusto, con sal y pimienta negra recién molida y revuelve bien.", "Para servir, coloque las porciones de la paella en platos y adorne con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_paella_85931", "title": "Paella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5½fl oz de leche entera tibia", "Levadura de acción rápida 5g", "Harina normal de 275g / 9¾oz", "Harina de pan fuerte 75g / 2½oz", "45g / 1¾oz de azúcar", "1 cucharadita de sal", "75 g / 2½ oz de mantequilla sin sal, ablandada", "1 huevo grande de granja, batido, más extra para glasear", "azúcar nibbed (azúcar perlada), para rociar"], "method": ["En un tazón pequeño, mezcle la leche y la levadura, y déjelas a un lado durante cinco minutos.", "En un tazón grande, mezcle las harinas, el azúcar y la sal hasta que estén bien combinados.", "Vierta la levadura y la mezcla de leche, la mantequilla ablandada y el huevo batido y revuelva para combinar.", "Dé vuelta a una superficie de trabajo ligeramente enharinada y amasar (use un raspador de masa) durante 10 minutos, o hasta que esté suave y no más pegajosa.", "Coloque la masa en un recipiente limpio, cúbrala con una toalla de té limpia y déjela durante 30 minutos.", "Precalentar el horno a 210C / 410F / Gas 6½.", "Pese la masa y corte en 12 pedazos iguales. Rodar en bolas y dejar reposar, tapado, durante 10 minutos.", "Usando un rodillo, enrolle cada bola de masa en un círculo de 8cm / 3 pulgadas. Doble un tercio del círculo en el centro y presione con su pulgar para pegarlo hacia abajo. Luego dobla el tercio opuesto del círculo en el centro. Doble esta forma por la mitad longitudinalmente para formar un cilindro. Gire suavemente para sellar los lados, presionando ligeramente los extremos para que queden ligeramente puntiagudos. Coloque los panecillos, con la costura hacia abajo, en bandejas para hornear forradas con pergamino para hornear.", "Cubra la masa con film transparente y deje que se levante durante 30 minutos.", "Cepille cada bollo con huevo y, con unas tijeras, recorte una forma de zig-zag en la parte superior. Espolvorea con azúcar molida y hornea por 10-12 minutos."], "url": "www_bbc_co_uk_food_recipes_pain_au_lait_22273", "title": "Pan de leche", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "30 g / 1 oz de azúcar en polvo", "Leche 250ml / 9fl oz", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "2 cucharadas de ron, más extra para flambear", "2 rebanadas gruesas de brioche", "100g / 3½oz de azúcar moreno", "½ piña, pelada y cortada en cubos", "60 g / 2¼ oz de mantequilla", "200ml / 7fl oz crema batida", "50g / 1¾oz de azúcar glas", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "hilo de caramelo (opcional), para servir"], "method": ["Para el dolor perdu y la piña, mezcle los huevos, el azúcar impalpable, la leche, la vainilla y el ron en un tazón grande. Agregue el brioche y déjelo en remojo.", "Calentar el azúcar en una sartén hasta que se derrita y ligeramente coloreado. Agregue la piña y un poco de ron extra. Deje que se caliente brevemente, luego incline lentamente la sartén hacia la llama o enciéndala con una cerilla. Deje que las llamas se enciendan y luego se apaguen (PRECAUCIÓN: tenga cuidado con las llamas y mantenga la cara lejos de la bandeja). Agregue la mantequilla y cocine durante 2 minutos.", "Para el relleno, batir la crema, el azúcar glas y la vainilla juntos hasta que se formen picos suaves cuando se quita la batidora.", "Coloque el brioche empapado en una sartén caliente y cocine durante 2 minutos por cada lado hasta que se dore.", "Coloque el brioche en platos para servir, cubra con la piña caramelizada, agregue una cucharada de la crema batida y cúbralo con algodón de azúcar."], "url": "www_bbc_co_uk_food_recipes_pain_perdu_caramelised_35024", "title": "Dolor perdu, piña caramelizada y algodón de azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 naranja, solo jugo", "1 vaina de vainilla, solo semillas", "150 g / 5½ oz de azúcar en polvo", "2 melocotones blancos, sin hueso y cortados en cuñas", "Frambuesas 150g / 5½ oz", "3 huevos de gallinas camperas y 1 yema de corral, batidos", "75g / 2½oz de mantequilla salada", "2 rebanadas de pan de frutas o brioche", "1-2 gotas de esencia de almendra", "4 yemas de huevo de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "3 cucharadas de ron oscuro"], "method": ["Caliente el jugo de naranja, la mitad de la vaina de vainilla y la mayor parte del azúcar en una cacerola para hacer un jarabe. Agregue los melocotones, retire del fuego después de unos minutos y agregue las frambuesas. Dejar de lado.", "Para hacer el sabayon, coloque un recipiente de vidrio sobre una cacerola de agua a fuego lento. Agregue todos los ingredientes y bata continuamente, hasta que estén pálidos y espesos. Retire el tazón del fuego y bata la mezcla hasta que se enfríe.", "Para hacer el dolor perdu, mezcle los huevos y la yema de huevo con la otra mitad de las semillas de vainilla. Agregue las rebanadas de pan y remoje durante 2 minutos.", "Derretir la mantequilla en una sartén grande. Cuando haga espuma, agregue el pan remojado y fría hasta dorar por ambos lados. Espolvorear con azúcar", "Cubra el perdu de dolor con las frutas y la cuchara sobre el sabayon. Esmaltar con soplete y servir."], "url": "www_bbc_co_uk_food_recipes_pain_perdu_with_roasted_54564", "title": "Dolor perdu con frutas tostadas y sabayón de almendras glaseadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "5 cucharadas / 75 ml de crema doble", "1 cucharada de azúcar en polvo", "1 pastel de té listo para usar, rebanado horizontalmente en tres", "1 cucharada de mantequilla", "Albaricoques enlatados 110g / 4oz, escurridos", "3 cucharadas de mermelada", "1 cucharada de menta fresca picada"], "method": ["Batir los huevos, la crema y el azúcar juntos para formar una masa y sumergir los trozos de teacake en la masa hasta que estén bien cubiertos.", "Calentar la mantequilla en una sartén antiadherente y freír el pan en cada lado durante 2-3 minutos, o hasta que esté dorado por ambos lados.", "Coloque los albaricoques y la mermelada en una sartén separada y caliente hasta que la mermelada se derrita. Revuelva en la menta.", "Para servir, apilar las rebanadas de pastel de té fritas en un plato y cuchara sobre los albaricoques pegajosos."], "url": "www_bbc_co_uk_food_recipes_painperduwithstickya_86043", "title": "Dolor perdu con albaricoques pegajosos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "Jengibre fresco de la raíz de 2.5cm / 1in, pelado, picado", "1 chili rojo pequeño, picado", "1 lima, ralladura y jugo", "1 diente de ajo, pelado, aplastado", "pellizcar canela molida", "pizca de cilantro molido", "225g / 8oz de azúcar moreno claro y suave", "225g / 8fl oz de vinagre de sidra", "3 mangos, piedras removidas, peladas, cortadas en cubitos", "2 cebollas, peladas, en rodajas", "1 cabeza de brócoli, cortada en florecillas", "½ cabeza de coliflor, cortada en florecillas", "200 g / 7 oz de harina de garbanzo (harina de garbanzo)", "1 chile rojo pequeño, finamente picado", "1 cucharadita de cúrcuma molida", "1 cucharadita de pimienta de cayena", "sal y pimienta negra recién molida", "100-175ml / 3½-6fl oz de agua helada", "aceite vegetal, para freír", "yogur natural, para servir (opcional)"], "method": ["Para la salsa picante, caliente dos cucharadas de aceite vegetal en una sartén a fuego medio. Agregue el jengibre, el chile, la ralladura de lima y el ajo y fría por 3-4 minutos, o hasta que se ablanden.", "Agregue la canela molida, el cilantro molido, el azúcar, el vinagre de sidra, el jugo de lima y los mangos. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 20-30 minutos, o hasta que la mezcla se haya reducido y tenga la consistencia de mermelada. (NB: El chutney hace el doble de la cantidad necesaria para esta receta. El chutney restante se puede conservar en frascos esterilizados en la nevera durante hasta 3 semanas).", "Mientras tanto, para la pakora, hierva las rodajas de cebolla en una sartén de agua con sal durante 2-3 minutos. Agregue las florecillas de brócoli y coliflor y continúe hirviendo durante 1-2 minutos, o hasta que las cebollas estén tiernas. Escurrir bien y dejar reposar.", "Para la mezcla, mezcle la harina, el chile, la cúrcuma molida, la pimienta de cayena y el condimento en un tazón hasta que estén bien combinados. Poco a poco agregue el agua en una corriente delgada, batiendo continuamente, hasta que se forme una pasta espesa. (Nota: es posible que no necesite usar toda el agua).", "Caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja los floretes de coliflor blanqueados y el brócoli en la mezcla, luego baje las cucharadas de la cebolla en rodajas en la masa.", "Con cuidado, baje las verduras maltratadas en el aceite caliente en lotes y fría durante 4-5 minutos, o hasta que estén crujientes y doradas. Retirar del fuego con una cuchara ranurada y dejar a un lado para escurrir sobre papel de cocina. Repita el proceso con las verduras rebozadas restantes.", "Para servir, divida la pakora entre cuatro cestas de servicio. Sirva el yogur (si está usando) y el chutney de mango en los tazones para mojar al lado."], "url": "www_bbc_co_uk_food_recipes_pakorawithmangochutn_92807", "title": "Pakora con chutney de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["140 g / 5 oz de hojaldre laminado", "25 g / 1 oz de azúcar en polvo", "1 cucharadita de canela molida", "50ml / 2fl oz de crema doble, batida", "1 naranja, cortada en cuñas, para servir"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Desenrolle la masa y cepille con agua. Mezcle el azúcar y la canela en un tazón, luego espolvoree sobre la masa para cubrir ligeramente. Doble en ambos extremos largos de la masa para que se encuentren en el medio. Cepille con más agua y espolvoree con más cantidad de la mezcla de azúcar. Dobla la masa una vez más y corta 1 cm / ½ en rodajas y colócala en una bandeja para hornear.", "Coloque en el horno y hornee durante diez minutos o hasta que estén cocidos. Sirva con crema batida y naranjas."], "url": "www_bbc_co_uk_food_recipes_palmiers_83940", "title": "palmiers", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de pan blanco 350g / 12oz", "150 g / 5½ oz de harina de centeno", "7 g de levadura instantánea seca (1 sobre)", "1 cucharadita de azúcar", "1 cucharadita de sal", "1 cucharada de aceite o mantequilla", "300ml / 10 fl oz de leche, calentada", "2 dientes de ajo, aplastados", "25g / 1oz de mantequilla o aceite", "sal"], "method": ["Si usa un mezclador de pie, coloque el gancho de masa. Coloque todos los ingredientes secos, mezcle bien la levadura antes de agregar la sal y luego agregue la mantequilla. Arranque el motor y gradualmente agregue toda la leche hasta que tenga una masa. Si tu masa todavía está un poco seca agrega un poco de agua. Amase con el gancho de masa durante 5 minutos. Cubra con un paño húmedo y deje que un lugar caliente se eleve hasta que duplique su tamaño, esto tomará al menos una hora.", "Si está haciendo esto a mano, coloque los ingredientes secos en un tazón grande y mezcle. Agregue la mantequilla y combine. Haga un pozo en el centro e incorpore gradualmente toda la leche, tomando harina de los lados sobre la marcha. Cuando tenga algo parecido a una masa, amase hasta que quede suave. Deja crecer como antes.", "Cuando haya levantado el pan, retire la masa y córtela en 8 pedazos. Amasar cada pieza y formar una bola apretada (metiendo la masa debajo mientras la gira). Espolvoree una bandeja para hornear con un poco de harina y coloque las bolas de masa en la bandeja, una en el centro, las otras colocadas alrededor, ligeramente separadas, como una flor. Cubra los panecillos con un paño húmedo y deje que se levante nuevamente.", "Precalentar el horno a su configuración más alta.", "Cuando los panecillos están bien levantados y apenas se están tocando, están listos para hornear. Coloque en el horno e inmediatamente reduzca la temperatura a 200 ° C / 180 ° Ventilador / Gas 6. Hornee por unos 20 minutos.", "Mientras tanto, haz el topping. Mash el ajo, la mantequilla y la sal juntos. Ponga en una sartén y derrita muy suavemente, no desea que la mantequilla o el ajo se doren. Cuando los panecillos estén fuera del horno, extienda la mezcla sobre los panecillos mientras aún estén calientes."], "url": "www_bbc_co_uk_food_recipes_pampushki_baltic_buns_10557", "title": "Pampushki (bollos bálticos)", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 8 panecillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva, más extra para lloviznar", "2 cebollas, peladas, una en rodajas y la otra aproximadamente picada", "3 dientes de ajo, pelados, dos finamente picados y el tercero en rodajas finas", "1 pimiento rojo grande, sin semillas, picado", "4 tomates grandes, toscamente picados", "3 cucharadas de perejil de flatleaf fresco picado", "2 ramitas de orégano fresco, picado", "6 muslos de pollo deshuesados ​​y sin piel, cortados en pedazos del tamaño de un bocado", "sal marina y pimienta negra recién molida", "1 cucharadita de pimentón ahumado", "125g / 4½oz de chorizo ​​para cocinar, picado", "400g / 14oz de arroz de grano corto español, como Calasparra", "pellizcar hilos de azafrán", "150ml / 5fl oz de jerez seco", "1 litro / 2 pintas de caldo de verduras calientes", "200g / 7oz de guisantes frescos", "1 limón en conserva, cortado en cuñas"], "method": ["Caliente dos cucharadas de aceite de oliva en una sartén grande o en una paella. Agregue la cebolla en rodajas, los dos dientes de ajo finamente picado y el pimiento rojo picado. Freír suavemente durante 5-6 minutos a fuego medio, o hasta que las cebollas estén blandas pero no coloreadas.", "Coloque los tomates, el perejil y el orégano en un recipiente y mezcle bien para combinar.", "Sazonar los muslos de pollo con sal marina y pimienta negra recién molida y frotar con el pimentón ahumado. Caliente el aceite de oliva restante en una sartén y fría el pollo durante 2-3 minutos por cada lado, o hasta que se dore por todas partes. Transfiera el pollo a un tazón, junto con cualquier zumo de sartén.", "Regrese la paellera al fuego y agregue la cebolla picada, el ajo finamente cortado y el chorizo ​​picado. Cocine por 3-4 minutos, o hasta que el chorizo ​​se dore.", "Agregue el arroz a la sartén junto con el azafrán y revuelva para cubrir con aceite, luego agregue las piezas de pollo. Vierta el jerez y revuelva una vez, luego deje burbujear por 2-3 minutos hasta que la mayoría del líquido se haya evaporado. Vierta el caldo de verduras y baje el fuego a fuego lento. Cubra la olla con una tapa y cocine durante 20 minutos, revolviendo una o dos veces durante la cocción, hasta que se haya absorbido todo el caldo y el arroz esté tierno.", "Espolvoree los guisantes frescos sobre la paella, luego cubra con los tomates preparados, el orégano y el perejil. Apague el fuego y cubra con una tapa durante 2-3 minutos.", "Para servir, esponje la paella con un tenedor y una cuchara en tazones para servir, con una cuña de limón en conserva para adornar."], "url": "www_bbc_co_uk_food_recipes_paella_92222", "title": "Paella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]