[{"ingredients": ["Lentejas Puy de 110g / 4oz", "4 hojas sabias", "1 diente de ajo", "½ limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida, al gusto", "4 hojas grandes de acelga, cortadas en rodajas de 1cm / ½ pulgada de grosor", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "½ cucharadita de hojuelas de chile seco", "Rebanadas gruesas de 4 x 1 cm / ½ pulgada de hígado de ternera", "50g / 2oz de mantequilla sin sal", "8 hojas de salvia", "8 rebanadas de panceta ahumada", "4 cucharadas de vinagre balsámico", "4 cucharadas de crema fresca"], "method": ["Coloque las lentejas, la salvia y un diente de ajo en una sartén y cúbralo con agua.", "Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 30 minutos hasta que las lentejas estén tiernas. Drene y regrese a la sartén.", "Sazone al gusto con sal y pimienta negra recién molida, un chorrito de jugo de limón y aceite de oliva. Mantenga caliente hasta que sea necesario.", "Para la acelga, llevar a hervir otra sartén de agua con sal. Agregue la acelga y cocine durante 1-2 minutos hasta que estén tiernos. Escurrir y apartar.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva, el ajo, el chile y la acelga. Revuelva-fríe por un minuto.", "Para el hígado, caliente una sartén grande, agregue la mantequilla, la panceta y la salvia y cocine por dos minutos hasta que estén crujientes.", "Agregue el hígado y cocine por un minuto más en cada lado. Retirar de la sartén y colocar en platos para servir.", "Para hacer la salsa balsámica, escurra el exceso de grasa en la sartén y vuelva al fuego. Agregue el vinagre balsámico y la crème fraîche y cocine por un minuto, batiendo para combinar.", "Para servir, agregue la acelga estofada a las placas, luego cubra cada plato con una cucharada de lentejas.", "Cuchara sobre la salsa balsámica."], "url": "www_bbc_co_uk_food_recipes_fegatodivitellopanfr_86521", "title": "Hígado de ternera (hígado de ternera frito)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, más extra para engrasar", "3 bulbos grandes de hinojo", "3 cebollas", "600g / 1lb 6oz de papas grandes, peladas", "2 dientes de ajo, aplastados", "50 g / 1¾oz de queso parmesano, rallado (o equivalente vegetariano)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6 (180 ventiladores). Mantequilla el plato de servir.", "Recorte las partes superiores del hinojo y corte cada bombilla por la mitad a través de la raíz, luego corte cada mitad longitudinalmente en tres cuñas. Cortar las cebollas en seis cuñas también de manera similar.", "Corta las papas en trozos del mismo tamaño que las cuñas de hinojo.", "Hervir el hinojo y las cebollas en una sartén grande con agua con sal durante unos cinco minutos, luego agregar las papas y hervir durante otros cinco minutos, o hasta que las papas y el hinojo estén tiernos. Escurrir bien.", "Ponga la mantequilla de 50g / 1¾oz y el ajo en la misma sartén grande a fuego lento hasta que se derrita. Regrese las papas y el hinojo a la mantequilla, revuelva hasta que esté cubierto y luego hágalo en la fuente del horno. Espolvorear con el parmesano. Hornee por 30-40 minutos o hasta que esté caliente."], "url": "www_bbc_co_uk_food_recipes_fennel_and_potato_gratin_29963", "title": "Gratinado de hinojo y patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_and_potato_gratin_29963_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 bulbos de hinojo, rallados", "½ repollo rojo pequeño, rallado", "4 remolachas, peladas y ralladas", "4 cebolletas, picadas", "6 cucharadas de crema agria", "3 cucharadas de semillas de nigella"], "method": ["Combina todas las verduras en un tazón con la crema agria y las semillas de nigella.", "Revuelva y sirva."], "url": "www_bbc_co_uk_food_recipes_fennel_beetroot_slaw_05158", "title": "Ensalada de remolacha hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_beetroot_slaw_05158_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "285 g / 10 oz de azúcar en polvo de oro", "½ cucharadita de polvo de hornear", "1 cucharadita de semillas de hinojo, trituradas", "100 g / 3½ oz de mantequilla sin sal, en cubos, más extra para engrasar", "50 g / 1¾oz de arándanos secos, toscamente picados", "1 huevo mediano de granja, ligeramente golpeado", "2 cucharadas de leche entera", "250 g / 9 oz de arándanos frescos", "1 cucharada de azúcar glas", "exprimir jugo de limón"], "method": ["Para hacer los pasteles galeses, mezcle la harina, 85 g / 3 oz del azúcar impalpable, el polvo de hornear y las semillas de hinojo trituradas en un bol. Agregue la mantequilla en cubos y use las puntas de los dedos para frotarla hasta que la mezcla se asemeje a migas de pan. Agregue los arándanos y mezcle para combinar.", "Haz un pozo en el centro y agrega el huevo. Use un cuchillo de mesa para mezclar el huevo, luego agregue la leche y junte la masa con sus manos.", "Polvore una superficie de trabajo limpia con harina y extienda la masa a 1cm / ½ pulgada de espesor. Recorte las rondas con un cortador redondo de 4 cm / 1½ pulgadas, luego tome todas las sobras, agrúpelas y vuelva a enrollarlas. Recorta más rondas y sigue haciendo esto hasta que hayas agotado toda la masa. Coloque los 200 g restantes de azúcar en polvo en un bol.", "Ligeramente cepille una sartén antiadherente mediana con un poco de mantequilla derretida o rocíe con aceite. Coloque un lote de pasteles galés en la bandeja bien espaciados, y cocine a fuego lento durante 3 minutos. Voltéelos y cocínelos por otros 3 minutos, luego quite el fuego e inmediatamente sumerja cada torta de galés en el tazón de azúcar. Dejar de lado. Haga lo mismo con los pasteles restantes de Gales: cocínelos, cúbralos con azúcar y déjelos a un lado.", "Para hacer el coulis, puré los arándanos en un procesador de alimentos con el azúcar glas y el jugo de limón hasta que se descompongan. Luego empuja a través de un tamiz para eliminar las semillas. Sirva el coulis en un tazón pequeño junto con los pasteles de Gales."], "url": "www_bbc_co_uk_food_recipes_fennel_welsh_cakes_with_35924", "title": "Pasteles de hinojo galés con un coulis de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_welsh_cakes_with_35924_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cucharadita de semillas enteras de hinojo", "2 g / ¼ oz de levadura seca", "200ml / 7fl oz de agua tibia", "3 cucharadas de aceite de oliva", "Harina de pan fuerte 225g / 8oz", "4 chalotes, pelados y en rodajas a lo largo", "7 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cabeza de ajo", "4 bulbos de hinojo, recortado", "120g / 4oz de queso de cabra", "50g / 2oz de ricotta", "un poco de agua, para sellar", "1 huevo, batido, para cepillar"], "method": ["Precaliente el horno a 220C / 425F / Gas 7.", "Para la masa, caliente una sartén pequeña y agregue las semillas de hinojo. Calienta cuidadosamente las semillas (pueden explotar) hasta que liberen su aroma. No los dejes arder. Retire las semillas de la sartén y aplaste en una mano y mortero mientras aún esté caliente.", "Agregue la levadura seca al agua tibia para activarla.", "Agregue el aceite de oliva a la harina y mezcle la levadura y la mezcla de agua y las semillas de hinojo. Junte los ingredientes en un bol para formar una masa. Sobre una superficie plana, amase la masa durante aproximadamente dos minutos, agregando un poco más de harina a la superficie de amasamiento si la masa se siente pegajosa y humedezca las manos un poco mientras amasa si se siente seco e inalterable. Coloque la masa en un recipiente, cúbrala con un paño húmedo y colóquela a un lado.", "Para el relleno, mezcle los chalotes en un recipiente con dos cucharadas de aceite de oliva y sazone con sal y pimienta negra recién molida. Extiéndalo en una sola capa en una bandeja para hornear. Separe la cabeza de ajo en clavos separados y mezcle en el mismo tazón pequeño con dos cucharadas de aceite de oliva. Sazonar con sal y pimienta negra recién molida. Coloque los dientes de ajo sin pelar en la bandeja de horno. Hornee en el horno por unos 20 minutos. Los chalotes deben ponerse marrones en los bordes y secarse. El ajo debe ser de un color dorado pálido.", "Corta los bulbos de hinojo por la mitad, luego corta algo del corazón. Cortar el hinojo finamente cruzado. Caliente las 3 cucharadas restantes de aceite de oliva en una cacerola, agregue el hinojo y cocine a fuego medio, revolviendo con frecuencia, hasta que estén suaves, doradas y con un volumen reducido.", "Cuando el ajo y los chalotes estén cocidos, retírelos de la bandeja de hornear y deje que se enfríen. Corta bastante los chalotes. Pele el ajo y agregue la carne suave del interior de los dientes, junto con los chalotes picados, al hinojo. Cuando la mezcla se haya enfriado aún más, desmenuce el queso de cabra y la ricota en la mezcla de hinojo.", "Extienda la masa finamente sobre una superficie de trabajo enharinada. Recorta cuatro rondas de 16 cm / 6.5 pulgadas. Divida la mezcla de hinojo y queso entre las cuatro rondas de repostería. Coloque el relleno en el medio de cada uno y doble la masa por la mitad, sellando los bordes con un poco de agua.", "Coloque las empanadas en una bandeja para hornear y colóquelas en el horno. Hornea por unos 20-30 minutos. Si las empanadas se oscurecen demasiado rápido, baje el fuego ligeramente y aumente el tiempo de cocción. Hacia el final de la cocción, cepille la superficie de cada pasty con el huevo batido y cocine por unos últimos cinco minutos. Las empanadas deben ser un dorado encantador. Retire del horno, deje enfriar un poco, y sirva."], "url": "www_bbc_co_uk_food_recipes_fennelandgoatscheese_80703", "title": "Hinojo y queso de cabra", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 peces enteros (como lubina, besugo, trucha o salmonete), aprox. 350-450 g / 12oz-1lb cada uno, eviscerado y a escala", "1 limón grande", "1 naranja grande", "1 bombilla mediana de hinojo, aproximadamente picada", "4 dientes de ajo, pelados", "1 cebolla roja mediana, aproximadamente picada", "3 cucharadas de alcaparras, escurridas", "2 grandes puñados de hierbas frescas mezcladas: perejil, eneldo, estragón, albahaca", "aceite de oliva virgen extra", "sal marina escamada y pimienta negra recién molida", "ensalada y pan crujiente, para servir", "Necesitarás 12-16 longitudes de hilo de unos 15 cm / 6 pulgadas de largo, empapadas en agua durante 1 hora."], "method": ["Lave el pescado por dentro y por fuera, luego seque con papel de cocina.", "Rallar finamente la mitad de la ralladura del limón y la naranja, luego cortar la fruta finamente. Coloque la ralladura rallada en un procesador de alimentos con el hinojo, el ajo, la cebolla, las alcaparras, las hierbas, un buen chorro de aceite de oliva y el condimento, y blitz hasta que esté finamente picado. Empaque la mezcla en el pescado y dobla unas rodajas de limón y naranja alrededor para sostener el relleno. Ate 3-4 pedazos de hilo alrededor del pescado para sostener las rodajas de naranja y limón en su lugar. Corta cualquier cadena sobrante y coloca el pescado en un plato grande.", "Rocíe el exterior del pescado con aceite de oliva y sazone con sal y pimienta. Ahora es mejor dejarlo a temperatura ambiente durante aproximadamente 45 minutos, o en la nevera durante hasta 4 horas, para permitir que los sabores de relleno infundan el pescado. Si tienes poco tiempo puedes ponerlo directamente en la barbacoa.", "La manera más fácil de cocinar un pescado entero es colocarlo en rejillas de pescado de un solo cable con asas, lo que facilita su volteo durante la cocción. Coloque sobre brasas medio calientes durante 15-20 minutos, girando a la mitad.", "Servir enseguida con una deliciosa ensalada verde o tomate y pan crujiente para limpiar cualquier zumo de pescado."], "url": "www_bbc_co_uk_food_recipes_fennelandherbbarbecu_67598", "title": "Hinojo y hierba a la parrilla de pescado entero", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelandherbbarbecu_67598_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "½ cebolla, finamente rebanada", "½ bulbo de hinojo, cortado y cortado", "2 puerros tiernos, cortados y picados", "1 diente de ajo, finamente picado", "200 ml / 7 fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "75ml / 2½ fl oz crema doble", "2 cucharadas de cebolletas frescas picadas", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "method": ["Calentar la mantequilla en una sartén, agregar la cebolla, el hinojo y los puerros y freír suavemente hasta que se suavice un poco. Agregue el ajo y fría por un minuto.", "Añadir el caldo y hervirlo. Reduzca el fuego y cocine a fuego lento durante 6-8 minutos, o hasta que los vegetales estén tiernos. Retirar del fuego y dejar enfriar ligeramente.", "Vierta la sopa en una licuadora. Agregue la crema, la mitad de las cebolletas y el jugo de limón. Sazonar, al gusto, con sal y pimienta negra recién molida y licuar hasta que quede suave.", "Para servir, vierta la sopa en un bol y decore con el resto del cebollín."], "url": "www_bbc_co_uk_food_recipes_fennelandleeksoup_85992", "title": "Sopa de hinojo y puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de copos brisa 225g / 8oz", "Setas de 175g / 6oz, idealmente mezcladas, como tapas marrones, shiitake, ostras, recortadas cuando sea necesario", "1 cebolla roja, cortada en 8 cuñas", "1 bulbo de hinojo, cortado en rodajas de 1cm / 0.5in, escaldado y escurrido.", "6 dientes de ajo, ligeramente triturados en sus pieles", "aceite de oliva ligero", "100 ml / 3½ fl oz crema batida", "100g / 4oz de mantequilla sin sal, refrigerada y en cubos", "1 cucharada de jugo de limón", "1 cucharada de cebolletas frescas cortadas", "1 cucharada de perejil picado", "un puñado de ensalada herby"], "method": ["Engrase 4 x 10 cm / 4 en latas tartaletas. Extienda la masa hasta aproximadamente 3 mm / 1/8 de grosor y úsela para alinear las latas de tartaletas preparadas.", "Enfríe las latas revestidas durante al menos 30 minutos en la nevera.", "Precalentar el horno a 180C / 375F / Gas 4.", "Cubra la masa con papel resistente a la grasa, rellene con alubias y hornee por 10-15 minutos, hasta que estén cocidas y doradas. Retire del horno. Retire el papel y los frijoles y déjelos a un lado.", "Encienda el horno hasta 220C / 425F / Gas 7.", "Coloque todas las verduras y el ajo en una bandeja para hornear, rocíe con aceite de oliva y agite suavemente. Sazonar con sal y pimienta y hornear en un horno caliente durante veinte minutos, o hasta que estén ligeramente dorados.", "Para hacer la salsa, llevar la crema a ebullición en una sartén pequeña. Agregue la mantequilla y agregue el jugo de limón, las hierbas y la sal y la pimienta al gusto.", "Toma dos dientes de ajo de las verduras, saca el ajo asado de la piel y aplástalo con la punta de un cuchillo. Agregue este puré crudo a la mezcla de crema.", "Para servir, llena cada tartaleta precocida con la mezcla de vegetales.", "Caliente las tartas durante uno o dos minutos en el horno, y luego presente en platos calientes, rodeados con un poco de salsa.", "Sirve con ensalada herby."], "url": "www_bbc_co_uk_food_recipes_fennelandmushroomtar_71555", "title": "Tartaletas de hinojo y champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelandmushroomtar_71555_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 bulbos medianos de hinojo", "1½ naranjas", "½ limón, solo jugo", "aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Corta la parte superior de las bombillas de hinojo y corta finamente en anillos. Coloque en un tazón grande.", "Corte la piel y la médula de una naranja y corte en círculos de 1cm / ½ pulgada de grosor. Agregar al hinojo.", "Prepare el aderezo para ensalada mezclando el jugo de naranja con la mitad de naranja, el jugo de limón, una cantidad igual de aceite de oliva y sal y pimienta negra recién molida.", "Rocíe el hinojo y la naranja y sirva."], "url": "www_bbc_co_uk_food_recipes_fennelandorangesalad_82372", "title": "Ensalada de hinojo y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 11fl oz de caldo de verduras", "½ cucharadita de hilos de azafrán", "2 cucharadas de pastis", "50g / 2oz de mantequilla", "2 bulbos de hinojo con frondas verdes adjuntas, hinojo picado en 1cm / ½en piezas, frondas reservadas", "2 chalotes de plátano, pelados, finamente cortados en anillos", "150ml / 5fl oz de vino blanco seco", "sal y pimienta negra recién molida", "3 cucharadas de cebolletas frescas picadas", "aceite vegetal para freír", "2 cucharadas de harina de maíz", "2 cucharadas de agua con gas refrigerada", "hojas de hinojo reservadas de bulbos de hinojo (ver arriba)", "pizca de sal", "4 x 175g / 6oz trout darne", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 limón, solo jugo"], "method": ["Para el hinojo y el caldo de azafrán, hierva el caldo, el azafrán y el pastis.", "Mientras tanto, caliente la mitad de la mantequilla en una sartén y fría el hinojo y los chalotes a fuego lento durante 2 o 3 minutos, o hasta que se ablanden.", "Verter el vino blanco, llevar a ebullición y continuar cocinando hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la mezcla madre a la sartén y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 1-2 minutos. Agregue la mantequilla restante y sazone al gusto con sal y pimienta negra recién molida. Agregue las cebolletas y reserve.", "Para la tempura de fronda de hinojo, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Batir la harina de maíz y el agua con gas juntos en un tazón para formar una mezcla suave. Sumerja las hojas de hinojo en la mezcla, sacudiendo cualquier exceso, luego fría el aceite vegetal durante 20-30 segundos hasta que estén pálidas doradas y crujientes. (Haga esto por lotes si es necesario).", "Retirar del aceite con una cuchara ranurada y dejar a un lado para escurrir sobre papel de cocina. Sazonar, al gusto, con sal.", "Para las truchas darnes, sazone la trucha, al gusto, con sal y pimienta negra recién molida.", "Calentar la mantequilla y el aceite en una sartén y freír los trigos de la trucha por 2-3 minutos en cada lado, o hasta que estén cocidos.", "Retire los restos de trucha de la sartén y déjelos a un lado para que descanse. Exprime el jugo de limón, al gusto.", "Para servir, recaliente el hinojo y el caldo de azafrán, si es necesario, y cocine en cuatro cuencos de sopa poco profundos. Cubra cada uno con una trucha y un poco de tempura de fronda de hinojo."], "url": "www_bbc_co_uk_food_recipes_fennelandsaffronbrot_92949", "title": "Caldo de hinojo y azafrán con fritos de trucha a la sartén y tempura de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 yema de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "½ cucharadita de hojuelas de chile seco", "1 cucharadita de cebolletas frescas picadas", "50ml / 2fl oz de agua caliente", "200ml / 7fl oz de aceite vegetal", "sal y pimienta negra recién molida", "¾ bulbo de hinojo, en rodajas finas", "½ chalote de plátano, finamente cortado", "1 cucharada de perejil picado", "½ limón, solo jugo", "hoja fresca de perifollo para adornar", "sal y pimienta negra recién molida"], "method": ["Para hacer la mayonesa, coloca la yema, el vinagre, la mostaza, los copos de chile, el cebollín y el agua caliente en un procesador de alimentos y licúa.", "Mientras el procesador de alimentos está funcionando, agregue gradualmente el aceite vegetal en un flujo constante.", "Cuando se haya agregado todo el aceite vegetal, sazone con sal y pimienta negra recién molida.", "Para hacer la remoulade, coloque el hinojo, el chalote, el perejil y el jugo de limón en un tazón grande y mezcle bien.", "Agregue un poco de la mayonesa y mezcle una vez más para cubrir, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, espolvorear la remoulade en el centro de un plato y adornar con la hoja de perifollo."], "url": "www_bbc_co_uk_food_recipes_fennelremoulade_83624", "title": "Hinojo remoulade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Salchichas de luganega de 450 g / 1 libra (disponibles en tiendas de comestibles italianas o continentales especializadas), u otras bonitas chipolatas de cerdo con carne", "4 cucharadas de aceite de oliva virgen extra", "1 cebolla pequeña, cortada a la mitad y en rodajas finas", "2 dientes de ajo, en rodajas finas", "750g / 1½lb papas cerosas pequeñas, peladas y cortadas en cuartos", "½ limón, cáscara y jugo solo", "4 hojas frescas de laurel", "2 cucharadas de perejil fresco, picado", "sal y pimienta negra recién molida", "120ml / 4fl oz de agua"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Gire las salchichas en trozos de 7,5 cm / 3 pulgadas y sepárelos en salchichas individuales.", "Caliente una cucharada de aceite en una cazuela poco inflamable de 26 cm / 10 pulgadas. Agregue las salchichas y fría hasta que estén doradas por todas partes. Levantarlos en un plato y reservarlos.", "Agregue la cebolla, el ajo y otra cucharada de aceite a la cacerola y fría hasta que estén suaves y ligeramente dorados. Agregue las papas, las salchichas doradas, la ralladura de limón y el jugo, las hojas de laurel, la mitad del perejil picado, ½ cucharadita de sal y diez vueltas del molinillo de pimienta negra.", "Verter sobre el resto del aceite junto con el agua, cubrir bien con la tapa y hornear durante 30-40 minutos hasta que las papas estén tiernas.", "Retire la ralladura de limón y espolvoree con el resto del perejil antes de servir."], "url": "www_bbc_co_uk_food_recipes_fennelsausagesbraise_86774", "title": "Salchichas de hinojo estofadas con patatas al limón y hojas de laurel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelsausagesbraise_86774_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["80g / 2¾oz de harina común, tamizada", "70 g / 2½ oz de azúcar en polvo", "2 cucharadas de leche desnatada en polvo", "140ml / 5fl de leche en oz", "1 vaina de cardamomo marrón, se remueven las semillas y se muele hasta obtener un polvo en una mano de mortero", "1½ cucharadita de semillas de hinojo, molidas hasta obtener un polvo en una mano de mortero", "pizca de sal", "1 cucharada de almendras molidas", "2 cucharadas de mantequilla, derretida", "4 cucharadas de ghee o aceite vegetal, para freír"], "method": ["Mezcle la harina, el azúcar, la leche en polvo y entera, las especias, la sal, las almendras y la mantequilla derretida en un tazón. Déjalo reposar por diez minutos.", "Caliente el aceite o ghee en una sartén antiadherente y vierta cucharadas pequeñas de la mezcla en la sartén. Freír a fuego moderado durante aproximadamente 1-2 minutos, volteando una vez, hasta que se dore por ambos lados.", "Retire de la sartén y escurra sobre papel de cocina. Sirve mientras aún esté ligeramente tibio."], "url": "www_bbc_co_uk_food_recipes_fennelseeddropbiscui_86436", "title": "Galletas de gota de semillas de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennelseeddropbiscui_86436_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla", "½ chalota, finamente picada", "100g / 3½oz de patatas nuevas, peladas y picadas", "½ bulbo de hinojo grande, picado", "150ml / ¼ pinta de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "pequeño puñado de eneldo fresco, picado"], "method": ["Caliente la mantequilla en una sartén y fría la chalota hasta que esté blanda pero no coloreada.", "Agregue las papas nuevas y el hinojo y saltee durante 2-3 minutos.", "Añadir el caldo y hervirlo. Reduzca el fuego y cocine a fuego lento durante 8-10 minutos, o hasta que los vegetales estén tiernos. Sazonar, al gusto, con sal y pimienta negra recién molida y dejar enfriar un poco.", "Vierta la sopa en una licuadora, agregue el eneldo y mezcle hasta que quede suave. Si es necesario, vuelva a calentar suavemente la sopa antes de servirla.", "Para servir, vierta la sopa en un tazón de servir."], "url": "www_bbc_co_uk_food_recipes_fennelsoup_85861", "title": "Sopa de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 bulbo de hinojo, cortado en rebanadas gruesas de 1cm / ½ en pulgadas, hojas superiores reservadas para decorar", "1 naranja, solo jugo", "2 ramitas de tomillo fresco", "75ml / 3fl oz de caldo de verduras", "50 ml / 2 fl oz de agua", "75g / 3oz de azúcar en polvo", "20 g / oz de mantequilla", "200 g / 7 oz de hojaldre confeccionado, laminado a 5 mm / ¼ de espesor", "corales de 3 vieiras (ver abajo)", "55 ml / 2 fl oz de agua", "2 chalotes, finamente picados", "Vino Sauternes 90ml / 3½fl oz", "150g / 5oz de mantequilla fría, cortada en pedazos", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "6 vieiras zambullidas a mano, conchas eliminadas, corales separados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el hinojo, el jugo de naranja, el tomillo, el caldo de verduras y el agua en una sartén y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos, o hasta que el hinojo esté solo tierno. Escurra el hinojo, descarte el líquido de cocción y seque.", "Divida el azúcar entre dos bandejas pequeñas y caliéntelo suavemente sin removerlo hasta que el azúcar se caramelice y se ponga dorado. Retire del fuego, luego divida la mantequilla entre las dos bandejas y revuelva. Divida las rebanadas de hinojo entre las bandejas.", "Corta dos círculos de masa ligeramente más grandes que la circunferencia de las bandejas. Coloque la masa sobre el hinojo, presionando hacia abajo alrededor de los bordes para encerrar el relleno.", "Coloque en el horno y hornee durante 10-12 minutos, o hasta que la masa esté dorada y cocida.", "Para Sauternes beurre blanc, coloque tres de los corales de vieira en una licuadora con el agua y mezcle hasta que quede suave (puede congelar los tres corales restantes para su uso en otro plato, pero solo si las vieiras no se han congelado previamente).", "Coloque las chalotas, el puré de coral y los Sauternes en una sartén. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta reducir a la mitad.", "Batir la mantequilla, poco a poco, hasta que esté bien combinada, luego condimentar, al gusto, con sal y pimienta negra recién molida.", "Para las vieiras, caliente la mantequilla en una sartén hasta que forme espuma. Sazone las vieiras con sal y pimienta negra recién molida, luego coloque en la sartén y cocine en cada lado durante 1-2 minutos, o hasta que estén recién cocidos.", "Para servir, cuidadosamente gire las tarta tatins en platos para servir. Coloca tres vieiras en el centro de cada tarta tatin, luego coloca la beurre blanc sobre las vieiras y alrededor del borde. Cubra con una ramita de hinojo."], "url": "www_bbc_co_uk_food_recipes_fenneltartetatinwith_86660", "title": "Tarta tatin de hinojo con vieiras fritas y Sauternes beurre blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Nueces 50g / 2oz", "4 higos secos", "30g / 1oz de guindas", "30g / 1oz de arándanos", "30 g / 1 oz de semillas de calabaza", "1 cucharada de almendras molidas", "50g / 2oz de mantequilla", "100 g / 3½ oz de azúcar en polvo de oro", "2 cucharadas de jarabe de oro", "100 g / 3½ oz de avena porridge", "100 g / 3½ oz de avena", "100 g / 3½ oz de chocolate negro"], "method": ["Encienda el horno a 180C / 350F / Gas 4.", "Picar poco a poco las nueces y los higos, luego agregar a un procesador de alimentos junto con las guindas, los arándanos y la mitad de las semillas de calabaza. Agregue una cucharada de almendras molida y blitz juntos, pero no por mucho tiempo, dejando trozos grandes y agradables de nueces y fruta. Incline en un tazón grande junto con el resto de las semillas de calabaza.", "En una sartén, derrita la mantequilla con el azúcar y el jarabe dorado, tratando de no remover demasiado y permitiendo que se derrita gradualmente.", "Una vez derretido, mezcle la avena, la fruta y las nueces y distribuya la mezcla de manera uniforme en la bandeja del horno y hornee durante 25 minutos.", "Derrita el chocolate en un recipiente sobre el agua hirviendo a fuego lento. Cuando los flapjacks estén cocidos, córtelos en pequeños rectángulos y sumérjalos lo más lejos posible en el chocolate derretido.", "Dejar enfriar durante 20 minutos en la nevera y luego servir."], "url": "www_bbc_co_uk_food_recipes_festive_chocolate_94638", "title": "Flapjacks de chocolate festivos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 8 flapjacks", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/festive_chocolate_94638_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Linguine 200g / 7oz", "1 bulbo de hinojo", "1 chalote de plátano", "2 cucharadas de aceite de oliva", "15 hojas de albahaca", "100 g / 3½ oz de queso feta"], "method": ["Cocine la pasta en una sartén con agua salada hirviendo, de acuerdo con las instrucciones del paquete.", "Cortar el hinojo y la chalota, y freír en el aceite hasta que estén blandos.", "Rasga la albahaca sobre el hinojo y la chalota y desmorona en el queso feta.", "Cuando la pasta esté cocida, escurra y combine con la chalota y el hinojo."], "url": "www_bbc_co_uk_food_recipes_fennel_and_feta_linguini_59137", "title": "Hinojo y feta linguini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_and_feta_linguini_59137_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60 g / 2¼ oz de mantequilla, más extra para engrasar", "2 cucharadas de azúcar en polvo", "2 jarabe dorado apilado de tbsp", "4 cucharadas de harina normal", "1 cucharadita de jengibre molido", "1 cucharadita de brandy", "2 cucharadas de pistachos picados", "1 naranja, solo jugo", "1 lima, solo jugo", "1 limón, solo jugo", "1 mango, cortado en cubos", "4 clementinas, separadas en segmentos", "1 granada, solo semillas", "6 grosellas de cabo (physalis)"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Engrase dos bandejas para hornear con mantequilla.", "Para los brocheys, derrita la mantequilla con el azúcar y el sirope dorado en una cacerola. Tan pronto como comience a burbujear, agregue la harina, el jengibre, el brandy y los pistachos y revuelva hasta que estén bien combinados.", "Usando una cucharadita, coloque seis gotas de la mezcla en el molde de nogal. No es necesario aplanar, ya que se extenderán naturalmente.", "Hornee durante 10-12 minutos hasta que estén doradas. Deje que se enfríe en la bandeja de hornear durante cinco minutos y luego retírelos con una espátula. Póngalos en un rodillo para establecer.", "Para la ensalada de frutas, combine el jugo de naranja, lima y limón en un tazón grande.", "Agregue el mango y las clementinas, esparza sobre las semillas de granada y sirva con las brochetas de brandy y algunos physalis."], "url": "www_bbc_co_uk_food_recipes_festive_fruit_salad_with_97182", "title": "Ensalada festiva de frutas con broche de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/festive_fruit_salad_with_97182_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechos de pato, con la piel puesta", "sal y pimienta negra recién molida", "Anís de 2 estrellas", "1 ramita de canela", "2 dientes", "½ naranja, solo ralladura", "150ml / 5fl oz puerto", "110ml / 4fl oz de caldo de pollo fresco", "25g / 1oz de mantequilla", "4 rodajas de morcilla", "1 pera, pelada y cortada en cuñas", "500g / 1lb 2oz King Edward papas, peladas y cortadas en cubos", "pizca de sal", "50g / 2oz de mantequilla", "75ml / 3fl de leche en oz", "sal y pimienta negra recién molida", "110g / 4oz de panceta, cortada en cubos pequeños", "2 cucharadas de jarabe de arce", "½ repollo Savoy, finamente triturado", "sal y pimienta negra recién molida"], "method": ["Para el pato, marque un patrón de diamantes en la piel del pato y sazone ambos lados con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente y agregue los pechugas de pato, con la piel hacia abajo.", "Baje la temperatura a bajo y cocine por seis minutos en cada lado para el rosado (u ocho minutos en ambos lados para el bien hecho).", "Retire el pato de la sartén y descanse en un plato caliente, cubierto con papel de aluminio.", "Vierta la mayor parte del exceso de grasa de pato de la sartén y suba el fuego (la grasa de pato se puede reservar para asar las papas).", "Agregue el anís estrellado, la canela, los clavos de olor y la ralladura de naranja en la sartén y fría por un minuto.", "Agregue el puerto y cocine a fuego lento, revolviendo para eliminar los jugos de pato residuales de la sartén. Agregue el caldo de pollo y deje hervir durante tres minutos a fuego alto, hasta que la salsa se haya reducido y espesado.", "Sazonar con sal y pimienta negra recién molida, al gusto.", "Caliente una sartén por separado hasta que esté caliente y agregue la mantequilla, la morcilla y la pera y fría por 1-2 minutos por cada lado hasta que estén dorados. Mantenga caliente mientras prepara las papas.", "Para el puré, coloque las papas en una cacerola y cúbralas con agua, luego agregue una pizca de sal. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 15-18 minutos, hasta que estén tiernos.", "Drene las papas y regréselas a la sartén a fuego lento para eliminar el exceso de humedad.", "Usando un triturador de papas o ricer, machaque bien las papas. Doble la mantequilla y la leche y sazone con sal y pimienta negra recién molida, al gusto. Cubre para mantener el calor mientras preparas el repollo.", "Para el repollo, caliente una sartén hasta que esté caliente, agregue la panceta y cocine por dos minutos hasta que se dore.", "Agregue el jarabe de arce y revuelva para cubrir la panceta. Agregue el repollo y revuelva nuevamente. Cocine por 2-3 minutos, hasta que el repollo se haya marchitado. Sazonar con sal y pimienta negra recién molida, al gusto. Mantener caliente", "Para servir, esculpe el pato en rebanadas diagonales gruesas. Coloque el puré en cada plato y cubra con el pato. Coloque una pila de repollo al lado. Cubra el repollo con la morcilla y la pera y espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_festiveduckbreastwit_87820", "title": "Pechuga de pato festiva con panceta, col rizada y puré", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ onzas de mantequilla, ablandadas, más extra para engrasar", "100g / 3½ oz de harina de auto crianza", "100 g / 3½ oz de azúcar en polvo", "85g / 3oz de arándanos", "½ naranja, solo jugo", "2 huevos de gallinas camperas", "30g / 1oz de arándanos", "1 naranja, jugo y ralladura solamente", "1 cucharada de miel", "crema doble, para servir"], "method": ["Para la esponja, coloque todos los ingredientes de la esponja en un procesador de alimentos y mezcle brevemente hasta que quede suave.", "Vierta la mezcla en un recipiente de pudín engrasado de 570 ml / 1 pinta. Cubra con película adhesiva y el microondas en alto durante cinco minutos, o hasta que esté bien levantado y elástico al tacto.", "Para la corona de arándano, coloque los arándanos, el jugo de naranja y la ralladura y la miel en una sartén pequeña y cocine a fuego lento durante cinco minutos.", "Para servir, coloca la esponja en un plato. Vierta sobre los arándanos y sirva con crema doble."], "url": "www_bbc_co_uk_food_recipes_festivespongewithcra_87782", "title": "Esponja festiva con corona de arándano y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]