[{"isVegetarian": false, "title": "Pan-fried salmon with a creamy sorrel sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwithac_74711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz salmon fillets (skin off)", "50ml/1¾fl oz clarified butter (butter which has been slowly heated and the milk solids removed)", "50ml/1¾fl oz olive oil", "1 small shallot finely chopped ", "400ml/14fl oz fish stock", "150ml/¼ pint vermouth or dry white wine", "200ml/7fl oz double cream", "salt and freshly ground black pepper", "½ lemon, juice only", "bunch of sorrel leaves, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, place the shallot in a pan along with the stock and the vermouth.", "Bring to the boil and reduce by half.", "Add the cream and season with salt and black pepper and lemon juice.", "At the last minute, throw in the torn sorrel.", "For the fish, in a non-stick pan, heat the clarified butter and the oil.", "Sear the fish on one side for 3-4 minutes, then set aside. ", "When ready to serve, season the top side with salt and pepper. ", "Then flip the salmon and cook on the side for a few seconds over a medium heat.", "To serve, place the sorrel sauce onto a plate and place the salmon on top."]}, {"isVegetarian": false, "title": "Pan-fried salmon with aster tripolium and scallop broth", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwithas_89102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz salmon fillet, cut into thin slices", "salt and freshly ground black pepper", "75g/3oz butter", "8 scallops, cleaned, corals separated from white meat, white meat thinly sliced", "200g/7oz aster tripolium (a salt marsh plant occasionally available at fishmongers); you can substitute samphire if unavailable", "150ml /5fl oz white wine", "200ml/7fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high. ", "For the salmon, place the slices of salmon onto a grill tray lined with aluminium foil. Season with salt and freshly ground black pepper. Set aside.", "For the aster tripolium and scallop broth, heat a frying pan until hot. Add half the butter and the slices of white scallop meat. Fry for one minute or until just cooked through (take care not to overcook the scallops or they will become tough and rubbery). Remove from the pan and set aside.", "Add the aster tripolium or samphire to the same pan used to cook the scallops and fry for 2-3 minutes. ", "Meanwhile, melt the remaining butter in a clean frying pan over a medium heat. Add the scallop corals and fry for one minute. Add the white wine and bring to a simmer. Simmer until the volume of liquid is reduced by half. ", "Add the cream and bring back to a simmer for one minute.", "Transfer the coral mixture to a blender and blend until smooth. Pour the blended coral cream into the pan containing the aster tripolium or samphire, add the slices of white scallop meat and gently heat through.", "Meanwhile, for the salmon, place the salmon strips under the grill for 2-3 minutes or until just cooked through.", "To serve, spoon the scallop broth onto each of four serving plates and top with the slices of salmon."]}, {"isVegetarian": false, "title": "Pan-fried salmon with a medley of roasted vegetables, French fries and champ sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwitham_85832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz salmon fillet", "1 tbsp olive oil", "salt and freshly ground black pepper ", "½ cauliflower, cut into florets, blanched", "½ red pepper, thinly sliced", "2 spring onions ", "1 tbsp olive oil", "salt and freshly ground black pepper ", "500ml/18fl oz vegetable oil", "1 potato, peeled and cut into thin sticks", "25g/1oz unsalted butter", "4 spring onions, chopped", "75ml/3fl oz double cream", "1 tbsp whole milk", "1 small potato, peeled, diced, boiled and drained", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the salmon, rub the salmon with the oil and season well with salt and freshly ground black pepper.", "Place into a hot frying pan and fry for 3-4 minutes on each side, or until cooked through.", "For the vegetables, place the vegetables onto a baking tray, drizzle with the oil and season well with salt and freshly ground black pepper. Transfer to the oven and roast for 15-20 minutes, or until golden-brown and cooked through.", "For the French fries, heat the oil in a deep heavy-bottomed pan, until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the potato sticks into the oil and deep-fry for 5-6 minutes, until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen paper.", "For the sauce, melt the butter in a pan and fry the spring onions until softened. ", "Add the cream and milk and heat to a gentle simmer.", "Add the cooked potato and season, to taste, with salt and freshly ground black pepper. Transfer to a food processor. Allow to cool for a few minutes, then blend until smooth.", "To serve, pour the sauce onto a warmed plate and place the salmon on top. Place the roasted vegetables around the edge of the plate and serve the French fries in a bowl alongside."]}, {"isVegetarian": false, "title": "Pan-fried salmon with tarragon and cream sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwithat_90018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tbsp butter", "85g/3oz salmon fillet", "salt and freshly ground black pepper", "150ml/5fl oz double cream", "150ml/5fl oz fish stock", "2 tbsp chopped fresh tarragon", "1 tbsp chopped fresh dill", "3 asparagus spears, blanched", "1 handful carrot batons, blanched"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, heat the olive oil and butter in a pan and season the fish with salt and freshly ground black pepper. Lay the fish skin-side down into the pan and fry for 4-5 minutes, then flip over and cook for a further 3-4 minutes, or until golden-brown all over and cooked to your liking. Set aside on a warm plate. ", "For the sauce, place the cream and fish stock into a pan and bring to a gentle simmer. Reduce the mixture for 4-5 minutes, or until thickened slightly, then stir in the fresh herbs.", "To serve, place the salmon onto a serving plate and arrange the blanched vegetables alongside. Pour the cream sauce around the edge of the plate."]}, {"isVegetarian": false, "title": "Pan-fried salmon with broccoli", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwithbr_88290", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panfriedsalmonwithbr_88290_16x9.jpg", "ingredients": ["25g/1oz butter", "150g/5½oz salmon fillet, skin on, thickly sliced", "½ lemon, juice only, plus lemon wedges to garnish", "small handful Tenderstem broccoli ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a frying pan. Add the salmon skin-side down, season with salt and freshly ground black pepper and squeeze over a little lemon juice. Fry for 2-3 minutes, then turn the salmon over and fry for a further 1-2 minutes, or until cooked through. Squeeze over a little more lemon juice and taste to check the seasoning. Remove from the pan and set aside.", "Place the broccoli into a pan of boiling salted water and boil for 3-4 minutes, or until al dente. Drain the broccoli.", "To serve, pile the broccoli onto a serving plate and top with the pan-fried salmon. Garnish with lemon wedges."]}, {"isVegetarian": false, "title": "Pan-fried salmon with parsley chips", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwithpa_88365", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "250g/9oz new potatoes, cut into thick chips", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley ", "100g/3½oz salmon fillet", "½ lemon, juice only", "lemon wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat two tablespoons of olive oil in an ovenproof frying pan and fry the new potato chips for 3-4 minutes, or until they start to colour.", "Season with salt and freshly ground black pepper and place in the oven to bake for about 8-10 minutes, or until golden-brown and tender. Remove from the oven and stir in the chopped parsley.", "Heat the remaining tablespoon of oil in a pan and sear the salmon on all sides. Add the lemon juice and season with salt and freshly ground black pepper. Continue frying, basting the salmon with the lemon juice, until cooked through.", "Serve the salmon on a bed of parsley chips, with a lemon wedge on the side."]}, {"isVegetarian": false, "title": "Pan-fried salmon with shaken peas", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonwithsh_74003", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 portions of salmon fillet", "olive oil", "salt and freshly ground black pepper", "25g/1oz butter", "1 small onion, finely chopped", "1 clove garlic, crushed", "350g/12oz peas", "1 tbsp horseradish cream", "dash of white wine", "100ml/3½fl oz double cream", "pinch of caster sugar", "½ lettuce, finely shredded", "fresh mint, chopped ", "salt and freshly ground black pepper", "new potatoes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First prepare the shaken peas. Melt the butter over a low heat, add the onion and garlic and soften without allowing them to colour.", "Add the peas, horseradish and wine and simmer. Add the cream.", "Add the lettuce and sugar. Stir and season.", "Simmer for a few minutes before adding chopped mint.", "Brush the salmon pieces with olive oil. Heat a frying pan until hot and pan-fry salmon until cooked.", "Place portion of peas in centre of plate and top with salmon. Serve with boiled, buttered, new potatoes."]}, {"isVegetarian": false, "title": "Pan-fried scallops with sauce vierge", "url": "www_bbc_co_uk_food_recipes_panfriedscallopswith_85086", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 shallots, finely chopped", "1 garlic clove, finely chopped", "200ml/7fl oz olive oil, plus a little extra for frying", "6 fresh basil leaves, finely chopped", "6 fresh coriander leaves, finely chopped", "3 black olives, stones removed, finely chopped", "50g/2oz ready-made egg noodles, cooked according to packet instructions", "6 fresh scallops"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 50ml/2fl oz oil in a frying pan over a low heat. Add the shallots and garlic and gently fry for 20 minutes, until they are caramelised, but not burnt.", "Take the pan off the heat and add the remaining olive oil, the basil, coriander and olives and fold together.", "Place the egg noodles into a bowl and pour in some of the sauce and toss the noodles to coat in the sauce.", "Heat a little olive oil in a clean frying pan over a high heat. Add the scallops and cook for one minute on each side, or until golden and just cooked through.", "To serve, place the egg noodles onto two plates.  Place three scallops onto each pile of noodles and drizzle the remaining sauce around."]}, {"isVegetarian": false, "title": "Pan-fried scallops with a garden salad and grain mustard vinaigrette", "url": "www_bbc_co_uk_food_recipes_panfriedscallopswith_86541", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp wholegrain mustard", "50ml/2fl oz white wine vinegar", "50ml/2fl oz water", "2 tbsp olive oil", "salt and ground white pepper, to taste ", "small handful fresh tarragon, chopped", "100g/3½oz mixed leaf salad ", "small bunch fresh mixed herbs (chervil, basil and chives), chopped roughly", "2 shallots, chopped finely", "olive oil, to cook ", "8 large or 12 small scallops removed from shells, cleaned and halved", "salt and freshly ground black pepper ", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the vinaigrette, place the mustard into a bowl and whisk in the vinegar, water and olive oil. Season with salt and white pepper. Use a hand blender to mix thoroughly until thickened and emulsified. Add the chopped tarragon.", "For the salad, place the mixed leaves, herbs and shallots into a bowl and gently toss. Dress the salad lightly with the vinaigrette just before cooking the scallops.", "For the scallops, heat a little olive oil in a non-stick pan over a medium heat. Season the scallops with salt and freshly ground black pepper before placing into the pan sliced-side down and cook until golden-brown, about 1-2 minutes. Turn the scallops over and reduce the heat. Cook for a further 1-3  minutes, depending on their size, or until just cooked. Take care not to overcook the scallops.", "Remove the scallops from the pan and place onto a tray lined with kitchen paper. Squeeze over the lemon juice.", "To serve, place a little of the dressed salad onto four plates. Place the scallops on and around the salad. Finish by drizzling some of the grain mustard vinaigrette around the plate."]}, {"isVegetarian": false, "title": "Pan-fried scallops with sautéed potatoes, roasted cherry tomatoes and mustard and herb dressing", "url": "www_bbc_co_uk_food_recipes_panfriedscallopswith_86992", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ large potato, peeled and sliced into rounds 1cm/½in thick", "salt and freshly ground black pepper ", "handful ripe cherry tomatoes", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp tomato ketchup", "1 tsp Dijon mustard", "½ tsp Tabasco sauce", "½ tsp Worcestershire sauce", "1 tbsp olive oil", "1 tsp chopped fresh tarragon", "2 tsp olive oil", "2 scallops, removed from their shells, cut in half across the middle to form 2 discs"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the sautéed potatoes, heat the olive oil in a non-stick frying pan and fry the potatoes, turning occasionally, until golden-brown and tender. Season, to taste, with salt and freshly ground black pepper and keep warm.", "For the roasted cherry tomatoes, place the cherry tomatoes on a baking sheet, drizzle with oil and season, to taste, with salt and freshly ground black pepper.", "Roast in the oven for 8-10 minutes, or until they are just starting to collapse.", "For the dressing, place the dressing ingredients into a small bowl and whisk together.", "For the scallops, heat the oil in a small non-stick frying pan and fry the scallop discs for 30 seconds on each side, or until just cooked through.", "To serve, place the potatoes onto a serving plate and top with the scallops and cherry tomatoes. Drizzle over the dressing."]}, {"isVegetarian": false, "title": "Pan-fried scallops with a hot tomato, pineapple and spring onion salsa", "url": "www_bbc_co_uk_food_recipes_panfriedscallopswith_90120", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 scallops", "salt and freshly ground black pepper ", "1 tbsp olive oil", "½ baby pineapple, peeled, chopped", "1 vine tomato, chopped", "2 spring onions, chopped", "pinch chilli flakes", "handful rocket leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the scallops, season the scallops with salt and freshly ground black pepper and drizzle over the olive oil. Heat a frying pan until smoking and sear the scallops for 30 seconds to one minute on both sides, or until just cooked through and golden-brown all over. Remove from the pan and keep warm.", "For the salsa, place all of the salsa ingredients to the pan used to cook the scallops and heat for 1-2 minutes to warm through. ", "Arrange a handful of rocket on a serving plate and place the scallops on top. Spoon the salsa over and serve."]}, {"isVegetarian": false, "title": "Pan-fried sea bass on a red risotto with roasted cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_panfriedseabassonare_87954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz sea bass fillet", "dash olive oil", "salt and freshly ground black pepper", "dash olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "30g/1oz chorizo, chopped", "200g/7oz basmati rice, boiled for five minutes, then drained", "pinch ground turmeric", "1 tsp tomato purée", "100ml/3½fl oz white wine", "dash Tabasco sauce", "1 small bunch cherry tomatoes on the vine", "dash olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the sea bass, rub the sea bass fillet with olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until very hot, place the sea bass fillet skin-side down into the pan and fry for three minutes. Turn over and fry for a further three minutes on the other side. Remove from the heat and keep warm.", "For the risotto, heat the olive oil in a small saucepan, add the onion and fry over a gentle heat until softened but not coloured. Add the garlic and fry for one minute. Add the chorizo and fry for two minutes.", "Add the blanched rice, turmeric and tomato purée to the pan and stir well. Add the wine and salt and freshly ground black pepper, to taste, and simmer, stirring frequently, until the rice is al dente. Add Tabasco sauce, to taste.", "For the roasted cherry tomatoes, place the cherry tomatoes into a small roasting tin. Drizzle with olive oil and salt and freshly ground black pepper, to taste, and roast in the oven for 6-8 minutes.", "To serve, pile the risotto onto a serving plate. Top with the pan-fried sea bass and garnish with the roasted cherry tomatoes."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with fennel pesto and tomato salsa", "url": "www_bbc_co_uk_food_recipes_panfriedseabasswithf_86319", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/5oz sea bass fillets", "1 tsp olive oil", "salt", "pinch freshly ground white pepper", "pinch ground coriander", "1 fennel bulb, roughly chopped", "2 tbsp chopped fresh dill", "50g/2oz pine nuts, toasted ", "2 tbsp ground almonds", "50g/2oz parmesan, freshly grated", "100ml/3½fl oz olive oil", "salt and freshly ground black pepper ", "150g/5oz cherry tomatoes, cut in half", "½ lemon, juice only", "2 tbsp sesame oil", "2 dashes Tabasco sauce", "2 tbsp fresh coriander leaves ", "1 punnet pea shoots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a sharp knife, trim the sea bass fillets into a square shape, then cut into the skin side to lightly score.", "Rub the fillets with olive oil and season with salt and a pinch of white pepper and ground coriander.", "Heat a frying pan until hot and add the sea bass, skin-side down. Fry for three minutes, then turn and cook for a further 1-2 minutes, or until completely cooked through.", "For the fennel pesto, place the fennel into a food processor and blend to a fine purée.", "Add the dill, pine nuts, ground almonds and parmesan and pulse to combine.", "Add the olive oil and blend to a porridge-like consistency. Season, to taste, with salt and freshly ground black pepper.", "For the tomato salsa, place the tomatoes into a bowl and add the lemon juice, sesame oil, Tabasco sauce and coriander leaves. Stir gently to combine.", "To serve, place a spoonful of fennel pesto into the centre of each plate. Place a sea bass fillet on top of each and spoon the salsa around. Garnish with a few pea shoots and serve."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with sautéed garlic and broccoli and balsamic sauce", "url": "www_bbc_co_uk_food_recipes_panfriedseabasssaute_89399", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp plain flour", "salt and freshly ground black pepper", "1 sea bass fillet, skin scored", "1 tbsp olive oil", "1 tbsp balsamic vinegar", "1 tbsp red wine vinegar", "2 tbsp olive oil", "85g/3oz broccoli florets", "1 garlic clove, finely chopped", "1 red chilli, chopped", "2 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, sprinkle the flour onto a plate and season to taste with the salt and freshly ground black pepper. Press the fish into the seasoned flour to coat. ", "Heat the oil in a non-reactive frying pan over a high heat. Add the coated fish and fry for 4-5 minutes on each side, or until the skin is crisp and the fish is cooked through. Remove the fish from the pan.", "For the balsamic sauce, add the balsamic and red wine vinegars to the fish pan and heat over a low heat for 2-3 minutes to deglaze, scraping up the bits from the pan with a wooden spoon.", "For the sautéed garlic and broccoli, heat the oil in a wok over a high heat, add the broccoli, garlic and chilli, and stir fry for 5-6 minutes. Stir in the parsley. ", "To serve, spoon the broccoli onto a plate, place the fish on top of the broccoli, and drizzle the balsamic sauce around the edge of the plate."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with crushed potato and fennel sauce", "url": "www_bbc_co_uk_food_recipes_panfriedseabasswithc_83625", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz new potatoes, boiled until just cooked through", "1 tbsp olive oil", "25g/1oz unsalted butter", "salt and freshly ground black pepper ", "50g/1¾oz unsalted butter", "¼ fennel bulb, finely sliced", "2 tbsp white wine", "1 tsp white wine vinegar", "50ml/2fl oz double cream", "1 tbsp chopped fresh chives", "1 tbsp olive oil", "100g/3½oz sea bass fillet", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the crushed potato, roughly mash the potato in a bowl with the olive oil and butter, then season with salt and freshly ground black pepper.", "To make the fennel sauce, heat the butter in a frying pan over a medium heat. Add the fennel and sauté until soft and golden.", "Add the white wine and vinegar and cook until reduced in volume by half.", "Add the cream and continue to reduce until thickened. ", "Add the chives, stir well and season, to taste, with salt and freshly ground black pepper.", "To make the sea bass, heat the olive oil in a frying pan over a medium heat. Season the sea bass on both sides with salt and freshly ground black pepper and add to the pan skin-side down. Cook for three minutes, then turn the fillet over and continue to cook for 2-3 more minutes, or until cooked through. ", "Squeeze over the lemon juice and remove from the heat.", "To serve, place the crushed potatoes in the middle of a warm plate. Place the sea bass on top and spoon the fennel sauce around."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with green bean sauce vierge", "url": "www_bbc_co_uk_food_recipes_panfriedseabasswithg_85746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 fillet sea bass, skinned", "1 tbsp olive oil", "1 tsp balsamic vinegar", "salt and freshly ground black pepper", "1 tomato, seeds removed and chopped", "100g/3½oz green beans, trimmed, blanched and drained"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, heat the oil in a frying pan over a medium heat and cook the sea bass for 2-3 minutes on each side, or until cooked through.", "For the green bean sauce vierge, place the oil and vinegar into a bowl, season with salt and freshly ground black pepper and mix well. Add the chopped tomato and stir.", "To serve, place the beans onto a serving plate and pour over the dressing. Place the sea bass alongside."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with Jersey Royals and watercress salsa verde", "url": "www_bbc_co_uk_food_recipes_panfriedseabasswithj_89323", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz Jersey Royal potatoes (or similar new potatoes), scrubbed", "4 tbsp olive oil", "salt and freshly ground black pepper", "4 sea bass fillets", "150g/5oz watercress, leaves only", "3 tbsp chopped fresh flatleaf parsley", "2 large spring onions, roughly chopped", "1 garlic clove, roughly chopped", "1 lemon, zest only", "2 tbsp capers, rinsed and drained", "2 tbsp toasted breadcrumbs ", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the potatoes into a pan of water and bring to the boil. Cook for 8-10 minutes, until the potatoes are tender. Drain, return to the pan and add two tablespoons of the olive oil, and season well with salt and freshly ground black pepper. Mix well to combine.", "Season the sea bass fillets with freshly ground black pepper.", "Heat a frying pan until hot, add the remaining two tablespoons of olive oil and the sea bass fillets. Cook on each side for 2-3 minutes, until just cooked through. Remove from the pan and leave to rest for two minutes.", "For the watercress salsa verde, bring a small clean pan of salted water to the boil. Add the watercress and cook for one minute. Drain and refresh the watercress in iced water.", "Transfer the watercress to a food processor and add the remaining ingredients and process to a purée. Season, to taste, with salt and freshly ground black pepper.", "To serve, place equal amounts of potatoes onto each plate. Place a sea bass fillet alongside and serve with a spoonful of salsa verde."]}, {"isVegetarian": false, "title": "Pan-fried sirloin steak with shallots, celeriac purée, wild mushrooms and madeira cream sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsirloinsteak_87611", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter, plus a little extra", "½ onion, chopped", "1 stick celery, chopped ", "pinch salt ", "250ml/9fl oz milk ", "few drops concentrated chicken bouillon ", "250ml/9fl oz water", "300g/11oz celeriac, peeled and chopped ", "pinch ground white pepper", "50g/2oz butter, plus a little extra ", "3 shallots, 2 sliced, 1 finely chopped", "pinch salt", "50g/2oz button mushrooms, sliced", "2 sprigs fresh thyme", "110ml/4fl oz madeira ", "150ml/6fl oz hot chicken stock ", "150ml/6fl oz double cream", "salt and freshly ground black pepper", "125g/5oz mixed wild mushrooms ", "25g/1oz butter", "20 shallots, peeled and blanched", "salt and freshly ground black pepper ", "2 tbsp sherry vinegar ", "4 x 200-250g/7-9oz sirloin steaks", "salt and freshly ground black pepper ", "25g/1oz unsalted butter, plus a little extra", "1 tbsp vegetable oil", "knob of butter", "200g/7oz baby spinach leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the celeriac purée, heat a saucepan and add the butter, onions, celery and salt. Fry gently for 2-3 minutes.", "Add the milk, chicken bouillon and water, then the celeriac and white pepper. Bring to the boil, then reduce to a simmer and cook for 30 minutes.", "Remove from the heat and allow to cool slightly. Press the mixture through a colander into a bowl and beat well until smooth. Transfer to a blender and blend to a very fine purée.", "Return the purée to the pan, add a little butter and taste to check the seasoning. Set aside and keep warm.", "For the madeira cream sauce, heat a frying pan, add 25g/1oz of the butter, the two sliced shallots and a pinch of salt and cook over a low heat until the shallots are transparent.", "Add the button mushrooms and continue cooking until they are slippery in texture, then add the thyme.", "Add the madeira and simmer until reduced by half. ", "Add the chicken stock and reduce by half again, then add the cream and reduce this by half.", "Stir in the remaining butter, then pass the mixture through a fine sieve into a clean pan and season with salt and freshly ground black pepper. Set aside and keep warm.", "For the roasted shallots, heat the butter in a heavy-based pan. Add the blanched shallots and season with salt and freshly ground black pepper. Fry gently until the shallots are softened and coloured.", "Increase the heat slightly, add the sherry vinegar to the pan and stir with a wooden spoon, scraping up the bits from the bottom of the pan. Set aside.", "For the steaks, season the steaks on both sides with salt and freshly ground black pepper.", "Heat a frying pan until very hot. Add the butter, vegetable oil and steaks and cook for 2-4 minutes on each side, depending on how you like your steaks cooked. Remove the steaks from the pan and leave to rest on a tray for a few minutes.", "Pour off the excess fat from the pan the steaks were cooked in. Add a splash of water to the pan and pour in the madeira cream sauce. Bring to the boil and reduce to a sauce consistency, then set aside.", "In a separate frying pan, heat a knob of butter and gently fry the finely chopped shallot until softened but not coloured. Add the wild mushrooms and fry gently until softened. Add the wild mushroom mixture to the madeira cream sauce.", "In the same pan as the shallots and mushrooms were cooked in, heat a little butter and gently cook the spinach until wilted. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the spinach among four serving plates. Slice the steaks and fan out on top of the spinach.", "Using a large spoon, place a teardrop-shaped smear of celeriac purée onto each plate.", "Place five roasted shallots onto each plate and spoon the mushroom and madeira cream sauce over the meat."]}, {"isVegetarian": false, "title": "Pan-fried smoked salmon with tartare sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsmokedsalmon_84584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices smoked salmon", "1 tbsp oil", "½ lemon, juice only", "freshly ground black pepper", "3 tbsp crème fraîche", "1 tbsp Greek yoghurt", "2 tbsp capers, rinsed, drained, and chopped", "1 spring onion, finely chopped", "½ lemon, juice only", "handful fresh dill, chopped", "handful fresh chives, chopped", "handful fresh parsley", "handful fresh basil", "handful fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, place three slices of smoked salmon on top of each other, then roll into a sausage shape. Curl the rolled salmon around and shape into a circle. ", "Heat the oil in a small frying pan over a medium heat. Add the smoked salmon and fry for two minutes on each side, until light pink and cooked through. Add the lemon juice and cook for another minute.", "For the tartare sauce, place all the tartare sauce ingredients, except the dill and chives, into a small saucepan and warm over a low heat for two minutes. Remove from the heat and add the dill and chives and stir.", "To serve, mix the parsley, basil and coriander together in a bowl. Place the mixed herbs onto a plate, place the pan-fried smoked salmon on top and pour over the tartare sauce."]}, {"isVegetarian": false, "title": "Pan-fried smoked salmon with radish salad", "url": "www_bbc_co_uk_food_recipes_panfriedsmokedsalmon_86061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices smoked salmon", "1 bunch radishes, tops removed, grated", "1 orange, juice only", "1 tbsp olive oil", "1 tbsp chopped fresh dill", "2 tsp white wine vinegar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan and fry the salmon slices on one side for two minutes. Remove from the pan and keep warm.", "Place the grated radishes into a large bowl.", "Place the orange juice, oil, dill and vinegar into a small bowl and whisk to combine. Pour the dressing over the radishes and stir well.", "To serve, place the salmon slices onto serving plates with the radish salad."]}, {"isVegetarian": false, "title": "Pan-fried snapper with beetroot", "url": "www_bbc_co_uk_food_recipes_panfriedsnapperwithb_12160", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole beetroots, cooked and peeled", "olive oil", "2 tbsp horseradish cream", "sea salt and pepper, to taste", "1 tbsp butter", "2 x 300g/10½oz portions cleaned red snapper fillet, sliced thinly", "lemon, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cooked beetroot into a food processor and blend roughly.", "Add a little olive oil, the horseradish cream (or a little freshly grated horseradish), salt and pepper.  Blend a further 20 seconds.3. Heat the olive oil and butter in a frying pan and add the snapper pieces once the butter is nut brown.", "Cook the fish for 2 minutes on each side and set aside to rest.", "To serve, stack the fish pieces on a plate and add freshly ground pepper. Place a heaped tbsp of beetroot purée to one side and finish with a slice of lemon."]}, {"isVegetarian": false, "title": "Pan-fried snapper with steamed rice, spicy okra and coconut and basil sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsnapperwiths_85775", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp vegetable oil", "¼ onion, sliced", "100g/3½oz okra, sliced lengthways", "2 tbsp white wine", "1 tbsp tomato purée", "1 tbsp honey", "pinch chilli flakes", "salt and freshly ground black pepper ", "1 tbsp butter", "¼ fresh coconut, flesh sliced thinly ", "2 tbsp white wine", "2 tbsp coconut milk", "3 tbsp double cream", "salt and freshly ground black pepper ", "small handful fresh basil leaves, torn", "1 tbsp vegetable oil", "1 fillet red snapper, skin on", "100g/3½oz rice, cooked according to packet instructions, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spicy okra, heat the oil in a pan and fry the onion until soft. Add the okra and white wine and simmer until reduced by half.", "Add the tomato purée, honey and chilli flakes and simmer for five minutes, or until the okra is soft. Season, to taste, with salt and freshly ground black pepper.", "For the coconut and basil sauce, heat the butter in a small pan. Add the fresh coconut and white wine and simmer until the wine has reduced by half. Add the coconut milk and double cream and season with salt and freshly ground black pepper. Add the basil and stir. Set aside and keep warm.", "For the snapper, heat the oil in a frying pan and fry the snapper on both sides until cooked through and the skin is crisp.", "To serve, place the rice onto a serving plate and top with the fish. Drizzle over the sauce."]}, {"isVegetarian": false, "title": "Pan-fried sole fillet with caper and tomato dressing", "url": "www_bbc_co_uk_food_recipes_panfriedsolefilletwi_85485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, finely chopped", "2 tbsp capers, drained, rinsed and finely chopped", "1 ripe tomato, seeds removed, chopped", "salt and freshly ground black pepper ", "½ lemon, juice only", "handful fresh parsley, chopped", "1 tbsp olive oil", "1 sole fillet, skinned"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, heat the oil in a pan, add the garlic, capers and chopped tomato and gently warm through. Season, to taste, with salt and freshly ground black pepper and stir in the lemon juice and parsley. Remove from the heat, set aside and keep warm.", "For the sole, heat the oil in a non-stick frying pan and fry the sole for 2-3 minutes on each side, or until cooked through.", "To serve, place the sole onto a plate and pour over the warm dressing."]}, {"isVegetarian": true, "title": "Pan-fried soufflé with creamy mustard sauce", "url": "www_bbc_co_uk_food_recipes_panfriedsoufflewithc_79943", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp double cream", "125g/4½oz cheddar cheese, grated ", "3 free-range egg yolks", "3 free-range egg whites, whisked until stiff peaks form", "2 tbsp chopped fresh chives", "1 tbsp butter", "2 tbsp plain flour", "3 tbsp white wine ", "100ml/3½fl oz double cream", "1 tbsp wholegrain mustard ", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the cream and cheese into a saucepan and warm through without boiling.", "Remove from the heat for a few minutes and then beat in the egg yolks.", "Fold the egg whites and chives into the cheese mixture.", "Rub a small ovenproof frying pan with butter and dust with the plain flour. Place spoonfuls of the cheese mixture onto the frying pan and place into the oven to bake for eight minutes.", "For the sauce, place the white wine and cream, mustard and chives into a saucepan over a medium heat and bring to a simmer. Cook for two minutes and remove from the heat. ", "To serve, place the soufflé into the centre of the plate and drizzle the sauce around."]}, {"isVegetarian": false, "title": "Pan-fried spicy sea bass with gorgonzola mash and fresh pesto", "url": "www_bbc_co_uk_food_recipes_panfriedspicyseabass_84628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp plain flour", "200-300g/7oz-10oz sea bass fillet", "1 tsp paprika", "½ tsp chilli flakes", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 sweet potato, peeled and sliced", "75g/2½oz gorgonzola, sliced", "50ml/2fl oz double cream", "25g/1oz butter", "salt and freshly ground black pepper", "large handful fresh basil, chopped", "4 tbsp olive oil", "2 tbsp pine nuts", "1 tbsp lemon, juice only", "salt and freshly ground black pepper", "1 lime, cut into wedges, to garnish", "1 sprig fresh flat leaf parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, place the flour into a bowl and dip the sea bass fillet into the flour until it is covered on both sides.  Shake off the excess flour. ", "Place the paprika, chilli flakes, salt and freshly ground black pepper in a clean bowl and mix well.  Then roll the sea bass in this mixture until it is covered on both sides. Shake off the excess mixture. ", "Heat the oil in a frying pan and add the sea bass.  Cook the sea bass for three minutes on each side, or until it is cooked through. Remove the sea bass from the heat and set aside.", "For the gorgonzola mash, place the sweet potato into a saucepan and boil for ten minutes or until the potato is tender. Drain off the excess water and mash the potato with a potato masher until the mixture is smooth. ", "Add the gorgonzola pieces, cream, butter, salt and freshly ground black pepper to the potato and mix well.", "For the pesto, place all the pesto ingredients in a food processor and blend..", "To serve, spoon the mash onto a clean plate, place the sea bass fillet on top and drizzle with pesto. Garnish with the lime wedges and parsley."]}]