[{"isVegetarian": false, "title": "Monkfish with sautéed potatoes, red wine sauce and salsa verde", "url": "www_bbc_co_uk_food_recipes_monkfishwithsauteedp_85692", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 garlic cloves, lightly crushed", "1 slice bread, cubed", "1 potato, cut into cubes", "1 monkfish tail, bone and membrane removed", "100ml/3½fl oz red wine", "50ml/2fl oz hot vegetable stock", "1 tbsp sugar", "salt and freshly ground black pepper ", "handful fresh flatleaf parsley", "handful fresh mint", "handful fresh basil", "2-3 tbsp olive oil", "2 tsp Dijon mustard", "½ lemon, juice only", "50g/2oz Camembert, chopped, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sautéed potatoes and monkfish, heat the olive oil in a frying pan, add the garlic, bread and potato and sauté for 4-5 minutes, until softened and lightly browned.", "Add the monkfish and fry, turning often, until golden on all sides and just cooked through.", "For the red wine sauce, place the red wine into a small saucepan and boil until reduced by half.", "Add the vegetable stock and sugar and boil for five minutes. Season, to taste, with salt and freshly ground black pepper.", "For the salsa verde, place the herbs, olive oil, mustard and lemon juice into a small food processor and blend until smooth.", "To serve, place the sautéed potatoes and monkfish onto a plate, drizzle over the red wine sauce and salsa verde and top with cubes of Camembert."]}, {"isVegetarian": false, "title": "Monkfish wrapped in prosciutto", "url": "www_bbc_co_uk_food_recipes_monkfishwrappedinpar_84151", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz monkfish, trimmed", "3 slices prosciutto", "freshly ground black pepper", "1 tbsp olive oil", "2 tbsp olive oil", "3 spring onions, chopped", "1 garlic clove, crushed", "140g/5oz cherry tomatoes, halved", "3 fresh basil leaves, chopped", "200g/7oz spinach", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Wrap the monkfish in the prosciutto and season with freshly ground black pepper.", "Heat the oil in an ovenproof frying pan and fry the monkfish for 2-3 minutes, until it is browned on both sides. ", "Transfer into the oven for eight minutes or until completely cooked through. Remove from the oven and allow to rest for five minutes.", "For the sauce, heat the oil in a heavy-bottomed frying pan and fry the spring onion and garlic for one minute. Add the tomatoes and basil leaves to the pan and stir well. ", "For the spinach, heat the oil in a separate pan and add the spinach for two minutes, stirring until wilted down.", "To serve, place the monkfish onto a plate and place alongside the spinach. Top with the tomato sauce."]}, {"isVegetarian": true, "title": "Mont Blanc", "url": "www_bbc_co_uk_food_recipes_mont_blanc_28435", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼fl oz free-range egg whites (approximately 5 egg whites)", "300g/11oz  caster sugar", "2 tsp cornflour", "1 tsp white wine vinegar", "vegetable oil, for deep frying", "100g/3½oz caster sugar", "100ml/3½fl oz water", "110g/4oz mixed unsalted nuts", "sea salt flakes", "110g/4oz dark chocolate", "500g/1lb 2oz sweetened chestnut purée", "1 vanilla pod, seeds only", "175g/6oz caster sugar", "300g/11oz mascarpone", "250ml/9fl oz double cream", "8-12 marrons glacés (candied chestnuts), crumbled", "150g/5¼oz caster sugar", "1 tbsp water"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringue, preheat the oven to 140C/275F/Gas 1. Line a baking tray with greaseproof paper.", "Whisk the egg whites in a clean bowl until soft peaks form when the whisk is removed.", "Whisk in the sugar, a spoonful at a time, until all of the sugar has been added and stiff peaks form when the whisk is removed.", "Whisk in the cornflour and vinegar.", "Spoon the meringue mixture onto the baking tray in a large circle.", "Bake in the oven for 10 minutes, then switch the oven off and leave in the oven for 2-3 hours, or preferably overnight, until crisp, but uncoloured.", "Remove the meringue from the oven and set aside to cool completely, then place onto a serving plate.", "Meanwhile for the caramelised nuts, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Heat the sugar and water in a separate saucepan until the sugar has dissolved.", "Add the nuts and bring the mixture to the boil. Continue to cook until the temperature of the sugar syrup reaches 110C/225F (use a sugar thermometer to check this).", "Remove the nuts from the syrup using a slotted spoon and carefully lower them into the deep fat fryer. (CAUTION: The nuts are coated in a liquid that may spit upon contact with the oil. Stand well back and keep your face and hair away from the deep fat fryer.) Fry for 1-2 minutes, or until golden-brown, then remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Sprinkle with sea salt flakes.", "For the filling, melt the chocolate in a bowl set over a saucepan of boiling water. (Do not let the base of the bowl touch the water.)", "Smooth the melted chocolate over the cooled meringue.", "Whisk the sweetened chestnut purée, vanilla seeds, caster sugar and mascarpone in a bowl until combined.", "Whisk the cream in a separate bowl until soft peaks form when the whisk is removed. Fold the double cream into the chestnut mixture.", "Spoon the chestnut mixture onto the meringue and scatter the marrons glacés and caramelised nuts on top.", "For the caramel, heat a frying pan until hot, add the caster sugar and water and cook for 4-5 minutes, or until the mixture becomes a pale caramel. (Do not stir the mixture.)", "Drizzle the caramel over the top to serve."]}, {"isVegetarian": true, "title": "'Mont Blanc' chocolate and chestnut meringue", "url": "www_bbc_co_uk_food_recipes_mont_blanc_chocolate_and_19432", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 egg whites", "200g/7oz golden caster sugar", "25g/1oz cocoa powder", "1 tsp white wine vinegar", "35g/1¼oz dark chocolate, grated (optional)", "400g/14oz whipping cream", "30g/1oz icing sugar", "3–4 maron glace, crumbled (optional)", "250g/9oz sweetened chestnut puree ", "50g/1¾oz dark chocolate, grated or flaked (optional)"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and cut out a 20cm/8in round of baking paper and place onto a baking tray.", "Whisk the egg whites in a stand mixer or with a hand held electric whisk, until soft peaks. Gradually whisk in the sugar, a tablespoon at a time, until the meringue is stiff and glossy. Sieve over the cocoa and gently fold in until combined. Fold in the vinegar and chocolate, if using. ", "Pile the mixture onto the centre of the baking paper, building the meringue up in the middle, into a small peak.", "Place in the oven and immediately turn down to 170C/150C Fan/Gas 3½. Bake for 1 hour 15 minutes – 1 hour 30 minutes or until the sides are crisp but with some give. Turn off the oven and leave the meringue to cool completely.", "Meanwhile, make the filling. Whisk the cream until fairly stiff, then fold in the icing sugar and vanilla extract. If using the maron glace, place two large spoonfuls of the cream into a small bowl for later and crumble the marons into the large bowl of cream. Spoon the cream and maron mixture around the meringue peak.", "To decorate, place the chestnut puree into a piping bag with a 2mm nozzle and pipe the puree all over the cream, in loops or straight lines. Sprinkle the grated chocolate over the piped chestnut, if using. Place the reserved cream into the middle of the pudding and build up into a peak, so Mont Blanc looks snow covered."]}, {"isVegetarian": false, "title": "Monte Bianco: chestnut, chocolate and coffee dacquoise", "url": "www_bbc_co_uk_food_recipes_monte_bianco_chestnut_09364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2 oz tin sweetened chestnut purée", "7g leaf gelatine, soaked in cold water for five minutes", "30ml/1fl oz dark rum", "300ml/10fl oz double cream", "6 free-range eggs, 4 whole, 2 yolks only", "220g/8oz caster sugar", "50g/2oz plain flour", "500ml/18fl oz milk", "7g leaf gelatine, soaked in cold water for five minutes", "250g/9oz unsalted butter, softened, cut into small pieces", "1 tsp espresso coffee ", "30ml/1fl oz coffee liqueur", "240g/8½oz free-range egg whites (approximately 8 egg whites)", "½ tsp cream of tartar", "40g/1½ oz caster sugar", "170g/6oz ground almonds", "170g/6oz icing sugar", "20g/¾oz plain flour, sifted", "40g/1½oz hazelnuts, finely chopped", "2 free-range eggs, whites only", "pinch cream of tartar", "120g/4½oz light brown sugar", "50g/2oz hazelnuts, finely chopped", "½ tsp cornflour", "30g/1¼oz caster sugar", "5g leaf gelatine, soaked in cold water for five minutes", "120g/4½oz chestnut spread", "250g/9oz dark chocolate, chopped", "chocolate transfer sheets (optional)", "75g/2½oz hazelnuts", "75g/2½oz almonds", "125g/4½oz caster sugar", "200g/7oz dark chocolate bittersweet (around 70% cocoa solids), chopped", "100ml/3½fl oz milk", "2 free-range eggs, yolks only", "20g/¾oz caster sugar", "360ml/12fl oz whipping cream", "30ml/1fl oz hazelnut liqueur"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the chestnut mousse, heat the chestnut purée and four tablespoons of water in a pan and bring to a simmer. Drain the gelatine leaves and squeeze out any excess water, then stir into the chestnut mixture until dissolved.", "Remove from the heat and strain the chestnut mixture through a sieve into a bowl. Leave to cool to room temperature then mix in the dark rum.", "In a separate bowl, whip the cream until it forms soft peaks when the whisk is removed. Fold the whipped cream into the chestnut mixture. Cover and place in the fridge to set for at least two hours.", "For the coffee mousseline, place the eggs, egg yolks and 70g/2½oz of the sugar in a bowl and whisk until pale and fluffy. (The mixture should leave a ribbon trail when the whisk is removed.) Sift in the flour and mix well. ", "Place the milk and remaining sugar in a large saucepan and bring to the boil. Slowly pour a third of the hot milk onto the egg mixture, whisking all the time. Then add the rest of the milk. Pour the mixture back into the pan and cook over a low heat stirring continuously. Simmer for two minutes or until thickened. ", "Remove the pan from the heat, and strain the custard through a fine sieve into a clean bowl. Stir in the softened gelatine and beat in one-third of the butter. Allow to cool, stirring occasionally to stop a skin forming. Beat the remaining butter with a handheld mixer at low speed for about three minutes until pale and fluffy. Increase mixing speed to medium and add the cooled custard a little at a time. Beat for five minutes until light and creamy. Mix the coffee powder with a teaspoon of water to make a paste. Stir the coffee paste and coffee liqueur into the custard mix. Set aside, covered, in the fridge.", "Preheat oven to 150C/300F/Gas 2.", "For the meringue layers, trace four circles around the cake ring onto baking parchment with a pencil. ", "Beat the egg whites with the cream of tartar until soft peaks form when the whisk is removed. Then slowly whisk in the caster sugar and whisk until stiff peaks form when the whisk is removed. ", "Blend the almonds with the icing sugar in a food processor for a minute. Fold the ground almond mixture and the flour into the whisked egg whites with a metal spoon until incorporated.  ", "Transfer the meringue to a piping bag, fitted with a 1cm/½in plain nozzle. Pipe in a spiral onto the baking parchment circles starting from the centre and piping outwards. Sprinkle with the chopped hazelnuts and bake for an hour until dry and crisp. Remove from the oven and set aside.", "Reduce the oven to 120C/250F/Gas ½. Line a baking tray with baking parchment.", "For the brown sugar and hazelnut meringue, whisk the egg whites with the cream of tartar until soft peaks form when the whisk is removed. Add the sugar gradually, whisking well between additions. Whisk for another three minutes until stiff peaks form when the whisk is removed. Fold in three-quarters of the chopped hazelnuts and the cornflour. Transfer the meringue to a piping bag fitted with a plain nozzle. Pipe the meringue into small rounds and sprinkle the tops with the remaining hazelnuts. Bake for 25 minutes until crisp. Set aside to cool.", "Meanwhile for the chestnut glaze, heat the sugar with 50ml/2fl oz water over a medium heat, stirring constantly, until dissolved. Then bring to a boil. Remove from the heat and stir in the drained, softened gelatine. Stir in the chestnut purée until thoroughly combined, then strain through a fine sieve. Set aside to cool.", "For the chocolate decorations, melt three-quarters of the chocolate in a bowl set over a pan of simmering water. Melt the chocolate to 45C/113F (use a thermometer to measure this). Remove the bowl from the heat and add the remaining chocolate in small amounts, stirring as it cools and thickens. When the chocolate temperature reaches 31C/88F , using a palette knife, spread it over an acetate sheet or a chocolate transfer sheet, to a thickness of a 50p piece. Set aside to cool. ", "After a few minutes when the chocolate begins to set, score triangles into the chocolate at least 15cm/6in long. Leave to cool fully and firm up.  Turn the oven up to 200C/400F/Gas 6. Line a baking tray with non-stick parchment.", "For the praline, roast the hazelnuts and almonds on a non-stick baking tray for 8-10 minutes until golden-brown. In a saucepan, heat the sugar over a medium heat until it melts and turns to amber caramel – about 15 minutes. ", "Stir in the roasted nuts, then pour the mixture onto the lined baking tray and leave to cool. When completely cool break up the praline and blend in a food processor to a fine crumble. Set aside.", "For the chocolate mousse, place the chopped chocolate into a large bowl. In a small pan slowly bring the milk to the boil. Meanwhile whisk the egg yolks and sugar together by hand until the mixture is pale and fluffy. Pour half of the boiled milk onto the egg mixture stirring all the time, then pour this back into the pan with the remaining milk, still stirring continuously. Cook over a low heat, stirring constantly, until the mixture has thickened.", "Remove from the heat and strain through a fine sieve onto the chopped chocolate. Set aside to cool. ", "Whip the cream until soft peaks form when the whisk is removed then carefully fold it into the chocolate custard. Add the hazelnut liqueur. ", "To assemble the dacquoise, place the ring mould onto the presentation plate, to use as a guide. Place one circle of meringue into the cake ring and cover with a 2cm/in layer of chocolate mousse. Reserve any leftover mousse for patching up when the ring is removed.  Place a second meringue layer on the top and chill in the fridge for 20 minutes. Remove from the fridge and spread over a 2cm/1in layer of coffee mousseline cream onto the meringue to a similar depth, cover with a third meringue layer and chill again for 20 minutes. Remove from the fridge and spread over a 2cm/1in layer of chestnut mousse. Top with the final meringue layer, but inverted so the surface is flat. Reserve any leftover mousse to smooth out any imperfections when the ring is removed. ", "If the chestnut glaze has set, warm it gently in a saucepan to a pouring consistency. Spoon the chestnut glaze over the top to just cover and then chill in the fridge until just before serving. To release the ring mould, run a lighted blowtorch around the outside of the mould. Gently ease the ring mould off, patch any holes and chill again.  Decorate with the chocolate triangles around the sides, brown sugar and hazelnut meringues piled in the centre and chocolate curls and praline around the edges.  "]}, {"isVegetarian": false, "title": "Moorish meatballs", "url": "www_bbc_co_uk_food_recipes_moorish_meatballs_94958", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moorish_meatballs_94958_16x9.jpg", "ingredients": ["600g/1lb 5oz lamb or pork mince", "2 garlic cloves, crushed", "1 tbsp ground coriander", "2 tbsp ground cumin", "1 tsp sweet paprika", "½ tsp ground cinnamon", "1 tsp ground cardamom", "small bunch parsley, finely chopped", "1 lemon, zest only", "100g/3½oz fresh breadcrumbs", "50ml/2fl oz double cream", "1 free-range egg", "3-4 tbsp olive oil, for frying", "salt and freshly ground black pepper", "2 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "½ tsp ground cinnamon", "½ tsp cayenne pepper", "½ tsp ground cumin", "½ tsp ground turmeric", "2 bay leaves", "400g tin tomatoes", "1 tsp honey", "100ml/3½fl oz plain yoghurt (optional)", "3 tbsp finely chopped parsley leaves, to serve", "800g/1lb 12oz floury potatoes, peeled and cut int 3–4cm chunks", "200ml/7fl oz olive oil", "2 garlic cloves, finely chopped", "1 tbsp sherry vinegar", "½ tsp sugar or honey", "1 tbsp sweet paprika", "1 tsp hot paprika", "2 tbsp finely chopped parsley, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, put all the ingredients into a large bowl, season with a generous amount of salt and pepper and mix thoroughly with your hands. The mixture will feel wet to start with, but if you fold it in on itself as if you are kneading it, it will stiffen up. Form the mixture into balls of around 50g/1¾oz each – you should end up with about 16.", "To cook, either heat olive oil in a large frying pan and fry the meatballs in two batches, until well browned on all sides, or preheat the oven to 200C/180C Fan/Gas 6, put the meatballs on a greased baking tray, and cook for around 15 minutes, or until well browned and just cooked through. Keep warm.", "Meanwhile, to make the patata bravas, put the potatoes in a saucepan and cover with cold water. Bring to the boil and add plenty of salt. Simmer for 3–4 minutes until the potatoes are starting to soften. ", "While you are cooking the meatballs, make the sauce: heat the olive oil in a saucepan. Add the onion and fry for 10 minutes or until softened and translucent. ", "Add the garlic, spices and bay leaves and cook for a couple of minutes, stirring constantly, then add the tomatoes and honey. Pour over 200ml/7fl oz water, then bring to the boil. Reduce the heat and leave to simmer, covered, for 15 minutes, then uncovered for a further 5 minutes. Stir in the yoghurt, if using.", "Drain the potatoes and heat the olive oil in a large frying pan. Add the potatoes in a single layer (you may need to cook in batches if you can’t fit them in) and fry for 15–20 minutes or until crisp and brown on all sides.", "To make the patatas bravas sauce, heat the olive oil in a small saucepan and add the garlic. Cook for 2–3 minutes until starting to soften without taking on any colour. Add the vinegar and sugar and stir until the sugar has dissolved. Stir in the sweet and hot paprika.", "Pour the sauce over the crisp potatoes and sprinkle with a little more sweet and hot paprika. ", "To finish the dish, put the meatballs into a large, deep frying pan, and cover with the sauce. Simmer gently for 5 minutes, or until the meatballs have heated through and the sauce has reduced a little. ", "Serve sprinkled with a little parsley, if using.."]}, {"isVegetarian": false, "title": "Morecambe Bay shrimp and tamarind spring rolls", "url": "www_bbc_co_uk_food_recipes_morecombebayshrimpan_85714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz brown shrimps", "75g/3oz beansprouts, chopped", "1 stick lemongrass, crushed and finely chopped", "2cm/1in piece galangal, finely chopped (root ginger may be used if galangal is unavailable)", "½ tsp tamarind paste", "1 tbsp dark soy sauce ", "1 tbsp sake", "1 hot chilli, seeds removed, finely chopped", "1 tbsp finely chopped fresh coriander ", "½ tsp freshly ground white pepper", "palm sugar (brown sugar may be used if palm sugar is unavailable), to taste", "1 packet spring roll wrappers", "1 free-range egg, beaten", "groundnut oil, for deep-frying", "2 garlic cloves, crushed", "1 x 2cm/1in piece fresh ginger, peeled, finely chopped", "2 chillies, seeds removed, finely chopped", "1 tsp palm sugar (brown sugar may be used if palm sugar is unavailable)", "5 tbsp lime juice", "3 tbsp fish sauce (nam pla)", "125ml/4½fl oz lime juice", "40g/1½oz brown sugar", "1 tbsp fish sauce (nam pla)", "½ tsp chilli oil", "2 tbsp fresh mint, roughly chopped", "2 tbsp fresh coriander, roughly chopped", "40g/1½oz crushed roasted peanuts, roughly chopped", "110g/4oz watercress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spring rolls, place the shrimps, beansprouts, lemongrass and galangal into a bowl and mix well.", "Place the tamarind paste, soy sauce and sake into a clean bowl and whisk to combine. Add to the shrimp mixture and stir to combine.", "Add the chilli, coriander and white pepper to the shrimp mixture and stir well. Check the balance of flavours, you have control over how sharp this dish tastes - if the mixture tastes too sharp add a bit of palm sugar.", "Brush a spring roll wrapper with the beaten egg. Place a quantity of the shrimp mixture into the middle of the wrap and roll up like a cigar, tucking the ends in, making sure that it is sealed totally. Repeat this process with the remaining spring roll wrappers and shrimp mixture.", "Fill a deep, heavy-bottomed pan half-full with groundnut oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Carefully add the spring rolls in batches of three or four and deep-fry until golden brown and hot inside.", "For the lime dipping sauce, place the garlic, ginger, chillies and palm sugar into a pestle and mortar and grind to a paste. Add the lime juice and fish sauce, then transfer to a clean bowl and mix well.", "For the peanut and lime vinaigrette, place all of the ingredients into a bowl and mix well.", "To serve, place a small handful of watercress onto plates. Place three or four spring rolls on top and serve the dipping sauces alongside."]}, {"isVegetarian": false, "title": "Mooli salad with butterflied prawns", "url": "www_bbc_co_uk_food_recipes_moolisaladwithbutter_87245", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mooli, peeled and grated", "1 tomato, seeds removed, finely chopped", "½ lemon, juice only", "1 lime, juice only", "2 tbsp olive oil", "salt and freshly ground black pepper ", "2 large prawns, peeled, deveined and butterflied"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mooli and tomato into a bowl and add the lemon and lime juice and one tablespoon of olive oil. Season, to taste, with salt and freshly ground black pepper and mix well.", "Drizzle the prawns with the remaining olive oil. Heat a frying pan and fry the prawns for 2-3 minutes, or until pink and completely cooked through.", "To serve, place the salad onto a plate and top with the prawns."]}, {"isVegetarian": false, "title": "Moroccan-style braised pork with couscous", "url": "www_bbc_co_uk_food_recipes_moroccan-style_braised_72033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp cumin seeds", "2 tsp fennel seeds ", "3 tsp coriander seeds", "3 garlic cloves", "pinch saffron", "2 dried red chillies, finely chopped", "2 tbsp finely chopped fresh coriander ", "5 tbsp olive oil", "2 slices pork shoulder, about 7.5cm/3in thick", "1 tbsp olive oil", "1 onion, finely chopped", "1 garlic head, separated into peeled whole cloves ", "750ml/1¼ pints chicken or lamb stock ", "1 bay leaf ", "10–15 dried apricots ", "300g/10½oz couscous", "1 cinnamon stick", "1 tbsp red wine vinegar ", "1 tsp caster sugar", "3 tbsp olive oil", "1 tbsp finely chopped fresh mint", "1 tbsp finely chopped fresh coriander", "1 tbsp finely chopped fresh flatleaf parsley ", "1 unwaxed orange, zest only", "1 unwaxed lemon, zest only", "2 tbsp raisins", "2 tbsp flaked almonds, toasted", "2 tbsp pistachio nuts, toasted and roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, place all of the ingredients into a blender and blitz to a paste. Rub the marinade into the pork slices, cover and put in the fridge for 24 hours.", "After 24 hours, heat the oil in a large frying pan, add the onion and garlic cloves and sweat for 2–3 minutes. Add the pork and its marinade, stock, bay leaf and apricots and braise very gently over a low heat for 2–3 hours, or until very tender. ", "For the couscous, place the couscous in a large bowl with the cinnamon stick. Cover with boiling  water, place a plate over the bowl and leave for 10 minutes. Meanwhile, mix the vinegar, sugar and oil together in a small bowl. Fork the vinegar mixture though the cooked couscous. Stir in the chopped herbs, orange and lemon zests, raisins, almonds and pistachios and season with salt and pepper. ", "Cut the pork slices into four portions and place on warmed plates. Spoon some of the marinade with the onion, garlic cloves and apricots over the pork. Serve immediately, with the couscous alongside. "]}, {"isVegetarian": false, "title": "Moroccan-style chicken with couscous and yoghurt", "url": "www_bbc_co_uk_food_recipes_moroccan-style_chicken_47173", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccan-style_chicken_47173_16x9.jpg", "ingredients": ["1 large onion, chopped", "3 garlic cloves, crushed", "275ml/10fl oz chicken stock ", "sea salt and freshly ground black pepper", "4 chicken breasts", "1 x 400g/14oz can chopped tomatoes ", "2 tsp ground cinnamon ", "1 tsp ground ginger ", "handful dried apricots or prunes (or both), chopped ", "2 tbsp clear honey ", "bunch fresh coriander, chopped", "couscous, to serve", "natural yoghurt, optional, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the onion, garlic and chicken stock into a saucepan over a medium heat and bring to the boil. Season with salt and freshly ground black pepper and boil for five minutes, or until reduced in volume by half.", "Add the chicken, tomatoes, ground cinnamon, ground ginger and dried apricots or prunes. Return the mixture to the boil, then reduce the heat to low, cover with a lid and simmer very gently, stirring occasionally, for about an hour.", "Make the couscous addording to the packet instructions.", "Just before serving, stir the honey and coriander into the chicken and cook for a further five minutes. Serve with couscous and yoghurt."]}, {"isVegetarian": true, "title": "Moroccan baked eggs", "url": "www_bbc_co_uk_food_recipes_moroccan_baked_eggs_12048", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccan_baked_eggs_12048_16x9.jpg", "ingredients": ["½ tbsp olive oil", "½ onion, chopped", "1 garlic clove, sliced", "½ tsp ras-el-hanout", "pinch ground cinnamon", "½ tsp ground coriander", "400g/14oz cherry tomatoes, chopped", "2 tbsp chopped coriander", "2 free-range eggs", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Heat the oil in a frying pan, add the onion and garlic and cook for 6-7 minutes, or until soft. Stir in the spices and cook, stirring, for a further minute.", "Add the tomatoes and season well with salt and pepper, then simmer gently for 8-10 minutes.", "Scatter over 1 tablespoon of the coriander, then divide the tomato mixture between 2 individual ovenproof dishes. Break an egg into each dish.", "Bake for 8-10 minutes until the egg whites are set but the yolks are still slightly runny. Cook for a further 2-3 minutes if you prefer the eggs to be cooked through. ", "Scatter over the remaining coriander and serve."]}, {"isVegetarian": false, "title": "Moroccan goat tagine with couscous salad", "url": "www_bbc_co_uk_food_recipes_moroccan_goat_tagine_09469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp ground ginger", "1 tsp freshly ground black pepper", "1 tsp ground turmeric", "½ tsp cayenne pepper", "680g/1½ lb shoulder of kid or goat, trimmed and cut into large chunks ", "50g/1¾oz dried apricots, finely sliced", "50g/1¾oz sultanas", "1 tbsp rapeseed oil", "2 onions, roughly chopped", "8 garlic cloves, finely chopped", "1 tbsp honey", "2 x 400g tins chopped tomatoes", "½ tbsp vegetable bouillon powder", "handful fresh coriander, roughly chopped, to garnish", "250g/9oz couscous", "500ml/18fl oz hot chicken stock", "400g tin chickpeas, drained and rinsed", "1 small red onion, very finely chopped", "1 pomegranate, seeds removed", "1 stick celery, finely chopped", "1 tbsp shredded fresh mint", "2 tbsp finely chopped flatleaf parsley", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["To make the tagine, mix together all the spices in a small bowl.", "Put the goat pieces in a large bowl, add half the spice mix and toss until the goat pieces are thoroughly coated.", "Cover and place in the fridge for 1–2 hours to allow the spices to permeate the meat.", "Meanwhile, to make the salad, soak the couscous in the chicken stock until plumped up and tender.", "Place the chickpeas in a bowl and roughly mash with a fork. Fold in the couscous with the red onion, pomegranate seeds, celery, mint and parsley.", "Whisk together the lemon juice and olive oil in a small bowl and season with salt and pepper.", "Fold the dressing into the salad, and leave at room temperature to allow the flavours to develop.", "Once the goat meat has marinated, place the apricots and sultanas in a bowl and cover with boiling water.", "Heat the oil in a large, high-sided frying pan over a high heat, add the goat pieces and fry until browned all over. Remove from the pan and set aside.", "Add the onions and garlic to the pan and fry for one minute over a low heat, then add the remaining spice mixture and fry until onions are soft. Add the apricots and sultanas and the soaking liquid, along with the honey, tomatoes and bouillon powder.", "Bring to the boil, then reduce the heat and simmer for 15 minutes until the sauce has thickened and reduced.", "Add the goat pieces and toss until coated in the sauce, then half cover with a lid. ", "Cook very gently for one and a half hours if using kid meat, and two hours and 45 minutes, if using goat, until the meat is cooked through and tender but still holding its shape. ", "Leave to stand for 10 minutes, then scatter over the coriander and serve on plates with the couscous salad."]}, {"isVegetarian": true, "title": "Moroccan plaited loaf with a bessara dip", "url": "www_bbc_co_uk_food_recipes_moroccan_plaited_loaf_51517", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz very strong white bread flour, plus extra for dusting", "4 tsp dried fast-action yeast ", "2 tsp table salt ", "3 tbsp olive oil, plus extra for greasing", "olive oil, for frying ", "1 large white onion, finely chopped ", "100g/3½oz tomato pureé", "1 tsp harissa paste", "10 strands of saffron", "150g/5½oz black pitted olives, chopped ", "125g/4½oz full-fat soft goats’ cheese", "200g/7oz tinned broad beans, drained", "1 lemon, juice only", "4 tbsp olive oil ", "1 tsp flaked sea salt  ", "1 tsp ground cumin", "1 tsp paprika", "1 free-range egg, beaten with a splash of milk for egg wash ", "small bunch mint, finely chopped "], "serves": "Makes 1 large plaited loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the bread, in a large bowl mix half the flour and half the yeast and 475ml/17fl oz lukewarm water to form a batter. Set aside in a warm room for 30 minutes. ", "When the starter is risen and bubbling, add the remaining flour, yeast, salt and oil. Mix until all the dry ingredients have been incorporated.", "Turn out the dough onto an oiled work surface and knead for 10 minutes, or until the dough is smooth and elastic.", "Oil a large mixing bowl and add the dough. Cover with cling film and set aside in a warm place for an hour to prove, it should roughly double in size.", "Meanwhile, make the filling for the bread. Heat a little olive oil in a frying pan. When hot, add the onion and cook until it starts to brown. Remove from the heat and add the tomato pureé, harissa, saffron and four tablespoons of water. Stir to make a paste, then set aside to cool.", "For the bread, when the dough has doubled in size, lightly flour a work surface. Turn the proved dough out and divide into four equal portions (use a dough scraper or a serrated bread knife to help you). ", "Roll out the dough into long rectangle shapes, approximately 10x50cm/4x20in and about 5mm/¼in thick.", "Spread the filling over the dough, leaving a 2cm/¾in border round the edge. Top with the olives and goats’ cheese.", "Tightly roll up the dough portions lengthways to form sausage shapes about 50cm/20in long. Using your fingers pinch all along the join to make sure the filling stays inside.", "The rolls of dough can now be lengthened by sketching the dough until it is about 80cm/32in long.", "To form the plait, lay the four pieces of shaped dough on a lightly floured work surface adjacent to each other. Join the strands of dough at one end. Now you are ready to plait the dough.", "Number the strands of dough 1-4 from left to right. Put strand four over into position two, then move strand one over into position three, finally put strand two over three. Repeat until the plait is finished.", "Oil and lightly flour a large flat baking tray. Place a chefs’ ring, about 15cm/6in in diameter, in the centre and grease the outside with a little oil (if you don’t have a chef’s ring you can use a small ovenproof dish instead).", "Place the dough on the baking tray and wrap it around the metal ring. Join the ends together to form a ring. Cover loosely and set aside to prove again for approximately  45 minutes, or until the dough has increased in size.", "Meanwhile make the bessara dip. Place all the ingredients and four tablespoons of water in a food processor and blend until smooth (the consistency should be quite watery). Pour the dip into a saucepan and set aside. ", "Preheat the oven to 220C/425F/Gas 7.", "When the plait has proved, brush it with the beaten egg and bake for 20 minutes, then reduce the temperature to 200C/400F/Gas 6 and bake for a further 25 minutes.", "Remove from the oven and cool on a wire rack.", "While the bread is cooling, warm the dip in the saucepan.", "To serve, place the bread on a board with a small bowl (or tagine) in the centre. Pour the warm dip into the bowl. Decorate the bread and dip with some chopped mint."]}, {"isVegetarian": true, "title": "Moroccan vegetables with couscous", "url": "www_bbc_co_uk_food_recipes_moroccan_vegetables_with_52330", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccan_vegetables_with_52330_16x9.jpg", "ingredients": ["2 small aubergines", "calorie controlled cooking oil spray", "½ medium onion, finely chopped", "½ tsp ground cumin", "½ tsp ground coriander", "¼ tsp hot chilli powder", "pinch ground cinnamon", "227g/8oz tin chopped tomatoes", "½ red pepper, deseeded and diced", "1 medium courgette, cut into 1.5cm/½in chunks", "400g/14oz tin chickpeas, drained and rinsed", "2 heaped tbsp roughly chopped fresh coriander, plus extra to garnish", "400ml/14fl oz vegetable stock, made with ½ stock cube ", "½ small lemon, juice only", "15g/½oz roughly chopped pistachio nuts (alternatively use toasted flaked almonds)", "100g/3½oz  fat-free natural yoghurt, to serve", "½ vegetable stock cube", "80g/2¾oz wholegrain couscous", "½ small lemon, finely grated zest only", "2 heaped tbsp roughly chopped fresh coriander", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Cut the aubergines in half from top to bottom and score in a criss-cross pattern through the flesh. Place on a small baking tray and spray with oil. Season with a little black pepper and bake for 30-40 minutes or until very tender and lightly browned.", "Meanwhile, spray a large non-stick frying pan with oil and place over a medium heat. Add the onion and cook for five minutes, stirring regularly until softened and lightly browned. Add the cumin, coriander, chilli and cinnamon and cook for a few seconds, stirring constantly.", "Pour the tomatoes into the pan. Add the pepper, courgette, chickpeas, coriander and stock. Season with a little salt and lots of ground black pepper and bring to a gentle simmer. Cook for around 20 minutes, stirring occasionally until the vegetables are tender and the sauce is thick. ", "Just before the sauce is ready, make the couscous. Dissolve the stock cube in 100ml/3½fl oz just-boiled water in a medium bowl.  Stir in the couscous, cover and rest for three minutes. Add the lemon zest, coriander and season to taste. Toss well together, using a fork to break up the clumps of couscous.", "Divide the aubergines between four plates. Stir the lemon juice into the chickpeas and season to taste. Spoon the spiced chickpeas over the aubergines. Add the couscous and sprinkle with chopped nuts. Garnish with coriander and yoghurt. "]}, {"isVegetarian": false, "title": "Moroccan baked chicken with chickpeas and rice", "url": "www_bbc_co_uk_food_recipes_moroccanbakedchicken_66018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1x1.5-2kg/3½-4lb chicken, jointed in 8 pieces (or you could use a pack of 8 drumsticks and thighs)", "110g/4oz dried chickpeas", "175g/6oz brown basmati rice", "2 fresh chillies, halved, de-seeded and finely chopped", "1 rounded tsp cumin seeds", "1 level tbsp coriander seeds", "½ tsp saffron stamens", "2x15g packs or 30g/1oz fresh coriander", "2 small thin-skinned lemons", "2 large yellow peppers", "2 large onions", "3 cloves garlic, chopped", "275ml/10fl oz carton good chicken stock", "150ml/5fl oz dry white wine", "50g/2oz pitted black olives", "2 tbsp olive oil", "salt and freshly milled black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["There are two ways to deal with chickpeas. The easiest is to pop them into a bowl, cover them with cold water and leave them overnight or for a minimum of 8 hours. But, if it slips your mind, what you can do is place them in a saucepan, cover them with cold water and bring them up to the boil for 10 minutes. Then turn off the heat and let them soak for 3 hours. Either way, when you want to start making this recipe, the chickpeas need to be simmered for 20 minutes or until tender.", "While they're simmering, place a small frying pan over direct medium heat, add the cumin and coriander seeds and toss them around in a hot pan for about 2-3 minutes or until they start to dance and change colour. Then remove the seeds to a pestle and mortar and crush them coarsely and transfer them to a plate. Next, crush the saffron stamens to a powder with the pestle and mortar, then squeeze out the juice of one of the lemons and add it to the saffron, stirring well.", "Then prepare the chicken by seasoning the joints with salt and pepper. Slice the peppers in half, remove the seeds and pith and cut each half intolarge pieces. The onions should be sliced roughly the same size as the peppers. Now heat 1 tbsp of the olive oil in the flameproof casserole and, when it's really hot, brown the chicken pieces on all sides - don't overcrowd the pan; it's best to do it in two batches, four pieces at a time.", "After that, remove the chicken pieces to a plate, then add the second tablespoon of oil and turn the heat to its highest setting. When the oil is really hot, add the peppers and onions and cook them in the hot oil, moving them around until their edges are slightly blackened - this should take about 5 minutes - then turn the heat down. Strip the coriander leaves from the stalks, wrap them in a piece of clingfilm and keep them in the fridge. Then chop the coriander stalks finely and add these to the peppers and onions, along with the garlic, chillies, crushed spices, the chickpeas and rice, then give everything a good stir to distribute all the ingredients.", "Season well with salt and pepper, then combine the lemon and saffron mixture with the stock and wine, pour it all in to the casserole and stir well. Cut the remaining lemon into thin slices and push these well into the liquid. Now scatter the olives in and, finally, place the pieces of chicken on top of everything. Cover with a tight-fitting lid and place in the pre-heated oven for one hour or until the rice and chickpeas are tender. Then, just before serving, scatter the coriander leaves on top and serve straight away on warmed serving plates."]}, {"isVegetarian": false, "title": "Moroccan fish stew", "url": "www_bbc_co_uk_food_recipes_moroccanfishstew_84341", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanfishstew_84341_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 large onion, thinly sliced", "1 garlic clove, crushed", "2 tsp grated fresh ginger", "1 tsp ground cumin", "1 tsp turmeric", "1 cinnamon stick", "pinch cayenne pepper", "400g/14oz can chopped plum tomatoes", "pinch salt", "500g/1lb 2oz firm white fish fillets (cod, snapper or ling) cut into chunks", "400g/14oz can chickpeas, rinsed and drained", "2 tsp honey", "salt and freshly ground black pepper", "fresh coriander leaves", "flaked almonds, lightly toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large heavy-based pan over a medium heat. Add the onion and cook, stirring occasionally, for five minutes, or until the onion is translucent.", "Add the garlic, ginger, cumin, turmeric and cinnamon stick and cook for two minutes, stirring regularly.", "Add the cayenne pepper, tomatoes, salt and 250ml/9oz of water and cook, stirring frequently, for ten minutes.", "Add the fish and simmer for five minutes, or until the fish is almost cooked through and tender.", "Add the chickpeas and honey and cook for a further 2-3 minutes, then season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon out the tagine into bowls and garnish with fresh coriander leaves and flaked almonds."]}, {"isVegetarian": false, "title": "Moroccan fish tagine with coriander couscous", "url": "www_bbc_co_uk_food_recipes_moroccanfishtaginewi_71274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red onion, finely chopped", "2 garlic cloves, finely chopped ", "2 tbsp groundnut oil", "1 tsp whole cumin seeds", "1 tsp ginger", "1 cinnamon stick", "1 preserved lemon or normal lemon, chopped", "12 green olives, stoned and roughly chopped", "1 tbsp homemade harrissa (see below)", "125ml/4fl oz white wine", "200ml/7fl oz fish stock", "1 pinch of saffron ", "500g/1lb 2oz mixed firm fish, such as monkfish, gurnard, mackerel", "200g/7oz mussels", "100g/3½oz cherry tomatoes", "couscous and coriander to serve", "3 fresh red chillies, roughly chopped", "3 garlic cloves, finely chopped", "1-2 lemons, juice only", "4 tbsp olive oil", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the ground nut oil in a tagine and gently cook the onion and garlic until soft. ", "Add the cumin, ginger, cinnamon stick, preserved lemon and green olives and cook for two minutes. ", "To make the harrissa put the chillies, garlic, lemon juice and olive oil into a food processor and blend into a rough paste.", "Stir in the harrissa and cook for one minute. ", "Add the wine and fish stock and the saffron and bring to a gentle simmer. ", "Add the fish and cook for a couple of minutes, then add the mussels and cherry tomatoes, season with salt and pepper and cover. Cook gently for 6-7 minutes. ", "Serve on a bed of steamed couscous and sprinkle with freshly chopped coriander."]}, {"isVegetarian": false, "title": "Moroccan flatbread wraps with harissa", "url": "www_bbc_co_uk_food_recipes_moroccanflatbreadwra_72278", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanflatbreadwra_72278_16x9.jpg", "ingredients": ["200g/7¼oz plain flour", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp ground cinnamon ", "water, to bind", "pinch of salt", "1 clove garlic, finely chopped", "2 tsp ground cumin", "2 tsp thyme, chopped", "75ml/2½fl oz olive oil", "1 lamb leg steak", "1 aubergine, sliced ", "1 courgette, sliced ", "1 roasted pepper from a jar", "50g/1¾oz sun-dried tomatoes", "100g herby marinated olives, stoned", "1 lemon, juice only", "100g/3½oz rocket", "4 large red chillies", "6 cloves garlic", "25g/1oz fresh coriander", "1 lemon, juice and zest only", "olive oil"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the flatbread, mix the dry ingredients together and add water until a firm dough has formed. ", "Divide the dough into six and roll out the flatbreads thinly. ", "Cook in a very hot, dry, non-stick pan for one minute on each side or until brown spots appear on both sides.", "Now make the filling. Place the garlic, cumin, thyme, and a tablespoon of the olive oil in a bowl and coat the lamb steak well.  Leave this to marinate for one hour.  ", "Meanwhile, brush the courgettes and aubergines with olive oil. Griddle on a hot griddle pan until the vegetables are softened and golden-brown. Set aside.", "Next, place the lamb steak on the hot griddle and cook for a few minutes either side.  Remove from the heat and allow to cool slightly, then slice thinly. ", "Mix the grilled vegetables, roasted pepper and sun-dried tomatoes in another bowl with the olives and pour the remaining olive oil and the lemon juice over them.", "Now make the harissa.  With a hand blender, whiz up the chillies, garlic and coriander with the lemon juice and enough olive oil to make a mayonnaise consistency. Season to taste.", "Lay two flatbreads on a plate and add a couple of spoons of the roasted vegetables to each. Add the sliced lamb, then some rocket, and then a spoon of harissa dressing. Repeat with the remaining flatbreads.", "Roll up the flatbreads and cut in half. Serve the halves around a pile of rocket drizzled with the harissa dressing."]}, {"isVegetarian": false, "title": "Moroccan grilled chicken with preserved lemon", "url": "www_bbc_co_uk_food_recipes_moroccangrilledchick_7323", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccangrilledchick_7323_16x9.jpg", "ingredients": ["1  small chicken, jointed into pieces", "2 tbsp olive oil", "1 preserved lemon, washed and chopped, skin and pith only", "1 clove garlic, crushed", "1 tsp ground cumin", "1 tsp turmeric", "1 tbsp paprika", "1 tsp crushed chilli flakes", "4 tbsp chopped coriander", "4 tbsp chopped parsley", "3 spring onions, finely chopped", "3-4 tbsp preserved lemon brine"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Trim the chicken pieces neatly and combine with the rest of the marinade ingredients in a roomy bowl. Cover loosely and leave in a cool place for a few hours, overnight if possible.", "Preheat the grill or barbecue. It should be moderately hot. Shake the excess moisture off the chicken joints and grill until the juices run clear, test through the thickest part with a skewer. Meanwhile combine the ingredients for the dipping sauce, and leave to infuse.", "Serve the grilled chicken with the dipping sauce on the side."]}, {"isVegetarian": false, "title": "Moroccan lamb steaks with spicy sauce", "url": "www_bbc_co_uk_food_recipes_moroccanlambsteakswi_82141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp turmeric", "1 tsp cumin", "½ tsp ground cinnamon", "1 lamb leg steak, cut into 2 pieces", "olive oil, for drizzling", "¼ red onion, chopped", "½ red pepper, chopped", "1 garlic clove, finely chopped", "1 lime, juice only", "20g/1oz fresh chives, cut into 2in pieces", "salt and freshly ground black pepper", "2 vacuum-packed vine leaves in brine, shredded, to decorate"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the spices together and roll the lamb steaks in the spices and drizzle with the olive oil. ", "Heat a griddle pan until smoking hot, add the lamb and cook for 3-4 minutes on each side. Remove the lamb and keep warm. ", "Add to the pan the red onion, red pepper and garlic, and cook for two minutes. ", "Add the lime juice and chives and cook for another two minutes. Add the lamb and warm through. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the sauce onto a plate, top with the lamb and garnish with the shredded vine leaves."]}, {"isVegetarian": false, "title": "Moroccan lamb tagine", "url": "www_bbc_co_uk_food_recipes_moroccanlambtagine_6696", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanlambtagine_6696_16x9.jpg", "ingredients": ["1 tsp cayenne pepper", "2 tsp ground black pepper ", "1½ tbsp paprika ", "1½ tbsp ground ginger ", "1 tbsp turmeric ", "2 tsp ground cinnamon ", "1 x shoulder of lamb, trimmed and cut into 5cm/2in chunks (about 1.1kg/2½lb meat in total)", "2 large onions, grated ", "2 tbsp olive oil", "2 tbsp argan oil ", "3 cloves garlic, crushed", "570ml/1 pint tomato juice", "2 x 400g tinned chopped tomatoes ", "115g/4oz dried apricots, cut in half", "55g/2oz dates, cut in half", "55g/2oz sultanas or raisins", "85g/3oz flaked almonds ", "1 tsp saffron stamens, soaked in cold water ", "600ml/1 pint lamb stock", "1 tbsp clear honey", "2 tbsp coriander, roughly chopped", "2 tbsp flat leaf parsley, roughly chopped", ""], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the cayenne, black pepper, paprika, ginger, turmeric and cinnamon into a small bowl and mix to combine. Place the lamb in a large bowl and toss together with half of the spice mix. Cover and leave overnight in the fridge.", "Preheat the oven to 150C/300F/Gas2.", "Heat 1 tbsp olive oil and 1 tbsp of argan oil in a large casserole dish. Add the grated onion and the remaining spice mix and cook over a gentle heat for 10 minutes so that the onions are soft but not coloured. Add the crushed garlic for the final 3 minutes. ", "In a separate frying pan, heat the remaining oil and brown the cubes of lamb on all sides then add the browned meat to the casserole dish. De-glaze the frying pan with ¼ pint of tomato juice and add these juices to the pan.", "Add the remaining tomato juice, chopped tomatoes, apricots, dates, raisins or sultanas, flaked almonds, saffron, lamb stock and honey to the casserole dish. Bring to the boil, cover with a fitted lid, place in the oven and cook for 2-2½ hours or until the meat is meltingly tender.", "Place the lamb in a tagine or large serving dish and sprinkle over the chopped herbs. Serve. "]}, {"isVegetarian": false, "title": "Moroccan lamb tagine with lemon and pomegranate couscous", "url": "www_bbc_co_uk_food_recipes_moroccanlambtaginewi_84062", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanlambtaginewi_84062_16x9.jpg", "ingredients": ["4 tbsp olive oil", "8 garlic cloves, peeled and crushed", "4 onions, peeled and chopped", "4 tsp grated, fresh ginger", "1½ tbsp coriander seeds, crushed", "3 tsp ground cinnamon", "sea salt and freshly ground black pepper", "3kg/7lb shoulder of lamb, boned, fat removed and cut into 4cm/1½in cubes", "2 tbsp tomato purée ", "2kg/4½lb ripe tomatoes or 4 X 400g/14oz can tomatoes, coarsely chopped", "4-5 tbsp honey", "1 large or 2 small pomegranates", "800g/1¾lb couscous", "6 tbsp olive oil", "2 lemons, juice only", "1 litre/1¾ pints boiling chicken stock or water", "sea salt and freshly ground black pepper", "4 tbsp chopped, fresh mint or coriander", "1 lime, cut into wedges", "bowl Greek yoghurt"], "serves": "Serves 12-14", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 2.", "For the lamb tagine, heat a large ovenproof casserole or heavy saucepan on a medium to high heat. ", "Add the olive oil, garlic, onions, ginger and spices and season with sea salt and freshly ground black pepper. Stir, then cook, covered, on a low heat for about ten minutes, until the onions are soft.", "Add the lamb, tomato purée, chopped tomatoes and honey into the saucepan, stir throughly.  ", "Bring to the simmer and place in the oven for 1½ hours, until the lamb is tender.  ", "Remove the lid of the saucepan halfway through the cooking time to let the liquid reduce and thicken.", "If the sauce is still a bit thin, put the saucepan on the hob on a medium heat and without the lid. Stir occasionally and let the liquid reduce until a thick sauce begins to appear.", "Meanwhile, for the couscous, cut the pomegranates in half and scoop out the seeds using a teaspoon and remove the white membrane around the seeds. ", "Place the couscous in a bowl and mix in the olive oil and lemon juice.  ", "Pour the boiling stock or water onto the couscous and season with sea salt and freshly ground black pepper.  ", "Allow the couscous to sit in a warm place for 5-10 minutes until the liquid has been absorbed.", "Stir the chopped herbs and pomegranate seeds into the couscous. ", "To serve, place the tagine on serving plates with couscous and a wedge of lime. Serve alongside a bowl of thick Greek yoghurt."]}, {"isVegetarian": false, "title": "Moroccan lamb tagine with pickled lemons and herbed couscous", "url": "www_bbc_co_uk_food_recipes_moroccanlambtaginewi_84105", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "½ onion, finely chopped", "½ red pepper, chopped", "1 garlic clove, finely chopped", "1 lamb neck fillet, cut into bite-sized pieces", "pinch cinnamon", "1 tbsp tomato paste", "½ tsp ground cumin", "pinch ground ginger", "½ tbsp honey", "1 beef stock cube, crumbled", "110g/4oz mixed beans from a can, drained and rinsed", "4 tbsp fresh coriander, roughly chopped", "salt and freshly ground black pepper", "250g/9oz couscous, cooked according to packet instructions", "2 lemons, juice only", "small bunch fresh coriander, roughly chopped", "small bunch fresh mint, roughly chopped", "2 lemons, pricked all over with a fork", "6 tbsp rock salt", "250ml/10 fl oz water"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large deep pan over a medium heat. Add the lamb and fry for 2-3 minutes, or until browned on all sides.", "Add the onion and pepper to the pan and cook over a medium heat for three minutes, making sure the vegetables don't brown.", "Turn up to a higher heat and add the remaining ingredients, except for the beans and coriander, and simmer gently for 10 minutes, or until the meat is cooked through.", "Add the beans and coriander, stir through, turn off the heat and season, to taste, with sea salt and freshly ground black pepper.", "Meanwhile, for the couscous, place all of the ingredients into a bowl and mic well, seasoning, to taste, with sea salt and freshly ground black pepper.", "For the lemons, heat the water until boiling. Add the salt and the pricked lemons and  simmer for 15 minutes, then drain and leave to cool before cutting each into quarters and serving with the tagine."]}, {"isVegetarian": true, "title": "Moroccan-style banana, apricot and cinnamon filo parcel", "url": "www_bbc_co_uk_food_recipes_moroccanstylebananaa_84657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/¾oz butter", "2 tbsp caster sugar", "1 banana, sliced into large chunks", "110g/4oz ready-made filo pastry", "110g/4oz butter, melted", "2 tsp ground cinnamon", "4 tsp caster sugar", "125g/4½oz dried apricots", "40g/1½oz whole almonds, roughly chopped", "2 tbsp honey", "1 orange, zest only", "2 tsp icing sugar", "ice cream, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a frying pan until hot, then add the butter and caster sugar.", "Add the bananas and fry until just golden, then set aside and allow to cool.", "Place one sheet of filo pastry onto a baking sheet and brush generously with some of the melted butter. Dust with half a teaspoon of ground cinnamon and one teaspoon of caster sugar.", "Repeat this layer and dusting with a second, third and fourth layer of filo pastry, butter, cinnamon and sugar.", "Place the bananas along the length of the middle of the top filo sheet.", "Place the apricots, almonds, honey and orange zest into a bowl and mix well. Spoon the apricot mixture over the top of the bananas.", "Fold the sides of the filo pastry over the filling and roll it over, so that the join is underneath.", "Spread with more of the melted butter and dust with icing sugar.", "Place into the oven and bake for 15 minutes, or until the filo is crisp and golden.", "To serve, cut the filo parcel into wedges and serve with a dollop of ice cream."]}, {"isVegetarian": false, "title": "Moroccan lamb tagine with prunes", "url": "www_bbc_co_uk_food_recipes_moroccanlambtaginewi_85679", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "1 onion, chopped", "900g/2lb lean leg of lamb, diced ", "salt and freshly ground black pepper", "½ tsp ground coriander", "½ tsp ground cinnamon", "1 cinnamon stick", "½ tsp ground cumin", "1 tsp ginger", "pinch saffron threads, soaked in 1 tbsp water", "12 prunes, soaked in warm water", "4 tbsp clear honey", "1 tsp orange flower water (or to taste)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of olive oil in a large lidded pan. Add the chopped onion and diced lamb and cook until the meat is coloured on all sides.", "Pour enough water over the meat to cover.", "Add a further two tablespoons of olive oil, the salt, freshly ground black pepper, ground coriander, ground cinnamon, cinnamon stick, ground cumin, ginger, saffron and saffron water to the meat in the pan and bring to the boil.", "Turn the heat down, put the lid on, and allow the meat to simmer for about two hours.", "Add the soaked prunes and leave to simmer for a further 20 minutes.", "Stir in the honey and sprinkle the tagine with orange flower water and serve hot."]}]