[{"ingredients": ["3 cucharadas de mantequilla", "1.5kg / 3lb 5oz -2kg / 4lb 8oz de solla completa", "gran manojo de tomillo fresco", "2 cucharadas de alcaparras", "300 g / 10½ oz de apionabos, reducido a la mitad, pelado y en rodajas", "1 diente de ajo, aplastado", "2 manzanas rojas, como Braeburn o gala, reducidas a la mitad, sin núcleo y en rodajas", "2 cucharadas de vinagre de sidra", "2 cucharadas de nueces, más extra para rociar", "Col negra de 300 g / 10½ oz, hojas rotas por la mitad", "2 cucharadas de aceite de nuez", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6 y alinee una bandeja grande para hornear con papel de cocina con una hoja de papel para hornear en la parte superior.", "Frote una cucharada de mantequilla sobre la solla y sazone con sal. Coloque dos tercios del tomillo en la bandeja de horno preparada y coloque el pescado encima. Dispersa sobre el resto del tomillo y las alcaparras. Cubra con otra hoja de papel para hornear, doblando los bordes de la base de la lámina de cocina para sellar el paquete. Hornee en el horno por 25 minutos.", "Mientras tanto, caliente la mantequilla restante en una sartén grande y fría el apio nabo con el ajo y un poco de sal y pimienta a fuego medio bajo durante 5 minutos. Agregue las manzanas a la sartén y suba el fuego para que las manzanas y el apionabo comiencen a dorarse. Agregue el vinagre de sidra y las nueces y baje la temperatura a bajo. Agregue el cavolo nero y cocine durante 5 minutos o hasta que estén tiernos. Condimentar con sal y pimienta.", "Para servir, transfiera el apio nabo, la manzana y el cavolo nero a un plato para servir y esparza unas pocas nueces extra y una llovizna de aceite de nuez.", "Permita que la solla descanse en su paquete durante 10 minutos antes de servir. Coloque el pescado en un plato grande en su paquete y llévelo a la mesa para la gran revelación."], "url": "www_bbc_co_uk_food_recipes_whole_baked_plaice_with_83393", "title": "Solomillo entero horneado con tomillo, cavolo nero, apio nabo, nueces y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 bok choi, cortado en mitades", "2 filetes de lubina, con piel", "2cm / 1in perilla de raíz fresca de jengibre, en rodajas finas", "2 palitos de limoncillo, magullados y picados por la mitad", "2 cucharadas de aceite de sésamo", "2 cucharadas de salsa de soja", "Fideos de arroz 250 g / 9 oz", "4 cebollas de primavera, cortadas y en rodajas finas", "2 dientes de ajo, picados", "Jengibre fresco de raíz de 5cm / 2in en pieza, aproximadamente picado", "1 guindilla roja larga, más o menos picada", "3 cucharadas de azúcar de palma (o sustituir azúcar morena blanda)", "3 cucharadas de menta fresca picada", "3 cucharadas de cilantro fresco tostado", "2 cucharadas de vinagre de vino de arroz", "2 cucharadas de jugo de lima", "1 cucharada de aceite vegetal"], "method": ["Para la lubina, calentar una olla de agua y colocar un vaporizador en la parte superior. Toma un pedazo de papel de aluminio. Arrolla los bordes para hacer un círculo con una pared alrededor del borde. Hazlo del tamaño correcto para que quepa en el barco de vapor.", "Ponga unas hojas de bok choi en la lámina y coloque los filetes en la parte superior. Agregue más bok choi, jengibre y limoncillo y vierta sobre el aceite de sésamo y la salsa de soja. Siente la lámina en el vaporizador, colóquela y cocine al vapor durante unos cuatro minutos hasta que el pescado esté cocido (dependiendo del tamaño de los filetes).", "Para la ensalada de fideos de arroz, coloque los fideos de arroz en un tazón grande, cúbralos con agua hirviendo y déjelos durante dos minutos. Alternativamente, cocine los fideos de acuerdo con las instrucciones del paquete.", "Escurrir y colocar de nuevo en el tazón junto con las cebolletas.", "Para hacer un aderezo, coloque el ajo, el jengibre, el chile, el azúcar de palma, la menta, el cilantro en un almirez y mortero y machaque hasta obtener una pasta. Agregue el vinagre, el jugo de lima y el aceite y machaque un poco más.", "Justo antes de servir, vista la ensalada de fideos y mezcle.", "Para servir, coloque algunos de los fideos en cada plato de servir. Levante los filetes del vaporizador y colóquelos encima de los fideos. Vierta la salsa de la lámina en la mano y mortero y mezcle, luego vierta un poco sobre el pescado."], "url": "www_bbc_co_uk_food_recipes_whole_baked_seabass_with_36512", "title": "Lubina al vapor con una ensalada de fideos de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_baked_seabass_with_36512_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "6 huevos de gallinas camperas, hervidos, pelados y enteros", "1 cucharadita de cúrcuma molida", "1 cucharadita de ají de Kashmiri en polvo", "Leche de coco 400ml / 14fl oz", "2 cebollas rojas medianas, muy finas en rodajas", "4cm / 1½en raíz fresca de jengibre, finamente triturada", "3 chiles verdes frescos, en rodajas finas, con semillas", "½ cucharadita de sal", "1 cucharadita de azúcar", "puñado de hojas de cilantro, picadas", "½ cucharadita de sal masala", "arroz basmati hervido"], "method": ["Calentar el aceite en una cacerola o karahi de base pesada a fuego medio, agregar los huevos enteros y freír durante 1-2 minutos, o hasta que estén ligeramente coloreados, luego agregar la cúrcuma y el chile en polvo y cocinar por otros 30 segundos. Agregue la leche de coco y cocine a fuego lento.", "Agregue las cebollas, el jengibre, los chiles y la sal, y cocine a fuego lento durante cinco minutos, o hasta que la leche de coco se reduzca a la mitad y las cebollas se ablanden, agregando un chorrito de agua si se vuelve demasiado espeso. Agregue el azúcar y el cilantro y espolvoree con garam masala. Divida los huevos a la mitad y sirva con arroz."], "url": "www_bbc_co_uk_food_recipes_whole_eggs_in_coconut_23624", "title": "Huevos enteros en masala de coco (huevo molee)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_eggs_in_coconut_23624_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pescados frescos enteros (preferiblemente lubina o trucha arco iris) que pesan aproximadamente 300 g / 10½ oz cada uno, eviscerados", "1 cebolleta, finamente cortada", "gran puñado de tallos de cilantro", "2 x hojas de plátano o 2 hojas grandes de papel de aluminio", "sal marina fina, para sazonar", "3 dientes de ajo, dejados enteros", "½ cebolla roja picada", "grandes hojas de cilantro puñado, finamente picadas", "6 pequeños mangos verdes (o 2 grandes mangos), pelados y en rodajas finas", "1 limón, ralladura solamente", "1 cucharada de aceite de semilla de mostaza", "½ pepino, finamente picado", "una pizca de azúcar"], "method": ["El pescado se puede cocinar en la barbacoa o en el horno. Si cocina en el horno, precaliente el horno a su temperatura más alta.", "Rellene los pescados con los tallos de cebolla y cilantro y sazone con sal marina. Envuelva cada pez en una hoja de plátano (o papel de aluminio). Poner en una bandeja y cocinar en el horno o en la barbacoa durante 12 minutos.", "Mientras tanto, para el chutney quema los dientes de ajo en sus pieles en una llama abierta para carbonizarlos. Cuando estén lo suficientemente fríos para manipularlos, quite el ajo de sus pieles y pique finamente.", "Mezcle la cebolla, el ajo, el cilantro, el mango, la ralladura de limón y el aceite de semilla de mostaza. Agregue el pepino, tritúrelo y mezcle para combinarlo en la salsa picante. Sazonar con sal.", "Sirva el pescado en la hoja de plátano con la salsa picante al costado."], "url": "www_bbc_co_uk_food_recipes_whole_fish_cooked_in_a_01738", "title": "Pescado entero cocinado en una hoja de plátano con chutney de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_fish_cooked_in_a_01738_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 limón de piel fina", "50 g / 1 oz de azúcar en polvo", "2 limones pequeños o 1 grandes de piel fina", "275g / 9¾oz de mantequilla ablandada", "275g / 9¾oz de azúcar en polvo", "275g / 9¾oz de harina de auto crianza", "Polvo de hornear 2 cucharaditas de nivel", "4 huevos de gallinas camperas", "50g / 1¾oz de mantequilla suave", "175g / 6oz de azúcar glas", "250g / 9oz de grasa total italiano mascarpone", "Azúcar glas fondant 175g / 7oz"], "method": ["Para la decoración, usando un zester, pele largas tiras de corteza de limón. Si no tiene una zester, pele finamente el limón, luego córtela en tiras finas. Guarde el limón restante.", "Coloque la cáscara en una cacerola, cubra con agua hirviendo y la mitad del azúcar impalpable y hierva durante un minuto. Escurra y seque, luego colóquelo en papel pergamino antiadherente. Disperse sobre el azúcar restante y mezcle para cubrir la cáscara de limón. Coloque el pergamino para hornear antiadherente y déjelo en un lugar tibio para que se seque durante el mayor tiempo posible o durante la noche, hasta que esté crujiente. Si tiene prisa, seque en un horno bajo 110C / 225F / Gas ¼ por 30 minutos.", "Corte el limón zested por la mitad y exprima el jugo. Déjalo a un lado para hacer la guinda.", "Para la torta, coloque los dos limones enteros (o uno grande) en una olla pequeña, cúbralos con agua, deje que hiervan y cocine a fuego lento durante 20 minutos o hasta que estén suaves y tiernos. Escurrir, cortar los limones por la mitad y eliminar las pepitas.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador de 160 ° C).", "Coloque los limones, incluida la piel, en un procesador de alimentos y procese hasta que estén suaves, pero aún con algunos trozos gruesos. Pon la mezcla en un tazón pequeño.", "Agregue todos los ingredientes restantes de la torta en el procesador de alimentos y mezcle hasta que quede suave. Levante la cuchilla y agregue un poco más de la mitad de la pulpa de limón. Pon el resto a un lado.", "Divida la mezcla de manera uniforme entre las dos latas y hornee por 30 minutos, o hasta que se dore y se encoja del borde de las latas.", "Deje que se enfríe durante cinco minutos, luego retire las tortas, despegue el pergamino para hornear y deje que se enfríe en una rejilla.", "Para el relleno de limón, mezcle la mantequilla y el azúcar glas en un procesador de alimentos hasta que quede suave y cremoso. Agregue el mascarpone, mezcle de nuevo y luego agregue la pulpa de limón y mezcle hasta que esté mezclado.", "Corta ambos pasteles a la mitad para que tengas cuatro capas. Extienda la crema de limón uniformemente entre las capas, apilándolas una encima de la otra.", "Mezcle el azúcar glasé fondant con 1-2 cucharadas de jugo de limón (del limón que se utiliza para hacer la decoración del cáscara confitada) para obtener una consistencia espesa. Vierta el glaseado sobre la parte superior de la tarta y deje que gotee. Espolvoree la cáscara de limón confitada encima."], "url": "www_bbc_co_uk_food_recipes_whole_lemon_cake_with_40866", "title": "Pastel de limón entero con glaseado de tarta de queso de limón", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_lemon_cake_with_40866_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 caballa, mariposa y huesos eliminados, dejó todo", "4 cucharadas de aceite de colza", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "1 chalote, picado", "1 calabaza, pelada y cortada en cubos pequeños", "Anís de 2 estrellas", "250ml / 9fl oz de caldo de pollo", "2 cucharadas de semillas de sésamo", "2 cucharadas de perejil fresco picado", "2 cabezas de hinojo, afeitadas en una mandolina y colocadas en agua helada", "1 cabeza de lechuga Little Gem, hojas separadas", "1 achicoria de cabeza, hojas separadas", "2 yemas de huevo", "1 cucharada de mostaza Dijon", "1 limón, solo jugo", "200ml / 7fl oz de aceite de oliva", "sal y pimienta"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y caliente una sartén de plancha.", "Cepille la caballa con aceite y sazone con sal y pimienta. Coloque sobre la plancha caliente y cocine brevemente en ambos lados. Termínelos en el horno por 2-3 minutos.", "Para la calabaza, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el ajo y la chalota y cocine por 2-3 minutos. Agregue la calabaza y el anís estrellado y cocínelos por un minuto más. Vierta el caldo de pollo y sazone con sal y pimienta. Cocine por 4-5 minutos o hasta que la calabaza esté tierna.", "Para la ensalada, escurra el hinojo y agréguelo a un tazón grande con la Pequeña gema y la achicoria.", "Para el aderezo, mezcle las yemas de huevo, la mostaza y el jugo de limón en un procesador de alimentos. Con el motor en marcha, agregue gradualmente el aceite hasta que el apósito se emulsione. Sazonar con sal y pimienta, al gusto.", "Vierta el aderezo sobre las hojas de ensalada y mezcle para combinar.", "Para servir, agregue las semillas de sésamo y el perejil fresco a la calabaza y colóquelos en platos para servir cubiertos con la caballa. Sirve la ensalada en el lado."], "url": "www_bbc_co_uk_food_recipes_whole_mackerel_with_76893", "title": "Caballa entera con calabaza y una ensalada de hinojo y achicoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pato de rango libre inglés completo, recortado, alas retiradas", "sal", "1 cucharadita de granos de pimienta de Sichuan, molidos", "300ml / 10fl oz de caldo de pollo o pato (preferiblemente hecho con las menudencias)", "6 ramitas de tomillo, hojas recogidas", "100 g / 3½ oz de mantequilla", "1 limón, solo cáscara", "4 lechugas Little Gem, cortadas a la mitad a lo largo y lavadas", "150g / 5½oz de miel clara", "75 g / 2½ oz de salsa de soja", "Patata cocida al horno 250g / 9oz, solo carne, puré", "Harina normal de 75g / 2½ oz", "1 cucharadita de polvo de hornear", "2 huevos de gallinas camperas", "125ml / 4fl de leche en oz", "sal y pimienta para probar", "aceite para cocinar"], "method": ["Precalienta el horno a 200C / 400F / Gas 6. Con un cuchillo pequeño y afilado, perfora la piel del pato por todas partes, pero ten cuidado de no rasgar agujeros en la piel. Sazonar el pato con sal y el pimiento Sichuan molido y colocar sobre una rejilla de alambre en una lata para asar. Asar en el horno durante 25 minutos.", "Vierta cualquier exceso de grasa en una jarra. Reduzca la temperatura del horno a 120C / 250F / Gas ½. Cuando esté a 120 ° C / 250 ° F / Gas 1/2, devuelva el pato al horno y cocínelo por 1 hora más, hilvanando con la grasa reservada cada 20 minutos.", "Mientras el pato se está tostando, ponga a hervir el pato o el caldo de pollo con el tomillo, la mantequilla y la cáscara pelada de un limón. Coloque la lechuga en el caldo y cubra con una tapa o papel de aluminio. Baje la temperatura y cueza en la placa durante 8-10 minutos, o hasta que la lechuga comience a marchitarse. Retirar del fuego y mantener caliente hasta que esté listo para servir.", "Retire el noventa por ciento de la grasa de pato de la lata de tueste y vierta la miel sobre el pato. Encienda el horno a 180 ° C / 350 ° F / Gas 4 y coloque el pato en el horno por otros 15-20 minutos, hilvanando cada cinco minutos y asegurándose de que la miel no se queme. En el plato final, rocíe la salsa de soja sobre el pato. Cuando esté cocido, retire el pato del horno y déjelo a un lado para que descanse.", "Mientras el pato está descansando, haga los panqueques de papa. Mezcle el puré frío, la harina y el polvo de hornear juntos. En otro tazón o jarra, mezcle los huevos y la leche. Viértalo en la mezcla de puré y harina y revuelva suavemente para hacer una mezcla (no se preocupe por unos pocos grumos). Sazonar con sal y pimienta al gusto. Freír las cucharadas de la mezcla de rebozado en una sartén antiadherente con un poco de aceite hasta que estén doradas por cada lado. Retirar del fuego y mantener caliente.", "Tallar el pato y servir con la lechuga estofada y los panqueques de papa. Vierte un poco del licor de cocina de la lechuga en la parte superior y dóblate."], "url": "www_bbc_co_uk_food_recipes_whole_roast_duck_with_56138", "title": "Pato asado entero con lechuga estofada y panqueques de patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 2 generosamente", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva para lloviznar", "50g / 1¾oz de mantequilla", "1 limón, ralladura solamente", "2-3 dientes de ajo grasos, en rodajas finas", "1 gran John Dory (alrededor de 1kg / 2lb 4oz,) limpiado y eviscerado", "3-4 hojas de laurel", "100 ml / 3½ fl oz de vino blanco o vermut", "Mejillones 300 g / 10½ oz, limpios, sin barba", "8 langostinos, concha cruda", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Alinee una lata de asar grande con papel de aluminio, dejando un montón de superposición para que pueda crear una tienda de campaña alrededor de los pescados y mariscos. Rocíe la lámina con aceite de oliva y agregue unos pequeños panecillos de mantequilla y esparza la mitad de la ralladura de limón y el ajo. Sazonar el pescado por dentro y por fuera. Coloque una pequeña cantidad de la ralladura de limón restante, ajo y una hoja de laurel dentro del pescado. Coloque el pescado sobre la hoja sazonada, cubra con la ralladura de limón restante, el ajo y las hojas de laurel y vierta sobre el vino blanco o el vermut, luego rocíe con un poco más de aceite de oliva.", "Junta la lámina sobre el pez y dobla sobre los bordes para sellar y hacer una carpa hermética. Hornee en el horno por 20 minutos.", "Deseche cualquier mejillón abierto que no se cierre cuando se le da un golpecito fuerte. Retire el pescado del horno, abra la lámina y agregue los mejillones y la langostinos. Ponga más mantequilla en el punto, vuelva a sellar la lámina y vuelva al horno durante 5-10 minutos, hasta que el pescado esté cocido y los mejillones se hayan abierto. Deseche cualquier mejillón que no se haya abierto. Sirva con los jugos de mantequilla una vez cubiertos."], "url": "www_bbc_co_uk_food_recipes_whole_roast_john_dory_54432", "title": "Carne asada entera John Dory con mejillones y langostinos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 apio nabo, frotado", "2 cucharadas de mantequilla sin sal", "½ cucharada de sal", "2 bayas de enebro", "250ml / 9fl oz de vinagre de vino blanco", "Azúcar 250 g / 9 oz", "2 remolachas rosadas o amarillas, peladas y en rodajas finas", "4 rebanadas de pan de masa fermentada, cortadas en cubos", "4 cucharadas de mantequilla", "½ cucharada de vinagre de jerez o vinagre de vino blanco", "sal y pimienta negra recién molida", "1 manojo de brotes de guisantes", "1 manojo de hojas de apio", "Avellanas de 250g / 9oz, peladas y tostadas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Frote el apionabo con la mantequilla sin sal y media cucharada de sal y envuelva en papel de aluminio. Asar en el horno durante 45 minutos, o hasta que estén cocidos todo el tiempo.", "Mientras tanto, aplastar las bayas de enebro con un mortal o la parte posterior de un cuchillo. Poner en una cacerola con el vinagre de vino blanco, el azúcar y una cucharadita de sal y llevar a ebullición. Batir hasta que el azúcar se haya disuelto. Agregue 500ml / 18fl oz de agua fría.", "Coloque las remolachas en el líquido decapante y déjelas a un lado durante 30 minutos.", "Para hacer los croutons, derrita 2 cucharadas de mantequilla en una sartén a fuego medio.", "Freír los cubos de pan durante 5-10 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Condimentar con sal y pimienta.", "En la misma sartén, haz la salsa de mantequilla marrón. Agregue las 2 cucharadas restantes de mantequilla y cocine hasta que estén doradas. Agregue el vinagre de jerez y sazone con sal y pimienta.", "Mezcle las rodajas de remolacha en escabeche, los guisantes y las hojas de apio. Vístete con un poco del líquido decapante.", "Para servir, corte el apio nabo en cuartos. Sumérjase entre cuatro platos y cubra con los croutons, las avellanas, la ensalada y la salsa de mantequilla marrón."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_celeriac_99598", "title": "El apio nabo entero asado con avellanas, crutones de masa fermentada y verduras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 75 g / 2½ oz", "1 lenguado de Dover, fileteado", "75g / 2½oz de mantequilla sin sal", "50g / 1¾oz de mantequilla salada", "1 limón, solo jugo", "1 pepino, pelado y picado", "2 cucharadas de eneldo fresco picado", "sal y pimienta negra recién molida", "7 ostras, descascaradas y limpias (pida a su pescadero que haga esto por usted)", "apretón de jugo de limón", "300 ml / 10 fl oz de aceite vegetal o de colza, más una llovizna extra", "50g / 1¾oz de harina natural", "1 huevo de gallinas camperas, golpeado", "50g / 1¾oz de panko breadcrumbs", "½ cabeza de brócoli, quebrada en florecillas", "100g / 3½oz de frijoles franceses", "1 gran puñado de espinacas baby", "50 g / 1¾oz de mantequilla sin sal", "apretón de jugo de limón"], "method": ["Precalentar la parrilla a mediano.", "Para hacer la suela, sazone la harina y polve la suela hasta cubrirla por completo.", "Derretir la mantequilla sin sal en una sartén grande a prueba de horno a fuego medio. Coloque los solomillos en la sartén, con el lado oscuro hacia arriba, y cocine suavemente durante 5 minutos. Transfiera a la parrilla y cocine por 3-4 minutos, o hasta que esté cocido.", "Mientras tanto, olace una sartén limpia a fuego medio. Derretir la mantequilla salada y cocinar hasta que esté de color marrón. Apague el fuego y agregue el jugo de limón (párese un poco, ya que salpicará). Agregue el pepino y el eneldo y reserve.", "Para hacer las ostras, precaliente el aceite en una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle tres ostras con un chorrito de limón y un chorrito de aceite para hacer la mayonesa. Temporada.", "Coloque la harina, el huevo y las migas de pan en tazones separados. Sumerja las ostras primero en la harina, luego el huevo, luego el pan rallado. Sacuda cualquier exceso y con cuidado bájelos en la freidora. Freír hasta que estén doradas. quite con una espumadera y escurra sobre papel de cocina.", "Para hacer los verdes, pula el brócoli y los frijoles en una olla de agua hirviendo durante 3 minutos. Saltee la espinaca en la mantequilla, luego agregue los frijoles y el brócoli. Sazone con sal y pimienta y un chorrito de jugo de limón.", "Para servir, transfiera los filetes de lenguado a un plato de servir. Agregue los verdes y vierta sobre la mantequilla de pepino y eneldo. Sirva con las ostras fritas y la mayonesa de ostras."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_dover_sole_08981", "title": "Suela de Dover asada con ostras y verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 lubinas enteras, evisceradas", "4 ramitas de orégano", "6 papas, cortadas en 1cm / ½ en rodajas", "1 guindilla roja, sin semillas, más o menos picadas", "2 cucharaditas de comino molido", "2 cucharaditas de semillas de alcaravea molidas", "1 cucharada de pimentón dulce ahumado", "2 dientes de ajo, pelados", "2 cucharadas de puré de tomate", "3 cucharadas de vinagre de vino tinto", "4 cucharadas de aceite de oliva, más extra para engrasar"], "method": ["Precalentar el horno a 190 ° C / 375 ° F / Gas 5.", "Recorte la lubina, quitando las aletas con tijeras y marcando la carne en un patrón entrecruzado.", "Para la pasta harissa, coloque todos los ingredientes en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Frote la pasta Harissa sobre el pescado y rellene la cavidad del pescado con orégano.", "Tome dos pedazos grandes de papel de aluminio lo suficientemente grande como para envolver a cada pez con espacio de sobra. Coloque un trozo de papel antigrasa de igual tamaño encima de cada uno, luego engrase ligeramente con aceite.", "Divida las papas entre los pedazos de papel resistente a la grasa y coloque un pescado encima. Envuelva el papel y papel de aluminio a prueba de grasa alrededor de los peces como un pastel de Cornish, utilizando la lámina para sellar la unión.", "Asar en el horno durante 20-25 minutos.", "Para servir, retire el pescado del horno y abra con cuidado la envoltura. Use una rebanada de pescado levante el pescado y colóquelo en un plato de servir. Coloque las papas alrededor del pescado y cuchara sobre los jugos que quedan en la bolsa."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_sea_bass_45008", "title": "Lubina asada entera con pasta harissa, papas al vapor y orégano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pato entero, cortado y alas retiradas", "sal y pimienta negra recién molida", "2 patatas grandes, peladas y cortadas en cubos de 1cm / ½ en cubos", "100 g / 3½ oz de grasa de pato (recortada de todo el pato)", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "2 ramitas de tomillo, hojas recogidas", "1 hoja de laurel", "5 granos de pimienta negra", "200ml / 7fl oz de vino tinto", "Jus de ternera 300ml / 10½fl oz, calentado (disponible en algunos grandes supermercados)", "azúcar pizca", "Brócoli brotación brote 400g / 14oz", "75g / 2½oz de mantequilla sin sal"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pato asado entero, use un cuchillo pequeño y filoso para perforar la piel del pato, pero tenga cuidado de no abrir agujeros en la piel. Sazone el pato con sal y pimienta negra y colóquelo sobre una rejilla de alambre en una lata para asar. Asar por 25 minutos.", "Retire el pato del horno y vierta el exceso de grasa de la lata de tostado en una jarra. Reduzca la temperatura del horno a 120C / 250F / Gas ½.", "Cuando el horno alcance 120C / 250F / Gas ½, devuelva el pato al horno y cocínelo por 1¼ horas más - rociándolo con la grasa reservada cada 20 minutos. Una vez cocinado, deje que el pato descanse durante 30 minutos.", "Para las papas grasas de pato, caliente una sartén grande y agregue la grasa de pato. Una vez caliente y derretido, agregue las papas en cubitos y cocine durante 6-8 minutos, o hasta que estén doradas y tiernas.", "Para la salsa bordelaise, caliente una olla mediana y agregue la mantequilla. Una vez caliente, agregue la chalota y cocine por 2-3 minutos. Agregue el tomillo, la hoja de laurel y los granos de pimienta y cocine por unos minutos.", "Agregue el vino tinto y cocine hasta que el volumen del líquido se haya reducido a la mitad. Vierta el cálido jus de ternera y reduzca a la mitad nuevamente. Sazonar con un poco de azúcar, al gusto. Pase a través de un colador fino y déjelo a un lado en un lugar cálido hasta que esté listo para servir.", "Para el brócoli que brota púrpura, ponga a hervir un sartén grande de agua con sal. Agregue el brócoli y cocine por 2-3 minutos. Retire del agua y revuelva en agua helada.", "Derretir la mantequilla en una sartén grande. Agregue el brócoli y fríalo suavemente durante 1-2 minutos.", "Para servir, quite las pechugas de pato del pato asado y córtelo en pedazos. Divida la carne entre platos para servir. Sirva las papas y el brócoli junto al pato con una cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_duck_with_88418", "title": "Pato asado entero con brócoli brotación púrpura, papas gordas de pato y salsa bordelaise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de jugo de limón", "2 cucharadas de jengibre de raíz pelado y finamente picado", "2 cucharadas de ajo picado o picado", "3 chiles verdes calientes, finamente picados", "½ cucharadita de sal", "1 cucharadita de cilantro molido", "1 cucharadita de sal masala", "Pollo entero de 1.75kg (3lb 14oz), sin piel", "½ cucharadita de chile en polvo", "½ cucharadita de pimienta negra recién molida", "2 cucharadas de aceite de oliva o girasol", "5 papas medianas, peladas, cortadas a la mitad a lo largo y cortadas en trozos de 5x4cm / 2x1½ pulgadas", "½ cucharadita de sal", "¾ cucharadita de pimienta negra recién molida", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "½ cucharadita de cúrcuma", "1 cucharadita de chile en polvo Kashmiri (suave)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque todos los ingredientes del adobo en una licuadora y procese hasta obtener una pasta.", "Con un cuchillo afilado, haga dos cortes profundos y diagonales en cada pechuga del pollo, yendo hasta el hueso. Haga dos barras igualmente profundas en los muslos y dos en los muslos también.", "Coloque el pollo, con la pechuga hacia arriba, sobre una bandeja para hornear forrada con suficiente papel de aluminio para cubrir completamente al ave.", "Vierta la pasta de adobo sobre el pollo, frotándolo bien en todos los cortes. Reserve por 30 minutos.", "Espolvoree el chile en polvo y la pimienta negra sobre el pollo de manera uniforme. Envuelva el pollo en la lámina para que esté completamente cubierto, con la costura bien cerrada en la parte superior.", "Hornee en el medio del horno caliente durante una hora.", "Desenvuelva, sin dejar que los jugos se agoten, y cocine, sin tapa, durante 15 minutos, rociando dos o tres veces con los jugos.", "Compruebe que el pollo esté cocido insertando un pincho en la parte más gruesa del muslo, entre la pierna y el cuerpo. Si los jugos se hacen transparentes sin ningún rastro de rosa, se cocinan. Continúe cocinando por un poco más si es necesario.", "Precalentar el horno a 180C / 350F / Gas 4.", "Mientras tanto, para las papas masala asadas, vierta el aceite en un tazón grande. Agregue las papas y espolvoree sal y pimienta. Asegúrese de que las papas estén bien cubiertas, luego transfiéralas a una bandeja para hornear en una sola capa.", "Coloque en el medio del horno y tueste durante 20 minutos.", "Coloque el cilantro, el comino, la cúrcuma y el chile en polvo sobre un plato y mezcle bien.", "Retire las papas del horno. Usando pinzas, enrolle las papas en la mezcla de especias, asegurándose de que todos los lados estén cubiertos.", "Devuélvalos al horno durante otros 20 minutos, o hasta que estén ligeramente dorados y tiernos al atravesarlos con un cuchillo.", "Coloque el pollo en un lugar cálido para descansar durante 10-15 minutos, luego talle y sirva con las papas masala asadas."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_masala_77631", "title": "Pollo y patatas de masala entero asado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_roasted_masala_77631_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de miel", "las hojas de la remolacha herencia (de abajo)", "100ml / 3½fl oz de vinagre de vino de arroz", "1 chalote, pelado y en rodajas", "pizca de sal", "1 lubina salvaje completa o 2 cultivadas, aletas retiradas y limpiadas", "1 manojo de remolachas y hojas", "2 cucharaditas de aceite de oliva", "1 ramita de tomillo fresco", "1 achicoria de cabeza, hojas separadas", "1 cebolla roja pequeña", "Mitades de 100g / 3¼oz de nuez", "3 cucharadas de aceite de nuez", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de Jerez"], "method": ["Para el pepinillo, coloca los ingredientes en una olla mediana con 100 ml de agua y caliéntalos hasta que la miel se haya disuelto. Vierta en un recipiente y deje enfriar.", "Agregue las hojas de remolacha a la salmuera y deje por lo menos 2 horas.", "Para la ensalada, precaliente el horno a 200C / 180C Fan / Gas 4.", "Coloque la remolacha en papel de aluminio, sazone con sal y pimienta negra recién molida, rocíe con aceite y cubra con el tomillo. Envuelva la lámina en un paquete y selle la parte superior. Hornea por 20-40 minutos. Retirar del horno y reservar para enfriar.", "Para la lubina, precaliente el horno a 180 ° C / 160 ° Fan / Gas 5. Coloque la lubina en una bandeja para hornear forrada con papel de aluminio. Cubra el pescado con otra hoja de papel de aluminio. Cocine en el horno durante 10 minutos, luego retire la lámina superior para destapar el pescado y cocine por otros 10-15 minutos.", "Caliente una sartén de la plancha y rocíe la achicoria con el aceite y colóquela en la plancha por 2-3 minutos, o hasta que esté todo carbonizado.", "Coloque la achicoria en un tazón grande, agregue la cebolla y las nueces. Pele la remolacha fría, córtela en pedazos y agregue al tazón. Mezcle para combinar.", "Batir el aceite de nuez, la mostaza de Dijon, el vinagre, la sal y la pimienta en un tazón pequeño. Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle.", "Para servir, coloque la ensalada en el plato con el filete de lubina copos y adorne con las hojas de remolacha."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_seabass_96858", "title": "Lubina asada entera con ensalada de remolacha", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 papas para hornear grandes", "75 g / 2½ oz de carne de cangrejo blanco", "25 g / 1 oz de carne de cangrejo marrón", "1 cucharada de perejil finamente picado", "½ limón, solo ralladura", "sal y pimienta", "50g / 1¾oz de harina natural", "2 huevos de gallinas camperas, golpeados", "100 g / 3½ oz de almendras en hojuelas, finamente picadas", "aceite de girasol, para freír en grasa", "1kg / 2lb 4oz tomates patrimonio, en rodajas", "100g / 3½oz de aceitunas negras deshuesadas", "6 dientes de ajo, con piel, aplastados", "4 cucharadas de aceite de oliva", "1 lubina salvaje entera, eviscerada y escamada, piel marcada", "2 cucharadas de eneldo picado", "2 cucharadas de mejorana picada", "2 cucharadas de perifollo picado", "1 cabeza de lechuga rizada", "4 cucharadas de perejil picado", "2 cucharadas de cebollines, cortados en longitudes de 1 cm / ½ in", "4 cucharadas de aceite de oliva", "1 cebolla roja, cortada en finas cuñas, extremo de la raíz izquierda en", "1 limón, solo jugo"], "method": ["Para las croquetas de cangrejo, precaliente el horno a 200C / 400F / Gas 6. Hornee las papas durante una hora, luego sáquelas del horno y déjelas reposar hasta que estén lo suficientemente frías para manipularlas.", "Saque la patata tibia y el puré en un tazón. Agregue la carne de cangrejo, el perejil y la ralladura de limón. Sazonar con sal y pimienta y mezclar.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvorea las almendras picadas en otro plato.", "Forme la mezcla de cangrejo en bolas pequeñas o formas cilíndricas. Separar cada croqueta en la harina, sumergir en el huevo, luego rodar las almendras hasta que esté completamente cubierto. Dejar enfriar en la nevera durante al menos una hora para descansar.", "Para cocinar la lubina, precaliente el horno a 190C / 375F / Gas 5.", "Coloque los tomates en rodajas, las aceitunas y el ajo en el fondo de una bandeja para hornear y rocíe sobre dos cucharadas de aceite de oliva.", "Rellene la cavidad de la lubina con las hierbas y coloque el pescado encima de los tomates y las aceitunas.", "Rocíe el resto del aceite de oliva y coloque un poco de papel de aluminio sobre el pescado. Hornee en el horno durante aproximadamente 20 minutos, hasta que estén cocidos, dependiendo del tamaño de su lubina. Retire la lámina durante los últimos 10 minutos.", "Para cocinar las croquetas de cangrejo, caliente una olla profunda de fondo grueso medio llena de aceite de girasol o caliente una freidora a 160 ° C / 325 ° F.", "Con cuidado, baje las croquetas en el aceite caliente, en tandas si es necesario, y freír durante 2-3 minutos, o hasta que estén doradas y calientes por dentro.", "Retire las croquetas del aceite con una espumadera y déjelas a un lado para escurrirlas sobre papel de cocina. Mantener caliente", "Para hacer la ensalada, caliente una sartén a fuego alto y rocíe una cucharada de aceite sobre las rodajas de cebolla. Coloque en la plancha durante 2-3 minutos en cada lado hasta que aparezcan las marcas de la barra.", "Coloque las hojas y las hierbas frisée en un tazón de servir grande y agregue las cuñas de cebolla.", "En un tazón pequeño bata el aceite restante con el jugo de limón. Vierta el aderezo sobre la ensalada justo antes de servir.", "Para servir, coloque una sección de lubina en cada plato con los tomates y aceitunas, croquetas y ensalada."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_seabass_on_29102", "title": "Lubina asada entera en una cama de tomates y aceitunas negras, con croquetas de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3.5kg / 7lb 10oz hombro de cerdo deshuesado", "6-8 cucharadas de aceite de oliva", "4 cucharadas de sal marina", "4 ramitas de tomillo, hojas recogidas", "1 limón, ralladura solamente", "2 cebollas en rodajas", "4 manzanas Bramley, peladas y picadas", "50g / 1¾oz de mantequilla", "2-4 cucharadas de azúcar en polvo, al gusto", "700g / 1lb 9oz papas King Edward, peladas y cortadas en trozos", "100 g / 3½ oz de mantequilla", "Crema doble de 200 ml / 7 fl oz", "1 col de primavera, en rodajas", "sal y pimienta negra recién molida", "300ml / 10fl oz de salsa de cerdo"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3.", "Para la carne de cerdo, con un cuchillo afilado, marcar la piel del cerdo en tiras. Frote la piel con aceite de oliva y frote la sal, el tomillo y la ralladura de limón. Coloque las cebollas en una lata para asar de lados profundos, ponga la carne de cerdo encima y tueste durante 5 horas.", "Para la salsa de manzana, ponga las manzanas en una cacerola con 3 cucharadas de agua, la mantequilla y 2 cucharadas de azúcar. Cubra y coloque a fuego medio hasta que esté suave y esponjoso, revolviendo ocasionalmente. Pruebe y agregue más azúcar si lo desea. Dejar de lado.", "Para la carne de cerdo, después de 5 horas, aumente la temperatura del horno a 230 ° C / 210 ° Ventilador / Gas 8 y ase la carne de cerdo por otros 40-45 minutos, o hasta que el crujiente esté crujiente.", "Para el puré, cocine las papas en una olla de agua hirviendo con sal durante 10-15 minutos, o hasta que estén tiernas.", "Escurrir las papas, luego volver a la sartén al fuego y calentar suavemente para eliminar el exceso de humedad. Retire del fuego y mezcle las papas con la mantequilla y la crema hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida. Reserve y mantenga caliente hasta que esté listo para servir.", "Para las verduras de primavera, caliente una sartén hasta que esté caliente, agregue la mantequilla y, cuando se derrita, agregue el repollo y un chorrito de agua. Cocine por unos minutos, o hasta que el repollo esté tierno y la mayor parte del agua se haya evaporado. Sazone con sal y pimienta negro.", "Para servir, esculpe la carne de cerdo en rebanadas gruesas y colóquela en platos. Coloque las papas al lado con una cucharada grande de salsa de manzana y repollo. Rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_shoulder_98339", "title": "Paletilla de cerdo asada con tomillo y sal de limón, puré, hojas de primavera y salsa de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz pequeña, delicada calabaza (u otra calabaza joven), descuartizada y sin semillas, pero sin pelar, muy finamente cortada en una mandolina", "200ml / 7fl oz de vinagre de sidra", "50 g / 1 oz de azúcar en polvo", "2 cucharaditas de semillas de cilantro", "buenos copos de chile pizca", "algunas ramitas de tomillo fresco, hojas recogidas", "4 puñados generosos cohetes salvajes", "30g / 1oz de nueces tostadas (o picadas)", "150g / 5½oz cuajada de queso, para servir", "aceite de oliva virgen extra, a llovizna", "8 cucharadas de aceite de oliva virgen extra", "3 cucharadas de jugo de limón", "1½ cucharadita de sal", "3 cucharadas de orégano fresco picado (o mejorana)", "1.5kg / 3lb 5oz de papas cerosas grandes, como Desiree o Charlotte, cortadas en rodajas de 8-10mm de grosor", "4 dientes de ajo grasos, en rodajas finas", "8 filetes de anchoa en aceite de oliva, escurridos y en rodajas", "1.75kg / 4lb lubina entera (o pargo rojo), eviscerado y a escala", "1 limón no encerado, en rodajas finas", "3 hojas de laurel", "3 hojas de limón (si puedes conseguirlas)", "copos de sal marina y pimienta negra recién molida"], "method": ["Para la ensalada, coloque la calabaza en un plato para horno poco profundo. En una sartén, mezclar el vinagre, el azúcar, las semillas de cilantro y 200 ml / 7 fl oz de agua, luego llevar a ebullición. Vierta esta mezcla sobre la calabaza, agregue los copos de chile y el tomillo, cubra y deje encurtido durante al menos 1 hora.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para el aderezo, mezcle el aceite, el jugo de limón, la sal y un poco de pimienta, luego agregue el orégano.", "Para la lubina, coloque las papas en una lata grande para asar en la que el pescado pueda colocarse longitudinalmente o en diagonal. Agregue 6 cucharadas de aderezo, el ajo y las anchoas. Mezcle bien, distribuya en una capa pareja y tueste durante 30-35 minutos.", "Mientras tanto, corta la carne del pez 5-6 veces en cada lado. Sazone la cavidad con sal y pimienta, luego rellene con el limón, la bahía y las hojas de limón, si las usa.", "Retire las papas del horno y libérelas del fondo de la lata si se han atascado. Cepille el exterior del pescado con un poco del aderezo restante y sazone con sal y pimienta. Póngalo encima de las papas y vierta el aderezo restante en la cavidad. Regrese al horno por 35 minutos, o hasta que el pescado esté cocido y las papas estén tiernas.", "Cuando esté listo para servir, divida la calabaza entre cuatro platos y agregue porciones generosas de cohete. Espolvoree con nueces y queso, rocíe con aceite y sazone con sal y pimienta. Sirve inmediatamente con el pescado y las patatas."], "url": "www_bbc_co_uk_food_recipes_whole_sea_bass_baked_on_19811", "title": "Lubina entera al horno en patatas de anchoas y ajo con ensalada de calabaza y nueces en escabeche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_sea_bass_baked_on_19811_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalota grande, más o menos picada", "6 anchoas, aproximadamente picadas", "1 cucharadita de mostaza Dijon", "2 cucharadas de hojas de menta picadas, tallos reservados", "2 cucharadas de eneldo picado, tallos reservados", "2 cucharadas de estragón picado, tallos reservados", "2 cucharadas de perejil de flatillo troceado, tallos reservados", "2 cucharadas de berros aproximadamente picados, tallos reservados", "2 cucharadas de albahaca fresca rasgada", "4 cucharadas de aceite de oliva virgen extra, más extra para lloviznar", "2 cucharadas de alcaparras, escurridas", "3 limones, cortados a la mitad", "Trucha entera de 1.5kg / 3lb 5oz, limpiada y eviscerada", "400g / 14oz de patatas nuevas, par hervido", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 210C / 425F / Gas 7 o use un horno de pizza muy caliente.", "Coloque la chalota, anchoas, mostaza y todas las hierbas picadas en un procesador de alimentos con una pizca de sal y pimienta y mezcle hasta obtener un puré fino. Agregue el aceite de oliva y mezcle una vez más.", "Agregue las alcaparras y el jugo de medio limón. Pulse durante unos segundos hasta que quede ligeramente grueso.", "Coloque la trucha en una bandeja grande para asar junto con los limones a la mitad y las papas hervidas.", "Ponga un par de cucharadas de salsa verde en la cavidad de la trucha junto con los tallos de hierba reservados. Rocíe con aceite de oliva y sazone bien con sal y pimienta negra.", "Coloque en el horno y tueste durante 15-20 minutos, o hasta que esté recién cocido.", "Sirva la trucha con las papas recién tostadas, el limón y una llovizna de la salsa verde restante."], "url": "www_bbc_co_uk_food_recipes_whole_roasted_trout_with_75575", "title": "Trucha asada entera con salsa verde, patatas nuevas asadas y limones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "1,5 kg / 3lb 5oz lubina entera, limpia, eviscerada, sin escamas, cabeza en", "1 cilantro fresco de racimo pequeño, finamente picado, con tallos reservados", "sal y pimienta negra recién molida", "medio pepino, sin semillas y finamente cortado", "1 chile verde, finamente picado", "6 tomates grandes", "1 pomelo rosado", "1 lima, jugo y ralladura finamente rallada", "2 cucharaditas de jengibre recién rallado", "3 cucharadas de aceite de oliva", "3 cucharadas colmadas de salsa de mango con tbsp", "puñado de cilantro picado"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Engrase un pedazo grande de papel de aluminio con mantequilla.", "Con un cuchillo afilado haga tres barras a cada lado del pescado y empuje un poco de cilantro picado en las barras. Coloque los tallos de cilantro en la cavidad del pez. Sazonar todo con sal y pimienta. Envuelva el pescado en papel de aluminio para hacer un paquete. Asegúrate de que la costura del paquete esté hacia un lado, para que puedas voltear el pescado boca abajo. Hornee por unos 30 minutos, revolviendo después de 15 minutos, hasta que esté cocido.", "Para hacer la salsa, corta todos los ingredientes. Póngalos a todos en un tazón, aparte del cilantro, y mezcle. Condimentar con sal y pimienta.", "Retire la lámina, sirva la lubina en un plato grande y quite cuidadosamente la piel. Caliente la salsa suavemente en una sartén, agregue el cilantro y vierta sobre la parte superior o sirva al lado."], "url": "www_bbc_co_uk_food_recipes_whole_sea_bass_with_38333", "title": "Lubina entera con tomate caliente y salsa cítrica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_sea_bass_with_38333_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 600g / 1lb 5oz de dorada entera, escamada, eviscerada y branquias retiradas", "1 cucharada de salsa de pescado", "2 cucharadas de vino de arroz Shaoxing", "1 cucharada de salsa de ostras", "1 cucharada de jengibre fresco, rallado", "2 chiles rojos, en rodajas", "1 naranja, solo jugo", "2 limas, zested y segmentado", "2 cucharadas de cebolletas picadas o cebolletas asiáticas", "6 hojas de lima kaffir", "2 cebollas de primavera, en rodajas", "1 cucharadita de granos de pimienta molidos de Sichuan", "1 tallo de limoncillo, cortado y finamente picado", "400g / 14oz de arroz asiático pegajoso, empapado por al menos tres horas, luego enjuagado", "2 cucharadas de azúcar en polvo", "1 puñado de coriandro", "1 cucharada de semillas de sésamo tostadas", "2 cucharaditas de aceite de sésamo"], "method": ["Primero prepara el pescado. Con unas tijeras, quite todas las aletas y corte la cola, luego use un cuchillo afilado para hacer unas cuantas barras diagonales a cada lado del pez. Retire la cabeza del pez si lo desea.", "Tome un tazón y mezcle la salsa de pescado, el vino, la salsa de ostras, la mitad del jengibre, la mitad de los chiles, el jugo de naranja, la ralladura de lima y la mitad del ajo en cebollino para hacer el adobo.", "En otro cuenco, raspe las hojas de lima Kaffir y agregue el jengibre restante, el cebollino al ajo y las partes blancas de la cebolla de primavera. Mezcle y luego empaquete la mezcla dentro de la cavidad abdominal del pez.", "Coloque dos ollas grandes en la placa con aproximadamente 5 cm / 2 in de agua en el fondo de cada una y deje que el agua hierva a fuego lento. Coloque una vaporera de bambú con un plato hondo ligeramente engrasado dentro de una bandeja. Coloque un colador forrado con un paño de muselina en la parte superior de la otra sartén.", "Coloque el pescado en el plato engrasado y rocíe sobre los ingredientes del adobo. Espolvorea sobre los granos de pimienta de Sichuan y la hierba de limón, cúbrelos con una tapa y deja que hiervan suavemente durante unos 20 minutos o hasta que el pescado esté recién cocido.", "Mientras tanto, toma el arroz remojado y enjuagado y ponlo en el colador forrado de muselina. Cubra con una tapa y cocine durante 20-30 minutos o hasta que el arroz esté tierno. A mitad de la cocción, revuelve el arroz con un tenedor.", "Revise los vapores mientras cocina el arroz y el pescado y recargue con un poco de agua hirviendo según sea necesario.", "Mientras el pescado y el arroz se cuecen al vapor, coloque el azúcar en una olla pequeña, cúbralo con aproximadamente una taza de agua y deje que hierva. Vierta el almíbar sobre los segmentos de lima y reserve.", "Verifique que el pescado esté recién cocido deslizando un pincho o palillo en la parte carnosa de la parte posterior del pescado.", "Retire con cuidado todo el pescado y acomódelo en un plato para servir. Vierta sobre los jugos de cocina y esparza sobre las partes verdes en rodajas de las cebollas de primavera, los segmentos de lima agridulce, berro de cilantro y semillas de sésamo.", "Termine con un chorrito de aceite de sésamo y sirva el arroz al lado."], "url": "www_bbc_co_uk_food_recipes_whole_steamed_sea_bream_67892", "title": "Dorada entera al vapor con jengibre, cítricos y chile y arroz pegajoso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]