[{"ingredients": ["10 piezas de tomate bañadas por el sol, más o menos picadas", "Hojas de cohete de 50g / 2oz, más extra para decorar", "1 cucharada de piñones", "½ diente de ajo", "3 pimientos del piquillo, toscamente picados (disponibles en tiendas de delicatessen españolas y algunos supermercados)", "1 cucharada de queso parmesano rallado", "5-6 cucharadas de aceite de oliva", "4 cucharadas de vinagre de Cabernet Sauvignon", "aceite vegetal, para freír en grasa", "500g / 1lb 2oz de papas, peladas y cortadas en dados grandes", "Queso parmesano 110 g / 4 oz, recién rallado", "1 cucharada de pesto rojo (de la receta anterior)", "10 piezas de tomate bañadas por el sol, más o menos picadas", "10 hojas de albahaca, más o menos picadas", "sal y pimienta negra recién molida", "50g / 2oz de harina normal más hasta 2 cucharadas soperas (si está demasiado seco)", "1 bolita de queso mozzarella fresca, cortada en trozos pequeños", "Pan rallado de 110 g / 4 oz", "2 huevos de gallinas camperas, golpeados"], "method": ["Para el pesto, coloque todos los ingredientes del pesto, excepto el vinagre de Cabernet Sauvignon, en un procesador de alimentos y mezcle hasta obtener un puré fino. Dejar de lado.", "Para las croquetas, precalentar el horno a 160 ° C / 320 ° F / Gas 2.", "Precaliente el aceite en una freidora a 160C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque las papas en una olla de agua con sal y deje hervir. Cocine por 12-18 minutos, o hasta que estén tiernos, luego drene y vuelva a la sartén.", "Coloque la sartén de patatas sobre el fuego hasta que toda la humedad se haya evaporado. Mash con un triturador de patata o ricer hasta que quede suave.", "Agregue el queso parmesano, una cucharada de pesto rojo y todos los tomates al sol y la albahaca al puré y mezcle bien. Agregue sal y pimienta negra recién molida, al gusto. (Agregue un poco de harina si la mezcla está demasiado mojada para formar formas con sus manos).", "Divida la mezcla en 12 piezas del mismo tamaño y forme croquetas de cilindro con sus manos. Empuja una pequeña pieza de mozzarella en el centro de cada croqueta, cerrando la patata para cubrir completamente la mozzarella.", "Coloque la harina restante y las migas de pan en dos platos separados. Coloque los huevos en un tazón. Draga las croquetas en la harina, luego sumérgelas en los huevos batidos y finalmente arrástralas en el pan rallado, para cubrir, conservando la forma.", "Con cuidado, baje algunas croquetas a la freidora de grasa profunda precalentada y cocine durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Transfiera las croquetas a una bandeja de asar y colóquelas en el horno precalentado para mantenerlas calientes.", "Para servir, agregue el vinagre de Cabernet Sauvignon al pesto restante y coloque una cucharada en cada una de las cuatro placas. Coloque tres croquetas encima de cada cucharada de pesto y adorne con un cohete."], "url": "www_bbc_co_uk_food_recipes_tomatoandbasilcroque_90977", "title": "Croquetas de tomate y albahaca con mozzarella exudante y vinagreta de pesto de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas en rodajas", "2 dientes de ajo, finamente picados", "2 latas de 400g / 14oz de tomates picados", "125ml / 4fl oz de caldo de verduras o pescado", "sal y pimienta negra recién molida", "4 x 200g / 7oz de filetes de pescado blancos firmes", "2 puñados de hojas de espinaca baby", "1 cucharada de albahaca fresca picada", "12 papas nuevas, picadas y hervidas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén honda a fuego medio.", "Agregue el aceite, la cebolla y el ajo y cocine durante ocho minutos, hasta que la cebolla esté suave.", "Agregue los tomates, el caldo y el condimento, y revuelva para combinar.", "Cocine sin tapar hasta que la mezcla se haya reducido y espesado ligeramente, lo que debería ser de unos diez minutos.", "Coloque el pescado en un molde para hornear, cubra con la mezcla de tomate y cocine en el horno precalentado durante 12 minutos.", "Para servir, retire el pescado de la salsa y manténgalo caliente.", "Revuelva la espinaca y la albahaca en la salsa y cocine hasta que la espinaca se haya marchitado.", "Vierta la salsa sobre el pescado y sirva inmediatamente con las papas hervidas."], "url": "www_bbc_co_uk_food_recipes_tomatoandbasilpoache_83682", "title": "Pescado escalfado de tomate y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 rebanadas de jamón", "2 cucharadas de aceite de oliva", "frac12; cebolla", "1 diente de ajo", "4 tomates cherry, picados", "1 cucharada de cebollín fresco, picado", "sal y pimienta negra recién molida", "puñado de hojas de albahaca fresca", "4 tomates cherry, cortados por la mitad", "sal y pimienta negra recién molida"], "method": ["Para el prosciutto, caliente el aceite en una sartén a fuego alto. Agregue el jamón y fría por un minuto en cada lado, o hasta que esté crujiente y dorado. Escurrir sobre papel de cocina.", "Para el aderezo, caliente el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría hasta que estén suaves.", "Agregue los tomates y fría por 3-4 minutos, o hasta que estén suaves.", "Agregue las cebolletas y condimente, al gusto, con sal y pimienta negra recién molida.", "Para la ensalada, coloque las hojas de albahaca en un plato para servir en un círculo. Coloque la mitad de un tomate cherry cortado en cada hoja de albahaca. Vierta un poco del aderezo sobre cada tomate cherry.", "Para servir, coloque el jamón en el medio del plato y sazone con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_tomatoandbasilsaladw_84313", "title": "Ensalada de tomate y albahaca con jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pastel de hojaldre de 110g / 4oz", "harina simple, al polvo", "1 tomate de ternera, cortado en rodajas", "puñado de hojas de albahaca fresca", "55-85g / 2-3 oz queso gruyère, rallado", "pimienta negra recién molida, para sazonar", "1 huevo, golpeado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Ruede la masa sobre una superficie enharinada. Corte un círculo grande y colóquelo en una bandeja para hornear antiadherente. Arrugue los bordes de la masa con los dedos.", "Coloque las rodajas de tomate en el medio del círculo de repostería y luego cubra con la albahaca. Espolvoree el queso y sazone con pimienta negra.", "Cepille los bordes de la tarta con la colada de huevo y luego hornee en el horno durante 8-10 minutos, o hasta que estén crujientes y dorados.", "Servir."], "url": "www_bbc_co_uk_food_recipes_tomatoandbasiltart_72416", "title": "Tarta de tomate y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["botón de mantequilla", "racimo de cebollas, solo con puntas, picado", "½ 400 g / 14 oz de frijoles flageolet, enjuagados y escurridos", "400 g / 14 oz de lata de tomates y jugo de ciruela", "1 diente de ajo, finamente picado", "½ 326 g / 11½ oz puede maíz dulce, drenado y enjuagado", "sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado"], "method": ["Derrita la mantequilla en una cacerola a fuego medio. Agregue las cebollas de primavera y saltee por un minuto.", "Agregue los frijoles, los tomates, el ajo y el maíz dulce, lleve a ebullición y reduzca, luego hierva a fuego lento durante 5-6 minutos para reducir. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, agregue el perejil al guiso y viértalo en un recipiente calentado."], "url": "www_bbc_co_uk_food_recipes_tomatoandbeanstew_84184", "title": "Guiso de tomate y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 400 g / 14 oz puede ciruela tomates", "4 chiles rojos, picados", "4 dientes de ajo, pelados", "7cm / 3in pieza de jengibre fresco, pelado, picado", "3 cucharadas de salsa de pescado (nam pla)", "120ml / 4fl oz de vinagre de vino tinto", "375g / 13oz azúcar marrón claro suave", "1 cucharadita de cápsulas de cardamomo, ligeramente trituradas", "70 g / 2½ oz de uva", "400g / 14oz de tomates frescos, picados"], "method": ["Coloque los tomates enlatados, el chile, el ajo, el jengibre y la salsa de pescado en un procesador de alimentos y mezcle hasta que quede suave.", "Coloque la salsa de tomate en una sartén no reactiva a fuego medio y agregue el vinagre, el azúcar, las vainas de cardamomo y las pasas. Llevar a ebullición y luego agregar los tomates frescos picados. Reduzca el fuego y cocine a fuego lento durante 45-55 minutos, o hasta que la salsa se espese a una salsa picante o consistencia tipo mermelada.", "Transfiera a frascos y sellos esterilizados hasta que esté listo para usar. La mermelada debe mantenerse durante 2-3 semanas en la nevera."], "url": "www_bbc_co_uk_food_recipes_tomatoandchillijam_89081", "title": "Mermelada de tomate y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "1-2 frascos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de tomates cherry", "3 dientes de ajo, pelados, en rodajas", "1 cucharadita de hojuelas de chile", "150ml / 5½fl oz de aceite de oliva virgen extra", "125g / 4½oz de pan rallado fresco", "100 g / 3½ oz de queso de oveja finamente rallado", "1 cucharadita de tomillo fresco picado", "sal y pimienta negra recién molida", "450 g / 1 libra de pasta penne recién hecha", "1 cucharada de hojas de albahaca fresca rasgada", "pan de ajo, para servir"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Coloque los tomates, el ajo y las hojuelas de chile en un molde para hornear y rocíe sobre el aceite de oliva. Asar en el horno por 25 minutos, o hasta que los tomates se ablanden.", "Mientras tanto, en un tazón, mezcle las migas de pan, el queso de oveja y el tomillo y sazone con sal y pimienta negra recién molida. Vierta la mezcla sobre los tomates y vuelva a colocarla en el horno durante 4-5 minutos, o hasta que la parte superior esté dorada y crujiente.", "Coloque la mezcla de tomate sobre la pasta de penne en un bol y mezcle bien. Con una cuchara, ponga el penne en recipientes para servir, luego adorne con la albahaca rasgada y sirva con pan de ajo."], "url": "www_bbc_co_uk_food_recipes_tomatoandchillipenne_92089", "title": "Penne de tomate y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "5 tomates cherry, cortados a la mitad", "pizca de azúcar en polvo", "85 g / 3oz de hojaldre listo para enrollar", "30g / 1oz de queso de cabra, reducido a la mitad", "50g / 2oz de espinaca", "Agua para cubrir", "4 cucharadas de aceite de oliva", "puñado de hojas de albahaca fresca", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la tarta tatin, caliente el aceite de oliva en una sartén pequeña a prueba de horno, agregue los tomates con el lado cortado hacia abajo y espolvoree sobre el azúcar. Freír suavemente durante 3-4 minutos hasta que se suavice un poco.", "Cortar un círculo de hojaldre lo suficientemente grande como para caber sobre la parte superior de la sartén y colocar la masa sobre los tomates. Empuja la masa hacia abajo alrededor de los bordes para sellar los tomates.", "Transfiera al horno y hornee durante 8-10 minutos, o hasta que la masa esté dorada. Retire del horno y deje que se enfríe un poco, luego coloque un plato sobre la parte superior de la sartén y con cuidado gire la tarta tatin en el plato.", "Calentar otra sartén pequeña y freír el queso de cabra por ambos lados hasta que se dore ligeramente. Coloque el queso de cabra sobre la tarta tatin.", "Para el aceite de albahaca, coloque las espinacas en un recipiente y cúbralas con agua hirviendo para marchitar las espinacas. Escurra las espinacas y exprima cualquier exceso de líquido.", "Coloque la espinaca, el aceite y la albahaca en un procesador de alimentos pequeño. Sazonar, al gusto, con sal y pimienta negra recién molida y licuar hasta que quede suave.", "Para servir, rocíe el aceite de albahaca sobre la tarta tatin."], "url": "www_bbc_co_uk_food_recipes_tomatoandgoatscheese_86055", "title": "Tarta tatin de queso de tomate y cabra con aceite de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de espagueti fresco", "2 tomates, escaldados, pelados y picados", "3 rebanadas de jamón de Parma, más o menos picadas", "2 cucharadas de aceite de oliva", "pimienta negra, al gusto", "1 cucharada de albahaca fresca picada"], "method": ["Cocine los espaguetis en agua hirviendo con sal según las instrucciones del paquete.", "Escurrir los espaguetis y agregar los tomates picados, el jamón de Parma, el aceite de oliva y la pimienta negra.", "Para servir, espolvorear en un recipiente y espolvorear con albahaca fresca."], "url": "www_bbc_co_uk_food_recipes_tomatoandparmahamspa_83243", "title": "Espagueti de tomate y jamón de Parma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla, picada", "2 dientes de ajo picados", "2 latas de tomates", "1 jar de pimientos rojos", "250ml / 9fl oz de caldo de pollo o vegetal", "sal marina y pimienta negra", "puñado de perejil fresco, picado", "crema doble (opcional)"], "method": ["En primer lugar, saltee la cebolla y el ajo y luego agregue los tomates en lata y los pimientos rojos.", "Traiga a fuego lento y agregue el caldo. Llevar a ebullición y luego cocine a fuego lento durante cuatro o cinco minutos, antes de colocar en la licuadora.", "Mezcle a una sopa suave. Condimentar con sal y pimienta. Regrese a la sartén para calentar y sirva inmediatamente esparcido con el perejil y un remolino de crema doble, si se usa."], "url": "www_bbc_co_uk_food_recipes_tomatoandredpepperso_10654", "title": "Sopa de tomate y pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "¼ de cebolla, finamente picada", "Passata de tomate de 75 ml / 2½ fl oz (tomates tamizados)", "300ml / ½ litro de caldo de verduras calientes", "125g / 4½oz de hojas frescas de espinaca", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una cacerola, agregar la cebolla y freír hasta que se ablande.", "Agregue la passata, el caldo, la espinaca, la sal y la pimienta negra recién molida y cocine a fuego lento durante 3-4 minutos. Mezcle con una batidora de mano hasta que quede suave.", "Para servir, vierta en un tazón de servir."], "url": "www_bbc_co_uk_food_recipes_tomatoandspinachsoup_88274", "title": "Sopa de tomate y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina natural, más extra para espolvorear", "pizca de sal", "1 cucharada de aceite de oliva", "agua tibia", "100g / 3½oz de tomates enlatados, escurridos y picados", "1 cucharada de aceite de oliva", "pizca de copos de chile seco", "azúcar pizca", "puñado de perejil fresco, picado", "puñado de albahaca fresca, picada", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "100g / 3½ oz de calabaza, pelada, cortada en cubos de 1cm / ½ en cubitos", "1 diente de ajo, aplastado", "2 ramitas de tomillo fresco, solo hojas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 230C / 450F / Gas 8.", "Para la masa de pizza, coloque la harina, la sal y el aceite de oliva en un tazón grande y mezcle bien. Agregue suficiente agua tibia para hacer una masa suave pero no pegajosa.", "Convierta la masa en una superficie ligeramente enharinada y amase brevemente. Ruede la masa para hacer un círculo de 0.5cm / ¼ de grosor y colóquela en una bandeja para hornear antiadherente.", "Para la salsa de tomate, coloque todos los ingredientes de la salsa en un bol, sazone con sal y pimienta negra recién molida y mezcle bien. Extienda la salsa uniformemente sobre el círculo de la masa, dejando un borde delgado alrededor del borde.", "Para el aderezo, caliente el aceite de oliva en una sartén y cocine los trozos de calabaza, el ajo y el tomillo durante 5-6 minutos, o hasta que estén tiernos. Sazonar con sal y pimienta negra recién molida, luego espolvorear sobre la base de la pizza.", "Transfiera la pizza al horno y hornee durante 10-12 minutos, o hasta que la base esté crujiente y cocida.", "Para servir, coloque la pizza en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_tomatoandsquashpizza_85259", "title": "Pizza de tomate y calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, aplastados", "1 cebolla grande, finamente picada", "aceite de oliva", "1 cucharadita de comino en polvo", "2 latas (400g / 14oz) de tomates picados", "340g / 12oz granos de maíz dulce, estañado o congelado", "1L / 1 ¾pt de verduras o caldo de pollo", "2 cucharadas de puré de tomate", "albahaca fresca o hojas de cilantro", "sal y pimienta negra"], "method": ["Sudor el ajo y la cebolla en aceite de oliva hasta que estén suaves y translúcidos. Agregue el comino y cocine por un minuto más o menos antes de agregar los tomates, maíz dulce, caldo y puré de tomate. Llevar a ebullición, luego baje el fuego y deje hervir a fuego lento durante 15-20 minutos.", "La sopa es buena tal como es, rústica y gruesa. Si prefiere una sopa más suave, simplemente mezcle la mitad de la mezcla. Esparce con hierbas frescas y sirve con un chorrito de aceite de oliva. Sazonar bien"], "url": "www_bbc_co_uk_food_recipes_tomatoandsweetcornso_7921", "title": "Sopa de tomate y maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cucharadita de copos de chile", "½ cucharadita de cilantro molido", "1 x 400g / 14oz de tomates cherry de hojalata", "2 cucharadas de azúcar moreno", "Nueces 25g / 1oz, picadas", "3 cucharadas de cilantro fresco, picado", "2 cucharadas de mantequilla"], "method": ["Caliente el aceite de oliva en una cacerola a fuego medio.", "Agregue los copos de chile y el cilantro molido y cocine por un minuto. Agregue los tomates cherry y el azúcar moreno y cocine durante 8-10 minutos más.", "Agregue las nueces picadas y el cilantro.", "Agregue la mantequilla y sirva."], "url": "www_bbc_co_uk_food_recipes_tomatoandwalnutstew_76876", "title": "Guiso de tomate y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 tomate en rodajas", "1 cebolleta, en rodajas", "1 manzana, en rodajas", "1 cucharada de vinagre balsámico", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "gran cilantro fresco puñado", "1 huevo de pato, escalfado, para servir"], "method": ["Mezcle el tomate, la cebolleta, la manzana, el vinagre balsámico y el aceite de oliva en un tazón grande y sazone al gusto con sal y pimienta negra recién molida.", "Vierta una cuchara en un tazón para servir y cubra con el huevo de pato escalfado."], "url": "www_bbc_co_uk_food_recipes_tomatoappleandsoftdu_88789", "title": "Ensalada de huevo de pato, manzana y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango cortado en tiras finas", "½ aguacate cortado en cubitos", "4 tomates cherry, en rodajas", "1 lima, solo jugo", "3 cucharadas de perejil picado", "3 cucharadas de cilantro picado", "3 cucharadas de cebolla roja, cortadas en cubitos", "4 cucharadas de aceite de oliva"], "method": ["Mezcle el mango con el aguacate y los tomates cherry.", "Agregue el jugo de lima, las hierbas picadas, la cebolla roja y el aceite de oliva y mezcle.", "Servir."], "url": "www_bbc_co_uk_food_recipes_tomatoavocadomangosa_76910", "title": "Ensalada de tomate, aguacate y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "pequeñas hojas de albahaca fresca", "40 g / 1½ oz de mantequilla", "1 huevo de gallinas camperas", "2-3 cucharadas de leche, para unir", "5 tomates cherry", "85g / 3oz de garbanzos enlatados, escurridos", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Mezcle la harina, el polvo de hornear, la albahaca y la mantequilla en un tazón de procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Agriete el huevo en el recipiente del procesador de alimentos y vierta dos cucharadas de leche. Pulso, agregando otra cucharada de leche si es necesario para formar una masa.", "Coloque la mezcla sobre una superficie ligeramente enharinada y amasar hasta que quede suave y elástica. Ruede la masa en una ronda gruesa usando un rodillo enharinado.", "Presione los tomates y los garbanzos en la superficie de la masa y coloque en una bandeja para hornear.", "Rocíe el aceite de oliva sobre los tomates y el chorizo ​​y sazone bien con sal y pimienta negra recién molida.", "Hornee la masa en el horno durante 10-12 minutos, o hasta que esté dorada y ligeramente levantada."], "url": "www_bbc_co_uk_food_recipes_tomatobasilandchickp_92406", "title": "Pan de tomate, albahaca y garbanzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "100g / 3½oz de chorizo, pelado y rebanado de 1cm de grosor", "3 cucharadas de apio, finamente picado", "3 dientes de ajo, aplastados", "½ cucharadita de pimienta negra recién molida", "4 tomates, sin semillas (semillas reservadas)", "½ cucharadita de orégano seco", "1 lata de frijoles cannellini, enjuagada y escurrida", "puñado de aceitunas negras, picadas"], "method": ["Calentar el aceite en una cacerola a fuego medio. Agregue el chorizo, el apio, el ajo y la pimienta, y cocine a fuego medio durante dos minutos, hasta que el chorizo ​​esté dorado.", "Coloque las semillas de tomate y la carne de dos de los tomates en un procesador de alimentos y mezcle. Agregar a la sartén.", "Agregue los ingredientes restantes y cocine a fuego lento durante cinco minutos.", "Servir caliente con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_tomatobeanandchorizo_79833", "title": "Guiso de tomate, frijoles y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filetes de pollo de 75 g / 2½ oz", "½ jarro de pimientos asados, picados", "75ml / 2½fl oz de vino blanco", "1 cucharada de crema doble", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva en una olla pequeña.", "Agregue los filetes de pollo y cocine hasta que estén dorados por todos lados.", "Agregue los pimientos rojos y fría por dos minutos.", "Agregue el vino, suba el fuego y burbujee por un minuto.", "Agregue la crema doble y sazone. Cocine por un minuto, o hasta que el pollo esté bien cocido.", "Vierta en un recipiente para servir y sirva."], "url": "www_bbc_co_uk_food_recipes_tomatochickenandpepp_85655", "title": "Guiso de pollo y pimiento", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ chalota, picada", "1 ½ tomates, picados", "1 diente de ajo, aplastado", "1 cucharada de vinagre balsámico", "1 cucharadita de azúcar moreno"], "method": ["Calentar el aceite en una sartén pequeña.", "Agregue los chalotes, los tomates y el ajo y cocine durante 5-8 minutos o hasta que estén blandos.", "Agregue el vinagre y el azúcar y cocine durante 3-5 minutos o hasta que la salsa picante se haya caramelizado ligeramente. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tomatochutney_75669", "title": "chutney de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatochutney_75669_16x9.jpg", "isVegetarian": true, "recommendations": 0}]