[{"isVegetarian": false, "title": "Meatloaf and mashed potato", "url": "www_bbc_co_uk_food_recipes_meatloafandmashedpot_88604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg, beaten", "150ml/5fl oz milk", "300g/10½oz soft white bread, cut into cubes", "1 tbsp Dijon mustard", "pinch dried thyme", "pinch freshly grated nutmeg", "pinch dried basil", "handful fresh parsley, finely chopped", "1 onion, finely chopped", "100g/3½oz celery, finely chopped", "225g/8oz bacon lardons, fried until golden-brown all over", "salt and freshly ground black pepper", "700g/1lb 5oz minced beef", "200g/7oz minced pork", "1 tbsp Worcestershire sauce", "3 slices streaky bacon", "450g/1lb potatoes, peeled and boiled", "75g/2½oz butter", "salt and freshly ground black pepper", "gravy"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the meatloaf, place the egg and milk into a large bowl and mix together.", "Add the cubes of bread and leave to stand for 15 minutes.", "Mash the milk and egg-soaked bread with a fork.", "Add the mustard, thyme, nutmeg, basil, onion, celery and bacon lardons, season with salt and freshly ground black pepper and mix well.", "Add the beef and pork mince and the Worcestershire sauce. Mix well to combine thoroughly.", "Cover with cling film and place into the fridge to chill (overnight if possible, but for at least two hours).", "Preheat the oven to 180C/360F/Gas 4.", "Transfer the meatloaf mixture into a 30cm x 11cm/12in x 4in loaf tin.", "Top with the streaky bacon slices to cover.", "Transfer to the oven and bake for 55 minutes, or until completely cooked through.", "Remove from the oven and leave the meatloaf to stand for 5-6 minutes before slicing.", "For the mashed potato, mash the freshly cooked potatoes. Place into a pan over a low heat and mix in the butter. Season, to taste, with salt and freshly ground black pepper.", "To serve, slice the meat loaf. Place a slice onto each plate with a dollop of mashed potato alongside. Pour over some gravy and enjoy."]}, {"isVegetarian": false, "title": "Meatzza", "url": "www_bbc_co_uk_food_recipes_meatzza_60080", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatzza_60080_16x9.jpg", "ingredients": ["500g/1lb 2oz minced beef (preferably organic)", "3 tbsp grated parmesan", "3 tbsp breadcrumbs or porridge oats (not instant)", "3 tbsp chopped fresh parsley", "2 free-range eggs, lightly beaten", "1 garlic clove, crushed", "Salt and freshly ground black pepper, to taste", "Butter, for greasing", "1x400g/14oz can chopped tomatoes, drained", "1 tsp garlic oil", "1 tsp oregano", "1 x 125g/4½oz ball mozzarella (not buffalo), halved, then sliced", "Few leaves fresh basil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "In a large bowl, using your hands, combine the mince, parmesan, breadcrumbs or oats, parsley, eggs, garlic, and add some salt and pepper. Do not overwork it, just lightly mix together or the meat will become compacted and dense.", "Butter a round baking tin of about 28cm/11in diameter and turn the meat into it, pressing the mixture lightly with your fingers to cover the bottom as if the seasoned minced meat were your pizza crust.", "Make sure you’ve drained as much runny liquid as possible out of your can of chopped tomatoes, then mix the tomato with the garlic oil, oregano and some salt and pepper and spread, using a rubber spatula, lightly on top of the meat base. Arrange the mozzarella slices on top, and then put in the oven for 20-25 minutes, by which time the meat should be cooked through and lightly set and the mozzarella melted.", "Remove from the oven and let it sit for five minutes, then adorn with some basil leaves and bring it to the table before cutting into wedges, like a pizza."]}, {"isVegetarian": false, "title": "Medallions of lamb with creamy leeks and port sauce", "url": "www_bbc_co_uk_food_recipes_medallionsoflambwith_84926", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5oz lamb fillet, cut into three medallions ", "50g/1¾oz breadcrumbs", "½ tsp Dijon mustard", "1 tbsp chopped fresh parsley", "1 tbsp olive oil", "½ onion, chopped", "½ leek, white part only, chopped", "1 garlic clove, chopped", "150ml/5fl oz double cream", "50g/2oz Stilton", "50ml/1¾fl oz white wine", "150ml/5fl oz beef stock", "2 tbsp port", "50g/2oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Heat the oil in an ovenproof frying pan. Add the lamb and cook for 1-2 minutes on each side.", "In a bowl mix together the breadcrumbs, Dijon mustard and parsley. Place the breadcrumb mixture onto each piece of lamb, then transfer to the oven to bake for 4-5 minutes, or until cooked through. Remove from the oven and leave to rest for 3-4 minutes.", "For the creamy leeks, heat the oil in a frying pan, Add the onion, leek and garlic and fry for four minutes.", "Add the cream, Stilton and white wine and cook for five minutes, or until the Stilton has melted and the cream sauce is thick.", "For the port sauce, heat the beef stock and port together in a small saucepan. Bring to the boil and cook for five minutes, then add the butter and stir in to melt.", "To serve, place the creamy leeks into the middle of a plate. Top with the lamb and drizzle the port sauce all over."]}, {"isVegetarian": false, "title": "Medieval chicken with whole garlic cloves", "url": "www_bbc_co_uk_food_recipes_medieval_chicken_with_04370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small packet saffron threads", "400ml/14fl oz white wine", "1 roasting chicken", "1 tsp freshly ground black pepper", "1 tsp ground cinnamon", "5 small garlic bulbs", "5cm/2in piece fresh ginger, peeled and finely chopped", "olive oil", "sea salt"], "serves": "Serves 4 - 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8.", "Soak the saffron in a little of the wine. Rub the chicken all over with the pepper and cinnamon and place the chicken in an ovenproof dish.", "Cut the tops off the garlic bulbs so you can see the cloves and arrange them around the chicken with the ginger. Pour a little olive oil into the garlic bulbs and pour the saffron and remaining wine around the chicken. Season the chicken with salt and place in the oven.", "Roast for 20 minutes then lower the oven temperature to 170C/325F/Gas 3 and cook for another 40 minutes, or until the juices run clear and the chicken is cooked through. Baste the chicken and garlic regularly during cooking."]}, {"isVegetarian": true, "title": "Mediterranean bean stew with potato griddle cakes", "url": "www_bbc_co_uk_food_recipes_mediterranean_bean_stew_56916", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterranean_bean_stew_56916_16x9.jpg", "ingredients": ["2 tbsp extra-virgin olive oil, plus extra to serve", "2 red onions cut into wedges", "2 courgettes, chopped into 1cm/½in batons", "150g/5½oz celeriac, cut into cubes", "1 garlic clove, finely chopped", "2 tbsp tomato purée", "1 tbsp smoked paprika", "1 x 440g/1lb tin chopped tomatoes", "200ml/7fl oz vegetable stock", "1 x 400g/14oz tin butter beans or mixed beans, drained", "handful fresh basil", "1 lemon, zest only", "100g/3½oz cooked broad beans", "250g/9oz mashed potatoes", "1 tsp baking powder", "100g/3½oz plain flour", "salt and freshly ground black pepper ", "1 tbsp fresh thyme", "2 tbsp vegetable oil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the stew, heat two tablespoons of the oil in a casserole pan and fry the onions, courgettes, celeriac and garlic for 4-5 minutes.", "Add the tomato purée and smoked paprika and cook for a further 4-5 minutes. Add the chopped tomatoes and stock, bring to boil, then reduce to a simmer for 20-25 minutes.", "Stir in the butter beans, basil and lemon zest and cook for a further 10 minutes, then stir in the broad beans. Finish the stew with a good glug of extra-virgin olive oil.", "Meanwhile, for the griddled potato cakes, mix the ingredients together in a bowl until well combined, then shape the potato mixture into six patties. ", "Heat the oil in a frying pan and fry the patties for 3-4 minutes on each side, or until crisp and golden-brown on both sides.", "To serve, ladle the stew into serving bowl and serve the potato cakes alongside."]}, {"isVegetarian": true, "title": "Mediterranean puff pastry tart", "url": "www_bbc_co_uk_food_recipes_mediterranean_puff_50963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterranean_puff_50963_16x9.jpg", "ingredients": ["280g/10oz ready-rolled light puff pastry ", "200g/7oz baby courgettes, cut into 15mm/⅝in slices ", "1 large red pepper, cored, seeds removed, cut into 2cm/¾in chunks ", "1 large yellow pepper, cored, seeds removed, cut into 2cm/¾in chunks ", "1 red onion, cut into 2cm/¾in chunks ", "4 garlic cloves, sliced ", "2 sprigs rosemary, leaves picked and finely chopped ", "4 sprigs thyme, leaves picked ", "olive oil spray ", "1 tbsp semi-skimmed milk ", "100g/3½oz cherry tomatoes, halved ", "75g/2¾oz goats’ cheese, crumbled ", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Using a sharp knife, trim the sheet of puff pastry to 25 x 28cm/10 x 11in. Place it on a baking tray lined with baking parchment and score a border 2cm/¾in in from the edge all the way round. Prick the pastry within the margin, using a fork. Leave to rest in the fridge for about an hour. Meanwhile, preheat the oven to 240C/220C Fan/Gas 9.", "Put the courgettes, pepper and red onion into a large bowl. Add the garlic and herbs and season generously with salt and pepper. Line a large baking tray with baking parchment, lay the vegetables on it and spray 15–20 times with oil. ", "Brush the puff pastry all over with the milk and sprinkle with a little salt. Cook on the middle shelf of the oven, with the vegetable tray on the top shelf above, for 15 minutes, rotating both trays halfway through to ensure even colouring. Remove both trays from the oven and reduce the temperature to 160C/140C Fan/Gas 3. Set the vegetables aside. ", "Press the inside of the pastry down and return to the oven for 25 minutes to get a super-crisp base. ", "Take the tart case out of the oven and increase the temperature to 200C/180C Fan/Gas 6. Tip the roasted vegetables into the tart case, scatter over the cherry tomatoes and goats’ cheese and season with salt and pepper. ", "Bake for 20–25 minutes until the vegetables are cooked through and the cheese is softening and colouring at the edges. Cut the tart into quarters and serve."]}, {"isVegetarian": true, "title": "Mediterranean filo pastry pie", "url": "www_bbc_co_uk_food_recipes_mediterraneanfilopas_90227", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanfilopas_90227_16x9.jpg", "ingredients": ["225g/9oz packet ready-made filo pastry, fresh or frozen (you'll need about ten sheets measuring about 34cm x 30cm/13in x 12in or larger in size)", "85g/3oz butter, melted, for brushing", "2 tbsp olive oil", "1 large red onion, halved and sliced finely", "600g/1lb 5oz baby leaf spinach", "freshly grated nutmeg, to taste", "salt and freshly ground black pepper", "55g/2oz sultanas", "85g/3oz pine nuts, toasted", "225g/8oz feta", "3 medium free-range eggs", "rocket salad"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Remove the filo pastry sheets from their packaging and place them on a clean work surface. Keep them covered with a clean, damp cloth while you're working, to stop the pastry from drying out.", "For the filling, heat half of the olive oil in a frying pan. Add the sliced the onion and gently fry for 5-6 minutes over a medium heat, until lightly browned and softened.", "Heat the remaining olive oil in a large, heavy-bottomed pan. Add the spinach and cook, uncovered, for a few minutes, until it wilts. When the spinach is cooked, place it in a colander set over a bowl to drain and cool. Discard any liquid that comes out.", "Remove the fried onions from the frying pan and place on a plate to cool.", "With a sharp knife, trim the filo pastry sheets to a size just smaller than your baking sheet. Place a sheet of filo pastry on the baking sheet and brush with some of the melted butter, using a pastry brush. Repeat with four more filo sheets, brushing with butter as you go. This will be the base of the pie. Cover the remaining five filo pastry sheets with a clean cloth.", "When the spinach has cooled, place it into a large bowl. Grate in some fresh nutmeg and season with salt and freshly ground black pepper. Stir in the sultanas, the cooled onions and the pine nuts.", "Crumble the feta into the mixture and mix together well. Beat the eggs together in a clean bowl. Add some of the egg mixture to the spinach mixture. Add just enough so that the mixture is moist but not runny (you may not use all of the beaten egg).", "To assemble the pie, spoon the spinach and feta mixture onto the prepared filo pastry base. Leave an empty 'frame' around the edge of about 4cm/1½in on each side.", "Fold the four edges of the pastry in towards the middle to enclose the filling.", "To make the top of the pie, trim the remaining five sheets of filo pastry to the size of the base with its folded-in edges. Brush one of the filo sheets with some of the remaining melted butter and place on top of the spinach and cheese mixture. Repeat with the remaining four sheets, brushing with melted butter as you go.", "Brush the top layer of filo pastry with the last of the melted butter. Lightly score the top of the pie with a sharp knife. Bake it in the preheated oven for 45-50 minutes, or until the filo pastry crust is a deep golden-brown.", "Serve slices of the pie with a rocket salad."]}, {"isVegetarian": false, "title": "Mediterranean chicken roulade with mushroom orzo and rocket salad", "url": "www_bbc_co_uk_food_recipes_mediterraneanchicken_89440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless free-range chicken breasts, skin removed", "4 thin slices pancetta", "12 fresh basil leaves", "110g/4oz Dolcelatte cheese, cut into 12 strips", "4 baby plum tomatoes, halved", "2 tbsp olive oil", "10g/½oz dried porcini mushrooms, soaked in boiling water", "2 tbsp olive oil", "1 small onion, finely chopped", "1 garlic clove, crushed", "110g/4oz chestnut mushrooms, finely chopped", "250g/9oz orzo pasta", "500ml/18fl oz chicken stock", "1 tbsp chopped fresh lemon thyme", "1 tbsp lemon juice", "50g/2oz parmesan cheese, finely grated", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "1 bag rocket leaves, washed", "4 tbsp parmesan shavings", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the Mediterranean chicken roulade, slice part of the way through each chicken breast, then open out each breast. Sandwich each one between two sheets of cling film and beat with a rolling pin or similar until they are 5mm thick.", "Place a slice of pancetta onto a clean work surface and lay one of the chicken breasts on top of it.", "Place three of the basil leaves in the centre of the chicken, then top with three slices of the Dolcelatte.", "Lay one plum tomato half in each of the two gaps between the cheese. Season with salt and freshly ground black pepper. ", "Roll the chicken roulade from one end to form a cylinder, securing with a cocktail stick if necessary.", "Repeat the process for each of the three remaining chicken breasts.", "Heat the olive oil in an ovenproof frying pan until hot, then add the chicken roulades and cook for one minute on each side, or until golden-brown.", "Transfer to the oven for 15-20 minutes until the cheese is bubbling and the chicken is cooked through. (The chicken is cooked through when the juices run clear when pierced with a skewer.)", "For the mushroom orzo, drain the mushrooms and chop finely.", "Heat the olive oil in a frying pan until hot, then add the onion and cook for one minute, until softened.", "Add the garlic, the chestnut mushrooms and the porcini mushrooms and cook for a further minute. ", "Add the orzo pasta and mix until well combined. Add the chicken stock, bring to a simmer, cover with a lid and cook for 5-8 minutes until the orzo pasta has absorbed the liquid and is tender.", "Remove the lid, add the lemon thyme, lemon juice and parmesan and stir well. Season to taste with salt and freshly ground black pepper.", "For the rocket salad, mix the olive oil and balsamic vinegar in a bowl. Place the rocket leaves into a serving bowl and pour the dressing over them. Sprinkle with the parmesan shavings and season to taste with salt and freshly ground black pepper. Toss the rocket salad until combined.", "To serve, pile some salad onto each serving plate and spoon some mushroom orzo alongside. Cut the chicken roulades into thick slices and arrange them on top of the orzo."]}, {"isVegetarian": false, "title": "Mediterranean lamb chops", "url": "www_bbc_co_uk_food_recipes_mediterraneanlambcho_14373", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanlambcho_14373_16x9.jpg", "ingredients": ["4 lean lamb chops or cutlets", "1 tbsp, fresh mint", "1 tbsp, fresh rosemary", "2 cloves garlic", "2 tbsp olive oil", "1 small aubergine, sliced", "1 courgette, sliced", "1 red or yellow pepper, cut in large chunks", "50g/2oz feta cheese, crumbled", "250g/9oz cherry tomatoes"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 5.", "Using a pestle and mortar or wooden spoon and bowl, pound together the fresh mint, fresh rosemary and the garlic, then mix with 1 tbsp olive oil. Smear over four lean lamb chops or cutlets.", "Place the aubergine, courgette and red or yellow pepper on to a baking sheet. Drizzle with 1 tbsp olive oil and place the lamb chops on top. Bake in the oven for 20-25 minutes.", "Top the chops with feta cheese and add the cherry tomatoes to the pan. Cook for a further 10 minutes until the cheese just starts to brown.", "Serve the chops with the roasted vegetables, toasted ciabatta bread and mixed leaf salad."]}, {"isVegetarian": false, "title": "Mediterranean pork meatballs", "url": "www_bbc_co_uk_food_recipes_mediterraneanporkmea_85971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz olive oil", "1 onion, chopped", "1 celery stalk, finely chopped", "2 garlic cloves, chopped", "2 tbsp tomato purée", "2 x 400g/14fl oz cans chopped tomatoes", "1 cinnamon stick", "100ml/3½fl oz chicken stock", "100ml/3½fl oz red wine", "salt and freshly ground pepper", "1 tbsp olive oil", "1 onion, chopped", "5 garlic cloves, chopped", "450g/1lb minced pork", "1 tbsp chopped fresh basil", "1 tsp ground cinnamon", "salt and freshly ground pepper", "vegetable oil, for brushing", "spaghetti, cooked according to packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat the oil in a large pan over a low heat. Add the onion, celery and garlic and fry until softened, but not coloured. ", "Add the tomato purée and cook for a few minutes, then add the canned tomatoes, cinnamon, stock and wine.", "Season, to taste, with salt and freshly ground black pepper and bring to the boil, then turn the heat down very low.", "Half-cover the pan with a lid and leave the sauce to simmer for one hour, stirring occasionally.", "If you want a smooth sauce, transfer to a food processor and blend the sauce, then pass it through a fine sieve before using. Otherwise use as it is.", "Meanwhile, for the meatballs, heat the oil in a frying pan over a medium heat.", "Add the onion and the garlic and fry until softened. Remove from the heat and allow to cool slightly.", "Preheat the grill to its highest setting.", "Place the pork mince, basil and cinnamon into a bowl and add the cooked onion and garlic. Season generously with salt and freshly ground black pepper and mix well.", "Roll small amounts of the mince mixture into balls. This quantity of mixture should make 12-16 meatballs, depending on size.", "Brush the meatballs with a little oil and place onto a baking tray.", "Place under the grill to cook for 6-8 minutes, turning occasionally and brushing them with a little oil as they brown.", "To serve, stir the cooked spaghetti through the sauce and place onto plates with three or four meatballs placed on top."]}, {"isVegetarian": true, "title": "Mediterranean pasta", "url": "www_bbc_co_uk_food_recipes_mediterraneanpasta_88410", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 small onion, finely chopped", "2 small cloves garlic, finely chopped", "2 x 400g/14oz cans chopped tomatoes", "1 tbsp sun-dried tomato paste", "1 bay leaf", "1 tsp dried thyme", "1 tsp dried basil", "1 tsp dried oregano", "1 tsp dried parsley", "½ tsp salt, or to taste", "½ tsp brown sugar", "freshly ground black pepper", "1 aubergine", "2 courgettes", "2 red peppers, de-seeded", "2 garlic gloves, peeled", "2-3 tbsp olive oil", "12 small vine-ripened tomatoes", "500g/1 lb 1oz pasta shapes, such as gigli, lumache or conchiglie", "100g/3½oz parmesan cheese (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the oil in a pan. Add the onions and fry until soft but not browned. Add the garlic and fry for one minute.", "Add the remaining sauce ingredients and bring to the boil. Reduce the heat and simmer for about an hour. Check for seasoning and add more salt and freshly ground black pepper, if needed.", "For the vegetables, preheat the oven to 180C/355F/Gas 4.", "Chop the aubergine, courgettes and red peppers into 2.5cm/1in pieces and place in a roasting tin with the whole garlic cloves. Drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper. Mix the vegetables to coat in the olive oil. Roast in the oven, stirring occasionally, for 45 minutes, or until soft turning golden. Add the tomatoes to the roasting tin for the last 20 minutes of cooking time.", "When ready to serve, cook the pasta according to the packet instructions. Drain the pasta well and stir through the sauce.", "Divide evenly among four serving plates and top with the roasted vegetables. Grate over the parmesan cheese and serve with crusty bread or bruschetta on the side."]}, {"isVegetarian": false, "title": "Mediterranean-style lamb chops", "url": "www_bbc_co_uk_food_recipes_mediterraneanstylela_83720", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanstylela_83720_16x9.jpg", "ingredients": ["2 tbsp chopped fresh mint ", "1 tsp finely chopped fresh rosemary ", "3 garlic cloves", "2 tbsp olive oil", "4 lean lamb chops or cutlets", "1 aubergine, sliced", "4 courgettes, sliced", "2 red peppers, cut into large chunks", "2 yellow peppers, cut into large chunks", "85g/3oz feta cheese, crumbled", "250g/9oz cherry tomatoes", "mixed leaf salad"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Using a pestle and mortar or food processor, blend together the mint, rosemary and the garlic, then add one tablespoon of the olive oil. Smear the herb mixture over the lamb chops.", "Place the aubergine, courgette and peppers on a baking sheet. Drizzle with the remaining olive oil and place the lamb chops on top. Place into the oven to roast for 20-25 minutes.", "Remove from the oven and top the chops with the feta and add the cherry tomatoes to the tray. Return to the oven for a further 10 minutes until the cheese just starts to brown and the lamb chops are just cooked through.", "Serve the chops with the roasted vegetables and mixed leaf salad."]}, {"isVegetarian": true, "title": "Mediterranean-style pasta with sun-blushed tomatoes, artichokes and olives", "url": "www_bbc_co_uk_food_recipes_mediterraneanstylepa_88356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "¼ red onion, chopped", "4 sun-blushed tomatoes, chopped", "100g/3½oz roasted artichokes (from a jar), drained and chopped", "2 tbsp black olives, pits removed", "small handful fresh sage leaves, chopped", "salt and freshly ground black pepper ", "125g/4½oz fresh tagliatelle", "grated parmesan (or a similar vegetarian hard cheese), to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small saucepan, add the onion and fry gently for four minutes, or until softened but not coloured. Add the sun-blushed tomatoes, roasted artichokes and black olives and fry for 1-2 minutes. Stir in the sage leaves and season, to taste, with salt and freshly ground black pepper.", "Cook the tagliatelle according to the packet instructions and drain, leaving a little of the cooking liquid in the bottom of the pan. Return to the pan, add the sauce and stir to coat.", "Spoon into a bowl and serve with grated parmesan on top."]}, {"isVegetarian": true, "title": "Mediterranean vegetable stack with chargrilled polenta and sauce vierge", "url": "www_bbc_co_uk_food_recipes_mediterraneanvegetab_86234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ yellow courgette, sliced", "½ aubergine, sliced", "salt and freshly ground black pepper", "125g/4½oz quick-cook polenta", "250ml/9fl oz hot chicken stock (vegetarians can substitute vegetable stock)", "pinch dried chilli flakes", "2 tsp chopped fresh rosemary ", "salt and freshly ground black pepper", "olive oil, for drizzling", "2 tbsp olive oil", "1 tomato, chopped", "small handful fresh basil, chopped", "salt and freshly ground black pepper", "squeeze lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the vegetable stack, rub the courgette and aubergine slices with the olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until hot and griddle the courgette and aubergine slices for 2-3 minutes on each side, or until softened and lightly charred. Set aside and keep warm.", "For the chargrilled polenta, place the polenta and stock into a small saucepan. Add the chilli flakes, rosemary and seasoning and bring to the boil. Reduce the heat and simmer for 2-3 minutes, or until all the stock has been absorbed and the polenta is no longer grainy.", "Lightly oil a small roasting tin and pour in the polenta. Allow to cool, then place into the fridge to chill and set. When set, cut the polenta into three equally sized squares.", "Rub the squares with olive oil, heat a griddle pan and griddle the polenta squares for 1-2 minutes on each side, until lightly charred.", "For the sauce vierge, place all the sauce vierge ingredients into a bowl and mix well.", "To serve, place one chargrilled polenta square onto a serving plate and top with the grilled courgette slices. Place another layer of polenta on top, then the aubergine slices, followed by the final square of polenta. Pour the sauce vierge around the plate."]}, {"isVegetarian": true, "title": "Mediterranean-style salad with tapenade", "url": "www_bbc_co_uk_food_recipes_mediterraneanstylesa_85106", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, chopped", "50g/1¾oz black olives, stones removed", "2 tbsp olive oil", "2 tomatoes, chopped", "1 handful fresh parsley", "1 handful fresh basil, torn", "1 tsp balsamic vinegar ", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the tapenade, place the garlic, olives and oil into a mini food processor and blend until smooth.", "For the Mediterranean-style salad, place all of the salad ingredients into a bowl and mix well.", "To serve, place the salad onto a plate with the tapenade drizzled over."]}, {"isVegetarian": true, "title": "Medium-cut Seville orange marmalade", "url": "www_bbc_co_uk_food_recipes_medium-cut_seville_70291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/medium-cut_seville_70291_16x9.jpg", "ingredients": ["500g/1lb 2 oz Seville oranges", "50ml/2 fl oz lemon juice", "1kg/2lb 4 oz white sugar: regular, not with added pectin", "soft dark brown sugar, optional"], "serves": "Makes 3-4 450g/1lb jars", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Weigh the oranges and make a note of the weight, as this will tell you how much of the other ingredients you’ll need, to ensure the marmalade sets well. My basic ratio is: both the sugar and the strained liquid from the sliced and simmered oranges should roughly equal twice the weight of the uncooked whole oranges. So if you start with 500g/1lb 2 oz whole oranges, after cooking you want to be left with a litre/1¾ pint of liquid once the peels have been strained out, and you need 1kg/2lb 4 oz of sugar. ", "Cut the oranges in half and squeeze out the juice, as this makes chopping the peel less messy. Remove any pips from the juice, spoon any remaining pips out of the peel, place them in a tea cup and cover with water. Then chop the peel into shreds about 0.25cm/⅛in across and place these in a bowl with the juice and cover with water. Leave both overnight, as this will help the marmalade set well.", "The next day, place the peel and water in a saucepan. Sieve the pips, place their soaking water (which will have jellied slightly) into the saucepan, then tie the pips in muslin and drop this into the pot. Bring to the boil then simmer for 2-3 hours, topping up with water so that the fruit stays well covered, until the peel is soft when squished between your fingers. Alternatively, cook in a pressure cooker for about 30 minutes.", "Strain the juice from the peel and measure it. Whatever the original weight of fruit was at the beginning, you want about double that in cooking liquid. So if you started with 500g/1lb 2 oz fruit, then try and have roughly a litre/1¾ pint (in other words 1000ml or 1000g) of cooking liquid left. If you have more, boil it down in a saucepan to intensify it. If you have less, top it up with water to dilute it.", "Then add the sugar (double the weight of the oranges), plus 1-2 tbsp brown sugar if you like to make the colour darker. Add the strained peel, plus 50ml/2 fl oz of lemon juice for every 500g/1lb 2 oz uncooked whole oranges used. Bring to the boil, skim off any white froth and pips that rise to the surface, and then boil until the temperature reaches 105C/220F.", "Meanwhile sterilise enough jars in the oven and have the lids washed and ready. When the marmalade reaches 105C/220F, turn the heat off and leave for 10 minutes. Ladle the marmalade into a jug then pour this carefully into the jars, leaving just a bare 0.5cm/¼in gap at the top. Screw the lid on tightly and leave undisturbed until completely cold. "]}, {"isVegetarian": true, "title": "Medjool date and walnut scones", "url": "www_bbc_co_uk_food_recipes_medjool_date_and_walnut_11732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz self-raising flour sifted, plus extra for flouring", "100g/3½oz butter, at room temperature, chopped into little squares, plus extra for greasing", "40g/1½oz caster sugar", "pinch flaked sea salt\t", "300ml/10fl oz full-fat milk", "1 tbsp crème fraîche", "Medjool dates, chopped into chunks (to taste)", "walnuts, toasted and chopped (to taste)", "strawberry jam ", "clotted cream"], "serves": "Makes 6 large scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 6 and grease and flour a baking tray. ", "Put the flour into a large bowl, add the butter and rub it into the flour to make breadcrumbs. Add the sugar and salt and mix together. ", "Pour in the milk gradually and mix in, reserving a few tablespoons for a glaze. Mix in the crème fraîche until well-combined. ", "Add dates and walnuts, to taste, ensuring that they’re evenly dispersed.", "Lightly flour a clean work surface and roll out the scone dough to a thickness of 2.5cm/1in and use a round pastry cutter to cut out six scones. Re-roll any off-cuts to make more scones, but be careful not to overwork the dough.", "Place the scones onto the prepared baking tray and bake for 15 -20 minutes, or until risen and golden-brown. ", "Serve with good-quality strawberry jam and clotted cream."]}, {"isVegetarian": true, "title": "Medley of fruit with citrus-spiced biscuits and Champagne", "url": "www_bbc_co_uk_food_recipes_medley_of_fruit_with_82189", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, softened", "120g/4½oz golden caster sugar", "2 free-range egg yolks", "½ large orange, finely grated zest only", "½ unwaxed lemon, finely grated zest only", "250g/9oz plain flour, plus extra for dusting", "½ tsp mixed spice", "¼ tsp ground ginger", "¼ tsp ground cinnamon", "¼ orange, finely grated zest only", "¼ lime, finely grated zest only", "¼ unwaxed lemon, finely grated zest only", "50g/1¾oz caster sugar", "150g/5½oz raspberries", "100g/3½oz caster sugar", "1 lemon, juice only ", "1 clementine, segmented ", "½ pineapple, balled using a Parisian scoop ", "50g/1¾oz blackberries, halved ", "50g/1¾oz passion fruit seeds", "50g/1¾oz black seedless grapes, halved", "50g/1¾oz pomegranate seeds", "1 pear, peeled and balled using a Parisian scoop ", "Champagne ", "small fresh mint leaves, to decorate"], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the biscuits, preheat oven to 200C/180C Fan/Gas 6. ", "Beat the butter and sugar in a bowl until pale and creamy. Gradually beat in the egg yolks until fully incorporated, then beat in the rest of the ingredients.", "Roll out the dough on a lightly floured surface until about 5mm/¼in thick. Cut out the biscuits using a 6cm/2in cutter and arrange them on a non-stick baking sheet, re-rolling and cutting any trimmings. Transfer the biscuits to the fridge until firm.", "To make the citrus sugar, mix the zests with the sugar in a small bowl until combined. ", "Bake the biscuits for 8–10 minutes, or until they are starting to turn a pale golden colour. Sprinkle the hot biscuits with the citrus sugar and leave to cool on a wire rack.", "To make the fruit medley, blend the raspberries with the sugar and lemon juice in a food processor, then pass through a sieve. ", "Divide the purée between four serving glasses, top with a mixture of the fruits and decorate with mint leaves. ", "In front of the guests, crack open the Champagne and pour over the top of the dish. Serve with the citrus-spiced biscuits. "]}, {"isVegetarian": false, "title": "Seafood with herbs and garlic", "url": "www_bbc_co_uk_food_recipes_medleyofseafoodwithh_72992", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/19½oz mixed seafood (such as cod, salmon and prawns) ", "40g/1½oz butter", "½ tbsp chopped garlic", "4 tbsp spring onions, finely chopped", "120ml/4½fl oz dry white wine", "1 tsp lemon zest", "½ tsp salt", "1 x 400g/14¼ oz can chopped tomatoes, with the juices", "few drops Tabasco sauce (optional) or chilli sauce", "1 tbsp chopped parsley", "1 tbsp chopped chives", "1 tbsp chopped dill", "a few sprigs of various herbs, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the fish and cut into 5cm (2in) pieces. Wash the prawns and remove shells.", "Melt 20g (¾oz) of butter in a large frying pan. Add the garlic and fry until just starting to colour. ", "Add the seafood, spring onions, white wine, and lemon zest.", "Cover and simmer for two minutes. ", "Remove the lid and add the tomatoes, Tabasco sauce and herbs.", "Simmer for just two minutes more.", "Turn off the heat and stir in the remaining butter.", "Serve immediately in warm bowls, garnished with a few sprigs of herbs."]}, {"isVegetarian": true, "title": "Jam-filled butter biscuits (sables)", "url": "www_bbc_co_uk_food_recipes_medley_of_mini_sables_84193", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/medley_of_mini_sables_84193_16x9.jpg", "ingredients": ["250g/9oz plain flour", "200g/7oz butter, cut into small cubes", "100g/3½oz icing sugar", "pinch of salt", "2 free-range egg yolks", "4 tbsp raspberry jam", "4 tbsp apricot jam"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Place the flour, butter, icing sugar and salt into a bowl. Using your fingertips, rub the ingredients together until the mixture resembles breadcrumbs. ", "Add the egg yolks and mix until a dough forms. Turn out onto a lightly floured work surface and roll out to a thickness of about 0.5cm/¼in. Cut out shapes using a 4cm/1½in cutter. ", "Divide the sables in half. Using a 2cm/1in fluted cutter, make a hole in the middle of half of the sable biscuits and discard the dough. Place all the sables on a baking tray.", "Bake the sables for 10-12 minutes, or until light golden-brown and crisp. Remove and transfer to a wire rack to cool. ", "Using a teaspoon, place a small dollop of raspberry jam on a whole sable. Place a sable (with a hole) over the whole sable biscuit. Repeat until half the sables are done with raspberry jam, then repeat the process, using apricot jam, for the remaining sables. "]}, {"isVegetarian": false, "title": "Meen molee (Fish curry cooked in coconut)", "url": "www_bbc_co_uk_food_recipes_meenmoleefishcurryco_77185", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 garlic cloves", "3 green finger chillies", "5cm/2in piece root ginger, peeled", "3 tbsp groundnut oil", "1 small onion, finely sliced", "5-6 curry leaves ", "¼ tsp ground turmeric ", "¼ tsp salt ", "200ml/7fl oz coconut milk ", "155ml/6fl oz boiling water", "500g/1lb 2oz haddock fillets, cut into 4cm/2in-wide pieces", "2 medium tomatoes, coarsely chopped", "basmati rice"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the garlic, chillies, and ginger together in a food processor and process until smooth.", "Heat the oil in a frying pan or wok and fry the onion with the curry leaves for four minutes over a medium heat.", "Stir in the garlic, chilli and ginger mixture with the turmeric and salt.  Fry for two minutes, then add 100ml/3½fl oz coconut milk with 155ml/6fl oz boiling water.", "Simmer for two minutes and then add the fish pieces and gently simmer for 5-6 minutes.  ", "Add half of the tomato and the remaining coconut milk and simmer for 3-4 minutes.", "Garnish with the remaining chopped tomato.", "Serve with basmati rice."]}, {"isVegetarian": false, "title": "Megrim sole with shrimp butter, sea kale and lemon flowers", "url": "www_bbc_co_uk_food_recipes_megrim_sole_with_shrimp_07093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 450g/16oz megrim sole or Cornish sole", "110g/4oz plain flour", "salt and freshly ground black pepper", "50ml/2fl oz vegetable oil", "knob of butter", "150g/5oz sea kale, cut into 5cm/2in batons", "2 lemons", "125g/4½oz butter ", "60g/2oz shallot, finely chopped", "1 tsp mace", "½ tsp cayenne pepper", "2 tsp Gentlemen’s relish", "90g/3½oz brown shrimps ", "salt and freshly ground black pepper", "squeeze lemon juice", "1 punnet pea shoots, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sole, preheat the oven to 230C/450F/Gas 8.", "Ask your fishmonger to remove the dark skin from the megrim. You can do it yourself by cutting into the tail of the fish at an angle and gently scraping back the skin. With a dry kitchen towel pull the skin from the tail towards the head, it should all pull away.", "Cut the head off and using sharp scissors, cut around the edge of the fish and remove the fins. Wash the fish and pat dry.", "Sprinkle the flour onto a plate and season with salt and freshly ground black pepper.", "Dust the fish in the flour on each side.", "Heat a non-stick ovenproof frying pan on a high heat and pour in the vegetable oil.", "Place the fish in the pan, white skin-side down, and fry for 2-3 minutes, or until pale golden-brown. Turn the fish over using a palette knife.", "Add a knob of butter and place in the oven to cook for 6-7 minutes.", "Meanwhile, for the shrimp butter, cook the sea kale in a pan of salted boiling water for 2-3 minutes, or until tender. Drain and refresh in iced water, then drain once more and pat dry. ", "Peel the lemon, remove the pith by gently scraping with a knife (try not to pierce the flesh of the lemon) and slice into rounds (these are your lemon flowers.)", "Heat a frying pan until hot, add the butter and shallot and fry for 2-3 minutes. Add the mace, cayenne pepper and Gentlemen’s relish and stir until well combined. Add the shrimps and sea kale, remove the pan from the heat and keep warm.", "Season with salt and freshly ground black pepper and a squeeze of lemon juice.", "To serve, place the sole in the centre of a large serving plate. Spoon over the shrimp mixture, criss-crossing the batons of sea kale over the top of the fish. Squeeze in two slices of lemon, then sprinkle with pea shoots."]}, {"isVegetarian": true, "title": "Melanzane pasta", "url": "www_bbc_co_uk_food_recipes_melanzane_pasta_59215", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/melanzane_pasta_59215_16x9.jpg", "ingredients": ["2 large or 3 small aubergines, sliced into 5mm/¼in rounds", "4 tbsp olive oil", "6–7 sheets dried lasagne ", "salt and freshly ground black pepper", "50g/1¾oz butter, plus extra for greasing", "50g/1¾oz plain flour", " 568ml/1 pint milk, warmed", "1 tsp Dijon mustard", "100g/3½oz Parmesan (or a similar vegetarian alternative), grated", "2 garlic cloves, crushed", "1 x 400g tin chopped tomatoes", "500ml/18fl oz passata", "1 bunch basil, chopped", "2 tsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease a 2.5 litre/4½ pint ovenproof dish with butter and line two baking trays with non-stick baking paper. ", "Arrange the aubergine slices in a single layer on the prepared trays. Drizzle over the oil and season with salt and pepper. Roast for 20–25 minutes turning the slices over halfway through the cooking time. Set aside. ", "Lay the pasta sheets in a dish and cover with hot water for 10 minutes to soften. ", "To make the béchamel sauce, heat the butter in a saucepan. Once melted, sprinkle in the flour and whisk for a few minutes over a high heat to form a roux. Pour the warmed milk into the roux and whisk. Bring to the boil, whisking for a few minutes until smooth. Add the mustard and two-thirds of the Parmesan. Season with salt and pepper and stir. Set aside.", "To make the tomato sauce, put all the ingredients in a mixing bowl. Season with salt and pepper. ", "To assemble, spoon a third of the tomato sauce in the base of the prepared dish, top with a third of the béchamel. Arrange a third of the aubergines on top and 3–3½ sheets of lasagne (you may need to break the lasagne into pieces to make it fit in an even layer). Repeat so you have three layers of sauce and two layers of pasta, sprinkle with the remaining Parmesan.", "Leave to stand for 1 hour before cooking, or overnight.", "Bake for 35–45 minutes until golden-brown and bubbling. Stand for 5 minutes before serving. Serve hot with garlic bread."]}, {"isVegetarian": false, "title": "Melon and Parma ham salad", "url": "www_bbc_co_uk_food_recipes_melonandparmahamsala_78028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ melon, de-seeded and chopped into small chunks", "50g/1¾oz rocket leaves", "2 endive leaves, sliced into thin julienne strips", "1 tbsp olive oil", "3 sun-dried tomatoes", "2 slices Parma ham", "4 endive leaves, sliced in half length ways", "1 tsp balsamic vinegar", "salt and freshly ground black pepper, to taste"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl toss the melon, rocket and endive julienne in the olive oil.", "Transfer to a plate and add the sun-dried tomatoes and Parma ham.", "Place the eight halves of endive leaves around the salad, pointing outwards.", "Drizzle with the balsamic vinegar and season to taste."]}, {"isVegetarian": true, "title": "Melon cocktail", "url": "www_bbc_co_uk_food_recipes_meloncocktail_83623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lime, juice only", "1 tbsp runny honey", "1 tbsp fresh mint leaves", "½ cantalope melon, small rounds cut out with a melon baller, the skin left as a complete 'bowl'", "50g/1¾oz whole walnuts", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the lime juice, honey and mint into a small food processor and blend until smooth.", "Pour the mixture into a bowl, add the melon balls and walnuts and mix well to coat.", "To serve, pour the mixture into the empty melon shell 'bowl'."]}]