[{"isVegetarian": true, "title": "Basic chocolate roulade", "url": "www_bbc_co_uk_food_recipes_chocolateroulade_83888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob butter, for greasing", "170g/6oz plain chocolate (70% cocoa solids)", "5 free-range eggs, separated", "225g/8oz sugar", "284ml/10fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Prepare a Swiss roll tin by greasing it with butter and then lining it with a piece of greaseproof paper slightly larger than the tin.", "Gently melt the chocolate in a glass bowl set over a saucepan of boiling water.", "Beat the egg yolks into the sugar. ", "When the chocolate has cooled and melted a little, pour it into the egg yolk and sugar mixture.", "Beat the egg whites to stiff peaks, before folding into the chocolate mix.", "Pour the mix into the tin and bake in the oven for 15-20 minutes until firm to the touch - you will know the cake is ready when an inserted skewer comes out clean.", "Run a tea towel under cold water and wring out.", "Place the tea towel over the chocolate roulade once it has cooled a little. After ten minutes remove the tea towel, transfer the roulade to the fridge and leave overnight.", "The next day, sieve icing sugar over a sheet of greaseproof paper a little larger than the tin.", "Tip the cake out onto the fresh greaseproof paper and peel off the other piece of greaseproof paper from the top of the roulade.", "Whip the double cream and smooth it all over the roulade.", "Roll up the roulade, using the greaseproof paper to help hold it together. It may crack a little, but this will not affect the quality of the cake."]}, {"isVegetarian": true, "title": "Chocolate roulade with praline cream", "url": "www_bbc_co_uk_food_recipes_chocolaterouladewith_87177", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflour oil, for greasing", "6 free-range eggs, separated", "175g/6oz caster sugar", "50g/2oz cocoa powder, sifted", "25g/1oz shelled almonds", "25g/1oz shelled hazelnuts", "110g/4oz caster sugar", "300ml/10½fl oz double cream", "50g/2oz cocoa powder, sifted", "75g/3oz dark chocolate, grated"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the roulade, preheat the oven to 180C/465F/Gas 4.", "Lightly grease a 23cm x 33cm/9in x 13in Swiss roll tin with a little sunflower oil and line with baking parchment.", "Place the egg yolks and sugar into a large bowl and whisk until light and pale.", "Sift the cocoa powder into the egg yolk mixture and whisk until completely combined.", "In a clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Add half of the whisked egg whites to the cocoa mixture and mix together well, then gently fold in the remaining whisked egg whites until just combined.", "Pour the mixture into the Swiss roll tin, moving the tin so that the mixture spreads evenly into the corners. ", "Transfer to the oven to bake for 20 minutes, or until firm to the touch, then remove from the oven. Place a clean, dry tea towel on top of the roulade and on top of this place another tea towel that has been soaked in cold water and well wrung out. Leave in a cool place for an hour.", "For the filling, heat a dry frying pan until hot and add the almonds and hazelnuts and toast until golden-brown all over.", "Remove the nuts from the pan, allow to cool slightly, then roughly chop.", "Add the sugar to the same pan and return to the heat. Cook until the sugar has melted and caramelised to a golden-brown colour.", "Add the chopped nuts to the caramel and swirl to combine and coat the nuts in caramel.", "Pour the caramel and nut mixture into a well-greased, lined baking tray and leave to cool and set. Once set, remove the mixture and break up into small pieces.", "Whisk the cream until soft peaks are formed when the whisk is removed, then fold the caramel nut pieces into the cream.", "To serve, remove the tea towels from the sponge, and turn out onto a piece of baking parchment that has been dusted with sifted cocoa powder.", "Peel the lining paper from the sponge and spread the whipped cream mixture evenly over the top.", "Starting from a long end, roll up the sponge, using the cocoa-dusted paper to help lift the cake as you roll it forward.", "Once rolled up, dust the roulade with more sifted cocoa powder and sprinkle the grated chocolate over the top."]}, {"isVegetarian": true, "title": "Chocolate sauce", "url": "www_bbc_co_uk_food_recipes_chocolatesauce_1302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dark chocolate, broken into pieces", "80g/3oz caster sugar", "120ml/4fl oz double cream", "60ml/2fl oz hot water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients into a thick-bottomed saucepan.", "Put on a gentle heat and stir until the chocolate has melted and the sauce is hot."]}, {"isVegetarian": true, "title": "Chocolate soufflé", "url": "www_bbc_co_uk_food_recipes_chocolatesouffle_81163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp cocoa powder", "2 free-range eggs, separated ", "100ml/3½fl oz double cream ", "2 tbsp caster sugar", "2 tbsp groundnut oil ", "1 orange, segmented"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a large bowl mix the cocoa and egg yolks together. Add half the double cream and whisk together.", "Whisk the egg whites until stiff peaks form. Continue whisking and slowly add the sugar until you have glossy peaks. ", "Fold the whites carefully into the chocolate mixture, then heat the oil in a small non-stick frying pan.", "Pour the mixture into the hot pan, then transfer to the oven for 8 minutes, or until cooked through.", "To serve, pour over the remaining double cream and garnish with the segmented oranges."]}, {"isVegetarian": true, "title": "Chocolate tart with clotted cream", "url": "www_bbc_co_uk_food_recipes_chocolatetartwithclo_91269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz butter, cut into cubes, plus extra for greasing", "250g/8¾oz plain flour, plus extra for dusting", "50g/1¾oz icing sugar", "vanilla pod, seeds only (scraped out with a knife)", "1 free-range egg, beaten", "400g/14¼oz dark chocolate, broken into pieces", "150ml/5½fl oz milk", "250ml/8¾fl oz whipping cream", "2 free-range eggs, beaten", "clotted cream, to serve"], "serves": "Makes 1 28cm/11in tart", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 28cm/11in tart case with butter. ", "For the sweet pastry, in a food processor, pulse the butter and flour until the mixture resembles breadcrumbs. ", "Transfer the butter and flour mixture to a bowl and add the icing sugar and vanilla seeds. Mix until well combined. ", "Add the beaten egg and mix, using your hands, until the mixture comes together as a dough. Wrap the dough in cling film and chill in the fridge for 30 minutes.", "Roll the chilled pastry out onto a lightly floured surface until it is 30-35cm/12-14in in diameter. Line the prepared tart tin with the pastry, pressing it gently to the tin and trimming off any excess. Line the pastry case with baking parchment and half-fill with ceramic baking beans, then transfer to the oven and bake for 8-10 minutes. ", "Remove the baking beans and baking parchment, then prick the pastry several times with a fork. Return to the oven and continue to cook for a further 4-5 minutes, or until the pastry is crisp and pale golden-brown.", "Reduce the oven temperature to 130C/250F/Gas 1.", "For the tart filling, bring some water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water. Do not allow the base of the bowl to touch the water. Add the dark chocolate pieces to the bowl and stir until smooth and completely melted. Remove the bowl from the heat and set aside.", "Bring the milk and cream to the boil in a pan, then pour the mixture over the melted chocolate. ", "Add the beaten eggs and mix until smooth and well combined.", "Pour the filling mixture into the pastry case and bake for 20-25 minutes, or until set. Allow to cool before serving.", "To serve, place one slice of tart into the centre of each serving plate. Spoon a little clotted cream alongside."]}, {"isVegetarian": true, "title": "Chocolate tart with white chocolate sauce", "url": "www_bbc_co_uk_food_recipes_chocolatetartwithwhi_87928", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatetartwithwhi_87928_16x9.jpg", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "pinch salt", "125g/4½oz cold butter", "3 free-range egg yolks", "125g/4½oz caster sugar", "400ml/14fl oz double cream", "few drops vanilla extract", "100g/3½oz caster sugar", "400g/14oz dark chocolate, approx 70 per cent cocoa solids", "50g/2oz butter", "250ml/9fl oz single cream", "1 vanilla pod, split lengthways", "100g/3½oz white chocolate, chopped", "raspberries and fresh mint sprigs, to serve"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, salt and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the egg yolks and sugar and pulse until the mixture comes together to form a dough. You may need to add a splash of ice cold water if the pastry is too dry. Place into a bowl, cover the bowl with cling film and chill in the fridge for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Roll the dough out on a lightly floured surface until large enough to line a 25cm/10in fluted tart tin. Place into the tin, then place a piece of greaseproof paper on top and weigh it down with baking beans or rice.", "Place into the oven for 15 minutes, then remove the paper and beans and return to the oven for five minutes, or until lightly browned.", "Meanwhile, for the filling, bring the cream, vanilla extract and sugar slowly to the boil in a pan.", "Break the chocolate and butter into pieces and place into a large bowl. Pour over the cream mixture and whisk slowly until the chocolate has melted and the mixture is smooth.", "Pour the chocolate mixture into the tart case and leave to cool. Place in the fridge to set for two hours.", "For the sauce, place half of the cream and the vanilla pod into a pan and heat until the mixture is warm but not too hot when touched with a finger. Take off the heat and remove the vanilla pod.", "Add the white chocolate and stir until melted. Stir in the remaining cream.", "To serve, cut the tart into wedges and drizzle over the white chocolate sauce. Serve with raspberries and a sprig of mint."]}, {"isVegetarian": true, "title": "Chocolate yule log", "url": "www_bbc_co_uk_food_recipes_chocolateyulelog_93127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz caster sugar", "6 free-range eggs, separated", "50g/2oz plain flour", "175g/6oz dark chocolate,  melted", "150g/5oz sweetened chestnut purée", "150ml/5fl oz double cream, whipped until soft peaks form when the whisk is removed", "50g/2oz mascarpone", "75g/3oz cooked chestnuts, roughly chopped", "2-3 tbsp icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Line a 23x33cm/9x13in Swiss roll tin with a sheet of greaseproof paper and brush the paper lightly with vegetable oil.", "Whisk the caster sugar and egg yolks together in a bowl until pale and thick. Stir in the flour until combined, then stir in the melted chocolate.", "Meanwhile, whisk the egg whites until stiff peaks form when the whisk is removed. ", "Gently fold a spoonful of the whisked egg whites into the chocolate mixture, using a large metal spoon, then gently fold in the remaining egg whites until just combined. (NB: Do not overmix.)", "Carefully pour the cake batter into the prepared Swiss roll tin and bake for 18-20 minutes, until the cake has risen and springs back when a finger is pressed gently into the centre.", "When the cake is cooked, set it aside, in the tin, on a wire rack, to cool for at least two hours.", "When the cake is completely cool, run a butter knife around the inside edge of the tin to loosen the cake. Spread a tea towel out on a large chopping board. With one bold movement, turn the whole cake out onto the tea towel, then lift away the tin. Carefully peel away the greaseproof paper lining.", "Meanwhile, for the filling, carefully mix the chestnut purée, whipped cream and mascarpone in a bowl until well combined, then fold in the chopped chestnuts. Spread the filling all over the cake, leaving a 2cm/1in border free at the edge.", "Starting at the longest side of the cake, gently but firmly roll up the cake, as you would a Swiss roll, using the tea towel as a guide. Transfer the Swiss roll to a flat serving dish.", "To serve, cut the yule log into slices and dust with icing sugar."]}, {"isVegetarian": true, "title": "Choi sum and mixed vegetable salad with pineapple dressing", "url": "www_bbc_co_uk_food_recipes_choisumandmixedveget_89262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz choi sum (Chinese cabbage) leaves, sliced ", "100g/3½oz sugar snap peas", "2 large carrots, julienned", "1 red pepper, de-seeded, sliced  ", "1 yellow pepper, de-seeded, sliced", "240g/8½oz canned pineapple, drained, sliced", "2 spring onions, finely sliced", "2-3 tbsp groundnut oil or olive oil", "7 tbsp pineapple juice ", "2 tbsp light soy sauce ", "1 tbsp rice vinegar or cider vinegar", "pinch freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, toss all of the salad ingredients together in a large salad bowl. ", "For the dressing, whisk all of the dressing ingredients together in a small bowl and drizzle over the salad. Toss well to coat, then pile onto serving plates and serve."]}, {"isVegetarian": false, "title": "Cholent", "url": "www_bbc_co_uk_food_recipes_cholent_16734", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cholent_16734_16x9.jpg", "ingredients": ["170g/6oz butter beans", "280g/10oz barley", "2 tbsp goose fat or sunflower oil", "1.5kg/3lb 5oz beef brisket, or braising steak, cut into cubes", "1.8kg/4lb potatoes, preferably King Edward or Maris Piper, peeled and left whole", "sea salt and freshly ground black pepper", "280g/10oz flour", "2 tsp baking powder", "1 large onion, cut into small cubes", "2 tbsp sunflower oil"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the butter beans in cold water for 24 hours before they are needed. You can use canned beans but dried beans give a much better flavour.", "On the evening of cooking the dish, first make the dumpling. Put the flour and baking powder in a bowl and add the onion, oil and seasoning. ", "Add enough water to make a soft dough, shape into a fat oval, then wrap in clingfilm and leave to chill in the fridge for at least 30 minutes.", "Preheat the oven to 120C/250F/Gas ½. Wash and drain the barley and drain the soaked butter beans. ", "Grease a large heavy casserole dish or a heavy pot with the goose fat or sunflower oil (do not use olive oil) and place the beef in the middle of the dish.", "Position the dumpling, beans, barley and potatoes around the beef, then pour in boiling water to cover everything. Season with salt and freshly ground black pepper and cover with a tightly-fitting lid. Place on a low shelf in the oven and leave to cook overnight.", "In the morning, check there is enough liquid in the pot - there’s usually enough to leave the dish cooking as it is, but if it looks dry, add a little water. The dish will be ready by lunchtime. If you want a darker colour, you could turn the oven heat up a couple of hours before you eat it."]}, {"isVegetarian": false, "title": "Chopped salad", "url": "www_bbc_co_uk_food_recipes_chopped_salad_41277", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chopped_salad_41277_16x9.jpg", "ingredients": ["400g tin chickpeas, drained and rinsed ", "1 iceberg lettuce, chopped", "½ romaine lettuce, chopped", "120g/4½oz Italian salami, cut into thin strips roughly 5cm/1¾in long", "200g/7oz mozzarella, roughly chopped", "3 tomatoes, roughly chopped", "½ cucumber, roughly chopped", "small handful basil leaves, finely chopped", "flaked sea salt and freshly ground black pepper", "4 tbsp olive oil", "1 tbsp red wine vinegar", "½ tsp mustard powder", "½ tsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, mix the chickpeas with 1 teaspoon of salt, then toss with the remaining ingredients in a large bowl.", "To make the dressing, mix all the ingredients together with ½ teaspoon of salt 12 turns of the black pepper mill in a bowl.", "Drizzle the dressing over the salad and toss well. Serve immediately."]}, {"isVegetarian": false, "title": "Chopped duck egg with confit salmon", "url": "www_bbc_co_uk_food_recipes_choppedduckeggwithco_90364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 duck eggs", "50g/2oz unsalted butter, softened", "50ml/2fl oz double cream", "salt and freshly ground black pepper ", "500ml/½ litre olive oil", "200g/7oz kiln-roasted cured salmon fillet, sliced into 4 pieces", "110g/4oz watercress, leaves picked", "fresh chervil sprigs"], "serves": "Serves 4 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck eggs, bring a pan of water to the boil. Using a slotted spoon, gently lower the duck eggs into the water and simmer gently for 7-8 minutes to soft-boil the eggs. ", "Using a slotted spoon, remove the eggs from the water and refresh in a bowl of cold water. Carefully peel off the shells, then slice each egg in half and scoop out the runny yolks into a large bowl. ", "Finely chop the egg whites and add to the bowl with the egg yolks. Mix well until the whites are evenly coated in the yolk. Set aside. ", "For the salmon, pour the olive oil into a heavy-based pan and place over a very low heat, preferably with a heat diffuser underneath the pan. Heat the oil slowly until it registers 55C/130F on a cooking thermometer. ", "Gently lower the salmon into the oil and cook, keeping the temperature consistent by lowering or increasing the heat as necessary, for 8-10 minutes, or until the fish is cooked through. Remove the fish with a slotted spoon and pat dry with kitchen paper. ", "For the watercress, bring a pan of salted water to the boil, add the watercress  and blanch for 20 seconds, or until the leaves are just wilted but still bright green. Drain, then transfer to a food processor and blend to a fine purée. Pour into a warm bowl.", "Place the chopped duck eggs into a pan with the butter, cream, salt and freshly ground black pepper and gently warm through over a medium heat. ", "To serve, spoon the watercress purée into the base of four serving bowls and cover with the chopped duck eggs. Top with a portion of salmon fillet, garnish with the chervil sprigs and serve."]}, {"isVegetarian": true, "title": "Chopped salad with peanuts", "url": "www_bbc_co_uk_food_recipes_choppedsaladwithpean_86558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tomato, finely chopped", "4 tbsp finely chopped cucumber", "1 green chilli, finely chopped", "2 tbsp finely chopped onion", "handful coriander leaves and stalks, chopped ", "2 tbsp salted peanuts, roughly chopped", "1 heaped tbsp desiccated coconut", "¼ tsp grated ginger", "salt, to taste", "1 tsp vegetable oil", "¼ tsp mustard seeds", "few curry leaves", "1 tbsp lemon juice, or to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, mix together all the salad ingredients in a bowl.", "For the spices, heat the oil in a small pan and add the mustard seeds. Once they begin to splutter, add the curry leaves and remove from the heat. Add the lemon juice and stir.", "To serve, pour the spice mixture over the salad and stir to coat. Taste and adjust the seasoning if necessary."]}, {"isVegetarian": false, "title": "Chorizo-stuffed squid with sage, potatoes, peas, capers and aïoli", "url": "www_bbc_co_uk_food_recipes_chorizo-stuffed_squid_25587", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large free-range egg yolk ", "1 small tsp Dijon mustard ", "½ garlic clove, very finely chopped", "1 tsp white wine vinegar, plus extra to taste", "100ml/3½fl oz vegetable oil ", "100ml/3½fl oz extra virgin olive oil ", "salt and freshly ground pepper", "lemon juice, to taste ", "10 baby squid", "3 spicy parrilla cooking chorizos, peeled and chopped finely", "8 new potatoes, cut into quarters", "2 tbsp olive oil", "1 garlic clove, crushed", "25g/1oz unsalted butter", "7 sage leaves, roughly chopped", "25g/1oz fresh peas, podded", "12g/½oz miniature pickled capers", "½ lemon, zest only", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aïoli, place the yolk in a mixing bowl along with the mustard, garlic and vinegar. Begin whisking and slowly add the oils to emulsify with the yolk. As the oils incorporate into the yolk, you can speed up the process. ", "When all the oil has been added, season with salt and pepper and add some lemon juice and vinegar to taste. Set aside.", "For the chorizo-stuffed squid, pull the tentacles away from the body of each squid and reserve them. Check the centre of the tentacles for the hard beak, which can be discarded. Feel inside the body for the quill of each squid (it resembles a shard of plastic). Pull it out of the squid and discard. Rinse inside the body in cold water. Pull the ears (wing-like flaps) from the body. Pull the purplish skin from the ears and body to leave only the white meat.", "Discard the guts of the squid or, if desired, retain the ink sack to use in seafood pasta or risotto.", "Knead the chorizo in a bowl together using your hands to form a rough paste. Take a piece of chorizo and form it into a shape to fill the cavity of one of the squid.", "Fill each squid to about two-thirds full and press it down. Secure each squid tube with a cocktail stick and reserve until ready to cook.", "Cook the potatoes in a pan of salted water until tender and then drain well. Heat a non-stick frying pan over a medium heat, add a lug of olive oil, the crushed garlic and the potatoes and season well with salt and freshly ground black pepper. Cook over a moderate heat tossing occasionally to evenly crisp and caramelise the potatoes.", "Take another non-stick pan and place over a moderate heat. Season the squid pockets and tentacles with salt and pepper.  Add a lug of oil to the pan and add the squid. Cook for two minutes on one side and then turn over and cook for a further two minutes. ", "Add the butter and sage and, when foaming, spoon it over the squid to cook further and ensure the chorizo is cooked inside. The filling will feel firm to the touch when cooked.", "Add the peas, capers and zest and remove the pan from the heat. When the potatoes are ready, transfer to a plate lined with kitchen paper to drain.", "To serve, divide the potatoes between serving plates along with the squid, the buttery pan juices, peas, capers and zest. Serve with a dollop of aioli."]}, {"isVegetarian": false, "title": "Chorizo and butterbean stew with baked potatoes", "url": "www_bbc_co_uk_food_recipes_chorizo_and_butterbean_72682", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_and_butterbean_72682_16x9.jpg", "ingredients": ["4 baking potatoes (200g/7oz each)", "200g/7oz cooking chorizo, sliced", "2 x 390g tins chopped tomatoes with onion and garlic", "2 x 400g tins butterbeans, drained", "50g/1¾oz fresh basil leaves, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Prick the potatoes all over with a fork and microwave on a high heat for 5–6 minutes. Season well with salt. Bake for 10–15 minutes, or until tender. (If you don’t have a microwave, bake for 1 hour at 220C/200C Fan/Gas 7).", "Meanwhile, dry-fry the chorizo in a large saucepan over a medium heat for 4–5 minutes, or until lightly browned. Stir in the chopped tomatoes and beans and bring to a boil. Reduce the heat to medium and cook for 12–15 minutes until slightly thickened, stirring often. Season and stir in the basil.", "Serve the stew with the baked potatoes."]}, {"isVegetarian": false, "title": "Chorizo and lemongrass pastry puff scrolls", "url": "www_bbc_co_uk_food_recipes_chorizo_and_lemongrass_30901", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_and_lemongrass_30901_16x9.jpg", "ingredients": ["a little plain flour, for dusting", "340g/11¾oz pack puff pastry (not ready-rolled as it usually breaks up when you open it) ", "18 pieces pre-sliced chorizo (about 7cm/2¾in wide pieces)", "1 stick lemongrass", "freshly ground black pepper", "1 free-range egg, lightly beaten"], "serves": "Makes 32", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Line a large baking tray with baking parchment and set aside.", "Lightly dust a clean work surface with flour and roll the pastry out to a 25x35cm/10x14in rectangle.", "Arrange six chorizo slices in a slightly overlapping layer in a row down one long side. Repeat to make three rows and completely cover the pastry.", "Top and tail the lemongrass stick and then remove one or two outer layers. Slice the stick very thinly and then sprinkle this evenly over the chorizo. Season with a little twist of pepper.", "With the longest side facing you, roll up the pastry away from you, really tightly like a Swiss roll to be about 4cm/1½in thick. Carefully lift onto the baking tray and then pop it into the fridge to firm up for about 20 minutes. ", "Preheat the oven to 220C/425F/Gas 7 (fan 200C)", "Once the pastry is nice and firm, use a sharp knife to cut the roll into 32 slices about 1cm/½in thick each. Lay each one down on the baking tray, spaced apart, as you go. Brush the sides facing upwards with the beaten egg.", "Bake in the oven for about 15-20 minutes, or until the pastry has puffed up and turned golden-brown. Once baked, remove from the oven, leave to cool for a couple of minutes and then serve on a party platter."]}, {"isVegetarian": false, "title": "Chorizo and thyme fougasse", "url": "www_bbc_co_uk_food_recipes_chorizo_and_thyme_65587", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white bread flour, plus extra for dusting ", "2 tsp salt ", "1 sachet fast-action dried yeast ", "250–300ml/9–11fl oz water ", "4 sprigs of fresh thyme, leaves only ", "50g/2oz cooked chorizo, chopped finely ", "1 tbsp vegetable oil, for greaing ", "3 tbsp milk "], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and dust a large baking tray with flour. ", "Mix the flour, salt and yeast in a large bowl and mix until well combined. Make a well in the centre of the mixture and steadily pour in the water until the dough is loose and easy to knead, but not too sticky.", "Knead the dough for 10 minutes on a lightly floured work surface, or for 5 minutes in an electric mixer fitted with a dough hook. ", "Add the thyme and knead for a further 30 seconds, or until it is well combined. Put half the chorizo in the middle of the dough and then fold the edges around it to cover and knead it for a further minute. ", "Place the dough mixture on a dusted work surface. Shape it into a ball, making sure the top is taught and smooth. Using a rolling pin, roll it out into a rough oval shape. ", "Cut slashes in the loaf to look like a fern leaf with a knife or razor blade, and then open the slashes apart with floured hands. ", "Push the remaining chorizo into the top of the dough, then cover loosely with oiled cling film (you may need several pieces). Leave to rise in a warm place until the dough has doubled in size, approximately for one hour.", "Once risen, remove the clingfilm, brush the dough with milk and place in the hot oven. Spray the oven with water before closing - this will prevent a crust from forming too quickly and will help to ensure a good rise. Bake for 30–35 minutes, or until the bread is well-risen and golden brown. It will come off the tray once fully cooked too. ", "To serve, either keep the bread whole or cut into chunks to eat before or with a main meal."]}, {"isVegetarian": false, "title": "Chorizo and chickpea stew with chorizo-stuffed chicken", "url": "www_bbc_co_uk_food_recipes_chorizo_and_tomato_soup_10248", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz semi-cured chorizo, skinned, roughly chopped", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 red chilli, finely chopped", "1 tsp smoked paprika", "2 tomatoes, skinned, seeds removed, chopped", "200g/7oz tinned chopped tomatoes", "400g/14oz tinned chickpeas, drained", "110ml/4fl oz chicken stock", "300g/11oz baby spinach leaf", "½ lemon, juice only", "2 tbsp extra virgin olive oil", "3 tbsp coriander cress", "150g/5oz cured chorizo, cut into thick slices", "110g butter, softened", "dash lemon juice", "4 chicken breasts, boneless and skinless", "50g/2oz plain flour", "2 free-range eggs, lightly beaten", "110g/4oz dried breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan and fry the chorizo for 3-4 minutes, or until crisp.", "Add the onion, garlic and chilli and fry for 2-3 minutes, or until softened.", "Add the paprika and stir until well combined. Place the tomatoes, chickpeas and chicken stock into the pan and bring to the boil.", "Reduce the heat and simmer for 4-5 minutes. Add the spinach and fold it through the stew.", "Return the mixture to the heat and season with salt and freshly ground black pepper. Cook for another minute to wilt the spinach, then season with lemon juice.", "For the chorizo-stuffed chicken, heat a deep fat fryer to 170C/340F. (CAUTION: Do not leave hot fat unattended.)", "Place the chorizo and butter into a food processor and blend to a purée. Add a little touch of lemon juice and black pepper, then spoon into a piping bag. Make an incision in the side of the chicken breast and pipe some of the chorizo butter into the chicken.", "Press the incision shut then dust with the flour. Prepare a plate of egg and a plate of breadcrumbs. Dip the chicken first in the egg, then the breadcrumbs. Place into the fat fryer and cook for 8-9 minutes, or until golden-brown and cooked through.", "To serve, cut the chicken in half carefully. Place the stew into a bowl and top with the chicken. Finish with a drizzle of extra virgin olive oil and scattering of cress."]}, {"isVegetarian": false, "title": "Chorizo eggs with scallops and coriander salt", "url": "www_bbc_co_uk_food_recipes_chorizo_eggs_with_94719", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large scallops", "20 coriander seeds", "10g/½oz cinnamon stick", "200g/7oz sea salt", "175g/6oz butter, softened", "40g/1½oz yeast extract", "150g/5oz soft cooking chorizo, skin removed, meat diced", "4 free-range eggs", "1 tbsp sunflower oil", "4 thick slices malted grain bread", "1 x 20g/¾oz punnet coriander cress ", "freshly ground black pepper", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Prise open the scallop shells, pat the scallops dry with kitchen paper and leave in the fridge, uncovered, for 2-3 hours to dehydrate slightly. ", "Meanwhile, for the coriander salt, dry fry the coriander seeds and cinnamon stick in a frying pan over a medium heat for 30-40 seconds, or until toasted and fragrant.", "Transfer the toasted seeds to a spice grinder and blend to a coarse powder. Tip the powder into a bowl and mix in the sea salt. Set the coriander salt mixture aside.", "When the scallops have dried out in the fridge, preheat the grill to its highest setting. Remove the scallops from their shells and cut each in half to create two thinner scallops. Mix 160g/5½oz of the butter with the Marmite until smooth and well combined and set aside.", "Heat a frying pan over a medium heat, add the diced chorizo and fry for 4-5 minutes, or until golden-brown.", "Crack the eggs into the pan over the chorizo pieces and fry for 1-2 minutes, or until cooked to your liking. Remove the pan from the heat", "Meanwhile, heat a separate frying pan over a medium heat until hot. Add the sunflower oil and the remaining 15g/½oz of butter. When the butter has melted, add the scallops and cook for 15-20 seconds on the cut side, or until golden-brown.", " Remove the scallops from the pan and place them, cut-sides down, into a cold, ovenproof frying pan. Place the pan under the grill and grill the scallops for 30 seconds, or until just cooked through.", "To serve, toast the bread until crisp and golden-brown. Place one slice into each of four serving plates. Season the chorizo eggs with a little of the coriander salt and freshly ground black pepper. Place one on top of each slice of toast and garnish with the coriander cress. Squeeze the lemon juice over the scallops, season with a little more of the coriander salt, then brush them with the Marmite butter. Place one scallop on top of each portion of chorizo eggs."]}, {"isVegetarian": false, "title": "Chorizo guacamole", "url": "www_bbc_co_uk_food_recipes_chorizo_guacamole_64754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ripe avocado", "1 lime, juice only", "3 tbsp roughly chopped chives", "150g/5½oz cooked chorizo sausage, roughly chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Scoop the avocado flesh into a mixing bowl.", "Squeeze the lime juice over the avocado to prevent it from discolouring.", "Lightly crush the avocado with a fork.", "Skin and roughly chop the chorizo.", "Roughly chop the chives and then fold everything together with the avocado and serve. "]}, {"isVegetarian": false, "title": "Chorizo tapas", "url": "www_bbc_co_uk_food_recipes_chorizo_tapas_72587", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_tapas_72587_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 banana shallot, sliced", "1 garlic clove, finely chopped", "300g/1oz chorizo, cut diagonally into 2.5cm/1in chunks", "2 fresh bay leaves", "200ml/7fl oz red wine", "2 tbsp olive oil", "2 garlic cloves, sliced", "300g/11oz chorizo, cut diagonally into ½cm/¼in thick slices", "pinch sea salt", "8 medium-sized prawns, shell on", "50ml/2fl oz dry sherry", "2-3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chorizo in red wine, heat a frying pan until medium hot, add the olive oil, shallot and garlic and fry for 2-3 minutes, or until softened.", "Add the chorizo to the pan and fry for 1-2 minutes, or until crisp and the oil is released.  ", "Add the bay leaves and red wine, and cook until the volume of wine has reduced to just coat the chorizo.  ", "For the prawns with chorizo, heat a frying pan until medium hot, add the olive oil and garlic and fry for 1-2 minutes. Add the chorizo and fry for a further 1-2 minutes.", "Add the sea salt and prawns and cook for 2-3 minutes, or until the prawns are just pink. ", "Add the dry sherry and deglaze the pan.  ", "Tip into a serving dish and sprinkle over the parsley."]}, {"isVegetarian": false, "title": "Chorizo and bean quesadilla", "url": "www_bbc_co_uk_food_recipes_chorizoandbeanquesad_76375", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizoandbeanquesad_76375_16x9.jpg", "ingredients": ["85g/3oz cheddar, grated", "55g/2oz chorizo, chopped", "85g/2oz mixed beans, mashed slighly with a fork", "handful fresh coriander, chopped, plus extra to garnish", "salt and freshly ground black pepper ", "2 Mexican tortilla wraps", "2 tbsp olive oil", "½ garlic clove, peeled and chopped", "2 tomatoes, chopped", "6cm/3in piece of cucumber, chopped"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the cheese, chorizo, beans, coriander and salt and freshly ground black pepper in a bowl.", "Spread the mixture onto one of the tortillas and top with the other.", "Heat a little oil in a frying pan and pan-fry the quesadilla for 2-3 minutes on each side.", "Meanwhile, for the salad, mix all the ingredients together in a bowl and season with salt and pepper. Garnish with more fresh coriander.", "To serve, transfer the quesadilla to a plate and serve the salad alongside."]}, {"isVegetarian": false, "title": "Chorizo and brandy chicken", "url": "www_bbc_co_uk_food_recipes_chorizoandbrandychic_86376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 chicken, jointed (you can ask your butcher to do this or buy chicken portions if you prefer)", "570ml/1 pint hot chicken stock", "1 onion, peeled and quartered", "2 cloves", "1 large carrot, halved ", "1 celery stick, halved", "2 bay leaves", "few sprigs fresh thyme", "1 tsp smoked paprika", "4 garlic cloves, skin on, slightly bruised using a rolling pin", "1 tbsp plain flour", "1 tbsp unsalted butter", "4 tbsp brandy", "110g/4oz cured chorizo sausage, finely chopped", "salt and freshly ground black pepper ", "110g/4oz Manchego cheese, grated (use parmesan instead if not available)", "4 jacket potatoes, baked", "225g/8oz green beans, cooked"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat the oil in a pan over a medium heat and cook the chicken portions, turning frequently, for about 5-6 minutes, or until browned on all sides.", "Meanwhile, bring the stock to the boil in a large saucepan. Stud one of the onion quarters with the two cloves and add to the pan along with the remaining onion quarters, the chicken, carrot, celery, bay leaves, thyme, paprika and garlic. Simmer very gently, uncovered, for 30-45 minutes, or until the chicken just starts to fall apart. Remove the chicken from the pan and place into a roasting tin. Strain the stock through a sieve into a bowl.", "Preheat the oven to 180C/350F/Gas 4.", "For the sauce, return the strained stock to the pan, bring to the boil and simmer until the liquid has reduced by half.", "In a bowl, for the sauce, mash the flour and butter together to make a paste (this, in chef terms, is a beurre manié). Whisk this paste into the stock along with the brandy and simmer for 3-4 minutes, until thickened and smooth. Add the chorizo and season, to taste, with salt and freshly ground black pepper.", "Pour this sauce over the chicken in the roasting tin and sprinkle over the grated cheese. Transfer to the oven and bake for 10-15 minutes, or until the cheese is bubbling and lightly browned.", "To serve, place portions of the chicken onto four serving plates and serve with the jacket potatoes and green beans."]}, {"isVegetarian": false, "title": "Chorizo and potato hash with poached egg", "url": "www_bbc_co_uk_food_recipes_chorizoandpotatohash_86059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz chorizo, sliced", "85g/3oz new potatoes, cooked and sliced", "1 spring onion, chopped", "salt and freshly ground black pepper", "1 free-range egg, poached, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan and fry the chorizo for 2-3 minutes, stirring frequently.", "Add the sliced cooked potatoes and the spring onion and cook gently, stirring occasionally, for five minutes.", "Slightly crush the potatoes with a fork and mix well to combine the ingredients. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the chorizo and potato hash onto a serving plate and top with a poached egg."]}, {"isVegetarian": false, "title": "Chorizo, artichoke and tomato pizzette", "url": "www_bbc_co_uk_food_recipes_chorizoartichokeandt_91279", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint 1½fl oz water, at room temperature", "2 x 7g/¼oz sachets fast-action dried yeast", "1 tbsp caster sugar", "1 tbsp extra virgin olive oil", "1kg/2lb 3¼oz type '00' flour, plus extra for dusting", "½-1 tsp salt", "handful black olives, pits removed, finely chopped", "2 tbsp olive oil", "1 chorizo sausage, finely chopped", "10 plum tomatoes, chopped", "3 garlic cloves, crushed to a paste with the edge of a knife", "small bunch basil leaves, finely chopped", "1 tsp caster sugar", "¼ tsp salt", "freshly ground black pepper", "freshly made tomato sauce (see above)", "200g/7¼oz jalapeno peppers, chopped", "200g/7¼oz artichoke hearts, chopped", "200g/7¼oz Roquefort cheese, or similar strong blue cheese, crumbled into large pieces", "2 tbsp chopped fresh oregano", "rocket salad, to serve"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7. ", "For the pizzetta bases, in a jug, mix together the water, yeast, sugar and olive oil until well combined (this is the starter). ", "Sift the flour and salt into a large bowl. Make a well in the centre, then pour the starter mixture into the well and add the chopped olives. Stir until the mixture comes together as a dough and is well combined. ", "Turn out the dough mixture onto a lightly floured work surface and knead for 3-4 minutes until smooth. ", "Divide the dough into 20 equal portions and roll into balls (each portion should be about the size of a tennis ball). Place the dough balls onto a baking tray and cover with a damp cloth, then set aside in a warm place for 18-20 minutes, or until the balls have doubled in size. ", "On a lightly floured work surface, flatten each ball of dough with your hands to form pizzetta bases that are 2.5cm/1in thick and 5cm/2in in diameter. Set aside.", "For the tomato sauce, heat the oil in a pan over a medium heat. Add the chopped chorizo and fry for 3-4 minutes, or until the chorizo is fragrant and crisp. ", "Add the tomatoes and garlic, stir well and bring the mixture to a simmer. Continue to simmer over a medium heat for 25-30 minutes, or until the tomatoes have broken down. Add the basil leaves and sugar. Season, to taste, with salt and freshly ground black pepper.", "For the topping, spread half a tablespoon of the tomato sauce all over each of the pizzetta bases. Sprinkle over the topping ingredients. ", "Transfer the pizzette to a hot oven and bake for 8-10 minutes, or until the bases are crisp and golden-brown, the cheese has melted and the topping ingredients have softened and coloured.", "To serve, slice the pizzette and place a handful of rocket salad alongside."]}, {"isVegetarian": false, "title": "Chorizo, chicken and chickpea casserole", "url": "www_bbc_co_uk_food_recipes_chorizochickenandchi_87895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizochickenandchi_87895_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "500g/1lb 2oz chicken thighs", "1 onion, sliced", "1 garlic clove, sliced ", "2 carrots, chopped", "1 celery stalk, chopped", "1 red chilli, deseeded and chopped", "splash red wine", "275g/9½oz chorizo, chopped", "100ml/3½fl oz dry sherry", "1 x 400g/14oz can chopped tomatoes", "200ml/7fl oz chicken stock", "1 x 400g/14oz can chickpeas, rinsed and drained ", "salt and freshly ground black pepper", "handful chopped fresh parsley", "crusty bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the vegetable oil in a large pan. Add the chicken thighs and fry, turning frequently, until lightly browned all over. Remove from the pan and keep warm. ", "Add a little more oil to the pan, then add the onion, garlic, carrots, celery and chilli and cook for five minutes. Add a splash of red wine and simmer until reduced by half. ", "In another pan, heat the remaining oil and fry the chorizo for 2-3 minutes. Add the sherry and cook until the chorizo is crisp. Set aside.", "Add the can of chopped tomatoes to the pan with the vegetables and bring to the boil. Cook for five minutes, then add the stock and bring back to the boil.", "Add the browned chicken, the chickpeas and crisp chorizo and simmer for 20-25 minutes, or until the chicken is completely cooked through. Season, to taste, with salt and freshly ground black pepper.", "Sprinkle with chopped parsley and serve with crusty bread."]}]