[{"isVegetarian": true, "title": "Tomato tagliatelle", "url": "www_bbc_co_uk_food_recipes_tomatotagliatelle_90689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed to a paste in a mortar and pestle", "1 vine tomato, seeds removed and chopped", "2 tbsp white wine vinegar", "1 tsp caster sugar", "100g/3½oz dried tagliatelle, cooked according to packet instructions, drained", "2 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan and gently fry the onion and garlic for 2-3 minutes, or until softened. Stir in the chopped tomato, vinegar and sugar and cook for a further 3-4 minutes, or until the sugar has dissolved. ", "Using a stick blender, process the sauce until smooth, then stir in the cooked tagliatelle and heat through. ", "Transfer the pasta onto a serving plate and garnish with the chopped chives."]}, {"isVegetarian": false, "title": "Tom kha soup", "url": "www_bbc_co_uk_food_recipes_tomkhasoup_93592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in piece galangal or ginger, peeled, roughly chopped ", "2 garlic cloves, peeled", "1 stalk lemongrass, bruised", "small bunch fresh coriander, leaves chopped, roots reserved", "1-2 shallots, peeled, quartered ", "1 medium green chilli, seeds removed, roughly chopped", "3 fresh or 6 dried kaffir lime leaves ", "2 limes, zest only", "1 tbsp olive oil ", "1 litre/1¾ pint boiling water", "1 chicken or vegetable stock cube ", "400ml/14fl oz coconut milk ", "3 tbsp fish sauce ", "8 tiger or king prawns, shelled, de-veined", "handful enoki mushrooms ", "handful shimeji mushrooms", "4 shiitake mushrooms, chopped", "handful sugar snap peas ", "100g/3½oz soba noodles", "1-2 limes, juice only, plus more to serve  ", "salt and freshly ground black pepper", "small handful thai basil leaves", "small handful shiso cress", "1 green chilli, sliced"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the paste, blend the paste ingredients in a food processor until smooth. ", "For the soup, heat the olive oil in a large saucepan and fry the paste over a medium heat for 2-3 minutes.", "Stir in the coconut milk and fish sauce.", "Pour in the boiling water, and crumble in the stock cube. ", "Add the prawns, and allow them to cook in the broth for 3-4 minutes, or until the prawns have turned pink and opaque.", "Add the mushrooms and sugar snap peas, and continue to cook for a further 2-3 minutes.", "Cook the soba noodles in a large pan of boiling water following pack instructions, then drain.", "To serve, add the lime juice to the soup and season, to taste, with salt and freshly ground black pepper.", "Divide the drained noodles between four bowls, and ladle over the soup. Garnish with thai basil leaves, shiso cress, the coriander leaves, and sliced chilli.", "Squeeze over a little more lime juice to taste."]}, {"isVegetarian": false, "title": "Tom's fried chicken in a basket", "url": "www_bbc_co_uk_food_recipes_toms_fried_chicken_in_a_83178", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toms_fried_chicken_in_a_83178_16x9.jpg", "ingredients": ["9 chicken pieces of your choice (such as thighs, drumsticks or breast on the bone)", "500ml/18fl oz buttermilk", "100g/3½oz plain flour", "50g/1¾oz cornflour", "2 tsp ground dried oregano", "2 tsp chilli powder", "2 tsp ground dried sage", "2 tsp dried basil", "2 tsp dried marjoram", "2 tsp ground white pepper ", "4 tsp table salt", "2 tbsp sweet paprika", "2 tbsp smoked paprika", "2 tsp onion salt", "2 tsp garlic powder", "oil, for shallow frying", "coleslaw, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Place the chicken pieces in a container, cover with the buttermilk and refrigerate for 12 hours.", "Preheat the oven to 180C/375F/Gas 4.", "Mix together the flours with the dried spices and herbs on a large plate. Remove the chicken from the buttermilk and shake off as much of the buttermilk as possible. Roll the chicken pieces around in the dry mix until coated.", "Heat a large frying pan over a medium-low heat and add a glug of oil. Fry 2-3 pieces of chicken at a time (do not crowd the pan) until golden-brown all over and cooked through. When cooked, drain the chicken on kitchen paper and then transfer to a roasting tin.", "Put the chicken pieces in the oven until the coating is crunchy rather than crisp (up to 15 minutes).", "Serve in a basket with some coleslaw."]}, {"isVegetarian": false, "title": "Turkey roll with Christmas crumble topping and sage and onion stuffing", "url": "www_bbc_co_uk_food_recipes_toms_turkey_roll_with_44115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toms_turkey_roll_with_44115_16x9.jpg", "ingredients": ["100g/3½oz pork scratchings ", "100g/3½oz sourdough bread, broken into pieces and baked until crisp", "100g/3½oz shelled pistachios, roughly chopped", "50g/1¾oz dried cranberries, roughly chopped", "2 tbsp fresh thyme leaves", "1 orange, zest only", "800g/1lb 12oz sausage meat", "400g/14oz onion, finely chopped and fried until translucent, cooled", "100g/3½oz cooked and peeled chestnuts, finely chopped", "160g/5½oz fresh breadcrumbs", "1 bunch fresh sage, chopped", "2 tsp salt", "3 tsp cracked black pepper", "100g/3½oz dried cranberries", "1 tbsp juniper berries, crushed", "20 rashers smoked streaky bacon (approximately 250-300g/9-10½oz)", "2-2.2kg/4lb 8oz-5lb boneless and skinless turkey breast ", "140g/5oz brown sauce", "bread sauce, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the crumble topping, crush the pork scratchings and the sourdough pieces in a bowl. Add the pistachios, cranberries and thyme. Mix with your hands and set aside in a covered container.", "For the stuffing, mix together all the ingredients apart from the bacon.  Mix to combine. ", "Trim any bits of fat or membrane from the turkey. With a sharp knife, open out the turkey breast as if you are butterflying it. Place the turkey between two sheets of cling film and flatten it out a little with a rolling pin. ", "Cut two large pieces of aluminium foil and lay the turkey breast on top. Season with salt and pepper. Spread a generous dollop the stuffing mix in a 5mm/¼in layer onto the turkey breast and then use the foil to help you roll it up like a Swiss roll. Completely encase the turkey in the two layers of foil and secure with cook's string at regular intervals along the length of the roll. Place in the fridge until needed.", "Preheat the oven to 120C/250F/Gas ½. ", "Add 400ml/14fl oz boiling water to a deep roasting tin. Place a wire rack in the tin and place the rolled turkey breast on top. Cover the roasting tin with aluminium foil. ", "Roast in the oven for 1½-2 hours, then check the core temperature with a meat thermometer. You are looking for a temperature of 70C/160F. If it is not ready, place back into the oven and continue to cook until it reaches 70C/160F. Once cooked, remove from the oven, cover with aluminium foil and set aside to rest for 40 minutes. When cool enough to handle, remove the string and foil.", "For the stuffing, preheat the oven to 170C/325F/Gas 3 and line a terrine mould or flameproof bowl with the streaky bacon, leaving some excess hanging over the sides. Pack the mould with the remaining stuffing mix and wrap the bacon over the top.", "Bake in the oven for 45 minutes, or until the middle has reached 70C/160F on a meat thermometer. When cooked, remove from the oven and set aside to rest for 20 minutes. ", "After 20 minutes, turn out the stuffing and pat dry. Heat the grill to hot, then grill the stuffing until the bacon is crisp.", "When rested, remove the turkey from the roasting tin and brush a thick layer of brown sauce over the top. Cover with the Christmas crumble mix, top with a little orange zest and serve straight away with the stuffing."]}, {"isVegetarian": false, "title": "Tom yum soup", "url": "www_bbc_co_uk_food_recipes_tomyumsoup_85069", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomyumsoup_85069_16x9.jpg", "ingredients": ["1 litre/2 pints chicken stock", "300ml/11fl oz water", "6 sticks lemongrass, lightly crushed", "4 fresh coriander roots, crushed", "110g/4oz fresh galangal, peeled and sliced (available from Asian supermarkets)", "8 tomatoes, cut into quarters, seeds removed", "6 kaffir lime leaves", "1-2 limes, juice only", "75ml/3fl oz tamarind water (tamarind is available from Asian supermarkets. Soak the tamarind in hot water and push the pulp through a sieve to make tamarind water.)", "3 red chillies, thinly sliced", "75ml/3fl oz fish sauce (nam pla), or to taste", "75g/3oz palm sugar (available from Asian supermarkets), use brown sugar if unavailable", "12 raw tiger prawns, shelled, gutted and split in half", "2 boneless skinless chicken breasts, cut into chunks", "1 small bunch fresh coriander, leaves", "1 small bunch fresh Thai basil, leaves (available from Asian supermarkets)", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the stock and water into a large pan over a high heat and bring to the boil.", "Add the lemongrass, coriander roots, galangal, tomatoes, lime leaves, lime juice, tamarind water and red chillies. Return to the boil, then reduce the heat and simmer for 15-20 minutes.", "Taste the stock and add as much fish sauce and palm sugar as necessary to keep the salty-sour-hot-sweet taste, then remove from the heat.", "Transfer 220ml/8fl oz of the stock into a separate pan over a high heat and bring to the boil. Add the chicken and cook for 1-2 minutes, then add the prawns and cook for a further 1-2 minutes, or until completely cooked through.", "To serve, pour the soup into two bowls and top up with the hot stock. Garnish with Thai basil, coriander and a wedge of lime."]}, {"isVegetarian": false, "title": "Tom yum soup with lime and white fish", "url": "www_bbc_co_uk_food_recipes_tomyumsoupwithlimean_74618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1½pints water or light chicken stock ", "6 small sticks of lemongrass", "12 lime leaves, torn in half (optional)", "1 long red chilli, sliced ", "20g/1oz fresh root ginger, thinly sliced ", "2 tbsp fish sauce ", "20g/1oz palm sugar or light demerara ", "200g/7oz white fish, such as cod, skin and bone removed ", "6 plump scallops ", "50mls/1¾fl oz vegetable oil  ", "handful of picked coriander leaves ", "handful of basil leaves", "2 limes, halved"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the water or stock into a pan and add the lemon grass, torn lime leaves, chilli, ginger, fish sauce and sugar.", "Bring to the boil, then reduce the heat to very low and leave to infuse for 10 minutes. ", "Cut the white fish into 1cm square cubes and drop into the broth. ", "Quickly heat a griddle or frying pan and rub the scallops with a little oil. ", "Carefully place scallops in the pan, and don't touch for three minutes, until you can see the scallops colouring around the edges.", "Turn them over and cook for a further three minutes. ", "Distribute the coriander and basil among six little bowls. Squeeze a little lime juice over the top and pour in the soup. ", "Place a scallop in each bowl and garnish with a stick of lemongrass."]}, {"isVegetarian": false, "title": "Tonkatsu pork", "url": "www_bbc_co_uk_food_recipes_tonkatsu_pork_20288", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tonkatsu_pork_20288_16x9.jpg", "ingredients": ["125g/4½oz tomato ketchup (you can get Japanese ketchup, but any brand will do)", "75ml/2½fl oz sake ", "2 tbsp Worcestershire sauce (Japanese is available if you can get it) ", "2 tbsp dark soy sauce", "1 garlic clove, finely grated ", "1 tsp finely grated fresh root ginger ", "1 tsp Japanese mustard or Dijon (Japanese mustard tastes like a mixture of Dijon and English mustard)", "2 tsp mirin (or more to taste)", "1 tbsp sugar ", "4 tbsp plain flour", "2 free-range eggs, beaten ", "75g/2½oz Japanese panko breadcrumbs", "pinch of salt and pepper", "4 thick pork loin steaks ", "vegetable or groundnut oil, for frying", "½ Chinese cabbage, shredded", "spring onions, finely sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, mix all the ingredients together in a small saucepan. Bring to a gentle simmer and cook for five minutes, or until the garlic and ginger are soft. You want the sauce to reach a good pouring consistency.", "Strain the sauce through a fine sieve into a small bowl. It will be served at room temperature (so do not place in the fridge). Set to one side until ready to use  ", "For the pork, place the flour, beaten egg and breadcrumbs in three individual dishes. Season the flour well with salt and pepper. ", "Coat each steak by first dipping into the flour, then the egg and finally the breadcrumbs. Re-dip each steak into the egg and breadcrumbs again - this creates an extra crisp coating. ", "Heat up a non-stick frying pan and pour the oil in for frying.", "Shallow fry the cutlets on a medium heat until golden-brown on both sides and cooked all the way through - be careful when turning the cutlets to avoid splashing the hot fat.", "Serve the pork with the tonkatsu sauce and raw the finely shredded Chinese cabbage and sliced spring onions."]}, {"isVegetarian": false, "title": "Seafood ramen", "url": "www_bbc_co_uk_food_recipes_tonkotsu_seafood_ramen_87628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2g bonito flakes", "75ml/2½fl oz sake", "7g sea salt", "500ml/18fl oz soy sauce", "½ bulb garlic, peeled and roughly chopped", "20g/¾oz fresh root ginger, peeled and roughly chopped", "⅓ red chilli, roughly chopped", "2 bunches spring onions, roughly chopped", "6 free-range eggs", "1 cluster (about 300g/10½oz) fresh root ginger, peeled and roughly chopped", "1 bulb garlic, peeled and roughly chopped", "1 bunch spring onions, roughly chopped", "1 large onion, roughly chopped", "1 small whole free-range chicken ", "20g/¾oz konbu", "20g/¾oz bonito flakes", "75g/2½oz sea salt ", "4 tbsp sake", "1 tbsp mirin", "2 tbsp rice vinegar", "1 tbsp soy sauce", "500g/1lb 2oz fresh ramen noodles", "1 whole squid, body only, prepared and cleaned ", "12 whole king prawns, peeled, tails left on, shells reserved, butterflied ", "vegetable oil, for frying", "12 clams, cleaned ", "1 spring onion, sliced", "10g/⅓oz sesame seeds", "salt and pepper"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the soy base and seasoned eggs, in a large stock pot bring 1 litre/1¾ pints water to the boil. Add the bonito flakes and cook for 10 minutes. Remove the bonito flakes using a sieve.", "Add the rest of the ingredients, except the eggs, to the bonito stock. Bring to the boil then set aside to cool.", "Boil the eggs in a saucepan of boiling water for 6 minutes 20 seconds. When cooked, run the eggs under cold water until cool enough to handle. Remove the shells and add the eggs to the stock to marinate overnight.", "For the chicken stock, put all vegetables in a large stock pot with the chicken and 4 litres/7 pints water. Bring to boil then reduce the heat and simmer for 2 hours. Throughout cooking skim off any impurities and fat which rise to the surface, reserving the fat for the garnish. This should produce a clear chicken stock.", "For the salt base, bring 300ml/10fl oz water and the konbu to the boil then simmer for 10 minutes. Remove the konbu and discard. Add bonito flakes and simmer for 10 minutes then remove the flakes using a sieve and discard. Add the remaining ingredients. When the sea salt has dissolved, turn off heat and set aside to cool. (You will make more salt base than you need.)", "For the garnish, season the squid and prawns with salt and pepper. Heat a little vegetable oil in a frying pan and cook the squid for 1-2 minutes. ", "Steam the prawns in a bamboo steamer for 4 minutes. ", "Heat two litres of the chicken stock in a saucepan. Once boiling, add the clams and prawn shells. Discard any clams that do not open. After 2-3 minutes strain the stock through a rough sieve. Retain the clams and discard the prawn shells.", "Use a fine sieve lined with muslin to filter the stock back into a clean saucepan. Bring back to the boil.", "Bring a large pan of water to boil and cook the fresh noodles for 34 seconds and drain.", "To serve, put a tablespoon of the salt base into each bowl. Add 350ml/12fl oz of the chicken stock to each bowl. Add the cooked noodles, squid, prawns, clams, a seasoned egg, halved and some slices of spring onion. Drizzle with a little chicken fat and finish with a sprinkling of sesame seeds."]}, {"isVegetarian": false, "title": "Torbay sole, spiced red wine sauce, chanterelle mushrooms and creamed potato", "url": "www_bbc_co_uk_food_recipes_torbaysolespicedredw_90444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large King Edward potatoes, peeled and cut into chunks", "salt and freshly ground black pepper ", "150ml/5fl oz double cream", "2½ tbsp unsalted butter ", "2 x 180g/6½oz fillets Torbay sole (also known as witch sole), skinned", "salt and freshly ground black pepper ", "2½ tbsp unsalted butter ", "150g/5oz chanterelle mushrooms", "2 handfuls large leaf spinach", "75g/3oz butter", "2 shallots, finely sliced", "4 black peppercorns, lightly crushed", "1 tsp Chinese five spice powder", "1 tbsp sherry vinegar", "150m/5fl oz red wine", "225ml/8fl oz fish stock", "½ bay leaf", "1 sprig fresh thyme", "½ lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the creamed potato, place the potatoes into a saucepan and cover with water. Add a pinch of salt, bring to the boil, reduce the heat and simmer for 10-12 minutes until tender.", "Drain and return to the pan. Place the pan over the heat to remove any excess moisture.", "Pass the potatoes through a potato ricer until smooth (or use a potato masher, though you will not get such a smooth result) and return the mash to the pan.", "Add the cream and butter and beat well. Season, to taste, with salt and freshly ground black pepper and set aside, keeping the mash warm.", "For the fish and spinach, season the sole fillets with salt and freshly ground black pepper. ", "Heat a frying pan until hot, add half of the butter and the sole fillets. Fry for two minutes, then turn the fish and add the mushrooms and the remaining butter to the pan. Cook for a further 2-3 minutes, or until the mushrooms are golden-brown.", "Remove the fillets from the pan and pat dry briefly on a piece of kitchen towel. Set the mushrooms aside.", "Meanwhile, heat a separate frying pan until hot, add the remaining butter and the spinach and cook until just wilted. Set aside, keeping it warm.", "For the sauce, heat a frying pan until hot, add one-third of the butter and all of the shallots. Cook for 1-2 minutes or until the shallots have softened, but not browned.", "Add the peppercorns and Chinese five spice powder to the shallots and cook for a further minute.", "Add the sherry vinegar and stir until it has absorbed into the shallots. Add the red wine, fish stock, bay leaf and thyme, bring to the boil, then reduce the heat and simmer until the mixture has reduced in volume by two-thirds.", "Strain the sauce through a fine sieve into a clean saucepan and whisk in the remaining butter and the lemon juice. Season with salt and freshly ground black pepper, to taste.", "To serve, spoon the creamed potato onto the centre of each of two serving plates and pile the spinach alongside. Lay the fish fillets on top, scatter over the mushrooms and spoon around the sauce."]}, {"isVegetarian": false, "title": "Toridashi (Pork and chicken stock)", "url": "www_bbc_co_uk_food_recipes_toridashi_pork_and_55893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz chicken wings", "1.5kg/3lb 5oz pork bones (rib bones are good for this)", "10g piece dried kombu ", "2 thick slices fresh root ginger", "250ml/9fl oz sake", "1 medium onion, cut in half", "30g/1oz bonito flakes (katsuobushi)", "6 dried shiitake mushrooms"], "serves": "Makes 2.5 litres/4½ pints", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Place the chicken wings and pork bones in a roasting tin and into the preheated oven.", "Roast for 30-40 minutes, turning them half way through until golden-brown. Alternatively you can fry the bones until browned if you don’t have an oven. ", "When cooked, strain the wings and bones in a colander or large sieve and then pour a kettle of boiling water over them to remove excess grease.", "While the chicken is in the oven, rinse the dried kombu under cold running water. Soak the kombu in a large stock pot for 30 minutes in 2.5 litres/4½ pints cold water. The kombu will triple in size.", "Remove the kombu from the water and cut into three long strips. Return to the stockpot and bring up to a simmer. Remove from the heat and discard the kombu - do not boil the kombu in the water for a long time or the dashi will become bitter.", "Add the roasted and rinsed wings and bones along with all the remaining ingredients to the kombu water. Bring up to the boil, reduce the heat, put a lid on and simmer for two hours. Do not let the stock boil as it will become cloudy.", "After two hours, strain the stock carefully through some clean muslin or a jay cloth. Leave to drain gently for 10 minutes, cool and refrigerate until required."]}, {"isVegetarian": false, "title": "Shredded satay chicken", "url": "www_bbc_co_uk_food_recipes_tornsataychicken_80142", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range skinless chicken breasts", "70g/2½oz rice noodles", "3 garlic cloves, crushed", "1 small handful fresh coriander, torn into small pieces", "2 tbsp peanut butter", "3 tbsp light soy sauce", "2 tbsp clear honey", "1 tsp chilli oil", "1 tbsp balsamic vinegar", "1 cucumber, peeled and cut into thin strips"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the chicken under the grill and cook the chicken for 7-8 minutes on each side, turning once, until golden and cooked through. Remove from the grill once cooked and leave to cool slightly.", "Place the noodles into a large heatproof bowl and pour boiling water over to cover. Leave to cook for five minutes then drain and allow to cool.", "Place the warm chicken breast onto a sturdy flat surface and beat with a rolling pin and then shred to pieces.", "Place the garlic, coriander, peanut butter, soy sauce, honey, chilli oil and vinegar into a food processor and blend until smooth.", "To serve, place the noodles on plate, top with the cucumber strips followed by the shredded chicken breast. Drizzle lightly with the peanut sauce."]}, {"isVegetarian": true, "title": "Soft chocolate nougat (torrone molle)", "url": "www_bbc_co_uk_food_recipes_torrone_molle_soft_62924", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torrone_molle_soft_62924_16x9.jpg", "ingredients": ["125g/4½oz almonds, blanched", "200g/7oz unsalted butter, softened", "200g/7oz granulated sugar", "100g/3½oz best-quality unsweetened cocoa powder", "1 large free-range egg, preferably organic", "the yolk of 1 large free-range organic egg", "100g/3½oz digestive biscuits", "3 tbsp orange-flavoured liqueur", "candied flowers or sugared almonds or whipped cream, to decorate"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Spread the almonds on a baking tray and bake for 7-10 minutes, or until they turn golden-brown. Grind them coarsely in a food processor, being careful to stop when they resemble grains of rice.", "Cream together the butter and sugar in a bowl until light and fluffy.", "Sieve the cocoa and add it to the butter and sugar. Beat hard to incorporate. ", "Lightly beat together the whole egg and the egg yolk and then add the eggs to the mixture. Stir well until everything is well blended together.", "Crush the biscuits with a rolling pin, add to the mixture together with the ground almonds and the orange-flavoured liqueur. Mix thoroughly.", "Line a 20x10cm/8inx4in loaf tin with cling film and spoon the mixture into it pressing down all the time to eliminate any air bubbles and, when it is all in, bang the tin hard on the work surface. Cover with cling film and chill for at least four hours.", "Get an oval dish, turn the tin upside down over it and peel off the cling film.", "Decorate with candied flowers or sugared almonds or whipped cream before serving."]}, {"isVegetarian": true, "title": "Honey and chestnut cake", "url": "www_bbc_co_uk_food_recipes_torta_di_serretto_00934", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_di_serretto_00934_16x9.jpg", "ingredients": ["225g/8oz butter, cubed, plus extra for greasing ", "250g/9oz honey, plus 1-2 tbsp to glaze ", "100g/3½oz light brown sugar", "3 large free-range eggs", "300g/10½oz Tipo 00 flour", "2 tsp baking powder", "1 tsp fennel seeds", "6 tbsp chopped cooked chestnuts (freshly roasted, tinned or vacuum-packed)", "4 tbsp pine nuts", "1 tsp flaky sea salt", "thick cream, to serve (optional)"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Butter and line a 20cm/8in or 23cm/9in springform cake tin. ", "Put the cubed butter in a saucepan with the honey and sugar and melt them together slowly, stirring occasionally.  Once dissolved, bring the mixture to a boil and simmer for one minute, turning the heat down as necessary to ensure the pan doesn't boil over. Set aside to cool for 20 minutes.", "Beat the eggs together in a jug, then stir them into the cooled honey mixture. Sift the flour and baking powder into a large mixing bowl and make a well in the centre.  ", "Pour the honey mixture into the flour and stir, gradually incorporating the flour. As soon as it is well combined, stir in the fennel seeds and four tablespoons of the chopped chestnuts.", "Pour the cake batter into the prepared tin. Combine the remaining chestnuts with the pine nuts and flaky sea salt in a small bowl and sprinkle them over the top of the cake. ", "Bake for 45-60 minutes, or until the cake has risen and a skewer inserted into the centre comes out clean.", "Leave the cake to cool in the tin for five minutes, then turn it out onto a wire rack. ", "Warm two tablespoons of honey in a small pan until runny, then brush it generously over the top of the cake. You can serve the cake warm with cream as a dessert, or leave it to cool completely, wrap in foil and store in an airtight tin, where it should keep for four days."]}, {"isVegetarian": true, "title": "Torta menjar blanc", "url": "www_bbc_co_uk_food_recipes_torta_menjar_blanc_99276", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_menjar_blanc_99276_16x9.jpg", "ingredients": ["350g/12oz plain flour", "150g/5½oz icing sugar", "175g/6oz butter, chilled and cut into cubes", "1 unwaxed lemon, finely grated zest only", "2 free-range eggs, beaten ", "salt", "1 litre/1¾ pint whole milk", "1 vanilla pod, split lengthways", "2 sticks cinnamon", "1 unwaxed lemon, finely grated zest only", "6 free-range egg yolks", "150g/5½oz caster sugar", "100g/3½oz cornflour", "egg white, for brushing", "icing sugar, to serve"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, by hand or using a stand mixer, mix the flour and icing sugar with a pinch of salt, then rub in the butter. Stir in the lemon zest, then mix in the eggs until you have a smooth dough – you might not need all of them. Form into two balls, one slightly larger than the other, and wrap in cling film. Chill for at least an hour, preferably overnight.", "Meanwhile, to make the filling, put the milk in a saucepan and add the vanilla pod, cinnamon sticks and lemon zest. Bring to the boil and leave to infuse until the milk has cooled to room temperature. ", "Whisk the egg yolks and caster sugar together in a heatproof bowl until increased in volume and mousse-like. Sieve in the cornflour and whisk until well combined. ", "Reheat the milk and strain into a jug, then rinse the saucepan. Pour the milk from a height in a steady stream over the egg and sugar mixture, whisking constantly. Pour the mixture into the saucepan. ", "Stir constantly over a medium heat for 5 minutes, or until the custard has thickened. Transfer to a jug or bowl and cover with cling film touching the custard to prevent it from forming a skin. Chill until you are ready to bake the tart. ", "Preheat the oven to 180C/Fan 160C/Gas 4.", "Roll out the larger piece of pastry and use it to line a 23cm/9in tart or shallow cake tin – preferably a loose-bottomed one. Trim. Pierce with a fork all over and chill in the fridge for half an hour. ", "Spread the custard over the base of the tart. Roll out the remaining piece of dough and use it to cover the tart. Dampen the edges with water and crimp together. ", "Brush the tart with egg white. Bake for 40 minutes. Leave to cool before chilling. Serve dusted with icing sugar."]}, {"isVegetarian": true, "title": "Torta nera (chocolate walnut tart)", "url": "www_bbc_co_uk_food_recipes_torta_nera_chocolate_02131", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/torta_nera_chocolate_02131_16x9.jpg", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "pinch of salt", "100g/3½oz butter, chilled, cut into small pieces", "50g/1¾oz caster sugar ", "2 free-range egg yolks", "230g/8oz walnuts, plus extra to decorate", "200g/7oz  caster sugar", "3 free-range eggs", "50g/1¾oz butter, melted", "65g/2¼oz amaretti biscuits, roughly crushed", "75g/2½oz dark chocolate, grated", "1 tbsp plain flour", "1 tbsp instant coffee powder, dissolved in a little hot water", "50ml/2fl oz almond liqueur", "icing sugar, to decorate", "mascarpone, to serve"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and butter a 23cm/9in deep, fluted, loose-bottomed tart tin.", "To make the pastry, put the flour and salt in a bowl and rub in the butter with your fingertips until the mixture resembles coarse breadcrumbs. Add the sugar and mix in the egg yolks. Bring the dough together without kneading and wrap in cling film. Put it in the fridge for 30 minutes.", "Roll out the pastry on a lightly floured surface and use it to line the prepared tart tin. Cover the pastry with greaseproof paper and fill with baking beans. Bake blind for 10–12 minutes. Remove the baking beans and greaseproof paper and return to the oven for 5–6 minutes, or until lightly golden. Leave to cool.", "Reduce the oven temperature to 180C/160C Fan/Gas 4.", "To make the filling, blend the walnuts with 100g/3½oz sugar in a food processor until finely ground.", "Whisk the eggs with the remaining sugar. Carefully stir in the melted butter, ground walnut mixture, amaretti biscuits, chocolate, flour, coffee and almond liqueur. Mix well.", "Spoon the filling into the tart case. Decorate with the whole walnuts and bake in the middle of the oven for 25 minutes.", "Serve warm with a sprinkling of icing sugar and a small scoop of mascarpone."]}, {"isVegetarian": true, "title": "Torta di mele e mandorle (mini apple and almond pie)", "url": "www_bbc_co_uk_food_recipes_tortadimeleemandorle_71747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.4kg/3lb cooking apples, peeled, cored and roughly sliced", "100g/3½oz soft brown sugar", "3 eggs", "200g/7oz caster sugar", "200g/7oz butter, softened", "200g/7oz ground almonds", "sliced almonds for decoration"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.", "Put the apples and brown sugar in a large pan and cook over a low heat until soft.", "In a large bowl beat the eggs with the caster sugar then mix in the butter and ground almonds to create a smooth paste.", "Divide the cooked apples between six ramekins and spread the almond mixture on top.", "Sprinkle some sliced almonds on top of each and and cook for about 50 minutes until golden brown.", "Serve hot with cream or ice cream."]}, {"isVegetarian": true, "title": "Torta pasquale", "url": "www_bbc_co_uk_food_recipes_tortapasquale_88435", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortapasquale_88435_16x9.jpg", "ingredients": ["25g/1oz butter, for greasing", "2 tbsp plain flour, for dusting", "5 free-range eggs, plus 1 free-range egg, beaten, for brushing", "200g/7oz spinach", "110g/4oz dandelion leaves or rocket", "2 tbsp extra-virgin olive oil", "1 onion, finely chopped", "500g/1lb 2oz ricotta cheese", "50g/2oz parmesan, or similar vegetarian hard cheese, grated", "110g/4oz provolone cheese, or similar vegetarian alternative, cut into small cubes", "salt and freshly ground black pepper", "500g/1lb 2oz ready-made puff pastry", "300g/10½oz fresh or frozen broad beans (shelled weight)    ", "5 small celery sticks, finely chopped into matchsticks 3cm/1in long ", "large handful rocket  ", "12 mint leaves, roughly torn  ", "4 tbsp extra virgin olive oil, plus extra for drizzling", "1 small lemon, juice only", "110g/4oz pecorino cheese, or similar vegetarian alternative, shaved"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease a 28cm/11in round, deep pie dish with butter, then dust with flour.", "For the torta, place five of the eggs into a pan of boiling water and boil for ten minutes. Drain and place the eggs into cold water and leave to cool. Once cool, remove the shells and cut the eggs in half lengthways.", "Wash the spinach and dandelion leaves and shake to remove the excess water.", "Heat a large pan with a lid until hot, then add the spinach and dandelion leaves and cover. Cook for 4-5 minutes, until steamed and wilted down. Drain the spinach and dandelion mixture, and, once cool enough to handle, squeeze out any excess liquid. Roughly chop the spinach and dandelion mixture and place into a bowl.", "Heat a frying pan over a medium heat and add the olive oil and onion. Fry the onion gently for a few minutes until softened, then set aside and allow to cool.", "Add the cooked onion to the spinach and dandelion and mix well.", "Add the ricotta and parmesan and mix well.", "Add the provolone, season, to taste, with salt and freshly ground black pepper and mix well.", "Roll out about half of the puff pastry to 0.5cm/¼in thick and use to line the prepared pie dish.", "Fill the pie case with half of the spinach and cheese mixture.", "Add the boiled egg halves, yolks down, evenly spaced, then top with the remaining spinach mixture.", "Brush the edge of the pastry with a little beaten egg.", "Roll out the remaining puff pastry to the same thickness as the first sheet, and place over the pie filling, pressing down the edges well. Trim away any excess pastry and crimp the edges with your fingers, so that the pie is well sealed.", "Make a small incision the shape of a cross into the centre of the pastry top to allow steam to escape during baking. ", "Brush the top of the pastry with beaten egg, then transfer to the oven to bake for 35-40 minutes, or until risen and golden-brown all over. Remove from the oven and allow to cool.", "For the salad, boil the broad beans for one minute, then drain and refresh in cold water.", "In a large clean bowl, place the celery, rocket and mint. Add the cooled broad beans and mix well.", "Place the olive oil and lemon juice into a small clean bowl and whisk until it starts to thicken. Pour the dressing over the salad and mix well.", "To serve, place a slice of the torta onto each plate and spoon some of the salad alongside. Drizzle everything with a little extra virgin olive oil and top with shavings of pecorino cheese."]}, {"isVegetarian": false, "title": "Tortelli(less) di zucca", "url": "www_bbc_co_uk_food_recipes_tortelliless_di_zucca_63852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz olive oil", "13 garlic cloves, chopped ", "pinch dried chilli flakes ", "1 litre/1¾ pint tomato passata", "2 tsp fine sea salt ", "70g/2½oz mustard fruits, syrup reserved (available online and in some Italian delis)", "1 large pumpkin, preferably Ironbark, cut into 3cm/1¼in wedges", "olive oil", "3 shallots, finely chopped", "1 small red chilli, finely chopped", "2 garlic cloves, finely chopped", "250g/9oz cavolo nero, washed and roughly chopped", "2 unwaxed lemons, finely grated zest only", "120g/4¼oz Parmesan or Grana Padano Cheese, thinly sliced", "30 large sage leaves ", "12 amaretti biscuits "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat a large saucepan and add the oil. Once hot, add the garlic and fry until golden-brown. Then add the chill, tomato passata and sea salt. Cook gently for 4-5 hours. ", "For the mustard fruit purée, place the mustard fruits and 30g/1oz of the reserved syrup in a blender and blend until smooth.", "For the pumpkin, preheat the oven 160C/140C Fan/Gas 3.", "Rub the pumpkin wedges with 4 tablespoons olive oil, season with sea salt and place onto a non-stick baking tray. Cook for approximately 20 minutes. Test with a small knife at the thicker end of the pumpkin to feel it is cooked. There should be no resistance from the pumpkin. Leave to cool and then gently peel off the skin, which can be discarded.", "Heat a large lidded pan and add some olive oil. Once hot, add the shallots, chilli and garlic and cook until soft, then add the cavolo nero. Add 4 tablespoons water to the pan, a good pinch of sea salt and cover. Cook over a medium heat, stirring regularly, for approximately 20-25 minutes or until the cavolo nero is completely soft to the bite. Drain away any excess water and leave in the pan, covered.", "Reheat the pumpkin in the oven until hot. Remove and spread a thin layer of the puréed mustard fruits on the top of the pumpkin wedges followed by the lemon zest and sliced Parmesan to cover the whole surface. Place back in the oven to soften and slightly melt the cheese. ", "Heat a small saucepan and add enough oil to cover the base of the pan. Once hot, add the sage leaves and cook until crisp. Remove from the pan using a slotted spoon and drain on kitchen paper.", "Reheat the cavolo nero and the tomato sauce. Place the cavolo nero on the plates first then dab tomato sauce on and around it. Place the pumpkin on top. Crush two amaretti biscuits over the pumpkin and finish with the deep fried sage leaves."]}, {"isVegetarian": true, "title": "Tortellini with spinach and ricotta", "url": "www_bbc_co_uk_food_recipes_tortelliniwithspinac_82375", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortelliniwithspinac_82375_16x9.jpg", "ingredients": ["400g/14oz '00' flour, plus extra for dusting", "3 medium free-range eggs", "semolina, for dusting (optional)", "200g/7oz spinach, cooked in salted water and chopped", "200g/7oz ricotta", "30g/1oz grated parmesan", "large pinch freshly grated nutmeg", "salt and freshly ground black pepper", "small handful of pine nuts ", "handful sage leaves", "50g/2oz butter", "parmesan, grated or in shavings"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, pour the flour into a mound onto a flat surface and make a well in the centre. Crack the eggs into the well and gradually mix with either a blunt knife or your hands. When the dough has become a thick paste use your hands to incorporate more of the flour. ", "You can sieve any remaining flour and use the sifted flour while you knead the dough to stop it sticking to the surface and to your hands, but be careful not to make the dough too dry. Knead until well blended and the dough is soft and flexible. Don't worry if you haven't used up all the flour.", "Leave the pasta to rest for about 20 minutes with a bowl inverted over it or leave it covered in cling film. You can sieve any leftover flour again and save this flour for rolling out the pasta.", "Meanwhile, for the filling, in a clean bowl, mix the spinach, ricotta, parmesan and nutmeg well, and season with salt and freshly ground black pepper.", "Divide the fresh pasta into four and keep three portions under a bowl while you roll and stuff one quarter. This prevents the pasta from drying out. Roll out the pasta into a long, wide strip about 1mm in thickness, either by hand or using a machine. When you can see your hand through it, it is ready for stuffing. Cut the strip in half.", "Place teaspoons of the filling in a line down the centre of one of the strips about 5cm/2in apart. Place the other strip directly on top. Press the air out from around the filling by pushing down the pasta around them sealing them in. Now take a small wine glass or round cutter measuring about 7cm/3in across and cut out circles of pasta around each mound of filling.", "They can be cooked straight away or stored in fine semolina for up to two hours. You can also freeze them at this stage and then cook them from frozen when you are ready.", "To cook, bring a large pan of salted water to the boil and gently lower in the tortellini. Cook for about four minutes or until the pasta is soft but not floppy. ", "While the pasta is cooking make the sauce. Preheat the grill to hot.", "Toast the pine nuts under the grill or in a dry frying pan. They are quick to brown so don't take your eyes off them.", "Put the pine nuts, sage leaves and butter into a frying pan and melt the butter taking care not to burn it. Add about a tablespoon of the pasta water and stir together to emulsify the sauce. Remove from the heat. ", "When the pasta is done, drain it and toss with the sauce in the frying pan. Serve immediately sprinkled with parmesan."]}, {"isVegetarian": true, "title": "Tortiglioni with mushrooms and cheese", "url": "www_bbc_co_uk_food_recipes_tortiglioniwithmushr_70040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz dried ceps", "6 tbsp olive oil", "200g/7oz button mushrooms, finely sliced", "200g/7oz ricotta cheese, crumbled", "100g/4oz coarsely grated Fontina", "50g/2oz finely grated Pecorino cheese", "3 eggs, lightly beaten", "salt", "freshly ground black pepper", "375g/13oz dried tortiglioni"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the ceps in warm water for 20 minutes. Drain them, retaining the strained soaking water. Squeeze the ceps dry and finely chop them.", "Heat the oil and gently fry the button mushrooms. Add the ceps with 2-3 tbsp soaking water and cook for about 5 minutes. Remove from the heat and gently stir in the ricotta, Fontina and Pecorino cheeses, and the beaten eggs. (The eggs should not be cooked so that they remain liquid at this stage). Taste and add salt if necessary and pepper.", "Meanwhile cook the pasta for 6-7 minutes or until al dente, and drain. Return the pasta to the empty pan, and mix well with the sauce, so that the egg just starts to thicken with the heat of the pasta."]}, {"isVegetarian": true, "title": "Spanish-style tortilla", "url": "www_bbc_co_uk_food_recipes_tortilla_11230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortilla_11230_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp olive oil", "2 large onions, finely sliced", "750g/1½lb Pink Fir Apple potatoes, peeled, parboiled and sliced into 1cm/½in pieces", "250g/8oz handful fresh spinach, cooked and roughly chopped", "10 free-range eggs, lightly beaten", "salt and freshly ground pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large, heavy-based frying pan, heat the butter and oil. Cook the onions slowly until transparent and soft.", "Add the potato slices and fry gently for two minutes.", "Stir in the spinach.", "Season the eggs with salt and freshly ground black pepper and pour onto the contents of the frying pan.", "Cook over a low to medium heat: it may take up to ten minutes until the egg is set enough to turn the tortilla over, and if the heat is too high, the bottom will burn before the middle is set.", "Once the bottom is nicely browned and the centre has set, it is time to turn it over. This is done with a  double flip: place a plate (or the bottom of a tart tin) over the pan and flip it over once, so that the cooked surface of the tortilla is on the bottom. Take another plate, and flip it again so the cooked surface is on the top. Then place the frying pan back over the tortilla plate and flip one more time, so the uncooked bit is now in contact with the base of the pan.", "Replace the pan over low heat until the tortilla is cooked through.", "Serve hot, warm or cold, cut into slices or cubes."]}, {"isVegetarian": true, "title": "Tortilla", "url": "www_bbc_co_uk_food_recipes_tortilla_28732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely chopped", "1 red or orange pepper, deseeded and cut into rings", "50g/1¾oz mushrooms, finely sliced", "400g/14oz potatoes", "50g/1¾oz frozen peas", "4 large free-range eggs", "1 tsp grain mustard (optional)", "black pepper (optional)", "30g/1oz low-fat mature Cheddar cheese", "crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the onion, pepper and mushrooms into a microwave-safe dish, cover with a lid or cling film, leaving a small area open, and cook on full power for four minutes.", "Meanwhile, peel the potatoes (or just scrub them if the skins are good) and slice.", "Take the dish out of the microwave, remove the vegetables and put to one side in a small bowl.", "Put the potatoes in the microwave-safe dish, cover with a lid or cling film, leaving a small area open, and cook on full power for six minutes. Allow to stand for two minutes, then check that the slices are soft. If they are not, cook on full power for another minute.", "Put the peas into a colander and pour some boiling water over them to soften them, then drain.", "Crack the eggs in a bowl, whisk well with the mustard and black pepper (if using) until frothy. ", "Mix the potatoes, vegetable mixture and peas together gently in the microwave-safe dish and pour over the eggs.", "Grate the cheese and sprinkle it into the dish over the egg.", "Cook on full power for two minutes, then remove the dish and stir the outside parts of the mixture into the centre and flatten with a spoon.", "Cook for another two minutes and repeat as in step 9.", "Cook for another two minutes and remove the dish from the microwave, cover with cling film and allow to stand for two minutes to finish cooking. If the egg is still a bit runny, cook for another minute on full power.", "Cut into wedges and serve with a tomato salad and crusty bread."]}, {"isVegetarian": false, "title": "Tortilla towers", "url": "www_bbc_co_uk_food_recipes_tortilla_towers_65545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortilla_towers_65545_16x9.jpg", "ingredients": ["2 tsp celery salt", "1 tbsp dried oregano", "1 tsp dried chilli flakes", "1 tsp garlic salt", "2 tsp ground cumin", "1 tsp smoked paprika", "2 limes, zest and juice only", "6 chicken thighs, skin removed", "6 tomatoes, halved", "1 large red onion, cut into wedges", "2 fat red or green chillies", "1 dried chipotle chilli", "4 garlic cloves, peeled", "1 small bunch coriander", "2 limes, juice only", "salt and pepper", "3 ripe avocados", "3 tbsp soured cream", "½ lime, zest and juice", "½ lemon, zest and juice  ", "1 tbsp olive oil", "salt and pepper", "12-18 corn tortillas or flour tortillas (3 per person)", "soured cream, to taste", "200g/7oz Monterey Jack or strong cheddar cheese, grated", "1 bunch spring onions, finely chopped", "1 bunch coriander, finely chopped"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the spicy shredded chicken, preheat the oven to 180C/350F/Gas 4.", "Add all the dry ingredients and the lime zest to a plastic food bag. Shake the bag so that all the spices are mixed together.", "Pat dry the chicken thighs using kitchen paper and then squeeze the lime juice over the chicken flesh. One by one place the chicken thighs into the bag and coat in the spice mix. The lime is for flavour, but also helps the spices mix stick. ", "Leave the chicken to marinate for about an hour. Remove the chicken from the bag, place the coated thighs in a roasting dish and cook for 35 minutes, or until cooked through.", "Meanwhile make the roasted tomato salsa. Preheat the grill to high. Place the tomatoes, red onion wedges, chillies and garlic onto a baking tray. Lightly brush with oil.", "Place under the hot grill and cook until the tomato skins are blackened, approximately 10 minutes. ", "Place all the charred ingredients into a food processor with the chipotle chilli, coriander and lime juice. Pulse until a chunky consistency is achieved. Season to taste with salt and freshly ground black pepper. Set aside until ready to serve.", "For the guacamole, cut the avocadoes in half and remove the stone. Remove the flesh from the skin and roughly chop.  ", "Place in a bowl and lightly crush using a fork. Add the soured cream, lemon and lime juice and zest. Season to taste with salt and freshly ground black pepper and finish with a drizzle of olive oil. Set aside until ready to serve.", "For the spicy shredded chicken, once the chicken is cooked set aside to cool. When cool enough to handle, remove the meat from the bone and shred.", "To construct the tortilla towers, place a dollop of guacamole in the centre of each plate and place a tortilla on top. ", "Add a layer of guacamole, then chicken, salsa, soured cream and cheese. Add another tortilla and repeat again. Finish with sprig of coriander and a sprinkle of spring onions. "]}, {"isVegetarian": true, "title": "Tortilla chips with dips", "url": "www_bbc_co_uk_food_recipes_tortillachipswithdip_76376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "2 flour tortillas, cut into triangles", "55g/2oz mixed beans from tin", "2 garlic cloves, peeled and roughly chopped", "3-4 tbsp olive oil", "salt and freshly ground black pepper", "¼ tin tomatoes, chopped ", "2 tbsp tomato sauce", "pinch chilli powder", "Greek-style yoghurt", "Handful fresh coriander, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a pan one third filled with vegetable oil for deep-frying, until a crumb will sizzle gently in it. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Deep-fry the tortilla triangles for 30 seconds to one minute, or until golden, and then carefully remove and drain on kitchen paper.", "For the bean dip, blend the beans, garlic, olive oil and seasoning in a food processor until smooth. Transfer to a dish.", "For the tomato dip, blend the tinned tomato, tomato sauce and chilli powder in a food processor until smooth. Transfer to a dish.", "Serve the tortilla chips alongside the dips and serve each with the yoghurt sprinkled with fresh coriander."]}, {"isVegetarian": true, "title": "Tortilla chips with spicy yoghurt dip and corn salsa", "url": "www_bbc_co_uk_food_recipes_tortillachipswithspi_88038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "4 flour tortillas, cut into triangles", "sea salt, for sprinkling", "2 tsp chopped chipotle chillies ", "200ml/7fl oz Greek-style yoghurt", "squeeze lime juice", "¼ red pepper, finely chopped", "pinch Cajun spice seasoning", "salt and freshly ground black pepper", "dash olive oil", "1 corn-on-the-cob, kernels only", "¼ onion, finely chopped", "1 garlic clove, finely chopped", "¼ red pepper, finely chopped", "¼ yellow pepper, finely chopped", "¼ green pepper, finely chopped", "1 tsp chopped chipotle chillies ", "pinch Cajun spice seasoning", "salt and freshly ground black pepper", "2 tbsp chopped fresh coriander"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the tortilla chips, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the tortilla triangles into the hot oil and deep fry for 3-4 minutes, or until turning golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Scatter with sea salt.", "For the spicy yoghurt dip, place all the dip ingredients into a mini blender and blend to a coarse purée. Spoon into a small serving bowl.", "For the corn salsa, heat the olive oil in a medium frying pan, add the corn kernels and fry for 2-3 minutes. Add the chopped onion and fry for two minutes. Add the garlic and fry for one minute.", "Add the finely chopped peppers and fry for two minutes. Add the chipotle chillies, Cajun spice, salt and freshly ground black pepper and stir well over a gentle heat for one minute. Stir in the chopped coriander.", "To serve, spoon the salsa onto a serving plate. Place the small bowl of yoghurt dip in the middle of the serving plate and then place the crisp tortillas around the edge. Serve while the tortillas are still warm."]}, {"isVegetarian": true, "title": "Spanish omelette", "url": "www_bbc_co_uk_food_recipes_tortillaspanishomele_67957", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortillaspanishomele_67957_16x9.jpg", "ingredients": ["1 medium onion, about 4 oz (110 g) ", "275g/10oz small Desirée potatoes", "3 tablespoons olive oil ", "5 large eggs ", "salt and freshly milled black pepper"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["First some points to note. The size of the frying pan is important: a base measurement of 20cm/8in diameter is about right for two to three people. If using a larger pan for more people, it should not be too heavy because you need to turn the omelette out using both hands. Use a non-stick pan if you don't have a well-seasoned frying pan. An enormous asset here is a flat saucepan lid or large plate that fits the pan.", "First of all, peel and cut the onion in half, then thinly slice each half and separate the layers into half-moon shapes. Now thinly pare the potatoes using a potato peeler and slice them into thin rounds - you have to work pretty quickly here because you don't want the slices to brown. When they are sliced, rub them in a clean tea cloth to get them as dry as possible.", "Next, heat 2 tablespoons of the olive oil in the frying pan and, when it's smoking hot, add the potatoes and onions. Toss them around in the oil to get a good coating, then turn the heat right down to its lowest setting, add a generous sprinkling of salt and pepper, put a lid on the frying pan and let the onions and potatoes cook gently for 20 minutes, or until tender. Turn them over halfway through and shake the pan from time to time, as they are not supposed to brown very much but just gently stew in the oil.", "Meanwhile, break the eggs into a large bowl and, using a fork, whisk them lightly - it's important not to overbeat them. Finally, add some seasoning. When the onions and potatoes are cooked, quickly transfer them to the eggs in the bowl.", "Put the frying pan back on the heat, add the rest of the oil and turn the heat back up to medium. Then mix the potato and eggs thoroughly before pouring the whole lot into the frying pan and turning the heat down to its lowest setting immediately. Now forget all about French omelettes and be patient, because it's going to take 20-25 minutes to cook slowly, uncovered. ", "Every now and then draw the edge in gently with a palette knife, as this will give it a lovely rounded edge. When there is virtually no liquid egg left on the surface of the omelette, turn it over to cook the other side. To do this, place a flat lid or plate over the pan, carefully invert both so that the omelette is on the lid or plate. Put the pan back on the heat and use the palette knife to gently ease the omelette back in. Give it about 2 minutes more, then turn the heat off and leave it for a further 5 minutes to settle. It should then be cooked through but still moist in the centre. Serve hot or cold, cut in wedges, with a salad and a glass of Rioja - it's brilliant."]}, {"isVegetarian": false, "title": "Toscano T-bone steaks with charred shallots and thyme", "url": "www_bbc_co_uk_food_recipes_toscano_t-bone_steaks_81056", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz Swiss chard", "50ml/2fl oz vegetable oil", "12 banana shallots, peeled", "115g/4oz butter", "2 bay leaves", "sprig thyme", "sea salt", "2 x 680g/1lb 8oz T-bone steaks, thickly cut", "freshly ground black pepper", "250ml/9fl oz beef or veal stock", "60g/2¼oz anchovies, chopped", "2 tbsp capers", "1 lemon, juice only"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Strip the leaves from the chard, wash and set to one side. Trim the stalks of any blemishes and cut into sticks about 5cm/2in long and 2cm/¾in wide. Bring a pan of salted water to the boil, throw in the chard stalks and return to the boil. Drain, plunge the stalks into iced water then drain again and set aside.", "Heat the oil in a frying pan, add the shallots and colour them over a high heat. When they are coloured, drain off and discard the oil. Add 50g/1¾oz of the butter, the bay leaves, thyme and salt to the pan and cook for five minutes, shaking the pan from time to time, taking care not to burn the butter.", "Add enough stock to just cover the bottom of the pan and allow the liquid to reduce before adding more stock to the pan. Continue with the remaining stock until the shallots are very soft and have a thick buttery and beefy glaze.", "Meanwhile, heat a griddle plate or ovenproof griddle pan and season the beef well. Score the fat a little and place the steaks fat side down on the griddle. The fat will start to melt and flavour the outside of the meat.", "Once the fat is melting and starting to char, leave the meat to cook for four minutes. Turn over and cook for another four minutes. Turn again to cook on its narrower side for two minutes, holding in place with tongs, turn once more to cook the other narrower side for two minutes then take it off the heat and transfer it to the oven for about six minutes for a medium steak. Let it rest for five minutes before serving.", "While the steak is in the oven, heat a frying pan over a high heat and melt the remaining butter. Add the blanched chard stalks, cook for three minutes then add the chard leaves, stirring until they wilt. Season with sea salt and freshly ground black pepper, add the anchovies, capers and lemon juice and cook for two more minutes.", "Using a slotted spoon, drain the chard and place on large warmed plates, reserving the sauce. Place the steaks on top of the chard, pour over the sauce and serve with the caramelised shallots."]}, {"isVegetarian": true, "title": "Totally tropical Eton mess", "url": "www_bbc_co_uk_food_recipes_totally_tropical_eton_10141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/totally_tropical_eton_10141_16x9.jpg", "ingredients": ["300ml/10fl oz double cream", "200ml/7fl oz Greek-style yoghurt", "4 shop-bought meringue nests", "1 ripe mango, skin and stone removed, flesh cut into 1cm/½in pieces", "3 passion fruits, halved", "4 fresh mint sprigs, to decorate (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Gently whip the cream in a large bowl until soft peaks form. ", "Fold the yoghurt through the cream, being careful not to over-mix. ", "Break the meringues into the bowl and gently stir to combine. It should be quite a stiff mixture. ", "Spoon a layer of the meringue mixture into the base of four serving glasses. Sprinkle over a handful of mango pieces and drizzle with passion fruit seeds. Repeat until all the meringue mixture and fruit is used up. ", "Decorate with mint sprigs, if using) and eat immediately. "]}, {"isVegetarian": false, "title": "Totally lazy mini sausage rolls", "url": "www_bbc_co_uk_food_recipes_totally_lazy_mini_98499", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/totally_lazy_mini_98499_16x9.jpg", "ingredients": ["500g/1lb 2oz ready-made puff pastry", "plain flour, for dusting", "1 free-range egg, beaten", "8 herby sausages (the best you can afford), cut in two", "salt and freshly ground black pepper", "small handful fresh thyme leaves"], "serves": "Makes 16 rolls", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out on a floured surface to a rectangle of about 48x32cm/19x12½in and bash the pastry with the rolling pin a bit. Puff pastry is made of fine layers and normally you have to be very delicate with it. For sausage rolls the pastry needs to be slightly puffed, but not too much, so bashing it with a rolling pin reduces the amount it puffs up.", "Cut the large rectangle in half lengthways, then cut both smaller rectangles into eight equal sections. You now have 16 rectangles in total. Brush one end of each rectangle with a little of the beaten egg, lay a piece of sausage at the other end, then season the sausage with salt and freshly ground black pepper and sprinkle with thyme leaves. Roll the sausage up in the pastry to enclose and repeat with all the sausages. Put the sausage rolls in the fridge for 20 minutes for the pastry to harden.", "Once the pastry is hard, remove the sausage rolls from the fridge and score the tops with a sharp knife for decoration, or prick with a fork. Brush well all over with the rest of the beaten egg and bake in the oven for 25–30 minutes, or until the pastry has turned golden-brown and looks crisp. Remove from the oven and leave to cool slightly before serving."]}, {"isVegetarian": false, "title": "Venison with raspberry and bitter chocolate sauce", "url": "www_bbc_co_uk_food_recipes_tournedos_of_venison_87389", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter ", "150g/5½oz carrots, cut into 7cm/2¾in batons", "4 garlic cloves, crushed ", "150g/5½oz bacon lardons", "25g/1oz duck fat ", "150g/5½oz celeriac, peeled and cut into 7cm/2¾in batons", "1 savoy cabbage, dark outer leaves removed, cored and cut into 5mm/¼in slices", "100ml/3½fl oz double cream ", "1 tsp vegetable oil ", "1 tsp finely chopped shallot ", "25ml/1fl oz raspberry vinegar ", "500ml/18fl oz red wine ", "150ml/¼ pint veal stock", "50g/1¾oz dark chocolate (70 per cent cocoa solids), broken into pieces ", "30g/1oz unsalted butter   ", "4 pieces venison loin (about 150g/5½oz each) ", "50g/1¾oz unsalted butter ", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cabbage, heat 25g/1oz of the butter in a medium saucepan over a medium heat. Add the carrots and some seasoning and sweat until tender, then add the garlic and cook for a few minutes, stirring constantly. ", "Transfer the carrots to a bowl using a slotted spoon, then add the bacon to the pan. Fry for about 5 minutes, until crisp, then place into the bowl with the carrots. Add the duck fat and celeriac to the same pan and cook the celeriac slowly, on a low heat, adding a drop of water if necessary to prevent it catching and burning. Cook for about 10 minutes, or until lightly browned and tender. Use the slotted spoon to transfer it to the bowl of carrots and bacon.", "Add another 25g/1oz of butter to the pan and when hot, add the cabbage, season and cover with a tight fitting lid. Cook the cabbage over a high heat, shaking the pan occasionally to prevent it catching. Cook until tender, then stir in the carrots, bacon and celeriac, along with the cream. Season with salt and pepper and set aside, keeping warm. ", "For the sauce, add the oil to a frying pan and sweat the shallots over a medium heat for 5 minutes or until soft. Add the vinegar and allow it to evaporate completely.  Add the wine and reduce it to about a quarter of its original volume (you should be left with 125ml/4 fl oz), then add the stock and chocolate. When the chocolate has melted, whisk in the butter. Cover and keep warm.  ", "For the venison, season the loins well with salt and pepper, then heat the butter in another frying pan over a medium heat and cook the venison pieces for 4-5 minutes on each side for rare. The cooking time will depend on the thickness of the meat, so cook it accordingly to your liking.  Remove from the pan and rest on a plate, covered with foil, for 7 minutes.  ", "To serve, slice each piece of venison and serve with the sauce and cabbage alongside. "]}, {"isVegetarian": false, "title": "Tower of buttered prawn rostis with mustard soured cream", "url": "www_bbc_co_uk_food_recipes_towerofbutteredprawn_87813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large potato, peeled and coarsely grated, juices squeezed out", "salt and freshly ground black pepper ", "2 tbsp olive oil", "knob of butter", "1 tbsp olive oil", "125g/4½oz raw peeled tiger prawns, thawed if frozen", "½ lime", "2 tsp chopped fresh dill", "salt and freshly ground black pepper ", "1 tbsp Greek-style yoghurt", "1 tbsp double cream", "1 tbsp wholegrain mustard", "1 tbsp clear honey", "½ lemon, finely grated zest only", "1 tbsp olive oil", "salt and freshly ground black pepper", "handful fresh herbs, such as dill, chives, flatleaf parsley and basil", "½ tsp balsamic vinegar", "1 tsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the röstis, heat a heavy-based frying pan.", "Place the grated potato into a bowl and season well with salt and freshly ground black pepper. Divide into four portions.", "Place the oil and butter into the heated frying pan, then add the potato patties. Cook for 3-4 minutes on each side, pressing them down firmly with a fish slice, until cooked through and golden-brown.", "Meanwhile, for the prawns, heat another frying pan. Add the olive oil and tip in the prawns. Fry over a medium heat for about a minute, until the prawns have turned pink and are cooked though.", "Squeeze over the lime juice and sprinkle over the dill. Season, to taste, with salt and freshly ground black pepper and stir well.", "For the mustard soured cream, place the yoghurt in a small bowl with the cream, mustard, honey, lemon zest and olive oil. Season, to taste, with salt and freshly ground black pepper and stir well.", "For the herb salad, place the herbs into a bowl and drizzle over the vinegar and oil. Season, to taste, with salt and freshly ground black pepper and stir to coat the leaves.", "To serve, place one of the potato röstis onto a warmed plate and spoon some of the prawns on top. Drizzle over a little of the mustard soured cream. Repeat these layers until all of the ingredients have been used up. Garnish with the dressed herb salad and serve at once."]}, {"isVegetarian": true, "title": "Traditional Christmas pudding with brandy butter", "url": "www_bbc_co_uk_food_recipes_traditional_christmas_38771", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_christmas_38771_16x9.jpg", "ingredients": ["450g/1lb dried mixed fruit (use a mixture of sultanas, raisins, and snipped apricots)", "1 small cooking apple, peeled, cored and roughly chopped ", "1 orange, finely grated rind and juice", "3 tbsp brandy, sherry, or rum, plus extra for flaming", "75g/3oz butter, softened, plus extra for greasing", "100g/3½oz light muscovado sugar", "2 free-range eggs", "100g/4oz self-raising flour", "1 tsp mixed spice", "40g/1½oz fresh white breadcrumbs", "40g/1½oz whole shelled almonds, roughly chopped", "100g/3½oz unsalted butter, softened", "225g/8oz icing sugar, sieved", "3 tbsp brandy, rum or cognac", "4 tbsp brandy or rum"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Measure the sultanas, raisins, apricots and apple into a bowl with the orange juice. Add the measured brandy (rum or sherry), stir and leave to marinate for about one hour. ", "Put the measured butter, sugar and grated orange rind into a large bowl and cream together with a wooden spoon or a hand-held whisk until light and fluffy. Gradually beat in the eggs, adding a little of the measured flour if the mixture starts to curdle. ", "Sift together the flour and mixed spice, then fold into the creamed mixture with the breadcrumbs and the nuts. Add the soaked dried fruits with their soaking liquid and stir well. ", "Generously butter a 1.4 litre/2½ pint pudding basin. Cut a small disc of foil or baking parchment and press into the base of the basin.", "Spoon into the prepared pudding basin and press the mixture down with the back of a spoon. Cover the pudding with a layer of baking parchment paper and foil, both pleated across the middle to allow for expansion. Tie securely with string and trim off excess paper and foil with scissors. ", "To steam, put the pudding in the top of a steamer filled with simmering water, cover with a lid and steam for eight hours, topping up the water as necessary. ", "To boil the pudding, put a metal jam jar lid, or metal pan lid, into the base of a large pan to act as a trivet. Place a long, doubled strip of foil in the pan, between the trivet and the pudding basin, ensuring the ends of the strip reach up and hang over the edges of the pan. This will help you to lift the heavy pudding basin out of the pan of hot water when it has finished cooking. ", "Lower the pudding onto the trivet and pour in enough boiling water to come half way up the side of the bowl. Cover with a lid, bring the water back to the boil, then simmer for about seven hours, until the pudding is a glorious deep brown colour, topping up the water as necessary. ", "For the brandy butter, place the butter into a mixing bowl and cream with a wooden spoon until light and fluffy – or for speed use an electric hand-held mixer. Beat in the sieved icing sugar until smooth, then add brandy, rum or cognac, to taste.  Spoon into a serving dish, cover and set aside in the fridge.", "When cooked through, remove the pudding from the pan and cool completely. Discard the paper and foil and replace with fresh. Store in a cool, dry place. ", "To serve, on Christmas Day, steam or boil the pudding for about two hours to reheat. Turn the pudding onto a serving plate. To flame, warm the brandy or rum in a small pan, pour it over the hot pudding and set light to it. Serve with brandy butter. "]}, {"isVegetarian": false, "title": "Lamb hotpot with cauliflower cheese", "url": "www_bbc_co_uk_food_recipes_traditional_lancashire_24992", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz lamb neck fillet, cut into 2.5cm/1in pieces", "sea salt and freshly ground black pepper", "1 tbsp vegetable oil", "75g/2¾oz butter", "6 lambs’ kidneys, trimmed, skinned and chopped", "2 large onions, thickly sliced", "2 sprigs fresh rosemary, leaves only, chopped", "3 garlic cloves, roughly chopped", "2 tbsp plain flour", "150ml/5fl oz red wine", "500ml/18fl oz beef stock", "2 tbsp Worcestershire sauce", "1 bay leaf", "2 sprigs fresh thyme", "1.5kg/3lb 5oz floury potatoes, peeled and cut into 5mm/ 1/4in thick slices", "50g/1¾oz unsalted butter, melted", "1 large cauliflower, cut into florets", "50g/1¾oz butter, plus extra for greasing", "50g/1¾oz plain flour", "450ml/16fl oz milk", "2 free-range egg yolks", "1 tsp English mustard", "200g/7oz Lincolnshire Poacher (or strong cheddar) cheese, grated"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Season the lamb with sea salt and pepper.", "Heat a large ovenproof casserole until hot, then add the oil and butter and sear the lamb until browned all over. You’ll need to do this in batches.", "Set the lamb aside, then briefly sear the lambs’ kidneys in the same pan. Add the onions and rosemary adding a little more butter to the pan if necessary, and cook for about 10 minutes until they turn brown at the edges.  ", "Stir in the flour and cook for a minute, add the red wine and reduce by half then add the stock and Worcestershire sauce. Whisk until the flour and liquid are smoothly blended. Season with sea salt and pepper and bring to simmering point. Return the lamb to the pan then add the bay leaf and thyme. ", "Arrange the potato slices on top of the meat, overlapping each other. Season the potatoes with sea salt and pepper then brush with a little melted butter.", "Cover with a tight fitting lid and bake for 1½ hours. Remove the lid and turn the oven up to 200C/180C Fan/Gas 6. Cook for a further 20-30 minutes until the potatoes are golden-brown and crisp.  ", "Meanwhile, for the cauliflower cheese, preheat the gill to high.", "Bring a large pan of salted water to the boil, then add the cauliflower florets and cook for 2 minutes. Drain and place the cauliflower in a buttered ovenproof dish.", "Place the butter and flour in a saucepan and heat to melt the butter. Cook, stirring for 1-2 minutes until lightly golden-brown. Remove the pan from the heat and gradually whisk in the milk to form a smooth sauce. Return the sauce to the heat and simmer for 2-3 minutes. Remove from the heat and beat in the egg yolks and mustard and half the cheese. Season with salt and pepper then pour over the cauliflower and top with the remaining cheese. Place under the grill and cook until golden-brown.", "Place spoonfuls of the hotpot and cauliflower cheese on warmed plates and serve."]}, {"isVegetarian": false, "title": "Traditional honey-glazed gammon", "url": "www_bbc_co_uk_food_recipes_traditional_honey-glazed_52289", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_honey-glazed_52289_16x9.jpg", "ingredients": ["2-4kg/4lb 8oz-9lb unsmoked boneless gammon joint, tied", "2 onions, halved", "2 carrots, unpeeled, cut into 5cm/2in pieces", "2 celery stalks, cut into 5cm/2in pieces", "4 bay leaves", "12 black peppercorns", "small handful cloves", "4 tbsp runny honey", "4 tbsp English mustard"], "serves": "Serves 10-20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gammon joint into a large lidded saucepan, cover with cold water and bring to the boil over a high heat.   Drain the water from the saucepan, add fresh cold water, add the onions, carrots, celery, bay leaves and peppercorns and bring to the boil once more.  Reduce the heat, cover with a lid and simmer the gammon and vegetables gently for 20 minutes per 500g/1lb 2oz.  (If your pan is not quite large enough to cover the joint completely, turn the gammon over halfway through the cooking time.) ", "Remove the gammon from the water and set aside to cool for fifteen minutes.  (The cooking liquid can be strained and reserved for making soup for another time.)", "Pre-heat the oven to 200C/400F/Gas 6 and line a large roasting tin with aluminium foil.", "Use a small knife to remove the rind from the gammon joint, leaving as much of the fat intact as possible.  Score the fat in a diamond pattern, and push a clove into the centre of each 'X'.", "Place the gammon into the foil-lined roasting tray, ensuring that the sides of the foil come half way up the joint to contain any roasting juices.", "For the glaze, mix the honey and mustard together and brush half of it evenly over the gammon, including one side of the joint.  Roast in the centre of the oven for ten minutes, then take the joint out and brush the top and remaining side with the rest of the glaze.  Return the gammon to the oven for a further 10-15 minutes, rotating the roasting tin so that the opposite side of the gammon faces the back of the oven.  ", "The gammon is ready when the fat on top is glossy and golden brown.  Cover loosely with foil if the top begins to look too brown. Remove the gammon from the oven and set aside to rest for 15 minutes before carving.", "Pour any juices that have collected in the aluminium foil into a small pan, and warm through gently.", "Carve the gammon, serve on a large platter and spoon over the warmed juices ."]}, {"isVegetarian": true, "title": "Traditional piccalilli", "url": "www_bbc_co_uk_food_recipes_traditional_piccalilli_48187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700ml/1¼pint malt vinegar ", "2 tbsp coriander seeds ", "pinch salt", "500g/1lb 2oz cauliflower, broken into 3cm/1¼in florets", "2 onions, chopped ", "3 tbsp English mustard powder ", "3 tbsp plain flour", "1 tbsp ground turmeric ", "2 tsp ground ginger ", "50ml/2fl oz cider vinegar ", "100g/3½oz French beans, trimmed and cut into 1cm/½in slices ", "2 garlic cloves, sliced ", "200g/7oz granulated sugar"], "serves": "Makes 3-4 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the malt vinegar, coriander seeds and a pinch of salt in a large preserving pan and bring to a boil. Add the cauliflower and onion and simmer for five minutes, or until slightly softened but still crunchy. ", "Meanwhile, put the mustard, flour, turmeric and ginger in a small bowl and gradually whisk in the cider vinegar until smooth. Set aside.", "Add the green beans, garlic and sugar to the pan and stir over the heat for 2–3 minutes, or until the sugar has dissolved. Drain over a large bowl to collect the vinegar.", "Put the mustard mixture and the vinegar back into the pan and bring to the boil. Reduce the heat and simmer for 10 minutes, or until thick enough to coat the back of the spoon, adding more salt to taste. ", "Return the drained vegetables to the pan and add more sugar and water if necessary and then take off the heat. ", "Spoon into hot sterilised jars, seal and cool. ", "Store for three months in a cool, dark place before eating."]}, {"isVegetarian": false, "title": "Traditional pie 'n' mash with parsley liquor", "url": "www_bbc_co_uk_food_recipes_traditional_pie_n_mash_76469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "2 cloves garlic, finely chopped", "450g/1lb minced beef steak or beef mince", "1 tsp English mustard", "1 tbsp tomato purée ", "1 beef stock cube", "vegetable oil", "150ml/5fl oz brown ale", "100ml/3½fl oz beef stock ", "2 tbsp plain flour", "salt and freshly ground black pepper", "350g/12oz self-raising flour, plus extra for dusting", "225g/8oz beef suet", "large knob of butter, softened, for greasing", "450g/1lb ready-made shortcrust pastry, for the top of the pie", "1 free-range egg yolk, lightly beaten", "2 large potatoes (preferably Rooster or Nadine), peeled, cut into chunks", "100ml/3½fl oz hot milk", "knob of butter", "drizzle chilli oil (optional)", "50g/2oz butter", "50g/2oz cornflour ", "500ml/18fl oz chicken stock ", "generous bunch parsley, leaves only, chopped", "1-2 garlic cloves, roasted and puréed, to taste", "jellied eels"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, heat the olive oil in a large frying pan over a medium heat and fry the onion and garlic for five minutes or until softened. Add the mince and cook for five minutes, stirring occasionally, or until browned and cooked through. ", "Stir in the rest of the filling ingredients, season with salt and freshly ground black pepper and set aside to cool.", "Preheat the oven to 180C/350F/Gas 4.", "For the suet pastry, sift the flour into a mixing bowl with the suet and season with salt and freshly ground black pepper. Gradually mix in about four tablespoons of cold water, or until you have a moist but firm dough. ", "On a lightly floured work surface roll the dough out to a 2mm thickness.", "Generously butter two individual pie dishes then line each with the suet pastry, so that it covers the base and sides completely. Divide the filling mixture between the two dishes.", "For the pie crust, roll out the shortcrust pastry on a lightly floured work surface to a 2mm thickness and use it to cover the two pies, pushing down the edges to seal. Brush generously with the egg yolk and make a hole in the middle of the lid to allow steam to escape.", "Place the pie dishes into a deep-sided roasting tin and pour in enough boiling water to come halfway up the sides of the pie dishes, taking care not to get any water on the pastry. Transfer to the oven and cook for 20-30 minutes, or until the pastry is crisp and golden and the filling steaming hot.", "Meanwhile, for the mashed potatoes, steam (or boil) the potatoes for 20 minutes or until tender. Scald the milk then mash the potatoes with the hot milk, butter and plenty of salt and freshly ground black pepper until smooth. Drizzle with a little chilli oil, if using, and keep warm.", "For the parsley liquor, melt the butter in a saucepan over a medium heat and whisk in the cornflour to make a paste. Gradually stir in the stock, bring to a simmer, then stir in the parsley and garlic and stir until thickened and smooth. ", "Serve the hot pies with the mash, parsley liquor and jellied eels on the side."]}, {"isVegetarian": true, "title": "Traditional rice pudding", "url": "www_bbc_co_uk_food_recipes_traditional_rice_pudding_34305", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7 litres/12½ pints whole milk", "1kg/2lb 4oz pudding rice", "500g/1lb 2oz caster sugar", "4 bay leaves ", "6 pinches freshly ground nutmeg", "3 tsp vanilla essence", "500g/1lb 2oz strawberry or raspberry jam, to serve"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/300F/Gas 2. ", "Stir all of the ingredients, except the jam, together in a large bowl. pour the mixture into the baking dishes.", "Cover the dishes with a lid or sheet of aluminium foil and cook in the oven for 1½ hours. Remove the lid or foil and cook for a further 20 minutes, or until the rice is tender and the top is lightly golden and has formed a skin. ", "Spoon the rice pudding into serving bowls and serve with spoonfuls of jam."]}, {"isVegetarian": false, "title": "Traditional rice pudding", "url": "www_bbc_co_uk_food_recipes_traditional_rice_pudding_76281", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz pudding rice", "600ml/20fl oz full-fat milk", "1 tbsp skimmed milk powder", "2 tbsp caster sugar", "1 thin strip lemon rind", "freshly grated nutmeg, to taste", "15g/½oz unsalted butter, cut into small cubes ", "jam, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat your oven to 150C/300F/Gas 2.", "Wash the rice and drain in a sieve, then put it into a wide ovenproof dish, at least 1 litre/1¾pint capacity. Pour in the milk. Add the milk powder, caster sugar and lemon rind and stir together. Grate some nutmeg over the top and dot with the butter.", "Place in the oven and bake for 2-2½ hours, or until the pudding has a golden-brown skin and the rice is tender and creamy (the longer you give it, the more thick and sticky it will become).", "Serve warm, with a blob of your favourite jam on top."]}, {"isVegetarian": false, "title": "Traditional roast partridge, with game crumbs, bread sauce, and roasted vegetables", "url": "www_bbc_co_uk_food_recipes_traditional_roast_36962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Chantenay carrots, peeled and left whole", "4 small parsnips, chopped", "1 small butternut squash, peeled, seeds removed and chopped", "4 tbsp olive oil", "salt and freshly ground black pepper", "2 whole partridge", "4 large leaves sage", "4 slices streaky bacon", "75g/2½oz butter", "200g/7oz fresh white bread crumbs", "2 tbsp medium dry sherry", "1 tbsp chopped fresh parsley", "1 large onion", "1 tbsp cloves", "1 bay leaf", "500ml/18fl oz whole milk", "8 black peppercorns", "75g/2½oz butter", "110g/4oz freshly-made white breadcrumbs", "2 tbsp double cream, optional", "small bunch watercress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the vegetables, preheat the oven to 200C/180C Fan/Gas 6.", "Place the vegetables into a large deep roasting tray. Drizzle with oil and season with salt and pepper. Mix to combine. Roast for an hour or until crispy on the outside and soft and in the middle.", "For the partridge, preheat the oven to 180C/160C Fan/Gas 4. Line a roasting tin with aluminium foil. ", "Lay the sage leaves on the breast of the partridge and lay a piece of bacon on top. Put in the prepared tin and roast for 15–20 minutes.", "For the game crumbs, heat the butter in a pan and once melted add the breadcrumbs and cook until toasted and golden-brown. Add the sherry. Cook until evaporated and finish with the fresh parsley. Set aside until ready to serve.", "For the bread sauce, stud the onion with the cloves and simmer in a small pan with the bay leaf, milk, peppercorns and butter for 15–20 minutes. Strain the liquid and return to the pan, add the breadcrumbs and season. Return to the heat and simmer for a further 10 minutes. Stir in the cream, if using, and keep warm until serving.", "To serve, cut the breasts off the partridges, or leave them whole, and serve with the vegetables, game crumbs and bread sauce. Garnish with fresh watercress."]}, {"isVegetarian": true, "title": "Traditional spring wedding cake", "url": "www_bbc_co_uk_food_recipes_traditional_spring_67057", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_spring_67057_16x9.jpg", "ingredients": ["1kg/2lb 4 oz white sugar paste icing", "500g/1lb 2oz yellow sugar paste icing", "edible glue", "550g/1lb 4oz butter", "225g/8oz soft brown sugar", "150g/5½oz caster sugar", "12 free-range eggs, lightly beaten", "475g/1lb 1oz plain flour", "475g/1lb 1oz ground almonds", "2 tbsp cocoa powder", "1 tsp ground nutmeg", "1 tsp mixed spice", "1 tsp salt", "2 oranges, zest only", "2 lemons, zest only", "2 tsp vanilla essence", "475g/1lb 1oz currants", "450g/1lb glacé cherries", "350g/12oz sultanas", "225g/8oz dried cranberries", "450g/1lb dried apricots, chopped", "225g/8oz blanched whole almonds, roughly chopped (optional)", "350ml/12fl oz brandy ", "225g/8oz currants", "200g/7oz glacé cherries", "175g/6oz sultanas", "115g/4oz dried cranberries", "225g/8oz dried apricots, chopped", "115g/4oz blanched whole almonds, roughly chopped (optional)", "175ml/6fl oz brandy ", "250g/9oz butter", "100g/3½oz soft brown sugar", "150g/5½oz caster sugar", "6 free-range eggs, lightly beaten", "225g/8oz plain flour", "225g/8oz ground almonds", "1 tbsp cocoa powder", "½ tsp ground nutmeg", "½ tsp mixed spice", "½ tsp salt", "1 orange, zest only", "1 lemon, zest only", "1 tsp vanilla essence", "115g/4oz currants", "100g/3½oz glacé cherries", "85g/3oz sultanas", "60g/2oz dried cranberries", "110g/4oz dried apricots, chopped", "50g/2oz blanched whole almonds, roughly chopped (optional)", "85ml/3fl oz brandy ", "125g/4½oz butter", "50g/2oz soft brown sugar", "75g/2¾oz caster sugar", "3 free-range eggs, lightly beaten", "115g/4oz plain flour", "115g/4oz ground almonds", "½ tbsp cocoa powder", "¼ tsp ground nutmeg", "¼ tsp mixed spice", "¼ tsp salt", "½ orange, zest only", "½ lemon, zest only", "½ tsp vanilla essence", "1 x 340g/12oz jar apricot jam", "icing sugar, for dusting", "3.5kg/7lb 11oz marzipan", "5.15kg/11lb 6oz ready-to-roll white icing"], "serves": "Serves 100", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the sugar flowers, knead the yellow sugar paste until soft and pliable and roll it out until it is 5mm/¼in thick. Press the sugar paste into the flower moulds, then remove and set aside to dry. Repeat with the white sugar paste. (The flowers can be made up to a month in advance and stored in an airtight container.)", "Preheat the oven to 150C/300F/Gas 2. Grease and line the 15cm/6in, 23cm/9in and 30cm/12in round cake tin.", "Place a wide strip of brown paper around the outside of the cake tin and tie with string.", "For the 30cm/12in tier, beat the butter and sugars until light and fluffy. (This takes about five minutes.) Add the eggs, a little at a time, until well combined. Stir in the dry ingredients, spices, zest, dried fruits, nuts (if using) and brandy. Spoon the mixture into the prepared tin and smooth the top with a palette knife. ", "Bake in the oven for four hours 10 minutes, or until a skewer inserted into the middle comes out clean.", "Repeat steps 3 and 4 for the 23cm/9in tier and bake in the oven for three hours 20 minutes, or until a skewer inserted into the middle comes out clean.", "Repeat steps 3 and 4 for the 15cm/6in tier and bake in the oven for 1 hour 45 minutes, or until a skewer inserted into the middle comes out clean.", "When the cakes are cooked, remove them from the oven and set aside to cool for 15 minutes. Remove them from the tin and set aside to cool completely.", "To ice the cakes, warm the apricot jam in a saucepan, then pass it through a sieve.", "Level the top of the 15cm/6in fruit cake by cutting the top off with a serrated knife, paint the top with a little apricot jam, then turn it upside down onto the 15cm/6in thin cake board. Using a piece of string, measure the top and sides of the fruit cake (this is so that you roll the marzipan out to the right size). Paint the fruit cake all over with the apricot jam.", "Dust a work surface with icing sugar and roll 500g/1lb 2oz of the marzipan out until it is large enough to cover the top and sides of the fruit cake (use the piece of string as a guide). Carefully lift the marzipan onto the cake and smooth it on with your hands. Trim off any excess marzipan, ensuring the cake board is also covered.", "Paint the cake with cooled, boiled water. Knead 500g/1lb 2oz of the white icing until soft and pliable and roll it out until it is 5mm/¼in thick and large enough to cover the top and sides of the fruit cake (use the piece of string as a guide). Carefully lift the icing onto the cake and smooth it on with your hands. Trim off any excess icing. ", "Repeat steps 10, 11 and 12 for the 23cm/9in cake using 1kg/2lb 4oz each of marzipan and icing.", "Repeat steps 10, 11 and 12 for the 30cm/12in cake using 2kg/4lb 8oz each of marzipan and icing. Leave the cakes overnight so that the icing can dry (do not store the cakes in the fridge).  ", "Once the icing has dried, apply a thin line of edible glue around the bottom edge of each cake and carefully stick some ribbon around the cake, securing the join with a little extra glue. ", "To insert the dowelling rods, hold a dowelling rod at the side of the 23cm/9in cake and mark with a pencil where the icing comes to. Cut the rod and three others to the same length. Push the rods into the cake about 5cm/2in away from the sides, to form the four corners of a square in the centre of the cake. Measure, cut and insert the rods in the same way for the 30cm/12in cake. ", "To cover the 38cm/15in thick cake board, knead 750g/1lb 10oz of the icing until soft and pliable and roll it out until it is 5mm/¼in thick and large enough to cover the cake board. Spread a little glue over the board, then carefully lift the icing onto the cake board, smoothing it until flat. Trim the edges. Apply a thin line of glue around the edge of the cake board and carefully stick the ribbon around the cake, tying it in a bow at the front. ", "If you’re transporting the cakes to a venue, it’s best to transport them separately and assemble the cake at the venue. To assemble the cakes, first stick the 30cm/12in cake to the icing-covered 38cm/15in cake board: add a little glue to the middle of the 35cm/14in cake board, then position the 30cm/12in cake in the middle. Place four of the pillars on top of the largest cake, positioning each one over a dowelling rod. Top with the 23cm/9in cake, then position the remaining four pillars on top and finish with the 15cm/6in cake. Using the edible glue, arrange the sugar flowers on the top of the cake and around the side of the 23cm/9in and 30cm/12in cake."]}, {"isVegetarian": true, "title": "Traditional Wedding Cake", "url": "www_bbc_co_uk_food_recipes_traditional_wedding_cake_46381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2 lb 4 oz white sugar paste icing", "500g/1lb 2oz bronze sugar paste icing", "bronze edible dust", "edible glue", "450g/1lb unsalted butter, room temperature", "450g/1lb caster sugar", "10 free-range eggs", "450g/1lb plain flour", "230g/8½oz ground almonds", "2 tsp ground cinnamon", "2 tsp mixed spice", "450g/1lb sultanas", "450g/1lb currants", "450g/1lb raisins", "225g/8oz candied mixed peel", "225g/8oz glacé cherries, roughly chopped", "2 orange, zest only", "2 lemon, zest only", "125ml/4fl oz brandy", "225g/8oz unsalted butter, room temperature", "225g/8oz caster sugar", "5 free-range eggs", "225g/8oz plain flour", "115g/4oz ground almonds", "1½tsp ground cinnamon", "1½tsp mixed spice", "225g/8oz sultanas", "225g/8oz currants", "225g/8oz raisins", "115g/4oz candied mixed peel", "115g/4oz glacé cherries, roughly chopped", "1 orange, zest only", "1 lemon, zest only", "4 tbsp brandy", "115g/4oz unsalted butter, room temperature", "115g/4oz caster sugar", "2½  free-range eggs", "115g/4oz plain flour", "55g/2oz ground almonds", "1 tsp ground cinnamon", "1 tsp mixed spice", "115g/4oz sultanas", "115g/4oz currants", "115g/4oz raisins", "55g/2oz candied mixed peel", "55g/2oz glacé cherries, roughly chopped", "½ orange, zest only", "½ lemon, zest only", "2 tbsp brandy", "1 x 340g/12oz jar apricot jam", "icing sugar, for dusting", "3.5kg/7lb 11oz marzipan", "5.15kg/11lb 6oz ready-to-roll white icing", "5m/16ft 5in x 2.5cm/1in bronze satin ribbon"], "serves": "Serves 100", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the sugar flowers, knead the white sugar paste until soft and pliable and roll it out until it is 5mm/¼in thick. Using the cutters, cut out different sized flowers.  Roll small pieces of bronze sugar paste in balls and stick them into the middle of the flowers with the edible glue. Set aside to dry for a couple of hours. (The flowers can be made up to a month in advance and stored in an airtight container.)", "Preheat the oven to 160C/325F/Gas 1. Grease and line a 15cm/6in, 23cm/9in and 30cm/12in round cake tin. Ensure that the greaseproof paper comes above the tin by about 9cm/3in so the top of the cake doesn’t burn.", "For the 30cm/12in tier, cream the butter and sugar together in a bowl until well combined. Slowly beat in the eggs, one at a time, until well combined. Fold in the flour, ground almonds, cinnamon and mixed spice. ", "Stir in the dried fruit, zest and brandy. Spoon the mixture into the cake tin and bake in the oven for four hours, or until a skewer inserted into the middle comes out clean.", "Repeat steps 2 and 3 for the 23cm/9in tier and bake in the oven for three hours, or until a skewer inserted into the middle comes out clean.", "Repeat steps 2 and 3 for the 15cm/6in tier and bake in the oven for two hours, or until a skewer inserted into the middle comes out clean.", "When the cakes are cooked, remove them from the oven set aside to cool for 15 minutes. Remove them from the tin and and place onto a wire rack to cool completely.", "Warm the apricot jam in a saucepan, then pass it through a sieve.", "Level the top of the 15cm/6in fruit cake, paint the top with a little apricot jam, then turn it upside down onto the 15cm/6in thin cake board. Using a piece of string, measure the top and sides of the fruit cake (this is so that you roll the marzipan out to the right size). Paint the fruit cake all over with the apricot jam.", "Dust a work surface with icing sugar and roll out 500g/1lb 2oz of the marzipan until it is large enough to cover the top and sides of the fruit cake (use the piece of string as a guide). Carefully lift the marzipan onto the cake and smooth it on with your hands. Trim off any excess marzipan, ensuring the cake board is also covered.", "Paint the cake with cooled, boiled water. Knead 500g/1lb 2oz of the white icing until soft and pliable and roll it out until it is 5mm/¼in thick and large enough to cover the top and sides of the fruit cake (use the piece of string as a guide). Carefully lift the icing onto the cake and smooth it on with your hands. Trim off any excess icing. Leave the cakes overnight so that the icing can dry (do not store the cakes in the fridge).  ", "Repeat steps 9, 10 and 11 for the 23cm/9in cake using 1kg/2lb 4oz each of marzipan and icing.", "Repeat steps 9, 10 and 11 for the 30cm/12in cake using 2kg/4lb 8oz each of marzipan and icing.", "Once the icing has dried, apply a thin line of edible glue around the bottom edge of each cake and carefully stick some ribbon around the cake, securing the join with a little extra glue. ", "To insert the dowelling rods, hold a dowelling rod at the side of the 23cm/9in cake and mark with a pencil where the icing comes to. Cut the rod and three others to the same length. Push the rods into the cake about 5cm/2in away from the sides, to form the four corners of a square in the centre of the cake. Measure, cut and insert the rods in the same way for the 30cm/12in cake. ", "To cover the 20cm/8in thick cake boards, knead 400g/14oz of the icing until soft and pliable and roll it out until it is 5mm/¼in thick and large enough to cover the cake board. Spread a little glue over the board, then carefully lift the icing onto the cake board, smoothing it until flat. Trim the edges. Apply a thin line of glue around the edge of the cake board and carefully stick the ribbon around the cake, securing the join with a little extra glue. ", "Repeat step 16 using 500g/1lb 2oz icing for the 28cm/11in cake board and 750g/1lb 10oz icing for the 35cm/14in cake board.", "If you’re transporting the cakes to a venue, it’s best to transport them separately and assemble the cake at the venue. To assemble the cakes, first stick the 30cm/12in cake to the 35cm/14in cake board. Add a little glue to the middle of the 35cm/14in cake board, then position the 30cm/12in cake in the middle. Place four of the pillars on top, positioning each one over a dowelling rod. Top with the 28cm/11in cake board, and repeat the process with the 23cm/9in cake, finishing with the 20cm/8in cake board and the 15cm/6in cake. Using the edible glue, arrange the sugar flowers in on the top of the cake and around the sides of the 15cm/6in, 23cm/9in and 30cm/12in cake."]}, {"isVegetarian": true, "title": "Traditional wedding cake", "url": "www_bbc_co_uk_food_recipes_traditional_wedding_cake_68531", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_wedding_cake_68531_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz ready-to-roll white icing", "pink edible dust", "edible glue", "150g/5½oz butter, plus extra for greasing", "90g/3¼oz dark brown sugar", "60g/2¼oz caster sugar", "2 tsp vanilla essence", "5 free-range eggs", "165g/5¾oz currants", "225g/8oz raisins", "340g/12½oz sultanas", "½ orange, zest only", "1 tbsp black treacle", "½ tsp bicarbonate of soda", "185g/6½oz self-raising flour", "½ tsp ground cloves", "½ tsp ground cinnamon", "250g/9oz butter, plus extra for greasing", "150g/5½oz dark brown sugar", "100g/3½oz caster sugar", "3 tsp vanilla essence", "8 free-range eggs", "275g/9¾oz currants", "375g/13oz raisins", "565g/1lb 4oz sultanas", "1 orange, zest only", "2 tbsp black treacle", "¾ tsp bicarbonate of soda", "310g/11oz self-raising flour", "¾ tsp ground cloves", "¾ tsp ground cinnamon", "375g/13oz butter, plus extra for greasing", "225g/8oz dark brown sugar", "150g/5½oz caster sugar", "4 tsp vanilla essence", "12 free-range eggs", "410g/14½oz currants", "550g/1lb 4oz raisins", "850g/1lb 14oz sultanas", "1½ oranges, zest only", "3 tbsp black treacle", "1 tsp bicarbonate of soda", "450g/1lb self-raising flour", "1 tsp ground cloves", "1 tsp ground cinnamon", "1 x 340g/12oz jar apricot jam", "icing sugar, for dusting", "3.5kg/7lb 11oz marzipan", "5.15kg/11lb 6oz ready-to-roll white icing"], "serves": "Serves 100", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the roses, pinch off a little icing and roll it in the palm of your hands to make it more malleable. Shape the icing into an oval shape, smooth out one end of the oval to make it thinner so that it resembles the frilly part of the tip of a rose petal. Make 8-10 more rose petals in this way. To make a rose, roll a small ball of icing into a cone shape, then wrap a rose petal around it. Carefully press the remaining rose petals around the central petal to form a rose shape. You may need to ‘tease’ the petals out from each other a little bit. ", "Carefully brush the edges of the roses with pink dust. Repeat the process until you have made about 15 roses. Set aside for 2-3 hours, or until the icing has hardened. (The roses can be made up to a month in advance and stored in an airtight container.)", "Preheat the oven to 160C/325F/Gas 3. Grease and line a 15cm/6in, 23cm/9in and 30cm/12in round cake tin.", "For the 15cm/6in tier, cream the butter, sugar and vanilla together in a bowl until well combined. Gradually beat in the eggs, one at a time, until well combined. Stir in the dried fruit, orange zest and treacle, then fold in the bicarbonate of soda, flour and spices until well combined. Spoon the mixture into the cake tin and bake in the oven for about two hours, or until a skewer inserted into the middle comes out clean.", "Repeat step 4 for the 23cm/9in tier and bake in the oven for three hours, or until a skewer inserted into the middle comes out clean.", "Repeat step 4 for the 30cm/12in tier and bake in the oven for 4½ hours, or until a skewer inserted into the middle comes out clean.", "When the cakes are cooked, remove them from the oven and set aside to cool for 15 minutes. Remove them from the tin and set aside on a wire rack to cool completely.", "Warm the apricot jam in a saucepan, then pass it through a sieve.", "Level the top of the 15cm/6in fruit cake, paint the top with a little apricot jam, then turn it upside down onto the 15cm/6in thin cake board. Using a piece of string, measure the top and sides of the fruit cake (this is so that you roll the marzipan out to the right size). Paint the fruit cake all over with the apricot jam.", "Dust a work surface with icing sugar and roll 500g/1lb 2oz of the marzipan out until it is large enough to cover the top and sides of the fruit cake (use the piece of string as a guide). Carefully lift the marzipan onto the cake and smooth it on with your hands. Trim off any excess marzipan, ensuring the cake board is also covered.", "Paint the cake with cooled, boiled water. Knead 500g/1lb 2oz  of the white icing until soft and pliable and roll it out until it is 5mm/¼in thick and large enough to cover the top and sides of the fruit cake (use the piece of string as a guide). Carefully lift the icing onto the cake and smooth it on with your hands. Trim off any excess icing. Leave the cakes overnight so that the icing can dry (do not store the cakes in the fridge).  ", "Repeat steps 9, 10 and 11 for the 23cm/9in cake using 1kg/2lb 4oz each of marzipan and icing.", "Repeat steps 9, 10 and 11 for the 30cm/12in cake using 2kg/4lb 8oz each of marzipan and icing.", "Once the icing has dried, apply a thin line of edible glue around the bottom edge of each cake and carefully stick some ribbon around the cake, securing the join with a little extra glue. ", "To insert the dowelling rods, hold a dowelling rod at the side of the 23cm/9in cake and mark with a pencil where the icing comes to. Cut the rod and three others to the same length. Push the rods into the cake about 5cm/2in away from the sides, to form the four corners of a square in the centre of the cake. Measure, cut and insert the rods in the same way for the 30cm/12in cake. ", "To cover the 20cm/8in thick cake board, knead 400g/14oz of the icing until soft and pliable and roll it out until it is 5mm/¼in thick and large enough to cover the cake board. Spread a little glue over the board, then carefully lift the icing onto the cake board, smoothing it until flat. Trim the edges. Apply a thin line of glue around the edge of the cake board and carefully stick the ribbon around the cake, securing the join with a little extra glue. ", "Repeat step 16 using 500g/1lb 2oz icing for the 28cm/11in cake board and 750g/1lb 10oz icing for the 35cm/14in cake board.", "If you’re transporting the cakes to a venue, it’s best to transport them separately and assemble the cake at the venue. To assemble the cakes, first stick the 30cm/12in cake to the 35cm/14in cake board: add a little glue to the middle of the 35cm/14in cake board, then position the 30cm/12in cake in the middle. Place four of the pillars on top of the largest cake, positioning each one over a dowelling rod. Top with the 28cm/11in cake board, and repeat the process with the 23cm/9in cake, finishing with the 20cm/8in cake board and the 15cm/6in cake. Using the edible glue, arrange the fondant roses in a cluster on the top of the cake and around the side of the 23cm/9in and 30cm/12in cake."]}, {"isVegetarian": false, "title": "Traditional gravy", "url": "www_bbc_co_uk_food_recipes_traditionalgravy_1283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditionalgravy_1283_16x9.jpg", "ingredients": ["meat juices ", "2 tbsp liquid meat fat", "30g/1oz plain flour", "570ml/1 pint stock", "2 tsp gravy browning (optional)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Collect the juices and the fat from the meat you are roasting. Put the juices in a glass jug and allow to stand for a few minutes so that the fat will rise to the surface. Skim off the fat. ", "Put the roasting tin that you used to cook the meat on the hob on a medium heat and add the fat. (The meat needs to be resting, covered with foil, in a warm place at this point)", "Stir in the flour and cook for 1 minute.", "Stir in the meat juices and gradually stir in the stock until you get a smooth gravy. Use a wooden spoon and stir all over the surface of the pan to incorporate any meat juices that are stuck to it.", "Bring to the boil and allow to simmer for 10 minutes.", "Season to taste and add a little gravy browning if desired."]}, {"isVegetarian": false, "title": "Traditional pork with apple and black pudding", "url": "www_bbc_co_uk_food_recipes_traditionalporkwitha_72079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium to large pork fillet", "200g/7¼oz good quality black pudding", "1 golden delicious apple, peeled, thinly sliced and blanched", "salt and freshly ground black pepper", "knob of butter", "a little olive oil"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400C/Gas 6.", "Cut the pork open with a sharp knife and open the fillet out along its length, being careful not to cut all the way through the fillet. ", "Cut the black pudding into a sausage shape and place along the length of the fillet. Scatter the apple alongside the black pudding. Season well.", "Gently roll up the fillet and tie with string.", "Wrap the fillet in cling film and allow to rest in the fridge for a couple of hours before cooking.", "To cook, season the fillet and panfry with a little butter and olive oil and place in the oven for fifteen minutes. ", "Allow to rest before serving so that the meat soaks up the juices."]}, {"isVegetarian": true, "title": "Traditional rice pudding", "url": "www_bbc_co_uk_food_recipes_traditionalricepuddi_93164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sultanas", "1 mug hot strong black tea", "1.3 litres/2 pints 7fl oz milk", "300ml/10½fl oz double cream", "200g/7oz pudding rice", "100g/3½oz golden granulated sugar", "pinch freshly ground nutmeg", "1 vanilla pod, split, seeds scraped out", "clotted cream, to serve", "jam, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2. ", "Place the sultanas in a bowl and pour over the hot tea. Set aside to soak for ten minutes, then drain (discard the tea). ", "In a large casserole dish or rice pudding dish (roughly 30cm x 20cm/12in x 8in), mix together the milk and cream. Stir in the rice, sugar and a pinch of nutmeg. Add the vanilla pod and seeds, then stir in the soaked sultanas. ", "Cover the dish with a lid or sheet of aluminium foil, then cook in the oven for 1½ hours. Remove the lid or foil and cook for a further 20 minutes, or until the rice is tender and the top is lightly golden and has formed a skin. ", "To serve, spoon the rice pudding into serving bowls and serve with spoonfuls of clotted cream and jam."]}, {"isVegetarian": false, "title": "Traditional roast sirloin of beef", "url": "www_bbc_co_uk_food_recipes_traditionalroastsirl_9400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sirloin of beef on the bone, weighing 5-6 lb (2.25-2.75 kg) - this would be 3 ribs ", "½ onion, peeled ", "1 level dessertspoon mustard powder ", "1 level dessertspoon plain flour ", "freshly milled black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/475F/Gas 9.", "Place the beef, just as it is, upright in a roasting tin, tucking in the half onion alongside it. ", "Combine the mustard powder and flour, then dust this all over the surface of the fat, and finally season with a few twists of freshly milled pepper. This floury surface will help to make the fat very crusty (for those like me who want to eat what I call the crispies), while the onion will caramelise to give the gravy a rich colour and flavour. ", "Place the joint in the oven - it will have plenty of fat so do not add extra. After 20 minutes turn the heat down to 190C/375F/Gas 5, and continue to cook for 15 minutes per lb (450 g) for rare, plus 15 minutes extra for medium-rare or 30 minutes extra for well-done. ", "While cooking, baste the meat with the juices at least three times. To see if the beef is cooked to your liking insert a thin skewer and press out some juices: the red, pink or clear colour will indicate to what stage the beef has cooked. ", "Remove the cooked beef to a board for carving and leave it to rest for at least 30 minutes before serving (while it is resting you can increase the heat in the oven to finish the roast potatoes if you are serving them). ", "This resting period allows most of the juices which have bubbled up to the surface of the meat to seep back into it, and the meat itself firms up to make it easier to carve. Some of the juices will escape, though, and these should be poured into the gravy."]}, {"isVegetarian": false, "title": "Traditional Yorkshire pudding", "url": "www_bbc_co_uk_food_recipes_traditionalyorkshire_67345", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditionalyorkshire_67345_16x9.jpg", "ingredients": ["175g/6oz plain flour", "2 free-range eggs", "175ml/6fl oz milk (whole or semi-skimmed)", "110ml/4fl oz water", "2 tbsp beef dripping", "salt and freshly milled black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Begin by placing a sieve over a large mixing bowl, then sift the flour in, holding the sieve up high to give the flour a good airing as it goes down into the bowl. Make a well in the centre and break the eggs into it.  Add the salt and pepper.", "Whisk the eggs wth an electric whisk and as you beat them the flour around the edges will be slowly incorporated. Measure the milk and water into a measuring jug and when the mixture becomes stiff, add the mixture gradually, whisking continuously. Stop and scrape the sides of the bowl with a spatula so that any lumps can be pushed down into the batter, then whisk again till all is smooth. Now the batter is ready for use and although it's been rumoured that batter left to stand is better, I have found no foundation for this - so just make it whenever is convenient.", "Spoon the beef dripping into the roasting tin and allow it to heat in the oven. When the oven is up to temperature remove the tin and place it over a direct heat (turned to medium). Then, when the fat begins to shimmer and smoke a little, pour in the batter. Tip it evenly all round and then place the tin on a high shelf in the oven and cook for 40 minutes or until golden brown and crisp. Serve it cut into squares presto pronto."]}, {"isVegetarian": false, "title": "Travelling laksa", "url": "www_bbc_co_uk_food_recipes_travelling_coconut_01827", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/travelling_coconut_01827_16x9.jpg", "ingredients": ["handful stir-fry vegetables", "30g/1oz dried 'instant noodles', seasoning sachet discarded", "25g/1oz creamed coconut", "2.5cm/1in fresh root ginger, grated", "1 garlic clove, grated", "½ vegetable stock cube", "½ lime, juice only", "pinch chilli flakes (optional)", "1 tsp fish sauce (optional)", "salt and freshly ground black pepper", "15g/½oz cooked chicken strips or cubes of firm tofu", "small handful coriander, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients apart from the chicken and coriander in a heatproof lidded container.", "When ready to eat, pour 300ml/10fl oz boiling water over the mixture until just covered. Put the lid on the container and leave for 5 minutes. ", "Stir well to break up any noodles (caution: the container may be be hot), then put the lid back and leave for 5 minutes. ", "Add the chicken and stir well. Sprinkle the coriander on top, if using, and serve immediately. "]}, {"isVegetarian": false, "title": "Travelling frittata", "url": "www_bbc_co_uk_food_recipes_travelling_frittata_52293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large free-range eggs", "1 tbsp milk", "salt and freshly ground black pepper ", "2 tbsp shredded baby spinach", "1 tbsp shredded ham", "1 tbsp grated Cheddar (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the eggs and milk in a 225g/8oz jam jar, season with salt and pepper and whisk with a fork. ", "Stir in the spinach, ham and Cheddar.", "Microwave on high for 2 minutes 20 seconds, then leave to stand for a further 2 minutes. (Caution: the jar may be still be hot). Serve"]}, {"isVegetarian": false, "title": "Travelling soy sauce noodle soup", "url": "www_bbc_co_uk_food_recipes_travelling_noodle_soup_88753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz rice noodles", "handful stir-fry vegetables ", "2.5cm/1in fresh root ginger, finely grated", "1 garlic clove, finely grated", "1 tbsp dark soy sauce", "¼ vegetable stock cube, crumbled", "1 tsp runny honey", "pinch dried chilli flakes (optional)", "pinch freshly ground black pepper", "15g/½oz cooked chicken strips or 2.5cm/1in tofu cubes", "small handful fresh coriander, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients apart from the chicken and coriander in your container and put the lid on.", "When ready to eat, pour boiling water over the mixture until just covered. Put the lid on the jar and leave for 5 minutes (caution: the jar may be still be hot).", "Add the chicken and stir well. Sprinkle the coriander on top and eat immediately. "]}]