[{"ingredients": ["Harina de auto crianza 110g / 4oz", "pizca de sal", "2 cucharadas de jengibre molido", "½ cucharadita de nuez moscada molida", "½ cucharadita de especias mixtas", "75g / 2½oz de copos de avena", "Jarabe dorado de 175g / 6oz", "50g / 1¾oz de melaza negra", "110g / 4oz de mantequilla sin sal", "110g / 4oz de azúcar morena suave", "1 huevo de gallinas camperas, golpeado", "2 cucharaditas de leche", "Jarabe dorado de 200g / 7oz", "50ml / 2fl oz de jugo de manzana", "1 cucharadita de especias mixtas", "50ml / 2fl oz de sidra", "helado, para servir"], "method": ["Para el estacionamiento, precaliente el horno a 140 ° C / 275 ° F / Gas 1 y una caja de torta cuadrada de 20 cm / 8 pulgadas.", "Tamiza la harina, la sal, el jengibre, la nuez moscada y la mezcla de especias en un tazón grande. Mezcle los copos de avena.", "Ponga el jarabe, la melaza, la mantequilla y el azúcar en una cacerola pequeña y derrita con un poco de calor. Haga que hierva a fuego lento pero no hierva. Cuando la mantequilla y el azúcar se hayan derretido, vierta en la mezcla de harina y revuelva para combinar.", "Mezcle el huevo batido y la leche para crear una pasta de consistencia suave y casi colada.", "Vierta en la lata con mantequilla y hornee por 50 minutos, o hasta que esté firme en el centro.", "Retire del horno y deje enfriar en la lata durante 5-10 minutos antes de cortar y cortar en cuadrados.", "Para la salsa, coloque todos los ingredientes en una cacerola, lleve a ebullición y cocine a fuego lento hasta que se forme una consistencia de jarabe.", "Sirva un cuadrado de parkin en cada plato, luego cuchara sobre el jarabe. Termine con una bola de helado."], "url": "www_bbc_co_uk_food_recipes_parkin_with_cider_and_65702", "title": "Parkin con sidra y salsa de jarabe dorado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parkin_with_cider_and_65702_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "3 rebanadas de jamón de Parma", "4 rebanadas finas de ciabatta", "Espinaca bebé 200 g / 7 oz, lavado", "½ tomate de ternera, semillas retiradas, picadas", "1 cucharada de cebolletas frescas picadas", "1 cucharada de vinagre balsámico", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, caliente una cucharada de aceite en una sartén grande antiadherente y fríe el jamón de Parma por un minuto en cada lado, o hasta que se dore. Retire de la sartén y escurra sobre papel de cocina.", "En la misma sartén, caliente el aceite restante, coloque las rebanadas de chapata en la sartén y cocínelas hasta que estén doradas.", "Coloque la espinaca y el tomate en un tazón grande. Coloque los ingredientes del aderezo en un tazón pequeño, mezcle bien y vierta sobre la ensalada. Mezcle bien para combinar.", "Transfiera la ensalada a un plato grande y cubra con los croutons y el jamón de Parma."], "url": "www_bbc_co_uk_food_recipes_parmahamandspinachsa_84882", "title": "Ensalada de jamón y espinaca de Parma con croûtons y aderezo balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina fuerte", "1 cucharadita de sal", "30 g / 1 oz de levadura fresca", "200ml / 7fl oz de agua tibia", "3-6 cucharadas de aceite de oliva, más extra para engrasar", "25g / 1oz de mantequilla", "Hojas de espinaca bebé 400 g / 14 oz", "2 dientes de ajo, finamente picados", "sal y pimienta negra recién molida", "Camembert 250 g / 9 oz, más o menos picado", "1 bola de mozzarella de búfala fresca, desgarrada en trozos grandes", "16 rebanadas de jamón de Parma", "4 cucharadas de crema doble", "1 cilantro fresco de racimo pequeño, picado", "Hokj / Ezz Parma son", "1 ciabatta pequeña, cortada en cubos de 2 cm / 1 in", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "50 g / 2 oz de hojas de mizuna", "50g / 2oz de hojas de espinaca baby", "25 g / 1 oz de queso parmesano, afeitado", "½ limón, solo jugo"], "method": ["Para la pizza, coloque la harina, la sal y la levadura en un recipiente grande y agregue el agua y tres cucharadas de aceite de oliva y mezcle para formar una masa.", "Amasa la masa durante al menos cinco minutos, hasta que esté elástica. Agregue más aceite si es necesario.", "Cubra la masa con film transparente, luego déjela a un lado y deje que se demuestre durante una hora.", "Divida la masa en cuatro pedazos iguales y enrolle cada pieza en una bola, luego extiéndala sobre una superficie de trabajo enharinada hasta aproximadamente 5 mm / ¼ de grosor.", "Coloque en una bandeja para hornear engrasada y déjela a un lado para comprobar durante 30 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Calentar una sartén hasta que esté caliente y agregar la mantequilla, la espinaca y el ajo y sofreír hasta que la espinaca se haya marchitado. Retire del fuego, deje enfriar y luego exprima el exceso de líquido. Sazonar, al gusto, con sal y pimienta negra recién molida y dividir entre los cuatro círculos de masa.", "Coloque el camembert, la mozzarella y el jamón de Parma en la parte superior de la espinaca. Sazonar bien con sal y pimienta negra recién molida.", "Coloque las pizzas en el horno para hornear durante diez minutos, luego retire y cuchara sobre la crema doble y esparza sobre las hojas de cilantro. Regrese las pizzas al horno por otros cinco minutos hasta que las pizzas estén cocidas.", "Para la ensalada, coloque el jamón de Parma en una bandeja para hornear y coloque en el horno durante 3-4 minutos, o hasta que estén crujientes.", "Coloque los cubos de ciabatta en un recipiente y rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida. Coloque en una bandeja para hornear por separado y coloque en el horno para hornear durante cinco minutos, o hasta que estén dorados y crujientes.", "Retire las piezas de ciabatta del horno en un recipiente limpio con mizuna y hojas de espinaca.", "Desmenuza el crujiente jamón de Parma y espolvorea con el parmesano.", "Agregue el jugo de limón y mezcle una vez más.", "Para servir, coloque una pizza en cada uno de los cuatro platos y coloque una pequeña porción de ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_parmahamcamembertand_86322", "title": "Pizza de jamón, camembert y mozzarella de Parma", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 hojas de pasta filo lista para usar", "50g / 2oz de mantequilla, derretida", "1 cucharada de aceite de oliva", "½ cebolla roja, finamente rebanada", "2 rebanadas de jamón de Parma, picadas", "75 g / 2½ oz de gorgonzola, en cubos", "puñado de albahaca fresca"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Cepille las hojas de filo con mantequilla derretida y luego coloque la capa en una lata de tarta pequeña sobre una bandeja para hornear. Coloque en el horno y hornee durante cinco minutos, o hasta que estén crujientes y dorados. Retire del horno y reserve.", "Calentar el aceite de oliva en una sartén, agregar la cebolla y freír durante cuatro minutos, luego una cuchara en el flan preparado. Cubra con el jamón de Parma, gorgonzola y albahaca y hornee en el horno durante seis minutos, o hasta que el queso se haya derretido.", "Deslice sobre un plato y sirva."], "url": "www_bbc_co_uk_food_recipes_parmahamredonionandg_86218", "title": "Jamón de Parma, cebolla roja y tarta de gorgonzola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de hojas de cohete", "2 rebanadas de jamón de Parma", "1 cucharada de aceite de oliva", "½ limón, jugo", "3 tomates secados al sol", "sal y pimienta negra recién molida, al gusto"], "method": ["Separe el cohete en dos racimos iguales.", "Coloque las rebanadas de jamón de Parma sobre una superficie limpia.", "Envuelva el cohete en el jamón de Parma.", "Rocíe con el aceite y el jugo de limón.", "Para servir, coloque las envolturas una sobre otra en el centro de la placa. Coloque los tomates alrededor y sazone al gusto."], "url": "www_bbc_co_uk_food_recipes_parmahamrocketrolls_78031", "title": "Rollitos de jamón y rúcula Parma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas medianas de pan blanco suave, cortezas cortadas", "gran leche de bienvenida", "gran puñado de albahaca fresca", "gran puñado de perejil fresco de hoja plana", "1 cucharada de aceite de oliva extra virgen", "30g / 1oz de pan rallado", "20 g / ¾ oz de parmesano, recién rallado", "1 diente de ajo, pelado, picado", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva virgen extra", "6 cucharadas de vinagre de vino blanco", "sal y pimienta negra recién molida", "8 pequeños tomates maduros en vid", "12 sardinas pequeñas u 8 grandes, escamadas, evisceradas, con espina dorsal removida, mariposa de mariposa, cabezas unidas (pídale a su pescadero que haga esto por usted)", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "3 grandes puñados cohete", "15-20 aceitunas negras, piedras quitadas, cortadas a la mitad", "pequeños racimos de cebollines frescos, cortados en trozos cortos, para servir"], "method": ["Para el relleno, coloque las rebanadas de pan en un tazón y vierta suficiente leche para mojarlas por completo. Coloque el pan mojado en un colador fino y déjelo reposar durante 4-5 horas, o preferiblemente durante la noche, hasta que el pan esté húmedo pero no mojado. Exprime el exceso de leche antes de usar.", "Una vez que el pan se ha drenado, prepare los tomates. Haz una pequeña cruz en el fondo de cada tomate con un cuchillo afilado. Prepare una olla grande de agua hirviendo y un recipiente grande con agua helada. Agregue los tomates al agua hirviendo y blanquee por 1-2 minutos. Escurrir e inmediatamente agregarlos al recipiente de agua helada. Cuando las pieles de los tomates se hayan aflojado, retire los tomates del agua y quite las cáscaras. Corta cada tomate pelado en cuartos y quita las semillas.", "Para la vinagreta, mezcle todos los ingredientes de la vinagreta hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Espolvoree los tomates troceados con cuatro cucharadas de vinagreta y déjelos a un lado para que se marinen durante al menos 30 minutos.", "Continúe con el relleno: mezcle la albahaca y el perejil en un procesador de alimentos con aceite de oliva hasta que las hierbas estén finamente picadas. Agregue las migas de pan, el pan empapado, el parmesano y el ajo y pulse hasta que la mezcla se una como una pasta. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para rellenar las sardinas, comience dividiendo el relleno en 8 o 12 bolas iguales.", "Coloque una sardina fileteada sobre un trozo, coloque una bola de relleno en la cabecera del pescado y asegure los filetes a cada lado de la bola de relleno usando palitos de cóctel para que el relleno quede dentro de la sardina. Suavice el relleno que aún es visible en la parte superior e inferior del pez con la punta de los dedos. Repita el proceso con las sardinas restantes y las bolas de relleno.", "Sazone las sardinas con un poco de sal y pimienta negra recién molida.", "Para cocinar las sardinas, caliente la mitad del aceite de oliva en una sartén grande y antiadherente a fuego medio a alto. Freír la mitad de las sardinas rellenas hasta que se doren por un lado, alrededor de 1-2 minutos.", "Voltee el pescado y fríalo durante 1-2 minutos más en el otro lado, o hasta que las sardinas estén cocidas y doradas en ambos lados. Asegúrese de que el relleno se caliente introduciendo un cuchillo afilado en el centro del relleno y probando cuidadosamente el calor de la punta del cuchillo con la yema del dedo.", "Retire las sardinas de la sartén y déjelas a un lado en un plato caliente o en un horno tibia.", "Repita el proceso de fritura con el aceite restante y las sardinas rellenas. Cuando esté cocido, retire suavemente los palitos de cóctel de las sardinas.", "Justo antes de servir, rocíe dos cucharadas de la vinagreta sobre las hojas del cohete y combine para cubrir las hojas. Coloque los cuartos de tomate marinados y las aceitunas alternativamente alrededor del borde de cada una de las cuatro placas para servir.", "Para servir, coloque un puñado del cohete en el centro de cada uno de los cuatro platos. Divida las sardinas por igual entre las cuatro placas, apilándolas encima del cohete. Espolvorea con las cebolletas. Cuchara sobre la vinagreta restante."], "url": "www_bbc_co_uk_food_recipes_parmesan-stuffed_18531", "title": "Sardinas rellenas de parmesano con ensalada de tomate", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de pollo cocidos", "2 rebanadas de jamón de Parma", "½ granada, solo semillas", "2 cucharadas de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "pizca de copos de chile seco", "2 cucharaditas de aceite vegetal", "1 cucharada de agua", "1 cucharada de cilantro fresco picado", "1 cucharada de menta fresca picada", "cilantro fresco, para adornar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo, envuelva los filetes de pollo en el jamón de Parma y colóquelos en una bandeja para hornear. Transfiere al horno y hornea por cinco minutos o hasta que esté caliente todo el tiempo.", "Para hacer un chapuzón de granada, coloque las semillas de granada, el azúcar, el vinagre, las hojuelas de chile y el aceite en una cacerola pequeña y cocine a fuego lento durante 3-4 minutos. Retire del fuego, mezcle los ingredientes restantes y vierta en un recipiente pequeño.", "Para servir, coloque los filetes de pollo en un plato de servir con la salsa de inmersión al lado y adorne con cilantro."], "url": "www_bbc_co_uk_food_recipes_parmahamwrappedchick_85038", "title": "Pollo envuelto en jamón de Parma con salsa picante de granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tallo de romero, hojas retiradas y picadas finamente", "Harina normal 280g / 10oz", "60 g / 2¼ oz de queso parmesano, rallado", "210g / 7½oz de mantequilla sin sal, ablandada", "½ cucharadita de sal", "pimienta negra", "3 cucharadas de semillas de amapola", "1 cebolla roja picada", "250g / 9oz de chorizo ​​para cocinar, cortado en cubitos", "1 chile rojo, sin semillas, finamente picado", "1½ cucharada de puré de tomate", "100ml / 3½fl oz de jugo de manzana", "pizca de sal y pimienta", "pinch herbes de Provence", "5 cucharadas de vino tinto", "2½ cucharadas de azúcar moreno oscuro", "½ cucharadita de vinagre balsámico"], "method": ["Para las galletas de semillas de amapola y parmesano, con sus manos, mezcle ligeramente todos los ingredientes (excepto las semillas de amapola) en una masa. También puede pulsar todos los ingredientes en un procesador de alimentos. Forme la masa en un tronco de aproximadamente 3 cm / 1¼ de diámetro.", "Suavemente extienda las semillas de amapola en una tabla de cortar y enrolle el tronco de masa en las semillas de amapola. Envuelva la película adhesiva y colóquela en la nevera durante al menos 30 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Retire la masa del refrigerador y corte en rodajas el grosor de una moneda de una libra. Presione los bordes suavemente con los dedos para crear una cúpula en el medio.", "Coloque los bizcochos en una bandeja para hornear forrada con papel de hornear y deje en la nevera para enfriar durante 20 minutos como mínimo. Es posible que necesite dos bandejas para todos los bizcochos.", "Hornee en el horno precalentado durante 10-12 minutos o hasta que estén dorados. Deja enfriar.", "Para el chutiche de chorizo ​​y vino tinto, traiga todo el ingrediente a fuego lento a fuego medio. Cocine hasta que el líquido se haya evaporado y la salsa picante tenga una consistencia espesa pero untable.", "Para servir, coloque los bizcochos en una tabla para servir y la salsa picante en un tazón para servir al costado."], "url": "www_bbc_co_uk_food_recipes_parmesan_and_poppy_seed_32812", "title": "Galletas de parmesano y semilla de amapola con salsa picante de chorizo ​​y vino tinto", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 25-30 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "80g / 3oz de parmesano, finamente rallado (o similar queso duro vegetariano alternativo)", "1 cucharadita de semillas de amapola", "1 cucharadita de semillas de sésamo"], "method": ["Precalienta el horno a 220C / 425F / Gas 7, coloca dos bandejas grandes para hornear con papel de hornear y engrásalas con mantequilla.", "Mezcle el queso y las semillas en un tazón pequeño. Siente un anillo de 9 cm / 3½ pulgadas en una de las bandejas para hornear o cortador de galletas y espolvoree un pequeño puñado de la mezcla de queso en una capa fina. Con cuidado, levante el anillo para revelar un disco de parmesano de bordes limpios y coloque un palo de paleta en la parte superior, con la punta del palo tocando el centro del disco.", "Repita con el queso restante y los palitos para hacer 10 en total (dejando alrededor de 3 cm / 1¼ en espacios entre ellos para permitir que se extienda durante la cocción).", "Deberías quedarte un poco de parmesano, así que úsalo para cubrir la parte de la vara de lollipop que descansa sobre el disco.", "Hornee en el horno por cinco minutos, intercambiando las paletas a un estante diferente a la mitad. El queso debe ser ligeramente dorado y burbujeante.", "Retire del horno y deslice el papel fuera de las bandejas para hornear y sobre una rejilla para ayudar a acelerar el enfriamiento. Deje que se enfríe durante 1-2 minutos, o hasta que los chupetines estén crujientes. Con mucho cuidado, elimine cada uno con una espátula. Me gusta servirlos en una caja con agujeros en la parte superior."], "url": "www_bbc_co_uk_food_recipes_parmesan_and_poppy_seed_44968", "title": "Piruletas de parmesano y semillas de amapola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_and_poppy_seed_44968_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de azúcar en polvo", "Ciruelas de 500 g / 1 lb 2 oz, empedradas y picadas", "1 cebolla, cortada en cubitos", "50ml / 2fl oz de vinagre de malta", "1 estrella de anís", "½ cucharadita de canela molida", "sal y pimienta negra recién molida", "8 rebanadas de jamón de Parma, cortado por la mitad a lo largo", "4 bolas de mozzarella de búfala, escurridas y cortadas en cuartos", "3 cucharadas de aceite de oliva", "2 cucharaditas de semillas de sésamo", "8 rebanadas de ciabatta"], "method": ["Para la salsa picante de ciruela, caliente una sartén hasta que esté caliente, agregue el azúcar impalpable y cocínelo hasta que se derrita y tenga un color dorado claro.", "Agregue las ciruelas picadas, la cebolla, el vinagre, el anís estrellado y la canela y cocínelas durante 5-8 minutos, o hasta que las ciruelas estén tiernas y ligeramente pulposas.", "Sazonar con un poco de sal y pimienta negra recién molida y reservar para enfriar. Si lo hace con anticipación, guarde la salsa picante en un recipiente hermético en la nevera.", "Para la mozzarella, envuelva las rebanadas de jamón de Parma alrededor de la mozzarella y reserve.", "Calentar una sartén grande hasta que esté caliente, agregar una cucharada de aceite de oliva y freír los paquetes a cada lado hasta que estén crujientes y la mozzarella esté empezando a rezumar.", "Espolvorea sobre las semillas de sésamo.", "Caliente una sartén hasta que hierva, luego vierta el resto del aceite de oliva sobre la chapata y póngalo en la plancha.", "Cocine a la parrilla en cada lado durante 1-2 minutos, o hasta que estén doradas.", "Para servir, espolvorea un poco de chutney en cada uno de los cuatro platos, coloca las rodajas de mozzarella al lado y sirve con el pan."], "url": "www_bbc_co_uk_food_recipes_parma_ham_wrapped_91632", "title": "Mozzarella envuelta con jamón de Parma y chutney de ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla fría sin sal, cortada en trozos", "Harina simple de 100 g / 3½ onzas, más extra para inflar", "pizca de sal", "pizca de cayena", "1 cucharadita colmada de mostaza en polvo", "50g / 1¾ oz de queso cheddar maduro finamente rallado", "50 g / 1¾ oz de parmesano finamente rallado, o queso duro vegetariano similar, más un poco más", "1 huevo, golpeado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la mantequilla y la harina en el tazón de un procesador de alimentos con sal, cayena, polvo de mostaza y quesos. Procese juntos para comenzar, y luego pulse la mezcla en pequeños trazos a medida que note que la mezcla se une; eventualmente se unirá sin la necesidad de huevo o agua. Envuelva la película adhesiva y déjela enfriar en la nevera durante al menos 30 minutos.", "Enharinar ligeramente una superficie de trabajo y extender suavemente la masa hasta aproximadamente el grosor de dos libras. Corta los bizcochos según el tamaño y la forma que desees, cualquier cosa entre 3 cm / 1¼ pulgadas y 5 cm / 2 pulgadas, dependiendo de la ocasión. Colóquelos en una bandeja para hornear engrasada a aproximadamente 2 cm de separación - puede tomar dos porciones de cocción para usar toda la mezcla.", "Cuidadosamente cepille la superficie de cada galleta con el huevo y espolvoree un poco de parmesano rallado fino. Hornea durante 10 minutos, o hasta que tengan un magnífico color dorado; el excelente olor también le informará que están listos.", "Con cuidado, levante los bizcochos de la bandeja con una espátula y colóquelos en una rejilla para que se enfríen. Aunque las galletas se mantendrán bien en un recipiente sellado durante unos días, ¡nunca supe que esto ocurra!"], "url": "www_bbc_co_uk_food_recipes_parmesan_biscuits_54963", "title": "Galletas de parmesano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace alrededor de 25-30 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_biscuits_54963_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, sin piel", "130g / 4½oz de queso parmesano, rallado", "1 bola de mozzarella, cortada en 12 tiras", "4 rebanadas de prosciutto o jamón de Parma, cada corte en 3 tiras", "Harina simple de 75g / 2¾oz", "4 huevos de gallinas camperas", "70g / 2½oz de pan rallado seco", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 yema de huevo de gallinas camperas", "2 cucharaditas de mostaza Dijon", "2 cucharaditas de vinagre de vino tinto o vinagre de frambuesa", "2 cucharadas de aceite vegetal", "1 col roja pequeña, sin raíz, hojas muy finas en rodajas", "75g / 2¾oz de col rizada, removida con pedúnculo, hojas en rodajas finas", "1 cucharadita de semillas de comino"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Cortar una bolsa grande en cada una de las pechugas de pollo, usando un cuchillo pequeño y afilado.", "Divida 100 g / 3½ oz del parmesano y la mozzarella en 4. Coloque el queso parmesano encima de la mozzarella y envuelva cada montón con las piezas de jamón. Rellene cada pechuga de pollo con el queso envuelto en jamón y presione los bordes del pecho para que la bolsa quede sellada (puede usar un palillo de cóctel para ayudar a asegurarlo).", "Espolvoree la harina en un plato y sazone con sal y pimienta. Batir los huevos en un tazón y espolvorear el pan rallado y el parmesano restante en un plato por separado. Separe cada chuleta en la harina, luego sumérjala en los huevos y cúbrala con el queso y las migas de pan.", "Calentar una sartén hasta que esté caliente, agregar el aceite de oliva y freír el pollo durante 2-3 minutos por cada lado, o hasta que se dore. Transfiera a una bandeja de asar y tueste en el horno por 15-20 minutos hasta que esté cocido.", "Mientras tanto, para las ensaladas, para hacer el aderezo bata la yema de huevo, la mostaza Dijon, el vinagre de vino tinto y 250 ml / 9 fl oz de agua juntas en un tazón hasta combinarlas. Poco a poco agregue 1 cucharada de aceite vegetal, batiendo todo el tiempo, hasta que se emulsione. Condimentar con sal y pimienta. Coloque la col roja en un tazón grande, luego vierta más de 100 ml / 3 ½ oz del aderezo y mezcle bien.", "Coloque la col rizada en un tazón grande. Caliente una sartén pequeña y agregue la cucharada restante de aceite. Una vez caliente agregue las semillas de comino. Una vez que comiencen a saltar, retírenlo del fuego y viertan sobre la col rizada.", "Ponga el pollo en platos para servir y coloque las alubias rojas y las ensaladas de col rizada al lado."], "url": "www_bbc_co_uk_food_recipes_parmesan_chicken_with_95119", "title": "Pollo parmesano con col lombarda y ensalada de col rizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 tomates en la vid, divididos a la mitad", "4 cucharadas de aceite de oliva", "6 ramitas de tomillo, hojas recogidas", "sal y pimienta negra recién molida", "Pan rallado pancho japonés de 60 g / 2½ oz", "25g / 1oz de queso parmesano, recién rallado", "1 limón, ralladura solamente", "4 pechugas de pollo, deshuesadas y sin piel", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas, golpeados", "50g / 2oz de mantequilla", "1 manojo de berros, hojas recogidas", "1 limón, cortado en cuñas"], "method": ["Precalentar el horno a 150C / 300F / Gas 1.", "Coloque los tomates, córtelos en una bandeja para hornear y rocíe con aceite de oliva.", "Sazone con sal y pimienta negra y luego esparza la mitad de las hojas de tomillo sobre la parte superior.", "Coloque en el horno y tueste durante 4-6 horas hasta que se sequen ligeramente. Apague el horno y deje que se enfríe, preferiblemente durante la noche en el horno.", "Para el pollo, coloque las migas de pan, el queso parmesano, la ralladura de limón y las hojas de tomillo restantes en un procesador de alimentos y rellene las migas finas.", "Marque las pechugas de pollo (coloque el pollo en lo que habría sido el lado de la piel, luego corte la línea central hasta la mitad. Gire el cuchillo hacia los lados y corte horizontalmente casi al lado del pecho para abrirlo, luego repita con el otro lado para que tenga una pechuga de pollo, el doble de tamaño y la mitad del grosor).", "Sazone la harina con sal y pimienta negra y luego espolvoree el pollo en la harina.", "Sumérgete en el huevo y luego en las migas de pan, asegurándote de cubrir bien cada lado.", "Caliente el aceite de oliva y la mantequilla en una sartén grande, luego agregue las pechugas de pollo, una a la vez, y fría hasta que estén doradas, aproximadamente dos minutos de cada lado. Coloque sobre papel de cocina para drenar.", "Para servir, apile algunos tomates en el plato, agregue el pollo y un puñado de berros y luego termine con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_parmesan_crusted_chicken_56186", "title": "Escalope de pollo con costra de parmesano con tomates asados ​​lentos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo grande de gallinas camperas", "3 cucharadas de parmesano finamente rallado", "¼ cucharadita de pimentón", "1 cucharadita de mostaza Dijon", "½ cucharadita de salsa Worcestershire", "3 cucharadas de leche entera", "2 rebanadas de pan de masa fermentada blanca (consulte la sugerencia de la receta)", "1 cucharada de mantequilla sin sal", "½ cucharadita de aceite de oliva", "perejil de hoja plana, para rociar (opcional)", "1 cebolleta, finamente cortada, para guarnición (opcional)"], "method": ["Batir el huevo, el parmesano, el pimentón, la mostaza, la salsa Worcestershire y la leche juntas en un plato poco profundo en el que se puedan meter las rebanadas de pan.", "Siente el pan en esta mezcla durante aproximadamente 2 minutos por cada lado, presionando hacia abajo de vez en cuando. Desea que las rebanadas se empapen y suavicen, pero no se caigan a pedazos. Vierta la mezcla de huevo restante.", "Cuando el pan esté empapado, caliente la mantequilla y el aceite en una sartén a fuego medio. Una vez que la mantequilla comience a burbujear, freír el pan durante aproximadamente 2 minutos por cada lado - manténgalo bien vigilado - hasta que esté cocido con manchas doradas en la superficie.", "Retire de la sartén, y coma tal como está, o espolvoree con perejil picado y cebolla tierna cortada en rodajas, si lo desea."], "url": "www_bbc_co_uk_food_recipes_parmesan_french_toast_87497", "title": "Tostadas francesas parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_french_toast_87497_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7-8 zanahorias, peladas y cortadas", "7-8 chirivías, peladas y cortadas", "3 cucharadas de aceite de oliva", "30 g / 1 oz de queso parmesano, rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Corte las zanahorias y las chirivías por la mitad a lo largo y corte las piezas particularmente grandes por la mitad otra vez. Ponga a hervir una olla grande de agua y agregue las verduras. Hierva por 3 minutos, o hasta que las verduras estén comenzando a ablandarse (usted quiere que mantengan su forma mientras tuestan).", "Drene bien y divida entre 2 bandejas para asar (si la bandeja está llena, las verduras tampoco se dorarán). Agregue el aceite y mezcle para cubrir las verduras. Sazone con sal y pimienta y cubra con el parmesano.", "Asar durante 25 minutos o hasta que las zanahorias y las chirivías estén doradas en los bordes."], "url": "www_bbc_co_uk_food_recipes_parmesan_roast_parsnips_63627", "title": "Chirivías y zanahorias asadas al parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 7-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5½ oz", "75g / 2¾oz de queso parmesano (o similar queso duro vegetariano), rallado", "100g / 3½oz de mantequilla sin sal, ablandada", "1 yema de huevo de gallinas camperas"], "method": ["Mezcle todos los ingredientes, usando un tazón y una cuchara, un mezclador eléctrico o un procesador de alimentos como se desee, hasta que la masa dorada comience a formar una masa.", "Gírelo sobre una superficie y amase durante aproximadamente 30 segundos hasta que quede suave, luego divídalo en dos.", "Tome la primera mitad y, con sus manos, gírelo en un cilindro, lo más uniforme posible sin estresarlo, aproximadamente 3 cm / 1¼ pulgada de diámetro. Asegúrese de que los extremos sean planos, también, de modo que el cilindro se asemeje a un rollo de monedas. Ahora envuelve esto en una película adhesiva, girando la película adhesiva en los extremos, como una galleta de Navidad, y pon el rollo en la nevera, luego procede de la misma manera con la mitad restante de la masa.", "Precalienta el horno a 180 ° C / 375 ° F / Gas 4 mientras la masa descansa en la nevera durante aproximadamente 45 minutos, momento en el cual podrás cortarlos en rebanadas gruesas fácilmente; apunte alrededor de 1 cm, piense en monedas de libra o similares.", "Acomode en una bandeja para hornear forrada con pergamino para hornear y ponga en el horno durante 15-20 minutos, cuando deberían estar comenzando a doblar en los bordes.", "Retire del horno, luego deje enfriar (si puede) antes de comer."], "url": "www_bbc_co_uk_food_recipes_parmesan_shortbreads_86971", "title": "Tortitas de parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 35-40", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_shortbreads_86971_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de pan blanco fresco", "50/2 oz de jamón de Parma, muy finamente picado", "4 cucharadas de parmesano recién rallado", "1 cucharada de perejil de flatleaf fresco picado", "sal y pimienta negra recién molida", "4 chuletas de cordero deshuesadas u 8 chuletas de cordero", "1 huevo de gallinas camperas", "4 cucharadas de aceite de oliva ligero", "25g / 1oz de mantequilla", "4 cucharadas de caldo de verduras", "4 puerros, en rodajas finas", "sal y pimienta negra recién molida", "6 cucharadas de crema doble", "2 cucharadas de hojas de menta fresca (opcional)", "1 cucharadita de pimienta blanca"], "method": ["Para las chuletas, incline las migas de pan en un tazón y mezcle el jamón de Parma, el parmesano y el perejil. Sazone generosamente con pimienta negra recién molida.", "Recorte el exceso de grasa de las chuletas o chuletas, luego bata un poco con un ablandador de carne o un rodillo (una sartén también haría el trabajo).", "Batir el huevo en un plato aparte y sazonar generosamente con sal y pimienta negra recién molida, luego usar para cubrir las chuletas o chuletas.", "Cubra con la mezcla de pan rallado, asegurándose de que estén bien cubiertos. Dejar enfriar y poner en la nevera durante una hora. Retire media hora antes de cocinar para permitir que la carne vuelva a la temperatura ambiente.", "Caliente el aceite de oliva en una sartén grande de base pesada. Agregue las chuletas o chuletas y cocine durante 3-4 minutos en cada lado para obtener chuletas grandes y de 1 a 2 minutos en cada lado si usa chuletas. Deben ser crujientes por fuera pero aún rosadas en el medio. Escurrir en la toalla de cocina.", "Para el puré de puerro, llevar la mantequilla y el caldo a ebullición en una sartén con tapa hasta que se espese para formar una emulsión.", "Agregue los puerros con una buena pizca de sal, cubra y cocine durante 3-4 minutos hasta que estén tiernos pero aún de color verde vibrante, sacuda la olla de vez en cuando y revuelva una o dos veces.", "Transfiera a un procesador de alimentos o licuadora, luego agregue la crema y la menta (si usa) con la pimienta blanca.", "Mezclar hasta obtener un puré suave y sazonar al gusto con sal y pimienta negra recién molida. Transfiera a una sartén limpia.", "Suavemente recaliente el puré de puerro y divídalo entre platos para servir calentados. Organiza una chuleta crujiente encima de cada una para servir."], "url": "www_bbc_co_uk_food_recipes_parmesanandparmahamc_83101", "title": "Parmesano y jamón de Parma en costra de chuletas de cordero con puerro y puré de menta", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla fría, en cubos", "125g / 4½oz de harina natural", "25 g / 1 oz de parmesano recién rallado (o alternativa vegetariana)", "sal y pimienta negra recién molida", "pizca de cayena"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Frote la mantequilla en la harina, a mano o en un procesador de alimentos, hasta que la mezcla se vea como pan rallado fino.", "Agregue el parmesano, el condimento y la pimienta de cayena.", "Trabaje la mezcla en una bola y luego amase brevemente en una superficie de trabajo ligeramente espolvoreada con harina hasta que quede suave.", "Cortar la masa por la mitad, aplanar cada pieza ligeramente, luego extender ligeramente entre 2 hojas grandes de película adhesiva.", "Levante la pieza superior de película adhesiva y corte en galletas de 5 cm / 2 in.", "Con cuidado, levántelos en una bandeja para hornear ligeramente untada con mantequilla, luego amase y vuelva a enrollar los recortes para hacer más galletas. Debe hacer aproximadamente 30 galletas en total.", "Hornee los bizcochos por 8-10 minutos hasta que estén crujientes y dorados. Dejar enfriar en las bandejas para hornear. Almacenar en una lata hermética."], "url": "www_bbc_co_uk_food_recipes_parmesanbiscuits_609", "title": "Galletas de parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 30 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de queso parmesano, finamente rallado", "½ cucharadita de polvo de curry Madras suave", "¼ cucharadita de sal masala", "¼ cucharadita de cúrcuma molida", "½ cucharadita de copos de sal marina", "Filete de halibut 500g / 1lb, cortado en 16 cubos de igual tamaño", "2 limas, jugo y ralladura, más 1 lima, solo jugo", "25g / 1oz de mantequilla", "25 g / 1 oz de azúcar", "2 cucharadas de aceite vegetal", "1 chalote de plátano, finamente picado", "1 diente de ajo, rallado", "1 cucharadita colmada de garam masala", "1 cucharadita de polvo de curry Madras", "¼ cucharadita de cúrcuma molida", "500g / 1lb 2oz de papas nuevas, cortadas en cuartos, hervidas durante 8-10 minutos hasta que estén tiernas", "50g / 2oz de hojas de espinaca baby", "sal al gusto", "1 x 20g / ¾oz cilantro coriandro cress, para servir"], "method": ["Para el halibut con costra de parmesano, en un bol, mezcle el parmesano, el polvo de curry, el garam masala, la cúrcuma y la sal hasta que estén bien combinados.", "Dragar un lado de cada cubo de fletán en la mezcla de queso parmesano hasta que esté cubierto densamente.", "Caliente una sartén pesada y antiadherente a fuego medio o bajo. Cuando la sartén esté tibia, agregue los cubos de halibut, con los lados recubiertos de parmesano, y fría en seco durante 4-5 minutos, o hasta que las cortezas de parmesano estén crujientes y doradas.", "Sazone los cubos de halibut, al gusto, con sal, luego dele la vuelta y retire la sartén del fuego. (NB: el calor residual de la sartén cocinará los otros lados de los cubos de halibut).", "Para la emulsión de lima, inmediatamente agregue todos los ingredientes de la emulsión de lima a la sartén que contiene los cubos de halibut y deje de lado por 2-3 minutos.", "Mientras tanto, para el sagú aloo, caliente el aceite en una sartén grande a fuego alto. Agregue la chalota y el ajo y cocine por 2-3 minutos, o hasta que estén blandos.", "Agregue las especias y continúe freír durante 1-2 minutos, o hasta que estén fragantes.", "Agregue las papas nuevas cocidas y continúe cocinando por un minuto más, o hasta que estén calientes.", "Retire la sartén del fuego y agregue el bebé espinaca. Revuelva bien hasta que la espinaca se haya marchitado, luego condimente, al gusto, con sal.", "Para servir, divide el saco aloo por igual entre cada una de las cuatro placas de servir. Coloque cuatro cubos de halibut con costra de parmesano en la parte superior de cada porción de sagú aloo. Transfiera la mezcla de la emulsión de lima de la sartén a un recipiente y bata hasta que esté bien combinada, luego vierta sobre los cubos de halibut y alrededor del borde de las placas. Adorne con el berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_parmesancrustedhalib_91767", "title": "Hipogloso con parmesano, sag aloo y emulsión de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones vivos de 250g / 9oz, rellenado, limpiado y enjuagado", "2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "175ml / 6fl oz de vino blanco", "2 cucharadas de aceite de oliva", "¼ de cebolla, finamente picada", "2 tomates, semillas retiradas y picadas", "1 cucharada de puré de tomate", "100ml / 3½fl oz de vino blanco", "6 hojas de albahaca fresca, rotas", "Parmesano 55 g / 2 oz, rallado", "pan blanco crujiente"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los mejillones, golpee los mejillones contra una superficie dura y deseche los que no se cierren.", "Caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 5-6 minutos, o hasta que estén blandos. Vierta el vino blanco y cocine a fuego lento, luego agregue los mejillones y cubra con una tapa durante 4-5 minutos, o hasta que los mejillones se hayan abierto. Cuele a través de un colador, reservando el licor de cocción y desechando cualquier mejillón sin abrir.", "Para la salsa de passata, caliente el aceite en una sartén y fríe las cebollas durante 3-4 minutos o hasta que se ablanden. Agregue los tomates, el puré de tomate y el vino. Mida 100 ml / 3½ fl oz del licor de cocción de mejillón y agregue a la passata. Cocine por otros 3-4 minutos, luego agregue la albahaca y los mejillones cocidos.", "Coloque los mejillones en un plato gratinado, espolvoree sobre el queso parmesano y hornéelos durante 4-5 minutos, o hasta que estén dorados y burbujeantes en la parte superior. Sirve con pan blanco crujiente."], "url": "www_bbc_co_uk_food_recipes_parmesancrustedpassa_90478", "title": "Mejillones de passata con corteza de parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]