[{"isVegetarian": true, "title": "Aubergine and bean casserole", "url": "www_bbc_co_uk_food_recipes_aubergine_and_bean_82086", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_bean_82086_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "2 onions, quartered", "1 garlic clove, crushed", "250g/9oz chestnut mushrooms, halved", "2 aubergines, cut into large chunks ", "2 x 400g/14oz can borlotti or butter beans ", "75g/3oz brown sugar", "1 tsp smoked paprika", "100ml/3½fl oz vegetable stock", "75g/3oz molasses", "2 tbsp tomato ketchup", "1 tbsp Dijon mustard", "30ml/1¼fl oz sherry vinegar", "1 tbsp chopped fresh parsley", "flatbread"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based frying pan. Fry the onions and garlic on a medium heat for five minutes or until golden-brown and softened.", "Add the mushrooms and aubergines and cook for 10 minutes.", "Stir in the borlotti beans, muscovado sugar, paprika, vegetable stock, molasses, tomato ketchup, mustard, sherry vinegar and parsley and bring to the boil. Cover and simmer for 45 minutes. ", "Serve with flatbreads."]}, {"isVegetarian": true, "title": "Aubergine and mozzarella bake", "url": "www_bbc_co_uk_food_recipes_aubergine_and_mozzarella_51464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_mozzarella_51464_16x9.jpg", "ingredients": ["3 tbsp olive oil ", "1 onion, finely chopped", "3 garlic cloves, crushed ", "2 x 400g/14oz tins chopped tomatoes ", "salt and pepper", "2 medium to large aubergines", "1 ball mozzarella, drained and torn into pieces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a saucepan over a medium heat. Add one tablespoon of the olive oil and, once hot, add the onion and a pinch of salt. Fry the onion for 4-5 minutes, or until softened. Add the garlic and continue to cook for two minutes.", "Pour in the tomatoes and mix well, breaking up any larger bits with the back of your spoon. Season with a pinch of salt and pepper and bring to a simmer. Reduce the heat and simmer gently for 20-30 minutes, or until the tomato sauce is thickened and flavoursome.", "Meanwhile slice the aubergines lengthways into slices 5mm/¼in thick. Brush the aubergine slices with olive oil and season well with salt and pepper on both sides. Heat a griddle pan until smoking hot and then griddle in batches for 2-3 minutes on each side, or until all the slices are golden brown. Alternatively, heat the grill to high, place half of the aubergine slices on a baking tray and grill for 3-4 minutes on each side. Continue with the rest of the slices until they are all golden-brown. Remove and leave to one side once cooked.", "Add a spoonful of tomato sauce to the bottom of a medium sized ovenproof baking dish  (about 28x22cm/11x8½in)and spread evenly. Top with a third of the aubergine slices.  ", "Follow with a third of the remaining tomato sauce and top with a third of the mozzarella. Repeat the process for another two layers finishing with tomato sauce and the mozzarella. Place into the preheated oven and bake for 25-30 minutes, or until the dish is bubbling and the mozzarella melted and golden-brown on top."]}, {"isVegetarian": true, "title": "Aubergine and mushroom cannelloni", "url": "www_bbc_co_uk_food_recipes_aubergine_and_mushroom_37196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 banana shallots, roughly chopped", "olive oil, for frying", "250g/9oz mixed mushrooms, cleaned and finely chopped", "60ml/2fl oz double cream", "1 aubergine, sliced lengthways about 3mm thick", "100g/3½oz blue cheese", "6 plum tomatoes", "3 tbsp apple cider vinegar", "1 tbsp brown sugar", "2 garlic cloves, finely chopped", "pinch chilli flakes", "1 tsp tomato purée", "1 bunch coriander, roughly chopped", "salt and freshly ground pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat one shallot in a little olive oil, then add the mushrooms and season. Fry for a few minutes until the moisture is released from the mushrooms. Add the cream and simmer until thickened.", "Dry fry the aubergine slices over a medium heat until soft and charred. ", "Preheat the grill to it's highest setting.", "Place a little of the mushroom mix on  aubergine slices and roll up as cannelloni. Put in an ovenproof dish, cover with blue cheese and place under a hot grill until melted.", "Bring a pan of water to the boil and carefully drop in the tomatoes. Remove after 30 seconds, or when the skin peels, and place in a bowl of iced water. When cool, remove the skin, scoop out the pips and chop the flesh.", "In a small saucepan, simmer the vinegar, sugar, garlic and remaining shallot. Add a little salt and chilli to taste. When cooked and syrupy, add the tomato purée and fresh tomatoes. Simmer for a few minutes then add the coriander.", "To serve, place the aubergine cannelloni between two plates and dress with the tomato sauce."]}, {"isVegetarian": false, "title": "Aubergine and okra caponata with chargrilled pork belly", "url": "www_bbc_co_uk_food_recipes_aubergine_and_okra_10739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter", "olive oil, for drizzling", "1 large onion, finely chopped ", "8 garlic cloves, finely chopped ", "2 medium aubergine, cut into 1cm/¼in dice", "10 okra topped, tailed and halved", "8g/¼oz capers", "2 tsp red wine vinegar ", "splash red wine ", "6 medium plum tomatoes, finely chopped ", "80g/3oz whole black olives, stones removed  ", "salt and freshly ground black pepper ", "handful fresh basil and parsley leaves, to serve", "4 slices pork belly", "10g/1/3oz fennel seeds", "olive oil, for cooking", "salt and freshly ground black pepper ", "150g/5½oz rice flour ", "100g/3½oz cornflour", "800ml/28fl oz sparkling water", "splash cider vinegar", "6 topped and tailed okras", "vegetable oil, for deep-frying "], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make thecaponata, gently fry the onions and garlic in small frying pan with a little butter and olive oil. When tender and golden, remove from the heat and set aside. ", "Meanwhile, warm a little more of the oil in another frying pan and gently fry the aubergine until golden-brown. Add half the okra and soften slightly. Add the capers, the cooked onions and garlic, a splash more oil and the vinegar to the pan and simmer for a minute or two. ", "Add the tomatoes and wine and simmer for around 15 minutes. Season with salt and pepper, throw in the basil and parsley and top with a little drizzle of olive oil to serve. ", "To make the chargrilled pork belly, season the pork with salt, pepper and the fennel seeds. Heat a drizzle of olive oil in a large frying pan over a medium–high heat and fry the pork belly slices for around 5 minutes on each side or until they are deeply caramelised and cooked through. Rest for 10 minutes. ", "To make the deep-fried okra, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. ", "Mix the flours together in a bowl and transfer 30g/1oz to another bowl. Add the sparkling water to the main bowl and whisk well to combine. Dip the okra in the reserved flour, then into the batter and deep-fry until crisp and golden. Drain on kitchen paper. ", "To serve, spoon some caponata onto each plate and top with the pork belly and deep-fried okra. "]}, {"isVegetarian": true, "title": "Aubergine and walnut caviar", "url": "www_bbc_co_uk_food_recipes_aubergine_and_walnut_45265", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_walnut_45265_16x9.jpg", "ingredients": ["2 large aubergines", "4 garlic cloves, 2 thinly sliced and 2 crushed", "1 lemon, juice only", "2 tbsp olive oil", "2 tbsp finely chopped parsley", "2 tbsp finely chopped mint", "50g/1¾oz walnuts, finely chopped ", "blinis", "sour cream", "pomegranate seeds"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Cut deep slits in the aubergines at regular intervals and on all sides. Stuff with the sliced garlic. Put on a baking tray and roast in the oven for 45 - 60 minutes. When the aubergines are ready, they should be soft, wrinkly and turning brown/black in colour.", "Put the aubergines in a colander and allow to cool a little. When they are cold enough to handle, peel off the skin. Squeeze gently to remove as much liquid as possible. Chop the aubergines finely.", "Put the aubergines in a bowl and add all of the remaining ingredients. Mix thoroughly. If you want a slightly smoother texture, you can use a stick blender or food processor. ", "Serve with blinis and sour cream, with a few pomegranate seeds sprinkled over."]}, {"isVegetarian": true, "title": "Aubergine and tomato canapés", "url": "www_bbc_co_uk_food_recipes_aubergine_and_tomato_31225", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_tomato_31225_16x9.jpg", "ingredients": ["1 large or 2 medium aubergines", "1 tbsp sunflower oil", "1 tsp mustard seeds", "1 red onion, finely chopped", "2½cm/1in piece fresh root ginger, finely chopped", "2 tbsp sundried tomato paste", "½ tsp salt", "1 green chilli, finely chopped", "½ tsp caster sugar", "bunch of fresh coriander, finely chopped", "handful red amaranth micro herbs (optional)", "60g/2¼oz unsalted butter", "¼ tsp salt", "handful coriander leaves, finely chopped", "85g/3oz plain flour", "2 large free-range eggs, beaten "], "serves": "Makes 15-20 canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Prick the aubergine with a knife and place it under the grill, turning it frequently, for about 15 minutes or until very soft. Leave to cool slightly, then carefully peel away the skin and finely chop the flesh.", "Heat the oil in a frying pan over a high heat, add the mustard seeds and cook for 1 minute until they start to pop. (CAUTION: when the mustard seeds pop, keep the pan well away from your face and eyes.)", "Add the onions, reduce the heat and cook for 5–10 minutes, until softened. Add the ginger and cook for 5 minutes. Stir in the chopped aubergine, tomato paste, salt, chilli and sugar and cook for 10 minutes. Add the coriander and leave to cool.", "Preheat the oven to 200C/180C Fan/Gas 6. Line two baking trays with baking parchment. Draw 2½cm/1in circles on the parchment paper, leaving the same room again between the circles.", "For the pastry combine the butter, salt, 125ml/4fl oz water and coriander leaves. Once the butter has melted bring the liquid to a boil and remove from the heat. Tip in the flour and quickly stir with a wooden spoon. Stir vigorously for 2 minutes and then tip it in a bowl to let it cool a little. Using an electric whisk, gradually add the beaten eggs to the paste, whisking after each addition until it forms a shiny paste that will hold its shape when piped (you may not need all the eggs). ", "Put the choux in a piping bag and pipe the choux onto the circles marked the parchment paper. Bake for 20 minutes. Make a hole in each choux bun using a skewer and return it to the oven for 10 minutes until crisp. Leave to cool on a wire rack.", "Slice the top off the choux buns, pull out any undercooked pastry, and fill them with the aubergine mixture. You can reheat these in the oven for 3 minutes to crisp up before serving. Decorate with the micro herbs or chopped coriander, if using."]}, {"isVegetarian": true, "title": "Aubergine chips with fennel yoghurt", "url": "www_bbc_co_uk_food_recipes_aubergine_chips_with_67293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_chips_with_67293_16x9.jpg", "ingredients": ["1 tsp coriander seed", "1 tsp fennel seed", "200g/7oz plain Greek style yoghurt", "125g/4½oz mayonnaise", "1 tsp lemon juice", "large pinch of sea salt", "black pepper", "2 tsp coriander seeds", "2 tsp fennel seeds", "100g/3½oz plain flour", "1 tsp fine salt", "½ tsp black pepper", "3-4 medium free-range eggs", "150g/5½oz panko breadcrumbs", "2 tsp sesame seeds", "2 aubergines, sliced into 10cm/4in long chips, approximately ½cm/¼in wide", "oil, for deep frying"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast both lots of coriander and fennel seeds by putting all 6 teaspoons in a non-stick frying pan and dry fry for a few minutes until you can smell them. Remove and grind in a mortar and pestle.", "Add 2 teaspoons of the ground seeds to the yoghurt and combine with the remaining yoghurt ingredients.", "For the aubergine chips, mix the flour, salt and pepper in a bowl. In a second bowl beat the eggs. In a third bowl mix the breadcrumbs, the remaining ground seeds and the sesame seeds.", "Dip the aubergine chips in the flour and cover well. Shake off the excess and then dip into the egg and shake off any drips and finally coat in the breadcrumbs. Set aside but do not put in the fridge.", "Heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 190C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Fry the aubergine in batches for 2-3 minutes until golden-brown. Remove and drain on kitchen paper. ", "Sprinkle with salt and serve with the fennel yoghurt."]}, {"isVegetarian": true, "title": "Aubergine gratin with tomato sauce and salad", "url": "www_bbc_co_uk_food_recipes_aubergine_gratin_with_32622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp extra virgin olive oil", "400g/14oz canned chopped tomatoes", "2 garlic cloves, roughly chopped", "1 large handful fresh basil leaves, roughly chopped", "salt and freshly ground black pepper", "2 aubergines, cut lengthways into 0.5cm/¼in slices", "salt and freshly ground black pepper", "4 tbsp olive oil", "1 large handful basil leaves, roughly chopped", "110g/4oz sultanas", "50g/2oz toasted pine nuts", "1 large buffalo mozzarella, ½ cut into thin slices and ½ roughly chopped", "110g/4oz rocket leaves", "25g/1oz parmesan shavings", "1 tbsp balsamic vinegar", "3 tbsp extra virgin olive oil", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato sauce, heat a frying pan over a medium-high heat and add the olive oil, tomatoes and garlic. Simmer for 3-4 minutes, or until the tomatoes have just started to break down.", "Stir in the basil and season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the aubergine, preheat the grill to its highest setting. Heat a frying pan over a medium to high heat. Season the aubergine slices with salt and freshly ground black pepper. When the pan is hot, add the oil and the aubergine slices, a few at a time. Fry for 2-3 minutes on each side, or until just golden-brown and softened.", "Remove the aubergine slices from the pan and arrange in a single layer on a plate or baking tray lined with kitchen paper, to drain.", "Scatter over the basil leaves, sultanas, pine nuts and the roughly chopped mozzarella.", "Roll each aubergine slice up from the short side, to form a pinwheel. Secure with a cocktail stick.", "Place the filled aubergine rolls into an ovenproof dish, wedging them in tightly. Remove the cocktail sticks and spoon over the tomato sauce. ", "Arrange the thin slices of mozzarella on top and season with salt and freshly ground black pepper.", "Grill for 3-4 minutes, or until the cheese is golden-brown and bubbling.", "For the salad, mix the rocket and parmesan shavings together in a bowl.", "Whisk the balsamic vinegar, olive oil and lemon juice together in a small bowl until well combined, then season, to taste, with salt and freshly ground black pepper.", "Add the rocket and parmesan to the dressing and mix well to combine. ", "To serve, spoon some of the filled aubergine rolls and tomato sauce onto serving plates and serve the salad alongside."]}, {"isVegetarian": true, "title": "Aubergine hummus", "url": "www_bbc_co_uk_food_recipes_aubergine_hummus_58701", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium aubergine, cut into 1cm/½in discs", "3 garlic cloves, chopped", "6 tbsp olive oil", "400g/14oz can chickpeas, drained", "3 sprigs rosemary"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Set the oven to 200C/400F/Gas 6.", "Lay the aubergine on a baking tray, scatter over the chopped garlic and half of the olive oil.", "Bake in the oven for 15 minutes.", "Drain the chickpeas and warm through in a pan with the remaining olive oil and the rosemary.", "When the aubergine is softened and lightly toasted (after about 15 minutes), remove from the oven.", "Place half of the chickpeas and half of the aubergines in a food processor and blend until smooth.", "Return the blended mix back to the pan and add the rest of the aubergines and warm through for a minute. ", "Serve hot."]}, {"isVegetarian": true, "title": "Aubergine parmigiana", "url": "www_bbc_co_uk_food_recipes_aubergine_parmigiana_57566", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_parmigiana_57566_16x9.jpg", "ingredients": ["2 large aubergines, sliced into thin slices about a 5mm/¼in thick", "2 tbsp olive oil", "100g/3½oz ricotta", "100g/3½oz Parmesan, grated (or alternative vegetarian hard cheese)", "100g/3½oz mozzarella, sliced ", "sea salt and freshly ground black pepper", "2 garlic cloves, finely chopped", "1 red onion, finely chopped", "a good splash olive oil", "2 x 400g tins chopped tomatoes ", "2 tsp dried oregano ", "125ml/4fl oz red wine", "A selection of Italian leaves", "3 tbsp olive oil", "1 tbsp sherry vinegar", "1 tsp Dijon mustard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Brush the aubergine slices with olive oil on both sides to coat. Heat a griddle pan and cook the aubergines for a couple of minutes on both sides until lightly browned. Set aside while you get on with the tomato sauce.", "Heat a large frying pan. Fry the garlic and onion with a little oil until soft. Add the chopped tomatoes, oregano and wine. Simmer for about 15 minutes, or until the sauce thickens.", "Preheat the oven to 220C/200C Fan/Gas 7.", "In a medium-sized roasting tin, spread a little tomato sauce over the bottom of the tin. Add a layer of aubergine slices and spread another layer of tomato sauce on top.", "Spread half the ricotta on the top and sprinkle with Parmesan, salt and pepper. Continue to repeat the layers until all the aubergine is used. Finish with a layer of mozzarella slices topped with a final sprinkle of Parmesan. Bake for 25 minutes.", "For the salad, place the leaves in a large bowl and mix. Combine the oil, vinegar and mustard in a small bowl. Season with salt and pepper. Dress the leaves with the dressing just before serving.", "Serve the parmigiana hot with the salad alongside. This dish reheats well if you have any leftovers."]}, {"isVegetarian": false, "title": "Aubergine stuffed with sausage, pine nuts and currants", "url": "www_bbc_co_uk_food_recipes_aubergine_stuffed_with_73083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines", "extra virgin olive oil", "½ onion, diced", "1 garlic clove, diced", "1-2 celery sticks, diced", "½ fennel bulb, diced", "225g/8oz spicy luganega pork sausage, skinned and crumbled", "30g/1oz white breadcrumbs ", "3 tbsp pine nuts ", "20g/¾oz capers", "1 free-range egg", "1 tbsp dried oregano ", "3 tbsp grated pecorino", "3 tbsp currants", "2 tbsp chopped sun-dried tomatoes", "2 tbsp chopped oregano "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. ", "Peel a few strips lengthways from the aubergines, so you can get the flesh out of the aubergine. Cut an incision and scoop out the flesh and set aside. ", "Heat olive oil in a pan and sauté the onion, garlic, fennel and celery until softened. Add the sausage and cook for 20 minutes. Chop the aubergine flesh and add to the pan. Add the breadcrumbs to the pan then the pine nuts.", "Tip the mixture into a bowl then add the capers, egg, oregano, cheese and currants. Mix well and season with salt and pepper. ", "Stuff the aubergines with the mixture and place into a deep baking tray, oil well and add 150ml/5fl oz water to the baking tray. Cover loosely with foil and bake for 40 minutes. This will help steam and cook the aubergine. Remove the foil and bake for a further 10 minutes.", "Meanwhile, mix the sun-dried tomatoes with the remaining olive oil and the fresh oregano.", "To serve, spoon the sun-dried tomatoes over the aubergine. "]}, {"isVegetarian": true, "title": "Aubergine and coriander dip", "url": "www_bbc_co_uk_food_recipes_aubergineandcoriande_1929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium aubergine", "1 clove garlic, peeled and crushed", "juice and zest 1 lemon", "2 tbsp chopped fresh coriander", "120ml/4fl oz olive oil", "Salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6.", "Put the aubergine on a baking sheet and roast in the oven for 30-40 minutes until tender. Cool and pull off the skin.", "Put the aubergine flesh in a food processor with the garlic, lemon juice, zest and coriander. Season well and whiz together.", "With the motor still running, pour in the olive oil and blend until the mixture is smooth."]}, {"isVegetarian": true, "title": "Aubergine and mozzarella stacks", "url": "www_bbc_co_uk_food_recipes_aubergineandmozzarel_68040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large aubergines, sliced 1cm/½in thick", "olive oil, for brushing", "1 mugful of fresh flat leaf parsley", "3 garlic cloves, finely chopped", "1 lemon, grated zest only", "1 tsp chopped fresh rosemary", "4 balls buffalo mozzarella about 110g/4oz each", "salt and freshly ground black pepper.", "1 tbsp olive oil", "1 shallot, finely chopped", "1 small plump fresh red chilli, deseeded and chopped", "1 garlic clove, finely chopped", "8 ripe plum tomatoes, skinned and chopped", "good pinch of sugar", "2 tbsp chopped fresh basil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Brush the aubergine slices with oil and season lightly. Heat a ridged griddle pan until you feel a good heat rising. Add the aubergine slices and chargrill for about 3 minutes on each side until softened. You need to do this in batches. Remove and leave to cool.", "To make the gremolata, finely chop the parsley sprigs and mix with the garlic, lemon zest and rosemary.", "Cut the balls of mozzarella into 1cm/½in slices. Divide the mozzarella and aubergine slices into 4 equal portions. Layer the slices alternately on a lightly greased baking sheet, sprinkling the gremolata and seasoning between each layer, to make 4 stacks, 4-5 layers high, using the larger pieces for the bases and the smaller pieces on top.", "Bake the stacks in the oven for about 15 minutes until the cheese just starts to melt.", "Meanwhile, to make the sauce, heat the oil in a frying pan, add the shallot, chilli and garlic and sauté for about 5 minutes. Add the chopped tomatoes, sugar and seasoning. Cook for about 10 minutes until you have a thick sauce, stirring occasionally. Add the basil. Then leave to cool. Transfer to a food processor or blender and process to make a purée. Reheat the sauce in a clean saucepan and keep warm.", "Place each stack in the centre of a warmed serving plate with the sauce spooned alongside."]}, {"isVegetarian": true, "title": "Aubergine curry", "url": "www_bbc_co_uk_food_recipes_auberginecurry_82146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ stalk lemongrass, finely chopped", "2 garlic cloves, finely chopped", "½ red chilli, finely chopped", "1 tbsp chopped fresh coriander stalks", "1 tsp cumin seeds", "250ml/9fl oz coconut milk", "50ml/2fl oz hot water", "4 Thai aubergines, halved", "½ lime, juice only", "1 tbsp chopped fresh coriander, to garnish"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the lemongrass, garlic, chilli, coriander stalks, cumin seeds and one tablespoon of the hot water in a mini blender to form a paste. ", "Place this mixture into a small saucepan and cook gently over medium heat for one minute. ", "Add the coconut milk, hot water, aubergines and lime juice, cover with a lid and cook for 12 minutes, or until the aubergines are soft.", "To serve, pour into a bowl and garnish with chopped coriander."]}, {"isVegetarian": true, "title": "Aubergine and feta tart", "url": "www_bbc_co_uk_food_recipes_aubergine_and_feta_tart_82948", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_feta_tart_82948_16x9.jpg", "ingredients": ["2 aubergines (about 300g/10½oz), ends trimmed and thinly sliced lengthways", "100ml/3½fl oz olive oil, plus extra for drizzling", "320g pack ready-rolled puff pastry", "1 small free-range egg, lightly beaten", "4 tbsp sun-dried tomato paste", "2 garlic cloves, chopped", "1 tsp dried basil", "100g/3½oz feta ", "salt and freshly ground black pepper", "handful fresh basil leaves, torn, to serve", "5 garlic cloves", "150ml/5fl oz olive oil", "50ml/2fl oz balsamic vinegar", "1 tbsp full-fat mayonnaise", "4 large handfuls rocket or mixed leaf salad", "1 small red onion, thinly sliced", "50g/1¾oz pine nuts, toasted "], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Place a griddle over a medium–high heat. Brush the aubergine slices with olive oil and season lightly on both sides. Cook in the griddle until tender and charred, turning halfway though. You may need to do this in batches.", "Unroll the pastry and place onto a large non-stick baking tray. Using a small knife, score a 1cm/½in border around the edge of the pastry and prick the base to prevent it from puffing up. Brush the border with beaten egg.", "Mix the tomato paste, garlic and dried basil in a small bowl and spread over the base, avoiding the border. Lay the aubergine on top. Crumble the feta and sprinkle over the aubergines. Bake on the middle shelf for 25–30 minutes, or until the sides have puffed up and the pastry has cooked through. Allow to stand for 10 minutes.", "Meanwhile make the salad. Carefully place the cloves on the edge of a small gas hob and turning the flame onto its lowest setting so the edges catch and the garlic turns black. Turn off the gas, let the garlic cool slightly, chop the cloves as finely as possible and crush using the back of a knife. ", "Place the garlic, oil, vinegar, mayonnaise and a pinch of salt in a lidded jar and shake until smooth.", "Place the leaves, onion and pine nuts in a large bowl and drizzle over the dressing. (Any leftover dressing can be refrigerated.)", "To serve, cut the tart into four to six slices and serve with the salad. Sprinkle over the basil and finish with a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Aubergine moussaka with sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_auberginemoussakawit_88436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines", "2 tbsp olive oil", "1 large onion, chopped", "2 garlic cloves, crushed", "600g/1lb 5oz lamb mince", "4 plum tomatoes, finely chopped", "1 tsp ground cumin", "1 tsp ground cinnamon", "½ tsp dried oregano", "150ml/5fl oz red wine", "2 tbsp chopped fresh mint ", "120ml/4fl oz chicken stock", "salt and freshly ground black pepper ", "25g/1oz butter", "25g/1oz plain flour", "200ml/7fl oz milk, heated to near-boiling", "2 free-range eggs, beaten", "pinch freshly grated nutmeg", "75g/3oz cheddar cheese, grated", "75g/3oz mozzarella cheese, grated", "2 tbsp olive oil", "3 white potatoes, peeled and cut into cubes", "salt and freshly ground black pepper ", "2 tbsp flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Cut the aubergines in half, and carefully scoop out the flesh, leaving the skins to one side. Cut the aubergine flesh into small cubes.", "Heat a frying pan over a medium heat until hot, then add the olive oil and aubergines and fry for 2-3 minutes.", "Add the onion and garlic and fry for a further 2-3 minutes, until the onions have softened and the aubergines are starting to turn golden-brown.", "Add the lamb mince and cook for 4-5 minutes, until browned.", "Add the tomatoes, cumin, cinnamon, dried oregano and red wine and cook for 2-3 minutes, breaking up the tomatoes with a spoon as you cook.", "Add the mint and the stock. Bring to the boil, then reduce the heat and simmer for 15 minutes. Season, to taste, with salt and freshly ground black pepper.", "Spoon the aubergine mixture into the reserved aubergine skins and place onto a roasting tray.", "Place the butter into a pan over a medium heat. When the butter has melted, add the flour and cook, stirring well, for one minute. Add the hot milk and cook, stirring constantly, for 2-3 minutes, until the mixture has thickened.", "Add the eggs, season with salt and freshly ground black pepper, and add the nutmeg.", "Add half of the grated cheddar and mozzarella and continue to cook, stirring, until combined as a smooth sauce.", "Spoon equal amounts of the cheese sauce over the top of each of the stuffed aubergines, then sprinkle with the remaining grated cheddar and mozzarella.", "Transfer the stuffed aubergines to the oven to bake for 20-25 minutes, until the cheese topping is golden-brown and bubbling.", "Meanwhile, for the sautéed potatoes, heat a frying pan over a medium heat until hot. Add the olive oil and potatoes and fry, turning occasionally, for 7-8 minutes, or until golden-brown all over and tender.", "Season the potatoes with salt and freshly ground black pepper, then add the flatleaf parsley and stir well.", "To serve, place a stuffed aubergine onto each plate and place a spoonful of sautéed potatoes alongside."]}, {"isVegetarian": true, "title": "Aubergine and tofu satay", "url": "www_bbc_co_uk_food_recipes_aubergineandtofusata_8816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shallot, peeled, finely chopped", "1 lemongrass stalk, tough outer leaves removed, chopped", "2 small red chillies, chopped", "2 cloves garlic, peeled, crushed", "2.5cm/1 inch piece fresh root ginger, peeled and grated", "1 lime, zest only", "1 tbsp chopped fresh coriander ", "2 tbsp groundnut oil", "1 packet firm tofu, drained and pressed", "1 aubergine", "12 short wooden skewers, soaked in cold water for at least 15 minutes", "2 tbsp groundnut oil", "1 shallot, peeled, finely chopped", "2 cloves garlic, peeled, finely chopped", "2 large red chillies, seeds removed, chopped", "1 tsp ground cumin", "1 tsp ground coriander", "75g/3oz crunchy peanut butter", "200g/7fl oz coconut milk", "1 lime, juice only", "salt, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the green curry paste, place all of the paste ingredients into a mortar and pound with a pestle until they form a paste. (You will not need all of the paste; store unused portion in a tightly covered jar in the fridge for up to two weeks.). ", "For the skewers, mix three tablespoons of the green curry paste together with one tablespoon of the groundnut oil until well combined.", "Cut the tofu and aubergine into 1.25cm/½ inch cubes and thread onto the wooden skewers, alternating the tofu and aubergine along the skewer. Lay the skewers flat on a plate and pour over the curry paste mixture to coat well, rubbing the aubergine and tofu all over. Cover with cling film and leave to marinate for at least 30 minutes, or overnight if possible, in the fridge. ", "Preheat the grill to medium. ", "Brush the vegetables with the remaining groundnut oil and cook under the grill for 8-10 minutes, turning once, or until the skewers are golden-brown all over. Set aside.", "For the satay sauce, heat the oil in a small pan and fry the shallot, garlic, chillies and spices for 4-5 minutes, or until the shallot and garlic are softened.", "Mix the peanut butter with a little warm water to make a thinner paste and add to the pan, followed by the coconut milk. Bring to the boil, then simmer for 6-8 minutes, or until the sauce thickens. Season, to taste, with lime juice and salt. Divide the sauce equally among four smalll bowls. ", "Serve the skewers on individual plates with a small bowl of satay sauce on the side."]}, {"isVegetarian": true, "title": "Aubergine and mozzarella wraps with watercress pesto", "url": "www_bbc_co_uk_food_recipes_aubergineandmozzarel_77215", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 slices bread, long and very thinly cut", "1 packet grilled aubergines", "5 mini mozzarella balls", "5 basil leaves, torn", "olive oil, to drizzle", "1 handful basil", "50g/1¾oz packet watercress, blanched", "3 tbsp Greek-style yoghurt", "25g/1oz pine nuts", "freshly ground black pepper", "2 tbsp olive oil"], "serves": "Makes 5", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the wraps, lay out the aubergine slices on the bread slices and top each with the mozzarella and basil. ", "Roll up like a swiss roll. Secure with cocktail sticks and drizzle with oil.", "Place on a baking tray and place into the oven for 3-4 minutes, until the cheese is bubbly and they are heated through.", "To make the pesto, blend together all of the ingredients in a food processor and drizzle around the aubergine rolls."]}, {"isVegetarian": true, "title": "Aubergine mozzarella fritters with aubergine 'caviar'", "url": "www_bbc_co_uk_food_recipes_auberginemozzarellaf_91463", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "2 aubergines, thinly sliced", "salt and freshly ground black pepper, to taste", "2 mozzarella balls, thinly sliced", "1 small bunch dill, picked", "¼ tsp caster sugar", "1 tsp quick-action dried yeast", "1 tsp cider vinegar ", "300ml/11fl oz beer", "200g/7oz plain flour", "2 aubergines", "2 sprigs rosemary, cut into pieces", "2 garlic cloves, thickly sliced", "½ lemon, juice only", "salt and freshly ground black pepper", "1 small bag mixed salad leaves", "1 bunch dill, picked", "1 tbsp Dijon mustard", "1 tbsp red wine vinegar", "3 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the aubergine fritters, heat the oil in a deep fat fryer to 190C or half-fill a heavy-based pan with vegetable oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous; do not leave unattended.) ", "Place a slice of aubergine onto a clean work surface. Season well with salt and freshly ground black pepper, then top each aubergine slice with a slice of mozzarella. Season once more with salt and freshly ground black pepper, then sprinkle over enough dill to cover the mozzarella.", "Top with another slice of aubergine to form a stack, then press down well. Repeat with the remaining aubergine, mozzarella and dill until all the aubergine slices, cheese and herbs are used up.", "Place the yeast, sugar, vinegar and beer into a large bowl and whisk together until smooth and beginning to bubble. Whisk in the flour to make a thick batter. Season, to taste, with salt and freshly ground black pepper.", "Dip all the aubergine and mozzarella stacks into the batter. Coat well, then carefully lower them into the hot oil, in batches. Fry for 1-2 minutes on each side, or until golden-brown and cooked through. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt.", "For the aubergine 'caviar', preheat the oven to 200C/400F/Gas 6. With a sharp knife, cut slits into the aubergines. Press pieces of the rosemary sprigs and garlic slices into the slits.", "Place the aubergines into a roasting tray and roast in the oven for one hour, or until soft. Remove and set aside to cool slightly.", "Scoop the aubergine flesh out of the skins with a spoon and place into the bowl of a food processor. Blend to a purée, then add the lemon juice and season, to taste, with salt and freshly ground black pepper.", "For the salad, place the salad leaves and dill into a bowl. Whisk the Dijon mustard, vinegar and olive oil together in a separate bowl. Add this dressing to the salad leaves and mix well.", "To serve, place a spoonful of aubergine 'caviar' onto each plate. Stack two aubergine fritters on top and pile the dressed salad alongside."]}, {"isVegetarian": true, "title": "Asparagus with scrambled duck eggs and chives", "url": "www_bbc_co_uk_food_recipes_asparaguswithscrambl_87736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch asparagus spears", "2 tbsp olive oil", "3 free-range duck eggs", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/350F/Gas 6. ", "With a sharp knife, trim any woody stalks from the asparagus spears. ", "Heat one tablespoon of the oil in an ovenproof frying pan. Add the asparagus and fry in the pan for a few minutes, before transferring to the oven to cook for 4-5 minutes until tender all the way through.", "Crack the eggs into a small bowl and add the chopped chives. Beat the eggs with the chives and salt and freshly ground black pepper to taste. ", "Heat the remaining olive oil in a small frying pan over a low-medium heat, then add the eggs and stir with a wooden spoon until the eggs are just cooked. Remove from the heat. ", "Divide the roasted asparagus between two plates. Spoon the scrambled egg next to the asparagus and serve."]}, {"isVegetarian": true, "title": "Aubergine satay skewers", "url": "www_bbc_co_uk_food_recipes_auberginesatayskewer_92178", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines, cut in half lengthways", "1-2 tsp salt", "6-8 tbsp vegetable oil", "100ml/3½fl oz vegetable oil", "225g/8oz unsalted peanuts, shells removed", "4 shallots, peeled, chopped", "2 garlic cloves, peeled, chopped", "pinch chilli powder", "½-1tsp brown sugar, to taste", "1 tbsp dark soy sauce", "400ml/14fl oz water", "1 small red chilli, finely chopped", "1 lemon, juice only", "pinch salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak four to eight wooden skewers in a bowl of water for 10 minutes, then shake off any excess moisture and set aside. ", "Thickly slice each aubergine half into half moons. Meanwhile, place the aubergine slices into a large bowl, sprinkle over the salt and drizzle over the oil. Mix well until all of the slices are coated evenly in the oil and salt. Set aside for 20 minutes.", "When the aubergines have stood for 20 minutes, heat a chargrill pan over a high heat. ", "When the pan is hot, add the aubergine slices, in batches, and griddle for two minutes on each side, or until golden-brown griddle marks appear on both sides. Remove the aubergine slices from the pan and set aside until cool enough to handle. ", "Repeat the process with the remaining slices of aubergine. ", "Thread the chargrilled aubergine slices onto the soaked wooden skewers, arranging each half moon at a different angle to the one below it to create a spiral. Set aside.", "For the satay sauce, heat 80ml/2¾fl oz of the oil in a wok over a high heat. Add the peanuts and stir-fry for 2-3 minutes, or until golden-brown. ", "Transfer the fried peanuts to a food processor and blend to a smooth paste. ", "Heat the remaining oil in a frying pan over a medium heat. Add the shallots and garlic and fry for 1-2 minutes, or until softened. ", "Add the chilli powder, brown sugar, soy sauce and water, stir well and bring the mixture to the boil.", "Add the peanut paste and chopped red chilli and stir well to combine. Bring the mixture to a simmer, then continue to simmer for 8-10 minutes, or until thickened. Stir in the lemon juice and salt. ", "To serve, arrange the aubergine skewers in four tall glasses or onto four serving plates. Serve the satay sauce in dipping bowls alongside."]}, {"isVegetarian": true, "title": "Aubergine salad with fennel and orange", "url": "www_bbc_co_uk_food_recipes_auberginesaladwithfe_91623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bulb fennel, sliced very thinly on a mandoline", "2 oranges, 1 segmented, 1 zest and juice", "50ml/2fl oz sherry vinegar", "175ml/6fl oz extra virgin olive oil", "salt and freshly ground black pepper", "1 tbsp chopped fresh tarragon", "2 aubergines, cut into wedges", "4-5 tbsp vegetable oil", "2 large naan breads, cut into 6 discs 10cm/4in in diameter", "small bunch fresh watercress leaves"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix together the fennel slices, orange segments, orange juice, orange zest, sherry vinegar and olive oil until well combined. Season, to taste, with salt and freshly ground black pepper, then add the chopped tarragon and stir well.", "Rub the aubergine wedges all over with 2-3 tablespoons of the vegetable oil. Heat a griddle pan over a medium heat. When the pan is hot, add the aubergine wedges and grill for 1-1½ minutes on each side, or until golden-brown griddle marks appear on both sides and the aubergine is tender. Set aside on a warm plate. ", "Brush the naan bread discs all over with the remaining vegetable oil. Add the naan bread to the griddle pan the aubergine was cooked in and grill for one minute on each side, or until golden-brown griddle marks appear on both sides. ", "To serve, place one griddled naan bread disc into the centre of each of six serving plates. Place a pinch of watercress leaves into the centre of each naan bread, then a portion of aubergine wedges on top. Spoon over some of the sherry vinegar dressing. Arrange small piles of the marinated fennel and orange around the naan bread and drizzle over the remaining dressing."]}, {"isVegetarian": false, "title": "Aubergine stuffed with chorizo, spinach, tomato and ricotta", "url": "www_bbc_co_uk_food_recipes_auberginestuffedwith_85210", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 aubergine, cut in half lengthways", "1 tbsp olive oil", "salt and freshly ground black pepper", "75g/2½oz chorizo", "1 tomato, finely chopped", "50g/1¾oz spinach, chopped", "75g/2½oz ricotta cheese"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Scoop some of the flesh out of the middle of the aubergine halves. Finely chop the flesh and set aside. ", "Place the aubergine halves onto a baking sheet, drizzle with half the olive oil and season well with salt and freshly ground black pepper. Transfer to the oven and roast for 8-10 minutes.", "Meanwhile, heat the remaining oil in a frying pan over a medium heat and fry the chorizo for 2-3 minutes. Add the chopped aubergine flesh and cook for 1-2 minutes. Add the tomato and spinach and cook for another minute. ", "Remove from the heat, stir in the ricotta and season well with salt and freshly ground black pepper. ", "Remove the aubergine halves from the oven, spoon the filling mixture into the aubergine halves and place back in the oven for 6-8 minutes, or until softened and golden-brown.", "To serve, place the stuffed aubergine halves onto two plates."]}, {"isVegetarian": true, "title": "Aussie olive damper bread", "url": "www_bbc_co_uk_food_recipes_aussie_olive_damper_47860", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aussie_olive_damper_47860_16x9.jpg", "ingredients": ["450g/1lb self-raising flour, plus extra for dusting", "3 sprigs rosemary, leaves only, roughly chopped", "½ tsp salt", "1 tbsp extra virgin olive oil", "75g/3oz pitted green or black olives, roughly chopped", "fruity olive oil and balsamic vinegar"], "serves": "Makes 1 loaf", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and put a baking tray in to warm up.", "Put the flour in a large bowl, with the rosemary, salt, oil and 225ml/8fl oz water. Mix everything well until the dough starts to come together in a ball. Then get your hands in and squidge all the dry bits in, using the bread like a cloth to gather the bits all up.", "Dust a clean board or work surface with a little flour and place the dough down. Squish it into a flattish round, put the olives in the centre and squash them down a bit, bringing the edges of the dough towards the centre, so that the olives are covered. Then flip the dough over and knead the olives in.", "At this point, the dough may be quite wet with olives flying all over the shop, but just keep pushing the rogue olives back into the dough. If everything is too wet, just add a small handful of flour to dough. Shape it into a 20cm/8in round and place on the warmed baking tray.", "Rub a little flour onto the handle of a wooden spoon. Then, holding the handle horizontal to the bread, press down onto the loaf making an indent almost to the bottom of the tray.", "Turn handle so that it is at a 90 degree angle to the first line and push down again to make a cross. Do this two more times so your bread looks like a kind of clock face of eight triangular portions.", "Bake in the oven for 35 minutes or until the bread sounds hollow when tapped on the bottom. This is wonderful served warm with some fruity olive oil and balsamic."]}, {"isVegetarian": true, "title": "Autumn pudding", "url": "www_bbc_co_uk_food_recipes_autumn_pudding_30736", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/autumn_pudding_30736_16x9.jpg", "ingredients": ["400g/14oz English pears (such as Conference), peeled and cut into quarters", "300g/10oz cooking apples (such as Bramley), peeled and cut into quarters", "500g/17oz ripe plums, halved, stone removed", "450g/1lb fresh blackberries", "200g/7oz caster sugar", "15g/½oz butter", "sunflower oil, for greasing", "10 thick slices white bread, crusts removed"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the fruit, sugar and butter into a saucepan and cook on a medium heat for 15 minutes, or until softened. (Don’t stir too often as the fruit will become mushy.) ", "Remove the pan from the heat and pour the contents into a colander set over a large bowl. Leave to stand for 8-10 minutes, stirring once or twice, so as much juice as possible is released by the fruit. You should end up with around 600ml/20fl oz. ", "Pour the fruit juice back into the saucepan, bring to a simmer and cook for 10-15 minutes, or until the volume of the liquid has reduced by half. Remove the pan from the heat and set aside to cool for 20-30 minutes. ", "Lightly oil a 1.5 litre/2 pint pudding basin and line with clingfilm, leaving plenty overhanging the edge. Cut a slice of bread using a round cutter and dip it quickly into the fruit juice. Place in the base of the pudding basin. ", "Cut the other bread slices in half and dip one at a time into the juice. Arrange in slightly overlapping vertical pieces around the inside of the basin, making sure they are soaked in juice without being soggy. ", "Once all the sides of the basin are lined with bread, pour half of the remaining fruit juice over the drained fruit and stir very lightly until it looks plump and glossy. Spoon the mixture into the pudding basin. ", "Dip the remaining slices of bread in the fruit juice and place over the top of the pudding, trimming the bread where necessary to give a neat finish. Reserve any remaining fruit juice in a small bowl. ", "Place the pudding onto a dinner plate. Cover the top of the pudding with the cling film, place a plate on top (make sure it fits inside the basin) and weigh down with a couple of tins. Chill in the fridge overnight.", "When ready to serve, remove the weights and plate and open the clingfilm. Place a serving plate on top of the pudding and invert. Remove the basin and peel off the cling film. Brush any gaps where white bread is showing with the reserved fruit juice."]}]