[{"ingredients": ["dash aceite de oliva", "½ cebolla, finamente rebanada", "pizca de copos de chile seco", "1 diente de ajo, picado", "¼ de pimiento rojo, picado", "4 tomates cherry, cortados por la mitad", "Guisantes rápidos de azúcar de 85g / 3oz", "1 lima, ralladura solamente", "1 cucharada de salsa de soja", "1 cucharadita de aceite de sésamo", "1 cucharada de miel", "2 cucharadas de cilantro picado fresco", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "1 filete de lubina, cortado en cubos", "150 g / 5½ oz de arroz basmati, cocido de acuerdo con las instrucciones del paquete (peso cocido)", "hojas frescas de cilantro, para servir"], "method": ["Calentar el aceite de oliva en una sartén y freír la cebolla y el chile hasta que se ablanden, luego agregar el ajo y freír durante un minuto. Agregue el pimiento rojo, los tomates cherry y las galletas de azúcar y fría por 2-3 minutos.", "Agregue la ralladura de lima, la salsa de soja, el aceite de sésamo, la miel, el cilantro y la crema. Sazonar con sal y pimienta negra recién molida y llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante diez minutos. Agregue las piezas de lubina y cocine por 2-3 minutos, o hasta que el pescado esté recién cocido.", "Cuchara el curry en tazones para servir y adornar con las hojas de cilantro. Sirve con arroz basmati."], "url": "www_bbc_co_uk_food_recipes_thaigreenseabasscurr_88784", "title": "Guiso de lubina picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 buena perilla de raíz fresca de jengibre, pelada y picada", "1-2 chiles rojos, semillas retiradas (opcional), picadas", "1-2 tallos de limoncillo, capas externas duras retiradas, toscamente picadas", "2-3 dientes de ajo, pelados", "1 puñado de cilantro fresco, algunas ramitas reservadas y picadas", "un glug o dos aceite vegetal", "1 cucharada de semillas de cilantro", "1-2 pellizca la cúrcuma molida", "bolsa pequeña de verduras", "un par de puñados de fideos de arroz", "1 x 400 ml / 14fl oz puede leche de coco", "1 gran puñado de langostinos tigre crudos pelados (los caparazones y las cabezas se pueden reservar para hacer inventario en otra receta)", "algunas salpicaduras salsa de pescado tailandés, al gusto"], "method": ["Mezcle el jengibre, el chile, la hierba de limón, el ajo y el cilantro en un procesador de alimentos hasta que esté finamente picado, agregando un poco de aceite vegetal si la pasta está demasiado seca.", "Agregue la pasta a una bandeja grande y poco profunda y cocine por unos minutos para liberar los aromas, revolviendo con frecuencia. Triturar unas semillas de cilantro con un mano de mortero y agregar a la pasta con una pizca o dos de cúrcuma y el caldo de verduras y cocine a fuego lento durante unos minutos.", "Mientras tanto, vierta un poco de agua hirviendo sobre los fideos de arroz en un bol y déjelos reposar hasta que se hayan ablandado, alrededor de 4 a 5 minutos, luego drene y reserve.", "Para suavizar el calor de la salsa, agregue la leche de coco a la sartén y vuelva a hervir. Reduzca el fuego y cocine a fuego lento durante unos minutos mientras devela los langostinos cortando a lo largo de la parte posterior de la gamba con un pequeño cuchillo afilado y retirando el \"hilo\" negro usando la punta del cuchillo. Agregue las gambas a la sartén y cocínelas durante 2-3 minutos, o hasta que estén rosadas y tiernas, terminando con salpicaduras de salsa de pescado tailandés, a su gusto, y más cilantro fresco picado, a su gusto.", "Para servir, divida los fideos escurridos entre dos tazones y cocine sobre la sopa aromática con las gambas y sirva inmediatamente. Pollo, vieiras o champiñones son una gran alternativa a los camarones."], "url": "www_bbc_co_uk_food_recipes_thaiinspirednoodleso_92377", "title": "Sopa de fideos tailandesa simple", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaiinspirednoodleso_92377_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ cebolla, picada", "3 dientes de ajo, con piel y aplastados", "2 cucharaditas de raíz de jengibre recién rallado", "1 lubina, cabeza y cola solamente", "1 tallo de limoncillo, aplastado", "400ml / 14fl oz de agua hirviendo", "3 cucharadas de ketchup de tomate", "½ cucharadita de salsa Tabasco", "100ml / 3½fl oz de leche fresca de coco", "Brócoli tenderstem 85 g / 3 oz, picado", "3 cucharadas de coco fresco rallado", "1 chile rojo, picado", "½ lima, solo jugo"], "method": ["Caliente el aceite en una sartén y fríe con cuidado la cebolla, el ajo y el jengibre durante 3-4 minutos, o hasta que se ablanden. Agregue la cabeza y la cola del pescado y la hierba de limón, revuelva para cubrir el aceite, luego vierta sobre el agua hirviendo y cocine a fuego lento durante 6-8 minutos.", "Cuele la mezcla a través de un colador en una sartén limpia, luego agregue el ketchup, la salsa de Tabasco y la leche de coco y cocine a fuego lento durante 2-3 minutos más. Agregue el brócoli, el coco rallado, el chile y el jugo de lima y cocínelos durante 3-4 minutos, o hasta que el brócoli esté tierno.", "Cucharee en tazones y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_thailemongrassandchi_90103", "title": "Sopa de verduras Thai lemongrass y chili", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paquete de 250 g de fideos de huevo medianos", "1 cucharadita de aceite de sésamo", "2 cucharaditas de salsa de soja", "1 cucharadita de galanga pelada y finamente rallada", "2 chiles rojos a la vista de pájaro picados", "2 cucharaditas de albahaca fresca picada", "1 cucharadita de cilantro fresco picado", "1 lima, solo jugo", "1 cucharadita de miel clara", "1 cucharadita de semillas de sésamo"], "method": ["Cocine los fideos de acuerdo con las instrucciones del paquete.", "En un tazón grande mezcle los ingredientes restantes.", "Escurra y mezcle los fideos en la mezcla tailandesa.", "Servir."], "url": "www_bbc_co_uk_food_recipes_thainoodles_66007", "title": "Fideos tailandeses", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 400 g / 14 oz de leche de coco de estaño", "1 cucharada de aceite de girasol o maní", "2 cucharadas de pasta de curry rojo preparado", "3 cucharadas de mantequilla de maní crujiente", "300ml / 10½fl oz de caldo de verduras", "3 cucharadas de salsa de pescado, más más a gusto", "1 cucharada de azúcar moreno", "250g / 8¾oz de fideos de arroz medianos", "Maíz dulce de bebé de 150g / 5¼ oz, cortado en rodajas en ángulo", "150g / 5¼oz de brócoli, cortado en pequeños floretes", "Mangetout de 150 g / 5¼ oz, cortado por la mitad en ángulo", "50 g / 1¾oz de cebollas de primavera, cortadas en ángulo", "Cacahuetes sin sal tostados 100g / 3½oz, toscamente picados", "2 cucharadas de albahaca rasgada o cilantro picado", "sal y pimienta negra recién molida"], "method": ["Si la leche de coco se ha dividido en dos partes (acuosas y gruesas), sepárela cubriendo cuidadosamente la parte gruesa y vertiendo la parte acuosa en una jarra pequeña; poner ambos a un lado.", "Caliente un wok o una sartén grande a fuego medio hasta que esté caliente, agregue el aceite y la parte gruesa de la leche de coco (si la leche de coco no se ha separado en dos partes, agregue toda la leche de coco en esta etapa).", "Revuelva esto a fuego medio hasta que la leche de coco comience a separarse y espese.", "Agregue la pasta de curry y la mantequilla de maní y mezcle para combinar. Luego agregue el caldo, la salsa de pescado y el azúcar morena y deje que hierva.", "Coloque los fideos en un recipiente y cúbralos con agua hirviendo. Deje que se ablanden durante cinco minutos, luego drene.", "Mientras tanto agregue el maíz dulce y el brócoli al wok o sartén y cocine, destapado por un minuto. Agregue el mangetout y la cebolla tierna, y cocine durante 1-2 minutos más hasta que los vegetales estén tiernos.", "Mezcle la mitad de los cacahuates picados y la mitad de la albahaca o el cilantro con las verduras y la salsa. Sazone con sal y pimienta negra recién molida, y agregue más salsa de pescado si desea que esté un poco más salado.", "Finalmente, agregue los fideos drenados y revuelva para combinar.", "Coloque en un tazón grande y cálido, o tazones individuales. Esparce con los cacahuetes y hierbas restantes y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_thaipeanutvegetablea_85256", "title": "Tailandés de maní, vegetales y fideos de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-5", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz cartón de crema de coco", "1 cucharada colmada de pasta de curry verde tailandesa", "2 cucharaditas de azúcar mascabado", "½ lima, solo jugo", "2 cucharaditas de salsa de pescado tailandés o salsa de soja ligera", "800g / 1¾lb de carne de cerdo magra (los filetes son particularmente tiernos o puede usar filetes de cerdo o chuletas gruesas sin hueso)", "3 cebollas rojas medianas, cortadas en 12-18 cuñas", "3 limas, cortadas en 12 cuñas"], "method": ["Mezcle la crema de coco, la pasta de curry, el azúcar, el jugo de limón y el pescado o la salsa de soja en un recipiente no metálico. Corte la carne de cerdo en cubos de aproximadamente 2,5 cm / 1 in y mezcle con la salsa. Deje marinar en la nevera durante la noche o durante aproximadamente 2 horas a temperatura ambiente, revolviendo cada cierto tiempo.", "Para preparar los kebabs, inserte pedazos de carne de cerdo en seis brochetas largas de metal, alternando con cebolla roja y rodajas de lima hasta que todo se haya agotado.", "Coloque los kebabs sobre carbones de fuego medio durante aproximadamente 10 minutos, cepillándolos generosamente con cualquier adobo durante los primeros 5 minutos, y volteándolos de vez en cuando hasta que estén dorados y suculentos."], "url": "www_bbc_co_uk_food_recipes_thaiporkkebabs_67596", "title": "Kebabs de cerdo tailandés", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 6 kebabs", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaiporkkebabs_67596_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chalota grande, más o menos picada", "Galangal de 3 cm / 1,2 en pieza, pelado y toscamente picado", "2 chiles con ojos de ave, sin semillas, picados", "3 dientes de ajo", "2 hojas de lima Kaffir, más o menos picadas", "1 cucharada de salsa de soja", "2 cucharadas de salsa de pescado", "1 cucharadita de pasta de camarones (blachan)", "4 cucharadas de puré de tomate", "1 cucharada de pimentón", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "½ cucharadita de canela molida", "½ cucharadita de cúrcuma", "¼ cucharadita de nuez moscada molida", "¼ cucharadita de clavo de olor molido", "1 cucharada de aceite de maní", "250 g / 9 oz de filete de res, en rodajas finas", "Leche de coco 400ml / 14fl oz", "1-2 cucharadas de salsa de pescado", "1 lima, solo jugo", "pequeñas hojas de albahaca tailandesa, toscamente desgarradas", "300g / 11oz de arroz jazmín tailandés, al vapor"], "method": ["Para la pasta, coloque todos los ingredientes de la pasta en un procesador de alimentos o mortero y mezcle (o muela) para obtener un puré suave.", "Para el curry, caliente el wok hasta que esté caliente, agregue el aceite y la carne de res y saltee hasta que se dore. Agregue la pasta y cocine durante 1-2 minutos. Vierta la leche de coco, hierva y cocine a fuego lento durante 2-3 minutos.", "Agregue la salsa de pescado y el jugo de lima al curry, al gusto.", "Vierte el sofrito en tazones y cúbrelo con las hojas de albahaca tailandesa. Sirve con el arroz jazmín tailandés."], "url": "www_bbc_co_uk_food_recipes_thairedpenangcurry_90828", "title": "Curry panang de carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de leche de coco", "1 cebolleta, finamente cortada", "1 palo de limon y picado", "Filete de salmón 125 g / 4½ oz, en rodajas", "pequeño cilantro fresco", "sal y pimienta negra recién molida"], "method": ["Coloque la leche de coco, la cebolleta y el limoncillo en una olla pequeña y deje que hierva a fuego lento.", "Agregue el salmón y cocine durante 1-2 minutos. Agregue el cilantro, sal y pimienta negra recién molida", "Servir inmediatamente vierte en un plato de sopa."], "url": "www_bbc_co_uk_food_recipes_thaisalmonandlemongr_86285", "title": "Caldo de limón y salmón tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "150g / 5oz de langostinos, cortados por la mitad", "150g / 5oz de calamar, cortado en tiras", "150g / 5oz de carne de cangrejo", "1 cucharada de aceite de sésamo tostado", "2 cucharadas de salsa de chile dulce", "1 cucharada de salsa de pescado tailandés (nam pla)", "2 cucharadas de jugo de lima", "1 cucharada de miel clara", "2 chiles rojos, finamente cortados", "2 cucharadas de cilantro fresco picado", "1 cucharada de hojas de menta fresca picadas", "2 cucharadas de semillas de sésamo", "4 hojas frescas de lima kaffir, muy finamente trituradas", "3 cabezas de achicoria, hojas separadas para darle aproximadamente 30 \"botes\" aseados para el relleno"], "method": ["Calentar una sartén hasta que esté caliente, luego agregar el aceite y sofreír las gambas durante 1-2 minutos. Luego agregue el calamar y cocine por un minuto más. Agregue la carne de cangrejo y caliente. Retirar del fuego y colocar en un recipiente.", "Combine todos los demás ingredientes, excepto la achicoria, y vierta en los mariscos. Revuelva suavemente y deje macerar durante 30 minutos.", "Para servir, escurrir los mariscos de cualquier exceso de líquido y dividir la mezcla entre los barcos de achicoria."], "url": "www_bbc_co_uk_food_recipes_thaiseafoodsaladandc_82324", "title": "Ensalada de mariscos tailandeses y achicoria", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 30 canapés", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 250 g / 9oz de filetes de lubina, con piel", "6 cucharadas de maní, asadas", "Jengibre fresco de raíz de 10cm / 4in, pelado, más o menos picado", "2 dientes de ajo, pelados, toscamente picados", "gran manojo de albahaca sagrada, solo (disponible en comestibles asiáticos)", "6 cucharadas de aceite vegetal", "1½ limas, solo jugo", "2 dientes de ajo, pelados, aplastados", "1 cucharada de jengibre fresco de raíz finamente rallado", "3 cucharadas de salsa de pescado", "3 chiles rojos, finamente picados", "4 maracuyá, solo pulpa", "250g / 9oz de fideos de arroz secos", "½ coco fresco, cáscara removida, carne cortada finamente en una mandolina o usando un pelador de vegetales", "4 cebolletas, finamente cortadas", "gran manojo de albahaca santa, solo hojas"], "method": ["Para la lubina, marque ligeramente la piel de la lubina con la punta de un cuchillo afilado.", "Coloque todos los ingredientes de lubina restantes, a excepción del aceite vegetal, en un mortero y machaque con un mortero hasta que la mezcla se una para formar una pasta áspera.", "Agregue todas las cucharadas menos del aceite a la pasta y vuelva a batir hasta que estén bien combinadas. Frote la mezcla sobre los filetes de lubina, colóquela en un recipiente tapado y deje enfriar en la nevera durante al menos una hora.", "Calentar una sartén y agregar el aceite vegetal restante. Freír los filetes de lubina, con la piel hacia abajo, durante 2-3 minutos en ambos lados, o hasta que estén cocidos. Retire el pescado de la sartén y déjelo reposar en un plato caliente.", "Para el aderezo, coloque todos los ingredientes del aderezo excepto la fruta de la pasión en un procesador de alimentos y mezcle hasta que quede suave. Agregue la pulpa de la fruta de la pasión.", "Para la ensalada, vierta agua hirviendo sobre los fideos en un recipiente y déjelos en remojo durante cinco minutos, o hasta que se ablanden. Escurrir, luego refrescar en agua fría. Rocíe más de dos tercios del aderezo y mezcle bien para cubrir, luego agregue todos los ingredientes restantes de la ensalada y mezcle bien.", "Para servir, divida la ensalada de fideos de arroz entre cuatro platos para servir. Coloque un filete de lubina en la parte superior de cada montón de ensalada de fideos de arroz, luego rocíe el aderezo restante alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_thaiseabasswithholyb_91552", "title": "Lubina tailandesa con ensalada de fideos de arroz de albahaca", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cebollas tiernas, finamente picadas", "1 chile rojo, finamente picado", "2 dientes de ajo, finamente picados", "100 g de cacahuetes salados", "500 g / 1 libra de carne de cerdo o carne picada magra de 2 onzas", "cilantro fresco de racimo grande, picado", "1 lima, cáscara y jugo solamente", "salsa de chile dulce y pepino en rodajas para servir", "sal y pimienta negra molida"], "method": ["Si tiene un procesador de alimentos coloque las cebolletas, el chile, el ajo y los cacahuetes en el bol y procese hasta que estén finamente picados.", "Incline en un tazón y mezcle bien con la carne de cerdo o de res, cilantro, cáscara y jugo de limón y un montón de condimentos.", "Forme la mezcla en hamburguesas y si tiene tiempo de enfriamiento hasta que esté listo para cocinar.", "Cuando los carbones estén a temperatura media, coloque las hamburguesas en la barbacoa cerca de las brasas y cocine durante 3-4 minutos por cada lado.", "Cepille rebanadas de pan crujiente con un poco de aceite y colóquelo en una barbacoa para brindar.", "Sirve las hamburguesas con el pan tostado y un poco de pepino en rodajas y salsa de chile dulce."], "url": "www_bbc_co_uk_food_recipes_thaispicedburgers_70173", "title": "Hamburguesas con especias tailandesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 400 ml / 14 fl oz puede leche de coco sin azúcar", "1 cucharada sopera de pasta de curry roja", "300ml / 10½fl oz de caldo de pollo", "Mejillones de 2 kg / 4½ lb, limpios y sin barba (deseche los mejillones que no se cierren herméticamente cuando se golpean)", "1 chile rojo, finamente cortado", "2 dientes de ajo, aplastados hasta formar una pasta con el filo de un cuchillo", "2 cebollas de primavera, cortadas, finamente cortadas", "2 cucharadas de cilantro fresco tostado"], "method": ["Vierta un poco de la leche de coco en un tazón. Agregue la pasta de curry y bata hasta que estén bien combinados. Agregue la leche de coco restante, poco a poco, luego agregue el caldo de pollo, batiendo hasta que todo el líquido se haya incorporado a la mezcla.", "Caliente una sartén con tapa, lo suficientemente grande como para contener aproximadamente el doble de la cantidad de mejillones que tenga, a fuego alto.", "Agregue los mejillones, luego la mezcla de leche de coco. Cubra la olla con una tapa y lleve el líquido a ebullición. Continuar a vapor los mejillones durante 2-3 minutos.", "Agregue el chile y el ajo y revuelva los mejillones con cuidado. Continúe hirviendo durante 1-2 minutos o hasta que la mayoría de los mejillones se hayan abierto (deseche los mejillones que no se hayan abierto durante la cocción).", "Para servir, divida los mejillones y el líquido de cocción por igual entre cuatro tazones para servir. Espolvoree sobre las cebolletas picadas y el cilantro."], "url": "www_bbc_co_uk_food_recipes_thaispicedsteamedmus_92026", "title": "Mejillones al vapor con especias tailandesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de pasta de curry rojo tailandés", "Filetes de pescadilla 100 g / 3½ oz", "dash aceite de oliva", "dash aceite de oliva", "½ cebolla, pelada, finamente picada", "1 diente de ajo, finamente picado", "1 tomate fresco, picado", "1 cucharadita de azúcar morena suave", "pizca de copos de chile", "2 cucharaditas de vinagre de vino tinto", "sal y pimienta negra recién molida", "1 cucharada de cada albahaca fresca picada, menta y cilantro", "½ limón, cortado en rodajas, para adornar", "ramita de perejil fresco, para adornar"], "method": ["Para la pescadilla con especias tailandesas, extiende la pasta de curry en los filetes de pescadilla. Calentar el aceite de oliva en una sartén, agregar la merluza y freír durante dos minutos por cada lado.", "Para el chutney de tomate, caliente el aceite de oliva en una cacerola pequeña, agregue la cebolla y fríasela suavemente durante cuatro minutos, o hasta que se ablande. Agregue el ajo y fría por un minuto. Agregue el tomate picado, el azúcar moreno, el chile, el vinagre de vino tinto y sazone al gusto con sal y pimienta negra recién molida. Cocine a fuego lento durante 4-5 minutos. Agregue las hierbas.", "Para servir, vierta la salsa picante de tomate en un plato para servir, cubra con la merluza especiada y adorne con rodajas de limón y perejil."], "url": "www_bbc_co_uk_food_recipes_thaispicedwhitingwit_88156", "title": "Merluza con especias tailandesas y salsa picante de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de cilantro, lavado", "12 hojas de menta", "1 cucharadita de jengibre fresco picado", "3 dientes de ajo, aplastados", "1 cucharadita de sal", "1 chile rojo grande, finamente picado", "jugo de 2 limas", "1 cucharada de nam pla (salsa de pescado)", "2 x 175 g / 6 oz de filetes de salmón", "4 bok choi, cortado por la mitad longitudinalmente", "arroz basmati, lavado en agua fría hasta que el agua corra limpia", "1 guindilla, finamente rebanada", "1 manojo de cilantro, más o menos picado", "pizca de sal", "1 lima, cortada en cuñas"], "method": ["En un procesador de alimentos mezcle las hojas de cilantro y los tallos, las hojas de menta, el jengibre, el ajo, la sal, el chile, el jugo de lima y la salsa de pescado y el proceso hasta que quede suave.", "Coloque los filetes de salmón en un plato poco profundo y vierta más de la mitad de la salsa. Dejar macerar durante 20 minutos.", "Vierta el arroz en una olla de agua hirviendo y cocine de acuerdo con las instrucciones del paquete.", "Encienda el barco de vapor y coloque el bok choi en la capa inferior. Coloque los filetes de salmón marinado en la mitad superior del vapor y cocine durante 6-8 minutos hasta que el pescado esté recién cocido y el bok choi esté tierno.", "Escurra el arroz y revuelva a través de la rodaja de chile y cilantro picado. Sazonar con sal y dividir entre platos para servir.", "Retire el salmón y el bok choi del vaporizador y colóquelo encima del arroz. Vierta la salsa reservada sobre el salmón y sirva inmediatamente con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_thaisteamedsalmon_7254", "title": "Salmón al vapor tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaisteamedsalmon_7254_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pequeño racimo de cilantro, lavado", "12 hojas de menta, lavadas", "½ cucharadita de sal", "2 dientes de ajo, aplastados", "2 chiles verdes, sin semillas y picados", "3 cucharadas de jugo de lima fresco", "1 cucharada de azúcar en polvo de oro", "1 cucharadita de jengibre pelado y picado", "1 cucharada de salsa de pescado (nam pla)", "4 x 125 g / 4½ oz de filetes de salmón", "4 cabezas pak choi", "Fideos de arroz 100 g / 3½ oz", "1 diente de ajo, finamente picado", "2 cucharadas de salsa de soja", "2 cucharadas de miel", "Jengibre de 5 cm / 2 en pieza, finamente picado", "200ml / 7fl oz de caldo de pollo"], "method": ["En un procesador de alimentos mezcle las hojas y tallos de cilantro, hojas de menta, sal, ajo y chiles para hacer una pasta áspera. Agregue el jugo de lima, el azúcar impalpable, el jengibre y la salsa de pescado y procese hasta que quede bastante suave.", "Coloque la salsa en un tazón a prueba de calor y combine con el salmón, luego marinado durante 20 minutos.", "Hervir un poco de agua en la mitad inferior de un barco de vapor.", "Coloque el recipiente con el salmón marinado en la parte superior y deje hervir durante 6-8 minutos.", "Blanquee el pak choi y los fideos de arroz durante 1-2 minutos en agua con sal hirviendo, luego drene y coloque en un tazón.", "Agregue el ajo, la salsa de soya, la miel, el jengibre y el caldo de pollo y revuelva para combinar.", "Sirve con el salmón al vapor."], "url": "www_bbc_co_uk_food_recipes_thaisteamedsalmonwit_74781", "title": "Salmón al vapor tailandés con fideos de arroz y pak choi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 cucharada de pasta de curry suave, de un tarro", "4 pechugas de pollo, deshuesadas y sin piel, cortadas en tiras", "250ml / 9fl oz de leche de coco baja en grasa", "1 cucharada de salsa de pescado tailandés (nam pla)", "2 cebollas medianas, en rodajas", "2 pimientos verdes, sin corazón y sin semillas, cortados en tiras", "paquete de brotes de bambú fresco", "1 cucharada de albahaca fresca picada"], "method": ["Caliente el aceite en un wok a fuego alto. Agregue la pasta de curry y saltee por un minuto.", "Agregue el pollo y saltee con la pasta de curry durante 1-2 minutos, hasta que se dore.", "Agregue la leche de coco, la salsa de pescado, las cebollas y los brotes de bambú y cocine a fuego lento sin tapar durante unos diez minutos, o hasta que el pollo esté bien cocido.", "Agregue la albahaca y sirva en tazones de inmediato."], "url": "www_bbc_co_uk_food_recipes_thaistylechickencurr_83844", "title": "Curry al estilo tailandés de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 granos de pimienta negra", "1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "5 chiles rojos, semillas retiradas, picadas", "2 chalotes, picados", "1 cucharada de ajo machacado", "Raíz fresca de jengibre de 2.5cm / 1in, pelada y picada", "3 tallos de limoncillo, picados", "6 hojas de lima kaffir", "pellizcar canela molida", "pizca de cúrcuma", "Salsa de pescado tailandés splash (nam pla)", "aceite de chile splash (disponible en supermercados más grandes)", "1 cucharada de azúcar de palma (disponible en los supermercados asiáticos, sustituya el azúcar moreno si no está disponible)", "4 pechos de pato", "250ml / 8fl oz de caldo de pollo", "400ml / 14fl oz de lata de leche de coco", "sal y pimienta recién molida", "8 cebolletas, finamente cortadas", "1 pimiento rojo, semillas eliminadas, en rodajas", "16 berenjenas para bebés, partidas a la mitad y en forma de cuadrícula (opcional para planchar)", "Arroz tailandés pegajoso, cocinado según las instrucciones del paquete", "hojas de cilantro fresco, picado", "1 lima, cortada en cuñas"], "method": ["Para la pasta de especias, fría los granos de pimienta, las semillas de comino y las semillas de cilantro en una sartén sin aceite durante 4-5 minutos, para liberar los sabores. Transfiera las especias a una mano de mortero y triture.", "Coloque las especias molidas en un procesador de alimentos y agregue el chile, los chalotes, el ajo, el jengibre, el limoncillo, las hojas de lima, la canela, la cúrcuma, la salsa de pescado, el aceite de chile y el azúcar de palma y mezcle hasta conseguir una pasta homogénea.", "Para el pato, marque la piel de las pechugas de pato, sazone con sal y coloque en una sartén fría. Cocine a fuego medio, vertiendo la grasa en un recipiente resistente al calor a medida que se libera del pato. (Puede guardar la grasa del pato si desea asar las papas.) Cocine la pechuga durante cinco minutos, luego voltee y dore ligeramente el otro lado. Retire el pato del fuego y manténgalo caliente.", "Mientras tanto, coloca una buena cucharada de pasta en la misma sartén y cocina a fuego lento hasta que esté fragante.", "Agregue el caldo y la leche de coco y deje que hierva.", "Cortar finamente los pechugas de pato y sazonar con sal y pimienta negra recién molida. Agregue las rodajas de pato a la sartén y cocine a fuego lento durante 2-3 minutos.", "Agregue las cebolletas, el pimiento rojo y las berenjenas y cocínelas durante cinco minutos, o hasta que las berenjenas estén blandas y el pato esté completamente cocido.", "Para servir, coloca un montículo de arroz en cada uno de los cuatro platos. Ponga porciones iguales de curry de pato y adorne con cilantro picado y trozos de lima."], "url": "www_bbc_co_uk_food_recipes_thaistyleduckredcurr_85145", "title": "Curry rojo de pato al estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de pasta de curry rojo listo de un tarro", "1 huevo de gallinas camperas", "Filete de abadejo de 300 g / 10½ oz, sin piel, cortado en trozos", "2 cucharadas de salsa de pescado (nam pla)", "1 cucharadita de azúcar", "2 cucharadas de harina de maíz", "3 hojas de lima, finamente cortadas", "1 cucharada de hojas de cilantro fresco picado", "10 judías verdes, finamente picadas", "harina, para quitar el polvo", "aceite vegetal, para freír", "60ml / 2fl oz de agua", "75ml / 2½fl oz de vinagre de arroz", "50 g / 2 oz de azúcar", "1 diente de ajo, finamente picado", "1 pepino, pelado y finamente picado", "4 chalotes, finamente picados", "1 cucharada de jengibre fresco y picado", "berro, lavado y escurrido"], "method": ["Coloque la pasta de curry, el huevo y el filete de colín en un procesador de alimentos y pulse hasta que quede suave.", "Coloque la mezcla de colín en un recipiente y agregue la salsa de pescado, el azúcar, la harina de maíz, las hojas de lima, el cilantro y las judías verdes. Mezclar bien.", "Con las manos enharinadas, moldee cantidades iguales de la mezcla de pastel de pescado en pasteles de pescado de aproximadamente 7.5cm de diámetro (usted debería poder hacer 6-8 croquetas de pescado).", "Llene a la mitad una sartén profunda de base pesada con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue las croquetas de pescado en tandas y fríelas durante 5-6 minutos, hasta que estén crujientes y doradas. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa de inmersión, coloque el agua, el vinagre y el azúcar en una sartén no reactiva a fuego medio y deje que hierva. Revuelva hasta que el azúcar se haya disuelto, luego retírelo del fuego y déjelo enfriar.", "Una vez frío, agregue el ajo, el pepino, el chalote y el jengibre. Mezcle bien, luego vierta en un tazón de servir.", "Para servir, coloque un poco de berro en un plato grande y cubra con las croquetas de pescado. Sirva la salsa de inmersión al costado."], "url": "www_bbc_co_uk_food_recipes_thaistylefishcakes_88722", "title": "Tartas de pescado de estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de pescado (como salmón, eglefino, bacalao, perlón o merlán)", "sal marina", "1 cucharada de aceite de oliva, para lloviznar", "4 cucharadas de aceite vegetal o aceite de oliva, para freír", "harina, para dragado", "3-4 hojas de lima", "1 chile rojo grande", "4 cm / 1½ en pieza de raíz fresca de jengibre", "2 dientes de ajo", "2 tallos de limoncillo", "Papas de 200g / 7oz, cocidas, machacadas y enfriadas (alrededor de dos papas medianas)", "2 cucharaditas de salsa de pescado, o al gusto", "pequeño puñado de cilantro fresco, raíz incluida", "1 lima, solo jugo o al gusto", "cuñas de lima frescas", "salsa de chile dulce lista para usar, para mojar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6. Piel del pescado y eliminar los huesos.", "Coloque el pescado en una bandeja para hornear y sazone con sal marina y rocíe con aceite de oliva. Asar durante 7-8 minutos, luego retirar del horno y enfriar.", "Mientras el pescado se tuesta, prepare los ingredientes aromatizantes. Cortar finamente las hojas de lima.", "Corta el chile por la mitad y quita las semillas. Cortar finamente.", "Pele el jengibre y pique finamente.", "Triture ligeramente los dientes de ajo con el lado plano de la hoja de un cuchillo, luego pele y pique finamente.", "Aplastar los tallos de limoncillo con un cuchillo pesado. Recorte el extremo de la raíz y descarte las hojas exteriores duras. Cortar finamente.", "Picar las hojas de lima, chile, jengibre y hierba de limón en una tabla de cortar hasta que todos los ingredientes estén muy finamente picados.", "Coloque los ingredientes finamente picados en un tazón grande. Agregue el puré de papa y una pizca de salsa de pescado.", "Rompe el pescado enfriado y agrégalo al bol. Mezcle bien los ingredientes.", "Pica finamente el cilantro y agrégalo al bol con un chorrito de jugo de lima. Mezcle bien.", "Caliente el aceite vegetal o el aceite de oliva en una sartén antiadherente. Forme la mezcla de pescado en pequeños pasteles de unos 6cm-8cm / 2.5in-3in de ancho.", "Dragar las croquetas de pescado en la harina para cubrir, sacudiendo el exceso. Freír las croquetas de pescado en el aceite caliente durante 3-4 minutos por cada lado hasta que estén ligeramente doradas.", "Sirva las croquetas de pescado con una pizca de lima fresca y salsa de chile dulce para mojar."], "url": "www_bbc_co_uk_food_recipes_thaistylefishcakes_90298", "title": "Tartas de pescado de estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thaistylefishcakes_90298_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ frío rojo, semillas eliminadas, más o menos picadas", "1 diente de ajo, aproximadamente picado", "5 cucharadas de hojas frescas de cilantro", "2 cucharadas de anacardos", "Filete de salmón 100g / 3½ oz", "harina común, para quitar el polvo", "2-3 cucharadas de aceite de sésamo", "150ml / 5fl oz de aceite vegetal", "Fideos de arroz delgados 55 g / 2 oz", "Mangetout 100g / 3½ oz, picado por la mitad a lo largo", "½ chile rojo, sin semillas y finamente picado", "½ diente de ajo, finamente picado", "1 puñado de hojas de menta fresca, toscamente picada", "1 puñado de cilantro fresco, toscamente picado"], "method": ["Para las croquetas de pescado, coloque todos los ingredientes de la torta de pescado, excepto la harina y el aceite de sésamo, en un procesador de alimentos y mezcle con una pasta gruesa. Retire la mezcla de la torta de pescado de la licuadora y divídala y déle la forma de cuatro pasteles de pescado del mismo tamaño y polvillo con harina.", "Caliente el aceite de sésamo en una sartén grande a fuego medio. Agregue las croquetas de pescado y fría por 2-3 minutos por cada lado, hasta que estén doradas y cocidas.", "Para la ensalada, caliente el aceite vegetal en una cacerola profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado agregue los fideos de arroz en el aceite caliente y fría hasta que estén crujientes y dorados. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Coloque el mangetout, el chile, el ajo, la menta y el cilantro en un bol y mezcle bien.", "Para servir, divida la ensalada entre dos platos. Coloque un puñado de fideos crujientes encima de cada uno y agregue dos croquetas de pescado a cada una."], "url": "www_bbc_co_uk_food_recipes_thaistylefishcakeswi_84532", "title": "Tarta de pescado al estilo tailandés con ensalada mangetout", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]