[{"isVegetarian": false, "title": "Tandoori breast of pigeon, black lentils, kachumber salad and naan bread", "url": "www_bbc_co_uk_food_recipes_tandoori_breast_of_squab_58130", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz black gram urad lentils, soaked in lukewarm water overnight", "2½ litres/4½ pints water", "1 tsp ginger paste", "1 tsp garlic paste", "1 tsp salt", "1½ tsp red chilli powder", "2 tbsp tomato purée", "150g/5oz slightly salted butter", "1 tsp garam masala ", "1 tsp ground dried fenugreek leaves", "½ tsp sugar", "50ml/2fl oz single cream", "35g/1¼oz sugar", "2 free-range eggs", "400ml/14fl oz full-fat milk", "750g/1lb 11oz plain flour", "1 tbsp salt", "50ml/2fl oz vegetable oil", "1½ tsp baking powder", "2 tbsp chopped fresh coriander and garlic", "2 tbsp black onion seeds", "3 tbsp melted butter", "2 pigeon breasts, de-boned and skinned", "2 tsp ginger-garlic paste", "1/3 tsp salt", "1 tsp Kashmiri red chilli powder", "½ lemon, juice only", "½ tsp cumin seeds", "4 cloves", "1 tbsp yoghurt", "1 pinch sugar", "½ tsp garam masala", "1 tbsp vegetable oil", "15cm/6in piece cucumber, finely diced", "1 tomato, seeds removed, chopped", "1 red onion, finely diced", "½ lemon, juice only", "1 pinch salt  ", "1 pinch sugar"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the black lentils, boil the soaked lentils in the water in a large saucepan until the lentils are thoroughly cooked but are not completely mashed – about one hour.", "Add the ginger, garlic, salt and red chilli powder and simmer for another 10 minutes. ", "Add the tomato purée and butter and cook for further 15 minutes, or until the lentils are thick. Take care that the butter does not separate from the lentils.", "Add the garam masala, dried fenugreek leaves and sugar. Taste and add salt and freshly ground black pepper if necessary, then whisk in the cream. Keep warm.", "For the naan bread, preheat the oven to 225C/450F/Gas 8 and place a thick baking tray into the oven to heat.", "Whisk together the sugar, eggs and milk in a mixing bowl. In a separate bowl, combine the flour, baking powder and salt.", "Add the milk mixture to the flour mixture and knead lightly to make a soft dough - take care not to work the dough too much or it will become too stretchy. ", "When all the ingredients are mixed thoroughly, cover with a damp cloth and leave to rest, in a warm place, for 15 minutes. ", "Once rested, pour over the oil and knock the air out of the dough.", "Divide the dough into 16 equal-sized balls and roll out into a circle of approximately 10cm/4in diameter.", "Spread the circles on the hot tray in the oven, scatter the onion and coriander over half of the naan and the black onion seeds over the other half. Bake for 4-5 minutes - you might need to turn the bread to ensure it is all cooked. You will also most likely need to cook the bread in batches. Brush with melted butter.", "Marinade the squab pigeon while the dough is resting: pat the pigeon breasts dry with kitchen paper, then place them in a bowl with the ginger-garlic paste, salt, chilli powder and lemon juice.", "Dry fry the cumin and cloves lightly in a hot frying pan and crush coarsely using a mortar and pestle. ", "Mix the cumin and clove mixture with the yoghurt, sugar, garam masala and oil to make a second marinade. ", "Add the yoghurt marinade to the breasts and set aside for 10-15 minutes. Heat a tandoor to 250-300C/480F-570F (or alternatively preheat the oven to 200C/400F/Gas 6).", "Thread the meat onto skewers and cook in the tandoor for 4-5 minutes. Alternatively, fry the breasts in a very hot pan for about one minute each side and then place in the oven to cook for five minutes.", "Remove the meat from the skewers, leave to rest for a couple of minutes and serve immediately.", "For the kachumber salad, mix all the ingredients together in a bowl. ", "To serve, cut the breasts into two lengthways. Spoon the black lentils onto a plate and arrange the pigeon breasts on top. Place the salad and naan bread alongside. "]}, {"isVegetarian": false, "title": "Tandoori chicken lollipop drumsticks with raita dip", "url": "www_bbc_co_uk_food_recipes_tandoori_chicken_62227", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_chicken_62227_16x9.jpg", "ingredients": ["12 chicken drumsticks (leg and thigh meat), skin removed", "300ml/10½fl oz plain yoghurt", "1 tsp garam masala", "1 tsp ground cumin", "1 tbsp chilli powder", "½ tsp ground turmeric", "½ tsp ground cinnamon", "5cm/2in piece fresh root ginger, skin on, finely grated", "1 garlic clove, finely chopped", "1 lemon, juice only", "1 green chilli, finely chopped", "1 garlic clove, finely chopped", "½ cucumber, skin and seeds removed, finely diced", "½ tsp ground cumin", "2 tbsp finely chopped fresh mint leaves", "2 tbsp finely chopped fresh coriander leaves", "200ml/7fl oz plain yoghurt", "1 lime, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 4 as a main or 6 as a starter", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the drumsticks, using the heel of a heavy knife, chop through the top of the chicken drumsticks at the joint, to take the knuckle off. ", "Turn each drumstick upside-down and chop the bottom of the bone off, then push the meat down towards the bottom of the bone so that it looks like a little ball at the bottom of the drumstick. Using a pair of tweezers, pull the tendons from the bone and discard. Set the drumsticks aside.", "In a bowl, stir 100ml/3½fl oz of the yoghurt with all of the remaining drumstick ingredients until well combined. Add the remaining yoghurt and mix through. ", "Add the drumsticks to the yoghurt marinade and wiggle them around until they are completely coated in the marinade. Cover the bowl with cling film and chill in the fridge for at least 4 hours, or overnight.", "When the drumsticks have marinated, preheat the oven to 200C/180C Fan/Gas 6.", "Remove the drumsticks from the marinade, shaking off any excess. Sit them bone upright on a baking tray, then roast in the oven for 10-15 minutes, or until the marinade has browned and the chicken is cooked through at its thickest part and no trace of pink remains.", "Meanwhile, for the raita, in a bowl, mix together the chilli, garlic and cucumber. ", "Stir in the cumin, mint and coriander. ", "Add the yoghurt and lime juice, stir well, and season, to taste, with salt and freshly ground black pepper. Chill in the fridge until ready to serve.", "To serve, pile the drumsticks onto a large serving plate, bones facing upwards. Spoon the raita into a bowl and place it alongside for everyone to serve themselves. "]}, {"isVegetarian": false, "title": "Tandoori chicken party skewers", "url": "www_bbc_co_uk_food_recipes_tandoori_chicken_party_86717", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_chicken_party_86717_16x9.jpg", "ingredients": ["450g/1lb chicken thigh fillets, trimmed of fat and each one cut into 4 strips", "75g/2½oz plain yoghurt", "2 tbsp tikka spice curry blend ", "small bunch fresh coriander, chopped (optional)", "lime wedges, to serve"], "serves": "Makes 15 skewers", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the chicken strips, yoghurt and tikka paste together in a bowl. Cover with cling film and set aside in the fridge to marinate for 20 minutes, or up to 4 hours. Soak the bamboo skewers in water for at least 20 minutes.", "Preheat the oven to 220C/200C Fan/Gas 7. Place 2 baking trays in the oven to preheat.", "Thread 1 or 2 strips of chicken onto each skewer, not too tightly as this may cause uneven cooking. Place the chicken skewers onto the preheated baking trays, spaced well apart and bake for 20 minutes, turning half-way through. You may need to tip some cooking juices out of the baking tray when you turn them so that the skewers brown up nicely.", "Check that the chicken is completely cooked before serving. Serve scattered with freshly chopped coriander and lime wedges on the side."]}, {"isVegetarian": false, "title": "Tandoori chicken with lentil salad", "url": "www_bbc_co_uk_food_recipes_tandoori_chicken_with_45215", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x whole chicken, skin removed, jointed", "200ml/7fl oz yoghurt", "2 tsp ginger and garlic paste", "½ tsp chilli powder", "1 tsp ground coriander ", "¼ tsp ground cinnamon", "½ tsp garam masala", "2 tsp lemon juice", "½ tsp mango powder (available from specialist Asian stores)", "½ tsp fenugreek leaf powder", "1 tbsp chickpea flour", "1 tsp saffron water or ¼ tsp edible orange colour", "1 tsp vegetable oil", "pinch salt", "50g/2oz melted butter, for basting", "1 tbsp chat masala (available from specialist Asian stores), to serve  ", "1 lime wedge, to serve", "200g/7oz black chickpeas, sprouted or cooked", "110g/4oz green lentil, sprouted or cooked", "small bunch watercress", "small bunch baby red chard leaves", "1 tomato, chopped", "1 red onion, chopped", "1 cucumber, chopped", "1 tbsp chopped fresh coriander leaves", "½  tsp chopped fresh ginger", "3 tbsp vegetable oil", "1 tsp lime juice", "pinch salt", "pinch sugar ", "1 green chilli chopped (optional)", "½ tsp cumin seeds, toasted, ground", "1 tsp chat masala (available from specialist Asian stores)", "200g/7oz fresh mint leaves", "110g/4oz fresh coriander leaves", "2 tbsp chopped red onions", "2 tbsp lemon juice", "1 green chilli, chopped finely", "½ tsp salt", "½ tbsp vegetable oil", "5 tbsp thick Greek-style yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Make deep incisions into the chicken breasts, thighs and drumsticks.", "Whisk the yoghurt in the large bowl, add the remaining marinade ingredients and mix until well combined.", "Rub the marinade over the chicken until it is completely coated, then chill in the fridge for 3-4 hours.", "Preheat the oven to 200C/400F/Gas 6.", "Place the chicken onto the rack above a roasting tray and cook in the oven for 15-20 minutes (or on a charcoal grill for about 12 15 minute until cooked). ", "Preheat the grill to high.", "Remove the chicken from the oven and rest for 2-3 minutes. Baste thoroughly with butter and roast under the grill for 3-4 minutes, or until the juices run clear when the chicken is pierced with a skewer and it is completely cooked through.", "For the salad, mix the ingredients together and set aside.", "Whisk the dressing ingredients in a bowl together until well combined and pour it over the salad.", "For the mint chutney, put all the ingredients except the yoghurt into a food processor and blend until well combined.", "Remove the mixture from the food processor and whisk together with the yoghurt until well combined.  Add salt and freshly ground black pepper to taste, and chill in the fridge until required. ", "Squeeze the lime juice over chicken, dust with chat masala and serve with the lentil salad and mint chutney."]}, {"isVegetarian": false, "title": "Tandoori cod burger", "url": "www_bbc_co_uk_food_recipes_tandoori_cod_burger_93602", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_cod_burger_93602_16x9.jpg", "ingredients": ["4 tbsp olive oil", "1½ tbsp tandoori masala", "3 tbsp Greek yoghurt", "2 x 100g/3½oz pieces skinless cod fillet", "¼ red onion, thinly sliced", "5 fresh mint leaves, thinly sliced", "100g/3½oz pickled cucumber, drained ", "4 slices brioche", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put 2 tablespoons of the oil, the tandoori masala, 1 tablespoon of the yoghurt and a pinch of salt in a medium bowl and stir. Add the cod and coat well.", "Heat the remaining 2 tablespoons of oil in a small frying pan over a medium heat. Once it’s hot, turn the heat down slightly and add the cod. Cook gently for 2–3 minutes on each side, then take off the heat and set aside, covered with kitchen foil.", "Put the red onion and mint in another bowl with the pickled cucumbers, mix and season with salt and pepper.", "Lightly toast the brioche slices and spread the remaining 2 tablespoons of yoghurt over two slices. Place a piece of cod on top of each and top with the onion, mint and pickle mixture. Close the sandwiches with the remaining toasted brioche slices. Enjoy!"]}, {"isVegetarian": false, "title": "Tamarind duck with chargrilled mango salad", "url": "www_bbc_co_uk_food_recipes_tamarindduckwithchar_89939", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.8kg/4lb duck, spatchcocked (backbone removed, duck flattened out) ", "2 tbsp tamarind paste", "1 tbsp honey", "1 tsp ground coriander", "½ tsp ground turmeric", "4 pak choi, quartered", "2 mangoes, peeled, stone removed, cut into thick slices", "150g/5oz beansprouts", "1 tbsp sesame oil", "2 tbsp soy sauce", "½ tsp tamarind paste", "½ tsp fresh ginger, peeled, grated", "4 tbsp sesame seeds, toasted, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/445F/Gas 8.", "For the duck, place the duck flesh-side down onto a large baking tray.", "Whisk the tamarind, honey, ground coriander and turmeric together in a bowl.", "Brush the skin of the duck with the honey and spice mixture, to completely cover.", "Roast the duck in the oven for 40-50 minutes (for medium rare), or until cooked to your liking, then remove and leave to rest for ten minutes.", "For the salad, heat a griddle pan until hot.", "Bring a pan of salted water to the boil, then add the pak choi and boil for one minute. Drain the pak choi then place onto the griddle pan and cook until charred on all sides. Remove and place into a serving bowl.", "Place the mango slices onto the griddle and cook, turning once, until charred on both sides. Place into the bowl with the pak choi. Add the beansprouts and mix gently.", "Whisk the sesame oil, soy sauce, tamarind and ginger together in a separate bowl, then drizzle over the salad. Mix well.", "To serve, carve the duck and place equal portions onto each plate. Place some salad alongside and sprinkle with toasted sesame seeds."]}, {"isVegetarian": false, "title": "Tandoori king prawns with butter sauce", "url": "www_bbc_co_uk_food_recipes_tandoori_king_prawns_53087", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_king_prawns_53087_16x9.jpg", "ingredients": ["1 tsp garam masala", "½ tsp ground cinnamon", "1 tsp chilli powder", "1 tsp ground cumin", "2 garlic cloves, crushed", "5cm/2in piece fresh ginger, finely grated", "200ml/7fl oz plain yoghurt", "500g/1lb 2oz large tiger prawns, peeled and de-veined, tails left on", "2 lemons, cut in half", "50g/1¾oz butter", "1 red onion, finely chopped", "2 garlic cloves, finely chopped", "1 tsp ground cumin", "1 red chilli, finely chopped", "3 ripe tomatoes, roughly chopped", "200ml/7fl oz double cream", "5cm/2in piece fresh ginger, peeled, roughly chopped", "2 tbsp roughly chopped fresh coriander leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the tandoori prawns, in a bowl, mix all of the tandoori prawns ingredients, except for the prawns and lemon, until well combined. Add the prawns and mix well until completely coated in the marinade. Cover and chill in the fridge for at least 20 minutes, and preferably overnight.", "When the prawns have marinated and 30 minutes before you wish to eat, prepare your barbecue. Allow the flames to flare up and die down until the coals are just glowing.", "Meanwhile, for the butter sauce, melt the butter in a frying pan over a medium heat. Add the red onion and fry for 1-2 minutes, or until softened. Add the garlic, cumin and chilli and fry for a further 1-2 minutes.", "Add the tomatoes, cream and ginger and bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 4-5 minutes, or until the sauce has thickened slightly and the tomatoes have broken down. Stir in the coriander and season, to taste, with salt and freshly ground black pepper. Keep warm.", "Remove the prawns from the bowl, shaking off any excess marinade, and thread onto four metal skewers. Place the skewers onto the barbecue and grill for 2-3 minutes on each side, or until cooked through.", "To serve, place the skewers onto serving plates with a lemon half. Place a dollop of the butter sauce alongside each."]}, {"isVegetarian": false, "title": "Tandoori mixed grill", "url": "www_bbc_co_uk_food_recipes_tandoori_mixed_grill_72067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp ground cardamom", "2 tsp ground cumin", "2 tsp ground coriander", "2 tsp ground turmeric", "½ tsp ground cinnamon", "¼ tsp ground cloves", "freshly grated nutmeg", "2 tbsp Kashmiri chilli powder", "½ tsp cayenne pepper", "50g/1¾oz fresh root ginger, grated", "6 garlic cloves, crushed", "500g/1lb 2oz full-fat yoghurt", "1 lemon, juice only", "salt and freshly ground black pepper", "8 thick lamb cutlets, French-trimmed", "6 chicken thigh fillets, skinned, flattened out and slashed", "12 large raw king prawns, shelled, tail tip left on, deveined", "400g/14oz salmon fillet, skinned", "small bunch fresh dill, very finely chopped", "2 tbsp drained capers, very finely chopped", "naan bread", "lemon wedges", "raita (optional) "], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Mix all the marinade ingredients together and season with plenty of salt and pepper. Divide the marinade between four bowls. Add the lamb, chicken and prawns to three of the bowls. ", "Stir the dill and capers into the remaining bowl and add the salmon. Massage the marinade into the meats, prawns and salmon, then cover and marinate for at least 1 hour – overnight if possible. ", "When you are ready to cook everything, heat your grill to its highest setting. Arrange the chicken on a rack over a lined tray and grill for 4–5 minutes on each side (this is how long the chicken will take after it has been flattened – if it is not flat, you will need to cook it for longer). Remove and rest. Add the lamb and cook for 2–3 minutes on each side. Again, remove and rest. ", "The salmon will need 4–5 minutes on each side, and finally the prawns will need just 2–3 minutes on each side, depending on their size. You could cook the chicken and salmon together and the lamb and prawns together if you like. Serve with naan bread, lemon wedges and some raita on the side. "]}, {"isVegetarian": false, "title": "Tandoori salmon with garlic, cumin and tomato potatoes and kachumber salad", "url": "www_bbc_co_uk_food_recipes_tandoori_salmon_with_39191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp ground ginger", "1 tsp ground coriander", "1 tsp ground cumin", "½ tsp paprika", "½ tsp turmeric", "pinch nutmeg, grated", "2 cloves, ground", "1 cinnamon stick, crushed", "1 tsp cayenne pepper", "3 tbsp vegetable oil", "300ml/10fl oz natural yoghurt", "4 darnes of salmon", "1kg/2lb 4oz floury potatoes, such as Maris Piper or King Edwards, cut into 3cm/1¼in cubes", "100ml/3½fl oz olive oil, for shallow frying", "1 tsp smoked paprika", "1 red chilli, finely sliced", "½ tsp cumin seeds", "2 garlic cloves, thinly sliced ", "400g tin of chopped tomatoes", "4 tomatoes, seeds removed, cut into 3mm/⅛in cubes", "1 red onion, sliced", "½ tsp salt", "1 tsp caster sugar", "1 lemon, juice only", "2 tbsp extra virgin olive oil", "1 tbsp finely chopped fresh coriander", "1 tbsp chopped fresh mint"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the tandoori salmon, place all the spices in a medium bowl and mix with the oil and yoghurt. Smear half of the paste all over the fish and leave to marinate in the fridge for at least an hour. Reserve the remaining paste to make a sauce. ", "Meanwhile, place the potatoes in a large pan of salted water and cook for 6-7 minutes, or until just tender. Drain well. ", "Heat 3 tablespoons of the olive oil over a low heat. Add the smoked paprika, chilli, cumin and garlic. Cook for 1-2 minutes. Add the chopped tomatoes and cook for 2-3 minutes.", "Heat another frying pan and add the remaining oil, once hot add the potatoes and cook until golden-brown. Just before serving add the tomato mixture to the potatoes and heat through. ", "For the kachumber salad, place the tomato and onion in a large bowl with the salt and sugar. Mix the lemon juice and olive oil in a small bowl and pour over the tomatoes and onion along with the coriander and mint. ", "Once the salmon has marinated pre-heat the grill to medium heat. Place the salmon on a foil lined tray and grill for 3-4 minutes on each side.", "Place the reserved tandoori paste in a small saucepan and gently warm. ", "To serve, place a spoonful of salad alongside the grilled salmon and potatoes and spoon over the tandoori sauce."]}, {"isVegetarian": false, "title": "Tandoori quail with fennel salad and yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_tandoori_quail_with_91053", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 quail", "2 garlic cloves, finely sliced", "5cm/2in piece fresh ginger, finely grated", "1 tsp chilli powder", "1 tsp ground fennel seed ", "½ tsp ground cinnamon", "1 tsp garam masala", "200ml/7fl oz natural yoghurt", "2 bulbs fennel, finely sliced", "½ cucumber, finely sliced", "½ red onion, finely chopped", "1 bunch fresh mint, finely sliced", "1 lemon, juice only", "salt and freshly ground black pepper", "2 tbsp olive oil ", "75ml/3fl oz natural yoghurt", "½ tsp ground cumin", "½ tsp ground fennel seed", "2 tbsp coriander cress, or chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To spatchcock the quail, take some strong, sharp scissors (or poultry shears) and cut down either side of the spine. Take out the spine, then press down on the breastbone of the quail to open it out flat. Cut the quail in half lengthways.", "For the marinade, mix the spices and yoghurt in a bowl until well combined.", "Coat the quail with the marinade, cover with clingfilm and chill in the fridge for at least 2 hours, preferably overnight.", "Heat a griddle pan until hot, then add the quail, skin-side down, and grill for 3 minutes on each side, or until the juices run clear when a skewer is inserted into the thickest part. Remove the quail from the griddle and lave to rest for 2-3 minutes.", "Meanwhile for the fennel salad, mix the fennel, cucumber, red onion, mint and half the lemon juice in a bowl until well combined. Season to taste with salt and freshly ground black pepper. ", "Whisk the olive oil, yoghurt and remaining lemon juice in a bowl until well combined. Add the cumin and fennel seed, and season to taste with salt and freshly ground black pepper.", "To serve, place the quail on top of the salad. Scatter with coriander cress and spoon a good dollop of yoghurt dressing alongside."]}, {"isVegetarian": false, "title": "Tandoori chicken samosas", "url": "www_bbc_co_uk_food_recipes_tandoorichickensamos_93148", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "1 tsp salt", "2 tsp vegetable oil", "1 free-range egg, separated", "135ml/4¾fl oz warm water", "1 tbsp ready-made tandoori curry paste", "1 tbsp yoghurt", "2 skinless chicken breasts", "2 potatoes, peeled", "2 tbsp vegetable oil", "1 small onion, peeled, finely chopped", "½ tsp ground turmeric", "2 tsp garam masala", "1 tsp black mustard seeds", "1 tsp salt", "½ tsp freshly ground black pepper", "4 cloves garlic, crushed", "1 green chilli, finely chopped", "10 curry leaves, finely chopped", "75g/2½oz frozen peas", "1 tsp lemon juice", "1 handful fresh coriander leaves, chopped", "vegetable oil, for deep frying", "chutney (optional)", "raita (optional)"], "serves": "Makes 10-12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, mix the flour and salt together in a bowl. Add the oil and egg yolk and mix until the mixture resembles breadcrumbs. Gradually mix in the warm water, until the mixture forms a smooth and elastic dough (you may not need all of the water). Roll the dough into a ball, cover with cling film and chill in the fridge until needed. ", "For the filling, mix the tandoori paste and the yoghurt together in a bowl. Add the chicken breasts and turn several times to coat the chicken in the mixture. Cover the bowl with cling film and set aside to marinate in the fridge for one hour. ", "Preheat the oven to 180C/360F/Gas 4. ", "Place the chicken into a roasting tray and cook in the oven for 20 minutes, or until golden-brown and cooked through (the chicken is cooked if the juices run clear when the chicken is pierced at the thickest part). Set aside to cool, then chop into small cubes.", "Cook the potatoes in a pan of boiling water for 15 minutes, or until tender. Drain the potatoes and set aside to cool. When cooled, finely chop the potatoes. ", "Heat the vegetable oil in a frying pan and fry the onion for 3-4 minutes, or until softened but not coloured. Add the ground turmeric, garam masala, mustard seeds, salt and freshly ground black pepper and cook for a minute, stirring well. (CAUTION: the mustard seeds may start to pop. Keep the pan well away from your face and eyes.)", "Add the garlic and chillies and fry for 2-3 minutes, then add the curry leaves to the pan and cook for a further minute. Add the chopped potato and mix gently into the spices. Cook over a low heat for a further ten minutes, then stir in the peas and cook for 2-3 minutes, or until the peas are tender. ", "Gently fold in the chopped chicken, add the lemon juice and chopped coriander. Check for seasoning, then remove from the heat and set aside to cool. ", "To make the samosas, roll out the pastry on a floured work surface to about 3mm thick. Cut out 15cm/6in rounds with a pastry cutter.", "Cut each round in half to give two semicircles. Take each semicircle and wrap into a cone, brushing the edges with the reserved egg white and sealing together. Spoon the samosa filling into each cone so that they are just over half-full (do not overfill them or it will be difficult to seal). Brush the top of the pastry cone with egg white and seal the open ends of the cone together. Repeat the procedure with the remaining pastry and filling. ", "Half-fill a deep, heavy-based pan with the vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended).  Fry the samosas in small batches, for 4-5 minutes each time, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. ", "Serve the samosas with small bowls of chutney and raita alongside."]}, {"isVegetarian": false, "title": "Tandoori lamb wrap", "url": "www_bbc_co_uk_food_recipes_tandoorilambwrap_86564", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoorilambwrap_86564_16x9.jpg", "ingredients": ["150ml/5fl oz Greek-style yoghurt ", "½ small onion, roughly chopped", "1 garlic clove, peeled and chopped", "2.5cm/1in piece fresh ginger, peeled and chopped", "2 tsp each garam masala and ground cumin", "1 tsp ground coriander", "½ tsp ground fennel seeds", "¼ tsp freshly ground black pepper ", "1 tbsp vegetable oil", "2 tbsp fresh coriander leaves", "½ tsp red chilli powder, or to taste", "2 tsp lemon juice", "1 tsp salt, or to taste", "400g/14oz lamb (leg meat is ideal), bones removed, cut into 2cm/1in cubes and pierced with a fork ", "2 tbsp melted butter, for basting", "5 ready-made flour tortillas, wrapped in foil and placed in the oven for the last five minutes of cooking", "½ onion, finely sliced", "2 tomatoes, finely sliced", "1 Little Gem lettuce, finely sliced ", "100ml/3½fl oz green chutney, mixed with 3 tbsp yoghurt, to serve", "You'll need ten wooden skewers, soaked in water for half an hour"], "serves": "Serves 5", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place all the marinade ingredients into a food processor and blend until smooth. Pour into a large bowl and stir in the lamb cubes. Mix well and leave to marinate in the fridge for as long as possible, preferably overnight. Bring back to room temperature an hour before cooking.", "Preheat the grill to medium. Thread the lamb cubes onto the skewers leaving a space between each piece and place under the grill. Cook for around 5-6 minutes, turning halfway through cooking, until tender. Alternatively, cook in an oven preheated to 200C/400F/Gas 6 for eight minutes. Baste with the melted butter and cook for another minute or two for slightly pink meat, or longer if you want the lamb well done.", "Divide the lamb pieces into five equal portions and place each portion in the centre of a warmed tortilla. Top with a handful of the sliced vegetables and a spoonful of chutney. Roll up and serve."]}, {"isVegetarian": false, "title": "Tandoori chicken with black lentil sauce and herb pulao, served with rocket and mango salad", "url": "www_bbc_co_uk_food_recipes_tandoorichickenwithb_82082", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp ginger-garlic paste, from a jar (or cursh together fresh garlic and ginger to form a paste) ", "1 tsp red chilli powder", "2 tbsp lemon juice", "1 tsp salt", "4 chicken breasts on the bone, skin removed, scored with 3 or 4 incisions", "melted butter and oil, for basting", "1½ tsp lime juice", "1 tsp chaat masala (a mixture of dried spices and chillies, available from Asian grocers)", "salt", "4 Peshawari naan, to serve", "250g/9oz thick plain yoghurt", "1 tsp garam masala", "100ml/3½fl oz vegetable oil", "½ tsp ground cinnamon ", "½ tsp red chilli powder", "pinch of edible red colouring (optional)", "1 tsp salt", "200g/7oz black lentils", "4 tbsp vegetable oil", "1 tbsp finely chopped fresh ginger ", "2 cloves garlic, peeled", "2 whole green chillies ", "1 tsp cumin seeds", "1 tbsp ginger-garlic paste (see above)", "½ green chilli, chopped", "2 tbsp tomato paste", "½ tsp each red chilli powder, ground coriander, ground turmeric, garam masala and fenugreek leaf powder", "30g/1oz butter", "2 tbsp single cream", "1 tbsp chopped coriander leaves", "salt", "15g/½oz butter", "2 tsp vegetable oil", "100g/3½oz onion, sliced", "2.5cm/1in cinnamon stick", "2 black cardamoms, crushed", "1 blade mace", "500g/1lb 2oz basmati rice, washed and soaked for 10-20 minutes", "1 tsp salt", "3-4 tbsp puréed spinach, coriander and mint ", "2 tbsp mascarpone or double cream", "25g/1oz baby rocket leaves ", "1 Granny Smith apple, cut into julienne ", "1 green (unripe) mango, cut into julienne", "vinaigrette made with oil and lime juice"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the ingredients for the first marinade. Rub all over the chicken breasts, then leave in the fridge for 20 minutes so the juices can drain.", "Mix the ingredients for the second marinade. Add the chicken and turn to coat, then leave in a cool place for 2-3 hours.   ", "Meanwhile, make the black lentil sauce. Put the lentils, two tbsp of the oil, the ginger, garlic and whole chillies in a pan and cover with water. Bring to the boil, then simmer gently until the lentils are cooked to a soft texture and the liquid has reduced. Discard the garlic and chillies.", "Prepare the seasoning for the lentil sauce by sautéing the cumin seeds, ginger-garlic paste and chopped green chilli in the remaining oil until soft. Stir in the tomato paste followed by all the ground spices.  ", "Add the cooked lentils to the seasoning and simmer for 10-15 minutes. ", "Add the butter, cream and coriander with salt to taste. Blend with a hand blender to give a sauce consistency. Set aside, and reheat for serving.", "Next make the pulao. Heat the butter and oil in a saucepan and fry the onions with the cinnamon, cardamom and mace until golden brown. ", "Add the drained rice, salt and 1 litre/1¾ pints of water. Bring to the boil, then cover the pan tightly and cook until the rice is tender and all liquid has been absorbed. Add the spinach and herb purée and mascarpone or cream just before serving.", "Preheat the oven to 200C/400F/Gas 6.", "While the rice is cooking, thread the chicken breasts onto skewers, place the breasts on a non-stick baking tray and cook in the oven for three minutes. Reduce the oven heat to 160C/325F/Gas 3 and cook for a further 15 minutes. ", "Baste the chicken breasts with the butter-oil mixture and cook for a further five minutes or until the chicken is cooked through (juices will run clear). Remove from the oven, baste the chicken again and sprinkle with the lime juice and chaat masala. Keep hot.  ", "Toss all the ingredients together for the salad.", "To serve, ladle the sauce onto four plates and spread out to cover. Place a large spoonful of herb pulao in the centre of each plate, set a tandoori chicken breast on the rice and garnish with the rocket and mango salad. Place the Peshawari naan on the side."]}, {"isVegetarian": false, "title": "Tandoori spiced pork chops with Savoy cabbage poriyal and apple and porcini salad", "url": "www_bbc_co_uk_food_recipes_tandoorispicedporkch_88252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp finely chopped garlic", "1 tsp finely chopped green chillies", "1 tsp ground fennel seeds", "½ tsp ground cinnamon", "1 sprig fresh rosemary, roughly chopped", "1 sprig fresh thyme, leaves only", "1 tbsp Dijon mustard", "salt and freshly ground black pepper", "100ml/3½fl oz single cream", "50ml/2fl oz double cream", "2 tbsp gram flour", "2 tbsp pastis", "generous pinch freshly grated nutmeg", "4 pork chops, trimmed and fat removed", "2 tbsp vegetable or groundnut oil", "1 tsp mustard seeds", "10 curry leaves", "1 tsp finely chopped fresh ginger", "300g/10½oz Savoy cabbage, finely sliced", "¼ tsp ground turmeric", "salt, to taste", "50g/2oz freshly grated coconut", "1 tbsp chopped fresh coriander leaves", "½ tbsp lemon juice", "3 tbsp olive oil", "½ tsp chopped garlic", "½ tsp coriander seeds, toasted and crushed lightly", "¼ tsp crushed red chilli", "2 Granny Smith apples, cut into 2cm/1in cubes", "100g/3½oz fresh porcini mushrooms, cleaned and sliced", "1 tbsp lemon juice", "dash cider vinegar", "salt and sugar, to taste", "½ tbsp finely chopped fresh parsley", "fresh coriander leaves", "Greek cress, celery cress and amaranth cress"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pork chops, place everything but the pork chops into a large bowl and whisk to combine. Add the pork chops and stir to coat. Set aside to marinate for 30 minutes in a cool place.", "Heat a griddle pan until hot. Place the pork chops into the pan and griddle on each side for two minutes. Transfer the chops to a baking sheet and place in the oven for 10-15 minutes, or until completely cooked through.", "Meanwhile, for the Savoy cabbage poriyal, heat a frying pan until hot and add the oil, mustard seeds, curry leaves and ginger. Stir until the mustard seeds pop, taking care as it may spit.", "Add the cabbage, turmeric and salt and fry gently for 10-15 minutes, or until the cabbage is wilted. Remove from the heat and stir in the freshly grated coconut, coriander leaves and lemon juice.", "For the salad, heat a frying pan until hot, add the oil and garlic and fry until light golden-brown. Add the coriander seeds and red chilli.", "Add the chopped apples and fry gently for a few minutes to colour lightly. Add the mushrooms and fry until lightly browned. Add the lemon juice and cider vinegar and season with salt and sugar, to taste. Remove from the heat and stir in the chopped parsley.", "To serve, place the cabbage poriyal in the centre of four serving plates and top with a pork chop. Scatter the apple and porcini salad around the plate and drizzle over the liquid left in the pan. Sprinkle the mixed cress on top of the salad and serve immediately."]}, {"isVegetarian": false, "title": "Tandoori-style beef kebabs with coconut jus, Kashmiri pilau rice and garlic spinach", "url": "www_bbc_co_uk_food_recipes_tandooristylebeefkeb_91376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz rump steak, chopped into 2cm/1in pieces", "570ml/1 pint Greek-style yoghurt", "5cm/2in piece fresh root ginger, peeled and finely grated", "6 cloves garlic, peeled and crushed to a paste", "1 lemon, juice only", "2 tbsp sweet paprika", "2 green peppers, seeds removed, chopped into 3cm/1½in pieces", "2 red peppers, seeds removed, chopped into 3cm/1½in pieces ", "4 tbsp vegetable oil", "1 tsp green cardamom pods, lightly crushed", "1 tsp whole cloves", "6 ripe tomatoes, chopped", "1 x 227g/8oz tin chopped tomatoes", "300ml/10½fl oz water", "1 onion, peeled and finely chopped", "10 curry leaves (available from some supermarkets and Asian grocers)", "1 tbsp garam masala", "1kg/2lb 3oz beef bones", "200ml/7fl oz coconut milk", "50g/2oz butter, cubed", "3 tbsp vegetable oil", "1 small onion, peeled, finely chopped", "1 tbsp green cardamom pods, lightly crushed", "1 tbsp cumin seeds", "2 bay leaves", "400g/14oz basmati rice, washed and soaked for at least 30 minutes in cold water", "600ml/1 pint 1½fl oz water", "1 bunch fresh coriander, roughly chopped", "10 seedless green grapes, halved", "10 seedless red grapes, halved", "2 tbsp vegetable oil", "2 cloves garlic, peeled and crushed to a paste", "400g/14oz baby leaf spinach, blanched and refreshed in cold water"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the kebabs, combine the rump steak, yoghurt, ginger, garlic, lemon juice and paprika in a large bowl. Cover and marinate for at least one hour in the fridge. Soak eight wooden skewers in cold water for at least ten minutes.", "Thread the meat and peppers alternately on the wooden skewers until all of the meat and peppers are used up. Set aside.", "For the coconut jus, heat half of the vegetable oil in a pan. Add the cardamom pods and the cloves and fry for 2-3 minutes. Add the chopped fresh tomatoes and the tinned tomatoes. Add the water, bring to the boil and simmer for about 40 minutes, or until the sauce has slightly thickened and the tomatoes have completely broken down.", "In a separate pan, heat the remaining oil and add the onions and the curry leaves. Cook for 4-5 minutes, or until the onions are softened and the curry leaves are aromatic. Turn up the heat, then add the beef bones and stir in the garam masala and cook for 5-6 minutes, stirring continually, or until the bones start to colour.", "Add the tomato mixture to the pan with the bones and mix well. Add enough water to just cover the top of the bones, then simmer for one hour, or until the mixture is thickened and aromatic. Pass the mixture through a fine sieve into a clean pan and discard the solids. ", "Add the coconut milk to the pan and bring to the boil, cooking for 10-15 minutes, or until the liquid has reduced by half. Keep warm.", "For the rice, heat the oil in a pan over a medium heat. Add the onions, cardamom pods, cumin and bay leaves and fry for 5-6 minutes, or until the onion is softened and the spices are aromatic.", "Drain the basmati rice and add to the pan. Stir until all the rice is coated and the spices are evenly distributed. Fry for 2-3 more minutes, then add the water and bring to the boil. Cover with a lid and cook for 10-12 minutes, or until the rice is tender and all of the water has been absorbed. Remove from the heat and set aside. ", "For the spinach, heat the oil in a pan until smoking. Add the garlic and fry for 2-3 minutes, or until softened. Squeeze out any excess moisture from the spinach, then add to the pan and stir until the spinach has wilted.", "For the kebabs, heat a griddle pan until smoking. Place the kebabs onto the griddle and cook for about 2-3 minutes on each side, or until cooked through and golden-brown all over.", "To serve, stir the grapes and chopped coriander into the cooked rice. Spoon onto serving plates and lay the kebabs alongside. Whisk the butter into the coconut jus, then drizzle around the plate."]}, {"isVegetarian": false, "title": "Tandoori-style chicken", "url": "www_bbc_co_uk_food_recipes_tandooristylechicken_90296", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandooristylechicken_90296_16x9.jpg", "ingredients": ["1.25kg/2½lb chicken pieces (legs and breasts), skinless", "2 tsp salt", "1-2 lemons, halved", "425ml/1 pint plain yoghurt", "½ onion, coarsely chopped", "1 garlic clove, chopped", "2.5cm/1in piece fresh root ginger, chopped", "1-2 hot green chillies, roughly sliced", "2 tsp garam masala", "lime or lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Cut each chicken leg into two pieces (drumstick and thigh) and each breast into two pieces. Make two deep slits crossways on the meaty parts of each leg and breast piece. The slits should be deep enough to reach the bone.", "Spread the chicken pieces out onto a large platter. Sprinkle the chicken with the salt and squeeze over some of the lemon juice. Rub the lemon juice and salt into each piece, so that the mixture goes right to the bone. Set aside for 20 minutes.", "Meanwhile, for the yoghurt marinade, combine a tablespoon or so of the yoghurt, the onion, garlic, ginger, chillies and garam masala in a blender or food processor and blend until smooth. Add the remaining yoghurt to the yoghurt and spice mixture and combine well.", "Put the chicken and all its accumulated juices into a large bowl, discarding the lemon seeds. Pour the marinade over the chicken to cover. Rub the marinade into the slits in the meat, then cover with cling film and refrigerate for at least six hours (but preferably 24).", "Preheat the oven to its maximum temperature and set a shelf in the top third of the oven where it's hottest.", "Remove the chicken pieces from the marinade, shaking off the excess, and spread them out in a single layer on a large, shallow, baking tray. Discard the leftover marinade.", "Place the tray in the top part of the oven and cook for 20-25 minutes, until the chicken is cooked through. The breasts cook more quickly than the legs, so remove these after about 10-15 minutes, when they're cooked through. You can check whether they're done by piercing the chicken in the thickest part with a skewer. The juices will run clear but the flesh should still feel springy to the touch.", "Lift the chicken pieces out of their juices and place on a serving plate. Serve with lemon or lime wedges."]}, {"isVegetarian": false, "title": "Tandoori trout salad", "url": "www_bbc_co_uk_food_recipes_tandooritroutsalad_91443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz plain yoghurt", "2 limes, juice only", "1 tbsp crushed garlic", "2.5cm/1in piece fresh ginger, peeled, grated", "1 tsp ground cumin", "1 tbsp ground coriander", "1 tsp garam masala", "pinch paprika", "pinch salt", "4 x 150g/5½oz trout fillets", "75ml/2¾fl oz melted butter", "1 tbsp ready-made curry paste", "50ml/1¾oz boiling water", "1 red onion, finely sliced", "440g/1 lb can mixed beans, drained, rinsed", "2 limes, juice only", "1 tbsp malt vinegar", "100ml/3½fl oz olive oil", "1 tbsp chopped fresh coriander", "1 red chilli, finely chopped", "4 naan breads, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, in a bowl, mix together the plain yoghurt, the juice of one lime, the garlic, ginger, cumin, coriander, garam masala, paprika and salt until well combined.", "Add the trout fillets and coat them in the marinade mixture. Cover and chill in the fridge overnight, or for at least for two hours.", "When the trout has marinated, preheat the grill to its highest setting. In a bowl, mix together the melted butter and the juice of the remaining lime until well combined.", "When the grill is hot, place the marinated trout fillets under it and grill for 2-3 minutes. Baste the grilled trout fillets with the lime juice and butter mixture.", "Turn the trout fillets over and grill for a further 2-3 minutes, basting with the lime juice and butter mixture halfway through cooking.", "For the salad, mix the curry paste with the boiling water until dissolved. In a separate bowl, mix together the onion, mixed beans, lime juice, malt vinegar, olive oil, coriander and chopped red chilli until well combined.", "To serve, divide the salad equally among four serving plates. Place one tandoori trout fillet on top of each portion. Serve the naan bread alongside."]}, {"isVegetarian": true, "title": "Tangy lemon tart", "url": "www_bbc_co_uk_food_recipes_tangylemontart_83740", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/8oz readymade shortcrust pastry", "8 free-range eggs", "320g/11oz caster sugar", "4 large lemons, juice and rind", "290ml/10fl oz/½ pint double cream", "icing sugar, for dusting", "single cream", "raspberries"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Roll out the pastry and use to line a large quiche dish (25cm/10in diameter). Line with tin foil and fill with dried beans or rice to hold the base in place.", "Bake in the oven for 20 minutes. Remove the foil and baking beans and bake for a further 5 minutes.", "Reduce the oven temperature to 150C/300F/Gas 2.", "In a mixing bowl, lightly beat the eggs and the sugar (do not whisk). Add the lemon juice and rind and stir. Finally add the cream and stir thoroughly but again, do not whisk.", "Transfer the cream mixture into the pastry case and cook in the centre of the oven for about 35 minutes until set (the mixture should set gently like a blancmange and be firm to the touch).", "Allow to cool completely, dust with icing sugar and serve with pouring cream and raspberries."]}, {"isVegetarian": false, "title": "Tapas platter", "url": "www_bbc_co_uk_food_recipes_tapas_85932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "50g/2oz whole almonds, out of their shells", "1 tsp sea salt", "1 tsp smoked paprika", "1 tsp chilli flakes", "500ml/18fl oz vegetable oil, for deep frying", "75g/2¾oz plain flour", "salt and freshly ground black pepper", "1 squid, cleaned and cut into rings ", "½ pomegranate, fleshy seeds only ", "1 tbsp balsamic vinegar", "1 tbsp olive oil", "10 large green olives, stones removed", "10 whole almonds, out of their shells", "1 tbsp olive oil", "½ red pepper, seeds removed", "1 tbsp olive oil", "1 garlic clove, finely sliced", "1 tsp fresh thyme leaves", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the spiced almonds, heat the oil in a frying pan and fry the almonds until lightly toasted. Sprinkle over the salt and spices and stir well, then pour into a small bowl.", "For the deep-fried squid, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Season the flour with salt and freshly ground black pepper, then dredge the squid rings in the flour, shaking off any excess.", "Carefully place the squid rings into the hot oil and deep fry for 3-4 minutes, or until crisp and golden-brown. Remove from the oil with a slotted spoon, drain on kitchen paper and sprinkle with salt. Place into a small bowl.", "For the pomegranate dipping sauce, place the pomegranate seeds into a pan with the balsamic vinegar and oil and simmer until the liquid has reduced by half. Pour into a small bowl.", "For the almond-stuffed olives, place an almond inside each olive. Heat the oil in a pan and fry the olives for 3-4 minutes, then place into a small serving bowl.", "For the roasted pepper,  place the pepper half on a baking sheet and drizzle with the oil. Sprinkle the sliced garlic and thyme over the pepper and season with salt and freshly ground black pepper.", "Transfer to the oven and roast for ten minutes, or until softened and lightly charred at the edges. Remove from the oven, cut into slices and place into a small bowl.", "To serve, place all of the bowls of tapas onto a large platter."]}, {"isVegetarian": false, "title": "Tapenade", "url": "www_bbc_co_uk_food_recipes_tapenade_11160", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, crushed", "1 lemon, juice only", "3 tbsp capers, chopped", "6 anchovy fillets, chopped", "250g/9oz black olives, pitted", "small bunch fresh parsley, chopped", "salt and freshly ground black pepper", "2-4 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make a rough textured tapenade, simply mix all the ingredients together, adding enough olive oil to form a paste. ", "For a smoother texture, tip the garlic, lemon juice, capers and anchovy into a food processor and process for about 10 seconds. Add the olives and parsley and enough olive oil to make a paste. ", "Season to taste if necessary."]}, {"isVegetarian": false, "title": "Tapas-style spicy tomato squid", "url": "www_bbc_co_uk_food_recipes_tapasstylespicytomat_89039", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80ml/3fl oz olive oil", "2 garlic cloves, peeled, crushed", "24 cherry tomatoes", "2 tsp smoked paprika", "1 bird's-eye chilli, finely chopped", "2 baby squid, cleaned, body chopped into rings, tentacles chopped", "1 red pepper, very finely sliced ", "1 lime, juice only", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Warm the oil and garlic in a pan over a medium heat until the garlic begins to colour. Remove the garlic with a slotted spoon and discard.", "Add the tomatoes, paprika and chillies and cook for 4-6 minutes, or until the tomatoes have burst.", "Add the squid and cook, stirring well, for 2-3 minutes, or until the squid is just cooked through, but still tender. ", "Add the red pepper, lime juice and parsley and season well with salt and freshly ground black pepper.", "Serve in small bowls with a basket of crusty bread alongside."]}, {"isVegetarian": false, "title": "Tapenade and mackerel on toast", "url": "www_bbc_co_uk_food_recipes_tapenadeandmackerelo_78292", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cooked mackerel fillet", "55g/2oz cream cheese", "2 tbsp fresh dill, chopped", "½ tsp Tabasco sauce", "2 slices bread, toasted", "2 spring onions, chopped", "100g/3½oz black olives, pitted", "3 tbsp flatleaf parsley, chopped", "½ garlic clove, chopped", "55ml/2fl oz olive oil"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the mackerel with the cream cheese, dill and Tabasco sauce.", "Spread the mackerel mixture over the toast and sprinkle with the chopped spring onion.", "In a blender, whiz the olives with the parsley and garlic. ", "Continue to blend, slowly adding the olive oil to form a smooth paste.", "To serve, place the dressed toast onto a plate and drizzle with the tapenade sauce."]}, {"isVegetarian": false, "title": "Herbed salmon on Savoy cabbage salad", "url": "www_bbc_co_uk_food_recipes_taretakkirolledherbs_80609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 25g/1oz fresh salmon, cut into cubes ", "3 tbsp chopped fresh coriander", "3 tbsp chopped fresh chives", "1 tsp vegetable oil ", "2 tbsp sesame seeds", "1 garlic clove, chopped ", "3 tbsp water", "½ lemon, juice only", "150g/5½oz Savoy cabbage, shredded"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the salmon, coriander and chives into a bowl and mix together gently.", "Heat the oil in a small pan and when hot add the salmon and cook for 1-2 minutes, or until cooked through and golden on all sides.", "For the Savoy cabbage salad, place the sesame seeds, garlic, water and lemon juice into a food processor and blend to a smooth dressing.", "Place the shredded Savoy cabbage into a large bowl and add the dressing, tossing well to coat.", "To serve, place the cabbage salad into the centre of a plate and top with the salmon pieces."]}, {"isVegetarian": true, "title": "Tarka dal with rice", "url": "www_bbc_co_uk_food_recipes_tarka_dahl_with_rice_01844", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tarka_dahl_with_rice_01844_16x9.jpg", "ingredients": ["400g/14oz red lentils, rinsed in a sieve under cold running water", "2 tsp ground turmeric ", "25g/1oz butter ", "2 tsp cumin seeds", "3 garlic cloves, finely chopped ", "1-2 green chillies, finely chopped, to taste ", "salt and pepper ", "200g/7oz rice, cooked according to the packet instructions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the lentils into a saucepan and cover with enough water to come 3cm/1¼in above the lentils. Bring to a boil, skimming off any froth as you bring it to the boil. Once simmering, add the turmeric along with half of the butter. Simmer gently for 20 minutes, or until the lentils are completely softened and the water is absorbed, but the mixture not dry.", "Meanwhile, heat a small frying pan over a medium heat. Add the cumin seeds and dry fry until toasted and aromatic (about 1-2 minutes). Remove the cumin seeds from the pan and set to one side. Add the remaining butter to the pan and, once melted, fry the garlic and chopped green chilli for 1-2 minutes, or until the garlic turns light golden-brown, and the chilli is softened. Add the toasted cumin seeds back to the pan and remove from the heat. ", "Once the lentils are soft, give them a rigorous stir to break them up a little. Stir the chilli and garlic mixture (including any butter) into the pan with the lentils and mix well. Taste and adjust the seasoning as necessary.", "Serve the tarka dal alongside the cooked rice. "]}, {"isVegetarian": true, "title": "Tarka dal with chapatis", "url": "www_bbc_co_uk_food_recipes_tarka_dal_with_chapattis_03213", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz split mung beans (mung dal), washed", "175g/6oz red lentils (masoor dal)", "2 tsp chopped green bird’s-eye chillies (or to taste)", "1 tsp ground turmeric", "2 tsp salt (or to taste)", "2 tbsp sunflower oil", "30g/1oz butter", "2½ tsp cumin seeds", "5 garlic cloves, finely chopped ", "3cm/1¼in fresh root ginger, finely grated ", "1 onion, finely chopped ", "2 tomatoes, chopped ", "2 tsp garam masala ", "handful fresh coriander, roughly chopped, to garnish", "275g/9¾oz medium chapati flour, plus extra for dusting", "1 tsp salt ", "25g/1oz butter, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the dal, place both dal in a large saucepan and pour over 1.7 litres/3 pints water. Add the chillies, turmeric and salt and bring to the boil. Reduce the heat and simmer for 10–15 minutes, or until cooked through.", "Meanwhile, heat the oil and butter in a small saucepan over a medium heat. Add the cumin, garlic, ginger, onion and tomatoes and cook for 12–15 minutes. ", "To make the chapatis, combine the flour with the salt and 100–150ml/3½–5fl oz water to form a dough. Knead well, shape into golf ball-sized balls, and set aside on a lightly floured surface.", "Heat a tava or griddle pan over a medium heat. Roll out each ball of dough and griddle each chapati for a few minutes on both sides. Spread with a little butter and keep warm until ready to serve.", "When the dal is cooked, stir in the onion and tomato mixture and the garam masala, bring back to the boil, then remove from the heat. Garnish with coriander before serving with the chapatis.  "]}]