[{"ingredients": ["4 hongos shiitake", "5 gambas crudas", "1 cucharada de aceite de oliva", "1 cucharada de miel", "½ limón, solo jugo", "sal y pimienta negra recién molida", "100 g / 3½ oz de espinaca", "2 cucharadas de aceite de oliva", "1 cucharadita de hojuelas de chile", "1 limón"], "method": ["Para el rey gambas y pinchos de champiñones shiitake, ensarte los champiñones shiitake y langostinos alternativamente en dos brochetas y rocíe con aceite de oliva.", "Caliente una sartén hasta que esté caliente y pásela a la parrilla durante 3-4 minutos por cada lado. Agregue la miel y el jugo de limón, sazone con sal y pimienta negra recién molida y la plancha durante 1-2 minutos más en cada lado, o hasta que los champiñones estén tiernos y las gambas estén completamente cocidas.", "Para la ensalada de espinaca picante, coloque la espinaca en un tazón con aceite de oliva, hojuelas de chile y el jugo de la mitad del limón y mezcle bien.", "Para servir, coloque la ensalada de espinaca picante en un plato de servir, cubra con los pinchos y adorne con la otra mitad de limón cortada en rodajas."], "url": "www_bbc_co_uk_food_recipes_kingprawnandshiitake_85578", "title": "Brocheta de gambas y shiitake con ensalada de espinacas picantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20 langostinos crudos, cabezas removidas y sin cáscara - mariposas a", "eliminar residuos", "pinchos de madera (empapados para evitar que se quemen cuando se cocinan a la parrilla o a la parrilla)", "1 chile rojo", "1 pedazo de jengibre del tamaño de un pulgar, pelado", "1 diente de ajo", "un poco de jugo de lima", "1 cucharadita de aceite vegetal", "½ piña fresca, cortada en dados de 1 cm / ½ pulgadas", "110g / 4oz mooli (daikon rábano), cortado en bastones finos (juliana) 7.5cm / 3in largo", "Mangetout 200g / 7oz, cortado en ángulo finamente", "2 zanahorias, cortadas en bastones finos (juliana) de 7.5cm / 3 pulgadas de largo", "1 cebolla roja, finamente rebanada", "1 cucharada de cilantro apilado, picado grueso", "2 chiles rojos, finamente cortados en cubitos", "½ pieza de jengibre del tamaño de un pulgar, finamente picada", "Vinagre de vino de arroz de 110ml / 4fl oz", "2 limas, cáscara y jugo", "2 cucharadas de azúcar en polvo"], "method": ["En una maja y mortero machaque los ingredientes del adobo (el chile, el jengibre, el ajo, el jugo de lima y el aceite) y agregue los langostinos, dejándolos macerar durante 1 hora.", "Una vez que los langostinos se hayan marinado, ensartelos en los pinchos de madera, unos cuatro por brocheta según el tamaño de los langostinos.", "En una sartén caliente, coloque los pinchos de gambas y cocine por un par de minutos a cada lado (las gambas se pondrán rosadas).", "Mientras tanto, prepare los ingredientes de la ensalada y mezcle bien el aderezo, casi magullando las verduras.", "Sirva la ensalada en el medio de un plato y coloque dos pinchos encima y cómalos inmediatamente."], "url": "www_bbc_co_uk_food_recipes_kingprawnbrochetteon_67272", "title": "Brocheta de langostinos sobre una ensalada dulce picante", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de arroz 100 g / 3½ oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "1 diente de ajo, finamente picado", "1 chile fresco, finamente picado", "½ cebolla, finamente picada", "1 cucharadita de curry en polvo", "100ml / 3½ fl oz crema doble", "5 langostinos, pelados, colas dejados en", "½ lima, solo jugo", "1 cucharada de albahaca picada", "1 cucharadita de cilantro picado, para decorar"], "method": ["Coloque los fideos de arroz en un tazón grande y cubra con agua hirviendo. Deje cocinar durante 5 minutos, luego escurra y mezcle con el aceite de oliva. Sazonar con sal y pimienta negra recién molida.", "Para el curry, caliente el aceite en una sartén grande. Agregue el ajo, el chile y la cebolla y fría hasta que se ablanden.", "Agregue el polvo de curry y fría por otro minuto. Vierta la crema doble y cocine a fuego lento.", "Agregue las gambas y cocine durante 5 minutos, luego agregue el jugo de lima, los fideos cocidos y la albahaca picada y revuelva.", "Servir en un plato caliente grande y espolvorear con cilantro picado."], "url": "www_bbc_co_uk_food_recipes_kingprawncurrywithno_81304", "title": "Rey gambas al curry con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite vegetal", "1 diente de ajo, en rodajas", "20 langostinos, conchas eliminadas", "2 huevos de gallinas camperas, ligeramente golpeados", "1 cucharada de pasta de camarones (blachan)", "75g / 2½oz de cacahuetes tostados", "½ cucharadita de copos de chile", "Fideos de arroz fino de 250 g / 9 oz, empapados en agua tibia durante 20 minutos, luego escurridos", "Brotes de soja 150 g / 5oz", "1 cucharadita de azúcar", "2 cucharadas de salsa de soja", "2 cucharadas de salsa de pescado (nam pla)", "puñado de hojas frescas de cilantro, para adornar", "1 lima, solo jugo"], "method": ["Calentar el aceite en un wok a fuego alto. Agregue el ajo y las gambas y saltee durante dos minutos, luego retírelos y déjelos a un lado.", "Agregue los huevos y extiéndalos alrededor del wok para formar una tortilla. Una vez cocido, divida el huevo en trozos, luego reserve con las gambas y el ajo.", "Agregue la pasta de camarones, las nueces y el chile y saltee por 30 segundos.", "Agregue los fideos, los brotes de soja, el azúcar, la salsa de soja y la salsa de pescado y saltee lo suficiente para calentar todo.", "Regrese el huevo y las gambas al wok y revuelva para combinar.", "Para servir, divida uniformemente la almohadilla tailandesa entre cuatro cuencos. Espolvorear con cilantro y un chorrito de lima."], "url": "www_bbc_co_uk_food_recipes_kingprawnpadthai_86372", "title": "King gambas tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva", "pequeño frasco de mayonesa", "1 limón, solo jugo", "2 dientes de ajo", "2-3 anchoas", "alcaparras, fritas como guarnición", "pan, para picatostes, 1 rebanada por persona", "1 ramita de tomillo", "1 diente de ajo", "Tocino de 110 g / 4 oz, frito hasta que quede crujiente", "joven cos o romana, 1 pequeña lechuga por persona", "langostinos, 3 por persona", "1 lima, solo jugo", "2 lonchas de tocino frito, para decorar"], "method": ["Combine los ingredientes del aderezo para hacer la salsa César.", "Triture la lechuga.", "Mezcle en el aderezo.", "Agregue las anchoas y los lardons crujientes.", "Rebana las gambas y agrega el jugo de lima.", "Haga los croutones cortando y friendo el pan con el tomillo y el ajo.", "Sirva la ensalada con los crotones y gambas, adorne con dos lonchas de tocino en la parte superior."], "url": "www_bbc_co_uk_food_recipes_kingprawnsalad_66106", "title": "Ensalada de langostinos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 cebolla, finamente picada", "sal y pimienta", "1 cucharadita de curry en polvo", "300 g / 10 oz de arroz", "500ml / 18fl oz de caldo de verduras, hecho de un cubo común", "4 huevos", "Volquetes de 160 g / 5½ oz", "Guisantes congelados de 200g / 7oz, descongelados"], "method": ["Derrita la mantequilla a fuego medio en una sartén de lados altos con una tapa o una cacerola amplia y poco profunda con tapa. Una vez derretido, agregue la cebolla junto con una pizca de sal y fríe suavemente durante 5-6 minutos, o hasta que se suavice. Agregue el polvo de curry y cocine por 1-2 minutos, o hasta que esté aromático.", "Agregue el arroz y revuelva para cubrir con la mezcla de cebolla. Sazonar con una pizca de sal y pimienta, luego agregar el caldo y llevar a fuego lento. Reduzca el calor a la configuración más baja y cubra con una tapa. Cocine por 12 minutos o hasta que el arroz esté tierno.", "Mientras el arroz se cocina, hierve los huevos. Calentar una olla de agua y, una vez que hierva, agregar los huevos y hervir durante ocho minutos. Una vez hervidos, escurrirlos y pasarlos a agua fría para enfriarlos. Pelar y cortar en cuartos a lo largo.", "Ponga a hervir un poco de agua en una sartén grande y poco profunda, agregue los arenques y cocine durante cuatro minutos hasta que se cocinen. Transfiera el pescado a un plato y déjelo a un lado hasta que esté lo suficientemente frío como para manipularlo, luego divida la carne en escamas grandes descartando los huesos y la piel.", "Una vez que el arroz esté cocido, agregue los guisantes descongelados y los arenques en copos. Cocine suavemente durante 3-4 minutos para calentar todo. Pruebe y sazone con sal y pimienta al gusto. Sirva con los cuartos de huevos diseminados por el kedgeree. Comer caliente"], "url": "www_bbc_co_uk_food_recipes_kipper_kedgeree_26508", "title": "Kedperree Kipper", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de kipper", "400ml / 14fl oz de leche entera", "450g / 1lb de papas harinas (como King Edward o Maris Piper), peladas, cortadas en trozos de igual tamaño, hervidas hasta que estén tiernas", "2 cucharadas de perejil fresco picado", "1 yema de huevo de gallinas camperas", "sal y pimienta negra recién molida", "Harina normal de 200g / 7oz", "3 huevos de gallinas camperas, golpeados", "Pan rallado panko japonés de 200g / 7oz (disponible en sitios web especializados y algunos supermercados asiáticos)", "2 cucharadas de aceite de oliva", "2 yemas de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "½ cucharadita de mostaza Dijon", "1 cucharadita de sal", "275ml / 10 fl oz aceite de colza", "2 cornichons, drenados, finamente picados", "2 cucharaditas de alcaparras, escurridas, finamente picadas", "1 cucharada de perejil fresco picado", "1 cucharadita de cebolletas frescas picadas", "1 limón, solo jugo", "sal y pimienta negra recién molida", "2 manojos de hojas de berro, lavadas", "1 cucharada de aceite de oliva extra virgen", "Sal y pimienta negra recién molida", "cuñas de limón, para servir"], "method": ["Para las croquetas de pescado kipper, coloque los arenques y la leche en una cacerola y deje que hierva. Retirar del fuego y reservar para enfriar. Una vez frío, escurre y desmenuce el pescado, quitando la mayor cantidad de huesos posible y déjelo a un lado. (Deseche la leche)", "Aplaste las papas cocidas en un tazón grande hasta que estén suaves, luego agregue el perejil, la yema de huevo y los arenques ahumados. Sazonar, al gusto, con sal y pimienta negra recién molida. Revuelva hasta que esté bien combinado.", "Forme la mezcla en cuatro hamburguesas del mismo tamaño, luego enfríe en la nevera durante dos horas.", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvorear las migas panko japonesas en un plato aparte. Una vez que los pasteles de pescado se hayan enfriado, drague cada uno en la harina, luego sumérjalos en el huevo y finalmente revuelva en las migas de pan.", "Calentar el aceite de oliva en una sartén a fuego medio y freír las tartas de pescado durante tres minutos por cada lado, o hasta que estén doradas por cada lado. Mantenga caliente en el horno.", "Para la salsa tártara, mezcle las yemas de huevo, el vinagre de vino blanco, la mostaza de Dijon y la sal en un procesador de alimentos. Mientras el motor está funcionando, vierta gradualmente el aceite en el procesador de alimentos en un flujo constante hasta que la mezcla se espese. Agregue los cornichons, las alcaparras, el perejil, el cebollín y el jugo de limón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la ensalada de berros, coloque el berro en un recipiente, agregue el aceite y sazone, al gusto, con sal y pimienta negra recién molida. Mezcle hasta que esté bien combinado.", "Para servir, espolvorea la salsa tartare en cuatro cuencos pequeños y coloca uno en cada uno de los cuatro platos para servir, junto con un pastel de pescado kipper. Divida la ensalada de berros entre los platos y decore con las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_kipperfishcakeswitht_92672", "title": "Tartaletas de pescado con salsa tártara y ensalada de berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 arenques ahumados sin ahumar (preferiblemente Whitby, Isla de Man o Escocés)", "450ml / 16fl oz de agua hirviendo", "25g / 1oz de mantequilla", "1 cebolla, finamente picada", "1 cucharadita de polvo de curry caliente", "225g / 8oz de arroz basmati", "Crema doble 110ml / 4fl oz", "½ limón, solo jugo", "sal y pimienta negra recién molida", "3 huevos, duro, pelado, toscamente picado", "3 cucharadas de perejil fresco de flatleaf recién picado"], "method": ["Coloque los arenques en una fuente honda para hornear y vierta sobre el agua hirviendo.", "Deje los arenques en el agua durante cinco minutos, luego retírelos y déjelos a un lado, reservando el líquido de remojo.", "Retire con cuidado la carne del pescado, teniendo cuidado de eliminar todos los huesos. Coloque la carne de kipper en un recipiente y reserve.", "Mientras tanto, caliente una sartén con tapa hasta que esté caliente y luego agregue la mantequilla. Una vez que la mantequilla se haya derretido, agregue las cebollas y fría por 3-4 minutos, hasta que estén suaves pero no coloreadas.", "Agregue el polvo de curry y cocine por un minuto más.", "Agregue el arroz y revuelva para cubrir bien en la mantequilla y las cebollas.", "Agregue el líquido de remojo de kipper reservado y caliente a fuego lento, luego cubra con la tapa y cocine por 12-15 minutos, hasta que el arroz esté tierno y todo el líquido haya sido absorbido.", "Agregue la crema doble y el jugo de limón.", "Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar la carne de kipper, los huevos y el perejil. Revuelva suavemente para combinar sin romper demasiado la carne de kipper.", "Para servir, espárzalos en tazones calientes."], "url": "www_bbc_co_uk_food_recipes_kipperkedgeree_87265", "title": "Kedperree Kipper", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "100g / 3½oz de queso crema", "2 cebollas tiernas, finamente picadas", "1 kipper, piel quitada y picada", "50g / 1¾oz de yogur griego", "1 lima, solo jugo", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida", "50g / 1¾oz de alcaparras", "50ml / 2fl oz de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "1 remolacha cocida, finamente picada", "1 cucharada de cebolla roja, finamente picada", "1 cucharada de perifollo fresco finamente picado", "1 cucharada de eneldo fresco picado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 rebanada de soda lista de soda"], "method": ["Para hacer el paté de kipper, coloque todos los ingredientes de paté en un procesador de alimentos, sazone con sal y pimienta negra recién molida y mezcle hasta lograr una pasta homogénea.", "Para hacer el aderezo, coloque las alcaparras y el aceite de oliva en un procesador de alimentos limpio. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar hasta que quede suave.", "Para hacer la salsa, mezcle el jugo de limón y el aceite de oliva en un tazón grande.", "Agregue la remolacha, la cebolla y las hierbas, condimente al gusto, con sal y pimienta negra recién molida y mezcle para cubrir la remolacha.", "Para hacer la bruschetta, caliente una sartén hasta que fume. Rocíe la sopa de soda con aceite de oliva, sazone al gusto con sal y pimienta negra recién molida y póngala en la sartén a la parrilla durante dos minutos por cada lado. Retire de la plancha y corte el farl en rebanadas iguales.", "Para servir, cuchara el paté en el centro de un plato. Rocíe el aderezo y la salsa de remolacha alrededor del plato y sirva la brocheta de soda farl al lado."], "url": "www_bbc_co_uk_food_recipes_kipperpatewithbrusce_80190", "title": "Paté de paté con bruschetta, salsa de remolacha y salsa de alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 arenques frescos", "100 g / 4 oz de mantequilla, suavizada (no fundida)", "3 cucharadas de perejil fresco de flatleaf, picado", "¼ de manzana, rallado", "50ml / 2floz sidra", "1 lima, jugo y ralladura solamente", "pan de molde, para servir"], "method": ["Coloque los arenques en una jarra alta con las colas sobresaliendo de la parte superior. Vierte agua hirviendo cuidadosamente en la jarra, hasta la parte superior. Deje reposar.", "Mientras tanto, mezcle la mantequilla y el perejil picado en un tazón. Poco a poco agregue la manzana rallada y la sidra y deje de lado.", "Después de que los arenques hayan estado en el agua durante unos 2-3 minutos, escurra bien y transfiera los arenques a un plato.", "Vierta la mantequilla sobre los arenques y adorne con el jugo de limón y la ralladura.", "Sirve con pan rebanado."], "url": "www_bbc_co_uk_food_recipes_kipperscookedinajugw_83916", "title": "Kippers cocinados en una jarra con sidra y mantequilla de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 lonchas de tocino rayado, fritas hasta que estén crujientes", "500g / 1lb 2oz de patatas nuevas, cocinadas y partidas por la mitad", "Espinaca 350g / 12oz, lavada y seca", "Filete de 3 kipper, sin huesos, copos", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 diente de ajo, picado", "2 cucharaditas de mostaza integral", "sal y pimienta negra recién molida", "4 huevos de gallinas camperas, escalfados, para servir"], "method": ["Para la ensalada, coloque todos los ingredientes de la ensalada en un tazón grande y revuelva suavemente.", "Para el aderezo, coloque todos los ingredientes del aderezo en un tazón y mezcle bien. Vierta el aderezo sobre la ensalada y revuelva para cubrir los ingredientes de la ensalada.", "Para servir, coloque la ensalada en un plato para servir y cubra con el huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_kipperspinachbaconan_86151", "title": "Kipper, espinaca, tocino y ensalada de patata nueva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kipperspinachbaconan_86151_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de frambuesas frescas", "2 cucharadas de azúcar glas", "1 mango maduro, pelado, sin hueso, cortado en cubitos", "150g / 5½oz de arándanos frescos", "12 bolas de helado de vainilla", "25 g / 1 oz de pistachos, picado grueso"], "method": ["Para el coulis de frambuesa, mida 250 g / 9 oz de las frambuesas en un procesador de alimentos, agregue el azúcar glas y el pulso hasta que quede suave.", "Incline el puré de frambuesa en un colador sobre un tazón. Use una cuchara de metal para empujar la pulpa de la fruta a través del tamiz. Descarta las semillas.", "Divida la mitad del mango en cubos entre seis vasos de helado. Divida la mitad de los arándanos entre los vasos, colocándolos encima del mango. Siente una bola de helado en la parte superior de cada capa de arándanos, rocíe más de la mitad de los coulis de frambuesa y la mitad de las frambuesas. Repita la estratificación de nuevo para usar los ingredientes restantes y cubra con los pistachos picados."], "url": "www_bbc_co_uk_food_recipes_knickerbocker_glory_59895", "title": "Gloria de Knickerbocker", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/knickerbocker_glory_59895_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["570ml / 1 pinta de crema doble", "300ml / ½ pinta de leche entera", "2 yemas de huevo", "100 g / 4 oz de azúcar en polvo", "Budín de Navidad de 100g / 4oz", "4 naranjas, 1 zested, 4 jugo", "175g / 7oz de mantequilla sin sal, cortada en cubitos", "4 yemas de huevo", "100 g / 4 oz de azúcar en polvo", "1 lata de leche condensada, etiqueta eliminada", "100g / 4 oz de miel", "125g / 5 oz de jarabe de glucosa", "300 g / 12 oz de azúcar en polvo", "90ml / 3fl oz de agua", "1 cucharada de bicarbonato de soda", "100 g / 4 oz% 2070%% 20cocoa% 20chocolate,% 20broken% 20into% 20 piezas", "15-20 cerezas, todas menos 6 colocadas, tallo eliminado y reducido a la mitad", "15 uvas rojas, partidas a la mitad y sin semillas", "15 frambuesas, cortadas a la mitad", "15 arándanos, cortados a la mitad", "Crema doble de 290 ml / ½ pinta, ligeramente azotada"], "method": ["Para hacer el nido de abeja, forra una bandeja de asar pequeña pero profunda con un pergamino para hornear. Coloque la miel, el jarabe de glucosa, el azúcar y el agua en una bandeja grande y cuidadosamente tome la mezcla a 150 ° C / 300 ° F. Agregue el bicarbonato de soda y agregue rápidamente. Mire cuidadosamente la espuma de la mezcla hacia arriba y aumente de volumen durante 1 minuto y luego vierta rápidamente en la lata forrada. El panal se establecerá muy rápido. Cuando esté frío, hazte pedazos. Doble a través de la crema batida al servir.", "Para la base de ambos helados, caliente suavemente la leche y la crema juntas en una sartén mediana hasta que empiecen a hervir. Batir las yemas de huevo y el azúcar juntos en un tazón grande hasta que estén suaves y esponjosos y duplicar su tamaño. Poco a poco agregue un poco de la mezcla calentada a la mezcla de huevo y azúcar, revolviendo todo el tiempo hasta que todo se haya incorporado. Regrese la mezcla a la sartén y cálida suavemente, revolviendo todo el tiempo, hasta que se espese lo suficiente como para cubrir la parte posterior de la cuchara. Dejar enfriar un poco.", "Divida la mezcla en dos y agite cada mitad por separado en una máquina de helados (operada de acuerdo con las instrucciones del fabricante) durante el tiempo requerido. Cuando el primer lote esté casi listo, revuelva el pudín de Navidad para combinar y congelar en un recipiente adecuado.", "Como el segundo lote está batiendo, prepare la cuajada de naranja. Reduzca el jugo de naranja y la ralladura a la mitad. Batir la mantequilla para derretir. Batir las yemas de huevo y el azúcar hasta que estén pálidos y esponjosos y duplicar el volumen. Poco a poco agregue un poco de la mezcla de naranja a la mezcla de huevo y azúcar, revolviendo todo el tiempo hasta que todo se haya incorporado. Regrese la mezcla a la sartén y cálida suavemente, revolviendo todo el tiempo, hasta que se espese lo suficiente como para cubrir la parte posterior de la cuchara. Dejar enfriar un poco. Revuelva la cuajada de naranja en el helado unos minutos antes del final del tiempo de batido. Congelar.", "Para la salsa toffee, simplemente coloque la lata en una cacerola de base pesada y cúbrala con agua. Cubra con una tapa ajustada, deje hervir y reduzca a fuego lento durante aproximadamente 3 horas. Retírelo y déjelo enfriar ligeramente. Abra con cuidado la lata con un abridor y saque la salsa toffee.", "Derrita el chocolate en un tazón sobre una fuente de agua hirviendo.", "Mezcle la fruta, reservando las 6 cerezas enteras.", "Para servir, alternativamente, coloque cada uno de los componentes en 6 vasos altos (alrededor de 25,5 cm / 10 pulgadas) de alto calibre para que las capas se puedan identificar claramente. Termine con un poco de la crema de panal y cubra cada una con una cereza reservada. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_knickerbockerglory_9379", "title": "Gloria de Knickerbocker", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/knickerbockerglory_9379_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 lb de cordero picado", "2 o 3 cebollas de primavera, finamente picadas", "2 chiles verdes, finamente picados", "1 cucharada de cilantro fresco, picado", "1 cucharadita de pimienta de Jamaica molida", "1 cucharadita de canela molida", "1 cucharadita de sal masala", "1 cucharadita de pimienta negra recién molida", "1 cucharadita de pasta de ajo", "1 cucharadita de pasta de jengibre", "sal al gusto", "75ml / 2½fl oz de aceite vegetal", "2 cebollas grandes, finamente cortadas", "150 ml / 5 fl oz oz yogur", "3 chiles verdes", "1 cilantro fresco pequeño racimo", "1 cucharada de menta fresca picada", "1 cucharadita de pasta de ajo", "1 cucharadita de pasta de jengibre", "1 cucharadita de semillas de comino molidas", "1 cucharadita de sal masala", "1 cucharadita de semillas de hinojo molido", "½ cucharadita de pimienta negra recién molida", "¼ cucharadita de cúrcuma molida", "1 cucharadita de jugo de limón", "sal al gusto", "800ml / 2 pintas de agua caliente", "puñado de almendras copos tostados", "1 cucharada de cebollas fritas (reservadas de cebollas fritas para salsa verde)", "2 cucharadas de crema individual", "1 cucharada de menta recién picada", "400g / 14oz de arroz basmati", "2 limones, jugo de ambos y cáscara de 1 solo", "Jengibre de raíz de 1 cm / ½ en trozos finamente cortados en tiras de juliana", "pizca de sal", "1 cucharadita de ghee (mantequilla clarificada)", "800 ml / 1 pinta 9 fl oz de agua", "pizca de cúrcuma"], "method": ["Para hacer las koftas, mezcle todos los ingredientes kofta en un tazón y mezcle bien.", "Forma en los tamaños de pelota de golf.", "Para la salsa verde, caliente el aceite en una olla antiadherente. Agregue las cebollas en rodajas y fría hasta que estén doradas. Retire y mantenga a un lado, reservando el aceite en la sartén.", "Coloque todos los demás ingredientes de salsa verde, excepto el aceite y el agua reservados, en un procesador de alimentos o licuadora. Agregue todas menos una cucharada de las cebollas fritas (que usará para la guarnición) y mezcle para formar una pasta suave.", "Usando la misma olla en la que las cebollas se han frito, recaliente el aceite reservado y agregue la pasta de especias a la sartén. Freír por lo menos 2-5 minutos.", "Agregue el agua caliente a la sartén y deje que hierva. Asegúrate de que la salsa esté burbujeante, luego agrega los koftas. Regrese a ebullición y cocine a fuego lento durante al menos 30-45 minutos, parcialmente cubierto, para permitir que la salsa se espese y reduzca.", "Una vez que el aceite comience a separarse de la salsa, los koftas deben estar listos.", "Para el arroz con limón y jengibre, lave el arroz en agua caliente y enjuague varias veces con agua fría para eliminar la mayor cantidad de almidón posible. Cubra el arroz con abundante agua fría, agregue un poco de sal y remoje durante al menos media hora, luego escurra.", "Coloque el jugo de limón y la ralladura, la mitad de la juliana de jengibre, la sal y una cucharadita de ghee en una sartén grande de fondo grueso. Agregar el agua y llevar a ebullición. Permita que el jengibre se ablande levemente y luego agregue el arroz drenado y la cúrcuma. Revuelva dos veces y cocine el arroz hasta que el líquido se reduzca.", "Cuando el líquido comience a burbujear, notará que el arroz formará cráteres. Tan pronto como esto suceda, reduzca el fuego a fuego lento. Coloque un paño seco sobre la olla y cubra con una tapa. Deje hervir a fuego lento durante al menos 10 minutos. No abra la tapa durante esta etapa.", "Después de 10 minutos, retírelo del fuego.", "Para servir, adornar las koftas con las cebollas fritas reservadas, almendras tostadas, crema y menta fresca y servir con el limón y el arroz con jengibre."], "url": "www_bbc_co_uk_food_recipes_koftaharamasalaindia_77145", "title": "Kofta hara masala (albóndigas de la India en salsa verde)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "2 pechuga de pollo deshuesada, cortada en cuatro trozos, espolvoreada con poca harina, sal, pimienta negra recién molida y canela molida", "Anís de 2 estrellas", "2.5cm / 1in canela en rama", "2-3 vainas de cardamomo verde, ligeramente trituradas", "4 dientes", "4-6 granos de pimienta negra", "1 cuchilla", "1 guindilla verde, hendidura abierta", "20g / ¾oz de jengibre fresco, pelado, rebanado en cerillas", "2 cebollas medianas, en rodajas finas", "8-10 hojas frescas de curry", "1 cucharadita de cúrcuma molida", "2 cucharaditas de cilantro molido", "½ cucharadita de pimienta negra molida", "¼ cucharadita de canela molida", "Leche de coco 400ml / 14fl oz", "10-12 ciruela bebé o tomates cherry", "arroz al vapor", "hojas de apio picadas", "shiso berro (o berrinche si no está disponible)"], "method": ["Caliente una cucharada de aceite vegetal en una sartén grande a fuego lento. Cuando el aceite esté caliente, agregue los trozos de pechuga de pollo y fría con cuidado, pero no deje que se coloreen. Cuando los trozos de pollo estén casi cocidos, retírelos de la sartén y déjelos a un lado hasta que se los requiera.", "Caliente las dos cucharadas restantes de aceite vegetal y agregue la ramita de canela, las vainas de cardamomo, los clavos de olor, la pimienta y la maza. Freír hasta que las especias empiecen a crujir, luego agregue el chile, el jengibre, la cebolla y las hojas de curry.", "Freír las especias y las cebollas durante 4-5 minutos, o hasta que las cebollas sean translúcidas.", "Agregue la cúrcuma, el cilantro, la pimienta negra y el polvo de canela y continúe freír durante 2-3 minutos.", "Agregue la leche de coco y el calor a fuego lento.", "Agregue las piezas de pollo cocidas y los tomates y cocine a fuego lento durante 3-4 minutos, o hasta que el pollo esté completamente cocido (no debe quedar rosa cuando se corta el pollo).", "Para servir, coloque una cucharada de arroz al vapor en cada plato y luego coloque una cucharada del guiso de pollo al lado. Adorne con apio y shisho berro."], "url": "www_bbc_co_uk_food_recipes_koliishtewchickenste_87479", "title": "Koli ishtew (guiso de pollo)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/koliishtewchickenste_87479_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lima, solo jugo", "2 cucharadas de polvo de cúrcuma", "4 pequeñas lubinas enteras o brillantes, que pesan aproximadamente 300-350 g / 10½ -12 oz cada una, con mariposa, cabeza izquierda (preferiblemente), puedes pedirle a tu pescadero que haga esto por ti", "Gambas de 500g / 1lb 2oz, desvenado y picado", "2-3 chiles verdes, picados", "Jengibre de 5 cm / 2 en pieza, finamente picado", "15-20 hojas de menta fresca picadas", "6-8 tallos de cilantro con hojas picadas", "½ cucharadita de sal", "aceite vegetal, para freír", "3 cucharadas de aceite vegetal", "canela, aproximadamente 7cm / 2¾in", "2 cebollas, finamente picadas", "1 cucharadita de chile rojo en polvo", "2 cucharaditas de comino en polvo", "1 cucharada de polvo de cilantro", "2 cucharadas de vinagre de sidra", "5 cm / 2 en pieza de jengibre, picado", "3 dientes de ajo picados", "3 chiles verdes frescos, toscamente picados", "4 tomates medianos, picados", "2-3 cucharadas de pulpa de tamarindo", "5cm / 2in pedazo de azúcar moreno o de caña", "2 cucharadas de cilantro picado", "arroz al vapor", "chapatis", "4 cucharadas de cilantro fresco picado"], "method": ["Mezcle la mitad del jugo de lima con la cúrcuma. Aplicar dentro de todos los peces y dejar de lado.", "Coloque las gambas y los ingredientes restantes (aparte del aceite) en una licuadora y mezcle. Sazone con más sal si es necesario y agregue el jugo de limón restante. Llene cada pez con la mezcla de gambas. Presione el pescado hacia abajo para obtener una forma recta y transfiéralo a la nevera.", "Mientras tanto, haz la patia. Calentar el aceite en una cacerola profunda y agregar la canela y cocinar por 30 segundos. Agregue las cebollas y saltee hasta que estén suaves y doradas, revolviendo regularmente.", "Mientras tanto, mezcle los polvos secos en un tazón pequeño con el vinagre y un poco de agua para hacer una pasta suave. Cubra y reserve.", "Cuando las cebollas estén doradas agregar el jengibre, el ajo y los chiles. Sofríe por 2-3 minutos. Agregue un poco de agua a la sartén para liberar los azúcares de la cebolla pegada al fondo de la sartén.", "Agregue los polvos mezclados a la sartén. Cuando la mezcla se seque, agregue los tomates, el tamarindo y el azúcar moreno y cocine suavemente durante 4-5 minutos más. Sazonar con sal, agregar el cilantro y retirar del fuego.", "Precalentar el horno a 160C / 140C Fan / Gas 3.", "Para cocinar el pescado, caliente el aceite en una sartén grande con un mango a prueba de horno. Con cuidado agregue el pescado a la sartén y cocine a fuego medio. Cuando el pez se haya dorado por un lado, déle la vuelta. La mejor manera es girar el pez desde el centro y mantener un tenedor o una espátula en la parte superior y una rebanada de pescado plana o una espátula en la parte inferior.", "Cuando ambos lados del pescado estén dorados, colóquelos en el horno durante 10-12 minutos hasta que estén cocidos.", "Divida el pescado entre 4 platos y vierta sobre la patia. Espolvoree el cilantro en la parte superior y sirva con arroz al vapor o chapatis calientes."], "url": "www_bbc_co_uk_food_recipes_kolmi_ni_bharaei_34818", "title": "Lubina rellena india con una patia de tomate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 dientes de ajo, pelados", "½ cebolla", "½ pera, sin corazón", "5 cucharadas de salsa de soja", "3 cucharadas de azúcar en polvo", "2 cucharadas de aceite de sésamo", "3 cucharadas de mirin", "pizca de pimienta negra agrietada", "2 pechugas de pollo grandes, cortadas en tiras finas", "220g / 8oz de arroz integral", "2 cucharadas de aceite de cacahuete", "4 huevos de gallinas camperas", "200g / 7oz de kimchi listo para usar, para servir"], "method": ["Para hacer el adobo, rellene el ajo, la cebolla y la pera en un procesador de alimentos y colóquelos en un tazón. Agregue la soja, el azúcar, 5 cucharadas de agua, aceite de sésamo, mirin y pimienta y mezcle bien. Agregue el pollo y revuelva para combinar. Cubra y deje marinar en la nevera durante una hora.", "Después de media hora, ponga a hervir un recipiente con agua, agregue el arroz y cocínelo durante 25 - 30 minutos o hasta que esté tierno. Escurrir y apartar.", "Calentar un wok a fuego alto y sofreír el pollo durante 4 - 5 minutos, hasta que esté cocido y dorado.", "Mientras tanto, caliente el aceite en una sartén grande y rompa los huevos. Fría a su gusto, hilvanando la yema con el aceite para asegurarse de que esté cocida.", "Para servir, coloque el arroz en un recipiente y cubra con el pollo, el huevo frito y una cucharada de kimchi."], "url": "www_bbc_co_uk_food_recipes_korean_bulgogi_chicken_43080", "title": "Pollo bulgogi coreano salteado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/korean_bulgogi_chicken_43080_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8-10 piezas de pollo (los muslos funcionan mejor), sin espinas, sin piel", "100 g / 3½ oz de azúcar en polvo", "75g / 2½oz de sal marina", "200ml / 7fl oz de agua caliente", "2 cucharadas de harina normal", "1 cucharada de harina de maíz", "1 cucharadita de polvo de hornear", "1 cucharadita de sal", "125g / 4½oz de harina natural", "25g / 1 oz de harina de maíz", "½ cucharadita de sal", "½ cucharadita de polvo de hornear", "Vodka 100 ml / 3½ fl oz", "100 ml / 3½ fl oz de salsa de soja", "25ml / 1fl oz", "25ml / 1fl oz de vinagre de vino de arroz", "Jengibre fresco de la raíz de los 2cm / ¾in en pedazos, rallado", "2 dientes de ajo rallados", "50g / 1¾oz de azúcar moreno", "algunas gotas de aceite de sésamo", "1 cucharada de harina de maíz", "semillas de sésamo, para rociar", "2 cucharadas de pasta de chile coreano (gochujang si puedes conseguirlo)", "1 cucharada de salsa picante", "1 cucharadita de vinagre de vino de arroz", "1 cucharada de miel", "algunas gotas de aceite de sésamo"], "method": ["Comience por salmuera del pollo. Disuelva el azúcar y la sal en el agua caliente, luego mezcle 1 litro / 1¾ pinta de agua fría en la solución de salmuera. Sumerja el pollo y déjelo reposar, tapado, durante 2 horas. Mientras tanto, prepara las salsas.", "Para la salsa de soja dulce, coloca la soja, el mirin, el vinagre de vino de arroz, el jengibre, el ajo y el azúcar en una cacerola. Revuelva a fuego lento hasta que el azúcar se disuelva y cocine a fuego lento durante 2 minutos. Pruebe el condimento y agregue un poco de sal si es necesario. Agregue aceite de sésamo al gusto. Batir la harina de maíz con un poco de agua fría hasta que tenga una pasta suave pero muy líquida, luego mezcle esto en la salsa a fuego lento, hasta que la salsa espese muy ligeramente. Dejar de lado.", "Para la salsa de chile, mezcle todos los ingredientes, adelgazando con un poco de agua si es demasiado espeso. Pruebe y agregue sal si es necesario.", "Para cocinar el pollo, escurra y enjuague bien el pollo en salmuera, luego séquelo. Haga la primera capa (este es el recubrimiento que la masa se pegará, de lo contrario, tiende a desprenderse) batiendo la harina, la harina de maíz, el polvo de hornear y la sal. Espolvorea el pollo en esta mezcla, acariciando cualquier exceso, y deja reposar mientras preparas el batido.", "Para la mezcla, mezcle los ingredientes secos, mezcle 100 ml / 3½ de agua fría y el vodka, la textura debe ser bastante delgada, como crema doble.", "Agregue aceite a la freidora, a la olla grande o al wok, asegurándose de no llenarlo más allá de la mitad. Calentar el aceite a 160C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las piezas de pollo en la mezcla de a una por vez. Permita que cualquier exceso gotee sobre el tazón, luego baje lentamente en el aceite caliente, soltándolo cuando la pieza de pollo esté casi sumergida. Freír durante 8-10 minutos, luego escurrir y poner en papel de cocina: el pollo debe estar bien cocido, pero casi no ha adquirido ningún color. Encienda el fuego a 190 ° C o, si usa una olla, suba el fuego y déjelo durante unos 5 minutos para alcanzar la temperatura adecuada. Freír el pollo durante otros 2 minutos, o hasta que se haya oscurecido. Retire y escurra bien sobre papel de cocina. Debería ser maravillosamente nítido. Puede servirlo con las salsas, o puede aplicar un poco de salsa de soja sobre él y servirlo con la salsa de chile."], "url": "www_bbc_co_uk_food_recipes_korean_fried_chicken_51459", "title": "Pollo frito coreano", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/korean_fried_chicken_51459_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cortes cortos de carne de vacuno de 800 g / 1 lb 12 oz, LA o corte flanqueado, enjuagado", "5 cucharadas de salsa de soja", "2 cucharadas de aceite de semilla de sésamo tostado", "3 cucharadas de miel líquida", "2 cucharadas de mirin", "½ asiática o 1 pera regular, pelada, sin corazón y picada", "½ cebolla, más o menos picada", "6 dientes de ajo, aplastados", "4cm / 1½ en pieza de jengibre fresco de raíz, pelado y finamente rallado", "½ cucharadita de pimienta negra recién molida"], "method": ["Coloque las costillas en una bandeja honda para hornear. Llene con suficiente agua para sumergirlos, cubra, luego remoje durante 30-45 minutos, cambiando el agua una o dos veces. Desagüe.", "Mientras tanto, ponga todos los ingredientes restantes en un procesador de alimentos y mezcle hasta que quede suave. Coloque las costillas empapadas y el adobo en una bandeja para hornear o en un recipiente ancho y plano. Usando sus manos, masajee la salsa en la carne. Cubra y refrigere toda la noche.", "Si cocina en la cocina, coloque una sartén gruesa a fuego medio-alto. Cuando esté caliente, agregue las costillas a la sartén en lotes y cocine durante 6 minutos en cada lado.", "Si está haciendo una barbacoa, coloque la parrilla a 12-15 cm por encima de la llama. Cocine las costillas durante 6 minutos en cada lado, volteándolas de vez en cuando para cocinarlas uniformemente, hasta que estén doradas y ligeramente carbonizadas en algunos lugares.", "Una vez cocinado, use un par de tijeras para cortar la tira de huesos y deseche, luego corte la carne en trozos del tamaño de un bocado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_korean_grilled_beef_72703", "title": "Costillas cortas de res a la parrilla coreana (galbi gui)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas de 750 g / 1 lb 10 oz, idealmente Desiree, sin pelar y lavadas", "2 huevos de gallinas camperas", "400 g / 14 oz de carne picada", "1 cebolla rallada", "1 cucharadita de cúrcuma molida", "1 cucharadita de comino molido", "buena ralladura de nuez moscada fresca", "½ cucharadita de canela molida", "aceite vegetal, para freír poco", "50g / 1¾oz de harina natural", "100 g / 3½ oz de semillas de sésamo", "sal y pimienta negra recién molida", "15g / ½ oz de albahaca fresca, hojas recogidas", "25g / 1oz de perejil fresco, hojas recogidas", "15 g / ½ oz de menta fresca, hojas recogidas", "4 tomates, sin semillas y picados", "Pepinillos 175g / 6oz, picados", "½ pepino, sin semillas y en rodajas", "½ limón, solo jugo", "4 cucharadas de aceite de oliva virgen extra"], "method": ["Pon las papas en una olla mediana. Cubra con agua hirviendo y cocine a fuego lento durante 35-50 minutos, o hasta que esté tierna hasta la punta de un cuchillo.", "Retirar del fuego, escurrir y dejar enfriar. Despegue las pieles y deséchelas. Ralla las papas en un tazón grande, agrieta los huevos y agrega la carne, la cebolla y las especias. Sazonar bien y mezclar con las manos.", "Divida la mezcla en 20 bolas, luego aplaste y dé forma a cada una en una lágrima.", "Caliente el aceite en una sartén grande a fuego medio.", "Combina la harina y las semillas de sésamo en un plato. Cubra cada kotlet en la mezcla harinosa, sacudiendo cualquier exceso, luego fríe en lotes durante 3-4 minutos en cada lado, o hasta que estén dorados y cocidos. Escurrir sobre papel de cocina.", "Para hacer la ensalada, mezcle todos los ingredientes. Sirve junto a los kotlets."], "url": "www_bbc_co_uk_food_recipes_kotlets_with_herb_salad_24141", "title": "Ketlets con ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kotlets_with_herb_salad_24141_16x9.jpg", "isVegetarian": false, "recommendations": 0}]