[{"isVegetarian": false, "title": "Braised sea bass with leeks and mushrooms", "url": "www_bbc_co_uk_food_recipes_braisedseabasswithle_92838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "½ onion, peeled, chopped", "6 baby chestnut mushrooms", "salt and freshly ground black pepper", "200ml/7fl oz fish stock", "1 sea bass fillet, skin removed", "50ml/2fl oz double cream", "1 tbsp chopped fresh chives", "25g/1oz butter", "5 baby leeks, blanched for 6 minutes in boiling water, drained", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, melt the butter in a sauté pan over a medium heat. Add the chopped onion and sauté for 4-5 minutes, or until softened.", "Add the mushrooms to the pan and cook for another 2-3 minutes. Season, to taste, with salt and freshly ground black pepper. ", "Pour in the stock, bring to the boil, then reduce the heat until the mixture is simmering. Place the sea bass into the mixture, cover the pan with a lid and poach for 6-8 minutes, or until the sea bass is cooked through and opaque. Remove the sea bass from the pan and set aside to rest on a serving plate.", "Pour the cream into the poaching liquid, return to the boil and cook for 3-4 minutes, or until the volume of the liquid has reduced. Season, to taste, with salt and freshly ground black pepper, then stir in half of the chopped chives.", "Meanwhile, for the leeks, melt the butter in a frying pan over a medium heat. Add the blanched leeks and fry for 2-3 minutes. Season, to taste, with salt and freshly ground black pepper.", "To serve, pour the cream sauce over the fish, spoon the leeks alongside and sprinkle with the remaining chopped chives."]}, {"isVegetarian": false, "title": "Braised shin of beef", "url": "www_bbc_co_uk_food_recipes_braisedshinofbeef_73258", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "500g/1lb 2oz un-smoked pancetta, chopped into large cubes ", "1.5kg/3lb 5oz shin of beef, sliced into 2.5cm/1in wide rounds", "85ml/3fl oz red wine", "1kg/2¼lb large organic winter carrots, peeled and roughly chopped", "1 head of celery, roughly chopped", "1kg/2¼lb pickling onions or shallots", "1kg/2¼lb tomatoes, roasted and sieved to a purée ", "1 litre/1¾ pints good beef stock or water", "1 bouquet garni", "mashed potatoes, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, heavy-bottomed frying pan. Add the pancetta and fry until brown and crisp. Remove from the pan and add to a large stock pot or casserole dish. ", "Fry the shin of beef in the frying pan, on both sides, until well browned. Transfer the shin to the stock pot.  ", "Pour the red wine into the frying pan and stir, for 2-3 minutes to collect the cooking juices. Tip into the pot. ", "Place the stock pot over a gentle heat. Add the carrots, celery and onions. Pour in the tomato purée and enough stock or water to cover the meat and vegetables. Add the bouquet garni and cover with a lid.", "Simmer for 3-4 hours, stirring occasionally. Serve with mashed potato."]}, {"isVegetarian": false, "title": "Braised short rib and onion cottage pie with bone marrow", "url": "www_bbc_co_uk_food_recipes_braisedshortribandon_91339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4kg/9lb beef short ribs", "salt and freshly ground black pepper", "50ml/1fl oz vegetable oil", "2 carrots, peeled and roughly chopped", "1 leek, roughly chopped", "1 head garlic", "2 tsp black peppercorns", "4 star anise", "6 onions, 3 chopped, 3 sliced", "300ml/10fl oz red wine", "110ml/4fl oz port", "4 litres/7 pints¾fl oz beef stock", "6 sprigs fresh thyme, leaves only", "4-6 x 10cm/4in beef marrow bones", "4-6 sprigs fresh rosemary", "3 large floury potatoes, peeled and cut into pieces", "200ml/7fl oz milk", "200g/7oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the cottage pie filling, season the ribs with salt and freshly ground black pepper.", "Heat a large casserole dish until hot, add half of the vegetable oil and then add the seasoned short ribs. Fry until browned on all sides.", "Remove the ribs from the pan and place onto a wire rack suspended over a plate.", "Add the carrots, leek, garlic, peppercorns, star anise and chopped onion (reserve the sliced onion) and fry for 4-5 minutes, or until golden-brown.", "Add the red wine and port to the pan, bring to a boil and then reduce the heat to a simmer. Cook until syrup-like in consistency and reduced in volume by three-quarters.", "Return the beef ribs to the pan, cover with the beef stock and bring to the boil. Cut out a greaseproof paper lid the size of the pan. Skim off any impurities from the surface of the liquid with a spoon, cover with the greaseproof paper lid, turn the heat down low and simmer for three hours, or until the meat is tender and falling off the bone. ", "When the beef is cooked, strain the liquid, pouring the sauce into a clean saucepan. Set the cooked meat aside.", "Place the liquid onto the heat, bring to the boil and then immediately reduce the heat to a simmer. Continue to simmer until reduced by half, skimming off any excess fat with a spoon.", "Meanwhile, pick the meat from the bones, discarding any fat and sinew. Remove the reduced sauce from the heat and add the picked meat to it. Mix well.", "Heat a frying pan until hot, add the remaining vegetable oil to the pan and the sliced onion. Fry for 5-8 minutes until golden-brown and softened. Stir in the thyme leaves and set aside.", "For the mash, place the potato pieces into a pan of salted water and bring to the boil. Simmer for 15-18 minutes, or until tender. Drain and return the potatoes to the pan to drive off any excess moisture.", "Pass the potatoes through a ricer into a clean bowl (alternatively use a potato masher, though you will not get such as smooth finish).", "Bring the milk and butter to a simmer in a separate pan. Add the hot milk and butter mixture to the potatoes and beat well. Season with salt and freshly ground black pepper and tip the mixture into a piping bag.", "To finish the beef, preheat the oven to 200C/400F/Gas 6. Spoon the braised beef into 4-6 ovenproof dishes and top with the fried onions. Place a marrow bone in the centre of each dish and place the rosemary sprigs in the top of the bone. Pipe the mashed potato onto the meat. ", "Cook in the oven for 15-20 minutes, or until golden and bubbling.", "Serve the braised short rib and onion cottage pie at once."]}, {"isVegetarian": true, "title": "Bramley apple and blackberry millefeuille tart", "url": "www_bbc_co_uk_food_recipes_bramley_apple_and_63079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for flouring", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "25g/1oz icing sugar", "40g/1½oz butter", "2 large Bramley apples, peeled and roughly chopped", "1 vanilla pod, split and seeds scraped", "125g/4½oz blackberries", "1 lemon, juice only", "300ml/10fl oz double cream"], "serves": "Makes 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour in a mound on a clean work surface and make a well in the centre.", "Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add 125ml/4½fl oz of ice cold water and mix until it is all incorporated, but don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly.", "Roll the mixture into a 2.5cm/1in thick rectangle, wrap in cling film and refrigerate for 20 minutes.", "Flour the work surface and roll out the pastry into a 40x20cm/16x8in rectangle.", "Fold the top third down to the centre, then the bottom third up to meet then fold the top over. Give it a quarter-turn.", "Roll the block of pastry into a 40x20cm/16x8in rectangle as before, and repeat the folds. These are the first two turns. Repeat two more times to make four turns.", "Wrap the pastry in cling film and refrigerate for at least 30 minutes before using.", "For the tart, preheat the oven to 220C/425F/Gas 7.", "Roll the pastry out on a lightly floured work surface to about 3-4mm thick. Cut into three rectangles of 7.5x15cm/3x6in and dust the pastry with icing sugar to cover totally.", "Lift the pastry onto a baking tray and bake for 15 minutes. Meanwhile, make the filling.", "Heat a small frying pan until hot, add the butter and apples and cook for a minute, then add 2-3 tablespoons of water and continue to cook.", "Add the vanilla pod and seeds, blackberries and lemon juice and cook for 5-6 minutes, or until softened and pulpy.", "Remove from the heat and cool in the fridge while the pastry cooks.", "Whisk the double cream in a large bowl until firm peaks form when the whisk is removed from the bowl, then spoon into a piping bag.", "Once the pastry is cooked, remove from the oven and leave to cool on a wire rack. Slice the cooled pastry sheets in half widthways through the length of the pastry - you have the same size rectangles as before but half as thick: one glazed piece and one bottom piece for each sheet.", "Spoon the blackberry and apple mixture onto one layer of pastry, then pipe the cream over the top.", "Place another piece of pastry on top and then repeat with another layer of blackberry and apple and cream. ", "Finish with a piece of glazed pastry. Repeat with the remaining pastry and the stacks can then be cut into portions to serve."]}, {"isVegetarian": true, "title": "Bramley apple and blackberry soufflé", "url": "www_bbc_co_uk_food_recipes_bramley_apple_and_81186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz frozen blackberries ", "50g/1¾oz caster sugar", "2 Bramley apples, peeled, cored and roughly chopped", "2 tbsp caster sugar", "squeeze of lemon juice", "½ tsp ground cinnamon", "1/8 nutmeg, grated ", "40g/1½oz softened butter, for greasing", "115g/4oz caster sugar", "175ml/6fl oz milk", "1 vanilla pod, split lengthways", "4 medium free-range eggs, separated", "25g/1oz plain flour", "6 biscuits, such as gingernuts, soaked in a splash of brandy or whisky (optional)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the blackberry coulis, put the blackberries and sugar into a small pan with 100ml/3½fl oz water. Bring to the boil, then simmer for about five minutes, or until the berries break down. Remove from the heat and leave to cool slightly.", "Tip the fruit mixture into a blender and blend to a purée, then strain through a sieve, rubbing it through with the back of a spoon. Set aside until ready to serve. ", "For the apple purée, put all the ingredients into a small saucepan and heat gently, stirring occasionally until the apples break down. Allow to cool slightly and then blend to a smooth purée, either using a hand-blender, or by tipping the mixture into a food processor or blender. Store any leftovers from this recipe in the fridge and use as sauce for roast pork or serve with yoghurt for breakfast.", "For the soufflé, butter four individual 10cm/4in soufflé dishes using upward strokes to encourage the soufflé mixture to rise. Coat the insides with 40g of the sugar.  ", "Heat the milk and 20g/¾oz of the sugar in a small pan. Scrape in the seeds from the vanilla pod and bring slowly to the boil, stirring frequently.   Remove from the heat.", "Whisk the egg yolks and 15g/½oz of the sugar in a bowl to a ribbon consistency. (Ribbon consistency is when the egg yolks and sugar have thickened and increased in volume to a point where a trail of the mixture holds on the surface for a second before merging back in.) Stir in the flour.  Pour the hot milk onto the yolks, stirring continuously with a whisk.  Return to the pan and whisk over a low heat for one minute, then pour into a bowl, cover with cling film, and cool slightly. Stir in two tablespoons of the apple purée once cool.", "Preheat the oven to 200C/400F/Gas 6 and put a baking tray inside to heat. ", "Ensure that your whisking equipment is clean and free from grease - otherwise it may prevent the egg whites from rising. Beat the egg whites in a mixing bowl until thick and frothy, then add the remaining sugar and continue to beat until the egg whites form soft peaks when the whisk is removed from the bowl. It is crucial not to over-beat the egg whites. Immediately and confidently whisk one-third of the egg whites into the apple mixture, then delicately fold in the rest with a large spoon.", "Divide the mixture between the soufflé dishes to come level with the rim, burying the biscuits (if using) in the middle. Stand on the hot baking tray and cook for 8-10 minutes, or until risen a 2.5cm/1cm over the top of the dish and the top is golden-brown. Overcooking will cause the soufflés to collapse.  Serve the soufflés as soon as they come out of the oven on warm plates. Make a well in the middle of the soufflé and pour in the coulis."]}, {"isVegetarian": true, "title": "Blackberry jelly", "url": "www_bbc_co_uk_food_recipes_bramblejelly_13698", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bramblejelly_13698_16x9.jpg", "ingredients": ["1.3kg/3lb blackberries, washed", "2 large cooking apples, washed, cored and diced", "450ml/¾ pint water", "1 lemon, juice only", "preserving or granulated sugar", "2-3 tbsp crème de cassis (optional)", "sterilized jam jars and jam pot covers"], "serves": "Makes 3-5 jars", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Prepare a jelly bag or tea towel by boiling in water for 2-3 minutes. Wring well and leave to cool. Arrange the jelly bag on a stand or up-turned stool with a large bowl beneath, ready for the fruit juice to drip through.", "Place the blackberries, apple, water and lemon juice in a preserving or large, heavy based saucepan.", "Bring to the boil, then simmer over a low heat for 20-25 minutes or until the fruit is completely soft.", "Tip the soft fruit and juice into the jelly bag and leave to drip for 8 hours or until all the juice has been released.", "Prepare the jam jars by washing in hot soapy water and leaving to dry and warm in a cool oven - 130C/250F/Gas ½ for 10-15 minutes.", "Measure the juice. For every 600ml/1 pint weigh 450g/1lb sugar. Put the juice and sugar back into the clean preserving pan, heat over a low heat until all the sugar has dissolved, add the crème de cassis, if using. Bring to the boil and simmer for 10-15 minutes or until setting point is reached.\t", "Skim away any scum from the top of the jelly and fill the jam jars to the brim. Cover, seal and label. Store in a cool, dark place until required."]}, {"isVegetarian": true, "title": "Bramley apple slice", "url": "www_bbc_co_uk_food_recipes_bramley_apple_slice_66887", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bramley_apple_slice_66887_16x9.jpg", "ingredients": ["750g/1½lb Bramley apples, peeled, cored and roughly chopped", "50-75g/2-3oz caster sugar", "25g/1oz butter, plus extra for greasing", "2 x 320g/11oz ready-made all-butter puff pastry sheets (about 35cm x 23cm/14in x 9in)", "250g/9oz natural (uncoloured) marzipan, thinly sliced", "2 free-range egg yolks, lightly beaten", "2 tbsp demerara sugar", "200g/7oz clotted cream, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180 Fan/Gas 6.", "Heat the apples, 50g/2oz of the caster sugar, the butter and 3 tablespoons of water in a saucepan over a medium heat. Bring the mixture to the boil, stirring well, then cover and reduce the heat until the mixture is simmering. Continue to simmer for 3-5 minutes, or until the apple has softened. ", "Remove the lid and stir well, then cook for a further 2-3 minutes, or until the apple has completely broken down to a purée. Taste the purée and stir in more sugar as needed, then remove the purée from the heat and set aside to cool.", "Place one sheet of puff pastry onto a baking tray lightly greased with butter. Lay the slices of marzipan on top of the pastry to cover, leaving a border of 2cm/1in all the way around. ", "Spread the cooled apple purée over the layer of marzipan, then brush the pastry border with a little of the beaten egg. ", "Fold the second sheet of puff pastry in half lengthways, then carefully score the pastry from the folded side towards the cut side at 1cm/½in intervals down the length of the pastry, leaving 2cm/1in intact at the cut side of the pastry.", "Unfold the scored pastry and lay it exactly on top of the apple-covered pastry, then crimp the edges to seal the two sheets of pastry using your fingers. ", "Trim the edges of the pastry and brush the top of the Bramley apple slice all over with the remaining beaten egg. Sprinkle the top with demerara sugar, then bake in the oven for 25-30 minutes, or until the pastry has risen and is crisp and golden-brown. ", "Allow to cool slightly before serving, serve with the clotted cream. "]}, {"isVegetarian": false, "title": "Bran, bacon and cinnamon muffins", "url": "www_bbc_co_uk_food_recipes_branbaconandcinnamon_85160", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz bran", "125ml/4fl oz milk", "100g/3½oz self-raising flour", "100g/3½oz wholemeal flour", "2 tsp fine demerara sugar", "pinch baking powder", "75g/3oz smoked bacon lardons, cooked until browned", "1 lemon, zest only", "1tsp ground cinnamon", "3 tbsp clear honey", "75g/3oz butter", "1 free-range egg", "100ml/3½fl oz plain yoghurt", "extra butter, to serve"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the bran in the milk for five minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Sift the flours, sugar and baking powder into a bowl. Add the bacon, lemon zest and cinnamon.", "Heat the honey and melt the butter in a small saucepan over a low heat.  Off the heat, beat in the egg, yoghurt and bran with its milk.", "Stir the wet ingredients into the dry ingredients in the bowl.", "Spoon the batter into muffin cases and bake in the oven for 20-25 minutes.", "Serve with butter."]}, {"isVegetarian": false, "title": "Brandade de morue", "url": "www_bbc_co_uk_food_recipes_brandade_de_morue_30836", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz piece salt cod ", "500ml/18fl oz milk", "2 bay leaves", "2 garlic cloves, thinly sliced", "few peppercorns", "½ tsp fennel seeds", "1 piece pared lemon zest", "400g/14oz potatoes, peeled (unpeeled weight)", "100m/3½fl oz single cream", "75ml/2½fl oz olive oil", "grating nutmeg", "1-2 tbsp olive oil", "few slices truffle", "thin slices French bread, toasted"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["First soak the cod – you will need to start this process a full day before you want to make the brandade. Put the cod in a large container and cover with cold water. Leave to soak at room temperature for 24 hours, changing the water at least four times.", "Drain the cod and put in a saucepan. Cover with water and bring to the boil. Simmer for five minutes, then drain. Repeat this process. ", "Return the cod to the saucepan and this time cover with the milk. Add the bay leaves, garlic cloves, peppercorns, fennel seeds and lemon zest. Heat gently until almost boiling, then turn down and leave to simmer for 10 minutes. Remove from the heat and leave the fish to cool in the milk.", "Cut the potatoes into small chunks and put in a saucepan. Cover with water and bring to the boil. Simmer until tender – around 10 minutes – then drain.", "Strain the cod, reserving 50ml/2fl oz of the milk, but discarding the aromatics. Remove any skin and bone from the cod, then crush the flakes lightly with a fork. ", "Make the sauce in a food processor or by hand. To make in a food processor, put the fish and potatoes in the processor with the reserved milk and the cream. Blend until becoming smooth, then gradually drizzle in the olive oil in while the motor is running until you have a smooth, well emulsified paste.", "Alternatively, mash the cod with a fork, or pound with a pestle and mortar, gradually incorporating the reserved milk, then mash the potatoes with the cream. Mix together then gradually work in the olive oil. ", "Serve with a little finely grated nutmeg, a drizzle of olive oil and perhaps a few slices of truffle, along with toasted slices of French bread."]}, {"isVegetarian": false, "title": "'Brandade'", "url": "www_bbc_co_uk_food_recipes_brandard_83323", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 clove garlic", "15g/½oz chervil", "100g/3½oz potato, peeled, chopped and boiled until soft", "50g/1¾oz haddock, poached and flaked", "salt and freshly ground black pepper, to taste", "chervil leaf, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients, except the chervil leaf, into a food processor and blend to a purée.", "To serve, place into a small bowl and garnish with the chervil leaf."]}, {"isVegetarian": false, "title": "Hot smoked salmon, beetroot salad and horseradish crème fraîche", "url": "www_bbc_co_uk_food_recipes_brandonrostsmokedsal_93502", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandonrostsmokedsal_93502_16x9.jpg", "ingredients": ["480g/17oz mixed beetroot such as Candy, Bull's Blood and Golden, washed, leaves reserved (see below)", "2 tbsp extra virgin olive oil", "2 tsp aged balsamic vinegar", "30g/1½oz shallot, peeled,  finely sliced ", "4 pinches sea salt", "2 pinches freshly ground black pepper", "100g/3½oz crème fraîche", "1 tsp finely grated fresh horseradish", "2 tbsp chopped fresh dill", "2 pinches sea salt", "120g/4½oz hot smoked salmon, such as bradon rost, flesh roughly flaked ", "2 tbsp chopped fresh dill", "1 small handful fresh beetroot leaves, or other baby leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beetroot salad, bring a large pan of water with a tight fitting lid to the boil, place a steamer insert on top. Add the beetroot, cover the pan and steam for 35-40 minutes, or until tender. (The beetroot is cooked through when a knife inserted into the centre meets no resistance.)", "Remove the beetroot and set aside to cool slightly before peeling (you may wish to wear gloves when you peel the beetroot to prevent your hands from staining). Slice the beetroot into bite-sized pieces (about 0.5cm/½in thick), then place into a bowl with the olive oil, balsamic vinegar and shallot. Mix well, then season, to taste, with salt and freshly ground black pepper. ", "For the horseradish crème fraîche, mix all of the horseradish crème fraîche ingredients together, taste, and adjust the seasoning, if required. ", "To serve, divide the beetroot salad among 4 serving plates, scatter the salmon over the top and sprinkle over a little chopped dill. Arrange some fresh beetroot leaves on the side. Spoon the horseradish crème fraîche into small serving bowls and serve alongside."]}, {"isVegetarian": true, "title": "Homemade brandy snaps", "url": "www_bbc_co_uk_food_recipes_brandy_snaps_17321", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz soft, dark-brown sugar", "50g/2oz  golden syrup", "50g/2oz butter", "50g/2oz plain flour, plus extra for dusting", "1 tsp ground ginger", "300ml/10fl oz double cream, whipped to firm peaks"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.", "Melt the sugar, golden syrup and butter in a saucepan. When the sugar granules have dissolved, remove the pan from the heat.", "Add the flour and ground ginger and mix well to form a thick paste.", "Place a piece of cling film on a work surface and turn out the paste. Roll the mixture into a ball, then cover in the cling film and chill in the fridge until set (about 30 minutes).", "Remove the chilled brandy snap dough from the fridge and roll it into walnut-sized balls using your hands - you should get at least four from this mixture.", "Dust a work surface with flour. Roll each ball of dough out into a disc approximately 2mm/1/16in thick, then place on the baking tray.", "Bake the brandy snaps in the oven for 6-8 minutes, or until crisp and golden-brown. Remove from the oven and set aside to cool for approximately one minute.", "Carefully lift each brandy snap off the tray and roll around the end of a wooden spoon – leaving on it to cool for a minute before removing. If possible, it is best to mould the brandy snaps around several spoons at the same time while they are all still hot.", "To serve, spoon the cream into a piping bag fitted with a star-shaped nozzle. Pipe the cream into the brandy snaps and pile onto a plate. Serve immediately."]}, {"isVegetarian": true, "title": "Brandy butter frosting", "url": "www_bbc_co_uk_food_recipes_brandy_butter_frosting_23164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz icing sugar", "50g/1¾oz butter", "25ml/1fl oz double cream", "25ml/1fl oz brandy"], "serves": "Makes enough for a 18cm/7in round cake", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Measure the icing sugar into a bowl, then melt the butter for a few seconds in the microwave or in a small pan over a low heat, taking care not to burn it. ", "Pour the melted buter with the cream and brandy into the sugar and mix until smooth.", "Use to cover a cake while warm, then leave to set before cutting the cake."]}, {"isVegetarian": true, "title": "Brandy snaps", "url": "www_bbc_co_uk_food_recipes_brandy_snaps_47363", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandy_snaps_47363_16x9.jpg", "ingredients": ["55g/2oz butter", "55g/2oz demerara sugar", "55g/2oz golden syrup", "50g/1¾oz plain flour", "½ level tsp ground ginger", "½ tsp lemon juice"], "serves": "Makes 16 brandy snaps", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line two baking trays with baking parchment then oil a thickish handle of a wooden spoon and lay it on a cooling rack. ", "Measure the butter, sugar and syrup into a small, heavy-based pan. The easiest way is to measure the butter, then the sugar on the scales (in the pan if you have digital scales), then measure the syrup on top to make up to 165g/6oz total weight. ", "Heat gently until the butter has melted and the sugar has dissolved. This will take about 15 minutes over a low heat. Don’t let the mixture boil as it may crystallise. To check when the sugar has dissolved, stir occasionally, pulling the spoon across the bottom of the pan until you can no longer hear the gritty granules being scraped along and most of them have disappeared. ", "Leave the mixture to cool slightly, about 2-3 minutes, then sieve in the flour and ginger. Pour in the lemon juice and stir well to mix thoroughly. Drop four teaspoonfuls of the mixture onto each of the prepared baking trays to make neat circles, about 10cm/4in apart. ", "Bake in the pre-heated oven for about 10-15 minutes, or until the mixture is well spread out, looks lacey and is a dark golden colour. Once baked, you need to work fast to shape the brandy snaps, so its easier if you bake one tray at a time. Remove each tray from the oven and leave for a minute or so to firm up slightly, then lift from the baking parchment using a fish slice. The mixture needs to be just firm enough to remove, but pliable enough to shape. Check by releasing around and under the edges with a small palette knife. ", "Quickly roll a circle of the warm mixture around the handle of the wooden spoon, having the join underneath. Press the join lightly together to seal, then slide the brandy snap off the spoon and leave it to firm up on the wire rack, again with the join underneath. If any of the circles on the sheet harden too much to work with, put them back in the oven for a few seconds to soften again. Repeat until all the mixture has been used. If the mixture in the pan becomes too firm to drop in neat spoonfuls, roll a teaspoonful of it into a small smooth ball in your hands, sit it on the baking tray and flatten slightly with your fingers. When cold, store the brandy snaps in an airtight tin or container; they will keep for at least a week.   "]}, {"isVegetarian": true, "title": "Brandy snaps with ginger cream and chocolate", "url": "www_bbc_co_uk_food_recipes_brandy_snaps_with_ginger_51104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70g/2½oz butter, plus extra for greasing", "70g/2½oz caster sugar", "3 tbsp golden syrup", "70g/2½oz plain flour", "1 tsp ground ginger", "2 tsp brandy", "½ lemon, zest only", "300ml/½ pint double cream", "4 balls stem ginger in syrup, drained and finely chopped", "100g/3½oz good quality plain dark chocolate, broken into squares"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line two baking trays with greaseproof paper. ", "Melt the butter with the sugar and syrup, stirring over a low heat until the sugar dissolves. Remove the pan from the heat and stir in the flour, ginger, brandy and lemon zest.", "Place four scant tablespoons of the mixture onto one of the baking trays, leaving plenty of room for the mixture to spread. Bake in the centre of the oven for 10-12 minutes or until bubbly and deep golden-brown. While the brandy snaps are cooking, grease two wooden spoons with butter and wrap an elastic band around them to bind them together.  Place four more scant tablespoons of the brandy snap mixture on the second baking tray.", "Take the brandy snaps out of the oven and put the second tray in to bake for the same amount of time. Let the brandy snaps rest for 30-60 seconds, then carefully lift one off with a palette knife and wrap around the spoons, overlapping it a little. Hold for around 30 seconds until the biscuit sets in a tube shape, then gently slide off the spoons and put on a rack to cool. Repeat the method with the remaining brandy snaps. If the biscuits become too hard to roll at any stage, simply return to the oven for a few seconds to soften them. Continue baking and rolling the brandy snaps until all the mixture is used. ", "To prepare the filling, whip the cream until soft peaks form. Stir in the chopped ginger and spoon into a large piping bag fitted with a plain nozzle. Pipe the ginger cream into each end of the brandy snaps and place them fairly close together on a rack placed over a board.", "Melt the chocolate in a heatproof bowl over a pan of gently simmering water, taking care the bottom of the bowl does not touch the water. Remove from the heat and, using a dessert spoon, drizzle melted chocolate over the brandy snaps. Place in the fridge for 15 minutes or until the chocolate sets. Carefully transfer the brandy snaps to a serving plate when you are ready to serve."]}, {"isVegetarian": true, "title": "Bramble and butterscotch crumble tart", "url": "www_bbc_co_uk_food_recipes_brambleandbutterscot_67688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz golden caster sugar", "75g/3oz ground almonds", "150g/5oz plain flour, sifted", "110 g/4oz butter, diced", "1 large free-range egg", "1 heaped tbsp semolina", "750g/1lb 10oz brambles/blackberries", "250g/9oz dulce de leche (Argentinean caramel spread) or canned caramel", "75g/3oz plain flour, sifted", "50g/2oz medium oatmeal", "75g/3oz golden granulated sugar", "75g/3oz butter, diced", "450g/1lb brambles/blackberries", "good slug of Drambuie", "sugar to taste"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Make the pastry in the usual way: either by hand or in a food processor by processing the sugar, almonds, flour and butter together then adding the egg. ", "Once amalgamated, combine in your hands, wrap in clingfilm and chill well. (The pastry is softish.) Then roll out to fit a deep 23cm/9\" loose-bottom, buttered flan tin. Prick the base and chill again - for at least 3 hours - preferably overnight.", "Sprinkle the semolina over the pastry then scatter over the brambles. Warm the dulce de leche or caramel and spoon over the berries. ", "Make the crumble topping by mixing the flour, oatmeal and sugar and rub in the butter. Sprinkle over the berries and press down very lightly. Bake at 200C/400F/Gas 6 for 15 minutes then reduce to 180C/350F/Gas 4 for 25 minutes until golden brown. Leave until barely warm before carefully decanting to a plate.", "Poach the brambles in the Drambuie, adding sugar to taste. Poach very briefly, only 3-5 minutes, so the berries are still firm. Serve warm - not hot - with the tart and some thick cream."]}, {"isVegetarian": true, "title": "Brandy butter", "url": "www_bbc_co_uk_food_recipes_brandybutter_2535", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandybutter_2535_16x9.jpg", "ingredients": ["125g/4oz unsalted butter, softened", "125g/4oz icing sugar", "2 tbsp boiling water", "3 tbsp brandy"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cream together the butter and the icing sugar.", "Beat in the boiling water and brandy until smooth.", "Chill until needed and serve with mince pies or Christmas pudding."]}, {"isVegetarian": true, "title": "Brandy butter", "url": "www_bbc_co_uk_food_recipes_brandybutter_65615", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz unsalted butter, softened ", "85g/3oz light muscovado sugar ", "85g/3oz icing sugar, sieved ", "3 tbsp brandy or cognac"], "serves": "Makes approx. 110g/4oz", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the butter in a bowl. Beat well with a wooden spoon till soft or for speed use an electric hand whisk (and if you use a food processor then there is no need to sieve the icing sugar). ", "Beat in both the sugars till smooth, then add the brandy. If you are over generous with the brandy it will curdle so just beat in more sieved icing sugar and it will come smooth again. ", "Serve with the Christmas pudding or even as a cheeky addition to a mince pie."]}, {"isVegetarian": true, "title": "Brandy (or rum) sauce", "url": "www_bbc_co_uk_food_recipes_brandysauce_2534", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandysauce_2534_16x9.jpg", "ingredients": ["55g/2oz butter", "55g/2oz plain flour", "570ml/1 pint milk", "4 tbsp brandy or dark rum", "55g/2oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter and stir in the flour. Cook for 2 minutes and then stir in the milk. Bring to the boil, stirring all the time, and simmer gently for 10 minutes.", "Stir in the brandy (or rum) and the sugar and serve with Christmas pudding."]}, {"isVegetarian": true, "title": "Brandy snap baskets with white chocolate", "url": "www_bbc_co_uk_food_recipes_brandysnapbasketswit_70818", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 bought brandy snap baskets", "200g/8oz Continental white chocolate", "200ml/7floz double cream", "200m/7fl oz full fat créme fraîche", "200g/8oz fresh raspberries or strawberries and other mixed soft fruit"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt white chocolate with the double cream together in a bowl over hot water (not boiling) until the chocolate just melts (do not allow to get too hot or it will become grainy and will not set firm when cold).", "Set aside to cool.  ", "Mix with the créme fraîche until smooth.  ", "Pour into the brandy snap cases.  ", "Top with the fruits to serve."]}, {"isVegetarian": true, "title": "Brandy snap baskets with orange cream", "url": "www_bbc_co_uk_food_recipes_brandysnapbasketswit_70819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 brandy snap baskets", "450ml/16fl oz double cream", "zest of 1 orange", "2 tbsp of orange liqueur, such as Grand Marnier"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Whip the double cream, add the orange zest and Grand Marnier and spoon into the baskets."]}, {"isVegetarian": true, "title": "Brandy snaps with chilli and passion fruit cream", "url": "www_bbc_co_uk_food_recipes_brandysnapswithchill_74819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz unsalted butter", "100g/4oz caster sugar", "100g/4oz golden syrup", "100g/4oz flour, sieved", "½ tsp ground ginger", "1 tbsp lime juice", "one lime, zest only", "250ml/9fl oz double cream", "pinch of hot chilli powder", "2 passion fruits, halved and pulp scooped out ", "2 tbsp icing sugar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "In a saucepan, melt the butter with the caster sugar and golden syrup. ", "Remove from the heat and gently fold in the flour and ginger with the lime juice and zest. ", "Leave to cool down completely.", "Drop large tablespoons of the mixture onto a heavy-based baking sheet. Make sure that you keep the mixture well spaced as it will spread out when cooking.  ", "Cook for about five minutes until the brandy snaps are golden and lacy. Remove from the oven and leave to cool for a couple of minutes on the tray, then carefully remove using a palette knife. Lift each one gently on to a wooden spoon, then roll round the handle to form a tube.", "Allow to cool on a wire rack.", "Meanwhile, whip the cream in a bowl until you have achieved soft peaks, then fold in the chilli powder, passion fruit pulp and icing sugar.  ", "Scoop into a piping bag and leave in the fridge until you are ready to serve.  ", "To serve, pipe each snap with the chilli and passion fruit cream and then place three onto each serving plate. ", "Serve immediately."]}, {"isVegetarian": true, "title": "Bras de gitan", "url": "www_bbc_co_uk_food_recipes_bras_de_gitan_63262", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bras_de_gitan_63262_16x9.jpg", "ingredients": ["300ml/10fl oz milk", "1 vanilla pod", "2 free-range egg yolks", "65g/2¼oz caster sugar", "40g/1½ oz cornflour", "1 tbsp orange liqueur (such as Grand Marnier), or peach eau de vie or kirsch", "few drops almond extract", "50g/1¾oz plain flour", "1 tsp baking powder", "50g/1¾oz ground almonds", "pinch salt", "4 large free-range eggs", "75g/2½oz caster sugar", "few drops almond extract", "1 tbsp orange liqueur, such as Grand Marnier or other eau de vie", "2 tbsp caster sugar, for dusting", "4 tbsp cherry or apricot jam", "2 tbsp icing sugar", "3 tbsp flaked almonds, lightly toasted "], "serves": "Makes about 8 slices", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the crème pâtissière, pour the milk into a saucepan and add the vanilla pod. Bring to the boil, then remove from the heat and leave to infuse until back to room temperature.", "Put the egg yolks and sugar into a bowl and whisk until well combined and starting to turn pale. Whisk in the cornflour. ", "Reheat the milk, then transfer to a jug, discarding the vanilla pod. Rinse out the saucepan. Pour the milk into the egg and sugar mixture from a height, whisking constantly, then transfer back to the saucepan.", "Stir on a low to medium heat until thickened. Transfer to a bowl and cover with cling film, making sure the cling film sits on top of the surface of the crème pâtissière to stop it from forming a skin. When it has cooled down, transfer to the fridge to chill.", "Preheat the oven to 180C/Fan 160C/Gas 4. Line a 30x20cm/12x8in Swiss roll tin with baking parchment.", "Sift the plain flour and baking powder into a bowl with the ground almonds. Add a pinch of salt.", "Whisk the eggs and sugar together with an electric hand whisk or in a stand mixer until the mixture is pale with an aerated, mousse-like texture – it should also leave a ribbon trail. Add the almond extract.", "Add the flour and almond mixture and fold in very gently but thoroughly with a metal spoon.", "Pour the mixture into the prepared Swiss roll tin and spread with a palate knife to make sure it is even. Bake for around 10-12 minutes, or until lightly browned and springy to touch.", "Remove from the oven and turn out onto a cooling rack. Peel off the baking parchment and leave to cool. ", "To assemble, transfer the sponge to a lightly moistened tea towel. Spread over the jam, then top with the crème pâtissière. Spread evenly with a palate knife, leaving a wide (at least 5cm/2in) border along the top (the filling will spill over otherwise) and a narrower one (2cm/¾in) on each side.", "Carefully roll up from the bottom, pulling the roll up and over to try and stop the filling falling out, until you have a roll. Do not worry if it cracks a little. ", "Sprinkle with icing sugar and the toasted almonds. Serve."]}, {"isVegetarian": true, "title": "Bread and butter pudding with orange and cardamom", "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_07166", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 oranges", "300ml/½ pint milk", "300ml/½ pint double cream", "1 vanilla pod, split", "15 green cardamom pods, crushed with a pestle and mortar", "90g/3½oz butter, softened", "15 slices white bread, preferably slightly stale", "8 free-range eggs ", "175g/6oz caster sugar", "55g/2oz shelled pistachios, chopped", "85g/3¼oz golden sultanas", "4 tbsp Seville orange marmalade, strained to remove peel", "icing sugar", "crème fraîche (optional)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the zest from the oranges and set the rest of the oranges aside. Pour the milk and cream into a pan, add the orange zest, split vanilla pod and crushed cardamoms and bring to the boil. Turn off the heat and leave to infuse for one hour.", "Preheat the oven to 180C/350F/Gas 4 and place a large roasting tin inside to warm up. The tin should be large enough to hold a 30 x 22 x 5cm/12 x 9 x 2in baking dish with space remaining around the edge.", "Butter the bread and cut it into triangles. Segment the oranges with a sharp knife and discard the peel. Remove the translucent outer skin from each segment, and discard. Slice each segment in half. Beat the eggs and sugar together in a mixing bowl. Pour the infused milk through a fine sieve onto the egg mixture. ", "Arrange a layer of bread, buttered-side up, in the baking dish, then add a layer of pistachio pieces, sultanas and orange segments. Repeat the layers, finishing with the bread and making the final layer overlap neatly. Pour the milk-and-egg mixture over the top. Put on a kettle of water to boil.", "Place the dish in the roasting tin in the oven. Carefully pour boiling water into the roasting tin to come halfway up the sides of the dish, taking care not to allow any of the water to go into the pudding. Bake for 30-40 minutes, or until nearly set through.", "Heat the strained marmalade in a small pan over a gentle heat until liquid, and use to brush the top of the bread and butter pudding. To serve, scoop out each portion and dust with icing sugar, plus a dollop of crème fraîche if you like."]}, {"isVegetarian": true, "title": "Bread and butter pudding with caramel cream", "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_95777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz caster sugar", "600ml/20fl oz double cream", "75g/2½oz raisins ", "75g/2½oz sultanas ", "75g/2½oz currants ", "75g/2½oz dried mixed peel, chopped", "150g/5½oz butter", "1 soft white sandwich bread loaf, sliced", "5 free-range eggs", "50g/1¾oz caster sugar", "300ml/10fl oz milk", "1 vanilla pod, split", "300ml/10fl oz double cream", "100ml/3½fl oz apricot jam "], "serves": "Serves 4–6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "To make the caramel cream, heat the sugar in a frying pan, swirling every so often, until you have a dark caramel. Pour in 300ml/10fl oz of double cream. Whip the remaining double cream until it falls off the whisk in ribbons, and then fold it into the caramel cream mixture. Sieve into a clean bowl, cover and allow to set overnight. ", "To make the bread and butter pudding, scatter some of the dried fruit into the bottom of a shallow baking dish. Melt the butter over a medium heat. Brush the bread slices generously with the melted butter and put a layer on top of the dried fruit. Continue to layer like this until the fruit and bread is all used up, finishing with a layer of bread.", "Mix together the eggs and sugar in a large heatproof bowl. Bring the milk and vanilla to a simmer and pour this over the egg mixture. Pour in the cream and mix, then strain though a fine sieve, discarding the vanilla pod. Pour the mixture over the bread, pushing it down to absorb all the liquid. ", "Bake for 40–50 minutes, until just set. Once cool, gently heat the jam in a saucepan over a low heat. Glaze the top of the pudding with the warm apricot jam. ", "To serve, cut out the bread and butter pudding into potions. Transfer to serving bowls and add a spoonful of the caramel cream alongside."]}, {"isVegetarian": true, "title": "Bread and butter surprise", "url": "www_bbc_co_uk_food_recipes_bread_and_butter_60669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter, softened, plus extra for greasing", "2 slices day-old white bread", "2 tinned pear halves, drained, chopped, plus extra to serve", "4 tsp milk chocolate drops", "1 free-range egg", "125ml/4½fl oz milk", "25g/1oz caster sugar", "plain yoghurt, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 400ml/14fl oz ovenproof dish with butter. Place the greased dish onto a baking tray.", "Butter one side of each piece of bread, then cut each piece into four triangles. Arrange a layer of four triangles into the bottom of the dish.", "Sprinkle over half of the chopped pear and chocolate drops.", "Repeat the process with the remaining bread, pear and chocolate drops.", "Beat the egg and sugar together until pale and well combined, then beat in the milk. Pour the mixture into the dish to cover the bread and fruit layers. Press any bread not covered by the egg mixture down into the liquid to soak, using a fork.", "Bake the pudding in the oven for 25-30 minutes, or until the custard has set and is golden-brown on top.", "Serve with plain yoghurt and extra pieces of pear, to garnish."]}, {"isVegetarian": true, "title": "Bread pudding (Zemlovka)", "url": "www_bbc_co_uk_food_recipes_bread_pudding_zemlovka_35608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½ oz raisins", "100ml/3½fl oz cold tea", "3 apples or 3 pears or a mixture of both", "squeeze lemon juice", "400ml/14fl oz full-fat milk", "125g/4½ oz unsalted butter, plus extra for greasing", "3 eggs", "100g/3½ oz soft brown sugar", "2 tsp cinnamon", "1 tsp nutmeg, freshly grated", "1 tsp vanilla extract", "½ large bread loaf, can be a bit stale (or brioche)", "1 tbsp brown sugar crystals"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First put the raisins in a small bowl, add the cold tea and leave them to soak. ", "Peel, core and slice the apples or pears and keep them fresh in a bowl of water with a squeeze of lemon juice. ", "Grease a baking dish and preheat the oven to 180C/350F/Gas 4.", "Gently warm the milk in a saucepan, then add the butter and allow it to melt. Set the milk and butter aside to cool to lukewarm.", "Put the eggs, sugar, cinnamon, nutmeg and vanilla in a bowl and beat with an electric handwhisk until well combined. Whisk in the buttery milk.", "Tear the bread into pieces, keeping the crusts on or off depending on how posh you are, and layer them in the greased baking dish. Strain the raisins, discarding the tea, and scatter them over the bread, then top with the sliced fruit. Pour in the batter and sprinkle on brown sugar crystals. ", "Bake in the preheated oven for about 30 minutes until the pudding has set and has a golden crust on top. ", "Serve with ice cream or custard, or try some soured cream for a change."]}, {"isVegetarian": false, "title": "Bread stuffed with sausage and zampone", "url": "www_bbc_co_uk_food_recipes_bread_stuffed_with_53425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong bread flour, plus extra for kneading", "7g fast-action dried yeast", "1 tsp salt", "2 tbsp olive oil", "½ zampone (pre-cooked, boned pig's trotter), boiled for 20 mins and chopped (available from some Italian delis)", "¼ savoy cabbage, sliced and blanched", "2 fennel sausages, cooked and sliced", "2 smoked sausages, cooked and sliced", "150g/5½oz new potatoes, cooked and sliced ", "100-150g/3½-5½oz soured cream or crème fraîche", "100-150g/3½-5½oz beaufort cheese or reblochon cheese"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the bread dough, place the flour in a large bowl and add the yeast and salt and mix. Slowly add 150-200ml water until it comes together as a dough. Knead for at least 5 minutes until you have a smooth dough. Place in a lightly floured, large bowl, cover and leave to prove for about an hour or until doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a medium frying pan and add the oil, fry the trotter with the cabbage for 2-3 minutes.", "Knock the air out of the dough, and roll out into a circle on a floured surface.", "Place all the filling ingredients into one half of the rolled out dough circle, mix them together and then fold the other half over to make a semi-circle. Crimp the edges until well-sealed and place on a baking tray lined with baking paper.", "Bake in the oven for 15–20 minutes or until golden-brown. When you tap the bottom it should sound hollow.", "To serve, place the cooked bread onto a serving plate and tear open."]}, {"isVegetarian": true, "title": "Bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_breadandbutterpuddin_88983", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadandbutterpuddin_88983_16x9.jpg", "ingredients": ["3 free-range eggs", "3 tbsp caster sugar", "2 cups milk and cream mixed together, half and half", "½ tsp vanilla extract", "1 loaf white bread, croissants, brioche or panettone", "50g/20z butter", "large handful raisins, soaked in Marsala", "double cream or custard, to serve"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Mix the eggs, sugar, milk and vanilla extract together in a large bowl.", "Slice the bread of your choice, toast and butter it and arrange in overlapping slices in the bottom of an ovenproof dish, leaving some edges sticking out at the top so that they crisp up. Scatter the soaked raisins over the top and then pour in the egg mixture.", "Bake for 30 minutes in the preheated oven and serve warm with cream or custard."]}, {"isVegetarian": true, "title": "Bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_breadandbutterpuddin_85936", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadandbutterpuddin_85936_16x9.jpg", "ingredients": ["25g/1oz butter, plus extra for greasing  ", "8 thin slices bread", "50g/2oz sultanas ", "2 tsp cinnamon powder", "350ml/12fl oz whole milk ", "50ml/2fl oz double cream", "2 free-range eggs ", "25g/1oz granulated sugar", "nutmeg, grated, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1 litre/2 pint pie dish with butter.", "Cut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.", "Arrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.", "Gently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.", "Crack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.", "Add the warm milk and cream mixture and stir well, then strain the custard into a bowl. ", "Pour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.", "Preheat the oven to 180C/355F/Gas 4.", "Place the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown."]}, {"isVegetarian": true, "title": "Deep-fried mushrooms", "url": "www_bbc_co_uk_food_recipes_breadcrumbed_mushrooms_70965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "1 tsp chopped fresh flatleaf parsley", "2 free-range eggs", "50ml/2fl oz milk", "freshly ground black pepper", "vegetable oil, for deep-frying", "400g/14oz mixed mushrooms, cleaned, sliced lengthways"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the flour and parsley in a wide, shallow bowl. Whisk the eggs, milk and some freshly ground black pepper together in a separate bowl.", "Heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the mushroom slices in the egg mixture, then coat with the flour mixture.", "Carefully place the mushrooms into the oil and fry for 3-4 minutes, or until golden-brown. (You may need to do this in batches. Do not overcrowd the pan.)", "Remove the mushrooms from the oil with a slotted spoon and set aside to drain on kitchen paper."]}, {"isVegetarian": false, "title": "Breadcrumbed pheasant breast with beetroot purée and marinated beetroot", "url": "www_bbc_co_uk_food_recipes_breadcrumbedpheasant_87654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz raw beetroot, peeled, cut into chunks", "1 onion, roughly chopped", "½ garlic clove, roughly chopped", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper ", "350g/12oz cooked beetroot, cut into wedges", "30g/1 oz shallot, finely chopped", "2 tbsp fresh flatleaf parsley, finely chopped", "2 tbsp fresh chervil, finely chopped", "2 tbsp fresh chives, finely chopped", "3 tbsp balsamic vinegar", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper ", "4 pheasant breasts, boneless and skinless", "salt and freshly ground black pepper ", "75g/3oz plain flour", "1 free-range egg, beaten", "50g/2oz breadcrumbs", "25g/1oz butter", "1 tsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beetroot purée, place all of the beetroot purée ingredients into a food processor and blend to a purée.", "Transfer the purée into a frying pan over a low heat. Cook for 30-40 minutes, stirring occasionally. Season, to taste, with salt and freshly ground black pepper.", "For the marinated beetroot, place all of the marinated beetroot ingredients into a bowl and season, to taste, with salt and freshly ground black pepper. Place into the fridge and leave for at least one hour, preferably longer.", "For the pheasant, place the pheasant breasts onto a clean chopping board, cover with cling film, and tap gently with a rolling pin to flatten out slightly.", "Season the pheasant breasts with salt and freshly ground black pepper, then dredge in the flour. Dip the floured breasts into the egg to coat, then dip into the breadcrumbs, coating thoroughly.", "Heat a frying pan until hot, then add the butter and oil. When the butter has melted add the breaded pheasant breasts and fry for 1-2 minutes on each side, or until golden-brown all over and the pheasant is cooked through.", "To serve, place a spoonful of beetroot purée into the centre of each plate. Cut the pheasant breasts in half lengthways and arrange two pieces onto each plate, balanced against the beetroot purée. Spoon the marinated beetroot around the pheasant and serve."]}, {"isVegetarian": true, "title": "Bread and spinach soup", "url": "www_bbc_co_uk_food_recipes_breadandspinachsoup_90402", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "½ onion, chopped", "200g/7oz spinach leaves, roughly chopped", "5 tbsp chopped fresh parsley ", "300ml/10fl oz chicken or vegetable stock", "85g/3oz white crusty bread, torn", "1 lime, juice only", "salt and freshly ground black pepper", "1 tbsp Greek-style yoghurt, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and fry the onion for 3-4 minutes, or until softened, then add the spinach, parsley and stock. Bring to the boil, then add the bread and lime juice and simmer for 3-4 minutes, or until the bread starts to break down. ", "Season, to taste, with salt and freshly ground black pepper and then blend until smooth with a stick blender. ", "Ladle the soup into a serving bowl and top with the yoghurt."]}, {"isVegetarian": false, "title": "Breaded pork cutlet tonkatsu", "url": "www_bbc_co_uk_food_recipes_breaded_pork_cutlet_27947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz sugar", "200ml/7fl oz white wine vinegar", "3 chillies ", "5g fresh root ginger, grated ", "1 garlic clove, grated", "900g/2lb beef shank ", "550g/1lb 4oz oxtail ", "450g/1lb chicken backs, cut into pieces (alternatively use chicken neck or wings)", "450g/1lb pork bones (preferably neck bones, but you can use hocks)", "pinch salt", "225g/8oz pork fat from the back (Optional. You will only need this if your other meat is very lean) ", "3 tbsp soy sauce, to taste", "1 tbsp sake, to taste", "1 tbsp mirin, to taste", "75g/2½oz plain flour", "4 free-range egg whites", "150g/5½oz breadcrumbs", "2 x pork cutlets, flattened", "¼ daikon, grated", "¼ small white cabbage, thinly sliced", "400g/14oz ramen noodles (preferably freshly-made alkaline noodles) or run frozen ramen dough across a mandolin to make big coins or strips", "½ bunch spring onions, thinly sliced ", "100g/3½oz napa cabbage, sliced", "150g/5½oz beansprouts ", "2 garlic cloves, thinly sliced", "100ml/3½fl oz ponzu sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tonkatsu, put the sugar and vinegar in a saucepan and bring to the boil. Allow to cool and then add the rest of the ingredients and blend until smooth. ", "For the broth, preheat the oven to 200C/180C Fan/Gas 6.", "Heat the beef shank and oxtail with 2.25 litres/4 pints water in a pressure cooker. Once the pressure has risen, cook for 15 minutes over medium-high heat. Release the pressure and return the cooker to the stove, or transfer the broth to a bigger soup pot. Simmer for at least 30 more minutes over a medium heat.", "While the beef cooks, spread the chicken back pieces and pork bones out on a baking tray. Roast for 30-40 minutes, or until everything is well browned.", "Once the shank and oxtail have finished simmering, remove them from the cooking liquid and set aside. Add the roasted chicken and pork bones to the cooking liquid along with 1.2 litres/2 pints water and a large pinch of salt. Add the pork back fat, if using, and bring the stock back to a simmer. Cook uncovered, with the pot steadily bubbling but not boiling, for 30 minutes. Stir occasionally.", "Remove the chicken and pork and set aside. Strain the stock to remove any large bits of gristle, then return it to the pan. Season the broth, to taste, with soy sauce, sake, mirin, and more salt, if desired. Keep the broth hot.", "For the breaded pork cutlet, put the flour, egg whites and breadcrumbs in separate bowls. Dust the pork cutlets in flour, dip in the egg whites and then coat in breadcrumbs. ", "Heat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry the pork for 4-6 minutes, or until golden-brown and cooked through.", "Meanwhile, boil the noodles in a saucepan of salted water and drain well. ", "Shred the meat from the reserved beef and oxtail. Divide the broth between 4 warmed ramen bowls and add the shredded meat. Add the noodles. Garnish with spring onions, cabbage, beansprouts and garlic. ", "Slice the pork cutlets and arrange on a serving board with the daikon, cabbage, tonkatsu sauce and ponzu sauce. Serve with the hot noodle broth."]}, {"isVegetarian": true, "title": "Breaded cheese", "url": "www_bbc_co_uk_food_recipes_breadedcheese_77127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil for deep-frying", "150g/5¼oz Wensleydale cheese, cut into triangles", "100g/3½oz breadcrumbs", "1 free-range egg, whisked"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil ready for deep frying. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) ", "Dip the cheese in the egg and then coat in the breadcrumbs. ", "Carefully drop the cheese into the hot oil and deep-fry for 2-3 minutes or until crisp and golden.", "Drain on kitchen paper and serve hot."]}, {"isVegetarian": false, "title": "Breaded chicken escalope, caper sauce, sautéed courgettes and cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_breadedchickenescalo_88767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 corn-fed chicken breasts, boneless and skinless", "salt and freshly ground black pepper", "75g/3oz plain flour", "2 free-range eggs", "60g/2½oz Japanese breadcrumbs", "2 tbsp olive oil", "50g/2oz butter", "1 banana shallot, finely diced", "1 garlic clove, finely diced", "75g/3oz gherkins, finely diced", "4 tbsp capers, rinsed", "3 tbsp roughly chopped flatleaf parsley ", "2 tbsp olive oil", "50g/2oz butter", "2-3 large courgettes, cut into cubes", "2 sprigs rosemary, finely chopped", "175g/6oz cherry tomatoes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken escalopes, place a chicken breast onto a cling film-lined board and cover with cling film. Using a meat hammer or rolling pin, bash the chicken until it is just 5mm thick. ", "Remove from the cling film and season with salt and freshly ground black pepper. Repeat with the remaining chicken.", "Scatter the flour over a plate along with salt and freshly ground black pepper, to taste. Place the eggs in a bowl and lightly beat, and tip the breadcrumbs onto another plate. Dust each chicken breast in the flour, then dip in the egg and finally coat each side with the breadcrumbs.", "For the caper sauce, heat the olive oil and butter in a large frying pan, then add the chicken breasts, one at a time, and fry until golden-brown and completely cooked through (about 2 minutes on each side). Remove with a fish slice and drain on several layers of kitchen paper.", "Add the shallots and garlic to the pan and fry for one minute. Add the gherkins and capers and cook for a further minute. Season with salt and black pepper, to taste, and add the parsley.", "For the courgettes, heat the olive oil and butter in a pan and add the courgettes and rosemary. Sauté for 3-4 minutes until just turning golden-brown and starting to soften. Add the tomatoes and cook for a further two minutes. Season with salt and freshly ground black black pepper, to taste.", "Serve the chicken with the caper sauce spooned over and a pile of courgettes and tomatoes on the side."]}, {"isVegetarian": true, "title": "Bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_72702", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz cherry jam ", "125g/4½oz butter", "400g/14oz white bread, half an average loaf, sliced", "4 tbsp demerara sugar", "10 cherries", "10 strawberries ", "1 tsp vanilla extract", "200ml/7fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the cherry jam and 340ml/12fl oz of water in a pan and stir well.", "Generously butter the sliced bread, then cut each slice into quartered triangles.", "Arrange the bread in an oven dish in a jumbled fashion.", "Pour the jam liquid all over the bread. Using a slotted spoon or ladle, press the bread down to soak up all the juices.", "Dust the top with sugar and bake for 30 minutes.", "Meanwhile, slice the cherries and strawberries in half, and discard the cherry stones.", "Add the vanilla extract to the double cream in a large bowl and lightly whisk until soft peaks form when the whisk is removed from the bowl.", "When the bread is cooked and caramelised, slice into portions and serve with a helping of cream and a scattering of fruit."]}, {"isVegetarian": true, "title": "Breaded mushrooms with chilli and herb dip", "url": "www_bbc_co_uk_food_recipes_breadedmushroomswith_83302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz mushrooms", "100g/3½oz plain flour, seasoned with salt and freshly ground black pepper", "2 free-range eggs, beaten", "100g/3½oz breadcrumbs", "500ml/18fl oz vegetable oil", "200g/7oz Greek yoghurt", "½ tsp dried chilli flakes", "1 clove garlic", "25g/1oz mixed herbs (basil, parsley, coriander, chervil, chives)", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the mushrooms in the flour, coat them in egg, then coat in breadcrumbs.", "Heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended!)", "Deep fry the mushrooms until golden. Carefully remove with a slotted spoon and drain on kitchen towels.", "To make the dip, place all the ingredients into a food processor, season with salt and freshly ground black pepper and mix until smooth.", "Serve the mushrooms on a plate with the dip in a small bowl."]}, {"isVegetarian": false, "title": "Breaded plaice with herbed rice salad", "url": "www_bbc_co_uk_food_recipes_breadedplaicewithher_76728", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2  plaice fillets", "30g/1oz plain flour", "1 egg, beaten", "30g/1oz white breadcrumbs", "1-2 tbsp olive oil", "110g/4oz basmati rice, cooked", "½ red pepper, diced", "1 orange, juice only", "3 tbsp parsley, chopped", "3 tbsp coriander, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coat the plaice fillets in flour, then in the beaten egg and finally in the breadcrumbs.", "Heat the oil in a non-stick frying pan and fry the fillets for 2-3 minutes on each side, until golden brown.", "For the salad, mix the rice, pepper, orange juice and fresh herbs into a large bowl.", "Spoon the rice onto a serving plate and serve the breaded fillets alongside."]}, {"isVegetarian": false, "title": "Breaded sole with herb pesto", "url": "www_bbc_co_uk_food_recipes_breadedsolewithherbp_79027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ loaf of white bread, crust removed", "2 tbsp mixed fresh herbs (flatleaf parsley, basil, chives)", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 free-range eggs", "1 lemon sole fillet", "2 large handfuls fresh mixed herbs (flatleaf parsley, basil, chives), finely chopped", "1 tbsp white wine vinegar", "1 tbsp olive oil", "salt and freshly ground pepper", "squeeze of lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the bread into a food processor and blend to form crumbs. ", "Add the herbs with the seasoning and pulse again. ", "Add the olive oil and eggs and blend to form a smooth paste.", "Lay the lemon sole fillet onto a non-stick baking sheet. Spread the herb and bread mixture onto the fish to cover. Place in the oven and bake for 5-6 minutes, until golden and cooked through.", "To make the pesto, mix the herbs, vinegar, olive oil, salt and freshly ground pepper and lemon juice in a bowl.", "To serve, transfer the breaded fillet to a plate and spoon over the herb pesto."]}, {"isVegetarian": true, "title": "Bread sauce", "url": "www_bbc_co_uk_food_recipes_breadsauce_84755", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadsauce_84755_16x9.jpg", "ingredients": ["1 day-old loaf unsliced white bread", "1 litre/2 pints full-fat milk", "1 onion, peeled and quartered", "4 cloves", "2 fresh bay leaves", "1 tsp white peppercorns", "2 blades fresh mace or heaped ¼ tsp ground mace", "2 tsp salt", "30g/1oz butter", "2 tbsp double cream, optional", "1 fresh nutmeg, for grating"], "serves": "Makes 1 litre", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the crust from the bread and tear the stripped loaf into a mound of rough chunks or cubes about 2cm/¾in in size. You should end up with 175-200g (6¼-7¼oz) of cubes.  If the bread is not slightly stale already, leave the pieces out on a wire rack to dry out.", "Pour the milk into a saucepan.  Press a clove into each quarter of the onion.", "Add the onion quarters, bay leaves, peppercorns and the blades of mace (or sprinkle the ground mace into the pan) along with the salt and bring to the mixture almost to its boiling point. ", "Remove the pan from the heat.  Cover the pan with a lid and let the ingredients infuse for at least half an hour, though you can leave it for a few hours if that helps with your cooking schedule. ", "After the mixture has infused, place the pan back on a very low heat.  Using a slotted spoon, remove the onions, peppercorns, cloves, bay leaves and the blades of mace.  ", "Add the bread to the saucepan and cook for about 15 minutes, stirring every now and then, by which time the sauce should have become thick and warm. ", "Just before serving the bread sauce, add the butter to the saucepan and stir until the butter has melted and combined with the sauce and season, to taste, with salt. ", "Add the cream (if using). Grate over quite a bit of nutmeg, adding more once you have poured the bread sauce into a warmed bowl or gravy boat."]}, {"isVegetarian": true, "title": "Bread sauce", "url": "www_bbc_co_uk_food_recipes_breadsauce_84868", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550ml/1 pint whole milk", "½ white onion, cut into quarters and studded with 3 cloves ", "2 fresh bay leaves", "150g/5¼oz sliced white bread, cut into 3cm/1in squares", "1 tsp English mustard", "freshly grated nutmeg", "50g/1¾oz unsalted butter, diced", "salt and freshly ground black pepper"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the milk in a pan with the studded onion and bay leaves. Bring to the boil briefly then turn down to a gentle simmer. ", "Add the cubes of bread and stir until it starts to break down. Remove the onion and bay leaves and whisk in the mustard and a little freshly grated nutmeg to taste.", "Cook slowly for 10 minutes, stirring regularly. ", "To finish, stir in the butter, season with salt and freshly ground pepper. Place in a bowl or gravy boat, cover with cling film and leave in a warm place until ready to serve."]}, {"isVegetarian": true, "title": "Breakfast bars 2.0", "url": "www_bbc_co_uk_food_recipes_breakfast_bars_20_09760", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_20_09760_16x9.jpg", "ingredients": ["250g/9oz medjool dates", "2 tsp ground cinnamon", "75g/2½oz goji berries", "75g/2½oz pumpkin seeds", "150g/5½oz brown flaxseeds", "50g/1¾oz cocoa nibs", "25g/1oz chia seeds", "25g/1oz cornflakes (gluten-free if required)", "100g/3½oz organic porridge oats (not instant)"], "serves": "Makes 16 bars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4, and line the bottom and sides of a 20cm/8in square tin with baking parchment. ", "Pit the dates and tear them with your fingers into a small saucepan, add the cinnamon, cover with 325ml/11fl oz cold water, bring to the boil and let bubble for 5 minutes. Turn off the heat, and beat with a fork until you have a rough purée.", "Put all the remaining ingredients into a large bowl, add the date mixture and mix until everything is combined. I wear a pair of disposable vinyl gloves for this.", "Squodge into your prepared tin and bake in the oven for 30 minutes, until firm and set, and golden on top and darker around the edges. Leave to cool in the tin before cutting into pieces."]}, {"isVegetarian": true, "title": "Breakfast bars", "url": "www_bbc_co_uk_food_recipes_breakfast_bars_49065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_49065_16x9.jpg", "ingredients": ["100g/3½oz butter", "75ml/2½fl oz golden syrup", "175g/6oz rolled porridge oats", "50g/1¾oz pumpkin seeds", "50g/1¾oz sunflower seeds", "50g/1¾oz hazelnuts, crushed or roughly chopped", "60g/2¼oz dried apricots, roughly chopped  "], "serves": "Makes 16", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4, and line a 24x24cm/9x9in baking tin with greaseproof paper.", "Heat the butter and golden syrup in a small saucepan over a medium heat until bubbling.", "Meanwhile, tip the oats, seeds, nuts and apricots into a large bowl. Pour the hot syrup mixture over the oats and mix well to combine.", "Pour into the lined baking tray and press down into an even layer. Bake for 20 minutes, until golden-brown.", "Allow to cool for 10 minutes, then turn out and cut into 16 squares. When cold, transfer to an airtight container – they will keep for up to one week."]}, {"isVegetarian": true, "title": "Breakfast bhaji", "url": "www_bbc_co_uk_food_recipes_breakfast_bhaji_32025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz potatoes, peeled and cut into 1.5 cm cubes", "250g/9oz carrots, cut into 2cm x 1cm batons", "50ml/2fl oz vegetable oil", "2 tsp black mustard seeds", "1 medium red onion, finely chopped", "1 tsp Kashmiri chilli powder", "½ tsp turmeric", "2 tomatoes, chopped", "½ tsp salt", "1 tsp garam masala ", "4-6 free-range eggs, fried, to serve ", "Naan breads, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in boiling salted water for about 10 minutes, or until tender. Remove with a slotted spoon, set aside, then cook the carrots in the same water for about three minutes, or until just tender but still with a bit of crunch.", "Heat the oil in a heavy-based saucepan or karahi and fry the mustard seeds until they start to pop. Add the onion and fry over a moderate heat for five minutes, or until softened. Add the chilli powder and turmeric and fry for 30 seconds, then add the potatoes, carrots, tomatoes, salt, garam masala and 50ml/2fl oz water. Cook for 3-5 minutes, stirring to break up the potatoes a bit, until the tomatoes are reduced and jammy.", "To serve, brush the Indian bread with a little melted ghee, butter or vegetable oil if you like, or leave plain. Serve the bhaji with naan breads and a fried egg. "]}, {"isVegetarian": false, "title": "Breakfast hash", "url": "www_bbc_co_uk_food_recipes_breakfast_hash_02520", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_hash_02520_16x9.jpg", "ingredients": ["2 tbsp groundnut oil", "50g/1¾oz butter ", "3 herby sausages, skinned", "1 onion, sliced", "½ large potato, including skin", "2 free-range eggs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan. Add the butter and skinned sausages and cook for a few minutes, stirring to ensure all the meat browns.", "Add the onion to the pan.", "Grate the potato including the skin and squeeze over the sink to remove any moisture. ", "Add the potato to the pan. ", "When the pan ingredients are cooked, crack the eggs into the pan. Serve."]}, {"isVegetarian": false, "title": "Breakfast pizza", "url": "www_bbc_co_uk_food_recipes_breakfast_pizza_68739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½ oz strong white flour, plus extra for dusting", "7g instant yeast (one sachet)", "1 tsp salt", "2 tbsp olive oil", "175ml/6fl oz tepid water", "200g/7fl oz passata", "1 tbsp tomato paste", "2 garlic cloves", "1 tsp dried oregano", "handful fresh basil leaves", "salt and freshly ground black pepper", "4 fat sausages, peeled and broken up into small pieces", "8 slices bacon, cut into pieces", "4 slices black pudding, broken up (optional)", "4 field mushrooms, thinly sliced", "4 medium tomatoes, sliced", "2–4 free-range eggs", "2 balls mozzarella, broken up", "olive oil, for drizzling"], "serves": "Makes 2 large pizzas", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pizza base, put the flour in a large bowl (or stand mixer) and sprinkle in the yeast. Stir thoroughly before adding the salt. Mix the olive oil with the water, then make a well in the centre of the flour and start pouring it in. Stir until you have a fairly wet dough, then turn out and knead until it is no longer sticky, but soft and pliable. ", "Leave to rise for an hour in a large bowl, covered, then knock back and divide into two large or 4 smaller pieces, depending on the size you are able to cook. ", "When you are ready to cook the pizzas, preheat the oven to its highest setting and either heat baking trays or a pizza stone. Shape the pizzas into large circles, then dust more baking trays with flour and transfer the pizza bases onto them – this is so you can slide them straight onto the baking tray or pizza stone. ", "Make the tomato sauce simply by blending all the tomato sauce ingredients together in a food processor with plenty of salt and pepper.", "Spread a small amount of the tomato sauce over the pizza base, then top with the pieces of sausage, bacon, black pudding (if using), mushrooms and tomatoes. ", "Break an egg or two on top, making sure that the eggs are contained by other ingredients so that the white doesn’t run off (alternatively you can turn up the edges slightly just to make sure). Sprinkle with mozzarella pieces, then drizzle with olive oil.", "Bake in the oven for around 8–10 minutes, or until the pizza is crisp and the toppings are cooked. "]}, {"isVegetarian": false, "title": "Breakfast frittata", "url": "www_bbc_co_uk_food_recipes_breakfastfrittata_85042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for frying ", "3 onions, sliced ", "1 garlic clove, chopped", "4 pork sausages, cooked and sliced", "6 large free-range eggs", "125ml/4fl oz double cream", "1 tbsp fresh thyme leaves", "salt and freshly ground black pepper", "400g/14oz can baked beans, cooked", "black caviar (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Melt the butter in a large frying pan over a low heat. Add the onions and garlic and gently fry for 15-20 minutes, until soft and beginning to caramelise. ", "Add the sliced sausages to the pan and stir well.", "Whisk the eggs, cream and thyme together in a bowl and season with salt and freshly ground black pepper.", "Add the egg mixture to the sausage and onion mixture and gently stir over a medium heat for ten minutes.", "Transfer to the grill to cook for five minutes, or until set and golden-brown.", "To serve, turn the frittata out onto a large plate and cut into quarters. Serve the portions on clean plates with a generous spoonful of baked beans and a spoonful of caviar, if using."]}, {"isVegetarian": true, "title": "Breakfast Martini", "url": "www_bbc_co_uk_food_recipes_breakfastmartini_87148", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz gin", "1 tbsp Cointreau, or similar orange liqueur", "1 tbsp lemon juice", "1½ tsp orange marmalade", "orange peel spiral, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gin, Cointreau, lemon juice and marmalade into a cocktail shaker with some ice and shake well to combine.", "To serve, strain into a Martini glass and garnish with a spiral of orange peel."]}, {"isVegetarian": false, "title": "Bream stuffed with walnuts and pomegranates", "url": "www_bbc_co_uk_food_recipes_bream_stuffed_with_76363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 bream (about 350g/12oz each), cleaned, trimmed and scaled ", "3 small garlic cloves, finely chopped ", "1 dried red chilli, crumbled ", "100g/3½oz walnuts, roughly chopped ", "4 tbsp extra virgin olive oil, plus extra for cooking", "½ lemon, juice only", "2 tsp pomegranate molasses", "2 tsp honey ", "30g/1oz coriander leaves, finely chopped ", "100g/3½oz pomegranate seeds", "salt and freshly ground black pepper ", "handful walnuts, roughly chopped", "pomegranate seeds", "extra virgin olive oil, for drizzling", "lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.  ", "Make two diagonal cuts in the fish on each side.  Season the inside of the fish with salt and pepper. ", "Mix the remaining ingredients together and season.  Put this mixture inside each fish and lay them in a lightly oiled roasting tin, or in two separate oiled roasting tins. Season the outside of the fish and drizzle with olive oil.  ", "Bake for 20 minutes or until cooked through. Check the fish at its thickest part - the flesh should be white not glassy.  If they're not ready, return them to the oven for another 4 minutes or so. ", "Just before serving, toast the walnuts in a dry pan until fragrant. ", "Scatter the fish with the walnuts and pomegranate seeds, drizzle with olive oil and serve immediately with lemon wedges."]}]