[{"ingredients": ["1kg / 2 lb 4 oz glaseado de pasta de azúcar blanca", "Glaseado de pasta de azúcar de bronce de 500 g / 1 lb 2 oz", "polvo comestible de bronce", "pegamento comestible", "450 g / 1lb de mantequilla sin sal, temperatura ambiente", "450 g / 1lb de azúcar en polvo", "10 huevos de gallinas camperas", "Harina simple de 450g / 1lb", "Almendras molidas 230 g / 8½ oz", "2 cucharaditas de canela molida", "2 cucharaditas de especias mixtas", "450 g / 1lb sultanas", "450g / 1lb pasas de Corinto", "450 g / 1 libra de pasas", "225g / 8oz de cáscara mixta confitada", "225g / 8oz de cerezas glaseadas, más o menos picadas", "2 naranja, solo ralladura", "2 limón, solo ralladura", "125ml / 4fl oz de aguardiente", "225 g / 8oz de mantequilla sin sal, temperatura ambiente", "225 g / 8 oz de azúcar en polvo", "5 huevos de gallinas camperas", "Harina normal 225g / 8oz", "115gr / 4 oz de almendras molidas", "1½ cucharadita de canela molida", "1½tsp de especias mezcladas", "225 g / 8oz sultanas", "225g / 8oz pasas de Corinto", "225 g / 8oz de pasas", "115g / 4oz de cáscara mixta confitada", "115 g / 4oz de cerezas glaseadas, más o menos picadas", "1 naranja, solo ralladura", "1 limón, ralladura solamente", "4 cucharadas de aguardiente", "115g / 4oz de mantequilla sin sal, temperatura ambiente", "115 g / 4 oz de azúcar en polvo", "2½ huevos de gallinas camperas", "Harina común 115g / 4oz", "55 g / 2 oz de almendras molidas", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas", "115g / 4oz sultanas", "115g / 4oz pasas de Corinto", "115 g / 4oz de pasas", "55g / 2oz de cáscara mixta confitada", "55g / 2oz de cerezas glaseadas, más o menos picadas", "½ naranja, solo ralladura", "½ limón, solo ralladura", "2 cucharadas de aguardiente", "1 x 340 g / 12 oz de mermelada de albaricoque", "azúcar en polvo, para quitar el polvo", "Mazapán de 3.5kg / 7lb 11oz", "5.15kg / 11lb 6oz de glaseado blanco listo para enrollar", "5m / 16ft 5in x 2.5cm / 1in cinta de satén de bronce"], "method": ["Para las flores de azúcar, amase la pasta de azúcar blanca hasta que esté blanda y flexible y extiéndala hasta que tenga 5 mm / ¼ de grosor. Usando los cortadores, corte flores de diferentes tamaños. Haga rodar pequeños trozos de pasta de azúcar de bronce en bolas y péguelas en el centro de las flores con el pegamento comestible. Separe para secar por un par de horas. (Las flores pueden prepararse con hasta un mes de anticipación y almacenarse en un recipiente hermético).", "Precaliente el horno a 160 ° C / 325 ° F / Gas 1. Engrase y forme una lata redonda de 15 cm / 6 pulgadas, 23 cm / 9 pulgadas y 30 cm / 12 pulgadas. Asegúrese de que el papel antigrasa se encuentre por encima de la lata unos 9 cm / 3 pulgadas para que la parte superior de la torta no se queme.", "Para el nivel 30cm / 12in, unte la mantequilla y el azúcar en un tazón hasta que estén bien combinados. Lentamente golpee los huevos, uno a la vez, hasta que estén bien combinados. Doble la harina, almendras molidas, canela y especias mixtas.", "Agregue la fruta seca, la ralladura y el brandy. Con una cuchara, vierte la mezcla en el molde de la torta y hornea en el horno durante cuatro horas, o hasta que un pincho insertado en el medio salga limpio.", "Repita los pasos 2 y 3 para el nivel de 23 cm / 9 pulgadas y hornee en el horno durante tres horas, o hasta que un pincho insertado en el medio salga limpio.", "Repita los pasos 2 y 3 para el nivel de 15 cm / 6 pulgadas y hornee en el horno durante dos horas, o hasta que un pincho insertado en el centro salga limpio.", "Cuando los pasteles estén cocidos, retíralos del horno a un lado para que se enfríen durante 15 minutos. Quítelos de la lata y colóquelos en una rejilla para que se enfríen completamente.", "Caliente la mermelada de albaricoque en una cacerola, luego páselo por un colador.", "Nivele la parte superior de la tarta de fruta de 15 cm / 6 pulgadas, pinte la parte superior con un poco de mermelada de albaricoque y, a continuación, póngala boca abajo sobre la tablita delgada de 15 cm / 6 pulgadas. Con un trozo de cuerda, mida la parte superior y los lados de la torta de fruta (esto es para que enrolle el mazapán al tamaño correcto). Pintar el pastel de frutas con la mermelada de albaricoque.", "Espolvoree una superficie de trabajo con azúcar glasé y extienda 500 g / 1lb 2 oz del mazapán hasta que sea lo suficientemente grande como para cubrir la parte superior y los lados de la torta de fruta (use la cuerda como guía). Con cuidado, levante el mazapán en la torta y alisarlo con las manos. Recorte cualquier exceso de mazapán, asegurándose de que el tablero de la torta también esté cubierto.", "Pinte el pastel con agua hervida y fría. Amasar 500 g / 1lb 2 oz de glaseado blanco hasta que esté suave y flexible y extenderlo hasta que tenga 5 mm / ¼ de grosor y lo suficientemente grande como para cubrir la parte superior y los lados de la torta de fruta (utilice la cuerda como guía). Con cuidado, levante la guinda del pastel y aliméntelo con sus manos. Recorte cualquier exceso de formación de hielo. Deje los pasteles durante la noche para que la formación de hielo se seque (no guarde los pasteles en el refrigerador).", "Repita los pasos 9, 10 y 11 para el pastel de 23 cm / 9 pulgadas usando 1 kg / 2 lb 4 oz cada uno de mazapán y glaseado.", "Repita los pasos 9, 10 y 11 para la torta de 30 cm / 12 in usando 2 kg / 4 lb 8 oz cada uno de mazapán y glaseado.", "Una vez que el glaseado se haya secado, aplique una fina línea de pegamento comestible alrededor del borde inferior de cada pastel y pegue cuidadosamente una cinta alrededor de la torta, asegurando la unión con un poco de pegamento adicional.", "Para insertar las varillas de sujeción, sostenga una varilla de sujeción al costado de la torta de 23cm / 9 pulgadas y marque con un lápiz donde se encuentra la guinda. Corta la varilla y otros tres con la misma longitud. Empuje las varillas en la torta a unos 5 cm / 2 pulgadas de distancia de los lados, para formar las cuatro esquinas de un cuadrado en el centro de la torta. Mida, corte e inserte las barras de la misma manera para la torta de 30cm / 12in.", "Para cubrir los tableros para pasteles de 20cm / 8 pulgadas de grosor, amase 400 g / 14 oz del glaseado hasta que estén blandos y flexibles y extiéndalos hasta que tengan 5 mm / ¼ de grosor y sean lo suficientemente grandes como para cubrir el tablero de la torta. Extienda un poco de pegamento sobre el tablero, luego levante con cuidado el glaseado sobre el tablero de la torta, alisándolo hasta que quede plano. Recorta los bordes. Aplique una fina línea de pegamento alrededor del borde de la tarta y cuidadosamente pegue la cinta alrededor de la torta, asegurando la unión con un poco de pegamento adicional.", "Repita el paso 16 con 500g / 1lb de glaseado de 2oz para el tablero para tartas de 28cm / 11in y 750g / 1lb de glaseado de 10oz para el tablero de tarta de 35cm / 14in.", "Si transporta los pasteles a un lugar, es mejor transportarlos por separado y armar el pastel en el lugar. Para armar las tortas, primero pegue la tarta de 30cm / 12in en la tarta de pastel de 35cm / 14in. Agregue un poco de pegamento en el medio de la tarta de pastel de 35 cm / 14 pulgadas, luego coloque la torta de 30 cm en el centro. Coloque cuatro de los pilares en la parte superior, colocando cada uno sobre una varilla de espiga. Cubra con el tablero para tartas de 28cm / 11 pulgadas y repita el proceso con el pastel de 23cm / 9 pulgadas, terminando con el pastel de 20cm / 8 pulgadas y el pastel de 15cm / 6 pulgadas. Usando el pegamento comestible, coloque las flores de azúcar en la parte superior de la torta y alrededor de los lados de la torta de 15cm / 6in, 23cm / 9in y 30cm / 12in."], "url": "www_bbc_co_uk_food_recipes_traditional_wedding_cake_46381", "title": "Pastel de bodas tradicional", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 100", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz de glaseado blanco listo para enrollar", "polvo comestible rosa", "pegamento comestible", "150 g / 5½ oz de mantequilla, más extra para engrasar", "90g / 3¼ oz de azúcar moreno oscuro", "60g / 2¼ oz de azúcar en polvo", "2 cucharaditas de esencia de vainilla", "5 huevos de gallinas camperas", "165g / 5¾oz pasas de Corinto", "225 g / 8oz de pasas", "340g / 12½oz sultanas", "½ naranja, solo ralladura", "1 cucharada de melaza negra", "½ cucharadita de bicarbonato de soda", "Harina de crianza de 185g / 6½oz", "½ cucharadita de clavo de olor molido", "½ cucharadita de canela molida", "250 g / 9 oz de mantequilla, más extra para engrasar", "150g / 5½oz de azúcar moreno oscuro", "100 g / 3½ oz de azúcar en polvo", "3 cucharaditas de esencia de vainilla", "8 huevos de gallinas camperas", "275g / 9¾oz pasas de Corinto", "375 g / 13oz de pasas", "565g / 1lb 4oz sultanas", "1 naranja, solo ralladura", "2 cucharadas de melaza negra", "¾ cucharadita de bicarbonato de soda", "Harina de auto crianza 310g / 11oz", "¾ cucharadita de clavo molido", "¾ cucharadita de canela molida", "375g / 13oz de mantequilla, más extra para engrasar", "225g / 8oz de azúcar moreno oscuro", "150 g / 5½ oz de azúcar en polvo", "4 cucharaditas de esencia de vainilla", "12 huevos de gallinas camperas", "410 g / 14½ oz de grosella", "550 g / 1lb 4oz pasas", "850g / 1lb 14oz sultanas", "1½ naranjas, solo ralladura", "3 cucharadas de melaza negra", "1 cucharadita de bicarbonato de soda", "Harina de auto aumento de 450g / 1lb", "1 cucharadita de clavo de olor molido", "1 cucharadita de canela molida", "1 x 340 g / 12 oz de mermelada de albaricoque", "azúcar en polvo, para quitar el polvo", "Mazapán de 3.5kg / 7lb 11oz", "5.15kg / 11lb 6oz de glaseado blanco listo para enrollar"], "method": ["Para hacer las rosas, pellizca un poco de hielo y enróllalo en la palma de tus manos para hacerlo más maleable. Forme la formación de hielo en una forma ovalada, alise un extremo del óvalo para hacerlo más delgado de manera que se asemeje a la parte con volantes de la punta de un pétalo de rosa. Haga 8-10 pétalos de rosa más de esta manera. Para hacer una rosa, enrolle una pequeña bola de glaseado en forma de cono y luego envuelva con un pétalo de rosa. Con cuidado, presione los pétalos de rosa restantes alrededor del pétalo central para formar una forma de rosa. Es posible que necesites 'molestar' a los pétalos el uno del otro un poco.", "Cuidadosamente cepilla los bordes de las rosas con polvo rosa. Repite el proceso hasta que hayas hecho unas 15 rosas. Dejar de lado durante 2-3 horas, o hasta que la formación de hielo se haya endurecido. (Las rosas se pueden preparar hasta con un mes de anticipación y se almacenan en un recipiente hermético).", "Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase y forme una lata redonda de 15 cm / 6 pulgadas, 23 cm / 9 pulgadas y 30 cm / 12 pulgadas.", "Para el nivel 15cm / 6in, unte la mantequilla, el azúcar y la vainilla en un bol hasta que estén bien combinados. Poco a poco golpee los huevos, uno a la vez, hasta que estén bien combinados. Agregue la fruta seca, la ralladura de naranja y la melaza, luego agregue el bicarbonato de soda, la harina y las especias hasta que estén bien combinados. Coloque la mezcla en el molde de la torta y hornee en el horno durante aproximadamente dos horas, o hasta que un pincho insertado en el medio salga limpio.", "Repita el paso 4 para el nivel de 23 cm / 9 pulgadas y hornee en el horno durante tres horas, o hasta que un pincho insertado en el medio salga limpio.", "Repita el paso 4 para el nivel de 30 cm / 12 pulgadas y hornee en el horno durante 4 horas y media, o hasta que un pincho insertado en el centro salga limpio.", "Cuando los pasteles estén cocidos, retírelos del horno y déjelos a un lado para que se enfríen durante 15 minutos. Retírelos de la lata y déjelos a un lado sobre una rejilla de alambre para que se enfríen completamente.", "Caliente la mermelada de albaricoque en una cacerola, luego páselo por un colador.", "Nivele la parte superior de la tarta de fruta de 15 cm / 6 pulgadas, pinte la parte superior con un poco de mermelada de albaricoque y, a continuación, póngala boca abajo sobre la tablita delgada de 15 cm / 6 pulgadas. Con un trozo de cuerda, mida la parte superior y los lados de la torta de fruta (esto es para que enrolle el mazapán al tamaño correcto). Pintar el pastel de frutas con la mermelada de albaricoque.", "Polvore una superficie de trabajo con azúcar glas y enrolle 500 g / 1lb 2oz del mazapán hasta que sea lo suficientemente grande como para cubrir la parte superior y los lados de la torta de fruta (use la cuerda como guía). Con cuidado, levante el mazapán en la torta y alisarlo con las manos. Recorte cualquier exceso de mazapán, asegurándose de que el tablero de la torta también esté cubierto.", "Pinte el pastel con agua hervida y fría. Amasar 500 g / 1lb 2 oz de glaseado blanco hasta que esté suave y flexible y extenderlo hasta que tenga 5 mm / ¼ de grosor y lo suficientemente grande como para cubrir la parte superior y los lados de la torta de fruta (utilice la cuerda como guía). Con cuidado, levante la guinda del pastel y aliméntelo con sus manos. Recorte cualquier exceso de formación de hielo. Deje los pasteles durante la noche para que la formación de hielo se seque (no guarde los pasteles en el refrigerador).", "Repita los pasos 9, 10 y 11 para el pastel de 23 cm / 9 pulgadas usando 1 kg / 2 lb 4 oz cada uno de mazapán y glaseado.", "Repita los pasos 9, 10 y 11 para la torta de 30 cm / 12 in usando 2 kg / 4 lb 8 oz cada uno de mazapán y glaseado.", "Una vez que el glaseado se haya secado, aplique una fina línea de pegamento comestible alrededor del borde inferior de cada pastel y pegue cuidadosamente una cinta alrededor de la torta, asegurando la unión con un poco de pegamento adicional.", "Para insertar las varillas de sujeción, sostenga una varilla de sujeción al costado de la torta de 23cm / 9 pulgadas y marque con un lápiz donde se encuentra la guinda. Corta la varilla y otros tres con la misma longitud. Empuje las varillas en la torta a unos 5 cm / 2 pulgadas de distancia de los lados, para formar las cuatro esquinas de un cuadrado en el centro de la torta. Mida, corte e inserte las barras de la misma manera para la torta de 30cm / 12in.", "Para cubrir el cartón para pastel de 20 cm / 8 pulgadas, amasar 400 g / 14 oz del glaseado hasta que esté suave y flexible y extenderlo hasta que tenga un grosor de 5 mm / ¼ y lo suficientemente grande como para cubrir el tablero de la torta. Extienda un poco de pegamento sobre el tablero, luego levante con cuidado el glaseado sobre el tablero de la torta, alisándolo hasta que quede plano. Recorta los bordes. Aplique una fina línea de pegamento alrededor del borde de la tarta y cuidadosamente pegue la cinta alrededor de la torta, asegurando la unión con un poco de pegamento adicional.", "Repita el paso 16 con 500g / 1lb de glaseado de 2oz para el tablero para tartas de 28cm / 11in y 750g / 1lb de glaseado de 10oz para el tablero de tarta de 35cm / 14in.", "Si transporta los pasteles a un lugar, es mejor transportarlos por separado y armar el pastel en el lugar. Para armar las tortas, primero pegue la tarta de 30cm / 12in en la tarta de pastel de 35cm / 14in: agregue un poco de pegamento en el medio de la tarta de pastel de 35cm / 14in, luego coloque la tarta de 30cm / 12in en el medio. Coloque cuatro de los pilares en la parte superior de la torta más grande, colocando cada uno sobre una varilla de sujeción. Cubra con el tablero para tartas de 28cm / 11 pulgadas y repita el proceso con el pastel de 23cm / 9 pulgadas, terminando con el pastel de 20cm / 8 pulgadas y el pastel de 15cm / 6 pulgadas. Usando el pegamento comestible, coloque las rosas fondant en un grupo en la parte superior de la torta y alrededor del lado de la torta de 23cm / 9in y 30cm / 12in."], "url": "www_bbc_co_uk_food_recipes_traditional_wedding_cake_68531", "title": "Pastel de bodas tradicional", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_wedding_cake_68531_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["jugos de carne", "2 cucharadas de grasa de carne líquida", "Harina normal de 30g / 1oz", "Stock de 570ml / 1 pinta", "2 cucharaditas de jugo de salsa (opcional)"], "method": ["Recoge los jugos y la grasa de la carne que estás rostizando. Coloque los jugos en una jarra de vidrio y deje reposar por unos minutos para que la grasa salga a la superficie. Elimina la grasa.", "Coloque la lata de asar que usó para cocinar la carne en el fogón a fuego medio y agregue la grasa. (La carne debe estar descansando, cubierta con papel de aluminio, en un lugar cálido en este punto)", "Agregue la harina y cocine por 1 minuto.", "Agregue los jugos de carne y agregue gradualmente el caldo hasta que obtenga una salsa suave. Use una cuchara de madera y revuelva sobre la superficie de la sartén para incorporar los jugos de carne que estén pegados a ella.", "Llevar a ebullición y dejar hervir a fuego lento durante 10 minutos.", "Sazone al gusto y agregue un poco de jugo de salsa si lo desea."], "url": "www_bbc_co_uk_food_recipes_traditionalgravy_1283", "title": "Salsa tradicional", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditionalgravy_1283_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de cerdo mediano a grande", "200g / 7¼ oz de budín negro de buena calidad", "1 manzana golden delicious, pelada, rebanada finamente y blanqueada", "sal y pimienta negra recién molida", "botón de mantequilla", "un poco de aceite de oliva"], "method": ["Precalentar el horno a 200C / 400C / Gas 6.", "Corta la carne de cerdo con un cuchillo afilado y abre el filete a lo largo, teniendo cuidado de no cortar todo el filete.", "Corte la morcilla en forma de salchicha y colóquela a lo largo del filete. Esparce la manzana junto con la morcilla. Sazonar bien", "Suavemente enrolle el filete y ate con una cuerda.", "Envuelva el filete en una película adhesiva y déjelo reposar en la nevera durante un par de horas antes de cocinarlo.", "Para cocinar, sazone el filete y el panfry con un poco de mantequilla y aceite de oliva y colóquelo en el horno por quince minutos.", "Deje reposar antes de servir para que la carne absorba los jugos."], "url": "www_bbc_co_uk_food_recipes_traditionalporkwitha_72079", "title": "Cerdo tradicional con manzana y morcilla", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de sultanas", "1 taza de té negro fuerte y caliente", "1.3 litros / 2 pintas 7 fl oz de leche", "300ml / 10½ fl oz crema doble", "200g / 7oz de arroz con leche", "100g / 3½ oz de azúcar granulada dorada", "pellizcar nuez moscada recién molida", "1 vaina de vainilla, partido, semillas raspadas", "crema coagulada, para servir", "jam, para servir"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Coloque las sultanas en un recipiente y vierta sobre el té caliente. Poner a un lado para remojar durante diez minutos, luego drenar (descartar el té).", "En una cazuela grande o en un plato de arroz con leche (aproximadamente 30 cm x 20 cm) mezcle la leche y la crema. Agregue el arroz, el azúcar y una pizca de nuez moscada. Agregue la vaina de vainilla y las semillas, luego mezcle las pasas sultanas.", "Cubra el plato con una tapa o una hoja de papel de aluminio, luego cocine en el horno durante 1 ½ horas. Retire la tapa o papel de aluminio y cocine por otros 20 minutos, o hasta que el arroz esté tierno y la parte superior ligeramente dorada y haya formado una capa.", "Para servir, ponga el arroz con leche en tazones para servir y sirva con cucharadas de crema y mermelada."], "url": "www_bbc_co_uk_food_recipes_traditionalricepuddi_93164", "title": "Arroz con leche tradicional", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 solomillo de ternera en el hueso, que pesa 5-6 lb (2.25-2.75 kg) - esto sería 3 costillas", "½ cebolla, pelada", "1 cucharada sopera de polvo de mostaza", "1 cucharada sopera de harina normal", "pimienta negra recién molida"], "method": ["Precalentar el horno a 240C / 475F / Gas 9.", "Coloque la carne de vacuno, tal como está, en posición vertical en una lata de asar, metiendo la media cebolla a su lado.", "Combine el polvo de mostaza y la harina, luego espolvoree esto por toda la superficie de la grasa y finalmente sazone con unos pocos giros de pimienta recién molida. Esta superficie harinosa ayudará a que la grasa quede muy crujiente (para aquellos que como yo queremos comer lo que yo llamo los crispies), mientras que la cebolla se caramelizará para darle a la salsa un rico color y sabor.", "Coloque la junta en el horno, tendrá mucha grasa, así que no agregue más. Después de 20 minutos, reduzca la temperatura a 190 ° C / 375 ° F / Gas 5 y continúe cocinando durante 15 minutos por lb (450 g) para los extraños, más 15 minutos adicionales para medios raros o 30 minutos extra para bien hecho.", "Mientras cocina, hilvane la carne con los jugos por lo menos tres veces. Para ver si la carne está cocida a tu gusto, inserta un pincho delgado y presiona algunos jugos: el color rojo, rosado o claro indicará en qué etapa se ha cocinado la carne.", "Retire la carne cocida en una tabla para tallar y déjela reposar durante al menos 30 minutos antes de servir (mientras está en reposo puede aumentar el calor en el horno para terminar las patatas asadas si las está sirviendo).", "Este período de reposo permite que la mayoría de los jugos que han burbujeado hasta la superficie de la carne se filtren nuevamente dentro de él, y la carne se reafirma para facilitar la talladura. Sin embargo, algunos de los jugos se escaparán, y estos deberían verterse en la salsa."], "url": "www_bbc_co_uk_food_recipes_traditionalroastsirl_9400", "title": "Solomillo asado tradicional de ternera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "2 huevos de gallinas camperas", "175ml / 6fl oz de leche (entera o semidesnatada)", "110 ml / 4 fl oz de agua", "2 cucharadas de goteo de carne", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Comience colocando un colador sobre un tazón grande para mezclar, luego tamice la harina, sosteniendo el colador en alto para que la harina se ventile bien al entrar en el tazón. Haz un pozo en el centro y rompe los huevos en él. Agrega la sal y la pimienta.", "Batir los huevos con un batidor eléctrico y, al batirlos, la harina alrededor de los bordes se incorporará lentamente. Mida la leche y el agua en una jarra medidora y cuando la mezcla se endurezca, agregue la mezcla gradualmente, batiendo continuamente. Detener y raspar los lados del tazón con una espátula para que todos los grumos puedan ser empujados hacia abajo en la masa, luego bata de nuevo hasta que todo esté suave. Ahora que el rebozado está listo para su uso y aunque se ha rumoreado que el rebozado se deja reposar es mejor, no he encontrado ninguna base para esto, así que solo hazlo cuando sea conveniente.", "Con una cuchara, la carne goteando en la lata de asar y dejar que se caliente en el horno. Cuando el horno esté a la temperatura adecuada, retire la lata y colóquela sobre un calor directo (convertido en medio). Luego, cuando la grasa comience a brillar y fume un poco, vierta la mezcla. Incline de manera uniforme todo alrededor y luego coloque la lata en un estante alto en el horno y cocine por 40 minutos o hasta que esté dorado y crujiente. Servir cortado en cuadrados presto pronto."], "url": "www_bbc_co_uk_food_recipes_traditionalyorkshire_67345", "title": "Budín tradicional de Yorkshire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditionalyorkshire_67345_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["puñado de verduras salteadas", "30g / 1oz de 'fideos instantáneos' secos, bolsita de condimento descartada", "25g / 1oz de crema de coco", "Jengibre fresco de la raíz 2.5cm / 1in, rallado", "1 diente de ajo, rallado", "½ cubo de caldo de verduras", "½ lima, solo jugo", "pizca de hojuelas de chile (opcional)", "1 cucharadita de salsa de pescado (opcional)", "sal y pimienta negra recién molida", "15 g / ½ oz de tiras de pollo cocidas o cubos de tofu firme", "pequeño cilantro puñado, para servir"], "method": ["Aparte todos los ingredientes del pollo y el cilantro en un recipiente con tapa a prueba de calor.", "Cuando esté listo para comer, vierta 300 ml / 10 fl oz de agua hirviendo sobre la mezcla hasta que esté tapado. Coloque la tapa en el recipiente y déjela durante 5 minutos.", "Revuelva bien para romper los fideos (precaución: el recipiente puede estar caliente), luego vuelva a colocar la tapa y déjela durante 5 minutos.", "Agregue el pollo y mezcle bien. Espolvoree el cilantro en la parte superior, si se usa, y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_travelling_coconut_01827", "title": "Viajar laksa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/travelling_coconut_01827_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos grandes de gallinas camperas", "1 cucharada de leche", "sal y pimienta negra recién molida", "2 cucharadas de espinaca baby rallada", "1 cucharada de jamón desmenuzado", "1 cucharada de Cheddar rallado (opcional)"], "method": ["Coloque los huevos y la leche en un tarro de mermelada de 225 g / 8oz, sazone con sal y pimienta y bata con un tenedor.", "Agregue la espinaca, el jamón y el Cheddar.", "Microondas a temperatura alta durante 2 minutos y 20 segundos, luego déjelos reposar por otros 2 minutos. (Precaución: el frasco puede estar aún caliente). Servir"], "url": "www_bbc_co_uk_food_recipes_travelling_frittata_52293", "title": "Tortilla de viaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de arroz 30 g / 1 oz", "puñado de verduras salteadas", "Jengibre fresco de la raíz 2.5cm / 1in, rallado fino", "1 diente de ajo, finamente rallado", "1 cucharada de salsa de soja oscura", "¼ cubo de caldo de verduras, desmenuzado", "1 cucharadita de miel líquida", "pellizcar los copos de chile seco (opcional)", "pizca de pimienta negra recién molida", "15 g / ½ oz de tiras de pollo cocidas o 2,5 cm / 1 en cubos de tofu", "pequeño cilantro fresco puñado, para servir"], "method": ["Aparte todos los ingredientes del pollo y el cilantro en su recipiente y ponga la tapa.", "Cuando esté listo para comer, vierta agua hirviendo sobre la mezcla hasta que esté tapado. Coloque la tapa sobre la jarra y déjela durante 5 minutos (precaución: la jarra aún puede estar caliente).", "Agregue el pollo y mezcle bien. Espolvoree el cilantro encima y cómalo inmediatamente."], "url": "www_bbc_co_uk_food_recipes_travelling_noodle_soup_88753", "title": "Sopa de fideos con salsa de soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de harina de auto crianza", "2 cucharaditas de azúcar en polvo", "3 cucharadas de leche", "1 cucharada de miel líquida, más extra para servir", "1½ cucharadita de aceite vegetal", "1 cucharada de arándanos, más algunos para servir"], "method": ["Pon la harina y el azúcar en el tarro y revuelve. Batir ligeramente en la leche, la miel y el aceite hasta que la mezcla esté un poco pastosa. Revuelva suavemente los arándanos, teniendo cuidado de no aplastarlos.", "Microondas por 1 minuto en un microondas de 800W. Deje reposar durante 2 minutos.", "Retire del microondas con un paño de cocina (Precaución: el recipiente puede estar aún caliente). Para servir, rocíe con miel y espolvoree sobre los arándanos."], "url": "www_bbc_co_uk_food_recipes_travelling_pancake_78989", "title": "Panqueque de viaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de melaza negra", "1 x 800 g / 1 libra de filete de ternera de 12 onzas (un corte medio como costilla o lomo), a temperatura ambiente", "sal y pimienta negra", "3-4 cucharadas de aceite vegetal", "2 perillas de mantequilla", "8 papas (como Maris Piper), peladas y cortadas en trozos grandes", "500 g / 1 libra de espinaca 2 oz, lavado", "Salsa de vino tinto o salsa de 500ml / 18fl oz, para servir", "4 huevos de gallinas camperas", "350 ml / 12 fl oz de leche", "Harina normal 225g / 8oz"], "method": ["Para marinar la carne, mezcle la melaza con 100 ml / 3½ fl oz de agua. Coloque la carne en un recipiente y cubra con la mezcla de melaza. Dejar marinar durante 24 horas, volteando ocasionalmente.", "Después de 24 horas, retire la carne del adobo y seque. Coloque el adobo en una sartén y caliente suavemente hasta que el volumen del líquido se haya reducido a la mitad. Condimentar con sal y pimienta.", "Para los budines de Yorkshire, mezcle los huevos y la leche en una jarra. Coloque la harina en un recipiente y luego bata lenta y suavemente la mezcla de leche y huevo. No sobre-batir - los bultos están bien. Descanse la mezcla a temperatura ambiente durante al menos cuatro horas.", "Para cocinar la carne, precaliente el horno a 55C / 130F / Gas ¼ (o la configuración más baja posible en su horno).", "Caliente un poco de aceite en una sartén grande a fuego alto. Cuando esté caliente, agregue un pomo de mantequilla y fría la carne de res por todos lados. Coloque la carne en una lata para asar y transfiérala al estante inferior del horno por 45 minutos (o más si prefiere que la carne esté bien cocida).", "Retire la carne del horno y cepille con el adobo reducido. Cubra y reserve para descansar.", "Para hacer las papas asadas, ponga a hervir un sartén grande de agua salada. Agregue las papas y cocine hasta que estén suaves por fuera. Escúrralos y déjelos secar al vapor en una rejilla de alambre colocada sobre una lata para asar.", "Precalentar el horno a 200C / 400F / Gas 6.", "Agregue un poco de aceite a una lata para asar y colóquelo en el horno para calentarlo. Cuando el aceite esté caliente, agregue las papas secas y revuelva suavemente para cubrir con aceite. Asar durante 40 minutos, volteándolos de vez en cuando, hasta que estén crujientes y dorados.", "Para los budines de Yorkshire, agregue un poco de aceite vegetal a cada hoyo de una lata de muffin o de pudín de Yorkshire y colóquelo en el horno (aún a 200C / 400F / Gas 6) para calentarlo.", "Cuando el aceite esté caliente y la pasta del pudín de Yorkshire esté descansada, rellene cada orificio de la lata del panecillo y cocine en el horno durante 15-20 minutos, o hasta que se levante y se dore.", "Justo antes de servir, moje las espinacas en una olla con un poco de mantequilla. Sazonar con sal y pimienta negra recién molida.", "Para servir, caliente la salsa o salsa de vino tinto. Cortar la carne y agregar a los platos con la salsa, las espinacas, las patatas asadas y los budines de Yorkshire."], "url": "www_bbc_co_uk_food_recipes_treacle_cured_beef_with_35837", "title": "Carne de ternera curada con curado con pudines de Yorkshire y patatas asadas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/treacle_cured_beef_with_35837_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mantequilla sin sal 180g / 6oz, ablandada, más extra para engrasar", "3 cucharadas de jarabe de oro", "Harina normal 180g / 6oz", "3 cucharaditas de polvo de hornear", "3 huevos de gallinas camperas", "Azúcar demerara 180g / 6oz", "1 cucharada de melaza negra"], "method": ["Engrase un cuenco con leche de 1litre / 1¾ pintas con mantequilla. Pon el jarabe dorado en el fondo del lavabo.", "En un recipiente aparte, con un batidor de mano eléctrico, mezcle la harina, el polvo de hornear, la mantequilla, los huevos, el azúcar y la melaza hasta que estén bien combinados.", "Vierta la mezcla en el recipiente y cubra con un trozo de papel resistente a la grasa.", "Toma un trozo de papel de aluminio y haz un pliegue por la mitad, luego ponlo sobre la parte superior del recipiente para budines y átelo como una tapa. El pliegue permite que la lámina se expanda durante la cocción.", "Coloque un platillo revuelto o un molde en una cacerola profunda y siéntelo encima. Agregue agua hirviendo hasta que llegue a la mitad del lavabo. Coloque una tapa en la sartén y cocine a fuego lento suavemente para que el pudín fluya por aproximadamente 2¼ horas, llenando el agua según sea necesario.", "Para comprobar si el budín está cocido, inserte un pincho de metal en el pudín. Si sale limpio, está listo.", "Retire con cuidado el pudín de la sartén. Afloja los bordes colocando un cuchillo de mesa alrededor del pudin y ponlo en un plato."], "url": "www_bbc_co_uk_food_recipes_treacle_pudding_80920", "title": "Pudín de Treacle", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/treacle_pudding_80920_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla, bien ablandada, más extra para engrasar", "115 g / 4 oz de azúcar en polvo", "2 huevos de gallinas camperas, ligeramente golpeados", "1 nuez moscada rallada, más extra para servir", "1 lima, ralladura rallada solamente", "1 limón, ralladura rallada solamente", "Harina de crianza de 140g / 5oz, tamizada, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "1 cucharada de leche, o más si es necesario", "Toffee treacle de 55 g / 2 oz (si no está disponible, use mantequilla o dulce de azúcar), picado en trozos pequeños", "3 cucharadas de melaza o jarabe de oro", "lactoso"], "method": ["En un tazón, bata la mantequilla y el azúcar junto con una batidora eléctrica manual hasta que esté pálida y esponjosa.", "Agregue la mitad de los huevos batidos y continúe latiendo durante 1-2 minutos. Detener, raspe los lados del recipiente, luego agregue el huevo batido restante y continúe batiendo por 1-2 minutos. Raspe los lados nuevamente. Agregue la ralladura de nuez moscada, lima y limón, y bata por unos segundos más.", "Con una cuchara de metal, pliegue gradualmente la harina cernida y el polvo de hornear en la mezcla lo más levemente posible, manteniendo la consistencia de caída agregando leche, si es necesario. Doble las piezas de caramelo o dulce de azúcar.", "Pon a hervir una olla grande de agua y coloca una olla con tapa encima.", "Enmantequilla y enharina ligeramente un recipiente de pudín de 1,2 litros / 2 pinta. Coloque la melaza (o el jarabe dorado) en el fondo del recipiente y luego agregue la mezcla de budín. Asegure la tapa y vaporice suavemente durante tres horas, agregando más agua a la sartén si es necesario; mantenga un ojo sobre la sartén para que no se hirviendo. El budín se cocina cuando un pincho insertado sale limpio.", "Servir con flan y nuez moscada extra rallada."], "url": "www_bbc_co_uk_food_recipes_treacle_pudding_with_38249", "title": "Treacle pudding con nuez moscada, limón y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1 pinta 15 fl oz de agua", "Sal 50g / 2oz", "50 g / 2 oz de azúcar", "½ cucharada de melaza negra", "½ cucharadita de bayas de pimienta molida", "5 bayas de enebro", "½ cucharadita de pimienta negra", "2 hojas sabias", "2 hojas de laurel", "1 cabeza de ajo, reducido a la mitad", "2 chalotes, pelados y en rodajas", "1 ramita de tomillo", "4 filetes de cordero", "2 cucharadas de aceite vegetal", "4 zanahorias, cortadas en cubos de 1cm / ½ en", "150ml / 5fl oz de crema doble", "1 cucharadita de semillas de comino", "sal y pimienta negra recién molida", "1 cucharadita de mantequilla sin sal", "½ limón, solo jugo", "ramita de perifollo", "250ml / 9fl oz de caldo de pollo", "125ml / 4½fl oz de vinagre balsámico"], "method": ["Para hacer el adobo, coloque todos los ingredientes en una sartén y deje que hierva.", "Retirar del fuego y dejar enfriar.", "Agregue el cordero al adobo, cúbralo y déjelo toda la noche en la nevera.", "Precaliente el horno a 180C / 355F / Gas 4.", "Para las zanahorias, coloca las zanahorias en una sartén y cúbrelas con agua fría. Llevar a ebullición y cocine a fuego lento hasta que estén tiernos.", "Drene el agua, dejando dos cucharadas detrás.", "Vierta la crema doble y mezcle bien.", "Caliente una sartén seca por separado y agregue las semillas de alcaravea. Cocine por 1-2 minutos.", "Mezcle la semilla con la zanahoria y agregue la mantequilla.", "Para la salsa, reduzca el caldo y el vinagre hasta que se espese a la consistencia de la melaza.", "Retire la carne del adobo y seque las toallas de cocina.", "Caliente una sartén con un chorrito de aceite hasta que esté caliente y agregue el cordero. Sear por todos lados.", "Transfiera a un plato resistente al horno y colóquelo en el horno para cocinar por otros 15-20 minutos.", "Retire y sirva con las zanahorias y la salsa en un plato para servir oblongo."], "url": "www_bbc_co_uk_food_recipes_treaclemarinatedlamb_74708", "title": "Treacle filete de cordero marinado con zanahorias en salsa de alcaravea", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 3kg / 6lb 8oz", "1.25kg / 2lb 12 oz de mantequilla, cortada en cubitos", "10 huevos de gallinas camperas, golpeados", "2 litros / 3½ pintas de jarabe de oro", "625g / 1lb 6oz de pan rallado fresco", "10 huevos de gallinas camperas, ligeramente golpeados", "5 limones, ralladura y jugo"], "method": ["Para la masa, frote la mantequilla en la harina hasta que la mezcla se asemeje a pan rallado. Poco a poco agregue el huevo batido y mezcle para hacer una masa. Es posible que necesite agregar un poco de agua fría.", "Envuelva la masa en una película adhesiva y colóquela en la nevera durante al menos 30 minutos. Si está haciendo cinco tartas, divida la mezcla en cinco porciones de igual peso y envuélvalas por separado.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase ligeramente cinco latas para tarta de fondo suelto de 25 cm / 10 pulgadas, o dos bandejas para hornear de 40 cm x 30 cm / 16 pulgadas x 12 pulgadas.", "Sobre una superficie ligeramente enharinada, despliegue la masa y úsela para alinear las cajas de tartas o las bandejas para hornear.", "Cubra la caja de pastelería con film transparente y colóquelo en la nevera para que repose durante 15 minutos.", "Retire la masa de la nevera y retire la película adhesiva. Cubra las cajas de repostería con papel resistente a la grasa y rellene con alubias para hornear.", "Transfiera al horno y hornee a ciegas por 10-15 minutos.", "Retire las cajas de pastelería del horno y retire el papel a prueba de grasa y los frijoles para hornear. Vuelva al horno por 3-5 minutos más.", "Retire las cajas de repostería del horno y baje la temperatura del horno a 140C / 275F / Gas 1.", "Para el relleno, coloque el almíbar dorado, las migas de pan, los huevos batidos y el jugo de limón y la ralladura en un tazón grande y mezcle bien.", "Vierta la mezcla de relleno en las cajas de pastelería, transfiéralas al horno y hornee durante aproximadamente 50 minutos o hasta que estén doradas. Retirar del horno y dejar enfriar un poco."], "url": "www_bbc_co_uk_food_recipes_treacle_tart_36254", "title": "Treacle tarta para una multitud", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "110 g / 4 oz de mantequilla, refrigerada, en cubitos", "1 huevo mediano de granja, ligeramente golpeado", "450g / 1lb de jarabe dorado", "85g / 3oz de pan rallado fresco", "Jengibre molido generoso", "1 limón, ralladura, finamente rallado y 2 cucharadas de jugo", "Crema cuajada o crema doble"], "method": ["En un tazón, frote la mantequilla en la harina con los dedos hasta que se asemeje a finas migas de pan.", "Mezcle el huevo con un cuchillo, luego amasar sobre una superficie de trabajo limpia y ligeramente espolvoreada para formar una masa suave.", "Use la masa para revestir una lata agria de fondo suelto de 23 cm / 9 pulgadas, pinche la base con un tenedor y déjela reposar en la nevera durante aproximadamente 30 minutos.", "Precalentar el horno a 190C / 375F / Gas 5.", "Cubra la masa con papel pergamino y pese con arroz o granos de cerámica para hornear. Hornee la persiana de pastelería durante 10-15 minutos, retire el papel y el arroz o los frijoles y devuelva la caja de repostería al horno durante unos minutos más, hasta que se dore.", "Para el relleno, mezcle los ingredientes de relleno en un recipiente y viértalo en la caja de repostería. Regrese al horno y hornee durante aproximadamente 30 minutos. Sirva caliente o frío con crema cuajada o crema doble."], "url": "www_bbc_co_uk_food_recipes_treacletart_67656", "title": "Tarta de melaza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/treacletart_67656_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jarabe dorado de 200g / 7oz", "1 pera, pelada, finamente cortada de arriba a abajo", "175g / 6oz de azúcar en polvo", "175g / 6oz de mantequilla ablandada, más extra para engrasar", "3 huevos de gallinas camperas", "Harina de 175g / 6oz de auto crianza", "500ml / 18fl oz de vino blanco dulce", "Anís de 3 estrellas", "½ cucharadita de clavo de olor", "1 palito de canela, roto en pedazos", "4 peras, peladas y cortadas en cuartos de arriba a abajo", "1 naranja, piel recién cortada", "1 limón, piel recién cortada", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, partida por la mitad, semillas raspadas con un cuchillo afilado", "Azúcar en polvo de 110 g / 4 oz", "6 yemas de huevo de gallinas camperas"], "method": ["Engrase un molde de terrina rectangular de 1 kg / 2 lb 4 oz o una lata de pan con mantequilla.", "Vierta el jarabe dorado en el molde de terrina, luego coloque las rodajas de pera en la parte superior en una sola capa, superponiendo ligeramente las rebanadas.", "Batir el azúcar y la mantequilla hasta que estén pálidos y esponjosos. Batir los huevos uno por uno hasta que estén bien combinados, luego doblar la harina.", "Vierta la mezcla de esponja en la terrina y alise la parte superior.", "Corta un rectángulo grande de papel resistente a la grasa y colócalo encima del pudín. Dobla un rectángulo de papel de aluminio por la mitad para formar una doble capa, luego engarce alrededor de la parte superior de la terrina y asegúrala con la cuerda del cocinero.", "Coloque la terrina en una olla grande y agregue suficiente agua para llegar a la mitad de los lados de la terrina.", "Cubra la olla con una tapa, hierva el agua y luego reduzca el fuego hasta que hierva a fuego lento. Cueza al vapor el budín de esponja durante 1 hora y media o hasta que una brocheta insertada en el centro de la esponja salga limpia. Verificando el nivel del agua hasta la mitad de la cocción.", "Mientras tanto, para las peras con especias, hierva el vino dulce en una cacerola con anís estrellado, clavo de olor, canela, peras, naranjas y zumos de limón. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las peras estén tiernas. Dejar de lado.", "Para la crema pastelera, caliente la leche, la crema y las semillas de vainilla en una cacerola a fuego medio. Llevar a ebullición.", "Batir el azúcar y las yemas de huevo en un tazón hasta que estén pálidas y gruesas. Cuando la leche esté hirviendo, viértala en la mezcla de huevo, batiendo todo el tiempo, hasta que esté bien combinada, luego devuelva toda la mezcla a la sartén y cocine a fuego lento, batiendo ocasionalmente, hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara de madera. Colar la natilla si lo desea.", "Cuando el budín de esponja esté cocido, apague el fuego y deje que se enfríe un poco antes de sacarlo de la sartén. Retire el budín y retire el papel resistente a la grasa. Coloque un plato sobre el pudin y voltéelo, sosteniendo la placa firmemente en su lugar. Deje de lado por 1-2 minutos, luego quite el molde de terrina - el pudín debería simplemente deslizarse.", "Para servir, amontonar las peras en un recipiente con el líquido de cocción y verter la crema en una jarra. Sirva con el budín de esponja en rodajas."], "url": "www_bbc_co_uk_food_recipes_treacle_sponge_pudding_64578", "title": "Treacle budín de esponja con peras con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina blanca llana 225g / 8oz", "150 g / 5oz de mantequilla sin sal, refrigerada, cortada en cubos", "1 yema de huevo de gallinas camperas", "1 cucharada de azúcar en polvo", "2 cucharadas de agua fría (agregue más o menos según sea necesario)", "700 g / 1 libra de jarabe de oro de 8½ oz", "175g / 6oz de pan blanco fresco", "3 limones, solo cáscara", "2 huevos de gallinas camperas, ligeramente golpeados"], "method": ["Para la masa, coloque la harina y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue la yema de huevo, el azúcar y aproximadamente dos cucharadas de agua fría y pulse hasta que se forme una masa firme.", "Retire del procesador y coloque sobre una superficie ligeramente enharinada. Amasar ligeramente, luego envolver en una película adhesiva y transferir a la nevera para enfriar durante 30 minutos.", "Precalentar el horno a 180C / 355F / Gas 4.", "Retire y desenvuelva la masa y extienda la masa sobre una superficie ligeramente enharinada. Alinee una lata de flan con base suelta y estriada de 25cm / 10in. Presiona la masa en los lados y pincha la base con un tenedor. (Guarde cualquier hojaldre de repuesto para la decoración).", "Para el relleno, caliente suavemente el jarabe dorado en una sartén hasta que se derrita y se escurra. Retirar del fuego y mezclar con el pan rallado y la ralladura de limón.", "Agregue los huevos y mezcle bien.", "Vierta la mezcla de melaza en la caja de pastelería. Use cualquier repostería de repuesto para decorar la parte superior con tiras de celosía. Transfiera al horno para hornear durante 45-50 minutos o hasta que el relleno esté ligeramente dorado. Deje que se enfríe un poco antes de retirar del anillo de flan y servir."], "url": "www_bbc_co_uk_food_recipes_treacletart_85741", "title": "Tarta de melaza clásica", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250 g / 9 oz, tamizada, más extra para quitar el polvo", "175g / 6oz de mantequilla, más extra (derretido) para engrasar", "75g / 2¾oz de azúcar glasé", "2 yemas de huevo de gallinas camperas", "1 cucharada de agua fría", "Pan moreno o blanco de 150 g / 5oz de antigüedad, costras eliminadas", "650g / 1lb 7 oz de jarabe de oro", "150g / 5½oz de mantequilla sin sal", "1 huevo de gallinas camperas", "Crema doble 50ml / 2fl oz", "2 limones, solo cáscara", "gran pizca de sal", "Crema cuajada o crema doble, para servir"], "method": ["Para la repostería dulce, en un bol, frote la harina y la mantequilla con las puntas de los dedos, hasta que la mezcla se asemeje a pan rallado.", "Agregue el azúcar glas, las yemas de huevo y el agua fría y mezcle hasta que la mezcla se una como masa.", "Envuelva la masa en una película adhesiva, luego relájese en la nevera durante dos horas, para descansar.", "Engrase una caja agria de 23cm / 9½ pulgadas en un fondo suelto con mantequilla derretida, luego espolvoréelo con harina, eliminando suavemente cualquier exceso.", "Mientras tanto, forre una bandeja para hornear con papel resistente a la grasa y coloque la caja agria preparada en la parte superior.", "Una vez que la masa ha descansado, deseche la película adhesiva y enrolle la masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 4-5 mm.", "Levante la masa enrollada girándola sin apretar alrededor del rodillo, luego bájela en la caja de tarta preparada y presione en la caja de tarta para moldearla a los lados y la parte inferior. Corte cualquier exceso de hojaldre con un cuchillo afilado. Enfríe la caja de tarta en la nevera por otros 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cuando la caja de tarta ha descansado, retírela del refrigerador y pinche la base varias veces con un tenedor.", "Alinee la base y los lados de la caja para tarta con papel resistente a la grasa, luego llénela con alubias para hornear. Transfiera al horno y hornee durante 30-35 minutos, o hasta que estén crujientes y doradas. Deseche el papel resistente a la grasa y los frijoles para hornear.", "Para el relleno, mezcle el pan en un procesador de alimentos hasta que se forme pan rallado. Dejar de lado.", "Caliente el jarabe dorado y la mantequilla en una sartén a fuego medio o bajo, hasta que el almíbar y la mantequilla se hayan derretido. Dejar enfriar un poco.", "En un recipiente aparte, mezcle el huevo y la crema hasta que estén bien combinados. Vierta la mezcla de jarabe y mantequilla y revuelva para combinar.", "Agregue el pan rallado, la ralladura de limón y la sal hasta que estén bien combinados.", "Vierta la mezcla de relleno en la caja de pastelería cocida, luego devuelva la tarta al horno y cocine por otros 40-45 minutos, o hasta que el relleno esté dorado oscuro.", "Retira del horno y deja reposar durante 15 minutos antes de servir para que se enfríe un poco. Sirva caliente, con crema cuajada o crema batida."], "url": "www_bbc_co_uk_food_recipes_treacletart_92048", "title": "Tarta de melaza perfecta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]