[{"ingredients": ["1 cucharadita de cúrcuma molida", "1 cucharadita de semillas de hinojo molido", "1 cucharadita de sal masala", "1 cucharada de semillas de amapola blanca", "sal al gusto", "3 dientes grandes de ajo", "1 cucharada de jengibre fresco pelado y picado", "1 cebolla mediana picada", "2 tomates medianos, picados", "800g / 1lb 12oz hombro de cordero, cortado en cubos pequeños", "3 cucharadas de aceite vegetal", "¾ cucharaditas de semillas de nigella (disponibles en supermercados asiáticos)", "1 cucharadita de semillas de comino", "500ml / 17fl oz de agua", "5-8 chiles verdes, cortos y gordos, cortados por el medio, sin semillas, pero de otro modo se dejan intactos", "2-3 cucharaditas de pasta fresca de tamarindo", "2 puñados de cilantro fresco, hojas y tallos, picados"], "method": ["Para el adobo, coloque todos los ingredientes, excluyendo el cordero, para el adobo en un procesador de alimentos y mezcle hasta que quede suave.", "Transfiera el adobo a un recipiente, agregue el cordero y déjelo marinar durante varias horas, o durante la noche, si es posible.", "Para el curry, caliente dos cucharadas de aceite en una sartén grande, agregue las semillas de nigella y comino y saltee durante unos 30 segundos, o hasta que el comino comience a dorarse.", "Agregue el cordero marinado y cocine a fuego medio, revolviendo con frecuencia, durante aproximadamente 12-14 minutos. Pruebe para asegurarse de que las especias hayan sido cocidas, no debe tener elementos duros.", "Agregar el agua y llevar a ebullición. Luego baje el fuego, cubra y cocine a fuego lento durante 35-40 minutos, o hasta que el cordero esté tierno. Revise la olla con regularidad, revuelva ocasionalmente y agregue más agua si se seca demasiado.", "A la mitad de cocinar el cordero, caliente el aceite restante en una sartén pequeña y fría los chiles por dos minutos, revolviendo con frecuencia. Vierta en el curry.", "Una vez que el cordero esté cocido, destape e incorpore la pasta de tamarindo. Pruebe y ajuste el condimento, agregue un poco de agua extra si es necesario, y agregue el cilantro. Sirve con naan o arroz."], "url": "www_bbc_co_uk_food_recipes_lambwithsquatgreench_86625", "title": "Cordero con chiles verdes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 5½ oz de chuleta de cordero", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "50ml / 2fl oz de vino tinto", "1 cucharada de azúcar moreno", "1 cucharadita de canela", "2 ciruelas, apedreado y en rodajas", "50g / 1¾oz de judías verdes, blanqueadas", "1 cucharadita de perifollo picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para cocinar el cordero, frote la chuleta de cordero con aceite y sazone bien. Coloque una sartén pequeña a prueba de horno a fuego alto, y fría la pizca durante dos minutos en cada lado.", "Asar en el horno durante cinco minutos. Retire y deje reposar por un minuto.", "Para hacer la salsa, vierta el vino tinto en la sartén caliente. Agregue el azúcar, la canela y las ciruelas. Revuelva y cocine por ocho minutos hasta que esté pegajoso.", "Para servir, coloque los frijoles en el centro de un plato caliente, coloque el cordero encima, vierta la salsa pegajosa y espolvoree el perifollo."], "url": "www_bbc_co_uk_food_recipes_lambwithsweetandsour_80042", "title": "Cordero con ciruelas agridulces y judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 hojas de pasta de filo lista para usar", "55 g / 2 oz de mantequilla, derretida", "Queso Lancashire 100 g / 3½ oz, rallado", "12 ciruelas pasas, piedras quitadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corte cada hoja de hojaldre en tres tiras largas y cepille con mantequilla derretida.", "Coloque una cucharada pequeña de queso en un extremo de cada tira y cubra con una ciruela pasa.", "Dobla una esquina de la masa sobre el relleno hacia el lado opuesto para hacer un triángulo. Continúa doblando hasta que todo el pastel esté agotado y cepilla todo con mantequilla. Repita para hacer 12 parcelas.", "Coloque en una bandeja para hornear y hornee en el horno durante 10-12 minutos, o hasta que estén doradas y crujientes.", "Para servir, coloque en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_lancashirecheeseandp_87217", "title": "Paquetes de filo y queso de Lancashire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 filetes de grupa de cordero de 4 x 175 g / 6oz", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "225g / 8oz de trigo bulgar, cocinado según las instrucciones del paquete", "1 pepino, finamente picado", "450g / 1lb de tomates cherry, descuartizados", "6 cebolletas, finamente picadas", "2 cucharadas de perejil picado", "3 limones, solo jugo", "100ml / 3½fl oz de aceite de oliva", "1 chile, finamente picado", "1 diente de ajo, finamente picado", "Yogur de estilo griego, para servir"], "method": ["Frote el cordero con aceite y sazone bien con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté muy caliente, luego agregue el cordero y la plancha durante 4-5 minutos en ambos lados, o hasta que esté cocido a su gusto.", "Para el tabbouleh, coloque todos los ingredientes tabbouleh, excepto el yogur, en un tazón grande y revuelva para combinar.", "Para servir, coloque una porción generosa de tabbouleh en cada plato y coloque un pedazo de cordero a la parrilla en la parte superior.", "Agregue una cucharada de yogurt griego a cada plato y sirva."], "url": "www_bbc_co_uk_food_recipes_lambwithtabbouleh_88992", "title": "Cordero con tabbouleh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5 oz queso Lancashire, rallado", "200g / 7oz de pan rallado fresco", "6 cebollas de primavera, picadas", "30g / 1oz de hojas frescas de tomillo, picadas", "30 g / 1 oz de perejil fresco, picado", "3 huevos de gallinas camperas", "3 yemas de huevo de gallinas camperas", "50ml / 2fl oz de leche, para unir", "2 dientes de ajo, aplastados", "sal y pimienta negra recién molida", "Patatas Maris Piper 400g / 14oz (o similar), peladas, en cubos y hervidas durante diez minutos", "200g / 7oz de mantequilla", "chutney de tomate o ketchup de tomate"], "method": ["Para las salchichas, coloque el queso, el pan rallado, la cebolla, el tomillo, el perejil, los huevos, las yemas de huevo, la leche y el ajo en un tazón grande. Sazonar bien con sal y pimienta negra recién molida, luego mezclar las manos para combinar bien los ingredientes.", "Coloque la mezcla de salchichas en la nevera para enfriar durante 2 a 3 horas, luego retírela y mézclela en forma de salchicha. (Debe obtener aproximadamente 12 salchichas de tamaño normal de esta cantidad de mezcla, dependiendo de qué tan grande le guste su salchicha).", "Caliente el aceite en una sartén honda hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, agregue las salchichas al aceite y fríalos, volteándolo si es necesario, durante 4-5 minutos, o hasta que estén doradas, luego retírelo con una espumadera y escurra sobre papel de cocina. (NB: también puedes freír poco o asar las salchichas).", "Para las papas, derrita la mantequilla en una sartén separada. Agregue las papas y saltee durante 4-5 minutos, o hasta que estén crujientes y doradas.", "Para servir, coloque unas salchichas en cada plato con una cucharada grande de papas salteadas al lado. Agregue una cucharada de chutney de tomate o ketchup."], "url": "www_bbc_co_uk_food_recipes_lancashirecheesesaus_85483", "title": "Salchichas de queso Lancashire", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas rojas grandes, picadas", "3 zanahorias medianas, picadas", "1 nabo, picado", "900g / 2lb del mejor final del cuello de las chuletas de cordero, o pierna de cordero en cubos", "1 hoja de laurel", "sal y pimienta negra recién molida", "8x2.5cm / 1in rodajas gruesas morcilla", "Patatas de 900 g / 2lb, cortadas en rodajas de 5 mm / ¼ in de espesor", "570ml / 1 pinta de caldo de cordero caliente", "55 g / 2 oz de mantequilla, derretida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque las cebollas rojas, las zanahorias y los nabos en una cacerola con tapa de base pesada. Agregue el cordero y la hoja de laurel y sazone con sal y pimienta negra recién molida.", "Cubra el cordero y las verduras con las rebanadas de pudin negro seguido de una capa de rodajas de papa, superponiendo las rodajas para cubrir por completo el cordero, las verduras y la morcilla.", "Agregue el caldo caliente a la cazuela y cepille las papas con mantequilla derretida.", "Cubra la cacerola y colóquela en el horno para cocinar durante aproximadamente dos horas. Después de dos horas, retire la tapa y cocine durante otros 30-45 minutos, hasta que las papas estén crujientes y doradas.", "Lleva la cazuela a la mesa y sirve."], "url": "www_bbc_co_uk_food_recipes_lancashirehotpot_88969", "title": "Estofado de Lancashire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 kg / 2 lb 2 oz cuello de cordero, picado en pedazos de tamaño de bocado", "4 riñones de corderos, limpiados, recortados, cortados en cuartos", "2 cebollas, peladas, en rodajas", "½ cucharadita de sal", "1 cucharada de harina normal", "250ml / 9fl oz de caldo de cordero", "1 ramita de tomillo fresco", "2 hojas frescas de laurel", "1 cucharada de salsa Worcestershire", "50g / 2oz de mantequilla, cortada en cubos, más extra para engrasar", "2 anillos de pudín negro de 250 g / 7 oz, sin cubierta exterior, en rodajas gruesas", "1 kg / 2 lb patatas de 2 oz, peladas y en rodajas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar el aceite de oliva en una sartén y freír las piezas de cordero y los riñones durante 1-2 minutos en ambos lados, o hasta dorar por completo. Retire de la sartén y reserve.", "En la misma sartén, cocine la cebolla y la sal durante 2-3 minutos, o hasta que las cebollas se hayan suavizado. Agregue la harina hasta que las cebollas estén bien cubiertas con la harina.", "Agregue el caldo a la sartén junto con el tomillo, las hojas de laurel y la salsa Worcestershire. Revuelva y hierva a fuego lento durante 8-10 minutos, o hasta que espese un poco.", "Unte con mantequilla una cacerola tapa a prueba de llamas y coloque una capa de papas (aproximadamente un tercio) sobre el fondo del plato y sazone con sal y pimienta negra recién molida. Con una cuchara, coloque en la mitad del cordero dorado y los riñones de cordero, luego ponga más de la mitad de las rodajas de pudín negro y vierta más de la mitad de la mezcla madre espesada. Repita el proceso de estratificación hasta que se hayan usado todas las papas, trozos de cordero y riñones, morcilla y caldo, terminando con una capa de patatas en la parte superior. Ponga las papas con la mantequilla, luego cubra con una tapa.", "Coloque la cacerola en el horno para cocinar durante 20 minutos, luego retire la tapa y cocine por otros 20 minutos, o hasta que las papas estén doradas en la parte superior.", "Para servir, espárzalos en tazones para servir."], "url": "www_bbc_co_uk_food_recipes_lancashirehotpot_92236", "title": "Olla caliente de Lancashire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lancashirehotpot_92236_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 zanahoria grande, cortada en 3 piezas", "1 cebolla, cortada en cuartos", "2 dientes de ajo", "ramita de romero", "tomillo de ramita", "1 hoja de laurel", "pizcar sal de roca", "1 cucharada de puré de tomate", "2 litros / 3½ pintas de agua", "1 cuello medio de cordero con huesos, alrededor de 1kg / 2¼lb", "harina común, para quitar el polvo", "2 cucharadas de aceite de oliva", "1 cebolla española, finamente rebanada", "2 zanahorias, en rodajas finas", "1 diente de ajo, en rodajas finas", "sal y pimienta negra recién molida", "1 cucharada de hojas de tomillo", "1 cucharada de romero picado", "3 patatas Maris Piper, muy finas en rodajas", "mantequilla sin sal", "1 col roja pequeña, sin corazón y en rodajas", "1 cebolla roja, finamente picada", "150g / 5½oz de mantequilla sin sal", "200ml / 7fl oz de vinagre de vino tinto", "50g / 2oz de miel clara", "Azúcar demerara 100 g / 3½ oz", "1 hoja de laurel", "tomillo de ramita", "sal"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Primero haga la acción. Retire la carne del cuello medio del cordero y reserve. Picar los huesos y ponerlos en una bandeja de asar. Asar hasta que esté ligeramente dorado.", "Mientras tanto, cocine la zanahoria, la cebolla y el ajo en un poco de aceite de oliva en una olla grande de fondo grueso hasta que esté ligeramente dorado. Agregue las hierbas y la sal, luego agregue el puré de tomate y cocine por un par de minutos. Agregue los huesos tostados y cubra con el agua. Llevar a ebullición, luego baje a fuego lento y cocine durante una hora, quitando cualquier grasa o espuma con regularidad. Pase el líquido a través de un tamiz fino en una sartén limpia. Regrese al fuego y reduzca hasta que tenga 1 litro / 1¾ pintas de caldo.", "Baje el horno a 150C / 300F / Gas 2.", "Para hacer la olla caliente, corte el cordero en rebanadas gruesas de 2cm / 1. Polvorelos con harina. Caliente el aceite en una sartén y fría rápidamente hasta que quede ligeramente coloreado en ambos lados. Eliminar y reservar.", "En el mismo aceite, freír rápidamente la cebolla, las zanahorias y el ajo hasta que estén ligeramente dorados.", "Coloque el cordero, la cebolla y las zanahorias en una cacerola pesada y llévela a 1 cm / ½ pulgada de la parte superior. Sazone cada capa con sal y pimienta negra recién molida, y las hierbas, cuchareando cantidades generosas de caldo entre cada capa.", "Coloque las papas cuidadosamente en la parte superior del plato. Ponga unas pequeñas perillas de mantequilla sobre las papas, cubra con una tapa hermética y cocine en el horno durante una hora y media. Retire la tapa y cocine por otros 45 minutos.", "Mientras tanto, haz la col roja. Mezcle todos los ingredientes. Poner en una bandeja de asar y cubrir con papel de aluminio. Coloque en el horno y cocine durante aproximadamente 1 ½ horas, revolviendo regularmente, hasta que la mayor parte del líquido se haya evaporado.", "Sirva la olla caliente de la cazuela en platos calientes con el repollo."], "url": "www_bbc_co_uk_food_recipes_lancashirehotpotwith_81803", "title": "Estofado de Lancashire con col roja estofada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "pizca de sal", "2 cucharadas de azúcar en polvo", "½ cucharadita de polvo de hornear", "2 huevos de gallinas camperas", "Leche de 375ml / 13fl oz", "2 cucharadas de mantequilla derretida, más extra para freír", "3 cucharadas de mantequilla", "4 cucharadas de cacao en polvo", "3 cucharadas de azúcar en polvo", "285 ml / ½ de leche pizca", "½ cucharadita de extracto de vainilla", "4 yemas de huevo de gallinas camperas, ligeramente batidas", "225 g / 8oz de avellanas picadas", "250ml / 9fl oz de crema batida", "frambuesas", "azúcar en polvo, al gusto", "2 cucharaditas de brandy de cereza (opcional)", "azúcar glas, para servir"], "method": ["Para hacer la masa de panqueques, mezcle la harina, la sal, el azúcar y el polvo de hornear en un tazón grande.", "Haga un pozo en el centro y agregue los huevos y la leche y mezcle. Agregue la mantequilla derretida y mezcle bien.", "Para el relleno de crema de avellana, coloque la mantequilla, el cacao en polvo y el azúcar en un recipiente colocado sobre una fuente de agua hirviendo y mezcle (no permita que el fondo del recipiente toque el agua).", "Agregue la vainilla y la leche y mezcle bien. Continúe revolviendo sobre el agua caliente durante aproximadamente 15 minutos o hasta que la mezcla se espese.", "Agregue las yemas de huevo batidas y continúe cocinando durante aproximadamente 10 minutos, hasta que la mezcla esté cremosa.", "Agregue las nueces picadas y mezcle. Deja enfriar.", "Batir la crema hasta los picos suaves y doblar en la mezcla de avellanas fría.", "Para el coulis de frambuesa, mezcle las frambuesas con suficiente azúcar para endulzar y el brandy de cereza (opcional). Tamiz para eliminar las pepitas, si quieres.", "Para cocinar los panqueques, caliente una sartén antiadherente pequeña a fuego medio. Agregue un poco de mantequilla derretida y agregue un cucharón de la mezcla de la mezcla. Cocine durante 1-2 minutos hasta que estén dorados, luego dé la vuelta y cocine el otro lado durante aproximadamente un minuto. Coloque en un plato caliente y repita con la masa restante.", "Para servir, coloque una cucharada generosa del relleno de crema de avellana en cada panqueque y enrolle. Vierta sobre el coulis de frambuesa y el polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_langosipancakes_80201", "title": "Langosi (panqueques dulces con crema de avellana)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojaldre de mantequilla de 500g / 1lb 2oz", "600g / 1lb 6 oz de salmón, huesos de piel y alfiler, alrededor de 2.5cm / 1in de espesor", "1 huevo blanco de corral", "Crema doble 50ml / 2fl oz", "20 langostinos, pelados, sin piel, conchas reservadas para la salsa", "125g / 4½oz de hojas de espinaca baby", "2 yemas de huevo de gallinas camperas, batidas", "50g / 2oz de mantequilla", "1 cebolla, más o menos picada", "1 zanahoria, más o menos picada", "½ cabeza de hinojo, más o menos picada", "2 ramitas de tomillo fresco", "¼ cucharadita de Cayena", "2 cucharaditas de puré de tomate", "75ml / 3fl oz de vino blanco", "500ml / 18fl oz de caldo de pescado", "Crema doble 75ml / 3fl oz", "½ limón, solo jugo"], "method": ["Para la tarta, precalentar el horno a 200C / 400F / Gas 6.", "Ruede los pasteles en una superficie de trabajo enharinada a un grosor de 3 mm / ⅛ pulgadas. Recorta un rectángulo de 30cm x 10cm / 12in x 4in y un rectángulo de 37.5cm x 15cm / 15in x 6in.", "Recorte el salmón en un rectángulo de 27.5cm x 7.5cm / 11in x 3in", "Corta aproximadamente los recortes de salmón (aproximadamente 175 g / 6 oz). Mezcle los adornos de salmón y las claras de huevo con un puré en un procesador de alimentos. Agregue la crema, la sal y la pimienta negra recién molida y mezcle hasta que quede suave.", "Coloque la pieza más pequeña de masa en una bandeja de horno y extender sobre el puré de salmón. Cubra con los langostinos y sazone con sal y pimienta negra recién molida.", "Coloque las hojas de espinaca en la parte superior, luego la pieza de salmón. Cubra con la pieza más grande de la masa y ribetee los bordes. Recorte los bordes y cepille con las yemas de huevo batidas. Puntuación de la masa con un cuchillo de mesa.", "Hornee en el horno durante 30-35 minutos, o hasta que la masa esté cocida y dorada. Reserve para descansar durante cinco minutos.", "Mientras tanto, para la salsa, caliente una sartén hasta que esté caliente y agregue la mantequilla, la cebolla, la zanahoria, el hinojo y el tomillo y cocínelos durante 2-3 minutos, o hasta que estén suaves pero no coloreados.", "Agregue las cáscaras de langostinos, la cayena y el puré de tomate y cocine por un minuto más. Agregue el vino blanco y continúe cocinando hasta que el volumen del líquido se reduzca a la mitad.", "Agregue el caldo de pescado, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Mezcle la salsa en una licuadora hasta que quede suave, luego pase a través de un colador en una cacerola. Regrese la salsa a fuego lento, agregue la crema y cocine durante un minuto más. Sazonar, al gusto, con sal, jugo de limón y pimienta negra recién molida.", "Para servir, esculpe la tarta en rodajas y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_langoustine_and_salmon_72078", "title": "Tarta de langostinos y salmón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 langostinos", "24 envolturas de wonton", "1 yema de huevo de gallinas camperas", "2 zanahorias amarillas grandes", "2 zanahorias anaranjadas grandes", "2 zanahorias moradas grandes", "2 zanahorias rojas grandes", "100g / 3½oz de mantequilla sin sal", "2 chalotes de plátano, finamente picados", "1 diente de ajo, finamente picado", "2 ramitas de tomillo fresco", "30g / 1oz de puré de tomate", "50g / 1¾ oz de jengibre fresco, aproximadamente picado", "1 vaina de vainilla, dividida en dos", "1 lima, ralladura solamente"], "method": ["Para los ravioles de langostinos, pele los langostinos, separando las cabezas. Saca la vena de las colas de langostinos y ponla a un lado. Aplastar las cabezas de las langostinos con el lado de un cuchillo pesado y separar las cabezas por separado.", "Para el bizcocho, pele las zanahorias y córtelas con una mandolina; use un pequeño cortador para crear pequeñas bolitas. Guarde todos los adornos de las zanahorias amarillas, anaranjadas y rojas.", "Para los ravioles de langostinos, forma la base de los raviolis utilizando la mitad de las hojas de wonton. Coloque cada una de las colas de langostinos, una por una, en los raviolis planos, luego cepille una pequeña cantidad de yema de huevo en el borde y coloque otra hoja de wonton en la parte superior. Ciérrela suavemente con las puntas de los dedos y corte la masa extra. Dejar de lado.", "Para cocinar el bizcocho, caliente la mantequilla y las cabezas de langostino aplastadas en una sartén hasta que estén ligeramente doradas.", "Agregue los chalotes y los recortes de zanahoria (aún reservando los pellets de zanahoria), el diente de ajo y el tomillo a la sartén. Agregue el puré de tomate y vierta el agua al nivel de los ingredientes.", "Cocine a fuego lento durante 20 minutos y luego cuele el caldo a través de un colador fino en una sartén limpia. Regrese al fuego y cocine hasta que se reduzca a una consistencia de salsa. Agregue el jengibre picado y la vaina de vainilla. Dejar de lado.", "En una olla grande con agua hirviendo, cocine los gránulos de zanahoria durante cinco minutos y luego drene y reserve.", "Cocine los raviolis en una olla grande de agua hirviendo durante unos minutos, y con cuidado quítelos con una cuchara ranurada o una rebanada de pescado una vez que estén cocidos.", "Para servir, coloque tres raviolis en un bol y luego agregue los gránulos de zanahoria cocida. Cuele la sopa y vierta sobre la parte superior. Termine con una pizca de ralladura de limón."], "url": "www_bbc_co_uk_food_recipes_langoustine_ravioli_57736", "title": "Ravioles de langostinos, zanahorias de la herencia y sopa de jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "28 langostinos, sin cáscara y desvenados", "Harina de auto crianza 110g / 4oz", "Harina de maíz 110 g / 4 oz", "275ml / 9floz agua tónica", "2 cucharadas de vodka", "2 huevos de gallinas camperas, solo yemas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10 fl oz aceite de colza", "1 limón, solo jugo", "sal marina, al gusto"], "method": ["Para las gambas, caliente una freidora a 190C / 375F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras tanto, mezcle la harina y la harina de maíz en un bol hasta que estén bien combinados.", "Vierta el agua tónica en las harinas y bata en el vodka hasta que la mezcla tenga la consistencia de la crema doble.", "Cubra las langostinos en la mezcla y freír en el aceite durante 3-4 minutos, o hasta que estén doradas y crujientes.", "Retire las gambas con una espumadera y escurra sobre papel de cocina.", "Para la mayonesa, coloque los huevos, el vinagre de vino blanco y la mostaza en un procesador de alimentos y mezcle hasta que estén pálidos y cremosos.", "Con el motor en marcha, vierta el aceite, en un flujo lento y constante, hasta que la mayonesa esté espesa (es posible que no necesite todo el aceite). Mezcle el jugo de limón.", "Para servir, apile las gambas en un tazón para servir y sirva la mayonesa de limón al lado. Termine con una pizca de sal marina y un chorrito de jugo de limón."], "url": "www_bbc_co_uk_food_recipes_langoustine_scampi_with_94412", "title": "Langosta de langostinos con mayonesa de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 langostas enteras cocidas", "Harina de pasta 150 g / 5½ oz '00', más extra para quitar el polvo", "50 g / 1¾oz de sémola, más extra para quitar el polvo", "2 huevos de gallinas camperas", "50g / 1¾oz de mantequilla", "1 chalote de plátano, finamente cortado", "½ bulbo de hinojo, afeitado", "cáscaras de langosta (desde arriba)", "1 estrella de anís", "150ml / 5fl oz de vino blanco", "150ml / 5fl oz de caldo de pescado", "150ml / 5fl oz de crema doble", "1 tomate de ciruela, sin piel, sin semillas, picado", "1 cucharada de estragón picado", "1 cucharada de cebollines finamente picados", "50 g / 1¾oz de mantequilla sin sal", "1 cucharadita de aceite de oliva", "1 calabacín amarillo, en forma de bolas con una bailarina de melón", "1 calabacín verde, en forma de bolas con una bailarina de melón", "1 cucharada de berros picados", "sal y pimienta negra recién molida"], "method": ["Retire la carne de la langosta, manteniendo la carne de la garra en una sola pieza, y corte la cola. Guarde las conchas para la salsa.", "Para la pasta, mezcle la harina y la sémola juntas en una superficie de trabajo limpia o en un tazón grande. Haz un pozo en el centro y rompe los huevos. Con un tenedor o con las manos, mezcle gradualmente la harina con los huevos para formar una masa suave. Amasar la masa durante 5 minutos, o hasta que quede suave.", "Forme la masa en forma de bola, envuélvala en una película adhesiva y déjela reposar en la nevera durante al menos 30 minutos.", "Para la salsa, caliente una sartén a fuego medio. Agregue la mantequilla, el chalote, el hinojo, las cáscaras de langosta y el anís estrellado y fría por un par de minutos, o hasta que estén suaves pero no dorados.", "Agregue el vino y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue el caldo de pescado y cocine hasta que se reduzca a la mitad nuevamente. Agregue la crema y cocine hasta que se reduzca en un tercio.", "Cuele la salsa a través de un colador, mezcle el tomate y las hierbas. Pruebe y sazone con sal y pimienta negra recién molida.", "Una vez que la pasta ha descansado, divídala en 4 pedazos iguales. Puede extenderlos a mano con un rodillo o utilizar una máquina de pasta.", "Para rodar a mano, espolvoree la sémola y use un rodillo para extender cada pieza, trabaje despacio y espolvoree la pasta con sémola a medida que avanza para evitar que se rompa.", "Alternativamente, empolva una máquina de pasta con sémola y comienza con la configuración más baja (más gruesa), pasa una pieza de la masa por la máquina, gira la manija con una mano y sujeta la masa con la otra a través de la máquina. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez. La pasta debe ser bastante delgada, pero aún así fácil de manejar sin romperse. No tengas la tentación de saltear las configuraciones o la masa puede romperse. Repita con las otras piezas de masa.", "Una vez que las hojas de pasta han alcanzado el grosor ideal, reservar y polvo con sémola.", "Para hacer los tortellini, use un cortador circular para hacer círculos de pasta de 9cm / 4in de diámetro. Coloque una porción de la carne de la cola en cada círculo. Cepille un poco de agua en el borde de la pasta y doble sobre la parte superior para hacer un semicírculo. Presione hacia abajo ligeramente para sellar. Envuelva las esquinas del semicírculo alrededor de su dedo índice y únase para formar un tortellini. Necesitas 6 tortellini por persona.", "Para la guarnición, caliente una sartén grande y una vez caliente agregue la mantequilla y el aceite. Agregue las bolas de calabacín y cocine durante unos minutos, o hasta que los calabacines tengan un poco de color.", "Para cocinar la pasta, ponga a hervir una cacerola grande de agua con sal. Agregue la pasta y cocine a fuego lento durante 3-5 minutos hasta que esté cocido, luego drene inmediatamente.", "Para servir, coloca 6 de los tortellini en el centro de cada tazón para servir y pon una cuchara sobre la salsa. Adorne con la carne de garra de langosta, las bolas de calabacín y el berro."], "url": "www_bbc_co_uk_food_recipes_langoustine_tortellini_98795", "title": "Tortellini de langosta con salsa de hinojo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 langostinos enteros", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 chalote de plátano, finamente picado", "3 dientes de ajo picados", "4 langostinos, cabezas y cáscaras solamente", "1 cucharada de puré de tomate", "10 granos de pimienta", "5 tallos frescos de perejil", "½ limón, solo ralladura", "50ml / 2fl oz de vino blanco", "Crema doble 50ml / 2fl oz", "Linguine 250g / 9oz, cocido según las instrucciones del paquete"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las langostinos cocidos al horno, coloque las langostinos en un pedazo grande de papel de aluminio en una bandeja para hornear. Rocíe con aceite, exprima el jugo de limón y envuelva la lámina para sellar completamente. Transfiera al horno y hornee por 10-15 minutos, o hasta que esté completamente cocido.", "Para el linguini, caliente el aceite en una sartén, agregue la chalota y el ajo y fría hasta que estén suaves. Agregue las cáscaras y las cabezas de langostinos y el puré de tomate y cocínelos durante 1-2 minutos.", "Agregue los granos de pimienta, los tallos de perejil, la ralladura de limón y el vino blanco, lleve a ebullición y reduzca el vino a la mitad de su volumen.", "Agregue 150ml / 4½fl oz de agua hirviendo y cocine para reducir el líquido de nuevo a la mitad, luego pase a través de un colador en una sartén grande.", "Agregue la crema doble, lleve a ebullición, luego reduzca hasta que la salsa se espese y sazone, al gusto, con sal y pimienta negra recién molida.", "Agregue el linguini y mezcle hasta que esté bien mezclado con la salsa.", "Para servir, coloque el linguini en un tazón grande con las langostinos al horno dispuestos en la parte superior."], "url": "www_bbc_co_uk_food_recipes_langoustinelinguini_84268", "title": "Langoustine linguine", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["18 patatas Royal Jersey", "3 cucharadas de aceite de colza prensado en frío", "12 lanzas de espárragos, extremos leñosos eliminados", "100 g / 3½ oz de miel no pasteurizada", "1 limón, solo jugo", "200 g / 7 oz de raíz de jengibre fresco, finamente rallado, jugo exprimido y reservado", "24 langostinos, pelados y desvelados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Hierva los Jersey Royals durante 10-15 minutos, o hasta que estén tiernos, luego enfríelos en agua fría y déjelos a un lado.", "Para hacer seis parcelas, coloque papel de cocina sobre papel impermeable y recorte seis rectángulos de 30x40 cm / 12x16 pulgadas. Dobla cada rectángulo por la mitad y córtalo en la mitad de una forma de corazón, luego despliega en un corazón.", "Coloque los corazones con papel de aluminio hacia arriba y cepille cada uno con un poco de aceite de colza, luego coloque tres Jersey Royals en el centro de cada trozo de papel de aluminio y aplaste ligeramente con un tenedor. Coloque dos lanzas de espárragos encima de cada una, sazone con sal y pimienta y rocíe con un poco más de aceite de colza.", "Coloque la miel en una cacerola pequeña a fuego lento para calentarla. Agregue los jugos de limón y jengibre y sazone con sal y pimienta. Coloque seis langostinos en la parte superior de cada paquete y rocíe con la mezcla de jugo de miel, limón y jengibre.", "Selle las bolsas y hornee durante 7 minutos. Coloque cada paquete en el centro de un plato, ábralo y sirva."], "url": "www_bbc_co_uk_food_recipes_langoustines_en_61611", "title": "Langostinos en papillote con miel cruda, jengibre y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de mantequilla", "1 chalote, finamente picado", "2 dientes de ajo, finamente picados", "1 cucharada de puré de tomate", "1 zanahoria, picada", "500g / 1lb 2 oz de cáscaras de langostino", "2 cucharadas de aguardiente", "250ml / 9fl oz de pescado o caldo de pollo", "100ml / 3½ fl oz crema doble", "sal y pimienta negra", "picatostes, para servir", "1 cebolla tierna, finamente picada"], "method": ["Caliente la mantequilla en una sartén y fríe con cuidado la chalota y el ajo hasta que la chalota sea translúcida. Agregue el puré de tomate y cocine por otros dos minutos, luego agregue la zanahoria, cáscaras de langostinos, brandy, caldo y crema. Cocine por 3-4 minutos.", "Coloque la mezcla en una licuadora resistente y pulse durante dos minutos hasta que quede suave. Pasar a través de un tamiz fino en una sartén limpia. Sazonar, al gusto, con sal y pimienta.", "Servir en tazones cubiertos con crutones y cebolleta."], "url": "www_bbc_co_uk_food_recipes_langoustine_soup_59528", "title": "Sopa de langostinos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "75g / 2½ oz de mantequilla", "1 zanahoria, en rodajas finas", "6 langostinos cocidos, pelados, sin piel, cabezas y colas separadas", "1 cilantro de racimo pequeño, tallos y hojas separados", "30 g / 1 oz de champiñones shimeji, cabezas y tallos separados", "6 cm / 2½ en jengibre fresco de raíz, cortado en fósforos", "30 g / 1 oz de habas, envasadas", "30g / 1oz de guisante pequeño", "1 yema de huevo de gallinas camperas, ligeramente batida", "Envoltorios de 6 wonton, disponibles en grandes supermercados o tiendas especializadas", "4 cebollas de primavera, tapas removidas y cortadas en diagonal", "1 limón, ralladura solamente", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite y la mantequilla a 50g / 1¾oz en una cacerola y agregue las zanahorias para que se vuelvan caramelizadas. Aplastar las cabezas de langostinos y agregar a la sartén con cilantro y tallos de champiñones. Vierta 100 ml / 3½ fl oz de agua y cocine a fuego lento.", "Agregue la mayor parte del jengibre al caldo, reservar un poco para la guarnición, y cocine a fuego lento durante 2 minutos. Colar en una sartén limpia, volver al fuego y cocinar a fuego lento hasta que el volumen del líquido se reduzca a la mitad. Sazonar bien con sal y pimienta.", "Caliente la mantequilla restante en una sartén colocada a fuego medio. Agregue las cabezas de champiñones, habas y petit pois. Cocine suavemente por 3 minutos y reserve.", "Usando una brocha de pastelería, cepille ligeramente las envolturas de wonton con el huevo. Coloque una cola de langostinos en cada envoltura y espolvoree con las hojas de cilantro. Doble por la mitad y presione los bordes juntos firmemente.", "Coloque 100ml / 3½fl oz de agua en una sartén grande y profunda y deje que hierva. Deslice los ravioles, asegurándose de que haya suficiente agua para cubrirlos, y cocine a fuego lento durante 2 minutos. Eliminar con una cuchara ranurada.", "Para servir, divida los raviolis entre dos tazones poco profundos, vierta sobre el caldo y cubra con los vegetales. Espolvorear con las cebolletas, la ralladura de limón y el jengibre restante."], "url": "www_bbc_co_uk_food_recipes_langoustine_ravioli_53163", "title": "Ravioles de langostinos, champiñones shimeji y caldo de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de vermut seco", "pellizcar hilos de azafrán", "½ naranja, ralladura y jugo", "½ limón, solo ralladura", "100g / 4oz de mantequilla, suavizada", "4 dientes de ajo, aplastados", "50g / 2oz de cebollín fresco, finamente picado", "½ cucharadita de zumaque triturado o molido", "1 cucharadita de semillas de comino, finamente molidas", "sal y pimienta negra recién molida", "300g / 11oz colinabo, pelado y picado", "2 cucharadas de pasta tahini", "3 dientes de ajo, aplastados", "3 cucharadas de semillas de comino, finamente molidas", "1 limón, solo jugo", "4-6 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "20 langostinos grandes, cabezas y caparazones eliminados, sin espinas", "hojas de ensalada verde, para servir"], "method": ["Para la mantequilla, vierta el vermut en un tazón grande y agregue los hilos de azafrán. Déjelo a un lado durante 2-3 minutos, luego agregue la ralladura de naranja, el jugo de naranja y la ralladura de limón.", "Agregue la mantequilla, ajo, cebollín, zumaque y comino y bata hasta que se combinen. Sazonar, al gusto, con sal y pimienta negra recién molida y batir nuevamente.", "Extienda una lámina de película adhesiva sobre una superficie de trabajo plana. Coloque la mezcla de mantequilla con sabor en la película adhesiva, luego use la película adhesiva para darle forma y enrolle la mantequilla en forma de salchicha. Enrolle la película adhesiva alrededor de la mantequilla y selle los extremos con fuerza. Enfríe en la nevera durante dos horas, o hasta que esté firme.", "Cuando la mantequilla con sabor se haya enfriado durante 1 hora y media, prepare el puré. Ponga a hervir el colinabo en una sartén con agua con sal, luego reduzca el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que el garrote esté tierno. Escurrir bien.", "Mezcle el solomillo drenado en un procesador de alimentos hasta que quede suave, luego transfiera el colinabo en un tazón grande. Agregue el tahini, el ajo, el comino, el jugo de limón y el aceite de oliva, y sazone al gusto con sal y pimienta negra recién molida.", "Para las langostinos, caliente el aceite de oliva en una sartén de base pesada a fuego medio a alto. Agregue los langostinos, en tandas si es necesario, y freír durante 1-2 minutos, revolviendo todo el tiempo, hasta que estén rosados ​​y cocidos. Retire de la sartén y reserve.", "Agregue 75 g / 3 oz de la mantequilla enfriada de naranja y azafrán a la sartén, luego retire la sartén del fuego y déjela a un lado hasta que la mantequilla se haya derretido.", "Para servir, apile los langostinos en un plato de servir. Rocíe sobre la mantequilla derretida de naranja y azafrán. Cortar la mantequilla restante enfriada y colocar las rodajas en la parte superior de las langostinos. Vierta el puré de colinabo en un tazón grande y amontone las hojas de ensalada en un plato grande. Permita que los invitados se ayuden a sí mismos."], "url": "www_bbc_co_uk_food_recipes_langoustines_with_21304", "title": "Langostinos con mantequilla de naranja y azafrán y puré de tahini de colinabo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["16 langostinos limpios de cola (o gambas grandes)", "20g / ¾oz de jengibre, cortado en trozos, sin pelar", "45g / 1½ oz de hierba de limón, cortada en pedazos", "20g / ¾oz galangal, cortado en pedazos", "20g / ¾oz chalotes, en rodajas", "20g / ¾oz de ajo, clavos enteros", "2 chiles rojos de ojos de pájaro", "1 cucharada de pasta de curry rojo", "20 g / ¾oz de hojas de lima", "20 g / ¾oz hojas y tallos de cilantro", "1 cucharada de aceite de colza", "2 cucharaditas de pimienta negra, tostadas y molidas", "2 cucharaditas de semillas de comino, tostadas y molidas", "2 cucharaditas de semillas de cilantro, tostadas y molidas", "2 cucharaditas de pimentón dulce, tostado y molido", "600ml / 21fl oz de leche de coco", "140ml / 5fl oz de jugo de limón", "55ml / 2fl oz de salsa de pescado", "50g / 1¾oz de azúcar (al gusto)", "35g / 1oz de hojas de albahaca tailandesa", "20g / ¾oz kaffir hojas de lima", "4 berenjenas grandes", "2 cucharadas de aceite de colza", "30 g de mantequilla", "1 chili jalapeño, sin semillas y muy finamente picado", "45g / 1¾oz de ajo, picado", "45g / 1¾oz de jengibre, picado", "45 g / 1¾oz de cebolla picada muy fina", "Tomates 100g / 3½ oz, pelados, sin semillas y cortados en cubitos", "10g de comino, tostado y molido", "10g de semillas de cilantro, tostadas y molidas", "sal y pimienta negra recién molida", "azúcar al gusto", "45g / 1¾oz de cilantro fresco, cortado en tiras finas (gasa)", "cebollas de primavera, en rodajas", "hojas de cilantro", "brotes de guisantes"], "method": ["Para la salsa de curry rojo tailandés, ponga el jengibre, la hierba de limón, galanga, chalotes, ajo, chiles, pasta de curry rojo, hojas de lima y hojas de cilantro y tallos en un procesador de alimentos. Pulse en una pasta áspera.", "Cocine la pasta en una cacerola a fuego medio con aceite de colza durante 2-3 minutos, teniendo cuidado de no quemarla. Cuando esté fragante, agregue las especias tostadas y molidas y cocine hasta que liberen su aroma. Agregue la leche de coco, el jugo de lima, la salsa de pescado y la mitad del azúcar.", "Cocine a fuego lento durante unos minutos, luego pruebe. Agregue más azúcar si es necesario. Agregue albahaca tailandesa y hojas de lima kaffir. Quítese el fuego y déjelo reposar por 20 minutos, luego cuele la salsa y reserve.", "Para la berenjena, precaliente el horno a 220C / 200C Fan / Gas 7.", "Con un tenedor, pique la berenjena varias veces. Frote con aceite de colza y tueste en el horno hasta que esté completamente tierno (unos 15-20 minutos). Retire la pulpa de la piel carbonizada y corte aproximadamente.", "En una sartén mediana a fuego lento, agregue la mantequilla y un poco de aceite de colza. Una vez caliente agregue el jalapeño, el ajo, el jengibre y la cebolla. Cocine a fuego lento hasta que esté aromático. Agregue la pulpa de berenjena. Agregue el comino, el cilantro, la sal, la pimienta y el azúcar. Ajuste los condimentos al gusto. Cocine a fuego lento durante 5 minutos y agregue los tomates. Continúe cocinando a fuego muy lento, por 25 minutos, revolviendo ocasionalmente. Retirar del fuego y dejar de lado. Cuando esté frío, agrega el cilantro.", "Para la langostinos, caliente un poco de aceite en una sartén y cocine por 1-2 minutos hasta que esté listo.", "Para servir, vierta la berenjena en el plato y cubra con la langostinos. Cuchara sobre la salsa de curry rojo y adornar con brotes de guisantes, cebolletas y hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_langoustines_with_56864", "title": "Langostinos con berenjena carbonizada y curry tailandés rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 langostinos enteros, conchas encendidas, partidos a la mitad por el medio", "2 dientes de ajo, aplastados", "75g / 3oz de mantequilla sin sal ablandada", "copos de sal y pimienta negra recién molida, al gusto", "1 cucharada de aceite de oliva", "1kg / 2lb 3 oz de langostinos, cabezas y cáscaras eliminado, sin espinas", "2 cucharadas de crema fresca", "2 cucharaditas de whisky de malta", "1 cucharada de perejil fresco picado", "500g / 1lb 2oz de papas cerosas, como Charlotte o Maris Peer, hervidas en sus pieles durante cinco minutos", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "1 cucharada de eneldo finamente picado", "½ limón, ralladura solamente, más 1 cucharadita de jugo de limón fresco", "3 cucharadas de aceite de oliva", "mantequilla, para freír", "1 naranja, solo jugo", "2 cucharadas de jugo de limón", "2 cucharadas de vinagre de vino blanco", "1 diente de ajo, aplastado", "pizca de mostaza inglesa en polvo", "1 cucharadita de azúcar morena suave, o más al gusto", "sal y pimienta negra recién molida", "3-4 canastillas de micro hojas de ensalada", "3-4 cucharadas de aceite de colza, más extra por servir"], "method": ["Precalentar la parrilla a alto.", "Coloque las langostinos enteros partidos, con el lado cortado hacia arriba, en una sartén para parrilla.", "Mezcle el ajo picado y 50 g / 2 oz de la mantequilla ablandada. Extienda la mezcla uniformemente sobre la carne de langostinos y condimente, al gusto, con sal y pimienta negra recién molida. Coloque debajo de la parrilla precalentada y cocine hasta que las langostinas estén recién cocidas (la pulpa será opaca).", "Caliente la mantequilla sin sal restante de 25 g / 1 oz y el aceite de oliva en una sartén grande. Agregue las langostinos sin cascara y cocine durante 4-5 minutos.", "Agregue el whisky a la sartén, luego cuidadosamente enciéndalo con un fósforo. (NB: Mantenga las manos y la ropa alejadas de la llama.) Encienda durante aproximadamente un minuto, luego deje que las llamas se apaguen.", "Agregue la crème fraîche y el perejil a la sartén y mezcle bien. Pruebe y sazone con sal o pimienta negra recién molida, si es necesario. Mantenga caliente hasta que esté listo para servir.", "Para las tortas de papa, pele y ralle las papas sancochadas. Coloque las papas ralladas en un tazón grande.", "Agregue el huevo, la sal y la pimienta negra recién molida, al gusto, eneldo, ralladura de limón y jugo de limón y una cucharada de aceite de oliva. Divida la mezcla en cuatro porciones iguales y forme tortas.", "Caliente el aceite de oliva restante y una pequeña porción de mantequilla en una sartén a fuego medio. Agregue las tortas de papa a la sartén y cocínelas durante 4-5 minutos, o hasta que las bases estén doradas. Con cuidado voltee y cocine en el otro lado hasta que se dore. Mantenga caliente hasta que esté listo para servir.", "Para el aderezo de ensalada, mezcle bien el jugo de naranja, el jugo de limón, el vinagre, el ajo, la mostaza en polvo y el azúcar en un recipiente con tapa de rosca hasta que estén bien combinados. Pruebe y sazone con sal y pimienta negra recién molida según sea necesario.", "Coloque las hojas de ensalada en un tazón grande y revise primero las hojas con aceite de colza, luego agregue el aderezo y mezcle para cubrir las hojas (es posible que no necesite agregar todo el aderezo).", "Para servir, coloque una torta de eneldo en el centro de cada uno de los cuatro platos calentados. Coloque una cucharada de la langostinos salteados en la parte superior y una cuchara sobre la salsa de whisky. Coloque dos langostinos asados ​​a un lado, amontone la ensalada y rocíe aceite de colza adicional alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_langoustinesflamedin_92112", "title": "Langoustines flameados en salsa de whisky con eneldo y tortas de limón y ensalada con aderezo de cítricos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]