[{"isVegetarian": false, "title": "Chargrilled rump steak with roast beetroot, smoked garlic crushed potatoes", "url": "www_bbc_co_uk_food_recipes_chargrilled_rump_steak_15191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large raw beetroot", "olive oil", "salt and pepper", "4 tbsp balsamic vinegar", "150ml/5fl oz Cabernet Sauvignon wine ", "1 tbsp sugar", "25g/1oz butter ", "500g/1lb 2oz large waxy potatoes", "1 bulb smoked garlic ", "melted butter, to cover", "salt and pepper", "100ml/3½fl oz double cream", "50ml/2fl oz crème fraîche", "½ tsp English mustard", "2 tsp freshly grated horseradish root", "1-2 tbsp lemon juice", "salt and white pepper, to taste", "200g/7oz runner beans, finely sliced", "25g/1oz butter", "salt and pepper", "4 x 200g/7oz beef rump steaks", "salt and pepper", "olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "For the beetroot, top, tail and wash the beetroot. Rub with oil, season with salt and pepper, to taste, wrap it in foil and bake until tender – this will take about two and a half hours. Leave to cool and then push the skin off with your fingers (use rubber gloves if you don’t want purple hands). Cut into wedges and set aside. ", "Put the balsamic vinegar, wine and sugar into a pan. Boil until the volume of liquid has reduced by half. Add the beetroot, season with salt, pepper and the butter, and keep warm.", "For the potatoes, peel the potatoes and boil them in a pan of boiling salted water until tender. Drain well. ", "Put the smoked garlic bulb in a saucepan and cover with melted butter. Cook over a low heat for 45 minutes and then allow to cool. Peel the cloves and place back into the butter and then blend until smooth using a hand-blender. ", "Crush the potatoes lightly with a folk. Mix in the garlic butter purée and season with salt and pepper, taking care not to turn the potatoes into mash.", "For the horseradish cream, lightly whip the double cream in a mixing bowl and then stir in the crème fraîche, English mustard, fresh horseradish and lemon juice. Mix well and season to taste with salt and pepper. Set aside.", "For the beans, blanch the beans in a pan of boiling salted water for two minutes, then drain and refresh in a bowl of ice cold water. Drain again.  ", "Heat the butter in a frying pan and add the beans. Season with salt and pepper and fry for one minute to warm through. Set aside.", "For the steak, preheat a griddle to hot. Season the steak generously with salt and pepper, drizzle with a little olive oil and then place on the hot griddle. Cook for about two minutes on each side for rare, 3½ for medium and then allow to rest for a minute before serving.", "To serve, place a scoop of potato on each plate along with the steak, surround with 3-4 wedges of beetroot and a little syrup, some beans and a neat spoonful of the horseradish cream."]}, {"isVegetarian": false, "title": "Chargrilled sea bass summer rolls with pineapple dipping sauce", "url": "www_bbc_co_uk_food_recipes_chargrilled_seabass_62243", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_seabass_62243_16x9.jpg", "ingredients": ["1 garlic clove, peeled and chopped", "1 red bird's-eye chilli, finely chopped", "50g/2oz fresh ginger, peeled, roughly chopped", "2-4 sprigs fresh dill, chopped", "1 tbsp sugar", "4 tbsp lemon juice", "2 tbsp fish sauce", "1-2 stalks lemongrass, lightly crushed", "1 whole seabass, de-scaled, cleaned", "10 rice spring roll wrappers", "100g/3oz rice vermicelli, cooked according to the packet instructions", "200g/6oz carrots, shredded", "½ pineapple, peel and core removed, cut into thin matchsticks", "1 cucumber, seeds removed, cut into thin matchsticks", "1 courgette, cut into thin matchsticks", "1 bunch fresh dill, torn into small sprigs", "250g/8oz fresh pineapple, crushed or blended to a rough purée", "2 tbsp fish sauce", "1 tbsp lemon juice", "1 red bird's-eye chilli, finely chopped"], "serves": "Makes 10 rolls", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Light a charcoal barbecue, or preheat a grill to high. ", "For the marinade, combine the garlic, chilli, ginger, dill, sugar and lemon juice with four tablespoons of water. Add the fish sauce, to taste. ", "Make three slits through the skin of the fish on either side. Pour a few teaspoons of marinade inside the fish and tuck in the lemongrass stalks, then rub the remainder of the marinade all over the skin. Allow to marinate for 20-30 minutes. ", "Grill the fish over medium-hot coals or under a hot grill for ten minutes either side, or until thoroughly cooked. Set aside to cool.", "For the dipping sauce, combine the pineapple, fish sauce, lemon juice and four tablespoons water. Add chilli to taste. Set aside.", "For the summer rolls, lay the rice paper sheet on a chopping board. Put a bowl of cold water next to it and with wet fingers, pat the rice paper sheet wet until pliable. They should be moist  but not too wet as they will tear. ", "Place a pinch of cooked noodles on the centre of the rice paper. Cut about a tablespoon of flesh from the seabass, removing any bones with your fingers, and place onto the rice paper with the noodles. ", "Fold the rice paper over once. Place a pinch of shredded carrot next to the fish and noodle parcel. Then add one or two pieces of cucumber, courgette, pineapple, and dill. Fold the sides of the rice paper in and roll up the fish and vegetables. Repeat until all the spring roll wrappers are used up.", "Serve with the dipping sauce. "]}, {"isVegetarian": false, "title": "Chargrilled smoked salmon with herbed scrambled eggs and lemon purée", "url": "www_bbc_co_uk_food_recipes_chargrilled_smoked_97760", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["caster sugar, measured to the 850ml/1½ pint mark in a measuring jug", "3 unwaxed lemons ", "9 free-range eggs", "150g/5oz butter, cut into small pieces", "3 tbsp snipped chives", "2 tbsp chopped parsley ", "1 tbsp chopped tarragon", "1 tbsp chopped mint ", "salt and freshly ground black pepper", "450g/1lb smoked salmon, cut into 1-2cm/½-¾in thick steaks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon purée, put the sugar and 850ml/1½ pint water into a saucepan.  ", "Over a low heat, allow the sugar to dissolve and then bring it up to a light simmer for 10 minutes. Remove from the heat and leave to cool. This stock syrup will keep in the fridge for up to a week.", "Prick the lemons fairly deeply all over and place into a saucepan with sufficient cold water to cover. Bring to the boil, remove from the heat and allow the lemons to cool in the water. Repeat this twice more using fresh water each time.", "Place the lemons into the saucepan again and cover with a third of the stock syrup. Bring to the boil, remove from the heat and allow the lemons to cool in the stock syrup.", "Repeat this twice more using fresh stock syrup each time. ", "Place the lemons together with a few tablespoons of the stock syrup (retain the remaining stock syrup) and blend in a blender until smooth.", "Pass through a sieve, taste and add a little more of the retained stock syrup if necessary, store in a squeezy bottle in the fridge. ", "For the herbed scrambled eggs, break the eggs into a large bowl, beat them well and then push them through a sieve into a heavy based, non-stick saucepan. Add the pieces of butter and set aside.", "Place the chives, parsley, tarragon and mint in a bowl.", "About 20 minutes before serving, heat the eggs on the lowest possible heat, stirring continuously. ", "Once the butter has melted, the eggs will start to cook: watch them carefully as they need to be fairly runny when served and will continue to cook after you have taken them off the heat. ", "Just before serving, add the herbs and salt and pepper, to taste.", "For the salmon, heat a heavy-based ridged frying pan until it is nearly smoking. ", "Place the salmon steaks across the ridges of the pan and press down for no longer than 30 seconds. ", "Turn the steaks over and repeat on the other side.", "To serve, place the salmon onto each plate, pile the eggs alongside with a squeeze of lemon purée."]}, {"isVegetarian": false, "title": "Chargrilled squid with creamy ponzu dressing", "url": "www_bbc_co_uk_food_recipes_chargrilled_squid_with_93505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x squid (about 250g/9oz each), cleaned and cut into triangles", "salt and freshly ground black pepper", "extra virgin olive oil", "1 lime, juice only", "2 free-range eggs, yolks only", "½ tsp sea salt", "pinch white pepper", "2 tsp rice wine vinegar", "4 tsp chilli garlic sauce", "2 tsp yuzu juice", "200ml/7floz vegetable oil", "3 tbsp coriander cress", "2 tbsp celery cress", "2 tbsp mint leaves, picked", "1 handful watercress, leaves picked"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the squid, heat a griddle pan until searing hot.", "Season the squid with salt and black pepper and a drizzle of oil.", "Place onto the griddle and cook on each side for 30 seconds until charred and just cooked through.", "Remove and squeeze the lime over the top.", "For the creamy ponzu dressing, place all the ingredients, except the vegetable oil into a small food processor and blend to a purée.", "Gradually add in the vegetable oil until a thin mayonnaise forms.", "Check the seasoning and add more yuzu juice if desired.", "To serve, scatter the cress and leaves over each plate, then place a squid on top and drizzle with the creamy ponzu dressing."]}, {"isVegetarian": false, "title": "Chargrilled T-bone steak with tomato chilli chutney", "url": "www_bbc_co_uk_food_recipes_chargrilled_t-bone_steak_64791", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_t-bone_steak_64791_16x9.jpg", "ingredients": ["275ml/9½fl oz malt vinegar", "225g/8oz soft brown sugar", "1.5kg/3lb 5oz ripe red tomatoes, very roughly chopped", "200g/7oz onions, roughly chopped", "4 red chillies, chopped", "2 garlic cloves, finely chopped", "1 tbsp finely chopped root ginger", "1 tsp ground coriander", "sea salt and freshly ground black pepper", "4 T-bone steaks, at room temperature", "2 tbsp olive oil", "salt and freshly ground black pepper", "4 banana shallots, skin on, cut in half lengthways", "4 fresh figs, cut in half lengthways", "1 round lettuce, separated into leaves", "1 tbsp balsamic vinegar", "½ lemon, juice only", "3 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, place the vinegar and sugar in a large saucepan and bring to the boil then cook for 3-4 minutes until the sugar has melted.", "Add all the other ingredients, bring to the boil and cook for about 20-30 minutes, stirring frequently. If the tomatoes are very juicy, you might need to cook for a little longer until the mixture starts to thicken.", "Leave the chutney with a chunky texture and don’t cook too long so that the ingredients start to break down into a purée. ", "Cool the chutney before serving with the steak, and place into sterilised jars to store for two to three weeks in the fridge, the flavour will improve over time.", "For the steak, heat a griddle pan until searing hot.", "Rub the steaks with a little olive oil then season with salt and black pepper.", "Place onto the griddle and sear for two minutes then turn the steaks 90 degrees and sear the same side for a further two minutes.", "Turn the steaks over and repeat, searing and turning.", "Remove the steaks from the griddle and set them aside, to rest, on a plate.", "Meanwhile, rub the shallots with the rest of the olive oil and place cut side down onto the griddle and cook for 3-4 minutes. Then add the figs, face down, and cook for another minute until they are all tender and charred.", "Whisk the balsamic vinegar, lemon juice and extra virgin olive oil together then season with salt and freshly ground black pepper.", "At the very last minute, toss the lettuce, shallots and figs together in a bowl with the dressing. ", "To serve, for each person, place a steak onto a board, pile the salad alongside with a spoonful of chutney."]}, {"isVegetarian": false, "title": "Chargrilled apple, bacon and croûton salad with grain mustard vinaigrette", "url": "www_bbc_co_uk_food_recipes_chargrilledapplebaco_87233", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 apple, cored and cut into 1cm/½in rounds", "1 tbsp icing sugar", "30g/1oz butter, melted", "85g/3oz bacon, chopped", "1 thick slice white bread, cut into cubes", "2 tbsp olive oil", "salt and freshly ground black pepper", "handful each fresh parsley, coriander and basil, leaves torn", "2 tsp wholegrain mustard", "1 tbsp red wine vinegar", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 free-range egg, poached, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, dust the apple rings with icing sugar and drizzle with melted butter. Heat a griddle pan and griddle the apple rings for 2-3 minutes on each side, or until lightly charred and softened.", "Place the bacon pieces into a frying pan and fry until crisp, then remove from the pan and set aside. Add the cubed bread, olive oil and seasoning to the pan and fry for five minutes, or until crisp.", "Place the bacon and croutons into a bowl with the herbs and mix well.", "For the dressing, mix all the dressing ingredients together in a bowl. Pour over the salad and mix well.", "To serve, place the chargrilled apples onto a plate, top with the dressed salad and finish with a poached egg."]}, {"isVegetarian": false, "title": "Chargrilled and stewed lamb with pomegranate relish and spiced potatoes", "url": "www_bbc_co_uk_food_recipes_chargrilledandstewed_84998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red onion, chopped", "handful pomegranate seeds", "2 tbsp chopped fresh basil", "2 tbsp chopped fresh parsley", "1 tbsp balsamic vinegar", "1 tbsp olive oil", "1 tbsp olive oil", "100g/3½oz lamb, diced", "½ onion, chopped", "1 garlic clove, chopped", "pinch cumin seeds", "pinch ground turmeric", "1 bay leaf", "3 tbsp red wine vinegar", "100ml/3½fl oz hot vegetable stock", "25g/1oz butter", "1 tbsp olive oil ", "1 potato, peeled and cut into cubes", "pinch cumin seeds ", "pinch paprika", "pinch chilli powder", "pinch coriander seeds", "1 bay leaf ", "2 lamb chops ", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the relish, place all of the relish ingredients into a bowl, mix well and leave to marinate.", "For the stewed lamb, heat the oil in a frying pan, place the chopped lamb, onion, garlic, cumin, turmeric and bay leaf into the pan and cook for 4-5 minutes.", "Add the red wine vinegar, vegetable stock and butter and simmer gently for 10-12 minutes, or until the lamb is tender.", "For the spiced potatoes, heat the oil in a frying pan, add the chopped potato and all the spices, cover with a lid and cook gently for 10-12 minutes, or until the potato is tender.", "For the lamb chops, heat a griddle pan, brush the lamb chops with oil and chargrill for 4-5 minutes on each side, or until cooked to your liking. Leave to rest for a few minutes before serving.", "To serve, place the spiced potatoes onto a plate, top with the stewed lamb and place the lamb chops and relish alongside."]}, {"isVegetarian": true, "title": "Chargrilled asparagus with olive oil and balsamic vinegar", "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_86249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8-10 asparagus spears", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tsp balsamic vinegar, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle the asparagus with the olive oil and season well with salt and freshly ground black pepper.", "Heat a griddle pan until smoking hot and griddle the asparagus for about five minutes, or until charred on all sides.", "To serve, place the asparagus onto a plate and drizzle with balsamic vinegar."]}, {"isVegetarian": true, "title": "Chargrilled asparagus with hollandaise sauce and fried egg", "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_88792", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch asparagus, trimmed", "2 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp white wine vinegar", "4 free-range egg yolks", "1 tbsp Dijon mustard", "225g/8oz unsalted butter, melted", "lemon juice, to taste", "salt and freshly ground black pepper ", "1 free-range egg, fried"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the asparagus, preheat the oven to 180C/350F/Gas 4. ", "Place the asparagus into a bowl, add the olive oil and season with salt and freshly ground black pepper. Stir well to coat. Heat an ovenproof griddle pan until hot, add the asparagus and griddle for 3-4 minutes, shaking the pan from time to time. Place the pan in the oven and roast for ten minutes until the asparagus is tender.", "For the hollandaise, whisk the white wine vinegar, egg yolks and mustard together in a bowl until well combined. Place the bowl over a pan of boiling water, making sure the bottom of the bowl does not touch the water, and whisk the mixture until thickened slightly. ", "Pour the melted butter a little at a time into the bowl, whisking continuously until all the butter has been added and the mixture has emulsified. Add the lemon juice, salt and freshly ground black pepper to taste.", "To serve, place the roasted asparagus onto a serving plate, pour over the hollandaise sauce and top with a fried egg."]}, {"isVegetarian": true, "title": "Chargrilled asparagus with sunblush tomatoes", "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_92472", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "4 asparagus spears", "55g/2oz sunblush tomatoes", "salt and freshly ground black pepper", "2 tbsp chopped fresh chives ", "2 tbsp chopped fresh coriander leaves", "2 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat up a griddle pan over a medium heat. Pour the olive oil into a shallow bowl and coat the asparagus with the oil. ", "Place the oiled asparagus and sunblush tomatoes onto a griddle pan. Season, to taste, with salt and freshly ground black pepper. Griddle for 4-5 minutes,  turning over halfway through cooking, or until golden-brown griddle marks appear on the asparagus and tomatoes. ", "Scatter the chives and coriander over the asparagus and tomatoes. Transfer to a serving plate.", "Add the vinegar to the pan and simmer for 10-20 seconds, stirring until slightly reduced. Pour the reduced vinegar over the asparagus and tomatoes and serve."]}, {"isVegetarian": true, "title": "Chapatis", "url": "www_bbc_co_uk_food_recipes_chapatis_77146", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chapatis_77146_16x9.jpg", "ingredients": ["450g/1 lb chapati flour or wholemeal plain flour", "1 tsp salt", "250ml/9 fl oz cold water", "butter for spreading, optional"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Set aside 200g/7 oz of the flour and reserve for shaping the chapatis.", "Place the remaining flour and salt in a deep bowl. Fill another bowl with the cold water.", "Add the water to the bowl of flour, a little at a time, kneading as you go, until you have a soft, elastic dough. The longer you knead the dough the softer the chapattis will be.", "Sprinkle a little of the reserved flour onto a flat surface or board. Divide the dough into eight and shape each piece into a ball. Flatten the balls slightly, then place one onto the floured board. Roll it out into a flat disc approximately 15cm (6 inches) in diameter, flouring the board when necessary.", "Heat a griddle or a shallow frying pan. Lay the chapatti on the griddle or pan and cook for about 20-30 seconds or until the surface is bubbling.", "Turn it over with tongs and cook the other side for 10-15 seconds. As soon as brown spots appear on the underside, the chapatti is done. ", "Repeat with the other seven balls, using the remaining flour to roll them out. Stack them up as they are cooked, placing a sheet of kitchen towel between each one to absorb any moisture.", "Spread butter over one side, if you like."]}, {"isVegetarian": true, "title": "Chargrilled asparagus with a fried egg and hollandaise sauce", "url": "www_bbc_co_uk_food_recipes_chargrilledasparagus_88900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 spears asparagus, trimmed and thick end peeled", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 free-range egg yolks", "1 tsp Dijon mustard", "½ lemon, juice only", "55g/2oz butter, melted", "1 egg, fried or poached to your liking", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the asparagus, drizzle the asparagus with the olive oil and heat a griddle pan until very hot. Place the asparagus into the griddle pan and season well with salt and freshly ground black pepper. Cook, turning frequently for 5-6 minutes, until tender and striped with griddle marks.", "For the hollandaise, blend the egg yolks, mustard and lemon juice together in a jug with a hand-held blender. With the blender still running, gradually pour in the melted butter, until the hollandaise reaches the consistency of a loose mayonnaise.", "Serve the asparagus lined up on a plate with the fried or poached egg placed on top. Spoon the hollandaise around the side and garnish with chopped chives."]}, {"isVegetarian": false, "title": "Chargrilled breast of pheasant with creamed Brussels sprouts, chestnuts and smoked bacon", "url": "www_bbc_co_uk_food_recipes_chargrilledbreastofp_84876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz chestnuts", "2 pheasant breasts, bones removed", "2 pheasant thighs, bones removed", "salt and freshly ground black pepper ", "2 tbsp olive oil", "200g/7oz smoked bacon lardons", "250g/9oz Brussels sprouts, finely shredded", "400ml/14fl oz double cream ", "150ml/5fl oz red wine"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/Gas 6.", "Using a sharp knife carefully cut a cross into the bottom of each chestnut - this will prevent them exploding when roasting.", "Place the chestnuts onto a baking tray and transfer to the oven to roast for 20 minutes, or until tender, then remove from the oven and allow to cool. Peel off the chestnut shells and slice the nuts finely and set aside.", "Season the pheasant with salt and freshly ground black pepper and lightly drizzle with olive oil.", "Heat a griddle pan until hot, then add the pheasant pieces skin-side down and lightly griddle until golden-brown. Turn the breasts and thighs over and continue cooking, until almost completely cooked through, but still a little pink (or for longer according to your taste) The thighs will take longer to cook than the breasts, so be sure to cook them for longer. The juices will run clear when pierced with a skewer.", "Meanwhile, heat a frying pan until hot, then add the bacon lardons and fry until golden brown all over.", "Drain the lardons of any fat and place into a saucepan.", "Add the chestnuts, sprouts and cream and bring to the boil. Cook for 4-5 minutes, or until the sprouts are just tender and the cream has reduced and thickened.", "Place the red wine in a small frying pan and place over a medium heat. Bring to the boil and cook until reduced by two-thirds of the original volume.", "To serve, place the creamed sprouts and chestnuts onto two warm plates. Top each with a pheasant breast and thigh and spoon a little of the red wine reduction around."]}, {"isVegetarian": false, "title": "Chargrilled calves' liver with sage and potato rosti", "url": "www_bbc_co_uk_food_recipes_chargrilledcalvesliv_84528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz potato, peeled and grated", "1 tbsp yoghurt", "1 free-range egg yolk", "15g/¼oz butter", "salt and freshly ground black pepper ", "1½ tbsp olive oil", "100g/3½oz calves' liver", "small bunch fresh sage leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the rösti, squeeze the grated potato out into a clean tea towel until dry, then place into a bowl.", "Place the egg yolk and yoghurt into a separate bowl and whisk together. Add the grated potato and season well with salt and freshly ground black pepper.", "Melt the butter in a small frying pan. Add the potato mixture to the pan, pressing it down into a disc shape in the pan. Cook over a medium heat until golden brown underneath, then turn the rösti over and cook the other side until golden-brown.", "For the liver, heat a griddle pan until smoking. Drizzle the griddle pan with one tablespoon of the oil, then add the calves' liver and griddle for 3-4 minutes on each side, or until completely cooked through. Remove from the pan and leave to rest in warm place. ", "Add the remaining half tablespoon of oil to a frying pan and add the sage leaves. Fry the sage for 1-2 minutes, or until crisp.", "To serve, place the rösti into the centre of a plate and place the liver on top. Garnish with the sage leaves."]}, {"isVegetarian": false, "title": "Chargrilled chicken Caesar wraps", "url": "www_bbc_co_uk_food_recipes_chargrilledchickenca_74783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 skinless chicken breasts", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "2-3 hearts of cos or romaine lettuce, shredded", "45g/1½oz parmesan shavings", "8 flour tortilla wraps", "1 small clove garlic, crushed", "3 anchovy fillets", "1 large egg yolk", "½ tsp Dijon mustard", "2 tsp lemon juice", "salt and freshly ground black pepper", "150ml/5¼fl oz olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Flatten the chicken breasts slightly with a meat mallet. Brush with olive oil and season. ", "Preheat a grill pan until hot and cook chicken for 10-15 minutes, turning once. Remove from the heat and set aside to rest..", "To make the dressing, pound the garlic and anchovies in a mortar and pestle or blend using a hand blender. ", "Place in a bowl and add the egg yolk, mustard, lemon juice and seasoning. ", "Whisk in the oil slowly to make a thick creamy dressing.", "Cut the warm chicken into chunky strips and tip into the bowl with the lettuce. ", "Throw in the parmesan shavings and enough dressing to coat and toss well. ", "Place a good handful of the mixture onto each of the flour tortilla wraps and fold over one end before rolling up. Serve immediately. "]}, {"isVegetarian": false, "title": "Chargrilled calf's liver with mash and onion gravy", "url": "www_bbc_co_uk_food_recipes_chargrilledcalfslive_81625", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 potato, peeled, chopped, boiled and drained", "25g/1oz unsalted butter", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp olive oil", "25g/1oz butter", "1 garlic clove", "½ onion, finely sliced", "50ml/2fl oz red wine ", "100ml/3½fl oz hot beef stock", "salt and freshly ground black pepper ", "150g/5½oz calf's liver", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tsp chopped chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the mash, place the potato, butter and oil in a large bowl. Season, to taste, with salt and freshly ground black pepper and mash to your preferred consistency.", "To make the gravy, heat the olive oil with the butter in a frying pan over a medium heat. Add the garlic and onion and fry for 3-4 minutes, until golden.", "Add the red wine and simmer until the volume is reduced by half.", "Add the beef stock and simmer to reduce again, until the gravy is thickened, then season, to taste, with salt and freshly ground black pepper.", "For the calf's liver, rub the calf's liver with the olive oil then season both sides with salt and freshly ground black pepper.", "Heat a griddle pan until smoking. Add the liver and chargrill for four minutes on each side, until cooked through, then rest for one minute on a warm plate.", "To serve, place the mash in the centre of a warm plate. Place the liver on top of the mash, spoon over the gravy and sprinkle over with fresh chopped chives."]}, {"isVegetarian": false, "title": "Chargrilled chicken with thyme", "url": "www_bbc_co_uk_food_recipes_chargrilledchickenwi_10959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp thyme, chopped", "olive oil", "6 boned chicken breasts or thighs ", "salt and crushed black pepper", "2-3 cloves of garlic, peeled and chopped", "small bunch parsley, chopped ", "60g/2oz butter, softened", "1 lemon"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan on a high heat. Combine the thyme with a little olive oil and rub onto the chicken. ", "Season and griddle for 8-10 minutes until properly cooked through. ", "Meanwhile mix the garlic, parsley and butter together.  ", "When the chicken is cooked, add the flavoured butter and reduce the heat.", "Cut the lemon in half and squeeze the juice over the chicken.", "Serve the chicken pieces with the pan juices spooned over the top."]}, {"isVegetarian": false, "title": "Chargrilled chicken skewers", "url": "www_bbc_co_uk_food_recipes_chargrilledchickensk_84250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "2 tbsp chopped fresh coriander", "2 tbsp olive oil", "1 tbsp clear honey", "2 tsp sesame seeds", "½ avocado, peeled, stone removed", "small bunch fresh coriander", "½ red chilli, chopped", "1 tbsp milk"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak three wooden skewers in water for ten minutes.", "Cut the chicken breast lengthways into three pieces.", "Sprinkle with chopped fresh coriander and drizzle with olive oil, then thread lengthways onto the skewers. ", "Drizzle with honey.", "Heat a griddle pan until smoking. Add the chicken skewers and chargrill for 4-5 minutes, turning to brown all sides, or until cooked through.  ", "Sprinkle with sesame seeds and place onto a plate.", "For the dip, place all of the dip ingredients into a food processor and blend until smooth. Serve in a small bowl alongside the chicken skewers."]}, {"isVegetarian": false, "title": "Chargrilled chicken with chunky tomato sauce", "url": "www_bbc_co_uk_food_recipes_chargrilledchickenwi_86252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp olive oil", "½ onion, chopped", "1 garlic clove, finely chopped", "200g/7oz cherry tomatoes, halved", "1 tsp red wine vinegar", "2 tsp caster sugar", "1 tbsp tomato ketchup", "1 tbsp tomato purée", "small handful fresh basil, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Rub the chicken with olive oil and season well with salt and freshly ground black pepper. Heat a griddle pan and griddle the chicken for 4-5 minutes on each side.", "Transfer to a baking sheet and bake in the oven for 12 minutes, or until the chicken is completely cooked through.", "For the sauce, heat the olive oil in a small saucepan, add the onion and gently fry for 3-4 minutes. Add the garlic and fry for one minute.", "Add the tomatoes and cook for a further minute. Add the vinegar, sugar, tomato ketchup and tomato purée and simmer for five minutes. Stir in the basil, reserving some to garnish, and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the tomato sauce onto a serving plate and top with the griddled chicken. Garnish with the reserved basil leaves."]}, {"isVegetarian": false, "title": "Chargrilled chicken with rosemary and parsley-infused tomatoes", "url": "www_bbc_co_uk_food_recipes_chargrilledchickenwi_88278", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 skinless chicken breast ", "1 tbsp olive oil", "1 tbsp chopped fresh parsley", "1 sprig fresh rosemary, chopped", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ onion, sliced", "1 garlic clove, chopped", "4 canned plum tomatoes, drained, chopped", "salt and freshly ground black pepper", "1 sprig fresh rosemary, chopped", "small handful chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, place the chicken breast between two sheets of cling film and flatten to 1cm/½in thick with a rolling pin. Discard the cling film.", "Drizzle the chicken breast in olive oil, sprinkle with chopped parsley and rosemary and season with salt and freshly ground black pepper. Heat a griddle pan until smoking hot, add the chicken and fry for 2-3 minutes on each side, or until completely cooked through.", "For the tomatoes, heat the olive oil in a saucepan, add the onion and fry gently until softened but not coloured. Add the garlic and fry for one minute. Add the chopped tomatoes, salt and freshly ground black pepper, rosemary and parsley and simmer for three minutes.", "To serve, spoon the tomatoes onto a serving plate and top with the chicken breast."]}, {"isVegetarian": true, "title": "Chargrilled chicory with melted Dolcelatte and orange dressing", "url": "www_bbc_co_uk_food_recipes_chargrilledchicorywi_86127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 chicory, leaves separated", "50g/2oz Dolcelatte cheese, crumbled", "1 tbsp chives, chopped", "1 orange, peeled, segmented", "handful fresh parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium heat.", "Rub the chicory leaves with olive oil, heat a griddle pan until smoking hot, add the chicory and griddle for two minutes. ", "Place the griddled chicory onto a baking sheet, top with the Dolcelatte and place under the grill for two minutes, or until the cheese is beginning to melt. ", "To serve, sprinkle with chives and place the griddled chicory in the middle of a serving plate. Arrange the orange segments around the edge and garnish with the chopped parsley."]}, {"isVegetarian": true, "title": "Chargrilled courgette with basil, mint, chilli and lemon", "url": "www_bbc_co_uk_food_recipes_chargrilledcourgette_85172", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledcourgette_85172_16x9.jpg", "ingredients": ["6 courgettes, ends trimmed, cut into long strips", "1-2 tbsp extra virgin olive oil, plus extra for dressing ", "1 fresh red chilli, seeded, finely chopped (or 5 tsp dried chilli flakes) ", "sea salt and freshly ground black pepper", "½ lemon, juice only ", "handful fresh mint, roughly chopped ", "handful fresh basil, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the courgette strips in a bowl with the olive oil (just enough to coat the courgette), chilli, sea salt and freshly ground black pepper.", "Heat a ridged grill pan until smoking hot and griddle the courgettes in batches, about four minutes per side, being careful not to crowd the grill pan. They should be tender, but with a crunch to them in the middle. If the strips are not quite cooked, leave them on the grill pan for longer, but watch the heat as you don't want them to burn. Don't be tempted to move the courgette while it is cooking or you won't get the chargrill marks across the flesh. Drain on kitchen paper.", "Toss the griddled courgettes in the lemon juice, mint, basil and a good slug of your best extra virgin olive oil."]}, {"isVegetarian": false, "title": "Chargrilled fillet steak with smoked chilli butter, girolle mushrooms and purple sprouting broccoli", "url": "www_bbc_co_uk_food_recipes_chargrilledfilletste_86298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/6oz fillet steaks", "1 tbsp olive oil", "salt and freshly ground black pepper ", "225g/8oz unsalted butter, at room temperature", "2 tbsp lemon juice", "2 tbsp each chopped fresh parsley, rosemary and thyme ", "2 canned anchovies, drained and finely chopped", "1 tbsp finely chopped shallot", "4 tbsp ready-made smoked barbecue sauce", "2 smoked chipotle chillies (available at some supermarkets and from online suppliers), or fresh chillies, sliced ", "½ tsp salt", "¼ tsp ground white pepper", "60g/2½oz butter", "400g/14oz small potatoes, boiled until tender, peeled and halved lengthways", "1 tbsp chopped fresh flatleaf parsley", "salt and freshly ground black pepper ", "200g/7oz girolle mushrooms, trimmed and sliced", "200g/7oz purple sprouting broccoli, blanched"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the steak, place the steaks onto a clean work surface, cover with cling film and flatten with a rolling pin until 1cm/½in thick. Brush with olive oil and season with salt and freshly ground black pepper.", "Heat a griddle pan and chargrill the steak for 2-3 minutes on each side, for rare meat, or longer, until cooked to your liking. Remove from the pan and set aside to rest in a warm place.", "For the smoked chilli butter, place all the chilli butter ingredients into a food processor and blend until smooth. Place into a small serving dish.", "For the vegetables, heat half of the butter in a frying pan and sauté the potatoes for 4-5 minutes, until golden-brown and crisp. Sprinkle over the parsley, season well with salt and freshly ground black pepper and stir.", "Heat the remaining butter in another frying pan and add the mushrooms. Stir fry for 2-3 minutes until just tender, then add the purple sprouting broccoli and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the potatoes and vegetables equally among four serving plates. Place a steak onto each plate and top with a spoonful of smoked chilli butter."]}, {"isVegetarian": false, "title": "Chargrilled lamb steak with turmeric, cumin and creamed lentils", "url": "www_bbc_co_uk_food_recipes_chargrilledlambsteak_88919", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "225g/8oz lamb leg steak", "salt and freshly ground black pepper", "½ lemon, cut into wedges", "1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, finely chopped", "1 tsp cumin seeds", "½ tsp ground turmeric", "100ml/3½fl oz white wine", "200ml/7fl oz double cream", "150g/5½oz ready-cooked Puy lentils (cooked weight)", "salt and freshly ground black pepper", "1 tbsp fresh coriander leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lamb, heat the olive oil in an ovenproof frying pan until smoking. Season the lamb leg steak with salt and freshly ground black pepper, then sear in the pan for 3-4 minutes on each side, or until browned all over. Add the lemon wedges to the pan and transfer to the oven for 10-12 minutes, or until the lamb is cooked to your liking.", "For the lentils, heat the oil in a pan and gently fry the onion and garlic for 3-4 minutes, or until beginning to soften, then stir in the cumin seeds and ground turmeric. ", "Pour in the wine, then reduce the heat and simmer for 1-2 minutes. Stir in the double cream, lentils and season with salt and freshly ground black pepper. Leave to simmer for another 5-6 minutes, until the liquid starts to reduce and the lentils are heated through.", "To serve, spoon the creamed lentils onto a serving plate and place the lamb steak on top. Garnish with the fresh coriander leaves."]}, {"isVegetarian": false, "title": "Chargrilled lamb chops with Brie, breadcrumbs and parsley topping", "url": "www_bbc_co_uk_food_recipes_chargrilledlambchops_89071", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "2 lamb chops", "salt and freshly ground black pepper ", "55g/2oz Brie cheese, chopped", "small handful fresh white breadcrumbs", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh mint", "salt and freshly ground black pepper ", "1 sweet potato, peeled, chopped", "25g/1oz butter", "1 tbsp milk", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a dash of olive oil in an ovenproof frying pan, season the lamb chops with salt and freshly ground black pepper and fry for 2-3 minutes on both sides, or until golden-brown.", "For the topping, mix together the Brie, breadcrumbs, parsley, mint, salt and freshly ground black pepper in a small bowl and spread the mixture on top of the lamb chops. Bake for five minutes, or until the topping is golden-brown and the lamb is cooked to your liking. ", "For the sweet potato mash, cook the sweet potato in boiling salted water for 6-8 minutes, or until tender. Drain, then mash with the butter and milk until smooth. Season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the sweet potato mash onto a serving plate and top with the lamb chop."]}]