[{"ingredients": ["300 ml / ½ pinta de agua tibia", "1½ cucharadita de levadura seca o 2 cucharaditas colmadas de levadura fresca", "500g / 1lb 2oz '00' de harina o harina de pan blanco fuerte, más extra para espolvorear", "1½ cucharadita de sal", "3 cucharadas de aceite de oliva, más extra para engrasar", "aceite de oliva virgen extra, para lloviznar", "sal marina media gruesa", "2 ramitas de romero, cortadas en pequeños trozos"], "method": ["Vierta un poco de agua tibia en un tazón pequeño. Agregue la levadura y mezcle con los dedos. Deje la levadura durante cinco minutos para ablandar y disolver.", "Mezcle la harina y la sal juntas en un tazón grande. Es posible que desee transferir su mezcla a una tabla de repostería u otra superficie de trabajo plana en esta etapa y preparar la masa allí, al estilo tradicional de la Toscana. De lo contrario, mezcle la masa en el recipiente.", "Haga un pozo en el centro de la mezcla de harina y sal. Vierta la levadura mezclada y el agua en el pozo junto con el aceite de oliva. Mezcle bien. Poco a poco agregue el resto del agua tibia hasta que se forme una masa pegajosa.", "Transfiera la masa a una superficie enharinada. Reúne cualquier pieza perdida. Amasar la masa durante unos 10 minutos, agregando un poco de harina adicional si es necesario, hasta que quede suave y elástica y la masa ya no se pegue a su mano. Para ver si está listo, puede llevar a cabo la prueba de estiramiento: sacar un trozo de masa, debe ser lo suficientemente elástico como para no romperse rápidamente cuando se estira.", "A continuación, acumule los extremos sueltos y las secciones ásperas \"rozando\" su bola de masa. Sosténgalo y curve sus manos alrededor de él, use sus palmas para tirar de sus lados suavemente mientras lo gira lentamente, dejando que sus pequeños dedos se encuentren debajo. Haz esto por cinco minutos. Deberías quedarte con una pelota ordenada y suave.", "Engrase un recipiente y coloque la masa dentro y cúbrala con una película adhesiva untada o una toalla de té húmeda. Deje que se eleve en un lugar cálido hasta que duplique su tamaño, aproximadamente 1½ horas, dependiendo de la temperatura ambiente.", "Use su puño para derribarlo, luego amasarlo por otros dos minutos.", "Deje descansar nuevamente, pero solo por 5-10 minutos.", "Forme colocándolo en una bandeja para hornear poco profunda, con las manos para extenderlo hasta una profundidad de aproximadamente 1.5 cm / ¾in, luego permita que se levante nuevamente, cubierto con un paño de cocina, hasta que duplique su tamaño, esto tomará aproximadamente 30 minutos. Precalentar el horno a 200C / 400F / Gas 6.", "Crea un efecto con hoyuelos empujando repetidamente las puntas de los dedos suavemente sobre la superficie de la masa. Rocíe una cantidad generosa de aceite de oliva virgen extra uniformemente sobre la masa. Espolvorea sobre la sal del mar e introduce los trocitos de romero en la masa.", "Hornee durante 25-35 minutos o hasta que la parte superior esté crujiente y cocida hasta la base. Servir."], "url": "www_bbc_co_uk_food_recipes_focaccia_82368", "title": "focaccia", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["12 g de levadura fresca, o 7 g de levadura instantánea", "350ml / 12fl oz de agua tibia", "500g / 1lb 2oz de harina de pan blanco fuerte, más extra para espolvorear", "2 cucharaditas de sal", "sémola o pan rallado seco, para rociar", "1 cucharada de aceite de oliva virgen extra, más extra para lloviznar", "2 dientes de ajo, finamente picados", "agujas de 2 ramas de romero, finamente picadas", "1 cucharadita de sal marina", "pimienta negra recién molida"], "method": ["Disuelva la levadura en el agua tibia. Coloque la harina y la sal en un bol, agregue la mezcla de levadura y mezcle para formar una masa suave. Enharinar ligeramente la superficie de trabajo y amasar bien durante 5 minutos hasta que quede suave y elástica. Cubra con un paño de cocina y descanse en un lugar cálido durante 20 minutos.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada en una forma rectangular aproximadamente igual a una bandeja para hornear de 38x28 cm / 15x11 pulgadas. Espolvoree la bandeja con sémola o pan rallado.", "Coloque la masa en la bandeja y vierta el aceite de oliva virgen extra en el medio. Con los dedos, extiende el aceite por todas partes. Deje actuar durante 5 minutos, luego golpee la masa con los dedos para hacer indentaciones. Espolvoree el ajo, el romero, la sal y un poco de pimienta negra en la parte superior. Cubra con un paño y déjelo reposar en un lugar cálido durante 45 minutos o hasta que duplique su tamaño.", "Precalentar el horno a 240C / 220C Fan / Gas 9.", "Hornee por unos 15 minutos hasta que esté dorado. Compruebe la focaccia de vez en cuando ya que los hornos domésticos a menudo tienen un color más intenso, por lo tanto, gire la bandeja de cocción en forma acorde.", "Retire e inmediatamente rocíe un poco de aceite de oliva virgen extra por todas partes. Dejar enfriar, luego cortar en cuadrados."], "url": "www_bbc_co_uk_food_recipes_focaccia_with_garlic_and_28682", "title": "Focaccia con ajo y romero", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina fuerte", "7g de levadura instantánea", "1 cucharadita de sal", "aceite, para engrasar", "2 cucharadas de aceite de oliva virgen extra, más extra para lloviznar después de hornear", "3 ramas de romero, solo agujas, finamente picadas", "2 dientes grandes de ajo, finamente picados", "1 cucharadita de sal marina en copos", "pimienta negra recién molida"], "method": ["Para la masa, combine la harina, la levadura y la sal con hasta 350 ml / 12 fl oz de agua tibia, hasta que tenga una masa suave. Amasar durante 10-15 minutos. Transfiera a un tazón engrasado, cubra con una película adhesiva y déjela ascender durante 30 minutos.", "Después de 30 minutos, colóquelo en una bandeja para hornear forrada y ligeramente calentada de 37 x 27 cm / 14 x 10¾ pulgadas. Rocíe con aceite de oliva y cubra con romero fresco, ajo picado, sal marina y un poco de pimienta.", "Presione sus dedos en la masa para hacer hoyuelos y luego descanse por otros 30 minutos.", "Precalentar el horno a 240C / 450F / Gas 8.", "Hornee por unos 15 minutos, o hasta que esté dorado. Compruebe la focaccia de vez en cuando ya que los hornos domésticos a menudo pueden colorear un lado y no el otro. Verifique y mueva la bandeja en consecuencia.", "Una vez cocinado, retíralo del horno e inmediatamente vierte un poco de aceite de oliva. Dejar enfriar, luego cortar en cuadrados."], "url": "www_bbc_co_uk_food_recipes_focaccia_with_garlic_and_35777", "title": "Focaccia con ajo y romero", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 focaccia rectangular de tamaño mediano", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1,5kg / 3Ib 5oz harina de pan blanco fuerte", "1 x 7 g / ¼ oz de levadura seca", "50ml / 2fl oz de aceite de oliva, más un poco más para engrasar", "pizca de sal", "570ml / 20fl oz / 1 pinta de agua tibia", "ramitas de romero", "2 cucharadas de aceite de oliva", "1 cucharadita de sal marina gruesa"], "method": ["Combine la harina, la levadura, el aceite de oliva y la sal en una batidora con un gancho de masa.", "Agregue el agua para hacer una masa suave, y amasar en la batidora hasta que quede suave y brillante.", "Transfiera a un tazón engrasado, cubra con un paño de cocina y deje en un lugar cálido durante aproximadamente una hora hasta que esté bien levantado.", "Incline la mezcla sobre una superficie enharinada y amasar para eliminar cualquier bolsa de aire. Enrolle la masa en una forma ovalada de unos 2 cm / ¾ de grueso. Transfiera a una bandeja de horno engrasada.", "Presione firmemente los dedos en la superficie para \"perforar\" la superficie. Para el aderezo, rocíe con aceite de oliva y muela ligeramente la sal del mar sobre la parte superior.", "Pon una pequeña ramita de romero en cada hoyo.", "Cubra con un paño de cocina y deje el pan a un lado durante otros 20 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Transfiera el pan al estante del medio del horno y cocínelo durante aproximadamente 15 minutos hasta que esté dorado.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_focacciabread_83716", "title": "Pan de focaccia", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de levadura fresca", "½ cucharadita de azúcar", "600ml / 1 pinta 2fl oz de agua tibia", "4 cucharadas de aceite de oliva, más extra para engrasar", "680g / 1½lb de harina blanca fuerte, más extra para quitar el polvo", "2 cucharaditas de sal", "2 cucharadas de aceite de oliva", "1½ cucharadita de sal gruesa", "hojas de 3-4 ramitas de romero"], "method": ["Mezcle la levadura con el azúcar en un tazón pequeño durante aproximadamente 30 segundos, hasta que la levadura se vuelva líquida. Agregue dos tercios del agua y el aceite de oliva.", "En un tazón grande, mezcle la harina y la sal. Vierta la mezcla de levadura en la harina y la sal junto con el resto del agua, si es necesario. Mezcle con una cuchara de madera y junte para formar una masa suave. Agregue más agua si la masa está un poco seca.", "Convierta la masa en una superficie ligeramente enharinada y amasar durante diez minutos hasta que quede suave y elástica.", "Coloque la masa en un tazón grande, ligeramente engrasado. Cubra con una película adhesiva o un paño húmedo y déjelo en un lugar cálido para que se eleve durante aproximadamente 1 ½ horas hasta que duplique su tamaño.", "Precalentar el horno a 220C / 400F / Gas 7.", "Cuando la masa ha subido, amasar de nuevo durante unos cinco minutos sobre una superficie de trabajo enharinada limpia para 'golpearlo'.", "Forma la masa en dos círculos ásperos. Coloque los círculos en dos bandejas para hornear, cúbralos con un paño limpio y húmedo y deje que se demuestren (aumenten) hasta duplicar su tamaño original (aproximadamente 10-15 minutos).", "Cuando la masa haya subido, use las yemas de los dedos para formar hoyuelos en la masa. Cepillar con aceite de oliva y espolvorear con sal y hojas de romero.", "Transfiera las bandejas al horno y hornee durante diez minutos.", "Reduzca el calor a 190 ° C / 375 ° F / Gas 5 y hornee por otros 25-30 minutos hasta que los panes estén dorados y cocidos. Si lo desea, puede rociar el pan con agua (usando un \"señor\") una o dos veces durante la cocción para que se \"cueza al vapor\" en el horno.", "Cuando esté cocido, colóquelo en una rejilla para que se enfríe un poco. La focaccia se come mejor el día de su fabricación."], "url": "www_bbc_co_uk_food_recipes_focacciawithrosemary_90210", "title": "Focaccia con romero", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 2 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/focacciawithrosemary_90210_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "Harina de 175g / 6oz de auto crianza", "1-2 cucharadas de leche", "50 g / 1 oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "¼ cucharadita de esencia de limón", "150g / 5½oz de azúcar glas", "75g / 2¾oz de mantequilla, ablandada", "3-5 cucharadas de mermelada de fresa", "2 cucharadas de mermelada de albaricoque, calentado suavemente, luego pasado a través de un tamiz", "Mazapán 250 g / 9 oz", "450g / 1 libra de azúcar glasé glaseado", "colorante de comida verde, rosa y amarillo", "flores de azúcar, para decorar"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Engrase y forre una lata cuadrada de 20 cm / 8 pulgadas.", "Batir la mantequilla y el azúcar en un bol hasta que estén suaves y esponjosos. Batir los huevos, poco a poco, hasta que estén bien combinados. (Si la mezcla parece que está cuajando, agregue una cucharada de la harina.) Doble la harina y agregue un poco de leche si la mezcla se ve tieso.", "Con una cuchara, coloca la masa de la torta en la lata de la torta y nivelala con el dorso de una cuchara. Hornee durante 35-40 minutos, o hasta que estén doradas y una brocheta insertada en el centro salga limpia.", "Retire la torta del horno, déjela enfriar durante cinco minutos, luego déjela enfriar y déjela enfriar completamente sobre una rejilla.", "Mientras tanto, para el jarabe de azúcar, caliente el azúcar y el agua en una cacerola hasta que el azúcar se haya disuelto. Agregue la esencia de limón.", "Para el relleno, bata la mantequilla en un bol hasta que esté suave y suave, bata lentamente en el azúcar glasé. Continúa batiendo hasta que quede esponjoso.", "Con mucho cuidado, con el cuchillo más largo que tenga, retire la corteza oscura de la parte superior del pastel y revuelva el pastel. A continuación, corte el pastel por la mitad horizontalmente.", "Rocíe o cepille la capa de la torta inferior con el jarabe de azúcar y luego unte con la crema de mantequilla. Cubra con la mermelada y cuidadosamente sándwich con la mitad superior de la torta.", "Envuelva la torta en una película adhesiva y déjela enfriar durante 2 a 3 horas, esto hará que sea más fácil cortar el pastel más tarde.", "Espolvoree ligeramente la superficie de trabajo con azúcar glas y extienda el mazapán al mismo tamaño que la torta. Una vez que el pastel esté frío. cepille la parte superior de la torta con la mermelada de albaricoque tamizada. Con cuidado, levante el mazapán sobre el pastel, aliselo plano en la parte superior del pastel y corte el exceso de mazapán. Corta el pastel en cuadrados iguales de 25 x 4 cm / 1 ½.", "Tamiza el azúcar impalpable en un tazón pequeño y agrega suficiente agua caliente para hacer un glaseado suave lo suficientemente grueso como para cubrir los pasteles. Reserve tres cucharadas de glaseado en otro recipiente, cúbralo con una película adhesiva y déjelo a un lado.", "Divida la formación de hielo restante en tres cuencos. Agregue unas gotas de colorante vegetal verde a uno de los tazones de glaseado y mezcle hasta que quede suave. Repita con los otros tazones de glaseado usando el colorante de alimentos rosa y amarillo.", "Cubra los cuadrados de la torta con el glaseado, facilitando la formación de hielo a los lados de los pasteles hasta que tenga un recubrimiento uniforme en todos los pasteles. Coloque las tortas en una rejilla para enfriar hasta que se forme la formación de hielo.", "Con una cuchara, coloque el glaseado reservado en una manga pastelera con una boquilla muy fina y decoraciones sencillas para tubos en las fantasías de fondant. Exprime un poco de glaseado en las flores de azúcar y úsalas para decorar las fantasías fondant."], "url": "www_bbc_co_uk_food_recipes_fondant_fancies_28732", "title": "Fantasías Fondant", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 25", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fondant_fancies_28732_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "225 g / 8oz de mantequilla para untar o suavizada", "225 g / 8 oz de azúcar en polvo", "1 limón, corteza rallada solamente", "4 huevos de gallinas camperas", "250g / 9oz de mantequilla sin sal ablandada", "200g / 7oz de azúcar glasé", "3 cucharadas de mermelada de albaricoque", "Mazapán 200g / 7oz", "1 kg / 2lb 4oz glaseado de fondant blanco", "150ml / 5fl oz de agua", "Colorante alimentario (de cualquier color)", "saborizante (cualquier saborizante)", "100 g / 3½ oz de chocolate negro"], "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase y forme una lata cuadrada de 20 cm / 8 pulgadas con dos tiras de papel pergamino.", "Para la esponja, bata juntos todos los ingredientes de la esponja hasta que quede suave. Incline la mezcla de la torta en la lata y toque ligeramente para nivelar.", "Hornee durante aproximadamente 40 minutos, o hasta que un pincho de metal insertado en el medio salga limpio.", "Permita que se enfríe en la lata durante 10 minutos, luego déjela enfriar completamente en una rejilla de alambre, antes de ponerla en el refrigerador para enfriarla (o alternativamente colóquela en el congelador por unos minutos hasta que se enfríe pero no la congele).", "Mientras el pastel esté frío, haz la crema de mantequilla. Batir la mantequilla ablandada y el azúcar glas en un bol hasta que queden más claros y suaves.", "Coloque 100 g / 3½ oz de la crema de mantequilla en una manga pastelera y déjela reposar ligeramente en la nevera. Mantenga el resto en un tazón para los lados de la torta.", "Para el aderezo de mazapán, caliente la mermelada de albaricoque en una olla pequeña y críe en un bol.", "Cepille la parte superior de la torta con la mermelada de albaricoque tamizada.", "Tira el mazapán muy fino, cubre la parte superior de la torta y vuelve a enfriar.", "Corta la torta en 25 cuadrados iguales (cada 4cm / 1½ pulgadas cuadradas). Es posible que deba cortar los bordes si se han redondeado y apartado de los lados de la lata; todos los bordes deben ser rectas y ordenadas.", "Cubra los cuatro lados de cada cuadrado con crema de mantequilla (no la parte superior del mazapán o la base). Usando la crema de mantequilla en la manga pastelera, vierta una gota en el centro de cada cuadrado encima del mazapán. Dejar reposar en la nevera durante 20 minutos.", "Para el glaseado y la decoración, corte el glaseado de fondant en cubos pequeños. Coloque en un mezclador de pie robusto con una paleta. Revuelve la guinda hasta que empiece a romperse, agregando un chorrito de agua si es demasiado dura. Agregue muy gradualmente el agua: la formación de hielo se hará más lisa y más líquida.", "Agregue sabor y colorante para alimentos a gusto: tenga cuidado de no agregar demasiado a la vez, siempre puede agregar más pero no puede deshacerlo.", "Derrita el chocolate en el microondas o en un recipiente resistente al calor sobre una olla de agua hirviendo (no permita que el fondo del recipiente toque el agua). Una vez derretido, coloque el chocolate en la manga pastelera y déjelo a un lado.", "Saca los pasteles del refrigerador y coloca uno en un tenedor.", "Sumerja cada cuadrado en la formación de hielo uno a la vez y colóquelo cuidadosamente en una rejilla para enfriar, con un pergamino debajo para atrapar las gotas. Trate de no dejar huellas dactilares en ellos, por esta razón, es mejor insertar la horquilla en un ángulo para que pueda deslizar la torta sobre la rejilla de enfriamiento con facilidad.", "Deje que el fondant se fije, pero no lo coloque en el refrigerador ya que el glaseado perderá su brillo.", "Usando la manga pastelera de chocolate derretido, rocíe el chocolate sobre cada fantasía en un patrón en zig-zag.", "Deje que se asiente y luego colóquelo en un soporte para pasteles para servir."], "url": "www_bbc_co_uk_food_recipes_fondant_fancies_88368", "title": "Fantasías fondant de Mary Berry", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 25", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fondant_fancies_88368_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5oz de mantequilla", "4 papas, peladas, cortadas en forma de barril con un cortador de galletas", "75ml / 3fl oz de caldo de pollo o vegetal", "2 dientes de ajo, pelados, triturados ligeramente con el filo de un cuchillo", "2-3 ramitas de tomillo fresco", "copos de sal marina y pimienta negra recién molida"], "method": ["Calentar la mantequilla a fuego medio en una olla. Cuando la mantequilla esté espumosa, agregue las papas y fría hasta que estén doradas por un lado, alrededor de 5-6 minutos. (No mueva las papas mientras se cocinan).", "Dé la vuelta a las papas y cocine por otros 5-6 minutos, o hasta que estén doradas por ambos lados.", "Vierta cuidadosamente el caldo, luego agregue los dientes de ajo y las ramitas de tomillo. (PRECAUCIÓN: la grasa caliente chisporroteará cuando entre en contacto con el caldo.) Sazone al gusto con sal y pimienta negra recién molida.", "Cubra la olla con una tapa y reduzca el fuego hasta que el caldo esté hirviendo a fuego lento. Cocine a fuego lento las papas hasta que estén tiernas, luego retire las papas de la sartén con una espumadera y manténgase caliente."], "url": "www_bbc_co_uk_food_recipes_fondantpotatoes_93087", "title": "Papas de fondant", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fondantpotatoes_93087_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva virgen extra", "3 cucharadas de vinagre de vino blanco", "1 cucharada de vinagre balsámico", "1 cucharada de mostaza Dijon", "1 cucharada de azúcar en polvo", "1 manojo de eneldo fresco, picado", "sal y pimienta negra recién molida", "8 cebollas de primavera, en rodajas finas", "8 palitos de apio, en rodajas finas", "1 bombilla pequeña de hinojo, en rodajas finas", "½ pepino grande, cortado a la mitad longitudinalmente y en rodajas", "200 g / 7oz de hojas de ensalada mixtas, aproximadamente desgarradas", "1 lechuga romana, aproximadamente desgarrada", "Cohete de 100g / 3½ oz o berro, desgarrado"], "method": ["Para el aderezo, ponga el aceite, el vinagre, la mostaza, el azúcar y la sal y la pimienta en un tazón y mezcle hasta que estén uniformemente combinados y espesados. Pruebe y sazone de nuevo si es necesario, luego mezcle el eneldo.", "Coloque las cebollas tiernas, el apio y el hinojo en una ensaladera grande. Vierta el aderezo y mezcle bien.", "Coloque la mitad del pepino y la mitad de las hojas mezcladas, la lechuga romana y el cohete en el recipiente. Sazone, luego cubra con el resto del pepino, las hojas, la lechuga romana y el cohete. Sazonar bien y relajarse durante 4 horas", "Justo antes de servir, mezcle todo."], "url": "www_bbc_co_uk_food_recipes_fool-proof_green_salad_90764", "title": "Ensalada verde a prueba de tontos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fool-proof_green_salad_90764_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla, más extra para untar el plato de soufflé", "Harina normal de 30g / 1oz ('00' si es posible)", "150ml / 5fl oz de leche entera", "1 cucharadita de mostaza Dijon", "pizca de cayena", "4 huevos, 4 blancos y 2 yemas", "85g / 3oz de queso rallado (yo uso gruyère, pero puedes usar cualquier queso duro)", "sal y pimienta"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente la leche hasta que esté justo por debajo de la ebullición.", "Derrita la mantequilla, agregue la harina y cocine durante 1 minuto. Quite el fuego y gradualmente bata en la leche. Cocine por 1 minuto hasta que tenga una salsa espesa.", "Sazonar bien y agregar la mostaza. Dejar enfriar durante 1 minuto mientras se mantequilla el plato de soufflé.", "Separa los huevos. Batir las yemas en la salsa junto con la mayor parte del queso.", "Batir las claras de huevo hasta que tenga picos suaves, no exagere. Dobla en la salsa. Llena el plato tres cuartas partes lleno. Pasa el dedo por el borde para obtener el acabado 'top-hat'.", "Coloque en un plato de horno, cubra con el queso restante y una pizca de cayena.", "Coloque en el horno y cocine por 15-17 minutos."], "url": "www_bbc_co_uk_food_recipes_foolproofcheesesouff_65612", "title": "Soufflé de queso a prueba de tontos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 yemas de huevo de gallinas camperas", "1 huevo de gallinas camperas", "1 cucharada de mostaza francesa", "½ limón, solo jugo", "½ cucharadita de azúcar en polvo", "400ml / 14¼fl oz de aceite vegetal", "Sal y pimienta negra recién molida"], "method": ["Mezcle todos los ingredientes excepto el aceite en un procesador de alimentos durante 10-15 segundos, o hasta que estén bien combinados. Mientras el motor está funcionando, vierta el aceite en el procesador de alimentos muy lentamente hasta que el pozo se combine y la mezcla sea gruesa y brillante.", "Sazonar, al gusto, con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_foolproofmayonnaise_93365", "title": "Mayonesa a prueba de tontos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 400ml", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "pizca de sal", "125g / 4½oz de mantequilla fría, en cubos", "2 yemas de huevo medianas", "1 huevo de gallinas camperas, batido para lavar huevos", "salpicaduras de aceite, para freír", "1 cebolla pequeña, picada", "500 g / 1 libra de carne magra picada de 2 onzas", "1 cucharada de puré de tomate", "1 cucharada de harina normal", "200ml / 7fl oz de caldo de carne", "algunos guiones de salsa Worcestershire", "100g / 3½oz de guisantes congelados", "sal y pimienta"], "method": ["Coloque la harina, la sal y la mantequilla en un tazón y frótelas con las puntas de los dedos, hasta que la mezcla se parezca al pan rallado y no queden restos de mantequilla. Agregue las yemas de huevo y una cucharada de agua fría. Suavemente junte la masa, agregando más agua si es necesario.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase suavemente hasta que se haya convertido en una bola brillante. Envuelva la película adhesiva y relájese durante al menos 45 minutos.", "Para el relleno, caliente el aceite en una sartén grande y fría la cebolla hasta que comience a ablandarse. Agregue la carne picada y fría hasta que esté completamente dorado, moviéndolo todo el tiempo. Agregue el puré de tomate y cocine por unos minutos. Agregue la harina y cocínela durante 1 minuto, vierta el caldo y algunos batidos de salsa Worcestershire.", "Baje la temperatura a fuego lento, sazone y deje cocer durante unos 20 minutos o hasta que la salsa se haya reducido y espesado. Apaga el fuego y deja enfriar.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Retire la masa de la nevera y desenvuelva. Divida la masa en cuartos y luego divídala a la mitad cada trimestre.", "Para revestir cada uno de los platos de tarta, despliegue una de las piezas de hojaldre hasta un grosor de 2 mm y forre la caja de hojaldre presionando suavemente la masa hasta la base. Debe haber alrededor de 1 cm de hojaldre que sobresalga por los bordes. Repita para alinear las otras latas.", "Ahora extienda los otros trozos de masa, un poco más gruesos esta vez, para hacer las tapas de las tartas.", "Mezcle los guisantes en el relleno enfriado y divídalos entre los platos de tarta. Cepille un poco de huevo para lavar alrededor de la pasta que sobresale y coloque las tapas en la parte superior. Recorta los bordes de la masa. Prensar los bordes de la masa pellizcando el borde con el índice y el pulgar, y luego usando el dedo índice de la otra mano, empuja hacia arriba desde abajo, creando una onda ordenada. Repita todo el camino alrededor del borde.", "Cepille un poco más de huevo en la parte superior y marque un diseño en la parte superior de la masa para que parezca una pelota de fútbol. Coloque en una bandeja para hornear y hornee durante 30-40 minutos, o hasta que los pasteles estén crujientes y dorados.", "Retire del horno y espere diez minutos antes de retirar las cajas de repostería. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_football_pies_25880", "title": "Pasteles de fútbol", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/football_pies_25880_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450ml / 16fl oz de leche entera", "1 vaina de vainilla, semillas retiradas", "300g / 10½oz de chocolate blanco de buena calidad, roto en pedazos", "6 yemas de huevo grandes de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz", "300 ml / 10 fl oz doble crema", "150-200g / 5½-7oz de frutas congeladas del bosque", "3 huevos medianos de granja", "100 g / 3½ oz de azúcar en polvo", "Harina normal de 80g / 3oz", "2 cucharaditas de cacao en polvo", "250 g / 9 oz frutas congeladas del bosque", "125ml / 4fl oz cassis", "150g / 5½oz de chocolate blanco, derretido"], "method": ["Vierta la leche en una cacerola grande, agregue la vaina de vainilla y cocine a fuego lento. Poco a poco agregue el chocolate blanco, batiendo todo el tiempo hasta que se derrita. Retire del fuego.", "Coloque las yemas de huevo y el azúcar en un tazón de vidrio grande y bata con un batidor de mano eléctrico hasta que esté pálido.", "Poco a poco vierta la mezcla de leche sobre la mezcla de huevo, batiendo todo el tiempo. Vierta la crema pastelera de nuevo en la cacerola, luego cocine a fuego lento hasta que la mezcla esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Deja enfriar.", "Una vez que esté frío, mezcle la crema y la fruta. Transfiera a una máquina de helados y revuelva hasta que comience a solidificarse.", "Retire el helado y colóquelo en una hoja de película adhesiva. Móblelo en un tronco largo de 23 cm / 9 pulgadas y envuélvelo en la película adhesiva, luego asegura los extremos con un giro. Coloque en el congelador.", "Para la esponja de chocolate, precaliente el horno a 200C / 180C Ventilador / Gas 6. Cubra una lata de rollo suizo de 23x33cm / 9x13in con papel resistente a la grasa.", "Coloque los huevos y el azúcar en un tazón de vidrio grande y bata con un batidor de mano hasta duplicar su tamaño. Tamiza y luego dobla la harina y el cacao en polvo, manteniendo el aire en la mezcla. Vierta la mezcla en la lata forrada y hornee durante 8-10 minutos. Deja enfriar.", "Para armar el rollo ártico, coloque el tronco de helado en un extremo de la esponja y enrolle. Envuelva la película adhesiva y congélela durante 1 hora o hasta que esté firme.", "Para servir, ponga las frutas y cassis en una olla mediana y caliente. Vierta la fruta sobre el tronco y rocíe con el chocolate blanco derretido."], "url": "www_bbc_co_uk_food_recipes_forest_fruit_and_white_67803", "title": "Frutas del bosque y chocolate blanco ártico rollo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite de colza", "1 pollo grande, unido en 8 piezas", "sal y pimienta negra", "Tocino tocino de 200 g / 7 oz", "200g / 7 oz chalotes, pelados y cortados por la mitad a lo largo", "1 bulbo de ajo, cortado por la mitad horizontalmente", "500g / 1lb 2 oz de hongos silvestres (como rebozuelos, girolles, ceps y morelles), limpios", "50g / 1¾oz de mantequilla", "50 ml / 2 fl oz de madeira", "500ml / 18fl oz de caldo de pollo oscuro", "Crema doble de 200 ml / 7 fl oz", "1 manojo de estragón fresco", "1 trufa pequeña"], "method": ["Agregue la mitad del aceite a una sartén caliente grande.", "Sazone las piezas de pollo con sal y pimienta. Agregue a la sartén y freír hasta que esté dorado, luego voltee y repita en el otro lado.", "Caliente una cazuela grande o una sartén de base pesada hasta que esté caliente y luego agregue dos cucharadas de aceite. Fría los lardons hasta que estén crujientes, luego agregue los chalotes y el ajo y cocine hasta que estén coloreados.", "Transfiere el pollo a la cazuela. En la misma sartén, freír los champiñones en la mantequilla durante 3-4 minutos. Agregue el Madeira, caldo, crema y estragón. Sazone al gusto con sal y pimienta negra recién molida.", "Vierta la salsa sobre el pollo y cocine a fuego lento durante 15-20 minutos.", "Para servir, amontone el pollo en un tazón para servir, cubra con salsa y raspe la trufa."], "url": "www_bbc_co_uk_food_recipes_forest_truffle_chicken_19890", "title": "Pollo de trufa de bosque", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/forest_truffle_chicken_19890_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "4 galletas de jengibre listas para usar", "120 g / 4 oz de pistachos", "Harina normal de 55g / 2oz", "200g / 7oz de frutas del bosque congeladas", "5 cucharadas de leche", "5 cucharadas de crema doble", "1 yema de huevo de gallinas camperas", "1 cucharada de azúcar en polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase un plato a prueba de horno con mantequilla.", "Coloque la mantequilla, el azúcar, galletas de jengibre, pistachos y harina en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Coloque una capa de frutas del bosque congeladas en la base del plato resistente al horno y cubra con la mezcla de crumble.", "Transfiera al horno y hornee por 10-15 minutos, hasta que el relleno esté crujiente y dorado.", "Para la crema pastelera, coloque la leche y la crema en una cacerola a fuego medio y caliente hasta que hierva. Retirar del fuego y dejar enfriar ligeramente.", "Batir la yema de huevo y el azúcar juntos en un tazón.", "Poco a poco vierta la mezcla de leche y crema en la yema y el azúcar, batiendo constantemente.", "Regrese la mezcla de crema a la cacerola de leche y cocine a fuego lento a fuego medio, revolviendo constantemente, hasta que la crema se espese y cubra la parte posterior de una cuchara.", "Cuele la crema a través de un colador en una jarra.", "Para servir, coloca una porción de la migaja en un bol y vierte un poco de natilla."], "url": "www_bbc_co_uk_food_recipes_forestfruitcrumblewi_85408", "title": "Crumble de frutas del bosque con flan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 galletas de jengibre listas para usar, aplastadas", "30g / 1oz de mantequilla, derretida", "55g / 2oz mascarpone", "Crema doble de 55g / 2oz", "1 cucharada de miel", "½ limón, solo jugo", "85g / 3oz de frutas congeladas del bosque"], "method": ["Mezcle los bizcochos triturados con la mantequilla derretida en un tazón.", "Coloque un anillo profundo de chefs en un plato y presione la mezcla de galletas en la base del anillo.", "En un tazón limpio, mezcle el mascarpone, la crema, la miel y el jugo de limón.", "Coloque tres cucharadas de las frutas del bosque congeladas sobre la base de la galleta, luego cubra la mezcla de crema. Agregue la fruta restante para llenar el anillo.", "Retire con cuidado el anillo de los cocineros (puede que necesite usar un mini soplete para aflojar el anillo) y sirva."], "url": "www_bbc_co_uk_food_recipes_forestfruitscheeseca_85409", "title": "Tarta de queso de frutas del bosque", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 claras de huevo grandes de gallinas camperas, a temperatura ambiente", "pizca de sal marina fina", "100 g / 3½ oz de azúcar en polvo", "1 cucharada de harina de maíz", "1 cucharadita de vinagre de sidra o vinagre de vino blanco", "¼ cucharadita de cardamomo molido", "75g / 2½oz de mini chips de chocolate negro", "75g / 2½ oz de pistachos, finamente picados"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4 y alinee una bandeja grande para hornear con papel de hornear. Batir las claras de huevo y la sal en un recipiente sin grasa, hasta que tenga picos suaves. Agregue el azúcar un poco a la vez hasta que espese y reluciente.", "A mano, vierta la harina de maíz, el vinagre y el cardamomo, luego agregue las chispas de chocolate y la mayoría de los pistachos y doblarlos muy suavemente también.", "Con una cuchara, suelte gotas de la mezcla, de 4-5cm / 2in de diámetro, en la bandeja preparada. Espolvorea con los pistachos restantes.", "Coloque las galletas en el horno, cierre la puerta y apague el horno inmediatamente. Deje que las galletas se asienten en el horno apagado durante la noche."], "url": "www_bbc_co_uk_food_recipes_forgotten_cookies_60368", "title": "Galletas olvidadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12-14", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/forgotten_cookies_60368_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "1½ cucharada de harina de maíz", "50 g / 1 oz de azúcar en polvo", "1 cucharadita de sal", "3 cucharadas de aceite vegetal", "3 huevos de gallinas camperas, solo para blancos", "1 cucharadita de agua", "1½ cucharadita de extracto de vainilla", "½ cucharadita de extracto de almendra"], "method": ["Precalentar el horno a 170 ° C / 325 ° F / Gas 3. Cubra una bandeja para hornear con una estera de silicona. Escriba fortunas en trozos de papel de aproximadamente 6 cm x 1 cm / 2½ pulgadas x 1/2 pulgadas.", "Tamice la harina y la harina de maíz en un tazón grande, luego agregue el azúcar y la sal y mezcle bien. Con una cuchara de madera, mezcle el aceite, las claras de huevo, el agua y los extractos de vainilla y almendras.", "Coloque cucharadas de la mezcla sobre la estera de silicona y use la parte posterior de una cuchara de metal para hacer girar la mezcla en círculos de 10 cm. Deje espacio entre cada galleta, ya que se extenderán un poco durante la cocción; obtendrá aproximadamente cinco galletas en la bandeja de hornear así que tendrá que cocinarlas en tandas. Hornee en el horno durante 10-12 minutos. El borde exterior de cada galleta debe dorarse y las galletas deben ser fáciles de quitar con una espátula cuando estén cocidas.", "Coloque una fortuna en el centro de cada galleta y mientras la galleta aún esté suave y flexible, dóblela por la mitad y pellizque los bordes semicirculares para sellar. Coloque el borde doblado de la galleta en el borde de una taza o vaso y tire suavemente de las dos esquinas hacia abajo, una en el interior de la taza y otra en el exterior, para formar la clásica forma de galleta de la fortuna. Reserve para enfriar y repita con las galletas restantes."], "url": "www_bbc_co_uk_food_recipes_fortune_cookies_37274", "title": "Galletas de la fortuna", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 15 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 g / ¼ oz de levadura fresca (o 1 x 7 g de levadura de acción rápida)", "500g / 1lb 2oz de harina de pan fuerte", "2 cucharaditas de sal", "350g / 12oz de agua (pesar el agua es más preciso)", "1 x 400g / 14oz de garbanzos en lata, escurridos y enjuagados bien", "2 dientes de ajo, picados", "1 limón, solo jugo", "250ml / 9floz de aceite de oliva virgen extra", "110g / 4oz piñones", "3 dientes de ajo, toscamente picados", "Parmesano 110 g / 4 oz, rallado", "1 limón, solo jugo", "3-4 racimos de albahaca fresca", "4 cucharadas de aceite de oliva virgen extra", "sal marina", "Aceitunas negras de 300g / 11oz, piedras quitadas", "Atún enlatado 75g / 3oz en aceite de oliva", "Alcaparras de 150 g / 5 oz, escurridas", "½ limón, solo jugo", "5 cucharadas de aceite de oliva virgen extra"], "method": ["Para la fougasse, precaliente el horno a 240C / 475F / Gas 9 y precaliente una piedra para hornear o una bandeja para hornear volteada hacia arriba.", "Frote la levadura en la harina con las puntas de los dedos.", "Agregue la sal y el agua y, sosteniendo el tazón con una mano, mezcle los ingredientes con la otra mano durante 2 o 3 minutos, o hasta que la mezcla se una como masa.", "Saque la masa sobre la superficie de trabajo y continúe amasando la masa, estirándola y doblándola sobre sí misma hasta que se vuelva lisa y elástica. Coloque la masa en un recipiente, cúbrala con una película adhesiva y déjela a un lado durante al menos una hora, o hasta que la masa se haya duplicado.", "Use una espátula de plástico para liberar la masa del cuenco; debería poder extraerla fácilmente en una sola pieza y transferirla a la superficie de trabajo sin estirarla. Tenga cuidado de no desinflar la masa cuando la maneje, pero permita que se extienda para cubrir un cuadrado de su superficie de trabajo. Generosamente harina la parte superior de la masa.", "Cortar la masa en dos rectángulos, luego cortar cada pieza de nuevo en tres piezas aproximadamente rectangulares.", "Maneje la masa lo más suavemente que pueda para que permanezca lo más ligera y llena de aire posible y mantenga las piezas bien enharinadas. Corta un gran corte diagonal en el centro de cada pieza de masa, asegurándote de no ir directamente a los bordes de la masa, sino que corta todo el camino a través de la masa hasta la superficie de trabajo.", "Haz tres cortes diagonales más pequeños abanicándose a cada lado de la central.", "Coloque los dedos en las ranuras y ábralos suavemente para formar agujeros. (Sé audaz: es mejor hacer menos cortes y abrir realmente los agujeros).", "Levante los pedazos de masa en una cáscara de madera ligeramente enharinada o en una bandeja para hornear de bordes planos, luego deslícelos sobre la piedra para hornear precalentada.", "Rocíe agua en el interior del horno y cierre la puerta. Reduzca el calor a 230 ° C / 450 ° F / Gas 8 y hornee durante 10-12 minutos, o hasta que estén doradas.", "Mientras tanto, para el puré de garbanzo y aceite de oliva, pulse los garbanzos y el ajo en una licuadora o procesador de alimentos hasta que quede suave. Agregue el jugo de limón, y pulse hasta que quede suave, luego agregue la aceituna, poco a poco y pulse hasta que la mezcla esté muy suelta, pero no demasiado líquida. (Puede que no necesite todo el aceite de oliva).", "Para el pesto, pulse los piñones, el ajo y el parmesano en una licuadora hasta obtener una pasta gruesa.", "Agregue la albahaca y el pulso de nuevo, luego agregue el jugo de limón y el aceite de oliva, poco a poco, hasta que tenga la textura que desea. Sazonar, al gusto, con sal. (La clave para un buen pesto es no exagerar los ingredientes; de lo contrario, los moretones de la albahaca comenzarán a volverse negros y perderán su sabor fresco).", "Para tapenade, mezcle las aceitunas en un procesador de alimentos hasta que estén picado. Agregue los ingredientes restantes y siga pulsando en ráfagas cortas hasta obtener una pasta gruesa.", "Sirve la fougasse con las inmersiones."], "url": "www_bbc_co_uk_food_recipes_fougasse_with_chickpea_84307", "title": "Fougasse con puré de garbanzo y aceite de oliva, pesto y tapenade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de nueces de macadamia", "25 g / 1 oz de nueces de Brasil", "Nueces de pacana 25g / 1oz", "Avellanas de 25g / 1oz", "50g / 2 oz de chocolate negro (75 por ciento de sólidos de cacao)", "110g / 4oz de mantequilla", "2 huevos, golpeados", "225g / 8oz de azúcar granulada", "Harina normal de 50g / 2oz", "1 cucharadita de polvo de hornear de nivel", "¼ cucharadita de sal"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Comience cortando las nueces aproximadamente, no demasiado pequeñas, luego colóquelas en una bandeja para hornear y tápelas en un horno precalentado durante 8 minutos exactamente. Utiliza un cronómetro aquí, de lo contrario, ¡estarás tirando nueces quemadas todo el día!", "Mientras se cocinan las nueces, coloque el chocolate y la mantequilla juntos en un tazón grande sobre una olla con agua apenas hervida, asegurándose de que el recipiente no toque el agua.", "Deja que el chocolate se derrita, luego bate hasta que quede suave, quítalo del fuego y", "simplemente agregue todos los demás ingredientes hasta mezclarlos por completo.", "Ahora distribuya la mezcla de manera uniforme en la lata preparada y hornee en el estante central del horno durante 30 minutos o hasta que esté ligeramente elástica en el centro.", "Retire la lata del horno y déjela enfriar durante 10 minutos antes de cortar en aproximadamente 15 cuadrados. Luego, usando una espátula, transfiera los cuadrados a una rejilla para terminar de enfriar."], "url": "www_bbc_co_uk_food_recipes_fournutchocolatebrow_67259", "title": "Cuatro brownies de chocolate con nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 15", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]