[{"ingredients": ["gran perilla de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado", "30g / 1¼ oz de hongos porcini secos, empapados en un recipiente de agua tibia durante media hora", "450 g / 1 libra de setas, como trompeta, girolle y setas de ostra, más o menos picadas", "Arroz arborio 300 g / 10½ oz", "salpicaduras de aceite de oliva, si es necesario", "250ml / 8¾ fl oz de vino blanco seco", "1.5 litros / 2 pintas 12¾ fl oz de caldo de pollo (o caldo de verduras)", "½ manojo de perejil, aproximadamente picado", "100 g / 3½ oz de queso parmesano, o queso duro vegetariano similar, finamente rallado", "rociar aceite de trufa, para servir"], "method": ["Derrita la mantequilla en una sartén honda a fuego medio. Agregue la cebolla y el ajo y freír suavemente hasta que estén transparentes.", "Escurra el porcini empapado, reservando aproximadamente 300 ml / 10½ fl oz del agua de remojo.", "Aumente el fuego a alto y agregue los champiñones a la sartén. Cocine a fuego alto durante 2-3 minutos y luego agregue el arroz. Si en este punto la mezcla se está secando, agregue un chorrito de aceite de oliva. Freír la mezcla durante 2-3 minutos hasta que el arroz esté ligeramente translúcido.", "Agregue el vino y cocine a fuego lento hasta que el líquido se absorba en su mayoría, luego agregue un cucharón de caldo.", "Continúe cocinando el arroz, agregando un cucharón de caldo a la vez y revolviendo continuamente hasta que el líquido sea absorbido por el arroz. El arroz debe tomar alrededor de 18-20 minutos para cocinar.", "Una vez que el arroz esté tierno, retire la sartén del fuego y agregue el perejil y el parmesano.", "Divida el risotto entre cuatro platos para servir, rocíe con aceite de trufa y sirva."], "url": "www_bbc_co_uk_food_recipes_wildmushroomrisottow_90966", "title": "Risotto de hongos silvestres con aceite de trufa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de champiñones de castaña, en rodajas", "55g / 2oz de setas porcini secas", "2 dientes de ajo", "75ml / 3fl oz de aceite de oliva", "sal y pimienta", "perejil fresco, picado", "Baguette francés de 1 día"], "method": ["Remoje los champiñones secos en agua caliente durante al menos una hora.", "En una sartén grande, caliente el aceite de oliva y saltee el ajo por 2 minutos.", "Agregue las setas rebanadas y saltee durante 3 a 4 minutos.", "Agregue las setas secas y parte del agua, colada a través del papel de cocina, en el que los champiñones se han remojado.", "Cubra y cocine a fuego lento durante aproximadamente 10 minutos o hasta que el volumen del líquido se haya reducido.", "Espolvorear con el perejil picado y servir caliente.", "O bien, agregue un poco de crema o mascarpone para hacer una salsa cremosa para la pasta y cubra con queso parmesano y mantequilla.", "Para servir con crostini, corte la baguette en la diagonal y séquela en el horno, pero no la coloree."], "url": "www_bbc_co_uk_food_recipes_wildmushroomsoncrost_65558", "title": "Setas silvestres en crutones (champiñones salteados)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Chalotes de 60 g / 2 oz, picados", "50g / 2oz de mantequilla", "pizca de sal", "Setas silvestres de 400g / 14oz, recortadas (o setas secas de 250g / 9oz)", "570ml / 1 pinta de agua", "Stock de pollo de 290 ml / ½ pinta", "sal y pimienta negra recién molida, al gusto", "50g / 2oz de mantequilla", "100 g / 3½ oz de champiñones silvestres, preparados y lavados", "50-100 g / 2-3½ oz de avellanas"], "method": ["Sudor las chalotas en la mantequilla con una pizca de sal durante 3 minutos. No dejes que se coloreen.", "Agregue los champiñones y continúe sudando durante 5 minutos.", "Ahora agregue el caldo de agua y pollo (reemplace el caldo de pollo con agua para los vegetarianos).", "Llevar a ebullición y reducir a un verano. Cocine por 20 minutos.", "saltee los champiñones y las avellanas en mantequilla mientras la sopa hierve a fuego lento.", "Después de 20 minutos, vierta la sopa en un licuador y mezcle hasta que quede suave. Coloque en una cacerola y con una licuadora batir con la mantequilla restante. Corrija el aderezo y sirva adornado con champiñones y avellanas salteados."], "url": "www_bbc_co_uk_food_recipes_wildmushroomsoup_11367", "title": "Sopa de Hongos Silvestres", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wildmushroomsoup_11367_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 40 g / 1½ oz", "sal y pimienta negra recién molida", "1 conejo silvestre, cortado en ocho porciones", "2 cucharadas de aceite vegetal", "3 lonchas de tocino ahumado ahumado, cortadas en lardons", "1 cebolla, pelada, más o menos picada", "2 dientes de ajo, pelados, finamente picados", "2 ramitas de tomillo fresco, solo hojas", "40 g / 1½ oz de champiñones secos, empapados en 150 ml / 5 fl oz de agua tibia durante al menos 30 minutos", "200ml / 7fl oz de vino tinto", "350ml / 12fl oz de caldo de carne", "1 kg / 2 lb 2 oz patatas harinosas, como King Edward o Maris Piper, peladas, cortadas en trozos de igual tamaño", "75-110ml / 3-4fl oz de aceite de oliva virgen extra", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida", "4 cucharadas de perejil de flatleaf fresco picado, para servir"], "method": ["Para el estofado de conejo silvestre y morel, espolvorea la harina en un tazón y condimenta, al gusto, con sal y pimienta negra recién molida. Dragar las piezas de conejo en la harina sazonada hasta que esté completamente cubierto.", "Caliente el aceite en una cazuela grande a fuego medio. Agregue las piezas de conejo recubiertas, en tandas si es necesario, y freír durante 3-4 minutos en cada lado, o hasta que estén doradas por todos lados. Retire de la sartén y déjelo a un lado en un plato caliente.", "Agregue el tocino a la cazuela en la que se cocinó el conejo y fría durante 1-2 minutos, o hasta que se libere la grasa.", "Agregue la cebolla, el ajo y las hojas de tomillo y fría, revolviendo bien, durante 2-3 minutos, o hasta que el tocino esté crujiente y dorado, y las verduras se hayan ablandado.", "Agregue las colmenillas, el líquido empapado y el vino tinto a la cacerola y deje que la mezcla hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad, alrededor de 8-10 minutos.", "Cuando el líquido se haya reducido, agregue el caldo de carne y devuelva la mezcla a ebullición.", "Regrese las piezas de conejo doradas a la cazuela y sazone, al gusto, con sal y pimienta negra recién molida.", "Haga hervir a fuego lento el contenido de la cazuela, cubra la olla con una tapa y cocine a fuego lento durante 1-1½ horas, o hasta que la carne de conejo esté tierna y el líquido de cocción se haya espesado ligeramente.", "Mientras tanto, para el puré de aceite de oliva, hierva las papas en una sartén grande de agua con sal, durante 10-15 minutos, o hasta que estén tiernas. Escurrir bien.", "Regrese las papas a la sartén y caliéntelas a fuego lento durante 10-15 segundos para eliminar el exceso de humedad.", "Aplaste bien las papas con un triturador de patatas o ricer, luego agregue el aceite de oliva y la mantequilla y mezcle hasta que estén suaves y bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca una cucharada del puré de aceite de oliva en el centro de cada uno de los cuatro platos que sirven. Coloque dos trozos de conejo encima de cada porción de puré de aceite de oliva. Cuchara sobre el estofado. Espolvorea sobre el perejil de flatleaf."], "url": "www_bbc_co_uk_food_recipes_wildrabbitandmorelst_92455", "title": "Conejo salvaje y estofado de morel con puré de aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 x 150 g / 5 oz de filetes de salmón salvaje", "500 g / 1 libra de guisantes frescos de 2 oz, con las vainas retiradas", "1 cucharada de mejorana fresca, finamente picada", "2 cucharadas de mantequilla", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "200g / 7oz de tomates cherry maduros", "½ cucharadita de azúcar en polvo", "1 cucharadita de vinagre de vino tinto Cabernet", "sal de algas marinas (partes iguales de sal marina y tierra seca secada juntas en un mortero)", "2 ramitas de albahaca fresca"], "method": ["Calentar una sartén hasta que esté caliente y agregar el aceite de oliva. Coloque los filetes de salmón en la sartén, con la piel hacia abajo.", "Cocine el salmón durante tres minutos, luego déle la vuelta y cocine por otros tres minutos hasta que se cocine completamente. Retire del fuego y descanse en un lugar cálido.", "Para los guisantes triturados con mejorana, llevar una olla de agua a ebullición y agregar los guisantes envasadas.", "Cocine los guisantes durante 1-2 minutos, luego escurra y transfiera a un tazón con agua helada para que se enfríe. Cuando los guisantes estén frescos, escurrelos.", "Calentar una sartén pequeña hasta que esté caliente. Agregue los guisantes a la sartén junto con la mejorana y la mantequilla y caliente, aplastando ligeramente con una cuchara de madera. Mantener caliente", "Mientras el pescado y los guisantes se cocinan, prepare la salsa de tomate. Para la salsa de tomate de vid, mezcle la mostaza de Dijon, el vinagre de vino blanco y el aceite de oliva virgen extra en un tazón y sazone con sal y pimienta negra recién molida.", "Transfiera la mezcla de mostaza, los tomates cherry y el azúcar a una licuadora o procesador de alimentos y mezcle hasta que esté puro.", "Vierta la mezcla puré a través de un colador en un recipiente. Agregue el vinagre de vino tinto Cabernet y mezcle bien.", "Coloque un anillo de cocinero en el medio de un plato de servir individual y coloque la mitad de los guisantes dentro, presionando bien a los bordes. Retire el anillo. Repita con los guisantes restantes en otro plato.", "Coloque un filete de salmón en la parte superior de cada uno de los círculos de guisantes y cuchara la salsa. Termine con una pizca de sal de algas marinas y una ramita de albahaca cada una. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_wildsalmonandcrushed_86204", "title": "Salmón salvaje y guisantes triturados con mejorana y salsa de tomate de vid", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150 g / 5 oz de filetes de trucha de mar salvaje, piel anotada con un cuchillo afilado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "400g / 14oz sin cáscara guisantes frescos", "4 zanahorias medianas, peladas, cortadas en porras", "Tocino rayado ahumado de 200g / 7oz, cortado en lardons", "300g / 11oz de mantequilla fría, cortada en cubos", "400ml / 14fl oz de caldo de pollo", "4 lechugas Little Gem, corazones removidos, hojas separadas y trituradas", "4 cucharadas de crema de rábano picante"], "method": ["Para la trucha de mar, sazone los filetes de trucha de mar con sal y pimienta negra recién molida.", "Caliente el aceite en una sartén grande a fuego medio. Agregue los filetes de trucha, con la piel hacia abajo, y fría sin mover el pescado durante 4-5 minutos, o hasta que la piel esté crujiente y dorada.", "Apague el fuego, luego voltee los filetes de trucha y permita que la parte inferior de los filetes se cocine con el calor residual.", "Mientras tanto, para los guisantes y el rábano picante, pula los guisantes y los bastones de zanahoria en una sartén con agua salada hirviendo durante 1-2 minutos, o hasta que estén tiernos. Escurrir bien, refrescar en agua fría, luego drenar nuevamente.", "Escalde los lardons de tocino durante un minuto en una olla aparte de agua hirviendo, luego escurra bien.", "Caliente una cucharada de los cubos de mantequilla en una cacerola grande a fuego alto. Cuando la mantequilla esté espumosa, agregue los lardons de tocino escaldados y fría hasta que estén crujientes y dorados.", "Agregue las zanahorias escaldadas y los guisantes a la sartén con los lardons de tocino. Verter sobre el caldo de pollo y llevar la mezcla a ebullición, luego reduzca el fuego a fuego lento y cocine a fuego lento la mezcla durante 4-5 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue los cubos de mantequilla, unos pocos a la vez, a la mezcla, agitando la sartén con regularidad hasta que la mantequilla se derrita y la salsa se espese un poco antes de agregar los siguientes cubos.", "Agregue las hojas de lechuga Little Gem ralladas y la crema de rábano picante y revuelva bien, luego retire la sartén del fuego.", "Para servir, divida las verduras y la salsa por igual entre cuatro tazones para servir. Coloque un filete de trucha encima de cada porción. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_wildseatroutwithfres_91645", "title": "Trucha de mar salvaje con guisantes frescos y rábano picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 yema de huevo", "1 cucharada de mostaza Dijon", "50ml / 2fl oz de vinagre de nuez", "100ml / 3½fl oz de aceite vegetal", "sal y pimienta negra recién molida", "½ repollo rojo, finamente cortado", "½ corcho de jamón cocido, rallado"], "method": ["Coloque el huevo, la mostaza y el vinagre en un recipiente y mezcle. Agregue lentamente el aceite batiendo todo el tiempo hasta que se emulsione y la mezcla se parezca a la mayonesa. Agregue 25 ml / 1 fl oz de agua para aflojar y sazone con abundante sal y pimienta negra.", "Coloque el repollo en un recipiente y agregue el aderezo, mezcle bien para combinar y luego deje reposar durante al menos 15 minutos para que se marchite, preferiblemente hasta una hora.", "Apile sobre los platos y cubra con un poco de jamón triturado."], "url": "www_bbc_co_uk_food_recipes_wilted_red_cabbage_with_74108", "title": "Col roja marchita con corvejón de jamón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wilted_red_cabbage_with_74108_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Puerto rojo 750ml / 1pt 6fl oz", "500ml / 18fl oz de vino tinto", "1 hoja de laurel", "1 cucharadita de pimienta negra", "6 cápsulas de cardamomo", "Anís de 2 estrellas", "1 ramita de canela", "1 cucharadita de semillas de cilantro", "1 filete de una lubina salvaje de 3kg / 6lb / 10oz", "aceite vegetal, para freír", "1 manojo de hojas de repollo negro", "Crema doble 110ml / 4fl oz", "2 dientes de ajo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "110 g / 4 oz de ceps frescos, en rodajas de 1 cm / ½ de espesor", "50g / 2oz de mantequilla", "8 ostras frescas, descascaradas y secas", "Harina normal de 50g / 2oz", "2 huevos de gallinas camperas, golpeados", "200g / 7oz de pan rallado", "1 cucharada de vinagre de Cabernet Sauvignon (u otro vinagre de vino tinto de buena calidad)", "50g / 2oz de mantequilla"], "method": ["Para el licor de caza furtiva, coloque todos los ingredientes del licor de caza furtiva en una cacerola lo suficientemente grande como para caber la lubina.", "Coloque la sartén a fuego lento y caliente lentamente para infundir durante 30 minutos, hasta que el líquido se haya reducido en un cuarto.", "Piel el filete de lubina, cortado en cuatro porciones iguales y sazone con sal, luego déjelo a un lado durante diez minutos.", "Coloque el bajo en el licor de caza furtiva caliente - el líquido debe hervir a fuego lento - y cocine durante 6-8 minutos, o hasta que esté completamente cocido. Retire del licor de caza furtiva y manténgalo caliente.", "Ponga a hervir una olla grande de agua y cocine el cavolo nero por un minuto. Escurrir y refrescar en un tazón con agua helada, luego exprimir y secar. Corta el cavolo nero en finas tiras.", "Coloque la crema y el ajo en una sartén a fuego medio y deje que hierva. Reduzca el fuego a fuego lento hasta que el líquido se haya reducido a la mitad.", "Agregue el cavolo nero, sazone, sazone con sal y pimienta negra recién molida y caliente.", "Caliente el aceite vegetal a 190 ° C / 375 ° F en una freidora de grasa. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva y los ceps y fría por 2-3 minutos, o hasta que estén dorados por completo.", "Agregue la mantequilla, sazone con sal y pimienta negra recién molida y fría por otros dos minutos. Mantenga caliente hasta que esté listo para servir.", "Se draga las ostras en la harina, se sumerge en el huevo batido para cubrir, luego se sumerge en el pan rallado, asegurando que las ostras estén bien cubiertas.", "Agregue las ostras al aceite caliente y fría por 1-2 minutos o hasta que estén crujientes y doradas. Con cuidado, quite con una espumadera y escurra sobre papel de cocina.", "Vierta 110ml / 4fl oz del líquido de caza furtiva en una sartén pequeña y limpia a fuego medio.", "Agregue el vinagre de Cabernet Sauvignon y llévelo a ebullición. Reduzca el líquido a la mitad, luego retírelo del fuego y agregue la mantequilla, revuelva bien para espesar la salsa.", "Para servir, espolvorear el cavolo nero batido en platos, dispuestos ligeramente a un lado. Coloque una porción de lubina en la parte superior de cada pila de Cavelo Nero. Coloque los ceps y las ostras en los platos en el otro lado y termine con un chorrito de la salsa"], "url": "www_bbc_co_uk_food_recipes_wildseabasspoachedin_87456", "title": "Lubina salvaje escalfado en vino tinto con crema de cavolo nero, ceps y ostras crujientes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva", "1 gran espinaca", "1 nuez moscada entera, para rallar", "1 huevo de gallinas camperas", "vinagre de vino blanco", "sal marina y pimienta negra recién molida", "1 rebanada de masa fermentada, tostada"], "method": ["Calentar el aceite en una sartén a fuego medio, agregar la espinaca, una pequeña ralladura de nuez moscada y sazonar con sal y pimienta. Abra la tapa y cocine a fuego lento durante 1-2 minutos, hasta que se marchite.", "Mientras tanto, ponga a hervir un recipiente con agua y reduzca el fuego a fuego lento. Agregue un poco de vinagre de vino blanco y rompa suavemente el huevo lo más cerca posible de la superficie. Cocine por 2-3 minutos o hasta que el huevo esté cocido a su gusto.", "Para servir, coloque la espinaca en la tostada, cubra con el huevo y sazone con sal y pimienta."], "url": "www_bbc_co_uk_food_recipes_wilted_spinach_and_33071", "title": "Espinacas marchitas y huevo escalfado sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wilted_spinach_and_33071_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 tbsp / 90 ml de aceite de oliva virgen", "3 cucharadas / 45 ml de vinagre de vino o jugo de limón o lima", "2 dientes de ajo picados", "racimo pequeño de 3-4 hierbas, por ej. perejil, cilantro, tomillo, salvia o ajedrea, picado", "1 cucharadita / 5 ml de pimienta negra molida"], "method": ["Combine todos los ingredientes y cubra la carne, el pescado o las verduras. Deja en un lugar fresco.", "Agregue sal justo antes de comenzar a cocinar y use la marinada para hilvanar mientras cocina."], "url": "www_bbc_co_uk_food_recipes_wineoilandherbmarina_5311", "title": "Marinado de vino, aceite y hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Hace 135ml adobo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "125g / 4½oz de mantequilla fría, cortada en cubos", "30 g / 1 oz de azúcar en polvo", "1 huevo grande de gallinas camperas, golpeado", "4 manzanas Bramley grandes (aproximadamente 1,2 kg / 2 lb 10 oz), peladas, sin corazón y cortadas en pequeños trozos", "150 g / 5½ oz de azúcar en polvo", "275 g / 10 oz de moras frescas", "Harina normal 175g / 6oz", "100 g / 3½ oz de mantequilla, a temperatura ambiente, cortado en cubos", "50 g / 1¾oz de avena", "Azúcar demerara 100 g / 3½ oz", "Avellanas 50g / 1¾oz, asadas y picadas", "natillas o crema doble, para servir"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la masa, pulse la harina y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado (o frote los ingredientes juntos en un tazón grande con las yemas de los dedos).", "Agregue el azúcar, el huevo y 1-2 cucharadas de agua fría y vuelva a mezclar hasta que la mezcla se una como una masa homogénea.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y extiéndala en un círculo de 3 mm de grosor y lo suficientemente grande como para revestir la lata de tarta. Presione la masa en la base y los lados de la lata y haga un pequeño borde alrededor de la tapa con el exceso de masa. Pincha la base con un tenedor, luego enfría en el refrigerador por 15 minutos.", "Alinee la caja de repostería fría con papel de hornear y frijoles para hornear, luego cocine en el horno durante 12-15 minutos, o hasta que el borde de la masa esté dorado claro. Retire los frijoles para hornear y el papel, luego reduzca la temperatura del horno a 160 ° C / 140 ° Ventilador / Gas 3 y hornee por otros 8-10 minutos, o hasta que la caja esté crujiente y dorada por completo. Coloque la caja de repostería a un lado en su lata para que se enfríe, dejando el horno encendido.", "Para el relleno, coloque las manzanas, el azúcar y 2 cucharadas de agua en una cacerola grande y profunda con tapa y cocine a fuego medio, revolviendo suavemente, durante 4-5 minutos. Cubra la olla con la tapa y lleve la mezcla a fuego lento. Cocine a fuego lento, sin revolver, durante 5-10 minutos, o hasta que las manzanas se hayan suavizado pero aún conserven su forma.", "Revuelva las moras en las manzanas cocidas y continúe cocinando a fuego lento por otros 5-10 minutos, o hasta que toda la fruta esté tierna. Dejar de lado para enfriar.", "Mientras tanto, para la cobertura de crumble, coloque la harina y la mantequilla en un tazón grande para mezclar y frote los ingredientes con las puntas de los dedos, hasta que la mezcla se asemeje a pan rallado. Agregue los ingredientes restantes de crumble y frótelos en la mezcla hasta que se hayan formado pequeños grumos. (O bien, pulse todos los ingredientes de desmoronamiento de un procesador de alimentos; no es necesario lavarlo después de hacer la masa). Deje a un lado el relleno de crumble.", "Suspenda un colador sobre un recipiente y cuele las frutas cocidas, recogiendo los jugos. Coloque las frutas en la caja de pastelería cocida. (Si hay demasiada fruta para caber en la caja de pastelería, agregue la fruta restante al zumo de fruta reservado).", "Espolvoree el crumble encima de todo el relleno de fruta y hornee la tarta a 200C / 180C Fan / Gas 4 durante 20-25 minutos, o hasta que el crumble esté crujiente y dorado.", "Mientras tanto, hierva el jugo de fruta reservado en una cacerola durante 3-4 minutos, o hasta que espese a un jarabe.", "Sirva la tarta caliente, en rodajas, con el zumo de fruta extra sobre ella y flan o crema en el lado."], "url": "www_bbc_co_uk_food_recipes_winter_crumble_tart_74434", "title": "Tarta de crumble de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/winter_crumble_tart_74434_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más extra para engrasar", "2 chirivías grandes, peladas y en juliana", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "2 cabezas de achicoria roja, finamente trituradas", "¼ col roja, finamente triturada", "1 cebolla roja, en rodajas finas, remojada en agua helada durante 10 minutos y escurrida", "Avellanas de 25g / 1oz, tostadas, ligeramente trituradas, para adornar", "2 cucharadas de aceite de avellana", "1 cucharada de vinagre de Jerez", "1 cucharadita de mostaza Dijon", "1 naranja, jugo de 1, ralladura finamente rallada de ½"], "method": ["Para los nidos de chirivía, precaliente el horno a 200C / 180C Ventilador / Gas 6. Caliente el aceite en una sartén. Agregue las chirivías y mucha sal y pimienta, luego fríe durante unos minutos, hasta que se marchite y se suavice un poco, esto ayuda a eliminar parte del volumen. Dejar enfriar completamente, luego mezclar con el huevo.", "Engrase una lata de pastel de hadas de 12 hoyos o una lata de pudín de Yorkshire de cuatro hoyos con aceite. Cuele las chirivías para deshacerse de cualquier exceso de huevo; usted las quiere simplemente recubiertas para mantenerlas juntas, no para nadar en ellas.", "Divida la mezcla entre los agujeros, presionando hacia abajo el centro y empujando hacia arriba los lados para crear formas de nido. Hornee durante 20 minutos, o hasta que la pastinaca esté crujiente y dorada. Déjelo en la lata unos minutos antes de quitarlo.", "Para hacer la ensalada, coloca la achicoria, el repollo y la cebolla roja escurrida en un bol. Condimentar con sal y pimienta.", "Para preparar el aderezo, mezcle los ingredientes del aderezo y sazone. Vierta el aderezo sobre la ensalada y mezcle. Adorne con las avellanas tostadas.", "Sirva los nidos de chirivía con la ensalada."], "url": "www_bbc_co_uk_food_recipes_winter_salad_and_parsnip_81747", "title": "Ensalada de invierno y nidos de chirivía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rollos suizos de chocolate jumbo (no los de chocolate) o 4 de tamaño normal", "150ml / 5fl oz de alcohol de su elección, como ron, jerez o limoncello (opcional)", "2-3 litros / 3½-5 pintas de helado (chocolate o vainilla o ambos), ablandado pero aún congelado (no más de 12C / 54F)"], "method": ["Alinee el interior de un recipiente de vidrio mediano o un recipiente de pudín de 1.2 litros / 2 pinta con film transparente (asegúrese de que haya un montón de película adhesiva extra colgando por los lados).", "Corta los panecillos suizos en rebanadas de 1cm / ½. Coloque una rebanada en el medio en el tazón en la base, luego coloque otra al lado. Continúe hasta que todo el interior del recipiente esté alineado. Aplaste las rodajas suizas ligeramente juntas para que no queden espacios entre ellas. Cuando llegue a la parte superior del tazón, corte las rebanadas a la mitad si no le queda una entera.", "Use un pincel de pastelería para aplicar la esponja con el alcohol. Coloque el helado en el cuenco forrado, ajústelo para que esté completamente lleno. Ahora coloque la torta en el congelador y déjela durante la noche o al menos hasta que el helado esté completamente firme.", "Una vez que el helado esté firme, retire con cuidado la torta del cuenco con la película adhesiva para ayudarlo. Disfrútelo muy suavemente del cuenco con la película adhesiva. Si es demasiado difícil de quitar, caliente un poco el recipiente con sus manos o con cuidado pasando un cuchillo plano y sin filo entre el recipiente y la película adhesiva. Cuando la tarta esté suelta en el tazón y se sienta como si pudieras sacarla fácilmente, coloca un plato grande para servir encima del tazón y gira el tazón boca abajo para que el plato quede en el lugar correcto. Retire con cuidado el cuenco y despegue la película adhesiva."], "url": "www_bbc_co_uk_food_recipes_winter_swiss_roll_bowl_27318", "title": "Pastel de bollo suizo de invierno", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "1 cebolla, finamente rebanada", "3 dientes de ajo, en rodajas finas", "2 zanahorias, cortadas en trozos de 1.5cm / ¾in", "2 nabos, cortados en trozos de 1.5cm / ¾in", "1 papa grande (preferiblemente Maris Piper), cortada en trozos de 1.5cm / ¾in", "1 pastinaca grande, cortada en trozos de 1.5cm / ¾in", "2 cucharaditas de pimentón colmado (dulce), más extra para servir", "1 cucharadita colmada de pimentón ahumado en caliente", "1 x 400 g / 14 oz pueden cortar tomates", "1 cucharada de puré de tomate", "125 g / 4½oz de chorizo ​​(nos gusta el picante), despellejado y cortado en rodajas de 5 mm", "100 g / 3½ oz de lentejas Puy, enjuagadas y escurridas", "Stock de 1,75 litros / 3 pintas, hecho con 1 cubo de caldo de pollo", "100g / 3½oz cavolo nero, kale o greens de primavera, nervaduras duras removidas, trituradas en pedazos de 2cm / ¾in", "sal marina escamada y pimienta negra recién molida", "crema agria o crème fraîche, al gusto."], "method": ["Caliente el aceite en una cacerola grande antiadherente o en una cazuela grande a prueba de llamas y fríe la cebolla y el ajo suavemente durante cinco minutos, o hasta que estén suaves pero no coloreados, revolviendo ocasionalmente. Mientras la cebolla se fríe, corte las zanahorias, los nabos, las papas y la chirivía en trozos de aproximadamente 1.5 cm / in.", "Agregue las verduras de raíz a la sartén con la cebolla y el ajo y cocine a fuego lento durante cinco minutos, o hasta que comience a ablandarse, revolviendo ocasionalmente. Agregue el pimentón dulce y ahumado y fría por unos minutos. Agregue los tomates y el puré de tomate en la sartén, aumente el fuego un poco y cocine por 2-3 minutos, revolviendo regularmente.", "Agregue el chorizo, las lentejas Puy y el caldo en la sartén y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 45 minutos, o hasta que las verduras y las lentejas estén tiernas, revolviendo de vez en cuando.", "Agregue el cavolo nero, la col rizada o los verdes de primavera a la sartén con las verduras. Cocine durante cinco minutos o hasta que se ablanden, revolviendo regularmente.", "Sazone la sopa con sal y mucha pimienta negra recién molida. Servir en tazones hondos, con una cucharada de crema agria o crema fresca y una pizca de pimentón."], "url": "www_bbc_co_uk_food_recipes_winter_vegetable_soup_24185", "title": "Sopa de verduras de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, en rodajas", "2 dientes de ajo, en rodajas", "2 puerros, cortados en rodajas", "200g / 7oz de repollo negro, picado", "200 g / 7 oz de calabaza, cortadas en cubos y asadas hasta que estén doradas", "440 g / 15½ oz pueden cortar tomates", "salpicar vino blanco", "sal y pimienta negra recién molida", "Harina de 225g / 8oz", "3 cucharaditas de polvo de hornear", "pizca de sal", "100g / 3½oz de mantequilla en cubos", "Crema agria de 175ml / 6fl oz", "150ml / 5fl oz de aceite de oliva", "manojo de albahaca fresca", "½ limón, solo jugo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría hasta que se ablanden.", "Agregue los puerros y el cavolo nero y cocínelos durante 3-4 minutos.", "Agregue la calabaza, los tomates, el vino y la sazón, al gusto, con sal y pimienta negra recién molida. Cocine a fuego lento durante 5-6 minutos, luego divida entre cuatro platos individuales resistentes al horno o moldes.", "Para el relleno, coloque la harina, el polvo de hornear, la sal y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue la crema agria y pulse de nuevo hasta que se una como una masa muy pegajosa.", "Ponga las cucharadas de la cobertura sobre el contenido de cada molde, luego hornee durante 25 minutos, o hasta que estén crujientes y doradas.", "Para el aderezo, coloque el aceite, la albahaca y el jugo de limón en un procesador de alimentos limpio y mezcle hasta que quede suave.", "Sirva los zapateros en la mesa en sus moldes y cubra con una cuchara el aderezo."], "url": "www_bbc_co_uk_food_recipes_wintercobbler_90041", "title": "Zapatero de invierno", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "300ml / 10fl oz de leche entera", "1 vaina de vainilla, semillas raspadas", "6 yemas de huevo de gallinas camperas", "175g / 6oz de azúcar en polvo", "Cerezas negras de 200 g / 7 oz, sin piedras, picadas", "75ml / 3fl oz de agua", "4 yemas de huevo de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz", "110ml / 4fl oz vermouth rosso", "2 peras, peladas, cortadas longitudinalmente en 8 cuñas", "½ limón, solo jugo", "20 cerezas negras", "20 moras"], "method": ["Para el helado de cereza, caliente la crema, la leche y la vaina de vainilla hasta que hierva. Retire del fuego y reserve para infundir durante 5 minutos. Deseche la vaina de vainilla.", "Batir las yemas de huevo y 110 g / 4 oz del azúcar en un bol hasta que estén bien combinados. Vierta la mezcla de crema en los huevos, batiendo continuamente, hasta que estén bien combinados.", "Regrese la mezcla a la cacerola y continúe calentando a fuego lento, revolviendo continuamente hasta que la mezcla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara. (No permita que la mezcla hierva). Deje que se enfríe completamente.", "Mientras tanto, caliente las cerezas, dejando el azúcar impalpable y el agua en una cacerola, hasta que hierva. Hierva durante 4-5 minutos, o hasta que las cerezas se hayan descompuesto, luego mezcle un procesador de alimentos con un puré espeso.", "Revuelva la mezcla en una máquina para hacer helados hasta obtener una consistencia suave, luego agregue el puré de cereza. Transfiera a un recipiente hermético y ponga en el congelador durante al menos dos horas.", "Para el vermut sabayon, hierva un poco de agua en una sartén, luego reduzca el fuego hasta que el agua hierva a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Batir las yemas de huevo y la mitad del azúcar en el recipiente hasta que estén bien combinados.", "Incorpore gradualmente 75ml / 3 fl oz del vermut hasta que la mezcla se espese.", "Coloque las cuñas de pera, el vermut restante, el azúcar restante y el jugo de limón en una sartén y agregue suficiente agua para cubrir las peras. Cocine a fuego lento la mezcla durante 5-8 minutos, o hasta que las peras estén tiernas. Escurra y seque con papel de cocina.", "Para servir, divida las peras escaldadas, las cerezas y las moras entre cuatro platos para servir. Cuchara el vermut sabayón sobre la fruta y el calor, usando una soplete de cocina hasta que se dore. Saque el helado de cereza y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_winterfruitswithverm_93329", "title": "Frutas de invierno con sabayón de vermut y helado de cereza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ de col roja, finamente rebanada", "¼ de col verde, finamente rebanada", "2 zanahorias, peladas y cortadas en cerillas", "Nueces picadas, fuera de sus conchas, más o menos picadas", "4 cucharadas de aceite de nuez", "1 cucharada de jerez o vinagre de vino tinto", "½ cucharadita de mostaza Dijon", "sal y pimienta negra recién molida"], "method": ["Coloque el repollo en rodajas, las zanahorias y las nueces en un tazón grande.", "En un tazón pequeño, mezcle el aceite de nuez, el jerez o el vinagre de vino tinto y la mostaza. Sazone al gusto, con sal y pimienta negra recién molida, luego vierta sobre la ensalada y mezcle bien para cubrir.", "Para servir, apilar en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_wintersalad_89195", "title": "Ensalada de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wintersalad_89195_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["675g / 1½lb de puré de papa, todavía caliente", "Col rizada o berza de 225g / 8oz, cocida y picada", "Zanahorias 225 g / 8 oz, peladas, cocidas y trituradas", "125ml / 4fl oz de crema doble", "125ml / 4fl de leche en oz", "6 cebollas de primavera, en rodajas", "55 g / 2 oz de mantequilla, derretida"], "method": ["En un tazón grande, combine el puré de papa caliente con la col rizada cocida o el repollo savoy y las zanahorias.", "En una cacerola mediana, caliente suavemente la crema doble y la leche.", "Agregue las cebolletas y continúe cocinando a fuego lento hasta que las cebolletas se hayan ablandado y cocinado.", "Dobla la cremosa mezcla de cebolleta en las verduras machacadas.", "Coloque en un plato calentado.", "Sangre la superficie de la mezcla y vierta la mantequilla derretida sobre la parte superior para formar un charco de mantequilla.", "Servir."], "url": "www_bbc_co_uk_food_recipes_wintervegetablecolca_73661", "title": "Colcannon de verduras de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de oliva", "Calabaza de 250g / 9oz (como Muscat de Provence o Iron Bar), pelada, cortada en cubos de 2cm / 1in", "sal marina y pimienta negra recién molida", "½ cucharadita de aceite de oliva virgen extra", "½ cucharadita de aceite de avellana", "1 remolacha dulce, lavada, descuartizada", "1 remolacha dorada, lavada, descuartizada", "1 remolacha rubí, lavada, descuartizada", "4 piezas de calabaza, cada corte en rondas de 3 cm / 1,5 pulgadas de diámetro y altura con un cortador de pastelería", "2 cucharadas de aceite de oliva", "1 cucharada de aceite de oliva extra virgen", "sal marina y pimienta negra recién molida", "100ml / 3½fl oz de puerto de rubí", "100 ml / 3½ fl oz de vino tinto", "1 estrella de anís", "azúcar en polvo, al gusto", "1 cucharada de aceite de oliva", "1 pequeño puñado de hojas de remolacha baby", "100 g / 3½ oz de champiñones mixtos, como rebozuelos, girolles y trompettes", "exprimir jugo de limón", "sal marina y pimienta negra recién molida", "10g / ½ oz de perejil fresco de flatleaf, toscamente picado", "½ chirivía, pelada, cortada en tiras con un pelador de verduras, frita hasta que esté crujiente y dorada", "12 hojas de salvia frescas, fritas hasta que estén crujientes", "12 chalotes en escabeche"], "method": ["Para el puré de calabaza, caliente el aceite de oliva en una sartén antiadherente y fría la calabaza durante 4-5 minutos a fuego medio-bajo. Sazone con sal marina, pimienta negra recién molida y un chorrito de jugo de limón.", "Aumente el calor y cubra la bandeja con una tapa hermética. Continúe cocinando la calabaza por 8-10 minutos, o hasta que esté tierna. Transfiera a un procesador de alimentos y mezcle hasta obtener un puré suave. Poner en un tazón y sazonar, al gusto, con sal y pimienta negra recién molida. Mezcle el aceite de oliva virgen extra y el aceite de avellana. Ponga a un lado hasta que esté listo para servir.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Haga hervir a fuego lento una olla con agua y coloque un inserto de vapor en la parte superior. Coloque todas las remolachas en el vaporizador y hágalo durante 15-20 minutos o hasta que estén tiernas. Dejar enfriar un poco.", "Calentar el aceite de oliva en una sartén pequeña a prueba de horno, agregar las rondas de calabaza y freír durante 1-2 minutos por un lado, o hasta que estén doradas. Transfiera al horno y tueste durante 7-10 minutos, o hasta que estén dorados y tiernos.", "Mezcle la remolacha al vapor con el aceite de oliva virgen extra en una sartén pequeña y sazone al gusto con sal y pimienta negra recién molida. Calentar a fuego medio antes de servir.", "Para la salsa, caliente una sartén hasta que esté caliente y vierta cuidadosamente en el puerto, y reduzca el volumen a la mitad.", "Agregue el vino tinto y el anís estrellado a la sartén y cocine a fuego lento hasta que el líquido se reduzca en volumen en otros dos tercios, y es lo suficientemente grueso como para cubrir la parte posterior de una cuchara. Pruebe y agregue un poco de azúcar si los taninos en la salsa son demasiado fuertes. Cuela la salsa en un tazón pequeño.", "Para el hongo fricassée, caliente una sartén antiadherente hasta que esté caliente y agregue el aceite de oliva, las hojas de remolacha baby y los champiñones. Agregue un chorrito de jugo de limón y fría por un minuto, luego cubra la olla con una tapa y cocine por un minuto más.", "Agregue los girolles y fríalos durante 30 segundos más con la tapa puesta, luego quite la tapa y agregue los trompetas de la mort. Cocine por unos segundos más, luego sazone, a gusto, con sal y pimienta negra recién molida y agregue el perejil picado.", "Para servir, tome una cucharada de puré de calabaza y arrástrela en una línea a lo largo de la mitad de una placa rectangular. Coloque tres cuñas de remolacha a lo largo del puré (una de cada color). Coloque una ronda de calabaza asada en el otro extremo del puré de calabaza. Coloque la seta fricassée a cada lado de la calabaza. Cúbralo con unas cintas de chirivía fritas y hojas de salvia fritas, y coloque algunas chalotas encurtidas alrededor del plato. Rocíe la salsa. Repita el proceso tres veces más para crear cuatro porciones."], "url": "www_bbc_co_uk_food_recipes_wintervegetablesalad_93506", "title": "Ensalada de verduras de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Vodka negro 25ml / 1fl oz", "1 cucharada de jugo de limón", "2 cucharaditas de extracto de vainilla", "Licor de zarzamora 25ml / 1fl oz", "25ml / 1fl oz de jugo de manzana fresca", "", "1 litchi, pelado", "½ cucharadita de mermelada de fresa", "1 arándano"], "method": ["Coloque el vodka, el jugo de limón, el jarabe de vainilla, el licor de zarzamora y el jugo de manzana en una coctelera llena de hielo y agite bien. Vierta en una copa de cóctel.", "Para adornar, corte un pequeño agujero en el lichi. Rellene con mermelada de fresa, luego pegue el arándano en el atasco para crear un \"globo ocular\". Flote el \"globo ocular\" en el cóctel y sirva."], "url": "www_bbc_co_uk_food_recipes_witchcraft_90056", "title": "Brujería", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]