[{"isVegetarian": false, "title": "Peppered beef fillet with polenta chips and salad", "url": "www_bbc_co_uk_food_recipes_peppered_beef_fillet_61512", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz polenta", "40g/1½oz unsalted butter", "75g/2½oz Parmesan cheese, finely grated", "1 tsp sea salt", "vegetable or sunflower oil, for deep frying", "4 x 150–200g/5½–7oz fillet steaks", "½ tsp Kampot peppercorns", "½ tsp white peppercorns", "½ tsp black peppercorns", "½ tsp green peppercorns", "½ tsp pink peppercorns", "75g/2½oz unsalted butter", "2 shallots, finely chopped", "150ml/5fl oz brandy", "150ml/5fl oz crème fraîche", "selection of seasonal leaves", "3 tbsp olive oil", "1 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the polenta and Parmesan chips, line a baking tray with baking parchment.", "Bring 570ml/1 pint of water to the boil in a large saucepan. Gradually whisk in the polenta and then the butter. Finish with the cheese and salt. Pour into the lined baking tray and leave to set in the fridge for at least an hour.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. ", "Cut the polenta into chip shapes. Deep-fry for 3–5 minutes or until golden and crisp. Place on a plate with kitchen roll to drain off the excess fat.", "For the beef, crush all the peppercorns in a pestle and mortar. Press the pepper into the steaks. Heat a frying pan, add the butter and cook the steaks to your liking. Remove the steaks from the pan and leave to rest.", "In the same pan, make the sauce. Cook the shallots for 2 minutes. Pour in the brandy and scrape off the cooked on bits. Cook until the brandy has reduced in volume by at least a half. Finish with the crème fraîche.", "For the salad, mix the leaves in a bowl. Whisk the oil and the vinegar together in a small bowl. Just before serving pour the dressing over the leaves and toss together.", "Serve the steaks with the sauce poured over, with the polenta chips and dressed salad."]}, {"isVegetarian": false, "title": "Peppered beef with salad leaves", "url": "www_bbc_co_uk_food_recipes_peppered_beef_with_salad_27535", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppered_beef_with_salad_27535_16x9.jpg", "ingredients": ["2 thick-cut sirloin steaks, about 175g/6oz in total, fat trimmed", "1 tsp coloured peppercorns, coarsely crushed", "coarse salt flakes", "60g/2¼oz natural yoghurt", "½ tsp horseradish sauce (to taste)", "½ garlic clove, crushed", "50g/2oz mixed green salad leaves", "30g/1¼oz button mushrooms, sliced", "½ red onion, thinly sliced", "1 tsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the steaks with the crushed peppercorns and salt flakes.", "Mix together the yoghurt, horseradish sauce and garlic and season to taste with salt and freshly ground black pepper. Add the salad leaves, mushrooms and most of the red onion and toss gently.", "Heat the oil in a frying pan, add the steaks and cook over a high heat for 2 minutes, or until browned. Turn over and cook for a further 2 minutes for medium rare, 3-4 minutes for medium or 5 minutes for well done. Place the steak on a warm plate and allow to rest for a few minutes. ", "Spoon the salad leaves into the centre of 2 serving plates. Thinly slice the steaks and arrange the pieces on top. Garnish with the remaining red onion."]}, {"isVegetarian": false, "title": "Peppered chicken, bacon, mozzarella and guacamole in soy and linseed bread", "url": "www_bbc_co_uk_food_recipes_pepperedchickenbacon_83637", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 mini chicken fillets ", "1 tbsp finely crushed black peppercorns", "1 tbsp olive oil", "4 rashers back bacon ", "1 avocado, roughly chopped ", "½ red onion, finely chopped", "½ lemon, juice only", "1 red chilli, finely chopped", "½ tsp ground cumin", "2 tbsp roughly chopped fresh coriander", "salt and freshly ground black pepper", "4 slices soy and linseed bread", "2 tbsp ready-made mayonnaise ", "1 ball buffalo mozzarella, thickly sliced", "4 cooked beetroot or 2 fresh tomatoes, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Flatten the mini breast fillets with a meat mallet or rolling pin, until ½cm thick.", "Sprinkle the chicken with crushed peppercorns to lightly coat.", "Heat a frying pan until hot, then add the oil and the chicken. Fry for 2-3 minutes on each side, until tender golden and completely cooked through.", "Heat a second frying pan until hot, then add the bacon and fry until golden.", "Meanwhile, place the avocado into a bowl and mash with a fork.", "Add the red onion, lemon, chilli, cumin and coriander, season with salt and freshly ground black pepper and mix well.", "To assemble the sandwiches, spread the mayonnaise onto two slices of the bread. Top with the bacon, then the chicken, then the mozzarella slices. Spread the guacamole onto two more slices of the bread. Top each sandwich with lots of tomato or beetroot slices and close with the slice of guacamole-covered bread."]}, {"isVegetarian": false, "title": "Peppered duck breast with wild mushrooms and cream", "url": "www_bbc_co_uk_food_recipes_pepperedduckbreastwi_70257", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 female Barbary duck breasts", "2-3 tbsp black peppercorns, cracked", "50ml/2fl oz cognac", "100ml/3½fl oz light gravy (or chicken stock reduced and thickened with arrowroot)", "100ml/3½fl oz double cream", "110g/4oz shiitake mushrooms", "110g/4oz oyster mushrooms", "30g/1oz dried black trumpet mushrooms, soaked and drained", "25ml/1fl oz light olive oil", "2 tbsp butter", "110g/4oz fresh spinach", "8 sprigs flatleaf parsley to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the duck breasts and lightly score the skin side with a sharp knife. ", "Spread the cracked peppercorns on to the duck breasts, pressing down the pepper into the breasts. Season with salt. ", "Heat a large pan over a moderate heat, and place the duck breasts in, skin-side down. Let them cook for 5 minutes or until the skin is nicely golden and crisp. ", "Turn the breasts over, and cook for approximately 4 minutes more. ", "Remove the duck breasts from the pan, and keep warm. ", "Pour off the fat, and deglaze the pan with the cognac. ", "Add the gravy (or stock), stirring well to scrape up the caramelised juices.", "Add the cream and simmer to reduce to sauce consistency.", "Fry the mushrooms in the olive oil, and half of the butter. ", "Fry off the spinach in the remaining butter. ", "Mix the two together. ", "To serve, spoon the spinach and mushroom mixture on to warmed plates. Slice the duck breasts, and arrange on top of the spinach mixture. Surround with the sauce."]}, {"isVegetarian": false, "title": "Peppered duck with cherries, lovage and elderflower dressing", "url": "www_bbc_co_uk_food_recipes_pepperedduckwithcher_86500", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts", "4tsp black peppercorns", "1 tbsp vegetable oil", "125g/5oz cherries, stones removed", "50ml/2fl oz elderflower cordial", "50ml/2fl oz cider vinegar", "100ml/4fl oz rapeseed oil", "salt, to taste", "75g/3oz Bull's Blood lettuce, or other red-leafed variety of lettuce", "25g/1oz lovage leaves or celery leaves", "25g/1oz fresh elderflower petals", "½ punnet mustard cress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the duck breast and remove any excess sinew. Score the skin lightly with a sharp knife.", "Put the peppercorns in a pestle and mortar and crush.", "Roll each duck breast in the peppercorns then season to taste with salt.  ", "Heat a frying pan until hot then add the vegetable oil and the duck breasts, skin-side down.", "Cook for about one minute then reduce the heat and cook for about five minutes on each side, or until cooked to your own liking. (This amount of time will give you medium-rare meat.)", "Remove the duck from the pan and rest on a wire rack over a plate.", "To make the dressing, place the cherries and elderflower cordial into a saucepan and bring to a gentle simmer. Do not boil - just let the cherries warm through and bleed their colour into the cordial until it takes on a pink colour.", "Remove the saucepan from the heat and allow the mixture to cool.", "Remove the cherries from the mixture and set them aside.", "Whisk in the cider vinegar and rapeseed oil. Add a pinch of salt to taste and return the cherries to the pan.", "To serve, place the lettuce leaves, lovage and cress into a bowl and add  a little of the dressing.", "Cut the duck breasts into thin slices. Layer the salad and duck onto a plate. Spoon some more dressing around the outside of the salad and finish off with a sprinkling of the elderflower petals."]}, {"isVegetarian": true, "title": "Peppered goats' cheese salad with balsamic blueberry sauce", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheeses_80867", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz soft goats cheese, cut into rounds", "1 tsp coarsely ground black pepper", "1 tbsp olive oil", "2 shallots, roughly chopped", "1 tbsp balsamic vinegar", "75g/2¾oz blueberries", "½ tsp freshly ground black pepper", "100g/3½oz chopped mixed fresh herbs (flatleaf parsley, chervil, dill, coriander, basil, chives)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the goats' cheese salad, place a griddle pan over a high heat until it begins to smoke.", "Roll the goats' cheese in the coarsely ground black pepper and place onto the griddle pan to cook for two minutes on each side.", "To make the sauce, heat the olive oil in a small frying pan over a medium heat. Add the shallot and fry until soft.", "Add the balsamic vinegar, blueberries and freshly ground black pepper, then bring to the boil and reduce the liquid volume by half.", "To serve, place the mixed herb salad in the centre of the plate. Place the grilled goats' cheese on top and pour over the sauce."]}, {"isVegetarian": false, "title": "Peppered goats' cheese with Cumberland sauce and pickled walnuts", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_84776", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz cracked black peppercorns", "4 x 75g/3oz round slices goats' cheese", "4 slices granary or walnut bread, cut into circles larger than the goats' cheese rounds, toasted", "knob of butter", "2 shallots, finely sliced", "thumb-sized piece fresh ginger, grated", "75ml/3fl oz port", "150ml/5fl oz chicken stock", "250g/9oz redcurrant jelly", "1 tsp green peppercorns in brine, rinsed and drained", "pickled walnuts from a jar, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Pour the cracked black peppercorns onto a plate. Press one side of each of the goats' cheese rounds into the peppercorns.", "Place the goats' cheese rounds onto the bread rounds, peppered-side up and place under the grill for four minutes, or until the cheese is soft and melted.", "For the Cumberland sauce, melt the butter in a frying pan over a medium heat. Add the shallots and the ginger and fry for 2-3 minutes, until soft.", "Add the port and boil until the liquid reduces to a very thick syrup, then add the stock.", "Bring the stock to the boil, then add the redcurrant jelly and the green peppercorns and reduce the heat to simmer for 2-3 minutes, or until the jelly has completely dissolved.", "To serve, place the cheese on toast onto a warmed plate. Drizzle the sauce over the cheese and sprinkle with pickled walnuts."]}, {"isVegetarian": true, "title": "Peppered goats' cheese with peach salsa", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_85128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp black peppercorns, roughly crushed", "150g/5½oz goats' cheese, cut into three pieces", "1 ripe peach, peeled and chopped ", "squeeze lemon juice", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the peppered goats' cheese, place the crushed peppercorns into a shallow dish. Press one side of each piece of goats' cheese in the crushed peppercorns. ", "Heat a small frying pan over a medium heat and fry the cheese for three minutes on each side.", "For the peach salsa, place the peach pieces, lemon juice and parsley into a bowl and mix well.", "To serve, place the goats' cheese pieces onto a small plate and spoon over the salsa."]}, {"isVegetarian": true, "title": "Peppered goats' cheese with rocket salad", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_85493", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ firm goats' cheese, cut into cubes", "2 tsp black peppercorns, lightly crushed ", "1 tsp olive oil", "1 small bunch rocket, roughly chopped", "1 tsp olive oil", "½ tsp balsamic vinegar", "salt and freshly ground black pepper ", "1 cooked beetroot, cut into cubes, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the peppered goats' cheese, roll the cubes of cheese in black pepper to coat on all sides.", "Heat the olive oil in a small frying pan and fry the cheese until golden-brown and crisp on all sides.", "For the rocket salad,  place the rocket in a bowl and drizzle over the oil and vinegar. Season with salt and freshly ground black pepper and stir well to coat the leaves.", "To serve, place the rocket salad onto a plate and top with the peppered goats' cheese and beetroot."]}, {"isVegetarian": true, "title": "Peppered goats' cheese with hot tomato dressing on bruschetta", "url": "www_bbc_co_uk_food_recipes_pepperedgoatscheesew_87296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices white crusty bread", "4 tbsp olive oil", "100g/3½oz round goats' cheese", "1 tbsp crushed peppercorns", "½ beef tomato, diced", "½ tsp chilli flakes", "1 tbsp balsamic vinegar", "small handful each fresh basil and coriander leaves"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Brush the bread with half of the oil. Toast the bread on a hot griddle pan.", "Slice the goats' cheese in half to make two discs and coat in the crushed peppercorns. Griddle in the pan for about one minute on each side until just melted and golden-brown. ", "Place the tomato, chilli flakes, remaining oil and vinegar together in a small saucepan and heat through, stirring well. Turn off the heat and leave to one side.", "Arrange the basil and coriander on two plates. Place a slice of bruschetta on the side and place the goats' cheese on top. Pour over the hot tomato dressing and serve immediately."]}, {"isVegetarian": true, "title": "Peppered, griddled goats' cheese", "url": "www_bbc_co_uk_food_recipes_pepperedgriddledgoat_78709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz goats' cheese, with rind", "1 tsp olive oil", "freshly ground black pepper", "mixed herb salad (coriander, basil, flatleaf parsley)", "olive oil, to dress salad"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan and drizzle with the oil.", "Grind fresh black pepper generously all over the goats' cheese and place onto the griddle for 3-4 minutes, turning once.", "Place on the herb salad and dress with olive oil."]}, {"isVegetarian": false, "title": "Peppered monkfish with sweet potato fondant", "url": "www_bbc_co_uk_food_recipes_pepperedmonkfishwith_76069", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz unsalted butter", "1 garlic clove, peeled and crushed", "½ sweet potato, peeled and sliced", "1 tsp fresh thyme leaves", "70ml/2½fl oz chicken or vegetable stock", "200g/7oz monkfish, cut into chunks", "1 tbsp fresh ground black pepper", "1 tsp ginger, grated ", "1 tbsp olive oil", "splash double cream", "1 tsp soy sauce", "4 slices pancetta", "chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "To make the fondant, gently melt the butter in a pan. Add the garlic and sweet potato slices. Sprinkle in the thyme and then pour in the chicken or vegetable stock. Transfer to the oven and cook for 10-15 minutes, or until the potato is tender.", "For the monkfish, sprinkle the pepper and ginger over the fish. Heat the oil in a pan and cook the fish for 4-6 minutes. Add the cream and soy sauce to the pan and reduce for a further few minutes.", "Heat a non-stick frying pan until hot. Cook the pancetta for two minutes on each side, until crispy.", "To serve, remove the sweet potato from the oven and transfer to a serving plate. Top with the peppered monkfish and serve the crispy pancetta on top. Garnish with chives."]}, {"isVegetarian": false, "title": "Peppered pork tenderloin with chips and rocket salad", "url": "www_bbc_co_uk_food_recipes_pepperedporktenderlo_90711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz pork tenderloin, sliced into three medallions", "salt and freshly ground black pepper", "1 tbsp olive oil", "6 Anya potatoes, cut into thick chips", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 handful rocket leaves", "1 tomato, chopped", "½ lemon, juice only", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the pork medallions between two sheets of cling film and flatten out to the thickness of a pound coin, using a meat mallet or rolling pin. Remove the cling film and season with salt and freshly ground black pepper.", "Heat the oil in a frying pan and fry the medallions for 3-4 minutes on both sides, or until golden-brown all over and cooked through. Set aside on a warm plate to rest. ", "For the chips, place the potato pieces into a roasting tin, drizzle with the olive oil and season with salt and freshly ground black pepper. Transfer to the oven to roast for 12-15 minutes, turning the potatoes occasionally to ensure they brown evenly. ", "For the salad, combine all of the salad ingredients together in a bowl.", "To serve, place the pork medallions on a serving plate with the chips and salad alongside."]}, {"isVegetarian": false, "title": "Peppered pork with citrus garlic sauce and potato and bean mash", "url": "www_bbc_co_uk_food_recipes_pepperedporkwithcitr_85557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 150g/5½oz pork chops, bones removed and fat trimmed off ", "1 tbsp black peppercorns", "1 tbsp coriander seeds ", "1 tbsp sea salt", "2 tbsp chopped fresh parsley", "1 tbsp olive oil", "1 tbsp olive oil", "½ onion, finely sliced", "200g/9oz new potatoes, boiled until tender and drained", "50g/1½oz broad beans, blanched, skins removed", "50g/1½oz unsalted butter", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper ", "50g/1½oz unsalted butter", "1 tbsp olive oil", "2 garlic cloves, finely chopped", "50ml/2fl oz white wine", "1 orange, juice only", "1 tbsp olive oil", "2 orange slices"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the peppered pork, place the pork chops between two sheets of cling film and flatten with a meat mallet or rolling pin.", "Place the peppercorns, coriander seeds and salt into a pestle and mortar. Grind together, then place the spice mixture into a bowl. Add the parsley and stir well. Rub the spice mixture all over the pork.", "Heat the oil in a frying pan and cook the pork for 3-4 minutes on each side, or until completely cooked through. Remove from the pan and leave to rest.", "For the potato and bean mash, heat the oil in a pan and gently fry the onion until softened.", "Place the cooked potatoes into a large bowl with the broad beans and butter and mash together using a potato masher. Add the chives, season with salt and freshly ground black pepper and mix well.", "For the citrus garlic sauce, heat the butter and oil in a pan and gently fry the garlic for one minute.", "Add the wine and orange juice and simmer until reduced by half.", "For the caramelised oranges, heat the oil in a frying pan and cook the orange slices for a minute on each side, until caramelised.", "To serve, place the potato and bean mash onto plates and top with the peppered pork. Drizzle over the sauce and top with the caramelised orange slices."]}, {"isVegetarian": false, "title": "Peppered steak with roasted carrots, red onion relish and mustard mash", "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithroa_85345", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz rump steak", "1 tbsp olive oil", "1 tbsp whole peppercorns, crushed", "1 carrot, peeled, roughly chopped and blanched", "1 tbsp olive oil", "salt and freshly ground black pepper ", "25g/1oz unsalted butter", "1 tbsp olive oil", "½ red onion, chopped", "1 tbsp brown sugar", "50ml/2fl oz red wine", "1 tbsp red wine vinegar", "salt and freshly ground black pepper", "25g/1oz unsalted butter", "1 tbsp olive oil", "50ml/2fl oz whole milk", "1 tbsp wholegrain mustard", "1 potato, peeled, cut into cubes and boiled until tender", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a non-stick baking sheet in the oven at 200C/400F/Gas 6.", "For the steak, rub the steak all over with oil and press into the peppercorns to coat the steak.", "Heat a griddle pan until very hot and chargrill the steak for 2-3 minutes on each side. Place the steak onto the preheated baking sheet.", "Place the carrots onto the baking sheet with the steak, drizzle with oil, season with salt and freshly ground black pepper and place into the oven to roast for 4-5 minutes. Remove the beef from the oven when cooked to your liking and leave to rest. Leave the carrots to continue roasting until beginning to turn golden-brown.", "For the red onion relish, heat the butter and oil in a saucepan over a medium heat and cook the onion until softened but not coloured.", "Add the brown sugar, stir well to coat the onions and cook until caramelised. Add the red wine and vinegar, bring to the boil and simmer until thickened. Season with salt and freshly ground black pepper.", "For the mustard mash, place the butter, oil, milk and mustard into a large bowl with the potato. Season with salt and freshly ground black pepper and mash with a potato masher until smooth.", "To serve, place the steak onto a plate with the carrots and mash and a spoonful of relish."]}, {"isVegetarian": false, "title": "Peppered steak with roasted asparagus, 'drunken' potatoes, roasted tomatoes and mustard sauce", "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithroa_88528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz sirloin steak", "1 tbsp olive oil", "1 garlic clove, finely chopped", "1 tsp black peppercorns, cracked in a pestle and mortar", "1 bunch asparagus, trimmed", "2 tomatoes, halved", "3 tbsp olive oil", "salt and freshly ground black pepper", "2 tsp caster sugar", "1 tbsp olive oil", "25g/1oz butter", "100g/3½oz Anya potatoes, sliced into 1cm/½in thick slices", "75ml/2½fl oz white wine", "salt and freshly ground black pepper", "75ml/2½fl oz white wine", "1 tsp Dijon mustard", "75ml/2½fl oz double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the peppered steak, rub the steak with the oil and press the chopped garlic and cracked pepper onto one side. Heat a griddle pan until smoking hot and sear the beef on both sides, then transfer the pan to the oven to continue cooking for about five minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place.", "For the roasted asparagus and tomatoes, place the asparagus and tomatoes onto a baking sheet and drizzle over the olive oil. Season with salt and freshly ground black pepper. Sprinkle the sugar over the tomatoes. Place in the oven to roast for about 6-7 minutes, or until tender.", "For the 'drunken' potatoes, heat the oil and butter in an ovenproof frying pan and fry the potato slices until they start to colour. Add the wine and season, to taste, with salt and freshly ground black pepper. Transfer the pan to the oven for about 5-7 minutes, or until the potatoes are tender.", "For the mustard sauce, heat the wine in a small pan and simmer until reduced by half. Stir in the mustard and cream and bring to a simmer.", "To serve, place the 'drunken' potatoes onto a serving plate. Slice the beef and arrange on top, followed by the asparagus and tomatoes. Drizzle over the mustard sauce."]}, {"isVegetarian": false, "title": "Peppered steak with wild mushroom sauce and sweet potato chips", "url": "www_bbc_co_uk_food_recipes_pepperedsteakwithwil_86269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 250g/9oz sirloin steak", "1 garlic clove, halved", "olive oil, for drizzling", "2 tsp black peppercorns, crushed", "1 tbsp olive oil", "25g/1oz butter", "½ onion, sliced", "1 garlic clove, chopped", "70g/2½oz mixed wild mushrooms, chopped", "splash white wine", "3 tbsp double cream", "salt and freshly ground black pepper ", "1 medium sweet potato, peeled, cut into chips", "2 tbsp olive oil", "sea salt, for sprinkling", "1 tbsp chopped fresh parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the peppered steak, rub the steak with the cut side of the garlic, rub with olive oil and roll in the peppercorns to coat all over.", "Heat a frying pan and fry the steak for 3-4 minutes on each side, or until cooked to your liking. Remove from the heat and leave to rest in a warm place.", "For the wild mushroom sauce, heat the olive oil and butter in a pan, add the onion and sauté for 3-4 minutes.", "Add the garlic and fry for one minute.", "Add the mushrooms and cook for 3-4 minutes. Add the wine and simmer for 2-3 minutes, then stir in the cream and season well with salt and freshly ground black pepper.", "For the chips, place the sweet potato chips onto a baking sheet, drizzle with oil and sprinkle with sea salt.", "Transfer to the oven and bake for 15-20 minutes, or until crisp.", "To serve, place the chips onto a serving plate, top with the steak and pour over the wild mushroom sauce. Garnish with parsley."]}, {"isVegetarian": false, "title": "Peppered venison with roasted tomatoes and red wine vinaigrette", "url": "www_bbc_co_uk_food_recipes_pepperedvenisonwithr_84746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz venison fillet", "1 tsp black peppercorns, crushed", "pinch salt", "1 tbsp olive oil, plus extra for rubbing", "150ml/¼ pint red wine", "½ large banana shallot, peeled, chopped", "2 tbsp red wine vinegar", "pinch caster sugar", "handful each fresh coriander, parsley and chives, chopped", "200g/7oz vine cherry tomatoes", "3 garlic cloves, unpeeled", "2 tbsp olive oil", "1 tbsp cobnuts, shelled, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub a little olive oil over the venison fillet. Place the crushed black peppercorns onto a plate and roll the venison over the peppercorns to coat it, then sprinkle with salt. ", "Heat the 1 tbsp olive oil in a frying pan and place the venison into the pan to fry for 2-3 minutes on each side, or until cooked to your liking. Set aside to rest in a warm place.", "For the red wine vinaigrette, place the red wine, chopped shallot, vinegar and sugar into a small saucepan and simmer over a high heat for 8-10 minutes, or until reduced by half. Remove the pan from the heat, add the herbs to the vinaigrette and set aside in a warm place.", "For the roasted tomatoes, place the tomatoes, garlic, olive oil and cobnuts into a small roasting tin, season well with salt and freshly ground black pepper and stir to mix.", "Transfer the tomatoes to the oven to roast for 10-12 minutes, or until softened and slightly charred at the edges. Remove the garlic cloves and discard.", "To serve, slice the venison fillet into thick slices and place onto a serving plate with the roasted tomatoes on top and the vinaigrette poured over."]}, {"isVegetarian": true, "title": "Peppermint creams", "url": "www_bbc_co_uk_food_recipes_peppermint_creams_00124", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppermint_creams_00124_16x9.jpg", "ingredients": ["1 free-range egg white", "½ lemon, juice only", "1 tsp peppermint flavouring", "425g/15 oz icing sugar, plus extra for dusting", "175g/6¼oz dark chocolate"], "serves": "Makes 15-20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg white in a bowl until stiff peaks form when the whisk is removed. Slowly whisk in the lemon juice, peppermint and icing sugar to a stiff paste.", "Tip the peppermint mixture onto a work surface dusted liberally with icing sugar and roll out thinly.", "Use a 5cm/2in cutter to cut out circles and place them onto a baking tray. Chill in the fridge for 1-2 hours, or until the mixture has set.", "Meanwhile, melt the chocolate in a bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water.)", "Dip each peppermint cream into the melted chocolate and set aside on a baking tray. Chill the peppermint creams until set."]}, {"isVegetarian": false, "title": "Pepperoni pizza", "url": "www_bbc_co_uk_food_recipes_pepperoni_pizza_46786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz strong white flour, plus extra for dusting", "1x 7g sachet fast-action yeast", "1½ tsp salt", "175ml/6fl oz warm water", "3 tbsp extra virgin olive oil, plus extra for greasing", "100ml/3½fl oz passata", "1 roasted red pepper, skin removed, sliced (or 200g/7oz jar small, piquant roasted peppers, available from delicatessens and online)", "200g/7oz pepperoni, sliced into rounds", "200g/7oz mozzarella, broken into pieces or sliced", "drizzle extra virgin olive oil", "few sprigs fresh basil leaves", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/220 Fan/Gas 9. ", "For the pizza dough, place the flour, yeast and salt into a large mixing bowl and stir to combine. Make a well in the centre of the dry ingredients and pour in the warm water and oil. Mix the wet ingredients into the dry ingredients using first a wooden spoon, then your hands, until the mixture comes together as a soft ball of dough. ", "Turn out the dough onto a lightly floured work surface and knead it thoroughly for 8-10 minutes, or until the dough has become smooth and springy to the touch and is no longer sticky. Use a floured finger to make an indent in the surface of the dough; it should spring back when the dough is ready.", "Dust the work surface again with a little more flour, then roll out the pizza dough, moving it around on the work surface as you roll to keep the shape circular and prevent the dough from sticking, until you have a large, thin disc. Press your fingertips down into the dough all over the pizza base. This prevents it from rising too much during cooking.", "For the topping, spread the passata over the pizza base, leaving a 2cm/1in gap around the edge. Season, to taste, with salt and freshly ground black pepper. Scatter over the roasted pepper slices, pepperoni slices and pieces of mozzarella. ", "Bake the pizza in the oven for 10-15 mins, or until the base is crisp and starting to char around the edges. Before serving, drizzle over a little olive oil, garnish with the basil sprigs, and season again with a grinding of black pepper."]}, {"isVegetarian": false, "title": "Pepperpot stew with spillers dumplings", "url": "www_bbc_co_uk_food_recipes_pepperpotstewwithspi_91703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz stewing beef, such as shin, fat and sinew trimmed, cut into small pieces", "4 sprigs fresh thyme, leaves only", "6 allspice berries", "1 bay leaf", "1 garlic clove, peeled, finely chopped", "10cm/4in piece root ginger, peeled, very finely sliced", "1 onion, peeled, chopped", "1.2 litres/2 pints beef stock or water, mixed with 2 tsp yeast extract", "salt and freshly ground black pepper", "450g/1lb yam or potato, peeled, cut into 3cm/1¼in pieces", "400g/14oz sweet potato, peeled, cut into 4cm/1¾in pieces", "450g/1lb pumpkin or butternut squash, peeled, cut into 4cm/1¾in pieces", "4 large spring onions, trimmed, lightly crushed with the edge of a knife", "2-4 Scotch bonnet chillies, finely chopped", "1 x 400ml/14fl oz can coconut milk", "1 x 400g/14oz can butter beans, drained and rinsed", "150g/5½oz spinach or callaloo, leaves only, washed, shredded", "150g/5½oz plain flour", "pinch salt", "4-5 tbsp cold water"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pepperpot stew, place the stewing beef, thyme leaves, allspice, bay leaf, garlic, ginger, onion and stock into large, heavy-based, lidded saucepan. Season, to taste, with salt and freshly ground black pepper. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Cover and simmer for 20-25 minutes.", "Add the vegetables, Scotch bonnet chillies, coconut milk and butter beans to the pan and stir well to combine. Return the mixture to a simmer and continue to cook, covered, for a further 15-20 minutes.", "Meanwhile, for the spillers dumplings, in a large bowl, mix together the flour and salt. Add the water, little by little, stirring until the mixture comes together as a smooth dough. Set aside.", "After the stew has cooked for 20 minutes, add the callaloo or spinach, stir well, and continue to simmer the mixture for 4-5 minutes.", "Meanwhile, pinch 20-24 small pieces from the dough and roll each into a ball, using up all of the dough. Add each dumpling to the pot immediately after rolling it and replace the lid. Continue to simmer the stew and dumplings for 8-10 minutes, or until the meat and vegetables are tender, the sauce has thickened and the dumplings are cooked through."]}, {"isVegetarian": true, "title": "Peppers with chickpeas and harissa", "url": "www_bbc_co_uk_food_recipes_peppers_with_chickpeas_85763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppers_with_chickpeas_85763_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 red pepper, seeded and sliced into eight strips", "1 yellow pepper, seeded and sliced into eight strips", "10 cherry tomatoes, halved", "2 tsp harissa paste", "450g/1lb jar of cooked chickpeas in water", "salt", "½ lemon, juice only", "handful fresh basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the olive oil into a large frying pan over a medium heat.", "Add the sliced red and yellow pepper to the pan and allow to soften for 2-3 minutes.", "Add the cherry tomatoes to the pan and cook for a further two minutes, gently squashing the tomatoes with a wooden spoon to release their juices.", "Mix in the harissa paste.", "Carefully pour the chickpeas, and the water in which they were stored, into the pan.  Stir, then allow them to heat through thoroughly for 3-4 minutes.", "Season with salt and the juice of half a lemon.", "Add a handful of fresh basil leaves right at the end of cooking, so they wilt under the residual heat. Serve immediately."]}, {"isVegetarian": true, "title": "Pepper sauce", "url": "www_bbc_co_uk_food_recipes_peppersauce_1301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.5ml/½tbsp vegetable oil", "1 small onion, peeled and finely chopped", "150ml/5fl oz dry white wine", "150ml/5fl oz crème fraîche or double cream", "2 tbsp green peppercorns, rinsed ", "salt and freshly ground black pepper to season"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan and gently cook the onion until soft.", "Add the wine and reduce by half.", "Stir in the crème fraîche and the peppercorns.", "Season with salt and plenty of freshly ground black pepper."]}, {"isVegetarian": false, "title": "Pepper steak with roasted baby tomatoes and summer purée", "url": "www_bbc_co_uk_food_recipes_peppersteakwithroast_74816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp mixed whole peppercorns", "Maldon sea salt and freshly ground black pepper", "4 x 175-225g/6-8oz sirloin steaks, at least 2.5cm/1in thick", "12 baby tomatoes on the vine", "3 tbsp extra virgin olive oil", "200g/7oz green beans, topped and halved diagonally ", "200g/7oz fresh peas (or good quality frozen ones)", "200g/7oz medium English asparagus, trimmed", "200g/7oz fresh broad beans, or frozen, de-frosted", "2 tbsp chopped fresh mint ", "2 tbsp snipped fresh chives", "150g/5½oz ricotta", "2 tbsp freshly grated parmesan", "1 tbsp light olive oil", "knob of butter"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the whole peppercorns in a pestle and mortar and lightly crush down, then add a teaspoon of the Maldon sea salt and gently combine, ensuring you leave some texture. ", "Tip onto a flat plate. Pat the steaks dry with kitchen roll and press the mixed peppercorn mixture onto both sides of the steaks, using your hands. ", "If you have time, cover with cling film and leave at room temperature for 2-3 hours to allow the flavours to infuse.", "Snip the baby tomatoes into four portions of three and arrange in a small roasting tin. ", "Drizzle over a tablespoon of the extra virgin olive oil and season to taste.", "Roast for 12-15 minutes until they are lightly roasted and just beginning to soften. Remove.", "To make the summer purée, bring a large pan of salted water to the boil. ", "Add the green beans and fresh peas (if using frozen don't add these until about a minute before the end of the cooking time). A minute later add the asparagus and cook for a further five minutes, then drain and cool under cold running water. ", "Remove the skins from the broad beans. Cut the tips frm the asparagus, then set them aside with about a quarter of the other vegetables. ", "Tip the remaining vegetables, including the asparagus spears, into a food processor or liquidiser with the mint, chives, ricotta and remaining two tablespoons of extra virgin olive oil. ", "Season generously with salt and freshly ground black pepper. Blend to a rough purée and then tip into a heavy-based pan. ", "Fold in the parmesan and the reserved blanched vegetables. ", "Set aside until you are ready to use.", "To cook the steaks, heat the light olive oil in a large heavy-based frying pan over a high heat. Add the steaks and cook for two minutes on each side, then reduce the heat, add a knob of butter and cook the steaks for 4-6 minutes, turning once, depending on how rare or well-done you like your meat. ", "Transfer the steaks to a plate. Set aside in a warm place to rest.", "While the steaks are resting gently heat the purée. To serve, divide the purée among four plates. Add a steak to each and finish with a pile of tomatoes and a drizzle of olive oil."]}, {"isVegetarian": true, "title": "Peppery hot cabbage salad", "url": "www_bbc_co_uk_food_recipes_pepperyhotcabbagesal_86575", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "small pinch asafoetida (available in Asian stores and some supermarkets)", "¾ tsp brown mustard seeds", "¾ nigella seeds (available in Asian stores and some supermarkets)", "2 small dried red chillies, whole", "1 tsp black gram lentils (urad dal), skinned, split and washed ", "1 tbsp chopped peanuts", "10 curry leaves (available fresh or dried from Asian grocers)", "½ large cabbage head, finely shredded", "salt, to taste"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large wok or non-stick saucepan, heat the oil until it is smoking (NB - Do not leave hot oil unattended). Remove the pan from the heat and allow the oil to cool for ten seconds. Return the pan to the hob, turn the heat down and fry the asafoetida and mustard and nigella seeds for 30 seconds. Add the chillies, lentils and peanuts and fry for a further minute or until the lentils have started to colour. ", "Once cooked, stir in the curry leaves, cabbage and salt, to taste. Stir-fry for ten minutes making sure that the cabbage retains some firmness.", "To serve, distribute the cabbage between 2-3 serving plates."]}]