[{"isVegetarian": true, "title": "Mulled cider", "url": "www_bbc_co_uk_food_recipes_cidertoddy_90492", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cidertoddy_90492_16x9.jpg", "ingredients": ["4 cardamom pods, lightly crushed", "1 clementine, sliced into wedges, spiked with 8 cloves", "1 lemon, sliced into wedges, spiked with 8 cloves", "100ml/4fl oz whisky ", "100ml/4fl oz orange liqueur", "3 tbsp clear honey", "1 litre/1 pint 15¼fl oz cider ", "4 cinnamon stick", "freshly grated nutmeg, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat all of the cider toddy ingredients over a low heat until warmed through.", "Pour the cider toddy into 4 latte glasses or other heatproof glasses.", "Finish with a little freshly grated nutmeg."]}, {"isVegetarian": true, "title": "Cinder toffee", "url": "www_bbc_co_uk_food_recipes_cinder_toffee_33877", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinder_toffee_33877_16x9.jpg", "ingredients": ["vegetable oil, for greasing", "75g/2½oz granulated sugar ", "100g/4oz liquid glucose ", "25g/1oz of golden syrup", "15g/½oz bicarbonate of soda"], "serves": "Makes About 30 lumps of toffee", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Use the oil to grease a 23cm/9in square baking tin that’s 4cm/1½in deep. Line it with baking parchment, then grease again with a little oil.", "Place the sugar, liquid glucose, golden syrup and a tablespoon of water into a deep, heavy-bottomed pan. (Make sure the pan is very deep as the mixture will bubble up later.) Heat gently to dissolve the sugar, then increase the heat very slightly, until the mixture has turned into a syrup.", "Watch the pan very carefully from this point on, boiling it steadily at a fairly low heat, until the mixture turns amber. It should be the colour of marmalade. This will take approximately 15 minutes.", "Turn the heat off and get a balloon whisk to hand. Add the bicarbonate of soda and whisk it all together. It will bubble up right to the top of the pan, so take care not to burn yourself as the caramel will be very hot.", "Immediately pour the toffee into the prepared tin and leave to cool completely (about two hours). ", "When cold, prise the toffee out of the tin using a flat knife and break it up into chunks. If it is difficult to release from the tin, hit it with a hammer."]}, {"isVegetarian": false, "title": "Cinnamon and apple iced buns and toffee and marmalade iced buns", "url": "www_bbc_co_uk_food_recipes_cinnamon_and_apple_iced_95601", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz full-fat milk", "2 medium free-range eggs, lightly beaten ", "735g/1lb 9½oz very strong bread flour, plus extra for dusting ", "80g/2¾oz caster sugar", "1¼ tsp salt", "3 tsp fast-action dried yeast ", "80g/2¾oz unsalted butter, softened ", "200g/7oz caster sugar", "20g/¾oz liquid glucose", "180ml/6½fl oz full-fat milk", "180ml/6½fl oz double cream", "4 large free-range egg yolks", "3 tbsp cornflour", "6 clementines, juice and peel only (250ml/9fl oz juice required), peel sliced into thin strips", "300ml/10fl oz blood orange juice", "175ml/6fl oz lemon juice (about 6 lemons)", "225g/8oz caster sugar", "6 tbsp apple pectin", "500g/1lb 2oz Bramley apples, peeled, cored and grated", "125g/4½oz caster sugar", "75ml/2½fl oz cloudy apple juice", "1 tsp ground cinnamon", "pinch ground cloves", "400ml/14oz double cream", "2 tsp vanilla paste", "60g/2¼oz icing sugar", "250g/9oz fondant icing sugar", "green food colouring", "orange food colouring"], "serves": "Makes 16 iced buns", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, combine the milk with 175ml/6fl oz boiling water in a jug, then beat in the eggs.", "Add the dry ingredients to a bowl of a freestanding mixer fitted with a dough hook and mix briefly to combine. Add the butter and the egg mixture, and mix for 5 minutes.", "Turn the dough out onto a lightly floured work surface and knead by hand for another few minutes. Transfer to a large bowl and cover with cling film. Prove the dough in a warm place for about an hour, or until doubled in size.", "Once proved, divide the dough into 16 pieces. Roll into sausage shapes and place on 2 baking trays lined with non-stick baking paper. Prove again for about an hour or until doubled in size. ", "Preheat the oven to 210C/190C Fan/Gas 6.", "Once proved, bake the dough for 9 minutes, then swap the trays around in the oven and bake for another 4 minutes (this is to ensure the colour is even). Set aside to cool. ", "To make the toffee crème pâtisserie, line a large roasting tin with non-stick baking paper. ", "Add the sugar, glucose and 4 tablespoons water to a saucepan. Heat gently until the sugar melts, then increase the heat and boil until it turns a deep caramel colour. (CAUTION: Boiling sugar is very hot. Do not leave unattended.) Carefully pour into the prepared roasting tin and set aside to cool. When the caramel is cool and hard, break it into chunks and transfer a food processor. Pulse until you have a coarse powder. ", "In a large saucepan, mix the milk, cream, egg yolks, cornflour and 135g/5oz of the powdered caramel over a medium heat. Cook until the mixture is thick (or until it measures 85C on a kitchen thermometer). Set aside to cool, covering the surface with cling film to stop a skin forming. When cooled spoon into a piping bag fitted with a large plain nozzle.", "For the marmalade, add all the ingredients to a large, deep saucepan and cook on a low-medium heat for 1½ hours, or until the mixture reaches 104C on a sugar thermometer and the peel has softened. Set aside to cool.", "For the spiced apple compôte, mix all the ingredients together in a large saucepan and cook on a low heat for about 20 minutes, or until the apple has softened and most of the liquid has evaporated.", "For the crème Chantilly, put all the ingredients in a large bowl and whip until stiff peaks form when the whisk is removed. Transfer to a piping bag fitted with a large plain nozzle.", "To assemble the iced buns, slice all the buns in half lengthways. Spread a layer of marmalade on 8 of the rolls and then pipe the crème pâtisserie on top. Place the other half of the roll on top.", "Spread a layer of apple compôte on the remaining rolls and then pipe the crème Chantilly on top. Place the other half of the roll on top.", "For the royal icing, beat the icing sugar with 2-3 tablespoons water using a wooden spoon until smooth and thick. Put half the icing in a separate bowl and add the green food colouring. Add the orange food colouring to the remaining icing. Transfer to separate piping bags fitted with wide flat-tipped nozzles. Pipe the green icing on top of the spiced apple buns and the orange icing on the marmalade buns. Serve once the icing has set."]}, {"isVegetarian": true, "title": "Cinnamon and soft cheese rolls with a maple and whisky glaze", "url": "www_bbc_co_uk_food_recipes_cinnamon_and_soft_cheese_54104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["625g/1lb 6oz strong white bread flour, plus extra for dusting", "75g/2½oz caster sugar", "1 pinch salt", "20g/¾oz dried yeast", "500g/1lb 2oz chilled butter, cut into 1cm/½in-thick slices, plus extra for greasing", "300g/10½oz full-fat cream cheese", "1 vanilla pod, split in half lengthways, seeds scraped out using a sharp knife", "1 tsp ground cinnamon", "2 egg yolks, lightly beaten, for egg wash", "200g/7oz icing sugar, sifted", "100ml/3½fl oz maple syrup", "25ml/1fl oz bourbon whiskey"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, grease a round 23cm/9in springform cake tin with butter and line with baking parchment. ", "Mix the flour, sugar, salt and yeast in a bowl until well combined. Make a well in the centre, then slowly pour in 450ml/16fl oz of tepid water, stirring well and bringing the edges of the dry ingredients towards the water as you mix. (You may not need to use all of the water - keep adding the water until the dough starts sticking to the edge of the mixing bowl and feels elastic.) Alternatively, mix the dough using a free-standing mixer fitted with a dough hook. ", "Cover the bowl with a clean tea towel and set the dough aside to prove for 18-20 minutes, or until it has doubled in size. ", "When the dough has risen, turn it out onto a lightly floured work surface and knock it back. Roll the dough out to a rectangle measuring 60x30cm/24x12in. ", "Cover half of the dough with the slabs of butter, then fold the other half of the dough over the butter, pressing down lightly at the edges to seal. ", "Dust the work surface with flour again. Beat the dough with a rolling pin to flatten it, then roll it out to another rectangle measuring 60x30cm/24x12in rectangle again. ", "Fold the short sides of the rectangle inwards so that the edges of the rectangle meet in the middle. Fold again, lengthways.", "Repeat the beating, folding and rolling process twice more, then wrap the dough in cling film and chill in the fridge for 1 hour. ", "Roll the chilled dough out onto a lightly floured work surface to a rectangle measuring 30x45cm/12x8in with a thickness of approximately 1cm/½in. ", "For the filling, in a bowl, mix together the cream cheese, vanilla seeds and cinnamon until well combined.", "Spread the filling mixture all over the dough rectangle, then, starting with a long edge, roll the dough like a Swiss roll. Cut the roll into 9 slices, each about 5cm/2in thick. ", "Turn the Swiss roll slices onto their sides so that the swirl faces upwards. Place one swirl into the centre of the prepared cake tin, then arrange the remaining swirls around the edge, making sure they are not too tightly packed. Set aside to prove for 35-40 minutes, or until the swirls have doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Brush the dough all over with the egg wash, then bake in the oven for 45 minutes, or until the rolls are golden-brown and have expanded and joined together.", "Meanwhile, for the glaze, in a bowl, mix together the icing sugar, maple syrup and bourbon until smooth and well combined. ", "To serve, remove the edge of the cake tin, separate the rolls and place them onto a serving plate. Drizzle the glaze over the top of each, moving back and forth so that the rolls are covered in criss-cross lines of glaze. Serve warm."]}, {"isVegetarian": true, "title": "Cinnamon apple overnight oats with date butter", "url": "www_bbc_co_uk_food_recipes_cinnamon_apple_overnight_75730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_apple_overnight_75730_16x9.jpg", "ingredients": ["40g/1½oz porridge oats", "½ apple, grated or finely chopped", "small handful pecans, chopped", "150ml/5fl oz milk or soya milk", "¼ tsp ground cinnamon", "1 tbsp date butter (see below)", "100g/3½oz dates, finely chopped", "3 tbsp boiling water", "pinch ground cinnamon"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["For the date butter, put the dates in a heatproof bowl and slowly add the boiling water. Mash the dates using a fork to make a creamy paste. Stir in the cinnamon. Set aside to cool.", "For the overnight oats, put all the ingredients in a jar, stir, put the lid on and store in the fridge overnight. If you prefer your oats warmed, microwave the mixture for 30 seconds to release the aromas and flavours."]}, {"isVegetarian": true, "title": "Cinnamon, apple and custard Danish", "url": "www_bbc_co_uk_food_recipes_cinnamon_apple_and_25914", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_apple_and_25914_16x9.jpg", "ingredients": ["200ml/7fl oz full-fat milk", "50ml/2fl oz single cream", "½ tsp vanilla bean paste ", "50g/1¾oz golden caster sugar ", "2 medium free-range egg yolks", "20g/¾oz cornflour", "1 orange, juice and zest", "100g/3½oz sultanas", "3 red apples, cored, quartered and cut into paper-thin slices", "1 lemon, juice only", "4 tbsp soft light brown sugar ", "½ tsp ground cinnamon", "½ tsp vanilla paste ", "knob unsalted butter", "500g/1lb 2oz strong white flour, plus extra for dusting ", "10g/¼ oz fast-action yeast ", "10g/¼oz salt ", "80g/2¾oz caster sugar", "2 medium free-range eggs", "125ml/4fl oz full-fat milk, heated until tepid", "250g/9oz unsalted butter, chilled", "olive oil, for greasing ", "50g/1¾oz apricot preserve ", "almond liqueur, to taste ", "100g/3½oz icing sugar", "¼ tsp cinnamon", "¼ tsp vanilla bean paste", "fresh mint leaves, to garnish "], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the crème pâtissière, in a large heavy-based saucepan combine the milk, cream and vanilla. Bring to the boil.", "Meanwhile, add the sugar, egg yolks and cornflour to a large bowl and beat until smooth. As soon as the milk mixture comes to the boil, remove it from the heat and pour about a quarter over the egg mixture. Whisk until combined, then pour it into the pan and whisk continuously over a low heat until smooth and thick. Pass through a sieve into a clean bowl. Cover the surface of the custard with cling film to prevent a skin forming. Leave to cool then place in fridge.", "For the apple filling, mix the orange juice and zest with the sultanas and set aside to soak.", "In a large bowl combine the apple slices with lemon juice, brown sugar, cinnamon, vanilla and butter. Cover and cook in the microwave on medium power for about 4 minutes, or until the apples have softened but still hold their shape. Set aside to cool. Roll up the sliced apples so they resemble roses and secure with a cocktail stick. Set aside in the fridge.", "To make the pastry, set up a freestanding mixer with a dough hook attachment. Add the flour, then put the yeast to one side of the bowl and the salt and sugar on the opposite side. ", "In a jug, mix the eggs, milk and 4 tablespoons water. Pour into the flour mixture and mix on a low speed for 2 minutes (you may need to push to dough down the hook occasionally). Increase the speed to medium and mix for a further 6 minutes.", "Transfer to a large, lightly oiled bowl and cover either with a clean tea towel or oiled cling film. Leave to prove for an hour or until doubled in size. ", "Meanwhile, place the block of butter between two sheets of baking paper and bash with a rolling pin to flatten the butter into a rectangle about 1cm/½in thick. Store in the fridge until needed. ", "Turn the risen dough out onto a lightly floured work surface. Flatten it and roll it out to a rectangle about 40x15cm/16x6in and about 1cm/½in thick. Arrange the dough with one of the short edges nearest to you. Lay the butter in the middle of the dough, fold the dough up and down over the butter in the middle to make a neat rectangle. Pinch the edges to seal the butter in the dough. Place in a plastic food bag and chill in the freezer for 10 minutes.", "Place the chilled dough on a lightly floured work surface with one of the short edges nearest you. Roll out the dough into a 40x15cm/16x6in rectangle and fold into equal thirds like folding a letter for a business envelope. Place in a plastic bag in the freezer for 10 minutes. ", "Repeat the rolling and folding as before, then return to the freezer for another 10 minutes. Repeat the rolling and folding one final time, then chill the dough for 30 minutes in a plastic bag in the fridge.", "On a lightly floured work surface, roll out the dough into a 5mm/¼in thick rectangle, 30x40cm/12x16in. Using a sharp knife, cut into twelve 10cm/4in squares.", "To shape the pastries, fold each corner in a bit towards the middle and push down firmly (you should now have a hexagon shape). Transfer to a baking tray (you will need 2-3 baking trays). Cover the trays with cling film or a damp tea towel and leave to rest at cool room temperature for 30–60 minutes until risen slightly.", "Preheat the oven to 210C/190C Fan/Gas 6½.", "On each pastry square spread some of the cooled crème pâtissière and then place an apple ‘rose’ in the centre and press it down to keep it in place. ", "For the glaze, put all the ingredients, except the mint, in a small saucepan and gently warm until runny. Brush the pastries with the glaze then sprinkle over the soaked sultanas.", "Bake for 15–20 minutes, or until golden-brown and crisp. Place on cooling racks. When completely cool, place two mint leaves either side of the apple roses to resemble leaves."]}, {"isVegetarian": true, "title": "Cinnamon, banana and blueberry muffins", "url": "www_bbc_co_uk_food_recipes_cinnamon_banana_and_80291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_banana_and_80291_16x9.jpg", "ingredients": ["250g/9oz plain flour", "2 tsp baking powder ", "1 tsp ground cinnamon, plus ½ tsp extra for the topping", "pinch of salt", "2 ripe bananas, mashed ", "150g/5oz blueberries", "3 tbsp honey ", "3 tbsp vegetable oil ", "1 large free-range egg", "185ml/6fl oz milk", "50g/2oz caster sugar"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line eight holes of a muffin tin with paper muffin cases.", "Sift the flour, baking powder, cinnamon and salt into a large mixing bowl. Add the banana and blueberries and, using a fork, lightly toss the fruit through the flour. ", "In a separate bowl, lightly whisk together the honey, vegetable oil, egg and milk.", "Add the liquid ingredients to the dry ingredients and stir until just combined (don't over-mix or your muffins won't be as light in texture). Spoon the batter into the individual muffin cases. ", "Mix the extra half a teaspoon of cinnamon and the caster sugar together and sprinkle on top of the batter.  ", "Bake in the oven for 20 minutes, until risen and lightly golden. Serve warm from the oven."]}, {"isVegetarian": true, "title": "Cinnamon cream cheese swirls with bourbon glaze", "url": "www_bbc_co_uk_food_recipes_cinnamon_cream_cheese_48034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["650g/1lb 7oz strong white flour, plus extra for dusting", "12g salt", "75g/2½oz caster sugar", "20g/¾oz dried yeast, crumbled", "500g/1lb 2oz cold butter", "300g/10½oz cream cheese", "1 vanilla pod, seeds scraped out", "2 tsp ground cinnamon", "1 free-range egg, lightly beaten (egg wash)", "25g/1oz sugar", "25ml/1fl oz maple syrup", "25ml/1fl oz bourbon whiskey", "200g/7oz icing sugar"], "serves": "Makes 8 buns", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/180C fan/Gas 6.", "Place the flour, salt, sugar and crumbled yeast into a free-standing mixer fitted with a dough hook and slowly mix in about 450ml/16fl oz of lukewarm water, a little at a time. You may not need all the liquid, or you may need a little more. Mix until the dough is soft and starts sticking to the edge of the mixing bowl.", "Remove the bowl from the mixer and cover with clingfilm. Set aside.", "Let the dough rise for about 20 minutes, or until it doubles in size. When the dough has risen, knock the air out of it and roll out onto a floured surface into a rectangular shape measuring 60cm x 30cm/24in x 12in.", "Slice the butter into rectangles about 1cm/½in thick and lay them down end-to-end on the dough, covering two thirds of the surface. Leave a margin large enough to fold the shorter edges of the dough over the butter so that the two edges meet in the middle. The dough will look like the pages of an open book.", "Fold the dough in half again as though you are closing the book.", "Place the dough onto a well-floured surface. Knock and roll the dough out into a 60cm x 30cm/24in x 12in rectangular size again. Repeat the knocking, folding and rolling process three times. Wrap the dough in cling film and leave to rest in the fridge overnight.", "After the dough has rested, roll the out into a square approximately 5mm/¼in  thick.", "For the filling, mix together the cream cheese and vanilla seeds in a bowl. Cover the bottom twothirds of the dough in the cream cheese mixture and sprinkle with cinnamon. Roll the dough up and cut into slices 4cm/1½in thick.", "Grease and line a round 23cm/9in springform tin. Place the buns around the edge and one in the middle, making sure they are not too tightly packed. Leave to prove until double in size.", "Brush the buns with egg wash and bake in the oven for 20 minutes.", "For the glaze, while the cake is cooling, add sugar and maple syrup, plus 25ml/1fl oz water to a pan and heat gently, stirring until the sugar dissolves. Add the bourbon and simmer until the glaze is reduced and sticky. Generously brush the glaze mixture all over the cake.", "Mix together the icing sugar and one tablespoon of water in a bowl until the mixture forms a runny icing. (You may need a little bit more water.) Put into a piping bag and drizzle the cake with the icing.", "Undo the spring catch and transfer the buns to a bread board or plate. Tear and share, preferably with a strong cup of tea or coffee."]}, {"isVegetarian": true, "title": "Cinnamon doughnuts with apple filling, maple glaze and vanilla créme Anglaise", "url": "www_bbc_co_uk_food_recipes_cinnamon_doughnuts_with_48492", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting ", "40g/1½oz caster sugar ", "2 tsp fine sea salt ", "20g/¾oz fresh yeast or 10g/¼oz fast-action dried yeast ", "140ml/4½fl oz whole full-fat milk, slightly warmed", "5 large egg yolks ", "90g/3¼oz unsalted butter, cut into cubes, softened, ", "groundnut or vegetable oil, for deep-frying", "½ lemon, juice only ", "750g/1lb 10oz Bramley apples", "225g/8oz caster sugar ", "25g/1oz unsalted butter ", "4 tsp maple syrup ", "100g/3½oz icing sugar, sifted ", "100g/3½oz caster sugar ", "1 tsp ground cinnamon", "250ml/9fl oz double cream", "½ vanilla pod, split in half lengthways and seeds scraped out", "65g/2½oz caster sugar", "3 large egg yolks"], "serves": "Makes 30 doughnuts", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the doughnuts, put the flour, sugar and salt in the bowl of an electric mixer fitted with a dough hook (if using dried yeast, add it to the bowl now). Stir to mix, then make a well in the middle. ", "In a small bowl, stir the fresh yeast with a little milk until creamy, then set aside for a few minutes until foamy. Add to the well in the flour along with the egg yolks and remaining milk. Mix on low speed to combine, then increase the speed slightly and continue to mix until a dough forms. ", "Reduce the speed a little before adding the butter, a little at a time, and continue mixing until it is fully incorporated. If the dough seems too wet, mix in a little more flour, a tablespoonful at a time. Increase the speed and knead the dough for a couple of minutes until it is smooth and elastic. Cover the bowl with cling film and leave the dough to rise in a warm spot for 1-2 hours or until doubled in size. ", "Meanwhile, make the apple filling. Add the lemon juice to a large bowl of water. Peel, core and roughly chop the apples. As you chop them, immediately put them into the bowl of acidulated water to prevent them from browning. ", "Drain the apples and pat dry with a kitchen towel, then tip into a heavy-based pan and add the sugar and butter. Cook over low heat, stirring occasionally, for about 30 minutes or until the apples are very soft. If there seems to be too much liquid, continue to cook over a low heat until the mixture has thickened. Transfer the stewed apples to a food processor and blend until smooth, stopping the machine to scrape down the sides once or twice. Pass the apple purée through a sieve into a bowl and leave to cool completely, then spoon into a plastic squeezy bottle with a long tip (or a piping bag fitted with a long, thin nozzle). Set aside. ", "Knock back the risen dough and lightly knead it on a floured surface. Roll out the dough to a 1cm/½in thick square or rectangular shape. Line two baking sheets with baking parchment. Put the dough on one of the baking sheets and chill in the freezer for about 30 minutes or until the dough is semi-frozen (this will make it easier to cut). ", "Using a sharp knife, cut the dough into 4cm/1½in squares. Arrange them, spaced slightly apart, on the lined baking sheets. Cover with lightly greased cling film and leave in a warm spot for about an hour or until the dough is one-and-a-half times the original size. ", "Meanwhile make the maple glaze, combine the ingredients in a bowl with a tablespoon water and whisk until smooth. If the glaze seems too thick, add a little more water, a tiny splash at a time, and stir well until you get the desired consistency. ", "For the cinnamon sugar, mix the caster sugar and cinnamon together on a plate. ", "For the crème Anglaise, heat the cream with the vanilla seeds and pod in a saucepan until it begins to boil. Remove from the heat and let the vanilla infuse the cream as it cools. Meanwhile, beat the sugar and egg yolks together in a large bowl. When the vanilla cream has cooled, fish out the pod, then mix the cream with the sugary yolks. Pour the mixture through a fine sieve into a clean saucepan. Set over a low heat and cook, stirring constantly with a wooden spoon, until the mixture thickens into a thin custard that will lightly coat the back of the spoon.", "Heat 4-5cm/1½-2in of oil in a deep heavy-bottomed pan, or a deep-fat fryer, to 170C. Deep-fry the doughnuts, in small batches, for about 2 minutes or until golden-brown all over. Remove with a slotted spoon and drain on a tray lined with several layers of kitchen paper. While the doughnuts are still warm, pipe the apple filling into the centre of each, then roll in the cinnamon sugar. ", "Once all the doughnuts have been deep­ fried, filled and sugared, glaze them in several batches. Place a few in a single layer on a wire rack set over a large baking tray. Drizzle the maple glaze over them and leave to set slightly before transferring them to a serving plate. Serve warm or at room temperature with the vanilla crème Anglaise."]}, {"isVegetarian": false, "title": "Cinnamon, ginger and red chilli wings", "url": "www_bbc_co_uk_food_recipes_cinnamon_ginger_and_red_42146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 head garlic", "1 bunch fresh thyme, roughly chopped", "3 tbsp grated ginger, including its skin", "6 dried red chillies, roughly broken", "4 tbsp sea salt", "12 chicken wings, skin on", "2 x 4cm/1½in cinnamon sticks", "500-700ml/17fl oz-1¼ pints vegetable oil or rapeseed oil", "3 tsp rubbed sage or crushed dried sage", "1 tbsp garlic powder (optional)", "1 tbsp vegetable bouillon powder", "1 tsp chilli powder", "1 tsp dried thyme", "½ tbsp sea salt", "coleslaw, such as Hairy Bikers' Asian slaw"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the cure, cut the head of garlic several times across the width and discard as much of the papery skin as you can. Put the garlic in a large shallow dish and add all of the remaining cure ingredients. With a pestle, gently bruise the mixture to release the flavours. Add the chicken wings and massage the cure into them. Cover and refrigerate for at least six hours, overnight if possible.", "When ready to cook the chicken, preheat the oven to 150C/300F/Gas 2. Remove the chicken wings from the fridge, wipe off the cure with kitchen paper and pat as dry as possible. Place them in a deep ovenproof pot with a tightly fitting lid, add the cinnamon sticks and enough oil to cover the wings. Cover with the lid and cook in the preheated oven for three hours; there is no need to disturb the dish during this time.", "Remove the pot from the oven and leave the chicken to cool slightly in the oil while you make the dusting. The chicken will need one final quick cook in the oven, so if you want to serve them immediately, increase the temperature to 220C/425F/Gas 7.", "Blend together the ingredients for the dusting in a food-processor and set aside.", "When the chicken wings have cooled, line a dish with a double layer of kitchen paper. With a slotted spoon, remove the chicken wings from the oil (carefully as they will be very tender) and place on the kitchen paper for a few minutes. Carefully transfer the wings to a roasting tin, and roast  for 12 minutes or so or until crisp.", "Remove the wings from the oven and pat with kitchen paper again. Shake over the dusting mixture and serve, allowing three chicken wings per person. Serve any extra dusting alongside in case you want to add even more!"]}, {"isVegetarian": true, "title": "Cinnamon madeleines with winter caramel sauce", "url": "www_bbc_co_uk_food_recipes_cinnamon_madeleines_with_16096", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, plus extra for greasing", "1 vanilla pod", "250g/9oz sugar, plus 75g/2½oz for dusting", "250g/9oz plain flour", "2 tbsp clear honey", "3 free-range eggs", "½ tsp ground cinnamon, for dusting", "100g/3½oz caster sugar", "350ml/12fl oz double cream", "1 star anise", "½ cinnamon stick", "25g/1oz butter"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the madeleines, preheat the oven to 170C/325F/Gas 5 and butter the madeline tins.", "Heat the butter until just melted. ", "Split the vanilla pods and scrape out the seeds, reserving the pod.", "Place the sugar and flour into a bowl then add the vanilla seeds, honey and eggs then whisk in the melted butter until you have a nice smooth batter.", "Spoon the batter into the tins, only half filling each indent.", "Bake for 12-15 minutes or until golden-brown. (Depending on the size of the madeleines, small ones may take only 8-10 minutes.)", "Mix the ground cinnamon and sugar for dusting on a plate, then roll the madeleines quickly in the sugar to coat them thoroughly.", "For the winter caramel sauce, heat the sugar in a pan until it turns a light golden-brown. Pour in half the cream and bring to the boil, stirring well.", "Add the star anise, cinnamon, reserved vanilla pod and butter and the rest of the cream. Cook for 2-3 minutes until thickened and smooth.", "Strain through a fine sieve into a serving bowl.", "Serve the madeleines with the sauce. They can be kept in an airtight container for up to a week."]}, {"isVegetarian": true, "title": "Cinnamon porridge with grated pear", "url": "www_bbc_co_uk_food_recipes_cinnamon_porridge_with_53154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_porridge_with_53154_16x9.jpg", "ingredients": ["60g/2¼oz jumbo porridge oats", "¼ tsp ground cinnamon, plus a little to sprinkle", "300ml/10fl oz semi-skimmed milk", "1 ripe medium pear", "1 wedge lemon"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the oats and cinnamon in a non-stick saucepan with the milk and cook over a low-medium heat for 4-5 minutes, stirring constantly until rich and creamy. Pour into two deep bowls.", "Coarsely grate the pear, and place on top of the porridge. Squeeze over the lemon juice and sprinkle with a tiny pinch of ground cinnamon."]}, {"isVegetarian": true, "title": "Cinnamon rolls", "url": "www_bbc_co_uk_food_recipes_cinnamon_rolls_67339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["625g/1lb 6oz strong white flour, plus extra for dusting", "75g/2½oz caster sugar", "1 pinch sea salt", "20g/¾oz dried yeast", "500g/1lb 2oz cold butter", "300g/11oz full fat cream cheese", "1 vanilla pod, seeds scraped", "1 tsp ground cinnamon", "2 free-range egg yolks, lightly beaten for egg wash", "200g/7oz icing sugar, sifted", "100ml/3½fl oz maple syrup", "25ml/1fl oz bourbon whisky"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough place the flour, sugar, salt and yeast into a mixer fitted with a dough hook and slowly mix in 450ml/16fl oz water, adding more or less as needed, until the dough starts sticking to the edge of the mixing bowl and feels elastic. ", "Cover the bowl with a clean tea towel and let the dough rise for about 20 minutes, or until it doubles in size. ", "When the dough has risen, knock the air out of it and roll out onto a floured surface into a rectangular shape measuring 60x30cm/24x12in. ", "Slice the butter into rectangles about 1cm/½in thick and lay in two strips covering half of the dough. Fold the dough over and press down lightly at the edges to seal. ", "On a well-floured surface beat the dough with the rolling pin then roll into a 60x30cm/24x12in rectangle again. Fold either end in to meet in the middle, then fold together and repeat the beating, folding and rolling process twice more. Wrap the dough in cling film and leave to rest in the fridge for one hour. ", "Roll the dough out into a rectangle approximately 1cm/½in thick. The rectangle should be 30 x 45cm/12 x 8in long.", "For the filling, mix together the cream cheese, vanilla seeds and cinnamon in a bowl.", "Cover the dough with the filling mixture, then roll up from the longer side to form a Swiss roll 45cm/18in long. Cut into nine slices each 5cm/2in long. ", "Grease and line a round 23cm/9in spring form tin. Place the circles around the edge, standing upright, and one in the middle, making sure they are not too tightly packed. Leave to prove for about 40 minutes, or until doubled in size.", "Preheat the oven to 200C/400F/Gas 6.", "When you’re ready to bake, brush the dough with egg wash and bake for 45 minutes, or until golden-brown. The rolls will expand and join together.", "For the glaze, while the rolls are cooling, mix the icing sugar, maple syrup and bourbon together in a bowl until smooth.", "Lift the rolls out of the tin and put on a serving plate. Drizzle the glaze over the top, back and forth. Tear the rolls apart to separate them and serve warm."]}, {"isVegetarian": false, "title": "Cinnamon and apple pork belly with mulled cider cabbage and roast almonds", "url": "www_bbc_co_uk_food_recipes_cinnamonandapplepork_93116", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz belly pork, fat scored with a sharp knife", "1 tbsp sea salt flakes", "3 cinnamon sticks", "6 cloves", "2 Granny Smith apples, peeled, cored and sliced", "2 large Navel oranges, thickly sliced", "200ml/7fl oz organic medium cider, plus extra for basting", "25g/1oz butter", "1 onion, peeled, finely sliced", "1 cinnamon stick", "¼ tsp freshly grated nutmeg", "2 star anise", "1 bay leaf", "500g/1lb 2oz red cabbage, core removed, finely sliced", "125ml/4½fl oz organic medium cider", "2 tbsp light muscovado sugar", "salt and freshly ground black pepper", "2 tbsp redcurrant jelly", "110g/4oz blanched almonds", "2 tsp groundnut oil"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pork belly, boil a kettle and pour the boiling water over the pork skin, discarding the water.", "Pat the pork belly dry, using kitchen paper, then rub the salt over the skin, pressing them into the score marks.", "Place the cinnamon sticks, cloves, sliced apples, oranges and cider into the bottom of a roasting tin. Place the pork belly on top and roast for one hour in the middle of the oven. Then, reduce the temperature to 140C/275F/Gas 1 and cook for 2 hours. Add more cider to the bottom of the roasting tin if all the liquid evaporates.", "Once cooked, remove the pork belly from the oven and set aside to rest for 15 minutes.", "Meanwhile, for the mulled cider cabbage, melt the butter in a lidded pan over a medium heat and fry the onion for 4-5 minutes, or until softened. Add the cinnamon stick, nutmeg, star anise and bay leaf and continue to cook for another 1-2 minutes. Stir in the cabbage, cider and sugar until well combined and the sugar has dissolved. Season, to taste, with salt and freshly ground black pepper.", "Bring the mixture to the boil and reduce the heat until the mixture is simmering. Cover the pan with a lid and simmer over a low heat, stirring occasionally, for 1-1½ hours, or until the cabbage is tender and the liquid has evaporated. Remove the star anise and cinnamon stick and stir in the redcurrant jelly.", "For the salted almonds, mix the almonds and oil in a bowl and season, to taste, with salt and freshly ground black pepper. Transfer to a baking tray and roast in the oven for 10 minutes, or until golden-brown. Remove from the oven and set aside to cool.", "To serve, carve the pork belly into squares. Spoon some mulled cider cabbage into the centre of each of 8 serving plates, top with a piece of pork belly and spoon over some cooking juices. Garnish with the roast almonds."]}, {"isVegetarian": true, "title": "Cinnamon and apple turnover", "url": "www_bbc_co_uk_food_recipes_cinnamonandappleturn_84027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz soft brown sugar", "25g/1oz butter", "1 apple, cored, halved, thinly sliced ", "25g/1oz raisins", "½ tsp ground cinnamon", "4 sheets ready-made filo pastry", "1 free-range egg, beaten", "1 tbsp icing sugar", "ready-made custard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the sugar and butter in a frying pan and melt together over a medium heat. Add the apple, raisins and cinnamon and stir well to coat. ", "Meanwhile, lay out two sheets of filo pastry to cover on a baking tray. The two filo sheets across with the other two sheets. To create pointed star and brush all over with beaten egg.", "Spoon the apple mixture into the centre of the pastry and fold over all the ends, into the centre covering the apple.", "Brush the top of the pastry with egg. Place into the oven and bake for ten minutes, or until the pastry is golden brown.", "To serve, dust the apple turnover with icing sugar and serve with a dollop of the custard."]}, {"isVegetarian": true, "title": "Cinnamon and pistachio apple cake with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_cinnamonandpistachio_91062", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz green sultanas", "1.2kg/2lb 10¼oz mixed dessert apples, peeled, cored, cut into chunks", "100g/3½oz soft brown sugar", "50g/1¾oz unsalted pistachios, shells removed, chopped, plus extra to sprinkle on top", "1 tsp ground cinnamon", "200g/7¼oz caster sugar", "200g/7¼oz unsalted butter", "3 free-range eggs", "200g/7¼oz ground almonds", "5 tbsp flaked almonds", "vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Soak the sultanas in a small bowl of warm water for 30 minutes. ", "Place the apples in a medium saucepan with the brown sugar and cook over a low heat until soft. Drain the sultanas and add them to the pan, then add the chopped pistachios and cinnamon. Set aside.", "In a large bowl, beat together the butter and sugar until pale and fluffy. Beat in the eggs one by one and then fold in the ground almonds. Lightly stir to make a smooth batter.", "Place the apples in a baking dish and spread the creamed mixture over the top. Cook in the oven for 30 minutes, then sprinkle with the flaked almonds and reserved pistachios. Return to the oven and cook for a further 10 minutes.", "Serve a wedge of cake with scoop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Cinnamon doughnuts with cinnamon ice cream and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_cinnamondoughnutswit_91336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour", "pinch salt", "1½ tsp ground cinnamon", "115g/4¼oz caster sugar", "25g/1oz butter, softened", "150ml/5fl oz water", "20g/¾oz easy-blend yeast", "vegetable oil, for deep frying", "300ml/½ pint full-fat milk", "2 cinnamon sticks", "1 tsp ground cinnamon", "1 vanilla pod, split, seeds scraped out using a knife", "6 free-range egg yolks ", "110g/4oz caster sugar", "300ml/10½fl oz double cream, whipped until soft peaks form when the whisk is removed", "75g/3oz caster sugar", "110ml/4fl oz water", "200g/7oz dark chocolate, roughly chopped"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the cinnamon doughnuts, in a large bowl, mix together the flour, salt, half a teaspoon of the ground cinnamon, 40g/1½oz of the caster sugar and all of the butter, water and yeast until well combined. Keep mixing for 4-5 minutes, or until the mixture comes together as a smooth dough. Cover with cling film and set aside for one hour to prove.", "When the doughnut dough has doubled in size, divide it into eight equal portions and roll each into a ball.", "Line a tray with baking parchment and space out the dough balls onto it, leaving plenty of room between each ball. Set aside in a warm place to rise for a further 20 minutes.", "Heat the oil in a deep fat fryer to 150C/320F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the dough balls into the hot oil in batches and deep fry for 6-8 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "When the excess oil has drained off the doughnuts, mix together the remaining tablespoon of ground cinnamon and the remaining 75g/2¾oz of sugar and sprinkle onto a plate. Dredge the doughnuts in the mixture until completely coated.", "For the cinnamon ice cream, bring the milk, cinnamon sticks, ground cinnamon, vanilla pod and vanilla seeds to a simmer in a pan, stirring regularly. When the milk is simmering, remove the vanilla pod and cinnamon sticks and discard (they can be cleaned well and reused in another recipe).", "Meanwhile, whisk the egg yolks and sugar together in a bowl until pale and fluffy.", "Pour the milk mixture over the egg and sugar mixture, whisking continuously until well combined. Return the mixture to the saucepan and continue to cook for 2-3 minutes over a medium heat, or until thickened. Remove from the heat and leave to cool slightly.", "When the ice cream mixture has cooled slightly, strain it through a fine sieve over the whipped cream. Whisk until smooth and well combined, then pour the mixture into an ice cream maker. Churn for 40-50 minutes, or until almost solid, then transfer to a freezeable container and chill in the freezer.", "For the chocolate sauce, bring the sugar and water to a simmer in a pan. Simmer for 1-2 minutes, stirring continuously, until all of the sugar has dissolved.", "Add the chocolate pieces and whisk until the chocolate has melted and the mixture is smooth. Remove from the heat and set aside.", "To serve, place two cinnamon doughnuts into the centre of each of four serving plates. Serve a scoop of cinnamon ice cream alongside and drizzle over the chocolate sauce."]}, {"isVegetarian": true, "title": "Cinnamon French toast with peaches", "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_84863", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz milk", "1 free-range egg", "pinch ground cinnamon", "1 soda farl, cut in half", "30g/1oz butter", "50g/1¾oz caster sugar ", "1 vanilla pod, cut in half ", "100ml/3½fl oz white wine ", "1 peach, cut into wedges", "honey, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the French toast, place the milk, egg and cinnamon into a bowl and mix well. ", "Dip the soda farl halves into the egg mixture until soaked.", "Heat the butter in a frying pan and cook the soda farls for 2-3 minutes on each side, or until golden-brown. Set aside and keep warm.", "For the peaches, place the caster sugar, split vanilla pod and white wine into a saucepan and bring to the boil. Add the peach pieces to the pan and simmer for 4-5 minutes, or until the peach is tender.", "To serve, place the French toast onto a serving plate. Remove the peaches from the syrup with a slotted spoon and place on top of the toast, drizzled with honey."]}, {"isVegetarian": true, "title": "Cinnamon French toast with Chantilly cream and redcurrant sauce", "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_90386", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "100ml/3½fl oz double cream", "100ml/3½fl oz milk", "1 tbsp icing sugar", "½ tsp ground cinnamon", "2 slices white bread", "25g/1oz butter", "150ml/5fl oz double cream", "1 tbsp icing sugar", "85g/3oz redcurrants", "50ml/2fl oz red wine", "1 tbsp icing sugar", "sprig redcurrants", "fresh mint sprig"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the French toast, whisk the eggs in a bowl together with the cream, milk, icing sugar and cinnamon until well combined. Soak the bread slices in the mixture. ", "Melt the butter in a frying pan and fry the soaked bread for 2-3 minutes on both sides, or until golden-brown and crisp. Remove the fried bread from the pan and drain on kitchen paper.", "For the cream, lightly whip the cream with the icing sugar until soft peaks form when the whisk is removed from the bowl. ", "For the redcurrant sauce, place the redcurrants, wine and icing sugar in a food processor and blend until smooth. Push the mixture through a sieve to remove any pips. ", "To serve, place the French toast on a plate, top with the cream and spoon around the redcurrant sauce. Garnish with the redcurrant sprig and mint."]}, {"isVegetarian": true, "title": "Cinnamon French toast with honey, cream and orange", "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_90685", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "150ml/5fl oz milk", "1 tbsp caster sugar", "½ tsp ground cinnamon", "2 slices white bread", "25g/1oz butter", "1 orange, peeled and sliced", "icing sugar, for dusting", "2 tbsp clear honey", "3 tbsp double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg, milk, sugar and cinnamon together in a bowl until well combined, then soak the bread slices in the mixture.", "Melt the butter in a frying pan, add the bread slices and fry for 1-2 minutes on both sides, or until golden-brown all over. ", "To serve, arrange the orange slices on a serving plate, place the toast on top and dust with icing sugar. Drizzle over the honey and cream."]}, {"isVegetarian": true, "title": "Cinnamon oranges with baked meringue", "url": "www_bbc_co_uk_food_recipes_cinnamonorangeswithb_87126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 oranges, peeled and segmented", "¼ tsp ground cinnamon", "3 free-range egg whites", "100g/3½oz caster sugar", "icing sugar, to dust", "fresh mint sprigs, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Divide the oranges between two large dessert glasses and sprinkle over the cinnamon.", "In a large clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Gradually add the caster sugar, whisking continuously until the mixture is thick and glossy.", "Pipe or spoon the meringue mixture into the glasses to cover the oranges. Use a mini-blowtorch to brown the meringue all over.", "To serve, dust with icing sugar and garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Cinnamon puff with caramelised oranges", "url": "www_bbc_co_uk_food_recipes_cinnamonpuffwithcara_84454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz ready-rolled puff pastry", "1 tsp ground cinnamon", "2½ tbsp caster sugar", "150ml/¼pt double cream", "squeeze orange juice", "2 tsp icing sugar", "½ vanilla pod, seeds scraped out", "1 orange, peeled and segmented"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut a 6in triangle out of the ready-rolled puff pastry. Place onto a baking sheet and sprinkle with the cinnamon and half a tablespoon of the caster sugar. Place into the oven to cook for ten minutes.", "Place the cream, orange juice, icing sugar and vanilla seeds into a bowl, and whisk until the mixture forms soft peaks when the whisk is removed.", "Place the orange segments onto a baking sheet, sprinkle with the rest of the sugar and using a mini-blow torch,caramalise the sugar for two minutes, or until golden. ", "To serve, place the oranges onto a serving plate, place some cream on top and then the cooked cinnamon pastry."]}, {"isVegetarian": true, "title": "Cinnamon-spiced pear tatin", "url": "www_bbc_co_uk_food_recipes_cinnamonspicedpearta_93210", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "½ tsp salt", "250g/9oz cold butter, cut into small cubes", "125ml/4½fl oz ice-cold water", "4 pears, peeled, cores removed, cut in half", "110g/4oz caster sugar", "1 lemon, zest only", "2 vanilla pods, split, seeds scraped out (seeds only)", "110g/4oz butter", "150ml/5fl oz double cream", "2 star anise", "½ tsp ground cinnamon", "500ml/18fl oz vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour and salt into a large mixing bowl. Add the butter and use your hands to rub the butter into the flour. ", "When the flour and butter mixture resembles breadcrumbs, add the cold water. Mix it in with a palette knife to keep the mixture cool. When the mixture comes together to form a dough, turn it out onto a clean, floured surface and knead briefly until just smooth.", "Form the dough into a rectangular block (this will make it easier to roll out later), wrap in cling film and refrigerate for 20 minutes.", "Roll the chilled dough out onto a clean, floured surface into a rectangle about 40x20cm/16inx8in. Fold one-third of the dough into the centre, then fold the other third over that.", "Give the pastry a quarter turn and repeat step 4.", "Wrap the pastry block in cling film, refrigerate for 20 minutes then repeat steps 4 and 5.", "Wrap the pastry block in cling film and refrigerate for 30 minutes before using.", "Meanwhile, for the pear tatin, preheat the oven to 200C/400F/Gas 6.", "Place the pears, 25g/1oz of the sugar and all of the lemon zest and vanilla seeds into a saucepan. Fill the saucepan with enough water to just cover the pears. Heat the pears over a gentle heat until the mixture is simmering. Simmer for 15 minutes, or until the pears are just tender. Drain the pears and pat dry.", "Heat the remaining 85g/3oz of sugar in a 24cm/9½in ovenproof frying pan over a low heat until is has caramelised. Add the butter, cream, star anise and cinnamon to the pan and heat gently until the mixture forms a smooth caramel. Discard the star anise.", "Place the pears into the caramel, cut-side up. ", "Roll the chilled pastry out onto a floured surface to a 0.5cm/¼in thickness. Cut the pastry into a circle slightly larger than the frying pan.", "Place the pastry circle over the pears, tucking the edges of the pastry inside the pan to surround the pears.", "Transfer to the oven to bake for 20-25 minutes, or until the pastry is risen and golden-brown and cooked through. Once cooked, remove the pear tatin from the oven and set aside to cool for 5-10 minutes.", "To serve, invert the tarte tatin onto a serving plate. Slice the tatin into wedges and place a slice onto each of 4 serving plates. Top each slice with a scoop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Cinnamon sponge pudding with perry custard", "url": "www_bbc_co_uk_food_recipes_cinnamonspongepuddin_81026", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz butter, softened, plus extra for greasing", "110g/4oz caster sugar", "2 large free-range eggs, beaten", "110g/4oz self-raising flour", "3 tbsp milk", "salt", "1 tsp ground cinnamon", "3 tbsp golden syrup", "250ml/8¾fl oz milk", "250ml/8¾fl oz double cream", "100ml/3½fl oz perry", "1 vanilla pod, split", "8 free-range egg yolks", "75g/2½oz caster sugar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a clean bowl, cream together the butter and sugar until pale and fluffy, then gradually beat in the eggs one by one.", "Sift the flour and fold it into the creamed mixture with the milk, salt and cinnamon.", "Grease a 1-litre/1¾-pint pudding basin and spoon in the golden syrup.", "Pour the batter mixture on top of the syrup and cover with buttered greaseproof and foil and tie with string. Place on a trivet in a large pot with water to steam. Steam for 1½ hours.", "While this is steaming make the perry custard.", "Heat the milk with the cream, perry and vanilla pod and bring slowly to the boil. Remove from the heat.", "Beat the yolks in a separate clean bowl with the heated cream mixture and add the sugar until well blended. As the egg yolks warm, the cream will thicken to create custard. Keep stirring until the custard is thick enough to coat the back of a spoon.", "Once the sponge pudding has steamed, turn it upside down on a plate and shake gently. Serve with the custard."]}, {"isVegetarian": false, "title": "Summer berry cheesecake", "url": "www_bbc_co_uk_food_recipes_citrus_and_ginger_58132", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrus_and_ginger_58132_16x9.jpg", "ingredients": ["100g/3½oz butter, melted, plus extra for greasing", "300g/10½oz gingernut biscuits", "3 sheets leaf gelatine", "500g/1lb 2oz mascarpone", "1 lemon, zest and juice", "200ml/7fl oz double cream, lightly whipped", "175g/6oz golden caster sugar", "2 tbsp cold water", "4 tbsp ready-made lemon curd", "450g/1lb summer berries", "few mint sprigs", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Grease the base and sides of a 23cm/9in spring-form cake tin with a little melted butter and line with greaseproof paper.", "Chop the gingernuts in a food processor until they resemble breadcrumbs (alternatively, place them into a resealable freezer bag and bash with a rolling pin).", "Transfer the biscuit crumbs to a bowl and stir in the melted butter until well combined. Spoon the mixture into the prepared cake tin and press down into an even layer using the back of a wooden spoon. Chill in the fridge until needed.", "Meanwhile, soak the gelatine leaves in a bowl of cold water until pliant, about 10 minutes.", "Fold the mascarpone, lemon zest, lightly whipped double cream and caster sugar together in a mixing bowl until just combined.", "Heat the lemon juice and two tablespoons of water in a non-reactive saucepan over a low heat. Once pliant, squeeze any excess water from the gelatine leaves and add them to the warm lemon juice, stirring to dissolve.", "Fold the lemon and gelatine mixture into the mascarpone mixture until well combined. Marble through the lemon curd, a spoonful at a time.", "Pour the mixture on top of the cheesecake base, smoothing the top with a palette knife. Cover with cling film and chill in the fridge until set, preferably overnight.", "To serve, carefully remove the cling film and spring-form surround from the cheesecake and place onto a serving plate or cake stand. Top with a few summer berries, garnish with mint sprigs and dust lightly with icing sugar. Serve immediately."]}]