[{"isVegetarian": true, "title": "Herb risotto", "url": "www_bbc_co_uk_food_recipes_herbrisotto_85056", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 garlic clove, chopped", "250g/9oz basmati rice", "300ml/½ pint hot vegetable stock", "50g/1¾oz margarine", "handful each fresh dill, parsley, chervil, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan, add the onion and fry gently until softened. ", "Add the garlic and cook for one minute, then add the rice and stir well to coat the grains.", "Add a ladleful of hot stock to the pan and stir well until almost all of the stock has been absorbed. Repeat with the rest of the stock until all the stock has been absorbed and the rice is tender.", "Stir in the margarine and herbs, reserving some for the garnish, and season well with salt and freshly ground black pepper. ", "To serve, transfer the risotto to a bowl and garnish with the remaining herbs."]}, {"isVegetarian": false, "title": "Herb-stuffed chicken with crushed potatoes and red wine sauce", "url": "www_bbc_co_uk_food_recipes_herbstuffedchickenwi_86838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sprig fresh rosemary, chopped", "small handful fresh parsley, chopped", "½ garlic clove, chopped", "salt and freshly ground black pepper, to taste", "1 chicken drumstick", "dash olive oil", "10 new potatoes, peeled and halved", "¼ onion, finely diced", "2 tbsp butter", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper, to taste", "1 tbsp double cream", "dash olive oil", "55g/2oz cherry tomatoes", "3 tbsp red wine", "1 tbsp balsamic vinegar", "small handful broccoli, cut into florets, steamed, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, mix the herbs, garlic and seasoning together in a bowl then push the mixture under the skin of the chicken drumstick. ", "Heat a dash of olive oil in an ovenproof frying pan, add the chicken and fry for four minutes. Turn over and place in a hot oven for ten minutes, or until the juices are clear when you stick the tip of a knife into the chicken and it's completely cooked through.", "For the potatoes, boil the potatoes in salted boiling water for ten minutes or until soft. Drain well, add the onion, butter, chives, salt and freshly ground black pepper and double cream and mash until smooth.", "For the sauce, pour a splash of olive oil into a clean frying pan. Add the cherry tomatoes and fry for five minutes. Add the red wine and balsamic vinegar to the pan and simmer for one minute.", "To serve, pile the crushed potatoes onto a serving plate, top with the chicken drumstick and pour the red wine sauce over the top. Serve with the steamed broccoli."]}, {"isVegetarian": true, "title": "Herby cocktail", "url": "www_bbc_co_uk_food_recipes_herby_cocktail_97456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "1 lemon, zest and juice", "6 lemon verbena leaves, lightly bruised, plus extra for serving", "1 tsp orange blossom water", "400ml/14fl oz soda water", "100ml/3½fl oz vodka", "ice"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make a sugar syrup, put the sugar, lemon zest and juice, and 200ml/7fl oz water  in a large saucepan placed on a medium-low heat. Warm until the sugar has dissolved.", "Mix together the sugar syrup, bruised verbena leaves, orange blossom water, soda water and vodka in a jug.", "Pour into glasses filled with ice and finish with lemon verbena leaves. "]}, {"isVegetarian": true, "title": "Herby puff twists and pepper and goats’ cheese palmiers", "url": "www_bbc_co_uk_food_recipes_herby_puff_twists_and_39016", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_puff_twists_and_39016_16x9.jpg", "ingredients": ["500g/1lb 2oz plain flour, plus extra for dusting ", "1 tsp fine sea salt", "50g/1¾oz butter, melted", "400g/14oz very cold unsalted butter ", "1 free-range egg, beaten, for egg wash ", "1 tbsp finely chopped fresh rosemary", "1 tbsp finely chopped fresh thyme", "1 tbsp finely chopped fresh sage", "50g/1¾oz fine breadcrumbs ", "freshly ground black pepper ", "½ unwaxed lemon, zest only", "100g/3½oz roasted red peppers from a jar, drained, finely chopped ", "140g/5oz hard goats' cheese, finely grated "], "serves": "Makes 25 of each variety", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, sift the flour into a large mixing bowl and make a well in the centre. Add the salt, 225ml/8fl oz ice-cold water and melted butter into the middle of the well. Using your fingertips, gradually stir the liquid and incorporate the flour. Once the mix has come together into a dough, knead it a few times firmly to bring it into a ball. Wrap it in cling film and chill for 10 minutes in the freezer.", "Remove the butter from the fridge and place it in between two sheets of greaseproof paper. Use a rolling pin to beat the butter block into a 19cm/7½ in square. Chill in the freezer for 10 minutes.", "Remove the dough from the freezer and tip onto a lightly floured surface. Roll out the dough into a diamond shape that is a bit larger than the size of the butter block. Place the butter in the centre of the dough (with the flat sides of the block facing the points of the diamond) and pull the flaps over the top and pinch to seal them.", "Roll the pastry away from you into a rectangle that is 75x30cm/30x12in. Move the pastry frequently to prevent sticking and work quickly to avoid heating the dough. ", "To make a letter turn, place the rolled out dough on the surface with the short side nearest to you. Pull the top third of dough down over the middle third then lift the bottom third over the folded portion, just like an A4 letter. Make sure the edges match up and are square. Dust off any excess flour with a pastry brush. Place the dough in a freezer bag and place in the freezer for 10 minutes. This is the first turn. Take note of the number of turns that has been performed at each stage.", "Repeat the rolling, folding and turning four more times to give five letter turns in total. Split the dough into two equal portions and refrigerate until ready to use.", "Preheat the oven to 210C/190C Fan/Gas 6½. Line two baking trays with baking paper. ", "For the herby puff twists, mix the herbs in a small bowl with the breadcrumbs, pepper and lemon zest and stir to combine. ", "Roll one piece of the pastry out on a lightly floured surface to roughly 40x30cm/16x12in with the short side nearest you. It should be the thickness of a pound coin. Brush egg wash over the pastry then liberally sprinkle the herb mix over the dough. Press the filling lightly into the dough all over using a rolling pin.", "Tightly roll the bottom two-thirds of the dough up like a Swiss roll so the filling is on the inside. For the last third, roll it underneath itself in the opposite direction so the filling is on the outside. ", "Place the roll onto a baking tray, slide into a large freezer bag and freeze for 10 minutes.", "Use a sharp knife to cut off any ragged ends then cut into 1cm/½in slices and lay them flat on one of the prepared trays, leaving at least 5cm/2in between each as they will spread during baking.", "Bake for 11 minutes, flip them over and bake for a further 11 minutes until golden-brown and puffed up. Transfer to a cooling rack. ", "For the pepper and goats’ cheese palmiers, roll one piece of the puff pastry out on a lightly floured surface to roughly 40x30cm/16x12in with the short side facing you. Spread the goats’ cheese and peppers over the pastry. Press the filling lightly into the dough all over using a lightly oiled rolling pin.", "Fold the bottom sixth of dough upwards and press down, then repeat this fold once more upward and you should be near the midpoint of the dough. Repeat this double fold for the top of the pastry coming down. Lightly brush some beaten egg along the top of the folded portions, then fold these together like a book. All the topping should be on the inside. ", "Place the roll onto a baking tray, slide into a large freezer bag and freeze for 10 minutes.", "Use a sharp knife to cut off any ragged ends then cut 1cm/½in slices and lay them flat on the preapred tray. Clean the knife using kitchen paper between each slice. Leave at least 5cm/2in between each as they will spread during baking.", "Bake for 11 minutes then flip and bake for a further 11 minutes until golden-brown and puffed up. Transfer to a cooling rack."]}, {"isVegetarian": false, "title": "Herby chicken and potato salad", "url": "www_bbc_co_uk_food_recipes_herby_skyr_chicken_salad_90551", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_skyr_chicken_salad_90551_16x9.jpg", "ingredients": ["2 skinless, boneless chicken breasts", "75g/2½oz plain skyr or Greek yoghurt", "1 tbsp olive oil, plus extra for cooking", "handful flat-leaf parsley, chopped ", "1 tsp ground ginger", "¼ lemon, juice only", "salt and freshly ground black pepper", "250g/9oz new potatoes", "1 courgette, grated", "1 large carrot, cut into ribbons using a vegetable peeler", "50g/1¾oz plain skyr or Greek yoghurt", "25ml/1fl oz olive oil", "1 tsp Dijon mustard", "1–1½ tsp cider vinegar", "½–1 tsp runny honey", "4 tbsp finely chopped fresh chives, plus extra for garnish"], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the marinated chicken, cut down the centre of each breast lengthways, being careful not to cut all the way through. Open each breast up like a book and flatten using the palm of your hand.", "Put the skyr or yoghurt, oil, parsley, ginger, lemon juice and some salt and pepper in a food processor and blend until smooth.", "Put the butterflied chicken breasts in a freezer bag and add the marinade, mixing well to cover the chicken. Seal and chill in the fridge.", "Meanwhile, to make the salad, boil the potatoes for 15 minutes, or until tender, and drain. Cover with cold water and set aside to cool.  ", "To make the dressing, whisk together the skyr or yoghurt, oil, mustard, 1 teaspoon of the vinegar and ½ teaspoon of the honey, along with a pinch of salt and pepper. If the mixture is a little thick, add a tablespoon of water at a time until the desired consistency is reached. Stir in the chives and adjust the seasoning, or add a little more vinegar and/or honey if needed.", "Halve the cooled potatoes and toss with a little of the dressing in a bowl, until coated. Put the courgette and carrot in a serving bowl and add dressed potatoes.", "Heat a dash of oil in a large, heavy-based frying pan over a medium–high heat. Shake off the excess marinade and cook the chicken, opened out, for 4 minutes on either side, or until cooked through. Reduce the heat if it is browning too much. ", "Slice the chicken and place on top of the salad. Drizzle over the rest of the dressing, garnish with more chopped chives and serve."]}, {"isVegetarian": false, "title": "Herby smoked salmon omelette", "url": "www_bbc_co_uk_food_recipes_herby_smoked_salmon_77028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_smoked_salmon_77028_16x9.jpg", "ingredients": ["8 free-range large eggs", "2 spring onions, thinly sliced", "2 tbsp chopped chives", "2 tbsp chopped chervil", "20g/¾oz butter", "4 thin slices of smoked salmon, cut into thin strips, or 125g/4½oz smoked salmon trimmings", "100g/3½oz salad leaves", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the eggs, spring onions and herbs in a bowl, beat together lightly and season with freshly ground black pepper.", "Heat a medium-sized frying pan over a medium-low heat, add a quarter of the butter and melt until beginning to foam. Pour in a quarter of the egg mixture and swirl to cover the base of the pan. Stir gently for 2-3 minutes or until almost set.", "Sprinkle over a quarter of the smoked salmon strips and cook for a further 30 seconds, or until just set. Fold over and slide on to a serving plate. Repeat to make 3 more omelettes. Serve each omelette with salad leaves."]}, {"isVegetarian": true, "title": "Herby tabbouleh", "url": "www_bbc_co_uk_food_recipes_herby_tabbouleh_16740", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz bulgur wheat, soaked in cold water overnight", "3 tbsp roughly chopped mint ", "3 tbsp roughly chopped coriander", "2 tbsp chopped parsley", "½ red onion, finely chopped", "50g/1¾oz pistachio nuts, roughly chopped", "100g/3½oz fresh raspberries", "100g/3½oz dried apricots, roughly chopped", "1 pomegranate, seeds only", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Drain the bulgur wheat well, pressing down lightly to ensure all the water is removed. Put in a large bowl.", "Add all the other ingredients and mix well. Season, to taste, with salt and pepper and serve. "]}, {"isVegetarian": true, "title": "Butternut squash tagine with couscous", "url": "www_bbc_co_uk_food_recipes_herbycouscouswithbut_92552", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbycouscouswithbut_92552_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 onion, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "½ tsp cayenne pepper", "1 tsp ground ginger", "1 tsp ground coriander", "2 tsp ground cumin", "1 cinnamon stick", "1 tsp ground turmeric", "1 butternut squash, peeled, seeds removed, cut into 1cm/½in cubes", "200g/7oz tinned chopped tomatoes", "200ml/7fl oz vegetable stock", "3 preserved lemons, rind only, roughly chopped", "1 tbsp clear honey", "salt and freshly ground black pepper ", "400g/14oz couscous", "600ml/1 pint 2fl oz hot vegetable stock", "2 lemons, zest only", "100g/3½oz toasted flaked almonds", "1 tbsp each chopped fresh parsley, chives and coriander", "1 tbsp olive oil", "small handful coriander, to garnish "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the butternut squash tagine, heat one tablespoon of the olive oil in a frying pan over a medium heat. Add the onion and fry for 4-5 minutes. Add the garlic and fry for a further 3-4 minutes, or until softened.", "Add the cayenne pepper, ground ginger, ground coriander, ground cumin, cinnamon stick and ground turmeric and stir well. Continue to cook for 3-4 minutes, or until the spices are fragrant. ", "Add the butternut squash cubes and stir well to coat the squash in the spices.", "Add the chopped tomatoes, stock, preserved lemons and honey, then season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer and cook for 10 minutes, or until the butternut squash is tender but still holds its shape.", "Meanwhile, for the herby couscous, place the couscous into a large bowl and pour over the hot chicken stock. Cover the bowl with cling film and set aside until the couscous has absorbed all of the stock, about three minutes. ", "Fluff up the couscous using a fork, then stir in the lemon zest, flaked almonds, chopped herbs and olive oil until well combined. ", "Serve the couscous with the tagine on top and a little chopped coriander to garnish."]}, {"isVegetarian": false, "title": "Herb-crusted cod loin with sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_herbycrustedcodloinw_86860", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz potatoes, peeled and cut into cubes", "1 tbsp olive oil", "1 sprig fresh rosemary", "small handful fresh flatleaf parsley", "small handful fresh coriander", "2 slices white bread", "1 tbsp olive oil", "150g/5½oz cod loin"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the potatoes, bring a pot of salted water to the boil, add the potatoes and simmer for five minutes. Drain.", "Heat the olive oil in a small non-stick frying pan and sauté the potatoes with the rosemary for ten minutes, or until golden and tender.", "For the fish, place the herbs and bread into a small food processor and pulse to make breadcrumbs. Roll the fish in the crumbs to coat well.", "Heat the olive oil in a small non-stick ovenproof frying pan and fry the fish for two minutes on each side, or until crisp and golden.  ", "Transfer to the oven for a further 4-5 minutes, or until cooked through.", "Serve the fish on top of the sauteéd potatoes."]}, {"isVegetarian": true, "title": "Heritage carrots, goats’ curd, oats and hazelnuts", "url": "www_bbc_co_uk_food_recipes_heritage_carrots_goats_73817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz white wine vinegar", "50g/1¾oz caster sugar", "1 tbsp chopped fresh tarragon leaves", "10 coriander seeds", "1 star anise", "1 bunch yellow heritage carrots", "100g/3½oz oats, sieved", "50g/1¾oz blanched hazelnuts, roughly chopped, plus 4 hazelnuts, grated, for garnish", "1 tbsp grape seed oil", "1 bunch orange heritage carrots, leaves reserved", "2 tbsp olive oil", "1 tsp salt", "1 tbsp chopped fresh thyme leaves", "100ml/3½fl oz carrot juice", "30g/1oz butter", "60g/2¼oz cream", "300g/11oz goats’ curd, mixed with a little milk ", "nasturtium leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickled carrots, put the vinegar, sugar, tarragon, coriander seeds and star anise in a medium saucepan with 50ml/2fl oz water and heat until the sugar has melted.", "Heat a large saucepan of boiling water and blanch the yellow carrots until cooked but still with a little crunch. Place in iced water, drain, then put them into the pickling solution.", "For the oats and hazelnuts, preheat the oven to 150C/300F/Gas 2.", "Spread the oats and chopped hazelnuts out on a large baking tray and drizzle over the grape seed oil. Roast for 10-15 minutes, or until golden-brown, then set aside.", "Increase the oven temperature to 170C/340F/Gas 3½.", "Place the orange carrots on a separate baking tray, drizzle with the oil and sprinkle over the salt and thyme. Roast for 20-25 minutes.", "Meanwhile, heat the carrot juice in a pan until reduced in volume to a sticky consistency.", "Heat the butter and cream in a separate large saucepan and whisk continually. Reduce it in volume and cook until it turns a toffee brown colour. Add it to the reduced carrot juice.", "Drain the pickled carrots from the pickling liquid.", "Serve the goat’s curd, pickled carrots, roasted carrots, oats, nuts, carrot leaves and nasturtium leaves dressed with the carrot juice and garnished with the grated hazelnuts."]}, {"isVegetarian": true, "title": "Herby salad dressing", "url": "www_bbc_co_uk_food_recipes_herbysaladdressing_67766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz water", "200ml/7fl oz olive oil", "55ml/2fl oz tarragon vinegar", "1 sprig thyme", "1 bay leaf", "1 garlic clove"], "serves": "Makes 400ml/14fl oz", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the ingredients together and leave to infuse at room temperature for 1-2 days before using."]}, {"isVegetarian": true, "title": "Heritage tomato and mozzarella salad", "url": "www_bbc_co_uk_food_recipes_heritage_tomato_and_03417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2lb 7oz heritage tomatoes (Marmande, Coeur de Boeuf, Darby Striped Yellow/Green and Black Russian) ", "1 Rose de Roscoff onion, cut into 3mm slices ", "20 basil leaves, roughly chopped ", "3 tbsp finely chopped chives ", "1 garlic clove, chopped ", "2 tbsp white wine vinegar ", "6 tbsp extra virgin olive oil ", "sea salt and freshly ground black pepper ", "1 head Freckles lettuce, leaves picked ", "1 head Seurat lettuce, leaves picked ", "1 head Lollo Rosso lettuce, leaves picked ", "1 head Reine des Glaces lettuce, leaves picked ", "1 tbsp white wine vinegar ", "2 tbsp extra virgin olive oil, plus a little extra to finish ", "3 x 120g/4¼oz buffalo mozzarella ", "50g/1¾oz Kalamata olives, pitted, dried in the oven for 1 hour at 100C/90C Fan/Gas ¼, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomatoes, using a small paring knife, cut the hard core out of each tomato, then cut each into quarters. Transfer to a large bowl. Season with a pinch each of salt and pepper. Stir so the seasoning lightly cures the tomatoes, which will then produce a beautiful juice. Mix in the onion, herbs, garlic, vinegar and oil. Stir and leave to marinate for a minimum of 10 minutes for the flavours to infuse. ", "For the salad, at the last moment, mix the leaves in a large bowl. Season with a pinch each of salt and pepper, then toss the leaves with the vinegar and olive oil. ", "Arrange the leaves on a large platter. With a large spoon, lift the tomato mixture onto the salad. Cut the mozzarella in half and scatter around the salad. Sprinkle over the dried olives and finish with a drizzle of your best extra virgin olive oil. "]}, {"isVegetarian": true, "title": "Herby rice", "url": "www_bbc_co_uk_food_recipes_herbyrice_75769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rice, cooked", "2 tsp soy sauce", "handful fresh coriander, chopped", "1 lime, juice and zest"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together all the ingredients and serve."]}, {"isVegetarian": true, "title": "Herby noodle tortilla with chilli peanut dressing", "url": "www_bbc_co_uk_food_recipes_herbynoodletortillaw_87403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs", "salt and freshly ground black pepper", "small handful each fresh basil, fresh coriander, fresh parsley, chopped", "150g/5½oz fresh egg noodles", "25g/1oz butter", "dash olive oil", "dash olive oil", "¼ onion, sliced", "1 garlic clove, peeled and chopped", "½ fresh red chilli, finely sliced", "1 tsp white wine vinegar", "3 tbsp soy sauce", "2 tbsp edamame beans", "1 tbsp chopped cashews"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tortilla, crack the eggs into a bowl, season with salt and freshly ground black pepper and beat well. Stir in the herbs and egg noodles. ", "Heat the butter and oil in a medium frying pan, add the egg and noodle mixture and cook for about 3-4 minutes, or until just set. Slide onto a plate and leave to cool slightly before slicing.", "For the dressing, heat the oil in a small saucepan, add the onion and sauté for 3-4 minutes. Add the garlic and cook for a further 1-2 minutes. Add the rest of the ingredients and warm through for 1-2 minutes. ", "To serve, place slices of the tortilla onto a serving plate and drizzle over the dressing."]}, {"isVegetarian": true, "title": "Heritage tomato tart with blow-torched tomato salad", "url": "www_bbc_co_uk_food_recipes_heritage_tomato_tart_49741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz ready-made all-butter puff pastry", "plain flour, for dusting", "1 free-range egg yolk, beaten", "200g/7oz Gruyère, grated", "400g/14oz mixed heritage tomatoes, thickly sliced", "4 sprigs fresh thyme, leaves only", "1 tbsp rapeseed oil", "salt and freshly ground black pepper", "300g/10½oz heritage tomatoes", "1 red onion, thickly sliced", "2 heads Romaine lettuce, roots removed, cut into thick slices", "4 tbsp vegetable oil", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "1 egg yolk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato tart, preheat the oven to 210C/190C Fan/Gas 7.", "Roll out the pastry on a lightly floured work surface to form a large square about 3mm thick.", "Cut 4 x 17.5cm/7in circles from the pastry using an upturned bowl or cake tin. Transfer each to a baking tray. ", "Using a sharp knife, score a 1.5cm/½in border around the edge of each pastry circle. Brush each border with a little of the egg yolk.", "Pile a quarter of the grated Gruyère in the centre of each pastry circle. Arrange the tomato slices in concentric circles on top of the cheese. Season, to taste, with salt and freshly ground black pepper, then scatter over the thyme leaves and drizzle with a little rapeseed oil.", "Bake the tarts in the oven for 12-15 minutes, or until the pastry borders have risen and are golden-brown and the filling is bubbling. ", "Meanwhile, for the tomato salad, lay the tomatoes, red onion and lettuce on a roasting tray and drizzle over a little of the vegetable oil. Mix well to coat everything in the oil. ", "Place the roasting tray onto a heatproof surface and, using a chefs' blow torch, char until caramelised – this should take 4-5 minutes. Alternatively, preheat your grill to its highest setting and grill the vegetables for 4-5 minutes.", "Shake the vinegar, mustard, egg yolk and the remaining vegetable oil in a clean, sealed jam jar until well combined, then season, to taste, with salt and freshly ground black pepper. ", "To serve, place a tart on each serving plate. Transfer the blow-torched vegetables to a large bowl and drizzle over enough of the dressing to coat the leaves. Mix the salad to coat it in the dressing, then serve."]}, {"isVegetarian": false, "title": "Herring in oats with potato salad", "url": "www_bbc_co_uk_food_recipes_herring_in_oats_with_84871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz small new potatoes", "50g/2oz kale, very coarsely chopped", "¼ cucumber, cut in half lengthways, seeds scooped out with a spoon, thickly sliced", "1-2 spring onions, trimmed and sliced", "1 tbsp white balsamic vinegar", "2 tbsp cold-pressed rapeseed oil", "squeeze lemon juice", "salt and freshly ground black pepper", "2 handfuls ‘medium’ oatmeal ", "salt and freshly ground black pepper", "6 herring fillets, scales and central line of bones removed (ask your fishmonger to do this for you)", "dollop English mustard", "30g/1¼oz butter", "splash rapeseed oil", "lemon wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato salad, boil the new potatoes in a large saucepan of salted water until tender (about 12 minutes). Add the kale and cucumber to the pan three minutes before the potatoes are ready and boil until all of the ingredients are tender. Drain well and set aside.", "For the dressing, whisk together the vinegar, rapeseed oil and lemon juice in a jug until well combined. Season, to taste, with salt and freshly ground black pepper. Set aside.", "For the herring, sprinkle the oatmeal onto a plate and season with salt and freshly ground black pepper.", "Brush both sides of each herring fillet with a little of the mustard, then roll in the seasoned oatmeal until completely covered. ", "Heat the butter and the oil in a large, heavy-based frying pan over a medium heat. Add the coated herring fillets to the pan, skin-side up (do this in batches if necessary). Gently press down on each of the herring fillets using a fish slice so that they stay flat. Fry for 1-2 minutes, or until the oats are golden-brown, then turn over and continue to fry on the other side for a further 1-2 minutes, or until the herrings are cooked through and the oats are golden-brown. ", "Remove the herring fillets from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "Place the boiled potatoes, kale and cucumber into a serving bowl, stir in the spring onions, and drizzle over the dressing. Mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the herring equally between two serving plates. Spoon the potato salad alongside and serve with a wedge of lemon."]}, {"isVegetarian": true, "title": "Hot chocolate and cherry fondants", "url": "www_bbc_co_uk_food_recipes_hhh_87203", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter, plus extra for greasing", "100g/3½oz caster sugar", "1 tsp baking powder", "100g/3½oz cocoa powder", "200g/7oz self-raising flour", "8 cherries, stones removed, plus 4 extra cherries to garnish", "100g/3½oz cocoa powder", "150ml/¼ pint water", "2 tbsp caster sugar", "2 tbsp double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease the insides of two 7.5cm/3in chefs' rings with butter and lay on a baking sheet lined with non-stick babking paper.", "Place the butter, sugar, baking powder, cocoa and flour into a food processor and blend until completely combined.", "Add the eight cherries and stir well with a wooden spoon. ", "Divide the mixture between the two chefs' rings, then transfer to the oven to bake for 10-12 minutes, or until risen and cooked through.", "For the sauce, heat the cocoa powder, water and sugar in a pan until the sugar has dissolved and the sauce is glossy and smooth.", "To serve, transfer the fondants to dessert plates and remove the rings.", "Pour over the chocolate sauce and drizzle a tablespoon of cream over each and garnish with two extra cherries."]}, {"isVegetarian": false, "title": "Herring with dill and mustard potato salad", "url": "www_bbc_co_uk_food_recipes_herringwithdillandmu_88218", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herringwithdillandmu_88218_16x9.jpg", "ingredients": ["100ml/3½fl oz water", "2 limes, juice only", "100ml/3½fl oz white wine", "1 tsp white peppercorns", "2 bay leaves", "1 tbsp white wine vinegar", "1 tsp salt", "4 x 100g/3½oz herring fillets ", "250g/9oz cooked new potatoes", "100ml/3½fl oz mayonnaise ", "1 tbsp chopped fresh dill", "1 tbsp wholegrain mustard", "½ lemon, juice only", "½ tsp curry paste", "salt and freshly ground black pepper", "few sprigs fresh dill", "lemon wedges"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the herring, bring the water, lime juice, white wine, peppercorns, bay leaves, white wine vinegar and salt to a slow boil in a pan. Turn down the heat to a gentle simmer, add the fish and poach for about 12 minutes, or until cooked through.", "For the potato salad, cut the cooked potatoes in half and place into a large bowl.", "In another bowl, combine the mayonnaise, dill, mustard, lemon juice, curry paste, salt and freshly ground black pepper. Add to the bowl with the potatoes and stir to coat. ", "Drain the fish, then place it on top of the potato salad. Garnish with more dill and lemon wedges."]}, {"isVegetarian": false, "title": "Hidden vegetables shepherd’s pie", "url": "www_bbc_co_uk_food_recipes_hidden_vegetables_05418", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hidden_vegetables_05418_16x9.jpg", "ingredients": ["1 onion, finely chopped", "400g/14oz lamb mince", "2 tbsp plain flour", "2 carrots (approximately 100g/3½oz each), peeled, finely grated", "2 courgettes (approximately 175g/6oz each), peeled, finely grated", "400g tin chopped tomatoes", "2 tbsp tomato purée", "200ml/7fl oz just-boiled water", "½ tsp dried mixed herbs", "1 lamb stock cube", "salt and freshly ground black pepper", "800g/1lb 12oz floury potatoes, peeled, chopped into cubes", "50g/2oz butter", "4 tbsp milk", "100g/3½oz mature Cheddar, coarsely grated", "1 small cauliflower (approximately 650g/1lb 7oz), trimmed, stalk removed, finely grated"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Heat a large, non-stick saucepan over a medium heat. Add the onion and mince and dry-fry for 8-10 minutes, stirring regularly until the mince has browned.", "Sprinkle the flour over the lamb and stir well. Add the carrots, courgettes, tomatoes, tomato purée, water and herbs and stir again to combine. Crumble over the stock cube, season with salt and pepper. ", "Bring to the boil, then simmer for 25-30 minutes, stirring regularly, until the sauce has thickened and the vegetables have almost completely broken down. ", "Meanwhile, bring a saucepan of water to the boil.  Add the potatoes and cook for 15-20 minutes, or until soft but not falling apart.", "Transfer the filling mixture to a 2 litre/3½ pint shallow ovenproof dish and place on a baking tray.", "Drain the potatoes and return to the pan. Add the butter and mash until smooth, then beat in the milk until fluffy. Stir in half of the cheese. Mix in the cauliflower and season with salt and pepper. Add a little extra milk if required. ", "Spoon the mash on top of the lamb and spread evenly. Sprinkle over the remaining cheese. Bake for 25-30 minutes, or until the cheese has melted and turned golden-brown and the filling is bubbling. "]}, {"isVegetarian": false, "title": "Highland beef salad", "url": "www_bbc_co_uk_food_recipes_highland_beef_salad_45037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/highland_beef_salad_45037_16x9.jpg", "ingredients": ["1 x 300g/10½oz sirloin or fillet steak ", "salt and freshly ground black pepper", "25ml/1fl oz rapeseed oil", "1 red chilli, finely chopped", "1 tbsp palm sugar", "2 garlic cloves, sliced", "2 tbsp fresh coriander, plus extra for the salad", "2 tbsp fresh mint", "1 tsp fish sauce", "1 tbsp soy sauce", "1 lime, juice and zest", "1 round lettuce", "50g/1¾oz sugar-snap peas, halved", "6 radishes, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a barbecue or griddle pan to hot.", "Season the steak with lots of black pepper, drizzle with oil and place onto a hot barbecue or griddle pan for five minutes, turning half-way through.", "To make the dressing, put the chilli, palm sugar, garlic and a teaspoon of salt into a pestle and mortar. Grind for 1-2 minutes, then add the coriander and mint and grind for another minute. Mix in the fish sauce, soy sauce, lime juice and zest.", "Cut the lettuce into six wedges and place in a bowl. Top with the sugar-snap peas, radishes and a few coriander leaves. Pour the dressing over the salad and toss to coat. Slice the beef and lay it on top of the salad."]}, {"isVegetarian": true, "title": "Hide-and-seek cheesecake", "url": "www_bbc_co_uk_food_recipes_hide-and-seek_cheesecake_00243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 digestive biscuits", "20g/¾oz butter, melted", "12-16 fresh raspberries, plus extra to garnish", "125g/4½oz soft cream cheese", "1 free-range egg, beaten", "½ tsp vanilla extract", "30g/1¼oz caster sugar"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the biscuits into a food bag and lightly bash with a rolling pin until they resemble breadcrumbs.", "Mix together the crushed biscuits and melted butter until well combined.", "Divide the mixture equally among four ramekins, pressing each portion down into an even layer at the base using your fingertips. ", "Divide the raspberries equally among the ramekins, putting them on top of the biscuit base. ", "Whisk together the cream cheese, beaten egg, vanilla extract and sugar until smooth and well combined.", "Spoon the cream cheese mixture into the ramekins, smoothing the tops of each with a palette knife. Transfer the ramekins to a baking tray.", "Bake the cheesecakes in the oven for 18-20 minutes, or until the tops are light golden-brown and the cheese mixture is just set in the middle, with a slight wobble.", "To serve, place the ramekins onto dessert plates and garnish with fresh raspberries."]}, {"isVegetarian": false, "title": "Hoisin salmon with broccoli and noodles", "url": "www_bbc_co_uk_food_recipes_hoisin_salmon_with_44468", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hoisin_salmon_with_44468_16x9.jpg", "ingredients": ["4 x 125g/4oz salmon fillets, with skin left on", "2 heaped tbsp hoisin sauce (from a jar or bottle)", "150g/5½oz cherry tomatoes, halved", "140g/5oz medium egg noodles", "200g/7oz long-stemmed broccoli, trimmed ", "freshly ground black pepper", "dark soy sauce, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 and line a small, shallow ovenproof dish with kitchen foil. ", "Place the salmon fillets into the dish, skin-side down, and brush generously with the hoisin sauce. Make sure the fillets are placed at least 5cm/2in apart from each other. Scatter the cherry tomatoes around them. Cook for 15 minutes, or until the salmon is cooked through. ", "Meanwhile, prepare the noodles. Half-fill a saucepan with water and bring to the boil. Add the noodles, return to the boil and cook for 1 minute, stirring to separate the strands. Add the broccoli and cook for 3 more minutes, stirring occasionally.", "Divide the noodles and broccoli between four warmed plates. Top with the salmon fillets and scatter with the cherry tomatoes. Season with pepper and serve sprinkled with a little soy sauce, if using.  "]}, {"isVegetarian": false, "title": "Hoi An crispy beef", "url": "www_bbc_co_uk_food_recipes_hoiancrispybeef_81504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs, beaten", "1 tbsp sesame oil", "1 tsp palm sugar", "2 tsp galangal, sliced into strips", "1 tbsp root ginger, sliced into strips", "3 tsp sesame seeds", "1 tbsp fish sauce", "1 tsp rice wine or sake", "1 tsp freshly ground black pepper", "500g/1lb 2oz beef fillet, thinly sliced across the grain", "sunflower oil or groundnut oil, for deep frying", "cornflour, for coating"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Mix all the marinade ingredients together in a bowl and add the sliced beef. Marinate for as long as you can or overnight if possible.", "For the beef, heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the beef in the cornflour, then add to the oil and fry until slightly golden. Don't be tempted to put lots of beef into the oil at once, but cook in batches. Remove with a slotted spoon and drain on kitchen towel. Serve immediately."]}, {"isVegetarian": false, "title": "Hoisin and plum-glazed ham with lemon potato salad", "url": "www_bbc_co_uk_food_recipes_hoisinandplumglazedh_84880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3kg/4lb 4oz - 6lb 6oz easy-carve ready-cooked ham leg", "15-20 whole star anise, to decorate", "125ml/4½fl oz hoisin sauce", "125ml/4½fl oz plum sauce", "60ml/2½fl oz Chinese rice wine", "60ml/2½fl oz soy sauce", "60g/2½oz soft brown sugar", "1 tsp Chinese five-spice powder", "750g/1lb 10oz waxy potatoes (such as kipfler), peeled and sliced", "1 tsp sea salt", "75ml/3fl oz extra virgin olive oil", "125ml/4½fl oz lemon juice", "1 tbsp sumac (available in Middle Eastern grocers)", "salt and freshly ground black pepper ", "1 lime, juice only", "1 small green pepper, seeds removed, finely chopped", "2 large red chillies, seeded, finely chopped", "1 small bunch fresh mint, roughly chopped", "1 large bunch fresh flatleaf parsley leaves", "6 spring onions, finely sliced"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/355F/Gas 4.", "Using a small sharp knife, cut through the rind around the shank of the ham. Carefully lift the rind from the fat in one piece, running your fingers through where the rind and fat are joined to ease away. Reserve the rind and use to cover the cut ham when storing.", "Score the white fat in a diamond pattern and press star anise into the centre of every second or third scored diamond.", "Place the ham on a rack over a roasting tray, then pour a small amount of water into the base of the roasting tray to prevent the glaze from burning.", "Place the remaining ham ingredients into a saucepan over low heat, stirring until the sugar has completely dissolved.", "Remove the glaze mixture from the heat and carefully pour over the ham making sure that all of the exposed fat is covered.  ", "Transfer the ham to the oven to bake for 30-40 minutes, basting occasionally, until the ham is golden all over. ", "Remove the ham from the oven and place it onto a large platter ready to carve.", "For the lemon potato salad, bring a large saucepan of water to the boil then add the potatoes and salt. Reduce the heat and simmer for about 8-10 minutes, until the potatoes are tender when pierced with a knife. Remember to undercook the potatoes a little, because they will continue cooking in their own heat and steam when removed from the water.", "Place the olive oil, lemon juice and sumac into a bowl, stir to combine and season, to taste, with salt and freshly ground black pepper. ", "Pour half of the sumac dressing over the hot potatoes and stir very gently. Leave to cool, then add the capsicum, chilli, mint, parsley, spring onion and remaining dressing and stir gently to combine.", "To serve, place several slices of ham onto each plate with a large spoonful of potato salad alongside."]}, {"isVegetarian": true, "title": "Hollandaise sauce", "url": "www_bbc_co_uk_food_recipes_hollandaisesauce_1309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hollandaisesauce_1309_16x9.jpg", "ingredients": ["3 tbsp white wine vinegar", "6 peppercorns", "1 dried bay leaf", "2 eggs, yolks only", "125g/4oz butter", "lemon juice, salt and pepper to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the vinegar in a small pan with the peppercorns and bay leaf. Reduce the vinegar over a high heat until there is only 1 tbsp left. Strain the peppercorns and the bay leaf from this reduction.", "Put the egg yolks in a food processor with the vinegar reduction.", "Gently melt the butter so that the butter solids fall to the bottom of the saucepan.", "Turn the food processor on and slowly pour the butter on to the egg yolks with the motor still running. The sauce will start to thicken. When only the butter solids are left, stop.", "If the sauce is too thick, add a little hot water.", "Season to taste with salt and pepper and a little lemon juice."]}, {"isVegetarian": false, "title": "Hoki with patatas bravas", "url": "www_bbc_co_uk_food_recipes_hokiwithpatatasbrava_84674", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for roasting", "6-8 large baking potatoes, peeled, cut into 2.5cm/1in cubes", "salt and freshly ground black pepper ", "4 garlic cloves, crushed", "2 x 400g/13oz cans chopped tomatoes", "2 small red chillies, seeds removed, chopped", "1 tsp paprika", "1 tbsp chopped fresh parsley", "10 x 150g/5oz hoki steaks", "1 lemon, juice only", "400g/13oz mature cheddar or Manchego cheese, grated ", "25g/1oz Dijon mustard", "2 free-range eggs, beaten", "salt and freshly ground pepper"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the oil into a large, deep roasting tin, until ithe oil is 2cm/1in deep in the tin and place into the oven until smoking.", "Carefully add the potatoes to the hot oil and turn them in the oil to coat. Season with salt and freshly ground black pepper and place into the oven for ten minutes.", "Carefully add the crushed garlic, tomatoes, chillies and paprika to the potatoes and stir to combine. Return to the oven to roast for a further 30 minutes, or until the potatoes are crisp on the outside, but soft on the inside.", "Season, to taste, with salt and freshly ground black pepper, add more olive oil if the potato mixture has become dry and sprinkle with the parsley.", "For the hoki, lightly oil a clean roasting tray and add the hoki steaks. Season lightly with salt and freshly ground black pepper and squeeze lemon juice over the top.", "Place the cheese, mustard and beaten egg into a bowl and stir well to combine. ", "Divide the cheese mixture into ten portions and mould each portion to fit on top of a piece of the hoki, then press onto each of the fish steaks. (Don't worry if it looks a bit sloppy: the egg will set the topping when it cooks.)", "Transfer the fish to the oven and roast for 10-15 minutes, or until the cheese browns and the fish is completely cooked through.", "To serve, press a spoonful of patatas bravas onto a plate, then place a hoki steak on top."]}, {"isVegetarian": false, "title": "Hollywood’s temptation", "url": "www_bbc_co_uk_food_recipes_hollywoods_temptation_10953", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hollywoods_temptation_10953_16x9.jpg", "ingredients": ["75g/2½oz unsalted butter, plus extra for greasing", "1 large onion, thinly sliced", "salt and black pepper", "800g/1lb 12oz waxy potatoes (such as Maris Peer), peeled and thinly sliced", "500ml/18fl oz whole milk (enough to cover the potatoes for cooking)", "4 large sheets filo pastry (about 25x40cm/10x16in each)", "400g/14oz flaked, deboned hot-smoked salmon ", "100ml/3½fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and put a lipped baking tray (as the pie may leak a little butter) on the middle shelf to heat up. Use a little butter to grease a 20cm/8in springform cake tin (about 7cm/2¾in deep).", "Heat 25g/1oz of the butter in a large frying pan. Add the onion and gently fry over a low heat for around 20 minutes, stirring often, until very soft and golden-brown. Season with a little salt and pepper and set aside.", "Put the sliced potatoes in a large saucepan and cover with the milk. Bring to the boil, lower the heat and simmer for about five minutes, or until the potatoes are just tender but not cooked through. ", "Drain the potatoes, reserving 100ml/3½fl oz of the milk.", "Melt the remaining butter. Put one sheet of filo pastry in the cake tin, leaving the excess hanging over the side. Brush lightly with the melted butter then turn the tin slightly and repeat with the rest of the sheets.", "Put one-third of the potatoes into the pastry-lined tin and season with a little salt and pepper. Follow with half the onions and then half the flaked fish. Repeat these layers, then finish off with the final third of potato.", "Mix the reserved milk with the cream and pour over the filling.", "Fold the overhanging pastry back over the filling to enclose it, and brush the top of the pie with melted butter. Place the pie on the hot baking tray in the oven and bake for 30–35 minutes, or until the filo is crisp and golden-brown.", "Leave the pie to stand for 30 minutes or so – it’s best eaten warm or at room temperature – then transfer to a deep plate before slicing."]}, {"isVegetarian": false, "title": "Home-smoked trout with feta salad", "url": "www_bbc_co_uk_food_recipes_home-smoked_trout_with_19243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "200g/7oz sea salt", "1 large trout, cleaned, filleted, pin boned (ask your fishmonger to do this for you)", "1 tbsp white balsamic vinegar", "3 tbsp extra virgin olive oil", "2 shallots, peeled, sliced into rings", "200g/7oz cooked beetroot, roughly chopped", "200g/7oz feta, roughly chopped", "100g/3½oz watercress", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the sugar and sea salt together in a bowl. Divide the mixture into four equal portions.", "Place a large piece of cling film on a clean work surface. Place another piece on top. Sprinkle one portion of the salt and sugar mixture in a line across the centre of the cling film. Place one of the trout fillets, skin-side down, on the line of sugar and salt. ", "Sprinkle another portion of the salt and sugar mixture all over the fillet, then wrap in the cling film. ", "Repeat the process with the remaining trout fillet. Chill the fish in the fridge for 12-24 hours.", "When the trout has cured, remove the cling film and brush off the salt and sugar mixture. Rinse the fish thoroughly under cold running water, then pat dry with kitchen paper.", "Place a generous handful of oak chips in a smoker. Light the wood chips and drizzle with a little water.                     ", "When the wood chips are smouldering, lay the trout fillets, skin-side down, in the centre of the grate. Cover with the lid and smoke for 1-1½ hours, checking the chips regularly to make sure they are not burning. (CAUTION: Food-smoking generates a great deal of smoke. Cook in a well-ventilated place and open the windows.)", "When the trout has smoked, remove from the smoker and set aside to cool. ", "Meanwhile, whisk the balsamic vinegar and olive oil together in a bowl. Season, to taste, with salt and freshly ground black pepper.", "Arrange the shallot rings, beetroot and feta on a large serving platter. Flake the smoked trout over the top. Garnish with watercress leaves, then drizzle over the dressing."]}, {"isVegetarian": false, "title": "Home-smoked cod with salad and anchovy dipping sauce", "url": "www_bbc_co_uk_food_recipes_home_smoked_cod_with_38574", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz brown sugar", "pinch salt", "600g/1lb 5oz piece of cod, skin on, boned", "1 short length of juniper branch", "½ head frisée lettuce, use only the light green and white parts, chopped", "1 apple, sliced", "½ fennel, sliced", "2 tbsp picked dill", "3 tbsp heavy cream", "salt, to taste", "400g/14oz new potatoes, halved", "½ cucumber ", "2 tbsp capers", "3 tbsp sour cream", "100g/3½oz mayonnaise", "1 tbsp red wine vinegar", "100g/3½oz sugar", "100ml/3½fl oz vinegar", "1 tbsp mustard seeds", "½ tbsp caraway seeds", "½ tbsp dill seeds", "150ml/5fl oz oil from a jar of anchovies"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the sugar and salt together for the curing mix. Rub the cod with curing mix on both sides. Leave at room temperature for 30 minutes. Place in the fridge for at least 8 hours, preferably overnight. ", "Pat the cod dry with kitchen paper. Put the cod in a baking tin and put the juniper branch on the opposite side of the tin. Carefully set fire to the juniper branch. Cover with foil and smoke for 10 minutes. If you want a smokier flavour leave to smoke for longer. ", "Remove the cod from the roasting tin and carefully cut into 5mm/¼in slices. Lightly brown the slices with a chef’s blow torch.", "For the apple and frisée salad, toss all of the salad ingredients in the cream and season with salt. ", "For the potato salad, bring a pot of salted water to the boil, add the potatoes and cook until soft. Use a peeler to create thin strands from the outside of the cucumber, reserve this to make pickled cucumber. Finely chop the remaining flesh of the cucumber for the potato salad", "Drain the potatoes and leave to cool. Mix with the other potato salad ingredients. ", "For the anchovy mustard dipping sauce, put the sugar, vinegar, spices and 100ml/3½fl oz water in a pot and bring to the boil. Whisk to dissolve the sugar. Leave to cool and reserve half for the pickled cucumber. Mix the other half with the anchovy oil.", "For the pickled cucumber, mix the reserved cucumber strands with ½ tablespoon of salt and set aside for 5 minutes. Wash the cucumber to remove the salt, then drain. Mix with the pickling liquid. ", "Divide the cod slices bewreen 4 serving plates and serve with the salads and dipping sauce."]}, {"isVegetarian": false, "title": "Home cured salmon", "url": "www_bbc_co_uk_food_recipes_homecuredsalmon_66103", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz fresh salmon", "5  tbsp sea salt", "150ml/¼ pint olive oil", "2 lemons, juice and finely grated rind ", "2  tbsp chopped dill", "1 tbsp sugar", "3 tbsp sherry", "black pepper"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Place the salmon in a bowl and cover well with the sea salt. Cover the bowl with cling film and refrigerate overnight.", "The next day, rinse the salmon. It should feel a little bit hard and leathery. Place in a clean bowl.", "For the marinade, whisk together the olive oil, lemon juice, rind, dill, sugar, sherry and pepper. Pour over the salmon and leave, covered, in the fridge overnight.", "Carve the salmon finely and serve with crisp salad leaves, oatcakes and mayonnaise."]}, {"isVegetarian": true, "title": "Hive cake", "url": "www_bbc_co_uk_food_recipes_hive_cake_03837", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hive_cake_03837_16x9.jpg", "ingredients": ["400g/14oz butter, softened", "400g/14oz sugar", "2 tbsp honey ", "2 lemons, zest only", "7 free-range eggs (preferably organic)", "400g/14oz self-raising flour, sifted", "1kg/2lb 4oz butter, softened", "1.5kg/3lb 5oz icing sugar, sifted", "lemon juice", "1 tbsp honey, or to taste", "Golden-yellow colouring - rather than lemon ", "Small amounts of ready-to-roll fondant icing in yellow, black, red and white", "25g/1oz  flaked almonds", "250g/9oz ready-to-roll green fondant icing"], "serves": "Serves 14-16", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4. Grease and line a 15cm/6in cake tin and a 18cm/7in cake tin. Grease a 15cm/6in oven-proof glass bowl or similar. Cut out a small circle of baking paper to fit in the bottom of the bowl. Flour the sides.", "Cream the butter and sugar until it is very pale, light and fluffy. Beat in the lemon zest and honey. ", "Add eggs slowly plus a little flour if the batter looks like it may curdle. Fold in the remaining flour with a large metal spoon.", "Divide the mixture between the cake tins and the oven-proof bowl.", "Bake for 40-50 minutes, checking the smaller cakes after 30 minutes. The cakes are done when a skewer inserted into the centre of the cake comes out clean.", "Remove from the oven and cool in the tins for 10 minutes before turning out onto a wire rack to cool completely. Remove the baking paper carefully.", "For the decoration, beat the softened butter in a free-standing mixer for 5-8 minutes until very light and soft. Add the icing sugar in gradually, beating all the time, until it is all incorporated. Loosen this buttercream icing mixture with the lemon juice and flavour with honey, to taste. Beat the golden-yellow food colouring into the buttercream icing to achieve your desired shade.", "Dust the work surface with icing sugar. Knead the yellow fondant icing until soft and pliable, then roll small amounts of the yellow fondant into rugby balls to form the body of the bees. Knead the black icing until soft and roll out on the dusted work surface into very thin ropes to create stripes.  Brush the bees very lightly with water and stick on the stripes. Roll tiny balls of red for noses, and little balls of white with  black dots for eyes. Stick these on with a very little water. Push two slices of almond into each bee for wings.  Set aside to dry.", "Roll out the white fondant icing and use a daisy cutter to cut out white flowers. Cut small circles from the yellow fondant for the centres of the daisies.  Set aside to dry.", "Roll out the green fondant icing to cover the cake board. ", "Place the largest cake on the green lined cake board. Spread a layer of the buttercream on the top, then top with the smaller cake. Spread a little more buttercream on the top and then finish with the round bowl cake. ", "Spread a thin layer of buttercream all over the outside of the cake. Set aside to harden (preferably in the fridge) for 10-15 minutes.", "Transfer the remaining buttercream to a piping bag fitted with a plain 2cm/¾in nozzle. Pipe the icing around the outside of the cake in concentric circles to create a hive shape. On the top, pipe a spiral and smooth with a palette knife.", "Place a few bees on skewers or cocktail sticks and stick into the cake. Attach other bees directly to the hive. Place daisies on the cake and on the green board."]}, {"isVegetarian": false, "title": "Cheeseburger with skinny fries and chilli sweetcorn relish", "url": "www_bbc_co_uk_food_recipes_highlandcheeseburger_89309", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "700g/1lb 9oz good quality beef mince", "2 red chillies, finely chopped ", "2 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper", "4 short, thick slices Monterey Jack cheese (or strong cheddar)", "4 burger buns, split in half", "400ml/14fl oz vegetable oil, for deep frying", "2 large baking potatoes, cut into 5cm/2½in long strips", "2 sweetcorn, on the cob", "50g/2oz butter", "2 red chillies, finely chopped", "½ lime, juice only", "2 Little Gem lettuces, leaves separated", "2 tomatoes, thickly sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the burger, heat a frying pan until hot, add the olive oil and onion and cook until the onion is softened, but not coloured. Remove from the heat and allow to cool slightly.", "Place the beef mince, chillies, flatleaf parsley, salt and freshly ground black pepper and cooled cooked onion into a large bowl and mix thoroughly.", "Divide the mixture into four equal portions. Wrap each portion of burger mixture around a piece of the cheese and mould to form a burger shape. Be careful that no cheese is exposed.", "Heat a griddle pan until hot, add the burgers and cook for 4-6 minutes on each side, or until the meat is just cooked through. Remove from the pan and leave to rest in a warm place for 2-3 minutes.", "Meanwhile, place the burger buns cut side-down onto the griddle pan and toast for one minute, until hot.", "For the skinny fries, heat the oil in a deep heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Add the potato strips to the oil in batches and fry for 3-4 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain onto kitchen paper.", "For the chilli sweetcorn relish, bring a large pan of salted water to the boil. Add the corn on the cobs and boil for 7-8 minutes, or until tender.", "Drain the corn on the cobs and allow to cool slightly. Once cool enough to handle, slice the kernels off the cob into a bowl.", "Add the butter and chilli and mix well until the butter has melted. Sprinkle with lime juice and season, to taste, with salt and freshly ground black pepper.", "To serve, place the bottom half of each bun onto a plate. Top each with some Little Gem leaves and a couple of tomato slices, then add a burger. Top each burger with the other half of the bun.", "Place a handful of fries alongside and finish with a spoonful of the chilli sweetcorn relish."]}, {"isVegetarian": false, "title": "Homemade baked beans with sausages", "url": "www_bbc_co_uk_food_recipes_homemade_baked_beans_02438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "8 good-quality pork sausages", "2 shallots, finely chopped", "1 tsp roughly chopped fresh rosemary leaves", "2 garlic cloves, finely chopped", "1 x 400g tin chopped tomatoes", "125ml/4¼fl oz chicken stock", "1 x 400g tin flageolet beans, drained and rinsed", "1 tbsp roughly chopped fresh flatleaf parsley", "4-6 thick slices sourdough bread", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a tablespoon of the oil in an ovenproof frying pan over a medium heat. Add the sausages and fry for 2-3 minutes, or until browned on all sides. Transfer the pan to the oven and continue to cook for 10-12 minutes, or until cooked through.", "Meanwhile, heat another tablespoon of the oil in a separate frying pan over a medium heat. Add the shallots and fry for 2-3 minutes, or until softened. Add the rosemary and garlic and fry for a further 1-2 minutes.", "Add the chopped tomatoes and bring the mixture to the boil, then reduce the heat until the mixture is simmering. Add the stock and beans, return the mixture to a simmer and cook for 3-4 minutes, or until the sauce has thickened slightly. ", "Stir in the parsley and season, to taste, with salt and freshly ground black pepper. Keep warm.", "Just before serving, heat a griddle pan over a medium heat. Drizzle a little of the remaining tablespoon of oil onto each side of the bread slices. Grill the bread for 1-2 minutes on each side, or until golden-brown chargrill marks appear on both sides.", "To serve, place one slice of toast onto each serving plate. Spoon over the bean mixture and top each with a sausage or two."]}, {"isVegetarian": true, "title": "Homemade beans on toast", "url": "www_bbc_co_uk_food_recipes_homemade_beans_on_toast_39014", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beans_on_toast_39014_16x9.jpg", "ingredients": ["½ onion, finely chopped", "½ clove garlic, sliced", "1 tbsp extra virgin olive oil", "1 tomato, chopped", "1 x 400g tin pinto beans, drained and rinsed", "½ tsp smoked paprika", "sea salt and freshly ground black pepper", "1 slice sourdough, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the onions and garlic in a little oil until soft, add the tomato, beans and a dash of water and cook for 10 minutes until almost dry. Add ½ tsp smoked paprika and a drizzle more olive oil and season with salt and pepper. ", "Pour the beans on top of the toast and eat straight away. "]}, {"isVegetarian": false, "title": "Home-cured salmon with pickled ginger and wasabi dressing", "url": "www_bbc_co_uk_food_recipes_homecuredsalmonwithp_91466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz salmon fillet, trimmed, skin scored with a sharp knife, cut into four equal-sized fillets ", "110g/4oz good quality sea salt flakes", "110g/4oz fine sea salt", "200g/7oz caster sugar", "1 tsp coriander seeds", "1 tsp black peppercorns", "1 lemon, zest and juice", "½ orange, zest and juice", "200ml/7fl oz water       ", "small bunch dill, chopped", "2 free-range egg yolks", "3 free-range egg whites", "50g/2oz English mustard  ", "50g/2oz wasabi paste ", "75ml/3fl oz white balsamic vinegar", "1 tbsp rice wine vinegar", "2 tsp caster sugar", "110ml/4fl oz olive oil ", "110ml/4fl oz grapeseed oil ", "salt and freshly ground black pepper ", "200g/7oz dill, roughly chopped", "110ml/4fl oz vegetable oil       ", "110ml/4fl oz olive oil       ", "2 cucumbers, peeled", "4 tbsp olive oil", "50ml/2fl oz sparkling water", "salt and freshly ground black pepper ", "75g/3oz Charlotte potatoes, cooked, drained, cut into 1cm/½in cubes", "4-5 tbsp ready-made lemon vinaigrette", "2 medium-sized, ready-made focaccia, cut into 30 1cm x 2.5cm/½in x 1in cubes", "50g/2oz caster sugar", "1 lemon, zest and juice", "40g/1½oz pickled ginger", "40g/1½oz fennel, very finely sliced, set aside in a bowl of iced water", "10g/½oz wasabi-flavoured fish roe (available from specialist Japanese suppliers)", "small bunch dill, chopped", "1 x 20g/¾oz punnet shiso cress (available from specialist suppliers and online)", "1 x 20g/¾oz punnet tahoon cress (available from specialist suppliers and online)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the cured salmon, place the salmon fillets into a large, deep dish. In a bowl, mix together all of the remaining cured salmon ingredients until well combined.", "Place the salmon fillets into a large deep dish and pour the curing mixture all over it. ", "Place a second, slightly smaller dish on top of the salmon fillets and place a heavy object, such as a bag of sugar, into the second dish to flatten the salmon fillets.", "Cover the dish with cling film, then transfer the dish with the salmon fillets to the fridge and leave to cure for 1-2 days, turning the salmon fillets twice a day (about eight hours apart).", "When the salmon fillets have cured, rinse away the curing liquid and pat the salmon fillets dry using kitchen paper. Carve the salmon fillets into thin slices, then chill in the fridge, covered, until needed.", "For the wasabi dressing, blend the egg yolks, egg whites, English mustard, wasabi paste, white balsamic vinegar, rice wine vinegar and caster sugar to a purée in a food processor.", "With the motor still running, gradually add the olive oil and grapeseed oil to the purée, one after the other, in a thin stream, until the dressing mixture thickens. Season, to taste, with salt and freshly ground black pepper, then set aside.", "For the dill oil, blend the dill oil ingredients in a clean food processor to a very fine purée. Set aside.", "For the salad, using a melon baller, carve 20 balls from the peeled cucmbers.", "Place the cucumber balls into a bowl and drizzle over two tablespoons of the olive oil and all of the sparkling water. Season, to taste, with salt and freshly ground black pepper.", "Cover the bowl and microwave on full power for one minute. Drain the liquid from the bowl.", "Add the cooked potato cubes to the drained cucumber balls, then pour over a little of the lemon vinaigrette and mix well to coat the cooked vegetables.", "Heat one tablespoon of the olive oil in a frying pan over a medium heat. Add the focaccia cubes and fry for 1-2 minutes on all sides, or until they become crisp and golden-brown croûtons. ", "Heat the caster sugar in a separate, non-reactive pan over a low to medium heat. When the sugar has melted and caramelised, add the focaccia croûtons and stir well to coat them in the melted sugar. ", "Add the lemon zest, lemon juice and the remaining tablespoon of olive oil and stir to coat the croûtons.", "To serve, drain the fennel slices and pat dry with kitchen paper. Brush four serving plates with the wasabi dressing, then sprinkle over the pickled ginger and drained fennel slices and dot with the wasabi fish roe. Divide the salad equally among the plates and top with a serving of cured salmon slices. Sprinkle over the croûtons, chopped dill, shiso cress and tahoon cress. Drizzle the dill oil around the edge of the plate."]}, {"isVegetarian": false, "title": "Chorizo beans on toast", "url": "www_bbc_co_uk_food_recipes_homemade_beans_on_toast_46976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beans_on_toast_46976_16x9.jpg", "ingredients": ["100g/3½oz cooking chorizo, diced", "200g/7oz tinned chickpeas, drained and rinsed", "200g/7oz tinned chopped tomatoes", "1 tbsp chopped fresh thyme leaves", "salt and freshly ground black pepper", "2 slices toast", "1 tbsp chopped fresh parsley leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a saucepan over a medium heat. When the pan is hot, add the chorizo and fry for 1-2 minutes, or until starting to crisp.", "Add the drained chickpeas and tinned tomatoes, then stir in the thyme. Season, to taste, with salt and freshly ground black pepper. Simmer for 4-5 minutes, or until the sauce has warmed through and thickened to your liking. ", "To serve, spoon the chickpea mixture on top of the toast and garnish with parsley. "]}, {"isVegetarian": true, "title": "Homemade beer mustard", "url": "www_bbc_co_uk_food_recipes_homemade_beer_mustard_55981", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beer_mustard_55981_16x9.jpg", "ingredients": ["175g/6oz yellow mustard seeds", "175g/6oz black mustard seeds", "500ml/18fl oz beer or ale", "1 tbsp sea salt", "pinch crushed chilli flakes", "175ml/6fl oz cider vinegar or white wine vinegar", "6 tbsp runny honey ", "1 tbsp ground mace or nutmeg"], "serves": "Makes 4 x 250g/9oz jars", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the mustard seeds and beer together in bowl, cover and set aside overnight. (The mustard seeds will soften and soak up most of the beer.)", "Sterilise the jars for the mustard.  Wash in very hot water or on the hot cycle of a dishwasher.  Preheat the oven to 160C/325F/Gas 3. Place the jars upside down on a baking tray and dry in the oven for 10-15 minutes.", "Stir in the remaining ingredients, then blend in a food processor until nearly smooth (you may need to do this is batches).", "Spoon the mustard into the sterilised jars; tap gently to remove all the air bubbles. "]}, {"isVegetarian": true, "title": "Homemade buttery croissants", "url": "www_bbc_co_uk_food_recipes_homemade_buttery_18294", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_buttery_18294_16x9.jpg", "ingredients": ["625g/1lb 6oz strong white bread flour, plus extra for dusting", "75g/2½oz caster sugar", "12g fine sea salt", "40g/1½oz fresh yeast", "500g/1lb 2oz chilled unsalted butter, plus extra to serve", "1 free-range egg and 1 egg yolk, lightly beaten", "raspberry jam, to serve"], "serves": "Makes 16", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["The day before you want to bake the croissants, place the flour, sugar, salt and yeast in the bowl of a food mixer fitted with a dough hook, or a large mixing bowl. Pour in 350-400ml/12-14fl oz cold water and mix until it comes together as a soft dough. ", "Turn out the dough onto a lightly floured work surface and knead for a good 8-10 minutes, or until the dough feels smooth, stretchy and elastic. Return to the bowl and set aside to rest.", "Sandwich the chilled butter between two sheets of greaseproof paper and roll out to a 30x20cm/12x8in rectangle, about 1cm/½in thick. Chill in the fridge until needed.", "Turn the dough out again onto a lightly floured work surface. Roll it into a rectangle 60x30cm/24x12in.", "Peel the greaseproof paper from the butter and place the butter centrally on top of the pastry rectangle. ", "Fold one edge of the pastry over the butter to half-cover it, then do the same with the other edge of the pastry so that the butter is covered.", "Fold the rectangle in half lengthways, then give it a quarter-turn and roll out again to a rectangle measuring 60x30cm/24x12in. ", "Repeat the folding, turning and rolling process, as before, three more times (do not roll out the pastry the final time you fold and turn it). Wrap the pastry in cling film and chill in the fridge overnight.", "When the pastry has rested, roll it out to a thickness of 0.5cm/¼in. Cut the pastry into two 50x20cm/20x8in strips, then cut each strip into triangles about 10cm/4in wide at the base.", "With the narrow point of one of the pastry triangles facing away from you, use your fingertips to stretch the two points of the triangle nearest to you out sideways so that they bow a little.", "Roll the pastry over itself, curling it into a traditional crescent shape, so that the furthest point of the triangle ends up curled over the top of the croissant.", "Repeat the process with the remaining pastry triangles to create about 20 croissants.", "Place the croissants onto baking trays lined with silicone paper or baking parchment. Brush them all over with the beaten egg, then set aside to prove for 30-45 minutes. (NB: The croissants can be frozen at this point, if desired.)", "Preheat the oven to 190C/170C Fan/Gas 5. Bake the croissants for 20-25 minutes, or until risen and golden-brown. Serve warm with jam and butter."]}, {"isVegetarian": true, "title": "Homemade chilli oil", "url": "www_bbc_co_uk_food_recipes_homemade_chilli_oil_54985", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_chilli_oil_54985_16x9.jpg", "ingredients": ["450ml/17fl oz olive oil (not virgin)", "20g/¾oz dried red chilli flakes", "3-4 whole dried red chillies"], "serves": "Makes 450ml/17fl oz chilli oil", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Gently warm the olive oil in a saucepan. Add the chilli flakes and whole chillies to the oil and heat for 3-4 minutes. Remove from the heat and leave the oil to cool slightly.", "When the oil has cooled, carefully strain it into a sterilised, sealable glass bottle using a funnel. Add dried chillies from the pan and seal the bottle.", "Keep the bottle in the refrigerator and use within one week.  "]}, {"isVegetarian": false, "title": "Homemade chorizo", "url": "www_bbc_co_uk_food_recipes_homemade_chorizo_98579", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz minced lean pork shoulder", "200g/7oz pork back fat, diced", "25g/1oz fine salt", "1½ tbsp smoked paprika", "3 garlic cloves, crushed", "1½ tbsp crushed black peppercorns", "1½ tbsp fennel seeds", "25-50ml/1-2fl oz red wine", "natural sausage skins (available from butchers)"], "serves": "Makes 1.2kg /2Ib 10oz chorizo", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["For the chorizo, place all of the ingredients, except the sausage skins, into a bowl and mix until well combined.", "Press the sausage meat into a manual sausage machine and press down.", "Place a sausage skin over the end of the nozzle and turn the handle.", "Turn until the skins are all filled, then remove from the nozzle.", "Twist the sausage at 30cm/12in intervals to form individual sausages then prick carefully with a toothpick to release any air pockets.", "Hang in a cool dry place for at least  one month, preferably up to three months. "]}, {"isVegetarian": true, "title": "Homemade coleslaw", "url": "www_bbc_co_uk_food_recipes_homemade_coleslaw_84746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_coleslaw_84746_16x9.jpg", "ingredients": ["100g/3½oz low-fat natural yoghurt", "½ lemon, juice only", "1 tbsp grainy mustard", "3 tbsp roughly chopped soft herbs, such as chives, parsley, coriander, mint", "¼ white cabbage, finely shredded", "¼ red cabbage, finely shredded", "½ red onion, thinly sliced", "2 carrots, peeled then peeled into ribbons", "sea salt and freshly ground black pepper"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Put the yoghurt, lemon juice, mustard and herbs into a large bowl and whisk well to combine. Season with salt and plenty of black pepper.", "Add the cabbages, red onion and carrots and mix really well until coated in the mustard mixture.", "Ideally, leave to soften and absorb the flavours for 30 minutes before eating."]}, {"isVegetarian": true, "title": "Homemade crackers", "url": "www_bbc_co_uk_food_recipes_homemade_crackers_41322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz wholemeal wheat or spelt flour ", "¼ tsp baking powder", "¼ tsp instant dried yeast", "1 tsp sea salt", "1 tsp honey", "100ml/3½fl oz warm water", "50ml/2fl oz melted butter", "dash olive oil", "nigella seeds, for sprinkling", "dried thyme leaves, for sprinkling"], "serves": "Makes about 30", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.  Mix the flour, baking powder, yeast and salt together, making sure you crumble up the salt well.", "In a separate bowl or jug, mix the honey, water and butter together. Add the wet ingredients to the dry ingredients and mix until it comes together as a dough. Turn out onto a work surface and knead for a couple of minutes until smooth. Cover with cling film or a damp cloth and leave to stand for half an hour.", "Roll the dough out as thinly as you can and use a cookie cutter to make small rounds, or cut into wide strips – it depends how rustic you want these to look. Arrange over a couple of baking trays and prick thoroughly all over with a fork. Brush with olive oil and sprinkle over the onion seeds and thyme leaves.", "Bake in the oven for 8-10 minutes, or until crisp and burnished. Transfer to a cooling rack. They will continue to crisp once out of the oven. "]}, {"isVegetarian": false, "title": "Homemade doner kebab", "url": "www_bbc_co_uk_food_recipes_homemade_doner_kebab_56527", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_doner_kebab_56527_16x9.jpg", "ingredients": ["1 tsp rapeseed oil", "400g/14oz lean lamb mince (5% fat)", "2 garlic cloves, crushed", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp onion powder", "½ tsp smoked paprika", "½ tsp sea salt", "½ tsp freshly ground black pepper", "4 brown pittas", "½ iceberg lettuce, finely shredded", "¼ red cabbage, cored and finely shredded", "½ red onion, thinly sliced", "1 red pepper, sliced", "2 tbsp chilli sauce", "4 tbsp low-fat plain yoghurt", "2 tbsp pickled chillies (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Brush the oil over a 1kg/2lb 4oz loaf tin.", "Tip the mince into a large bowl, add the garlic, spices and seasoning and mix with your hands until smooth. Press into the loaf tin and bake for 20 minutes. Set aside until cool enough to handle.", "Meanwhile, warm the pittas in the oven for 5 minutes.", "Turn the meat out of the tin and slice the kebab lengthways into thin strips. Open up each pitta to create a pocket and pile in the salad ingredients and meat. Add chilli sauce and yoghurt, plus pickled chillies if using."]}, {"isVegetarian": true, "title": "Homemade falafels with salad and pitta bread", "url": "www_bbc_co_uk_food_recipes_homemade_falafels_with_30527", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_falafels_with_30527_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 small onion, finely chopped ", "1 garlic clove, crushed", "1 x 400g/14oz can chickpeas ", "2 tsp ground cumin", "1 tsp mixed herbs ", "1 lemon, zest grated", "salt and black pepper", "1 egg, beaten ", "3 tbsp olive oil ", "1 lemon, juice only", "½ cucumber, peeled and thinly sliced ", "100g/3½oz tomatoes (approximately two medium tomatoes), roughly chopped", "1 round lettuce, washed, leaves torn  ", "4 pitta breads "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a tablespoon of oil in a small pan. Fry the onion over a medium heat for 3-4 minutes until softened. Add the garlic and fry for a further two minutes and remove from the heat. ", "Drain and rinse the chickpeas and transfer to a mixing bowl. Add the sautéed onion and garlic and crush together with a potato masher until the mixture is broken down.", "Add the cumin, mixed herbs and lemon zest and mix well. Taste and season with salt and pepper. Add the egg and mix together.  ", "Preheat the oven to 200C/400F/Gas 6. Divide the mixture into 16 walnut-sized balls and place on a non-stick baking tray. Rest in the fridge for 20-30 minutes.", "Remove the falafel from the fridge, drizzle with the remaining oil and bake for 25 minutes, or until crisp and golden-brown. Turn occasionally to ensure even cooking.  ", "Meanwhile place the cucumber, tomato and lettuce in a large bowl.  Squeeze the juice of half the lemon into a small bowl, add a pinch of salt and pepper and using a fork whisk together with the olive oil to form a dressing.  Pour over the salad and mix well.", "Lightly toast the pitta breads then carefully slice open along one side using a knife.  ", "When ready to serve, arrange a little salad in each pitta, top with some of the falafels and add a squeeze of juice from the remaining lemon half.  Serve with the remaining salad alongside.    "]}, {"isVegetarian": false, "title": "Homemade fish fingers", "url": "www_bbc_co_uk_food_recipes_homemade_fish_fingers_85938", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_fish_fingers_85938_16x9.jpg", "ingredients": ["3 tbsp plain flour", "1 large free-range egg, beaten", "50g/1¾oz golden breadcrumbs (if not available, substitute with 30g/1oz fresh white breadcrumbs mixed with 20g/½oz easy-cook polenta)", "500g/1lb2oz thick skinless white fish fillets ", "3 tbsp sunflower oil", "frozen peas, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour in a strong freezer bag and season with salt and black pepper. Pour the beaten egg into a shallow dish. Put the breadcrumbs (or breadcrumb and polenta mixture) in a separate shallow dish.", "Gently toss each fish piece in the seasoned flour bag until evenly coated, then dip into the beaten egg then the breadcrumbs until evenly coated. Put the prepared fish pieces on a plate. ", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. Add the fish fingers carefully and fry for 5–6 minutes, turning occasionally until golden brown and crisp on all sides. (You may need to do this in batches.) Remove the fish with a spatula and drain on kitchen paper. ", "Bring a pot of water to the boil, and cook the frozen peas for 2-3 minutes or until soft. Drain. ", "Serve the fish fingers with the peas. "]}, {"isVegetarian": true, "title": "Homemade garlic bread", "url": "www_bbc_co_uk_food_recipes_homemade_garlic_bread_66737", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_garlic_bread_66737_16x9.jpg", "ingredients": ["250g/9oz strong white flour, plus extra for dusting", "5g/¼oz salt", "5g/¼oz fast action dried yeast", "30ml/1fl oz olive oil, plus extra for oiling", "180ml/6fl oz water", "1 head of garlic", "splash olive oil ", "pinch salt ", "pinch sugar", "1 x 125g/4½oz  buffalo mozzarella"], "serves": "Makes 2 mini-baguettes", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the baguettes, place the flour, salt, yeast, olive oil and most of the water in a food mixer with a dough hook attached, taking care not to let the yeast touch the salt until you begin mixing. ", "Start mixing on a slow speed, gradually adding the rest of the water until you have a smooth dough.  This should take about five minutes.", "Tip the dough into an oiled bowl, cover and leave the dough to prove for two hours.", "Tip the dough out onto an oiled surface. Dust your hands with a little flour and divide the dough in two.", "Knock back the dough and stretch and fold, and then roll the dough into shape.", "For the garlic mixture, preheat the oven to 200C/400F/Gas 6. Smash the head of garlic to release the cloves and place them in a roasting tin, still in their skins.  Add a splash of olive oil and a pinch each of salt and sugar and toss together.  Cook in the preheated oven for 20 minutes, or until caramelised.  ", "Remove from the oven and, when cool enough to handle, squeeze the soft, roast garlic out of their skins.  ", "Press the garlic cloves into the baguette (add them to taste) as you shape the dough into a baguette shape. ", "Place on a baguette tray or a large baking tray, cover and leave to prove until it has doubled in size. ", "Heat a roasting dish in the bottom of the oven and pour in some water to create some steam (this will help form the crust). Preheat the oven to 220C/425F/Gas 7 in a non-fan oven.", "Just before baking, slash the top of each baguette three times. ", "Bake the baguettes for 30 minutes. Then drop the temperature to 200C/400G/Gas 6 and cook for 10 minutes. The baked baguettes should be golden-brown and have a slight sheen to them.", "Remove the baguettes from the oven and leave to cool.", "Once cooled, preheat the grill to hot. Slice the bread, top with mozzarella and grill until melted and bubbly.  "]}, {"isVegetarian": false, "title": "Homemade hotdogs", "url": "www_bbc_co_uk_food_recipes_homemade_hotdogs_70075", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_hotdogs_70075_16x9.jpg", "ingredients": ["1 tbsp olive oil", "25g/1oz unsalted butter", "2 large onions, peeled and sliced", "½ tsp salt", "½ tsp pepper", "160g/5¾oz cured pork fat (lardo or salo, available from specialist online suppliers)", "25g/1oz pork back fat (available from a butcher)", "250g/9oz lean pork mince", "2 free-range egg whites", "1 tsp cornflour", "salt and freshly ground black pepper", "freshly grated nutmeg", "pinch ground coriander", "4 tbsp frozen milk", "natural sheep casings, cleaned thoroughly under cold running water (available from specialist online suppliers)", "brioche rolls", "mustard"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the caramelised onions, heat the oil and butter in a pan and add the onions, salt and pepper. Cook over a low heat for 20-30 minutes, stirring from time to time, until golden-brown, soft and sticky. ", "For the hotdogs, chop both fats then place in a food processor with the mince and all the other remaining ingredients, except the casings. Blend to a smooth paste. Fill a large piping bag with the hotdog mix and carefully fill the sheep casing. Twist the filled casings to separate into individual hotdogs, around 15cm/6in long. Tie off the ends to seal in the mixture. ", "Place in a pan of cold water and bring up to 86C/187F. The water must not exceed this temperature. Poach gently (so as not to break the casings) for about 10 minutes, or until the pork has cooked through.", "Drain well and serve in a brioche roll with mustard."]}, {"isVegetarian": false, "title": "Homemade gravad lax with cucumber salad and mustard sauce", "url": "www_bbc_co_uk_food_recipes_homemade_gravadlax_with_08463", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_gravadlax_with_08463_16x9.jpg", "ingredients": ["85g/3oz caster sugar ", "70g/2½oz flaky sea salt", "2 tbsp schnapps, gin or vodka", "2 tsp freshly ground white pepper ", "100g/3½oz fresh dill ", "500g/1lb 2oz centre-cut salmon fillet, skin on, bones removed", "1 large cucumber, peeled, thinly sliced ", "1 tsp sea salt", "2 tsp caster sugar ", "freshly ground white pepper ", "1-2 tbsp white wine vinegar ", "3 tbsp Dijon mustard", "squeeze lemon juice", "2 tsp caster sugar", "1-2 tsp dried dill ", "salt and pepper", "2-3 tbsp sunflower oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["To cure the salmon, blend together the sugar, salt, alcohol, white pepper and dill in a food processor to make a paste.", "Place half of the mixture into a container that will accommodate the fish snugly (say the plastic container the fish was bought in). Lay the salmon on top of this flesh-side down, press it down, then cover with the other half of the mixture, smearing it well over the surface of the fish. Secure with a lid or cling film and leave to chill in the fridge for 48 hours, turning the fish occasionally, until firm to the touch. ", "For the cucumber salad, mix all the ingredients together in a bowl and leave to macerate for an hour in the fridge. Drain off the liquid, put the cucumber into a serving dish and chill in the fridge. The salad should be served really cold.", "For the sauce, mix the mustard, lemon juice, sugar, salt, pepper and dried dill in a bowl until well combined. Gradually whisk in the oil until you have a loose, thick dressing. You may need a little more oil. Pour into a small serving bowl.", "Carefully rinse the fish under cold running water, but not so much that no remnants of dill remain. Dry with kitchen paper.", "Thinly slice the gravad lax at an angle and present on a large serving dish. Serve alongside the cucumber salad and the mustard sauce with buttered rye bread."]}, {"isVegetarian": true, "title": "Homemade Irish cream", "url": "www_bbc_co_uk_food_recipes_homemade_irish_cream_18863", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_irish_cream_18863_16x9.jpg", "ingredients": ["250ml/9fl oz single cream ", "1x 397g/14oz tin condensed milk", "350ml/12fl oz Irish whiskey", "1 tsp Camp coffee essence", "3 tsp chocolate sauce", "1 tsp vanilla essence", "1 tsp almond essence"], "serves": "Makes 1 litre/1¾ pints", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Sterilise the bottles for the liqueur: wash in very hot water or on the hot cycle of a dishwasher.  Preheat the oven to 160C/325F/Gas 3. Place the bottles on a baking tray and dry in the oven for 10-15 minutes. Leave to cool. ", "Pour all the ingredients into a blender and blend on high for 30 seconds.  Add extra Camp or chocolate to taste.   ", "Pour into sterilised bottles and store in the fridge. (The liqueur will keep for up to two months.) Shake well before using."]}, {"isVegetarian": false, "title": "Monster meatball pitta", "url": "www_bbc_co_uk_food_recipes_homemade_lamb_meatballs_15794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz lamb mince", "2 tsp ground cumin", "oil, for frying", "salt and pepper", "100g/3½oz plain yoghurt, to serve", "1 tsp dried mixed herbs, to serve", "4 wholemeal pitta breads, to serve", "1 lettuce, to serve", "4 medium tomatoes", "1 cucumber", "oil. for drizzling", "1 tsp dried mixed herbs "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, mix the mince, cumin and a little salt and pepper together well.", "Divide the mixture into 16 even-sized pieces. Roll each piece into a ball about the size of a golf ball and set aside.", "Heat a large frying pan, or two smaller frying pans, over a medium heat. Once hot, add a dash of oil and carefully put the meatballs in the pan. Cook for 15 minutes, or until cooked through, rolling the meatballs around from time to time to ensure even cooking on all sides.", "Meanwhile, make the salad. Cut the tomatoes into cubes and put them in a bowl. Cut the cucumber into cubes and add to the salad bowl. Drizzle over a little oil and sprinkle with the mixed herbs. Season with a pinch of salt and pepper and toss together to make sure all the vegetables are evenly coated in oil and herbs. Set aside.", "Mix together the yoghurt and mixed herbs and season to taste. ", "Lightly toast the pitta breads and cut open. Lay a few lettuce leaves inside each pitta. Top with four meatballs and spoon over the herby yoghurt. Serve immediately with the salad on the side. "]}]