[{"ingredients": ["1 repollo rojo (aproximadamente 800 g / 1 libra 12 onzas), reducido a la mitad", "4 cebollas de primavera flaca o 6 flacas, recortadas", "2 pimientos rojos, membranas y semillas eliminadas", "1 pimiento amarillo, membranas y semillas eliminadas", "1 pimiento naranja, membranas y semillas eliminadas", "1 guindilla roja, semillas retiradas", "cilantro fresco grande (aproximadamente 100g / 3½oz)", "250ml / 9fl oz de jugo de piña, de un cartón", "2 limas, preferiblemente sin encerar", "1½ cucharadas de copos de sal marina, o al gusto", "2 cucharaditas de aceite de sésamo tostado", "2 cucharaditas de jarabe de arce"], "method": ["Triture la col finamente y colóquela en el recipiente más grande que tenga. Puede ser más fácil usar una olla grande ya que necesitas mezclar todos los ingredientes más adelante, e incluso mi tazón más grande no es lo suficientemente grande.", "Corta las cebolletas en bastones y luego corta cada bastón en rebanadas delgadas a lo largo, para que, de nuevo, tengas jirones. Agregue al repollo.", "Cortar los pimientos en rodajas muy finas. Agregue al repollo y cebollas de primavera.", "Pica finamente el chile rojo, y haz lo mismo con el cilantro - tallos y hojas. Agregue el chile y todo menos una cucharada de cilantro picado en el tazón de repollo.", "En un tazón o jarra medidora, mezcle el jugo de piña, la ralladura y el jugo de 1 lima y el jugo de la mitad del segundo. Espolvoree la sal, agregue el aceite de sésamo y el jarabe de arce y mezcle bien antes de verter sobre las verduras preparadas. Mezcle para mezclar, luego deje reposar durante al menos 15 minutos, y hasta 2 horas, antes de servir. Espolvoree la cucharada reservada de cilantro picado sobre el repollo terminado."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_slaw_07245", "title": "Repollo agridulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sour_slaw_07245_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 bulbo de hinojo, cortado en cuartos", "1 pimiento rojo, cortado en rodajas gruesas", "1 zanahoria grande, pelada y cortada en rodajas gruesas", "2 cucharadas de aceite de oliva", "2 dientes de ajo", "1 guindilla roja, hendidura longitudinal", "6 aceitunas negras, picadas, a la mitad", "1 cucharada de alcaparras", "1 cucharada de azúcar", "5 cucharadas de vinagre de vino blanco", "4 x 200 g / 7 oz de filetes de salmón, piel, pin deshuesada", "4 ramitas de tomillo fresco", "Mejillones a 250g / 9oz, barba removida, lavada con agua corriente fría", "250 g / 9 oz de almejas, lavadas con agua fría", "3 cucharadas de aceite de oliva", "1 diente de ajo, en rodajas finas", "½ chile rojo, picado", "1 cucharada de perejil fresco finamente picado", "150ml / 5fl oz de vino blanco", "sal y pimienta negra recién molida"], "method": ["Escaldar el hinojo, la pimienta y las zanahorias en una olla grande de agua hirviendo durante tres minutos. Retirar, escurrir y reservar.", "En una sartén, caliente un poco de aceite de oliva y fría el ajo y el chile. Agregue las aceitunas, las alcaparras y las verduras escaldadas y fría por un par de minutos más. Agregue el azúcar y el vinagre y cocine hasta que esté ligeramente caramelizado. Retirar del fuego y dejar de lado.", "Sazone el filete de salmón en el lado de la piel, coloque unas ramitas de tomillo sobre la piel y rocíe con un poco de oliva. En una sartén antiadherente caliente, selle el salmón en cada lado durante unos 2-3 minutos dejando el centro ligeramente crudo o cocido a su gusto.", "Para los mejillones y las almejas, deseche cualquier mejillón o almeja que tenga conchas rotas y deseche las que no se cierren cuando se le da un golpecito fuerte.", "Calentar una olla grande y agregar el aceite. Una vez caliente, agregue el ajo y el chile y cocine hasta que se ablanden.", "Agregue los mejillones, las almejas, el perejil y el vino y sazone con sal y pimienta. Coloque una tapa en la parte superior y cocine hasta que los mejillones y las almejas se hayan abierto. Descarta cualquiera que no se abra. Escurrir el marisco reservando el líquido de cocción. Deje los mariscos a un lado y manténgalos calientes.", "Ponga a hervir el líquido de cocción de los mariscos, luego cocine a fuego lento hasta que se reduzca a una consistencia de salsa.", "Para servir, coloque las verduras en los platos para servir con el salmón en la parte superior con la piel hacia arriba. Coloque el marisco alrededor y vierta sobre el líquido de cocción reducido. Termine con un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_salmon_49760", "title": "Salmón agridulce con mejillones y almejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 600 g / 1 libra de filete de cerdo de 5 oz, cortado en rodajas finas", "2 cucharadas de salsa de soja ligera", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "1 cucharada de aceite de sésamo", "1 cucharada de harina de maíz", "1 cucharada de aceite de maní", "3 dientes de ajo grandes, toscamente picados", "225g / 8oz de piña fresca o enlatada en jugo, cortada en trozos", "2 cucharaditas de azúcar en polvo", "5 cebolletas, cortadas, finamente picadas", "1 cucharada de salsa de soja oscura", "2 cucharadas de hojas de cilantro fresco picado", "3 huevos de gallinas camperas, ligeramente golpeados", "2 cucharaditas de aceite de sésamo", "1 cucharadita de maní o aceite vegetal", "200g / 7oz de arroz cocido de grano largo, refrigerado (preferiblemente durante la noche)"], "method": ["Para la carne de cerdo, coloque la carne de cerdo en un tazón y agregue la salsa ligera de soja, el vino de arroz o el jerez, el aceite de sésamo y la harina de maíz. Mezcle bien para cubrir el cerdo en el adobo, luego reserve.", "Calentar el aceite en un wok a fuego alto. Cuando el aceite empiece a humear, agregue el ajo y saltee por 10 segundos o hasta que esté dorado, pero no quemado. Agregue el cerdo adobado, reservar el adobo en el tazón y continúe revolviendo por 2-3 minutos.", "Agregue la piña, el azúcar, el adobo reservado, las tres cuartas partes de las cebollas tiernas y la salsa de soja oscura y continúe revolviendo por 2-3 minutos más. Agregue el cilantro, revuelva bien y retire el wok del fuego.", "Mientras tanto, para la tortilla de arroz, mezcle los huevos y el aceite de sésamo en un tazón.", "Caliente el aceite en un wok separado o en una sartén grande a fuego alto. Cuando la sartén esté caliente, vierta el aceite de modo que solo quede una capa ligera en el wok.", "Vierta la mezcla de huevo en la sartén y agite la sartén para que la mezcla forme una tortilla fina. Cuando los huevos acaban de ponerse, espolvoree el arroz cocido sobre la tortilla y cocine por un minuto. Con cuidado dobla los bordes de la tortilla sobre el arroz para cubrir, luego transfiere la tortilla a un plato caliente y cúbrela con una toalla de té limpia para que el arroz termine de calentarse.", "Para servir, corte la tortilla, divida las rebanadas por partes iguales entre cuatro platos para servir, luego coloque la carne de cerdo al lado. Adorne con las cebolletas restantes."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_pork_and_29670", "title": "Cerdo agridulce y piña con tortilla de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo de cerdo 400 g / 14 oz, cortado en tiras finas", "2 cucharadas de aceite vegetal", "1 cucharadita de sal", "8 cucharadas de harina de arroz o harina de patata, o harina de maíz", "150 g / 5½ oz de azúcar en polvo", "150ml / 5fl oz de vino de arroz", "75ml / 3fl oz de jugo de toronja", "4 cucharadas de salsa de soja", "2 chiles rojos, finamente cortados en cubitos", "2 cucharadas de chile en hojuelas", "Jengibre fresco de la raíz de los 10cm / 4in, finamente rallado", "1 cucharada de aceite vegetal", "1 cebolla roja, finamente rebanada", "1 pimiento rojo, cortado en triángulos", "1 pimiento verde, cortado en triángulos", "½ piña pequeña, cortada en trozos pequeños", "2 dientes de ajo, en rodajas finas", "2 cucharadas de aceite de cacahuete", "Arroz basmati 200g / 7oz, cocido y enfriado", "2 huevos de gallinas camperas, ligeramente golpeados", "2 cucharaditas de aceite de sésamo", "4 cebolletas, finamente cortadas", "3 cucharadas de hojas de cilantro picado", "¼ cabeza col primavera, finamente triturado", "½ cucharadita de sal", "½ cucharadita de azúcar moreno", "2 cucharaditas de vieiras secas, ralladas"], "method": ["Para la carne de cerdo, caliente una freidora a 190 ° C o 375 ° F o, alternativamente, caliente el aceite vegetal en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle las tiras de cerdo con el aceite vegetal.", "Coloque la sal y la harina de arroz / patata en un bol, agregue el cerdo y mezcle bien para cubrir cada pieza.", "Baje las piezas de cerdo con cuidado en la freidora de grasa unas pocas a la vez, y cocine, en lotes, durante 2 minutos. Retire las piezas de cerdo del aceite caliente y drene sobre papel de cocina.", "Para la salsa, caliente una sartén hasta que esté caliente, agregue el azúcar y caliente hasta que se convierta en un caramelo, luego agregue cuidadosamente el vino de arroz, el jugo de toronja y la salsa de soja y deje que hierva. Agregue los chiles picados, los copos de chile y el jengibre y cocine por unos minutos hasta que la salsa espese un poco.", "Caliente un wok hasta que esté caliente, agregue el aceite vegetal, la cebolla, los pimientos y la piña y saltee durante 3-4 minutos hasta que estén tiernos. Agregue el ajo y el cerdo cocinado a la salsa y cocínelos durante 1-2 minutos, tirando la carne de cerdo para que cubra bien la salsa.", "Para el arroz frito con huevo, caliente el wok hasta que esté caliente, agregue el aceite y el arroz y saltee durante 2-3 minutos hasta que esté bien caliente. Mezcle los huevos y el aceite de sésamo en un tazón con un tenedor. Agregue los huevos al arroz y continúe revolviendo por 2-3 minutos o hasta que los huevos se hayan solidificado y la mezcla esté seca.", "Coloque el repollo en la freidora durante 2 minutos, escurra y espolvoree con sal y azúcar y mezcle.", "Coloque el arroz frito en un plato y póngalo al lado, agregando una salsa extra sobre la parte superior. Sirva el repollo crujiente sobre la carne de cerdo, con la vieira rallada."], "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_pork_with_10851", "title": "Cerdo agridulce con arroz frito con huevo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["65g / 2¼ oz de harina de arroz", "Harina de tapioca de 65 g / 2¼ oz", "½ banana muy madura", "300ml / 10½fl oz de leche de almendras", "aceite de colza o aceite de coco", "1½ plátanos, en rodajas", "grandes arándanos", "Pacanas de 30g / 1oz, tostadas", "miel de maple"], "method": ["Coloque las harinas, la leche de plátano y almendras en un procesador de alimentos y haga un blitz hasta que tenga una masa homogénea con la consistencia de una crema individual. Vierta la mezcla en una jarra.", "Caliente una sartén antiadherente de 20-25 cm / 8-10 pulgadas hasta que esté caliente y cepille con un poco de aceite. Vierta un poco de la mezcla y gírela alrededor de la sartén para hacer un panqueque de tamaño completo. Cocine por 1-2 minutos, o hasta que estén dorados en los bordes. Aflojar y voltear con una espátula. Cocine hasta que esté dorado en ambos lados. Repita con la masa restante. Puede mantener calientes los panqueques cocidos envolviéndolos en papel de aluminio y colocándolos en un horno a baja temperatura.", "Coloque los panqueques en los platos y cubra con plátanos, arándanos, nueces y jarabe de arce. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_sweet_banana_and_maple_14272", "title": "Panqueques dulces de plátano y arce con arándanos y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 6 panqueques", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_banana_and_maple_14272_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5 oz de azúcar en polvo", "300ml / 10½fl oz de agua", "75g / 3oz de guindas secas", "75g / 3oz de arándanos secos", "Licor de naranja 390ml / 13½fl oz", "300 ml / 10½ fl oz de jarabe común (ver arriba)", "200g / 7oz dedos de esponja (también conocidos como boudoir biscuits o dedos de mujer)", "150g / 5oz% 20plain% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids", "175g / 6oz de mantequilla sin sal", "175g / 6oz de azúcar en polvo", "Puré de castañas con sabor a vainilla 250 g / 9 oz (disponible en delicatessen)", "150gr / 5 oz de almendras molidas", "300ml / 10½ fl oz crema doble", "Azúcar en polvo 350g / 12oz", "3 cucharadas de agua"], "method": ["Para el sirope común, mezcle el azúcar y el agua juntos en una sartén pequeña, luego lleve la mezcla a ebullición lentamente hasta que el azúcar se disuelva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 4-5 minutos. Retirar del fuego y reservar para enfriar, luego enfriar en la nevera durante la noche.", "Para la charlotte, coloque las guindas secas y los arándanos secos en un tazón pequeño, vierta más de seis cucharadas de licor de naranja, cubra el tazón con film transparente y deje la fruta en remojo durante 12 horas, o al menos durante la noche.", "Cuando la fruta se haya empapado, engrase y forme una lata honda de 22cm / 9 pulgadas con fondo suelto (o molde charlotte) con papel resistente a la grasa.", "Vierte el licor de naranja restante y el sirope común en un recipiente ancho y poco profundo.", "Sumerja los lados no azucarados de los dedos de la esponja en la mezcla de jarabe de a uno por vez y colóquelos verticalmente uno al lado del otro para alinear los lados de la lata de la torta. No los deje en remojo por mucho tiempo ya que se derrumbarán.", "Traiga una pequeña cantidad de agua a fuego lento en una olla. Suspenda un recipiente resistente al calor sobre la bandeja (no permita que la base del recipiente toque la superficie del agua). Agregue el chocolate al tazón y revuelva hasta que se derrita. Dejar de lado.", "Con un batidor eléctrico de mano, unte la mantequilla y el azúcar en un bol hasta que estén pálidos y esponjosos.", "Doble el puré de castañas en la crema de mantequilla y la mezcla de azúcar hasta que se combinen, usando una cuchara de metal. Vierta el chocolate derretido, luego agregue la fruta remojada y las almendras molidas. Mezcle hasta que esté bien combinado.", "Vierta la crema en un recipiente aparte y bata hasta que quede lo suficientemente grueso como para dejar un rastro cuando se quite la batidora. Doble la crema batida en la mezcla de chocolate y fruta hasta que tenga un efecto marmoleado.", "Coloque la mezcla en la lata de la torta, cubra la lata con film transparente y deje enfriar en la nevera durante la noche.", "Para el azúcar hilado, vierta el azúcar en una cacerola de base pesada. Agregue el agua y revuelva hasta que el azúcar se haya disuelto. Poco a poco llevar la mezcla a fuego lento a fuego lento.", "Con un termómetro de azúcar, caliente la mezcla a una temperatura de 155 ° C / 311 ° F (esto se conoce como etapa de crack duro). No tengas la tentación de remover la mezcla de azúcar ya que esto hará que el jarabe cristalice. (Precaución: el jarabe de azúcar caliente puede arder. No deje desatendido y no pruebe ni toque el jarabe).", "Llene un fregadero vacío con agua fría. Tan pronto como la mezcla de azúcar alcance la temperatura deseada, sumerja la base de la sartén en el agua para detener el proceso de cocción.", "Ahora trabaje rápido: coloque la olla sobre una superficie resistente al calor. Gire dos tenedores hacia atrás y sosténgalos con una mano. Mantenga un rodillo en el otro. Sumerja las horquillas en el jarabe de azúcar y deslice el caramelo sobre el rodillo para crear largas hebras de azúcar. Usando sus manos, junte los hilos en una bola grande y moldee juntos para formar formas. Continúe creando formas de azúcar hasta que se haya usado todo el jarabe de azúcar.", "Cuando esté listo para servir la dulce castaña y la charlotte de chocolate, coloque la charlotte en un plato para servir o en un soporte para pasteles. Adornar con las formas de azúcar hilado."], "url": "www_bbc_co_uk_food_recipes_sweet_chestnut_and_60895", "title": "Castaña dulce y chocolate charlotte", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4-6 pimientos pelados", "100g / 3½oz de chile", "1 tomate, semillas eliminadas, picadas", "5 dientes de ajo", "perilla pequeña jengibre raíz fresca", "450g / 1lb de azúcar", "Vinagre de vino blanco 350ml / 12fl oz", "2 cucharaditas de sal", "pizca de pimienta negra", "1 cucharada de vinagre balsámico"], "method": ["Mezcle los pimientos, el chile, el tomate, el ajo y el jengibre en una licuadora o procesador de alimentos.", "Agregue los ingredientes restantes a una cacerola e incline la mezcla de chile. Llevar a ebullición y cocinar hasta que la salsa se espese, unos 15-20 minutos.", "Vierta en frascos esterilizados."], "url": "www_bbc_co_uk_food_recipes_sweet_chilli_sauce_65562", "title": "Salsa de chile dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2 jarras", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de lima fresca", "2 cucharadita Falemum", "25ml / 1fl oz de agua de coco", "Ron oscuro de 75 ml / 3 fl oz", "1 cucharada de licor de albaricoque", "cortar mango fresco", "ramita de menta fresca"], "method": ["Coloque todos los ingredientes en una coctelera con un puñado de hielo y agite fuerte.", "Colar el cóctel en un vaso lleno de hielo y decorar con una rodaja de mango y una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_sweet_meringue_89253", "title": "Merengue dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_meringue_89253_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pinta de leche entera", "1 cucharadita de manteca o mantequilla", "Fideos de 50 g / 1¾oz, rotos en pedazos de 4cm / 1 ½ gruesos", "4 cucharadas de azúcar", "¼ cucharadita de cardamomo molido (o semillas de 8 vainas)", "1 cucharada de ghee o mantequilla", "25g / 1oz anacardos", "25 g / 1 oz de pistachos", "Sultanas de 25g / 1oz"], "method": ["Vierta la leche en una sartén grande o de karahi, coloque a fuego medio-alto hasta que hierva, luego reduzca ligeramente el fuego y cocine a fuego lento durante aproximadamente 20 minutos hasta que reduzca el volumen en un tercio.", "Mientras tanto, caliente el ghee (o mantequilla) en una sartén a fuego medio, agregue los fideos y fría por 1-2 minutos, o hasta que estén ligeramente tostados pero no dorados.", "Una vez que la leche se haya reducido, agregue los fideos tostados a la leche y cocine a fuego lento por otros 20 minutos, o hasta que los fideos estén suaves y la leche se reduzca aún más.", "Agregue el azúcar y el cardamomo, deje que se enfríe un poco y luego vierta en un plato para servir, cuencos individuales o vasos.", "Para decorar, caliente el ghee (o mantequilla) en una sartén a fuego medio, agregue los anacardos y las nueces de pistacho y fría durante 2-3 minutos, o hasta que estén doradas, luego agregue las sultaninas. Coloque esta decoración sobre el payasam, déjela enfriar y luego transfiérala a la nevera para que se enfríe; la mejor manera de pasar la noche es en la noche. Servir en porciones pequeñas"], "url": "www_bbc_co_uk_food_recipes_sweet_milk_pudding_with_68274", "title": "Pudín de leche dulce con fideos (payasam)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["un buen puñado de tocino o panceta sin ahumar picados", "4 cebollas medianas", "3 zanahorias pequeñas", "½ cucharadita de pimentón dulce", "½ cucharadita de canela molida", "½ nuez moscada, para rallar", "300g / 10oz de lentejas Puy", "500 ml / 1 stock pimp", "un puñado de perejil", "botón de mantequilla", "100g / 4oz de crema fresca"], "method": ["Cocine el tocino o la panceta en una sartén honda a fuego moderado para dejar que la grasa fluya lentamente. Corta aproximadamente dos de las cebollas y agrégalas a la sartén. Cortar las zanahorias en trozos y agregar a la sartén. Cubra y deje que hierva durante unos minutos. Agregue el pimentón, la canela, y ralle en ½ de nuez moscada. Agregue las lentejas, el caldo y 500 ml de agua, cubra y deje durante 30 minutos hasta que las lentejas se hayan ablandado.", "Mientras se cocina lentamente, corte las dos cebollas restantes y, en otra sartén, cocínelas muy lentamente en mantequilla hasta que estén doradas. Termina con una rejilla de nuez moscada.", "Lo último que se agrega a las lentejas es un puñado de perejil picado. Sirva con una cucharada de crema fresca y apile las cebollas caramelizadas encima."], "url": "www_bbc_co_uk_food_recipes_sweet_onions_with_lentil_01078", "title": "Cebolla dulce con guiso de lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_onions_with_lentil_01078_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["90ml / 6 cucharadas de aceite de oliva", "Pimientos rojos y amarillos de 900g / 2lb, cortados en tiras", "3 dientes de ajo, en rodajas", "2 cucharadas de vinagre de vino blanco", "12 huevos de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Caliente 5 cucharadas de aceite en una sartén de 25cm / 10 in y fríe las tiras de pimiento, revolviendo de vez en cuando, hasta que los bordes de las tiras estén caramelizados, esto tomará unos 10 minutos.", "Agregue el ajo y freír suavemente hasta que esté cocido pero no quemado. Agregue el vinagre y cocine hasta que se evapore. Retire del fuego y reserve, dejando los pimientos en la sartén.", "Batir los huevos en un bol y sazonar con sal y pimienta.", "Regrese la sartén al fuego, agregue el aceite restante y vierta la mezcla de huevo. Cocine, revolviendo un poco con una espátula, hasta que haya una costra en la parte inferior, esto tomará unos cinco minutos.", "Cubra la bandeja con un plato grande o la tapa de una cacerola grande, y rápidamente gírelo para invertir la tortilla. Deslízalo de vuelta a la sartén, con la costra hacia arriba. Cocine por otros 5 minutos, hasta que el otro lado se haya dorado. Cortar en trozos y servir caliente o frío con ensalada."], "url": "www_bbc_co_uk_food_recipes_sweet_pepper_omelette_36973", "title": "Tortilla de pimiento morrón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_pepper_omelette_36973_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["puñado de grandes hojas de menta, recogidas de sus tallos", "1 huevo blanco de corral", "100 g / 3½ oz de azúcar en polvo", "Harina normal de 250g / 7oz", "15 g / ½ onza de azúcar glasé", "pizca de sal", "1 limón, ralladura solamente", "1 huevo de gallinas camperas", "2 cucharadas de crema agria", "botón de mantequilla", "200 g / 9 oz de arándanos frescos", "2 cucharadas de azúcar en polvo, más un poco más para cocinar", "100 ml / 3½ fl oz de crema agria o crema fresca", "1 cucharada de azúcar glasé, más más para rociar"], "method": ["Para las hojas de menta cristalizadas, bata ligeramente la clara de huevo. Espolvorea la mitad del azúcar sobre una bandeja para hornear forrada. Sumerja las hojas de menta en la clara de huevo y coloque en el azúcar. Espolvorea sobre el azúcar restante. Elija cada hoja de menta desde su punta y sacuda el exceso de azúcar. Póngase una rejilla de alambre y déjela secar durante varias horas, preferiblemente durante la noche. Almacene en un recipiente hermético para mantenerse fresco.", "Para hacer la masa, tamiza la harina y el azúcar glas en un tazón grande. Agregue una pizca de sal y la ralladura de limón. Haz un bien en el medio. Batir ligeramente el huevo con la crema agria y dos cucharadas de agua. Viértalo en el pozo.", "Con un tenedor, comience a trabajar la harina en los ingredientes húmedos, hasta que tenga una masa áspera y harinosa. Apague todo el lote en una superficie de trabajo y amasar hasta que la masa esté suave. No debe ser pegajoso; si lo es, agregue un poco más de harina. Cubra la masa con film transparente y déjelo durante 1 hora.", "Cuando esté listo para hacer el pierogi, extienda la masa hasta un grosor de entre 1 y 2 mm. Corta rondas de 8 cm / 3½ pulgadas de diámetro, junta los restos de la masa para formar los círculos restantes.", "Mezcle los arándanos en el azúcar justo antes de que necesite usarlos, no quiere que comiencen a macerarse y repartir jugos. Coloque 4-5 arándanos en cada ronda de repostería en una línea, luego junte los bordes para formar una media luna. Engarce o pliegue con los dedos o use un tenedor para sellar.", "Pon a hervir una olla grande de agua. Cocine los pierogi unos pocos a la vez, están listos cuando flotan en la parte superior, esto debería tomar alrededor de 2-3 minutos.", "Derrita la mantequilla en una sartén grande y agregue una cucharadita de azúcar en polvo y una pizca de canela. Una vez derretido, agregue los pierogi, en tandas, y fría por un par de minutos en cada lado hasta que comiencen a crujir y dorar.", "Endulce la crema agria batiendo el azúcar glasé.", "Sirva las albóndigas con la crema agria azucarada, hojas de menta cristalizadas y una pizca de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_sweet_pierogi_22987", "title": "Albóndigas dulces", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace aproximadamente 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_pierogi_22987_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "1 cucharada de semillas de comino", "1 cebolla, finamente rebanada", "sal y pimienta negra", "2 dientes de ajo, aplastados", "½-1 cucharadita de hojuelas de chile (al gusto)", "50g / 1¾oz de raíz de jengibre, pelado y rallado", "600g / 1lb 5 oz de garbanzos enlatados (peso no drenado)", "1 x 400 g / 14 oz de tomates de hojalata", "750 g / 1 libra de batata de 10 onzas, pelada y cortada en cubos del tamaño de un bocado", "200g / 7oz de arroz"], "method": ["Caliente una cacerola grande a fuego medio y agregue el aceite. Una vez caliente, agregue las semillas de comino y fría por un minuto, o hasta que estén aromáticas. Agregue la cebolla y una pizca de sal y cocine por 5-6 minutos, o hasta que la cebolla esté suave y translúcida. Agregue el ajo, las hojuelas de chile y el jengibre y fría por otros tres minutos.", "Escurrir y enjuagar los garbanzos. Agregue a la sartén con los tomates y la batata. Agregue suficiente agua (aproximadamente 500 ml / 18 fl oz) para cubrir los garbanzos y las batatas y deje que hierva a fuego lento, revolviendo para mezclar todo junto.", "Cubra con una tapa y cocine a fuego lento a fuego medio, revolviendo de vez en cuando, durante 25-30 minutos, o hasta que las papas estén suaves y comiencen a separarse y la salsa se haya espesado. Rellene con un poco más de agua durante la cocción si es necesario.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete.", "Pruebe el curry y sazone al gusto con sal y pimienta. Sirve inmediatamente con el arroz."], "url": "www_bbc_co_uk_food_recipes_sweet_potato_and_68565", "title": "Curry de camote y garbanzos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_potato_and_68565_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["700 g / 1 lb 9 oz de batatas (3 medianas)", "2 x 400 g / 14 oz latas de frijoles negros, enjuagados y escurridos", "50g / 1¾oz de nueces, tostadas", "2 cucharaditas de pimentón ahumado en caliente", "1 cucharadita de mezcla seca de hierbas italianas", "1 cucharadita de ajo en polvo", "1 cucharadita de cebolla en polvo", "sal marina y pimienta negra recién molida", "2 cucharaditas de pasta de chipotle", "100g / 3% C2% BDoz% 200 %% 20fat% 20Greek-style% 20yoghurt,% 20or% 20similar% 20dairy-free% 20alternative", "4 tortillas grandes de maíz (o trigo)", "100 g / 3½ oz de lechuga iceberg, rallado", "200 g / 7 oz zanahorias, peladas y ralladas", "Remolacha cruda 200g / 7oz, pelada y rallada", "1 aguacate maduro, pequeño, pelado y descuartizado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Pinche las batatas con un tenedor y coloque una bandeja pequeña para hornear. Hornee durante 50-60 minutos, o hasta que todo esté suave. Retirar del horno y dejar enfriar. Apaga el horno Saca la carne de las batatas en un tazón grande.", "Coloque la mitad de los frijoles negros en un procesador de alimentos con nueces y mezcle hasta que quede suave. Agregue a la carne de batata, con el resto de frijoles negros, pimentón, mezcla de hierbas secas, ajo en polvo y cebolla en polvo. Sazonar con sal y pimienta y mezclar bien.", "Alinee una bandeja para hornear con un pergamino para hornear. Divida la mezcla en cuatro porciones y déle forma a los troncos, aproximadamente 15 x 7 x 2 cm / 6 x 2¾ x ¾in en la bandeja revestida. Aplaste ligeramente y enfríe en la nevera para reafirmar durante 2 horas.", "Caliente el horno de nuevo a 200 ° C / 180 ° Ventilador / Gas 6. Cocine las empanadas de boniato en el estante del medio del horno durante 50 minutos.", "Mientras tanto, mezcle la pasta de chipotle y el yogur en un bol. Cuando las hamburguesas estén cocidas, coloque las tortillas en el horno durante un minuto hasta que estén tibias, pero aún flexibles.", "Extienda cada tortilla con una cucharada grande del yogur con chipotle y coloque una empanada de camote en el medio. Cubra con lechuga, zanahoria y remolacha. Corte un cuarto de aguacate por la mitad y coloque ambos pedazos encima, luego enrolle la tortilla alrededor del relleno con fuerza. Rebana por la mitad y sirve."], "url": "www_bbc_co_uk_food_recipes_sweet_potato_and_black_27156", "title": "Burritos de batata y frijol negro", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_potato_and_black_27156_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla pequeña, finamente picada", "2 dientes de ajo, finamente picados", "50g / 1¾oz de harina natural", "1 cucharadita de polvo de hornear", "1 cucharadita de condimento Cajun", "1 limón, ralladura solamente", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas", "2 cucharadas de crema individual", "250g / 9 oz de camote, pelado y rallado grueso", "perejil pequeño racimo (opcional)", "Aceite para freír"], "method": ["Calentar el aceite en una sartén pequeña. Agregue la cebolla y cocine hasta que esté suave, translúcido y comience a caramelizar. Agregue el ajo y continúe cocinando por 2-3 minutos. Retirar del fuego y dejar enfriar.", "Ponga la harina en un tazón y agregue el polvo de hornear, el aderezo de Cajun, la ralladura de limón y mucha sal y pimienta. Mezcle bien. Rompa el huevo y mezcle hasta que tenga una pasta espesa parecida a un roux, luego remueva la crema para aflojar la mezcla. Agregue la cebolla, el ajo, la batata y el perejil si los usa.", "Use una cantidad escasa de aceite de oliva para cubrir la base de una sartén grande. Ponga cucharadas colmadas de la mezcla en la sartén, alisándolas en rondas planas sobre la marcha. Cocine por 3-4 minutos en cada lado hasta que estén crujientes y doradas.", "Retire de la sartén y continúe hasta que haya agotado toda la mezcla. Escurrir sobre la toalla de cocina y mantener caliente antes de servir."], "url": "www_bbc_co_uk_food_recipes_sweet_potato_fritters_13212", "title": "Buñuelos de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 camote grande", "2 cucharaditas de aceite vegetal", "1 cebolla mediana picada", "400 g / 14 oz de estaño de frijoles, escurridos", "1 cucharadita de chile en polvo", "1 cucharadita de comino (opcional)", "½ cucharadita de hojuelas de chile (opcional)", "Lata de 400g / 14oz de tomates picados", "sal y pimienta negra recién molida"], "method": ["Ralla la batata y exprímela en un rollo de cocina.", "Ponga 2 cucharaditas de aceite en una sartén a fuego medio, agregue un puñado de batata al aceite caliente, presione con una espátula y fría a fuego medio durante 4-5 minutos. Voltee el panqueque y fríalo del otro lado hasta que esté marrón oscuro y cocido. Repite este proceso para hacer 3 panqueques más.", "Mientras tanto, caliente un poco de aceite en una sartén y fría la cebolla por 5 minutos, o hasta que se ablande. Agregue los frijoles, el chile en polvo, el comino, los copos de chile y los tomates picados. Condimentar con sal y pimienta. Cocine hasta que la salsa se haya espesado, esto tomará de 5 a 10 minutos.", "Divida los panqueques entre 4 platos, cubra con el chile y sirva."], "url": "www_bbc_co_uk_food_recipes_sweet_potato_pancake_71977", "title": "Crepes de camote con frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_potato_pancake_71977_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lbs 2 oz de calabaza, pelada, picada", "aproximadamente 500g / 1lb de azúcar en polvo", "1x paquete de filo 300 g / 10½ oz paquete", "aceite vegetal, para freír", "50g / 2oz de azúcar glasé"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Hornee las piezas de calabaza durante 30 minutos o hasta que estén tiernas.", "Pese la calabaza cocida y mida dos tercios de su peso en azúcar (por ejemplo, si la calabaza pesa 750 g / 1 lb 10 oz, use 500 g / 1 lb de azúcar). Coloque la calabaza en un procesador de alimentos y mezcle hasta que quede suave.", "Transfiera la calabaza a una cacerola con el azúcar y cocine a fuego lento, revolviendo ocasionalmente, durante 30 minutos. Dejar de lado para enfriar.", "Coloque dos hojas de filo en una superficie ligeramente enharinada. Corta las hojas en piezas rectangulares que miden 7.5cm x 15cm / 6in x 3in.", "Coloque una cucharada de puré de calabaza en un extremo de la hoja de la pastelería. Doble una esquina de la masa sobre la mezcla para que forme un triángulo, luego doble la masa restante sobre la parte superior para continuar con el patrón de triángulo. Repita hasta que todos los pasteles se hayan doblado y tenga una masa en forma de triángulo. Cepille el final de la masa con agua y selle. Repita con el relleno y la masa restante.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C / 350 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Coloque con cuidado los pasteles en el aceite caliente y cocine por 2-3 minutos o hasta que estén recién cocidos. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina.", "Polvo con azúcar glas y servir caliente."], "url": "www_bbc_co_uk_food_recipes_sweet_pumpkin_pastries_93247", "title": "Dulces pasteles de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 200 ml / 7 fl oz", "media naranja, solo cáscara", "2 cucharadas de licor de naranja", "15 ml / 1 cucharada de glucosa", "45 g / 1½ oz de mantequilla", "185 g / 6% C2% BDoz% 20dark% 20chocolate% 20 (53-55 %% 20cocoa% 20solids)", "2 naranjas grandes, solo jugo", "2 cucharaditas de arrurruz", "3 maracuyá grande, semillas y pulpa solamente", "Licor de naranja 100ml / 3½fl oz", "50g / 1¾oz de azúcar (opcional)", "Harina de 300g / 10½oz '00'", "50g / 1¾oz de mantequilla", "50 g / 1 oz de azúcar en polvo", "1 naranja, solo ralladura", "1 cucharadita de extracto de vainilla", "60ml / 4 cucharadas de leche", "aceite vegetal, para freír", "azúcar en polvo, para quitar el polvo", "cacao, para quitar el polvo"], "method": ["Para la ganache, ponga la nata, la ralladura de naranja, el licor de naranja y la glucosa en una cacerola mediana y caliéntela hasta que hierva. Retire del fuego y agregue la mantequilla.", "Derrita el chocolate en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento. Cuando se derrita, agregue a la mezcla de crema y revuelva hasta que quede suave. Vierta la ganache en un tazón pequeño y deje reposar durante al menos dos horas, preferiblemente durante la noche.", "Para hacer la salsa de maracuyá, mezcle tres cucharadas de jugo de naranja con el arrurruz. Mezcle los ingredientes restantes en una sartén y caliente hasta que estén hirviendo a fuego lento. Agregue la raíz de arrurruz y la mezcla de jugo y revuelva hasta que esté espeso y brillante. Deje enfriar hasta que esté listo para servir.", "Para hacer los raviolis, ponga la harina, la mantequilla, el azúcar, la ralladura de naranja y el extracto de vainilla en un procesador de alimentos y mezcle hasta que se forme una migaja. Poco a poco agregue la leche para formar una bola. Retire del procesador de alimentos y, con sus manos, junte para formar una masa. Amasar brevemente, envolver en una película adhesiva y dejar de lado para descansar.", "Divida la masa en cuatro partes iguales. Ya sea usando un rodillo o una máquina de pasta, gradualmente enrolle cada pieza hasta que tenga cuatro láminas delgadas de pasta (es posible que necesite agregar harina extra a la máquina para evitar que se pegue).", "Usando un cortador de pastel circular grande, corte los círculos de las hojas de pasta. Ponga una generosa cucharada de ganache en el centro de cada círculo. Cepille los bordes con un poco de agua (para sellar) y doble para crear un bolsillo semicircular limpio. Usando un tenedor, engarce los bordes.", "Coloque en una bandeja de horno enharinada.", "Una vez que todos los ravioles estén hechos, vierta unas pocas pulgadas de aceite vegetal en una sartén grande a fuego medio (tenga cuidado, el aceite caliente es peligroso. No lo deje desatendido). Baje suavemente los ravioles en el aceite caliente y fría hasta dorar por ambos lados (puede necesitar hacer esto en tandas). Use una cuchara ranurada para quitar los raviolis y luego drene en un plato forrado con papel de cocina absorbente.", "Sirva los raviolis calientes, espolvoreados con azúcar impalpable y cacao en polvo y rociados con la salsa de maracuyá."], "url": "www_bbc_co_uk_food_recipes_sweet_ravioli_with_11477", "title": "Raviolis dulces con ganache de chocolate y salsa de maracuyá", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["280 g / 10 oz de piña triturada en conserva, escurrida", "Azúcar de atasco 280g / 10oz", "9 hojas secas de lima kaffir, aplastadas", "2 cucharaditas de granos de pimienta rosa, aplastados", "Harina de auto aumento de 350g / 12oz, más extra para quitar el polvo", "3 cucharadas de azúcar en polvo", "½ cucharadita de polvo de hornear", "½ cucharadita de sal", "85g / 3oz de mantequilla sin sal, refrigerada y en cubos", "Leche entera 185ml / 6fl oz, más extra para glaseado", "400 g de leche de coco, refrigerada", "1 cucharadita de pasta de frijoles de vainilla", "1 cucharada de azúcar glas"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7 y forre una bandeja para hornear con papel de hornear.", "Para hacer el atasco, ponga todos los ingredientes en una cacerola grande a fuego alto. Llevar a ebullición, luego reducir a fuego lento durante 15-20 minutos, hasta que llegue a 105 ° C - puede probarlo con un termómetro de azúcar o colocar un plato en el congelador de antemano. Coloque una gota del atasco en la placa fría y déjela durante unos segundos, luego empújela con el dedo y si se arrugan, el atasco estará listo. Transfiera a un recipiente para que se enfríe completamente.", "Para hacer los bollos, ponga la harina, el azúcar, el polvo de hornear y la sal en un tazón grande y mezcle. Frote la mantequilla con la punta de los dedos hasta que la mezcla se asemeje a pan rallado. Haga un pozo en el centro y agregue la leche. Mezcle con una espátula, luego suavemente junte la masa con sus manos.", "Convierta la masa en una superficie ligeramente espolvoreada y extiéndala hasta un cuadrado de 15 cm. Luego corte en cuadrados de 5 cm / 2 pulgadas. Coloque sobre la bandeja para hornear, cepille las partes superiores con leche y hornee en el estante del medio durante 12 a 15 minutos. Deje que se enfríe completamente en una rejilla de alambre.", "Para la crema de coco, saque la crema solidificada en la parte superior de la lata y coloque en un recipiente, descartando el líquido que se encuentra debajo. Bata la pasta de frijoles de vainilla y el azúcar glas en la crema.", "Dividir los bollos y disfrutar con crema y mermelada, o mermelada y crema, en el orden que prefiera."], "url": "www_bbc_co_uk_food_recipes_sweet_scones_with_89116", "title": "Bollos dulces con crema de coco y mermelada de piña de pimienta rosada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Rinde 9", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_scones_with_89116_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pimientos rojos", "2 chalotes de plátano, pelados, cortados a la mitad y cortados", "500g / 1lb 2oz de tomates ciruela", "4 dientes de ajo sin pelar", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "450ml / 16fl oz de caldo de pollo o verdura, caliente", "700ml / 1¼ pinta de crema doble", "100g / 3½oz de pimientos rojos asados ​​a la parrilla picados", "2 cucharadas de cebolletas frescas picadas", "1 pan de ciabatta, cortado en rodajas"], "method": ["Para la sopa dulce de pimiento rojo y tomate, precaliente el horno a 200C / 400F / Gas 6.", "Coloque los pimientos sobre una llama de gas abierta hasta que todo se vuelva negro. Coloque en un recipiente, cúbralo con una película adhesiva y déjelo reposar de 1 a 2 minutos.", "Retire los pimientos del tazón y despegue la piel negra, enjuague debajo de un grifo abierto para quitar el resto de la piel. Retire las semillas y deje el pimiento a un lado.", "Coloque las mitades de chalota (con el lado del corte hacia abajo) junto con los tomates de ciruela y los dientes de ajo en una bandeja para hornear y rocíe con aceite de oliva. Hornee en la parte superior de su horno durante 30 minutos o hasta que los chalotes estén cocidos", "Derrita la mantequilla en una sartén grande a fuego medio y agregue los chalotes asados, los pimientos y el ajo.", "Agregue el caldo caliente y cocine por cinco minutos.", "Mezcle con una batidora hasta que quede suave y vuelva a colocarla en la sartén para que se caliente.", "Para el pimiento rojo dulce y la manteca de cebollín, coloque la crema doble en un procesador de alimentos y bata hasta que el suero de leche líquido se separe de la grasa y se haya formado una mantequilla.", "Retire los sólidos de mantequilla y colóquelos en una pieza grande de muselina limpia. Enjuague la mantequilla con agua corriente fría para eliminar cualquier resto de suero de leche. Cuelgue la muselina sobre un recipiente para recoger más líquido y déjela durante una hora.", "Una vez colgado durante una hora, quítelo de la muselina y mezcle los pimientos y el cebollino.", "Forme una forma de tronco largo y enrolle una película adhesiva.", "Caliente una sartén grande de la plancha y rocíe un poco de aceite de oliva sobre la ciabatta cortada, y tueste cualquier lado durante 1-2 minutos o hasta que aparezcan las marcas de la barra.", "Para servir, ponga la sopa en cuencos para servir y sirva la chapata tostada cubierta con pimienta y mantequilla de cebollín en la parte superior.", "La sopa se puede servir caliente o fría."], "url": "www_bbc_co_uk_food_recipes_sweet_red_pepper_and_25318", "title": "Sopa dulce de pimiento rojo y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_red_pepper_and_25318_16x9.jpg", "isVegetarian": true, "recommendations": 0}]