[{"ingredients": ["50 g / 1¾oz de mantequilla sin sal, más extra para engrasar", "75g / 2½oz de pastel de jengibre pegajoso, en rodajas finas", "500 g / 1 lb 2 oz de azúcar en polvo", "150ml / 5fl oz de crema doble", "135ml / 4½fl oz de leche entera", "1 cucharadita de jengibre molido", "2 cucharaditas de café espresso molido"], "method": ["Unte con mantequilla una lata cuadrada de 17 cm / 7 pulgadas y cúbrala con pergamino para hornear. Precalentar la parrilla a mediano.", "Coloque las rebanadas de pastel de jengibre en una bandeja para hornear. Ase hasta que esté tostado, volteándolo una vez que esté hecho un lado. Dejar enfriar y luego cortarlo aproximadamente.", "Ahora coloque el azúcar, la crema, la leche y 50 ml / 2 fl oz de agua hirviendo en el centro de una bandeja grande y profunda (24 cm / 9½ de diámetro). Calentar suavemente a fuego muy lento durante unos 15 minutos, o hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Revise revolviendo la mezcla con una cuchara de madera, retire la cuchara y examine la parte posterior de la misma; los gránulos restantes deben estar visibles.", "Coloque un termómetro de azúcar en la sartén y suba el fuego hasta que la mezcla empiece a burbujear. Sosténgalo en este punto de cocción lenta, ajustando el calor en consecuencia, y cocine hasta que la mezcla llegue a 116 ° C / 241 ° F. Si no tiene un termómetro, cocine a este ritmo constante durante aproximadamente 15 minutos. (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Manipúlelo con cuidado y no lo deje desatendido).", "Tan pronto como se alcance la temperatura, vierta aproximadamente un cuarto de la mezcla en un recipiente metálico.", "Agregue el jengibre y el café a la mezcla que aún está en la sartén y bata durante aproximadamente un minuto.", "A continuación, mezcle la tarta de jengibre picada y bata bien durante unos minutos más hasta que la mezcla se haya enfriado un poco y empiece a espesarse alrededor del borde. Saldrá de los bordes de la sartén en esta etapa.", "Vierta en la lata preparada. Dale a la mezcla de fudge común reservada en el tazón un golpe rápido y reparte cucharadas por encima. Use un pincho para margar las dos capas; debe verse esponjoso como un café con leche en la parte superior. Dejar enfriar a temperatura ambiente durante un par de horas o refrigerar durante 30 minutos. Cortar en cuadrados y comer."], "url": "www_bbc_co_uk_food_recipes_gingerbread_latte_fudge_68292", "title": "Gingerbread latte fudge", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace alrededor de 50 piezas de dulce de azúcar", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_latte_fudge_68292_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de frutas secas mezcladas, como sultanas, pasas y pasas de Corinto", "150g / 5½oz de arándanos secos", "150 g / 5½oz de ciruelas pasas sin hueso", "150g / 5½oz de fechas secas y deshuesadas", "150g / 5½oz de higos secos", "150ml / 5fl oz brandy, más extra opcional para 'alimentar' el pastel", "ralladura finamente rallada y jugo de ½ naranja", "150g / 5½oz de nueces enteras mezcladas", "150 g / 5½ onzas de mantequilla, suavizadas", "150g / 5½oz de azúcar moreno oscuro", "3 cucharadas de melaza negra o jarabe de fecha, opcional", "3 huevos de gallinas camperas (a temperatura ambiente), batidos", "150g / 5½ oz de harina de auto crianza", "3 cucharadas de especias mixtas molida", "4 cucharadas de mermelada de albaricoque", "750 g / 1 libra 10 oz listos para poner la pasta de azúcar", "Mazapán de 750 g / 1 lb 10 oz", "glaseado de agua con fondant", "mazapán", "pequeños dulces de colores o chispas"], "method": ["Coloque la mezcla de frutas secas y arándanos en un tazón. Con unas tijeras de cocina, corte las ciruelas pasas, las dátiles y los higos en trozos pequeños, quitando los tallos y colóquelos en el recipiente. Agregue el brandy y la ralladura de naranja y el jugo, y mezcle bien para combinar. Cubra el recipiente con un gorro de ducha, film transparente o placa y déjelo en un lugar fresco durante al menos 12 horas o, incluso mejor, 2 días.", "Cuando esté listo para hacer la torta, engrase y forre una lata redonda de fondo suelto de 20cm / 8 pulgadas y precaliente el horno a 180ºC / 160ºC Ventilador / Gas 4.", "Extienda las nueces en una bandeja para hornear y pan tostado, revise con frecuencia para asegurarse de que no se quemen, durante 5-10 minutos o hasta que estén fragantes (puede omitir el tostado, pero realmente resalta su sabor). Enfriar, luego cortar las nueces - Me gustan relativamente gruesas para contrastar con la fruta. Apague el horno a 140C / 120C Fan / Gas 1.", "Usando un batidor eléctrico de mano (es difícil batir esta pequeña cantidad en un mezclador independiente), bata la mantequilla y el azúcar durante 5-10 minutos o hasta que quede muy ligero y cremoso. Batir la melaza o jarabe, si se usa. Poco a poco agregue los huevos a la mezcla de mantequilla y azúcar, batiendo bien después de cada adición. Tamiza la harina y la especia en la mezcla y dóblala. Finalmente, revuelve a través de la fruta empapada, con cualquier líquido que quede en el tazón y las nueces picadas.", "Coloque la mezcla en la lata preparada y alise la superficie con el dorso de una cuchara humedecida en agua caliente. Hornee durante 2 ½ horas o hasta que la torta esté firme al tacto y una brocheta empujada hacia el centro salga limpia. Coloque la lata en una rejilla de alambre. Si desea \"alimentar\" el pastel, déjelo enfriar durante unos 15 minutos, luego pellizque la parte superior con un palillo de cóctel o un pincho, con una profundidad de aproximadamente 3 cm. Cepille alrededor de 1 cucharada de brandy. Déjalo en remojo mientras el pastel se está enfriando. Una vez que el pastel esté frío, quítelo de la lata y envuélvalo en un pergamino fresco para hornear, si lo desea, y luego en papel de aluminio antes de guardarlo en una lata hermética o en un recipiente durante al menos 5 días antes de comerlo. Puede repetir el proceso de alimentación semanalmente durante hasta 5 semanas.", "Cuando esté listo para terminar la torta, caliente suavemente la mermelada de albaricoque y extiéndala sobre la superficie de la torta. Estirar el mazapán hasta aproximadamente el grosor de una moneda de una libra y cubrir todo el pastel. Estire el glaseado de fondant con el mismo grosor y cubra completamente el pastel, presionando hacia abajo para suavizarlo.", "Coloque su cortador de pan de jengibre en la superficie de su pastel totalmente helado de acuerdo a su disposición deseada. Presione su (s) cutter (es) a través de las capas de fondant y mazapán y elimine la formación de hielo con la cuchilla todavía insertada para ayudar a dar un contorno más limpio. Agregue las características del hombre de pan de jengibre a la forma recortada con trozos de fondant blanco o fondant o trozos de pasta en forma de agua colocados en una manga pastelera. Se pueden agregar formas y dulces de mazapán a las formas de tu hombre de pan de jengibre para una decoración adicional."], "url": "www_bbc_co_uk_food_recipes_gingerbread_man_93985", "title": "Pastel de Navidad hombre jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace pastel de 20 cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_man_93985_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de azúcar mascabado ligero", "50g / 1¾oz de azúcar moreno oscuro", "50g / 1¾oz de jarabe dorado", "150 g / 5½ oz de mantequilla, picada", "1 huevo mediano de gallinas camperas (a temperatura ambiente)", "Harina normal 300g / 10½ oz", "1 cucharada de jengibre molido", "1 cucharada de especias mixtas molida", "Fondant blanco 50g / 1¾oz", "agua o miel que moquea", "20 cordones de fresa"], "method": ["Coloque los dos tipos de azúcar, el sirope dorado y la mantequilla en una cacerola de base pesada. Ponlo a fuego medio y tibia, revolviendo ocasionalmente, hasta que la mantequilla se haya derretido y los azúcares se hayan disuelto.", "Transfiera la mezcla a un recipiente grande y deje enfriar durante aproximadamente 5 minutos antes de batir en el huevo. Tamice la harina y luego las especias, una a la vez, mezclando suavemente después de cada adición, para hacer una masa suave.", "Coloque la masa en una bolsa de comida o envuélvala en una película adhesiva. Enfríe durante varias horas, preferiblemente de la noche a la mañana, para reafirmarse: esto hace que la masa sea más fácil de extender.", "Retire la masa del refrigerador de 15 a 30 minutos antes de enrollarla, para que se pueda ablandar levemente.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Estirar la masa entre hojas de pergamino para hornear al grosor de una moneda de £ 1. Si la masa parece muy pegajosa, quítale el polvo y el pergamino ligeramente con un poco de harina. Despegue la hoja de pergamino superior, luego use una plantilla o una etiqueta de regalo, recorte sus etiquetas con un cuchillo afilado. También puede usar un cortador de tamaño adecuado, aproximadamente 5 x 7 cm.", "Recolecte los recortes de la masa y vuelva a enrollarlos entre más papel pergamino para cortar más etiquetas. Levante las etiquetas, en el pergamino, en una bandeja de horno. Si es necesario, recorte las esquinas superiores de cada etiqueta con un cuchillo para hacer la forma de etiqueta clásica. Crea un agujero cerca de un extremo con el extremo de la paja para beber. Si desea imprimir sus etiquetas, hágalo ahora. Enfriar durante unos 15 minutos.", "Hornee durante 8-12 minutos o hasta que estén doradas. Deje que se firme en la bandeja, luego levante, aún sobre el pergamino, sobre una rejilla para que se enfríe.", "Para terminar las etiquetas de galletas, despliegue el fondant entre dos piezas de pergamino para hornear con un grosor de 2 mm. Despegue la hoja superior de pergamino y use una boquilla de tubería redonda de 1.5 cm o una tapa de pluma para cortar círculos. Use un pincel para aplicar un poco de agua o miel líquida a cada etiqueta de galleta alrededor del orificio recortado, para actuar como pegamento, luego coloque un círculo de fondant en la parte superior. Use la pajita para beber o el extremo del pincel para empujar el fondant a través del orificio en la galleta, dejando un borde blanco.", "Deje que se seque antes de enhebrar cordones de fresa a través de los agujeros."], "url": "www_bbc_co_uk_food_recipes_gingerbread_gift_tags_44951", "title": "Etiquetas de regalo de jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace alrededor de 15 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_gift_tags_44951_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "3 cucharadas de azúcar moreno claro", "1 cucharadita de polvo de hornear", "1 cucharadita de canela", "2 cucharaditas de jengibre molido", "pizca de sal", "½ limón, ralladura finamente rallada (opcional)", "½ vaina de vainilla o un par de gotas de extracto de vainilla (opcional)", "300 ml / ½ litro de leche semidesnatada", "1 huevo mediano de gallinas camperas", "4 cucharadas de aceite de girasol", "12 rebanadas de jamón de Parma o tocino", "100ml / 3½fl oz de jarabe de arce", "100 ml / 3½ fl oz de crema agria o crema fresca"], "method": ["Precaliente el horno a 110C / 225F / Gas ¼ (esto será para mantener calientes los panqueques ya que se cocinan en lotes).", "Pon la harina, el azúcar, el polvo de hornear, la canela, el jengibre y la sal en un tazón grande, dales una mezcla rápida y haz un pozo en el centro. Rallar finamente la ralladura de limón, si se usa. Dividir la vaina de vainilla abierta, raspar las semillas y agregarlas también (o extracto de vainilla). Luego vierta gradualmente la leche poco a poco, revolviendo todo el tiempo para dar una mezcla suave. Luego golpee bien el huevo y déjelo a un lado.", "Ponga un chorrito de aceite en una sartén grande a fuego medio y cocine el jamón de Parma durante 2-3 minutos por cada lado hasta que quede bien crujiente. Luego remueva con pinzas y escurra sobre papel de cocina. Mantenga el jamón caliente en el horno hasta que esté listo para servir.", "Deje la sartén al fuego, pero reduzca el fuego a bajo y agregue un poco más de aceite si es necesario. Luego, coloque cuatro cucharadas de la mezcla para panqueques (para extender hasta aproximadamente 10 cm / 3¼ pulgadas de ancho). Deje que se cocinen durante aproximadamente 1-2 minutos hasta que estén dorados, luego voltéelos y cocínelos por otros 1-2 minutos. Deslízalos a una bandeja para hornear y ponlos en el horno para mantenerlos calientes. Luego, repite con la mezcla restante para obtener aproximadamente 12.", "Una vez que haya hecho todos los panqueques, divídalos entre cuatro platos. Me gusta apilar alto el jamón de parma y luego rociar con el sirope de arce y servirlo con una cucharada de crema agria o crema frâiche."], "url": "www_bbc_co_uk_food_recipes_gingerbread_pancakes_89406", "title": "Panqueques de jengibre con jamón de Parma y jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_pancakes_89406_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para el despliegue", "1 cucharadita de bicarbonato de soda", "2 cucharaditas de jengibre molido", "1 cucharadita de canela molida", "125 g / 4½ oz de mantequilla", "175g / 6oz de azúcar morena suave y ligera", "1 huevo de gallinas camperas", "4 cucharadas de jarabe de oro", "escribir glaseado", "decoraciones para pasteles"], "method": ["Tamizar la harina, el bicarbonato de soda, el jengibre y la canela y verter en el tazón de un procesador de alimentos. Agregue la mantequilla y mezcle hasta que la mezcla se vea como pan rallado. Agregue el azúcar.", "Batir ligeramente el huevo y el sirope dorado, agregar al procesador de alimentos y pulsar hasta que la mezcla se aglutine. Incline la masa, amasar brevemente hasta que quede suave, envolver en clingfim y dejar enfriar en la nevera durante 15 minutos.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos bandejas para hornear con papel antigrasa.", "Ruede la masa a un espesor de 0.5cm / ¼ en una superficie ligeramente enharinada. Usando cortadores, corte las formas de los hombres de jengibre y colóquelas en la bandeja de hornear, dejando un espacio entre ellas.", "Hornea de 12 a 15 minutos o hasta que esté ligeramente dorado. Déjela en la bandeja por 10 minutos y luego muévala a una rejilla para terminar de enfriar. Cuando se enfríe decorar con la escritura guinda y decoraciones de la torta."], "url": "www_bbc_co_uk_food_recipes_gingerbread_men_99096", "title": "Los hombres de pan de jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_men_99096_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de azúcar mascabado ligero", "50g / 1¾oz de azúcar moreno oscuro", "50g / 1¾oz de jarabe dorado", "150 g / 5½ oz de mantequilla, picada", "1 huevo mediano de gallinas camperas (a temperatura ambiente)", "Harina normal 300g / 10½ oz", "1 cucharada de jengibre molido", "1 cucharada de especias mixtas molida", "50g / 1¾oz de chocolate, derretido", "fresas / frambuesas liofilizadas", "brillo comestible, opcional", "20 cordones de fresa"], "method": ["Coloque los dos tipos de azúcar, el sirope dorado y la mantequilla en una cacerola de base pesada. Ponlo a fuego medio y tibia, revolviendo ocasionalmente, hasta que la mantequilla se haya derretido y los azúcares se hayan disuelto.", "Transfiera la mezcla a un recipiente grande y deje enfriar durante aproximadamente 5 minutos antes de batir en el huevo. Tamice la harina y luego las especias, una a la vez, mezclando suavemente después de cada adición, para hacer una masa suave.", "Coloque la masa en una bolsa de comida o envuélvala en una película adhesiva. Enfríe durante varias horas, preferiblemente de la noche a la mañana, para reafirmarse: esto hace que la masa sea más fácil de extender.", "Retire la masa de la nevera 15-30 minutos antes de enrollarla para que se ablande levemente.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Estirar la masa entre hojas de pergamino para hornear al grosor de una moneda de £ 1. Si la masa parece muy pegajosa, quítale el polvo y el pergamino ligeramente con un poco de harina. Despegue la hoja de pergamino superior, luego corte las formas de su pájaro y use un palillo de cóctel o un pincho de bambú para crear una sangría de ojo y un agujero para enhebrar sus cordones de fresa si hace decoraciones de árboles de Navidad. Hornee los bizcochos por 10-12 minutos hasta que estén dorados. Déjalos reposar durante unos minutos en la bandeja de hornear, luego transfiéralos a una rejilla para que se enfríen.", "Aplique el chocolate derretido a las aves con un pincel y espolvoree sobre la fruta liofilizada y purpurina roja si las usa. Deje que se fije antes de enhebrar y atar sus cordones de fresa si crea decoraciones de pan de jengibre."], "url": "www_bbc_co_uk_food_recipes_gingerbread_robins_89555", "title": "Gingerbread robins", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 15 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerbread_robins_89555_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "mantequilla perilla", "55g / 2oz de brócoli, picado", "1 cucharadita de jengibre raíz recién rallado", "85g / 3oz de arroz basmati, cocido y escurrido", "2 cucharadas de eneldo fresco picado"], "method": ["Caliente el aceite y la mantequilla en una sartén y fríe con cuidado el brócoli y el jengibre durante 3-4 minutos o hasta que el brócoli esté tierno. Agregue el arroz cocido y fría por 3-4 minutos más, luego agregue el eneldo.", "Coloque el arroz frito en un plato y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gingerfriedrice_90107", "title": "Arroz frito con jengibre y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas de 85g / 3oz, aplastadas", "2-3 cucharadas de miel", "200 g / 7 oz de mascarpone", "1-2 cucharaditas de tallo de jengibre, picado", "2 cucharadas de azúcar glas"], "method": ["Mezcle los digestivos triturados con la miel en un tazón.", "Coloque la mezcla en un aro de cocinero en un plato de servir y presione hacia abajo.", "Mientras tanto, mezcle el mascarpone, el jengibre y el azúcar en un tazón para combinar.", "Coloca la mezcla en el anillo y alisa la parte superior con una espátula.", "Calentar cuidadosamente el anillo con un soplete y quitar el anillo.", "Servir."], "url": "www_bbc_co_uk_food_recipes_gingercheesecake_76506", "title": "Pastel de queso de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 o 5 zanahorias medianas a grandes", "mantequilla de perilla grande", "330ml / 12fl oz de cerveza de jengibre", "pizca de azúcar en polvo", "sal"], "method": ["Pele las zanahorias medianas a grandes finas, la parte superior y la cola, luego córtelas en rodajas o bastones finos. Cocine a fuego lento en agua con sal durante unos minutos hasta que esté al dente. Drene, pase por debajo del grifo frío para detener la cocción, luego drene nuevamente.", "Ponga las zanahorias en una cacerola con la mantequilla y suficiente cerveza de jengibre para llegar a la mitad de las zanahorias. Espolvorea un poco de azúcar en polvo y sazona con sal. Llevar a ebullición, revolviendo ocasionalmente, luego hervir hasta que la cerveza de jengibre se haya evaporado más o menos, dejando las zanahorias glaseadas con un glaseado gingery dulce y mantecoso. Pruebe y añada más sal si la necesita."], "url": "www_bbc_co_uk_food_recipes_gingerglazedcarrots_73411", "title": "Zanahorias glaseadas con jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerglazedcarrots_73411_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 17fl oz de agua hirviendo", "Jengibre fresco de raíz de 2cm / 1 en pieza, pelado, en rodajas", "3 cm / 1½ en azúcar en cubos de roca o 2-3 cucharadas de azúcar morena suave"], "method": ["Calentar el agua en una olla pequeña y agregar las piezas de jengibre. Llevar a ebullición, agregar el azúcar de la roca y reducir el fuego a fuego lento. Cocine a fuego lento durante cinco minutos, luego cuele en una taza y sirva."], "url": "www_bbc_co_uk_food_recipes_gingerjuice_89277", "title": "Jugo de jengibre'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango, piel y piedra eliminados, carne cortada en trozos", "1 cucharada de miel", "5 cucharadas de ron oscuro", "Crema doble de 150 ml / 5 fl oz, batida a picos suaves", "2 cucharadas de jarabe de arce", "3 rebanadas de pastel de jengibre de Jamaica, desmenuzado", "½ lima, solo ralladura", "1 naranja, pelada y segmentada", "2 rebanadas de lima", "azúcar en polvo, para quitar el polvo"], "method": ["Coloque la mitad del mango picado, la miel y dos cucharadas de ron en un procesador de alimentos y mezcle hasta lograr un puré suave. Dobla la mezcla de mango en la crema batida, junto con el jarabe de arce.", "Coloque la mitad de la torta de jengibre en el fondo de dos vasos grandes o platos de servir. Rocíe el ron restante, luego coloque la mitad de la mousse de mango en la parte superior, seguido de la torta de jengibre restante. Termine con el resto de la mousse de mango, luego cubra con el resto del mango picado, ralladura de lima y segmentos de naranja.", "Para servir, decore con la rebanada de lima repita las capas, terminando con la mousse. Cubra con trozos de mango picados, ralladura de lima y segmentos de naranja y decore con las rodajas de limón y el polvo con el azúcar glas."], "url": "www_bbc_co_uk_food_recipes_gingermangoandlimetr_89126", "title": "Ginger, mango y lima.", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Chocolate normal de 250g / 9oz, mínimo de 70% de sólidos de cacao, roto en pedazos", "250g / 9oz de mantequilla", "5 huevos de gallinas camperas", "350g / 12oz de azúcar mascabado oscuro", "Ron 1-2 cucharadas (opcional)", "150 g / 5½ oz de harina común, tamizada", "125 g / 4½ oz de nueces pecanas, más o menos picadas", "4 x 2.5cm / 1in piezas de tallo de jengibre (de un tarro), picado", "azúcar glasé, tamizada, para quitar el polvo (opcional)"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una lata de pastel de 30 cm x 20 cm / 12 \"x 8\" con papel resistente a la grasa.", "Ponga un poco de agua a hervir en una sartén, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue las piezas de chocolate y la mantequilla al tazón y revuelva hasta que se derrita y brillante. Retirar del fuego y reservar para enfriar un poco.", "En otro recipiente, bata los huevos y el azúcar con un batidor eléctrico hasta que estén pálidos, esponjosos y gruesos.", "Agregue la mezcla de chocolate derretido y el ron, si está usando, luego bata de nuevo hasta que esté suave y bien combinado.", "Con cuidado dobla la harina, usando una cuchara de metal. Agregue las nueces de pecan y el jengibre de tallo y doblar en la mezcla, luego vierta la mezcla de brownie en la lata de pastel preparado.", "Transfiere los brownies al horno y hornea por 20-25 minutos, o hasta que la parte superior esté firme al tacto, pero un pincho insertado en el centro de los brownies sale ligeramente pegajoso. Retirar del horno y reservar para enfriar un poco en la lata.", "Cuando los brownies se hayan enfriado un poco, córtelos en 18-20 cuadrados o triángulos y retírelos cuidadosamente de la lata. Acumula un plato y espolvorea con azúcar glas, si lo estás usando."], "url": "www_bbc_co_uk_food_recipes_gingerpecanandrumcho_91734", "title": "Brownies de chocolate con jengibre, nuez y ron", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 18-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gingerpecanandrumcho_91734_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cápsulas de cardamomo", "100ml / 3½ fl oz crema doble", "½ cucharadita de nuez moscada recién rallada, más más a gusto", "150g / 5½ oz de chocolate blanco", "50g / 1¾oz de queso crema", "125g / 4½ oz de harina natural, más extra para espolvorear", "¼ cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de soda", "2 cucharaditas de jengibre molido", "1 cucharadita de especias mixtas", "65 g / 2¼ oz de mantequilla ligeramente salada", "Azúcar en polvo de oro de 65g / 2¼oz", "1 cucharadita de ralladura de limón finamente rallada", "1 tallo de jengibre de tallo grande, muy rallado", "100g / 3½ oz de jarabe dorado, calentado", "100g / 3½oz de almendras copos tostadas", "1 hoja de pan de oro", "50g / 1¾oz de chocolate blanco", "15 avellanas tostadas, pieles eliminadas"], "method": ["Para el ganache, aplasta las vainas de cardamomo en un mortero. Incline en una cacerola pequeña con la crema y la nuez moscada rallada y cocine a fuego lento. Una vez caliente, retirar del fuego y reservar para infundir.", "Para las nueces de jengibre, coloque todos los ingredientes secos en un procesador de alimentos y pulse juntos brevemente.", "Agregue la mantequilla y vuelva a pulsar hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar, la ralladura de limón y el jengibre y el pulso una vez más.", "Vierta el jarabe calentado en el procesador de alimentos y procese hasta que la mezcla forme una bola de masa. Cubra la película adherida y transfiérala al congelador por 15 minutos.", "Precalentar el horno al horno 180C / 170C (ventilador) / Gas 4.", "Retire la masa de gingernut del congelador y prepare 24-30 bolas de masa del tamaño de una nuez de macadamia (aproximadamente 5 g / ⅛oz).", "Coloque cada bola de masa en las bandejas de mini-macaroon y aplaste ligeramente.", "Hornee en el horno durante unos 5-7 minutos, o hasta que aparezca dorado y aparezca una superficie crujiente.", "Retirar del horno y dejar enfriar sobre las bandejas de hornear.", "Para las almendras, fría las almendras en hojuelas en una sartén a fuego medio hasta que se doren. Retire del fuego.", "Saque 24-30 de las almendras copos y cúbralas en pan de oro con un pincel pequeño y seco. Dejar de lado.", "Machaque las almendras en copos restantes en la mano y el mortero y déjelas a un lado.", "Para finalizar el ganache, calienta cuidadosamente la crema hasta que hierva por completo, retira del fuego y remueve el chocolate blanco hasta que se derrita.", "Cuele la crema en un recipiente para eliminar las cápsulas de cardamomo. Pruebe y agregue más nuez moscada, si es necesario. Cubra y deje enfriar.", "Cuando esté frío, revuelva cuidadosamente el queso crema para obtener una consistencia de ganache suave y espesa.", "Para ensamblar, transfiera la ganache a una manga pastelera equipada con una boquilla pequeña y redonda y póngala en la parte superior de la mitad de las nueces de jengibre.", "Sandwich junto con las nueces de jengibre restantes y rodar en las nueces picadas reservadas.", "Derrita el chocolate blanco y úselo para colocar una almendra dorada a cada lado de cada bocadillo de nuez de jengibre. Sirva los bizcochos de lado, con una avellana en la parte superior."], "url": "www_bbc_co_uk_food_recipes_gingernut_sandwich_21151", "title": "Galletas de sándwich de Gingernut", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12-15 petits fours", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["algunas gotas de aceite esencial puro de jengibre", "4 vieiras, sin cáscara y corales", "1 cucharada de aceite de maní", "pimienta negra recién molida"], "method": ["Coloque una rejilla en la base de una olla grande. Coloque la olla en el fogón a fuego moderado. Agregue las gotas de aceite esencial al fondo de la olla. Coloque las vieiras en el estante, cubra y deje infundir durante 2-5 minutos, dependiendo de la fuerza del sabor que le gustaría alcanzar.", "Mientras tanto, precalentar una sartén hasta que esté caliente. Retire las vieiras del aceite esencial. Rocíe con aceite de maní y sazone con pimienta negra. Freír durante 30 segundos, en ambos lados, y servir."], "url": "www_bbc_co_uk_food_recipes_gingerscallops_74887", "title": "Vieiras de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto crianza 110g / 4oz", "Azúcar en polvo de 110 g / 4 oz", "110 g / 4 oz de mantequilla, más extra para engrasar", "2 huevos de gallinas camperas", "pulgar tamaño jengibre, pelado, rallado y exprimido seco en papel de cocina", "200ml / 7fl de leche en oz", "200ml / 7fl oz crema", "1 palo de limon", "2 cucharadas de azúcar en polvo", "3 yemas de huevo de gallinas camperas"], "method": ["Para la esponja, coloque la harina, el azúcar, la mantequilla y los huevos en un procesador de alimentos y mezcle hasta que quede suave. Agregue el jengibre y mezcle brevemente de nuevo.", "Divida la mezcla entre cuatro cuencos de pudín pequeños aptos para microondas engrasados ​​con mantequilla.", "Coloque en el microondas durante ocho minutos, o hasta que las esponjas hayan subido y estén cocidas.", "Ponga las esponjas en cuatro platos y déjelas a un lado.", "Para la crema pastelera, coloque la leche, la crema y la hierba de limón en una cacerola a fuego lento y caliente hasta que hierva, pero no hirviendo. Retirar del fuego y dejar en infusión durante diez minutos.", "Coloque el azúcar impalpable y las yemas de huevo en un bol y mezcle.", "Retire la hierba de limón de la mezcla de leche y vierta gradualmente la mezcla de leche en el cuenco de huevos y azúcar, batiendo constantemente.", "Regrese la mezcla a fuego lento y cocine a fuego lento, revolviendo continuamente, hasta que la natilla cubra la parte posterior de una cuchara, luego cuele en una jarra.", "Para servir, vierta porciones iguales de crema de hierba de limón sobre cada pudín de esponja y sirva."], "url": "www_bbc_co_uk_food_recipes_gingerspongewithlemo_84534", "title": "Esponja de jengibre con crema de limoncillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de glaseado real", "algunas gotas de colorante de comida amarilla", "2 cucharadas de jarabe de azúcar", "150g / 5½oz de cuajada de limón", "Crema doble de 250 ml / 9 fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "100g / 3½oz de mantequilla sin sal", "Echador de 250g / 9oz o azúcar moreno", "50ml / 2fl oz de aceite de girasol", "25 g / 1 oz de arrurruz o harina de maíz", "2 cucharaditas de extracto de vainilla", "4 huevos medianos de granja", "80ml / 2½ fl oz de leche", "100ml / 3½ fl oz crema doble", "Harina normal 300g / 10½ oz", "3 cucharaditas de polvo de hornear", "300g / 10½oz de azúcar glas", "25g / 1 oz de glucosa líquida", "50ml / 1¾fl oz de leche condensada", "2 cucharaditas de extracto de vainilla u otro saborizante", "200g / 7oz de mantequilla sin sal, ablandada", "100g / 3½oz de margarina para hornear, ablandada", "200g / 7oz de azúcar glasé", "100ml / 3¾ fl oz crema doble", "algunas gotas de colorante de comida amarilla", "1 cucharadita de extracto de limón"], "method": ["Unos días antes hacen las margaritas reales. Coloque una cuarta parte del glaseado real en una bolsa de plástico desechable y corte un orificio pequeño (alternativamente, use una manga pastelera con una boquilla plana de 3 mm / ⅛in).", "Alinee una bandeja para hornear con papel de hornear antiadherente, y pegue el papel a la bandeja con un poco de glaseado real. Pipe daisy shapes en el papel.", "Con una cuchara, coloque un cuarto de glaseado real en un bol y mezcle el colorante amarillo. Coloque una cuchara en una bolsa de plástico desechable y corte un orificio pequeño (alternativamente, use una manga pastelera con una boquilla simple de 3 mm / ⅛in). Pipe puntos amarillos en el medio de cada margarita.", "Reserve para secar, a temperatura ambiente, durante 1-2 días.", "Para el pastel, forre la base de una lata honda de 20 cm / 8 pulgadas con papel antiadherente y precaliente el horno a 180 ° C / 350 F / Gas 4.", "Derrita la mantequilla a fuego lento en una olla pequeña, viértala en un bol con el azúcar, el aceite, la harina de maíz (o el arrurruz o el cacao) y la vainilla. Batir bien hasta que quede suave, luego batir los huevos, seguido de la leche y la crema.", "Tamizar y batir la harina y el polvo de hornear en la mezcla de mantequilla en tandas hasta que quede suave, luego cuchara en la lata preparada y hornear durante unos 50 minutos, o hasta que elástico y pincho insertado en el centro sale limpio.", "Para la crema de mantequilla, mezcle el azúcar glas, la glucosa, la leche condensada, el saborizante y la mantequilla con un mezclador eléctrico en un tazón hasta que quede suave y liviano, luego bata en la margarina para hornear hasta que quede suave.", "En una jarra, mezcle el azúcar glas en la crema hasta que se disuelva, luego agregue el colorante amarillo y el extracto de limón hasta que esté suave y esponjoso. (Esta crema de mantequilla se mantiene muy bien cubierta a temperatura ambiente durante 2-3 días y puede calentarse ligeramente y volverse a batir si la textura es demasiado firme).", "Para armar la torta, retire la torta de la lata, recorte la parte superior de la torta para que quede plana, luego corte la torta por la mitad horizontalmente. Pon la mitad inferior de la torta en un plato para servir y unta con la cuajada de limón. Ponga una cucharada de la crema doble alrededor del borde del pastel y con cuidado alisarlo en el medio. Rocíe la mitad superior de la torta con el jarabe de azúcar y colóquelo encima de la mitad inferior. (El jarabe de azúcar ayudará a mantener el pastel húmedo).", "Vierte una cucharada grande de crema de mantequilla en la parte superior de la torta, luego alisa sobre la parte superior de la torta para crear una superficie plana. Usando una regla, raspe lentamente la superficie para asegurarse de que esté lisa y plana.", "Extienda el glaseado alrededor de la torta y use un raspador de pastel o una espátula para asegurarse de que esté suave.", "Enfríe en la nevera durante dos horas, luego repita con otra capa de hielo. Enfríe en el refrigerador por otras dos horas.", "Con una cuchara, coloque el glaseado real restante en una manga pastelera desechable y corte un orificio pequeño (alternativamente, utilice una manga pastelera con una boquilla plana de 3 mm / ⅛in).", "Coloca el \"Feliz cumpleaños\" en el pastel (o un mensaje de tu elección) y usa el resto del glaseado real para pegar las flores en la parte superior y los lados del pastel."], "url": "www_bbc_co_uk_food_recipes_girls_birthday_cake_46200", "title": "Pastel de cumpleaños de niña", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace pastel de 1 x 20 cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/girls_birthday_cake_46200_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Macarrones 340g / 12oz", "80g / 3oz de panceta, cortada en cubitos", "pequeñas hojas de tomillo fresco", "3 cebollas de primavera, cortadas y finamente rebanadas", "100g / 3½oz de pan rallado", "puñado de perejil fresco picado", "40 g / 1½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "pellizcar nuez moscada molida", "1 cucharadita de mostaza inglesa en polvo", "200ml / 7fl de leche en oz", "285ml / 10fl oz de crema doble", "200 g / 7 oz de dolcelatte o queso gorgonzola", "115 g / 4 oz de queso parmesano, rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cocine los macarrones en una olla grande de agua hirviendo con sal, durante 8-10 minutos, o hasta que estén recién cocinados. (Tiene que ser poco cocido ya que la pasta se cocinará nuevamente en el horno.) Escurrir, volver a la sartén y reservar.", "Mientras tanto, fría la panceta en una sartén mediana a fuego lento hasta que empiece a dorarse y crujiente, luego agregue las hojas de tomillo y las cebollas tiernas y cocine durante 3-4 minutos más. Retire la sartén del fuego y agregue su contenido a la pasta.", "Para la salsa, ponga la mantequilla, la harina, la nuez moscada y la mostaza en una sartén pequeña a fuego medio y cocine hasta que la mantequilla se haya derretido. Mezcle la leche y la crema en una jarra y agregue un poco a la harina y la mantequilla en la sartén, revuelva bien. Siga agregando la mezcla de leche, poco a poco, revolviendo bien cada vez. (Esto evitará que la salsa se nuble. La tentación es poner toda la leche a la vez solo para encontrar que se quedan con matas de harina flotando en la superficie. En caso de que esto ocurra, retire la sartén del fuego y bata como Esto normalmente hace el truco para eliminar todos los grumos. Asegúrate de llevar la cuchara a las \"esquinas\" de la sartén ya que los montículos de harina a menudo acechan allí.", "Una vez que haya agregado toda la leche, suba el fuego y hierva por un minuto o dos. La salsa se espesará considerablemente, luego retire la sartén del fuego. Agregue dos tercios de la dolcelatte (o gorgonzola) y parmesano a la salsa mientras todavía está caliente y mezcle hasta que estén bien combinados. Puede ser un poco abultado, pero eso está bien. Sazone al gusto con sal y pimienta.", "Agregue la salsa a la mezcla de pasta y revuelva todo junto. Vierta la mezcla en una cacerola poco profunda o en cuatro moldes grandes individuales.", "Espolvoree el queso restante y las migas de pan sobre la parte superior y hornee en el horno durante unos 20-30 minutos, o hasta que el queso comience a burbujear y la cobertura esté dorada.", "Espolvorear con el perejil picado."], "url": "www_bbc_co_uk_food_recipes_glam_mac_and_cheese_92848", "title": "Glam mac y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4 invitados glamorosos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/glam_mac_and_cheese_92848_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de queso Lincolnshire Poacher", "1 bola de Burrata o 1 bola de mozzarella", "175g / 6oz stilton, preferiblemente Colston Bassett Stilton", "175g / 6oz de Cornualles", "175g / 6oz de queso de cabra azul suave", "175g / 6oz de queso Ogleshield", "aceite vegetal, para freír", "Harina normal de 100 g / 3½ oz", "3 huevos medianos de granja, golpeados", "200g / 7oz de pan rallado seco o pan rallado panko", "sal marina", "100 g / 3½ oz de azúcar en polvo", "Mitades de nuez 100g / 3½ oz", "pizca de cayena", "aceite de colza, para freír poco", "1 cabeza de apio con hojas", "2 cucharadas de aceite de oliva", "1 cabeza gema bebé hojas, hojas separadas", "2 manzanas verdes, cortadas en cuñas", "2 manzanas rojas, cortadas en cuñas", "1 limón, cáscara y jugo solamente", "sal y pimienta negra recién molida", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "1-2 cucharadas de vinagre de vino blanco (al gusto)", "150ml / 5fl oz de aceite de girasol", "150ml / 5fl oz de aceite de oliva", "100g / 3½oz de salsa picante de mango", "50g/1¾oz quince paste (membrillo)"], "method": ["Para el queso frito, precaliente una freidora a 190C. Alternativamente, caliente el aceite en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido).", "Corta un poco del queso en trozos. Cubra los trozos en la harina, luego sumerja los huevos y drague en las migas de pan. Coloque en la freidora, en tandas si es necesario, y cocine hasta que estén doradas. Retire y escurra sobre papel de cocina, sazone con sal marina.", "Para la ensalada, haga un almíbar calentando el azúcar con 100 ml / 3½ fl oz de agua hasta que el azúcar se haya disuelto. Llevar a ebullición y agregar las mitades de nuez y pimienta de cayena. Retirar del fuego y reservar para enfriar.", "En una sartén o sartén, caliente el aceite de colza hasta que esté caliente. Poco a poco freír las nueces hasta que estén crujientes (aproximadamente 30 segundos), luego escurrir sobre papel de cocina.", "Picar la mitad del apio en trozos pequeños, y cortar el resto en tiras largas de 5cm / 2 pulgadas. Coloque el aceite de oliva y las hojas de la gema del bebé en un recipiente, luego agregue las tiras de apio. Mezcle el apio para cubrir el aceite y sazone con sal y pimienta. Coloque los trozos de apio y los ingredientes restantes de la ensalada, incluidas las nueces en un bol y mezcle bien.", "Para la mayonesa, coloque las yemas de huevo, la mostaza y el vinagre de vino blanco en un procesador de alimentos y mezcle.", "Con el procesador todavía funcionando, vierta lentamente el aceite de girasol y el aceite de oliva, gota a gota al principio, luego más rápido a medida que la mezcla se espesa, alternando entre los dos aceites a medida que avanza. Continúe mezclando hasta que se incorpore todo el aceite y se forme una mayonesa espesa. Transfiera la mayonesa a un recipiente limpio y sazone con sal y pimienta.", "Justo antes de servir, agregue la mayonesa a la ensalada y mezcle bien.", "Para la salsa de mango y membrillo, coloque la salsa picante y péguela en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Coloque el queso frito caliente en una tabla de servir con el queso frío. Sirve la ensalada y la salsa al lado."], "url": "www_bbc_co_uk_food_recipes_glamming_up_a_cheese_95592", "title": "Glamming una tabla de quesos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "100 g / 3½ oz de puerro (aproximadamente 1 puerro), finamente picado", "¼ cucharadita de nuez moscada recién rallada", "Pan rallado integral de 200 g / 7oz, más un extra de 75 g para cubrir las salchichas", "2 cucharaditas de hojas frescas de tomillo", "2 cucharaditas colmadas de laverbread fresco", "Cheddar fuerte 175g / 6oz, rallado", "1½ cucharadita de mostaza inglesa", "2 huevos, 1 golpeado", "salpicar leche (si es necesario)", "50g / 1¾oz de harina natural", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida"], "method": ["Derretir la mitad de la mantequilla en una sartén a fuego medio. Agregue el puerro y sazone con sal, pimienta y nuez moscada. Cubra y cocine por 10-12 minutos, o hasta que esté suave, revolviendo ocasionalmente. Dejar enfriar.", "En un tazón, combine las migas de pan de 200g / 7oz, tomillo, laverbread y Cheddar. Agregue la mezcla de puerros enfriada, la mostaza y el huevo entero. Sazonar bien, agregando un chorrito de leche si es necesario, para juntarlo en una masa.", "Dale forma a 12 salchichas pequeñas y enfría en la nevera durante 20 minutos.", "Precaliente el horno a 200C / 180C Fan / Gas 6 y alinee una bandeja de hornear con papel resistente a la grasa.", "Coloque el huevo batido, la harina y las migas de pan restantes en recipientes separados poco profundos. Una vez que las salchichas estén frías, revuélvalas en la harina, luego el huevo batido y luego las migas de pan.", "Derretir la mantequilla restante y el aceite vegetal en una sartén a fuego medio y freír las salchichas durante 2-3 minutos, o hasta dorar por completo.", "Coloque en la bandeja de hornear preparada y cocine durante 12-15 minutos, o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_glamorgan_sausages_01437", "title": "Salchichas Glamorgan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Puerros de 115 g / 4 oz, cortados en rodajas finas (peso preparado)", "175g / 6oz de pan blanco fresco", "2 cucharadas de perejil fresco picado", "1 cucharada de tomillo fresco picado", "150g / 5oz de queso Caerphilly o cheddar galés, finamente rallado", "2 huevos de gallinas camperas, separados", "1 cucharadita de mostaza inglesa", "½ cucharadita de sal marina en copos", "5 cucharadas de aceite de girasol", "pimienta negra recién molida", "2 cucharadas de aceite de girasol", "2 cebollas rojas medianas, finamente cortadas", "1 chile rojo, finamente picado", "2 dientes de ajo, aplastados", "75g / 2½oz de azúcar morena mascabado", "5 cucharadas de vinagre de vino blanco"], "method": ["Para las salchichas, derrita la mantequilla en una sartén antiadherente grande y fría el puerro suavemente durante 8-10 minutos, o hasta que esté muy suave pero no coloreado.", "Ponga 100 g / 3½ oz de las migas de pan, el perejil, el tomillo y el queso en un tazón grande y mezcle hasta que estén bien combinados. Batir las yemas de huevo con la mostaza, la sal y un montón de pimienta negra recién molida en un recipiente aparte.", "Retire la sartén del fuego e incline los puerros en el recipiente con el pan rallado. Agregue las yemas de huevo y mezcle bien con una cuchara grande de madera hasta que estén bien combinados. Divida la mezcla de puerros en ocho porciones y enrolle en forma de salchichas. Coloque las salchichas en una bandeja forrada con film transparente.", "Batir las claras de huevo ligeramente en un tazón con un batidor grande de metal hasta que quede solo espumoso. Espolvoree 40 g / 1½ oz de pan rallado sobre un plato grande. Sumerja las salchichas una por una en el huevo batido y revuelva en las migas de pan hasta que queden bien recubiertas, luego coloque en la bandeja para hornear. Enfríe las salchichas en la nevera durante 30 minutos.", "Mientras tanto, para su deleite, caliente el aceite en una olla grande antiadherente y fría las cebollas durante 20 minutos, o hasta que estén muy suaves y apenas comiencen a colorear. Agregue el chile y el ajo a la sartén y cocine por otros cinco minutos, revolviendo regularmente.", "Espolvorea con el azúcar y vierte sobre el vinagre. Deje que hierva a fuego lento y cocine durante cinco minutos más, o hasta que el líquido se reduzca bien y la salsa se vuelva espesa y brillante. Retire del fuego, deje enfriar por unos minutos y luego colóquelo en un plato para servir.", "Caliente el aceite en una sartén antiadherente grande y fría las salchichas a fuego medio durante 10-12 minutos, volteándolas regularmente hasta que estén doradas y crujientes. Sirva las salchichas con una buena cucharada de salsa de chile y cebolla y algunas judías verdes en rodajas finas."], "url": "www_bbc_co_uk_food_recipes_glamorgan_sausages_with_64911", "title": "Salchichas de Glamorgan con cebolla roja y salsa de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/glamorgan_sausages_with_64911_16x9.jpg", "isVegetarian": true, "recommendations": 0}]