[{"isVegetarian": true, "title": "Buñuelos de manzana con crema pastelera", "url": "www_bbc_co_uk_food_recipes_applefritterswithcre_84896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml / 10½fl oz de aceite vegetal caliente", "2 huevos de gallinas camperas, golpeados", "150g / 5½ oz de harina de auto crianza", "agua para mezclar", "2 cucharadas de menta fresca picada", "1 manzana, cortada en segmentos", "3 yemas de huevo de gallinas camperas", "4 cucharadas de azúcar en polvo", "1 vaina de vainilla, partida por la mitad, semillas raspadas", "1 cucharada de harina de maíz", "½ pinta de leche entera", "canela, para quitar el polvo", "azúcar en polvo, para quitar el polvo"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para los buñuelos de manzana, caliente el aceite vegetal en una olla profunda de fondo grueso, hasta que la miga de pan chisporrotee y se ponga marrón cuando se caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión).", "Coloque los huevos, la harina y el agua en un tazón y mezcle para crear una mezcla suave. Agregue la menta picada y revuelva bien.", "Sumerja la manzana en la mezcla de la mezcla y añada cuidadosamente al aceite caliente. Fríe los buñuelos hasta que estén dorados y crujientes, luego retíralos con cuidado con una espumadera y escurre sobre papel de cocina.", "Para la crème anglaise, coloque las yemas de huevo y el azúcar en un tazón y bata juntos hasta que la luz. Agregue la harina de maíz y las semillas de vainilla y mezcle bien.", "Coloque la leche en una cacerola y caliente hasta el punto de escaldar, no hierva.", "Agregue la leche caliente a la mezcla de huevo, luego devuelva la mezcla de leche a la cacerola y vuelva a colocarla sobre el fuego. Cocine a fuego lento la mezcla durante tres minutos, revolviendo constantemente, hasta que cubra la parte posterior de una cuchara.", "Para servir, coloca la crema inglesa en un tazón con los buñuelos de manzana colocados en la parte superior. Polvo con canela y azúcar glas."]}, {"isVegetarian": true, "title": "Ensalada de cebolla con aderezo de queso azul", "url": "www_bbc_co_uk_food_recipes_appleonionsaladwithb_78290", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "l½ cebolla roja, picada", "1 manzana, sin corazón y en rodajas", "25g / 1oz de queso Dolcelatte", "3 cucharadas de vinagre de vino blanco", "1 cucharada de mostaza integral", "50ml de aceite de oliva"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una sartén, agregue la cebolla y cocínelo durante 3-4 minutos a fuego lento hasta que se ablande. Transfiera a un tazón con la manzana.", "En otro recipiente, mezcle el queso azul con el vinagre y la mostaza integral.", "Poco a poco agregue el aceite, batiendo constantemente. Verter la mezcla sobre la manzana y la cebolla roja y servir."]}, {"isVegetarian": true, "title": "Paquetes de manzana con natillas", "url": "www_bbc_co_uk_food_recipes_appleparcelswithcrem_76458", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g / 1oz de mantequilla sin sal", "1 manzana, en rodajas", "5 fechas, picadas", "2 cucharadas de jarabe de arce", "1 hoja de pasta de filo lista para usar", "1 huevo de gallinas camperas, golpeado", "azúcar glas, al polvo", "30 g / 1 oz de azúcar en polvo", "4 yemas de huevo de gallinas camperas", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Suavemente derretir la mantequilla en una sartén y saltear la manzana con las fechas y el jarabe de arce durante unos minutos.", "Coloque la hoja de pasta filo preparada sobre una superficie limpia. Coloque la mezcla encima y doble para formar un triángulo. Selle los bordes con el huevo batido y polvo generosamente con azúcar glas.", "Coloque en una bandeja para hornear antiadherente y hornee en el horno durante 5-6 minutos, o hasta que estén dorados.", "Para hacer la crema inglesa, bata el azúcar y las yemas de huevo en un tazón hasta que estén pálidas y esponjosas.", "Calienta suavemente la leche y la crema en una sartén hasta que casi hirviendo. Vierta la mezcla de leche caliente en la mezcla de huevo y siga batiendo constantemente para evitar que se cuaje. Regrese a la sartén y revuelva hasta que espese.", "Retire el paquete de manzana del horno y transfiéralo a un plato de servir.", "Rocíe la crème anglaise para servir."]}, {"isVegetarian": true, "title": "pie de manzana", "url": "www_bbc_co_uk_food_recipes_applepie_89624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 425 g / 15 oz, más extra para quitar el polvo", "½ cucharadita de sal", "100 g / 3½ oz de azúcar en polvo", "250 g / 9 oz de mantequilla sin sal, más extra para engrasar", "1 huevo de gallinas camperas, golpeado", "2 yemas de huevo de gallinas camperas", "100 g / 3½ oz de sultanas", "½ naranja, solo jugo", "1 cucharada de harina de sémola", "8 manzanas grandes para cocinar, peladas, sin núcleo, carne finamente cortada", "100 g / 3½ oz de azúcar en polvo de oro, más extra para quitar el polvo", "1 cucharada de canela molida", "1 huevo de gallinas camperas, golpeado", "crema coagulada, para servir"], "serves": "4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa, mezcle la harina, la sal, el azúcar y la mantequilla en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado. Poco a poco agregue el huevo batido y las yemas de huevo y mezcle hasta que esté suave y bien combinado. Traiga la mezcla de masa con las manos, envuélvala en una película adhesiva y transfiérala a la nevera para enfriar durante 30-45 minutos.", "Mientras tanto, engrase una lata de pastel con manteca de 20cm / 8in de primavera. Agregue una pequeña cantidad de harina y gire la lata para cubrir los lados y el fondo, sacudiendo cualquier exceso. Precalentar el horno a 180C / 350F / Gas 4.", "Extienda dos tercios de la masa fría sobre una superficie de trabajo enharinada limpia, hasta que sea casi dos veces más ancho que el diámetro de la lata de la torta. Usando el rodillo, levante la masa y colóquela sobre la lata de la torta para alinear la base y los lados. Presione suavemente la masa en las esquinas de la lata, recortando cualquier exceso de masa, luego pinche la base de la caja de pastelería varias veces con un tenedor.", "Cubra la masa con una hoja de papel resistente a la grasa y llénela con arroz o frijoles secos. Hornee en el horno por 12-15 minutos, o hasta que la masa esté dorada. Retire del horno, deseche los frijoles y el papel resistente a las grasas y deje que la pastelería se enfríe. Reduzca la temperatura del horno a 170 C / 325 F / Gas 3.", "Para el relleno, coloque las pasas y el jugo de naranja en un tazón y déjelos durante 30-40 minutos, o hasta que las sultaninas estén rellenas.", "Espolvoree la harina de sémola sobre la base de la caja de repostería enfriada. Coloque la mitad de las rebanadas de manzana en una sola capa en la base de la caja de pastelería. Esparce la capa de manzana con las pasas sultanas, luego espolvorea más de la mitad del azúcar impalpable y la mitad de la canela. Repita el proceso con las rodajas de manzana restantes, azúcar y canela.", "Para la tapa de la pastelería, extienda el tercio restante de la masa en una superficie de trabajo enharinada limpia, hasta que sea lo suficientemente grande como para cubrir la lata de la torta. Cepille el borde de la caja de repostería con un poco del huevo batido y coloque la tapa de la repostería encima del pastel. Recorte cualquier exceso de pastelería. Selle la tapa de la pastelería en la caja de pastelería doblando los bordes de la tapa de la pastelería con un tenedor.", "Con un cuchillo, haga dos pequeños orificios en el centro de la tapa de la pastelería para permitir que salga el vapor. Cepille la tapa de la pastelería con el huevo batido restante, luego transfiéralo al horno y hornee durante 35-40 minutos, o hasta que se dore.", "Para servir, coloque una porción de la tarta de manzana en un plato de servir y una cucharada de crema coagulada al lado."]}, {"isVegetarian": true, "title": "Chutney de manzana, pera y albaricoque", "url": "www_bbc_co_uk_food_recipes_applepearandapricotc_13703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2.2lb de manzanas bramley, peladas, sin corazón y cortadas en cubos", "Peras para conferencias de 1 kg / 2.2 lb, peladas, sin corazón y cortadas en cubitos", "2 cebollas grandes, finamente picadas", "2 dientes de ajo, aplastados", "2 limas, ralladura de ralladura y jugo", "1 cucharada de semillas de mostaza", "1 litro / 1¾ pinta de vinagre de vino blanco", "225 g / 8 oz cada pasas y albaricoques secos picados", "Jengibre de raíz de 7.5cm / 3in, pelado y rallado", "2 cucharaditas de jengibre molido", "1 cucharada de sal marina", "1kg / 2lb2oz de azúcar mascabado oscuro", "Caliente los frascos de mermelada esterilizados y las cubiertas de marihuana: prepare los frascos lavándolos en agua caliente con jabón y déjelos secar y calentar en un horno frío - 130 ºC / 250 F / Gas ½ durante 10-15 minutos."], "serves": "Hace tarros de 3-4 x 450 g / 1 lb", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las manzanas, las peras, las cebollas, el ajo, la ralladura de limón y el jugo, las semillas de mostaza y la mitad del vinagre en una cacerola grande, deje que hierva y cocine a fuego lento hasta que la fruta esté casi cocinada.", "Agregue el vinagre restante junto con el resto de los ingredientes, lleve a ebullición y cocine a fuego lento durante 20-25 minutos o hasta que espese y espese.", "Deje que la salsa picante se enfríe durante 15-20 minutos, luego empáquela en los frascos de mermelada, cúbrala con un disco de cera y una tapa con tapa de rosca. Almacene en un lugar fresco y oscuro durante 3-4 semanas antes de disfrutar."]}, {"isVegetarian": false, "title": "Hamburguesa de manzana, cerdo y cheddar con patatas fritas", "url": "www_bbc_co_uk_food_recipes_appleporkandcheddarb_86803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "150 g / 5½ oz de papa (aproximadamente 1 papa grande), pelada y cortada longitudinalmente en finas papas fritas", "2 salchichas, pieles eliminadas", "30g / 1oz de queso cheddar, desmenuzado", "½ cebolla, finamente picada", "1 cucharada de mostaza integral", "3 hojas de salvia, finamente picadas", "¼ de manzana, rallado", "¼ cucharadita de salsa Worcestershire", "1 cucharada de aceite de oliva", "30g / 1oz de queso cheddar, en rodajas", "cebollino pequeño, picado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las patatas fritas, caliente el aceite en una sartén antiadherente y fría las patatas fritas durante 15 minutos o hasta que estén doradas y cocidas.", "Para la hamburguesa, combine la carne de salchicha, el queso cheddar desmenuzado, la cebolla, la mostaza, las hojas de salvia, la salsa de manzana y Worcestershire y mezcle bien. Forma en una empanada.", "Calentar el aceite en una sartén antiadherente y freír durante 4-5 minutos en cada lado o hasta que esté bien cocido.", "Para servir, cubra la hamburguesa con el cheddar en rodajas. Servir en un plato con las patatas fritas y decorar con las cebolletas."]}, {"isVegetarian": true, "title": "Gachas de manzana, pasas y coco con azúcar especiada", "url": "www_bbc_co_uk_food_recipes_appleraisinandcoconu_88089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g / 1oz de mantequilla", "½ manzana Bramley, pelada y picada", "2 cucharaditas de azúcar en polvo", "30 g / 1oz de pasas", "Avena 70gr / 2½ oz avena", "200ml / 7fl oz de leche de coco", "1 cucharada de azúcar en polvo", "1 cucharada de azúcar morena suave", "½ cucharadita de especias mixtas", "½ cucharadita de canela molida"], "serves": "Sirve 1-2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la papilla, derrita la mantequilla en una cacerola, agregue la manzana y fríela suavemente durante tres minutos. Agregue el azúcar en polvo y cocine por un minuto.", "Agregue las pasas de uva, la avena y la leche de coco y cocine a fuego lento durante cinco minutos, revolviendo continuamente. Agregue más leche de coco si la papilla es demasiado espesa. Cuchara en un tazón.", "Para el azúcar con especias, mezcle el azúcar impalpable, el azúcar moreno suave, la mezcla de especias y la canela molida hasta que se combinen.", "Para servir, espolvorea el azúcar con especias sobre la papilla."]}, {"isVegetarian": true, "title": "Nieve de manzana", "url": "www_bbc_co_uk_food_recipes_applesnow_66346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 manzanas, en rodajas finas", "1 cucharadita de canela", "azúcar al gusto", "120ml / 4fl oz de crema doble", "3 claras de huevo"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las manzanas, la canela y una pizca de azúcar en una sartén y cocine hasta que las manzanas se ablanden, luego pase a través de un colador y deje que se enfríe.", "Batir la crema en picos suaves y batir las claras de huevo junto con un poco de azúcar hasta que se forme picos duros. Agregue la crema y las claras de huevo a la mezcla de manzana y sirva en un tazón."]}, {"isVegetarian": true, "title": "Salsa de manzana", "url": "www_bbc_co_uk_food_recipes_applesauce_1310", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/applesauce_1310_16x9.jpg", "ingredients": ["225 g / 8 oz de manzanas de cocina, peladas, sin corazón y picadas", "½ limón, solo ralladura", "2 cucharadas de agua", "15g / ½ oz de mantequilla", "1 cucharadita de azúcar en polvo"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pon las manzanas en una olla con la ralladura de limón y agua. Cubra y cocine a fuego lento hasta que estén suaves y blandas.", "Quítate el fuego y bate la mantequilla y el azúcar. Guay."]}, {"isVegetarian": true, "title": "Sorbete de manzana", "url": "www_bbc_co_uk_food_recipes_applesorbet_14293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litro / 1¾ pinta de jugo de manzana recién prensado", "un poco de azúcar glas", "jugo de limon", "calvados o aguardiente de manzana"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Batir un poco de azúcar glas y jugo de limón en el jugo de manzana para obtener el equilibrio correcto de dulzura y ácido, recordando que cuando se congela el poder de la dulzura y la acidez disminuyen.", "Luego agítelo en una máquina para hacer helados o vierta en platos de plástico a una profundidad no mayor a 2 cm / ¾ pulgada. Si está utilizando platos de plástico, retírelos del congelador cuando la mezcla esté congelada (pero no muy dura) y rasque con un tenedor en un sorbete suave. Si nunca ha probado este método, pronto obtendrá el truco de eso.", "O sirva directamente o embálelos en tinas y congélelos. Descongelar durante 30-60 minutos a temperatura ambiente antes de servir.", "Sirva con un par de cucharadas de calvados sobre el sorbete."]}, {"isVegetarian": true, "title": "Compota de manzana", "url": "www_bbc_co_uk_food_recipes_applecompote_11371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g / 3½oz de mantequilla sin sal", "750 g / 1 libra 10 oz manzanas Granny Smith, peladas, sin corazón y picadas", "100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla dividida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la mantequilla en una olla de acero inoxidable y comience a derretirse.", "Agregue las manzanas, el azúcar y la vaina de vainilla.", "Cocine la manzana en compota, revolviendo de vez en cuando durante aproximadamente 30 minutos a fuego moderado.", "Si la textura es demasiado líquida, déjela reducir hasta que tenga una textura gruesa.", "Retire la vaina de vainilla y reserve para usarla más tarde.", "Coloque la compota de manzana en una licuadora, mezcle con una pulpa fina y pase a través de un tamiz fino. Servir."]}, {"isVegetarian": true, "title": "Charlotte de manzana con salsa de caramelo", "url": "www_bbc_co_uk_food_recipes_applecharlottewithca_89888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g / 1oz de mantequilla", "Manzanas de Bramley 225g / 8oz (o manzanas de cocina similares), peladas, en rodajas", "225g / 8oz Cox's, Pippins o cualquier otra manzana inglesa, pelada, cortada", "30 g / 1 oz de azúcar en polvo", "1 vaina de vainilla, partido, semillas raspadas", "1 yema de huevo de gallinas camperas", "75g / 2¾ oz de mantequilla derretida para el pan", "8 rebanadas de pan blanco, sin costras", "100 g / 3½ oz de mantequilla", "100g / 3½oz de azúcar morena oscura", "100ml / 3½ fl oz crema doble", "nata"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mantequilla en una sartén grande a fuego medio. Agregue todas las manzanas, el azúcar y las semillas de vainilla. Cocine hasta que las manzanas se ablanden lo suficiente como para descomponerse en un puré. Retirar del fuego y dejar enfriar.", "Una vez que la mezcla de manzana esté fría, agregue la yema de huevo y mezcle bien para combinar.", "Unte con mantequilla las rebanadas de pan y forme una fuente de 600ml / 1 pinta con las rebanadas de pan, superponiendo las rebanadas para asegurarse de que no queden huecos.", "Vierta la mezcla de manzana y cubra la parte superior con el pan restante.", "Coloque un plato sobre el pudin y péselo con una lata de frijoles (o un peso similar) durante una hora.", "Retire el plato y cubra el pudín con papel de cocina. Hornee en el horno por 30 minutos.", "Retire la lámina y hornee durante diez minutos más o hasta que la parte superior esté dorada.", "Para la salsa, coloque la mantequilla, el azúcar y la crema en una sartén por separado a fuego medio. Llevar a ebullición y cocinar durante 5-6 minutos, hasta que se combine como una salsa suave.", "Para servir, corte una rodaja de manzana Charlotte y colóquela en cada plato. Agregue una cucharada generosa de la salsa y una cucharada de crema coagulada al lado."]}, {"isVegetarian": true, "title": "Strudel de manzana", "url": "www_bbc_co_uk_food_recipes_applestrudel_85975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["680 g / 1½ lbs comiendo manzanas, peladas, sin corazón y picadas", "½ naranja, jugo y ralladura solamente", "100 g / 3½ oz de azúcar en polvo", "nuez moscada recién rallada, al gusto", "55g / 2oz sultanas", "6-8 hojas de pasta de filo lista para usar", "55g / 2oz de mantequilla, derretida y enfriada, más extra para engrasar", "2 cucharadas de pan rallado seco"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Coloque la manzana, el jugo de naranja y la ralladura, el azúcar, la nuez moscada y las pasas en un tazón grande y mezcle bien.", "Cepille cada hoja de hojaldre con mantequilla derretida, luego coloque las hojas de hojaldre una encima de la otra sobre una hoja grande de papel resistente a la grasa.", "Espolvorea la hoja superior del filo con un poco de pan rallado seco, luego coloca la mezcla de manzana en el centro de la hoja de filo.", "Con cuidado, enrolle la masa alrededor del relleno como un cigarro, usando el papel resistente a la grasa para ayudar.", "Coloque el rollo de filo en una bandeja de horno engrasada, cepille con la mantequilla derretida restante y cocine durante 30-40 minutos, hasta que se dore ligeramente y el relleno esté caliente."]}, {"isVegetarian": true, "title": "Tarta de manzana con sorbete de mora", "url": "www_bbc_co_uk_food_recipes_appletartwithblackbe_89565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 g / 10½ oz de azúcar en polvo", "300ml / 10½fl oz de agua", "medio limón, solo jugo", "4 cucharaditas de glucosa líquida", "400 g / 14 oz zarzamoras", "75 g / 2½ oz de azúcar en polvo", "1 cucharada de agua", "400 g / 14 oz de hojaldre laminado", "Manzanas de 250 g / 9 oz, peladas y cortadas en rodajas", "125g / 4oz Demerera azúcar", "hojas de menta fresca, para adornar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el sorbete, coloque el azúcar, el agua, el jugo de limón y la glucosa líquida en una sartén a fuego lento.", "Mezcle la mezcla y lentamente hierva. Hierva la mezcla durante cinco minutos, luego retírela del fuego y déjela enfriar. Coloque en la nevera para enfriar.", "Mientras tanto, para las moras, coloque las moras, el azúcar y el agua en una sartén limpia a fuego lento. Cocine suavemente para ablandar la fruta.", "Pase la mezcla de moras a través de un colador en un recipiente.", "Agregue la mezcla de moras al sirope frío y revuelva en una máquina para hacer helados de acuerdo con las instrucciones del fabricante.", "Transfiera a un recipiente a prueba de congelación y congele hasta que sea necesario.", "Para la tarta, precalentar el horno a 180C / 365F / Gas 4.", "Cortar la masa en cuatro cuadrados iguales de aproximadamente 15 cm / 6 pulgadas y colocar en una bandeja de horno.", "Coloque las manzanas en línea recta a través de cada pieza de masa, superponiéndose entre sí, para cubrir cada pieza de masa.", "Espolvorea con azúcar, luego colócalo en el horno para hornear durante 12-15 minutos, o hasta que esté dorado y cocido.", "Para servir, transfiere cada tarta de manzana a un plato mientras aún está caliente y coloca una bola de sorbete de mora en la parte superior. Adorne con una ramita de menta."]}, {"isVegetarian": false, "title": "Tarta de manzana 'mamá blanca'", "url": "www_bbc_co_uk_food_recipes_appletartmamanblanc_93268", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/appletartmamanblanc_93268_16x9.jpg", "ingredients": ["Harina normal de 250g / 9oz", "Una pizca de sal marina", "125g / 4oz de mantequilla sin sal, picada, a temperatura ambiente", "1 cucharadita de agua fría", "1 huevo mediano de gallinas camperas", "15 g / ½ oz de mantequilla sin sal", "½ cucharada de jugo de limón", "Azúcar en polvo de 65 g / 2½ oz", "½ cucharada de calvados", "3-4 manzanas Cox's Orange Pippin, Worcester, Russet o Braeburn, peladas, sin núcleo, cada una cortada en 10 segmentos", "100ml / 3½ fl oz crema doble", "1 huevo mediano de gallinas camperas", "1-2 cucharadas de azúcar glas, para quitar el polvo"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa, pulse la harina, la mantequilla y la sal en un procesador de alimentos hasta que alcance una textura arenosa. Agregue el huevo, el agua y el pulso de nuevo. Si sobremezclas la masa en esta etapa, perderá su descamación.", "Transfiera la masa a una superficie de trabajo ligeramente enharinada y amasar con las palmas de las manos durante 30 segundos, o hasta que la masa esté suave y bien combinada.", "Con la palma de su mano, aplaste la masa ligeramente a 1 cm / ½ pulgada de grosor, luego siéntela entre dos hojas grandes de película adhesiva. Enfriar en la nevera durante 30 minutos.", "Precaliente el horno a 220C / 440F / Gas 7. Coloque una bandeja para hornear en el horno para precalentar.", "Enrolle la masa enfriada, aún en forma de sándwich en una película adhesiva, hasta obtener un grosor de 2 mm. Coloque un anillo agrio de 22cm / 9in de diámetro y 2cm / ¾ de profundidad en una cáscara de madera recubierta con grasa o en una bandeja para hornear. Retire la capa superior de film transparente y cuidadosamente levante la masa, colóquela en el anillo agrio con la segunda capa de film transparente hacia arriba. Levanta y coloca la masa en los bordes del anillo y descarta la película adhesiva. Al meter la base minimizará la contracción de la masa durante la cocción. Recorte cualquier exceso con un rodillo.", "Con el dedo índice y el pulgar, pellizque y presione la masa hasta que quede a 2 mm por encima del anillo agrio alrededor del borde. Con un tenedor, pincha la parte inferior de la tarta. Enfriar en la nevera durante 20 minutos.", "Mientras tanto, para el relleno, caliente la mantequilla, el jugo de limón y 15 g / 1 oz del azúcar en una olla pequeña hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Retire del fuego y agregue Calvados. Dejar de lado.", "Cuando la caja de tarta se haya enfriado, acomode los segmentos de manzana en círculos concéntricos, superponiendo las rebanadas de manzana sobre la marcha. Cepille las manzanas con la mezcla Calvados. Deslice el anillo agrio en la bandeja de hornear precalentada y hornee durante 10 minutos.", "Reduzca la temperatura del horno a 200 ° C / 400 ° F / Gas 6, luego continúe cocinando durante otros 20 minutos, hasta que la masa esté dorada y pálida y las manzanas se hayan caramelizado.", "Batir la crema doble, el huevo y el azúcar impalpable restante a 50 g / 2 oz hasta que estén bien combinados. Cuando la masa esté pálida dorada y las manzanas se hayan caramelizado, espolvorea la tarta con una cucharada de azúcar y vierte la mezcla de crema en la tarta, hornea por otros 10 minutos, hasta que la mezcla de relleno se haya puesto.", "Para servir, retire la tarta del horno y déjela a un lado durante 1 hora para que se enfríe un poco, luego retire con cuidado el anillo de tarta. Espolvorea todo con azúcar glas. Servir inmediatamente."]}, {"isVegetarian": true, "title": "Tarta de manzana con crema de miel y salsa de caramelo", "url": "www_bbc_co_uk_food_recipes_appletartwithhoneyed_84107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["botón de mantequilla", "ramita de romero fresco", "1 cucharada de azúcar en polvo", "1 manzana pelada, sin corazón y finamente cortada", "hojaldre hecho a mano, cortado en un círculo de 20cm / 8in", "cariño, llovizna", "30 g / 1 oz de azúcar en polvo", "30g / 1oz de mantequilla", "Crema doble 110ml / 4fl oz", "ramita de menta fresca"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Caliente la mantequilla, el azúcar y el romero en una cacerola hasta que el azúcar se derrita y tenga un color dorado. Agregue las rodajas de manzana, mezcle bien y cocine durante cinco minutos, o hasta que la manzana se ablande.", "Retire la mezcla de manzana del fuego y macere hasta obtener un puré.", "Cubra una bandeja para hornear con papel pergamino y coloque la masa de hojaldre. Extienda la masa con la mezcla de puré de manzana. Rocíe con miel y coloque en el horno para hornear durante 8-10 minutos, o hasta que se levante y dore.", "Para la salsa, derrita el azúcar y la mantequilla en una cacerola limpia. Una vez derretido, suba el fuego y agregue la crema. Llevar a ebullición y cocinar hasta que espese.", "Para servir, vierta la salsa sobre la tarta y adorne con una ramita de menta."]}, {"isVegetarian": true, "title": "Tarta de almendras y albaricoque con agua de rosas y cardamomo", "url": "www_bbc_co_uk_food_recipes_apricot_almond_cake_with_90181", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_almond_cake_with_90181_16x9.jpg", "ingredients": ["Albaricoques secos listos para comer 150 g / 5½ oz", "2 cápsulas de cardamomo, agrietadas", "200 g / 7 oz de almendras molidas", "50g / 1¾oz de polenta fina (no instantánea)", "1 cucharadita de levadura en polvo (sin gluten si es necesario)", "150 g / 5½ oz de azúcar en polvo", "6 huevos grandes de gallinas camperas", "2 cucharaditas de jugo de limón", "1 cucharadita de agua de rosas", "antiadherente para cocinar en aerosol o aceite de girasol para engrasar", "2 cucharaditas de pétalo de rosa o mermelada de albaricoque", "1 cucharadita de jugo de limón", "2½ cucharaditas de pistachos muy finamente picados"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pon los albaricoques secos en una cacerola pequeña, cúbrelos con 250 ml / 9 fl oz de agua fría y coloca las vainas de cardamomo con sus fragantes semillas. Poner el fuego, luego llevar a ebullición y dejar que burbujee durante 10 minutos. No te alejes demasiado de la sartén, ya que al cabo de los 10 minutos la sartén estará fuera del agua y querrás asegúrese de que no se seque porque los albaricoques absorberán más agua a medida que se enfríen. Saque la bandeja del fuego, colóquela en una superficie fría y resistente al calor y deje que los albaricoques se enfríen.", "Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase los lados de la lata de torta en forma de resorte y forre la parte inferior con pergamino para hornear.", "Retire 5 de los albaricoques secos y raspe cada uno por la mitad, luego déjelos a un lado. Deseche las cáscaras de cardamomo, dejando las semillas en la sartén.", "Verter y raspar los contenidos pegajosos de la sartén en el tazón de un procesador de alimentos. Agregue las almendras molidas, la polenta, el polvo de hornear, el azúcar impalpable y los huevos, y dé un buen toque largo para combinar.", "Abra la parte superior del procesador, raspe la mezcla, agregue 2 cucharaditas de jugo de limón y agua de rosas, y vuelva a bombardear. Raspe en la lata preparada y alise con una espátula. Coloque las mitades de albaricoque alrededor de la circunferencia del estaño.", "Hornee por 40 minutos, aunque si el pastel se está poniendo amarronado mucho antes de que esté realmente listo, es posible que desee cubrir holgadamente con papel de aluminio en la marca de 30 minutos. Cuando esté listo, la torta estará saliendo de los bordes de la lata, la parte superior se sentirá firme, y un probador de torta saldrá con solo una o dos migas húmedas sobre ella.", "Retire la torta a una rejilla de alambre. Si está usando mermelada de albaricoque para decorar, puede calentarlo un poco primero para que sea más fácil de extender; la mermelada de pétalos de rosa es tan delicadamente suave, que no debería necesitar ayuda. Mezcle una cucharadita de jugo de limón en la mermelada y cepille sobre la parte superior de la torta, luego espolvoree con los pistachos picados y deje que la torta se enfríe en la lata antes de retirarla a un plato."]}, {"isVegetarian": true, "title": "Flapjacks de albaricoque y chocolate", "url": "www_bbc_co_uk_food_recipes_apricot_and_chocolate_17370", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_and_chocolate_17370_16x9.jpg", "ingredients": ["200 g / 7 oz de mantequilla sin sal, más extra para engrasar", "300g / 10½ oz de jarabe dorado", "Avena avena rodada jumbo 450g / 1lb", "pizca de harina normal", "pizca de sal", "200g / 7oz de albaricoques secos y listos para comer, toscamente picados", "100g / 3½oz de chocolate blanco, roto en pedazos"], "serves": "Hace 9-12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase una lata cuadrada de pastel de 20 cm / 8 pulgadas con mantequilla, luego forre la base y los lados con papel para hornear.", "Lentamente lleve la mantequilla y el jarabe a ebullición en una cacerola, revolviendo. Retire del fuego y agregue la avena y la sal, luego los albaricoques secos, hasta que estén bien combinados.", "Raspe la mezcla en la lata preparada, luego presione en una capa uniforme con el dorso de una cuchara de madera. Hornee durante 45-50 minutos, o hasta que estén doradas. Déjelo a un lado para que se enfríe un poco en la lata, luego pase un cuchillo de hoja redonda por los bordes interiores de la lata y corte el panqueque en cuadrados. Déjelos a un lado para que se enfríen completamente en la lata.", "Mientras tanto, suspenda un recipiente de vidrio a prueba de calor sobre una olla de agua hirviendo a fuego lento, asegurándose de que la base del recipiente no toque el agua. Agregue el chocolate y revuelva hasta que se derrita.", "Convierta los flapjacks enfriados en una rejilla de alambre y rocíelos con el chocolate derretido. Dejar de lado por otros 25-30 minutos, o hasta que el chocolate se haya solidificado. ¡Disfrutar!"]}, {"isVegetarian": false, "title": "Corona de albaricoque", "url": "www_bbc_co_uk_food_recipes_apricot_couronne_12975", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_couronne_12975_16x9.jpg", "ingredients": ["250 g / 9 oz de harina de pan blanco, más extra para quitar el polvo", "5g de sal", "7 g / ⅓oz de levadura instantánea", "50 g / 1¾oz de mantequilla sin sal, ablandada, más extra para engrasar", "105ml / 3½ fl oz de leche", "1 huevo de gallinas camperas, ligeramente golpeado", "90 g / 3¼ oz de mantequilla sin sal, suavizada", "70g / 2½oz de azúcar mascabado ligero", "Albaricoques secos listos para comer 120g / 4½oz, picados y remojados en jugo de naranja", "35g / 1¼ oz de harina común", "60 g / 2¼ oz de pasas", "65g / 2¼oz de nueces picadas", "1 naranja, solo ralladura", "50g / 1¾oz de mermelada de albaricoque", "200g / 7oz de azúcar glasé", "Almendras en copos de 25g / 1oz"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Incline la harina en un tazón grande y agregue la sal a un lado del tazón y la levadura al otro. Agregue la mantequilla, la leche y el huevo y mezcle para combinar, usando sus manos. Continúa mezclando hasta que hayas recogido toda la harina de los lados del recipiente. Use la masa para limpiar el interior del tazón y continúe hasta que tenga una masa suave.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y comience a amasar. Sigue amasando durante 10-12 minutos. Trabaja en la etapa húmeda inicial hasta que la masa comience a formar una piel suave y lisa.", "Cuando la masa se sienta suave y sedosa, colócala en un bol ligeramente engrasado. Cubra el recipiente con un paño de cocina y deje que se levante durante una hora, o hasta que duplique su tamaño.", "Mientras la masa está subiendo, haga el relleno. Batir la mantequilla y el azúcar mascabado juntos hasta que quede suave. Escurrir los albaricoques y agregar a la mezcla de mantequilla junto con la harina, las pasas, las nueces y la ralladura de naranja. Mezcle para combinar.", "Cubra una bandeja para hornear con papel de hornear o pergamino de silicona.", "Convierta la masa en una superficie ligeramente enharinada. Con cuidado de no expulsar el aire, extienda la masa en un rectángulo de aproximadamente 33x25cm / 13x10 pulgadas. Gire la masa 90 grados si es necesario, para que tenga un borde largo más cercano a usted. Extienda la mezcla de albaricoque uniformemente sobre la masa. Enrolle la masa con fuerza (como un rollo suizo). Enróllalo ligeramente para sellar, luego córtalo por la mitad a lo largo (puedes dejar un extremo unido para ayudarte a girar la masa y formar la corona circular).", "Gira las dos longitudes de masa para formar una cuerda, luego une los extremos de la cuerda para formar una \\\"corona\\\" circular. Transfiera a la bandeja para hornear.", "Coloque la bandeja dentro de una bolsa de plástico limpia y déjela probar durante 30-45 minutos, o hasta que la masa salte rápidamente si la pincha ligeramente con el dedo. Mientras tanto, caliente el horno a 200C / 400F / Gas 6.", "Hornee el couronne durante 25-35 minutos o hasta que se levante y se dore. Dejar de lado para enfriar en una rejilla de alambre.", "Suavemente caliente la mermelada de albaricoque con un chorrito de agua, luego crítelo y cúbralo sobre el pan caliente para glasear. Mezcle el azúcar glas con suficiente agua para hacer un glaseado fino, rocíe sobre el pan y espolvoree con las almendras en copos. Deje enfriar antes de servir."]}, {"isVegetarian": true, "title": "Tarta de tatin de albaricoque", "url": "www_bbc_co_uk_food_recipes_apricot_tarte_tatin_49907", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apricot_tarte_tatin_49907_16x9.jpg", "ingredients": ["75g / 2¾oz de azúcar en polvo", "40 g / 1½ oz de mantequilla sin sal, en cubos", "300 g / 10½ oz de albaricoques frescos, cortados a la mitad y apedreado (alrededor de 7 u 8 albaricoques)", "Hoja de 375g / 13oz de hojaldre laminado, harina natural para espolvorear", "crème fraiche o helado, para servir"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para caramelizar los albaricoques, necesita una sartén pequeña a prueba de horno con una base que mida aproximadamente 20 cm de diámetro. Pon el azúcar en la sartén y ponlo a fuego medio. Cocine hasta que el azúcar se derrita por primera vez y luego se carameliza y se dore. No revuelva el azúcar, sino agítelo alrededor de la sartén de vez en cuando.", "Retire el caramelo del fuego y agregue la mantequilla con una cuchara de madera. El caramelo estará extremadamente caliente, así que ten cuidado con las salpicaduras y no sueñes con probarlo.", "Continúe removiendo durante 2-3 minutos mientras el caramelo se enfría y espesa. Se verá aceitoso y separado para empezar, pero se volverá suave y toffeo a medida que continúe revolviendo. Cuando el caramelo esté suave, coloque cuidadosamente los albaricoques en la parte superior, con el lado del corte hacia abajo. Deja enfriar por 20 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Desenrolle la lámina de hojaldre sobre una superficie ligeramente enharinada y use un rodillo para extenderla hasta que quede más ancha de 2 cm. Coloque un plato de cena o 25cm / 10 en latas de pastel en la masa y córtelo alrededor.", "Deslice suavemente la masa en la parte superior de los albaricoques y empuje hacia abajo los lados con un cuchillo de hoja redonda. Pincha la superficie para permitir que salga el vapor.", "Hornee la tarta tatin durante 25 minutos hasta que la masa esté dorada y los albaricoques estén cocidos. Retire la sartén del horno con un paño para sujetar el mango de la sartén, no lo olvide, hará mucho calor.", "Deje la tarta en reposo por unos minutos para que se asiente, luego afloje los bordes y coloque un plato grande para servir o una tabla en la parte superior de la sartén. Con mucho cuidado, pero rápidamente, voltéelo, usando una toalla de té doblada para ayudarlo a sostenerlo, y permita que la tarta tatin caiga suavemente sobre el plato de servir.", "Sirva caliente con crema fresca o helado."]}]