[{"ingredients": ["dash aceite de oliva", "3 lonjas de panceta, picadas", "Tomates cherry de 55g / 2oz, cortados a la mitad", "pizca de copos de chile seco", "sal y pimienta negra recién molida", "30 g / 1 oz de habas frescas, fuera de las vainas, membrana interna eliminada, blanqueada", "gran puñado de albahaca fresca picada", "Fideos 100 g / 3½ oz"], "method": ["Caliente una pizca de aceite de oliva en una cacerola, agregue la panceta picada y fría por 2-3 minutos, o hasta que esté crujiente. Agregue los tomates, las hojuelas de chile, la sal y la pimienta negra recién molida, reduzca el fuego y cocine a fuego lento durante 4-5 minutos. Agregue las habas y la albahaca.", "Cocine los tallarines en agua con sal hirviendo durante 8-10 minutos, o de acuerdo con las instrucciones del paquete, hasta que estén al dente. Escurrir, agregar a la salsa y revolver bien para cubrir.", "Pon el tallarín en un tazón y sirve."], "url": "www_bbc_co_uk_food_recipes_tagliatellewithtomat_89045", "title": "Tallarines con tomate, chile, panceta, habas y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, aplastado", "75ml / 2½fl oz de vino blanco", "125 g / 4½ oz de almejas, enjuagadas en agua limpia y fría", "50ml / 2fl oz de agua hirviendo", "Tagliatelle 100g / 4oz, cocinado", "2 cucharadas de perejil fresco picado"], "method": ["Coloque el ajo, el vino blanco, las almejas y el agua hirviendo en una cacerola mediana, cubra con una tapa y cocine por cinco minutos, o hasta que todas las almejas se hayan abierto. Drene y deseche cualquier que no se haya abierto.", "Mezcle las almejas con los tallarines cocidos, colóquelos en un bol y espolvoréelos con perejil para servirlos."], "url": "www_bbc_co_uk_food_recipes_tagliatellewithgarli_82151", "title": "Tagliatelle con almejas de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 diente de ajo, pelado, finamente cortado", "1 x 400 g / 14 oz pueden cortar tomates", "Almejas pequeñas de 300 g / 10½ oz, limpiadas (deseche las almejas que no se cierren herméticamente cuando se golpeen firmemente)", "Mejillones de 300 g / 10½ oz, limpios y sin barba (deseche los mejillones que no se cierren cuando se golpean firmemente)", "175ml / 6fl oz de vino blanco seco", "2 x 220 g / 8oz de filetes de lubina, sin piel, en rodajas finas", "250g / 9 oz de calamar (tentáculos incluidos), limpios y finamente cortados", "100g / 3½oz de camarones marrones", "1 cucharada de perejil de flatleaf fresco picado", "pizca de copos de chile seco", "sal y pimienta negra recién molida", "Recortadores frescos de 250 g / 9 oz"], "method": ["Calentar una sartén a fuego medio y agregar una cucharada de aceite de oliva. Agregue la mitad del ajo en rodajas y cocine por un minuto, sin dorar. Agregue los tomates picados, revuelva y cocine durante diez minutos o hasta que el volumen del líquido se haya reducido ligeramente. Dejar de lado.", "Calienta dos sartenes con tapa a fuego medio y agrega una cucharada de aceite de oliva a cada sartén. Divida el ajo en rodajas restante por igual entre las dos bandejas. Freír el ajo por un minuto, sin dorar. Agregue las almejas a una sartén y los mejillones a la otra, luego cubra ambas sartenes con una tapa. (Cocinar los mejillones y las almejas de antemano y colar el líquido evitará que la arena del marisco llegue al plato terminado).", "Cocine los mejillones y las almejas durante dos minutos, luego agregue la mitad del vino blanco a cada olla y cubra nuevamente con las tapas. Cocine durante cuatro minutos adicionales, o hasta que se hayan abierto todas las almejas y los mejillones (deseche los mariscos que permanecen cerrados).", "Cuele los mejillones y las almejas, descartando el líquido de las almejas cocidas pero reteniendo el líquido de los mejillones cocidos. Ponga a un lado los mejillones y las almejas, en sus conchas.", "Caliente el líquido reservado de los mejillones cocidos en una olla pequeña hasta que el volumen del líquido se haya reducido a la mitad.", "Una vez que los mejillones y las almejas estén lo suficientemente fríos como para manipularlos, retire la carne de las conchas y déjela a un lado.", "En una sartén grande, caliente la cucharada restante de aceite de oliva a fuego alto. Agregue las rodajas de lubina y calamar y cocine durante dos minutos (el calamar debe colorear ligeramente).", "Agregue los mejillones cocidos y las almejas, el jugo colado de los mejillones, los camarones marrones, el perejil picado y las hojuelas de chile, luego condimente, al gusto, con sal y pimienta negra recién molida. Reduzca el fuego y mezcle la salsa de tomate hasta que se caliente.", "Mientras tanto, trae una olla grande de agua con sal a ebullición. Agregue los taglierini y cocine por 2-3 minutos, o hasta que estén al dente.", "Escurra la pasta y agréguela a la salsa en la sartén. Mezcle bien para combinar y agregar más pimienta negra recién molida, al gusto. Divida equitativamente entre cuatro platos para servir."], "url": "www_bbc_co_uk_food_recipes_taglieriniwithseabas_92548", "title": "Tagliarini con lubina, calamares, mejillones, almejas, gambas marrones, tomate y perejil", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pasta tipo '00' de 250 g / 9 oz (disponible en la mayoría de las secciones de horneado de supermercados y algunas delicatessen), más extra para quitar el polvo", "sal y pimienta negra recién molida", "3 yemas de huevo de gallinas camperas", "3 huevos de gallinas camperas", "1 cucharada de aceite de oliva", "4 tomates de ciruela, cortados a la mitad longitudinalmente", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 chalotes, pelados, finamente picados", "1 diente de ajo, pelado, en rodajas finas", "100ml / 3½fl oz de vino blanco", "8 hojas de albahaca, más extra para servir", "Calamares de 300 g / 10½ oz, limpios (sin espinas y picos), tentáculos retirados y reservados, cuerpo cortado en anillos"], "method": ["Para la pasta de taglierini, coloque la harina '00', un poco de sal y pimienta negra recién molida, yemas de huevo, huevos y aceite en un procesador de alimentos y procese durante un minuto, o hasta que la mezcla se una para formar una masa homogénea. Incline la masa en un recipiente, cúbrala con una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Después de 30 minutos, retire la masa del refrigerador y colóquela en una superficie de trabajo enharinada. Divide la masa en dos partes iguales.", "Harina la máquina de pasta y, empezando por la configuración más baja (más gruesa), pase una pieza de la masa por la máquina, gire la manija con una mano y sostenga la masa con la otra a través de la máquina. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez. La pasta debe ser bastante delgada, pero aún así fácil de manejar sin romperse. No tengas la tentación de saltear las configuraciones o la masa puede romperse. Repita con la otra pieza de masa hasta que tenga dos hojas de pasta (cubra la primera hoja con una toalla de té limpia mientras trabaja en la segunda, para evitar que se seque).", "Una vez que las hojas de pasta han alcanzado el grosor ideal, recorte los bordes ligeramente. Coloque el accesorio cortador de taglierini en la máquina de pasta, enharinando bien. Alimente las hojas de masa a través de la máquina una vez más, cortándolas en hebras de taglierini de 3 mm de grosor. Espolvorea la pasta con harina, colócala en una bandeja, cúbrela y colócala en la nevera durante la noche.", "Precalentar el horno 150C / 300F / Gas 2.", "Para el calamar y la salsa de tomate asada al horno, coloque las mitades de tomate en una bandeja para hornear, corte los lados, y rocíe con la mitad del aceite de oliva y sazone con sal y pimienta negra recién molida. Asar en el horno durante 1 hora y media o hasta que los tomates estén suaves y ligeramente secos. (Puede preparar los tomates con unos días de anticipación, almacenándolos en aceite de oliva en un recipiente esterilizado. Guarde en el refrigerador hasta que lo necesite).", "Caliente una sartén grande y agregue 1 cucharada de aceite de oliva restante. Freír los chalotes y el ajo durante 2-3 minutos, o hasta que se ablanden. Suba el fuego y agregue el vino blanco, raspando cualquier trozo dorado del fondo de la sartén con una cuchara de madera para desglasar. Cocine a fuego lento durante 3-4 minutos, o hasta que el líquido haya reducido su volumen en un tercio. Agregue los tomates tostados a la sartén, junto con las hojas de albahaca.", "Calentar una sartén mediana y agregar el aceite de oliva restante. Agregue los anillos de calamar y los tentáculos y fríalos por 2-3 minutos, o hasta que estén recién cocidos.", "Para servir, ponga a hervir un sartén grande de agua con sal, agregue los taglierini y cocine por 2-3 minutos, o hasta que esté al dente. Escurra la pasta y agregue a la sartén con la salsa de tomate. Agregue el calamar cocido y mezcle bien. Acumula la pasta en platos para servir y decora con unas hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_taglieriniwithsquida_93785", "title": "Taglierini con salsa de tomate al horno y calamar", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "8 chalotes, toscamente picados", "50ml / 2fl oz de caldo de pollo", "2 ramitas de tomillo fresco", "50g / 2oz de queso azul", "5oz / 150g de patatas, peladas, hervidas y pasadas a través de un ricer de patata", "2 cucharaditas de crema doble", "aceite vegetal o de girasol, para freír", "Harina simple de 3oz / 200g", "2 yemas de huevo de gallinas camperas", "100ml / 3½ fl oz de leche", "Pan rallado de 120 g / 4 oz", "2 x 450 g / 16 oz de filetes de carne de res, en el hueso", "150g / 5oz de mantequilla", "300 ml / 10½ fl oz de carne de vacuno reducida", "100 ml / 3½ fl oz de vino tinto", "sal y pimienta negra recién molida", "Cohete 150g / 5oz", "aceite de oliva, para lloviznar"], "method": ["Para el puré de chalote, derrita 50 g / 2 oz de la mantequilla en una sartén hasta que haga espuma, luego agregue las chalotas y fríelas suavemente durante 2-3 minutos, o hasta que estén blandas pero no coloreadas. Vierta el caldo de pollo y cocine a fuego lento durante 1-2 minutos, luego transfiera a un procesador de alimentos. Retire las ramitas de tomillo y mezcle hasta que quede suave. Pase a través de un colador fino en un recipiente limpio y déjelo a un lado.", "Para los bombones de queso azul, desmenuce el queso azul en la papa lisa. Agregue el toque de crema y bata juntos hasta que quede suave. Divida la mezcla en 12 porciones iguales.", "Espolvorea cada bola en la harina, luego sumerge en la colada de huevo y rueda en las migas de pan. Repita el proceso dos veces.", "Caliente el girasol o el aceite vegetal en una freidora hasta que alcance 165C / 330F. Alternativamente, llene a medias una sartén profunda de base pesada con aceite y calor hasta la temperatura requerida, verificando con un termómetro digital. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír los bombones de queso azul, en tandas, durante 1-2 minutos, o hasta que se doren por todas partes. Tenga cuidado de no freír los bombones durante demasiado tiempo, ya que pueden reventar en el aceite caliente. Retire con una espumadera y escurra sobre papel de cocina. Mantener caliente", "Precaliente el horno a 250C / 500F / Gas 9.", "Para el filete de cola, coloque los filetes de la cola con el hueso hacia abajo en una lata para asar y tueste durante 10-15 minutos (por poco común), o hasta que estén cocidos a su gusto. Reserve para descansar en un lugar cálido durante 15 minutos.", "Coloque la lata de asar a fuego medio-alto y agregue la mantequilla. Cuando esté derretido, agregue el vino tinto y retire cualquier trozo dorado del fondo de la sartén con una cuchara de madera para desglasar. Cocine a fuego lento hasta que el líquido se haya reducido a un jarabe espeso.", "Agregue el caldo de carne y el tomillo y cocine a fuego lento hasta que el líquido haya reducido su volumen en dos tercios. Pasa la salsa por un colador fino.", "Para servir, tallar el filete del hueso y sazonar con sal y pimienta negra recién molida. Vierta el puré de chalote en platos para servir y coloque las rebanadas de carne encima. Coloque tres bombones de queso azul en cada plato. Vista el cohete con aceite de oliva, sazone con sal y pimienta negra recién molida y acomódelo junto con la carne."], "url": "www_bbc_co_uk_food_recipes_tail_fillet_of_beef_with_25038", "title": "Lomo de ternera con queso azul 'bombones'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["gran puñado de repollo negro o col rizada", "100ml / 3½fl oz de aceite de oliva", "2 limones, solo cáscara", "½ limón, solo jugo", "200g / 7oz de garbanzos cocidos", "500g / 1lb 2oz de pasta fresca de tallarines o similar", "sal", "pimienta negra recién molida", "100g / 3½oz de pecorino u otro queso duro, finamente rallado"], "method": ["Haga hervir una olla profunda de agua y hierva el cavolo nero por un minuto. Escurrir, y cuando esté lo suficientemente frío como para manejar, picar finamente.", "Caliente el aceite de oliva en una sartén ancha y fría el cavolo nero por unos minutos, a fuego moderadamente alto, revolviendo constantemente.", "Al mismo tiempo, hierva una olla con agua y déjela en la pasta para que se cocine por dos o tres minutos hasta que esté tierna.", "Escurra la pasta y revuelva en la col rizada con la ralladura de limón y el jugo, los garbanzos y la mitad del pecorino rallado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva la pasta en recipientes hondos con más queso esparcido."], "url": "www_bbc_co_uk_food_recipes_taglioliniwithlemono_70911", "title": "Tagliatelle con repollo negro, garbanzos y queso de oveja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/taglioliniwithlemono_70911_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 x 10cm / 4in cuadrados pasteles de filo prefabricados", "1 huevo de gallinas camperas, golpeado", "85g / 3oz de queso Taleggio, rebanado", "1 cucharada de cohete picado", "2 cucharadas de aceite de oliva", "3 cucharadas de piñones", "1 diente de ajo, pelado", "gran puñado de cohetes", "sal y pimienta negra recién molida", "1 huevo de gallina, escalfado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque un cuadrado de masa de filo en una bandeja para hornear antiadherente, arrugue ligeramente y cepille con huevo batido. Coloque otra pieza de hojaldre en la parte superior y vuelva a cepillar con huevo. Repita con la masa y el huevo restantes.", "Coloque la bandeja para hornear en el horno y hornee la masa durante 5-6 minutos, o hasta que esté dorada y crujiente.", "Espolvoree la parte superior de la masa con las rodajas de Taleggio y el cohete y reserve.", "Para el pesto de rúcula, coloque todos los ingredientes del pesto en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para servir, coloque la tarta en un plato para servir, rocíe con el pesto de rúcula y cubra con un huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_taleggioandrocketpes_85294", "title": "Tarta de pesto Taleggio y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan blanco", "Queso taleggio 85 g / 3 oz, en rodajas", "2 tomates de vid, sin semillas y picados", "1 diente de ajo, finamente picado", "2 cucharadas de perejil fresco picado", "1 puñado de hojas de albahaca fresca, desgarrada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el queso sobre pan tostado, tueste el pan en el horno durante 3-4 minutos, o hasta que esté ligeramente dorado. Coloque las rodajas de queso encima de la tostada y luego ase de 2 a 3 minutos o hasta que el queso se derrita y burbujee.", "Para la salsa de tomate y hierbas, combine todos los ingredientes de la salsa en un tazón y mezcle bien para combinar.", "Para servir, coloque el queso sobre una tostada en un plato para servir y póngalo sobre la salsa de tomate y hierbas."], "url": "www_bbc_co_uk_food_recipes_taleggiocheeseontoas_89125", "title": "Queso Taleggio en pan tostado con salsa de tomate y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 tomates de vid", "aceite de oliva, para lloviznar", "sal y pimienta negra recién molida", "3 rebanadas de chapata, tostadas", "Queso Taleggio 100 g / 3½ oz, en rodajas", "sal y pimienta negra recién molida", "6 hojas de albahaca fresca, para servir"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Precaliente la parrilla a medio.", "Para los tomates de vid tostados, coloque los tomates en una bandeja para hornear, rocíe con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Transfiera al horno y tueste durante 10-12 minutos, hasta que se ablanden.", "Para las tostadas del Taleggio, cubra las rebanadas de chapata tostada con el Taleggio y sazone con sal y pimienta negra recién molida.", "Coloque debajo de la parrilla durante 3-4 minutos, o hasta que el Taleggio se haya derretido.", "Para servir, coloque una rebanada de tostada Taleggio en tres platos y coloque dos tomates asados ​​encima de cada rebanada. Cubra con las hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_taleggiotoastswithro_85297", "title": "Tostadas de Taleggio con tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "2 cucharadas de aceite de oliva", "1 cucharadita de sal", "150ml / 5fl oz de agua", "1 cucharada de puré de tomate", "1 cucharada de ketchup de tomate", "2 cucharadas de aceite de oliva", "Queso Taleggio 100 g / 3½ oz, rallado", "50 g / 1¾oz de corazones de alcachofa cocidos", "50g / 1¾oz de tomates secados al sol", "1 cucharadita de cebollín, picado", "sal y pimienta negra recién molida, al gusto"], "method": ["Para hacer la masa de pizza, coloca la harina, el aceite de oliva y la sal en un tazón grande.", "Agregue el agua gradualmente, mientras se mezclan. Asegúrate de no agregar demasiada agua. Deténgase cuando la masa se haya unido.", "Transfiera a una superficie enharinada y amase durante un minuto.", "Coloque una sartén a fuego alto.", "Ruede la masa en una ronda delgada para caber en la sartén. Coloque en la bandeja para crepes y cocine en la bandeja para crepes por un minuto en cada lado.", "Para el relleno, extender el puré de tomate y ketchup sobre la base. Dispersión sobre el Taleggio, alcachofas y tomates.", "Rocíe con aceite de oliva, sazone con sal y pimienta negra recién molida, al gusto, y hornee durante cinco minutos.", "Servir espolvoreado con las cebolletas y cortado en cuartos."], "url": "www_bbc_co_uk_food_recipes_talegioartichokesund_78030", "title": "Taleggio, alcachofa y pizza de tomate secada al sol con ensalada italiana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de vino blanco", "Queso Taleggio 100 g / 3½ oz, rallado", "30 ml / 1 fl oz crema doble", "pellizcar nuez moscada molida", "3 corazones de alcachofas cocidos", "5 tomates tomados por el sol", "2 cucharadas de perejil picado", "5 rebanadas de chapata", "1 cucharada de aceite de oliva", "2 cucharadas de perifollo, picado", "2 cucharadas de perejil picado"], "method": ["Caliente el vino, el queso, la crema y la nuez moscada en una cacerola mediana.", "Lleve al punto de ebullición y agregue las alcachofas, los tomates y el perejil. Cocine a fuego lento durante dos minutos y reserve.", "Para hacer la chapata, caliente una sartén a fuego alto hasta que fume.", "Rocíe las rodajas de ciabatta con aceite de oliva y sazone bien. Coloque en la sartén y en la parrilla por un minuto a cada lado.", "Para servir, vierte la fondue en un tazón y sirve las rodajas de ciabatta a un lado."], "url": "www_bbc_co_uk_food_recipes_talegiofonduewithcia_78032", "title": "Taleggio fondue con ciabatta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1-2 partes posteriores de la parte posterior de la carne de cerdo, alrededor de 1.5-2kg", "Pasta de tamarindo 110g / 4oz", "Melaza de granada 110 g / 4 oz", "6 dientes de ajo, pelados y triturados", "60g / 2¼ oz de raíz de jengibre, pelado y rallado", "½ cucharada de comino molido", "4 cebollas rojas de tamaño mediano, peladas", "un buen botón de mantequilla", "75g / 3oz de carne de cerdo picada y grasosa", "sal y pimienta negra recién molida", "2 cucharaditas de comino molido", "30g / 1¼ oz de pan blanco fresco", "2 cucharadas de perejil picado", "aceite vegetal o de maíz, para cepillar"], "method": ["Unte las costillas con los ingredientes del adobo mezclados en un tazón. Cubra el tazón con film transparente y déjelo marinar en la nevera durante al menos 24 horas (cuanto más, mejor).", "Precalienta el horno a 190 ° C / 375 ° F / Gas 5. Transfiere las costillas marinadas a una fuente para hornear o asar y cocina durante 30 minutos, hilvanando mientras se cocinan.", "Baje el horno a 160 ° C / 325 ° F / Gas 3, cubra la bandeja con papel de aluminio y continúe cocinando y rociando durante otra hora, luego retire la lámina y cocínelo, hilvanando regularmente, durante otros 30-45 minutos.", "Retire las costillas del horno, cubra y mantenga caliente hasta que esté listo para servir.", "Para las cebollas rellenas, precaliente el horno a 200C / 400F / Gas 6.", "Envuelva las cebollas en papel de aluminio, colóquelas en una bandeja para hornear y hornee durante aproximadamente 45-50 minutos, o hasta que estén bastante suaves. Retire del horno, quite la lámina y déjela enfriar un poco.", "Mientras tanto, prepara el relleno. Derretir la mantequilla en una sartén. Sazonar el cerdo con sal, pimienta y comino molido, agregar a la sartén y freír a fuego medio durante unos minutos, revolviendo, hasta que esté ligeramente coloreado. Agregue 125 ml / 4½ fl oz de agua y cocine a fuego lento durante unos 10 minutos o hasta que el agua se haya evaporado. Transfiera a un recipiente y deje enfriar.", "Una vez que las cebollas estén lo suficientemente frías como para manipularlas, corte alrededor de 1 cm / ½ pulgada de la parte superior de cada una, luego retire con cuidado las pieles, manteniendo las cebollas intactas. Saque el centro de cada cebolla con una cuchara, dejando un par de capas de carne para mantenerlas juntas. Reserve tanto las tapas de cebolla como la carne cortada.", "Picar finamente la carne de cebolla picada y mezclarla con la carne de cerdo, el pan rallado y el perejil. Sazone al gusto. Vierta el relleno en las cebollas y reemplace las partes superiores. Coloque en una bandeja para hornear, cepille con aceite y hornee durante aproximadamente 15-20 minutos, hasta que las cebollas estén ligeramente coloreadas y el relleno esté caliente."], "url": "www_bbc_co_uk_food_recipes_tamarind-baked_back_ribs_91368", "title": "Tamarindo al horno costillas con cebollas rellenas al horno", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 caballa, limpiada y fileteada", "3 cucharadas de pasta de tamarindo", "1 cucharada de jengibre, rallado", "2 dientes de ajo, aplastados", "½ cucharadita de sal", "½ cucharadita de cilantro molido", "1 cucharada de miel clara", "Fideos de huevo de 450g / 1lb", "2 cucharadas de aceite de oliva", "1 tallo de limoncillo, finamente cortado", "2 dientes de ajo, aplastados", "Jengibre de 5cm / 2in, pelado y finamente cortado", "2 chiles verdes largos, finamente cortados en cubitos", "4 cebolletas, en rodajas", "½ hoja china, finamente triturada", "2 cucharadas de salsa de ostras", "2 cucharadas de salsa de soja", "3 cucharadas de aceite de sésamo", "2 limas, solo jugo", "3 cucharadas de cilantro fresco, toscamente picado"], "method": ["Para la caballa, coloque los filetes de caballa en una bandeja para parrilla o en una bandeja plana. Mezcle el resto de los ingredientes y cepille sobre ambos lados de los filetes. Déjelo a adobo durante 30 minutos.", "Para cocinar la caballa, caliente la parrilla a su nivel más alto. Ase los filetes durante dos minutos en cada lado, rociándolos con el adobo mientras los gira.", "Para los fideos de hierba de limón, cocine los fideos de huevo en una olla grande de agua hirviendo de acuerdo con las instrucciones del paquete, luego drene, renueve en agua helada y drene de nuevo completamente. Mezcle los fideos con la mitad del aceite de oliva y reserve.", "Caliente una sartén hasta que esté medianamente caliente, agregue el aceite de oliva restante, el limoncillo, el ajo, el jengibre, el chile y las cebolletas y cocine suavemente durante 1-2 minutos, o hasta que las verduras se hayan suavizado. Mezcle los fideos en las verduras y agregue la hoja china.", "Batir las salsas de ostras y de soja con el aceite de sésamo y el jugo de lima, luego mezclar con los fideos y sazonar al gusto con sal.", "Para servir, amontone los fideos en cada plato, cubra con la caballa a la parrilla y sirva adornado con cilantro picado."], "url": "www_bbc_co_uk_food_recipes_tamarind-glazed_mackerel_79383", "title": "Caballa glaseada con tamarindo con fideos de hierba de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de pasta de tamarindo", "4 cucharadas de salsa de soja", "4 cucharadas de agua caliente, de una caldera recién hervida", "2 cucharadas de aceite de girasol", "1 cucharada de miel líquida", "Bistec Bavette de 750 g / 1 lb 10 oz (pieza completa)"], "method": ["Coloque la pasta de tamarindo, la soya y el agua caliente en la cacerola más pequeña que tenga, y revuelva a fuego lento para disolver el tamarindo. Cuando es tan suave como crees que puedes conseguirlo, la pasta de tamarindo que uso dice que no tiene piedras, pero la encuentro rara, y no me molesto en deshacerme de ellas, la remuevo a un tazón o jarra, bate en el aceite y la miel, y dejar enfriar. No lo uses hasta que esté frío.", "Coloque el filete bavette en una bolsa de congelador que se pueda volver a sellar, vierta el adobo frío y páselo de manera que el filete delgado quede cubierto por ambos lados, luego selle, coloque en un plato y colóquelo en el refrigerador durante la noche o por 1 día.", "Regréselo a la temperatura ambiente, prepare un trozo grande de papel de cocina y caliente una plancha con rejilla hasta que esté muy, muy caliente. Levante el filete de su adobo, dejando que el exceso (y haya un montón) gotee de regreso a la bolsa y luego golpee la carne en la plancha y cocine durante 2 minutos por cada lado.", "Inmediatamente (uso pinzas para todo esto) transfiera el bistec al pedazo de papel de aluminio y haga un paquete herméticamente cerrado pero holgado, y deje reposar la carne, sobre una tabla de cortar, o sobre cualquier superficie que no esté demasiado fría, durante 5 minutos. A continuación, desenvuelva la lámina, transfiera la carne a un tablero y talle en lonchas finas contra el grano."], "url": "www_bbc_co_uk_food_recipes_tamarind-marinated_90215", "title": "Filete de bavette marinado con tamarindo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tamarind-marinated_90215_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Sake 100ml / 3½fl oz", "100ml / 3½fl oz", "600g / 1lb 6oz miso blanco", "300 g / 11 oz de azúcar en polvo", "125g / 4½oz de pasta de tamarindo", "75ml / 3fl oz den miso (ver receta arriba)", "2 dientes de ajo, en rodajas finas", "1 cucharadita de tomillo fresco picado", "Filetes de onglet 6 x 150-175g / 5-6oz, recortados", "50ml / 2fl oz de aceite de oliva", "1 cucharada de aceite vegetal, más extra para engrasar y freír", "1 cucharadita de semillas de comino", "15 hojas frescas de curry", "1 cucharadita de cúrcuma molida", "1 cucharada de jengibre picado fino", "½ chile verde, finamente picado", "½ manojo de cilantro fresco, finamente picado", "Harina de gramo 200g / 7oz (harina de garbanzo o besan)", "600ml / 1pint 2fl oz de agua", "½ cucharadita de sal", "¼ cucharadita de pimienta negra recién molida", "1 cucharadita de semillas de nigella", "2-3 cucharadas de polenta", "1 cucharada de melaza de granada", "2 cucharadas de vinagre de sidra", "5 cucharadas de aceite de oliva virgen extra", "2 manojos de berro"], "method": ["Para el den miso, coloque todos los ingredientes en una cacerola y bata a fuego medio hasta que el azúcar y el miso se hayan disuelto. Retire la sartén del fuego y déjela enfriar. Almacene en un recipiente hermético en la nevera.", "Para el bistec, mezcle la pasta de tamarindo, den miso, ajo y tomillo en un bol hasta que estén bien combinados. Agregue los filetes, asegúrese de que estén bien cubiertos en el adobo y déjelos a un lado para marinar durante al menos tres horas, preferiblemente durante la noche.", "Mientras tanto, para los chips besan, caliente el aceite en una cacerola de base pesada. Agregue las especias, el jengibre, el chile y el cilantro y cocine durante unos minutos hasta que estén aromáticos.", "Tamiza el besan en un tazón, luego bate en el agua hasta que quede suave.", "Vierta la pasta en la cacerola, agregue la sal y pimienta y revuelva a fuego moderado con una cuchara de madera o una espátula durante 10-12 minutos, o hasta que la mezcla se espese y se separe de los lados de la sartén (el proceso es similar a haciendo polenta firme, pero el besan tarda un poco más en espesarse).", "Engrase una bandeja pequeña del horno y espolvoree con las semillas de nigella y un poco de polenta. Verter sobre la mezcla de besan, cubrir con un trozo de grasa y aplanar rápidamente la mezcla. Enfríe en el refrigerador hasta que la mezcla se haya endurecido.", "Caliente una plancha o una sartén pesada a fuego alto hasta que esté caliente pero no humeante (si la sartén está demasiado caliente, la parte exterior de la carne se quemará antes de que se haya cocinado lo suficiente).", "Cepille los filetes con el aceite y sazone con sal y pimienta negra recién molida. Cocine por 2-4 minutos en cada lado, o hasta que esté cocido a su gusto.", "Transfiera los filetes de la sartén a un estante, cúbralos con papel de aluminio y déjelos reposar en un lugar cálido durante hasta 10 minutos (esto ayuda a que la carne se \"relaje\" y maximiza el sabor y la sensibilidad).", "Precaliente una freidora de grasa a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cuidadosamente voltea el besan endurecido en una tabla de cortar y corta en chips. Polvo de las patatas fritas con polenta.", "Fríe las patatas fritas por 2-3 minutos o hasta que estén doradas. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Para la ensalada de berros, mezcle la melaza de granada, el vinagre y el aceite de oliva en un tazón hasta que estén bien combinados, luego sazone con sal y pimienta negra recién molida. Cubra los berros con el aderezo.", "Para servir, coloca el bistec en platos para servir con las patatas fritas y el berro al costado."], "url": "www_bbc_co_uk_food_recipes_tamarind_and_miso_onglet_10358", "title": "Tamarindo y miso filete de onglet con chips besan", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de cordero, cortados", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "2 chiles rojos, finamente triturados", "2 dientes de ajo, toscamente picados", "5 cm / 2 en pieza de jengibre, más o menos picada", "6 cebollas de primavera, en rodajas", "1 puerro, en rodajas", "Col de primavera 150 g / 5½ oz, finamente triturada", "4 cucharadas de pasta de tamarindo", "200ml / 7fl oz de leche de coco", "2 cucharadas de salsa de pescado", "3 cucharadas de hojas de menta picadas", "3 cucharadas de hojas de cilantro picado", "Hojas de mizuna 75g / 3oz", "1 lima, solo jugo", "hojas de plátano, para servir"], "method": ["Sazone los filetes de cordero con sal y pimienta negra.", "Calentar una sartén hasta que esté caliente, agregar una cucharada de aceite y freír el cordero por todos lados hasta que se dore. Retire de la sartén y reserve.", "Caliente un wok hasta que esté caliente, agregue el aceite restante, luego agregue los chiles, el ajo, el jengibre y las cebollas tiernas y saltee por un minuto.", "Agregue el puerro y el repollo de primavera y sofría por otros dos minutos, luego agregue la salsa de pescado, la pasta de tamarindo y la leche de coco y cocine a fuego lento.", "Cortar el cordero en rodajas gruesas, agregar a las verduras y mezclar.", "Cocine por un minuto más, luego retire del fuego y agregue las hojas de menta, cilantro y mizuna y revuelva para combinar. Agregue el jugo de lima y revise el condimento.", "Para servir, coloque una hoja de plátano en cada uno de los cuatro platos de sopa y luego póngalos en la parte superior."], "url": "www_bbc_co_uk_food_recipes_tamarind_and_coconut_82562", "title": "Tamarindo y cordero de coco y vegetales salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "500 g / 1 libra de carne magra de 2 oz, cortada en tiras", "2 tallos de limoncillo, picados", "6 chalotes, picados", "2 chiles verdes, picados", "3 cucharadas de pasta de tamarindo", "2 cucharadas de jugo de lima", "2 cucharaditas de salsa de pescado tailandesa", "2 cucharaditas de azúcar moreno", "200g / 7oz de papaya verde rallada"], "method": ["Caliente el aceite en un wok o sartén, mezcle la carne y cocine a fuego alto durante 2-3 minutos.", "Agregue el lemongrass, los chalotes y los chiles y saltee durante 5 minutos, o hasta que la carne esté bien dorada.", "Agregue la pasta de tamarindo, el jugo de lima, la salsa de pescado, el azúcar y la papaya y saltee durante 4 minutos.", "Divida entre cuatro tazones y sirva."], "url": "www_bbc_co_uk_food_recipes_tamarind_and_lemongrass_62200", "title": "Tamarindo y hierba de limoncillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tamarind_and_lemongrass_62200_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de pasta de tamarindo", "75 g / 2½ oz de miel clara", "2 dientes de ajo, aplastados", "2 cucharadas de azúcar moreno claro", "3-4 cucharadas de aceite de chile o aceite de oliva si lo prefiere", "copos de sal marina", "800g / 1lb 12 oz de gambas de tigre crudo (el más grande que puedas encontrar), idealmente peladas pero con las colas dejados en", "aceite vegetal, para freír", "2 semillas de sésamo tostadas tsp apiladas", "10g de cilantro fresco, hojas recogidas y toscamente picadas", "3 cebollas de primavera, cortadas y cortadas en rodajas finas desde la raíz hasta la punta"], "method": ["Para preparar el adobo, mezcle bien los ingredientes en un bol hasta que el azúcar se disuelva.", "Agregue las gambas y trabaje en el marinado con sus manos. Cubra el recipiente con una película adhesiva y deje macerar a temperatura ambiente durante 30 minutos.", "Calentar una sartén grande a fuego medio-alto y rociar con un poco de aceite vegetal. Escurra el exceso de adobo de las gambas y luego fríalos rápidamente por ambos lados hasta que estén cocidos y ligeramente carbonizados. (Los tiempos de cocción variarán dependiendo del tamaño de las gambas - si usa gambas estándar de supermercado no necesitará cocinarlas por más de 1 minuto más o menos en cada lado, pero si está usando gambas más grandes, puede necesitar reducir el calentar ligeramente y dejar que se cocinen durante un poco más de tiempo). El adobo es pegajoso y dulce, lo que significa que ennegrecerá, así que no entre en pánico si las gambas se ven un poco chamuscadas.", "Servir espolvoreado con semillas de sésamo tostadas, cilantro y cebolletas en rodajas."], "url": "www_bbc_co_uk_food_recipes_tamarind_prawns_40510", "title": "Gambas de Tamarindo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de trigo bulgur", "1 diente de ajo, finamente picado", "2 cebollas de primavera, en rodajas finas", "Jengibre fresco de la raíz 4cm / 1.5in, pelado y rallado fino", "Setas shiitake de 150 g / 5½ oz, reducidas a la mitad si son grandes", "180g / 6½oz de gambas crudas", "1 cucharada de pasta de tamarindo", "1 cucharada de miel líquida", "3 pak choi, en rodajas finas", "10g de cilantro fresco, toscamente picado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Mezcle el trigo bulgur, el ajo, las cebolletas y dos tercios del jengibre con 200 ml / 7 fl oz de agua en una lata de asar. Cubra con los champiñones. Cubra bien con papel de cocina y hornee durante 15 minutos.", "En un tazón, mezcle las gambas con el jengibre restante, luego cubra y refrigere.", "En un recipiente aparte, mezcle el tamarindo con la miel y reserve.", "Agregue el pak choi y las gambas a la lata de asar y hornee por 7-8 minutos, o hasta que el pak choi se haya marchitado y las gambas estén bien cocidas.", "Coloque la bandeja en dos platos, vierta sobre el aderezo de tamarindo, espolvoréese con el cilantro y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tamarind_prawns_with_36430", "title": "Gambas de tamarindo con champiñones, pak choi y trigo bulgur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tamarind_prawns_with_36430_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ sandía, pelada y rebanada", "½ melón cantalupo, pelado y en rodajas", "150 g / 5½ oz de frijoles edamame, envasadas", "Guisantes a punto de azúcar de 75 g / 2½ oz, en rodajas finas", "Mangetout de 75 g / 2½ oz, en rodajas finas", "filete de atún (que pesa aproximadamente 500 g / 1 libra 2 onzas), cortado en 4 piezas", "2 cucharadas de pasta de tamarindo", "1 cucharada de aceite de colza", "1 chile rojo, finamente picado", "2 dientes de ajo, aplastados", "Jengibre de raíz de 2cm / ¾in en la pieza, pelado y más o menos picado", "2 cucharadas de azúcar de palma (también conocido como azúcar moreno)", "6 cucharadas de salsa de soja", "4 cucharadas de salsa de pescado", "2 cucharadas de hojas de menta fresca finamente picadas", "2 cucharadas de hojas de cilantro fresco finamente picado", "2 limas, solo jugo", "½ granada, semillas retiradas"], "method": ["Para la ensalada, coloque los melones en rodajas en una bolsa de vacío y selle en una máquina de vacío. Deje en la nevera durante la noche.", "Para el filete de atún, cepille el atún con pasta de tamarindo y déjelo marinar durante al menos 1 hora.", "Mientras tanto, para la ensalada, caliente una sartén grande y agregue el melón refrigerado, cocine a cada lado durante 1-2 minutos. Corte en trozos de 2-3cm / ¾-1¼in y coloque en un tazón grande con los frijoles, guisantes de azúcar y mangetout. Dejar de lado.", "Calentar una sartén grande de la plancha y cepillar ligeramente el atún con el aceite. Cocine en la plancha durante 6-8 minutos, dependiendo del tamaño de los filetes y cómo le gusta su atún cocinado. Déjalo reposar, luego corta en rodajas finas.", "Para el aderezo, coloque todos los ingredientes en un mortero y mezcle hasta que quede suave.", "Para servir, mezcle la ensalada en el aderezo. Coloque la ensalada en los platos para servir con el atún al lado. Adorne con semillas de granada."], "url": "www_bbc_co_uk_food_recipes_tamarind_seared_tuna_97406", "title": "Filete de atún sellado con tamarindo con ensalada de melón y aderezo zingy", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]