[{"isVegetarian": false, "title": "Rape ensacado en la bolsa con cuscús de limón en conserva", "url": "www_bbc_co_uk_food_recipes_bakeinthebagmonkfish_86603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Cuscús 250 g / 9 oz", "2 cucharaditas de comino molido", "1 cucharadita de semillas de comino", "6 cebollas de primavera, en rodajas finas", "2 limones preservados, lavados, rebanados, con pulpa interna eliminada, picado imperceptiblemente", "2 cucharaditas de cilantro fresco picado", "18 tomates cherry, descuartizados", "Filete de rape de 1.2kg / 2lb 9oz", "6 cucharadas de aceite de oliva virgen extra", "1 cucharadita de hilos de azafrán", "2 pequeñas bombillas de hinojo, cortadas a la mitad, sin núcleo, cortadas en rodajas de 5 mm", "sal y pimienta negra recién molida", "1 pepino, pelado, sin semillas y en rodajas", "15 rábanos, en rodajas finas", "200g / 7oz de yogur griego", "1 limón, solo jugo", "½ cucharadita de zumaque (disponible en algunos supermercados y tiendas de Oriente Medio)", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los paquetes de rape, mezcle todos los ingredientes del paquete de rape, excepto el rape, el aceite de oliva, el azafrán y el hinojo, en un bol.", "Coloque el filete de rape sobre una tabla de cortar y corte en rodajas en ángulo de 1 cm / ½ pulgadas (la idea es tener alrededor de 2-3 bonitos medallones de monje por porción.", "Coloque una olla pequeña con 180ml / 6fl de agua en la estufa para hervir. Una vez que hierva, agregue el azafrán e inmediatamente retírelo del fuego.", "Corta seis hojas grandes de papel de cocina y colócalas en una superficie de trabajo plana. Doble cada hoja por la mitad para crear un pliegue, luego ábralo nuevamente.", "Vierta dos cucharadas de aceite de oliva en la mezcla de cuscús y revuelva bien para que todos los granos estén bien cubiertos en aceite.", "Agregue el agua de azafrán y mezcle nuevamente para combinar.", "Extienda un poco del aceite de oliva en el centro de la mitad delantera de cada una de las láminas de aluminio abiertas. Divida el hinojo por igual entre las seis hojas, acomodando el aceite.", "Divida la mezcla de cuscús por momentos, colocando encima de cada una de las pilas de hinojo.", "Cubra cada porción de la mezcla de cuscús con 2-3 rodajas de rape.", "Rocíe cantidades iguales del resto de la virgen extra sobre cada porción de rape y condimente cada una con sal y pimienta negra recién molida.", "Lleve el borde superior de la hoja de cada paquete sobre el rape y la pila de cuscús para que coincidan con el borde inferior. Selle el borde doblándolo firmemente tres veces y asegúrelo presionando firmemente con los dedos. Gire cada paquete 180 grados y haga lo mismo con el lado abierto opuesto.", "Cada paquete debe estar bien sellado en tres lados, con solo la parte superior abierta. Coloque con cuidado cada paquete en un ángulo de 45 grados, a fin de no alterar los arreglos en el interior.", "Con cuidado, agregue tres cucharadas de agua en cada bolsa, luego selle el borde superior de cada paquete con el mismo proceso de plegado que antes.", "Coloque los paquetes en dos bandejas para hornear y transfiéralos al horno para hornear por 15-20 minutos. De las parcelas están en el horno a diferentes alturas, cambiar a los estantes a mitad de camino.", "Las parcelas deberían haberse inflado como almohadas. Saque las parcelas del horno y coloque directamente sobre los platos calentados.", "Para la ensalada, combine todos los ingredientes de la ensalada en un tazón limpio grande y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, presente las parcelas en sus platos y córtelas en la mesa. Sirva la ensalada en su tazón y permita que las personas se ayuden a sí mismas."]}, {"isVegetarian": true, "title": "Tarta casera de Bakewell", "url": "www_bbc_co_uk_food_recipes_bakewell_tart_58187", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tart_58187_16x9.jpg", "ingredients": ["Harina normal de 200g / 7oz", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos", "pizca de sal", "2 cucharaditas de azúcar en polvo", "3-4 cucharadas de agua fría", "Frambuesas 250 g / 9 oz", "Azúcar mermelada de 200 g / 7 oz con pectina añadida", "½ limón, solo jugo", "4 huevos de gallinas camperas, más 2 yemas", "115 g / 4 oz de azúcar en polvo", "150 g / 5½ oz de mantequilla, derretida y enfriada", "150 g / 5½ oz de almendras molidas", "1 cucharadita de extracto de almendra", "3 cucharadas de almendras en copos", "azúcar en polvo, para quitar el polvo"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5. Para hacer la masa, tamice la harina y la sal en un tazón. Frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue el azúcar.", "Agregue el agua fría, poco a poco y, utilizando un cuchillo de mesa, comience a juntar la masa. Si la mezcla está demasiado seca como para mantenerse unida, agregue suficiente agua fría para unirla. No trabaje demasiado ni haga la masa demasiado pegajosa o se pondrá dura. Forme un disco, cubra con una película adhesiva y enfríe en la nevera durante al menos 10 minutos.", "Para hacer la mermelada de frambuesa, coloque las frambuesas en una olla y caliéntelas suavemente hasta que empiecen a ablandarse. Agregue el azúcar y el jugo de limón y caliente suavemente, revolviendo, hasta que el azúcar se haya disuelto. Llevar a ebullición y cocinar durante 8-10 minutos, revolviendo de vez en cuando. Retirar del fuego y dejar enfriar ligeramente.", "Mientras aún está caliente, cuele cuidadosamente la mermelada a través de un colador en un recipiente grande. Coloque el recipiente encima de un recipiente con agua helada, revolviendo ocasionalmente, hasta que esté completamente frío.", "Desenvuelve la masa y despliega sobre una superficie de trabajo ligeramente enharinada en un círculo grande de aproximadamente 3 mm de grosor. Transfiera la masa en el rodillo a una lata agria de fondo suelto de 23 cm / 9 pulgadas, presionándola en las esquinas y dejando que el exceso de bollos cuelgue sobre el borde. Enfriar en la nevera durante 10 minutos.", "Coloque la lata tarta forrada en una bandeja para hornear. Pinche la base con un tenedor varias veces, luego forre la caja de pastelería con papel para hornear y granos de cerámica para hornear o frijoles secos. Hornea por 20 minutos. Retire los frijoles y el papel y continúe horneando la caja por otros 5-8 minutos, hasta que adquiera un color dorado pálido. Deja enfriar. Corta el exceso de masa con un cuchillo afilado. Reduzca la temperatura del horno a 180C / 160C ventilador / Gas 4.", "Para hacer el frangipane, bata los huevos, las yemas y el azúcar juntos, luego mezcle la mantequilla derretida, las almendras molidas y el extracto de almendras.", "Unte 8 cucharadas de la mermelada de frambuesa en la base de la caja de pastelería, cubra con el frangipane para crear una capa uniforme que cubra el atasco.", "Hornee durante 35 minutos, o hasta que el relleno esté dorado y un pincho insertado en el centro salga limpio. Deja enfriar.", "Coloque las almendras en copos en una bandeja para hornear en una sola capa y hornee por 2-3 minutos, o hasta que estén doradas y aromáticas. Inclínalas en papel de cocina para que se enfríen. Adorne la tarta con un poco de azúcar glas y las almendras tostadas."]}, {"isVegetarian": true, "title": "La tarta fácil de Bakewell de Mary", "url": "www_bbc_co_uk_food_recipes_bakewell_tart_90600", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tart_90600_16x9.jpg", "ingredients": ["Harina normal 175g / 6oz", "75g / 2½oz de mantequilla fría", "2-3 cucharadas de agua fría", "1 cucharada de mermelada de frambuesa", "125 g / 4½ oz de mantequilla", "125 g / 4½ oz de azúcar en polvo", "125g / 4½ oz de almendras molidas", "1 huevo de gallinas camperas, golpeado", "½ cucharadita de extracto de almendra", "50g / 1¾oz de almendras en copos", "80g / 2¾oz de azúcar glas", "2½ cucharaditas de agua fría"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la masa, mida la harina en un tazón y frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue el agua, mezcle para formar una masa suave.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada y usar para forrar una lata de flan de 20 cm / 8 pulg. Deja en la nevera para enfriar durante 30 minutos.", "Precaliente el horno a 200C / 400F / Gas 6 (ventilador de 180C).", "Alinee la caja de repostería con papel de aluminio y llénela con alubias para hornear. Hornee a ciegas por unos 15 minutos, luego quite los frijoles y la hoja y cocine durante otros cinco minutos para secar la base.", "Para la presentación, extienda la base del flan generosamente con mermelada de frambuesa.", "Derrita la mantequilla en una sartén, quite el fuego y luego agregue el azúcar. Agregue almendras molidas, huevo y extracto de almendra. Vierta en la lata de flan y espolvoree sobre las almendras en copos.", "Hornea por unos 35 minutos. Si las almendras parecen dorarse demasiado rápido, cubra la tarta con papel de aluminio para evitar que se quemen.", "Mientras tanto, tamiza el azúcar glas en un tazón. Agregue el agua fría y transfiera a una manga pastelera.", "Una vez que hayas sacado la tarta del horno, coloca el glaseado sobre la parte superior, dando un efecto informal de zigzag."]}, {"isVegetarian": true, "title": "Tarta de Navidad Bakewell con frangipane de arándano", "url": "www_bbc_co_uk_food_recipes_bakewell_tart_with_20773", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tart_with_20773_16x9.jpg", "ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "gran pizca de sal", "150g / 5½oz de mantequilla fría, en cubos", "100 g / 3½ oz de mantequilla", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de almendras molidas", "Harina normal de 25g / 1oz", "2 huevos de gallinas camperas, golpeados", "6 cucharadas de compota de arándanos (o salsa de arándanos de buena calidad sin vinagre)", "40g / 1½oz de almendras en copos", "Azúcar glas de 80g / 3oz"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la masa, mezcle la harina y la sal en un tazón. Frote la mantequilla hasta que la mezcla se asemeje a migas de pan finas. Agregue 1-2 cucharadas de agua fría, o lo suficiente para unir la masa en una masa blanda y maleable. Envuelva la película adhesiva y refrigere durante 30 minutos.", "Estirar la masa sobre una superficie ligeramente enharinada hasta que sea lo suficientemente grande como para forrar una lata de tarta de 23cm / 9in. Debería tener algunos milímetros de grosor. Con cuidado, transfiera la masa a la lata y presione, utilizando una pieza de repuesto, en cada esquina de la lata. No recortar Cubra la masa con papel de hornear, luego llénela con alubias (o arroz sin cocer). Hornea por 12 minutos. Retire los frijoles y el papel y hornee por otros 5 minutos.", "Mientras tanto, para el relleno de frangipane, derrita suavemente la mantequilla y el azúcar en una cacerola. Batir las almendras molidas, la harina y los huevos.", "Extender la caja de pastelería con la compota de arándano. Cubra con la mezcla de frangipane. Espolvorea sobre las almendras copos. Hornee durante 25-35 minutos, o hasta que estén doradas. Dejar enfriar durante al menos 10 minutos.", "Para la formación de hielo, mezcle el azúcar glas con suficiente agua tibia para crear una pasta lo suficientemente gruesa como para cubrir la parte posterior de una cuchara. Rocíe la guinda sobre la tarta y sirva."]}, {"isVegetarian": true, "title": "Bakewell traybake", "url": "www_bbc_co_uk_food_recipes_bakewell_tarts_64777", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewell_tarts_64777_16x9.jpg", "ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "125g / 4oz de mantequilla fría sin sal, cortada en cubos", "30g / 1 oz de azúcar", "2 huevos de gallinas camperas", "2 cucharadas de leche (opcional)", "225 g / 8oz de mantequilla sin sal, ablandada", "225 g / 8 oz de azúcar en polvo", "225gr / 8 oz de almendras molidas", "3 huevos de gallinas camperas", "1 limón, ralladura finamente rallada solamente", "Harina normal de 50g / 2oz", "1 jarra de mermelada de frambuesa", "almendras en copos, para rociar"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa, coloque la harina, la mantequilla y el azúcar en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue uno de los huevos y pulse hasta que la mezcla se una para formar una masa áspera. Si la masa está demasiado seca, agregue un poco de leche. Forme la masa en forma de bola y envuélvala en una película adhesiva. Enfriar en la nevera durante 20 minutos.", "Desenvuelve la masa y descarta la película adhesiva. Voltee la masa sobre una superficie de trabajo enharinada y extiéndala hasta que quede lo suficientemente grande como para forrar una lata de pastel de 30x20 cm / 12x8 pulgadas. Cubra la lata con la masa, luego colóquelo en la nevera para enfriar por otros 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Alinee la caja agria refrigerada con una hoja de papel resistente a la grasa y llénela con alubias para hornear. Hornee durante 15-20 minutos, o hasta que la masa esté ligeramente dorada.", "Retire el papel y los frijoles y cepille todo el pastel con el huevo batido restante. Devuelva la masa al horno por otros cinco minutos, hasta que se dore. Retire la masa del horno y baje la temperatura del horno a 180 ° C / 365 ° F / Gas 4.", "Para el relleno, bata la mantequilla y el azúcar juntos en un tazón hasta que estén pálidos y esponjosos.", "Mezcle las almendras molidas, luego agregue los huevos uno por uno, batiendo bien entre cada adición hasta que quede suave y cremoso. Doble la ralladura de limón y la harina.", "Extiende un poco de mermelada de frambuesa generosamente en la base de la masa, dejando un espacio de 2,5 cm en el borde.", "Extienda la mezcla de relleno sobre la mermelada y espolvoree sobre las almendras en copos.", "Hornee la tarta durante 20 minutos o hasta que el relleno esté dorado. Dejar enfriar en la lata antes de servir.", "Para servir, corte la tarta en cuadrados de 5 cm / 2 pulgadas."]}, {"isVegetarian": true, "title": "Tarta rústica de Bakewell", "url": "www_bbc_co_uk_food_recipes_bakewellinabag_92015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["130 g / 4¾oz de almendras molidas", "100 g / 3½ oz de mantequilla, ablandada", "100 g / 3½ oz de azúcar en polvo, más extra para quitar el polvo", "1 huevo de gallinas camperas, batido, más 1 yema de huevo de gallinas camperas", "algunas gotas de extracto de vainilla", "500g / 1lb 2oz de pasta líquida lista para usar (use toda la mantequilla si es posible)", "harina común, para quitar el polvo", "5 cucharadas de mermelada de frambuesa", "2 cucharadas de leche", "1-2 cucharadas de almendras copos o enteras"], "serves": "Hace 12 rebanadas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, mezcle las almendras molidas, la mantequilla y el azúcar con una cuchara de madera.", "Agregue todo el huevo batido (pero no la yema adicional) y el extracto de vainilla y bata hasta que estén bien combinados. Cubra y deje enfriar en la nevera durante 2-3 minutos, o hasta que la mezcla se haya endurecido.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta que forme un cuadrado de aproximadamente 30 cm de diámetro.", "Espolvoree ligeramente una bandeja de tostar poco profunda con harina. Agrupe suavemente la masa para que quede enrollada sin apretar alrededor de su rodillo, luego colóquela sobre la bandeja de tostado preparada para que los bordes de la masa caigan sobre el borde labiado con el centro de la masa dentro de la bandeja.", "Coloque la mermelada en el centro de la masa y extiéndala en una capa uniforme sobre la masa con la parte posterior de una cuchara (deje 5 cm / 2 in libre en los bordes de la masa).", "Coloque la mezcla de almendras fría sobre la mermelada y extiéndala en una capa uniforme.", "Dibuje las esquinas y los bordes de la masa y pliéguelos para formar una caja de masa rugosa alrededor de la mezcla de relleno (el relleno aún será visible en el medio).", "Mezcle la yema de huevo restante y la leche, luego cepille ligeramente la masa con la mezcla. Espolvorea el relleno de tarta con azúcar impalpable y copos de almendras o copos.", "Transfiera la tarta Bakewell, en la bandeja de asar, al horno y hornee durante 25-30 minutos, o hasta que el relleno de tarta sea firme y dorado, y la masa esté crujiente y dorada.", "Cuando la tarta Bakewell esté cocida, reduzca la temperatura del horno a 160 ° C / 310 ° F / Gas 3 y continúe cocinando la tarta Bakewell por otros 10 minutos.", "Retire la tarta del horno y déjela a un lado para que se enfríe un poco antes de servir."]}, {"isVegetarian": true, "title": "Tarta Easy Bakewell", "url": "www_bbc_co_uk_food_recipes_bakewelltart_87541", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "125g / 4½oz de mantequilla sin sal", "30g / 1 oz de azúcar", "1 huevo de gallinas camperas, más 1 extra, batido, para esmaltar", "2 cucharadas de leche, para unir (si es necesario)", "225g / 8oz de mantequilla, ablandada", "225g / 8oz de azúcar", "225gr / 8 oz de almendras molidas", "3 huevos de gallinas camperas", "1 limón, ralladura finamente rallada solamente", "Harina normal de 50g / 2oz", "reloj de jarra cereza", "almendras en copos, para rociar"], "serves": "Sirve 8", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa, coloque la harina, la mantequilla, el azúcar y el huevo en un procesador de alimentos y pulse para combinar. Si es necesario, agregue un poco de leche para ayudar a unir la mezcla.", "Voltee la masa sobre una superficie de trabajo enharinada y extiéndala hasta que quede lo suficientemente grande para forrar una lata de tarta de 26cm / 10in. Levante con cuidado en la lata, luego coloque en la nevera para enfriar durante una hora.", "Precalentar el horno a 200C / 400F / Gas 6.", "Llenar la caja de tarta con una hoja de papel a prueba de grasa cargado con alubias o arroz. Hornee la persiana de la caja agria en el horno durante 15-20 minutos.", "Retire el papel y los frijoles y cepille la masa con huevo batido. Vuelve al horno por otros cinco minutos, hasta que se dore. Retire del horno y baje la temperatura del horno a 180C / 350F / Gas 4.", "Para el relleno, bata la mantequilla y el azúcar juntos en un tazón hasta que estén pálidos y esponjosos.", "Mezcle las almendras molidas, y luego agregue los huevos de uno en uno, batiendo bien entre cada adición. No se preocupe si la mezcla comienza a separarse, solo agregue un poco de la harina.", "Doble la ralladura de limón y la harina.", "Extienda un poco de mermelada generosamente sobre la base de la masa, dejando un espacio de 2,5 cm en el borde.", "Extienda la mezcla de relleno sobre la mermelada y espolvoree sobre las almendras en copos.", "Transfiera al horno y hornee por 20 minutos, o hasta que estén dorados. Dejar enfriar en la lata antes de servir en rebanadas."]}, {"isVegetarian": true, "title": "Tarta de Bakewell", "url": "www_bbc_co_uk_food_recipes_bakewelltart_89618", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakewelltart_89618_16x9.jpg", "ingredients": ["Harina normal de 280 g / 10 oz, más extra para quitar el polvo", "1 huevo pequeño de granja, golpeado", "1 yema de huevo de gallinas camperas", "165 g / 5¾oz de mantequilla sin sal", "Azúcar en polvo de 65 g / 2½ oz", "pizca de sal", "30 g / 1 oz de almendras molidas", "300gr / 10½ oz de almendras molidas", "130 g / 4 oz de azúcar en polvo", "6 huevos de gallinas camperas, golpeados", "splash esencia de almendra", "3 cucharadas de mermelada de frambuesa", "Almendras en copos de 25g / 1oz"], "serves": "Hace 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la masa, coloque la harina, la sal, el azúcar, la mantequilla y las almendras en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue los huevos y la yema de huevo uno a la vez y pulse hasta que se forme una masa homogénea.", "Envuelva la masa en una película adhesiva y enfríe en la nevera durante media hora.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Engrase y forme una lata agria de fondo suelto de 23cm / 9 pulgadas.", "Desenvuelva la masa refrigerada y colóquela en una superficie de trabajo fría y enharinada. (Nota: este es un pastel muy 'corto' y al principio será difícil de manejar).", "Alinee la lata agria con la masa y elimine cualquier exceso. Pinche la base con un tenedor, luego cubra los pasteles ligeramente con un poco de papel para hornear. Cubra el pergamino con frijoles para hornear o arroz crudo y colóquelo en el horno para hornear a ciegas durante 15 minutos.", "Retire del horno y retire los frijoles para hornear o el arroz y el pergamino para hornear y déjelos enfriar. Si la base de repostería aún está un poco cruda, vuelva al horno por un minuto o dos para secarse.", "Reduzca la temperatura del horno a 165C / 145C Fan / Gas 2.", "Mientras tanto, para el relleno, coloque las almendras molidas y el azúcar impalpable en un bol y mezcle bien.", "Agregue los huevos batidos y la esencia de almendras y mezcle bien.", "Cuando la masa se haya enfriado, esparza una generosa capa de mermelada de frambuesa sobre la base de la repostería.", "Vierta la mezcla de relleno sobre la mermelada de frambuesa para llenar la caja de pastelería.", "Cubra con almendras en copos, luego hornee en el horno durante 25-30 minutos, o hasta que el relleno esté completamente cocido y dorado por todas partes.", "Retirar del horno y dejar enfriar. Sirve caliente o frío."]}, {"isVegetarian": true, "title": "baklava", "url": "www_bbc_co_uk_food_recipes_baklava_80243", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baklava_80243_16x9.jpg", "ingredients": ["18 hojas de pasta de filo lista para usar (desenvuelva y mantenga debajo de una toalla de té húmeda hasta que esté listo para usar)", "150 g / 5oz de mantequilla sin sal, más extra para engrasar", "200 g / 7 oz de pistachos mezclados y nueces, toscamente picados", "2 cucharadas de azúcar granulada", "1 cucharadita de cardamomo molido", "300 g / 10½ fl oz de azúcar granulada", "250ml / 9fl oz de agua", "1 cucharada de jugo de limón", "1 cucharada de agua de azahar"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase una bandeja para hornear de 17cm x 28cm (11in x 7in) con mantequilla.", "Derretir la mantequilla restante en una cacerola a fuego lento o en un microondas.", "Coloque 10 hojas de pasta filo, una a la vez, en la bandeja, cepillando cada hoja con mantequilla antes de agregar la siguiente.", "En un tazón limpio, mezcle las nueces, el azúcar y el cardamomo y distribuya la mezcla sobre la masa en la bandeja.", "Acomode las hojas restantes sobre la mezcla de nueces, cepillando cada hoja con mantequilla, como antes.", "Con un cuchillo afilado, corte un patrón entrecruzado en las capas superiores de la masa.", "Coloque el baklava en el horno precalentado durante aproximadamente 20 minutos, luego disminuya la temperatura del horno a 150 ° C / 300 ° F / Gas 2 y cocine durante media hora más a 40 minutos, o hasta que la masa esté ligeramente inflada y dorada en la parte superior. No permita que la parte superior se queme. Retire y deje que se enfríe un poco.", "Para el almíbar, caliente el azúcar, el agua, el jugo de limón y el agua de azahar en una cacerola pequeña de fondo grueso y cocine a fuego medio hasta que el azúcar se derrita y se forme un jarabe. (Esto tomará aproximadamente 20 minutos más o menos).", "Vierta el almíbar en las ranuras en el baklava y deje enfriar. Cortar en pequeñas piezas en forma de diamante y servir."]}, {"isVegetarian": true, "title": "Picaduras de Baklava", "url": "www_bbc_co_uk_food_recipes_baklava_bites_92701", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baklava_bites_92701_16x9.jpg", "ingredients": ["Granos de pistacho 140 g / 5 oz", "20 g / oz de azúcar en polvo", "½ cucharadita de canela molida", "4 hojas de pasta filo lista", "harina de maíz, para quitar el polvo", "75g / 2½oz de mantequilla sin sal, derretida", "120 g / 4 oz de miel clara", "25 g / 1 oz de azúcar en polvo", "½ lima, solo ralladura", "1 ramita de canela", "2 limones, cáscara eliminada en tiras largas y delgadas con un cuchillo canelle", "50 g / 1¾oz de semillas de pistacho, reducidas a la mitad"], "serves": "Hace 24", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el relleno, coloque los pistachos, el azúcar y la canela en un procesador de alimentos y pulse hasta que esté finamente picado (no pique demasiado ya que se convertirá en una pasta). Deja la mezcla a un lado en un tazón.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para la masa, empolva ligeramente una superficie de trabajo con harina de maíz y corta las hojas de filo en cuadrados de 24 x 5 cm.", "Tome un cuadrado, quite el exceso de harina de maíz y cepille con mantequilla derretida. Coloque otro cuadrado en la parte superior en un ángulo de 45 grados y aplique más mantequilla. Transfiera a una lata de muffin mini de 24 hoyos, presionando suavemente la masa en un agujero. Repita para llenar todos los agujeros.", "Llene cada caja de repostería con el relleno, pero no comprima la mezcla ya que esto evitará que el jarabe se absorba adecuadamente más tarde. Hornee durante aproximadamente 14 minutos, o hasta que la masa esté crujiente y dorada.", "Mientras tanto, haz el jarabe. Agregue la miel, el azúcar, la ralladura de lima, la canela y 55 ml / 2 fl oz de agua en una cacerola pequeña a fuego medio. Llevar a ebullición a fuego lento hasta que el almíbar sea lo suficientemente grueso como para cubrir la parte posterior de una cuchara (unos 15 minutos). Retire del fuego y cuele cuidadosamente el jarabe (el azúcar en ebullición está muy caliente, así que tenga cuidado de no quemarse) y viértalo inmediatamente sobre las picaduras de baklava cuando salgan del horno.", "Para la decoración, coloque tiras de ralladura de lima y un pistacho en cada bocado de baklava. Sirve caliente o frío."]}, {"isVegetarian": false, "title": "Filete balsámico y glaseado de miel con espinacas, patatas picantes y aceite de romero", "url": "www_bbc_co_uk_food_recipes_balsamicandhoneyglaz_84282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filete de grupa 100 g / 3½ oz", "1 cucharada de aceite de oliva", "3 cucharadas de vinagre balsámico", "3 cucharadas de miel clara", "1 patata, pelada, cortada en 1cm / ½ en rebanadas, blanqueada", "1 cucharada de aceite de oliva", "2 cucharadas de aceite de oliva", "1 ramita de romero fresco", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "55 g / 2 oz de espinaca", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote la carne con el aceite y sazone con sal y pimienta negra recién molida en ambos lados.", "Caliente una sartén hasta que fume. Agregue la carne y fría por dos minutos en cada lado.", "Agregue el vinagre balsámico y reduzca a la mitad.", "Agregue la miel y cocine por un minuto más. Retire el resto de carne durante 2-3 minutos y luego corte.", "Para las papas, caliente el aceite de oliva en una sartén para horno. Agregue las rodajas de papa y fría por dos minutos en cada lado, hasta que estén crujientes y doradas. Sazonar con sal y pimienta negra recién molida y transferir al horno para asar durante cinco minutos.", "Para el aceite de romero, caliente suavemente el aceite de oliva y el romero en una sartén durante 1-2 minutos, luego retírelos del fuego y déjelos en infusión durante cinco minutos.", "Para la espinaca, derrita la mantequilla con el aceite de oliva en una sartén grande, luego agregue la espinaca. Cocine hasta que la espinaca se haya marchitado, luego condimente, al gusto, con sal y pimienta negra recién molida. Exprima el exceso de humedad y colóquelo en un plato.", "Sirva la carne en rodajas con la espinaca y rocíe los jugos de la sartén sobre la parte superior. Coloque las papas al lado y espolvoree un poco del aceite de romero."]}, {"isVegetarian": true, "title": "Pudín de arroz balinés", "url": "www_bbc_co_uk_food_recipes_balinesericepudding_93363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 g / 10½ oz de arroz glutinoso negro (disponible en algunas tiendas de comestibles asiáticas), lavado", "Azúcar de palma 170 g / 6 oz, rallado", "2 hojas pandan, trituradas, o 2 gotas de esencia pandan o vainilla (disponible en algunas tiendas asiáticas)", "450ml / 15¾fl oz de leche de coco", "pizca de sal", "coco fresco, para adornar"], "serves": "Para 6", "time": {"preparation": "durante la noche", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Remojar el arroz glutinoso en agua durante la noche.", "Escurra el arroz y colóquelo en una cacerola con 1.5 litros / 2 pintas de 12¾oz de agua. Caliente la mezcla hasta que hierva y continúe cocinando por 20-25 minutos, o hasta que el arroz esté tierno.", "Revuelva el azúcar y una de las hojas pandan en el arroz y continúe cocinando por otros 5-7 minutos. Dejar de lado para enfriar.", "Mientras tanto, caliente la leche de coco, la hoja pandan restante y la sal en una cacerola hasta que la mezcla se espese.", "Para servir, retire las hojas pandan del arroz y la leche de coco. Coloque el arroz negro cocido en cada uno de los 6 tazones para servir. Verter sobre la leche de coco y decorar con el coco fresco."]}, {"isVegetarian": false, "title": "Cordero balsámico glaseado con cintas de calabacín marinado", "url": "www_bbc_co_uk_food_recipes_balsamicglazedlambwi_90382", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 filete de pierna de cordero", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de vinagre balsámico", "1 calabacín, cortado en cintas con un pelador de patatas", "2 cucharadas de vinagre de vino blanco", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de menta fresca picada", "1 cucharada de eneldo fresco picado", "1 cucharada de perejil fresco picado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el cordero, cepille la carne con el aceite y sazone bien con sal y pimienta negra recién molida. Caliente una sartén a prueba de horno hasta que fume, luego dore el cordero durante 3-4 minutos o hasta que se dore. Voltee el cordero, agregue el vinagre balsámico y cocine durante 3-4 minutos, o hasta que el vinagre se haya reducido a una consistencia pegajosa y el cordero esté cocido a su gusto.", "Para el calabacín, coloque todos los ingredientes del calabacín en un recipiente y mezcle bien para cubrir. Permita macerar por diez minutos.", "Para servir, acomode las cintas de calabacín en un plato para servir. Cortar el cordero y colocar encima del calabacín."]}, {"isVegetarian": false, "title": "Salmón de sésamo con glaseado balsámico con tomates cherry espinados y espinacas", "url": "www_bbc_co_uk_food_recipes_balsamicglazedsesame_83963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/balsamicglazedsesame_83963_16x9.jpg", "ingredients": ["Filete de salmón 175g / 6oz", "sal marina y pimienta negra recién molida", "1 cucharadita de aceite de oliva", "1 cucharada de vinagre balsámico", "1 cucharadita de miel", "1-2 semillas de sésamo", "1 cucharada de aceite de oliva", "gran puñado de espinacas", "½ 400g / 14oz puede tomates cherry", "½ cucharadita de hojuelas de chile seco"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a alto.", "Sazonar el filete de salmón con sal marina y pimienta negra recién molida. Caliente el aceite en una sartén, agregue el salmón con la piel hacia abajo y cocínelo por 2 minutos, luego dé vuelta y cocínelo por un minuto más. Vierta sobre el vinagre y continúe cocinando por 2 minutos más.", "Transfiera el salmón a una sartén con papel de aluminio forrado con la piel hacia abajo. Rocíe con la miel y espolvoree con las semillas de sésamo, colóquelas debajo de la parrilla y cocínelas durante 3-4 minutos o hasta que estén bien cocidas.", "Mientras tanto, para los tomates, caliente el aceite en una sartén grande. Agregue las espinacas y fríelas suavemente durante dos minutos. Agregue los tomates, los copos de chile y el aceite extra y deje hervir a fuego lento y reduzca durante 2-3 minutos, hasta que se espese. Para servir, coloque la espinaca en un plato caliente y cubra con el salmón. Vierta sobre los jugos de pan."]}, {"isVegetarian": false, "title": "Cordero asado balsámico, arce y melaza", "url": "www_bbc_co_uk_food_recipes_balsamicmapleandmola_86191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["salpicar aceite de oliva", "1 cebolla roja picada", "3 dientes de ajo, aplastados", "½ (75cl) botella de vino tinto", "100ml / 3½fl oz de vinagre balsámico", "1 cucharada de mantequilla", "3 cucharadas de miel", "1 cucharada de melaza", "3 cucharadas de jarabe de arce", "pequeño puñado de romero, picado", "pequeño puñado de tomillo, picado", "3 dientes de ajo, aplastados", "sal marina y pimienta negra recién molida", "salpicar aceite de oliva", "1 x 2kg / 4lb 6oz pierna de cordero", "1-2 ramitas de romero (opcional)", "1-2 ramitas de tomillo (opcional)", "sal marina y pimienta negra recién molida", "salpicar aceite de oliva", "½ cebolla, finamente picada", "todos los jugos de adobo y sartén de cordero", "½ (75cl) botella de vino tinto", "stock de cordero, si es necesario", "manteca mantequilla (si es necesario)", "1 cucharadita de harina (si es necesario)"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el adobo líquido, caliente el aceite de oliva en una cacerola grande a fuego lento. Agregue la cebolla roja y el ajo y cocine hasta que se ablanden.", "Agregue los ingredientes restantes de adobo líquido y cocine a fuego lento hasta que la mezcla tome una consistencia ligeramente almibarada. Déjalo a un lado.", "Para el adobo seco, triture el romero, el tomillo y el ajo en un almirez y mortero, junto con sal marina y pimienta negra recién molida. Agregue un poco de aceite de oliva.", "Pase el cordero por agua fría y seque con papel de cocina. Coloque el cordero en una bandeja para hornear.", "Con un cuchillo afilado, haga incisiones en el cordero, lo suficientemente profundo como para perforar la grasa, pero sin cortar la carne.", "Empuje los pinchos del adobo seco hacia abajo en las incisiones del cordero, reservando una pequeña cantidad. Puede usar el mango de una cucharilla para empujar el adobo hacia el cordero o, alternativamente, usar los dedos.", "Vierta sobre el adobo líquido, teniendo cuidado de cubrir todo el cordero. Espolvorea sobre el adobo seco restante. Cubra el cordero con film transparente y déjelo a un lado.", "Si lo desea, puede dejar caer una ramita o dos de romero o tomillo en el adobo que rodea el cordero. Deje el cordero durante la noche (o aproximadamente dos horas si no tiene tiempo).", "Cuando esté listo para cocinar el cordero, precaliente el horno a 220C / 400F / Gas 7. Coloque el adobo que rodea al cordero fuera de la bandeja y dentro de un tazón. Espolvoree el cordero con más sal marina y pimienta negra recién molida al gusto.", "Coloque el cordero en el horno precalentado y tueste durante 20 minutos.", "Después de 20 minutos, reduzca la temperatura a 180 ° C / 350 ° F / Gas 4. A intervalos de 30 a 40 minutos, retire la bandeja del horno e hilvane el cordero con el líquido de adobo en la bandeja y cualquier líquido reservado del recipiente.", "Después de dos horas de cocción, retire el cordero del horno y déjelo reposar en un lugar cálido durante al menos diez minutos antes de tallar.", "Para la salsa, caliente el aceite de oliva en una sartén y agregue la cebolla. Cocine hasta que la cebolla esté blanda, pero no coloreada. Agregue lo que queda del adobo de cordero en el tazón, cualquier jugo que se haya acumulado en la bandeja y el vino. Si siente que no hay suficiente líquido, agregue un poco de caldo de cordero.", "Hierva la salsa vigorosamente durante unos minutos y luego baje y hierva a fuego lento hasta que esté listo para servir; el líquido debe reducirse y espesarse. Si la salsa parece demasiado fina, haga una pasta en un tazón pequeño mezclando una pequeña cantidad de mantequilla y harina con los dedos. Batir la pasta en la salsa a fuego lento para espesar la salsa.", "Sirva el cordero en rodajas con la salsa derramada."]}, {"isVegetarian": false, "title": "Ensalada de cangrejo báltico", "url": "www_bbc_co_uk_food_recipes_balticcrabsalad_88827", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 huevo de gallinas camperas", "125ml / 4½oz de aceite de oliva virgen extra", "1 limón, solo jugo", "75g / 3oz de carne de cangrejo fresca", "400g / 14oz de carne de cangrejo blanca fresca", "1 cucharada de perifollo fresco finamente picado", "1 cucharada de eneldo fresco finamente picado", "1 pepino de eneldo, finamente picado", "1 cucharadita de alcaparras para bebés, enjuagadas y escurridas", "2 cucharadas de apio, en rodajas finas", "Colas de cangrejo cocidas 200g / 7oz, peladas", "4 ramitas de perifollo fresco", "2 huevos de pato hervidos"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Para el aderezo, romper el huevo en un tazón y batir hasta que esté ligero y espumoso. Poco a poco agregue el aceite de oliva, batiendo constantemente (el aderezo debe tener una consistencia cremosa y espumosa). Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar el jugo de limón.", "Coloque la carne de cangrejo marrón en un colador y empuje a través de cualquier líquido en el aderezo. Revuelva bien para combinar.", "Para la ensalada, coloque la carne de cangrejo blanca en un recipiente limpio. Agregue el perifollo, el eneldo, el pepino de eneldo, las alcaparras y el apio y mezcle suavemente.", "Cuchara en un poco del aderezo, lo suficiente para cubrir, y revuelva cuidadosamente para combinar.", "Coloque un anillo de chefs en el medio de cada una de las cuatro placas. Coloque las cantidades iguales de la carne de cangrejo en el aro y presione suavemente hacia abajo. Continúa llenando cada anillo en aproximadamente dos tercios.", "Coloca una capa de colas de cangrejo encima de cada anillo de carne de cangrejo, luego aplica un poco más de aderezo.", "Adorne cada capa de colas de cangrejo con una ramita de perifollo, luego levante el anillo de cada chef.", "Para servir, corte los huevos de pato por la mitad y coloque la mitad al lado de cada pila. Vierta el resto del aderezo sobre la parte superior de las pilas."]}, {"isVegetarian": false, "title": "Pollo de tomate balsámico con patatas asadas", "url": "www_bbc_co_uk_food_recipes_balsamictomatochicke_87753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "150g / 5oz de papas nuevas para bebé, hervidas hasta que estén tiernas, escurridas", "½ pechuga de pollo sin piel", "115g / 4oz de tomates cherry", "guisa salsa de soja oscura", "salpicaduras de vinagre balsámico", "1 diente de ajo, ligeramente triturado", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la mitad del aceite de oliva en una lata pequeña para asar y coloque en el horno durante cinco minutos para calentar.", "Coloque las nuevas patatas hervidas en la lata de asar con el aceite calentado. Sazonar, al gusto, con sal y pimienta negra recién molida y volver al horno para asar durante 10-15 minutos, hasta que estén doradas.", "Mientras tanto, caliente una sartén resistente al horno de base pesada. Agregue el aceite de oliva restante a la sartén, luego agregue la pechuga de pollo. Sazonar, al gusto, con sal y pimienta negra recién molida, y cocinar por 1-2 minutos por cada lado, hasta que se dore por completo.", "Agregue los tomates cherry y rocíe sobre la salsa de soja y el vinagre balsámico.", "Agregue el diente de ajo y transfiéralo al horno para asar durante 10-15 minutos, o hasta que el pollo esté completamente cocido y los tomates cherry comiencen a reventar.", "Para servir, coloque el pollo balsámico de tomate en un plato calentado con las papas asadas al lado."]}, {"isVegetarian": false, "title": "Helado de plátano y arándano", "url": "www_bbc_co_uk_food_recipes_banana_and_blueberry_ice_01903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 limón, solo jugo", "125g / 4½oz de mascarpone, a temperatura ambiente", "6 cucharadas de azúcar glas", "12 arándanos, más extra para servir", "1 plátano maduro, puré", "galletas wafer, para servir"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["En un tazón, mezcle el jugo de limón y el mascarpone hasta que estén bien combinados.", "Agregue el azúcar glas, luego los arándanos y el puré de plátano.", "Transfiera la mezcla de helado a un recipiente con tapa y congelable. Congelar durante al menos dos horas o hasta que se solidifique.", "Para servir, coloca el helado en recipientes y espolvorea con arándanos. Servir con una galleta de barquillo."]}, {"isVegetarian": true, "title": "Pan de plátano y chocolate", "url": "www_bbc_co_uk_food_recipes_banana_and_chocolate_74784", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_and_chocolate_74784_16x9.jpg", "ingredients": ["1 plátano maduro (peso pelado 100 g / 4 oz)", "1 cucharada de leche", "50 g / 2 oz de mantequilla blanda o pasta para untar", "Harina normal de 75g / 3oz", "75g / 3oz de azúcar en polvo", "½ cucharadita de bicarbonato de soda", "½ cucharadita de polvo de hornear", "1 huevo de gallinas camperas", "50g / 2oz de chips de chocolate negro", "50 g / 2 oz de chocolate negro"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase y forre una lata de pan de 450 g / 1 lb con pergamino para hornear antiadherente.", "Use un tenedor para triturar el plátano pelado en un tazón. Agregue los ingredientes restantes de la torta (excepto las chispas de chocolate) y bata con un batidor de mano eléctrico hasta que se combinen y suavice.", "Agregue las chispas de chocolate y coloque la mezcla en la lata de pan preparada. Nivela la parte superior.", "Hornee por 40-45 minutos o hasta que esté bien levantado, encogiéndose lejos de los lados de la lata y dorado.", "Déjelo enfriar por 10 minutos, luego retírelo de la lata y déjelo enfriar en una rejilla.", "Para la decoración, divida el chocolate en trozos pequeños y agréguelos a un recipiente resistente al calor.", "Derrita el chocolate en el recipiente sobre una fuente de agua hirviendo (asegurándose de que el recipiente no toque el agua). Revuelva regularmente, hasta que se derrita casi por completo, luego retírelo del fuego. El calor del recipiente derretirá los grumos restantes.", "Con una cuchara, coloca el chocolate derretido en una manga pastelera y coloca zigzags en la parte superior del pan. Reserve para el chocolate para establecer. Rebana y sirve."]}, {"isVegetarian": false, "title": "Paquetes de paracaídas de plátano y chocolate", "url": "www_bbc_co_uk_food_recipes_banana_and_chocolate_84652", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ plátano maduro pequeño, pelado, aplastado hasta que quede suave", "1 cucharadita de gotas de chocolate", "2 hojas de pasta filo", "3-4 cucharaditas de aceite vegetal"], "serves": "Hace 2 paquetes", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, mezcle el puré de plátano y las gotas de chocolate. Dejar de lado.", "Coloque un cuadrado de masa de filo en una superficie de trabajo y dóblelo por la mitad para hacer un rectángulo. Corte el borde doblado con unas tijeras o un cuchillo afilado para crear dos rectángulos.", "Dobla cada rectángulo por la mitad otra vez para hacer dos cuadrados. Corta los bordes doblados para crear cuatro cuadrados.", "Repita el proceso con la hoja restante de pasta filo para crear ocho cuadrados de filo.", "Engrase dos de los agujeros en una bandeja para muffins con aceite vegetal usando un cepillo para pasteles. Empuje un cuadrado de repostería en la parte inferior de cada orificio, permitiendo que las esquinas apunten hacia arriba. Cepille los cuadrados de repostería con un poco más de aceite.", "Repite el proceso con los cuadrados de repostería restantes, asegurándote de que las esquinas se encuentren en diferentes lugares para cada capa. No es necesario engrasar la capa superior de la masa.", "Divida la mezcla de chocolate y plátano en partes iguales entre los dos agujeros para muffins alineados con filo.", "Gire suavemente las esquinas de cada paquete de pastelería para sellar. Hornee en el horno durante 12-15 minutos, o hasta que la masa esté crujiente y dorada."]}]