[{"ingredients": ["1 rebanada de nuez moscada", "pizca semillas de cilantro", "4 dientes", "1cm / ½ en rama de canela", "pellizcar jengibre molido", "1 vaina de cardamomo verde, solo semillas", "⅛ cucharadita de cúrcuma", "⅛ cucharadita de chile en polvo", "1 cebolla picada", "1 bulbo de hinojo, en rodajas", "100g / 3½oz de apio, en rodajas", "100 g / 3½ oz de zanahorias, en rodajas", "25g / 1 oz champiñones, lavados y en rodajas", "ramita de tomillo", "1kg / 2lb 4oz huesos de peces planos (como brill, lenguado, solla) o filetes", "2 cucharadas de aceite de oliva", "1 diente de ajo pequeño", "Cabezas y cáscaras de la gamba 250g / 9oz", "1 cucharada de puré de tomate", "½ cucharadita de sal", "4 cucharadas de aceite de oliva", "2 chalotes, finamente picados", "1 diente de ajo, rallado", "350g / 12oz de arroz carnaroli", "¼ cucharadita de mezcla de especias bizantinas", "125ml / 4fl oz de vino blanco seco", "1½ litro / 2½ pintas de caldo de pescado, caliente", "8 mejillones, fregados y rellenos", "150ml / 5fl oz de caldo de gambas", "2 filetes de salmonete rojo, cortados diagonalmente en tiras", "1 calamar, cuerpo cortado en anillos, más tentáculos", "Camarones pequeños de 100 g / 3½ oz", "botón de mantequilla", "100 g / 3½ oz de carne de cangrejo blanca", "pequeño puñado de perejil picado flatleaf", "sal y pimienta negra recién molida"], "method": ["Para la mezcla de especias, muela todos los ingredientes usando un mortero o un molinillo eléctrico. Almacene en una lata o caja hermética.", "Para el caldo de pescado, ponga todos los ingredientes, excepto los huesos de pescado en una sartén grande, agregue 2¼ litros / 3¾ pintas de agua y llévelo a ebullición. Baje el fuego y cocine a fuego lento durante 20 minutos. Agregue los huesos de pescado (o filete de pescado) y vuelva a hervir a fuego lento, quitando cualquier espuma a medida que sube a la superficie. Cocine a fuego lento durante 20 minutos más. Cuele a través de un colador en una sartén limpia y cocine a fuego lento un poco más, si es necesario, hasta que se reduzca a aproximadamente 1¼ litros / 2 pintas. Mantener caliente", "Para el caldo de gambas, caliente el aceite de oliva en una sartén grande a fuego medio. Agregue el ajo y las cabezas y cáscaras de gambas. Revuelva freír durante un par de minutos antes de agregar el puré de tomate, sal y 300 ml / 10 fl oz de agua. Cocine por 10 minutos, luego pase a través de un colador, empujando hacia abajo las cáscaras para extraer la mayor cantidad de sabor a gambas que pueda. Deseche las cáscaras, aparte la reserva y manténgala caliente.", "Para el risotto, caliente 3 cucharadas de aceite de oliva en una sartén grande a fuego medio. Freír los chalotes y el ajo suavemente hasta que se ablanden. Agregue el arroz y fríalo en el aceite durante 2 minutos, luego agregue la mezcla de especias bizantinas y revuelva a través del arroz.", "Agregue el vino blanco, cocine a fuego lento y permita que se evapore, luego agregue un cucharón de caldo de pescado caliente.", "Cuando esto haya sido absorbido, agregue el siguiente cucharón y continúe haciéndolo, revolviendo después de cada adición, hasta que le queden solo un par de cucharadas, esto demorará entre 16 y 18 minutos. Agregue los mejillones y el caldo de gambas.", "Caliente la cucharada restante de aceite de oliva en una sartén hasta hervir a fuego lento y fría las tiras de salmonete, los anillos de calamar y los tentáculos y las gambas enérgicamente durante 2-3 minutos.", "Condimentar con sal y pimienta. Mezcle los mariscos en el risotto con el caldo de pescado restante y cocine durante 1-2 minutos, o hasta que se absorba.", "Agregue la mantequilla, la carne de cangrejo y el perejil, y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_venetian_seafood_risotto_78329", "title": "Risotto veneciano de mariscos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos grandes de gallinas camperas, solo yemas", "2 cucharaditas de mostaza de Dijon de buena calidad", "1 cucharadita de mostaza integral inglesa", "3-4 cucharaditas de vinagre de vino blanco, o al gusto", "150ml / 5fl oz de aceite de girasol", "50ml / 2fl oz de aceite de oliva virgen extra de buena calidad", "pizca de sal", "1 pequeño apio nabo", "1 manojo de eneldo fresco, picado", "4 papas grandes y harinosas (preferiblemente Maris Piper), cortadas en papas fritas", "aceite de girasol, para freír", "sal al gusto", "Carne picada de venado a 500 g / 17 oz (preferiblemente carne picada de solomillo de gamo)", "sal y pimienta negra recién molida", "1-2 cucharadas de aceite de oliva", "1 cebolla roja, finamente cortada en anillos", "3 pepinillos, escurridos, en rodajas", "4 panecillos blancos suaves, cortados por la mitad horizontalmente", "salsa de tomate"], "method": ["Para el remouláde de apio nabo, coloque las yemas de huevo, las mostazas y el vinagre en el tazón de un procesador de alimentos y mezcle hasta que estén bien combinados.", "Con el motor todavía en funcionamiento, agregue gradualmente el aceite de girasol en una corriente delgada, hasta que la mezcla se espese y se vuelva lisa y brillante. (Si la mayonesa comienza a espesarse demasiado rápido, aflójela con la gota más pequeña de agua tibia y luego continúe).", "Agregue el aceite de oliva de la misma manera, hasta que la mezcla tenga una textura cremosa. Pruebe y agregue una gota o dos vinagre más, si es necesario. Sazone al gusto con sal.", "Pele el apionabo, luego corte a un grosor de 1 mm con una mandolina o un cuchillo muy afilado. Apila las rodajas de apio nabo una encima de la otra, luego corta las rodajas en tiras finas con un cuchillo afilado. Trabaja lo más rápido posible para evitar que el apionabo se decolore. Alternativamente, rallar el apionabo.", "Mezcle el apionabo con el eneldo en un tazón grande, luego agregue suficiente mayonesa para unirlo. Reserve por 30 minutos.", "Mientras tanto, para las patatas fritas, enjuague las papas fritas con agua fría, luego escurra bien y séquelas con papel de cocina. Seque lo más minuciosamente posible.", "Caliente el aceite en una freidora a 140C / 285F. Alternativamente, caliente el aceite en una sartén de fondo grueso y de caras pesadas hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cuando el aceite esté caliente, agregue las astillas (en tandas si es necesario) y fría por tres minutos. Retire de la sartén con una espumadera y déjela a un lado para escurrir en un colador forrado con papel de cocina.", "Aumente el calor a 180 ° C / 350 ° F, luego devuelva las virutas al aceite caliente y fría durante cinco minutos, o hasta que estén ligeramente doradas. Retirar del aceite de nuevo y escurrir en el colador (forrado con papel de cocina fresco). Sazonar con sal y mantener caliente.", "Para la hamburguesa de venado, sazone la carne picada de venado con sal y pimienta negra recién molida. Forme la carne picada condimentada en cuatro hamburguesas gruesas. Frote cada hamburguesa con un poco de aceite de oliva.", "Caliente una sartén a fuego medio a alto. Cuando la sartén esté humeando, agregue las hamburguesas y cocínelas durante 3-4 minutos por cada lado (para el medio), o hasta que aparezcan marcas marrones en la parte exterior de las hamburguesas y que las hamburguesas estén cocidas a su gusto.", "Para servir, coloque cada hamburguesa en un panecillo y cubra con cebolla roja, pepinillos y una cucharada de ketchup, si lo desea. Coloque las hamburguesas en cuatro platos. Sirve las patatas fritas y la remouláde de apio nabo al lado."], "url": "www_bbc_co_uk_food_recipes_venison_burger_with_91544", "title": "Hamburguesa de carne de venado con remoulade de apio y patatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 500g / 1lb 2 oz lomo de venado, recortado", "aceite vegetal para freír, más 5 cucharadas extra", "2 dientes de ajo, aplastados", "8 ramitas de tomillo fresco", "4-6 bayas de enebro, aplastadas", "4-6 granos de pimienta negra, aplastados", "remolacha bebé pequeño racimo, tallos recortados", "remolacha caramelo pequeño manojo, tallos recortados", "1 cucharada de vinagre de Jerez", "1 cucharada de vinagre de vino tinto", "½ cucharadita de azúcar en polvo", "½ apio nabo, cortado en cubos pequeños", "100ml / 3½ fl oz de leche", "100ml / 3½ fl oz crema doble", "1 cucharada de vinagre de vino blanco", "½ cucharadita de mostaza Dijon", "Cerezas de 300 g / 10½ oz, deshuesadas y sin tallo", "200 c / 7oz negro", "sal y pimienta negra recién molida"], "method": ["Coloque el venado en un tazón grande y cúbralo con 2 cucharadas de aceite, ajo, la mitad de tomillo, las bayas de enebro y los granos de pimienta. Cubra y refrigere toda la noche.", "Cuando esté listo para cocinar, retire del adobo y sazone con sal y pimienta.", "Coloque en una sartén muy caliente durante 1 minuto en cada lado, o hasta que esté coloreado por completo. Retire de la sartén, envuélvala en una película adhesiva y déjela reposar en el refrigerador hasta que esté lista para comer.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cubra un plato hondo a prueba de horno con papel de cocina y coloque las remolachas adentro. Coloque los lados de la lámina alrededor de las remolachas, dejando un pequeño espacio. Vierta el vinagre de jerez y el vinagre de vino tinto en la lámina, agregue ½ cucharadita de sal, el azúcar y el tomillo restante, luego selle la lámina.", "Vierta 100-200ml / 3½-7fl oz de agua alrededor de la lámina en la bandeja (dependiendo del tamaño de la olla) y tápelo durante 30-40 minutos, o hasta que esté suave. Retire del horno y deje enfriar en los jugos. Pelar y cortar aproximadamente.", "Coloque el apio nabo en una sartén con la leche y la crema a fuego medio. Cocine hasta que esté suave, sazone con sal y pimienta y mezcle con una batidora de mano. Dejar de lado.", "Mientras tanto, en un tazón, mezcle las 3 cucharadas restantes de aceite con el vinagre de vino blanco, la mostaza y una pizca de sal y pimienta. Agregue las cerezas.", "Precaliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Freír la col rizada en lotes durante 1 minuto. Retire y escurra sobre papel de cocina. Dejar de lado.", "Cortar la carne de venado en trozos delgados y dividir equitativamente entre cuatro platos. Adorne con remolacha, cerezas, unas gotas de puré de apio y la col rizada."], "url": "www_bbc_co_uk_food_recipes_venison_carpaccio_03868", "title": "Carpaccio de Venado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "1kg / 2lb 4 oz filete de hombro y cuello de venado, cortado y en cubos", "sal y pimienta", "botón de mantequilla", "10 chalotes, pelados", "4 lonchas de tocino ahumado, cortado en cubitos", "6 zanahorias pequeñas, con puntas verdes adjuntas", "2 dientes de ajo", "350ml / 12fl oz de vino tinto", "150ml / 5fl oz puerto rojo", "1 litro / 1¾ de pinta de carne de vacuno", "1 estrella de anís", "1 ramita de canela", "3 cucharadas de jalea de grosella", "50g / 1¾oz de mantequilla", "1 calabaza moscada, pelada y picada", "100ml / 3½ fl oz crema doble", "sal marina y pimienta negra", "300ml / 10fl oz de crème de cassis", "500ml / 18fl oz de vino tinto", "1 tira de ralladura de naranja", "tomillo de ramita", "aceite de oliva, para freír", "1 repollo rojo, finamente cortado", "100ml / 3½fl oz de vinagre de vino tinto", "5 cebollas rojas, finamente cortadas"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Calentar el aceite de oliva en una sartén grande. Sazone la carne de venado con sal y pimienta negra recién molida, luego agregue a la sartén caliente. Freír la carne en tandas hasta que se dore por todas partes, luego dejar de lado.", "Agregue un poco de aceite de oliva y un generoso pomo de mantequilla en una cazuela grande con tapa. Freír las chalotas a fuego medio hasta que comiencen a colorear. Agregue el tocino, las zanahorias y el ajo y continúe cocinando durante unos minutos. Agregue el venado dorado a la cazuela.", "Vierta el vino tinto y el puerto, lleve a ebullición y cocine a fuego lento hasta que el líquido se haya reducido a la mitad. Agregue el caldo, el anís estrellado, la canela y la jalea de grosella, y sazone al gusto con sal y pimienta negra recién molida. Coloque la tapa en la cazuela y transfiérala al horno y cocínela durante 1½-2 horas, o hasta que la carne esté tierna.", "Para el puré de calabaza, agrega la mantequilla a una sartén grande. Freír suavemente la calabaza sin colorear durante 15-20 minutos, o hasta que esté suave. Agregue la crema y sazone al gusto con sal marina y pimienta negra recién molida.", "Use una licuadora para mezclar la calabaza hasta que quede suave. Pase el puré a través de un colador y déjelo a un lado en un lugar cálido hasta que esté listo para servir.", "Para la col lombarda, coloque la crème de cassis, el vino tinto, la ralladura de naranja y el tomillo en una sartén. Deje que hierva a fuego lento y cocine hasta que el líquido haya reducido su volumen en tres cuartas partes.", "En una sartén por separado a fuego alto, agregue un poco de aceite de oliva y fría el repollo durante dos minutos. Sazone al gusto con sal y pimienta negra recién molida. Agregue el vinagre y transfiéralo a una sartén limpia. Agregue un poco más de aceite a la sartén en la que se frió el repollo y fríe con cuidado las cebollas durante 10 minutos.", "Agregue las cebollas al repollo y vierta sobre la mezcla de cassis reducida. Mezcle bien, cubra con papel de aluminio y cocine en el horno con la carne de venado durante una hora.", "Cuando la cazuela esté cocida, retire con cuidado todas las piezas de venado en un recipiente limpio y luego use un colador para colar el líquido de cocción en la carne. Coloque a fuego alto y deje que hierva. Cocine hasta que el líquido haya reducido su volumen a la mitad.", "Sirva la cazuela con puré de calabaza y repollo rojo al lado."], "url": "www_bbc_co_uk_food_recipes_venison_casserole_with_25450", "title": "Cazuela de carne de venado con repollo rojo estofado y calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de carne de venado a 350 g / 12 oz, cortado en tiras de 2cm / ¾ de ancho", "Hígados de pollo con 350g / 12oz", "2 cucharadas de aceite de colza", "25 g / 1oz de mantequilla sin sal", "2 cucharadas de Armagnac", "Tocino rayado ahumado curado seco de 550g / 1lb 4oz", "Pechugas de pollo deshuesadas y sin piel de 300g / 10½oz, más o menos picadas", "Crema doble de 200 ml / 7 fl oz", "50 g / 1¾oz de avellanas picadas tostadas", "50g / 1¾oz de arándanos secos", "2 cucharadas de hojas de estragón picadas", "sal marina y pimienta negra recién molida"], "method": ["Sazonar los hígados de venado y pollo con sal y pimienta negra recién molida.", "Caliente el aceite en una sartén grande a fuego medio. Agregue las tiras de carne de venado, en lotes, y cocine durante 30 segundos, revolviendo regularmente, hasta que se dore por todos lados. Retirar de la sartén y reservar en un plato. Repita el proceso con las tiras de venado restantes.", "Agregue la mantequilla a la sartén y selle los hígados de pollo de la misma manera, hasta que se dore por fuera y quede rosado en el medio. De pie hacia atrás y protegiendo sus antebrazos, vierta el Armagnac sobre los hígados de pollo y enciéndalo con un fósforo. Deje que las llamas se enciendan y mueran, luego coloque los hígados de pollo a un lado en la sartén para que se enfríen.", "Mientras tanto, alinee la base y los lados de una lata de pan de 1 kg / 2 lb y 4 onzas con las lonjas de tocino, superponiendo los bordes y dejando un voladizo de 5 cm en el borde.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Mezcle las piezas de pechuga de pollo con un puré fino en un procesador de alimentos. Vierta la crema doble y mezcle nuevamente hasta que esté bien combinada. Sazone con mucha sal y pimienta negra recién molida, luego transfiera a un tazón y añada las avellanas y los arándanos.", "Coloque un tercio de la mezcla de pollo en el molde de hogaza preparado, alisándolo en una capa uniforme con una espátula. Cubra con las tiras de venado. Extienda más de la mitad de la mezcla de pollo restante en una capa uniforme, luego espolvoree sobre las hojas de estragón, hígados de pollo flameados y los jugos de la sartén. Cubra con la mezcla de pollo restante, luego doble el tocino colgando sobre la parte superior de la terrina para cubrir completamente.", "Cepille un trozo de papel de aluminio con aceite y cubra la lata con él, sellando herméticamente alrededor de los bordes. Coloque la lata de pan en una bandeja de tostado de lado profundo. Vierta suficiente agua hirviendo para llegar a la mitad de los lados de la lata de pan, luego con cuidado transfiera la bandeja de asar al horno y cocine durante 1¼-1 ½ horas, o hasta que la terrina esté cocida. (Para verificar que la terrina esté bien cocida, inserte un pincho en el centro, luego toque con cuidado. Si el pincho se siente bien caliente, la terrina se cuece bien. Si no, vuelva a colocarla en el horno y cocine por otros 10 minutos , luego verifica nuevamente)", "Retire la terrina del horno y déjela enfriar por completo en el baño maría. Retire del baño maría y deje enfriar en la nevera durante al menos una hora, o hasta que sea necesario.", "Para servir, retire la lámina de aluminio, luego coloque la terrina en un plato para servir. Cortar en rodajas gruesas y servir con pepinillos, encurtidos y pan crujiente o pan tostado."], "url": "www_bbc_co_uk_food_recipes_venison_chicken_liver_34637", "title": "Venado, hígado de pollo y terrina de Armañac", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venison_chicken_liver_34637_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chuletas de carne de venado T-bone (preferiblemente gamos), más algunos huesos adicionales y restos de carne de venado para stock (disponible, en temporada, de carniceros de buena calidad)", "2 cucharaditas de copos de sal marina, más extra para sazonar", "2 cucharadas de aceite de oliva", "pimienta negra recién molida", "1 chalote de plátano, pelado, finamente picado", "2 dientes de ajo, pelados, finamente picados", "½ cucharadita de azúcar en polvo", "200ml / 7fl oz blanco Borgoña, u otro vino blanco seco", "8 bayas de enebro, ligeramente trituradas", "4 cucharadas de vinagre de vino blanco", "1 cucharadita de hojas frescas de tomillo", "40 g / 1½ oz de mantequilla", "Harina normal de 25g / 1oz", "300 ml / 10½ fl oz de venado de stock (ver arriba)", "100ml / 3½ fl oz crema doble", "copos de sal marina y pimienta negra recién molida", "4 greens de primavera grandes", "puñado de perifollo fresco picado"], "method": ["Para el caldo de venado, coloque los huesos del venado y los restos de carne de venado en una sartén grande (los filetes de T-bone se usarán más adelante). Agregue suficiente agua fría para cubrir completamente el contenido de la sartén, luego agregue dos cucharaditas de sal y lleve el agua a ebullición.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 1 hora y 30 minutos, rozando la espuma de la superficie del agua a intervalos regulares. (NB: solo necesitará 300 ml / 10 ½ oz de reserva para esta receta; cualquier exceso se puede congelar para usar en el futuro durante un máximo de cuatro meses).", "Para la salsa de enebro, coloca la chalota, el ajo, el azúcar, el vino blanco, las bayas de enebro, el vinagre de vino blanco y el tomillo en una cacerola y lleva la mezcla a ebullición.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 3-4 minutos, o hasta que el volumen de líquido que queda en la olla se haya reducido a aproximadamente dos cucharadas.", "Mientras tanto, derrita la mantequilla en una cacerola aparte a fuego medio. Cuando la mantequilla se haya derretido, agregue la harina y bata durante 30 segundos hasta que la mezcla esté bien combinada como una salsa roux suave.", "Con la sartén de salsa roux aún sobre el fuego, cuele la reducción de vino a través de un tamiz fino en la sartén que contiene la salsa roux. Escoge las bayas de enebro de los ingredientes que quedan en el colador y agrégalos a la salsa. Sigue batiendo regularmente.", "Agregue lentamente el caldo de venado caliente, una cucharada a la vez, a la mezcla de salsa roux, batiendo cada cucharón hasta incorporarlo por completo en la salsa roux antes de agregar el siguiente cucharón. Una vez que todo el caldo se haya agregado a la salsa roux, continúe cocinando la salsa suavemente durante 10 minutos, o hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara.", "Vierta la crema y aumente la temperatura hasta que la salsa hierva a fuego lento (no la deje hervir), luego retire la sartén del fuego y sazone al gusto con sal y pimienta negra recién molida. Recalentar cuando sea necesario.", "Para la carne de venado, precalentar la parrilla a su máximo nivel. Caliente una sartén a prueba de horno a fuego medio-alto.", "Frote las costillas de venado con el aceite de oliva, luego sazone al gusto con sal y pimienta negra recién molida. Cuando la sartén de la plancha esté caliente, agregue las chuletas de venado y dore por ambos lados durante 1-2 minutos, o hasta que se dore por todas partes.", "Transfiera la sartén a la parrilla y continúe cocinando las chuletas de venado durante 4-5 minutos (para medio raro), o hasta que se cocinen a su gusto.", "Justo antes de servir, caliente una sartén a fuego medio, agregue los verdes de primavera y una o dos cucharadas de agua hirviendo, luego sazone al gusto con sal y pimienta negra recién molida. Continúe cocinando durante 1-2 minutos o hasta que los greens de primavera estén marchitos.", "Para servir, coloque una pica de venado en cada uno de los cuatro platos de servir. Cuchara sobre la salsa de enebro. Cucharee los verdes de primavera marchitos al costado. Espolvorea sobre el perifollo."], "url": "www_bbc_co_uk_food_recipes_venison_chop_with_81103", "title": "Chuleta de venado con salsa de enebro y verduras de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "2 cebollas grandes, en rodajas", "2 palitos de apio, cortados y rebanados", "1 zanahoria mediana, pelada y cortada en cubos ásperos de 15mm / ⅝in", "2 cucharadas de harina normal", "1 cucharadita de mostaza inglesa en polvo", "500ml / 18fl oz cerveza real o cerveza negra", "1kg / 2lb 4 oz de venado (idealmente hombro o pierna), cortado en trozos de 3cm / 1in", "2 cucharaditas de grosella de grosella roja", "1 cucharada de hojas frescas de tomillo, picadas", "2 hojas de laurel", "1-2 cucharadas de jugo de limón fresco", "sal marina escamada y pimienta negra recién molida", "500g / 1lb 2 oz de harina de auto aumento, más extra para quitar el polvo", "½ cucharadita de sal marina fina", "100g / 3½oz de mantequilla fría, cortada en cubos", "300ml / 10½oz de leche entera, más extra para glaseado", "huevo batido, para glasear (opcional)"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite en una cazuela mediana a prueba de llamas (o en una cacerola grande de base pesada) y fríe la cebolla, el apio y la zanahoria suavemente durante 10 minutos, o hasta que la cebolla esté blanda y ligeramente colorada, revolviendo ocasionalmente.", "Agregue la harina y la mostaza y cocine por unos segundos antes de remover lentamente la cerveza y 250 ml / 9 fl oz de agua. Agregue la carne de venado, jalea de grosella, hojas de tomillo y hojas de laurel y revuelva. Sazone con un poco de sal y mucha pimienta negra molida. Llevar a fuego lento a fuego lento, revolviendo de vez en cuando, luego cubrir con una tapa.", "Con cuidado, transfiera el plato al horno y cocínelo de 1 a 2 horas, o hasta que el venado esté muy tierno y la salsa espesa.", "Sazone al gusto con sal y pimienta, agregando un poco de jugo de limón para elevar la riqueza. (En este punto puede enfriar la mezcla de carne de venado y dejarla en el refrigerador para terminarla más tarde, o al día siguiente si lo desea). Cuando esté listo para cocinar su zapatero, coloque la mezcla de carne de venado en un molde para horno.", "Para el relleno del zapatero, precalentar el horno a 200C / 400F / Gas 6.", "Ponga la harina y la sal en un tazón grande y frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue la leche, revolviendo constantemente, hasta que la mezcla se una y forme una masa suave y esponjosa.", "Convierta la masa en una superficie de trabajo enharinada y extiéndala hasta que tenga unos 2 cm de grosor. Recorte 6cm / 2½ pulgadas en rondas con un cortador de pasteles, amasando y volviendo a enrollar cualquier masa sobrante según sea necesario.", "Coloque los \"adoquines\" sobre la superficie del pastel para que casi cubran el relleno y cepíllelos con leche o huevo batido.", "Hornee durante 30 minutos, o hasta que la cobertura esté dorada y el relleno esté caliente."], "url": "www_bbc_co_uk_food_recipes_venison_cobbler_98688", "title": "Zapatero de venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150 g / 5½ oz de lomo de venado o filetes de pierna", "¼ pequeño centro de repollo Savoy (250 g / 9 oz) eliminado y finamente triturado", "1 cucharada de mostaza inglesa", "3 cucharadas de vinagre de sidra u otro vinagre blanco", "1 cucharadita de azúcar en polvo", "1 cucharadita de sal", "500g / 1lb 2 oz de calabaza, pelada, sin semillas y cortada en trozos", "½ cucharadita de semillas de comino", "20 hojas de curry", "3 cucharaditas de aceite de sésamo", "1 cucharada de aceite de girasol", "1 cebolla roja, cortada a la mitad y en rodajas finas", "Anís de 2 estrellas", "2 dientes de ajo, en rodajas finas", "Jengibre de raíz de 5 cm / ½ en pieza, pelado y cortado en cerillas", "1 chile rojo, finamente picado", "2 cucharaditas de salsa de pescado", "5 cm / ½ en pieza capas externas de hierba de limón descartadas, dentro rebanadas finas", "4 hojas de lima kaffir", "300ml / 10fl oz de leche de coco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Sentar la carne de venado en un plato, cubrir con una película adhesiva y dejar que alcance la temperatura ambiente.", "Pon el repollo rallado en un recipiente. Mezcle la mostaza, el vinagre, el azúcar y media cucharadita de sal, vierta sobre el repollo y revuelva para cubrir. Cubra y reserve.", "Coloque la calabaza en un plato para asar y agregue las semillas de comino y las hojas de curry. Rocíe una cucharadita de aceite de sésamo y sazone con la sal restante. Mezcle y hornee durante 10 minutos.", "Mientras tanto, coloque una cacerola mediana a fuego medio. Agregue el aceite de girasol, la cebolla y el anís estrellado y cocine hasta que la cebolla comience a caramelizar, revolviendo con frecuencia. Agregue el ajo, el jengibre y el chile y cocine por otros 2 minutos, revolviendo. Agregue la salsa de pescado y cocine durante 30 segundos, luego agregue el limoncillo, hojas de lima y leche de coco y llevar a ebullición. Cocine a fuego medio durante 4 minutos.", "Retire la calabaza del horno y vierta la salsa de curry sobre ella. Regrese al horno y continúe cocinando hasta que la calabaza esté cocida y comience a colorear. Apaga el horno y mantén la calabaza caliente en el horno.", "Mientras tanto, para cocinar la carne de venado, coloque una cacerola de base pesada a fuego medio-alto y espere hasta que desprenda una neblina azul. Cepille los filetes con el aceite de sésamo restante y sazone ligeramente con sal y pimienta en ambos lados. Coloque los filetes en la sartén y cocine por 3 minutos. Dale la vuelta y cocina a tu gusto. (Si le gusta medio raro, necesitará solo otros 2 minutos). Retire los filetes y descanse sobre un plato tibio, cubierto con papel de aluminio, durante 5-8 minutos.", "Para servir, coloca la calabaza en cuatro platos calentados y coloca el repollo sobre ella. Cortar la carne de venado en rebanadas de 1cm / ½ en rebanadas y poner encima, luego cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_venison_coconut-curried_11281", "title": "Venado, calabaza al curry de coco y repollo de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva, para freír", "Recortes de 200 g / 7 oz del lomo de carne de venado (abajo)", "2 zanahorias picadas", "1 cebolla picada", "2 dientes de ajo picados", "2 ramitas de tomillo fresco", "2 bayas de enebro", "1 cucharadita de pimienta negra", "350ml / 12fl oz de vino tinto", "Puerto de 100 ml / 3½ fl oz", "1 litro / 1¾ de pinta de carne de vacuno", "10g / ⅓oz de pimienta negra molida", "10g / ⅓oz de anís estrellado molido", "10g / ⅓oz de canela molida", "Bayas de enebro molido 10g / ⅓oz", "250 g / 9 oz de sal de roca", "1 huevo blanco de corral", "Harina normal de 200g / 7oz", "Aceite para freír", "400 g / 14 oz de venado de distancia", "25g / 1oz de mantequilla", "2 cabezas de achicoria roja, cortadas en cuartos a lo largo", "15 g / ½ oz de azúcar", "1 naranja, solo jugo", "½ limón, solo jugo", "150ml / 5fl oz de caldo de pollo", "algunas hojas de menta, cortadas en tiras muy delgadas"], "method": ["Para la salsa de carne de venado, caliente un poco de aceite de oliva en una olla grande y fría las guarniciones de carne de venado hasta que se doren por completo. Agregue las zanahorias y la cebolla y freír suavemente durante dos minutos, o hasta que las cebollas estén suaves y translúcidas. Agregue el ajo, el tomillo, las bayas de enebro, la pimienta negra, el vino tinto y el puerto. Cocine a fuego lento durante cinco minutos y luego agregue el caldo de carne.", "Cocine a fuego lento durante 45 minutos. Pasar a través de un colador en una olla limpia y hervir a fuego lento de nuevo hasta que el volumen del líquido se haya reducido a una salsa rica.", "Para el venado en una costra de sal con especias, precaliente el horno a 225C / 425F / Gas mark 7.", "Para hacer la costra de sal, combine todas las especias en un tazón grande. Pon algunas pizcas de las especias a un lado. Agregue la sal, la clara de huevo y 100 ml / 3½ fl oz de agua en el tazón. Poco a poco agregue la harina y amasar hasta que tenga una masa suave. Cubra con película adhesiva y reserve para descansar durante una hora.", "En una sartén bien caliente, caliente un poco de aceite y dore el lomo de venado durante un minuto. Retire el venado y espolvoréelo con las especias reservadas.", "En una superficie de trabajo ligeramente enharinada, extienda la masa de corteza de sal en un rectángulo de 1cm / ½ pulgada de grosor. Coloque el venado en el centro de la masa listo para envolverlo. Recorte cualquier exceso donde las esquinas se superpongan para formar una forma cruzada áspera. Dobla los extremos sobre la carne de venado, luego envuelve los bordes largos para que la carne quede completamente encerrada. Déle la vuelta para ocultar las costuras y haga un pequeño agujero en la parte superior. Hornea de 12 a 14 minutos.", "Para comprobar que la carne de venado esté cocida, inserte un pincho de metal en el orificio y déjelo durante 10 segundos. Coloque el pincho en la parte posterior de la mano, si la carne está cocida, debe sentirse caliente. Retire del horno y deje reposar por 12 minutos.", "Para la achicoria caramelizada, derrita la mantequilla en una sartén. Agregue la achicoria y sazone al gusto con sal y pimienta. Espolvorea sobre el azúcar y cocina durante dos minutos. Vierta los jugos de naranja y limón y el caldo de pollo. Cocine a fuego lento durante cinco minutos antes de terminar con menta picada.", "Para servir, coloca la achicoria en platos para servir. Agriete la costra de sal, limpie la carne de venado con papel de cocina y talle. Coloque unas rodajas al lado de la achicoria y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_venison_cooked_in_a_29725", "title": "Carne de venado cocinada en una corteza de sal con especias y achicoria caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite, para freír", "6 lonchas de tocino rayado ahumado, picado", "1 cebolla grande, finamente picada", "1 zanahoria grande, finamente picada", "2 ramitas de romero, hojas recogidas y picadas", "600 g / 1lb 5 oz de carne picada de venado", "1 cucharada de harina normal", "300ml / 10fl oz de vino tinto", "500ml / 18fl oz de carne de res o juego", "sal y pimienta negra recién molida", "1kg / 2lb 4oz de patatas, picadas en cubos de 2cm / ¾in", "botón de mantequilla", "salpicar leche"], "method": ["Caliente el aceite en una cazuela grande con tapa y profunda o en una cacerola de base pesada colocada a fuego alto. Agregue el tocino y fría hasta que estén crujientes. Eliminar y reservar.", "Agregue la cebolla, la zanahoria y el romero y fría por unos minutos hasta que se ablanden. Agregue la carne picada y revuelva hasta que se dore, rompiéndola mientras revuelve.", "Espolvoree la harina y cocine por un minuto, revolviendo. Poco a poco agregue el vino y, revolviendo todo el tiempo, hierva por unos minutos hasta que el volumen del líquido se haya reducido a la mitad. Agregue el caldo y el tocino cocinado, lleve a ebullición y sazone con sal y pimienta, revolviendo durante 5 minutos. Tape y cocine a fuego lento durante aproximadamente 40 minutos o hasta que estén tiernos.", "Precalentar el horno 200C / 180C Fan / Gas 6.", "Coloque la carne picada en un plato a prueba de horno de 3 litros / 5 litros. Dejar de lado para enfriar.", "Para hacer el relleno, ponga a hervir una cacerola grande de agua salada. Hervir las papas hasta que estén tiernas. Drene y regrese a la sartén. Agregue la mantequilla y la leche. Sazonar con sal y pimienta y machacar hasta que quede suave.", "Coloca el puré en la parte superior de la carne fría, nivela la parte superior y marca con un tenedor. Hornee durante 45 minutos o hasta que estén dorados y burbujeantes."], "url": "www_bbc_co_uk_food_recipes_venison_cottage_pie_69051", "title": "Pastel de carne de venado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz de venado salvaje, cortado en cubitos", "25 g / 1 oz de pasta de jengibre y ajo, de un tarro", "4 cucharadas de aceite vegetal", "200 g / 1 libra de tomates de 5 oz, picados", "Cebollas de 300 g / 10½ oz, picadas", "2 cucharadas de chiles en polvo de Cachemira", "2 cucharadas de cilantro molido", "2 cucharadas de cúrcuma molida", "2 cucharadas de semillas de enebro, aplastadas", "2 cucharaditas de sal masala", "2 chiles verdes, finamente picados (opcional)", "1 cucharada de hojas de cilantro fresco picado", "2 cucharadas de yogur al estilo griego", "Yogur griego de 100g / 3½oz", "150ml / 5fl de leche en oz", "2 cucharaditas de sal", "500g / 1lb 2 oz de harina común", "1 cucharadita de polvo de hornear", "3 cucharadas de aceite de colza virgen extra, más extra para amasar", "500g / 1lb 2oz de arroz blanco cocido basmati, para servir"], "method": ["Caliente el aceite en una cacerola grande de fondo grueso a fuego medio. Agregue las cebollas y fría hasta que estén doradas. Agregue el venado y cocine durante 5 minutos hasta que los jugos salgan de la carne.", "Agregue la pasta de ajo y jengibre y cocine durante 4-5 minutos. Agregue las especias y el chile y cocine por un par de minutos más. Agregue los tomates, reduzca el fuego a fuego lento, cubra con una tapa o papel pergamino y cocine durante 1-1½ horas hasta que la carne esté suave y tierna. Es posible que tenga que rellenar con un chorrito de agua de vez en cuando si está demasiado seco.", "Mientras tanto, para hacer los panes naan, coloque todos los ingredientes en un tazón grande, mezcle bien y deje reposar durante al menos una hora.", "Convierta la masa en una superficie enharinada y amasarla en una masa suave. Divide en 8 y forma en 8 panes naan.", "Caliente una sartén sobre una cabeza mediana y cocine los panes naan en la sartén seca, en tandas, durante 3-4 minutos en cada lado.", "Retire el curry del fuego y agregue el yogur. Espolvoree con el cilantro y sirva con el arroz y los panes naan."], "url": "www_bbc_co_uk_food_recipes_venison_curry_28033", "title": "Venison curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de aceite de cacahuete", "70ml / 2½fl oz de vinagre de vino blanco", "pizca de pimienta blanca molida", "pizca de sal", "1 diente de ajo, ligeramente triturado", "1 ramita de tomillo fresco", "300g / 10½oz de higos negros o verdes maduros, enteros", "20 g / oz de mantequilla", "pizca de cinco especias china", "30ml / 1fl oz puerto", "4 filetes de carne de venado o silla de venado de 240 g / 9 oz", "1 cucharada de aceite vegetal", "60 g / 2¼ oz de mantequilla sin sal", "1 chalote, finamente picado", "125g / 4½oz de setas silvestres mezcladas", "80ml / 2½fl oz de caldo de pollo", "1 cucharada de perejil fresco picado", "pizca de cinco especias china", "60g / 2½oz de hojas de ensalada mixtas", "sal y pimienta negra recién molida"], "method": ["Para hacer la vinagreta, mezcle todos los ingredientes.", "Para el puré de higos, corte los higos a la mitad y retire la pulpa, sin carne blanca.", "Calentar la mantequilla en una sartén hasta hacer espuma. Agregue las cinco especias y cocine durante 2 minutos y luego agregue la carne de los higos. Agregue el puerto y cocine durante 10-15 minutos.", "En una licuadora, mezcle hasta que quede suave, luego pase a través de un colador. Termine con un poco más de mantequilla y sazone con sal y pimienta. Apartar y mantener caliente.", "Sazone la carne de venado con sal y pimienta. Caliente una sartén de fondo grueso con un poco de aceite y 25 g / 1 oz de mantequilla. Cuando la mantequilla esté espumosa, agregue la carne de venado y cocine lentamente, coloreando todo alrededor. Cocine por aproximadamente 10 minutos, retírelo de la sartén y déjelo reposar durante 15 minutos antes de servir.", "Para el ragoût, usando la sartén en la que cocinó la carne, agregue un poco de mantequilla y las chalotas se cocinan suavemente durante aproximadamente 1 minuto antes de agregar los champiñones. Agregue el caldo de pollo y cocine por 2 minutos. Batir en los restantes 25 g / 1 oz de mantequilla. Agregue un poco de vinagreta al gusto y termine con sal, pimienta, perejil picado y una pizca de cinco especias.", "Para servir, corta el venado. Ponga un poco de puré de higos en cada plato, ponga los champiñones en el medio del plato y la carne encima. Viste las hojas de ensalada ligeramente en la vinagreta y espárcelas una y otra vez. Vierta un poco de ragoût y sirva."], "url": "www_bbc_co_uk_food_recipes_venison_salad_with_fig_16503", "title": "Ensalada de venado con puré de higos y setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 400 g / 14 oz de lomo de venado, de corzo o gamo", "4 ramitas de tomillo fresco, picado", "1 cucharadita de sal", "2 cucharadas de aceite de girasol", "¼ de pepino, pelado y en rodajas finas", "½ cucharadita de sal", "50ml / 2fl oz de vinagre de vino blanco", "pizca de azúcar en polvo", "aceite vegetal, para freír", "1 cebolla roja, en rodajas", "50 g / 1¾ onza de harina de arroz", "½ cucharadita de sal", "2 rebanadas de pan de masa fermentada, a la parrilla y tostado", "1 cucharadita de mostaza Dijon", "175g / 6oz de crema fresca", "½ cucharadita de semillas de hinojo tostadas", "1 limón, ralladura solamente", "Alcaparras 50 g / 1¾ oz", "2 cucharadas de eneldo picado", "1 cucharadita de rábano picante recién rallado"], "method": ["Para la carne de venado, coloque el tomillo picado y la sal sobre una tabla picada y mezcle. Ruede el lomo de venado en la mezcla, cubriendo todo alrededor. Sazonar con pimienta.", "Calentar una sartén mediana y agregar el aceite. Cuando el aceite esté caliente, asiente el venado y cocine de 8 a 10 minutos, volteándolo mientras cocina.", "Coloque las rodajas de pepino en un colador y agregue sal. Deje actuar unos minutos y luego exprima el exceso de agua, mezcle con el vinagre y el azúcar y drene nuevamente. Dejar de lado hasta que sea necesario.", "Para las cebollas crujientes, llene una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Calor a 180C. (Para verificar que el aceite esté a la temperatura adecuada, coloque un cubo de pan en el aceite caliente. Se pondrá dorado en 1 minuto). (PRECAUCIÓN: El aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle la sal y la harina en un plato. Dragar las rodajas de cebolla en harina y freír durante 2 minutos. Retire y coloque en un plato con el rollo de cocina y sazone con sal.", "Para servir, coloque la masa madre en un plato de servir y unte con la mostaza. Cortar el venado y colocar encima. Quenelle la crème fraîche en el lado, apilar pepinos al lado de la carne de venado y terminar con cebollas crujientes y semillas de hinojo. Termine el plato con la ralladura de limón, las alcaparras, el eneldo y el rábano picante."], "url": "www_bbc_co_uk_food_recipes_venison_on_sourdough_10137", "title": "Carne de venado en masa fermentada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de azúcar", "15g / ½ oz de jugo de limón", "4 manzanas Bramley, peladas, en rodajas y sin corazón", "150 g / 5½ oz de cebolla, finamente picada", "mantequilla, para freír", "Carne picada de venado grueso 350g / 12oz", "Vientre de cerdo 150 g / 5½ oz, picado grueso", "1½ cucharadita de tomillo picado", "1 diente de ajo, rallado", "½ cucharadita de maceta de tierra", "¼ enebro de tierra", "½ cucharadita de sal de mesa, más extra para servir", "½ cucharadita de pimienta negra molida", "6 huevos de codorniz, hervidos, sin cáscara", "5 huevos de gallinas camperas, golpeados", "Harina normal de 100 g / 3½ oz", "Pan rallado de 200 g / 7 oz panko", "aceite vegetal, para freír"], "method": ["Para la salsa de manzana, en una cacerola, traiga 300 ml / 10½ fl oz de agua, el azúcar y el jugo de limón a ebullición. Agregue la manzana en rodajas y cocine hasta que esté suave.", "Mezclar hasta obtener un puré usando una licuadora de mano, luego pasar a través de un colador y dejar a temperatura ambiente.", "Para los huevos escoceses, fríe las cebollas con un poco de mantequilla hasta que estén suaves pero no coloreadas. Dejar de lado para enfriar.", "En un tazón combine la carne picada de venado, carne de cerdo picada, tomillo, cebollas refrigeradas, ajo, macis, enebro, sal y pimienta. Divida la mezcla en bolas de 85 g / 3oz. Presiona tu pulgar en el medio de cada bola para hacer un hoyo. Empuja los huevos de codorniz en cada hoyo, luego empuja la carne sobre la parte superior para encerrar el huevo de las codornices. Coloque en una bandeja para hornear y transfiéralo a la nevera para enfriar.", "Precaliente una freidora a 180 ° C / 350 ° F y precaliente el horno a 180 ° C / 350 ° F / Gas 4 (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Ponga los huevos batidos, harina y pan rallado en tazones separados. Enrolle los huevos escoceses en la harina, acariciando cualquier exceso. Cubra el huevo escocés completamente en huevo batido, dejando que el exceso gotee. Finalmente, enrolle los huevos escoceses en pan rallado hasta que estén completamente cubiertos.", "Coloque con cuidado los huevos escoceses en la cesta de la freidora y baje la grasa. Cocine hasta que se dore (aproximadamente cinco minutos). Retire con cuidado con una cuchara ranurada y transfiera a un plato alineado con el rollo de cocina.", "Transfiera al horno por tres minutos para asegurarse de que la carne esté cocida y que el huevo esté tibio y que todavía tenga un delicioso goteo. Retirar del horno espolvorear con un poco de sal y servir con la salsa de manzana."], "url": "www_bbc_co_uk_food_recipes_venison_scotch_eggs_and_88459", "title": "Huevos de ciervo escocés y puré de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 6 huevos escoceses", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 patas de venado, desde las patas delanteras", "350ml12fl oz de vino tinto", "150ml / 5fl oz puerto", "1 ramita de tomillo", "2 dientes de ajo, aplastados", "1 hoja de laurel", "4 granos de pimienta", "4 bayas de enebro", "2 cucharadas de aceite vegetal", "4 lonchas de tocino ahumado, picadas", "1 cebolla picada", "2 zanahorias, peladas y picadas", "1 apio en barra, picado", "2 litros / 3½ pintas de pollo o caldo de carne", "200 g / 7oz de castañas cocidas", "½ calabaza de cebolla, semillas removidas y cortadas en lunas de 2.5cm / 1in, piel sobre", "6 remolachas, preferiblemente variedad Cheltenham Greentop, lavadas y cortadas por la mitad a lo largo", "sal marina", "2 ramitas de tomillo", "2 dientes de ajo", "6 cucharadas de vinagreta", "3 peras maduras, preferiblemente variedad Williams", "pimienta negra recién molida", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de caldo de pollo", "3 pastinacas, peladas y partidas por la mitad"], "method": ["Para la cacerola, coloque la carne de venado en un recipiente con el vino tinto, orujo, tomillo, ajo, laurel, granos de pimienta y bayas de enebro, revuelva bien y luego deje marinar en la nevera durante la noche.", "Precalienta el horno a 140 ° C / 275 ° F / Gas 1. Retira la carne de venado del plato, reserva el adobo y sécalo con papel de cocina.", "Caliente una cazuela para horno a fuego pesado hasta que esté caliente, agregue el aceite, luego la carne de venado y dore la carne por todos lados a fuego alto. Retire la carne de la sartén y reserve.", "Agregue el tocino y las verduras a la sartén, junto con una pizca de sal, y cocine hasta que las verduras estén ligeramente doradas.", "Agregue el adobo reservado, cocine hasta que se haya reducido en dos tercios, luego coloque el venado en la sartén, agregue el caldo y cocine a fuego lento.", "Corte un trozo de papel resistente a la grasa del mismo tamaño que la parte superior de la olla y colóquelo encima de la cazuela.", "Coloque la sartén en el horno y cocine por 2-3 horas hasta que la carne esté tierna. Deje que la cacerola se enfríe, luego quite los dientes de venado y déjelos a un lado.", "Tamice los jugos de cocción y luego regréselos a la sartén y reduzca al menos a la mitad o hasta que la salsa esté rica y oscura. Coloque la sartén a un lado hasta que esté listo para terminar.", "Para las verduras asadas, encienda el horno a 170 ° C / 325 ° F / Gas 3.", "Envuelva la calabaza y la remolacha en un paquete de aluminio con sal, tomillo, ajo y vinagreta y un par de cucharadas de agua. Coloque en una bandeja para hornear en el horno y hornee durante 30-40 minutos hasta que estén tiernos.", "Mientras tanto, corte las peras por la mitad, quite los núcleos y sazone con sal y pimienta negra recién molida.", "En una sartén grande, caliente la mitad de la mantequilla y luego agregue las peras cortadas hacia abajo. Permita que la mantequilla se caliente mucho y se ponga de un color marrón claro, luego baje la temperatura y cocine suavemente durante 8-10 minutos hasta que las peras estén tiernas.", "Agregue el caldo de pollo, deje que burbujee, luego retire las peras de la sartén y déjelo a un lado en un lugar cálido.", "Escalde las chirivías en agua hirviendo y luego transfiéralas a la misma sartén que usó para cocinar las peras y agregue la mantequilla restante. Cocine suavemente hasta que la pastinaca esté tierna y dorada.", "Para terminar la cazuela, devuelva las cañas de venado a la sartén, agrega las castañas y cálmate suavemente.", "Sirva la cazuela en platos calientes con la calabaza, la remolacha, las peras y las chirivías al lado."], "url": "www_bbc_co_uk_food_recipes_venison_shank_casserole_18971", "title": "Cazuela de caña de venado con peras y nabos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ repollo rojo, rallado", "150g / 5½ oz demerara azúcar", "40 g / 1½ oz de escamas de sal marina", "20 bayas de enebro, aplastadas", "50g / 1¾oz de mantequilla", "250g / 9oz de puré de papa seco y frío", "Harina blanca normal 75g / 2½oz", "1 cucharadita de polvo de hornear", "125ml / 4fl de leche en oz", "2 huevos de gallinas camperas", "3 cucharadas de aceite de colza", "200ml / 7fl oz de vino tinto", "100ml / 3½fl oz de vinagre de vino tinto", "100g / 3½ fl oz de grosella roja", "4 dientes", "500ml / 1lb 2 oz de caldo de carne", "50g / 1¾oz de mantequilla", "4 cucharadas de aceite de colza", "4 filetes de ternera T-bone (aproximadamente 250 g / 9 oz cada uno)", "sal al gusto", "½ limón, solo jugo", "150 g / 5½ oz crème fraîche, para servir", "1 cucharadita de granos de pimienta machacados de Sichuan", "1 lima, solo jugo, para servir"], "method": ["Treinta minutos antes de cocinar, mezcle la col lombarda, el azúcar demerara, los copos de sal marina y las bayas de enebro en un recipiente no metálico y deje que el repollo se ablande.", "Mientras tanto, prepare los panqueques de papa, precaliente el horno a 160C / 325F / Gas 3 y luego apáguelo. Mezcle el puré de patatas, la harina y el polvo de hornear en un bol. En otro recipiente, mezcle la leche y los huevos, luego mezcle los ingredientes líquidos con la mezcla de papa para formar una masa.", "Caliente el aceite de colza en una sartén antiadherente grande a fuego medio. Ponga una cucharada de la mezcla en la sartén y fría por 2-3 minutos por cada lado hasta que se dore. Transfiéralos al horno apagado para mantener el calor. Deberías obtener 12-16 panqueques de la mezcla.", "Para hacer la salsa de clavo de olor, lleva el vino tinto, el vinagre de vino tinto, la jalea de grosella y el clavo de olor a ebullición en una cacerola a fuego alto, revolviendo para disolver la gelatina. Continúe hirviendo hasta que el volumen de líquido se reduzca a un glaseado. Agregue el caldo de carne, vuelva a hervir y vuelva a reducir a la mitad para hacer una salsa. Pase la salsa por un colador fino en un recipiente para quitar los dientes, luego déjelos a un lado y manténgalos calientes.", "Para la col lombarda, enjuague bien la col con agua corriente fría. Derrita la mantequilla en una sartén a fuego medio, luego agregue la col para que se caliente. No cocine en exceso: el repollo aún debe tener algo de crujiente. Mantenga caliente hasta que esté listo para servir.", "Para los filetes de carne de venado, derrita la mantequilla con el aceite de colza en una sartén grande colocada a fuego alto hasta que la mantequilla empiece a tomar un color marrón avellana. Sazonar los filetes con una pizca de sal, agregarlos a la sartén y freír durante 3-4 minutos en cada lado, o hasta que estén de un hermoso color oscuro. Exprima el jugo de limón e hilvane el venado con los jugos de la sartén (no los cocine demasiado, ya que la carne de venado tiene un contenido de grasa muy bajo y puede secarse). Retire los filetes de la sartén y déjelos reposar, cubiertos con papel de aluminio, durante 10 minutos.", "Mientras los filetes están en reposo, mezcle la crème fraîche, la pimienta de Szechuan y el jugo de lima.", "Para servir, ponga un par de panqueques en cada plato, agregue un poco de col roja y un filete de carne de venado, y luego vierta sobre la salsa de clavo de olor. Sirva con la crème fraîche especiada en un lado."], "url": "www_bbc_co_uk_food_recipes_venison_steaks_with_red_18489", "title": "Filetes de carne de venado con col roja y panqueques de patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pequeño colinabo, cortado en cubos de 1cm / ½ en", "150g / 5½oz de mantequilla sin sal", "200 g / 7 oz de venado de distancia", "1 manojo de tomillo, hojas recogidas", "1 manojo brócoli brotación púrpura", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 chalotes de plátano, finamente picados", "200ml / 7fl oz puerto", "500ml / 18fl oz de caldo de pollo", "250 g / 9 oz zarzamoras"], "method": ["Ponga el colinabo en una olla y cúbralo con agua. Agregue 100 g / 3½ oz de la mantequilla y sazone con sal y pimienta. Hierva hasta que el barril esté tierno o hasta que el agua se haya evaporado. Escurrir, si es necesario, y aplastar con un tenedor.", "Sazone la carne de venado con sal y pimienta. Calentar una sartén y agregar la mantequilla restante. Agregue el venado y el tomillo. Freír durante 3-4 minutos o hasta que la carne esté cocida a su gusto. Déjalo reposar por 10 minutos.", "Mientras tanto, prepara la salsa. Calentar el aceite en una sartén y agregar los chalotes. Fría suavemente hasta que esté suave, luego agregue el puerto y cocine hasta que el volumen del líquido se reduzca a la mitad. Agregue el caldo y reduzca nuevamente hasta que tenga una consistencia de salsa. Agregue las moras y cocine durante 1-2 minutos.", "Poner a hervir una olla de agua con sal y escaldar el brócoli durante 2 minutos, luego escurrir. Escurrir sobre papel de cocina. Caliente una sartén y cocine el brócoli.", "Para servir, corta el venado. Divida el colinabo entre los platos de servir, agregue el brócoli, cubra con carne de venado y termine con la salsa."], "url": "www_bbc_co_uk_food_recipes_venison_swede_and_74619", "title": "Venado, colinabo y moras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 yema de huevo", "1 cucharadita de mostaza Dijon", "1 cucharadita de vinagre de jerez", "100ml / 3½fl oz de aceite vegetal", "50 ml / 2 fl oz de aceite de avellana", "1 limón, reducido a la mitad", "Filete de corzo 400g / 14oz", "cubitos de hielo para mantener el tartar fresco mientras lo preparas", "2 cucharadas de manzana finamente picada", "2 cucharadas de zanahoria finamente picada", "2 cucharadas de apionabos picados finamente", "2 cucharadas de cebollines finamente picados", "2 cucharadas de avellanas picadas", "1 cucharadita de chalotes finamente picados", "1 cucharadita de vinagre de jerez", "4 huevos de codorniz", "sal marina y pimienta negra recién cuajada", "Croûtons de masa fermentada sin gluten"], "method": ["Para la mayonesa, ponga la yema de huevo, la mostaza y el vinagre en un tazón. Batir hasta que esté emulsionado. Coloque el recipiente sobre un paño de cocina (para evitar que se mueva) y mezcle lentamente el aceite de verduras y avellanas. Sazone con jugo de limón recién exprimido, al gusto, luego cubra y guarde en la nevera hasta que lo necesite.", "Para el tartar de venado, utiliza un cuchillo afilado para eliminar los tendones del filete, luego corta la carne en un dado muy fino. Coloque la carne en un recipiente mediano y colóquela en un recipiente grande o en una bandeja para asar llena de hielo. Sazone bien la carne con sal y pimienta antes de mezclar la manzana, la zanahoria, el apionabo, el cebollino y las avellanas.", "Agregue una cucharada de mayonesa. Agregue el vinagre y mezcle hasta que esté combinado, agregando más mayonesa si es necesario. Me gusta moldear el tartar en un anillo de metal ligeramente engrasado de una presentación elegante, pero puede ser simplemente una cuchara en el centro de las placas de servir.", "Sirva el tartar con una yema de huevo de codorniz encima de cada porción y un poco de pimienta agrietada adicional. Adorne con los croûtons."], "url": "www_bbc_co_uk_food_recipes_venison_tartare_hazelnut_86777", "title": "Tartare de venado, mayonesa de avellana y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pan de masa fermentada de 100 g / 3½ oz, en rodajas finas", "rociar aceite de oliva", "5 bayas de enebro secas, aplastadas", "1 diente de ajo", "40ml / 1½fl oz de vinagre de vino blanco", "15 gotas de Tabasco", "20g / ¾oz de mostaza Dijon", "40g / 1½ oz de salsa de tomate", "3 filetes de anchoa de plata (boquerones)", "1 baya de enebro seca", "1 pequeño apio nabo", "3-4 cucharadas de sal", "100 ml / 3½ fl oz crema fresca", "1 cucharadita de mostaza integral", "Lomo de carne de venado a 400g / 14oz, con guarnición de grasa, finamente picado", "1 chalote grande, cortado en cubitos", "½ manojo de perejil fresco de flatleaf, hojas picadas", "50g / 2oz de cornichons, escurridos, cortados en cubitos", "sal y pimienta negra recién molida", "4 yemas de huevo de codorniz (reservar la mitad de cada caparazón para servir)", "2 castañas frescas grandes, cocidas, peladas y en rodajas"], "method": ["Para la tostada, precaliente la parrilla a un ajuste medio.", "Ase las lonchas de masa fermentada durante 1-2 minutos. Dar la vuelta y rociar con aceite de oliva. Espolvorea sobre las bayas de enebro trituradas. Tueste durante 2 minutos o hasta que estén doradas. Mantener caliente", "Para el aderezo, mezcle todos los ingredientes del aderezo en un puré suave en un procesador de alimentos. Dejar de lado hasta que sea necesario.", "Para la remoulade, pele el apio nabo y corte la carne en tiras finas, salpique las tiras con sal sobre la marcha para evitar que se decolore y absorba la humedad. Dejar de lado por 3 minutos.", "Lave el apionabo cortado en juliana debajo de un grifo de agua fría y luego drene. Transfiera a un plato mezclador más grande. Agregue la mostaza y la crema fresca hasta que estén bien combinados. Enfriar en la nevera hasta que sea necesario.", "Para el tartare de venado, en un tazón, mezcle la carne de venado en cubitos, el chalote, el perejil y los cornichons. Verter sobre el aderezo y mezclar hasta que esté bien combinado, sazonar, al gusto, con sal y pimienta negra recién molida, luego mezclar de nuevo.", "Para servir, coloque un molde anular en cada una de las 4 placas para servir. Divida el tartar de venado por igual entre los moldes anulares, presionando la carne hacia los lados del molde. Gira una porción del remouláde de apio nabo alrededor de un tenedor y colócalo junto a la carne de venado. Agregue una o dos rebanadas de pan tostado y cubra cada tartar de venado con una mitad de cáscara de huevo que contiene una yema de huevo de codorniz. Finalmente, adornar cada plato con las rodajas de castaño."], "url": "www_bbc_co_uk_food_recipes_venison_tartare_with_19212", "title": "Tartare de venado con remoulade de apio nabo, castañas y tostadas de enebro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de venado de 750 g / 1 libra 10 oz, desde el extremo más grueso, recortado", "2 cebollas, en rodajas finas", "1 cucharada de azúcar mascabado ligero", "1 cucharada de vinagre balsámico", "1 cucharada de hojas de tomillo fresco finamente picado", "harina común, para quitar el polvo", "375g / 13oz de hojaldre listo para enrollar", "1 cucharadita de mostaza Dijon", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "1 cucharada de harina normal", "300ml / ½ litro de caldo de carne caliente", "100 ml / 3½ fl oz oz puerto o vino tinto", "1 cucharada de grosella roja u otra jalea de fruta"], "method": ["Caliente el aceite en una sartén grande a fuego alto. Sazonar la carne de venado con sal y pimienta y freír durante unos 20 segundos en cada lado, o hasta que esté sellado y dorado pero no cocido. Retire y reserve para enfriar.", "Reduzca el fuego a bajo, agregue las cebollas a la sartén y fría por algunos minutos. Cubra con una tapa y cocine durante 15-20 minutos, o hasta que esté suave y dorado.", "Retire la tapa y fría por un minuto para eliminar cualquier líquido. Retire la mitad de las cebollas con una cuchara ranurada y déjelas a un lado (esto se usará para la salsa más adelante). Agregue el azúcar, el vinagre y el tomillo a las cebollas y cocínelas durante 5 minutos o hasta que estén pegajosas. Deje que se enfríe completamente.", "Haga rodar la masa sobre una superficie de trabajo ligeramente enharinada hasta que quede muy delgada, aproximadamente 25x35 cm / 10x14 pulgadas. Recorte los bordes para limpiar. Cepille la superficie de la masa con la mostaza, coloque el filete dorado en el centro y espolvoree las cebollas balsámicas pegajosas.", "Doble los extremos y traiga los lados, corte cualquier exceso si hay capas dobles de masa y cepille con huevo batido. Utilice los recortes de pastelería para cortar tres hojas y colocarlas en el centro del Wellington, luego glasearlas con huevo. Enfriar en la nevera durante 1 hora, junto con el huevo batido restante.", "Precaliente el horno a 220C / 200C Fan / Gas 7. Necesitará una bandeja grande para hornear forrada con papel de hornear antiadherente precalentado en el horno para que esté bien caliente.", "Cepille el Wellington con el huevo batido restante. Siéntate en la bandeja para hornear caliente y ase durante 20-25 minutos, o hasta que se dore. Deje reposar durante 5-10 minutos antes de tallar.", "Mientras tanto, para hacer la salsa, freír la cebolla cocida reservada en una cacerola a fuego alto durante 1 minuto. Espolvorea la harina y revuelve. Agregue el caldo caliente, la jalea de fruta y el puerto. Llevar a ebullición, revolviendo y cocinar durante 5 minutos, o hasta que se reduzca y espese.", "Cuele la salsa a través de un colador, vuelva a colocarla en la sartén, sazone con sal y pimienta, y cocine por unos minutos más, hasta que tenga una consistencia de recubrimiento. Agregue más sal y pimienta si es necesario.", "Tallar la carne de venado en rodajas muy gruesas y servir con la salsa de oporto."], "url": "www_bbc_co_uk_food_recipes_venison_wellington_with_90748", "title": "Venison Wellington con cebolla caramelizada y jus portuario", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venison_wellington_with_90748_16x9.jpg", "isVegetarian": false, "recommendations": 0}]