[{"ingredients": ["25g / 1oz de mantequilla", "1 chalote de plátano grande, pelado, finamente picado", "1 diente de ajo grande, pelado, finamente picado", "1 pepino mediano, pelado, cortado por la mitad a lo largo, las semillas se sacan con una cucharilla y se descartan, la carne se corta en medias lunas", "Gran pizca de nuez moscada recién molida", "Escamas de sal marina y pimienta blanca recién molida", "220 g / ½ libra de guisantes frescos, con las vainas retiradas (peso envasada)", "200ml / 7fl oz de caldo de pollo fresco", "1 lechuga redonda de hojas suaves, sin núcleo, hojas separadas, núcleo y hojas picadas", "8 hojas grandes de acedera, picadas", "2 cucharadas de crema", "2 puñados de gambas del Atlántico Norte, para servir (opcional)"], "method": ["Caliente la mantequilla en una sartén a fuego medio o bajo. Cuando la mantequilla esté espumosa, agregue la chalota picada y el ajo y fríe durante 8-10 minutos, revolviendo regularmente, o hasta que estén suaves pero no coloreados.", "Agregue el pepino en rodajas y la nuez moscada y sazone al gusto con sal y pimienta blanca recién molida. Revuelva bien y continúe freír la mezcla durante 3-4 minutos, revolviendo ocasionalmente, hasta que quede suave y translúcido.", "Agregue los guisantes y el caldo a la sartén y deje que la mezcla hierva a fuego lento. Cubra la olla con una tapa y cocine suavemente durante 6-8 minutos, agregando un poco más de existencias, según sea necesario para evitar que la mezcla se seque, hasta que los guisantes estén tiernos. Retire la sartén del fuego y deje a un lado para que se enfríe un poco.", "Cuando la mezcla se haya enfriado, transfiérala a un procesador de alimentos y mezcle hasta obtener un puré suave. Dejar de lado para enfriar más.", "Cuando la mezcla se haya enfriado, agregue las hojas de lechuga picadas y el tallo y el alazán picado y mezcle de nuevo hasta que quede suave.", "Pase la mezcla a través de un colador fino en un tazón grande. Agregue la crème fraîche hasta que esté bien combinada, luego enfríe en la nevera hasta que esté fría.", "Para servir, cuela la sopa de jardín inglesa en tazones poco profundos. Adorne con los langostinos cocidos, si los usa."], "url": "www_bbc_co_uk_food_recipes_englishgardensoupwit_91687", "title": "Sopa inglesa de jardín con gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15fl oz / 425ml de leche", "algunos tallos de perejil", "1 hoja de laurel", "1 rodaja de cebolla, ¼in / 5mm de grosor", "1 cuchilla de maza", "10 granos de pimienta negros enteros", "Harina simple de ¾oz / 20g", "1½ oz / 40 g de mantequilla", "4 cucharadas colmadas de perejil fresco finamente picado", "1 cucharada de crema individual", "1 cucharadita de jugo de limón", "sal y pimienta negra recién molida"], "method": ["Coloque la leche y los siguientes cinco ingredientes en una sartén pequeña, lleve todo lentamente al punto de cocción lenta, luego vierta la mezcla en un recipiente y déjelo a un lado para que se enfríe por completo.", "Cuando esté listo para hacer la salsa, cuele la leche nuevamente en la sartén, deseche los aromatizantes, luego agregue la harina y la mantequilla y lleve todo gradualmente al punto de cocción a fuego lento, batiendo continuamente con un batidor de globo hasta que la salsa se espese y suave y brillante. Luego baje la temperatura a la configuración más baja posible y deje que la salsa se cocine suavemente durante unos minutos, revolviendo de vez en cuando.", "Para servir la salsa, agregue el perejil picado, el jugo de crema y limón, el sabor y la temporada, luego sirva en una jarra tibia."], "url": "www_bbc_co_uk_food_recipes_englishparsleysauce_70006", "title": "Salsa inglesa de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 15 fl oz / 425 ml", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, sin piel, cortada en rodajas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "1 patata, pelada y en rodajas", "sal y pimienta negra recién molida", "2 tomates de vid, cortados por la mitad", "1 cucharada de harina", "2 cucharadas de aceite de oliva", "1 cucharadita de azúcar en polvo", "1 cucharada de vinagre balsámico", "2 cucharadas de vinagre de vino blanco", "3 cucharadas de ketchup de tomate", "1 cucharada de perejil fresco picado", "1 cucharada de albahaca fresca picada", "1 cucharada de cebolletas frescas picadas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo, frote el aceite en la carne y sazone bien con sal y pimienta negra recién molida.", "Caliente una pequeña cantidad de aceite en una sartén a fuego alto. Agregue el pollo y fría por 2-3 minutos para dorarlo, luego transfiera al horno por 6-7 minutos para cocinar el pollo.", "Para las papas, derrita la mantequilla en una sartén pequeña y resistente al horno, luego retírela del fuego.", "Agregue las rodajas de patata a la bandeja una por una para formar una capa. Sazonar bien con sal y pimienta negra recién molida, y transferir al horno durante 7-8 minutos.", "Retire la sartén del horno y dé vuelta las rebanadas de patata, luego devuelva la sartén al horno y cocine las patatas durante otros 5-7 minutos, o hasta que estén bien cocidas.", "Para los tomates asados ​​agridulces, presione los lados planos de las mitades de tomate en una superficie de trabajo enharinada para que estén cubiertos con harina.", "Caliente el aceite en una cacerola a prueba de horno a fuego medio, agregue los tomates, los lados planos hacia abajo, y fría por 3-4 minutos.", "Espolvoree los tomates con el azúcar y el vinagre balsámico, luego coloque la sartén en el horno para asar durante 6-8 minutos.", "Para la vinagreta de ketchup, caliente el vinagre de vino y el ketchup en una cacerola aparte a fuego medio durante 5-6 minutos. Agregue las hierbas frescas picadas y retire del fuego.", "Para servir, coloque las tiras de pollo en un plato con las patatas y los tomates, y rocíe con la vinagreta."], "url": "www_bbc_co_uk_food_recipes_escalopechickenwitht_89354", "title": "Tiras de pollo a la brasa con patatas, tomates asados ​​agridulces y vinagreta de ketchup de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin hueso, sin piel", "10-12 hojas de salvia fresca, finamente picadas", "12 granos de pimienta negra, aplastados", "8 cucharadas de harina común", "2 huevos de gallinas camperas, golpeados", "150ml / 5fl de leche en oz", "Pan rallado fresco de 250 g / 9 oz", "180g / 6¼ oz de mantequilla sin sal", "½ limón, solo jugo", "aceite de oliva, para lloviznar", "salpicaduras de vinagre balsámico", "100g / 3½oz de hojas de rúcula silvestre", "80g / 3oz de parmesano recién rallado, para servir"], "method": ["Para los escalopes de pollo, empareda cada pechuga de pollo entre dos hojas de película adhesiva. Usando un rodillo, aplaste cada pechuga de pollo hasta que se haya ensanchado y adelgazado (esto se llama un escalope). Retire y deseche la película adhesiva. Sazone los escalopes de pollo con salvia picada y pimienta negra.", "Incline la harina en un tazón. Batir los huevos y la leche juntos en un recipiente aparte. Espolvoree las migas de pan en un plato.", "Dragar cada escalope de pollo en la harina y sacudir cualquier exceso. Sumerja cada escalope enharinado en la mezcla de huevo y leche, luego drague en el pan rallado hasta que esté completamente cubierto.", "Caliente la mitad de la mantequilla en una sartén a fuego medio a alto. Agregue dos de los escalopes de pollo empanados, en tandas, y fría por 4-6 minutos en cada lado, o hasta que las migas estén crujientes y doradas y el pollo esté bien cocido (los jugos se mantendrán limpios cuando se atraviese el pollo). la parte más gruesa con un pincho). Retire los escalopes empanados de la sartén y manténgalos calientes.", "Repita el proceso con la mayor parte de la mantequilla restante y los dos escalopes de pollo restantes. (Reserve un poco de la mantequilla restante).", "Caliente la mantequilla restante en la sartén a fuego medio. Cuando la mantequilla se haya tornado dorada pálida, exprime el jugo de limón y mezcla para combinar. Retire del fuego.", "Para la ensalada, en un tazón grande, mezcle el aceite de oliva y el vinagre balsámico, al gusto, hasta que estén bien combinados. Agregue las hojas del cohete y mezcle bien para cubrir las hojas en el aderezo.", "Para servir, coloque un escalope de pollo en el centro de cada uno de los cuatro platos. Vierta un poco de la mantequilla de limón sobre cada escalope. Coloque las hojas de rúcula vestidas al costado y espolvoree sobre el parmesano."], "url": "www_bbc_co_uk_food_recipes_escalopeofchickenwit_92046", "title": "Escalope de pollo con rúcula, salvia y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/escalopeofchickenwit_92046_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pargo rojo, eviscerado y a escala con la cabeza y la cola izquierda", "1 cucharadita de semillas de pimienta de Jamaica, molidas hasta obtener un polvo fino", "260ml / 9½fl oz de aceite vegetal, para freír", "300ml / 10fl oz de vinagre de malta", "1 cebolla grande, finamente cortada en medias lunas", "¼ Scotch bonnet chilli", "3 pimientos (1 rojo, 1 amarillo y 1 verde), cortados en tiras de 1cm / ½ in de espesor", "1 chocho grande (disponible en tiendas del Caribe), en rodajas y sin corazón", "manojo de tomillo fresco, hojas recogidas", "3 cebollas de primavera, en rodajas", "pizca de pimienta negra recién molida", "3 zanahorias medianas, peladas en cintas usando un pelador de verduras"], "method": ["Haga 2 cortes profundos en cada lado del pez. Espolvoree unas pizcas de pimienta molida en todo el pescado, frotándolo en los cortes y la cavidad del pescado.", "Caliente el aceite vegetal en una sartén grande, hasta que esté muy caliente. Baje suavemente el pescado en la sartén y déjelo freír por un lado durante 7-10 minutos, hasta que el pargo esté dorado y crujiente. Gire el pescado y cocine en el otro lado, moviéndolo suavemente para asegurar una cocción pareja. Hilvana con el aceite caliente. Gire nuevamente y hilvane si es necesario. Una vez cocinado, levante con cuidado de la sartén y déjelo escurrir sobre un plato forrado con papel de cocina. Deje descansar mientras prepara el escovitch.", "Vierta el vinagre en una cacerola grande. Agregue la cebolla, el chile, los pimientos, el chocho, el tomillo, las cebolletas, una pizca de pimienta molida y pimienta negra.", "Ponga el fuego a fuego alto, coloque una tapa en la sartén y deje hervir durante 10-15 minutos. Una vez que las verduras hayan comenzado a ablandarse, apague el fuego, agregue las cintas de zanahoria y deje que el calor de las verduras cocine las cintas por otros 5 minutos.", "Ponga algunas de las verduras en el fondo de un plato para servir de gran tamaño, coloque el pescado encima y luego coloque más verduras encima del pescado y vierta sobre el jugo, pero no sobre todo, el jugo. Se puede comer caliente o frío."], "url": "www_bbc_co_uk_food_recipes_escovitch_fish_40233", "title": "Escovich fish", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas, separados", "1 cucharadita de extracto de vainilla", "125 g / 4½ oz de azúcar en polvo", "pizca de sal", "Harina común 115g / 4oz", "1 cucharada de café espresso instantáneo en polvo", "400 ml / 14 fl oz crema doble", "250g / 9oz de mascarpone", "4 cucharadas de vodka", "4 cucharadas de licor de café", "Galletas amaretti de 60 g / 2 oz", "20 g / oz de cacao en polvo"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5 y alinee tres moldes para pasteles de 18cm / 7in con papel antigrasa.", "En un tazón grande, mezcle las yemas de huevo, la vainilla y la mitad del azúcar por 5 minutos, o hasta que estén muy pálidos.", "En un tazón de vidrio grande, bate las claras de huevo con un batidor eléctrico, agregando lentamente el azúcar restante y la sal hasta que tengan suaves picos. Doble suavemente los blancos en las yemas. Tamizar y doblar la harina.", "Llene las latas por igual con la mezcla y hornee durante 15 minutos, o hasta que estén firmes al tacto y doradas.", "Retire con cuidado las tortas de sus latas, deséchelas y déjelas enfriar en una rejilla.", "Mezcle el polvo de espresso con 200 ml / 7 fl oz de agua hirviendo, deje enfriar, luego cepille ambos lados de la esponja con el café.", "En un tazón mediano, con un batidor de mano, mezcle un poco de la crema con el mascarpone hasta que quede suave. Agregue el licor de crema, vodka y café restante, batiendo hasta que esté un poco tieso.", "Coloque las galletas amaretti con la mitad del cacao en polvo en un procesador de alimentos y mezcle para hacer una migaja.", "Para servir, coloque una capa de esponja en un bol pequeño de vidrio de 18 cm / 7 pulgadas, unte con la mitad de la mezcla de crema y cubra con la mitad de las migas de amaretti y cacao. Repita este proceso con una segunda capa de esponja, crema y migas. Termine con la esponja final y una capa de polvo de cacao."], "url": "www_bbc_co_uk_food_recipes_espresso_martini_85728", "title": "Espresso martini tiramisú", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/espresso_martini_85728_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["helado de vainilla o chocolate", "café exprés o café fuerte"], "method": ["Coloque el helado en tazones para servir.", "Vierta el café sobre el helado y sirva."], "url": "www_bbc_co_uk_food_recipes_espressoandicecreama_72309", "title": "Espresso y helado (escalfados)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve como se desee", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 500g / 1lb 2oz, más extra para enharinar", "150 g / 5½ oz de azúcar en polvo", "2 cucharaditas de levadura", "pizca de sal", "200ml / 7fl oz de leche caliente", "2 huevos de gallinas camperas, golpeados", "aceite, para engrasar", "azúcar glas, para servir", "100 g / 3½ oz de azúcar en polvo", "100g / 3½ oz de mantequilla ablandada", "100 g / 3½ oz de almendras molidas", "algunas gotas de extracto de almendra", "algunas gotas de agua de azahar (opcional)"], "method": ["Primero haz la masa de pan. Coloque la harina, el azúcar impalpable y la levadura en el recipiente de una batidora con una pizca de sal. Mezcle para combinar.", "Caliente la leche en una sartén hasta que esté tibia, luego mezcle con los huevos en una jarra. Con el motor en marcha, agregue gradualmente la leche y los huevos hasta que tenga una masa pegajosa y suave. Amasar con el gancho de masa hasta que la masa ya no sea pegajosa, sino suave y lisa.", "Transfiera a un tazón engrasado y cubra con un paño húmedo hasta que se haya levantado, esto debería tomar un par de horas.", "Alternativamente, haga a mano, coloque la masa sobre una superficie ligeramente enharinada y amasar hasta que quede lisa.", "Para el relleno de almendras, bata el azúcar y la mantequilla hasta que estén suaves y esponjosas, luego agrega las almendras, el extracto de almendras y el agua de azahar (si se usa).", "Transfiera la masa a una superficie de trabajo ligeramente enharinada y divídala en 16 pedazos. Mantenga los pedazos cubiertos con una toalla de té húmeda hasta que los necesite.", "Haga rodar cada pieza de masa en forma de bola, luego extiéndala a una ronda de entre 15-20cm / 6-8in de diámetro. Extienda con una cucharada de sopa de la mezcla de relleno y extiéndala, dejando un pequeño borde en todo el contorno. Enróllalo bien, luego rueda o masajea en una salchicha larga, de unos 25 cm de largo.", "Enrollar en una bobina, como una concha de caracol, metiendo el extremo exterior debajo. Asegúrate de hacer esto sin apretar demasiado, de lo contrario las bobinas intermedias no tendrán suficiente espacio para extenderse y empujarán hacia arriba.", "Repita y coloque más de dos bandejas para hornear y cubra con una toalla de té húmeda para probar durante una hora más o menos hasta que duplique su tamaño nuevamente.", "Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Hornear durante unos 12 minutos hasta que esté ligeramente dorado y cocido.", "Dejar enfriar y luego espolvorear con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_ensaimadas_22045", "title": "Ensaïmadas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 16", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55ml / 2fl de leche en oz", "Crema doble 450ml", "½ vaina de vainilla", "1 huevo", "4 yemas de huevo", "Azúcar en polvo de 55 g / 2 oz", "85g / 3oz de queso mascarpone", "3 cucharaditas de café instantáneo", "azúcar demerara para caramelizar"], "method": ["Traiga la leche, el café, la crema y la vainilla a punto de ebullición.", "En un recipiente aparte, mezcle el huevo, las yemas, el azúcar y el queso.", "Una vez que la leche esté cerca del punto de ebullición vierta sobre la mezcla de huevo, mezcle bien y cuele a través de un colador y de nuevo en la sartén. Vuelva a poner la mezcla sobre el fuego y bata constantemente hasta que comience a espesarse.", "Vierta la mezcla en vasos de martini o platos brulée y deje reposar en la nevera durante 3-4 horas.", "Una vez establecido, espolvorear la parte superior del brulée con azúcar y colocar debajo de una parrilla durante 2 minutos o usar un quemador de gas para colorear el azúcar y crear la cobertura brulée."], "url": "www_bbc_co_uk_food_recipes_espressocremebrle_68024", "title": "Creme brulee", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de café molido", "300g / 10½ oz de azúcar", "2 cucharadas de aguardiente", "450 g / 1lb de ciruelas pasas, secas y sin hueso"], "method": ["Disuelva el café en 125ml / 4fl oz de agua hirviendo, luego cuele.", "Agregue el azúcar, el brandy y 500 ml / 17 fl oz de agua y deje que hierva, revolviendo.", "Agregue las ciruelas pasas, lleve a ebullición y cocine a fuego lento bastante rápido durante 30-45 minutos hasta que el líquido sea espeso y almibarado. Servir."], "url": "www_bbc_co_uk_food_recipes_espressoprunes_13913", "title": "Ciruelas espresso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pequeños corderos", "2 cucharadas de harina normal", "2 cucharadas de aceite vegetal", "2 cebollas pequeñas, finamente picadas", "1 cucharada de bayas de enebro, ligeramente trituradas", "2 limones no encerados, solo ralladura", "tira de cáscara de naranja", "4 hojas de laurel", "pequeño racimo de perejil", "2 patatas grandes, cortadas en cubitos", "4 zanahorias, cortadas en rebanadas de 1cm / ½ en diagonal", "800 ml / 1½ pinta de cordero o caldo de pollo", "1 naranja, solo jugo", "2 cucharadas de crema agria", "sal y pimienta negra recién molida", "400 g / 14 oz de ñoquis preparados, cocinados según las instrucciones del paquete (opcional)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Ponga los corderos en una bolsa grande y agregue la harina. Cierre y agite, para que la harina cubra completamente el cordero.", "Caliente 1 cucharada de aceite en una sartén grande de fondo grueso. Escudriñar las patas de cordero en todos los lados hasta que estén doradas y ligeramente crujientes.", "Mientras tanto, caliente el aceite restante en una cazuela grande con tapa, agregue las cebollas y saltee durante varios minutos hasta que estén suaves. Agregue las bayas de enebro, zests de limón y naranja, hojas de laurel y 2 ramitas grandes de perejil. Revuelva por un minuto o dos, luego agregue las patas de cordero, en sus lados si es posible. Agregue las papas y las zanahorias.", "De glasear la sartén utilizada para dorar el cordero con un poco de caldo y agregar a la cazuela, luego vierta el caldo restante y llevar a ebullición. Agregue el jugo de naranja y sazone con sal y pimienta. Cubra y transfiera al horno. Cocine por una hora y media, luego quite la tapa y cocine por otros 30 minutos.", "Vuelva a colocar la cacerola en la placa y quite las patas de cordero, las ramitas de perejil y las hojas de laurel. Agregue la crema agria y revuelva hasta que esté bien combinada. Corta finamente las hojas del perejil restante y revuelve. Devuelve las espigas a la cazuela y sírvelas con los gnocchi."], "url": "www_bbc_co_uk_food_recipes_estonian_lamb_shanks_37085", "title": "Asta de cordero estonia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/estonian_lamb_shanks_37085_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 nidos de merengue", "Fresas de 300g / 10½oz, reducidas a la mitad", "300 ml / 10 fl oz oz yogur"], "method": ["Pop el merengue se anida en una bolsa de congelador y frótelos hasta romperlos en pedazos.", "Mash la mitad de las fresas con la parte posterior de un tenedor hasta casi suave.", "Ponga los ingredientes en vasos para servir. Comience con algunas fresas, junto con una cucharada de sus jugos. Mezcle la mitad de los merengues triturados a través del yogur y agregue algo de esto.", "Cubra con un poco más de fruta y algunos de los merengues triturados. Repita hasta que se hayan agotado todos los ingredientes y los vasos estén llenos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eton_mess_57705", "title": "Encendedor Eton lío", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eton_mess_57705_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas 250g / 9oz, aplastadas", "100 g / 3½ oz de mantequilla sin sal, derretida, más extra para engrasar", "300 ml / 10 fl oz doble crema", "100g / 3½oz de azúcar glasé", "1 cucharada de pasta de frijoles de vainilla", "600g / 1lb 5oz de queso crema con toda su grasa", "18g / ¾oz de piezas de fresa liofilizadas", "Fresas de 200g / 7oz, cascadas", "15 g / ½ onza de azúcar glasé", "1 cucharadita de jugo de limón", "50g / 1¾oz de claras de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "colorante de comida roja", "15 fresas", "100g / 3½oz de chocolate blanco, roto en pedazos", "10 rodajas de fresas deshidratadas, espolvoreadas con polvo de brillo dorado (opcional)"], "method": ["Engrase una lata de torta redonda de fondo suelto de 23 cm / 9 pulg. Y forre con papel para hornear.", "Para la base, coloque los bizcochos triturados en un bol con la mantequilla derretida y mezcle. La mezcla debe parecerse a la arena mojada. Vierta en la lata de la torta y empaquete apretadamente con el dorso de una cuchara, luego cúbrala y colóquela en la nevera por 15 minutos.", "Vierta la crema en un tazón grande, agregue el azúcar glas y la vainilla y bata en suaves picos. Pon el queso crema en otro recipiente y revuelve para aflojar.", "Agregue la mezcla de crema y las piezas de fresa liofilizadas al queso crema y dóblelas suavemente. Cuchara en la base refrigerada y nivelar. Vuelve a poner la tarta de queso en la nevera.", "Para la salsa de fresa, ponga las fresas, el azúcar glas y el jugo de limón en un procesador de alimentos y llénelos a un puré. Transfiera a un tazón y ponga en la nevera.", "Para preparar los mini merengues, precaliente el horno a 120C / 100C Fan / Gas ½. Alinee una bandeja para hornear con papel de hornear. Coloque una manga pastelera con una boquilla de estrella de 1½ cm / ½ pulgada y gírelo del revés. Colóquelo en un vaso alto o jarra hasta que lo necesite.", "Coloque las claras de huevo en un tazón grande de vidrio limpio y bata con un batidor eléctrico o un mezclador de pie. Después de 2 minutos, la mezcla debe ser espumosa y aumentar en volumen. Comience a agregar el azúcar un poco a la vez. Una vez que haya agregado todo el azúcar, siga batiendo hasta que tenga picos rígidos.", "Con un pincel y colorante rojo para alimentos, pinte con rayas rojas el interior de la manga pastelera, comenzando con la punta y pintando solo hasta que llene la bolsa. Llena la bolsa con la mezcla de merengue y coloca pequeños besitos en la bandeja.", "Hornea los merengues durante 1 hora. Apague el horno, deje la puerta abierta y deje los merengues en el horno durante una hora más. Sácalos del horno y sácalos del papel.", "Para las fresas bañadas en chocolate blanco, derrita suavemente el chocolate en un tazón sobre una fuente de agua hirviendo (no permita que el recipiente toque el agua). Usando la misma bandeja en la que hizo los merengues, voltee el papel. Sostén las fresas por el tallo y sumérgelas en el chocolate blanco para llegar a tres cuartas partes del camino hacia arriba. Colóquelo en la bandeja para colocarlo; puede ponerlos en el refrigerador para acelerar la configuración.", "Saca la tarta de queso de la nevera, retírala de la lata y colócala en una tabla de servir. Justo antes de servir, vierta la salsa suficiente para cubrir la parte superior, puede que no lo necesite todo. Cubra con las fresas bañadas, los merengues y las rodajas de fresas deshidratadas y lustradas."], "url": "www_bbc_co_uk_food_recipes_eton_mess_cheesecake_58338", "title": "Eton lío cheesecake", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eton_mess_cheesecake_58338_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 claras de huevo de gallinas camperas", "Azúcar blanco de 400 g / 14oz", "Fresas de 400g / 14oz, 300g / 11oz más o menos picadas, el resto entero", "2 cucharadas de azúcar glas", "600 ml / 1 pizca de crema doble a 1 fl oz", "1 vaina de vainilla, división y semillas raspadas", "150 g / 5 oz de azúcar en polvo", "2 cucharadas de agua"], "method": ["Para el merengue, precaliente el horno a 100C / 200F / Gas ¾. Línea tres bandejas para hornear con papel antigrasa.", "Batir las claras de huevo en un bol hasta que se formen picos suaves cuando se quita el batidor.", "Poco a poco bata el azúcar hasta que esté tieso y brillante.", "Coloque la cuchara en una manga pastelera equipada con una pequeña boquilla simple.", "Dibuja tres círculos de 23 cm en el papel a prueba de grasa, luego divide el merengue restante entre los círculos y extiende la mezcla hasta que se llenen los círculos.", "Hornee en el horno durante 20 minutos, luego apague el horno y deje los merengues en el horno durante al menos 2 horas o hasta que estén crujientes. Retirar del horno y reservar para enfriar.", "Para el relleno, mezcle 150 g / 5½ oz de las fresas picadas con el azúcar glas en un procesador de alimentos y pase a través de un colador en un tazón.", "Batir la crema doble a los picos suaves y doblar en las semillas de vainilla y puré de fresa. Dobla las fresas picadas restantes.", "Calentar una sartén hasta que esté caliente, agregar el azúcar y agua y calentar hasta que el azúcar se vuelva de color caramelo intenso. Coloque la base de la sartén en una fuente de agua fría para evitar que el caramelo se cocine más.", "Con cuidado sumerja todas las fresas en el caramelo y colóquelas en un plato. (Precaución: el caramelo estará muy caliente.)", "Para armar la torta, coloque un círculo de merengue en un plato de servir. Ponga una cucharada sobre la mezcla de crema y extiéndala para cubrir el merengue. Repita con otro plato de merengue y una capa de crema, terminando con el círculo de merengue restante. Rocíe el caramelo líquido restante sobre la parte superior del merengue y decore con las fresas bañadas en caramelo."], "url": "www_bbc_co_uk_food_recipes_eton_mess_torte_15363", "title": "Eton lío torte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800 g / 1 libra de fresas maduras de 12oz, sin cáscara", "splash kirsch", "1-2 cucharadas de azúcar glas, al gusto", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl oz crème fraîche o yogur grueso de estilo griego", "6 conchas de merengue preparadas", "2 maracuyá, solo pulpa"], "method": ["Corta las fresas más grandes en mitades o cuartos.", "Reserve un cuarto de las fresas para decorar y coloque el resto en un tazón grande.", "Agregue un toque de kirsch y 1-2 cucharadas de azúcar glas al gusto.", "Ligeramente machaque las fresas con un tenedor grande o un triturador de papas. Cubra con película adhesiva y coloque en la nevera para enfriar durante una hora.", "Batir la crema ligeramente y doblar en la crème fraîche o yogur.", "Usando sus manos, aplaste los merengues aproximadamente en pedazos del tamaño de un bocado sobre el bol de la mezcla de crema, luego doble suavemente la mezcla.", "Doble las fresas trituradas y la pulpa de la fruta de la pasión, para crear un efecto ondulado.", "Coloque la mezcla de crema y merengue en vasos transparentes y adorne con las fresas reservadas."], "url": "www_bbc_co_uk_food_recipes_etonmess_89422", "title": "Eton lío con fruta de la pasión", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 tallo de ruibarbo, cortado, pelado y finamente picado", "115 g / 4 oz de azúcar en polvo", "1 vaina de vainilla, dividida por la mitad", "4 cucharadas de crema doble", "1 nido de merengue listo para usar, aplastado", "azúcar glas, al polvo"], "method": ["Coloque el ruibarbo, el azúcar impalpable y la vaina de vainilla en una sartén pequeña de base pesada a fuego lento.", "Cocine suavemente durante 8-10 minutos, hasta que el ruibarbo esté tierno, pero aún mantenga su forma.", "Transfiera la mezcla de ruibarbo a un recipiente y deje que se enfríe. Deseche la vaina de vainilla.", "Mientras tanto, batir la crema hasta que se formen picos suaves cuando se quite la batidora, luego doblar cuidadosamente en el nido de merengue triturado.", "Para servir, espolvoree el ruibarbo frío en un vaso alto y cubra con la crema y la mezcla de merengue. Polvo con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_etonmess_87719", "title": "Desastre de Eton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 fresa de cilantro", "una pizca de azúcar", "una pizca de puerto", "merengues, rotos", "crema, suavemente batida"], "method": ["Mash las fresas con un poco de azúcar y el puerto, y doblar en merengues rotos y crema suavemente batida."], "url": "www_bbc_co_uk_food_recipes_etonmess_67916", "title": "Desastre de Eton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/etonmess_67916_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 150ml / ¼ pt, batida hasta que se formen picos suaves", "75g / 2½oz de copos de maíz", "3 cucharadas de bayas mixtas congeladas, descongeladas", "ramita de menta fresca", "100 g / 3½ oz de bayas mixtas congeladas, descongeladas", "1 lima, solo jugo", "1 cucharada de azúcar glas"], "method": ["Coloque la crema batida doble, los copos de maíz y las dos cucharadas de bayas mezcladas en un tazón grande y mezcle bien.", "Vierta la mitad de la mezcla de crema en un vaso alto.", "Para hacer el coulis, coloque las bayas mezcladas, el jugo de lima y el azúcar glas en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Pase la mezcla de bayas a través de un colador fino.", "Coloque dos cucharadas de coulis sobre la mezcla de crema en el vaso.", "Vierta el resto de la mezcla de crema en el vaso y luego rocíe con otra cucharada de coulis.", "Para servir, decore con la cucharada restante de bayas mezcladas y una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_etonmesswithberrycou_83245", "title": "Eton mess con berry coulis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ cucharadita de semillas de cilantro", "¼ cucharadita de semillas de comino", "¼ cucharadita de pimienta negra molida", "¼ cucharadita de copos de chile", "1 naranja, ralladura y jugo", "1 rebanada de pan", "1 filete de pierna de cordero", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ cebolla, picada", "1 cucharadita de cúrcuma molida", "Arroz basmati 150 g / 5½ oz, lavado y escurrido", "100ml / 3½ fl oz crema doble", "pequeñas hojas de cilantro fresco, toscamente picadas", "sal y pimienta negra recién molida", "racimo pequeño de menta fresca, cilantro, perejil y ciboulette", "½ cucharadita de copos de chile", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el cordero con costra, coloque las especias, la ralladura de naranja y el pan en un procesador de alimentos y pulse hasta que se rompa en migas. Agregue un chorrito de jugo de naranja para unir si es necesario.", "Frote el cordero con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Calentar una sartén a prueba de horno y freír el cordero durante dos minutos por cada lado.", "Con cuidado, presione la mezcla de migas de pan en el lado superior del cordero y transfiera la sartén al horno durante 4-6 minutos o hasta que esté cocida a su gusto. Reserve para descansar durante cinco minutos.", "Para el risotto, caliente el aceite de oliva en otra sartén antiadherente y agregue la cebolla y la cúrcuma. Sofría la cebolla hasta que esté suave pero no coloreada.", "Agregue el arroz basmati a la sartén y fría por dos minutos, revolviendo continuamente.", "Agregue la crema doble al arroz y deje hervir suavemente, revolviendo regularmente.", "Reduzca el fuego y cocine a fuego lento durante 8-10 minutos, o hasta que el arroz esté tierno.", "Agregue el cilantro fresco y sazone con sal y pimienta negra recién molida.", "Para el aceite de menta y ají, coloque todos los ingredientes en un procesador de alimentos pequeño y mezcle para combinar.", "Para servir, coloque el risotto en un plato, cubra con el cordero y rocíe el aceite de menta y ají."], "url": "www_bbc_co_uk_food_recipes_etuate_86970", "title": "Cilantro, chili y cordero con costra de comino servido con risotto con especias y menta y aceite de ají", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "50 g / 1 oz de azúcar en polvo", "8 g de levadura activa seca", "10 g / ¼ oz de sal", "¾ cucharadita de especias mixtas", "1 cucharadita (aprox. 12) de vainas de cardamomo verde, ligeramente trituradas, sin semillas y sin tierra", "6 huevos de gallinas camperas (deben pesar 350g / 12 oz)", "250g / 9oz de mantequilla suave sin sal, cortada en cubos pequeños", "100 g / 3½ oz de sultanas", "2 cucharadas de agua de flor de naranja", "100 g / 3½ oz de pistachos picados", "1 naranja, ralladura solamente, rallado", "Mazapán sin teñir 200g / 7oz, cortado en cuadrados de 1cm / ½ en", "1 huevo de gallinas camperas, mezclado con una pizca de sal para lavar huevos", "2 naranjas, cáscara de ambos, jugo de uno", "1 limón, solo jugo", "pizca de sal", "170 g / 6 oz de azúcar en polvo", "85g / 3oz de mantequilla sin sal", "3 huevos de gallinas camperas, ligeramente golpeados", "1 cucharada de licor de naranja", "1 naranja, solo jugo", "300g / 10½oz de azúcar glasé fondant, más extra para espolvorear", "almendras copos tostadas", "pistachos picados", "estrellas de oro comestibles (disponible en línea)", "Listo enrollado rojo y verde Fondant azúcar glas para formar bayas y hojas de acebo (solo se necesita una pequeña cantidad)"], "method": ["Haga la masa brioche el día antes de servir. Para la masa, coloque la harina, el azúcar, la levadura, la sal y las especias en el tazón de un mezclador de pie con el gancho para masa ajustado.", "Agregue los huevos y amase a baja velocidad durante cinco minutos.", "Raspe los lados del tazón, luego amase a velocidad media durante 10 minutos. La masa será lisa, elástica y bien amalgamada.", "Comience a agregar la mantequilla a la masa unas pocas piezas a la vez, mientras se mezcla a baja velocidad. Cuando se haya agregado toda la mantequilla, trabaje la masa a mayor velocidad durante 6-10 minutos hasta que la masa esté lisa, brillante y elástica y salga de los lados del recipiente.", "Cubra la masa y déjela en un lugar fresco durante la noche (10-12C / 50-54F es lo mejor).", "Remoje las sultaninas en el agua de la flor de naranja, para el relleno, y déjelas durante la noche también.", "Al día siguiente, deje que la masa vuelva a la temperatura ambiente y termine de probar.", "Estirar la masa en un cuadrado y esparcir sobre las pasas sultanas, los pistachos, la ralladura de naranja y el mazapán remojados.", "Divida la masa en piezas de aproximadamente 90 g / 3¼ oz y forme bolas.", "Mantene generosamente una lata de tarta de 28cm / 11in y cuatro moldes de brioche pequeños.", "Coloque 11 bolas en un círculo en el plato para pastel, ligeramente separadas.", "Forme la masa restante en cuatro brioche à tête presionando con el borde de su mano en la bola a dos tercios de distancia y \"cortando\" la masa para formar una cabeza pequeña. Levante la cabeza para estirarla del \"cuerpo\", luego presione la cabeza hacia el cuerpo. Coloque el brioche en forma en los moldes con mantequilla.", "Cubra la masa y déjela probar durante hasta 2½ horas.", "Precalentar el horno a 190C / 375F / Gas 5.", "Cepille el brioche con huevo y hornee los bollos y la corona por 10 minutos a 190C / 375F / Gas 5. Reduzca la temperatura del horno a 180C / 350F / Gas 4 y continúe horneando el pequeño brioche durante cinco minutos más, hasta que se dore marrón, luego retírelo del horno. Cuando el pequeño brioche salga del horno, cubra la corona con papel de aluminio y continúe horneando de 15 a 20 minutos más. Retire del horno cuando esté dorado oscuro.", "Retire el brioche de las latas y enfríelo en una rejilla de alambre.", "Para la cuajada de naranja, caliente los jugos, la ralladura, la sal, el azúcar, la mantequilla y los huevos en una cacerola pesada, o en un baño María, a fuego lento. Revuelva la mezcla constantemente hasta que se espese y cubra la parte posterior de una cuchara.", "Tamizar la cuajada de naranja y agregar el licor de naranja y dejar en la nevera para reafirmar.", "Cuando la cuajada de naranja se haya enfriado, corte un cono del brioche à tête y coloque una pequeña cantidad de cuajada en cada brioche. Devuelva las tapas de brioche y el polvo con azúcar glas.", "Mezcle el jugo de naranja con el azúcar glas para hacer glaseado. Rocíe el glaseado de naranja sobre la corona en un patrón al azar y espolvorear con las almendras copos tostadas, pistachos y decorar con estrellas de oro comestibles y decoraciones de glaseado verde y rojo.", "Mezcle el jugo de naranja con el azúcar glas para hacer glaseado. Rocíe el glaseado de naranja sobre la corona en un patrón al azar y espolvorear con las almendras copos tostadas, pistachos y decorar con estrellas de oro comestibles y decoraciones de glaseado verde y rojo."], "url": "www_bbc_co_uk_food_recipes_european_christmas_86114", "title": "Corona de Navidad europea", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]