[{"ingredients": ["150ml / ¼ pinta de caldo de verduras calientes", "2 cucharaditas de puré de tomate", "2 cucharaditas de ketchup de tomate", "200g / 7oz de cuscús", "60g / 2½oz de tomates cherry, cortados por la mitad", "puñado de perejil fresco, picado", "puñado de albahaca fresca, picada", "sal y pimienta negra recién molida", "175g / 6oz de hojaldre listo para enrollar", "8 hojas de albahaca, frotadas con aceite de oliva", "Registro de 85g / 3oz de queso de cabra", "1 huevo de gallinas camperas, golpeado", "sal marina, para rociar"], "method": ["Para el cuscús de tomate, coloque el caldo de verduras, el puré de tomate y el ketchup de tomate en una olla pequeña y deje que hierva.", "Coloque el cuscús en un tazón grande y vierta sobre la mezcla madre para cubrir el cuscús. Cubra con una película adhesiva y déjela reposar durante cinco minutos.", "Retire la película adhesiva y separe los granos de cuscús con un tenedor. Agregue los tomates cherry y las hierbas, condimente al gusto, con sal y pimienta negra recién molida y mezcle bien.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el rollo de queso de las cabras, coloque la masa de hojaldre en un tablero. Coloque las hojas de albahaca en el centro de la masa y cubra con el registro de queso de cabra.", "Cepille los bordes de la masa con huevo batido, luego enrolle para sellar el queso de cabra dentro de la masa. Cepille la parte superior de la masa con más huevo batido y espolvoree con sal marina.", "Coloque el rollo de pastelería en una bandeja para hornear antiadherente, transfiéralo al horno y hornee durante 12-14 minutos, o hasta que la masa esté hinchada y dorada en la parte superior. Rebana por la mitad.", "Para servir, coloque cantidades iguales de cuscús en dos platos para servir y coloque la mitad del rollo de queso de las cabras encima de cada uno."], "url": "www_bbc_co_uk_food_recipes_tomatocouscouswithgo_86058", "title": "Cuscús de tomate con queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1 libra de tomates cherry", "sal marina y pimienta negra recién molida", "4 dientes de ajo, en rodajas", "12 ramitas de tomillo fresco", "250ml / 9fl oz de aceite de oliva virgen extra", "2 cucharadas de vinagre de jerez", "Aceitunas verdes de 250g / 9oz, piedras quitadas", "1 cucharada de alcaparras, enjuagadas y escurridas", "1 limón, solo jugo", "1 diente de ajo, picado", "1 pan de focaccia, cortado en tiras largas de 15cm / 6 pulgadas", "aceite de oliva", "puñado de virutas de parmesano frescas"], "method": ["Precalentar el horno a 120C / 250F / Gas ¼.", "Coloque los tomates en una fuente para hornear no reactiva y sazone bien con sal y pimienta negra recién molida.", "Espolvorea sobre el ajo y el tomillo.", "Rocíe el aceite y transfiéralo al horno para asar durante una hora.", "Retire del horno, rocíe los tomates con el vinagre, luego reserve.", "Para tapenade, coloque las aceitunas verdes, las alcaparras, el jugo de limón y el ajo en una licuadora pequeña y pulse hasta obtener una pasta áspera.", "Para la tostada, cepille las tiras de focaccia con aceite de oliva, luego coloque sobre una sartén de plancha muy caliente. Cocine por 2-3 minutos en cada lado, hasta que las líneas de la plancha aparezcan en ambos lados.", "Para servir, coloque una tira de pan en un plato y unte con una cucharada de tapenade. Repita con las tiras de pan tostado restantes hasta que se haya agotado toda la tapenade.", "Cubra cada tira de pan tostado con una cucharada de tomates y termine con virutas de parmesano."], "url": "www_bbc_co_uk_food_recipes_tomatoesontoastwithg_89568", "title": "Tomates en pan tostado con tapenade de aceitunas verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, pelados, dejados enteros", "pequeño racimo de perejil fresco, solo hojas", "85g / 3oz de nueces picadas", "500ml / 18fl oz de aceite de colza", "pizca de sal", "Filete de salmón cocido sobrante de 350g / 12oz, en copos", "2 cucharadas de salmón ahumado rallado", "1 cucharada de mayonesa lista para usar", "1 diente de ajo, aplastado", "1 cucharada de ketchup de tomate", "salpicaduras de vinagre balsámico", "4 tomates grandes y firmes, cortados por la mitad de arriba a abajo, semillas retiradas y reservadas", "sal y pimienta negra recién molida", "Frijoles franceses de 150g / 5oz, recortados", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "2 chalotas pequeñas, en rodajas"], "method": ["Para el aceite de perejil, mezcle el ajo, el perejil y las nueces lo más finamente posible en un procesador de alimentos, luego agregue gradualmente el aceite en una corriente delgada, mezclándolo continuamente, hasta que esté suave y bien combinado. Sazonar, al gusto, con sal. Dejar de lado hasta que sea necesario.", "Para los tomates disecados, en un tazón grande, mezcle el salmón copos, el salmón ahumado, la mayonesa, el ajo, el ketchup y el vinagre balsámico hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Rellene las mitades de tomate con la mezcla de relleno. Dejar de lado.", "Para la ensalada de judías verdes y chalotes, blanquear los frijoles en una olla grande de agua hirviendo con sal durante 1-2 minutos. Escurrir bien y correr bajo un grifo frío para refrescar.", "En un recipiente, mezcle el aceite, el vinagre y la mostaza hasta que estén bien combinados. Agregue los frijoles blancos y los anillos de chalote y revuelva para cubrirlos en el aderezo. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque dos mitades de tomate rellenas, corte los lados hacia abajo, en cada una de las cuatro placas de servir. Rocíe el aceite de perejil. Coloque la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_tomatoes_stuffed_with_16590", "title": "Tomates rellenos de salmón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2kg / 4lb 6½ oz de tomates cherry", "1 bebé hinojo, en rodajas", "1 diente de ajo, finamente cortado", "½ barra de apio, picada", "½ chalote de plátano, finamente cortado", "1 ramita de albahaca fresca", "1 ramita de tomillo fresco", "1 ramita de flores frescas de ajo o flores de cebollino", "4-6 gotas de salsa Tabasco", "1 cucharada de salsa Worcestershire", "2-3 guiones angostura amargos"], "method": ["Coloque todos los ingredientes en un tazón y mezcle.", "Coloque la mezcla, en lotes, en un procesador de alimentos y pulse cinco veces durante 1-2 segundos cada vez. Transfiera el puré en un tazón grande y repita hasta que todos los vegetales hayan sido purgados.", "Cubra el recipiente con film transparente y enfríe en la nevera durante seis horas.", "Alinee un tazón limpio con una pieza grande de muselina y una cuchara en la mezcla de tomate. Dibuja las esquinas de la tela de muselina y agárrate bien. Pase la bolsa de muselina por encima del tazón para atrapar los jugos colados. Deje que se forme durante la noche. (No tengas la tentación de apretar la muselina).", "Una vez colado, cubra y refrigere hasta que sea necesario."], "url": "www_bbc_co_uk_food_recipes_tomatoessence_92958", "title": "Esencia de tomate", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Rinde 800 ml / 1 pinta 9 fl oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 rebanadas de jamón de Parma", "6 grandes tomates ciruela italianos", "300g / 11oz de queso blando", "Hojas de albahaca de 100g / 4oz", "6 higos grandes, pelados", "Aceite de oliva virgen extra italiano", "sal y pimienta recién molida al gusto", "palos grissini"], "method": ["Corta los tomates por la mitad, colócalos en una bandeja para hornear. Rocíe aceite de oliva virgen extra en la parte superior y sazone con sal y pimienta. Grill durante aproximadamente 5 minutos y luego dejar enfriar.", "Corta finamente las hojas de albahaca y mezcla con el queso blando con una pizca de sal y pimienta.", "Cortar los higos aproximadamente ½ cm / ¼ de grosor.", "Pon una loncha de jamón de Parma en una tabla de cortar. Coloque 1 medio tomate en el medio y luego ponga 1 rebanada de higo en la parte superior. Coloque 1 cucharadita de queso blando encima de la higuera y el tomate y luego enrolle suavemente el jamón de parma sobre el relleno asegurándose de que el jamón se enrolle firmemente para mantener el relleno cerrado.", "Coloque tres Rotolo di Prosciutto en un plato, rocíe con aceite de oliva virgen extra y sirva con palitos grissini italianos y un vaso de vino blanco frío."], "url": "www_bbc_co_uk_food_recipes_tomatofigsandsoftche_70264", "title": "Tomate, higos y queso blando enrollado en jamón de Parma (rollo de proscuitto)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "½ cebolla pequeña, pelada, picada", "1 diente de ajo, pelado, aplastado", "2 cucharadas de piñones", "pizca de chile en polvo", "pellizcar jengibre molido", "pizca de cayena", "1 cucharada de puré de tomate", "Filete de salmón de 55 g / 2 oz, sin piel, picado", "1 tomate de carne de vacuno maduro, parte superior en rodajas, ahuecado con una cuchara, semillas descartadas", "1 puñado de hojas frescas de albahaca", "2 cucharadas de piñones, tostados", "4 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita la mantequilla en una sartén a fuego medio y fría la cebolla y el ajo durante 3-4 minutos, hasta que se ablanden. Agregue los piñones, el chile en polvo, el jengibre molido, la pimienta de cayena, el puré de tomate y el salmón y mezcle bien. Cocine por otros 2-3 minutos.", "Llene el tomate vaciado con la mezcla de relleno y colóquelo en una bandeja para hornear.", "Hornee el tomate relleno en el horno precalentado durante 5-7 minutos, o hasta que se ablande.", "Mientras tanto, para el aderezo pistou, coloque todos los ingredientes del aderezo pistou en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, coloque el tomate cocido en el centro de un plato de servir. Rocíe el pistou vestirse alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_tomatofilledwithsalm_92461", "title": "Tomate relleno de salmón y piñones, con aderezo de pistou", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina lisa fuerte, más extra para quitar el polvo", "10g / ½ oz de levadura fresca", "2 cucharaditas de sal", "400 g / 14 oz pueden cortar tomates, bien drenados", "sal y pimienta negra recién molida", "pequeñas hojas de albahaca fresca", "pequeñas hojas de tomillo puñado, opcional", "200g / 7oz de queso mozzarella de búfala, roto", "pequeño puñado de aceitunas negras deshuesadas, opcional", "aceite de oliva virgen extra, para lloviznar"], "method": ["Para la base, tamiza la harina en un tazón grande. En otro recipiente, mezcle la levadura con un poco de agua tibia hasta que empiece a formar espuma. Lentamente agregue a la harina y mezcle para formar una masa. Si es demasiado pegajoso, agrega más harina. Cubra el recipiente con un paño limpio y déjelo reposar durante cinco minutos.", "Agregue la sal a la masa, luego coloque en una superficie ligeramente enharinada y amasar durante unos diez minutos hasta que quede suave. Cubra con un paño húmedo y deje que se demuestre durante 30 minutos.", "Precalentar el horno a su configuración más alta. Cortar la masa por la mitad y amasar durante un minuto más o menos, asegurándose de que realmente lo detenga.", "Presione la masa muy finamente para hacer dos círculos de aproximadamente 40 cm de ancho, dejando los bordes ligeramente más gruesos, como el borde de un plato. Coloque los círculos de masa en bandejas para hornear enharinadas.", "Para el aderezo, sazone los tomates con sal y pimienta negra recién molida y extiéndalos sobre cada base de masa (probablemente no necesitará toda la lata). Espolvoree sobre las hojas de albahaca, las hojas de tomillo, si se usa, y la mozzarella, sazone con sal y pimienta negra recién molida y rocíe sobre un poco de aceite. Dispersión sobre las aceitunas, si se usa.", "Coloque las pizzas en el horno y hornee durante 8-10 minutos, o hasta que la base esté crujiente y el queso burbujee."], "url": "www_bbc_co_uk_food_recipes_tomatomozzarellaandb_87868", "title": "Pizza de tomate, mozzarella y albahaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatomozzarellaandb_87868_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 tomates cherry, cortados a la mitad", "1 rebanada gruesa de queso mozzarella", "2 cucharadas de aceite de oliva", "2 cucharadas de albahaca fresca picada"], "method": ["Coloque los tomates cherry en un plato.", "Caliente el aceite en la sartén y cuando esté caliente, agregue la mozzarella y fría por un minuto en cada lado, hasta que se dore.", "Para servir, coloque la mozzarella encima de los tomates y espolvoree con albahaca."], "url": "www_bbc_co_uk_food_recipes_tomatomozzarellasala_84154", "title": "Ensalada de mozzarella de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas gruesas de pan", "1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "½ pimiento amarillo, sin semillas y en rodajas", "4 mini bolas de mozzarella", "puñado de albahaca fresca", "4 tomates cherry, cortados por la mitad", "sal marina y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta.", "Cepille el pan con el aceite y frote el ajo.", "Coloque los ingredientes restantes en el pan, sazone y coloque debajo de la parrilla durante 2 a 3 minutos, hasta que el queso esté burbujeante. Servir."], "url": "www_bbc_co_uk_food_recipes_tomatopepperandauber_77216", "title": "Crostini de tomate y pimiento amarillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aceite para freír", "1 cebolla, en rodajas", "1 diente de ajo, aplastado", "1 chile rojo, finamente picado", "800g / 1lb 12oz de tomates picados", "200ml / 7fl oz de vinagre de vino tinto", "200g / 7 oz de azúcar", "sal y pimienta negra recién molida", "30 g / 1½ oz de alcaparras en vinagre, enjuagadas", "Pepinillos para bebés de 30g / 1½oz, picados", "puñado de cilantro fresco"], "method": ["Calentar el aceite en una sartén y freír la cebolla, el ajo y el chile hasta que estén suaves.", "Agregue los tomates y mezcle bien.", "Agregue el vinagre y el azúcar y deje que hierva. Cocine a fuego lento durante 30 minutos y sazone con la sal y la pimienta negra recién molida. El gusto debería ser la consistencia del atasco.", "Agregue las alcaparras y los pepinillos y el cilantro picado. Agregue más condimentos si es necesario."], "url": "www_bbc_co_uk_food_recipes_tomatorelish_81521", "title": "Salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más extra para lloviznar", "½ cebolla, finamente picada", "¼ diente de ajo, aplastado", "200g / 7oz de arroz risotto, como carnaroli", "Sal y pimienta negra recién molida", "150g / 5oz de calabaza, pelada y cortada en cubos de 1cm / ½ en cubitos", "300ml / 10½fl oz de agua", "Esencia de tomate 300ml / 10½fl oz o pasado", "10 tomates cherry, cortados a la mitad", "2 calabacines para bebés, cortados a la mitad longitudinalmente y cortados en trozos de 1 cm / ½ en gruesos", "1 bebé hinojo, en rodajas", "½ cucharadita de semillas de cilantro, ligeramente trituradas", "Guisantes 80g / 3oz", "2 cucharadas de queso mascarpone", "4 cucharaditas de parmesano recién rallado, más extra para rociar", "4 cucharadas de hojas de ensalada de bebé"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente una sartén a fuego medio, agregue el aceite de oliva y fría la cebolla durante 3-4 minutos o hasta que esté tierna. Agregue el ajo y fría por un minuto más.", "Agregue el arroz, revolviendo bien para cubrir el aceite de oliva. Freír por 1-2 minutos, o hasta que el arroz sea translúcido. Sazonar con sal y pimienta negra recién molida.", "Agregue la calabaza a la sartén y mezcle bien. Agregue el agua y la mitad de la esencia de tomate, luego cocine a fuego lento. Cubra con una tapa y cocine por 15 minutos.", "Coloque la esencia de tomate restante en una olla y caliente.", "Mientras tanto, coloque los tomates cherry a la mitad en una bandeja para hornear, rocíe con un poco de aceite de oliva y sazone con sal y pimienta negra recién molida. Asar en el horno durante 5-6 minutos, o hasta que los tomates estén tiernos y colapsados ​​levemente.", "Por ahora, el arroz debería haber absorbido todo el líquido. Retire la tapa y revuelva bien. Agregue los calabacines, el hinojo baby y las semillas de cilantro y cocine por un par de minutos. Agregue los guisantes, el mascarpone y el parmesano y revuelva bien, añadiendo un poco de esencia extra de tomate si el risotto está demasiado seco.", "Para servir, vierta el risotto en un tazón pequeño. Cubra con algunos tomates asados, una pizca de parmesano y algunas hojas micro. Cuchara sobre la esencia de tomate caliente."], "url": "www_bbc_co_uk_food_recipes_tomatorisotto_92965", "title": "Risotto de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatorisotto_92965_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 grandes Coeur de Boeuf o tomates de bistec, cortados en rodajas gruesas", "1 cebolla roja, finamente rebanada", "1 chalote, finamente picado", "1 diente de ajo, aplastado", "1 cucharada de mostaza Dijon", "3 cucharadas de aceite de colza", "salpicar vinagre de vino blanco", "1-2 cucharadas de agua tibia", "2 cucharadas de perejil fresco de flatleaf", "1 pequeño puñado de hojas frescas de albahaca"], "method": ["Coloque las rebanadas de tomate en un círculo en un plato para servir.", "Esparce la cebolla roja sobre la parte superior.", "Coloque la chalota, el ajo, la mostaza y el vinagre de vino blanco en un bol y mezcle bien. Agregue el aceite de colza, luego agregue el agua (batiendo continuamente) para emulsionar el aderezo. Sazone al gusto con sal y pimienta negra recién molida.", "Vierta el aderezo sobre los tomates y luego déjelo a un lado durante al menos una hora para que se mase.", "Cuando esté listo para servir, esparza sobre el perejil y las hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_tomatosaladmamanblan_92961", "title": "Ensalada de tomate Maman Blanc", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 diente de ajo", "½ aguacate, pelado, piedra removida", "1 cucharadita de cilantro fresco picado", "½ jugo de limón solamente", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharadita de vinagre balsámico", "1 tomate, sin semillas, finamente picado", "½ aguacate, pelado, removido de piedra, finamente picado", "sal y pimienta negra recién molida"], "method": ["Para hacer el guacamole, coloque todos los ingredientes de guacamole en un procesador de alimentos y mezcle hasta que quede suave.", "Para hacer la ensalada, mezcle el aceite y el vinagre en un tazón.", "Agregue el tomate y el aguacate, sazone al gusto, con sal y pimienta negra recién molida y mezcle bien.", "Para servir, coloca la ensalada en un plato y coloca el guacamole alrededor."], "url": "www_bbc_co_uk_food_recipes_tomatosaladwithguaca_84132", "title": "Ensalada de tomate con guacamole", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20 aceitunas negras Kalamata, piedras quitadas", "400g / 14¼ oz de tomates de herencia, corazones retirados, toscamente picados", "1 diente de ajo, finamente cortado", "2-3 hojas de albahaca fresca, finamente cortadas", "2 cucharadas de aceite de oliva virgen extra", "1 cucharadita de vinagre de vino blanco", "2 pizcas de sal marina", "1 pizca de pimienta negra recién pizca", "1 albahaca fresca de manojo grande", "15g / ½ oz de piñones, tostados", "30 g / 1 oz de queso parmesano", "1 diente de ajo", "100-125ml de aceite de oliva", "Tapenade de aceituna negra 50g / 2oz", "Mozzarella de búfala 320g / 11oz, más o menos picada", "2 cucharadas de vinagre balsámico envejecido", "8 pequeños croutons", "1 cebolla roja, cortada a la mitad y finamente cortada", "4 cucharadas de micro hierbas frescas"], "method": ["Para las aceitunas secas, precaliente el horno a 100 ° C / 210 ° F o a su configuración más baja posible. Coloque las aceitunas en una bandeja para hornear y deje en el horno durante 1-1½ horas, o hasta que las aceitunas estén completamente secas. Dejar enfriar, luego picar finamente y reservar.", "Para los tomates, mezcle todos los ingredientes del tomate en un tazón y déjelos a un lado durante una hora.", "Para el pesto, ponga a hervir una cacerola mediana de agua, agregue la albahaca y blanquee durante 30 segundos. Escurrir y sumergir la albahaca en agua helada para detener el proceso de cocción.", "Escurra bien la albahaca, exprima el exceso de agua y coloque en una licuadora de alimentos con los ingredientes restantes del pesto. Licúe hasta obtener un puré fino, luego pruebe y ajuste el condimento si es necesario.", "Para servir, cepille la tapenade de aceituna negra en el centro de una placa rectangular. Coloque los tomates en la tira de tapenade, alternando con trozos de mozzarella y aceitunas secas. Coloca el plato en pesto y vinagre balsámico envejecido, y luego espolvorea sobre los croutons, las rodajas de cebolla roja y las micro hierbas."], "url": "www_bbc_co_uk_food_recipes_tomatosaladwithbuffa_92966", "title": "Ensalada de tomate con mozzarella de búfala", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5oz de pechuga de cerdo salada, bastante grasa", "175 g / 6 oz de zanahorias, cortadas en cubos", "175 g / 6 oz cebollas, cortadas en cubos", "1 hoja de laurel y 1 tomillo de ramita pequeña", "150 g / 5 oz de harina", "55 g / 2 oz de mantequilla", "15g / ½ oz de sal", "25 g / 1 oz de azúcar", "pizca de pimienta", "Tomates crudos de 4.5kg / 10lb o 4.5L / 8pt / 4quarts del mismo, puré", "2.26L / 4pt / 2quarts stock blanco"], "method": ["Freír el cerdo con la mantequilla en una olla alta y de fondo grueso. Cuando el cerdo esté casi derretido, agregue las zanahorias, las cebollas y los aromáticos.", "Cocine y revuelva las verduras, luego agregue la harina, que se debe dejar cocer hasta que empiece a dorarse.", "Ahora ponga los tomates y el caldo blanco, mezcle bien toda la mezcla y déjela hervir en un fuego abierto.", "En este punto, agregue el aderezo y un diente de ajo molido, cubra la cacerola y colóquela en un horno moderado, donde se puede cocinar durante 1 hora y media.", "Al final de este tiempo, la salsa se debe pasar a través de un tamiz o tammy, y debe hervir mientras se agita.", "Finalmente, viértalo en una sopera y unte con mantequilla su superficie para evitar la formación de una piel."], "url": "www_bbc_co_uk_food_recipes_tomatosauce_3755", "title": "Salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde aproximadamente 10 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas, peladas y picadas", "1 zanahoria, pelada y picada finamente", "1 diente de ajo, pelado y aplastado", "1 apio en barra, finamente picado", "2 cucharadas de aceite de oliva", "450g / 1lb de tomates maduros frescos, cortados a la mitad", "1 litro / 1¾ pintas de caldo de verduras", "1 cucharadita de azúcar", "sal y pimienta negra recién molida", "puñado de albahaca fresca, triturada (opcional)"], "method": ["Caliente el aceite en una olla grande y agregue las cebollas, la zanahoria, el apio y el ajo. Cubra y cocine suavemente durante 10 minutos hasta que estén suaves.", "Agregue el azúcar, la sal, la pimienta y los tomates. Revuelva y cocine por otros 5 minutos.", "Agregue el caldo, lleve a ebullición y cocine a fuego lento durante 10 minutos. Licuar hasta que quede suave. Si usa la albahaca, agregue al final."], "url": "www_bbc_co_uk_food_recipes_tomatosoup_13560", "title": "Sopa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomatosoup_13560_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente rebanada", "1 diente de ajo, picado", "1 cucharadita de pasta de curry rojo tailandés", "1 tomate fresco, picado", "salpicar agua caliente", "150g / 5½ oz de merlán, despellejado, picado", "pequeñas hojas frescas de espinaca bebé", "1 cucharada de cilantro fresco picado"], "method": ["Calentar el aceite de oliva en una cacerola, agregar la cebolla y freír suavemente durante 3-4 minutos o hasta que se suavice.", "Agregue el ajo y la pasta de curry rojo tailandés y fría por un minuto. Agregue el tomate y un chorro de agua caliente y cocine a fuego lento durante tres minutos.", "Agregue el pescado y cocine por 1-2 minutos o hasta que esté bien cocido.", "Agregue las hojas de espinaca y el cilantro picado. Poner en un plato y servir."], "url": "www_bbc_co_uk_food_recipes_tomatospinachandfish_88153", "title": "Tomate, espinacas y pescado al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas, separados", "1 cucharadita de jugo de limón", "1 cucharada de harina de maíz", "200ml / 7fl oz de leche entera", "1 cucharadita de mostaza integral", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "150 g / 5½ oz espinacas", "½ tomate de ternera, semillas retiradas, picadas", "Queso mozzarella 100 g / 3½ oz, en rodajas", "1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "½ tomate de ternera, semillas retiradas, picadas", "½ cucharadita de hojuelas de chile seco", "200ml / 7fl oz de vino tinto", "1 cucharada de azúcar en polvo", "35 g / 1¼ oz de mantequilla", "2 cucharadas de menta fresca picada", "pequeñas hojas de espinaca puñado, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el rollo, bata las claras de huevo y el jugo de limón en un tazón limpio grande hasta que se formen picos rígidos cuando se quite el batidor.", "En un recipiente aparte, mezcle la harina de maíz, la leche, la mostaza, la sal y la pimienta negra recién molida y las yemas de huevo hasta que estén bien combinados. Dobla esta mezcla cuidadosamente en las claras de huevo batidas.", "Cubra una bandeja para hornear con papel de silicona y vierta la mezcla en la bandeja, extendiéndola en las esquinas. Transfiera al horno para cocinar hasta que esté firme y dorado, alrededor de 5-8 minutos.", "Caliente el aceite de oliva en una sartén y cocine las espinacas durante uno o dos minutos, revolviendo hasta que se marchiten. Agregue el tomate picado y la mozzarella.", "Retire el rollo del horno y extiéndalo sobre la espinaca marchita, el tomate y la mozzarella. Usando el papel de silicona para ayudar, enrolle el rollo en un tronco.", "Para la salsa de tomate picante, caliente el aceite en una cacerola y fría la cebolla hasta que esté transparente, alrededor de 4-5 minutos.", "Agregue el tomate, los copos de chile, el vino tinto y el azúcar y cocine a fuego lento la salsa durante cinco minutos hasta que se reduzca ligeramente. Agregue la mantequilla y la menta fresca picada.", "Para servir, corte el rollo y disponga en dos platos para servir. Adorne con las hojas de espinaca y vierta sobre la salsa de tomate picante."], "url": "www_bbc_co_uk_food_recipes_tomatospinachandmozz_88467", "title": "Matambre de tomate, espinacas y mozzarella con salsa de tomate picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "½ cebolla, picada", "200g / 7oz de tomates cherry enlatados, picados", "1 calabacín, cortado en cubitos", "¼ de litro de caldo de verduras", "gran puñado de albahaca", "4-6 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén y saltee suavemente el ajo y la cebolla durante 2-3 minutos o hasta que estén suaves.", "Agregue los tomates y el calabacín y cocine a fuego lento durante 8-10 minutos.", "Para hacer el aceite de albahaca, coloca la albahaca, el aceite y el condimento en una licuadora y licúa hasta que quede suave.", "Sirva la sopa en un recipiente con un chorrito de aceite de albahaca."], "url": "www_bbc_co_uk_food_recipes_tomatosoup_75886", "title": "Sopa de tomate con aceite de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de sandía 1 oz", "500 g / 1 libra de tomates maduros de 1 oz", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de hojas de menta fresca", "2 cucharadas de hojas frescas de albahaca", "200 g / 7¼ oz de queso feta, desmenuzado", "1 cucharadita de orégano seco"], "method": ["Pele la sandía y córtela en cubos del tamaño de un bocado.", "Cortar los tomates en cuartos (el tamaño para que coincida con la sandía) y mezcle el aceite de oliva con la menta fresca y las hojas de albahaca.", "Coloque sin apretar la sandía y los tomates en una bandeja blanca grande y esparza el queso feta y el orégano sobre la parte superior para servir."], "url": "www_bbc_co_uk_food_recipes_tomatowatermelonandf_72272", "title": "Ensalada de tomate, sandía y queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]