[{"ingredients": ["75g / 2½fl oz gachas de avena", "35g / 1oz de almendras en copos", "300 ml / 10 fl oz doble crema", "150g / 5½oz de crema semidescremada", "½ cucharadita de extracto de vainilla", "3 cucharadas de whisky", "3 cucharadas de miel clara, más extra para lloviznar", "400g / 14oz de frambuesas frescas", "2-3 cucharadas de azúcar en polvo"], "method": ["Coloque la avena y las almendras en una sartén antiadherente grande y fría en aceite a fuego medio durante 4-5 minutos, revolviendo ocasionalmente hasta que queden doradas. Retirar del fuego y dejar enfriar.", "Vierta la crema doble y la crème fraîche en un tazón grande y agregue el extracto de vainilla, el whisky y la miel. Batir con un batidor eléctrico hasta que se formen picos flojos. No sobre-bata la crema, ya que se endurecerá aún más cuando se mezcla con la avena.", "Coloque la mitad de las frambuesas en un colador sobre un recipiente limpio y presione con un cucharón para hacer un puré rosado vibrante. Descarta las semillas. Endulce el puré con el azúcar al gusto.", "Coloque seis vasos o vasos altos en una bandeja. Ponga una cucharada de la mezcla de crema batida y whisky en la base de cada vaso. Espolvoree la mitad de la avena y las almendras y la mitad de las frambuesas en la parte superior.", "Rocíe más de la mitad del puré de frambuesa. Repita las capas una vez más. Mantenga las capas lo más sueltas posible. Puede armar todos los ingredientes con suficiente anticipación, pero asegúrese de servir los postres tan pronto como estén en capas."], "url": "www_bbc_co_uk_food_recipes_cranachan_20683", "title": "cranachan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_20683_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["botón de mantequilla", "100g / 3½oz de azúcar mascabado ligero", "100g / 3½oz de avena jumbo", "250g / 9oz de mascarpone", "Crema doble de 300 ml / ½ pinta", "75ml / 2½fl oz de whisky", "Frambuesas de 450g / 1lb"], "method": ["Coloque la mantequilla, el azúcar y la avena en una cacerola y revuelva a fuego alto durante 4-5 minutos, o hasta que estén tostados y crujientes. Dejar de lado para enfriar.", "Mida el mascarpone y la crema en un recipiente y bata hasta que se formen picos suaves cuando se retire el batidor del recipiente.", "Agregue el whisky, 300 g / 10½ oz de frambuesas y dos tercios de la avena enfriada. Mezcle hasta que se combinen, pero trate de mantener las frambuesas bastante enteras.", "Cuchara en vasos y arriba con las frambuesas restantes y avena crujiente."], "url": "www_bbc_co_uk_food_recipes_cranachan_49732", "title": "cranachan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_49732_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["570ml / 1 pinta de crema doble", "85g / 3oz de gachas de avena", "7 cucharadas de whisky", "3 cucharadas de miel", "Frambuesas de 450g / 1lb", "menta fresca, para adornar"], "method": ["Tueste la avena en una sartén, teniendo cuidado de no quemarlos.", "Látigo ligeramente la crema hasta que llegue a la etapa de pico suave, luego agregue el whisky, la miel, la avena y las frambuesas.", "Servir en vasos de postre con algunas frambuesas y menta."], "url": "www_bbc_co_uk_food_recipes_cranachan_66101", "title": "cranachan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_66101_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9 oz de avena finamente molida", "125 g / 4½ oz de mantequilla sin sal, derretida, más extra para engrasar", "3 cucharadas de miel", "60 g / 2¼ oz de cabeza de alfiler (gruesa) avena", "100 g / 3½ oz de azúcar en polvo", "350g / 12oz crowdie o ricotta", "350g / 12oz de queso crema con toda su grasa", "4 huevos medianos de granja", "200g / 7oz de frambuesas frescas", "Frambuesas frescas de 500g / 1lb 2oz", "50g / 1¾oz de azúcar glas"], "method": ["Unte con mantequilla una lata profunda de 23cm / 9in.", "Para hacer la base, coloque las tortas de avena en un procesador de alimentos y procese hasta que estén finamente molidas. Agregue la mantequilla derretida y la miel y procese de nuevo hasta que estén bien combinados. Presione esta mezcla uniformemente en la base de la lata y colóquela en la nevera para ponerla (aproximadamente una hora).", "Precaliente su horno a 180C / 350F / Gas 4.", "Calentar una sartén pequeña a fuego medio. Agregue la avena y una cucharadita de azúcar. Tostarlos, revolviendo con frecuencia, hasta que estén dorados. Incline sobre un plato para enfriar.", "Ponga el crowdie o requesón, queso crema, huevos y el azúcar impalpable restante en un procesador de alimentos y mezcle hasta que quede suave. Agregue la avena fría y tostada. Verter sobre la base del set y esparcir sobre las frambuesas.", "Hornee por 35-40 minutos o hasta que la tarta de queso esté colocada alrededor de los bordes pero todavía un poco tambaleante en el medio. Apague el horno y deje la tarta de queso adentro con la puerta entreabierta hasta que la tarta de queso esté fría. (Esto tomará algunas horas, pero ayuda a evitar que se agriete la parte superior de la tarta de queso).", "Mientras tanto, para hacer el coulis de frambuesa, mezcle las frambuesas y el azúcar glas en una licuadora o con una licuadora. Empuja el puré a través de un colador para quitar las pepitas.", "Sirve la tarta de queso enfriada con crema y el coulis de frambuesa."], "url": "www_bbc_co_uk_food_recipes_cranachan_cheesecake_54836", "title": "Tarta de queso Cranachan", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranachan_cheesecake_54836_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de harina de ave con cabeza de alfiler", "300ml / 10½ fl oz crema doble", "3 cucharadas de whisky", "50g / 2oz de azúcar glasé", "Frambuesas de 450g / 1lb", "Frambuesas 150g / 5oz", "½ limón, solo jugo", "2 cucharadas de azúcar glas", "ramita de menta fresca, para adornar"], "method": ["Precalentar la parrilla a fuego medio.", "Para el cranachan, coloque la avena en una bandeja para hornear y colóquela debajo de la parrilla para brindar ligeramente. Tenga cuidado de no quemarlo. Retirar del fuego y reservar para enfriar.", "Mientras tanto, coloca la crema en un bol, agrega el whisky y el azúcar glas y bate hasta que forme picos suaves cuando se quite el batidor.", "Coloque cuatro anillos de 6cm / 3½ pulgadas en los chefs de profundidad en cuatro platos. Cuchara un poco de la mezcla de crema en cada anillo a aproximadamente 1 cm / ½ en profundidad. Suavice la parte superior de la crema en el anillo con una cuchara para asegurar un borde limpio.", "Coloque capas de frambuesas sobre cada capa de crema y luego repita una capa de crema.", "Repita con una capa de frambuesas seguido de una capa de crema, hasta que el anillo esté lleno. Asegúrese de terminar con una capa de crema, alisar la parte superior con una espátula.", "Polvo de la parte superior e inferior de los anillos llenos con la harina de avena tostada, luego coloque cada anillo en el centro de un plato de servir. Retire con cuidado el anillo de los chefs de cada cranachan, utilizando un mini soplete para calentar y aflojar los anillos primero si es necesario.", "Para la salsa de frambuesa, coloque las frambuesas, el jugo de limón y el azúcar glas en un procesador de alimentos y mezcle hasta que quede suave. Pase la salsa a través de un colador en un recipiente.", "Para servir, cubra cada cranachan con un par de frambuesas y una ramita de menta y coloque la salsa de frambuesa en el borde."], "url": "www_bbc_co_uk_food_recipes_cranachanwithraspber_86047", "title": "Cranachan con salsa de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, suavizada", "200g / 7oz de azúcar mascabado ligero", "100g / 3½ oz de jarabe dorado", "50g / 1¾oz semillas de girasol", "50g / 1¾oz de arándanos secos, picados si son grandes", "100 g / 3½ oz de sultanas", "50g / 1¾oz de coco desecado", "100g / 3½oz de cereal de arroz crujiente", "150 g / 5½ oz de avena"], "method": ["Cubra una bandeja de 23x30cm / 9x12 en bandeja con película adhesiva.", "Agregue la mantequilla, el azúcar y el jarabe dorado a una cacerola grande y revuelva a fuego medio hasta que se derrita. Vierta en un tazón grande, agregue todos los ingredientes restantes hasta que estén bien combinados.", "Coloque la mezcla en la lata preparada y extiéndala con el dorso de una cuchara en una capa uniforme. Transfiera a la nevera para enfriar, sin tapar, durante aproximadamente 2 horas, o hasta que esté firme.", "Retire de la charola de bandeja y corte en 18 barras de tamaño uniforme. Manténgalo en un recipiente hermético hasta que lo necesite."], "url": "www_bbc_co_uk_food_recipes_cranberry_and_coconut_69378", "title": "Barras energéticas de arándano y coco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 18 barras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberry_and_coconut_69378_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75ml / 3fl oz de jugo de arándano", "50ml / 2fl oz de jugo de naranja", "2 x 12 g de bolsitas de gelatina en polvo", "450 g / 1lb de azúcar en polvo", "150ml / ¼ litro de sirope dorado", "50g / 1¾oz de azúcar glas", "2 cucharadas de harina de maíz", "1 naranja, ralladura fina solamente", "1 cucharadita de arándano en polvo"], "method": ["Alinee una lata cuadrada de 20 cm / 8 pulgadas con una película adhesiva, dejando un voladizo para que la mezcla se pueda quitar fácilmente una vez que se haya fraguado.", "Vierta el jugo de naranja y de arándano en el tazón de una batidora y espolvoree sobre la gelatina. Reserve para permitir que la gelatina se ablande y absorba el líquido.", "Mientras tanto, ponga el azúcar, el jarabe dorado y 150 ml / ¼ de agua en una olla. Cocine a fuego lento, revolviendo todo el tiempo, hasta que el azúcar se haya disuelto, luego inmediatamente ponga la mezcla a ebullición. Con un termómetro de azúcar, hierva hasta que el almíbar alcance 130ºC, luego retírelo del fuego. Deja enfriar por un minuto, hasta que ya no burbujee.", "Batir la mezcla de gelatina en una batidora a velocidad media. Agregue el jarabe de azúcar, vertiéndolo lentamente por el costado de la taza del mezclador. Trate de evitar verter directamente sobre el batidor o obtendrá grumos granulosos de azúcar en el malvavisco. La mezcla de malvaviscos debería ponerse pálida y crecer en volumen como un merengue muy rígido.", "Una vez que se haya agregado todo el jarabe, continúe batiendo durante 5-10 minutos, o hasta que el malvavisco esté realmente espeso y se enfríe un poco más. Está listo cuando el exterior del recipiente está ligeramente tibio y el malvavisco comienza a ponerse muy pegajoso.", "Use una espátula engrasada, raspe el malvavisco en la lata preparada, manteniendo la espátula limpia con agua hirviendo cuando se ponga demasiado pegajosa. Dejar reposar a temperatura ambiente durante 1-2 horas, o hasta que esté firme.", "Tamiza el azúcar glas y la harina de maíz en un tazón pequeño y agrega la cáscara de naranja. Usa algo de esta mezcla para cubrir la parte superior del malvavisco. Usando el saliente para levantar el malvavisco, retírelo de la lata. Córtelo en cubos de 4cm / 1½ pulgadas y luego espolvoree cada cubo en la mezcla restante de azúcar glas y polvo de arándano. Sirva en un plato o tabla."], "url": "www_bbc_co_uk_food_recipes_cranberry_and_orange_84364", "title": "Malvaviscos de arándano y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 25 malvaviscos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple 400g / 14oz", "1 cucharada de sal de mesa", "2 cucharaditas de polvo de hornear", "50 g / 1 oz de azúcar en polvo", "1 cucharadita de semillas de comino", "50 g / 1¾oz de mantequilla sin sal, refrigerada y en cubos", "100g / 3½oz de arándanos secos", "1½ naranjas sin cebar, solo cáscara", "1 huevo grande de gallinas camperas", "175ml / 6fl oz de suero de leche"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel para hornear.", "En un tazón grande, mezcle la harina, la sal, el polvo de hornear, el azúcar impalpable y las semillas de alcaravea. Con los dedos, frote la mantequilla hasta que la mezcla se asemeje a pan rallado. Mezcle los arándanos y la ralladura de naranja.", "Mezcle el huevo y el suero de leche juntos y luego revuelva en la mezcla seca con una cuchara de madera. Use sus manos para juntar la masa, luego gire sobre una superficie ligeramente enharinada y forme una bola.", "Coloque la masa en la bandeja de horneado preparada y corte una cruz en la parte superior con un cuchillo afilado. Hornee por 30-35 minutos, o hasta que se levante y dore. Enfríe completamente en una rejilla de alambre antes de servir."], "url": "www_bbc_co_uk_food_recipes_cranberry_and_orange_15393", "title": "Pan de soda dulce de arándano y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de harina de pan blanco fuerte, más extra para espolvorear", "10g / ¼ oz de levadura de acción rápida", "3 cucharadas de azúcar en polvo de oro", "1 cucharada de especias mezcladas", "310ml / ½ pinta de agua tibia", "3 cucharaditas de copos de sal marina", "2 naranjas grandes, solo cáscara", "2 cucharaditas de aceite vegetal", "75g / 2½ oz de arándanos secos, picados", "50g / 2oz de cáscara de naranja confitada, picada", "3 cucharadas de azúcar moreno claro, para el agua furtiva", "1 huevo de gallinas camperas, ligeramente batido, para glasear", "4-5 cubos de azúcar morena, ligeramente triturados"], "method": ["Para la masa, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Lubrique ligeramente un tazón grande y engrase dos bandejas grandes para hornear.", "En un tazón grande y limpio, mezcle la harina, la levadura, el azúcar impalpable y la mezcla de especias. En un recipiente aparte, mezcle el agua, la sal, la ralladura de naranja y el aceite vegetal, luego incorpore gradualmente esta mezcla en los ingredientes secos.", "En una superficie enharinada, amasar la masa hasta que quede suave y elástica. Transfiera al tazón engrasado, cubra con un paño húmedo y déjelo durante 10 minutos. Amasar brevemente la masa de nuevo por un minuto, cubrir nuevamente y dejar probar durante otros 10 minutos.", "Agregue los arándanos y la cáscara confitada a la masa y amasar hasta que estén distribuidos uniformemente. Cubra y reserve para probar durante 30 minutos.", "Divida la masa en 12 piezas iguales y enrolle cada pieza en una bola ordenada. Cubra con una toalla de té húmeda y déjela a un lado para comprobar durante 20 minutos.", "Forme las bolas de masa en forma de anillos insertando una cuchara de madera en el centro y usando los dedos para estirar suavemente la masa.", "Para preparar el agua de la caza furtiva, llene dos ollas grandes con agua, distribuya el azúcar morena entre ellas y deje que hierva. Cueza los bagels dos o tres a la vez durante 30 segundos en cada lado. Sácalos con una espumadera, sacuda el exceso de agua y colócalos en las bandejas de hornear preparadas.", "Cepíllese ligeramente con huevo, espolvoree sobre los cubitos de azúcar triturados y hornéelos en el horno durante 20-25 minutos hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_cranberry_and_orange_97135", "title": "Bagels de arándano y naranja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 12 panecillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de arándanos secos, empapados en el puerto", "250g / 9oz de faisán picado", "250g / 9 oz de panceta o paleta de cerdo picada", "1 diente de ajo, pelado y aplastado", "½ cucharadita de hojas de tomillo", "pizca de pimienta inglesa", "1 baya de enebro, finamente triturada", "sal y pimienta negra recién molida", "harina común, para quitar el polvo", "1 paquete de 375 g de hojaldre listo para enrollar", "1 huevo de gallinas camperas, ligeramente batido O 2 yemas de huevo de gallinas camperas, ligeramente golpeadas", "1 cucharada de semillas de sésamo negro", "1 cucharada de semillas de sésamo blanco", "Salsa de arándanos 250 g / 9 oz, para servir"], "method": ["Drene y pique los arándanos. Mézclalos con las carnes picadas en un tazón grande. Agregue el ajo, el tomillo, la pimienta de Jamaica y el enebro triturado y sazone con sal y pimienta.", "Enrolla la carne en forma de tronco y envuélvela en una película adhesiva. Deje reposar en la nevera durante al menos una hora.", "Espolvoree un poco de harina en la superficie de trabajo y coloque la masa en la parte superior. Coloque la salchicha en la masa y enrolle con fuerza. Selle el borde con huevo batido. Transfiera a la nevera para enfriar por 10 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Pon las semillas de sésamo en dos tazones separados. Cepille todo el rollo de salchicha con huevo batido y revuelva en los dos cuencos de semillas de sésamo.", "Hornee durante 20-25 minutos, o hasta que estén dorados y bien cocidos.", "Sirva los rollos de salchicha cortados en rodajas con una cucharada de salsa de arándano."], "url": "www_bbc_co_uk_food_recipes_cranberry_and_pheasant_51675", "title": "Rollos de salchicha de arándano y faisán", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de azúcar moreno claro", "100ml / 3½fl oz de jugo de naranja fresco", "250g / 9 oz de arándanos frescos o congelados", "1 clementina, ralladura finamente rallada solamente (opcional)"], "method": ["Combine el azúcar y el jugo de naranja en una olla grande y deje que hierva.", "Agregue los arándanos y la ralladura de clementina (si está usando), luego hierva a fuego lento hasta que los arándanos estén tiernos pero aún mantengan su forma - esto tomará aproximadamente 5 minutos si usa arándanos congelados y un poco más si lo usa en fresco.", "Refrigere hasta que sea necesario, la salsa se espesará a medida que se enfríe.", "Retire de la nevera una hora antes de servir."], "url": "www_bbc_co_uk_food_recipes_cranberry_sauce_77431", "title": "Salsa de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberry_sauce_77431_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 2oz de manzanas Bramley, peladas, sin corazón y picadas", "1kg / 2lb 2oz arándanos", "1 cucharadita de canela molida", "Agua para cubrir", "1-1.5kg / 2lb 2oz-3lb 4oz azúcar granulada", "2 cucharadas de aceite de oliva", "1kg / 2lb 2oz lomo de cerdo, piel encendida", "sal y pimienta negra recién molida"], "method": ["Para la gelatina, coloque las manzanas, los arándanos y la canela en una olla grande y vierta suficiente agua para cubrir. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10-15 minutos hasta que las manzanas y los arándanos se rompen.", "Pase la mezcla a través de un colador forrado con un paño limpio de cocina o muselina en una jarra grande. Deseche la pulpa que queda en el tamiz.", "Por cada 600 ml / 1 pinta de líquido que tenga, agregue 500 g / 1 lb 2 oz de azúcar granulada.", "Vierta la mezcla de nuevo en una cacerola limpia con un termómetro de azúcar y cocine lentamente hasta que alcance 220C / 105F - alternativamente, coloque una cucharada de gelatina en un plato frío y verifique si se solidifica.", "Vierta la gelatina en jarras calientes esterilizadas mientras aún esté caliente y déjela enfriar y preparar.", "Para el cerdo asado, precaliente el horno a 180C / 350F / Gas 4.", "Calentar el aceite de oliva en una sartén grande. Sazone la carne de cerdo con sal y pimienta negra recién molida y coloque en la sartén. Cocine brevemente por todos lados hasta que esté ligeramente dorado por todos lados.", "Transfiera a una lata de asar y coloque en el horno durante 40-60 minutos, o hasta que el crujiente esté dorado y la carne de cerdo esté completamente cocida.", "Para servir, esculpe el cerdo en porciones y colóquelo en platos para servir con una cucharada de arándano y jalea de manzana."], "url": "www_bbc_co_uk_food_recipes_cranberryandapplejel_86607", "title": "Jalea de arándano y manzana con lomo de cerdo asado", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de arándanos frescos", "300ml / 10fl oz de puerto de rubí", "115 g / 4 oz de azúcar en polvo", "125ml / 4fl oz de jugo de naranja fresco", "1 cucharada de harina de maíz", "1 cucharadita de mostaza inglesa en polvo", "1 cucharadita de jugo de limón", "pizca de clavo de olor", "75g / 3oz sultanas", "55g / 2oz de almendras en copos", "1 cucharada de ralladura de naranja", "1 cucharadita de ralladura de corteza de limón", "sal"], "method": ["Combine los arándanos, el puerto, el azúcar y el jugo de naranja en una sartén a fuego medio, durante diez minutos, hasta que la fruta explote.", "Combine la harina de maíz, la mostaza, el jugo de limón y el clavo de olor con un poco de agua para hacer una pasta y mezcle con la mezcla de bayas.", "A continuación, agregue las sultaninas, almendras, naranja y cáscara de limón, cocine a fuego lento durante cinco minutos, sazone y luego enfríe. Sirva con su pavo de Navidad."], "url": "www_bbc_co_uk_food_recipes_cranberryandcumberla_70984", "title": "Salsa de arándano y Cumberland", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberryandcumberla_70984_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½ fl oz crema doble", "50ml / 2fl de leche en oz", "1 vaina de vainilla, partida por la mitad, semillas raspadas", "4 yemas de huevo de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "50ml / 2fl oz de crema doble, batida", "50 g / 1½ oz de mascarpone", "2 cucharadas de miel líquida", "50g / 1¾oz de arándanos", "1 cucharadita de agua", "50 g / 1 oz de azúcar en polvo", "50g / 1½oz de dedos de esponja ya hechos", "1 naranja, solo jugo", "azúcar glas, al polvo"], "method": ["Para la crema pastelera, coloque la crema, la leche y la vaina de vainilla y las semillas en una cacerola pequeña. Caliente la mezcla hasta que comience a hervir a fuego lento. Luego retire la sartén del fuego y déjela a un lado para infundir.", "Coloque las yemas de huevo y el azúcar en un tazón grande y mezcle hasta que se hayan combinado y tengan una textura suave.", "Retire la vaina de vainilla de la crema y la mezcla de leche y déjela a un lado (la vaina puede usarse nuevamente para otro plato).", "Poco a poco, agregue la mezcla caliente de leche y crema en el cuenco de los huevos, mientras bate vigorosamente. Una vez que las mezclas se hayan combinado, vierta el líquido de nuevo en la cacerola y vuelva al fuego. Revuelva la mezcla continuamente hasta que la mezcla se vuelva lo suficientemente espesa como para cubrir la parte posterior de la cuchara.", "Retire la sartén del fuego, cúbrala con una película adhesiva y transfiérala a la nevera para que se enfríe durante cinco minutos.", "Para el relleno, coloque todos los ingredientes en un recipiente limpio y mezcle bien, hasta que los ingredientes se hayan combinado.", "Para los arándanos, coloque los arándanos junto con una cucharadita de agua en una cacerola pequeña a fuego lento y cocine durante 6-8 minutos, o hasta que los arándanos se rompan. Agregue el azúcar, retire la sartén del fuego y deje que se enfríe un poco.", "Para servir, coloque los dedos de la esponja en un vaso de postre alto y limpio y vierta el jugo de naranja sobre los dedos de la esponja. Vierta la mezcla de arándano, seguido de la crema sobre los dedos de la esponja. Vierta la mezcla de crema sobre la crema pastelera. Espolvorea la crema con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_cranberryandorangetr_84811", "title": "Arándano y naranja bagatela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla", "200g / 7oz de azúcar moreno oscuro y suave, por ej. muscovado sin refinar", "250ml / 9fl oz de jugo de naranja", "2 cucharaditas de especias mixtas molidas", "½ cucharadita de canela molida", "½ cucharadita de jengibre", "pizca de nuez moscada rallada", "250g / 9oz de manzanas Bramley", "200g / 7oz sultanas", "200g / 7oz pasas de Corinto", "100 g / 3½ oz de arándanos secos o pasas", "Cáscara confitada mixta de 200g / 7oz, finamente picada", "1 cucharada de ralladura de naranja rallada", "Brandy 150ml, coñac, ron o whisky"], "method": ["Combine la mantequilla, el azúcar, el jugo de naranja y todas las especias en una cacerola, y deje en un fuego suave, revolviendo ocasionalmente, hasta que la mantequilla se haya derretido y la mezcla esté suave.", "Pele, corte, base y pique finamente las manzanas. Agregue las manzanas picadas a la sartén, junto con las pasas, grosellas, arándanos o pasas, cáscara confitada y ralladura de naranja, revolviendo bien.", "Llevar a ebullición, y cocine a fuego lento durante 10 minutos o hasta que las manzanas se hayan suavizado, luego déjelas a un lado.", "Agregue el brandy u otro alcohol y permita que se enfríe.", "Cuando esté frío, póngalo en recipientes limpios y secos, y séllelo herméticamente y refrigérelo hasta por un mes hasta que lo necesite.", "Para mantener por hasta seis meses, duplicar la cantidad de alcohol."], "url": "www_bbc_co_uk_food_recipes_cranberrymincemeat_73340", "title": "Carne picada de arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1.2 kg, suficiente para 24 pies", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2½oz de azúcar moreno oscuro y suave", "60ml / 2fl oz de puerto de rubí", "300 g / 10½ oz de arándanos", "1 cucharadita de canela molida", "1 cucharadita de jengibre molido", "½ cucharadita de clavo de olor molido", "75 g / 2½ oz de grosella", "75 g / 2½ oz pasas", "30g / 1oz de arándanos secos", "1 clementina, cáscara y jugo solamente", "Brandy 25ml / 1fl oz", "algunas gotas de extracto de almendra", "½ cucharadita de extracto de vainilla", "2 cucharadas de miel"], "method": ["En una sartén grande, disuelva el azúcar en el puerto de rubí con un calor suave.", "Agregue los arándanos y revuelva.", "Agregue la canela, el jengibre y el clavo de olor, las pasas de Corinto, las pasas de uva, los arándanos secos y la ralladura y el jugo de la clementina.", "Deje que hierva a fuego lento y cocine por 20 minutos, o hasta que la fruta se haya descompuesto y haya absorbido la mayor parte del líquido en la sartén. (Es posible que tenga que aplastar un poco los arándanos con el dorso de una cuchara de madera para incorporarlos completamente).", "Retirar del fuego y dejar enfriar un poco.", "Agregue el brandy, el extracto de almendras, el extracto de vainilla y la miel, y mezcle bien con una cuchara de madera para triturar la mezcla y convertirla en una pasta.", "Con una cuchara, ponga la carne picada en frascos esterilizados y, una vez que esté fría, guárdela en el refrigerador hasta por dos semanas."], "url": "www_bbc_co_uk_food_recipes_cranberrystuddedminc_90619", "title": "Carne picada con arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 600 ml / 1 pinta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberrystuddedminc_90619_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 kg / 4lb 8oz- 6lb 8oz cigalas", "Botella de 500ml / 18fl oz fuerte", "100g / 3½oz de sal", "2 cucharaditas de azúcar", "montón de coronas de eneldo o hojas de eneldo", "1 cucharadita de semillas de anís o semillas de hinojo", "150 g / 5½ oz de mantequilla", "1-2 cucharadas de aceite de trufa", "sal"], "method": ["Para el cangrejo de río, hierva 4 litros / 7 pintas de agua. Agregue la corpulenta, la sal, el azúcar, las coronas de eneldo y las semillas de anís. Agregue todos los cangrejos de río, vuelva a hervir y hierva durante 8-10 minutos. Colar y dejar enfriar antes de comer.", "Para la mantequilla de trufa, derrita la mantequilla y mezcle el aceite de trufa. Sazonar con un poco de sal. Pruebe para asegurarse de que el sabor de la trufa sea lo suficientemente pronunciado, ajústelo según sea necesario.", "Sirva el cangrejo junto con la mantequilla de trufa derretida."], "url": "www_bbc_co_uk_food_recipes_crayfish_with_truffle_85043", "title": "Cangrejo con mantequilla de trufa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7 oz de cangrejos cocidos", "¼ de cebolla, finamente picada", "1 cucharada de salsa de soja", "1 cucharada de miel", "1 cucharadita de aceite de sésamo", "1 cebolleta, picada", "6 hojas de lechuga Little Gem", "3 cuñas de lima, para adornar"], "method": ["Coloque el cangrejo, la cebolla, la salsa de soja, la miel, el aceite de sésamo y la cebolla tierna en una sartén y caliéntelo suavemente durante 4-5 minutos.", "Para servir, coloque las hojas de lechuga en un plato, vierta sobre la mezcla de cangrejo y adorne con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_crayfishlettucebaske_85021", "title": "Cestas de lechuga cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, en rodajas", "1 zanahoria, en cubitos", "1 tallo de apio cortado en cubitos", "2 kg / 4 lb 8 oz cangrejos de río (alrededor de 20 cigalas medianas), sin cáscara, la carne de la cola reservada para la sopa", "250ml / 9fl oz de vino blanco", "2 hojas de laurel", "manojo de eneldo, solo tallos", "algunas ramitas de perejil", "3 dientes de ajo, pelados, dejados enteros", "½ limón, solo ralladura", "1 cucharadita de pimienta negra", "1 estrella de anís", "30g / 1oz de mantequilla", "1 cebolla, finamente picada", "Papas de 750 g / 1 lb 10 oz, cortadas en cubos de 2 cm / ¾in", "4 puerros, lavados, cortados en rodajas", "hojas de eneldo", "sal y pimienta negra recién molida", "4 cucharaditas de crema fresca"], "method": ["Primero haga la acción. Pon el aceite de oliva en una olla grande de base pesada. Agregue las verduras y saltee enérgicamente hasta que comience a caramelizar. Agregue las cáscaras de cigalas y revuelva hasta que el líquido se evapore y se vuelvan de color rojo oscuro.", "Vierta sobre el vino blanco y deje que burbujee por un par de minutos. Vierta en 1½ litros / 2½ pintas de agua y los ingredientes restantes. Llevar a ebullición, luego baje la temperatura y cocine a fuego lento durante 40 minutos. Colar y apartar.", "Para la sopa de pescado, derrita la mitad de la mantequilla en una olla grande. Agregue la cebolla y saltee hasta que esté transparente. Agregue las papas y los puerros y revuelva para mezclar. Agregue el caldo y sazone con sal y pimienta.", "Llevar a ebullición, baje el fuego y cocine a fuego lento, sin tapa, durante unos 15 minutos. En este punto, las verduras deben ser tiernas. Agregue las hojas de eneldo.", "Derretir la mantequilla restante en una sartén. Sazonar las colas de cangrejo reservadas con sal y pimienta y agregar a la sartén. Freír por un par de minutos y agregar a la sopa de pescado. Divida la sopa entre 4 tazones y cubra con una cucharadita de crème fraîche, sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crayfish_chowder_28530", "title": "Sopa de cangrejo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["32 cangrejos de río crudos", "2 lechugas Little Gem, hojas separadas", "½ cucharadita de pimienta de cayena", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10 fl oz aceite de colza", "2 cucharadas de ketchup de tomate", "1 cucharada de salsa Worcestershire", "2 guiones de salsa Tabasco", "1 cucharada de aguardiente", "½ limón, solo jugo", "8 rebanadas de pan blanco, sin costras"], "method": ["Cueza al vapor el cangrejo durante 4-5 minutos, o hasta que esté rosado. Retirar de la sartén, reservar para enfriar y pelar. (Mantenga cuatro cigalas enteras para la guarnición).", "Para la salsa de cóctel, bata los huevos, el vinagre de vino blanco y la mostaza en un procesador de alimentos hasta que estén pálidos y cremosos. Con el motor en marcha, vierta el aceite en un flujo constante, hasta que la mezcla espese en una mayonesa.", "Coloque la mayonesa en un tazón, mezcle la salsa de tomate, la salsa Worcestershire, el tabasco, el brandy y el jugo de limón hasta que estén bien combinados. Sazonar con sal y pimienta negra recién molida. Agregue las colas de cangrejo.", "Para la tostada Melba, ase a la parrilla ambos lados del pan hasta que estén dorados, luego corte las rebanadas de pan tostado por la mitad horizontalmente. Ase los lados interiores suaves hasta que estén dorados, luego corte las rebanadas de pan tostado en cuartos en diagonal.", "Para servir, coloque las hojas de lechuga en el fondo de un vaso y cubra con el cóctel de cigalas.", "Polvo con pimienta de cayena y decorar con el cangrejo reservado. Sirva la tostada Melba al lado."], "url": "www_bbc_co_uk_food_recipes_crayfish_cocktail_with_95972", "title": "Cóctel de cangrejo con pan tostado melba", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]