[{"ingredients": ["2 rodajas de tocino, con guarnición de grasa", "1 lechuga pequeña gema, hojas separadas, picadas", "1 aguacate, pelado, removido de piedra, picado", "apretón de jugo de limón", "2 cucharadas de aceite de oliva", "¼ diente de ajo, aplastado", "¼ cucharadita de mostaza Dijon", "2 rebanadas gruesas de pan, cortadas en trozos", "1 cucharada de aceite"], "method": ["Calentar una sartén grande y freír el tocino hasta que esté crujiente y dorado en ambos lados. Cuando el tocino esté lo suficientemente frío como para cortar trozos finos, elimine toda la grasa visible.", "Coloque todos los ingredientes de la ensalada en un tazón y déjelos a un lado.", "Para el aderezo, coloque todos los ingredientes del aderezo en un tazón y mezcle bien para formar un aderezo suave.", "Para los crotones, caliente el aceite en una sartén y, cuando esté caliente, agregue los cubos de pan. Cocine de 2 a 3 minutos o hasta que esté dorado.", "Agregue los croutons a la ensaladera y rocíe sobre el aderezo para ensaladas."], "url": "www_bbc_co_uk_food_recipes_caesarsaladwithavoca_84116", "title": "Ensalada de aguacate y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caesarsaladwithavoca_84116_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka de 60ml / 2¼fl oz", "1½ limas, cortadas en cuartos", "1 cucharada de azúcar granulada", "puñado de hielo", "1 cuña de lima, para adornar"], "method": ["Coloque el vodka, las limas (excepto la guarnición) y el azúcar en un vaso alto y con cuidado 'mezcle' o golpee con el extremo de un rodillo limpio.", "Agregue un puñado de hielo, decore con una rodaja de lima y sirva."], "url": "www_bbc_co_uk_food_recipes_caipirosca_85333", "title": "caipirosca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de sal marina", "1 cucharada de pimentón dulce", "1 cucharada de ajo en polvo", "2 cucharaditas de pimienta blanca molida", "2 cucharaditas de cebolla en polvo", "1 cucharadita de comino molido", "1 cucharadita de pimienta de cayena", "1 cucharadita de orégano seco", "1 cucharadita de tomillo seco", "1 cucharadita de albahaca seca (opcional)"], "method": ["Vierte la sal marina hasta que esté fina, luego mezcla con todos los ingredientes restantes. Alternativamente, para un polvo más suave, relámpago en un molinillo de especias."], "url": "www_bbc_co_uk_food_recipes_cajun_seasoning_92363", "title": "condimento de Cajun", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 6 cucharadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ cucharadita de jengibre molido", "½ cucharadita de pimienta de Jamaica molida", "¼ cucharadita de pimentón", "Salmón filete 100 g / 3½ oz, piel en", "dash aceite de oliva", "25g / 1oz de mantequilla, derretida", "½ pimiento rojo, picado", "2 cucharadas de vino blanco", "75ml / 2½fl oz de caldo de verduras", "30 ml / 1 fl oz crema doble"], "method": ["Para hacer el salmón especiado de Cajun, mezcle las especias en un tazón y luego enrolle el filete de salmón en las especias.", "Calentar el aceite de oliva en una sartén a fuego medio. Agregue el salmón y fría el lado de la piel hacia abajo durante 2-3 minutos hasta que se dore. Voltee y cocine durante 1-2 minutos en el otro lado, hasta que se dore y se cocine completamente.", "Para hacer la salsa de pimiento rojo, derrita la mantequilla en una cacerola, agregue el pimiento rojo y fría por tres minutos.", "Agregue el vino y el caldo y cocine a fuego alto durante tres minutos hasta que el líquido se haya reducido a la mitad. Agregue la crema y vierta en una licuadora. Mezclar hasta que esté suave.", "Para servir, coloque el salmón en un plato y vierta sobre la salsa de pimiento rojo."], "url": "www_bbc_co_uk_food_recipes_cajunspicedsalmonwit_84942", "title": "Salmón cajún con salsa de pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5oz de arroz basmati", "1 cucharada de aceite vegetal", "1 chile rojo fresco, finamente picado", "2 cucharadas de perejil fresco picado", "1 cucharada de salsa de soja", "1 filete de lubina", "1 cucharada de aceite de oliva", "¼ cucharadita de pimienta de cayena", "1 cucharada de salsa de soja", "1 cucharada de cebollines frescos finamente picados", "1 cucharada de albahaca fresca finamente picada", "3 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para el arroz con chile, cocine el arroz en agua hirviendo con sal, de acuerdo con las instrucciones del paquete. Desagüe.", "Calentar el aceite en una sartén, agregar la guindilla y cocinar por un minuto. Agregue el arroz, el perejil y la salsa de soja y cocínelos durante un minuto más, luego retírelos del fuego y déjelos a un lado.", "Para la lubina, coloque el filete en una bandeja para hornear antiadherente. Rocíe el aceite de oliva y sazone con la pimienta de cayena y la salsa de soja. Coloque en el horno para hornear durante 7-8 minutos, o hasta que el pescado esté completamente cocido.", "Para el aderezo, mezcle las hierbas y el aceite en un tazón pequeño.", "Para servir, vierta el arroz en un plato. Coloque la lubina encima y rocíe sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_cajunseabasswithherb_87435", "title": "Lubina cajún con aderezo de hierbas y arroz de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pizca de tierra pizca", "pizca de chile en polvo", "pizca de copos de chile seco", "pizca de cayena", "Una pizca de sal marina", "Filete de salmón 150 g / 5½ oz, sin piel", "1 cucharada de aceite de oliva", "4 dientes de ajo sin pelar", "300ml / 12fl oz de aceite vegetal, para freír", "100g / 3½ oz de harina de auto crianza", "sal marina y pimienta negra recién molida", "½ cucharadita de cúrcuma molida", "150ml / ¼ pinta de agua con gas", "3 cucharadas de cebolletas frescas picadas", "4 cebolletas, cortadas a la mitad", "1 cucharada de aceite de oliva", "1 mazorca de maíz dulce", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 limones, cortados a la mitad", "1 cucharada de miel", "250 g / 9 oz de yogur de estilo griego", "3 cucharadas de miel", "sal y pimienta negra recién molida", "2 cebollas tiernas, picadas", "2 cucharaditas de vinagre balsámico", "pequeño puñado de perejil fresco, picado"], "method": ["Para el salmón, coloque todas las especias y la sal en un tazón y mezcle.", "Coloque el salmón encima de las especias y frote ligeramente para asegurarse de que todas las especias se hayan pegado a un lado del salmón.", "Caliente el aceite de oliva en una sartén pequeña, agregue los dientes de ajo sin pelar y el salmón (con la cara especiada hacia abajo) y tueste durante cuatro minutos.", "Dé la vuelta, retire la sartén del fuego y déjela continuar cocinando ligeramente fuera del fuego, hasta que el salmón esté bien cocido.", "Para las cebollas de primavera, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Ponga la harina en un tazón grande con sal y pimienta negra recién molida y cúrcuma y bata lentamente en el agua un poco cada vez hasta que tenga una pasta espesa. Agregue las cebolletas.", "Sumerja las cebolletas en la mezcla y luego suavemente en el aceite caliente. Freír a fuego lento durante 3-4 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Espolvorea con un poco de sal marina.", "Para el maíz dulce asado, caliente el aceite en una sartén. Raspe un cuchillo afilado a lo largo de la mazorca de maíz para eliminar todos los granos de maíz. Pon los granos de maíz en el aceite caliente y freír durante un minuto. Apartar y mantener caliente.", "Para los limones con miel, caliente el aceite de oliva en una sartén, agregue los limones a la mitad con el lado cortado hacia abajo y tueste durante 3-4 minutos. Rocíe con la miel y tueste durante un minuto.", "Para el aderezo, mezcle todos los ingredientes del aderezo en un tazón pequeño.", "Para servir, coloque las cebolletas en un plato para servir, cubra con el salmón ennegrecido, vierta sobre el aderezo y luego esparza el maíz tostado sobre la parte superior. Coloque los limones con miel en el lateral."], "url": "www_bbc_co_uk_food_recipes_cajunstyleblackeneds_86210", "title": "Salmón ennegrecido estilo cajún con cebollas tiernas, maíz dulce asado, limones con miel y aderezo de yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de semillas de comino", "½ cucharadita de semillas de cilantro", "½ cucharadita de pimentón", "½ cucharadita de canela molida", "½ cucharadita de pimienta de cayena", "Filete de trucha 150 g / 5½ oz, piel en", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "2 cucharadas de aceite de oliva", "½ jugo de limón solamente", "1 calabacín, cortado en cintas con un pelador de verduras", "sal y pimienta negra recién molida", "2 tomates, finamente picados", "4 cucharadas de aceite de oliva", "2 cucharadas de albahaca fresca picada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la trucha, muela las especias juntas en un almirez y un mortero.", "Coloque la mezcla de especias molidas en un recipiente y agregue la trucha, volteándola para cubrir las especias.", "Caliente el aceite de oliva en una sartén mediana a fuego alto. Agregue la trucha y fría por un minuto en cada lado, para dorar.", "Agregue el jugo de limón y transfiéralo al horno para hornear durante tres minutos o hasta que esté cocido.", "Para hacer la ensalada de calabacín, coloque el aceite de oliva y el jugo de limón en un recipiente y mezcle.", "Agregue las tiras de calabacín y mezcle, sazonar, al gusto, con sal y pimienta negra recién molida.", "Para hacer la salsa de tomate, coloque los tomates, el aceite y la albahaca en un procesador de alimentos y mezcle hasta que quede suave.", "Vierta la mezcla de tomate en una cacerola pequeña a fuego medio. Llevar a ebullición, luego reducir el fuego a fuego lento durante tres minutos y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada de calabacín en el centro de un plato, coloque la trucha en la parte superior y cuchara sobre parte de la salsa."], "url": "www_bbc_co_uk_food_recipes_cajunstyletroutwithc_80261", "title": "Trucha de estilo cajún con ensalada de calabacín y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de chocolate negro", "125g / 4½oz de pastel de frutas", "125 g / 4½ oz de tarta de Madeira", "2 cucharadas de coco desecado", "2 cucharadas de avellanas picadas", "300 g / 10½ oz de chocolate blanco", "algunas gotas colorante de alimentos", "bola de azúcar multicolor rocía"], "method": ["Derrita el chocolate en un tazón sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque el agua).", "Desmenuce la torta de fruta y la torta de Madeira en un bol, luego mezcle el chocolate derretido, el coco desecado y las avellanas hasta que estén bien combinados.", "Rollo de bolas de tamaño de pelota de la mezcla en bolas. Pega un palo de lollipop en cada bola y déjalo a un lado en el refrigerador durante 20-30 minutos, o hasta que esté firme.", "Mientras tanto, derrita el chocolate blanco en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento. (No permita que la base del recipiente toque el agua). Agregue el colorante para alimentos.", "Cubra una bandeja para hornear con papel resistente a la grasa. Espolvorea las chispas de azúcar en un plato.", "Retire las bolas de la nevera, sumérjalas en el chocolate, luego cubra con las chispas de azúcar y colóquelas en la bandeja para hornear. Guarde en la nevera durante 20-30 minutos o hasta que el chocolate se haya solidificado."], "url": "www_bbc_co_uk_food_recipes_cake_lollipops_06507", "title": "Cake pops", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Hace 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cake_lollipops_06507_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite de oliva", "2 cucharadas de vinagre de vino tinto", "4 chiles rojos calientes medianos, sin semillas, picados", "½ pimiento rojo, desgrasado aproximadamente picado", "1 cabeza de ajo, clavos pelados, más o menos picados", "algunas ramitas de tomillo fresco", "algunas ramitas de romero fresco", "1 cucharadita de orégano seco", "½ cucharadita de hojuelas de chile rojo seco", "1 costilla de costillas de cerdo, en una pieza, alrededor de 1.5-2kg / 3lb 5oz-4lb 8oz", "sal y pimienta negra recién molida", "Rodajas de limón", "200g / 7oz de polenta de cocción rápida"], "method": ["Precalentar el horno a 140C / Fan 120C / Gas 1.", "Coloque todos los ingredientes, excepto el cerdo, en una licuadora y mezcle hasta que estén suaves.", "Cubra una lata de asar con papel de aluminio, asegurándose de que haya suficiente papel aluminio colgando sobre los lados para doblar en un paquete. Coloque la carne de cerdo en la parte superior de la lámina y vierta sobre el adobo, dándose la vuelta para asegurarse de que esté completamente cubierto.", "Junte la lámina para hacer un paquete y luego colóquelo en el horno. Hornee durante 2-3 horas, asegurándose de comprobar después de 2 horas: la carne debe estar bien cocida y tierna, pero no debe caerse del hueso.", "Cocine la polenta de acuerdo con las instrucciones del paquete y sazone bien.", "Retire del horno y transfiera a una tabla de cortar. Verter los jugos de cocina y transferirlos a una olla pequeña. Cuando las costillas estén lo suficientemente frías para manipularlas, córtelas en las costillas individuales; es más fácil seguir el hueso levantando el hueso hacia arriba.", "Para terminar de cocinar, prepare una barbacoa, precaliente su parrilla o caliente una sartén hasta que esté demasiado caliente para sostener su mano. Ase a la parrilla o en plancha las costillas hasta que estén bien doradas y bien carbonizadas en algunos lugares, esto debería tomar 3-4 minutos en cada lado.", "Vuelva a calentar los jugos de la sartén y sirva en el lado con las costillas, junto con las rodajas de limón y la polenta."], "url": "www_bbc_co_uk_food_recipes_calabrian_pork_ribs_75821", "title": "Costillas de cerdo de Calabria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/calabrian_pork_ribs_75821_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 calamares grandes incluyendo tentáculos, limpios", "3 cucharaditas de aceite de oliva extra virgen, más extra a llovizna", "2 dientes de ajo, finamente picados", "4 filetes de anchoa", "1 cucharada de alcaparras", "200ml / 7fl oz de vino blanco seco", "Pan blanco de 100 g / 3½ onzas, sin corteza, finamente picado", "40 g / 1½ oz de piñones", "½ limón, solo ralladura", "1 cucharada de perejil recién picado", "sal y pimienta negra recién molida", "1 cabeza radicchio, hojas separadas", "1 cebolla roja pequeña, finamente rebanada", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida"], "method": ["Para preparar el calamar, retira los tentáculos del cuerpo. Sienta dentro del cuerpo la pluma (se asemeja a un pedazo de plástico). Sácalo del calamar y deséchalo. Enjuague dentro del cuerpo del calamar en agua fría. Tire de las orejas (aletas similares a alas) del cuerpo. Tire de la piel purpura de las orejas y el cuerpo para dejar solo la carne blanca. Cortar los tentáculos lejos de las tripas cortando justo debajo de los ojos. Compruebe el centro de los tentáculos para el pico duro, que puede ser descartado. (Deseche las tripas del calamar o, si lo desea, conserve el saco de tinta para usar en pasta de mariscos o risotto). Raspe cualquier rastro de agallas que haya quedado dentro del cuerpo. Deberías terminar con cuatro calamares perfectos como sacos listos para llenar. Corte aproximadamente la mitad de los tentáculos y déjelos a un lado.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Lubrique ligeramente una fuente grande para hornear.", "Caliente el aceite de oliva en una cacerola, agregue el ajo, las anchoas y las alcaparras. Freír durante unos minutos, revolviendo con una cuchara de madera hasta que las anchoas se hayan disuelto. Agregue los tentáculos picados y saltee durante unos 5 minutos, luego agregue el vino y permita que se evapore. Sazonar con sal y pimienta, al gusto. Retirar del fuego y reservar para enfriar.", "Agregue el pan, los piñones, la ralladura de limón y el perejil. Llene cada calamar con esta mezcla y meta los tentáculos reservados en los extremos. Coloque en la fuente de horno preparada, rocíe con aceite de oliva virgen extra, cubra con papel de aluminio.", "Hornee en el horno durante 45 minutos, luego retire la lámina y hornee por otros 15 minutos, hasta que estén ligeramente dorados.", "Para la ensalada, coloca las hojas y la cebolla en un bol. En un tazón pequeño separado, combine el aceite, el vinagre, la sal y la pimienta para formar un aderezo.", "Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle. Sirve junto al calamar."], "url": "www_bbc_co_uk_food_recipes_calamari_ripieni_22036", "title": "Calamar relleno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Harina común 110g / 4oz", "sal y pimienta negra recién molida", "pizca de cayena", "2 calamares pequeños, limpios y cortados en anillos", "1 calabacín, cortado en rodajas", "5 tomates secados al sol", "7 aceitunas verdes, piedras quitadas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para el calamar frito y el calabacín, vierta el aceite vegetal en una sartén a una profundidad de 1 cm / ½ pulgada y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque la harina en un recipiente, sazone con sal y pimienta negra recién molida y una pizca de pimienta de cayena y revuelva. Sumerja los anillos de calamar en la harina sazonada para cubrir, sacudiendo cualquier exceso, y fríe durante 2-3 minutos, o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Repita el proceso con las piezas de calabacín.", "Para tapenade, coloque los tomates secados al sol, las aceitunas y el aceite en un procesador de alimentos pequeño, sazone con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "Para servir, coloque los anillos de calamar frito y el calabacín en un plato con un tazón pequeño de tapenade."], "url": "www_bbc_co_uk_food_recipes_calamariezucchinifri_85378", "title": "Calamar frito y calabacín con aceituna verde y tapenade de tomate secado al sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cebollas medianas, picadas", "8 dientes de ajo, aplastados", "2 pimientos verdes grandes, en rodajas", "75ml / 2½fl oz de aceite de oliva", "60g / 2¼oz de perejil de flatillo picado", "una buena pizca de azafrán", "Papas de 450g / 16oz, cortadas en cubitos", "2 o 3 hojas de laurel", "12 granos de pimienta", "4 grandes tomates maduros jugosos, picados", "75ml / 2½ fl oz de pasta de tomate", "500ml / 17½ fl oz de vino blanco seco", "250ml / 8¾fl oz de agua", "450g / 1lb de calamar, limpiado", "25 almejas o berberechos", "Pescado azul de 900g / 2lb como caballa, pez espada o atún", "Pescado blanco de 900g / 2lb como lubina, rape, merluza o abadejo", "225 g / 8 oz buenas gambas crudas grandes", "24 mejillones", "pimienta negra recién molida", "30g de cilantro fresco picado"], "method": ["Poco a poco sudar la cebolla, el ajo y los pimientos verdes en el aceite de oliva durante unos 10 minutos. Después de sudar, cubra el guiso muy suavemente por unos 15 minutos, revolviendo ocasionalmente. Esto descompone el pimiento verde a una forma más sabrosa.", "Agregue el perejil, el azafrán, las papas, las hojas de laurel, los granos de pimienta, los tomates, la pasta de tomate, el vino y el agua. Cubra y cocine a fuego lento durante diez minutos.", "Agregue el calamar y las almejas o los berberechos y cocine a fuego lento durante otros diez minutos.", "Agregue los pescados, las gambas y los mejillones en capas. No revuelva esto ya que querrá que el pescado se cocine en el caldo.", "Espolvoree con una fuerte dosis de pimienta negra, cubra y cocine durante unos diez minutos o hasta que el pescado esté bien cocido y los mejillones y las almejas o los berberechos estén abiertos. Descarta cualquiera que no se abra.", "Vierte el estofado suavemente en tazones del tamaño de un recipiente y espolvorea con el cilantro picado.", "Sirve con pan También nos gusta ofrecer un poco de piri piri como salsa de inmersión junto con un poco de aceite de oliva mezclado con un poco de aceite de trufa para sumergir el pan."], "url": "www_bbc_co_uk_food_recipes_caldeiradaportuguese_73582", "title": "Guiso (estofado de pescado monstruo portugués)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tubos de calamar de 450 g / 1 lb", "aceite vegetal, para freír", "ramitas de perejil fritas, para adornar (opcional)", "limas, para servir", "3 papayas", "100ml / 3½fl oz de aceite de oliva", "1 lata (350-400g / 12-14oz) de palmito", "1 diente de ajo, finamente picado", "1 chile rojo, sin semillas y finamente picado", "1 nivel de azúcar en cucharadita", "1 limón, solo jugo", "sal", "6 huevos, separados", "Harina blanca llana 225g / 8oz", "150ml / ¼ pinta de leche entera", "un vaso de vino lleno de hielo"], "method": ["Primero prepare el palmito y el aderezo de papaya. Pele las papayas, córtelas por la mitad y saque las semillas. Picar la carne de papaya en cubos pequeños.", "Caliente el aceite de oliva en una cacerola y agregue la papaya. Caliéntelo suavemente durante 30 segundos, luego retírelo del fuego.", "Corta los palmitos tan finamente como puedas y mezcla la papaya. Agregue el ajo, chile picado, azúcar, jugo de limón y una pizca de sal. Mezcle bien y vierta en una jarra de servir.", "Ahora haga la masa (necesita dos tazones para mezclar impecablemente limpios y un batidor). Envuelva una toalla de té alrededor de la base de un tazón con los huevos y comience a batir las yemas. Mientras está batiendo, tamice 100 g / 4 oz de la harina en las yemas para formar una pasta. Trata de poner tanto aire en la mezcla de rebozado como puedas.", "Agregue la leche y los cubitos de hielo, luego continúe batiendo y tamice en la mitad de la harina restante.", "Con un batidor limpio, bata las claras de huevo hasta que estén esponjosas (consistencia de espuma). Vierte las claras de huevo sobre la mezcla y dóblalas muy suavemente, solo 3-4 veces.", "Asegúrese de que su calamar esté limpiado adecuadamente y corte los tubos en anillos. Coloque todos los que pueda en una bandeja grande, espolvoree con la harina restante y sazone con sal. Despeje ambas superficies y asegúrese de que esta tarea tenga toda su concentración durante los próximos 10 minutos.", "Caliente el aceite a fuego moderado hasta que la superficie del aceite esté brillante (PRECAUCIÓN: el aceite caliente puede ser muy peligroso. No lo deje desatendido). Ahora sumerja suavemente los calamares en la mezcla 5-10 a la vez. Saque, escurra el exceso de masa e inmediatamente vierta en el aceite caliente, uno por uno, y cocine durante aproximadamente 4-5 minutos hasta que estén bien coloreados. Con un tenedor, selecciona cada anillo y colócalo en papel de cocina para drenar.", "Repita hasta que todos los calamares estén cocidos.", "Para servir, apilar los calamares y verter sobre el aderezo, con un chorrito de lima."], "url": "www_bbc_co_uk_food_recipes_calamarifrites_72786", "title": "Frituras de calamar", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace aprox. 50 anillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de pan rallado fresco", "100 g / 3½ oz de queso feta, desmenuzado", "1 chile rojo, picado", "1 cucharadita de orégano fresco, picado", "1 cucharadita de perejil fresco de flatleaf, picado", "2 cucharadas de aceite de oliva", "6 pequeños calamares, limpios", "6 palitos de cóctel de madera", "1 cebolla mediana, finamente picada", "2 dientes de ajo, finamente picados", "1 lata de tomates picados", "½ cucharadita de orégano seco", "1 cucharadita de azúcar", "100 g / 3½ oz de queso feta, desmenuzado, para servir"], "method": ["En un tazón, combine las migas de pan, el queso feta, el chile, las hierbas y el aceite de oliva.", "Rellene los tubos de calamares hasta que estén llenos dos tercios. Cierre los extremos con palitos de cóctel de madera.", "Hilvanar con aceite y pinchar dos veces. Coloque en una sartén caliente y cocine hasta que se queme en ambos lados.", "Para hacer la salsa de tomate, fríe con cuidado la cebolla y el ajo antes de agregar los tomates picados, el orégano y el azúcar. Llevar a ebullición y reducir el fuego, hirviendo a fuego lento hasta que la salsa se espese.", "Para servir, ponga la salsa en un plato para servir, espolvoree sobre el queso feta y coloque los calamares encima."], "url": "www_bbc_co_uk_food_recipes_calamari_72401", "title": "Calamar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas grasas, finamente picadas", "4 dientes de ajo, aplastados", "60ml / 2¼fl oz de aceite de oliva", "1 chorizo", "6 papas grandes", "1,5 litros / 2 pintas 13 fl oz. Buenas verduras o caldo de pollo", "sal y pimienta negra recién molida, al gusto", "2 hojas de laurel", "gran manojo de verduras o repollo", "pimentón ahumado y aceite de oliva, para aderezar"], "method": ["Suavemente fríe la cebolla y el ajo en el aceite de oliva hasta que estén suaves y translúcidos.", "Picar el chorizo ​​en trozos pequeños y agregar a la sartén con la cebolla.", "Freír las cebollas y la salchicha por unos minutos más y luego agregar las patatas cortadas en cubitos. Absorben todo el sabor de la salchicha.", "Transfiera la mezcla a una sartén grande, agregue el caldo, el aderezo y las hojas de laurel, y cocine hasta que las papas estén blandas.", "Mientras tanto, pique muy finamente el repollo (alternativamente, compre una máquina para triturar repollo del mercado como lo hicimos nosotros).", "Cuando las papas estén listas, aplastelas en el caldo para hacer una base gruesa. Blanquee los greens en agua hirviendo durante un minuto para eliminar cualquier amargor, escurrir y agregar al caldo hirviendo a fuego lento.", "Agregue tanto repollo como soporte el caldo - si desea sopa pesada agregue cargas de verduras, si es más liviano, agregue menos.", "Cocine a fuego lento durante unos minutos. La sopa tendrá el color de jade.", "Mezcle el pimentón ahumado con un poco de aceite de oliva para hacer un aderezo, y mezcle esta magia roja en la sopa verde vibrante. Sirve con un poco de pan de campo rústico."], "url": "www_bbc_co_uk_food_recipes_caldoverdeportuguese_73565", "title": "Caldo verde (Portuguese cabbage soup)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "¡Hace 1 olla grande!", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caldoverdeportuguese_73565_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150 g / 5 oz de filetes de salmón ahumados en caliente (es decir, cocidos)", "4 cucharadas de miel clara", "1 cucharada de salsa de soja", "Jengibre fresco de 5cm / 2in, pelado, rallado", "200g / 7oz de mayonesa hecha a mano", "2½ cucharadas de salsa de soja ligera", "1 cucharadita de azúcar", "1 cucharada de vinagre de arroz", "2 cucharaditas de agua", "Hojas de espinaca bebé 400 g / 14 oz", "100g / 3½oz de tomates enrojecidos por el sol", "50g / 2oz de piñones, tostados", "4 cebolletas, finamente cortadas", "1 lima, cortada en cuñas", "cilantro de racimo pequeño, solo hojas"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para el salmón, coloca la miel y la salsa de soja en una sartén y llévala a ebullición. Cocine por 2-3 minutos, hasta que espese y combine.", "Cepille la mezcla de miel y salsa de soja en los filetes de salmón. Transfiera a una bandeja para hornear y colóquela en el horno durante 5-6 minutos, para que se caliente.", "Para el aderezo, coloque el jengibre en una pieza de muselina limpia y exprima el jugo en un tazón.", "Agregue la mayonesa, la salsa de soya, el azúcar y el vinagre de arroz al jugo de jengibre y mezcle bien.", "Agregue un poco de agua si la mezcla es demasiado espesa, debería ser la consistencia de la crema doble.", "Para la ensalada, coloque las hojas de espinaca, los tomates, los piñones y las cebolletas en un tazón grande y mezcle bien.", "Para servir, coloque la misma cantidad de mezcla de ensalada en cuatro tazones. Coloque una porción del aderezo en cada porción y coloque un trozo de salmón encima.", "Adorne con trozos de lima y espolvoree con hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_californianhotsmoked_89576", "title": "Ensalada californiana de salmón ahumado en caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 puñados de verduras de primavera o callallo o espinacas frescas", "dash aceite de oliva", "2 dientes de ajo, aplastados", "1 manojo de cebollas de primavera, picadas", "sal y pimienta negra recién molida", "2 cucharadas de vinagre de vino blanco", "100 ml / 3½ fl oz de caldo de pollo (los vegetarianos pueden sustituirlo con caldo de verduras)", "sal y pimienta negra recién molida (o sustituir la sal con salsa de soja o tamari)"], "method": ["Lave los greens con un grifo frío. Escurrir bien, luego picar y reservar.", "Vierta el aceite de oliva en una sartén de base pesada, agregue el ajo machacado y las cebolletas. Cocine por unos minutos hasta que estén suaves pero no coloreados, luego agregue los vegetales picados, un puñado a la vez.", "Si la sartén comienza a desbordarse, deje las verduras durante 1-2 minutos para cocinar, luego agregue el resto.", "Después de unos minutos de cocción, agregue gradualmente el vinagre y el caldo - no agregue mucho caldo que los verdes se empapen. Agregue sal (o salsa de soja o tamari) y pimienta negra recién molida al gusto.", "Cuando los greens estén tiernos y brillantes, retírelos del fuego y transfiérelos a un plato para servir. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_callalooinspiredgree_86193", "title": "Verdes inspirados en Callaloo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "2-3 chalotes, en rodajas", "1 cucharadita de harina común", "1 cucharadita de mostaza Dijon", "2 cucharaditas de hojas frescas de tomillo", "200ml / 7fl oz de vino tinto", "500ml / 18fl oz de caldo de carne", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco finamente picado", "2kg / 4lb 6oz de papas, peladas y cortadas en cuartos", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de leche entera", "1 cucharadita de levadura fresca", "400ml / 14fl oz de cerveza", "Harina normal de 300g / 11oz", "2 cebollas pequeñas, cortadas finamente en anillos", "50 g / 1¾oz de mantequilla sin sal", "1 repollo hispi, en rodajas finas", "50g / 1¾oz de harina natural, para recubrimiento", "8 rebanadas finas de hígado de ternera", "50 g / 1¾oz de mantequilla sin sal"], "method": ["Para la salsa, caliente la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumante, agregue los chalotes y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue la harina y la mostaza y revuelva bien para combinar, y luego cocine por un minuto más.", "Agregue el vino tinto y el tomillo, revuelva bien y ponga la mezcla a ebullición. Reduzca el fuego a fuego lento y luego cocine a fuego lento hasta que el volumen de líquido se haya reducido en un tercio.", "Agregue el caldo de carne y devuelva la mezcla a ebullición. Reduzca ligeramente el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que el líquido se haya espesado. Agregue el perejil y la sazón, al gusto, con sal y pimienta negra recién molida. Mantenga caliente hasta que esté listo para servir.", "Para el puré cremoso, hervir las papas en agua con sal durante 15 minutos, o hasta que estén tiernas. Drene y coloque las papas de nuevo en la cacerola sobre el fuego para eliminar el exceso de humedad. Mash las patatas.", "Caliente la mantequilla y la leche en una cacerola hasta que la mantequilla se derrita. Agregue al puré y bata bien hasta que esté suave y cremoso. Finalmente sazone con sal y pimienta negra recién molida. Coloque en una manga pastelera hasta que lo necesite y manténgalo caliente.", "Para los anillos de cebolla crujientes, coloque la levadura y la cerveza en un bol y mezcle. Agregue 200 g / 7 oz de la harina común y mezcle con una batidora suave. Dejar de lado por cinco minutos. - [necesita resto del método para freír los aros de cebolla]", "Mientras tanto, para col hispi calentar la mantequilla con 50 ml / 2 fl oz de agua para hacer una emulsión. Agregue el repollo, cubra con una tapa y deje hervir durante 2-3 minutos. Condimentar con sal y pimienta.", "Para el hígado de ternera, sazone la harina común con sal y pimienta y coloque las rodajas de hígado de ternera y sacuda el exceso.", "Calentar la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue las rodajas de hígado de los terneros sazonados y fríe durante 1-2 minutos por cada lado, o hasta que estén doradas por ambos lados.", "Para servir, vierta el puré en platos para servir y agregue el repollo y el hígado al costado. Vierta sobre la salsa y cubra con los aros de cebolla y el perejil."], "url": "www_bbc_co_uk_food_recipes_calves_liver_with_saut_29001", "title": "Hígado de ternera con repollo hispi salteado, puré de patata, aros de cebolla crujientes y salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "2 cebollas rojas, finamente cortadas", "sal y pimienta negra recién molida", "4 rebanadas delgadas de hígado de ternera, cortadas en tiras finas", "1 cucharada de vinagre de Jerez", "1 cucharada de crème de cassis", "1 cucharada de perejil fresco picado"], "method": ["Caliente una cucharada de aceite de oliva y toda la mantequilla en una sartén de base pesada. Freír las cebollas a fuego lento durante 30 minutos o hasta que estén suaves. Sazonar ligeramente con sal y pimienta negra recién molida, colocar en un recipiente y reservar.", "Calentar el aceite de oliva restante en la sartén hasta que esté caliente. Sazonar el hígado del ternero con sal y pimienta negra recién molida y freír durante 30 segundos (debe mantener el color rosa en el interior). Retire y agregue a las cebollas en el tazón y mezcle.", "Coloque el hígado y las cebollas en la sartén. Caliente rápidamente y agregue el vinagre, la crème de cassis y el perejil.", "Coloque el hígado y las cebollas en platos calientes y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_calves_liver_with_sweet_88165", "title": "Hígado de ternera con cebollas agridulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/calves_liver_with_sweet_88165_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "Hígado de 250 g / 9 oz de ternera, cortado en láminas finas y cortado por la mitad a lo largo", "aprox. 4 cucharadas de puerto o Madeira", "2 cucharaditas de vinagre de vino tinto", "100 ml / 3½ fl oz de carne de res fresca o caldo de pollo (compre preparado en una bañera)", "250g / 9oz de pasta fresca o 200g / 7oz de pasta seca", "½ cucharada de salvia fresca picada o una buena pizca de salvia seca", "1 cucharada de crème fraiche (opcional)", "sal marina y pimienta negra recién molida"], "method": ["Caliente una olla grande de agua ligeramente salada hasta que hierva para la pasta.", "Mientras tanto, caliente la mitad de la mantequilla con el aceite en una sartén hasta que ya no haga espuma ni se sienta caliente.", "Agregue el hígado y fría por 1-2 minutos por cada lado hasta que se dore bien y firme cuando lo presione con la parte trasera de un tenedor.", "Sazonar en la sartén, luego retirar a un plato caliente y mantener caliente.", "Agregue el puerto o Madeira a la sartén, deje hervir y deje que burbujee hasta que se reduzca a la mitad.", "Agregue el vinagre y cocine por unos segundos.", "Verter en el caldo y llevar a ebullición, revolviendo. Continúe hirviendo hasta que se reduzca a la mitad.", "Mientras tanto, agregue la pasta a la cacerola de agua hirviendo y cocine por 2-3 minutos para la pasta fresca o de acuerdo con las instrucciones del paquete para la pasta seca hasta que esté tierna.", "Escurrir, luego mezclar con la mantequilla restante y el salvia fresco o seco.", "Sazonar bien la pasta y dividir entre dos platos calentados.", "Coloque el hígado sobre la parte superior (es posible que desee cortarlo primero).", "Bate la crème fraîche en la salsa en la sartén, si se usa. Controle el condimento y espolvoree el hígado. Servir inmediatamente"], "url": "www_bbc_co_uk_food_recipes_calvesliverwithportf_73602", "title": "Hígado de ternera con jugos de sartén con sabor a babor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]