[{"ingredients": ["250g / 9oz de lentejas de urad negro gramo, empapadas en agua tibia durante la noche", "2½ litros / 4½ pintas de agua", "1 cucharadita de pasta de jengibre", "1 cucharadita de pasta de ajo", "1 cucharadita de sal", "1½ cucharadita de chile rojo en polvo", "2 cucharadas de puré de tomate", "150g / 5oz de mantequilla ligeramente salada", "1 cucharadita de sal masala", "1 cucharadita de hojas secas de fenogreco seco", "½ cucharadita de azúcar", "50ml / 2fl oz de crema individual", "35g / 1¼ oz de azúcar", "2 huevos de gallinas camperas", "400ml / 14fl oz de leche entera", "750g / 1lb 11 oz de harina común", "1 cucharada de sal", "50ml / 2fl oz de aceite vegetal", "1½ cucharadita de polvo de hornear", "2 cucharadas de cilantro fresco picado y ajo", "2 cucharadas de semillas de cebolla negra", "3 cucharadas de mantequilla derretida", "2 pechugas de paloma deshuesadas y despellejadas", "2 cucharaditas de pasta de jengibre y ajo", "1/3 cucharadita de sal", "1 cucharadita de polvo de chile rojo de Cachemira", "½ limón, solo jugo", "½ cucharadita de semillas de comino", "4 dientes", "1 cucharada de yogur", "1 pizca de azúcar", "½ cucharadita de sal masala", "1 cucharada de aceite vegetal", "Pepino de 15cm / 6 pulgadas, finamente cortado en cubitos", "1 tomate, semillas eliminadas, picadas", "1 cebolla roja, finamente picada", "½ limón, solo jugo", "1 pizca de sal", "1 pizca de azúcar"], "method": ["Para las lentejas negras, hierva las lentejas empapadas en agua en una olla grande hasta que las lentejas estén bien cocidas, pero no estén completamente machacadas, aproximadamente una hora.", "Agregue el jengibre, el ajo, la sal y el chile rojo en polvo y cocine a fuego lento durante otros 10 minutos.", "Agregue el puré de tomate y la mantequilla y cocine por otros 15 minutos o hasta que las lentejas estén gruesas. Tenga cuidado de que la mantequilla no se separe de las lentejas.", "Agregue el garam masala, las hojas secas de alholva y el azúcar. Pruebe y agregue sal y pimienta negra recién molida si es necesario, luego mezcle con la crema. Mantener caliente", "Para el pan naan, precaliente el horno a 225C / 450F / Gas 8 y coloque una bandeja de horno gruesa en el horno para calentar.", "Batir el azúcar, los huevos y la leche en un tazón. En un recipiente aparte, combine la harina, el polvo de hornear y la sal.", "Agregue la mezcla de leche a la mezcla de harina y amasar ligeramente para hacer una masa suave: tenga cuidado de no trabajar demasiado la masa o se pondrá demasiado elástica.", "Cuando todos los ingredientes estén bien mezclados, cúbralos con un paño húmedo y déjelos reposar, en un lugar cálido, durante 15 minutos.", "Una vez que haya descansado, vierta sobre el aceite y elimine el aire de la masa.", "Divida la masa en 16 bolas del mismo tamaño y extiéndalas en un círculo de aproximadamente 10 cm de diámetro.", "Extienda los círculos en la bandeja caliente en el horno, esparza la cebolla y el cilantro sobre la mitad del naan y las semillas de cebolla negra sobre la otra mitad. Hornee durante 4-5 minutos; es posible que deba doblar el pan para asegurarse de que esté todo cocido. También es muy probable que necesite cocinar el pan en tandas. Cepillar con mantequilla derretida.", "Adore a la paloma de pichón mientras la masa descansa: seque los senos de paloma con papel de cocina, luego colóquelos en un bol con la pasta de jengibre y ajo, sal, chile en polvo y jugo de limón.", "Seque el comino y los clavos de olor ligeramente en una sartén caliente y triture groseramente con un mortero y una mano de mortero.", "Mezcle la mezcla de comino y clavo con el yogur, el azúcar, el garam masala y el aceite para hacer un segundo adobo.", "Agregue el adobo de yogur a los senos y déjelo a un lado durante 10-15 minutos. Caliente un tandoor a 250-300C / 480F-570F (o alternativamente precaliente el horno a 200C / 400F / Gas 6).", "Ensarte la carne en los pinchos y cocine en el tandoor durante 4-5 minutos. Alternativamente, fría los pechos en una sartén muy caliente durante aproximadamente un minuto a cada lado y luego colóquelos en el horno para que se cocinen durante cinco minutos.", "Retire la carne de los pinchos, deje reposar por un par de minutos y sirva inmediatamente.", "Para la ensalada kachumber, mezcle todos los ingredientes en un tazón.", "Para servir, corte los senos en dos a lo largo. Coloque las lentejas negras en un plato y coloque los pechugas en la parte superior. Coloque la ensalada y el pan naan al costado."], "url": "www_bbc_co_uk_food_recipes_tandoori_breast_of_squab_58130", "title": "Tandoori pechuga de paloma, lentejas negras, ensalada kachumber y pan naan", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 muslos de pollo (pierna y muslo), piel quitada", "300 ml / 10½ fl oz de yogur natural", "1 cucharadita de sal masala", "1 cucharadita de comino molido", "1 cucharada de chile en polvo", "½ cucharadita de cúrcuma molida", "½ cucharadita de canela molida", "Jengibre fresco de la raíz de los 5cm / 2in, piel encendido, rallado fino", "1 diente de ajo, finamente picado", "1 limón, solo jugo", "1 chile verde, finamente picado", "1 diente de ajo, finamente picado", "½ pepino, piel y semillas retiradas, finamente cortadas en cubitos", "½ cucharadita de comino molido", "2 cucharadas de hojas de menta fresca finamente picadas", "2 cucharadas de hojas de cilantro fresco finamente picado", "200 ml / 7 fl oz oz yogur", "1 lima, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Para las baquetas, usando el talón de un cuchillo pesado, picar la parte superior de los muslos de pollo en la articulación, para quitar el nudillo.", "Voltee cada baqueta y corte la parte inferior del hueso, luego empuje la carne hacia la parte inferior del hueso para que se vea como una bolita en la parte inferior de la baqueta. Usando un par de pinzas, saque los tendones del hueso y deséchelos. Pon los muslos a un lado.", "En un tazón, mezcle 100 ml / 3½ fl oz del yogur con todos los ingredientes restantes del muslo hasta que estén bien combinados. Agregue el yogur restante y mezcle.", "Agregue los muslos al adobo de yogur y agítelos hasta que estén completamente cubiertos en el adobo. Cubra el tazón con película adhesiva y enfríe en la nevera durante al menos 4 horas o durante la noche.", "Cuando los muslos se hayan marinado, precaliente el horno a 200C / 180C Fan / Gas 6.", "Retire los muslos del adobo, sacudiendo cualquier exceso. Siéntelos en posición vertical sobre una bandeja para hornear, luego tueste en el horno durante 10-15 minutos, o hasta que el adobo se dore y el pollo esté bien cocido en su parte más gruesa y no queden rastros de restos rosados.", "Mientras tanto, para la raita, en un tazón, mezcle el chile, el ajo y el pepino.", "Agregue el comino, la menta y el cilantro.", "Agregue el yogur y el jugo de lima, revuelva bien, y sazone, al gusto, con sal y pimienta negra recién molida. Enfríe en el refrigerador hasta que esté listo para servir.", "Para servir, apile los muslos en un plato grande para servir, con los huesos hacia arriba. Coloque la raita en un tazón y colóquelo al lado para que todos se sirvan a sí mismos."], "url": "www_bbc_co_uk_food_recipes_tandoori_chicken_62227", "title": "Muslos de paleta de pollo Tandoori con salsa raita", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4 como principal o 6 como titular", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_chicken_62227_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de muslo de pollo de 450 g / 1 lb, recortados de grasa y cortados en 4 tiras", "Yogur natural de 75 g / 2½ oz", "2 cucharadas de mezcla de tikka spice curry", "cilantro fresco pequeño grupo, picado (opcional)", "cuñas de lima, para servir"], "method": ["Mezcle las tiras de pollo, el yogur y la pasta tikka en un bol. Cubra con una película adhesiva y déjela en el refrigerador para marinar durante 20 minutos, o hasta 4 horas. Remoje los pinchos de bambú en agua durante al menos 20 minutos.", "Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Coloque 2 bandejas para hornear en el horno para precalentar.", "Enrosque 1 o 2 tiras de pollo en cada pincho, no demasiado apretadas, ya que esto puede causar una cocción desigual. Coloque los pinchos de pollo en las bandejas de horneado precalentadas, bien separados y hornee por 20 minutos, girando a la mitad. Es posible que deba inclinar algunos jugos de cocción fuera de la bandeja de hornear cuando los gire para que los pinchos se doren muy bien.", "Verifique que el pollo esté completamente cocinado antes de servir. Servir esparcido con cilantro recién picado y rodajas de lima en el lateral."], "url": "www_bbc_co_uk_food_recipes_tandoori_chicken_party_86717", "title": "Brochetas de pollo Tandoori", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15 pinchos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_chicken_party_86717_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x pollo entero, sin piel, unida", "200ml / 7fl oz de yogur", "2 cucharaditas de jengibre y pasta de ajo", "½ cucharadita de chile en polvo", "1 cucharadita de cilantro molido", "¼ cucharadita de canela molida", "½ cucharadita de sal masala", "2 cucharaditas de jugo de limón", "½ cucharadita de mango en polvo (disponible en tiendas especializadas de Asia)", "½ cucharadita de polvo de hoja de fenogreco", "1 cucharada de harina de garbanzo", "1 cucharadita de agua de azafrán o ¼ de cucharadita de color naranja comestible", "1 cucharadita de aceite vegetal", "pizca de sal", "50g / 2oz de mantequilla derretida, para hilvanar", "1 cucharada de chat masala (disponible en tiendas especializadas de Asia), para servir", "1 cuña de lima, para servir", "Garbanzos negros de 200 g / 7 oz, germinados o cocidos", "110 g / 4 oz de lentejas verdes, germinadas o cocidas", "pequeño racimo de berros", "pequeño racimo bebé acelgas rojas hojas", "1 tomate, picado", "1 cebolla roja picada", "1 pepino, picado", "1 cucharada de hojas de cilantro fresco picado", "½ cucharadita de jengibre fresco picado", "3 cucharadas de aceite vegetal", "1 cucharadita de jugo de lima", "pizca de sal", "azúcar pizca", "1 chile verde picado (opcional)", "½ cucharadita de semillas de comino, tostadas, molidas", "1 tsp chat masala (disponible en tiendas especializadas de Asia)", "200 g / 7 oz de hojas de menta fresca", "110g / 4oz de hojas frescas de cilantro", "2 cucharadas de cebollas rojas picadas", "2 cucharadas de jugo de limón", "1 chile verde, picado finamente", "½ cucharadita de sal", "½ cucharada de aceite vegetal", "5 cucharadas de yogur de estilo griego"], "method": ["Haga incisiones profundas en las pechugas de pollo, muslos y baquetas.", "Batir el yogur en un tazón grande, agregar los ingredientes del adobo restante y mezclar hasta que estén bien combinados.", "Frote el adobo sobre el pollo hasta que esté completamente cubierto, luego enfríelo en la nevera durante 3-4 horas.", "Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el pollo en el estante sobre una bandeja de asar y cocine en el horno durante 15-20 minutos (o en una parrilla de carbón durante aproximadamente 12 15 minutos hasta que esté cocido).", "Precalentar la parrilla a alto.", "Retire el pollo del horno y descanse por 2-3 minutos. Hilvane bien con mantequilla y tueste bajo la parrilla durante 3-4 minutos, o hasta que los jugos salgan limpios cuando el pollo esté perforado con una brocheta y esté completamente cocido.", "Para la ensalada, mezcle los ingredientes y reserve.", "Batir los ingredientes del aderezo en un recipiente juntos hasta que estén bien combinados y verter sobre la ensalada.", "Para la chutney de menta, coloque todos los ingredientes, excepto el yogur, en un procesador de alimentos y mezcle hasta que estén bien combinados.", "Retire la mezcla del procesador de alimentos y mezcle con el yogur hasta que estén bien combinados. Agregue sal y pimienta negra recién molida al gusto, y enfríe en el refrigerador hasta que se requiera.", "Exprima el jugo de lima sobre el pollo, el polvo con chat masala y sirva con la ensalada de lentejas y el chutney a la menta."], "url": "www_bbc_co_uk_food_recipes_tandoori_chicken_with_45215", "title": "Pollo tandoori con ensalada de lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1½ cucharada de tandoori masala", "3 cucharadas de yogur griego", "2 x 100g / 3½oz pedazos de filete de bacalao sin piel", "¼ de cebolla roja, finamente rebanada", "5 hojas de menta fresca, finamente cortadas", "100g / 3½oz de pepino en vinagre, escurrido", "4 rebanadas de brioche", "sal y pimienta negra recién molida"], "method": ["Ponga 2 cucharadas de aceite, el tandoori masala, 1 cucharada de yogur y una pizca de sal en un recipiente mediano y revuelva. Agregue el bacalao y cubra bien.", "Caliente las 2 cucharadas restantes de aceite en una sartén pequeña a fuego medio. Una vez que esté caliente, baje la temperatura ligeramente y agregue el bacalao. Cocine suavemente durante 2-3 minutos por cada lado, luego quite el fuego y déjelo a un lado, cubierto con papel de cocina.", "Coloque la cebolla roja y la menta en otro recipiente con los pepinillos encurtidos, mezcle y sazone con sal y pimienta.", "Tueste ligeramente las rebanadas de brioche y distribuya las 2 cucharadas restantes de yogur sobre dos rebanadas. Coloque un trozo de bacalao encima de cada una y cubra con la mezcla de cebolla, menta y pepinillo. Cierre los sándwiches con las rebanadas restantes de brioche tostado. ¡Disfrutar!"], "url": "www_bbc_co_uk_food_recipes_tandoori_cod_burger_93602", "title": "Hamburguesa de bacalao Tandoori", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_cod_burger_93602_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pato de 1.8kg / 4lb, salpicado de espinas (columna vertebral removida, pato aplanado)", "2 cucharadas de pasta de tamarindo", "1 cucharada de miel", "1 cucharadita de cilantro molido", "½ cucharadita de cúrcuma molida", "4 pak choi, descuartizado", "2 mangos, pelados, sin hueso, cortados en rebanadas gruesas", "150g / 5oz de brotes de soja", "1 cucharada de aceite de sésamo", "2 cucharadas de salsa de soja", "½ cucharadita de pasta de tamarindo", "½ cucharadita de jengibre fresco, pelado, rallado", "4 cucharadas de semillas de sésamo, tostadas, para servir"], "method": ["Precalentar el horno a 230C / 445F / Gas 8.", "Para el pato, coloque el pato con la carne hacia abajo en una bandeja grande para hornear.", "Batir el tamarindo, la miel, el cilantro molido y la cúrcuma en un bol.", "Cepille la piel del pato con la mezcla de miel y especias, para cubrir completamente.", "Ase el pato en el horno durante 40-50 minutos (por poco común), o hasta que esté cocido a su gusto, luego retírelo y déjelo reposar durante diez minutos.", "Para la ensalada, caliente una sartén hasta que esté caliente.", "Poner a hervir una sartén con agua con sal, luego agregar el pak choi y hervir durante un minuto. Escurra el pak choi, luego colóquelo en la sartén de la plancha y cocine hasta que esté carbonizado por todos lados. Retire y coloque en un tazón de servir.", "Coloque las rebanadas de mango sobre la plancha y cocine, volteándolas una vez, hasta que queden carbonizadas en ambos lados. Coloque en el tazón con el pak choi. Agregue los brotes de soja y mezcle suavemente.", "Batir el aceite de sésamo, la salsa de soja, el tamarindo y el jengibre juntos en un recipiente aparte, luego rociar sobre la ensalada. Mezclar bien.", "Para servir, esculpe el pato y coloque porciones iguales en cada plato. Coloque un poco de ensalada al lado y espolvoree con semillas de sésamo tostadas."], "url": "www_bbc_co_uk_food_recipes_tamarindduckwithchar_89939", "title": "Pato de tamarindo con ensalada de mango a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de sal masala", "½ cucharadita de canela molida", "1 cucharadita de chile en polvo", "1 cucharadita de comino molido", "2 dientes de ajo, aplastados", "Jengibre fresco de 5 cm / 2 pulgadas, finamente rallado", "200 ml / 7 fl oz oz yogur", "500g / 1lb 2 oz grandes gambas tigre, peladas y sin nervaduras, las colas quedan en", "2 limones, cortados por la mitad", "50g / 1¾oz de mantequilla", "1 cebolla roja, finamente picada", "2 dientes de ajo, finamente picados", "1 cucharadita de comino molido", "1 chile rojo, finamente picado", "3 tomates maduros, toscamente picados", "Crema doble de 200 ml / 7 fl oz", "Jengibre fresco de 5cm / 2in en pieza, pelado, aproximadamente picado", "2 cucharadas de hojas frescas de cilantro picado", "sal y pimienta negra recién molida"], "method": ["Para los camarones tandoori, en un tazón, mezcle todos los ingredientes de gambas tandoori, a excepción de los langostinos y el limón, hasta que estén bien combinados. Agregue las gambas y mezcle bien hasta que esté completamente cubierto en el adobo. Cubra y deje enfriar en la nevera durante al menos 20 minutos, preferiblemente durante la noche.", "Cuando las gambas se hayan marinado y 30 minutos antes de que desee comer, prepare su barbacoa. Permita que las llamas se enciendan y mueran hasta que los carbones brillen.", "Mientras tanto, para la salsa de mantequilla, derrita la mantequilla en una sartén a fuego medio. Agregue la cebolla roja y fría por 1-2 minutos, o hasta que se suavice. Agregue el ajo, el comino y el chile y fría por 1-2 minutos más.", "Agregue los tomates, la crema y el jengibre y lleve la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 4-5 minutos, o hasta que la salsa se haya espesado un poco y los tomates se hayan descompuesto. Agregue el cilantro y sazone, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Retire los langostinos del tazón, sacuda el exceso de adobo y enróllelo en cuatro brochetas de metal. Coloque los pinchos en la barbacoa y ase de 2 a 3 minutos por cada lado, o hasta que estén cocidos.", "Para servir, coloque los pinchos en platos para servir con una mitad de limón. Coloque una cucharada de salsa de mantequilla al lado de cada uno."], "url": "www_bbc_co_uk_food_recipes_tandoori_king_prawns_53087", "title": "Langostinos Tandoori con salsa de mantequilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoori_king_prawns_53087_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de cardamomo molido", "2 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "2 cucharaditas de cúrcuma molida", "½ cucharadita de canela molida", "¼ cucharadita de clavo de olor molido", "nuez moscada recién rallada", "2 cucharadas de chiles en polvo de Cachemira", "½ cucharadita de pimienta de cayena", "50g / 1¾oz de raíz de jengibre fresco, rallado", "6 dientes de ajo, aplastados", "500g / 1lb 2oz de yogur completo en grasa", "1 limón, solo jugo", "sal y pimienta negra recién molida", "8 gruesas chuletas de cordero, ribeteadas en francés", "6 filetes de muslo de pollo, despellejados, aplastados y cortados", "12 grandes langostinos crudos, sin cáscara, con la punta de la cola puesta, desvendadas", "Filete de salmón a 400 g / 14 oz, pelado", "racimo de eneldo fresco, muy finamente picado", "2 cucharadas de alcaparras escurridas, muy finamente picadas", "pan naan", "Rodajas de limón", "raita (opcional)"], "method": ["Mezcle todos los ingredientes del adobo y sazone con abundante sal y pimienta. Divida el adobo entre cuatro cuencos. Agregue el cordero, el pollo y las gambas a tres de los tazones.", "Revuelva el eneldo y las alcaparras en el recipiente restante y agregue el salmón. Masajear el adobo en las carnes, gambas y salmón, luego cubrir y marinar durante al menos 1 hora, de la noche a la mañana si es posible.", "Cuando esté listo para cocinar todo, caliente la parrilla a su nivel más alto. Coloque el pollo en un estante sobre una bandeja revestida y ase a la parrilla durante 4-5 minutos por cada lado (este es el tiempo que tomará el pollo después de haberlo aplanado; si no es plano, deberá cocinarlo durante más tiempo) . Eliminar y descansar. Agregue el cordero y cocine por 2-3 minutos en cada lado. De nuevo, quita y descansa.", "El salmón necesitará 4-5 minutos de cada lado, y finalmente las gambas necesitarán solo 2-3 minutos de cada lado, dependiendo de su tamaño. Podrías cocinar el pollo y el salmón juntos y el cordero y las gambas juntas si quieres. Sirva con pan naan, rodajas de limón y algo de raita en el costado."], "url": "www_bbc_co_uk_food_recipes_tandoori_mixed_grill_72067", "title": "Tandoori parrilla mixta", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de jengibre molido", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "½ cucharadita de pimentón", "½ cucharadita de cúrcuma", "nuez moscada pizca, rallado", "2 dientes, molidos", "1 palito de canela, aplastado", "1 cucharadita de pimienta de cayena", "3 cucharadas de aceite vegetal", "300ml / 10fl oz de yogurt natural", "4 darnes de salmón", "1kg / 2lb 4 oz de papas harinosas, como Maris Piper o King Edwards, cortadas en cubos de 3cm / 1¼in", "100ml / 3½ fl oz de aceite de oliva, para freír poco", "1 cucharadita de pimentón ahumado", "1 chile rojo, finamente cortado", "½ cucharadita de semillas de comino", "2 dientes de ajo, en rodajas finas", "400 g de lata de tomates picados", "4 tomates, semillas retiradas, cortadas en cubos de 3mm / ⅛in", "1 cebolla roja, en rodajas", "½ cucharadita de sal", "1 cucharadita de azúcar en polvo", "1 limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "1 cucharada de cilantro fresco finamente picado", "1 cucharada de menta fresca picada"], "method": ["Para el salmón tandoori, coloque todas las especias en un tazón mediano y mezcle con el aceite y el yogur. Unta la mitad de la pasta sobre el pescado y deja marinar en la nevera durante al menos una hora. Reserve la pasta restante para hacer una salsa.", "Mientras tanto, coloque las papas en una sartén grande con agua con sal y cocínelas durante 6-7 minutos, o hasta que estén tiernas. Escurrir bien.", "Calienta 3 cucharadas de aceite de oliva a fuego lento. Agregue el pimentón ahumado, el chile, el comino y el ajo. Cocine por 1-2 minutos. Agregue los tomates picados y cocine por 2-3 minutos.", "Calentar otra sartén y agregar el aceite restante, una vez caliente agregar las papas y cocinar hasta que estén doradas. Justo antes de servir, agregue la mezcla de tomate a las papas y caliente.", "Para la ensalada kachumber, coloque el tomate y la cebolla en un tazón grande con sal y azúcar. Mezcle el jugo de limón y el aceite de oliva en un tazón pequeño y vierta sobre los tomates y la cebolla junto con el cilantro y la menta.", "Una vez que el salmón se haya marinado, precaliente la parrilla a fuego medio. Coloque el salmón en una bandeja forrada de aluminio y ase a la parrilla durante 3-4 minutos a cada lado.", "Coloque la pasta tandoori reservada en una olla pequeña y caliéntela suavemente.", "Para servir, coloque una cucharada de ensalada junto con el salmón a la parrilla y las papas y una cuchara sobre la salsa tandoori."], "url": "www_bbc_co_uk_food_recipes_tandoori_salmon_with_39191", "title": "Salmón tandoori con ajo, comino y patatas de tomate y ensalada kachumber", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 codornices", "2 dientes de ajo, en rodajas finas", "Jengibre fresco de 5 cm / 2 pulgadas, finamente rallado", "1 cucharadita de chile en polvo", "1 cucharadita de semillas de hinojo molido", "½ cucharadita de canela molida", "1 cucharadita de sal masala", "200ml / 7fl oz de yogurt natural", "2 bulbos de hinojo, en rodajas finas", "½ pepino, finamente cortado", "½ cebolla roja, finamente picada", "1 manojo de menta fresca, finamente rebanada", "1 limón, solo jugo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "75ml / 3fl oz de yogur natural", "½ cucharadita de comino molido", "½ cucharadita de semillas de hinojo molido", "2 cucharadas de berro de coriandro o cilantro fresco picado"], "method": ["Para salpicar la codorniz, toma unas tijeras fuertes y afiladas (o tijeras para aves de corral) y corta ambos lados de la espina dorsal. Saque la columna vertebral, luego presione hacia abajo el esternón de la codorniz para abrirla completamente. Corta la codorniz por la mitad a lo largo.", "Para el adobo, mezcle las especias y el yogur en un recipiente hasta que estén bien combinados.", "Cubra la codorniz con la marinada, cubra con film transparente y deje enfriar en la nevera durante al menos 2 horas, preferiblemente durante la noche.", "Caliente una sartén hasta que esté caliente, luego agregue la codorniz, con la cara de la piel hacia abajo, y ase a la parrilla por 3 minutos en cada lado, o hasta que los jugos salgan limpios cuando se inserta una brocheta en la parte más gruesa. Retire la codorniz de la plancha y lave para descansar durante 2-3 minutos.", "Mientras tanto, para la ensalada de hinojo, mezcle el hinojo, el pepino, la cebolla roja, la menta y la mitad del jugo de limón en un bol hasta que estén bien combinados. Sazone al gusto con sal y pimienta negra recién molida.", "Batir el aceite de oliva, el yogur y el jugo de limón restante en un recipiente hasta que estén bien combinados. Agregue el comino y la semilla de hinojo, y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloca la codorniz encima de la ensalada. Espolvorear con cress de berro y una buena porción de aderezo de yogur al lado."], "url": "www_bbc_co_uk_food_recipes_tandoori_quail_with_91053", "title": "Codorniz Tandoori con ensalada de hinojo y aderezo de yogur", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "1 cucharadita de sal", "2 cucharaditas de aceite vegetal", "1 huevo de corral, separado", "135ml / 4¾fl oz de agua tibia", "1 cucharada de pasta de curry tandoori preparada", "1 cucharada de yogur", "2 pechugas de pollo sin piel", "2 papas, peladas", "2 cucharadas de aceite vegetal", "1 cebolla pequeña, pelada, finamente picada", "½ cucharadita de cúrcuma molida", "2 cucharaditas de sal masala", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de sal", "½ cucharadita de pimienta negra recién molida", "4 dientes de ajo, aplastados", "1 chile verde, finamente picado", "10 hojas de curry, finamente picadas", "75g / 2½oz de guisantes congelados", "1 cucharadita de jugo de limón", "1 puñado de hojas frescas de cilantro picadas", "aceite vegetal, para freír", "salsa picante (opcional)", "raita (opcional)"], "method": ["Para la masa, mezcle la harina y la sal en un tazón. Agregue el aceite y la yema de huevo y mezcle hasta que la mezcla se asemeje a pan rallado. Mezcle gradualmente el agua tibia, hasta que la mezcla forme una masa suave y elástica (es posible que no necesite toda el agua). Enrolle la masa en una bola, cubra con una película adhesiva y enfríe en la nevera hasta que lo necesite.", "Para el relleno, mezcle la pasta tandoori y el yogur juntos en un tazón. Agregue las pechugas de pollo y gírelas varias veces para cubrir el pollo en la mezcla. Cubra el tazón con film transparente y déjelo a un lado para que se marinen en el refrigerador durante una hora.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Coloque el pollo en una bandeja de asar y cocine en el horno durante 20 minutos, o hasta que estén dorados y cocidos (el pollo se cocina si los jugos se hacen transparentes cuando el pollo se perfora en la parte más gruesa). Poner a un lado para enfriar, luego cortar en cubos pequeños.", "Cocine las papas en una olla con agua hirviendo durante 15 minutos o hasta que estén tiernas. Escurra las papas y déjelas enfriar. Cuando se enfríe, picar finamente las papas.", "Calentar el aceite vegetal en una sartén y freír la cebolla durante 3-4 minutos, o hasta que esté blanda pero no coloreada. Agregue la cúrcuma molida, garam masala, semillas de mostaza, sal y pimienta negra recién molida y cocine por un minuto, revolviendo bien. (PRECAUCIÓN: las semillas de mostaza pueden comenzar a reventar. Mantenga la bandeja bien lejos de la cara y los ojos).", "Agregue el ajo y los chiles y freír durante 2-3 minutos, luego agregue las hojas de curry a la sartén y cocine por un minuto más. Agregue la papa picada y mezcle suavemente en las especias. Cocine a fuego lento durante otros diez minutos, luego mezcle los guisantes y cocine por 2-3 minutos, o hasta que los guisantes estén tiernos.", "Doble suavemente el pollo picado, agregue el jugo de limón y el cilantro picado. Verifique el condimento, luego retírelo del fuego y déjelo a un lado para que se enfríe.", "Para hacer las samosas, extienda la masa en una superficie de trabajo enharinada de aproximadamente 3 mm de grosor. Corta rondas de 15cm / 6 pulgadas con un cortador de pasteles.", "Corta cada ronda a la mitad para dar dos semicírculos. Tome cada semicírculo y envuélvalo en un cono, cepillando los bordes con la clara de huevo reservada y sellando juntos. Coloque el relleno de samosa en cada cono de modo que estén un poco más llenos (no los llene demasiado o será difícil sellarlos). Cepille la parte superior del cono de pasta con clara de huevo y selle los extremos abiertos del cono. Repita el procedimiento con el resto de la masa y el relleno.", "Llene a la mitad una sartén profunda de base pesada con aceite vegetal y caliente hasta que un cubo de pan caiga en chispas y se vuelva dorado en 30 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Freír las samosas en pequeños lotes, durante 4-5 minutos cada vez, o hasta que estén doradas y crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Sirva las samosas con tazones pequeños de chutney y raita al lado."], "url": "www_bbc_co_uk_food_recipes_tandoorichickensamos_93148", "title": "Samosas de pollo Tandoori", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz yogur griego", "½ cebolla pequeña, más o menos picada", "1 diente de ajo, pelado y picado", "2.5cm / 1 en pieza de jengibre fresco, pelado y picado", "2 cucharaditas de garam masala y comino molido", "1 cucharadita de cilantro molido", "½ cucharadita de semillas de hinojo molido", "¼ cucharadita de pimienta negra recién molida", "1 cucharada de aceite vegetal", "2 cucharadas de hojas frescas de cilantro", "½ cucharadita de chile rojo en polvo, o al gusto", "2 cucharaditas de jugo de limón", "1 cucharadita de sal, o al gusto", "Cordero de 400 g / 14 oz (la carne de pierna es ideal), huesos extraídos, cortados en cubos de 2 cm / 1 in y perforados con un tenedor", "2 cucharadas de mantequilla derretida, para hilvanar", "5 tortillas de harina listas para usar, envueltas en papel de aluminio y colocadas en el horno durante los últimos cinco minutos de cocción", "½ cebolla, finamente rebanada", "2 tomates, en rodajas finas", "1 lechuga Little Gem, finamente rebanada", "100 ml / 3½ fl oz de chutney verde, mezclado con 3 cucharadas de yogur, para servir", "Necesitarás diez pinchos de madera, empapados en agua durante media hora"], "method": ["Coloque todos los ingredientes del adobo en un procesador de alimentos y mezcle hasta que quede suave. Vierta en un tazón grande y agregue los cubos de cordero. Mezcle bien y deje marinar en el refrigerador el mayor tiempo posible, preferiblemente durante la noche. Regrese a la temperatura ambiente una hora antes de cocinar.", "Precalentar la parrilla a mediano. Pase los cubos de cordero a los pinchos dejando un espacio entre cada pieza y colóquelo debajo de la parrilla. Cocine por alrededor de 5-6 minutos, volteando hasta la mitad de la cocción, hasta que estén tiernos. Alternativamente, cocine en un horno precalentado a 200C / 400F / Gas 6 durante ocho minutos. Hilvane con la mantequilla derretida y cocine durante uno o dos minutos más por carne ligeramente rosa, o más si desea que el cordero esté bien hecho.", "Divida las piezas de cordero en cinco porciones iguales y coloque cada porción en el centro de una tortilla calentada. Cubra con un puñado de verduras en rodajas y una cucharada de chutney. Enrollar y servir."], "url": "www_bbc_co_uk_food_recipes_tandoorilambwrap_86564", "title": "Envoltura de cordero tandoori", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandoorilambwrap_86564_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de pasta de jengibre y ajo, de un tarro (o unte el ajo fresco y el jengibre para formar una pasta)", "1 cucharadita de chile rojo en polvo", "2 cucharadas de jugo de limón", "1 cucharadita de sal", "4 pechugas de pollo en el hueso, piel removida, anotada con 3 o 4 incisiones", "mantequilla derretida y aceite, para hilvanar", "1½ cucharadita de jugo de lima", "1 cucharadita de chaat masala (una mezcla de especias secas y chiles, disponible en tiendas de comestibles asiáticas)", "sal", "4 Peshawari naan, para servir", "250 g / 9 oz de yogur natural", "1 cucharadita de sal masala", "100ml / 3½fl oz de aceite vegetal", "½ cucharadita de canela molida", "½ cucharadita de chile rojo en polvo", "pizca de colorante rojo comestible (opcional)", "1 cucharadita de sal", "200g / 7oz de lentejas negras", "4 cucharadas de aceite vegetal", "1 cucharada de jengibre fresco finamente picado", "2 dientes de ajo, pelados", "2 chiles verdes enteros", "1 cucharadita de semillas de comino", "1 cucharada de pasta de jengibre y ajo (ver arriba)", "½ chile verde, picado", "2 cucharadas de pasta de tomate", "½ cucharadita de chile rojo en polvo, cilantro molido, cúrcuma molida, garam masala y polvo de hojas de fenogreco", "30g / 1oz de mantequilla", "2 cucharadas de crema individual", "1 cucharada de hojas de cilantro picado", "sal", "15g / ½ oz de mantequilla", "2 cucharaditas de aceite vegetal", "Cebolla de 100 g / 3½ oz, en rodajas", "2.5cm / 1in canela en rama", "2 cardamomos negros, aplastados", "1 cuchilla", "500g / 1lb 2oz de arroz basmati, lavado y remojado durante 10-20 minutos", "1 cucharadita de sal", "3-4 cucharadas de puré de espinaca, cilantro y menta", "2 cucharadas de mascarpone o crema doble", "Hojas de cohete para bebé de 25g / 1oz", "1 manzana Granny Smith, cortada en juliana", "1 mango verde (verde), cortado en juliana", "vinagreta hecha con aceite y jugo de lima"], "method": ["Mezcle los ingredientes para el primer adobo. Frote todas las pechugas de pollo, luego déjelo en la nevera durante 20 minutos para que los jugos puedan drenar.", "Mezcle los ingredientes para el segundo adobo. Agregue el pollo y vuélvalo a cubrir, luego déjelo en un lugar fresco por 2-3 horas.", "Mientras tanto, prepara la salsa de lentejas negras. Coloque las lentejas, dos cucharadas de aceite, jengibre, ajo y chiles enteros en una sartén y cúbralo con agua. Llevar a ebullición, luego cocine a fuego lento hasta que las lentejas estén cocidas en una textura suave y el líquido se haya reducido. Deseche el ajo y los chiles.", "Prepare el aderezo para la salsa de lentejas salteando las semillas de comino, la pasta de jengibre y ajo y el chile verde picado en el aceite restante hasta que estén blandos. Agregue la pasta de tomate seguida de todas las especias molidas.", "Agregue las lentejas cocidas al condimento y cocine a fuego lento durante 10-15 minutos.", "Agregue la mantequilla, la crema y el cilantro con sal al gusto. Licuar con una batidora de mano para darle una consistencia de salsa. Poner a un lado, y recalentar para servir.", "Luego haz el pulao. Calentar la mantequilla y el aceite en una cacerola y freír las cebollas con la canela, el cardamomo y la maza hasta que estén doradas.", "Agregue el arroz drenado, la sal y 1 litro / 1¾ pintas de agua. Llevar a ebullición, luego cubrir la sartén herméticamente y cocinar hasta que el arroz esté tierno y todo el líquido haya sido absorbido. Agregue el puré de espinacas y hierbas y mascarpone o crema justo antes de servir.", "Precalentar el horno a 200C / 400F / Gas 6.", "Mientras se cocina el arroz, enrosque las pechugas de pollo en los pinchos, coloque los pechitos en una bandeja para hornear antiadherente y cocine en el horno durante tres minutos. Reduzca el calor del horno a 160 C / 325 F / Gas 3 y cocine por otros 15 minutos.", "Hilvane las pechugas de pollo con la mezcla de aceite de mantequilla y cocine durante otros cinco minutos o hasta que el pollo esté cocido (los jugos se mantendrán limpios). Retirar del horno, rociar el pollo de nuevo y espolvorear con el jugo de limón y chaat masala. Mantener caliente.", "Mezcle todos los ingredientes para la ensalada.", "Para servir, cuela la salsa en cuatro platos y extiéndela para cubrirla. Coloque una cucharada grande de hierba pulao en el centro de cada plato, coloque una pechuga de pollo tandoori sobre el arroz y decore con la ensalada de rúcula y mango. Coloque el Peshawari naan en el lado."], "url": "www_bbc_co_uk_food_recipes_tandoorichickenwithb_82082", "title": "Pollo tandoori con salsa de lentejas negras y pulao de hierbas, servido con ensalada de rúcula y mango", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de ajo finamente picado", "1 cucharadita de chiles verdes finamente picados", "1 cucharadita de semillas de hinojo molido", "½ cucharadita de canela molida", "1 ramita de romero fresco, aproximadamente picado", "1 ramita de tomillo fresco, solo hojas", "1 cucharada de mostaza Dijon", "sal y pimienta negra recién molida", "100 ml / 3½ fl oz de crema individual", "Crema doble 50ml / 2fl oz", "2 cucharadas de harina de gramo", "2 cucharadas de pastis", "pizca de nuez moscada recién rallada", "4 chuletas de cerdo, cortadas y sin grasa", "2 cucharadas de aceite de verdura o maní", "1 cucharadita de semillas de mostaza", "10 hojas de curry", "1 cucharadita de jengibre fresco finamente picado", "Col de Saboya de 300 g / 10½oz, finamente rebanada", "¼ cucharadita de cúrcuma molida", "sal al gusto", "50g / 2oz de coco recién rallado", "1 cucharada de hojas de cilantro fresco picado", "½ cucharada de jugo de limón", "3 cucharadas de aceite de oliva", "½ cucharadita de ajo picado", "½ cucharadita de semillas de cilantro, tostadas y trituradas a la ligera", "¼ de cucharadita de chile rojo molido", "2 manzanas Granny Smith, cortadas en cubos de 2cm / 1in", "100 g / 3½ oz de hongos porcini frescos, limpios y en rodajas", "1 cucharada de jugo de limón", "dash sidra de vinagre", "sal y azúcar, al gusto", "½ cucharada de perejil fresco finamente picado", "hojas frescas de cilantro", "Berro griego, berro de apio y berro de amaranto"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para las chuletas de cerdo, coloque todo, excepto las chuletas de cerdo en un tazón grande y bata para combinar. Agregue las chuletas de cerdo y revuelva para cubrir. Dejar de lado para marinar durante 30 minutos en un lugar fresco.", "Caliente una sartén hasta que esté caliente. Coloque las chuletas de cerdo en la sartén y la plancha en cada lado durante dos minutos. Transfiera las chuletas a una bandeja para hornear y colóquelas en el horno de 10 a 15 minutos o hasta que estén completamente cocidas.", "Mientras tanto, para la coli de Savoy poriyal, caliente una sartén hasta que esté caliente y agregue el aceite, las semillas de mostaza, las hojas de curry y el jengibre. Revuelva hasta que las semillas de mostaza salten, teniendo cuidado ya que puede escupir.", "Agregue el repollo, la cúrcuma y la sal y freír suavemente durante 10-15 minutos, o hasta que el repollo esté marchito. Retirar del fuego y agregar el coco recién rallado, las hojas de cilantro y el jugo de limón.", "Para la ensalada, caliente una sartén hasta que esté caliente, agregue el aceite y el ajo y fríalos hasta que estén dorados. Agregue las semillas de cilantro y chile rojo.", "Agregue las manzanas picadas y freír suavemente durante unos minutos para colorear ligeramente. Agregue los champiñones y fría hasta que estén ligeramente dorados. Agregue el jugo de limón y el vinagre de sidra y sazone con sal y azúcar, al gusto. Retire del fuego y agregue el perejil picado.", "Para servir, coloque el poriyal de repollo en el centro de cuatro platos para servir y cubra con una chuleta de cerdo. Esparce la ensalada de manzana y porcini alrededor del plato y rocía el líquido que queda en la sartén. Espolvoree el berro mezclado sobre la ensalada y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tandoorispicedporkch_88252", "title": "Tandoori con especias de chuletas de cerdo con col de Savoy poriyal y manzana y ensalada de porcini", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb filete de lomo de 3oz, cortado en pedazos de 2cm / 1in", "570 ml / 1 pinta de yogur de estilo griego", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y rallado fino", "6 dientes de ajo, pelados y triturados para untar", "1 limón, solo jugo", "2 cucharadas de pimentón dulce", "2 pimientos verdes, sin semillas, picados en trozos de 3cm / 1½ pulgadas", "2 pimientos rojos, sin semillas, cortados en trozos de 3cm / 1½ pulgadas", "4 cucharadas de aceite vegetal", "1 cucharadita de vainas de cardamomo verde, ligeramente trituradas", "1 cucharadita de clavos enteros", "6 tomates maduros, picados", "1 x 227 g / 8 oz de tomates picados en lata", "300ml / 10½fl oz de agua", "1 cebolla, pelada y finamente picada", "10 hojas de curry (disponibles en algunos supermercados y tiendas de comestibles asiáticas)", "1 cucharada de sal masala", "1 kg / 2 lb 3 oz de huesos de ternera", "200ml / 7fl oz de leche de coco", "50 g / 2 oz de mantequilla, en cubos", "3 cucharadas de aceite vegetal", "1 cebolla pequeña, pelada, finamente picada", "1 cucharada de vainas de cardamomo verde, ligeramente trituradas", "1 cucharada de semillas de comino", "2 hojas de laurel", "Arroz basmati a 400 g / 14 oz, lavado y remojado durante al menos 30 minutos en agua fría", "600ml / 1 pinta 1½fl oz de agua", "1 manojo de cilantro fresco, aproximadamente picado", "10 uvas verdes sin semillas, cortadas a la mitad", "10 uvas rojas sin semillas, cortadas a la mitad", "2 cucharadas de aceite vegetal", "2 dientes de ajo, pelados y triturados para untar", "Espinaca de hoja de bebé 400 g / 14 oz, blanqueada y refrescada en agua fría"], "method": ["Para los kebabs, combine el filete de rabadilla, el yogur, el jengibre, el ajo, el jugo de limón y el pimentón en un tazón grande. Cubra y marinado durante al menos una hora en la nevera. Remoje ocho pinchos de madera en agua fría durante al menos diez minutos.", "Ensarte la carne y los pimientos alternativamente en los pinchos de madera hasta que toda la carne y los pimientos se hayan agotado. Dejar de lado.", "Para el jus de coco, caliente la mitad del aceite vegetal en una sartén. Agregue las vainas de cardamomo y los dientes de ajo y fría por 2-3 minutos. Agregue los tomates frescos picados y los tomates enlatados. Agregue el agua, hierva y cocine a fuego lento durante aproximadamente 40 minutos, o hasta que la salsa se haya espesado un poco y los tomates se hayan descompuesto por completo.", "En una sartén por separado, caliente el aceite restante y agregue las cebollas y las hojas de curry. Cocine durante 4-5 minutos, o hasta que las cebollas estén blandas y las hojas de curry sean aromáticas. Suba el fuego, agregue los huesos de carne y mezcle el garam masala y cocínelos durante 5-6 minutos, revolviendo continuamente o hasta que los huesos comiencen a colorearse.", "Agregue la mezcla de tomate a la sartén con los huesos y mezcle bien. Agregue suficiente agua para cubrir la parte superior de los huesos, luego cocine a fuego lento durante una hora, o hasta que la mezcla esté espesada y aromática. Pase la mezcla a través de un tamiz fino en un recipiente limpio y deseche los sólidos.", "Agregue la leche de coco a la sartén y deje que hierva, cocinando de 10 a 15 minutos o hasta que el líquido se haya reducido a la mitad. Mantener caliente", "Para el arroz, caliente el aceite en una sartén a fuego medio. Agregue las cebollas, las vainas de cardamomo, el comino y las hojas de laurel y fría durante 5-6 minutos, o hasta que la cebolla se ablande y las especias sean aromáticas.", "Escurrir el arroz basmati y agregarlo a la sartén. Revuelva hasta que todo el arroz esté cubierto y las especias estén distribuidas uniformemente. Freír por 2-3 minutos más, luego agregar el agua y llevar a ebullición. Cubra con una tapa y cocine durante 10-12 minutos, o hasta que el arroz esté tierno y toda el agua haya sido absorbida. Sáquelo del fuego y apártelo.", "Para las espinacas, caliente el aceite en una sartén hasta que esté humeando. Agregue el ajo y fría por 2-3 minutos, o hasta que se ablanden. Exprima cualquier exceso de humedad de la espinaca, luego agregue a la sartén y revuelva hasta que la espinaca se haya marchitado.", "Para los kebabs, caliente una sartén hasta que fume. Coloque los kebabs en la plancha y cocine durante unos 2-3 minutos en cada lado, o hasta que estén cocidos y dorados por todas partes.", "Para servir, revuelva las uvas y el cilantro picado en el arroz cocido. Cuchara en platos para servir y coloque los kebabs al costado. Batir la mantequilla en el jugo de coco, luego rociar alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_tandooristylebeefkeb_91376", "title": "Brochetas de carne de estilo tandoori con jus de coco, arroz pilach de Cachemira y espinaca de ajo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Trozos de pollo de 1,25 kg / 2½ lb (piernas y pechos), sin piel", "2 cucharaditas de sal", "1-2 limones, cortados a la mitad", "425 ml / 1 litro de yogur natural", "½ cebolla, picado grueso", "1 diente de ajo, picado", "Jengibre fresco de la raíz de los 2.5cm / 1in, tajado", "1-2 chiles verdes calientes, cortados en rodajas", "2 cucharaditas de sal masala", "rodajas de limón o limón, para servir"], "method": ["Corte cada pierna de pollo en dos pedazos (muslo y muslo) y cada seno en dos pedazos. Haga dos hendiduras profundas en sentido transversal en las partes carnosas de cada pierna y pechuga. Las hendiduras deben ser lo suficientemente profundas para llegar al hueso.", "Extienda los pedazos de pollo en un plato grande. Espolvoree el pollo con la sal y exprima un poco del jugo de limón. Frote el jugo de limón y la sal en cada pieza, de modo que la mezcla vaya directamente al hueso. Dejar de lado por 20 minutos.", "Mientras tanto, para el adobo de yogur, combine una cucharada más o menos del yogur, la cebolla, el ajo, el jengibre, los chiles y el garam masala en una licuadora o procesador de alimentos y mezcle hasta que quede suave. Agregue el yogur restante al yogur y la mezcla de especias y combine bien.", "Coloque el pollo y todos sus jugos acumulados en un recipiente grande, descartando las semillas de limón. Vierta el adobo sobre el pollo para cubrir. Frote el adobo en las ranuras de la carne, cubra con una película adhesiva y refrigere durante al menos seis horas (pero preferiblemente 24).", "Precalienta el horno a su temperatura máxima y coloca un estante en el tercio superior del horno donde está más caliente.", "Retire los trozos de pollo del adobo, sacuda el exceso y extiéndalos en una sola capa sobre una bandeja de horno grande y poco profunda. Deseche el adobo sobrante.", "Coloque la bandeja en la parte superior del horno y cocine durante 20-25 minutos, hasta que el pollo esté bien cocido. Los senos se cocinan más rápido que las piernas, entonces quítelos después de unos 10-15 minutos, cuando estén cocidos. Puedes comprobar si están hechos perforando el pollo en la parte más gruesa con un pincho. Los jugos correrán claros, pero la carne todavía se sentirá elástica al tacto.", "Levante los pedazos de pollo de sus jugos y colóquelos en un plato para servir. Sirva con rodajas de limón o lima."], "url": "www_bbc_co_uk_food_recipes_tandooristylechicken_90296", "title": "Pollo al estilo tandoori", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tandooristylechicken_90296_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz oz yogur", "2 limas, solo jugo", "1 cucharada de ajo machacado", "Jengibre fresco de 2.5cm / 1in, pelado, rallado", "1 cucharadita de comino molido", "1 cucharada de cilantro molido", "1 cucharadita de sal masala", "pizca de pimentón", "pizca de sal", "4 filetes de trucha de 150 g / 5½ oz", "75ml / 2¾fl oz de mantequilla derretida", "1 cucharada de pasta de curry preparada", "50ml / 1¾oz de agua hirviendo", "1 cebolla roja, finamente rebanada", "440 g / 1 lb pueden mezcla de frijoles, escurridos, enjuagados", "2 limas, solo jugo", "1 cucharada de vinagre de malta", "100ml / 3½fl oz de aceite de oliva", "1 cucharada de cilantro fresco picado", "1 chile rojo, finamente picado", "4 panes naan, para servir"], "method": ["Para el adobo, en un tazón, mezcle el yogur natural, el jugo de una lima, el ajo, el jengibre, el comino, el cilantro, el garam masala, el pimentón y la sal hasta que estén bien combinados.", "Agregue los filetes de trucha y cúbralos en la mezcla de adobo. Cubra y enfríe en la nevera durante la noche, o durante al menos dos horas.", "Cuando la trucha se haya marinado, precaliente la parrilla a su nivel más alto. En un tazón, mezcle la mantequilla derretida y el jugo de la lima restante hasta que estén bien combinados.", "Cuando la parrilla esté caliente, coloque los filetes de trucha marinada debajo de ella y ase de 2 a 3 minutos. Hilva los filetes de trucha a la parrilla con el jugo de lima y la mezcla de mantequilla.", "Voltee los filetes de trucha y ase otros 2-3 minutos, hilvanando con el jugo de lima y la mezcla de mantequilla hasta la mitad de la cocción.", "Para la ensalada, mezcle la pasta de curry con el agua hirviendo hasta que se disuelva. En un tazón separado, mezcle bien la cebolla, los frijoles mezclados, el jugo de lima, el vinagre de malta, el aceite de oliva, el cilantro y el chile rojo picado hasta que estén bien combinados.", "Para servir, divida la ensalada por igual entre cuatro platos para servir. Coloque un filete de trucha tandoori en la parte superior de cada porción. Sirve el pan naan al lado."], "url": "www_bbc_co_uk_food_recipes_tandooritroutsalad_91443", "title": "Ensalada de trucha Tandoori", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 8 oz de masa pastelera hecha", "8 huevos de gallinas camperas", "Azúcar en polvo 320g / 11oz", "4 limones grandes, jugo y corteza", "290ml / 10fl oz / ½ pinta de crema doble", "azúcar en polvo, para quitar el polvo", "crema individual", "frambuesas"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Estirar la masa y utilizar para alinear un plato de quiche grande (25cm / 10in de diámetro). Cubra con papel de aluminio y rellene con frijoles o arroz seco para mantener la base en su lugar.", "Hornee en el horno por 20 minutos. Retire la lámina y los frijoles para hornear y hornee por otros 5 minutos.", "Reduzca la temperatura del horno a 150C / 300F / Gas 2.", "En un tazón, bata ligeramente los huevos y el azúcar (no batir). Agregue el jugo de limón y la cáscara y revuelva. Finalmente agregue la crema y revuelva bien, pero de nuevo, no batir.", "Transfiera la mezcla de crema a la caja de pastelería y cocínela en el centro del horno durante aproximadamente 35 minutos hasta que se asiente (la mezcla debe establecerse suavemente como un manjar blanco y ser firme al tacto).", "Dejar enfriar completamente, espolvorear con azúcar glas y servir con crema y frambuesas."], "url": "www_bbc_co_uk_food_recipes_tangylemontart_83740", "title": "Tarta de limón fuerte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "50g / 2oz de almendras enteras, fuera de sus conchas", "1 cucharadita de sal marina", "1 cucharadita de pimentón ahumado", "1 cucharadita de hojuelas de chile", "500ml / 18fl oz de aceite vegetal, para freír", "Harina simple de 75g / 2¾oz", "sal y pimienta negra recién molida", "1 calamar, limpiado y cortado en anillos", "½ granada, solo semillas carnosas", "1 cucharada de vinagre balsámico", "1 cucharada de aceite de oliva", "10 aceitunas verdes grandes, piedras removidas", "10 almendras enteras, fuera de sus conchas", "1 cucharada de aceite de oliva", "½ pimiento rojo, semillas retiradas", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente cortado", "1 cucharadita de hojas frescas de tomillo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las almendras condimentadas, caliente el aceite en una sartén y fría las almendras hasta que estén ligeramente tostadas. Espolvorea sobre la sal y las especias y revuelve bien, luego vierte en un tazón pequeño.", "Para el calamar frito, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sazonar la harina con sal y pimienta negra recién molida, luego dragar los anillos de calamar en la harina, sacudiendo cualquier exceso.", "Coloque con cuidado los anillos de calamar en el aceite caliente y fríalos durante 3-4 minutos, o hasta que estén crujientes y dorados. Retirar del aceite con una cuchara ranurada, escurrir sobre papel de cocina y espolvorear con sal. Coloque en un tazón pequeño.", "Para la salsa de granada, coloque las semillas de granada en una sartén con el vinagre balsámico y el aceite y cocine a fuego lento hasta que el líquido se haya reducido a la mitad. Vierta en un tazón pequeño.", "Para las aceitunas rellenas de almendras, coloque una almendra dentro de cada aceituna. Calentar el aceite en una sartén y freír las aceitunas durante 3-4 minutos, luego coloque en un tazón pequeño.", "Para el pimiento asado, coloque la mitad de la pimienta en una bandeja para hornear y rocíe con el aceite. Espolvoree el ajo en rodajas y el tomillo sobre la pimienta y sazone con sal y pimienta negra recién molida.", "Transfiera al horno y tueste durante diez minutos, o hasta que esté blando y ligeramente carbonizado en los bordes. Retire del horno, corte en rodajas y coloque en un tazón pequeño.", "Para servir, coloque todos los cuencos de tapas en una fuente grande."], "url": "www_bbc_co_uk_food_recipes_tapas_85932", "title": "Plato de tapas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, aplastado", "1 limón, solo jugo", "3 cucharadas de alcaparras picadas", "6 filetes de anchoa, picados", "Aceitunas negras 250 g / 9 oz, sin hueso", "pequeño racimo de perejil fresco, picado", "sal y pimienta negra recién molida", "2-4 cucharadas de aceite de oliva virgen extra"], "method": ["Para hacer una tapenade con textura rugosa, simplemente mezcle todos los ingredientes, agregue suficiente aceite de oliva para formar una pasta.", "Para obtener una textura más suave, incline el ajo, el jugo de limón, las alcaparras y la anchoa en un procesador de alimentos y procese durante aproximadamente 10 segundos. Agregue las aceitunas y el perejil y suficiente aceite de oliva para hacer una pasta.", "Sazone al gusto si es necesario."], "url": "www_bbc_co_uk_food_recipes_tapenade_11160", "title": "tapenade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]