[{"isVegetarian": false, "title": "Wood-fired pork collar and crackling with sage and pine nut crumb", "url": "www_bbc_co_uk_food_recipes_wood-fired_pork_collar_72424", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150-200g/5½-7oz pork chops", "5 litres/9 pints water", "1kg/2lb 4oz fine salt", "10 cloves", "5 bay leaves", "olive oil, for frying", "1 x 500g/1lb 2oz piece pork collar or shoulder, all visible fat trimmed", "1 onion, diced", "1 carrot, diced", "1 celery stick, diced", "small handful fresh thyme", "1 sprig fresh sage", "2 tbsp olive oil", "1 carrot, roughly chopped", "½ onion, roughly chopped", "2 celery sticks, roughly chopped", "2 garlic cloves, crushed ", "250g/9oz pork trimmings, fat removed", "25g/1oz fresh thyme ", "25g/1oz fresh sage", "½ x 75cl bottle dry white wine", "1 litre/1¾  pints veal stock", "1 litre/1¾  pints chicken stock", "2 tsp Cabernet Sauvignon vinegar", "2 handfuls fresh sage leaves.", "sunflower oil, for deep-frying", "100g/3½oz butter", "200g/7oz panko breadcrumbs", "200g/7oz pine nuts ", "pork crackling, to serve, optional"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the brine, put all ingredients in a large pan and bring to the boil until the salt has dissolved. Remove from the heat and leave to cool. Chill in the fridge until ready to use.", "Add the pork collar to the brine, cover and chill for 4 hours. Remove the collar but retain the brine. Wash the collar under cold running water for 30 minutes, then dry well. Preheat to oven to 150C/130C Fan/Gas 2. ", "Put an ovenproof casserole pan on the heat. Add the oil and once hot add the pork collar and brown on all sides. Transfer the meat to a board and leave the pan to heat up again. Add the vegetables and herbs and fry for 2-3 minutes, or until coloured. Return the pork to the pan and pour in the chicken stock. Bake for 2-3 hours, or until cooked through. ", "Meanwhile, add the pork chops to the retained brine, cover and chill for 2 hours. Wash the chops under cold running water for 30 minutes, then dry well and set aside. ", "For the pork sauce, heat half the oil in a very large heavy-based pan. Add the onion, garlic, celery and carrots and fry, stirring, until caramelised. Transfer to a plate using a slotted spoon and set aside. Heat the remaining oil in the pan and fry the pork trimmings until coloured on all sides. Transfer to another plate. ", "Deglaze the pan with the wine, scraping all the residue from the bottom of the pan. Return the vegetables and pork trimmings to the pan, then add the stocks, thyme and sage. Bring to the boil, then simmer for 1 hour, skimming regularly. Strain the stock into a clean pan and simmer until reduced. When it has a sauce-like consistency, strain it through muslin.", "For the sage and pine nut crumb, preheat a deep fat fryer to 180C. Deep fry the sage leaves in the sunflower oil, then drain well on kitchen paper. Melt the butter in a heavy-bottomed frying pan. Add the breadcrumbs and pine nuts and fry, stirring, until golden. Set aside. When the sage leaves are cool, roughly chop them and add to the pine nut mixture. Season with salt.", "To serve, preheat a large griddle pan. Oil the pork chops, then cook for 3-6 minutes on each side, until cooked. This will depend on the size of your chops. ", "Cut the pork collar into portions and chargrill on all sides for 2-3 minutes. Transfer to a pan and glaze with the pork sauce. Finish with the Cabernet Sauvignon vinegar.  ", "Put the pork chop and collar onto a serving plate and drizzle with the sauce. Top with the pine nut crumbs and serve with the pork crackling."]}, {"isVegetarian": false, "title": "Wood pigeon bruschetta", "url": "www_bbc_co_uk_food_recipes_woodpigeonbruschetta_92781", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter", "2 pears, peeled, cores removed, sliced widthways", "salt and freshly ground black pepper", "1 tbsp demerara sugar", "2 tsp vegetable oil", "4 pigeon breasts, skin removed", "1 tbsp chopped fresh thyme leaves", "1 tbsp smoked bacon lardons, fried until crisp and golden-brown", "4 thin slices baguette, grilled until crisp and golden-brown", "4 small handfuls baby watercress leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the butter in a pan over a medium to high heat. When the butter is foaming, add the pears. Season, to taste, with salt and freshly ground black pepper, then stir well to coat the pears in the butter.", "Add the sugar and stir until the sugar has dissolved and caramelised and has coated the pears.", "Meanwhile, heat the oil and the remaining butter in a separate frying pan. When the butter is foaming, add the pigeon breasts and fry for 1-2 minutes on each side. Season, to taste, with salt and freshly ground black pepper.", "Add the thyme and cooked bacon and continue to cook for a further 2-3 minutes, or until the pigeon breasts are browned on all sides and cooked to your liking and the bacon has warmed through. ", "To serve, place one slice of grilled baguette into the centre of each of four serving plates. Place a handful of baby watercress leaves on top of each. Spoon over some of the pears, then the pigeon and bacon mixture."]}, {"isVegetarian": false, "title": "Wrapped mozzarella", "url": "www_bbc_co_uk_food_recipes_wrappedmozzarella_82617", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["freshly ground black pepper", "shredded basil leaves", "1 ball of fresh mozzarella", "2 slices of prosciutto", "olive oil, for drizzling"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Scatter the freshly ground black pepper and shredded basil leaves on the mozzarella ball. ", "Wrap the seasoned ball in the prosciutto slices.", "Heat a little olive oil in a non-stick frying pan and fry the wrapped mozzarella for a few minutes, until the prosciutto is crisp and golden. ", "Serve."]}, {"isVegetarian": false, "title": "Wrapped figs with camembert", "url": "www_bbc_co_uk_food_recipes_wrappedfigswithcamem_79057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 figs", "55g/2oz Camembert, cut into chunks", "8 slices pancetta", "splash port", "drizzle balsamic vinegar", "few fresh thyme or basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Split open the figs and stuff each one with a piece of Camembert. ", "Wrap each fig with two slices of pancetta. Place on a baking tray and cook in the oven for 5-6 minute, or until the pancetta is golden and the cheese melted.", "Remove the figs from the oven and drizzle with a little port and balsamic vinegar.", "Sprinkle with thyme or basil leaves, to serve."]}, {"isVegetarian": false, "title": "Wrapped monkfish", "url": "www_bbc_co_uk_food_recipes_wrappedmonkfish_4754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x monkfish tail fillets (approx 150g/5oz each)", "8 slices speck (or parma ham)", "1 tbsp parsley", "1 tbsp oregano", "6 tbsp olive oil", "6 sage leaves", "1 shallot", "1 tbsp red wine vinegar", "1 glass red wine", "300ml/½ pint vegetable stock", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Start by finely chopping the parsley and oregano, then mix them together with the olive oil to make the marinade, adding salt and pepper to taste.  ", "Skin the monkfish tails, being very careful to remove all of the membrane, or the fish will take on a rubbery texture when cooked.  Place the monkfish in a bowl and cover with the marinade, leave for 20 minutes.", "Arrange 4 slices of the speck (or parma ham) side by side on a work surface and place 3 of the sage leaves along the centre. Place one of the marinated fillets on the ham, and roll up the sides to enclose the fish. Repeat with the other fillet and the rest of the ham, and place on a baking tray. Cook in an oven at 200C/400F/Gas6 for 12-15 minutes.", "For the sauce, finely chop the shallot and fry in a little oil until soft. Add the vinegar and boil until almost dry, then add the red wine and reduce to about one quarter. Add the stock and reduce by about half. Strain through  a sieve and season to taste.", "To serve, slice the cooked fillet, arrange the slices on the plate and drizzle with the sauce."]}, {"isVegetarian": false, "title": "Wreck fish and crayfish with fennel purée and crayfish bisque", "url": "www_bbc_co_uk_food_recipes_wreck_fish_and_crayfish_51233", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/1¾oz butter", "2 shallots, chopped", "1 fennel bulb, finely chopped", "1 tbsp tomato purée", "500g/1lb 2oz crayfish shells, taken from the fresh crayfish tails (below)", "2 tbsp brandy", "1 litre/1¾ pints fish stock ", "2 bay leaves", "2 sprigs fresh flatleaf parsley", "salt and freshly ground black pepper", "3-4 fennel bulbs, chopped", "40g/1½oz unsalted butter ", "2 tbsp mild-tasting extra-virgin olive oil ", "3 tbsp crème fraîche", "55g/2oz butter", "6 crayfish tails, blanched ", "2 wreck fish fillets (or sea bass), skin on, pin boned", "1 tsp fennel pollen (or ground fennel seeds)", "50g/1¾oz sea purslane", "50g/1¾oz sea beets"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crayfish bisque, heat the oil and butter in a large frying pan and gently fry the shallots and fennel for 2-3 minutes. Add the tomato purée and cook, stirring, for a further minute. Add the crayfish shells and brandy and cook for another minute.", "Add the fish stock, bay leaves and parsley and bring to a simmer. Cook for 20-25 minutes, or until the volume of liquid has reduced by a third. Remove from the heat and allow to cool slightly.", "Pour the mixture into a food processor and blend to a fine purée.", "Pass the purée through a sieve into a clean saucepan and season, to taste, with salt and freshly ground black pepper.", "For the fennel puree, place the chopped fennel in a large frying pan and cover with cold water. Add a generous sprinkling of salt, place over a medium heat and bring to the boil. Once boiling, reduce the heat slightly and simmer until very tender. ", "Drain in a colander and place the fennel in a blender. Add the butter, olive oil and crème fraîche and purée until smooth. Season with salt and black pepper.", "For the fried wreck and crayfish, heat a large frying pan and add the butter. Once hot, add the wreck fish fillets and crayfish tails and cook for two minutes on each side.", "To serve, put some purée on serving plates and top with the fried wreck fish and crayfish and spoon the bisque over the top. Garnish with the fennel pollen, sea purslane and beets."]}, {"isVegetarian": false, "title": "Wreck fish with beurre noisette buckwheat, crayfish tails and chargrilled baby fennel", "url": "www_bbc_co_uk_food_recipes_wreck_fish_with_beurre_16464", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/1¾oz butter", "2 shallots, chopped", "1 fennel bulb, finely chopped", "1 tbsp tomato purée", "500g/1lb 2oz crayfish shells, taken from the fresh crayfish tails (below)", "2 tbsp brandy", "1 litre/1¾ pints fish stock ", "2 bay leaves", "2 sprigs fresh flatleaf parsley", "salt and freshly ground black pepper", "200g/7oz buckwheat", "100g/3½oz unsalted butter", "4 baby fennel bulbs", "100g/3½oz samphire", "dash olive oil", "55g/2oz unsalted butter", "100g/3½oz spinach", "1 tsp fennel pollen (or ground fennel seeds)", "4 tbsp chopped fennel tops", "55g/2oz butter", "2 wreck fish fillets (or sea bass), skin on, pin boned", "6 crayfish tails, blanched "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the crayfish bisque, heat the oil and butter in a large frying pan and gently fry the shallots and fennel for 2-3 minutes. Add the tomato purée and cook, stirring, for a further minute. Add the crayfish shells and brandy and cook for another minute.", "Add the fish stock, bay leaves and parsley and bring to a simmer. Cook for 20-25 minutes, or until the volume of liquid has reduced by a third. Remove from the heat and allow to cool slightly.", "Pour the mixture into a food processor and blend to a fine purée. Pass the purée through a sieve into a clean saucepan and season with salt and pepper.", "Cook the buckwheat according to the packet instructions. Heat a large sauté pan and add the butter, once it has turned brown add the cooked buckwheat and sauté for 2 minutes until coated in the butter and hot.", "Blanch the baby fennel in boiling water for 2 minutes and refresh in ice cold water. Once cooled pat dry. Do the same with the samphire.", "Heat a griddle pan. Oil the dry baby fennel and place on the griddle pan. Cook each side for 1-2 minutes, or until char marks appear. ", "Heat a large pan and add the butter, once hot add the spinach and samphire and cook until the spinach is wilted.", "For the fish, heat a large frying pan and add the butter. Once hot, add the wreck fish fillets and crayfish tails and cook for 2 minutes on each side.", "To serve, put some buckwheat on serving plates and top with the samphire and spinach, then the wreck fish and crayfish and spoon the bisque over the top. Garnish with the baby fennel, fennel pollen, and fennel tops."]}, {"isVegetarian": false, "title": "Spiced chicken flatbread with Lebanese chicken salad", "url": "www_bbc_co_uk_food_recipes_xxxxx_36916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["a drizzle vegetable oil, for greasing", "400g/14oz type ‘00’ plain flour, plus extra for dusting", "100g/3½oz semolina flour", "1½ tsp caster sugar", "½ tsp flaked sea salt", "7g sachet fast-action yeast", "325ml/11fl oz warm water", "1 tbsp vegetable oil", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 tsp ground coriander", "1 tsp ground cumin", "1 tbsp ground baharat spice mix", "500g/1lb 2oz chicken mince", "75g/21/2oz sultanas", "300ml/10fl oz chicken stock", "salt and freshly ground black pepper", "250g/9oz natural yoghurt", "4 tbsp fresh mint leaves ", "4 tbsp fresh coriander leaves ", "2 green chillies, finely chopped", "2 chicken thighs, bone-in, skin-on", "1 tbsp pomegranate molasses", "1 tbsp runny honey", "3 tbsp olive oil", "2 heads baby gem lettuce, leaves shredded", "1 avocado, pitted and sliced", "1 pomegranate, seeds only", "1 tbsp roughly torn fresh coriander", "1 tbsp roughly torn fresh mint", "3 tbsp olive oil", "1 tbsp lemon juice", "1 tsp runny honey"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Prepare the flatbread dough the day before you want to cook the breads. Lightly grease a baking tray with the oil. Mix the plain flour, semolina flour, sugar and salt together in a large bowl. Mix the yeast with a little of the warm water in a jug until you have a paste, then stir in the remaining water until the yeast has dissolved. Make a well in the centre of the flour mixture and pour in the yeasted water. Slowly work the flour into the water until all of it is incorporated and you have a soft dough.", "Lightly dust a work surface with plain flour. Knead the dough on the surface until it is smooth and elastic. Divide the dough into four equal-sized pieces and roll each into a ball. Put the balls on the prepared baking tray, cover with a loose sheet of cling film or a clean tea towel, and leave in the fridge for 24 hours, or until doubled in size.", "When you are ready to cook, start with the salad. Preheat the oven to 180C/Fan 160/Gas 4. Put the chicken thighs in a deep baking tray. Mix together the molasses, honey and olive oil in a bowl, then drizzle over the thighs. Bake for 15-20 minutes, or until cooked through. Remove from the oven and leave until cool enough to handle, then skin the chicken, shred it into strips and put it in a large bowl. Turn the oven up to its highest setting. ", "While the chicken cooks, make the flatbread topping. Heat the oil in a frying pan over a medium heat. Add the shallot, garlic and spices and fry for 1-2 minutes, or until softened. Add the chicken mince, increase the heat to high and fry for 4-5 minutes, breaking up the mince with a spoon and stirring often, until browned all over. Add the sultanas and stock and bring to the boil, then reduce the heat to a simmer and cook for 18-20 minutes, or until the chicken is cooked through and tender and the liquid has almost all evaporated. Season to taste with salt and pepper, then remove from the heat and leave to cool completely.", "Put a heavy baking tray or pizza stone in the oven to heat up. Lightly dust a work surface with flour. Roll each piece of dough out on the surface into an oval roughly 20x15cm/8x6in, and about 0.5cm/¼in thick.", "Spread the chicken mixture onto the dough bases and transfer the flatbreads, in batches if necessary, to the baking tray or pizza stone. Cook for 5-10 minutes, or until the bases are golden-brown and crisp. ", "Meanwhile, finish the salad. Add the lettuce, avocado, pomegranate seeds and herbs to the bowl with the chicken. In a separate small bowl, whisk together olive oil, lemon juice and honey. Just before serving, add the dressing to the salad.", "Drizzle the flatbreads with the yoghurt and sprinkle with the herbs and chilli. Serve with the salad."]}, {"isVegetarian": false, "title": "Lamb, yam and butternut squash soup", "url": "www_bbc_co_uk_food_recipes_yamandbutternutsquas_85916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "900g/2lb stewing lamb (or mutton)", "2 large onions, chopped", "1 scotch bonnet chilli pepper, chopped", "3 beef stock cubes", "½ large yam ", "450g/1lb butternut squash ", "3 large potatoes ", "570ml/1 pint shop-bought chicken noodle soup", "1 bunch spring onions, sliced", "bunch thyme, leaves only", "dumplings, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan. Add the lamb (or mutton) and cook until browned on all sides.", "Add the onions and chilli to the pan and cook until softened.", "Meanwhile, make up a jug of stock with the three beef stock cubes and about 900ml/1 pint 12fl oz of boiling water, according to taste. Add the stock to the pan and simmer for 40 minutes until the meat is tender.", "While the soup is simmering, chop the yam, butternut squash and potato into pieces.", "Heat the chicken noodle soup in a separate pan add the yam, butternut squash and potatoes. Cook the vegetables until tender. When they are cooked all the way through, drain and reserve the liquid.", "Once the meat is tender, add the vegetables to the first pan and add some of the chicken noodle soup liquid if necessary.", "Scatter the spring onions over the soup along with the thyme leaves.", "Serve hot with dumplings if desired."]}, {"isVegetarian": false, "title": "Fesenjoon", "url": "www_bbc_co_uk_food_recipes_yasmins_fesenjoon_91487", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yasmins_fesenjoon_91487_16x9.jpg", "ingredients": ["250g/9oz walnut halves", "2 ice cubes", "125ml/4½fl oz pomegranate molasses, plus extra to taste", "1 tbsp concentrated tomato purée", "¼ tsp ground cinnamon", "2 tbsp caster sugar, plus extra to taste", "2 tsp salt", "1 tsp freshly ground black pepper", "800g/1¾lb chicken thighs, bone-in, skin removed ", "pomegranate seeds, to garnish (optional)", "steamed rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grind the walnuts as finely as possible in a food processor until they have the consistency of peanut butter and the walnut crumbs are starting to stick together like a dough.", "Transfer the ground walnuts into a large, lidded casserole dish and pour over 1 litre/1¾ pints of the cold water. Bring the mixture to the boil for 4–5 minutes, then reduce the heat until the mixture is simmering. ", "Simmer the walnut mixture, half-covered with the casserole lid, for 2 hours, adding the remaining 200ml/7fl oz of cold water and 2 ice cubesafter an hour. Stir occasionally throughout to make sure the walnuts don’t stick to the bottom of the casserole. After 2 hours, the walnut sauce should have thickened and darkened in colour. ", "Stir in the pomegranate molasses, tomato purée, cinnamon, sugar, salt and pepper until well combined. Return the mixture to a simmer.", "Add the chicken thighs, return the mixture to a simmer, then place the lid on the dish and cook gently over a low heat for 1 hour. Remove the lid for the last 10 minutes of cooking to allow the sauce to thicken. Season, to taste, with more sugar (for sweet) or pomegranate molasses (for sour).", "Garnish the dish with a handful of pomegranate seeds, if using, and serve with steamed rice."]}, {"isVegetarian": true, "title": "Yellow rice", "url": "www_bbc_co_uk_food_recipes_yellowrice_4614", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 tsp oil", "400g/14oz basmati rice ", "750m/1¼ pint boiling water", "2 tsp salt", "pinch of saffron soaked in a little warm water", "30g/1¼oz soaked raisins (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a deep saucepan until they start to foam. Add the rice and stir until all the grains are coated. Pour in the boiling water and stir. Add the salt and the saffron. Bring the water back to the boil. Add the raisins.", "Reduce the heat to a very gentle simmer and cover the pan with a tight fitting lid. Cook until all the water has been absorbed (about 20 minutes). Turn off the heat and leave the rice to stand for 5 minutes before serving."]}, {"isVegetarian": true, "title": "Yoghurt and muesli", "url": "www_bbc_co_uk_food_recipes_yoghurt_and_muesli_61842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz porridge oats", "50g/1¾oz barley or rye flakes", "25g/1oz sultanas", "50g/1¾oz ready-to-eat dried apricots", "150g/5½oz fat-free Greek-style yoghurt per portion, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients, apart from the yoghurt, together in a bowl. ", "Serve one-eighth of the muesli with the yoghurt on top. Store the rest of the muesli in an airtight container to up to two weeks."]}, {"isVegetarian": false, "title": "Yoghurt-spiced chicken skewers", "url": "www_bbc_co_uk_food_recipes_yoghurtspicedchicken_74830", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yoghurtspicedchicken_74830_16x9.jpg", "ingredients": ["2 chicken breasts ", "280ml/10fl oz natural yoghurt", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp salt", "½ tsp turmeric", "1 tsp fenugreek seeds", "1 tsp ground ginger", "1 tsp onion powder", "½ tsp ground cloves", "¼ tsp chilli powder", "4 punnets cherry tomatoes, cut in half", "220ml/8fl oz white wine vinegar", "4 tbsp caster sugar", "½ tsp dried chilli flakes"], "serves": "Serves 2-4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, mix all the ingredients together.", "Slice each chicken breast into five strips, and add them to the marinade. Stir to combine, and leave to marinate for at least an hour (longer if possible).", "Remove from the fridge and thread the chicken strips onto wooden skewers.", "Heat a large griddle pan until hot, then add the chicken skewers.", "Cook for three minutes on each side until browned and cooked through.", "For the jam, place all the ingredients into a saucepan and bring to the boil.", "Reduce the heat and simmer for up to an hour until jam-like. Cool and serve with the chicken skewers."]}, {"isVegetarian": false, "title": "Yorkshire curd tart", "url": "www_bbc_co_uk_food_recipes_yorkshire_curd_tart_20002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_curd_tart_20002_16x9.jpg", "ingredients": ["150g/5½oz plain flour", "2 tbsp icing sugar", "75g/2½oz cold unsalted butter, cut into roughly 1cm/½in cubes", "1 free-range egg yolk", "½ tsp lemon juice", "50g/1¾oz caster sugar", "225g/8oz curd cheese    ", "2 free-range eggs", "2 free-range egg yolks", "1 lemon, zest only", "1 tsp rosewater", "25g/1oz unsalted butter, melted", "50g/1¾oz currants", "½ tsp freshly grated nutmeg"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, mix the flour and icing sugar together in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture looks like fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "Mix the egg with the lemon juice and a tablespoon of water. Make a well in the centre of the flour mixture and pour in the egg mix. Using a table knife, work the liquid into the flour to bring the pastry together. If it seems too dry, add a splash more water. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap in cling film and rest in the fridge for at least 15 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Roll out the pastry on a lightly floured surface to about a 3mm thickness (about the thickness of a pound coin) and use it to line the tart tin, leaving excess pastry hanging over the edge. Keep a little uncooked pastry back in case you need to patch any cracks later.", "Line the pastry case with baking parchment or foil, then fill with baking beans, or uncooked rice or lentils. Bake blind for 15 minutes, then remove the parchment and baking beans and return the pastry to the oven for about eight minutes or until the pastry looks dry and faintly coloured. ", "Use a small, sharp knife to trim away the excess pastry from the edge. Use a tiny bit of the reserved raw pastry to patch any cracks or holes if necessary. ", "Turn the oven down to 180C/350F/Gas 4.", "To make the filling, beat the sugar and curd cheese together until smooth, then beat in the eggs and egg yolks, lemon zest, rosewater and melted butter. Stir in the currants.", "Pour the filling into the pastry case and grate a little nutmeg over the surface. Bake for about 20 minutes, until the filling is just set. Leave to cool completely in the tin before slicing."]}, {"isVegetarian": true, "title": "Yorkshire curd tart", "url": "www_bbc_co_uk_food_recipes_yorkshire_curd_tart_23874", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2 litres/2 pints full-fat milk", "4 tbsp lemon juice", "½ lemon, zest only", "65g/2½oz butter, softened ", "65g/2½oz caster sugar", "1 free-range egg, beaten", "¼ tsp finely grated nutmeg", "50g/2oz mixed dried fruit ", "175g/6oz plain flour, plus extra for rolling", "100g/3½oz cold butter, cubed", "2 tsp caster sugar", "1 free-range egg, beaten"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the filling, heat the milk in a large saucepan over a low heat and bring to a very gentle simmer. Remove from the heat. Pour in the lemon juice and stir twice as the curds form. Set aside to cool for an hour. ", "Line a sieve with muslin and place over a large bowl. Pour the curds and whey into the sieve and allow to drain in the fridge for at least six hours, preferably overnight. ", "To make the pastry, put the flour, butter and sugar in a food processor and blend on the pulse setting until the mixture resembles fine breadcrumbs. With the motor running, slowly add the egg and blend until the mixture comes together and begins to form a ball. Remove carefully and shape into a flattened round ready for rolling.", "Roll the pastry out on a lightly floured surface.  Using the rolling pin, lift the pastry carefully and line the pie dish, pressing down well into the base and sides of the tin. Trim any excess pastry and lightly prick the base of the tart and set aside. ", "Preheat the oven to 180C/350F/Gas 4. ", "Place a baking tray in the oven to heat. Using an electric whisk, cream the butter and sugar together until light and fluffy. Gradually beat in the egg, a little at a time, beating well between each addition. Stir in the curd cheese, lemon zest, nutmeg and fruit. Mix until well combined.", "Spoon the curd into the pastry base and spread to the sides. Bake for 30-35 minutes, or until the pastry is golden-brown and the filling sets.  Leave to cool in the tin for at least 30 minutes before serving. Serve at room temperature or chill before cutting."]}, {"isVegetarian": true, "title": "Yorkshire curd tart", "url": "www_bbc_co_uk_food_recipes_yorkshire_curd_tart_63644", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "100g/3½oz caster sugar", "100g/3½oz chilled butter, diced", "2 free-range egg yolks, beaten", "170g/6oz curd cheese (available from some large supermarkets)", "100g/3½oz caster sugar", "100g/3½oz butter, softened", "10g/¼oz plain flour", "50g/1¾oz raisins", "1 free-range egg, beaten", "1 lemon, zest only", "pinch nutmeg", "50g/1¾oz lemon curd "], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the sweet shortcrust pastry, grease and flour a 30cm/12in tart tin.", "Place the flour, caster sugar and chopped cold butter into a bowl or food processor. Gently rub the ingredients together with your fingertips or blend until the mixture resembles breadcrumbs.  ", "Add the beaten eggs and combine to form a light dough (add 2-3 tablespoons of water if needed).  ", "Form the dough into a ball and transfer to the fridge to chill for 30 minutes. ", "Preheat the oven to 180C/350F/Gas 4.", "On a lightly floured work surface, roll out the dough to 5mm/¼in thick. ", "Line the prepared tart tin with the pastry and trim any excess from the edges. Any unused pastry can be frozen for later use.", "Lay a piece of greaseproof paper over the pastry and fill with baking beans or dry pulses. Bake blind for 15-20 minutes at until dry and firm to touch.  ", "Remove the pastry case from the oven. Remove the baking beans and greaseproof paper. Set aside.", "For the filling, drain the liquid from the curd cheese by placing it in a sieve. Use the back of a spoon to squeeze out any excess moisture. Discard the liquid.", "In a bowl, beat the sugar and butter until smooth and pale.", "Add the flour, raisins, egg, curd cheese, lemon zest and nutmeg. Mix well.", "Spread the lemon curd over the pastry base, then fill with the curd cheese mix. Smooth the surface with a pallet knife or the back of a spoon.", "Bake for 35-40 minutes, or until the pastry is golden-brown and the filling set. ", "Allow the tart to cool in the tin for 20-25 minutes. ", "Remove from the tin and serve in slices."]}, {"isVegetarian": true, "title": "Yorkshire oatmeal parkin", "url": "www_bbc_co_uk_food_recipes_yorkshire_oatmeal_parkin_13911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz butter or margarine", "250g/9oz golden syrup ", "125g/4½oz black treacle ", "500g/1lb 2oz muscavado sugar", "375g/13oz plain flour ", "1½ tsp ground ginger ", "½ tsp baking powder", "500g/1lb 2oz oatmeal", "½ pint milk "], "serves": "Makes 1 large cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a 15x20cm/6x8in baking tin with greaseproof paper.", "In a pan, gently melt the butter (or margarine), golden syrup, black treacle and sugar until combined.  ", "Mix the remaining dry ingredients together in a large bowl.", "Add the hot syrup mixture and stir to combine.  Add the milk to help loosen the mixture.", "Pour into the prepared tin and bake for 35-45 minutes, or until springy to the touch."]}, {"isVegetarian": true, "title": "Yorkshire pudding", "url": "www_bbc_co_uk_food_recipes_yorkshire_pudding_69240", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_pudding_69240_16x9.jpg", "ingredients": ["100g/3½oz plain flour", "¼ tsp salt", "3 large free-range eggs ", "225ml/8fl oz milk", "sunflower oil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Mix the flour and salt together in a bowl and make a well in the centre. Add the eggs and a little of the milk. Whisk until smooth then gradually add the remaining milk. This can be done with a wooden spoon, but is easier with an electric hand-held whisk. Pour the mixture into a jug.", "Measure a dessertspoonful of oil into each hole of the 12 bun tray, or a tablespoonful in each hole of the four hole tins, or three tablespoonfuls into the roasting tin. Transfer to the preheated oven for five minutes, or until the oil is piping hot.", "Carefully remove from the oven and pour the batter equally between the holes or the tin. Return the batter quickly to the oven and cook for 20–25 minutes (35 if making the Yorkshire pudding in the roasting tin), or until golden-brown and well-risen.", "Serve immediately."]}, {"isVegetarian": false, "title": "How to make Yorkshire puddings", "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_61798", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_puddings_61798_16x9.jpg", "ingredients": ["125g/4½oz plain flour", "2 medium free-range eggs", "300ml/10fl oz full-fat milk", "sea salt and freshly ground black pepper", "4 tbsp goose fat, beef dripping or lard (if you are vegetarian, you can use rapeseed oil, sunflower oil or vegetable oil) "], "serves": "Makes 8 large puddings", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Sieve the flour into a large bowl. Add the eggs and whisk in. Once incorporated, gradually whisk in the milk a little at a time, Whisk to a smooth batter, season with salt and pepper and then pour the batter into a jug. Cover with cling film and refrigerate for 30 minutes.", "Preheat the oven to 200C/400F/Gas 6. Put half a tablespoon of fat or oil into each of eight holes of a deep muffin tin. Leave in the oven for 5-7 minutes to minutes to heat up, or until the fat is smoking hot.", "Pour the cool batter into the holes dividing it equally and return to the oven. Cook for 20 minutes without opening the door, then check and cook for a further 2-3 minutes if necessary or until golden-brown and risen. Remove and serve immediately."]}, {"isVegetarian": false, "title": "Yorkshire puddings and French onion soup", "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_and_40867", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "salt and freshly ground black pepper", "8 medium free-range eggs", "600ml/20fl oz whole milk", "55g/2oz dripping", "25g/1oz unsalted butter", "2 tbsp olive oil", "1kg/2lb 4oz white onions, finely sliced", "2 sprigs fresh thyme, leaves picked", "3 garlic cloves, finely chopped", "50ml/2fl oz dry sherry", "250ml/9fl oz white wine", "2 tbsp plain flour", "1.2 litres/2 pints fresh veal or beef stock", "1 tsp soft brown sugar", "salt and freshly ground black pepper", "4 slices of baguette", "110g/4oz emmental cheese, grated"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the Yorkshire puddings, to make the batter, place the flour in a large bowl and season with salt and pepper. Add the eggs and whisk. Gradually add the milk, whisking all the time.", "Let the batter rest for 24 hours in the fridge.", "To cook the Yorkshire puddings preheat the oven to 220C/450F/Gas 7.", "In a Yorkshire pudding tray with 8-12 holes place a little of the dripping in each hole and place in the hot oven until the fat is hot.", "Remove from the oven and pour in the batter. Place in the oven for 20-25 minutes. Turn down the heat to 190C/375F/Gas 5 and cook for a further 10 minutes.", "For the French onion soup, heat a large saucepan and add the butter and oil. Once hot, add the onions and thyme and fry for 20-25 minutes over a low heat, or until soft and golden-brown.", "Add the garlic and cook for another couple of minutes then add the sherry and white wine. Cook until the liquid has reduced in volume by half.", "Stir in the flour and cook for a further couple of minutes, then pour in the stock. ", "Bring to a simmer and cook gently for 10-15 minutes and season with the sugar, salt and pepper.", "To make baguette croutons, preheat the grill to high. ", "Place the bread on a baking sheet and lightly toast under the grill, then add the grated cheese and return to the grill until golden-brown.", "To serve, ladle some of the soup into warm bowls and top with the cheesy croutons.", "Place the Yorkshire puddings a plate and serve the rest of the soup with them."]}, {"isVegetarian": false, "title": "Yorkshire puddings with onion gravy", "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_with_15870", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "8 free-range eggs", "500ml/18fl oz whole milk", "salt and freshly ground black pepper", "75g/2¾oz beef dripping", "250ml/9fl oz red wine", "1 litre/1¾ pints fresh beef or veal stock", "50g/1¾oz butter", "3 onions, thinly sliced", "3 sprigs thyme, leaves picked", "50ml/1¾fl oz brandy"], "serves": "Makes 12 large puddings", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Yorkshire puddings, place the flour into a bowl, whisk in the eggs and milk until as smooth as possible then season with salt and black pepper.", "Pour into a jug and place in the fridge to rest, preferably overnight.", "Heat the oven to 220C/425F/Gas 7.", "Place a 12 hole deep muffin tin into the oven and leave for five minutes, then add a little beef dripping into each of the holes and leave to heat for 5-10 minutes, or until smoking hot.", "Take the batter from the fridge and whisk one more time. Carefully pour the batter into the tins and bake for 10-15 minutes until golden-brown and risen around the edges.", "For the onion gravy, place the red wine into a wide sauté pan and heat until reduced by half. Add the stock and cook over a very low heat until reduced by half again.", "Meanwhile, heat a large pan until hot then add the butter, sliced onions and thyme leaves and cook for 12-15 minutes, or until soft and lightly golden-brown.", "Add the brandy and flambé to burn off the alcohol (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.). Add the reduced stock and bring to the boil.", "Reduce the heat to a simmer and cook for another five minutes then season with salt and freshly ground black pepper.", "To serve, pour the onion gravy over the warm Yorkshire puddings."]}, {"isVegetarian": false, "title": "Yorkshire puddings with rib of beef and seasonal cabbage", "url": "www_bbc_co_uk_food_recipes_yorkshire_puddings_with_50889", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "salt and freshly ground black pepper", "8 free-range eggs", "600ml/20fl oz whole milk", "50g/1¾oz beef dripping or lard", "4kg 28-day-old forerib of beef, on the bone", "50ml/2fl oz olive oil", "50g/1¾oz unsalted butter", "1 savoy cabbage, core removed, finely sliced", "2 tbsp caraway seeds", "beef jus or gravy, to serve"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Yorkshire puddings, place the flour into a bowl and season with salt and freshly ground black pepper.", "Add the eggs and milk to the bowl and whisk to make a smooth batter.", "Cover and place in the fridge to chill for at least one hour, but preferably overnight.", "For the beef, preheat the oven to 200C/400F/Gas 6.", "Heat a frying pan until very hot. Season the beef with salt and freshly ground black pepper and brush with a little olive oil. Add the beef to the hot pan. Fry on all sides in the hot pan until nicely browned.", "Transfer the beef to a roasting dish and place in the oven to cook for 1 hour 10 minutes for rare, or longer to suit your taste.", "Remove the beef from the oven, cover with foil and rest in a warm place for 15-30 minutes.", "For the Yorkshire puddings, preheat the oven to 220C/450F/Gas 7. Divide the dripping or lard between two 12-hole muffin tins or Yorkshire tins and place the tins in the oven for ten minutes until smoking hot.", "Carefully pour the batter into the tins, filling the tins two-thirds full.", "Place the tins into the oven and cook the Yorkshire puddings for 20 minutes - do not open the oven door during this time.", "After 20 minutes, open the door to allow any steam to escape and turn the temperature down to 190C/375F/Gas 5. Continue to cook until the Yorkshire puddings are golden-brown and crisp.", "For the seasonal cabbage, heat a large frying pan and add the butter. Once hot add the cabbage and a little water. Add the caraway seeds and cook for 2-3 minutes until the cabbage has wilted.", "To serve, carve the beef and place on plates along with the Yorkshire puddings and cabbage. Pour the beef jus or gravy over the beef and puddings."]}, {"isVegetarian": false, "title": "Yorkshire ‘tapas’ puddings", "url": "www_bbc_co_uk_food_recipes_yorkshire_tapas_puddings_93245", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_tapas_puddings_93245_16x9.jpg", "ingredients": ["12 tsp sunflower oil ", "125g/4½oz plain white flour", "pinch salt", "1 tsp mustard powder ", "pinch black pepper", "75g/2½oz full-fat milk", "2 free-range medium eggs, beaten", "½ chicken stock cube ", "pinch saffron strands", "2 tbsp extra virgin olive oil", "1 small onion, thinly sliced", "2 large chicken breasts, cut into bite-sized pieces", "1 red chillies, thinly sliced", "large pinch ground cinnamon ", "2 tbsp cider vinegar ", "6 cherry tomatoes, cut into quarters", "1 tbsp honey", "1 tbsp sultanas", "50g/1¾oz flaked almonds, toasted ", "small handful fresh coriander "], "serves": "Makes 12 Yorkshire puddings", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 250C/230C Fan/Gas 9.", "For the Yorkshire puddings, add 1 teaspoon of oil to each hole of a muffin tin. Place the tray on the top shelf of the oven to preheat the oil.", "In a large mixing bowl, sift in the flour, salt, mustard powder and pepper. In a jug, combine the milk and 75g/2½oz cold water. Make a well in the flour mixture and crack in the eggs. Whisk to combine (the consistency should be a very thick batter). Slowly add the milk mixture and whisk until the consistency of single cream. Decant into a pouring jug and leave to rest at room temperature for 30 minutes.", "Remove the preheated tins from the oven and quickly pour in about 5mm depth of batter into each hole, taking care to protect yourself from any splashes of hot oil. The oil should sizzle when the batter is poured in. ", "Quickly return to the top shelf of the oven and bake for 15 minutes until browned and well risen. Don’t open the oven door until they are cooked or the puddings will collapse. Remove each pudding from the tin and place on a wire rack to cool. ", "For the filling, put the stock cube in a measuring jug and add 200ml/7fl oz boiling water. Mix until dissolved then add the saffron. Set aside.", "Heat the oil in a large frying pan set over a medium heat. Add the onion and cook for 5 minutes until soft and golden-brown. Add the chicken and cook for 3 minutes, or until the chicken is starting to brown. Add the chilli and cinnamon and cook for a few minutes. Add the saffron stock, cider vinegar, tomatoes, honey and sultanas to the pan and bring to the boil. Turn down the heat and simmer for 10 minutes to reduce the sauce.", "Pick 12 coriander leaves and set aside to use as a garnish. Finely chop the remainder and stir into the sauce.", "To serve, use a paring knife to cut a well in the centre of each pudding. Fill each Yorkshire with the filling. Scatter the toasted almonds on top and garnish with a coriander leaf."]}, {"isVegetarian": false, "title": "Yorkshire turkey cake on crushed peas", "url": "www_bbc_co_uk_food_recipes_yorkshire_turkey_cake_on_64435", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz plain flour, plus extra for dusting", "200g/7oz self-raising flour", "½ tsp baking powder", "1 litre/1¾ pints chilled water", "1 tbsp malt vinegar", "1 tbsp soy sauce", "½ tsp grated root ginger", "4 slices leftover turkey (about 200g/7oz)", "vegetable oil, for frying", "1 large floury potato, peeled, sliced into 8 equal-sized thin slices", "50g/2oz butter", "1 shallot, finely chopped", "340g/11¾oz frozen peas", "2 tbsp chopped fresh mint leaves", "splash malt vinegar", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the two flours into a large mixing bowl. Add the baking powder and water and mix to get a creamy consistency. Add the vinegar and put in the fridge for 30 minutes. ", "Meanwhile, for the turkey cake, mix together the soy sauce and ginger. Add the turkey slices and set aside to marinate.", "Heat the oil in a deep-fat fryer to 175C/340F. Alternatively, heat the vegetable oil in a deep-sided, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Sandwich each marinated turkey slice between two slices of potato, shaking off any excess marinade. Sprinkle the flour on a plate and dust each turkey ‘cake’ in the flour to coat. Dip in the batter, then carefully lower into the hot oil and fry for 6-8 minutes, or until the potato slices are tender and the batter is crisp and golden-brown. Set aside to drain on kitchen paper, keep warm. ", "For the peas, heat the butter in a frying pan over a medium heat. Add the shallot and fry for 3-4 minutes, or until softened but not coloured. Add the peas, mint, vinegar and a little cold water and stir well. Continue to cook for 2-3 minutes, or until heated through. Season, to taste, with salt and pepper.", "Remove half of the pea mixture from the pan and transfer to a plate. Mash the remaining pea mixture. Return the reserved pea mixture to the frying pan, then season again if necessary.", "Serve the turkey cakes with the crushed peas alongside."]}, {"isVegetarian": true, "title": "Yorkshire tea cake", "url": "www_bbc_co_uk_food_recipes_yorkshire_tea_cake_98065", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 good-quality strong, black tea bags", "4 tbsp brandy ", "1 tsp rosewater ", "1 tbsp clear honey ", "115g/4oz sultanas", "75g/2½oz raisins", "50g/1¾oz currants", "180g/6½oz strong bread flour ", "1½ tsp baking powder", "½ tsp ground cinnamon ", "½ tsp ground nutmeg", "2 tbsp medium-cut orange marmalade ", "120g/4oz soft brown sugar", "1 large free-range egg, at room temperature, lightly beaten", "30g/1oz unsalted butter, melted and cooled until tepid", "2 tbsp marmalade", "marzipan fruits (optional) ", "gold leaf (optional)"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the tea bags in a bowl and add 200ml/7fl oz hot water, the brandy, rosewater, honey and dried fruit. Cover and soak overnight, or until the fruit is plump. (If you are short of time, you can cheat a little by warming the ingredients gently to speed up the process).  ", "Preheat the oven to 180C/350F/Gas 4 and line a 450g/1lb loaf tin with baking paper.", "When the fruit is plump, strain it and discard the liquid and tea bags. ", "Sift the flour, baking powder, cinnamon and nutmeg into a large bowl. Add the marmalade and brown sugar. Stir in the egg and melted butter and combine to form a soft dough.  Add the fruit and thoroughly mix together.", "Transfer the mixture to the prepared loaf tin and bake for 50-60 minutes, or until a wooden skewer comes out clean.", "Remove from the oven and leave in the tin for 10 minutes. Turn out and cool on wire rack.", "To decorate the cake, brush the cake with marmalade. Cut the marzipan fruits in half and place on top of the cake. Use the gold leaf to gilt the marzipan fruits."]}]