[{"ingredients": ["150g / 5½oz tipo '00' harina de pasta", "2 huevos de gallinas camperas", "botón de mantequilla", "2 chalotes de plátano, finamente picados", "1 diente de ajo, finamente picado", "100g / 3½oz de guisantes frescos, peso envasada", "1 cucharada de requesón", "½ limón, solo ralladura", "15 hojas de menta, finamente picadas", "pizca de sal", "Pizca de pimienta", "brotes de guisantes, para decoración", "50g / 1¾oz de mantequilla clarificada", "50 g / 1¾oz de tocino, en cubos"], "method": ["Para la pasta, coloca la harina en una superficie de trabajo y haz un pozo en el centro. Batir los huevos y verter la mezcla en el pozo. Usando dos dedos junte la harina y el huevo, trabajando en un movimiento circular desde el centro del pozo, hasta que forme una masa. Amasar hasta que quede suave.", "Corta la masa en cuatro pedazos iguales. Pase cada pieza de masa a través de una máquina de pasta; comience en la configuración más amplia y pase la masa cinco veces en cada configuración, moviéndola una configuración a la vez hasta la más estrecha. Repita para todos los pedazos de la masa. Coloque las hojas de pasta en una superficie enharinada y corte las rondas. Deje la pasta sobre la superficie enharinada cubierta con un paño húmedo hasta que el relleno esté listo.", "Para el relleno, fría los chalotes y el ajo por unos minutos, agregue los guisantes y cocine hasta que estén suaves. Retire la mezcla del fuego y agregue la ricotta, la ralladura de limón y la menta y déjela enfriar.", "Coloque una cucharadita del relleno en un círculo de pasta. Moje los bordes de un segundo círculo de pasta y colóquelo cuidadosamente en la parte superior. Asegúrate de sacar todo el aire del ravioli, o puede que se cocine de manera desigual o explotar durante la cocción.", "Para la salsa de mantequilla, cocine la panceta en una sartén caliente a fuego medio hasta que esté dorada.", "Coloque la mantequilla clarificada en una sartén pequeña, agregue la panceta cocida y caliente suavemente para que se caliente.", "Mientras tanto, cocine los raviolis en agua hirviendo durante dos minutos. Saque los ravioles cocidos de la sartén con una espumadera y colóquelos en un tazón para secarlos durante unos segundos antes de drenar el exceso de agua del tazón. Divida la pasta entre dos platos para servir, vierta la salsa de mantequilla sobre la pasta, esparza los brotes de guisantes y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pea_mint_and_ricotta_06456", "title": "Raviolis de guisantes, menta y ricota con mantequilla de panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 puerro, picado", "1 diente de ajo, finamente picado", "150g / 5½oz de guisantes frescos", "200ml / 7fl oz de caldo de verduras calientes", "sal y pimienta fresca", "2 cucharadas de aceite de oliva", "½ cucharadita de pimienta de cayena", "1 rebanada de pan crujiente blanco, aproximadamente desgarrado", "sal y pimienta negra recién molida", "puñado de menta fresca, picada"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la sopa, caliente el aceite en una cacerola pequeña, agregue la cebolla y el puerro y saltee durante tres minutos. Agregue el ajo y fría por un minuto. Agregue los guisantes y el caldo y cocine a fuego lento durante cinco minutos. Sazone al gusto con sal y pimienta negra recién molida.", "Para los crotones, coloque el aceite y la pimienta de cayena en un recipiente, agregue el pan desmenuzado, sazone al gusto con sal y pimienta negra recién molida. Mezclar para cubrir.", "Coloque los pedazos de pan en una bandeja para hornear y hornéelos en el horno durante ocho minutos o hasta que estén crujientes y dorados.", "Para servir, ponga la sopa en un tazón, cubra con los crotones y adorne con hojas de menta picadas."], "url": "www_bbc_co_uk_food_recipes_peaandleeksoupwithsp_86280", "title": "Sopa de guisantes y puerros con croûtons especiados y menta fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 cebolla, pelada, finamente picada", "1 diente de ajo, pelado, finamente picado", "Arborio 250 g / 9oz u otro arroz risotto italiano", "150ml / 5fl oz de vino blanco seco", "1 litro / 1 pinta 15fl oz de caldo de pollo", "175g / 6oz de guisantes frescos, fuera de sus vainas", "2 cucharadas de hojas de mejorana fresca finamente picado", "2 cucharadas de mascarpone", "25 g / 1 oz de queso parmesano, rallado", "sal y pimienta negra recién molida", "Calamares para bebé de 400 g / 14 oz, limpios", "2 cucharadas de aceite de oliva", "½ limón, solo jugo", "2 cucharadas de perejil de flatleaf fresco picado"], "method": ["Derrita la mantequilla en una sartén grande hasta que haga espuma, luego fría la cebolla y el ajo durante 2-3 minutos, o hasta que se ablanden. Agregue el arroz risotto y mezcle bien para cubrir la mantequilla. Cocine durante 1-2 minutos, o hasta que los granos de arroz comiencen a ponerse translúcidos.", "Agregue el vino y cocine por 3-4 minutos, o hasta que casi todo el líquido se haya evaporado. Agregue un cucharón de caldo de pollo a la sartén y mezcle bien. Cocine durante 1-2 minutos, o hasta que se haya absorbido casi todo el caldo, luego agregue otro cucharón de caldo. Repite el proceso hasta que el arroz esté cocido pero aún al dente.", "Agregue los guisantes durante los últimos 2 o 3 minutos de cocción, luego agregue la mejorana picada, el mascarpone y el parmesano. Sazonado, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Sazone el calamar con sal y pimienta negra recién molida, luego mezcle en un recipiente con el aceite de oliva para cubrir. Caliente una sartén hasta que fume, luego cocine el calamar durante 1-2 minutos en ambos lados, o hasta que esté dorado y recién cocido.", "Retire el calamar de la sartén y coloque en un bol con el jugo de limón y el perejil. Mezclar bien.", "Para servir, espolvorear el risotto en el centro de cuatro platos para servir y completar cada porción con algunos de los chipirones."], "url": "www_bbc_co_uk_food_recipes_peaandmarjoramrisott_91606", "title": "Risotto de guisantes y mejorana con chipirón a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 4oz de guisantes frescos, sin cáscara", "¼ manojo de menta fresca, picado aproximadamente", "1 cucharadita de pecorino joven, rallado", "55 g / 2 oz de queso parmesano, rallado (o queso vegetariano similar)", "1 limón", "1-2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla sin sal", "3 huevos, preferiblemente de campo abierto", "1-2 cucharadas de crema fresca", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 180C / 350F / Gas 4 - 200C / 400F / Gas 6.", "Rápidamente blanquee o simplemente sumerja los guisantes en agua hirviendo para ablandarlo o si es pequeño y dulce simplemente lave. Coloque en un almirez y mortero con menta toscamente picada (reservando algunas hojas para adornar) y ralle el pecorino y machaque hasta obtener una pasta. Agregue un poco de sal, un poco de queso parmesano, un chorrito de jugo de limón y aceite de oliva.", "Derrita la mantequilla en una sartén antiadherente y resistente al horno. Rompa los huevos en un bol, mezcle ligeramente, agregue un chorrito de agua y sazone. Agregue la mezcla a la sartén y luego agregue un poco de la mezcla de arvejas, revolviendo una o dos veces.", "Coloque la crème fraîche en el medio y hornee en el horno durante 3 minutos. Deslice sobre un plato y sirva espolvoreado con la menta reservada y el queso parmesano restante."], "url": "www_bbc_co_uk_food_recipes_peaandmintfritatta_11234", "title": "Tortilla de guisantes y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla picada", "1 diente de ajo, en rodajas", "200g / 7oz de arroz risotto", "50ml / 2fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo caliente", "50g / 1¾oz de guisantes congelados", "1 pequeño puñado de menta fresca, picada", "2 cucharadas de crema doble", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "Filete de salmón 50g / 1¾oz, cocido y en copos"], "method": ["Calienta el aceite en una sartén grande. Agregue la cebolla y el ajo y freír suavemente durante tres minutos o hasta que los ingredientes se hayan suavizado pero no estén coloreados.", "Agregue el arroz a la cacerola y mezcle bien durante 2-3 minutos, o hasta que los granos se vuelvan transparentes.", "Agregue el vino a la cacerola y suba el fuego. Cocine por 1-2 minutos, o hasta que el vino haya sido absorbido.", "Poco a poco agregue el caldo de pollo caliente a la cacerola, un cucharón a la vez y revuelva continuamente, solo agregue el siguiente cucharón de caldo cuando el arroz haya absorbido por completo el cucharón anterior. Cocine hasta que todo el caldo haya sido absorbido y el arroz esté ligeramente al dente.", "Agregue los guisantes, menta fresca, crema doble y mantequilla. Sazonar con sal y pimienta negra recién molida y mezclar bien. Cubra con una tapa y deje cocer durante 2-3 minutos.", "Para servir, vierta el arroz en un tazón y coloque los copos de salmón encima."], "url": "www_bbc_co_uk_food_recipes_peaandmintrisottowit_84597", "title": "Risotto de guisantes y menta con salmón copos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla roja, pelada y cortada en cubitos", "2 dientes de ajo, pelados y triturados", "½ pt de caldo de verduras", "puñado de menta fresca", "puñado de guisantes frescos", "crema de llovizna", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una cacerola y saltear la cebolla y el ajo durante 2-3 minutos, para ablandar.", "Verter en el caldo y llevar a ebullición. Agregue la menta y los guisantes. Reduzca el fuego y cocine a fuego lento durante 8-10 minutos.", "Transfiera la mezcla a un licuador y mezcle hasta que quede suave.", "Regrese a la sartén para calentar y agregue la crema, la sal y la pimienta negra recién molida.", "Cucharee en tazones de sopa para servir."], "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_76612", "title": "Sopa de guisantes y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, picado", "½ cebolla, picada", "200g / 7oz de guisantes congelados", "300 ml / 10 fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "hoja de menta, para adornar"], "method": ["Calentar el aceite en una cacerola a fuego medio. Agregue la cebolla y el ajo y fría por 3-4 minutos, hasta que se ablanden.", "Agregue los guisantes congelados y el caldo de pollo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante diez minutos.", "Agregue la crema y use una licuadora para licuar la sopa.", "Sazonar, al gusto, con sal y pimienta negra recién molida y servir en un recipiente tibio, adornado con una hoja de menta."], "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_81285", "title": "Sopa de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "½ cebolla, picada", "1 diente de ajo, finamente picado", "300 ml / ½ pinta de caldo de pollo", "Guisantes 300 g / 10½ oz", "2 cucharadas de crema doble", "2 cucharadas de menta fresca picada", "Cebollín fresco, para adornar"], "method": ["Derrita la mantequilla en una cacerola a fuego medio, y cuando burbujee agregue la cebolla y el ajo y cocine, durante cinco minutos, o hasta que se ablanden.", "Agregue el caldo de pollo, guisantes, crema y menta a la cacerola y cocine a fuego lento durante dos minutos.", "Mezcle la mezcla de sopa con una batidora y vierta en un bol limpio.", "Para servir, decorar con cebolletas."], "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_84089", "title": "Sopa de guisantes y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1 pinta 15 fl oz de agua", "sal", "gran puñado de menta fresca, solo hojas", "500 g / 1 libra de guisantes frescos de 2 oz (peso sin cáscara)", "sal y pimienta negra recién molida", "rociar aceite de oliva", "200 ml / 7 fl oz crema fresca", "4 rebanadas de jamón de Parma, fritas o a la parrilla hasta que estén crujientes (opcional), para servir"], "method": ["Ponga el agua a hervir en una sartén grande y agregue una generosa pizca de sal.", "Agregue las hojas de menta y vuelva a hervir el líquido.", "Agregue los guisantes y cocine por 2-3 minutos, hasta que los guisantes estén tiernos y de color verde brillante.", "Colar la menta y las arvejas, reservar el líquido para cocinar y transferir los guisantes y la menta a un procesador de alimentos. Deje que se enfríe durante 3-4 minutos.", "Agregue lo suficiente del líquido de cocción para cubrir los guisantes y la menta, luego mezcle durante 1-2 minutos, para crear un puré suave y de color verde brillante.", "Sazonar, al gusto, con sal y pimienta negra recién molida y agregar una generosa llovizna de aceite de oliva.", "Agregue 140ml / 4½fl oz de crème fraîche al puré de guisantes y menta y pulse en la licuadora durante unos segundos, hasta que se combinen.", "Para servir, vierta cantidades iguales de la sopa en cuatro cuencos calentados. Agregue una cucharada de crème fraîche en el centro de cada uno y, si lo desea, adorne con el crujiente jamón de Parma."], "url": "www_bbc_co_uk_food_recipes_peaandmintsoup_89420", "title": "Sopa de guisantes y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peaandmintsoup_89420_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, triturado hasta formar una pasta en un mortero", "100g / 3½ oz de guisantes frescos", "400ml / 14fl oz de caldo de pollo o vegetal", "2 cucharadas de menta fresca picada", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "3 cucharadas de vinagre de vino blanco", "1 huevo de gallinas camperas"], "method": ["Para la sopa, caliente el aceite de oliva en una sartén y fríe con cuidado la cebolla y el ajo durante 3-4 minutos o hasta que estén blandos. Agregue los guisantes y el caldo y deje hervir a fuego lento durante 4-5 minutos, o hasta que los guisantes estén tiernos.", "Agregue la menta y la nata y condimente, al gusto, con sal y pimienta negra recién molida. Usando una batidora, procesa la sopa hasta que quede suave. Mantener caliente", "Para el huevo escalfado suave, ponga a hervir un recipiente con agua, luego agregue el vinagre y reduzca a fuego lento. Rompe el huevo en un tazón. Con un cucharón, agite el agua en la sartén para crear un remolino, luego vierta cuidadosamente el huevo en el centro del remolino. Cueza durante 2 o 3 minutos, o hasta que los blancos estén listos, luego retírelos con una espumadera y escurra sobre papel de cocina.", "Para servir, ponga la sopa en un bol y cubra con el huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_peaandmintsoupwithas_90681", "title": "Sopa de guisantes y menta con un huevo escalfado suave", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla", "½ cebolla, finamente picada", "1 diente de ajo, picado", "100g / 3½oz de guisantes congelados", "150ml / ¼ pinta de caldo de verduras", "puñado de hojas de menta fresca, picada", "2 cucharadas de crema doble", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco crujiente", "1 cucharada de aceite de oliva"], "method": ["Para la sopa, caliente la mantequilla en una cacerola y fríela suavemente hasta que esté blanda pero no coloreada. Agregue el ajo y cocine por un minuto.", "Agregue los guisantes y el caldo de verduras. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 4-5 minutos.", "Agregue la menta y la crema doble y cocine a fuego lento hasta que se espese un poco.", "Vierta la mezcla en un procesador de alimentos, sazone al gusto, con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "Para la tostada, caliente una sartén hasta que esté caliente. Rocíe el pan con aceite de oliva y dore en ambos lados hasta que estén crujientes y tostados.", "Para servir, coloca la sopa en un tazón con la tostada al lado."], "url": "www_bbc_co_uk_food_recipes_peaandmintsoupwithto_85317", "title": "Sopa de guisantes y menta con pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "50g / 2oz de mantequilla", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "Arroz risotto 400g / 14oz", "Vino blanco 150ml / 5oz", "1,5 litros / 2½ pintas de caldo de pollo caliente", "450 g / 1 libra de guisantes congelados", "25g / 1oz de queso pecorino rallado", "puñado de menta fresca, más o menos picada", "sal y pimienta negra recién molida"], "method": ["Caliente una olla grande de base pesada y agregue el aceite y la mitad de la mantequilla. Caliente hasta que esté espumante, luego agregue la cebolla y cocine suavemente durante aproximadamente 5 minutos hasta que comience a ablandarse. Agregue el ajo y cocine durante unos minutos, agregue el arroz y caliente durante un minuto hasta que esté brillante y opaco.", "Verter el vino y hervir durante 1 minuto para permitir que el alcohol se evapore, revolviendo constantemente. Baje el fuego a fuego medio y comience a agregar el caldo de un cucharón a la vez, permitiendo que el líquido se absorba en el arroz antes de agregar más.", "Después de 15 minutos de cocción, agregue los guisantes congelados y cocine por otros 5-7 minutos.", "Cuando el arroz se siente suave y esponjoso y la textura es cremosa, pero cada grano está firme con la mordida en el centro, el risotto está listo. En este punto, tome el risotto del fuego y agregue la mantequilla restante, el queso y la menta y sazone al gusto. Deje reposar con la tapa encendida durante unos minutos y luego sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_peaandpecorinorisott_70243", "title": "Risotto de guisantes y pecorino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 cebolla, pelada, finamente picada", "1 diente de ajo, pelado, finamente picado", "Arroz arborio 250 g / 9 oz", "150ml / 5fl oz de vino blanco seco", "1 litro / 1 pinta 15fl oz de caldo de pollo caliente", "200 g / 7 oz de guisantes frescos envasadas", "250 g / 9 oz hojas de espinaca bebé", "3 cucharadas de mascarpone", "25 g / 1 oz de queso parmesano, rallado", "sal y pimienta negra recién molida", "Guisante pequeño de 110 g / 4 oz", "3 cucharadas de hojas de menta fresca picada", "175ml / 6fl oz de aceite de oliva virgen extra", "4 x 175g / 6oz filetes de dorada", "sal", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 brote de guisante fresco"], "method": ["Para el risotto de guisantes y espinacas, derrita la mantequilla en una sartén grande hasta que forme espuma, luego fríe la cebolla y el ajo durante 2-3 minutos, o hasta que se ablanden.", "Agregue el arroz y mezcle bien para cubrir la mantequilla. Cocine por otros 1-2 minutos, o hasta que el arroz sea translúcido. Agregue el vino y cocine por 3-4 minutos, o hasta que casi todo el líquido haya sido absorbido. Mientras tanto, mantenga el caldo de pollo caliente en una sartén a fuego lento.", "Agregue un cucharón de caldo de pollo al arroz y mezcle bien. Cocine por 1-2 minutos, o hasta que casi todo el caldo haya sido absorbido, luego agregue otro cucharón de caldo. Repite el proceso hasta que el arroz esté cocido pero aún al dente. (Es posible que no necesite todas las existencias).", "Agregue los guisantes durante los últimos 2 o 3 minutos de cocción, luego agregue las hojas de espinaca, mascarpone y parmesano. Revuelva suavemente hasta que el queso se haya derretido y el arroz tenga una textura cremosa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el aceite de guisante, ponga a hervir una olla pequeña de agua salada, luego agregue los guisantes y la menta y blanquee durante 1-2 minutos. Escurrir y refrescar con agua corriente fría, luego escurrir nuevamente y colocar los guisantes y la menta en un procesador de alimentos. Agregue el aceite de oliva y mezcle hasta obtener un puré suave.", "Pase la mezcla de guisantes a través de un colador fino, presionando ligeramente hacia abajo, en un tazón pequeño. Deseche los sólidos que quedan en el tamiz. Aparte el aceite de guisante.", "Para el besugo, condimente los filetes de besugo con un poco de sal. Calentar una sartén hasta que esté caliente y agregar la mantequilla y el aceite de oliva. Cuando la mantequilla esté espumosa, agregue los filetes de besugo, con la piel hacia abajo. Freír durante 2-3 minutos, o hasta que la piel esté crujiente y dorada. (El pescado debe estar medio cocido en esta etapa.) Voltee el pescado y cocine durante 1-2 minutos más, o hasta que el pescado esté completamente cocido (la carne debe estar completamente opaca y desmenuzarse fácilmente).", "Coloque el risotto en el centro de cuatro platos para servir y cubra con los filetes de dorada. Viste los brotes de guisantes con una cucharada de aceite de guisantes y coloca una pequeña pila encima de cada trozo de pescado. Rocíe un poco más de aceite de guisante alrededor de los platos y sirva."], "url": "www_bbc_co_uk_food_recipes_peaandspinachrisotto_93617", "title": "Risotto de guisantes y espinacas con dorada frita y aceite de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1½kg / 3lb 5oz de papa, frotados", "100 g / 3½ oz de mantequilla", "500ml / 18fl oz de leche (si lo quieres rico usa ¾ leche para ¼ de crema)", "Guisantes de 450 g / 1lb", "75g / 2¾oz cebollas de primavera, picadas", "4 cucharadas de perejil picado", "sal y pimienta negra recién molida"], "method": ["Para hacer el campeón, cocine las papas en agua con sal durante 5-10 minutos, hasta que estén tiernas.", "Escurra las tres cuartas partes del agua y continúe cocinando a fuego lento. Evite apuñalar las papas con un cuchillo, porque si son papas harinosas se romperán si lo hace.", "Cuando esté cocinado, drene toda el agua, pele y haga puré con la mayor parte de la mantequilla mientras está caliente.", "Mientras tanto, coloque la leche en una cacerola con los guisantes y la cebolleta y hierva durante cuatro o cinco minutos, hasta que esté cocida.", "Agregue el perejil y quite el fuego.", "Agregue las papas, guardando parte de la leche en caso de que no lo necesite todo.", "Sazone al gusto y bata hasta que quede cremoso y suave, agregando más leche si es necesario.", "Servir caliente y la mantequilla restante derritiéndose en el centro."], "url": "www_bbc_co_uk_food_recipes_peaandspringonioncha_73827", "title": "Campeón de guisantes y cebolla de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 ml / 1 oz de aceite de tomate secado al sol (el aceite de un frasco de tomates secados al sol)", "1 diente de ajo, finamente picado", "1 cucharada de cebolla roja picada", "pizca de copos de chile seco", "50g / 2oz de tomates secados al sol", "50g / 2oz de guisantes frescos", "50g / 2oz de pan rallado fresco", "100g / 3½oz de merluza", "Harina normal de 50g / 2oz", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la salsa de tomate, caliente el aceite en una sartén y cocine el ajo, la cebolla y el chile hasta que estén suaves.", "Agregue los tomates y cocine por cinco minutos.", "Para hacer la merluza, coloque los guisantes y las migas de pan en un procesador de alimentos y mezcle.", "Mezcle la merluza en la harina, sumerja en el huevo y luego revuelva en la corteza de arveja hasta cubrir todo.", "Calentar el aceite de oliva en una sartén y freír la merluza durante un minuto en cada lado hasta que esté coloreado.", "Coloque en el horno y tueste durante cinco minutos o hasta que estén cocidos. Sazonar con sal y pimienta negra recién molida.", "Sirva la merluza en el medio de un plato caliente y espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_peabreadedhakewithsu_82784", "title": "Merluza empanizada con salsa de tomate secada al sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4oz de harina de auto crianza", "75g / 3oz de mantequilla sin sal", "75g / 3oz azúcar moreno claro", "½ cucharadita de canela molida", "1 cucharada de azúcar demerara", "250g / 8oz de mantequilla, más extra para engrasar", "Harina normal de 250g / 8oz", "125g / 4 oz de azúcar granulada", "150 g / 5 oz de azúcar morena suave", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "3 huevos de gallinas camperas, separados", "Leche entera 250ml / 8floz", "200 g / 7 oz de arándanos frescos", "1 x 400g / 7oz de rebanadas de durazno en almíbar, escurridas", "Arándanos 200g / 7oz", "1 x 400g / 7oz de rebanadas de durazno en almíbar, escurridas", "Azúcar en polvo de 65 g / 2½ oz", "1½ cucharada de harina común", "1½ cucharadita de jugo de limón"], "method": ["Para la cobertura de crumble, coloque todos los ingredientes de la migaja en un tazón grande. Frote la mantequilla en la harina hasta que la mezcla se asemeje a pan rallado. Dejar de lado.", "Para la torta precalentar el horno a 180 ° C / 350 ° F / Gas 4. Engrasar una fuente para hornear de 23 cm x 30 cm / 9 pulgadas x 12 pulgadas con un poco de mantequilla", "Tamiza la harina en un tazón y agrega los azúcares. Frote la mantequilla en la mezcla de harina hasta que se asemeje a pan rallado. Agregue el polvo de hornear, la sal, las yemas de huevo y la leche y revuelva hasta que estén bien combinados.", "Batir las claras de huevo en un bol hasta que se formen picos suaves cuando se quite el batidor. Dobla las claras de huevo en la mezcla de pastel.", "Con una cuchara, coloca la masa para pastel en la fuente para hornear y espolvorea sobre los arándanos y las rodajas de melocotón.", "Espolvoree más de la mitad de la cobertura de la migaja y hornee por 40-50 minutos, o hasta que se dore por arriba y una brocheta insertada en el centro salga limpia. Retire la torta del horno y déjela enfriar por 10 minutos.", "Mientras tanto, para la mermelada, caliente los duraznos y el jugo de la lata, los arándanos, el azúcar, la harina y el jugo en una cacerola a fuego medio hasta que hierva. Reduzca el fuego y cocine a fuego lento durante 8-10 minutos, o hasta que la mezcla esté espesa y atascada. Retire la sartén del fuego.", "Extienda la mermelada sobre la torta y espolvoree sobre la cobertura de crumble restante.", "Regrese la torta al horno y hornee durante 8-10 minutos más, o hasta que la cobertura esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_peach_and_blueberry_06916", "title": "Pastel de streusel de durazno y arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "250g / 9oz de mantequilla sin sal, refrigerada", "50 g / 1 oz de azúcar en polvo", "1 huevo mediano de granja, batido para esmaltar", "110g / 4oz de mantequilla sin sal", "4 cucharadas de jugo de limón (aproximadamente 4 limones grandes)", "175g / 6oz de azúcar en polvo", "2 huevos grandes de gallinas camperas", "1 cucharada de harina de maíz", "2 cucharadas de hojas de tomillo limón recién picadas", "Crema doble 250ml / 9fl oz", "100g / 3½ oz de mascarpone", "2 cucharadas de jarabe de melocotón (de una lata de melocotones)", "200 g / 7 oz de azúcar en polvo", "1 melocotón maduro (o 2 mitades de melocotón de una lata), piedra eliminada", "50 g / 1¾oz de pistachos pelados, picados", "tomillo fresco de limón, para servir"], "method": ["Para la masa de hojaldre, bata la harina y 125 ml / 4 fl oz de agua helada en una batidora independiente hasta que quede suave. Forme un rectángulo, envuélvalo en una película adhesiva y colóquelo en el congelador por 10 minutos. Coloque la mantequilla entre dos pedazos de papel resistente a las grasas y use un rodillo para aplanarlo en un rectángulo. Enfriar en la nevera durante 10 minutos.", "Una vez que la masa ha descansado, extiéndala sobre una superficie de trabajo ligeramente enharinada para hacer un rectángulo más grande (aproximadamente 2.5 cm / 1 pulgada de grosor y el doble del tamaño de la mantequilla). Retire la mantequilla del papel resistente a la grasa y colóquela en la mitad superior de la masa. Dobla la masa restante sobre ella y presiona para sellar. Gire la masa para que el borde corto quede más cerca de usted. Enróllelo de nuevo para formar un rectángulo más largo, luego doble el tercio superior en el centro y doble el tercio inferior hacia arriba para cubrir. Repita este proceso de laminado y plegado una vez más y luego enfríe la masa en el congelador durante 15 minutos. Repita el proceso de laminación y plegado otras 2 veces.", "Para hacer la cuajada, caliente la mantequilla, el jugo de limón y la mitad del azúcar hasta que se derrita por completo. En un recipiente aparte, bata los huevos, el azúcar restante y la harina de maíz hasta que quede suave y luego vierta sobre el líquido caliente. Batir para combinar y luego volver a la sartén y calentar suavemente, revolviendo constantemente, hasta que espese. Agregue el tomillo, al gusto, y reserve para infundir durante 15 minutos antes de tamizar.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para los cuernos de pastelería, extienda la masa de hojaldre para formar un rectángulo grande de aproximadamente 2 mm de grosor. Corta tiras largas (de aproximadamente 2 cm / ¾ de ancho y 40 cm / 16 pulgadas de largo) y en espiral alrededor de los moldes de metal superponiendo ligeramente los bordes. Cepille con un poco de huevo batido y espolvoree con azúcar antes de colocar el lado de la costura sobre una bandeja para hornear. Cocine por 15-20 minutos hasta que la masa esté crujiente y dorada. Déjelo enfriar un poco, luego retírelo de los moldes y deje enfriar completamente en una rejilla.", "Para la crema de durazno, mezcle todos los ingredientes hasta que se formen picos suaves cuando se quita la batidora.", "Para las obleas de caramelo, caliente el azúcar con 2 cucharadas de agua hasta que el azúcar se disuelva y se convierta en caramelo. Vierta sobre una lámina de silicona y déjela a un lado para que se enfríe y fragüe.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Rompa el caramelo en trozos y colóquelo en un procesador de alimentos, rellene las migajas muy finas. Tamizar en un recipiente y luego extender en una capa uniforme sobre una hoja de silicona. Coloque en el horno durante 2 minutos, o hasta que se derrita. Deje que se enfríe durante 1 minuto, luego corte en obleas con un cuchillo afilado.", "Para ensamblar los cuernos de la crema, coloque los cuernos de los pasteles en las tazas para ayudarlos a pararse en la punta. Picar la mitad del melocotón en trozos pequeños y dividir entre los 12 cuernos. Agregue una cucharada de cuajada de limón y espolvoree la mitad de las nueces de pistacho picadas en la parte superior. Usando una bola de helado, agregue la crema de melocotón (para crear una cúpula en la parte superior como lo haría en un helado). Agregue una oblea de caramelo. Corta finamente la mitad restante de melocotón. Decora los cuernos con unas rodajas de melocotón. Termine con una ramita de tomillo de limón y el resto de pistachos picados. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_peach_and_lemon_thyme_35829", "title": "Melocotón y cuernos de crema de tomillo limón", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 cuernos de crema", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["568ml / 1 pinta de crema doble", "1 vaina de vainilla, dividida longitudinalmente", "6 yemas de huevo", "150 g / 5½ oz de azúcar en polvo", "2 cucharadas de licor de amaretto", "250 g / 9 oz de azúcar en polvo", "Almendras molidas 250 g / 9 oz", "1 huevo, solo blanco, ligeramente batido", "¼ cucharadita de extracto de almendra", "200 g / 7 oz de azúcar en polvo", "Almendras blanqueadas 150 g / 5½ oz", "Harina normal de 250g / 9oz, más extra para espolvorear", "250 g / 9 oz de mantequilla fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4fl oz de agua helada", "1 huevo, golpeado", "4 melocotones, apedreado y en rodajas muy finas", "75 g / 2½ oz de mantequilla", "Azúcar en polvo de 55 g / 2 oz", "4 cucharadas de mermelada de albaricoque", "4 ramitas de menta fresca, para decorar"], "method": ["Primero haz el helado. Coloque la crema y la vaina de vainilla y las semillas en una cacerola grande y caliéntelas suavemente hasta que empiecen a hervir a fuego lento.", "Mientras tanto, bata las yemas de huevo con el azúcar en un tazón grande hasta que estén gruesas y pálidas. Lentamente agregue la crema caliente, batiendo continuamente.", "Vierte la crema en la sartén y agrega el amaretto. Cocine a fuego lento hasta que espese lo suficiente como para cubrir la parte posterior de una cuchara. Tenga cuidado de no dejar que se caliente demasiado o se puede dividir.", "Deje que se enfríe completamente. Revuelva en una máquina de helados de acuerdo con las instrucciones del fabricante hasta que espese. Transfiera a un recipiente hermético y congele.", "Para el mazapán, calienta suavemente el azúcar y 5 cucharadas de agua juntas en una cacerola hasta que el azúcar se disuelva. Ponga a hervir el almíbar y luego caliente hasta que alcance 100C / 220F (use un termómetro de azúcar para medir esto). Cuando una gota del jarabe se coloca en agua fría para enfriar, debe formar una bola suave.", "Mezcle las almendras, la clara de huevo y el extracto de almendra en un bol. Vierta sobre el jarabe y mezcle vigorosamente hasta que forme una pasta espesa. Cubra, deje enfriar a temperatura ambiente y luego enfríe en el refrigerador durante 1-2 horas, o hasta que esté firme.", "Para el praliné, derrita el azúcar en una sartén a fuego medio, sin remover, hasta que se forme un caramelo dorado. Retire del fuego y agregue las almendras. Vierta el praliné en una hoja grande de papel para hornear y déjelo a un lado para que se enfríe y se endurezca.", "Para hacer la masa, incline la harina sobre una superficie de trabajo y haga un pozo en el centro. Ponga la mantequilla y la sal en el pozo, luego frótelas en la harina con las puntas de los dedos de una mano, dibujando gradualmente la harina en el centro con la otra mano. Cuando la mezcla esté granulada, mezcle gradualmente con agua helada. No trabajes demasiado la masa. Deberías tener un efecto marmoleado sin mezclar la mantequilla por completo. Enróllalo en una bola, envuélvelo en film transparente y refrigéralo durante 20 minutos.", "Polvore la superficie de trabajo con harina y enrolle los pasteles en un rectángulo de 40x20cm / 16x8 pulgadas. Doble el tercio superior hacia el centro, luego el tercero inferior hacia arriba y sobre él. Dale a la masa un cuarto de vuelta. Repita el plegado y el laminado, luego envuelva el bloque en film transparente y refrigere por 30 minutos.", "Repita el proceso de doblar, girar y rodar dos veces más, luego envuelva la masa en film transparente y refrigere durante al menos 30 minutos antes de usar.", "Precaliente el horno a 210C / 190C Ventilador / Gas 7. Cubra una bandeja para hornear con papel de hornear. Polvore la superficie de trabajo con harina y enrolle la masa finamente. Recorta cuatro círculos de 12cm / 4½ pulgadas de diámetro y colócalos sobre la bandeja de hornear. Dejando un espacio de aproximadamente un centímetro alrededor del borde, marque ligeramente los puntos medios de cada círculo de masa, formando una cuadrícula de líneas. Esto evitará que la pastelería se hinche demasiado en el medio. Cepille cada círculo con el huevo batido.", "Ruede el mazapán a 5 mm / ¼ de grosor. Recorta cuatro círculos de 11cm / 4 pulgadas de diámetro y coloca cada círculo encima de un círculo de repostería. Coloque los melocotones, superpuestos en círculos concéntricos, en los círculos de mazapán.", "Derrita la mantequilla en una cacerola, luego cepille sobre los melocotones. Espolvorea con el azúcar restante. Hornea de 15 a 18 minutos o hasta que la masa esté dorada.", "Mientras tanto, mezcle la mermelada de albaricoque y 1 cucharada de agua en una cacerola y caliente hasta que se derrita. Pasar a través de un tamiz fino en un recipiente. Cepille esta mezcla sobre las tartas.", "Sirva las tartas con quenelle de helado en la parte superior y una pizca de almendra rota almendrada, adornada con la menta."], "url": "www_bbc_co_uk_food_recipes_peach_and_marzipan_tarts_07241", "title": "Tartas de melocotón y mazapán con helado de amaretto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz (alrededor de 5) melocotones frescos", "250g / 9oz de manzanas Bramley", "50ml / 2fl oz de jarabe de arce", "400g / 14oz granulado o azúcar en polvo", "1 limón pequeño, solo jugo"], "method": ["Ponga a hervir una olla con agua y, con un cuchillo afilado, puntúe los melocotones alrededor de la ranura que va desde el tallo hasta la punta, luego otra vez en ángulo recto para que la piel quede marcada en cuartos. Coloque los melocotones en el agua hirviendo durante un minuto, luego retire y despegue la piel. Pica toda la carne lejos de las pepitas y descarta la piel (reserva las pepitas).", "Pelar las manzanas y rallarlas, descartando el núcleo y las pepitas. Coloque la manzana rallada en una sartén con 300 ml / ½ litro de agua, deje que hierva y cocine durante 10 minutos o hasta que el agua casi se haya evaporado.", "Agregue la carne de melocotón y las piedras y cocine por otros 10-15 minutos, o hasta que las piezas de melocotón se deshagan y la mezcla esté espesa. Recoge las piedras con una cuchara y deséchalas.", "Agregue el jarabe de arce, el azúcar y el jugo de limón, lleve a ebullición y luego cocine hasta que la mezcla alcance 105C / 220C en un termómetro de azúcar. Revuelva con frecuencia para evitar que se enganche en el fondo.", "Deje que se enfríe durante unos minutos, póngalo en jarras calientes y limpias y selle de inmediato."], "url": "www_bbc_co_uk_food_recipes_peach_and_maple_syrup_31372", "title": "Mermelada de melocotón y jarabe de arce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde aproximadamente 600 ml / 20 fl oz (aproximadamente 2 jarras de mermelada)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 melocotones enteros", "50 g / 1¾oz de mantequilla sin sal", "75 g / 2½ oz de azúcar en polvo", "1 naranja, solo jugo", "Almendras en copos de 25g / 1oz", "25 g / 1 oz de pistachos, conchas eliminadas", "Frambuesas 100g / 3½ oz", "Helado de vainilla 300g / 10½oz", "25 g / 1 oz de pistachos, sin cáscara y picados", "Almendras en copos de 25g / 1oz, toscamente picadas"], "method": ["Para el Melocotón, el pistacho y el caramelo de almendras, precalentar el horno a 200ºC / 400F / Gas 6.", "Coloque los melocotones en una bandeja para hornear y use un soplete para ampollar los revestimientos (alternativamente colóquelos debajo de una parrilla caliente, volteándolos ocasionalmente). Déjelo a un lado hasta que esté lo suficientemente frío como para manipularlo, luego quite las pieles. Cortar por la mitad y quitar la piedra.", "Coloque los melocotones en una bandeja para hornear, con el lado del corte hacia arriba y la mantequilla en la parte superior. Asar durante 15-20 minutos, o hasta que estén blandos, pero manteniendo su forma.", "Calentar una sartén hasta que esté caliente, agregar el azúcar en polvo y derretir hasta que se forme un caramelo, agitando la sartén de vez en cuando. Agregue el jugo de naranja y agite para combinar. (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Manejar con mucho cuidado).", "Agregue las almendras copos, los pistachos y las frambuesas y caliéntelos durante dos minutos solamente; no desea que las frambuesas se descompongan.", "Para servir, coloque los melocotones cocidos en recipientes para servir poco profundos y vierta sobre la salsa. Sirva con helado de vainilla y espolvoree sobre las nueces."], "url": "www_bbc_co_uk_food_recipes_peach_melba_with_a_05968", "title": "Melba de melocotón con un caramelo de pistacho y almendra y helado de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]