[{"ingredients": ["Filete de solomillo de 100 g / 3½ oz, cortado en tiras", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 aguacate maduro, pelado y picado", "1 diente de ajo, triturado hasta formar una pasta", "1 cucharada de aceite de oliva", "½ lima, ralladura y jugo", "½ tomate de ternera, picado", "2 cucharadas de cilantro fresco picado", "2 envolturas de tortilla", "2 cucharadas de yogur al estilo griego"], "method": ["Sazone las tiras de carne con sal y pimienta negra recién molida. Calentar el aceite de oliva en una sartén, freír el bistec durante 1-2 minutos en ambos lados (por el medio), o hasta que esté cocido a su gusto. Retire de la sartén y deje reposar en un plato caliente.", "Para el guacamole, mezcle el aguacate y el ajo con un tenedor, y luego mezcle los ingredientes restantes de guacamole.", "Para servir, envuelva el bistec, el guacamole y el yogur en dos envoltorios de tortilla."], "url": "www_bbc_co_uk_food_recipes_fajitaswithguacamole_90524", "title": "Fajitas con guacamole", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g de garbanzos de lata, escurridos y enjuagados", "1 cebolla pequeña, más o menos picada", "2 dientes de ajo, picados", "½ cucharadita de cilantro molido", "½ cucharadita de comino molido", "½ cucharadita de canela molida", "½ cucharadita de sal marina en copos", "3 cucharadas de harina de gramo (garbanzo)", "racimo pequeño de hojas y tallos de cilantro, toscamente picados", "1 huevo pequeño de gallinas camperas", "100 g / 3½ oz de semillas de sésamo, para enrollar", "1 cucharada de aceite de oliva", "Fideos 100 g / 3½ oz", "1 cucharada de aceite de oliva", "1 diente de ajo, en rodajas finas", "pizca de copos de chile seco", "2 puñados de espinaca baby", "4 falafel cocido", "2 cucharadas de perejil fresco finamente picado", "½ limón, solo jugo", "3 falafel cocido", "1 pan pitta, cortado en triángulos delgados", "2 cucharadas de aceite de oliva", "sal marina", "½ lechuga Little Gem, en rodajas finas", "½ cebolla roja pequeña, finamente cortada", "exprimir jugo de limón", "1 cucharadita de yogurt natural, idealmente griego, para servir", "1 rebanada de masa madre", "2 falafel cocido", "1 huevo de gallinas camperas", "1 cucharadita de aceite de oliva", "pimentón pizca grande, para adornar"], "method": ["Para el falafel, incline los garbanzos, la cebolla, el ajo, las especias, la sal, la harina de gramo, el cilantro fresco y el huevo en un procesador de alimentos y pulse hasta que se mezcle, pero aún tenga algo de textura. Enrolla la mezcla en 12-15 bolitas y cúbrelas con semillas de sésamo. Refrigere por 30 minutos, o hasta que esté listo para usar. Para cocinar el falafel, caliente el aceite en una sartén hasta que esté medio caliente. Freír durante 10 minutos, volteando regularmente, hasta que estén dorados y cocidos.", "Para la pasta, hierva los tallarines siguiendo las instrucciones del paquete o hasta que estén al dente, luego drene bien. Mientras tanto, caliente el aceite en una sartén, agregue el ajo y el chile y cocine, revolviendo, durante 1 minuto. Agregue la espinaca y revuelva por 1 minuto o hasta que se marchite. Incline los tagliatelle y el perejil y caliente por unos segundos, revolviendo. Para servir, cubra con cuatro falafel cocido y exprima el jugo de limón.", "Para los pittas, precaliente el horno a 210C / 190C Ventilador / Gas 6. Coloque los triángulos Pitta en una bandeja para hornear, rocíe con 1 cucharada de aceite y espolvoree sal marina. Hornee durante 5-10 minutos, o hasta que estén crujientes. Mezcle la Pequeña Gema y la cebolla roja y viértala con el aceite restante y el jugo de limón. Sirve con cuatro falafel cocido y el yogur.", "Para la tostada del desayuno, tueste la masa fermentada y cubra con el falafel partido. Freír el huevo en el aceite a fuego alto y colocar encima de la tostada. Espolvorear sobre pimentón y servir."], "url": "www_bbc_co_uk_food_recipes_falafel_4_ways_22209", "title": "Falafel de tres maneras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/falafel_4_ways_22209_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal para engrasar", "1 frijoles de hojalata (240 g de peso escurrido)", "1 diente de ajo, pelado", "1 cebolla de primavera", "pequeño cilantro fresco", "1 cucharadita de comino seco", "1 cucharadita de harina común"], "method": ["Antes de cocinar, lávese las manos y colóquese un delantal. Pesar o medir todos los ingredientes. Cepille generosamente una bandeja para hornear con aceite vegetal. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 6.", "Comience colocando los frijoles drenados y el diente de ajo en la bolsa de plástico y machaque con el rodillo y luego transfiéralo a un recipiente.", "Pídale a un adulto que lo ayude a usar las tijeras para cortar las raíces y la parte superior verde oscura de las cebolletas. Esto se conoce como topping y tail. Cortar finamente el resto de la cebolla tierna y agregar a los frijoles. A continuación, corta el cilantro fresco finamente con las tijeras y agrégalo al puré de frijoles.", "Espolvorea sobre el comino seco, puedes agregar más si realmente te gusta el sabor. Espolvorea sobre la harina común y mezcla todo bien. Ahora exprime la mezcla con tus manos hasta que todo comience a pegarse.", "Divida la mezcla en cuatro porciones iguales y déle forma en sus manos en cuatro bolas; vuelva a apretarlas para que mantengan su forma. Coloque la bandeja para hornear engrasada y aplique un poco más de aceite en la parte superior.", "Pídale a un adulto que los ponga en el horno por 12-15 minutos. Deje que se enfríen durante unos cinco minutos para permitir que se fijen antes de comer. Sirva caliente o frío en bolsillos pitta con hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_falafel_footballs_41881", "title": "Balones de Falafel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 16 oz de garbanzos secos, empapados durante la noche", "3 dientes grandes de ajo, finamente picados", "¼ perejil fresco grande, solo hojas", "1 cebolla pequeña, finamente picada (aproximadamente el doble que la cantidad de ajo)", "2 papas medianas, hervidas hasta que estén tiernas, luego peladas", "sal y pimienta negra recién molida", "¼ cucharadita de bicarbonato de sodio, disuelto en un poco de agua fría", "copos de chile seco, al gusto", "1-2 cucharaditas de comino molido", "aceite de girasol, para freír", "3 cucharadas de tahini (pasta de sésamo)", "1 cucharada de agua o según sea necesario", "1-2 limones, solo jugo", "1 diente de ajo, finamente picado"], "method": ["Escurra, enjuague y seque empapado los garbanzos. Coloque los garbanzos en un procesador de alimentos con el ajo y el perejil y procese hasta que la mezcla esté picado. Agregue la cebolla y las papas y la sal y la pimienta negra recién molida al gusto y vuelva a mezclar. La mezcla debe retener algo de textura. Espolvorea la mezcla de bicarbonato y agua sobre la mezcla de garbanzos y déjala reposar durante aproximadamente 30 minutos. Espolvoree los copos de chile y el comino sobre la mezcla y mezcle ligeramente.", "Forme la mezcla en bolas, colóquela en una bandeja para hornear, cubra y refrigere durante aproximadamente media hora.", "Caliente aceite suficiente para freír poco profundo en una sartén profunda de fondo grueso. El aceite está listo cuando una migaja de pan que cae en él chisporrotea suavemente. (PRECAUCIÓN: el aceite caliente puede ser muy peligroso. No lo deje desatendido). Coloque con cuidado unas cuantas bolas de falafel en el aceite caliente y fríaselas durante uno o dos minutos, hasta que el exterior esté marrón y crujiente. Cocine las bolas de falafel en tandas, retirándolas con una cuchara con ranuras cuando estén cocidas y escurriendo en los paños de cocina.", "Para la salsa, coloca tres cucharadas de tahini en un plato hondo. Agregue agua una cucharadita a la vez, hasta que tenga una mezcla de consistencia de crema espesa (es posible que necesite un poco más o un poco menos de agua). Agregue el jugo de 1-2 limones, al gusto, y vuelva a mezclar. Si la mezcla se vuelve demasiado espesa, agregue un poco de agua. Agregue el ajo picado y vuelva a mezclar.", "Sirve los falafels con la salsa tahini."], "url": "www_bbc_co_uk_food_recipes_falafel_80242", "title": "Falafel", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Garbanzos 250 g / 9 oz, empapados durante la noche", "1 cebolla mediana, muy finamente picada", "2 dientes de ajo, triturados o finamente picados", "2 cucharaditas de comino molido", "2 cucharaditas de semillas de cilantro molido", "6 cucharadas de perejil picado", "½ cucharadita de chile en polvo", "2 cucharadas de harina integral", "1 cucharadita de sal", "Aceite para freír en grasa", "125g / 4½ oz de hummus", "2 cucharadas de aceite de oliva virgen extra", "1-2 cucharadas de jugo de limón", "1 cucharada de tahini", "4 rollos grandes (o bollos de hamburguesa)", "1 tomate graso, en rodajas", "1 cebolla roja en rodajas", "4 hojas de lechuga de mantequilla", "ensalada o papas fritas, o papas salteadas"], "method": ["Escurrir los garbanzos a fondo y pulsar en el procesador de alimentos hasta que se rompa ligeramente.", "Agregue los ingredientes restantes y continúe pulsando hasta que tenga la textura de pan rallado grueso. Suavemente formar en empanadas aprox. 10cm / 4in de diámetro por 2½cm / 1in. grueso.", "Freír en aceite caliente a 180 ° C / 350 ° F durante 4-5 minutos, o hasta que estén crujientes o dorados.", "Para la salsa de hummus y tahini simplemente mezcle todos los ingredientes. Si prefiere una salsa más ligera, agregue un poco de agua hasta que tenga la consistencia preferida.", "Para servir, divida y caliente los panecillos. Coloque en la parte superior de cada rollo una hoja de lechuga, una rodaja de tomate y algunas cebollas rojas.", "Coloque la hamburguesa de falafel en el lado inferior del rollo y parte de la salsa.", "O servir al lado del otro en un plato, o acumularse como una hamburguesa en un plato con su acompañamiento elegido.", "Cocine y refrigere o congele las hamburguesas sobrantes para un refrigerio rápido y fácil."], "url": "www_bbc_co_uk_food_recipes_falafelburgerwithhou_72037", "title": "Hamburguesa de falafel con hummus", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/falafelburgerwithhou_72037_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "85g / 3oz brócoli brotación púrpura, picado", "5 zanahorias baby, picadas", "1 diente de ajo, picado", "55g / 2oz de lentejas Puy", "300ml / ½ pinta de pollo caliente o caldo de verduras", "2 cucharadas de frijoles flageolet enlatados, enjuagados y escurridos", "1 tomate, picado", "2 cucharadas de perejil fresco picado", "3 cucharadas de lentejas Puy, cocidas", "1 cucharada de perejil fresco picado", "2 cucharadas de aceite de oliva", "½ cucharadita de mostaza Dijon", "dash vinagre de vino blanco", "sal y pimienta negra recién molida", "3 cucharadas de crema doble, batida"], "method": ["Para la sopa, caliente la mantequilla en una olla pequeña, agregue todos los ingredientes restantes de la sopa, excepto el tomate y el perejil, y cocine a fuego lento durante diez minutos o hasta que las lentejas estén cocidas.", "Agregue el tomate y el perejil y viértalo en un tazón.", "Para la crema de lentejas, coloque todos los ingredientes de crema de lentejas, excepto la crema en una mini licuadora y procese hasta que quede suave.", "En un recipiente, dobla la mezcla de lentejas en la crema batida. Coloque una cucharada de crema de lentejas encima de la sopa y sirva."], "url": "www_bbc_co_uk_food_recipes_farmhousevegetableso_88397", "title": "Sopa de verduras de la granja con crema de lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "Harina de levante 225g / 8oz", "1 cucharada de sal de mesa", "1 cucharadita de azúcar en polvo", "85g / 3oz de mantequilla ligeramente salada, más extra para servir", "85g / 3oz de manteca de cerdo"], "method": ["Para las galletas, precaliente el horno a 180C / 350F / Gas 4.", "En un tazón, mezcle los ingredientes secos. Frote la mantequilla y la manteca de cerdo para que la mezcla se asemeje a pan rallado fino.", "Agregue suficiente agua fría para unir la mezcla y formar una masa dura (alrededor de 5-6 cucharadas soperas). Refrigere por 15-20 minutos.", "En una superficie de trabajo ligeramente enharinada, extienda la masa a un grosor de menos de una moneda de £ 1.", "Con un cortador redondo de 9 cm / 3½ pulgadas, corte los bizcochos de la masa. Pinche la parte superior de los bizcochos para decorar, dejando un borde de 5 mm / ¼ pulgada alrededor del borde.", "Transfiera a bastidores de alambre o malla para hornear. Coloque los bastidores / malla en las bandejas para hornear y hornee durante 14-16 minutos, o hasta que los bizcochos estén secos pero no dorados. Dejar de lado para enfriar por completo.", "Sirve los bizcochos con mantequilla fría."], "url": "www_bbc_co_uk_food_recipes_farthing_biscuits_61473", "title": "Farthing galletas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace aprox. 18 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "Carne de salchicha de cerdo 450g / 1lb", "1 chile rojo, sin grano y finamente picado", "2 dientes de ajo grasos, aplastados", "150g / 5 oz champiñones, en rodajas", "1 x 200ml / 7fl oz cartón lleno de grasa cr`me frâiche", "Espinaca baby 100g / 4oz, más o menos picada", "sal y pimienta negra recién molida", "1 x 400 g / 1 libra puede cortar tomates", "2 cucharadas de pasta de tomate secada al sol", "1 cucharadita de azúcar demerara", "1 cucharada de hojas frescas de tomillo", "6 hojas, aproximadamente 75 g / 3 oz de lasaña blanca de cocción rápida o lasaña fresca", "50g / 2oz de queso cheddar fuerte, rallado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para la salsa de ragu y espinacas, caliente el aceite en una sartén antiadherente grande, agregue la carne de salchicha y dore a fuego alto hasta que se dore, rompiendo la carne con dos cucharas de madera.", "Agregue el chile, el ajo y los champiñones y fría por unos minutos. Agregue el créme frâiche y la espinaca.", "Llevar a ebullición por un par de minutos, sazonar bien y dejar de lado.", "Para la salsa de tomate, mida todos los ingredientes en una jarra y sazone bien.", "Divida la salsa de ragu en tres partes y coloque una tercera parte en la base de un plato resistente al horno.", "Coloque un tercio de la salsa de tomate encima y coloque la mitad de las hojas de pasta encima. Repita usando dos capas más de ragu y salsa de tomate y una de pasta.", "Espolvorea sobre el queso rallado.", "Coloque en el horno durante unos 20-30 minutos o hasta que se doren, burbujee alrededor de los bordes y la pasta esté tierna."], "url": "www_bbc_co_uk_food_recipes_fastlasagnewithporka_83462", "title": "Lasaña rápida con carne de cerdo y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5-6 tallos de ruibarbo", "buen batido de azúcar moreno claro", "masa de hojaldre congelada, lista para servir, congelada, descongelada", "1 cucharadita de mantequilla, para engrasar", "harina, para quitar el polvo", "2 huevos orgánicos grandes, separados", "2 cucharadas de azúcar en polvo sin refinar", "Tubo de mascarpone 250g / 9oz", "2-3 gotas de extracto de vainilla"], "method": ["Para el ruibarbo asado, precalentar el horno a 200C / 400F / Gas 6. Cortar el ruibarbo en 15cm / 6 pulgadas o menos (aproximadamente la longitud de una cuchara de madera con mango) y colocar en una lata de asar con media taza de té de agua y el azúcar moreno claro. Asar hasta que esté lo suficientemente suave como para tomar la punta de un cuchillo, alrededor de 10-15 minutos. Deje que se enfríe, luego drene, reservando los jugos de cocción.", "Para la tarta, precaliente el horno a 220C / 425F / Gas 7. Desenrolle la masa de hojaldre y, utilizando un rodillo, gírela nuevamente para hacer que la masa esté ligeramente más delgada. Corta la masa en tres rectángulos de igual tamaño. Con un cuchillo afilado, marque un borde de 1.5 cm / ½ pulgada alrededor de cada rectángulo, teniendo cuidado de no cortar la masa. Coloque los rectángulos de hojaldre en una bandeja para hornear ligeramente engrasada.", "Disponga 3-4 longitudes de ruibarbo drenado, en función del grosor de las mismas, en el centro de los rectángulos de masa y cepille un poco del jugo reservado del ruibarbo tostado alrededor de los bordes para dar brillo a la pastelería. Hornee durante 20 minutos, hasta que estén dorados y se hayan levantado.", "Mientras tanto, batir las yemas de huevo y el azúcar en un tazón durante unos segundos, hasta que estén bien mezclados. Batir el mascarpone hasta que tenga una crema de color crema. Agregue un poco de extracto de vainilla; un par de gotas deberían ser suficientes. Con un batidor limpio, bata la clara de huevo en un tazón limpio hasta que quede en picos rígidos, luego dobla en la mezcla de crema de mascarpone.", "Sirva la crema de mascarpone con las tartas calientes de ruibarbo. Cualquier crema de mascarpone restante se puede servir al día siguiente con bayas o se puede usar para cubrir los merengues servidos con fruta."], "url": "www_bbc_co_uk_food_recipes_fastrhubarbtartwithm_92278", "title": "Tarta de ruibarbo con crema de mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fastrhubarbtartwithm_92278_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos grandes", "300g / 10 oz de harina de auto crianza", "Azúcar granulada 150g / 5oz (el lanzador está bien, pero cambia ligeramente la consistencia de la esponja)", "100ml / 3fl de leche en oz", "1 cucharada de aceite de girasol", "50g / 2oz de mantequilla", "azúcar glas, al gusto", "3 manzanas peladas, picadas", "1 gill advocaat, o al gusto (opcional)", "crema doble ligeramente batida, para servir"], "method": ["Batir los huevos en un tazón grande para mezclar, luego agregar la harina, el azúcar y la leche y batir hasta que quede suave. La masa debe ser lo suficientemente espesa como para dejar caer la cuchara lentamente.", "Caliente un poco de aceite de girasol en una plancha o una sartén grande de fondo grueso a fuego medio. Vierta la mezcla en cucharadas grandes para que cada tortita deje suficiente espacio para que se expandan.", "Los panqueques están listos para girar cuando las burbujas suben a la superficie y se rompen, como los agujeros en un bollo. Ajuste el calor para evitar que se oscurezcan demasiado. Voltee los panqueques y cocine durante unos dos minutos. Si está haciendo un lote grande, se mantienen calientes solo durante unos 15 minutos.", "Para las manzanas holandesas fritas, caliente la mantequilla en una cacerola pequeña a fuego medio. Si sus manzanas son muy agrias, agregue un poco de azúcar glasé a la mantequilla y cocínelas hasta que se derrita el azúcar.", "Agregue la manzana picada y cocine, revolviendo ocasionalmente, hasta que esté tierno y dorado. Verter por la mitad de la defensa (si se usa) y dejar que burbujee hacia abajo y reducir a una capa escasa.", "Sirva los panqueques cubiertos con las manzanas, el azúcar glas y una cucharada de crema batida."], "url": "www_bbc_co_uk_food_recipes_fat_pancakes_with_dutch_05905", "title": "Panqueques con grasa y manzanas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace alrededor de 15 panqueques", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fat_pancakes_with_dutch_05905_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5½ oz", "150g / 5½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear", "150 g / 5½ oz de mantequilla", "150g / 5½oz de fruta seca mixta", "100 g / 3½ oz de azúcar en polvo", "1 cucharadita de canela en polvo", "½ cucharadita de nuez moscada rallada", "1 naranja, solo ralladura", "1 limón, ralladura solamente", "1 yema de huevo de gallinas camperas", "aproximadamente 50 ml / 2 fl oz de leche", "1 huevo de gallinas camperas, solo yema", "pizca de sal", "1 cucharada de agua", "copos de almendras y cerezas glaseadas, para decorar"], "method": ["Precalentar el horno a 200C / 400F / Gas6. Engrase una bandeja para hornear.", "Tamiza las harinas y el polvo de hornear en un tazón grande y frota la mantequilla hasta que la mezcla se asemeje a pan rallado.", "Agregue la mezcla de frutas secas, azúcar, especias, naranja y zumos de limón.", "Batir ligeramente la yema de huevo y agregarla a la mezcla con suficiente leche para hacer una masa dura (es posible que no necesite toda la leche). Divide la masa en 12, dale forma a los montículos y colócala en la bandeja para hornear.", "Para el glaseado, mezcle la yema de huevo, la sal y el agua y cepille la mezcla sobre cada bribón. Decorar con las almendras y las cerezas glaseadas y hornear durante 15-20 minutos o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_fat_rascals_68150", "title": "Bribones gordos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 patata, cortada en trozos gruesos", "2 cucharadas de aceite de oliva", "½ cucharadita de pimentón", "sal y pimienta negra recién molida", "Crema doble de 200 ml / 7 fl oz", "Queso cheddar rojo 250 g / 9 oz", "1 cucharada de mostaza en polvo", "½ cucharadita de comino molido"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las papas fritas en una bandeja para hornear. Rocíe con el aceite de oliva y espolvoree con el pimentón. Sazonar con sal y pimienta negra recién molida.", "Coloque en el horno precalentado y cocine por 15 minutos.", "Para la fondue", "Caliente la crema doble en una cacerola. Agregue el queso, la mostaza y el comino y cocine hasta que el queso se derrita.", "Sirve la fondue con las papas fritas."], "url": "www_bbc_co_uk_food_recipes_fatchipswithcheesefo_77711", "title": "Chips de grasa con fondue de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 fl oz / 275 ml leche - esto puede infundirse pero debe ser frío", "Salsa de ¾oz / 20g / harina natural", "sal y pimienta negra recién molida"], "method": ["Todo lo que hace para preparar esta salsa es colocar la leche en una cacerola pequeña, simplemente agregar la harina de salsa y, a fuego medio, llevar todo gradualmente al punto de cocción lenta, batiendo vigorosamente y continuamente con un batidor de globo hasta que la salsa se espese a una cremosidad suave y rica. Luego agregue el condimento y permita que se cocine muy suavemente durante minutos con el menor calor posible."], "url": "www_bbc_co_uk_food_recipes_fatlesswhitesauce_70005", "title": "Salsa blanca sin grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10 fl oz / 275 ml", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5¼ oz de harina común", "150g / 5¼ oz de harina de auto crianza", "1 cucharadita de polvo de hornear", "65 g / 2¼ oz de manteca de cerdo, cortada en cubitos", "65g / 2¼oz de mantequilla sin sal, cortada en cubitos", "90g / 3¼ oz de azúcar en polvo", "1 naranja, solo ralladura", "1 limón, ralladura solamente", "1 cucharadita de canela molida", "½ cucharadita de nuez moscada recién rallada", "50g / 1¾oz pasas de Corinto", "50 g / 1oz de pasas", "50g / 1¾oz sultanas", "50ml / 1¾fl oz de crema doble", "2 huevos de gallinas camperas, golpeados", "50 g / 1 oz de cerezas congeladas", "50g / 1¾oz de almendras blanqueadas", "100g / 3½oz de crema cuajada", "Mermelada de fresa de 70 g / 2½ oz", "50 g / 1¾oz de mantequilla sin sal"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja de hornear con papel resistente a la grasa.", "Tamiza las harinas en un bol y agrega el polvo de hornear.", "Agregue la manteca y la mantequilla en cubitos y frote en la harina con los dedos hasta que la mezcla se asemeje a migajas de pan finas.", "Agregue el azúcar, la ralladura de naranja, la ralladura de limón, la canela, la nuez moscada y la fruta seca y mezcle hasta que estén bien combinados.", "Agregue la crema y la mitad del huevo batido hasta que las mezclas se unan como una masa. Corta la masa en seis trozos, dale forma a rondas grandes, 2 cm / 1 pulgada de profundidad y colócalos en la bandeja de hornear preparada.", "Cepille el huevo batido restante sobre los \"bribones\" y cubra con las cerezas glaseadas y las almendras blanqueadas.", "Hornee en el horno por 15-20 minutos, o hasta que estén doradas. Retire del horno y deje a un lado para que se enfríe un poco.", "Sirva caliente con la crema coagulada, mermelada y mantequilla."], "url": "www_bbc_co_uk_food_recipes_fatrascals_93997", "title": "Bribones gordos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fatrascals_93997_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½ fl oz de aceite de oliva", "1 limón, jugo y ralladura", "½ diente de ajo, aplastado", "2 cucharadas de zumaque (una especia de tierra de sabor ácido, disponible en delicatessen de Oriente Medio)", "sal y pimienta negra recién molida", "1 pan pitta, desgarrado en trozos pequeños", "8 tomates de ciruela, sin semillas, descuartizados", "medio pepino, pelado, cortado en bastones de 5cm / 2pulgadas", "medio pimiento verde, cortado en tiras", "8 rábanos, en rodajas", "1 chalota, en rodajas", "pequeñas hojas de cohetes puñado", "1 pequeña lechuga pequeña gema", "puñado de hojas de menta fresca"], "method": ["Para el aderezo, coloque el aceite de oliva, el jugo de limón y la ralladura, el ajo molido y el zumaque en un tazón y agítelos para combinarlos. Sazonar, al gusto, con sal y pimienta negra recién molida. (No necesitará todo el aderezo para esta receta, por lo tanto, deje el resto a un lado en la nevera durante hasta una semana).", "Para la ensalada, coloca los pitta, tomates, pepinos, pimientos, rábanos, chalotes, hojas de rúcula, hojas de lechuga Little Gem y hojas de menta en un tazón grande y sazónalos, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta el aderezo, al gusto, sobre la ensalada y mezcle suavemente para cubrir la ensalada de manera uniforme."], "url": "www_bbc_co_uk_food_recipes_fattoush_86811", "title": "Fattoush", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fattoush_86811_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite vegetal", "2 panes pitta, cortados en cuadrados", "2 tomates grandes de vid, cortados en trozos grandes", "½ pepino, cortado en trozos grandes", "1 lechuga Little Gem, hojas separadas y rotas", "2 ramitas de menta fresca, hojas recogidas y finamente picadas", "gran puñado de perejil fresco, finamente picado", "10-12 aceitunas negras, picadas", "½ granada, solo semillas", "sal y pimienta negra recién molida", "1 limón, solo jugo", "2-3 cucharadas de aceite de oliva virgen extra", "2 cucharadas de melaza de granada", "1 tsc sumac, más extra para decorar"], "method": ["Caliente el aceite vegetal en una freidora hasta que alcance los 170 ° C, o un cubo de pan en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Fríe el pan de pita por 2-3 minutos o hasta que se dore. Escurrir sobre papel de cocina y espolvorear con sal marina.", "Para hacer el aderezo, mezcle los ingredientes en una jarra pequeña. Condimentar con sal y pimienta.", "Para hacer la ensalada, coloque los tomates, la lechuga de pepino, las hierbas y las aceitunas en un tazón grande. Vierta sobre el aderezo y mezcle bien.", "Esparce con pitta frito, semillas de granada y una pizca de zumaque antes de servir."], "url": "www_bbc_co_uk_food_recipes_fattoush_salad_02182", "title": "Ensalada de Fattoush", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "100 g / 4 oz de mantequilla", "150 g / 5 oz de azúcar en polvo", "Plátanos Fairtrade de 450 g / 1 lb (cuanto más suave mejor), pelados y triturados", "½ cucharadita de sal", "2 huevos", "175g / 6oz de fruta seca mixta"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Mezcle todos los ingredientes excepto la fruta seca. Puede hacerlo en un procesador de alimentos o a mano en un recipiente para mezclar.", "Cuando los ingredientes estén completamente combinados, dobla la fruta seca.", "Con una cuchara, mezcle la masa en una lata de pan antiadherente de 1 kg / 2 libras, extiéndala de manera uniforme y hornee durante una hora y media.", "Cuando el pan de plátano se haya levantado, dorado por encima y cocido, sáquelo del horno y déjelo enfriar en una rejilla de alambre. Rebana antes de servir."], "url": "www_bbc_co_uk_food_recipes_fairtradebananabread_72082", "title": "Pan de banano Fairtrade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pepinos pequeños", "450g / 1lb de tomates cherry, descuartizados", "200g / 7oz de rábanos, descuartizados", "1 pequeña lechuga gema bebé, más o menos picada", "4 cebolletas, más o menos picadas", "50g / 1¾oz flatleaf hojas de perejil", "10g / ⅓oz de hojas pequeñas de menta", "9 cucharadas de aceite de oliva", "1 pan pitta", "2 cucharadas de melaza de granada", "1 cucharada de zumaque", "12 aceitunas verdes empedradas", "25 g / 1 oz de perejil de flatillo finamente picado", "100ml / 3½fl oz de aceite de oliva", "½ limón, solo jugo"], "method": ["Pele, corte a la mitad y quite las semillas de los pepinos. Córtalos en medias lunas y colócalos en un tazón grande.", "Agregue los tomates, los rábanos y la lechuga. Esparce sobre las cebolletas y raspa el perejil y las hojas de menta.", "Calienta 5 cucharadas de aceite de oliva en una sartén y freír todo el pan pitta hasta que estén crujientes y doradas. Escurrir sobre papel de cocina y dejar enfriar.", "Divida el pan en trozos del tamaño de un bocado.", "Para hacer la pasta de aceituna, mezcle las aceitunas con el perejil, el aceite de oliva y el jugo de limón, luego distribuya la pasta sobre los trozos de pan.", "Viste la ensalada con la melaza de granada, el aceite de oliva restante y el zumaque. Mezcle bien con sus manos.", "Sirve la ensalada con trozos de pan de oliva."], "url": "www_bbc_co_uk_food_recipes_fattoush_with_crisp_53560", "title": "Fattoush con pan plano de oliva crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fattoush_with_crisp_53560_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo, aproximadamente picado", "1 cucharadita de semillas de hinojo, molido", "½ cucharadita de hojuelas de chile rojo seco", "1½ bulbos de hinojo grandes, finamente picados, frondas guardadas para decorar", "140g / 5oz de parmesano, finamente rallado", "1 cebolla grande, finamente rebanada", "Arroz arborio 280g / 10oz", "250ml / 9fl oz de vino blanco seco", "700ml-1 litro / 1¼-1¾ pintas de caldo de pollo caliente", "1 limón no encerado, ralladura fina y jugo", "sal y pimienta negra recién molida", "250ml / 9fl oz de agua de soda, helada", "1 huevo grande de gallinas camperas", "buena pizca de cayena", "1 cucharadita de polvo de hornear", "2 cucharadas de harina de maíz", "Harina normal de 100 g / 3½ oz", "1 litro / 1¾ pintas de aceite vegetal", "½ bulbo de hinojo grande, cortado en cuñas delgadas"], "method": ["Para hacer el risotto, caliente 1 cucharada de aceite en una cacerola grande de fondo grueso a fuego medio. Saltee el ajo, las semillas de hinojo y las hojuelas de chile durante 1-2 minutos. Agregue el hinojo finamente picado y cocine durante 15-20 minutos, o hasta que se ablanden.", "Mientras tanto, precalentar la parrilla a fuego medio-alto. Con la mitad del parmesano, esparza pilas de queso sobre una lámina de silicio y ase a la parrilla hasta que se derrita y se dore. Si el queso se extiende demasiado, se quemará. Retirar y dejar enfriar antes de romper en pedazos.", "Caliente el 1 cucharada restante de aceite en una sartén grande a fuego medio y cocine la cebolla hasta que se ablande. Agregue el arroz y cocine durante 1-2 minutos. Vierta el vino y deje que burbujee hasta que todo el líquido se haya ido. Agregue el caldo, cucharón por cucharón, revolviendo y cocinando cada cucharón hasta que haya sido absorbido antes de agregar más. Continúe agregando el caldo y cocinando de esta manera hasta que el arroz esté tierno pero aún cremoso (aproximadamente de 25 a 30 minutos).", "Agregue el hinojo cocido restante, la ralladura de limón y el zumo, y suficiente condimento. Agregue el parmesano restante, cubra y retire del fuego mientras hace los buñuelos.", "Para hacer los buñuelos, bata juntos el agua de soda y el huevo en un tazón. Coloque el recipiente en un recipiente más grande lleno de hielo (esto mantendrá la mezcla lo más fría posible). Mezcle lentamente la pimienta de cayena, el polvo de hornear, la harina de maíz y la harina común.", "Caliente el aceite en una cacerola profunda hasta que alcance los 180 ° C, o un cubo de pan marrones en 20 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja las rodajas de hinojo en la mezcla y fríelas durante 1-2 minutos o hasta que estén doradas. Escurrir sobre papel de cocina.", "Adorne el risotto con las hojas de hinojo y las patatas fritas de parmesano y sirva con los buñuelos de hinojo."], "url": "www_bbc_co_uk_food_recipes_fennel_and_lemon_risotto_28159", "title": "Risotto de hinojo y limón, patatas fritas de parmesano y buñuelos de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_and_lemon_risotto_28159_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 bulbos grandes de hinojo, en jugo", "5g de ácido ascórbico, también conocido como polvo de vitamina C, disponible en tiendas de alimentos saludables y en línea", "50g / 1¾oz de azúcar", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "Jugo de hinojo filtrado 320ml / 11fl oz (desde arriba)", "18g / ½ oz de polvo de albúmina", "1 hoja de gelatina, empapada en agua fría", "2 cucharaditas de Pernod", "5g de polen de hinojo, disponible en línea (opcional)", "3 lanzas de espárragos blancos, pelados y en rodajas", "3 lanzas de espárragos verdes, en rodajas", "poco aceite de oliva", "jugo de limón, al gusto", "½ bulbo de hinojo, rallado", "1 cucharada de estragón fresco picado", "sal y pimienta negra recién molida", "3 lanzas de espárragos verdes, pelados", "60 g / 2¼ oz de mantequilla", "½ limón, solo jugo", "2 cucharadas de caldo de carne", "manojo de berros"], "method": ["Para el jugo de hinojo, mezcle todos los ingredientes.", "Para la nube de hinojo, alinee un plato a prueba de congelación con papel de hornear. Disuelva el azúcar impalpable y 100 ml / 3½ fl oz de agua en una sartén, quite el fuego y derrita la hoja de gelatina en ella.", "Batir el jugo de hinojo y la albúmina a mano, luego agregar a un mezclador con un accesorio batidor. Batir en la máquina a baja velocidad, y cada vez más rápido. Cuando casi se ha triplicado en volumen, reduzca la velocidad de la máquina y agregue la solución de azúcar, gelatina y agua. Batir en alto hasta que se formen picos rígidos cuando se quite la batidora.", "Vierta el Pernod, bata y vierta la nube de hinojo en el plato preparado. Extienda la nube y espolvoree con el polen de hinojo, si se usa. Ponlo en el congelador por 6 horas o hasta que se congele.", "Para el alquitrán de alquitrán, mezcle los espárragos picados y sazone con sal y pimienta. Agregue un poco de aceite de oliva y jugo de limón. Mezcle el hinojo, agregue el estragón y reserve.", "Para los espárragos verdes, en una sartén caliente, agregue la mantequilla y los espárragos. Freír hasta que los espárragos estén casi cocidos y luego exprimir un poco de jugo de limón y el caldo de carne. Cocine por otros 2 minutos.", "Con una cuchara, coloca los espárragos verdes a un lado de un plato para servir y coloca la cucharada de alquitrán en el otro lado. Con una cuchara, coloca la nube sobre el alquitrán y adorna con el berro. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fennel_and_asparagus_27366", "title": "Hinojo y espárragos 'tar-tar' con una nube de hinojo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]