[{"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla picada", "1 pimiento verde, picado", "1 guindilla seca entera", "1 cabeza entera de ajo cortada a la mitad en el medio", "1 manojo de cilantro picado", "1 pequeña mejorana puñado, picado", "100 g / 3½ oz de tocino ahumado, o pavo ahumado", "500g / 1lb 2oz de frijoles negros secos, empapados durante la noche", "1 cubo de caldo de pollo", "2 pizcas grandes de sal marina y pimienta negra recién molida", "cilantro y mejorana, picado, para servir"], "method": ["Caliente el aceite de oliva en una olla grande de fondo grueso. Agregue la cebolla, el pimiento, el chile, el ajo, las hierbas y el tocino o el pavo y cocínelos hasta que la cebolla y el pimiento se ablanden, aproximadamente de 5 a 10 minutos.", "Agregue los frijoles negros, revuelva en el cubo de reserva y agregue suficiente agua para cubrir. Reduzca el fuego y cocine a fuego lento durante 2-3 horas.", "Cuando los frijoles tienen una consistencia parecida a la de un guiso, están listos. Sazone al gusto con sal marina y pimienta negra recién molida. Retire las ramas de hierbas y el trozo de tocino, antes de servir. Para servir, decorar con cilantro picado y mejorana."], "url": "www_bbc_co_uk_food_recipes_blackbeans_86387", "title": "Frijoles negros Herby", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla roja, finamente picada", "¼ de pimiento rojo, finamente picado", "1 cucharada de cilantro picado", "½ lima, solo jugo", "½ estaño, frijoles de ojos negros, enjuagados y escurridos", "½ cucharadita de copos de chile"], "method": ["Mezcle todos los ingredientes y sirva."], "url": "www_bbc_co_uk_food_recipes_blackbeansalsa_80910", "title": "Salsa de judías negras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de fideos secos de fideos", "8 vieiras, eliminadas de las conchas, sin barba y coral eliminado, conchas limpiadas y reservadas", "6 dientes de ajo, finamente picados", "Jengibre fresco de raíz de 2.5cm / 1in, pelado, finamente picado", "1 chile rojo, sin semillas, finamente picado", "1 cucharada de frijoles negros salados fermentados, lavados y triturados en una pasta (disponible en supermercados asiáticos)", "1 cucharada de vino de arroz Shaoxing o jerez seco", "2 cucharadas de salsa de soja ligera", "3 cucharadas de agua", "2 cucharadas de cebolletas frescas o cebolla tiernamente picadas"], "method": ["Para las vieiras con fideos, remoje los fideos secos en un recipiente con agua recién hervida durante 5-6 minutos, o hasta que estén tiernos. Drene bien, luego corte en trozos de 10cm / 4 pulgadas y reserve.", "Coloque las vieiras limpias nuevamente dentro de sus caparazones.", "Para la salsa de frijoles negros, mezcle todos los ingredientes de la salsa en un tazón. Coloque una cucharadita de salsa en la parte superior de cada vieiras y frote suavemente en la carne de vieira.", "Envuelva algunos de los fideos de fideos suaves alrededor de cada vieiras, luego coloque una cucharadita de agua alrededor de los fideos. (Esto ayuda a mantener los fideos húmedos y funciona para crear una salsa cuando se combina con los jugos al vapor de las vieiras).", "Divida las conchas de vieiras entre dos platos de servir a prueba de calor y coloque cada plato en un vaporizador de bambú, colocando un vaporizador encima del otro. Coloque los recipientes sobre una sartén o wok de agua hirviendo (asegurándose de que el agua no toque la base del vaporizador), cubra y cocine a fuego fuerte durante 4-5 minutos, o hasta que las vieiras estén cocidas. Si no tiene un barco de vapor de bambú, coloque las cáscaras en un plato grande a prueba de calor en un estante en una bandeja de asar. Llene la bandeja de asar con agua hirviendo del hervidor. Precaliente el horno a 180 ° C / 350 ° F / Gas 4, cubra toda la bandeja de asar con papel de aluminio y colóquelo en el horno a vapor durante 4-5 minutos.", "Para servir, sirva las vieiras en los vapores de bambú, o quite las placas del vapor y sirva en los platos. Espolvoree sobre cebolletas picadas o cebollas tiernas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_blackbeansteamedscal_89273", "title": "Alubias al vapor de frijol negro con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackbeansteamedscal_89273_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 g / 10½oz de bayas mixtas congeladas", "1 manzana, sin corazón y en rodajas", "Leche semidesnatada 200ml / 7floz", "150g / 5½oz de yogur natural sin grasa", "Avena de avena 25 g / 1 oz, con fibra extra", "Almendras en copos de 10 g / ¼ oz"], "method": ["Coloque las bayas, la manzana, la leche, el yogur, la avena y las nueces en una licuadora y mezcle hasta que quede suave.", "Agregue 75-100 ml / 2½-3½floz de agua fría, poco a poco, para lograr una consistencia suave y mezclar nuevamente.", "Vierta las copas y sirva."], "url": "www_bbc_co_uk_food_recipes_blackberry_and_apple_39192", "title": "Blackberry y manzana crumble batido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackberry_and_apple_39192_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla sin sal", "375 g / 13 oz de azúcar en polvo", "4 huevos de gallinas camperas", "1 cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de soda", "Harina simple de 450g / 1lb", "pizca de sal", "450ml / 16fl oz de crema agria", "4 manzanas, peladas y picadas", "aceite vegetal, para engrasar", "4 claras de huevo de gallinas camperas", "pizca de sal", "175 g / 6 oz de azúcar en polvo, más extra para espolvorear", "½ cucharadita de jugo de limón", "75g / 2¾oz de avellanas tostadas, picadas", "pellizcar canela molida", "400 ml / 14 fl oz crema doble", "azúcar en polvo, al gusto", "75 g / 2 oz moras, enteras o picadas", "4 cestones de moras", "4 cucharadas de azúcar en polvo", "570ml / ½ pinta de agua", "5 hojas de gelatina, empapadas en un recipiente con agua fría", "botón de mantequilla", "4 manzanas Bramley, peladas y picadas", "5 cucharadas de azúcar en polvo", "botón de mantequilla", "2 manzanas, peladas y cortadas en cuñas", "55g / 2 oz de azúcar"], "method": ["Para la tarta de manzana, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una lata para hornear de 30 x 40 cm / 12 x 16 pulgadas, de 4 cm / 2 pulgadas de profundidad, con papel resistente a la grasa.", "Bata la mantequilla y el azúcar hasta que estén pálidos y esponjosos. Agregue los huevos uno por uno y bata para combinar. Tamizar en polvo de hornear, bicarbonato de soda, harina y sal y doblar para combinar. Agregue la crema agria y las manzanas picadas.", "Verter en la lata preparada y hornear durante 30 minutos, o hasta que sea elástico y dorado.", "Para el rollo, forrar una lata de rollo suizo de 30cm / 12in con papel de hornear y cepillar con aceite vegetal. Batir las claras de huevo en un recipiente con una pizca de sal hasta que llegue a los picos suaves cuando se quita el batidor del recipiente. Agregue el azúcar, bata de nuevo y luego agregue el jugo de limón y siga batiendo hasta que se formen picos rígidos cuando se quite el batidor del tazón.", "Incline la mezcla en la bandeja preparada y use una espátula para extender. Espolvorear con avellanas picadas, canela y un toque de azúcar en polvo. Hornee en el horno a 180 ° C / 350 ° F / Gas 4 durante 8-10 minutos antes de encender un paño de cocina limpio y dejar enfriar.", "Batir la crema con el azúcar hasta que se formen picos suaves cuando se quite la batidora del bol. Doble las moras a través de la crema.", "Una vez que el merengue esté frío, extiéndelo con la mezcla de crema y enrolla cuidadosamente el rollo.", "Para el coulis de mora y jalea de mora, caliente las moras, el azúcar y el agua en una sartén durante 6-8 minutos para que se ablanden.", "Retire del fuego y mezcle la mezcla hasta que quede suave con un procesador de alimentos o licuadora manual.", "Pase la mezcla a través de un colador y luego divídala en dos lotes. Reserve un lote para usar como coulis (para vestir el postre). Con el otro lote, vuelva a calentar suavemente, luego retírelo del fuego y agregue las hojas de gelatina. Vierta en un recipiente pequeño y déjelo reposar.", "Una vez establecido, cortar en cubos pequeños para servir.", "Para el puré de manzana, caliente la mantequilla en una sartén y fría la manzana y el azúcar en polvo durante 8-10 minutos a fuego suave hasta que se ablanden, agregando un chorrito de agua si es necesario. Retire del fuego y mezcle (en un procesador de alimentos o con una batidora manual) hasta que quede suave.", "Para las manzanas caramelizadas, caliente la mantequilla en una sartén y agregue las rebanadas de manzana. Cocine por unos minutos para ablandar, luego agregue el azúcar. Permita que el azúcar se disuelva y cocine hasta que las manzanas se hayan caramelizado.", "Para servir, corte el rollo en rodajas y acomódelo en platos para servir. Decorar con una ramita de menta. Vierta el puré de manzana en el plato y frótelo con una cuchara. Cortar el pastel de manzana en cuadrados y servir al lado. Coloque los cubitos de gelatina en el plato y coloque las manzanas caramelizadas al lado también. Termina con gotas de blackberry coulis para terminar."], "url": "www_bbc_co_uk_food_recipes_blackberry_and_hazelnut_72381", "title": "Rollo de merengue de mora y avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "250 g / 9 oz de mantequilla fría, en cubos, más extra para engrasar.", "100g / 3½oz de azúcar glasé", "3 yemas de huevo de gallinas camperas, ligeramente batidas.", "3 yemas de huevo grandes de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "Harina normal de 20g / ¾oz", "40 g / 1½ oz de harina de maíz", "Leche de 400 ml / 13½ fl oz", "pizca de sal", "vaina de vainilla", "100ml / 3½ fl oz crema doble", "1 cucharada de whisky", "Frambuesas 400 g / 14 oz", "Moras 200g / 7oz", "2 cucharadas de mermelada de albaricoque", "2 cucharadas de agua caliente (solo hervida)", "50 g / 1½ oz de almendras tostadas", "azúcar en polvo, para quitar el polvo"], "method": ["Para la masa, coloque la harina, la mantequilla y el azúcar en un tazón, frote suavemente y rápidamente en la consistencia de las migas de pan. Si usa un procesador de alimentos, mezcle según esta consistencia. Rocíe la yema de huevo y use un cuchillo para mezclar hasta que la migaja se una. (Si usa un procesador de alimentos, mezcle el huevo en la mezcla durante unos segundos hasta que se combine). Si la mezcla está demasiado seca, puede agregar pequeñas cantidades de clara de huevo al tazón o procesador y mezclar hasta que la miga se una.", "Forme la masa en un bloque y enfríe en un refrigerador durante 20 minutos hasta que esté duro.", "Engrase una lata agria de 25cm / 10in y luego espolvoree con harina.", "Usando un rallador de bordes ásperos, ralle la masa fría en la lata de tarta. Empuje la masa en las esquinas y luego ralle más masa y firme en la base de la lata hasta aproximadamente 6 mm / ¼ de profundidad. Coloque en la nevera durante aproximadamente 20 minutos mientras prepara la crema pastelera.", "Para hacer la crema pastelera, coloque las yemas de huevo y el azúcar impalpable en un tazón. Batir hasta que esté espeso y pálido, luego incorporar la harina y la harina de maíz.", "Coloque la leche en una cacerola, agregue una pizca de sal. Marca la vaina de vainilla con un cuchillo por toda la longitud, agrégala a la leche y déjala hervir. Retire del fuego y deje la mezcla para infundir durante 10 minutos.", "Retire la vaina de vainilla y regrese la leche al fuego. Llevar a ebullición y luego agregar lentamente la leche caliente a la mezcla de huevo batiendo todo el tiempo. Vierta la mezcla de nuevo en la sartén y reduzca el fuego a bajo. Batir constantemente y llevar a ebullición de nuevo. Después de unos dos minutos, la mezcla debe espesarse. Vierta en un recipiente frío para detener el proceso de cocción.", "Batir la crema hasta que se formen picos suaves cuando se quite la batidora, y luego doblar en la crema pastelera. Agregue el whisky a la mezcla y enfríelo en la nevera.", "Para hornear a ciegas la masa, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Retire los pasteles y tarta la lata del refrigerador. Corte un pedazo de papel resistente a la grasa o pergamino para hornear que sea más grande que la lata y aplástelo para formar una bola y ábralo de nuevo para que quede suave y menos rígido. Coloque el papel en la caja de repostería y rellene suavemente con legumbres secas o alubias para hornear. Cuela la caja de pastelería en el horno por unos 20 minutos hasta que se sienta seca al tacto. Retire el papel pergamino / grasa y los frijoles, cepille la masa con clara de huevo y vuelva al horno durante 5-8 minutos para sellar la masa.", "Para armar la tarta, vierta la crema de pastelería fría en la caja de pastelería. Cubra con frambuesas y moras. Disuelva la mermelada de albaricoque en el agua apenas hervida. Usando un pincel de pastelería, cubra suavemente la fruta con el glaseado, espolvoree con almendras tostadas y polvo con azúcar glas.", "Para servir quite el anillo exterior de la lata. Fácil, remueva la base con un cuchillo y deslícela sobre un plato o soporte para pasteles."], "url": "www_bbc_co_uk_food_recipes_blackberry_and_raspberry_13546", "title": "Tarta de mora y frambuesa", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, más extra para engrasar", "125 g / 4½ oz de harina de levante, más extra para quitar el polvo", "25 g / 1 oz de azúcar en polvo", "16 moras frescas", "Suero de mantequilla 80-100ml / 3-3½fl oz", "yogur natural, para servir"], "method": ["Precaliente el horno a 220C / 450F / Gas 7. Engrase una bandeja para hornear con mantequilla.", "En un tazón, frote la mantequilla y la harina con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar. Revuelva suavemente las moras.", "Poco a poco vierta el suero de leche, revolviendo bien hasta que la mezcla comience a juntarse como una masa sin ser pegajosa. Es posible que no necesite usar todo el suero de leche.", "Convierta la masa en una superficie de trabajo ligeramente espolvoreada y enrolle en forma de bola. Estire la bola de masa hasta un grosor de 1.5 cm / ½ pulg.", "Corta los círculos de la masa con un cortador de galletas y colócalos en la bandeja de hornear, dejando un espacio entre cada uno. Hornee en el horno durante 10-12 minutos, o hasta que estén doradas.", "Sirva con una cucharada de yogur en la parte superior."], "url": "www_bbc_co_uk_food_recipes_blackberry_bites_08399", "title": "Mordidas de Blackberry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de moras congeladas", "1 cucharadita de miel líquida o jarabe de agave", "pequeño puñado de almendras picadas o nueces", "Avena de avena 40g / 1½ oz o avena tostada (use avena sin gluten si es necesario)", "150ml / 5fl oz de leche o alternativa vegana", "3 gotas de extracto de almendra (opcional)"], "method": ["Pon todos los ingredientes en un frasco, revuelve, pon la tapa y enfría en la nevera durante la noche.", "En la mañana, cubra con nueces extra, si lo desea."], "url": "www_bbc_co_uk_food_recipes_blackberry_crumble_15618", "title": "Blackberry crumble avena noche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackberry_crumble_15618_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 manzanas Bramley, peladas, 2 cortadas en trozos y 1 rebanada para decorar", "Moras de 400 g / 14 oz, 100 g / 3½ reservadas para decorar", "Azúcar en polvo de 110 g / 4 oz", "10 rebanadas de pan blanco, sin costras", "100g / 3½oz de mantequilla, derretida, más extra para engrasar", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl oz de leche entera", "1 vaina de vainilla, semillas retiradas", "4 yemas de huevo de gallinas camperas", "75 g / 2½ oz de azúcar en polvo"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Engrase cuatro moldes dariole individuales con mantequilla.", "Caliente las manzanas, las moras 300 g / 10½ oz y el azúcar con 2-3 cucharadas de agua en una cacerola durante 2-3 minutos, o hasta que las manzanas se ablanden y las moras se hayan descompuesto. Retire la sartén del fuego.", "Corta cuatro círculos de pan para alinear la base de los moldes dariole y cuatro círculos más grandes para las partes superiores. Corta el pan restante en tiras.", "Sumerja cada pedazo de pan en la mantequilla derretida y úselos para alinear el fondo y los lados de los moldes dariole. Coloque las manzanas y las moras en los moldes y cubra con los círculos más grandes de pan.", "Hornee los charlottes en el horno por 25 minutos o hasta que estén dorados en la parte superior.", "Mientras tanto, para la crema pastelera, lleve la crema, la leche y la vaina de vainilla a fuego lento durante cinco minutos a fuego muy lento. Retire la sartén del fuego y retire la cápsula de vainilla.", "Batir las yemas de huevo y el azúcar en un tazón hasta que estén bien mezclados. Bata lentamente la leche y la crema caliente. Regrese la mezcla a la sartén y cocine a fuego lento, revolviendo continuamente, hasta que la crema se espese lo suficiente como para cubrir la parte posterior de una cuchara. Colar a través de un tamiz fino en un recipiente.", "Para la guarnición, caliente una sartén mediana y agregue la mantequilla derretida restante, las manzanas y las moras en rodajas reservadas y fríelas suavemente durante dos minutos.", "Para servir, gire cuidadosamente los charlottes de manzana y mora. Coloque una natilla pequeña en cada uno de los cuatro platos para servir, coloque los charlottes encima y ponga la guarnición al lado."], "url": "www_bbc_co_uk_food_recipes_blackberry_charlotte_96114", "title": "Apple y blackberry charlotte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["190g / 6¾oz de azúcar", "1 cucharada de glucosa líquida", "350 g / 12 oz de grosellas negras", "50 ml / 2 fl oz sorbete de jarabe (de arriba)", "60g / 2¼ oz de azúcar", "1 huevo blanco de corral", "puré de grosella negra (de arriba)", "12 g / ½ oz de leche en polvo", "½ vaina de vainilla", "3 yemas de huevo medianas de campo abierto", "25 g / 1 oz de azúcar en polvo", "4½ hojas de gelatina, empapadas en agua fría durante 15 minutos", "Merengue italiano (desde arriba)", "200ml / 7fl oz crème de cassis", "Crema doble de 400 ml / 14 fl oz, ligeramente azotada hasta la etapa de cinta", "1 base de flan de esponja redonda ya hecha, cortada a la mitad horizontalmente (solo necesitarás la mitad)", "50 ml / 2 fl oz sorbete de jarabe (de arriba)", "1 cucharada de puré de grosella negra (de arriba)", "50 ml / 2 fl oz sorbete de jarabe (de arriba)", "3 cucharadas de puré de grosella negra (de arriba)", "3 hojas de gelatina, empapadas en agua fría durante 15 minutos", "Crema doble 600ml / 20fl oz", "150 g / 5½ oz de azúcar en polvo", "2 limones grandes, cáscara y jugo solamente", "250g / 9oz de harina blanca fuerte", "pizca de sal", "50 g / 1 oz de azúcar en polvo", "30 g / 1 oz de mantequilla, ablandada", "1 cucharadita de levadura de acción rápida", "aceite vegetal, para freír", "1 clara de huevo", "Almendras blanqueadas de 550g / 1lb 4oz", "200 g / 7 oz de azúcar en polvo", "¼ cucharadita de sal marina", "ramitas de menta"], "method": ["Para el jarabe de sorbete, ponga el azúcar, la glucosa y 165ml / 5½ fl oz en una cacerola y deje que hierva, revolviendo ocasionalmente con una cuchara de madera. Hervir durante unos 2-3 minutos. Pase el jarabe a través de un colador fino para eliminar los cristales de azúcar. (PRECAUCIÓN: el azúcar en ebullición es extremadamente caliente.) Deje enfriar por completo.", "Para el puré de grosella negra, coloque las grosellas negras en una licuadora con el jarabe y mezcle hasta que quede suave. Pase la mezcla a través de un tamiz fino en un recipiente.", "Para el merengue italiano, coloque el azúcar y 5 cucharaditas de agua en una sartén. Calentar lentamente hasta que el almíbar alcance los 110 ° C / 230 ° F en un termómetro de azúcar. En esta etapa, coloque las claras de huevo en el cuenco de un mezclador independiente y bata hasta que se formen picos firmes cuando se quite el batidor.", "Tan pronto como el azúcar alcance 121C / 250F, retire la sartén del fuego. Inmediatamente reanude batiendo las claras de huevo. Con el batidor a su velocidad más baja, vierta el azúcar derretido, en un flujo constante, asegurándose de que esté limpio de los batidores. Continúe batiendo por unos 5 minutos, hasta que el merengue esté tibia.", "Para la mousse de grosella negra, reservar 4 cucharadas de puré de grosella negra y reservar. Ponga el puré restante en una cacerola con la leche en polvo y la vaina de vainilla. Llevar a ebullición.", "Coloque las yemas de huevo y el azúcar impalpable en un tazón grande y bata hasta que la mezcla deje un rastro cuando se quite el batidor (la etapa de cinta). Vierta la mezcla de grosella negra sobre la mezcla de huevo, batiendo continuamente, luego regrese la mezcla a la sartén. Calentar suavemente, revolviendo continuamente con una espátula, hasta que la crema esté lo suficientemente espesa para cubrir la espátula. No permita que hierva o la crema se partirá.", "Retire la sartén del fuego y mezcle la gelatina drenada con la crema pastelera. Deseche la vaina de vainilla, luego pase la crema por un colador fino en un recipiente y deje que se enfríe, revolviendo ocasionalmente para evitar que se forme la piel.", "Para la base, coloque la mitad de la base de flan de esponja en un tablero. Mezcle el jarabe y una cucharada de puré de grosella negra reservada. Cepille la mezcla sobre la esponja. Coloque un anillo de flan de 25 cm / 10 pulgadas (aproximadamente 6 cm / 2½ pulgadas de profundidad) en la esponja y recorte un círculo para formar la base. Coloque la base de la esponja en la parte inferior del anillo del flan y colóquela en un plato o tabla plana.", "Cuando la crema de grosella negra esté tibio, doble suavemente la mitad del merengue italiano (no necesita el resto para esta receta). Agregue la crema de cassis, luego agregue la crema batida. Comience a preparar el postre inmediatamente, antes de que la gelatina haga que la espuma se seque.", "Llene el anillo de flan con la mezcla de mousse de grosella negra, dejando un pequeño espacio en la parte superior, y cuidadosamente alise la superficie con una espátula. Coloque en el congelador o en una nevera muy fría durante 2-3 horas, o hasta que la mousse esté lista.", "Para el glaseado, coloque el jarabe y el puré de grosella negra restante en una sartén y caliente suavemente. Retirar del fuego y agregar la gelatina. Dejar enfriar, luego extender el glaseado sobre la parte superior de la mousse. Coloca en la nevera para enfriar mientras preparas las donas.", "Para el posset de limón, lentamente lleve la crema doble y el azúcar a ebullición en una cacerola grande a fuego lento, revolviendo bien para disolver el azúcar en la crema. Hervir durante 3 minutos, luego retirar del fuego y reservar para enfriar.", "Una vez que la mezcla de crema se haya enfriado, mezcle el jugo y la ralladura de limón. Vierta la mezcla de posset en un tazón mediano y enfríe en la nevera durante al menos 3 horas.", "Para las mini donuts, combine la harina, la sal y el azúcar en polvo en un tazón grande.", "Mezcle la mantequilla, 150ml / 5fl oz de agua y la levadura hasta que la mezcla se una para formar una masa homogénea. Cubra con una película adhesiva y déjela en un lugar cálido durante aproximadamente una hora, o hasta que duplique su tamaño.", "Divida la masa en 12 porciones iguales y enrolle cada una en una bola.", "Alinee una bandeja para hornear con pergamino para hornear y coloque las bolas de masa encima, dejando suficiente espacio entre cada bola. Cubra con un paño de cocina y reserve en un lugar cálido para probar durante 20 minutos más.", "Cuando la masa haya demostrado, precaliente una freidora a 150 ° C. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje las rosquillas en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para las almendras azucaradas, precaliente el horno a 130 ° C / 110 ° Ventilador / Gas 1 y forre una bandeja para hornear con papel para hornear.", "Batir ligeramente la clara de huevo con una cucharada de agua. Agregue las almendras y revuelva hasta que estén bien cubiertas. Mezcle el azúcar y la sal y espolvoree sobre las nueces. Mezcle para cubrir, y distribuya uniformemente en la bandeja.", "Hornee durante 1 hora, revolviendo ocasionalmente, hasta que estén doradas. Deja enfriar.", "Para servir, retire el delice del molde con un soplete de chef y coloque las rebanadas en los platos de servir. Adorne con las mini rosquillas y almendras azucaradas. Revuelva el posset y coloque una quenelle en cada plato. Cubra con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_blackberry_delice_with_29437", "title": "Delicia de grosellas negras con mini donas, posset de limón y almendras azucaradas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g / 14 oz zarzamoras", "Azúcar en polvo de 110 g / 4 oz", "3 cucharadas de agua", "75g / 3oz de mantequilla derretida", "10 rebanadas de pan blanco, sin costras", "200 ml / 7 fl oz de helado de vainilla, para servir", "200ml / 7fl oz de crema coagulada, para servir", "200ml / 7fl de leche en oz", "Crema doble 200ml / 7floz", "1 vaina de vainilla, partido y semillas raspadas", "4 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la charlotte, caliente una sartén hasta que esté caliente. Agregue las moras, el azúcar y la pizca de agua y fría hasta que el azúcar se haya derretido y las moras estén blandas. Establezca esta compota de zarzamora a un lado.", "Corta las rebanadas de pan por la mitad, y luego cada mitad en cuatro rebanadas para obtener los dedos pequeños. Sumerja cada pedazo de pan en la mantequilla derretida y forre el molde, reservando algo para la tapa.", "Una vez que se forme el molde, espolvoréalo con la compota de mora y cúbrelo con más pan que se haya sumergido en mantequilla derretida. Coloque en una bandeja para hornear y hornee durante 25-30 minutos, o hasta que estén doradas en la parte superior.", "Para la crema pastelera, coloque la leche, la crema y la vaina de vainilla en una cacerola y cocine a fuego lento durante cinco minutos.", "Vierta la leche caliente sobre los huevos y revuelva hasta que estén bien combinados. Vierta la crema pastelera en una olla caliente y caliente, revolviendo constantemente, hasta que la crema se haya espesado ligeramente. Colar a través de un tamiz fino.", "Retire los charlottes del horno y déjelos a un lado para que se enfríen un poco. Con cuidado, saque los charlottes del molde.", "Sirva los charlottes en un grupo de natillas, junto con una cucharada de crema coagulada y una cucharada de helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_blackberry_charlotte_82346", "title": "Blackberry charlotte con crema pastelera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de avellanas blanqueadas", "125g / 4½oz de mantequilla, suavizada", "150 g / 5½ oz de azúcar en polvo", "½ limón no encerado, ralladura fina únicamente", "Harina normal 150g / 5½ oz", "½ cucharadita de polvo de hornear", "600g / 1lb 5 oz de moras frescas, cascadas", "75g / 2½oz conservando azúcar", "2-3 cucharadas de azúcar en polvo, para endulzar", "1 cucharada de jugo de limón fresco", "300 ml / 10 fl oz crema doble, bien refrigerado", "100 ml / 3½ fl oz oz natural yogur", "hojas de menta fresca, para decorar"], "method": ["Para las galletas, precaliente el horno a 200C / 180C (ventilador) / Gas 6 y alinee dos bandejas grandes para hornear con papel para hornear. Esparza las nueces sobre una bandeja para hornear y tueste en el horno durante 6-8 minutos, o hasta que estén doradas. Mírelos con cuidado para que no tengan la oportunidad de quemarse. Retire del horno, incline sobre un tablero y déjelo enfriar.", "Ponga la mantequilla y el azúcar en un tazón grande y bata con una cuchara de madera hasta que quede ligero y cremoso. Cortar aproximadamente las nueces enfriadas y agregar a la crema de mantequilla y azúcar, junto con la ralladura de limón, harina y polvo de hornear. Revuelva bien hasta que la mezcla se una y forme una bola; es posible que necesite usar sus manos.", "Divida la masa de galletas en 24 piezas pares y enrolle en bolitas. Coloque las bolas en las bandejas de horneado preparadas, separadas para permitir su propagación.", "Presione los bizcochos para aplanar a alrededor de 1 cm / ½ en grueso. Hornee los bizcochos, una bandeja a la vez, durante 12 minutos o hasta que queden muy pálidos dorados. Dejar enfriar en las bandejas. Serán muy suaves cuando los saques del horno, pero se mantendrán crujientes a medida que se enfríen.", "Almacene en una lata hermética y coma dentro de cinco días.", "Para el tonto, enjuaga las moras en un colador para lavar el polvo o la suciedad. Coloque las moras en una olla antiadherente y espolvoree el azúcar en polvo.", "Agregue el jugo de limón y caliente suavemente durante dos minutos, o hasta que las moras empiecen a ablandarse y liberar sus jugos. Retire y reserve 12 moras para decorar y continúe cocinando el resto.", "Cocine a fuego lento las moras muy suavemente durante 15 minutos, revolviendo regularmente hasta que esté muy suave y squidgy. Retire del fuego y presione las bayas y el jugo a través de un tamiz sobre un recipiente, usando el fondo de un cucharón para ayudarlo a extraer la mayor cantidad posible de puré. Deja enfriar el puré y descarta las semillas. Deberías terminar con alrededor de 325ml / 11fl oz de puré.", "Ponga la crema y el yogur en un tazón grande y látigo con un batidor eléctrico hasta que se formen picos suaves cuando se quite el batidor del tazón: la acidez de la fruta aumentará el espesor de la crema, por lo que no debe llevarla demasiado lejos.", "Cuando el puré esté completamente frío, ajuste la dulzura al gusto agregando más azúcar si es necesario. Viértalo en el tazón con la crema batida y el yogur y revuelva solo una o dos veces hasta que se combine ligeramente.", "Coloque el zumo de blackberry en platos individuales de vidrio, o en un tazón grande y sencillo. Debería verse bastante veteado, así que no lo revuelva demasiado. Esparce unas hojas de menta en la parte superior y decora con las moras reservadas. Espolvoree con un poco de azúcar si lo desea y sirva con los bizcochos de avellanas."], "url": "www_bbc_co_uk_food_recipes_blackberry_fool_with_11859", "title": "Tonto de Blackberry con galletas de avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6 personas (hace 24 galletas)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "50 g / 1 oz de azúcar en polvo", "Moras de 500g / 1lb 2oz, más 50 g / 1¾oz extra para decorar", "½ limón, solo jugo", "300ml / 10½ fl oz crema doble", "300ml / 10½ fl oz de leche", "6 yemas de huevo", "50 g / 1 oz de azúcar en polvo", "Harina de 175g / 6oz de auto crianza", "110g / 4oz de azúcar mascabado ligero", "1 cucharadita de maceta de tierra", "1 cucharadita de bicarbonato de soda", "60 g / 2¼ oz de mantequilla, cortada en cubitos", "1 huevo, ligeramente batido", "1 cucharada de jarabe de oro", "1 bola de helado de vainilla por persona", "1 cucharadita de maceta de tierra"], "method": ["Para el tonto de mora, derrita la mantequilla en una cacerola y agregue el azúcar. Vierta las moras en la parte superior y agregue el jugo de limón. Cocine a fuego lento hasta que se convierta en un puré. Licúe hasta que quede suave, luego pase a través de un tamiz fino en un recipiente y cúbralo con una película adhesiva. Dejar de lado hasta que sea necesario.", "Para la crema, llevar la crema y la leche a ebullición en una olla grande. En un recipiente resistente al calor, mezcle las yemas de huevo y el azúcar impalpable. Vierta la crema y la leche en los huevos, batiendo continuamente. Vuelva a colocar la sartén sobre el fuego y cocine suavemente hasta que la natilla cubra la parte posterior de una cuchara o alcance 82C / 180F en un termómetro para cocinar. Pasar a través de un tamiz fino en un recipiente, cubrir con una película adhesiva y enfriar en la nevera.", "Mezcle el puré de moras 400g / 14oz con la crema pastelera. Pasa a través de un colador fino y vierte en una pistola de espuma. Carga con dos cargadores y agita bien. Déjalo reposar de 10 a 15 minutos.", "Para los panecillos de macis, coloque todos los ingredientes secos en un tazón grande para mezclar y agregue la mantequilla, frotándola hasta que la mezcla se parezca a las migas gruesas. Agregue el huevo y el jarabe y agréguelos para formar una pasta dura. Envuelva la película adherida y deje enfriar en la nevera durante al menos una hora.", "Cuando esté listo para cocinar, vuelva a calentar el horno a 180C / 350F / Gas mark 4. Coloque dos bandejas para hornear con papel para hornear.", "Enrolle la mezcla en 16-20 bolas del tamaño de una nuez y colóquelas a 5cm / 2pulg en las bandejas para que tengan espacio para extenderse. Hornee durante 12-15 minutos, hasta que esté cocido. Retire del horno, deje en las hojas para reafirmar durante un par de minutos, luego colóquelo en una rejilla para que se enfríe completamente.", "Para servir, mezcle algunas moras con un poco de puré y colóquelas en el fondo de seis vasos para servir. Desmoronarse en algunos bizcochos de macis. Agregue una bola de helado de vainilla a cada vaso. Agregue más moras y puré, luego un poco más de galleta desmoronada. Rocía al tonto. Polvo con maza y servir."], "url": "www_bbc_co_uk_food_recipes_blackberry_fool_with_70910", "title": "Tonto de Blackberry con galletas de macis", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110 g / 4 oz de mantequilla, en cubos, más extra para engrasar", "Harina normal de 180 g / 6½ oz", "Azúcar demerara 110 g / 4 oz", "5 peras, peladas y dejadas enteras", "150 g / 5½ oz de azúcar en polvo", "Moras 300g / 10½ oz", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "150ml / 5½ fl oz de leche", "150ml / 5½ fl oz crema doble"], "method": ["Para el crumble, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un plato para horno con mantequilla.", "En un tazón grande, mezcle la mantequilla y la harina, con las yemas de los dedos, hasta que la mezcla se asemeje a pan rallado.", "Agregue el azúcar, mezcle hasta que esté bien combinado, luego reserve.", "Para el relleno, coloque las peras enteras en una sartén, cúbralas con agua y agregue 50 g / 1¾ oz del azúcar. Llevar la mezcla a ebullición, luego reducir el fuego a fuego lento y cocinar durante 10-12 minutos, o hasta que las peras estén tiernas. Escurra bien y deje las peras a un lado para que se enfríen.", "Cuando las peras se hayan enfriado, retire los núcleos y pique finamente la carne.", "Coloque una cuarta parte de las peras en una capa uniforme en el fondo del plato preparado a prueba de horno. Dispersar un cuarto de las moras sobre la capa de peras y luego espolvorear sobre dos cucharadas de azúcar impalpable restante. Repita el proceso de estratificación hasta que todas las peras picadas, las moras y el azúcar se hayan agotado.", "Espolvorea sobre la cobertura de la migaja y hornea la migaja en el horno durante 20-25 minutos, o hasta que la masa se dore y el relleno burbujee.", "Mientras tanto, prepara la crema pastelera. Coloque las yemas de huevo y el azúcar en un tazón y mezcle hasta que espese y pálido.", "Coloque la leche y la crema en una cacerola y deje que hierva. Verter sobre la mezcla de huevo, batir bien, luego devolver la mezcla a la sartén. Calienta suavemente, hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de la cuchara.", "Para servir, divida la migaja entre los tazones para servir y vierta la crema."], "url": "www_bbc_co_uk_food_recipes_blackberryandpearcru_90060", "title": "Blackberry y pera crumble con crema pastelera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 300g / 10½ oz", "Azúcar 100 g / 4 oz", "pizca de sal", "200g / 7oz de mantequilla sin sal, a temperatura ambiente", "1 huevo", "1 yema", "1 cucharadita de extracto de vainilla", "1 cucharadita de limón fresco, jugo y ralladura únicamente", "harina para espolvorear", "450 g / 1 libra de ricotta (preferiblemente leche entera)", "100 g / 4 oz de azúcar en polvo", "25g / 1oz de harina para todo uso sin blanquear", "4 huevos separados, a temperatura ambiente", "¼ taza de crema batida", "¼ taza de crema agria", "1 cucharadita de extracto de vainilla", "¼tsp de sal", "200 g / 7 oz de mermelada de mora", "250 g / 9 oz de moras frescas, para servir al final"], "method": ["Para los dulces pasteles cortos, bata la mantequilla y el azúcar en un tazón con una cuchara de madera hasta que estén pálidos y cremosos.", "Agregue el huevo, la yema de huevo, el extracto de vainilla, el jugo de limón y la ralladura de una a la vez, mezclando bien después de cada adición.", "Agregue la harina y la sal y mezcle hasta que la masa se una y sea uniforme pero suave. Tenga cuidado de no mezclar demasiado o la masa será dura. Dejar de lado en la nevera para enfriar.", "Para el relleno de la tarta de queso, presione la ricota a través de un tamiz de malla de alambre en un tazón de mezcla, o procese con varios pulsos en un procesador de alimentos equipado con la cuchilla de acero hasta que quede suave y transfiera a un tazón de mezcla.", "Agregue el azúcar y la harina y bata con una cuchara de madera hasta que quede cremoso.", "Agregue las yemas de huevo, la crema batida, la crema agria y la vainilla. Revuelva hasta que esté completamente mezclado.", "Batir la clara de huevo y la sal hasta que los picos estén rígidos, luego doblar en la mezcla de ricotta.", "Vierta un tercio de la mezcla en la cáscara de los pasteles, luego ponga un poco de mermelada, luego más mezcla. Continúa con estas capas hasta llegar a la parte superior del caparazón. Alisa la parte superior.", "Caliente el horno a 150 ° C / 300 ° F / Gas 2. Hornee hasta que el relleno esté listo y la masa esté dorada, 50-75 minutos. Cubra la torta con papel de aluminio si está comenzando a dorarse demasiado antes de que el tiempo de cocción esté completo. Apague el horno y deje que la torta se enfríe con la puerta del horno abierta durante 30 minutos antes de servir con las moras frescas."], "url": "www_bbc_co_uk_food_recipes_blackberryandricotta_13771", "title": "Tarta de queso ricotta y blackberry en una caja de tarta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de jarabe de oro", "50 g / 2 oz de azúcar melaza", "50 g / 2 oz de mantequilla, más un poco extra para engrasar", "Harina simple de 40 g / 1½ oz, tamizada", "¾ cucharadita de jengibre molido", "1 cucharadita de brandy", "Crema doble de 200 ml / 7 fl oz", "1 vaina de vainilla, partido, semillas raspadas", "75g / 3oz de azúcar glasé", "25ml / 1fl oz Kirsch", "Moras 200g / 7oz"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Coloque el jarabe dorado, el azúcar melaza y la mantequilla en una sartén de base pesada a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 5-6 minutos, o hasta que el azúcar se haya disuelto por completo.", "Retire la sartén del fuego, agregue la harina y el jengibre molido y mezcle bien.", "Agregue el brandy y revuelva para combinar.", "Divida la mezcla en cuatro porciones iguales y colóquela en una bandeja para hornear engrasada y alineada (deje suficiente espacio entre las porciones en la bandeja para tener en cuenta la extensión mientras se cocinan).", "Transfiera al horno para hornear durante seis minutos, luego retírelo y déjelo enfriar un poco, hasta que esté listo pero aún flexible.", "Coloque dos latas separadas por una pequeña distancia y balancee (puentee) una cuchara de madera sobre las latas. Envuelva suavemente el brandy flexible alrededor de la cuchara para hacer una forma de cigarro hueco y colóquelo en un plato frío. Repita con los brocks de brandy restantes.", "Para el relleno, coloque la crema doble, las semillas de vainilla, el azúcar glasé, kirsch y 50 g / 2 oz de las moras en un tazón grande y látigo hasta que espese y púrpura del zumo de zarzamora.", "Con una cuchara, coloque la crema de mora en una manga pastelera, luego coloque en cada broche de presión para que se llene.", "Coloque una mora al final de cada apertura de brandy y sirva en los platos con una cucharada de moras al lado."], "url": "www_bbc_co_uk_food_recipes_blackberryfilledbran_86809", "title": "Brochetas de brandy rellenas de moras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 claras de huevo de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "1½ cucharadita de harina de maíz", "1 cucharadita de vinagre de vino blanco", "450 g / 1 libra moras", "150ml / 5fl oz de crema de vainilla lista para usar", "½ limón, solo jugo", "Crema doble de 350 ml / 13 fl oz, batida hasta que se forman picos firmes cuando se quita la batidora", "3 claras de huevo de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "175g / 6oz de azúcar en polvo", "75ml / 3fl oz de agua fría", "3 claras de huevo de gallinas camperas", "1 cucharadita de jugo de limón", "25g / 1oz de mantequilla", "Moras 200g / 7oz", "3 cucharadas de licor de mora"], "method": ["Para la base de merengue, precaliente el horno a 140 ° C / 275 ° F / Gas 1. Cubra una bandeja para hornear con papel para hornear.", "Batir las claras de huevo en un recipiente limpio de vidrio o metal hasta que se formen picos suaves cuando se quite el batidor. Agregue el azúcar, una cucharada a la vez, y continúe batiendo hasta que se formen picos firmes cuando se quite la batidora y la mezcla esté brillante. Agregue la harina de maíz y el vinagre.", "Coloque cucharadas de la mezcla en la bandeja de horno forrada y hornéelas en el horno durante 10 minutos. Apague el horno y deje los merengues en el horno con la puerta cerrada durante 2-3 horas, o preferiblemente durante la noche, hasta que estén crujientes pero sin color.", "Mientras tanto, para el parfait de mora, mezcle las moras, las natillas y el jugo de limón con un puré en un procesador de alimentos. Doble suavemente el puré en la crema batida hasta que esté bien combinado.", "En un recipiente aparte, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor, luego agregue gradualmente el azúcar impalpable, batiendo continuamente hasta que se formen picos brillantes y rígidos. Doble la mitad de las claras de huevo en la mezcla de moras hasta que estén bien combinadas, luego doble cuidadosamente las claras de huevo restantes hasta que se combinen.", "Coloque el parfait en un molde de 25cm / 10 pulgadas de diámetro x 5 cm / 2 pulgadas de alto en forma de resorte forrado con película adhesiva y golpee ligeramente el costado con una cuchara para liberar cualquier bolsa de aire grande.", "Congele el parfait durante al menos 4 horas, pero preferiblemente durante la noche, hasta que se solidifique.", "Para el relleno de merengue italiano, caliente el azúcar y el agua en una cacerola hasta que la mezcla alcance 110C / 230F en un termómetro de azúcar. (PRECAUCIÓN: El jarabe de azúcar hirviendo puede ser peligroso. No lo deje sin supervisión).", "Mientras tanto, con un batidor eléctrico, bata las claras de huevo y el jugo de limón en un recipiente limpio de vidrio o metal hasta que se formen picos firmes cuando se quite el batidor.", "Tan pronto como el jarabe de azúcar alcance 121C / 250F, retire la sartén del fuego.", "Inmediatamente reanude batiendo las claras de huevo. Con el batidor a la velocidad más baja, vierta el jarabe de azúcar en un flujo constante. (PRECAUCIÓN: Mantenga el almíbar limpio de los batidores, ya que el jarabe caliente podría volver a caer sobre sus manos). Continúe batiendo durante 4-5 minutos, hasta que la mezcla se haya enfriado un poco. Coloque el merengue en una bolsa de plástico con una boquilla en forma de lágrima.", "Para las moras, freír la mantequilla y las moras en una sartén no reactiva a fuego alto durante 1-2 minutos o hasta que se ablanden. Agregue el licor de moras. Con cuidado enciende el licor con un fósforo de cocina. Permita que las llamas se enciendan y mueran, luego continúe cocinando por un minuto más.", "Para servir, desmorona parte de la base de merengue crujiente en el centro de cada una de las ocho placas. Con un cuchillo caliente, corte ocho rebanadas de parfait de mora y coloque uno encima de cada porción de merengue. Coloca un poco de merengue italiano en la parte superior del postre helado. Usando un soplete de cocineros, dore la parte superior del merengue. Coloque unas zarzamoras calientes al lado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_blackberrymeringuepa_93398", "title": "Blackberry merengue parfait", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de cerezas de un tarro o lata, coladas con jugo retenido", "30 g / 1 oz de azúcar en polvo", "salpicaduras de vino tinto", "1 naranja, solo jugo", "100 ml / 3½ fl oz crema doble, batida"], "method": ["Caliente el jugo de cereza colado en una sartén pequeña a fuego medio.", "Agregue el azúcar, el vino tinto y el jugo de naranja, deje hervir y reduzca a la mitad.", "Agregue las cerezas y la crema y vierta en un vaso alto, para servir."], "url": "www_bbc_co_uk_food_recipes_blackcherrymousse_79391", "title": "Mousse de cereza negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 yemas de huevo de gallinas camperas", "100g / 3½ oz de azúcar", "1 vaina de vainilla, partido, semillas raspadas", "500g / 1lb 1½ oz de mascarpone", "200ml / 7fl oz de café espresso", "100ml / 3½fl oz de vino Marsala", "24 galletas con dedos de esponja listas para usar", "225 g / 8 oz de cerezas negras de una lata o jarra, drenados ligeramente", "cacao en polvo, al polvo"], "method": ["Coloque las yemas de huevo, el azúcar y las semillas de vainilla en un bol y mezcle hasta que estén pálidas y claras.", "Agregue el mascarpone y bate para combinar bien.", "Coloque el café y Marsala en un tazón limpio.", "Sumerja un dedo de esponja en la mezcla de café y presione en la parte inferior de un vaso o vaso de helado. Repita este proceso, usando cuatro dedos de esponja en total, para alinear la parte inferior del vaso.", "Con una cuchara unas cerezas negras en el vaso sobre los dedos de la esponja.", "Agregue una capa de la mezcla de mascarpone para cubrir las cerezas.", "Repita con una capa de cerezas negras y una capa de mezcla de mascarpone para llenar el vaso.", "Repita este proceso para hacer cinco postres más.", "Para servir, alise sobre la parte superior de cada tiramisú y polvo con cacao en polvo."], "url": "www_bbc_co_uk_food_recipes_blackcherrytiramisu_85856", "title": "Tiramisú de cereza negra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar glas de 110g / 4oz", "60 g / 2¼ oz de almendras molidas", "60 g / 2¼ oz de claras de huevo de gallinas camperas (2 huevos medianos), más 1 huevo de gallinas camperas, solo blanco, ligeramente batidas para aflojar la mezcla", "pizca de crema de tártaro", "40 g / 1½ oz de azúcar en polvo", "colorante de comida de gel de uva violeta", "hojas de menta, finamente picadas para decorar", "200g / 7oz de chocolate blanco", "300 g / 10½ oz de grosellas negras, para producir 100 g / 3½ oz de jugo de grosella negra", "½ cucharadita de esencia de menta", "5 gotas de extracto de frambuesa", "1 cucharada de licor de frambuesa negro"], "method": ["Precaliente el horno a 150C / 300F / Gas 2. Mezcle el azúcar glas y las almendras en un procesador de alimentos con un polvo fino.", "Batir las claras de huevo, la crema de tártaro y el azúcar en una batidora, suavemente al principio y aumentar gradualmente la velocidad, agregar una gota del colorante justo antes de alcanzar la etapa de pico suave, y continuar hasta que las claras alcancen la velocidad etapa máxima (la etapa de pico suave es cuando los picos caen levemente cuando levanta el batidor de la taza).", "Tamiza la harina y el polvo de almendras en un recipiente aparte, luego dobla un tercio del merengue. Continúa agregando hasta que se incorpore todo el merengue y luzca suave y brillante. Debería comportarse como si fluyera 'magma' cuando una cuchara lo arrastra hacia los lados del cuenco. Afloja con una cucharadita o dos de clara de huevo ligeramente batida si no se alcanza esta etapa.", "Llene una manga pastelera con una boquilla de 2-3 mm / 1 / 8in con la mezcla de macarrones. Alinee una bandeja para hornear con papel pergamino.", "Pipe 3 cm / 1¼ en círculos de ancho de la mezcla en el pergamino, establecer 3 cm / 1¼in de separación.", "Toque la bandeja debajo de dos o tres veces para liberar el aire atrapado en los macarrones y déjelo a un lado hasta que estén secos al tacto (al menos 15 minutos).", "Hornee durante 13-15 minutos, hasta que los macarrones puedan levantarse fácilmente del pergamino con un cuchillo para el paladar. Retire del horno y coloque los macarrones para que se enfríen en una rejilla de alambre.", "Para hacer el ganache, derrita el chocolate en un tazón sobre una fuente de agua hirviendo a fuego lento y caliente a no más de 45C / 113F (use un termómetro para medir esto).", "Mezcle las grosellas negras en un procesador de alimentos y crítelas. Mida 100 g / 3½ oz del jugo y llévelo a ebullición en una sartén pequeña. Agregue la esencia de menta y el extracto de frambuesa al jugo.", "Vierta el jugo caliente sobre el chocolate y revuelva rápidamente hasta que esté bien combinado.", "Transfiere el ganache a un bol, cúbrelo con una película adhesiva y colócalo en la nevera para que se enfríe y espese.", "Una vez que se haya enfriado un poco, transfiera la ganache a una manga pastelera, y vierta una pequeña cantidad de ganache, desde el centro hacia afuera, en la mitad de las conchas de macarrón.", "Sandwich la concha de macarrón con otra para formar un par.", "Enfríe los macarrones en la nevera para reafirmar."], "url": "www_bbc_co_uk_food_recipes_blackcurrant_and_58462", "title": "Macarrones de grosella negra y menta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]