[{"ingredients": ["150g / 5½ oz de oveja de cordero", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "250 g / 9 oz de calabaza, pelado, sin semillas y picado", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente cortado", "1 cucharadita de hojas de tomillo", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "½ cebolla roja, en rodajas", "½ cucharadita de azúcar moreno", "1 cucharadita de hojas de tomillo", "150ml / 5fl oz de vino tinto", "150ml / 5fl oz de caldo de carne caliente", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer el cordero, frote el cordero con el aceite y sazone ambos lados con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y dorar el cordero durante dos minutos en ambos lados.", "Coloque en el horno y tueste durante 10 minutos, luego retírelo y descanse por un minuto.", "Para hacer la calabaza, en un tazón grande mezcle la calabaza con el aceite de oliva, el ajo y el tomillo, luego sazone bien con sal y pimienta negra recién molida.", "Coloque en una bandeja de asar y cocine en el horno durante 15 minutos.", "Para hacer la salsa, derrita la mantequilla con el aceite de oliva en una sartén. Freír la cebolla hasta que esté suave, luego agregar el azúcar moreno y el tomillo y remover.", "Aumente el fuego y agregue el vino tinto, luego cocine para reducir a la mitad. Agregue el caldo de carne, sazone con sal y pimienta negra recién molida y reduzca hasta que espese.", "Sirva la calabaza en el medio de un plato caliente, coloque el cordero asado encima y cubra con una cuchara la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedlambchumpwit_83301", "title": "Chump de cordero frito con calabaza asada y salsa de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "175g / 6 oz de tocino rayado ahumado lardons", "Cebollas baby 125g / 4½oz blanqueadas", "Riñones de 500 g / 1 libra 2oz terneros, limpiados, recortados y cortados en trozos pequeños", "4 cucharadas de vino de Madeira", "4 cucharadas de jerez", "110ml / 4fl oz de caldo de carne", "Crema doble 75ml / 3fl oz", "sal y pimienta negra recién molida", "3 cucharadas de perejil de flatleaf fresco picado", "8 rebanadas gruesas de pan de masa fermentada", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "110g / 4oz de hojas de ensalada mixtas"], "method": ["Caliente el aceite de oliva y la mantequilla en una sartén hasta que forme espuma, luego fría el tocino durante 2-3 minutos o hasta que se doren. Agregue las cebollas baby y cocine durante 1-2 minutos, o hasta que se ablanden.", "Agregue los riñones y cocine por 1-2 minutos, o hasta que estén dorados por todas partes. Agregue el Madeira y el jerez a la sartén y cuidadosamente incline la sartén hacia la llama de la encimera, de modo que el alcohol se prenda (Nota: mantenga la ropa y la tela alejadas de la llama). Cuando la llama se haya apagado, cocine hasta que el alcohol reduzca su volumen a la mitad.", "Agregue el caldo de carne a la sartén y cocine a fuego lento durante 3-4 minutos, o hasta que los riñones estén cocidos. Agregue la crema y cocine durante 1-2 minutos para que se caliente, luego sazone al gusto, con sal y pimienta negra recién molida. Revuelva en el perejil. Apartar y mantener caliente.", "Caliente una sartén hasta que esté caliente, luego agregue las rebanadas de masa fermentada y pan tostado durante 1-2 minutos en ambos lados, o hasta que estén crujientes y doradas.", "Mezcle la mostaza, el vinagre y el aceite de oliva virgen extra en un recipiente hasta que estén bien combinados, luego sazone con sal y pimienta negra recién molida. Rocíe el aderezo sobre las hojas de ensalada y mezcle bien para cubrir.", "Para servir, coloca dos tostadas en el centro de cada una de las cuatro placas para servir. Cucharee los riñones y la salsa en la parte superior. Divida la ensalada entre los platos y acomódelos junto con los riñones y las tostadas."], "url": "www_bbc_co_uk_food_recipes_panfriedkidneyswitha_91584", "title": "Riñones fritos con salsa de Madeira y jerez, masa fermentada tostada y ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chuletas de cordero", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 dientes de ajo, con piel, aplastados", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ batata, pelada y cortada en rodajas en una mandolina", "2 dientes de ajo, pelados, picados", "sal y pimienta negra recién molida", "1 tomate de ciruela, picado", "1 chile verde, picado", "¼ de cebolla picada", "1 cucharadita de azúcar en polvo", "1 cucharadita de vinagre de vino tinto", "2 cucharadas de cilantro fresco picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cordero, sazone las chuletas de cordero con sal y pimienta negra recién molida. Calentar el aceite de oliva en una sartén pequeña a prueba de horno y freír el cordero y el ajo durante 2-3 minutos en ambos lados, o hasta que estén dorados, luego transferir al horno. Cocine por 6-8 minutos (para el medio), o hasta que esté cocido a su gusto, luego transfiera a un plato caliente para descansar.", "Para la batata, caliente el aceite de oliva y la mantequilla en una sartén a prueba de horno y coloque las rodajas de boniato en círculos concéntricos. Esparcir sobre el ajo y sazonar bien con sal y pimienta negra recién molida. Cocine a fuego lento durante 1-2 minutos, luego voltee las rodajas de papa y transfiéralas al horno durante 8-10 minutos, o hasta que las papas estén doradas y tiernas.", "Para la salsa, combine todos los ingredientes de la salsa en un tazón y mezcle bien.", "Coloque las rodajas de papa en un plato y coloque el cordero encima. Cuchara la salsa alrededor de los bordes y servir."], "url": "www_bbc_co_uk_food_recipes_panfriedlambchopwith_90368", "title": "Chuletas de cordero fritas con salsa de chile dulce y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 chuletas de cordero, recortadas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 dientes de ajo, ligeramente triturados", "2 ramitas de romero fresco", "6 anchoas, finamente picadas", "12 tomates pequeños, cortados en cuartos", "12 aceitunas negras, hoyos eliminados, cortados por la mitad", "2 cucharadas de aceite de oliva virgen extra", "2 cucharadas de vinagre de vino tinto", "sal y pimienta negra recién molida", "1 cucharada de hojas frescas de mejorana", "25g / 1oz de mantequilla", "300g / 10½oz de guisantes frescos, blanqueados", "2 cucharadas de hojas frescas de mejorana", "2 cucharadas de crema"], "method": ["Para el cordero, sazone las chuletas de cordero con sal y pimienta negra recién molida. Calentar una sartén hasta que esté caliente, agregar el aceite de oliva, las chuletas de cordero, el ajo, el romero y dos de las anchoas picadas. Freír el cordero durante 2-3 minutos por cada lado, hasta que esté dorado y cocido a su gusto. Retire de la sartén y déjelo a un lado para que descanse en un lugar cálido.", "Para el aderezo, devuelva la sartén al fuego y agrega los tomates, las aceitunas y las anchoas picadas restantes. Saltear suavemente durante 2-3 minutos.", "En un tazón pequeño, mezcle el aceite de oliva virgen extra y el vinagre. Sazonar al gusto, con un poco de sal y pimienta negra recién molida, verter en la sartén y calentar. Agregue las hojas de mejorana y revuelva.", "Para los guisantes, caliente una sartén, agregue la mantequilla, los guisantes y la mejorana y cocine suavemente durante 2-3 minutos, o hasta que los guisantes estén tiernos y calientes. Usando un triturador de papas, aplaste ligeramente los guisantes. Agregue la crème fraîche y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, apile los guisantes en el centro de cuatro platos para servir y cubra cada uno con tres chuletas de cordero. Vierta el aderezo alrededor del borde del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_panfriedlambcutletsw_89098", "title": "Chuletas de cordero fritas con guisantes triturados de mejorana y aderezo de tomate y anchoa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "6 cebollas de botón, o chalotes, pelados", "1 cucharada tocino tocino", "4 setas botón, descuartizado", "2 riñones de corderos, sin grasa, cortados por la mitad, eliminados del cartílago (pídale a su carnicero que haga esto por usted)", "¼-½ cucharadita de vinagre de vino tinto", "2-3 cucharadas de gránulos de salsa, preparados hasta 100 ml / 3½ fl oz de salsa con agua hirviendo", "1 cucharada de hojas de estragón fresco picado", "½ cucharada de hojas de perejil fresco picado", "1 rebanada gruesa de pan blanco crujiente, tostado"], "method": ["Caliente una cucharada de aceite en una sartén pequeña y no reactiva a fuego medio. Agregue el botón de cebollas o chalotes y freír todo durante 5-6 minutos, o hasta que esté suave y dorado. Retire de la sartén y reserve.", "Agregue otra cucharada de aceite a la sartén en la que se fríen las cebollas. Agregue los lardons y los champiñones y fríalos durante 4-5 minutos, o hasta que estén pálidos dorados. Retirar de la sartén y reservar con las cebollas.", "Agregue la cucharada restante de aceite a la misma sartén. Cuando el aceite esté caliente, agregue los riñones, con los lados cortados hacia abajo, y fría por 3-4 minutos en cada lado, o hasta que estén dorados y recién cocidos.", "Retire de la sartén y reserve con las cebollas, tocino y champiñones.", "Agregue el vinagre de vino tinto a la sartén. Cuando hierva a fuego lento, retire cualquier trozo quemado del fondo de la sartén con una cuchara de madera para desglasar la sartén, luego agregue la salsa.", "Devuelva los riñones, las cebollas, el tocino y los champiñones a la sartén y deje que la mezcla hierva a fuego lento. Continúe cocinando a fuego lento hasta que los riñones y las verduras se hayan calentado, luego agregue las hierbas.", "Para servir, coloca la tostada en un recipiente para servir poco profundo. Cuchara sobre los riñones de cordero frito, las verduras y la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedlambskidneys_92268", "title": "Riñones de cordero fritos sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tomates de vid", "pan blanco pequeño pedazo", "1 diente de ajo, picado", "pequeñas hierbas frescas, incluyendo albahaca, perejil, romero y tomillo", "1 cucharada de aceite de oliva, más extra para lloviznar", "sal y pimienta negra recién molida", "1 x 140 g / 5 oz de pierna de cordero filete", "2 cucharaditas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los tomates rellenos, corte las tapas de los tomates, saque algunas de las semillas y deséchelas.", "Coloque el pan, el ajo y las hierbas en un procesador de alimentos y pulse hasta que se disuelva en migas. Agregue el aceite de oliva, sazone con sal y pimienta negra recién molida y vuelva a pulsar para combinar.", "Presione esta mezcla en el centro de los tomates y rocíe con aceite de oliva. Coloque los tomates rellenos en una bandeja para hornear antiadherente y hornéelos en el horno durante 8-10 minutos, o hasta que los tomates se ablanden y el relleno se dore.", "Para el cordero, coloque el filete de cordero en un tazón, frote con el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a la plancha y carme el bistec durante 5-6 minutos por cada lado, o hasta que esté cocido a su gusto. Deja descansar durante cinco minutos.", "Para servir, coloque el filete de cordero en un plato de servir con los tomates rellenos."], "url": "www_bbc_co_uk_food_recipes_panfriedlambsteakwit_85302", "title": "Filete de cordero frito con tomates rellenos de estilo provenzal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de chile en polvo", "½ cucharadita de especias mixtas", "½ cucharadita de pimentón", "sal y pimienta negra recién molida", "150 g / 5½ oz de filete de eglefino fresco, cortado en dos piezas", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "1 puñado de hojas de perejil fresco mezclado, albahaca fresca y cebollín fresco", "½ limón", "pizca de chile en polvo"], "method": ["Para el eglefino, mezcle el chile en polvo, especias mixtas, pimentón, sal y pimienta negra recién molida y frote la mezcla en el pescado.", "Calentar el aceite de oliva en una sartén y freír el eglefino, con la piel hacia abajo, durante 2-3 minutos, o hasta que esté dorado y crujiente. Voltee el pescado y cocine durante 1-2 minutos más, o hasta que el pescado esté dorado por completo y cocido. Termine con un chorrito de jugo de limón.", "Para servir, coloque las hierbas frescas mezcladas en un plato para servir y coloque el pescado encima. Adorne con la mitad de limón y una pizca de chile en polvo."], "url": "www_bbc_co_uk_food_recipes_panfriedlemonandchil_90720", "title": "Abadejos fritos con limón y chile y ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 puerro grande, solo parte blanca, cortado en rebanadas de 1cm / ½", "1½ cucharadita de sal", "110g / 4oz de cocción de chorizo, sin piel, picada", "½ cucharadita de pimentón ahumado (disponible en delicatessen españolas)", "3 cucharadas de caldo de pollo caliente", "250ml / 9fl oz de aceite vegetal, para freír, más 1 cucharada extra", "1 cucharadita de harina común", "2 chalotes de plátano, pelados, rebanados en anillos", "2 filetes de caballa, piel anotada varias veces con un cuchillo afilado"], "method": ["Calentar la mantequilla en una sartén mediana de tamaño mediano a fuego medio. Cuando la mantequilla esté espumosa, agregue los puerros y sazone con media cucharadita de sal. Freír durante 3-4 minutos, o hasta que los puerros se hayan ablandado y estén dorados.", "Agregue el chorizo ​​y el pimentón ahumado y continúe freír durante 4-5 minutos, revolviendo ocasionalmente, hasta que el chorizo ​​se haya dorado y esté crujiente.", "Agregue el caldo y lleve la mezcla a fuego lento. Continúe cocinando a fuego lento por otros 3-4 minutos o hasta que la mayor parte del líquido se haya evaporado.", "Mientras tanto, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Alternativamente, caliente el aceite en una freidora a 140 ° C.", "Mientras tanto, espolvorea la harina en un plato. Dragar los anillos de chalote en la harina hasta que esté completamente cubierto.", "Cuando el aceite esté caliente, baje cuidadosamente los anillos de chalota en el aceite. Freír por 2-3 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Sazonar con otra media cucharadita de sal, reservar y mantener caliente.", "Mientras tanto, caliente una cucharada de aceite vegetal en una sartén antiadherente a fuego medio. Sazonar los filetes de caballa con la media cucharadita restante de sal. Cuando el aceite esté caliente, coloque los filetes de caballa sazonados, con la piel hacia abajo, en la sartén y fríe durante 3-4 minutos, o hasta que la piel esté crujiente y dorada, y más de la mitad de la carne de caballa se haya vuelto opaca.", "Retire la sartén del fuego, luego voltee los filetes de caballa y deje cocer con el calor residual durante 1-2 minutos más.", "Para servir, vierta la mezcla de puerro y chorizo ​​en el centro de cada una de las dos placas para servir. Coloque algunos de los anillos chalotes crujientes en la parte superior de cada porción. Coloque un filete de caballa encima de cada uno."], "url": "www_bbc_co_uk_food_recipes_panfriedmackerelchor_92518", "title": "Caballa frita en sartén, puerros cocidos en chorizo ​​y chalotes de chalote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 filetes de caballa muy fresca (permite 170g / 6oz de pescado para el plato principal, 85g / 3oz para el plato de iniciación)", "Harina sasonada", "40 g / 1½ oz de mantequilla suave", "55 g / 2 oz de mantequilla, derretida", "2 yemas de huevo, preferiblemente de rango libre", "1 cucharadita de mostaza dijon", "2 cucharaditas de vinagre de vino blanco", "1 cucharada de perejil, picado o una mezcla de perifollo, cebollín, estragón e hinojo, picado"], "method": ["Calentar la sartén de la plancha.", "Sumerja los filetes de pescado en la harina que ha sido sazonada con sal y pimienta recién molida. Sacuda el exceso de harina y luego unte un poco de mantequilla con un cuchillo en el lado de la carne, como si estuviera untando con mantequilla una rebanada de pan.", "Cuando la parrilla esté bastante caliente pero no humeante, coloque los filetes de pescado con la mantequilla hacia abajo sobre la parrilla; el pez debe chisporrotear tan pronto como toquen la sartén.", "Baje el fuego levemente y déjelos cocinar durante 4 o 5 minutos en ese lado antes de voltearlos. Continúe cocinando en el otro lado hasta que esté crujiente y dorado.", "Mientras tanto, prepara la salsa. Derretir la mantequilla y dejar hervir.", "Coloque las yemas de huevo en un tazón, agregue la mostaza, el vinagre de vino y las hierbas, mezcle bien.", "Bate la mantequilla derretida en la mezcla de yema de huevo poco a poco para que la salsa se emulsione. Mantenga caliente, colocando el recipiente a prueba de calor en una olla de agua caliente pero no hirviendo.", "Sirva la caballa con la salsa, una buena ensalada verde y patatas nuevas."], "url": "www_bbc_co_uk_food_recipes_panfriedmackerelwith_11634", "title": "Caballa frita con salsa bretona", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 como plato principal", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "250 g / 9 oz de grosellas espirituosas, coronadas y de cola", "Crema doble de 75ml / 3oz", "1 cucharadita de azúcar en polvo", "sal y pimienta negra recién molida", "1 filete de caballa, fileteado, con piel o dos caballa", "1 cucharada de mostaza integral", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "150g / 5oz de patatas nuevas, fregadas y partidas por la mitad", "1 cucharada de aceite de oliva extra virgen", "sal y pimienta negra recién molida", "1 bolsa de hojas de ensalada", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Para la salsa de grosella, calentar la mantequilla en una olla pequeña, colocar las grosellas en la sartén, tapar y cocinar a fuego medio durante 20-25 minutos hasta que estén tiernas.", "Retire la tapa y machaque las grosellas espinosas ligeramente. Agregue la crema y el azúcar a la sartén, sazone con sal y pimienta negra recién molida y continúe cocinando durante unos minutos. Retirar del fuego, tapar y reservar para mantener el calor.", "Mientras tanto, para la caballa, precaliente la parrilla a altura.", "Cepille el lado de la carne de los filetes de caballa con la mostaza integral, cepille ambos lados con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Coloque la caballa con la piel hacia arriba en una bandeja para hornear y colóquela debajo de la parrilla durante 4-5 minutos o hasta que esté recién cocida. Reservar para mantener el calor", "Para las papas nuevas, coloque las papas nuevas en una olla con agua hirviendo y hierva hasta que estén tiernas. Escurrir, volver a la sartén y rociar sobre el aceite de oliva. Revuelva para cubrir las papas y sazone con sal y pimienta negra recién molida.", "Para la ensalada, coloque las hojas de la ensalada en un tazón, rocíe sobre el aceite de oliva y sazone con sal y pimienta negra recién molida. Revuelva bien para vestir la ensalada.", "Para servir, coloque los filetes de caballa en los platos para servir y divida las papas nuevas, la ensalada y la salsa de grosellas entre ellos."], "url": "www_bbc_co_uk_food_recipes_panfriedmackerelwith_84849", "title": "Caballa a la parrilla con salsa de grosella, patatas nuevas y hojas de ensalada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de sal de roca", "4 chiles secos", "4 chiles secos ahumados", "2 pepinos, cortados por la mitad a lo largo, cada mitad cortada longitudinalmente en cuatro cuñas largas", "4 limas, jugo y ralladura", "Polenta de 100 g / 3½ oz", "100g / 3½ oz de pan rallado fresco", "1 huevo de gallinas camperas", "4 filetes de caballa de 150 g / 5½ oz", "sal y pimienta negra recién molida", "3-4 cucharadas de aceite vegetal", "25ml / 1fl oz de tequila"], "method": ["Moler la sal de roca, los chiles secos y los chiles secos ahumados en un molinillo de café hasta obtener un polvo fino.", "Coloque las rodajas de pepino en un recipiente y vierta sobre el jugo de limón. Espolvorea la ralladura de lima y una cucharadita de la mezcla de chile picado. Mezcle el contenido del tazón para cubrir todo el pepino en la ralladura de limón y la mezcla de especias. Dejar de lado durante cinco minutos para marinar.", "Mientras tanto, en un tazón poco profundo, mezcle la polenta y las migajas de pan hasta que estén bien combinadas. Batir el huevo en un recipiente aparte.", "Sazonar los filetes de caballa, al gusto, con sal y pimienta negra recién molida.", "Sumerja cada filete de caballa sazonado primero en el huevo batido, luego drague en la polenta y la mezcla de migas de pan.", "Caliente el aceite en una sartén grande a fuego medio a alto. Agregue los filetes de caballa recubiertos, en lotes si es necesario, y freír durante 3-4 minutos en cada lado, o hasta que estén crujientes y dorados en ambos lados y cocidos. (NB: los filetes de caballa se cocinan cuando la carne es opaca).", "Cuando el pepino se haya marinado, vierta sobre el tequila.", "Para servir, espolvorea un poco del pepino marinado en el centro de cada una de las cuatro placas para servir. Espolvorea sobre la mezcla de especias restante. Coloque un filete de caballa frita encima de cada porción."], "url": "www_bbc_co_uk_food_recipes_panfriedmackerelwith_92575", "title": "Caballa frita con pepinos de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo pequeñas, sin piel ni hueso", "150ml / 5¼fl oz de crema doble", "1 cucharada de salsa Worcestershire", "1 cucharada de miel líquida", "1 cucharada de pimentón", "1 cucharada de mostaza granulada", "espinaca joven", "arroz hervido, cocinado", "arroz salvaje, cocinado"], "method": ["Coloque las pechugas de pollo sobre una superficie de trabajo limpia. Cubra con película adhesiva y suavemente golpee con un rodillo o mazo de carne hasta 1 cm (0.75in) de espesor.", "Mezcle los ingredientes del adobo en un plato grande y plano, luego distribuya ligeramente cada filete de pollo con la mezcla y sazone. Deje marinar por un tiempo si el tiempo lo permite.", "Calienta una sartén antiadherente grande. Agregue un poco de aceite y fría las pechugas de pollo por poco menos de dos minutos en cada lado o hasta que esté hecho. Para verificar si está cocido, tome una fina rebanada de un lado del pecho. Si la carne es blanca, está cocida. Tenga cuidado de no cocinarse demasiado.", "Retire el exceso de aceite de la sartén con papel de cocina, luego mida la crema en una jarra y mezcle con la mezcla de pimentón sobrante del plato.", "Vierta la crema de pimentón en la sartén alrededor del pollo. Permitir burbujear y reducir ligeramente. Sirva con espinacas jóvenes y una mezcla de arroz hervido y arroz salvaje."], "url": "www_bbc_co_uk_food_recipes_panfriedpaprikachick_73735", "title": "Pollo pimentón frito", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panfriedpaprikachick_73735_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 10fl oz de aceite vegetal", "200g / 7oz de polenta, cocida según las instrucciones del paquete", "2 cucharadas de aceite de oliva", "3 cebollas de primavera, picadas", "1 diente de ajo, aplastado", "140g / 5oz de tomates cherry, cortados a la mitad", "3 hojas de albahaca fresca, picadas", "1 rebanada de jamón, picado", "40 g / 1½ oz de mozzarella picada", "2 puñados grandes de espinaca"], "method": ["Caliente el aceite en una sartén grande de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón (PRECAUCIÓN: el aceite caliente puede ser peligroso, no lo deje desatendido).", "Cuando el aceite esté caliente, use una cucharadita para echar cucharadas de polenta en el aceite y freír durante dos minutos, o hasta que estén doradas. Retire con cuidado las piezas de polenta con una espumadera y escurra sobre papel de cocina y manténgalo caliente.", "Para hacer la salsa, en una sartén por separado caliente el aceite, el ajo y la cebolla juntos durante dos minutos.", "Agregue los tomates, la albahaca y el jamón y cocine durante cinco minutos.", "Agregue la mozzarella y la espinaca a la sartén y revuelva durante 1-2 minutos, o hasta que la espinaca se haya marchitado.", "Para servir, coloque la polenta en un plato calentado y vierta la salsa sobre ella."], "url": "www_bbc_co_uk_food_recipes_panfriedpolentawithf_84152", "title": "Polenta frita con salsa de tomate fresco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vientre de cerdo 450g / 1lb", "2 zanahorias, aproximadamente picadas", "1 cebolla, cortada en cuartos", "4 dientes de ajo", "1 palo de apio", "1 tomillo pequeño de racimo", "1 cucharadita de sal marina gruesa", "½ cucharadita de pimienta negra", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida", "40 g / 1½ oz de mantequilla", "2 cebollas, finamente cortadas", "2 cucharaditas de azúcar en polvo", "2 ramitas de tomillo", "5 cucharadas de vinagre balsámico", "sal y pimienta negra recién molida", "4 chalotes de plátano, finamente picados", "200ml / 7fl oz de vinagre balsámico", "250ml / 9fl oz de caldo de pollo fresco", "sal y pimienta negra recién molida", "8 vieiras, cortadas por la mitad horizontalmente para formar dos discos", "4 tubos de calamar bebé, cortados finamente en anillos", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida"], "method": ["Para la barriga de cerdo, coloque la barriga de cerdo en una sartén grande a fuego medio y cubra con agua. Llevar a ebullición, luego escurrir el agua y devolver la barriga de cerdo a la sartén.", "Cubre nuevamente con agua y agrega la zanahoria, la cebolla, el ajo, el apio, el tomillo, la sal y la pimienta en grano. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante dos horas.", "Retire con cuidado la carne de cerdo de la sartén y colóquela en un plato grande. Coloque una bandeja grande y limpia en la parte superior, luego coloque un par de latas en la parte superior de la bandeja para aplicar peso. Transfiera al refrigerador y déjelo por una hora, o hasta que esté frío y plano.", "Retire la carne de cerdo del refrigerador, retire la bandeja y los pesos y colóquelos en una tabla de cortar. Corte el cerdo en rodajas de 1.5cm / ½ de espesor.", "Calentar una sartén y agregar el aceite vegetal. Sazonar las rodajas de cerdo con sal y pimienta negra recién molida y freír en el aceite caliente hasta que estén crujientes y doradas por todas partes.", "Para las cebollas caramelizadas, caliente una sartén limpia y agregue la mantequilla, la cebolla, el azúcar y el tomillo. Freír a fuego lento durante 5-10 minutos, hasta que las cebollas estén tiernas.", "Enciende el fuego y freír las cebollas hasta que estén doradas.", "Agregue el vinagre balsámico y reduzca hasta que quede muy poco líquido, luego sazone con sal y pimienta negra recién molida.", "Para la salsa balsámica, caliente una sartén limpia y agregue la mantequilla y los chalotes. Freír los chalotes durante 3-4 minutos, o hasta que estén blandos, pero no coloreados.", "Agregue el vinagre balsámico y hierva para reducir el volumen en dos tercios.", "Agregue el caldo y reduzca nuevamente en dos tercios, hasta que se forme una salsa espesa, luego sazone con sal y pimienta negra recién molida.", "Para las vieiras y el calamar, sazone las vieiras y el calamar con sal y pimienta negra.", "Calentar una sartén y agregar el aceite vegetal, las vieiras y el calamar. Freír las vieiras y los calamares durante 2-3 minutos, o hasta que estén completamente cocidos, volteando las vieiras a la mitad.", "Para servir, coloque unas rebanadas de panza de cerdo en el centro de cada plato y cubra con una cucharada de cebollas caramelizadas. Coloque tres pedazos de vieiras en la parte superior de cada uno, luego cubra con el calamar. Coloque la salsa chalote alrededor del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_panfriedporkbellywit_86698", "title": "Vientre de cerdo frito con vieira y calamar", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de solomillo de cerdo, cortado en rodajas de 1cm / 0.5in de espesor", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "1 jarra de ciruelas pasas en Armagnac (alternativamente puedes comprar ciruelas pasas secas y remojarlas en Armagnac durante la noche), quitar las piedras y picadita", "150ml / 5fl oz de crema doble", "1 cucharada de aceite de oliva", "4 papas, peladas y en cubos", "1 chalote, finamente picado", "2 cucharadas de perejil de flatleaf tostado"], "method": ["Coloque las rebanadas de filete de cerdo en un tablero y use un mazo de carne o un rodillo para aplastarlos en rodajas finas. Sazonar con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente, agregar la mitad de la mantequilla y las rodajas de filete de cerdo y freír en cada lado durante 1-2 minutos, o hasta que esté dorado y recién cocido (puede necesitar hacerlo en dos o tres lotes para evitar la sobrepoblación el pan). Transfiera a un plato tibio y manténgalo caliente.", "Agregue el Armagnac a la sartén utilizada para freír el filete de cerdo. Cuidadosamente flamear el Armagnac luego agregar las ciruelas pasas y cocinar por dos minutos, machacando las ciruelas ligeramente con el dorso de una cuchara o espátula.", "Agregue la crema, sazone con sal y pimienta negra recién molida, y cocine por un minuto más.", "Caliente una sartén por separado hasta que esté caliente y agregue la mantequilla restante, el aceite de oliva y las papas. Sofría las papas durante 4-5 minutos, o hasta que estén doradas y tiernas.", "Agregue la chalota a la papa y fría por un minuto más, agregue el perejil plano y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloca la salsa sobre el filete de cerdo y apila las papas al lado."], "url": "www_bbc_co_uk_food_recipes_panfriedporkfilletwi_88500", "title": "Filete de puerco frito con salsa de ciruela y Armagnac y papas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 berenjena, en rodajas gruesas", "125ml / 4½fl oz de aceite de oliva", "2 chalotes, pelados y toscamente picados", "½ diente de ajo, finamente cortado", "1 cucharada de aceite de oliva", "sal marina y pimienta negra recién molida", "2 x 225 g / 8 oz de filetes de pierna de cerdo", "1 cucharada de mantequilla", "4 bombillas de hinojo bebé, recortadas", "1 cucharada de aceite de oliva", "40 g / 1½ oz de chorizo, en rodajas", "10 aceitunas negras", "8 tomates cherry", "½ diente de ajo, finamente cortado", "10g / ½ oz de hojas de albahaca fresca", "sal marina y pimienta negra recién molida", "10g / ½ oz de perifollo fresco, más extra para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la berenjena, cortar la berenjena y colocar en una bandeja de asar con la chalota y el ajo. Rocíe con aceite de oliva.", "Coloque en el horno y hornee durante 30 minutos.", "Para la carne de cerdo, caliente el aceite de oliva en una sartén antiadherente y sazone los filetes de cerdo en ambos lados con sal y pimienta negra recién molida.", "Agregue la mantequilla a la sartén con el aceite y espere hasta que tenga un color marrón nuez.", "Agregue la carne de cerdo y cocine rápidamente durante unos tres minutos por cada lado hasta que esté bien cocida. Los jugos correrán claros cuando la carne se perfora con un pincho en el punto más grueso.", "Para el hinojo y el chorizo, ponga a hervir una cacerola de agua con sal y pula el hinojo durante dos o tres minutos hasta que esté tierno, luego escurra.", "Calentar un poco de aceite de oliva en una sartén, agregar el chorizo, las aceitunas y los tomates y freír durante dos o tres minutos.", "Agregue el ajo y el hinojo blanqueado y cocine lentamente durante unos dos minutos.", "Agregue la albahaca y sazone al gusto.", "Coloque una rodaja de berenjena en el medio de cada plato, cubra con el filete de cerdo y una cucharada de la mezcla de hinojo y chorizo.", "Adorne con ramitas de perifollo fresco."], "url": "www_bbc_co_uk_food_recipes_panfriedporksteakwit_83978", "title": "Filete de puerco frito con berenjena, chorizo ​​e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de azúcar en polvo", "pizca de copos de chile", "75ml / 2½fl oz de agua", "medio racimo de berros", "Filete de cerdo 150 g / 5½ oz, aplanado con un mazo de carne", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para la ensalada, coloque el azúcar, los copos de chile y el agua en una sartén pequeña y cocine lentamente durante 5-6 minutos o hasta que tenga una consistencia similar a la de un jarabe. Deja enfriar.", "Para hacer el cerdo frito, enrolle el filete de cerdo en aceite de oliva, sal y pimienta negra recién molida y pique en una sartén antiadherente caliente durante dos minutos por cada lado.", "Retirar del fuego y dejar reposar durante dos minutos. Rebana en cinco pedazos y coloca en el medio de un plato.", "Para servir, esparza el berro alrededor de la carne de cerdo y rocíe con el aderezo oriental."], "url": "www_bbc_co_uk_food_recipes_panfriedporkwithorie_81607", "title": "Cerdo frito con ensalada oriental", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½ oz de chuleta de cerdo", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ pimiento rojo, picado", "½ cebolla, en rodajas", "1 cucharada de ketchup de tomate", "30 ml / 1 fl oz crema doble", "salpicaduras de vino blanco"], "method": ["Caliente una sartén hasta que fume. Cepille la chuleta de cerdo con aceite y agregue a la plancha para cocinar durante seis minutos. Dé la vuelta al picar y cocine durante otros seis minutos, o hasta que se dore y se cocine completamente. Cuando se cocinan, los jugos se verán claros cuando se perforen con un cuchillo afilado. Retire del fuego y deje reposar por tres minutos.", "Para la salsa de pimienta, caliente la mantequilla en una sartén a fuego medio. Una vez que la mantequilla se ha esponjado, agregue el pimiento rojo y la cebolla y saltee durante seis minutos, hasta que se suavice.", "Transfiera el pimiento rojo y la cebolla a un procesador de alimentos y mezcle hasta conseguir un puré suave. Agregue el ketchup de tomate, la crema y el vino blanco y mezcle de nuevo brevemente para mezclar.", "Para servir, coloque el cerdo en un plato y rocíe sobre la salsa de pimienta."], "url": "www_bbc_co_uk_food_recipes_panfriedporkwithpepp_80615", "title": "Cerdo frito con salsa de pimienta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de lomo de cerdo", "2 dientes de ajo, finamente picados", "2 cucharadas de mostaza Dijon", "1 vaso de vino blanco seco", "290ml / 10fl oz de caldo de verduras", "1 limón, solo jugo", "12 hojas sabias enteras", "sal y pimienta", "½ repollo rojo, finamente picado", "2 zanahorias, ralladas", "1 cebolla española, finamente picada", "1 diente de ajo, finamente picado", "2 cucharadas de aceite de oliva", "1 limón, solo jugo", "4 cucharadas de mayonesa", "Albaricoques secos 255 g / 9 oz, en rodajas", "1 cucharada de vinagre de vino blanco", "1 cucharadita calvados", "5 cucharadas de aceite de oliva", "pizca de salvia seca o fresca"], "method": ["Remoje los albaricoques en rodajas en el vinagre de vino blanco, calavados, un poco de aceite de oliva y salvia durante 1 hora.", "Calentar el aceite de oliva en una sartén grande. Fríe los filetes de lomo de cerdo a fuego lento por ambos lados. Agregue el ajo, la mostaza, el vino y el caldo de verduras, el jugo de limón, la salvia, la sal y la pimienta y los albaricoques. Reduzca a la mitad y deje cocer a fuego lento hasta por 5 minutos (más dependiendo del grosor de la carne).", "Mezcle todos los ingredientes de la ensalada de col en un tazón grande. Sazone, tape y enfríe en el refrigerador si tiene tiempo.", "Sirva el cerdo en una cama de ensalada de col y los albaricoques en la parte superior con la salsa restante en la sartén rociada. Agregue algunas hojas de salvia para adornar."], "url": "www_bbc_co_uk_food_recipes_panfriedporkwithsage_67191", "title": "Cerdo frito con salvia, albaricoques y ensalada de col", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla mediana, cortada en cubitos", "1 cucharadita de ajo picado", "3 cucharadas de aceite de oliva", "1 berenjena, cortada en cubitos", "1 calabacín, cortado en cubitos", "1 pimiento rojo, cortado en cubitos", "pizca de chile en polvo", "2 tomates pelados, sin semillas y cortados en cubitos", "1 cucharada de hojas frescas de cilantro picadas", "¾ tsp filamentos de azafrán (empapado 1 cucharada de agua tibia)", "exprimir jugo de limón", "sal y pimienta negra molida"], "method": ["Espolvoree la berenjena con sal y déjela reposar durante 15 minutos antes de enjuagarla y secarla con un trapo (para extraer los jugos amargos).", "Suavice la cebolla y el ajo en el aceite de oliva a fuego suave.", "Agregue la berenjena cortada en cubitos, el calabacín en cubitos, el pimiento rojo cortado en cubitos y el chile en polvo.", "Revuelva y fríe durante 5-10 minutos hasta que se ablanden, sazone con sal y la pimienta negra molida.", "Agregue los tomates picados, caliente durante cinco minutos.", "Agregue el cilantro picado y hebras de azafrán empapadas.", "Enfoque con jugo de limón, vuelva a sazonar con sal y pimienta negra recién molida y sirva."], "url": "www_bbc_co_uk_food_recipes_panfriedratatouille_9975", "title": "Ratatouille frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panfriedratatouille_9975_16x9.jpg", "isVegetarian": true, "recommendations": 0}]