[{"isVegetarian": false, "title": "Baked risotto", "url": "www_bbc_co_uk_food_recipes_baked_risotto_72566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/2oz arborio risotto rice", "½ red pepper, stalk and seeds removed, chopped", "1 spring onion, trimmed, sliced", "1 heaped tbsp frozen peas", "2 small mushrooms, peeled, chopped or torn", "50g/2oz cooked leftover chicken, chopped ", "125-150ml boiling water", "large pinch stock or bouillon powder"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease a lidded ovenproof dish with a little oil and pour in the rice. Add the red pepper, spring onion, peas, mushrooms and chicken and stir until well combined.", "Pour in the boiling water and add the stock powder or bouillon. Cover the dish with the lid.", "Transfer the dish to the oven and bake for 15 minutes, or until the rice is tender. Set aside to cool slightly before serving. "]}, {"isVegetarian": false, "title": "Baked salmon with chorizo rice", "url": "www_bbc_co_uk_food_recipes_baked_salmon_with_00771", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_salmon_with_00771_16x9.jpg", "ingredients": ["100g/3½oz chorizo", "1 onion, sliced ", "1 garlic clove, sliced", "200g/7oz short-grain rice such as arborio rice", "4 tomatoes, roughly chopped", "50g/2oz butter ", "1 tbsp parsley", "600ml/20fl oz chicken stock", "salt and freshly ground black pepper", "4 x 150g/5oz salmon fillets, skinned", "250g/9oz smoked salmon", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat a heavy-based frying pan over a medium heat and fry the chorizo for 3-4 minutes, or until crisp. Remove the chorizo from the pan with a slotted spoon and set aside.", "Fry the onion and garlic in the remaining oil for 3-4 minutes, or until soft. ", "Place the chorizo, onion, garlic, rice, tomatoes, butter and parsley into a well-buttered casserole dish. Season with salt and freshly ground black pepper.", "Pour over the chicken stock, cover with a tight-fitting lid and bake in the oven for about 25-30 minutes, or until the rice is cooked.", "Meanwhile, wrap each salmon fillet in smoked salmon and trim off any excess flesh. Season with salt and freshly ground black pepper and squeeze over with the lemon juice.", "Roast the salmon pieces in the oven for 6-8 minutes, or until cooked through.", "Serve the salmon on top of the chorizo rice."]}, {"isVegetarian": true, "title": "Baked samosas", "url": "www_bbc_co_uk_food_recipes_baked_samosas_69255", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_samosas_69255_16x9.jpg", "ingredients": ["100g/4oz potatoes, peeled", "100g/4oz carrots, chopped ", "100g/4oz peas", "2 tbsp olive oil", "¼ tsp cumin seeds", "1 onion, chopped", "2 green chillies, finely chopped", "¼ tsp salt", "¼ tsp ground coriander", "pinch garam masala", "handful of coriander leaves, chopped", "300g/11oz wholemeal flour, plus a little extra for the ‘glue-like paste’ and a little extra for flouring", "2 tsp olive oil", "pinch of salt", "tomato chutney or ketchup, to serve"], "serves": "Makes approximately 12 small samosas", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the filling, boil the potatoes in a pan of boiling, salted water for about 10-15 minutes, or until tender. Drain, roughly mash the potatoes and set aside.", "Meanwhile, bring another pan of water to the boil and cook the carrots for a few minutes, drain and set aside. Bring a third pan of water to the boil and cook the peas for a few minutes, drain and set aside.", "For the filling, heat the olive oil in a pan, add the cumin seeds and after they start to splutter, add the onion and chillies. Fry for 6-7 minutes, or until softened.", "Mix in the salt, coriander and garam masala, and stir-fry for a minute. Add the carrots and peas and fry for a couple of minutes.", "Add the mashed potato and coriander leaves, and stir well until all the ingredients are blended together.", "For the pastry, place the flour, oil, salt and 6-7 tablespoons of water into a bowl.", "Using your hands, knead into a dough for 5-8 minutes.", "Mix together a little flour and water in a small bowl to make a glue-like paste. Place this mixture to one side.", "Divide the dough into golf-ball sized pieces and, on a floured surface, roll them out into thin circles about 7.5cm/5in diameter and 3mm thick, then cut each circle in half. ", "Apply the ‘glue’ to the straight edge of one semi-circle. Fold it to make a cone shape, sealing the pasted straight edge, then lift the cone with the tapered end at the bottom, and fill it with about one tablespoon of the vegetable mixture. Seal the samosa with a little more glue, pressing the edges firmly together. Repeat the process until all of the pastry has been used up.", "Place the samosas on a baking tray and put in the centre of the oven. Bake for 25-30 minutes, turning them once halfway through cooking until lightly browned.", "Serve hot with tomato chutney or ketchup."]}, {"isVegetarian": false, "title": "Baked sea bass, parsley mayonnaise and walnut truffle pesto", "url": "www_bbc_co_uk_food_recipes_baked_sea_bass_parsley_49527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["bunch fresh flatleaf parsley, leaves only", "700ml/1pint 4fl oz vegetable oil", "2 free-range egg yolks", "110ml/3½fl oz white wine vinegar", "1 tbsp English mustard", "1 lemon, juice only", "150ml/4½fl oz extra virgin olive oil", "250g/9oz walnuts", "1 garlic clove", "2 sprigs fresh thyme, leaves picked", "15g/½oz fresh black truffle", "10g/¼oz parmesan, grated", "2 tsp white truffle oil", "4 sea bass fillets, pin bones removed", "1 lemon, zest only", "2 tbsp extra virgin olive oil", "2 red endive, leaves separated and placed into iced water", "10g/½oz parsley micro cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsley mayonnaise, blend the parsley and vegetable oil in a blender until smooth. (This will take 1-2 minutes.)", "Blend the egg yolks, vinegar and mustard in a food processor until well combined. With the motor running, slowly add the parsley oil to form a thick mayonnaise. ", "Season with salt, freshly ground black pepper and a squeeze of lemon juice.", "For the walnut truffle pesto, heat the olive oil and walnuts in a frying pan over a medium heat for 4-5 minutes, or until golden brown. Set aside to cool.\r\n", "Blend the cooled walnuts and olive oil, thyme, garlic, truffle, parmesan and white truffle oil in a food processor until smooth. ", "For the seabass, preheat the oven to 200C/400F/Gas 6 and place a large oven tray in the oven. Cut out four 10cm/4in squares of greaseproof paper.", "Slice the seabass fillets at an angle into 0.5cm/¼in thick slices. Divide the slices between the squares of greaseproof paper, overlapping each slice slightly.  ", "Season with salt and lemon zest and drizzle over the olive oil. ", "Place the sea bass slices onto the preheated baking tray and roast for 2-3 minutes.", "Drain the endive leaves, pat dry and toss with some of the truffle pesto.", "To serve, place the seabass into the centre of serving plates and drizzle a little parsley mayonnaise over the top. Arrange the endive leaves around the edge and scatter over the parsley cress."]}, {"isVegetarian": false, "title": "Baked sea bream Rota-style", "url": "www_bbc_co_uk_food_recipes_baked_sea_bream_28386", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_sea_bream_28386_16x9.jpg", "ingredients": ["3 large waxy potatoes, peeled and cut into thick slices", "5 tbsp olive oil", "1 large onion, sliced", "1 garlic clove, chopped", "1 large green pepper, seeds removed, sliced", "300g/10½oz tomatoes, skinned and chopped", "1 bay leaf", "2 x 400g/14oz whole sea bream, scaled and gutted", "½ lemon, juice only", "4 tbsp dry sherry", "small handful flatleaf parsley, leaves chopped, to serve", "salt and freshly ground black pepper", "small handful flatleaf parsley, chopped", "2 large garlic cloves, roughly chopped", "½ tsp sea salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Arrange the potatoes in an ovenproof dish large enough to accommodate the sea bream. Season with salt and pepper and drizzle with 2 tablespoons oil. Bake for 20 minutes.", "In a lidded frying pan, warm 2 tablespoons oil over medium-low heat. Fry the onion, garlic and pepper for 10–15 minutes, or until soft. Add the tomatoes, bay leaf and a little water, cover with a lid and cook for 15 minutes.", "Season the fish with ½ teaspoon salt and 10 turns of the black peppermill. Place on top of the cooked potato.", "To make the picada, using a mortar and pestle, grind the parsley, garlic and salt together, then spread it over the fish. ", "Add 4 tablespoons of water and the lemon juice to the dish, then pour the tomato mixture over everything. Drizzle over the remaining oil and the sherry and bake for 20–25 minutes. Scatter the parsley over the top and serve immediately."]}, {"isVegetarian": false, "title": "Baked spider crab", "url": "www_bbc_co_uk_food_recipes_baked_spider_crab_97729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz picked spider crab meat, shell reserved", "olive oil", "3 garlic cloves, sliced", "1 banana shallot, very finely chopped", "Txacoli wine for deglazing (or use a dry, sparkling white wine)", "50ml/2fl oz brandy", "250g/9oz cherry tomatoes", "1 small sourdough, inside only (discard the crust), broken into fine breadcrumbs", "1-2 tbsp sriracha hot sauce, to taste", "50g/1¾oz butter", "small handful of chopped fresh parsley", "pinch sea salt", "500g/1lb 2oz secreto Iberico (a pork cut, taken from between the shoulder blade and the loin)", "1 free-range egg, fried, to serve", "handful of beetroot leaves, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "In a hot wok, cook the crab shell with a little olive oil for a few minutes. Remove the shell then add the garlic and shallot to the pan, with more oil if required. Cook until softened. Deglaze the pan with the wine and brandy. Tip the pan into the flame to flambé (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.). Add the cherry tomatoes and cook until they break down.", "Add the spider crab meat, breadcrumbs, hot sauce and season with salt. Heat until warm then add the butter and parsley. ", "Place back into the shell and bake until golden-brown on top.", "In a frying pan cook the secreto Iberico in a drop of oil until golden-brown and medium rare.", "To serve place the crab shell on the plate and top with the egg. Cut the pork into strips and place alongside the crab with the beetroot leaves."]}, {"isVegetarian": true, "title": "Baked stuffed apples in cider", "url": "www_bbc_co_uk_food_recipes_baked_stuffed_apples_in_20729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Bramley or Granny Smith apples", "4 tbsp raisins", "2 tbsp mincemeat", "2 tbsp ground almonds", "570ml/1 pint cider", "225g/8oz caster sugar", "175ml/6fl oz double cream", "55g/2oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Trim the base of each apple and, using a corer, take the cores out. Cut a small slit all the way round the middle of each apple horizontally.", "Mix the raisins, mincemeat and ground almonds and pack them tightly into the cores of the apples.", "Place the apples in a baking dish and pour over 450ml/16fl oz cider.", "Bake for 25–30 minutes, then leave to stand for 10 minutes.", "Pour off the cider from the dish into a saucepan and heat it to reduce it in volume until slightly syrupy. Use the syrup to glaze the apples.", "In a pan, heat the sugar and remaining cider together and bring to the boil. Reduce the heat and cook until caramelised to a golden-brown colour, then set aside to cool slightly.", "Meanwhile in a separate pan, bring the cream to the boil. Pour the cream into the syrup, add the butter and stir well. ", "Serve the baked apples with the cream syrup."]}, {"isVegetarian": false, "title": "Baked spaghetti", "url": "www_bbc_co_uk_food_recipes_baked_spaghetti_07628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 spring onion, trimmed, sliced", "2 sun-dried tomatoes, finely chopped", "3 black olives, pitted, chopped", "1 rasher bacon, cooked until crisp, chopped", "50g/2oz spaghetti", "100ml/3½fl oz boiling water", "200g/7oz canned chopped tomatoes", "pinch bouillon powder", "pinch paprika", "grated cheese, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7.", "Place the spring onions, sun-dried tomatoes, bacon and olives into a lidded ovenproof dish.", "Snap the spaghetti until the strands are short enough to fit inside the ovenproof dish. Add the spaghetti strands to the dish and pour over the boiling water and chopped tomatoes. Stir well and sprinkle over the bouillon powder and paprika.", "Cover the ovenproof dish with the lid and transfer to the oven for 25 minutes, or until the spaghetti is cooked through. ", "Set aside to cool slightly, then serve sprinkled with a little grated cheese."]}, {"isVegetarian": true, "title": "Baked sweet potato with easy black beans and purple slaw", "url": "www_bbc_co_uk_food_recipes_baked_sweet_potato_with_28134", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_sweet_potato_with_28134_16x9.jpg", "ingredients": ["1 medium sweet potato (about 350g/12oz), washed and dried", "2 tbsp olive oil", "½ small onion, finely chopped", "1 garlic clove, finely chopped", "1 tsp cumin seeds", "pinch chilli flakes, to taste", "400g tin black beans, drained", "100ml/3½fl oz vegetable stock, from a cube", "salt and freshly ground black pepper", "25g/1oz cheddar, grated, to serve", "¼ small red cabbage, thinly sliced", "5 radishes, thinly sliced", "½ red onion, thinly sliced", "few sprigs coriander, roughly chopped", "½ lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and place a sheet of kitchen foil on the middle shelf.", "Rub the sweet potato all over with half a teaspoon of the olive oil and some salt. Pierce the skin several times with a sharp knife and place directly onto the top shelf of the oven and bake for 1 hour.", "Meanwhile, heat the remaining olive oil in a small saucepan over a medium heat and fry the onion and garlic for 2 minutes. Add the cumin and chilli flakes and fry for a further 2 minutes until soft and fragrant. Add the black beans and stock and simmer gently for 20–30 minutes or until the liquid has evaporated and the beans are soft and starting to disintegrate. Season with salt and pepper and set aside. ", "For the purple slaw, mix the cabbage, radishes, onion, coriander and lime juice in a bowl and season with salt and pepper. ", "Check the potato is cooked through by piercing with a blunt knife. When it is done, turn the oven off and leave the potato in for 15 minutes while you reheat the beans.", "To serve, break the potato open and fluff up the flesh with a fork. Spoon over a generous helping of beans and top with the cheese. Serve with the slaw on the side. "]}, {"isVegetarian": true, "title": "Baked sweet potato with roasted vegetables and bulgur wheat", "url": "www_bbc_co_uk_food_recipes_baked_sweet_potato_with_42313", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_sweet_potato_with_42313_16x9.jpg", "ingredients": ["1 medium sweet potato (about 350g/12oz), washed and dried", "2 tbsp olive oil", "½ fennel bulb, thinly sliced", "½ red pepper, cut into 2cm/¾in cubes", "½ red onion, cut into wedges", "small handful cherry tomatoes", "50g/1¾oz bulgur wheat", "2 sprigs dill, roughly chopped", "salt and freshly ground black pepper", "2 tbsp natural yoghurt, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and place a sheet of kitchen foil on the middle shelf. ", "Rub the sweet potato with half a teaspoon of the olive oil and some salt. Pierce the skin several times with a sharp knife, place directly onto the top shelf of the oven and bake for 1 hour. ", "Meanwhile, place the vegetables in a medium-sized roasting tray, drizzle with the remaining olive oil and mix well. Season with salt and pepper and roast for 20–25 minutes or until soft and starting to brown at the edges. ", "Put the bulgur wheat into a heatproof bowl and pour in just enough boiling water to cover, wrap the bowl tightly with cling film and leave to stand for 30 minutes. ", "Check the potato is cooked through by piercing with a blunt knife. When it is done, turn the oven off and leave the potato in for 15 minutes while you assemble the topping. ", "Fluff up the bulgur wheat with a fork, then tip it into the tray with the roasted vegetables and mix well to combine. Add the dill and mix again. ", "To serve, break the potato open and fluff up the inside with a fork, top with the bulgur wheat and vegetable mixture and a dollop of natural yoghurt.   "]}, {"isVegetarian": true, "title": "Baked vanilla tart with Earl Grey prunes", "url": "www_bbc_co_uk_food_recipes_baked_vanilla_tart_with_20763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_vanilla_tart_with_20763_16x9.jpg", "ingredients": ["125g/4½oz prunes  ", "500ml/17fl oz hot Earl Grey tea (use 4 tea bags)", "250g/9oz plain flour, plus extra for dusting", "45g/1¾oz icing sugar", "pinch salt", "75g/2¾oz chilled unsalted butter, diced, plus extra for greasing ", "2 free-range egg yolks, beaten", "15g/½oz ground almonds ", "750ml/1¼ pints double cream ", "2 vanilla pods or 2 tsp vanilla extract", "12 free-range egg yolks", "125g/4½oz caster sugar"], "serves": "Serves 8-10", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Earl Grey-soaked prunes, place the prunes into a bowl and pour over the hot tea. Cover and set aside until the prunes have absorbed the liquid (about an hour). ", "For the pastry, sift the flour, icing sugar and salt into a large mixing bowl. Add the butter and rub it into the flour mixture using your fingertips, until the mixture resembles breadcrumbs. (Alternatively, blend to a crumb-like consistency in a food processor.) ", "Add the beaten egg yolks (reserving a little for glazing) and ground almonds and stir or mix with your hands until the mixture just comes together as a dough. Try not to overwork the dough. Wrap the dough in cling film and chill in the fridge for at least 30 minutes and up to one hour. ", "Preheat the oven to 160C/325F/Gas 3. Grease a 28cm/11in loose-bottomed tart tin with butter and dust with flour. ", "Roll the dough out on a lightly floured work surface to a thickness of approximately 2mm, taking care not to tear it. Carefully roll the pastry around the rolling pin and line the prepared tart tin with it, pressing the pastry lightly into the base and sides (leave any excess overhanging). ", "Line the pastry case with baking paper then fill with uncooked rice or baking beans. Bake the tart case in the oven for 10 minutes, then remove the baking paper and baking beans and brush the base with beaten egg yolk. Return the tart case to the oven to bake for a further 5-10 minutes, or until crisp and golden-brown. Set aside to cool, then trim away any overhanging pastry. ", "For the vanilla filling, heat the cream and vanilla pods or extract in a saucepan over a medium heat until just coming up to the boil. Whisk the eggs and sugar in a bowl until pale and fluffy. ", "Gradually pour the hot cream over the egg mixture, whisking well to combine, then return the mixture to the saucepan and cook over a low heat until it has thickened enough to coat the back of a spoon. ", "Pour the vanilla filling into the pastry case and bake in the oven for 20-25 minutes, or until the filling has set. ", "To serve, slice the tart and top each portion with the Earl Grey-soaked prunes."]}, {"isVegetarian": false, "title": "Baked Welsh cake cheesecake", "url": "www_bbc_co_uk_food_recipes_baked_welsh_cake_68115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_welsh_cake_68115_16x9.jpg", "ingredients": ["450g/1lb self-raising flour, plus extra for dusting", "pinch salt", "120g/4½oz lard", "120g/4½oz butter", "120g/4½oz caster sugar, plus extra for sprinkling", "50g/1¾oz white chocolate drops", "75g/2½oz dried cranberries, chopped", "2 free-range eggs, beaten", "1-2 tbsp milk, if needed", "12–14 digestive biscuits, or 15 small shortbreads", "50g/1¾oz butter, plus extra for greasing", "½ tsp ground cinnamon", "½ tsp ground nutmeg", "600g/1lb 5oz cream cheese", "2 tbsp plain flour", "175g/6oz caster sugar", "3 drops vanilla essence", "2 free-range eggs", "1 free-range egg yolk", "142g/5oz soured cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the Welsh cakes, tip the flour into a large bowl and add the salt. Rub the lard and butter into the flour until the mixture resembles breadcrumbs. Stir in the caster sugar, then add the white chocolate and cranberries and mix until well combined. Add the eggs and mix with your hands until the mixture comes together in a smooth dough, adding milk if needed to loosen the dough. Roll the mixture out on a floured work surface to a thickness of 6mm/¼in. ", "Cut circles from the dough using a 5cm/2in pastry cutter – this mixture should make about 50.", "Grease a heavy frying pan with butter and heat over a high heat. Once hot, reduce the heat, place a few Welsh cakes into the hot pan and cook for 1-2 minutes on each side, or until golden-brown. Keep an eye on the heat, increasing or decreasing as necessary. If  the pan is too cool the Welsh cakes will spread, if too hot, they will burn on the outside. ", "Once the Welsh cakes are cooked, place them onto greaseproof paper sprinkled with caster sugar. Sprinkle with caster sugar and set aside to cool. Repeat with the remaining Welsh cakes.", "For the cheesecake, preheat the oven to 180C/350F/Gas 4. Put the digestive biscuits in a freezer bag and crush them gently with a rolling pin. Melt the butter in pan and mix in the crushed biscuits and spices. Press this mixture into a 23cm/9in springform tin and bake for 5–10 minutes, then set aside to cool.", "Whisk the cream cheese, flour, sugar, vanilla essence, eggs, egg yolk and soured cream in a bowl until well combined.", "Cut up four or five of the Welsh cakes into chunky pieces and gently fold them into the mixture. Arrange some of the remaining Welsh cakes over the biscuit base until it is covered and then pour the cream cheese mixture on top. Bake for 35-40 minutes or until the cheesecake is slightly wobbly in the centre but able to hold its shape.", "Leave to cool in the tin and serve in slices, warm or cold."]}, {"isVegetarian": false, "title": "Baked whole trout with a watercress salsa verde", "url": "www_bbc_co_uk_food_recipes_baked_whole_trout_with_a_74289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole trout, scaled and gutted", "½ bunch tarragon", "1 lemon, sliced", "150g/5½oz watercress leaves ", "3 tbsp chopped fresh flatleaf parsley", "2 large spring onions, roughly chopped", "1 garlic clove, roughly chopped", "1 lemon, zest only", "2 tbsp capers, rinsed and drained", "2 tbsp dried breadcrumbs", "3 tbsp extra virgin olive oil", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Stuff the cavity of the fish with the tarragon and lemon slices. Place in the oven for 20-30 minutes (depending on the size of the fish), or until cooked through.", "Meanwhile, bring a small pan of salted water to the boil. Add the watercress leaves and cook for a minute. Drain and refresh the watercress in ice-cold water.", "Transfer the watercress to a food processor, add the remaining ingredients and process to a purée. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the whole trout on a large plate and peel back the skin. Pour over the salsa verde."]}, {"isVegetarian": true, "title": "Baked apple Alaska", "url": "www_bbc_co_uk_food_recipes_bakedapplealaska_86907", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint red wine", "55g/2oz brown sugar", "1 vanilla pod, split and seeds scraped out", "½ apple, cored, peeled and sliced thickly", "4 free-range egg whites", "225g/8oz caster sugar", "1 tbsp honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the red wine in a small saucepan and simmer until its volume is reduced by half.", "Add the sugar, vanilla pod and seeds and apple slices and simmer for 4-5 minutes, or until the apple softens but still holds it's shape. Spoon into a dessert bowl.", "Whisk the egg whites in a clean bowl until stiff peaks form when the whisk is removed.", "Beat the caster sugar in gradually until the mixture is thick and glossy.", "Spoon the egg white mixture over the bowl to completely cover the apple mixture, then drizzle over the honey.", "Use a mini-blowtorch to brown the meringue all over. Serve immediately."]}, {"isVegetarian": true, "title": "Baked apples", "url": "www_bbc_co_uk_food_recipes_bakedapples_84332", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedapples_84332_16x9.jpg", "ingredients": ["80g/3oz mixed dried exotic fruit, (such as mango, papaya, banana, fig, golden raisins), chopped", "55ml/2fl oz brandy", "30g/1oz soft light brown sugar", "½ tsp allspice", "100g/3½oz butter, plus extra for spreading", "6 eating apples, cored", "200g/7oz Greek yoghurt, to serve"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Place the mixed dried fruit and the brandy into a bowl and leave to soak for at least two hours, but ideally overnight.", "After soaking, add the sugar, allspice and butter to the brandy-soaked fruit.", "Spoon the fruit mixture into the holes in the cored apples, pressing in to fill well and spread some more butter over the apples.", "Place the stuffed apples into an ovenproof dish, cover with aluminium foil and transfer to the oven to bake for 40 minutes.", "Remove the foil and cook 15-20 minutes more, until the apples are soft, but not collapsing.", "Place onto plates and serve with a dollop of Greek yoghurt."]}, {"isVegetarian": true, "title": "Baked apples with Calvados sauce", "url": "www_bbc_co_uk_food_recipes_bakedappleswithcalva_93269", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedappleswithcalva_93269_16x9.jpg", "ingredients": ["4 Reines des Reinettes apples, or similar russet apples, washed, dried", "60g/2½oz unsalted butter, melted", "4 tbsp caster sugar", "50g/2oz caster sugar", "20g/¾oz unsalted butter", "40g/1½oz Braeburn apple, peeled, cut into 0.5cm/¼in dice", "80ml/3¼oz apple juice", "½ tsp arrowroot, diluted in a little water", "1 tsp Calvados", "15g/½oz bread, cubed", "15g/½oz icing sugar", "15g/½oz pistachio nuts", "10g/¼oz whole almonds", "5g flaked almonds ", "1-2 tsp Calvados"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked apples, preheat the oven to 170C/350F/Gas 4.", "Cut the bases off any apples that do not sit flat, making sure not to remove too much of the base. Remove the cores from the apples, using an apple corer or a small sharp knife.  ", "Brush a shallow ovenproof dish with some of the melted butter and sprinkle over some of the sugar. Brush each apple with the remaining melted butter, then roll them in the remaining caster sugar. Place the apples into the ovenproof dish and bake in the oven for 30 minutes. If possible cook the apples in without fan assisted heat as this is too intense and will burst the skin of the apple before it is cooked.", "For the Calvados sauce, heat the sugar in a small saucepan over a medium heat until it reaches a dark golden caramel. ", "Stir in the butter and add the diced apples , cook for 30 seconds, without moving the pan (use a spoon to cover the apples in the caramel mixture).", "Add the apple juice and bring to the boil.", "Stir in the diluted arrowroot a little at a time, until it has thickened slightly, then remove from the heat and add the Calvados.", "For the garnish, mix together the bread cubes and half of the icing sugar. Sprinkle the mixture onto a baking tray.", "Mix the pistachios, whole and flaked almonds, Calvados and the remaining icing sugar together until well combined. Spread the mixture onto the same baking tray.", "Bake in the oven for 8-10 minutes, or until the nuts and bread cubes are golden-brown. Set aside to cool.", "To serve, place one baked apple into the centre of each of four serving plates. Spoon the Calvados sauce into the centre and sprinkle over the toasted garnishes."]}, {"isVegetarian": false, "title": "Baked apple with raisins and custard", "url": "www_bbc_co_uk_food_recipes_bakedappleswithraisi_84469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp soft brown sugar", "30g/1oz butter", "20g/¾oz raisins", "honey, to drizzle", "½ apple, cored", "150ml/6fl oz milk", "150ml/6fl oz double cream", "40g/1½oz caster sugar", "1 tsp vanilla essence", "2 free-range egg yolks"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the butter, raisins, brown sugar and honey into a bowl and mix together.", "Place the apple onto a baking sheet and stuff with the butter mixture.", "Cook in the oven for eight minutes.", "For the custard, warm the milk and cream in a saucepan over a medium heat.", "Place the sugar, vanilla and eggs into a bowl and thoroughly mix together. While stirring, gradually add the creama and milk the over a low heat. Stir constantly, until the custard slightly thickens.", "To serve, place the apple on a serving plate and pour the hot custard around."]}, {"isVegetarian": true, "title": "Baked apple with calvados sabayon", "url": "www_bbc_co_uk_food_recipes_bakedapplewithcalvad_84613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small Bramley apple, halved, cores removed", "50g/1¾oz butter", "1 tbsp soft brown sugar", "1 tsp calvados", "4 free-range eggs", "1 tbsp caster sugar", "1 tsp calvados", "2 tsp hot water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the baked apple, cut a thin slice off the bottom of each apple half so that the apple can sit level on a plate. ", "Heat the butter in a small oven-proof frying pan until it has melted.  Add the apple halves and cook, turning once until they are brown on both sides. ", "Add the sugar and calvados and stir until the sugar has melted and cook for one minute. Transfer the frying pan to the oven and cook for eight minutes.", "For the sabayon, place the eggs, sugar, calvados and water into a bowl that fits snugly over a pan of boiling water. (Note: The boiling water in the pan must not touch the bottom of the bowl). Whisk the ingredients continuously until the mixture thickens to a consistency where soft peaks are almost formed when the whisk is removed.", "To serve, place the apples on a clean plate and top with the sabayon."]}, {"isVegetarian": true, "title": "Baked apple with custard", "url": "www_bbc_co_uk_food_recipes_bakedapplewithcustar_85400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz raisins", "30g/1oz butter", "1 tbsp clear honey", "1 orange, zest only", "1 apple, cored", "5 tbsp milk", "5 tbsp double cream", "2 tbsp caster sugar", "1 free-range egg", "1 free-range egg yolk"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked apple, place the raisins, butter, honey and orange zest into a small bowl and mix well.", "Place the apple onto a microwave-proof plate and stuff the raisin mixture into the hole left by removing the core.", "Cook in the microwave on high for 3½ minutes, or until softened.", "For the custard, place the milk and cream into a saucepan and bring up to the boil. Remove from the heat and allow to cool slightly.", "Place the egg and egg yolk and the sugar into a bowl and mix well. Gradually pour the milk and cream over the egg mixture, then return the mixture to the pan over a gentle heat. Stir constantly until the custard starts to thicken. When it coats the back of a spoon, remove from the heat and pour through a sieve into a jug or bowl.", "To serve, place the baked apple onto a plate and pour over the custard."]}, {"isVegetarian": true, "title": "Baked sticky toffee pudding with toffee sauce", "url": "www_bbc_co_uk_food_recipes_baked_sticky_toffee_28166", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter, plus extra for greasing", "150g/5½oz soft dark brown demerara sugar", "175g/6oz pitted dried dates", "1 tbsp golden syrup", "2 tbsp black treacle", "1 tbsp vanilla bean paste", "2 free-range eggs", "200g/7oz self-raising flour, plus extra for dusting", "1 tbsp bicarbonate of soda", "200ml/7fl oz double cream", "80g/2½oz butter", "100g/3½oz soft dark brown sugar", "1 tbsp black treacle", "1 tbsp golden syrup"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 2000C/180C Fan/Gas 6. Grease a 20cm/8in square cake tin with butter and dust with flour.", "Blend the butter and sugar together in a freestanding mixer with a whisk attachment or using a hand-held whisk until fluffy.", "Put the dates and 300ml/10fl oz water in a saucepan and bring to the boil. ", "Gradually add the golden syrup, treacle, vanilla and eggs to the butter mixture and mix thoroughly. Turn the mixer down to a slow speed and add the flour. Once all the ingredients are combined, turn off the mixer.", "Purée the water and date mixture and add the bicarbonate of soda. Quickly stir this into the batter while it is still hot.", "Once the mixture is combined, pour it into the buttered and floured cake tin and bake for 40–45 minutes until the top is firm to the touch. Leave the pudding to cool in the tin. ", "Meanwhile, to make the sauce place the cream in a saucepan and add the butter and sugar and melt. Whisk in the syrup and treacle.", "To serve, cut the pudding into squares and serve with the toffee sauce. "]}, {"isVegetarian": true, "title": "Baked aubergine rolls filled with mozzarella", "url": "www_bbc_co_uk_food_recipes_bakedauberginerollsf_71302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large aubergine, cut lengthways into 6 slices about 5mm/¼ inch thick", "2 tbsp plain flour", "2 eggs, lightly beaten with some salt and pepper", "olive oil for frying", "40g/1½oz parmesan cheese (or a similar vegetarian hard cheese), freshly grated", "18 large fresh basil leaves ", "300g/11oz mozzarella cheese, roughly sliced", "salt ", "freshly ground black pepper", "4 tbsp extra virgin olive oil", "1 garlic clove, finely chopped", "1 small onion, finely chopped", "½ celery stalk, finely chopped", "400g/14oz tin of plum tomatoes", "leafy green salad"], "serves": "Serves 2-3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the tomato sauce, heat the olive oil in a saucepan, add the garlic, onion and celery and sweat until softened.  Stir in the tomatoes, season with salt and pepper, then cover the pan and simmer gently for 25 minutes.", "Preheat the oven to 200C/400F/Gas 6. ", "Dust the aubergine slices in the flour, then dip them in the beaten egg.  ", "In a large frying pan, heat some olive oil to a depth of about 1 cm/½ inch, add the aubergine slices and fry on both sides until golden.  Remove and drain on kitchen paper.  ", "Line the aubergine slices up on a large chopping board, season with salt and pepper, then evenly sprinkle 25g/1oz of the parmesan over the top.  ", "Place three basil leaves on each aubergine slice and top with a couple slices of mozzarella, reserving half the cheese.  The carefully roll each slice up, making sure they are seam-side downwards so they don't open up.", "Line a large ovenproof dish (or individual ones) with some of the tomato sauce and place the aubergine rolls on top.  ", "Spoon over the remaining tomato sauce and top with the remaining mozzarella slices and parmesan.  ", "Place in the oven and bake for 15 minutes, until the top is very lightly coloured and beginning to bubble. Serve with a green salad."]}, {"isVegetarian": false, "title": "Baked avocado and mustard chicken", "url": "www_bbc_co_uk_food_recipes_bakedavocadoandmusta_87754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small skinless chicken breast", "salt and freshly ground black pepper ", "1 tbsp olive oil", "½ avocado, stone removed", "1 tbsp olive oil", "pinch sugar", "1 tsp Dijon mustard", "2 tsp white wine vinegar", "salt and freshly ground black pepper", "55g/2oz cherry tomatoes, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat a griddle pan until very hot.", "Season the chicken breast with salt and freshly ground black pepper. Brush the breast with a little of the olive oil and then place the chicken breast into the griddle pan. Cook for 8-10 minutes, or until completely cooked through.", "Meanwhile, place the avocado into a small ovenproof frying pan and place into the oven to bake for 5-6 minutes, or until heated through. Remove from the oven and, when cool enough to handle, carefully peel off the skin.", "For the mustard dressing, place the olive oil, sugar, mustard and vinegar into a screw-topped jar. Season generously with salt and freshly ground black pepper, screw on the lid well and shake until the dressing is emulsified.", "Cut the cherry tomatoes in half and arrange on a plate. Slice the baked avocado and arrange over the top of top of the tomatoes, then add the seared chicken. Spoon over the mustard dressing and serve."]}, {"isVegetarian": false, "title": "Baked bass with creamed leeks", "url": "www_bbc_co_uk_food_recipes_bakedbasswithcreamed_88654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ sea bass fillet, skin scored", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ lemon, juice only", "25g/1oz butter", "1 leek, sliced into rounds", "75ml/2½fl oz double cream", "1 tbsp olive oil", "1 garlic clove, finely chopped", "85g/3oz wild mushrooms, such as oyster, chanterelles, porcini etc, cleaned and chopped", "1 vine tomato, chopped", "½ lemon, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the baked sea bass, season the fish well with salt and freshly ground black pepper and place on a baking sheet. Drizzle over the olive oil and lemon juice and bake in the oven for 6-8 minutes, or until cooked through.", "For the creamed leeks, heat the butter in a frying pan and gently fry the leeks for five minutes, until they start to soften.", "Add the cream and simmer for about 4-5 minutes, until the leeks are soft and the cream has reduced slightly.", "For the tomato and mushroom sauce, heat the oil in a pan and gently fry the garlic and mushrooms for 4-5 minutes. Add the tomatoes and simmer for a further 3-4 minutes. At the end of cooking, stir in the lemon juice.", "To serve, spoon a pile of the creamed leeks into the centre of a serving plate. Place the roasted bass on top and drizzle over the tomato and mushroom sauce."]}, {"isVegetarian": false, "title": "Baked blue cheese fondue", "url": "www_bbc_co_uk_food_recipes_bakedbluecheesefondu_87200", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small blue cheese in a wooden box", "1 clove garlic, thinly sliced", "1 tbsp fresh thyme leaves", "1 tbsp honey ", "3 slices bread", "2 tbsp olive oil"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Remove the cheese from the wooden box. Remove and discard any paper or wax wrapping then return the cheese to its box. Place the cheese in its box onto a non-stick baking tray lined with aluminium foil.", "Use a small, sharp knife to make several incisions in the top if the cheese. Insert the garlic slices into the incisions, scatter over the thyme leaves and drizzle with the honey.", "Transfer to the oven and bake for ten minutes or until the middle of the cheese is hot and melting.", "Meanwhile, heat a griddle pan. Generously drizzle both sides of the bread slices with olive oil, add to the griddle pan and cook on both sides until toasted and lightly charred. Remove from the pan and slice or tear into bite-sized pieces.", "To serve, place the cheese, still in its box, onto a serving plate. Place the griddled bread alongside for dipping."]}, {"isVegetarian": true, "title": "Baked cheese", "url": "www_bbc_co_uk_food_recipes_bakedcheese_79377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 réblochon cheese (or other cheese in a box)", "1 sprig fresh rosemary", "2 slices bread", "1 tbsp olive oil"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Spear the cheese with the rosemary sprig. Place on a baking sheet and place in the oven to bake for ten minutes, or until the cheese is melted and hot inside.", "Meanwhile, heat a griddle pan. Add the bread and toast for 1-2 minutes on each side. Remove the toast and brush with the olive oil.", "To serve, place the melted cheese in the centre of a plate, surrounded by the toast pieces."]}]