[{"ingredients": ["500g / 1lb 2 oz de harina blanca, más extra para espolvorear", "2 huevos de gallinas camperas, golpeados", "1 cucharadita de sal", "1 cucharadita de azúcar", "2 cucharadas de leche condensada sin azúcar", "150ml / 5fl oz de leche entera", "Mantequilla 110g / 4oz, derretida", "2 cucharadas de aceite de girasol", "1 cebolla, pelada y picada", "1 chile rojo, cortado, semillas retiradas", "2 dientes de ajo", "4cm / 1½ en pieza de jengibre fresco, pelado", "2 cucharadas de aceite de girasol", "12 hojas frescas de curry (disponibles en algunos supermercados y tiendas de comestibles asiáticas)", "1 cucharadita de semillas de mostaza negra", "½ cucharadita de polvo de methi (fenogreco molido)", "pellizcar asafoetida", "1 cucharada de agua", "½ cucharadita de cúrcuma molida", "500g / 1lb 2 oz de langostinos tigre jumbo, cabezas retiradas, sin espinas, cola intacta, mariposa", "200ml / 7fl oz de leche de coco", "1 lima, solo jugo", "4 cucharadas de hojas de cilantro fresco picado", "1 lima, cortada en cuñas"], "method": ["Para los parathas, mezcle la harina, los huevos, el azúcar, la sal y la leche condensada en un procesador de alimentos (equipado con una cuchilla de masa) hasta que estén bien combinados.", "Poco a poco agregue la leche entera en una corriente delgada, mezclándose continuamente, hasta que la mezcla se una como una masa suave.", "Envuelva la masa en una película adhesiva y enfríe en la nevera durante al menos una hora.", "Cuando la masa se haya enfriado, apáguela sobre una superficie de trabajo ligeramente enharinada. Haga bolitas pequeñas con forma de bola de golf en forma de bolas con sus manos y luego gírelas en discos finos utilizando un rodillo.", "Cepille los discos de masa con mantequilla derretida con un cepillo de pastelería.", "Dobla un disco de masa con fuerza en forma de acordeón. (Nota: no permita que la concertina se despliegue en abanico. Los pliegues deben estar a 1cm / ½ pulgada de distancia).", "Con el lado más delgado de la concertina mirando hacia arriba, forme la concertina de la masa en una bobina, metiendo el extremo exterior de la bobina en el centro de la bobina.", "Apriete ligeramente la bobina de masa en una bola, luego extiéndala con un rodillo, hasta que el disco tenga 0.5cm / ¼ de grosor y 15cm / 6in de diámetro.", "Repita el proceso con los discos de repostería restantes.", "Caliente el aceite de girasol en una sartén a fuego medio. Agregue los parathas de a uno por vez y fríalos durante 1-2 minutos en cada lado, o hasta que estén crujientes y dorados en el exterior y suaves y con escamas en el interior. Mantener caliente", "Para las gambas en coco, mezcle la cebolla, el chile, el ajo y el jengibre en una pasta en un procesador de alimentos.", "Calentar el aceite de girasol en una sartén a fuego medio, agregar las hojas de curry, las semillas de mostaza y el polvo de methi y freír durante 20-30 segundos, o hasta que esté fragante.", "Agregue la cebolla, el chile y la pasta de ajo y fría por 1-2 minutos.", "Agregue el agua, la cúrcuma y las gambas y cocine durante 1-2 minutos o hasta que las gambas estén rosadas y el agua se haya evaporado, revolviendo bien para cubrir las gambas en la mezcla de especias.", "Agregue la leche de coco y sazone, al gusto, con sal y pimienta negra recién molida. Llevar la mezcla a fuego lento durante 1-2 minutos, o hasta que el coco se haya calentado y las gambas estén cocidas. Exprime el jugo de lima.", "Para servir, divida los parathas entre cuatro platos para servir. Coloque las gambas en coco al lado. Adorne con el cilantro picado y las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_keralaparathasandsou_90784", "title": "Kerala parathas y gambas tigre del sur de la India en coco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "2 cucharaditas de semillas de mostaza", "20 hojas frescas de curry", "4 pizcas asafoetida", "4 cucharaditas de comino molido", "1 cucharadita de cúrcuma molida", "1 cucharadita de semillas de fenogreco", "2 cucharadas de pasta de tamarindo lista para usar", "4 chiles verdes frescos, finamente cortados en cubitos", "4 cucharaditas de jengibre fresco y picado", "2 cebollas, peladas, finamente picadas", "4 dientes de ajo, pelados, finamente cortados en cubitos", "1kg / 2lb 2 oz grandes gambas tigre, cabezas y cáscaras eliminado, sin espinas", "110g / 4oz de coco fresco, cáscara eliminada, finamente rebanada", "2 limas, solo jugo", "4 cucharadas de hojas de cilantro fresco picado", "sal y pimienta negra recién molida", "250g / 9oz de arroz de grano corto, cocido al vapor según las instrucciones del paquete, para servir"], "method": ["Para las gambas de Kerala, caliente un wok grande a fuego alto. Cuando el wok esté caliente, agrega el aceite y el fuego hasta que solo fumes.", "Agregue las semillas de mostaza y las hojas de curry y saltee durante 2-3 minutos, o hasta que las semillas comiencen a reventar. (PRECAUCIÓN: Las semillas salpicadas pueden ser peligrosas. Cubra la bandeja con una tapa y manténgala bien alejada de los ojos y la cara).", "Agregue las especias y mezcle bien. Continúe freír durante un minuto más, luego agregue la pasta de tamarindo, los chiles y el jengibre y saltee durante 1-2 minutos.", "Agregue la cebolla y fríalos hasta que estén dorados, aproximadamente 2-3 minutos.", "Agregue el ajo y saltee por otros 20 segundos.", "Agregue las gambas, revuelva bien para cubrirlas con la mezcla de especias, luego continúe sofreyendo por 4-5 minutos o hasta que las gambas estén cocidas. (NB: los langostinos se cocinan cuando la carne es rosada.)", "Agregue el coco rebanado, el jugo de lima y las hojas de cilantro hasta que estén bien combinadas, luego sazone al gusto con sal y pimienta negra recién molida. Caliéntelo por un minuto.", "Para servir, divide los langostinos Kerala por igual entre cuatro platos para servir. Ponga el arroz al vapor al lado."], "url": "www_bbc_co_uk_food_recipes_keralaprawns_92902", "title": "Gambas de Kerala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas digestivas de 175g / 6oz (o galletas de jengibre)", "80g / 3oz de mantequilla, derretida", "50 g / 2 oz de azúcar en polvo", "1 x 400 g / 14 oz de leche condensada", "100ml / 3½fl oz de zumo de lima recién exprimido (aproximadamente 3 limas)", "1 lima, ralladura solamente, finamente rallada", "75 ml / 2½ fl oz de flor de saúco cordial (uno que tiene una relación de dilución de 1 a 10)", "3 yemas de huevo de gallinas camperas", "Crema doble de 200 ml / 7 fl oz", "azúcar glas, al gusto", "ramitas de menta, para adornar"], "method": ["Para la base de galletas, triture finamente los bizcochos colocándolos en una bolsa de plástico sellada y golpeando con un rodillo (alternativamente, pulse en migas con un procesador de alimentos). Transfiera a un recipiente para mezclar y agregue el azúcar, revolviendo bien para combinar.", "Vierta la mantequilla derretida sobre las migas de galleta y mezcle hasta que esté bien combinada. Coloque la mezcla de migas en una lata de pastel con forma de resorte de 23 cm / 9 pulg. Y presione la lata uniformemente con los dedos. Acumula los lados de la corteza a una altura de aproximadamente 4 cm / 1½ pulg. Coloque en la nevera durante 20 minutos o hasta que esté firme.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Para el relleno, en un tazón grande mezcle la leche condensada con el jugo de lima, la ralladura de limón, el cordial de flor de saúco, las yemas de huevo y la mitad de la crema hasta que la mezcla se espese.", "Vierta la mezcla en la masa del pastel, déle un poco de lata a la lata para nivelar la parte superior y hornee durante 15-20 minutos. El pastel está listo cuando el relleno tiene una ligera oscilación.", "Dejar enfriar durante media hora en la bandeja para hornear, luego enfriar el pastel en el refrigerador el mayor tiempo posible.", "Cuando esté listo para servir, batir la crema restante con azúcar glas, al gusto. Tenga cuidado de no sobrepasarlo; la crema debe permanecer suave y ondulada. Coloque la crema batida en la parte superior del pastel.", "Servir en rodajas con unas hojas de menta para adornar."], "url": "www_bbc_co_uk_food_recipes_key_lime_and_elderflower_59661", "title": "Tarta de lima y sauco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/key_lime_and_elderflower_59661_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal o manteca de cerdo", "300 g / 10½ oz de cerdo, preferiblemente paleta de cerdo, en cubitos", "300 g / 10½oz de ternera guisada en cubitos", "300 g / 10½ oz de cordero o cordero, preferiblemente filete de hombro o cuello, cortado en cubitos", "2 cebollas en rodajas", "2 zanahorias, cortadas en trozos (opcional)", "2 cucharaditas de pimienta negra", "1 cucharadita de bayas de pimienta de Jamaica (opcional)", "3 hojas de laurel (opcional)", "sal y pimienta recién molida", "puré de patatas", "mermelada de lingonberry"], "method": ["Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Calentar el aceite en una sartén grande. Dore toda la carne a fondo, en tandas si es necesario.", "Pon una capa de carne en el fondo de una cazuela grande. Espolvorea sobre una capa de cebollas y zanahorias (si se usa). Espolvoree sobre algunos de los granos de pimienta negra, las bayas de pimienta de Jamaica y las hojas de laurel (si se usan). Sazonar con sal. Continúe con estas capas, recordando sazonar con sal y pimienta, hasta que haya agotado todos los ingredientes.", "Agregue suficiente agua fría para cubrir casi la capa superior de ingredientes. Llevar a ebullición y luego poner en el horno. Cocine por al menos 2 horas, preferiblemente más tiempo, esto puede cocinarse fácilmente por hasta 6 horas. Verifique regularmente si la carne está tierna.", "Sirva con puré de patata y mermelada de arándano rojo."], "url": "www_bbc_co_uk_food_recipes_keralian_hotpot_28584", "title": "Kotelian Hotpot", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas digestivas llanas o dulces 375g / 12oz, aplastadas", "150g / 5oz de mantequilla sin sal", "ralladura rallada y jugo de 8 limas grandes", "570ml / 1 pinta de crema doble", "1 x 397g / 14oz puede leche condensada azucarada", "ralladura de cal cristalizada, para decorar"], "method": ["Derrita la mantequilla en una sartén pequeña y agregue los bizcochos triturados. Presione ligeramente en la base de una lata acanalada aflautada de 23cm / 9pulg profunda. Enfríe mientras prepara el relleno.", "Para preparar el relleno: coloque el jugo de lima en un tazón grande, agregue la crema y la leche condensada. Batir durante 1-2 minutos. Agregue la ralladura de lima y revuelva ligeramente. Verter sobre la base de galletas preparada. Coloque en una bandeja y enfríe en la nevera durante 1-2 horas.", "Decorar con ralladura de lima cristalizada y servir."], "url": "www_bbc_co_uk_food_recipes_keylimepie_5493", "title": "Pastel de lima", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas de 175g / 6oz", "80g / 3oz de mantequilla", "50 g / 2 oz de azúcar en polvo", "3 huevos grandes de gallinas camperas, separados", "2 limas, ralladura finamente rallada", "125ml / 4½fl oz de jugo de limón", "210ml / 7½fl oz de leche condensada", "Azúcar en polvo 80g / 3oz", "½ cucharadita de extracto de vainilla", "pizca de sal", "½ cucharadita de crema de tártaro", "puñado de arándanos frescos", "crema batida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la base de pastelería, triture finamente los bizcochos colocándolos en una bolsa de plástico y golpeándolos con un rodillo (alternativamente, pulse en migas con un procesador de alimentos). Transfiera a un tazón para mezclar.", "Derrita la mantequilla en una cacerola, luego vierta sobre las migas de galletas. Agregue el azúcar, luego mezcle bien para combinar. Distribuya uniformemente la mezcla de galletas en una caja de pastel de 23 cm / 9 pulg., Asegurándose de cubrir los lados de la lata también. Nivele cualquier exceso de mezcla de galletas.", "Para el relleno, bata las yemas de huevo en un tazón hasta que estén pálidas y esponjosas. En un recipiente aparte, mezcle la ralladura de lima, el jugo de lima y la leche condensada hasta que quede suave y cremoso, luego mezcle con la mezcla de yema de huevo. Vierta la mezcla en la caja de tarta.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor del tazón. Poco a poco incorpore el azúcar, el extracto de vainilla, la sal y la crema de tártaro, luego bata de nuevo hasta que se formen los picos. Vierta la mezcla de merengue sobre el relleno en la caja de pastel, usando un tenedor para formar el merengue en los picos.", "Hornee el pastel en el horno durante 15-20 minutos o hasta que el merengue esté dorado. Retirar del horno y dejar enfriar. Coloque en la nevera para enfriar completamente antes de servir.", "Para servir, corte rebanadas de la tarta de lima y sirva con una dispersión de arándanos y unas cucharadas de crema batida."], "url": "www_bbc_co_uk_food_recipes_keylimepie_93185", "title": "Pastel de lima", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/keylimepie_93185_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "2 x 2.5cm / 1in pedazos de palitos de canela", "3-4 vainas de cardamomo", "2-3 dientes", "2-3 chiles rojos secos enteros, partidos en trozos", "Paleta de cerdo de 250 g / 9 oz, cortada en piezas de 1.5 cm / 0.5 in", "Paleta de cerdo de 250g / 9oz, cortada en piezas de 1.5cm / 0.5in", "2 cebollas, peladas, finamente picadas en piezas de 1.5cm / 0.5in", "1 cucharada colmada de pasta de ajo de jengibre, de un tarro, o triture el jengibre fresco y el ajo para formar una pasta", "2 cucharaditas de comino molido", "1 cucharada de cilantro molido", "½ cucharadita de cúrcuma molida", "500-750ml / 17½fl oz-1 pinta 7fl oz de caldo de pollo o agua", "2 tomates, toscamente picados", "sal y pimienta negra recién molida", "2 cucharadas de hojas de cilantro fresco picado", "2-3 papas grandes, peladas y cortadas en cuatro a lo largo", "aceite vegetal, para freír", "sal al gusto", "2 tomates, cortados en trozos", "4 cebolletas, en rodajas", "½ pepino, sin semillas, finamente picado", "2 chiles verdes frescos, finamente picados", "3 cucharadas de hojas de menta fresca picada", "3 cucharadas de hojas de cilantro fresco picado", "1 lima, solo jugo", "1 cucharada de vinagre de malta", "½ cucharadita de sal"], "method": ["Para la carne de cerdo, caliente el aceite en una cacerola pesada hasta que fume. Agregue los palitos de canela, las vainas de cardamomo, los clavos de olor y los chiles secos a la cazuela y fríalos suavemente hasta que estén aromáticos y empiecen a dorarse (siga moviendo las especias alrededor de la cazuela para evitar que se quemen).", "Agregue el hombro de cerdo y las piezas del vientre a la cacerola y fría durante 1-2 minutos en todos los lados, o hasta que estén doradas por todas partes. Retire la carne de cerdo de la cazuela y déjela a un lado.", "Agregue las cebollas picadas a la cazuela y fría durante 4-5 minutos, o hasta que las cebollas estén doradas. Vuelva a colocar la carne de cerdo en la sartén y cocine por otros 3-4 minutos, o hasta que la cazuela esté bastante seca, luego agregue el jengibre y la pasta de ajo.", "Mezcle el comino molido, el cilantro y la cúrcuma con un poco de caldo o agua para formar una pasta, luego agregue a la sartén y mezcle bien. Cocine por 2-3 minutos, o hasta que la pasta casi se seque y aparezcan burbujas de aceite a lo largo de los bordes de la cazuela. Vierta suficiente agua o caldo para cubrir la carne.", "Deje que hierva a fuego lento, cubra con una tapa y cocine durante 30-35 minutos, o hasta que el cerdo esté tierno. Agregue los tomates picados y sazone al gusto con sal y pimienta negra recién molida.", "Cocine por otros 4-5 minutos, luego agregue el cilantro picado y cocine a fuego lento durante otros 1-2 minutos. Mantener caliente", "Para las papas, coloque las papas en una sartén con agua con sal y deje hervir. Reduzca el fuego a fuego lento y cocine por 8-10 minutos, o hasta que esté tierno. Escurra, luego devuelva las papas a la sartén y cocine a fuego lento para eliminar el exceso de líquido.", "Llene a la mitad una sartén profunda de base pesada con aceite y calor hasta que la temperatura sea de 190 ° C / 375 ° F (controle con un termómetro digital) o use una freidora de grasa. (NB: el aceite caliente puede ser peligroso. No lo deje desatendido.) Baje con cuidado las piezas de patata en el aceite y fríaselas durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Sazonar las papas con sal.", "Para la ensalada, coloque los tomates, las cebolletas, el pepino, los chiles, la menta y las hojas de cilantro en un tazón grande y mezcle para mezclar.", "En un tazón pequeño, mezcle el jugo de lima, el vinagre y la sal hasta que estén bien combinados, luego rocíe sobre la ensalada. Mezcle suavemente hasta que la ensalada esté uniformemente cubierta con el aderezo.", "Para servir, divida las papas y el cerdo por igual entre los cuatro platos y sirva la ensalada en un tazón al lado."], "url": "www_bbc_co_uk_food_recipes_kharuporkwithdeepfri_91726", "title": "Cerdo de Kharu con patatas fritas y ensalada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2½oz de arroz basmati, lavado", "1 litro / 1¾ pintas de leche entera", "8 vainas de cardamomo (o 1 cucharadita de cardamomo molida), ligeramente trituradas", "50 g / 1¾oz de almendras troceadas", "75g / 2½oz sultanas", "2 cucharadas de azúcar en polvo", "puñado de pistachos picados para decorar", "hoja de oro, para decorar (opcional)"], "method": ["Incline el arroz en una cacerola grande y tueste a fuego lento durante unos minutos.", "Agregue la leche, el cardamomo y las almendras. Llevar a fuego lento y cocinar, sin tapar, durante 40 minutos.", "Agregue las pasas sultanas y cocine a fuego lento durante 15-20 minutos, o hasta que el líquido se haya reducido a la mitad y la mezcla se haya espesado.", "Agregue el azúcar, al gusto, retire del fuego y deje enfriar.", "Viértalo en un tazón grande, cúbralo con film transparente y déjelo enfriar en la nevera durante 1-2 horas o durante la noche. Elige las vainas de cardamomo.", "Servir en cuatro cuencos decorados con pistachos triturados y pan de oro (si se usan)."], "url": "www_bbc_co_uk_food_recipes_kheer_71573", "title": "Bueno", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kheer_71573_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de trigo bulgar, remojado durante la noche en 570ml / 1 pinta de agua", "150ml / 5fl oz de agua", "¼ cucharadita de sal", "55 g / 2 oz de avena", "2 dientes de ajo picados", "2 cucharadas de aceite de oliva", "1 cebolla picada", "55g / 2 oz de pimientos picados", "1 apio, finamente picado", "½ cucharadita de salvia seca,", "½ cucharadita de orégano seco", "½ cucharadita de tomillo seco", "2 cucharadas de perejil fresco picado"], "method": ["Ponga a hervir 150ml / 5fl oz de agua, agregue la sal y revuelva. Luego agrega la avena y reduce el calor.", "Cubra y cocine a fuego lento durante 15-20 minutos, luego retire del fuego y colóquelo en un recipiente. Precalentar el horno a 180C / 350F / Gas 4.", "Agregue el trigo bulgar y el agua que quede de remojo en el recipiente.", "Calentar el aceite de oliva en un sartén, sofreír el ajo, agregar las cebollas y los pimientos y cocinar hasta que estén suaves.", "Poner en un recipiente junto con los ingredientes restantes. Sazonar al gusto, mezclar bien y poner en una fuente para hornear engrasada. Hornea 1 hora."], "url": "www_bbc_co_uk_food_recipes_kibbe_2406", "title": "Kibbe vegano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 riñones de cordero, membranas eliminadas, cortadas por la mitad y el centro eliminado", "sal y pimienta negra recién molida", "1 cucharadita de aceite de oliva", "1 cucharadita de mantequilla", "4 cucharadas de crema doble", "2 cucharaditas de mostaza Dijon", "sal y pimienta negra recién molida", "pequeño puñado de cebollín fresco, picado", "1 rebanada de pan, tostado, para servir"], "method": ["Para los riñones, sazone los riñones con sal y pimienta negra recién molida. Calentar el aceite y la mantequilla en una sartén a fuego medio y freír los riñones durante 5-6 minutos, volteándolos de vez en cuando, hasta que estén dorados por todos lados y cocidos.", "Para la salsa, coloque la crema en una olla pequeña y deje que hierva. Reduzca el fuego, mezcle la mostaza y hierva a fuego lento hasta que espese. Sazonar con sal y pimienta negra recién molida y agregar los cebollines picados.", "Para servir, coloque una tostada en un plato, cubra con los riñones y vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_kidneysinmustardsauc_85242", "title": "Riñones en salsa de mostaza sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de frijoles rojos secos, empapados durante la noche con agua fría para cubrir", "1 cucharadita de cúrcuma molida", "50ml / 2fl oz de aceite vegetal", "3 cebollas medianas, picadas", "4 dientes de ajo, finamente picados", "75 g / 2½ oz de raíz de jengibre fresco, finamente picado o rallado", "1 cucharadita de sal", "1 cucharadita de ají de Kashmiri en polvo", "1 cucharadita de sal masala", "125ml / 4fl oz de yogur de estilo griego", "arroz basmati hervido", "rodajas de limón"], "method": ["Escurra los frijoles remojados, colóquelos en una cacerola pesada, cúbralos con agua fresca y espolvoree la cúrcuma. Coloque a fuego medio, hierva a fuego lento, luego baje el fuego y cocine a fuego lento sin tapar durante 1-1½ horas, o hasta que los frijoles estén tiernos, llenando con agua si la olla comienza a verse seca.", "Calentar el aceite en una sartén grande o karahi a fuego medio y freír las cebollas, el ajo y el jengibre durante 10 minutos o hasta que estén doradas. Agregue la sal, el chile en polvo y el garam masala y fría por 30 segundos, luego agregue el yogur y cocine durante cinco minutos.", "Agregue los frijoles cocidos drenados a la mezcla de cebolla, junto con suficiente líquido de cocción para cubrir los frijoles (rellenando con agua si es necesario) y cocine a fuego lento durante 10 minutos, machacando unos frijoles contra el costado de la sartén con la parte posterior de una cuchara para espesar la salsa. Sirva con arroz basmati y trozos de limón."], "url": "www_bbc_co_uk_food_recipes_kidney_bean_curry_rajma_57839", "title": "Riñón de frijol curry (rajma)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kidney_bean_curry_rajma_57839_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz de fruta fresca, enlatada (con peso escurrido) o congelada, como manzanas, peras, melocotones o ciruelas maduras (sin cáscara y sin pepitas) o bayas como moras, frambuesas, cerezas o arándanos, o una mezcla", "1 naranja pequeña, solo jugo", "2 cucharadas de azúcar moreno", "Harina de 175g / 6oz de levante (blanca o integral)", "100g / 3½oz de mantequilla sin sal, ablandada", "Avena de avena 25g / 1oz", "50g / 1¾oz de azúcar morena suave", "½ cucharadita de canela molida o especias mixtas", "4 cucharadas de yogur (natural o con sabor)"], "method": ["Trabajo para adultos: precaliente el horno a 200C / 400F / Gas 6.", "El trabajo de los niños: corta la fruta en trozos. No se preocupe porque el tamaño sea perfecto, ¡es bueno tener una variedad de trozos! (Un adulto debe supervisar esto).", "El trabajo de los niños: Coloque la fruta en un plato resistente al horno y vierta sobre el jugo de naranja y el azúcar moreno.", "El trabajo de los niños: coloque la harina en un recipiente para mezclar y pique la mantequilla en pequeños trozos. Luego pueden frotar la mantequilla con las puntas de los dedos. Esto no tiene que ser perfecto, algunos bultos están bien.", "El trabajo de los niños: mezcle la avena, el azúcar y las especias con la mezcla de zapatero y revuélvala con una cuchara o sus manos.", "El trabajo de los niños: agregue el yogur una cucharada a la vez. Es posible que deba mezclar con las manos para formar una masa áspera.", "El trabajo de los niños: forma la mezcla de zapatero en bolas pequeñas, del tamaño de una pelota de ping pong y colócalas sobre la parte superior de la fruta.", "Trabajo de un adulto: coloque en el horno durante 30-40 minutos o hasta que el zapatero esté dorado en la parte superior con la fruta burbujeando alrededor de los bordes. Deje que se enfríe antes de servir, ya que el relleno de fruta estará muy caliente. Sirva caliente con helado, yogur o natillas."], "url": "www_bbc_co_uk_food_recipes_kids_any-fruit_cobbler_81271", "title": "Zapatero de cualquier fruta para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_any-fruit_cobbler_81271_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de oliva, girasol o vegetal, para engrasar", "4 huevos grandes de gallinas camperas", "50ml / 2fl oz de leche o crema", "puñado de queso cheddar rallado o feta desmenuzado", "pimienta negra recién molida", "1 cucharada de hierbas frescas picadas como el perejil o el cebollino (opcional)", "10 tomates cherry (se pueden dejar enteros o reducir a la mitad)", "1 pimiento rojo, picado", "puñado de guisantes congelados, descongelados", "50 g / 1¾oz de brócoli, picado en pequeños floretes"], "method": ["Trabajo para adultos: precaliente el horno a 180C / 350F / Gas 4.", "El trabajo de los niños: frote el aceite sobre el interior de un plato cuadrado a prueba de horno de 20 cm / 8 pulgadas o una lata de muffin de 6 hoyos con un poco de rollo de cocina o un cepillo de pastelería.", "El trabajo de los niños: Rompa los huevos uno por uno en un tazón pequeño para que pueda verificar si hay alguna cáscara de huevo en el tazón. Si hay, puedes pescar con una cuchara. Incline cada huevo en un recipiente grande cuando haya revisado el caparazón. Lávese las manos después de tocar los huevos.", "El trabajo de los niños: agrega la leche o la crema a los huevos. Batir los huevos con un tenedor o batidor de metal hasta que esté liviano y esponjoso.", "El trabajo de los niños: agregue la mitad del queso rallado y un poco de pimienta negra molida. También puede agregar hierbas si lo desea.", "El trabajo de los niños: Coloque las verduras que desea usar en el plato a prueba de horno. Si está usando una lata de muffins puede elegir qué verduras van en cada uno de los agujeros. Vierta la mezcla de huevo y queso en las verduras y espolvoree el resto del queso encima.", "Trabajo de un adulto: coloque la lata o plato en el horno durante 20 minutos para que la frittata se dore y se ponga. Verifique que esté cocido en el medio metiendo un cuchillo afilado. Si todavía está flojo, devuelva el plato al horno hasta que se haya fraguado. Deje que se enfríe un poco antes de sacarlo del estaño con una espátula resistente al calor. Puedes comerlo caliente o frío."], "url": "www_bbc_co_uk_food_recipes_kids_cheese_and_79582", "title": "Frittata de queso y vegetales para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_cheese_and_79582_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ de pepino", "10 tomates cherry o 3 tomates más grandes", "1 pimiento, cualquier color", "2 cebollas de primavera", "100g / 3½oz de maíz dulce, congelado o enlatado (peso escurrido)", "150g / 5½oz de cuscús", "limón pequeño, solo jugo (también puedes usar naranja)", "1 cucharada de aceite de oliva", "200ml / 7fl oz de agua hirviendo", "hierbas pequeñas, como el perejil y el cilantro", "pequeñas nueces, como almendras en copos, piñones o pistachos", "aceitunas pequeñas, picadas", "pequeñas frutas secas como pasas, pasas, albaricoques secos picados"], "method": ["Trabajo para niños: picar todas las verduras en pedazos realmente pequeños. Los niños necesitan ayuda para cortar: use un cuchillo que no tenga un extremo puntiagudo. Puede comprar cuchillos de ensalada de plástico por muy poco dinero, que son ideales para que los niños los usen. También pueden usar cuchillos de mesa con bordes lisos (no dentados, que cortan fácilmente los dedos), pero pueden necesitar ayuda para cortar vegetales duros. Es bueno cortar junto a los niños con un cuchillo afilado para que puedan ver cómo se hace. Muéstreles cómo separar los dedos del cuchillo como una garra, manteniendo las uñas planas sobre el vegetal que está cortando.", "El trabajo de los niños: Coloque el cuscús en un tazón grande a prueba de calor y luego exprima el jugo de limón o naranja y un chorrito de aceite de oliva.", "Trabajo de un adulto: vierta el agua hirviendo sobre el cuscús, cúbralo con una película adhesiva y déjelo reposar durante cinco minutos.", "El trabajo de los niños: usa un tenedor para remover el cuscús hasta que se vea esponjoso.", "El trabajo de los niños: agregue las verduras picadas y revuelva bien. Si desea agregar hierbas, nueces, aceitunas o frutas secas, agítelas también. Sirva con falafel, pollo a la parrilla o unas rodajas de halloumi a la parrilla."], "url": "www_bbc_co_uk_food_recipes_kids_customised_couscous_17817", "title": "Ensalada de cuscús personalizada para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_customised_couscous_17817_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva o mantequilla, para freír", "2 cebollas tiernas o un puerro pequeño", "1 zanahoria", "puñados de guisantes (congelados o frescos)", "pequeñas judías verdes (congeladas o frescas)", "un par de hojas de repollo (cualquier tipo de col, col rizada, espinacas o verduras verdes)", "1 diente de ajo, finamente picado por un adulto", "1 cucharadita de orégano seco, albahaca o tomillo o hierbas secas mezcladas", "1 cucharadita de puré de tomate", "1 x 400g / 14oz de tomates picados en lata", "1 x 400 g / 14 oz de frijoles cannellini", "2 lonchas de panceta o jamón cocido, picadas (opcional)", "600ml / 20fl oz de reserva de verduras de sal reducida", "30g / 1oz de pasta pequeña seca como orzo, estrellas, formas de alfabeto o espagueti seco roto", "racimo pequeño de albahaca o perejil fresco, picado", "jugo de limón, al gusto", "azúcar al gusto", "pimienta negra recién molida"], "method": ["El trabajo de los niños: pique todas las verduras en trozos pequeños, tan pequeños como sea posible (puede dejar los guisantes enteros). Puede usar los dedos o un cuchillo para ensaladas (con la ayuda de un adulto) o usar tijeras limpias aptas para niños para cortar las hierbas, el repollo y las cebolletas.", "Trabajo para adultos: caliente una olla grande y agregue una cucharadita de aceite de oliva o mantequilla. Fríe con cuidado la cebolla tierna o el puerro durante cinco minutos, revolviendo con frecuencia.", "Trabajo de un adulto: agregue el ajo, el resto de las verduras, las hierbas secas y el puré de tomate y revuelva por un minuto.", "Trabajo de un adulto: agregue los tomates enlatados y caliéntelos y llévelos a ebullición.", "Trabajo de un adulto: agregue la pasta y cualquier carne o frijoles que quiera usar y cocine durante 8 minutos más.", "El trabajo de los niños: Haga que su hijo crezca y le sirva un poco de sopa en un tazón pequeño y deje que se enfríe un poco. Pruebe y vea lo que piensa ... si lo desea, puede agregarle un chorrito de jugo de limón, un poco de azúcar o un poco de pimienta negra.", "Trabajo de un adulto: cuchara en tazones para servir. Puede espolvorear hierbas en la parte superior o colocarlas en un recipiente pequeño sobre la mesa para que los niños prueben primero. La sopa es genial servido con pan grueso."], "url": "www_bbc_co_uk_food_recipes_kids_minestrone_soup_40496", "title": "Sopa minestrone para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_minestrone_soup_40496_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 zanahorias", "½ apionabo o colirrábano (estos son vegetales de aspecto muy extraño que a los niños les encanta explorar)", "2 remolachas crudas (esto puede ser muy sucio pero es divertido!)", "2 manzanas", "1 cucharada de aceite de oliva", "1 naranja, solo jugo (o use jugo de limón si lo prefiere)", "pimienta negra recién molida", "1 cucharada de semillas de girasol, sésamo y calabaza, o una mezcla", "1 cucharada de yogur griego y / o una mezcla de yogurt y mayonesa (opcional)", "puñado de hierbas frescas como el cebollín, el perejil (opcional)"], "method": ["El trabajo de los niños: lavar las verduras y luego rallarlas, con ayuda, o utilizar un accesorio de rejilla en un procesador de alimentos.", "El trabajo de los niños: Coloque todas las verduras ralladas en un recipiente con el aceite y el jugo de naranja (o un par de cucharaditas de jugo de limón) y mezcle bien para que todos los colores se mezclen.", "El trabajo de los niños: probarlo: te puede gustar la ensalada tal como está, pero puedes agregar más jugo de naranja o de limón al gusto y también hierbas y semillas si las tienes.", "El trabajo de los niños: si los estás usando agrega la mayonesa o el yogur una cucharadita a la vez, revuelve bien y prueba hasta que tengas un sabor que te guste.", "Guarde la ensalada en la nevera. Se mantendrá durante hasta tres días en una tina de plástico sellada."], "url": "www_bbc_co_uk_food_recipes_kids_veggie_slaw_73791", "title": "Ensalada vegetariana de los niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_veggie_slaw_73791_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 zanahorias, finamente cortadas en cubitos", "2 cebollas, finamente cortadas en cubitos", "2 palitos de apio, finamente cortados en cubitos", "1 puerro, finamente cortado en cubitos", "pizca de sal", "400ml / 14fl oz de caldo de verduras (ver arriba)", "pizca de sal", "1 cucharadita de jugo de limón", "100ml / 3½fl oz de aceite de oliva", "40ml / 1½fl oz de vinagre de bonito (disponible de proveedores japoneses especializados)", "10g / ¼ oz de nueva temporada de ajo, escaldado y picado", "10 hojas de ajo silvestre, blanqueadas y picadas", "½ cucharadita de perejil finamente picado", "½ cucharadita de cebollines finamente picados", "10 g / ¼ oz de avellanas tostadas sin cáscara, picadas aproximadamente", "pizca de sal", "jugo de limón, al gusto", "dash aceite de oliva", "240 g / 8½ oz de carne de cangrejo fresca o carne de cangrejo real", "8 lanzas de espárragos picados", "8 dientes de ajo de nueva temporada, pelados y blanqueados hasta que estén suaves y tiernos", "8 hojas de ajo silvestre"], "method": ["Para el caldo de verduras, coloque todos los ingredientes en una cacerola y cubra con 400 ml / 14 fl oz de agua. Llevar a ebullición y cocine a fuego lento durante 10 minutos. Dejar enfriar y luego colar.", "Para el caldo de verduras, coloque todos los ingredientes en una cacerola y reserve.", "Para el bonito y el aderezo de ajo, coloque todos los ingredientes en un tazón.", "Para el cangrejo, coloque una sartén a fuego medio con un poco de aceite de oliva y ponga a hervir la cacerola de caldo de bonito vegetal.", "Pon el cangrejo en la sartén y fríelo suavemente durante unos dos minutos, o hasta que esté cocido.", "Coloque los espárragos picados en el caldo y cocínelos por 30-40 segundos. Agregue los dientes de ajo blanqueados y las hojas de ajo silvestre y déjelos a un lado.", "Una vez que el cangrejo esté cocido, coloque el cangrejo en un recipiente con el aderezo de bonito y ajo y mezcle.", "Para servir, coloque los espárragos, los dientes de ajo silvestres y las hojas en recipientes para servir con un poco de caldo de bonito. Coloque el cangrejo vestido en tazones separados y sirva."], "url": "www_bbc_co_uk_food_recipes_king_crab_asparagus_12453", "title": "Cangrejo real, espárragos, ajo y avellanas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete", "1 diente de ajo, en rodajas finas", "10g de raíz de jengibre fresco, cortado en fósforos", "6 langostinos, pelados y desvelados", "3 vieiras, cada corte a la mitad para hacer 2 discos (6 discos en total)", "copos de sal marina y pimienta, al gusto", "1-1½ cucharadas de vino de arroz Shaoxing, al gusto", "1 cebolleta, cortada en tiras", "4 ramitas de suma de choi u otras verduras chinas", "1 pak choi, cortado en 4", "Mangout 30g / 1oz, cortado por la mitad a lo largo en un ángulo", "½ chile rojo, finamente cortado en ángulo", "1-2 cucharadas soperas de salsa de soja ligera, al gusto", "1 cucharadita de aceite de sésamo"], "method": ["Caliente el aceite de cacahuete en un wok hasta que fume.", "Cuando esté caliente, agregue el ajo y el jengibre durante un minuto, o hasta que estén suaves.", "Agregue las gambas al ajo y el jengibre, fríelas por un minuto, revuelva el wok o revuelva las gambas con una cuchara un par de veces.", "Sazone las vieiras con sal y pimienta. Coloque las vieiras alrededor del borde del wok caliente, para obtener un poco de color en los lados.", "Mezcle el wok o dé vuelta suavemente los mariscos, luego agregue el vino de arroz.", "Agregue todas las verduras preparadas y mezcle suavemente hasta que la suma de choi y el pak choi se hayan marchitado levemente, esto tomará un par de minutos más", "Agregue el chile rojo y la salsa de soja ligera, al gusto.", "Divida la mezcla en dos tazones y rocíe media cucharadita de aceite de sésamo sobre cada porción. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_king_prawn_and_scallop_49681", "title": "Langostinos y vieiras salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/king_prawn_and_scallop_49681_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "100ml / 3½fl oz de agua tibia", "Gambas gigantes de 200g / 7oz, 2/3 picadas y 1/3 finamente picadas", "2 huevos de gallinas camperas, ligeramente batidos con ½ cucharadita de sal", "20g / 1oz de cebollín chino (también conocido como cebollín al ajo)", "jengibre pequeño, finamente picado", "pizca de pimienta blanca", "1 cucharada de vino Shaoxing (o sustituto de jerez seco o vinagre de arroz)", "1 cucharada de aceite vegetal", "1 cucharada de aceite de sésamo"], "method": ["Para la masa de bola de masa, coloque la harina en un tazón grande y agregue el agua tibia un poco a la vez, mezclando entre las adiciones hasta que tenga una masa suave. Convierta la masa en una superficie ligeramente enharinada y amasar hasta que quede lisa. Esto toma de 7 a 10 minutos a mano. La masa debe ser suave pero no húmeda al tacto, un poco como la pasta recién hecha. Cubra y deje reposar durante treinta minutos.", "Para el relleno, ponga todos los ingredientes en un tazón grande. Use una cuchara para mezclar hasta que quede suave.", "Destape la masa y colóquela sobre una superficie de trabajo plana y enharinada. Espolvoree harina sobre la masa y córtela en cuatro pedazos de igual tamaño. Tome una pieza y enrolle en una salchicha de aproximadamente 2 cm de ancho. Coloque las otras tres piezas en el recipiente y cúbralas para que su superficie no se endurezca.", "Corta una pieza de masa del tamaño de un pulgar de la 'salchicha'. Espolvorea con harina, para que no se pegue, luego rueda en un pequeño disco del grosor de una pieza de 50 peniques. Haga el centro del disco de masa un poco más grueso para mantener el peso del relleno.", "Sostenga el disco en la palma de su mano y ponga una cucharada del relleno de gambas en el centro del disco. Con el dedo y el pulgar, pellizque los lados, creando una bola de masa hervida en forma de media luna. Hay muchas maneras diferentes de sellar la bola de masa, esta es la más fácil. Repita con el resto de la mezcla de masa y gambas. Las albóndigas terminadas deben colocarse en una bandeja bien enharinada y mantenerse cubiertas con film transparente.", "Coloque las albóndigas en una olla profunda de agua hirviendo y cocínelas durante 8-10 minutos, como cocinar pequeños raviolis. Las albóndigas pequeñas tardarán menos en hervir. Después de tres minutos, agregue 100 ml de agua fría en la olla hirviendo, luego la misma otra vez después de otros tres minutos de ebullición. Hervir durante dos minutos más, luego escurrir y servir."], "url": "www_bbc_co_uk_food_recipes_king_prawns_egg_and_00032", "title": "Langostinos, huevo y albóndigas de agua de cebollín chino", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de arroz basmati", "1 cucharada de ghee", "pellizcar sal ahumada", "½ cucharadita de cúrcuma molida", "1 cucharadita de sal", "Gambas de agua dulce de 400 g / 14 onzas, peladas y sin nervaduras (el tamaño más grande que puedas encontrar)", "90ml / 3fl oz de aceite vegetal", "2 hojas de laurel", "3 cebollas rojas medianas, mezcladas a una pasta fina", "1 cucharada de comino molido", "1 cucharadita de cúrcuma molida", "2 cucharadas de jengibre y pasta de ajo", "1 cucharadita de sal", "2 chiles verdes, hendidura longitudinal", "Leche de coco 75ml / 2½fl oz", "stock de mariscos, si es necesario", "½ cucharadita de azúcar (opcional)", "½ cucharadita de cardamomo verde molido", "1 cucharada de cilantro fresco picado", "½ lima, solo jugo"], "method": ["Para el arroz basmati hervido, agregue 600ml20 fl oz de agua a la cacerola, luego agregue el arroz y la sal. Cocine a fuego lento hasta que toda el agua haya desaparecido. Coloque una tapa en la parte superior y déjela a un lado durante 20 minutos.", "Para las gambas, marinar las gambas con la cúrcuma y la sal en un plato poco profundo en un lugar fresco durante 30 minutos a una hora.", "Caliente 60ml / 2fl oz del aceite en una sartén y agregue las hojas de laurel y el pasta de cebolla. Freír suavemente durante 6-8 minutos a fuego medio, o hasta que estén muy claras.", "Mientras tanto, caliente el aceite restante en una sartén antiadherente y fríe las gambas brevemente durante uno o dos minutos. Dejar de lado.", "Mezcle el comino molido, la cúrcuma y la pasta de jengibre y ajo en 75 ml / 2½ fl oz de agua y agregue a las cebollas, reduzca el fuego y cocine por 2-3 minutos revolviendo regularmente.", "Agregue la sal, los chiles verdes y las gambas y revuelva por un minuto. Mezcle la leche de coco y cocine a fuego lento durante 2-3 minutos, o hasta que las gambas estén cocidas, añadiendo un poco de caldo de mariscos si es necesario.", "Sazone al gusto con azúcar. Espolvorea sobre el polvo de cardamomo y cilantro y un chorrito de lima. Revuelva el ghee y la sal ahumada en el arroz y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_king_prawns_in_coconut_61536", "title": "Langostinos con salsa de curry de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]