[{"ingredients": ["400g / 14oz% 20lean% 20minced% 20beef% 20 (10 %% 20fat% 20or% 20less)", "1 cebolla picada", "2 ramas de apio, cortadas y en rodajas finas", "2 zanahorias, peladas y cortadas en cubitos", "400g de tomates cortados en lata", "2 cucharadas de puré de tomate", "1 cubo de caldo de carne", "1 cucharada de salsa Worcestershire", "1 cucharadita de hierbas mezcladas secas", "100g / 3½oz de guisantes congelados", "sal marina y pimienta negra recién molida", "Patatas harinas de 700g / 1lb 9oz, como King Edwards o Maris Piper, peladas y cortadas en trozos de 4 cm / 1½ pulgadas", "2 puerros, cortados y cortados en rodajas de 1 cm / ½ pulgada", "25g / 1oz de queso Cheddar maduro, rallado"], "method": ["Coloque una cacerola grande antiadherente o una cacerola a prueba de fuego a fuego medio. Agregue la carne, la cebolla, el apio y las zanahorias a la sartén y cocínelas durante 5 minutos. Use un par de cucharas de madera para romper la carne mientras se cocina.", "Agregue los tomates, el puré de tomate, el cubo en cubos, la salsa Worcestershire y las hierbas mixtas. Vuelva a llenar la lata de tomate con agua y vierta en la sartén. Sazonar con una buena pizca de sal y mucha pimienta. Deje que hierva a fuego lento, luego reduzca el fuego, tape sin apretar y cocine a fuego lento por unos 25 minutos, revolviendo regularmente.", "Mientras tanto, para hacer el relleno, coloque las papas en una olla grande y cúbralas con agua fría. Llevar a ebullición, luego reduzca el fuego ligeramente y cocine a fuego lento durante 10 minutos. Agregue los puerros, vuelva a hervir a fuego lento y cocine durante 2 minutos más, o hasta que las papas estén tiernas pero no se deshagan.", "Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Vacíe las papas y los puerros y vuelva a la sartén. Aplastar las papas con un tenedor. Sazonar con un poco de sal y mucha pimienta.", "Revuelva los guisantes en la mezcla de carne y luego póngalo en una fuente para horno de 2 litros / 3½ pinta. Con una cuchara grande, cubra la mezcla de carne con las papas trituradas. No hay necesidad de hacerlo muy bien. Esparce el queso por la parte superior.", "Hornee durante 25-30 minutos, o hasta que el relleno esté dorado y el relleno esté burbujeante. Servir."], "url": "www_bbc_co_uk_food_recipes_ever-so-easy_cottage_pie_77158", "title": "Pastel de casa siempre tan fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ever-so-easy_cottage_pie_77158_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["un pequeño pollo asado de gallinas camperas", "75ml / 3fl oz de aceite de oliva", "4 dientes de ajo, aplastados", "un gran limón", "6 ramitas de tomillo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 8.", "Coloque el pollo en una tabla de cortar y córtelo por la mitad con un cuchillo de cocina grande y muy afilado. Aplane el pollo tanto como pueda, presionando hacia abajo con la palma de su mano.", "Vierta el aceite de oliva en un tazón para mezclar lo suficientemente grande como para tomar el pollo, agregue los dientes de ajo aplastados, el jugo del limón y luego las cáscaras de limón exprimido. Ponga las ramitas de tomillo, un buen aderezo de sal y pimienta negra, luego revuelva el pollo en el aceite. (Si tiene tiempo, puede dejar el pollo así durante una hora más o menos en la nevera).", "Coloque el pollo en una lata de asar, con la piel hacia arriba. Asar durante unos 30 minutos o hasta que la piel esté dorada y el ave bien cocida."], "url": "www_bbc_co_uk_food_recipes_everyday_roast_chicken_91003", "title": "Todos los días pollo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/everyday_roast_chicken_91003_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 lb de manzanas para cocinar, peladas, sin corazón y en rodajas", "15g / 1 / 2oz de mantequilla", "85g / 3 oz de azúcar", "½ limón, jugo y ralladura", "Harina de 115g / 4oz", "pizca de sal", "½ cucharadita de polvo de hornear", "55g / 2oz de mantequilla, ablandada", "55g / 2 oz de azúcar", "1 huevo de gallinas camperas", "1 cucharada de leche"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, coloque las manzanas, la mantequilla, el azúcar, el jugo de limón y la ralladura en una cacerola con un poco de agua y cocine suavemente hasta que las manzanas se ablanden.", "Ponga la mezcla de manzana en el fondo de un plato para pastel, empacando las manzanas hacia abajo para proporcionar una base firme para el relleno (esto ayuda a que se eleve de manera uniforme durante la cocción).", "Para el relleno, tamice la harina con una pizca de sal y el polvo de hornear. En otro recipiente, unte la mantequilla y el azúcar, bate el huevo y luego dobla la harina. Agregue un poco de leche si la mezcla es demasiado dura.", "Vierta la mezcla en la parte superior de las manzanas y hornee en el horno durante 45-55 minutos o hasta que la parte superior esté dorada y cocida."], "url": "www_bbc_co_uk_food_recipes_eves_pudding_91583", "title": "El pudín de Eva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40 manzanas Bramley grandes, peladas, sin corazón y en rodajas", "1kg / 2lb 4oz de mantequilla sin sal, suavizada", "550g / 1lb 4oz de azúcar moreno", "150ml / 5fl oz de jarabe de oro", "1 cucharada de canela molida", "700 g / 1 libra de 10 onzas de pasas", "20 huevos", "1kg / 2lb 4 oz de harina de auto aumento"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase un plato de servir para horno muy grande con 125 g / 4 oz de la mantequilla y luego esparza en las rodajas de manzana. Espolvorea más de 150 g / 5½ oz del azúcar morena, el jarabe dorado, la canela y finalmente las pasas.", "En un tazón, bata la mantequilla restante y el azúcar en una batidora grande (o con una cuchara de madera) hasta que esté pálida y esponjosa. Batir los huevos, uno a la vez, luego use una cuchara grande de metal para doblar suavemente la harina.", "Vierta la mezcla sobre las manzanas e iguale suavemente con la parte posterior de la cuchara.", "Hornee durante 45-50 minutos o hasta que estén dorados y cocidos. Sirve con crema pastelera."], "url": "www_bbc_co_uk_food_recipes_eves_pudding_99739", "title": "El pudín de Eva", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 manzanas de cocina grandes (alrededor de 500 g / 1lb2oz en total)", "1 cucharada de jugo de limón", "2 cucharadas de agua", "20 g / oz de mantequilla", "2 cucharadas de azúcar en polvo", "75g / 3oz de mantequilla", "100 g / 3½ oz de azúcar en polvo", "100g / 3½ oz de harina de auto crianza", "2 huevos de gallinas camperas, ligeramente golpeados", "1 cucharada de agua hirviendo", "crema o crema"], "method": ["Precalentar el horno a 180C / 350 / Gas 4.", "Pelar, cortar y cortar las manzanas aproximadamente.", "Agregue las manzanas a una cacerola con el jugo de limón y agua.", "Revuelva, tape y cocine enérgicamente durante cinco minutos hasta que las manzanas estén blandas.", "Agregue la mantequilla y el azúcar impalpable y revuelva.", "Transfiera a un plato de cerámica gratinado de 900 ml / 1 ½ pinta, aproximadamente 5 cm de profundidad.", "Deje que se enfríe mientras prepara el relleno.", "Para el relleno, unte la mantequilla y el azúcar en polvo hasta que estén esponjosos y livianos.", "Doble la harina y el huevo en cucharadas alternas en la mezcla de azúcar hasta que se mezcle, teniendo cuidado de seguir doblando en lugar de revolver enérgicamente, esto mantendrá el aire en la mezcla y se doblará.", "Agregue una cucharada de agua hirviendo a la mezcla.", "Vierta la mezcla sobre las manzanas. Cocine en el horno durante 30-35 minutos o hasta que el relleno esté hinchado y dorado. Sirve con crema o crema pastelera."], "url": "www_bbc_co_uk_food_recipes_evespudding_83911", "title": "El pudín de Eva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 rebanadas grandes de pan", "aceite de oliva", "100 g / 3½ oz de queso de oveja, en rodajas", "sal y pimienta negra recién molida, al gusto", "1 filete de trucha ahumado en caliente, carne copos con un tenedor", "perejil, para adornar"], "method": ["Precalentar la parrilla a fuego medio.", "Calentar una sartén de plancha. Rocíe el pan con aceite de oliva y la plancha durante dos minutos por cada lado.", "Deslice el pan a la plancha en una bandeja para hornear, cubra con queso en rodajas, sazone con sal y pimienta negra recién molida y colóquelo bajo la parrilla durante 2-3 minutos.", "Deslice sobre un plato, cubra con los copos de trucha ahumada en caliente y decore con perejil. Servir."], "url": "www_bbc_co_uk_food_recipes_ewesmilkcheeseandhot_86832", "title": "Queso de leche de oveja y trucha ahumada sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.2kg / 2lb 10oz boneless gammon joint (utilizamos sin fumar, pero ahumado también podría funcionar)", "500ml / 17fl oz de sidra", "1 litro / 1¾ pintas de jugo de manzana nublado", "2 manzanas verdes afiladas, sin corazón y cortadas en trozos rugosos", "2 x 8cm / 3¼ en pedazos de canela en rama", "3-4 chiles rojos frescos, semillas retiradas, cortadas en cuartos", "1 cucharada de semillas de cilantro picado grueso", "1 cucharada de azúcar Demerara, o al gusto", "¼ cucharadita de chile en polvo", "1 cucharada colmada de harina de maíz", "repollo rojo salteado con semillas de comino y jugo de limón", "ají verde"], "method": ["Remoje el jamón en abundante agua fría en la nevera durante al menos dos horas, o durante la noche. Escurrir bien.", "Coloque el gammon junto con todos los demás ingredientes gammon en una cazuela. El líquido debe cubrir la carne; si no, agregue un poco de agua para cubrir. Llevar a ebullición, luego reduzca el fuego a bajo y cocine a fuego lento, parcialmente cubierto con una tapa, durante 1 ¼ horas. Gire el gammon con cuidado en el líquido cada 20 minutos más o menos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire el gammon de su caldo de cocción, transfiéralo a una lata pequeña para asar. Reserve el líquido de cocción para hacer la salsa.", "Corta la corteza del jamón, dejando una fina capa de grasa y descarta la corteza. Con un pequeño cuchillo afilado, califique la grasa en diamantes.", "Para el glaseado, ponga un cucharón de líquido de cocción en una olla grande y limpia. Agregue el azúcar y el chile en polvo y cocínelos hasta obtener una consistencia glaseada. Vierta esto sobre la gammon y tueste durante 15 minutos, hasta que se dore y caramelice. Reserve en un lugar cálido mientras prepara la salsa", "Para la salsa, hierva el líquido de cocción en una sartén, sin tapar, a fuego alto hasta que se haya reducido a aproximadamente 500 ml / 17 fl oz; esto podría tomar alrededor de 10 minutos de ebullición.", "Cuele el líquido a través de un colador en una sartén limpia, frotando cualquier trozo de manzana a través del tamiz también para que la carne esté en la salsa; dejar atrás solo las pieles. Pruebe la salsa y ajuste el condimento al gusto. Si lo quieres más dulce, agrega una pizca de azúcar demerara; casi seguro que no necesitarás sal.", "Vuelva a calentar la salsa colada restante hasta que hierva a fuego lento. Mezcle la harina de maíz en un poco de agua fría hasta obtener una pasta suave, y revuelva en la salsa, revolviendo continuamente. Una consistencia cremosa es mejor que una salsa muy espesa, pero si prefiere la suya más espesa, agregue un poco más de harina de maíz mezclada. Para servir, coloque rodajas de gammon en platos individuales y vierta sobre la salsa. Sirva con repollo rojo con especias y puré de chile verde."], "url": "www_bbc_co_uk_food_recipes_exceptional_gammon_with_50001", "title": "Gammon excepcional con sidra y canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/exceptional_gammon_with_50001_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 melón Charentais", "1 pata-pata", "1 pera asiática, pelada y en rodajas", "8 lichis, pelados y apedreados", "150ml / 5¼fl oz de jugo de fruta fresca, naranja o cualquier otro que te guste"], "method": ["Use un baller de melón para sacar bolas del melón y la pata. Coloque estos en un recipiente, agregue la fruta restante y el jugo.", "Cubra y deje enfriar hasta que lo necesite, asegurándose de sacarlo de la nevera 30 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_exoticfruitsalad_72345", "title": "Ensalada de frutas exóticas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Cabeza de brócoli 150 g / 5½ oz, vástago grueso eliminado", "1 cebolla, más o menos picada", "Plumas de 350 g / 12 oz", "Tocino de espalda ahumado de 300 g / 10½ oz, cortado en trozos pequeños", "Pesto de albahaca 150g / 5½ oz", "150g / 5½oz de tomates cherry, cortados a la mitad", "25 g / 1 oz de piñones, para servir", "sal y pimienta negra recién molida", "25 g / 1 oz de virutas de queso parmesano, para servir"], "method": ["Cortar el brócoli en florecillas y cortar los tallos verdes en trozos pequeños.", "Calentar una sartén pequeña hasta que esté caliente. Agregue los piñones y fría a fuego medio-lento durante unos minutos, hasta que estén tostados y dorados.", "Ponga a hervir una sartén de agua con sal, luego agregue la cebolla y el penne. Cocine de acuerdo con las instrucciones del paquete de pasta, agregando el brócoli 3 minutos antes del final. Escurra la pasta y las verduras, refrescando el brócoli por separado en agua fría para detener la cocción y establecer el color.", "Mientras tanto, fría el tocino en una sartén grande y seca a fuego medio-alto durante aproximadamente 10 minutos, o hasta que esté crujiente y dorado, revolviendo con frecuencia. Reserve 2 cucharadas de tocino cocido y agregue el resto a la pasta.", "Agregue el pesto, los tomates y el brócoli a la mezcla de pasta cocida. Sazonar con pimienta negra y revolver.", "Incline en un plato para servir, esparza los piñones tostados, el tocino reservado y el queso parmesano y sírvalos."], "url": "www_bbc_co_uk_food_recipes_express_bacon_and_pesto_15099", "title": "Pasta express de tocino y pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_bacon_and_pesto_15099_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "6 grandes hojas secas de lasaña", "75g / 2¾oz de queso Cheddar maduro, rallado", "1 cucharada de aceite", "Carne de salchicha de cerdo 450g / 1lb", "1 cucharada de harina normal", "1 chile rojo, sin grano y finamente picado", "2 dientes de ajo gordos, aplastados", "250 g / 9 oz de champiñones castaños, en rodajas", "200ml / 7fl oz crema de grasa", "100g / 3½oz de espinaca baby, más o menos picada", "sal y pimienta negra recién molida", "500g / 1lb 2oz pasado", "2 cucharadas de pasta de tomate secada al sol", "1 cucharadita de azúcar mascabado ligero", "1 cucharada de hojas de tomillo fresco picado", "1 cucharada de salvia fresca picada"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Engrase la placa del horno con mantequilla.", "Remoje las hojas de lasaña en agua caliente recién hervida para ablandar mientras prepara las dos salsas.", "Para la salsa de cerdo y espinacas, caliente el aceite en una sartén grande y antiadherente. Agregue la carne de salchicha y dore a fuego alto durante 5-10 minutos hasta que se dore, rompiendo la carne picada con dos cucharas de madera. Espolvoree la harina y fría por un minuto.", "Agregue el chile, el ajo y los champiñones y fríalos durante aproximadamente 5 minutos. Agregue la crème fraîche y la espinaca. Llevar a ebullición y dejar que burbujee durante un par de minutos. Sazonar bien con sal y pimienta y dejar de lado.", "Para la salsa de tomate, mezcle todos los ingredientes en una jarra o tazón y sazone bien con sal y pimienta.", "Escurra las sábanas de lasaña.", "Coloque un tercio de la salsa de espinaca en la base del plato resistente al horno. Coloque un tercio de la salsa de tomate en la parte superior y coloque la mitad de las hojas de lasaña sobre la salsa de tomate. Repita usando dos capas más de salsa de espinacas y tomate y una de las sábanas de lasaña. Espolvorea sobre el queso rallado.", "Hornee durante 30-35 minutos, o hasta que la pasta esté tierna y la parte superior del plato esté dorada y burbujee alrededor de los bordes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_express_lasagne_51375", "title": "Expresar lasaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_lasagne_51375_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite en aerosol bajo en calorías", "½ cebolla pequeña, finamente picada", "100 g / 3½ oz de hongos Portobello, finamente picados", "250g / 9oz% 20extra-lean% 20beef% 20mince% 20 (bajo% 205 %% 20fat)", "2 cucharaditas de tomillo fresco finamente picado (o ½ cucharadita de tomillo seco)", "pimienta negra recién molida", "1 lechuga Little Gem, hojas separadas", "120g / 4½oz de tomates cherry, rebanados", "1/3 de pepino, en rodajas"], "method": ["Rocíe una pequeña sartén con aceite y cocine la cebolla y los champiñones a fuego medio durante cinco minutos, o hasta que estén bien suavizados, revolviendo regularmente. Incline en un recipiente resistente al calor y deje enfriar durante cinco minutos.", "Agregue la carne, el tomillo y mucha pimienta negra molida. Mezcle bien y forme dos bolas. Aplanar en formas de hamburguesas, cada una alrededor de 2 cm / ¾ de espesor.", "Limpie la sartén y vuelva a la cocina. Rocíe con un poco más de aceite y cocine las hamburguesas a fuego medio-bajo durante 10 minutos, volteándolas ocasionalmente, hasta que se doren por fuera y se cocinen por dentro.", "Sirve las hamburguesas con lechuga, tomate y pepino."], "url": "www_bbc_co_uk_food_recipes_extra_lean_burger_and_59164", "title": "Hamburguesa y ensalada extra-magra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extra_lean_burger_and_59164_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½ oz de leche entera", "1 hebras de azafrán de tsp amontonadas", "1kg / 2lbs 2 oz de filete estofado, cortado en trozos del tamaño de un bocado", "4 cebollas, peladas", "4 dientes de ajo, pelados", "25 g / 1 oz de raíz fresca de jengibre, pelada y picada", "2 chiles rojos frescos, sin semillas y picados", "5 dientes", "2 cucharaditas de semillas de comino", "2 cucharaditas de semillas de cilantro", "¼ de canela", "12 vainas de cardamomo", "2½ cucharaditas de copos de sal marina, más extra para sazonar", "½ nuez moscada entera, finamente rallada", "135ml / 4¾fl oz de aceite de girasol", "200ml / 7fl oz de yogurt natural", "2 hojas de laurel", "2 cucharaditas de azúcar en polvo", "325g / 11½oz de arroz basmati", "4 cucharadas de cilantro fresco picado", "50g / 2oz de mantequilla", "50g / 2oz sultanas", "40g / 1½oz de almendras en copos", "3 huevos grandes de gallinas camperas", "pimienta negra recién molida", "cilantro fresco"], "method": ["Vierta la leche en una olla pequeña, agregue los hilos de azafrán y caliente suavemente durante dos minutos sin hervir. Retire del fuego y deje de lado durante 2-3 horas, preferiblemente durante la noche.", "Recorta la carne de cualquier grasa dura y corta en pedazos del tamaño de un bocado. Calienta dos cucharadas de aceite en la sartén. Sazone la carne con sal y pimienta negra recién molida y fría en 2-3 tandas a fuego medio-alto hasta que se dore por todos lados. Transfiera a una olla grande con tapa.", "Mientras la carne se fríe, corte aproximadamente dos de las cebollas y ponga en un procesador de alimentos el ajo, el jengibre y los chiles. Agregue 50ml / 2fl oz de agua fría y mezcle hasta lograr una pasta homogénea.", "Pon los clavos de olor, el comino, el cilantro, la canela, 1½ cucharadita de sal y las semillas de las vainas de cardamomo en un mortero. Moler hasta obtener un polvo fino. Rallar la nuez moscada en la mezcla y la punta en la pasta de cebolla. Agregue un montón de pimienta negra recién molida. Mezcle hasta que todos los ingredientes estén combinados.", "Agregue tres cucharadas adicionales de aceite en la misma sartén que se utilizó para cocinar la carne y fría la pasta de cebolla especiada a fuego medio durante unos 10 minutos hasta que se dore ligeramente, revolviendo con frecuencia. Coloque la mezcla en la sartén con la carne. Agregue el yogur, 450ml / 16fl oz de agua y hojas de laurel. Coloque la sartén a fuego lento y cocine a fuego lento. Cubra con una tapa y cocine a fuego lento durante 1 hora y media o hasta que la carne esté tierna, revolviendo ocasionalmente.", "Retire la tapa de la sartén y agregue el azúcar. Aumente el fuego y cocine a fuego lento la salsa durante 10 minutos, o hasta que se reduzca y espese. Agregue un poco más de sal y pimienta al gusto.", "Tueste las almendras en una sartén antiadherente y cocine a fuego medio durante 4-6 minutos. Mezcle las pasas en las almendras y de inmediato la punta en un recipiente resistente al calor. Dejar de lado para enfriar.", "Cortar las dos cebollas restantes por la mitad y cortar en rodajas finas. Vierta dos cucharadas de aceite en una sartén y fría las cebollas durante 6-8 minutos a fuego bastante alto hasta que estén suaves y doradas, revolviendo con frecuencia. Dejar de lado.", "Precalentar el horno a 180C / 350F / Gas 4.", "Llene a la mitad una sartén grande con agua, agregue una cucharadita de sal y deje que hierva. Coloque el arroz en un colador y enjuáguelo bajo abundante agua fría. Revuelva el arroz en el agua caliente y vuelva a hervir. Cocine por cinco minutos y escurra bien. Agregue el cilantro y revuelva hasta que esté bien combinado.", "Transfiera la mitad de la carne y la salsa a un plato grande y resistente al horno. Ponga la mitad del arroz parcialmente cocido y rocíe con la mitad de los hilos y la leche empapados de azafrán. Cubra con la mitad de las cebollas fritas. Repita las capas una vez más. Punto con la mantequilla. Cubra el plato con dos capas de papel de aluminio y hornee durante 30 minutos.", "Hervir los huevos durante nueve minutos hasta que estén firmes y escurrirlos en un colador con agua corriente hasta que estén lo suficientemente fríos como para manipularlos. Pelar los huevos y cortar en cuartos.", "Retire el plato del horno y deseche la lámina. Use un tenedor para suavizar el arroz. Adorne con los huevos recién hechos, esparza con almendras tostadas y sultanas. Agregue algunas hojas frescas de cilantro y sirva."], "url": "www_bbc_co_uk_food_recipes_extra_special_beef_27357", "title": "Biryani de carne de vaca extra especial", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extra_special_beef_27357_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["una cantidad Tarta rica de fruta húmeda", "una cantidad Tarta rica de fruta húmeda", "una cantidad Tarta rica de fruta húmeda", "1 x 340 g / 12 oz de mermelada de albaricoque", "Mazapán de 5.5kg / 10lb", "azúcar en polvo, para quitar el polvo", "2.5kg / 5lb de glaseado real", "cintas, flores frescas o flores de fondant, para decorar"], "method": ["Para la torta de 25 cm / 10 pulgadas, hornee la torta de fruta de acuerdo con la receta. Retire la torta del horno y déjela enfriar.", "Para las tortas de 22cm / 8½ pulgadas y 10cm / 4 pulgadas, prepare la mezcla de tortas de acuerdo con la receta, divida entre las dos latas y cocine de acuerdo con la receta. Retire los pasteles del horno y déjelos a un lado para que se enfríen.", "Para las tortas de 18cm / 7in y 15cm / 6in, prepare la mezcla para pastel de acuerdo con la receta, divida entre las dos latas y cocine de acuerdo con la receta. (Habrá demasiada mezcla de tortas, y la mezcla sobrante se puede hornear en un molde para muffins). Retire los pasteles del horno y déjelos a un lado para que se enfríen.", "Cuando los pasteles estén fríos, cuchara la parte superior generosamente con brandy, whisky o jugo de naranja hervido, envuélvelos bien y déjalos durante 3-4 días antes de la formación de hielo.", "Para cubrir los pasteles en mazapán, diluya la mermelada de albaricoque con un poco de agua para que tenga la consistencia de crema doble y deje que hierva. Vierta la mermelada caliente a través de un colador en un recipiente, presionando cualquier trozo de fruta para extraer el líquido, luego déjelo hasta que esté tibio antes de usarlo.", "Si los pasteles han alcanzado su punto máximo en el medio durante la cocción, deberá cortarlos con cuidado. Pero si el pastel es simplemente abovedado, entonces no hay necesidad.", "Cubra el pastel de 10cm / 4 pulgadas con mazapán. Suavice los bordes con una torta más suave y reserve para secar en un lugar fresco y oscuro durante 4-5 días. Repita con los pasteles de 15cm / 6in, 18cm / 7in, 22cm / 8½in y 25cm / 10in.", "Aplique una capa fina de glaseado real en cada pastel y deje secar durante 2-3 días, luego aplique otra capa y déjelo secar por 2-3 días más. Lije las tortas con papel de lija para obtener un acabado realmente suave.", "Con una cuchara, coloque el resto del glaseado real en una manga pastelera equipada con una pequeña boquilla. Pase pequeños puntos por el borde superior e inferior de cada pastel. Para una decoración más elaborada, puede cubrir la torta en pequeños puntos.", "Para armar la torta, coloque la torta de 25cm / 10in en el tambor de la torta de 30cm / 12in. Coloque el tablón de 12cm / 4½ pulgadas en el medio de los 25cm / 10 pulgadas y marque cuatro puntos alrededor del borde en un cuadrado. Empuja una varilla de espiga en la torta y marca donde llega a la parte superior de la torta. Corta la varilla y otros tres del mismo largo e introdúcelos en la torta en los cuatro puntos.", "Coloque el tablón de 12cm / 4½ pulgadas en la parte superior de las varillas de sujeción y cubra con el espaciador de torta de poliestireno de 12cm / 4½ pulgadas. Coloque la torta de 22 cm / 8½ en la parte superior.", "Repita con la torta de 22cm / 8½ pulgadas y las tortas de 18cm / 7 pulgadas, terminando con la torta de 15cm / 6 pulgadas. Inserte varillas de espiga en el 15cm / 6in y finalmente coloque el pastel de 10cm / 4in en la parte superior. Decorar con flores frescas o fondant."], "url": "www_bbc_co_uk_food_recipes_extravagant_five-tiered_21283", "title": "Extravagante pastel de bodas de cinco niveles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 200", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/extravagant_five-tiered_21283_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600ml / 1 pinta 1fl de onza de leche entera", "1 cebolla, pelada y cortada en sextas (mantener la raíz intacta)", "2 hojas de laurel", "Filetes de pescado blanco de 500 g / 1 lb 2 oz, como bacalao, eglefino o abadejo", "Filete de abadejo ahumado 500 g / 1lb 2 oz, preferiblemente sin teñir", "Filete de salmón grueso de 500 g / 1 lb 2 oz", "6 huevos de gallinas camperas (opcional)", "75g / 3oz de mantequilla", "Harina normal de 75g / 3oz", "3 cucharadas de vino blanco", "100ml / 3½ fl oz crema doble", "eneldo fresco pequeño, hojas retiradas", "copos de sal marina y pimienta negra recién molida", "Papas de 1.25 kg / 2½ lb, peladas y cortadas en piezas de tamaño uniforme", "75g / 3oz de mantequilla, en cubos", "Crema doble 75ml / 3fl oz", "Cheddar maduro 150g / 5oz, rallado grueso"], "method": ["Para el relleno, vierta la leche en una cacerola grande y agregue la cebolla y las hojas de laurel. Sazonar con sal y pimienta negra recién molida. Coloque los filetes de pescado en la sartén y cocine a fuego lento. Cubra con una tapa y cocine por dos minutos. Retirar del fuego y reservar para reposar e infundir durante cinco minutos hasta que el pescado esté casi cocido. Escurra el pescado a través de un colador en un recipiente, luego vierta la leche en una jarra.", "Mientras tanto, para el relleno, cocine las papas en agua hirviendo a fuego lento durante 15 minutos o hasta que las papas estén suaves. Escurrir en un colador y luego volver a la sartén y mezclar con la mantequilla, la crema y tres cuartas partes del queso rallado. Sazone al gusto con sal y pimienta negra recién molida.", "Precalentar el horno a 200C / 400F / Gas 6.", "Llene una olla un tercio llena con agua y llévela a ebullición. Agregue los huevos suavemente al agua y cocínelos durante nueve minutos. Escurrir en un colador bajo agua corriente durante 1-2 minutos luego transferir a un recipiente de agua muy fría y reservar.", "Derrita la mantequilla en una cacerola mediana y agregue la harina. Cocine por unos segundos, y luego agregue gradualmente la leche infundida, el vino y la crema, revolviendo a fuego medio durante cinco minutos hasta que la salsa esté suave y espesa. Sazonar con sal y pimienta negra recién molida.", "Retire la salsa del fuego y agregue las hojas de eneldo en la salsa. Pele los huevos y córtelos a la mitad.", "Ponga un tercio de la salsa en la base de un plato grande para horno o 6-8 platos individuales. Esparce la mitad de los filetes de pescado sobre la salsa, rompiéndola en trozos gruesos a medida que avanzas, descartando la piel, la cebolla y las hojas de laurel. Coloque la mitad de los huevos encima y vierta otro tercio de la salsa. Continúe con el proceso de estratificación hasta que los ingredientes se hayan agotado.", "Coloque la papa sobre la mezcla de pescado, comenzando en los bordes antes de abrirse camino hacia el centro. Pelusa la patata con un tenedor y espolvorear con el queso restante. Coloque el plato en una bandeja para hornear y hornee en el centro del horno durante aproximadamente 45 minutos o hasta que la parte superior esté dorada y el relleno burbujee."], "url": "www_bbc_co_uk_food_recipes_fabulous_fish_pie_89662", "title": "Pastel de pescado fabuloso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fabulous_fish_pie_89662_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para espolvorear", "115g / 4oz de azúcar glas, cernida", "pizca de sal", "225g / 8oz de mantequilla fría sin sal, cortada en cubos", "1 huevo de gallinas camperas, más 2 yemas de huevo, ligeramente batidas", "6 yemas de huevo", "90g / 3¼ oz de azúcar en polvo", "40 g / 1½ oz de harina de maíz", "450ml / 16fl oz de leche entera", "2 vainas de vainilla, divididas longitudinalmente", "Crema doble 50ml / 2fl oz", "45 g / 1½ oz de mantequilla sin sal, cortada en trozos pequeños", "1-2 cucharadas de flor de saúco cordial, preferiblemente casero", "Bayas mixtas de 400 g / 14 oz, como grosellas rojas, arándanos, frambuesas y fresas", "Jalea de grosella roja 170 g / 6 oz, para glasear"], "method": ["Para la masa, coloque la harina, el azúcar glas y la sal en un procesador de alimentos y pulse brevemente para combinar. Agregue la mantequilla y pulse brevemente hasta que la mezcla se asemeje a pan rallado fino. Agregue los huevos batidos y las yemas y pulse hasta que la mezcla se una. Salga a la superficie de trabajo, amase muy brevemente y forme un disco grueso. Envuelva la masa en una película adhesiva y refrigere durante al menos una hora.", "Para la crema pastelera, ponga las yemas de huevo, el azúcar impalpable y la harina de maíz en un recipiente y mezcle bien hasta que se combinen.", "Coloque la leche y mezcle las vainas de vainilla en una cacerola y deje que hierva. Retirar del fuego y pescar cuidadosamente las vainas de vainilla. Lentamente vierta la leche caliente en la mezcla de huevo, batiendo todo el tiempo.", "Regrese la crema pastelera a la cacerola y cocine a fuego medio, revolviendo constantemente hasta que la mezcla esté muy espesa. Retirar del fuego y transferir la crema a un tazón grande. Agregue la crema y la mantequilla hasta que estén completamente combinados, luego agregue el cordial de flor de saúco al gusto (no desea que sea abrumador). Presione el pergamino para hornear sobre la superficie de la crema pastelera para evitar que la piel se forme y enfríe a temperatura ambiente, luego enfríe en la nevera hasta que lo necesite.", "Engrase doce latas de tarta acanalada de 10cm / 4in. En una superficie de trabajo ligeramente enharinada, extienda la masa hasta un grosor de 4 mm. Corta 11 cm / 4¼ en círculos de la masa para alinear las latas, volteando según sea necesario. Pinchar las bases con un tenedor y enfriar en la nevera durante 30 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Ponga un trozo de pergamino para hornear en cada caja de repostería y llénelo con alubias para hornear. Hornee en un horno precalentado durante 15 minutos, luego quite los frijoles y el pergamino y vuelva al horno durante 5-8 minutos más, o hasta que estén ligeramente dorados. Retirar del horno y dejar enfriar.", "Caliente la jalea de grosella en una cacerola hasta que se derrita. Cepille el interior de las cáscaras de repostería con una fina capa de gelatina.", "Llene las cajas con la crema pastelera y cubra con una generosa cantidad de fruta. Cepille los frutos con gelatina para darles un brillo."], "url": "www_bbc_co_uk_food_recipes_fabulous_fruity_jewelled_62910", "title": "Fabulosas tartas con gemas afrutadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 12 tartas individuales", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fabulous_fruity_jewelled_62910_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 500 g / 1 lb 2 oz, cascos eliminados", "400 ml / 14 fl oz crema doble", "3 x 7.5cm / 3in nidos de merengue listos para usar, aplastados", "1 cucharada de jengibre cordial (opcional)", "ramitas de menta fresca, para adornar"], "method": ["Puré la mitad de las fresas en una licuadora. Picar las fresas restantes, reservando cuatro para la decoración.", "Batir la crema doble hasta que se formen picos duros, luego doblar en el puré de fresa y merengue triturado. Doble las fresas picadas y el jengibre cordial, si está usando.", "Cuchara cantidades iguales de la mezcla en cuatro copas de vino frías. Sirva adornado con las fresas restantes y una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_etonmess_81082", "title": "Desastre de Eton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/etonmess_81082_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 cebolla mediana, pelada y finamente picada", "175g / 6oz de hígado de cerdo picado", "2 corazones de cordero o cerdo, recortados y cortados en trozos", "Vientre de cerdo de 450 g / 1 libra, cortado y quitado de la piel", "½ cucharadita de maza", "4 cucharadas de cebollines recién picados", "1 cucharadita de salvia recién picada", "1 huevo, golpeado", "sal y pimienta recién molida", "115g / 4oz de migas de pan blanco fresco", "Goteo de carne de 25 g / 1 oz o 3 cucharadas de aceite de oliva", "4 cebollas rojas, peladas y cada cebolla cortada en 8 cuñas", "4 ramitas de tomillo fresco", "1 cucharada de aceite de oliva", "900ml / 1½pt stock de carne fresca", "290ml / ½ pinta de vino tinto", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una olla pequeña y agregue las cebollas. Cocine hasta que esté suave y transparente. Enfriar ligeramente", "Coloque la panceta sobre una tabla de cortar y corte en porciones.", "Coloque el hígado de los cerdos picados en un recipiente de vidrio grande y colóquelo debajo de la cuchilla de una picadora. Usando una cuchilla fina de una picadora, pica el vientre de cerdo y el corazón de cordero directamente en el tazón con el hígado del cerdo. Si no tienes una picadora en casa, pide a tu carnicero que te quite toda la carne.", "Agregue las cebollas picadas, macis, cebollino, salvia, huevo batido y sal y pimienta. Agregue las migas de pan.", "Usando sus manos, forme la mezcla en 12 hamburguesas. Coloque en un plato y deje enfriar por aproximadamente 1 hora.", "Precaliente el horno a 200C / 400F / Gas 6. 7. Para la salsa: coloque las rodajas de cebolla en una fuente grande para asar o para horno. Agregue el tomillo y la llovizna sobre el aceite de oliva. Coloque en el horno y tueste sin tapar durante 40 minutos hasta que las cebollas estén caramelizadas.", "Mientras tanto caliente el goteo o el aceite de oliva en una sartén grande. Freír los fagots hasta que estén dorados por ambos lados.", "Coloque el caldo y el vino en una cacerola pequeña, lleve a ebullición y reduzca en un tercio.", "Retire las cebollas asadas del horno y coloque los fagots en la parte superior. Vierta sobre el licor de salsa. Reduzca la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y cocine los fagots durante 40 minutos.", "Coloque de dos a tres fagots en un plato. Cubra con una cucharada de cebollas y vierta sobre la salsa. Sirva los fagots con puré de papas y vegetales verdes."], "url": "www_bbc_co_uk_food_recipes_faggotswithoniongrav_3899", "title": "Faggots con salsa de cebolla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Rinde 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "225g / 8oz de azúcar", "Harina de levante 225g / 8oz", "225g / 8oz de mantequilla, derretida", "Mantequilla 110g / 4oz, ablandada", "170g / 6oz de azúcar glas", "55 g / 2 oz de cacao en polvo, tamizado", "1-2 cucharadas de leche", "botones de chocolate blanco", "botones de chocolate con leche"], "method": ["Precaliente el horno a 180C / 350F / Gas 4 y lin 2 latas de pastel de hadas de 12 hoyos con cajas de papel.", "Batir los huevos y el azúcar juntos en un bol hasta que estén suaves y esponjosos.", "Con cuidado dobla la harina y la mantequilla.", "Vierta la mezcla cuidadosamente en las cajas de papel.", "Hornee los pasteles durante 15-20 minutos, o hasta que estén dorados en la parte superior y un pincho insertado en uno de los pasteles salga limpio. Déjelo enfriar durante 10 minutos en una rejilla de alambre antes de sacarlo de la lata.", "Para hacer la crema de mantequilla, bata la mantequilla en un tazón grande hasta que esté suave. Agregue la mitad del azúcar glas y bata hasta que quede suave.", "Agregue el azúcar glas restante, el cacao en polvo y una cucharada de leche y bata hasta que quede cremoso. Agregue más leche si es necesario para aflojar la formación de hielo.", "Una vez que los pasteles estén fríos, extiende la crema de mantequilla en la parte superior de los pasteles.", "Decora los pasteles con los botones de chocolate."], "url": "www_bbc_co_uk_food_recipes_fairycakes_83889", "title": "Pasteles de hadas de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fairycakes_83889_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["110 g / 4 oz de mantequilla o margarina, ablandadas a temperatura ambiente", "Azúcar en polvo de 110 g / 4 oz", "2 huevos de gallinas camperas, ligeramente golpeados", "1 cucharadita de extracto de vainilla", "Harina de auto crianza 110g / 4oz", "1-2 cucharadas de leche", "300g / 10½oz de azúcar glas", "2-3 cucharadas de agua", "2-3 gotas de colorante de alimentos", "cientos y miles, u otras decoraciones para pasteles"], "method": ["Precalentar el horno a 180C / 350F / Gas 4 y alinear 2 latas de pastel de hadas de 12 hoyos con cajas de papel.", "Bata la mantequilla y el azúcar juntos en un tazón hasta que estén pálidos. Agregue los huevos, poco a poco, e incorpore el extracto de vainilla.", "Doble la harina con una cuchara grande de metal. Agregue un poco de leche hasta que la mezcla tenga una consistencia blanda y coloque la mezcla en las cajas de papel hasta que estén medio llenos.", "Hornee en el horno durante 8-10 minutos, o hasta que estén doradas en la parte superior y un pincho insertado en uno de los pasteles salga limpio. Poner a un lado para enfriar durante 10 minutos, luego retire de la lata y deje enfriar sobre una rejilla de alambre.", "Para la formación de hielo, tamice el azúcar glas en un tazón grande y agregue suficiente agua para crear una mezcla suave. Agregue el colorante de alimentos.", "Para helar los pasteles de hadas, rocíe la guinda sobre los pasteles, espolvoree con decoraciones y déjelas a un lado hasta que la formación de hielo se endurezca."], "url": "www_bbc_co_uk_food_recipes_fairycakes_93711", "title": "Magdalenas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fairycakes_93711_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 cebolla picada", "1 chile rojo, semillas retiradas y picadas", "1 diente de ajo, picado", "2 x 110 g de alubias, lavadas y escurridas", "caldo de verduras o agua", "4 tomates, semillas retiradas y picadas", "½ cebolla roja picada", "cilantro de racimo pequeño, picado", "1 lima", "1 paquete de tortillas de trigo", "250ml / 9fl oz de yogur natural o crema agria"], "method": ["Para el relleno, agregue el aceite a una sartén y cocine la cebolla, el chile y el ajo hasta que se ablanden. Agregue los frijoles y cocine por otros 10 minutos, revolviendo ocasionalmente. Agregue un poco de caldo de verduras, alrededor de la mitad de un vaso pequeño, cocine los frijoles hasta que la mezcla esté suave y no se moje.", "Mash los frijoles aproximadamente con la parte posterior de un tenedor o un triturador de papas, a continuación, dejar de lado.", "Para la salsa, mezcle los tomates, la cebolla roja, un chorrito de jugo de lima y un puñado del cilantro fresco picado.", "Justo antes de que esté listo para comer, agregue el cilantro restante y un chorrito de jugo de limón a los frijoles.", "Caliente cada tortilla en una sartén y póngala en un plato, cubra con una cuchara parte del relleno, agregue una cucharada del yogur y un poco de salsa. Enrolle y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fajitas_8651", "title": "Fajitas de frijoles vegetarianos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fajitas_8651_16x9.jpg", "isVegetarian": true, "recommendations": 0}]