[{"ingredients": ["4 rebanadas de pan integral", "2 cucharaditas de mostaza Dijon", "80g / 3oz de queso Gruyère rallado", "2 rebanadas de jamón", "30 g / 1½ oz de mantequilla sin sal"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Extienda media cucharadita de mostaza sobre cada rebanada de pan. Remate las dos rebanadas con la mitad del queso rallado seguido de una rebanada de jamón cada una, luego termine con el queso restante en la parte superior. Sandwich junto con las otras dos rebanadas de pan.", "Caliente la mantequilla en una sartén grande hasta que forme espuma, luego agregue los sándwiches y fría por 1-2 minutos por cada lado, o hasta que estén dorados.", "Transfiera los sándwiches a una bandeja para hornear y colóquelos en el horno durante 4-5 minutos, o hasta que el queso se haya derretido.", "Coloque los sándwiches en un plato para servir, corte cada sándwich a la mitad y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_croquemonsieur_90049", "title": "Croque señor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/croquemonsieur_90049_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de chapata, cortadas en diagonal", "1 cucharada de aceite de oliva", "3 pimientos rojos asados ​​de una jarra, escurridos", "55 g / 2 oz de queso dolcelatte, en rodajas", "1 ramita de perejil fresco"], "method": ["Rocíe la chapata con aceite de oliva y pan tostado en ambos lados en una sartén caliente.", "Retire la chapata. Agregue los pimientos a la sartén de la plancha y déjelos dorar por 1-2 minutos por cada lado.", "Transfiera el pan tostado a una bandeja para hornear. Cubra con los pimientos a la parrilla y la dolcelatte. Transfiera al horno y hornee por cinco minutos, o hasta que el queso se derrita.", "Para servir, colóquelo en un plato y adorne con una ramita de perejil."], "url": "www_bbc_co_uk_food_recipes_crostiniwithpepperan_84561", "title": "Crostini con pimienta y dolcelatte", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla, dividida", "2 naranjas, peladas y segmentadas", "2 claras de huevo de gallinas camperas, ligeramente batidas", "55 g / 2 oz de mantequilla, derretida", "3-4 hojas de pasta de filo lista para usar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el azúcar en una sartén pequeña a prueba de horno hasta que se derrita. Agregue la vaina de vainilla y cocine hasta que el azúcar tenga un color caramelo profundo. Agregue los segmentos de naranja y revuelva para cubrir. Retire la vaina de vainilla (se puede usar de nuevo en otro plato).", "Coloque las claras de huevo y la mantequilla derretida en un tazón y mezcle bien. Cepille esta mezcla sobre cada hoja de hojaldre. Arruga las hojas de hojaldre y colócalas encima de la mezcla de naranja caramelizada.", "Transfiera al horno y hornee durante 5-6 minutos, o hasta que la masa esté crujiente y dorada.", "Para servir, coloca el croustade en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_croustadewithcaramel_85495", "title": "Croustade con naranjas caramelizadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "pizca de sal", "Azúcar en polvo 350g / 12oz", "2 cucharadas de harina de maíz", "1 cucharadita de vinagre de vino blanco", "Crema doble de 600 ml / 20 fl oz, batida hasta que se forman picos suaves cuando se quita la batidora", "Fresas de 250g / 9oz, descascaradas", "250 g / 9 oz de arándanos", "flores cristalizadas, para decorar (vea la sugerencia de la receta superior a continuación)", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Dibuje dos círculos de 20cm / 8in y un círculo de 15cm / 6in en papel resistente a la grasa y colóquelos en tres bandejas de hornear separadas.", "Batir las claras de huevo y la sal en un tazón grande limpio y seco hasta que formen picos suaves cuando se quite el batidor. Bata lentamente el azúcar y continúa batiendo hasta que las claras de huevo estén rígidas y brillantes. Agregue la harina de maíz y el vinagre.", "Coloca un tercio de la mezcla en uno de los círculos de 20 cm / 8 pulgadas. Con una cuchara, coloca otro tercio en el otro círculo de 20cm / 8 pulgadas.", "Vierta la mitad de la mezcla restante en el círculo de 15cm / 6 pulgadas. Pipe el merengue restante alrededor del borde del círculo 15cm / 6in en forma de corona.", "Reduzca el horno a 140C / 275F / Gas 1 y hornee los merengues durante 1-1¼ horas, o hasta que el merengue esté crujiente afuera, pero se siente suave pero dentro. (Si nota que los diferentes merengues no se cocinan uniformemente, cambie los estantes.) Apague el horno y deje que el merengue se enfríe en el horno.", "Para ensamblar la pavlova, quite con cuidado el papel antigrasa de la parte inferior de los merengues. Coloque un merengue de 20cm / 8in en un plato de servir grande y plano. Extienda un tercio de la crema doble sobre el merengue y cubra con algunas de las fresas y los arándanos. Cubra con el otro merengue de 20cm / 8in. Extienda otro tercio de la crema en el merengue y cubra con más fresas y arándanos. Cubra con el merengue de 15cm / 6in y rellene con la crema restante, las fresas y los arándanos. Decora con las flores cristalizadas y el polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_crown_layered_pavlova_80809", "title": "Pavlova en capas de corona", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crown_layered_pavlova_80809_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["280g / 10oz de mantequilla de brandy", "25 g / 1 oz de azúcar en polvo, más extra para servir", "2 naranjas, cáscara y jugo solamente", "2 cucharadas de brandy, más extra para servir", "2 clementinas, peladas y segmentadas", "12 crepes confeccionadas o panqueques delgados"], "method": ["En una sartén grande, combine 85 g / 3 oz de la mantequilla de brandy con el azúcar, el jugo, la ralladura, el brandy y las clementinas. Calienta suavemente durante unos minutos para espesar el líquido.", "Retire la fruta y déjelos a un lado para servir. Agregue los panqueques uno por uno, doblando cada uno en cuartos a medida que avanza. Cuando los panqueques estén tibios, transfiéralos a un plato para servir.", "Derretir la mantequilla de brandy restante en la sartén. Bate en la salsa y vierte sobre los panqueques.", "Para servir, espolvorear los panqueques con un poco más de azúcar, agregar las clementinas y mojar en más brandy. Para un toque final, prende fuego justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_crpes_with_clementines_74432", "title": "Crêpes con clementinas y mantequilla de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de masa de copos crujientes", "4 cucharadas redondas de crema de limón", "30g / 1oz de mantequilla", "2 cucharadas de avena", "2 cucharadas de azúcar en polvo", "2 cucharadas de harina autofrenada, más extra para espolvorear"], "method": ["Lávese las manos y póngase un delantal. Pese y mida todos los ingredientes. Precalentar el horno a 200C / 400F / Gas 5.", "Estirar la masa sobre una superficie ligeramente enharinada y cortar cuatro círculos con un cortador de 8 cm / 3¼ pulgadas. Haga cuatro agujeros en una lata de panecillos con los círculos de hojaldre.", "Coloque la cuajada de limón en las cajas de los pasteles.", "Derrita la mantequilla en una olla pequeña y deje que se enfríe un poco. Luego agregue la avena, el azúcar y la harina a la mantequilla y mezcle con un tenedor, dividiéndolo en migas.", "Espolvoree las migas en la parte superior de las tartas. Coloque la lata de panecillo en una bandeja para hornear y hornee durante 15-20 minutos. Servir con frambuesas frescas o fresas."], "url": "www_bbc_co_uk_food_recipes_crumble-topped_tarts_57648", "title": "Tartas crumble-top", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 grandes puñados de avena", "1 pequeño puñado de semillas mezcladas o nueces picadas mixtas", "botón de mantequilla", "3 cucharadas de azúcar moreno", "1 cucharadita de canela"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Pon la avena y las semillas en un tazón. Derrita la mantequilla, el azúcar moreno y la canela en una sartén. Cuando se derrita, vierta en la avena y las semillas y revuelva hasta que esté completamente cubierto.", "Vierta la mezcla en una bandeja para hornear forrada con papel de aluminio o papel para hornear, extiéndala en una capa uniforme. Hornee en el horno durante 10 minutos, revolviendo dos veces, hasta que esté dorado. Deje que se enfríe completamente, luego guárdelo en un recipiente hermético. Se mantendrá durante aproximadamente una semana."], "url": "www_bbc_co_uk_food_recipes_crumble_pot_topping_48476", "title": "Crumble pot top", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde de 10 a 12 porciones", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crumble_pot_topping_48476_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos grandes de gallinas camperas, solo yemas", "½ limón, solo jugo", "Mantequilla 250g / 9oz, derretida", "pizca de pimienta blanca y sal", "2 cucharadas de vinagre de vino blanco", "4 huevos grandes de gallinas camperas", "4 bollos tostados", "4 lonchas de tocino ahumado a la parrilla"], "method": ["Para hacer el holandesa, coloque las yemas de huevo, el jugo de limón y una cucharada de agua en el tazón de un procesador de alimentos. Enciéndelo y mezcle por un minuto. Con el motor aún funcionando muy lentamente, regue la mantequilla derretida caliente a través del embudo en la tapa del procesador. La salsa comienza a espesar lentamente. Cuando se haya incorporado toda la mantequilla, raspe el lado del tazón y dé un pulso final. Sazonar con sal y un poco de pimienta blanca. Deberías tener una rica salsa mantecosa.", "Para pochar los huevos, hierva dos litros de agua con el vinagre. Baje el fuego para que el agua no burbujee.", "Rompa los huevos en moldes o tazas separadas. Deslice los huevos en el agua y déjelos reposar de 2 a 3 minutos. Alternativamente, mezcle el agua para formar un vórtice antes de deslizar el primer huevo y cocínelos de uno en uno. Cocine durante 2-3 minutos, retírelos y drene.", "Para servir, coloque un bollo en un plato y cubra con un huevo escalfado, ponga una salsa y coloque el tocino al costado."], "url": "www_bbc_co_uk_food_recipes_crumpet_eggs_benedict_35751", "title": "Crumpet eggs Benedict", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de harina blanca fuerte", "Harina normal 175g / 6oz", "2 bolsitas de 7 g de levadura instantánea", "1 cucharadita de azúcar en polvo", "350ml / 12fl oz de leche caliente", "150-200ml / 5-7fl oz de agua tibia", "½ cucharadita de bicarbonato de soda", "1 cucharadita de sal", "aceite de girasol para cocinar"], "method": ["Pese las harinas en un tazón. Agregue la levadura y revuelva a través de la harina.", "Disuelva el azúcar en la leche tibia y vierta sobre la harina. Usando un golpe de cuchara de madera hasta que tenga una mezcla suave. Esto llevará 3-4 minutos y es un trabajo duro, pero es esencial para producir los agujeros en los bollos.", "Cubra y deje por lo menos 20 minutos y hasta una hora. La masa se levantará y luego comenzará a caer. Verá marcas en el costado del tazón donde estaba la mezcla antes de que caiga.", "Mezcle el bicarbonato de sodio y sal con el agua tibia y golpéelo en la mezcla. Agregue aproximadamente ¾ del agua y continúe añadiéndola hasta obtener una consistencia doble de crema. Cubra y descanse durante 20 minutos.", "Caliente una plancha plana o una sartén de base pesada. Engrase ligeramente el interior de cuatro anillos de crumpet de metal. Engrase ligeramente la plancha. Siente los anillos en la plancha a fuego medio.", "Coloque dos cucharadas de postre de mezcla en cada anillo. Después de 4-5 minutos, deberían aparecer burbujas y la superficie debe establecerse. Con cuidado, gire los bollos en sus anillos y cocine por otros tres minutos.", "Sirva inmediatamente o deje enfriar y luego tueste antes de comer con mucha mantequilla."], "url": "www_bbc_co_uk_food_recipes_crumpets_61013", "title": "Bollos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 10-12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crumpets_61013_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350ml / 12¼fl oz de leche entera", "225g / 8oz de harina blanca fuerte", "125g / 4½oz de harina natural", "1 x 7 g / ¼ onza de levadura seca de acción rápida", "½ cucharadita de sal marina fina", "1 cucharadita de azúcar en polvo", "1 nivel de cucharadita de bicarbonato de soda", "150ml / 5¼fl oz de agua tibia", "mantequilla, para engrasar, más extra para servir"], "method": ["Caliente la leche en una cacerola muy suavemente hasta que esté tibia.", "Tamiza las harinas en un tazón grande y agrega la levadura, la sal y el azúcar hasta que estén bien combinadas.", "Haga un pozo en el centro de la mezcla y agregue la leche tibia. Batir bien con una cuchara de madera durante 3-4 minutos o hasta que la masa esté espesa y elástica.", "Cubra el tazón con película adhesiva y déjelo a un lado en un lugar cálido durante una hora, o hasta que la masa se haya duplicado.", "Cuando la masa haya subido, mezcle el bicarbonato de soda con agua tibia y agregue la mezcla a la mezcla por un par de minutos. Reserve para descansar en un lugar cálido por otros 30 minutos. En este momento, la mezcla debería haber subido y estar cubierta de pequeñas burbujas.", "Caliente una sartén plana o una sartén grande antiadherente a fuego medio-alto.", "Mantega generosamente el interior de cuatro anillos de pan de abeja o 9cm / 3½ en los anillos de los chefs y colócalos en la plancha o en la sartén. Caliente los anillos por un minuto o dos.", "Usando una cucharada de postres, vierta tres cucharadas grandes de la mezcla de bollo en cada anillo. Debería llegar alrededor de 1.5 cm / ½ pulgada por los lados de cada anillo, pero no más. Cocine durante 9-12 minutos, o hasta que muchas burbujas diminutas hayan salido a la superficie y estallen y las partes superiores parezcan secas y fraguadas.", "Levante con cuidado los anillos, no debe ser demasiado difícil ya que los panecillos se moverán hacia atrás desde los lados cuando estén listos. (Use un guante de horno y tenga cuidado ya que los anillos de los bollos estarán calientes).", "Voltee los panecillos con una espátula y cocine en el otro lado durante otros dos minutos, o hasta que estén dorados. Puede mantener calientes estos bollos mientras se prepara el rebozado restante, o servir inmediatamente extendido con mucha mantequilla.", "Cocine los panecillos restantes exactamente de la misma manera que el primero, lavándolos y untándolos bien antes de volverlos a usar. Los bollos también se pueden enfriar y luego tostar."], "url": "www_bbc_co_uk_food_recipes_crumpets_93122", "title": "Bollos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["340g / 12oz de yogur natural sin grasa al estilo griego", "1 banana, pelada y rebanada", "15g / ½oz de semillas mezcladas (calabaza, sésamo y girasol) (o use almendras copos tostadas)"], "method": ["Divida el yogur entre dos tazones pequeños. Esparce el plátano en la parte superior.", "Espolvoree con semillas o nueces y sirva."], "url": "www_bbc_co_uk_food_recipes_crunchy_banana_yoghurt_48211", "title": "Yogur de plátano crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_banana_yoghurt_48211_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 escalopes de pollo o filetes de pechuga (200-300 g / 7-10½ oz en total), preferiblemente orgánicos", "70g / 2½ oz de mostaza Dijon", "1 diente de ajo, finamente rallado o picado", "½ cucharadita de canela molida", "1 huevo de gallinas camperas", "75g / 2oz de copos de maíz", "1½ tsp pimentón picante or paprika", "2 cucharadas de aceite de girasol", "tomates cherry", "cohete o ensalada de hojas de su elección", "1 limón, cortado en cuñas", "tomates cherry", "cohete o ensalada de hojas de su elección", "1 limón, cortado en cuñas"], "method": ["Saca el pollo de la nevera para que no esté demasiado frío al momento de freír. Si está usando pechugas de pollo fileteadas, en lugar de escalopes, proceda como se describe en la sección de consejos.", "Saque un plato poco profundo que, preferiblemente, puede obtener ambos escalopes y cuchara en la mostaza y el ajo. Agregue la canela y el huevo y bata para combinar. Coloque los escalopes, gírelos y déjelos reposar en la mezcla mientras prepara las \"migas\".", "Pon los copos de maíz en un recipiente y tritúralos con la mano. Esto, tristemente, no es tan brutal como suena: simplemente divídalos con los dedos para obtener escamas gruesas y trituradas, pero no polvo. Agregue el pimentón o pimentón y use un tenedor para mezclar.", "Saque los escalopes empapados de huevo y mostaza, uno por uno, en las migas de copos de maíz, de modo que queden bien cubiertos, y luego transfiéralos a una rejilla de alambre durante 5-10 minutos para que se sequen.", "Caliente el aceite en una sartén de hierro fundido o en una sartén de base pesada en la que las piezas de pollo se ajusten perfectamente. Una vez caliente, fría el pollo durante 3 minutos en el primer lado, luego voltéelos con cuidado y déles otros 3 minutos, momento en el cual el pollo debe estar bien cocido en el medio, aunque controle. Retire a los platos que esperan, ya sembrado de tomates y rúcula o hojas de ensalada de su elección."], "url": "www_bbc_co_uk_food_recipes_crunchy_chicken_cutlets_21611", "title": "Chuletas de pollo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_chicken_cutlets_21611_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de ghee o mantequilla clarificada", "2 cebollas, finamente picadas", "Jengibre fresco de raíz de 5cm / 2in, pelado y finamente picado", "3 dientes de ajo picados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de cúrcuma molida", "½ cucharadita de semillas de fenogreco", "1 chile rojo caliente", "1 cucharadita de sal", "400g de tomates cortados en lata", "1 cucharadita de azúcar en polvo", "2 cucharaditas de sal masala", "50 g / 1¾oz de sémola", "200g / 7oz paneer, cortado en cubos de 2cm / ¾in", "1 cucharada de aceite vegetal", "500 g / 1 libra de espinaca 2 oz, lavado", "pequeño puñado de hojas de cilantro fresco picado", "exprimir jugo de limón"], "method": ["Caliente el ghee en una cacerola, agregue las cebollas y cocine durante 3 minutos o hasta que estén suaves. Agregue el jengibre y el ajo y cocine por 1 minuto.", "Agregue el comino, el cilantro molido, la cúrcuma, el fenogreco, el chile y la sal. Cocine, revolviendo, durante 1 minuto para infundir todas las especias. Agregue los tomates y el azúcar, revuelva y cocine a fuego lento durante 10 minutos.", "Mientras tanto, en un tazón, combine el garam masala y la sémola. Mezcle en el paneer para cubrirlo. Calentar el aceite en una sartén y cocinar el paneer durante unos minutos hasta que esté crujiente y dorado por todos lados.", "Agregue la espinaca a la salsa de tomate con 2 cucharadas de agua, revuelva y cocine hasta que se marchite. Doble en el paneer crujiente. Retire todo el chile.", "Sirva adornado con cilantro fresco y jugo de limón."], "url": "www_bbc_co_uk_food_recipes_crunchy_palak_paneer_42857", "title": "Queso de paneer con costra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_palak_paneer_42857_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["900 g / 2 libras de manzanas bramley", "350-400g / 12oz-1lb moras", "175g / 6oz demerara azúcar", "2 limones", "Harina normal 225g / 8oz", "175g / 6oz de mantequilla", "Azúcar demerara 55 g / 2 oz", "Muesli 125g / 4oz o una mezcla de avena, semillas y nueces picadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Pelar, cortar y cortar las manzanas en trozos pequeños. Cortar los limones por la mitad y exprimir el jugo sobre la manzana y mezclar bien. Esto no solo agrega sabor sino que evita que las manzanas recién peladas se decoloren.", "Coloque las manzanas, las moras y el azúcar en un plato grande para pastel (un plato de lasaña es ideal).", "Coloque la harina en un tazón grande y luego frote la mantequilla hasta que se asemeje a pan rallado - deje algunos trozos de mantequilla para que el relleno no sea demasiado fino. Agregue la mezcla de muesli o avena / semilla / nuez y el azúcar y mezcle.", "Use una cuchara para espolvorear el crumble encima uniformemente sobre la fruta. Hornee durante 45 minutos o hasta que la fruta esté cocida y los jugos burbujeantes se filtren a través de la cobertura.", "Dejar enfriar por unos minutos y luego servir con flan o crema fresca."], "url": "www_bbc_co_uk_food_recipes_crunchyappleandblack_7679", "title": "Crumble crujiente de manzana y mora", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchyappleandblack_7679_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo de 225 g / 8oz", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 tomates de ciruela", "¼ de chile rojo fresco, sin semilla", "2 filetes de anchoa, de una lata", "¼ de pimiento rojo, sin semillas", "¼ cebolla roja pequeña pelada", "½ diente de ajo, pelado", "2 cucharadas de aceite de oliva", "115g / 4oz de polenta instantánea", "Hojas de cohete de 115g / 4oz", "½ diente de ajo, pelado", "1 cucharada de piñones, tostados", "8 cucharadas de aceite de oliva"], "method": ["Para hacer el relleno, coloque los tomates, el chile, la anchoa, el pimiento rojo, la cebolla y el ajo en una licuadora y puré hasta obtener una pasta áspera.", "Agregue el aceite de oliva y sazone bien con sal y pimienta.", "Combina este puré con la polenta instantánea en un bol.", "Coloque todos los ingredientes de pesto en la licuadora y mezcle en un puré fino. Retire de la licuadora y déjelo a un lado.", "Precalentar el horno a 200C / 400F / Gas 6.", "Sazone las pechugas de pollo con sal y pimienta. Calentar el aceite de oliva en una sartén y sellar las pechugas de pollo durante unos minutos en cada lado para colorear la carne.", "Coloque las pechugas de pollo en una bandeja de horno y cubra cada una con una capa gruesa de la mezcla de polenta.", "Hornee en el horno durante aproximadamente 20 minutos para cocinar el pollo y deje que el relleno se ponga crujiente.", "Coloque las pechugas de pollo en un plato y sirva con una cucharada de pesto de rúcula al costado."], "url": "www_bbc_co_uk_food_recipes_crunchychillichicken_74008", "title": "Pollo crujiente de chile con pesto de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cucharadas de harina común", "2 cucharadas de azúcar en polvo", "2 cucharadas de mantequilla de maní crujiente", "1 yema de huevo de gallinas camperas", "50g / 1¾oz de mantequilla, ablandada", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la harina, el azúcar, la mantequilla de maní, la yema de huevo y la mantequilla en un tazón grande y mezcle hasta que se combine con una masa suave.", "Con las manos ligeramente enharinadas, rompa los pedazos de la masa de forma uniforme y enrolle en bolas del tamaño de una nuez.", "Coloque las bolas de masa en una bandeja para hornear forrada con papel de silicona o pergamino para hornear y presione suavemente cada bola con la parte posterior de un tenedor para aplanar ligeramente.", "Coloque en el horno y hornee por diez minutos, o hasta que se torne dorado.", "Transfiera las galletas a una rejilla de alambre y déjelas enfriar por diez minutos.", "Para servir, coloque en un plato para servir y espolvoree con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_crunchypeanutbutterc_87012", "title": "Galletas de mantequilla de maní", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchypeanutbutterc_87012_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ lechuga iceberg, rallada", "¼ de pimiento rojo, sin semillas, en rodajas finas", "¼ de pimiento amarillo, sin semillas, en rodajas finas", "¼ de cebolla, finamente rebanada", "2 cucharadas de perejil fresco picado", "½ limón, ralladura y jugo", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["En un tazón grande, mezcle la lechuga, el pimiento rojo y amarillo, la cebolla y el perejil.", "En un tazón pequeño, mezcle la ralladura de limón, el jugo de limón y el aceite de oliva, y sazone con sal y pimienta negra recién molida.", "Para servir, rocíe el aderezo sobre la ensalada y mezcle bien para cubrir. Servir amontonado en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_crunchypeppersaladwi_90718", "title": "Ensalada de pimiento crujiente con aderezo de limón y aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de papas nuevas de Cornualles (si no puedes usar Cornish usa Jersey)", "2L / 3½pt agua para cubrir", "2 cabezas de ajo, cortadas por la mitad", "2 hojas de laurel grandes", "20 ramitas de tomillo", "1 cucharadita de caldo de pollo", "40 g / 1½ oz de sal", "100g / 3½ mantequilla sin sal", "sal y pimienta"], "method": ["Frote y lave las papas nuevas y colóquelas en una cacerola.", "Cubra con el agua y luego agregue el resto de los ingredientes, excepto la mantequilla y el condimento final.", "Llevar a ebullición y reducir a fuego lento.", "Cocine por aproximadamente 20 minutos.", "Una vez cocinado, escurra y use un tenedor o un triturador de patatas, triture las patatas ligeramente, agregue la mantequilla y sazone con sal y pimienta."], "url": "www_bbc_co_uk_food_recipes_crushedcornishpotato_11368", "title": "Patatas de Cornualles machacadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1 lb 5oz de patatas nuevas", "1 cucharada de mantequilla", "1 cucharada de crema", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir una olla grande de agua y agregue las papas nuevas. Hervir hasta que esté tierno", "Escurrir y aplastar con la parte posterior de un tenedor.", "Agregue la mantequilla y la crème fraîche y sazone al gusto con sal y pimienta negra recién molida.", "Servir."], "url": "www_bbc_co_uk_food_recipes_crushednewpotatoes_88411", "title": "Patatas nuevas trituradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5¼ oz nuevas patatas", "¼ de puerro, picado", "25g / 1oz de mantequilla", "1 rebanada de jamón de Parma"], "method": ["Para la torta de patata, cocine la patata nueva en agua hirviendo durante cinco minutos, aplastar con un tenedor.", "Agregue la papa a los puerros y fría en la mantequilla durante cinco minutos hasta que estén dorados y crujientes.", "Servir boca abajo en un plato.", "Crujiente el jamón de Parma en una sartén caliente a fuego alto y voltee, cocine por 2-3 minutos.", "Escurra la grasa en papel de cocina.", "Sirve el crujiente jamón de Parma con el pastel de papa."], "url": "www_bbc_co_uk_food_recipes_crushedpotatoandleek_76109", "title": "Pastel de patata y puerro triturado, con jamón de Parma crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]