[{"isVegetarian": false, "title": "Aberdeen Butteries (Rowies)", "url": "www_bbc_co_uk_food_recipes_aberdeenbutteriesrow_92370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g / 1lb 2 oz de harina lisa fuerte, más extra para quitar el polvo", "1 x 7g bolsita mezcla fácil levadura seca", "1 cucharada de azúcar moreno claro", "1 cucharada de escamas de sal marina", "350ml / 12¼fl oz de agua tibia", "aceite vegetal, para engrasar", "275g / 9¾oz de mantequilla, más extra para servir", "100g / 3½ oz de tocino", "mermelada preparada, para servir"], "serves": "Hace 16", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["En un tazón grande, mezcle la harina, la levadura, el azúcar y la sal hasta que estén bien combinados.", "Haga un pozo en el centro de la mezcla, luego agregue gradualmente el agua en una corriente fina, revolviendo bien con una cuchara de madera, hasta que la mezcla se una como una masa. (Nota: es posible que no necesite usar toda el agua).", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar ligeramente durante 8-10 minutos, o hasta que quede suave y elástica.", "Transfiera la masa amasada a un recipiente limpio y engrasado y cúbrala con una lámina engrasada de película adhesiva. Déjelo a un lado en un lugar cálido para que se levante (pruebe) durante al menos una hora, o hasta que la masa se haya duplicado.", "Mientras tanto, en un recipiente aparte, mezcle la mantequilla y la manteca de cerdo hasta que estén bien combinados. Divida la mezcla en cuatro porciones iguales.", "Cuando la masa haya demostrado, colócala en una superficie ligeramente enharinada y amasa durante 1-2 minutos más.", "Estirar la masa en un rectángulo de 40cm x 20cm / 16in x 8in, aproximadamente 1cm / ½ in de espesor.", "Voltee la masa para que el borde más corto quede hacia usted. Extienda una porción de la mantequilla y la mezcla de manteca de cerdo en los dos tercios inferiores del rectángulo de la masa.", "Doble el tercio restante del rectángulo de masa sobre la mantequilla y la mezcla de manteca de cerdo para cubrir la sección central del rectángulo de masa. Doble el otro extremo del rectángulo de masa sobre la masa doblada, de modo que la masa termine tres veces su grosor original.", "Voltee la masa nuevamente a un rectángulo de 40cm x 20cm / 16in x 8in, aproximadamente 1cm / ½ pulgada de grosor. Repita el proceso de extender y doblar con otra porción de la mantequilla y la mezcla de manteca de cerdo.", "Repita el proceso dos veces más, hasta que toda la mezcla de manteca y manteca se haya agotado y la masa se haya extendido un total de cuatro veces.", "Precalentar el horno a 200C / 400F / Gas 6.", "Voltee la masa nuevamente a un rectángulo de 40cm x 20cm / 16in x 8in, aproximadamente 1cm / ½ pulgada de grosor. Cortar la masa en 16 piezas y enrollar cada una en una forma redonda y plana.", "Transfiera los bollos a una bandeja para hornear ligeramente engrasada y déjelos a un lado durante 40-45 minutos, o hasta que hayan duplicado su tamaño nuevamente (deje suficiente espacio entre ellos para la expansión).", "Cuando los panecillos hayan subido, hornéelos en el horno durante 15-18 minutos, o hasta que hayan aumentado más y estén dorados y cocidos. Dejar de lado para enfriar en una rejilla de alambre.", "Sirva cada manteca caliente, unte con mantequilla y mermelada."]}, {"isVegetarian": false, "title": "Abundante lubina al vapor y almejas de temporada con aceite chisporroteante", "url": "www_bbc_co_uk_food_recipes_abundant_steamed_sea_22932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 colinabal violeta o amarillo, pelada y cortada en cubos de 1cm / ½ en cubitos", "2 cucharadas de bayas de goji secas", "2 cucharadas de mirin", "2 cucharadas de vinagre de arroz", "2 pizcas de sal marina agrietada", "2 pizcas de azúcar en polvo", "1 lubina entera grande (aproximadamente 460 g / 1 libra), limpia y a escala, cabeza y cola en", "sal marina y pimienta blanca recién molida", "Jengibre fresco de 2,5 cm / 1 onza, pelado y finamente cortado, más 1 cucharada de jengibre rallado", "4 cucharadas de lager chino ligero", "Almejas palourde de 100 g / 3½ oz, conchas lavadas (descartar las almejas que no se cierran al tocarlas)", "3 cucharadas de aceite de maní", "2 cebollas de primavera, cortadas en largas 'orejas de caballo' en un ángulo agudo", "pocos pellizcos de berro de berro", "2-3 cucharadas de salsa de soya ligera baja en sodio", "2 cucharadas de aceite de sésamo tostado", "blanqueado bebé pak choi mitades", "rizos de cebolla de primavera", "hierbas micro cilantro"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la goji berry y el pickle de colinabo, en una sartén pequeña, sancochar los cubos de colinabo. Escurra y coloque en un plato para enfriar en la nevera durante 10 minutos.", "Coloque las bayas de goji en un recipiente resistente al calor, vierta sobre agua hirviendo, déjela por un minuto y luego enjuague y drene.", "En un tazón pequeño, mezcle el colinabo frío y las bayas de goji. Antes de servir, agregue el resto de los ingredientes y mezcle bien para un delicioso y rápido pepinillo para servir con el pescado.", "Para la lubina, prepare el pescado enjuagándolo con agua fría y séquelo con toallas de papel. Corte dos ranuras en ambos lados del pescado y sazone con sal y pimienta blanca.", "Rellena las hendiduras y dentro de la cavidad abdominal con el jengibre rebanado. Coloque el pescado en una placa resistente al calor (asegurándose de que la placa y el pescado quepan dentro del vaporizador de bambú sin cubrir todos los orificios de vapor alrededor de los bordes de la placa). Ponga a un lado otra bandeja y plato de vapor de bambú para usar con las almejas.", "Vierta la mitad de la lager china ligera sobre el pescado. Coloque el plato de pescado en un vapor de bambú, apile y cubra con la tapa. Coloque toda la canasta de vapor sobre un wok que esté lleno tres cuartos con agua hirviendo, asegurándose de que el agua no toque la base del vaporizador.", "Cueza al vapor hasta que el pescado esté cocido y la carne se descascare cuando lo toque con un cuchillo: aproximadamente de 8 a 10 minutos (dependiendo del grosor del pescado. No lo cocine al vapor demasiado tiempo o la piel se separará, no se verá tan bien y se ser menos tierno).", "Después de cuatro minutos de cocción al vapor, coloque las almejas palourde en una placa resistente al calor separada que se ajusta dentro de otra bandeja de vapor de bambú. Sazonar con sal, pimienta blanca molida, jengibre rallado y rociar sobre la lager China light restante. Cuece al vapor las almejas con el pescado hasta que la carne del pescado se desmenuce cuando se asienten y se hayan abierto todas las conchas de las almejas.", "Una vez que la lubina esté cocida, apague el fuego. Deja la lubina en el barco de vapor para mantenerte caliente.", "Para terminar la lubina, calentar un wok pequeño, agregar el aceite de maní y calentar a fuego alto durante un minuto. Quítate el calor. Retire la tapa del vaporizador de bambú para el pescado y coloque las cebolletas y el berro en la parte superior. Vierta sobre la salsa de soja ligera baja en sodio, seguida del aceite de sésamo tostado. Vierta sobre el aceite de cacahuete caliente y se creará un chisporroteo a medida que se calientan las cebollas y las hierbas de primavera.", "En la forma tradicional china, el pescado se sirve entero en el vapor en la mesa porque simboliza la unidad y la completitud, pero también se puede servir porciones individuales para una presentación más moderna.", "Para servir, coloca un filete de lubina en un plato caliente, decora con algunas almejas palourde, la goji berry y el swede quick 'pickle', las hojas baby pak choi escaldadas, los rizos de cebolleta y las micro hierbas de cilantro. Coloque los jugos de pescado sobre los peces y las almejas y sirva inmediatamente."]}, {"isVegetarian": false, "title": "Pechuga de pollo glaseada con miel de Acacia con tomate, alcachofa y berro", "url": "www_bbc_co_uk_food_recipes_acaciahoneyglazedchi_83634", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 alcachofa grande", "1 limón, en rodajas", "1 cucharada de harina normal", "1 cucharadita de aceite de oliva", "2 x 225 g / 8oz de pechuga de pollo alimentada con maíz, con hueso en el ala, recortado", "2 cucharadas de miel de acacia", "1 limón, solo jugo", "1 tomate de ternera, sin núcleo, cortado en ocho piezas", "¼ de pepino, cortado a la mitad longitudinalmente, sin semillas y en rodajas finas", "1 chalota de plátano, en rodajas finas", "2 dientes de ajo, en rodajas finas", "pequeñas cebolletas frescas, cortadas en longitudes de 2cm / 1in, empapadas en agua", "6 ramitas de perifollo fresco, remojadas en agua", "2 cucharadas de vinagre de jerez", "2 cucharaditas de mostaza integral", "3 cucharadas de yogurt natural", "sal y pimienta negra recién molida", "1 manojo de berros, empapado en agua"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la alcachofa, corte el tallo, retire las hojas duras y recorte las hojas con tijeras. Acorte el corazón de alcachofa limpia y uniformemente, cortando los dos tercios superiores de su altura.", "Lave la alcachofa y ate con una cuerda alrededor de la mayor parte de la circunferencia. Coloque una rodaja de limón debajo de la cuerda, en la base.", "Mezcle la harina con un poco de agua para crear una pasta suave. Agregue a una olla de agua hirviendo con sal.", "Coloque la base de alcachofa hacia abajo en la sartén de agua hirviendo con sal y hierva hasta que se ablande. La parte inferior de la alcachofa cederá ligeramente cuando esté bien cocida. Retire y coloque en agua helada para enfriar.", "Mantenga el líquido de cocción y colóquelo a un lado.", "Retire todas las hojas exteriores, hasta llegar al centro de la alcachofa. Retire el centro de la alcachofa con una cuchara para revelar el corazón. Recorte la base con un cuchillo y colóquelo en el líquido de cocción refrigerado hasta que se requiera.", "Para el pollo, caliente una sartén hasta que esté caliente, luego agregue el aceite de oliva y la pechuga de pollo, con la piel hacia abajo. Freír durante 6-7 minutos, luego darle la vuelta al pecho y cocinar durante 2-3 minutos más.", "Voltee sobre el lado de la piel, vierta sobre la miel y deje que se caramelice con el calor.", "Cuando el pollo esté completamente cocido (los jugos deben quedar limpios cuando se prueba con un pincho) exprima el jugo de limón, retírelo del fuego y colóquelo a un lado.", "Para la ensalada, corte el corazón de alcachofas en ocho pedazos. Coloque el tomate de carne, la alcachofa, el pepino, el chalote, el ajo, el cebollino, el perifollo, el vinagre de jerez, la mostaza y el yogur en un tazón y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca la ensalada en el centro de un plato. Corta las pechugas de pollo en un ángulo de 45 grados y coloca un abanico de rebanadas encima de la ensalada. Adorne con berros y sirva."]}, {"isVegetarian": false, "title": "Ackee y saltfish", "url": "www_bbc_co_uk_food_recipes_ackeeandsaltfish_86812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite, para freír", "1 cebolla, finamente picada", "1 pimiento rojo, semillas eliminadas, picadas", "1 pimiento verde, semillas eliminadas, picadas", "1 chile con tapa de whisky, sin semillas, picado", "450g / 1lb de bacalao sal, remojado en agua durante la noche (el agua cambió varias veces)", "450 g / 1 libra ackee enlatado, escurrido", "1 cucharada de hojas frescas de tomillo", "pizca de pimienta negra", "100 g / 3½ oz de mantequilla", "400 g / 14 oz callaloo (sustituto con hojas frescas de espinaca si no está disponible)", "1 cucharadita de nuez moscada recién rallada", "sal y pimienta negra recién molida", "3 tomates, semillas retiradas, picadas", "salsa jamaicana caliente lista para servir", "3 tomates, toscamente picados"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Calentar el aceite en una sartén grande. Agregue la cebolla y los pimientos rojos y verdes y fría a fuego medio durante 4-5 minutos, hasta que se ablanden.", "Agregue la guindilla y revuelva bien.", "Escurrir el bacalao de su agua empapada y enjuagar con agua fresca. Seque el bacalao, luego agregue a la sartén de pimientos fritos y cebolla.", "Agregue el ackee y fría por 5-6 minutos, hasta que el bacalao y el ackee estén cocidos. Rompe el bacalao con una cuchara de madera mientras se cocina.", "Agregue el tomillo y un poco de pimienta negra, al gusto, y revuelva.", "Para el callaloo, derrita la mantequilla en una sartén por separado a fuego medio. Agregue el callaloo y cocine hasta que el callaloo se haya marchitado.", "Agregue la nuez moscada y sazone bien con sal y pimienta negra recién molida.", "Para servir, coloque la mezcla de bacalao y ackee en el centro de un plato de servir grande.", "Sirve el callaloo alrededor del bacalao y el ackee y la llovizna, al gusto, con un poco de salsa jamaicana caliente y decora con los tomates picados."]}, {"isVegetarian": false, "title": "Un bizcocho clásico (con relleno de maracuyá)", "url": "www_bbc_co_uk_food_recipes_aclassicspongecakewi_9406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aclassicspongecakewi_9406_16x9.jpg", "ingredients": ["Harina de 175g / 6oz de auto crianza", "1 cucharadita redondeada de polvo de hornear", "3 huevos grandes a temperatura ambiente", "175g / 6oz de mantequilla muy suave", "175g / 6oz de azúcar en polvo de oro", "½ cucharadita de extracto de vainilla", "un poco de azúcar glas tamizada, para quitar el polvo", "6 maracuyá", "250g / 9oz de mascarpone", "1 nivel de cucharada de azúcar en polvo de oro", "1 cucharadita de extracto de vainilla", "200ml / 7fl oz de queso fresco"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Tome un recipiente para mezclar muy grande, coloque la harina y el polvo de hornear en un colador y críelos en el recipiente, manteniendo el tamiz en alto para darle una buena ventilación a medida que baja. Ahora todo lo que hace es simplemente agregar todos los demás ingredientes de la torta (excepto el azúcar glasé) al tazón y, con tal que la mantequilla esté realmente suave, simplemente vaya con un batidor de mano eléctrico y mezcle todo hasta que tenga un sabor suave, bien- mezcla combinada, que tomará aproximadamente un minuto. Si no tiene un batidor de mano eléctrico, puede usar una cuchara de madera, utilizando un poco más de esfuerzo. Con lo que terminarás ahora es una mezcla que deja caer una cuchara cuando le das un golpe en el costado del tazón. Si parece demasiado rígido, agregue un poco de agua y vuelva a mezclar.", "Ahora divide la mezcla entre las dos latas, nivela y coloca las latas en el estante central del horno. Las tortas tardan de 30 a 35 minutos en cocinarse, pero no abra la puerta del horno hasta que hayan transcurrido 30 minutos.", "Para comprobar si las tortas están cocidas o no, toque ligeramente el centro de cada una con un dedo: si no deja huella y las esponjas vuelven, están listas.", "Luego, retírelos del horno, luego espere unos cinco minutos antes de encenderlos en una rejilla para enfriamiento de cables. Despegue con cuidado los papeles base, lo cual es más fácil si primero hace un doblez en el papel, luego tire de él con cuidado, sin intentar levantarlo. Ahora deja las esponjas completamente frías, luego agrega el relleno.", "Para hacer esto, primero corte la fruta de la pasión en mitades y, usando una cucharadita, vierta toda la carne, el jugo y las semillas en un tazón.", "Luego, en otro tazón, combine el mascarpone, el fromage frais, el azúcar y el extracto de vainilla, usando un batidor de globo, que es la manera más rápida de mezclarlos todos juntos. Después de eso, dobla aproximadamente dos tercios de la fruta de la pasión.", "Ahora coloque el primer bizcocho en el plato o en el soporte de la torta en el que lo va a servir, luego extienda la mitad del relleno sobre él, vierta el resto de la fruta de la pasión sobre eso, luego distribuya el relleno restante sobre la fruta de la pasión. Por último, coloque la otra torta en la parte superior, presione suavemente para que el relleno rezume en los bordes, luego empolva la superficie con un poco de azúcar glas tamizada."]}, {"isVegetarian": true, "title": "Un cremoso y crujiente helado de frutas", "url": "www_bbc_co_uk_food_recipes_acreamycrunchyfruits_92490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Crema doble de una olla (aproximadamente 250 ml / 7 fl oz)", "1 o 2 merengues grandes", "1 buenas zarzamoras, o cualquier fruta suave funciona bien", "1 pequeño puñado de nueces de pistacho sin sal con cáscara", "helado de vainilla, para servir", "azúcar glas, para servir"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Batir la crema doble en un tazón. Me gusta hacerlo a mano, ya que tengo un control total sobre él y le doy a la crema hasta que empiece a sentirse pesado con mi batidor, pero no lo sobre-mezcle.", "Rompe los merengues en la crema, los trozos gruesos son buenos. Dispersión en las moras (funcionan perfectamente con el merengue mientras cortan la dulzura). Para romper la suavidad de este helado, agrego algunos pistachos. Doble suavemente juntos para que los frutos revienten a través de la crema.", "Coloque una gran bola de helado de vainilla en el fondo de dos copas de helado y cubra con cucharadas de crema de mora y polvo con azúcar glas. Este postre tiene algo suave, algo crujiente, algo dulce y algo afilado, lo que lo hace perfecto."]}, {"isVegetarian": false, "title": "Adraki gosht (masala de cordero en salsa de tomate y jengibre)", "url": "www_bbc_co_uk_food_recipes_adhrakigoshtlambmasa_77225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 cucharadita de aceite", "1 cebolla, en rodajas", "500 g / 1 lb de pierna de cordero sin hueso, cortada en cubitos", "2 cucharadas de pasta de jengibre", "2 cucharadas de pasta de ajo", "sal al gusto", "pimienta blanca al gusto", "pizca de chile en polvo", "½ cucharadita de sal masala", "500g / 1 libra de tomates de ciruela", "1 cucharadita de puré de tomate", "50 g / 2 oz de yogur", "raíz de jengibre cortado en tiras, para adornar"], "serves": "Sirve 2-3", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite en una cacerola de base pesada.", "Agregue las cebollas y cocine hasta que estén doradas.", "Agregue el cordero cortado en cubitos y cocine por unos 10 minutos.", "Agregue la pasta de jengibre y la pasta de ajo y cocine durante unos cinco minutos.", "Agregue todas las especias, la pasta de tomate y el yogur y revuelva.", "Agregue 250ml (9fl oz) de agua y cocine a fuego lento hasta que el cordero esté tierno, aproximadamente 40-45 minutos.", "Elimine cualquier exceso de aceite de la superficie.", "Sirva adornado con tiras de jengibre."]}, {"isVegetarian": false, "title": "Filete de solomillo con ensalada tailandesa y avellanas tostadas", "url": "www_bbc_co_uk_food_recipes_aged_sirloin_steak_with_62354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 300 g / 10½oz filetes de solomillo", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "¼ de col roja, finamente rebanada", "1 cebolla roja pequeña, finamente cortada", "1 pera asiática, pelada y finamente picada", "½ coco, ¼ afeitado, ¼ rallado", "2 cucharadas de hojas frescas de cilantro", "2 cucharadas de hojas de menta fresca", "4 cucharadas de semillas de sésamo", "2 limas, solo jugo", "4 dientes de ajo, aplastados", "2 cucharadas de jengibre rallado", "2 cucharadas de azúcar de palma", "4 cucharadas de salsa de pescado", "6 cucharadas de salsa de soja", "2 chiles rojos, 1 finamente picado, 1 rebanado", "2 cucharadas de hojas de menta fresca picada", "2 cucharadas de hojas de cilantro fresco picado", "2 cucharadas de avellanas tostadas, más o menos picadas", "1 lima, partida a la mitad"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sazone los filetes con sal y pimienta y frote el aceite por todas partes. Caliente una sartén y cocine los filetes a su gusto. Retire del fuego y déjelo reposar más o menos al mismo tiempo que lo cocinó.", "Para hacer la ensalada, ponga todos los ingredientes en un tazón y mezcle bien.", "Pon todos los ingredientes para el aderezo en un mortero y machaca hasta obtener una pasta áspera. Justo antes de servir, agregue el aderezo a la ensalada y mezcle bien.", "Para servir, cortar el filete en rodajas y poner en un plato de servir. Agregue la ensalada sobre las rebanadas de carne y decore con las nueces picadas y la lima en el lado."]}, {"isVegetarian": true, "title": "Ajo y pimiento picante", "url": "www_bbc_co_uk_food_recipes_aglioepeperoncino_90110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "1 chile rojo, picado", "200 g / 7 oz de linguini seco, cocido de acuerdo con las instrucciones del paquete", "6 hojas de albahaca fresca, rotas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite en una sartén y freír el ajo y el chile durante 1-2 minutos, o hasta que se ablanden. Agregue el linguini cocido a la sartén y revuelva para cubrir, luego agregue las hojas de albahaca.", "Para servir, coloque el linguine en un plato de servir."]}, {"isVegetarian": true, "title": "Alioli", "url": "www_bbc_co_uk_food_recipes_aioli_81090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 yemas de huevo de gallinas camperas", "4 dientes de ajo", "½ limón, solo jugo", "sal y pimienta negra recién molida", "150ml / 5fl oz de aceite de oliva virgen extra", "polvo de mostaza, opcional", "azafrán, opcional"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle todos los ingredientes, excepto el aceite de oliva, en un procesador de alimentos. Vierta el aceite en la licuadora en un flujo constante, hasta que se forme una salsa espesa. La mezcla, una vez mezclada, debe ser vibrante y de color amarillo. Para variar el sabor, agregue un poco de mostaza o algo de azafrán. Si desea que su mayonesa se consuma, agregue un par de cucharadas de agua caliente.", "Sirva con rebanadas de baguette y / o una selección de verduras crudas, como apio, zanahoria, pepino, rábanos, tiras de hinojo, tiras de pimienta, tomates cherry."]}, {"isVegetarian": false, "title": "Mint cordero con ensalada caliente (cazuela de cordero italiano con ensalada tibia)", "url": "www_bbc_co_uk_food_recipes_agnelloallamentaconi_76385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 filetes de cordero que pesan aproximadamente 400 g / 14 oz en total, cortados en cubos de 2 cm / 1 in", "4 cucharadas de romero fresco finamente picado", "4 cucharadas de menta fresca finamente picada", "3 cucharadas de vinagre de vino blanco", "3 cucharadas de miel", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva italiano", "2 cebollas grandes, cortadas en cubos de 2cm / 1in", "100 g / 3 oz champiñones", "3 palitos de apio, cortados en cubos de 2cm / 1in", "2 papas blancas grandes, peladas y cortadas en cubos de 2cm / 1in", "1 vaso de vino tinto seco", "1 vaso de agua", "3 calabacines en rodajas finas", "2 zanahorias, peladas y finamente cortadas", "2 puerros, en rodajas finas", "5 cucharadas de aceite de oliva italiano", "6 cucharadas de piñones tostados"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["En un tazón, marinar los filetes de cordero con el romero, menta, vinagre, miel, sal y pimienta negra recién molida. Deje marinar en la nevera durante aproximadamente cuatro horas.", "Calentar el aceite de oliva en una olla grande y freír las cebollas, los champiñones, el apio y las patatas durante unos cinco minutos.", "Agregue el cordero marinado con cualquier jugo del adobo, mezcle bien y cocine por otros dos minutos. Agregue el vino y el agua, permitiendo que el vino se evapore durante 2-3 minutos. Condimentar con sal y pimienta.", "Cubra la olla con la tapa y deje cocer a fuego lento durante aproximadamente una hora y media, revolviendo ocasionalmente.", "Mientras la cacerola se cocina, prepare la ensalada tibia. Calentar el aceite de oliva en una sartén y freír los calabacines, las zanahorias y los puerros durante 2-3 minutos. Agregue los granos de pino y sazone con sal y pimienta negra recién molida.", "Para servir, divida la ensalada tibia entre platos, creando un nido en el centro. Sirve el cordero en el centro de las verduras."]}, {"isVegetarian": false, "title": "Aji de gallina", "url": "www_bbc_co_uk_food_recipes_aji_de_gallina_78858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pechugas de pollo", "50 g de pan blanco fresco", "200 ml de leche entera", "2-3 cucharadas de aceite de oliva o aceite vegetal", "1 cebolla grande, picada", "3 dientes de ajo picados", "1 ají verde grande y grande, sin semillas, finamente picado", "1 cucharadita de pimentón", "¼ cucharadita de cúrcuma", "sal y pimienta negra recién molida", "35 g de nueces molidas", "20 g de parmesano rallado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque el pollo en una cacerola, agregue suficiente agua hirviendo para cubrir, luego lleve a ebullición y cocine a fuego lento durante 8-10 minutos, o hasta que esté opaco y cocido. Retirar del agua y reservar en un plato para enfriar, reservar el licor de cocción. Cuando esté lo suficientemente frío como para manipularlo, tritúrelo.", "Mientras tanto, remoje las migas de pan en la leche.", "Calentar el aceite en una sartén grande a fuego medio-alto y freír la cebolla durante 7-8 minutos, o hasta que esté suave y dorado. Agregue el ajo y el chile y fríalos por un minuto más hasta que estén fragantes. Agregue el pimentón, la cúrcuma y el condimento y fría por un minuto, agregando un poco más de aceite si la mezcla se ve seca.", "Agregue el pollo rallado y revuelva para cubrir las especias por un minuto, luego vierta las migas de pan remojadas y la leche. Agregue 200 ml de la reserva reservada, lleve a ebullición, baje el fuego y cocine a fuego lento durante cinco minutos. Agregue las nueces y cocine a fuego lento por otros 5 minutos, o hasta que la salsa sea rica y cremosa, agregando un poco más de caldo si se vuelve demasiado espesa.", "Agregue el parmesano, sazone al gusto con sal y pimienta negra recién molida."]}, {"isVegetarian": true, "title": "Huevo salteado (perros espinosos japoneses)", "url": "www_bbc_co_uk_food_recipes_ajitsuke_tamago_japanese_65686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 huevos grandes de gallinas camperas", "100 ml / 3½ fl oz de salsa de soja ligera", "100ml / 3½fl oz", "Sake 100ml / 3½fl oz", "6 cucharadas de azúcar en polvo"], "serves": "Rinde 6", "time": {"preparation": "durante la noche", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Tres cuartas partes llenan una olla mediana con agua y llevan a ebullición. Una vez que hierva, agregue cuidadosamente los huevos a la sartén y hierva por exactamente seis minutos. Use un temporizador ya que los huevos quieren ser perfectos con una deliciosa yema líquida.", "Una vez cocido, transfiéralo a un recipiente con agua helada y pélelo con cuidado. Tenga en cuenta que los huevos aún se están mojando y que debe manipular con cuidado. Agregue los ingredientes restantes, incluyendo 100 ml / 3½ fl oz de agua a otra cacerola, cocine a fuego lento y cocine hasta que el azúcar se disuelva. Retirar del fuego y dejar enfriar.", "Coloque los huevos en un recipiente pequeño que se ajustará perfectamente ya que el líquido casi cubrirá los huevos. Vierta en el adobo frío y coloque una pequeña pieza de muselina o una tela de jay sobre los huevos, esto ayuda a asegurar que los huevos obtengan un recubrimiento uniforme del adobo, ya que el líquido penetrará en el material y pesará los huevos hacia abajo. en el liquido", "Marinar durante al menos 12 horas, pero idealmente 24."]}, {"isVegetarian": false, "title": "Albondigas (albóndigas mexicanas picantes con arroz rojo)", "url": "www_bbc_co_uk_food_recipes_albondigasspicymexic_83672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cebollas, finamente picadas", "Carne picada de cerdo 250 g / 9 oz", "Carne picada de carne 250 g / 9 oz", "1 cucharadita de orégano seco", "60g / 2oz de pan rallado fresco", "1 cucharadita de comino molido", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "8 cucharadas de aceite vegetal", "3 cucharadas de aceite de oliva", "800g / 1lb 12 oz de tomates picados en conserva", "4 chiles rojos medio calientes, sin semillas y finamente picados", "2 dientes de ajo, finamente picados", "100ml / 3½fl oz de caldo de carne", "sal y pimienta negra recién molida", "3 tomates de ciruela grandes, cortados en cuartos", "500g / 1lb 2½oz de arroz de grano largo", "2 dientes de ajo", "10 cucharadas de aceite de oliva", "2 cucharaditas de pimentón", "1 cucharada de azúcar moreno", "2 limas, solo jugo", "2 cebollas tiernas, finamente picadas", "1 cucharadita de orégano seco", "3 cucharadas de puré de tomate", "500ml / 18fl oz de caldo de verduras (si necesita más agua caliente para uso líquido)", "sal"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las albóndigas, coloque la mitad de las cebollas, la carne de cerdo y la carne picada, orégano, pan rallado, comino y huevo en un tazón grande. Mezcle bien, sazone con sal y pimienta negra recién molida.", "Con las manos, enrolle la mezcla de carne picada en 4cm / 1½ en albóndigas.", "Caliente el aceite vegetal en una sartén grande a fuego medio. Agregue las albóndigas y fría por 5-6 minutos, volteándolas de vez en cuando, hasta que se doren por todas partes. Escurrir del aceite con una cuchara ranurada y reservar en un plato.", "Caliente el aceite de oliva en una sartén limpia a fuego medio. Agregue las cebollas restantes, el ajo y los chiles y fría hasta que estén suaves y dorados.", "Agregue los tomates picados, sazone con sal y pimienta negra recién molida y cocine por 5-6 minutos.", "Agregue el caldo de carne a la salsa y mezcle bien, luego las albóndigas y cocine a fuego lento durante 20 minutos, o hasta que la salsa se espese y las albóndigas estén cocidas.", "Para el arroz rojo, coloque los tomates de ciruela en una bandeja para hornear con el ajo, rocíe sobre dos cucharadas de aceite de oliva y coloque en el horno para asar durante 20 minutos. Retirar del horno y dejar enfriar.", "Una vez que esté lo suficientemente frío como para manipularlo con seguridad, quite la piel de los tomates y pele el ajo.", "Coloque el ajo, los tomates, el pimentón, el azúcar, el jugo de lima, las cebolletas y el orégano en un procesador de alimentos y mezcle hasta que quede suave.", "Remoje el arroz en un colador fino durante diez minutos. Escurrir bien", "Caliente las ocho cucharadas restantes de aceite de oliva en una cacerola grande a fuego medio. Agregue el arroz y fría, revolviendo para cubrir el arroz en el aceite, durante 5-6 minutos, agregue la mezcla de la mezcla de tomate y el puré de tomate y mezcle bien, permitiendo que el arroz absorba el líquido.", "Agregue lentamente cucharadas de caldo de verduras, revolviendo constantemente, como lo haría con un risotto, permitiendo que cada cucharada sea absorbida por el arroz antes de agregar la siguiente.", "Cocine hasta que el arroz esté al dente, o de su gusto y sazone con sal.", "Sirve caliente en tazones."]}, {"isVegetarian": false, "title": "Cordero albanés al horno con arroz (refrigerio)", "url": "www_bbc_co_uk_food_recipes_albanian_baked_lamb_with_92485", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/albanian_baked_lamb_with_92485_16x9.jpg", "ingredients": ["70 g / 2½ oz de mantequilla", "1 cucharada de aceite de oliva", "Paletilla de cordero deshuesada de 1.2kg / 2lb 12oz, cortada en cubos de 5cm / 2in", "4 dientes de ajo rallados", "1 cucharadita de orégano seco", "60 g / 2¼ oz de arroz de grano largo, enjuagado", "50g / 1¾oz de harina natural", "Yogur griego de 600ml / 20fl oz", "4 huevos de gallinas camperas, golpeados", "nuez moscada recién rallada, para terminar", "sal y pimienta negra recién molida"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente 20 g / ¾oz de la mantequilla y el aceite de oliva en una sartén grande con tapa a fuego alto. Brown el cordero en tandas.", "Devuelve todo el cordero a la sartén. Agregue el ajo, el orégano y 200 ml / 7 fl oz de agua. Deje que hierva a fuego lento y cocine, cubierto con una tapa, durante aproximadamente 45-60 minutos hasta que el cordero esté tierno.", "Agregue el arroz y sazone con sal y pimienta. Transfiera a una alfarería de 3 litros / 5¼ pinta u otro plato resistente al horno.", "Derrita la mantequilla restante en una olla pequeña, agregue la harina y haga un roux, cocine por 2 minutos, luego quite el fuego. Agregue el yogur y mezcle bien, luego regrese al fuego y cocine suavemente por un par de minutos. Quite el fuego, agregue los huevos batidos y sazone con sal y pimienta.", "Vierta la salsa sobre la mezcla de cordero y arroz, ralle nuez moscada fresca en la parte superior y hornee durante 40-45 minutos hasta que comience a dorarse.", "Retire del horno y deje reposar durante 5 minutos antes de servir. Sirve con una ensalada de lechuga simple."]}, {"isVegetarian": true, "title": "Ajo blanco", "url": "www_bbc_co_uk_food_recipes_ajo_blanco_29893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g / 7oz de almendras blanqueadas enteras", "Pan blanco de 75g / 2½oz, costras eliminadas", "600ml / 20fl oz de agua helada", "2 dientes de ajo grasos, finamente picados", "½ pepino, pelado, sin semillas y tostado", "75ml / 2½fl oz de aceite de oliva", "1-2 cucharadas de vinagre de jerez o vinagre de vino blanco", "sal y pimienta blanca", "1 cucharada de almendras en copos", "24 uvas verdes sin semillas, peladas y partidas por la mitad", "2 cucharadas de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Pon las almendras en una sartén seca y freír a fuego medio. Agite con regularidad y observe de cerca. Retírelo del fuego tan pronto como pueda oler las almendras y están empezando a adquirir un poco de color.", "Repita con las almendras en copos y reservarlos para la guarnición.", "Cubra el pan con agua y déjelo en remojo durante 10 minutos hasta que se ablande. Drene y exprima el agua.", "Pon las almendras enteras en un procesador de alimentos o licuadora. Agregue el pan y procese hasta que las almendras estén bastante molidas. Agregue el ajo y el pepino y continúe bombardeando, luego rocíe en el resto del agua, el aceite de oliva y la mitad del vinagre.", "Gusto. Sazone con sal y pimienta blanca, luego rocíe un poco más de vinagre si cree que lo necesita. La sopa debe ser muy suave, si parece granulosa, empuje a través de un colador fino.", "Transfiera a un tazón o jarra, cubra y enfríe por dos horas.", "Para servir, colóquelo en cuencos y cubra con las almendras copos, las uvas peladas y un chorrito de aceite de oliva."]}, {"isVegetarian": true, "title": "Saturday Kitchen Sling", "url": "www_bbc_co_uk_food_recipes_alcoholic_pink_lemonade_50276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 partes de ginebra", "2 partes de vermut rojo dulce", "2 partes de licor de naranja", "1 parte de Campari", "2 partes de jugo de pomelo rosado", "10 partes de limonada nublada", "fresas, descuartizado", "ramitas de menta", "1 pomelo, solo cáscara", "hielo"], "serves": "", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle todos los componentes alcohólicos junto con el jugo de pomelo rosado en una jarra grande. Vierta la limonada turbia y revuelva.", "Llene vasos para servir con hielo y vierta sobre el cóctel.", "Adorne con dos cuartos de una fresa y una ramita de menta por bebida. Cubra con un toque de cáscara de pomelo."]}, {"isVegetarian": false, "title": "Gambas al cremat con ensalada Little Gem, diente de león y berros servida con alioli", "url": "www_bbc_co_uk_food_recipes_alcrematwithalittleg_94027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "1 chalote, pelado, finamente picado", "1 filete de anchoa, picado", "½ cucharadita de chile rojo finamente picado", "1 ajo, pelado, finamente picado", "5 langostinos, pelados, cabezas y colas dejados en", "100 ml / 3½ fl oz de vino blanco seco", "Sopa de pescado 200ml / 7¼fl oz", "1 cucharada de perejil de flatleaf fresco picado", "1 cucharada de persilla (cantidades iguales de ajo y perejil finamente picados)", "1 cucharada de pan rallado", "6 dientes de ajo, cortados por la mitad", "1 cucharada de mostaza Dijon", "125ml / 4½fl oz de aceite de oliva virgen extra", "pellizcar la pimienta espelette molida (o pizca de pimentón y pimienta de cayena)", "1 limón, solo jugo", "50ml / 1¾fl oz de vinagre de jerez", "200ml / 7¼fl oz de aceite de oliva", "1 cucharadita de mostaza Dijon", "1 chalote, pelado, finamente cortado en cubitos", "2 lechugas Little Gem, hojas separadas", "25 g / 1 oz de hojas de diente de león", "1 manojo de berros", "1 cucharada de estragón fresco picado", "1 cucharada de perifollo fresco picado", "1 cucharada de menta fresca picada", "4 rebanadas de pan de masa fermentada"], "serves": "4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el cremat, caliente el aceite en una sartén con tapa y freír la chalota, la anchoa, el chile y el ajo durante 30 segundos. Agregue las gambas.", "Agregue el vino y mezcle bien. Continúe cocinando hasta que el volumen del líquido se haya reducido en tres cuartos. Agregue la sopa de pescado, cubra con una tapa y cocine durante tres minutos.", "Retire la tapa y agregue el perejil y la persilla; tapa y cocina por otros 30 segundos. Dejar de lado.", "Para el alioli, triture el ajo y la sal en un almirez y mortero hasta obtener una pasta. Transfiera la mezcla a un recipiente y mezcle la mostaza Dijon. Poco a poco bata el aceite de oliva, poco a poco, hasta que la mezcla se parezca a la mayonesa. Dejar de lado.", "Para la Little Gem, ensalada de diente de león y berros, mezcle el vinagre de jerez, el aceite de oliva, la mostaza de Dijon, la chalota y la sal y la pimienta negra recién molida en un tazón pequeño. Coloque la lechuga Little Gem, el diente de león, el berro y las hierbas en un tazón grande, vierta sobre el aderezo y mezcle hasta que estén bien combinados.", "Para servir, agregue la pimienta espelette y el jugo de limón al alioli y mezcle hasta que estén bien combinados. Cuchara en un tazón pequeño.", "Coloque la cremat en cada una de las dos placas de servir. Sirve la ensalada Little Gem, diente de león y berros, alioli y pan tostado al lado."]}, {"isVegetarian": true, "title": "Pan de frutas", "url": "www_bbc_co_uk_food_recipes_alefruitloaf_83744", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g / 1Ib 2oz pequeñas pasas de Corinto", "140 g / 5oz de pasas", "Cáscara mixta 140 g / 5 oz", "Cerveza embotellada fuerte de botella de 500ml / 17fl oz, como Black Sheep Brewery Riggwelter Strong Ale", "Azúcar moreno oscuro oscuro de 180g / 7oz", "150g / 5½ oz de harina de auto crianza", "Harina de autorregulación integral de 180g / 7oz", "3 cucharaditas de especias mixtas", "3 huevos de gallinas camperas"], "serves": "Rinde 2 panes", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Pon la fruta seca en una sartén grande y cúbrela con la cerveza embotellada.", "Calienta suavemente la fruta hasta que la cerveza esté caliente, pero no hirviendo. Retire del fuego, cubra y deje toda la noche.", "Cuando esté listo para cocinar el pan, precaliente el horno a 140 ° C / 275 ° F / Gas 1.", "Agregue el azúcar, las harinas, la mezcla de especias y los huevos a la mezcla de frutas. Revuelva bien hasta que todos los ingredientes estén combinados.", "Divida la mezcla entre dos moldes engrasados ​​de 500 g / 1 lb 2 oz.", "Hornee durante 1 ¼ horas hasta que se levante, marrón claro y firme al tacto.", "Cubra con un paño de cocina y deje en una rejilla para enfriar.", "Envuelva los panes con film transparente y manténgalos en un lugar fresco y seco durante hasta 6 semanas. Este pan es delicioso con mantequilla con mermelada de frambuesa o servido con una pieza de queso Wensleydale."]}, {"isVegetarian": false, "title": "Desayuno todo el día frittata", "url": "www_bbc_co_uk_food_recipes_all-day_breakfast_12416", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-day_breakfast_12416_16x9.jpg", "ingredients": ["2 lonchas de tocino, toda la grasa visible eliminada", "aceite en aerosol, para freír", "125g / 4½ oz de champiñones, en rodajas finas", "75g / 2½ oz de espinaca", "100g / 3½oz de papas hervidas (o papas horneadas sobrantes) cortadas en trozos gruesos", "100g / 3½oz de tomates cherry, cortados a la mitad", "4 huevos medianos de granja, golpeados", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a fuego medio-alto. Ase el tocino hasta que esté dorado por ambos lados. Retire de la parrilla y reserve.", "Rocíe una pequeña sartén antiadherente con aceite en aerosol y colóquelo a fuego medio-alto. Cuando la olla esté caliente, freír los champiñones durante 5 minutos, revolviendo con frecuencia, hasta que estén dorados y suavizados. Dejar de lado.", "Enjuaga las espinacas con agua fría y escúrrelas en un colador. Agréguelo a la sartén y cocínelo durante 1-2 minutos, revolviendo todo el tiempo, de modo que las hojas se vaporicen en el agua residual. Cuando la espinaca esté cocida, pero aún de color verde brillante, transfiérala de nuevo al colador y presione con el dorso de una cuchara para exprimir el agua restante de las hojas. Dejar de lado.", "Limpie la sartén, rocíe con aceite y vuelva a calentar a fuego medio. Freír las papas y los tomates sin remover demasiado, para que las verduras adquieran un cierto color pero no se deshagan, unos 5 minutos.", "Mientras tanto, bate los huevos en un tazón bastante grande. Picar el tocino cocido y la espinaca. Agregue a los huevos junto con los champiñones cocidos. Sazonar los huevos con sal y pimienta negra recién molida.", "Cuando los tomates y las papas estén dorados en algunos lugares, échelos en los huevos con las otras verduras. Dele a la mezcla de huevo un breve revuelo, luego viértala nuevamente en la sartén y vuelva a colocarla sobre el fuego. Cocine suavemente a fuego medio durante 10 minutos, hasta que el huevo parezca colocado alrededor de los bordes (puede ser un poco líquido en la parte superior).", "Coloque la sartén debajo de la parrilla durante 2 minutos para terminar de cocinar la frittata en la parte superior. Ponga la frittata en un plato y deje que se enfríe un poco antes de cortar en rodajas. Sirve con una ensalada crujiente para obtener el máximo de vegetales."]}]