[{"isVegetarian": false, "title": "Beef pho", "url": "www_bbc_co_uk_food_recipes_beef_pho_34022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Anís de 2 estrellas", "4 dientes", "2 cucharadas de semillas de cilantro", "1 cebolla grande, sin pelar, partida a la mitad", "1 pedazo grande de pulgar de raíz fresca de jengibre, sin pelar y cortado a la mitad", "1,5 litros / 2¾ pintas de caldo de carne", "1 médula ósea, limpiada", "3 cucharadas de salsa de pescado", "Fideos de arroz planos de 250g / 9oz", "Filete de solomillo de calidad superior de 400 g / 14 oz, sin grasa, en rodajas muy finas", "gran puñado de brotes de soja", "3 cebollas de primavera, en rodajas finas", "1 chile rojo, en rodajas finas", "pequeñas hojas de menta", "pequeñas hojas de albahaca", "pequeñas hojas de cilantro puñado", "2 limas, descuartizado"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a la configuración de medio alto.", "Coloque una sartén a fuego alto. Cuando esté caliente, agregue el anís estrellado, los clavos de olor y las semillas de cilantro y pan tostado hasta que estén aromáticos. Transfiera a un plato y reserve.", "Coloque la cebolla y el jengibre en un molde para parrilla y póngalo debajo de la parrilla, volteándolo de vez en cuando, hasta que esté suave y ligeramente caramelizado, pero ligeramente carbonizado por todos lados. Dejar enfriar un poco, luego pelar la cebolla y el jengibre y descartar las pieles.", "Coloque la cebolla, el jengibre y las especias tostadas en una olla grande con tapa. Agregue el caldo y la médula ósea y deje que hierva a fuego lento. Cubra, baje un poco el fuego y cocine a fuego lento durante 30 minutos para permitir que los sabores se desarrollen e infundan el caldo. Agregue la salsa de pescado durante los últimos 10 minutos del tiempo de cocción.", "Cuele el caldo a través de un colador en una olla limpia y vuelva a hervir.", "Mientras tanto, cocinar los fideos de acuerdo con las instrucciones del paquete, escurrirlos y refrescarlos con agua corriente fría para detener el proceso de cocción.", "Coloque los fideos en cuencos hondos y cubra con el solomillo. Espolvoree el caldo caliente por encima. Agregue los brotes de soja, las cebolletas, el chile, las hierbas y una rodaja de limón en la mesa."]}, {"isVegetarian": false, "title": "Ragú de carne y calabacín", "url": "www_bbc_co_uk_food_recipes_beef_rag_and_courgetti_60735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de ghee o mantequilla", "2 cebollas, finamente picadas", "2 dientes de ajo, finamente picados", "2 hojas de laurel secas", "¼ cucharadita de especias mezcladas (o pruebe una pizca de nuez moscada)", "2 cucharaditas de orégano seco", "400 g / 14 oz de carne picada de ternera (chuck o bistec estofado - no carne magra)", "Hígados de pollo de 100g / 3½oz, cortados y picados", "250ml / 9fl oz de vino tinto", "14 tomates grandes, toscamente picados, o 2 x 400 g / 14 oz de tomates cortados en trozos o 800 g / 1 lb de passata de tomate de 12 onzas", "2 cucharaditas de puré de tomate", "200 ml / 7 fl oz de caldo de hueso o agua (no necesitará mucho si usa tomates enlatados)", "2 zanahorias grandes, finamente ralladas", "sal marina y pimienta negra recién molida", "1 gran puñado de perejil fresco, finamente picado", "4 calabacines grandes", "botón de mantequilla", "aceite de oliva virgen extra, para servir", "100 g / 3½ oz de queso parmesano, rallado, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el ghee o la mantequilla en una cacerola grande y fría la cebolla a fuego lento hasta que se suavice pero no se dore (aproximadamente 10 minutos). Agregue el ajo, las hojas de laurel, la mezcla de especias, el orégano y los fritos por otros dos minutos.", "Aumente el fuego y agregue la carne a la sartén, usando una espátula de madera para romperla mientras cocina.", "Después de cinco minutos, agregue los hígados de pollo, vierta el vino tinto y revuelva para desglasar la sartén, luego agregue los tomates, puré de tomate y caldo de hueso o agua.", "Llevar a ebullición, cubrir con una tapa, dejar la tapa un poco apagado, luego reducir a fuego lento, revolviendo ocasionalmente, durante 2 horas y media, o hasta que esté rico y espeso. Es incluso mejor después de 3-4 horas. Vigílalo y agrega más líquido si es necesario.", "Agregue las zanahorias ralladas 15 minutos antes del final de la cocción. Suba el fuego a fuego lento y sazone con sal marina, una buena molienda de pimienta y el perejil fresco.", "Mientras tanto, use un espiralizador o pelador de julianas para hacer los espaguetis de los calabacines. Este es el calabacín. O puede usar un pelador de verduras regular para cortar los calabacines longitudinalmente en cintas muy anchas, que luego puede cortar a la mitad. Es posible que desee cortar los hilos largos por la mitad para que sean más fáciles de comer.", "Suavice el calabacín en una sartén con un poco de mantequilla, revolviendo a fuego lento durante tres minutos. Alternativamente, ahorre el lavado de otra sartén simplemente pasando parte de la salsa picante a través de sus espirales: el calor y la sal en la salsa los suavizarán.", "Sirva el calabacín y el ragú de carne en tazones. Rocíe cada plato con aceite de oliva virgen extra y sirva con parmesano rallado."]}, {"isVegetarian": false, "title": "Ragu de carne con linguini", "url": "www_bbc_co_uk_food_recipes_beef_ragu_with_linguine_27254", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_ragu_with_linguine_27254_16x9.jpg", "ingredients": ["300g / 10½oz '00' de harina, más extra para quitar el polvo", "3 huevos de gallinas camperas", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "1 zanahoria grande, finamente picada", "1 tallo de apio, cortado, finamente picado", "200g / 7 oz de tocino ahumado lardons", "500 g / 1 libra de carne picada 2 oz", "2 cucharadas de puré de tomate", "1 x 400 g de tomates de hojalata", "150ml / 5fl oz de vino tinto", "puñado de hojas de albahaca fresca, aproximadamente desgarrado", "sal y pimienta negra recién molida", "3-4 cucharadas de parmesano recién rallado, para servir"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la pasta casera, incline la harina sobre una superficie de trabajo limpia y haga un pozo en el centro. Agriete los huevos en el pozo, luego, gradualmente, introduzca la harina en los huevos hasta que la mezcla se una como una masa pegajosa. Amasar la masa sobre una superficie de trabajo ligeramente enharinada hasta que toda la harina se haya incorporado y la masa esté suave. Alternativamente, mezcle la harina y los huevos en un procesador de alimentos hasta que la mezcla forme migas pequeñas. Inclínelo sobre una superficie de trabajo limpia, ligeramente enharinada y aplasta hasta formar una bola, luego amasar durante unos minutos hasta que quede suave.", "Envuelva la masa de pasta en una película adhesiva y déjela enfriar durante 20 minutos en la nevera.", "Espolvoree los rodillos de la máquina para hacer pasta con harina.", "Corte la masa de pasta fría en 3 pedazos de igual tamaño y aplánelos con las palmas de su mano a un grosor de 1cm / ½ pulg.", "Comenzando por la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa al pasar por la máquina con la otra.", "Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3 o 4 veces más, enharinando la máquina y cambiando la configuración cada vez hasta la última pero única configuración. Deberías terminar con una larga hoja de pasta.", "Repita el proceso de laminado con las piezas restantes de masa de pasta.", "Doble las hojas de pasta enrolladas en un tamaño manejable, luego córtelas longitudinalmente para formar tiras de linguini de aproximadamente 3 mm de grosor. Cuelga el linguini sobre una rejilla para que se seque un poco mientras preparas el ragu.", "Para los ragu, caliente el aceite en una cazuela a prueba de fuego a fuego medio. Agregue las cebollas y el ajo y fría por 2-3 minutos, o hasta que estén suaves pero no coloreados.", "Agregue la zanahoria y el apio y fría por otros 2-3 minutos. Agregue el tocino y fría por otros 1-2 minutos.", "Agregue la carne picada y fríe durante 2-3 minutos en cada lado, o hasta que se dore.", "Agregue el puré de tomate y continúe cocinando durante 1-2 minutos, luego vierta los tomates enlatados y el vino tinto y ponga la mezcla a ebullición.", "Mezcle la mitad de las hojas de albahaca, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 45 minutos, o hasta que la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida. Agregue las hojas de albahaca restantes justo antes de servir.", "Para servir, ponga a hervir un sartén grande de agua salada. Agregue la pasta y cocine por 3-4 minutos, o hasta que esté tierna. Escurrir bien, luego agregar la pasta a la sartén de ragu y mezclar bien para cubrir la pasta en la salsa. Servir espolvoreado con el parmesano."]}, {"isVegetarian": false, "title": "Carne picada", "url": "www_bbc_co_uk_food_recipes_beef_rendang_62793", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_rendang_62793_16x9.jpg", "ingredients": ["2 tallos de limoncillo, hojas externas secas retiradas, más o menos picadas", "3 cebollas rojas medianas, descuartizadas", "6 dientes de ajo, pelados", "25 g / 1 oz de raíz fresca de jengibre, pelada y picada", "Galangal de 75 g / 2½ oz, pelado y toscamente picado", "3 chiles rojos regordetes, más o menos picados sin deseeding", "3 cucharadas de aceite de girasol", "2 cucharaditas de comino molido", "1 cucharada de cilantro molido", "1 cucharadita de cúrcuma molida", "1,5kg / 3lb filete de carne para chuletón de 5 oz (o cualquier buena carne para estofar), cortado y cortado en cubos de 3cm / 1¼in", "400ml / 14fl oz puede leche de coco", "4 hojas frescas de lima kaffir", "1 ramita de canela", "1 cucharada de azúcar morena clara o azúcar de palma", "2 cucharaditas de pasta de tamarindo o jugo recién exprimido de 1 lima", "2 cucharadas de salsa de soja oscura", "2 cucharadita de sal marina en copos, más extra para sazonar", "pimienta negro", "copos de coco tostado, para servir (opcional)"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["En un procesador de alimentos combine el lemongrass, cebollas, ajo, jengibre, galangal y chiles. Mezcle hasta obtener una pasta fina (puede que necesite quitar la tapa y empujar la mezcla hacia abajo un par de veces con una espátula hasta que se alcance la consistencia correcta).", "Caliente el aceite de girasol en una cazuela grande a prueba de llamas y fría la pasta suavemente durante 3-4 minutos, revolviendo constantemente. Agregue el comino, el cilantro y la cúrcuma y cocine durante dos minutos.", "Agregue la carne a la sartén y revuelva para cubrir la pasta y las especias. Cocine por cinco minutos, revolviendo constantemente hasta que la carne esté ligeramente coloreada. Vierta la leche de coco y 400ml / 14fl oz de agua fría en la cacerola. Agregue las hojas de lima, la ramita de canela, el azúcar, la pasta de tamarindo o el jugo de lima, la salsa de soja y la sal y cocine a fuego lento.", "Reduzca el fuego y deje hervir a fuego lento sin tapar durante aproximadamente 2½-3 horas, o hasta que la carne se ablanda y la salsa es muy espesa, brillante y rica. Revuelva la carne de vaca ocasionalmente hacia el comienzo del tiempo de cocción, luego con más frecuencia a medida que se reduce la leche de coco. No quieres que la salsa se pegue. Sazone al gusto con más sal y pimienta negra recién molida.", "Ponga el curry en platos calientes para servir, elija las hojas de lima kaffir y la ramita de canela, y espolvoree con el coco tostado, si lo usa."]}, {"isVegetarian": false, "title": "Rendang de ternera con chutney de mango y arroz pegajoso", "url": "www_bbc_co_uk_food_recipes_beef_rendang_with_mango_78223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tallos de limoncillo, toscamente picados", "20g / ¾oz semillas de cilantro", "½ cucharadita de semillas de comino", "½ cucharadita de cúrcuma molida", "1 estrella de anís", "3 vainas de cardamomo, aplastadas y sin semillas", "50g / 1¾oz crema de coco", "1½ cebollas grandes, en rodajas", "3 dientes de ajo picados", "3 chiles rojos, sin semillas, picados", "1 pedazo de pulgar fresco de jengibre raíz, pelado y picado", "1 hoja de laurel", "Espinilla de res de 750 g / 1 lb 10 oz, deshuesada y cortada en cubos de 2.5 cm / 1 in", "1 x 400 g / 14 oz de leche de coco de estaño", "250ml / 9fl oz de ternera fuerte o caldo de carne, calentado", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de comino", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de semillas de cilantro", "1 mango verde (bajo madurez), rebanado", "2 mangos maduros, en rodajas", "125g / 4½oz de azúcar morena suave", "110ml / 3¾fl oz de vinagre de malta", "400g / 14oz de arroz pegajoso", "1 cucharadita de sal"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne de rendang, machaque la hierba de limón en una pulpa con mortero.", "Suavemente tueste las semillas de cilantro, las semillas de comino y la cúrcuma, el anís estrellado y el cardamomo en una sartén seca hasta que estén fragantes, luego tueste hasta que las especias estén lo más lisas posible.", "En una sartén ancha (o wok de hierro fundido), caliente el bloque de crema de coco hasta que se derrita, pero mantenga el fuego bajo para que no se queme. Agregue las cebollas, el ajo, los chiles, el jengibre y el limoncillo machacado y cocine suavemente hasta que las cebollas se hayan suavizado y la mezcla empiece a oler bella y fragante.", "Agregue las especias molidas y la hoja de laurel y fría por unos minutos más hasta que la mezcla esté realmente llena de aroma. Agregue la carne e incremente el calor para que se dore bien y quede completamente cubierta con las especias; esto llevará unos minutos.", "Agregue la leche de coco, lleve a ebullición y luego agregue el caldo caliente. Encienda el fuego y continúe cocinando; la cantidad de líquido se reducirá rápidamente. Revuelva ocasionalmente hasta que la salsa se reduzca a una pasta espesa. Reduzca el fuego y siga cocinando y revolviendo hasta que la salsa se vuelva espesa como la lava y cubra la carne, al menos 1-1½ horas.", "Para la salsa picante de mango, caliente una sartén hasta que esté caliente. Agregue todas las especias y tostadas durante 30 segundos o hasta que las semillas de mostaza comiencen a reventar. Agregue el mango verde y los mangos maduros y cocine durante 1-2 minutos. Agregue el azúcar y cocine hasta que se disuelva en los jugos de mango, luego agregue el vinagre.", "Cubra con una tapa y reduzca el calor. Cocine a fuego lento durante 25 minutos, o hasta que el mango se haya descompuesto y la mezcla se asemeje a chutney.", "Para el arroz pegajoso, enjuague el arroz tres veces y drene a fondo.", "Cocine el arroz de acuerdo con las instrucciones del paquete, o colóquelo en una cacerola y cúbralo con agua hasta el primer nudillo en su dedo. Agregue la sal, cubra con una tapa y deje hervir. Hierva durante cinco minutos, luego, sin abrir la tapa, apague el fuego y deje que el arroz hierva durante 20 minutos.", "Para servir, apile el arroz en platos para servir, y agregue el rendang de ternera junto con una cucharada de chutney de mango."]}, {"isVegetarian": false, "title": "Costillas de res con salsa de barbacoa, papa al horno y cebolleta crema agria", "url": "www_bbc_co_uk_food_recipes_beef_ribs_with_bbq_sauce_80391", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_ribs_with_bbq_sauce_80391_16x9.jpg", "ingredients": ["4 costillas de ternera de la escala de Jacob", "1 cebolla picada", "1 cabeza de ajo, cortado por la mitad horizontalmente", "1 cucharadita de semillas de hinojo", "Anís de 2 estrellas", "4 papas para hornear", "un poco de aceite", "sal marina y pimienta negra recién molida", "Crema doble de 200 ml / 7 fl oz", "1 limón, solo jugo", "3 cucharadas de cebollines, finamente en rodajas", "25g / 1oz de mantequilla, más extra para servir", "1 cebolla, más o menos picada", "1 diente de ajo, aplastado", "2 chiles rojos, finamente cortados", "1 cucharadita de semillas de hinojo, trituradas", "Anís de 2 estrellas", "150g / 5½oz de azúcar mascabado ligero", "300g / 10½ oz de salsa de tomate", "150g / 5½oz de chile chipotle, salsa de tomate", "150ml / 5fl oz de salsa de soja oscura"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las costillas en una olla grande y ancha. Cubra con agua y agregue la cebolla, el ajo, las semillas de hinojo y el anís estrellado.", "Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento muy suavemente durante tres horas, o hasta que la carne esté tierna, rozando cualquier espuma de vez en cuando.", "Precalentar el horno a 200C / 400F / Gas 6.", "Frote las papas para hornear con un poco de aceite. Crea cuatro pequeños montones de sal marina en una bandeja para hornear y luego coloca las papas encima. Hornee durante 1-1½ horas o hasta que estén tiernas.", "Mientras tanto, prepara la salsa de barbacoa. Calentar una sartén hasta que esté caliente y agregar la mantequilla, la cebolla y el ajo y freír durante 4-5 minutos, o hasta que se ablanden.", "Agregue los chiles, las semillas de hinojo, el anís estrellado y el azúcar. Cocine por otros 3-4 minutos hasta que el azúcar se haya disuelto.", "Agregue los ketchups y la salsa de soja y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos, o hasta que espese.", "Retirar del fuego y enfriar un poco antes de colocar en una licuadora. Pulse para formar un puré suave.", "Sumerja las costillas en la salsa, colóquelas en una bandeja para asar y agregue más salsa en la parte superior. Coloque en el horno con las papas durante 15-20 minutos hasta que estén pegajosas.", "Mientras se cocinan las costillas, ponga la crema doble, el jugo de limón, el cebollín y una pizca de sal en un tazón grande y bata hasta que espese.", "Sirva las costillas con la chaqueta de patata cubierta con una cucharada de mantequilla y crema agria."]}, {"isVegetarian": false, "title": "Zapatillas de shin de ternera y queso azul", "url": "www_bbc_co_uk_food_recipes_beef_shin_and_blue_34138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2lb 4 oz de espinilla", "harina común, para quitar el polvo", "1 cucharada de aceite de oliva", "100 g / 3½ oz de mantequilla", "Panetta ahumada de 150 g / 5½ oz, picada", "4 cebollas, en rodajas finas", "½ cabeza de apio, en rodajas finas", "2 cucharadas de azúcar moreno", "2 cucharadas de vinagre de vino tinto", "500ml / 18fl oz de cerveza belga oscura", "1-2 hojas de laurel", "2 ramitas de tomillo", "1 cabeza de ajo, cortado por la mitad", "sal y pimienta negra recién molida", "1 cucharada de perejil finamente picado, para adornar", "Harina de auto aumento 250g / 9 oz", "50g / 1¾oz de mantequilla picada", "1 cucharadita de sal", "1 cucharadita de tomillo finamente picado", "150g / 5½oz Stilton, desmenuzado", "150ml / 5fl de leche en oz"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Sazonar la carne y rodar en un poco de harina.", "Calentar el aceite en una cazuela grande y dorar la carne por todas partes. Retire la carne y reserve.", "Derrita la mantequilla, luego agregue la panceta, las cebollas y el apio y cocine hasta que las cebollas estén blandas y la panceta esté crujiente.", "Regrese la carne a la sartén, luego agregue el azúcar y el vinagre. Permita burbujear y luego vierta la cerveza. Agregue las hierbas y el ajo y cocine durante 2-3 horas, o hasta que la carne esté tierna y se deshaga.", "Retire el plato del horno y aumente la temperatura del horno a 200C / 180C Fan / Gas 6.", "Para hacer el relleno, frote la harina y la mantequilla junto con la sal y el tomillo. Agregue el queso y agregue lentamente la leche. Mezcle hasta que tenga una masa áspera.", "Enrolle la masa en un tronco grueso de 3 cm / 1¼ pulgadas. Córtelo en rodajas y póngalo sobre el estofado de ternera.", "Cocine por 25-30 minutos. Espolvorea sobre el perejil y sirve."]}, {"isVegetarian": false, "title": "Hamburguesa de ternera con mayonesa de trufa, salsa picante de tomate en pan de brioche con papas fritas", "url": "www_bbc_co_uk_food_recipes_beef_steak_burger_with_02716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500 g / 1 libra de filete de carne picada de 2 onzas", "2 patatas fritas grandes, peladas y cortadas en finas papas fritas", "aceite vegetal, para freír", "4 rollos de brioche", "8 pepinillos en rodajas", "4 tomates de carne en rodajas", "½ ronda de lechuga, hojas separadas", "1 cebolla roja, en rodajas", "1 cucharada de aceite de oliva", "½ chalota, picada", "1½ tomates, picados", "1 diente de ajo, aplastado", "1 cucharada de vinagre balsámico", "1 cucharadita de azúcar moreno", "3 yemas de huevo", "2 cucharaditas de mostaza Dijon", "150ml / 5fl oz de aceite de oliva ligero", "100ml / 3½fl oz de aceite de girasol", "50ml / 2fl oz de aceite de trufa", "2 cucharadas de jugo de limón", "algunas virutas de trufa negra (opcional)", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para la hamburguesa y las papas fritas, ponga la carne picada en un tazón grande y sazone con sal y pimienta. Use sus manos para dar forma a la carne picada en cuatro hamburguesas en forma de hamburguesa. Envuelva las hamburguesas individualmente en film transparente y colóquelas en la nevera durante una hora.", "Mientras tanto, para el chutney de tomate, caliente el aceite en una sartén pequeña. Agregue la chalota, los tomates y el ajo y cocine durante 5-8 minutos hasta que se ablanden. Agregue el vinagre y el azúcar y cocine por 3-5 minutos hasta que la salsa picante se haya caramelizado ligeramente.", "Para la mayonesa de trufa, coloca las yemas de huevo, la mostaza y una pizca de sal y pimienta en un procesador de alimentos y combínalos. Mezcle los aceites en una jarra, luego, con el motor en marcha, vierta lentamente aceite a través del tubo de alimentación hasta que tenga una emulsión espesa. Mezcle el jugo de limón y un poco de agua tibia para aflojar, si es necesario.", "La mayonesa se mantendrá durante hasta 2 días en la nevera. Justo antes de servir, agregue las virutas de trufa.", "Cuando esté listo para cocinar la hamburguesa y las papas fritas, caliente el aceite vegetal en una freidora a 190 ° C. Alternativamente, caliente el aceite en una cacerola profunda hasta que un cubo de pan chisporrotee y se ponga marrón cuando lo deje caer. (PRECAUCIÓN: El aceite caliente puede ser peligroso; no lo deje sin supervisión).", "Con cuidado agregue las papas a la freidora y cocine por 2-3 minutos, o hasta que estén recién coloreadas y crujientes. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre un plato forrado con papel de cocina. Sazonar con sal.", "Calienta una sartén grande con un poco de aceite. Cocine las hamburguesas en cada lado durante 2-3 minutos, o hasta que se cocinen a su gusto (puede servir la hamburguesa rara, ya que está utilizando carne picada fresca de carne).", "Para servir, coloque cada hamburguesa en un rollo de brioche cubierto con pepinillos, rodajas de tomate, salsa picante, lechuga, unas rebanadas de cebolla y la mayonesa de trufa. Asegure con un pincho de madera y sirva con las papas fritas."]}, {"isVegetarian": false, "title": "Estofado de ternera y albóndigas con zanahorias Vichy", "url": "www_bbc_co_uk_food_recipes_beef_stew_and_dumplings_09183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "Filete de guisado de 750 g / 1 lb 10 oz, cortado en piezas de 2-3 cm / ¾-1¼in", "2 cucharadas de harina normal", "2 dientes de ajo picados", "Chalotes redondos de 250g / 9oz, pelados y enteros a la izquierda", "150ml / 5½fl oz de vino tinto", "500ml / 18fl oz de caldo de carne", "2 hojas frescas de laurel", "3 cucharadas de hojas frescas de tomillo", "Salsa Worcestershire, al gusto", "sal y pimienta negra", "125g / 4½oz de harina natural", "1 cucharadita de polvo de hornear", "pizca de sal", "60 g / 2¼ oz de sebo", "4 zanahorias medianas, peladas y dejadas enteras", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de azúcar"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el estofado de ternera, caliente el aceite y la mantequilla en una cazuela para horno y fría la carne hasta que se dore por todos lados.", "Espolvorea sobre la harina y cocina durante 2-3 minutos más. Agregue el ajo y los chalotes y fría por 1-2 minutos.", "Agregue el vino, el caldo y las hierbas, luego agregue la salsa Worcestershire al gusto. Sazone al gusto con sal y pimienta negra recién molida.", "Cubra con una tapa, transfiera al horno y cocine durante aproximadamente dos horas, o hasta que la carne esté tierna.", "Para las albóndigas, tamice la harina, el polvo de hornear y la sal en un tazón. Agregue el sebo y suficiente agua para formar una masa espesa. Con las manos enharinadas, enrolle cucharadas de la masa en bolitas.", "Después de dos horas, retire la tapa del estofado y coloque las bolas de masa sobre el guiso. Cubra, vuelva al horno y cocine por otros 20 minutos, o hasta que las albóndigas se hayan hinchado y estén tiernas. (Si prefiere sus albóndigas con una tapa dorada, deje la tapa cuando regrese al horno).", "Para las zanahorias Vichy, coloque las zanahorias, la mantequilla, el azúcar y las cuatro cucharadas de agua en una sartén y deje hervir a fuego lento.", "Cubra con una tapa o cartucho (un círculo de papel a prueba de grasa dispuesto de manera que cubra la parte superior de las zanahorias) y cocine suavemente durante 4-5 minutos, o hasta que las zanahorias estén tiernas. Sazone con sal y pimienta negro.", "Para servir, coloque una cucharada de guiso en un plato y coloque una zanahoria entera y una bola de masa junto a ella."]}, {"isVegetarian": false, "title": "Carne de res en salsa de ostras", "url": "www_bbc_co_uk_food_recipes_beef_in_oyster_sauce_14507", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_in_oyster_sauce_14507_16x9.jpg", "ingredients": ["450 g / 1 lb de filete de res, cortado en tiras delgadas de 5 cm / 2 in", "1 cucharada de salsa de soja ligera", "2 cucharaditas de aceite de sésamo", "1 cucharada de vino de arroz Shaoxing o jerez seco", "2 cucharadas de harina de maíz", "3 cucharadas de aceite de maní o vegetal", "3 cucharadas de salsa de ostras", "1½ cucharadas de cebollas de primavera finamente picadas", "2 cucharaditas de mostaza Dijon", "2 cucharaditas de polvo de curry Madras", "2 cucharadas de salsa de soja ligera", "2 cucharaditas de sal", "1 cucharadita de pimienta negra recién molida", "4 cucharadas de aceite de oliva virgen extra", "100g / 3½ oz de florecillas de brócoli, cortadas en pequeños floretes", "100g / 3½oz de judías verdes, recortadas", "Florecillas de coliflor de 100 g / 3½ oz, cortadas en pequeños floretes", "Guisantes 100 g / 3½ oz", "225g / 8oz de tomate fresco, pelado, sin semillas, picado", "50g / 2 oz castañas de agua dulce, peladas, en rodajas", "3 cucharadas de chalotes finamente picados, exprimidos en seco a través de un paño de lino", "3 cucharadas de cebollines frescos finamente picados"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la carne de res, la salsa de soja, el aceite de sésamo, el vino de arroz Shaoxing o el jerez seco y la harina de maíz en un tazón y mezcle hasta que estén bien combinados. Dejar de lado para marinar durante 20 minutos.", "Caliente un wok o una sartén grande hasta que esté muy caliente.", "Agregue el aceite, y cuando esté muy caliente y ligeramente humeante, agregue las rodajas de carne y saltee durante 5-6 minutos o hasta que estén pálidas doradas.", "Retire las tiras de carne y déjelas a un lado para escurrirlas en un colador sobre un recipiente. Deseche el aceite drenado.", "Limpie el wok o sartén y vuelva a calentarlo a fuego alto hasta que esté caliente.", "Agregue la salsa de ostras y cocine a fuego lento.", "Regrese las rodajas de carne drenada y mezcle bien con la salsa.", "Convierta la mezcla en un plato de servir y adorne con las cebolletas.", "Mientras tanto, para la ensalada, mezcle la mostaza, el polvo de curry, la salsa de soja, la sal, la pimienta y el aceite de oliva en un bol.", "Cocine el brócoli, las judías verdes y la coliflor en agua hirviendo durante 2-3 minutos, luego agregue los guisantes y cocínelos durante 1-2 minutos.", "Escurra las verduras en un recipiente tibio y luego agregue las castañas de agua y los tomates, las cebolletas y el cebollín. Rocíe sobre el aderezo de ensalada y mezcle hasta que esté bien combinado.", "Sirve la ensalada junto con la carne."]}, {"isVegetarian": false, "title": "Estofado de ternera con albóndigas mullidas", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_fluffy_95002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_fluffy_95002_16x9.jpg", "ingredients": ["1kg / 2lb 4 oz de carne de res de pejerrey, cortado en trozos grandes", "1 cucharadita de harina común", "2 cucharadas de aceite vegetal", "2 cebollas cortadas en trozos", "3 zanahorias, fregadas y cortadas en trozos grandes", "4 palitos de apio, cortados en trozos grandes", "1 cucharada de puré de tomate", "300ml / 10½fl oz de vino tinto", "500ml / 18fl oz de caldo de carne", "2 ramitas de perejil fresco", "1 hoja de laurel", "3 ramitas de tomillo fresco", "2 dientes de ajo, en rodajas finas", "25g / 1oz de mantequilla", "1 cucharadita de jalea de grosella", "Harina normal de 200g / 7oz, más extra para quitar el polvo", "1½ cucharadita de polvo de hornear", "100 g / 3½ oz de sebo, rallado", "2 cucharadas de perejil de flatillo finamente picado", "sal marina y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dragar la carne en la harina hasta que se cubra.", "Caliente la mitad del aceite vegetal en una cazuela grande con tapa a fuego alto. Freír la carne, en tandas, hasta que se dore por todos lados, alrededor de 3-4 minutos. Eliminar y reservar.", "Agregue las cebollas, las zanahorias y el apio a la cacerola y fría por 2-3 minutos. Agregue el puré de tomate, revuelva bien, luego cocine por 1-2 minutos más.", "Verter el vino tinto, llevarlo a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento hasta que haya reducido el volumen a la mitad. Agregue el caldo de carne y devuelva la mezcla a fuego lento. Regrese la carne a la cazuela y mezcle bien.", "Ate las hierbas juntas como un bouquet garni usando una cuerda para cocinar y agréguela a la cazuela. Finalmente, agregue el ajo.", "Cubra el estofado con la tapa y cocine a fuego lento durante 1 hora y media, o hasta que la carne esté realmente tierna.", "Para las albóndigas, en un tazón, mezcle la harina, el polvo de hornear, el sebo, el perejil picado y una pizca de sal, luego agregue gradualmente 3-5 cucharadas de agua, mezclando mientras lo hace, hasta que la mezcla se una como un poco pegajosa masa (es posible que no necesite usar toda el agua).", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y enrolle en bolitas, cada mitad del tamaño de una pelota de golf. Dejar de lado hasta que el estofado esté listo.", "Retire el bouquet garni del estofado, condimente al gusto, con sal y pimienta negra recién molida, luego agregue la mantequilla y la jalea de grosella.", "Cubra el estofado con las albóndigas, cubra la cazuela con la tapa, luego vuelva al horno durante 10-15 minutos, o hasta que las albóndigas se hinchen y estén bien cocidas. Servir en tazones."]}, {"isVegetarian": false, "title": "Estofado de ternera con albóndigas light herby", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_light_80291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_light_80291_16x9.jpg", "ingredients": ["aceite en aerosol, para freír", "600g / 1lb 5oz de carne magra guisada, toda la grasa visible eliminada", "1 litro / 1¾ pinta de caldo de carne, hecho de 2 cubos bajos en sodio", "1 cebolla grande, finamente picada", "2 dientes de ajo, aplastados", "2 palitos de apio, finamente picados", "3 zanahorias, 1 finamente picado, resto cortado en trozos", "1 cucharada de puré de tomate", "1 cucharada de vinagre balsámico", "1 chirivía, cortada en trozos", "300g / 10½ oz de calabaza (alrededor de la mitad de una calabaza)", "150g / 5½ oz de harina de auto crianza", "pizca de sal y pimienta negra recién molida", "2 cucharadas de perejil fresco o tomillo (dependiendo de la preferencia)", "1 yema de huevo, ligeramente batida", "1 cucharadita de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Precalentar una cazuela sobre la placa, luego rociar con aceite. Agregue la carne en tandas, cocine cada lote hasta que se dore por todos lados y rocíe con más aceite según sea necesario. Transfiera la carne a un plato con una espumadera y déjela a un lado. Agregue un poco de caldo al plato, suba el fuego a fuego alto y desgrálelo frotando las brochetas cocidas con una espátula.", "Baje el fuego y rocíe el plato con más aceite. Agregue la cebolla y cocine hasta que se ablande. Agregue el ajo y cocine durante 1-2 minutos. Agregue el apio y la zanahoria finamente picada y cocine durante 3-4 minutos. Agregue el puré de tomate y balsámico y cocine por 2-3 minutos más. Vuelva a colocar la carne en la sartén y agregue el resto del caldo, luego déjela hervir.", "Coloque el plato en el horno (sin tapa) y cocine durante 1 hora.", "Agregue la chirivía, la calabaza y los trozos de zanahoria, ponga la tapa en el plato y cocine por otros 30 minutos.", "Para las albóndigas, ponga la harina en un tazón con sal y pimienta. Mezcle las hierbas. Agregue el huevo y el aceite y mezcle, agregando suficiente agua fría para unirlo como una masa (aproximadamente 4 cucharadas). Tenga cuidado de no agregar demasiada agua ya que esto hará que las albóndigas sean pesadas. Amasar la mezcla un poco.", "Forme ocho piezas del tamaño de una pelota de golf y póngalas encima del estofado, empujando hacia abajo un poco para cubrirlas con los jugos. Cubra con la tapa y vuelva al horno por 15 minutos, luego quite la tapa y cocine por otros 15 minutos.", "Cuando las albóndigas estén doradas, sáquelas del estofado y sirva los tazones y mezcle el guiso (la calabaza estará muy tierna, lo que espesará y dará sabor a la salsa). Servir inmediatamente."]}, {"isVegetarian": false, "title": "Beef stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_stroganoff_16029", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stroganoff_16029_16x9.jpg", "ingredients": ["½ cucharada de aceite de oliva ligero", "1 cebolla grande, finamente rebanada", "3 dientes de ajo, finamente picados", "1 cubo de caldo de carne", "2 cucharaditas de pimentón dulce ahumado", "1 cucharada de puré de tomate", "400 g de carne de estaño consumida", "Setas de castaña de 150 g / 5½ onzas, en rodajas finas", "1 cucharada de mostaza Dijon", "2 filetes de grupa (175g / 6oz cada uno), grasa visible recortada", "aceite de oliva en aerosol", "60g / 2¼ oz de cornichons o gerkitos pequeños, en rodajas", "75ml / 2½ fl oz crema medio grasa", "2 cucharadas de perejil de flatillo finamente picado", "2 cucharadas de perifollo picado", "2 cucharadas de hojuelas de cebolla seca", "sal marina y pimienta negra recién molida", "160g / 5¾oz de arroz basmati, recién cocido"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de oliva ligero en una sartén grande a fuego medio-bajo. Agregue la cebolla y cocine suavemente durante 10 minutos, o hasta que se ablande y comience a caramelizar.", "Agregue el ajo y cocine suavemente durante 2 minutos. Revuelva en el cubo común y mezcle el puré de pimentón y tomate. Cocine, revolviendo, durante 2 minutos. Agregue el consomé de carne, champiñones y mostaza. Llevar a ebullición a continuación, baje el fuego y cocine a fuego lento durante 10-15 minutos, o hasta que el volumen de líquido se haya reducido a la mitad.", "Mientras tanto, coloca una sartén a fuego alto. Desmenuce los filetes entre dos hojas de film transparente, hasta aproximadamente 5 mm / ¼ de grosor. Rocíe cada lado con seis sprays de aceite y sazone con sal y pimienta. Cuando la plancha esté caliente, agregue los filetes y cocine durante 1 minuto en cada lado. Retire y reserve para descansar.", "Una vez que la salsa se haya reducido, retírela del fuego y revuelva a través de los cornichons, crème fraîche, y la mayor parte del perejil y perifollo (reservar algunos para guarnición). Agregue los jugos de la carne en reposo y revise el condimento. Corta la carne en rodajas gruesas y agrega la salsa.", "Mezcle los copos de cebolla seca y el perejil picado reservado y el perifollo. Sirve el stroganoff espolvoreado con la mezcla de cebolla y hierbas, con el arroz en el lado, si quieres."]}, {"isVegetarian": false, "title": "Beef stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_stroganoff_21900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml / 10fl oz de aceite vegetal", "4kg / 8lb 12oz filete estofado, cortado en tiras finas", "10 cebollas grandes, en rodajas", "15 pimientos rojos, semillas retiradas y rebanadas", "2.5kg / 5lb 8 oz champiñones, en rodajas", "2 cucharadas de pimentón", "1 litro / 1¾ pintas de agua", "2,5 litros / 4½ pintas de yogurt natural"], "serves": "Para 40", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite vegetal en sartenes grandes y agregue la carne. Freír durante 2-3 minutos, volteándolo una o dos veces, hasta que la carne esté dorada por completo, luego retire la carne de la sartén y déjela a un lado.", "Agregue un poco más de aceite si es necesario y fría las cebollas durante 3-4 minutos o hasta que comience a ablandarse, luego mezcle los pimientos y cocine durante 3-4 minutos más. Agregue los champiñones y cocine por otros cinco minutos.", "Espolvoree en el pimentón y revuelva para cubrir las verduras, luego agregue el agua y el yogur y reduzca el fuego.", "Agregue la carne y los jugos de reposo. Transfiera a platos a prueba de horno, cubra con papel de aluminio y cocine en el horno durante aproximadamente una hora y media o hasta que la carne esté tierna y la salsa espesa."]}, {"isVegetarian": false, "title": "Batidor de carne", "url": "www_bbc_co_uk_food_recipes_beef_sukiyaki_84557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Dashi instantáneo líquido 175ml / 6fl oz", "150ml / 5fl oz de salsa de soja", "50ml / 1¾fl oz", "2 cucharadas de aceite de cacahuete", "2 cucharaditas de aceite de sésamo", "Filete de carne de 450 g / 1 lb o bife de costilla bien cortado, finamente cortado (un poco más grueso que el carpaccio)", "1½ cucharada de azúcar", "12 champiñones, en rodajas", "4 setas de tapa marrón en rodajas", "100 g / 3½ oz enoki setas, divididas en 4", "6 hongos shiitake frescos (quite los tallos y corte en ½)", "½ repollo chino (idealmente col de Napa) en rodajas de 2.5cm / 1in de espesor", "1½ palitos de apio, cortados en diagonal de 5 mm / ¼ de grosor", "Tofu firme de bloque 160-175g / 5¾-6oz, en cubos", "200 g / 7 oz de rodajas de bambú en rodajas, envasados ​​al vacío (alternativamente, se utilizan brotes de bambú enlatados y drenados)", "6 cebollas de primavera, cortadas en piezas de 2.5cm / 1in en una inclinación", "arroz cocido, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa, mezcle el líquido dashi con 175 ml / 6 fl oz de agua en una jarra para llevar el líquido total a 375 ml / 13 fl oz. Agregue los ingredientes restantes para la salsa. Dejar de lado.", "Para la carne de res, caliente una sartén grande con tapa que sea adecuada para servir en la mesa. Caliente el aceite de cacahuete y el aceite de sésamo hasta que estén calientes. Agregue la carne y espolvoree el azúcar. El azúcar ayudará a caramelizar la carne. Voltee la carne después de unos 30 segundos, ya que la carne es tan fina que se cocinará muy rápido.", "Retire la carne de la sartén. Agregue los champiñones, la col, el apio, el tofu y los brotes de bambú a la misma olla y cocínelos por otros dos minutos, solo para dorar el tofu ligeramente y para marchitar el repollo. No desea cocinar en exceso, ya que aún desea conservar las texturas del apio.", "Agregue la salsa de sukiyaki a la sartén, ponga la tapa y cocine a fuego lento durante dos minutos.", "Retire la tapa, voltee las verduras y el tofu y luego combine la carne con las verduras. Agregue las cebolletas y hierva a fuego lento por otros dos minutos.", "Sirva en la sartén en la mesa para que todos puedan ayudarse a sí mismos, o divida la mezcla en cuatro tazones con un tazón de arroz cada uno."]}, {"isVegetarian": false, "title": "Torneos de carne Rossini", "url": "www_bbc_co_uk_food_recipes_beef_tournedos_rossini_16043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de mantequilla", "4 rebanadas de pan blanco", "1 cucharada de aceite de oliva", "Filete de ternera de 4 x 200 g / 7 oz", "8 cucharadas de madeira", "200ml / 7fl oz de caldo de carne", "5 granos de pimienta", "50 g / 1¾oz de mantequilla sin sal", "200 g / 7 oz de setas", "algunas rodajas de trufa fresca", "1kg / 2lb 4oz de papas blancas, peladas y cortadas en trozos", "300 ml / 10 fl oz doble crema", "300ml / 10fl oz de leche entera", "100g / 3½oz de mantequilla sin sal"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el Rossini, caliente una sartén pequeña y agregue un poco de mantequilla. Corta las cortezas del pan y córtalas del mismo tamaño que el bistec. Agregue el pan a la sartén y pan tostado en cada lado.", "Calienta una sartén por separado y agrega el aceite. Cocine el bistec a su gusto. Retire de la sartén y coloque sobre el pan tostado para descansar.", "En la sartén se cocinan los filetes en agregar la madeira. Desglaze la sartén raspando las partes atascadas de cocinar el bistec. Cocine hasta que el volumen de líquido se reduzca a la mitad, luego agregue el caldo de carne y los granos de pimienta. Cocine por 2-3 minutos, luego cuele a través de un colador fino en una sartén limpia y termine con un pomo de mantequilla.", "En una sartén separada, agregue la mantequilla restante y, una vez caliente, agregue las setas y cocine por 2-3 minutos.", "Para el puré, coloque las papas en una sartén grande llena de agua fría y deje que hierva. Cocine por 15-20 minutos o hasta que las papas estén suaves.", "Drene y coloque de nuevo en la sartén. Mash o arroz las patatas. Agregue la crema, la leche y la mantequilla y mezcle para formar un puré suave.", "Para servir, agregue algunas virutas de trufa a la salsa. Coloque una cucharada de puré en los platos para servir, coloque el pan y el bistec al lado y vierta la salsa sobre los filetes. Termine con más virutas de trufa y esparza los hongos silvestres por el bistec."]}, {"isVegetarian": false, "title": "Turnetes de carne Rossini con salsa de Madeira", "url": "www_bbc_co_uk_food_recipes_beef_tournedos_rossini_68537", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 filetes de solomillo de res de 200 g / 7 oz", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "115g / 4oz de mantequilla", "1 cebolla, piel encendida, partida por la mitad", "150ml / 5fl oz Madeira", "150ml / 5fl oz de vino tinto", "250ml / 9fl oz de carne de vaca o ternera", "250 g / 9 oz hojas de espinaca bebé", "1 nuez moscada recién rallada", "Pate de hígado de pato 175g / 6oz", "4 rebanadas de brioche"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Sazonar la carne con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, agregue el aceite y un poco de mantequilla, selle la carne de cada lado por tres minutos, luego retírela del fuego y déjela reposar.", "Caliente una sartén hasta que esté caliente; agregue un poco más de la mantequilla y la cebolla, corte el lado hacia abajo. Freír hasta que la base de la cebolla esté muy dorada, luego agregue el Madeira y cocine hasta que se reduzca a la mitad.", "Agregue el vino tinto, reduzca nuevamente y luego agregue el caldo y cocine una vez más hasta que se reduzca a la mitad. Cuele en una sartén limpia y luego mezcle en 25 g / 1 oz de la mantequilla y sazone con sal y pimienta negra recién molida. Mantener caliente", "Caliente una sartén hasta que esté caliente, agregue un poco más de mantequilla y las espinacas, cocine hasta que la espinaca se haya marchitado y sazone con un poco de sal, pimienta negra recién molida y nuez moscada. Escurra las espinacas en papel de cocina.", "Caliente la última manteca en una sartén limpia hasta que haga espuma, luego agregue las rodajas de brioche y cocine en cada lado hasta que estén doradas. Retire de la sartén y escurra sobre papel de cocina.", "Para servir, coloque el brioche en el centro del plato y luego extienda el paté de hígado de pato sobre la parte superior. Coloque un montón de espinacas encima y luego los bistecs descansados. Termine con un cucharón de salsa de Madeira en la parte superior."]}, {"isVegetarian": false, "title": "Buey Wellington", "url": "www_bbc_co_uk_food_recipes_beef_wellington_22208", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_wellington_22208_16x9.jpg", "ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite vegetal", "2 chalotes, finamente cortados en cubitos", "8 hongos castaños, picados", "2 cucharadas de crema", "guión de aceite vegetal, para freír", "Filete de res de 1.2kg / 2lb 12 oz", "sal y pimienta para probar", "3-4 crêpes (puedes usar ready-made)", "225 g / 8oz de hojaldre listo para usar", "2 yemas de huevo de gallinas camperas, ligeramente batidas", "1 diente de ajo, reducido a la mitad", "1kg / 2lb 4 oz de papas cerosas, peladas y muy finamente cortadas (preferiblemente en una mandolina)", "Crema doble 500ml / 18fl oz", "sal y pimienta para probar", "botón de mantequilla", "1 chalote, finamente cortado en cubitos", "Puerto de 100 ml / 3½ fl oz", "100 ml / 3½ fl oz en Madeira", "500ml / 18fl oz de caldo de ternera (o caldo de res o pollo)", "1 cucharada colmada de peladuras de trufa en salmuera, escurrida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para el champiñón duxelle, caliente la mantequilla y el aceite vegetal en una sartén. Una vez caliente, agregue los chalotes picados y fría, revolviendo todo el tiempo, durante dos minutos. Consejo en los champiñones picados. Reduzca un poco el fuego y continúe revolviendo y cocinando durante unos diez minutos hasta que los hongos se ablanden y el líquido se haya evaporado. Agregue la crema y cocine por otros dos minutos, luego retírela del fuego y déjela enfriar.", "Para el Wellington, caliente el aceite en una sartén a fuego alto. Sazone el filete con sal y pimienta. Una vez que el aceite esté humeando, agregue la carne de res y fría por todos lados hasta que tenga un color marrón caramelo. Retirar a un plato y dejar enfriar. (NB: No lave la sartén. Use esto para hacer la reducción de Madeira y el puerto más adelante).", "Coloque las crepes en la superficie de trabajo, una capa de espesor, pero superpuestas: debe crear un área de aproximadamente el doble del grosor del filete, y alrededor de 2,5 cm / 1 in más en cada extremo. Extiende el champiñón duxelle sobre las crepes.", "Toque ligeramente el filete con papel de cocina para eliminar el exceso de humedad, antes de colocar la carne sobre la duxelle.", "Con cuidado, enrolle el lado más cercano a usted sobre la carne que lo recubre con crêpes y champiñones. Las crepes deben cubrir la carne por todos lados, pero recortar cualquier exceso.", "Coloque el filete envuelto en una hoja de film transparente y envuélvalo bien en un cilindro. Guarde en la nevera hasta que esté completamente frío, aproximadamente media hora.", "Mientras tanto, para la patata dauphinoise, precalentar el horno a 150C / 300F / Gas 2.", "Frote el interior de un plato hondo para hornear o una cacerola con el ajo crudo.", "Coloque las papas en rodajas en un recipiente y vierta sobre la crema y sazone con sal y pimienta negra recién molida. Revuelva para cubrir las papas, luego póngalas uniformemente en la fuente para hornear garlicicky.", "Cubra el plato con papel de aluminio y hornee en el horno durante 30 minutos. Retire la lámina y cocine durante 20-30 minutos más mientras prepara Wellington.", "Ruede los pasteles en una superficie bien enharinada a un rectángulo con un grosor de aproximadamente 3 mm.", "Cepille la masa con la yema de huevo batida. Retire la película adhesiva del filete de carne y colóquela en el centro de la masa.", "Envuelva la masa sobre el filete de carne. Estira ligeramente un borde de la costura para que no quede demasiado grueso, luego presiona firmemente para sellar.", "Deberías quedarte con un tubo abierto en cada extremo. Presione ligeramente los extremos de la masa utilizando un rodillo para sellar y adelgazar las dos piezas. Luego, con un cuchillo pequeño, recorte los bordes en cada lado para formar una forma triangular. Cepille el triángulo de masa con un pequeño huevo y presiónelo contra el costado del Wellington. Repita con el otro lado antes de dar la vuelta para que el Wellington esté hacia abajo.", "Coloque su Wellington en una bandeja para hornear, cepille con la yema de huevo restante a un lado en el refrigerador para enfriar durante 5-10 minutos.", "Aumente la temperatura del horno a 180C / 350F / Gas 4 (el dauphinoise debe permanecer en el horno).", "Retire el Wellington de la nevera y marque un patrón de su elección en la parte superior.", "Coloque en el horno con las patatas dauphinoise y hornee durante 25 minutos. Retire el Wellington del horno y déjelo reposar durante 10 minutos. Esto debería darte un final perfectamente rosado a tu carne. Si lo prefiere más cocido, déjelo en el horno por más tiempo, pero debe asegurarse de que la carne esté bien descansada.", "Para la reducción de Madeira y el puerto, caliente la mantequilla en la misma sartén en la que cocinó el filete de res a fuego medio. Una vez burbujeando, agregue la chalota y fría por 3-4 minutos, o hasta que se ablanden.", "Aumente el calor y agregue el puerto y Madeira. Cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad y luego agregue el caldo. Reducir nuevamente a la mitad. Cuando la salsa tenga una consistencia espesa y almibarada, cuela a través de un colador fino. Agregue las cáscaras de trufa y mantenga caliente hasta que esté listo para servir.", "Sirva rebanadas de ternera Wellington con el dauphinoise de patata al lado y la reducción de Madeira y el puerto."]}, {"isVegetarian": false, "title": "Buey Wellington", "url": "www_bbc_co_uk_food_recipes_beef_wellington_95545", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g porcini secos", "1 cucharada de mantequilla", "3 chalotes, finamente picados", "Setas de castaña 300 g / 10½ oz, finamente picadas", "3 ramitas de tomillo", "100ml / 3½fl oz de brandy", "100 ml / 3½ fl oz de crema individual", "6 filetes de solomillo gruesos con un buen marmoleado de grasa", "1 cucharada de aceite de oliva", "2 cucharaditas de mostaza inglesa", "harina común, para quitar el polvo", "500 g / 1lb 2 oz de hojaldre", "1 huevo grande de gallinas camperas, golpeado", "sal marina y pimienta negra recién molida", "400 g / 14 oz verdes de temporada, al vapor"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el llenado, primero sumerja los porcini en agua hirviendo durante 10-15 minutos hasta que estén suaves y tiernos. Escurrir, reservar el líquido de remojo y picar finamente.", "Derrita la mantequilla en una sartén antiadherente grande a fuego medio hasta que forme espuma. Agregue las chalotas y fría por 6 minutos hasta que se ablanden. Agregue los porcini y los champiñones castaños junto con el tomillo y cocine durante 6 minutos hasta que estén tiernos. Vierta el líquido de remojo de hongos, el brandy y la crema y cocine a fuego lento hasta que el líquido se haya reducido y la mezcla se espese. Coloque el relleno en un recipiente limpio y deje que se enfríe por completo.", "Para la carne Wellington, sazone los filetes con sal marina y pimienta negra recién molida. Limpie la bandeja utilizada para cocinar el relleno con papel de cocina y luego colóquelo a fuego alto con un poco de aceite y dore los filetes, en lotes si es necesario, durante aproximadamente 1 minuto en cada lado. Retire del fuego y descanse durante al menos 30 minutos. Cuando esté completamente frío, cepille cada uno con mostaza.", "Precaliente el horno a 220C / 200C Ventilador / Gas 7. Espolvoree la superficie de trabajo con harina y extienda la masa de hojaldre en un rectángulo grande que mida aproximadamente 45x30cm / 18x12 in y aproximadamente 3 mm de grosor. Divida el rectángulo en seis cuadrados, cada uno lo suficientemente grande como para envolver todo alrededor de cada filete.", "Divida la mezcla de champiñones entre los seis cuadrados y extiéndala sobre la masa, dejando 1 cm al descubierto alrededor del borde. Coloque el filete de carne en la parte superior. Cepille los bordes de la masa con el huevo, luego levante los bordes de la masa sobre la carne y dele la vuelta cuidadosamente en los bordes. Coloque los paquetes en una bandeja para hornear, con la base hacia abajo.", "Cocine en el horno durante 15 a 20 minutos por poco común, o de su agrado.", "Retire del horno para descansar durante 5 minutos antes de servir en platos calientes con verduras al vapor."]}, {"isVegetarian": false, "title": "Carne de res Wellington con salsa de estragón", "url": "www_bbc_co_uk_food_recipes_beef_wellington_with_35577", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_wellington_with_35577_16x9.jpg", "ingredients": ["1,3 kg / 2 lb 14 oz de corte medio filete de res", "1 cucharada de aceite", "1½ x 375 g paquetes de hojaldre con mantequilla", "harina común, para quitar el polvo", "1 huevo, batido con una pizca de leche", "sal y pimienta negra recién molida", "gran perilla de mantequilla", "350g / 12oz de hongos mezclados (como botón, castaño, silvestre), en rodajas finas", "50g / 1¾oz de queso parmesano, finamente rallado", "1 cucharada de estragón picado", "2 cucharaditas de mostaza Dijon", "1 yema de huevo", "pequeña perilla de mantequilla", "100 g / 3½ oz champiñones, finamente rebanados", "1 cucharada de harina normal", "400ml / 14fl oz de crema entera en grasa", "1 cucharada de mostaza Dijon", "1 cucharada de estragón recién picado", "un pellizco de azúcar"], "serves": "Sirve 6-8", "time": {"preparation": "1-2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Sazone la carne con sal y pimienta. Coloque una sartén grande a fuego alto, agregue el aceite y fría la carne por todos lados hasta que se dore. Transfiera a una bandeja para hornear y tueste en el horno por 15-18 minutos. Apaga el horno y quita la carne. Deje que se enfríe, reservando los jugos de cocción y luego enfríe en la nevera durante al menos 1 hora (consulte la sugerencia).", "Luego haz el topping. Derrita la mantequilla en la misma sartén y fría los champiñones a fuego alto durante 5-10 minutos; puede necesitar hacer esto en tandas. Incline los champiñones en un colador colocado sobre un recipiente para recoger los jugos y reservarlos para la salsa. Transfiera los champiñones a otro recipiente y deje que se enfríen antes de mezclarlos con el parmesano, el estragón, la mostaza y la yema de huevo. Sazone con sal y pimienta y deje enfriar en la nevera durante 30 minutos.", "Cubra una bandeja para hornear con papel de hornear. Coloque el paquete único de 375 g de masa en una superficie de trabajo enharinada y extiéndalo en un cuadrado de aproximadamente 40 cm / 16 pulgadas de tamaño, luego transfiéralo a la bandeja para hornear. Coloque la carne cocida a un lado de la masa y espolvoree la mezcla de champiñones en la parte superior. Dobla los extremos de la masa y luego dobla el borde más largo sobre la carne, sellando a lo largo del lado con un poco de la colada de huevo. Enfriar en la nevera durante 30 minutos. Mientras está enfriando, precaliente el horno nuevamente a 220C / 200C Fan / Gas 7.", "Cepille la parte superior de la carne fría Wellington con huevo lavado. Estire el resto del bloque medio de masa y corte en 8 tiras finas: coloque 4 tiras en diagonal, y espaciadas uniformemente, sobre la parte superior de la carne de res Wellington, y 4 tiras a través de éstas para crear un patrón reticular. Cepille el enrejado con un lavado de huevo y luego tueste en el horno durante 30-35 minutos o hasta que el pastel esté dorado y crujiente.", "Mientras tanto, prepara la salsa de estragón. Derrita la mantequilla en la misma sartén y fría los champiñones a fuego alto durante 5-10 minutos o hasta que los jugos se evaporen. Espolvoree la harina y agregue la crème fraîche con los jugos de hongos reservados (de la cobertura), la mostaza y el estragón. Sazonar con sal, pimienta y azúcar y llevar a ebullición, revolviendo. Cocine a fuego lento durante 3 minutos hasta que se reduzca ligeramente y agregue los jugos de carne de res de la bandeja de horneado original. Mantener caliente.", "Deje reposar la carne de res Wellington, cubierta con papel de aluminio, durante 15 minutos antes de tallar. Cortar en rodajas gruesas y servir con la salsa de estragón caliente."]}]