[{"isVegetarian": false, "title": "Lobster rolls", "url": "www_bbc_co_uk_food_recipes_lobster_rolls_14094", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp pickling spices", "½ tsp coriander seeds", "½ tsp peppercorns ", "250ml/9fl oz rice vinegar ", "2 tsp sugar", "2 sticks celery, thinly sliced", "1 cooked lobster, shell removed, chopped  into chunks ", "1 small sprig tarragon, finely chopped", "3 tbsp mayonnaise", "lemon juice, to taste", "salt and pepper, to taste", "2 brioche rolls ", "butter, to taste", "celery leaves, for garnish (optional)"], "serves": "Makes 2 rolls", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the pickling spices, coriander seeds and peppercorns in a muslin bag. ", "In a saucepan, heat the vinegar, sugar and the bag of spices.  Add the celery, bring to a simmer and remove from the heat. Leave the celery to cool.", "Mix the lobster, tarragon, mayonnaise and lemon juice together in a bowl. Remove the celery from the pickling ingredients and add it to the bowl. Mix together well and add salt and pepper to taste.", "Spread butter on the outer sides of the rolls and toast slightly with the blow-torch.", "Split the rolls down the centre and fill with the lobster mayonnaise. Dress with a few celery leaves and serve."]}, {"isVegetarian": false, "title": "Lobster salad with Thai crab and lobster cakes and sweet chilli sauce", "url": "www_bbc_co_uk_food_recipes_lobster_salad_with_thai_64088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz fresh white crab meat", "75g/3oz cooked lobster meat", "75g/3oz cooked cold mashed potato", "1 red chilli, finely diced", "1cm /½in fresh ginger, finely grated", "1 lime, juice and zest only", "1 small bunch coriander, finely chopped", "salt and freshly ground black pepper", "75g/3oz plain flour", "2 free-range eggs, lightly beaten", "50g/2oz panko breadcrumbs", "2 red chillies, finely diced", "75g/3oz caster sugar", "75ml/3fl oz rice wine vinegar", "1 mango, peeled and finely diced", "½ vanilla pod, split and seeded", "1 lime, juice only", "salt and freshly ground black pepper", "75g/3oz butter", "4 large cooked lobster claws", "1 small handful frisée lettuce", "1 small handful lambs lettuce", "1 small handful watercress leaves", "2 tbsp coriander cress", "olive oil, for dressing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab and lobster cakes, heat a deep fat fryer to 190C/375F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the crab, lobster, potato, chilli, ginger and lime juice and zest into a bowl and mix thoroughly.", "Add the coriander and season with salt and black pepper.", "Using two small spoons, form quenelles from the mix, then carefully coat each quenelle in the flour, then the beaten egg and then coat in the breadcrumbs.", "Place gently into the fat fryer and fry until golden-brown and hot through – about two minutes. Remove with a slotted spoon and drain onto kitchen paper.", "For the sweet chilli sauce, place the chillies, sugar, vinegar and 25ml/1floz water into a saucepan and bring to a boil.", "Reduce the heat and simmer for five minutes, or until thickened.", "Place into a food blender and blend to a purée, then pass through a fine sieve and allow to cool.", "For the salad, place half of the mango, the vanilla seeds and lime juice into a small food processor and blend to a purée, and then pass through a fine sieve into a bowl.", "Check for seasoning, adding more lime, salt and black pepper, if needed.", "Heat a frying pan until medium hot, add the butter and heat until melted then add the lobster and warm through, flipping over half way through. Remove from the heat.", "Toss the rest of the mango with all the leaves in a bowl, dressing with a little olive oil, salt and black pepper.", "To serve, place a dollop of mango dressing onto each of four plates, then quickly spread it across the plate.", "Top with a little pile of salad and a lobster claw.", "Place a few crab and lobster cakes around the plate and then finish with several drops of sweet chilli sauce."]}, {"isVegetarian": false, "title": "Lobster Thai curry with butter basmati rice and coriander cress", "url": "www_bbc_co_uk_food_recipes_lobster_thai_curry_with_47060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 long red chillies, seeds removed, finely chopped", "2 shallots, finely chopped", "2 garlic cloves, finely chopped", "2cm/¾in piece galangal, chopped (alternatively use root ginger)", "1 lemongrass stalk, finely chopped", "2 tbsp coriander roots", "2 kaffir lime leaves", "¼ tsp shrimp paste", "½ tsp ground cumin", "½ tsp ground coriander", "½ tsp paprika", "200ml/7fl oz coconut milk", "1 tbsp fish sauce", "1 tbsp tamarind paste", "1 lime, juice only", "1 tsp palm sugar", "2 cooked lobsters, meat removed", "2 tbsp coriander cress", "2 tbsp unsalted butter", "2 cloves", "1 cinnamon stick, broken in two", "250g/9oz basmati rice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the paste, place all the ingredients into a small food processor and blend until smooth.", "For the lobster Thai curry, heat a wok, then add the paste and cook for 2-3 minutes.", "Add the lime leaves, shrimp paste , cumin, coriander and paprika. Cook for one minute.", "Add the coconut milk, fish sauce, tamarind, lime juice and palm sugar.", "Meanwhile remove the meat from the lobster and chop the meat, leaving the claw intact.", "Add the lobster to the wok and cook until the lobster is hot. Reduce the heat and let the curry simmer gently until ready to serve.", "Meanwhile for the butter basmati rice, heat a medium saucepan and add one tablespoon of butter.", "Once the butter has melted, add the cloves and cinnamon and cook for one minute. Add the rice and enough water to cover.", "Cover with a lid and turn the heat down to the lowest setting and cook for 20 minutes. Turn off the heat and leave the lid on until ready to serve.", "Just before serving stir the remaining butter though the rice.", "To serve, serve the rice in a serving bowl along with the lobster curry, topped with coriander cress."]}, {"isVegetarian": false, "title": "Lobster thermidor", "url": "www_bbc_co_uk_food_recipes_lobster_thermidor_16349", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz whole cooked lobster, cut in half lengthways, meat removed, shells cleaned and reserved", "50g/1¾oz butter", "2 shallots, finely chopped", "125ml/4fl oz white wine", "500ml/18fl oz fish stock", "250ml/9fl oz double cream", "1 tsp Dijon mustard", "100g/3½oz chanterelle mushrooms, cleaned", "2 tbsp roughly chopped flatleaf parsley", "squeeze lemon juice", "25g/1oz grated Parmesan", "2 free-range egg yolks", "25g/1oz fresh breadcrumbs", "4 King Edward potatoes, peeled and cut into matchsticks", "vegetable oil, for deep frying", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting. Place the lobster shells onto a large baking tray and set aside.", "Heat half of the butter in a frying pan over a medium heat until foaming. Fry the shallots for 3-4 minutes, until softened.", "Pour in the wine and bring the mixture to the boil. Simmer until the volume of liquid has reduced by half, then add the stock and continue to simmer until reduced slightly. Add the double cream and mustard and simmer again for 3-4 minutes, until slightly thickened.", "Meanwhile, heat the remaining butter in a separate frying pan over a medium heat. Add the mushrooms and fry for 2-3 minutes, until just softened. Transfer to a bowl and season well with salt and pepper.", "When the sauce has reduced, add the mushrooms and lobster meat and stir through. Add the parsley, lemon juice and half of the Parmesan and season again.", "Whisk in the egg yolks and continue to cook the mixture  over a low heat for 1-2 minutes, until just thickened.", "Divide the lobster meat and sauce between the lobster shells, then sprinkle over the breadcrumbs and remaining Parmesan.", "Meanwhile, heat the vegetable oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a heavy-based, deep-sided pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous; do no leave unattended.)", "Carefully lower the chipped potatoes into the hot oil and fry for 4-6 minutes, or until tender and golden-brown. Remove and drain on kitchen paper.", "Meanwhile, grill the lobster thermidor for 3-4 minutes, or until the topping is crisp and golden-brown.", "Serve the lobster halves on plates with a pile of matchstick fries alongside."]}, {"isVegetarian": false, "title": "Lobster, tomato and basil spaghetti", "url": "www_bbc_co_uk_food_recipes_lobster_tomato_and_basil_97507", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cooked lobsters", "75g/3oz butter", "1 onion, roughly chopped", "1 carrot, roughly chopped", "4 sprigs fresh thyme", "1 tbsp tomato purée", "75ml/3fl oz white wine", "500ml/18fl oz fish stock ", "salt and freshly ground black pepper", "400g/14oz spaghetti", "6 tbsp olive oil", "2 shallots, finely chopped", "2 garlic cloves, finely chopped", "4 tomatoes, peeled, de-seeded, diced", "salt and freshly ground black pepper", "3 tbsp chopped fresh basil, plus extra small leaves for garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the bisque, cut the cooked lobsters in half lengthways and remove the meat. Roughly chop the lobster meat, except the claw meat, into 2cm/¾in pieces. Reserve the claw meat and lobster shells, and keep everything in the fridge until needed.", "Heat half of the butter in a frying pan until foaming, add the onion, carrot and thyme and cook for 2-3 minutes, or until softened but not coloured.", "Add the reserved lobster shells and tomato purée and cook for a further minute, stirring well.", "Add the white wine and cook until reduced in volume by half.", "Add the fish stock, bring the mixture to the boil, then reduce the heat and simmer for 10 minutes, until the liquid has reduced and thickened a little.", "Take off the heat, and allow to cool slightly, then blend in batches in a food processor to a purée. ", "Strain the puréed bisque through a sieve into a clean saucepan and whisk in the remaining butter.", "Season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the spaghetti, bring a large pan of salted water to the boil, add the spaghetti and cook according to the packet instructions.", "Drain the spaghetti, reserving a little of the cooking water, and set aside.", "Meanwhile, heat the olive oil in a frying pan and add the shallots and garlic and cook for two minutes.", "Add the chopped lobster meat and chopped tomato and heat through.", "Season with salt and freshly ground black pepper then add the basil, spaghetti, reserved cooking water and a couple of ladles of the bisque. Toss together. (Save the remaining lobster bisque for use in other dishes.)", "Heat a frying pan until hot, add the butter and reserved lobster claw meat and cook for 1-2 minutes on each side.", "To serve, pile the spaghetti into serving bowls and top with one lobster claw each and a few basil leaves."]}, {"isVegetarian": false, "title": "Lobster with escargot butter", "url": "www_bbc_co_uk_food_recipes_lobster_with_escargot_84055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz soft butter", "2 tbsp rapeseed oil", "50g/2oz Parma ham, finely chopped", "100g/3½oz button mushrooms, finely chopped", "3 garlic cloves, finely chopped", "100g/3½oz shallots, finely chopped", "100g/3½oz fennel, finely chopped", "1 tbsp finely chopped fresh parsley", "1 tbsp finely chopped fresh tarragon", "1 tbsp Pommery mustard", "1 tbsp dried breadcrumbs", "1 cooked lobster coral", "2 tbsp ground almonds", "2 whole cooked lobster", "50g/2oz butter", "200g/7oz samphire "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the butter into a food processor and blend until it is fluffy and white.", "Heat a large frying pan and add the oil. Once hot add the Parma ham, button mushrooms, garlic, shallots, fennel and herbs and cook for 2-3 minutes. Allow to cool. ", "Add the cooled mixture to the blended butter along with the mustard, breadcrumbs, cooked lobster coral and ground almonds. Mix thoroughly and roll in cling film into a log shape and place in the fridge.", "Blanch the lobster in salted water for 1½ minutes, then cut in half.", "Remove the meat from the claws, knuckles and tails, reserving the body shells in tact. Place the meat back into the half-shell and onto a baking tray.", "Unwrap the herb butter and slice into eight rounds. Place two slices of the butter on each half of lobster. Bake the lobsters in the oven for 4-5 minutes, until hot and bubbling.", "Meanwhile, for the samphire, heat a medium frying pan and add the butter. Once melted add the samphire and cook for a couple of minutes."]}, {"isVegetarian": false, "title": "Lobster with garlic butter, new potatoes and watercress salad", "url": "www_bbc_co_uk_food_recipes_lobster_with_garlic_36735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sea salt", "1 sprig thyme", "6 white peppercorns", "1 bay leaf", "1 lemon ", "4 x 450g/1lb live lobsters", "50g/1¾oz butter", "450g/1lb new potatoes", "salt and freshly ground black pepper", "1 tsp English mustard", "2 tbsp white wine vinegar", "4 tbsp olive oil", "4 tbsp vegetable oil", "4 little gem lettuce, washed and halved", "1 large bunch watercress, washed", "225g/8oz butter", "1 shallot, finely chopped", "4 garlic cloves, crushed", "12 cooked whelks, chopped into small dice", "6 tbsp parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the lobsters in the freezer for two hours to put it into a torpid state. Bring a large pot of water to the boil. Add the salt, thyme, white peppercorns and bay leaf. Cut the lemon in half, squeeze the juice into the pan then add the halves of lemon too. ", "Push the tip of a large, sharp, heavy knife or skewer into the lobsters at the point where a cross forms in the shell on its back, then lower into the boiling water and bring back to the boil. Boil for five minutes, then remove the pan from the heat. Leave the lobsters in the water for another five minutes, then remove from the pan and set aside to cool.", "Gently cook the potatoes in boiling water for 10-15 minutes until tender. Drain and season with salt and pepper.", "Cut the lobsters in half lengthways. Take out the tail meat, cut in half lengthways again and remove the intestinal tract. Take off the claws, removing the meat, leaving the carcass whole and clean. ", "In a frying pan, melt the butter and gently warm through the lobster meat.", "For the garlic butter, melt the butter in a pan over a low heat. Gently fry the shallot and garlic without browning them, then add the whelk meat. When warmed through, add the parsley.", "To finish the salad, mix the mustard and vinegar together in a bowl, then whisk in the oils and season.", "Dress half of the little gems in the serving bowl. Shred the remaining lettuces, mix with the watercress and add to the serving bowl (do not dress until serving).", "When you are ready to serve, put the meat from the claws in the head space of the shells and the tail meat back in the shells.", "Put the lobsters onto plates. Put the potatoes in the middle of the plates, pour the garlic butter over the lobsters and serve with the dressed salad."]}, {"isVegetarian": false, "title": "Lobster with ginger and spring onions", "url": "www_bbc_co_uk_food_recipes_lobster_with_ginger_and_31721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 225g/8oz lobsters", "2 tsp sesame oil", "2cm/1in fresh root ginger, peeled and finely chopped", "8 spring onions, trimmed and chopped", "4 pak choi, leaves separated", "4 tbsp soy sauce", "pinch white pepper ", "pinch caster sugar", "4 tbsp rice vinegar or Shoaxing rice wine ", "100ml/3½fl oz chicken stock  "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Freeze the lobsters for 2 hours prior to cooking. Working quickly, take the first lobster, cut off the head using a sharp knife, then immediately cut the tail down the centre. Remove the flesh from the shell. Repeat with the second lobster. Cut each one into 6–8 pieces. Reserve and clean the shell for serving.", "Heat a wok or sauté pan over a high heat. Add half the sesame oil. Once hot, fry the lobster for 1 minute, then transfer it to a warm plate.", "Add the rest of the sesame oil to the pan. Fry the ginger, half the spring onions and the pak choi until softened. Return the lobster to the pan and stir in the remaining ingredients. Cover with a lid and simmer for 1 minute.", "Fill the shells with the meat. Divide between serving plates and garnish with the reserved spring onions."]}, {"isVegetarian": false, "title": "Lobster with lobster tortellini", "url": "www_bbc_co_uk_food_recipes_lobster_with_lobster_74162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 500g/1lb 2oz lobster ", "150ml/5fl oz white wine, plus a splash", "300ml/11fl oz fish stock", "50g/2oz butter", "85g/3oz scallop meat", "1 free-range egg white", "80ml/3fl oz double cream", "100g/3½oz cooked lobster meat, diced", "pinch chopped fresh herbs ", "1 pack wanton wrappers", "2 free-range egg yolks", "knob of butter", "250g/9oz wild orach (you can use spinach)", "110ml/4fl oz double cream", "handful sea purslane "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the lobster in a large pan of boiling water for 3-4 minutes, then remove the lobster from the pot.", "Remove the claws and return them to the boiling water for an extra minute.", "Heat an ovenproof frying pan, add the lobster, lobster claws and white wine, cover with a circle of greaseproof paper and cook for 1-2 minutes.  Turn the lobster and lobster claws over, then cook for further 1-2 minutes.", "Remove the lobster from the pan and cut the tail into pieces, with the shell still on. Crack the claws and knuckles and remove the meat. Chop the lobster meat and set aside.", "Chop the head and reserved claw shells and return to the pan with the white wine. Add the fish stock, cover with a lid and simmer gently for 5-10 minutes.", "Strain the stock through a sieve, pressing the shells with a ladle to squeeze all the juices out. Return the stock to the heat and bring to a simmer.", "Continue to cook until the volume of the stock has reduced by three-quarters. Whisk in the butter, a splash of wine and season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the lobster tortellini, blend the scallop meat with a good pinch of salt in a blender or food processor until smooth; then add the egg white and blend until smooth. Gradually blend in the cream. ", "Stir in the lobster meat and herbs and leave to chill in the fridge for 15 minutes.", "To make the tortellini, lay a wanton wrapper on a chopping board and place a teaspoon of the lobster mixture in the centre. Brush the edges with the beaten egg and fold over to form a triangle. ", "Cut out a semi-circle using a 10cm/4in round cutter. Wrap the edges of the semi-cirlce around your index finger and join together with a little more beaten egg.", "Repeat with the remaining mixture and wonton wrappers.", "To serve, heat three-quarters of the lobster sauce until boiling and cook the tortellini for 3-4 minutes, or until tender.  Remove with a slotted spoon and set aside, then add the reserved lobster tail pieces to the sauce and warm through.", "Meanwhile, heat the butter in a frying pan and fry the orach (or spinach) for 1-2 minutes, or until wilted. Remove the orach from the pan and set aside. Add the cream to the pan and continue to cook until reduced slightly. Chop the orach, stir it into the cream and season, to taste, with salt and freshly ground black pepper.", "Blend the remaining lobster sauce with a hand blender to create a foam.", "Place the lobster tail onto serving plates and spoon some orach alongside. Sit the tortellini on a small spoon alongside the orach, drizzle over some of the sauce and the foam and sprinkle over the sea purslane.     "]}, {"isVegetarian": false, "title": "Lobster and crab linguine", "url": "www_bbc_co_uk_food_recipes_lobsterandcrablingui_83673", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz dried linguine pasta", "3 tbsp olive oil", "1 red onion, peeled and finely chopped", "1 x 415g/14½oz can of lobster bisque", "1 tbsp brandy or Pernod", "2 ripe tomatoes, seeds removed and finely chopped", "100ml/3½fl oz double cream", "sea salt and freshly ground black pepper ", "2 cloves garlic, chopped", "1 long red chilli, seeds removed and finely chopped ", "2 x 170g/6oz can white crab meat, drained and flaked", "2 tbsp chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta in boiling salted water according to packet instructions, or until just cooked through (al dente).", "While the pasta is cooking, heat one tablespoon of the olive oil in a saucepan.", "Add the onion and cook for about five minutes, until softened, but not browned.", "Pour in the bisque and brandy or Pernod and bring to the boil. Reduce the heat to simmer for 5-6 minutes, or until the liquid has reduced by a third.", "Add the tomatoes, cream and season with salt and pepper. Cook for 3-4 minutes, until the tomatoes have softened. ", "Meanwhile, heat the remaining two tablespoons of olive oil in a frying pan. Add the garlic and chilli and fry for 1-2 minutes, until softened.", "Add the crab meat and toss in the pan until it is heated through. Season with salt and freshly ground black pepper and add the parsley.", "Drain the pasta and add to the lobster sauce.", "To serve, divide the pasta and sauce between four plates or bowls and scatter the chilli crab mixture over the top of each one."]}, {"isVegetarian": false, "title": "Lobster and langoustine with champagne sauce, skinny fries and green beans", "url": "www_bbc_co_uk_food_recipes_lobsterandlangoustin_90597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 750g/1½lb cooked lobsters", "16 langoustines, cooked and peeled", "150ml/10fl oz fish stock", "110ml/4fl oz double cream", "90ml/3½fl oz champagne", "40g/1½oz avruga caviar", "50g/2oz butter", "110g/4oz black trompette mushrooms, cleaned and torn into strips", "salt and freshly ground black pepper", "200g/7oz baby leaf spinach", "4 tbsp Japanese breadcrumbs (available from Asian grocers)", "20g/1oz Gruyère cheese, grated", "vegetable oil, for deep-frying", "2 large baking potatoes, peeled and sliced into ½cm strips", "salt and freshly ground black pepper ", "200g/7oz French beans, trimmed", "75g/3oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "For the lobster, slice the lobster in half and remove the meat from the claws and tail. Set aside with the langoustines. Remove any head matter and discard,  reserving the shells.", "Place the fish stock into a pan and bring to the boil. Cook for 10-15 minutes, or until the liquid is reduced by half, then add the cream and simmer for a further 10-15 minutes, or until reduced again by half. ", "Add the champagne and cook for 2-3 minutes, stirring well, then stir in the caviar, lobster and langoustines to heat through. ", "Meanwhile, melt half of the butter in a frying pan and add the mushrooms. Fry for 2-3 minutes, or until just softened. Season, to taste, with salt and freshly ground black pepper.", "Heat the remaining butter in a clean frying pan, then add the spinach and cook for 1-2 minutes, or until wilted. ", "Spoon a little spinach into the bottom of each lobster shell, followed by the mushrooms, finishing with the lobster and langoustine mixture. Sprinkle over the breadcrumbs and grated Gruyère. Place on a grill tray set under the grill and cook for 2-3 minutes, or until the topping is golden-brown and bubbling. ", "For the vegetables, heat a deep-fat fryer to 190C/375F. Alternatively, half-fill a deep, thick-based pan with the vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended).", "Fry the potato strips in the oil for 4-5 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper, then season with salt. ", "Bring a saucepan of salted water to the boil, add the beans and cook for 3-4 minutes, or until tender. Drain, return to the pan and mix with the butter and season with salt and freshly ground black pepper.", "To serve, place the lobster halves on two serving plates, and place the fries and green beans alongside."]}, {"isVegetarian": false, "title": "Lobster, chilli and tomato linguine", "url": "www_bbc_co_uk_food_recipes_lobsterchilliandtoma_85708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 garlic cloves, chopped", "1 green chilli, chopped", "200g/7oz baby plum tomatoes, halved", "1 tbsp chopped fresh flatleaf parsley ", "100ml/3½fl oz white wine", "1 cooked lobster tail, chopped", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper ", "250g/9oz linguine, cooked according to packet instructions and drained", "lime wedges, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan, add the garlic and chilli and fry over a low heat for 1-2 minutes.", "Add the tomatoes, parsley and wine and simmer for 3-4 minutes. Add the lobster and cook for two minutes. Stir in the chives and season well with salt and freshly ground black pepper.", "Add the cooked linguine to the pan and stir to coat.", "To serve, place the linguine into two serving dishes and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Lobster roll with Thousand Island dressing", "url": "www_bbc_co_uk_food_recipes_lobsterrollwiththous_86520", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1kg/2lb 2oz native lobster  (Dorset blue if possible), cooked, flesh removed and broken into chunks", "2 large free-range egg yolks ", "1 tsp white wine vinegar", "½ tsp powdered mustard", "1 tsp salt ", "275ml/10fl oz rape seed oil ", "freshly ground black pepper, to taste", "2 tbsp tomato ketchup", "1 tsp Worcestershire sauce", "1 tbsp brandy", "¼ tsp cayenne pepper", "½ lemon, juice only", "1 red pepper, finely diced", "1 yellow pepper, finely diced", "2 tbsp chives, roughly chopped", "1 dill pickle, finely diced", "1 punnet mustard cress", "2 large brioche rolls"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the mayonnaise, place the egg yolks, vinegar, mustard and salt into a food processor.", "Blend to combine, then, with the motor still running, gradually add the rape seed oil. Continue until all the oil has been added and the mayonnaise has thickened.", "Season with black pepper and a little more salt if necessary, to taste.", "For the dressing, place the mayonnaise and all the other dressing ingredients into a bowl and mix to combine.", "Add the lobster and stir gently.", "To serve, split the rolls in half and spoon the lobster salad inside it. Top with mustard cress and serve."]}, {"isVegetarian": false, "title": "Lobster thermidor", "url": "www_bbc_co_uk_food_recipes_lobsterthermidor_73972", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lobsterthermidor_73972_16x9.jpg", "ingredients": ["1x750g/1½lb lobster, cooked", "20g/¾oz fresh parmesan, grated", "25g/1oz butter", "1 shallot, finely chopped", "275ml/10fl oz fish stock", "55ml/2fl oz white wine", "110ml/4fl oz double cream", "½ tsp English mustard", "2 tbsp chopped parsley", "½ lemon, juice only", "salt and freshly ground black pepper", "2 large floury potatoes, cut into 1.5cm/½in thick long chips", "vegetable oil, for deep-frying"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium heat.", "Cut the lobster in half and remove the meat from the claws, tail and head. Set aside. Chop the meat into pieces and place back into the shell.", "To make the sauce, place the butter into a pan over a medium heat. Add the shallots and cook until softened. Pour in the stock, wine and double cream and bring to the boil. Reduce by half, stirring occationally. Add the mustard, herbs, lemon juice and season to taste.", "Spoon the sauce over the lobster meat. Sprinkle with Parmesan. Grill for 3–4 minutes until golden brown.", "To make the chips, heat the vegetable oil in a deep-fat fryer to 140C (CAUTION: Hot oil is very dangerous. Do not leave unattended). Carefully drop in the chips and cook for 5–6 minutes or until just tender, without colour. Remove using a metal slotted spoon. Turn the heat to 190C. Place the chips back into the hot oil and fry for 3–4 minutes or until golden and cooked through. Remove using a metal slotted spoon and drain on kitchen paper. Season to taste and serve alongside the lobster."]}, {"isVegetarian": false, "title": "Chicken breast with asparagus, broad beans, wild mushrooms and a Somerset cider brandy sauce", "url": "www_bbc_co_uk_food_recipes_localarkchickenbreas_81704", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz shallots, sliced ", "2 cloves garlic, peeled ", "200g/7oz unsalted butter", "5 sprigs thyme ", "1 bay leaf", "50ml/2fl oz Somerset cider brandy, or other similar cider brandy ", "500ml/17fl oz chicken stock", "50ml/2fl oz double cream ", "salt and freshly ground black pepper", "4 free-range chicken breasts, each 200g/7oz ", "salt and freshly ground black pepper", "12 asparagus tips", "100g/3½oz shelled broad beans ", "unsalted butter", "200g/7oz mixed wild mushrooms ", "200g/7oz baby spinach leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["First make the sauce. Sweat the shallots and garlic in 25g/1oz of the butter, without colouring. Add the thyme and bay leaf and sweat for a further 2 minutes, then add the brandy and reduce until the liquid has almost disappeared. ", "Add the chicken stock and cook to reduce by half, then add the cream. Whisk in the remaining butter. Season with salt and freshly ground black pepper and set aside.", "For the chicken, season the chicken breasts with salt and freshly ground black pepper, then wrap them individually in cling film to help retain their shape. ", "Heat a saucepan of water until just boiling and poach the wrapped chicken breasts for 12-15 minutes or until cooked. Remove and leave to rest for 10 minutes.", "Cook the asparagus and broad beans separately in boiling salted water until tender; drain and refresh in iced water. Cut all the asparagus tips to the same length and peel the broad beans to remove their tough skins.", "Unwrap the chicken breasts. Heat a knob of butter in a frying pan, add the chicken and slowly colour the skin until golden and crisp. ", "Meanwhile, fry the mushrooms in a little butter with salt and freshly ground black pepper. Add the mushrooms to the sauce together with the asparagus and broad beans and reheat. Quickly fry the spinach with a little butter, salt and freshly ground black pepper, then drain on a tray lined with kitchen paper. ", "To serve, slice each chicken breast into five rounds and arrange around warm plates. Place the spinach in the middle. Add three asparagus tips to each plate, then spoon around the mushrooms and broad beans with some sauce."]}, {"isVegetarian": false, "title": "Lobster with cheese sauce", "url": "www_bbc_co_uk_food_recipes_lobsterwithcheesesau_83810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter ", "40g/1½oz plain flour ", "600ml/20fl oz/1 pint milk, warmed ", "110g/4oz Cheddar or Cheshire cheese, grated ", "1 tsp mustard  ", "pinch cayenne pepper ", "salt", "1 large cooked lobster"], "serves": "2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan over a low heat. Add the flour and stir until the mixture forms a smooth paste which leaves the sides of the pan cleanly. Cook for two to three minutes until the butter and flour make a floury ball.", "Remove from the heat and gradually add the milk, stirring constantly to avoid lumps. ", "Bring to the boil, still stirring, and simmer for about five minutes, stirring occasionally.", "When smooth and creamy, stir in the grated cheese a little at a time until melted. If the sauce is too thick, add a little extra milk. ", "Preheat the grill to hot.", "Add the mustard, cayenne pepper and salt to the cheese sauce.", "Cut the lobster horizontally down the middle. Place on a baking tray and liberally pour the cheese sauce over both halves. ", "Cook the lobster under the grill until the cheese is golden and bubbling."]}, {"isVegetarian": false, "title": "Pork loin with scrumpy sauce, candied walnuts and cabbage", "url": "www_bbc_co_uk_food_recipes_loin_of_pork_with_00990", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loin_of_pork_with_00990_16x9.jpg", "ingredients": ["25g/1oz unsalted butter", "4 bramley apples, peeled and cut into chunks", "50g/1¾oz caster sugar", "200ml/7fl oz scrumpy cider", "100g/3½oz caster sugar", "100g/3½oz walnut halves", "rapeseed oil, for shallow frying", "200g/7oz black pudding", "50g/1¾oz plain flour", "2 free-range eggs, beaten", "50g/1¾oz panko breadcrumbs", "rapeseed oil, for deep frying", "1 kg/2lb 4oz bone-in pork loin, French trimmed, cut into four thick chops", "salt and freshly ground black pepper", "25g/1oz unsalted butter", "1 hispi cabbage, sliced thickly", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the apple scrumpy sauce, heat the butter in a saucepan. Add the apples, sugar and the scrumpy cider. Bring to a simmer over a gentle heat and cook until the apples are very soft. Add a little more cider or water if the mixture becomes too dry. Stir from time to time.", "Next make the candied walnuts. Make a syrup by heating the sugar with 100ml/3½fl oz water until the sugar is dissolved. Bring to the boil and add the walnut halves. Remove from the heat and set aside to cool.", "For the crisp black pudding, cut the pudding into 2½cm/1in chunks. Dust the pieces in flour, dip in the beaten egg and coat with panko breadcrumbs. Store in the fridge until ready to cook.", "For the pork, season the pork chops with salt and pepper. Heat a dry non-stick pan over a medium heat until hot. Place the chops in the pan to render down the fat (this needs to be done gently so that the fat becomes brown and crisp). Turn over and cook in the same way as before. When the pork is cooked (approximately 10 minutes), remove from the pan and set aside to rest in a warm place until ready to serve.", "For the candied walnuts, drain the walnuts and discard the syrup.", "In a deep frying pan or sauté pan, heat the rapeseed oil until hot. Shallow fry the walnuts until crisp (approximately 30 seconds), then drain on kitchen paper. Repeat the process with the black pudding. Set aside to drain on kitchen paper.", "For the cabbage, heat the butter with 50ml/2fl oz water to make an emulsion. Add the cabbage, cover with a lid and steam for 2-3 minutes. Season with salt and pepper.", "To serve, place a pork chop on each plate with a spoonful of apple sauce, some candied walnuts, crisp black pudding and hispi cabbage. Drizzle over any cooking juices from the pan the pork chops were cooked in."]}, {"isVegetarian": false, "title": "Loin of roe deer on brioche with chanterelles and elderberry jus", "url": "www_bbc_co_uk_food_recipes_loin_of_roe_deer_on_08600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 loin of venison, sinew and skin removed", "2 tbsp olive oil", "50g/2oz butter", "500ml/18fl oz venison jus", "1 brioche loaf, sliced", "1 tbsp hazelnut oil", "1 shallot, finely chopped", "small handful chanterelle mushrooms", "2 sprigs fresh tarragon", "2 sprigs elderberries, berries removed", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a heavy-based frying pan over a high heat and add the olive oil and butter. Add the venison to the pan and fry, turning regularly, until browned all over.", "Place the meat onto a trivet in a roasting tin and roast in the oven for about five minutes. Remove from the oven and set aside in a warm place to rest.", "Meanwhile, heat another frying pan over a medium heat, add the hazelnut oil followed by the finely chopped shallot and fry until the shallot is softened but not coloured. ", "Increase the heat (add a splash more hazelnut oil if necessary) and when the pan is hot, add in the chanterelles and tarragon and fry for 1-2 minutes.  Remove the pan from the heat, season with salt and freshly ground black pepper.", "Meanwhile, reheat the venison jus until piping hot, check the seasoning and add the elderberries. Toast the brioche slices.", "Place a slice of toasted brioche onto each plate, carve the venison and place onto the brioche. Spoon over the jus and then generously scatter over the chanterelles."]}, {"isVegetarian": false, "title": "Loin of venison in a sloe gin and blackberry glaze", "url": "www_bbc_co_uk_food_recipes_loin_of_venison_in_a_52978", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loin_of_venison_in_a_52978_16x9.jpg", "ingredients": ["1 kg/2lb 2oz venison loin, fat trimmed ", "1 tbsp olive oil", "1 tsp dried thyme", "250g/9oz pancetta, thinly sliced", "1 tbsp vegetable oil", "2 tbsp sloe gin", "200ml/7fl oz reduced beef stock", "6 juniper berries, crushed", "200g/7oz blackberries", "knob of butter", "salt and freshly-ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Trim the venison of any remaining fat or sinew and wipe clean with kitchen paper or a clean tea towl. Rub with the olive oil, season with salt and freshly ground black pepper and rub in the dried thyme. Set aside.", "Lay the pancetta slices on a piece of cling film to make one long sheet of pancetta. Place the loin on one end of the pancetta sheet and roll up to wrap the loin. Remove the cling film.  ", "Heat the vegetable oil in an ovenproof frying pan. Sear the loin on all sides until the pancetta is turning golden-brown.", "Place the pan in the oven for 6-8 minutes, or until the venison is cooked, but still pink inside (alternatively cook for longer if you prefer your meat less pink). Remove the meat from the pan and set aside.", "Pour the sloe gin into the pan used for the venison and cook until most of the liquid has been absorbed. Add the beef stock and juniper berries and simmer for about 5 minutes until the volume of stock has reduced slightly.", "Strain the sauce and return it to the pan, then add the blackberries. Cook for about 4 minutes or until the blackberries are softened, then crush them slightly.  ", "Add the butter to the sauce and season with salt and freshly ground black pepper.  ", "Cut the loin into thick slices, discarding the beginning and end bits.  ", "Serve about 3 slices per person with the sloe and blackberry glaze.  "]}, {"isVegetarian": false, "title": "Loin of pork with braised artichokes and courgettes with thyme and lemon zest", "url": "www_bbc_co_uk_food_recipes_loinofporkwithbraise_89306", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["180g/6oz organic pork loin, trimmed", "1 lemon, zest only", "1 small bunch fresh thyme, leaves only, chopped", "salt and freshly ground black pepper", "3 tbsp extra virgin olive oil, plus extra for drizzling", "3 small violet artichokes, quartered", "3 small courgettes", "1 garlic clove, finely chopped", "1 punnet micro cress (you can substitute normal cress)"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pork loin into four equal-sized pieces. Lay the pieces between two pieces of cling film and bash with a meat mallet or rolling pin until very thin. ", "Lay the flattened pork pieces onto a plate and sprinkle with half of the lemon zest and half of the chopped thyme. Season well with salt and freshly ground black pepper.", "Heat two tablespoons of the olive oil in a frying pan over a low heat. Add the artichoke quarters and fry, turning occasionally.", "Chop the courgettes to the same size as the artichoke pieces and add to the pan when the artichokes are just beginning to become golden-brown and tender. ", "Add the garlic and the remaining lemon zest, thyme leaves and a splash of water. Stir gently and add one more tablespoon of the olive oil. Season, to taste, with salt and freshly ground black pepper. Remove from the heat and set aside in a warm place.", "Meanwhile, heat a griddle pan until smoking. Add the flattened pieces of pork loin (you may have to do these in batches). Cook for 1-2 minutes on each side, or until golden-brown griddle marks are formed on both sides and the pork is cooked through.", "To serve, place a piece of pork loin onto a serving plate and arrange some of the artichokes and courgettes on top. Place another pork piece over the top, then add another layer of vegetables. Repeat this layering until all of the pork pieces are used up. Snip some micro cress around the plate and finish with a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Loin of venison en croute with buttered Savoy cabbage", "url": "www_bbc_co_uk_food_recipes_loinofvenisonencrout_92734", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fennel bulb, roughly chopped", "250g/9oz field mushrooms, roughly chopped", "1 onion, peeled, roughly chopped", "50g/2oz butter", "salt and freshly ground black pepper ", "150ml/5fl oz double cream", "110g/4oz plain flour", "½ tsp sugar", "salt and freshly ground black pepper ", "350ml/12¼fl oz full-fat milk", "1 free-range egg, beaten", "1 tbsp butter, melted", "3 tbsp chopped fresh parsley", "3 tbsp vegetable oil", "25g/1oz butter", "450g/16oz loin of venison, trimmed", "275g/9¾oz ready-made puff pastry", "flour, for dusting", "1 free-range egg, beaten", "1 Savoy cabbage", "50g/2oz butter", "1 tbsp chopped fresh sage", "500ml/17fl oz beef stock, simmered in a pan until the volume of liquid has reduced to 100ml/3½fl oz, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the fennel and mushroom duxelles, blend the fennel, mushrooms and onion in a food processor to a paste.", "Heat a pan over a low to medium heat, then add the butter. When the butter is foaming, add the fennel and mushroom paste and cook until all of the moisture has evaporated from the paste. Season, to taste, with salt and freshly ground black pepper.", "Stir in the cream, then continue to cook the paste until heated through and well combined.", "For the parsley pancakes, sift the flour into a large glass bowl. Add the sugar. Season, to taste, with salt and freshly ground black pepper.", "Make a well in the centre of the flour and sugar mixture. Gradually add the milk and beaten egg, a little at a time, whisking well after each addition until all of the liquid has been incorporated into the batter before adding the next. ", "Cover the pancake batter with cling film, then chill in the fridge for 30 minutes.", "When the pancake batter has chilled, stir in the melted butter and chopped parsley.", "Heat one tablespoon of the oil in a frying pan over a high heat. When the oil is smoking, add a ladleful of the chilled pancake batter, then swirl the pan until it covers the bottom of the pan evenly. Fry for 30 seconds, then flip over and continue to cook for a further 30 seconds. Set aside on a plate and cover with a sheet of greaseproof paper. Keep warm.", "Repeat the process until all of the pancake batter has been used up (you should get three pancakes from this mixture). Separate each pancake with greaseproof paper and keep the pancakes warm.", "For the venison en croûte, line a baking tray with greaseproof paper.", "Heat a frying pan over a medium to high heat, then add the butter. When the butter is foaming, fry the venison loin on all sides until browned all over. Remove the venison loins from the pan and set aside to rest on a plate.", "Roll out the puff pastry onto a lightly floured work surface to a 25cm x 30cm/10in x 12in rectangle. ", "Lay the three pancakes on top of the pastry rectangle to cover the pastry. Spread three tablespoons of the duxelles mixture onto the pancakes.", "Place the seared venison into the centre of the pancakes. Spread the remaining duxelles mixture all over the top of the venison loin.", "Fold the pancakes as tightly as possible around the venison (do not allow the duxelles mixture to seep out).", "Brush the edges of the pastry with some of the beaten egg, then wrap the pastry around the venison and pancakes, overlapping the edges and folding to seal. Brush the outside of the pastry with more of the beaten egg.", "Transfer the venison parcel to the prepared baking tray, then chill in the fridge for 30 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "When the venison parcel has chilled, brush all over again with the remaining beaten egg. Bake in the oven for 15-20 minutes, or until the pastry has risen and is golden-brown (the venison will be cooked to medium after 15-20 minutes). Remove from the oven and set aside to rest for five minutes.", "For the buttered Savoy cabbage, blanch the cabbage leaves in a pan of boiling, salted water for 3-4 minutes, or until just tender. Drain well, then refresh in cold water. Drain again and squeeze the leaves dry. Slice the blanched leaves into strips.", "Heat the butter in a frying pan over a medium heat. Add the blanched cabbage leaves and fry for 3-4 minutes, or until coated in the melted butter. Just before serving, stir in the sage until well combined.", "While the venison is cooking, reduce the beef stock in a pan over a medium heat, until the volume of liquid has reduced to 100ml/3½fl oz. Keep warm.", "To serve, slice the venison en croûte into four slices, each approximately 0.75cm/1½in thick. Place one slice into the centre of each serving plate. Serve the buttered cabbage alongside. Drizzle over the reduced beef stock."]}, {"isVegetarian": true, "title": "Lokanta stew", "url": "www_bbc_co_uk_food_recipes_lokanta_stew_91668", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lokanta_stew_91668_16x9.jpg", "ingredients": ["1 large onion, roughly chopped", "6 peppers, assorted red and yellow, deseeded and quartered", "400g/14oz tomatoes assorted sizes and colours", "20 thyme sprigs", "8 tbsp olive oil", "2 x 400g tins butter beans", "2 tsp ground allspice ", "350g/12oz green beans", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan /Gas 6.", "Transfer the onion and other vegetables to a roasting tin with the whole thyme sprigs and trickle over the olive oil. Roast the vegetables for 1 hour.", "Add the butter beans and ground allspice to the roasting tray and mix well, making sure that any dry parts are well coated in olive oil. Bake for a further 30 minutes.", "Cut the stem ends off the green beans. Cook in a pan of boiling salted water for 4 minutes. Remove and refresh in a bowl of iced water.", "Fold the green beans into the roasted vegetables. Season with salt and pepper and serve."]}, {"isVegetarian": false, "title": "Lollipop chicken with honey and sesame seeds", "url": "www_bbc_co_uk_food_recipes_lollipopchickenwithh_89019", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz chicken breast, cut into strips", "2 tbsp olive oil", "2 tbsp honey", "1 tbsp sesame seeds, toasted", "1 small handful fresh parsley leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak two wooden skewers in a bowl of cold water for ten minutes. ", "Thread the chicken onto the skewers and drizzle over half of the olive oil. ", "Heat a griddle pan until smoking and cook the chicken skewers for 4-5 minutes on both sides, or until golden-brown and cooked through. Drizzle over the honey and sprinkle over the sesame seeds. ", "To serve, place the chicken skewers onto a serving plate. Toss the parsley leaves with the remaining olive oil and drizzle on the plate next to the chicken skewers."]}, {"isVegetarian": false, "title": "Lomo saltado with chips", "url": "www_bbc_co_uk_food_recipes_lomo_saltado_with_chips_31800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 garlic cloves, chopped", "150ml/5fl oz soy sauce", "2 tbsp red wine vinegar ", "2 tsp worcestershire sauce", "½ tsp dried oregano ", "½ tsp ground cumin", "sea salt and freshly ground black pepper", "600g/1lb 5oz fillet steak, cut into 3cm/1¼in cubes", "vegetable oil, for frying", "1 large red onion, cut into thick wedges", "2 tomatoes, halves, seeds removed and cut into eighths", "1 amarillo chilli, seeds removed and sliced lengthways", "2 tsp pisco", "25g/1oz fresh coriander, finely chopped", "10g/¼oz fresh flat-leaf parsley, finely chopped", "600g/1lb 5oz chipping potatoes, peeled, cut into chips", "sunflower oil, for deep frying"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, mix all the ingredients together in a bowl with two tablespoons of water until well combined. ", "Add the meat to the bowl and mix so that it is well covered in the marinade.  Cover with cling film and leave to marinate in the fridge for about four hours.", "Rinse the chips in a colander under plenty of cold water to remove excess starch. Pat dry with kitchen paper. ", "Heat a deep, heavy-bottomed saucepan or deep-fat fryer half-full of sunflower oil to 130C/275F. Add the potatoes to the deep-fat fryer and fry for 10 minutes, or until softened. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. ", "When ready to serve, reheat the oil to 190C/375F. With a slotted spoon, lower all the par-cooked chips gently into the pan and cook for 4-5 minutes, or until crisp and golden-brown. Remove from the pan with a slotted spoon and drain on kitchen paper. Season with a little salt and keep warm while you cook the steak.", "Drain the meat, reserving the marinade. Heat the vegetable oil in a wok over high heat until just smoking and add the meat to the wok- be careful, it might splutter at you. Cook as quickly as possible, tossing it until the meat is browned on all sides.", "Add the red onion wedges and cook for one minute. Add the tomato and chilli and immediately pour in the pisco.", "Pour over the reserved marinade and bring to a simmer. Turn off the heat and leave the meat to rest in the sauce for a couple of minutes.", "Place the steak on one side and the chips on another and garnish with chopped coriander and parsley."]}, {"isVegetarian": true, "title": "Long Island iced tea", "url": "www_bbc_co_uk_food_recipes_long_island_iced_tea_42582", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/long_island_iced_tea_42582_16x9.jpg", "ingredients": ["15ml/½fl oz vodka", "15ml/½fl oz gin", "15ml/½fl oz  light rum", "15ml/½fl oz orange liqueur", "15ml/½fl oz fresh lemon juice", "15ml/½fl oz freshly squeezed orange juice", "1 tsp sugar syrup", "cola, to top up", "lemon wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a cocktail shaker with a handful of ice and shake hard. ", "Strain the cocktail into a highball glass, top up with cola and garnish with a lemon wedge. "]}, {"isVegetarian": true, "title": "London Underground novelty cake", "url": "www_bbc_co_uk_food_recipes_london_underground_52779", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["525g/1lb 3oz unsalted butter, softened", "525g/1lb 3oz caster sugar", "9 free-range eggs, lightly beaten", "2½ tbsp buttermilk", "3 lemons, finely grated zest ", "550g/1lb 4oz self-raising flour, sifted", "1-2 tbsp milk", "2 lemons, zest and juice", "100g/3½oz caster sugar", "100g/3½oz unsalted butter, softened", "100g/3½oz icing sugar, sifted", "100g/3½oz strawberry conserve", "icing sugar, for dusting ", "675g/1lb 8oz red ready-to-roll fondant icing", "250g/9oz white ready-to-roll fondant icing", "675g/1lb 8oz blue ready-to-roll fondant icing"], "serves": "Serves 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line two 20cm/8in round cake tins and one 8x21cm/3¼x8¼in loaf tin.", "In a large mixing bowl, cream together the butter and sugar with an electric handheld mixer until pale and fluffy. ", "Combine the beaten eggs and the buttermilk in another bowl.  Beat this into the creamed butter a third at a time, beating well after each addition. Stir in the grated lemon zest.", "Fold in the sifted self-raising flour with a large metal spoon until it is all incorporated. If the mixture is too stiff, loosen it with a little milk until the mixture just drops slowly off the spoon.", "Spoon one-third of the cake batter into each tin (you may need to weigh the round cakes to get them even in size). ", "Bake for 35-40 minutes, checking the cakes after 30 minutes. The cakes are ready when they are golden-brown and risen, and a skewer inserted into the cake should come out clean.", "Meanwhile, for the syrup, combine all the ingredients in a saucepan and gently bring to the boil, stirring frequently until the sugar dissolves. Set aside to cool, then strain before using.", "Remove the cakes from the oven and cool the cakes in the tins for ten minutes before turning out onto a wire rack. With a cocktail stick or skewer, poke little holes all over the cakes and brush over the syrup. This will keep the cakes moist and add more flavour. Let the cakes cool completely before icing.", "For the buttercream, cream the softened butter in  a bowl using a handheld electric mixer. Add the icing sugar a third at a time, beating well between additions. Set aside.", "To assemble the cake, prepare the round cakes by slicing off any roundness on the tops to give a flat finish. ", "Spread one of the round layers with strawberry conserve. Spread half of the buttercream on top of the jam and top with the other round cake layer. ", "Find a picture of the London Underground logo to follow for the design. On a surface dusted heavily with icing sugar, roll out the red fondant icing to a thickness of 3mm. Use rolling pin to roll up the icing and lift and drape over the round cake. Use a smoother (or clean, very dry hands) to ease the icing down the sides of the cake. Trim off the excess.", "Sprinkle more icing sugar on the work surface, if needed, and roll out the white icing to a thickness of 3mm. Using a template, cut out a 18cm/7in circle. Brush the top of the red icing covered cake with a very little water, then place the white circle on the top.", "Cut the round cake into three pieces across, creating a 7cm/2¾in wide slice from the middle of the cake. Lift this slice out and remove the icing. Trim the rounded end so that it is straight and squared off. ", "Prepare the loaf cake by trimming down to a rectangle 7cm/2¾in wide and 13cm/5in long. Slice this piece in half horizontally and fill the middle with jam and buttercream as before, reserving one large spoonful of the buttercream. You may need to trim the top and bottom so it is the same height as the slice you have just lifted from the round cake.", "Stick the two rectangles together with remaining buttercream. Trim the ends so that the piece is 30cm/12in long. ", "Roll out the blue icing on the sugar dusted surface to a thickness of 3mm in a long rectangle shape. Use the rolling pin to roll up the blue icing and drape it over the rectangle. Use a smoother to ease the icing down the sides and smooth out any wrinkles. Trim off any excess.", "Arrange the three cakes onto a presentation board, with the blue rectangle in the centre to create the shape of the London Underground logo. ", "Roll out the remaining white fondant icing and cut the letters out with small alphabet cutters (or by hand) to spell out your favourite tube station. Brush the blue icing very lightly with water to stick the letters on."]}, {"isVegetarian": false, "title": "Lotus leaf wraps (Lo mai gai)", "url": "www_bbc_co_uk_food_recipes_lotus_leaf_wraps_lo_mai_65211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz glutinous rice (sticky rice), covered in water and soaked for one hour, then drained", "4 Chinese dried black mushrooms", "200g/7oz skinless boneless chicken thighs", "100g/3½oz pork loin, chopped into small pieces ", "¼ tsp salt", "2 tbsp vegetable oil ", "1 garlic clove, chopped", "2 Chinese sausages (lap cheong), or alternatively sweet cured bacon, chopped", "2 tbsp Chinese rice wine (or dry sherry)", "1 tbsp light soy sauce", "1 tsp dark soy sauce", "1½ tsp cornflour", "¼ tsp sesame oil", "freshly ground black or white pepper, to taste", "4 lotus leaves, cut in half"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Line a bamboo steamer with parchment paper perforated with holes (or a banana leaf or cabbage leaf). Fill a wok approximately half-way with water so that the steamer will be sitting above the water without touching. Bring the water to a boil, cover the rice and steam for about 20 minutes. Remove the rice, cover and keep warm while preparing the rest of the ingredients. ", "Soften the dried mushrooms by soaking in a bowl of hot water for 20-30 minutes. Squeeze out any excess water, remove the stems and finely chop. ", "Cut the chicken into small cubes about the size of a postage stamp. Season the chicken and pork with salt.", "Heat a wok and add the oil for frying. When the oil is hot, add the garlic and stir fry until aromatic (about 30 seconds). Add the chicken cubes and pork. Stir fry until they turn white and are 80 percent cooked through.", "Add the sausages and the drained mushrooms. Stir fry for another minute.", "In a small bowl, combine the rice wine with the light soy and dark soy sauce. In a separate small bowl, dissolve the cornflour in one tablespoon of water, and whisk it into the sauce.", "Give the sauce mixture a quick re-stir and then add it to the wok, stirring quickly to thicken. Season with pepper, to taste. Cook for 1-2 more minutes to mix everything together and heat through. Remove from the heat and stir in the sesame oil. Leave to cool.", "To make the wraps, separate the rice and the filling into eight equal sections, one section for each wrap. Lay out a lotus leaf in front of you. Place a portion of the rice mixture into the centre of a lotus leaf. Add the meat and vegetable mixture over the top, shaping the rice with your hands so that it forms a ring around the filling. Add more rice to cover. ", "Form a square parcel with the lotus leaf and tie it up with kitchen string. Repeat with the remaining lotus leaves.", "Steam the lotus leaf parcels, covered, on a heatproof plate in a bamboo steamer for 15 minutes, or until they are cooked through. Serve at once."]}, {"isVegetarian": false, "title": "Louisiana crab cakes with grilled sweetcorn and mango salsa", "url": "www_bbc_co_uk_food_recipes_louisiana_crab_cakes_89340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz fresh white crabmeat", "200g/7oz mashed potato", "1 red pepper, finely diced", "1 green pepper, finely diced", "4 spring onions, finely chopped", "1 fresh red chilli, finely chopped", "110g/3¾oz plain flour", "2 medium free-range eggs, beaten", "110g/3¾oz panko breadcrumbs", "2 tbsp vegetable oil", "2 corn on the cob", "1 mango, finely diced", "1 bunch spring onions, finely sliced", "½ cucumber, finely diced", "1 red chilli, finely chopped", "1 lime, juice only", "1 tbsp roughly chopped fresh coriander", "1 lime, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the crabmeat, potato, peppers, spring onions and red chilli in a large bowl, season with salt and pepper and mix well.", "Shape the crab mixture into thick patties using wet hands. Lay on a plate and place in the fridge for at least 30 minutes to firm up. ", "Place the flour, eggs and breadcrumbs into three separate wide shallow bowls. Once the crab cakes have rested, dredge them in the flour, then dip them in the egg and finally coat in the panko crumbs. Return them to the plate to rest in the fridge until you are ready to serve.", "Preheat the oven to 200C/400F/Gas 6.", "For the salsa, heat a griddle pan and place the corn on the griddle for 8-10 minutes, turning around until charred all over.  Set aside.", "Once the corn is cooked, remove it from the griddle and set aside to cool.", "When the corn is cool enough to handle, remove the kernels using a sharp knife and add to a medium bowl. Add the rest of the salsa ingredients and mix. Set aside.", "Heat a large frying pan and add the oil. Once hot, add the crab cakes and cook on each side for 3-4 minutes, or until crisp and golden-brown. Place onto a baking tray in the oven for five minutes.", "To serve place the salsa in the centre of the plate and put two crab cakes on top. Top with a wedge of lime."]}, {"isVegetarian": false, "title": "Love cake", "url": "www_bbc_co_uk_food_recipes_love_cake_99793", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/love_cake_99793_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "1 tsp cornflour", "½ tsp salt", "15g/½oz lard", "15g/½oz butter", "2 tbsp caster sugar", "175ml/6fl oz milk, plus extra for glazing", "2-3 tbsp strawberry jam"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6", "Mix together the flour, cornflour and salt. Using your fingertips rub in the lard and butter until the mixture has the texture of breadcrumbs. ", "Stir in the sugar then gradually add the milk until a soft dough is formed. You may not need to use all the milk.", "Lightly knead the dough on a floured surface until a smooth dough is formed (this won’t take long).  ", "Roll out the dough to a rectangle measuring 50x20cm/20x8in.  Spread the jam over the dough.", "Roll the dough from the longest side as if rolling a Swiss roll. Bring the ends together and stick them together using a little milk. Shape the ring into a heart shape.", "Make small incisions over the surface of the heart shape. Brush the top with milk. ", "Bake for 15-20 minutes until golden-brown and the base is cooked through."]}, {"isVegetarian": false, "title": "Love in a transit (coq au vin)", "url": "www_bbc_co_uk_food_recipes_love_in_a_transit_coq_au_25368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 tbsp sunflower or olive oil", "1 x 1.8kg/4lb chicken, jointed into eight portions ", "125g/4½oz unsmoked rindless streaky bacon, cut into 2cm/¾in slices", "1 medium onion, finely chopped", "2 large garlic cloves, finely chopped", "50ml/2fl oz brandy", "1 x 75cl bottle red wine", "1 x 400g tin chopped tomatoes", "2 bay leaves", "2-3 sprigs fresh thyme ", "16 small shallots", "200g/7oz baby button mushrooms", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Heat 1 tablespoon oil in a large non-stick frying pan set over a medium-high heat. Season the chicken on all sides with salt and pepper and add to the pan. Cook until deep golden brown, turning once. You might need to do this in 2 or 3 batches, depending on the size of your pan. Transfer to a large, flameproof casserole. Return the pan to the heat. Add the bacon and fry for 2-3 minutes, or until beginning to crisp. Scatter on top of the chicken. ", "Add the onion to the pan and cook over a low heat for 4-5 minutes until golden-brown, adding the garlic for the last minute or so and stirring often. Tip the onion and garlic into the casserole with the chicken pieces.", "Deglaze the pan with the brandy, stirring well to remove as much of the tasty sediment from the bottom of the pan as possible. Add half the red wine and bubble for a few seconds more. Pour the remaining wine and the hot brandy and wine mixture over the chicken. Add the tomatoes, bay leaves and thyme. Bring to a gentle simmer and cover loosely with a lid. Cook for 30 minutes over a low heat. ", "Meanwhile, put the shallots in a large, heatproof bowl and cover with just-boiled water. Leave to stand for 5 minutes then drain away the water. When the shallots are cool enough to handle, peel off the skins leaving a tiny part of the root intact to help hold them together.", "Heat the remaining oil in a clean frying pan and fry the shallots over a medium heat until lightly browned, stirring occasionally. Drop the mushrooms into the same pan and cook with the shallots for a couple of minutes until golden-brown. Stir the shallots and mushrooms into the casserole after the chicken has been cooking for 30 minutes. Cover loosely once more and simmer gently for a further 30-45 minutes, or until the chicken is tender and the onions are softened. ", "Using a large slotted spoon, transfer the chicken, bacon, vegetables and mushrooms to a large bowl. Return the sauce to the heat and bring to the boil. Cook for 4-5 minutes, or until the sauce is thickened, stirring regularly. When the sauce has reduced enough to coat the back of a spoon, return the chicken to the pan and warm through. ", "This is best served with creamy mashed potatoes and green beans, garnished with freshly chopped parsley."]}, {"isVegetarian": true, "title": "Edamame falafel with roasted veg", "url": "www_bbc_co_uk_food_recipes_low-carb_falafel_with_19951", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-carb_falafel_with_19951_16x9.jpg", "ingredients": ["500g/1lb 2oz frozen soya beans, defrosted", "1 small red onion, finely chopped", "2 garlic cloves, crushed", "½ small bunch coriander, leaves and stalks finely chopped", "1-2 tsp ras-el-hanout, to taste", "1 free-range egg, beaten", "2 tbsp toasted sesame seeds", "2 tbsp dry breadcrumbs", "sea salt and freshly ground black pepper, to taste", "olive oil cooking spray", "1 red pepper, seeds removed, quartered", "1 yellow pepper, seeds removed, quartered", "2 courgettes, cut into long batons", "1 aubergine, halved lengthways then sliced into half moons", "1 tsp sweet smoked paprika", "1-2 tsp sherry vinegar, to taste", "½ small bunch coriander, torn", "⅓ cucumber, roughly peeled, seeds removed, finely chopped", "1 small garlic clove, crushed", "100g/3½oz fat-free Greek yoghurt", "1 lemon, juice of ½, remainder cut into wedges for serving", "small handful mint, leaves shredded"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Pat the soy beans dry with kitchen paper to remove as much excess moisture as possible. Put the beans into a food processor and blend to a rough paste. Tip into a bowl, combine with the remaining falafel ingredients (except the olive oil) and season, to taste. ", "Shape the mixture into golf ball-sized balls and place on a baking tray. Spray with a little oil and then bake for 15-20 minutes, or until golden-brown.", "For the vegetables, put the vegetables onto a baking tray. Spray with a little olive oil, and sprinkle over the smoked paprika. Season with salt and pepper and cook alongside the falafel in the preheated oven for 20 minutes.", "Meanwhile make the dip. Combine the cucumber with the garlic, yoghurt, lemon and mint and season to taste.", "Once the vegetables are tender and the falafel golden-brown and crisp on the outside, remove from the oven. Season the roasted vegetables with a drizzle of sherry vinegar and mix in the coriander. Serve with the yoghurt dip and a wedge of lemon on the side."]}, {"isVegetarian": false, "title": "Bacon, egg and spinach salad with roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_low-fat_bacon_egg_50154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_bacon_egg_50154_16x9.jpg", "ingredients": ["2 slices good-quality wholemeal bread", "drizzle olive oil", "6 ripe baby plum tomatoes, halved ", "1 garlic clove, finely sliced", "2 rashers back bacon, fat removed", "2 very fresh free-range eggs", "1 tsp vinegar (such as white wine vinegar)", "250g/9oz baby spinach, washed", "3 sprigs fresh basil, leaves torn", "sea salt and freshly ground black pepper", "2 tbsp extra virgin olive oil", "½ tbsp sherry vinegar", "1 tbsp wholegrain mustard"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Tear the bread into bite-sized pieces and scatter in an even layer over a baking tray. Drizzle with a little olive oil. ", "Place the tomatoes onto a separate tray, scatter with the sliced garlic, placing slices on top of the tomatoes and season with pepper.  Place both trays in the oven for 8-10 minutes, or until the bread is golden-brown and crisp. Set aside and leave to cool.", "Heat a griddle pan over a high heat until hot. Fry the bacon until charred on both sides and cooked through. Once cooked, chop into small pieces.", "For the dressing, place all the ingredients into a clean jam jar or a small watertight tub. Add two tablespoons of water and seal. Shake until emulsified. Season with salt and pepper to taste. (The dressing can be stored and used in other dishes as it will make more than you need for this salad.)", "Bring a large pan of water to a simmer and add the white wine vinegar (don’t be tempted to add salt as this will cause the egg whites to disintegrate and will ruin your poached eggs). Crack the eggs into a small ramekin or dish. Briefly whisk the water to create a vortex before gently pouring the cracked eggs into the centre of the slowly spinning water. Poach for four minutes in gently simmering water, or until cooked to your liking. Remove from the pan and drain thoroughly on kitchen paper.", "To serve, put the bread pieces, roasted tomatoes, three-quarters of the chopped bacon and all of the spinach and basil into a large bowl. Spoon over 1-2 tablespoons of the dressing and toss to combine. Place onto serving plates and top with a poached egg. Season with pepper and sprinkle over the remaining bacon bits. Serve immediately. "]}, {"isVegetarian": false, "title": "Low-fat beef and bean burrito with lime yoghurt", "url": "www_bbc_co_uk_food_recipes_low-fat_beef_and_bean_53274", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_beef_and_bean_53274_16x9.jpg", "ingredients": ["100g/3½oz plain flour, plus extra for dusting", "100g/3½oz plain wholemeal flour", "pinch salt", "drizzle oil", "½ red onion, thinly sliced", "1 red pepper, deseeded and thinly sliced", "½ tsp ground allspice", "1 tsp smoked paprika", "1 tsp cumin seeds", "2 sirloin steaks (approximately 200g/7oz each), fat removed, cut into bite-sized pieces or strips", "½ tbsp olive oil", "100ml/3½fl oz fat-free yoghurt", "1 lime, juice only", "1 tsp olive oil", "2 garlic cloves, peeled and sliced", "2 tsp cumin seeds", "1 x 400g/14oz tin black beans, partially drained ", "2 ripe tomatoes, seeds removed and finely chopped", "¼-½ red onion (depending on size), finely chopped", "1 red chilli, finely chopped", "1 lime, zest and juice ", "1 small iceberg lettuce, shredded"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tortillas, put the flours into a mixing bowl. Add a pinch of salt, a drizzle of oil and two tablespoons of water. Mix with your hands to bring the mixture together to form a dough. Add a little more water if the mixture is too dry. Knead in the bowl for a minute until smooth and elastic then set aside to rest for 5-10 minutes.", "Dust a work surface with a little flour. Divide the dough into four and roll out each piece into a very thin circle using a floured rolling pin. ", "Heat a heavy-based frying pan over a medium/high heat and cook the tortillas individually in the dry pan for 2-3 minutes on each side, or until lightly golden-brown, bubbling and cooked through. Transfer to a plate and wrap in a clean tea towel while you cook the remaining tortillas.", "For the beef, mix all the beef ingredients together in a bowl and stir to evenly coat the steak in the oil and spices. Leave to marinate while you prepare the lime yoghurt.  (This can be done in advance and left for up to a couple of hours.)", "For the lime yoghurt, mix the lime juice and yoghurt together until combined. Set aside until ready to use.", "In a hot frying pan, cook the beef mixture with a pinch of salt over a high heat for 3-4 minutes, or until the beef is browned all over. Remove from the pan and rest on a plate while you cook the black beans.", "For the beans, add the oil to the pan you cooked the steak in. Add the garlic and cumin seeds and cook over a medium heat for two minutes until aromatic. Add the black beans and stir to mix well. Crush them lightly with the back of a wooden spoon as you heat them through. Once hot, remove from the heat and set aside.", "For the salsa, mix all the salsa ingredients together in a small bowl.", "To serve, spread some of the beans over each tortilla and top with a little of the beef. Spoon over a little salsa, to taste, and drizzle a spoonful of lime yoghurt over. Add a scattering of lettuce, roll up and serve immediately. "]}, {"isVegetarian": false, "title": "Low-fat Caesar salad", "url": "www_bbc_co_uk_food_recipes_low-fat_caesar_salad_38342", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_caesar_salad_38342_16x9.jpg", "ingredients": ["2-3 slices sourdough bread, depending on size", "1 tsp olive oil", "1 garlic clove, peeled", "2 heads Cos lettuce, leaves separated and torn", "1 tbsp finely grated parmesan cheese", "1 free-range egg yolk", "4 anchovies in olive oil, drained, oil reserved", "½ garlic clove, grated", "½ lemon, juice and zest", "1 tsp Dijon mustard", "25g/1oz Parmesan, finely grated", "2 tbsp extra-virgin olive oil", "black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan over a high heat until smoking. Drizzle the bread with a little oil and then rub with the garlic clove.", "Griddle the bread for 30-40 seconds on each side, or until golden-brown and crisp with deep char-grill lines. Leave to cool slightly and then tear into bite-sized pieces.", "Meanwhile make the dressing. Put the egg yolk, anchovies, a tablespoon of the reserved anchovy oil, the garlic, lemon zest and juice, mustard and parmesan into a small food processor along with a pinch or two of pepper. Blend to a paste. (Alternatively, chop everything really fine, and mash into a paste in a mixing bowl until as smooth as possible.)", "With the motor running gradually trickle in the oil, a few drops at a time, until completely incorporated. If the dressing is too thick, add a little warm water (about two tablespoons) and blend again. Season to taste with black pepper.", "Put the lettuce into a serving bowl. Pour over some of the dressing and toss to mix and coat. Scatter over the croûtons and the grated parmesan and serve. "]}, {"isVegetarian": false, "title": "Low-fat cheesecake", "url": "www_bbc_co_uk_food_recipes_low-fat_cheesecake_31000", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_cheesecake_31000_16x9.jpg", "ingredients": ["6 low-fat digestive biscuits", "10 low-fat/reduced sugar plain biscuits, such as Rich Tea", "2 tbsp clear honey", "75g/2½oz butter, melted", "6 leaves gelatine", "150ml/5fl oz skimmed milk", "50g/2oz cocoa powder", "100g/3½oz caster sugar", "500g/1lb 2oz quark cheese", "300g/10½oz fat-free Greek yoghurt", "1 tsp vanilla extract", "1 vanilla pod, seeds only", "2 free-range egg whites", "300g/10½oz fresh strawberries"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a 23cm/9in spring form cake tin with greaseproof paper. ", "For the base, put all the biscuits into a freezer bag and bash with a rolling pin until they resemble breadcrumbs. Place into a mixing bowl and add the honey and melted butter and mix well to combine. Press the mixture into the bottom of the tin.", "Bake for 10-12 minutes.  Remove from the oven and leave to cool while you prepare the filling. ", "To make the filling, soak the gelatine leaves in a bowl of ice-cold water for 10 minutes. Put the milk, cocoa powder and sugar into a saucepan. Bring to a simmer, stirring constantly, until the sugar has melted and the cocoa is completely combined. Remove from the heat and leave to cool for a few minutes. Whisk in the gelatine and set aside.", "Put the quark and yoghurt into a mixing bowl and beat together until smooth. Add the vanilla extract and the vanilla seeds. Beat to mix well and then add the cocoa mixture. Beat until smooth and set aside.", "In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl. Fold one third of the egg whites into the cheesecake mixture and then carefully fold in the remainder.", "Spoon the mixture onto the base then put into the fridge to set for at least 4-6 hours or overnight if possible. Decorate with strawberries and serve."]}, {"isVegetarian": false, "title": "Low-fat chicken and mushroom pie", "url": "www_bbc_co_uk_food_recipes_low-fat_chicken_and_43509", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chicken_and_43509_16x9.jpg", "ingredients": ["3 large Portobello mushrooms", "30g/1oz dried porcini mushrooms, soaked in 200ml/7fl oz boiling water for 20 minutes", "sea salt and black pepper", "200g/7oz button mushrooms, cleaned and trimmed", "500ml/18fl oz fresh chicken stock", "1 bay leaf", "500g/1lb 2oz waxy potatoes, peeled", "2 tsp olive oil", "1 onion, chopped", "1 leek, chopped", "2 skinless chicken breasts, trimmed and sliced", "1 tbsp plain flour", "½ bunch tarragon, leaves finely chopped", "320g/11oz green beans"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Put the Portobello mushrooms on a baking tray and season with salt and pepper. Roast for 20 minutes, or until tender, and then set aside to cool. (Now is also a good time to soak the porcini mushrooms in the boiling water.) ", "Place the chicken stock in a small pan and bring to the boil. Add the button mushrooms and the bay leaf and cook for 6-8 minutes, or until tender.", "While the mushrooms are cooking, prepare the topping. Place the potatoes in a large saucepan and add enough hot water to cover the potatoes. Bring to the boil, then cook over a medium heat for 5-7 minutes, or until the potatoes are turning tender but aren’t cooked through. Drain and leave to cool, then slice thinly.", "Add the olive oil to a large frying pan over a medium heat. Add the onion and fry for 5-6 minutes, or until softened. Add the leek and continue to cook for 7-8 minutes, or until soft.", "Once the button mushrooms are soft and tender, remove the bay leaf and place them in a blender along with the stock. Add half of the dried mushroom soaking liquor (being careful not to get any bits of grit from the dried mushrooms) and blend until smooth.", "Once the leek is softened, put the chicken into the pan and stir to mix. Cook for two minutes and then sprinkle in the flour. Stir so that everything is coated and cook for three minutes. Season with pepper and a pinch of salt.", "Pour the mushroom and stock mixture from the blender into the pan with the chicken. Add the soaked mushrooms (discarding the remaining liquor as this may be gritty). Mix well. Turn off the heat, and add the tarragon. Slice the cooked Portabello mushrooms and add to the mix.", "Pour the pie filling into a pie dish (measuring about 18x24cm/7x9½in) and spread out evenly. Top with overlapping slices of the sliced potatoes. ", "Place into the preheated oven and bake for 35-40 minutes, or until the potato topping is crisp, golden-brown and cooked through and the filling is bubbling. Steam the beans to your liking and serve with the pie."]}, {"isVegetarian": false, "title": "Low-fat chicken curry", "url": "www_bbc_co_uk_food_recipes_low-fat_chicken_curry_88832", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chicken_curry_88832_16x9.jpg", "ingredients": ["3 skinless chicken breasts, trimmed and cut into bite-size pieces", "4 heaped tsp garam masala powder", "1 tsp salt", "4 garlic cloves, grated", "3cm/1½in piece fresh root ginger, grated", "1 lemon, juice only", "1-2 tsp light olive oil", "3 onions, thinly sliced", "1-2 long green chillies, to taste, finely chopped", "2 green peppers, seeds removed and cut into chunks", "1 tbsp tomato purée", "200ml/7fl oz chicken or vegetable stock", "4 tomatoes, seeds removed, quartered, cut into strips", "½ small bunch coriander, roughly chopped", "2 tomatoes, seeds removed, quartered and finely chopped", "half a cucumber, roughly peeled, quartered lengthways, seeds removed and sliced", "1 red onion, finely chopped", "½-1 green chilli, finely chopped", "2 limes, juice and zest", "½ small bunch coriander, leaves and stalks finely chopped", "pinch salt", "cooked rice"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the chicken with the marinade ingredients in a mixing bowl. Cover with cling film and transfer to the fridge for two hours, or overnight if possible.", "Heat the oil in a large frying pan until hot. Add the sliced onions and peppers and fry for 5-6 minutes, stirring occasionally until softened. Add three-quarters of the chilli and cook for two minutes then add the marinated chicken and the marinade. Cook for 3-4 minutes", "Add the tomato purée to the chicken, stir through to mix and cook for two minutes. Add the stock, bring to the boil then cook for 10 minutes to cook the chicken through.", "Meanwhile for the cachumba salad, combine all of the ingredients in a bowl. Season to taste with salt and set aside.", "Taste the chicken and adjust the seasoning as necessary. Add the tomatoes, stir through and cook for 5-10 minutes, or until the sauce is thickened and flavoursome and the tomatoes softened. Remove from the heat. Garnish with chopped coriander and the remaining chopped chilli and serve with rice."]}, {"isVegetarian": false, "title": "Low-fat chicken tikka masala", "url": "www_bbc_co_uk_food_recipes_low-fat_chicken_tikka_04689", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chicken_tikka_04689_16x9.jpg", "ingredients": ["500g/1lb 2oz chicken breasts, cut into bite-sized pieces", "1 garlic clove, grated", "75g/2½oz plain yoghurt", "1 tbsp tikka spice powder", "1 chicken stock pot, made up with 100ml/3½fl oz boiling water", "2 medium onions, sliced", "2 garlic cloves, sliced", "1 tsp grated fresh ginger", "1½ tbsp tikka spice powder", "1 x 400g tin chopped tomatoes", "1 small bunch fresh coriander, chopped, plus extra for garnish", "salt and freshly ground black pepper", "3 tbsp plain yoghurt", "300g/10½oz brown basmati rice, cooked according to packet instructions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinated chicken, mix together all the ingredients in a bowl, cover with cling film and put in the fridge aside to marinate while you make the sauce.", "For the tikka masala sauce, bring the stock to a simmer in a saucepan. Add the sliced onions, garlic and ginger. Cut a square of baking paper or greaseproof paper large enough to cover the mixture in the pan. Push it right down to cover the onions and garlic closely, cover the pan with a lid and simmer very gently for 15 minutes.", "Remove the paper. The onions should be translucent and soft. Add the tikka spice powder, the tinned tomatoes and the chopped coriander and bring to the boil. Reduce the heat slightly and simmer briskly for 20-30 minutes, until the sauce is thickened. Season with salt and freshly ground black pepper then set aside to cool slightly.", "Meanwhile, preheat the grill to its hottest setting. Cover a baking tray with foil, and then place the marinated chicken on the tray in a single layer. Grill the chicken for 15 minutes, or until the chicken pieces are cooked through. Give the chicken a turn halfway through cooking, to ensure it’s nicely browned all over.", "Using a stick blender or food processor, blend the tikka masala sauce until smooth. Return to the heat and warm through, then add the plain yoghurt. (Don’t boil the sauce after you add the yoghurt or it will split.) Stir the cooked chicken pieces into the sauce and serve with brown basmati rice and a sprinkling of coriander to finish."]}, {"isVegetarian": true, "title": "Low-fat chocolate sponge cake", "url": "www_bbc_co_uk_food_recipes_low-fat_chocolate_sponge_79500", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chocolate_sponge_79500_16x9.jpg", "ingredients": ["olive oil cooking spray, for greasing", "4 large free-range egg whites", "pinch salt", "2 large free-range eggs", "1 tsp vanilla extract", "75g/2½oz golden caster sugar", "2 Braeburn apples, peeled, cored and grated", "100g/3½oz self-raising flour, sifted", "40g/1½oz cocoa powder, sifted", "150g/5½oz raspberries", "75g/2½oz icing sugar, sifted, plus extra for dusting"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/330F/Gas 3.", "Grease a 20cm/8in non-stick cake tin with a little olive oil cooking spray. Using an electric hand whisk, beat the egg whites with a pinch of salt until stiff peaks form when the whisk is removed from the bowl, then set aside. ", "In a separate bowl, whisk together the whole eggs, vanilla extract and caster sugar until pale, doubled in volume and the sugar has dissolved.", "Fold in the apple, flour and cocoa powder with a metal spoon and then fold a third of the egg white mixture into the cocoa mixture. Once combined, fold this into the remaining egg white mixture.", "Spoon the mixture gently into the cake tin and bake for 30 minutes, or until risen (when cooked the sponge should bounce back when pressed lightly). Transfer to a wire rack and leave to cool. ", "Once cooled, slice the cake in half horizontally to create two layers. Mash two-thirds of the raspberries and one tablespoon of icing sugar together roughly in a bowl and spread this mixture over the top of one of the pieces of cake. Top with the other piece.", "Mix together the remaining icing sugar and enough water to bring it together to form a thin icing of drizzling consistency. Drizzle the icing over the cake, leave for 2-3 minutes to harden slightly and then decorate with the remaining raspberries."]}, {"isVegetarian": false, "title": "Low-fat beef and potato pies", "url": "www_bbc_co_uk_food_recipes_low-fat_minced_beef_and_34423", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_minced_beef_and_34423_16x9.jpg", "ingredients": ["1 medium onion, finely diced", "2 small carrots, peeled and diced", "2 celery sticks, trimmed and finely sliced", "250g/9oz lean beef mince (less than 10% fat)", "1 tbsp tomato ketchup", "1 tbsp brown sauce", "½ tbsp Worcestershire sauce", "1 tbsp plain flour", "½ tsp hot chilli powder", "½ tsp dried chilli flakes (optional)", "½ tsp freshly ground black pepper", "200g/7oz floury potatoes, preferably King Edwards or Maris Pipers, peeled and cut into 1.5cm/¾in cubes", "300ml/½ pint beef stock, made with 1 beef stock cube", "75g/3oz frozen peas", "2 x 145g/5¼oz packets pizza base mix", "about 200ml/7fl oz lukewarm water", "plain flour, for kneading and rolling", "1–2 tbsp semi-skimmed milk"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the onion, carrots, celery and beef together in a large non-stick saucepan and dry-fry over a high heat for 2–3 minutes, until the beef is no longer pink. Keep stirring with a couple of wooden spoons to break up the mince.", "Reduce the heat and add the ketchup, brown sauce, Worcestershire sauce, flour, chilli powder and chilli flakes (if using) and black pepper. ", "Cook for a minute, then add the potatoes and stock. ", "Bring to the boil, reduce the heat and cover loosely. Simmer for 25 minutes until the potatoes are tender, stirring occasionally. If necessary, remove the lid for the last five minutes and stir more regularly until the mixture is thick. ", "Remove from the heat, stir in the frozen peas and leave to cool completely.", "To make the pastry, put the pizza base mixes in a large bowl and mix with lukewarm water according to the packet instructions. ", "Turn out on to a lightly floured surface and knead for five minutes until the dough is smooth and elastic. ", "Preheat the oven to 180C/350F/Gas 6.", "Using scales, divide the dough into six even portions – each will be about 80g/3oz. ", "From each portion, take off 35g/1¼ oz of the dough to use for the pie lids. ", "Roll out the larger piece of each portion on a lightly floured surface until it is about 3mm/ 1/8in thick and large enough to line your foil pie dish, leaving a little overhanging the sides. ", "Lift into a pie dish and press down well into the base and sides. This can be a little tricky first time round, but the dough is very forgiving, so take it slowly until you’ve got the hang of the method.", "Spoon a sixth of the mince and potato mixture into the pie case. Brush the overhanging edges with a little milk. ", "Roll out the smaller portion of pastry until it is large enough to cover the pie dish. Lift it on top of the pie and pinch the pastry firmly together. Trim with kitchen scissors – using scissors will stop the dough stretching.", "Repeat exactly the same process to make the other five pies and place them on a baking tray. ", "Snip once in the centre of each pastry lid with scissors to create a large hole for steam to escape. Brush the pies generously with more milk.", "Bake the pies for 15 minutes, then remove them from the oven and cover each one fairly tightly with foil. ", "Put them back in the oven for a further 15 minutes or until the pies are pale golden brown and the filling is piping hot. ", "Remove the pies from the oven and leave to stand for five minutes before removing the foil, then tuck in!"]}, {"isVegetarian": true, "title": "Low-fat roast potatoes", "url": "www_bbc_co_uk_food_recipes_low-fat_roast_potatoes_35344", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_roast_potatoes_35344_16x9.jpg", "ingredients": ["1.2kg/2lb 12oz floury potatoes, such as King Edward, peeled, cut into chunks", "cooking oil spray", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/210C Fan/Gas 8 or its hottest setting. ", "Boil the potatoes in lightly salted boiling water for 3-4 minutes, then drain in a colander. Fluff up the edges using a fork, then season with salt and pepper, spray well with cooking oil spray. ", "Tip the potatoes into a large baking tray and roast for 25 minutes. Mix them around, spray with more cooking oil spray and roast for a further 25 minutes, until golden-brown all over."]}, {"isVegetarian": true, "title": "Low-sugar Christmas biscuits", "url": "www_bbc_co_uk_food_recipes_low-sugar_christmas_13043", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-sugar_christmas_13043_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened ", "60g/2¼oz soft brown muscovado sugar ", "1 free-range egg", "2 tsp vanilla extract  ", "275g/9¾oz plain flour, plus extra for dusting", "1 tsp ground cinnamon", "1 tbsp finely chopped candied peel", "halved blanched almonds, to decorate"], "serves": "Makes 36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until pale, light and fluffy. Crack in the egg and add the vanilla extract, then beat again. ", "Mix in the flour, cinnamon and candied peel until the mixture comes together as a dough.", "Roll the dough out on a lightly floured work surface to a thickness of 1cm/½in.", "Using biscuit cutters or a glass, cut biscuits out of the dough and carefully place onto the baking tray. Decorate with the almond halves. To make into Christmas tree decorations, carefully make a hole in the top of the biscuit using a straw.", "Bake the biscuits for 8-10 minutes until deep golden-brown. Set aside to harden for 5 minutes, then cool on a wire rack. "]}, {"isVegetarian": false, "title": "Low-fat bacon and lentil soup", "url": "www_bbc_co_uk_food_recipes_low_fat_bacon_and_lentil_02962", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low_fat_bacon_and_lentil_02962_16x9.jpg", "ingredients": ["4 carrots", "1 onion", "3 sticks celery, trimmed and washed", "1 garlic clove, peeled", "2 sprigs thyme", "1-2 bay leaves", "5-6 parsley stalks, leaves reserved for garnish", "pinch salt and freshly ground black pepper", "1 tbsp olive oil", "2 medium onions, chopped", "sea salt and black pepper", "2 garlic cloves, chopped", "1 red chilli, deseeded and finely chopped", "4 rashers smoked back bacon, fat removed, sliced into small pieces", "200g/7oz red lentils, washed thoroughly", "1 x 400g/14oz tin plum tomatoes", "1 litre homemade vegetable stock (see above)", "parsley leaves (from above), finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First, make your vegetable stock. Grate the vegetables and place (along with any ends you can’t grate) into a large heatproof bowl. Add the thyme, bay leaves and the stalks from the parsley. Season with a small pinch of salt and pepper. Cover the vegetables with 1 litre/1¾ pints boiling water. Leave to steep for 10 minutes, or until cool. Once cool, strain the stock through a sieve and discard the vegetables.", "For the main soup, heat the oil in a large saucepan or casserole over a medium heat. Add the onions and a pinch of salt. Fry gently for two minutes, then add the garlic and chilli and cook over a low heat for five minutes or until the onions are completely soft but not coloured. Add the bacon and fry for 2-3 minutes, or until cooked through.", "Add the lentils and tomatoes, breaking up the tomatoes with your spoon. Cook for 2-3 minutes, then add enough of the vegetable stock to cover (you may need all of it). Bring to the boil then reduce to a simmer. Cook for 15-20 minutes, or until the lentils are completely soft. Turn off the heat.", "Pour half of the soup into a blender and pulse until smooth. Return to the pan with the remaining soup and heat through, taste and adjust the seasoning if necessary.", "Divide the soup between serving bowls, sprinkle with chopped parsley and serve."]}, {"isVegetarian": true, "title": "Low-fat tiramisu", "url": "www_bbc_co_uk_food_recipes_lowfattiramisu_11016", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz very strong coffee", "60ml/2fl oz Tia Maria (optional)", "½ vanilla pod, deseeded", "250g/9oz low fat crème fraiche", "250ml/8½fl oz low-fat custard", "2 tbsp cocoa powder", "10 to12 boudoir biscuits", "chocolate coated coffee beans, a little grated", "chocolate or a dusting of cocoa powder"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the coffee and Tia Maria (if using) and leave to one side.", "In a separate bowl, add the vanilla to the crème fraiche, fold in the custard and set aside.", "Dip the biscuits into the coffee and place 2 in the bottom of each serving glass.", "Spoon a layer of the custard mixture over the top and repeat.", "Top with a garnish of your choice."]}, {"isVegetarian": false, "title": "Lucy’s strawberry slices", "url": "www_bbc_co_uk_food_recipes_lucys_strawberry_slices_64042", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lucys_strawberry_slices_64042_16x9.jpg", "ingredients": ["225g/8oz butter, softened, or baking spread, plus extra for greasing", "4 free-range eggs", "225g/8oz caster sugar", "300g/10½oz self-raising flour", "2 level tsp baking powder", "4 tbsp milk", "1 tsp vanilla extract", "2 tbsp strawberry jam", "1 tsp lemon juice", "300g/10½oz small fresh strawberries, hulled and cut in half", "300ml/10½oz double cream, whipped", "200ml/7fl oz full-fat crème fraîche", "icing sugar, for dusting"], "serves": "Makes 27 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": [" Preheat the oven to 180C/160C Fan/Gas 4. Grease the traybake tin with butter or baking spread and line the base and sides with baking paper.", "Measure all the cake ingredients into a large bowl and beat well using an electric mixer for about 2 minutes until well blended. Turn the mixture out into the prepared tin and smooth the surface.", "Bake for 35 minutes, or until the cake has shrunk from the sides of the tin and springs back when pressed in the centre with your fingertips. Leave to cool in the tin.", "Remove the cake from the tin and trim the edges so they are perfectly straight. Cut the cake lengthways into three strips, then cut across each strip to give nine 7x3cm/2 ¾ x1½in slices. Cut each slice in half horizontally ready for filling as you would a sandwich. ", "For the filling, spoon the jam into a bowl with the lemon juice and blend together, then toss the strawberries in the jam to give a glaze. Mix the whipped cream and crème fraîche together and spread or pipe a fairly thick layer over the base of each half-sponge. Arrange two or three glazed pieces of strawberry on top and sit the top half of the sponge on top. Dust with icing sugar to serve."]}, {"isVegetarian": false, "title": "Lunchbox chorizo frittata", "url": "www_bbc_co_uk_food_recipes_lunchbox_chorizo_07622", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lunchbox_chorizo_07622_16x9.jpg", "ingredients": ["1 tsp rapeseed oil", "1 onion, roughly chopped", "1 red pepper, seeds removed, chopped", "200g/7oz chorizo, skin removed and roughly chopped", "6 free-range eggs", "50ml/2fl oz milk", "1 garlic clove, finely chopped", "200g/7oz cooked potatoes, roughly chopped", "100g/3½oz frozen peas", "2 tbsp chopped flatleaf parsley", "green salad, to serve", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Heat an ovenproof frying pan on the hob until just hot, then add the oil, onion and red pepper and fry for 2 minutes, until just softened. Turn the heat up, add the chorizo and cook for 3-4 minutes until it has released its oil and is crisp around the edges. The mixture will go a lovely red colour.", "Meanwhile, crack the eggs into a large jug and whisk with the milk, a pinch of salt and plenty of black pepper. ", "Add the garlic and potatoes to the chorizo mixture and fry for another 2 minutes, stirring gently, until just hot through. Add the peas and cook for another minute, until the whole mixture is hot. ", "Pour in the egg, stir briefly, turn down to a medium heat and scatter the parsley over the top .Fry without stirring, for 1–2 minutes, then carefully lift the edge of the frittata with a spatula to check if it is cooked and golden-brown underneath. If it isn’t, cook for another minute then check again.", "Place the pan in the oven and bake for 10–12 minutes. When the top is bubbled up and slightly golden use a tea towel to grab the handle and give the pan a gentle shake. If the middle wobbles it needs a little longer. If it’s fairly firm, put it aside to cool slightly.", "Slide the frittata out of the pan onto a plate. You can serve this hot or cold but make sure to let it cool to room temperature before storing it in a sealable container in the fridge. Cut it into slices and serve with a green salad. "]}, {"isVegetarian": true, "title": "Luscious lemon Swiss roll cake", "url": "www_bbc_co_uk_food_recipes_luscious_lemon_swiss_13163", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/luscious_lemon_swiss_13163_16x9.jpg", "ingredients": ["butter, for greasing", "3 free-range eggs", "115g/4oz caster sugar, plus 4 tbsp for dredging", "1 unwaxed lemon, zest only", "115g/4oz plain flour", "200g/7oz icing sugar, sifted", "125g/4½oz softened butter", "2 tsp freshly squeezed lemon juice", "125g/4½oz lemon curd"], "serves": "Makes 1 Swiss roll", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Grease and line a 33cm x 23cm/13in x 9in Swiss roll tin with buttered baking parchment. ", "Preheat the oven to 200C/400F/Gas 6.", "Put the eggs, 115g/4oz of the sugar and the lemon zest in a heatproof bowl and place over a pan of gently simmering water. ", "Whisk with an electric whisk until the mixture is pale, creamy and thick enough to leave a trail when the whisk is lifted.", "Carefully remove the bowl from the heat and continue whisking for a further five minutes. ", "Sift in half the flour and, using a large metal spoon, lightly fold it into the egg mixture. ", "Sift in the remaining flour and fold into the mixture - it’s important to use gentle movements to retain as much air as possible in the batter.", "Pour the mixture slowly into the prepared tin and gently spread with a spatula so the base of the tin is evenly covered.", "Bake for 10–12 minutes until well-risen, pale golden-brown and firm to the touch.", "Place a damp tea towel on the work surface and cover with a sheet of baking parchment. ", "Dredge with the four tablespoons of sugar – this will help stop the outside of the sponge sticking. Working quickly, turn the cake out onto the sugared paper and carefully remove the lining paper. ", "Using a sharp knife, cut off the crusty edges from the two long sides. Roll the Swiss roll from one of the short ends, starting with a tight turn to make a good round shape and keeping the sugared paper inside the roll. Set on a wire rack and leave to cool.", "To make the icing, put the icing sugar and butter in a bowl and beat until smooth and creamy.  Add the lemon juice and beat again. ", "When the cake is cold, gently unroll but do not flatten it or it could crack. ", "Spread the cake with then lemon butter icing, leaving a 1cm/½in border.", " Spoon the lemon curd evenly over the icing. ", "Slowly roll the cake up again, enclosing the filling, and place on a plate. Sprinkle with extra sugar if you like."]}, {"isVegetarian": false, "title": "Lush lemon pepper chicken", "url": "www_bbc_co_uk_food_recipes_lush_lemon_pepper_19156", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lush_lemon_pepper_19156_16x9.jpg", "ingredients": ["4 tbsp clear honey", "2 tbsp Dijon mustard", "3 garlic cloves, peeled, grated", "3-4 tsp cracked black pepper, to taste   ", "2 lemons, zest and juice", "4 bone-in chicken breasts, skin removed, each breast scored three or four times using a sharp knife", "4-5 sprigs fresh rosemary", "1 lemon, thinly sliced", "700g/1½lb baby new potatoes", "salt and freshly ground black pepper ", "handful chopped fresh flatleaf parsley leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, mix together all the marinade ingredients in a bowl until well combined. ", "For the lemon pepper chicken, rub some of the marinade into the scored chicken, then place the chicken breasts in a bowl and pour over the remaining marinade. Cover the bowl with cling film and chill in the fridge for at least 10 minutes and up to two hours. ", "When the chicken has marinated, preheat the oven to 200C/180C Fan/Gas 6. ", "Arrange the rosemary sprigs and lemon slices in the bottom of a roasting tray. Tip the potatoes into the roasting tray, then place the marinated chicken breasts on top of the potatoes. Give the chicken a final coating of marinade and season, to taste, with salt and freshly ground black pepper.", "Roast for 30–35 minutes, or until the potatoes and the chicken are cooked (the chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer).  ", "Cover the roasting tray with aluminium foil and set the chicken aside to rest for 10–15 minutes. Just before serving, scatter over the chopped parsley."]}, {"isVegetarian": false, "title": "Luxury fish pie", "url": "www_bbc_co_uk_food_recipes_luxury_fish_pie_18997", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/luxury_fish_pie_18997_16x9.jpg", "ingredients": ["600ml/20fl oz fish stock", "50ml/2fl oz anise-flavoured liqueur, such as Pernod", "1 small onion, roughly chopped", "1 small fennel bulb, roughly chopped", "2 celery sticks, roughly chopped", "1 bay leaf", "few sprigs fresh parsley", "500g/1lb 2oz haddock fillet (or other white fish of your choice), skinned and boned", "250g/9oz salmon fillet, skinned and boned", "250g/9oz smoked langoustines", "1.5kg/3lb 5oz floury potatoes (such as King Edward), peeled and cut into large chunks", "salt and black pepper", "100ml/3½fl oz double cream", "pinch of saffron", "50g/1¾oz unsalted butter", "40g/1½oz unsalted butter", "40g/1½oz plain flour", "300ml/10½fl oz reserved poaching stock (from above)", "100ml/3½fl oz double cream", "2 tbsp chopped fresh tarragon ", "salt and black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the poaching stock, place all the ingredients in a large pan and bring to the boil. Reduce the heat to a simmer. ", "Add the haddock and salmon to the stock, pressing them down gently into the simmering liquid. Poach the fish for a few minutes, or until just cooked. Strain the mixture, reserving all the liquid. Pick out the stock vegetables and bay leaf and discard. Leave the fish to cool.\t", "Put the strained poaching liquid into a clean pan. Bring to the boil, and boil until the volume of liquid has reduced by half. You will need 300ml/10½fl oz of the reduced liquid for the sauce. Set aside.", "For the mash, put the potatoes in a large pan. Cover with cold water, add a little salt and bring to the boil. Cook for 15–20 minutes, or until tender. ", "Meanwhile, to make the sauce, melt the butter in a pan. Stir in the flour to form a roux. Let this cook over a medium heat, stirring frequently, for 2–3 minutes. Take off the heat and gradually add the reduced poaching liquid, a ladle at a time, beating well after each addition to create a smooth sauce. Return to the heat and cook, stirring often, for about five minutes. Finish the sauce by adding the cream, tarragon and some salt and pepper.", "Drain the potatoes well and set aside. Heat the cream, saffron and butter gently in the potato pan, until the butter has melted, then take off the heat and pass the potatoes through a ricer into the pan (or just tip them in and mash). Season with salt and pepper to taste and stir to combine.", "Flake the cooked fish over the base of your ovenproof dish, taking care to remove any bones as you go. Scatter over the langoustines. Pour over the sauce. Top with the mash, smooth it down and then mark into a scallop pattern with the tip of a pallet knife, or the handle of a large spoon. ", "Bake for 25–30 minutes, or until golden-brown on top and bubbling all the way through. If your assembled pie has cooled down, it may take longer. Serve with buttered peas."]}, {"isVegetarian": true, "title": "Lychee and lime syrup", "url": "www_bbc_co_uk_food_recipes_lycheeandlimesyrup_79745", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "50ml/2fl oz water", "150g/5½oz fresh lychees, peeled", "½ lime, juice and zest only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar and water in a small saucepan over a medium heat. Once the sugar has dissolved remove from the heat.", "Place the lychees, lime juice and lime zest into a bowl and mix together.", "Add the sugar syrup to the bowl of lychees and lime and mix together.", "Serve in a bowl."]}]