[{"ingredients": ["6 cucharadas de aceite de oliva", "2 cebollas de primavera, cortadas diagonalmente", "1 chile rojo grande, cortado diagonalmente (semillas dentro o fuera según la cantidad de calor que te guste)", "1 zanahoria, finamente cortada en rodajas", "1 pimiento rojo, en rodajas finas", "100g / 3½ oz de mangetout o guisantes de azúcar", "1 calabacín, finamente cortado en cerillas", "Espárragos de 150 g / 5½ oz, extremos leñosos retirados, cortados a la mitad y cortados diagonalmente", "4 dientes de ajo, en rodajas finas", "3 cucharadas de salsa de chile sriracha", "15g / ½ oz de cilantro fresco, picado", "1 cucharadita de cinco especias indias (panch phoran)", "sal y pimienta negra recién molida"], "method": ["Caliente 2 cucharadas de aceite en un wok o una sartén antiadherente grande a fuego alto. Cuando el aceite esté muy caliente, agregue todas las verduras excepto el ajo y saltee durante 2-3 minutos. Condimentar con sal y pimienta.", "Agregue la sriracha y el cilantro fresco a las verduras y mezcle bien.", "Mientras tanto, caliente las 4 cucharadas restantes de aceite en una sartén pequeña a fuego medio. Agregue el ajo y fría hasta que estén doradas.", "Agregue las cinco especias hindúes al ajo y caliente a fuego medio durante unos segundos, teniendo cuidado de no quemar las especias. Vierta el ajo y la mezcla de cinco especias sobre las verduras y revuelva. Sirva el sofrito de inmediato."], "url": "www_bbc_co_uk_food_recipes_indian_five-spice_63447", "title": "Salteado de verduras con cinco especias de la India", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_five-spice_63447_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de yogur griego", "2 cucharadas de vinagre de arroz", "3cm / ¼ en raíz fresca de jengibre, rallado", "5 dientes de ajo, rallados", "1 cucharadita de chile en polvo", "1 cucharadita de cúrcuma molida", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "pizca de pimienta inglesa", "1 cucharadita de sal marina", "8 filetes de muslo de pollo", "50g / 1¾oz de harina natural", "50 g / 1¾oz de harina de arroz", "½ cucharadita de sal marina", "½ cucharadita de pimienta blanca", "½ cucharadita de chile en polvo", "100ml / 3½fl oz de aceite vegetal", "1 chile verde, en rodajas", "1 diente de ajo, en rodajas", "puñado de hojas de curry frescas (o secas si no puedes encontrarlas)", "cuñas de limón, para servir", "ensalada verde, para servir"], "method": ["Para el adobo, mezcle el yogur, el vinagre, el jengibre, el ajo, las especias y la sal en un bol, agregue el pollo, cúbralo y déjelo marinar, tapado, en el refrigerador durante 1 - 3 horas.", "Para el recubrimiento de harina, mezcle las harinas y el condimento. Mezcle los muslos de pollo en la mezcla de harina, uno a la vez, y colóquelos en un plato.", "Agregue el aceite a una sartén grande o wok y caliente a fuego medio. Agregue el chile, el ajo y las hojas de curry y cocínelas durante 3 a 5 minutos, hasta que las hojas comiencen a tostarse y el ajo se ponga dorado. Sácalos con una espumadera y déjelos a un lado para escurrirlos sobre papel de cocina. Esto realmente dará sabor al aceite.", "Coloque el pollo en el aceite y cocine a fuego medio durante 5 minutos por cada lado, hasta que esté cocido y dorado. Retire con una espumadera y escurra sobre papel de cocina. Espolvorea sobre el chile, el ajo y las hojas de curry y sirve con rodajas de limón y una enorme ensalada verde. Hago uno con Little Gems, cebolletas y menta."], "url": "www_bbc_co_uk_food_recipes_indian_fried_chicken_88459", "title": "Pollo frito indio", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_fried_chicken_88459_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700g / 1lb 9oz de papas deseadas, reducidas a la mitad", "2 cucharadas de urad dal", "2 cucharadas de aceite de girasol", "1 cucharadita de semillas de comino", "2 cucharaditas de semillas de mostaza", "10 hojas frescas de curry (o 15 hojas secas)", "4 chiles rojos, picados", "1 cucharadita de cúrcuma molida", "2 cebollas blancas medianas, finamente picadas", "sal de mesa, al gusto", "Jengibre fresco de la raíz de los 2.5cm / 1in, rallado", "2 tomates, finamente picados", "manojo de cilantro fresco, toscamente picado", "Harina simple de 450g / 1lb", "100g / 3½oz de harina blanca fuerte", "75g / 2½oz de mantequilla fría sin sal", "½ cucharadita de sal fina", "100 g / 3½ oz de grasa vegetal sólida (como Cookeen o Trex), más extra para engrasar", "1 yema de huevo de gallinas camperas, batida, para esmaltar"], "method": ["Engrase una lata de forma de resorte de 20cm / 8in con grasa vegetal.", "Para el relleno, hierva las papas durante 15 minutos o hasta que estén tiernas. Drene y pique en trozos del tamaño de un bocado.", "Remoje las lentejas en una taza de agua hirviendo durante cinco minutos, luego drene.", "Calentar el aceite en una sartén. Agregue las semillas de comino y las semillas de mostaza. Cuando hiervan, agregue las hojas de curry, las lentejas, los chiles rojos, la cúrcuma y la cebolla y mezcle bien. Freír durante cinco minutos, luego agregar la sal, el jengibre, las papas, los tomates y las hojas de cilantro y mezclar bien. Transferir a la nevera para enfriar.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la masa, combine las harinas en un tazón grande. Agregue la mantequilla y, con las yemas de los dedos, frótelo en la harina hasta que se asemeje a pan rallado. En una sartén, caliente 200 ml / 7 fl oz de agua, la sal y la grasa hasta que hierva. Vierta el líquido en la mezcla de harina y mezcle con una cuchara de madera.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase hasta obtener una masa homogénea.", "Trabajando lo más rápido posible, tome dos tercios de la masa y divídala en dos. Estirar dos círculos grandes de masa y, utilizando el rodillo para ayudarlo, forrar las latas preparadas.", "Cuchara los rellenos en las latas revestidas de pastelería. Presione hacia abajo y nivele la superficie.", "Usando la masa restante, extienda las tapas de la tarta en una superficie de trabajo ligeramente enharinada.", "Cepille los bordes superiores de la masa en la lata con yema de huevo batida y coloque las tapas de pastelería en la parte superior. Engarce los bordes para sellar y recortar cualquier exceso de masa. Haga un par de hendiduras en la parte superior del pastel para permitir que salga el vapor y cepille la tapa de la masa con la yema de huevo. Use cualquier pastel sobrante para hacer decoraciones para la parte superior del pastel.", "Hornee durante 1 hora o hasta que las partes superiores estén doradas. Deje que se enfríe en las latas durante 10 minutos, luego retírelo de las latas y déjelo enfriar completamente en una rejilla antes de servir."], "url": "www_bbc_co_uk_food_recipes_indian_hot-water_crust_81459", "title": "Patata criada en la India", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_hot-water_crust_81459_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de harina de chapati (disponible en tiendas de comestibles indias y grandes supermercados), más extra para quitar el polvo", "1 cucharadita de sal fina", "½ cucharadita de semillas de comino", "½ cucharadita de copos de chile", "½ cucharadita de semillas de ajwain", "½ cucharadita de cúrcuma", "1½ cucharadita de hojas secas de fenogreco (o un puñado de hojas frescas de alholva, picadas)", "120ml / 4fl oz de agua tibia", "1 cucharada de aceite de girasol", "mantequilla de búfalo o mantequilla sin sal, derretida, para cepillar el pan"], "method": ["Tamiza la harina en un tazón grande y mezcla la sal y las especias.", "En un recipiente aparte, mezcle el agua y el aceite.", "Poco a poco agregue el agua y el aceite a los ingredientes secos en lotes y revuelva hasta que forme una masa suave y firme (es posible que necesite un poco menos o más de agua para lograr esto). Cubra la masa y reserve para probar durante 20 minutos.", "Pese la masa y divídala en seis porciones iguales. Forme cada porción en una bola. Ruede cada bola en harina y, usando un rodillo, ruede en una ronda delgada de aproximadamente 15 cm de diámetro.", "Cubra el roti con una toalla de té húmeda hasta que esté listo para cocinar.", "Caliente una tava o una sartén seca grande a fuego medio y cocine cada chapati por 30 segundos en un lado, para preparar la masa. Voltee y cocine por otro minuto, hasta que aparezcan pequeñas burbujas en la parte superior y aparezcan manchas de color marrón claro debajo. Dé vuelta otra vez y cocine durante 30-40 segundos más. La masa comenzará a hincharse, así que presiona hacia abajo con un paño enrollado para forzar el escape del vapor. Cada vez que presione con la toalla, gire el roti en la sartén para mantenerlo en movimiento sobre la superficie caliente (para evitar quemaduras).", "Transfiera el roti cocido a una toalla de té limpia, cepille ligeramente con ghee derretido o mantequilla sin sal. Envuelva y mantenga cubierto el paño de cocina hasta que esté listo para servir. Repita hasta que todos los roti hayan sido cocinados."], "url": "www_bbc_co_uk_food_recipes_indian_roti_70511", "title": "Pan indio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite vegetal", "un pomo de mantequilla", "2 cucharadas de cebolla finamente picada", "½ tomate pequeño, picado", "¼ chile verde, sin semillas y en rodajas (opcional), o pizca de chile rojo en polvo", "2 huevos, golpeados", "sal al gusto", "1 cucharada de cilantro fresco picado"], "method": ["Caliente el aceite y la mantequilla en una sartén pequeña antiadherente. Agregue la cebolla y fría por unos cuatro minutos, hasta que estén suaves.", "Batir el resto de los ingredientes en un tazón y verter en la sartén y revolver de forma normal. Quítelos del fuego cuando estén cocinados a su gusto. Sirva con tostadas o pan naan."], "url": "www_bbc_co_uk_food_recipes_indianscrambledeggs_86454", "title": "Huevos revueltos indios", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indianscrambledeggs_86454_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.1 litros / 2 pintas de leche entera", "2 cucharadas de arroz de grano largo, como basmati", "4 vainas de cardamomo verde entero, ligeramente trituradas", "2 cucharadas de azúcar", "10 pistachos sin sal", "Para decorar", "vark (plata comestible u hoja de oro, disponible en tiendas de pasteles especializadas o en algunas tiendas de comestibles asiáticas, opcional)", "pistachos extra"], "method": ["Verter la leche en una sartén de base pesada y calentar suavemente (puede precalentar la leche en una jarra en el microondas y luego transferir la leche caliente a la sartén, para ahorrar tiempo, si lo prefiere).", "Agregue las vainas de cardamomo y el arroz a la leche.", "Lentamente lleve a ebullición, baje el fuego y cocine a fuego lento, revolviendo de vez en cuando para evitar que el arroz se pegue al fondo de la sartén. Cocine a fuego lento, revolviendo ocasionalmente, hasta que la leche se reduzca a la mitad; esto puede tomar tanto como 1¼ horas.", "Mientras la leche hierve a fuego lento, corta los pistaches aproximadamente.", "Cuando la leche se haya reducido a la mitad o más, retire y deseche las cápsulas de cardamomo.", "Transfiera el arroz con leche a un recipiente. Agregue el azúcar y el sabor, agregando más azúcar si lo desea más dulce.", "Agregue los pistachos picados, revuelva bien y deje enfriar.", "Cubra el tazón con film transparente y deje enfriar en la nevera durante al menos cuatro horas o durante la noche.", "Cuando esté listo para servir, espárzalos en tazones individuales. Decorar con vark, si se usa.", "Espolvoree unos cuantos más pistachos picados en la parte superior.", "Servir."], "url": "www_bbc_co_uk_food_recipes_indianricepuddingkhe_90219", "title": "Pudín de arroz indio (kheer)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de lomo de cordero", "2 dientes de ajo, aplastados", "100 ml / 3½ fl oz oz yogur", "1 limón, solo jugo", "2 cucharadas de sal masala", "Condimento", "aceite de oliva virgen extra", "1 calabacín, cortado en trozos y a la parrilla", "1 berenjena, cortada en trozos y a la plancha", "1 pimiento rojo, cortado en trozos y a la parrilla", "tarro de jalea de menta", "agua"], "method": ["Combine el ajo, el yogur, el jugo de limón, el garam masala, la sal y la pimienta en un tazón grande.", "Agregue el cordero y revuelva para asegurarse de que todo esté bien cubierto. Cubra con film transparente y refrigere durante al menos 2, pero no más de 24 horas.", "Calentar un poco de aceite en una sartén antiadherente, escurrir el cordero de su adobo y agregarlo a la sartén. Freír por unos 3 minutos por cada lado hasta que estén cocidos. Retire de la sartén y deje reposar.", "Para hacer el aderezo, simplemente bata la gelatina de menta con un poco de agua.", "Para servir - corte el cordero y colóquelo en el centro del plato, coloque las verduras alrededor y rocíe la salsa."], "url": "www_bbc_co_uk_food_recipes_indianspicedlambwith_11591", "title": "Cordero indio con especias con verduras provenzales y salsa de menta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharaditas de jengibre fresco rallado", "2 cucharaditas de ajo picado", "2 cucharaditas de cilantro molido", "2 cucharaditas de comino molido", "1 cucharadita de chile rojo en polvo", "4 cucharadas de hojas de cilantro picado", "4 cucharadas de harina de gramo (besan o harina de garbanzo)", "2 limas, solo jugo", "2 cucharadas de aceite de cacahuete", "4 pequeños cangrejos de caparazón blando", "1 cucharadita de semillas de mostaza negra", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de comino", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de semillas de cilantro", "1 mango verde, pelado y en rodajas", "2 mangos maduros, pelados y en rodajas", "125g / 4½oz de azúcar morena suave", "Vinagre de malta 110ml / 4fl oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los cangrejos, coloque todos los ingredientes, excepto los cangrejos, en un bol y mezcle hasta formar una pasta.", "Agregue los cangrejos y dé vuelta suavemente en la mezcla para cubrir bien. (Lo ideal es dejar durante 30 minutos para infundir los sabores).", "Caliente una sartén a prueba de horno hasta que esté caliente, luego agregue suficiente aceite vegetal para cubrir el fondo de la sartén. Agregue los cangrejos y fríalos durante 2-3 minutos en cada lado, luego transfiéralos al horno y cocínelos durante 8-10 minutos, o hasta que estén completamente cocidos.", "Para la salsa picante de mango, caliente una sartén hasta que esté caliente. Agregue todas las especias y tostadas durante 30 segundos o hasta que las semillas de mostaza comiencen a reventar.", "Agregue el mango verde y los mangos maduros y cocine durante 1-2 minutos.", "Agregue el azúcar y cocine hasta que se disuelva en los jugos de mango, luego agregue el vinagre.", "Cubra la mezcla de mango y reduzca el fuego a fuego lento durante 25 minutos, o hasta que el mango se haya descompuesto y la mezcla se parezca a la salsa picante.", "Coloque la mitad de la mezcla de chutney en un procesador de alimentos y mezcle con un puré, luego regrese a la sartén y mezcle con el chutney restante sin mezclar.", "Vierta la salsa picante en frascos esterilizados y deje enfriar antes de servir.", "Para servir, coloque un cangrejo de caparazón blando en cada plato con una cucharada de chutney de mango al costado."], "url": "www_bbc_co_uk_food_recipes_indianspicedsoftshel_88174", "title": "Cangrejo de concha blanda con especias indias con chutney de mango", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de sal marina fina", "1 cucharadita de cúrcuma molida", "Filetes de pescado blanco de 400 g / 14 onzas, como merluza, jabalí o merlán, sin piel, cortados en trozos grandes", "3-4 cucharadas de aceite vegetal", "1 cucharadita de semillas de mostaza negra", "1 cebolla, pelada, rallada", "10 hojas frescas de curry", "4 tomates maduros, picados", "Jengibre fresco de la raíz de los 2.5cm / 1in, rallado", "1 diente de ajo, pelado, aplastado hasta formar una pasta con el filo de un cuchillo", "1 guindilla verde, finamente picada", "1 cucharadita de sal masala", "200 g / 7 oz crema de coco, rallado", "1-2 cucharadas de agua (según sea necesario)", "arroz basmati, cocinado según las instrucciones del paquete", "puñado de hojas frescas de cilantro"], "method": ["Espolvorea la sal y molida la cúrcuma en un plato. Dragar los trozos de pescado en la mezcla hasta que esté completamente cubierto.", "Calienta 1-2 cucharadas de aceite en una sartén a fuego medio a alto. Agregue las piezas de pescado recubiertas, luego fría durante 2-3 minutos o hasta que estén crujientes, doradas y cocidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Caliente las restantes 1-2 cucharadas de aceite en una sartén por separado. Agregue las semillas de mostaza, cubra la olla con una tapa y fría hasta que empiecen a reventar. (PRECAUCIÓN: Las semillas salpicadas pueden ser peligrosas. Mantenga la sartén lejos de los ojos y la cara).", "Agregue la cebolla y las hojas de curry y continúe freír durante 4-5 minutos más.", "Agregue los tomates, el jengibre, el ajo, el chile y el garam masala y continúe freír, revolviendo bien, durante 3-4 minutos.", "Agregue la crema de coco rallado y revuelva hasta que se disuelva. Llevar la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que la salsa se espese. Agregue 1-2 cucharadas de agua a la mezcla para aflojar la mezcla, según sea necesario.", "Agregue las piezas de pescado frito a la salsa y cocine hasta que se caliente.", "Para servir, cuchara el arroz en cuatro platos para servir. Ponga el curry de pescado encima del arroz y adorne con el cilantro."], "url": "www_bbc_co_uk_food_recipes_indianstylefishcurry_92835", "title": "Curry de pescado al estilo indio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de semillas de mostaza", "2 cucharaditas de semillas de comino", "2 cucharaditas de semillas de cilantro", "1 cucharadita de cúrcuma molida", "½ cucharadita de pimentón dulce ahumado", "1 cucharadita de alholva", "½ cucharadita de canela molida", "½ cucharadita de sal", "2 cucharadas de aceite vegetal", "4 x 175 g / 6 oz de filetes de abadejo, desollados", "2 cucharadas de aceite vegetal", "2 chalotes, en rodajas finas", "1 x 400 g / 14 oz de garbanzos, enjuagados y escurridos", "3 tomates, despellejados, sin semillas, picados", "3 cucharadas de cilantro fresco tostado", "sal y pimienta negra recién molida", "2 limas, descuartizadas, para servir"], "method": ["Para la pasta de especias, caliente una sartén hasta que esté caliente, luego agregue las semillas de mostaza, el comino y las semillas de cilantro y fría hasta que las semillas de mostaza comiencen a reventar.", "Transfiera las especias tostadas a un mazo y mortero y muela hasta obtener un polvo fino.", "Coloque el polvo de especias en un recipiente y agregue los ingredientes restantes de la pasta de especias. Batir para formar una pasta.", "Para el abadejo, precaliente la parrilla a su nivel más alto.", "Tome la mitad de la pasta de especias y frótelo sobre cada filete de pollack. Coloque el abadejo en la bandeja de la parrilla y colóquelo debajo de la parrilla para cocinar durante 3-4 minutos, o hasta que esté recién cocido.", "Mientras tanto, caliente una sartén limpia hasta que esté caliente. Agregue el aceite y los chalotes y fría por 1-2 minutos.", "Agregue la pasta de especias restante y cocine por un minuto.", "Agregue los garbanzos y continúe cocinando hasta que los garbanzos se hayan calentado.", "Agregue los tomates y el cilantro y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque una cucharada grande de la mezcla de garbanzo en cada plato y cubra con un filete de abadejo y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_indianstylepollockwi_88632", "title": "Pollack de estilo indio con garbanzos picantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "250g / 9oz de patatas nuevas", "½ cebolla, picada", "4 dientes de ajo, aplastados", "2 cucharaditas de curry en polvo", "2 cucharaditas de comino molido", "2 cucharaditas de cúrcuma molida", "cilantro fresco, para adornar"], "method": ["Calentar el aceite en una sartén. Agregue las papas nuevas, la cebolla y el ajo y fría por dos minutos.", "Agregue el curry en polvo, el comino y la cúrcuma y fría a fuego alto.", "Cubra la olla con una tapa, reduzca el fuego y cocine de 30 a 35 minutos hasta que las papas estén cocidas.", "Servir en un plato adornado con cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_indianstylesauteedpo_87766", "title": "Patatas salteadas al estilo indio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de harina blanca fuerte, más extra para quitar el polvo", "1½ cucharadita de sal", "1 x 7 g / ¼ onza de levadura seca de acción rápida", "400ml / 14fl oz de agua tibia", "aceite vegetal, para engrasar", "2 ramitas de romero fresco, solo hojas, finamente picadas", "1 cebolla roja, finamente picada", "3 cucharadas de aceite de oliva virgen extra, más extra para cepillar", "½ cucharadita de copos de sal marina"], "method": ["Mezcle la harina, la sal y la levadura juntas en un tazón grande. Agregue el agua tibia y mezcle para formar una masa pegajosa.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase durante cinco minutos, o hasta que la masa esté suave y elástica.", "Engrase ligeramente un recipiente con un poco de aceite vegetal. Coloque la masa en el recipiente y gírela hasta cubrirla con aceite. Cubra el recipiente con film transparente y déjelo a un lado en un lugar cálido durante una hora, o hasta que la masa se haya duplicado.", "Engrase ligeramente dos bandejas para hornear.", "Deje que la masa vuelva a su tamaño original y termine en una superficie de trabajo ligeramente enharinada. Divida la masa en ocho bolas iguales y colóquelas en las bandejas para hornear. Asegúrese de que los rollos estén bien espaciados. Cubra con un paño de cocina y reserve para probar durante 30 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Mezcle el romero, la cebolla y el aceite de oliva en un bol.", "Con un dedo bien enharinado, presione varios agujeros en cada rollo y luego espolvoree la mezcla de romero. Cepille el aceite por los lados de cada rollo y espolvoree sobre los copos de sal marina.", "Hornee en el horno durante 20-25 minutos o hasta que estén bien dorados."], "url": "www_bbc_co_uk_food_recipes_individual_foccacia_02400", "title": "Rollos individuales de focaccia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 8 rollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "Albaricoques 400 g / 14 oz, piedras quitadas", "200 g / 7 oz de azúcar en polvo", "200g / 7oz de mantequilla, sin sal, más extra para engrasar", "2 limones, solo cáscara", "3 huevos de gallinas camperas", "Harina de auto crianza de 200g / 7oz", "50ml / 2fl oz de brandy de albaricoque", "570ml / 1 pinta de natillas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee seis moldes dariole. Corte aproximadamente un tercio de los albaricoques. Reduce a la mitad los albaricoques restantes.", "Caliente el azúcar en una cacerola hasta que comience a caramelizar, agregue las mitades de albaricoque y cocine durante 4-5 minutos, o hasta que se ablanden. Dejar de lado para enfriar.", "Para la base, bata el azúcar, la mantequilla y la ralladura de limón en un bol hasta que estén esponjosos. Poco a poco mezcle los huevos, luego doble la harina. Doble los albaricoques picados crudos.", "Con una cuchara, coloque las mitades de albaricoque caramelizado en el fondo de los moldes de dariole, luego cubra con la mezcla de tortas, cubra con papel de aluminio y transfiéralo a una bandeja grande para hornear. Llene la bandeja de cocción con suficiente agua para llegar hasta la mitad de los moldes (esto se denomina baño maría). Hornee en el horno por 40-50 minutos, o hasta que se levante y dore.", "Para servir, mezcle el brandy de albaricoque y la crema hasta que estén bien combinados. Convierta un budín en cada uno de los seis platos para servir y sirva la crema pastelera al lado."], "url": "www_bbc_co_uk_food_recipes_individual_apricot_35278", "title": "Postre al revés de albaricoque individual", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "2 cucharadas de azúcar glas", "100g / 3½oz de mantequilla sin sal, refrigerada, cortada en cubos de 1cm / ½ en cubitos", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharadita de jugo de limón", "7 manzanas medianas que comen (aproximadamente 1kg / 2lb 4oz), peladas, descuartizadas y sin corazón", "25 g / 1oz de mantequilla sin sal", "75 g / 2½ oz de azúcar en polvo, más extra para quitar el polvo", "1 limón, ralladura finamente rallada solamente", "Calvados 50ml / 2fl oz", "2 cucharadas de mascarpone", "7 peras medianas (aproximadamente 1 kg / 2 lb 4 oz), peladas, descuartizadas y sin corazón", "25 g / 1oz de mantequilla sin sal", "75 g / 2½ oz de azúcar en polvo, más extra para quitar el polvo", "1 limón, ralladura finamente rallada solamente", "50ml / 2fl oz perry", "2 cucharadas de mascarpone", "9 albaricoques (aproximadamente 500 g / lb 2 oz), cortados a la mitad y apedreado", "25 g / 1oz de mantequilla sin sal", "75 g / 2½ oz de azúcar en polvo, más extra para quitar el polvo", "50ml / 2fl oz de amaretto", "2-3 cucharadas de leche, para cepillar", "azúcar granulada, para rociar"], "method": ["Para la masa dulce de pasta corta, mezcle la harina y el azúcar glas juntos en un tazón. Agregue la mantequilla y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "En un tazón o jarra por separado, mezcle el huevo con el jugo de limón y dos cucharadas de agua. Haga un pozo en el centro de la mezcla de harina y vierta la mezcla de huevo. Usando un cuchillo de mesa, coloque el líquido en la harina para unir la masa. Si parece demasiado seco, agrega un poco más de agua. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la película adhesiva y descanse en la nevera durante al menos 15 minutos.", "Para hacer cualquiera de los rellenos, primero corte la fruta en pedazos de 1cm / ½.", "Derrita la mantequilla en una sartén grande o en una sartén profunda a fuego medio. Agregue la fruta, el azúcar, la ralladura de limón (si corresponde) y el alcohol. Cocine a fuego lento durante unos 10 minutos, revolviendo de vez en cuando, hasta que la fruta esté tierna y la mayor parte del líquido se haya evaporado.", "Deje que la mezcla de frutas se enfríe, mezcle el mascarpone (si corresponde) y luego enfríe la mezcla.", "Precalentar el horno a 200C / 400F / Gas 6.", "Sobre una superficie de trabajo ligeramente enharinada, extienda la masa hasta un espesor de 2-3 mm. Con un cortador liso de 8.5cm / 3½ pulgadas, corte 12 círculos y úselos para alinear una bandeja para bollos (del tipo que usaría para pasteles de hadas, no para bandejas para muffins). Vuelve a enrollar la masa según sea necesario y corta 12 círculos más pequeños, de 6 cm / 2½ pulgadas de diámetro, para las tapas.", "Coloque el relleno de fruta en las cajas de pastelería, teniendo cuidado de no llenarlas en exceso. Humedece el borde de la masa con un poco de agua y cubre cada tarta con una tapa. Presione un cortador más pequeño sobre el pastel para sellar el borde y recortar el exceso de masa. Haga un par de pequeños agujeros de vapor en la parte superior de cada pastel.", "Cepille la tapa de la repostería con un poco de leche y espolvoree con azúcar granulada. Hornee por 25-30 minutos, o hasta que la masa esté crujiente y dorada.", "Dejar enfriar en la lata durante cinco minutos antes de quitarlo. Sirva caliente o a temperatura ambiente, dentro de las 24 horas de la cocción (o comenzarán a perder su sabor crujiente)."], "url": "www_bbc_co_uk_food_recipes_individual_fruit_pies_36363", "title": "Pasteles de frutas individuales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 pasteles pequeños", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individual_fruit_pies_36363_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "100g / 3½oz de mantequilla fría, cortada en cubos pequeños", "25g / 1oz de azúcar glas", "1 yema de huevo de gallinas camperas", "4 huevos grandes de gallinas camperas", "100ml / 3½ fl oz crema doble", "150 g / 5½ oz de azúcar en polvo", "3 limones, jugo y ralladura", "azúcar en polvo, para quitar el polvo", "100 g / 3% C2% BDoz% 20plain% 20chocolate% 20 (36%% 20cocoa% 20solids),% 20chopped"], "method": ["Para la masa, coloque la harina, la mantequilla y el azúcar glas en un procesador de alimentos. Pulsar brevemente hasta que la mezcla se asemeje a pan rallado, luego agregar la yema de huevo y una cucharada de agua fría.", "Pulse de nuevo hasta que la mezcla se adhiera en grupos, luego incline sobre una superficie de trabajo y júntela con sus manos. Amasar la masa solo dos o tres veces para convertirla en una bola suave. Envuélvala en una película adhesiva y colóquela en el refrigerador por 15 minutos.", "Engrase las tartaletas acanaladas estriadas de 12 x 7,5 cm.", "Estirar la masa a un grosor de 5 mm / ¼ in. Recorta los círculos con un cortador redondo de 10 cm / 4 in y únelos para revestir las latas, volviendo a enrollar los pasteles según sea necesario. Coloque las cajas de tarta en el refrigerador para enfriar.", "Precalentar el horno a 200C (180C fan) / 400F / Gas 6.", "Cubra la base de las tartaletas con papel de hornear o papel de aluminio y rellene con unos granos para hornear.", "Hornee a ciegas durante siete minutos y luego retire el pergamino y los frijoles.", "Devuelva las cajas de repostería al horno durante otros 4-5 minutos o hasta que estén doradas claras y completamente secas. Déjalo enfriar mientras haces el relleno. Reduzca la temperatura del horno a 170 C (150 ventiladores) / 325 F / Gas 3.", "Para el relleno, rompa los huevos en un tazón grande y mezcle con un batidor de alambre. Agregue el resto de los ingredientes de relleno y bata de nuevo hasta que estén bien combinados. Vierta la mezcla de relleno en una jarra, luego en las cajas de repostería recién horneada. Para evitar que se derrame al entrar al horno, vierta la mayor parte del relleno de manera que casi llene las tartas, coloque con cuidado la bandeja para hornear y las tartas en el estante del horno, luego rellene con el resto del relleno para llenar completamente el tarst .", "Hornee por unos siete minutos, o hasta que esté listo, pero con un leve bamboleo en el centro.", "Deje que se enfríe un poco y luego con cuidado las tartaletas de sus latas y un lugar en una rejilla para enfriar por completo.", "Para la decoración, derrita el chocolate en un tazón sobre una fuente de agua hirviendo. (No permita que el fondo del recipiente toque la superficie del agua).", "Con una cuchara, coloca el chocolate derretido en una pequeña bolsa desechable. Corta el extremo y coloca la palabra \"limón\" o una decoración de tu elección en la parte superior de las tartas."], "url": "www_bbc_co_uk_food_recipes_individual_lemon_92197", "title": "Tartaletas de limón individuales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 tartaletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individual_lemon_92197_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "75g / 3oz de mantequilla", "8 vieiras, huevas retiradas, cortadas por la mitad horizontalmente (más 4 conchas de vieira reservadas y lavadas a fondo)", "Filete de rape 200g / 7oz, cortado, cortado en rodajas de 1cm / ½ en rodajas", "sal y pimienta negra recién molida", "1 chalote de plátano, finamente cortado en cubitos", "½ puerro, solo parte blanca, finamente picado", "75ml / 3fl oz de vino blanco", "75ml / 3fl oz de caldo de pescado", "Crema doble 75ml / 3fl oz", "4 cucharadas de guisantes", "2 cucharadas de perifollo fresco picado", "2 yemas de huevo de gallinas camperas, ligeramente batidas", "Hojas de espinaca bebé 400 g / 14 oz", "50 ml / 2 fl oz de agua", "pizca de nuez moscada rallada"], "method": ["Tamiza la harina en una superficie de trabajo y haz un pozo en el medio. Agregue la mantequilla y la sal al pocillo y trabaje con las yemas de los dedos de una mano, dibujando gradualmente la harina en el centro con la otra mano. Cuando los cubos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulada, agregue gradualmente 125 ml / 4½ fl oz de agua helada y mezcle hasta que estén bien combinados.", "Haga rodar la masa en forma de bola, envuélvala en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Enharine la superficie de trabajo y extienda la masa en un rectángulo de 40cm x 20cm / 15in x 7½in.", "Dobla un tercio de la masa hacia el centro, luego dobla el otro tercio en la parte superior. Empuje los bordes de la masa con el rodillo para sellar.", "Gire la pastelería un cuarto de vuelta. Voltee los pasteles de nuevo a 40cm x 20cm / 15in x 7½in rectangle y dóblelos de la misma manera que arriba. Enfriar en la nevera durante 30 minutos.", "Repita el proceso de laminación y plegado dos veces más para obtener cuatro rollos y pliegues en total. Envuelva la masa en una película adhesiva y deje enfriar en la nevera durante al menos 30 minutos.", "Para el llenado, precaliente el horno a 225 C / 450 F / Gas 8.", "Calentar una sartén hasta que esté caliente, agregar un poco de la mantequilla y calentar hasta que se forme espuma.", "Agregue las vieiras y freír durante 5-10 segundos en cada lado, luego retire de la sartén y déjelas a un lado en un plato. Agregue las rodajas de rape a la sartén y cocine durante 5-10 segundos en cada lado. Retirar de la sartén y reservar en un plato. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la mantequilla restante, el chalote y el puerro a la sartén que se usa para cocinar las vieiras y el rape y fría durante 2-3 minutos. Desglasar la sartén con el vino blanco y cocinar hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el caldo de pescado y cocine por un minuto más.", "Agregue la crema y lleve la mezcla a ebullición, luego agregue los guisantes y cocine hasta que se caliente.", "Agregue el perifollo y condimente, al gusto, con sal y pimienta negra recién molida. Coloque un poco de la mezcla en cada concha de vieiras, cubra con las vieiras y el rape y luego espolvoree un poco más de salsa. Dejar de lado para enfriar.", "Mientras tanto, enrolle la masa sobre una superficie ligeramente enharinada a un grosor de 0.5cm / ¼, luego corte cuatro pedazos de masa lo suficientemente grandes como para cubrir las conchas con un borde de 2cm / 1 pulg.", "Cepille el borde de cada concha de vieiras con un poco del huevo batido. Coloque la masa suavemente sobre la parte superior de la cubierta llena y presione hacia abajo alrededor de los bordes para crear un sello.", "Cepíllese con el resto del baño de huevo y luego marque ligeramente la parte superior con un cuchillo para decorar.", "Coloque las conchas de vieiras en una bandeja para hornear en el horno y hornee durante 15-20 minutos, o hasta que estén doradas y la pasta esté bien cocida.", "Mientras tanto, para la espinaca, caliente una sartén hasta que esté caliente, agregue la mantequilla restante, las espinacas y el agua y fría por un par de minutos, o hasta que se marchite. Sazonar con sal, pimienta negra recién molida y nuez moscada.", "Para servir, espolvorea un poco de espinaca en el centro de los platos para servir y coloca una tarta de concha de vieira en la parte superior."], "url": "www_bbc_co_uk_food_recipes_individual_scallop_and_36485", "title": "Empanadas individuales de vieiras y rape", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Manzanas de 300g / 10½oz, peladas, sin núcleo, rebanadas", "125 g / 4½ oz de azúcar en polvo, más extra para quitar el polvo", "1 cucharada de licor de mora", "Moras 200g / 7oz", "1 paquete de hojaldre listo para enrollar, cortado en ocho a doce rectángulos de 6 pulgadas x 4 pulgadas / 15cm x 9 pulgadas", "2 huevos de gallinas camperas, golpeados", "helado de vainilla, para servir"], "method": ["Coloque las manzanas en rodajas en una sartén con el licor de azúcar y moras y cocine suavemente a fuego medio durante 5-6 minutos, o hasta que las manzanas se ablanden. Dejar de lado para enfriar, luego mezclar las moras.", "Precalentar el horno a 180C / 355F / Gas 4.", "Divida la mezcla de manzana y mora, dejando a un lado los jugos, entre cuatro de los rectángulos de hojaldre, dejando un borde de 2 cm / 1 pulgada alrededor de los bordes de la masa.", "Con un cortador de celosía, pase las piezas restantes de hojaldre o, alternativamente, use un cuchillo afilado para cortar las ranuras de 2 cm / 1 pulgada en filas escalonadas a 1 cm / ½ pulgada. Tire suavemente de la masa para que las ranuras se abran y se muestre una forma de celosía.", "Cepille los bordes de la capa de repostería llena con el huevo batido, luego coloque con cuidado la capa de pasta cortada en celosía en la parte superior. Selle los bordes presionando hacia abajo, luego cepille todo el pastel con el huevo batido. Espolvorea un poco de azúcar impalpable y hornea los pasteles durante 20 minutos, o hasta que la masa esté dorada e hinchada.", "Sirve los pasteles calientes con helado."], "url": "www_bbc_co_uk_food_recipes_individualappleandbl_92217", "title": "Pasteles de moras y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individualappleandbl_92217_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de pasta de copos tiernos listos para usar, enrollados a 5 mm / ¼ de grosor", "2 huevos de gallinas camperas", "pizca de sal", "20 g / oz de mantequilla, derretida", "Jarabe dorado de 200g / 7oz", "75g / 3oz de azúcar mascabado oscuro", "½ cucharadita de extracto de vainilla", "Mitades de pacana 150g / 5oz", "helado de vainilla, para servir"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Línea seis cajas de tarta individuales con la pastelería dulce y enfriar durante 30 minutos.", "Coloque las cajas de tarta con revestimiento de pastelería en una bandeja para hornear. Línea de cada uno con pergamino para hornear y luego agregue frijoles para hornear o arroz crudo. Coloque en el horno y hornee a ciegas durante 15 minutos.", "Retire del horno y retire cuidadosamente el pergamino para hornear y hornear frijoles o arroz. Regrese las tartas al horno por otros cinco minutos o hasta que estén doradas.", "Mientras tanto, rompe los huevos en un bol y bate.", "Agregue una pizca de sal, mantequilla derretida, jarabe dorado, azúcar mascabado y extracto de vainilla y agítelos hasta que estén completamente combinados y suaves.", "Vierta esta mezcla en las cajas de repostería, llenando hasta justo debajo del borde de la masa.", "Divida las mitades de nuez de forma pareja entre cada tarta, colocándolas en un patrón circular en la parte superior de cada una.", "Coloque en el horno y hornee por 10-12 minutos hasta que el relleno esté listo.", "Retirar y dejar enfriar durante diez minutos.", "Sirva en platos individuales con una bola de helado de vainilla al lado."], "url": "www_bbc_co_uk_food_recipes_individualpecanpies_87266", "title": "Pasteles de pacanas individuales", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "100 g / 3½ oz de azúcar en polvo", "225 g / 8 oz de mantequilla, a temperatura ambiente", "100 g / 3½ oz de sémola", "25g / 1 oz de azúcar demerara", "Fresas de 500 g / 1 lb 1½ oz, más extra para decorar", "1½ cucharada de puerto", "2 cucharadas de azúcar en polvo", "Crema doble de 300 ml / 10½ fl oz, batida a picos suaves", "300ml / 10½fl oz de espesor, yogurt natural", "2 claras de huevo, batidas a picos duros", "fresas extra, para adornar"], "method": ["Precaliente el horno a 160 ° C / 320 ° F / Gas 2. Coloque la harina, el azúcar en polvo, la mantequilla y la sémola en un procesador de alimentos y procese hasta que la mezcla esté bien combinada y se una para formar una masa. Esto también se puede hacer a mano, frotando la mantequilla con la harina primero, luego agregando el azúcar y la sémola y trabajando los ingredientes para formar una bola.", "Ruede la masa sobre una superficie enharinada a 1-2 cm / ½ pulgada de espesor. Usando un cortador de galletas circular o la parte superior de un vaso para beber, corte la masa en círculos. Coloque los círculos en una lata ligeramente engrasada y espolvoree la parte superior con el azúcar demerara.", "Hornee durante 30-40 minutos, hasta que la torta sea dorada pálida y cocida. Vigílala en caso de que se ponga demasiado marrón. Deje que la torta se enfríe durante unos minutos, luego levante con cuidado cada torta con una pequeña espátula y colóquela en una rejilla para que se enfríe por completo. (Estos pueden ahora almacenarse en un recipiente hermético).", "Mientras tanto, haz el relleno. Coloque las fresas, el puerto y el azúcar en una sartén y caliéntelo suavemente hasta que el azúcar se disuelva, revolviendo y machacando las fresas en una salsa gruesa. Dejar enfriar.", "Dobla la crema batida doble, el yogur y la clara de huevo batida.", "Dobla la salsa de fresa, dejando espirales.", "Coloque un círculo de torta dulce en un plato pequeño y colóquelo sobre una gran porción de crema de fresa.", "Coloque una fresa entera encima de cada cucharada y sirva."], "url": "www_bbc_co_uk_food_recipes_individualstrawberry_72325", "title": "Shortcakes individuales de fresas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/individualstrawberry_72325_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frutas de verano de 1.8kgs / 4lbs: fresas, frambuesas, moras, grosellas rojas y negras", "570ml / 1 pinta de agua", "285g / 10oz de azúcar en polvo", "20 rebanadas grandes de pan blanco fino ligeramente rancio, sin costras", "selección de frutas de verano (fresas pequeñas, arándanos, frambuesas, grosellas, moras)", "ramitas de menta fresca", "azúcar glasé al polvo"], "method": ["Línea 10 timbales con pedazos de película adhesiva, o use tazas de té sin película adhesiva.", "Revisa la fruta y quita todos los tallos y manchas.", "Coloque el agua y el azúcar en una olla grande y deje que hierva.", "Agregue las frutas más firmes y ácidas, primero dejando las fresas y las frambuesas hasta el final. Llevar a ebullición y cocine a fuego lento durante 5-10 minutos. La grosella y las grosellas negras deberían comenzar a reventar levemente. Pruebe la fruta y agregue más azúcar en polvo si es necesario.", "Escurra la fruta en un colador grande y guarde el jugo. Permita que la fruta se enfríe.", "Ahorre la mitad del jugo para sumergir el pan. Vuelva a colocar el jugo restante en la sartén y reduzca hasta que esté ligeramente almibarado, déjelo aparte para la salsa.", "Cuando la fruta esté fría, comience a preparar los postres de verano.", "Corte 10 de las rebanadas de pan por la mitad y luego cada mitad en 4 triángulos.", "De las otras 10 rebanadas, corte 2 discos de cada rebanada de pan, 1 pequeño para la base y uno grande para la parte superior del pudin.", "Sumerja el pan, unas pocas piezas a la vez, en el jarabe más fino y alinee los timbales. Coloque el pequeño círculo en la parte inferior y los triángulos alrededor de los lados del timbal. Llene cada timbal con la mezcla de frutas y use el círculo más grande para cubrir el budín. Envuelva la película adhesiva y cubra el timbal. Coloque en una bandeja y cuando todos los postres estén listos ponga otra bandeja en la parte superior con un peso de algún tipo para presionar los postres.", "Enfríe durante al menos un par de horas y sirva con la salsa reducida y las bayas frescas de verano. Espolvorea las bayas frescas con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_individualsummerpudd_6972", "title": "Postres de verano individuales con bayas de verano", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]