[{"ingredients": ["4 filetes de caballa, deshuesada", "1 cebolla roja, finamente rebanada", "1-2 chiles verdes, finamente picados", "2 cucharadas de cilantro micro, más extra para decorar", "2 cucharadas de aceite de oliva", "½ cebolla, picada", "2 palitos de apio picados", "1 zanahoria, picada", "1 manzana, picada", "2 cucharadas de cilantro fresco finamente picado", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "2 cucharaditas de polvo de curry mediano", "½ cucharadita de cúrcuma molida", "500ml / 18fl oz de caldo de pescado", "1 x 150 g de crema de coco y estaño", "Harina de 400g / 14oz para aumentar la temperatura, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "300 ml / 10 fl oz oz yogur", "1 cucharada de aceite de oliva", "8 filetes de anchoa en aceite de oliva, escurridos y finamente picados", "2 dientes de ajo, finamente picados", "150g / 5½oz de mantequilla sin sal", "2 cucharadas de cilantro finamente picado"], "method": ["Para el sambal, mezcle la cebolla, los chiles y el cilantro y reserve.", "Para la crema de curry, caliente el aceite en una sartén mediana a fuego medio y fría a fuego lento las verduras, la manzana, los tallos de cilantro y las especias durante unos minutos hasta que estén suaves. Agregue el caldo y la crema de coco, lleve a ebullición y cocine a fuego lento durante 2-3 minutos.", "Blitz la mezcla en una licuadora, pase a través de un colador, reservar la crema en un recipiente debajo y mantener caliente.", "Para hacer los panes planos, mezcle la harina, el polvo de hornear, el yogur y el aceite y amasar hasta que se forme una masa suave (es posible que deba agregar un poco de agua si la masa está demasiado seca). Divida la masa en cuatro porciones iguales y extienda sobre una superficie enharinada a aproximadamente 1 cm / ½ pulgada de espesor.", "Caliente una sartén a fuego medio y repare los panes planos durante 2-3 minutos en cada lado, hasta que estén ligeramente dorados.", "Mientras tanto, caliente el aceite en una sartén y fría los filetes de caballa durante 2-3 minutos en cada lado, o hasta que estén cocidos.", "Derretir la mantequilla, luego mezclar con las anchoas, el ajo y las hojas de cilantro. Cepille la mezcla sobre los panes calientes.", "Para servir, vierta la crema de curry en el fondo de los cuatro tazones de servir y espolvoree sobre el sambal. Cubra con la caballa y el cilantro micro y sirva con los panes planos."], "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_25452", "title": "Caballa frita con crema de curry y panes de cilantro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla roja, finamente picada", "1 cebolla, finamente picada", "1 bulbo de hinojo, picado", "1 berenjena, picada", "2 tallos de apio, en rodajas", "1 cucharada de puré de tomate", "Alcaparras 50 g / 2 oz", "50 g / 2oz de pasas, remojadas en 50 ml / 2 fl oz de vinagre de vino tinto y escurridas", "25 g / 1 oz de piñones, tostados", "½ pimiento rojo, finamente picado", "sal y pimienta negra recién molida", "4 x filetes de caballa", "2 cucharadas de aceite vegetal", "100 ml / 3½ fl oz de salsa de soja ligera", "2 naranjas, en jugo y zested", "150 ml / 5 fl oz runny miel", "1 chile rojo, finamente picado"], "method": ["Para la caponata, calentar el aceite de oliva en una sartén y freír las cebollas, el hinojo, la berenjena y el apio durante siete minutos. Agregue el puré de tomate y fría por otros dos minutos.", "Retire la mezcla del fuego y colóquela en un recipiente. Agregue las alcaparras, las pasas, los piñones, la pimienta, la sal y la pimienta negra recién molida. Mezcle hasta que esté bien combinado.", "Frote la caballa con aceite y coloque el lado de la piel hacia abajo en una sartén caliente. Freír a fuego medio durante 2-3 minutos por cada lado. Retire y reserve para drenar en papel de cocina.", "Para la salsa, coloque todos los ingredientes en una sartén. Revuelva a fuego lento hasta que se caliente.", "Para servir, divide la caponata entre cuatro platos. Coloque una pieza de caballa en cada una y cubra con la salsa."], "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_85442", "title": "Caballa frita con caponata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_mackerel_with_85442_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de garbanzo 150 g / 5½ oz", "sal y pimienta negra recién molida", "1 cucharadita de hojas de tomillo", "100 g / 3½ oz de aceite de oliva virgen extra", "aceite de oliva, para freír", "50ml / 1¾fl oz de aceite de oliva", "100 g / 3½ oz de mantequilla, más otra perilla para freír ceps", "Chalotes de 200 g / 7 oz, finamente cortados en cubitos", "1 diente de ajo entero sin pelar, roto", "2 ramitas de tomillo", "100 g / 3½ oz de gammon cocido, finamente cortado en cubitos", "500 g / 1 libra 2 oz de champiñones frescos, aproximadamente en cubos", "1 cucharada de perejil fresco picado", "aceite de oliva virgen extra, para lloviznar", "12 mejillas de rape", "Harina normal de 25g / 1oz", "aceite de oliva, para freír"], "method": ["Para los panqueques, tamiza la harina de garbanzo en un tazón. Sazonar con sal y pimienta y agregar las hojas de tomillo recogidas.", "Agregue 500g / 1lb 2oz de agua tibia y el aceite de oliva al tazón y agítelo para hacer una mezcla. Cubra y deje reposar en la nevera, idealmente durante 48 horas, antes de usar.", "Para la fricassée, caliente una sartén grande. Caliente el aceite y la mantequilla y agregue los chalotes, el ajo y el tomillo.", "Cuando la chalota y el ajo se hayan ablandado, agregue el gammon a la mezcla de chalote. Retire y deseche el ajo y el tomillo. Deja la fricassée a un lado.", "Para el rape, espolvorea el pescado en la harina. Calentar una pizca de aceite y freír el pescado por ambos lados hasta que tenga un color rubio.", "Para los panqueques, caliente una sartén antiadherente con un poco de aceite y agregue un cucharón de la mezcla de garbanzo. Freír suavemente hasta que esté crujiente en un lado, luego voltear y repetir en el otro lado. Retire los panqueques y reserve. Repita para agotar toda la masa.", "Para terminar la fricassée, calentar un poco de aceite y un poco de mantequilla. Freír los ceps hasta que estén dorados. Sazonar con sal y pimienta negra recién molida.", "Para servir, revuelva los ceps cocidos y el perejil picado en la fricassée. Coloque un panqueque en cada uno de los cuatro platos y ponga la fricassée sobre el panqueque. Rocíe un poco de aceite de oliva virgen extra sobre la parte superior y sentarse las mejillas de rape en la parte superior."], "url": "www_bbc_co_uk_food_recipes_pan-fried_monkfish_68204", "title": "Mejillas de rape fritas, ceps 'paysanne' y farinata de garbanzo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 faisanes enteros jóvenes (preferiblemente gallinas)", "2 cucharadas de sal marina triturada", "340g / 12oz grasa de ganso", "2 dientes de ajo, pelados, aplastados", "1 cucharada de sal masala", "1 ramita de canela", "2 hojas de laurel", "½ cucharadita de granos de pimienta negros enteros", "1 cucharada de aceite de oliva", "1 cebolla pequeña, más o menos picada", "1 tallo de apio, aproximadamente picado", "1 zanahoria, más o menos picada", "2 ramitas de tomillo fresco", "1 litro / 1¾ pintas de caldo de pollo caliente", "500g / 1lb 2 oz de patatas harinas como Maris Piper, peladas y cortadas en trozos de tamaño uniforme", "1 yema de huevo de gallinas camperas", "50g / 2oz de mantequilla", "pizca de nuez moscada recién rallada", "½ cucharadita de pimienta blanca", "2 cucharadas de crema doble", "1 cebolla pequeña, pelada, finamente picada", "1 tallo de apio, cortado, finamente picado", "1 zanahoria, pelada, finamente picada", "Harina normal de 25g / ¾oz", "Colinabo 200g / 7oz, pelado, cortado en dados de 2cm / ¾in", "200g / 7oz de zanahorias, peladas, cortadas en dados de 2cm / ¾in", "200g / 7oz de papas harinosas, como Maris Piper, peladas, cortadas en dados de 2cm / ¾in", "½ cubo de caldo de verduras", "Mantequilla de 25g / ¾oz", "sal y pimienta negra recién molida", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 ramitas de tomillo fresco", "2 cucharadas de jalea de grosella"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Corta los pechos y las piernas de los faisanes, reservando los cadáveres para el caldo. (Puede pedirle a su carnicero que haga esto por usted).", "Para el confitado, coloque las patas de faisán en un recipiente no metálico y espolvoree con la sal. Reserve por al menos 20 minutos y hasta una hora.", "Cepille la sal de las patas de faisán y transfiéralas a un plato pequeño a prueba de horno. Verter sobre la grasa de ganso y agregar el ajo, el garam masala, la ramita de canela, las hojas de laurel y los granos de pimienta. Mueva las patas del faisán en la grasa para asegurarse de que estén completamente cubiertas.", "Cubra el plato con papel de aluminio y cocine las patas de faisán durante 2-2½ horas, o hasta que la carne se caiga del hueso. Retire del horno.", "Retire las patas de faisán de la grasa de ganso, reservando la grasa de ganso. Cuando las patas del faisán estén lo suficientemente frías para manipularse, retire la carne del hueso, descartando cualquier piel y tendones.", "Mientras las patas de los faisanes se cocinan, haga el caldo. Para el caldo, corte los cadáveres de faisán reservados en trozos más pequeños usando un cuchillo afilado grande o un cuchillo de carne.", "Caliente el aceite de oliva en una cacerola a fuego medio. Agregue los cadáveres de faisán, la cebolla, el apio y la zanahoria y fríalos por 3-5 minutos, o hasta que estén dorados. Agregue el tomillo y el caldo de pollo y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante una hora, rozando la espuma que se acumula en la superficie del líquido a intervalos regulares.", "Retire el caldo del fuego y cuele a través de un tamiz fino forrado con una pieza de muselina, reservando el líquido filtrado en una olla limpia. Dejar de lado.", "Cuando el producto confitado y el caldo se hayan cocinado, aumente la temperatura del horno a 200C / 400F / Gas 6.", "Para la tarta del guardabosque, ponga a hervir un sartén grande de agua salada, agregue las papas y hierva durante 15-20 minutos, o hasta que estén tiernas. Escurrir bien y machacar bien.", "Batir la yema de huevo, la mantequilla, la nuez moscada, la pimienta blanca y la crema en el puré de patatas hasta que estén bien combinados. Dejar de lado.", "Caliente una cucharada de la grasa de oca reservada en una sartén a fuego medio. Agregue la cebolla, el apio y la zanahoria y cocine por 2-3 minutos, o hasta que las verduras se ablanden pero no se coloreen.", "Agregue la carne de pierna de faisán y espolvoree sobre la harina. Continúe cocinando durante dos minutos, luego vierta 200 ml / 7 fl oz de la cepa colada. Deje hervir a fuego lento y continúe cocinando a fuego lento durante 3-4 minutos, luego retire la sartén del fuego y déjela enfriar.", "Engrase cuatro moldes para muffins o moldes grandes con más grasa de ganso reservada.", "Usando una manga pastelera o una cuchara, llene cada molde para muffins con puré de papa, dejando a un lado la puré de papa.", "Haga un pozo en medio del puré de papa y llénelo con la mezcla de faisán. Cubra cada pastel con el puré de patatas restante. Cocine en el horno por 30 minutos.", "Mientras tanto, para el puré, coloque el colinabo, las zanahorias y las patatas en una olla grande. Agregue el cubo en existencia y cubra el contenido del recipiente con agua. Ponga a hervir el agua, reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine a fuego lento durante 15-20 minutos, o hasta que las verduras estén tiernas. Escurrir bien y machacar bien con la mantequilla. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para los pechugas de faisán y la salsa de grosella, mantenga la temperatura del horno a 200C / 400F / Gas 6. Sazone las pechugas de faisán con sal y pimienta negra recién molida y corte los huesos del ala del exceso de carne o tendones.", "Caliente el aceite de oliva y una cucharada sopera de la grasa de oca reservada en una sartén resistente al horno de base pesada. Agregue las ramitas de tomillo, luego agregue los pechos de faisán, con la piel hacia abajo. Freír durante 2-3 minutos, o hasta que la piel se dore, luego voltee y cocine por otros dos minutos en el otro lado.", "Transfiera la sartén al horno y tueste durante 6-7 minutos o hasta que esté cocida a su gusto. Retire la sartén del horno y transfiera los pechugas de faisán a un plato caliente para descansar.", "Regrese la sartén a fuego medio a alto. Agregue el caldo colado restante y hágalo hervir, raspando los trozos dorados desde el fondo de la sartén con una cuchara de madera, para desglasar. Reduzca el fuego hasta que el caldo esté hirviendo a fuego lento, luego cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad. Agregue la mermelada de grosella.", "Para servir, retire con cuidado los pasteles del guardabosques de las latas de panecillos con un cuchillo redondo. Coloque uno en el centro de cada uno de los cuatro platos. Coloque una quenelle de puré al lado y coloque un pecho de faisán en el otro lado. Cuchara sobre la salsa de grosella."], "url": "www_bbc_co_uk_food_recipes_pan-fried_pheasant_71343", "title": "Pechuga de faisán pan-fried con pastel de gamekeeper", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 remolachas bebé crudas, hojas en", "1 cucharada de aceite de oliva", "1 chalote, finamente cortado en cubitos", "150 g / 5½ oz de champiñones silvestres, limpios y recortados", "90 g / 3¼ oz de castañas cocidas", "3 cucharadas de hojas de apio", "75g / 2¾oz de hojas de ensalada mixta de invierno", "1 cucharadita de mostaza Dijon", "2 cucharadas de vinagre de jerez", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 patata grande para hornear, cortada en chips de juego", "aceite vegetal, para freír", "4 pechos de paloma", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla"], "method": ["Para la ensalada, coloque la remolacha en una cacerola y cúbrala con agua. Llevar a ebullición a continuación, reduzca el fuego y cocine a fuego lento durante 20-25 minutos hasta que la remolacha esté tierna. Escurrir y cortar la remolacha en cuartos a lo largo.", "Caliente una sartén hasta que esté caliente, luego agregue el aceite y las chalotas y cocine suavemente durante dos minutos hasta que se ablanden.", "Agregue los champiñones y fríalos durante dos minutos más hasta que los champiñones estén tiernos. Incline la mezcla en un tazón grande y luego agregue las castañas, el apio y las hojas de ensalada.", "Batir la mostaza, el vinagre y el aceite de oliva virgen extra juntos y sazonar con sal y pimienta negra recién molida.", "Coloque el aceite vegetal en una olla profunda y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Alternativamente, caliente una freidora a 190 ° C / 375 ° F.", "Con cuidado, coloque las papas fritas en el aceite caliente y fríaselas durante 1-2 minutos hasta que estén doradas. Retirar del aceite con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con sal y pimienta negra recién molida.", "Para la paloma, precalentar el horno a 200C / 400F / Gas 6. Sazonar la pechuga de paloma con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno hasta que esté caliente, luego agregue el aceite de oliva y la mantequilla. Cocine las pechugas de paloma, con la piel hacia abajo, durante un minuto hasta que estén doradas, luego voltee y cocine por otro minuto. Transfiera la sartén al horno y tueste durante tres minutos.", "Retire la sartén del horno y déjela reposar durante cinco minutos, rociándola de vez en cuando con los jugos de la sartén.", "Para servir, mezcle los cuartos de remolacha en la ensalada y vístalos con el aderezo. Espolvoree la paloma en rodajas gruesas y agregue a la ensalada. En el último minuto, agregue las fichas del juego y mezcle ligeramente para combinar."], "url": "www_bbc_co_uk_food_recipes_pan-fried_pigeon_breast_76424", "title": "Ensalada de pechuga de paloma, hongos silvestres y remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes grandes de solla, desollados y deshuesados", "sal, condimentar los pescados", "3 cucharadas de harina común", "75g / 3oz de mantequilla", "115 g / 4 oz de samphire", "115 g / 4 oz de carne de cangrejo blanco, recogido", "2 cucharadas de alcaparras finamente picadas", "2 cucharadas de perejil de flatillo finamente picado", "1 cucharada de cebollines finamente picados", "1 cucharada de perifollo finamente picado", "2 huevos duros, finamente picados", "3-4 cucharadas de aceite de oliva virgen extra", "½ limón, solo jugo, al gusto", "25g / 1oz de mantequilla", "1 chalote, finamente cortado en cubitos", "1 diente de ajo, finamente cortado en cubitos", "75g / 3oz de carne de cangrejo marrón, pasada por un tamiz fino", "75ml / 2½fl oz de vino blanco", "3 cucharadas de mayonesa"], "method": ["Sazone la solla con un poco de sal y luego espolvoréela con la harina.", "Caliente una sartén hasta que esté caliente, agregue la mitad de la mantequilla y los filetes de solomillo, con la presentación hacia abajo y cocínelos durante 1- 1 ½ minutos hasta que estén cocidos, luego voltéelos y cocínelos por otros 45 segundos.", "Retire de la sartén y descanse por un par de minutos.", "Calentar una sartén hasta que esté medianamente caliente, agregar la mantequilla restante y el hinojo y saltear durante 2-3 minutos hasta que estén tiernas.", "Para el cangrejo blanco, coloque todos los ingredientes, excepto el aceite de oliva y el jugo de limón, en un bol y mezcle bien para combinar.", "Agregue suficiente aceite de oliva para que la mezcla se mantenga unida si se presiona ligeramente en una quenelle.", "Verifique el condimento y agregue un poco de jugo de limón si es necesario.", "Para el cangrejo marrón, caliente una sartén hasta que esté medio caliente, agregue la mantequilla, los chalotes y el ajo y sude por 2-3 minutos hasta que se suavice.", "Agregue la carne de cangrejo marrón tamizada, mezcle bien para combinar y luego agregue el vino blanco y cocine a fuego lento.", "Cocine por un minuto hasta que se reduzca, luego retire del fuego y mezcle con la mayonesa.", "Compruebe el condimento y agregue sal y pimienta negra recién molida al gusto.", "Para servir, amontone un poco de samphire en el centro de cada plato y luego cubra con un filete de solla.", "Forme una quenelle de la carne de cangrejo blanca y colóquela encima de la solla. Rocíe la salsa de cangrejo marrón alrededor del borde del plato."], "url": "www_bbc_co_uk_food_recipes_pan-fried_plaice_with_57647", "title": "Solla frita con cangrejo y samphire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 puerros, cortados y cortados en rodajas de aproximadamente 2 cm / ¾ de espesor", "1 cucharada de mantequilla", "llovizna de aceite", "1 cucharadita de caldo de caldo vegetal", "1 x 400 g / 14 oz pueden flageolet frijoles, drenados y enjuagados", "1 filete de cerdo británico grande, cortado en medallones", "sal marina y pimienta negra recién molida", "1 pequeño botón de mantequilla", "llovizna de aceite", "splash Calvados u otro brandy de manzana", "5 cucharadas de jugo de manzana", "3-4 hojas de salvia, finamente trituradas, más hojas enteras para adornar", "1 cucharada de mostaza de Dijon granulada", "1 diente de ajo, aplastado", "4 cucharadas de crema doble"], "method": ["Para los puerros y los frijoles, en una sartén poco profunda, fríe con cuidado los puerros en la mantequilla y el aceite, agregando un chorrito de agua y el caldo de verduras en polvo cuando empiecen a chisporrotear. Cubra la olla con una tapa y, cuando los puerros estén casi cocidos (aproximadamente 10 minutos), agregue los frijoles. Vuelva a colocar la tapa en la sartén y cocine por otros minutos, dando a la sartén un buen batido de vez en cuando, hasta que los frijoles se hayan calentado y los Ieeks estén tiernos.", "Mientras tanto, para el cerdo, sazone el cerdo con sal y pimienta negra recién molida. Caliente la mantequilla y el aceite en una sartén grande a fuego medio-alto y, cuando la mantequilla esté espumante, agregue los medallones a la sartén y dore durante 2-3 minutos por cada lado (puede necesitar hacer esto en tandas para evitar la sobrepoblación de la sartén). Transfiera cada lote de carne de cerdo a un plato caliente.", "Desglasar la sartén vertiendo Calvados seguido por el jugo de manzana y raspando los trozos quemados del fondo de la sartén con una cuchara de madera. Llevar la mezcla a ebullición, dejar que burbujee durante un minuto aproximadamente para que se reduzca un poco, luego agregar la salvia, la mostaza, el ajo y la crema. Devuelva los medallones de cerdo a la sartén, junto con los jugos que haya recogido en el plato, y continúe cocinando en la salsa durante otros 2 o 3 minutos, o hasta que el cerdo esté bien cocido.", "Para servir, coloque un montón de puerros y frijoles en cada plato, coloque los medallones de cerdo encima y ponga la salsa. Adorne con todas las hojas de salvia."], "url": "www_bbc_co_uk_food_recipes_pan-fried_pork_31392", "title": "Medallones de cerdo fritos con puerros y frijoles flagelados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz mejillones", "1 cucharada de aceite de oliva", "1 cebolla picada", "pequeño racimo de perejil picado", "sal y pimienta negra recién molida", "225ml / 8fl oz de vino blanco", "50g / 1¾oz de mantequilla", "1 cebolla, cortada en cubitos", "1 zanahoria mediana, cortada en cubitos", "1 apio, cortado y cortado en cubitos", "1 cucharadita de polvo de curry mediano", "150ml / 5fl oz de crema doble", "Papas de 115g / 4oz, peladas y cortadas en cubitos", "1 cucharada de cebollino picado", "½ limón, solo jugo", "4 x 125g / 4½oz pedazos de filete de salmón, piel en", "2 cucharadas de aceite vegetal"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Frote los mejillones, retire las barbas y deseche los mejillones que permanecen abiertos cuando se golpean contra el costado del fregadero.", "Caliente el aceite de oliva en una sartén grande de base pesada que tenga tapa. Agregue la cebolla y el perejil y cocine suavemente hasta que la cebolla esté suave pero no dorada.", "Agregue los mejillones, sal y pimienta negra recién molida y el vino blanco. Ponga a hervir el vino, ponga la tapa y sacuda los mejillones. Deje la sartén al fuego y cocine durante 3-5 minutos o hasta que los mejillones estén abiertos. Deseche cualquier que permanezca cerrado.", "Cuele los mejillones y reserve, reservando el licor de cocina. Vierta el licor a través de un tamiz fino en una jarra limpia para eliminar la arena.", "Para la salsa, derrita la mantequilla en una cacerola a fuego lento. Cocine con cuidado la cebolla, la zanahoria y el apio hasta que estén suaves. Agregue el polvo de curry y continúe cocinando durante unos minutos.", "Agregue 150ml / 5fl oz del licor de cocción de los mejillones, revuelva bien y cocine por otro minuto. Agregue la crema doble, vuelva a hervir y luego agregue las papas en cubitos y cocine durante unos cinco minutos o hasta que las papas se hayan ablandado.", "Retire los mejillones de sus caparazones, agréguelos a la mezcla de crema y caliente. Termine la salsa con el cebollino picado y sazone con sal y pimienta negra recién molida y exprima el jugo de limón.", "Para el salmón, lava el pescado y sécalo bien. Con un cuchillo afilado, corte barras diagonales en la piel y sazone con sal y pimienta negra recién molida.", "Caliente una sartén antiadherente a prueba de horno a fuego medio y luego agregue el aceite vegetal. Cocine el salmón, con la piel hacia abajo, durante 4-5 minutos o hasta que la piel esté crujiente, luego voltee el pescado y transfiera la sartén al horno durante 3-4 minutos o hasta que el pescado esté recién cocido.", "Para servir, coloque los mejillones al curry en un recipiente grande y coloque los filetes de salmón encima."], "url": "www_bbc_co_uk_food_recipes_pan-fried_salmon_with_85432", "title": "Salmón frito con mejillones al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "4 dientes de ajo, finamente picados", "Filetes de kipper de 200 g / 7 oz, huesos extraídos", "200ml / 7fl oz de caldo de pescado", "Crema doble de 200 ml / 7 fl oz", "200ml / 7fl oz de leche entera", "1 cucharada de mantequilla sin sal", "4 vieiras de buzo grandes, limpiadas", "1 cucharadita de dedos salados", "1 cucharadita de verdolaga", "1 manzana de sangre de labrador, pelada y finamente picada", "2 cucharadas de nueces picadas", "2 cucharadas de alcaparras, para adornar", "algunas ramitas apio, finamente picadas, para adornar"], "method": ["Caliente una cucharada de aceite en una cacerola a fuego medio y cocine la cebolla y el ajo hasta que estén suaves. Agregue los arenques y el caldo y llévelo a ebullición. Reduzca a fuego lento y agregue la crema. Transfiera a un procesador de alimentos y mezcle hasta que esté suave y se pueda verter. Agregue un poco de leche si la consistencia es demasiado espesa.", "Caliente el aceite restante en una sartén con la mantequilla. Fría las vieiras durante 1-2 minutos en cada lado, o hasta que estén cocidas y doradas.", "Divida las vieiras entre dos platos tibios y espárzalos sobre los dedos salados, la verdolaga marina, la manzana y las nueces. Adorne con las alcaparras y el apio y sirva."], "url": "www_bbc_co_uk_food_recipes_pan-fried_scallops_with_21619", "title": "Vieiras a la plancha con kipper velouté y vegetales marinos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60 g / 2¼ oz de mantequilla", "1 cucharada de polvo de curry suave", "1 cucharadita de comino molido", "1 cucharadita de jengibre molido", "½ ramita de canela", "3 dientes", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de fenogreco", "1 cucharadita de hojuelas de chile seco", "1 coliflor grande, raíz y hojas externas eliminadas, cortadas en pequeños floretes", "1 litro / 1¾ pintas de caldo de verduras", "Leche de coco de estaño 400ml", "1 hoja de lima", "6 hojas de menta fresca, finamente cortadas", "8 vieiras", "1 cucharadita de aceite de oliva", "exprimir jugo de lima", "sal", "brotes de micro cilantro, para adornar"], "method": ["Derrita 1 cucharada de mantequilla en una cacerola a fuego medio. Cuando la mantequilla esté espumosa, agregue el suelo y las especias enteras y mezcle bien. Freír por 1-2 minutos o hasta que esté fragante.", "Agregue la coliflor a la sartén y suficiente cantidad de caldo para cubrir las flores. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 20 minutos o hasta que esté tierno. Retire la sartén del fuego y déjela a un lado para permitir que la coliflor se enfríe en el caldo.", "Mientras tanto, ponga la leche de coco y la hoja de lima en una olla pequeña y deje que hierva. Continúe hirviendo hasta que el volumen del líquido se haya reducido a la mitad, eliminando cualquier espuma que flote a la superficie durante la cocción. Deseche la hoja de lima y agregue la menta y una pizca de sal.", "Justo antes de servir, escurra la coliflor y deseche la canela y los clavos de olor. Calienta la mitad de la mantequilla restante en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue la coliflor y fría hasta que esté dorada.", "Calentar el aceite en una sartén a fuego medio. Freír las vieiras durante 1½ minutos en cada lado. Agregue la mantequilla y fría hasta que esté dorado.", "Para servir, esparza los floretes de coliflor en un plato para servir y agregue las vieiras. Rocíe con la salsa de coco, exprima el jugo de lima y adorne con los brotes de cilantro."], "url": "www_bbc_co_uk_food_recipes_pan-fried_scallops_with_24163", "title": "Vieiras fritas con salsa de coliflor y coco al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150 g / 5½ oz de filetes de lubina, recortado", "sal", "3 cucharadas de aceite de oliva", "75g / 2¾oz de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado en cubos", "1 estrella de anís", "Mejillones 250 g / 9 oz, lavados y ordenados", "125ml / 4fl oz de vino blanco", "250ml / 9fl oz de caldo de pescado", "125ml / 4fl oz de crema doble", "pimienta negra recién molida", "2 calabacines, cortados verticalmente con un pelador de patatas"], "method": ["Para la lubina, corte barras en el lado de la piel de la lubina y sazone al otro lado con sal.", "Caliente una sartén hasta que esté caliente, luego agregue un poco del aceite y algo de mantequilla. Coloque la lubina, con la piel hacia abajo, en la sartén y cocine durante dos minutos, luego voltee, cocine por otros dos minutos y luego retire del pescado la sartén.", "Para la sopa de mejillones, caliente una cacerola hasta que esté caliente, agregue un poco más de la mantequilla y el aceite, la cebolla, el ajo y el anís estrellado y cocine suavemente durante un minuto.", "Agregue los mejillones y el vino blanco y cubra con una tapa. Cocine por 2-3 minutos o hasta que los mejillones se hayan abierto, luego quite los mejillones con una cuchara ranurada y déjelos a un lado.", "Agregue el caldo de pescado a la sartén y cocine hasta que se reduzca en un tercio y luego coloque la mezcla en un procesador de alimentos. Tenga cuidado de no llenar demasiado el procesador de alimentos, ya que podría salir líquido caliente por la parte superior. Trate de llenarlo hasta en un tercio y realice una prueba para ver qué tan lejos sube el líquido por los lados.", "Retire los mejillones de sus cáscaras y agregue mezclar dos tercios de ellos en el procesador de alimentos con el caldo reducido. Mezcle la mezcla hasta obtener un puré fino y luego regrésela a la sartén y agregue la crema.", "Calienta suavemente hasta que se caliente y lo suficientemente grueso como para cubrir la parte posterior de una cuchara. Agregue los mejillones reservados a la sartén y sazone con sal y pimienta negra recién molida.", "Para los calabacines, caliente una sartén limpia hasta que esté caliente, agregue la mantequilla restante y el aceite y sofríe las cintas del calabacín con cuidado, teniendo cuidado de no romperlas. Sazonar con sal y pimienta negra recién molida.", "Para servir, apila las cintas de calabacín en el centro de cuatro platos de sopa. Cubra con la lubina y luego ponga la sopa alrededor del borde."], "url": "www_bbc_co_uk_food_recipes_pan-fried_sea_bass_with_04547", "title": "Lubina frita con cintas de calabacín y sopa de mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Jugo de remolacha 300ml / 11fl oz", "50 g / 2 oz de azúcar en polvo", "50ml / 2fl oz puerto", "2 tiras de cáscara de naranja pelada", "1 estrella de anís", "50ml / 2fl oz de vinagre de vino tinto", "4 granos de pimienta negra", "¼ cucharadita de semillas de mostaza", "Escamas de agar agar 4g / ⅛oz", "1 bulbo de hinojo, finamente cortado", "1 limón, solo jugo", "pellizcar copos de sal marina", "1 cucharada de cebolletas frescas picadas", "2 cucharadas de aceite de colza", "sal marina y pimienta negra recién molida", "4 naranjas, 2 peladas, segmentadas y cortadas en cubos, 2 zested y jugo", "50ml / 2fl oz de vinagre balsámico blanco o vinagre dulce de vino blanco", "200ml / 7fl oz de aceite de colza", "30g / 1¼ oz de camarones marrones pequeños", "1 cucharada de aceite de colza", "4 filetes de besugo, huesos de alfiler eliminados", "sal marina", "½ limón, solo jugo", "3 cucharadas de berro de coriandro"], "method": ["Para la gelatina de remolacha, forra una bandeja de horno poco profunda con película adhesiva.", "Pon todos los ingredientes en una sartén y deja que hierva. Retire la sartén del fuego y reserve para infundir durante 15 minutos.", "Regrese la sartén al fuego y bata los copos de agar agar. Llevar a ebullición, luego retire la sartén del fuego y cuele a través de un colador en la bandeja del horno. Dejar enfriar en la nevera durante 2-3 horas, o hasta que se endurezca.", "Para la ensalada de hinojo, mezcle el hinojo, el jugo de limón y la sal en un tazón y déjelos a un lado para que se macen durante 30 minutos.", "Exprime el hinojo para eliminar el exceso de líquido y luego colócalo en un recipiente limpio. Agregue el cebollín y el aceite de colza y revuelva hasta que estén bien combinados. Sazonar, al gusto, con sal marina y pimienta negra recién molida.", "Para la vinagreta de naranja, caliente el jugo de naranja y la ralladura en una cacerola hasta que hierva y cocine hasta que la mezcla esté almibarada. Agregue el vinagre y el aceite de colza.", "Cuele la vinagreta en una cacerola limpia, luego agregue los camarones picados de naranja y marrón.", "Para el besugo, caliente el aceite en una sartén y fría los filetes de besugo, con la piel hacia abajo, durante 2-3 minutos o hasta que estén crujientes. Sazonar con sal marina, luego cuidadosamente voltee el pescado y retire la sartén del fuego. Dejar reposar durante unos minutos y luego sazonar, al gusto, con sal marina y zumo de limón.", "Para servir, precaliente el horno a 80C / 180F / Gas ¼.", "Caliente la gelatina de remolacha en el horno durante 5-10 minutos.", "Caliente la vinagreta hasta que se caliente.", "Coloque la ensalada de hinojo en platos para servir y cubra con los filetes de dorada. Ponga una pequeña gelatina de remolacha en un lado, luego cuidadosamente con una cuchara el aderezo sobre y alrededor del besugo. Termine con un poco de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_pan-fried_sea_bream_19398", "title": "Dorada frita, ensalada de hinojo, jalea de remolacha caliente y vinagreta de camarón marrón", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 libras 4 oz de papas harinosas, como Maris Piper, peladas y cortadas en trozos", "225g / 8oz de mantequilla sin sal", "150ml / 5fl oz de crema doble", "1 cucharada de aceite de oliva", "4 filetes de solomillo de 250 g / 9 oz, a temperatura ambiente", "4 chalotes de plátano, 2 con piel y cortados por la mitad a lo largo, 2 pelados y finamente picados", "1 diente de ajo, pelado y finamente picado", "25 g / 1 oz de azúcar en polvo", "250ml / 9fl oz de vino tinto", "175ml / 6fl oz de caldo de ternera (o caldo de pollo si no está disponible)", "12 caracoles cocidos cocidos (disponibles de especialistas en línea)", "2 cucharadas de hojas frescas de estragón fresco picado", "2 cucharadas de hojas de perejil fresco de hojaldre picado", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180 Fan / Gas 6.", "Coloque las papas en una sartén con agua fría y salada y deje hervir. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Escurra las papas y vuelva a la sartén, colocando a fuego lento durante un par de minutos para secarlas ligeramente. Pase las papas a través de un ricer, luego agregue 150 g / 5 oz de la mantequilla y toda la crema y bata a un puré muy suave, sazonar al gusto con sal y pimienta negra recién molida. Cúbralo y manténgalo caliente", "Sazone los filetes, al gusto, con sal. Caliente una sartén grande a fuego alto hasta que esté muy caliente, luego agregue 25 g / 1 oz de la mantequilla restante, el aceite de oliva y los filetes. Agregue los chalotes a la mitad a la sartén también, corte los lados hacia abajo.", "Freír los filetes durante 2 minutos a cada lado, rociando con la mantequilla derretida. No muevas los chalotes mientras los filetes se cocinan.", "Transfiera la sartén al horno y continúe cocinando durante 6-8 minutos (para el medio), o más si prefiere que su bistec esté bien hecho.", "Transfiera el contenido de la bandeja a un plato caliente y déjelo a un lado para permitir que la carne descanse.", "Regrese la sartén a la placa, envuelva el mango en un paño para no quemarse y caliente a fuego medio. Agregue 25 g / 1 oz más de la mantequilla restante, luego fría los chalotes picados y el ajo durante 2-3 minutos, o hasta que estén suaves pero no coloreados.", "Aumente el fuego a alto, agregue el azúcar en polvo y cocine hasta que se derrita y se dore. Vierta el vino y hierva la mezcla, luego continúe hirviendo hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el caldo, devuelva la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 2-3 minutos más. Agregue los caracoles y cocine hasta que se caliente.", "Batir los 25 g / 1 oz restantes de mantequilla en la salsa, luego condimentar, al gusto, con sal y pimienta negra recién molida. Agregue las hierbas picadas.", "Para servir, coloque un filete en cada uno de los cuatro platos para servir. Airee uno de los chalotes a la mitad encima de cada filete. Cuchara sobre el vino tinto y la salsa de caracol y coloque el puré al lado."], "url": "www_bbc_co_uk_food_recipes_pan-fried_sirloin_steak_94594", "title": "Filete de solomillo con salsa de vino tinto y caracol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Remolacha para bebé de 500g / 1lb 2oz, cortada y lavada", "2 cucharadas de aceite de oliva", "1 hinojo grande, en rodajas finas, hojas reservadas para decorar", "sal y pimienta negra recién molida", "6 cucharadas de aceite de oliva", "2 cucharadas de vinagre de vino blanco", "½ cucharada de vinagre de vino blanco", "2 cucharadas de aceite de oliva virgen extra", "1 cucharadita de semillas de hinojo, tostadas y rudamente trituradas", "1 naranja pequeña, segmentada", "1 bombilla pequeña de hinojo, finamente afeitada, hojas reservadas para decorar", "1 calabacín, afeitado en cintas finas", "8 filetes de trucha", "4 cucharadas de mantequilla sin sal", "2 limones, cortados en cuñas"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Coloque las remolachas en un trozo grande de papel de aluminio, rocíe el aceite de oliva y sazone con sal y pimienta. Dobla la lámina para hacer un paquete y asar durante 1 hora, o hasta que se ablande con un cuchillo. Pele y reduzca a la mitad las remolachas y reserve.", "Mientras tanto, para el aderezo bata el aceite y el vinagre en un tazón. Condimentar con sal y pimienta.", "Para el calabacín, la ensalada de hinojo y naranja, en un tazón mediano, mezcle el vinagre y el aceite. Sazonar con sal marina y pimienta negra recién molida y mezclar a través de las semillas de hinojo. Agregue los segmentos de naranja, el hinojo raspado y el calabacín y revuelva para cubrir. Deje reposar por lo menos 5 minutos antes de servir.", "Mezcle el hinojo con el aderezo. No arroje la remolacha, de lo contrario manchará el hinojo.", "Justo antes de servir, cocine la trucha. Use dos sartenes grandes para asegurarse de que todo el pescado esté cocido y listo al mismo tiempo. Divida la mantequilla entre las bandejas y derrita a fuego medio. Suavemente fría la trucha, con la carne hacia abajo, durante 2-3 minutos por cada lado hasta que esté dorada y cocida.", "Coloque el hinojo en el centro de cada plato y esparza la remolacha encima. Rocíe cualquier aderezo restante y luego coloque 2 filetes de trucha, con la carne hacia arriba, en la parte superior. A continuación, raspe las hojas de hinojo y sirva con una rodaja de limón. Sirve la ensalada de calabacín al lado."], "url": "www_bbc_co_uk_food_recipes_pan-fried_trout_with_88316", "title": "Trucha con remolacha asada y ensalada de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, en rodajas", "1 chile rojo, en rodajas", "2 cucharaditas de aceite de coco", "½ cucharadita de pimentón ahumado", "400g de frijoles borlotti de estaño, sin escurrir", "2 puñados de tomates cherry, toscamente picados", "2 limas sin cera, ralladura de ralladura y jugo", "un pequeño racimo de cilantro fresco, picado", "2 aguacates maduros, piedra eliminada", "Queso feta de 200 g / 7oz o tofu firme", "2 grandes pizcas de escamas de chile rojo", "Hojas de primavera de 200 g / 7 oz, tallos eliminados y triturados", "algunas ramitas de orégano fresco, solo hojas", "4 tortillas grandes integrales o sin semillas"], "method": ["Pon el ajo y el chile en una sartén mediana con un poco de aceite de coco. Cocine hasta que empiece a dorarse, luego agregue el pimentón ahumado, los frijoles Borlotti con su líquido y el jugo de una lima y déjelo reposar durante 10 minutos para que se caliente.", "Mezcle los tomates con el jugo de media lima y el cilantro. Mash los aguacates con el jugo de la otra mitad de lima.", "Espolvorea la ralladura de una lima sobre el queso feta o tofu y espolvorea sobre un par de grandes pizcas de hojuelas de chile. Ponga el resto del aceite de coco en una sartén grande y fría el queso feta o el tofu durante 3 minutos por cada lado, hasta que se doren, teniendo cuidado de no moverlo demasiado o de lo contrario se romperá.", "Una vez que el queso feta o el tofu estén dorados por ambos lados, retírelos y manténgalos calientes. Agregue los greens de primavera y el orégano a la misma sartén, con un poco más de aceite si es necesario, y agregue la ralladura de lima restante, otra buena pizca de hojuelas de chile y 2 cucharadas de agua. Cocine hasta que el agua se haya evaporado y los vegetales comiencen a tostarse.", "Sirve con tortillas."], "url": "www_bbc_co_uk_food_recipes_pan-roast_lime_feta_and_27230", "title": "Rodaballo de lima y feta de chiles asados ​​a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-roast_lime_feta_and_27230_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de salmón 200 g / 7 oz", "1 diente de ajo", "2 claras de huevo", "400 ml / 14 fl oz crema doble", "sal al gusto", "Envases de 1 paquete de wonton", "1 cola de langosta cocida, carne rebanada en rodajas finas, pequeñas, con un cuchillo afilado", "50g / 2oz de berro", "8 zanahorias baby, limpiadas, peladas y cortadas", "8 puerros tiernos, limpios y cortados", "8 nabos para bebés, limpios, pelados y recortados", "200g / 7oz de guisantes frescos", "1 manojo de espárragos", "1 x 800 g / 1 libra de filete de res de 12¼ oz, preferiblemente ternera de Jersey, completamente cortado", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida", "4 pinzas de langosta cocinadas, agrietadas, carne extraída y rebanada en rodajas finas y pequeñas, usando un cuchillo afilado", "1 paquete de hongos Shimeji (disponible en algunos supermercados más grandes y supermercados japoneses)", "25g / 1oz de mantequilla", "200 g / 7 oz de espinacas frescas", "Jus de carne 300 ml / 11 fl oz (disponible en algunos supermercados y carniceros), para servir"], "method": ["Para los ravioles de langosta, mezcle el salmón y el ajo en un procesador de alimentos hasta que quede suave.", "Agregue las claras de huevo al salmón mezclado poco a poco, mezclando después de cada adición.", "Agregue la crema doble a la mezcla de salmón y huevo en una corriente delgada, mezclando todo el tiempo, hasta que toda la crema se haya incorporado a la mezcla. Sazonar, al gusto, con sal.", "Transfiera la mezcla de salmón a un recipiente, tape y deje enfriar en el refrigerador hasta que esté firme, aproximadamente 30 minutos.", "Mientras tanto, para las verduras de primavera, ponga a hervir una olla grande de agua con sal, luego agregue las zanahorias, los puerros, los nabos, los guisantes, los espárragos y los champiñones y hierva durante tres minutos. (Si no tiene una bandeja lo suficientemente grande como para contener todas las verduras, divídalas entre varias bandejas).", "Escurra las verduras y luego sumérgelas en agua helada para refrescarlas. Cuando las verduras estén frías, drene nuevamente, luego déjelas a un lado hasta que las necesite.", "Cuando el salmón se haya enfriado, haz los raviolis. Usando una cucharadita pequeña (o una manga pastelera), coloque una cantidad de mármol de la mezcla de salmón refrigerado en el centro de una de las envolturas de wonton.", "Repita el proceso hasta que la mitad de las envolturas wonton y toda la mezcla de salmón se hayan agotado.", "Coloque una rebanada de la langosta cocida y una hoja de berro en la parte superior de cada porción de la mezcla de salmón.", "Uno por uno, cepille los bordes de un lado de cada envoltura wonton restante con un poco de agua fría. Colóquelo, con el lado humedecido hacia abajo, encima del ravioli preparado, presionando hacia abajo en los bordes para sellar las dos envolturas de wonton juntas. Recorta cualquier exceso con un cuchillo afilado.", "Repita el proceso con las envolturas wonton restantes para crear raviolis. Cubra los ravioles con film transparente y reserve.", "Para la carne de res, precaliente el horno a 180C / 350F / Gas 4.", "Haga rodar el filete de carne con fuerza en una película adhesiva resistente al calor (vea la sugerencia a continuación) para formar una forma cilíndrica perfecta, luego, con la película adherida todavía, corte el filete en cuatro porciones iguales. Sazone ambos lados de cada rebanada de filete con sal.", "Caliente una sartén a prueba de horno a fuego medio a alto, luego agregue el aceite. Cuando el aceite esté caliente, fríe los filetes durante 20-30 segundos en cada lado, o hasta que se doren por ambos lados.", "Transfiera la sartén al horno y continúe cocinando los filetes de res durante cuatro minutos (para raros), o hasta que se cocinen a su gusto.", "Retire los filetes de carne de la sartén y retire la película adhesiva de cada uno. Regrese la sartén al fuego y fría las partes de la carne que estaban envueltas en una película adhesiva, volteándolas regularmente, hasta que se doren por completo.", "Coloque los filetes de carne a un lado para descansar durante 5-10 minutos. Mantener caliente", "Agregue los champiñones y las pinzas de langosta a la sartén en la que se cocinó la carne y fría durante 1-2 minutos, o hasta que esté bien caliente.", "Mientras tanto, para la espinaca, caliente la mantequilla en una sartén a fuego medio o bajo. Cuando la mantequilla se haya derretido, agregue las espinacas y fría, revolviendo constantemente, hasta que se marchiten. Retirar del fuego y mantener caliente.", "Ponga a hervir dos sartenes grandes de agua con sal, luego reduzca el fuego hasta que el agua hierva a fuego lento.", "Agregue las verduras de primavera a una bandeja y los raviolis a la otra (en lotes si es necesario). Cocine a fuego lento durante 4-5 minutos, o hasta que las verduras estén cocidas a su gusto y los raviolis estén bien cocidos. Escurrir bien.", "Para servir, divida las verduras de primavera por igual entre cuatro tazones para servir. Cuchara sobre algunas de las setas fritas. Coloque un filete de carne de res en la parte superior de cada porción. Descanse una uña de langosta en la parte superior de cada filete. Divida los raviolis entre los cuatro platos, colocándolos encima de la carne y la langosta. Rocíe sobre algunos de los calientes jus de carne."], "url": "www_bbc_co_uk_food_recipes_pan-roasted_fillet_of_55369", "title": "Filete de ternera asado con ravioles de langosta y verduras de primavera", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechos de gallina de Guinea (o pollo si lo prefiere), piel sobre", "2 pequeñas trufas negras de invierno, en rodajas finas", "sal marina y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "1 puerro o 3 puerros tiernos, solo partes verdes, en rodajas finas", "Papas nuevas pequeñas de 300g / 11oz, cortadas en rondas de 5 mm de espesor", "100g / 3½ oz de panceta, en rodajas finas", "2 perifollo o ramitas de perejil de hoja plana, más o menos picadas", "75 g / 2½ oz de mantequilla"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Corta la piel de las pechugas de gallina de Guinea y coloca debajo tres finas rebanadas de trufa. Dobla la piel sobre el pecho y condimenta ambos lados con sal y pimienta.", "Cortar las rodajas de trufa restantes en julianas delgadas y reservar.", "Caliente dos cucharadas de aceite en una sartén a prueba de horno a fuego medio. Agregue la gallina de guinea, con la piel hacia abajo, y cocine por 2-3 minutos, o hasta que la piel esté dorada. Asegúrese de que la sartén no esté demasiado caliente para que la piel no se contraiga demasiado.", "Voltee la gallina de Guinea y cocine durante un minuto más, luego coloque en el horno durante ocho minutos. Cuando esté cocido, retire la gallina de Guinea del horno. Apartar y mantener caliente.", "Mientras la gallina de Guinea está en el horno, caliente dos sartenes de agua con sal hasta que hierva, deje caer los puerros en uno y cocine por un minuto. Escurrir, refrescar en agua helada y escurrir una vez más.", "Coloque las papas en la otra olla con agua hirviendo, cocine durante seis minutos, luego agregue la panceta y cocine por otros dos minutos. Escurrir, refrescar en agua helada y escurrir nuevamente.", "Calentar una sartén a fuego medio, agregar el aceite de oliva restante, las papas y la panceta y cocinar durante 1-2 minutos, o hasta que las papas estén doradas.", "Agregue los puerros, una pizca de la trufa reservada y el perifollo (o perejil) a la sartén. Drene cualquier grasa. Agregue 2-3 cucharadas de agua y revuelva para hacer una salsa.", "Agregue la mantequilla y la trufa restante y cocine hasta que la mantequilla se haya derretido.", "Para servir, corte cada seno por la mitad a lo largo. Coloque un poco de la mezcla de puerros y papas en el medio de cada plato de servir, coloque las gallinas de Guinea en la parte superior y vierta la salsa de mantequilla de trufa."], "url": "www_bbc_co_uk_food_recipes_pan-roasted_guinea_fowl_19879", "title": "Pintada asada con trufas y puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 tomates en la vid, divididos a la mitad", "4 cucharadas de aceite de oliva", "sal marina y pimienta negra recién molida", "4 ramitas de tomillo", "5 cucharadas de aceite de oliva", "Papas cerosas de 450 g / 1 libra, peladas y cortadas en rodajas finas", "8 sardinas frescas, a escala y fileteadas", "10 hojas frescas de orégano", "1 gran puñado de hojas de albahaca", "200ml / 7floz de aceite de oliva ligero", "Hojas de cohete de 115g / 4oz"], "method": ["Para los tomates, precaliente el horno a 150 ° C / 300 ° F / Gas 2. Coloque los tomates, córtelos en una bandeja de asar y rocíe con aceite de oliva.", "Sazonar con sal marina y pimienta negra recién molida y luego esparcir el tomillo sobre la parte superior. Coloque en el horno y tueste durante 4-6 horas hasta que se sequen ligeramente. Apague el horno y deje que se enfríe, preferiblemente durante la noche, en el horno.", "Para la tarta, precaliente el horno a 200C / 400F / Gas 6. Caliente una sartén de tamaño medio (aproximadamente 25 cm / 10 in) a prueba de horno a fuego medio y luego agregue un chorrito de aceite de oliva.", "Coloque las papas en rodajas en círculos superpuestos para que cubran el fondo de la sartén. Sazone con sal marina y pimienta negra recién molida y luego reduzca el fuego a bajo.", "Cocine durante unos cinco minutos hasta que las papas se tornen doradas en los bordes y translúcidas en el medio. Coloque las sardinas en la parte superior en forma de abanico, con las colas apuntando hacia el centro de la sartén.", "Coloque los tomates asados ​​en el horno por encima y espolvoréelos con el orégano. Coloque en el horno y hornee durante 15-20 minutos hasta que las papas estén cocidas y la parte superior esté dorada. Retire la sartén del horno y deje que la tarta se enfríe un poco.", "Para la ensalada, ponga a hervir una sartén de agua con sal, agregue la albahaca, póngala en un paño por un minuto, luego escurra y revuelva en agua helada.", "Exprime el agua y coloca la albahaca en un procesador de alimentos con el aceite de oliva. Mezcle por 1-2 minutos hasta que el aceite se vuelva verde vibrante y luego cuele a través de un colador fino en un recipiente. Mezcle las hojas del cohete con un poco de aceite.", "Para servir, coloque la tarta en un plato y luego apile la ensalada encima."], "url": "www_bbc_co_uk_food_recipes_pan-roasted_potato_tart_26968", "title": "Tarta de patata asada con sardinas y tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 brillo completo", "mantequilla, para freír", "120ml / 4fl oz de aceite de oliva virgen extra", "1 limón, solo jugo", "2 tomates, pieles y semillas retiradas, carne cortada en cubitos", "1 chalote, finamente picado", "1 diente de ajo pequeño, finamente picado", "3 cucharadas de estragón fresco picado", "2 cucharadas de eneldo fresco picado", "2 cucharadas de perifollo fresco picado", "2 cucharadas de cebolletas frescas picadas"], "method": ["Para filetear el brill, coloque el brill en una tabla de cortar y, utilizando un cuchillo flexible para filetear, corte la línea central desde la cabeza hacia la cola.", "Coloque el cuchillo ligeramente de lado en el corte central, luego presione sobre el hueso y esculpe el primer filete, usando los huesos como guía para asegurarse de que toda la carne se desprenda del pescado. El primer filete es la mitad del lado superior del pescado.", "Repita para tomar el segundo filete de la parte superior del pescado.", "Voltea el pescado y repite en la parte inferior para tomar dos filetes más, que te dan cuatro filetes en total.", "Piel los filetes y recorte cualquier volante de cada lado.", "Sazonar el brill con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla, luego agregue el brillo y fría en cada lado durante dos minutos.", "Vierta el aceite de oliva en una sartén no reactiva. Batir el jugo de limón hasta que esté bien combinado. Agregue los tomates picados, chalota y ajo.", "Calentar la sartén a fuego medio hasta que la mezcla de salsa vierge se caliente por completo. Agregue el estragón, eneldo, perifollo y cebollín y sazone al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Para servir, coloca el brillo en el plato y luego coloca la salsa vierge sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_pan_fried_brill_with_32299", "title": "Pan frito con salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 limón, ralladura eliminada y cortada en tiras finas", "1 cucharada de azúcar en polvo", "2 rebanadas gruesas de 250 g / 9oz el hígado de ternera de la mejor calidad", "100 g / 3½ oz de grasa de cerdo, listo para usar", "2 hojas frescas de laurel", "100 g / 3½ oz de mantequilla", "2 cucharadas de aceite de girasol", "Hojas de espinaca 200g / 7oz, lavadas", "1 diente de ajo, pelado y pinchado con un tenedor", "sal marina y pimienta recién molida", "1 cucharada de miel", "1 cucharada de alcaparras sin papas, enjuagadas", "1 pequeño puñado de perejil fresco, picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque una olla pequeña de agua hirviendo a fuego medio y agregue las tiras de ralladura de limón. Hervir durante 2 minutos, luego escurrir y repetir (esto reducirá la amargura de la ralladura de limón).", "Agregue el azúcar y la ralladura a la sartén y cúbralo con agua. Cocine lentamente durante aproximadamente 12 minutos, o hasta que las tiras de cáscara estén brillantes y no se peguen entre sí. Retire del fuego y reserve en un plato.", "Seque el hígado del ternero y la caja de cerdo con papel de cocina.", "Sumerja las hojas de laurel en agua hirviendo y revuelva en agua helada.", "Haga dos pequeñas incisiones en cada porción de hígado. Corta las hojas de laurel por la mitad y presiona las incisiones. Sazone con pimienta y luego envuélvala en chuletas de cerdo.", "Coloque una sartén antiadherente a prueba de horno a fuego medio-alto, agregue un poco de mantequilla y un chorrito de aceite de girasol. Cuando la mantequilla esté espumosa, agregue el hígado y fría todo hasta que se dore.", "Coloque el hígado en el horno durante cinco minutos o hasta que esté cocido a su gusto (preferiblemente el hígado debe ser rosado / mediano, ya que estará seco si se cocina demasiado). Retire de la sartén y deje reposar en un lugar cálido. Reserve la sartén para cocinar las alcaparras más tarde.", "Coloque otra sartén a fuego medio. Caliente un poco de mantequilla y, cuando haga espuma, agregue la espinaca y el ajo. Condimentar con sal y pimienta. Cuando la espinaca se haya marchitado, retírela de la sartén y manténgala caliente hasta que esté lista para servir.", "En la sartén que se usa para cocinar el hígado, caliente la miel, las alcaparras y la mantequilla restante. Cuando la mantequilla se derrita y comience a dorarse, agregue el perejil picado.", "Sirva el hígado inmediatamente con la espinaca en el lado. Espolvorear con la ralladura de limón y rociar sobre la mantequilla de alcaparra."], "url": "www_bbc_co_uk_food_recipes_pan_fried_calfs_liver_84839", "title": "Hígado de ternera frita con espinacas marchitas, alcaparras y confit de ralladura de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]