[{"isVegetarian": true, "title": "Caramelised pineapple with sabayon", "url": "www_bbc_co_uk_food_recipes_caramelisedpineapple_75831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "½ pineapple,  core removed and cut into three wedges", "50g/1¾oz brown sugar", "1 vanilla pod, split in half, seeds scraped out", "1 free-range egg yolk", "3 tbsp white wine", "50g/1¾oz caster sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.To make the caramelised pineapple, melt the butter for 2-3 minutes in an oven-proof saucepan.  Add pineapple wedges, brown sugar and vanilla.", "Place into the preheated oven for four minutes.", "To make the sabayon, over a pan of simmering water place the sabayon ingredients into a bowl.  Whisk constantly over medium heat until light and doubled in size, for 3-4 minutes.", "Serve the caramelised pineapple with the sabayon sauce on the side."]}, {"isVegetarian": true, "title": "Caramelised pineapple with rum and raisin ice cream and oven-dried pineapple", "url": "www_bbc_co_uk_food_recipes_caramelisedpineapple_87936", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pineapple, peeled and sliced 5mm¼in thick ", "75ml/3fl oz rum", "50g/2oz caster sugar", "50ml/2fl oz water", "½ tsp cracked black pepper", "115g/4oz raisins", "115ml/4fl oz rum", "8 free-range egg yolks", "200g/7oz caster sugar", "400ml/14fl oz full-fat milk", "400ml/14fl oz double cream", "½ pineapple, peeled and sliced 3mm thick"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the caramelised pineapple, cut the centre core out of the pineapple. Heat a frying pan until hot and place the pineapple into the pan.", "Fry the pineapple on each side for 1-1½ minutes until just beginning to go brown. Remove the pineapple from the pan and place on a plate. Set aside.", "Add the rum to the pan and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight. When the flame has subsided, add the sugar and water and cook until a caramel colour and slightly thickened. Add the black pepper and then set aside.", "For the rum and raisin ice cream, place the raisins into a small saucepan and pour over the rum. Place on the heat to warm. Remove from the heat and set aside for 15 minutes for the raisins to plump up.", "Place the egg yolks and sugar into a bowl and whisk together until combined.", "Place the milk into a saucepan and bring to the boil. Pour the boiling milk onto the egg yolks and whisk well, then pour back into the saucepan and return to the heat.", "Add the cream, rum and soaked raisins and continue to cook, over a low heat, until thickened, but do not boil. Cool and then transfer the custard to an ice cream machine to churn (according to manufacturer's instructions).", "For the oven-dried pineapple, heat the oven to 180C/350F/Gas 4. Place the pineapple slices onto a baking tray and place in the oven.", "Bake for 20 minutes and then turn off the heat. Leave in the oven for 1-1½ hours, turning once.", "Remove the pineapple from the oven and place onto a cooling rack to firm up.", "To serve, place three slices of cooked pineapple onto the plate, overlapping. Top with a spoonful of ice cream and place the oven-dried pineapple on top of the ice cream. Drizzle the sauce over the top and serve immediately."]}, {"isVegetarian": true, "title": "Caramelised peach and cashew nut crumble", "url": "www_bbc_co_uk_food_recipes_caramelisedpeachandc_86994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour", "55g/2oz butter", "55g/2oz cashew nuts, crushed", "2 tbsp caster sugar", "1 peach, sliced", "75ml/2½fl oz red wine", "1 tbsp caster sugar", "3 tbsp Greek-style yoghurt ", "½ lime, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the crumble topping, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs. Stir in the crushed nuts and sugar.", "For the filling, heat the sliced peach, red wine and sugar in a pan and simmer for 4-5 minutes, until the liquid is slightly reduced.", "Pour the peach mixture into an ovenproof dish and top with the crumble mixture.", "Bake in the oven for 8-12 minutes, or until the crumble is toasted and golden-brown.", "For the lime yoghurt, place the yoghurt in a bowl and stir in the lime juice.", "Serve the crumble warm in the dish with a dollop of lime yoghurt."]}, {"isVegetarian": true, "title": "Caramelised red onion and Stilton crostini", "url": "www_bbc_co_uk_food_recipes_caramelisedredoniona_88008", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ red onion, finely sliced", "1 garlic clove, chopped", "1 tsp soft brown sugar", "2 tsp balsamic vinegar", "25g/1oz Stilton, crumbled", "2 slices baguette, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a pan, add the red onion and fry over a gentle heat for five minutes until softened.", "Add the garlic and sugar and cook for 1-2 minutes. Add the balsamic vinegar and cook for three minutes.", "To serve, place the toasted baguette slices onto a serving plate. Top with the caramelised onions and scatter with crumbled Stilton."]}, {"isVegetarian": false, "title": "Caramelised pork belly with spring onion mash", "url": "www_bbc_co_uk_food_recipes_caramelisedporkbelly_92578", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75ml/2¾fl oz vegetable oil", "800g/2lb pork belly, cut into 7.5cm x 10cm/3in x 4in squares", "7.5cm/3in piece fresh root ginger, julienned", "125ml/4½fl oz rice wine", "6 tbsp light soy sauce", "250g/9oz yellow rock or palm sugar", "4 star anise", "150ml/5fl oz hot chicken stock (optional)", "600g/1lb 5½oz floury potatoes, such as King Edward or Maris Piper, cut into equal-sized pieces", "150g/5½oz butter, chopped", "8 saffron strands, soaked in 1 tsp milk ", "salt and freshly ground black pepper", "8 spring onions, trimmed, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the squares of pork belly in a pan of boiling water for five minutes, then drain, pat dry with kitchen paper and set aside to cool.", "Heat the vegetable oil in a large frying pan over a medium to high heat. Add the squares of boiled pork belly, skin-side down, in batches, and fry for 6-8 minutes, or until crisp and golden-brown. Turn the pork belly squares over and fry for a further 3-4 minutes, or until crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining batches of pork belly.", "Bring all of the remaining ingredients to the boil in a heavy-based saucepan. When the mixture is boiling, add the fried pork belly and reduce the heat until the mixture is simmering. Continue to simmer the mixture for 45-50 minutes, adding a little of the chicken stock to the pan, as necessary, if the mixture starts to dry out.", "Meanwhile, for the mashed potatoes, boil the potatoes in a pan of salted water for 15-20 minutes, or until tender. Drain well, then mash until smooth using a potato masher or ricer. ", "Stir the butter and saffron-infused milk into the mashed potatoes until well combined, then season, to taste, with salt and freshly ground black pepper. Stir in the spring onions.", "To serve, spoon a portion of the spring onion mash into the centre of each of four serving plates. Place two to three squares of pork belly on top of each serving, then spoon over the sauce."]}, {"isVegetarian": true, "title": "Caramelised satsumas with mint yoghurt", "url": "www_bbc_co_uk_food_recipes_caramelisedsatsumasw_88935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 satsumas, peeled", "2 tbsp caster sugar", "2 tbsp Greek-style yoghurt", "1 tbsp honey", "2 tbsp chopped fresh mint", "1 tsp grated lemon zest, to serve"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Melt the butter in an ovenproof frying pan over a medium heat, then add the whole satsumas and sprinkle over the sugar. Gently fry for 2-3 minutes, until the sugar has dissolved, then transfer to the oven to roast for 4-5 minutes, or until the satsumas have caramelised. ", "In a serving bowl, combine the yoghurt, honey and chopped mint. ", "To serve, place the caramelised satsumas on top of the yoghurt, drizzle over the pan juices and sprinkle over the grated lemon zest."]}, {"isVegetarian": true, "title": "Caramelised red onion with pan-fried tofu", "url": "www_bbc_co_uk_food_recipes_caramelisedredonionw_79252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ red onion, peeled and sliced", "2 tbsp balsamic vinegar", "3 tbsp soft brown sugar", "drizzle of honey", "1 tbsp olive oil", "½ packet organic tofu", "1 slice Stinking Bishop cheese ", "1 tbsp olive oil", "large handful spinach leaves", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the onions, heat the oil in a non-stick frying pan. Add the onion and sauté for 1-2 minutes. ", "Add the balsamic vinegar, sugar and honey. Reduce the heat to cook to onions gently for 5-6 minutes, stirring occasionally until caramelised.", "Meanwhile, for the tofu, heat the oil in a pan. Add the tofu and cook for 2-3 minutes on each side, until golden. ", "Lay the cheese slice on top of the tofu and transfer to the grill to cook until the cheese has melted and is golden.", "For the spinach, heat the oil in a pan. Add the spinach and salt and freshly ground black pepper, stirring well until wilted down.", "To serve, transfer the cooked spinach to the centre of a warm plate. Top with the cheesy tofu and then spoon over the caramelised onions."]}, {"isVegetarian": true, "title": "Caramelised peaches", "url": "www_bbc_co_uk_food_recipes_caramelisedpeaches_74751", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz caster sugar", "knob of butter", "1 peach, cut into wedges", "splash of kirsch (cherry liqueur)", "whipped cream, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Gently melt the sugar in a pan with the butter until a caramel has formed. Add the peach wedges and sauté for a few minutes, shaking the pan to coat in the caramel.", "Add the kirsch, set alight carefully, to flambée, and heat for a minute. Extinguish the flame.", "Transfer to a serving plate and serve the whipped cream on top."]}, {"isVegetarian": true, "title": "Caramelised oranges with chocolate mousse", "url": "www_bbc_co_uk_food_recipes_caramelizedorangeswi_80871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange, peeled, pith removed and cut into three equal round slices", "1 tbsp icing sugar", "250ml/9fl oz double cream ", "100g/3½oz Toblerone (or other chocolate), melted", "50g/1¾oz ready-made amaretti biscuits, crushed", "100g/3½oz caster sugar", "100g/3½oz almonds, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the caramelised oranges, place the oranges on a baking sheet. Dust with the icing sugar and using a mini-blowtorch, caramelise the sugared slices.", "To make the mousse, place the double cream into a bowl and whip until it is thickened, then fold in the melted Toblerone and crushed amaretti biscuits.", "To make the almond caramel, place the sugar in a frying pan over a high heat. Add the almonds and cook until the sugar has turned to a brown caramel and is coating the almonds.", "Pour the caramelised almonds onto greaseproof paper and leave to cool for two minutes and set.", "Using a rolling pin, shatter the almond caramel into pieces.", "To serve, place the caramelised orange slices onto a plate. Spoon a portion of chocolate mousse onto each orange slice and garnish with some of the caramelised almond pieces."]}, {"isVegetarian": true, "title": "Caramelised steamed apple pudding", "url": "www_bbc_co_uk_food_recipes_caramelisedsteamedap_91186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz unsalted butter", "175g/6¼oz light muscovado sugar", "1 tsp vanilla extract", "200ml/4½fl oz double cream", "25g/1oz unsalted butter, plus extra for greasing", "3 large eating apples, peeled, cores removed, roughly chopped ", "150g/5oz unsalted butter ", "130g/4½oz light soft brown sugar", "3 free-range eggs, beaten", "150g/5¼oz self-raising flour", "150ml/5¼fl oz full-fat milk", "275ml/9¾fl oz double cream", "1 vanilla pod, split, seeds scraped out with a knife", "6 free-range egg yolks", "110g/4oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly grease a 1.5 litre/12¾fl oz pudding basin with butter.", "For the butterscotch sauce, melt the butter, sugar and vanilla extract in a pan over a medium heat, stirring well to combine. Continue to heat until the mixture has caramelised. ", "Add the cream and stir until the mixture is smooth. Bring the mixture to a simmer and continue to simmer until the volume of liquid has reduced slightly. Remove the pan from the heat and set aside to cool completely.", "For the apples, heat the butter in a separate frying pan over a medium heat. When the butter is foaming, add the apple pieces and fry for 3-4 minutes, or until just tender and starting to caramelise. Set aside to cool slightly.  ", "For the sponge, in a bowl, beat together the butter and sugar until pale and fluffy.  ", "Gradually add the beaten eggs, a little at a time, beating well to incorporate each addition of egg before adding the next. ", "When all of the eggs have been well combined into the mixture, carefully mix in the flour until well combined.  ", "Sprinkle the caramelised apples into the bottom of the prepared pudding basin. Pour over three quarters of the cooled butterscotch sauce (reserve the remaining sauce). Spoon over the sponge batter in an even layer. ", "Cover the pudding basin with a pleated sheet of baking parchment, then wrap it in aluminium foil and secure with string.  ", "Place the bowl into a large pan and add enough boiling water so that the water reaches halfway up the sides of the basin. Cover the pan with a lid and steam for at least 1½ hours, topping the pan up with more boiling water as necessary.  ", "Meanwhile, for the crème anglaise, bring the cream, milk and vanilla pod and seeds to the boil in a pan. Remove from the heat and set aside for 15 minutes to infuse. After 15 minutes, discard the vanilla pod (it can be rinsed and re-used in another recipe). ", "In a bowl, mix together the eggs and sugar until pale and well combined. Pour over the milk and cream mixture over the egg and sugar mixture, whisking continuously until the mixture is well combined. ", "Strain the mixture through a sieve into a clean pan and place the sieved liquid over a low heat. Heat, stirring continuously, until the crème anglaise mixture is thick enough to coat the back of a spoon. Remove from the heat and place into a bowl of cold water to prevent it from thickening further. ", "To serve, turn out the steamed apple pudding onto a serving plate and cut it into slices. Place one slice into the centre of each of four serving plates. Drizzle over the remaining butterscotch sauce and the crème anglaise."]}, {"isVegetarian": true, "title": "Caramel poached pear with a tuile cup and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_caramelpoachedpearwi_91096", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz caster sugar", "500ml/17fl oz water ", "6 Comice pears, peeled, seeds and pith scooped out from the bottom using a melon baller or teaspoon", "50g/1¾oz caster sugar", "50g/1¾oz plain flour", "2 free-range egg whites", "50g/1¾oz unsalted butter, melted, plus extra for greasing", "130ml/4½fl oz water", "175g/6¼oz dark chocolate, minimum 70 per cent cocoa solids", "45g/1½oz unsalted butter", "75ml/2½fl oz double cream", "crème fraîche, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the caramel poached pears, place the caster sugar into a non-stick pan over a low heat until the sugar melts. When the sugar is golden-brown, remove from the heat and quickly add the water. Return to the heat and stir until the lumps have dissolved. (NB: Stand at arm's length and wear an oven glove when you add thee water - the caramel may splatter.)", "Bring the syrup to the boil and add the pears, stalks turned upwards. Turn down the heat and simmer for at least 10 minutes, or until the pears are tender. Then remove the pan from the heat and allow the pears to cool in the syrup.", "For the tuile cups, preheat the oven to 180C/360F/Gas 4. In a bowl, beat the caster sugar, flour and egg whites together for 2-3 minutes or until a smooth paste forms. ", "Beat in the melted butter until well combined, then cover and chill in the fridge for 15-20 minutes.", "Dot four teaspoons of the chilled tuile mixture at even intervals onto a lightly greased non-stick baking tray.", "Spread teaspoons of tuile mixture into thin circles approximately 12.5cm/5in in diameter using a wet palette knife. Bake for 6-8 minutes, or until pale golden-brown in the centre and dark golden-brown at the edges.", "Remove from the oven and set aside to cool for a few seconds. Then, using a palette knife, quickly lift each tuile biscuit off the baking sheet and shape it over an upturned cup.", "Remove the pears from the poaching liquid and set aside. Bring the poaching liquid, to a simmer and reduce until it forms a thick syrup. Set aside to cool.", "For the chocolate sauce, in a pan heat the water, chocolate, butter and double cream, stirring occasionally until the mixture is smooth and the chocolate has melted.", "To serve, place one of the poached pears onto each of six serving plates. Fill a tuile basket with a teaspoon of crème fraîche and place it alongside the poached pear. Drizzle over the chocolate sauce."]}, {"isVegetarian": true, "title": "Caramel-roasted apricots with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_caramelroastedaprico_88733", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 apricots, halved", "225g/8oz caster sugar", "1 orange, juice only", "25g/1oz butter", "25g/1oz Marcona almonds, roughly chopped", "25g/1oz hazelnuts, roughly chopped", "25g/1oz pistachio nuts, roughly chopped", "200g/7oz raspberries", "500ml/18fl oz vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Place the apricots, cut side up, onto a roasting tray.", "Heat a frying pan until hot, add the caster sugar and cook for two minutes until you have a light caramel.", "Add the orange juice and butter and swirl to combine.", "Sprinkle the nuts over the apricots, then pour over the orange caramel and toss lightly to combine.", "Place in the oven and roast for five minutes.", "Add the raspberries and return to the oven for two more minutes.", "To serve, arrange a ball of vanilla ice cream in the centre of each of four plates.", "Place five apricot halves around the edge of each ice cream serving, then spoon over the caramel and raspberries. Serve immediately."]}, {"isVegetarian": false, "title": "Blue cheese carbonara", "url": "www_bbc_co_uk_food_recipes_carbonara_75833", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices bacon, cut into thin strips", "100ml3½fl oz double cream ", "75g/2¾oz blue cheese", "100g/3½oz pasta, cooked (such as tagliatelle)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the carbonara, fry the bacon in a saucepan for two minutes until crisp and add the cream.", "Cook for a further two minutes.", "Add the blue cheese to the sauce to melt, and then add the pasta and serve."]}, {"isVegetarian": false, "title": "Carbonnade of pork with mushrooms", "url": "www_bbc_co_uk_food_recipes_carbonnadeofporkwith_73920", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb pork fillet", "1-2 tbsp olive or sunflower oil", "110g/4oz onion finely chopped", "60ml/2 ½ fl oz dry white wine", "150ml/¼ pint chicken stock (preferably homemade)", "225g/8oz mushrooms sliced", "300ml/½ pint sour cream or light cream", "fresh lemon juice", "salt and freshly ground pepper", "2 tbsp freshly chopped flatleaf parsley ", "110g/4oz butter ", "110g/4oz white flour", "6-8 croutons made with white bread pan fried in clarified butter or olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the pork into slices about 7mm/¾ in thick. ", "Pour a little oil into a very hot frying pan, sauté the pork pieces, until brown on both sides. Remove to a plate a keep warm.", "Add a little more butter to the pan and cook onions gently until soft and golden.", "Deglaze the pan with wine and bring to the boil, add the stock and boil again to reduce by a quarter.", "Meanwhile sauté the mushrooms in batches with a little butter and oil and add to the pork. ", "Add the cream to the sauce, bring back to the boil and thicken with a little roux.", "Add the cooked pork and mushrooms to the sauce and all the juices.", "Add a little lemon juice and simmer gently for a couple of minutes. Dip the tip of the croutons in the sauce then into the chopped parsley, add the remainder of the parsley to the sauce.", "Pour into hot serving dishes and garnish with crisp croutons."]}, {"isVegetarian": true, "title": "Cardamom and beetroot smoothie sundae", "url": "www_bbc_co_uk_food_recipes_cardamom_and_beetroot_04997", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamom_and_beetroot_04997_16x9.jpg", "ingredients": ["1 young beetroot (approximately 120g/4¼oz), cooked", "125ml/4fl oz coconut milk, chilled", "1 ripe banana", "2 cardamom seeds (see tips)", "7 ice cubes", "1 tsp vanilla extract", "tiny pinch sea salt", "2 tbsp freshly squeezed lemon juice", "cacao nibs or sesame seeds, to garnish (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the beetroot with two-thirds of the banana and all of the remaining ingredients until completely smooth.", "Slice the remaining banana.", "Divide the smoothie between two tall glasses. Garnish with the banana slices and a sprinkling of sesame seeds or cacao nibs."]}, {"isVegetarian": true, "title": "Cardamom and rosewater cheesecake", "url": "www_bbc_co_uk_food_recipes_cardamom_and_rose_water_54533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter", "250g/9oz digestive biscuits", "100g/3½oz icing sugar ", "280g/10oz cream cheese", "½ tsp ground green cardamom seeds", "1 tsp ground ginger ", "200ml/7½fl oz double cream", "50g/1¾oz pistachios, crushed, to decorate", "sugared rose petals, to decorate", "50g/1¾oz caster sugar ", "¼ tsp rosewater", "1 tbsp lemon juice", "1 dragon fruit, peeled and cut into chunks", "1 guanabana, peeled and cut into chunks", "1 Sharon fruit, peeled and cut into chunks"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Melt the butter in a small saucepan. Put the biscuits in a food processor and whizz to make crumbs. Add the melted butter and mix together. ", "Press the biscuit mixture into the base and sides of a 23cm/9in fluted loose-bottomed flan tin. Put in the freezer for 15 minutes to firm up.", "Meanwhile, beat the icing sugar and cream cheese together in a large bowl. Stir in the cardamom and ginger.", "In a separate, large bowl, beat the double cream. Fold in the cream cheese mixture.", "Spread the mixture on top of the biscuit base and place back in the freezer for 15 minutes. ", "Meanwhile, to make the fruit salad, boil 50ml/2fl oz water with the sugar in a small saucepan over a medium heat, until the sugar has dissolved. Stir in the rosewater and lemon and leave to cool.", "Scatter the pistachios on top of the cheesecake, sprinkle with a little of the rosewater syrup and decorate with some petals.", "Combine the fruit in a large bowl and pour over the remaining rosewater syrup. Mix together and serve with the cheesecake."]}, {"isVegetarian": true, "title": "Cardamom and lemon cookies", "url": "www_bbc_co_uk_food_recipes_cardamom_and_lemon_74033", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamom_and_lemon_74033_16x9.jpg", "ingredients": ["225g/8 oz butter, softened", "150g/5½ oz caster sugar", "1 lemon, zest only", "250g/9 oz plain flour", "100g/3½ oz ground almonds", "3 tsp ground cardamom or 1 heaped tsp cardamom seeds, ground in a pestle and mortar"], "serves": "Makes 24 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line 2 large baking trays with baking parchment.", "Using an electric hand-whisk, beat the butter, sugar and lemon zest together in a large bowl until pale and fluffy. ", "Beat in the flour, almonds and cardamom until the mixture is well combined and comes together to form a stiff dough.", "Roll the dough into 24 balls and place 12 on each baking tray – make sure you leave space between each one. ", "Press each cookie with a cookie stamp or the bottom of a glass to flatten and leave decorative indentations in the dough.", "Bake a tray at a time for 12–14 minutes until the cookies are pale golden brown. ", "Leave them to cool on the tray for a few minutes, then transfer to a wire rack. They will crisp up as they cool. Store the cookies in an airtight tin and eat within 7 days."]}, {"isVegetarian": true, "title": "Cardamom and white chocolate sponge", "url": "www_bbc_co_uk_food_recipes_cardamom_sponge_with_34236", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamom_sponge_with_34236_16x9.jpg", "ingredients": ["225g/8oz unsalted butter, softened, plus extra for greasing", "4 free-range eggs", "225g/8oz caster sugar", "225g/8oz self-raising flour", "2 level tsp baking powder", "12 cardamom pods", "100g/3½oz white chocolate, broken into pieces", "50g/1¾oz unsalted butter, softened", "75g/2½oz cream cheese", "200g/7oz icing sugar", "½ tsp vanilla extract", "icing sugar and dove stencil, to decorate (optional)"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 180C/160C Fan/Gas4. Grease two 20cm/8in loose-bottomed sandwich tins and line with baking paper.", "Put the butter, eggs, sugar, flour and baking powder in a large bowl and beat together (using an electric hand whisk if you have one) until well combined.  ", "Bash the cardamom pods with a rolling pin to release the seeds. Tip the seeds in a pestle and mortar and mash until fine. (Be sure to crush the cardamom seeds only, not the pods as these do not tenderize down.) Stir the crushed seeds into the cake batter, then pour the mixture into the tins.  ", "Bake for 25 minutes, or until golden-brown and springy to the touch. Leave to cool for 5 minutes, then run a small palette knife or rounded butter knife around the edge of the tins and carefully turn the cakes out onto a wire rack. Peel off the paper and leave to cool completely.", "For the icing, gently melt the white chocolate in a heatproof bowl over a pan of just simmering water, making sure the bowl doesn't touch the water. (Do not overheat the white chocolate or it will not set.) Stir until runny, then set aside to cool and thicken a little. ", "Whisk the butter and cream cheese together until fluffy and soft. Add half the icing sugar, whisk again, add the vanilla and the remaining icing sugar and whisk again. Stir in the white chocolate until combined. Transfer to the fridge for about 20 minutes, or until thickened to a spreading consistency.  ", "Slice each cake in half horizontally to give four thin sponges. Sandwich together with the icing and arrange on a cake stand so you have four layers of cake and three layers of icing, leaving the top of the cake plain. ", "Sprinkle with icing sugar, using a decorative dove stencil if you have one."]}, {"isVegetarian": true, "title": "Cardamom, pistachio and coffee Swiss roll", "url": "www_bbc_co_uk_food_recipes_cardamom_pistachio_and_48559", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "½ tsp green cardamom seeds ", "4 large free-range eggs", "100g/3½oz caster sugar, plus extra for dusting", "100g/3½oz self-raising flour", "caster sugar, to sprinkle on the baking parchment ", "300ml/10fl oz double cream", "1 tbsp caster sugar", "1 tsp instant coffee, dissolved in 1 tbsp hot water", "50g/1¾oz dark chocolate, to make flowers ", "50g/1¾oz unsalted shelled pistachios, finely chopped ", "icing sugar, to dust "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease and line a 33 x 23cm/13 x 9in Swiss roll tin with baking parchment.", "Crush the cardamom seeds in a pestle and mortar until almost powder. ", "For the Swiss roll, whisk the eggs and sugar in a bowl until the mixture becomes light and when you remove the whisk from the bowl it leaves a trail - this could take 10-15 minutes.", "Add the ground cardamom seeds to the egg mixture. Sieve the flour into the egg mixture and carefully fold it in. Pour the mixture into the tin and give it a shake to level it, so that it spreads evenly.", "Bake for 8-10 minutes, or until the cake turns golden-brown.", "Tip the cake out onto a sheet of baking parchment sprinkled with caster sugar. Roll it and cover with a clean tea towel. Allow it to cool, rolled up.", "While the cake is cooling, prepare the filling. Pour the cream into a large bowl and add the sugar. Whisk until soft peaks form when the whisk is removed from the bowl. Add the coffee to this mixture and mix well.", "Melt the chocolate in a bowl and cool it down slightly. Pour the chocolate into a piping bag and make flower patterns on an acetate sheet (or you can make any other design you like). Put this sheet in the fridge until the chocolate is set. Once set, you can peel the flowers off the sheet.", "Once the cake has cooled, unroll it. Spread almost all the coffee cream evenly over the cake, and sprinkle the pistachios over it. Once again roll the cake neatly and decorate with some more coffee cream and sprinkle over some nuts. Finally place few chocolate flowers on top. Dust with icing sugar. "]}, {"isVegetarian": true, "title": "Cardamom kulfi", "url": "www_bbc_co_uk_food_recipes_cardamomkulfi_74037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp cornflour", "2 tbsp milk", "200ml/7¼ fl oz evaporated milk", "200ml/7¼ fl oz condensed milk", "200g/7¼oz thick double cream", "seeds of 2-3 cardamom pods, crushed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the cornflour with the milk and set aside.", "In a saucepan, heat the evaporated milk and bring to the boil.", "Add the condensed milk, double cream, cardamom and the cornflour mixture.", "Stir well for one minute.", "Remove from the heat. Allow to cool slightly.", "Place the creamy mixture in a food processor and blend for a couple of minutes to smooth out any lumps. I use a hand-held blender to whiz the mixture which works well.", "Pour into a plastic container with a lid and freeze for at least six hours or overnight until the ice cream is quite firm.", "The ice cream is quite rich so two small scoops for one person is ample."]}, {"isVegetarian": false, "title": "Caribbean chicken and pumpkin curry", "url": "www_bbc_co_uk_food_recipes_caribbean_chicken_and_44098", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caribbean_chicken_and_44098_16x9.jpg", "ingredients": ["8 bone-in chicken thighs, skinned, or a jointed chicken, skinned", "4 spring onions, roughly chopped", "4 garlic cloves, roughly chopped", "20g/¾oz piece root ginger, roughly chopped", "2 scotch bonnet chillies (or according to taste), seeds removed, finely chopped", "1 lime, zest and juice", "2 tbsp medium curry powder blend, preferably Caribbean", "½ tsp ground allspice ", "salt and freshly ground black pepper", "1 tbsp vegetable or coconut oil", "1 onion, thickly sliced", "300ml/10fl oz chicken stock or water", "2 tomatoes, peeled and diced", "2 large sprigs thyme", "2 bay leaves", "400g/14oz pumpkin, cut into large chunks", "½ lime, juice only", "1 tsp rum (optional)", "steamed rice", "sliced spring onions ", "chopped fresh parsley or coriander"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the chicken thighs in a bowl and season with salt and pepper. ", "Put all the marinade ingredients into a small food processor and blend to a paste – add a little water if needed. ", "Pour the marinade over the chicken and mix thoroughly to make sure the chicken is completely covered. Cover and leave for as long as you can – at least a couple of hours, but overnight is better. If you are leaving it out for longer than an hour, put the chicken in the fridge.", "For the curry, heat the vegetable or coconut oil in a large casserole. Add the onion and cook on a medium heat for several minutes until starting to turn golden brown. Add the chicken and the marinade to the casserole – the idea is not to brown the chicken, but do give the marinade ingredients a couple of minutes to cook before adding the stock or water. ", "Add the tomatoes, thyme and bay leaves and season with salt and pepper. Bring to the boil, then turn the heat down, cover, and leave to simmer for around 40 minutes. ", "Add the pumpkin and cook for a further 10 minutes, covered. Pour in the lime juice and the rum, if using. Remove the lid and cook for another 5-10 minutes to reduce the sauce slightly and finish off cooking the pumpkin.", "Serve with steamed rice and topped with sliced spring onions and fresh parsley or coriander.  "]}, {"isVegetarian": true, "title": "Coffee and cardamom cake with pistachio cream", "url": "www_bbc_co_uk_food_recipes_cardamomandcoffeecak_86632", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cardamomandcoffeecak_86632_16x9.jpg", "ingredients": ["200g/7oz butter, softened, plus extra for greasing", "200g/7oz caster sugar", "4 free-range eggs", "3 tbsp strong coffee", "8 cardamom pods, seeds removed and ground", "250g/9oz self-raising flour", "250g/9fl oz double cream", "1 tbsp icing sugar", "5 cardamom pods, seeds removed and ground", "60g/2½oz pistachios, shells removed, roughly chopped", "110g/4oz icing sugar", "1 tbsp warm coffee"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Grease and line a 23cm/9in deep cake tin.", "Place the butter and sugar into a bowl and whisk until light and fluffy.", "Add the eggs, one at a time, beating between each addition until well incorporated.", "Add the coffee and ground cardamom seeds and mix well, then fold in the flour.", "Pour the mixture into the cake tin, transfer to the oven and bake for 20-25 minutes, or until golden-brown and well risen. Remove from the oven and allow to cool.", "For the filling, place the cream into a bowl and whisk until soft peaks form when the whisk is removed.", "Add the icing sugar, ground cardamom seeds and pistachios and whisk gently until the mixture forms firm peaks.", "For the icing, place the icing sugar into a bowl, add the coffee and mix together until smooth.", "To assemble the cake, carefully cut the cake in half horizontally with a bread knife and place the bottom half onto a plate. Spread the pistachio cream over the bottom half of the cake, then top with the other half. Spoon over the icing, allowing it to drizzle down the sides of the cake.", "To serve, cut the cake into wedges and place onto serving plates."]}, {"isVegetarian": true, "title": "Caribbean toastie cups with avocado, mango and mint", "url": "www_bbc_co_uk_food_recipes_caribbean_toastie_cups_20898", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caribbean_toastie_cups_20898_16x9.jpg", "ingredients": ["spray oil ", "6 white, whole-meal or seeded soft flour tortillas (19cm/7½in diameter)", "1 red pepper, seeds removed, cut into 1cm/½in dice", "1 ripe but firm avocado, peeled, stoned and cut into 1cm/½in dice", "1 small ripe mango, peeled, stone removed, cut into 1cm/½in  dice or 125g/4½oz ready-prepared mango pieces, cut into 1cm/½in dice ", "200g/7oz canned red kidney beans, drained and rinsed", "2 spring onions, trimmed and finely sliced", "1 red chilli, seeds removed (if preferred), finely chopped", "1 lime, juice only", "½ bunch fresh mint, leaves only, finely chopped (to give about 2 tbsp)", "flaked sea salt and freshly ground black pepper", "1 tbsp extra virgin olive oil (optional)"], "serves": "Makes 24 cups", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 (fan 180C).  Spray two 12-hole shallow cupcake trays with oil and set aside. You can work in two separate batches if you only have one tray.", "Put the tortillas in a stack on top of one another on a chopping board and cut them into quarters to give 24 pieces. Push one quarter into each hole of the cupcake trays, pressing it in to fit. Really press it down to form a sturdy bottom and the tops should splay out at the top creating a ‘cup’. Cook in the oven for about five minutes, or until the cups are crisp and brown - keep an eye on them as they can burn really quickly.", "For the filling, mix the red pepper, avocado, mango, kidney beans, spring onions, chilli, lime juice and mint together in a large bowl and season to taste with salt and pepper. Add a little oil if you like. ", "Once the tortilla cups are crisp and golden-brown, remove them from the oven and onto a serving plate. Divide the filling mixture evenly between the cups and serve."]}, {"isVegetarian": false, "title": "Jerk chicken with rice, peas and fried plantain", "url": "www_bbc_co_uk_food_recipes_caribbeanjerkchicken_86981", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 spring onions, finely chopped", "1 garlic clove, peeled and crushed", "100ml/3½fl oz light coconut milk", "100g/3½oz basmati rice", "½ x 410g/14oz can kidney beans (do not drain)", "1 sprig fresh thyme", "½tsp salt", "310ml/11fl oz boiling water", "1 green bird's-eye chilli (or ½ Scotch bonnet pepper)", "2 tbsp mild jerk seasoning", "1 tbsp soy sauce", "2-3 tbsp tomato ketchup (or barbecue sauce)", "1 tbsp clear honey", "2 boneless chicken breasts, skin on", "2 tbsp vegetable oil", "30g/1½oz butter", "1-2 tbsp vegetable oil", "1 large ripe plantain, skin removed, cut on the diagonal into slices 2cm/¾in thick", "½ small red onion, peeled and finely chopped", "½-1 red chilli, finely chopped", "½ small ripe pineapple, peeled and finely chopped", "½ lime, juice only", "½-1 tbsp sugar", "2.5cm/1in piece fresh ginger, grated (optional)", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the rice and peas, heat the butter in a saucepan and gently fry the spring onions and garlic. Don't allow them to brown.", "Add the coconut milk and bring to the boil.", "Stir in the rice, the kidney beans (along with the liquid in the tin), the thyme, salt and boiling water. Add the chilli, then stir, cover with a lid and bring back to the boil. ", "Once it has come to the boil, reduce the heat and simmer for 20-25 minutes, or until all the liquid is absorbed and the rice is tender. Fluff lightly with a fork to separate the grains, cover and leave to stand.", "For the jerk chicken, preheat the oven to 200C/400F/Gas 6. Place the jerk seasoning, soy sauce, tomato ketchup (or barbecue sauce) and honey into a bowl and mix to a paste.", "Use a sharp knife to make four or five deep cuts at an angle across the skin-side of the chicken breasts. ", "Brush half the jerk paste over the chicken with a pastry brush. ", "Brush a baking sheet with half the vegetable oil. Place the chicken breasts onto the baking sheet and drizzle with the remaining oil. Transfer to the oven and roast for 25 minutes. Brush with the remaining jerk paste during cooking.", "For the last five minutes of cooking, place the baking tray at the top of the oven, where the temperature is hottest, to brown the chicken. Check the chicken is cooked through - there should be no pink when you cut into it.", "For the plantain, heat the butter and oil in a pan over a medium heat, add the plantain and cook for 4-5 minutes on each side until golden-brown. Remove from the pan and drain on kitchen paper.", "For the salsa, place the onion, chilli, pineapple, lime juice, sugar and ginger, if using, into a pan and heat gently for 2-3 minutes. Remove from the heat, cool, then stir in the coriander and mint.", "To serve, place the chicken onto serving plates with some rice and peas, a few slices of plantain and a spoonful of salsa. Serve with Irish stout punch"]}, {"isVegetarian": false, "title": "Carne con chile", "url": "www_bbc_co_uk_food_recipes_carne_con_chile_04415", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carne_con_chile_04415_16x9.jpg", "ingredients": ["50g/1¾oz dried guajillo chillies, seeds removed", "4 large ripe tomatoes", "4 garlic cloves, skin on", "30g/1oz lard or 3 tbsp vegetable oil", "1kg/2lb 4oz braising steak, cubed", "1 large onion, roughly chopped", "1 tsp ground cumin", "1 tsp dried oregano", "4 allspice berries, bruised", "1 bay leaf", "1 tsp salt", "2 tbsp chipotles en adobo ", "12–18 corn tortillas", "handful coriander, roughly chopped", "200ml/7fl oz soured cream", "Lancashire cheese, crumbled", "1 avocado, stone removed, peeled and diced", "1 large onion, finely chopped", "4 radishes, finely sliced"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place a heavy-based frying pan over a medium heat and toast the chillies for 20 seconds, until fragrant but not burnt. Place them into a bowl and pour over 450ml/16fl oz boiling water to cover them. Leave to soak for 15–20 minutes. ", "In the same frying pan, dry fry the tomatoes and garlic until softened and charred. Set aside until cool enough to handle, then peel off and discard the garlic skins and quarter the tomatoes. ", "Heat a tablespoon of lard or oil in a large flameproof casserole dish and brown one third of the beef. Transfer to a plate and then repeat until all the beef has browned, adding another tablespoon of lard or oil as needed. ", "Add the remaining lard or oil to the pan and fry the onion for 3–4 minutes until softened. Add the cumin, oregano, allspice and bay leaf. Cook for 2 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Place the soaked chilies and roughly 150ml/5fl oz of their soaking liquid into a food processor. Add the garlic, tomatoes, salt and chipotles en adobo and blend until as smooth as possible.", "Tip the paste into the casserole dish. Add the browned beef and stir in the rest of the chilli soaking water. Bring to the boil, then turn down to a simmer on a low heat. Cover and cook in the oven for 1½–2 hours until the beef is tender. Check the water level a couple of times during cooking to make sure the meat doesn’t dry out. Add a little more liquid if necessary. ", "Warm the tortillas and serve the chilli with the toppings on the side. Add rice or beans if desired. "]}]