[{"isVegetarian": false, "title": "Honey and mustard glazed chicken salad with olive oil and balsamic dressing", "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_87339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "½ chicken breast, skin removed, sliced into strips", "½ red onion, sliced into thin wedges", "2 tbsp clear honey", "1 tbsp Dijon mustard", "85g/3½oz fresh rocket leaves", "balsamic vinegar, for drizzling"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the olive oil in a frying pan. Fry the chicken for 5-6 minutes, until golden-brown and cooked through, and then transfer to a plate. ", "Fry the onion in the pan until soft. ", "Mix the honey and mustard together in a large bowl. Add the rocket to the bowl along with the chicken and onion. Toss together and drizzle with a little balsamic vinegar. ", "Place onto a large serving plate and serve."]}, {"isVegetarian": false, "title": "Honey and sesame beef skewers with balsamic glazed chicory", "url": "www_bbc_co_uk_food_recipes_honeyandsesamebeefsk_87036", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz sirloin steak, sliced into 1cm/¼in strips", "1 tbsp olive oil", "salt and freshly ground black pepper", "wooden skewers", "1 tbsp clear honey", "2 tsp sesame seeds", "1 head chicory, halved", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef skewers, place the steak in a small bowl, drizzle with the olive oil and season with salt and freshly ground black pepper. ", "Thread the beef strips onto the skewers.", "Heat a non-stick frying pan and fry the beef strips for two minutes.", "Drizzle the honey and sprinkle the sesame seeds over the skewers and fry for a further two minutes until glazed and cooked through.", "For the glazed chicory, heat a frying pan until hot. Drizzle the chicory halves with the olive oil and place, cut-side down, in the frying pan for two minutes on each side.", "Add the balsamic vinegar to the pan and cook for a further two minutes on each side, or until wilting.", "To serve, place the chicory alongside the beef skewers on a serving plate and garnish with the chervil."]}, {"isVegetarian": false, "title": "Honey and sesame beef with coriander, mint and lime noodle salad", "url": "www_bbc_co_uk_food_recipes_honeyandsesamebeefwi_88638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz fillet steak, cut into chunks", "2 tbsp sesame seeds", "1 lime, juice and zest only", "2 garlic cloves, finely chopped", "2 tbsp honey", "½ yellow Scotch Bonnet chilli, finely sliced", "1 tbsp vegetable oil", "85g/3oz rice noodles, cooked", "1 lime, juice and zest only", "2 tbsp soy sauce", "2 tbsp chopped fresh mint", "2 tbsp chopped fresh coriander", "4 asparagus spears", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the honey and sesame beef, place all the ingredients, except the oil, into a bowl and stir well to coat the beef. Set aside to marinate for 5-10 minutes, or longer if possible.", "Heat the vegetable oil in a wok or frying pan and stir fry the marinated beef for 3-4 minutes, or until cooked through.", "For the noodle salad, cook the rice noodles according to packet instructions and refresh under cold running water. Drain, then place into a bowl. Add the remaining salad ingredients to the bowl and stir well.", "For the roasted asparagus, place the asparagus onto a baking sheet, drizzle over the oil and season, to taste, with salt and freshly ground black pepper. Place into the oven and roast for 8-10 minutes, until lightly charred and tender.", "To serve, place the noodles in the centre of a serving plate and arrange the beef on top. Garnish with the roasted asparagus spears."]}, {"isVegetarian": false, "title": "Honey and sesame chicken skewers with griddled squash and spicy curly kale", "url": "www_bbc_co_uk_food_recipes_honeyandsesamechicke_82108", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, skinned and cut into 1in cubes", "salt and freshly ground black pepper", "1 tbsp honey", "1½ tbsp sesame seeds", "1 tbsp olive oil", "1 tbsp olive oil", "½ butternut squash, par-boiled for 5 minutes and drained", "salt and freshly ground black pepper", "1 tbsp olive oil", "3 spring onions, finely chopped", "125g/4½oz curly kale, chopped", "3tbsp white wine", "1 tbsp dried chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the chicken skewers, season the chicken pieces with salt and freshly ground plack pepper.  Thread the chicken pieces onto two or three skewers. Drizzle with honey, sprinkle with sesame seeds and finally drizzle with olive oil. ", "Heat a griddle pan until smoking hot and add the chicken skewers. Cook for 4-5 minutes, turning frequently until they are golden brown all over and the chicken is cooked through. ", "To make the griddled butternut squash, cut the squash into cubes, brush the squash with olive oil and season well with salt and freshly ground black pepper. Heat a griddle pan until smoking hot and cook for 3 minutes on each side, until tender.", "To make the spicy curly kale, heat the olive oil in a sauté pan and add the spring onions. Cook gently until softened slightly, add the curly kale and cook for another minute, stirring frequently. ", "Add the white wine, chilli flakes, salt and freshly ground black pepper and leave to cook for five minutes or until all the liquid has been absorbed.", "To serve, put a large pile of spicy curly kale on a large plate, top with the chicken skewers and place the griddled butternut squash on the side."]}, {"isVegetarian": true, "title": "Honey and soy glazed Quorn with spinach and peppers and cheese crisp", "url": "www_bbc_co_uk_food_recipes_honeyandsoyglazedquo_88852", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz Wensleydale cheese, grated", "2 tbsp soy sauce", "2 tbsp clear honey", "300g/10½oz Quorn 'chicken' pieces", "dash olive oil", "½ yellow pepper, sliced", "1 tomato, chopped", "small handful spinach", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheese crisp, sprinkle the grated cheese into a small non-stick frying pan and fry until melted and turning slightly crisp. Carefully remove from the pan and mould around a rolling pin to create a curled shape. Leave to cool.", "For the Quorn, place the soy sauce, honey and Quorn into a small bowl, stir well and leave to marinate for ten minutes. Drain, reserving the marinating liquid.", "Heat the olive oil in a wok and fry the Quorn for 2-3 minutes, or until golden-brown. Add the pepper and tomato and cook for 2-3 minutes, then add the marinating liquid and spinach. Season, to taste, with salt and freshly ground black pepper. Cook for a further 1-2 minutes, then spoon into a serving bowl. ", "To serve, top the glazed Quorn with the cheesy crisp."]}, {"isVegetarian": false, "title": "Honey and soy-roasted pork with cashew nut crust on pineapple 'carpaccio' and crisp cabbage", "url": "www_bbc_co_uk_food_recipes_honeyandsoyroastedpo_85573", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz pork tenderloin", "salt and freshly ground black pepper ", "2 tbsp olive oil", "1 garlic clove, lightly crushed", "1 tbsp soy sauce", "1 tbsp honey", "85g/3oz cashew nuts, crushed", "300ml/10fl oz vegetable oil, for deep frying", "¼ savoy cabbage, very finely sliced", "½ pineapple, peeled and very thinly sliced", "1 orange, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the honey and soy-roasted pork, season the pork all over with salt and freshly ground black pepper. Heat the oil in an ovenproof frying pan, add the pork and garlic and fry the pork, turning frequently, until lightly browned on all sides. Transfer the frying pan to the oven and cook the pork for five minutes, or until almost cooked through.", "Remove the pan from the oven and put back on the heat. Add the soy sauce and honey to the pan and fry for one minute. Remove the pork from the pan and roll in the crushed cashew nuts to coat on all sides. Return to the pan and fry for one minute on each side, then set aside to rest in a warm place.", "For the crisp cabbage, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the sliced cabbage into the oil and deep fry for 2-3 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To serve, place the pineapple slices onto a serving plate. Slice the pork and place it on top of the pineapple 'carpaccio'. Top with the crisp cabbage and garnish with orange wedges."]}, {"isVegetarian": false, "title": "Honey and walnut cream with apple and quince slice", "url": "www_bbc_co_uk_food_recipes_honeyandwalnutcreamw_83885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz double cream", "25g/1oz diced walnuts", "3 tbsp clear honey", "450g/1lb ready made puff pastry", "50g/2oz melted butter", "110g/4oz quince jelly", "6 golden delicious apples, peeled, cored and cut into thin slices", "25g/1oz caster sugar", "4 sprigs mint, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl whip the cream with an electric whisk until thick. Fold in the walnuts and honey, and place in the fridge.  ", "Preheat the oven to 200C/400F/Gas 6.", "Roll out the puff pastry thinly and prick the surface with a fork.", "Cut out four rectangles sized 10cm/4in by 20cm/8in.", "Place the rectangles onto a non-stick greased baking tray.  ", "Lightly brush the edges of the tarts with a little of the melted butter and spread the quince jelly on the middle. ", "Layer on the apple slices.", "Drizzle the top with most of the remaining melted butter and sprinkle with the  sugar.", "Place in the oven for 5-6 minutes until golden brown.  ", "Remove the slices from the oven and glaze with a little of the remaining butter.  ", "Place on the plates and serve with a spoonful of the honey and walnut cream."]}, {"isVegetarian": true, "title": "Honey and whisky porridge", "url": "www_bbc_co_uk_food_recipes_honeyandwhiskyporrid_85195", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz porridge oats", "3 tbsp double cream, plus extra to serve", "250ml/9fl oz milk", "1 tbsp soft brown sugar", "dash whisky", "1 tbsp clear honey, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oats, cream, milk, sugar and whisky into a small saucepan and cook over a gentle heat for 6-7 minutes, until thickened and smooth. ", "To serve, pour the porridge into a bowl and drizzle with honey and cream."]}, {"isVegetarian": false, "title": "Honey-baked chicken with hoi sin plantain and wilted garlic stems", "url": "www_bbc_co_uk_food_recipes_honeybakedchickenwit_83880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 skinless, boneless chicken breasts", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 tbsp butter", "1 plantain, peeled and sliced lengthways", "1 tbsp ground cinnamon", "40g/1½oz hoi sin sauce from a jar", "110g/4oz wild garlic stem or garlic chives, blanched for 15 seconds then refreshed", "20g/¾oz honey"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the chicken breast with salt and freshly ground black pepper.", "Heat an oven-proof frying pan until hot, then add the olive oil and half the butter.", "When the butter is foaming add the chicken and fry, turning once, until golden-brown on both sides.", "Transfer to the oven to roast for 10-12 minutes, or until completely cooked through. Remove from the oven and leave to rest in a warm place for five minutes.", "For the plantain, heat a frying pan until hot, then add the remaining butter.", "Dust the plantain with cinnamon and place into the frying pan to fry for 1-2 minutes on each side, until golden and tender.", "To serve, place the wilted garlic stem onto one side of the plate. Place the plantain in the centre of the plate. Drizzle with hoi sin sauce.", "Slice the chicken into three pieces on the diagonal and place it across the plantain. Finish by drizzling the honey over the chicken."]}, {"isVegetarian": false, "title": "Honey and za'atar-glazed spring lamb with salsify and wild garlic purée", "url": "www_bbc_co_uk_food_recipes_honeyandzaatarglazed_91314", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp dried thyme leaves", "2 tsp dried oregano", "pinch ground sumac (available from Middle Eastern stores)", "½ tsp toasted sesame seeds ", "pinch red chilli flakes", "pinch sea salt", "1 tsp ground cumin", "2 tbsp finely grated fresh root ginger", "3 tbsp clear honey", "4 x 125g/4½oz spring lamb tenderloin, trimmed", "4 tbsp butter", "300g/11oz salsify, peeled and chopped (keep in a bowl of acidulated water to prevent browning)", "110ml/4fl oz water", "200ml/7fl oz milk", "salt and freshly ground black pepper", "25g/1oz butter", "2 tbsp thick double cream", "1 tbsp olive oil", "4-5 tbsp wild garlic leaves, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the za'atar, mix together all of the za'atar ingredients in a small bowl until well combined.", "For the lamb, add the cumin, ginger and honey to the za'atar mixture and mix until well combined. Rub the mixture all over the lamb tenderloin. ", "Heat the butter in a frying pan over a medium heat. Add the lamb and fry for 6-8 minutes on each side (for medium), or until cooked to your liking. Remove the lamb from the pan and set aside to rest on a warm plate. Reserve any cooking juices left behind in the pan. ", "For the salsify and wild garlic purée, drain the salsify and place into a pan. Pour over the water and milk and season with salt and freshly ground black pepper. Bring to the boil. Reduce the heat until the mixture is simmering and cook for 20 minutes, or until the salsify is tender. Drain, then place the salsify into a food processor with the butter and cream and blend until smooth. ", "Heat the oil in a a frying pan until smoking, add the wild garlic leaves and fry for 1-2 minutes, or until just wilted. Stir the wild garlic into the salsify purée and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the salsify and wild garlic purée onto four serving plates. Carve the lamb into thick slices and arrange alongside the purée, drizzling over some of the reserved pan juices."]}, {"isVegetarian": true, "title": "Honey-baked figs with Manchego cheese", "url": "www_bbc_co_uk_food_recipes_honeybakedfigswithma_87282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 fresh figs, stalks removed", "2 tbsp balsamic vinegar", "1 tbsp clear honey", "2 tsp chopped fresh thyme leaves", "salt and freshly ground black pepper", "30g/1oz Manchego cheese, grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Using a sharp knife, cut a cross into the top of each fig. Push the fig down on a chopping board to open it slightly, then place in a 25 x 25cm/10 x 10in square of foil. Spoon over the vinegar, honey and thyme and season with salt and freshly ground black pepper. Fold the foil over to make a parcel and seal the edges. ", "Place the parcel in a small frying pan over a medium heat and cook for 8-10 or until the figs have softened. Open the parcel and sprinkle with the cheese to serve."]}, {"isVegetarian": true, "title": "Honey cake", "url": "www_bbc_co_uk_food_recipes_honeycake_67599", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycake_67599_16x9.jpg", "ingredients": ["170g/6oz clear honey", "140g/5oz butter", "85g/3oz light muscovado sugar", "2 eggs, beaten", "200g/7oz self raising flour, sieved", "water", "55g/2oz icing sugar", "1 tbsp clear honey", "hot water"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 3 and butter and line the bottom of a 7in/18cm cake tin.", "Measure the honey, butter and sugar into a large pan.  Add a tablespoon of water and heat gently until melted.", "Remove from the heat and mix in the eggs and flour. ", "Spoon into the cake tin and bake for 40-45 minutes until the cake is springy to the touch and shrinking slightly from the sides of the tin.", "Cool slightly in the tin before turning out onto a wire rack.", "While the cake is still warm, make the icing by mixing the sugar and honey together with 2-3 teaspoons of hot water. Trickle over the cake in whatever design takes your fancy."]}, {"isVegetarian": true, "title": "Honey cheesecake", "url": "www_bbc_co_uk_food_recipes_honeycheesecake_80809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 ready-made sponge fingers ", "50g/2oz Greek yoghurt ", "100g/3½oz mascarpone ", "2 tbsp runny honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Line the base of a metal medium-size chefs' ring with the sponge fingers cut to size.", "In a bowl, mix the Greek yoghurt with the mascarpone and honey.", "Lay this mixture on top of the sponge fingers and smooth with a palette knife or spoon.", "Using a blow torch to warm the sides, release the cheesecake from the mould. Serve."]}, {"isVegetarian": false, "title": "Honey chicken skewers", "url": "www_bbc_co_uk_food_recipes_honeychickenskewers_87807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 skinless chicken breast, cut into chunks", "1 courgette, cut into chunks", "1 tbsp olive oil", "1 tbsp clear honey", "salt and freshly ground black pepper", "handful fresh flatleaf parsley leaves", "dash balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat an ovenproof griddle pan until very hot. Soak two bamboo skewers in water for a few minutes.", "Thread the chicken and courgette onto the bamboo skewers. Brush the griddle pan with a little of the oil and place the chicken skewers into the pan.", "Drizzle over most of the remaining oil. Season well with salt and freshly ground black pepper and griddle for a few minutes, turning frequently until lightly charred all over.", "Drizzle the honey over the skewers and transfer to the oven for 6-8 minutes, or until the chicken skewers are cooked through and lightly caramelised.", "Place the parsley leaves into a bowl and drizzle with the remaining oil and the balsamic vinegar.", "To serve, place the chicken skewers onto a warmed plate and scatter over the dressed herbs."]}, {"isVegetarian": true, "title": "Honeycomb", "url": "www_bbc_co_uk_food_recipes_honeycomb_80005", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycomb_80005_16x9.jpg", "ingredients": ["1tbsp vegetable oil, for oiling baking tray  ", "80g/3oz butter ", "160g/5½oz caster sugar ", "80g/3oz golden syrup ", "2 tsp bicarbonate of soda"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 20cm/8in square baking tin with vegetable oil.", "Gently heat the butter, sugar and golden syrup in a large heavy-based pan until the sugar has dissolved. Turn up the heat and boil rapidly, without stirring. If the mixture goes darker at one side of the mix, then gently swirl the pan to mix it all together. Keep boiling until the mixture goes a golden-brown colour – this will take about 5 minutes. ", "Add the bicarbonate of soda and stir it for a few seconds, which will make the mixture expand and fizz (take care, the mixture will expand a lot). Tip the honeycomb into the oiled baking tin and leave until cold and set. ", "To serve, cut the honeycomb into pieces and stir into ice creams or decorate puddings. You can put the honeycomb in a food processor and sprinkle it over desserts. "]}, {"isVegetarian": true, "title": "Honeycomb parfait", "url": "www_bbc_co_uk_food_recipes_honeycomb_parfait_95221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "50ml/2fl oz clear honey", "1 tbsp liquid glucose", "¾ tsp bicarbonate of soda", "oil, for greasing", "300g/11oz dark chocolate, roughly chopped", "3 free-range eggs, separated", "150g/5½oz caster sugar", "450ml/16fl oz double cream ", "2 vanilla pods, seeds removed"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the honeycomb, line a baking tray with a little oil and baking parchment. ", "Place the sugar, honey, glucose and 50ml/2fl oz water into a saucepan and bring to a boil. Continue to cook until the temperature reaches 160C/320F on a sugar thermometer.", "Remove from the heat and quickly beat in the bicarbonate of soda, stirring constantly. Pour the mixture onto the lined baking tray.", "Set aside until completely cool and then break into large pieces.", "Melt the chocolate in a bowl suspended over a pan of simmering water (do not allow the bottom of the bowl to touch the water), or in the microwave. ", "Line a baking tray with greaseproof paper.", "Dip each piece of honeycomb into the melted chocolate and then place onto the lined tray. Leave for one hour until the chocolate is set and hard.", "For the parfait, grease a loaf tin with a little vegetable oil and then line with two layers of cling film.", "In a clean mixing bowl, whisk the egg whites until soft peaks form when the whisk is removed. Gradually whisk in half of the sugar and continue to whisk until firm peaks are formed.", "Whisk the egg yolks and remaining sugar in a bowl over a pan of simmering water for about 5-6 minutes, or until the mixture thickens.", "Place the cream and scraped vanilla seeds into a separate bowl and whisk until soft peaks form when the whisk is removed from the bowl. ", "Gently fold the meringue, egg yolks and cream together in a bowl gently until just mixed together.", "Roughly chop the chocolate honeycomb and then fold it into the mixture, making sure it’s distributed evenly.", "Pour the mixture into the lined loaf tin and place in the freezer for at least for hours, or until firm.", "To serve, remove the parfait from the freezer and leave for one hour to soften slightly before slicing and serving."]}, {"isVegetarian": false, "title": "Honeycomb crunchies", "url": "www_bbc_co_uk_food_recipes_honeycomb_crunchies_45484", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeycomb_crunchies_45484_16x9.jpg", "ingredients": ["1 tsp bicarbonate of soda", "75g/2½oz caster sugar", "2 tbsp golden syrup ", "flavourless oil (such as vegetable oil), for greasing", "250g/9oz dark or milk chocolate, or a mixture", "100g/3½oz unsalted butter, cut into 1cm cubes", "2 tbsp golden syrup", "150g/5½oz digestive biscuits"], "serves": "Makes 12-16 squares", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Make the honeycomb first. Have the bicarbonate of soda measured and ready for when you need it, plus a wire whisk and an oiled baking tray. Put the sugar and golden syrup into a saucepan and set it on a very low heat. Warm gently for 10 minutes until all the sugar has melted, stirring occasionally with the wooden spoon.  ", "When the sugar is completely melted, turn up the heat to medium. Once the mixture has started to boil, leave to bubble without stirring until it turns golden-brown.  ", "Turn off the heat under the pan. Cover one of your hands with a dry tea towel or oven glove for protection, then take hold of the pan handle. Add the bicarbonate of soda and quickly whisk it in for a couple of seconds only. The mixture will froth up massively and you need to take great care as it’s extremely hot. ", "Quickly pour it into the middle of the oiled baking tray. Don’t spread it out or touch it or the tray. Leave it to cool and harden, which will take about 30 minutes. Line a square 20.5cm/8in tin with baking paper.", "Use a rolling pin to break or bash up the chocolate into small pieces. Put them in a heatproof bowl and add the butter and golden syrup. Melt gently, over a pan of hot water, giving it a stir now and then. When the chocolate mixture is smooth, carefully lift the bowl off the pan and place it on a heatproof surface.", "Put the biscuits into a plastic food bag and use the rolling pin to break them up into chunks the size of your thumbnail. Bash up the set honeycomb into chunks roughly the same size. Add the biscuits and honeycomb to the melted chocolate and mix well so all the chunks are coated.  ", "Scoop the whole lot into the lined tin and spread it evenly, right into the corners. Cover with cling film, then chill in the fridge for about two hours, or until firm and set. Cut into 16 squares with a sharp knife. Store, tightly covered, in the fridge and eat within two days. "]}, {"isVegetarian": true, "title": "Honeycomb cheesecake", "url": "www_bbc_co_uk_food_recipes_honeycombcheesecake_76812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz double cream", "few drops of vanilla essence", "2 tbsp caster sugar", "110g/4oz cream cheese", "55g/2oz cinder toffee (also called honeycomb), broken into pieces"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Whip the cream with the vanilla essence and sugar in a large bowl, to thicken.", "Fold in the cream cheese to combine, and then stir in the cinder toffee.", "Spoon the mixture into a chefs ring, lined on a serving plate and smooth off the top using a palette knife. ", "Transfer to the fridge, and allow to set.", "Once chilled, remove from the fridge and remove the ring. Serve."]}, {"isVegetarian": true, "title": "Honeycomb fool", "url": "www_bbc_co_uk_food_recipes_honeycombfool_76811", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz double cream", "100g/3½oz cream cheese", "drop of vanilla essence", "2 tbsp caster sugar", "55g/2oz cinder toffee (also called honeycomb), crushed", "¼ mango, peeled and diced", "30g/1oz cinder toffee (also called honeycomb), crushed and toasted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly whip the cream in a large bowl, to thicken. Fold in the cream cheese with the vanilla essence and sugar, to combine.", "Carefully fold in the honeycomb and mango.", "Spoon the mixture into two serving bowls or glasses.", "Sprinkle the toasted honeycomb over, to serve."]}, {"isVegetarian": false, "title": "Honeyed crispy duck", "url": "www_bbc_co_uk_food_recipes_honeyedcrispyduck_67600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts", "2 tsp honey", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a frying pan large enough to fry the duck breasts side by side.", "Add the honey and allow to bubble gently.", "Season both sides of the duck breast. Place into the frying pan skin-side down and cook gently until crisp.", "Preheat  the oven 180C/350F/Gas 4.", "Place the duck breasts into a baking dish, skin side up. Bake for 8-10 minutes (longer if you want them well done).", "Remove from the oven and leave to one side to rest for a few minutes before serving."]}, {"isVegetarian": false, "title": "Grilled squid with noodles", "url": "www_bbc_co_uk_food_recipes_honeycombsquidwithno_82145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz squid, cleaned and cut into rings", "salt and freshly ground black pepper", "2 garlic cloves, finely chopped", "½ red chilli, finely chopped", "½ stalk lemongrass, finely chopped", "1 lime, juice only", "1 tbsp soy sauce", "2 tsp sesame oil", "100g/3½oz egg noodles, cooked and drained", "1 free-range egg, beaten", "1 tsp caster sugar", "2 tbsp chopped fresh coriander (reserve some for garnish)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the squid in olive oil and season with salt and freshly ground black pepper. ", "Heat a griddle pan until smoking hot, add the squid and cook for 1-2 minutes, shaking the pan continuously, until chargrilled on all sides. Remove from the heat and keep warm.", "Heat a little olive oil in a sauté pan, add the chilli, garlic and lemongrass and cook gently for one minute. ", "Add the lime juice, soy, sesame oil and egg noodles. Stir well, and then add the beaten egg and sugar. Cook for 1-2 minutes, stirring to coat the noodles in the egg. Stir in most of the coriander.", "To serve, place a pile of noodles on a plate and top with the squid. Garnish with the remaining coriander."]}, {"isVegetarian": false, "title": "Honeyed duck confit with crispy seaweed and creamy mash", "url": "www_bbc_co_uk_food_recipes_honeyedduckconfitwit_68106", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck legs, confited in their own fat, homemade or from a can or jar", "4 tbsp clear honey", "3 tbsp olive oil", "2-3 sprigs fresh thyme, leaves stripped", "310g/11oz mashing potatoes, peeled and chopped", "3 tbsp hot milk", "120ml/4fl oz red wine", "250ml/9fl oz chicken stock ", "55g/2oz crispy seaweed", "small knob butter", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make duck confit, take 2 duck legs and weigh them.  Measure 15g of salt per 1kg meat and sprinkle the salt with fresh thyme over the legs.  Store in a fridge for at least 12 hours.  Melt duck fat (available tinned from delis) in a pan over a low heat and bring to a simmer.  Place the chilled duck legs in the fat and cook very gently for 1½-2 hours, do not boil.  Take off the heat and leave to cool in the fat.", "Heat the oven to 180C/350F/Gas 4. Scrape the fat from the legs and place in a roasting pan.  (Reserve the fat - it's good for roast potatoes or frying eggs).", "Whisk together the honey and oil and smear over the duck legs.  Sprinkle over the thyme leaves.  Roast the legs in the oven for about 20 minutes, spooning the honey glaze over the legs 2-3 times. ", "Meanwhile, boil the potatoes in a pan of lightly salted water for about 15 minutes or until just tender.  Drain, then mash with a fork, gradually beating in the hot milk, butter and plenty of seasoning.", "Place the wine and stock into the saucepan, bring to the boil and continue boiling until reduced by two thirds. Season well.", "Spoon the mashed potato onto the centre of warm serving plates, sprinkle the seaweed around the mash and sit the duck legs on top.  Scrape any meaty bits from the roasting pan and sprinkle over, then pour over the reduced red wine sauce and serve immediately."]}, {"isVegetarian": true, "title": "Honeyed yoghurt with rosewater scented peaches", "url": "www_bbc_co_uk_food_recipes_honeyedyoghurtwithro_70433", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 20z caster sugar ", "1 tbsp rosewater ", "4 peaches ", "360ml/13oz Greek yoghurt", "3 tbsp honey"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the caster sugar and rose water in a pan with 1 litre/1¾ pints of water and bring to the boil. Cut a small cross in the top of each peach, then add to the pan and simmer for 5 minutes. Take the peaches out of the syrup and slip off the skins, then return to the syrup and cook for 10 minutes until the syrup has reduced by half. Strain and cool. ", "Make the honeyed yoghurt by mixing together the yoghurt and honey, then serve with the rose-scented peaches and drizzle over some of the remaining syrup."]}, {"isVegetarian": true, "title": "Honey flapjacks", "url": "www_bbc_co_uk_food_recipes_honeyflapjacks_73203", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeyflapjacks_73203_16x9.jpg", "ingredients": ["200g/7¼oz unsalted butter", "200g/7¼oz demerara sugar", "200g/7¼oz honey", "400g/14¼oz porridge oats", "50g/1¾oz nuts, dried fruits or glacé ginger, chopped or desiccated coconut (optional)", "You will also need a 20cm x 30cm (8in x 12in) cake tin, greased"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the butter, sugar and honey in a saucepan and heat, stirring occasionally, until the butter has melted and the sugar has dissolved. Add the oats and nuts, fruit, ginger or coconut, if using, and mix well.", "Transfer the oat mixture to the prepared cake tin and spread to about 2cm (¾in) thick. Smooth the surface with the back of a spoon. Bake in a preheated oven at 180C/350F/Gas 4 for 15-20 minutes, until lightly golden around the edges, but still slightly soft in the middle. Let cool in the tin, then turn out and cut into squares."]}, {"isVegetarian": true, "title": "Honey, garlic and red pepper dressing", "url": "www_bbc_co_uk_food_recipes_honeygarlicandredpep_67768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper, chopped", "2 garlic cloves, chopped", "4 tsp clear honey", "salt and pepper", "1 cup hot water", "olive oil, to blend"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat down the red pepper and garlic in a hot pan for 2-3 minutes.", "Add the honey and then the hot water, simmer for about 1 minute.", "Blend the mixture and slowly add the olive oil to a smooth sauce consistency. Pass the dressing through a sieve, season and use."]}, {"isVegetarian": false, "title": "Honey-glazed chicken skewers with spicy stir-fried noodles", "url": "www_bbc_co_uk_food_recipes_honeyglazedchickensk_88316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast, cut into strips", "olive oil", "2 tbsp clear honey", "salt and freshly ground black pepper", "dash olive oil", "2 spring onions, sliced", "¼ green pepper, sliced", "½ fresh red chilli, chopped", "150g/5½oz egg noodles, cooked and drained", "3 tbsp chopped fresh coriander", "1 tbsp soy sauce", "splash boiling water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken skewers, thread the chicken onto two skewers and drizzle with olive oil. Heat a griddle pan, add the skewers and chargrill until golden-brown on all sides and completely cooked through. Drizzle with honey, salt and freshly ground black pepper and set aside.", "For the noodles, heat the olive oil in a pan, add the spring onions, green pepper and chilli and fry for 2-3 minutes. Add the cooked noodles and stir in the coriander and soy sauce and a splash of boiling water.", "To serve, pile the noodles onto a serving plate and top with the chicken skewers."]}, {"isVegetarian": true, "title": "Honey oranges served with vanilla sabayon", "url": "www_bbc_co_uk_food_recipes_honeyorangesservedwi_76271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "2 tbsp honey", "1 orange, peeled and cut into wedges", "1 tbsp brown sugar", "½ vanilla pod ", "2 free-range egg yolks", "2 tbsp white wine", "2 tbsp sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the honey oranges, melt the butter in a saucepan. Add the honey and cook until golden, for one minute.", "Add the orange wedges, brown sugar and vanilla pod and cook for two more minutes, until caramelised.", "For the sabayon, in a bowl whisk the egg yolks with the white wine and sugar over a pan of simmering water, until doubled in size.", "Serve the sabayon with honey oranges."]}, {"isVegetarian": false, "title": "Honey-glazed pork stuffed with mushrooms with fried rosemary and garlic sweet potatoes", "url": "www_bbc_co_uk_food_recipes_honeyglazedporkstuff_84594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz  pork chop", "2 tbsp olive oil", "1 large flat mushroom, sliced", "pinch dried chilli flakes", "2 tsp soy sauce", "1 tbsp clear honey", "1 tbsp vegetable oil", "1 sweet potato, peeled and sliced into discs", "1 garlic clove, sliced", "1 sprig fresh rosemary, leaves picked", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stuffed pork, remove some of the fat and rind from the chop with a sharp knife.", "Place the pork chop between two pieces of cling film.  Flatten out the pork with a meat mallet or the end of a rolling pin until 1cm/¼in thick.", "With a sharp knife cut a slit in the rind side of the pork chop to make a pocket.", "Heat a tablespoon of the olive oil in a small frying pan, add the sliced mushroom and chilli flakes and cook for three minutes. ", "Remove the pan from the heat and leave the mushroom mixture to cool.  Once cool enough to handle fill the pocket of the pork with the mushroom mixture. ", "Heat the remaining tablespoon of olive oil in the frying pan.  Add the pork and cook on both sides for five minutes or until golden-brown. ", "Add the soy sauce and clear honey and cook for 1-2 minutes, or until the pork is completely cooked through. Remove the pan from the heat, cover it in tin foil and leave the pork to rest for five minutes.", "For the fried sweet potatoes, the heat the vegetable oil in a small frying pan, add the sweet potatoes and fry for six minutes. ", "Add the garlic and rosemary and season well with salt and freshly ground black pepper and cook for a further 1-2 minutes or until golden-brown and cooked through.", "To serve, place the potatoes on a clean plate and top with the stuffed pork chop."]}, {"isVegetarian": true, "title": "Honey palmiers with whipped honey cream", "url": "www_bbc_co_uk_food_recipes_honeyparmierswithwhi_86213", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz ready-rolled puff pastry", "1 free-range egg, beaten", "4 tbsp honey", "icing sugar, to dust", "150ml/¼ pint double cream", "2 tbsp icing sugar", "1 tbsp wildflower honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the honey palmiers, preheat the oven to 200C/400F/Gas 6.", "Lay the pastry on a clean worksurface, brush the edges with beaten egg and drizzle half the honey over the pastry. Fold both side edges of the pastry inwards until they meet in the middle. Drizzle with the rest of the honey. ", "Cut the pastry 'sausage' into 2.5cm/1in pieces and lay each one flat on a baking sheet. Bake for 8-10 minutes, or until puffed up and golden. Slide onto a serving plate and dust liberally with icing sugar.", "For the whipped honey cream, whip the double cream until it forms soft peaks when the whisk is removed. Fold in the icing sugar and honey.", "To serve, spoon the honey cream into a serving bowl beside the palmiers."]}, {"isVegetarian": false, "title": "Honey-roast duck with sautéed potatoes, chilli spinach and plum chutney", "url": "www_bbc_co_uk_food_recipes_honeyroastduckwithsa_80925", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz new potatoes", "1 tbsp olive oil", "2 cloves garlic, roughly chopped", "25g/1oz fresh rosemary leaves", "1 tbsp olive oil", "½ red onion, finely sliced", "1 tbsp brown sugar", "2 plums, stones removed and chopped", "100ml/2½ fl oz red wine", "1 lime, juice only", "salt and freshly ground black pepper", "1 duck breast, skin scored", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp honey", "75g/2¾oz spinach", "1 tbsp olive oil", "1 clove garlic, finely chopped", "pinch dried chilli flakes", "½ red onion, finely sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sautéed potatoes, boil the potatoes for ten minutes, until soft, then drain and slice in half lengthways.", "Heat the oil in a frying pan over a medium heat. Add the garlic and rosemary and fry for one minute.", "Add the slices of potato and sauté for eight minutes, turning once, until golden on both sides.", "To make the chutney, heat the oil in a frying pan over a medium heat. Add the onions and fry for five minutes until softened.", "Add the brown sugar and plums and cook to caramelise with the onions for two minutes.", "Add the red wine and lime juice, bring to the boil and simmer to reduce to a thick chutney consistency.", "For the duck, rub the duck with the oil and season well with salt and freshly ground black pepper.", "Place a frying pan over a medium heat. When hot, add the duck skin-side down and fry for five minutes, to release some of the duck fat.", "When the skin has browned, pour off the excess duck fat, then turn the breast and cook for a further three minutes. Drizzle over the honey and cook for a further two minutes, or until cooked to your liking. Remove from the heat and allow to rest on a warm plate for two minutes.", "For the spinach, heat the oil in a frying pan over a medium heat. Add the onions, garlic and chilli and fry for 3-4 minutes, until softened.", "Add the spinach and sauté for 4-5 minutes, until wilted down. Drain any excess moisture from the spinach and season, to taste, with salt and freshly ground black pepper.", "To serve, place the spinach in the centre of a warm plate. Place the duck breast on top of the spinach, arrange the sautéed potatoes around the plate and spoon over the chutney."]}, {"isVegetarian": true, "title": "Honey, ricotta and raisin cake", "url": "www_bbc_co_uk_food_recipes_honeyricottaandraisi_86780", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz water biscuits, crushed", "75g/2½oz demerara sugar", "125g/4½oz butter, melted", "1kg/2¼lb ricotta", "6 free-range eggs", "100g/3½oz sugar", "100ml/3½fl oz honey", "200g/7oz pistachios, shells removed, lightly crushed ", "200g/7oz golden raisins", "100ml/3½fl oz honey", "100g/3½oz pistachios", "Greek-style yoghurt, to serve"], "serves": "Serves 12-14", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the base, mix the water biscuits, sugar and melted butter together in a bowl, then press the mixture into the base of a 25cm/10in springform cake tin.", "For the topping, beat the ricotta, eggs, sugar and honey together in a bowl.", "Fold in the crushed pistachios and golden raisins, then spoon the topping mixture onto the base.", "Transfer to the oven and bake for an hour, or until set and lightly golden-brown. Remove from the oven and allow to cool completely.", "For the sauce, place the honey and pistachios into a pan and heat gently to warm through.", "To serve, slice the cake into wedges, pour over the sauce and serve with thick Greek-style yoghurt."]}, {"isVegetarian": false, "title": "Honey mustard pork chops with peppercorn", "url": "www_bbc_co_uk_food_recipes_honeymustardporkchop_71672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp wholegrain mustard ", "1 tsp runny honey", "2 pork chops", "50g/2oz butter", "1 red onion, halved and sliced", "2 Golden Delicious apples, peeled, cored and cut into 8 slices", "200g/7oz new potatoes, lightly cooked and halved", "1 tsp wholegrain mustard", "6 shredded fresh sage leaves", "3 finely chopped shallots", "1 tbsp green peppercorns", "small glass cider", "100ml/3½fl oz double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the wholegrain mustard with the runny honey.  Slice the back fat on the chops in three places to stop them curling, then slather liberally with the honey mustard. ", "Place then in a medium hot griddle pan and cook for six minutes each side. ", "In another pan melt a little butter and add the onions and apples and cook for two or three minutes. ", "Next add the potatoes and another teaspoon of mustard. The idea is to warm everything together. Just before serving add the sage and season.", "Make the peppercorn sauce. In a hot pan place a knob of butter and allow it to foam. ", "Add the shallots and peppercorns and cook for a minute. Add a splash of cider and bring to the boil. ", "Add the double cream and cook until it thickens and colours. Season. ", "To serve, place the chop on the plate, pile apple and potatoes around and spoon over the sauce."]}, {"isVegetarian": false, "title": "Honey-glazed duck served with coriander and mango couscous", "url": "www_bbc_co_uk_food_recipes_honeyglazedduckserve_88148", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, skin scored", "salt and freshly ground black pepper", "1 tbsp clear honey", "3 cloves", "1 tbsp olive oil", "150g/5½oz couscous", "300ml/½ pint hot chicken stock", "pinch chilli flakes", "½ mango, peeled, stone removed, diced", "2 tbsp chopped fresh coriander", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the scored duck breast with salt and freshly ground black pepper. Heat an ovenproof pan until smoking hot, add the duck breast, skin side down and fry for 3-4 minutes, or until golden-brown. Turn the duck breast over and transfer the pan into the oven to roast for five more minutes. ", "Remove from the oven and drizzle the duck breast with the honey and insert the cloves into the skin. Return to the oven for five minutes, or until the duck is cooked but still slightly pink in the middle. Remove from the oven and rest in a warm place for five minutes, discard the cloves and slice the meat thinly.", "For the coriander and mango couscous, heat the olive oil in a saucepan, add the couscous and fry for 2-3 minutes. Add enough stock to the pan to just cover the couscous, and add the chilli flakes, mango and coriander. Season, to taste, with salt and freshly ground black pepper and stir well. Leave for 2-3 minutes or until the couscous grains have soaked up the liquid and are light and fluffy. Fluff up the couscous with a fork. ", "To serve, spoon the couscous into the middle of a serving plate and place the thinly sliced duck in a fan shape around the side. Drizzle any pan juices over the duck."]}, {"isVegetarian": false, "title": "Honey-roast duck with spiced Puy lentils", "url": "www_bbc_co_uk_food_recipes_honeyroastduckwithsp_81021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small red onion, finely chopped", "1 tsp finely chopped fresh ginger", "2 cloves garlic, finely chopped", "½ red chilli, chopped", "½ tsp ground ginger", "½ tsp ground chilli", "½ tsp ground cloves", "½ tsp ground mace", "knob of butter", "100g/3½oz Puy lentils", "150ml/5fl oz red wine", "2 limes, zest and juice", "1 tbsp soy sauce", "25g/1oz fresh coriander, chopped", "salt and freshly ground black pepper", "creamy mash, to serve", "2-3 tbsp runny honey", "4-6 duck breasts", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "To make the lentils place the onion, garlic, ginger and chilli in a blender with the ground spices, and a drop of water. Blend to a paste, then fry the paste in a little butter for a few minutes, stirring all the time.", "Add the lentils and wine and simmer gently for 20-25 minutes until the lentils are cooked. ", "Meanwhile, for the duck, place a dry large frying pan on the heat. Add the honey and cook over a low heat until golden and bubbling. ", "Place the duck breasts in the pan, skin-side down. Season with salt and freshly ground black pepper and move around in the pan, using tongs, to coat the duck breasts in the honey.", "Transfer the duck breasts to a roasting tin, skin-side up. Pour the honey from the pan over the top. Place in the oven for 8 minutes or more, until cooked to your liking, then remove and allow to rest before slicing.", "Remove the lentils from the heat and add the lime zest and juice, soy and chopped coriander. Season with salt and freshly ground black pepper.", "Serve the sliced duck on a bed of creamy mash with the lentils spooned round the edge."]}, {"isVegetarian": false, "title": "Honey-roasted chilli pork with sweet potato mash", "url": "www_bbc_co_uk_food_recipes_honeyroastedchillipo_85398", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ sweet potato, peeled and cut into cubes", "salt and freshly ground black pepper ", "30g/1oz butter", "1 x 100g/3½oz piece pork fillet", "salt and freshly ground black pepper ", "2 tsp olive oil", "1 garlic clove, chopped", "1 tbsp soy sauce", "1 tbsp clear honey", "pinch chilli powder", "small handful fresh chives, chopped, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweet potato mash, boil the sweet potato in a saucepan of salted water for 6-8 minutes until tender. Drain, return to the pan and season with salt and freshly ground black pepper. Add the butter and mash with a potato masher or push through a potato ricer until smooth. Cover and set aside to keep warm.", "For the pork, season the pork with salt and freshly ground black pepper.", "Heat the oil in a frying pan and fry the pork for 4-5 minutes. Add the garlic and cook for a further minute.", "Add the soy sauce, honey and chilli and cook for a further 3-4 minutes, or until the pork is completely cooked through and the sauce has reduced slightly.", "To serve, slice the pork into three pieces and place onto a plate with the sweet potato mash. Pour over the pan juices and garnish with chives."]}, {"isVegetarian": false, "title": "Honey-roasted duck with wild mushroom tarragon and spinach sauce", "url": "www_bbc_co_uk_food_recipes_honeyroastedduckwith_85538", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz duck breasts, just removed from the fridge", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "4 tbsp clear honey", "2 tsp Chinese five-spice powder", "115g/4oz unsalted butter", "1 shallot, finely chopped", "salt and freshly ground black pepper", "150g/5oz wild mushrooms ", "1 tbsp lemon juice", "75ml/3fl oz water ", "1 tbsp tarragon, finely chopped", "1 tbsp olive oil", "200g/7oz baby spinach"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Score the skin of each duck breast with a very sharp knife first: you can pop the knife in the freezer for a few minutes to make it easier. Score the fatty skin of the duck breast in a criss-cross manner, but be careful not to cut all the way through the meat. ", "Season the duck with salt and freshly ground black pepper to taste. Pour the oil into a thick, flat-based pan and heat to a high temperature. Place the breasts into the pan, skin-side down. Cook at a fairly high temperature for about a minute, until the skin renders, taking care not to burn the fat. ", "Once the skin is golden-brown and crisp, turn the breasts over with tongs and sear the other side for about a minute. Return it once again to the pan, skin-side down, and cook for about 5-8 minutes until cooked all the way through.", "Meanwhile, mix the honey and Chinese five-spice powder together in a small bowl.", "When the duck is cooked, remove from the pan, brush with the honey and spice and allow to rest in a warm place for at least 5-8 minutes. ", "For the sauce, heat a lidded frying pan on medium heat and add 25g/1oz of the butter, the shallots and a pinch of salt.", "Cook the shallots without the lid until softened, but not coloured - about 2-3 minutes.", "Add the wild mushrooms and lemon juice and cover with a lid. Cook for a further minute.", "Add the water, bring to the boil and whisk in the remaining butter. ", "Season with salt and freshly ground black pepper and then add the tarragon. ", "Heat the oil in a separate frying pan and add the spinach. Cook until the spinach has wilted. ", "To serve, divide the spinach between four plates, slice the duck breasts in half lengthways and place on top of the spinach, and spoon the mushroom sauce around."]}, {"isVegetarian": true, "title": "Honey-roasted fig and red onion crostini", "url": "www_bbc_co_uk_food_recipes_honeyroastedfigandre_88010", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ red onion, finely sliced", "1 garlic clove, chopped", "1 tsp soft brown sugar", "2 tsp balsamic vinegar", "1 fig, halved", "1 tbsp clear honey", "2 slices baguette, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the olive oil in a pan, add the red onion and fry over a gentle heat for five minutes until softened.", "Add the garlic and sugar and cook for 1-2 minutes. Add the balsamic vinegar and cook for three minutes.", "Place the halved fig onto a baking sheet and drizzle with honey. Roast for five minutes in the oven.", "To serve, spread the caramelised onions onto the toasted baguette slices and top with the honey-roasted figs."]}, {"isVegetarian": false, "title": "Honey-roasted pork belly with roasted salmon and sautéed savoy cabbage", "url": "www_bbc_co_uk_food_recipes_honeyroastedporkbell_86161", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2½lb pork belly", "1 onion, roughly chopped", "2 sprigs fresh thyme", "200ml/7fl oz dry white wine", "salt and freshly ground black pepper ", "4 tbsp clear honey", "4 x 85g/3oz salmon fillet, skinned", "1 tbsp olive oil", "½ savoy cabbage, finely chopped", "2 tbsp roughly chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/340F/Gas 3.", "Score the fat of the pork belly diagonally in a criss-crossed fashion.", "Pour a kettle-full of boiling water over the pork to tighten the skin, then drain and pat dry with kitchen paper.", "Place the onion, thyme, and white wine into a deep roasting tray and season well with salt and freshly ground black pepper.", "Place the pork into the roasting tray and transfer to the oven to roast for two hours, basting occasionally.", "Remove the pork and increase the oven heat to 220C/425F/Gas 7.", "Take the pork out of the tray and place onto a chopping board. Set aside the tray containing the cooking liquor. Cut the pork into 10cm/4in squares and place onto a clean roasting tray.", "Pour half of the honey over the squares of pork belly then place the tray into the oven and cook for 15 minutes, or until the pork top is golden-brown and crisp, and the meat completely cooked through.", "Meanwhile, strain the cooking liquor into a pan over a medium heat and add the remaining honey. Bring to the boil, season well with salt and freshly ground black pepper, and reduce the liquid volume by a third.", "Heat an ovenproof frying pan until hot. Season the salmon with salt and freshly ground black pepper and place into the pan. Cook for 1-2 minutes on each side, until golden-brown all over, then place the pan in the oven alongside the pork and cook for 5-6 minutes, or until just cooked through.", "Heat a clean large frying pan until hot and add the olive oil, cabbage and parsley. Stir-fry for 3-4 minutes, until the cabbage has softened, but retains a little bite. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of cabbage in the centre of each plate. Top with a piece of pork and then place a piece of salmon on top of the pork. Spoon the reduced pan juices around the plate and serve."]}, {"isVegetarian": false, "title": "Honey-roasted spicy leg of lamb", "url": "www_bbc_co_uk_food_recipes_honeyroastedspicyleg_86764", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.2kg/41b 13½oz leg of lamb", "2 tbsp vegetable oil", "5 tbsp lemon juice", "15g/½oz fresh ginger, peeled and roughly chopped", "6 large cloves garlic, peeled and roughly chopped", "1 tbsp ground cumin ", "1 tbsp ground coriander ", "¼tsp red chilli powder", "salt, to taste ", "1 tbsp garam masala", "½tsp freshly ground black pepper", "2 tbsp water", "100g/3½oz almonds, blanched", "100ml/3½fl oz Greek yoghurt", "1½ tbsp honey"], "serves": "Serves 5-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Blend together all the ingredients for the marinade in a blender or food processor.", "Trim the excess fat and membranes from the leg of lamb. Make deep regular cuts all over the flesh with a short, sharp knife. Rub in the marinade, making sure you get it into the deep cuts. Place the lamb in a plastic food bag with the marinade and leave in the fridge, ideally for 24 hours, or for a minimum of 6-8 hours. ", "For the honey rub, blend together 70g/2½oz of the almonds, the yoghurt and half the honey in a blender or food processor. Take the lamb out of the fridge and remove the plastic bag. Rub the honey blend into the lamb and ideally leave the lamb for another two hours (or at least 30 minutes), covered, in the fridge. Remove the lamb from the fridge and bring to room temperature before cooking. ", "Preheat the oven to 225C/425F/Gas 7 and place the lamb on a rack with a roasting tray underneath. Cook for 15 minutes then lower the heat to 180C/350F/Gas 4 and cook for another 1 hour 40 minutes, or until the meat juices run fairly pink when pierced, basting every 20-30 minutes.", "Scatter over the remaining almonds and drizzle over the remaining honey and roast for another ten minutes. Check if the meat is cooked using a meat thermometer. The temperature should be 130-150C. The higher the temperature the more well cooked the meat will be.  ", "Remove the lamb from the oven. Cover it with foil and allow to rest for 15 minutes. Pour out the juices, spoon off any excess fat, and serve it on the side. Serve the lamb with roasted potatoes and a vegetable of your choice."]}, {"isVegetarian": true, "title": "Honey-roast parsnips", "url": "www_bbc_co_uk_food_recipes_honeyroastparsnips_88223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large parsnip", "35g/1¼oz butter", "1 tbsp clear honey", "1 tbsp brown sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Peel and core the parsnip and cut it into wedges.", "Heat the butter in an ovenproof frying pan and add the parsnip wedges. Fry until they begin to colour. Drizzle over the honey and sprinkle over the sugar. ", "Stir to combine and then place the pan into the oven. Roast for 15-20 minutes, or until the parsnips are golden-brown and tender. Serve."]}, {"isVegetarian": false, "title": "Honey sesame seed chicken with chilli and parsley rice", "url": "www_bbc_co_uk_food_recipes_honeysesameseedchick_89442", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "pinch cayenne pepper", "salt and freshly ground black pepper", "1 chicken thigh, bone removed", "1 tbsp clear honey", "1 tbsp sesame seeds", "2 tbsp olive oil", "1 red chilli, chopped", "2 tbsp chopped fresh parsley", "150g/5oz long grain rice, cooked according to packet instructions", "salt and freshly ground black pepper", "2 whole fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the honey sesame seed chicken, heat an ovenproof chargrill pan over a medium heat. Mix the olive oil, cayenne pepper and seasoning in a bowl, and coat the chicken with the mixture.", "Fry the chicken for 3-4 minutes in an ovenproof frying pan over a medium heat, or until crisp and golden-brown. Drizzle the honey over the chicken and bake in the oven for 10-12 minutes, or until the chicken is cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Remove the chicken from the oven and sprinkle with the sesame seeds. ", "For the chilli and parsley rice, heat one tablespoon of the oil in a separate frying pan over a medium heat. Fry the chilli, parsley and rice for 4-5 minutes, and season to taste with salt and freshly ground black pepper. ", "To serve, brush the insides of a teacup or similar with the remaining oil. Spoon the chilli and parsley rice mixture into the cup, press the rice down so that the rice moulds to the cup, then turn the rice out onto a plate. Place the honey and sesame seed chicken on top of the rice, and garnish with the fresh chives."]}, {"isVegetarian": false, "title": "Honey-seared chicken with carrot and ginger fried noodles", "url": "www_bbc_co_uk_food_recipes_honeysearedchickenwi_88188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast, skinless, cut into strips", "dash olive oil", "½ orange, juice and zest", "15g/½oz fresh root ginger, grated", "1 tbsp clear honey", "salt and freshly ground black pepper", "150g/5½oz egg noodles", "dash olive oil", "½ carrot, cut into fine ribbons", "1 garlic clove, finely chopped", "pinch paprika", "25g/1oz fresh root ginger, finely sliced into matchsticks", "pinch dried chilli flakes", "2 tbsp soy sauce", "½ orange, zest and juice", "1-2 tsp sesame oil", "small handful fresh parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the honey-seared chicken, drizzle the chicken with olive oil. Heat a pan and fry the chicken for 1-2 minutes. Add the orange juice and zest, ginger, honey, salt and freshly ground black pepper and fry for a further 1-2 minutes, or until golden-brown and cooked through. ", "For the noodles, cook the noodles according to the packet instructions and drain.", "Heat the olive oil in a wok, add the carrot ribbons and fry gently for 1-2 minutes. Add the garlic, paprika, sliced ginger and chilli flakes and fry for one minute. Add the soy sauce, orange juice and zest and sesame oil and fry for a further minute. Stir in the chopped fresh parsley and the cooked noodles.", "To serve, pile the noodles onto a serving plate and top with the honey-seared chicken."]}, {"isVegetarian": true, "title": "Honey, thyme and fig brioche", "url": "www_bbc_co_uk_food_recipes_honeythymeandfigbrus_87365", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fresh figs", "2 tbsp clear honey", "30g/1oz butter, cubed", "2 sprigs fresh thyme", "2 slices brioche, griddled", "ready-made vanilla custard, warmed, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut a cross into the top of each fig and squeeze the bottom slightly to open it out. Place in a gratin dish, drizzle over the honey, butter and thyme and bake for 6-7 minutes.  ", "Remove from the oven and place on top of the griddled brioche on a serving plate. Pour over the warm vanilla custard and serve immediately."]}, {"isVegetarian": true, "title": "Honey, thyme and balsamic vinegar-roasted figs with honey and orange yoghurt", "url": "www_bbc_co_uk_food_recipes_honeythymeandbalsami_86176", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 figs", "2 tsp balsamic vinegar", "1 tbsp honey", "1 sprig fresh thyme, leaves only", "100ml/3½fl oz Greek-style yoghurt", "½ tsp ground cinnamon", "1 tbsp honey", "1 orange, zest and a squeeze of juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the roasted figs, cut off the tops of the figs and make a cross in the top of each. Squeeze gently to open the figs up slightly.", "Place the figs onto a large piece of foil and drizzle with the balsamic vinegar, honey and thyme. Seal to make a parcel by scrunching the edges together.", "Heat an ovenproof frying pan and place the parcel into the pan.", "Transfer the pan to the oven and roast for five minutes. Place the parcel onto a serving plate.", "For the honey and orange yoghurt, place the yoghurt, cinnamon, honey, orange zest and juice into a small bowl and mix well.", "To serve, open up the fig parcel and top with the yoghurt."]}, {"isVegetarian": false, "title": "Hong Kong-style fried fish and squid balls with dark soy noodles", "url": "www_bbc_co_uk_food_recipes_hong_kong-style_fried_75618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dried folded flat rice noodles", "1 tsp toasted sesame oil ", "200g/7oz whole haddock fillet, skin removed, roughly chopped ", "100g/3½oz squid, cleaned, roughly chopped", "pinch sea salt flakes", "pinch ground white pepper ", "1 tsp oyster sauce ", "1 tsp Shaoxing rice wine (or dry sherry)", "1 large free-range egg white", "1 tbsp cornflour ", "1 tbsp finely sliced coriander stems", "rapeseed oil, for deep frying", "handful kale leaves", "1 tsp finely ground sea salt", "1 tsp ground white pepper", "3 tsp sugar ", "few sprigs coriander leaves  ", "1 tbsp rapeseed oil ", "1 tbsp freshly grated root ginger ", "3 shiitake mushrooms, stalks removed, sliced", "100g/3½oz smoked tofu, sliced into thin batons ", "1 tsp premium dark soy sauce ", "2 tbsp light soy sauce ", "1 tbsp oyster sauce (optional)", "pinch caster sugar ", "100g/3½oz raw beansprouts, washed", "1 large bunch (4–5) purple spring onions, julienned ", "1 tbsp toasted sesame oil ", "1 tsp chilli oil"], "serves": "Makes 12 balls", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring 1.5 litres/2½ pints of water to the boil and add the dried rice noodles. Cook for 10 minutes until al dente, drain under cold water, drizzle over the sesame oil and toss together to prevent the noodles from sticking. Set aside.", "For the coriander fish balls, place the chopped haddock and squid in a food processor, add the salt, ground white pepper, oyster sauce, Shaoxing rice wine, egg white and cornflour, and mix well to a light paste.", "Spoon out into a bowl, sprinkle over the finely chopped coriander stems and mix well. Using two spoons, shape into balls – the mixture should make 12 balls of 3.5cm/1¾ in diameter.", "Quater-fill a deep-fat fryer or wok with the rapeseed oil and preheat to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.) Drop in the balls and cook until they float to the surface and turn golden-brown. Carefully spoon the balls out and drain on kitchen paper. ", "For the garnish, drop the kale one by one into the oil and fry until crisp, then drain on kitchen paper. Combine the salt, ground white pepper and sugar in a small bowl. Lightly dust the kale with the mixture to coat.", "For the noodle stir-fry, heat a wok over high heat, add the rapeseed oil until hot. Add the ginger for a few seconds, then add the shiitake mushroom and smoked tofu pieces and cook for 2 minutes, or until browning at the edges. ", "Sprinkle over the crispy kale and fresh coriander and serve immediately with the coriander fish balls."]}, {"isVegetarian": true, "title": "Spiced hot coconut drink", "url": "www_bbc_co_uk_food_recipes_horlixier_49938", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/horlixier_49938_16x9.jpg", "ingredients": ["2 tbsp carob (available from health food stores)", "1 tsp vanilla extract", "½ tsp almond extract", "1-2 tsp date syrup (available from delicatessens or online specialists) or maple syrup", "1-2 tsp maca powder (optional; available from health food stores)", "¼ tsp salt", "400g tin full-fat coconut milk"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the ingredients and 300ml/10½fl oz water together in a food processor until super-smooth and well combined.", "Transfer the mixture to a pan and warm over a gentle heat.", "Serve immediately in mugs."]}, {"isVegetarian": false, "title": "Horseradish and mustard beef casserole", "url": "www_bbc_co_uk_food_recipes_horseradish_and_mustard_10990", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/horseradish_and_mustard_10990_16x9.jpg", "ingredients": ["3 tbsp sunflower oil", "1.5kg/3lb 5oz braising steak, diced", "3 large onions, roughly chopped", "6 garlic cloves, crushed or finely chopped", "300ml/10fl oz beef stock", "50g/1¾oz plain flour", "300ml/10fl oz dry white wine", "3 tbsp Worcestershire sauce", "1 tbsp light muscovado sugar ", "salt and freshly ground black pepper", "500g/1lb 2oz chestnut mushrooms, halved", "3 tbsp Dijon mustard", "3 tbsp creamed horseradish sauce", "3-4 tbsp double cream (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 2 tablespoons of the oil in a deep, heavy-based, flameproof, lidded casserole over a high heat. Add the beef, in batches if necessary, and fry for 4-5 minutes, or until browned all over. Remove the meat from the casserole using a slotted spoon and set aside. ", "Heat the remaining oil in the pan, add the onions and garlic and fry, stirring well, for 4-5 minutes, or until softened, scraping up any browned bits from the bottom of the casserole using a wooden spoon. Stir in the beef stock.", "In a large bowl, whisk the flour with a little of the wine until smooth, then gradually pour in the remaining wine, whisking until combined to a smooth batter with the consistency of double cream.", "Return the browned beef to the casserole, then pour over the wine and flour mixture. Bring to the boil, stirring until thickened, then add the Worcestershire sauce and sugar and season, to taste, with salt and freshly ground black pepper. Cover the casserole with the lid, reduce the heat until the mixture is simmering, and simmer very gently for 2 hours, stirring from time to time (alternatively, cook the casserole in a low oven). ", "After 2 hours, add the mushrooms, return the mixture to the boil, then cover again, reduce the heat until the mixture is simmering, and simmer for a further ½ hour, or until the meat is tender.", "Mix the mustard, horseradish and double cream (if using) in a bowl until well combined. Just before serving, stir it into the casserole. Serve with mashed potatoes and steamed vegetables. "]}, {"isVegetarian": false, "title": "Hot and spicy Thai squid salad (Yam pra-muek)", "url": "www_bbc_co_uk_food_recipes_hot_and_spicy_thai_squid_01824", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_and_spicy_thai_squid_01824_16x9.jpg", "ingredients": ["3 bird's-eye chillies, finely chopped, seeds optional", "1 garlic clove, finely chopped ", "2 heaped tbsp palm sugar ", "2 tbsp Thai fish sauce ", "½ lime, juice only", "400g/14oz baby squid, tentacles reserved", "1 garlic clove, finely chopped ", "20 garlic chives with flowers (or a bunch of chives), cut into 2.5cm/1in lengths", "5 spring onions, trimmed, cut in half and quartered lengthways ", "5 Thai shallots (or 1 banana shallot), finely sliced ", "20 plum cherry tomatoes, halved", "½ cucumber, cut in half, seeds removed, thickly sliced", "large handful mint leaves ", "handful Thai basil leaves (alternatively use normal basil) ", "thumb-sized piece of ginger, peeled and thinly sliced ", "2 tbsp vegetable oil ", "1 tbsp sesame oil "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, grind the chillies and garlic together with the other dressing ingredients in a pestle and mortar. Set aside.", "For the salad, clean and prepare the squid, cutting it in half and keeping the tentacles. Remove the skin and score. Set aside.", "Combine the garlic, garlic chives (or chives), spring onions, Thai shallots (or banana shallots), cherry tomatoes and cucumber in a large bowl with the fresh mint leaves and Thai basil leaves (or normal basil).", "Heat a wok or large frying pan with the vegetable and sesame oil. Once hot, fry the ginger and cook until just turning golden-brown. Add the squid and tentacles and cook for about another 1½ minutes, or until the squid has curled up and is just cooked.", "Add the dressing from the pestle and mortar to the hot squid and toss through, then add the hot squid to the salad and mix thoroughly, serve straightaway."]}, {"isVegetarian": true, "title": "Horseradish sauce", "url": "www_bbc_co_uk_food_recipes_horseradishsauce_1304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz freshly grated horseradish, soaked in 2 tbsp hot water", "1 tbsp white wine vinegar", "pinch of English mustard powder", "pinch of caster sugar", "salt and pepper to taste", "150ml/5fl oz double cream, lightly whipped"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Drain the soaked horseradish and mix with all the other ingredients."]}, {"isVegetarian": false, "title": "Hot and sour chicken", "url": "www_bbc_co_uk_food_recipes_hot_and_sour_chicken_08241", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz premium grade sushi rice, washed well and rinsed in cold water until the water runs clear", "2 medium red chillies, seeds removed and sliced", "4 garlic cloves, finely chopped", "1 tbsp chilli bean paste ", "1 tbsp tamari", "2 tbsp rice vinegar", "4 tbsp organic honey", "1 tbsp groundnut oil", "1 garlic clove, finely chopped", "2.5cm/1in piece fresh root ginger, peeled and sliced into matchsticks", "4 large chicken thighs, skin off, de-boned, and sliced into 1cm/½in cubes", "1 tbsp Shaoxing rice wine, or dry sherry ", "2 large courgettes, sliced into long, thin strips sliced using a peeler", "1 garlic clove, finely chopped", "1 tsp grated root ginger", "1 medium red chilli, seeds removed and finely chopped", "1 tsp tamari ", "1 tsp Chinkiang black rice vinegar or balsamic vinegar ", "½ tbsp toasted sesame oil", "1 tsp Sichuan chilli oil", "1 spring onion, finely chopped", "1 small handful ground, fried dry baby shrimp", "1 pinch ground toasted Sichuan peppercorns"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Add the washed sushi rice to a large saucepan. Add 500ml/18fl oz water and bring to the boil. Once boiling, put a tight lid on and reduce the heat to a simmer. Cook the rice for 30 minutes, or until the water has evaporated, the base is slightly golden-brown and the rice is toasted (when turned out of the pan the rice should come out in one whole layer). Take off the heat and half cover – this will keep the rice warm, but also let the steam scape to keep the bottom crisp.", "For the sauce, put all the ingredients into a bowl and set aside.", "For the chicken, heat a wok over a high heat until smoking hot. Add the groundnut oil and swirl around the oil to coat the sides of the pan. Add the garlic and ginger and toss around the pan. Then add in the chicken and brown all over. Pour in the Shaoxing rice wine. ", "Add all the sauce ingredients and cook over a high heat, stirring all the time, until the sauce has reduced and is glossy and thick. Take off the heat.", "For the courgette noodles, fill a large pan with 1 litre/1¾ pint boiling water and add the courgette strips. Keep them moving around in the water for 1-2 minutes, then drain thoroughly and add to a bowl. Stir in the remaining ingredients and set aside.", "To serve, turn out the rice onto a large round sharing plate. Dress the hot and sour courgettes around the sides of the rice and pour the hot and sour chicken in the middle (including the pan juices). To garnish, sprinkle over some spring onions, ground fried dry shrimp and toasted Sichuan pepper."]}]