[{"ingredients": ["Canal de pollo de 1.8kg / 4lb (tostado o sin tostar), cortado en pedazos", "2 cebollas pequeñas", "2 dientes", "2 zanahorias", "2 puerros", "1 tallo de apio", "3 dientes de ajo", "3 ramitas grandes de perejil", "2 ramitas de tomillo", "1 hoja de laurel", "1 cucharadita de sal gruesa", "10 granos de pimienta", "2 litros / 3½ pintas de agua"], "method": ["Coloque todos los ingredientes en una olla o en una olla grande, hierva y cocine por 2-3 horas, rociándola regularmente.", "Cuele y use de inmediato, o deje enfriar y colóquelo en recipientes herméticos.", "La reserva puede congelarse hasta que se necesite o mantenerse en el refrigerador por unos días."], "url": "www_bbc_co_uk_food_recipes_homemadechickenstock_71470", "title": "Caldo casero de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1.3 litros", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 g / 10% C2% BDoz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids)% 20or% 20milk% 20chocolate", "glaseado para piping huevos de Pascua"], "method": ["Pula el interior de cada molde con un trozo de papel toalla de cocina. Luego humedezca un pedazo de toalla de cocina con un poco de aceite sin sabor, hará girasol, y pule el interior de cada molde con el aceite. Esto garantiza un acabado muy pulido del chocolate y también ayuda a liberar el chocolate del molde.", "Es esencial para templar el chocolate: este es un método para calentar y enfriar chocolate para recubrimiento o moldeado. El calentamiento y enfriamiento separa los sólidos de cacao y asegura que el chocolate establecido tendrá un alto brillo y un acabado liso. Para atemperar el chocolate necesitará un termómetro de cocina, un recipiente a prueba de calor y una olla con agua caliente. Rompa el chocolate en pedazos pequeños y parejos y derrita suavemente en un recipiente sobre una cacerola de agua caliente, no hirviendo. Coloque el termómetro en el chocolate y caliente hasta que alcance los 43 ° C / 110 ° F. Retire el fuego y enfríelo a 35C / 95F. Ahora está listo para usar.", "Vierta cucharadas del chocolate en cada molde. Agitar hasta recubrir, use el cepillo de pastelería si es necesario y luego eliminar el exceso de chocolate. Deje que se fije, con el lado plano hacia abajo sobre una superficie, como una bandeja grande, cubierto con papel resistente a las grasas. Llena cada molde de la misma manera. Deberá repetir el proceso otras dos o tres veces para formar una buena capa de chocolate en cada molde. Espere unos 20 minutos para que el chocolate se coloque entre las capas. Dibuje una regla limpia o el borde plano de un cuchillo sobre el chocolate para asegurar un borde limpio cada vez que agrega una capa. Esto es importante para que los dos lados del huevo se unan uniformemente. Deje enfriar en una despensa o en un lugar fresco hasta que se endurezca.", "Con cuidado desmolde las mitades de huevo y colóquelas sobre una superficie limpia, teniendo cuidado de no manipular demasiado el chocolate, ya que comenzará a derretirse por el calor de sus manos.", "Para unir los dos bordes de un huevo, caliente una bandeja para hornear y luego coloque los bordes de las dos mitades sobre ella por unos segundos, luego empuje suavemente los bordes juntos.", "Para decorar los huevos, coloque un huevo en un vaso o una taza pequeña y póngalo de pie mientras canaliza el mensaje deseado sobre el huevo. Puede envolver sus huevos en papel celofán y etiquetarlos para regalar o colocarlos en una cesta y ofrecerlos a los invitados."], "url": "www_bbc_co_uk_food_recipes_homemadechocolateeas_4891", "title": "Huevos de Pascua caseros de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 6-8 huevos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadechocolateeas_4891_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz harina natural, más extra para harina", "1 limón, ralladura solamente", "1 naranja, solo ralladura", "50 g / 1½ oz de azúcar en polvo", "50g / 1½ oz de arándanos frescos", "2 huevos de gallinas camperas"], "method": ["Precaliente una bandeja para hornear en el horno a 200C / 400F / Gas 6.", "Coloque todos los ingredientes en el recipiente de un procesador de alimentos y mezcle hasta que los ingredientes se hayan combinado y formado una masa.", "Coloque la masa sobre una superficie enharinada y dé forma a la masa, con las manos enharinadas, en forma de ciabatta larga.", "Coloque la chapata sobre la bandeja para hornear caliente y hornee durante 15 minutos, o hasta que esté cocido y de color marrón dorado. Retirar del horno y dejar enfriar durante dos minutos.", "Cortar diagonalmente en rodajas finas para hacer el biscotti.", "Para servir, coloca el biscotti en un tazón limpio."], "url": "www_bbc_co_uk_food_recipes_homemadecranberrybis_84810", "title": "Biscotti de arándano hecho en casa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de cilantro, tostadas en una sartén seca", "100 ml / 3½ fl oz de agua", "250ml / 9fl oz de yogurt natural", "1½ cucharadita de levadura seca", "550g / 1lb 3½oz de harina normal fuerte, más extra para espolvorear", "1 cucharada de sal", "2 cucharadas de aceite vegetal, más extra para cepillar", "Garbanzos enlatados de 400g / 14oz, enjuagados y escurridos", "4 dientes de ajo", "Pasta de tahini 50g / 2oz", "3 limones, solo jugo", "100g / 3½ oz de pimientos Peppadew o pimientos encurtidos dulces de un tarro", "aceite de oliva virgen extra, al gusto", "sal y pimienta negra recién molida", "6 aceitunas", "1 chile rojo, a la brasa"], "method": ["Tueste las semillas de cilantro en una sartén seca a fuego medio durante 1-2 minutos, hasta que se tornen doradas.", "Transfiera las semillas tostadas a un almirez y mortero y aplastelas ligeramente.", "Coloque las semillas de cilantro trituradas en una sartén con el agua y deje que hierva.", "Coloque el yogur en un recipiente y agregue la levadura.", "Vierta las semillas de cilantro y el agua en la mezcla de yogur y revuelva bien.", "Agregue 200 g / 7 oz de la harina y use sus manos para combinar bien. Cubra el recipiente y déjelo para probar durante 25 minutos (preferiblemente en algún lugar cálido, pero esto no es esencial).", "Convierta la masa en una superficie ligeramente enharinada. Agregue la sal, el aceite y la harina restante y mezcle bien para combinar completamente.", "Coloque la masa de nuevo en su tazón, cubra y deje probar durante una hora. (La masa debería haber duplicado su tamaño).", "Voltea la masa en una superficie ligeramente enharinada y amasa ligeramente durante un minuto.", "Divida la masa en seis y enrolle en bolitas.", "Ruede cada bola plana hasta 10cm-12.5cm / 4in-5in círculos.", "Caliente una sartén de plancha o una sartén grande y poco profunda. Cepille cada círculo de masa con un poco de aceite y cocine los panes planos durante unos 30 segundos en cada lado, o hasta que estén dorados por todas partes.", "Para el hummus, coloque todos los ingredientes de hummus, excepto el aceite, en un procesador de alimentos y mezcle hasta que quede suave.", "Con el motor del procesador de alimentos en funcionamiento, agregue una corriente constante de aceite para aflojar la mezcla, hasta obtener la consistencia de su elección.", "Transfiera el hummus a un plato o tazón y adorne con las aceitunas y el chile a la parrilla.", "Para servir, coloca el tazón de hummus en un plato grande y coloca los panes planos alrededor del tazón."], "url": "www_bbc_co_uk_food_recipes_homemadeflatbreadwit_85657", "title": "Flatbread casero con hummus de pimiento rojo picante", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "Harina normal de 50g / 2oz, tamizada", "1 x 135g / 4¾oz paquete de gelatina de naranja, picado", "1 cucharada de mermelada de naranja", "125ml / 4½fl oz de agua hirviendo", "200 g / 7 oz de chocolate negro de buena calidad, con un mínimo de 70% de sólidos de cacao, roto en pedazos"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para las tortas, ponga a hervir un poco de agua en una sartén, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue los huevos y el azúcar al tazón y bata continuamente durante 4-5 minutos, o hasta que la mezcla esté pálida, esponjosa y bien combinada.", "Agregue la harina, batiendo continuamente, hasta que se forme una pasta espesa y suave.", "Llene a la mitad cada pocillo en una lata para panecillos de 12 hoyos con la masa para pasteles. Transfiera la lata al horno y hornee los pasteles durante 8-10 minutos, o hasta que estén pálidos dorados y cocidos (los pasteles se cocinan cuando una brocheta insertada en el centro de los pasteles sale limpia). y ponga los pasteles a un lado, aún en su bandeja, hasta que estén frescos.", "Mientras tanto, para el relleno, en un recipiente, mezcle la gelatina, la mermelada y el agua hirviendo hasta que la jalea se haya disuelto y la mezcla esté suave. Vierta la mezcla de relleno en una bandeja para hornear de lados poco profundos o en un plato grande para formar una capa de gelatina de 1 cm / ½ pulgada. Dejar de lado hasta que esté completamente frío, luego enfriar en la nevera hasta que se endurezca.", "Cuando la gelatina se haya solidificado y los pasteles se hayan enfriado, corte los discos pequeños de la capa de gelatina, de diámetro igual a los pasteles. Sentar un disco de gelatina encima de cada pastel.", "Ponga un poco de agua a hervir en una sartén, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue el chocolate y revuelva hasta que se derrita, liso y brillante, luego vierta sobre los pasteles. Guarde a un lado hasta que el chocolate derretido se haya enfriado y puesto."], "url": "www_bbc_co_uk_food_recipes_homemadejaffacakes_91480", "title": "Pasteles de jaffa caseros", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12 pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadejaffacakes_91480_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de 300 g / 11 oz tipo '00' (disponible en secciones de horneado de supermercado y algunas delicatessen), más extra para quitar el polvo", "3 huevos de gallinas camperas", "60 g / 2½ oz de hojas de albahaca fresca, más extra para servir", "50g / 2oz de piñones, tostados", "50g / 2oz de queso parmesano, recién rallado", "1 diente de ajo, pelado", "75ml / 3fl oz de aceite de oliva virgen extra", "5 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 apio en barra, finamente picado", "Mejillones de 2kg / 4lb 4oz, limpios, barba eliminados (deseche cualquier mejillón que permanezca abierto después del enjuague)", "150ml / 5fl oz de vino blanco", "2 dientes de ajo, pelados, finamente picados", "800 g / 1 libra de tomates en conserva de 12 onzas", "6 hojas de albahaca fresca", "sal y pimienta negra recién molida"], "method": ["Para el linguini, mezcle la harina y los huevos en un procesador de alimentos hasta que formen migas pequeñas. Retire del procesador y amasar sobre una superficie ligeramente enharinada durante 2-3 minutos, o hasta que la masa esté suave y elástica.", "Cubra la masa con film transparente y deje enfriar en la nevera durante 20 minutos.", "Para hacer el linguini, pese alrededor de 300 g / 11 oz de la masa de pasta (puede almacenar la masa de pasta restante en el refrigerador durante tres días o en el congelador hasta por tres meses). Enharina ligeramente una superficie de trabajo limpia y trabaje la masa reposada en forma de rectángulo rugoso con los dedos.", "Harina la máquina de pasta. Comenzando por la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa al pasar por la máquina con la otra. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez.", "Una vez que las hojas de pasta han alcanzado el grosor ideal, recorte los bordes ligeramente. Fije el accesorio de corte a la máquina de pasta, enharinando bien. Pase las hojas de masa por la máquina una vez más, cortándolas en linguini. Espolvorea bien el linguini con harina y colócalo en un plato. Enfríe en la nevera mientras prepara la salsa.", "Para el pesto, mezcle la albahaca, los piñones, el parmesano y el ajo en un procesador de alimentos para obtener un puré fino. Agregue el aceite de oliva y continúe mezclando hasta obtener una pasta gruesa.", "Para el mejillón y la salsa de tomate, caliente 2½ cucharadas de aceite de oliva en una sartén tapada a fuego medio. Freír la cebolla y el apio durante 1-2 minutos, o hasta que se ablanden.", "Agregue los mejillones y el vino blanco y cubra la sartén con su tapa. Cueza al vapor durante 2-3 minutos, o hasta que se hayan abierto todos los mejillones. (Deseche cualquier mejillón que no se haya abierto).", "Cuele los mejillones a través de un colador fino en un recipiente. Reserve el líquido de cocción.", "Usando sus manos, deseche las cáscaras de la mitad de los mejillones y deje a un lado la carne de mejillón. (Aparte los mejillones restantes en sus caparazones también).", "Regrese la sartén en la que se cocinaron los mejillones al fuego y agregue las 2½ cucharadas soperas restantes de aceite de oliva. Freír el ajo durante 30 segundos, o hasta que se dore.", "Agregue el líquido de cocción reservado, los tomates enlatados y la albahaca y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 8-10 minutos, o hasta que el volumen de la mezcla se haya reducido en un tercio. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar todos los mejillones cocidos reservados.", "Mientras tanto, trae una olla grande de agua con sal a ebullición. Retire el linguini preparado del refrigerador y aflójelo cuidadosamente con los dedos para separar los cordones. Cocine el linguine en el agua hirviendo por 2-3 minutos, o hasta que esté tierno, luego drene.", "Revuelva el linguini cocido en el mejillón y la salsa de tomate.", "Para servir, mezcle el mejillón y el linguini de tomate en cada uno de los cuatro platos para servir y cubra cada uno con una cucharada de pesto y unas hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_homemadelinguinewith_93221", "title": "Linguini casero con salsa de mejillones y tomate y pesto", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz, más extra para espolvorear", "200g / 7oz de mantequilla fría, en cubos", "1 yema de huevo de gallinas camperas", "2-3 cucharadas de agua, para unir", "2 manzanas, peladas, sin corazón y en rodajas", "2 cucharadas de azúcar en polvo", "½ cucharadita de canela molida", "Crema doble de 200 ml / 7 fl oz", "½ cucharadita de canela molida", "1 cucharada de azúcar glas, más extra para rociar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pastel, coloque la harina y 175 g / 6 oz de la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue el huevo, luego agregue el agua suficiente, una cucharada a la vez, para unir la mezcla. Mezcle brevemente para juntar la mezcla como una masa.", "Incline la masa sobre una superficie de trabajo enharinada y amase suavemente. Forma una bola y rueda hacia un círculo plano con el grosor de una moneda de una libra. Coloque en una bandeja para hornear forrada con pergamino a prueba de grasa.", "Coloque la manzana rebanada en la masa, dejando un espacio de 2,5 cm en los bordes, luego espolvoree el azúcar impalpable y la canela y salpique con la mantequilla restante. Dibuje los bordes de la masa para formar una costra y pellizque para mantenerla en su lugar. Hornee durante 8-10 minutos en el horno, o hasta que la masa esté dorada y crujiente.", "Para la crema de canela, bata la crema en un bol con la canela y el azúcar glas hasta que se formen picos suaves cuando se quite la batidora.", "Sirva la tarta de manzana con cucharadas de crema de canela y una pizca de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_homemadeopenapplepie_90694", "title": "Tarta de manzana casera abierta con crema de canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aceite de cacahuete de 290ml / ½ pinta", "2 huevos, solo yemas", "1 diente de ajo, aplastado", "1 cucharadita colmada de mostaza en polvo", "1 cucharadita de sal", "pimienta negra recién molida", "1 cucharadita de vinagre de vino blanco"], "method": ["Antes que nada, ponga las yemas de huevo en el recipiente, agregue el ajo triturado, la mostaza en polvo, la sal y un poco de pimienta negra recién molida. Mezcle todos estos juntos bien. Luego, sosteniendo el aceite de cacahuete en una jarra en una mano y un batidor de mano eléctrico en la otra, agrega una gota de aceite a la mezcla de huevo y báñala.", "Por estúpido que parezca, la clave de una mayonesa exitosa es asegurarse de que cada gota de aceite se incorpore por completo antes de agregar la siguiente gota. No tomará todo el día, porque después de unos minutos, una vez que haya agregado varias gotas de aceite, la mezcla comenzará a espesar y se pondrá muy rígida y con bultos. Cuando llegue a esta etapa, debe agregar una cucharadita de vinagre, que diluirá la mezcla.", "Ahora que ha pasado el punto crítico, puede comenzar a verter el aceite en un flujo muy, muy delgado pero constante, manteniendo los batidores funcionando todo el tiempo. Cuando se haya agregado todo el aceite, pruebe y agregue más sal y pimienta si lo necesita. Si desea que la mayonesa sea un poco más liviana, en esta etapa agregue cucharadas de agua hirviendo y agréguela.", "La mayonesa solo cuaja cuando agrega el aceite demasiado rápido al principio. Si eso sucede, no te desesperes. Todo lo que necesita hacer es poner una yema de huevo fresca en un recipiente limpio, agregarle la mezcla cuajada (gota a gota), luego continuar agregando el resto del aceite como si nada hubiera sucedido."], "url": "www_bbc_co_uk_food_recipes_homemademayonnaise_67195", "title": "La mayonesa casera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 290 ml / ½ pinta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de harina natural, más extra para enharinar", "3 huevos de gallinas camperas", "1 cucharada de aceite de oliva, más extra para lloviznar", "2 cucharadas de aceite de oliva", "3 cucharadas de piñones", "1 diente de ajo, pelado", "gran puñado de cohetes", "sal y pimienta negra recién molida"], "method": ["Para la pasta, coloque la harina, los huevos y el aceite de oliva en un procesador de alimentos y pulse hasta que se combinen.", "Convierta la masa en una superficie ligeramente enharinada y amasar brevemente hasta que quede suave. Corta la masa por la mitad y coloca una pieza a un lado.", "Estirar la mitad de la masa hasta 1 cm / ½ pulgada de espesor, luego alimentar a través de una máquina de pasta. Comience con la configuración más gruesa, pase la hoja varias veces y baje la configuración hasta que alcance la configuración más delgada. Cortar la hoja de pasta en cintas de 1cm / ½ de ancho. Repita el proceso con el resto de la masa.", "Coloque la pasta en una olla grande de agua hirviendo con sal y cocine durante 2-3 minutos, hasta que esté al dente. Escurra bien, coloque en un tazón grande y rocíe con aceite de oliva.", "Para el pesto de rúcula, coloque todos los ingredientes del pesto en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Para servir, vierta el pesto sobre la pasta y mezcle bien para cubrir. Coloque la pasta en dos tazones para servir."], "url": "www_bbc_co_uk_food_recipes_homemadepastawithroc_85298", "title": "Pasta casera con pesto de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla grande, pelada, en rodajas", "Tocino rayado de 150g / 5½oz, cortado en cubitos", "4 tallos de apio picados", "2 dientes de ajo, pelados, finamente picados.", "2 zanahorias, peladas, cortadas en cubitos", "2 papas, peladas, cortadas en cubitos", "1 litro / 1 pinta 15¼fl oz de caldo de carne", "30g / 1oz de puré de tomate", "400 g / 14 oz de alubias en conserva, escurridas", "1 hoja de laurel", "1 cucharadita de hojas frescas de tomillo", "puñado de perejil fresco picado", "Tomates 400g / 14 oz, picados", "Espagueti 100g / 3½ oz, roto en pedazos de 2cm / 1in", "sal y pimienta negra recién molida", "1 pan crujiente de pan blanco, cortado en rodajas gruesas", "1 cucharada de aceite de oliva", "200 g / 7 oz de mozzarella, rasgada"], "method": ["Calentar el aceite en una sartén y freír la cebolla, el tocino, el apio, el ajo y las zanahorias durante 2-3 minutos, o hasta que se ablanden.", "Agregue las papas y fría por otros 2-3 minutos. Verter en el caldo y llevar la mezcla a ebullición. Agregue el puré de tomate y cocine a fuego lento durante 45 minutos.", "Agregue las alubias, las hierbas, los tomates picados y los espaguetis y continúe cocinando hasta que la pasta esté tierna. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para los croûtons, rocíe el pan con el aceite de oliva.", "Caliente una sartén hasta que esté caliente y fría el pan por un lado durante 2-3 minutos o hasta que se dore. Mientras tanto, precalentar la parrilla a fuego alto.", "Retire el pan de la sartén y cubra el lado crudo con la mozzarella. Coloque debajo de la parrilla durante 2-3 minutos, o hasta que el queso esté burbujeante y dorado.", "Para servir, cuela la sopa en 4 soperas y cúbrela con un croûton."], "url": "www_bbc_co_uk_food_recipes_homemademinestrone_93768", "title": "Minestrone hecho en casa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemademinestrone_93768_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de carne de cerdo picada y grasosa", "50g / 2oz de pan rallado", "1 huevo de gallinas camperas, golpeado", "1 diente de ajo, aplastado", "1 cucharada de perejil fresco o mejorana", "3 cucharadas de aceite de oliva o girasol", "sal y pimienta negra recién molida", "1,5 kg / 3lb 5 oz patatas harinosas, fregadas", "100 g / 3½ oz de mantequilla", "500g / 1lb 2oz de repollo verde, hojas externas retiradas y descartadas, hojas interiores en rodajas", "250ml / 9fl oz de leche caliente", "2 cucharadas de perejil fresco picado", "1 manzana grande para cocinar, pelada, sin corazón y picada", "1 cucharada de agua", "25-50 g / 1-2 oz de azúcar en polvo"], "method": ["Para las salchichas, coloque todos los ingredientes, excepto el aceite de oliva, en un recipiente y mezcle bien, sazone bien con sal y pimienta negra recién molida. (Freír un poco de la mezcla en una sartén caliente con un poco de aceite de oliva o de girasol para verificar el condimento. Agregar más si es necesario).", "Divida la mezcla en 12 piezas y dé forma a cada una en forma de salchicha. Coloque en una bandeja o bandeja para hornear y déjelas a un lado hasta que quiera cocinarlas. (Enfriarlos por un día en el refrigerador está bien, o puede congelarlos).", "Para cocinar las salchichas, caliente una sartén a fuego medio o bajo, agregue dos cucharadas de aceite de oliva o de girasol y fría las salchichas durante 12-15 minutos, volteándolas de vez en cuando, hasta que estén doradas por todos lados y completamente cocidas.", "Para el colcannon, cocine las papas en agua hirviendo con sal durante 10 minutos, luego escurra tres cuartas partes del agua y continúe cocinando a fuego lento hasta que estén tiernas.", "Cuando esté cocido, drene toda el agua restante. Una vez que esté lo suficientemente frío como para manejarlo, pele las papas y luego machaque con la mitad de la mantequilla.", "Caliente una sartén hasta que esté caliente y agregue la mantequilla restante, dos cucharadas de agua y la col en rodajas. Cocine a fuego medio durante 5-7 minutos, revolviendo con frecuencia, hasta que esté bien cocido.", "Agregue la mezcla de repollo a las papas, luego agregue la mayor parte de la leche caliente y el perejil, manteniendo parte de la leche en caso de que no lo necesite todo. Sazonar, al gusto, con sal y pimienta negra recién molida, y batir hasta que quede cremoso y suave, agregando más leche, si es necesario, para lograr su consistencia preferida.", "Para la salsa de manzana, coloca la manzana en una sartén pequeña con el agua. Cubra con una tapa y cocine a fuego lento, revolviendo ocasionalmente, hasta que la manzana se haya convertido en pulpa. Agregue azúcar al gusto.", "Para servir, coloque una cucharada de colcannon en cada plato y coloque una perilla de mantequilla en el centro para que se derrita. Agregue tres salchichas a cada plato y una cucharada de salsa de manzana tibia al lado."], "url": "www_bbc_co_uk_food_recipes_homemadeporksausages_85815", "title": "Salchichas de cerdo caseras con colcannon y salsa de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear", "pizca de sal", "25 g / 1 oz de azúcar en polvo", "50g / 2oz de mantequilla sin sal, ligeramente suavizada", "150ml / ¼ litro de leche", "1 huevo, batido o harina común, para cepillar o quitar el polvo"], "method": ["Precaliente el horno a 220C / 425F / Gas 7.", "Tamiza la harina, el polvo de hornear y la sal en un bol. Agregue el azúcar, agregue la mantequilla y frote rápidamente en la harina, creando una consistencia de migas finas.", "Agregue la leche, poco a poco, trabajando para obtener una masa suave.", "Ahora es mejor dejarlo descansar entre 5 y 15 minutos antes de rodar.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada hasta 2 cm / ¾ de espesor. Con un cortador de pasteles de 5 cm / 2 pulgadas, corte la masa, usando un golpecito fuerte y sin retorcer la masa al cortar. Torcer la mezcla de scone dará lugar a un aumento desigual.", "Una vez cortados, los bollos se pueden cepillar con el huevo batido para obtener un glaseado brillante o espolvorear con la harina para obtener un acabado mate.", "Coloque los bollos en una bandeja de horno engrasada y hornee en el horno precalentado durante 10-12 minutos hasta que estén dorados. Deje que se enfríe un poco, y sirva mientras aún esté caliente."], "url": "www_bbc_co_uk_food_recipes_homemadescones_73976", "title": "Bollos caseros", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 8-10 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemadescones_73976_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "¼ cucharadita de semillas de cilantro", "¼ cucharadita de semillas de comino", "pizca de copos de chile", "pellizcar jengibre molido", "2 tomates, desollados, sin semillas y finamente picados"], "method": ["Caliente el aceite de oliva en una sartén pequeña a fuego medio. Agregue las cebollas y fría por 2-3 minutos, hasta que estén suaves.", "Coloque las semillas de cilantro, las semillas de comino, las hojuelas de chile y el jengibre en un almirez y mortero, y mézclelas en polvo.", "Agregue las especias molidas, los copos de chile y los tomates a las cebollas y cocine a fuego lento a fuego lento durante 10 minutos, o hasta que el tomate se haya ablandado y se convierta en una salsa.", "Para servir, vierta en un recipiente y deje enfriar."], "url": "www_bbc_co_uk_food_recipes_homemadetomatoketchu_81722", "title": "Ketchup de tomate casera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 8fl oz de vinagre de sidra", "1 hoja de laurel", "½ cucharadita de cilantro molido", "½ cucharadita de canela molida", "8 cucharadas de azúcar Demerara", "Tomates maduros de 1,5 kg / 3 lb, descuartizados, sin semillas", "1 cucharadita de sal", "1 cucharada de mostaza inglesa en polvo", "1 diente de ajo, aplastado", "salsa de tabasco", "2 cucharadas de puré de tomate", "½ cucharadita de harina de maíz, si es necesario", "125g / 4½oz de pan rallado fresco", "½ cucharadita de pimienta de cayena", "4 pechugas de pollo deshuesadas y sin piel, cortadas en tiras", "Harina normal de 50g / 2oz", "3 huevos medianos de granja, golpeados"], "method": ["Para la salsa de tomate, coloque el vinagre, la hoja de laurel, el cilantro, la canela y el azúcar en una cacerola de base pesada y cocine a fuego lento.", "Agregue todos los ingredientes restantes de salsa de tomate, excepto el aciano, y lleve a ebullición, revolviendo ocasionalmente para evitar que se pegue o queme.", "Una vez que hierva, reduzca la temperatura y cocine a fuego lento, revolviendo con frecuencia, durante 30 minutos. (NB: tenga cuidado de que la mezcla no se queme o atrape en la base de la sartén, ya que esto arruinaría la salsa).", "Retirar del fuego y dejar enfriar durante unos minutos. Transfiera a un procesador de alimentos o licuadora y mezcle hasta que quede suave. Empuja la salsa a través de un colador en un recipiente y deja que se enfríe por completo.", "Si encuentra que el ketchup es demasiado fino una vez que está frío, colóquelo en una sartén y hierva hasta que espese, revolviendo con frecuencia. Si es necesario, agregue media cucharadita de harina de maíz mezclada a una pasta con agua; esto evitará que el agua de tomate se separe del ketchup, pero tenga cuidado de no hacer que tenga almidón y demasiado espeso.", "Para los goujons de pollo, caliente una freidora a 190C / 375F.", "Mezcle las migas de pan y la pimienta de cayena en un recipiente y reserve.", "Dragar el pollo con la harina y sumergirlo en el huevo batido.", "Sumerja el pollo en las migas de pan picantes, asegurándose de que todo el pollo esté bien cubierto.", "Coloque con cuidado los goujons en la freidora por lotes y cocine durante aproximadamente 3-4 minutos, hasta que estén crujientes y dorados, y el pollo esté completamente cocido. Con cuidado, quite con una espumadera y escurra sobre papel de cocina. Repita hasta que todos los goujons estén cocidos.", "Para servir, coloque los goujons de pollo en un plato grande con un tazón de salsa de tomate al lado."], "url": "www_bbc_co_uk_food_recipes_homemadetomatoketchu_85534", "title": "Ketchup de tomate casero con goujons de pollo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente rebanada", "1 diente de ajo, aplastado", "½ papa grande, pelada, picada", "½ apionabo, pelado, picado", "sal y pimienta negra recién molida", "300ml / ½ litro de caldo de verduras calientes", "1 cucharada de cebollín fresco picado, para decorar"], "method": ["Calentar el aceite de oliva en una cacerola, agregar la cebolla y freír a fuego lento hasta que se ablande.", "Agregue el ajo y cocine por un minuto.", "Agregue la papa y el apio nabo y sazone al gusto con sal y pimienta negra recién molida.", "Agregue el caldo y cocine durante diez minutos, o hasta que la papa y el apionabo se hayan ablandado. Retire las verduras y el caldo del fuego y deje enfriar durante unos minutos, antes de licuar con una batidora. Alternativamente, no mezcle abeto con una sopa de estilo rústico.", "Para servir, vierta en un recipiente y decore con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_homestyleceleriacsou_87169", "title": "Sopa de apio nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Sal de mesa 15g / ½oz", "2 cucharaditas de hojas de tomillo", "2 cucharaditas de romero finamente picado", "2 dientes de ajo, finamente picados", "4 patas de pato", "600ml / 20fl oz de grasa de pato", "2 hojas de laurel", "50 g / 1¾oz de mantequilla sin sal", "2 cucharadas de aceite de oliva", "Tocino de tocino 150 g / 5½ oz", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado", "1 zanahoria pequeña, finamente picada", "1 apio en barra, finamente picado", "2 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "300g / 10½oz de lentejas Puy", "175ml / 6fl oz de vino tinto", "450ml / 16fl oz de caldo de carne", "2 cucharadas de buen vinagre de Jerez", "2 cucharadas de cilantro fresco", "1kg / 2lb 4oz de patatas Maris piper, peladas y cortadas en trozos", "300ml / 10fl oz de leche entera", "300 ml / 10 fl oz doble crema", "150g / 5½oz de mantequilla sin sal", "50g / 1¾oz de mantequilla", "4 cucharadas de miel clara", "Jus de ternera 200ml / 7fl oz o caldo de carne reducido, calentado"], "method": ["Precaliente el horno a 140C / 120C Fan / Gas 1.", "Para el pato confitado glaseado con miel, ponga la sal, el tomillo, el romero y el ajo en un bol y mezcle. Agregue las patas de pato, cubra con la mezcla y deje marinar en la nevera durante 24 horas.", "Enjuague las patas de pato para lavar la mezcla de sal. Coloque en una cacerola o cacerola con tapa de horno y agregue la grasa de pato y las hojas de laurel. Llevar a fuego lento a fuego medio. Cubra con la tapa y transfiéralo al horno por 2 horas y media.", "Para las lentejas con especias, agregue la mantequilla y el aceite a una sartén. Una vez caliente, agregue los tocino lardon y cocine hasta que estén dorados y crujientes. Agregue la cebolla y cocine durante 2 minutos, luego agregue el ajo, la zanahoria, el apio y las especias y cocine por otros 2 minutos.", "Agregue las lentejas y el vino tinto y deje que hierva, cocine hasta que el vino haya reducido el volumen a la mitad, luego agregue el caldo y cocínelo durante 25-30 minutos, o hasta que las lentejas estén blandas. Termine con el vinagre de Jerez y el cilantro fresco.", "Para el puré de papa, coloque las papas en una sartén grande con agua con sal y deje que hierva, cocine de 15 a 20 minutos o hasta que estén tiernas.", "Escurra las papas, luego machaque bien o pásele un ricer de papas. Agregue la leche, la crema y la mantequilla y mezcle hasta que quede suave.", "Para servir, calentar una sartén y agregar la mantequilla. Una vez caliente, agregue las patas de pato drenados y el color en ambos lados. Agregue la miel a la sartén y glasee el pato con los jugos de la sartén.", "Pon una cucharada de lentejas en cada plato y coloca una pierna de pato encima. Sirva el puré de patatas al lado. Termine con el jus cálido o el stock reducido."], "url": "www_bbc_co_uk_food_recipes_honey-glazed_confit_duck_74877", "title": "Pato confitado glaseado con miel con lentejas y puré de patatas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 4 oz de gallina de Guinea lista para el horno", "2 cucharadas de aceite de girasol", "½ cucharadita de chile picado seco", "½ cucharadita de polvo chino de cinco especias", "½ cucharadita de sal marina en copos", "pimienta negra recién molida", "1 piña madura grande, alrededor de 1kg / 2lb 4oz", "½ pepino", "½ gran granada", "2 cucharadas de miel clara", "1 cucharada de salsa de soja oscura", "50g / 1¾oz racimo de cilantro fresco", "25g / 1oz manojo de menta fresca", "½ cebolla roja pequeña", "1 lima grande, solo jugo", "hoja de plátano, para servir (opcional)"], "method": ["Precaliente el horno a 200C / 180C (ventilador) / Gas 6. Para preparar las gallinas de Guinea, coloque el pájaro sobre sus pechos sobre una tabla de cortar resistente y corte con cuidado a cada lado de la columna vertebral con tijeras o tijeras para aves de corral. Descarta el hueso. Corta el extremo de las articulaciones del pie y las puntas de las alas y deséchalo.", "Abra la gallina de Guinea y colóquela en el tablero de modo que el lado de la pechuga quede hacia arriba. Presione fuertemente con las palmas de sus manos para romper el esternón y aplanar al ave lo más uniformemente posible. Esto lo ayudará a cocinar más rápido.", "Rocíe una bandeja para hornear con una cucharada de aceite y coloque la gallina de Guinea en la parte superior. Frote todo con el aceite restante y meta las piernas y las alas.", "Mezcle los chiles triturados, cinco especias, sal marina y mucha pimienta negra recién molida en un tazón pequeño. Espolvorea sobre la gallina de Guinea y frota en la piel con las manos. Ase la gallina de Guinea por 20 minutos.", "Mientras la gallina de Guinea está cocinando, coloque la piña en un tablero y corte la parte superior e inferior. Quite la piel espinosa con un cuchillo afilado y cave cualquier \"ojo\" con la punta de su cuchillo. Corta la piña longitudinalmente en sextas y quita el núcleo central. Cortar la piña en rodajas de triángulo de aproximadamente 1,5 cm / and en triángulos y ponerla en un bol.", "Pelar el pepino y cortar longitudinalmente por la mitad. Cortar en rebanadas de 1cm / ½ y agregar a la piña. Golpea la parte trasera de la granada con una cuchara de madera para desalojar las semillas; es posible que tengas que ayudar a algunas de ellas con un cuchillo o una cuchara. Coloque las semillas y cualquier jugo en un tazón. Mezcle la miel y la salsa de soja en un tazón pequeño.", "Saque el pájaro del horno y cepille con la mezcla de miel. Vuelva al horno por otros 10-15 minutos o hasta que esté bien cocido, dorado y brillante. (Los jugos deben quedar limpios cuando se perfora la parte más gruesa de uno de los muslos con un pincho.) Mientras el ave continúa asándose, recorte el cilantro y deseche los tallos. Elija las hojas de los tallos de la menta. Pele y corte finamente la cebolla roja. Pon las hierbas y la cebolla a un lado.", "Transfiera la gallina de Guinea a un tablero y déjela descansar durante unos minutos mientras se realiza el vendaje. Incline el contenido de la bandeja de hornear en un recipiente resistente al calor y déjelo reposar durante cinco minutos. Con cuidado, saque la grasa que haya salido a la superficie con una cuchara.", "Revuelva el jugo de lima fresco en los jugos de la sartén, poco a poco, probando entre las adiciones. Usted quiere que el aderezo sea ácido pero no agrio. Sazone el aderezo con un poco de sal y pimienta y una pizca de salsa de soja adicional si lo desea.", "Tallar las gallinas de Guinea en trozos gruesos y colocar sobre una hoja de plátano limpia, o un plato grande para servir, con la piña y el pepino. Esparce las hierbas y la cebolla encima. Espolvoree con las semillas de granada y cualquier jugo y mezcle muy ligeramente. Rocíe sobre el aderezo de lima y sirva inmediatamente mientras la gallina de Guinea está caliente."], "url": "www_bbc_co_uk_food_recipes_honey-glazed_guinea_fowl_24715", "title": "Pintada con glaseado de miel y piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey-glazed_guinea_fowl_24715_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal, suavizada, más extra para engrasar latas", "150 g / 5½ oz de almendras molidas", "70g / 2½ oz de polenta", "Harina normal de 80g / 3oz", "1 cucharadita de bicarbonato de soda", "140 g / 5 oz de miel", "1 gran pomelo rojo, ralladura finamente rallada solamente", "2 huevos grandes de gallinas camperas", "200g / 7oz de jugo de pomelo rojo", "200 g / 7 oz de jugo de naranja de sangre", "160g / 5¾oz de miel clara", "1 pomelo rojo", "1 naranja", "100g / 3½ oz de jarabe de arce", "250g / 9oz de mascarpone"], "method": ["Para la torta, precaliente el horno a 170C / 150C Fan / Gas 3.", "Alinee la base de una lata redonda de 20cm / 8pulg con papel de hornear y unte con mantequilla.", "Combine las almendras, la polenta, la harina y el bicarbonato de soda en un recipiente y reserve.", "En un mezclador independiente, bata la mantequilla hasta que quede suave, luego agrega la ralladura de miel y pomelo.", "Poco a poco golpee los huevos y los ingredientes secos reservados. Vierta la mezcla en la lata y hornee durante aproximadamente 30 minutos.", "Para el jarabe de cítricos, mezcle el pomelo y el jugo de naranja y la miel en una cacerola y caliente suavemente hasta que la miel se haya derretido. Llevar a ebullición y cocine a fuego lento hasta que la temperatura llegue a 105 ° C en un termómetro de azúcar. Retire del fuego.", "Una vez que el pastel esté cocido, déjelo a un lado para que se enfríe. Pinche la superficie de la torta con un pincho y rocíe con la mitad del sirope de cítricos.", "Para la cáscara confitada, hierva un hervidor lleno de agua. Use un pelador de patatas para eliminar las rodajas de la piel de cítricos.", "Agregue la cáscara a una cacerola y cubra con agua hirviendo. Hierva durante 2 minutos, luego quite la cáscara y deseche el agua. Repite este proceso dos veces hasta que se elimine la amargura de la cáscara.", "Agregue el jarabe de cítricos restante a una olla. Agregue la cáscara y cocine por 5-10 minutos hasta que esté transparente. Dejar de lado para enfriar.", "Para la crema de arce, calentar el jarabe de arce en una sartén pequeña y hervir hasta que se reduzca a la mitad. Dejar de lado para enfriar. Batir el mascarpone hasta que quede suave, luego agregar el jarabe de arce reducido.", "Para armar el pastel, cubra con la crema de arce y coloque la cáscara confitada encima."], "url": "www_bbc_co_uk_food_recipes_honey_and_grapefruit_24386", "title": "Pastel de polenta de miel y pomelo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 patas de pollo", "6 cucharadas de ketchup de tomate", "2 cucharadas de puré de tomate", "2 cucharadas de mostaza granulada", "3 cucharadas de salsa Worcestershire", "2 cucharadas de miel líquida", "1 diente de ajo, aplastado"], "method": ["Con un cuchillo afilado, haga hendiduras superficiales en la parte superior de las patas de pollo y acomódelas en un plato poco profundo.", "Mida todos los ingredientes para el adobo en un tazón y revuelva hasta que se combinen. Vierta sobre el pollo y revuelva para cubrir. Cubra y coloque en la nevera durante al menos 30 minutos.", "Precalentar el horno a 220 C / 200 Fan / Gas 7.", "Cubra una lata de asar con papel de hornear, y coloque las patas de pollo en la parte superior, en una sola capa. Cuchara sobre el adobo y asar durante 35-40 minutos, o hasta que esté pegajoso, dorado y cocido. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_honey_chicken_39457", "title": "Pollo pegajoso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_chicken_39457_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pato", "15g / ½ oz de sal de mesa por kilo de patas de pato", "2 cucharaditas de hojas de tomillo", "2 cucharaditas de romero finamente picado", "2 dientes de ajo, finamente picados", "600ml / 20fl oz de grasa de pato", "2 hojas de laurel", "2 cucharadas de aceite de oliva", "4 cucharadas de miel", "50 g / 1¾oz de mantequilla sin sal", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado", "1 zanahoria pequeña, finamente picada", "1 apio en barra, finamente picado", "¼ de puerro, finamente picado", "300g / 10½oz de lentejas Puy", "175ml / 6fl oz de vino tinto", "450ml / 16fl oz de caldo de carne", "2 cucharadas de buen vinagre de Jerez", "2 cucharadas de cilantro fresco picado", "4 rebanadas de panceta, cocida"], "method": ["Para el confit de miel de pato, precalentar el horno a 140 ° C / 275 ° F / Gas 1.", "Mezcle la sal, las hierbas y el ajo en un tazón con las patas de pato para cubrirlas. Cubra el recipiente y déjelo durante 24 horas en la nevera.", "Enjuaga las patas de pato y lava la mezcla de sal del pato. Coloque en una olla a prueba de horno con una tapa y agregue la grasa de pato y las hojas de laurel.", "Traiga a fuego lento, luego ponga la tapa y cocine en el horno durante 2 horas y media. Retire el pato de la grasa y reserve.", "Para las lentejas Puy, caliente una sartén o una sartén grande, luego agregue la mantequilla y el aceite. Una vez caliente, agrega la cebolla y cocina durante dos minutos. Agregue el ajo, la zanahoria, el apio y el puerro y cocine por otros dos minutos.", "Agregue las lentejas y el vino tinto y deje que hierva. Cocine hasta que el vino se haya reducido a la mitad, luego agregue el caldo y cocine las lentejas durante 25-30 minutos. Mezcle el vinagre de jerez y el cilantro.", "Para terminar las piernas de pato, caliente el aceite en una sartén, una vez caliente agregue la miel. Cocine las patas de pato en la miel durante dos minutos hilvanando las piernas todo el tiempo.", "Para servir, coloque un montón de lentejas en el plato con una pierna al lado, y desmenuce la panceta cocida en la parte superior de las lentejas."], "url": "www_bbc_co_uk_food_recipes_honey_confit_of_duck_58484", "title": "Miel confitada de pato con lentejas Puy", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]