[{"isVegetarian": true, "title": "Chestnut Bourguignon pie", "url": "www_bbc_co_uk_food_recipes_chestnutbourgignonpi_3042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4oz dried chestnuts, soaked for 6-8 hours", "2 bay leaves", "1 sprig fresh rosemary or 1 tsp/5ml dried rosemary", "210ml/7fl oz vegetarian red wine", "300ml/10fl oz vegetable stock or water", "25g/1oz butter or soya margarine", "8 small pickling onions or shallots, peeled", "125g/4oz chestnut mushrooms, wiped", "125g/4oz button mushrooms, wiped", "2 tsp Dijon mustard", "2-3 tbsp tamari or soy sauce", "freshly ground black pepper", "fresh parsley, finely chopped", "225g/8oz vegetarian puff pastry, thawed if frozen"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Place the soaked chestnuts, herbs and 150ml/5fl oz of wine in a saucepan with vegetable stock to cover and cook until just tender - approximately 50-60 minutes. Drain the chestnuts, reserving the liquid. ", "Melt the butter in a frying pan and sauté the onions until slightly browned. ", "Add the mushrooms and cook for a further 4-5 minutes. ", "Add the chestnuts, the remaining red wine and sufficient chestnut cooking liquor to cover. ", "Bring to the boil and simmer for 20-30 minutes to reduce the liquid a little. ", "Stir in the mustard, tamari and black pepper to taste. Cook for a further 5 minutes. ", "Check seasoning and adjust as necessary. ", "Spoon the mixture into a pie dish. Roll out the pastry on a floured surface and place on top of filling. ", "Bake for about 20 minutes until golden."]}, {"isVegetarian": true, "title": "Chestnut, leek and mushroom tartlets", "url": "www_bbc_co_uk_food_recipes_chestnutleekandmushr_66048", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnutleekandmushr_66048_16x9.jpg", "ingredients": ["225g/8oz ready-made puff pastry (thawed if frozen)", "55g/2oz wild rice", "2 tbsp olive oil", "15g/½oz vegan margarine", "370g/13oz leeks, finely chopped", "110g/4oz oyster mushrooms, sliced", "200g/7oz packed cooked and peeled chestnuts, chopped", "2 sprigs fresh rosemary, leaves only, chopped", "1 tbsp fresh sage, finely chopped", "salt and freshly ground black pepper", "1-2 tbsp soy sauce "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Roll out the pastry on a lightly floured board. Use to line either four individual 10cm/4in loose bottomed flan rings or one 20cm/8in large one. Do not trim the excess pastry yet. Prick the base all over and leave to rest in the fridge for 30 minutes. Bake blind for 15-20 minutes until the pastry is cooked, then trim off the excess.", "Cook the rice in boiling water until the grains split (about 30-40 minutes). Drain and allow to cool.", "Heat the olive oil and margarine in a frying pan and gently fry the leeks for about five minutes until soft. ", "Add the mushrooms and fry for a  further five minutes, then stir in the chestnuts, rosemary, sage and cooked wild rice and season well with salt and freshly ground black pepper. ", "Add the soy sauce and cook for a further two minutes.Spoon the filling into the pastry case(s) and return to the oven to bake for 5-10 minutes, until warmed through."]}, {"isVegetarian": true, "title": "Chestnut mousse with panettone", "url": "www_bbc_co_uk_food_recipes_chestnutmoussewithpa_65666", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium panettone ", "1 tbsp rum (optional) ", "450g/1lb mascarpone ", "285g can sweetened chestnut purée ", "290ml/10fl oz double cream, lightly whipped ", "4 tbsp icing sugar ", "85g/3oz dark chocolate, grated"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place a 22cm/8in greased ring mould onto a baking sheet. ", "Cut a slice from the bottom of the panettone to line the base of the mould. ", "Spoon over the rum. ", "Process together the mascarpone and the chestnut purée. Place in a large bowl and fold in the lightly whipped cream. ", "Spread over the base of the panettone. Chill in the fridge. ", "Remove the ring by placing a hot tea towel around the edge and lifting off. ", "Sprinkle over the grated chocolate, sprinkle over some icing sugar, slice and serve."]}, {"isVegetarian": true, "title": "Chestnut, roasted  butternut squash and Bramley apple soup", "url": "www_bbc_co_uk_food_recipes_chestnutroastedbutte_90627", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnutroastedbutte_90627_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz butternut squash, seeds removed, flesh cut into large wedges", "5 tbsp olive oil", "1 onion, chopped", "1 garlic clove, finely chopped", "2 potatoes, cut into cubes", "1 Bramley apple, peeled, core removed, flesh chopped", "2 litres/3½ pints hot chicken or vegetable stock", "1 sprig fresh thyme", "2 bay leaves ", "500g/1lb 2oz chestnuts, roasted and peeled, plus extra, sliced, to serve", "400g/14oz ready-made chestnut purée", "salt and freshly ground black pepper", "truffle oil, for drizzling", "double cream, for drizzling (optional)"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the butternut squash pieces into a roasting tin and drizzle over three tablespoons of the olive oil. Transfer to the oven and roast for 25-30 minutes, or until the squash is tender and golden-brown. Set aside to cool. ", "When the butternut squash has cooled, drain off the oil and peel away the skin, taking care not to burn your fingers.", "Heat the remaining olive oil in a large pan over a medium heat, add the onion, garlic, potatoes and apple and fry for 4-5 minutes, stirring regularly, until softened. ", "Add the stock, roasted squash, thyme, bay leaves, chestnuts and the chestnut purée. Stir well and season, to taste, with salt and freshly ground black pepper.", "Bring the mixture to the boil, turn down the heat and simmer for 15-20 minutes, or until the potatoes are tender. Set aside to cool.", "Transfer the mixture to a food processor and blend until smooth. Return to the pan and heat until warmed through.", "To serve, divide the soup equally between ten serving bowls. Garnish each serving with a few drops of truffle oil and cream (if using) and sprinkle over the sliced roasted chestnuts."]}, {"isVegetarian": false, "title": "Chettinad crab curry", "url": "www_bbc_co_uk_food_recipes_chettinad_crab_curry_53083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 750g/1lb 10oz cooked brown crab", "1 tsp fennel seeds", "1 tsp cumin seeds", "25g/1oz fresh or frozen coconut flesh, blended in a food processor or grated", "2 tbsp vegetable oil", "1 tsp fennel seeds", "1 tsp fenugreek seeds", "10 garlic cloves, finely chopped", "3 shallots, thinly sliced", "1 onion, thinly sliced", "10–14 fresh curry leaves", "2 tsp Kashmiri chilli powder", "1 tsp ground turmeric", "4-5 tomatoes, finely chopped", "2 tbsp chopped dried kokum (available from specialist Indian stores)", "1 tsp tamarind liquid ", "1 tbsp ground coriander", "1 tsp jaggery or soft brown sugar", "1 tsp salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab, break off the tail flaps and discard. Break off the claws, then take a large-bladed knife and cut them in half at the joint; crack the shells of each piece with a hammer or the back of a knife. Chop the body section in half, then gently tug on the legs to pull the body pieces away from the back shell. Use a knife as an added lever if you need to, but the body pieces should come away quite easily with the legs still attached. Turn each piece over and pick off the dead man’s fingers (soft gills), then cut in half once more so you have two legs attached to each piece. ", "For the coconut paste, grind the fennel and cumin seeds in a pestle and mortar, then add to a mini-food processor with the coconut and a splash of water and blend to a smooth paste.", "For the masala, heat the oil in a heavy-based saucepan or karahi over a medium heat, add the fennel and fenugreek seeds, garlic, shallots and onion and fry for 10 minutes, or until the onion is golden-brown. ", "Stir in the curry leaves, chilli powder and turmeric, fry for 30 seconds and then add the tomatoes. Simmer for 5-10 minutes, stirring occasionally, until the tomatoes have reduced down to a pulp. ", "Stir in the coconut paste and fry for 2-3 minutes. Add 200ml/7fl oz of water and the kokum, tamarind liquid, coriander, sugar and salt and bring to a boil. Add the crab, cover the pan, and cook over a high heat for 3-4 minutes, or until the sauce is rich and quite thick, adding a splash more water if it looks like catching on the bottom of the pan. Serve."]}, {"isVegetarian": true, "title": "Chewy coconut macaroons", "url": "www_bbc_co_uk_food_recipes_chewy_coconut_macaroons_69782", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chewy_coconut_macaroons_69782_16x9.jpg", "ingredients": ["80g/2¾oz desiccated coconut", "125ml/4½fl oz full-fat coconut milk", "1 tbsp coconut flour", "2 tbsp maple syrup", "½ tsp vanilla extract", "pinch salt"], "serves": "Makes 16", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with baking parchment.", "Stir all of the ingredients together in a saucepan over a medium heat until well combined. Continue to cook for 4-5 minutes until the coconut milk has been absorbed into the mixture and the mixture has thickened. Remove from the heat and set aside to cool slightly.", "Scoop tablespoonfuls of the macaroon mixture onto the prepared baking tray, to form small domes, leaving a gap between each. Bake in the middle of the oven for 12-15 minutes, or until toasted and golden-brown at the edges.", "Remove from the oven and set the macaroons aside to cool completely, then enjoy."]}, {"isVegetarian": true, "title": "Chewy lemon and thyme cookies", "url": "www_bbc_co_uk_food_recipes_chewy_lemon_and_thyme_92523", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chewy_lemon_and_thyme_92523_16x9.jpg", "ingredients": ["150g/5oz ground almonds", "1 tbsp arrowroot", "¼ tsp salt", "¼ tsp bicarbonate of soda", "2 tbsp maple syrup", "½ tsp fresh thyme or lemon-thyme leaves, or to taste", "1 tbsp grated lemon zest (preferably from an unwaxed lemon)"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with baking parchment.", "Pulse the almonds, arrowroot, salt and bicarbonate of soda in a food processor until the mixture is well combined and resembles breadcrumbs.", "Add the maple syrup, thyme leaves and lemon zest and pulse again until the mixture comes together as a ball of dough.", "Remove the dough from the food processor. Tear off 10 equal-sized pieces of the dough and roll them into golf-ball-sized balls, then flatten each between the palms of your hands and place onto the prepared baking tray, leaving plenty of space between each cookie.", "Bake for 10-12 minutes, or until crisp and golden-brown at the edges. Remove the tray from the oven and set aside to cool. The cookies will crisp up as they cool, but will still be soft in the middle."]}, {"isVegetarian": false, "title": "Chicken and apricot curry with potato straws (sali murghi)", "url": "www_bbc_co_uk_food_recipes_chicken_and_apricot_15424", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_apricot_15424_16x9.jpg", "ingredients": ["250g/9oz chip potatoes such as Maris Piper or Sebago, peeled, cut into matchsticks or coarsely grated, soaked in cold water for 15 minutes", "vegetable oil, for deep frying", "1–2 tsp salt", "3 tbsp vegetable oil", "6 black peppercorns", "5 cloves", "2 green cardamom pods, lightly bruised with a rolling pin", "2 dried Kashmiri chillies", "4cm/1½in piece cinnamon stick", "1 medium onion, finely chopped", "100g/3½z tomatoes, finely chopped", "1 tsp salt", "4cm/1½in fresh root ginger, finely grated", "3 garlic cloves, crushed", "1½ tsp Kashmiri chilli powder", "1 tsp ground cumin", "1 tsp ground coriander", "1 tsp garam masala", "½ tsp ground turmeric", "1kg/2lb 4oz chicken, jointed into 8 pieces, or 1kg/2lb 4oz chicken pieces, skinned", "2 tsp jaggery or soft brown sugar", "150g/5½oz ‘ready-to-eat’ soft dried apricots", "3 tbsp white wine vinegar", "handful coriander, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Drain the potatoes and dry on kitchen paper. Heat the vegetable oil in a deep pan over a medium heat until hot (or heat a deep-fat fryer to 180C/350F). CAUTION: hot oil can be dangerous. Do not leave unattended.  Deep-fry the potatoes in batches until crisp and golden-brown. Remove from the oil using a slotted spoon and drain on a plate lined with kitchen paper. Season with salt.", "For the curry, heat the oil in a heavy-based pan or karahi over a medium heat. Add the whole spices and fry for a minute until fragrant, then add the onion and fry for 10 minutes, or until softened and golden-brown. ", "Stir in the tomatoes and salt and simmer for 2–3 minutes, then add the ginger, garlic, chilli powder, cumin, coriander, garam masala and turmeric and cook for a minute.", "Add the chicken pieces to the pan and cook, stirring, for 2–3 minutes, or until well coated with the spice mixture, then add the jaggery, apricots, vinegar and enough water just to cover. Bring to the boil, lower the heat, cover the pan with a lid and simmer for 30–40 minutes, or until the chicken is cooked through and tender, and the sauce is reduced to a rich, thick consistency.", "Serve with the potato sticks heaped on top, and scatter with coriander."]}, {"isVegetarian": false, "title": "Chervil stuffed roast chicken salad with shaved turnips, lardons and cider vinaigrette", "url": "www_bbc_co_uk_food_recipes_chervilstuffedroastc_85257", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sugar", "250ml/8¾fl oz good-quality cider", "2 tbsp cider vinegar", "10ml/4fl oz cold-pressed rapeseed oil or extra virgin olive oil", "½ tsp mustard", "2 cloves garlic, crushed", "salt and freshly ground black pepper", "3 rashers bacon, sliced into lardons", "60g/2¼oz butter", "small bunch fresh chervil, roughly chopped", "small bunch fresh chives, roughly chopped", "salt and freshly ground black pepper", "1 medium chicken, cut in half down the middle", "60ml/2¼fl oz chicken stock", "4 baby turnips, shaved into strips with a vegetable peeler", "crisp leaves such as Little Gem, chicory and watercress", "handful fresh parsley leaves", "fresh chives and chervil, chopped, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the cider vinaigrette, place the sugar in a frying pan and cook over a medium heat until caramelised. Add the cider and cook until reduced and sticky. Remove from the heat.", "Whisk the cider vinegar, oil, mustard and garlic into the cider reduction. Season with salt and freshly ground black pepper. Set aside to cool.", "For the lardons, fry the bacon in a hot frying pan until crisp. Drain away the fat and set the bacon aside.", "For the herb butter, place the butter in a food processor and pulse to soften. Add the chervil and chives and season with salt and freshly ground black pepper. Pulse until well mixed.", "For the chicken, loosen skin of the chicken halves, and stuff the herb butter under the skin. Chill in the fridge until needed.", "Preheat the oven to 190C/370F/Gas 5.", "Heat an oven-proof frying pan, without oil, and dry fry the chicken halves, skin-side down, until crisp. Turn the chicken halves over and transfer the pan to the oven for 20-25 minutes, or until the chicken is cooked through - the juices will run clear when the chicken is pierced with a skewer at the thickest point.", "Remove the cooked chicken from the oven and pour off the excess fat. Set the chicken halves aside to rest. Deglaze pan with the chicken stock and cook to reduce the liquid.", "To serve, toss the shaved turnips, crisp leaves, parsley leaves and lardons with the cider vinaigrette.", "Cut the chicken into serving pieces and add to the salad. Arrange the salad on a plate, pour over the pan juices and sprinkle with some chopped chives and chervil. Serve."]}, {"isVegetarian": false, "title": "Easy chicken tagine", "url": "www_bbc_co_uk_food_recipes_chicken_and_apricot_97224", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_apricot_97224_16x9.jpg", "ingredients": ["200g/7oz chicken breast, cut into large cubes", "600g/1lb 5½oz chicken thighs or wings", "1 tbsp harissa paste", "1 tbsp vegetable oil", "1 onion, sliced", "2 garlic cloves, crushed", "1 tsp ground cinnamon", "1 tsp ground cumin", "1 tsp ground ginger", "1 tsp ground turmeric", "1 tsp chilli flakes", "450ml/16fl oz chicken stock", "100g/3½oz dried apricots, quartered", "1 x 400g tin chopped tomatoes", "1 x 400g tin chickpeas, rinsed, drained", "salt and freshly ground black pepper", "2 tbsp freshly chopped mint", "2 tbsp freshly chopped parsley ", "couscous, cooked according to packet instructions", "150g/5½oz Greek-style yoghurt", "handful of flaked almonds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the chicken breast and thighs (or wings) with the harissa paste in a bowl until well combined. Cover with cling film and chill in the fridge for two hours.", "Heat the vegetable oil in the base of a tagine dish, or heavy-based casserole dish. Fry the chicken for 2-3 minutes. Remove from the dish using a slotted spoon and set aside. ", "Fry the onion for five minutes, or until soft. Stir in the garlic and spices.", "Add the meat back to the dish, along with the stock, apricots and tomatoes. Season with salt and freshly ground black pepper. Bring to the boil, cover with the lid and simmer for one hour. (Add the chickpeas after 45 minutes and stir until well combined.)", "Stir in the mint and parsley at the end of cooking.", "Serve alongside couscous and Greek-style yoghurt, topped with the almonds."]}, {"isVegetarian": false, "title": "Chicken and aubergine massaman curry", "url": "www_bbc_co_uk_food_recipes_chicken_and_aubergine_25245", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_aubergine_25245_16x9.jpg", "ingredients": ["300ml/10fl oz reduced fat coconut milk", "200ml/7fl oz chicken stock", "1 small red onion, roughly chopped", "1 level tbsp Thai massaman curry paste ", "1 cinnamon stick", "2 chicken breasts, boneless, skin removed (150g/5½oz each), cut into bite-sized pieces", "100g/3½oz fine green beans, trimmed", "1 aubergine, cut into 1.5cm/½in cubes", "1 tbsp roasted cashew nuts, chopped", "1 red chilli, seeds removed, thinly sliced ", "1 spring onion, finely chopped", "2 limes, halved"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the coconut milk, stock, red onion, curry paste and cinnamon stick in a large, wide saucepan. Bring to a simmer over a medium heat. ", "Add the chicken, green beans and aubergine and cook gently for 15–20 minutes, or until the aubergines are tender and the chicken is cooked through.", "Spoon the curry into four shallow bowls and scatter over the cashews, chilli and spring onion. Serve with the lime halves for squeezing over."]}, {"isVegetarian": false, "title": "Chicken and bacon lattice pie", "url": "www_bbc_co_uk_food_recipes_chicken_and_bacon_21897", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_bacon_21897_16x9.jpg", "ingredients": ["6 skinless chicken legs (thigh and drumstick)\t", "4 celery sticks, diced", "4 bay leaves, roughly sliced", "200ml/7fl oz dry white wine", "300ml/10fl oz chicken stock", "250g/9oz smoked back bacon (about 7 rashers), cut into small pieces", "1 large onion, roughly chopped", "50g/1¾oz butter ", "60g/2¼oz plain flour, plus extra for dusting ", "2 tbsp full-fat crème fraîche", "1 tbsp grainy mustard", "2 x 375g packets ready-rolled, all-butter puff pastry", "1 egg, beaten", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Put the chicken legs, celery and bay leaves into a large ovenproof saucepan, pour over the wine and stock and season with salt and freshly ground black pepper. Bring to the boil on a medium-high heat, cover with a lid and transfer to the oven for 30–40 minutes, or until the chicken legs are cooked and tender. Set aside to cool.", "Once cool, remove the meat from the chicken bones. The bones can be reserved and used for a stock. Break the meat into bite-sized pieces before transferring to a bowl. Strain the stock, reserving the celery and discarding the bay leaves, and measure out the liquid. You should have about 750ml/1 pint 6fl oz; if not, make up to this amount with a little extra stock or white wine.", "Heat a large frying pan and fry the bacon pieces on a medium-high heat for 3 minutes. Add the onion, cover with a lid and fry for a further 10 minutes until the onion is softened. Add the butter, stir until melted, and then sprinkle in the flour to make a roux. Pour the reserved liquid into the roux a little at a time, whisking as you add, and stir over a high heat until thickened to a smooth sauce consistency.", "Add a little salt and pepper, the reserved celery, crème fraiche and mustard and mix to combine before adding the chicken pieces. Spoon the filling into the ovenproof dish and level the top. Leave until cool and then chill, covered, in the fridge for 30 minutes.", "Meanwhile, prepare the pastry for the pie. On a lightly floured work surface, roll out each of the pastry sheets to about 3mm/⅛in thick. Cut each piece into long, thick ribbons, about 3cm/1¼in wide. You will need to make enough to cover the top of the dish, about 16 in total. Weave the ribbons together on a piece of baking paper, until you have a pastry top that is large enough to cover your pie. Chill in the fridge for 15 minutes to firm up or, if time allows, freeze until solid.", "Take the filling out of the fridge and brush the edges of the dish with a little beaten egg. Carefully slide the pastry lattice from the baking paper and lay on top of the chilled filling. Trim the excess pastry around the rim and lightly press to seal.", "Increase the oven temperature to 200C/180C Fan/Gas 6. Brush the pastry with the remaining beaten egg and bake for 30 minutes until the pastry is golden and cooked through, and the chicken is bubbling. Serve hot."]}, {"isVegetarian": false, "title": "Chicken and black bean sauce with bok choi", "url": "www_bbc_co_uk_food_recipes_chicken_and_black_bean_01124", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_black_bean_01124_16x9.jpg", "ingredients": ["2 boneless skinless chicken breasts, cut into slices 1cm/½in thick", "3 tbsp light soy sauce", "3 tbsp Shaoxing rice wine (or dry sherry)", "2 tbsp toasted sesame oil", "2 tbsp cornflour", "4 tbsp vegetable oil", "10cm/5in piece fresh root ginger, peeled and finely chopped", "3 large garlic cloves, finely chopped", "3 red chillies, finely chopped", "50g/1¾oz fermented black beans", "1 tbsp caster sugar", "150ml/5fl oz chicken stock", "6 spring onions, finely sliced", "3 tbsp roughly chopped coriander leaves", "2 heads bok choi", "200g/7oz cooked basmati rice, cold", "1 free-range egg, beaten"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the chicken in a bowl with one tablespoon each of the soy sauce, Shaoxing rice wine and sesame oil. Add the cornflour then mix to combine and leave to marinate for 10 minutes.", "Heat a wok or large frying pan over high heat until it is hot. Add one tablespoon of the vegetable oil, and when it is hot and slightly smoking, add the chicken and stir fry for 2-3 minutes, or until nearly cooked through. Lift out with a slotted spoon and set aside then wipe out the wok and return to the heat.", "Mix together the ginger, garlic and chilli.", "Add another tablespoon of the vegetable oil and when it’s hot and slightly smoking again, add a third of the ginger, garlic, chilli mix and all the black beans and stir-fry for 2-3 minutes until just softened.", "Add the remaining two tablespoons of Shaoxing rice wine, one tablespoon of the soy, all the sugar and chicken stock and bring to the boil. Return the chicken to the pan and cook for 1-2 minutes, or until the sauce has thickened slightly and the chicken is cooked through.", "Finish with a third of the spring onion and a tablespoon of coriander and stir through.", "Set aside and heat another wok until hot, add one tablespoon of vegetable oil, half the remaining ginger, garlic and chilli mix and half the remaining spring onion and stir fry for one minute. Add the bok choi and 75ml/3fl oz of water and stir fry until the bok choi is tender and the liquid evaporated. Add one tablespoon of coriander and half the remaining spring onion and stir fry for one minute then put onto the serving plate.", "Wipe out the wok and return to the heat, then add the last of the vegetable oil, ginger, garlic and chilli and stir fry for one minute then add the cooked rice and stir fry for one minute.", "Pour the beaten egg into the centre of the wok, then stir fry through for a couple of minutes so the rice is hot and the egg cooked through.", "Stir in the last tablespoon of sesame oil, and the remaining coriander and spring onion and fry for another minute.", "To serve, pile the rice onto plates, spoon some chicken next to it, then finish with the bok choi."]}, {"isVegetarian": false, "title": "Chicken and asparagus quiche", "url": "www_bbc_co_uk_food_recipes_chicken_and_asparagus_27353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "flour, for dusting", "300g/10½oz ready-made shortcrust pastry", "9 free-range eggs, 1 beaten for the glaze", "600ml/20fl oz double cream", "100g/3½oz asparagus", "300g/10½fl oz cooked leftover roast chicken, cut into 3cm/1¼in chunks", "1 tbsp chopped fresh marjoram", "100g/3½oz vintage Comté cheese, finely grated", "1 bag green salad leaves, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease a 23cm/9in (4cm/2in deep) loose-bottomed tart tin with butter. Roll out the pastry on a lightly floured work surface to a thickness of 5mm/¼in. Wrap the pastry around your rolling pin and gently lower it into the prepared tin, pressing the pastry gently into the base and sides.", "Cover the pastry case with cling film or baking parchment, then fill with baking beans, uncooked rice or flour. Bake in the oven for 20-25 minutes. Remove the lining paper and baking beads. ", "Brush the inside of the tart all over with the beaten egg. Return the pastry case to the oven for a further 5 minutes, or until golden-brown. Remove the pastry case from the oven.", "Reduce the oven temperature to 180C/160C Fan/Gas 4. ", "In a bowl, whisk 8 eggs and the cream together, then season with salt and freshly ground black pepper. ", "Arrange the asparagus spears inside the tart case, then sprinkle over the chicken pieces and marjoram. Pour over the egg and cream mixture until almost level with the top of the pastry case. Scatter the Comté on top.", "Bake the quiche for 20-25 minutes, or until the filling has set and the pastry is golden-brown. Remove from the oven and set aside on a wire rack to cool slightly. ", "To serve, cut the quiche into slices and serve with the salad leaves."]}, {"isVegetarian": false, "title": "Chicken and chorizo empanadas", "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_26918", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_26918_16x9.jpg", "ingredients": ["4 chicken thighs, on the bone and skin on", "1 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, crushed", "100g/3½oz British-style chorizo, finely diced ", "½ tsp cumin seeds", "50g/1¾oz raisins", "salt and pepper", "150g/5½oz unsalted butter", "300g/10½oz plain flour", "large pinch salt", "1 free-range egg, lightly beaten", "beaten egg, to finish"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4. ", "For the filling, put the chicken thighs in a small roasting dish, season well all over with salt and pepper and roast for about 45 minutes, or until cooked through. Set aside to cool a little.", "Meanwhile, make the pastry. Melt the butter and leave it to cool slightly. Put the flour in a large bowl and mix in the salt. Pour in the butter and egg. Start mixing, adding 3-5 tablespoons of water as you go, until you have a soft dough. Turn this out onto a clean work surface and knead it gently for a couple of minutes, or until smooth. Return the dough to its bowl, cover and set aside to rest while you prepare the filling.", "To finish the filling, heat the oil in a frying pan over a medium-low heat. Add the onion and cook for 10–12 minutes, or until soft. ", "Add the garlic, chorizo, cumin seeds and raisins. Cook over a medium heat for 5–8 minutes, stirring often, until the chorizo is cooked. Remove from the heat.", "Once the chicken thighs are cool enough to handle, remove the skin. Pull all the meat from the bones and chop it roughly. Add to the chorizo mixture. Taste and add salt and pepper if needed (the chorizo is already quite salty), then leave to cool completely.", "Turn the oven to 200C/400F/Gas 6 and line a large baking tray with baking parchment.", "Lightly flour the work surface and roll out the dough to a thickness of 3-4mm. Use a 12cm/4½in cutter or a small bowl to cut out 10 discs. You will probably need to re-roll the offcuts once to get this many. Divide the filling between the discs. Dampen the edges of the dough with water then fold over one half of each disc to make a semicircular parcel. Press the edges together firmly then crimp or press the edges with a fork.", "Put the empanadas on the baking tray and brush with beaten egg. Bake for 15–20 minutes, or until golden-brown. Eat them warm, on their own or with a chilli sauce."]}, {"isVegetarian": false, "title": "Chicken and cheese quesadillas with guacamole, sour cream and mango salsa", "url": "www_bbc_co_uk_food_recipes_chicken_and_cheese_65643", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 yellow pepper, seeds removed, diced ", "1 small mango, peeled and diced ", "8 cherry tomatoes, cut into quarters ", "3 spring onions, chopped ", "1 tsp chopped jalapeño peppers (optional)", "1 lime, juice only ", "salt and freshly ground black pepper ", "4 flour tortillas ", "150g/5oz Monterey Jack or cheddar cheese, grated ", "leftover cooked chicken, shredded, or other cold meat such as turkey", "1 green or red pepper, seeds removed, finely diced ", "small handful coriander leaves, chopped, plus extra to garnish (optional)", "soured cream and guacamole, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salsa, mix all of the salsa ingredients together in a bowl and season to taste with salt and freshly ground black pepper.", "Tip the avocado into a mixing bowl with the lime juice to prevent it from turning brown. Add the garlic, crème fraîche and coriander and mash everything together lightly with a fork, keeping plenty of texture. Season to taste with salt and freshly ground black pepper.", "For the quesadillas, lay two of the tortillas out on a flat surface. Top each with the cheese, followed by the chicken, peppers and coriander. Place the remaining tortillas on top and press down gently.", "Heat a frying pan over a medium hot and add one of the quesadillas to the pan. Fry, without adding any oil, for 2-3 minutes on each side or until the tortilla is crisp, the cheese melted and the chicken heated through thoroughly. Keep warm whilst you cook the second quesadillas.", "To serve, cut the quesadillas into quarters arrange on plates. Spoon a little soured cream on top, garnish with coriander and serve with the salsa and guacamole on the side."]}, {"isVegetarian": false, "title": "Chicken and chorizo paella", "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_33509", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_33509_16x9.jpg", "ingredients": ["1–2 tbsp oil", "12 whole chicken pieces (legs or thighs), on the bone", "1 chorizo sausage, sliced into 3mm/⅛in thick slices", "1 large onion, finely chopped", "3 garlic cloves, crushed", "2 red peppers, seeds removed, sliced", "2–3 red chillies, seeds removed, chopped", "2 tsp smoked paprika ", "1.5 litres/2½ pints chicken stock", "400g/14oz paella rice", "12 mussels or clams, (optional) cleaned, open and damaged shells discarded", "handful parsley, roughly chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the oil in a large, lidded, heatproof pan or paella pan. Fry the chicken until the pieces are evenly browned, turning them regularly as they cook. You may need to do this in two batches, depending on the size of your pan. Remove the chicken from the pan and set aside.", "Fry the slices of chorizo in the pan until crisp. They will release their juices into the pan, which adds a lot of flavour to the dish. Add the onion to the pan, and cook gently until soft, then add the garlic and fry for a further 2–3 minutes. Add the red peppers, chillies and smoked paprika, cook for another 2–3 minutes. Return the chicken pieces to the pan and pour in the stock. Simmer gently for 20–25 minutes until the chicken is tender. ", "Add the rice to the pan, cover with the lid and put into the preheated oven. Cook for 30 minutes, or until all the liquid has been absorbed and the rice is cooked. Alternatively, if using a paella pan which won’t fit in the oven, cover tightly with foil and continue cooking on the stove over a low heat for the same cooking time. If using mussels or clams, add them to the pan for the final 20 minutes cooking time. Discard any shells that remain closed after cooking. Check the chicken is cooked by piercing the thickest part of a piece with a skewer – if the juices run clear the chicken is cooked. ", "Sprinkle with parsley before bringing the pan to the table. Let your guests help themselves."]}, {"isVegetarian": false, "title": "Chicken and chorizo paella", "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_59310", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large tiger prawns, peeled and deveined, shells and heads reserved", "olive oil", "1 litre/1¾ pint good-quality chicken stock", "pinch saffron", "olive oil", "8 chicken thighs, cut into small chunks", "200g/7oz chorizo, peeled and finely chopped", "2 onions, finely chopped", "2 garlic cloves, crushed", "4 ripe tomatoes, seeds removed, diced", "1 tsp hot smoked paprika", "500g/1lb 2oz paella rice ", "2 roasted red peppers, peeled and torn into strips", "small bunch flatleaf parsley, leave finely chopped", "lemon wedges"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the stock,  place the prawn shells and heads into a saucepan pan with a splash of oil and fry for 5 minutes, or until they turn a deep pink colour. Pour over the stock, add the saffron and simmer gently for 20 minutes. Strain into a clean pan and keep warm.", "Preheat a barbecue to a medium heat. Heat a good splash of oil in a large paella pan, add the chicken and fry until browned on all sides. Remove the chicken from the pan with a slotted spoon and set aside.", "Add the chorizo to the pan, fry for a few minutes until crisp, then add the onions. Fry for 5 minutes until soft, then add the garlic, tomatoes and smoked paprika. ", "Fry for 5 minutes until the tomatoes start to break down. Return the chicken to the pan and then stir in the rice. Pour over the stock, give everything a quick stir and then leave to simmer for 10 minutes without stirring.", "Arrange the prawns and peppers over the top of the rice, then cover the pan with a sheet of aluminium foil, put the lid on the barbecue and leave to cook for 10 minutes, or until the prawns have turned pink. Remove the pan from the heat and leave to stand for 5 minutes before serving with chopped parsley and lemon wedges."]}, {"isVegetarian": false, "title": "Chicken and chorizo rice", "url": "www_bbc_co_uk_food_recipes_chicken_and_chorizo_rice_85780", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_rice_85780_16x9.jpg", "ingredients": ["1 tbsp olive oil", "70g/3oz chorizo, halved and sliced", "½ large onion, sliced", "200g/7oz chicken thigh fillets, chopped into 2½cm/1in pieces", "1 garlic clove, finely sliced", "1 green pepper, sliced ", "110g/4oz basmati rice", "200ml/7fl oz chicken stock (½ stock cube dissolved)", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large saucepan with a tight fitting lid and fry the chorizo over a high heat for 1 minute. Add the onions and fry for a further minute, then add the chicken and garlic and cook for 5 minutes. ", "Add the green pepper and basmati rice and stir well to combine. Pour in the chicken stock and stir, then turn the heat down as low as it will go, put the lid on and leave for 12 minutes. ", "Turn the heat off but do not remove the lid and leave for a further 12 minutes, then remove the lid and give it a good stir with a fork. The water should be absorbed. Season to taste and serve straight away. "]}, {"isVegetarian": false, "title": "Chicken and cucumber en papillote with toasted almonds", "url": "www_bbc_co_uk_food_recipes_chicken_and_cucumber_en_93986", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, skin on", "20g/¾oz unsalted butter", "2 tbsp sunflower oil", "1 cucumber, peeled, halved lengthways and deseeded", "2 tbsp olive oil", "1 tsp smoked sweet (mild) paprika", "250ml/9fl oz whipping cream", "1 tbsp chopped flat-leaf parsley", "2 tbsp flaked almonds, toasted, to serve", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Season the skin of the chicken with salt and pepper.", "Heat a large frying pan over a medium-high heat. Add the butter and sunflower oil. When the butter is foaming, add the chicken, skin-side down, and cook for five minutes, until golden-brown and crisp. Remove from the pan and leave to one side.", "Cut each piece of cucumber to the same length as one of the chicken breasts, then slice into 3mm/1/8 in thick strips. ", "Remove the frying pan from the heat then wipe clean with kitchen paper. Return to the heat, add the olive oil and cucumber, season with salt and pepper and cook for 4-5 minutes, tossing continuously, until the cucumber is translucent but still retaining its crunch. Add the paprika and stir, then drain on kitchen paper. ", "Lay four 30cm/12in square sheets of baking paper on a work surface. Put one-quarter of the cucumber on one of the sheets, laying it out lengthways in the centre. Put a chicken breast on top and fold in the sides and the bottom of the paper so the top is open. ", "Pour three tablespoons of cream on top, then fold the paper over and tightly fold the top to seal and make a parcel. Repeat to make four parcels.", "Transfer to a baking tray and roast for 8-10 minutes. Turn off the oven and open the door so it's ajar. Leave the chicken for two minutes until cool enough to handle. ", "Carefully open one end of each parcel and pour the juices into a small sauté pan. Close the parcels again and return them to the oven.", "Put the sauté pan over a medium heat and bring to the boil, then turn the heat to low and simmer for five minutes, until reduced in volume by half.", "Meanwhile, whip the remaining cream until soft peaks form. ", "Remove the pan from the heat and whisk in the whipped cream. Return to the heat and bring to a simmer, then immediately remove from the heat. Stir in the parsley and season with salt and pepper. ", "To serve, slide the parcels onto plates and open the tops. Spoon the sauce over the chicken and sprinkle with the almonds before serving."]}, {"isVegetarian": false, "title": "Chicken and leek suet pudding", "url": "www_bbc_co_uk_food_recipes_chicken_and_leek_suet_91971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz diced chicken (a mixture of skinned thighs and breasts)", "1 lemon, zest only", "a few white peppercorns, crushed", "a few fresh sage leaves", "100ml/3½fl oz white wine or vermouth", "250g/9oz leeks, trimmed and sliced into 2cm/¾in-thick rounds", "1 tbsp plain flour", "½ tsp mustard powder", "150ml/5fl oz chicken stock", "salt", "225g/8oz self-raising flour, plus extra for dusting", "1 tsp baking powder", "1 tsp rubbed sage or ½ tsp dried sage", "½ tsp mustard powder", "100g/3½oz suet", "100–150ml/3½fl oz–5fl oz milk", "knob of butter, for greasing"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the filling, put the chicken, lemon zest, peppercorns and sage in a bowl. Add the wine, cover and leave in the fridge to marinate for at least an hour, or overnight.", "For the pastry, put the flour, baking powder, rubbed sage and mustard powder in a bowl. Mix thoroughly until combined. Add the suet and rub it into the flour until you reach a breadcrumb consistency. Gradually add the milk, cutting it in with a knife until the mixture comes together as a soft dough that is not at all sticky.", "Set aside about a quarter of the pastry to make the lid. Roll out the remaining pastry on a lightly floured work surface to form a large circle (approximately 30cm/12in). Grease a 1.2 litre/2 pint pudding bowl with butter. Cover the bottom of the bowl with a small circle of baking paper. Line the bowl with the pastry, making sure the sides are fully covered and any joins are well sealed. Roll out the remaining pastry to make the pie lid and set it aside while you finish the filling.", "Add the leeks to the marinated chicken. Mix the flour with the mustard powder and season with salt. Add the flour mixture to the chicken and leeks and mix well to combine. Spoon into the lined pudding basin and slowly pour in the stock. Place the pastry lid on top of the filling and press the edges together to ensure the filling is well sealed.", "Cover the lid with a circle of baking paper. Take a piece of aluminium foil and fold a thick pleat into it. Mould it around the top of the pudding, tie with cook's string or secure with a sturdy elastic band. Sit the pudding bowl on an upturned saucer in the bottom of a large, lidded pan. Pour in enough boiling water to come halfway up the side of the bowl. Put a lid on the pan and bring to a simmer. Reduce the heat to low and let the pudding steam for 2 hours. Top up the boiling water, if necessary, so the pan doesn’t boil dry. ", "To serve, remove the foil lid and run a palette knife around the rim of the pudding. Turn out onto a plate and serve piping hot."]}, {"isVegetarian": false, "title": "Slow cooker chicken, ham and leek pie filling", "url": "www_bbc_co_uk_food_recipes_chicken_and_leek_pie_27675", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_leek_pie_27675_16x9.jpg", "ingredients": ["1 tsp vegetable oil", "6 skinless, boneless chicken thighs (about 500g/1lb 2oz), cut into bite-sized pieces", "salt and freshly ground black pepper", "3 medium leeks, trimmed", "1 onion, chopped", "a few sprigs fresh thyme", "1 tbsp butter", "2 tbsp plain flour", "350ml/12fl oz good-quality chicken stock", "100g/31/2oz good-quality ham, torn into bite-sized pieces ", "100g/31/2oz crème fraîche, optional"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-stick frying pan. Season the chicken with salt and freshly ground black pepper and fry over a high heat for 10 minutes until golden-brown all over. ", "Meanwhile, slice the leeks into 1cm/½in rounds. Place the leeks, the onion and the thyme leaves into the slow cooker. Top with the chicken.", "Add the butter to the pan, let it melt, then stir in the flour and cook for one minute or until pale gold and bubbling. Take the pan from the heat, then gradually whisk in the stock to make a smooth sauce. It will be very thick at first, but keep going. Pour the sauce over the chicken and vegetables, then cover and cook on low for 4 hours, or until the meat is very tender.  Season with salt and freshly ground black pepper. Allow to cool, then chill.", "Stir in the ham and the crème fraîche (if using) into the chilled chicken mixture and it's ready to top with shortcrust or puff-pastry. Bake in a hot oven for 40 minutes or until piping hot and golden brown."]}, {"isVegetarian": false, "title": "Chicken and lemon tagine with herby tabbouleh", "url": "www_bbc_co_uk_food_recipes_chicken_and_lemon_tagine_75608", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_lemon_tagine_75608_16x9.jpg", "ingredients": ["50g/2oz butter", "1 medium chicken, cut into 10 pieces", "2 onions, finely chopped", "3 garlic cloves, finely chopped", "5cm/2in piece root ginger, grated", "2 cinnamon sticks", "2 tsp ras-el-hanout (North African spice blend)", "1½ tsp salt", "1 tsp freshly ground black pepper", "½ tsp ground turmeric", "1 tsp ground cinnamon", "½ tsp saffron", "1 preserved lemon, roughly chopped", "3 tbsp honey", "750ml/1 pint 5fl oz chicken stock", "150g/7oz dates, stones removed, halved", "salt and freshly ground black pepper", "2 tbsp chopped fresh flatleaf parsley", "140g/5oz bulgur wheat, soaked in cold water overnight", "1 red onion, finely chopped", "2 tomatoes, seeds removed, finely diced", "2 large bunches flatleaf parsley, roughly chopped", "1 bunch mint, roughly chopped", "1 bunch coriander, roughly chopped", "1 lemon juice only", "4 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken and lemon tagine, heat a large, lidded saucepan until hot, add the butter and the chicken and fry for 2-3 minutes on each side, or until golden-brown (you may need to do this in batches). Remove the chicken from the pan and set aside on a plate. ", "Add the onions, garlic and ginger to the pan and fry for 2-3 minutes, or until softened. Stir in the spices and cook for one minute, then return the chicken to the pan and stir until the chicken is coated in the spice mixture.", "Add the preserved lemons, honey and stock and bring the mixture to the boil.", "Reduce the heat until simmering, cover with a lid and cook for 45 minutes.", "Add the dates and stir well, then continue to cook, uncovered, for another 30-45 minutes, or until the chicken is tender and the sauce has thickened. Season, to taste, with salt and freshly ground black pepper, then stir in the parsley.", "For the herby tabbouleh, drain the bulgur wheat and place into a large bowl. Add the other ingredients and stir until well combined. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the tabbouleh onto serving plates and spoon some tagine alongside."]}, {"isVegetarian": false, "title": "Chicken and lemongrass broth", "url": "www_bbc_co_uk_food_recipes_chicken_and_lemongrass_84089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 small chicken (about 1kg/2lb 4oz)", "2 carrots, roughly chopped", "1 lemongrass stalk, bruised", "3 thyme sprigs", "1 small bunch coriander, leaves picked and stalks reserved", "2 large carrots, quartered", "3 lemongrass stalks, 2 bruised, 1 peeled", "2 thyme sprigs", "1 lime, finely grated zest only", "2 tbsp extra virgin olive oil", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the base, heat a large flameproof casserole over a medium heat. Add the olive oil and seal the chicken for 3-4 minutes on each side until it just starts to colour. Add the carrots, lemongrass, thyme and half the coriander stalks. Cook for 5 minutes until the chicken has more colour and the vegetables are also coloured slightly.", "For the broth, transfer the chicken and vegetables to a large, lidded, deep saucepan and cover with approximately 2 litres/3½ pints cold water. Bring to the boil and skim off any foam.  Add the carrots, bruised lemongrass, thyme and the remaining coriander stalks. Turn the heat down to very low, cover and cook for about 1½ hours until the chicken starts to fall from the bone.", "Remove the chicken and let it cool. Strain the broth and reserve the vegetables. Return the broth to the heat and simmer for about 10-15 minutes uncovered, until the broth has reduced by one third.", "Meanwhile, carefully lift the quartered carrots out of the strainer discarding the rest of the vegetables. Finely chop the carrots and put in deep soup bowls.", "When the chicken is cool enough to handle, remove the skin then pull the meat from the bones and tear it up into small pieces. Add the chicken and a pinch of salt and pepper to the bowls, then scatter over the coriander leaves. Sprinkle the lime zest over and drizzle with extra virgin olive oil.", "Remove the tough outer leaves, top and root from the remaining lemongrass stalk, then slice very thinly and add to the bowls. By now, the broth should be ready, so simply add a couple of ladleful’s to each bowl before serving."]}, {"isVegetarian": false, "title": "Chicken and mushroom casserole", "url": "www_bbc_co_uk_food_recipes_chicken_and_mushroom_17575", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_mushroom_17575_16x9.jpg", "ingredients": ["8 tbsp olive oil", "flour, for dusting", "400g /14oz chicken thighs, skinned and boned", "150g /5½oz small onions, peeled", "1 carrot, very finely chopped", "1 celery stalk, very finely chopped", "300g/10½oz button mushrooms, halved", "200ml/7fl oz dry white wine ", "500ml/18fl oz chicken stock", "freshly grated nutmeg, to taste", "3 free range egg yolks, beaten with 4 tsp of milk", "1 tbsp finely chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat six tablespoons of the olive oil in a frying pan over a medium heat. ", "Sprinkle some flour onto a plate. Coat the chicken thighs in the flour, shaking off any excess, and carefully place into the hot oil. Fry the chicken thighs for 4-5 minutes on each side, or until golden-brown on each side.", "Remove the chicken thighs from the pan and set aside on a plate lined with kitchen paper.", "Heat the remaining two tablespoons of olive oil in a frying pan and fry the onion, carrot, celery and mushrooms for five minutes, or until softened. ", "Add the wine and the stock, bring to a simmer and cook for a further 10 minutes. ", "Return the chicken to the pan and season to taste with salt, freshly ground black pepper and nutmeg. Continue to simmer for another 4-5 minutes, or until the chicken is cooked through", "Just before serving, stir in the egg yolk mixture until smooth and sprinkle over the parsley."]}]