[{"isVegetarian": false, "title": "Pan-fried lamb chump with roast butternut squash and onion gravy", "url": "www_bbc_co_uk_food_recipes_panfriedlambchumpwit_83301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz lamb chump", "1 tbsp olive oil", "salt and freshly ground black pepper", "250g/9oz butternut squash, peeled, deseeded and chopped ", "1 tbsp olive oil", "1 clove garlic, finely sliced", "1 tsp thyme leaves ", "salt and freshly ground black pepper", "25g/1oz unsalted butter", "1 tbsp olive oil", "½ red onion, sliced", "½ tsp brown sugar", "1 tsp thyme leaves", "150ml/5fl oz red wine", "150ml/5fl oz hot beef stock", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the lamb, rub the lamb with the oil and season both sides with salt and freshly ground black pepper.", "Heat a frying pan until hot and sear the lamb for two minutes on both sides. ", "Place in the oven and roast for 10 minutes, then remove and rest for one minute.", "To make the butternut squash, in a large bowl toss the squash with the olive oil, garlic and thyme then season well with salt and freshly ground black pepper.", "Place on a roasting tray and cook in the oven for 15 minutes.", "To make the gravy, melt the butter with the olive oil in a frying pan. Fry the onion until soft then add the brown sugar and thyme and stir.", "Increase the heat and add the red wine then cook to reduce by half. Add the beef stock, season with salt and freshly ground black pepper and reduce down until thick.", "Serve the squash in the middle of a warm plate, place the roast lamb on top then spoon over some of the gravy."]}, {"isVegetarian": false, "title": "Pan-fried kidneys with Madeira and sherry sauce, toasted sourdough and salad", "url": "www_bbc_co_uk_food_recipes_panfriedkidneyswitha_91584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "175g/6oz smoked streaky bacon lardons", "125g/4½oz baby onions, blanched", "500g/1lb 2oz calves' kidneys, cleaned, trimmed and cut into small pieces", "4 tbsp Madeira wine", "4 tbsp sherry", "110ml/4fl oz beef stock", "75ml/3fl oz double cream", "salt and freshly ground black pepper", "3 tbsp chopped fresh flatleaf parsley", "8 thick slices sourdough bread", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "110g/4oz mixed salad leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil and butter in a frying pan until foaming, then fry the bacon for 2-3 minutes, or until golden-brown. Add the baby onions and cook for 1-2 minutes, or until softened.", "Add the kidneys and cook for 1-2 minutes, or until golden-brown all over. Add the Madeira and sherry to the pan and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight (NB: keep clothing and fabric well clear of the flame). When the flame has gone out, cook until the alcohol has reduced in volume by half. ", "Add the beef stock to the pan and simmer for 3-4 minutes, or until the kidneys are cooked through. Stir in the cream and cook for 1-2 minutes to warm through, then season, to taste, with salt and freshly ground black pepper. Stir in the parsley. Set aside and keep warm.", "Heat a griddle pan until hot, then add the slices of sourdough and toast for 1-2 minutes on both sides, or until crisp and golden-brown. ", "Whisk together the mustard, vinegar and extra virgin olive oil in a bowl until well combined, then season with salt and freshly ground black pepper. Drizzle the dressing over the salad leaves and mix well to coat. ", "To serve, place two pieces of toast in the centre of each of four serving plates. Spoon the kidneys and sauce over the top. Divide the salad among the plates and arrange alongside the kidneys and toast."]}, {"isVegetarian": false, "title": "Pan-fried lamb chops with sweet potato and tomato chilli salsa", "url": "www_bbc_co_uk_food_recipes_panfriedlambchopwith_90368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lamb chops", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 garlic cloves, skin-on, crushed", "1 tbsp olive oil", "25g/1oz butter", "½ sweet potato, peeled and sliced into rounds on a mandoline", "2 garlic cloves, peeled, chopped", "salt and freshly ground black pepper", "1 plum tomato, chopped", "1 green chilli, chopped", "¼ onion, chopped", "1 tsp caster sugar", "1 tsp red wine vinegar", "2 tbsp chopped fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lamb, season the lamb chops with salt and freshly ground black pepper. Heat the olive oil in a small ovenproof frying pan and fry the lamb and garlic for 2-3 minutes on both sides, or until golden-brown, then transfer to the oven. Cook for 6-8 minutes (for medium), or until cooked to your liking, then transfer onto a warm plate to rest. ", "For the sweet potato, heat the olive oil and butter in an ovenproof pan and arrange the sweet potato slices in concentric circles. Scatter over the garlic and season well with salt and freshly ground black pepper. Cook over a low heat for 1-2 minutes, then turn the potato slices over and transfer to the oven for 8-10 minutes, or until the potatoes are golden-brown and tender. ", "For the salsa, combine all of the salsa ingredients in a bowl and stir well. ", "Spoon the potato slices onto a plate and place the lamb on top. Spoon the salsa around the edges and serve."]}, {"isVegetarian": false, "title": "Pan-fried lamb cutlets with marjoram crushed peas and tomato and anchovy dressing", "url": "www_bbc_co_uk_food_recipes_panfriedlambcutletsw_89098", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 lamb cutlets, trimmed", "salt and freshly ground black pepper ", "1 tbsp olive oil", "2 garlic cloves, lightly crushed", "2 sprigs fresh rosemary", "6 anchovies, finely chopped", "12 small tomatoes, cut into quarters", "12 black olives, pits removed, cut in half", "2 tbsp extra virgin olive oil", "2 tbsp red wine vinegar", "salt and freshly ground black pepper ", "1 tbsp fresh marjoram leaves", "25g/1oz butter", "300g/10½oz fresh peas, blanched", "2 tbsp fresh marjoram leaves", "2 tbsp crème fraîche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, season the lamb cutlets with salt and freshly ground black pepper. Heat a frying pan until hot, add the olive oil, lamb cutlets, garlic, rosemary and two of the chopped anchovies. Fry the lamb for 2-3 minutes on each side, until golden-brown and cooked to your liking. Remove from the pan and set aside to rest in a warm place.", "For the dressing, return the pan to the heat and add the tomatoes, olives and remaining chopped anchovies. Sauté gently for 2-3 minutes.", "In a small bowl, whisk together the extra virgin olive oil and vinegar. Season, to taste, with a little salt and freshly ground black pepper, then pour into the pan and warm through. Add the marjoram leaves and stir.", "For the peas, heat a frying pan, add the butter, peas and marjoram and cook gently for 2-3 minutes, or until the peas are tender and warmed through. Using a potato masher, lightly crush the peas. Stir in the crème fraîche  and season, to taste, with salt and freshly ground black pepper.", "To serve, pile the peas into the centre of four serving plates and top each one with three lamb cutlets. Spoon the dressing around the edge of the plate and serve."]}, {"isVegetarian": false, "title": "Pan-fried lambs' kidneys on toast", "url": "www_bbc_co_uk_food_recipes_panfriedlambskidneys_92268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "6 button onions, or shallots, peeled", "1 tbsp bacon lardons", "4 button mushrooms, quartered", "2 lambs' kidneys, fat removed, cut in half, gristle removed (ask your butcher to do this for you)", "¼-½ tsp red wine vinegar", "2-3 tbsp gravy granules, made up to 100ml/3½fl oz gravy with boiling water", "1 tbsp chopped fresh tarragon leaves", "½ tbsp chopped fresh parsley leaves", "1 thick slice crusty white bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the oil in a small, non-reactive frying pan over a medium heat. Add the button onions or shallots and fry all over for 5-6 minutes, or until softened and pale golden-brown. Remove from the pan and set aside.", "Add another tablespoon of oil to the pan the onions were fried in. Add the lardons and mushrooms and fry for 4-5 minutes, or until pale golden-brown. Remove from the pan and set aside with the onions.", "Add the remaining tablespoon of oil to the same pan. When the oil is hot, add the kidneys, cut-sides down, and fry for 3-4 minutes on each side, or until golden-brown and just cooked through.", "Remove from the pan and set aside with the onions, bacon and mushrooms.", "Add the red wine vinegar to the pan. When it simmers, scrape up any burned bits from the bottom of the pan using a wooden spoon to deglaze the pan, then add the gravy.", "Return the kidneys, onions, bacon and mushrooms to the pan and bring the mixture to a simmer. Continue to simmer until the kidneys and vegetables have warmed through, then stir in the herbs.", "To serve, place the toast into a shallow serving bowl. Spoon over the pan-fried lambs' kidneys, vegetables and gravy."]}, {"isVegetarian": false, "title": "Pan-fried lamb steak with Provençal-style stuffed tomatoes", "url": "www_bbc_co_uk_food_recipes_panfriedlambsteakwit_85302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 vine tomatoes", "small chunk white bread", "1 garlic clove, chopped", "small handful fresh herbs, including basil, parsley, rosemary and thyme", "1 tbsp olive oil, plus extra for drizzling", "salt and freshly ground black pepper ", "1 x 140g/5oz lamb leg steak ", "2 tsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the stuffed tomatoes, slice the tops off the tomatoes, scoop out some of the seeds and discard.", "Place the bread, garlic and herbs into a food processor and pulse until broken up into crumbs. Add the olive oil, season with salt and freshly ground black pepper and pulse again to combine.", "Press this mixture into the centre of the tomatoes and drizzle with olive oil. Place the stuffed tomatoes onto a non-stick baking sheet and bake in the oven for 8-10 minutes, or until the tomatoes are softened and the stuffing golden-brown.", "For the lamb, place the lamb steak into a bowl, rub with the olive oil and season with salt and freshly ground black pepper.", "Heat a griddle pan and chargrill the steak for 5-6 minutes on each side, or until cooked to your liking. Leave to rest for five minutes.", "To serve, place the lamb steak onto a serving plate with the stuffed tomatoes."]}, {"isVegetarian": false, "title": "Pan-fried lemon and chilli haddock with a herb salad", "url": "www_bbc_co_uk_food_recipes_panfriedlemonandchil_90720", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp chilli powder", "½ tsp mixed spice", "½ tsp paprika", "salt and freshly ground black pepper", "150g/5½oz fresh haddock fillet, cut into two pieces", "1 tbsp olive oil", "½ lemon, juice only", "1 handful mixed fresh parsley leaves, fresh basil and fresh chives", "½ lemon", "pinch chilli powder"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock, mix together the chilli powder, mixed spice, paprika, salt and freshly ground black pepper and rub the mixture into the fish. ", "Heat the olive oil in a frying pan and fry the haddock, skin-side down, for 2-3 minutes, or until golden-brown and crisp. Turn the fish over and cook for a further 1-2 minutes, or until the fish is golden-brown all over and cooked through. Finish with a squeeze of lemon juice. ", "To serve, place the mixed fresh herbs on a serving plate and place the fish on top. Garnish with the lemon half and a sprinkle of chilli powder."]}, {"isVegetarian": false, "title": "Pan-fried mackerel, chorizo-braised leeks and shallot crisps", "url": "www_bbc_co_uk_food_recipes_panfriedmackerelchor_92518", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 large leek, white part only, cut into 1cm/½in slices", "1½ tsp salt", "110g/4oz cooking chorizo, skin removed, chopped", "½ tsp smoked paprika (available from Spanish delicatessens)", "3 tbsp hot chicken stock", "250ml/9fl oz vegetable oil, for deep frying, plus 1 tbsp extra", "1 tsp plain flour", "2 banana shallots, peeled, sliced into rings", "2 mackerel fillets, skin scored several times using a sharp knife"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a medium-sized, deep-sided frying pan over a medium heat. When the butter is foaming, add the leeks and season with a half-teaspoon of salt. Fry for 3-4 minutes, or until the leeks have softened and are golden-brown.", "Add the chorizo and smoked paprika and continue to fry for 4-5 minutes, stirring occasionally, until the chorizo has browned and is crisp. ", "Add the stock and bring the mixture to a simmer. Continue to simmer gently for a further 3-4 minutes, or until most of the liquid has evaporated.", "Meanwhile, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep-fat fryer to 140C.", "Meanwhile, sprinkle the flour onto a plate. Dredge the shallot rings in the flour until completely coated. ", "When the oil is hot, carefully lower the shallot rings into the oil. Fry for 2-3 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Season with another half-teaspoon of the salt, then set aside and keep warm.", "Meanwhile, heat one tablespoon of vegetable oil in a non-stick frying pan over a medium heat. Season the mackerel fillets all over with the remaining half-teaspoon of salt. When the oil is hot, place the seasoned mackerel fillets, skin-sides down, into the pan and fry for 3-4 minutes, or until the skin is crisp and golden-brown and more than half of the mackerel flesh has turned opaque.", "Remove the pan from the heat, then turn the mackerel fillets over and allow to cook through on the residual heat for a further 1-2 minutes.", "To serve, spoon the leek and chorizo mixture into the centre of each of two serving plates. Place some of the crisp shallot rings on top of each portion. Place one mackerel fillet on top of each."]}, {"isVegetarian": false, "title": "Pan-fried mackerel with Bretonne sauce", "url": "www_bbc_co_uk_food_recipes_panfriedmackerelwith_11634", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 fillets of very fresh mackerel (allow 170g/6oz fish for main course, 85g/3oz for a starter)", "seasoned flour", "40g/1½oz soft butter", "55g/2oz butter, melted ", "2 eggs yolks, preferably free range ", "1 tsp dijon mustard", "2 tsp white wine vinegar ", "1 tbsp parsley, chopped or a mixture of chervil, chives, tarragon and fennel, chopped"], "serves": "Serves 4 as a main course", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the griddle pan. ", "Dip the fish fillets in flour which has been seasoned with salt and freshly ground pepper. Shake off the excess flour and then spread  a little butter with a knife on the flesh side, as though you were buttering a slice of bread rather meanly. ", "When the grill is quite hot but not smoking, place the fish fillets butter side down on the grill; the fish should sizzle as soon as they touch the pan. ", "Turn down the heat slightly and let them cook for 4 or 5 minutes on that side before you turn them over. Continue to cook on the other side until crisp and golden. ", "Meanwhile, make the sauce.  Melt the butter and allow to boil.  ", "Put the egg yolks into a bowl, add the mustard, wine vinegar and the herbs,  mix well.  ", "Whisk the hot melted butter into the egg yolk mixture little by little so that the sauce emulsifies. Keep warm, by placing the heatproof bowl in a saucepan of hot but not boiling water.  ", "Serve the mackerel with the sauce, a good green salad and new potatoes."]}, {"isVegetarian": false, "title": "Grilled mackerel with gooseberry sauce, new potatoes and salad leaves", "url": "www_bbc_co_uk_food_recipes_panfriedmackerelwith_84849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "250g/9oz gooseberries, topped and tailed", "75ml/3oz double cream", "1 tsp caster sugar", "salt and freshly ground black pepper", "1 mackerel, filleted, skin on, or two mackerel fillets", "1 tbsp wholegrain mustard", "1 tbsp olive oil", "salt and freshly ground black pepper", "150g/5oz new potatoes, scrubbed and halved", "1 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "1 bag salad leaves", "2 tbsp extra virgin olive oil ", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the gooseberry sauce, heat the butter in a small saucepan, place the gooseberries into the pan, cover and cook over a medium heat for 20-25 minutes until tender.", "Remove the lid and mash the gooseberries lightly. Add the cream and sugar to the pan, season with salt and freshly ground black pepper and continue to cook for a few minutes. Remove from the heat, cover and set aside to keep warm.", "Meanwhile, for the mackerel, preheat the grill to high.", "Brush the flesh side of the mackerel fillets with the wholegrain mustard, brush both sides with olive oil and season with salt and freshly ground black pepper.", "Place the mackerel skin-side up on a baking sheet and place under the grill for 4-5 minutes, or until just cooked through. Set aside to keep warm.", "For the new potatoes, place the new potatoes in a saucepan of boiling water and boil until tender. Drain, return to the pan and drizzle over the olive oil. Stir to coat the potatoes and season with salt and freshly ground black pepper.", "For the salad, place the salad leaves into a bowl, drizzle over the olive oil and season with salt and freshly ground black pepper. Stir well to dress the salad.", "To serve, place the mackerel fillets onto serving plates and divide the new potatoes, salad and gooseberry sauce between them."]}, {"isVegetarian": false, "title": "Fried mackerel with chilli cucumbers", "url": "www_bbc_co_uk_food_recipes_panfriedmackerelwith_92575", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp rock salt", "4 dried chillies", "4 smoked dried chillies", "2 cucumbers, cut in half lengthways, each half cut lengthways into four long wedges", "4 limes, juice and zest ", "100g/3½oz polenta", "100g/3½oz fresh breadcrumbs", "1 free-range egg", "4 x 150g/5½oz mackerel fillets", "salt and freshly ground black pepper", "3-4 tbsp vegetable oil", "25ml/1fl oz tequila"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grind the rock salt, dried chillies and smoked dried chillies in a coffee grinder to a fine powder.", "Place the cucumber wedges into a bowl and pour over the lime juice. Sprinkle over the lime zest and one teaspoon of the ground chilli mixture. Mix the contents of the bowl to coat the cucumber all over in the lime zest and spice mixture. Set aside for five minutes to marinate. ", "Meanwhile, in a shallow bowl, mix together the polenta and breadcrumbs until well combined. Beat the egg in a separate bowl. ", "Season the mackerel fillets, to taste, with salt and freshly ground black pepper. ", "Dip each seasoned mackerel fillet first in the beaten egg, then dredge in the polenta and breadcrumb mixture.", "Heat the oil in a large frying pan over a medium to high heat. Add the coated mackerel fillets, in batches if necessary, and fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides and cooked through. (NB: The mackerel fillets are cooked through when the flesh is opaque.) ", "When the cucumber has marinated, pour over the tequila. ", "To serve, spoon some of the marinated cucumber into the centre of each of four serving plates. Sprinkle over the remaining spice mixture. Place one fried mackerel fillet on top of each serving."]}, {"isVegetarian": false, "title": "Pan-fried paprika chicken", "url": "www_bbc_co_uk_food_recipes_panfriedpaprikachick_73735", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panfriedpaprikachick_73735_16x9.jpg", "ingredients": ["4 small chicken breasts, without skin or bone", "150ml/5¼fl oz double  cream", "1 tbsp Worcestershire sauce", "1 tbsp runny honey", "1 tbsp paprika", "1 tbsp grainy mustard", "young spinach ", "boiled rice, cooked", "wild rice, cooked"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Lay the chicken breasts on a clean work surface. Cover with cling film and gently beat with a rolling pin or meat mallet until 1cm (0.75in) thick.", "Mix the marinade ingredients on a large flat plate then lightly spread each chicken fillet with the mixture and season. Leave to marinate for a while if times allows.", "Heat a large non-stick frying pan. Add a little oil and gently fry the chicken breasts for just under two minutes each  side or until just done. To check for doneness take a thin slice off one side of a breast. If the flesh is white it is cooked. Take care not to overcook.", "Remove any surplus oil from the pan with kitchen paper, then measure the cream into a jug and mix with the leftover paprika mixture from the plate.", "Pour the paprika cream into the pan around the chicken. Allow to bubble up and reduce slightly. Serve with young spinach and a mixture of boiled rice and wild rice."]}, {"isVegetarian": false, "title": "Deep-fried polenta with fresh tomato sauce", "url": "www_bbc_co_uk_food_recipes_panfriedpolentawithf_84152", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/10fl oz vegetable oil", "200g/7oz polenta, cooked according to packet instructions", "2 tbsp olive oil", "3 spring onions, chopped", "1 garlic clove, crushed", "140g/5oz cherry tomatoes, halved", "3 fresh basil leaves, chopped", "1 slice prosciutto, chopped", "40g/1½oz mozzarella chopped", "2 large handfuls spinach"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large heavy-bottomed pan until a breadcrumb sizzles and turns brown in it (CAUTION: Hot oil can be dangerous, do not leave unattended).", "When oil is hot, use a teaspoon to drop tablespoonfuls of polenta into the oil and deep-fry for two minutes, or until golden. Carefully remove the polenta pieces with a slotted spoon and drain on kitchen paper and keep warm.", "To make the sauce, in a separate pan heat the oil, garlic and onion together for two minutes. ", "Add the tomatoes, basil and prosciutto and cook for five minutes.  ", "Add the mozzarella and spinach to the pan and stir for 1-2 minutes, or until the spinach has wilted.", "To serve, place the polenta onto a warmed plate and pour the sauce over it."]}, {"isVegetarian": false, "title": "Pan-fried pork belly with scallop and squid", "url": "www_bbc_co_uk_food_recipes_panfriedporkbellywit_86698", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb pork belly", "2 carrots, roughly chopped", "1 onion, cut into quarters", "4 garlic cloves", "1 celery stick", "1 small bunch thyme", "1 tsp coarse sea salt", "½ tsp black peppercorns", "1 tbsp vegetable oil", "salt and freshly ground black pepper", "40g/1½oz butter", "2 onions, finely sliced", "2 tsp caster sugar", "2 sprigs thyme", "5 tbsp balsamic vinegar", "salt and freshly ground black pepper", "4 banana shallots, finely chopped", "200ml/7fl oz balsamic vinegar", "250ml/9fl oz fresh chicken stock", "salt and freshly ground black pepper", "8 scallops, sliced in half horizontally to form two discs", "4 baby squid tubes, finely sliced into rings", "1 tbsp vegetable oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For pork belly, place the pork belly into a large pan over a medium heat and cover with water. Bring to the boil, then drain off the water and return the pork belly to the pan.", "Cover with water again and add the carrot, onion, garlic, celery, thyme, salt and peppercorns. Bring to a boil, then reduce the heat and simmer for two hours.", "Carefully remove the pork from the pan and place onto a large plate. Place a large, clean tray on top, then place a couple of cans on top of the tray to apply weight. Transfer to the fridge and leave for one hour, or until cold and pressed flat.", "Remove the pork from the fridge, remove the tray and weights and place onto  a chopping board. Cut the pork into 1.5cm/½ thick slices.", "Heat a frying pan and add the vegetable oil. Season the pork slices with salt and freshly ground black pepper and fry in the hot oil until crisp and golden all over.", "For the caramelised onions, heat a clean frying pan add the butter, onions, sugar and thyme. Fry over a gentle heat for 5-10 minutes, until the onions are just tender.", "Turn the heat up and fry the onions until just becoming golden-brown.", "Add the balsamic vinegar and reduce until very little liquid remains, then season with salt and freshly ground black pepper.", "For the balsamic sauce, heat a clean frying pan and add the butter and shallots. Fry the shallots for 3-4 minutes, or until softened, but not coloured.", "Add the balsamic vinegar and boil to reduce the volume by two thirds.", "Add the stock and reduce again by two thirds, until a thick sauce forms, then season with salt and freshly ground black pepper.", "For the scallops and squid, season the scallops and squid with salt and black pepper.", "Heat a frying pan and add the vegetable oil, scallops and squid. Fry the scallops and squid for 2-3 minutes, or until completely cooked through, turning the scallops over halfway through.", "To serve, place a few slices of pork belly in the centre of each plate and top with a spoonful of caramelised onions. Place three scallop pieces on top of each, then top with the squid. Spoon the shallot sauce around the plate and serve."]}, {"isVegetarian": false, "title": "Pan-fried pork fillet with prune and Armagnac sauce and sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_panfriedporkfilletwi_88500", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pork tenderloin fillet, cut into 1cm/0.5in-thick slices", "salt and freshly ground black pepper", "50g/2oz butter", "1 jar prunes in Armagnac (alternatively you can buy semi-dried prunes and soak them in Armagnac overnight), stones removed and roughly chopped", "150ml/5fl oz double cream", "1 tbsp olive oil", "4 potatoes, peeled and cubed", "1 shallot, finely chopped", "2 tbsp roughly chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the slices of pork fillet onto a board and use a meat mallet or rolling pin to flatten them out into thin slices. Season with salt and freshly ground black pepper.", "Heat a frying pan until hot, add half the butter and the slices of pork fillet and fry on each side for 1-2 minutes, or until golden and just cooked through (you may need to do this in two or three batches to avoid overcrowding the pan). Transfer to a warm serving plate and keep warm.", "Add the Armagnac to the pan used to fry the pork fillet. Carefully flambée the Armagnac then add the prunes and cook for two minutes, mashing the prunes lightly with the back of a spoon or spatula.", "Add the cream, season with salt and freshly ground black pepper, and cook for a further minute.", "Heat a separate pan until hot and add the remaining butter, olive oil and potatoes. Sauté the potatoes for 4-5 minutes, or until golden-brown and tender.", "Add the shallot to the potato and fry for a further minute then stir in the flatleaf parsley and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the sauce over the pork fillet and pile the potatoes alongside."]}, {"isVegetarian": false, "title": "Pan-fried pork steak with aubergine, chorizo and fennel", "url": "www_bbc_co_uk_food_recipes_panfriedporksteakwit_83978", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 aubergine, thickly sliced", "125ml/4½fl oz olive oil", "2 shallots, peeled and roughly chopped", "½ clove garlic, finely sliced", "1 tbsp olive oil", "sea salt and freshly ground black pepper", "2 x 225g/8oz pork leg steaks", "1 tbsp butter", "4 baby fennel bulbs, trimmed", "1 tbsp olive oil", "40g/1½oz chorizo, sliced", "10 black olives", "8 cherry tomatoes", "½ garlic clove, finely sliced", "10g/½oz fresh basil leaves", "sea salt and freshly ground black pepper", "10g/½oz fresh chervil, plus extra to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the aubergine, slice the aubergine and place on a roasting tray with the shallot and garlic. Drizzle with olive oil.", "Place in the oven and bake for 30 minutes.", "For the pork, heat the olive oil in a non-stick frying pan and season the pork steaks on both sides with salt and freshly ground black pepper.  ", "Add the butter to the frying pan with the oil and wait until it is a nutty brown colour. ", "Add the pork and cook quickly for about three minutes on each side until just cooked through. The juices will run clear when the meat is pierced with a skewer in the thickest point.", "For the fennel and chorizo, bring a saucepan of salted water to the boil and blanch the fennel for two to three minutes until just tender, then drain.", "Heat a little olive oil in a pan, add the chorizo, olives and tomatoes and fry for two to three minutes.", "Add the garlic and blanched fennel and cook slowly for about two minutes.", "Add the basil and season to taste.", "Place a slice of aubergine in the middle of each plate, top with the pork steak and a spoonful of the fennel and chorizo mixture.", "Garnish with sprigs of fresh chervil."]}, {"isVegetarian": false, "title": "Pan-fried pork with oriental salad", "url": "www_bbc_co_uk_food_recipes_panfriedporkwithorie_81607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz caster sugar", "pinch chilli flakes", "75ml/2½fl oz water", "half a bunch watercress", "150g/5½oz pork fillet, flattened out using a meat mallet", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, put the sugar, chilli flakes and water into a small frying pan and cook slowly for 5-6 minutes or until it has a syrup-like consistency. Leave to cool.", "To make the pan-fried pork, roll the pork fillet in olive oil, salt and freshly ground black pepper and sear in a hot non-stick frying pan for two minutes on each side. ", "Remove from the heat and leave to rest for two minutes. Slice into five pieces and arrange in the middle of a plate.", "To serve, scatter the watercress round the pork and drizzle with the oriental dressing."]}, {"isVegetarian": false, "title": "Pan-fried pork with pepper sauce", "url": "www_bbc_co_uk_food_recipes_panfriedporkwithpepp_80615", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz pork chop ", "1 tbsp olive oil ", "25g/1oz butter ", "½ red pepper, chopped ", "½ onion, sliced ", "1 tbsp tomato ketchup", "30ml/1fl oz double cream ", "splash of white wine"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking. Brush the pork chop with oil and add to the griddle to cook for six minutes. Turn the chop over and cook for a further six minutes, or until browned and cooked through. When cooked, the juices will run clear when pierced with a sharp knife. Remove from the heat and set aside to rest for three minutes.", "For the pepper sauce, heat the butter in a pan over a medium heat. Once the butter has foamed, add the red pepper and onion and sauté for six minutes, until softened. ", "Transfer the red pepper and onion into a food processor and blend to a smooth purée. Add the tomato ketchup, cream and white wine and blend again briefly to mix. ", "To serve, place the pork onto a plate and drizzle over the pepper sauce."]}, {"isVegetarian": false, "title": "Pan-fried pork with sage, apricots and red cabbage coleslaw", "url": "www_bbc_co_uk_food_recipes_panfriedporkwithsage_67191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 pork loin steaks", "2 cloves garlic, finely chopped", "2 tbsp Dijon mustard", "1 glass dry white wine", "290ml/10fl oz vegetable stock", "1 lemon, juice only", "12 whole sage leaves", "salt and pepper", "½ red cabbage, finely chopped", "2 carrots, grated", "1 spanish onion, finely chopped", "1 clove garlic, finely chopped", "2 tbsp olive oil", "1 lemon, juice only", "4 tbsp mayonnaise", "255g/9oz dried apricots, sliced ", "1 tbsp white wine vinegar", "1 tsp calvados", "5 tbsp olive oil", "pinch dried or fresh sage"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Soak the sliced apricots in the white wine vinegar, calavados, some olive oil and some sage for 1 hour.", "Heat the olive oil in a large frying pan.  Pan-fry the pork loin steaks very lightly on both sides.  Add the garlic, mustard, wine and vegetable stock, lemon juice, sage,  salt and pepper and apricots.  Reduce by a half and allow to simmer for up to 5 minutes (longer depending on thickness of steak).", "Mix all the coleslaw ingredients in a large bowl.  Season, cover and chill in the fridge if you have time.", "Serve the pork on a bed of coleslaw and the apricots on top with the remaining sauce in the pan drizzled over. Add some sage leaves to garnish."]}, {"isVegetarian": true, "title": "Pan-fried ratatouille", "url": "www_bbc_co_uk_food_recipes_panfriedratatouille_9975", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panfriedratatouille_9975_16x9.jpg", "ingredients": ["1 medium onion, diced", "1 tsp chopped garlic", "3 tbsp olive oil", "1 aubergine, diced", "1 courgette, diced", "1 red pepper, diced", "pinch chilli powder", "2 tomatoes peeled, de-seeded and diced", "1 tbsp fresh coriander leaves, chopped", "¾ tsp saffron strands (soaked 1 tbsp warm water)", "squeeze lemon juice", "salt and coarsely ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle aubergine with salt and set aside for 15 minutes before rinsing and patting dry with a cloth (to draw out any bitter juices).", "Soften the onion and garlic in the olive oil over a gentle heat.", "Add the diced aubergine, the diced courgette, diced red pepper and chilli powder.", "Stir and fry for 5-10 minutes until softened, season with salt and the coarsely ground black pepper.", "Stir in the chopped tomatoes, heat through for five minutes.", "Add the chopped coriander and soaked saffron strands.", "Sharpen with lemon juice, re-season with salt and freshly ground black pepper and serve."]}, {"isVegetarian": false, "title": "Pan-fried rainbow trout with dwarf beans, peas and almonds", "url": "www_bbc_co_uk_food_recipes_panfriedrainbowtrout_92110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 rainbow trout, filleted", "salt and freshly ground black pepper ", "50g/2oz butter", "110g/4oz butter", "300g/11oz dwarf beans, trimmed", "110g/4oz fresh peas, shelled", "125g/4½oz baby banana shallots, peeled, cut in half lengthways", "4 tbsp flaked almonds", "salt and freshly ground black pepper ", "2 tbsp light olive oil", "2 slices white bread, cut into small cubes", "salt", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "2 tbsp extra virgin olive oil", "2 heads Little Gem lettuce, leaves separated and washed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the trout, season the trout fillets all over with salt and freshly ground black pepper.", "Heat the butter in a frying pan over a medium to high heat. When the butter is foaming, add the trout fillets, skin-side down, and fry for 2-3 minutes, or until the skin is crisp and golden-brown and the flesh is almost cooked through.", "Turn the trout fillets over and fry for a further minute, then remove the pan from the heat and set aside to rest (the residual heat from the pan will cook the trout fillets through). ", "Meanwhile, for the dwarf beans, peas and almonds, add 25g/1oz of the butter and all of the beans to a frying pan and heat over a medium heat. Pour in enough boiling water to just cover the beans, then return to the boil.", "Reduce the heat until the mixture is simmering, then continue to simmer for 2-3 minutes, or until the beans are just tender. Drain well and set aside.", "Add the peas and continue to boil for a further 1-2 minutes, or until tender.", "Meanwhile, heat the remaining butter in a separate frying pan over a medium heat. When the butter is foaming, add the shallots and fry for 3-4 minutes, stirring frequently to prevent the shallots from sticking or burning, until the shallots have softened and are golden-brown and the butter has darkened in colour. ", "Add the drained beans and peas and the flaked almonds to the pan with the shallots in it and stir to combine. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the salad and dressing, heat the two tablespoons of light olive oil in a frying pan over a medium heat. When the oil is hot, add the bread cubes and fry for 1-2 minutes on all sides, or until crisp and golden-brown all over. Remove the croûtons from the pan using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt.", "In a large bowl, whisk together the mustard, vinegar and the two tablespoons of extra virgin olive oil until well combined. Add the lettuce leaves and croûtons and mix with the dressing until they are coated.", "To serve, spoon the dwarf beans, peas and almonds into the centre of each of four serving plates. Place two fillets of trout on top of each serving. Pile the salad alongside."]}, {"isVegetarian": false, "title": "Pan-fried red snapper with coriander Puy lentils", "url": "www_bbc_co_uk_food_recipes_panfriedredsnapperwi_91723", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "1 tbsp olive oil", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 sprig fresh thyme, leaves only", "2 tsp cumin seeds", "1 tsp ground coriander ", "300g/11oz Puy lentils", "175ml/6fl oz red wine", "450ml/16fl oz chicken stock", "2 tbsp Cabernet Sauvignon vinegar, or other red wine vinegar", "salt and freshly ground black pepper", "1-2 tsp olive oil", "25g/1oz butter", "2 red snapper fillets, trimmed, skin scored at 1cm/½in intervals using a sharp knife, each fillet cut into 2 portions", "1-2 tsp olive oil, plus extra to serve", "25g/1oz butter", "20 baby shallots, peeled", "1 tbsp caster sugar", "110ml/4fl oz water", "salt and freshly ground black pepper", "3 tbsp chopped fresh coriander leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the coriander Puy lentils, heat half of the butter and all of the olive oil in a frying pan over a medium heat. Add the shallot, garlic and thyme leaves and fry for 2-3 minutes, or until softened.", "Add the cumin seeds and ground coriander and cook for a further minute, or until the spices are fragrant.", "Add the Puy lentils and stir well, then add the red wine and bring the mixture to a simmer. Continue to simmer the mixture, stirring well, until the volume of liquid has reduced by one-third. ", "Add the stock and bring the mixture to the boil. Reduce the heat until the mixture is simmering and continue to cook for 25-30 minutes, or until the lentils are tender and have absorbed the liquid.", "Add the remaining butter and the Cabernet Sauvignon vinegar to the pan. Stir well, until the butter has melted, then season, to taste, with salt and freshly ground black pepper. Keep warm.", "Meanwhile, for the red snapper, heat the oil and butter in a frying pan over a medium to high heat. When the butter is foaming, add the red snapper fillets, skin-side down, and fry for 3-4 minutes, or until crisp and golden-brown.", "Carefully turn the red snapper fillets over and continue to fry for a further 1-2 minutes, or until cooked through. Remove from the pan and set aside on a warm plate.", "For the braised shallots, heat the oil and butter in a separate frying pan over a medium heat. When the butter is foaming, add the shallots and fry for 3-4 minutes, or until just coloured.", "Add the sugar and water and stir well until the sugar has dissolved. Bring the mixture to a gentle simmer and continue to cook for 5-8 minutes, or until the shallots are tender and the majority of the liquid has evaporated. Season, to taste, with salt and freshly ground black pepper.", "Just before serving, sprinkle the coriander over the Puy lentils and cook for one minute, stirring well, or until the mixture is warmed through.", "To serve, divide the coriander Puy lentils equally among four serving plates. Place one piece of red snapper fillet on top of each serving. Dot the braised shallots around the edge of each plate and drizzle a little olive oil over them."]}, {"isVegetarian": false, "title": "Pan-fried roasties", "url": "www_bbc_co_uk_food_recipes_panfriedroasties_78909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2½lb Maris Piper potatoes, cut into even sized chunks and boiled", "½ garlic bulb", "sprig of fresh thyme", "duck or goose fat"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the duck fat in a hot pan with the garlic bulb and thyme.", "Put the pre-boiled potatoes into the pan.", "Don't move them around.  Allow them to caramelise on one side before turning.", "Continue turning until golden and crispy on all sides.", "Turn out on some kitchen towel to drain."]}, {"isVegetarian": false, "title": "Pan-fried salmon fillet with mussels, fennel and saffron", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonfillet_81029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil and butter, for frying", "4 x 170g/6oz pieces of thick salmon fillet, skin on", "salt and freshly ground black pepper", "1.5kg/3lb 5oz live mussels", "50g/1¾oz unsalted butter", "3 shallots, finely chopped", "1 small leek, finely chopped ", "½ bulb fennel, finely sliced", "200g/7¼oz brown chestnut mushrooms, sliced", "pinch curry powder", "pinch of saffron strands", "25ml/1fl oz pastis", "100ml/3½fl oz double cream", "1 bay leaf", "50g/1¾oz flatleaf parsley, roughly chopped", "1 tbsp butter", "additional saffron strands"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the salmon, in a non-stick frying pan heat the olive oil and butter.", "Season the salmon and place in the hot pan, skin side down. Leave for 3-4 minutes before carefully turning over. Cook for another two minutes.", "Place in the oven and cook for 5-6 minutes or until cooked to your liking.", "To make the sauce, scrub the mussels well, discarding any that are cracked or will not close when tapped. ", "Melt the butter in a large saucepan and add the shallots, leeks, fennel and mushrooms. Then add the curry powder, saffron and a splash of pastis. Bring to the boil. ", "Add the mussels, the cream and the bay leaf and finally the parsley and the butter. Season to taste.", "Once the mussels open the sauce is ready to serve.", "Serve at once with the pan-fried salmon fillet, sprinkled with the saffron strands."]}, {"isVegetarian": false, "title": "Pan-fried salmon stuffed with chestnuts and wild mushrooms with roasted cherry tomatoes and basil oil", "url": "www_bbc_co_uk_food_recipes_panfriedsalmonstuffe_84922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5oz salmon, cooked, cut into cubes", "150g/5oz wild mushrooms, chopped ", "salt and freshly ground black pepper ", "50g/1¾oz vacuum-packed chestnuts, chopped", "50g/1¾oz ricotta", "200g/7oz salmon fillet, cut in half", "1 handful fresh basil leaves", "2 tbsp olive oil", "200g/7oz cherry tomatoes ", "1 tbsp of olive oil", "salt and freshly ground black pepper ", "1 bunch fresh basil chopped", "40ml/1½fl oz olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the filling, heat the olive oil in a frying pan and fry the salmon and mushrooms for seven minutes. Season with salt and freshly ground black pepper and leave to cool slightly.", "Add the chopped chestnuts and ricotta, transfer the mixture to a food processor and blend until smooth.", "For the stuffed salmon, spread the chestnut mixture on top of one of the salmon halves, add the fresh basil leaves and top with the other piece of salmon.", "Heat the oil in a frying pan and add the stuffed salmon and cook for four minutes on each side, or until cooked through.", "Place the tomatoes onto a baking sheet, drizzle with oil and season with salt and freshly ground black pepper. Place in the oven to roast for six minutes.", "For the basil oil, mix the basil and olive oil in a clean bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, spread the basil oil onto a plate. Place the salmon on top and the roasted tomatoes alongside."]}]