[{"isVegetarian": true, "title": "Bread and butter surprise", "url": "www_bbc_co_uk_food_recipes_bread_and_butter_60669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter, softened, plus extra for greasing", "2 slices day-old white bread", "2 tinned pear halves, drained, chopped, plus extra to serve", "4 tsp milk chocolate drops", "1 free-range egg", "125ml/4½fl oz milk", "25g/1oz caster sugar", "plain yoghurt, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a 400ml/14fl oz ovenproof dish with butter. Place the greased dish onto a baking tray.", "Butter one side of each piece of bread, then cut each piece into four triangles. Arrange a layer of four triangles into the bottom of the dish.", "Sprinkle over half of the chopped pear and chocolate drops.", "Repeat the process with the remaining bread, pear and chocolate drops.", "Beat the egg and sugar together until pale and well combined, then beat in the milk. Pour the mixture into the dish to cover the bread and fruit layers. Press any bread not covered by the egg mixture down into the liquid to soak, using a fork.", "Bake the pudding in the oven for 25-30 minutes, or until the custard has set and is golden-brown on top.", "Serve with plain yoghurt and extra pieces of pear, to garnish."]}, {"isVegetarian": true, "title": "Bread pudding (Zemlovka)", "url": "www_bbc_co_uk_food_recipes_bread_pudding_zemlovka_35608", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½ oz raisins", "100ml/3½fl oz cold tea", "3 apples or 3 pears or a mixture of both", "squeeze lemon juice", "400ml/14fl oz full-fat milk", "125g/4½ oz unsalted butter, plus extra for greasing", "3 eggs", "100g/3½ oz soft brown sugar", "2 tsp cinnamon", "1 tsp nutmeg, freshly grated", "1 tsp vanilla extract", "½ large bread loaf, can be a bit stale (or brioche)", "1 tbsp brown sugar crystals"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First put the raisins in a small bowl, add the cold tea and leave them to soak. ", "Peel, core and slice the apples or pears and keep them fresh in a bowl of water with a squeeze of lemon juice. ", "Grease a baking dish and preheat the oven to 180C/350F/Gas 4.", "Gently warm the milk in a saucepan, then add the butter and allow it to melt. Set the milk and butter aside to cool to lukewarm.", "Put the eggs, sugar, cinnamon, nutmeg and vanilla in a bowl and beat with an electric handwhisk until well combined. Whisk in the buttery milk.", "Tear the bread into pieces, keeping the crusts on or off depending on how posh you are, and layer them in the greased baking dish. Strain the raisins, discarding the tea, and scatter them over the bread, then top with the sliced fruit. Pour in the batter and sprinkle on brown sugar crystals. ", "Bake in the preheated oven for about 30 minutes until the pudding has set and has a golden crust on top. ", "Serve with ice cream or custard, or try some soured cream for a change."]}, {"isVegetarian": false, "title": "Bread stuffed with sausage and zampone", "url": "www_bbc_co_uk_food_recipes_bread_stuffed_with_53425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong bread flour, plus extra for kneading", "7g fast-action dried yeast", "1 tsp salt", "2 tbsp olive oil", "½ zampone (pre-cooked, boned pig's trotter), boiled for 20 mins and chopped (available from some Italian delis)", "¼ savoy cabbage, sliced and blanched", "2 fennel sausages, cooked and sliced", "2 smoked sausages, cooked and sliced", "150g/5½oz new potatoes, cooked and sliced ", "100-150g/3½-5½oz soured cream or crème fraîche", "100-150g/3½-5½oz beaufort cheese or reblochon cheese"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the bread dough, place the flour in a large bowl and add the yeast and salt and mix. Slowly add 150-200ml water until it comes together as a dough. Knead for at least 5 minutes until you have a smooth dough. Place in a lightly floured, large bowl, cover and leave to prove for about an hour or until doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a medium frying pan and add the oil, fry the trotter with the cabbage for 2-3 minutes.", "Knock the air out of the dough, and roll out into a circle on a floured surface.", "Place all the filling ingredients into one half of the rolled out dough circle, mix them together and then fold the other half over to make a semi-circle. Crimp the edges until well-sealed and place on a baking tray lined with baking paper.", "Bake in the oven for 15–20 minutes or until golden-brown. When you tap the bottom it should sound hollow.", "To serve, place the cooked bread onto a serving plate and tear open."]}, {"isVegetarian": true, "title": "Bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_breadandbutterpuddin_88983", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadandbutterpuddin_88983_16x9.jpg", "ingredients": ["3 free-range eggs", "3 tbsp caster sugar", "2 cups milk and cream mixed together, half and half", "½ tsp vanilla extract", "1 loaf white bread, croissants, brioche or panettone", "50g/20z butter", "large handful raisins, soaked in Marsala", "double cream or custard, to serve"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Mix the eggs, sugar, milk and vanilla extract together in a large bowl.", "Slice the bread of your choice, toast and butter it and arrange in overlapping slices in the bottom of an ovenproof dish, leaving some edges sticking out at the top so that they crisp up. Scatter the soaked raisins over the top and then pour in the egg mixture.", "Bake for 30 minutes in the preheated oven and serve warm with cream or custard."]}, {"isVegetarian": true, "title": "Bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_breadandbutterpuddin_85936", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadandbutterpuddin_85936_16x9.jpg", "ingredients": ["25g/1oz butter, plus extra for greasing  ", "8 thin slices bread", "50g/2oz sultanas ", "2 tsp cinnamon powder", "350ml/12fl oz whole milk ", "50ml/2fl oz double cream", "2 free-range eggs ", "25g/1oz granulated sugar", "nutmeg, grated, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1 litre/2 pint pie dish with butter.", "Cut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.", "Arrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.", "Gently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.", "Crack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.", "Add the warm milk and cream mixture and stir well, then strain the custard into a bowl. ", "Pour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.", "Preheat the oven to 180C/355F/Gas 4.", "Place the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown."]}, {"isVegetarian": true, "title": "Deep-fried mushrooms", "url": "www_bbc_co_uk_food_recipes_breadcrumbed_mushrooms_70965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "1 tsp chopped fresh flatleaf parsley", "2 free-range eggs", "50ml/2fl oz milk", "freshly ground black pepper", "vegetable oil, for deep-frying", "400g/14oz mixed mushrooms, cleaned, sliced lengthways"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the flour and parsley in a wide, shallow bowl. Whisk the eggs, milk and some freshly ground black pepper together in a separate bowl.", "Heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the mushroom slices in the egg mixture, then coat with the flour mixture.", "Carefully place the mushrooms into the oil and fry for 3-4 minutes, or until golden-brown. (You may need to do this in batches. Do not overcrowd the pan.)", "Remove the mushrooms from the oil with a slotted spoon and set aside to drain on kitchen paper."]}, {"isVegetarian": false, "title": "Breadcrumbed pheasant breast with beetroot purée and marinated beetroot", "url": "www_bbc_co_uk_food_recipes_breadcrumbedpheasant_87654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz raw beetroot, peeled, cut into chunks", "1 onion, roughly chopped", "½ garlic clove, roughly chopped", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper ", "350g/12oz cooked beetroot, cut into wedges", "30g/1 oz shallot, finely chopped", "2 tbsp fresh flatleaf parsley, finely chopped", "2 tbsp fresh chervil, finely chopped", "2 tbsp fresh chives, finely chopped", "3 tbsp balsamic vinegar", "4 tbsp extra virgin olive oil", "salt and freshly ground black pepper ", "4 pheasant breasts, boneless and skinless", "salt and freshly ground black pepper ", "75g/3oz plain flour", "1 free-range egg, beaten", "50g/2oz breadcrumbs", "25g/1oz butter", "1 tsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beetroot purée, place all of the beetroot purée ingredients into a food processor and blend to a purée.", "Transfer the purée into a frying pan over a low heat. Cook for 30-40 minutes, stirring occasionally. Season, to taste, with salt and freshly ground black pepper.", "For the marinated beetroot, place all of the marinated beetroot ingredients into a bowl and season, to taste, with salt and freshly ground black pepper. Place into the fridge and leave for at least one hour, preferably longer.", "For the pheasant, place the pheasant breasts onto a clean chopping board, cover with cling film, and tap gently with a rolling pin to flatten out slightly.", "Season the pheasant breasts with salt and freshly ground black pepper, then dredge in the flour. Dip the floured breasts into the egg to coat, then dip into the breadcrumbs, coating thoroughly.", "Heat a frying pan until hot, then add the butter and oil. When the butter has melted add the breaded pheasant breasts and fry for 1-2 minutes on each side, or until golden-brown all over and the pheasant is cooked through.", "To serve, place a spoonful of beetroot purée into the centre of each plate. Cut the pheasant breasts in half lengthways and arrange two pieces onto each plate, balanced against the beetroot purée. Spoon the marinated beetroot around the pheasant and serve."]}, {"isVegetarian": true, "title": "Bread and spinach soup", "url": "www_bbc_co_uk_food_recipes_breadandspinachsoup_90402", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "½ onion, chopped", "200g/7oz spinach leaves, roughly chopped", "5 tbsp chopped fresh parsley ", "300ml/10fl oz chicken or vegetable stock", "85g/3oz white crusty bread, torn", "1 lime, juice only", "salt and freshly ground black pepper", "1 tbsp Greek-style yoghurt, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and fry the onion for 3-4 minutes, or until softened, then add the spinach, parsley and stock. Bring to the boil, then add the bread and lime juice and simmer for 3-4 minutes, or until the bread starts to break down. ", "Season, to taste, with salt and freshly ground black pepper and then blend until smooth with a stick blender. ", "Ladle the soup into a serving bowl and top with the yoghurt."]}, {"isVegetarian": false, "title": "Breaded pork cutlet tonkatsu", "url": "www_bbc_co_uk_food_recipes_breaded_pork_cutlet_27947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz sugar", "200ml/7fl oz white wine vinegar", "3 chillies ", "5g fresh root ginger, grated ", "1 garlic clove, grated", "900g/2lb beef shank ", "550g/1lb 4oz oxtail ", "450g/1lb chicken backs, cut into pieces (alternatively use chicken neck or wings)", "450g/1lb pork bones (preferably neck bones, but you can use hocks)", "pinch salt", "225g/8oz pork fat from the back (Optional. You will only need this if your other meat is very lean) ", "3 tbsp soy sauce, to taste", "1 tbsp sake, to taste", "1 tbsp mirin, to taste", "75g/2½oz plain flour", "4 free-range egg whites", "150g/5½oz breadcrumbs", "2 x pork cutlets, flattened", "¼ daikon, grated", "¼ small white cabbage, thinly sliced", "400g/14oz ramen noodles (preferably freshly-made alkaline noodles) or run frozen ramen dough across a mandolin to make big coins or strips", "½ bunch spring onions, thinly sliced ", "100g/3½oz napa cabbage, sliced", "150g/5½oz beansprouts ", "2 garlic cloves, thinly sliced", "100ml/3½fl oz ponzu sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tonkatsu, put the sugar and vinegar in a saucepan and bring to the boil. Allow to cool and then add the rest of the ingredients and blend until smooth. ", "For the broth, preheat the oven to 200C/180C Fan/Gas 6.", "Heat the beef shank and oxtail with 2.25 litres/4 pints water in a pressure cooker. Once the pressure has risen, cook for 15 minutes over medium-high heat. Release the pressure and return the cooker to the stove, or transfer the broth to a bigger soup pot. Simmer for at least 30 more minutes over a medium heat.", "While the beef cooks, spread the chicken back pieces and pork bones out on a baking tray. Roast for 30-40 minutes, or until everything is well browned.", "Once the shank and oxtail have finished simmering, remove them from the cooking liquid and set aside. Add the roasted chicken and pork bones to the cooking liquid along with 1.2 litres/2 pints water and a large pinch of salt. Add the pork back fat, if using, and bring the stock back to a simmer. Cook uncovered, with the pot steadily bubbling but not boiling, for 30 minutes. Stir occasionally.", "Remove the chicken and pork and set aside. Strain the stock to remove any large bits of gristle, then return it to the pan. Season the broth, to taste, with soy sauce, sake, mirin, and more salt, if desired. Keep the broth hot.", "For the breaded pork cutlet, put the flour, egg whites and breadcrumbs in separate bowls. Dust the pork cutlets in flour, dip in the egg whites and then coat in breadcrumbs. ", "Heat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Deep fry the pork for 4-6 minutes, or until golden-brown and cooked through.", "Meanwhile, boil the noodles in a saucepan of salted water and drain well. ", "Shred the meat from the reserved beef and oxtail. Divide the broth between 4 warmed ramen bowls and add the shredded meat. Add the noodles. Garnish with spring onions, cabbage, beansprouts and garlic. ", "Slice the pork cutlets and arrange on a serving board with the daikon, cabbage, tonkatsu sauce and ponzu sauce. Serve with the hot noodle broth."]}, {"isVegetarian": true, "title": "Breaded cheese", "url": "www_bbc_co_uk_food_recipes_breadedcheese_77127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil for deep-frying", "150g/5¼oz Wensleydale cheese, cut into triangles", "100g/3½oz breadcrumbs", "1 free-range egg, whisked"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil ready for deep frying. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) ", "Dip the cheese in the egg and then coat in the breadcrumbs. ", "Carefully drop the cheese into the hot oil and deep-fry for 2-3 minutes or until crisp and golden.", "Drain on kitchen paper and serve hot."]}, {"isVegetarian": false, "title": "Breaded chicken escalope, caper sauce, sautéed courgettes and cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_breadedchickenescalo_88767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 corn-fed chicken breasts, boneless and skinless", "salt and freshly ground black pepper", "75g/3oz plain flour", "2 free-range eggs", "60g/2½oz Japanese breadcrumbs", "2 tbsp olive oil", "50g/2oz butter", "1 banana shallot, finely diced", "1 garlic clove, finely diced", "75g/3oz gherkins, finely diced", "4 tbsp capers, rinsed", "3 tbsp roughly chopped flatleaf parsley ", "2 tbsp olive oil", "50g/2oz butter", "2-3 large courgettes, cut into cubes", "2 sprigs rosemary, finely chopped", "175g/6oz cherry tomatoes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken escalopes, place a chicken breast onto a cling film-lined board and cover with cling film. Using a meat hammer or rolling pin, bash the chicken until it is just 5mm thick. ", "Remove from the cling film and season with salt and freshly ground black pepper. Repeat with the remaining chicken.", "Scatter the flour over a plate along with salt and freshly ground black pepper, to taste. Place the eggs in a bowl and lightly beat, and tip the breadcrumbs onto another plate. Dust each chicken breast in the flour, then dip in the egg and finally coat each side with the breadcrumbs.", "For the caper sauce, heat the olive oil and butter in a large frying pan, then add the chicken breasts, one at a time, and fry until golden-brown and completely cooked through (about 2 minutes on each side). Remove with a fish slice and drain on several layers of kitchen paper.", "Add the shallots and garlic to the pan and fry for one minute. Add the gherkins and capers and cook for a further minute. Season with salt and black pepper, to taste, and add the parsley.", "For the courgettes, heat the olive oil and butter in a pan and add the courgettes and rosemary. Sauté for 3-4 minutes until just turning golden-brown and starting to soften. Add the tomatoes and cook for a further two minutes. Season with salt and freshly ground black black pepper, to taste.", "Serve the chicken with the caper sauce spooned over and a pile of courgettes and tomatoes on the side."]}, {"isVegetarian": true, "title": "Bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_bread_and_butter_pudding_72702", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz cherry jam ", "125g/4½oz butter", "400g/14oz white bread, half an average loaf, sliced", "4 tbsp demerara sugar", "10 cherries", "10 strawberries ", "1 tsp vanilla extract", "200ml/7fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the cherry jam and 340ml/12fl oz of water in a pan and stir well.", "Generously butter the sliced bread, then cut each slice into quartered triangles.", "Arrange the bread in an oven dish in a jumbled fashion.", "Pour the jam liquid all over the bread. Using a slotted spoon or ladle, press the bread down to soak up all the juices.", "Dust the top with sugar and bake for 30 minutes.", "Meanwhile, slice the cherries and strawberries in half, and discard the cherry stones.", "Add the vanilla extract to the double cream in a large bowl and lightly whisk until soft peaks form when the whisk is removed from the bowl.", "When the bread is cooked and caramelised, slice into portions and serve with a helping of cream and a scattering of fruit."]}, {"isVegetarian": true, "title": "Breaded mushrooms with chilli and herb dip", "url": "www_bbc_co_uk_food_recipes_breadedmushroomswith_83302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz mushrooms", "100g/3½oz plain flour, seasoned with salt and freshly ground black pepper", "2 free-range eggs, beaten", "100g/3½oz breadcrumbs", "500ml/18fl oz vegetable oil", "200g/7oz Greek yoghurt", "½ tsp dried chilli flakes", "1 clove garlic", "25g/1oz mixed herbs (basil, parsley, coriander, chervil, chives)", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the mushrooms in the flour, coat them in egg, then coat in breadcrumbs.", "Heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended!)", "Deep fry the mushrooms until golden. Carefully remove with a slotted spoon and drain on kitchen towels.", "To make the dip, place all the ingredients into a food processor, season with salt and freshly ground black pepper and mix until smooth.", "Serve the mushrooms on a plate with the dip in a small bowl."]}, {"isVegetarian": false, "title": "Breaded plaice with herbed rice salad", "url": "www_bbc_co_uk_food_recipes_breadedplaicewithher_76728", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2  plaice fillets", "30g/1oz plain flour", "1 egg, beaten", "30g/1oz white breadcrumbs", "1-2 tbsp olive oil", "110g/4oz basmati rice, cooked", "½ red pepper, diced", "1 orange, juice only", "3 tbsp parsley, chopped", "3 tbsp coriander, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coat the plaice fillets in flour, then in the beaten egg and finally in the breadcrumbs.", "Heat the oil in a non-stick frying pan and fry the fillets for 2-3 minutes on each side, until golden brown.", "For the salad, mix the rice, pepper, orange juice and fresh herbs into a large bowl.", "Spoon the rice onto a serving plate and serve the breaded fillets alongside."]}, {"isVegetarian": false, "title": "Breaded sole with herb pesto", "url": "www_bbc_co_uk_food_recipes_breadedsolewithherbp_79027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ loaf of white bread, crust removed", "2 tbsp mixed fresh herbs (flatleaf parsley, basil, chives)", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 free-range eggs", "1 lemon sole fillet", "2 large handfuls fresh mixed herbs (flatleaf parsley, basil, chives), finely chopped", "1 tbsp white wine vinegar", "1 tbsp olive oil", "salt and freshly ground pepper", "squeeze of lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the bread into a food processor and blend to form crumbs. ", "Add the herbs with the seasoning and pulse again. ", "Add the olive oil and eggs and blend to form a smooth paste.", "Lay the lemon sole fillet onto a non-stick baking sheet. Spread the herb and bread mixture onto the fish to cover. Place in the oven and bake for 5-6 minutes, until golden and cooked through.", "To make the pesto, mix the herbs, vinegar, olive oil, salt and freshly ground pepper and lemon juice in a bowl.", "To serve, transfer the breaded fillet to a plate and spoon over the herb pesto."]}, {"isVegetarian": true, "title": "Bread sauce", "url": "www_bbc_co_uk_food_recipes_breadsauce_84755", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breadsauce_84755_16x9.jpg", "ingredients": ["1 day-old loaf unsliced white bread", "1 litre/2 pints full-fat milk", "1 onion, peeled and quartered", "4 cloves", "2 fresh bay leaves", "1 tsp white peppercorns", "2 blades fresh mace or heaped ¼ tsp ground mace", "2 tsp salt", "30g/1oz butter", "2 tbsp double cream, optional", "1 fresh nutmeg, for grating"], "serves": "Makes 1 litre", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the crust from the bread and tear the stripped loaf into a mound of rough chunks or cubes about 2cm/¾in in size. You should end up with 175-200g (6¼-7¼oz) of cubes.  If the bread is not slightly stale already, leave the pieces out on a wire rack to dry out.", "Pour the milk into a saucepan.  Press a clove into each quarter of the onion.", "Add the onion quarters, bay leaves, peppercorns and the blades of mace (or sprinkle the ground mace into the pan) along with the salt and bring to the mixture almost to its boiling point. ", "Remove the pan from the heat.  Cover the pan with a lid and let the ingredients infuse for at least half an hour, though you can leave it for a few hours if that helps with your cooking schedule. ", "After the mixture has infused, place the pan back on a very low heat.  Using a slotted spoon, remove the onions, peppercorns, cloves, bay leaves and the blades of mace.  ", "Add the bread to the saucepan and cook for about 15 minutes, stirring every now and then, by which time the sauce should have become thick and warm. ", "Just before serving the bread sauce, add the butter to the saucepan and stir until the butter has melted and combined with the sauce and season, to taste, with salt. ", "Add the cream (if using). Grate over quite a bit of nutmeg, adding more once you have poured the bread sauce into a warmed bowl or gravy boat."]}, {"isVegetarian": true, "title": "Bread sauce", "url": "www_bbc_co_uk_food_recipes_breadsauce_84868", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550ml/1 pint whole milk", "½ white onion, cut into quarters and studded with 3 cloves ", "2 fresh bay leaves", "150g/5¼oz sliced white bread, cut into 3cm/1in squares", "1 tsp English mustard", "freshly grated nutmeg", "50g/1¾oz unsalted butter, diced", "salt and freshly ground black pepper"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the milk in a pan with the studded onion and bay leaves. Bring to the boil briefly then turn down to a gentle simmer. ", "Add the cubes of bread and stir until it starts to break down. Remove the onion and bay leaves and whisk in the mustard and a little freshly grated nutmeg to taste.", "Cook slowly for 10 minutes, stirring regularly. ", "To finish, stir in the butter, season with salt and freshly ground pepper. Place in a bowl or gravy boat, cover with cling film and leave in a warm place until ready to serve."]}, {"isVegetarian": true, "title": "Breakfast bars 2.0", "url": "www_bbc_co_uk_food_recipes_breakfast_bars_20_09760", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_20_09760_16x9.jpg", "ingredients": ["250g/9oz medjool dates", "2 tsp ground cinnamon", "75g/2½oz goji berries", "75g/2½oz pumpkin seeds", "150g/5½oz brown flaxseeds", "50g/1¾oz cocoa nibs", "25g/1oz chia seeds", "25g/1oz cornflakes (gluten-free if required)", "100g/3½oz organic porridge oats (not instant)"], "serves": "Makes 16 bars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4, and line the bottom and sides of a 20cm/8in square tin with baking parchment. ", "Pit the dates and tear them with your fingers into a small saucepan, add the cinnamon, cover with 325ml/11fl oz cold water, bring to the boil and let bubble for 5 minutes. Turn off the heat, and beat with a fork until you have a rough purée.", "Put all the remaining ingredients into a large bowl, add the date mixture and mix until everything is combined. I wear a pair of disposable vinyl gloves for this.", "Squodge into your prepared tin and bake in the oven for 30 minutes, until firm and set, and golden on top and darker around the edges. Leave to cool in the tin before cutting into pieces."]}, {"isVegetarian": true, "title": "Breakfast bars", "url": "www_bbc_co_uk_food_recipes_breakfast_bars_49065", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_49065_16x9.jpg", "ingredients": ["100g/3½oz butter", "75ml/2½fl oz golden syrup", "175g/6oz rolled porridge oats", "50g/1¾oz pumpkin seeds", "50g/1¾oz sunflower seeds", "50g/1¾oz hazelnuts, crushed or roughly chopped", "60g/2¼oz dried apricots, roughly chopped  "], "serves": "Makes 16", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4, and line a 24x24cm/9x9in baking tin with greaseproof paper.", "Heat the butter and golden syrup in a small saucepan over a medium heat until bubbling.", "Meanwhile, tip the oats, seeds, nuts and apricots into a large bowl. Pour the hot syrup mixture over the oats and mix well to combine.", "Pour into the lined baking tray and press down into an even layer. Bake for 20 minutes, until golden-brown.", "Allow to cool for 10 minutes, then turn out and cut into 16 squares. When cold, transfer to an airtight container – they will keep for up to one week."]}, {"isVegetarian": true, "title": "Breakfast bhaji", "url": "www_bbc_co_uk_food_recipes_breakfast_bhaji_32025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz potatoes, peeled and cut into 1.5 cm cubes", "250g/9oz carrots, cut into 2cm x 1cm batons", "50ml/2fl oz vegetable oil", "2 tsp black mustard seeds", "1 medium red onion, finely chopped", "1 tsp Kashmiri chilli powder", "½ tsp turmeric", "2 tomatoes, chopped", "½ tsp salt", "1 tsp garam masala ", "4-6 free-range eggs, fried, to serve ", "Naan breads, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in boiling salted water for about 10 minutes, or until tender. Remove with a slotted spoon, set aside, then cook the carrots in the same water for about three minutes, or until just tender but still with a bit of crunch.", "Heat the oil in a heavy-based saucepan or karahi and fry the mustard seeds until they start to pop. Add the onion and fry over a moderate heat for five minutes, or until softened. Add the chilli powder and turmeric and fry for 30 seconds, then add the potatoes, carrots, tomatoes, salt, garam masala and 50ml/2fl oz water. Cook for 3-5 minutes, stirring to break up the potatoes a bit, until the tomatoes are reduced and jammy.", "To serve, brush the Indian bread with a little melted ghee, butter or vegetable oil if you like, or leave plain. Serve the bhaji with naan breads and a fried egg. "]}, {"isVegetarian": false, "title": "Breakfast hash", "url": "www_bbc_co_uk_food_recipes_breakfast_hash_02520", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_hash_02520_16x9.jpg", "ingredients": ["2 tbsp groundnut oil", "50g/1¾oz butter ", "3 herby sausages, skinned", "1 onion, sliced", "½ large potato, including skin", "2 free-range eggs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan. Add the butter and skinned sausages and cook for a few minutes, stirring to ensure all the meat browns.", "Add the onion to the pan.", "Grate the potato including the skin and squeeze over the sink to remove any moisture. ", "Add the potato to the pan. ", "When the pan ingredients are cooked, crack the eggs into the pan. Serve."]}, {"isVegetarian": false, "title": "Breakfast pizza", "url": "www_bbc_co_uk_food_recipes_breakfast_pizza_68739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½ oz strong white flour, plus extra for dusting", "7g instant yeast (one sachet)", "1 tsp salt", "2 tbsp olive oil", "175ml/6fl oz tepid water", "200g/7fl oz passata", "1 tbsp tomato paste", "2 garlic cloves", "1 tsp dried oregano", "handful fresh basil leaves", "salt and freshly ground black pepper", "4 fat sausages, peeled and broken up into small pieces", "8 slices bacon, cut into pieces", "4 slices black pudding, broken up (optional)", "4 field mushrooms, thinly sliced", "4 medium tomatoes, sliced", "2–4 free-range eggs", "2 balls mozzarella, broken up", "olive oil, for drizzling"], "serves": "Makes 2 large pizzas", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pizza base, put the flour in a large bowl (or stand mixer) and sprinkle in the yeast. Stir thoroughly before adding the salt. Mix the olive oil with the water, then make a well in the centre of the flour and start pouring it in. Stir until you have a fairly wet dough, then turn out and knead until it is no longer sticky, but soft and pliable. ", "Leave to rise for an hour in a large bowl, covered, then knock back and divide into two large or 4 smaller pieces, depending on the size you are able to cook. ", "When you are ready to cook the pizzas, preheat the oven to its highest setting and either heat baking trays or a pizza stone. Shape the pizzas into large circles, then dust more baking trays with flour and transfer the pizza bases onto them – this is so you can slide them straight onto the baking tray or pizza stone. ", "Make the tomato sauce simply by blending all the tomato sauce ingredients together in a food processor with plenty of salt and pepper.", "Spread a small amount of the tomato sauce over the pizza base, then top with the pieces of sausage, bacon, black pudding (if using), mushrooms and tomatoes. ", "Break an egg or two on top, making sure that the eggs are contained by other ingredients so that the white doesn’t run off (alternatively you can turn up the edges slightly just to make sure). Sprinkle with mozzarella pieces, then drizzle with olive oil.", "Bake in the oven for around 8–10 minutes, or until the pizza is crisp and the toppings are cooked. "]}, {"isVegetarian": false, "title": "Breakfast frittata", "url": "www_bbc_co_uk_food_recipes_breakfastfrittata_85042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for frying ", "3 onions, sliced ", "1 garlic clove, chopped", "4 pork sausages, cooked and sliced", "6 large free-range eggs", "125ml/4fl oz double cream", "1 tbsp fresh thyme leaves", "salt and freshly ground black pepper", "400g/14oz can baked beans, cooked", "black caviar (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Melt the butter in a large frying pan over a low heat. Add the onions and garlic and gently fry for 15-20 minutes, until soft and beginning to caramelise. ", "Add the sliced sausages to the pan and stir well.", "Whisk the eggs, cream and thyme together in a bowl and season with salt and freshly ground black pepper.", "Add the egg mixture to the sausage and onion mixture and gently stir over a medium heat for ten minutes.", "Transfer to the grill to cook for five minutes, or until set and golden-brown.", "To serve, turn the frittata out onto a large plate and cut into quarters. Serve the portions on clean plates with a generous spoonful of baked beans and a spoonful of caviar, if using."]}, {"isVegetarian": true, "title": "Breakfast Martini", "url": "www_bbc_co_uk_food_recipes_breakfastmartini_87148", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz gin", "1 tbsp Cointreau, or similar orange liqueur", "1 tbsp lemon juice", "1½ tsp orange marmalade", "orange peel spiral, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gin, Cointreau, lemon juice and marmalade into a cocktail shaker with some ice and shake well to combine.", "To serve, strain into a Martini glass and garnish with a spiral of orange peel."]}, {"isVegetarian": false, "title": "Bream stuffed with walnuts and pomegranates", "url": "www_bbc_co_uk_food_recipes_bream_stuffed_with_76363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 bream (about 350g/12oz each), cleaned, trimmed and scaled ", "3 small garlic cloves, finely chopped ", "1 dried red chilli, crumbled ", "100g/3½oz walnuts, roughly chopped ", "4 tbsp extra virgin olive oil, plus extra for cooking", "½ lemon, juice only", "2 tsp pomegranate molasses", "2 tsp honey ", "30g/1oz coriander leaves, finely chopped ", "100g/3½oz pomegranate seeds", "salt and freshly ground black pepper ", "handful walnuts, roughly chopped", "pomegranate seeds", "extra virgin olive oil, for drizzling", "lemon wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.  ", "Make two diagonal cuts in the fish on each side.  Season the inside of the fish with salt and pepper. ", "Mix the remaining ingredients together and season.  Put this mixture inside each fish and lay them in a lightly oiled roasting tin, or in two separate oiled roasting tins. Season the outside of the fish and drizzle with olive oil.  ", "Bake for 20 minutes or until cooked through. Check the fish at its thickest part - the flesh should be white not glassy.  If they're not ready, return them to the oven for another 4 minutes or so. ", "Just before serving, toast the walnuts in a dry pan until fragrant. ", "Scatter the fish with the walnuts and pomegranate seeds, drizzle with olive oil and serve immediately with lemon wedges."]}]