[{"isVegetarian": false, "title": "Bulgar wheat salad with steamed poussin breast", "url": "www_bbc_co_uk_food_recipes_bulgarwheatsaladwith_79265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz bulgar wheat", "55g/2oz raisins", "1½ oranges, juice only", "squeeze lime juice", "1 tbsp hemp seeds (available from health food stores)", "½ red onion, peeled and finely chopped", "pinch chilli powder", "1 tsp soy sauce", "2 garlic cloves", "handful mixed fresh herbs (rosemary, thyme, parsley)", "2 poussin breasts"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the bulgar wheat in a large bowl. Pour over enough boiling water to cover and then cover with foil. Leave to rest for 10 minutes to steam.", "Add the raisins, orange juice and a squeeze of lime juice and stir together.", "Add the hemp seeds, red onion, chilli powder and soy sauce and cover with foil again until ready to serve.", "For the poussin, half-fill a pan with water. Add the garlic cloves and mixed herbs. Bring to a simmer and place a steamer on top.", "Place the poussin breasts into the steamer, cover with a lid and steam for 6-8 minutes, or until the poussin is cooked through.", "To serve, spoon the bulgar wheat salad onto a warm plate and place the steamed poussin on top."]}, {"isVegetarian": true, "title": "Bulgur wheat balls", "url": "www_bbc_co_uk_food_recipes_bulgur_wheat_balls_57026", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bulgur_wheat_balls_57026_16x9.jpg", "ingredients": ["200g/7oz bulgur wheat ", "2 medium free-range eggs", "1 small red onion, finely chopped", "2 heaped tsp turmeric", "2 heaped tsp ground cumin", "1 tsp ground cinnamon", "½ tsp cayenne pepper", "20g/½oz fresh coriander, chopped", "80g/3oz dried cranberries", "salt and pepper, to taste", "4 tbsp olive oil", "200g/7oz Greek yoghurt", "150g/5½oz sweet tamarind sauce", "25g/1oz nigella seeds", "4 tbsp fresh coriander, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the bulgur wheat for a little longer than the packet instructions say, so it’s very puffy (about 20 minutes).  Rinse under cold water to remove the starch and leave to drain until cool enough to handle. ", "Preheat the oven to 180C/160C Fan/Gas 4.", "Mix all the ingredients, except the oil, for the bulgur wheat balls together. Squeeze the mixture using your hands so it sticks together. Shape the mixture into golf-ball sized balls or patties, don't worry about making them into perfect balls. Place in the fridge for 30 minutes.", "Heat a large frying pan and add the oil, once hot add the balls and fry or 3-4 minutes. Finish them in the oven for 5-10 minutes if you like.", "Serve on sticks with a drizzle of Greek style yoghurt, sweet tamarind sauce, a sprinkle of nigella seeds and more fresh coriander."]}, {"isVegetarian": false, "title": "Bunny burgers with chunky chips", "url": "www_bbc_co_uk_food_recipes_bunny_burgers_with_36119", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bunny_burgers_with_36119_16x9.jpg", "ingredients": ["2-3 medium sized baking potatoes, peeled, cut into chips", "3 tbsp olive oil", "1 onion, finely chopped", "350g/12oz minced rabbit ", "100g/4oz minced pork belly", "4 fresh sage leaves, finely chopped", "3 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/gas 7.", "For the chips, bring a large pan of salted water to the boil, add the potatoes and boil for five minutes. Drain, then toss in the olive oil, season with sea salt and freshly ground black pepper and spread out on a baking tray. ", "Transfer to the oven for about 20 minutes, or until golden-brown and cooked through.", "For the burgers, mix together all of the burger ingredients apart from the olive oil. Season with sea salt and freshly ground black pepper, divide the mixture in half and shape into two large burgers.", "Heat the oil in a frying pan over a medium heat and fry the burgers for 4-5 minutes on each side, or until golden-brown and cooked through.", "Serve the burger with the chips and tomato ketchup."]}, {"isVegetarian": true, "title": "Grilled aubergine salad", "url": "www_bbc_co_uk_food_recipes_burnt_aubergine_salad_22252", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/burnt_aubergine_salad_22252_16x9.jpg", "ingredients": ["3 medium aubergines", "4 tbsp extra virgin olive oil, plus extra for drizzling", "½ lemon, juice only", "10g/¼oz salt", "8g ground black pepper", "pinch sugar", "80g/3oz drained cooked or tinned chickpeas", "10 dates, chopped", "1 red pepper, finely chopped", "small bunch mint, leaves picked and chopped", "small bunch coriander, leaves picked and chopped ", "chilli, to taste, finely chopped", "1 garlic clove, finely chopped", "40g/1½oz feta, crumbled", "handful flaked almonds ", "balsamic vinegar, for drizzling", "croûtons, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Prick the aubergines to allow moisture to escape while cooking. ", "On a hot barbecue, cook the whole aubergines for 15 minutes, turning every five minutes until the aubergines are soft and the skin is blackened and blistered. Set aside until cool enough to handle. ", "On a small tray, slice the aubergine open lengthways, spoon out the excess water and seeds. Remove the flesh from the skin with a spoon and place into a large bowl. ", "Drizzle with your best olive oil and the lemon juice. Season to taste with salt and freshly ground black pepper; then add a pinch of sugar.", "Reserve some of the chickpeas, pepper and mint for garnish, then mix in the remaining chickpeas, dates, pepper, mint, coriander, chilli and garlic. Taste and correct the seasoning to your liking.", "Spoon the aubergine into the middle of a serving plate and garnish with the feta, flaked almonds, reserved chickpeas, chopped mint and pepper.", "Drizzle with balsamic vinegar and a little more olive oil. Top with crisp croûtons and serve."]}, {"isVegetarian": false, "title": "Buljol butties with pepper sauce, fried bakes and aioli", "url": "www_bbc_co_uk_food_recipes_buljol_butties_with_53010", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lime", "12 medium Scotch bonnet chillies, stems removed, roughly chopped ", "15g/½oz coriander leaves, chopped", "1½ bulbs garlic, cloves peeled", "150ml/5fl oz white wine vinegar", "1½ heaped tbsp caster sugar", "1 tbsp American mustard", "1 small thumb-sized piece fresh root ginger, peeled and roughly chopped", "½ unripe (firm to touch) papaya, peeled, stone removed, flesh roughly chopped", "sea salt and freshly ground black pepper", "360g/12½oz self-raising flour, sifted, plus extra for dusting", "generous pinch salt", "20g/¾oz butter, at room temperature", "rapeseed oil, for coating", "groundnut oil, for deep-frying", "750g/1lb 10 oz salt cod (or any other saltfish) soaked for 12 hours, or overnight, changing the water 5-6 times", "2 spring onions, white bulb discarded, green ends finely chopped", "2 large vine tomatoes, seeds removed, finely chopped", "1 yellow or orange pepper, seeds removed, finely chopped", "2 tsp finely chopped chives", "1-2 limes, juice only", "½ tbsp extra virgin olive oil", "sea salt and freshly ground black pepper", "4 heaped tbsp mayonnaise", "4 garlic cloves, peeled and crushed", "2-4 tsp pepper sauce (from above), or 1 finely chopped red chilli", "½ tsp paprika", "1 ripe avocado, peeled and stone removed, thinly sliced"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pepper sauce, put the lime in a small saucepan and cover with cold salted water. Bring to the boil and cook the lime until soft and tender, about 15-20 minutes. Set aside to cool.", "In the meantime, place all the other ingredients, except the salt and pepper, into a blender and pulse until smooth.", "Finely chop the lime (keeping the peel on), discarding any seeds, and stir into the other ingredients. Transfer to a sterilised bottle or jam jar, cover with the lid and leave to ‘develop’ for a minimum of 2 days, then season to taste with freshly ground pepper and lots of salt. Give the bottle a good shake to distribute the seasoning. Store in the fridge for up to 6 months (don’t worry about any discolouration over time).", "For the fried bakes, mix the flour and salt in a large bowl then use your fingertips to rub in the butter until it resembles fine breadcrumbs. Gradually add 150-200ml/5-7fl oz water (you may not need to use it all), mixing with a spoon, until a dough forms.", "Tip the dough out onto a lightly floured work surface, rub your hands with rapeseed oil and knead, for about a minute or so, until the dough is smooth. Shape into a ball and pour a drop of oil on to your palm and coat the dough. Cover the dough in cling film and leave it to prove for 30 minutes in a warm place.", "For the buljol butties, rinse the salt cod, place in a large saucepan, cover with fresh water and bring to the boil. Once the water begins to boil, remove the pan from the heat, pour away the water, add fresh cold water and bring to the boil again. As soon as the water starts to boil, reduce the heat and simmer for about 5-10 minutes, until the salt cod is cooked through. Drain the salt cod and set aside to cool.", "When the salt cod is cool enough to handle, finely flake the fish into a bowl, taking care to discard any pin bones and skin. Gently but thoroughly mix in the remaining ingredients and season to taste with salt and pepper.", "For the fried bakes, heat the groundnut oil to 180C in a deep-fat fryer. Alternatively, fill a large, deep heavy-based saucepan two-thirds full and heat until a small piece of bread turns golden-brown almost immediately after being dropped in the oil. Line a large plate with kitchen paper.", "Return the dough to a floured surface and knead a few more times. Divide the dough into 6 balls and flatten each into a palm sized circle. Use your fingertips to coat the top of each ball with a little rapeseed oil.", "Pop balls of dough into the hot oil 2 or 3 at a time, depending on the size of your pan. Fry them for about 30 seconds to 1 minute, then flip them over and cook until they are golden-brown on both sides and puffed up. Remove using a slotted spoon and place onto the lined plate to drain. ", "For the aioli, combine all the ingredients together in a bowl. Season, to taste, with salt and pepper. ", "To serve, slice open the fried bakes, spread liberally with aioli, stuff with the salt cod mixture, and top with slices of avocado."]}, {"isVegetarian": false, "title": "Burnt grain dumplings, wild leeks and sheep’s curd", "url": "www_bbc_co_uk_food_recipes_burnt_grain_dumplings_63263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small brown onions, unpeeled", "2 whole wild leeks, roots intact", "150g/5½oz sourdough breadcrumbs", "55g/2oz unsalted butter", "1 garlic clove", "100g/3½oz fresh sheep’s curd cheese or ricotta", "1 lemon, zest only ", "100g/3½oz hard sheep’s cheese, finely grated", "1 tsp nigella seeds", "2 handfuls of garlic leaves, finely sliced", "salt", "125g/4½oz durum flour or semolina, plus extra for dusting", "125g/4½oz burnt buckwheat flour", "125ml/4½fl oz water ", "8g cold-pressed rapeseed oil", "4 tbsp vegetable oil ", "10 garlic cloves, crushed ", "4 tbsp roasted sesame or camelina oil", "2 tbsp elderflower vinegar or freshly squeezed lemon juice", "4 tbsp burnt garlic oil "], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the burnt grain dumplings, place the flours in a mixing bowl. Make an indentation in the centre, gradually add the water and knead to create a soft and smooth dough. Add the oil and continue kneading. Shape the dough into a ball, wrap in cling film and leave to rest for 15 minutes. ", "Dust a work surface with durum flour. Take a small piece of dough and roll into a rope shape that is about 2.5cm/1in wide, keeping the rest of the dough wrapped in the cling film. Cut the rope into 1cm/½ in pieces and shape each piece into a shell. Repeat with the rest of the dough. Place the dumplings on a floured board and leave to rest for a few hours or overnight. ", "Preheat the oven to 200C/180C Fan/Gas 6. Put the onions on a baking tray and bake for 35–45 minutes, or until the sugar in the onions starts to bubble from the root ends. Leave to cool and then peel. Cut in half lengthways and separate the layers into petals. Set aside and keep warm. ", "Blanch the leeks by placing them roots-end down in salted boiling water for 30 seconds. Preheat a griddle pan over a medium heat and cut the leeks into thick slices. Char-grill the leeks for 6–8 minutes, or until lightly charred. Set aside and keep warm. ", "For the burnt garlic oil, add the vegetable oil and garlic to a small saucepan and cook over medium–low heat, stirring, until it starts to brown. Reduce the heat to low and continue to cook, stirring frequently, for 10 minutes, or until the garlic turns completely black (the garlic will become very sticky in the process). Transfer the mixture to a heatproof bowl and stir in the sesame oil. Place in a blender and blitz at high speed for about 30 seconds, or until completely smooth. Strain the mixture through a coffee filter or damp muslin and transfer to a sealable container. Use this oil in Step 6 below and the remainder can be stored in the fridge for up to 2 months. ", "For the garlic dressing, whisk the elderflower vinegar with 4 tablespoons of the burnt garlic oil that was made in Step 5. ", "Fry the breadcrumbs in the butter with the garlic clove for a few minutes until golden. Discard the garlic. Cook the dumplings in boiling, salted water for 3–8 minutes. Mix the onions, leeks and dumplings with the garlic dressing in a bowl. Season with salt. ", "Divide the curd cheese between four plates and scatter with the lemon zest. Spoon the leek and dumpling mixture over the top. Cover with the breadcrumbs, hard cheese, nigella seeds and garlic leaves.  "]}, {"isVegetarian": true, "title": "Bulgur wheat salad with beetroot, honey and goats' cheese", "url": "www_bbc_co_uk_food_recipes_bulgur_wheat_salad_with_65322", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bulgur_wheat_salad_with_65322_16x9.jpg", "ingredients": ["1 large parsnip, peeled and cut into short batons", "2 carrots, peeled and cut into short batons", "3 tbsp olive oil", "100g/3½oz bulgur wheat, rinsed", "1 tbsp clear honey", "½-1 tsp dried chilli flakes, to taste", "½ lemon, juice only", "25g/1oz chopped fresh flatleaf parsley", "150g/5oz vacuum-packed cooked beetroot, drained, cubed", "100g/3½oz soft goats' cheese, finely chopped", "salt and freshly ground black pepper", "4 warm flatbreads, to serve"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray or small roasting tin with aluminium foil. ", "Put the parsnips and carrots on the baking tray and drizzle over 1 tablespoon of the oil. Season with salt and pepper and roast for 18-20 minutes. ", "Meanwhile, half-fill a saucepan with water and bring to the boil. Add the bulgur and cook for 6-8 minutes, or until almost tender. ", "Drizzle the roasted vegetables with the honey and sprinkle with the chilli flakes, turning to coat all over. Return to the oven for a further 10 minutes, or until golden-brown and sticky.", "Drain the bulgur and transfer to a large bowl. Stir in the roasted vegetables. Add the lemon juice and most of the parsley and stir again. Season with salt and pepper. ", "Spoon the bulgur wheat salad onto a serving platter. Sprinkle over the beetroot and goats' cheese. Garnish with the remaining parsley and oil. Serve with flatbreads."]}, {"isVegetarian": false, "title": "Bunny chow", "url": "www_bbc_co_uk_food_recipes_bunny_chow_38916", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bunny_chow_38916_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "½ tsp cumin seeds", "½ tsp fennel seeds", "2.5cm/1in piece of cinnamon stick", "2 green cardamom pods", "1 star anise", "1 bay leaf", "1 onion, finely chopped", "2 tbsp South African curry powder ", "2 tomatoes, chopped", "1kg/2lb 2oz boneless leg of lamb, cut into 1.5cm/½in dices", "1 tbsp finely chopped fresh ginger", "1 tbsp finely chopped garlic ", "10-12 curry leaves", "2 large potatoes, cut in cubes the same size as the meat", "salt", "2 tbsp finely chopped coriander leaves", "2 tbsp lime juice", "2 loaves of crusty white bread, unsliced, each cut across in half in the middle and most of the crumbs removed ", "coriander cress or sprigs, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and sauté the whole spices and bay leaf until the spices sizzle. ", "Add the onion and cook for 5–7 minutes until translucent. ", "Stir in the curry powder and sauté for one minute, then add the tomatoes and stir to mix. ", "Cook on medium heat, stirring often, until you get a sauce-like consistency. ", "Add the meat, ginger, garlic and curry leaves and 300ml/11fl oz water, bring to the boil then reduce the heat and simmer, stirring occasionally, for 40-50 minutes or until the meat is tender. ", "Add the potatoes, salt to taste and 200ml/7fl oz water. Continue simmering until the meat and potatoes are perfectly cooked (about 15 minutes).  ", "Stir in the chopped coriander and lime juice. ", "To serve, spoon into the hollows in the bread and garnish with coriander cress. "]}, {"isVegetarian": false, "title": "Burrida", "url": "www_bbc_co_uk_food_recipes_burrida_67681", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 carrots, peeled and finely diced", "1 onion, peeled and finely diced", "3 branches thyme, leaves removed", "4 garlic cloves, finely chopped", "olive oil", "2kg/4lbs 2oz beef/plum tomatoes skinned, seeded and chopped", "850ml/1½pt fish stock", "salt and freshly ground pepper", "sugar", "6 monkfish steaks on the bone", "12 squid rings", "12 king prawns", "6 small bass or bream fillets", "12 mussels", "1 baguette", "125g/4oz butter", "6 cloves garlic, finely chopped", "2 tbsp parsley, finely chopped"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Cook the carrots, onion, thyme and garlic in some olive oil over a low heat.  ", "Add the tomatoes and the fish stock.", "Season with salt, pepper and a little sugar.", "Cover the sauce with a cartouche made from baking paper.", "Cook slowly for up to 2 hours. (At this stage, the burrida can be stored in the fridge for 48 hours.)", "When you want to serve, reheat the sauce adding the fish and cook for about 5-10 minutes until all the fish is cooked.", "Mix the softened butter with the garlic and parsley. Slice the baguette at an angle, grill on both sides and then spread on the parsley and garlic butter. Serve with the fish stew."]}, {"isVegetarian": true, "title": "Burrata filled tortellini with a cherry tomato sauce, finished with balsamic vinegar", "url": "www_bbc_co_uk_food_recipes_burrata_filled_59791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz 00 pasta flour, plus extra for dusting", "2 free-range eggs, lightly beaten", "225g/8oz burrata", "5 tbsp extra virgin olive oil", "2 garlic cloves, roughly chopped", "200g/7oz fresh cherry tomatoes, chopped", "large handful fresh basil", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "2 handfuls baby spinach", "1 tbsp good-quality balsamic vinegar", "50g/1¾oz hard Italian cheese, grated ", "baby basil leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the tortellini, blend the flour and eggs together in a food processor until the mixture resembles breadcrumbs. Turn it out onto a lightly floured work surface and squash the crumbs into a ball of dough. Knead the dough for 4-5 minutes, or until smooth and elastic. Wrap the dough in cling film and chill in the fridge for 20 minutes.", "To prepare the pasta, dust the rollers of a pasta machine with flour. Cut the chilled pasta into 3 pieces and flatten each out to a thickness of about 1cm/½in. Set the pasta machine to its widest setting and feed one piece of dough through the machine, turning the handle with one hand and collecting the rolled dough as it comes through the machine with the other. Change the setting on the pasta machine to the next thickest setting, dust the rollers with a little flour, then feed the same pasta sheet through the machine again, as before. Repeat this process 3 or 4 more times, flouring the machine and changing the setting down each time, until you reach the penultimate setting. As your pasta sheet becomes longer, cut it in half so that the rolling process is more manageable. Repeat the rolling process with the remaining pieces of dough. Once all of the dough has been rolled out, you should have six long sheets of pasta. ", "Cut the pasta sheets into 9cm/4in discs using a cookie cutter. Place one small piece of burrata on top of each pasta circle and brush the edges of each disc with a little water. Bring the edges of each disc together to form a semi-circular shape, pressing the edges together with your fingertips to seal. Bring the pointed ends of the tortellini towards each other around your fingertip to form a ring, then press the corners together using your other hand. ", "For the cherry tomato sauce, heat the oil in a frying pan over a medium heat. Add the garlic and fry for 1-2 minutes, or until softened. Add the cherry tomatoes and basil and cook for a further 2-3 minutes. Season to taste with salt and freshly ground black pepper.", "Bring a large pan of salted water to the boil. Carefully lower the tortellini into the boiling water, in batches, and cook for 3-4 minutes, or until they float to the surface. Remove using a slotted spoon and keeping warm while you cook the remaining tortellini. ", "To serve, heat a large frying pan and add the butter, once melted add the spinach and a splash of water and cook for 1-2 minutes or until wilted.", "Gently mix the tomato sauce with the tortellini until coated. To serve, spoon some of the wilted spinach into the bottom of each serving bowl and put the tortellini and tomato sauce on top. Drizzle with some balsamic vinegar and sprinkle some grated Italian cheese and a few small basil leaves on top."]}, {"isVegetarian": true, "title": "Butter-poached egg in a vegetable nest", "url": "www_bbc_co_uk_food_recipes_butter-poached_egg_in_a_26822", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter-poached_egg_in_a_26822_16x9.jpg", "ingredients": ["20g/¾oz butter ", "1 tsp olive oil ", "250g/9oz baby spinach ", "10 cherry tomatoes, halved ", "2 large free-range eggs", "½ lemon, juice only", "salt and freshly ground black pepper", "2 x 100g/3½oz slices wholegrain bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt three-quarters the butter with the oil in a small frying pan over a medium heat. Add the spinach and tomatoes and season. Stir, cover with a lid, turn down the heat and cook for 2–3 minutes, or until the spinach has wilted.", "Push the vegetables around the edge of the pan into a wide ring with a gap in the middle for the eggs, like a nest.", "Melt the remaining butter in the centre of the pan and let it mix with some of the juices that have come out of the vegetables. Break the eggs into the middle. Cover and cook until the eggs are done to your liking (3–4 minutes for a runny yolk and 5–6 minutes for firm).", "Meanwhile, toast the bread on both sides. ", "Season the egg and squeeze over the lemon juice. Serve immediately with the toast."]}, {"isVegetarian": true, "title": "Bunting cake", "url": "www_bbc_co_uk_food_recipes_bunting_cake_35577", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bunting_cake_35577_16x9.jpg", "ingredients": ["375g/13oz butter or margarine, softened at room temperature", "375g/13oz unrefined caster sugar", "6 large free-range eggs", "2 tsp vanilla extract", "375g/13oz self-raising flour", "2-3 tbsp milk", "few drops of blue food colouring", "few drops of red food colouring", "300g/10oz caster sugar", "5 large free-range egg whites", "500g/1lb unsalted butter, softened and cut into squares", "pinch of salt", "few drops of vanilla extract", "6 tbsp raspberry jam"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sponge layers, preheat the oven to 180C/350F/Gas 4. Grease and line the base of three 18cm/7in cake tins with baking paper.", "Cream the butter and sugar together in a bowl until pale and fluffy. Beat in the eggs, a little at a time, and stir in the vanilla extract. Fold in the flour using a large metal spoon, adding a little extra milk if necessary.", "Divide the mixture equally into three mixing bowls.  Add a few drops of blue colouring into one bowl and mix gently to get an even colour.  Add red food coluring to the other bowl and again mix for an even colour. Leave the third mix plain.", "Spoon the cake mixtures into the three cake tins and gently spread out with a spatula. Bake for 20-25 minutes, or until golden-brown on top and a skewer inserted into the middle comes out clean.", "Remove from the oven and set aside for five minutes, then remove from the tin and peel off the paper. Place onto a wire rack to cool completely.", "For the frosting, fill a large bowl with cold water. Pour 100ml/3½fl oz water into a pan and add 250g/9oz caster sugar. Heat gently and stir until the sugar dissolves, then bring the mixture to the boil. Use a damp pastry brush to wash down any sugar crystals on the side of the pan. Boil the mixture rapidly, without stirring it, until it reaches 121C/250F (use a kitchen thermometer for this). ", "Preferably using a freestanding mixer, whisk the egg whites until stiff. Start this when the sugar temperature of the syrup gets to about 100C.  Gradually whisk in the remaining caster sugar.", "As soon as the syrup reaches 121C/250F, plunge the base of the pan into the bowl of cold water, to prevent the syrup from getting any hotter. Only leave the pan in the water for a few seconds or the syrup will get too thick.", "Switch the mixer on full speed and gradually pour in the syrup in a thin stream into the middle of the bowl, trying not to get any syrup onto the sides of the bowl or the whisk, as it will set there and won't get mixed in properly.  Continue whisking the mixture for about 8-10 minutes until the bowl feels just lukewarm. If the syrup starts to become too thick to pour, return the pan to the hob very briefly.", "Gradually whisk in the butter. Then add the salt and vanilla extract. The meringue will collapse a little, and the mixture may look like it's curdled, but keep whisking it until it forms a smooth fluffy buttercream. ", "Spread the jam over two of the cake layers and top with a layer of frosting. Sandwich the cakes together.  Chill in the fridge for 15 minutes.  Remove from the fridge and gently cover the whole of the cake with the frosting.  Sprinkle with decorating sprinkles if desired.", "To make the bunting decoration, take two lengths so doweling and cover with a spiral of coloured string.  Tie a length of string across both doweling rods. Cut 5cm/2in lengths of ribbon or diamond-shape bits of fabric. Fold the bunting 'flags' over the string and glue to secure.  Gently ease the doweling into the cake and you have a lovely sweep of bunting. "]}, {"isVegetarian": false, "title": "Butter-poached lobster with asparagus, spinach and Maltaise sauce", "url": "www_bbc_co_uk_food_recipes_butter-poached_lobster_74792", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz unsalted butter", "2 lobsters, meat removed from the shells (keep the meat in whole pieces if possible)", "1 egg yolk", "1 lemon, juice only", "110g/4oz clarified butter, warmed", "½ blood orange, zest and juice only", "1 bunch asparagus, woody ends trimmed, peeled ", "100g/3½oz unsalted butter", "50g/1¾oz baby spinach", "salt and freshly ground black pepper", "2 tbsp mixed baby cress (such as baby bull’s blood, red vein sorrel and chervil) or small edible flowers"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lobster, heat a large frying pan and add the butter. Once hot and bubbling add the lobster meat and cook on each side for 1-2 minutes. Keep warm until ready to serve.", "For the Maltaise sauce, put the egg yolk, lemon juice and a tablespoon of water in a blender. Blend to combine. With the motor running, slowly pour the warmed butter through the spout in the lid until all the butter is combined and the sauce emulsifies. Finish with the blood orange zest and juice and mix to combine. Season with salt.", "For the asparagus and spinach, cook the asparagus in a large pan of boiling water for 2-3 minutes. Drain and set aside.", "Heat a large frying pan and add half the butter. Once the butter is melted, add the asparagus and fry for 2 minutes. Season with salt and pepper. Set aside on a warm plate.", "Heat the remaining butter in the pan. Add the spinach and a tablespoon of water. Cook until wilted.", "To serve, place the wilted spinach in the centre of the serving plates and top with the asparagus and lobster. Pour over the sauce and garnish with baby cress."]}, {"isVegetarian": false, "title": "Butter-poached prawns with warm garden salad", "url": "www_bbc_co_uk_food_recipes_butter-poached_prawns_50564", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 new potatoes", "1 corn on the cob", "200g/7oz unsalted butter", "10 Strangford prawns (or other large prawns), heads and shells removed and reserved, de-veined", "1 tbsp vegetable oil", "sprig fresh thyme", "sprig fresh basil, plus extra to garnish", "1 tbsp tomato purée", "200ml/7fl oz chicken stock", "1 lemon, juice only", "salt and freshly ground black pepper", "2 ripe plum tomatoes, peeled, seeds removed, sliced", "1 round lettuce, leaves separated", "1 tbsp extra virgin olive oil", "1 fennel bulb, finely sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in boiling, salted water for 5-6 minutes, or until tender, then drain. Slice the potatoes and keep warm.", "Meanwhile, cook the corn on the cob in boiling water for 5-6 minutes, or until tender. Drain well and set aside to cool slightly. Once cool enough to handle, slice the kernels off the cob into a bowl.", "Heat the butter in a saucepan until melted, then poach the prawns for 5-6 minutes, or until pink and just cooked. Remove the prawns from the butter and keep warm. Reserve the butter.", "Meanwhile, heat the oil in a frying pan and fry the reserved heads and shells from the prawns, using a wooden spoon to the crush the shells as they cook. Add the thyme, basil, tomato purée and chicken stock and bring the mixture to the boil. Simmer for 2-3 minutes, then strain the mixture into a clean saucepan. Continue to simmer until the volume of liquid has reduced by half.", "Add the reserved melted butter and blend the mixture until emulsified, using a hand blender. Season, to taste, with lemon juice, salt and freshly ground black pepper.", "Meanwhile, cook the corn kernels in boiling water for 5-6 minutes, or until tender. Drain well.Stir the corn kernels, tomatoes, prawns and fennel into the sauce.", "Place the lettuce leaves into a bowl, add a squeeze of lemon juice, the extra virgin olive oil and a little sauce and mix until combined.\r\n", "To serve, place the lettuce leaves onto serving plates, top with the potato slices then spoon over the sauce"]}, {"isVegetarian": false, "title": "Butter chicken", "url": "www_bbc_co_uk_food_recipes_butter_chicken_74537", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter_chicken_74537_16x9.jpg", "ingredients": ["100ml/3½fl oz plain yoghurt", "1 lime, juice only", "15g/½oz garlic, crushed", "2.5cm/1in piece fresh root ginger, grated", "1 tsp ground cumin ", "1 tbsp ground coriander", "1 tsp garam masala", "pinch paprika", "pinch salt", "4 x 150g/5½oz chicken breasts ", "25g/1oz unsalted butter, melted", "½ lemon", "100g/3½oz unsalted butter", "1 onion, grated", "2.5cm/1in piece fresh root ginger, grated", "2 garlic cloves, crushed", "100g/3½oz tomato purée", "2 small red chillies", "pinch chilli powder", "200ml/7fl oz double cream", "salt and freshly ground black pepper", "handful fresh coriander", "naan bread", "basmati rice"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, mix all of the marinade ingredients together in a bowl until well combined. Add the chicken breasts and make sure they’re well covered in the marinade. Set aside to marinate in the fridge for 12 hours, or overnight.", "when the chicken has marinated, preheat the grill to it's highest setting. Remove the chicken breasts from the marinade, shaking off any excess, and grill for 3-4 minutes on each side, or until the coating is golden-brown.  Baste the chicken breasts with the butter and a little lemon juice.", "Preheat the oven to 200C/400F/Gas 6 and roast the chicken for 10-12 minutes, or until cooked through.", "Meanwhile, for the sauce, heat the butter in a frying pan over a medium heat and fry the onion for 4-5 minutes, or until softened. Add the ginger and garlic and cook for a further minute, then stir in the tomato purée, chillies and chilli powder and cook for another 2-3 minutes. ", "Reduce the heat, stir in the cream and simmer for a further minute, then add the chicken breasts to the sauce. Season, to taste, with salt and freshly ground black pepper.", "Serve with basmati rice and naan bread.", "To serve, place the butter chicken breasts onto serving plates and drizzle over the sauce. Sprinkle over the coriander. Spoon the basmati rice alongside and serve with the naan bread."]}, {"isVegetarian": false, "title": "Butter chicken curry and chapati", "url": "www_bbc_co_uk_food_recipes_butter_chicken_curry_and_92429", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter_chicken_curry_and_92429_16x9.jpg", "ingredients": ["2 tsp chilli powder", "2 tsp ground cumin", "1 tbsp garam masala", "1 tsp ground coriander", "6 garlic cloves, roughly chopped", "½ tsp ground turmeric", "½ tsp ground cinnamon", "7.5cm/3in piece fresh root ginger, roughly chopped", "50g/1¾oz cashews, roughly chopped", "2 lemons, juice only", "150g/5½oz plain, full-fat yoghurt", "4 large boneless skinless chicken breasts, cut into 2.5cm/1in dice", "1 tbsp vegetable oil", "1 cinnamon stick", "4 cardamom pods, split", "2 long green chillies, finely sliced", "1 x 400g tin chopped tomatoes", "75g/2½oz chilled butter, plus 25g/1oz melted butter", "50ml/2fl oz double cream", "250g/9oz wholemeal plain flour, plus extra for dusting", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Blend the chilli powder, cumin, garam masala, coriander, 3 garlic cloves, turmeric, cinnamon, ginger and cashews to a fine purée in a food processor. Add half of the lemon juice and blitz once more until smooth. Stir in the yoghurt until well combined.", "Put the chicken breasts in a bowl and pour over the marinade, mixing to coat. Marinate in the fridge for 1 hour.", "Preheat the grill to its highest setting and place an oven shelf in the middle of the oven.", "Transfer the marinated chicken to a grill tray lined with aluminium foil. Grill for 12-15 minutes, until the marinade has browned and the chicken is just cooked through.", "Meanwhile, heat the oil in a frying pan over a medium heat. Add the cinnamon stick and cardamom pods and stir-fry for 1 minute, until fragrant. Add the remaining garlic, chillies and tomatoes and simmer for 4-5 minutes.", "Add the grilled chicken and cook for a further 4-5 minutes, until the sauce has thickened slightly and the chicken is cooked through.", "Whisk in the chilled butter a little at a time, then add the cream and simmer for another 2 minutes. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "Meanwhile, make some chapatis, pile the flour onto a clean work surface and make a well in the centre. Gradually and carefully add 250ml/9fl oz cold water, pulling the flour in from the inner edges of the well to combine, until the mixture comes together as a soft dough. Knead until soft, smooth and elastic.", "Divide the dough into 4 pieces then roll each piece into a ball. Roll out the balls onto a floured work surface to form a flat disc 2-3mm thick.", "Heat a griddle pan or non-stick frying pan over a high heat until very hot. Cook the chapatis one at a time until just charred, about 20 seconds on each side. When the chapati is cooked, bubbles will form at its surface. Brush the cooked chapatis with the melted butter.", "Serve the butter chicken with the chapatis."]}, {"isVegetarian": false, "title": "Butter chicken with butter rice", "url": "www_bbc_co_uk_food_recipes_butter_chicken_with_47272", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz boned, skinless chicken thighs, cut into two", "120g/4oz Greek yoghurt", "2 tbsp ginger and garlic paste ", "1 tbsp vegetable oil", "1½ tsp salt", "1 lemon, juice only ", "3 tsp red chilli powder", "1 tbsp ground cumin ", "½ tsp garam masala ", "1kg/2lb 4oz tomatoes", "5cm/2in piece fresh root ginger, peeled, half crushed and half finely chopped", "4 garlic cloves, peeled", "4 green cardamom pods", "1 bay leaf", "1 tbsp red chilli powder", "80g/3oz butter, diced", "2 green chillies, slit lengthways", "5 tbsp single cream", "1 tsp salt", "2 tsp dried fenugreek leaves, crushed between your fingertips", "½ tsp garam masala ", "salt and pepper", "1 tbsp sugar", "2 tbsp chopped fresh coriander, to garnish", "2 tbsp vegetable oil", "1 onion, thinly sliced", "3 green cardamom pods, crushed", "1 cinnamon stick, broken in half", "4 cloves", "400g/14oz basmati rice", "100g/3½oz unsalted butter, diced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the marinade, make small cuts all over the chicken pieces with a sharp knife to help the marinade penetrate. ", "Mix the remaining ingredients together in a deep bowl. Smear the cut chicken with the marinade, cover and set aside in the fridge for 10 minutes.", "Lift the chicken pieces out of the marinade and place on a baking tray. Bake the chicken in the oven for 13-15 minutes. You may need to turn the pieces after 8-10 minutes to ensure they colour evenly on both sides. (The chicken should not be completely cooked at this point as it will be simmered for a few more minutes in the sauce.) Strain off any cooking juices through a fine sieve and set aside. ", "For the sauce, place the tomatoes in a pan with 125ml/4fl oz water, the crushed ginger, garlic, cardamom and bay leaf. Simmer until the tomatoes are completely disintegrated. ", "Blend with a hand blender and pass the sauce through a sieve to obtain a smooth purée. Return to a clean pan, add the chilli powder and simmer for 12-15 minutes. It should slowly begin to thicken. When the sauce turns glossy, add the chicken pieces and the reserved cooking juices. Pour in a cup of water and simmer for about 3-5 minutes, or until the water is absorbed and the sauce returns to its original glossy consistency. ", "Slowly whisk in the butter, a couple of pieces at a time, and simmer for 6-8 minutes, or until the chicken is cooked through and the sauce is beginning to acquire a glaze. Add the chopped ginger, green chillies and cream and simmer for a minute or two longer, taking care the sauce does not split. Stir in the salt, crushed fenugreek leaves and garam masala, then check the seasoning. adding salt and pepper to taste and add the sugar.", "For the butter rice, heat the oil in a large saucepan and, once hot, add the onion. Cook until the onions are golden-brown - this will take approximately 10 minutes.", "Stir in the cardamom, cinnamon and cloves. Add the rice and stir to coat in the onion spice mixture. Add 600ml/20fl oz water and bring to the boil, reduce the heat to low and cover with a lid. Cook for 15 minutes, then turn off the heat, leaving the lid on, and leave to steam for another 15 minutes.", "Just before serving fork through the butter.", "Serve the butter chicken on a bed of rice and garnish with the coriander. "]}, {"isVegetarian": false, "title": "Butter chilli chicken with chips", "url": "www_bbc_co_uk_food_recipes_butter_chilli_chicken_91839", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5oz plain yoghurt", "50g/2oz ground almonds ", "1 tsp chilli powder", "2 birds’-eye chillies, roughly chopped ", "½ tsp ground cinnamon ", "1 tbsp garam masala ", "6 green cardamom pods, split and seeds lightly crushed", "4 garlic cloves, roughly chopped", "25g/1oz fresh root ginger, roughly chopped", "1 x 400g/14oz tin chopped tomatoes ", "4 chicken breasts, boneless and skinless, cut into long strips", "50g/2oz butter", "1 large onion, finely sliced", "2 birds'-eye chillies, finely sliced", "150ml/5fl oz double cream", "200ml/7fl oz chicken stock ", "4 tbsp coriander leaves, roughly chopped", "salt and freshly ground black pepper", "vegetable oil, for frying ", "400g/14oz chipping potatoes, peeled and cut into batons 1cm x 1cm x 6cm/½in x ½in x 2½in long"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, place all the ingredients except the chicken into a food processor and blend to a purée. ", "Pour into a bowl then add the chicken, mix well then place into the fridge to marinate for at least one hour.", "For the curry, heat a large sauté pan until hot, add half the butter and the onion and chillies and cook for 10 minutes until golden-brown and softened. Remove the mixture from the pan and set aside.", "Return the pan to the heat then lift the chicken out of the marinade and cook in batches on a high heat for 1-2 minutes until coloured.", "Return the onion mixture, chicken and marinade to the pan and bring to a simmer. Add the cream and chicken stock, return to a simmer and cook for 5-10 minutes until the chicken is cooked through and the sauce thickened. Season, to taste, with salt and freshly ground black pepper then stir through the coriander.", "For the chips, heat the vegetable oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave the pan unattended.) Alternatively, heat a deep-fat fryer to 160C.", "Place the potatoes into the hot oil, a few at a time, and cook in batches for 2-3 minutes until just tender but not coloured. Drain onto kitchen paper and turn up the heat to 190C/375F.", "Place the semi-cooked chips back into oil in batches and cook for another 2-3 minutes until golden-brown and crisp.", "To serve, pile the chips onto serving plates and spoon the curry alongside."]}, {"isVegetarian": false, "title": "Spice spatchcocked chicken with chilli masala sauce and puy lentil salad", "url": "www_bbc_co_uk_food_recipes_butter_chilli_13339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.5 kg/3lb 5oz chicken", "2 lemons, cut in half", "2 tbsp vegetable oil", "1 tsp ground coriander", "1 tsp ground cumin", "1 tsp ground cinnamon", "1 tsp turmeric", "1 tsp chilli powder", "½ tsp ground cardamom", "2 tbsp vegetable oil", "2 onions, finely sliced", "2 long red chillies, finely sliced", "1 tsp chilli powder", "2 crushed bay leaves", "½ tsp ground cinnamon ", "1 tbsp garam masala ", "4 garlic cloves, finely sliced", "25g/1oz fresh root ginger, finely grated", "50g/2oz ground almonds ", "400g/14oz tin chopped tomatoes ", "150ml/5fl oz double cream", "150ml/5fl oz chicken stock", "salt and freshly ground black pepper", "4 tbsp coriander leaves, roughly chopped", "400g/14oz tin cooked puy lentils, drained", "1 red onion, finely diced", "2 tomatoes, de-seeded and chopped", "2 long red chillies, seeded and finely sliced", "3 tbsp roughly chopped coriander leaves", "3 tbsp roughly chopped mint leaves", "1 lemon, juice only", "2 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Cut the chicken down the back bone, and flatten out with the palm of your hand, skin side up.", "Cut several slashes into the flesh then rub with the lemons and a little of the vegetable oil.", "Mix the spices together in a bowl then rub into the chicken.", "Heat an oven proof griddle pan until hot, place the chicken skin side down, and the lemons cut side down, onto the griddle and sear for 2-3 minutes until coloured and charred slightly at the edges. Remove the lemon from the griddle, and set aside.", "Flip over, drizzle with a little more of the oil, then place the whole pan into the oven and roast for 25-30 minutes until cooked through, and the juices run clear when the meat is pierced.", "Remove the cooked chicken from the oven and rest for 10 minutes before carving into portions.", "For the masala sauce, heat a large frying pan until hot, add the vegetable oil, onions and chillies, and cook for 10 minutes until the onions are golden-brown and softened.", "Add the spices, garlic and ginger and cook for another two minutes.", "Add the ground almonds and tomatoes and bring to a simmer then add the cream and stock. Return to a simmer and cook for 10-15 minutes until the sauce has thickened.", "Check the seasoning, and add salt and freshly ground black pepper to taste, then stir through the coriander.", "For the lentil salad, place all the ingredients into a bowl and toss together carefully, then season with a little salt and freshly ground black pepper.", "To serve, pile lentil salad onto each plate, and place a couple of pieces of chicken alongside, spoon the sauce over and finish with a charred lemon. "]}, {"isVegetarian": false, "title": "Butter poached lobster, spiced carrot purée and lemon verbena sauce", "url": "www_bbc_co_uk_food_recipes_butter_poached_lobster_45901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lobster ", "50g/1¾oz butter", "2 tbsp sugar", "pinch salt", "1 star anise", "1 cardamom pod", "1 vanilla pod", "2cm/1in piece fresh ginger", "2 carrots, diced", "25g/1oz butter", "salt and freshly ground black pepper", "2 tsp cream", "1 tbsp olive oil", "1 shallot, finely chopped", "1 carrot, finely chopped", "1 stick celery", "10g/1/3oz fennel", "1cm/½in piece fresh ginger", "1 stick of lemongrass", "1 sprig lemon verbena (fresh or dried leaves)", "60ml/2fl oz vegetable stock", "60ml/2fl oz chicken consommé", "3 tbsp cream", "lemon, juice only", "small pinch sugar\t\t", "25g/1oz broad beans", "15g/½oz butter\t", "salt and sugar, to taste", "3 morels", "4 tsp chicken consommé", "15g/½oz butter   \t", "salt and freshly ground black pepper "], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the spiced carrot purée, tie the star anise, cardamom, vanilla and ginger in a muslin bag.", "Place the carrots in a pan with the bag of spices, butter (reserving a small amount), salt and pepper, and enough water to cover. Cook slowly until the carrots are tender, remove the spices and set aside.", "Drain the carrots - reserving the cooking water. In a blender, liquidise the carrots to a smooth purée. Use some of the reserved water to loosen the purée if necessary. Stir in the remaining butter and cream.", "For the lemon verbena sauce, heat the oil in a frying pan and gently fry the shallots, carrots, celery and fennel until softened but not coloured.", "Add the ginger and lemongrass, and cook gently for 15 minutes.", "Add the vegetable stock and chicken consommé, bring to the boil and simmer gently for 30 minutes.", "Remove from the heat and add the lemon verbena leaves. Set aside to infuse in a covered pan for five minutes, then pass through a chinois or fine metal sieve.", "Add the cream and whisk vigorously to a light foam, season with salt and pepper, to taste, and finish with lemon juice and sugar.", "For the lobster, to kill the live lobster place it in the freezer for 30 minutes to stun it then pierce it just behind the head with a sharp, heavy knife or skewer.", "Separate the claws and tail from the head.", "In a pan of boiling water, blanch the claws for five minutes and the tail for three minutes, remove and refresh in ice-cold water.", "Remove the lobster meat from the shell, keeping the meat in large pieces. ", "For the broad beans, blanch the broad beans and then remove from the husks quickly.", "To cook the morels, remove their stalks and quickly wash to ensure there is no sand inside. Braise in an emulsion of the consommé and 15g/½oz butter. Season, to taste, with salt and freshly ground black pepper. Cook gently until soft.", "To finish cooking the broad beans, melt the butter in a pan. Add two tablespoons of water, a pinch of salt and a pinch of sugar and mix to make an emulsion. Add the broad beans and allow to warm through for a few minutes.", "When ready to serve, reheat the lobster by melting the butter with two tablespoons of sugar, a pinch of salt and a little water in a pan. Mix to make an emulsion. Add the lobster meat and allow to sit off the heat for three minutes to warm through. ", "To serve, place a spoonful of carrot purée in the centre of each plate. Place the lobster meat on top. Dress with the morels and broad beans. Spoon the verbena sauce around the plate and serve."]}, {"isVegetarian": false, "title": "Butter mutton with puri", "url": "www_bbc_co_uk_food_recipes_butter_mutton_with_puri_99299", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz mutton leg, bone removed, meat cut into 2.5cm/1in cubes", "150ml/5fl oz plain yoghurt", "3 garlic cloves, crushed", "3cm/1¼in piece fresh root ginger, peeled, finely grated", "1 lemon, juice only", "1 tsp garam masala", "1 tsp chilli powder", "½ tsp ground coriander", "½ tsp ground cumin", "½ tsp ground turmeric", "½ tsp salt", "1 tsp cumin seeds", "1 tsp coriander seeds", "¼ tsp fenugreek seeds", "1 cinnamon stick", "6 cloves", "50g/2oz ghee", "2.5cm/1in piece fresh root ginger, peeled, finely grated", "2 garlic cloves, crushed", "300g/10½oz tomato purée", "150ml/5fl oz double cream", "75g/3oz ground almonds", "salt and freshly ground pepper", "300g/10½oz wholewheat flour, plus extra for dusting", "pinch salt", "110ml/4fl oz water", "vegetable oil, for deep frying", "2 birds’-eye chillies, finely sliced", "2 tbsp fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the mutton curry marinade, place the mutton into a large bowl, add all the mutton curry marinade ingredients and mix well.", "Place in the fridge to marinate for at least 3 hours, or preferably overnight.", "For the mutton curry sauce, when the mutton has marinated, heat a large wok over a high heat, add the cumin, coriander, fenugreek, cinnamon and cloves and stir-fry for 10-20 seconds, or until fragrant and just toasted.", "Tip the toasted spices into a pestle and mortar and grind to a fine powder. Set aside.", "Add half of the ghee to the wok. When it has melted, add the marinated mutton, in batches, and fry for 1-2 minutes on all sides, or until slightly charred on all sides. Remove from the wok and set aside. Repeat the process with the remaining mutton.", "Add the remaining ghee to the wok, then add the ginger and garlic and fry for 30 seconds.", "Add the ground spices and tomato purée and cook for a further 1-2 minutes.", "Reduce the heat slightly, add the double cream and bring the mixture to a simmer, stirring well.", "Reduce the heat to very low, return the mutton to the pan and cook the curry gently for 1½ hours, or until the meat is tender.", "Just before serving, add the ground almonds. Stir well and cook for a further minute. Season, to taste, with salt and freshly ground pepper. ", "For the puri, place the flour into a bowl with a pinch of salt. Make a well in the centre.", "Gradually add the water, drawing more flour into the well as you go, until the mixture comes together as a firm dough. (You may not need to add all of the water.)", "Turn out the dough onto a lightly floured work surface. Knead for 1-2 minutes, then wrap in cling film and chill in the fridge for 30 minutes.", "When the dough has chilled, divide it into 4-8 golf-ball sized portions. Roll each out into 2mm thick flat discs.", "Heat the vegetable oil in a wok until a breadcrumb sizzles and turns golden-brown when dropped into it. Alternatively, heat the oil in a deep-fat fryer to 190C/375F.", "Carefully lower the puri into the hot oil one at a time. Fry for 30-45 seconds on each side, or until light golden-brown and puffed up. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "To serve, ladle the butter mutton curry onto serving plates. Sprinkle over some of the green chillies, fenugreek leaves and coriander leaves. Pile 1-2 puri alongside each serving."]}, {"isVegetarian": false, "title": "Butter poached trout and prawns in a coconut broth", "url": "www_bbc_co_uk_food_recipes_butter_poached_trout_and_23961", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "1 onion, roughly chopped", "2 garlic cloves, finely chopped", "1 anchovy fillet", "2 sticks lemongrass, finely shredded ", "2 lime leaves ", "5cm/2in fresh ginger, peeled and grated  ", "2 aubergines, diced", "bunch fresh coriander, leaves separated, stalks finely sliced", "400ml tin coconut milk", "Thai fish sauce, to taste ", "250g/9oz baby spinach ", "handful Thai basil ", "150g/5½oz butter", "150ml/5fl oz light fish stock  ", "8 raw prawns, peeled, shells reserved", "1 large trout, filleted, boneless", "bunch chives, finely chopped", "squeeze lime"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["heat the oil in a saucepan over a medium heat. Cook the onions and garlic for 10 minutes or until soft. Stir in the anchovy and cook until dissolved. Add the lemon grass, lime leaves and ginger and cook for 1 minute. Add the aubergines, coriander stalks, coconut milk and fish sauce to taste. Simmer for 20 minutes. ", "Meanwhile, melt the butter in a large saucepan placed over a medium heat. Stir in the stock and prawn shells and bring to a simmer. Turn the heat to its lowest setting and place the fish fillets into the liquid, skin side up. Cook gently for 4-8 minutes. Add the prawns and cook for another 4 minutes or until pink and cooked through.", "Stir in the spinach, coriander and basil leaves through the curry, reserving a little to garnish. ", "To serve, divide coconut broth between two large shallow bowls, scatter over the chives, prawns and break over the poached trout. Garnish with more coriander and basil leaves and a squeeze lime."]}, {"isVegetarian": true, "title": "How to make shortbread", "url": "www_bbc_co_uk_food_recipes_butter_shortbread_74896", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butter_shortbread_74896_16x9.jpg", "ingredients": ["200g/7oz unsalted butter, at room temperature, cut into small cubes", "100g/3½oz sugar, plus extra for sprinkling", "300g/10½oz plain flour, sifted, plus extra for dusting"], "serves": "Makes about 18 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3 and line a baking tray with baking paper.", "Mix together the butter and sugar, either by hand or using an electric hand whisk, until pale and smooth. Gently mix in the flour until completely incorporated (try not to work the flour too much or the biscuits will not be so crumbly). Using your hands, squeeze the mixture together into a ball of dough. (See tip for additional fillings)", "Gently roll the dough out to about 5mm/¼in thick (dust the work surface with a little flour if the dough sticks). Cut into shapes using a biscuit cutter . Transfer the biscuits onto the baking tray and chill in the fridge for 15 minutes to rest. (See tip for alternative method)", "Sprinkle each biscuit with a pinch of sugar. Bake for 15–20 minutes, or until pale golden-brown. ", "Transfer the biscuits to a wire rack to cool and serve."]}, {"isVegetarian": false, "title": "Buttered hake with cockles, mussels, samphire and a creamy saffron sauce", "url": "www_bbc_co_uk_food_recipes_buttered_hake_with_41162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 150g-200g/5½–7oz hake fillet, skin on", "40g/1½oz unsalted butter", "200g/7oz mussels, cleaned and beards removed", "200g/7oz cockles (in their shells), cleaned", "200ml/7fl oz white wine", "100g/3½oz butter", "1 shallot, finely chopped", "200ml/7fl oz double cream", "pinch fresh saffron", "6 langoustine tails, blanched and meat removed", "2 tomatoes, skinned, deseeded and chopped", "2 tbsp finely chopped chives", "2 tbsp finely chopped chervil", "300g/10½oz samphire", "50g/1¾oz unsalted butter", "micro herbs, such as paztizz ", "25g/1oz caviar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/400F.", "For the hake, butter two large pieces of greaseproof paper and put a hake fillet in the centre of each. Place on a baking tray and bake for 8-10 minutes, or until the fish is cooked.", "For the seafood and saffron sauce, discard any mussels and cockles that don't close when sharply tapped. Bring the white wine to the boil in a large saucepan. Add the cockles and mussels and cover with a lid. Cook for 2-3 minutes over a high heat.", "When the shells have opened, drain the shellfish, reserving the cooking liquor. Discard any clams or mussels that have not opened. Pick the meat from the shells. ", "Heat a frying pan and add half the butter. Fry the shallot until soft, add the reserved shellfish liquor then cook until the volume of the liquid is reduced by half. Add the cream and saffron and reduce again. Stir in the remaining butter in small pieces until the sauce thickens. Stir the langoustine tails, tomatoes and chopped herbs into the sauce to heat through.", "Heat a large saucepan of boiling water and blanch the samphire for 1-2 minutes, then drain. Melt the butter in a separate frying pan and fry the samphire for 1-2 minutes. ", "To serve, divide the samphire between two serving bowls and top with the cooked hake. Pour the sauce over the top and garnish with the micro herbs and caviar. "]}, {"isVegetarian": true, "title": "Butterbean purée bruschetta with herb and walnut salad", "url": "www_bbc_co_uk_food_recipes_butterbeanpureebrusc_84775", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 thick slice toasted ciabatta", "75g/2¾oz tinned butterbeans, drained", "1 garlic clove ", "½ tsp cayenne pepper", "50ml/2fl oz olive oil", "1 lemon, juice and zest", "salt and freshly ground black pepper ", "1 tbsp olive oil", "100g/3½oz walnuts, shelled", "handful fresh mixed herbs, chopped", "salt and freshly ground black pepper ", "mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium. ", "For the bruschetta, sprinkle the oil over the ciabatta and place under the grill, turning once, until golden-brown on both sides.", "For the purée, place all of the ingredients into a food processor and blend until smooth, then season to taste with salt and freshly ground black pepper.", "For the salad, heat the oil in a frying pan and warm the walnuts through. Transfer the walnuts to a bowl along with the chopped herbs, mix well and season with salt and freshly ground black pepper.", "To serve, spread the purée over the bruschetta, sprinkle over the herb salad and garnish with the mint."]}]