[{"ingredients": ["1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de comino", "¼ cucharadita de canela molida", "¼ cucharadita de pimienta negra", "Filete de pierna de cordero de 100 g / 3½ oz", "2 cucharadas de aceite de oliva", "3 cucharadas de miel", "½ granada, solo semillas", "1 cucharada de mantequilla", "85g / 3oz de cuscús, cocinado según las instrucciones del paquete", "1 cucharada de hojas de albahaca fresca picada", "1 cucharada de hojas de menta fresca picadas", "1 cucharada de hojas frescas de perejil de flatleaf picadas"], "method": ["Para el cordero, moler las semillas de cilantro, semillas de comino, canela y pimienta negra en un mortero con un mortero. Frote la mezcla de especias sobre ambos lados del cordero.", "Caliente una sartén hasta que esté caliente y rocíe el aceite de oliva sobre el cordero. Cocine el cordero durante 4-5 minutos en ambos lados (para el medio), o hasta que esté dorado y cocido a su gusto. Retire de la sartén para descansar en un plato caliente.", "Regrese la sartén que se usa para cocinar el cordero a fuego lento y mezcle las semillas de miel y de granada, raspando cualquier trozo dorado del fondo de la sartén con una cuchara de madera. Cocine hasta que la miel comience a burbujear, luego retírela del fuego.", "Para la 'torta' de cuscús, derrita la mantequilla en una sartén pequeña hasta que forme espuma. Mezcle el cuscús cocido con el perejil de albahaca, menta y flatleaf. Empaque la mezcla en la sartén y fríe a fuego lento durante 5-7 minutos por cada lado (voltee la \"torta\" con cuidado), o hasta que esté dorada y crujiente.", "Para servir, convierte la 'torta' de cuscús en un plato. Cuidadosamente corte el cordero y organice sobre el cuscús. Rocíe la salsa de granada y miel alrededor de los bordes del plato."], "url": "www_bbc_co_uk_food_recipes_moroccanspicedlambst_92430", "title": "Filete de cordero con especias marroquíes y pastel de cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 dientes de ajo grandes y jugosos, pelados, toscamente picados", "pellizcar copos de sal marina", "2-3 buenas pizcas pimentón ahumado", "2-3 buenas pizcas de cúrcuma molida", "1 cucharadita de semillas de comino", "glug aceite de oliva o maní", "6 muslos de pollo grandes, con hueso y piel", "buen aceite de oliva con sabor a glug", "2 cebollas, peladas, más o menos picadas", "1 limón, cortado por la mitad, en rodajas finas", "pellizcar hilos de azafrán", "puñado de aceitunas verdes, hoyos eliminados", "pequeño puñado de cilantro fresco, toscamente picado"], "method": ["Para la pasta de especias, aplastar los dientes de ajo y la sal del mar con un mortero en un mortero. Agregue las semillas de pimentón ahumado, cúrcuma y comino y muela hasta obtener una pasta. Añada aceite de oliva o de cacahuete para que la pasta se caiga lo suficiente como para servirla, pero lo suficientemente espesa como para cubrir el pollo.", "Para la cazuela, coloque los muslos de pollo en un bol, vierta la pasta de especias sobre ellos y mezcle bien para cubrir toda la carne. Cubra con una película adhesiva y déjelo marinar en el refrigerador durante el tiempo que lo permita, de la noche a la mañana, si es posible.", "Caliente el aceite de oliva en una sartén grande y poco profunda, luego cocine la cebolla hasta que se ablande. Agregue los muslos de pollo y cocine hasta que estén ligeramente coloreados en ambos lados. Agregue las rodajas de limón y vierta suficiente agua para llegar hasta la mitad de las piezas de pollo. Agregue el azafrán, luego sazone bien, cubra con una tapa y cocine a fuego lento durante unos 25 minutos, hasta que el pollo esté bien cocido y tierno. Agregue las aceitunas y el cilantro fresco y sirva."], "url": "www_bbc_co_uk_food_recipes_moroccanstylechicken_92582", "title": "Cazuela de pollo estilo marroquí", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moroccanstylechicken_92582_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cordero de 900g / 2lb de hombro", "600 ml / 1 pinta de caldo de pollo", "2 cucharadas de aceite de oliva", "1 cebolla grande, más o menos picada", "4 dientes de ajo, picados", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "1 cucharada de pimentón picante", "1 x 400 g / 14 oz pueden cortar tomates", "1 palito de canela, partido por la mitad", "175g / 6oz de albaricoques secos", "½ cucharadita de pimienta negra molida", "3 piezas grandes de cáscara de naranja", "2 naranjas, segmentadas", "1 cebolla roja, finamente picada", "1 chile rojo, finamente picado", "puñado de hojas frescas de cilantro", "1 cucharada de hojas de menta fresca, rallada", "55 g / 2 oz de piñones, ligeramente tostados, para servir"], "method": ["Retire el exceso de grasa de la superficie del cordero y córtelo en trozos de 5cm / 2 pulgadas.", "Caliente una sartén antiadherente grande o wok hasta que esté caliente.", "Agregue la mitad de los trozos de cordero y dore por todos lados, hasta que se doren por completo. Cuando esté bien dorado, retire el cordero y añada aproximadamente 100 ml / 3½ fl oz de caldo de pollo.", "Revuelva para eliminar cualquier sedimento del fondo de la sartén. Verter y reservar.", "Repita este proceso para la carne restante.", "Regrese la sartén al fuego y agregue el aceite de oliva. Cuando esté caliente agregue la cebolla y fríela suavemente por aproximadamente diez minutos, o hasta que esté dorada.", "Agregue el ajo y fría por otros dos minutos. Agregue las especias molidas a la sartén y fría por otro minuto.", "Agregue la carne reservada y los ingredientes del tajín restantes, incluido el caldo. Llevar a ebullición, cubrir y hervir a fuego lento durante aproximadamente dos horas o hasta que la carne esté tierna y tierna.", "Combina todos los ingredientes en un bol. Espolvorea los piñones sobre el tagine y sirve con gusto."], "url": "www_bbc_co_uk_food_recipes_morrocanlambtaginewi_70560", "title": "Tagine de cordero marroquí con chips de polenta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 lubina pequeña entera, eviscerada", "4 cucharadas de pasta harissa", "1 limón, cáscara y jugo solamente", "2 dientes de ajo, en rodajas", "1 cucharadita de comino molido", "pellizcar canela molida", "pizca de nuez moscada fresca rallada", "2 cucharadas de aceite de oliva, más extra para engrasar", "½ manojo de perejil de flatleaf", "4 tomates de ciruela, cortados en rodajas de 1cm / ½", "140g / 5oz de trigo bulgur", "500ml / 18fl oz de caldo de pollo, calentado", "1 cebolla roja, finamente picada", "½ manojo de perejil de hojaldre, toscamente picado", "½ manojo de menta, más o menos picada", "½ racimo de cilantro, toscamente picado", "100 g / 3½ oz de albaricoques secos, cortados en cubitos", "1 granada, semillas retiradas", "100 g / 3½ oz de sultanas, dejaba todo", "100 g / 3½ oz de pistachos, picados", "1 limón, solo jugo", "4 cucharadas de aceite de oliva virgen extra"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Recorte la lubina, quitando las aletas con tijeras y marcando la carne en un patrón entrecruzado.", "Para hacer la pasta para la lubina, coloque todos los ingredientes, excepto el perejil y los tomates, en un bol y mezcle. Frote la pasta sobre el pescado y rellene la cavidad del pescado con el perejil.", "Tome 2 pedazos grandes de papel de aluminio lo suficientemente grande como para envolver a cada pez con espacio de sobra. Coloque un trozo de papel resistente a la grasa en la parte superior de cada trozo de papel de aluminio y, a continuación, engrase ligeramente el papel con aceite. Divida los tomates entre el papel resistente a la grasa y coloque el pescado encima. Envuelva el papel y papel de aluminio a prueba de grasa alrededor de los peces como un pastel de Cornualles, utilizando la lámina para sellarlo. Hornee en el horno durante 20-25 minutos hasta que estén cocidos.", "Para hacer el tabbouleh, coloca el trigo bulgur en una cacerola y cúbrelo con el caldo de pollo. Cocine a fuego lento durante 15-20 minutos, o hasta que esté cocido. Escurrir y dejar enfriar.", "Coloque el bulgur frío y los ingredientes tabbouleh restantes en un tazón grande y mezcle bien.", "Coloque el tabblouah en un plato grande para servir, cubra con la lubina y sirva."], "url": "www_bbc_co_uk_food_recipes_morroccan_sea_bass_with_68529", "title": "Lubina marroquí con herby tabbouleh", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 rebanadas de mortadela", "50 ml / 2 fl oz crema fresca", "100ml / 3½ fl oz crema doble", "75g / 2½ oz de queso parmesano, finamente rallado", "pizca de nuez moscada recién rallada", "sal y pimienta negra recién molida", "2 cucharadas de pistachos, ligeramente triturados", "pan fino", "poca mantequilla, para untar (opcional)"], "method": ["Coloque la mortadela en un procesador de alimentos y mezcle hasta que esté finamente picado. Agregue la crème fraîche y la mitad de la crema y continúe mezclando.", "Agregue el queso parmesano y mezcle de nuevo. Poco a poco agregue la crema restante, mezclando todo el tiempo, hasta que tenga una pasta suave. Sazonar con la nuez moscada y la pimienta negra al gusto; es posible que no desee agregar sal.", "Raspe la mezcla en un tazón y alise. Espolvorea sobre los pistachos.", "Tueste el pan y, a continuación, pruébelo con mantequilla. Sirve el paté en la tostada."], "url": "www_bbc_co_uk_food_recipes_mortadella_mousse_62112", "title": "Mousse de mortadela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de jengibre molido", "Filete de rape de 100 g / 3½ oz, cortado en cubos", "sal y pimienta negra recién molida", "rociar aceite de oliva", "150g / 5½oz de tomates cherry frescos", "1 cucharada de azúcar en polvo", "2 cucharadas de vinagre balsámico", "cuñas de lima, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los kebabs, mezcla las especias con sal y pimienta negra recién molida y luego mezcla los cubos de carne en la mezcla de especias. Pase el hilo por los pinchos de metal, rocíe con aceite y luego póngalo en una sartén caliente por 2-3 minutos, o hasta que esté cocido por todos lados y cocinado a su gusto.", "Para los tomates carbonizados, mezcle los tomates con una sartén caliente a prueba de horno, agregue el azúcar y mezcle durante dos minutos. Coloque los tomates en el horno precalentado y cocine durante 5-6 minutos. Agregue el vinagre balsámico a la sartén y revuelva para cubrir.", "Para servir, apile los tomates en un plato para servir y coloque los kebabs en la parte superior. Adorne con rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_moroccanspicedkebabs_88042", "title": "Brochetas con especias marroquíes con tomates carbonizados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 galletas de crema", "500 g / 1 libra de carne de vaca magra 2 oz", "1 cucharadita de hierbas mezcladas secas", "1 huevo de gallinas camperas", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "2 cebollas, finamente picadas", "1 zanahoria pequeña, rallada", "1 diente de ajo, aplastado", "1 x 400 g de tomate picado", "2 cucharadas de puré de tomate", "Espagueti 500 g / 1 libra 2 oz, cocinado de acuerdo a las instrucciones del paquete", "sal y pimienta"], "method": ["Coloque las galletas de crema en una bolsa de plástico. Envuelva la bolsa en un paño de cocina y golpee con un rodillo hasta que se aplaste.", "Coloque la carne picada en un tazón grande, agregue las hierbas mixtas y las galletas de crema trituradas. Toque el huevo suavemente en el lado del tazón y romper el huevo en el tazón. Mezcle la mezcla de carne picada con sus manos, las manos mojadas son las mejores para este trabajo. Realmente se aplasta para que todos los ingredientes se mezclen.", "Para darle forma a las albóndigas, tome una cucharada de la mezcla de carne picada y colóquela en la palma de sus manos. Coloca tu otra mano sobre la carne picada y rueda para hacer albóndigas perfectamente redondas. Haga 16 albóndigas, coloque las albóndigas en un plato grande y deje enfriar en la nevera durante 20 minutos.", "Lávese las manos antes del siguiente paso, es muy importante lavarse las manos siempre después de tocar carne y pescado crudos.", "Para hacer la salsa de tomate, caliente una sartén grande y agregue el aceite. Agregue la cebolla, las zanahorias y el ajo y fría por 6 minutos, o hasta que estén suaves pero no dorados. Agregue los tomates en lata y el puré de tomate. Sazonar con sal y pimienta y dejar hervir a fuego lento durante 15 minutos a fuego lento.", "Caliente una cucharada de aceite en otra sartén poco profunda, agregue las albóndigas y cocine a fuego medio durante unos minutos hasta que se doren por fuera. Para mantener sus albóndigas al freír, sostenga el mango de la sartén y agite la sartén en una acción circular para que las albóndigas nunca tengan la oportunidad de asentarse, aplanarse y mantenerse en forma.", "Cuando las albóndigas estén doradas uniformemente y cocidas, agréguelas a la salsa de tomate y cocine a fuego lento durante 5 minutos más. Sirve la salsa de albóndigas con espagueti."], "url": "www_bbc_co_uk_food_recipes_mos_magic_meatballs_53940", "title": "Espagueti y albóndigas fáciles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mos_magic_meatballs_53940_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de azúcar en polvo", "1 cucharada de jugo de limón recién exprimido", "8 hojas de menta fresca, más 1 ramita extra, para adornar", "recoger hielo picado", "50ml / 2fl oz de ginebra", "75ml / 2¾fl oz de té verde frío enfriado"], "method": ["Coloque el azúcar y el jugo de lima en un vaso alto y revuelva hasta que se disuelva.", "Limpie las hojas de menta alrededor del borde del vidrio, luego rasgúelas en dos y colóquelas en el vaso.", "Aplastar las hojas de menta ligeramente con la parte posterior de una cucharadita.", "Llena el vaso con hielo picado.", "Agregue la ginebra y el té verde frío y mezcle bien.", "Para servir, adornar el vaso con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_moteato_91483", "title": "Morteart", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite, para freír", "2 kg / 4 libras 8 oz frescos mejillones en vivo", "2 cucharadas de aceite de oliva", "4 chalotes, finamente picados", "6 ramitas de tomillo, hojas recogidas", "4 dientes de ajo, finamente picados", "Vino blanco 250ml / 9floz", "Crema doble 250ml / 9floz", "50g / 2oz de mantequilla", "12 cucharadas de pan rallado fresco", "6 cucharadas de perejil de hoja plana, medio picado fino, medio picado", "4 papas grandes descascaradas, peladas y cortadas en fina juliana"], "method": ["Caliente una freidora a 190C / 375F.", "Enjuaga bien los mejillones con abundante agua corriente y quítate las barbas, tirando las que estén rotas y las que no cierren herméticamente al tocarlas.", "Caliente una sartén grande o una cacerola hasta que esté medio caliente, agregue el aceite, los chalotes y el tomillo y cocine durante 4-5 minutos, o hasta que estén blandos.", "Agregue la mitad del ajo, los mejillones y el vino y deje hervir.", "Cubra con una tapa y deje que los mejillones hiervan; están cocidos cuando las conchas se han abierto.", "Agregue la crema doble a la sartén y cocine por 1-2 minutos para espesar un poco.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue la mantequilla y caliente hasta espumar.", "Agregue las migas de pan y cocine hasta que estén doradas, revolviendo constantemente para cocinar uniformemente.", "Agregue el ajo restante y cocínelo durante un minuto, luego agregue la mitad del perejil picado y revuelva.", "Con cuidado, vierta la juliana de patata en la freidora en lotes y fríe durante 3-4 minutos, o hasta que estén doradas y crujientes. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Retirar con una espumadera y escurrir sobre papel de cocina, luego sazonar con sal marina y un poco de pimienta negra recién molida.", "Para servir, amontonar los mejillones en un recipiente grande y poco profundo, colocando los jugos sobre la parte superior.", "Espolvoree las migas de pan sobre la parte superior y sirva las papas fritas al costado."], "url": "www_bbc_co_uk_food_recipes_moules_marinire_with_11252", "title": "Moules marinière con pan rallado de ajo y perejil y papas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["135g / 4¾oz de mantequilla", "1 cebolla, finamente picada", "Arroz risotto 300g / 10½ oz", "900ml / 1½ pintas de caldo de verduras", "1½ limas, ralladura finamente rallada de 1½ limes, fruta de l de una lima pelada, cortada en segmentos, picada", "90 g / 3 g de queso parmesano, rallado", "sal marina y pimienta negra recién molida", "2kg / 4lb 8 oz de mejillones frescos", "1 cucharada de aceite de oliva", "30g / 1oz de mantequilla", "30 g / 1 oz de jengibre, pelado y en rodajas finas", "1 chile rojo, sin semillas, cortado en rodajas finas", "2 tallos de limoncillo, cortados a la mitad y magullados", "4 cucharadas de leche de coco", "4 cucharadas de crema batida", "1 puñado de cilantro fresco, hojas solo, picadas", "sal marina y pimienta negra recién molida"], "method": ["Para el risotto de lima, caliente 80g / 2¾oz de la mantequilla en una sartén mediana sobre una capa baja. Agregue la cebolla y cocine suavemente durante 3-4 minutos, revolviendo ocasionalmente, hasta que esté ligeramente dorado. Agregue el arroz y baje el fuego a muy bajo. Mezcle con una cuchara de madera hasta que el arroz esté bien cubierto con la mantequilla y la cebolla.", "Agregue el caldo, poco a poco, revolviendo continuamente hasta que el líquido se absorba, y luego agregue más caldo. Continúe agregando caldo, revolviendo y luego continúe agregando más caldo hasta que el arroz tenga una textura hermosa y cremosa. Asegúrese de que el risotto no se adhiera al fondo de la sartén.", "En el último minuto, mezcle los segmentos de lima picado, la ralladura de lima, el parmesano y el resto de la mantequilla. Si el risotto es demasiado espeso, agregue algunas cucharadas más de caldo para aflojarlo, luego sazone con sal y pimienta. Servir inmediatamente.", "Para los mejillones marineros con hierba de limón y chile, retire y deseche las barbas de los mejillones y lávelas en un recipiente con agua fría, frotando para eliminar todo rastro de arena. Descarta cualquiera que flote, cualquiera que esté roto o alguno abierto que no se cierre cuando se golpee.", "Caliente el aceite y la mantequilla en una cacerola grande a fuego lento. Cuando la mantequilla comience a formar espuma, agregue el jengibre, el chile y la hierba de limón y cocínelos durante dos minutos. Agregue los mejillones y la leche de coco y cubra con una tapa. Cocine por cuatro minutos o hasta que los mejillones se abran. Deseche cualquier que permanezca cerrado.", "Retirar del fuego y agregar la crema batida y el cilantro y sazonar con sal y pimienta.", "Sirva inmediatamente, en un tazón grande colocado en el medio de la mesa para que todos lo compartan con el risotto de lima al costado."], "url": "www_bbc_co_uk_food_recipes_moules_marinire_with_96585", "title": "Mejillones con hierba de limón y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "¼ de pimiento rojo, cortado en cubitos", "¼ cucharadita de copos de chile", "1 tomate, cortado en cubitos", "½ calabacín, cortado en cubitos", "2 cucharadas de vino blanco", "8 mejillones con cáscara, barba removida (deseche cualquier mejillón que no se cierre herméticamente al golpearlo en la superficie de trabajo)", "1 ramita de perifollo"], "method": ["Caliente la mantequilla y el aceite en una sartén.", "Sudor la cebolla hasta que esté suave pero no coloreada. Agregue el ajo y cocine por un minuto.", "Agregue el pimiento rojo, el chile, el tomate, el calabacín y el vino y cocine a fuego lento hasta que el vino se haya reducido a una cucharada.", "Agregue los mejillones, cubra la sartén y cocine a fuego lento durante cinco minutos o hasta que las conchas se hayan abierto. Deseche los mejillones que no se abren durante la cocción.", "Servir en un bol y decorar con una ramita de perifollo."], "url": "www_bbc_co_uk_food_recipes_moulesmarinere_86817", "title": "Mejillones Marinara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, finamente picada", "2 dientes de ajo, aplastados", "100ml / 3½fl oz de vino blanco", "Mejillones de 300 g / 10½ oz, limpios, barbas quitadas", "1 azafrán pizca grande", "3 cucharadas de perejil fresco picado", "100ml / 3½ fl oz crema doble", "pan blanco crujiente", "1 limón, cortado en cuñas"], "method": ["Caliente el aceite y la mantequilla en una sartén y fría la cebolla y el ajo por 2-3 minutos. Agregue el vino blanco y cocine a fuego lento. Agregue los mejillones, cúbralos con una tapa hermética y deje hervir durante 5-7 minutos, o hasta que los mejillones se hayan abierto. Deseche cualquier mejillón que no se haya abierto. Agregue el azafrán y el perejil y mezcle bien. Retire la mitad de los mejillones y los jugos en un tazón de servir, y en la mitad restante revuelva la crema, calentando hasta que hierva.", "Sirva los dos cuencos de mejillones con pan crujiente en el lado y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_moulesmarinieretwowa_88616", "title": "Mejillones marinière, dos formas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones 1.75kg / 4lb", "1 diente de ajo, finamente picado", "2 chalotes, finamente picados", "15g / ½ oz de mantequilla", "un bouquet garni de perejil, tomillo y hojas de laurel", "100 ml / 3½ fl oz de vino blanco seco o sidra", "120ml / 4fl oz de crema doble", "puñado de hojas de perejil, picado grueso", "pan crujiente, para servir"], "method": ["Lave los mejillones con abundante agua fría y corriente. Deseche cualquier abierto que no se cierre cuando se aprieta ligeramente.", "Saque las barbas duras y fibrosas que sobresalen entre las conchas bien cerradas y luego corte los percebes con un cuchillo grande. Dar a los mejillones otro enjuague rápido para eliminar cualquier pequeño trozo de concha.", "Suavice el ajo y los chalotes en la mantequilla con el bouquet garni, en una sartén grande lo suficientemente grande como para tomar todos los mejillones, solo debe estar medio lleno.", "Agregue los mejillones y el vino o la sidra, suba el fuego, cubra y cocínelos al vapor en sus propios jugos por 3-4 minutos. Dale a la sartén un buen batido de vez en cuando.", "Retire el bouquet garni, agregue la crema y el perejil picado y retire del fuego.", "Coloque la cuchara en cuatro tazones grandes y calientes y sírvalos con un montón de pan crujiente."], "url": "www_bbc_co_uk_food_recipes_moulesmarinierewithc_71787", "title": "Moules marinière con crema, ajo y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moulesmarinierewithc_71787_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 3oz de mejillones frescos en vivo", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo picados", "150ml / 5¼fl oz de vino blanco", "2 ramitas de tomillo", "150ml / 5¼fl oz de crema doble", "perejil pequeño de hojaldre, picado", "pan crujiente, para servir"], "method": ["Limpie los mejillones frotándolos a fondo con abundante agua corriente, retirando las \"barbas\", los hilos fibrosos similares a las algas marinas. Deseche los mejillones rotos junto con las \"barbas\" y cualquier mejillón que no se cierre herméticamente cuando los toque.", "Caliente el aceite de oliva en una sartén con una tapa hermética. Agregue las cebollas y el ajo y cocine a fuego medio hasta que estén suaves, pero no coloreados.", "Agregue el vino y suba a fuego alto. Cuando el vino comience a hervir, agregue los mejillones y el tomillo limpios a la sartén. Baja el fuego a bajo", "Coloque la tapa en la sartén y deje que los mejillones hiervan. Cocine durante aproximadamente 4-5 minutos, levantando la tapa de vez en cuando para comprobar: sabrá que están cocidos cuando se hayan abierto los caparazones. Deseche cualquier mejillón que permanezca cerrado.", "Agregue la crema doble y cocine por un minuto más.", "Esparce el perejil picado y sirve directamente con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_moulesmarinierewithc_85254", "title": "Mejillones Marinière con pan crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 17½oz de harina blanca fuerte", "1 cucharadita de sal", "7 g / 1/4 oz de sachet levadura seca de acción rápida", "350ml / 12fl oz de agua tibia", "aceite de girasol, para engrasar", "Mejillones frescos de 2kg / 4.4lb en sus conchas, barbas eliminadas", "2 cebollas medianas, picadas", "2 dientes de ajo, aplastados", "pequeño puñado de tallos de perejil fresco", "2 ramitas de tomillo fresco", "sal y pimienta negra recién molida", "300ml / ½ pinta de vino blanco seco", "3 cucharadas de perejil fresco picado", "4 cucharadas de crema individual (opcional)", "25g / 1oz de mantequilla, ablandada", "1 harina de cucharadita colmada"], "method": ["Para los panecillos, precaliente el horno a 190C / 375F / Gas Mark 5.", "Coloque la harina en un tazón grande, luego mezcle la sal y la levadura.", "Haga un pozo en el medio de la mezcla y vierta suficiente agua para hacer una masa suave y bastante pegajosa.", "Amasar la masa sobre una superficie ligeramente enharinada hasta que quede suave y elástica. Forme la masa en una ronda y colóquela en un tazón grande y ligeramente engrasado. Cubra con película adhesiva engrasada y deje que se levante en un lugar cálido durante 1-1½ horas, o hasta que duplique su tamaño.", "Engrase ligeramente dos o tres bandejas para hornear. Divide la masa en 18 piezas. Forme rondas doblando los lados a los medios para formar bolas redondas. Arregle las bandejas, dejando espacio entre cada bola para la expansión (deben duplicar su tamaño).", "Cúbralo sin apretar con una película adhesiva engrasada y deje que se levante en un lugar cálido durante 20 minutos o hasta que duplique su tamaño.", "Coloque en el horno para hornear durante 20 minutos, o hasta que estén dorados y cocidos.", "Retire del horno y deje enfriar en una rejilla de alambre. Sirve con los mejillones mariniere.", "Para los mejillones mariniere, limpie los mejillones frotándolos bien bajo un grifo abierto, quitando cualquier barba (trozos pequeños), percebes y arenilla. Toque cualquier mejillón que esté ligeramente abierto; si no se cierran, deséchelos junto con los mejillones con caparazones rotos. Enjuague nuevamente con agua corriente antes de cocinar.", "Calentar una sartén, lo suficientemente grande como para contener los mejillones. Agregue la cebolla, ajo, tallos de perejil, tomillo, vino y un poco de sal y pimienta negra recién molida. Llevar a ebullición, cubrir bien con una tapa y reducir el fuego a fuego lento durante 10 minutos, hasta que la cebolla esté tierna.", "Retire la tapa, vuelva a hervir y agregue los mejillones. Vuelva a colocar la tapa y cocine a fuego alto durante aproximadamente 4-5 minutos, agitando la sartén de vez en cuando, hasta que se hayan abierto todos los mejillones. Deseche cualquier que no se haya abierto.", "Retire los mejillones de la sartén con una espumadera y colóquelos en un tazón grande calentado o en una sopera. Cubra con la tapa de la sartén y manténgalo caliente.", "Retire los tallos de tomillo y perejil de la salsa.", "Para la beurre manié, machaque la mantequilla y la harina juntas, en un tazón limpio.", "Llevar el mejillón líquido a ebullición y batir la mantequilla y la mezcla de harina a fuego alto hasta que la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la mayor parte del perejil y un poco de crema. Vierta la salsa sobre los mejillones y esparza sobre el perejil restante.", "Sirva de inmediato y recuerde tener cuencos adicionales para recoger las conchas desechadas."], "url": "www_bbc_co_uk_food_recipes_moulesmarinierewithd_83482", "title": "Mejillones con panecillos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas, cortadas en rodajas de 1cm / ½", "1 cucharada de sal marina fina", "750g / 1lb 10½oz de carne de cordero", "1 cebolla, finamente picada", "2 dientes de ajo, aplastados", "1 cucharadita de orégano seco", "1½ cucharadita de menta seca", "2 hojas de laurel", "1 ramita de canela", "1 cucharada de harina normal", "½ cucharadita de sal marina en copos, más extra para condimentar", "200ml / 7fl oz de vino tinto", "1 x 400 g / 14 oz pueden cortar tomates", "2 cucharadas de puré de tomate", "7 cucharadas de aceite de oliva", "500g / 1lb 2oz de patatas Maris Piper, peladas, cortadas en rodajas de 1cm / ½ en rodajas", "sal marina y pimienta negra recién molida", "50g / 2oz de mantequilla", "Harina normal de 50g / 2oz", "Leche 400ml / 14fl oz", "1 cucharadita de nuez moscada rallada finamente", "25g / 1oz de parmesano finamente rallado", "1 huevo de gallinas camperas, golpeado"], "method": ["Coloque las piezas de berenjena en un colador y espolvoree sal. Dejar de lado por 10 minutos.", "Coloque el cordero, las cebollas, el ajo, el orégano, la menta, las hojas de laurel y la canela en una sartén grande de base pesada y cocine a fuego medio durante 10 minutos, revolviendo con una cuchara de madera para romper la carne.", "Agregue la harina, la sal y un montón de pimienta negra recién molida. Agregue el vino, los tomates, el puré de tomate y cocine a fuego lento. Cocine por 30 minutos, revolviendo ocasionalmente hasta que el cordero esté tierno y la salsa se haya espesado. Sazonar con sal y pimienta negra recién molida al gusto. Dejar de lado.", "Enjuague las piezas de berenjena con agua fría y seque con una toalla de té limpia. Calentar tres cucharadas de aceite en una sartén de base pesada y freír las berenjenas durante 2-3 minutos por cada lado, agregando más aceite cuando sea necesario. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Cocine las papas en agua hirviendo durante cinco minutos, luego drene en un colador bajo agua corriente hasta que estén frías.", "Precalentar el horno a 180 ° C / 160 ° C (ventilador) / Gas 4.", "Para la salsa blanca, derrita la mantequilla en una cacerola grande y agregue la harina. Cocine por unos segundos, luego mezcle gradualmente la leche. Agregue la mitad del parmesano y la nuez moscada rallada. Cocine a fuego lento la salsa suavemente durante 4-5 minutos, revolviendo regularmente. Sazone al gusto con sal y pimienta negra recién molida.", "Retire la cacerola del fuego y revuelva rápidamente el huevo batido. Cubra la superficie de la salsa con film transparente para evitar que se forme la piel.", "Coloque un tercio de la salsa de carne en un plato grande y poco hondo para horno. Cubra con una capa de patatas y una capa de berenjenas. Repita las capas dos veces más, terminando con las berenjenas. Vierta sobre la salsa blanca, asegurándose de que cubra en una capa gruesa y uniforme. Espolvoree con el parmesano restante. Hornee en el horno durante 45 minutos, o hasta que estén dorados y burbujeantes."], "url": "www_bbc_co_uk_food_recipes_moussaka_01004", "title": "Musaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moussaka_01004_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75ml / 6fl oz de aceite de oliva", "1 cebolla grande, finamente picada", "675g / 1½lb de carne picada de cordero", "3 dientes de ajo picados", "1.25ml / ¼tsp de canela", "1.25ml / ¼tsp de pimienta de Jamaica", "2 x 400 g / 14 oz de estaño de tomates picados", "1 cucharada de orégano fresco, picado", "2 hojas de laurel", "1 cucharadita de hojas frescas y suaves de tomillo", "175ml / 6fl oz de vino blanco", "4 berenjenas medianas, cortadas en rodajas de 1cm / ½", "Sal y pimienta negra recién molida", "Harina simple, para quitar el polvo", "85g / 3oz de mantequilla sin sal", "Harina normal de 85g / 3oz", "Leche de 900 ml / 1½pt", "85g / 3oz de queso parmesano, rallado", "115 g / 4oz gruyère, rallado", "2 yemas de huevo de gallinas camperas", "1 huevo de gallinas camperas"], "method": ["Caliente 2 cucharadas de aceite de oliva en una cazuela grande. Agregue la cebolla y cocine suavemente durante 10 minutos o hasta que la cebolla esté suave, pero no coloreada. Dore la mitad del cordero en una sartén y agrégalo a la cebolla. Agregue el ajo y divida la carne con un tenedor de madera hasta que tenga una textura suelta. Brown el cordero restante.", "Mezcle la canela, la pimienta de Jamaica, los tomates picados, el orégano, las hojas de laurel y el tomillo en la cazuela. Agregue el resto del cordero dorado y glasee la sartén con vino blanco. Vierta directamente en la fuente de la cazuela, reduzca el fuego y cocine a fuego lento durante aproximadamente 1 hora.", "Coloque las berenjenas en un colador, espolvoree con sal y déjelas durante 30 minutos. Esto saca cualquier jugo amargo.", "Mientras tanto, prepara la salsa bechamel. Derrita la mantequilla en una sartén antiadherente y agregue la harina. Quite el fuego y gradualmente agregue la leche. Regrese la sartén al fuego y revuelva continuamente hasta que la salsa se espese. Cocine a fuego lento durante 5 a 8 minutos. Retire del fuego, mezcle 55 g / 2 oz del queso parmesano y 55 g / 2 oz del queso gruyère y sazone con sal y pimienta.", "Enjuague las berenjenas y seque. Espolvorear las berenjenas con harina y freír en lotes en el aceite de oliva restante hasta que estén doradas por ambos lados, aproximadamente 8 - 10 minutos. Escurrir sobre papel de cocina. Dejar de lado hasta que esté listo para construir el moussaka.", "La salsa blanca debería haberse enfriado lo suficiente como para batir el huevo y las yemas de huevo.", "Cubra la base de un plato resistente al horno (30 x 20 cm / 12 x 8 pulgadas) con un tercio de la carne picada y luego cubra con la mitad de las rodajas de berenjena. Repita las capas, terminando en la última picada, luego vierta sobre la salsa de queso. Espolvorea sobre el parmesano y gruyère restantes. Hornee en un horno precalentado a 180 ° C / 350 ° F / Gas 4 durante 50 a 60 minutos, hasta que burbujee y se dore. Deje que la moussaka se asiente durante 5 minutos antes de cortar en cuadrados y servir.", "Sirva la moussaka con ensalada de tomate, pepino, perejil y menta, y pan crujiente."], "url": "www_bbc_co_uk_food_recipes_moussaka_6812", "title": "Musaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moussaka_6812_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150-175ml / 5-6fl oz de aceite de oliva", "1 cebolla grande, finamente picada", "3 dientes de ajo, aplastados", "900 g / 2lb de carne picada de cordero", "50 ml / 2 onzas de vino blanco (una salpicadura generosa)", "1 x 400 g de tomate picado", "1 x 5cm / 2in pieza de canela en rama", "puñado de hojas frescas de orégano, preferiblemente orégano griego silvestre, picado", "3 berenjenas grandes", "sal y pimienta negra recién molida", "75g / 3oz de mantequilla", "Harina normal de 75g / 3oz", "600 ml / 1 litro de leche", "50g / 2oz de queso parmesano, finamente rallado", "2 huevos medianos de granja, golpeados"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la salsa de cordero, caliente dos cucharaditas de aceite en una sartén. Agregue las cebollas y el ajo y fría hasta que empiece a dorarse. Agregue el cordero picado y fría a fuego alto durante 3-4 minutos. Agregue el vino, los tomates, la canela y el orégano y cocine a fuego lento durante 30-40 minutos mientras hace todo lo demás.", "Cortar los tallos de las berenjenas y cortarlos longitudinalmente en rodajas de 5 mm / ¼. Calentar una sartén hasta que esté caliente, agregar una cucharada de aceite y una capa de rodajas de berenjena y freír rápidamente hasta que estén tiernos y ligeramente coloreados en cada lado. Levante con tenazas (¡cada cocina debe tener algo!), Cubra la base de un plato refractario de 2.5-2.75 litros / 4 ½-5 pulgadas de superficie y sazone ligeramente con un poco de sal y pimienta. Repita con el resto del aceite y las berenjenas y condimente cada capa sobre la marcha.", "Para el aderezo, derrita la mantequilla en una sartén antiadherente, agregue la harina y cocine a fuego medio durante un minuto para cocinar la harina. Poco a poco batir en la leche, llevar a ebullición, revolviendo, y dejar hervir a fuego lento muy suavemente durante 10 minutos, revolviéndolo de vez en cuando. Agregue el queso y un poco de sal y pimienta al gusto. Enfriar ligeramente y luego batir en los huevos.", "Retire la ramita de canela de la salsa de cordero, sazone al gusto con un poco de sal y pimienta y póngalo sobre la parte superior de las berenjenas. Verter sobre la cobertura y hornear durante 25-30 minutos hasta que la parte superior esté dorada y burbujeante."], "url": "www_bbc_co_uk_food_recipes_moussaka_70308", "title": "Musaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moussaka_70308_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 berenjenas", "aceite de oliva", "1 cebolla picada", "2 dientes de ajo, aplastados", "450 g / 1 lb de cordero picado", "3 tomates de ciruela, cortados en cubitos", "pizca de canela en polvo", "pizca de comino en polvo", "1 vaso de vino tinto", "150ml / 5fl oz de caldo de pollo", "200 ml / 7 fl oz de salsa blanca", "2 huevos", "pizca de nuez moscada", "100g / 4oz de queso rallado (mitad mozzarella, mitad Cheddar)", "2 cucharadas de menta fresca picada", "sal", "pimienta negra recién molida"], "method": ["Precalentar el horno a 190C / 375F / Gas5.", "Cortar las berenjenas y luego freírlas en ambos lados en una sartén grande con un poco de aceite de oliva. Escurrir sobre papel de cocina. Para ahorrar en lavar, use la misma sartén con un poco más de aceite de oliva y fría la cebolla y el ajo.", "Después de cinco minutos, suba el fuego y agregue el cordero para dorarlo, luego agregue los tomates. Agregue una buena pizca de comino y canela con el vino y saltee para romper los tomates. Agregue la menta picada y el caldo por etapas.", "En un plato a prueba de horno, capas las berenjenas y carne de cordero en algunas capas, terminando con una capa de berenjenas.", "Combine la salsa blanca con los huevos, la nuez moscada y el condimento. Cuchara sobre la carne picada y luego espolvorea con el queso rallado.", "Hornee en el horno de 20 a 25 minutos para colorear el queso y cocinarlo.", "Servir."], "url": "www_bbc_co_uk_food_recipes_moussaka_71985", "title": "Quick moussaka", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "4 berenjenas en rodajas", "1 cebolla grande, picada", "2 dientes de ajo, aplastados", "600g / 1lb 5oz cordero picado", "1 x 400 g de tomate picado", "1 cucharadita de comino molido", "1 cucharadita de canela molida", "1 cucharadita de orégano fresco", "150ml / 5fl oz de vino tinto", "2 cucharadas de menta fresca picada", "120ml / 4fl oz de caldo de cordero", "25 g / 1oz de mantequilla sin sal", "Harina normal de 25g / 1oz", "200ml / 7fl oz de leche, calentada a punto de ebullición", "2 huevos de gallinas camperas, golpeados", "pizca de nuez moscada recién rallada", "Queso cheddar de 75 g / 2½ oz, rallado", "Mozzarella de 75 g / 2½ oz, rallado", "sal y pimienta negra recién molida", "4 calabacines pequeños, cortados en cintas con un pelador", "4 cucharadas de aceite de oliva", "1 limón, solo jugo", "2 cucharadas de menta fresca"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Calentar una sartén a fuego medio. Cuando esté caliente, agregue 4 cucharadas de aceite de oliva y las berenjenas. Freír durante 2-3 minutos, luego reservar en un plato forrado con papel de cocina.", "En una sartén por separado, caliente el aceite restante. Una vez caliente, agregue la cebolla y el ajo y fría por otros 2-3 minutos, o hasta que las cebollas se hayan suavizado. Agregue el cordero picado y cocine durante 4-5 minutos, hasta que se dore. Agregue los tomates, el comino, la canela, el orégano y el vino tinto. Cocine por 2-3 minutos, rompiendo los tomates con una cuchara de madera mientras cocinan. Agregue la menta y el caldo. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque la salsa de carne y la berenjena en un plato para hornear grande como lo haría si estuviera haciendo lasaña.", "Coloque la mantequilla en una sartén a fuego medio. Cuando se derrita, agregue la harina y cocine, revolviendo bien, por un minuto. Agregue la leche caliente y cocine, revolviendo constantemente, durante 2-3 minutos, hasta que la mezcla se espese. Agregue los huevos y la nuez moscada, sazone con sal y pimienta negra recién molida. Agregue la mitad del queso cheddar rallado y la mozzarella y continúe cocinando, revolviendo, hasta que se combinen y suavice.", "Coloque la salsa de queso sobre la parte superior del cordero y la berenjena, luego espolvoree con el queso cheddar y la mozzarella restantes.", "Hornee durante 20-25 minutos, hasta que el relleno de queso esté dorado y burbujeante.", "Para los calabacines, caliente una sartén. Mezcle las tiras de calabacín en aceite para cubrir y cocinar durante 1-2 minutos o hasta que estén carbonizadas. Coloque en un tazón y mezcle con el jugo de limón y la menta fresca.", "Sirva la moussaka en rodajas con los calabacines al lado."], "url": "www_bbc_co_uk_food_recipes_moussaka_with_griddled_06891", "title": "Moussaka con calabacines a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]