[{"isVegetarian": true, "title": "Pisco sour", "url": "www_bbc_co_uk_food_recipes_piscosour_85134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/1¾fl oz pisco (grape brandy)", "50ml/1¾fl oz lime juice", "25ml/1fl oz sugar syrup", "1 dash bitters", "½ free-range egg white", "1 cherry, stem attached", "1 lemon slice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients except the cherry and lemon slice into a cocktail shaker and shake.", "Strain into a rocks glass and garnish with a fresh cherry on the stem and a lemon slice."]}, {"isVegetarian": false, "title": "Pisellini al prosciutto (spring peas with ham)", "url": "www_bbc_co_uk_food_recipes_pisellinialprosciutt_10820", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz spring peas (petit pois)", "1½oz of butter or oil", "½ medium onion, chopped", "200g/7oz of prosciutto ham or pancetta, diced small", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan and add the chopped onion and prosciutto or pancetta.", "sauté for a few minutes until the onion turns golden and the ham is brown but not crisp.", "Add the peas, still frozen, and a little water. Stir.", "Cover and simmer gently until the peas are tender, about 15 minutes. Season to taste and serve."]}, {"isVegetarian": false, "title": "Pissaladière tart with anchovy tapenade and roasted cannon of lamb with rosemary and garlic", "url": "www_bbc_co_uk_food_recipes_pissaladire_tart_with_56780", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-rolled puff pastry", "25g/1oz unsalted butter", "1 onion, thinly sliced", "6 salted anchovy fillets, bones removed, halved and washed", "150g/5½oz pitted black olives", "6 tbsp olive oil", "1 lemon, juice only", "2 tbsp olive oil", "50g/1¾oz unsalted butter", "1 cannon of lamb, trimmed", "1 large sprig fresh rosemary", "2 garlic cloves, peeled and smashed", "150ml/5fl oz port", "300ml/10fl oz beef stock", "2 tbsp olive oil", "100g/3½oz black olives, chopped", "1 tomato, chopped", "2 tbsp fresh parsley, chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the pissaladière tart, cut out two 10cm/4in circles from the puff pastry and place on a baking tray. Dot the circles with the tip of a sharp knife. ", "Heat the butter in a frying pan and fry the onions for 10 minutes until crisp.", "Put 6 of the anchovy halves and black olives in a small food processor and blend until smooth. Gradually add the olive oil and lemon juice then season with salt and pepper. Spread the paste over the pastry and top with the fried onions. Lay the remaining anchovies in a criss-cross pattern over the top of each tart. Bake for 15–20 minutes, or until the pastry is crisp and golden-brown. Keep warm until ready to serve.", "For the lamb, reduce the oven temperature to 180C/160C Fan/Gas 4. ", "Heat an ovenproof frying pan and add the oil and butter. Once hot, add the lamb, rosemary and garlic. Fry until the lamb is coloured on all sides. Transfer to the oven for 6–8 minutes or until cooked to your liking, then remove from the oven and set aside to rest. Keep the pan to make the port reduction.", "For the port reduction, heat the pan used for the lamb and add the port. Cook until the volume of liquid is reduced by half. Add the stock and reduce again by half. Finish with the olive oil, olives, chopped tomatoes and parsley. Season with salt and pepper.", "To serve, carve the lamb into slices. Place a tart on each serving plate and top with the sliced lamb and port reduction."]}, {"isVegetarian": false, "title": "Pissaladière with olives and anchovies", "url": "www_bbc_co_uk_food_recipes_pissaladire_with_olives_81173", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "1 tsp salt", "5g instant yeast", "1 tbsp honey", "50ml/2fl oz olive oil", "125ml/4fl oz warm water", "2 tbsp olive oil", "knob of butter", "1.25kg/2 lb 12 oz onions, thinly sliced", "few thyme leaves (optional)", "2 100g/4oz jars anchovies", "1 small jar black pitted olives, drained "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, put the flour in a bowl and stir in the salt. Add the yeast. Mix the honey with the oil and water, then pour this over the flour. ", "Mix until you have a sticky dough, then turn out the dough and knead until soft and passes the windowpane test (stretch a small piece out until you can see through it – gluten is developed enough if it allows you do this). Return to the bowl and cover with a damp tea towel. Leave to double in size – at least an hour.", "Meanwhile make the topping. Heat the olive oil and butter in a very large frying pan. When the butter has melted and is foaming, add the onions and thyme leaves (if using). Season with salt. Stir carefully until they reduce in volume – there will seem almost too much for the pan to start with, but they will collapse quite quickly. Continue to cook on a low to medium heat for at least 45 minutes to an hour, stirring regularly. The onions will lightly caramelise on the base – scrape this up regularly when you stir. ", "Eventually you will have very soft, almost puréed, golden brown onions. You can instead cover the pan and let the onions sweat for a similar amount of time – they will collapse in a similar way but be lighter in colour.", "Preheat the oven to 230C/210C Fan/Gas 8.", "Knock the dough back and shape to fill a large baking tray – around 40x20cm/16x8in. Spread the onions over the dough, leaving a narrow border, then add the anchovies in a lattice pattern – or more free-form if you prefer (I often do a small amount without as there’s always someone who doesn’t like anchovies!). Add the olives at intervals. Drizzle with a little more olive oil, if you like. Bake in the preheated oven for around 20-25 minutes, or until the dough is cooked through.", "Cool, cut into slices and serve."]}, {"isVegetarian": true, "title": "Reduced-sugar carrot cake", "url": "www_bbc_co_uk_food_recipes_sugar-free_carrot_cake_71797", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sugar-free_carrot_cake_71797_16x9.jpg", "ingredients": ["200ml/7fl oz vegetable oil", "3 free-range eggs", "175ml/6fl oz agave syrup (also known as agave nectar)", "400g/14oz carrots, peeled and grated", "275g/9¾oz self-raising flour", "2 tsp baking powder", "1 tsp ground cinnamon", "1 tsp mixed spice", "150g/5½oz sultanas", "150g/5½oz walnuts pieces", "1 orange, finely grated zest only", "400g/14oz full-fat cream cheese", "50g/1¾oz unsalted butter, softened", "50ml/2fl oz maple syrup", "25g/1oz walnut pieces, chopped", "ground cinnamon, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Oil and line 2 x 20cm/8in sandwich tins.", "Pour the oil into a large mixing bowl with the eggs and agave syrup and beat together. Add the carrots and mix together. ", "In a separate bowl, sieve the flour, baking powder, cinnamon and mixed spice together. Add the sultanas, walnuts and orange zest and stir to coat in the flour.  ", "Tip the flour mixture into the carrot mixture and stir together gently, until well combined. Divide the mixture between the tins and bake for 40 minutes. Cover with aluminium foil after 20-30 minutes to prevent the tops from burning. ", "Leave to cool in the tins for 5 minutes, then transfer to a wire rack and leave to cool completely. ", "For the frosting, place the cream cheese in a piece of clean muslin or thin cleaning cloth (such as a J Cloth) and squeeze out any liquid.  (This removes the moisture from the cheese so that the frosting isn’t too wet). Place the cream cheese in a bowl and beat until smooth. Add the butter and maple syrup and beat together. Refrigerate until needed. ", "Sandwich the sponges together with half of the frosting. Spread a very thin layer of frosting over the top of the cake and spoon the remaining frosting into a piping bag fitted with a 1cm/½in plain nozzle. Sprinkle the chopped walnuts over the top of the frosting. ", "Pipe small kisses of frosting around the edge of the cake and dust with cinnamon."]}, {"isVegetarian": false, "title": "Suffolk pork chops with cider and caramelised apples", "url": "www_bbc_co_uk_food_recipes_suffolkporkchopswith_91979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz pork chops ", "4 tsp sea salt flakes", "2 tbsp olive oil", "2 onions, peeled, finely chopped", "150g/5oz smoked bacon, chopped", "1 bouquet garni (celery, parsley, bay leaves and thyme)", "300g/10½oz button mushrooms", "300g/10½oz shallots, peeled, cooked for ten minutes, then drained and refreshed in cold water", "4 Cox's apples, peeled, cores removed, quartered", "4 tbsp muscovado sugar", "500ml/17½fl oz Suffolk cider", "4 tsp Suffolk mustard", "400ml/14fl oz double cream", "cooked carrots, to serve", "mashed potatoes, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll the fat sides of the pork chops in the salt flakes.", "Heat a griddle pan until smoking. Sear the fat side of the pork chops in the pan for 1-2 minutes, using tongs to keep the pork chops upright in the pan. When the fat is golden-brown and crisp, lay the pork chops down flat and fry for 3-4 minutes on both sides, or until the pork chop has deep griddle marks all over. Set aside.", "Meanwhile, heat the olive oil in a large frying pan and fry the onion and bacon together for 4-5 minutes, or until the onion is starting to colour. Add the bouquet garni, button mushrooms and shallots to the pan and cook over a medium-low heat for 3-4 minutes. ", "Pour the cider into the pan and deglaze by scraping up any browned bits from the bottom of the pan with a wooden spoon, then bring to the boil. Add the pork chops and cook for 10-15 minutes, or until the pork is cooked through (the juices should run clear when the pork is pierced at the thickest part).", "Meanwhile, dust the apple pieces with the muscovado sugar. Place the griddle pan used to cook the pork back over the heat, then add the apples and cook for 8-10 minutes, or until the apples are golden-brown and caramelised.", "Remove the pork chops from the pan and set aside to rest. Return the pan to the heat and bring to a rapid boil, then stir in the mustard and cream and cook for 4-5 minutes, or until the liquid has reduced to a sauce consistency.", "To serve, spoon the caramelised apples onto serving plates and arrange a pork chop next to the apples, with the cooked carrots and mashed potatoes alongside. Spoon over the sauce and serve."]}, {"isVegetarian": true, "title": "Sugar-free chocolate brownies", "url": "www_bbc_co_uk_food_recipes_sugar-free_chocolate_90899", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sugar-free_chocolate_90899_16x9.jpg", "ingredients": ["oil, for greasing", "200g/7oz self-raising flour", "50g/1¾oz cocoa powder, sifted", "1 tsp bicarbonate of soda", "100g/3½oz butter, cubed", "100ml/3½fl oz semi-skimmed milk", "3 large free-range eggs, beaten", "250g/9oz sweet potato, finely grated", "1 large very ripe banana (approximately125g/4½oz peeled weight), mashed with a fork"], "serves": "Makes 16 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease and line the base and sides of a 23cm/9in loose-based square cake tin with baking parchment. ", "Mix the flour, cocoa and bicarbonate of soda in a large bowl. Make a well in the centre.", "Put the butter in a medium saucepan and melt over a low heat, stirring regularly. Take the pan off the heat and stir the milk into the melted butter. Add the eggs, sweet potato and banana, stirring vigorously. ", "Pour slowly into the flour mixture, stirring constantly with a wooden spoon to form a thick batter. Pour into the prepared tin. ", "Bake in the centre of the oven for 30-35 minutes, or until the cake is risen and just firm to the touch. ", "Serve warm or leave to cool in the tin before cutting into squares. "]}, {"isVegetarian": true, "title": "Sugar-free chocolate and hazelnut spread", "url": "www_bbc_co_uk_food_recipes_sugar-free_chocolate_and_54033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz whole blanched hazelnuts", "10g unsweetened 100% pure cacao (from a block)"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the hazelnuts in a food processor – a small one is best for this job – and blitz with the metal blade for 8-10 minutes, or until the nuts first turn to a powder and then a glossy paste. Stop the machine and push the nuts down every 3-4 minutes until the correct consistency is reached. The hazelnut paste should look like a runny peanut butter.", "Scrape the hazelnut paste into a small saucepan. Finely grate the cacao from the block onto a board. It’s easier to grate and then weigh the cacao rather than cut it off the block at the beginning.", "Tip the grated cacao into the pan with the nut paste and warm through very gently for just a few seconds, stirring constantly until the cacao melts. Transfer to a small bowl and serve. ", "Put the spread in a lidded jar or container. The spread will keep in the fridge, covered, for three days."]}, {"isVegetarian": false, "title": "Sugar plum fairy cakes", "url": "www_bbc_co_uk_food_recipes_sugar_plum_fairy_cakes_92523", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz caster sugar", "2 large free-range eggs", "20g/½oz unsalted butter", "60g/2¼oz self-raising flour", "1 tsp mixed spice", "3 plums, halved, pitted and chopped", "orange liqueur, such as Grand Marnier", "150g/5½oz plain chocolate ", "1 large free-range egg white", "60g/2¼oz caster sugar", "80g/2¾oz slightly salted butter, softened", "1 tsp orange liqueur, such as Grand Marnier", "½ tsp orange extract ", "edible gold glitter"], "serves": "Makes 12 fairy cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the génoise fairy cakes, line a mini-muffin tray with 12 fairy cake cases and preheat the oven to 170C/150C(fan)/Gas 5.", "Warm the bowl of a free-standing mixer by pouring in some boiling water and drying it with a tea towel.", "Place the sugar and eggs in the warmed bowl and whisk at full speed for several minutes, or until the mixture is pale and doubled in volume. ", "While the mixture is whisking, melt the butter in a small saucepan.  Sift the flour and mixed spice into a bowl.", "Carefully add the melted butter around the edge of the mixture while still whisking.", "Remove the bowl from the mixer and place on a tea towel, then sift and gently fold in the flour and mixed spice in two batches. ", "Transfer the mixture to a piping bag and carefully pipe into the cake cases.   Bake for 10-12 minutes, or until golden-brown and springy to the touch.", "Remove the cakes from the tins and cool on a wire rack. Peel the paper cases off the cakes when cooled. ", "For the plums, marinade the chopped plums in the orange liqueur in a small bowl. Set aside.", "For the edible fairy cake cases, melt the chocolate in a heatproof bowl placed over a pan of simmering water. Set 12 more fairy cake cases in the mini-muffin tins.", "Once melted, paint the chocolate inside the fairy cake cases and press the cooled genoise fairy cakes into each one, so the chocolate lines and coats the side of the cakes. Leave to set completely, then remove from the tins and remove the papers from the chocolate-lined cakes.", "For the French meringue buttercream, combine the egg white and sugar in a medium-sized heatproof bowl set over a pan of barely simmering water. ", "Beat continuously with an electric hand-held whisk until the mixture is thick and glossy and all the sugar has dissolved. ", "Remove from the heat and continue to whisk until the mixture has cooled and is thick enough to hold its shape. ", "Beat the butter to a soft consistency and start adding small lumps of it to the meringue, a little at a time, whisking well after each addition. ", "Beat in the orange liqueur, orange extract and zest. Transfer the meringue buttercream to a piping bag fitted with a round nozzle and pipe it onto the cupcakes. ", "Drain the plums of their liqueur and carefully top each fairy cake with a plum piece and a sprinkling of edible gold glitter."]}, {"isVegetarian": true, "title": "Sultana scones with strawberry jam and clotted cream", "url": "www_bbc_co_uk_food_recipes_sultana_scones_with_98294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz jam sugar", "500g/1lb 2oz strawberries, hulled and cut in half only if large", "½ lemon, juice only", "450g/1lb strong white flour, plus extra for dusting", "5 tsp baking powder", "pinch salt", "75g/3oz unsalted butter, plus extra for greasing", "75g/3oz caster sugar", "150g/5oz sultanas", "2 free-range eggs, lightly beaten, plus 2 eggs for glazing", "250ml/9fl oz milk", "400g/14oz clotted cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, heat the sugar, strawberries and lemon juice in a large saucepan over a medium heat until the sugar has melted.", "Bring the mixture to the boil and cook for 3-4 minutes (or up to 10 minutes if you prefer a thicker style jam).  Check the temperature with a sugar thermometer; it should reach 105C/220F.", "Leave the jam to cool slightly and skim off any froth with a clean spoon. Spoon the jam into sterile jam jars, seal and label.", "For the scones, preheat the oven to 220C/450F/Gas 7. Grease a large baking tray.", "Sift the flour, baking powder and salt together in a bowl, then rub in the butter until the mixture resembles breadcrumbs. ", "Stir in the sugar, sultanas and eggs. ", "Stir in the milk with a wooden spoon, a little at a time, to form a smooth dough.", "Roll the dough out onto a lightly floured work surface to a thickness of 2cm/¾in. ", "Dip a 5cm/2in pastry cutter into a little flour and cut out the scones (be careful not to twist the cutter as it will cause the scones to rise unevenly).", "Beat the two remaining eggs in a bowl and carefully brush the tops of the scones, taking care not to let any run over the edge.", "Place the scones onto the baking tray and bake in the oven for 10-12 minutes, or until golden-brown. ", "Remove the scones from the oven and allow to cool slightly. Serve the  warm scones with the strawberry jam and clotted cream."]}, {"isVegetarian": true, "title": "Sultana scones with black pepper and strawberry jam and clotted cream", "url": "www_bbc_co_uk_food_recipes_sultanasconeswithbla_86378", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self-raising flour", "1 tsp baking powder, plus extra for dusting", "pinch salt", "25g/1oz caster sugar", "50g/2oz unsalted butter, softened, plus extra for dusting", "100g/3½oz sultanas", "150ml/¼ pint milk", "1 free-range egg, beaten, for brushing, or 25g/1oz plain flour, for dusting ", "400g/14oz clotted cream", "550g/1lb 4oz jam sugar", "1 lemon, zest and juice only", "3 tbsp water", "1 kg/2lb 2oz fresh strawberries, hulled and cut in half (if large)", "1 tbsp freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the scones, sift together the flour, baking powder and salt into a bowl.", "Stir in the sugar, then add the butter and, with clean hands, rub quickly into the flour, creating a fine breadcrumb consistency. Add the sultanas.", "Add the milk, a little at a time, working with your hands to create a smooth dough. Leave to rest for 10-15 minutes before rolling.", "Roll out the dough on a lightly floured work surface until 2cm/1in thick.", "Using a 5cm/2in pastry cutter, cut the dough, using one sharp tap and not twisting the dough as you cut (twisting the scone mix will result in the scone rising unevenly).", "Once cut, the scones can be either brushed with the beaten egg for a shiny glaze, or dusted with the flour for a matt finish once cooked.", "Place the scones onto a greased baking tray and bake in the oven for 10-12 minutes, until risen and golden brown.", "Allow to cool slightly, and serve while still warm with jam and cream.", "For the jam, place the sugar, lemon zest and juice and water into a large pan over a low heat and heat until the sugar has dissolved.", "Add the strawberries and black pepper and stir gently.", "Bring the pan to the boil and cook for 3-4 minutes, or up to ten minutes if you prefer a thicker jam. Check the temperature with a sugar thermometer - it should reach 105C/220F.", "Leave to cool slightly, skimming off any froth with a clean spoon to stop the jam from going cloudy.", "Spoon the jam into sterile jam jars, seal and label with the date."]}, {"isVegetarian": true, "title": "Sultana scones", "url": "www_bbc_co_uk_food_recipes_sultanascones_1286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz self raising flour", "pinch of salt", "55g/2oz butter ", "25g/1oz sultanas", "25g/1oz caster sugar", "150ml/5fl oz milk"], "serves": "Makes 8-12 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 220C/425F/Gas 7. Lightly grease a baking sheet.", "Mix together the flour and salt and rub in the butter. ", "Stir in the sultanas, sugar and then the milk to get a soft dough.", "Turn on to a floured work surface and knead very lightly. Pat out to a round 2cm/¾in thick. Use a 5cm/2in cutter to stamp out rounds and place on a baking sheet. Lightly knead together the rest of the dough and stamp out more scones to use it all up.", "Brush the tops of the scones with a little milk. Bake for 12-15 minutes until well risen and golden. ", "Cool on a wire rack and serve with butter and good jam and maybe some clotted cream."]}, {"isVegetarian": false, "title": "Sultan's delight with creamed aubergine", "url": "www_bbc_co_uk_food_recipes_sultansdelightwithcr_81428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "3 tbsp olive oil", "1.8kg/4lb lamb shoulder or leg, trimmed, cut into 2.5cm/1in cubes", "1 onion", "5 cloves garlic, crushed", "2 tbsp tomato paste", "½ tsp dried thyme", "1 tsp dried oregano", "¼ tsp cloves", "½ tsp allspice", "1 tsp ground cumin ", "285ml/10fl oz lamb stock", "salt and freshly ground black pepper", "flatleaf parsley, to garnish", "4 large aubergines", "250ml/9fl oz milk", "2 tbsp double cream", "55g/2oz butter", "1 tbsp plain flour", "110g/4oz Kasseri cheese (cheddar will do), grated", "1 tsp dried chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lamb, heat the butter and oil in a heavy pan and brown the lamb for about 5 minutes, stirring frequently. ", "Add the onion and garlic and sweat for a couple of minutes. Add the tomato paste, thyme, oregano, cloves, allspice, cumin, stock and salt and freshly ground black pepper. Bring to the boil and simmer with the lid off for about an hour until the stew is thick and the meat tender.", "For the aubergine, bake the aubergines in the oven for about 40 minutes or until blistered and softened. Leave to cool slightly.", "Peel the aubergines, and set the pulp to one side. ", "In a saucepan warm the milk and cream. In another pan melt the butter, then work in the flour. Slowly add the warm milk and cream to the butter and flour and stir to make a thick white sauce. ", "Add the aubergine purée, the cheese, chilli flakes, salt and freshly ground black pepper. Cook for about 5 minutes. ", "Put a mound of aubergine purée in the middle of the plate and surround with the lamb. Garnish with parsley."]}, {"isVegetarian": false, "title": "Sumac lamb chops with crushed caramelised onion potatoes", "url": "www_bbc_co_uk_food_recipes_sumac_lamb_chops_with_87399", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sumac_lamb_chops_with_87399_16x9.jpg", "ingredients": ["1kg/2lb 4oz potatoes, cut into 2cm/1in cubes", "4 tbsp olive oil", "2 large onions, thinly sliced (approx. 400g/14oz)", "¼ tsp fine salt", "1 tsp light brown sugar", "8 large lamb chops", "5 tbsp olive oil", "1 tsp salt", "2–3 tbsp sumac"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in lightly salted water for 1–2 minutes, or until tender. Drain and set aside.", "For the lamb chops, bash the meat with a mallet or rolling pin to thin it out. Put the chops on a plate, drizzle with the oil and season well with salt.", "Fry the chops over a high heat for 3 minutes on each side. Place them on a baking tray and sprinkle both sides with the sumac. Cover with kitchen foil and keep them warm.", "To make the potatoes, wipe any burnt bits from the pan, then add the oil and place over a medium heat. Add the onions, salt and sugar and cook for 15 minutes, or until golden, caramelised and soft. ", "Crush the potatoes lightly using the back of a fork and add to the onions. Mix through, then cook for 10–15 minutes, or until the edges are just crisp. Serve with the chops."]}, {"isVegetarian": false, "title": "Sumiko’s miso soup", "url": "www_bbc_co_uk_food_recipes_sumikos_miso_soup_47124", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7-10 sheets dried sea kelp (called konbu, available from Japanese supermarkets) ", "8g dried bonito flakes (called katsuobushi, available from Japanese supermarkets)", "handful fresh spinach leaves ", "200g/7oz aburaage (thinly sliced deep-fried tofu, available from Japanese supermarkets), shredded into 1cm/½in lengths", "1½ tbsp white miso paste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dashi, put the konbu in a deep-sided saucepan and cover with 500ml/18fl oz water. Set aside to soak for 30 minutes. ", "Once soaked, heat the pan contents until just boiling, removing the konbu with a slotted spoon just before the water starts to boil. ", "Add the bonito flakes to the water and boil for 1 minute, then remove the pan from the heat and allow the stock to cool for 4-5 minutes. Strain the dashi through a fine sieve into a clean saucepan and reserve. Keep warm.", "For the miso soup, cook the spinach in a pan of boiling water until wilted, then remove from the water using a slotted spoon and set aside in a bowl to cool. Once the spinach is cool enough to handle, squeeze out any excess moisture from the leaves using your hands. Set aside.", "Add the aburaage to the spinach water and boil for 1-2 minutes to remove any grease. Drain well.", "Push the miso paste through a fine sieve into the dashi and heat until dissolved. Add the drained tofu and spinach and warm through. Serve immediately in bowls."]}, {"isVegetarian": true, "title": "Summer berry and heather honey meringue roulade", "url": "www_bbc_co_uk_food_recipes_summer_berry_and_heather_67533", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_berry_and_heather_67533_16x9.jpg", "ingredients": ["5 free-range egg whites", "275g/9¾oz caster sugar, plus extra for dusting", "50g/1¾oz flaked almonds", "600ml/20fl oz double cream", "100g/3½oz raspberries", "2 tbsp heather honey", "50g/1¾oz strawberries, cut in half", "50g/1¾oz blackberries", "50g/1¾oz raspberries", "1 tbsp heather honey", "sprigs of heather, to decorate (optional)", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line a 23x33cm/9x13in Swiss roll tin with baking parchment.", "In a large bowl, whisk the egg whites using an electric hand whisk until stiff peaks form when the whisk is removed. Gradually add the sugar, a spoonful at a time. Whisk until very stiff and glossy and all the sugar has been added.", "Spoon the mixture into the prepared tin and smooth the surface. Sprinkle with almonds. Place the tin in the preheated oven and bake for eight minutes, or until golden-brown. Lower the temperature to 160C/325F/Gas 3 and bake for a further 15 minutes, or until crisp.", "Remove from the oven and turn out, almond-side down, onto a sheet of non-stick baking paper dusted with caster sugar. Remove the baking parchment from the base of the cooked meringue and allow to cool.", "For the filling, put the cream and raspberries in a bowl and lightly whip. Spread evenly over the meringue and spoon over the heather honey and most of the blackberries and strawberries. Starting at the long end, roll up the meringue using the paper to help you.", "Decorate the top of the roulade with the reserved berries, heather honey, sprigs of heather (if using) and a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Summer berry shortbread cake", "url": "www_bbc_co_uk_food_recipes_summer_berry_shortbread_93106", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_berry_shortbread_93106_16x9.jpg", "ingredients": ["175g/6oz plain flour, plus extra for dusting", "100g/3½oz unsalted butter, chilled, cut into pieces, plus extra for greasing", "¼ tsp fine sea salt", "40g/1½oz desiccated coconut", "2 tbsp golden caster sugar", "1 free-range egg yolk (reserve the white for the cake)", "½ tsp vanilla extract", "50g/1¾oz raspberries", "50g/1¾oz jam sugar", "175g/6oz unsalted butter ", "150g/5½oz plain yoghurt", "3 free-range eggs", "150g/5½oz plain flour ", "¼ tsp fine sea salt", "2 tsp baking powder", "175g/6oz golden caster sugar", "100g/3½oz desiccated coconut ", "75g/2½oz raspberries ", "75g/2½oz blueberries", "100g/3½oz flaked almonds"], "serves": "Makes 12–15", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 6. Lightly butter and line a 23cm/9in square cake tin with baking paper. ", "For the biscuit base, put the flour, butter and salt in a food processor and pulse to a fine crumb. Add the coconut and sugar and pulse again. Beat the egg yolk with the vanilla and 1–2 tablespoons cold water and add to the food processor with the motor running, to make a soft dough. Press into the prepared tin and flatten using the back of a spoon, pushing the mixture evenly into all the corners. Prick the base using a fork, then cover and chill in the fridge for 10 minutes. ", "Meanwhile, for the jam, put the raspberries and sugar in a saucepan and heat until the sugar has dissolved. Bring to the boil for 5 minutes, or until it reaches the setting point.", "Bake the biscuit base for 15 minutes, or until pale golden-brown. Leave to cool for 2 minutes, then spread with the jam. ", "For the cake, melt the butter in a heavy-bottomed saucepan. Remove from the heat and use a fork to beat in the yoghurt, then the eggs and reserved egg white. ", "Sift the flour, salt and baking powder into a large bowl and stir in the sugar and coconut.", "Pour the wet cake ingredients into the dry ingredients and mix well. Pour over the jammy base, level the top with the back of a spoon and scatter with the berries and flaked almonds. Bake for 40–45 minutes, or until a skewer inserted into the centre comes out clean. Leave to cool in the tin, then turn out and cut into bars."]}, {"isVegetarian": true, "title": "Summer fruit smoothie", "url": "www_bbc_co_uk_food_recipes_summer_fruit_smoothie_22742", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_fruit_smoothie_22742_16x9.jpg", "ingredients": ["225g/8oz fresh blackberries", "225g/8oz fresh raspberries", "225g/8oz fresh blueberries", "1 just-ripe medium banana, broken into pieces", "150ml/¼ pint natural plain yoghurt", "150ml/¼ pint milk", "1 tbsp icing sugar (optional)"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Measure all the ingredients into a food processor and whiz until smooth. Alternatively use a hand-held blender.", "Pour into a tall cool glass and enjoy."]}, {"isVegetarian": false, "title": "Summer berry trifle", "url": "www_bbc_co_uk_food_recipes_summer_berry_trifle_59969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz custard powder", "60g/2¼oz sugar", "2.4 litres/3 pints 4fl oz milk", "5 x 135g/4¾ oz packets strawberry jelly ", "850g/1lb 14oz ready-made jam-filled Swiss roll", "1.5kg/3lb 5oz strawberries, hulled and halved ", "50g/1¾ oz flaked almonds", "1.5 litres/2 pints 14fl oz double cream"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the custard powder and the sugar into a large bowl and add a little of the milk, stir until you have a smooth paste.", "Heat the remaining milk in a large saucepan until it nearly reaches boiling point and pour in the custard powder mixture.", "Stir continuously on a low heat until the custard thickens then set aside to cool.", "To make the jelly, follow the packet instructions, but do not place it into the fridge to set. ", "Cut the Swiss rolls into equal slices and arrange them over the bases of two large deep baking trays. ", "Scatter the strawberries on top of the sponge. Pour the prepared jelly over the fruit. Cover the trays with cling film and leave to set in the fridge for about an hour and a half.", "When the custard has cooled, gently pour on top of the set jelly. ", "Cover with cling film and return the trays to the fridge for a further 30 minutes, or until the custard is lightly set. ", "For the topping, lightly toast the almonds in a dry frying pan over a low heat for 2-3 minutes, or until golden-brown, keeping the almonds moving around the pan frequently to prevent them from burning. Set aside to cool. ", "Whip the cream until it forms soft peaks. Spoon the whipped cream over the custard. Scatter the almonds on top, cover and return to the fridge until ready to serve. "]}, {"isVegetarian": true, "title": "Summer fruit soup with coconut cream and crumble topping", "url": "www_bbc_co_uk_food_recipes_summer_fruit_soup_with_97459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6¼oz unsalted butter", "175g/6¼oz caster sugar", "175g/6¼oz plain flour", "pinch ground cinnamon", "200g/7¼oz icing sugar", "50ml/1¾fl oz brandy  ", "300ml/10½fl oz red wine", "400g/14¼ oz strawberries", "500ml/17½fl oz double cream", "100g/3½oz icing sugar, sifted", "200ml/7¼fl oz coconut milk", "100g/4oz blackberries", "150g/5¼oz raspberries", "150g/5¼oz blueberries", "6 sprigs redcurrants", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper or baking parchment.", "For the crumble topping, rub the butter, sugar and flour together in a bowl until the mixture resembles fine breadcrumbs.", "Sprinkle the mixture onto the lined baking tray, then bake in the oven for 12-15 minutes, or until crisp and golden-brown. Remove from the oven and set aside to cool.", "For the sauce, heat the sugar, brandy and wine in a pan until the sugar has dissolved and the mixture resembles syrup. Set aside to cool. ", "Blend the strawberries to a purée in a food processor. Strain the blended strawberries through a sieve, then fold the strained purée into the syrup until combined. ", "For the coconut cream, whisk the double cream and icing sugar in a large bowl until slightly thickened. ", "Add the coconut milk and continue to whisk until soft peaks form when the whisk is removed. Whisk in additional icing sugar, to taste, to sweeten the mixture.", "To serve, arrange a mixture of the blackberries, raspberries and blueberries into the centre of each of six serving dishes. Spoon the sauce on top, followed by the coconut cream. Sprinkle over the cinnamon crumble. Garnish with the redcurrant sprigs and dust with icing sugar."]}, {"isVegetarian": false, "title": "Summer party gâteau", "url": "www_bbc_co_uk_food_recipes_summer_party_gateau_61495", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_party_gateau_61495_16x9.jpg", "ingredients": ["8 eggs ", "250g/9oz caster sugar", "250g/9oz self-raising flour", "100g/3½oz butter, melted and cooled, plus extra for greasing", "900ml/1½ pints double cream", "400g/14oz raspberries", "300g/10½oz blueberries", "300g/10½oz blackberries", "icing sugar, for dusting"], "serves": "Serves 16", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["This recipe is best started the day before you want to serve it. You will need two 23cm/9in round cake tins with 5cm/2in sides. Preheat the oven to 180C/160C Fan/Gas 4, then grease the tins with butter and line the bases with baking paper.", "To make the sponges, put four of the eggs and half the caster sugar in a bowl and, using an electric hand whisk or food mixer, whisk until thick, pale and fluffy. When you lift the whisk, the batter dropping from it should leave a trail in the mixture below.", "Sift half the flour into the mixture, and gently fold in to combine. Drizzle half the cooled melted butter around the outside of the mixture and carefully fold in before pouring into one of the prepared cake tins.", "To make the second sponge, simply repeat steps two and three, and pour into the second tin.", "Bake both sponges at the same time in the oven for about 30 minutes, or until pale golden-brown, firm in the middle and shrinking away from the sides of the tin. If not baking on the same shelf, you may need to swap the tins around halfway through to ensure you get an even bake.", "Remove from the oven and, after 10 minutes, release from the tins and set aside to cool completely on a wire rack. Remove the lining paper and, using a bread knife, slice each sponge in half horizontally to give four layers in total.", "Whip the cream in a bowl until it forms firm peaks. Reserve 4 tablespoons for decorating the top of the cake, and then divide the remaining whipped cream into three. Divide a mixture of the three different berries into three piles, reserving a handful of each for the top of the cake.", "Place one layer of sponge on a large plate, then spread with a third of the whipped cream, scatter over a third of the mixed berries, making sure they come around the edge of the cream, so they can be seen. Add another layer of sponge on top and repeat until you have three layers, topped with a final layer of sponge.", "To decorate the top, spread the reserved cream in a small circle in the centre of the sponge and arrange the remaining berries on top. Cover carefully with cling film and put in the fridge to settle – for a few hours, but overnight if possible. When you are ready to serve, dust the gâteau with icing sugar and cut into slices."]}, {"isVegetarian": false, "title": "Summer pudding loaf", "url": "www_bbc_co_uk_food_recipes_summer_pudding_loaf_92270", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_pudding_loaf_92270_16x9.jpg", "ingredients": ["1kg/2lb 4oz mixed summer berries: blueberries, raspberries, blackberries, redcurrants, blackcurrants", "250g/9oz caster sugar", "1 large unsliced white loaf or thick-sliced white bread (preferably slightly stale)"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Line one 450g/1lb loaf tin with a double layer of cling film.", "Prepare the fruit by removing any leaves and stalks. Place the blueberries, redcurrants and blackcurrants in a pan with the sugar and a couple of tablespoons of water and bring to the boil. Cook for 2-3 minutes, or until the berries have just softened and burst (don't overcook). You don’t need to cook the raspberries or blackberries so just add them to the pan at the end.", "Using a sharp knife, cut the crusts off all sides of the loaf, then cut the loaf into medium-thick slices along the length of the bread, so that you have long slices rather than square slices. ", "Place one slice of bread in the base of the tin, trimming to fit. Place a slice of bread either side of the inside of the tin and cut slices to fit both ends of the tin.", "Spoon a little juice from the cooked berries in the base to make sure that all the bread is well soaked in juice. Add the fruit gradually, making sure the bread soaks up all the juices and becomes red. When the tin is full of fruit, top with bread another slice of bread to seal it.  Spoon over a couple of tablespoonfuls of juice from the berries that are left in the pan. You should have about half the amount of fruit leftover, which is lovely to serve alongside each slice. ", "Cover the top with cling film and place the pudding in the fridge overnight. Place a weight, such as a can of baked beans, on top of the pudding to press the mixture down, this will ensure that the mixture soaks into the bread and the pudding is firm enough to cut.", "To turn out, peel back the cling film, then turn the pudding upside-down onto a plate and remove the cling film. Cut into slices and serve with the remaining berries and juice."]}, {"isVegetarian": true, "title": "Summer pudding with clotted cream", "url": "www_bbc_co_uk_food_recipes_summer_pudding_with_89427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz fresh raspberries", "350g/12oz blackberries", "1 tbsp finely shredded basil", "vegetable oil, for greasing", "6 thin slices white bread", "4 tbsp clotted cream", "100g/3½oz caster sugar, for decoration"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Set aside 100g/3½oz each of raspberries and blackberries for decoration. Mix together the remaining berries. Bruise 200g/7oz of the remaining berries with a fork and stir through the basil. Set aside. ", "Crush the remaining berries and pass through a fine sieve. Reserve the juice and discard the pulp.", "Grease 2 dariole moulds with a little oil and line with cling film (leave enough overhang to cover the top later). ", "Remove the crusts from the bread and discard. Cut out 2 circles to fit the bottom of the moulds and 2 circles to fit the top of the moulds. Cut the rest into rectangles to line the sides of the moulds.", "Dip the small circles of bread in the reserved juice and push into the bottom of the moulds, dip the rectangles into the juice and press firmly around the edges, taking care not to leave any gaps.", "Half fill the moulds with the crushed berries, add a tablespoon of cream and top with any remaining berries. Dip the larger circle in the juice and place on top. Cover in cling film and press down firmly. Chill until ready to serve.", "To make a caramel, heat the sugar in a large non-stick pan until golden-brown. Use a spoon to quickly drizzle the caramel over a knife-sharpening steel (CAUTION: sugar gets very hot). Pull the strands of caramel together to make a sugar ball. Repeat to make a second sugar ball.", "Turn out the summer puddings from the moulds, remove the cling film and put onto plates. Spoon over any remaining juice, decorate with the reserved berries and serve with a spoonful of clotted cream and a sugar ball."]}, {"isVegetarian": true, "title": "Summer pudding with berries and white chocolate cream", "url": "www_bbc_co_uk_food_recipes_summer_pudding_with_98588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb raspberries", "350g/12oz mixed berries ", "150g/5½oz caster sugar", "small sherry glass of framboise (raspberry liqueur)", "knob of butter", "8-10 slices  white chocolate and raspberry bread, crusts removed (or other sweet bread)", "100g/3½oz white chocolate ", "250ml/9fl oz double cream, lightly whipped", "250g/9oz mascarpone ", "1 dessertspoon icing sugar, plus extra to decorate"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Combine the fruit, sugar and liqueur in a saucepan and gently cook for 5-8 minutes, or until the liquid has reduced a little. Remove from the heat.  ", "Lightly butter a 1 litre/1¾ pint  pudding basin.", "Line the bowl carefully with most of the bread using small pieces to cover any holes in the side or bottom, then pour in nearly all of fruit (leave a little cupful aside for garnish). Cover with a lid of bread and then use a dish or lid to press down firmly (you could use two dishes to get some weight). Set aside in the fridge overnight.", "Melt the white chocolate gently in a bain marie or a bowl suspended over a pan of gently simmering water (do not let the bottom of the bowl touch the water). Allow to cool slightly and then stir in the cream. Add the mascarpone and mix in the icing sugar. ", "Turn the pudding onto a dish, drizzle with the leftover fruit and serve with the white chocolate cream."]}, {"isVegetarian": false, "title": "Summer salad canapés with Asian-style dressing", "url": "www_bbc_co_uk_food_recipes_summer_salad_with_72489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 baby courgette, trimmed, julienned", "2 carrots, peeled, julienned", "3 celery stalks, trimmed, julienned", "1 red pepper, deseeded, julienned", "1 yellow pepper, deseeded, julienned", "½ beetroot (preferably Chioggia), peeled, julienned", "2 baby cucumbers, trimmed, julienned", "1 baby sweetcorn, julienned", "2 spring onions, trimmed, thinly sliced", "few sprigs fresh coriander, finely chopped", "salt and freshly ground black pepper", "1 garlic clove, crushed", "1 red chilli, deseeded, finely chopped", "1 tbsp Thai fish sauce", "1 tbsp rice wine vinegar", "1 tsp demerara sugar", "2 tbsp freshly squeezed lime juice", "1 tbsp extra virgin olive oil", "500ml/18fl oz vegetable oil", "2-3 large courgettes, trimmed, thinly sliced using a mandoline", "1-2 tbsp demerara sugar", "1 small onion, thinly sliced using a mandoline"], "serves": "Makes 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the salad, mix together all the vegetables and herbs in a bowl and season with salt and pepper. ", "For the dressing, whisk together all the ingredients with 1 tablespoon water until the sugar dissolves.", "Drizzle the dressing over the salad and toss to coat the vegetables.", "Heat the oil in a heavy-based, deep-sided saucepan to 135C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) ", "Sprinkle the courgette slices with demerara sugar and fry, in batches if necessary, for 1-2 minutes, or until golden-brown on each side. Transfer to kitchen paper to drain.", "Carefully lower the onion slices into the hot oil and fry for 1 minute, or until crisp and golden-brown. Transfer to kitchen paper to drain. Sprinkle with salt.", "To serve, top each slice of fried courgette with a teaspoonful of the dressed salad, then top the salad with a pinch of the fried onion slices."]}]