[{"ingredients": ["Paletilla de cordero deshuesada de 1.3 kg / 3 lb, cortada en trozos de aproximadamente 4 cm / 1 pulgada", "100ml / 3½fl oz de vinagre de vino tinto", "2 cucharadas de aceite de girasol", "2 cucharaditas de copos de sal marina", "Papas de 500g / 1lb y 2oz, peladas y cortadas en aproximadamente 2.5cm / 1en piezas", "125ml / 4½fl oz de aceite de girasol", "4 cebollas, 3 rebanadas finas y 1 picada", "6 dientes de ajo, picados", "3 chiles rojos largos (no se eliminan), picados", "25 g / 1 oz de raíz de jengibre fresco, pelado, más o menos picado", "1 cucharada de mostaza inglesa en polvo", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "1 cucharada de pimentón molido", "2 cucharaditas de cúrcuma molida", "2 cucharaditas de pimienta de cayena", "1 cucharadita de canela molida", "2 cucharaditas de copos de sal marina", "2 hojas de laurel"], "method": ["Recorte el cordero, descartando cualquier masa dura de grasa y tendones. Mezcle el vinagre, el aceite vegetal y la sal en un tazón hasta que estén bien combinados. Agregue el cordero y revuelva para cubrir en el adobo. Cubra y enfríe en el refrigerador por dos horas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para la salsa, caliente tres cucharadas de aceite de girasol en una sartén grande de base pesada y cocine las cebollas en rodajas muy suavemente a fuego medio-bajo durante 15 minutos hasta que estén suaves y ligeramente doradas, revolviendo ocasionalmente.", "Mientras se cocinan las cebollas rebanadas, coloque en un procesador de alimentos la cebolla picada, el ajo, los chiles, el jengibre, la mostaza en polvo, el comino, el cilantro, el pimentón, la cúrcuma, la pimienta de cayena y la canela.", "Revuelva el puré en las cebollas fritas. Agregue dos cucharadas de aceite y cocine juntas durante cinco minutos, o hasta que espese y comience a colorear. Retire la mezcla de la sartén y colóquela en una cazuela.", "Escurre el cordero en un colador y reserve el adobo. Regrese la sartén al fuego y agregue dos cucharadas de aceite restante. Freír el cordero en cuatro o cinco tandas a fuego medio-alto, volteándolo ocasionalmente hasta que esté ligeramente dorado. Agregue un poco de aceite extra si es necesario. Agregue el cordero a la cazuela.", "Vierta el adobo reservado y 500ml / 17fl oz de agua en la cazuela. Agregue la sal y las hojas de laurel y cocine a fuego lento. Cubra la superficie del curry con un trozo de papel resistente a la grasa, luego cubra con una tapa. Cocine en el horno por 45 minutos.", "Retire la cacerola del horno y mezcle los trozos de patata con el curry, vuelva a tapar con papel y la tapa y continúe cocinando durante una hora más o hasta que el cordero y las papas estén muy tiernos. Sazonar, al gusto, con sal.", "Sirva con cucharadas de yogur, cilantro picado y arroz o pan de naan wamed."], "url": "www_bbc_co_uk_food_recipes_lamb_vindaloo_41903", "title": "Cordero Vindaloo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_vindaloo_41903_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1.5kg / 3lb 5oz hombro de cordero, deshuesado y atado", "sal y pimienta negra recién molida", "guión de aceite vegetal", "1 cebolla picada", "2 zanahorias, peladas y picadas", "algunas ramitas de tomillo", "4 dientes de ajo", "1 botella de vino tinto", "500ml / 18fl oz de caldo de cordero", "1 cebolla, finamente picada", "aceite de oliva, para freír", "1.5kg / 3lb 5oz recortes de cordero (hombro y pierna)", "1 botella de vino tinto", "1.2 litros / 2 pintas de caldo de cordero", "1 manojo pequeño de perejil fresco", "harina común, para quitar el polvo", "2 huevos de gallinas camperas", "Pan rallado pancho japonés de 100 g / 3½ oz", "aceite vegetal, para freír en grasa", "2 costillas de cordero (5 huesos en cada bastidor), recortadas en francés", "guión de aceite vegetal", "4 remolachas crudas", "sal y pimienta negra recién molida", "guión de aceite vegetal", "mantequilla, para freír", "puñado de hojas de acelga / remolacha, blanqueadas", "1,5 kg / 3 lb 5 oz de patatas, peladas y cortadas finamente en una mandolina", "sal y pimienta negra recién molida", "2 cucharadas de hojas de tomillo", "6 dientes de ajo, aplastados", "1.8 litros / 3 pintas de crema doble", "cocción de restos líquidos del hombro de cordero y huesos", "1 cucharada de harina de maíz (si es necesario para espesar el jus)", "1 cebolla pequeña o 2 chalotes, picados", "pequeño manojo de menta fresca, picado", "pequeño racimo de cilantro fresco, picado", "pequeño racimo de flatleaf fresco, picado", "1 limón, ralladura y jugo", "2 dientes de ajo picados", "aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para el hombro de cordero cocinado lentamente, precaliente el horno a 160 ° C / 325 ° F / Gas 3.", "Sazonar el hombro de cordero con sal y pimienta negra recién molida, al gusto.", "Caliente una pizca de aceite vegetal en una sartén caliente y cocine el cordero hasta que esté coloreado por todos lados.", "Transfiera a una bandeja de asar y agregue la cebolla, las zanahorias, el tomillo y el ajo.", "Cubra con el vino tinto y el caldo y cubra bien con papel de aluminio.", "Cocine en el horno durante tres horas o hasta que estén tiernas. Reserve cualquier zumo de cocina para el jus.", "Para el bon bon cordero, freír la cebolla en una sartén con aceite hasta que se ablande. Agregue los adornos de cordero y permita el color.", "Vierta el vino y el caldo y deje reposar a fuego lento durante 2½-3 horas, o hasta que estén tiernos. En un procesador de alimentos, mezcle los adornos estofados con el perejil. Drene el jugo (reteniéndolo) y, usando sus manos, forme bolas. Dejar de lado.", "Para la chuleta de cordero, precaliente el horno a 180C / 350F / Gas 4 y condimente el cordero con sal y pimienta.", "Calentar una pizca de aceite en una sartén grande y freír el cordero hasta que se dore. Transfiera al horno y cocine por 10-12 minutos, o hasta que sea medio raro (puede que desee cocinar el cordero por más tiempo si no es de su gusto). Retirar del horno y dejar reposar antes de tallar.", "Para la remolacha y la acelga, hierva la remolacha en una sartén de agua con sal hasta que se suavice. Escurrir bien y dejar enfriar.", "Una vez que se haya enfriado, pele y luego corte en cuartos.", "Para servir, freír la remolacha rápidamente con un toque de aceite con sal y pimienta. Para las hojas, derrita la mantequilla en una sartén y marchite las hojas durante 1-2 minutos.", "Para el gratinado de papa, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque las rodajas de patata en un plato gratinado, sazonándolas con sal y pimienta entre cada capa.", "Agregue las hojas de tomillo y el ajo triturado alternativamente entre las capas. Verter sobre la crema doble y dejar reposar durante 10 minutos.", "Cocine durante 50 minutos a una hora, o hasta que estén doradas. Cortar en cuadrados para servir.", "Para el jus, colar las sobras líquidas del hombro cocinado lentamente. Hervir el líquido en una olla hasta que el volumen del líquido se haya reducido a la mitad. Agregue cualquier licor de cocción reservado para hacer el bon bon y reduzca nuevamente. Espesar el jus si es necesario con un poco de harina de maíz mezclada en una pasta con agua fría.", "Para terminar el bon bon cordero, prepare un plato de harina, un cuenco de huevo ligeramente batido y un plato de migas de panko japonés.", "Caliente el aceite en una freidora a 180C / 350F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Espolvorea los granos en la harina, sumérgelos en el huevo batido y cúbrelos con pan rallado. Freír en la freidora hasta que esté bien cocida, luego retirar cuidadosamente con una cuchara ranurada y colocar en un plato forrado con papel de cocina.", "Para la salsa de menta, mezcle las cebollas (o chalotas), menta, cilantro, perejil, ralladura de limón, jugo de limón y ajo hasta que quede suave en un procesador de alimentos.", "Poco a poco agregue suficiente aceite para obtener una consistencia suave y suave. Sazone al gusto.", "Para servir, arregle el gratinado de papa en cada uno de los cuatro platos que sirven. Coloque los trozos de cordero al costado. Coloque los cuartos de remolacha y las hojas marchitas al lado del hombro del cordero y coloque la chuleta de cordero encima. Coloque los huesos de cordero al costado y coloque la salsa de menta junto a la carne. Rocíe con el jus para servir."], "url": "www_bbc_co_uk_food_recipes_lamb_three_ways_54983", "title": "Cordero de tres maneras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600g / 1lb 5oz berberechos", "300 ml / 10 fl oz de sidra mediana dulce", "3 filetes de cuello de cordero", "1 cucharadita de tomillo, finamente picado", "sal marina y pimienta negra recién molida", "generosa perilla de mantequilla", "1 cebolla grande, cortada a la mitad y finamente cortada", "Tocino tocino 100 g / 3½ oz", "1 cucharada de vinagre de sidra", "1 cucharada de perejil fresco picado", "1 cucharada de hojas de apio, picadas"], "method": ["Precalienta el horno a 170 ° C / 325 ° F / Gas 3. Coloca los berberechos en un colador y enjuágalos bajo un grifo que funcione en frío, sacudiéndolos para quitarles cualquier arenilla o para abrirlos y pegarlos con limo.", "Pon los berberechos y la sidra en una sartén grande de tamaño medio. Cubra con la tapa y vapor durante 2-3 minutos hasta que los berberechos se hayan abierto. Cuele los berberechos, descartando los que queden cerrados, luego cuele el licor de nuevo a través de un colador fino para eliminar la mayor cantidad de arena posible.", "Sazonar el cordero con el tomillo, sal marina y pimienta negra recién molida. En una sartén a prueba de horno muy caliente, derrita la mantequilla y dore el cordero rápidamente, retire la carne de la sartén y déjela a un lado.", "Incline la cebolla y los lardons en la misma sartén y cocine a fuego moderado hasta que las cebollas estén translúcidas. Vierta el vinagre de sidra para desglasar la sartén y luego devuelva la carne a la sartén y vierta el licor de berberecho. Cubra la olla con una tapa, transfiérala al horno y cocínela durante 45 minutos a una hora.", "Mientras tanto, recoge tres cuartos de los berberechos de sus caparazones, dejando el resto en sus caparazones. Agregue todos los berberechos al cordero, caliente y luego sazone con sal marina y pimienta negra recién molida y agregue el perejil y las hojas de apio.", "Corte el cordero en platos calientes, cocine sobre los berberechos y el licor y sirva con papas hervidas y repollo Savoy."], "url": "www_bbc_co_uk_food_recipes_lamb_with_cockles_52690", "title": "Cordero con berberechos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 2oz de hueso de cordero deshuesado, cortado en trozos grandes", "sal y pimienta negra recién molida", "150ml / 5fl oz de aceite de oliva virgen extra", "2 cebollas en rodajas", "1 zanahoria grande, en rodajas", "1 tallo de apio, en rodajas", "5 dientes de ajo, aplastados", "Filetes de anchoa 20 g / ¾oz", "puñado de ramitas de tomillo fresco", "1 chile rojo, en rodajas", "250ml / 9fl oz de vino blanco", "25ml / 1fl oz de vinagre de vino blanco", "250g / 9oz de guisantes frescos o congelados", "Patatas de 400g / 14oz, piel sobre, cortada en cuartos", "200g / 7oz de tomates cherry, cortados a la mitad", "1-2 panes de pan crujiente, en rodajas y tostado"], "method": ["Sazone los trozos de cordero con sal y pimienta negra recién molida y reserve.", "Caliente el aceite de oliva en una olla grande y fría las cebollas, la zanahoria y el apio durante 4-5 minutos o hasta que se ablanden.", "Agregue el ajo, las anchoas, el tomillo y el chile y continúe cocinando, revolviendo, hasta que las anchoas casi se hayan disuelto en el aceite.", "Agregue el cordero a la sartén y fría hasta que se dore por todas partes.", "Agregue el vino y continúe cocinando hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el vinagre. Reduzca el fuego, cubra y cocine a fuego lento por otros 20 minutos.", "Agregue los guisantes, las papas y los tomates, cubra nuevamente y continúe cocinando durante aproximadamente una hora o hasta que la salsa se haya reducido a la mitad.", "Retirar del fuego y servir con un montón de pan tostado bueno."], "url": "www_bbc_co_uk_food_recipes_lamb_with_fresh_peas_03722", "title": "Cordero con guisantes frescos (cordero con guisantes frescos)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_with_fresh_peas_03722_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de cápsulas de cardamomo, solo semillas", "1 cucharadita de semillas de comino", "1 cucharadita de canela molida", "3 cucharadas de aceite de cacahuete, más extra para freír", "Filete de cordero de 600 g / 1 lb 7 oz, cortado en trozos grandes", "12 chalotes bebé", "1 cucharada de harina normal", "Puerto de 300 ml / 10½ fl oz", "800 ml / 1½pt de caldo de cordero o carne de res", "Ciruelas 300 g / 10½ oz", "1 ramita de canela", "sal y pimienta negra recién molida", "1 granada, solo semillas", "6-10 hojas de menta"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En un mortero, machaque la semilla de cardamomo y la semilla de comino en un polvo, luego mezcle la canela molida.", "Mezcle las especias con el aceite de cacahuete y frote la pasta de especias sobre los trozos de cordero.", "En una cazuela grande, freír el cordero en un poco más de aceite hasta que se dore por todas partes y luego dejar de lado (puede que tenga que hacer esto en tandas).", "En la misma sartén, freír los chalotes durante cinco minutos hasta que estén dorados y luego devolver el cordero a la sartén.", "Agregue la harina y cocínela durante un minuto.", "Vierta en el puerto y el caldo. Agregue las ciruelas pasas y la rajita de canela y sazone bien con sal y pimienta negra recién molida.", "Coloque una tapa en la cazuela y hornee por una hora.", "Sirva con una dispersión de semillas de granada y algunas hojas de menta rotas."], "url": "www_bbc_co_uk_food_recipes_lamb_with_port_and_85617", "title": "Cordero caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_with_port_and_85617_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60 g / 2¼ oz de mantequilla sin sal", "1 cebolla picada", "1 diente de ajo, aplastado", "2 cucharaditas de semillas de comino", "Pan de masa fermentada de 200 g / 7 oz, desgarrado en pedazos del tamaño de un bocado", "2 cucharaditas de copos de chile seco", "Albaricoques secos de 150g / 5oz, aproximadamente picados", "50g / 2oz de pistachos pelados, cortados en trozos", "sal marina y pimienta negra recién molida", "1 cucharada de aceite de oliva, para cepillar", "Pierna de cordero de 2kg / 4lb 8oz, con hueso", "4 cabezas de achicoria, a la mitad longitudinalmente", "3 cebollas rojas, cortadas en cuñas", "3 cucharadas de azúcar morena", "½ cucharada de hojuelas de chile seco", "2 cucharadas de aceite de oliva", "2 cucharadas de vinagre de sidra", "sal marina y pimienta negra recién molida"], "method": ["Para el cordero, caliente la mantequilla en una sartén grande a fuego medio.", "Agregue la cebolla y cocine, revolviendo ocasionalmente, durante 6-8 minutos, o hasta que se ablanden.", "Agregue el ajo triturado y la mitad de las semillas de comino y cocine por otro minuto.", "Incline la mezcla en un tazón grande y agregue el pan desmenuzado, los copos de chile, los albaricoques secos y las nueces de pistacho y sazone bien con sal marina y pimienta negra recién molida. Dejar de lado hasta que sea necesario.", "Precalentar el horno a 190C / 375F / Gas 5.", "Mezcle el aceite de oliva con las semillas de comino restantes y cepille esta mezcla sobre toda la superficie del cordero.", "Coloque el cordero en una lata grande para asar y cocínelo durante 1 hora y 20 minutos en total. Sin embargo, 15 minutos antes del final de la cocción, coloque la mezcla de relleno en la sartén alrededor del cordero y vuelva a colocarla en el horno.", "Mientras tanto, para la achicoria caramelizada, coloque la achicoria y las cebollas en una fuente para hornear y espolvoree con azúcar y hojuelas de chile.", "Rocíe con aceite y vinagre y sazone al gusto con sal marina y pimienta negra recién molida. Coloque en el horno y cocine durante 35-45 minutos, o hasta que estén doradas y caramelizadas.", "Una vez que el cordero esté cocido, cúbralo con papel de aluminio y déjelo reposar durante 15 minutos antes de tallar.", "Sirva el cordero en rodajas con la achicoria caramelizada y relleno junto con .."], "url": "www_bbc_co_uk_food_recipes_lamb_with_torn_bread_and_53988", "title": "Cordero con pan desgarrado y relleno de albaricoque y achicoria caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero de 500 g / 1 libra y 2 onzas, cortado en rodajas de 15 mm / ½ in", "1 limón, corteza rallada y jugo", "1 ramita de romero, picada", "3 pimientos mixtos, sin corazón, sin semillas y picados", "1 berenjena pequeña, en rodajas", "4 tortillas integrales de harina", "Garbanzos de hojalata de 400g / 14oz, enjuagados y escurridos", "2 cucharadas de yogurt griego", "2 cucharadas de jugo de limón", "1 cucharada de perejil picado", "Cohete de 100g / 3½ oz"], "method": ["Coloque el cordero, la cáscara de limón y el jugo, el romero y los pimientos en un recipiente no metálico y revuelva bien. Cubra y deje marinar en un lugar fresco por 30 minutos.", "Mientras tanto, ponga los ingredientes de hummus en un procesador de alimentos o licuadora y blitz por 30 segundos. Coloque en un tazón.", "Caliente una sartén o una sartén de base pesada, agregue la mezcla de cordero y la berenjena y fría por 3-4 minutos, o hasta que el cordero esté cocido (puede necesitar hacer esto en tandas).", "Calienta las tortillas. Envuelva el cordero y las verduras en las tortillas con el hummus y sirva el cohete."], "url": "www_bbc_co_uk_food_recipes_lamb_with_hummus_and_07348", "title": "Cordero con hummus y tortillas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_with_hummus_and_07348_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 corderos", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cebollas, peladas, más o menos picadas", "3 zanahorias, peladas, más o menos picadas", "½ nabo o nabo, pelado y cortado en trozos pequeños", "4 dientes de ajo, pelados, más o menos picados", "2 cucharadas de romero fresco finamente picado", "2 hojas de laurel", "2 ramitas de tomillo fresco, finamente picado", "2 cucharadas de puré de tomate", "Cebada perlada 250 g / 9 oz", "1½ litros / 3 pintas de caldo de pollo", "2-3 cucharadas de gelatina de menta", "3 cucharadas de perejil fresco de flatleaf recién picado"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Sazone las espigas de cordero con sal y pimienta negra recién molida. Caliente una cazuela grande a prueba de horno hasta que fume, agregue el aceite y las espigas de cordero y cocine por 2-3 minutos en cada lado, o hasta que estén doradas por todas partes.", "Retire el cordero de la sartén y déjelo a un lado. Agregue las cebollas, las zanahorias, el colinabo y el ajo a la sartén y cocínelos durante 2-3 minutos, o hasta que estén dorados.", "Agregue el romero, las hojas de laurel, el tomillo y el puré de tomate a la sartén y cocínelos durante un minuto más, luego agregue la cebada perlada. Cubra con el caldo de pollo y cocine a fuego lento.", "Cubra la bandeja con una tapa ajustada, luego transfiera al horno para cocinar por lo menos durante tres horas, o preferiblemente de 5 a 6 horas, hasta que el cordero esté muy tierno. (Es posible que deba agregar un poco más de líquido).", "Retire la sartén del horno y agregue la gelatina de menta y el perejil. Sazonar, al gusto, con sal y pimienta negra recién molida y servir."], "url": "www_bbc_co_uk_food_recipes_lambandbarleyhotpot_91976", "title": "Olla de cordero y cebada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pierna de cordero de 150 g / 5½ oz, cortada en cubos grandes", "1 puerro, picado en 1cm / ½ en ruedas", "1 cucharada de aceite de oliva", "2 dientes de ajo, finamente picados", "2 cucharadas de miel", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "¼ de coliflor blanqueada", "½ patata pelada, picada y blanqueada", "1 cucharadita de menta fresca picada", "1 cucharadita de perejil fresco picado", "sal y pimienta negra recién molida", "100 ml / 3½ fl oz de vino tinto", "2 cucharadas de miel", "1 cucharadita de menta fresca picada", "sal y pimienta negra recién molida"], "method": ["Remoje los dos pinchos de madera en agua durante 10 minutos.", "Para hacer los kebabs, coloque el cordero, el puerro, el aceite de oliva, el ajo y la miel en un tazón grande y mezcle. Sazonar con sal y pimienta negra recién molida.", "Pase el puerro y el cordero alternativamente en un pincho.", "Caliente una sartén hasta que fume. Agregue el kebab y cocine por dos minutos de lado, o hasta que el cordero esté bien cocido.", "Para hacer el puré, coloque el aceite de oliva, la coliflor, la patata, la menta y el perejil en un procesador de alimentos, sazone, sazone, con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "En una sartén hervir el vino, la miel, la menta y la sartén y reducir hasta que espese.", "Para servir, coloca el kebab en un plato con el puré al lado y vierte sobre la salsa de vino."], "url": "www_bbc_co_uk_food_recipes_lambandleekkebabswit_84163", "title": "Brochetas de cordero y puerro con puré de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "600g / 1lb 5oz de cordero, limpiado y cortado en trozos pequeños, con guarnición de grasa", "1 cucharadita de semillas de mostaza", "1 cebolla grande, finamente picada", "5 dientes de ajo grandes, pelados", "Jengibre de raíz 4 cm / 1½ en pieza, pelado", "sal al gusto", "1 cucharadita de azúcar", "1 cucharada de cilantro molido", "1 cucharada de comino molido", "½ cucharadita de cúrcuma molida", "¼-½ cucharadita de chile rojo en polvo, al gusto", "3 tomates, mezclados a un puré en un procesador de alimentos", "300ml / ½ pinta de agua", "Leche de coco 400ml / 14fl oz", "1-2 cucharaditas de jugo de limón, al gusto", "1 batata pequeña, pelada y cortada en trozos", "Garbanzos enlatados 250 g / 8oz, escurridos y enjuagados", "Harina de chapati 100g / 3½oz (o harina integral)", "45 g / 1½ oz de harina de garbanzo (harina de garbanzo)", "2 cucharadas de hojas de fenogreco seco picado, o 4 cucharadas de hojas de fenogreco fresco picado", "1½ cucharadita de jengibre recién rallado", "¾ cucharadita de sal", "¾ cucharadita de azúcar", "pizca de cúrcuma molida", "1 cucharada de jugo de limón", "2 cucharadas de aceite vegetal", "1/3 cucharadita de polvo de hornear", "puñado de cilantro fresco picado", "1¼ cucharadita de sal masala"], "method": ["Para el estofado, caliente el aceite en una sartén antiadherente a fuego medio. Agregue el cordero y fría por 3-4 minutos, volteándolo ocasionalmente, hasta que se dore por todos lados. Retire de la sartén y déjelo a un lado en un plato caliente.", "Agregue las semillas de mostaza a la misma sartén y fría por 30 segundos, o hasta que las semillas comiencen a reventar. (PRECAUCIÓN: mantenga la sartén lejos de la cara y los ojos.) Agregue la cebolla y fría por 3-4 minutos o hasta que se dore.", "Mientras tanto, en un procesador de alimentos, mezcle el ajo y el jengibre en una pasta, agregando un chorrito de agua para unir la mezcla.", "Agregue el ajo y la pasta de jengibre a las cebollas fritas y continúe cocinando durante 2-3 minutos, o hasta que el agua se haya evaporado de la pasta y se haya vuelto dorada.", "Agregue la sal, el azúcar, el cilantro molido, el comino molido, la cúrcuma molida y el chile rojo en polvo y cocínelos por otros 20-30 segundos.", "Agregue los tomates en puré y 100 ml / 3½ fl oz del agua, mezcle bien y lleve la mezcla a fuego lento. Cocine a fuego lento durante 6-8 minutos, revolviendo bien, o hasta que el volumen de líquido se haya reducido completamente y la salsa casi se haya secado.", "Mientras tanto, para las albóndigas de fenogreco, mezcle todos los ingredientes de albóndigas de fenogreco en un tazón hasta que estén bien combinados, luego junte la mezcla para formar una masa semi blanda.", "Con las manos, enrolle la mezcla en tres formas de salchicha y pellizque seis piezas de cada salchicha. Ruede los pedazos en bolas lisas. Dejar de lado.", "Cuando la salsa se haya reducido, agregue la leche de coco, el jugo de limón y el resto del agua. Continúe cocinando a fuego lento durante cinco minutos. Agregue la batata al estofado y vuelva a hervir. Reduzca a fuego lento y después de seis minutos, agregue las albóndigas. Cubra la olla con una tapa y continúe cocinando a fuego lento durante 6-7 minutos, o hasta que la papa esté tierna.", "Agregue el cordero y los garbanzos reservados a la sartén, cubra nuevamente y cocine durante 4-5 minutos más, o hasta que el cordero esté cocido a su gusto.", "Agregue el cilantro fresco y el garam masala justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_lambandfenugreekdump_90002", "title": "Estofado de dumplings de cordero y fenogreco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambandfenugreekdump_90002_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, pelada, finamente picada", "1 diente de ajo, pelado, aplastado", "450g / 1lb de cordero picado", "50 g / 2oz de pasas", "1 cucharadita de canela molida", "pellizcar clavos de tierra", "1 cucharada de menta fresca picada", "200g / 7oz de trigo bulgar, cocinado según las instrucciones del paquete", "6 tomates, picados", "2-3 berenjenas grandes", "100ml / 3½fl oz de aceite de oliva", "sal y pimienta negra recién molida", "Yogur de estilo griego", "hojas de menta fresca", "semillas de granada"], "method": ["Para el relleno de cordero y trigo bulgar, calentar el aceite de oliva en una sartén y freír la cebolla y el ajo durante 4-5 minutos, o hasta que estén blandos.", "Agregue el cordero y fría por otros 4-5 minutos, o hasta que se dore, luego agregue las pasas, la canela molida, los clavos molidos, la menta, el trigo bulgar y los tomates. Mezcle bien, luego retírelo del fuego y déjelo a un lado.", "Precalentar el horno a 180C / 355F / Gas 4.", "Para las berenjenas, coloque las berenjenas en la parte superior y la cola, luego corte cada una a la mitad para crear dos formas de cilindro por berenjena. Coloca cada pieza de berenjena en un extremo en una bandeja para hornear, y corta patrones entrecruzados en la parte superior. Cepíllese con el aceite de oliva, sazone con sal y pimienta recién molida y cocínelos durante 12-15 minutos en el horno, o hasta que se ablanden.", "Retire las berenjenas del horno. Usando un vaso pequeño ligeramente más pequeño que la circunferencia de las berenjenas, presione hacia abajo para ahuecar la berenjena (no presione hacia abajo completamente, de modo que la pulpa de berenjena quede compactada hacia el extremo inferior de la berenjena).", "Con una cuchara, coloque la mezcla de cordero y trigo bulgar en las berenjenas, empacando la mezcla con fuerza. Coloque de nuevo en el horno durante 4-5 minutos, para calentar.", "Para servir, coloque un trozo de berenjena rellena en cada plato de servir, y una cucharada de yogur griego al lado. Espolvorea sobre las hojas de menta y las semillas de granada."], "url": "www_bbc_co_uk_food_recipes_lambandbulgarwheatst_91834", "title": "Berenjenas rellenas de trigo de cordero y bulgar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz tipo '00' harina de pasta", "pizca de sal", "2 huevos de gallinas camperas", "3 yemas de huevo de gallinas camperas", "puñado de harina de sémola media, para quitar el polvo", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "375g / 13oz de cordero picado", "sal y pimienta negra recién molida", "4 cucharadas de menta fresca picada", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 zanahoria, finamente picada", "1 apio en barra, finamente picado", "4 dientes de ajo, picados", "Puré de tomate 150 g / 5 oz", "450ml / 15¾ fl oz de vino tinto", "450ml / 15¾fl oz de caldo de pollo", "2 ramitas de romero fresco", "virutas de parmesano, para servir"], "method": ["Para la pasta, coloca la harina, la sal, los huevos y las yemas de huevo en un procesador de alimentos y pulsa para formar una bola suelta de masa (es posible que debas pulsar la mezcla en lotes a menos que tengas un gran procesador de alimentos).", "Transfiera la masa a una superficie de trabajo limpia, espolvoreada con harina de sémola. Amase la masa durante unos tres minutos, o hasta que quede suave.", "Divida la masa en ocho bolas del mismo tamaño, envuélvala en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Retire la masa del refrigerador y pase cada bola por una máquina de pasta en la posición más gruesa. Repita este proceso y, después de cada pasada a través de la máquina, doble la hoja de pasta en tres y gírela 90 grados. Para pasta realmente sedosa, haz esto diez veces.", "Reduzca el indicador de la máquina de pasta al número cinco (o la configuración de su máquina para los ravioles) y vuelva a pasar la pasta por la máquina. (Puedes hacer esta pasta con un rodillo, pero no será tan delgada).", "Para el relleno, caliente el aceite de oliva en una sartén antiadherente y fríe con cuidado la cebolla y el ajo.", "Agregue el cordero picado, sazone bien con sal y pimienta negra recién molida y cocine durante 10-12 minutos, hasta que el cordero esté bien cocido y bien dorado.", "Agregue la menta picada y revuelva bien, luego póngalo a un lado para que se enfríe. Drene cualquier exceso de líquido o aceite de la sartén.", "Para la salsa, caliente el aceite de oliva en una sartén antiadherente limpia y fría la cebolla, la zanahoria, el apio y el ajo durante cinco minutos, hasta que estén suaves pero no coloreados.", "Agregue el puré de tomate a la sartén y cocínelo durante 5-6 minutos hasta que la mezcla se haya convertido en un color rojo intenso.", "Agregue las ramitas de vino tinto, caldo y romero a la sartén, deje que hierva, luego reduzca el fuego y cocine a fuego lento durante 40 minutos, hasta que espese.", "Para construir los raviolis, use un cortador de pasteles para cortar círculos de 7 cm en la lámina de pasta enrollada. Repita hasta que toda la pasta se haya agotado.", "Coloque un poco de la mezcla de cordero en el centro de un círculo de pasta y coloque otro círculo de pasta en la parte superior. Moje el borde de la pasta y presione hacia abajo para sellar (puede presionar con un tenedor para estar seguro). Repita este proceso con los círculos de pasta restantes hasta que se haya usado todo el relleno y la pasta.", "Para cocinar los ravioles, ponga a hervir un sartén grande de agua salada, coloque cuidadosamente los ravioles en agua hirviendo y cocínelos durante 3-4 minutos.", "Para servir, coloca cinco raviolis en cada plato. Cubra con un poco de la salsa y espolvoree con virutas de parmesano."], "url": "www_bbc_co_uk_food_recipes_lambandmintravioli_87250", "title": "Ravioles de cordero y menta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero de 500 g / 1 lb 2 oz, cortado en trozos", "1 cucharada de harina", "aceite vegetal", "1 cebolla, en rodajas", "sal y pimienta recién molida", "2 zanahorias, en rodajas", "350ml / 12fl oz de caldo de cordero", "500g / 1lb 2oz de papas, peladas, cortadas en cubos y sancochadas", "450g / 1lb listo pastelería brisa cocida", "huevo batido, glaseado"], "method": ["Polvore la carne con harina para cubrir ligeramente.", "Caliente suficiente aceite vegetal en una cacerola grande para llenar la base y fríe la cebolla y la carne hasta que estén ligeramente dorados. Condimentar con sal y pimienta.", "Agregue las zanahorias, el caldo y más condimentos al gusto.", "Llevar a ebullición, cubrir y reducir el fuego a fuego lento. Cocine a fuego lento durante al menos una hora o hasta que la carne esté tierna. Tómate tu tiempo para cocinar la carne, cuanto más la dejes cocinar, mejor será el sabor.", "Precalentar el horno a 180C / 350F / Gas 4.", "Agregue los cubos de papa escurridos al cordero.", "Convierta la mezcla en un plato para pastel o en una cacerola y cúbrala con la masa de copos. Haga tres ranuras en la parte superior de la masa para liberar el vapor mientras cocina.", "Cepille con huevo batido y hornee durante aproximadamente 40 minutos, hasta que la masa esté dorada.", "Servir."], "url": "www_bbc_co_uk_food_recipes_lambandpotatopie_83913", "title": "Pastel de cordero y patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de carne de cordero", "½ cebolla, pelada, finamente picada", "pizca de chile en polvo", "pizca de cayena", "1 cucharada de harina normal", "3 tallos de romero fresco", "1 cucharada de aceite de oliva", "3 cucharadas de yogur griego", "2 cucharadas de menta fresca picada", "sal y pimienta negra recién molida"], "method": ["Para las koftas de cordero, mezcle la carne picada de cordero, la cebolla, el chile en polvo, la pimienta de cayena y la harina en un bol.", "Retire las hojas de los tallos de romero, dejando algunas hojas en la punta. Con las manos mojadas, dé forma a la mezcla de cordero alrededor de los tres tallos de romero. Frote el aceite en el exterior de los koftas.", "Caliente una sartén a fuego alto y cocine las koftas, volteándolas frecuentemente, durante 4-5 minutos, o hasta que las koftas estén doradas y cocidas.", "Para la salsa de yogur, mezcle todos los ingredientes en un tazón y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque las koftas de cordero en un plato para servir con la salsa de yogur."], "url": "www_bbc_co_uk_food_recipes_lambandrosemarykofta_93001", "title": "Koftas de cordero y romero con salsa de yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 kg / 4 libras 6½ oz pierna de cordero de primavera", "Jamón de 200g / 7oz (como el jamón de Parma), cortado en tiras de 5mm / ¼ de grosor y 6cm / 2½ pulgadas de largo", "algunas ramitas de romero, 6cm / 2½ pulgadas de largo", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "100 g / 3½ oz de queso parmesano o pecorino recién rallado", "100g / 3½ oz de pan rallado fresco", "1½ vasos de vino blanco", "1½ vasos de agua", "5 cucharadas de aceite de oliva virgen extra", "Cebolla 300g / 10½oz, finamente picada", "100g / 3½oz de panceta, cortada en pequeños cubos", "500 g / 1 libra de 1½ oz de guisantes frescos, con cáscara de peso, o 500 g / 1 libra de 1½ oz de petits congelados", "300ml / 10½fl oz de caldo de verduras"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Para la pierna de cordero asada, coloque la pierna de cordero sobre una superficie de trabajo limpia o tabla de cortar.", "Con un cuchillo largo, delgado y afilado, haga muchas incisiones en toda la carne.", "Inserte las tiras de jamón y romero juntos profundamente en las incisiones dejando un poco fuera.", "Frote el aceite de oliva sobre el cordero y sazone con sal y pimienta, frotando bien.", "En un tazón, mezcle el queso parmesano o el pecorino y las migas de pan.", "Cuidadosamente espolvorea sobre la parte superior y el lado del cordero y presiona bien con tus manos para que la carne esté bien cubierta y las migajas no se caigan - si algunos lo hacen, solo agárralos y ponlos sobre la carne.", "Coloque cuidadosamente la carne en una lata de asar que se ajuste al cordero. Vierta el vino y el agua en el lado de la lata (no en la carne).", "Cubra con papel de aluminio y colóquelo en el horno precalentado durante aproximadamente dos horas y media, lo que le dará un cordero medio bien cocido. Cocine por menos tiempo si prefiere el cordero rosado.", "Durante la cocción, verifique de vez en cuando el contenido líquido; si es necesario, agregue más agua. Durante los últimos 10 minutos de tiempo de cocción, retire la lámina y aumente el calor a 200 ° C / 390 ° F / Gas 6 y ase hasta que la cubierta se ponga dorada y crujiente, pero tenga cuidado de no quemarse.", "Retirar del horno, cortar y servir. No olvides verter los jugos de cocina sobre las rodajas de cordero si lo deseas. Sirva con patatas asadas pequeñas Jersey con las pieles puestas, y los guisantes con panceta.", "Para los guisantes frescos con cebolla y panceta, caliente el aceite de oliva en una cacerola, agregue la cebolla y la panceta y saltee.", "Agregue los guisantes y sofría por un par de minutos. Agregue el caldo, lleve a ebullición, luego reduzca el fuego, cubra y cocine a fuego lento durante aproximadamente 20 minutos, revolviendo de vez en cuando.", "Después de este tiempo, la acción casi se habrá evaporado.", "Sirva inmediatamente o haga con anticipación y vuelva a calentar cuando sea necesario."], "url": "www_bbc_co_uk_food_recipes_lambbakedinacrustwit_74815", "title": "Cordero al horno en una corteza con guisantes, cebollas y panceta frescos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 5oz de cordero picado", "1 cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "1 cucharada de romero fresco finamente picado", "1 cucharada de menta fresca finamente picada", "2 cucharadas de aceite vegetal", "1 x pan de focaccia, cortado en trozos cuadrados de 6 x 10 cm / 4 in, a la parrilla", "2 cucharadas de aceite de oliva", "1 cebolla, en rodajas", "1 cucharada de pasta harissa de un tarro (disponible en la mayoría de los supermercados)", "1 x 400 g / 14 oz pueden garbanzos, enjuagados y drenados", "100 ml / 3½ fl oz oz yogur", "1 lima, solo jugo", "1 cucharada de menta fresca picada", "berros, para servir"], "method": ["Coloque el cordero picado, la cebolla roja, el ajo, el romero y la menta en un bol y mezcle bien.", "Divida la mezcla de carne picada en seis porciones iguales y moldee en empanadas.", "Caliente una sartén hasta que fume. Frote las empanadas con aceite y la plancha durante 5-6 minutos en cada lado, o hasta que estén completamente cocidas.", "Para la ensalada, caliente una cucharada de aceite de oliva en una sartén y fría la cebolla durante 5-6 minutos, hasta que se ablande. Transfiera a un tazón limpio.", "Agregue la pasta de harissa, los garbanzos, el yogur natural, el aceite de oliva restante, el jugo de lima y la menta al bol de cebollas fritas y mezcle bien.", "Para servir, coloque un trozo de focaccia a la parrilla en cada una de las seis placas. Cubra cada pieza con un pequeño puñado de berros.", "Coloque una hamburguesa de cordero encima de cada montón de berros, luego cubra con una cucharada de ensalada de garbanzos picante."], "url": "www_bbc_co_uk_food_recipes_lambburgerswithchick_89313", "title": "Hamburguesas de cordero con ensalada de garbanzos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz de cordero picado", "1 cebolla, finamente rallada", "3 dientes de ajo, triturados hasta formar una pasta", "50g / 2oz de guindas secas, picadas", "100g / 3½oz de piñones, ligeramente tostados y toscamente picados", "½ cucharadita de pimentón húngaro", "¼ cucharadita de pimienta de Jamaica molida", "½ cucharadita de comino molido", "1 clara de huevo de granja, ligeramente batida", "pequeño racimo de perejil fresco, finamente picado", "menta fresca de manojo pequeño, finamente picada", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal"], "method": ["En un tazón grande, mezcle el cordero picado, la cebolla, el ajo, las guindas, los piñones, el pimentón, la pimienta de Jamaica y el comino. Agregue la clara de huevo y vuelva a mezclar. Agregue las hierbas frescas picadas y sazone, al gusto, con sal y pimienta negra recién molida.", "Usando sus manos, dé forma a la mezcla en bolas del tamaño de una pelota de golf.", "Caliente el aceite en una sartén y fríe las albóndigas a fuego medio unas pocas a la vez, volteándolas ocasionalmente, durante diez minutos, o hasta que estén doradas por todos lados y completamente cocidas.", "Sirva las albóndigas calientes o a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_lambcherryandpinenut_88736", "title": "Albóndigas de cordero, cereza y piñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 12 como un sofá", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chuletas de cordero", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "1 tomate, semillas eliminadas, picadas", "½ limón, cáscara y jugo solamente", "2 cucharadas de hojas de albahaca fresca picada", "1 cucharada de perejil de flatleaf fresco picado, para servir"], "method": ["Para las chuletas de cordero, frote el cordero con aceite y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a la plancha y cocine las chuletas durante 4-5 minutos en cada lado, o hasta que se cocinen a su gusto. Retire del fuego y reserve para descansar durante cinco minutos.", "Para la salsa vierge, caliente el aceite en una olla pequeña y fría el ajo con el tomate durante un minuto.", "Retire del fuego, agregue la ralladura de limón y el jugo y agregue la albahaca.", "Para servir, coloque las chuletas en el centro de un plato de servir y rocíe sobre la salsa. Adornar con el perejil picado."], "url": "www_bbc_co_uk_food_recipes_lambchopswithsaucevi_87067", "title": "Chuletas de cordero con salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de cordero, en cubos", "1 cucharada de aceite", "½ cucharadita de vainas de cardamomo, aplastadas", "½ cucharadita de polvo de curry mediano", "½ cucharadita de comino seco", "½ cucharadita de semillas de cilantro, aplastadas", "2 dientes de ajo, aplastados", "½ cucharadita de cúrcuma seca", "300ml / 10½fl oz de carne de res o vegetales", "1 chile, picado", "75g / 2½ oz de yogur al estilo griego", "puñado de cilantro fresco, picado", "100g / 3½ oz de patatas nuevas, cocidas, opcional"], "method": ["Freír el cordero en el aceite con todas las especias durante 4-5 minutos en cada lado, hasta que esté dorado y cubierto.", "Vierta sobre la carne o el caldo de verduras y cocine durante 15 minutos revolviendo cada cierto tiempo.", "Para la salsa de yogur, mezcle el chile y el yogur de estilo griego y déjelos a un lado.", "Sirva el curry en un recipiente cubierto con el cilantro picado.", "Sirva con el yogur con especias y las papas nuevas, si lo desea."], "url": "www_bbc_co_uk_food_recipes_lambcurry_77792", "title": "Curry de Cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "Filete de cordero 900g / 2lb, cortado en cubos de 3cm / 1in", "2 cebollas, más o menos picadas", "3 dientes de ajo, pelados y triturados", "2 chiles verdes, finamente picados", "1 cucharada de jengibre fresco rallado", "1 cucharada de cúrcuma molida", "1½ cucharada de sal masala", "1½ cucharadas de comino molido", "1 cucharada de chile en polvo", "1 cucharada de harina normal", "6 tomates grandes, más o menos picados", "Leche de coco 400ml / 14fl oz", "600 ml / 1 pinta de caldo de pollo", "250 g / 9 oz hojas de espinaca bebé", "1 granada, sin semillas", "200g / 7oz de yogurt natural", "sal y pimienta negra recién molida", "arroz basmati al vapor, para servir"], "method": ["Caliente una cacerola grande y agregue una cucharada de aceite vegetal y luego el cordero. Cocine a fuego alto durante 3-4 minutos, o hasta que el cordero esté dorado por completo, luego retírelo y déjelo a un lado.", "Reduzca el fuego y agregue la cucharada restante de aceite vegetal. Agregue las cebollas, el ajo, los chiles y el jengibre y fría por 2-3 minutos, hasta que estén dorados y suaves.", "Agregue toda la cúrcuma, el garam masala, el comino y el chile en polvo y fría, revolviendo bien, durante un minuto.", "Agregue la harina y cocine por un minuto más.", "Agregue los tomates y la leche de coco y el calor para llevar a fuego lento.", "Agregue el cordero y suficiente caldo de pollo para cubrir el cordero. Revuelva bien, raspando el fondo de la sartén para desglasar y liberar cualquier residuo en el fondo de la sartén.", "Caliente la mezcla hasta que esté hirviendo a fuego lento, luego cubra y cocine a fuego lento durante aproximadamente una hora, o hasta que el cordero esté tierno y cocido.", "Elimine cualquier exceso de grasa de la superficie de la salsa, luego agregue la espinaca y la granada. Cocine por 1-2 minutos, hasta que la espinaca se haya marchitado.", "Agregue el yogur, condimente, al gusto, con sal y pimienta negra recién molida y mezcle bien.", "Sirva en platos calientes con arroz basmati al vapor al lado."], "url": "www_bbc_co_uk_food_recipes_lambcurrywithbasmati_84339", "title": "Cordero al curry con arroz basmati", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambcurrywithbasmati_84339_16x9.jpg", "isVegetarian": false, "recommendations": 0}]