[{"ingredients": ["3 claras de huevo de gallinas camperas", "150g / 5oz de azúcar glasé", "3 huevos de gallinas camperas", "Avellanas de tierra 150g / 5oz", "50g / 1¾oz de harina natural", "25g / 1oz de mantequilla sin sal, derretida, más extra para engrasar", "4 huevos de gallinas camperas", "Azúcar en polvo de 110 g / 4 oz", "Harina normal de 75g / 3oz", "25 g / 1 oz de cacao en polvo, tamizado", "25g / 1oz de mantequilla, derretida", "Crema doble de 1 litro / 1¾ pinta", "9 cucharadas de pasta de avellana", "50ml / 1¾fl oz de coñac", "250 g / 9 oz de azúcar en polvo", "5 claras de huevo de gallinas camperas", "1 limón, solo jugo", "Mantequilla 110g / 4oz, ablandada", "50ml / 1¾fl oz café fuerte frío", "3-5 pequeñas conchas de merengue", "9-15 pequeños malvaviscos", "2 cucharadas de cacao en polvo, para tamizar"], "method": ["Para las tortas de esponja, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase ligeramente y alinee la base de dos latas de torta sueltas de 25 cm / 10 pulgadas.", "Para la esponja de avellana, en un tazón limpio, bata las claras de huevo y 50 g / 1¾ oz del azúcar glas hasta que se formen picos rígidos cuando se quite la batidora.", "En un recipiente aparte, mezcle el azúcar glas restante y los huevos enteros hasta que estén espesos y de color pálido.", "Doble las avellanas molidas suavemente, tamice la harina y mezcle con la mantequilla derretida.", "Finalmente, dobla suavemente las claras de huevo batidas hasta que se incorporen.", "Coloque la mezcla en una de las latas de pastel preparadas, luego toque para eliminar las bolsas de aire.", "Coloque en el horno durante 16 minutos, o hasta que se haya levantado y firme al tacto.", "Retire del horno y deje enfriar brevemente antes de verter en una rejilla para que se enfríe por completo.", "Para la esponja de chocolate, coloque los huevos y el azúcar en un bol y bata durante 4-5 minutos, o hasta que estén espesos y muy pálidos.", "Tamice la harina y el cacao en polvo y agregue la mantequilla derretida. Doble suavemente la mezcla para combinar.", "Coloque la mezcla en la lata restante de la torta, luego toque para eliminar las bolsas de aire.", "Hornee en el horno durante 16 minutos, o hasta que se haya levantado y firme al tacto, no cocine demasiado esta esponja, ya que se secará.", "Retire del horno y deje enfriar brevemente antes de verter en una rejilla para que se enfríe por completo.", "Para la crema de avellana, en un tazón combine la crema y la pasta de avellana. Batir hasta que se formen picos suaves cuando se quite la batidora. Coloque en el refrigerador hasta que esté listo para usar.", "Para la crema de mantequilla de merengue con sabor a café, coloque el azúcar y 125ml / 4½fl de agua en una sartén y deje que hierva lentamente. Continúe calentando hasta que el almíbar alcance 110C / 230F en un termómetro de azúcar.", "Mientras tanto, coloque las claras de huevo en el tazón de un mezclador de alimentos (asegúrese de que esté escrupulosamente limpio) y agregue un chorrito de jugo de limón. Batir hasta que se formen picos firmes.", "Siga revisando la temperatura del almíbar y tan pronto como alcance los 121 ° C / 250 ° F, retire la sartén del fuego e inmediatamente continúe batiendo las claras de huevo.", "Con el batidor en su velocidad más baja, vierta el jarabe de azúcar, en un flujo lento y constante, asegurándose de que esté lejos del batidor (el almíbar está extremadamente caliente y podría salpicar del bol si golpea el batidor).", "Continúa latiendo durante unos cinco minutos, hasta que el merengue esté tibia.", "Agregue la mantequilla y continúe batiendo hasta que esté todo incorporado. Agregue el café frío y déjelo enfriar por completo.", "Para ensamblar el gateâu, corte horizontalmente cada bizcocho en tres capas para formar seis rebanadas delgadas.", "Coloque una capa de esponja en un plato de servir y rocíe una cucharada de coñac. Extiende sobre una capa delgada de crema de avellana.", "Cubra con otra capa de esponja, coñac y crema y repita con las esponjas restantes hasta que tenga una pila de seis esponjas llenas de cinco capas de crema.", "Para decorar, use un cuchillo de paleta para untar la crema de merengue con sabor a café alrededor de la torta y sobre la parte superior, terminando con un patrón de remolino.", "Use un poco de crema de mantequilla para pegar los malvaviscos a las conchas de merengue. Polvo con cacao en polvo, luego coloque en la parte superior de la torta en un pequeño racimo.", "Rebana y sirve."], "url": "www_bbc_co_uk_food_recipes_hazelnut_and_chocolate_41299", "title": "Avellana y chocolate gâteau", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de polvo de hornear", "250 g / 9 oz de azúcar en polvo", "3 huevos medianos de granja, golpeados", "200g / 7oz de avellanas picadas", "1 naranja grande, ralladura fina solamente"], "method": ["Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3 y alinee una bandeja grande para hornear con papel para hornear.", "Mezcle la harina, el polvo de hornear y el azúcar en un bol y agregue los huevos lentamente para hacer una masa. Mezcle las avellanas y la ralladura de naranja.", "En una superficie ligeramente enharinada, amase la mezcla con cuidado y divídala en 2. Enrolle en los troncos, cada uno de aproximadamente 25 cm de largo. Coloque en la bandeja de horno forrada y hornee durante 25 minutos.", "Retire del horno, deje que se enfríe un poco, luego corte cada tronco en 1½-2cm / ⅝-¾ en rebanadas gruesas. Coloque las rebanadas en la bandeja de horno.", "Regrese la bandeja al horno y hornee durante otros 5-7 minutos, voltee y continúe horneando por otros 5-7 minutos hasta que estén dorados. Retire del horno y deje enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_hazelnut_and_orange_24808", "title": "Biscotti de avellana y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 24-30 biscotti", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hazelnut_and_orange_24808_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de avellanas blanqueadas", "300 g / 10½ oz de azúcar en polvo", "25g / 1 oz de harina de maíz", "6 claras de huevo grandes de gallinas camperas", "pizca de sal", "150 g / 5% C2% BDoz% 20plain% 20chocolate,% 20 (alrededor de% 2035 %% 20cocoa% 20solids),% 20chopped", "Crema doble de 110ml / 3¾fl oz", "600ml / 20fl oz de leche entera", "3 yemas de huevo grandes de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "2 cucharadas de esencia de café Camp", "50g / 1¾oz de harina de maíz", "300 ml / 10 fl oz crema batida", "50 g / 1 oz de azúcar en polvo", "36 avellanas blanqueadas enteras", "½ cucharadita de jugo de limón", "100g / 3½oz de avellanas tostadas y picadas"], "method": ["Para el dacquoise, precaliente el horno a 180 ° C / ventilador 160 ° C / 350 ° F / Gas 4. Incline las avellanas blanqueadas en el tazón de un procesador de alimentos y pulse hasta que se muele grueso. Extienda las nueces en una capa en una lata de asar y hornee durante 10-12 minutos o hasta que estén doradas, revolviendo cada tres minutos.", "Retire del horno, transfiera a un recipiente grande y deje enfriar. Cuando esté frío, agregue 100 g / 3½ oz del azúcar impalpable y la harina de maíz.", "Reduzca la temperatura del horno a 150 ° C / 130 ° C (ventilador) / Gas 2.", "Línea tres bandejas para hornear con papel pergamino y, utilizando un pequeño plato de la cena como una guía, dibujar un círculo de 21 cm / 8¼ pulgadas de diámetro en cada uno. Dejar de lado. Coloque con cuidado las parrillas del horno en el tercio superior, medio e inferior del horno.", "Haga el merengue vertiendo las claras de huevo en el tazón limpio de un mezclador independiente equipado con el accesorio batidor. Agregue la sal y bata a velocidad media durante unos dos minutos, o hasta que estén blancos y espumosos. Aumente la velocidad y agregue el azúcar impalpable restante de 200 g / 7 oz, una cucharada a la vez, para hacer un merengue rígido, brillante y puntiagudo. Doble suavemente la mezcla de avellanas molidas a través del merengue.", "Coloque la mezcla de merengue en una bolsa de plástico grande con una boquilla plana de 1,5 cm / ⅝in y coloque el merengue en forma de espiral comenzando en el centro de cada círculo y trabajando hacia afuera para llenar su plantilla.", "Hornee durante una hora, girando las bandejas superior e inferior a la mitad de la cocción. Vigile los merengues hacia el final de la cocción ya que pueden atrapar y oscurecerse demasiado. Apague el horno y déjelo enfriar en el horno, con la puerta abierta, durante al menos 45 minutos.", "Para el ganache de chocolate, coloque el chocolate picado en un recipiente resistente al calor. Vierta la crema en una sartén y caliente hasta que hierva a fuego lento. Quítate el fuego y vierte la crema sobre el chocolate. Revuelva hasta que la mezcla esté suave. Enfríe, luego coloque en la nevera para enfriar hasta que esté espeso. Coloque la ganache en una manga pastelera equipada con una boquilla de estrella mediana. Dejar de lado. (Si el ganache es demasiado rígido, deje que alcance la temperatura ambiente y bata con una cuchara de madera hasta que tenga una consistencia suave).", "Para el relleno de crema de café, caliente la leche en una sartén de base pesada y deje hervir a fuego lento. Mientras tanto, en un tazón mediano, mezcle las yemas de huevo, el azúcar impalpable y el café y la esencia de achicoria. Agregue la harina de maíz, una cucharada a la vez. Vierta la leche caliente sobre la mezcla de huevo, batiendo continuamente, luego vierta de nuevo en la sartén. Llevar a ebullición, batiendo continuamente, reducir el fuego y hervir a fuego lento, batiendo durante 2-3 minutos, o hasta que quede suave y muy espeso. (Debe usar un batidor durante este proceso ya que la mezcla se espesará de repente y formará grumos). Retire del fuego y deje enfriar durante al menos una hora.", "Batir la crema batida en un bol hasta que se formen picos suaves cuando se quite la batidora del bol. Dobla la mitad de la mezcla de café enfriada en la crema, agregando tanto como sea necesario para formar una consistencia extensible.", "Para el praliné de avellana, forre una bandeja para hornear con papel de hornear antiadherente. Derrite el azúcar en polvo en una sartén pequeña hasta que se torne dorado o alcance 300C / 572F en un termómetro de azúcar. Agregue las avellanas y el jugo de limón, mezcle bien e incline sobre la bandeja para hornear forrada. Usando dos cucharaditas y trabajando rápidamente antes de que se forme el caramelo, forme 12 racimos de praliné de tres avellanas cada uno para decorar.", "Para ensamblar el dacquoise, coloque una de las capas de merengue en un plato de servir grande y plano y extiéndalo con un tercio del relleno de crema de café. Coloque otra capa de merengue encima y extiéndala con otro tercio del relleno de crema de café. Cubra con la capa final de merengue y esparza el relleno de crema de café restante en los lados del dacquoise, dejando la parte superior al descubierto. Presione las avellanas picadas rostizadas en los lados del dacquoise para cubrir. Pipe 12 remolinos de ganache de chocolate en la parte superior de la dacquoise y decorar con el praliné de avellana."], "url": "www_bbc_co_uk_food_recipes_hazelnut_dacquoise_98875", "title": "Dacquoise avellana", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hazelnut_dacquoise_98875_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz nuevas patatas", "un poco de aceite de oliva", "200g / 7oz de avellanas picadas", "150 g / 5½ oz de mantequilla"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Corta aproximadamente las patatas nuevas en cuartos, pero en ángulos extraños.", "Calentar un chorrito de aceite de oliva en un plato de horno. Agregue las papas y dorelas en el fogón a fuego moderado.", "Corta bastante las avellanas.", "Caliente la mantequilla en una sartén hasta que esté casi en un color marrón nuez.", "Vierta la mantequilla sobre las papas y mezcle las avellanas.", "Hornee en el horno durante una hora y media o hasta que las papas estén crujientes y doradas."], "url": "www_bbc_co_uk_food_recipes_hazelnut_potatoes_32836", "title": "Patatas avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva", "1 chalote, pelado, finamente cortado", "75g / 2½oz de mantequilla, suavizada", "½ limón, solo ralladura", "1 cucharada de perifollo fresco finamente picado", "1 cucharada de cebollines frescos finamente picados", "45 g / 1½ oz de avellanas, finamente picadas", "sal y pimienta negra recién molida", "6 vieiras, limpiadas", "½ cucharada de mostaza integral", "½ cucharada de vinagre de vino blanco de buena calidad", "1½ cucharadas de aceite de colza de buena calidad", "1 lechuga Little Gem, hojas separadas", "1 brotes de guisantes"], "method": ["Para las vieiras, caliente una sartén hasta que esté tibia, agregue el aceite de oliva y la chalota, y freír suavemente hasta que se ablanden pero no se coloreen.", "Coloque la mantequilla en un recipiente y agregue la chalota cocida, junto con todos los ingredientes restantes de vieiras, excepto las vieiras. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar bien.", "Precalentar la parrilla a alto.", "Coloque las vieiras en una bandeja de parrilla y cubra cada vieiras con una cucharada de la mantequilla de avellana. Coloque debajo de la parrilla durante 3-4 minutos o hasta que esté completamente cocida. Retire de la parrilla y déjela reposar por un minuto.", "Para la ensalada, mezcle la mostaza, el vinagre y el aceite en un tazón. Coloque las hojas de lechuga y los brotes de guisantes en un recipiente, rocíe sobre el aderezo y revuelva para cubrir.", "Para servir, coloque tres vieiras en cada uno de los 2 platos y sirva con una pila de ensalada."], "url": "www_bbc_co_uk_food_recipes_hazelnutbuttergrille_89237", "title": "Mantequilla de avellana, vieiras a la plancha con ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hazelnutbuttergrille_89237_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 claras de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100g / 3½oz de avellanas tostadas sin cáscara, picadas", "220 g / 8 oz de azúcar en polvo", "100g / 3½oz de avellanas sin cáscara", "Crema doble 500ml / 18fl oz", "1 vaina de vainilla, semillas retiradas", "25 ml / 1 fl oz de café", "50g / 1¾oz de azúcar glas, tamizado", "Crema doble 500ml / 18fl oz", "175g / 6oz demerara azúcar", "175g / 6oz de mantequilla", "1 cucharada de jarabe de oro", "1 cucharada de melaza negra"], "method": ["Para el merengue, precaliente el horno a 100C / 200F / Gas ½. Línea dos bandejas para hornear con pergamino para hornear.", "Coloque las claras de huevo en un recipiente y bata hasta que se formen picos suaves cuando se quite el batidor. Poco a poco agregue el azúcar y continúe batiendo hasta que esté tieso y brillante. Doblar a través de las avellanas picadas rostizadas.", "Coloque la mezcla en una bolsa de plástico con una boquilla pequeña y lisa. Dibuje círculos de 18 x 7,5 cm / 3 pulgadas de diámetro en el pergamino para hornear en las bandejas para hornear. Pipe el merengue en espiral para llenar cada círculo.", "Transfiera al horno y cocine durante 20 minutos, luego apague el horno pero deje los merengues allí durante al menos dos horas. Cuando estén crujientes, retírelos del horno y déjelos enfriar por completo.", "Para la crema de café y praliné, ponga el azúcar en una sartén y caliente. Cocine hasta que el azúcar se haya derretido y se haya caramelizado hasta obtener un color dorado.", "Agregue las nueces al caramelo y agite para combinar y cubrir las nueces con caramelo.", "Vierta la mezcla de caramelo y nueces en una bandeja para hornear bien engrasada y alineada, deje enfriar y deje reposar. Una vez establecido, retire la mezcla y divídala en trozos pequeños.", "Coloque la crema en un tazón grande y bata hasta que se formen picos suaves cuando se quite la batidora. Agregue la vainilla, el café, el azúcar glas y casi todo el praliné, dejando un poco para la parte superior, y mezcle.", "Para la salsa toffee, vierta la crema en una sartén y caliente suavemente. Agregue el azúcar y la mantequilla y bata hasta que se derrita. Agregue el jarabe y la melaza.", "Para servir, coloque un disco de merengue en cada una de las seis placas de servir. Extender un poco de la mezcla de praliné y crema sobre ellos y luego un poco de salsa. Cubra con otro merengue y la crema restante y un poco de salsa, y luego termine con un tercer merengue. Adorne con el praliné restante y la salsa restante."], "url": "www_bbc_co_uk_food_recipes_hazelnut_merginue_with_82129", "title": "Merengue de avellana con crema de praliné de café y avellana", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de mostaza", "1 cucharada de vinagre de vino blanco", "2 cucharadas de aceite de cacahuete", "2 cucharadas de aceite de oliva", "1 cucharadita de perejil picado", "Avellanas enteras despellejadas 25g / 1oz, cortadas áspero", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "20g / ¾ de mantequilla", "2 x 150 g / 5½ oz de filetes de cordero (del mejor final de cordero)", "1 cucharadita de mostaza", "1 cucharada de vino blanco", "Avellanas enteras peladas de 25g / 1oz, finamente picadas", "50g / 2oz de mantequilla", "350g / 12oz de patatas nuevas en la piel, cocidas y en rodajas", "Chalotes 50g / 2oz, finamente picados", "75g / 2½ hojas de ensalada suave"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el aderezo, coloque la mostaza, el vinagre de vino blanco, el aceite de cacahuete, el aceite de oliva y el perejil en un bol y mezcle bien. Agregue las avellanas picadas, revuelva y sazone bien con sal y pimienta negra recién molida.", "Mientras tanto, para el cordero, caliente una sartén hasta que esté caliente, luego agregue el aceite y la mantequilla. Una vez que la mantequilla esté espumante, agregue el cordero y fría por 1-2 minutos, hasta que se dore. Retire de la sartén y deje enfriar.", "Mezcle la mostaza y el vino blanco en un tazón, luego cepille la mezcla sobre el cordero para cubrir uniformemente.", "Extiende las avellanas finamente picadas en una bandeja para hornear y coloca el cordero recubierto de mostaza en las avellanas para cubrirlas.", "Coloque el cordero recubierto en una rejilla de alambre en una bandeja de asar y colóquelo en el horno para asar durante 8-10 minutos, hasta que esté rosado (cocine durante más tiempo según su preferencia). Retire del horno y descanse durante cinco minutos.", "Para las papas salteadas, caliente una sartén hasta que esté caliente y agregue la mantequilla y las papas. Saltee las papas, volteándolas de vez en cuando, hasta que estén doradas.", "Agregue los chalotes picados y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque las papas en el centro de un plato. Corta el cordero y ponte encima de las papas. Sazonar las hojas de ensalada con el aderezo de avellana y colocar al lado."], "url": "www_bbc_co_uk_food_recipes_hazelnutcrustedlambs_83755", "title": "Cordero con corteza de avellana, patatas nuevas salteadas y aderezo de avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla", "Harina normal de 55g / 2oz", "250 g / 9 oz de azúcar en polvo", "8 huevos grandes, separados", "Avellanas de 250 g / 9 oz, asadas, sin cáscara y molidas", "250g / 9oz de queso ricotta", "4 cucharaditas de cáscara de limón rallada", "12 cucharadas de mermelada de albaricoque", "2 cucharadas de agua, para mezclar con mermelada", "chocolate amargo, rallado", "mascarpone", "azúcar en polvo"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Engrasar y enharinar una lata de torta antiadherente redonda de 25 cm / 10 in.", "En un tazón grande, bata la mantequilla y la mitad del azúcar. Agregue las yemas de huevo y continúe batiendo hasta que estén suaves y esponjosas. Dobla la harina tamizada.", "En un tazón separado, bata ligeramente la ricotta con un tenedor, agrega las avellanas molidas y la cáscara de limón. Agregue esto a la mezcla de huevo y harina.", "En otro recipiente bata las claras de huevo hasta que estén firmes. Dobla el resto del azúcar. Doble la mezcla de ricotta con mucho cuidado.", "Vierta la mezcla en la lata de pastel engrasada y enharinada y hornee durante 30-40 minutos. Dejar enfriar, retirar de la lata y colocar en un plato.", "Para hacer el glaseado, coloque el atasco con el agua en una sartén pequeña sobre un poco de calor para diluirlo hasta obtener una consistencia suave y bastante líquida.", "Cepille sobre la parte superior de la torta y espolvoree con el chocolate rallado.", "Sirva con crema de mascarpone endulzada si lo desea."], "url": "www_bbc_co_uk_food_recipes_hazelnutcake_14048", "title": "Pastel de avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 costillas de cordero de marisma de sal x 400g / 14oz, recortadas", "sal y pimienta negra recién molida", "110g / 4oz de mantequilla", "Avellanas de 110 g / 4 oz, más o menos picadas", "1 cucharadita de romero fresco finamente picado", "2 cucharaditas de mostaza inglesa", "Frijoles corredores de 300g / 11oz, cortados y rebanados", "2 cucharadas de menta fresca picada", "2 cucharadas de cebolletas frescas picadas", "puré de papa, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar el cordero con sal y pimienta negra recién molida. Caliente una sartén hasta que esté humeando, luego agregue la mitad de la mantequilla a la sartén. Cuando la mantequilla esté espumosa, agregue las almejas de cordero y dore por todos lados durante 2-3 minutos, o hasta que se doren por todas partes. Retire de la sartén y reserve.", "Coloque las avellanas y el romero en un procesador de alimentos y pulse hasta que la mezcla se asemeje a migas de pan finas. Incline la mezcla en un plato. Cepille el cordero de manera uniforme con la mostaza, luego enrolle las avellanas para cubrir todo.", "Vuelva a colocar el cordero en la sartén y colóquelo en el horno durante 12-15 minutos (a fuego medio) o hasta que esté cocido a su gusto. Retire el cordero y déjelo reposar durante cinco minutos.", "Caliente la mantequilla restante en una sartén limpia hasta que forme espuma, luego agregue los frijoles a la sartén. Vierta suficiente agua para cubrir los frijoles, luego cocine a fuego lento y cocine por 3-4 minutos, o hasta que los frijoles estén tiernos y la mayor parte del líquido se haya evaporado. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar la menta picada y el cebollín.", "Para servir, esculpe el cordero en rodajas gruesas. Coloque el puré de patatas en el centro de cada plato y cubra cada montículo con unas rodajas del cordero. Coloque los frijoles al costado, luego rocíe sobre cualquiera de los jugos de pan para cocinar el cordero."], "url": "www_bbc_co_uk_food_recipes_hazelnutcrustedrumpo_91647", "title": "Corteza a la avellana de cordero de marisma con judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de puré de papa (sin leche ni mantequilla)", "1 huevo de gallinas camperas, golpeado", "4 cucharaditas de aceite de avellana", "Avellanas de 50 g / 2 oz, pieles eliminadas, asadas y picadas, más 8 avellanas enteras, para servir", "100g / 3½ oz tipo harina '00', más extra para quitar el polvo", "Sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "Setas girolle 300g / 11oz, limpiadas", "5 ramitas de tomillo, solo hojas", "2 chalotes grandes, en rodajas finas", "200 ml / 7 fl oz de caldo de pollo marrón caliente o caldo de verduras", "50g / 2oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "4 huevos de pato de gallinas camperas", "Pequeños brotes de perejil puñado (opcional)", "100 g / 3½ oz de queso parmesano, rallado"], "method": ["Para los ñoquis de avellana, en un bol, mezcle el puré de patata, el huevo batido, el aceite de avellana y las avellanas picadas hasta que estén bien combinados.", "Poco a poco agregue la harina de pasta, unas cuantas cucharadas a la vez, mezclando bien después de cada adición para que la harina se incorpore por completo a la mezcla.", "Sazonar, al gusto, con sal y pimienta negra recién molida.", "Usando sus manos, junte la mezcla como una masa. Convierta la masa en una superficie de trabajo ligeramente enharinada, amasar brevemente y enrollar a un espesor de 2 cm / ¾ pulg.", "Corta los gnocchi en pedazos de 1cm / ½, luego aplasta cada pieza ligeramente con un tenedor, haciendo una hendidura en la parte superior.", "Poner a hervir una olla de agua con sal. Con cuidado, baje los gnocchi en el agua en lotes y vuelva a hervir el agua. Una vez que los gnocchi hayan subido a la superficie del agua, cocínelos durante 2-3 minutos, luego escurra bien y vuelva a ponerlos en agua fría.", "Caliente la cucharada de aceite de oliva en una sartén a fuego alto, agregue los ñoquis hervidos y fría por 2-3 minutos más, revolviendo ocasionalmente, hasta que estén dorados por todos lados. Apartar y mantener caliente.", "Para la salsa, en una sartén separada, caliente el aceite de oliva a fuego medio, agregue las setas girolle y las hojas de tomillo y sazone, al gusto, con sal y pimienta negra recién molida. Freír por 2-3 minutos, o hasta que los champiñones se ablanden y estén dorados.", "Agregue las chalotas y fría por otros 2-3 minutos.", "Agregue el caldo y la mantequilla y lleve la mezcla a fuego lento. Cocine a fuego lento durante 1-2 minutos, o hasta que la mantequilla se haya derretido y el volumen del líquido se haya reducido ligeramente. Sáquelo del fuego y apártelo.", "Para los huevos, en una sartén separada, caliente el aceite de oliva a fuego medio, agregue los huevos de pato y fríalos por 2-3 minutos, o hasta que estén crujientes y dorados por debajo y suaves en la parte superior, o hasta que estén cocidos a su gusto. gusto.", "Para servir, divide los ñoquis de avellana entre los cuatro cuencos de servir. Pon la salsa encima. Coloque uno de los huevos de pato encima de cada porción de gnocchi. Espolvoree sobre las avellanas tostadas enteras reservadas. Adornar con los brotes de perejil, si se usa, y parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_hazelnutgnocchiwithg_89861", "title": "Ñoquis de avellana con girolles, huevos crujientes de pato frito y parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de vinagre de vino blanco", "4 cucharadas de azúcar", "½ cucharada de semillas de cilantro", "1 repollo chino", "3 zanahorias", "2 manojos de rábanos", "4 pechugas de pollo", "rociar aceite de oliva", "1 cucharada de condimento tirón", "sal marina y pimienta negra recién molida", "4 envolturas de pan plano"], "method": ["Caliente el vinagre de vino blanco, el azúcar y las semillas de cilantro en una olla grande hasta que el azúcar se disuelva. Mientras tanto, triture el repollo chino, corte las zanahorias en cerillas y corte los rábanos. Una vez que el azúcar se disuelve en el vinagre, retirar del fuego y verter sobre el repollo y las zanahorias. Déjalo encurtido por 10 minutos.", "Caliente una sartén grande en la placa. Marque las pechugas de pollo cortando a la mitad de la parte más gruesa del pecho y ábralas.", "Ponga una pequeña llovizna de aceite de oliva en un recipiente y espolvoree en el condimento. Masajee el condimento del aceite y el tirón en el pollo. Condimentar con sal y pimienta. Cuando la sartén de la plancha esté caliente, coloque el pollo en la plancha y cocínelo durante 3-4 minutos por cada lado, o hasta que esté cocido. Retire el pollo del fuego, cúbralo y déjelo a un lado para que descanse.", "Escurra las verduras y corte el pollo en tiras. Envuelva dentro de los panes planos."], "url": "www_bbc_co_uk_food_recipes_healthy_fast_food_34900", "title": "Envolturas saludables de pollo jerk", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de levadura seca activa", "Harina de espelta blanca de 285g / 9¼ oz, más extra para espolvorear", "½ cucharadita de sal rosa del Himalaya", "1 cucharada de aceite de oliva", "1 cebolla picada", "1 diente de ajo, finamente picado", "2 cucharadas de alcaparras, enjuagadas y escurridas", "pizca de copos de chile seco", "Tomates 300g / 10½ oz, sin grano y finamente picados", "1 cucharada de orégano fresco o 1 cucharadita de orégano seco", "2 corazones de alcachofa enlatados, en rodajas finas", "2 hojas de albahaca, ralladas", "20g / ¾oz de mozzarella de búfala, desgarrada en trozos pequeños", "15g / ½ oz de calabacín, en rodajas finas", "3 tiras de corteza de limón, finamente cortadas", "15g / ½ oz de queso feta, desmenuzado", "10g / 1 / 3oz de hinojo, en rodajas finas", "15 g / ½ oz de batata, finamente rebanada", "Queso duro de cabra de 6 g / ¼ oz, rallado", "3 dientes de ajo, asados ​​y exprimidos de las pieles", "7g / ¼ oz de remolacha, finamente cortada", "10g / ½ oz de queso feta, desmenuzado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las bases, mezcle la levadura con 170 ml / 6 fl oz de agua tibia, cúbralo y déjelo a un lado en una sala tibia durante aproximadamente 15 minutos.", "Mientras tanto, prepara la salsa. Caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo hasta que la cebolla comience a suavizarse. Agregue un chorrito de agua para enfriar y luego agregue los ingredientes restantes. Cocine a fuego lento durante 15 minutos, o hasta que espese. Dejar de lado hasta que esté listo para construir las pizzas.", "Para las bases, mezcle la levadura y la mezcla de agua y reserve por otros cinco minutos.", "Coloque la harina de espelta y la sal en un tazón grande. Haga un pozo en el centro y vierta la mezcla de levadura. Mezcle para combinar y luego sobre una superficie de trabajo ligeramente enharinada y amasar durante 5-10 minutos hasta que quede suave y sedoso al tacto, agregando un poco más de harina si es necesario.", "Divida la masa de pan en ocho pedazos, enrolle cada pieza en una bola y colóquela en una bandeja para hornear forrada con pergamino para hornear y aplaste en un círculo. Unta un poco de salsa de tomate, seguido de tu elección de coberturas y hornea por cinco minutos. Gire y hornee por otros cinco minutos o hasta que la base esté crujiente."], "url": "www_bbc_co_uk_food_recipes_healthy_mini_pizzas_72831", "title": "Mini pizzas sanas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 8 mini pizzas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthy_mini_pizzas_72831_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["salpicar aceite de oliva", "Tocino rayado de 200 g / 7oz o tocino de respaldo magro, corteza retirada, finamente picada", "2 zanahorias grandes, peladas y picadas", "6 tallos de apio, cortados y picados", "6 dientes de ajo, en rodajas finas", "2 cebollas, más o menos picadas", "2 papas, como las patatas Maris Peer, cortadas aproximadamente", "1 cucharada de puré de tomate", "400g de tomates cortados en lata", "1 bouquet garni", "0.75 litros / 1 pinta de verduras con sal reducida en sal", "3 calabacines, recortados y toscamente picados", "1 gran pasta de sopa puñado", "1 puñado de perejil fresco de flatleaf, hojas finamente picadas", "100 g / 3½ oz de queso parmesano, finamente rallado"], "method": ["Caliente el aceite en una cacerola grande a fuego medio. Agregue el tocino y fría por 2-3 minutos, o hasta que esté cocido y comenzando a dorarse.", "Agregue las zanahorias, el apio, el ajo y las cebollas y fría por 4-5 minutos. Agregue las papas y fría por 4-5 minutos, revolviendo ocasionalmente, hasta que se ablanden.", "Agregue el puré de tomate y cocine durante 1 minuto, luego agregue los tomates, bouquet garni y caldo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 30 minutos.", "Agregue los calabacines y la pasta de sopa y vuelva a hervir. Reduzca el fuego, cubra la olla con la tapa y cocine a fuego lento de 5 a 8 minutos o hasta que la pasta esté tierna. Deseche el ramo garni.", "Para servir, ponga la sopa en cuencos, espolvoree sobre el perejil y el parmesano."], "url": "www_bbc_co_uk_food_recipes_healthy_minestrone_soup_64571", "title": "Sopa saludable de minestrone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthy_minestrone_soup_64571_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 2 oz patatas harinosas, como King Edward, peladas y cortadas en chips gruesos", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 240C / 220C Fan / Gas 9.", "Hierva las virutas en agua ligeramente salada durante 4 minutos, luego escurra bien en un colador. Cuando estén lo suficientemente fríos para manipularlos, colóquelos en una bandeja para hornear y vierta sobre el aceite. Mezcle para cubrir las virutas en el aceite, luego colóquelas en una sola capa y sazone con sal y pimienta.", "Hornea por 20 minutos. Dale la vuelta a las patatas fritas, sazona otra vez, luego hornea por 15 minutos más."], "url": "www_bbc_co_uk_food_recipes_healthy_oven_chips_82256", "title": "Chips de horno saludable", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthy_oven_chips_82256_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1-2 pechugas de pollo sin piel, sin huesos", "1 cucharada de aceite de oliva, más extra para frotar", "2 dientes de ajo, finamente picados", "pizca de copos de chile", "1 cucharada de puré de tomate", "300 g / 10½ oz de tomate pasado", "sal marina y pimienta negra recién molida", "Pasta de penne de trigo integral 200 g / 7 oz", "200 g / 7 oz de brócoli, cortado en trozos del tamaño de un bocado", "125 g / 4½ oz de espinacas baby, lavadas (opcional)", "½ manojo de albahaca, hojas recogidas (opcional)", "1-2 cucharadas de parmesano finamente rallado (opcional)"], "method": ["Cuidadosamente, corte la pechuga casi a la mitad horizontalmente, sin cortar del otro lado. Mantenga ese borde intacto y abra el pecho como si estuviera abriendo un libro. Esto hará que la carne tenga un grosor uniforme para garantizar una cocción rápida y uniforme.", "Caliente una cacerola grande a fuego medio-bajo. Agregue el aceite de oliva a la sartén. Una vez caliente, agregue los copos de ajo y chile y cocine durante dos minutos, luego mezcle el puré de tomate y cocine por dos minutos más. Agregue la passata a la sartén, sazone con pimienta, revuelva para mezclar bien y reduzca el fuego a fuego lento. Deje hervir a fuego lento mientras prepara el resto del plato.", "Ponga a hervir una olla grande de agua con sal, agregue la pasta y cocine según las instrucciones del paquete. Agregue el brócoli tres minutos antes del final de la cocción. Escurrir bien", "Mientras tanto caliente una sartén a fuego alto hasta que fume. Frote el pollo con un poco de aceite y sazone con un poco de sal y pimienta, luego cocine por 3-5 minutos por cada lado. Reserve para descansar durante cinco minutos antes de cortar en trozos del tamaño de un bocado.", "Agregue la pasta cocida y el brócoli a la sartén con la salsa de tomate (si la salsa se ha espesado demasiado al hervir a fuego lento y luego agregue un poco de agua caliente de la pasta). Revuelva para mezclar bien y luego agregue el pollo cocido y en rodajas a la plancha, la espinaca y las hojas de albahaca recogidas (si se usa). Sazonar de nuevo con abundante pimienta negra y dejar que la espinaca y la albahaca se marchiten. Espolvorear con queso parmesano, si se usa, y servir."], "url": "www_bbc_co_uk_food_recipes_healthy_penne_with_04395", "title": "Penne saludable con pollo y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthy_penne_with_04395_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz jumbo avena", "2 cucharadas de miel líquida", "pizca de sal", "2 cucharaditas de aceite (como girasol, maíz, colza o aceite de oliva liviano)", "½ cucharadita de canela molida", "1kg / 2lb 4 oz de ciruelas maduras, partidas en dos y empedradas (si se desea, aunque no es esencial)", "50g / 1¾oz de azúcar en polvo de oro", "Anís de 2 estrellas", "1 naranja mediana, ralladura y jugo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Combine todos los ingredientes para el relleno en un tazón grande y luego extiéndalos en una capa uniforme sobre una bandeja para hornear antiadherente. Hornee durante 15-20 minutos, o hasta que estén crujientes y doradas, agitando y revolviendo la mezcla ocasionalmente para asegurar una cocción pareja. Retirar del horno y reservar para enfriar.", "Mientras tanto, combine los ingredientes de relleno en una cacerola grande o en una sartén de base pesada con tapa. Cocine a fuego alto durante 3-4 minutos hasta que el azúcar se haya disuelto. Reduzca el fuego, cubra y cocine a fuego lento durante aproximadamente siete minutos, o hasta que las ciruelas se ablanden pero aún conserven su forma. Retire el anís estrellado y deséchelo.", "Divida las ciruelas cocidas entre los tazones para servir calentados, espolvoree la granola y sirva."], "url": "www_bbc_co_uk_food_recipes_healthy_plum_crumble_52799", "title": "Crumble de ciruelas sanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthy_plum_crumble_52799_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "200 g / 7 oz de carne magra picada", "1 cebolla, finamente picada", "4 champiñones grandes, en rodajas", "1 zanahoria, rallada", "1 400 g / 14 oz de tomates de hojalata picados", "230ml / 8fl oz de caldo de verduras", "2 cucharadas de puré de tomate", "½ cucharadita de salsa Worcestershire", "1 cucharadita de pimienta negra recién molida", "Espagueti de trigo integral 300 g / 10½ oz", "2 cucharadas de perejil fresco picado"], "method": ["Caliente el aceite de oliva en una cacerola grande a fuego medio. Agregue la carne picada y la cebolla y fría por cinco minutos, revolviendo ocasionalmente, hasta que la carne picada se dore y la cebolla se ablande.", "Agregue los champiñones y la zanahoria, cocine por alrededor de un minuto, luego agregue los tomates en lata, caldo de verduras, puré de tomate, salsa Worcestershire y pimienta negra recién molida. Revuelva bien y lleve a ebullición, luego reduzca el fuego a fuego lento durante 15-20 minutos, hasta que la salsa se haya espesado.", "Coloque los espaguetis integrales en una cacerola profunda llena de agua hirviendo con sal y cocine según las instrucciones del paquete, luego escurra.", "Para servir, divida los espaguetis cocidos entre cuatro platos, ponga a cucharadas porciones iguales de salsa boloñesa sobre cada uno y espolvoree con perejil."], "url": "www_bbc_co_uk_food_recipes_healthyspaghettibolo_80401", "title": "Saludables espaguetis a la boloñesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthyspaghettibolo_80401_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de cacahuete", "8 langostinos grandes, desvenadrados, sin cáscara (dejando colas), cabezas retiradas", "1 cucharada de jengibre fresco rallado", "1 chile rojo, sin semillas y finamente picado", "½ cebolla, picada", "50g / 2oz de piña en conserva, escurrida y picada", "100ml / 3fl oz de jugo de piña", "1 pequeño puñado de pimiento rojo y amarillo picado", "1 pequeño puñado de brotes de soja frescos", "sal y pimienta negra recién molida", "½ lima, solo jugo", "miel, al gusto", "1 cebolleta, finamente rebanada", "arroz jazmín al vapor, para servir"], "method": ["Caliente un wok hasta que esté humeando, luego agregue dos cucharadas de aceite de cacahuate. Agregue las gambas y saltee durante 3-4 minutos, o hasta que las gambas estén rosadas y recién cocidas. Retire del wok y reserve.", "Calienta el aceite restante en el wok. Agregue el jengibre y el chile y saltee por 30 segundos. Agregue las cebollas y saltee durante 2-3 minutos, o hasta que estén blandos.", "Mientras tanto, coloque la piña y el jugo de piña en un procesador de alimentos y mezcle hasta obtener un puré suave. Vierta el puré en el wok y cocine a fuego lento durante 1-2 minutos. Agregue los pimientos picados y los brotes de soja y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida, jugo de limón y miel.", "Regresa las gambas al wok y remueve la salsa. Espolvorea sobre las cebolletas.", "Para servir, coloque cantidades iguales de salteado en dos platos y sirva con arroz jazmín cocido al vapor."], "url": "www_bbc_co_uk_food_recipes_healthysweetandsourk_89268", "title": "Salteado de langostinos sanos y agridulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/healthysweetandsourk_89268_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de caldo de verduras calientes", "100g / 3½oz de fideos de huevo secos (u otros fideos secos)", "75 g / 2½ oz de tofu, picados en cubos", "1 cucharada de salsa de soja", "1 guindilla roja, picada", "25 g / 1 oz de jengibre, picado", "3 setas, en rodajas", "1 lima, solo jugo", "1½ cucharadas de aceite de sésamo", "2 cucharadas de cilantro picado, para servir"], "method": ["Coloque el caldo de verduras en una cacerola y deje que hierva. Agregue los fideos y cocine por dos minutos.", "Agregue el tofu, la salsa de soja, el chile, el jengibre, los champiñones, el jugo de lima y el aceite de sésamo y cocínelos durante cinco minutos.", "Para servir, transfiera el caldo a un tazón de servir y adorne con el cilantro."], "url": "www_bbc_co_uk_food_recipes_healthytofubroth_84492", "title": "Caldo de tofu saludable", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "125g / 4½oz de chorizo ​​'picante', sin membrana exterior, finamente picado", "6 muslos de pollo deshuesados ​​y sin piel, toscamente picados", "½ cucharadita de pimentón picante ahumado", "5 dientes de ajo, finamente picados", "2 ramitas de romero fresco, hojas finamente picadas", "2 x 400g latas de frijoles flageolet, escurridos y enjuagados", "800ml / 1pt 8 fl oz de caldo de pollo", "150ml / 5fl oz de crema doble", "50g / 2oz de mantequilla", "1 manojo pequeño de perejil fresco de hojaldre, hojas ásperamente picadas", "sal y pimienta negra recién molida", "500g / 1lb 2 oz de trigo y pan de centeno, en rodajas, para servir"], "method": ["Caliente la mitad del aceite en una sartén grande a fuego medio. Cuando la sartén esté caliente, agregue la cebolla y el chorizo ​​y fría por 2-3 minutos, revolviendo bien.", "Agregue el pollo y fría por otros 2-3 minutos, luego agregue el pimentón ahumado, el ajo y el romero y agregue los frijoles hasta que estén bien combinados.", "Vierta el caldo y la crema, agregue la mantequilla y revuelva hasta que se derrita, luego lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 4-5 minutos, o hasta que el pollo esté bien cocido.", "Agregue el perejil y sazone, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén a fuego medio hasta que esté caliente. Rocíe el aceite restante en cada lado de las rebanadas de pan. Tueste el pan durante 1-2 minutos en cada lado, hasta que aparezcan marcas marrones.", "Vierte el caldo en tazones y sirve con la tostada."], "url": "www_bbc_co_uk_food_recipes_hearty_chicken_and_08628", "title": "Caldo abundante de pollo y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hearty_chicken_and_08628_16x9.jpg", "isVegetarian": false, "recommendations": 0}]