[{"isVegetarian": false, "title": "Japanese seafood hotpot with miso vegetables", "url": "www_bbc_co_uk_food_recipes_japanese_seafood_hotpot_53471", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp soy sauce ", "2 tbsp mirin", "2 tbsp lemon juice ", "1 tbsp Bonito flakes (available online)", "1 thumb-sized piece dried kelp (kombu) (available online)", "100g/3½oz raw prawns, shelled", "2 scallops", "150g/5½oz salmon fillet, skinned and cut into bite-sized pieces", "150g/5½oz halibut fillet, skinned and cut into bite-sized pieces", "150g/5½oz sea bass fillet, skinned and cut into bite-sized pieces", "150g/5½oz red mullet fillet, skinned and cut into bite-sized pieces ", "handful shiitake mushrooms ", "handful dried Wood Ear mushrooms ", "200g/7oz oyster mushrooms ", "1 Chinese cabbage, thinly sliced", "2 carrots, thinly sliced", "200g/7oz purple sprouting broccoli ", "bunch spring onions, thinly sliced", "40g/1½oz dried dulse seaweed (available online), rehydrated in water and drained, to garnish", "3 tbsp white miso paste ", "2–3 tbsp runny honey", "3 tbsp mirin", "3 tbsp sunflower oil", "1 lemon, juice only", "1 aubergine, diced  ", "1 head broccoli, broken into small florets ", "1 tbsp sesame seeds, to garnish"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Make the dipping sauce by mixing together all the ingredients in a bowl. Cover and leave to steep for 24 hours.", "To make the miso vegetables, preheat the oven to 200C/180C Fan/Gas 6.", "Mix together the miso paste, honey, mirin, oil and lemon juice.", "Toss the aubergine and broccoli with the miso dressing in a large roasting tin. Roast for 30 minutes, then scatter over the sesame seeds.", "Meanwhile, to make the seafood hotpot, bring 400ml/14fl oz water to the boil and add the dried kelp. Set aside for an hour. ", "Put the seafood and vegetables in a serving dish. Strain the stock and pour it back into the pan. Bring back to the boil, drop in the seafood and vegetables, then remove from the heat and set aside for 15 minutes, or until the seafood is cooked through. Garnish with the seaweed.", "Serve the hotpot with the miso vegetables and dipping sauce. "]}, {"isVegetarian": true, "title": "Japanese-style glazed squash", "url": "www_bbc_co_uk_food_recipes_japaneseglazedsquash_77646", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ squash, chopped", "1 tbsp olive oil", "2 cloves garlic, crushed", "1 tsp soy sauce", "150ml/5fl oz vegetable or chicken stock", "1 tsp sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the squash in a pan with the oil, garlic, soy, chicken stock and sesame oil.", "Cover the pan and bring to the boil. ", "Once boiling point is reached, turn down and simmer for eight minutes or until softened. Remove the lid and finish cooking on high for 1-2 minutes or until the squash has a glazed appearance."]}, {"isVegetarian": true, "title": "Japanese vegetable stir-fried noodles (Yasai yaki soba)", "url": "www_bbc_co_uk_food_recipes_japanesevegetablesti_92442", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/japanesevegetablesti_92442_16x9.jpg", "ingredients": ["100ml/3½fl oz ready-made teriyaki sauce", "4½ tbsp ready-made crushed yellow bean sauce ", "1 lemongrass stalk, tough outer leaves removed, soft inner core crushed and finely sliced ", "1 tbsp freshly grated root ginger", "200g/7oz soba noodles", "2 free-range eggs, beaten", "½ green pepper, seeds removed, sliced", "½ red pepper, seeds removed, sliced", "1 onion, peeled, thinly sliced", "8 spring onions, trimmed, sliced", "10 mushrooms, sliced ", "2 garlic cloves, peeled, finely chopped", "handful fresh bean sprouts", "4 tbsp ready-made teriyaki sauce ", "3 tbsp vegetable oil", "½ tsp sesame seeds, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the yaki soba dressing, bring the teriyaki sauce, yellow bean sauce, lemongrass and ginger to the boil in a small pan, stirring well. ", "Reduce the heat until the mixture is just simmering, then continue to simmer for 8-10 minutes, or until the mixture has thickened. Set aside until ready to serve. ", "Meanwhile, for the noodles, cook the noodles in a large pot of boiling water for 2-3 minutes, or until just tender. Drain well, then refresh under cold running water until the noodles are completely cold. ", "In a bowl, mix together the eggs, peppers, onion, spring onions, mushrooms, garlic and bean sprouts until the vegetables are coated in the eggs. Stir in the teriyaki sauce until well combined. ", "Heat the oil in a wok over a medium heat. Add the egg and vegetable mixture and the cooked, cold noodles, and stir-fry for 3-4 minutes, or until the noodles have warmed through and the eggs and vegetables are cooked through. ", "To serve, divide the vegetables and noodles equally between two serving bowls. Drizzle over the yaki soba dressing. Sprinkle over the sesame seeds, if using."]}, {"isVegetarian": true, "title": "Japanese tofu, aubergine and lotus root stew", "url": "www_bbc_co_uk_food_recipes_japanese_tofu_aubergine_65332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fresh lotus root (medium size, about 400g/14oz)", "500ml/18fl oz vegetable oil, plus a little extra for cooking ", "flaked sea salt", "shichimi togarashi (Japanese seven-spice seasoning) ", "4 tbsp rice flour (or cornflour if none available)", "2 pieces firm tofu, about 375g/13oz, cut into 2.5cm/1in squares", "2 tbsp sesame oil", "1 medium onion, finely chopped", "2 medium leeks, trimmed, washed and sliced into 1cm/½in diagonal slices", "2 Japanese aubergine, cut into 2cm/¾in discs (alternatively you can use a normal aubergine cut into 2cm/¾in discs)", "4 garlic cloves, finely grated", "2 tbsp finely grated ginger ", "150g/5½oz brown shimeji mushrooms, trimmed ", "2 tbsp heaped miso paste ", "4 tbsp mirin", "5 tbsp soy sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of water to the boil. Peel the lotus root, cut off a third and set it aside. Add the rest of the lotus root to the pan. Turn the heat down and cook the root for 30 minutes at a very gentle simmer. Make sure you cook the root immediately after peeling as it will darken quickly. If preparing it in advance, put the lotus root in water with a little vinegar. Canned lotus root does not need preparing in this way and can be added straight to the stew.", "Finely slice the remaining third of the root on a mandolin or, using a very sharp knife, thinly to use it to make crisps.", "For the lotus root crisps, heat a wok or deep-fat fryer with 500ml/18fl oz of vegetable oil to about 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the thinly sliced lotus root in two or three batches for about five minutes, or until golden-brown. Remove with a slotted spoon and drain on a plate lined with kitchen paper. Season with salt and shichimi togarashi and set aside. ", "Carefully pour the hot oil out of the wok you used for the crisps, reserving about five tablespoons in the bottom.", "Sprinkle the rice flour onto a plate and coat the tofu evenly. Heat the oil in the wok and fry the tofu in a couple of batches on a medium heat, turning until lightly golden-brown, slightly crispy and a little puffy - this will take about eight minutes.  Drain on a plate lined with kitchen paper to absorb the excess oil, and keep warm.", "Clean the wok and add the sesame oil and two tablespoons of fresh vegetable oil. Fry the onion for a few minutes, add the leeks and cook until soft and just slightly golden-brown. Add the sliced aubergine and cook for further six minutes, or until soft.", "Add the grated garlic and the grated ginger.  Fry again for a further couple of minutes stirring continuously, so that the garlic doesn't burn.", "Cut the cooked lotus root into 5mm slices and add it to the onion and aubergine mixture. Tip in the shimeji mushrooms, add two heaped tablespoons of miso paste and fry for a minute.  Add the mirin, soy sauce and 300ml/10fl oz of boiling water.", "Bring back to the boil, and carefully fold in the tofu.  Place into serving bowls and top with the lotus root crisps."]}, {"isVegetarian": false, "title": "Jasmine tea-smoked trout with spelt salad and wasabi dressing", "url": "www_bbc_co_uk_food_recipes_jasmine_tea_smoked_trout_52946", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz raw spelt", "300ml/10fl oz chicken stock", "2 x 150-200g/5½-7oz trout fillets, skin on pin-boned", "200g/7oz jasmine tea", "1 fillet smoked eel, cut into very thin strips", "150g/5½oz edamame beans, beans removed from their pods", "150g/5½oz fresh peas, removed from their pods", "1 punnet pea shoots, stalks removed", "2 tbsp chopped fresh coriander", "100ml/3½fl oz sour cream", "¼ tsp wasabi"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spelt place the stock and spelt into a saucepan and cook according to the packet instructions. Drain and leave to cool.", "For the trout, put some tin toil in the bottom of a smoker and spread the jasmine tea on top of the foil. Put the fish on a rack over the tea. Cook for 4-8 minutes until the fish is cooked through.", "Mix together all the salad ingredients and the cooked spelt in a large bowl. Mix together the sour cream and wasabi to make the dressing.", "To serve, serve the salad in the centre of the plate and top with the smoked trout, pieces if smoked eel and a little dressing."]}, {"isVegetarian": false, "title": "Barbecue ribs", "url": "www_bbc_co_uk_food_recipes_jennysbarbecuesparer_70172", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jennysbarbecuesparer_70172_16x9.jpg", "ingredients": ["12 pork spare ribs", "2 tbsp olive oil", "1 onion, finely chopped", "2 x 400g cans chopped tomatoes", "3 garlic cloves, finely chopped", "50g/2oz light muscovado sugar", "4 tbsp malt vinegar", "3 tbsp Worcestershire sauce", "1 tbsp tomato purée", "2 tsp Chinese five spice powder", "1 tsp ground cumin", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sauce, heat the oil in a saucepan and add the onion. Fry for 3-4 minutes, until softened, then stir in the rest of the ingredients. Mix well and bring to the boil. Reduce the heat and simmer gently for about 30 minutes, stirring occasionally, until thickened.", "Place the ribs on the barbecue and cook for 10-15 minutes, depending on the thickness of the meat. Brush the ribs liberally with the barbecue sauce every few minutes, until they have a thick, sticky coating, and serve."]}, {"isVegetarian": false, "title": "Jerk chicken and flatbreads", "url": "www_bbc_co_uk_food_recipes_jerk_chicken_and_20341", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerk_chicken_and_20341_16x9.jpg", "ingredients": ["8 boneless chicken thighs, skin on (if possible)", "5 Scotch bonnet chillies, seeds removed ", "1 bunch spring onions, thinly sliced", "50g/1¾oz fresh coriander, roughly chopped", "1 lime, juice only", "2 tbsp palm sugar or soft light brown sugar", "1 tbsp soy sauce", "1 tbsp ground allspice", "5 garlic cloves, roughly chopped", "1 tbsp dark rum", "10–12 sprigs fresh thyme, leaves only", "½ tbsp ground cinnamon", "2cm/¾in fresh root ginger, roughly chopped", "splash fresh orange juice", "3 tbsp vegetable oil, or enough to make a smooth paste", "salt and freshly ground black pepper", "50g/1¾oz butter, softened, cut into pieces", "180ml/6fl oz whole milk", "300g/10½oz plain flour, plus extra for dusting", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put the jerk paste ingredients in a food processor and blend until smooth, using enough oil and orange juice to create a thick paste. Smother the chicken in the paste, cover and leave in the fridge for at least 2 hours, or preferably overnight.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To make the flatbreads, beat the butter and milk together in a bowl. Slowly mix in the flour and ½ teaspoon salt until you have a dough consistency.", "Knead the dough on a lightly floured work surface until smooth. Wrap in cling film and chill in the fridge for 30 minutes.", "Meanwhile, place an ovenproof griddle pan over a high heat and cook the chicken on both sides until browned. Transfer the pan to the oven and bake for 40 minutes. ", "Place the rested dough on a lightly floured work surface and divide into quarters. Roll each quarter out to 3mm thick.", "Using a heavy-based frying pan or skillet, heat a little oil over a medium heat and add a flatbread. Cook for 1–2 minutes on each sides, or until you reach your desired level of crispness. Serve the chicken with the warm flatbreads."]}, {"isVegetarian": false, "title": "Jerk chicken and salad wraps", "url": "www_bbc_co_uk_food_recipes_jerk_chicken_and_salad_67570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 spring onion, finely chopped", "1 tbsp finely chopped fresh thyme", "1 tsp ground allspice or ground pimento", "1 tsp honey", "1 tsp soy sauce", "1 tsp vegetable oil", "½ tsp roughly chopped fresh garlic", "2 tsp roughly chopped scotch bonnets", "4 boneless chicken thighs, skin on", "4 ready-made rotis", "olive oil, for rubbing", "salt and freshly ground black pepper", "½ iceberg lettuce, shredded", "large handful rocket ", "1 x 198g tin sweetcorn, drained", "½ fresh coconut, flesh grated", "15 cherry tomatoes, halved ", "200g/7oz tin kidney beans, drained", "75g/2½oz red cabbage, shredded", "75g/2½oz white cabbage, shredded", "75g/2½oz carrots, peeled and grated", "1 tbsp finely chopped flatleaf parsley", "4-5 tbsp mango purée", "100ml/3½fl oz mayonnaise"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the jerk chicken, put the spring onion, thyme, allspice, honey, soy sauce, vegetable oil, garlic and chilli in a food processor and blend into a thick paste. Season with salt and pepper. ", "Put the chicken thighs in a large bowl and rub generously with the paste. Cover and leave to marinate in the fridge overnight. ", "Preheat a barbecue or griddle pan to high and rub the chicken thighs with a little olive oil. Cook the thighs for 10–15 minutes on each side, until  golden-brown, slightly charred and cooked through. Rest the chicken for 2–3 minutes and cut into slices.", "Meanwhile mix together the salad ingredients in a bowl. Put the coleslaw ingredients in another bowl and mix to combine. In a third bowl, mix together the mango purée and mayonnaise. ", "Heat the rotis in a hot frying pan or on the barbecue, until they colour and puff up on both sides. ", "Place the warm rotis on four plates. Put some  salad and coleslaw in the middle of each roti. Top with the jerk chicken, drizzle with the mango sauce, wrap and eat. "]}, {"isVegetarian": false, "title": "Jerk chicken, rice and pea cakes and slaw", "url": "www_bbc_co_uk_food_recipes_jerk_chicken_rice_and_99370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely chopped", "1 spring onion, finely chopped", "½ Scotch bonnet chilli, seeds removed, finely chopped", "2.5cm/1in piece of root ginger, grated", "1 tsp ground cinnamon", "1 tsp ground allspice", "2 tsp mixed herbs", "1 tsp salt", "1 tsp black pepper", "3 tbsp all-purpose seasoning", "1 tsp nutmeg", "2 garlic cloves, crushed", "2 tbsp chopped dried thyme leaves", "2 limes, juice only", "1 whole chicken, spatchcocked", "dash olive oil", "50g/1¾oz butter", "4 spring onions, finely chopped", "1 garlic clove, peeled but left whole", "¼ scotch bonnet chilli, finely diced", "2 sprigs fresh thyme", "250g/9oz risotto rice", "600ml/1 pint chicken stock", "200g/7oz fresh peas", "50g/1¾oz parmesan, grated", "2 tbsp olive oil", "2 medium free-range eggs, yolks only", "1 tsp Dijon mustard", "2 tbsp white wine vinegar", "300ml/10½fl oz sunflower oil", "1 celeriac, peeled and thinly sliced", "2 large carrots, peeled and thinly sliced", "1 lemon, juice only", "1 tbsp Dijion mustard", "2 tbsp chopped fresh chives"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the jerk chicken, preheat the oven to 200C/400F/Gas 6.", "Place all the ingredients for the jerk spice mix in a blender and blend until you have a rough paste.", "Spread the mixture all over the chicken and leave to marinade for at least an hour.", "Heat a large griddle pan, drizzle a little oil over the chicken and place skin-side down on the griddle. Cook for five minutes, turn over and place in the oven for 40-45 minutes, or until cooked through.", "For the rice and pea cakes, heat a large pan and add the butter. Add the onion, cook for a couple of minutes and then add the garlic, chilli and thyme and cook for a further minute.", "Add the rice and stir to coat the rice. Gradually add the stock a little at a time until all the stock has gone and you have a creamy risotto. Finish by adding the fresh peas and parmesan.", "Allow to go cold and then set aside in the fridge.", "To make the rice and pea cakes, heat a large frying pan and add the oil. Once hot take a tablespoon of cold risotto and shape into a small cake the size of a fish cake and fry for a couple of minutes each side.  ", "For the slaw, add the egg yolks to a small food processor and add the mustard and vinegar. Start the motor on the processor and gradually add the oil a little at a time to make mayonnaise.", "Place the sliced celeriac and carrot in a large glass bowl and add the mayonnaise, lemon juice, mustard and chives. ", "To serve carve the chicken into portions and place on a plate with the rice and pea cakes and slaw."]}, {"isVegetarian": false, "title": "Jerk pork belly with fresh pea and potato mash-up", "url": "www_bbc_co_uk_food_recipes_jerk_pork_belly_with_99669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz pork belly, rind removed", "1 tbsp dry jerk seasoning", "300ml/10fl oz dry cider", "475ml/17fl oz chicken stock", "1 onion, sliced into 1cm/½in rings", "4 garlic cloves, sliced", "4 sprigs fresh thyme", "sea salt and freshly ground black pepper", "hot pepper sauce, to serve", "675g/1lb 8oz new potatoes, scraped or scrubbed", "100ml/3½fl oz extra virgin olive oil", "225g/8oz fresh shelled peas"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Rub the pork belly with the jerk seasoning and place in a heavy-based frying pan, fat-side down. Cook for a few minutes until golden-brown then quickly sear on all sides to seal. Remove the pan from the heat and leave to rest for about five minutes.", "Pour the cider into a large jug with the chicken stock. Place the onion rings in a roasting tin and scatter over the garlic and thyme. Lay the rested pork belly on top, skin-side up, and pour the cider mixture around the meat. Season to taste with sea salt and freshly ground black pepper. Cover with tin foil and braise in the oven for 2½-3 hours, or until the pork is tender and completely soft.", "Remove the foil and turn the oven up to 230C/450F/Gas 8. Roast the meat for another 20-25 minutes until lightly crisp and golden-brown. Remove from the oven and set aside to rest.", "Meanwhile, place the potatoes in a large pan of salted water and bring to a boil. Cover and simmer for 12-15 minutes until tender then drain well. Tip the drained potatoes into a large bowl and gently crush each potato with the back of a fork until it just splits. Drizzle over the oil, season with sea salt and freshly ground black pepper and mix carefully until all the oil has been absorbed.", "Meanwhile, cook the peas in a separate pan of boiling, salted water for 3-4 minutes until tender then drain well. Mix the peas through the crushed potatoes and season to taste with sea salt and freshly ground black pepper. Arrange the mash-up on plates with slices of the pork belly. Serve at once with hot pepper sauce."]}, {"isVegetarian": false, "title": "Jerk lamb with chilli butternut squash and apple salad", "url": "www_bbc_co_uk_food_recipes_jerk_lamb_with_chilli_14546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp ground allspice", "½ tsp salt", "2 garlic cloves, crushed", "1 scotch bonnet chilli, seeds removed, finely chopped", "2 tsp chopped fresh thyme leaves", "2 tsp freshly ground black pepper", "½ tsp ground cinnamon", "¼ tsp cayenne pepper", "2 tbsp vegetable oil", "2 lamb fillets, fully trimmed", "4 tbsp vegetable oil", "2 spring onions, finely sliced", "½ tsp ground allspice", "2 green chillies, seeds removed, finely chopped", "1 sprig fresh thyme, leaves picked", "400g/14oz butternut squash, peeled, cut into 1cm/½in cubes", "1 tbsp caster sugar", "2 limes, juice only", "½ mango, peeled, finely chopped", "4 tbsp chopped fresh coriander", "4 tbsp fresh chopped fresh mint", "salt and freshly ground black pepper", "1 crisp apple, core removed, very finely sliced", "vegetable oil, for shallow frying", "salt", "1 tbsp English mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "1 frisée lettuce head, inner yellow leaves only, torn into small pieces", "1 pomegranate, seeds only", "2 tbsp coriander cress", "2 tbsp red amaranth cress"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the jerk lamb, blend all of the ingredients, except the lamb, in a food processor to a purée.", "Spread the mixture over the lamb until completely covered and set aside to marinate in the fridge for at least four hours. Remove the lamb from the fridge and allow to come to room temperature.", "Preheat the oven to 200C/400F/Gas 6.", "Heat an ovenproof frying pan until hot, add the lamb and fry on both sides until browned.", "Roast in the oven for 10-12 minutes (for medium), then remove and set aside to rest for 10 minutes.", "For the chilli butternut squash, heat the oil in a lidded frying pan and fry the spring onions, allspice, chillies and thyme for 1-2 minutes, or until the onion has just softened.", "Add the butternut squash and fry for 4-5 minutes, or until pale golden-brown.", "Cover the pan with a lid and continue to cook for 3-4 minutes, or until just softened.", "Add the sugar, lime juice and mango and cook for another 2-3 minutes, or until tender and slightly sticky.", "Stir in the coriander and mint and season with salt and freshly ground black pepper.", "For the apple salad, heat 1cm/½in of vegetable oil in a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "For the apple salad, fry the apple slices in the vegetable oil for 1-2 minutes, or until crisp. Remove with a slotted spoon, drain on kitchen paper and season with a little salt. (You may need to cook the apple slices in batches.)", "Whisk the mustard, vinegar and olive oil together in a bowl and season with salt and freshly ground black pepper.", "Mix the frisée leaves, pomegranate seeds and apple slices together in a bowl. Add some of the dressing and stir until well combined.", "To serve, spoon the butternut squash into the centre of the plate. Carve the lamb into thick slices and place a few slices across the pumpkin. Pile a little salad on top of the lamb and finish with a scattering of coriander and amaranth cress."]}, {"isVegetarian": false, "title": "Jerk pork chops with rice and peas", "url": "www_bbc_co_uk_food_recipes_jerk_pork_chops_with_68968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["bunch spring onions, roughly chopped", "1–2 scotch bonnet chillies, depending on how hot you want it, seeds removed", "6 garlic cloves", "5cm/2in piece fresh root ginger, chopped", "large sprig thyme, leaves only", "2 tbsp red wine vinegar", "2 tbsp vegetable oil", "2 tbsp soft dark brown sugar", "1 tbsp allspice berries, crushed", "1 tsp ground cinnamon", "1 tsp ground smoked paprika", "freshly grated nutmeg", "1 tsp freshly ground black pepper ", "4 large pork chops (preferably a fatty, on-the-bone cut)", "1 tsp salt", "1 tbsp vegetable or coconut oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 sprig thyme", "400g/14oz long grain rice", "100ml/3½fl oz coconut cream", "200g/7oz frozen gungo peas "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the marinade, put all the marinade ingredients into a food processor or blender, except the pork and salt, and blend until you have a fairly liquid paste. Put the pork chops in a bowl and season with the salt, then pour over the marinade. Cover and leave for at least a couple of hours, preferably overnight. If you are leaving the meat overnight, transfer it to the fridge.", "When you are ready to cook the chops, either heat your grill to medium-high or prepare a barbecue. Grill the chops on each side for 3–5 minutes on each side, depending on their thickness, then leave to rest for a few minutes.", "For the rice and peas, heat the oil in a large saucepan or casserole. Add the onion, and fry until soft and translucent. Add the garlic, thyme and rice and stir until the rice looks glossy. ", "Add 700ml/1¼ pint of water and the coconut cream, along with a generous amount of seasoning. Bring to the boil, cover, and reduce the heat to a low simmer. Cook for 10 minutes, then stir in the gungo peas. ", "Cook for a further 5 minutes, then remove from the heat and leave covered for another 10 minutes. Fluff up, and serve with the pork."]}, {"isVegetarian": false, "title": "Jerk pork with sweet potato mash and salsa", "url": "www_bbc_co_uk_food_recipes_jerk_pork_with_sweet_40784", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerk_pork_with_sweet_40784_16x9.jpg", "ingredients": ["2 tsp jerk seasoning", "1½ tsp runny honey", "100ml/3½fl oz pineapple juice (from 227g tin pineapple rings)", "300g/10½oz pork tenderloin", "1 tsp olive oil", "1 x 350g/12oz sweet potato, peeled and cut into 3cm/1¼in pieces", "2 tinned pineapple rings (about 100g/3½oz), drained and finely chopped", "3 spring onions, thinly sliced", "2 tbsp roughly chopped fresh coriander leaf", "½ lime, juice only", "1 tsp olive oil", "½ red chilli, deseeded and finely diced", "pinch salt"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the jerk seasoning, honey and pineapple juice in a shallow bowl large enough to hold the pork. Add the pork loin and place in the fridge, covered, for at least 30 minutes or overnight, turning the pork over a couple of times.", "Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with kitchen foil.", "Remove the meat from the marinade, reserving the liquid, and pat it dry with kitchen paper. Heat the oil in a frying pan over a high heat. Brown the meat on one side, turn over and brown on the other side.", "Place the meat in the baking tray, pour over the marinade and roast for 20–25 minutes, turning the pork over after 15 minutes. Cut into the thickest part of the steak to check that it is juicy but cooked through.", "Meanwhile, bring a saucepan of lightly salted water to the boil and simmer the sweet potato for 15 minutes until tender. Drain, mash and season with salt and pepper.", "To make the salsa, mix the pineapple, spring onion, coriander, a squeeze of lime juice, olive oil, chilli and salt together in a bowl and set aside for at least 10 minutes.", "Turn the meat over in its reduced marinade and leave to rest for 5 minutes. Cut the pork into 2cm/¾in-thick slices and serve with the mash and salsa."]}, {"isVegetarian": false, "title": "Jerk chicken", "url": "www_bbc_co_uk_food_recipes_jerkchicken_10680", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerkchicken_10680_16x9.jpg", "ingredients": ["6 chicken breasts, or chicken thighs, bones removed", "225g/8oz onions, quartered", "1-1½ scotch bonnet or other chillies according to taste, halved and seeded", "50g/2oz root ginger, peeled and chopped roughly  ", "½ tsp ground allspice", "small bunch fresh thyme, leaves only", "1 tsp freshly ground black pepper", "120ml/4fl oz white wine vinegar", "120ml/4fl oz dark soy sauce ", "rice and peas", "1 pineapple, peeled, cored and cut in wedges", "4 limes, 3 cut in wedges, 1 juice only"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put all the ingredients for the Jerk Sauce in a food processor and whiz until smooth.", "Place the chicken in a large shallow dish, pour over the sauce, cover and leave to marinate in the fridge overnight.", "On a hot griddle cook the chicken for 25-30 minutes, basting now and then with the leftover sauce. As it cooks, the thick sauce will go quite black in places, but don't worry, as it falls off it will leave behind a really well flavoured, crisp skin, with lovely moist tender meat underneath.", "Brush the pineapple lightly with oil and char grill until golden brown on all sides. Squeeze over the juice of one lime.", "Serve the jerk chicken with the rice and peas, pineapple and wedges of lime on the side. "]}, {"isVegetarian": false, "title": "Jerk chicken salad", "url": "www_bbc_co_uk_food_recipes_jerkchickensalad_83636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch spring onion, sliced finely ", "handful flatleaf parsley ", "1 tsp chilli flakes", "1 lime, juice only", "1 tsp mixed spice", "2 chicken breasts, boneless, skinless, sliced thickly", "2 tbsp olive oil", "1 bag salad leaves", "1 tbsp white wine vinegar", "100g/3oz mixed seeds and nuts"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place half the spring onion into a bowl with the flatleaf parsley, chilli flakes, lime and mixed spice. Using a hand blender, blend until smooth.", "Toss the chicken into the bowl and stir to coat.", "Heat a frying pan until hot, then add one tablespoon of olive oil and the chicken and stir fry for 2-3 minutes.", "Add the rest of the spring onions and cook for a further two minutes.", "Meanwhile, toss the salad leaves with the olive oil and vinegar and place on a serving plate.", "Add the chicken and scatter over the nuts. Serve."]}, {"isVegetarian": false, "title": "Jerk chicken with pomegranate rice", "url": "www_bbc_co_uk_food_recipes_jerkchickenwithpomeg_88341", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 part-boned chicken breasts, skin on (substitute boneless chicken breasts if part-boned are not available)", "½ large onion, roughly chopped", "2 scotch bonnet chillies, roughly chopped", "40g/1½oz ginger, peeled and chopped roughly ", "125ml/4½fl oz malt vinegar", "½ tsp ground cloves", "½ tsp ground cinnamon", "¼ tsp ground nutmeg", "½ tsp cracked black pepper", "3 garlic cloves, roughly chopped", "2 tsp fresh thyme leaves ", "3 tbsp dark soy sauce ", "200g/7oz basmati rice", "1 pomegranate, seeds only", "1 small bunch chervil leaves", "4 tbsp chives, roughly chopped", "50g/2oz frisée lettuce, roughly chopped", "1 lime, zest and juice", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "2 limes, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the jerk chicken, using a sharp knife, make deep cuts into the chicken flesh and place into a bowl.", "Place the remaining jerk chicken ingredients into a food processor and blend to a purée. Pour the marinade over the chicken and turn to coat all the pieces. Place into the fridge for at least four hours, but preferably overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a griddle pan until very hot. Add the chicken pieces and sear for 2-3 minutes on each side, then place onto a baking tray.", "Spoon the remaining marinade over the chicken and transfer to the oven to cook for 20-25 minutes, or until the chicken is completely cooked through.  Remove from the oven and leave to rest for 2-3 minutes before serving. ", "For the rice, place the rice into a saucepan with 400ml/14fl oz of cold water. Cover with a lid and place over a high heat. Bring to the boil, then reduce the heat and simmer very gently until all of the water has been absorbed and the rice is tender (about 10-15 minutes). Turn off the heat and leave to steam for 5-6 minutes.", "Place the rice into a bowl and add all the remaining rice ingredients and mix well to combine. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon a little of the rice onto each plate and top with a piece of jerk chicken. Garnish with a couple of wedges of lime."]}, {"isVegetarian": false, "title": "Jerk chicken with rice and peas", "url": "www_bbc_co_uk_food_recipes_jerkchickenwithricea_86519", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "12 chicken legs", "200g/7oz good-quality jerk seasoning ", "50ml/2fl oz vegetable oil", "1 onion, finely chopped ", "300g/10½oz long grain rice", "400ml/14fl oz water", "400ml/14fl oz coconut milk", "400g/14oz tin kidney beans, rinsed and drained", "3 tbsp chopped fresh thyme", "salt and freshly ground black pepper", "fresh coriander leaves, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the jerk chicken, place the vegetable oil into a deep, heavy- bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the chicken legs into a large bowl and dredge in the jerk  seasoning to coat all over. Carefully place into the hot oil and deep fry, turning occasionally, for about 12 minutes, or until golden-brown  and completely cooked through. Remove from the oil with a slotted  spoon and drain on kitchen paper.", "Meanwhile, for the rice and peas, heat the oil in a large lidded  pan and fry the onion until softened but not coloured.", "Add the rice and stir well, then add the water and bring to the boil.", "Add the coconut milk, kidney beans and thyme, reduce the heat and simmer,  covered, for about 20 minutes, or until the rice is cooked. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a good spoonful of the rice into a cup, then turn out onto a serving plate. Repeat with each serving and place 2-3 chicken legs on top of each pile of rice. Sprinkle with fresh coriander."]}, {"isVegetarian": false, "title": "Jerk Kiev with yam forestiere", "url": "www_bbc_co_uk_food_recipes_jerkkievwithyamfores_90443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz skinless chicken breasts with the wing bone retained", "1 tbsp olive oil", "2 tbsp jerk seasoning paste", "3 garlic cloves, crushed to a paste", "200g/7oz butter, softened", "2 shallots, finely diced", "2 tbsp finely chopped English parsley ", "½ lime, juice only", "salt and freshly ground black pepper", "vegetable oil, for deep frying", "4 free-range eggs, beaten", "110ml/4fl oz milk", "110g/4oz plain flour", "500g/1lb 2oz Japanese breadcrumbs", "500g/1lb 2oz yellow or white yams, peeled and cut into 1cm/½in chunks", "4 tbsp olive oil", "4 rashers smoked streaky bacon, roughly chopped ", "110g/4oz assorted wild mushrooms ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Kiev, make an incision in the top of each of the chicken breasts, then wiggle the knife around to create a pocket. Set aside.", "Heat the oil in a frying pan, add the jerk paste and garlic and cook for one minute or until fragrant. ", "Place the butter into a bowl, add the cooked jerk paste and garlic, along with the shallots, parsley and lime juice. Beat together until well combined. Season with salt and freshly ground black pepper, to taste.", "Place the mixture into a piping bag and pipe it into the pockets created in the chicken breasts.", "Place the chicken onto a plate, cover and place in the fridge for 30 minutes until the butter inside the chicken has just set.", "Heat the vegetable oil in a deep heavy-bottomed saucepan or deep fat fryer, to 190C/375F or until a breadcrumb sizzles and turns golden-brown when dropped in it (CAUTION: hot oil can be dangerous - do not leave unattended). Preheat the oven to 200C/390F/Gas 6.", "Beat the eggs and milk together in a small bowl; tip the flour onto one plate and the breadcrumbs onto another plate.", "Dip each chicken breast in the flour, then the egg mixture and finally in the breadcrumbs to coat entirely. ", "Place each breast in the deep fat fryer and cook for two minutes until golden-brown.", "Carefully remove the chicken from the fryer using a slotted spoon and drain on kitchen paper. Place onto a roasting tray and roast in the oven for 5-8 minutes, or until cooked through.", "For the yam forestière, bring a pan of salted water to the boil, add the chopped yams and simmer for 2-3 minutes, or until just tender.", "Drain the yams and set aside.", "Heat a frying pan, add the olive oil and yams and fry for 3-4 minutes, or until golden-brown on all sides.", "Heat a second frying pan until hot, add the bacon. Add the mushrooms and fry for 2-3 minutes, or until cooked through.", "Add the yams to the bacon and mushrooms and mix well to combine. Season with salt and freshly ground black pepper, to taste.", "To serve, spoon the yam mixture into the centre of each of four serving plates. Cut the Kiev in half on the diagonal and arrange on top. Serve."]}, {"isVegetarian": true, "title": "Jerk seasoning", "url": "www_bbc_co_uk_food_recipes_jerkseasoning_89190", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 bunch fresh thyme, leaves only", "2 cinnamon sticks, roughly crushed", "2 tbsp chopped fresh coriander", "1 tsp coriander seeds, crushed", "2 tbsp black peppercorns, crushed", "1 tsp freshly grated nutmeg", "3 tsp allspice, crushed", "6 garlic cloves", "4 Scotch Bonnet chillies, seeds removed", "2 tsp chopped fresh ginger", "2 limes, zest of 1 lime, juice of 2", "140ml/¼ pint olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients in a blender or food processor and blend to make a smooth paste. ", "Use the paste as a seasoning for chicken, pork or fish. It will keep for two weeks if covered and refrigerated."]}, {"isVegetarian": false, "title": "Jerusalem artichoke soup with white truffle oil", "url": "www_bbc_co_uk_food_recipes_jerusalem_artichoke_soup_20395", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerusalem_artichoke_soup_20395_16x9.jpg", "ingredients": ["30g/1oz unsalted butter", "70g/2½oz onions, sliced", "250ml/9fl oz chicken stock", "400g/14oz Jerusalem artichokes, peeled and cut into small pieces", "1 bouquet garni", "50g/1¾oz butter ", "few drops truffle oil ", "1 tbsp chopped fresh chives ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan, add the onions and a pinch of salt and cook gently until soft, without colouring. Add 250ml/9fl oz water, the chicken stock, artichokes and bouquet garni and bring to the boil. Cook for about 30 minutes. Once the artichokes are soft, remove the bouquet garni. Transfer to a blender and blend to a fine purée, then pass through a fine sieve if needed.", "Whisk the butter into the soup, add a few drops of truffle oil, then season with salt and pepper.", "Serve with a sprinkling of fresh chives."]}, {"isVegetarian": false, "title": "Jersey Royal, asparagus and clam broth", "url": "www_bbc_co_uk_food_recipes_jersey_royal_asparagus_49654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1¼ litres/2 pints chicken stock", "300g/10½oz Jersey Royal potatoes, cleaned", "150g/5½oz pearl onions, left whole but peeled", "16 asparagus stems, trimmed", "600g/1lb 5oz clams, scrubbed and debearded", "75g/2¾oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the stock in a large lidded saucepan and bring to the boil. Add the potatoes and cook for 4-7 minutes, until nearly tender.", "Add the pearl onions and cook for 2 minutes. Add the asparagus and cook for a further 2 minutes, or until all the vegetables are tender. Remove the vegetables using a slotted spoon and set aside.", "Discard any clams with broken shells and any that refuse to close when tapped against the side of the sink. Reduce the stock by one-third, then add the clams. Cover and cook for 1-2 minutes, until they open. Discard any that remain closed. ", "Whisk in the butter, then return the vegetables to the pan and warm through. Season with salt, if needed, and black pepper. ", "Divide the broth and clams between 4 serving bowls and serve with crusty bread. "]}, {"isVegetarian": true, "title": "Jersey Royal and Double Gloucester tortilla", "url": "www_bbc_co_uk_food_recipes_jersey_royal_and_double_50135", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash oil, for cooking", "1 onion, sliced ", "100g/3½oz crème fraîche, plus extra to serve", "salt and pepper", "2 tbsp chopped chives", "4 free-range duck eggs, whisked", "200g/7oz Jersey Royals, washed and scrubbed (not peeled), pre-cooked and halved", "1 bunch spring onions, sliced", "70g/2½oz Double Gloucester, grated", "30ml/1fl oz first press rapeseed oil ", "chive flowers"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dash of oil in a frying pan and fry the onion until softened. ", "Whisk the crème fraîche and chives together in a bowl. Season with salt and black pepper and set aside.", "Put the duck eggs, potatoes, spring onions, cooked onions and cheese in a mixing bowl and season with salt and pepper. ", "Add the rapeseed oil to a non-stick frying pan, heat and then pour in the tortilla mixture.", "With a heatproof spatula, stir the egg mix until you see the egg starting to set, then leave to fully set on the presentation side and lightly colour - draw the sides in around the tortilla to make it as round as possible ", "Once the tortilla has set, use a cake stand to help turn the tortilla over: put the stand on top of the firm egg mixture, then turn at the same time so that the pan is upside down and the cake stand is upright. Lift the pan off and you should have a lovely looking tortilla. Slide the tortilla back into the pan and finish cooking for 2-4 minutes until cooked to your liking.", "To serve, cut the tortilla into portions and then serve with a spoon of the crème fraîche and chive flowers on top."]}, {"isVegetarian": false, "title": "Jerusalem artichoke soup served with a game burger and Jerusalem crisps", "url": "www_bbc_co_uk_food_recipes_jerusalem_artichoke_soup_78921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 large onion, chopped", "salt and pepper", "10-12 Jerusalem artichokes, peeled and placed in acidulated water", "750ml/1¼ pint chicken stock", "150ml/5½fl oz whipping cream", "½ lemon, juice only", "50ml/2fl oz olive oil, plus extra to serve", "1 onion, finely chopped", "200g/7oz game livers", "200g/7oz pork fat", "200g/7oz pork throat or belly", "200g/7oz mixed game – such as pheasant, mallard and grouse", "50g/1¾oz dried apricots ", "1-2 free-range eggs ", "200ml/7fl oz cream", "200g/7oz breadcrumbs", "vegetable oil, for deep frying", "4 Jerusalem artichokes, sliced lengthways on a mandolin, skin on ", "50g/1¾oz plain flour", "2 tbsp fresh chives, sliced into 2mm pieces, to garnish "], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Jerusalem artichoke soup, heat the vegetable oil in a large pan and gently fry the onion and a pinch of salt for 5-6 minutes, or until soft. ", "Meanwhile, cut the artichokes into roughly 2cm/1in cubes. Add them to the onions and fry for a further 3-4 minutes. Pour in the chicken stock and cream and cook over a medium heat until the vegetables are soft. Add the lemon juice and cook for five more minutes.", "Transfer the cooked vegetables to food processor and blend to a smooth soup. If it is too thick, add a little more stock or water. Taste to check the seasoning and add salt and pepper as required. Keep warm until ready to serve.", "For the game burger, heat a dash of the olive oil in a frying pan. Once hot, add the onion and gently fry until soft and translucent. Set aside to cool.", "Put the livers, pork fat, throat (or belly), game and apricots through a mincer, or very finely chop them (alternatively, ask your butcher to do this for you). Add one egg, the cream and breadcrumbs and mix together. If the mixture doesn’t bind together add the other egg. Season with salt and pepper or, to test the seasoning of the burger, roll a small amount into a mini burger, fry and taste.", "When satisfied with the seasoning, mould the meat into burgers and fry in a large frying pan with the olive oil for 2-3 minutes on each side.", "For the Jerusalem crisps, fill a deep-fat fryer with vegetable oil and preheat to 180C/350F. (CAUTION: hot can be dangerous. Do not leave unattended.)", "Dry the slices of artichokes with a clean tea towel and dust with flour. Fry for two minutes, or until crisp and golden-brown. ", "Serve the Jerusalem artichoke soup with the game burger in the centre of each of the bowls, garnished with the artichoke crisps, chives and a swirl of olive oil. "]}, {"isVegetarian": true, "title": "Jerusalem artichoke broth", "url": "www_bbc_co_uk_food_recipes_jerusalemartichokebr_85618", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerusalemartichokebr_85618_16x9.jpg", "ingredients": ["1 large onion, halved and sliced", "675g/1½lb Jerusalem artichokes, peeled, halved and sliced", "2 tbsp extra virgin olive oil", "4 sprigs fresh thyme", "1 bay leaf", "1 litre/1¾ pints hot chicken or vegetable stock", "2 tbsp white wine vinegar", "salt and freshly ground black pepper", "2 tbsp roughly chopped parsley", "6 thick slices baguette (optional)", "150g/5oz single Gloucester, mature cheddar or gruyère cheese, coarsely grated (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the onion, artichokes and oil into a pan and add the thyme and bay leaf, tied together with string. Cover and sweat over a low heat for about 15 minutes, stirring occasionally.", "Add the stock and vinegar, season well with salt and freshly ground black pepper and bring up to the boil. Simmer for ten minutes, then taste and adjust the seasoning. Discard the thyme and bay leaf and pour into serving bowls.", "To serve, sprinkle with parsley. If using the bread and cheese, preheat the grill to medium. Toast the baguette lightly on both sides under the grill, then, just before serving, top with grated cheese and slide back under the grill to melt. Float a slice of cheese on toast in each bowl of soup as you serve."]}, {"isVegetarian": false, "title": "Jerusalem artichoke soup with pheasant and crispy shallot", "url": "www_bbc_co_uk_food_recipes_jerusalemartichokeso_79270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "3 Jerusalem artichokes, peeled and sliced", "½ shallot, peeled and sliced", "30ml/1fl oz white wine", "100ml/3½fl oz vegetable stock", "55ml/2fl oz double cream", "1 tbsp olive oil", "2 pheasant thighs", "2 tbsp olive oil", "½ shallot, peeled and finely sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan. Add the artichokes and shallot and sauté for a few minutes, to soften.", "Add the white wine and heat for a further two minutes.", "Pour in the vegetable stock, bring to the boil and then reduce the heat and simmer gently for 10-15 minutes.", "Add the cream and then, using a hand blender, blend until smooth.", "Meanwhile, for the pheasant garnish, heat one tablespoon of olive oil in a separate pan. Add the pheasant thighs and cook for 4-5 minutes on each side, until crisp and thoroughly cooked.", "In a separate pan, add the sliced shallot and sauté for 3-4 minutes until golden and crisp.", "To serve, ladle the soup into a bowl. Place the pheasant thighs in the middle and scatter the crispy shallots on top."]}]