[{"ingredients": ["1x 2.8kg / 6lb 2oz pato entero, menudillos eliminados", "sal y pimienta negra recién molida", "algunas ramitas de tomillo fresco", "algunas ramitas de romero fresco", "2 cucharadas de vinagre", "2 cebollas, pieles encendidas, cortadas por la mitad", "6 lonchas de tocino rayado ahumado", "500ml / 17fl de leche en oz", "1 cebolla mediana, pelada, cortada por la mitad", "2 dientes enteros", "6 granos de pimienta negros enteros", "maza pequeña (o pizca de nuez moscada molida)", "grandes copos de sal marina", "Pan rallado blanco fresco de 120g / 4oz", "30 g / 1¼ oz de mantequilla"], "method": ["Tres horas antes de que desee cocinar el pato, enjuáguelo con agua fría y seque con cuidado, por dentro y por fuera, con papel de cocina.", "Sazonar el pato por dentro y por fuera con sal y pimienta negra recién molida. Agregue las ramitas de tomillo y romero a la cavidad, luego vierta 125ml / 4fl oz de agua fría, inclinando el pato para que el agua no se derrame. Selle la cavidad metiendo el cuello del pato.", "Enfríe el pato en la nevera durante tres horas. (Regrese a la temperatura ambiente antes de cocinar).", "Cuando esté listo para cocinar el pato, precaliente el horno a 220C / 450F / Gas 8.", "Suspenda una rejilla sobre una bandeja de asar y coloque el pato sobre ella. Vierta 375ml / 12½fl oz de agua hirviendo sobre el pato y en la bandeja de asar. Luego espolvoree todo el pato con vinagre (esto hará que la piel se ponga crujiente cuando esté cocida).", "Coloque las mitades de cebolla en cada lado del pato y coloque las lonjas de tocino sobre el pecho. Limpie el exceso de vinagre con papel de cocina. Sazonar el pato de nuevo con sal y pimienta negra recién molida, luego cubrir la bandeja con papel de aluminio, sellando bien en los bordes.", "Asar el pato en el horno durante 30 minutos, luego retire la lámina y las lonjas de tocino. Reserve las lonjas de tocino y las mitades de cebolla asadas. Ponga a un lado el pato en su bandeja de asar listo para asar nuevamente más tarde.", "Reduzca la temperatura del horno a 180C / 350F / Gas 5.", "En este punto, comience la salsa de pan. Vierta la leche en una cacerola de tamaño mediano, agregue las mitades de cebolla, clavos, granos de pimienta, macis (o nuez moscada) y la sal y caliente a fuego medio, revolviendo bien, hasta que la leche comience a hervir a fuego lento. (NB: No permita que la leche hierva).", "Continúe cocinando a fuego lento la leche, sin hervir, durante 4-5 minutos, luego retire la sartén del fuego y déjela a un lado, tapada, durante una hora para permitir que los sabores se infundan.", "Cuando la temperatura del horno se haya reducido, devuelva el pato al horno y tueste, sin tapa, durante una hora más, hilvanado a intervalos de 30 minutos con los jugos de la bandeja de asar.", "Retire el ave del horno y déjela reposar, cubierta sin apretar, durante 40 minutos. Escurra los jugos de cocción de la bandeja de asar y reserve en una jarra. (Después de unos minutos, la grasa debe separarse de los jugos de carne. La grasa de pato puede verterse o descremarse de la jarra de los jugos de tostación y usarse para hacer papas asadas para acompañar este plato; alternativamente, se mantendrá en un recipiente sellado para hasta cuatro semanas.)", "Mientras tanto, cuando la leche para la salsa de pan se haya infundido, agregue las migas de pan a una cacerola limpia y cuele la leche infundida sobre las migas de pan a través de un colador fino para recoger la cebolla y las especias. Revuelva una vez y déjela a un lado para remojar durante cinco minutos.", "Calentar la mezcla de pan a fuego medio, revolviendo regularmente, durante 8-10 minutos, o hasta que el pan haya absorbido la mayor parte del líquido y la mezcla se haya espesado, luego retire la sartén del fuego y agregue la mantequilla hasta que la mantequilla se haya derretido y la salsa de pan se asemeja a gachas de avena. (Si la salsa es demasiado espesa, agregue un poco más de leche para aflojarla).", "Para cocinar las cebollas asadas reservadas, caliente la bandeja de asar utilizada para asar el pato a fuego medio, luego agregue las cebollas, con los lados cortados hacia abajo, y cocine suavemente en el residuo de los jugos de cocción durante 2-3 minutos para que se empapen. hasta los sabores. Mantenga caliente hasta que esté listo para servir.", "Cuando el pato haya descansado, abra el cuello del pato asado y vierta cuidadosamente cualquier líquido dentro de la jarra de jugos de carne. Revuelva hasta que esté bien combinado y vuelva a calentar justo antes de servir (esta será la salsa).", "Regrese el pato asado a la bandeja de tostado y coloque las lonjas de tocino encima de nuevo. Cocine en el horno por otros 15 minutos o hasta que la piel del pato esté crujiente.", "Para servir, esculpe el pato asado en rodajas finas y colóquelo en cuatro platos para servir. Coloque una mitad de cebolla al lado de cada porción de pato. Desmenuce las lonchas de tocino en pedazos y apile unas pocas piezas al lado de las cebollas. Vierta sobre la salsa. Sirva con patatas asadas y vegetales verdes al vapor."], "url": "www_bbc_co_uk_food_recipes_perfect_roast_duck_with_50051", "title": "Perfecto pato asado con salsa de pan", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_roast_duck_with_50051_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4.5-5.5kg / 10-12lb pavo entero, molleja, corazón, puntas de ala y espoleta retirados y reservados", "1 cebolla, partida por la mitad", "1 zanahoria", "2 palitos de apio", "2 ramitas de perejil fresco", "2 ramitas de tomillo fresco", "175g / 6oz de mantequilla salada", "sal marina escamada y pimienta negra recién molida", "85g / 3oz de mantequilla salada", "175g / 6oz cebollas, finamente picadas", "Pan rallado blanco fresco de 225 g / 8oz", "2½ cucharadas de hierbas frescas mezcladas picadas (perejil, cebollín, tomillo, bálsamo de limón, mejorana y salvia)", "1.2 litros / 2 litros de caldo (ver arriba, o caldo de pollo)", "1 cucharada de mantequilla ablandada", "1-2 cucharadas de harina común"], "method": ["Para el caldo, coloca la molleja, el corazón, las puntas de las alas, la espoleta, la cebolla, la zanahoria, el apio y las hierbas en una sartén y condimenta. Cubra bien con aproximadamente 2 litros / 3½ pintas de agua fría y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 2 horas, o hasta que tenga un caldo sabroso. Colar y reservar para hacer la salsa. (Las existencias se pueden hacer con uno o dos días de anticipación, cubra y guarde en el refrigerador, luego desengrase si alguna grasa flota en la parte superior).", "Precaliente el horno a 200C / 180C Ventilador / Gas 6. Para el relleno, derrita la mantequilla en una cacerola a fuego medio. Cuando esté espumante, agregue las cebollas picadas y sazone. Cubra con papel a prueba de grasa y una tapa, baje el fuego a fuego lento y cocine durante 8-10 minutos, o hasta que esté completamente ablandado. Dejar de lado para enfriar.", "Coloque las cebollas enfriadas en un tazón. Mezcle las migas de pan y las hierbas mixtas y sazone al gusto. Pese el relleno para ayudar a calcular el tiempo de cocción.", "Sazone la cavidad del pavo en ambos extremos. Rellene algo del relleno en la cavidad principal, pero tenga cuidado de no empacarlo; debe haber espacio suficiente entre el relleno y el esternón para que quepa en el mango de una cuchara de madera. Rellene la cavidad más pequeña en el extremo del cuello, dejando de nuevo un pequeño espacio (es posible que no necesite todo el relleno, dependiendo del tamaño de su pavo).", "Para ayudar a calcular el tiempo de cocción, agregue el peso del pavo, el relleno y la mantequilla de 175g / 6oz juntos o pese el pavo relleno y agregue el peso de la mantequilla de 175g / 6oz.", "Pon el pavo en una bandeja grande para asar. Derrita la mantequilla de 175g / 6oz, luego sumerja la muselina en la mantequilla y envuélvala sobre el pavo. Asar durante 15 minutos, luego bajar el horno a 180C / 160C Fan / Gas 4 y asar durante 15 minutos más por 450g / 1lb de peso total de pavo / relleno / mantequilla. Baste cada 30 minutos; es importante hacer esto rápidamente para no dejar que el pavo se enfríe, ya que esto podría alterar el tiempo de cocción. Retire la muselina 15 minutos antes del final de la torrefacción y hilvane otra vez.", "Para probar que el pavo está cocinado, inserte un cuchillo pequeño de frutas o verduras en la parte más gruesa de la carne, entre la pierna y el pecho; los jugos que corren deben ser claros, sin ningún signo de rosa; si hay algo de rosado, devuelva el pavo al horno por otros 15-20 minutos o hasta que esté cocido. Tranfer el pavo a un plato de talla. Cúbralo con papel de pergamino, luego coloque una toalla de té limpia sobre él para mantenerlo bien y cómodo. Déjalo reposar durante al menos 30 minutos o hasta 1½ horas.", "Mientras tanto, para la salsa, retire la grasa sobrante de la bandeja de tostado con una cuchara. Coloque la bandeja a fuego medio y desgáselo vertiendo en el caldo. Con un batidor, quite todas las brochetas caramelizadas del fondo de la bandeja. Llevar la mezcla a ebullición, luego con cuidado vierta en una olla a través de un colador y sazonar. Para espesar la salsa, mezcle la mantequilla y la harina, luego mezcle con la salsa. Lleva la mezcla a fuego lento y luego retira del fuego.", "Tallar el pavo y servir en platos calientes con el relleno y la salsa caliente."], "url": "www_bbc_co_uk_food_recipes_perfect_roast_turkey_72482", "title": "Perfecto asado de pavo y relleno", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_roast_turkey_72482_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 litros / 3½ pintas de aceite vegetal", "1 kg / 2 libras 4 oz de papas harinosas, como Maris Piper, cortadas en pedacitos", "4 x 275 g / 10 oz solomillo o filetes rib-eye, a temperatura ambiente", "aceite de cacahuete Splash, o aceite sin sabor similar", "sal y pimienta negra recién molida", "gran perilla de mantequilla", "berros, para servir"], "method": ["Para las virutas, caliente el aceite en una freidora de grasa ajustada a 160 ° C. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Enjuague las virutas con agua fría en un colador durante 1-2 minutos para eliminar el exceso de almidón. (Puede necesitar hacer esto en lotes).", "Transfiera las papas fritas a una sartén grande con agua con sal. Ponga a hervir el agua, luego reduzca ligeramente el fuego y cocine a fuego lento hasta que estén tiernas. Escurrir bien y reservar para enfriar y secar más.", "Cuando las virutas se hayan enfriado y secado, cuidadosamente baje los lotes en el aceite caliente. Cocine por 6-8 minutos, o hasta que se dore. Retire las virutas del aceite caliente con una cuchara ranurada y transfiera a un recipiente.", "Aumente la temperatura del aceite a 190C.", "Con cuidado, baje los lotes de las virutas en el aceite caliente una vez más, fríe durante 2-3 minutos, o hasta que estén doradas, antes de quitarlas y dejarlas a un lado para escurrirlas sobre papel de cocina. Mantener caliente", "Mientras tanto, para el bistec, precaliente el horno a 200C / 180 Fan / Gas 6.", "Caliente el aceite en una sartén resistente al horno a fuego fuerte hasta que esté caliente. Sazone los filetes con sal.", "Cuando la sartén esté caliente, agregue los filetes y fríalos durante 2-3 minutos en cada lado, o hasta que la carne esté dorada oscura en ambos lados (puede necesitar hacer esto en lotes).", "Agregue la mantequilla a la sartén y transfiérala al horno, asar la carne durante 8 minutos o hasta que esté cocida a su gusto.", "Retire la sartén del horno e hilvane los filetes con la mantequilla derretida. Retire la carne de la sartén y déjela reposar por un mínimo de 10 minutos.", "Para servir, coloca los filetes en platos para servir. Apila las fichas al lado. Sirva con un puñado de berros frescos."], "url": "www_bbc_co_uk_food_recipes_perfect_steak_and_chips_14714", "title": "Bistec y patatas fritas perfectos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "1 cucharadita de jengibre fresco rallado y pelado", "100 g / 3½ oz de champiñones shiitake frescos o champiñones porcini empapados, en rodajas, sin tallos", "100g / 3½oz de brotes de bambú estañados, escurridos y cortados en cerillas", "50 g / 1¾oz de castañas de agua enlatadas, escurridas, cortadas en tiras pequeñas", "2 cucharadas de salsa de soja baja en sodio y baja en calorías", "1 cucharada de polvo chino de cinco especias", "75g / 2¾oz de soja, deben estar muy frescos", "2 hojas de cavolo nero, lavado, triturado", "2 cebollas grandes de primavera, cortadas longitudinalmente", "1 zanahoria pequeña, pelada, cortada en cerillas", "1 cucharada de salsa de ostras o salsa de ostras vegetariana", "1 cucharadita de aceite de sésamo tostado", "Una pizca de sal marina", "pizca de pimienta blanca molida", "25-30 envoltorios grandes de rollitos de primavera (15x15cm / 6x6 pulgadas cuadradas), variedad congelada, descongelados (ver consejo)", "1 huevo mediano de granja, ligeramente golpeado", "aceite de maní, para freír", "Salsa de chile dulce tailandés, para servir"], "method": ["Caliente un wok a fuego alto hasta que empiece a humear. Agregue el aceite de cacahuete. Agregue el jengibre y saltee por unos segundos.", "Incline en los champiñones, brotes de bambú y castañas de agua. Revuelva-fríe durante 1-2 minutos, sazone con 1 cucharada de salsa de soja y el polvo de cinco especias. Agregue un pequeño chorrito de agua alrededor de los bordes del wok para ayudar a crear algo de vapor. Retirar del wok y reservar para enfriar, esto debería demorar entre 30 minutos y 1 hora.", "Coloque los granos de soja, el cavolo nero, las cebolletas y la zanahoria en un tazón. Agregue la cucharada sopera restante de salsa de soja, salsa de ostras, aceite de sésamo tostado, sal y pimienta. Mezcle para mezclar.", "Una vez enfriado, agregue la mezcla de champiñones y revuelva bien para combinar.", "Coloque una envoltura de rodillo de primavera de manera que las esquinas estén apuntando hacia arriba, hacia abajo y hacia los lados.", "Cuchara 2 cucharaditas del relleno comenzando en la esquina inferior a unos 2 cm del borde. (Asegúrese de que el relleno esté frío pero no demasiado mojado; de lo contrario, el rollo de primavera estará mojado y romperá la envoltura del rollo de primavera).", "Pase el relleno, exprimiendo el aire mientras se aleja de usted. Al llegar al medio, traiga las dos esquinas que apuntan de lado a medio asegurándose de que se superponen. Continúa enrollando y metiendo el borde superior y sellándolo con un poco del huevo batido. Repita con las envolturas y el relleno del rodillo de resorte restante.", "Llene a la mitad una sartén grande o una freidora con aceite. Caliente el aceite a 180C / 350F. (Un cubo de 2cm / 1in en pan debe dorarse y crujiente en 1 minuto cuando se deja caer en el aceite). Freír los rollitos de primavera durante 5-6 minutos, removiéndolos en la freidora hasta que queden dorados. Retire con una espumadera y escurra sobre papel de cocina. Sirve con salsa de chile dulce tailandés."], "url": "www_bbc_co_uk_food_recipes_perfect_vegetable_spring_12478", "title": "Rollitos de primavera vegetales perfectos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfect_vegetable_spring_12478_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["papas", "Leche", "mantequilla", "sal y pimienta negra", "nuez moscada pizca"], "method": ["Hervir las papas en sus pieles en agua muy salada. (Elija papas de tamaño similar para cocinar al mismo ritmo).", "Cuando estén bien cocidos, escurrirlos en un colador y dejarlos en cocción hasta que apenas cocine lo suficiente como para manejarlos. Entonces las pieles se desprenden fácilmente con los dedos.", "Rompe las papas aproximadamente con un tenedor para permitir que salga más vapor.", "Agregue la leche y la mantequilla a una cacerola y caliente. Agregue un poco de pimienta negra recién molida y una pizca de nuez moscada.", "Después de un par de minutos más de cocción al vapor, las papas se pueden tamizar en la sartén con leche y mantequilla burbujeantes, o incluso crema y mantequilla, y batir hasta que quede suave.", "Pruebe y ajuste cuidadosamente el condimento de nuevo antes de servir."], "url": "www_bbc_co_uk_food_recipes_perfectmash_13799", "title": "Perfecto puré", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 1 porción", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250-350ml / 8¾-12¾fl oz de agua tibia", "1 cucharada de levadura seca activa", "550g / 1lb 3½oz de harina blanca fuerte, más extra para espolvorear", "1 cucharadita de sal", "½ cucharadita de pimienta negra molida", "2 cucharaditas de miel clara", "2 cucharadas de aceite de oliva virgen extra, más extra para cepillar"], "method": ["Vierta 150ml / 5¼fl oz del agua en un recipiente y espolvoree sobre la levadura. Agitar para disolver, luego dejar reposar en un lugar cálido durante diez minutos.", "Tamiza la harina, la sal y la pimienta en un tazón grande. Revuelva la miel y el aceite de oliva en la mezcla de levadura hasta que estén bien combinados.", "Haga un pozo en el centro de los ingredientes secos y vierta la mezcla de levadura, mezclándola para formar una masa suave y ligeramente pegajosa. Agregue suficiente agua restante, poco a poco, hasta que haya alcanzado la consistencia correcta.", "Transfiere la masa a una superficie de trabajo ligeramente enharinada y enharina tus manos. Amasar la masa durante diez minutos hasta que esté suave y flexible.", "Engrase ligeramente un tazón grande: debe ser lo suficientemente grande como para permitir que la masa duplique su tamaño. Coloque la masa dentro y cúbrala con una película adhesiva. Guarde en un lugar cálido durante 1-2 horas.", "Cuando la masa se haya duplicado, retire la película adhesiva y golpee la masa hacia abajo. Retire del tazón y amasar nuevamente hasta que quede suave. Divida en cinco bolas redondas y deje que la masa descanse antes de darle forma.", "Para darle forma a la masa, levante una bola de masa sobre una superficie de trabajo ligeramente enharinada y enharine ligeramente la parte superior. Aplane la masa con los dedos antes de levantarla y golpearla sobre la superficie de trabajo. Repita esto un par de veces. Ahora cubra la masa sobre su puño cerrado y estírelo suavemente desde el borde exterior.", "Coloque la masa en latas de pizza bien cocidas en harina u hojas para hornear, cubra con su elección de coberturas y hornee en un horno caliente hasta que la cubierta esté derretida y los bordes crujientes."], "url": "www_bbc_co_uk_food_recipes_perfectpizzadough_72456", "title": "Pizza perfecta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Bases de pizza de 5 x 20 cm / 8 in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Las papas harinas, como Cara o King Edward, son bastante pequeñas, aproximadamente del tamaño de un huevo", "aceite de girasol o maní"], "method": ["Par-hervir las papas en agua con sal hirviendo suavemente durante unos 8 minutos. Deja de cocinar antes de que estén cocidos.", "Deje que se enfríe completamente, luego raspe con un tenedor y sazone con un poco de sal fina.", "Solo tuesta alrededor de la articulación si hay mucha grasa, al menos ½ pulg./pulg. En la lata, y mucho espacio. Es mejor precalentar el aceite en una sartén por separado, agregando cualquier grasa de res de la lata de asar justo antes de que las papas entren. No agregue las papas hasta que el aceite esté hirviendo. Hilvanar o girar las papas (con cuidado) tan pronto como entran en la sartén para que tengan una capa ligera de aceite desde el principio.", "Asar durante los últimos 45 minutos del tiempo de cocción de su conjunto, volteándolo al menos una vez. Si parece que podrían usar un poco más de dorado / crujiente, déjelos puestos después de que la articulación haya descendido, mientras usted aumenta el calor del pudín de Yorkshire.", "Luego, cuando la lata del pudín precalentado esté lista, tendrá que decidir si salen las papas o quedarse durante los 15 minutos completos de pudín.", "Escurra bien y manténgalos en un horno caliente, descubierto y no apilados uno encima del otro. Sazonar de nuevo con sal y pimienta antes de servir."], "url": "www_bbc_co_uk_food_recipes_perfectroastpotatoes_13801", "title": "Papas asadas perfectas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 1 porción", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, ablandada", "2 cucharaditas de sal marina", "2 cucharaditas de pimienta negra recién molida", "Pavo de 4.5 kg / 10 lb, con menudillos extraídos y la cavidad limpia", "3 cebollas grandes, cortadas a la mitad"], "method": ["El pájaro debe estar preparado la noche anterior. Mezcle la mantequilla con la sal y la pimienta negra recién molida, luego sazone la cavidad del ave.", "Frote la mezcla de mantequilla en todo el pavo. Dobla una gran pieza de papel resistente a la grasa para doblar el grosor y ponte sobre el pecho para protegerlo durante la cocción. Déjalo en la nevera durante la noche.", "El día que desee servir al ave, caliente el horno a 220 ° C / 430 ° F / Gas 7. Saque el pavo del refrigerador y permita que alcance la temperatura ambiente mientras el horno se está calentando.", "Coloque las cebollas en una bandeja grande para asar. Coloque el pavo en un salvamanteles o estante de alambre en la bandeja. Vierta una taza de agua hirviendo en la cavidad del ave y selle con un pincho. Vierta dos tazas de agua hirviendo en el fondo de la lata, luego cubra todo con dos capas de papel de aluminio, asegurándose de que esté bien sellado alrededor de los bordes.", "Cocine por 20 minutos, luego reduzca la temperatura a 200C / 400F / Gas 6. Después de 1½ horas, retire la lámina y el papel resistente a la grasa. Cocine por otros 40 minutos y no abra la puerta del horno hasta que el tiempo de cocción esté arriba.", "Para comprobar si el pavo está cocido, inserte un pincho o cuchilla en el punto donde el muslo se une al pecho - el jugo debe salir claro.", "Si es rosa, cocínelo por otros 20 minutos y vuelva a probarlo. Deje que el pavo descanse en un lugar cálido durante al menos 15 minutos antes de tallar.", "Cuele el jugo del fondo de la lata en una jarra grande: la grasa se elevará a la parte superior, dejando debajo el caldo de pavo aromático. Elimine la grasa use los jugos para hacer una salsa o sirva como es."], "url": "www_bbc_co_uk_food_recipes_perfectroastturkey_78908", "title": "Perfecto asado de pavo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de harina", "50g / 2oz de mantequilla", "Cerveza fuerte de 250ml / 9oz, calentada", "Cheddar fuerte 250 g / 9 oz, rallado", "2 piezas de mostaza inglesa", "2 cucharadas de salsa Worcestershire", "pimienta negra", "4 rebanadas grandes de pan de granero"], "method": ["En una cacerola pequeña derrita la mantequilla y haga un roux con la harina. Cocine por un par de minutos, revolviendo para evitar que el roux se queme. Agregue la cerveza tibia por grados, hasta que tenga una salsa espesa pero suave. Agregue el queso rallado y revuelva hasta que se derrita. Ahora debería tener una pasta espesa. Mezcle la salsa de mostaza y salsa Worcestershire y sazone bien con pimienta negra.", "Ligeramente tostadas y unte el pan, luego apile la mezcla caseosa en cada rebanada. Cocine bajo una parrilla caliente durante unos minutos, hasta que se dore y burbujee."], "url": "www_bbc_co_uk_food_recipes_perfectwelshrarebit_13772", "title": "Perfecta rareza galesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/perfectwelshrarebit_13772_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo entero de 2 kg / 4½ lb (preferiblemente de granja o ecológico)", "sal y pimienta negra recién molida", "150 ml / 5 fl oz de agua, caldo de pollo o vino tinto", "5 dientes de ajo", "1-5 chiles rojos (¡tan calientes como te atreves!)", "2cm / 1 en pieza de jengibre, rallado", "50ml / 2fl oz de aceite vegetal", "25ml / 1 fl oz vinagre de vino blanco o rojo", "3 cucharadas de salsa de soja", "1-2 cucharadas de Tabasco (otra vez tan caliente como te atreves!)", "2 cucharadas de pimentón ahumado", "3 cucharaditas de orégano seco", "1 cucharadita de azúcar en polvo (opcional)", "1 lima, ralladura y jugo", "3 cebollas rojas", "500g / 1lb 2oz de nuevas papas", "1 lima, solo jugo", "1 cucharadita de azúcar en polvo (o un trozo de miel)", "3 cucharadas de aceite de oliva virgen extra", "130g / 4½oz de hojas crujientes de ensalada"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque el pollo en una lata grande para asar y sazone bien con sal y pimienta y un chorrito de aceite. Coloque en el horno y cocine durante aproximadamente una hora.", "Para la salsa peri peri, pele y corte aproximadamente el ajo, divídalo a la mitad, desgrane y pique finamente los chiles y colóquelos en un tazón pequeño. Agregue el resto de los ingredientes de la salsa peri peri y revuelva para combinar.", "Saca el pollo del horno y echa tres cuartas partes de la salsa peri peri sobre el pollo y extiéndelo con la parte posterior de una cuchara. Pele y corte las cebollas, dejando las raíces intactas y revuélvalas alrededor del pollo junto con las papas. Sazonar con sal y pimienta y luego volver al horno para cocinar durante los últimos 40-50 minutos. Al final del tiempo de cocción, lo más probable es que el pollo se vea quemado, pero no se preocupe, este es el estilo peri peri.", "Para verificar que el pollo esté cocido, perfore la parte más gruesa de un muslo con la punta de un cuchillo afilado y los jugos deben quedar limpios (sin ningún color rosado). Una vez cocido, levante con cuidado el pollo de la lata de asar en un plato y cúbralo con papel de aluminio para que pueda descansar y volverse más jugoso. Usando una cuchara ranurada, quite las verduras de la lata también, transfiriéndolas a un plato mediano a prueba de horno. Luego, colóquelos nuevamente en el horno (con el horno ahora apagado) para mantenerlos calientes.", "Con cuidado, vierta el aceite de la lata de asar, dejando atrás el jugo y las piezas adhesivas. Ponlo a fuego medio y agrega la salsa restante y el agua, el caldo o el vino tinto. Deje que hierva a fuego lento durante unos minutos, raspando todos los pedazos pegajosos de la parte inferior.", "Mientras tanto, prepara la ensalada. Exprime el jugo de lima en una taza o tazón pequeño y agrega el azúcar (o miel), el aceite de oliva virgen extra y un poco de sal y pimienta. Dale una buena batida. Incline las hojas de ensalada en un tazón grande para servir ensaladas, vierta el aderezo y revuelva las hojas.", "Volviendo al pollo, vierta los jugos en el plato en la salsa antes de cortar la carne. Haga arreglos para servir los platos con las cebollas y las patatas asadas. Sirva con la ensalada y la salsa en una jarra pequeña."], "url": "www_bbc_co_uk_food_recipes_peri_peri_roast_chicken_75450", "title": "Piri-piri pollo asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peri_peri_roast_chicken_75450_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de pimentón", "2 cucharadas de chile en polvo suave", "250ml / 9fl oz de jugo de limón", "1½ cucharadita de jengibre picado", "3 dientes de ajo, aplastados", "1 cucharadita de sal", "12 gambas crudas", "1 cucharada de aceite de oliva"], "method": ["En un tazón, mezcle el pimentón, el chile en polvo, el jugo de limón, el jengibre, el ajo y la sal.", "Agregue las gambas a la mezcla. Para un sabor máximo, déjelos marinar durante una hora más o menos.", "Caliente una sartén y agregue un poco de aceite de oliva.", "Agregue las gambas a la sartén y la plancha durante unos minutos, volteándolas ocasionalmente hasta que estén cocidas. Servir inmediatamente, con tazones para los dedos."], "url": "www_bbc_co_uk_food_recipes_periperiprawns_83898", "title": "Gambas peri-peri", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / ½ litro de leche entera, preferiblemente Channel Island", "6 yemas de huevo de rango medio", "100 g / 4 oz de azúcar en polvo", "Jersey de 300 ml / ½ pinta o crema coagulada, o una mezcla de los dos", "200ml / 7fl oz de flor de saúco cordial", "4 hojas de gelatina", "500ml / 18fl oz perry (sidra de pera espumosa)", "75g / 2¾oz de azúcar en polvo", "Bayas mixtas de 125g / 5oz, como arándanos, frambuesas y fresas silvestres"], "method": ["Para el helado de flor de saúco, hierva la leche en una cacerola de base pesada y luego retírela del fuego. Batir las yemas de huevo y el azúcar en un tazón, verter la leche y batir bien. Regrese a la sartén y cocine a fuego lento durante unos cinco minutos, revolviendo constantemente con un batidor. No hiervas Retire del fuego y mezcle con la crema y el cordial de flor de saúco. Dejar enfriar, luego batir en una máquina de helados (de acuerdo con las instrucciones del fabricante) hasta que espese. Decantar en un recipiente limpio y colocar en el congelador.", "Para la gelatina de perry y las frutas de verano, sumerja las hojas de gelatina de a una por vez en un recipiente poco profundo de agua fría y déjelas por un minuto más o menos hasta que estén suaves. Ponga a hervir 100 ml / 3½ fl oz del perry en una cacerola mediana, agregue el azúcar y revuelva hasta que se disuelva. Escurrir y exprimir las hojas de gelatina, luego agregar al perry caliente y remover hasta que se derrita. Retire del fuego, agregue el resto del perry y revuelva bien. Pon la sartén de jalea en algún lugar fresco, pero no la dejes reposar.", "Divida la mitad de las bayas entre cuatro moldes de gelatina individuales, o use un molde grande. Vierta la mitad de la gelatina enfriada. Enfríe por una hora o más para preparar, luego completa con el resto de las bayas y desarma la gelatina. (Esto garantiza que las bayas permanezcan suspendidas y no floten hacia la parte superior.) Regrese a la nevera para enfriar hasta que se asienten.", "Para servir, coloque las gelatinas en platos y coloque una bola del helado de flor de saúco en el centro de cada una."], "url": "www_bbc_co_uk_food_recipes_perryjellyandsummerf_86328", "title": "Jalea de Perry y frutas de verano con helado de flor de saúco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4-6 buenos puñados de carne de pavo sobrante", "3 dientes de ajo", "sal", "2 cucharadas de miel", "2 cucharadas de salsa de soja", "una cucharada de salsa de chile", "una cucharada de ketchup de tomate", "una cucharada de mostaza en grano", "pimienta negra", "aceite de cacahuete", "2 naranjas", "una toronja", "4 puñados de berro"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Pele la carne cocida del pavo, manteniendo las piezas lo más grandes que pueda. Serán más jugosos de esa manera.", "Pele el ajo y añádalo a un mortero junto con una generosa pizca de sal. Moler a una pasta y transferir a un tazón. Agregue la miel, la salsa de soya, la salsa de chile, el ketchup, la mostaza y un chorrito de aceite de cacahuete. Sazone con un poco de pimienta negra, luego agregue la carne de pavo. Mezcle suavemente y luego incline todo en una fuente para hornear. Hornee por 20 minutos o hasta que la carne esté reluciente.", "Mientras tanto, prepara la ensalada. Pele las naranjas y pomelos con un cuchillo afilado, luego corte en rodajas finas. Mezcle con el berro.", "Para servir, amontone el pavo caliente sobre la ensalada y sirva."], "url": "www_bbc_co_uk_food_recipes_perky_turkey_62741", "title": "Pavo perky", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz-1.3kg / 3lb rabo de toro (pídale a su carnicero que lo corte en secciones entre las vértebras)", "2½ cucharadas de mezcla de especias de guiso persa o 2 cucharaditas de cúrcuma molida, semillas de comino molido y cilantro molido, mezcladas", "3 cucharadas de aceite de colza", "2 cebollas, finamente picadas", "1 manojo de acelga, tallos blancos finamente picados, vegetales de hojas gruesas picadas", "4 palitos de apio, cortados en trozos de 2cm / 1in", "4 dientes de ajo, en rodajas finas", "3 puñados de perejil fresco, 2 tostados y 1 finamente picado", "2 puñados de cilantro fresco, 1 toscamente picado, 1 finamente picado", "1 puñado de menta fresca, picada", "1 manojo de eneldo fresco, aproximadamente picado", "2 puñados de hojas de apio, más o menos picadas", "2 litros / 3½ pintas de caldo de verduras o agua", "4 cucharadas de melaza de granada", "2 limas secas, pinchadas", "150g / 5½oz de cebada perlada", "50g / 1¾oz de mantequilla, cortada en cubos", "100ml / 3½fl oz de jugo de limón recién exprimido", "sal y pimienta negra recién molida", "8-10 nabos para bebés, cortados o 2-3 nabos regulares, cortados en trozos de 3cm / 1½ pulgadas", "40 g / 1½ oz de mantequilla", "1 cucharada de azúcar en polvo"], "method": ["Pon el rabo de toro en un recipiente. Agregue 1 cucharada de las especias y una pizca de sal y pimienta y frótelas en la carne.", "Caliente 1 cucharada de aceite en una cacerola grande de base pesada y cocine el rabo de toro en tandas, girándolas para asegurarse de que se doren por todos lados. Transfiera el rabo de buey a un plato y déjelo a un lado.", "Calentar el resto del aceite en la misma sartén y freír las cebollas, los tallos de acelga y el apio a fuego medio. Sazone con sal y pimienta, agregue el resto de la mezcla de especias y cocine durante 10 minutos, hasta que las cebollas estén blandas. Agregue el ajo y cocine por 3 minutos. Agregue las hierbas picadas y las hojas de apio y la mitad de las acelgas suizas.", "Encienda el fuego, coloque el rabo de toro en la sartén y cocine, revolviendo ocasionalmente, durante 10 minutos, o hasta que los verdes hayan perdido el líquido. Agregue el caldo y la melaza de granada y deje que hierva. Reduzca el fuego a muy bajo, agregue las limas secas, cubra y cocine durante 5 horas. Alternativamente, transfiéralo a un plato con tapa para horno y cocínelo en un horno precalentado a 140C / 120C Fan / Gas 1.", "Retire la tapa, cuele 150ml / 5fl oz del líquido de cocción y reserve. Agregue la cebada a la olla y cocine a fuego lento durante otra hora con la tapa apagada, revolviendo ocasionalmente.", "Para los nabos de bebé, blanquear los nabos en una olla grande de agua hirviendo durante 3 minutos y luego escurrir bien. Caliente la mitad de la mantequilla en una sartén grande y agregue el azúcar y los nabos. Una vez que el azúcar se haya disuelto, agregue el líquido de cocción de rabo de buey reservado y hierva hasta que casi todo el líquido se haya reducido y los nabos se hayan coloreado. Agregue el resto de la mantequilla y agite la sartén hasta que los nabos estén bien esmaltados por todas partes. Sazone al gusto con sal y pimienta y reserve.", "A estas alturas, el caldo de rabo de toro debería haberse reducido en más de la mitad. Si no, cocine a fuego lento durante otros 30 minutos. Cuando esté espeso y concentrado, agregue la mantequilla, el jugo de limón, las hierbas finamente picadas y las acelgas suizas restantes y revise el condimento.", "Para servir, divida el guiso entre platos para servir o coloque la sartén en el medio de la mesa y cubra con los nabos glaseados."], "url": "www_bbc_co_uk_food_recipes_persian-style_oxtail_79571", "title": "Guiso de rabo de buey de estilo persa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pepino grande, rallado grueso o cortado en cubitos finos", "500ml / 18fl oz de yogur griego", "1 diente de ajo grande, aplastado", "20g / ¾oz de eneldo, tallos y hojas finamente picadas", "sal marina y pimienta negra recién molida", "aceite de oliva virgen extra, para lloviznar"], "method": ["Exprima con cuidado y deseche el exceso de agua del pepino rallado; puede hacerlo a mano o en un colador. Coloque el pepino rallado en un tazón y mezcle el yogur.", "Agregue el ajo y el eneldo, mezcle bien y sazone al gusto con sal marina y pimienta negra. Sirva con un chorrito de aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_persian_cucumber_and_81162", "title": "Ensalada de pepino y yogur persa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de arroz basmati", "sal marina", "100g / 3½oz de cilantro fresco, hojas recogidas", "100 g / 3½ oz de perejil fresco de flatleaf, hojas recogidas", "40 g / 1½ oz de cebollín fresco", "40 g / 1½ oz de eneldo, hojas recogidas", "125g / 4½ oz cebollas de primavera", "3 cucharadas de aceite de verduras", "150g / 5½oz de mantequilla sin sal"], "method": ["Lave el arroz en agua fría en un tazón grande, luego enjuague y drene. Repite el proceso con más agua fría hasta que el agua salga limpia. Cubra el arroz con agua fría, agregue un generoso puñado de sal marina al agua y deje que el arroz se remoje durante 2-3 horas. (El remojo no es esencial, pero incluso 30 minutos de remojo ayudará a alargar los granos, lo que lo convertirá en un plato de arroz más elegante).", "Pique finamente las hierbas y las cebolletas, o alternativamente, páselos en un procesador de alimentos en dos tandas hasta que estén finamente picados. Aparte las hierbas, agregue las cebolletas al procesador de alimentos y pique como antes. Agregue a las hierbas y reserve.", "Coloque una olla grande o una olla a fuego medio. Llene la sartén con agua hirviendo, escurra el arroz y agregue a la sartén junto con otro generoso puñado de sal marina, las hierbas picadas y las cebolletas. Revuelva bien y deje hervir durante 6-8 minutos, o hasta que el arroz esté sancochado (cuando los granos cambien de un opaco blanquecino normal a un blanco más brillante, aunque todavía no se hayan vuelto esponjosos). Escurra el arroz y las hierbas en un colador y déjelos a un lado (no los enjuague).", "Regrese la sartén al fuego y agregue el aceite, unas perillas generosas de mantequilla y una cucharada de sal marina. Distribuye el arroz en la sartén. Asegúrese de esparcirlo, no lo empaque, porque quiere que la ligereza del arroz que cae permita que se eleve el vapor. Agregue la mantequilla restante. Envuelva la tapa de la sartén con una toalla de té (para trabar el vapor y selle firmemente), cubra la sartén y cocine durante 8 minutos a fuego medio-alto. Luego reduzca el fuego a bajo-medio y cocine por otros 25-30 minutos.", "Una vez que el arroz esté cocido, quítelo de la sartén (me gusta colocar un plato grande sobre la sartén y poner el arroz en el plato), luego raspe el sabroso tahdig (que significa \"parte inferior de la sartén\" - esto es la corteza mordisquea cada pez persistente) y sirve esto encima del arroz."], "url": "www_bbc_co_uk_food_recipes_persian_herb_rice_21636", "title": "Arroz de hierbas persas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "4 cebollas, 2 toscamente picadas, 2 rodajas finas", "2 cucharaditas de cúrcuma molida", "3 dientes de ajo, finamente picados", "400 g de garbanzos de lata, escurridos", "100g / 3½oz de pequeñas lentejas marrones", "400 g de alubias, escurridas", "1 litro / 1¾ pinta de caldo de verduras", "40 g / 1½ oz de mantequilla", "Linguine 100g / 3½oz o fideos reshteh iraníes", "200g / 7oz de espinaca", "30g / 1oz de perejil fresco", "20g / ¾oz de cilantro fresco", "15g / ½ oz de menta fresca", "2 x 250 ml / 9 fl oz tinas crema agria"], "method": ["Calentar el aceite de oliva en una sartén grande a fuego medio, y freír las cebollas durante 5 minutos, o hasta que estén suaves y doradas. Agregue la cúrcuma y el ajo y cocine por otros 4 minutos.", "Agregue los garbanzos, lentejas y judías a las cebollas y vierta en el caldo. Cocine a fuego lento durante 30 minutos, revolviendo de vez en cuando.", "Derrita la mantequilla en una sartén antiadherente a fuego lento. Freír las cebollas en rodajas durante 20 minutos, revolviendo ocasionalmente, hasta que estén profundamente caramelizadas.", "Cuando los frijoles hierven a fuego lento durante 30 minutos, agregue los fideos a la olla y cocine por otros 10 minutos.", "Saque las espinacas en una sartén con un poco de agua durante 2 minutos, escurra y exprima todo el líquido que pueda. Pica bien las espinacas en un tablero, junto con el perejil, el cilantro y la menta.", "Revuelva la espinaca y las hierbas en los fideos y los frijoles. Dobla la crema agria y sirve con las cebollas caramelizadas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_persian_noodle_soup_76589", "title": "Sopa de fideos persa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/persian_noodle_soup_76589_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 5-7kg / 11-15½lb lechón", "120ml / 4fl oz de jugo de naranja", "120ml / 4fl oz de salsa de chile al estilo peruano (disponible de especialistas en línea)", "120ml / 4fl oz de pisco (aguardiente), preferentemente peruano", "120ml / 4fl oz de jugo de maíz morado (llamado chicha morada, disponible de especialistas en línea)", "8 dientes de ajo, aplastados", "1 cucharada de comino molido", "sal y pimienta negra recién molida", "quinua, vegetales salteados, mandioca frita y batatas asadas, para servir (solo para sugerencias)"], "method": ["Para el adobo, mezcle todos los ingredientes del adobo en un tazón grande hasta que estén bien combinados.", "Con un cuchillo afilado de hoja delgada, perforar agujeros en toda la piel del lechón, a unos 5 cm de separación.", "Coloque una bolsa de comida del tamaño de una bolsa de basura dentro de otra, luego coloque el cochinillo en las bolsas y vierta el adobo. Agite la bolsa para cubrir el cerdo en el adobo. Exprima la mayor cantidad de aire de las bolsas como sea posible, asegúrelo bien, luego póngalo a un lado en la nevera para marinar durante 24 horas, y déle vuelta al cochinillo después de 12 horas.", "Una vez que el lechón se haya marinado, retírelo de la nevera y déjelo a temperatura ambiente durante 6 horas.", "Cuando el lechón vuelva a la temperatura ambiente, precaliente el horno a 190C / 170C Fan / Gas 5.", "Retire el cochinillo de las bolsas y transfiéralo a una bandeja grande para asar. Envuelva la cabeza, los trotones y la cola en papel de aluminio, luego tueste en el horno por 15 minutos o hasta que la piel esté dorada.", "Reduzca la temperatura del horno a 150C / 130C Ventilador / Gas 2 y continúe asando el cochinillo durante 3 horas (para un cerdo de 5 kg / 11 libras) y 4 horas (para un cerdo de 8 kg / 15½ libras). Controle al lechón cada 30 minutos aproximadamente para asegurarse de que la piel no se está quemando, hilvanando con los jugos de tostado cada vez. (Si la piel se está dorando demasiado rápido, reduzca la temperatura del horno unos 10 grados más o menos). Durante los últimos 30 minutos de cocción, retire la lámina del cerdo para dorar la cabeza, los trotones y la cola.", "Retire el lechón del horno y vierta los jugos de tostado en una olla. Coloque el cerdo a un lado para descansar por lo menos durante 15 minutos.", "Mientras tanto, caliente los jugos de tostado a fuego medio. En un tazón pequeño, mezcle 1 cucharada de harina de maíz y suficiente agua para formar una pasta espesa con la consistencia de crema doble. Agregue la mezcla a los jugos de tostación para espesarlos. Si se espesan demasiado, adelgace con más agua hirviendo si es necesario. Revuelva los ingredientes juntos durante 10 minutos, o hasta que la salsa esté suave y espesa.", "Para servir, esculpe el cochinillo en la mesa y coloque las rebanadas en los platos para servir. Rocíe sobre la salsa. Sirva con verduras y granos de estilo peruano, como quinua, vegetales salteados, mandioca frita o camote asado."], "url": "www_bbc_co_uk_food_recipes_peruvian-style_suckling_45466", "title": "Cochinillo de estilo peruano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 8¾oz de harina natural, más extra para quitar el polvo", "2 cucharaditas de azúcar", "½ cucharadita de sal", "½ cucharadita de polvo de hornear", "110-130 ml / 4½ fl oz de leche", "2 cucharadas de aceite vegetal", "30g / 1oz de almendras en copos", "1 cucharada de mantequilla, derretida, para servir", "70 g / 2½ oz de pistachos, conchas eliminadas", "35 g / 1¼ oz pasas", "1½ cucharadita de azúcar en polvo"], "method": ["Tamizar la harina, el azúcar, la sal y el polvo de hornear en un bol. Mezcle la leche y el aceite juntos en un recipiente aparte. Haga un pozo en el centro de los ingredientes secos y vierta los ingredientes líquidos.", "Lentamente mezcle la masa trabajando desde el centro e incorporando la harina desde los bordes del pozo hasta que tenga una masa suave y suave. Amasar durante 8-10 minutos, agregando un poco de harina si la masa es demasiado pegajosa.", "Coloque en un tazón engrasado, cubra con una toalla de té húmeda y deje en un lugar cálido durante al menos una hora, hasta que la masa se haya duplicado en tamaño. Luego retrocede y forma en cinco bolas del mismo tamaño.", "Para el llenado, pulse juntos los pistachos, las pasas y el azúcar en un procesador de alimentos hasta que la mezcla forme un polvo grueso. Divida en cinco porciones iguales.", "Precaliente la parrilla a su configuración más alta y coloque una bandeja para hornear pesada en el estante superior para calentar.", "Estirar cada una de las cinco porciones de bolas de masa en círculos gruesos. Llene la mitad de cada círculo con una porción del relleno dejando aproximadamente un margen de una pulgada alrededor del borde. Moje la masa alrededor de los bordes con un poco de agua y doble cada círculo por la mitad para encerrar el relleno. Pellizca la masa alrededor de los bordes para cerrar.", "Suavemente despliegue cada Naan en forma de lágrima u oval. Espolvorea sobre las almendras copos. Coloque el naan en la bandeja para hornear caliente y ase a la parrilla durante aproximadamente 1-2 minutos hasta que haya agradables manchas marrones en la superficie. Cepille con la mantequilla derretida y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_peshwarinaan_86757", "title": "Peshwari naan", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Rinde 5 panes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de albahaca", "30 g / 1 oz de piñones, tostados", "30g / 1 oz de queso parmesano, o queso vegetariano similar, recién rallado", "1 diente de ajo, aplastado", "85ml / 3fl oz de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Coloque la albahaca, el parmesano, el ajo y los piñones en un procesador de alimentos y sazone bien.", "Gire juntos y con el motor todavía en funcionamiento, vierta el aceite hasta que el pesto se espese.", "Almacene en un recipiente limpio en el refrigerador cubierto con una capa de aceite para evitar que se seque."], "url": "www_bbc_co_uk_food_recipes_pesto_2281", "title": "pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]