[{"ingredients": ["1 puerro, finamente cortado", "1 diente de ajo, aplastado", "mantequilla, para sudar", "Queso cheddar de 140 g / 5 oz, rallado", "Pan rallado blanco fresco de 140g / 5oz", "2 cucharadas de perejil finamente picado", "½ cucharadita de mostaza en polvo inglesa", "1 huevo, golpeado", "Aceite para freír", "sal y pimienta negra recién molida"], "method": ["Sudor los puerros en la mantequilla hasta que estén blandos. Agregue el ajo y cocine por otros 5 minutos", "Mezcle todos los ingredientes en un tazón. Verifica el condimento.", "Forme bolas, cúbralas con film transparente y deje enfriar durante 30 minutos.", "Precalentar el aceite en una sartén y cocinar las bolas hasta que se doren y servir con una ensalada verde"], "url": "www_bbc_co_uk_food_recipes_glamorgansausages_67636", "title": "Salchichas Glamorgan", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 paquete de fideos de vidrio", "200 g / 7 oz de pechuga de pollo finamente picada", "sal", "4 cucharaditas de jugo de lima", "100g / 3½oz de carne de cangrejo", "pequeño cilantro puñado, albahaca tailandesa y hojas de menta", "3 limas, solo jugo", "2 dientes de ajo, pelados pero dejados enteros", "3 chalotes tailandeses, pelados", "2 chiles rojos largos, semillas retiradas de una", "Azúcar de palma 40g / 1½oz", "40ml / 1½fl oz de salsa de pescado", "Tallos corainader 20g / 1oz", "50g / 1¾oz de chalotes tailandeses, en rodajas finas", "2 dientes de ajo, en rodajas", "2 chiles rojos, en rodajas finas", "50 g / 1¾oz de arroz molido asado (disponible en línea y en tiendas de comestibles tailandesas)", "5 chalotes (preferiblemente tailandeses) en rodajas", "chile en polvo, al gusto", "1 guindilla roja, sin semillas, en rodajas", "1 pepino, cortado en cubitos"], "method": ["Reconstituya los fideos de acuerdo con las instrucciones del paquete.", "Ponga a hervir una cacerola de agua, sazone con un poco de sal y cocine el pollo picado durante tres minutos, o hasta que esté cocido, separándolo con un batidor. Drene y deje enfriar en una bandeja para hornear.", "Para el nam jim, use un almirez y mortero para machacar el jugo de lima, ajo, chalotes, chile, azúcar de palma, salsa de pescado y raíces de cilantro para hacer una salsa suave.", "Para la cubierta crujiente, caliente el aceite vegetal en una sartén. Freír los chalotes, el ajo y el chile hasta que estén crujientes.", "En un plato grande, combine el pollo drenado, salsa de pescado, jugo de lima, carne de cangrejo, fideos drenados, hierbas y nam jim. Espolvorear con arroz molido asado, chalotes, chile en polvo, chile rojo y pepino. Termine con la cubierta crujiente y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_glass_noodle_salad_with_39907", "title": "Ensalada de fideos de vidrio con cangrejo y pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2kg / 4lb 8oz pedazo de falda plana", "2 zanahorias grandes, en rodajas", "2 cebollas grandes, en rodajas", "manojo de tallos de perejil fresco", "12 granos de pimienta", "1 hoja de laurel", "2 cucharadas de aceite", "4 cucharadas de jerez dulce", "2 cucharadas de jengibre molido", "3 cucharadas de salsa de soja oscura", "1 cucharada de jugo de limón", "1 cucharada de azúcar moreno", "2 cucharadas de aceite de cacahuete", "Tabasco, al gusto", "1 cucharada de mostaza integral", "2 cucharadas de vinagre de jerez", "8 cucharadas de aceite de colza", "500g / 1lb 2oz Tenderstem brócoli, cortado en floretes", "2 cabezas Little Gem Lettuce", "sal marina"], "method": ["Pon la pechuga en una olla grande con zanahorias y cebollas.", "Ate los tallos de perejil, los granos de pimienta y la hoja de laurel en una bolsa de muselina y agregue a la olla.", "Cubre bien con agua fría y lleva a ebullición. Baje el fuego a fuego lento. El agua debería estar simplemente \"temblando\".", "Cocine, sin tapar, por hasta tres horas, dependiendo del grosor de la carne. Rellene el agua a medida que se evapora para garantizar que la carne no se seque. Para verificar que la carne esté cocida, perforar con un tenedor para hornear y levantarla, la carne debería comenzar a deslizarse fuera de la horquilla.", "Transfiera la carne a un recipiente grande. Cuele el licor de cocción y viértalo sobre la carne, luego déjelo enfriar.", "Vierta el licor de cocción, cubra la carne con film transparente y coloque una bandeja encima con pesas para presionar la carne.", "Cuando esté frío, corte la pechuga en pedazos agradables del tamaño de un filete.", "Para el adobo, mezcle todos los ingredientes.", "Para asar los filetes, caliente el aceite en una sartén de plancha o precaliente una barbacoa. Ase los filetes, cepillándolos frecuentemente con el adobo, hasta que estén calientes.", "Para el aderezo, mezcle todos los ingredientes.", "Para la ensalada, blanquee el brócoli en agua hirviendo con sal, luego drene y revuelva en agua fría.", "Separar las hojas exteriores de las Pequeñas gemas, echarlas en el aderezo y colocarlas en platos para servir, luego repita con los corazones. Mezcle el brócoli en el aderezo y póngalo encima de las hojas. Coloque la carne encima y sirva."], "url": "www_bbc_co_uk_food_recipes_glazed_brisket_steaks_27835", "title": "Filetes de falda glaseada con ensalada de brócoli", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 membrillo, pelado y cortado por la mitad", "200 g / 7 oz de azúcar en polvo", "1 estrella de anís", "2 dientes", "1 ramita de canela", "1 hoja de laurel", "¼ naranja, solo ralladura", "100g/3½oz membrillo (quince paste)", "8 pinchos de madera, empapados en agua durante unas horas", "2 pechugas de pato pequeñas, recortadas", "60g / 2¼ oz de panceta ahumada", "sal y pimienta", "aceite de oliva, para cocinar"], "method": ["Coloque todos los ingredientes para el membrillo escalfado, excepto el membrillo, en una olla y agregue 450 ml / 16 fl oz de agua. Deje que hierva lentamente, luego baje a fuego lento y cocine por 1½-2 horas, o hasta que el membrillo esté cocido y se haya puesto rojo oscuro. No cocine demasiado, de lo contrario el membrillo caerá de los pinchos.", "Deje que el membrillo se enfríe en el líquido de caza furtiva, luego remueva y corte en cubos de 1.5cm. Llevar el líquido de cocción a ebullición a ebullición y cocine hasta que el volumen de líquido se haya reducido a la mitad a un glaseado. Batir en el membrillo hasta que se disuelva.", "Para los pinchos, caliente una sartén antiadherente a fuego medio y luego agregue los pechugas de pato con la piel hacia abajo para procesar la grasa y dorar la piel. Vierta la grasa 2-3 veces mientras se cocina.", "Dé la vuelta a los senos y cocine durante 1-2 minutos antes de sacarlos de la sartén para que se enfríen y descansen. Cuando esté lo suficientemente frío como para cortar, corte el pato en cubos de 1.5 cm.", "Corta la panceta en trozos del mismo tamaño que el pato pero la mitad de grueso. Pase un pedazo de pato en cada broche seguido de la panceta y luego el membrillo. Repita esto en cada pincho.", "Caliente una parrilla a fuego medio; sazone los pinchos y cepille con un poco de aceite. Grill durante 2-3 minutos, girando sobre la marcha. Un minuto antes de que estén listos cepillar con un poco de glaseado de membrillo. El pato aún debe ser rosado, con la panceta cocida y debe haber una apariencia pegajosa.", "Sirva los pinchos junto con una olla del glaseado restante para sumergir."], "url": "www_bbc_co_uk_food_recipes_glazed_duck_spiced_80525", "title": "Pato glaseado, membrillo especiado y panceta pinchos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 8 pinchos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz grosellas rojas", "preservando el azúcar", "3 naranjas, jugo y ralladura", "3 limones, jugo y ralladura", "150ml / 5fl oz puerto rojo", "50ml / 2fl oz de vinagre de vino tinto", "2 dientes", "1 ramita de canela", "pellizcar jengibre molido", "150g / 51 / 2oz de goteo de miel", "100 g / 31/2 oz Demerera azúcar", "hojas de 2 ramitas de tomillo fresco", "50ml / 2fl oz de jugo de grosella", "1/2 cucharadita de mostaza inglesa", "1 rincón cocinado de jamón"], "method": ["Para la gelatina, coloque las grosellas rojas en una sartén con un poco de agua, cocine a fuego lento y cocine hasta que la fruta explote. Incline en una bolsa de gelatina y cuele durante la noche en un tazón grande.", "Al día siguiente, mida el jugo, colóquelo en una sartén y agregue 450 g / 1 libra de azúcar conservante por cada 600 ml / 20 onzas de jugo. Disuelva el azúcar a fuego alto y hierva durante 5-10 minutos y luego retire la sartén del fuego.", "Precalienta el horno a 190 ° C / 375 ° F / Gas 5. Coloca el jugo y la ralladura de naranja y limón en una olla limpia, lleva a ebullición, luego reduce el fuego y agrega el orujo, el vino, el vinagre y las especias. Cocine a fuego lento durante 20 minutos, luego agregue 300 g / 10½ oz de la mezcla de gelatina de grosella roja y cocine a fuego lento durante 10 minutos más. Retire la sartén del fuego y déjela enfriar.", "Para el jamón, mezcle la miel, el azúcar, el tomillo, el jugo de grosella y la mostaza para hacer el glaseado. Corta la superficie del jamón en un patrón de diamante y frota en el esmalte. Coloque el jamón en una lata para asar y tueste durante 40-50 minutos, rociándolo de vez en cuando.", "Permita que el jamón se enfríe a temperatura ambiente y luego córtelo en rodajas. Sirva con gelatina, trozos de pan y apio, manzana y ensalada de perejil fresco."], "url": "www_bbc_co_uk_food_recipes_glazed_ham_with_56539", "title": "Jamón glaseado con grosella y gelatina de cítricos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 1 jamón", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal, y más para freír", "2 pak choi, descuartizado", "1 diente de ajo, aplastado", "2 cucharadas de salsa de soja", "2 chalotes, pelados y en rodajas finas", "50g / 1¾oz anacardos, tostados"], "method": ["Caliente una cucharada de aceite vegetal en un wok y saltee el pak choi por un minuto. Añadir el ajo y cocinar por otro minuto. Agregue la salsa de soja y mezcle bien.", "Caliente el aceite en una cacerola profunda de fondo pesado. Está listo cuando una miga de pan chisporrotea suavemente en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido). Freír los chalotes en el aceite hasta que estén dorados. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloca el pak choi en un plato y espolvorea los chalotes crujientes y los anacardos."], "url": "www_bbc_co_uk_food_recipes_glazedbokchoiwithcri_82542", "title": "Pak choi glaseado con chalotes crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 mejillas de cerdo, recortadas", "1 cebolla picada", "1 zanahoria, pelada y picada", "1 palito de apio, picado", "1 cucharada de miel", "500ml / 18fl oz de caldo de pollo o ternera", "1 hoja de laurel", "2 dientes de ajo", "ramita de tomillo", "1 estrella de anís", "2 dientes", "1 pera, en juliana, para servir", "1 rebanada de apio nabo, en juliana, para servir", "salpicaduras de aceite de oliva, para servir", "1 limón, solo jugo, para servir", "sal y pimienta negra recién molida", "2 cucharadas de setas porcini secas", "1 cucharada de aceite de oliva", "1 chalote, picado", "1 diente de ajo, picado", "3 setas de campo picadas", "6 hongos castaños, picados", "1 cucharadita de azúcar moreno", "1 cucharadita de vinagre de vino blanco", "pizca de salsa Worcestershire", "sal y pimienta negra recién molida", "100ml / 3½fl oz de vinagre de vino blanco", "100ml / 3½fl oz de agua hirviendo", "6 hongos castaños, cortados en cuartos", "1 cucharadita de mostaza Dijon", "1 cucharadita de estragón fresco picado"], "method": ["Coloque las mejillas en una cazuela grande y sazone bien con sal y pimienta. Coloque la cazuela sobre la placa a fuego medio y cocine hasta que las mejillas estén doradas. Retire del fuego, agregue la cebolla, la zanahoria, el apio y la miel y revuelva para cubrir las mejillas y las verduras en el glaseado de miel. Vierta el caldo en el plato y mezcle la hoja de laurel, el ajo, el tomillo, el anís estrellado y el clavo de olor. Cocine a fuego lento durante 2 horas, o hasta que las mejillas estén tiernas. Retire las mejillas, cuele el licor y devuelva este líquido al plato. Cocine a fuego lento y reduzca el licor hasta que tenga una consistencia espesa. Deja de lado las mejillas y el licor.", "Para el ketchup de champiñones, ponga los ceps en un recipiente pequeño y cúbralos con agua hirviendo. Deje que se ablande y luego retire los ceps, reservando el agua. Calentar el aceite en una sartén pequeña y sudar la chalota y el ajo hasta que estén suaves. Agregue los champiñones, los ceps y su licor y cocine hasta que estén blandos. Sazone con sal y pimienta y agregue el azúcar, el vinagre y la salsa Worcestershire. Coloque en una licuadora y blitz, luego reserve.", "Para los champiñones encurtidos, mezcle el vinagre y el agua hirviendo en un tazón pequeño. Agregue los champiñones al agua de vinagre y deje por 2 horas para ablandar y encurtir. Retire los champiñones y mezcle con la mostaza, unas cucharadas de licor de encurtido y estragón. Dejar de lado.", "Para servir, divida las mejillas glaseadas y el ketchup entre dos platos calentados y espolvoree un poco del licor de la mejilla. Dispersar sobre las setas en escabeche. Coloque la pera, el apio nabo, el aceite y el jugo de limón en un recipiente y sazone con sal y pimienta. Vierta la mezcla de pera en forma pareja sobre los platos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_glazed_pork_cheeks_with_59624", "title": "Mejillas de cerdo glaseadas con ketchup de champiñones", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 quesos de galés de cabra, cada uno de 120 g / 4 oz", "aceite de oliva", "hojas de tomillo", "Azúcar 120 g / 4 oz", "3 remolachas grandes, cocidas, peladas y picadas", "2 cucharaditas de vinagre balsámico", "sal y pimienta negra recién molida", "12 remolachas crudas", "2 ramitas de tomillo", "150g / 5½oz Snowdon hierbas de montaña, tales como alazán de madera, berro amargo, pennywort (u otras hierbas silvestres)", "20 g / 1 oz de piñones, tostados, para adornar"], "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Coloque los quesos en un recipiente con un poco de aceite de oliva y tomillo y déjelos marinar mientras prepara la remolacha.", "Derrita el azúcar en una cacerola de fondo grueso a fuego moderado, luego cocine hasta que el azúcar se haya dorado. Agregue la remolacha cocida y cocine durante otros tres minutos, revolviendo hasta que la remolacha esté completamente cubierta con el caramelo. Retire del fuego y agregue el vinagre balsámico. Transfiera a un procesador de alimentos y mezcle hasta lograr una consistencia suave.", "Vierta el puré en un colador forrado de muselina colocado en un recipiente y deje que el líquido se escurra. Sazone el líquido al gusto con sal y pimienta negra recién molida y duplique el volumen con aceite de oliva para crear un aderezo. Sazone el puré con sal y pimienta negra recién molida. Coloque tanto el aderezo como el puré a un lado.", "Envuelva las remolachas baby y las ramitas de tomillo en papel de aluminio para crear un sobre. Coloque en el horno y hornee durante 10-12 minutos. Pelar las remolachas y dejar enfriar.", "Retire los quesos del adobo y seque el exceso de aceite con un paño de cocina. Esmalte las partes superiores de los quesos con una mini soplete (o debajo de una parrilla caliente) hasta que estén doradas.", "Viste las hierbas galesas con el aderezo de remolacha.", "Para armar, extender una cucharada de puré de remolacha en cada plato. Agregue las hierbas vestidas y coloque los quesos glaseados encima. Rocíe sobre el resto del aderezo de remolacha y espolvoree con piñones tostados."], "url": "www_bbc_co_uk_food_recipes_glazedgoatscheeseand_82161", "title": "Queso de remolacha glaseado y remolacha, con ensalada de hierbas galesas y aderezo de remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 pomelo rosado", "3 pomelos blancos", "1 cucharadita de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "1 vaina de vainilla, partido, semillas raspadas con un cuchillo (la vaina vacía se puede reservar para otra receta)", "4 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "60g / 2½oz de acelga roja", "60 g / 2½ oz hojas de mizuna", "Hojas de cohete de 60 g / 2½ oz", "1 cucharada de aceite de oliva", "Filete de salmón de 200 g / 7 oz, sin piel, sin espinas, cortado en 4 piezas", "Filete de besugo de 250 g / 9 oz, con piel, cortado en 4 piezas", "sal y pimienta negra recién molida"], "method": ["Para la ensalada de pomelo glaseada, quite las cáscaras de los pomelos rosado y blanco, luego segúrelos, tomando cualquier exceso de jugo en un recipiente (reserve el jugo).", "Coloque los segmentos alternativamente en un círculo hueco alrededor del borde de las cuatro placas para servir.", "Usando un soplete de cocineros o una parrilla caliente, caliente los segmentos de pomelo hasta que estén ligeramente coloreados, luego déjelos a un lado.", "En un tazón grande, mezcle bien cinco cucharadas de jugo de pomelo con el azúcar impalpable, el vinagre de vino blanco, la mostaza de Dijon y las semillas de vainilla hasta que estén bien combinados. (No se requerirá ningún jugo restante para esta receta).", "Poco a poco mezcle el aceite de oliva virgen extra en una corriente delgada, hasta que esté bien incorporado en el aderezo para ensaladas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque las hojas de ensalada en un recipiente, agregue un poco del aderezo de ensalada, al gusto, luego mezcle bien hasta que las hojas estén cubiertas. Divida la ensalada y colóquela en el centro de cada una de las placas para servir.", "Para el pescado, caliente una sartén a fuego medio hasta que esté caliente. Frote el aceite sobre los filetes de salmón y besugo. Sazonar a ambos lados, al gusto, con sal y pimienta negra recién molida.", "Coloque el filete de salmón en la sartén de la plancha caliente. Freír durante 60 segundos en cada lado.", "Agregue el filete de besugo, con la piel hacia abajo, y fría por 45-60 segundos en cada lado.", "Para servir, coloque una pieza de filete de salmón encima de cada porción de ensalada, luego coloque un trozo de filete de besugo encima. Rocíe sobre el aderezo para ensalada restante."], "url": "www_bbc_co_uk_food_recipes_glazedgrapefruitsala_91224", "title": "Ensalada de pomelo glaseado con salmón y besugo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 yemas de huevo de gallinas camperas", "Azúcar en polvo de 55 g / 2 oz", "150ml / ¼ de pinta de vino blanco", "Crema doble de 150 ml / 1/4 de pinta batida", "1 mango, pelado y rebanado", "½ lima, solo ralladura", "½ naranja, solo ralladura", "ramitas de menta fresca"], "method": ["Para el sabayon, coloque las yemas de huevo, el azúcar y el vino en un tazón grande sobre una sartén con agua hirviendo a fuego lento. Batir con un batidor eléctrico durante 15 minutos, o hasta que la mezcla esté espesa. Retire del fuego y continúe batiendo hasta que se enfríe un poco.", "Dobla el sabayon en la crema batida en un tazón grande.", "Para servir, ventile las rebanadas de mango en un plato de servir y vierte sobre el sabayon. Use un mini soplete para glasear la parte superior y adorne con limón, naranja y ramitas de menta."], "url": "www_bbc_co_uk_food_recipes_glazedmangowithawhit_87948", "title": "Mango glaseado con sabayón de vino blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½oz de pasas", "150 g / 5½ oz de grosella", "150 g / 5½ oz sultanas", "200ml / 7fl oz de 'vino' de jengibre (preferiblemente una versión sin alcohol, como Glendale)", "50ml / 2fl de whisky de oz, más extra para alimentar el pastel", "200g / 7oz de mantequilla, más extra para engrasar", "200g / 7oz de azúcar moreno oscuro", "4 huevos de gallinas camperas", "50 g / 1¾oz de almendras molidas", "Harina normal de 200g / 7oz", "1 cucharada de jengibre de tallo finamente picado", "1 cucharadita de especias mixtas", "2 cucharaditas de jengibre molido"], "method": ["Remoje las pasas, las grosellas y las sultaninas en el vino de jengibre y el whisky en un tazón durante la noche, o preferiblemente durante dos días.", "Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase y forre una lata de pastel de 20 cm / 8 in con mantequilla y papel resistente a las grasas.", "Batir la mantequilla hasta que esté pálida y esponjosa. Agregue el azúcar y mezcle bien.", "Agregue un huevo y las almendras molidas y parte de la harina, luego alternar agregando los huevos restantes y la harina hasta que todos se incorporen.", "Agregue las frutas empapadas y el líquido extra junto con la especia mixta de jengibre y el jengibre molido. Mezclar bien.", "Coloque la mezcla en la lata preparada y hornee durante aproximadamente una hora y 30 minutos, o hasta que un pincho de madera salga limpio. (Revise el pastel después de una hora; es posible que desee cubrir la lata con papel de aluminio para evitar que el pastel se coloree demasiado).", "Una vez que el pastel se haya enfriado, pique todo el pastel con un pincho y alimente el pastel con un poco de whisky. La tarta se puede servir inmediatamente, pero para una torta rica y húmeda adicional repita la alimentación al menos dos veces durante un período de dos semanas.", "Envuelva la torta en un pergamino para hornear o film transparente y guárdelo en un lugar oscuro y seco hasta que esté listo para servir. El pastel se mantendrá durante al menos seis meses."], "url": "www_bbc_co_uk_food_recipes_glendale_ginger_wine_and_17310", "title": "Pastel de vino de gengibre y whisky", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace pastel de 1 x 20 cm / 8 pulgadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas medianas, peladas y cortadas en rodajas gruesas", "1 tallo grande de apio, cortado y cortado en trozos grandes", "1 zanahoria grande, pelada, cortada y cortada en trozos grandes", "1 cabeza grande de ajo, cortado por la mitad", "1 ramita de romero fresco", "1 x 1.5kg / 3lb 5oz hombro de cordero, deshuesado, cortado de exceso de grasa, enrollado y atado", "6 filetes de anchoa enlatados en aceite de oliva, cortados por la mitad", "250ml / 9fl oz de vino blanco seco", "300 ml / ½ pinta de caldo de pollo", "sal y pimienta negra recién molida", "150ml / 5fl oz de crema doble", "1 limón, solo jugo", "1 cucharada de ketchup de tomate", "1 cucharada de puré de tomate", "1 cucharada de miel clara", "1 cucharada de salsa de soja oscura", "1 cucharada de vinagre de malta", "1 cucharada de salsa Worcestershire", "1 cucharada de jarabe de un tarro de jengibre en conserva", "250g / 9 oz de trigo bulgar", "450ml / 16fl oz de caldo de pollo caliente", "sal y pimienta negra recién molida", "90g / 3½oz de mantequilla sin sal", "ensalada verde"], "method": ["Para el cordero, precaliente el horno a 160C / 320F / Gas 2.", "Coloque todas las verduras y el romero en una cazuela con tapa profunda.", "Con la punta de un cuchillo filoso, haz doce incisiones en el hombro del cordero.", "Empuja las anchoas en las incisiones del cordero.", "Coloque la unión encima de las verduras en la sartén, vierta sobre el aceite de oliva de los filetes de anchoa en lata y frote bien.", "Sazonar con pimienta recién molida negro.", "Vierta el vino y el caldo de pollo alrededor del cordero.", "Cubra la olla con una tapa bien ajustada.", "Coloque a fuego medio en la estufa y lleve a ebullición. Transfiera al horno y cocine durante aproximadamente 1¾ horas o hasta que la carne esté tierna y cocida.", "Cuando la carne esté cocida, retírela del horno y levante con cuidado la carne de la sartén en una bandeja de asar poco profunda.", "Aumente la temperatura del horno a 225 C / 440 F / Gas 8.", "Para el glaseado, coloque todos los ingredientes del glaseado en un recipiente y mezcle bien.", "Cepille el esmalte sobre la articulación. Coloque la junta en el horno y cocine durante 12-15 minutos, o hasta que el glaseado se haya vuelto pegajoso y dorado; reduzca el fuego si la carne se está coloreando demasiado rápido.", "Retire la carne del horno y déjela reposar durante 10-15 minutos, manteniéndola caliente.", "Mientras tanto, vierta los jugos de cocción iniciales a través de un colador en una sartén limpia. Con una cuchara, quite la grasa que haya salido a la superficie y deséchela. Hierva rápidamente para reducir el líquido a la mitad.", "Cuando los jugos de cocción se hayan reducido, retírelos del fuego y agregue la crema y un chorrito de jugo de limón. Compruebe el condimento, agregue sal y pimienta negra recién molida al gusto. Mantener caliente", "Para el kasha, ajuste la temperatura del horno a 200C / 400F / Gas 6.", "Caliente una sartén grande a prueba de horno con tapa a fuego medio, luego agregue el trigo bulgur y pan tostado durante unos minutos, revolviendo ocasionalmente, para evitar que se queme.", "Vierta el caldo en la sartén con el trigo bulgar, sazone con sal y pimienta negra y agregue un tercio de la mantequilla.", "Cubra con una tapa, colóquelo en el horno y cocínelo durante 15-20 minutos, hasta que el caldo se haya absorbido por completo y el trigo bulgar esté tierno.", "Retire el kasha del horno y el tenedor a través de la mantequilla restante.", "Para servir, quite la cuerda de la junta y corte en rodajas gruesas. Coloque el kasha en el centro de cada plato y cubra con un par de rebanadas de cordero. Coloque la salsa de crema sobre la parte superior y sirva con un puñado de ensalada verde."], "url": "www_bbc_co_uk_food_recipes_glazedpotroastshould_86163", "title": "Asador de cordero asado con cordero y kasha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 botella de vino tinto", "Azúcar demerara 100 g / 3½ oz", "1 cucharada de miel", "1 vaina de vainilla, semillas raspadas", "2 palitos de canela", "1 cucharadita de clavo de olor", "Pasas", "avellanas trituradas"], "method": ["Combine todos los ingredientes (excepto las pasas y las avellanas) en una sartén y caliente muy lentamente, sin dejar que hierva nunca.", "Coloque dos cucharadas soperas de pasas y avellanas en cada vaso y cucharón en el glögg."], "url": "www_bbc_co_uk_food_recipes_glgg_99266", "title": "caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 alcachofa globo mediano", "½ limón", "2 cucharadas de vinagre de vino tinto", "1 cucharada colmada de mostaza Dijon", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva"], "method": ["Corta el tallo de la alcachofa y quita las hojas externas duras. Frote con medio limón.", "Exprime el jugo de limón restante en una sartén con agua salada que hierva rápidamente. Sumerja la alcachofa en el agua y hierva sin tapar durante 25 a 30 minutos, hasta que las hojas externas se desprendan fácilmente. Escurrir bien.", "Voltea la alcachofa al revés y exprime el agua.", "Mientras cocinas la alcachofa, prepara la vinagreta. Combine el vinagre y la mostaza en un pequeño recipiente tapado y sazone al gusto.", "Vierta el aceite de oliva, antes de atornillar la tapa y agitar vigorosamente para hacer un aderezo grueso. Pruebe, agregue más mostaza, vinagre y condimento si es necesario. El aderezo se mantendrá en la nevera durante varios días", "Retire las boquillas de alcachofa cuidadosamente con una cuchara y sirva inmediatamente con la vinagreta antes de que se decoloren."], "url": "www_bbc_co_uk_food_recipes_globeartichokewithdi_83912", "title": "Alcachofa globo con mostaza Dijon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.5 litros / 2½ pepitas de caldo de verduras", "500g / 1lb 2oz huesos de cerdo", "2 cucharadas de copos de sal marina", "2 cucharadas de pimienta negra", "1 cucharada de bayas de enebro", "Harina normal de 100 g / 3½ oz", "1,5 kg / 3 lb 5 oz de cerdo en cubos", "5 cucharadas de aceite de oliva", "4 cebollas medianas, aproximadamente picadas", "2 manzanas Bramley grandes, cortadas en discos de 1 cm / ½ en", "2 nabos, cortados en discos de 1cm / ½ en", "60 g / 2¼ oz de mantequilla"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Ponga a hervir una cacerola grande, agregue los huesos de cerdo y deje burbujear durante 45 minutos a fuego muy lento.", "Usando un mortero y una maja, triture la sal, la pimienta y las bayas de enebro juntas. Mézclalos con la harina en un tazón grande.", "Calentar el aceite de oliva en una cazuela grande y dorar el cerdo en tandas, transfiriendo la carne cada vez al recipiente con la harina sazonada. Mezcle bien la carne.", "Freír las cebollas en la misma cacerola hasta que estén suaves y translúcidas. Sacude el exceso de harina del cerdo y vuelve a la cazuela. Freír durante tres minutos para cocer la harina.", "Coloque el caldo (sin los huesos) sobre la cazuela y mezcle bien, asegurándose de que no queden grumos de harina.", "Tome los discos cortados de manzana y nabo y póngalos sobre la cazuela alternando entre los dos. Dispersar pequeñas perillas de la mantequilla sobre la parte superior. Coloque la tapa sobre la cazuela o cubra con papel de aluminio. Hornee durante dos horas, quitando la tapa o la lámina, durante los últimos 30 minutos.", "Sirva en tazones hondos con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_gloucestershire_hotpot_93488", "title": "Hotpot de Gloucestershire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de harina común", "½ cucharadita de sal marina en copos, más extra, al gusto", "pimienta negra recién molida, al gusto", "1 kg / 2 libras 2 oz de filete de cordero (preferiblemente Gloucestershire) exceso de grasa recortada, cortada en trozos del tamaño de un bocado", "2-3 cucharadas de aceite de colza", "2 cebollas, peladas, cortadas a la mitad y en rodajas", "½ cucharadita de nuez moscada recién rallada", "¼ cucharadita de pimienta de Jamaica molida", "1 ramita de romero fresco, solo hojas, finamente picado", "500ml / 17½ fl oz de pollo fresco o caldo de cordero", "300ml / 10½fl oz de agua fría", "1 manzana Bramley, pelada, descuartizada, sin núcleo, en rodajas", "2 manzanas crujientes que comen, como Cox, peladas, descuartizadas, sin núcleo, en rodajas", "4-5 hojas de salvia frescas grandes, finamente cortadas", "300g / 10½ oz de harina natural, más extra para espolvorear", "buena pizca de sal", "Manteca fría de 75 g / 2½ oz cortada en trozos pequeños", "75 g / 2½ oz de mantequilla fría, cortada en trozos pequeños", "1 huevo de gallinas camperas", "1 cucharada de agua fría", "puré", "vegetales de temporada"], "method": ["Para el relleno, coloque la harina, la sal marina y una buena molienda de pimienta negra en un tazón grande y mezcle bien. Agregue las piezas de cordero y mezcle bien hasta que la carne esté ligeramente cubierta con la harina sazonada.", "Calentar el aceite de colza en una sartén grande y freír las piezas de cordero durante 3-4 minutos, en pequeños lotes, hasta que estén doradas por todas partes. Transfiera la carne de cordero chamuscada a una cazuela grande de base pesada o una cazuela a prueba de llamas y déjela a un lado.", "Regrese la sartén al fuego, agregue más aceite si es necesario, luego fríe las cebollas durante 5-6 minutos o hasta que estén doradas. Agregue las cebollas a la cazuela con el cordero.", "Agregue la nuez moscada, la pimienta de Jamaica y el romero a la cazuela, luego vierta sobre el caldo y el agua. Llevar a ebullición, luego reducir el fuego y dejar hervir a fuego lento durante 40 minutos, o hasta que el cordero esté solo tierno y el líquido se haya reducido a la consistencia de la salsa. Sazonar, al gusto, con sal y pimienta negra recién molida, luego quitar la sartén del fuego, cubrir y dejar enfriar durante 30 minutos.", "Mezcle las manzanas con la salvia picada y sazone con pimienta negra recién molida. Dejar de lado.", "Mientras tanto, para la masa, tamice la harina y la sal en un tazón y frote la manteca y la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado.", "Batir ligeramente el huevo junto con el agua, luego coloque dos cucharadas de la mezcla en un recipiente aparte para usar como glaseado para la masa.", "Haga un pozo en el centro de la mezcla de harina, manteca de cerdo y mantequilla y agregue el huevo. Mezcle con una cuchara de madera hasta que la mezcla se una para formar una masa, luego forme una bola. Enharina ligeramente la superficie de trabajo y amasar la masa ligeramente, luego aplanar ligeramente en una ronda y envolver en una película adhesiva. Enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para la tarta, vierta la mitad de la mezcla de cordero en un molde para pastel de 2,2 litros. Cubra con la mitad de las manzanas y cubra con la mezcla restante de cordero. Termine con una última capa de manzanas, apilándolas sobre el borde del plato. Facilita un embudo de tarta en el centro del pastel para ayudar a mantener la masa y dejar de lado.", "Desenvuelva la masa y extiéndala en una forma ovalada grande de aproximadamente 5 cm / 2 pulgadas más grande que la fuente para pastel. Corta un anillo de pasta de 2 cm / 1 pulgada de ancho alrededor del borde de este óvalo.", "Cepille el borde del plato para pastel con la mezcla reservada de huevo y agua. Presione el anillo de repostería en el borde del plato de pastel, superponiéndose ligeramente en la unión final. Cepille ligeramente con un poco más de huevo y luego cubra completamente el pastel con la masa enrollada, haciendo un pequeño orificio para la parte superior del embudo de la torta.", "Presione los bordes firmemente para sellar, luego recorte los pasteles y la flauta por completo. Cepille la masa con la mezcla de huevo restante y coloque el plato de tarta en una bandeja para hornear. Hornee el pastel en el centro del horno durante 25 minutos o hasta que el pastel esté dorado y crujiente.", "Sirve el pastel caliente con puré de patatas cremosas y verduras de temporada."], "url": "www_bbc_co_uk_food_recipes_gloucestershiresquab_92233", "title": "Pastel de cordero", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro de botella de vino tinto barato", "30z / 75g de azúcar (al gusto)", "1 cucharadita de clavos enteros", "1 cucharadita de canela molida o palo de canela", "jugo de 1 naranja y 1 limón"], "method": ["Vierta el vino en una cacerola y agregue los ingredientes restantes (puede poner especias enteras en muselina).", "Caliente hasta casi hervir y cuele (si es necesario) en un recipiente tibio.", "Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_gluhwein_2495", "title": "Gluhwein", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 manzanas picantes, peladas, sin corazón y picadas", "1 limón, solo jugo", "Azúcar de echador de oro 300g / 10½g", "8 huevos de gallinas camperas", "Almendras molidas 325 g / 11½ oz", "½ cucharadita de esencia de almendra", "50g / 2oz de almendras en copos", "azúcar glas, para rociar"], "method": ["Precaliente el horno a 180 ° C / 375 ° F / Gas 4. Engrase y forme ligeramente la base de un molde de resorte de 25 cm / 10 in con un poco de aceite.", "Coloque las manzanas en una sartén con la mitad del jugo de limón y dos cucharadas de azúcar en polvo. Deje que hierva a fuego lento, cubra y cocine a fuego lento durante aproximadamente 7-9 minutos o hasta que las manzanas estén lo suficientemente blandas como para machacarlas aproximadamente con un tenedor. No sobre puré, sin embargo. Aún quieres un poco de mordida y textura. Deja enfriar.", "Ponga el puré frío, los huevos, las almendras molidas, la esencia de almendras, el azúcar impalpable restante y aproximadamente una cucharada de jugo de limón restante en un procesador de alimentos y mezcle. Vierta en la lata de torta preparada y espolvoree con las almendras en copos.", "Hornee durante aproximadamente 40 minutos o hasta que un pincho insertado en el pastel salga limpio. Revise el pastel después de unos 30 minutos, y si el pastel se está poniendo demasiado marrón, cubra la parte superior con papel pergamino o papel de aluminio.", "Deje que se enfríe un poco antes de quitar la torta de la lata. Esto es delicioso servido caliente o frío con una generosa pizca de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_gluten-free_apple_and_22345", "title": "Tarta de manzana y almendra sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_apple_and_22345_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de piñones", "2 zanahorias medianas (aproximadamente 200-250g / 7-9oz)", "75g / 3oz de sultanas doradas", "60ml / 2¼fl oz de ron", "150 g / 5 oz de azúcar en polvo", "125ml / 4½fl oz de aceite de oliva regular, más extra para engrasar", "1 cucharadita de extracto de vainilla", "3 huevos de gallinas camperas", "Almendras molidas 250 g / 9 oz", "½ cucharadita de nuez moscada molida, o al gusto", "½ limón, ralladura finamente rallada y jugo", "250g / 9oz de mascarpone", "2 cucharaditas de azúcar glas", "2 cucharadas de ron"], "method": ["Para la torta de zanahoria, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Alinee la base de una lata redonda de molde de resorte de 23 cm / 9 pulg con forro de silicona antiadherente reutilizable o pergamino para hornear y engrase los lados con aceite de oliva.", "Tueste los piñones dorando en una sartén seca; el horno solo no es suficiente para quemar la palidez. Dejar de lado.", "Rallar las zanahorias en un procesador (para facilitar) o con un rallador grueso, luego siéntelas sobre una doble capa de papel de cocina y envuélvalas, para absorber el exceso de líquido. Dejar de lado.", "Ponga las sultanas doradas en una olla pequeña con el ron, lleve a ebullición, baje y cocine a fuego lento durante 3 minutos.", "Batir el azúcar y el aceite hasta que estén bien crujientes y se mezclen bien.", "Agregue el extracto de vainilla y los huevos y, cuando esté bien batido, doble las almendras molidas, nuez moscada, zanahorias ralladas, sultanas doradas (con cualquier ron que se adhiera a ellas) y, finalmente, la ralladura de limón y el jugo.", "Raspe la mezcla en la lata de torta preparada y alise la superficie con una espátula de goma. El rebozado será muy poco profundo en la lata.", "Espolvoree los piñones tostados sobre la torta y colóquelos en el horno durante 30-40 minutos, o hasta que la parte superior se eleve y se dore, y un pincho insertado en el centro salga pegajoso pero más o menos limpio.", "Retire del horno y deje reposar la torta en su lata sobre una rejilla de alambre durante 10 minutos, luego suelte y deje que se enfríe en la rejilla.", "Para la crema de mascarpone, mezcle el mascarpone con el azúcar glas y el ron.", "Para servir, transfiere la tarta a un plato. Ponga la crema de mascarpone en un tazón para cucharear junto con el pastel, para aquellos que quieran."], "url": "www_bbc_co_uk_food_recipes_gluten-free_and_11807", "title": "Pastel de zanahoria veneciano sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_and_11807_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 patatas grandes / 3 medianas King Edward, frotadas", "4 cucharadas de aceite de colza", "130g / 4½oz de harina sin gluten", "155-175 ml / 5-6 fl oz de agua con gas refrigerada", "4 x 175g / 6oz de filete de eglefino sin piel sin hueso", "Guisantes congelados de 320g / 11oz", "1 cucharada de hojas de menta picadas", "50 g / 1 oz de crema semidescremada", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 220 ° C / 200 ° Ventilador / Gas 7. Cubra una bandeja grande para hornear con papel resistente a la grasa.", "Corta las papas en rodajas gruesas de 1 cm / ½ pulgadas y luego en palitos de 1 cm / ½ pulgadas de ancho.", "Coloque en una cacerola y vierta suficiente agua fría para cubrir. Llevar a ebullición y cocine a fuego lento durante 5 minutos hasta que esté tierna pero firme. (Esto significa que los chips terminados serán cocidos y ligeramente esponjosos en el medio, pero crujientes por fuera).", "Escurrir cuidadosamente y tirar en el rollo de la cocina o en un paño de cocina y secar.", "Vierta 4 cucharaditas de aceite en una bandeja grande para asar, sazone con sal y pimienta, luego agregue las papas y mezcle suavemente hasta que estén completamente cubiertas.", "Asar durante 15-20 minutos hasta que estén dorados, crujientes y cocidos.", "Mientras las patatas fritas se cocinan, prepara el pescado. Incline la harina en un recipiente y sazone con sal y pimienta. Agregue el agua gradualmente, revolviendo todo el tiempo; desea un rebozado grueso, sobre la consistencia de la crema doble. Una vez que se una, no lo mezcle, quiere que sea hermoso y liviano.", "Sumerja el pescado en la mezcla, cubriendo ambos lados, asegurándose de que el pescado esté totalmente cubierto.", "Caliente una sartén grande hasta que esté caliente, agregue el aceite de colza restante y cuando esté muy caliente, agregue el pescado, colocándolo lejos de usted para que el aceite no le rocíe. Cocine por un lado hasta que la mezcla se hinche y se ponga dorada, voltee y cocine por el otro lado. Deberá cocinar durante 2-3 minutos por cada lado y luego levantar el pescado en papel pergamino para drenar, ¡no en el rollo de cocina, ya que se pegará!", "Ponga a hervir una olla pequeña de agua, agregue los guisantes y cocine a fuego lento durante 2-3 minutos hasta que esté bien caliente. Escurrir y volver a la cacerola con la menta picada, luego, con un machacador de papas, machacar los guisantes un poco hasta que revienten.", "Agregue la crème fraîche y sazone con sal y pimienta.", "Escurra tanto las papas fritas como el pescado sobre papel de cocina para eliminar el exceso de aceite y sirva inmediatamente con los guisantes al costado."], "url": "www_bbc_co_uk_food_recipes_gluten-free_fish_and_75524", "title": "Pescado y patatas fritas sin gluten con guisantes de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gluten-free_fish_and_75524_16x9.jpg", "isVegetarian": false, "recommendations": 0}]