[{"isVegetarian": true, "title": "Butternut squash soup with flowerpot bread", "url": "www_bbc_co_uk_food_recipes_butternut_squash_soup_06198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb pack ready-to-go ‘pain de campagne’ bread mix", "1 tbsp olive oil", "25g/1oz butter", "100g/3½oz onion, thinly sliced", "450g/1lb butternut squash, peeled and cut into 1cm/½in cubes", "500ml/18fl oz vegetable stock", "375ml/13fl oz milk", "salt and freshly ground black pepper", "2 limes, zest and juice"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Make the bread according to the packet instructions, then leave to prove in a large bowl for an hour, or until doubled in size.", "Meanwhile, grease eight clean clay flowerpots with butter and line them with baking parchment.", "Remove the dough and knock back. Divide into eight pieces and place into clean clay flowerpots, then leave to prove again for 30 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Place the flowerpots on a baking tray and bake for 10-15 minutes, or until golden-brown and cooked through. ", "Meanwhile, heat the olive oil and the butter in a large saucepan or sauté pan. Add the onion, cover and gently fry for 3-4 minutes.", "Add the butternut squash and continue to cook for a further 2-3 minutes.", "Add the remaining ingredients, except the lime and bring to the boil, reduce to a simmer and cook for six minutes, or until the butternut squash is tender.", "Transfer the soup to a blender and pulse until smooth. ", "Season with salt and pepper, to taste, and finish with the lime zest and juice.", "Serve the soup with the bread alongside."]}, {"isVegetarian": true, "title": "Butternut squash soup with crisps", "url": "www_bbc_co_uk_food_recipes_butternut_squash_soup_90300", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_soup_90300_16x9.jpg", "ingredients": ["1 butternut squash", "2 tbsp olive oil", "1 onion, chopped", "butter, to taste", "600ml/20fl oz vegetable stock, plus additional stock to loosen soup if desired", "1 heaped tsp hot smoked paprika", "salt and freshly ground black pepper", "reserved butternut squash peelings", "drizzle olive oil", "few drops sherry vinegar", "2 tbsp finely chopped rosemary"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the butternut squash and reserve the long strips of skin.  ", "Discard the butternut squash pulp and chop the remaining butternut squash into chunks.  ", "Heat the olive oil in a large casserole, add the onion and butternut squash and plenty of butter (to taste) and cook untill brown and caramelised. ", "Pour over the stock. Simmer for 20 minutes. Remove from the heat, leave to cool slightly and then blend using a food processor or hand-blender to the desired consistency. ", "Add hot smoked paprika and season to taste with salt and freshly ground black pepper.", "For the crisps, preheat the oven to 140C/275F/ Gas 1.", "Place the reserved butternut peelings in a roasting tray and top with the olive oil, sherry vinegar, chopped rosemary and put in the oven to cook for 20 minutes on a low heat to crisp up.", "Remove the crisps from the oven and place on kitchen paper to absorb any excess oil.", "Serve the soup with the skin crisps."]}, {"isVegetarian": true, "title": "Butternut squash with Persian pistachio pesto, feta and pomegranate seeds", "url": "www_bbc_co_uk_food_recipes_butternut_squash_with_55612", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_with_55612_16x9.jpg", "ingredients": ["1 large butternut squash, quartered lengthways (skin-on) and seeds removed", "4 tbsp olive oil", "sea salt and freshly ground black pepper", "150g/5½oz feta ", "100g/3½oz pomegranate seeds", "100g/3½oz shelled pistachio nuts", "70g/2¼oz parmesan (or vegetarian alternative), chopped into rough chunks", "100ml/3½fl oz olive oil ", "1 small bunch fresh coriander", "1 small bunch fresh parsley", "1 small bunch fresh dill", "1 hot red chilli or 1 tbsp chilli oil (optional)", "1 lemon, juice only", "2 tsp sea salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and line a baking tray with baking parchment.", "For the butternut squash, rub each wedge of butternut squash with oil and season generously with sea salt and black pepper. Place on the lined baking tray.", "Roast the squash for about 45-50 minutes, just until the edges have begun to brown slightly (you want to blacken the edges a little to give them a nice chewy texture). Check the squash is cooked by inserting a knife - if it slides in easily the squash is cooked. ", "For the pesto, add the pistachios and cheese to a food processor. Pulse to break them into small pieces and add enough olive oil to slacken the mixture to your desired consistency (you may not need all the oil). Add all the herbs, the chilli (if using) and lemon juice. Pulse again to combine the herbs and add a little more olive oil. Season generously with sea salt and give the mixture one last pulse. Taste the pesto, to make sure it has enough salt and acidity, and allow it to rest in the fridge until you need it. ", "To serve, serve the butternut squash on plates, drizzled generously with the pesto. Crumble your feta over the top and scatter some pomegranate seeds over to finish. "]}, {"isVegetarian": true, "title": "Butternut squash chips with rosemary and garlic", "url": "www_bbc_co_uk_food_recipes_butternutchipswithro_87033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small butternut squash, peeled", "1 sprig fresh rosemary", "1 sprig fresh thyme", "1 garlic clove, chopped", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "On a chopping board, slice the butternut squash into six wedges.", "Place the butternut squash onto a non-stick baking tray and scatter over the herbs, garlic and one tablespoon of the olive oil. Season with salt and freshly ground black pepper and transfer to the oven for 20-30 minutes, or until golden-brown and tender.", "Serve on a plate."]}, {"isVegetarian": true, "title": "Butternut gnocchi with sage butter", "url": "www_bbc_co_uk_food_recipes_butternutgnocciwiths_81302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz walnuts", "200g/7oz plain flour, plus extra for coating", "300g/10½oz butternut squash, peeled, deseeded, chopped, cooked and drained ", "100g/3½oz unsalted butter", "1 tbsp sage leaves, plus extra to garnish", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the gnocchi, place the walnuts in a food processor and blend. Add the flour and cooked butternut squash and blend together.", "Divide the mixture into 4 and toss in plain flour. Roll each into a long, thin sausage, then chop into 2.5cm/1in pieces. Toss again in flour to coat, then drop into a pan of boiling water.", "After a minute the gnocchi should float to the surface. Remove with a slotted spoon and set aside.", "To make the sage butter, melt the butter in a frying pan, then add the sage leaves. Fry for a minute to infuse, then add the gnocchi and toss together.", "Serve the gnocchi in a warm bowl and season well with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Butternut squash and gruyere pasties", "url": "www_bbc_co_uk_food_recipes_butternutsquashandgr_70352", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp light olive oil", "125g/5oz Serrano ham, cubed ", "2 tbsp fresh sage, sliced", "225g/8oz butternut squash, cut into 1cm/½in cubes", "1 medium onion, very finely sliced", "140g/5oz Gruyère, grated", "3 tbsp double cream", "2 x 375g/13oz sheets of ready-made short-crust pastry", "1 free-range egg", "Maldon sea salt and freshly ground white pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the olive oil in a frying pan. Fry the ham until it begins to turn crispy. Add the sage and toss quickly. Tip on to a plate lined with kitchen paper.", "Make the filling by mixing the butternut squash, onion, cheese, crispy ham and sage. Season generously with salt and freshly ground white pepper and then mix thoroughly with the cream.", "Place one sheet of pastry onto a floured board. Take a plate large enough to cut out 2 circles from the pasty. You can also just divide into two to make a triangle pasty.", "Whisk the egg up and add a teaspoon of water to make egg wash.", "Place a quarter of the mixture onto one half of the pastry. Brush the inside edges with some egg wash, then carefully close to from a purse shape. Using a fork gently crimp the edges. Brush the top with more of the egg wash and place on a baking tray. Repeat the process to make the remaining three.", "Place in the oven for ten minutes. Then reduce the temperature to 180C/350F/Gas 4 and cook for a further 25 to 30 minutes when the pastry will be golden brown and the pasties cooked through.  ", "Serve hot or at room temperature."]}, {"isVegetarian": false, "title": "Butternut squash and herb salad with serrano ham and broad bean dressing", "url": "www_bbc_co_uk_food_recipes_butternutsquashandhe_85175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 tbsp olive oil", "85g/3oz butternut squash, peeled, cut into 2cm/1in cubes", "small handful fresh basil", "small handful fresh parsley", "small handful fresh chervil", "dash olive oil", "2 slices serrano ham, chopped", "300g/10½oz tinned broad beans, rinsed and drained", "2 tbsp balsamic vinegar", "3 tbsp olive oil", "2 tbsp chopped fresh mint", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, melt the butter and olive oil in a frying pan over a medium heat, add the butternut squash and fry for 6-8 minutes, or until softened and golden-brown.", "Place the herbs into a large bowl, add the squash and olive oil and stir well.", "Return the frying pan to the heat, add the serrano ham and fry for 3-4 minutes, until golden-brown and crisp.", "For the dressing, place the broad beans, balsamic vinegar, olive oil and mint into a small saucepan, season with salt and freshly ground black pepper and warm gently over a low heat for 2-3 minutes.", "To serve, place the salad onto a plate, top with the crisp serrano ham and pour over the warm dressing."]}, {"isVegetarian": false, "title": "Butternut squash and prawn curry with noodles", "url": "www_bbc_co_uk_food_recipes_butternutsquashandpr_88913", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternutsquashandpr_88913_16x9.jpg", "ingredients": ["75ml/2½fl oz vegetable oil ", "50g/1¾oz ready-made red curry paste from a jar", "1 tbsp palm sugar or brown sugar (available from Asian supermarkets)", "1 medium butternut squash, peeled, seeds removed, cut into large chunks", "1 large sweet potato, peeled, cut into large chunks ", "1 x 400ml/14fl oz tin coconut milk", "90ml/6 tbsp coconut cream", "½ tbsp fish sauce (nam pla)", "2 sticks lemongrass, bruised", "1 tbsp lime pickle from a jar (available from supermarkets and Asian supermarkets)", "250g/9oz raw king prawns, peeled and de-veined", "250g/9oz egg noodles, cooked according to packet instructions", "55ml/2fl oz vegetable oil", "50g/1¾oz red chilli, thinly sliced", "50g/1¾oz garlic, thinly sliced", "50g/1¾oz shallots, thinly sliced", "50g/1¾oz beansprouts, picked and washed ", "small bunch coriander, leaves only ", "small bunch of basil, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok over a medium heat and fry the red curry paste for two minutes, until fragrant. Add the palm sugar and cook for 4–5 minutes until the mixture is sticky.", "Stir in the squash and sweet potato and cook for 2–3 minutes.", "Add the coconut milk, coconut cream, fish sauce and the lemongrass and bring to the boil. Reduce the heat to simmer for 20–30 minutes, or until the squash and potato are tender but not mushy. Add the lime pickle and king prawns and cook for 2–3 minutes, until the prawns are pink and cooked through.", "For the garnish, heat the oil in a wok over a low heat. Add the sliced chilli and cook slowly until all of the moisture from the chillies has evaporated (at which point the oil will stop bubbling), then turn up the heat slightly, so the chillies caramelise and crisp up. Remove the chilli slices with a slotted spoon and drain on kitchen paper. Repeat this cooking process with the sliced garlic and the shallots. ", "To serve, divide the noodles among four shallow bowls. Top with several spoonfuls of the curry, then sprinkle each bowl with a little of the bean shoots, coriander leaves and basil leaves. Garnish with a pinch of each of the crisp fried chillies, garlic and shallots."]}, {"isVegetarian": true, "title": "Butternut squash and pumpkin pie with custard", "url": "www_bbc_co_uk_food_recipes_butternutsquashandpu_84333", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour ", "100g/3½oz unsalted butter", "1 free-range egg, beaten", "25g/1oz caster sugar", "50ml/2fl oz milk, to bind (more if necessary)", "plain flour and icing sugar, to dust", "1 free-range egg, beaten, for egg wash", "350g/12oz pumpkin, peeled, cut into cubes", "150g/5oz butternut squash", "50g/2oz soft dark brown sugar", "140ml/5fl oz double cream", "1 tsp clear honey", "½ tsp ground cinnamon", "pinch freshly grated nutmeg", "pinch ground allspice", "pinch ground ginger", "2 free-range eggs, beaten", "6 free-range egg yolks", "100g/3½oz caster sugar", "1 vanilla pod, split", "400ml/14fl oz milk"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour, butter, egg, sugar and milk into a food processor and pulse briefly to bring the ingredients together as a dough. Remove and place into a bowl and mix well with your hands, then cover and place into the fridge to chill for 20 minutes.", "Dust a clean flat surface with a mixture of flour and icing sugar and roll out the pastry. Place the pastry into a 20cm/8in tart case and return to the fridge to chill for two hours.", "Preheat the oven to 200C/400F/Gas 6.", "Place the tart case into the oven, covered with a sheet of baking paper weighed down with baking beans and bake blind for 25 minutes, or until golden, but not browned. Remove the baking paper and beans, brush with the egg wash and return to the oven for five more minutes, then remove and leave to cool.", "For the filling, place the pumpkin and butternut squash onto a baking sheet, sprinkle with the sugar and place into the oven to roast for 40 minutes, then remove and allow to cool slightly.", "Place the pumpkin and butternut squash into a food processor and blend until smooth.", "Reduce the oven temperature to 180C/355F/Gas 4.", "Meanwhile, place the cream, honey and spices into a saucepan over a medium heat and bring to simmering point.", "Place the beaten eggs into a clean bowl and pour over the cream mixture, whisking constantly.", "Add the pumpkin mixture to the pan, stir well to combine, then pour into the tart case.", "Transfer the tart to the oven and bake for 35 minutes, or until the filling has set. Remove and leave to cool.", "For the custard, whisk the eggs, sugar and vanilla together in a clean bowl. ", "Place the milk into a clean saucepan and heat up to near boiling point, then remove from the heat and pour over the egg mix, whisking constantly. ", "Place the custard mixture back into the milk pan and simmer over a low heat, stirring regularly, until the custard thickens enough to coat the back of a spoon.", "To serve, cut a generous slice of the butternut squash and pumpkin pie, place onto a plate and serve with the homemade custard drizzled over the top."]}, {"isVegetarian": true, "title": "Butternut squash crumble", "url": "www_bbc_co_uk_food_recipes_butternutsquashcrumb_92581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 onion, peeled, sliced", "2 garlic cloves, peeled, chopped", "2 leeks, trimmed, cut into large slices", "200g/7oz cavolo nero or cabbage leaves, chopped", "200g/7oz butternut squash flesh, cut into cubes, roasted in the oven in 1 tbsp oil for 15-20 minutes", "1 x 440g/1lb can chopped tomatoes", "1 tsp garam masala", "1 tsp ground fenugreek", "1 tsp curry powder", "salt and freshly ground black pepper", "150g/5½oz plain flour", "pinch salt", "200g/7oz chilled butter, cut into cubes", "150g/5½oz porridge oats", "150ml/5fl oz olive oil", "small bunch basil leaves, torn", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry for 3-4 minutes, or until softened. ", "Add the leeks and cavolo nero or cabbage leaves and continue to fry for a further 3-4 minutes, or until wilted. ", "Add the roasted butternut squash, canned tomatoes and spices. Stir well, then season, to taste, with salt and freshly ground black pepper. Continue to cook for a further 4-5 minutes, then spoon the mixture into an ovenproof dish. Set aside.", "For the crumble, in a bowl, rub together all the crumble ingredients, using your fingertips, until the mixture resembles breadcrumbs. Sprinkle the crumble mixture on top of the filling mixture in an even layer. ", "Bake the crumble in the oven for 20-25 minutes, or until the filling is bubbling and the crumble is crisp and golden-brown. ", "Meanwhile, for the topping, blend the olive oil, basil and lemon juice in a food processor until well combined. ", "To serve, divide the butternut squash crumble equally among four serving plates. Drizzle over the topping."]}, {"isVegetarian": true, "title": "Butternut squash pancakes", "url": "www_bbc_co_uk_food_recipes_butternutsquashpanca_76794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 eggs", "100g/3½zoz plain flour", "30ml/1¼fl oz milk", "knob butter, for frying", "50g/1¾oz butternut squash", "¼ apple, cored and diced", "1 tsp brown sugar", "3 tbsp Greek yoghurt", "honey to drizzle"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the eggs, flour and milk together to make a pancake batter.", "Melt some butter in a small frying pan. When hot put in a ladle of the batter to make a pancake. Cook until golden on both sides. Repeat until the mixture has been used up.", "Melt a little more butter in the pan and sauté the butternut squash and the apple until soft.", "Add the brown sugar and allow to caramelise.", "Remove from the heat and stir in the Greek yoghurt.", "Spoon the yoghurt mixture equally between the pancakes and serve."]}, {"isVegetarian": true, "title": "Butternut squash mash", "url": "www_bbc_co_uk_food_recipes_butternutsquashmash_78369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ butternut squash, mashed", "1 tsp salt", "1 tbsp butter", "splash of milk", "salt and freshly ground black pepper, to taste"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the squash in a pan full of cold water with a teaspoon of salt. ", "Bring to the boil and cook for 10-15 minutes. Drain and place back in the pan.", "With a potato masher or ricer, mash the squash. ", "Add the butter, milk, salt and freshly ground black pepper, to taste, and serve."]}, {"isVegetarian": true, "title": "Butternut squash, sage and crème fraîche mash", "url": "www_bbc_co_uk_food_recipes_butternutsquashsagea_92665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternutsquashsagea_92665_16x9.jpg", "ingredients": ["60g/2½oz butter", "10 fresh sage leaves, chopped", "1.5kg/3lb 5oz butternut squash, peeled, seeds removed, cut into 2cm/1in pieces", "large pinch chilli flakes", "40g/1½oz parmesan (or a similar vegetarian hard cheese), coarsley grated", "6 tbsp crème fraîche ", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a wide, heavy-based, lidded pan over a low heat. When the butter is foaming, add the sage and fry one minute.", "Add the butternut squash pieces and chilli flakes. Cover the pan with a lid and cook for 15-20 minutes, or until the squash is tender, stirring occasionally.", "Lightly mash the squash, using a fork, then stir in the parmesan and crème fraîche until well combined. Season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Butternut squash soup", "url": "www_bbc_co_uk_food_recipes_butternutsquashsoup_83878", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 butternut squash, peeled, seeds removed, cut into 2.5cm/1in cubes", "2 tbsp clear honey", "2 tbsp olive oil", "1 white onion, chopped", "2 cloves garlic, roughly chopped", "110ml/4fl oz white wine", "500ml/18fl oz vegetable stock", "20g/¾ oz fresh basil leaves", "20g/¾oz fresh chervil", "75ml extra virgin olive oil", "150ml/5fl oz double cream", "1 lime, juice and zest only", "salt and freshly ground black pepper", "50g/2oz crème fraîche", "25g/1oz pine nuts, lightly toasted"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the squash onto a baking tray and drizzle with the honey and olive oil.", "Place in the oven to roast for 30-40 minutes, or until tender.", "Heat a frying pan until hot, then add the onion and garlic and fry for 1-2 minutes.", "Add the wine and stock and bring to the boil. ", "Simmer for about 3-4 minutes, then add the cooked squash.", "Meanwhile, chop half of the basil and all the chervil and place into a food processor with the extra virgin olive oil and blend to a fine purée. Pour out into a bowl and set aside.  ", "Place the butternut squash soup into a clean food processor. Add the cream, lime juice and zest and blend to a purée. ", "Return the butternut squash soup to the saucepan, heat through and season, to taste, with salt and black pepper.", "To serve, ladle the soup into serving bowls, then top with a dollop of crème fraîche. Add a sprinkling of toasted pine nuts, drizzle with the herb purée and then garnish with the rest of the basil."]}, {"isVegetarian": true, "title": "Butternut squash soup with blue cheese", "url": "www_bbc_co_uk_food_recipes_butternutsquashsoupw_79645", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "¼ butternut squash, peeled and cut into cubes", "1 garlic clove, finely chopped", "½ shallot, finely chopped", "290ml/½ pint vegetable stock", "1 tomato, finely chopped", "40g/2½oz blue cheese"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan. Add the squash and sauté for 2-3 minutes over a low to medium heat.", "Add the garlic and shallot and cook for a further minute.", "Add the stock and chopped tomato to the pan, bring to the boil and reduce the heat to simmer for 8-10 minutes, until the squash is soft.", "Remove the pan from the heat and add the blue cheese. Blend with a hand blender and then pass through a sieve into a bowl.", "Ladle the soup into serving bowls and serve."]}, {"isVegetarian": true, "title": "Butternut squash with rosemary and halloumi", "url": "www_bbc_co_uk_food_recipes_butternutsquashwithr_81589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternutsquashwithr_81589_16x9.jpg", "ingredients": ["200g/7oz butternut squash, seeds removed and thinly sliced", "2 tbsp olive oil", "1 clove garlic, sliced", "2 tbsp chopped fresh rosemary", "salt and freshly ground black pepper", "1 tbsp olive oil", "100g/3½oz halloumi, sliced into three pieces"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the butternut squash, place the butternut squash, olive oil, garlic and fresh rosemary into a large bowl, season, to taste, with salt and freshly ground black pepper and mix together.", "Heat a frying pan over a low heat. Add the butternut squash mixture and fry gently until cooked through.", "For the halloumi, heat the oil in a separate small frying pan over a medium heat. Add the halloumi and fry for two minutes on each side, until golden-brown.", "Serve the butternut squash on a warm plate with the fried halloumi on top."]}, {"isVegetarian": true, "title": "Butternut squash stew with coriander rouille", "url": "www_bbc_co_uk_food_recipes_butternutsquashsteww_85528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "100g/3½oz butternut squash, peeled and chopped into 1cm/½in cubes", "¼ red onion, chopped", "1 leek, trimmed and  chopped", "1 red pepper, chopped", "100ml/3½fl oz white wine", "50ml/2fl oz double cream", "salt and freshly ground black pepper ", "large handful fresh coriander", "large handful fresh parsley", "2 tbsp chopped fresh chives", "1 garlic clove, chopped", "50g/1¾oz fresh white breadcrumbs", "½ lime, juice only", "2 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the butternut squash stew, heat the oil in a large pan over a medium heat, place the butternut squash pieces into the pan and fry for 6-8 minutes, stirring frequently. ", "Add the red onion, leek and red pepper and cook gently for 4-5 minutes. ", "Add the wine, turn up the heat and simmer for 3-4 minutes. Stir in the cream and season well with salt and freshly ground black pepper.", "For the coriander rouille, place all the ingredients into a small food processor and blend until smooth.", "To serve, pour the stew into a large shallow bowl and drizzle over some of the rouille."]}, {"isVegetarian": true, "title": "Butterscotch puddings with whisky sauce", "url": "www_bbc_co_uk_food_recipes_butterscotch_puddings_33496", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz unsalted butter, plus extra for greasing", "55g/2oz soft light brown sugar", "1 vanilla pod, seeds removed", "225g/8oz self-raising flour", "2 tsp baking powder", "pinch bicarbonate of soda ", "2 free-range eggs, beaten", "300ml/10fl oz full-fat milk", "55g/2oz walnuts, chopped ", "55g/2oz Medjool dates, chopped  ", "handful of chopped walnuts and dates, to decorate ", "200g/7oz crème fraîche or clotted cream, to serve", "85g/3oz salted butter", "85g/3oz muscovado sugar ", "200ml/7fl oz double cream", "Scotch whisky, to taste "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease four small tart tins with butter. ", "For the puddings, place the butter, sugar and vanilla in a mixing bowl and cream together until combined. Mix together the flour, baking powder and bicarbonate of soda in a separate bowl. Add the flour mixture and the eggs gradually to the butter mixture and mix to make a batter. Stir in the milk, walnuts and dates. Spoon the mixture into the prepared tins and bake for 30 minutes, or until set. ", "For the sauce, heat the butter and sugar in a small saucepan over a low heat until melted. Stir in the cream and whisky, to taste. ", "To serve, spoon the sauce over the top or alongside the puddings. Decorate with the chopped walnuts and dates and serve with crème fraîche. "]}, {"isVegetarian": true, "title": "Butterscotch sauce", "url": "www_bbc_co_uk_food_recipes_butterscotchsauce_4814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "50g/2oz soft brown sugar", "50g/2oz golden syrup", "vanilla pod, split", "lemon juice (approx 1/3 lemon)", "75ml/2½fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the butter, brown sugar, golden syrup and vanilla pod in a small saucepan. Bring to a gentle simmer.", "Remove from the heat and add the lemon juice to taste.", "Stir in the double cream.", "Remove the vanilla pod before serving."]}, {"isVegetarian": true, "title": "Buñuelos with spiced guava syrup", "url": "www_bbc_co_uk_food_recipes_buuelos_with_spiced_15500", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buuelos_with_spiced_15500_16x9.jpg", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "1 tsp baking powder", "1 tbsp caster sugar", "½ tsp salt", "1 free-range egg, lightly beaten", "1 tsp vanilla extract", "15g/½oz butter, melted", "700ml/1¼ pint corn or vegetable oil, for frying", "cinnamon sugar ", "300g/10½oz light brown soft sugar", "8cm/3¼in cinnamon stick", "2 strips orange peel", "1 star anise", "4 allspice berries", "1 lime, juice only", "1 orange, juice only", "pinch salt", "1 tsp cornflour, mixed to a paste with 1 tbsp water", "350g/12oz guavas, quartered, or 350g/12oz mango, peeled, stoned removed and cut into 4cm/1½in chunks"], "serves": "Serves 6–8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the buñuelos, put all the dry ingredients in a large bowl and make a well in the centre. Crack the egg into the centre with the vanilla and melted butter. Rub with your fingers until the mixture resembles coarse breadcrumbs. Slowly add 125–150ml tepid water, a quarter at a time, and mix into a smooth dough. Turn onto a lightly floured surface and knead for 5 minutes. Cover with a tea towel and leave to rest for 30 minutes. ", "Meanwhile, to make the fruit syrup, place all the ingredients, apart from the cornflour and guava (or mango), in a large saucepan with 1 litre/1¾ pints of water. Stir until the sugar dissolves, then bring to the boil and simmer for 20 minutes, until thickened. ", "Mix the cornflour with 1 tablespoon of water to make a paste. Stir into the syrup, add the guava (or mango) and cook over a medium heat, stirring occassionally, for 15 minutes until the syrup is thick and the fruit tender. ", "Heat the oil in a deep frying pan to 190C or until a cube of bread browns in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended). ", "Divide the dough into 8 equal balls and roll each one into a 2mm-thick round (like a tortilla) on a lightly floured surface. Make sure they will fit your frying pan. ", "Fry until golden-brown and crisp on one side, then flip it over and cook the other side. Drain on kitchen paper and sprinkle with cinnamon sugar. Repeat with the remaining buñuelos. ", "Break up the buñuelos and place equally between eight bowls. Ladle over some of the fruit syrup and serve."]}, {"isVegetarian": false, "title": "Cabbage pesto, steamed turbot and Lincolnshire potato royal", "url": "www_bbc_co_uk_food_recipes_cabbage_pesto_steamed_99146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 hipsi cabbage", "4 large portions turbot", "sea salt and freshly ground black pepper", "30g/1oz pine nuts, toasted", "30g/1oz parmesan", "200ml/7fl oz olive oil", "squeeze of lemon juice", "500g/1lb 2oz Lincolnshire baby potatoes", "500g/1lb 2oz Lincolnshire Poacher cheese", "1 tbsp crème frâiche", "sea salt and freshly ground black pepper", "25g/1oz butter", "50g/1¾oz chickweed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Separate the cabbage heart by removing the looser leaves from the outer layers but leaving the tighter centre leaves attached to the stem. Bring a large pan of water to the boil, add the outer cabbage leaves and cook until tender. Remove with a slotted spoon into a bowl of iced water to refresh. Return the water to the boil and cook the centre leaves until tender then drain and refresh in iced water.", "Line a baking tray with a large piece of buttered greaseproof paper, season the turbot and place on the paper. Fold the paper over like a parcel and carefully turn it over so the join is at the bottom. Place in the oven and cook for 7-8 minutes until the fish is just cooked through.", "Put the large blanched cabbage leaves, pine nuts, parmesan and oil in a blender, pulse until smooth then season with sea salt and freshly ground black pepper and lemon juice.", "Meanwhile, cook the potatoes in a pan of boiling water then drain well and peel. In a small pan, melt the Poacher cheese with the crème frâiche. Coat the potatoes in the melted cheese and check the seasoning. Cut the blanched cabbage centre into quarters. Melt a little butter in a pan and fry the cabbage until it starts to colour.", "To serve, place the cabbage on a plate and top with a portion of turbot. Arrange the potatoes around the fish, spoon over the cabbage pesto and garnish with the chickweed."]}, {"isVegetarian": true, "title": "Buñuelos with apple and raspberry purée", "url": "www_bbc_co_uk_food_recipes_buuelos_with_apple_and_42330", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buuelos_with_apple_and_42330_16x9.jpg", "ingredients": ["140g/5oz plain flour, plus extra for dusting", "2 tsp caster sugar, plus extra to sprinkle", "¼ tsp baking powder", "pinch salt", "4 tbsp milk", "1 free-range egg", "pinch anise seeds ", "sunflower oil, for deep frying ", "500g/1lb 2oz raspberries", "1 eating apple, peeled, cored and diced", "75g/2½oz icing sugar, plus extra for sprinkling", "squeeze lemon juice"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour into a large bowl and then sift it once more, to make sure it’s very fine. Stir in the caster sugar, baking powder and salt. ", "In a small bowl, whisk the milk, egg and anise together until light and frothy.", "Make a well in the flour and slowly whisk in the egg mixture. Use your hands to create a rough dough and knead on a lightly floured surface until smooth. Shape into 16 small balls, cover and leave to rest for 20 minutes. ", "Meanwhile, to make the coulis, place all the ingredients in a saucepan over a low heat and cook for 5 minutes, or until soft. Blend using a food processor, then pass through a sieve into a bowl.", "Using a rolling pin, roll the dough balls out on a lightly floured surface into very thin rounds and leave to rest for 5 minutes. ", "Heat a deep-fryer to 170C, or until a crumb of bread browns in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended). Fry the buñuelos one at a time, turning halfway through, until puffed and golden. Drain well on kitchen paper and sprinkle with icing sugar. Serve two buñuelos per person with the coulis."]}, {"isVegetarian": true, "title": "Cabbage 'confit' and leek salad", "url": "www_bbc_co_uk_food_recipes_cabbageconfitandleek_80189", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ red cabbage, shredded", "50ml/2fl oz red wine", "100g/3½ oz caster sugar", "100ml/3½fl oz hot chicken stock (vegetarians may substitute vegetable stock)", "1 tbsp olive oil", "2 baby leeks, cleaned", "salt and freshly ground black pepper", "1 tbsp fresh parsley ", "1 tbsp fresh chives", "100g/3½oz breadcrumbs"], "serves": "Serves 1", "time": {"preparation": "", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the cabbage, heat the oil in a large saucepan over a medium heat. Add the shredded cabbage and red wine and cook for three minutes. ", "Add the sugar and cook, stirring well, for two minutes.", "Add the chicken stock, bring to the boil and reduce the heat to a simmer. Simmer for 5-6 minutes, or until the cabbage has softened.", "To make the leeks, heat a griddle pan until smoking. Place the leeks and the olive oil into a large bowl and toss together, seasoning, to taste, with salt and freshly ground black pepper.", "Place the leeks onto the hot griddle pan to cook for two minutes on each side, then transfer to the oven to roast for five minutes.", "To serve, spoon some of the cabbage into a warm bowl, place the roasted leeks over and sprinkle over some of the herbs and breadcrumbs."]}, {"isVegetarian": true, "title": "Cabbage soup", "url": "www_bbc_co_uk_food_recipes_cabbagesoup_75692", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 cloves garlic, finely chopped", "½ cabbage, shredded", "½ tomato, diced", "½ pint vegetable stock", "handful fresh parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small pan and add the garlic, cabbage and tomato. ", "Cook for 5-8 minutes or until soft. Add the stock and continue to cook for 8-10 minutes. ", "Finish by adding the parsley to serve."]}, {"isVegetarian": false, "title": "Bacon and dill stir-fried cabbage with pan-fried sea bass", "url": "www_bbc_co_uk_food_recipes_cabbagebaconanddills_87609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz savoy cabbage, cut into 1cm/½ strips", "300g/10½oz cavalo nero cabbage, cut into 1cm/½ strips", "2 shallots, finely sliced", "150g/6oz pancetta, cut into 5mm/one-eighth inch thick lardons", "3 tbsp dill, roughly chopped", "3 tbsp cider vinegar", "salt and freshly ground black pepper", "200ml/9fl oz fish stock", "110ml/4fl oz double cream", "½ lemon, juice only", "25g/1oz butter", "4 x 175g/7oz sea bass fillets", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cabbage, bring a large pan of water to the boil, then add the cabbage and a pinch of salt. Cook for two minutes then drain and squeeze out any excess water.", "Heat a large frying pan until hot, add the shallots and pancetta and fry for two minutes until golden and crisp.", "Add the drained cabbage and stir fry for a further 2-3 minutes.", "Add the dill and cider vinegar and season with the salt and freshly ground black pepper.", "For the sea bass, place the fish stock and double cream into a saucepan and bring to the boil.", "Reduce the heat and simmer until reduced by one third.", "Add the butter and half the lemon juice.", "Season the sea bass to taste with salt and freshly ground black pepper. Meanwhile, heat a frying pan until hot and add the olive oil and sea bass, skin-side down.", "Fry for 2-3 minutes on the skin side, then turn and cook for a further minute on the flesh side. Squeeze the remaining lemon juice over the fish.", "To serve, place a pile of cabbage on the plate, set the fish alongside it and spoon the sauce over the top."]}]