[{"isVegetarian": false, "title": "Gnocchi alla Romana with bone marrow and veal sweetbreads", "url": "www_bbc_co_uk_food_recipes_gnocchi_alla_romana_with_06833", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["568ml/1 pint full-fat milk", "130g/4¾oz semolina flour", "pinch freshly grated nutmeg", "pinch salt", "30g/1oz butter", "60g/2¼oz Parmesan ", "2 egg yolks ", "knob of butter", "1 garlic clove, crushed ", "2 shallots, finely chopped ", "1 split bone marrow, approximately 20cm/8in long", "2 tbsp finely chopped parsley ", "50g/1¾oz breadcrumbs ", "600g/1lb 5oz veal sweetbreads, ", "30g/1oz butter ", "splash Madeira ", "1 bunch flatleaf parsley, roughly chopped", "1 banana shallot, thinly sliced", "1 tsp baby capers ", "splash red wine vinegar ", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the gnocchi, bring the milk to the boil in a saucepan, pour in the semolina flour and whisk until smooth. Season with nutmeg and salt. ", "Turn the heat down and beat in the butter, Parmesan and egg yolks. Tip into a shallow tray and leave to cool.", "Using a 5cm/2in cutter, cut out rounds and arrange in an ovenproof dish. Grate over some more Parmesan and bake for about 20 minutes, or until golden brown.", "For the bone marrow, melt the butter in a small pan and add the garlic and shallot. Cook gently for a few minutes until softened. ", "Remove the marrow from the bone and chop into small pieces, reserving the bone. Mix with the softened shallot and garlic, parsley and breadcrumbs. Put the mixture back into the bone cavity and bake for about 15 minutes, or until golden brown. ", "Meanwhile, blanch the sweetbreads in boiling water for 5 minutes, then remove the skin and thickly slice. Melt the butter in a frying pan and when foaming, add the sweetbreads. Cook until golden brown on both sides. Add a splash of Madeira to deglaze the pan. Remove the sweetbreads and set aside to rest. ", "For the salad, mix the parsley, banana shallots, capers, red wine vinegar and olive oil. ", "Serve the gnocchi with the bone marrow, sweetbreads and salad alongside. "]}, {"isVegetarian": false, "title": "Gnocchi con granseola", "url": "www_bbc_co_uk_food_recipes_gnocchi_con_granseola_42070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice of nutmeg", "pinch of coriander seeds", "4 cloves ", "1cm/½in cinnamon stick", "pinch of ground ginger", "1 green cardamom pod, seeds only", "⅛ tsp turmeric", "⅛ tsp chilli powder", "225g/8oz floury potatoes, in their skins", "80g/2¾oz plain flour", "¼ tsp salt", "½ free-range egg, beaten (approximately 20g/¾oz)", "2 tbsp olive oil", "1 small garlic clove", "250g/9oz prawn heads and shells", "1 tbsp tomato purée", "½ tsp salt", "5 tbsp olive oil", "½ small onion, grated", "1 garlic clove, grated", "pinch chilli flakes", "¼ tsp Byzantine spice mix", "300ml/10fl oz prawn stock", "knob of butter", "small handful finely chopped flatleaf parsley", "200g/7oz white crab meat"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to180C/160C Fan/Gas 4. ", "For the spice mix, put all of the ingredients in a pestle and mortar and pound to a smooth mix. Alternatively use an electric spice grinder. Store in an airtight tin or box.  ", "Bake the potatoes for 50 minutes, or until very soft and leave to cool. ", "Meanwhile, make the prawn stock, heat the olive oil in a large pan over a medium heat. Add the garlic and the prawn heads and shells. Stir-fry for a couple of minutes before adding the tomato purée, salt and 300ml/10fl oz water. Cook for 10 minutes, then pass through a sieve, pushing down on the shells to extract as much of the prawn flavour as you can. Discard the shells and set the stock aside.", "When the potatoes are cool, scoop the flesh out from the skins and mash it or pass or through a potato ricer. Mix with the flour, salt and egg to make a firm dough. Roll the mixture into 1cm/½in thick sausages, cut into 2cm/¾in lengths. Cover and set aside.", "For the sauce, heat the olive oil in a pan over a medium heat and sweat the onion and garlic for 5 minutes, or until soft. Add the chilli flakes and Byzantine spice mix and stir for 1 minute. Add the prawn stock, bring to a simmer to reduce down a little, then whisk in the knob of butter.", "Bring a pot of salted water to the boil. Boil the gnocchi for 3 minutes, or until they rise to the surface. Drain and keep warm.", "Stir the parsley and crab meat into the sauce, then pour over the cooked gnocchi and serve."]}, {"isVegetarian": false, "title": "Gnocchi in a creamy spinach sauce with deep-fried broccoli florets", "url": "www_bbc_co_uk_food_recipes_gnocchi_in_a_creamy_77453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz King Edward potatoes, peeled and cut into chunks", "60g/2¼oz plain flour", "40g/1½oz parmesan cheese (or a similar vegetarian hard cheese), finely grated", "1 tbsp olive oil", "salt and freshly ground black pepper", "50g/1¾oz butter", "2 tbsp pine nuts", "2 garlic cloves, finely chopped", "100g/3½oz baby spinach leaves", "150ml/5fl oz vegetable stock", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "50g/2oz parmesan cheese, finely grated", "1 small broccoli head, cut into small florets, blanched and refreshed", "110g/4oz plain flour", "110g/4oz cornflour", "150-200ml/5-7fl oz sparkling water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the gnocchi, place the potatoes on a baking tray and bake in the oven for an hour.", "When cooked, scoop out the potato flesh and pass through a potato ricer into a mixing bowl, or mash very thoroughly.", "Add the flour, parmesan and one tablespoon of olive oil. Beat together until smooth. Season with salt and freshly ground black pepper.", "Use your hands to bring the dough together and roll it into long sausage shape. Cut into 2-3cm/¾-1¼in  length pieces.", "Bring a large pan of water to the boil and cook the gnocchi until they float to the surface (approximately one minute). Do not crowd the pan - you may need to cook the gnocchi in batches.", "Remove the gnocchi from the water with a slotted spoon and drain. Repeat the process with any remaining dough.", "Heat a frying pan until hot then add the remaining olive oil. Add the gnocchi and fry until golden-brown. Set aside.", "For the spinach and broccoli sauce, heat the butter in a large frying pan over medium heat. Add the pine nuts to the pan and cook for three minutes, or until lightly browned. ", "Add the garlic to the pan and cook for one minute. Add the spinach to the pan and cook for one minute, or until spinach wilts. ", "Add the stock and cook for four minutes, then add the cream and cook for 2-3 minutes, or until the sauce has thickened. Season with salt and pepper and sprinkle with parmesan cheese. Mix the cooked gnocchi into the sauce.", "For the deep-fried broccoli, heat a deep-fat fryer to 180C/350F, or until a cube of bread sizzles and turns golden-brown when dropped into the oil. ", "In a bowl, mix the plain flour and cornflour with the sparkling water. Dip the broccoli florets into the batter.", "Add the broccoli florets to the hot oil and fry until crisp. Carefully remove the broccoli using a slotted spoon. Drain on kitchen paper and season with salt and pepper.", "To serve, place the warm gnocchi and sauce in serving bowls with the fried broccoli on top."]}, {"isVegetarian": false, "title": "Gnocchi with 'nduja, garlic and courgette", "url": "www_bbc_co_uk_food_recipes_gnocchi_with_nduja_32034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz King Edward potatoes", "60g/2¼oz plain flour", "40g/1½oz Parmesan, finely grated", "1 tbsp olive oil", "75g/2½oz unsalted butter", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 garlic cloves, thinly sliced", "1 shallot, chopped", "100g/3½oz 'nduja", "1 green and 1 yellow courgette, scooped into balls using a parisenne scoop (or dice)", "75g/2½oz unsalted butter ", "2 tbsp fresh basil ", "4 tbsp Parmesan, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Bake the potatoes on a baking tray for 1 hour, or until soft. Scoop out the flesh and pass it through a potato ricer into a mixing bowl, or mash it thoroughly. Add the flour, Parmesan and oil and beat until smooth. Season with salt and freshly ground black pepper.", "Using your hands, bring the dough together and roll it into a long sausage shape. Cut into 2-3cm/¾-1¼in length pieces.", "Bring a large pan of water to the boil and cook the gnocchi for about 1 minute, or until they float to the surface. Do not crowd the pan; you may need to cook the gnocchi in batches. Lift the gnocchi out of the water using a slotted spoon and drain well. ", "Heat a frying pan until hot. Melt the butter, then add the gnocchi and fry until golden-brown. Set aside. ", "For the sauce, heat the oil in a frying pan until hot. Add the garlic and cook for 1 minute. Add the shallot and cook for a further minute. Add the nduja and courgettes, stir and cook for 4-5 minutes, or until done.", "To serve, add the fried gnocchi to the sauce and cook until hot through. Serve scattered with the Parmesan and basil."]}, {"isVegetarian": true, "title": "Gnocchi with sage butter", "url": "www_bbc_co_uk_food_recipes_gnocchi_with_sage_butter_26736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz floury potatoes, roughly all same size ", "salt and black pepper ", "1 egg ", "300g/10½oz plain flour, plus extra for dusting ", "100g/3½oz butter ", "8 sage leaves "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the unpeeled potatoes in a saucepan with lots of cold water, bring to the boil and cook until the potatoes are tender, but not falling apart. Drain, allow to cool slightly, then remove the skins. While the flesh is still warm, mash the potatoes and set aside to cool. Place in a large bowl, season with salt, stir in the egg, add the flour and mix to form a dough (you may need to use your hands).  ", "On a clean work surface, sprinkle a little extra flour and roll out the dough into four long sausage-shapes, each approximately 30x3cm/12x1¼in. With a sharp knife, cut each sausage shape into 2cm/¾in pieces, and set aside.  ", "Place a large saucepan of slightly salted water on the heat to boil. Drop the gnocchi into the pan of boiling water and simmer until they rise to the top.  ", "In the meantime, place a large frying pan on the heat and melt the butter with the sage leaves. As the gnocchi come to the surface, lift them out with a slotted spoon and add to the butter sauce along with a little cooking water. Gently fry for a minute, making sure all the gnocchi are coated in the butter sauce, and then serve immediately."]}, {"isVegetarian": false, "title": "Gnocchi with sausagemeat", "url": "www_bbc_co_uk_food_recipes_gnocchi_with_sausage_68197", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium potatoes ", "200-300g/7-10½oz salt", "75g/2½oz plain flour, plus extra for dusting", "50g/1¾oz grated parmesan", "1 egg yolk", "salt and pepper", "knob of butter", "30g/1oz breadcrumbs", "2 tbsp vegetable oil", "2 pork sausages", "2 beef sausages", "1 onion, diced ", "2 garlic cloves, sliced", "200ml/7fl oz ham stock ", "100g/3½oz peas, thawed if frozen", "1 tbsp cream", "1 tbsp capers", "1 tbsp dried parsley (or use fresh if available)", "½ romaine lettuce heart", "fresh grating of parmesan, to serve", "1 lemon, zest only, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Lightly score or prick the potatoes. Spread out the salt on a baking tray to make a bed of salt and sit the potatoes on top. Bake in the oven for 45 minutes to one hour, or until tender.", "Allow the potatoes to cool until comfortable enough to handle.  Cut in half and spoon the cooked potato out of the skins. ", "Finely mash the potato or put through a potato ricer. Add the flour, parmesan and egg yolk.  Season with salt and pepper and mix well.  Keep mixing until the potato forms a dough.", "Working on a lightly floured surface, divide the dough into four.  Roll each quarter into a sausage shape about 20cm/8in long and cut into 2cm/1in pieces.  Shake off any excess flour.", "Melt the butter in a frying pan and lightly fry the breadcrumbs until golden-brown. Tip into a small bowl and set aside. ", "Heat a tablespoon of oil in the same frying pan and fry the gnocchi in batches until golden-brown on all sides.  Remove from the pan, set aside and keep warm until all the gnocchi is fried.  ", "Remove the skins from the sausages, break up the sausagemeat and fry with a little oil for four minutes, then add the onion and fry for a further three minutes until it is all golden-brown. Add the garlic and fry for another minute.  ", "Add the stock, peas, cream, capers and parsley. Bubble over a high heat to reduce the volume of liquid slightly and thicken the sauce. Finally add the fried gnocchi and warm through in the sauce for a minute or two.  ", "To serve, divide the lettuce between four plates or bowls, serve the gnocchi on top, scatter with the fried breadcrumbs, grated parmesan and finely grated lemon zest."]}, {"isVegetarian": true, "title": "Gnocchi with wild rocket", "url": "www_bbc_co_uk_food_recipes_gnocchi_with_wild_rocket_14134", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gnocchi_with_wild_rocket_14134_16x9.jpg", "ingredients": ["700g/1lb 9oz Desiree potatoes, roughly cut to pieces all the same size and unpeeled", "salt and freshly ground black pepper", "2 free-range eggs, yolks only", "150g/5½oz plain flour", "rice flour, for dusting", "300g/10½oz wild rocket, roughly chopped", "200g/7oz watercress, stalks discarded, roughly chopped", "150ml/5½fl oz extra-virgin olive oil", "1 small onion, finely chopped", "1 garlic clove, finely chopped", "1 small red chilli, finely chopped", "20 basil leaves, roughly torn", "salt and freshly ground black pepper", "freshly grated parmesan (or a similar vegetarian hard cheese), to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the gnocchi, place the potatoes in a saucepan with lots of salted cold water. Bring to the boil and cook until the potatoes are tender, but not falling apart (about 15–20 minutes depending on the size of your potatoes). ", "Drain and allow to cool a little. When cool enough to handle, remove the skins. While the potatoes are still warm, mash them until smooth or pass through a ricer, then set aside to cool completely.", "Season the cooled potatoes with salt and pepper, stir in the egg yolks and add the flour. Bring the mixture together to form a dough. ", "Sprinkle some rice flour on a clean work surface and roll out the dough into long sausage shapes. With a sharp knife cut the roll into dumpling shapes of about 2cm/1in. Set aside.", "For the sauce, blanch the rocket and watercress for a minute in boiling salted water. Remove and refresh in cold water.  Drain well.", "In a large frying pan, heat the olive oil. Add the onion, garlic and chilli and fry until the onion is soft and translucent. Stir in the rocket, watercress and basil and stir-fry for a couple of minutes to heat through. Season, to taste.", "Bring a large pan of water to the boil and drop in the gnocchi. Simmer until they rise back to the top then lift them out with a slotted spoon. Drain well and mix into the sauce, taking care not to break up the gnocchi.", "Serve immediately with some freshly grated parmesan. "]}, {"isVegetarian": true, "title": "Spicy tomato sauce with gnocchi", "url": "www_bbc_co_uk_food_recipes_gnocchiallarrabbiata_85118", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gnocchiallarrabbiata_85118_16x9.jpg", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 garlic clove, chopped", "1 green chilli, chopped", "1 tbsp white wine vinegar", "1 tsp caster sugar", "3 plum tomatoes, chopped", "salt and freshly ground black pepper", "200g/7oz ready-made gnocchi, cooked according to packet instructions ", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the arrabbiata sauce, heat the oil in a frying pan and gently fry the onion and garlic until soft. Add the chilli, vinegar and sugar and stir well.", "Add the chopped tomatoes and simmer until the tomatoes break down and go mushy. Season with salt and pepper.", "Put the gnocchi in a serving bowl and drizzle with oil. Season with salt and pepper and stir.", "Pour the sauce over the gnocchi and serve. "]}, {"isVegetarian": true, "title": "Gnocchi di spinaci e ricotta", "url": "www_bbc_co_uk_food_recipes_gnocchidispinacieric_85614", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gnocchidispinacieric_85614_16x9.jpg", "ingredients": ["500g/1lb 2oz frozen spinach, thawed, or 650g/1lb 7oz fresh spinach, cooked until wilting", "250g/9oz ricotta cheese", "100g/3½oz parmesan, or similar vegetarian hard cheese, freshly grated", "150g/5oz plain flour, plus extra for flouring", "2 free-range eggs", "freshly grated nutmeg", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil", "1 medium onion, chopped", "1 carrot, finely diced", "2 garlic cloves, chopped", "2 x 400g/14oz cans chopped tomatoes", "2 tbsp tomato purée", "1 tsp caster sugar", "1 bouquet garni (3 generous sprigs fresh thyme, 2 bay leaves, 2 big sprigs fresh parsley, tied together with string)", "salt and freshly ground black pepper", "freshly grated parmesan, or similar vegetarian hard cheese"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the gnocchi, place the thawed frozen spinach or cooked fresh spinach into a sieve to drain. Squeeze out as much water as possible, then weigh the spinach - you should have 250g/9oz of spinach after all the water has been squeezed out. Chop it up finely.", "Place the ricotta into a large bowl and beat until smooth. Add the spinach, parmesan, flour, eggs and plenty of nutmeg. Season generously with salt and freshly ground black pepper and mix well with your hands, making sure it is evenly blended. Cover and leave in the fridge for an hour or more before moving on to the next step.", "For the sauce, heat the oil in a large pan and fry the onion and carrot slowly until tender. Add the garlic and cook for another minute.", "Add the tomatoes, tomato purée, caster sugar and the bouquet garni, then season with salt and freshly ground black pepper and stir. Leave to simmer gently for about 30 minutes, stirring frequently to prevent it from catching on the bottom, even adding a splash of water if necessary. Remove from the heat, remove the bouquet garni and allow to cool slightly.", "Place the tomato mixture into a food processor and blend until smooth, then set aside.", "Dredge a large plate with plenty of flour. Take dessertspoons of the chilled ricotta mixture, roll into neat balls, then roll in the flour. Place on a floured tray and set aside until needed.", "Shortly before you intend to eat the gnocchi, bring a wide, shallow pan of water to the boil, then turn the heat down to a more gentle simmer. Carefully add your gnocchi to the pan, taking care not to overcrowd, and poach for 10-15 minutes, turning occasionally.", "Meanwhile, gently reheat the tomato sauce.", "When the gnocchi are cooked, remove them from the water with a slotted spoon and place onto warmed plates, or into one large shallow serving dish, and pour over the tomato sauce. Sprinkle with grated parmesan."]}, {"isVegetarian": true, "title": "Gnocchi with cheese sauce", "url": "www_bbc_co_uk_food_recipes_gnocchiwithcheesesau_85119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "½ onion, chopped", "1 garlic clove, chopped", "50ml/2fl oz white wine", "200ml/7fl oz double cream", "100g/3½oz Pont l'Evêque cheese, chopped", "salt and freshly ground black pepper", "150g/5½oz ready-made gnocchi, cooked according to packet instructions", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheese sauce, heat the butter in a frying pan over a medium heat and fry the onion and garlic until soft.", "Add the white wine and simmer until reduced by half. Add the double cream and simmer gently.", "Stir in the cheese, season well with salt and freshly ground black pepper and warm through until the cheese has melted.", "For the gnocchi, place the gnocchi into a serving bowl and drizzle with oil. Season, to taste, with salt and freshly ground black pepper and stir.", "To serve, pour the sauce over the gnocchi."]}, {"isVegetarian": false, "title": "Gnocchi with duck ragù", "url": "www_bbc_co_uk_food_recipes_gnocchiwithduckragu_84330", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz floury potatoes (such Russets), unpeeled", "1 large free-range egg", "salt and freshly ground black pepper", "450g/1lb plain flour", "olive oil, to drizzle", "2 tbsp olive oil", "1 onion, finely chopped", "1 carrot, finely chopped", "1 stick celery, finely chopped", "4 garlic cloves, finely chopped", "1 red chilli, finely chopped ", "1 red pepper, finely chopped ", "150g/5oz tomato purée", "450ml/16fl oz red wine", "450ml/16fl oz chicken stock", "sprig fresh rosemary", "450g/1lb ready-made confit duck leg, meat removed from the bone ", "Pecorino cheese, shaved, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the gnocchi, boil the potatoes for about 40 minutes, until tender. Remove from the heat, drain and leave to cool. Once cooled, mash well in a bowl. ", "Make a well in the centre of the mashed potato, add the egg to the centre and season with salt and freshly ground black pepper. ", "Add the flour and mix well to form a dough. Knead the dough for 3-4 minutes,  until it becomes dry to the touch.", "Divide the dough into three pieces. On a clean, well-floured surface, roll out the dough into 2cm/1in diameter lengths, then cut into pieces at 2cm/1in intervals.", "Place these gnocchi pieces into boiling water and cook for 2-3 minutes. When they rise to the top they are cooked. Scoop out with a slotted spoon and refresh in iced water. Drain, drizzle with olive oil and set aside.", "For the duck ragu, heat the oil in a large saucepan over a medium heat. Add the onions, carrots, celery, garlic, chilli and pepper and fry for 5-6 minutes, or until softened. ", "Add the tomato purée, stir well and cook for 7-8 minutes, until the mixture becomes a rich red colour.", "Add the wine, stock and rosemary sprig and bring to boil.", "Add the duck meat and reduce the heat to simmer for 45 minutes to an hour, or until the meat falls apart. ", "Finally add the gnocchi to the ragu and warm through.", "To serve, spoon out into bowls and garnish with shavings of Pecorino cheese."]}, {"isVegetarian": false, "title": "Gnocchi with pesto", "url": "www_bbc_co_uk_food_recipes_gnocchiwithpesto_72119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ packet gnocchi, cooked", "handful of rocket, finely chopped", "1 lemon, zest and juice only", "5-6 tbsp olive oil", "55g/2oz parmesan, finely grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Stir together all the pesto ingredients.", "Add the gnocchi and stir to coat.", "Sprinkle over more parmesan and serve."]}, {"isVegetarian": true, "title": "Gnocchi with tomato and basil", "url": "www_bbc_co_uk_food_recipes_gnocchiwithtomatoand_84285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 garlic, clove ", "½ tsp red wine vinegar", "½ tsp caster sugar", "150ml/4½fl oz passata", "small bunch basil, chopped", "125g/4oz ready-made gnocchi, cooked according to packet instructions", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry until softened.", "Add the vinegar and sugar and stir until the sugar has dissolved.", "Add the passata, bring to the boil, then reduce the heat to simmer for 5-6 minutes.", "Add the basil and season, to taste, with salt and freshly ground black pepper. ", "Add the gnocchi and stir well to coat.", "To serve, place the gnocchi and sauce into a bowl and serve immediately."]}, {"isVegetarian": false, "title": "Gnocchi with halibut roe, peas and broad beans", "url": "www_bbc_co_uk_food_recipes_gnocci_with_halibut_roe_93269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz butter", "300g/10½oz new potatoes, preferably aura, thinly sliced", "700ml/1¼ pint chicken stock", "700g/1lb 9oz floury potatoes ", "90g/3¼oz “00” pasta flour, with a little extra for dusting", "10g potato starch", "2 free-range egg yolks", "drizzle olive oil, for greasing", "400g/14oz halibut roe, trimmed and membrain removed", "1 lemon, juice only", "200g/7oz peas, podded", "400g/14oz young broad beans, podded", "200g/7oz mangetout, finely sliced, to serve", "handful flowering herbs (such as chervil, chives, wild garlic), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt 75g/2½oz of butter in a saucepan over a medium heat and cook the sliced new potatoes for 1 minute. Cover with stock, bring to a simmer and cook for 10 minutes. Remove from the heat and leave to cool in the pan for 1 hour. ", "Meanwhile, pre-heat the oven to 200C/180C Fan/Gas 5.", "Bake the floury potatoes for an hour or until cooked through and fluffy. Spoon out the flesh and pass it through a ricer or fine sieve into a clean bowl.", "Mix the mashed potatoes with the '00' flour, potato starch, egg yolks and salt until just combined.", "On a lightly floured surface, roll out the dough into long sausages about the thickness of your thumb. Cut into pieces of the same length (roughly 1–2 inches).", "Bring a large pan of salted water to the boil and carefully place the gnocchi in with a slotted spoon. Boil until the gnocchi floats to the surface. Remove with a slotted spoon and place on an oiled baking tray. Set aside in a warm place while you finish the dish.", "Strain the cooking liquid from the new potatoes into a clean pan, then add in half the cooked potato slices (you can reserve the other half for breakfast). Blend the broth with a stick blender, and add salt to taste. Bring the pan to a gentle simmer and add a large knob of butter, then give a final froth with the stick blender. ", "Melt a 50g/1¾oz of butter in a frying pan over a medium heat until foaming. Cook the roe until opaque, this should take 2–3 minutes per side. Remove from the pan and season with lemon juice and salt and cut into slices.", "Bring a pan of salted water to the boil and cook the broad beans and peas for 1–2 minutes, until tender. ", "To serve, place the peas and beans between 4 warmed plates. Add the roes and gnocchi, pour over the potato broth and garnish with the julienned mangetout and flowering herbs."]}, {"isVegetarian": true, "title": "Génoise sponge with blueberry compôte and vanilla cream", "url": "www_bbc_co_uk_food_recipes_gnoise_sponge_with_69988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz caster sugar", "8 medium free-range eggs", "250g/9oz plain flour", "50g/1¾oz butter, melted ", "250g/9oz blueberries", "100g/3½oz caster sugar", "500ml/18fl oz double cream", "1 vanilla pod, cut in half lengthways and seeds scraped out", "icing sugar, for dusting"], "serves": "Makes 1 x 22cm/9in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line two 22cm/9in round cake tins.", "For the génoise sponge, place the sugar and eggs in a large bowl and whisk until thick and pale.", "Fold in the flour and melted butter and divide between the prepared cake tins.", "Bake in the oven for 20-30 minutes, or until the cakes are risen and springy to the touch. Remove from the oven and set aside to cool. When cool enough to handle, turn out on to a wire rack to cool completely.", "For the blueberry compôte and vanilla cream, place the blueberries, sugar and four tablespoons of water in a small saucepan.  Place over a medium heat and simmer for five minutes. Remove from the heat and set aside to cool and thicken.", "Place the cream in a large bowl and add the vanilla seeds. Whisk until thick.", "To serve, spread the cooled compôte over the top of one cake and top with the whipped cream. Place the other cake on top and dust with icing sugar."]}, {"isVegetarian": true, "title": "Gnudi with arrabiata sauce", "url": "www_bbc_co_uk_food_recipes_gnudi_with_arrabiata_38405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz ricotta, drained", "50g/1¾oz Parmesan, finely grated", "freshly grated nutmeg", "salt, to taste", "about 250g/9oz semolina, for dusting", "olive oil, for drizzing", "2 tbsp olive oil", "2 garlic cloves, very finely chopped or crushed", "1 tsp dried chilli flakes", "500g/1lb 2oz fresh tomatoes, peeled and puréed (or tinned equivalent)", "pinch sugar (optional)", "handful basil leaves", "salt and freshly ground black pepper", "grated Parmesan", "basil leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the ricotta in a large bowl and break up with a fork. Add the Parmesan and nutmeg and season with salt. Mix together thoroughly.", "Put half of the semolina into a roasting dish or tray. Wet the palm of your hands and dip in the semolina – this will help the ricotta from sticking too much. Shape heaped teaspoons of the mixture into small dumplings – or if you want to avoid mess, use two teaspoons to make quenelles. ", "You should end up with between 24-30 dumplings, depending how generous you are. Drop the dumplings into the semolina and pour over the remaining semolina, making sure they are completely covered.", "Cover the tray and put in the fridge for at least 8 hours, but preferably overnight. When you are ready to cook, remove the gnudi from and pat off any loose semolina. ", "For the sauce, heat the olive oil in a large saucepan and add the garlic. Cook very gently for 2-3 minutes, then add the chilli flakes and tomatoes. ", "Season with salt and pepper, then bring to the boil and simmer until the sauce has reduced down – you don’t want it too thick, it needs to be fairly liquid to go well with the gnudi. Taste and add a pinch of sugar if you think if it needs it, then stir in the fresh basil. ", "To cook the gnudi, bring a large pan of salted water to the boil. Turn down to a simmer, add the gnudi, all at once, and leave to cook. When the gnudi start floating, they will be done – this will take around 4–5 minutes. Remove them carefully with a slotted spoon (be careful, they are fragile). Drizzle with a little olive oil.", "To serve, flood a serving plate with sauce and drop the dumplings on top. Top with a little more Parmesan and basil leaves."]}, {"isVegetarian": false, "title": "Goan-style lobster with chips", "url": "www_bbc_co_uk_food_recipes_goan-style_lobster_with_90994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 live lobsters", "2 tbsp vegetable oil", "150g/5oz desiccated coconut", "4 dried bird’s-eye red chillies", "1 tbsp coriander seeds", "1 tbsp cumin seeds", "1 tsp black peppercorns", "4 cloves", "2 onions, sliced", "1 green chilli, finely chopped", "1 garlic clove, finely grated", "5cm/2in piece ginger, finely grated", "¼ tsp ground turmeric", "50ml/2fl oz tamarind pulp", "300ml/11fl oz coconut milk", "2 tbsp finely chopped coriander leaves", "4 large chipping potatoes, peeled and cut into 1cm/½in thick chips", "vegetable oil, for frying", "sea salt, to taste"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the lobster, put the lobsters in the freezer for two hours until almost frozen - this will render them unconscious. ", "Add them to a large pan of boiling salted water and simmer for two minutes. Remove the lobsters from the pan, immerse them in chilled water and then drain. ", "Remove all the meat from the shells, keeping them whole - discard the black intestinal vein that runs down the tail flesh and the stomach sac and gills from the head. The meat will just be blanched, not completely cooked at this stage.", "In a teaspoon of oil, lightly fry the coconut in a deep frying pan with the dried chillies, coriander seeds, cumin seeds, peppercorns and cloves for about two minutes, or until lightly coloured. Remove and set aside to cool slightly, then transfer to a food processor and blend until the coconut and spices are finely ground.", "Heat the remaining vegetable oil in a wok, add the onions and fry for 5-7 minutes, or until light and brown. ", "Stir in the garlic, ginger and green chilli and fry for 2-3 minutes. Add the coconut spice mixture and cook, stirring, for two minutes. ", "Add the turmeric and tamarind pulp and simmer for 2-3 minutes. Stir in the coconut milk, a little at a time, stirring to combine.", "Stir in the lobster pieces and simmer for two minutes, or until just warmed through. Sprinkle in the chopped coriander and set aside until ready to serve. ", "For the chips, bring a pan of salted water to the boil, add the chips and simmer for five minutes, or until just tender.", "Drain carefully and then pat dry. (You can freeze them at this point if you want to prepare in advance. Place the chips on a parchment lined tray in the freezer until frozen. They can be transferred, once frozen, into a plastic bag to store in the freezer. Defrost them before frying.)", "To finish the chips, heat the oil in a deep fat fryer to 180C/350F/Gas 4.", "Add the chips and fry for 4-5 minutes, or until golden-brown and cooked through.", "Drain, place on a plate lined with kitchen paper and sprinkle with sea salt. ", "To serve, spoon the lobster onto four plates, pour over the sauce and then pile the chips alongside."]}, {"isVegetarian": false, "title": "Goan lobster curry", "url": "www_bbc_co_uk_food_recipes_goan_lobster_curry_02100", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "2 small onions, chopped", "2 tsp ground cumin", "2 tsp ground coriander", "2 tsp mango powder", "1 stick cinnamon, broken up", "3 garlic cloves, chopped", "1 red chilli, finely chopped", "100g/3½oz fresh coconut, grated", "400ml/14fl oz coconut milk", "4 tsp tamarind paste", "675g/1lb 8oz cooked lobster, meat removed and cut into large pieces", "1 small bunch coriander, chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan, heat the oil. When hot add the onions and fry for 4-5 minutes, or until deeply golden-brown. Add all the spices, garlic, chilli, fresh coconut and coconut milk. Bring to the boil, then add the tamarind paste and simmer for 3- 4 minutes.", "Stir through the lobster meat. Cook until the lobster is warmed through, then sprinkle over the coriander and season to taste with salt and pepper."]}, {"isVegetarian": true, "title": "Goan coconut gobi", "url": "www_bbc_co_uk_food_recipes_goancoconutgobi_71895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "1 tsp coriander seeds ", "¾ tsp mustard seeds (black preferably but yellow is okay) ", "2 tsp fresh root ginger, minced", "2 green chillies, finely chopped ", "½ tbsp chopped almonds (optional) ", "1 small onion, finely chopped ", "200g/7oz cauliflower, cut into florets ", "200g/7oz broccoli, cut into florets", "2 medium tomatoes, chopped ", "handful of green beans", "½ tsp turmeric powder ", "1 tsp salt", "1 tbsp water", "200ml/7fl oz coconut milk  ", "fresh chopped coriander for garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan over a high heat. When hot add the mustard and coriander seeds. ", "Once the seeds start to pop reduce the heat and add the ginger, chillies, almonds and onion. Stir and cook for two minutes. ", "Next add the cauliflower and broccoli florets and stir to mix everything well, cover and cooked for five minutes. ", "Then add the tomatoes, green beans, turmeric, salt and water. Stir and cover the pan, turn the heat down to low and cook for 3-5 minutes until the cauliflower is just tender. ", "Finally add the coconut milk and bring to the boil, reduce the heat to a rapid simmer and cook for 2-3 minutes until the sauce is nice and thick. ", "Serve garnished with fresh coriander and hot thick chappatis."]}, {"isVegetarian": true, "title": "Goan coconut pancakes", "url": "www_bbc_co_uk_food_recipes_goancoconutpancakes_12752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz plain flour", "1 tbsp caster sugar", "a pinch of salt", "1 egg", "150ml/5fl oz coconut milk", "1 tbsp melted butter, plus extra for brushing", "a few drops of vanilla extract", "a good pinch of grated lemon zest", "a little oil or butter for making the pancakes and for greasing the pan", "10-12 tbsp fresh grated coconut", "1 tbsp golden raisins", "80g/3oz palm molasses or jaggery, coarsely grated (or brown sugar)", "¼tsp ground cardamom", "¼tsp nutmeg, grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour, sugar and salt into a bowl. Make a well in the centre and add the egg, coconut milk and melted butter. Whisk to a smooth batter, then stir in the vanilla and lemon zest. It should have a thin pouring consistency.", "Mix together all the ingredients for the stuffing.", "Heat a little oil or butter in a 15-18cm/6-7in frying pan. Pour in enough batter to coat the bottom thinly, tilting the pan to spread it. Cook for 1 minute, until lightly browned underneath, then flip over and cook the other side. Turn out and make the remaining pancakes in the same way.", "Divide the filling between the pancakes and roll up. Place on individual serving plates, brush with melted butter and heat through under the grill.", "Serve with vanilla ice cream."]}, {"isVegetarian": false, "title": "Goan mutton curry with spiced pilau rice", "url": "www_bbc_co_uk_food_recipes_goan_mutton_curry_with_54906", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goan_mutton_curry_with_54906_16x9.jpg", "ingredients": ["1 tsp cumin seeds", "1 tsp coriander seeds", "1 stick cinnamon", "1kg/2lb 2oz mutton leg, boned and cut into 2.5cm/1in cubes", "2 onions, finely sliced", "2 garlic cloves, crushed", "2.5cm/1in piece fresh root ginger, finely grated", "2 long red chillies, sliced", "3 tbsp tamarind paste", "1 tsp mango powder (available from online retailers)", "500ml/18fl oz beef stock", "90g/3½oz desiccated coconut", "1 x 400ml/14fl oz can coconut milk", "2 tbsp fresh coriander leaves", "2 tbsp vegetable oil", "1 onion, finely diced", "1 garlic clove, crushed", "3 green cardamom pods, split", "1 tsp ground coriander", "1 tsp ground cumin", "1 tsp turmeric", "3 cloves", "1 cinnamon stick", "8 curry leaves", "400g/14oz basmati rice", "½ lemon, juice only", "200g/7oz Greek-style yoghurt", "200g/7oz mango chutney"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry, heat a heavy-based frying pan until hot, add the cumin and coriander seeds and cinnamon and toast for a few seconds. Place the spices into a pestle and mortar or spice grinder and grind to a powder.", "Heat a large heavy-based saucepan pan or casserole dish until hot, add the vegetable oil and the mutton and cook until golden-brown all over. Remove using a slotted spoon and set aside.", "Add the onions and cook for 10 minutes, or until soft and golden-brown.", "Add the garlic, ginger, chilli, toasted spices and remaining spices and cook for one minute.", "Return the mutton to the pan then add the beef stock and bring to a simmer. Cover with a lid and cook over a gentle heat for one hour then remove the lid.", "Add the desiccated coconut and the coconut milk and return to a simmer. Cook for another 30 minutes, or until just thickened and the meat is tender. Season, to taste, with salt and freshly ground black pepper.", "For the rice, heat a saucepan until hot. Add the oil, onion, garlic and spices, and fry for two minutes. ", "Stir in the rice and add 600ml/1pint 1fl oz water. Bring to the boil, cover and reduce to a gentle simmer. Cook for 18-20 minutes until the rice is tender and all the liquid absorbed. Season with salt, freshly ground black pepper, lemon juice, then stir in the coriander leaves.", "Spoon the mutton onto plates with a pile of rice alongside.Finish with a spoonful of yoghurt and mango chutney."]}, {"isVegetarian": false, "title": "Goan-style lobster", "url": "www_bbc_co_uk_food_recipes_goanstylelobster_91554", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz fresh coconut, shell removed, flesh finely grated", "2 dried red chillies", "2 tbsp coriander seeds", "1 tbsp black peppercorns", "4 cloves", "3 tbsp vegetable oil", "2 onions, peeled, sliced", "1 green chilli, finely chopped", "½ tsp ginger and garlic paste (made by pounding together equal quantities of fresh root ginger and garlic)", "¼ tsp ground turmeric", "50ml/2fl oz tamarind pulp", "150ml/5fl oz coconut milk", "2-3 tbsp water", "2 tbsp finely chopped fresh coriander leaves", "2 tbsp butter", "4 x 500g/1lb 2oz cooked lobsters, shells cracked and meat removed", "boiled rice or green salad"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice paste, toast the grated coconut in a dry frying pan over a medium heat for 3-4 minutes, or until lightly browned, then tip onto a plate and set aside to cool. ", "Return the pan to the heat and toast the dried chillies, coriander seeds, peppercorns and cloves for 2-3 minutes, or until lightly coloured and aromatic, then tip onto a plate and set aside to cool. ", "Transfer the toasted spices and coconut into a food processor with a few tablespoons of water (or coconut milk) and blend to a smooth paste. Set aside. ", "For the lobsters, heat two tablespoons of the vegetable oil in a wok and fry the onions and chilli for 5-6 minutes, or until coloured. Stir in the ginger and garlic paste and turmeric and fry for a further 2-3 minutes, then stir in the spice paste. ", "Add the tamarind pulp to the pan and simmer for 2-3 minutes, then pour in the coconut milk and simmer for another 8-10 minutes. Add the water to thin out the mixture slightly, then stir in the coriander leaves. ", "Heat the remaining vegetable oil in a non-stick frying pan and fry the lobster meat for 3-4 minutes, or until golden-brown all over. Add the butter to the pan and, when melted, spoon over the lobster to form a light glaze.", "To serve, spoon some of the sauce into four shallow serving bowls and divide the lobster meat equally among them. Serve with a bowl of boiled rice or green salad."]}, {"isVegetarian": false, "title": "Goat-herd pie", "url": "www_bbc_co_uk_food_recipes_goat-herd_pie_89365", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goat-herd_pie_89365_16x9.jpg", "ingredients": ["1-2 tbsp olive oil", "2 medium onions, finely chopped", "2 celery sticks, de-stringed and chopped", "125g/4½oz butternut squash, peeled and chopped", "2 garlic cloves, peeled", "½ tsp coarse sea salt", "4 anchovy fillets in oil, drained", "500g/1lb 2oz goat mince", "1 tbsp roughly chopped green olives ", "1 tbsp tomato purée", "1 tbsp plain flour", "150ml/5fl oz red wine", "150ml/5fl oz beef stock", "1 tbsp chopped rosemary", "½ tsp ground cinnamon", "salt and freshly ground black pepper", "1kg/2lb 4oz floury potatoes, such as King Edward, peeled and cut into chunks", "50g/1¾oz unsalted butter", "25g/1oz crumbly goats' cheese, crumbled ", "25g/1oz parmesan, finely grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "To make the filling, heat one tablespoon of the oil in a wide frying pan over a medium-low heat. Add the onions, celery and squash and cook gently for about 10 minutes, or until the onions begin to soften. ", "Put the garlic in a pestle and mortar with the sea salt and crush to a paste. Add the anchovies and bash to form a rough paste. Add this mixture to the pan of vegetables. Cook gently for about five minutes, stirring, so the anchovies begin to ‘melt’. Remove the contents of the pan to a bowl, leaving any oil behind. ", "Increase the heat under the pan. Add a little more oil if necessary, and half the mince. Cook, stirring, until it is browned, then add it to the vegetables. Repeat with the remaining mince then return all the meat and vegetables to the pan. ", "Add the olives. Stir in the tomato purée and flour and cook gently for 2-3 minutes. Add the wine and stock, bring to the boil then simmer for 15 minutes. ", "Add the rosemary and cinnamon and season with salt and pepper (if needed – the anchovies are already quite salty).", "Transfer the meat to an oven dish with around 1.2 litre/2 pints capacity.", "For the topping, put the potatoes in a pan, cover with water, add a little salt and bring to the boil. Simmer for 15-20 minutes, or until the potatoes are tender. Drain well, then mash them or push through a ricer back into the hot pan, and stir in the butter.", "Spread the mash over the meat in the dish. Combine the crumbled goat’s cheese and parmesan and sprinkle over the potato. ", "Bake in the preheated oven for 25-30 minutes, or until the top is golden-brown and crusty and the filling is bubbling. ", "Leave to stand for 10-15 minutes before serving."]}, {"isVegetarian": false, "title": "Goat and tomato bredie", "url": "www_bbc_co_uk_food_recipes_goat_and_tomato_bredie_87584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 peppercorns", "2 cardamom pods", "12 cloves", "2 tbsp oil ", "2 large onions, sliced", "100g/3½oz piece cooking chorizo", "140ml/4½fl oz chicken stock ", "2 cinnamon sticks", "2.5cm/1in root ginger, grated", "1 green chilli, chopped", "2 goats' leg steaks", "680g/1½ lb new potatoes, halved lengthways", "110g/4oz tomatoes, quartered ", "2 tbsp chopped fresh parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Tie up the peppercorns, cardamom pods and cloves in a muslin bag.", "In a large pan heat one tablespoon of the oil and then fry the onions until golden-brown.", "Roughly chop three-quarters of the chorizo and add to the pan.", "Add the stock and bring to the boil. Add the cinnamon, ginger, chilli and the muslin spice bag.", "Meanwhile, heat the remaining oil in a clean frying pan over a high heat. Colour the leg steaks well on all sides and then add to the stock pan. Cover with a lid and cook for 30 minutes.", "In a clean pan of boiling water par-boil the potatoes.", "Meanwhile, add the tomatoes to the meat pan and simmer for a further 15 minutes.", "Add the potatoes to the meat pan and cook for another 30 minutes, or until the meat and potatoes are cooked. ", "Meanwhile, slice the remaining chorizo into circles and fry over a medium heat until well-coloured.", "Stir the parsley into the stew and season to taste with salt and freshly ground black pepper. Serve topped with the chorizo rings."]}, {"isVegetarian": false, "title": "Goat biryani", "url": "www_bbc_co_uk_food_recipes_goat_biryani_55073", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goat_biryani_55073_16x9.jpg", "ingredients": ["500g/1lb 2oz basmati rice", "110g/3¾oz clarified butter (ghee), plus extra for greasing ", "2 cinnamon sticks", "1 tsp black peppercorns", "3 bay leaves", "3 onions, sliced", "3 garlic cloves, crushed", "4cm/1½in piece fresh root ginger, chopped", "1kg/2lb 4oz goat, boned and cubed", "2 tsp chilli powder", "2 tsp ground turmeric ", "2 tsp ground coriander", "1 tsp garam masala", "150ml/5fl oz vegetable stock or water", "400g/14oz plain yoghurt", "handful prunes", "3 green chillies, sliced lengthwise", "sea salt", "large handful coriander, to garnish", "1 red onion, thinly sliced", "handful fresh coriander (leaves and stalks), finely chopped", "¼ tsp caster sugar", "squeeze lemon juice", "vegetable oil or ghee", "8–10 free-range duck eggs", "pinch chilli flakes"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the biryani, wash and soak the rice for at least 20–30 minutes, but preferably 2 hours.", "Heat a large pan over a high heat. Add the clarified butter and, once it is sizzling, add the cinnamon sticks, peppercorns and bay leaves. Cook for a minute without burning them. Add the onions, garlic and ginger and cook for 3–4 minutes. The mixture should be dry and brown.", "Add the goat and cook for 10 minutes, until browned. If the mixture starts to stick, add a few splashes of water.", "Add the ground spices and 2 teaspoons salt and cook for 5 minutes.", "Add the stock and cook over a medium heat for 20 minutes, or until the meat is tender and the curry dry. If it isn't dry within 20 minutes, keep cooking until all the moisture has evaporated, watching it closely. ", "Remove from the heat, take off the lid and leave to cool for 30 minutes. Stir in the yoghurt and prunes.", "Meanwhile, put the rice in a large pan with a 1 litre/1¾ pint water. Cook for 10 minutes, then strain through a colander and drain under cold water.", "Grease a large, lidded deep dish with clarified butter. Layer the dish with rice, curry, then green chillies, then repeat and end with an extra layer of rice on top. Place a damp tea towel over the biryani and put the lid on. Cook over a medium heat for 25 minutes, until you get crunchy rice at the bottom of the pan. Remove the lid.", "Meanwhile for the onion salad, put the onion and coriander in a bowl.  Add the sugar and lemon juice and scrunch together using your hands, being sure to really squeeze and macerate the onions; they should look like they have reduced in size and 'cooked' in the lemon juice slightly.", "For the eggs, heat the oil in a large pan and the cook eggs until they are lacey-edged.  Sprinkle with the chilli flakes and a pinch of salt.", "Stir the biryani. Serve topped with the fried eggs and garnished with the coriander, with the onion salad on the side. "]}]