[{"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "Filete de salmón 85 g / 3 oz, piel en", "sal y pimienta negra recién molida", "85g / 3oz de arroz basmati", "½ cucharadita de cúrcuma molida", "100ml / 3½fl oz de caldo de pescado", "2 cucharadas de aceite de oliva", "1 cucharadita de puré de tomate", "1 pequeño puñado de piñones, tostado"], "method": ["Para el salmón, caliente el aceite de oliva y la mantequilla en una sartén y condimente el pescado con sal y pimienta negra recién molida. Coloque el pescado con la piel hacia abajo en la sartén y freír durante 4-5 minutos, luego voltee y cocine durante 3-4 minutos, o hasta que se dore por todas partes y cocine a su gusto. Reservar en un plato caliente.", "Para el arroz con cúrcuma, cocine el arroz de acuerdo con las instrucciones del paquete. Durante los últimos dos minutos de cocción, agregue la cúrcuma. Cuando esté cocido, esponje los granos con un tenedor.", "Para el aderezo tibio de tomate, caliente el caldo de pescado, el aceite de oliva y el puré de tomate juntos en una cacerola y bata para combinar. Llevar a fuego lento a fuego lento y reducir durante 4-5 minutos.", "Para servir, coloca el arroz en un plato y coloca el salmón encima. Rocíe el aderezo caliente alrededor de los bordes del plato y esparza los piñones sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_crispsalmonwithturme_90019", "title": "Salmón fresco con arroz con cúrcuma y salsa de tomate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla roja pequeña, pelada, finamente cortada", "½ cucharadita de orégano seco", "5 granos de pimienta negra, izquierda entera", "1½ limas, solo jugo", "½ naranja, solo jugo", "½ cucharadita de copos de sal marina", "Filetes de lubina capturados en línea de 500 g / 1 lb 2 oz, escamas y branquias", "copos de sal marina", "pizca de chile chipotle en polvo", "2 aguacates maduros, pelados, cortados por la mitad, piedras removidas", "1 lima, solo jugo, más extra para servir", "2 cucharadas de mayonesa lista para usar de buena calidad", "pequeño racimo de cilantro fresco, raíces cortadas, tallos finamente picados, hojas dejadas enteras", "1 chile verde pequeño, sin semillas, finamente picado", "copos de sal marina", "1 cucharadita de aceite de oliva", "6 tortillas de maíz blandas listas para usar"], "method": ["Para la cebolla en escabeche rosa, ponga a hervir una olla pequeña de agua. Agregue la cebolla en rodajas y deje hervir durante 25-30 segundos, luego drene bien y transfiera a un tazón grande.", "Agregue el orégano, los granos de pimienta, el jugo de lima, el jugo de naranja y la sal, luego revuelva bien para cubrir las cebollas en los jugos. Cubra y reserve por al menos una hora, o hasta que las cebollas hayan cambiado a un vibrante color rosado.", "Mientras tanto, enciende la barbacoa. Cuando las llamas se hayan apagado y los carbones se hayan tornado de color ceniza, la barbacoa estará lista (esto tomará aproximadamente 30 minutos).", "Para la lubina, enjuague los filetes de lubina en agua fría, luego séquelos con papel de cocina.", "Sazonar la piel de los filetes de lubina con la sal y el chile chipotle en polvo. Cuando la barbacoa esté lista, coloque los filetes de lubina, con la piel hacia abajo, sobre la parrilla, y cocínelos durante 4-5 minutos, o hasta que la piel esté crujiente y dorada, y un poco más de la mitad de la carne esté bien cocida.", "Voltee los filetes de lubina con cuidado y cocine por no más de 10 segundos, o hasta que la parte exterior de los filetes esté recién hecha. Transfiera los filetes de lubina a un plato, con la piel hacia arriba. Apartar y mantener caliente. Justo antes de servir, desmenuce la carne de la lubina con un tenedor.", "Mientras tanto, para el guacamole, mezcle la carne de aguacate en un procesador de alimentos hasta que quede suave. Agregue el jugo de lima, mayonesa, tallos de cilantro picado, hojas de cilantro y chile y mezcle de nuevo hasta que esté suave y bien combinado. Sazonar, al gusto, con sal y mezclar de nuevo hasta que quede suave. Vierta la mezcla en un tazón para servir y deje enfriar en el refrigerador hasta que sea necesario.", "Para las tortillas, cepille una sartén con aceite y caliente a fuego alto hasta que el aceite esté humeando. Caliente cada tortilla, una a la vez, en ambos lados, durante 15-20 segundos, o hasta que estén suaves, flexibles y calientes.", "Para servir, coloque una tortilla en el centro de cada uno de los seis platos pequeños. Ponga una cucharada de guacamole en el centro de cada tortilla, luego ponga un poco de la copos de mar y la piel sobre el guacamole. Cubra con las cebollas en vinagre rosa y un chorrito de jugo de lima, luego enrolle las tortillas en forma de cigarro o dóblelas en forma de U."], "url": "www_bbc_co_uk_food_recipes_crispseabasstortilla_91746", "title": "Crujientes tortillas de lubina con cebolla en escabeche rosa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 6 tortillas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispseabasstortilla_91746_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos de pollo (con hueso y piel)", "500ml / 18fl oz de caldo de verduras", "5g de polvo seco de cep", "1 cucharada de perejil picado", "Papas Desirée 900g / 2lb, peladas", "sal y pimienta", "1 cucharada de estragón picado", "1 cucharada de perejil de flatillo picado", "75g / 2½ oz de harina común (esto puede ser más o menos dependiendo de sus papas)", "glug de aceite de oliva", "20g / ½oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "1 chalote, picado", "2 dientes de ajo picados", "200 g / 7 oz de champiñones castaños, en rodajas", "15 g / ½ oz de colmenillas secas, empapadas y escurridas", "28 g / 1 oz de ceps secos, empapados y escurridos", "150 g / 5½ oz de crema", "sal y pimienta"], "method": ["Para el pollo crujiente, retire el hueso de cada muslo de pollo y perfore la piel con un cuchillo. Caliente el caldo en una sartén honda. Agregue los muslos con la piel hacia abajo y cubra con un cartucho (una ronda de papel resistente a la grasa con un agujero en el medio para permitir que escape el vapor). Cueza los muslos durante cinco minutos, luego retire el pollo de la sartén, coloque un plato y coloque otro plato en la parte superior para pesarlos. Deje que se enfríe en el refrigerador mientras prepara el gnocchi y la salsa. Reserve el caldo de verduras para usar en la salsa de champiñones.", "Para hacer los gnocchi, cocine las papas en una sartén con la menor cantidad de agua posible hasta que estén tiernas. Escurra y machaque o arroz las papas cuando aún estén tibias.", "Ponga el puré en una superficie de trabajo, sazone con sal y pimienta y agregue las hierbas. Lentamente agregue la harina en tandas, amasando suavemente doblando los bordes de la masa en el centro y presionando ligeramente hacia abajo antes de rociar en cada adición adicional de harina, hasta que la masa esté suave. No trabajes demasiado la masa o estropearás la estructura y los gnocchi serán polvorientos por fuera y carnosos por dentro.", "Enrolla la masa en una salchicha del tamaño de un Frankfurter. Corta la salchicha en trozos de 3cm / 1¼ en pedazos.", "Presione cada trozo de masa contra la parte posterior de un tenedor para que se curve ligeramente y las puntas dejen huellas (lo que ayudará a los ñoquis a sostener la salsa).", "Llevar a ebullición una sartén grande de agua salada. Agregue el aceite de oliva y vierta en el gnocchi. Cocine por un minuto, o hasta que el gnocchi salga a la superficie. Retira de la sartén, sumérgete en un tazón de agua helada y escúrrelo.", "Para la salsa de champiñones, caliente la mantequilla y la aceituna juntas en una sartén hasta que se derritan. Cocine rápidamente la chalota y el ajo hasta que se ablanden. Agregue todos los champiñones a la sartén junto con algo del líquido de caza furtiva reservado. Cocine durante cinco minutos, luego retire del fuego y agregue la crema fresca. Transfiera a un procesador de alimentos y mezcle hasta que quede suave. Controle el condimento y agregue sal y pimienta según sea necesario. Ponga a un lado hasta que esté listo para servir.", "Justo antes de servir, corte ocho cuadrados de papel resistente a las grasas (lo suficientemente grande como para cubrir los muslos de pollo). Espolvoree cada pedazo de papel con polvo de cep. Coloque cada pedazo de pollo con la piel hacia abajo sobre un cuadrado de papel resistente a la grasa. Sazonar con sal y pimienta, luego cubrir con una segunda pieza de papel a prueba de grasa y doblar los bordes de los dos cuadrados de papel para hacer un paquete. Coloque cada paquete de pollo en una sartén y con un peso en la parte superior. Coloque a fuego medio hasta que la piel del pollo se fríe y la carne esté bien cocida. Retire del papel y enrolle el pollo en el perejil picado.", "Para servir, devuelva la salsa a la sartén para que se caliente y remueva a través de los gnocchi escurridos. Cortar el pollo en rodajas y servir con los gnocchi y la salsa."], "url": "www_bbc_co_uk_food_recipes_crispy-skinned_chicken_21035", "title": "Pollo de piel crujiente, gnocchi con hierbas y salsa de champiñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva virgen extra", "400 g de tomates picados, preferiblemente San Marzano", "2 dientes de ajo, picados", "1 cucharadita de orégano seco", "1 gran puñado de hojas frescas de albahaca, aproximadamente picadas", "sal y pimienta negra recién molida", "25g / 1oz de queso parmesano (o queso vegetariano vegetariano alternativo), rallado", "100g / 3½oz de pan rallado", "2 berenjenas, con tapas largas y con cola y en rodajas", "2 bolas de mozzarella en rodajas", "Harina normal de 100 g / 3½ oz", "2 huevos, golpeados", "aceite vegetal, para freír"], "method": ["Para la salsa de tomate, caliente una sartén a fuego medio-alto y agregue el aceite de oliva, los tomates, el ajo y el orégano seco. Cocine a fuego lento durante 3-4 minutos, o hasta que los tomates comiencen a descomponerse. Agregue la albahaca y sazone, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Mezcle el parmesano con las migas de pan. Cubra la berenjena y la mozzarella en harina, sumerja en el huevo batido y revuelva en las migas de pan.", "Caliente el aceite vegetal en una sartén grande, una vez caliente, agregue la berenjena y la mozzarella en tandas y fríe en cada lado durante 2-3 minutos hasta que estén crujientes.", "Coloque la berenjena y la mozzarella en los platos y espolvoree la salsa."], "url": "www_bbc_co_uk_food_recipes_crispy_aubergine_and_11471", "title": "Berenjena crujiente y mozzarella con salsa de tomate clásica", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fideos de vidrio de 55 g / 2 oz", "225 g de pechuga de pollo sin piel, cortada en tiras finas", "2 cucharaditas de aceite de oliva", "1 cucharada de cebollas de primavera finamente picadas", "2 cucharadas de cebollines frescos finamente picados", "2 cucharaditas de cilantro fresco finamente picado", "2 cucharadas de tomates secados al sol finamente picados", "3 cucharadas de harina común", "3 cucharadas de agua", "300 ml / 10 fl oz de aceite de maní", "1 paquete 22cm / 8in banh trang envolturas de papel de arroz", "1 lechuga iceberg, hojas separadas en tazas", "2 cucharadas de hojas de albahaca fresca, desgarrada", "2 cucharadas de ramitas de cilantro, hojas dejadas enteras", "sal y pimienta recién molida"], "method": ["Remoje los fideos en agua tibia durante unos 15 minutos, o hasta que estén suaves. Escurrir en un colador y cortarlos en tres partes. Exprime el exceso de humedad en una toalla de té limpia.", "Mientras tanto, mezcle el pollo con un poco de sal y pimienta, el aceite de oliva, las cebolletas, el cebollino, el cilantro y los tomates secados al sol en un tazón. Agregue los fideos y mezcle bien.", "Haga una pasta mezclando la harina y el agua.", "Cuando esté listo para hacer los rollos, llene un tazón grande con agua tibia. Sumerja una envoltura de papel de arroz en el agua y déjela ablandar durante 1 minuto. Retire y drene una toalla de té limpia.", "Coloque una cucharada grande del relleno en el medio de la envoltura y pase el borde inferior sobre el relleno, pliegue ambos lados del papel de arroz y continúe rodando hasta el final. Selle el final con un poco de la mezcla de pasta de harina. El rollo debe ser compacto y apretado, aproximadamente 7,5 cm / 3 in. Coloque en un plato limpio y continúe el proceso hasta que haya agotado todo el llenado.", "Caliente el aceite en un wok o en una sartén grande a fuego alto hasta el punto de ahumado. Baje el fuego a medio y fría los panecillos unos pocos a la vez, hasta que estén dorados. Tienen una tendencia a pegarse entre sí, por lo que solo freír unos pocos a la vez. No intente separarlos si se mantienen unidos, puede hacerlo después de haberlos extraído del aceite. Escurra cada lote en papel de cocina.", "Sirva con tazas de lechuga iceberg, albahaca fresca y ramitas de cilantro."], "url": "www_bbc_co_uk_food_recipes_crispy_chicken_and_40136", "title": "Rollos de primavera de pollo crujiente y secado al sol", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 35-40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60g / 2¼oz de sal marina", "1 chili rojo seco pequeño", "2 dientes de ajo, aplastados", "4 muslos de pollo grandes, deshuesados, con piel", "1 cucharada de aceite vegetal", "1 bulbo de ajo", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza Dijon", "pocas hebras de azafrán", "150ml / 5fl oz de aceite de colza", "150ml / 5fl oz de aceite de oliva virgen extra", "½ limón, solo jugo", "sal y pimienta negra recién molida", "2 aguacates, pelados, cortados a la mitad, removidos de piedra y cortados en rodajas de 2cm / 1 in", "1 huevo de gallinas camperas, golpeado", "50g / 1¾oz de harina natural", "50g / 1¾oz de panko breadcrumbs", "aceite vegetal para freír", "sal marina copos", "8 espárragos de lanzas, recortados, extremos pelados", "4 salchichas de chorizo ​​de cocina, sin piel", "100g / 3½ oz de barba de monje, sin tallos.", "1 cabeza de ensalada de diente de león, cortada y lavada", "salpicaduras de vinagre de jerez"], "method": ["Para el pollo, coloque la sal, el chile y el ajo en una olla grande con 1 litro / 1¾ pintas de agua y deje que hierva. Retirar del fuego y enfriar, luego agregar los muslos de pollo, tapar y colocar en la nevera durante 2 horas.", "Para el alioli, precaliente el horno a 180C / 160C Fan / Gas 4, envuelva el bulbo de ajo en papel de aluminio y tueste durante 30 minutos. Cuando esté asado, exprima el ajo de sus pieles y añádalo a un pequeño procesador de alimentos junto con las yemas de huevo, la mostaza y el azafrán y licúe. Luego, agregue lentamente los aceites para hacer una emulsión y sazone con el jugo de limón, sal y pimienta.", "Retire el pollo de la salmuera y seque con papel de cocina. Caliente el aceite en una sartén antiadherente grande y cocine el pollo con la piel hacia abajo a fuego medio. Cubra con un círculo de papel resistente a la grasa y coloque una olla vacía en la parte superior como un peso durante 5 minutos. Voltee el pollo y cocine por otros 5 minutos sin papel ni peso. Dé vuelta y cocine por otros 5 minutos hasta que la piel esté dorada y crujiente. (El pollo se cuece cuando los jugos se vuelven transparentes sin ningún rastro de rosa cuando la parte más gruesa del muslo se perfora con un pincho). Reserve.", "Mientras tanto, para los espárragos a la parrilla y el chorizo, tueste las salchichas de chorizo ​​en el horno precalentado durante 10 minutos, luego déjelas a un lado, reservando el aceite.", "Escalde los espárragos en agua hirviendo con sal durante 1 minuto, luego reviértelos en agua fría y escúrralos.", "Caliente una sartén a fuego alto y cocine los espárragos y el chorizo ​​por 2-3 minutos, volteándolos para asegurarse de que estén carbonizados por todos lados.", "Para el aguacate, coloque el huevo batido, la harina y las migas de pan en tres cuencos separados y sumerja cada rodaja primero en la harina, luego el huevo y luego el pan rallado. Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido Fríe el aguacate por 1-2 minutos, hasta que esté crujiente y dorado. Escurrir sobre papel de cocina y sazonar con sal marina en copos.", "Para la ensalada, blanquee la barba del monje y el diente de león en agua hirviendo con sal durante 30 segundos, luego escurra y coloque en un recipiente. Agregue un poco de vinagre de jerez y algo del aceite de chorizo ​​reservado y mezcle para combinar.", "Para servir, divida la barba y el diente de león del monje entre cuatro platos para servir y cubra con el pollo, el aguacate, los espárragos y el chorizo, con el alioli en un lado."], "url": "www_bbc_co_uk_food_recipes_crispy_chicken_thighs_89521", "title": "Muslos de pollo crujiente con aguacate, espárragos a la brasa, chorizo ​​y alioli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150 g / 5½ oz de muslos de pollo en el hueso", "200 ml / 7 fl oz de salsa de chile dulce", "Harina normal 150g / 5½ oz", "1 cucharadita de polvo de hornear", "1 cucharadita de pimienta de cayena", "1 cucharadita de cebolla en polvo", "1 cucharadita de ajo en polvo", "1 cucharadita de sal", "150ml / 5fl oz de aceite vegetal, para freír", "2 cucharaditas de ajo en polvo", "1½ cucharadita de pimentón", "gran pizca de sal", "2 patatas dulces grandes (aproximadamente 800 g / 1 libra 12 onzas), cortadas en cuñas", "2 cucharadas de aceite de oliva", "2 x 400 g de alubias cocidas al horno", "1 cucharadita de pimentón ahumado", "2 cucharadas de salsa marrón"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4 y alinee una bandeja de horno con papel de hornear.", "Para hacer el pollo, ponga a hervir una olla grande de agua con sal, agregue el pollo, cubra con una tapa y hierva por 15 minutos. Retire las piezas de pollo del agua y colóquelas en papel de cocina para drenar.", "Pon el pollo en un bol con la salsa de chile dulce. Mezcle bien y deje reposar.", "Coloque la harina, el polvo de hornear, la pimienta de cayena, el polvo de cebolla, el ajo en polvo y la sal en un plato y mezcle. Sumerja cada trozo de pollo en la mezcla de especias secas, cúbralo bien y déjelo a un lado en otro plato.", "Caliente el aceite en una sartén antiadherente a fuego medio. Agregue el pollo y fría por 3 minutos en cada lado, hasta que se dore. Coloque en la bandeja de horno forrada y reserve.", "Para hacer las rodajas de batata, combine el ajo en polvo, el pimentón y la sal en un tazón pequeño. Coloque las rodajas de batata en una bandeja grande para hornear, luego cúbralas con la mezcla de ajo, rocíe con el aceite y mezcle bien para cubrir.", "Hornee el pollo y la batata, con las batatas en el estante superior, durante 25-30 minutos, o hasta que el pollo esté cocido y las cuñas estén tiernas.", "Mientras tanto, mezcle los frijoles, el pimentón ahumado y la salsa marrón en una cacerola pequeña y caliente a fuego lento. Sirve todo junto"], "url": "www_bbc_co_uk_food_recipes_crispy_chicken_with_12063", "title": "Pollo crujiente con batatas fritas y alubias", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_chicken_with_12063_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Rabadilla de carne de 300g / 10½oz", "aceite vegetal, para freír", "3-4 cucharadas de harina de maíz, para el recubrimiento", "pizca de copos de chile", "grandes pizcas semillas de sésamo tostadas", "flores de viola, disponibles en línea (opcional), para adornar", "2 cucharaditas de salsa de soja ligera", "1 cucharadita de vino de arroz Shaoxing", "olla vieja", "1 g de polvo de hornear", "50g / 1¾oz de zanahoria, cortada en tiras muy finas", "180ml / 6fl oz de vinagre rojo chino", "4 cucharadas de salsa de soja ligera", "1 cucharada de aceite de chile", "1 cucharadita de azúcar", "1 cucharadita de aceite de sésamo", "1 cucharadita de hojuelas de chile", "8g de chile rojo en escabeche, picado", "1 cucharadita de polvo chino de cinco especias", "½ cucharadita de sal", "Azúcar 250 g / 9 oz", "5 cucharadas de vinagre de vino tinto chino", "5 cucharadas de vinagre de malta", "1 estrella de anís", "Harina normal de 250g / 9oz", "50g / 1¾oz de harina de tapioca", "½ cucharadita de polvo de hornear", "½ cucharadita de goma xantana", "agua mineral con gas, refrigerado"], "method": ["Pon% 20the% 20beef% 20in% 20the% 20freezer% 20for% 20around% 201% C2% BD% 20hours% 20until% 20it% 20is% 20about% 2070 %% 20frozen.", "Para el adobo, mezcle todos los ingredientes en un tazón grande con 50 ml / 2 fl oz de agua.", "Con un cuchillo afilado, corta la carne parcialmente congelada en bastones de 7cmx5mm / 2¾x⅛in. Agregue los bastones de carne al adobo, cúbralo y déjelo marinar en la nevera durante 2 horas.", "Para la zanahoria en escabeche, coloque la zanahoria en un recipiente hermético esterilizado. Calentar todos los ingredientes restantes en una sartén no reactiva y llevar a fuego lento a fuego lento. Vierta sobre las tiras de zanahoria y deje enfriar. Sella el contenedor. (Se mantendrá durante varios meses si se almacena en un lugar fresco y seco).", "Para la sal china de cinco especias, mezcle el polvo y la sal y combine a fondo.", "Para la salsa, combine todos los ingredientes y 400ml / 14fl de agua en una sartén y cocine hasta que la mezcla se haya reducido a la consistencia de la miel.", "Para la mezcla, combine los ingredientes secos en un tazón, luego mezcle suficiente agua con gas hasta que tenga una pasta ligera", "Cuando la carne esté lista, caliente el aceite vegetal en una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Retire la carne del adobo, cubra la carne con harina de maíz y sumerja los bastones individualmente en la mezcla antes de freír hasta que estén crujientes (la capa de rebozado frito debe tener orificios en miniatura en lugar de ser una cáscara sólida). Retirar del aceite y escurrir sobre papel de cocina.", "Agregue la carne a la salsa, sazone con una pizca de hojuelas de chile, sal china de cinco especias y semillas de sésamo. Cubra con algunas zanahorias en vinagre, adorne con flores de viola, si las usa, y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crispy_chilli_beef_88136", "title": "Carne de chiles crujientes", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9 oz de buena calidad patatas fritas saladas", "100 g / 3½ oz de mantequilla", "4 cucharadas de jarabe de oro", "225g / 8oz de mantequilla, cortada en cubos", "375g / 13oz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids),% 20chopped", "3 huevos de gallinas camperas, más 3 yemas", "150 g / 5½ oz de azúcar en polvo", "125g / 4½oz de cacahuetes tostados y salados, más o menos picados"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase una lata agria de 23 cm / 9 pulg., De fondo suelto y bastante profunda.", "Para la base, triture las patatas fritas en migajas en una bolsa de plástico sellada con un rodillo o utilice un procesador de alimentos. Derrita la mantequilla con el sirope dorado en una sartén. Agregue las migas crujientes para unir.", "Presione la mezcla crujiente uniformemente en la base y los lados de la lata de tarta. Cubra la lata con papel de hornear antiadherente y rellene con alubias para hornear. Ponlo en una bandeja de horno y hornea por 10 minutos. Retire los frijoles para hornear y el pergamino y déjelos a un lado para que se enfríen.", "Mientras tanto, para cubrir, derrita la mantequilla y el chocolate en un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento (asegúrese de que el fondo del recipiente no toque el agua), revolviendo de vez en cuando hasta que esté completamente derretido y brillante. Retirar del fuego y dejar enfriar un poco.", "Batir los huevos, las yemas y el azúcar en un tazón grande con un batidor eléctrico durante 3-4 minutos, hasta que estén pálidos y espesos. Batir el chocolate derretido en la mezcla de huevo, hasta que esté completamente incorporado. Agregue un poco más de la mitad de los cacahuetes.", "Vierta la mezcla de chocolate en la base crujiente y espolvoree los cacahuetes restantes sobre la parte superior. Hornee durante 20-25 minutos, o hasta que estén casi listos, pero aún con un leve bamboleo. Si la tarta todavía está tambaleante, hornea por otros 5 minutos. Dejar enfriar completamente en la lata sobre una rejilla, luego enfriar en la nevera durante al menos 4 horas.", "Retire con cuidado de la lata, corte y sirva. Delicioso con un poco de helado de vainilla en el lateral."], "url": "www_bbc_co_uk_food_recipes_crispy_chocolate_and_87547", "title": "Tarta de cacahuete crujiente, chocolate y salado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_chocolate_and_87547_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de girasol, para freír", "Filete rib-eye de 400g / 14oz, cortado en tiras finas", "2 cucharadas de aceite vegetal", "1 cucharada de granos de pimienta de Sichuan", "2 limas, solo cáscara", "1 naranja, solo ralladura", "3 cucharadas colmadas de harina de maíz, harina de arroz o almidón de papa", "150 g / 5½ oz de azúcar en polvo", "150ml / 5fl oz vino de arroz Shaoxing", "Vinagre de vino de arroz de 25ml / ¾fl oz", "1½ chiles rojos, finamente picados", "2 cucharaditas de copos de chile seco", "Jengibre fresco de raíz de 10cm / 4in, finamente picado", "2 tallos de limoncillo, hojas externas eliminadas, luego finamente picadas", "4 hojas de lima finamente picadas", "1 cucharada de aceite vegetal", "Jengibre fresco de 10cm / 4 en pieza, en juliana", "4 dientes de ajo, finamente picados", "6 cebollas de primavera, cortadas, finamente cortadas", "Fideos de arroz fino de 250 g / 9 oz, cocidos de acuerdo con las instrucciones del paquete, escurridos y refrescados en agua fría y escurridos nuevamente", "3 cucharadas de aceite de sésamo", "2 cucharadas de salsa de soja", "2 cucharadas de vinagre de vino de arroz", "½ limón, solo jugo", "2 cucharadas de semillas de sésamo", "4 cucharadas de cilantro fresco picado", "brócoli cocido al vapor"], "method": ["Para la carne de res, caliente una freidora a 190 ° C o caliente el aceite para freír en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle las tiras de carne en el aceite vegetal. En una maja y mortero, triture los granos de pimienta de Sichuan en un polvo fino. Colóquelos en un tazón grande con la ralladura de lima, naranja y harina de maíz y mezcle bien. Agregue la carne y revuelva para cubrir cada pieza completamente.", "En lotes, vierta la carne en la freidora y cocine durante 2 minutos. Escurrir en un plato forrado con papel de cocina.", "Para la salsa, calentar una sartén o wok hasta que esté caliente, agregar el azúcar, el vino de arroz y el vinagre de vino de arroz y llevar a ebullición. Agregue los chiles, las hojuelas de chile, el jengibre, el limoncillo y las hojas de lima y luego cocine por 5-8 minutos hasta que se espese, se vea pegajoso y brillante.", "Agregue la carne frita a la salsa, quite del fuego y mezcle bien para que toda la carne esté cubierta con la salsa pegajosa.", "Para los fideos, caliente el aceite vegetal en un wok a fuego alto. Cuando el aceite esté humeando, agregue el jengibre, el ajo y las cebollas tiernas y saltee durante 2-3 minutos, o hasta que se ablanden. Agregue los fideos cocidos y saltee por otro minuto, o hasta que estén bien calientes. Agregue el aceite de sésamo, la salsa de soja, el vinagre de vino de arroz y el jugo de limón y mezcle bien para combinar. Agregue las semillas de sésamo y sofría por 1-2 minutos más. Espolvorea sobre el cilantro y revuelve bien para combinar.", "Para servir, divida los fideos entre los tazones para servir y la parte superior con la carne de chile. Coloque el brócoli en un recipiente para servir por separado."], "url": "www_bbc_co_uk_food_recipes_crispy_chilli_beef_with_40462", "title": "Carne de chiles crujientes con fideos y brócoli al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["24 gambas crudas, peladas, colas encendidas (alrededor de 600 g / 1 libra de langostinos crudos congelados de 5oz)", "Harina normal 175g / 6oz", "1½ cucharadita de polvo de hornear", "1 huevo mediano, golpeado", "150ml / 5fl oz de agua helada", "Pan rallado panko de 60 g / 2¼ oz", "60g / 2¼oz de coco desecado sin azúcar", "600ml / 200fl oz de aceite de maíz, para freír", "sal y pimienta negra recién molida", "1 papaya grande, piel y semillas retiradas, más o menos picadas", "½-1 chili habanero, tallo y semillas removidos, toscamente picados", "1 chalote de plátano, aproximadamente picado", "1 diente de ajo, reducido a la mitad", "3 cucharadas de vinagre de sidra", "2 rodajas finas de jengibre fresco, sin piel", "1 lima, solo jugo", "1 naranja, solo jugo", "1 cucharada de azúcar morena suave", "1 pimienta de Jamaica grande pizca", "½ cucharadita de sal"], "method": ["Para hacer la salsa de inmersión, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que quede suave. Verter en una cacerola y llevar a ebullición. Reduzca a fuego lento y cocine suavemente a fuego lento durante 5 minutos. Si la salsa se vuelve demasiado espesa, agregue algunas cucharadas de agua hirviendo.", "Para hacer la mezcla, tamice 125 g / 4½ oz de harina común, el polvo de hornear y pellizque la sal en un tazón. Haz un pozo en el centro y rompe el huevo. Traiga la harina de los lados para hacer una pasta y luego mezcle con el agua fría para hacer una mezcla suave.", "Alinee una bandeja para hornear con papel resistente a la grasa y llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Incline los 50g / 1¾oz de harina restantes en un recipiente poco profundo y sazone generosamente con sal y pimienta. Mezcle las migas de pan y el coco en un tazón aparte.", "Cubra cada gamba en la harina, sacudiendo cualquier exceso, luego sosteniéndolo por la cola, sumérjalo en la masa. Sácalo y deja que el exceso de masa gotee de vuelta al recipiente. Enrolla la gamba en las migas de coco, presionando hacia abajo para que la mezcla se pegue. Ponga el camarón en la bandeja preparada y repita hasta que todos estén cubiertos, dejando espacio entre cada uno.", "Freír las gambas en lotes por 1 o 2 minutos hasta que estén doradas y crujientes. Escurrir sobre papel de cocina.", "Sirva inmediatamente con la salsa de papaya."], "url": "www_bbc_co_uk_food_recipes_crispy_coconut_prawns_83642", "title": "Gambas de coco fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve de 4 a 6 como iniciador", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_coconut_prawns_83642_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas grandes de pato", "½ sandía fría, sin piel, carne picada", "1 granada fresca, solo semillas", "½ manojo de menta fresca, hojas recogidas y aproximadamente desgarradas", "gran cilantro racimo, hojas recogidas y tallos picados", "1-2 chiles rojos (al gusto)", "2 cucharadas de salsa de soja oscura", "2 cucharadas de salsa de pescado tailandesa", "2 limas, solo jugo", "½ cucharadita de pimienta Sichuan molida"], "method": ["Precalentar el horno a 160 ° C / 350 ° F / Gas 4.", "Coloque una rejilla de alambre en una lata de asar y coloque las patas de pato en la parte superior, con la piel hacia arriba. Ase las patas de pato en la parrilla durante 1¾-2 horas, o hasta que la piel esté crujiente y la carne esté cocida (cuando el pato esté cocido, los jugos se deben aclarar cuando se inserta un pincho en la parte más gruesa de la pierna) . Dejar enfriar durante 10-15 minutos, reservando la grasa de pato en la bandeja de horno.", "En un tazón grande, mezcle las sandías picadas y las semillas de granada. Mezcle las hojas de menta, el cilantro y los chiles en rodajas, al gusto.", "Cuando las patas de pato se hayan enfriado, desmenuce la carne del hueso y agréguela a la mezcla de sandía y granada. Agregue la salsa de soja, la salsa de pescado, el jugo de lima y un poco de la grasa de pato reservada, a gusto, si lo desea. Sazone con pimienta de Sichuan y mezcle suavemente.", "Sirva la ensalada de inmediato, mientras que la sandía está fría y la carne de pato aún caliente."], "url": "www_bbc_co_uk_food_recipes_crispy_duck_salad_03934", "title": "Ensalada de pato crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_duck_salad_03934_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal, más extra para freír", "4 pechugas de pato, con guarnición de grasa", "2 berenjenas, cortadas en cubitos", "180 ml / 6 fl oz oz blanco o oscuro", "160g / 5¾oz de azúcar en polvo", "50g / 1¾oz de miel clara", "Castillo de 50g / 1ozo kale", "100 g / 3½ oz de frijoles edamame, para servir", "4 cucharadas de semillas de sésamo blanco, para servir", "4 cucharadas de semillas de sésamo negro, para servir", "2 cucharadas de micro berros mezclados, para servir"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 5. Caliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para el pato, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue las pechugas de pato y cocine con la piel hacia abajo durante 3-4 minutos. Dar la vuelta al pato y colocar en el horno durante 6-8 minutos, dependiendo del tamaño de la pechuga de pato, hasta que esté cocido.", "Retire el pato del horno y, usando un tenedor grande para carne, sostenga un pecho sobre la freidora. Con un cucharón, vierta el aceite caliente sobre la piel de pato durante 1-2 minutos, o hasta que esté dorado y crujiente. (PRECAUCIÓN: el aceite caliente puede ser peligroso. Tenga cuidado al verter el aceite sobre el pato.) Reserve, cubra con papel de aluminio, para que descanse. Repita con las pechugas de pato restantes.", "Caliente una freidora a 180 ° C. Fríe la berenjena por 2-3 minutos o hasta que esté dorada y crujiente. Poner a un lado para drenar en papel de cocina.", "Agregue el miso blanco, el azúcar, la miel y 100 ml / 3½ fl oz de agua en una cacerola. A fuego medio, cocine hasta que se reduzca su volumen y se ponga dorado.", "Para servir, ponga a hervir un sartén de agua con sal y escaldee la col rizada durante 1-2 minutos. Escurrir y colocar en platos para servir. Corta los pechos de pato descansados. Coloque la berenjena en los platos y vierta sobre la salsa. Coloque el pato alrededor de los platos y adorne con los frijoles edamame, semillas de sésamo y micro berros."], "url": "www_bbc_co_uk_food_recipes_crispy_duck_breast_with_14444", "title": "Pechuga de pato crujiente con miso berenjena glaseada y frijoles edamame", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "25g / 1oz de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado en cubitos", "1 tallo de limoncillo, hojas externas eliminadas y finamente cortadas", "300g / 10½oz de arroz basmati", "450 ml / 16 fl oz de verduras o caldo de pollo", "1 lima, ralladura y jugo", "3 cucharadas de hojas frescas de cilantro, picadas", "sal y pimienta negra recién molida", "Filetes de filete 4 x 250 g / 9 oz", "1 cucharada de aceite vegetal", "8 cucharadas de harina de patata", "1 cucharadita de anís estrellado molido", "2 cucharadas de aceite de oliva light", "Vinagre de vino de arroz 150ml / 5fl oz", "150 g / 5½ oz de azúcar en polvo", "4 cucharadas de salsa de soja tamari", "2 cucharaditas de copos de chile seco", "Jengibre fresco de 10cm / 4in, pelado y finamente rallado"], "method": ["Para el pilau, caliente una sartén o una sartén hasta que esté medio caliente, agregue el aceite y la mantequilla y cocine suavemente la cebolla, el ajo y la hierba de limón durante unos dos minutos, o hasta que se ablanden.", "Agregue el arroz y cocine por un minuto, revolviendo todo el tiempo, luego agregue el caldo y cocine a fuego lento.", "Reduzca el fuego y cubra con una tapa, luego cocine a fuego lento durante 15 minutos o hasta que el caldo se haya absorbido y el arroz esté tierno.", "Agregue la ralladura de lima, el jugo y el cilantro y sazone al gusto con sal y pimienta negra recién molida.", "Mientras tanto, frota los filetes con el aceite vegetal. Mezcle la harina de patata y el anís estrellado y espolvoree los filetes, presionando la harina sobre la carne para cubrirla por completo.", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva, luego fríe los filetes durante 2-3 minutos en cada lado. Retire los filetes de la sartén y déjelos reposar durante 2 o 3 minutos.", "Coloque el vinagre de vino de arroz y el azúcar impalpable en una sartén por separado y cocine a fuego lento. Agregue la soja, el chile y el jengibre y cocine a fuego lento durante 4-5 minutos, o hasta que la salsa esté espesa y ligeramente pegajosa.", "Para servir, cuchara un poco de arroz pilau en cada plato. Tallar la carne en rodajas gruesas, colocar sobre el pilau y luego verter la salsa de chile pegajoso sobre el bistec."], "url": "www_bbc_co_uk_food_recipes_crispy_fillet_steak_with_08366", "title": "Filete de solomillo crujiente con salsa de chile y limón pila de limoncillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 tartas comiendo manzanas (como Granny Smith), peladas, sin corazón y cortadas en trozos de 1cm / ½ en trocitos", "1 pera perfectamente madura, pelada, sin corazón y cortada en trozos de 1cm / ½ en", "100g / 3½oz de uva", "100ml / 3½fl oz de jugo de manzana", "75g / 2¾oz de arándanos secos", "50g / 1¾oz nueces de pacana, finamente picadas", "2 cucharaditas de jengibre molido", "2 cucharaditas de canela molida", "pellizcar clavos de tierra", "gran pizca de nuez moscada recién rallada", "1 vaina de vainilla, semillas raspadas", "1 naranja, solo ralladura, finamente rallado", "1 cm / ½ en pieza de jengibre fresco, muy finamente picado", "algunos giros agrietados pimienta negra", "3 cucharadas de sidra, calvados, ron o brandy (opcional)", "aceite vegetal, en una botella de spray", "12 hojas de pasta filo", "1 huevo, ligeramente batido (alternativamente, use un poco de mantequilla derretida o aceite vegetal)", "azúcar glas para quitar el polvo (opcional)", "200 g / 7 oz yogur griego bajo en grasa (opcional)", "50g / 1¾oz de azúcar glas, tamizado", "1 vaina de vainilla, semillas raspadas o 1 cucharadita de extracto de vainilla"], "method": ["Precaliente el horno a 180 ° C / 160 ° C (ventilador) / 350 ° F / Gas 4. Coloque una bandeja para hornear en el horno para calentar. (Esto dará calor extra de fondo a los pasteles para que las bases se cocinen y no estén empapados.) Engrase un molde para moldes de 12 hoyos con un poco de aceite en aerosol y déjelo a un lado.", "Coloque todos los ingredientes de la carne picada en una cacerola a fuego medio. Deje que se cocine suavemente, revolviendo ocasionalmente, durante aproximadamente 10 minutos o hasta que las manzanas comiencen a ablandarse. Luego retíralo del fuego y deja la mezcla para infundir mientras preparas los pasteles.", "Coloque las hojas de masa de filo una encima de la otra y córtelas por la mitad en el ancho. Luego corte cada mitad por la mitad otra vez para dar cuatro pilas de aproximadamente 12cm / 4½ en cuadrados de filo. Encuentro las tijeras realmente útiles para cortarlas, pero un cuchillo afilado servirá. Mantenga cualquier filo sin que se trabaje debajo de una toalla de té húmeda para que no se seque.", "Alinee cada hoyo del mollete con tres cuadrados de filo. Me gusta tomar un cuadrado a la vez y presionarlo en el agujero, cada uno ligeramente escalonado respecto al anterior, por lo que el borde resultante de la caja de pasteles se ve como una estrella. Asegúrese de empujar la masa hacia abajo para que quede en las \"esquinas\" de cada hojaldre.", "Después de forrar la lata, deberías quedarte con 12 cuadrados de filo. Que puedes reservar debajo de una toalla húmeda por ahora.", "Rocíe cada pila en la lata con un poco de aceite y hornee en el horno durante cinco minutos hasta que estén dorados y crujientes. Luego, divida el relleno de manera uniforme entre los casos.", "Luego tome los cuadrados restantes de filo, aplástelos ligeramente y coloque uno encima de cada pastel para que se vea como un pañuelo arrugado. Cepíllalas ligeramente con huevo batido o mantequilla derretida.", "Pop en el horno sobre la bandeja para hornear caliente durante 8-10 minutos o hasta que los pasteles estén crujientes y dorados.", "Mientras tanto, prepara el yogurt para servir. Mezcle suavemente el yogur, el azúcar glas y las semillas de vainilla o el extracto en un tazón. Cubra y reserve en el refrigerador hasta que esté listo para usar.", "Una vez que esté listo, retire los pasteles del horno, espolvoree con un poco de azúcar glas y sirva con una cucharada de yogur, si lo desea."], "url": "www_bbc_co_uk_food_recipes_crispy_filo_mince_pies_63765", "title": "Pasteles crujientes de filo picados con carne picada de pera y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 tartas de carne picada", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_filo_mince_pies_63765_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite vegetal", "1 rebanada de pan de un día, rallado", "2 cucharadas de polenta seca de cocción rápida", "pimienta negra recién molida", "3 cucharadas de harina común", "pizca de pimentón", "1 huevo de gallinas camperas", "½ limón, solo jugo", "1 filete de pescado blanco, como bacalao o solla, piel y huesos retirados, cortado en tiras de 3cm / 1in"], "method": ["Precaliente el horno a 220C / 450F / Gas 7. Cubra una bandeja para hornear con papel de hornear y cepille todo el pergamino con un poco de aceite vegetal.", "En un tazón, mezcle las migas de pan y la polenta, y sazone bien con pimienta negra recién molida.", "Ponga la harina común en otro recipiente y sazone con el pimentón. Batir el huevo en un tazón.", "Exprime el jugo de limón sobre las tiras de pescado.", "Enrolle cada tira de pescado primero en la mezcla de harina, luego sumérjala en el huevo batido y luego cúbrala con la mezcla de polenta. Coloque cada dedo de pescado en la bandeja de horno preparada.", "Rocíe un poco más de aceite vegetal en cada dedo de pescado, luego cocine en el horno durante 10-12 minutos, o hasta que el pescado esté cocido y el revestimiento esté crujiente. Sirva con ensalada o verduras al vapor."], "url": "www_bbc_co_uk_food_recipes_crispy_fish_fingers_34974", "title": "Dedos de pescado crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_fish_fingers_34974_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 225-350 g / 8-12oz pichones de pichón, cortados por la mitad a lo largo", "4 rebanadas finas de jengibre fresco (7.5cm / 3in de largo)", "900ml / 1½ pintas de maní o aceite vegetal", "cuñas de limón, para servir", "1.2 litros / 2 pintas de caldo de pollo", "5 cucharadas de salsa de soja oscura", "3 cucharadas de salsa de soja ligera", "150ml / 5fl oz vino de arroz Shaoxing o jerez seco", "3 cucharadas de azúcar de roca", "1 cucharadita de sal", "6 piezas de cáscara de naranja fresca, cáscara de cítricos picada o seca, empapada y finamente picada", "3 piezas de corteza de canela china o palitos de canela", "3 anís estrellado", "1 cucharadita de pimienta blanca", "2 cucharaditas de aceite de sésamo", "2 cucharadas de pimienta asada de Sichuan, finamente molida y tamizada", "3 cucharadas de sal", "1 cucharada de aceite de maní o vegetal", "4 dientes de ajo, pelados y aplastados", "2 cucharaditas de sal", "750g / 1lb 10oz de verduras chinas, como la col china o el bok choi", "2 cucharadas de caldo de pollo o agua"], "method": ["Para la paloma, ponga a hervir una olla grande de agua. Blanquee las palomas en el agua hirviendo durante unos dos minutos. (Este método ayuda a eliminar las impurezas y tensa la piel.) Retire las palomas de la maceta y deseche el agua.", "Combine todos los ingredientes de la salsa de cocción en una olla grande y llévela a ebullición. Agrega las palomas y el jengibre. Baje el fuego a fuego lento y cubra la olla con fuerza. Déjalo cocer a fuego lento durante aproximadamente 30 minutos o hasta que las palomas estén tiernas. Quítelos con una espumadera y déjelos secar en un plato, o cuélguelos en un lugar fresco, seco y aireado durante al menos dos horas. (El líquido de cocción, una vez enfriado, puede almacenarse en un recipiente de plástico y congelarse para usar en el futuro).", "Después de dos horas, la piel de las palomas debería sentirse como papel de pergamino. Justo antes de que esté listo para servirlos, caliente el aceite de maní o vegetal en una freidora o en un wok grande. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cuando el aceite esté caliente, baje las palomas y fríalos hasta que estén crujientes y de color marrón intenso. Voltéelos con frecuencia con una cuchara ranurada para que todos los lados estén bien cocidos y dorados. Esto debería tomar alrededor de 10 minutos. Escurra las palomas cocidas sobre papel de cocina y deje que se enfríen durante unos minutos.", "Para la salsa de sal y pimienta, caliente un wok o sartén grande hasta que esté caliente y agregue los granos de pimienta molidos y la sal. Sofreír durante un minuto, quitar y dejar enfriar. Luego mezcle en una licuadora por un minuto.", "Para las verduras chinas salteadas, caliente un wok o una sartén grande a fuego alto hasta que esté caliente. Agregue el aceite, y cuando esté muy caliente y ligeramente humeante, agregue el ajo y la sal. Revuelva-fríe la mezcla por 15 segundos o hasta que el ajo esté ligeramente dorado. A continuación, agregue rápidamente los verdes chinos. Revuelva-fríe durante 3-4 minutos hasta que los verdes se hayan marchitado un poco. Agregue el caldo de pollo o el agua y continúe revolviendo por unos minutos más hasta que los greens estén listos, pero aún estén ligeramente crujientes.", "Para servir, usando una cuchilla pesada o un cuchillo, corte la paloma en 4-6 piezas y colóquela en un plato caliente para servir. Servir a la vez con rodajas de limón, el dip de sal y pimienta asada y los verdes."], "url": "www_bbc_co_uk_food_recipes_crispy_fried_pigeon_94157", "title": "Paloma frita crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "Patatas de 200g / 7oz, peladas (aproximadamente una patata por persona)", "80g / 3oz de haggis, cortado en dos rebanadas, a temperatura ambiente", "2 huevos de gallinas camperas", "50g / 1¾oz de panceta, finamente picada", "75g / 2½oz de espinaca para bebé", "3 champiñones crudos, muy finos en rodajas", "2 cucharadas de cebollines picados", "2 cucharadas de perejil picado", "2 tomates maduros, sin semillas y finamente picados", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino tinto", "1 cucharadita de mostaza granulada", "1 cucharada de whisky", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Rallar las papas peladas en una toalla de té limpia usando los agujeros grandes en el rallador. Envuelva la toalla de té alrededor de la papa rallada y apriete para eliminar la humedad.", "Caliente un blini pan (o una sartén) a fuego medio y agregue aproximadamente una cucharada de aceite de oliva. Cuando esté caliente, coloque una cucharada colmada de la papa rallada seca en un montículo en la sartén y presione suavemente hacia abajo para formar un círculo ordenado. Deja cocinar por un par de minutos. Coloque una rodaja de haggis encima de cada pastel de papa, luego cubra con otra cucharada colmada de papa rallada y presione suavemente hacia abajo.", "Cocine hasta que esté crujiente y dorado (4-5 minutos), luego gire con cuidado y cocine por el otro lado durante 3-4 minutos. Las bandejas Blini hacen que este trabajo sea más fácil, pero un método alternativo es cocinarlas en una sartén y cortar las rondas bien acabadas después de cocinarlas. Coloque en el horno durante 5-6 minutos.", "Freír los huevos como más te gusten. Me gusta el mío cocinado en un poco de aceite de oliva a fuego alto, por lo que se ponen un poco crujientes mientras se mantiene la yema líquida.", "Para hacer la ensalada, en una sartén puesta a fuego medio, fría la panceta hasta que esté crujiente con un poco de aceite de oliva. Mantener caliente Coloque las espinacas, los champiñones, las hierbas y el tomate en un tazón. Cuando esté listo para servir, mezcle la panceta caliente a través de la ensalada.", "Combine el aceite de oliva, el vinagre, la mostaza y el whisky en un aderezo y agite vigorosamente. Rocíe la ensalada, guardando un poco para servir.", "Para servir, coloque la ensalada tibia en platos para servir, cubierto con haggis y panqueques de papa y un huevo frito. Moler un poco de pimienta y rociar el resto del aderezo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crispy_haggis_and_potato_74567", "title": "Haggis crujiente y panqueque de papa con ensalada de espinaca y aderezo caliente de whisky y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750 g / 1 libra de cebollas de 10 oz, peladas", "50g / 2oz de mantequilla", "2 cebollas pequeñas, más o menos picadas", "3 dientes de ajo, toscamente picados", "Espárragos de 750 g / 1 lb 10 oz, picados", "1 litro / 1¾ pintas de caldo de pollo blanco, caliente", "200ml / 7fl oz mantequilla de nuez", "200ml / 7fl oz crema doble hervida", "150 g / 5½ oz de espinacas baby, lavadas", "Espárragos de 750 g / 1 lb 10 oz, picados", "150ml / 5fl oz mantequilla de nuez", "125ml / 4fl oz crema doble hervida", "115 g / 4 oz de espinaca baby lavada", "2 cucharadas de vinagre de vino blanco", "4 huevos de gallinas camperas", "4 papas grandes, hechas en espagueti usando un espiralizador", "8 grandes lanzas de espárragos, recortadas", "2 cucharadas de aceite de oliva", "sal, sazonar"], "method": ["Para el polvo de cebolla quemada, precaliente el horno a 65C / 150F / Gas: la configuración más baja posible.", "Calentar una sartén seca hasta que esté caliente.", "Corta las cebollas por la mitad y coloca el lado cortado sobre la sartén y deja hasta que esté muy carbonizado. Voltee las cebollas y repita en el otro lado. Transfiera las cebollas a una bandeja para hornear y hornee en el horno a fuego muy lento durante 12 horas.", "Cuando esté completamente seco, mezcle las cebollas en un procesador de alimentos con un polvo fino. Tamice el polvo de cebolla y déjelo a un lado hasta que lo necesite.", "Para los espárragos velouté, caliente una sartén hasta que esté medio caliente. Agregue la mantequilla, las cebollas y el ajo y fríe suavemente durante 4-5 minutos hasta que estén suaves.", "Agregue los espárragos picados, revuelva bien, luego vierta el caldo de pollo caliente. Llevar la mezcla a ebullición y cocine a fuego lento durante seis minutos.", "Agregue el beurre noisette y la crema a la bandeja de espárragos y mezcle bien.", "Vierta la mezcla de espárragos en una licuadora, agregue la espinaca baby y mezcle hasta lograr un puré fino.", "Cuele el puré de espárragos a través de un tamiz fino en un recipiente con agua helada, para enfriar y mantener el color. Dejar de lado hasta que sea necesario.", "Para el puré de espárragos, ponga a hervir un sartén de agua con sal, agregue los espárragos y cocine durante unos minutos hasta que estén blandos. Escurra los espárragos, luego sumérjalos inmediatamente en agua fría para refrescarlos. Escurrir de nuevo, y palmear los espárragos en seco.", "Mezcle los espárragos cocidos con los ingredientes restantes hasta obtener un puré fino.", "Cuele el puré a través de un tamiz fino en un recipiente con agua helada, para enfriar y mantener el color. Dejar de lado hasta que sea necesario.", "Para los huevos de gallina crujientes, caliente una freidora a 190C / 375F. Alternativamente, caliente el aceite vegetal en una sartén profunda de fondo grueso, hasta que la miga de pan chisporrotee y se ponga dorada cuando la introduzca. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Ponga a hervir una olla grande de agua, agregue el vinagre y luego los huevos y cocine durante 2 minutos y medio. Escurra los huevos y colóquelos inmediatamente en agua fría para refrescar y detener el proceso de cocción. Pele los caparazones de los huevos y córtelos para que estén bien y redondos.", "Seque los huevos pelados y luego envuélvalos en espagueti de papa. Suavemente baje los huevos envueltos en papa en el aceite caliente y cocine hasta que estén crujientes.", "Retire los huevos del aceite con una espumadera y escurra sobre papel de cocina. Sazonar con sal y pimienta negra recién molida.", "Para los espárragos a la plancha, ponga a hervir un sartén grande de agua con sal, agregue los espárragos y hiérvalos durante dos minutos y 20 segundos, luego escurra y sumérjalos inmediatamente en agua fría para refrescarlos. Escurra los espárragos de nuevo y séquelos.", "Caliente una sartén hasta que esté medio caliente. Rocíe los espárragos con aceite de oliva, espolvoréelos con sal y cocínelos a fuego medio hasta que queden carbonizados en cada lado.", "Para servir, espolvorea el polvo de cebolla sobre los espárragos a la plancha. Con una cuchara, espolvoree tres rayas de puré de espárragos en cada plato de servir, y coloque dos espárragos a la plancha cubiertos con el polvo de cebolla sobre el puré. Coloque el huevo frito encima de los espárragos. Vierta el velouté en pequeñas jarras y sirva al lado."], "url": "www_bbc_co_uk_food_recipes_crispy_hens_egg_griddled_95185", "title": "Huevo de gallina crujiente, espárragos a la plancha, puré de espárragos, cebolla quemada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas colmadas de azúcar de palma rallado", "5 cucharadas de salsa de pescado tailandés", "3 cucharadas de jugo de lima fresco", "aceite vegetal, para freír en grasa", "Fideos 125g / 4½oz o fideos de arroz delgados", "5 chalotes tailandeses o 1 chalota de plátano, en rodajas finas", "400g / 14 oz de gambas de tigre crudas, peladas y desveladas (no dude en dejar el caparazón en algunos de los langostinos, si lo prefiere)", "1 pedazo pequeño de pulgar de raíz fresca de jengibre", "3 dientes de ajo, rallados o triturados", "pieza del tamaño de un pulgar galangal, finamente rallada", "al menos 3 cebolletas, cortadas longitudinalmente y en rodajas finas", "150g / 5½oz de brotes de soja", "3 hojas de lima Kaffir, finamente cortadas", "200g / 7oz de carne de cangrejo blanco recién recolectada", "puñado de hojas de cilantro, más o menos picadas", "puñado escogido hojas de menta (no cortar o las hojas se pondrán marrones)", "puñado de albahaca sagrada (albahaca normal hará si no está disponible)", "1 guindilla roja larga, cortada en diagonal para adornar", "2 limas, cortadas en cuñas"], "method": ["Para el aderezo, agregue el azúcar de palma y la salsa de pescado a un tazón pequeño y mezcle bien para disolver el azúcar. Agregue el jugo de lima y reserve.", "Para los fideos crujientes, caliente el aceite para freírlo en una freidora, wok o cacerola grande a 180-190C / 250F-375F. Cuando esté listo, un pequeño cubo de pan debe volverse crujiente y dorado, y flotar hacia la parte superior en unos segundos. Cocine los fideos - haz esto en tandas. Freír hasta que se infle y se ponga de un color marrón dorado pálido. Retire con cuidado con una cuchara ranurada y drene en un plato forrado con papel de cocina.", "Agregue tres cucharadas de aceite vegetal a un wok o una cacerola. Freír los chalotes tailandeses (o chalotes de plátano) hasta que estén crujientes. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Agregue otra cucharada de aceite vegetal al wok. Cuando esté caliente, agregue las gambas y revuelva o mezcle hasta que esté ligeramente opaco.", "Agregue el jengibre, el ajo y la galanga y fría por un par de minutos. Revuelva hasta que las gambas estén cocidas, no más de un minuto. Transfiera a un tazón grande con los chalotes crujientes.", "Agregue las cebolletas, los brotes de soja, las hojas de lima y la carne de cangrejo. Vierta el aderezo y las hierbas. Mezcle bien, pero con suavidad, ya que no desea magullar las hierbas, use sus manos para esto.", "Coloque la ensalada en un tazón grande para servir, poniendo una capa de fideos crujientes en el fondo y una capa de gambas y cangrejo encima, luego repita hasta que haya agotado todos los ingredientes. Adorne con slithers de chile y rodajas de lima y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_crispy_noodles_with_80051", "title": "Fideos crujientes con gambas y cangrejo (Mee krob)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]