[{"ingredients": ["250 g / 9 oz de azúcar en polvo", "4 cucharaditas de polvo de espreso instantáneo (no gránulos de café instantáneos)", "4 claras de huevo de gallinas camperas", "pizca de sal", "2 cucharadas de harina de maíz", "1 cucharadita de vinagre de vino blanco", "300 ml / 10 fl oz doble crema", "1 cucharadita de cacao en polvo"], "method": ["Precaliente el horno a 180 ° C / 375 ° F / Gas 4 y forre una bandeja de horno plana con papel de hornear y, si es útil, utilice una lata de pastel de 23 cm / 9 in como guía, dibuje un círculo con un lápiz.", "En un tazón pequeño, mezcle el azúcar con el polvo de espreso instantáneo y deje de lado por el momento.", "En un recipiente limpio, sin grasa, preferiblemente de metal (y limpie el interior con un trozo de rollo de cocina humedecido en vinagre primero, si lo desea) batir las claras con una pizca de sal hasta que estén sosteniendo picos suaves y seguir batiendo mientras gradualmente agrega la mezcla de azúcar y café, una cucharada a la vez.", "Cuando toda esta mezcla esté incorporada y tengas un merengue firme, reluciente y de color crudo, dóblate con una cuchara de metal sin grasa, la harina de maíz y el vinagre.", "Vierte cucharadas grandes de la mezcla de merengue dentro del círculo dibujado (o haz una forma circular a mano alzada si lo prefieres) en el pergamino para hornear y alisa y da forma con una espátula para que se vea como la corona de un barco de paja: debe ser plano en la parte superior.", "Ponlo en el horno e inmediatamente baja el horno a 150C / 300F / Gas 2, y cocina por una hora. La capa exterior del merengue debería ser nítida, pero solo justa. Cuando esté listo, apague el horno y deje la base Pavlova dentro hasta que esté frío o durante la noche.", "Una vez que la base pavlova esté fría, levántela con cuidado en su papel y colóquela, con la parte superior hacia abajo sobre una placa plana grande, y luego retire suavemente el papel.", "Batir la crema doble hasta que esté espesa y bien ventilada, pero aún suave, y extender esta delicadamente sobre la parte superior (que anteriormente era el fondo!) Del merengue. Con una cucharilla, empuje el polvo de cacao a través de un colador fino o un colador de té para decorar, al estilo capuchino, la parte superior."], "url": "www_bbc_co_uk_food_recipes_cappucino_pavlova_09523", "title": "Cappuccino pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cappucino_pavlova_09523_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 huevos de gallinas camperas", "290g / 10oz de azúcar moreno claro", "2 cucharaditas de canela molida", "Harina normal de 200g / 7oz", "1 cucharadita de nuez moscada fresca", "4 cucharaditas de harina de maíz", "45 g / 1½ oz de mantequilla sin sal, derretida, enfriada", "160ml / 5½fl oz de agua", "Azúcar 250g / 8¾oz", "5 claras de huevo de gallinas camperas, a temperatura ambiente", "½ cucharadita de crema de tártaro", "300g / 10½oz de mantequilla sin sal, ablandada", "50g / 1¾oz de azúcar", "120ml / 4¼fl oz de agua", "1½ cucharadita de extracto de vainilla"], "method": ["Precaliente el horno a 175 ° C / 350 ° F / Gas 4. Ponga en línea tres latas de emparedado de 20 cm / 8 in, pero no las engrase.", "Batir los huevos ligeramente en un tazón hasta hacer espuma, luego lentamente batir el azúcar con un batidor eléctrico. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento y continúe batiendo hasta que el azúcar se haya derretido. Retire el recipiente del fuego y continúe batiendo hasta que la mezcla llegue a la etapa de cinta.", "Mezcle la canela, la nuez moscada, la harina y la harina de maíz en un bol. Tamiza un tercio de la mezcla de harina en la mezcla de huevo y dóblala suavemente. Repita con la mezcla de harina restante hasta que esté bien combinada.", "Batir una pequeña cantidad de la mezcla de torta en la mantequilla, luego doblar esta mezcla en el resto de la masa de torta.", "Divida la masa de pastel entre las latas de pastel y hornee en el horno durante 15-20 minutos, o hasta que un palillo de dientes insertado en el centro de los pasteles salga limpio. Retirar del horno y reservar para enfriar. Una vez que se haya enfriado, pase un cuchillo de hoja redonda por el borde interior de las latas y colóquelo en una rejilla para que se enfríe por completo.", "Mientras tanto, para la crema de mantequilla de merengue y caramelo, bata las claras de huevo en un mezclador independiente hasta que estén espumosas. Agregue la crema de tártaro y bata hasta que se formen picos rígidos cuando se quite la batidora.", "Caliente el agua y el azúcar en una cacerola hasta que la temperatura alcance los 115 ° C (238 ° F) (use un termómetro de azúcar para verificar esto).", "Vierta el jarabe caliente por el lado del tazón de claras de huevo y continúe batiendo hasta que la mezcla esté brillante y fría. Luego lentamente bate la mantequilla un poco a la vez, asegurándote de que toda la mantequilla esté incorporada antes de agregar más. La formación de hielo será gruesa y suave.", "Para el jarabe de azúcar, caliente el azúcar y el agua a fuego medio hasta que el azúcar se haya disuelto y el volumen del líquido se haya reducido ligeramente. Agregue el extracto de vainilla y déjelo enfriar.", "Para decorar el pastel, cepille los pasteles con jarabe de azúcar con un cepillo de pastelería, luego use el glaseado de caramelo para llenar y congelar la parte superior y los lados."], "url": "www_bbc_co_uk_food_recipes_caramel_and_cinnamon_40698", "title": "Pastel de caramelo y canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 huevos medianos de granja", "120 g / 4 oz de azúcar en polvo", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "2 vainas de vainilla, partidas por la mitad y semillas raspadas", "5 huevos medianos de granja", "150 g / 5½ oz de azúcar en polvo", "Harina común 110g / 4oz", "2 cucharadas de esencia de café (como Camp)", "25 g / 1oz de mantequilla sin sal, derretida", "1 piña, pelada y sin corazón y en rodajas finas", "300g / 10½oz de queso crema", "4 cucharadas de azúcar glas", "1 cucharada de jarabe de arce", "225g / 8oz de dulce de leche o caramelo enlatado", "Crema doble de 100 g / 3½ oz, batida", "azúcar glasé, para servir el polvo", "110g / 4 oz de azúcar morena oscura", "110g / 4oz de mantequilla sin sal", "Crema doble 175ml / 6fl oz"], "method": ["Para el helado de vainilla, bata las yemas con la mitad del azúcar impalpable en un tazón grande hasta que esté espeso y cremoso.", "Coloque la leche, la crema, el azúcar impalpable restante, las semillas de vainilla y las vainas de vainilla en una sartén y deje que hierva. Vierta la leche caliente en las yemas batidas y revuelva bien.", "Regrese la mezcla a la sartén y cocine a fuego muy lento, revolviendo constantemente con una espátula, hasta que la mezcla tenga un grosor suficiente como para cubrir la parte posterior de una cuchara.", "Déjelo enfriar, luego refrigere durante al menos una hora.", "Cuele la mezcla en una máquina para hacer helados y revuelva hasta que se congele, siguiendo las instrucciones del fabricante.", "Para el pastel de caramelo y café, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme ligeramente la base de dos moldes para pasteles de 20 cm / 8 in.", "Batir los huevos y el azúcar juntos en un tazón de 4 a 5 minutos o hasta que estén espesos y pálidos. Tamiza la harina en un recipiente aparte, luego dóblala suavemente en la mezcla de huevo y azúcar hasta que se combine. Agregue la esencia de café y la mantequilla derretida.", "Divida la mezcla de manera uniforme entre las dos latas de torta preparadas.", "Coloque las latas en una bandeja para hornear y hornee en el horno durante 15-20 minutos, o hasta que los pasteles se levanten y sean elásticos al tacto. Retire del horno y permita que se enfríe brevemente antes de encenderlo en una rejilla para que se enfríe completamente.", "Coloque la piña en rodajas en uno de los pasteles. Mezcle el queso crema, el azúcar glas, el jarabe de arce, el caramelo y la crema doble en un tazón grande para mezclar y reparta sobre las rodajas de piña. Coloque la otra torta encima y espolvoree con azúcar glas.", "Para la salsa de caramelo, derrita el azúcar y la mantequilla en una cacerola a fuego lento. Cuando esté líquido y combinado revuelva en la crema.", "Sirva el pastel en rebanadas con una bola de helado de vainilla y vierta un poco de salsa."], "url": "www_bbc_co_uk_food_recipes_caramel_and_coffee_cake_27035", "title": "Pastel de caramelo y café con salsa de caramelo y helado de vainilla", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fechas medjool de 250 g / 9 oz, picadas y picadas", "115g / 4oz de higos secos, picados", "Ciruelas 100 g / 3½ oz cortadas", "25 g / 1 oz de harina de auto crianza", "3 limones, jugo de 1½ y ralladura de 3", "1 naranja, solo ralladura", "250g / 9oz de mantequilla sin sal", "200g / 7oz de azúcar mascabado ligero", "4 huevos grandes de gallinas camperas", "Harina de auto aumento 250g / 9 oz", "1 cucharadita de polvo de hornear", "270g / 9½ oz de jarabe de fecha", "135g / 4¾oz de mantequilla sin sal", "400 ml / 14 fl oz crema doble", "400 g / 14 oz de azúcar en polvo", "50g / 1¾oz de glucosa líquida", "flores comestibles, como capuchina roja, violetas violetas y pensamientos, para decorar"], "method": ["Precaliente el horno a 180C / 160C Fan / Gas 4 y coloque un plato pequeño en el congelador. Engrase y forme la base de una lata para pasteles con forma de resorte de 20 cm / 8 pulg.", "Para la fruta, combine la fruta seca y el jugo de limón en un tazón. Cubra la fruta en la harina y agregue las ralladuras de limón y naranja.", "Para la masa de pastel, unte la mantequilla y el azúcar hasta que estén suaves y esponjosos. Poco a poco golpee los huevos, batiendo bien entre cada adición. Agregue los ingredientes restantes y la mezcla de frutas secas.", "Coloque la mezcla en la lata de torta preparada y hornee durante 1 hora, o hasta que una brocheta insertada en el centro salga limpia.", "Déjelo enfriar, luego retírelo de la lata, retire el pergamino para hornear de la base y colóquelo en una rejilla para que se enfríe por completo.", "Para la salsa de caramelo, combine todos los ingredientes en una cacerola grande y cocine a fuego lento durante 30 minutos, revolviendo con frecuencia, hasta que quede suave y burbujeante (si usa un termómetro de azúcar, será 115-120C). Para probar si está listo, retire la placa del congelador y coloque una cucharadita de salsa en el medio. Déjelo por un minuto y luego pruebe la consistencia: debe poder extenderse y no fluir. Transfiera a un recipiente y deje enfriar y espesar hasta obtener una consistencia untable.", "Una vez que el pastel esté frío, córtalo por la mitad horizontalmente. Coloque la mitad inferior en un plato para servir y extender la salsa de caramelo en la parte superior. Sándwich con la mitad superior y extender más salsa de caramelo perfectamente por los lados y la parte superior de los pasteles.", "Para hacer las decoraciones, si las usa, haga un lote de caramelo disolviendo el azúcar con la glucosa en una olla grande. Cocine el caramelo hasta que sea de color ámbar intenso (unos 185C en un termómetro de azúcar) y déjelo enfriar. Alinee una bandeja para hornear con papel para hornear antiadherente.", "Una vez que el caramelo se haya enfriado y espesado, gotee caramelo sobre los lados del pastel para que se escurra y forme fragmentos irregulares. El caramelo estará casi en el punto donde se solidifica, por lo que debe trabajar rápidamente. Si se endurece completamente, caliente la sartén suavemente para aflojarla nuevamente.", "Ponga un poco del caramelo en la bandeja preparada para formar fragmentos irregulares que decorarán las partes superiores de los pasteles. Aparta para endurecer.", "Finalmente crea azúcar hilado para vestir el pastel. Calienta suavemente el resto del caramelo y luego toma 2 cucharas de madera y cúbrelas con una pequeña cantidad de aceite. Asegúrelos a la encimera con una bandeja pesada para que las manijas sobresalgan. ¡Cubre el suelo con papel porque estarás haciendo un desastre! Una vez que el caramelo tiene la consistencia de la miel que moquea, sumerja un tenedor en el caramelo y golpéelo entre los mangos engrasados. Recoge el azúcar hilado y coloca encima del pastel. Pon flores comestibles por todo el pastel para terminar."], "url": "www_bbc_co_uk_food_recipes_caramel_sticky_toffee_85753", "title": "Pastel de caramelo Caramelo pegajoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace pastel de 1 x 20 cm / 8 pulgadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal", "Azúcar en polvo de 100 g / 7 oz", "2 x 400 g / 14 oz latas de leche condensada", "250 g / 8¾oz de mantequilla sin sal, a temperatura ambiente, más una cucharada extra", "150 g / 5¼ oz de azúcar en polvo", "150g / 5¼ oz de harina de maíz", "Harina normal 300g / 10½ oz", "4 plátanos grandes, pelados y en rodajas", "salsa de caramelo", "helado de plátano", "menta fresca"], "method": ["Para el caramelo, coloca la mantequilla y el azúcar en una sartén antiadherente a fuego lento, revolviendo hasta que la mantequilla se derrita y el azúcar se disuelva. Agregue la leche condensada y lentamente hierva, revolviendo continuamente, para hacer el caramelo. Tan pronto como la mezcla se espese y empiece a oler a caramelo, retírelo del fuego.", "Para el shortbread, precaliente el horno a 170C / 340F / Gas 3.", "Bata la mantequilla con el azúcar en un tazón grande hasta que esté suave y esponjosa. Tamiza la harina de maíz y la harina en el bol. Mezcle y amase suavemente la masa hasta que se junte en una bola.", "Cubra una bandeja para hornear de 20cm / 8in x 30cm / 12in con pergamino antiadherente para hornear. Estire dos tercios de la masa para que quepa en la lata y colóquela dentro, presionándola cuidadosamente en los bordes.", "Extienda tres cuartas partes del caramelo de leche condensada sobre la base (el resto se mantendrá en un recipiente tapado en el refrigerador durante un máximo de dos semanas). Coloque las rodajas de plátano sobre el caramelo y luego desmenuce el tercio restante de la masa sobre la parte superior.", "Hornea por 20 minutos. El caramelo debe haber burbujeado un poco entre la masa y la parte superior de la torta debe ser de color marrón dorado. Deje que se enfríe en la lata durante cinco minutos antes de cortarlo en cuadrados. Deje que se enfríe completamente antes de sacarlo de la lata.", "Para servir, recaliente los cuadrados de torta dulce. Sirva con helado de plátano y una llovizna de salsa de caramelo. Decorar con una ramita de menta fresca."], "url": "www_bbc_co_uk_food_recipes_caramelbananashortbr_85999", "title": "Torta dulce de plátano caramel", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla, cortada en cubitos", "Harina normal de 100 g / 3½ oz", "3 huevos de gallinas camperas", "280ml / 9¾fl de leche en oz", "3 yemas de huevo de gallinas camperas", "60g / 2¼ oz de azúcar en polvo", "2 cucharadas de gránulos instantáneos de café", "Harina normal de 30g / 1oz", "1 x 397 g / 14 oz de leche condensada de caramelo de estaño", "300ml / 10½ fl oz crema doble", "75g / 2½ oz de azúcar glas", "Licor de café 70ml / 2½fl oz", "200 g / 7 oz de azúcar morena clara", "60ml / 2¼fl oz de leche entera", "75 g / 2½ oz de mantequilla", "Harina normal de 75 g / 2½ oz", "8g de granos de café enteros, toscamente picados", "Azúcar en polvo 80g / 3oz", "Pacanas 80g / 3oz"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7 y alinee una bandeja grande para hornear con papel para hornear.", "Para la pastelería choux, ponga a hervir 110 ml / 4 fl oz de agua en una olla con la mantequilla.", "Agregue la harina de una vez y, con una cuchara de madera, golpee inmediatamente en el agua hasta que quede suave. Retire la sartén del fuego y continúe batiendo la mezcla hasta que se haya enfriado un poco.", "Agregue los huevos uno por uno, batiendo cada uno en la mezcla, hasta que los huevos estén completamente incorporados y la mezcla esté brillante. Dejar enfriar un poco.", "Con una cuchara, coloque la pasta choux en una manga pastelera. Tubo bolas o líneas cortas de la masa choux en la bandeja de hornear preparada, dejando un espacio generoso entre cada uno.", "Hornee los bollos de choux en el horno durante 10-15 minutos hasta que se eleven, luego reduzca la temperatura del horno a 180C / 160C Fan / Gas 4 y hornee durante 30-35 minutos o hasta que estén dorados (siga mirando hacia el final de el tiempo de cocción. Si su horno tiene puntos calientes, es posible que deba mover los panecillos para asegurarse de que todos se cocinen uniformemente). Coloque la puerta del horno un poco abierta (introduzca el mango de una cuchara de madera) y apague el fuego. Deja los bollos de choux en el horno para que se \"sequen\".", "Para el llenado, lleve la leche a ebullición en una cacerola.", "En un tazón, mezcle las yemas de huevo, el azúcar impalpable y los gránulos de café hasta que estén pálidos y esponjosos. Agregue la harina a la mezcla de huevo y revuelva hasta que esté bien combinado.", "Vierta la leche tibia sobre la mezcla de huevo y mezcle bien para combinar, luego regrese la mezcla de llenado a la cacerola y cocine a fuego medio durante 5-8 minutos, o hasta que la mezcla se haya espesado.", "Cuele la mezcla de llenado a través de un colador fino en un recipiente limpio. Cubra el recipiente con film transparente y déjelo enfriar, luego enfríelo en la nevera hasta que esté completamente frío.", "Batir la leche condensada de caramelo en la mezcla de llenado en frío hasta que esté bien combinada. Enfriar en la nevera hasta que sea necesario.", "Para la crema batida de café, mezcle la crema doble, el azúcar glas y el licor de café hasta que se formen picos rígidos cuando se quite la batidora. Coloque la mezcla en una manga pastelera y déjela enfriar en la nevera hasta que lo necesite.", "Para el glaseado, derrita el azúcar, la leche, la mantequilla y la harina en una cacerola, revuelva bien, luego ponga la mezcla a ebullición. Retirar del fuego y dejar reposar durante 5 minutos para que se enfríe, luego revuelva bien; debería tener la consistencia de la miel.", "Extienda un poco del glaseado en la parte superior de cada bollo de choux, luego espolvoree algunos de los granos de café picados sobre cada uno. Deja para establecer.", "Para las pacanas azucaradas, caliente el azúcar en una sartén a fuego medio o bajo, hasta que se derrita y se ponga dorado claro (no revuelva el azúcar en absoluto). Agregue las pacanas y revuelva para cubrirlas completamente en el jarabe.", "Raspe las pecanas azucaradas en una bandeja para hornear forrada con papel de hornear, luego déjelas a un lado para enfriarlas y endurecerlas. Una vez endurecido, cortar aproximadamente las nueces azucaradas.", "Para armar los bollos choux, corte los bollos de choux por la mitad horizontalmente y una parte de la mezcla de relleno de caramelo y luego la crema batida de café sobre las bases. Espolvoree sobre algunas de las pecanas azucaradas, luego cubra con la parte acristalada de los bollos de choux. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_caramel_and_coffee_choux_37354", "title": "Bollos de choux de caramelo y café", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramel_and_coffee_choux_37354_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["375g / 13oz de harina blanca fuerte", "Mantequilla 375g / 13oz - firme pero no dura", "1½ cucharadita de sal fina", "1 x 450 g / 1 libra de bolsa de papas baby", "6 pimientos Romano dulces rojos, en rodajas finas", "1 cucharada de aceite de oliva", "botón de mantequilla", "1½ cucharadita de comino molido", "2 cucharaditas de azúcar en polvo", "5 dientes de ajo, pelados", "2 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "1/4 cucharadita de azúcar en polvo", "1½ cucharadita de romero picado", "1½ cucharadita de tomillo picado", "2 cucharadas de estragón picado", "500 g / 1 libra de espinaca 2 oz, lavado", "200g / 7oz de queso de cabra suave", "130 g / 4½ oz de queso cheddar maduro, rallado", "2 huevos de gallinas camperas", "sal y pimienta recién molida"], "method": ["Para la pasta de hojaldre basta, tamice la harina y la sal en un tazón grande. Agregue la mantequilla y frótela en la harina. No lo lleves a la etapa de migas de pan fino, ya que queremos trozos de mantequilla aplastados en la mezcla. Agregue 140-150 ml de agua para juntarlo todo. Esta masa no requiere amasamiento.", "Hierva una superficie de trabajo y extienda la masa en un rectángulo ordenado que sea tres veces más largo que su ancho. Dobla un tercio de la masa hacia el centro y cúbrela con el otro tercio, de modo que esté prolijamente doblada, como una letra. Cubra la masa y descanse en la nevera durante 20 minutos.", "Retire la masa de la nevera y con el lado largo hacia usted, vuelva a desplegarla hasta tres veces más de lo ancho que esté, y doble como antes. Gire la masa doblada 90 grados y repita el laminado y doblado. Cubra la masa y déjela reposar de nuevo por un mínimo de 20 minutos en la nevera (hasta una hora si tiene tiempo). La masa ahora está lista para usar.", "Para la capa de papa, cocine las papas nuevas en agua salada y hirviendo hasta que estén tiernas. Escurra las papas y déjelas enfriar. Una vez que esté frío, corta las papas en rodajas de 5 mm / ¼. Coloque las rodajas de papa en un plato, sazone con pimienta negra recién molida y reserve.", "Para la capa de pimiento rojo, caliente el aceite de oliva y la mantequilla en una sartén grande. Cocine los pimientos en rodajas durante cinco minutos o hasta que estén suaves. Agregue el comino molido, el azúcar y sazone con sal y pimienta negra recién molida y mezcle bien. Retirar del fuego y reservar para enfriar.", "Para la espinaca y la capa de ajo caramelizado, cocine a fuego lento los dientes de ajo en agua hirviendo durante tres minutos. Escurrir bien. Transfiera los dientes de ajo a una olla grande y fría en aceite de oliva durante cuatro minutos, hasta que se doren suavemente.", "Agregue el vinagre balsámico y 240 ml / 9 fl oz de agua a los dientes de ajo y cocine a fuego lento durante 10 minutos.", "Agregue el azúcar, el romero, el tomillo, el estragón y sazone con sal. Cocine a fuego lento hasta que la mayor parte del líquido se haya evaporado y los dientes de ajo estén cubiertos con el caramelo oscuro.", "Caliente la espinaca en una olla grande, hasta que comience a marchitarse. Sazone la espinaca, luego drene y exprima la mayor cantidad de agua posible. Mezcle la espinaca en la mezcla de ajo. Batir el queso de cabra suave y uno de los huevos. Agregue esto a la espinaca y mezcle bien. Dejar de lado hasta que sea necesario.", "Precalentar el horno a 220C / 425F / Gas 7.", "Para ensamblar el pithivier, despliegue dos discos de repostería, uno de 32 cm / 13 pulgadas de diámetro para la base y otro de 35 cm / 14 pulgadas para la parte superior y 3 mm / 1/8 pulgadas de grosor.", "Batir el huevo restante para usar como lavado de huevo. Coloque el disco de pastelería para la base en la bandeja de hornear forrada con pergamino antiadherente. Cepille los bordes con un lavado de huevos, dejando un área sin lavar en el centro del tamaño de un platillo o placa lateral.", "Coloque la capa sobre las papas en rodajas, dejando un borde de 4 cm / 1½ pulgadas alrededor del borde. Sazonar con pimienta recién molida negro.", "A continuación, cubra las papas con los pimientos rojos preparados.", "Luego coloque la mezcla de ajo y espinacas sobre los pimientos rojos.", "Espolvoree el queso cheddar rallado encima. Usando tus manos, ordena el relleno en un montículo.", "Coloque el disco de pastelería más grande sobre el relleno y déjelo unir con la base. Presione ambos juntos para sellar. Cortar el exceso de pastelería.", "Crea un borde festoneado con la parte posterior de un cuchillo presionando la masa entre el pulgar y el índice. Transfiera a la nevera para descansar por 15 minutos.", "Retire el pithivier de la nevera y cepille con huevo lavado. Haga un pequeño orificio en el centro y otras cuatro aberturas pequeñas alrededor del borde superior para permitir que salga el vapor.", "Usando un cuchillo pequeño, decore el pithivier con un patrón radiante de rayo de sol; comience en el centro de la masa, marque las líneas que salen por el borde. Evita cortar todo el camino. También puedes marcar el borde festoneado.", "Hornee el pithivier en el horno precalentado durante 10 minutos, luego reduzca la temperatura a 200C / 400F / Gas 6 y continúe horneando durante otros 15-20 minutos.", "Cuando esté cocido, enfríe el pithivier en una rejilla y sirva caliente o a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_caramelised_garlic_red_75054", "title": "Espinacas, ajo caramelizado, pimiento rojo y papa pithivier", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["70 g / 2½ oz de mantequilla salada, más extra para engrasar", "Tocino de 70 g / 2½ oz", "Harina normal 300g / 10½ oz", "1 cucharada de aceite de oliva", "3 cebollas rojas, finamente cortadas", "1 cucharada de azúcar moreno", "2 cucharadas de vinagre balsámico", "100g / 3½oz de feta", "2 huevos de gallinas camperas", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra recién molida"], "method": ["Engrase 4 x 10cm / 4 en latas de tartaleta de fondo suelto con un poco de mantequilla.", "Frote la mantequilla y la manteca de cerdo en la harina en un tazón grande hasta que se asemeje a migas de pan finas. Agregue 2-3 cucharadas de agua fría y use sus manos para ponerla en una masa áspera (no se lance las rodillas). Divida la masa en 4 pedazos y ruede cada cuarto en un círculo ligeramente más grande que la lata. Cuidadosamente alinee las latas con la masa. Refrigere por 10-20 minutos o hasta que sea necesario.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Pon el aceite en una sartén grande a fuego medio y agrega las cebollas. Cocine por 10 minutos. Agregue el azúcar, el vinagre y sazone con sal y pimienta. Cubra y cocine a fuego lento durante 20-30 minutos, hasta que esté realmente suave y pegajoso. Dejar de lado.", "Mientras tanto, alinee las cajas de pastelería refrigerada con papel resistente a la grasa y agregue frijoles para hornear de cerámica o arroz, y hornee por 12-15. Retire el papel y los frijoles y hornee por otros 5 minutos, hasta que estén ligeramente dorados. Dejar enfriar un poco.", "Reduzca la temperatura del horno a 160 C / 140 C Fan / Gas 3.", "Divida la cebolla y el queso feta entre las latas. Mezcle los huevos y la crema juntos y sazone bien con sal y pimienta. Vierta el huevo por igual en cada lata y cocine en el horno durante 30 minutos, o hasta que la mezcla de huevo esté cocida y dorada.", "Enfríe las tartaletas en sus latas y luego retírelas cuidadosamente. Servir."], "url": "www_bbc_co_uk_food_recipes_caramelised_onion_and_37169", "title": "Tartaletas de cebolla caramelizada y queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina blanca fuerte, más extra para espolvorear", "1 cucharadita de levadura seca de acción rápida", "1 diente de ajo pequeño, aplastado", "½ cucharadita de sal", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva, más extra para lloviznar", "2 cebollas, en rodajas finas", "1 cucharada de azúcar morena mascabado", "1 cucharada de vinagre balsámico", "Passata de 200 ml / 7 fl oz, sazonado con sal y pimienta", "8 rebanadas de jamón de Parma", "Queso de cabra suave 200 g / 7 oz", "hojas de albahaca, para adornar"], "method": ["Para hacer la masa, coloca la harina, la levadura, el ajo y la sal en un tazón. Agregue 150-175 ml / 5-6 fl oz de agua y revuelva con una cuchara de madera hasta que se combinen y se forme una masa suave. Incline sobre una superficie enharinada y amase durante 10 minutos hasta que se forme una masa homogénea.", "Engrase un tazón grande y limpio, agregue la masa y cubra con una película adhesiva. Colóquelo en un lugar cálido y déjelo por aproximadamente 1-1½ horas o hasta que duplique su tamaño.", "Mientras tanto, para el aderezo, caliente el aceite en una sartén tapada a fuego medio. Agregue las cebollas y fría por unos minutos hasta que comiencen a suavizarse. Cubra y cocine a fuego lento durante 15 minutos hasta que esté suave. Agregue el azúcar y el vinagre, suba el fuego y revuelva durante unos minutos hasta que se dore. Dejar de lado para enfriar.", "Precaliente el horno Ventilador / Gas 240C / 220 8. Precaliente una bandeja grande para hornear en el horno.", "Incline la masa probada sobre una superficie de trabajo enharinada y amasarla para formar una bola ligeramente hacia atrás. Con los dedos o los nudillos, empuje la masa hasta un círculo de 30 cm / 12 pulgadas, con bordes ligeramente más gruesos para formar la corteza.", "Pon la base en papel de hornear. Extienda la passata encima de la masa, espolvoréese con la cebolla cocida, aplaste el jamón de Parma, coloque encima y termine con trozos de queso de cabra. Deslice sobre la bandeja precalentada y hornee durante 12-15 minutos, o hasta que esté dorado y la masa esté cocida.", "Adornar con hojas de albahaca, rociar con un poco de aceite de oliva y servir con hojas de ensalada vestidas."], "url": "www_bbc_co_uk_food_recipes_caramelised_onion_goats_96877", "title": "Cebolla caramelizada, queso de cabra y pizza de jamón de Parma", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelised_onion_goats_96877_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina blanca fuerte, más extra para quitar el polvo", "125g / 4½oz de mantequilla fría sin sal", "Aceite para freír", "2 cebollas rojas grandes (o 3 pequeñas), en rodajas finas", "sal marina escamosa, al gusto", "3-4 cucharadas de azúcar moreno oscuro", "1-2 cucharaditas de mostaza granulada", "2 cucharaditas de vinagre de cerveza (alternativamente, use vinagre de vino tinto)", "1 pepino", "1 cucharadita de sal marina escamosa", "1 cucharada de azúcar en polvo", "4 cucharadas de vinagre de vino blanco", "1 rueda de queso de cabra (no demasiado suave)", "algunas ramitas de romero fresco, desgarrado en trozos pequeños, para adornar"], "method": ["Para la masa, coloque la harina y 5 cucharadas de agua fría en una batidora independiente y amasar con un gancho de masa. Alternativamente, amase a mano hasta que la masa se una. Agregue otra cucharada de agua si es necesario. Amase hasta que quede suave y luego reserve para descansar.", "Coloque la mantequilla entre dos pedazos de papel de hornear. Golpéelo con un rodillo para aplanarlo, luego extiéndalo en un cuadrado grande y colóquelo en el congelador.", "En una superficie de trabajo ligeramente enharinada, extienda la masa lo más delgada y grande que pueda. Descansa durante 5 minutos en el refrigerador, luego rueda en un rectángulo dos veces más grande que la mantequilla aplanada.", "Saca la mantequilla del papel y pon la masa. Junta las esquinas de la masa para cubrir la mantequilla. Estirar el sobre de pastelería en una superficie enharinada para hacer un rectángulo que sea aproximadamente tres veces más largo que ancho. Doble un tercio en el medio y luego el otro tercio en la parte superior. Selle los bordes ligeramente con un rodillo. Gire la masa 90 grados, despliegue y doble nuevamente. Coloque la masa en la nevera mientras prepara las cebollas caramelizadas.", "Para la cebolla caramelizada, fría las cebollas a fuego lento hasta que estén suaves. Agregue la sal, el azúcar, la mostaza y el vinagre y cocine hasta que esté muy suave. Dejar de lado para enfriar.", "Retire la masa de la nevera y estire y doble como antes. Regresa a la nevera mientras preparas el pepinillo en vinagre.", "Para el pepino en escabeche, pela la mitad del pepino y corta en cubos de 1cm / ½. Mezcle estos en sal y déjelos durante 20 minutos. Exprime los cubos y mezcla con el azúcar y el vinagre. Picar el pepino restante en cubos y dejar de lado.", "Retire la masa de la nevera y estire y doble por última vez. Enfríe por 10 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja grande para hornear con papel de hornear.", "Haga rodar la masa en un rectángulo grande y extiéndala con la mezcla de cebolla roja fría, reservando un poco para servir. Enrolle la masa (como un panecillo suizo) empezando por un lado largo y manteniendo el rollo lo más ajustado posible. Rebana en remolinos de 1½-2cm / ½-¾ de grueso.", "Transfiera a la bandeja de hornear, dejando espacio para que los remolinos se expandan un poco. Hornee por 25-35 minutos hasta que la masa esté dorada y dorada.", "Mientras tanto, corte la rueda de queso de las cabras en cuartos, luego corte los cuartos en rodajas de 5 mm de grosor. Colóquelo en una superficie resistente al calor y use un soplete de chef para quemarlo ligeramente.", "Para servir, vierta media cucharadita de la mezcla de cebolla roja encima de cada remolino. Cubra con un cubo de pepino crudo y en vinagre, antes de inclinar el queso de cabra en la parte superior. Adorne con pequeñas ramitas de romero."], "url": "www_bbc_co_uk_food_recipes_caramelised_red_onion_99976", "title": "Remolinos de queso de cabra y cebolla roja caramelizados", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 12 canapés", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelised_red_onion_99976_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, finamente picada", "1 cucharada de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "2 dientes de ajo, finamente picados", "2 cucharaditas de cúrcuma en polvo", "600ml / 20fl oz de caldo de verduras", "200 g / 7 oz de sémola", "Crema doble de 200 ml / 7 fl oz", "sal", "4 cucharadas de aceite de oliva", "2 gambas crudas, conchas en", "100 g / 3½ oz de mantequilla", "1 limón, solo jugo", "2 hojas de col china cortadas en cuadrados de tamaño mediano", "4 vieiras, dobladas a mano", "100 g / 3½ oz de maíz, de una lata, escurrido", "4 trozos pequeños de papada de cerdo crujiente cocida o tocino rayado", "2 rábanos de desayuno, cortados finamente longitudinalmente y conservados en agua helada", "pimienta blanca", "orégano fresco o seco, flores de borraja y hierbas forrajeras"], "method": ["Para la sémola, freír la cebolla en el aceite a fuego medio bajo hasta que se suavice pero no se dore. Agregue la mantequilla y el ajo y fría por 2-3 minutos. Agregue la cúrcuma y fría por 1 minuto. Agregue el caldo y la sémola y cocine a fuego lento, revolviendo continuamente, durante 30-40 minutos.", "Cuando la sémola esté casi cocida, hierva la crema y una pizca de sal en una cacerola de base pesada. Vierta sobre la sémola cocida, revuelva bien, luego retírela del fuego. Cúbrelo y déjalo descansar.", "Para las vieiras, caliente un poco de aceite en una cacerola a fuego alto. Cocine las gambas durante 2 minutos, luego voltee, agregue un poco de mantequilla y un chorrito de jugo de limón y cocine durante 1-2 minutos más. Despegue las cáscaras.", "Tueste la col china en una parrilla o sartén muy caliente y seca hasta que los bordes estén carbonizados y las hojas ligeramente marchitas.", "Retire las vieiras de sus caparazones y deseche las huevas. Sazonar con sal y pimienta blanca.", "Calentar un poco de aceite en una sartén a fuego alto. Freír las vieiras durante 2-3 minutos. Déles la vuelta, agregue un poco de mantequilla y un chorrito de jugo de limón a la sartén, luego cocine por 2 minutos más.", "Para servir, extender las sémolas cocidas en dos platos. Dispersar sobre el maíz, vieiras cocidas, langostinos, repollo carbonizado, papada de cerdo crujiente y rábanos. Adorne con las hierbas y las flores."], "url": "www_bbc_co_uk_food_recipes_caramelised_scallops_15929", "title": "Escalopes caramelizados, gambas y sémola con tocino de papada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, pelada y picada", "1 calabaza moscada, pelada y picada", "75ml-100ml / 2½-3½fl oz de caldo de pollo", "Crema doble 50ml-75ml / 2- 2½fl oz", "12 vieiras, limpiadas", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "botón de mantequilla", "4 slice of Ibérico ham", "50 g / 1¾oz de almendras enteras, tostadas y toscamente picadas"], "method": ["Para el puré de calabaza, caliente el aceite y la mantequilla en una sartén grande y fría la cebolla durante unos minutos hasta que se ablanden. Agregue la calabaza y el asado en la sartén durante cinco minutos. Vierta el caldo de pollo y cocine a fuego lento por otros 10-12 minutos hasta que esté tierno. Vierta la crema doble y sazone bien al gusto.", "En un procesador de alimentos, mezcle la calabaza hasta que quede suave y luego pase a través de un colador en una sartén limpia (lista para calentar suavemente justo antes de servir).", "Para las vieiras, sazonar con sal y pimienta. Calentar el aceite de oliva en una sartén antiadherente y, una vez caliente, freír las vieiras durante 1-1½ minutos en cada lado, hasta que se caramelice. Hacia el final de la cocción, agregue un pomo de mantequilla y hilvana las vieiras hasta que estén doradas.", "Para servir, vierta el puré de calabaza en el centro de cada plato. Cubra con las vieiras fritas y coloque las rebanadas de jamón ibérico entre ellas. Esparce sobre las almendras picadas para terminar."], "url": "www_bbc_co_uk_food_recipes_caramelised_scallops_94303", "title": "Escalopes caramelizados con jamón ibérico y puré de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de mantequilla", "3 cucharadas de pan rallado seco", "25g / 1oz de mantequilla", "1 coliflor de cabeza pequeña (alrededor de 750 g / 1 libra 10 oz antes del recorte), cortada en pequeños floretes", "200ml / 7fl oz de leche entera", "100 ml / 3½ fl oz de crema individual", "½ manojo de cebollín (aproximadamente 10 g)", "25ml / 1fl oz de aceite de oliva virgen extra", "2 cucharaditas de aceite de girasol (si es necesario)", "6 rebanadas de tocino", "12 vieiras grandes, sin cáscara y coral eliminado", "sal marina escamada y pimienta negra recién molida"], "method": ["Para las migas de pan integral con mantequilla, coloca la mantequilla en una sartén grande y antiadherente a fuego medio y cocina hasta que empiece a dorar. Agregue las migas de pan y, manteniéndolas en movimiento en la sartén, cocínelas durante 1-2 minutos o hasta que estén crujientes y doradas. Incline sobre un plato forrado con una toalla de cocina y déjelo a un lado. Limpie la sartén con un paño de cocina y reserve.", "Para el puré de coliflor, derrita la mantequilla en una sartén grande a fuego medio y añada los flósculos de coliflor. Deje que se cocine durante 2-3 minutos, revolviendo regularmente hasta que comiencen a colorear.", "Agregue la leche y la crema, sazone bien con sal y lleve a ebullición. Cubra con una tapa y cocine a fuego lento durante 8-12 minutos, dependiendo de su tamaño, o hasta que la coliflor esté realmente suave.", "Mientras la coliflor se cocina, prepare el aceite de cebollino. Reserve ocho cebolletas para servir y luego coloque las cebolletas restantes en un tazón pequeño y ancho y vierta suficiente agua hirviendo (del caldero) para cubrirlas. Deja por 20 segundos.", "Escurra y pase el cebollín por debajo del grifo frío durante 20 segundos o más para refrescar y evitar que se cocinen. Esto asegurará que se mantengan agradables y de color verde brillante en lugar de tener un color marrón repulsivo. Escurra bien, apriételos y póngalos en una mini-licuadora (o una jarra alta si usa una batidora). Agregue el aceite y un poco de sal y blitz durante 1-2 minutos, o hasta que las cebolletas se corten tan pequeñas como sea posible.", "Para la panceta, coloque la sartén utilizada para las migas de pan a fuego medio y alto y agregue un poco de aceite. Agregue las rebanadas de panceta en una sola capa y fría por dos minutos en cada lado hasta que estén crujientes y doradas. Retire del fuego y transfiera la panceta a un plato forrado con una toalla de cocina para drenar. Si la sartén se ensucia completamente al freír la panceta, escurra la grasa residual y límpiela con papel de cocina. De lo contrario, deje la grasa en la sartén y reserve.", "Una vez que la coliflor esté cocida, escurra bien, transfiérala a una licuadora y mezcle hasta que esté realmente suave. Sazone al gusto con un poco de sal y pimienta. Deje de lado, manteniéndolo caliente.", "Regrese la sartén a fuego alto. Si ha tenido que drenar la grasa de pancetta, agregue más aceite. De lo contrario, deberías tener suficiente grasa allí para cocinar las vieiras. Seque las vieiras con papel de cocina y sazone a ambos lados con sal y pimienta. Agregue las vieiras a la sartén y cocínelas, sin moverlas, durante unos dos minutos.", "Mientras tanto, para evitar mover las vieiras, prepare cuatro platos calientes para servir. Coloque tres cucharadas de puré de coliflor caliente en línea recta en el centro de cada plato. Cuchara gotas o un garabato del aceite de cebollino sobre o alrededor para decorar. Espolvorea sobre las migas de pan.", "Las vieiras ahora deberían ser muy bonitas y marrones en sus fondos. Voltéelos y cocínelos por otros dos minutos. Coloque cada uno encima de cada cucharada del puré. Coloque cada pieza de panceta por la mitad y coloque una pieza apoyada contra cada una de las vieiras. Recorte las cebolletas reservadas y coloque dos pedazos encima o inclinados contra el festón mediano en cada plato y sirva."], "url": "www_bbc_co_uk_food_recipes_caramelised_scallops_on_73214", "title": "Vieiras caramelizadas en puré de coliflor con panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caramelised_scallops_on_73214_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de comino molido", "1 cucharada de jengibre molido", "1 cucharadita de chiles flies", "½ cucharada de sal masala", "½ cucharada de canela molida", "1 hombro de cordero en el hueso (alrededor de 1,8 kg / 4 lb)", "2 bulbos de ajo, partidos en clavos", "2 cebollas, descuartizadas", "20g / ¾oz de romero fresco", "25g / 1oz de azúcar moreno claro", "200 ml / 7 fl oz de aceite de girasol", "50ml / 2fl oz de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "2 cabezas de lechuga Little Gem", "50 g / 1¾oz de espinaca baby", "Frijoles verdes finos cortados 200 g / 7oz, recortados", "Mangetout 200g / 7oz", "50g / 1¾oz de berro"], "method": ["Mezcle todas las especias juntas y frote todo el cordero. Marinar en la nevera durante la noche para que el cordero tome todo el sabor de las especias.", "Al día siguiente, saca el cordero de la nevera y déjalo volver a la temperatura ambiente. Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Pon el ajo, las cebollas y el romero en una lata para asar. Coloque el cordero encima y tueste durante 2-2½ horas.", "Cuando la carne esté cocida y muy tierna, retírela del horno, cúbrala con papel de aluminio y déjela reposar de 10 a 15 minutos.", "Para las verduras, mezcle el aceite de girasol, el vinagre y la mostaza para crear una vinagreta.", "Separe las hojas de la lechuga Little Gem y ponga en un tazón con la espinaca baby.", "Ponga a hervir una olla de agua con sal. Agregue las judías verdes. Después de 2 minutos, agregue el mangetout y hierva por un minuto más.", "Escurra las verduras e inmediatamente agregue al recipiente que contiene la espinaca y la lechuga. Agregue el berro y mezcle suavemente en la vinagreta justo antes de servir.", "Una vez que la carne esté descansada, espolvorea el lado gordo del cordero con el azúcar moreno y, usando un soplete de chef (o debajo de una parrilla muy caliente), carameliza el azúcar y la grasa.", "Sirve el cordero con las verduras."], "url": "www_bbc_co_uk_food_recipes_caramelised_slow_cooked_87172", "title": "Caramelised, cordero cocido a fuego lento con verduras verdes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "1 manzana, pelada, sin corazón y cortada en cuñas", "2 cucharadas de miel clara", "200 g / 7 oz de azúcar en polvo", "100 g / 3½ oz de almendras, aproximadamente picadas", "2 rebanadas de brioche, a la parrilla", "azúcar glas, al polvo"], "method": ["Para las manzanas caramelizadas, derrita la mantequilla en una sartén, agregue las manzanas y la miel y saltee hasta que estén doradas.", "Para los quebradizos, coloque el azúcar en una sartén y déjelo derretir a fuego lento, sacudiendo la sartén de vez en cuando, pero sin remover. Cuando todo el azúcar se haya disuelto y el líquido se vuelva dorado, agregue las almendras y luego vierta sobre una estera antiadherente. Dejar enfriar y luego romper en pedazos.", "Para servir, coloque el brioche a la parrilla en un plato de servir y cubra con las manzanas caramelizadas y la almendra quebradiza. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_caramelisedappleanda_87364", "title": "Brioche con manzanas caramelizadas y almendras quebradizas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla", "2 cucharadas de azúcar en polvo", "3 manzanas, sin corazón, descuartizado", "½ limón, jugo y ralladura", "1 cucharadita de extracto de vainilla", "1 rebanada de pan crujiente blanco", "azúcar glas, al polvo", "2 yemas de huevo de pato", "2 cucharadas de azúcar en polvo", "1 cucharada de coñac", "2 cucharadas de agua", "helado de vainilla, para servir"], "method": ["Para las manzanas caramelizadas, coloque 70 g / 2½ oz de mantequilla y todo el azúcar en una sartén y caliente suavemente hasta que se derritan y se combinen.", "Agregue las manzanas y un chorrito de zumo de limón, vainilla y ralladura de limón y cocine suavemente durante cinco minutos, o hasta que las manzanas comiencen a dorarse. Apartar y mantener caliente.", "Derretir los 15 g / ½ oz restantes de mantequilla en una sartén pequeña y limpia, agregar la rebanada de pan y freír durante dos minutos por cada lado. Polvo con azúcar glas y freír por otro minuto en cada lado.", "Para el sabayon, coloque las yemas de huevo, el azúcar impalpable, el brandy y el agua en un tazón pequeño resistente al calor que se ajuste cómodamente sobre una fuente de agua hirviendo a fuego lento. Batir continuamente hasta que espese. Agregue más agua si la mezcla es demasiado espesa. Debe ser la consistencia de la crema doble.", "Para servir, coloca la tostada azucarada en la base de un plato y apila las manzanas en la parte superior. Cuchara en una cucharada de helado y vierta sobre el sabayon."], "url": "www_bbc_co_uk_food_recipes_caramelisedappleswit_86835", "title": "Manzanas caramelizadas con sabayón de huevo de pato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de azúcar en polvo", "30g / 1oz de mantequilla", "4 albaricoques, cortados a la mitad, piedras quitadas", "2 cucharadas de sultanas", "harina, para quitar el polvo", "100g / 3½oz de hojaldre listo para usar", "85g / 3oz de azúcar en polvo", "50g / 2oz de almendras enteras", "4 cucharadas de helado de vainilla, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la tarta tatin, caliente el azúcar en una sartén pequeña a prueba de horno a fuego lento hasta que se derrita.", "Agregue la mantequilla y el calor hasta que la mezcla tenga un color caramelo.", "Agregue las mitades de albaricoque con el lado cortado hacia arriba, esparza con las sultaninas y cocine suavemente durante 2-3 minutos, o hasta que se ablanden.", "Ruede los pasteles en una superficie ligeramente enharinada al grosor de una moneda de una libra.", "Recorta un círculo de hojaldre del mismo tamaño que la circunferencia de la sartén. Coloque la masa en la parte superior de los albaricoques y presione hacia abajo alrededor de los bordes para sellar el relleno.", "Transfiera al horno y hornee por 12-15 minutos, o hasta que la masa esté dorada en la parte superior. Retire del horno y deje enfriar un poco.", "Deslice una cuchilla de paleta alrededor del borde de la tarta, luego con cuidado, colóquela en un plato de servir.", "Para la almendra quebradiza, coloca el azúcar en una sartén antiadherente y calienta suavemente. Cuando el azúcar se haya derretido y esté comenzando a dar un color caramelo, agregue las almendras y revuelva bien para cubrirlas todas.", "Vierta sobre una estera antiadherente o bandeja para hornear y deje enfriar. Cuando esté frío, hazlo pedazos.", "Para servir, corte la tarta tatin en cuñas generosas y colóquela en platos para servir con una bola de helado y una pizca de almendra quebradiza."], "url": "www_bbc_co_uk_food_recipes_caramelisedapricotan_87073", "title": "Caramelo de albaricoque y sultana tarta tatin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 remolachas listas para cocinar, descuartizadas", "2 cucharadas de vinagre balsámico", "1 cucharadita de semillas de comino"], "method": ["Caliente el aceite de oliva en una sartén a fuego medio y cocine la remolacha durante 2-3 minutos.", "Agregue el vinagre balsámico y las semillas de comino, suba el fuego y cocine por 3-4 minutos, o hasta que el vinagre se haya reducido a la mitad y la remolacha esté caramelizada y pegajosa.", "Para servir, coloque la remolacha caramelizada en un plato."], "url": "www_bbc_co_uk_food_recipes_caramelisedbalsamicb_85192", "title": "Remolacha balsámica caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Azúcar en polvo de 55 g / 2 oz", "½ cucharadita de esencia de vainilla", "1-2 cucharadas de agua caliente", "2 plátanos, pelados y en rodajas", "botón de mantequilla", "doble crema"], "method": ["Caliente el azúcar, la esencia de vainilla y el agua en una sartén, hasta que se forme un caramelo.", "Agregue las rodajas de plátano a la sartén, agitando para cubrir.", "Agregue la mantequilla a la sartén y caliente por otros 1-2 minutos.", "Transfiera los plátanos caramelizados a un plato para servir, y rocíe con crema para servir."], "url": "www_bbc_co_uk_food_recipes_caramelisedbananas_76757", "title": "Plátanos caramelizados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de azúcar moreno", "½ manzana Bramley, sin núcleo", "½ botella de brandy en miniatura", "Crema doble 50ml / 2fl oz"], "method": ["Caliente el azúcar en una sartén hasta que se derrita y burbujee, luego agregue la manzana, con el lado del corte hacia abajo.", "Permita que el azúcar comience a caramelizar, luego agregue el brandy y la crema, revolviendo un poco para cubrir la manzana.", "Hervir la salsa durante 2-3 minutos, o hasta que espese, luego retirar del fuego.", "Para servir, coloque la manzana cortada en un plato y vierta sobre la salsa de brandy."], "url": "www_bbc_co_uk_food_recipes_caramelisedbrandywit_84166", "title": "Manzana caramelizada con salsa de brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]