[{"ingredients": ["2 papas para hornear grandes", "sal y pimienta negra recién molida", "110g / 4oz de queso Lincolnshire Poacher, cortado en cubos pequeños", "Harina normal de 50g / 2oz", "2 huevos de gallinas camperas, golpeados", "50g / 2oz de pan rallado fresco", "aceite vegetal, para freír", "4 tomates de ciruela, toscamente picados", "1 cebolla roja, finamente picada", "1 cucharada de alcaparras", "puñado de perejil, toscamente picado", "2 cucharadas de vinagre de vino tinto", "4 cucharadas de aceite de colza", "sal y pimienta negra recién molida", "75g / 3oz de hojas de ensalada mixtas"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para las croquetas, pique las papas con un tenedor y póngalas en el horno durante una hora o hasta que estén tiernas.", "Coloque la carne de papa en un recipiente, descartando las pieles. Mash con un triturador de patata hasta que quede suave y sazone, al gusto, con sal y pimienta negra recién molida. Dejar de lado para enfriar.", "Tome un trozo de queso y moldee un poco de la patata alrededor, presionando firmemente en forma de salchicha. Repita con el queso y la papa restantes.", "Saque las salchichas de la papa en la harina, luego sumérjalas en el huevo batido y luego en las migas de pan para cubrirlas. Coloque en la nevera para establecer durante 30 minutos.", "Coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se deje caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Retire las croquetas de la nevera y coloque cuidadosamente en el aceite caliente. Freír a fuego lento durante 2-3 minutos, o hasta que estén dorados y crujientes por fuera y derritiéndolos por dentro. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la ensalada, coloque los tomates, la cebolla roja, las alcaparras y el perejil en un bol y revuelva.", "En un tazón pequeño, mezcle el vinagre y el aceite y sazone, al gusto, con sal y pimienta negra recién molida.", "Vierta dos tercios del aderezo sobre la ensalada de tomate y mezcle bien. En otro tazón, mezcle las hojas de ensalada con el aderezo restante.", "Para servir, coloque las croquetas en platos para servir con las ensaladas de tomate y hojas."], "url": "www_bbc_co_uk_food_recipes_lincolnshirepoacherc_86700", "title": "Croquetas de queso y patata Lincolnshire Poacher con ensalada de tomate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["7 cucharadas de harina de maíz", "1 litro / 1¾ pintas de leche de almendras (sin azúcar añadido, si es posible)", "5 cucharadas de azúcar en polvo", "2 cucharaditas de esencia de vainilla", "2 cucharadas de agua de rosas", "2 vainas completas de cardamomo", "2 cucharadas de pistachos o almendras, molidas gruesas", "1 cucharada de cardamomo finamente molida"], "method": ["Batir la harina de maíz con un poco de la leche de almendras en una pasta suave. Dejar de lado.", "En una sartén, caliente la leche de almendras restante con el azúcar, esencia de vainilla, agua de rosas y cápsulas de cardamomo a fuego medio, revolviendo hasta que se mezcle bien.", "Una vez que la mezcla se haya calentado, deseche las vainas de cardamomo, luego vierta la pasta de harina de maíz y bata vigorosamente hasta que la mezcla esté suave y espesada hasta obtener una consistencia casi similar a la de las natillas. esto llevará de 10 a 15 minutos. Tenga cuidado de no dejar que la mezcla se adhiera al fondo de la sartén.", "Vierta la mezcla en platos individuales o en un tazón grande y decore con una pizca de pistachos molidos o almendras y el cardamomo molido. Dejar enfriar, cubrir y enfriar en la nevera durante al menos 15 minutos. Servir frío."], "url": "www_bbc_co_uk_food_recipes_lindas_muhallabi_milk_08578", "title": "Muhallabi (pudín de leche de almendras)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lindas_muhallabi_milk_08578_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina 400g / 14oz '00', más extra para quitar el polvo", "5 huevos de gallinas camperas, ligeramente golpeados", "pizca de sal", "2 cucharadas de aceite de oliva virgen extra", "1-2 cucharadas de agua fría", "4 cangrejos vivos enteros (800-900g / 1lb 12oz-2lb cada uno)", "1 puerro, reducido a la mitad", "algunas ramitas de perejil fresco", "500ml / 18fl oz de vino blanco", "5 dientes de ajo enteros", "85g / 3oz de pesto", "4 cucharadas de aceite de oliva", "3 dientes de ajo, finamente picados", "1 cucharadita de chile rojo finamente picado", "4 calabacines, finamente cortados en cubitos", "1 cucharada de perejil fresco finamente picado", "Linguine 400 g / 14oz, de la receta anterior"], "method": ["Para el linguini, ponga la harina en una superficie de trabajo, haga un pozo en el centro y agregue los huevos batidos, la sal y el aceite. Con las yemas de los dedos en un movimiento circular, incorpore lentamente la harina en la mezcla de huevo, agregando un poco de agua si es necesario, para formar una masa.", "Amasar durante 5 minutos, hasta que la masa sea elástica y salte cuando se presione suavemente. Cubra con película adhesiva y deje reposar por lo menos 30 minutos en la nevera.", "Extienda la masa de pasta en 4-6 lotes usando una máquina de pasta que funcione desde la configuración más gruesa hasta la penúltima, permitiendo que las hojas se sequen durante 10 minutos sin cortar. Pase las hojas enrolladas a través del cortador de linguetes en la máquina y cuelgue el linguini sobre un perchero o similar al aire mientras cocina la salsa.", "Para la salsa, ponga el puerro, las ramitas de perejil, 300 ml / 10 fl oz del vino, 5 dientes de ajo enteros en una olla grande con suficiente agua para cubrir los cangrejos. Llevar a ebullición, agregar los cangrejos y cocinar durante unos 6 minutos.", "Retire los cangrejos del agua caliente y colóquelos inmediatamente en agua helada. Cuando los cangrejos estén fríos, quite la carne de cada uno. Abra el cuerpo, retire toda la carne marrón y reserve. Retire la carne blanca de las patas delgadas, pero deje las garras. Mezcle la carne blanca y la morena juntas. Rompe las garras pero deja todo. Coloque las pinzas en una fuente para hornear, vierta sobre el pesto y deje que se macere. Limpia las conchas de cangrejo.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente el aceite de oliva en una olla grande, agregue el ajo picado, el chile, la carne de cangrejo marrón y blanca, los calabacines y el perejil picado. Freír por 1 minuto y luego agregar el vino restante. Cuando la salsa haya burbujeado y espesado, retírela de la estufa.", "Hornee las pinzas de cangrejo marinado en el horno durante 2 minutos para calentarlas.", "Mientras tanto, ponga a hervir un sartén grande de agua con sal y cocine el linguine fresco durante 2-3 minutos, escurra y agregue a la salsa. Mezcle y sirva inmediatamente.", "Presente el plato con el linguini y la salsa en un plato de pasta calentado con una uña de cangrejo en la parte superior."], "url": "www_bbc_co_uk_food_recipes_linguine_with_fresh_crab_02642", "title": "Linguine con cangrejo fresco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones 500g / 1lb 2oz", "250g / 9oz de gambas crudas enteras", "6 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "½ chile rojo, finamente cortado", "50ml / 2fl oz de vino blanco", "1 limón, solo jugo", "perejil pequeño de hojaldre, toscamente picado", "Linguine 400g / 14oz", "sal y pimienta negra recién molida"], "method": ["Limpie los mejillones frotándolos con agua fría y quitándoselos. Si quedan algunos abiertos después de tocarlos contra el costado de la superficie de trabajo, deséchelos. Pele las gambas, quitando las cabezas pero dejando las colas intactas.", "Caliente el aceite de oliva en una olla grande con tapa y agregue el ajo y el chile. Después de un minuto o dos, agregue los mejillones y el vino. Cubra con la tapa y continúe cocinando por 1-2 minutos, o hasta que los mejillones se abran. Si algún mejillón permanece cerrado al finalizar la cocción, deséchelo.", "Agregue las gambas y cocine durante 4-5 minutos más, luego exprima el jugo de limón. Retire la sartén del fuego y agregue el perejil picado. Sazone al gusto con sal y pimienta negra recién molida.", "Mientras tanto, cocine el linguine en agua hirviendo con sal durante 7-8 minutos o hasta que esté al dente. Agregue la pasta a la sartén con la salsa de mariscos, mezcle bien y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_linguine_with_prawns_and_29068", "title": "Linguini con gambas y mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/linguine_with_prawns_and_29068_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla", "4 lonjas de tocino, picadas", "1 diente de ajo, finamente picado", "5 cucharadas de crema doble", "100 g / 3½ oz de linguine fresco, cocido de acuerdo con las instrucciones del paquete y escurrido", "1 yema de huevo de gallinas camperas", "1 cucharada de perejil fresco picado", "1 cucharada de albahaca fresca picada"], "method": ["Calentar la mantequilla en una sartén y freír el tocino hasta que se dore. Agregue el ajo y cocine por un minuto.", "Agregue la crema doble y deje que hierva.", "Retire del fuego e inmediatamente agregue el linguini tibio y la yema de huevo. Revuelva para cubrir la pasta.", "Para servir, espolvorea sobre las hierbas picadas y coloca la pasta en un plato para servir."], "url": "www_bbc_co_uk_food_recipes_linguineallacarbonar_85503", "title": "Linguine con carbonara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ berenjena, picada", "3 huevos de gallinas camperas, golpeados", "100g / 3½oz de queso de cabra, desmenuzado", "3 cucharadas de perejil fresco picado", "½ cucharadita de copos de chile", "sal y pimienta negra recién molida", "150 g / 5½ oz de linguine, cocinado según las instrucciones del paquete"], "method": ["Calentar la mitad del aceite en una sartén y freír la berenjena picada durante 5-6 minutos, o hasta que se ablanden.", "En un tazón grande, combine los huevos batidos, el queso de cabra, el perejil picado, los copos de chile, la sal y la pimienta negra recién molida y luego agregue la pasta cocida. Agregue la berenjena frita y mezcle bien.", "Caliente el aceite restante en una sartén pequeña e incline la mezcla de pasta. Deje que se cocine durante 3-4 minutos, o hasta que el fondo esté dorado y listo, luego gire cuidadosamente la tortilla de pasta para cocinar el otro lado durante 3-4 minutos o hasta que se dore y se ponga.", "Para servir, deslice sobre un plato de servir y corte en rodajas."], "url": "www_bbc_co_uk_food_recipes_linguineomelettewith_89109", "title": "Tortilla de linguini con queso de cabra y berenjena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["puñado de hojas de albahaca fresca", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 chile rojo, finamente picado", "2 dientes de ajo, finamente picados", "½ limón, solo jugo", "pequeñas hojas de albahaca fresca picada", "200 g / 7 oz de linguine fresco, cocido de acuerdo con las instrucciones del paquete y escurrido"], "method": ["Para la pasta de albahaca, coloque la albahaca y el aceite de oliva en un procesador de alimentos pequeño, sazone con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "Para el linguini, caliente el aceite en una sartén y fríe con cuidado la guindilla y el ajo durante 1-2 minutos.", "Agregue el jugo de limón, las hojas de albahaca picadas y el linguini cocido y mezcle bien para cubrir la pasta.", "Para servir, coloque el linguini en un plato para servir y cubra con una cucharada de pasta de albahaca."], "url": "www_bbc_co_uk_food_recipes_linguinewithchillile_85502", "title": "Linguine con chile, limón y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de linguini seco", "15ml-1 cucharada de aceite de chile", "2 dientes de ajo picados", "1 chile rojo grande, finamente picado", "2 cucharadas de perejil de hoja plana, picado", "Carne de cangrejo blanca de la lata 170g / 6oz", "jugo de 1 limón", "30-45 ml / 2-3 cucharadas de aceite de oliva"], "method": ["Coloque el linguini en una olla de agua hirviendo con sal.", "Caliente el aceite de chile en una olla pequeña, agregue el ajo, el chile, el perejil y la carne de cangrejo y cocine suavemente durante unos minutos.", "Agregue el jugo de limón y el aceite de oliva.", "Escurra la pasta y revuelva a través de la salsa de chile cangrejo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_linguinewithchillicr_7294", "title": "Linguine con cangrejo de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "100g / 3½oz de panceta o tocino rayado, picado", "¼ de cebolla picada", "½ cabeza de brócoli, cortada en florecillas", "1 cucharadita de hojuelas de chile", "5 cucharadas de vino blanco", "200g / 7oz de tomates cherry enlatados", "sal y pimienta negra recién molida", "Linguine 250g / 9oz, cocinado según las instrucciones del paquete y escurrido"], "method": ["Calentar el aceite en una sartén antiadherente y freír la panceta o el tocino hasta que estén crujientes.", "Agregue la cebolla y fría hasta que se ablande.", "Agregue el brócoli, los copos de chile y el vino blanco y cocine a fuego lento hasta que el vino se haya reducido a la mitad.", "Agregue los tomates cherry y cocine a fuego lento durante 3-4 minutos adicionales, o hasta que el brócoli esté tierno y la salsa se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida. Agregue la pasta a la sartén y revuelva para cubrir con la salsa.", "Para servir, coloca la pasta en platos para servir."], "url": "www_bbc_co_uk_food_recipes_linguinewithpancetta_86108", "title": "Linguine con panceta, brócoli y tomates cherry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de linguine, cocinado de acuerdo con las instrucciones del paquete", "2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "3 cebollas de primavera, picadas", "1 puñado de hojas de menta fresca, muy finamente picada", "1 puñado de hojas frescas de albahaca, muy finamente picadas", "1 diente de ajo, picado", "50ml / 1¾fl oz de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una sartén a fuego medio. Agregue el ajo y la cebolleta y fríe durante tres minutos, hasta que se ablanden.", "Agregue el linguini cocido y revuelva bien para que se caliente.", "Para el pesto, coloca la menta, la albahaca, el ajo y el aceite en un bol y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el linguini en un plato y espolvoree el pesto."], "url": "www_bbc_co_uk_food_recipes_linguinewithpesto_84898", "title": "Linguine con pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 higos frescos grandes", "8 rebanadas de jamón serrano o mota", "2 chalotes, pelados y picados", "2 dientes de ajo, pelados y picados", "1 cucharada de aceite de oliva, más extra para cocinar pasta", "100ml / 3fl oz de vino blanco", "200g / 7oz de queso dolcelatte", "300 ml / 10 fl oz doble crema", "sal y pimienta negra recién molida", "2 ramitas grandes de menta fresca, picadas", "15g / ½ oz de albahaca fresca, picada", "15g / ½ oz de cebollín fresco, picado", "40 g / 1 oz de queso parmesano, afeitado", "Linguine 400g / 14oz"], "method": ["Precalentar el horno a 230C / 450F / Gas 8.", "Envuelva cada higo en dos rebanadas de jamón serrano o tocino y asegúrelo con palitos de cóctel de madera.", "Hornee en el horno durante unos 5-6 minutos, hasta que el tocino esté bien crujiente.", "Mientras tanto, sudar los chalotes y el ajo en una cucharada de aceite de oliva durante unos minutos, luego agregue el vino blanco.", "Hierva a reducir a la mitad, luego agregue el queso y la crema de dolcelatte. Reduzca hasta que espese un poco, pero no hierva o la mezcla se dividirá debido a la grasa en el queso.", "Sazone con sal y pimienta y agregue algunas de las hierbas, reservando el resto de las hierbas para más adelante.", "Cocine la pasta en una cantidad generosa de agua salada hirviendo, con un poco de aceite de oliva, de acuerdo con las instrucciones del paquete (generalmente de 6 a 8 minutos para el linguini). Escurrirlo bien.", "Combine la pasta drenada con la salsa y divídala entre cuatro platos para servir.", "Retire los palitos de cóctel de los higos envueltos y coloque una figura envuelta en la parte superior de cada plato de pasta.", "Adorne con las virutas de parmesano y las hierbas frescas restantes."], "url": "www_bbc_co_uk_food_recipes_linguinewithroastedf_79285", "title": "Linguine con higos asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "1 cucharadita de curry en polvo", "6 tomates cherry, cortados por la mitad", "½ cabeza de brócoli, cortada en florecillas", "salpicar vino blanco", "salpicar agua hirviendo", "sal y pimienta negra recién molida", "100 g / 3½ oz de linguine"], "method": ["Caliente el aceite de oliva en una cacerola, agregue la cebolla y fría por 2-3 minutos, o hasta que se ablanden pero no se coloreen. Agregue el ajo y el polvo de curry y fría por un minuto, luego mezcle los tomates cherry y cocínelos durante 4-5 minutos, o hasta que se ablanden.", "Agregue los brotes de brócoli, un poco de vino blanco y un chorro de agua hirviendo y cocine a fuego lento durante 3-4 minutos, o hasta que el brócoli esté tierno. Sazonar con sal y pimienta negra recién molida.", "Cocine el linguini, de acuerdo con las instrucciones del paquete, luego drene. Agregue el linguini cocido a la salsa y mezcle bien para cubrir.", "Coloque el linguini en un tazón y sirva."], "url": "www_bbc_co_uk_food_recipes_linguinewithspicytom_88952", "title": "Linguine con tomates picantes y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["375g / 13oz de linguini seco", "4 cucharadas de aceite de oliva virgen extra", "3 cucharadas de perejil finamente picado", "2 dientes de ajo, finamente picados", "1 guindilla pequeña, finamente picada", "1cm / ½ en raíz de jengibre fresco, en rodajas finas", "Passata de cartón o botella de 450g / 1lb", "400 g de estaño de atún en aceite, escurrido y toscamente picado", "sal y pimienta negra recién molida"], "method": ["Cocine la pasta durante 8-10 minutos o hasta que esté al dente, y escurra.", "Mientras tanto, caliente el aceite y fríe 2 cucharadas de perejil, el ajo, el chile y el jengibre durante unos minutos hasta que estén ligeramente suaves. Agregue los tomates y continúe cocinando por unos minutos más. Agregue el atún y la sal.", "Mezcle la pasta con la salsa y sirva espolvoreada con el perejil restante y la pimienta recién molida."], "url": "www_bbc_co_uk_food_recipes_linguinewithtunafish_70041", "title": "Salsa de pasta de atún con linguini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/linguinewithtunafish_70041_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Linguini 200 g / 7oz", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "250 g / 9 oz de almejas frescas, limpiadas", "100ml / 3½fl oz de vino blanco", "100g / 3½oz de hojas de espinaca baby", "1 cucharada de perejil fresco picado"], "method": ["Cocine el linguini en agua hirviendo con sal hasta que esté al dente. Escurrir y apartar.", "Caliente el aceite de oliva en una cacerola mediana, agregue el ajo y cocine suavemente hasta que se ablande.", "Agregue las almejas y el vino blanco, cubra con una tapa y cocine durante dos minutos.", "Agregue la espinaca y cocine, tapado, por un minuto.", "Agregue el linguini a las almejas, revuelva bien y sirva en tazones grandes con perejil picado para decorar."], "url": "www_bbc_co_uk_food_recipes_linguinivongolewiths_81821", "title": "Linguini vongole con espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "pellizcar canela molida", "pellizcar clavos de tierra", "40 g / 1½ oz de azúcar en polvo", "115g / 4oz de mantequilla sin sal ablandada", "2 yemas de huevo de gallinas camperas", "Mermelada de albaricoque 400 g / 14 oz", "Mermelada de frambuesa 400 g / 14 oz", "½ limón, ralladura y jugo", "8-12 almendras blanqueadas enteras", "1-2 cucharadas de azúcar glas", "100g / 3½ oz de crema"], "method": ["Para la masa, coloque la harina, las especias y el azúcar en un tazón. Frote la mantequilla, luego agregue las yemas de huevo y junte la masa. Envuelva en film transparente y relájese durante una hora.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Reserve aproximadamente un tercio de la masa fría para hacer una tapa de celosía. En una superficie de trabajo ligeramente enharinada, extienda la masa restante al grosor de una moneda de una libra y forre una lata de 23-25 ​​cm / 9-10 en tarta. Haga una celosía desplegando la masa reservada y cortándola en cintas de 25cm / 10 pulgadas. Tejer las cintas de repostería juntas dejando espacios iguales entre cada cinta (por lo que los cuadrados de atasco serán visibles entre los pasteles).", "Llene la caja de pastelería con mermelada de albaricoque y coloque la rejilla en la parte superior. Recorta los bordes con un cuchillo.", "Mezcle la mermelada de frambuesa con la ralladura de limón y el jugo y transfiera a una manga pastelera equipada con una boquilla simple (alternativamente coloque en una bolsa pequeña para alimentos y recorta una esquina). Pipe la mermelada en cuadrados alternos de la tapa de celosía. Pon una almendra encima de cada cuadrado lleno de mermelada.", "Hornee por 25-30 minutos, o hasta que la masa esté crujiente y dorada. Dejar enfriar en la lata.", "Para servir, espolvorear la torta con azúcar glas, cortar en rodajas y con una cucharada de crème fraîche al lado."], "url": "www_bbc_co_uk_food_recipes_linzer_torte_with_crme_27127", "title": "Tarta de Linzer con crema fresca", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 torta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 600g / 1lb 5oz", "sal y pimienta negra recién molida", "4,5 kg / 10 lb de hígado de cordero, en rodajas", "300 ml / 10 fl oz de aceite de girasol", "10 cebollas en rodajas", "Lonchas de tocino deshilachadas sin corteza de 1,25 kg / 2 lb 12 oz, cada una cortada en 4-5 piezas", "3.6 litros / 10 pintas de caldo de carne", "4 cucharadas de ketchup de tomate"], "method": ["Ponga 400 g / 14 oz de la harina en un tazón grande y sazone con sal y pimienta negra recién molida.", "Calienta la mitad del aceite en una sartén grande a fuego alto.", "Cubra el hígado con la harina sazonada, sacuda el exceso y luego fríe cada rebanada en la grasa caliente durante 1-2 minutos por cada lado hasta que se dore ligeramente, pero no completamente cocido.", "Transfiera las rebanadas a un plato y repita con el resto del hígado.", "Reduzca el fuego, agregue el resto del aceite y la cebolla en rodajas y cocine por un minuto más o menos, revolviendo ocasionalmente.", "Agregue el tocino a la sartén y cocínelo durante 8-10 minutos o hasta que la cebolla esté pálida dorada y el tocino comience a crujiente.", "Espolvorea el resto de la harina sobre la cebolla y el tocino y revuelve por un minuto más o menos. Agregue el caldo, cocine a fuego lento y cocine a fuego medio hasta que la salsa se espese. Agregue el ketchup de tomate y sazone con sal y pimienta negra recién molida.", "Regrese el hígado a la sartén con la salsa de cebolla por solo 1-2 minutos para calentarlo y terminar de cocinar."], "url": "www_bbc_co_uk_food_recipes_liver_and_bacon_with_30933", "title": "Hígado y tocino con cebolla y salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de carne picada 2 oz", "4 dientes de ajo, finamente picados", "2 cucharadas de jengibre fresco rallado", "2 cebollas tiernas, finamente picadas", "Una pizca de sal marina", "1 cucharada de vino de arroz Shaoxing o jerez seco (o más, al gusto)", "2 cucharadas de salsa de soja ligera", "1 cucharada de aceite de sésamo tostado", "1 huevo de gallinas camperas, golpeado", "1 cucharada de harina de maíz", "pizca de pimienta blanca molida", "100 ml / 3½ fl oz aceite de cacahuete", "750ml / 1¼ pinta de caldo de verduras", "Hoja china de 300g / 11oz, cuarteada longitudinalmente", "3 hongos chinos secos, remojados en agua tibia durante 15 minutos, luego escurridos (uso alternativo de champiñones frescos de castaña, en rodajas)", "1 cucharada de salsa de soja ligera", "1 cucharada de harina de maíz, mezclada con 2 cucharadas de agua fría (opcional)", "sal marina y pimienta blanca molida", "2 cebollas de primavera grandes, en rodajas", "guión de aceite de sésamo (opcional)"], "method": ["Para las albóndigas, coloque todos los ingredientes de la albóndiga en un tazón grande y revuelva para combinar.", "Con las manos húmedas, toma un gran montículo de la mezcla de carne picada y moldea en una bola que es un poco más grande que una pelota de golf. Coloque en un plato y repita con la mezcla restante de albóndiga.", "Para el plato terminado, vierta el aceite de cacahuete en una sartén profunda grande y caliente a fuego alto. Con un cucharón de metal, cuidadosamente baje cada albóndiga en el aceite y cuchara un poco de aceite sobre las albóndigas. Cocine por 4-5 minutos, o hasta que se dore por todas partes.", "Vierta todas menos dos cucharadas de aceite de cocina en un recipiente resistente al calor. Agregue el caldo a la sartén y coloque las rodajas de repollo chino alrededor de las albóndigas, curvándolas alrededor de los lados de la sartén longitudinalmente, luego agregue los champiñones y la salsa de soja y deje que hierva. Cubra la sartén, reduzca el fuego y cocine suavemente durante 15 minutos. Alternativamente, cocine las albóndigas en el horno; coloque en una cazuela, cubra con papel de cocina y cocine en un horno precalentado a 100 ° C / 210 ° F / Gas ¼ por 30 minutos. Si la salsa es demasiado fina, agregue la pasta de harina de maíz y revuelva hasta que espese.", "Quite las albóndigas del fuego y condimente, al gusto, con sal marina y pimienta blanca molida. Transferir a un plato de servir, decorar con cebolletas, espolvorear con una pizca de aceite de mar y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lionheadmeatballs_89292", "title": "Albóndigas de \"cabeza de león\"", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lionheadmeatballs_89292_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de macarrones 340g / 12oz", "1 lata grande de salmón rojo", "puñado de albahaca", "Passata de 250 ml / 9 fl oz (tomates tamizados)", "3 cucharadas de mascarpone", "85g / 3oz de pan rallado", "140 g / 5 oz de mozzarella fresca", "30g / 1oz de piñones", "30g / 1oz de mantequilla", "200 g / 7oz bolsa hojas de ensalada mixtas", "aceite de oliva virgen", "vinagre balsámico", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno 190C / 375F / Gas 5.", "Cocine la pasta en abundante agua salada hirviendo según las instrucciones.", "Coloque el salmón en un recipiente, eliminando los huesos grandes.", "Rasgue las hojas de albahaca y combine con el salmón. Agregue la passata, mascarpone y mozzarella.", "Escurrir la pasta y combinar con la mezcla de salmón.", "Sazonar bien y colocar en un plato a prueba de horno.", "Cubra con puntos de mantequilla y espolvorear sobre pan rallado y piñones.", "Coloque en el horno para colorear la parte superior y calentar.", "Sirva con algunas hojas de ensalada vestidas con aceite de oliva, vinagre balsámico y condimentos."], "url": "www_bbc_co_uk_food_recipes_littleitalypastabake_14520", "title": "Pasta cremosa de salmón hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/littleitalypastabake_14520_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["11 cucharaditas de aceite de oliva o mantequilla, para forrar la bandeja del panecillo", "12 lonchas finas de jamón de buena calidad", "12 huevos grandes, preferiblemente de campo abierto", "2 cucharadas de crema", "sal marina", "pimienta negra recién molida", "4 cucharadas de parmesano recién rallado"], "method": ["Caliente el horno a 180C / 350F / Gas 4.", "Ligeramente aceite o mantequilla una bandeja para muffins de 12 hoyos. Alinee la base y la mayoría de los lados de cada molde con una loncha de jamón, luego rompa un huevo en el hueco. Rocíe con la crema y espolvoree con sal marina, pimienta y parmesano.", "Hornee de 15 a 20 minutos hasta que el huevo esté listo y comience a encogerse a los lados de la lata.", "Deje que se enfríe durante 5 minutos, luego pase un cuchillo por cada molde para aflojar el jamón y el huevo y retire a una bandeja de alambre. Coma tibio o a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_littleeggandhampies_13893", "title": "Pequeños pasteles de huevo y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1lb de hígado de cordero, en rodajas y totalmente descongelado si está congelado", "25g / 1oz de mantequilla", "2 cucharadas de aceite de girasol", "4 cucharadas de harina normal", "1 cebolla, cortada a la mitad longitudinalmente y en rodajas", "Lonchas de tocino rayado sin corteza 125g / 4½oz, cada una cortada en 4-5 piezas", "1 cubo de caldo de carne", "500ml / 18fl oz de agua recién hervida", "1-2 cucharaditas de ketchup de tomate", "sal y pimienta negra recién molida"], "method": ["Enjuague el hígado en un colador con agua fría y escurra bien sobre papel de cocina. Derretir la mitad de la mantequilla con el aceite en una sartén antiadherente grande a fuego alto.", "Ponga tres cucharadas de harina en un tazón grande y sazone con sal y pimienta negra recién molida.", "Cubra la mitad del hígado en la harina sazonada, sacuda el exceso, luego fríe cada rebanada en la grasa caliente durante 1-2 minutos en cada lado hasta que se dore ligeramente, pero no completamente cocido.", "Transfiera las rebanadas a un plato y repita con el resto del hígado.", "Reduzca el fuego y derrita la mantequilla restante en la misma sartén. Agregue la cebolla en rodajas y cocine por un minuto más o menos, revolviendo para separar las capas.", "Agregue el tocino a la sartén y cocine, revolviendo de vez en cuando, durante 8-10 minutos o hasta que la cebolla esté pálida dorada y el tocino esté comenzando a crujiente.", "Espolvorea el resto de la harina sobre la cebolla y el tocino y revuelve por un minuto más o menos.", "Disuelva el cubo en el agua recién hervida y vierta lentamente en la sartén, revolviendo constantemente.", "Deje que hierva a fuego lento y cocine a fuego medio hasta que la salsa se espese. Agregue una pizca de ketchup de tomate y sazone con sal y pimienta negra recién molida.", "Regrese el hígado a la sartén con la salsa de cebolla por solo 1-2 minutos para calentarlo y terminar de cocinar.", "Sirva el hígado y el tocino con puré y verduras recién cocidas."], "url": "www_bbc_co_uk_food_recipes_liver_and_bacon_with_94841", "title": "Hígado y tocino con cebolla y salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/liver_and_bacon_with_94841_16x9.jpg", "isVegetarian": false, "recommendations": 0}]