[{"isVegetarian": false, "title": "Pato al estilo asiático glaseado con ciruela y soja", "url": "www_bbc_co_uk_food_recipes_asianstyleduckglazed_85265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pechuga de pato, con la piel puesta", "sal y pimienta negra recién molida", "1 cucharada de miel", "2 cucharadas de salsa de soja", "1 cucharadita de aceite de sésamo", "1 ciruela, piedra removida, picada", "pizca de copos de chile seco", "2 lechugas Little Gem, hojas separadas", "½ patata, pelada, cortada en cubos de 1cm / ½ en cubos, hervida hasta que esté tierna y escurrida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Marque la piel de la pechuga de pato con un cuchillo afilado y sazone con sal y pimienta negra recién molida.", "Coloque el pechuga de pato con la piel hacia abajo en una sartén fría. Encienda el fuego y lleve a fuego medio, esto permitirá que la grasa se rinda. Freír el pato durante 10-12 minutos, drenando la grasa en un tazón de vez en cuando.", "Voltea la pechuga de pato. Agregue la miel, la salsa de soja, el aceite de sésamo, la ciruela y el chile a la sartén y cocine a fuego lento hasta que esté ligeramente reducido, agregando un chorrito de agua si es necesario. Cocine la pechuga de pato durante otros 2-4 minutos o hasta que esté cocida a su gusto.", "Para servir, coloque la lechuga y la papa en un plato, cubra con la pechuga de pato y rocíe sobre los jugos de la sartén."]}, {"isVegetarian": false, "title": "Sopa de pescado al estilo asiático", "url": "www_bbc_co_uk_food_recipes_asianstylefishsoup_84858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cabeza de lubina", "1 cola de lubina", "300ml / ½ litro de caldo de verduras calientes", "50g / 1¾oz de espárragos picados", "Tomates 50g / 1¾oz, picados", "1 cucharadita de salsa de soja", "1 cucharadita de aceite de sésamo", "100 g / 3½ oz de champiñones shiitake picados", "½ lima, solo jugo", "pizca de copos de chile seco"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la cabeza y la cola de pescado en una olla junto con el caldo de verduras, deje que hierva y cocine a fuego lento durante 5-6 minutos.", "Agregue los ingredientes restantes a la sartén y cocine a fuego lento durante 10-12 minutos, o hasta que los vegetales estén tiernos.", "Para servir, quite la cabeza y la cola del pescado de la sopa y deséchelo. Vierta la sopa en un recipiente caliente."]}, {"isVegetarian": false, "title": "Pato agridulce asiático con salteado de brócoli y ciruela", "url": "www_bbc_co_uk_food_recipes_asiansweetandsourduc_89460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pechuga de pato, con la piel puesta", "1 cucharada de salsa de soja", "1 cucharada de jarabe de arce", "2 cucharadas de miel", "2 cucharadas de vino tinto", "1 cucharadita de aceite de sésamo", "1 cucharada de harina de maíz mezclada con un chorrito de agua fría", "1 cucharada de aceite de oliva", "1 cucharada de aceite de sésamo", "½ cebolla roja, en rodajas", "½ cabeza de brócoli, cortada en florecillas", "1 cucharada de semillas de sésamo", "1 cucharada de aceite de sésamo", "¼ de cebolla roja, finamente picada", "1 naranja, ralladura y jugo", "1 ciruela, piedra removida, picada", "1 cucharada de salsa de soja", "2 cucharadas de cilantro fresco, solo hojas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pato agridulce, coloque la pechuga de pato, con la piel hacia abajo, en una sartén fría a prueba de horno y fría a fuego medio.", "Cuando el pato comience a chisporrotear, agregue los ingredientes restantes del pato agridulce, excepto la harina de maíz y el agua, y transfiera la sartén al horno para asar durante 7-8 minutos o hasta que esté cocida a su gusto.", "Retire la sartén del horno y coloque el pato a un lado en un plato caliente para descansar.", "Agregue la mezcla de harina de maíz a la misma sartén y cocine a fuego lento, revolviendo los jugos en la sartén hasta que se espese.", "Para el brócoli salteado, caliente el aceite de oliva y el aceite de sésamo en una sartén a fuego medio, luego agregue la cebolla y el brócoli y saltee durante 4-5 minutos. Agregue las semillas de sésamo.", "Para la salsa de ciruela, mezcle todos los ingredientes en un tazón.", "Para servir, espolvoree el brócoli en un plato para servir. Corta el pato en tres pedazos y colócalo encima del brócoli. Vierta la salsa de pato agridulce sobre el pato, luego rocíe la salsa de ciruela alrededor del borde del plato."]}, {"isVegetarian": true, "title": "Tortilla de estilo asiático con fideos crujientes y pimientos pegajosos", "url": "www_bbc_co_uk_food_recipes_asianstyleomelettewi_88637", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g / 3oz de fideos de arroz", "1 lima, jugo y ralladura solamente", "2 cucharadas de salsa de soja", "2 cucharadas de menta fresca picada", "2 cucharadas de cilantro fresco picado", "3 huevos de gallinas camperas", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "Fideos de arroz de 55 g / 2 oz, sin cocer", "aceite vegetal, para freír", "2 cucharadas de aceite de oliva", "1 pimiento amarillo, en rodajas", "1 guindilla Scotch roja, finamente rebanada", "1 diente de ajo, finamente picado", "2 cucharadas de azúcar en polvo", "1 cucharadita de vinagre de vino blanco"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la tortilla, cocine los fideos de arroz de acuerdo con las instrucciones del paquete y refresque con agua fría. Escurrir, luego colocar en un recipiente.", "Agregue el jugo de limón y la ralladura, una cucharada de salsa de soja y toda la menta y el cilantro al bol. Revuelva bien.", "En otro tazón, bata los huevos con la cucharada restante de salsa de soja y sazone con sal y pimienta negra recién molida.", "Caliente el aceite vegetal en una sartén y vierta los huevos. Cocine suavemente hasta que los huevos comiencen a ponerse. Coloque la mezcla de fideos en la mitad de la tortilla, luego doble la otra mitad de la tortilla sobre la parte superior para encerrar el relleno. Continúe freír en ambos lados hasta que estén dorados.", "Para los fideos crujientes, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido.) Agregue los fideos a la sartén y fríalos por unos 30 segundos, hasta que se hinchen y se doren. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Para los pimientos pegajosos, caliente el aceite de oliva en una sartén y fríe con cuidado la pimienta amarilla, el chile y el ajo durante 1-2 minutos. Agregue el azúcar y el vinagre de vino blanco y cocine suavemente durante 8-10 minutos, o hasta que los pimientos se hayan descompuesto y los jugos se hayan vuelto pegajosos.", "Para servir, deslice la tortilla en un plato para servir y cubra con los fideos crujientes y los pimientos pegajosos."]}, {"isVegetarian": false, "title": "Una tortilla soufflé con tres quesos y cebollino", "url": "www_bbc_co_uk_food_recipes_asouffleomelettewith_67961", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 huevos grandes", "1 onza (25 g) de queso cheddar maduro, finamente rallado", "Parmesano de 1 oz (25 g) (Parmigiano Reggiano), finamente rallado", "Gruyere de 1 oz (25 g), finamente rallado", "1 cucharada colmada de cebollines finamente cortados", "½ oz (10 g) de mantequilla", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a su configuración más alta durante minutos y tener un plato caliente listo.", "Primero separe los huevos - las yemas en un tazón pequeño y los blancos en un tazón grande limpio y chirriante; ayuda si separa los blancos individualmente en una taza primero antes de agregarlos al cuenco; luego, si se rompe, no arruinará el resto. Ahora batir las yemas de huevo con un tenedor, sazonar bien con sal y pimienta. A continuación, coloque la sartén a fuego lento para calentarla.", "Mientras esto ocurre, bata las claras de huevo con un batidor eléctrico o con un batidor de globo, hasta que formen picos suaves. Luego agregue la mantequilla a la sartén y suba el fuego. Luego, usando una cuchara grande de metal, doble rápidamente las yemas de huevo en las claras de huevo, agregando el queso cheddar, la mitad del parmesano y el cebollín al mismo tiempo.", "Luego, cuando la mantequilla esté espumosa, amontone todo en la sartén y agítelo bien para equilibrarlo. Ahora deja que la tortilla cocine por 1 minuto exactamente. Luego deslice una espátula alrededor de los bordes para aflojarla, espolvoree el gruyhre rallado por toda la superficie y golpee la tortilla bajo la parrilla, a unas 4 pulgadas (10 cm) del calor. Deje que se cocine por 1 minuto más, hasta que el queso se derrita y se tiñe de oro. A continuación, retire la sartén del fuego, luego deslice la cuchilla de paleta alrededor del borde nuevamente. Lleve la sartén al plato calentado, luego coloque la mitad de la tortilla sobre la otra e incline la sartén al plato. Esparce el resto del queso parmesano por todas partes y sirve inmediatamente."]}, {"isVegetarian": false, "title": "Pollo relleno de queso de albahaca y cabras con batata, brócoli y vinagreta de ajo asado", "url": "www_bbc_co_uk_food_recipes_asilandgoatscheesest_90415", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pechuga de pollo", "85g / 3oz de queso de cabra", "1 puñado de hojas de albahaca fresca", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "4 cucharadas de aceite de oliva", "½ batata, picada", "3 dientes de ajo, aplastados", "¼ de cebolla, en rodajas", "½ limón, solo jugo", "3 cucharadas de vinagre balsámico"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo, corte el filete por la mitad horizontalmente (no lo corte completamente) y ábralo como un libro. Coloque el pollo entre dos hojas de película adhesiva y, con un mazo de carne o un rodillo, saque el filete para aplanarlo. Desmenuce el queso, ponga las hojas de albahaca y sazone bien con sal y pimienta negra recién molida. Enrolle bien el pollo para sellar bien el relleno.", "Derrita la mantequilla en una sartén a prueba de horno hasta que haga espuma y fríe el pollo durante 3-4 minutos por todos lados, o hasta que se dore por todas partes. Transfiera al horno por 8-10 minutos, o hasta que esté cocido.", "Para la batata, el brócoli y la vinagreta, caliente la mitad del aceite de oliva en una sartén a prueba de horno y fría la batata junto con el ajo y la cebolla durante 3-4 minutos, o hasta que se dore por todas partes. Transfiera al horno para asar durante 6-8 minutos, o hasta que la batata esté dorada y tierna.", "Cueza al vapor el brócoli durante 5-7 minutos, o hasta que esté tierno, luego revuelva en la sartén con la batata.", "Batir el aceite restante, el jugo de limón y el vinagre balsámico en un bol y rociar sobre la batata y el brócoli.", "Para servir, espolvoree las verduras en un plato de servir. Corta el pollo y pon las verduras."]}, {"isVegetarian": false, "title": "Espárragos y anchoas", "url": "www_bbc_co_uk_food_recipes_asparagus_and_anchovy_56555", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 filetes de anchoa en conserva", "1 cucharada de aceite de oliva", "200 g / 7 oz de hojaldre con mantequilla", "12 puntas de espárragos, aproximadamente 12 cm / 5 pulgadas de largo", "1 huevo de gallinas camperas, mezclado con 1 cucharada de leche, para lavar huevos", "1 cucharada de semillas de sésamo"], "serves": "Hace 12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con papel de hornear.", "Machacar las anchoas en un almirez y mortero y mezclar en el aceite de oliva para hacer una pasta untable.", "Estirar la masa de hojaldre en un rectángulo de 24x16 cm / 10x6 pulgadas y aproximadamente 4 mm de grosor.", "Extienda la pasta de anchoa sobre la masa de hojaldre lo más uniformemente posible, hasta los bordes. Cortar en 12 tiras en el ancho, cada una de 2 cm / ¾ de ancho.", "Tome la primera tira y coloque la parte inferior de los espárragos en la parte inferior de la tira en un ángulo de 45 grados. Enróllalo a lo largo de la masa, envolviendo la masa sobre la marcha. Coloque el giro en la bandeja de hornear y repita con las puntas de espárragos y las cintas de repostería restantes. Cuando todos los giros estén en la bandeja, use un cepillo de pastelería para cepillar los pasteles ligeramente con el lavado de huevos. Espolvorea las semillas de sésamo en la masa.", "Hornee durante 20 minutos, o hasta que estén crujientes e hinchados."]}, {"isVegetarian": false, "title": "Espárragos y jamón de Parma y praliné y chocolate vol-au-vents", "url": "www_bbc_co_uk_food_recipes_asparagus_and_parma_ham_27997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina simple de 600g / 1lb 5oz", "300ml / 10fl oz de agua helada", "500g / 1lb 2oz de mantequilla sin sal muy fría", "3 cucharadas de cacao en polvo", "1 huevo grande de gallinas camperas (para lavar huevos)", "50 g / 1¾oz de espinaca", "puñado de albahaca", "1 cucharada de semillas de girasol", "1 cucharada de piñones", "1 limón, solo jugo", "50-75ml / 1¾-2½fl oz de aceite de oliva virgen extra", "50g / 1¾oz de queso parmesano, rallado", "sal marina gruesa y pimienta negra recién molida", "100 g / 3½ oz de avellanas blanqueadas", "100 g / 3½ oz de azúcar en polvo", "6 cucharadas de leche entera", "1 cucharadita de pasta de frijoles de vainilla", "1 yema de huevo grande de gallinas camperas", "20 g / oz de azúcar en polvo", "½ cucharada de harina de maíz", "10g de mantequilla sin sal", "4 cucharadas de crema doble", "125ml / 4fl oz de crema doble", "125g / 4½oz de chocolate puro (50-60% de sólidos de cacao), más o menos picados", "½ tiro espresso", "24 puntas de espárragos bebé", "100 g / 3½ oz de guisantes con cáscara, frescos o congelados", "50g / 1¾oz mangetout, picado", "50 g / 1¾oz de alubias peladas, frescas o congeladas", "2 cucharadas de aceite de albahaca", "1 cucharada de pesto (desde arriba)", "2 rebanadas de jamón de Parma", "125g / 4½oz de queso crema con toda su grasa", "2 cucharadas de jugo de limón", "2 rábanos, finamente picados", "mezcla de brotes de guisantes y micro hierbas", "aceite de albahaca", "25g / 1oz de avellanas sin cáscara", "100 g / 3½ oz de chocolate negro (70% de sólidos de cacao)", "24 pequeños pensamientos comestibles púrpuras"], "serves": "Hace 48 vuelos a vientos", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa de hojaldre, en una batidora independiente, bata la harina y el agua hasta que estén elásticos. Retire la mitad de la masa y gírela en un pequeño rectángulo de 2.5 cm / 1 pulgada de grosor. Repite con la segunda mitad, luego cubre ambos rectángulos con película adhesiva y colócalos en el congelador.", "Divida la mantequilla en dos y desplácela entre dos hojas de papel resistente a la grasa: un rodillo de madera ayudará a aplanar la mantequilla fría. Regrese ambas losas de mantequilla a la nevera.", "Retire uno de los rectángulos de masa del congelador y extiéndalo para doblar el tamaño de la mantequilla. Mantenga la segunda masa en el congelador mientras lo hace. Coloque la mitad de la mantequilla encima de la mitad de la masa y pliéguela, sellando la mantequilla con la masa. Estirar para formar un rectángulo largo. Doble la parte superior e inferior como un libro para encontrar en el medio. Gire 90 grados y luego repita el balanceo y plegado. Gire nuevamente y repita la acción. Envuelva la película adhesiva y vuelva al congelador.", "Repita este proceso con el segundo rectángulo de masa, tamizando el cacao en la primera laminación.", "Realice el proceso de laminación dos veces más por cada masa, dejando reposar en el congelador durante al menos 20 minutos cada vez. Mientras espera que las masas descansen, haga los rellenos individuales.", "Para el pesto, mezcle todos los ingredientes del pesto en un procesador de alimentos, agregando más aceite si es necesario. Poner en una jarra y guardar en la nevera hasta que se requiera.", "Para la pasta de praliné, forrar una bandeja para hornear con silicona. Seque las avellanas por unos minutos hasta que comiencen a colorear. Calentar el azúcar en polvo en una sartén a fuego medio con 2 cucharadas de agua hasta que el color del caramelo. No revuelva después de que el azúcar se haya disuelto.", "Agregue las nueces al azúcar y viértalo en la bandeja para hornear. Una vez sólido, romper en pedazos y mezclar en un procesador de alimentos hasta que quede suave (aproximadamente 5 minutos). Guarde en un frasco en el refrigerador hasta que se requiera.", "Para la crème légère, caliente la leche y la pasta de vainilla en una sartén hasta que hierva. Batir la yema de huevo, el azúcar impalpable y la harina de maíz en un recipiente hasta que quede suave, antes de verter la leche caliente encima.", "Vierta la mezcla de nuevo en la sartén, agregue la mantequilla y bata a fuego medio hasta que espese. Viértalo en un recipiente, presione la película adherida sobre la superficie de la crema y déjela enfriar. Una vez que se haya enfriado por completo, mezcle la crema doble en un recipiente para mezclar hasta que se formen picos suaves cuando retire la batidora del bol. Revuelva la crema en la crema légère y mezcle hasta que quede suave. Almacene en un recipiente en el refrigerador hasta que se requiera.", "Para el ganache, llevar la crema a ebullición en una sartén. Coloque el chocolate picado y el espresso en un tazón. Vierta la crema sobre el chocolate y el espresso y mezcle hasta que quede suave y completamente derretido. Deje que se enfríe un poco antes de transferirlo a una manga pastelera.", "Para completar la masa para los voltajes, precaliente el horno a 200C / 180C Fan / Gas 6.", "Ruede las masas a 5 mm / ¼ de grosor. Con un cortador redondo de 5 cm / 2 pulgadas, corte 24 discos de cada masa. Luego recorte un círculo de 2.5 cm / 1 desde el centro. Reúna los centros y los trozos de masa en una bola, luego vuelva a enrollar hasta 5 mm // ¼ de grosor y corte otras rondas de 24 x 5 cm en cada masa.", "Cepille los discos completos con un pequeño huevo y coloque un anillo encima de cada uno. Usando un tenedor afilado, pinche la parte inferior de manera uniforme y por todas partes. Cepillo con un poco más de huevo. Disponga los voltajes de ventilación en una bandeja grande para hornear forrada con silicona. Cubra con otra hoja grande de silicio (esto les ayuda a levantarse uniformemente). Hornee por 15 minutos, revise con regularidad y solo retire la sábana superior cuando esté completamente levantada (las de chocolate podrían necesitar un poco más de tiempo). Deje que se enfríe completamente. Deja el horno encendido.", "Rocíe las rondas de ganache en el fondo de los refrigeradores de chocolate y déjelos reposar.", "Para el relleno sabroso, agregue los espárragos, los guisantes, el mangetout y las habas en un tazón, cúbralo con agua hirviendo y déjelo durante 4 minutos para que se cocine suavemente. Escurrir todas las verduras, luego reservar las puntas de los espárragos para la decoración y cortar los tallos por la mitad. Agregue el aceite y el pesto al recipiente de verduras y mezcle bien.", "Coloque el jamón de Parma en una bandeja para hornear y hornee por 5 minutos o hasta que esté completamente crujiente. Retire del horno y corte en tiras finas.", "Para el queso, bata el queso crema en un tazón con un poco de sal y pimienta y el jugo de limón hasta que quede suave.", "Para decorar los salados tentempiés, transfiera el queso crema a una manga pastelera y haga una vuelta en el fondo de los voltajes de ventilación. Cúbralo con un par de cucharaditas de pesto antes de agregar las verduras encima hasta que esté casi lleno. Eche un poco de queso crema encima y agregue una tira de jamón de Parma y puntas de espárragos. Decora con rábanos, micro hierbas y un poco de aceite de albahaca. Almacenar en el refrigerador hasta que se requiera.", "Para decorar los dulces vol-au-vents, freír las avellanas y picar. Coloque la pasta de praliné encima del ganache establecido. Transfiere la crème légère a una manga pastelera y coloca una gota en la parte superior. Espolvorear con las nueces picadas.", "Crea rizos de chocolate con un cuchillo grande y plano y la parte inferior de la barra de chocolate. Arrastre el cuchillo sobre la barra hacia usted y recoja los rizos con el cuchillo, ya que sus manos los derretirán.", "Espolvorea los rizos de chocolate en la parte superior de los vol-au-vents. Los vol-au-vents se sirven mejor de inmediato."]}, {"isVegetarian": true, "title": "Tartaletas de espárragos y huevo escalfado con parmesano y albahaca", "url": "www_bbc_co_uk_food_recipes_asparagus_and_poached_80127", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_and_poached_80127_16x9.jpg", "ingredients": ["harina común, para quitar el polvo", "500 g / 1lb 2 oz de hojaldre", "200g / 7oz de queso bajo en grasa", "¼ limón, ralladura finamente rallada solamente", "sal marina escamada y pimienta negra recién molida", "30 espárragos medianos", "1 huevo de gallinas camperas, batido, para glasear (alternativamente, use un poco de leche)", "6 huevos medianos de granja", "Parmesano de 25 g / 1 oz, hecho en virutas con un pelador de patatas", "buen puñado de hojas pequeñas de albahaca", "rociar aceite de oliva virgen extra (opcional)"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Alinee una bandeja grande para hornear con un pergamino para hornear y reserve.", "Espolvoree un poco de harina sobre una superficie de trabajo limpia y extienda la masa de hojaldre hasta un rectángulo de 28x30 cm / 11x12 pulgadas, aproximadamente del grosor de una moneda de 1 £. Recorte los bordes para que los lados sean bonitos, rectas y aseados. Corta la masa por la mitad a lo largo y luego en tercios por el ancho para obtener seis rectángulos de 10x14cm / 4x5½ pulgadas.", "Coloque los rectángulos de masa en la bandeja de hornear, cubra con una película adhesiva y refrigere durante 20 minutos (o congélelos durante 10 minutos) para que la masa se solidifique. Es importante hacer esto para que cuando la masa de hojaldre entre al horno, la harina se cocine antes de que la mantequilla se derrita, asegurando una masa mucho más liviana.", "Precaliente el horno a 220C / 425F / Gas 7 (ventilador de 200C). Mezcle el queso crema y la ralladura de limón en un tazón pequeño y sazone al gusto con sal y pimienta. Recorte los espárragos de modo que cada tallo tenga 10 cm de largo (puede usar los recortes para hacer una sopa rápida o agregarla a una salsa para pasta).", "Una vez que esté firme, retire la masa del refrigerador (o congelador) y use un cuchillo afilado para marcar un borde ancho de 1 cm / ½ pulgada alrededor de cada rectángulo. Luego, usando un patrón de rayado cruzado, marque el borde para que cada forma de pastel se asemeje a un marco de imagen. Tome un tenedor y pinche el centro de cada forma unas 10 veces, hasta llegar a la bandeja de hornear. Cepille el borde con el huevo batido (o leche), asegurándose de que no baje por los lados de la masa (si esto sucede, límpielo con el dedo, de lo contrario, el huevo pegará las capas de la masa y se detendrá). pasteles de levantarse).", "Divida el queso crema con limón entre las seis tartas, extendiéndolo con la parte posterior de la cuchara y asegurándose de que permanezca dentro del \\\"marco\\\". Coloque cinco lanzas de espárragos en una sola capa, tocándose entre sí y apuntando en la misma dirección en cada tarta, y empuje hacia abajo ligeramente.", "Hornee las tartas en el horno durante 18-20 minutos, o hasta que la masa se hinche bien y quede firme y dorada donde haya subido.", "Aproximadamente 10 minutos antes de que la tarta esté lista, vierta aproximadamente 4 cm / 1½ in de agua en una sartén o en una sartén honda y deje hervir a fuego alto. Baje la temperatura para que el agua hierva a fuego lento. Rompe un huevo en un tazón muy pequeño o taza de té y luego desliza el huevo en el agua. Repita con todos los huevos, separándolos. Cocine por unos 3-4 minutos, o hasta que el blanco esté cocido pero la yema aún esté suave. Retire con una espumadera en un plato caliente.", "Retire las tartas del horno y divida entre seis platos para servir. Sentar un huevo escalfado encima de cada tarta y esparcir sobre el parmesano y las hojas de albahaca. Espolvoree con un poco de sal y pimienta y rocíe con un poco de aceite de oliva, si le gusta, y sirva."]}, {"isVegetarian": true, "title": "Cigarros de espárragos y hojaldre", "url": "www_bbc_co_uk_food_recipes_asparagus_and_puff_00402", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_and_puff_00402_16x9.jpg", "ingredients": ["150g / 5oz de hojaldre listo para usar", "harina, para quitar el polvo", "25g / 1oz de queso crema", "10 lanzas de espárragos", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de parmesano recién rallado (o un queso duro vegetariano similar)"], "serves": "Hace 10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ruede la masa de hojaldre sobre una superficie enharinada en un rectángulo de 15cmx25cm / 6inx10in y extiéndala por todas partes con el queso crema.", "Con un cuchillo afilado, corte la masa en 10 tiras largas y delgadas.", "Envuelva una tira de hojaldre en espiral alrededor de cada lanza de espárrago y colóquela en una bandeja para hornear. Ligeramente cepille cada uno con huevo batido y luego esparza sobre el queso parmesano.", "Hornee los cigarros en el horno durante 15-20 minutos, o hasta que la masa se haya levantado y esté dorada."]}, {"isVegetarian": true, "title": "Ensalada de espárragos, mostaza y hierbas con salsa de rábano", "url": "www_bbc_co_uk_food_recipes_asparagus_mustard_and_09505", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Espárrago delgado de 340 g / 12 oz.", "sal marina", "agua con hielo", "1 cucharadita de mostaza Dijon", "1 cucharada de jugo de limón", "3 cucharadas de aceite de oliva", "6 rábanos, cortados en bastones de 3 mm", "1 cucharadita de estragón fresco picado", "1 cucharadita de perifollo fresco picado", "1 cucharadita de perejil fresco picado", "1 cucharadita de cebollines picados", "pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine los espárragos en agua con sal hirviendo durante 3 minutos, hasta que estén tiernos. Retirar con una cuchara ranurada y sumergir en agua helada. Escurrir bien y colocar en un tablero.", "Retire las puntas y reserve. Corta los tallos en pedazos de 2.5cm / 1in.", "Mientras tanto, haz un aderezo. En un tazón grande, mezcle la mostaza y el jugo de limón para formar una emulsión. Poco a poco agregue el aceite, batiendo continuamente.", "Agregue los trozos de tallo de espárrago y los rábanos y mezcle hasta que estén bien cubiertos. Agregue las hierbas y mezcle de nuevo. Condimentar con sal y pimienta.", "Apila los tallos de espárragos en un plato y esparce los consejos reservados sobre la parte superior. Vierta sobre el aderezo restante."]}, {"isVegetarian": true, "title": "Tofu estilo asiático salteado", "url": "www_bbc_co_uk_food_recipes_asianstyletofustirfr_92503", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asianstyletofustirfr_92503_16x9.jpg", "ingredients": ["2 cucharadas de aceite de oliva", "½ lima, ralladura y jugo", "grandes copos de chile pizca", "2 cucharadas de salsa de soja", "2 cucharadas de miel", "2 cucharadas de aceite vegetal", "150 g / 5½ oz de tofu, cortado en trozos", "2 cucharadas de aceite vegetal", "¼ de cebolla, finamente rebanada", "1 diente de ajo, aplastado", "¼ de pimiento rojo, picado", "puñado de hojas de espinaca", "Arroz basmati 150 g / 5½ oz, cocinado según las instrucciones del paquete y escurrido"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el tofu marinado, combine todos los ingredientes del marinado, excepto el aceite vegetal, en un tazón y mezcle bien. Agregue el tofu, cúbralo con la mezcla y déjelo marinar de 5 a 10 minutos o más si es posible.", "Calentar un wok a fuego medio. Retire el tofu del adobo, dejando el adobo a un lado. Freír el tofu durante 5-10 minutos hasta que se dore por todas partes. Cuele el adobo para eliminar cualquier trozo pequeño de tofu.", "Para el arroz, caliente el aceite en una sartén y fría las cebollas y el ajo durante 2-3 minutos hasta que se ablanden, luego agregue la pimienta y fría hasta que el tofu por 2 minutos. Agregue la espinaca, el arroz y el adobo reservado y caliente por 3-4 minutos más.", "Sirva el arroz con el tofu marinado en la parte superior."]}, {"isVegetarian": true, "title": "Ensalada de fideos asiáticos", "url": "www_bbc_co_uk_food_recipes_asianstylenoodlesala_86068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Fideos de udon 85g / 3oz, cocidos de acuerdo con las instrucciones del paquete y escurridos", "½ pimiento rojo, semillas removidas, picadas", "55g / 2oz de carne fresca de piña, picada", "1 cucharada de aceite de oliva", "1 cucharada de salsa de soja", "2 cucharaditas de aceite de sésamo", "Jengibre de raíz de 2.5cm / 1in, finamente picado", "½ cucharadita de copos de chile"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque los fideos cocidos en un tazón grande con el pimiento rojo y la piña.", "En un tazón pequeño, mezcle el aceite de oliva, la salsa de soja, el aceite de sésamo, el jengibre y las hojuelas de chile hasta que estén bien combinados.", "Para servir, vierta el aderezo sobre los fideos y revuelva. Transfiera a un tazón de servir."]}, {"isVegetarian": false, "title": "Sopa de espárragos (Spargel)", "url": "www_bbc_co_uk_food_recipes_asparagus_soup_spargel_66317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Espárrago blanco 500 g / 1 libra 2 oz", "50g / 2oz de mantequilla sin sal", "1 chalote, finamente picado", "700 ml / 1¼ pintas de caldo de pollo", "70 ml / 4½ cucharadas de crema fresca", "2 yemas de huevo", "1 cucharada de jerez fino seco", "2 cucharadas de perejil picado, para decorar", "copos de sal marina", "pimienta blanca"], "serves": "Sirve 4 a 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Primero pele cada tallo de espárrago desde la punta hasta el extremo cortado. Corta las puntas y ponlas a un lado, luego corta los tallos en pedazos de 1 cm.", "Derrita la mantequilla en una cacerola y sude la chalota por unos 5 minutos hasta que quede translúcida, no la deje dorar. Agregue los tallos de espárragos picados, manteniendo las puntas a un lado, y sudarlas suavemente con la chalota durante otros 5 minutos.", "Vierta el caldo y cocine a fuego lento hasta que los tallos estén muy tiernos. Esto llevará de 20 a 30 minutos, dependiendo del grosor de los tallos. Incline todo en un procesador de alimentos y blitz hasta que quede muy suave, luego vuelva a verter la sopa en la cacerola.", "Traiga la sopa a fuego lento y agregue las puntas de espárrago reservadas. Cocine suavemente por unos 5 minutos hasta que las puntas de los espárragos estén recién cocidas.", "Mezcle la crème fraiche, las yemas de huevo y el jerez en un tazón pequeño. Con la sartén lejos del fuego, mezcle esta mezcla con la sopa y continúe revolviendo suavemente durante un par de minutos hasta que las yemas de huevo hayan espesado la sopa. Caliente a través de un calor muy suave, revolviendo constantemente y teniendo cuidado de no romper las puntas de los espárragos.", "Sirva la sopa adornada con una pizca de perejil y una generosa tableta de pan alemán bien untado con mantequilla en el costado. ¡Phwoar!"]}, {"isVegetarian": true, "title": "Espárragos con mayonesa de hierbas y huevos de codorniz crujientes", "url": "www_bbc_co_uk_food_recipes_asparagus_with_herb_56880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml / 5fl oz de vinagre de malta", "200ml / 7fl oz de agua fría, con un puñado de hielo", "12 huevos de codorniz", "1 huevo de gallinas camperas vencido", "2 cucharadas de harina", "Tocino ahumado de 30 g / 1 oz, finamente picado", "40g / 1½ oz de pan rallado", "250ml / 9fl oz de aceite vegetal", "1 cucharadita de cebolletas frescas picadas", "1 cucharadita de perifollo fresco picado", "250ml / 9fl oz de aceite de colza", "1 yema de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "2 cucharadas de vinagre de vino blanco", "sal y pimienta negra recién molida", "12 tallos grandes espárragos ingleses", "25 g / 1oz frisée o ensalada de hojas mixtas", "1 cucharada de vinagre de vino blanco", "1 cucharada de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para los huevos crujientes de codorniz, prepare un recipiente con 200 ml / 7 fl oz de agua, el vinagre y un puñado de hielo.", "Cocine los huevos de la codorniz en agua salada hirviendo durante un minuto exactamente, retire con una cuchara ranurada en la mezcla de vinagre, déjelos a un lado durante 30 minutos y luego pélelos.", "A continuación, coloque la harina en un recipiente, el huevo batido en un recipiente aparte y mezcle el tocino y las migajas de pan en un plato.", "Cubra los huevos de codorniz en la harina, sumerja en el huevo y cubra con la mezcla de migas de pan. (Es posible que necesite cubrir el huevo y el pan rallado dos veces para asegurarse de que los huevos estén bien cubiertos). Los huevos se pueden guardar en el refrigerador en este punto, hasta que estén listos para cocinar.", "Para cocinar los huevos de codorniz crujientes, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír los huevos durante 2 o 3 minutos, o hasta que estén dorados, retirar de la sartén con una espumadera y dejarlos a un lado para escurrirlos sobre papel de cocina.", "Para la mayonesa de hierbas, mezcle las hierbas y el aceite de colza en una licuadora hasta que quede suave.", "Batir la yema de huevo, la mostaza y el vinagre en un bol hasta que quede suave. Batir lentamente el aceite de hierbas hasta que la mayonesa esté espesa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, cocinar los espárragos en agua con sal hirviendo durante 3-4 minutos, escurrirlos y refrescarlos en agua con hielo y luego drenarlos nuevamente. Cortar a la mitad longitudinalmente y mezclar con las hojas de ensalada, vinagre, aceite de oliva, sal y pimienta negra recién molida.", "Extienda un poco de la mayonesa de hierbas en los platos para servir y coloque los espárragos y las hojas de ensalada encima. Corta la parte superior de los huevos y coloca alrededor de los espárragos."]}, {"isVegetarian": false, "title": "Espárragos con cebada perlada y tocino", "url": "www_bbc_co_uk_food_recipes_asparagus_with_pearl_43154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_with_pearl_43154_16x9.jpg", "ingredients": ["300ml / 10fl oz de caldo de pollo", "100 ml / 3½ fl oz de crema individual", "sal y pimienta negra recién molida", "30g / 1oz de mantequilla", "1 chalote, finamente picado", "225g / 8oz de cebada perlada", "50ml / 2fl oz de vino blanco", "800ml / 1 pinta 8fl oz de caldo de pollo", "2 manojos de espárragos ingleses, con extremos de madera partidos y reservados", "Tocino de panceta 60 g / 2¼ oz", "85g / 3oz de habas cocidas y sin cáscara", "3 tomates, despellejados y sin semillas, cortados en cubos de 1cm / ½ en cubitos"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa, agregue los extremos leñosos de los tallos de espárragos al caldo de pollo y deje que hierva. Reduzca a fuego lento y cocine por otros cinco minutos. Mezcle la mezcla y pase a través de un colador en una olla limpia. Agregue la crema y sazone, al gusto, con sal y pimienta negra recién molida.", "Para la cebada perlada, derrita la mantequilla en una cacerola y fría la chalota por un minuto sin colorear. Agregue la cebada perlada y cocine por un minuto más.", "Agregue el vino a la mezcla y lleve a ebullición, luego agregue 325ml / 11fl oz de la acción y vuelva a hervir. Reduzca el fuego y cocine a fuego lento, revolviendo ocasionalmente, hasta que todo el caldo haya sido absorbido. Agregue otros 325ml / 11fl oz de caldo y cocine por otros 20-25 minutos, o hasta que la cebada esté tierna. (Es posible que necesite agregar un poco más de stock).", "Mientras tanto, corte 4 cm / 1½ in de las puntas de los espárragos y déjelos a un lado. Corta los tallos restantes en ángulo.", "Cocine las puntas de los espárragos en agua con sal hirviendo durante 2 a 3 minutos, escurra y refrigérelas en agua con hielo salada y vuelva a escurrir.", "Freír los lardons de tocino en una sartén por un minuto, o hasta que estén dorados", "Revuelva los tallos de espárragos rebanados en la cebada y cocine durante 3-4 minutos más. Agregue el tocino, las habas, los espárragos y los tomates.", "Para servir, espuma la salsa con una batidora de mano. Vierta la cebada en recipientes hondos y vierta sobre la salsa."]}, {"isVegetarian": true, "title": "Espárragos con limón en conserva y chile encurtido", "url": "www_bbc_co_uk_food_recipes_asparagus_with_preserved_39340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Consejos de espárragos de 300 g / 10½ oz, recortados", "4 limones grandes conservados, sin semillas y finamente picados", "6 chiles encurtidos, en rodajas finas", "½ paquete (alrededor de 15 g) de menta fresca, en rodajas finas", "pimienta recién molida", "aceite de oliva, para lloviznar"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque los espárragos en un recipiente poco profundo y vierta solo el agua hirviendo suficiente para cubrirlos. Dejar de lado por 5 minutos. Escurra el agua caliente y coloque el recipiente bajo un chorro de agua fría para enfriar los espárragos. Una vez que se haya enfriado, seque el exceso de humedad de las lanzas con papel de cocina.", "Corta a la mitad las lanzas de espárragos y colócalos en un bol. Agregue los limones conservados, los chiles en vinagre, la menta fresca y una generosa cantidad de pimienta negra, luego rocíe con un poco de aceite de oliva. Mezcle bien y sirva."]}, {"isVegetarian": false, "title": "Risotto de espárragos y guisantes", "url": "www_bbc_co_uk_food_recipes_asparagusandgardenpe_83709", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "Arroz risotto 250 g / 9 oz", "¼ botella de vino blanco", "Caldo de pollo 290ml / 10fl oz / ½ litro (o 2 cubos de reserva y ½ pinta de agua hirviendo)", "1 manojo de espárragos picados", "150g / 5oz de guisantes frescos (peso sin cáscara)", "Queso cheddar maduro 100 g / 4 oz, rallado", "25 g / 1 oz de queso parmesano"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de oliva en una cacerola grande, agregue la cebolla y cocine durante unos cinco minutos, hasta que se ablande.", "Agregue el arroz y continúe revolviendo durante aproximadamente dos minutos mientras el arroz se cocina y se vuelve ligeramente opaco.", "Vierta cuidadosamente el caldo de vino y pollo.", "Cocine, revolviendo con frecuencia, hasta que el arroz esté bien cocido (si se vuelve demasiado espeso, agregue más agua), esto debería tomar entre 12 y 15 minutos.", "Cubra los espárragos y los guisantes con agua hirviendo y hierva rápidamente durante unos tres minutos. Escurrir bien.", "Revuelva las verduras y el queso cheddar en el arroz cocido.", "Ralla un poco de queso parmesano en la parte superior. Este risotto es delicioso servido con pollo asado."]}, {"isVegetarian": true, "title": "Envoltura de hojaldre de queso de espárragos y cabras con salsa cremosa de vino", "url": "www_bbc_co_uk_food_recipes_asparagusandgoatsche_84452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de hojaldre listo para enrollar", "8 lanzas de espárragos escaldadas en agua hirviendo", "75g / 2½oz de queso de cabra, desmenuzado", "6 hojas de albahaca fresca", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "1 cucharada de semillas de sésamo", "100ml / 3½fl oz de vino blanco", "3 cucharadas de crema doble"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta un cuadro de 8 pulgadas de la masa de hojaldre preparada.", "Coloque las lanzas de espárragos en el centro y la parte superior con queso de cabra y hojas de albahaca. Sazonar con sal y pimienta negra recién molida.", "Dobla las cuatro esquinas del cuadrado de repostería hacia el centro del cuadrado.", "Puntuación de la parte superior del paquete de pastelería con un cuchillo afilado. Cepille la parte superior con huevo batido y espolvoree con las semillas de sésamo. Coloque en una bandeja para hornear y coloque en el horno para cocinar durante 10-12 minutos.", "Para la salsa, caliente el vino en una cacerola pequeña a fuego alto hasta que el líquido se haya reducido a la mitad. Agregue la crema y caliente a través. Sazonar con sal y pimienta negra recién molida.", "Para servir, coloque el cuadro de hojaldre en un plato de servir y rocíe alrededor de la salsa."]}, {"isVegetarian": false, "title": "Espárragos y lechuga con gambas y aderezo de sésamo y soja", "url": "www_bbc_co_uk_food_recipes_asparagusandlettucew_87710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manojo de espárragos, recortado", "2 hojas de lechuga Little Gem", "2 cucharadas de aceite de sésamo", "2 gambas de tigre crudas, peladas y desveladas", "1 guindilla roja, sin semillas y picada", "1 cucharada de salsa de soja"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Escaldar los espárragos en agua con sal hirviendo durante 3-4 minutos, agregando las hojas de lechuga durante el último minuto. Desagüe.", "Calentar una cucharada de aceite de sésamo en una sartén y freír las gambas durante dos minutos, o hasta que se pongan rosadas por completo.", "Para servir, coloque los espárragos y la lechuga en un plato para servir. Coloque las gambas encima y espolvoree sobre la guindilla. Rocíe con la cucharada restante de aceite de sésamo y la salsa de soja."]}]