[{"isVegetarian": false, "title": "Beef, asparagus and mangetout stir fry", "url": "www_bbc_co_uk_food_recipes_beefasparagusandmang_85921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz scotch beef fillet, sliced thinly", "20ml/¾fl oz sake", "20ml/¾fl oz soy sauce", "1 tsp grated fresh ginger", "½ tsp soft brown sugar", "½ garlic clove, finely chopped", "1 small red chilli, finely chopped", "110g/4oz asparagus, chopped into thin sticks (julienne)", "75g/3oz mangetout, chopped into thin sticks (julienne)", "2 tsp sesame oil", "salt and freshly ground black pepper ", "2 tsp sesame seeds, to serve", "2 sprigs fresh coriander, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the beef fillet, sake, soy sauce, ginger, sugar, garlic and chilli into a bowl and mix together well. Set aside and marinate for 30 minutes.", "Heat a wok until hot and add the beef mixture. Stir-fry for two minutes, until the meat is browned all over.", "Add the asparagus and mangetout and continue to stir-fry for a further 2-3 minutes, until the vegetables are just tender and the beef is cooked through.", "Add the sesame oil and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the stir fry onto two plates and sprinkle each with the sesame seeds and garnish with a sprig of coriander."]}, {"isVegetarian": false, "title": "Beef curry with lemon and sweet potato mash", "url": "www_bbc_co_uk_food_recipes_beefcurrywithlemonan_86071", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5½oz rump steak, cut into bite-sized chunks", "½ red onion, chopped", "1 tsp curry powder", "1 bay leaf", "¼ tsp chilli flakes", "4 tbsp red wine", "salt and freshly ground black pepper ", "1 tbsp chopped fresh coriander ", "1 sweet potato, peeled and cut into cubes, boiled until tender and drained", "2 tbsp double cream", "½ lemon, juice only", "salt and freshly ground black pepper ", "55g/2oz green beans, topped and tailed, blanched"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef curry, heat the oil in a large pan and fry the steak pieces, stirring frequently, until browned all over.", "Add the onion and cook until softened.", "Add the spices and cook for a further minute.", "Add the red wine and cook for 8-10 minutes, or until the beef is cooked through. Season, to taste, with salt and freshly ground black pepper and stir in the coriander.", "For the sweet potato mash, place the cooked sweet potato into a bowl with the cream and lemon juice. Season, to taste, with salt and freshly ground black pepper and mash with a potato masher until smooth.", "To serve, place the mash onto a serving plate with the blanched green beans and top with the curry."]}, {"isVegetarian": false, "title": "Beef curry with jasmine rice", "url": "www_bbc_co_uk_food_recipes_beefcurrywithjasmine_83224", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz rib-eye steak, cut into 5cm/2in pieces", "salt and freshly ground black pepper", "3 shallots, finely sliced", "1 clove garlic, chopped", "1 tsp tomato purée", "1 tsp chilli powder", "½ tsp turmeric powder", "200ml/7fl oz coconut milk", "250g/9oz jasmine rice, boiled until tender", "20g/1oz chopped fresh coriander, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan until almost smoking. Season the steak with salt and freshly ground black pepper and add to the pan. Brown on all sides, then remove. ", "Add two of the sliced shallots together with the garlic and cook until softened but not coloured. Add the tomato purée and spices, stir well and cook for one minute. ", "Put the steak back in the pan and add the coconut milk. Bring to the boil, then turn down the heat and simmer gently for 10 minutes. ", "Add the remaining shallot to the cooked and drained jasmine rice.", "To serve, stir the coriander through the curry and serve with the jasmine rice."]}, {"isVegetarian": false, "title": "Beef empanadas", "url": "www_bbc_co_uk_food_recipes_beefempanadas_86767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "1 garlic clove, crushed", "1 carrot, finely chopped", "225g/8oz extra lean beef mince", "1 tbsp tomato purée", "¾ tsp ground cumin", "1 tsp chilli powder", "1 medium potato, peeled, cut into cubes", "100ml/3½fl oz dark Mexican beer, brown ale or stout ", "salt and freshly ground black pepper", "225g/8oz plain flour, plus extra for dusting", "½ tsp turmeric", "½ tsp chilli flakes", "75g/3oz chilled butter, cut into cubes", "pinch salt", "50ml/2fl oz milk", "1 free-range egg yolk", "1 free-range egg, beaten", "sweet chilli dipping sauce"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the onion, garlic and carrot and fry until softened.", "Add the mince and fry for 3-4 minutes, until golden-brown all over.", "Add the tomato purée, cumin and chilli powder, stir well and cook for 3-4 minutes.", "Add the potatoes and the beer and bring to the boil. Reduce the heat and simmer for 25 minutes, or until potatoes are cooked.", "Remove from the heat and leave to cool.", "For the pastry, place the flour, turmeric, chilli flakes, butter and salt into a food processor and pulse to a breadcrumb-like consistency. ", "Add the milk and egg yolk and pulse together until the mixture just comes together as a dough.", "Turn the dough out onto a lightly floured work surface and knead for a few minutes, then wrap in cling film and transfer to the fridge to chill for an hour.", "Preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out onto a lightly floured work surface and cut out 12 circles of 10cm/4in diameter.", "Place a spoonful of the filling into the centre of each pastry circle.", "Brush the edge of one half of each of the circles with some of the beaten egg, then fold over the other side and seal - make sure you don't trap any air inside.", "Mark around the edges of the sealed pastry with the tines of a fork.", "Place the empanadas onto a baking tray and transfer to the oven to cook for 10 minutes, or until the pastry is cooked and the filling is hot.", "To serve, place the empanadas onto a large serving plate with sweet chilli dipping sauce in a bowl in the centre."]}, {"isVegetarian": false, "title": "Beef fillet in coconut milk with crispy noodles and dipping sauce", "url": "www_bbc_co_uk_food_recipes_beeffilletwithcoconu_87454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz beef fillet, sliced thinly", "sal and freshly ground black pepper", "olive oil", "75ml/3fl oz coconut milk", "2.5cm/1in piece fresh ginger", "110ml/4fl oz rice wine vinegar", "110g/4oz caster sugar", "50ml/2fl oz Thai fish sauce (nam pla)", "2 tsp dried chilli flakes", "50g/2oz cashew nuts, finely chopped", "1 small bunch fresh coriander, roughly chopped", "vegetable oil for deep frying", "40g/1½oz ready-made rice noodles", "2 Little Gem lettuces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the beef slices, salt and freshly ground black pepper and olive oil into a bowl and mix well.", "Heat a frying pan and add the beef. Avoid turning the meat too much - you want it to develop a nice crust. ", "Once the beef is golden-brown all over, add the coconut milk. Bring to the boil, then reduce the heat and simmer for 4-5 minutes, stirring occasionally. The coconut milk will reduce down to give a sticky consistency, coating the beef. Remove from the heat and set aside.", "Grate the ginger onto the middle of a sheet of muslin. Fold over the muslin to seal around the ginger, then squeeze out the juice over a clean bowl by slowly twisting the muslin with the ginger inside.", "Place the rice wine vinegar and caster sugar into a pan over a medium heat and stir until the sugar has dissolved.", "Add the Thai fish sauce, chilli flakes, and the squeezed ginger juice and cook over a low heat for five minutes. ", "Add the chopped nuts and heat for one minute.", "Add the chopped coriander and heat for one minute.  ", "Heat a deep fat fryer to 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Add the noodles to the oil - they will expand quickly and dramatically. Once the noodles are all crisp and golden-brown remove them from the oil with a slotted spoon and transfer to a baking sheet lined with a paper towels to drain.", "Divide up the leaves from the Little Gem lettuces and arrange on serving plates.", "To serve, spoon the beef into the 'cups' of the Baby Gem leaves, and then drizzle the dipping sauce over. Gently crumble a handful of the crispy noodles over each dish and serve."]}, {"isVegetarian": false, "title": "Beef fillets with wasabi pikelets and spicy beetroot", "url": "www_bbc_co_uk_food_recipes_beeffilletwithwasabi_67767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4x170g/6oz beef fillets", "4 small cooked beetroot", "½ tsp fennel seeds", "700ml/1¼ pints malt vinegar", "55g/2oz dark brown sugar", "1 clove minced garlic", "1 tbsp minced ginger", "2 large potatoes", "1 tbsp horseradish sauce", "1 tsp wasabi", "2 eggs, yolks only", "1 tbsp chopped chives", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grate the beetroot into a metal bowl.", "Dry fry the fennel seeds in a pan and grind to a powder in a spice grinder. Mix with the vinegar, sugar, garlic, ginger and chilli.", "Boil together for 20 minutes, and pour over the grated beetroot. Allow to cool. Boil the potatoes in their skins until soft, allow to cool slightly and peel.", "Crush the potatoes with a fork and add the wasabi, horseradish, yolks and chives, mix well and season.", "Heat a non-stick frying pan and lightly oil it. Spoon mixture into 4 oiled egg rings and cook over a moderate heat until golden brown, turn over and repeat.", "Heat a grill pan, brush the beef fillets with a little oil and cook for 3-4 minutes on each side and allow to rest in a warm place.", "Place a potato cake onto a warm dinner plate; slice the beef and place on top. Spoon the beetroot mix on top and drizzle some of the juice all around and serve."]}, {"isVegetarian": false, "title": "Beef flank steaks with crisp shallots and wild mushroom and watercress salad", "url": "www_bbc_co_uk_food_recipes_beefflankwithcrispsh_89942", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "110g/4oz plain flour, for dusting", "salt and freshly ground black pepper ", "5-6 shallots, peeled and sliced into thin rings", "110ml/4fl oz milk", "2 x 300g/10oz beef flank steaks", "2 tbsp olive oil", "150g/5oz mixed wild mushrooms, cleaned", "1 tbsp good quality cider vinegar", "3 tbsp rapeseed oil", "1 tsp English mustard", "salt and freshly ground black pepper ", "110g-150g/4oz-5oz watercress, washed, thick stalks removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Half-fill a deep heavy-based pan with vegetable oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Season the flour with salt and freshly ground black pepper.", "Dredge the shallot rings in the seasoned flour to coat, shaking off any excess. Dip into the milk and then dredge in the flour again, shaking off any excess.", "Deep-fry the shallot rings in the hot oil in batches for 3-4 minutes, until crisp and golden-brown, then carefully remove with a slotted spoon and drain on kitchen paper.", "Heat a griddle pan (or, ideally, a barbecue).", "Season the steaks with salt and freshly ground black pepper and place onto the griddle pan. Cook for 3-4 minutes on each side for rare, or until cooked to your liking. Remove from the heat and allow to rest for five minutes.", "Heat a frying pan until hot, add the olive oil and mushrooms and sauté for 2-3 minutes, until softened and turning golden-brown.", "Meanwhile, for the watercress salad, whisk the cider vinegar, rapeseed oil and mustard together in a bowl and season, to taste, with salt and freshly ground black pepper. Drizzle the dressing over the watercress in a bowl and mix well.", "To serve, place equal portions of the watercress salad onto four plates. Slice the steaks and place an equal number of slices onto each of the four portions of watercress. Arrange the wild mushrooms and crisp shallots on top of each and serve."]}, {"isVegetarian": false, "title": "Beef goulash", "url": "www_bbc_co_uk_food_recipes_beefgoulash_10656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb sirloin steak, trimmed and cut in strips", "olive oil", "1 medium onion, peeled and sliced thinly", "½ red pepper, de-seeded and sliced", "½ green pepper, de-seeded and sliced", "25g/1oz butter", "sea salt and black pepper", "2 tbsp tomato purée", "200ml/7fl oz beef stock", "3 tbsp paprika", "small bunch flatleaf parsley", "100ml/3½fl oz soured cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Warm a frying pan on the stove until very hot, then brown the steak (in batches) in a little olive oil.", "Colour the onions and peppers in the butter and season. Place in one large pan, together with the browned steak. ", "Pour in the tomato purée, stock and paprika, season and bring to the boil. Cook for between 20 and 40 minutes. Garnish with sour cream and the flatleaf parsley."]}, {"isVegetarian": false, "title": "Beef in designer beer", "url": "www_bbc_co_uk_food_recipes_beefindesignerbeer_67198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb braising steak cut into 2 inch (5 cm) squares ", "425ml/15fl oz designer beer ", "1 tbsp olive oil ", "350g/12oz  onions, peeled and cut in quarters ", "2 garlic cloves, crushed ", "1 heaped tbsp plain flour ", "a few fresh thyme sprigs  ", "2 bay leaves ", "salt and freshly milled black pepper  ", "1 tbsp olive oil ", "1 garlic clove, crushed ", "6x2.5cm/1in thick slices French bread cut slightly diagonally ", "6 level tsp wholegrain mustard ", "110g/4oz grated Gruyère cheese "], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["You can make the croûtons well ahead of time and, to do this, preheat the oven to 180C/350F/Gas 4. Drizzle the olive oil on to the baking sheet add the crushed garlic, then using either your hands or a piece of kitchen paper, spread the oil and garlic all over the baking sheet. Now place the bread slices on top of the oil, then turn them over so that both sides have been lightly coated with the oil. Bake for 20-25 minutes till crisp and crunchy.", "When you're ready to cook the beef, lower the oven temperature to 150C/300F/Gas 2. Take the flameproof casserole, place it over direct heat, then heat the oil until sizzling hot and fry the meat, 3 or 4 pieces at a time, until they turn a dark mahogany colour on all sides. Make sure you don't overcrowd the pan or they will create steam and never become brown. As you brown the meat remove it to a plate then, when all the meat is ready, add the onions to the pan, still keeping the heat high. Toss them around until they become darkly tinged at the edges - this will take about 5 minutes. After that add the crushed garlic, let that cook for about 30 seconds or so, then turn the heat down, return the meat to the casserole and sprinkle in the flour. Using a wooden spoon, stir until all the flour has been absorbed into the juices. It will look rather stodgy and unpromising at this stage but not to worry - the long slow cooking will transform its appearance.", "Now gradually stir in the beer and, when it's all in, let the whole thing gently come up to simmering point, and while that's happening add salt, freshly milled black pepper and the thyme and bay leaves. Then, just as it begins to bubble, put the lid on, transfer it to the centre shelf of the oven and leave it there for 2½ hours. Don't be tempted to taste it now or halfway through the cooking as it does take 2½ hours for the beer to mellow and become a luscious sauce.", "Just before you want to serve the beef, preheat the grill, spread the croûtons with the mustard and sprinkle them with the grated gruyère, then arrange them on top of the meat and pop the casserole under the grill until the cheese is bubbling. Then serve straight away."]}, {"isVegetarian": false, "title": "Beef in oyster sauce", "url": "www_bbc_co_uk_food_recipes_beefinoystersauce_89263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefinoystersauce_89263_16x9.jpg", "ingredients": ["350g/12oz beef fillet", "1 tsp light soy sauce", "1½ tbsp oyster sauce ", "pinch sugar", "salt and freshly ground black pepper", "2 tbsp groundnut oil ", "3 cloves garlic, finely chopped", "1 chilli, de-seeded, finely chopped", "200g/7oz baby spinach leaves", "1 tbsp Shaoxing rice wine or dry sherry", "pinch dried chilli flakes ", "1 tsp groundnut oil ", "100g/3½oz oyster mushrooms", "dash Chinese black rice vinegar or balsamic vinegar", "dash light soy sauce"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, place the fillet in between two sheets of cling film and bash with a meat mallet or rolling pin until half as thin. Slice the beef into thin pieces and place into a bowl, then season with the light soy sauce, oyster sauce, sugar and salt and freshly ground black pepper. Set aside. ", "Heat a wok until smoking and add one tablespoon of the groundnut oil, then add the garlic and chilli. Stir-fry for a few seconds, then add the spinach leaves and toss for a few seconds, until warmed through. Pile onto a large serving plate. ", "Place the wok back on the heat and add the remaining oil, then add the beef slices and stir fry for 2-3 minutes, or until the beef is cooked to your liking. Pour in the Shaoxing rice wine and sprinkle over the dried chilli flakes. Pile the beef over the spinach leaves. ", "For the oyster mushrooms, heat the oil in the wok and add the oyster mushrooms, stir frying for one minute. Add a small splash of water to create some steam to help the mushrooms cook, then season, to taste, with the black rice vinegar and light soy sauce. ", "Spoon the oyster mushrooms over the beef and serve."]}, {"isVegetarian": false, "title": "Beef kebabs with harissa and lemon rice", "url": "www_bbc_co_uk_food_recipes_beefkebabswithhariss_90875", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz dried red chillies, soaked in cold water, drained and roughly chopped", "50g/2oz fresh red chillies, seeds removed, roughly chopped", "2 tsp ground cumin", "2 tsp ground caraway seeds", "1 tbsp smoked sweet paprika", "2 garlic cloves", "2 tbsp tomato purée", "3 tbsp red wine vinegar", "4 tbsp olive oil", "800g/1lb 12oz rump steak, cut into large cubes", "1 tbsp olive oil", "salt and freshly ground black pepper ", "2 red onions, cut into wedges", "1 lemon, juice only", "50g/2oz butter", "2 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "275g/10oz basmati rice", "1 lemon, zest and juice", "450ml/16fl oz chicken stock", "salt and freshly ground black pepper ", "3 tbsp coriander leaves, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the harissa, place all of the harissa ingredients into a food processor and blend to make a smooth paste. Set aside.", "For the kebabs, heat a griddle pan until hot. Place the steak cubes in a bowl and add the olive oil and salt and freshly ground black pepper, to taste. Mix to coat the steak in the seasoning and oil.  ", "Thread the meat onto metal skewers, alternating with the wedges of red onion.", "Place the skewers onto the griddle and cook on each side for 1-2 minutes, or until cooked to your liking. Baste with a little of the harissa every 30 seconds or so. Once the meat is cooked, squeeze over the lemon juice.", "For the lemon rice, heat a lidded sauté pan over a medium heat, add the butter, olive oil, onion and garlic and sauté for two minutes until the onion and garlic are just softened, but not browned.", "Add the rice, lemon zest and juice to the pan and mix well. Add the chicken stock and bring to a simmer. ", "Cover, reduce the heat and simmer for 12-15 minutes until the rice is tender and all the liquid has been absorbed. Season with salt and freshly ground black pepper, to taste, then stir in the coriander.", "Serve the skewers with the rice alongside and with a dollop of harissa."]}, {"isVegetarian": false, "title": "Beef tortilla wraps", "url": "www_bbc_co_uk_food_recipes_beefkoftasandguacamo_89140", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefkoftasandguacamo_89140_16x9.jpg", "ingredients": ["150g/5½oz lean beef mince", "1 garlic clove, finely chopped", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 ripe avocado, peeled, stone removed, chopped", "½ lime, juice only, plus extra to serve", "1½ tbsp chopped fresh coriander leaves", "2 flour tortillas", "3 tbsp plain yoghurt", "1 Little Gem lettuce, leaves separated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the beef mince, garlic, salt and pepper together in a bowl. Then roll the mince into about 6 balls using your hands. Rub the beef with olive oil. Cook in a hot frying pan for 8-10 minutes, turning regularly, until golden-brown and cooked through.", "For the guacamole, put all of the guacamole ingredients in a bowl and mash to a rough mixture with a fork.", "Spread the tortillas with the guacamole, fill with the hot beef and add some yoghurt. Squeeze over a little more lime juice to taste, add a few lettuce leaves, then roll the tortilla up."]}, {"isVegetarian": false, "title": "Beef koftas with grilled fig and halloumi salad", "url": "www_bbc_co_uk_food_recipes_beefkoftaswithgrille_89762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["475g/1lb 1oz beef mince", "1 garlic clove, chopped", "½ tsp ground coriander", "1 tsp ground cumin", "salt and freshly ground black pepper", "4 figs, thickly sliced", "200g/7oz halloumi, thickly sliced", "½ lemon, juice only", "3 tbsp extra virgin olive oil", "1 bunch mixed salad leaves of your choice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak eight small wooden skewers for ten minutes in cold water.", "Place the mince, garlic, coriander and cumin into a bowl and season well with salt and freshly ground black pepper. Mix together well, then divide the mixture into eight equal portions.", "Press each portion of the mince mixture around a wooden skewer to form a sausage, three quarters the length of the skewer, then place onto a plate in the fridge to chill.", "Heat a griddle pan until hot. Place the skewers onto the griddle and cook for 2-3 minutes on each side, or until completely cooked through.", "Heat a separate frying pan until hot. Add the fig slices and fry on each side for 30 seconds.", "Remove the figs and set aside, then add the halloumi and cook on each side for one minute, or until golden-brown all over.", "Whisk the lemon juice, olive oil, salt and freshly ground black pepper together in a clean bowl, then add the salad leaves. Toss well to coat.", "To serve, place arrange slices of fig and halloumi onto the centre of each plate. Place a pile of the dressed salad leaves on top, then top each dish with two koftas. Drizzle over a little of the remaining dressing and serve."]}, {"isVegetarian": false, "title": "Beef, onion and potato pasty-pie", "url": "www_bbc_co_uk_food_recipes_beefonionandpotatopa_77606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb2oz potatoes", "salt", "300g/10oz rump steak, cut into 1cm/0.5in dice or strips", "2 onions, peeled and chopped ", "4 thyme sprigs, leaves removed ", "1 garlic clove, chopped", "200ml/7fl oz beef stock", "1 tbsp tomato ketchup", "splash red wine", "2 x 28cm/11in circles of shortcrust pastry (ready-made pastry is fine)", "salt and freshly ground black pepper", "2 eggs, beaten"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Peel and slice the potatoes and boil them in salted water for 10 minutes until parboiled. Drain and put to one side.", "In a hot pan, sear the beef until well browned, then remove from the pan. Cook the onions, thyme and garlic until softened and add the beef.", "Pour in the stock, the tomato ketchup and a splash of red wine and allow most of the moisture to boil away. Make sure the mixture is not too runny.", "Preheat the oven to 200C/400F/Gas 6. Lay the sliced potatoes on the bottom circle of pastry leaving a 3.5cm/1½in margin around the edge.", "Season the potato slices as you layer them on top of the pastry - you should end up with a layer of potatoes about 2.5cm/1in thick. Now spoon the moist beef and onion mix over the top and spread it out.  If you have reduced it enough, the juices will not run off the edges.  ", "Lay the other circle of pastry on top and crimp the edges well.", "Brush liberally with egg wash and score any pattern you like into the pastry. Cut a tiny hole in the top to allow steam to escape and bake for 30 minutes."]}, {"isVegetarian": false, "title": "Beef Madras", "url": "www_bbc_co_uk_food_recipes_beefmadras_67360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp groundnut oil\t\t\t ", "2 green cardamoms (or black if you can get them)", "5cm/2in length cassia bark or cinnamon stick\t\t", "1 medium onion, peeled and sliced\t\t\t ", "255g/9oz rib-eye steak, trimmed and cut into thin strips ", "1 green chilli, chopped", "2 garlic cloves, peeled and sliced", "¼ tsp turmeric", "¼ tsp salt", "½ tsp ground cumin", "½ tsp ground coriander", "2 tsp tomato purée", "½ tsp peeled and grated root ginger", "pinch of garam masala", "30g/1oz fresh coriander leaves, washed and chopped, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok or large frying pan, then add the cardamoms and cassia bark. Fry for 1 minute. ", "Tip in the onions and fry for 1 minute. ", "Add the beef, followed by the chilli and garlic and fry on a medium heat for 4 minutes.", "Then add the turmeric, salt, cumin and coriander and stir for another minute.", "Mix the tomato purée with 150ml/5fl oz of hot water (double this amount if you want more sauce) from the kettle and add to the pan. Cook for 3 minutes. ", "Mix in the ginger and sprinkle over the garam masala and the coriander leaves. ", "Serve immediately with a naan or in hot pitta breads."]}, {"isVegetarian": false, "title": "Beef rendang", "url": "www_bbc_co_uk_food_recipes_beefrendang_78767", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefrendang_78767_16x9.jpg", "ingredients": ["1 onion, roughly chopped", "1 tbsp chopped fresh ginger", "1 tbsp chopped galangal (or another tbsp of the above)", "1 tbsp chopped garlic", "1 lemongrass stalk, tough outer layer removed and roughly chopped", "1 tsp turmeric", "6 long red dried chillies, soaked in water and roughly chopped", "2 tbsp sunflower oil", "1 cinnamon stick", "6 cardamom pods", "650g/1lb 7oz braising steak, cut into 2cm/1inch cubes", "4 kaffir lime leaves", "zest of a kaffir lime or lime", "400ml/14fl oz coconut milk", "1 tbsp of tamarind paste or juice of a lime", "50g/2oz desiccated coconut flakes", "coriander sprigs to garnish", "1 tbsp sunflower oil", "1 cinnamon stick", "4 cardamom pods", "250g/9oz basmati rice", "600ml/1pint 1½fl oz water ", "2 tbsp chopped fresh coriander", "sea salt", "deep-fried shallots", "1 deep-fried red chilli"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the rendang paste, place the onion, ginger, galangal, garlic, lemongrass, turmeric and chillies into a food processor.  Blend to form a smooth purée.", "Heat a wok and add the oil.  Fry the paste over a high heat until the paste turns darker and is highly aromatic. ", "Add the cardamom pods (crush the cardamom pods gently with the back of a spoon before frying) and the cinnamon stick broken in half and cook for another minute then add the meat. ", "Fry the meat in the paste stirring all the time, until it is well browned.", "Pour over the coconut milk and tamarind purée and bring to a gentle simmer, add the kaffir lime leaves and zest. ", "Season with salt, stir well then reduce to a simmer. ", "Cook for between one hour and one hour and a half, stirring frequently during this time.  The meat should be really tender and the sauce really reduced and rich.", "Meanwhile toast the coconut flakes in a dry pan.  Keep a close eye on this, as it will burn really quickly. It should be a lovely deep brown colour when ready.  Blend to a powder in a small blender or pound in a pestle and mortar.  When the rendang is ready stir into the mixture making sure it is well mixed in.", "For the herby rice, wash the rice really well under cold water, the water will run clear when it is washed enough. Allow to drip dry Heat the oil in heavy-based saucepan that has a tight fitting lid. ", "Add the spices and fry for a minute. ", "Add the rice and fry until the grains begin to turn an opaque white. ", "Add the water and a good pinch of salt.  ", "Bring to the boil then allow to bubble away until nearly all the water has been absorbed and air holes are beginning to appear. ", "At this point pop the lid on. Leave the heat on underneath for a minute (this will create lots of steam) then allow to stand for five minutes (do not remove the lid). ", "Keep warm until everything else is ready. You can hold rice like this for up to half an hour.", "To serve, mix the herbs into the rice and divide between four warmed serving dishes.  Next spoon on the rendang, finish with a few sprigs of coriander and serve immediately, garnished with the deep-fried shallots and chilli."]}, {"isVegetarian": false, "title": "Beef, oyster and ale pie", "url": "www_bbc_co_uk_food_recipes_beefoysterandalepie_92453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz beef braising steak, chopped", "salt and freshly ground black pepper", "50ml/2floz vegetable oil ", "175g/6oz smoked bacon, cut into large lardons", "125g/4½oz onion, chopped ", "125g/4½oz carrots, peeled, cut into batons ", "1-2 garlic cloves, peeled, chopped ", "125g/4½oz baby button mushrooms", "25g/1oz plain flour ", "500ml/17½fl oz dark ale", "1 tbsp chicken bouillon powder", "2 litres/3½ pints boiling water ", "1 large bouquet garni (bay leaves, parsley and thyme, tied together with kitchen string) ", "1 tbsp wholegrain mustard", "350g/12oz new potatoes, larger ones halved", "1 tsp tarragon, leaves only, chopped", "12 large fresh oysters, shucked", "250g/9oz ready-rolled puff pastry", "1 free-range egg, plus 1 egg yolk, beaten together with a pinch of salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the beef with salt and freshly ground black pepper. Heat a large pan until hot, then add the vegetable oil and fry the beef for 2-3 minutes, turning occasionally, until browned all over.", "Add the smoked bacon and fry for a further 1-2 minutes, then add the onion, carrots, garlic and mushrooms. Fry for 2-3 minutes, then add the flour and stir well to prevent any lumps from forming. Cook for a further minute. ", "Pour in the dark ale, bring to the boil and cook for 8-10 minutes, or until reduced by half. Dissolve the chicken bouillon powder in the water, then add to the pan along with the bouquet garni, wholegrain mustard and new potatoes. Bring to the boil and season with salt and freshly ground black pepper, then reduce to a simmer and cook for two hours, or until the beef is tender.  ", "Add the chopped tarragon to the pan and season, to taste, if necessary. Remove the pan from the heat and set aside to cool. Discard the bouquet garni.", "Preheat the oven to 200C/400F/Gas 6. ", "Spoon the beef mixture into a 20cm x 15cm/8in x 6in pie dish and add the oysters, folding them gently into the beef mixture. ", "Roll out the puff pastry until it is 3mm thick, then cut out pieces of pastry large enough to fit over the top of the pie dishes as a lid, with a bit of overhang. Crimp the edges with your fingers, securing the pastry to the dish. ", "Prick the surface of the pastry with a fork, then brush with the beaten egg. Place the pies onto a baking tray and bake in the oven for 20 minutes, or until the pastry is golden-brown and crisp.", "Serve the pies with sides of lightly boiled seasonal green vegetables, such as green beans, broccoli or spinach."]}, {"isVegetarian": false, "title": "Beef rendang with Thai herb salad and sticky rice", "url": "www_bbc_co_uk_food_recipes_beefrendangwithlemon_90061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemongrass stalks, roughly chopped", "20g/¾oz coriander seeds", "½tsp cumin seeds", "½tsp turmeric powder", "50g/2oz block coconut cream", "1½ large onions, sliced", "3 garlic cloves, chopped", "3 red chillies, seeds removed, chopped", "1 thumb-sized piece ginger, peeled and chopped", "1 bay leaf", "750g/1lb 10oz boneless beef shin, cut into 2.5cm/1in cubes", "400g/14oz canned coconut milk", "250ml/8¾fl oz strong veal or beef stock, heated", "110g/4oz Chinese cabbage, shredded", "2 lime leaves, sliced into thin strips", "2 red chillies, seeds removed, sliced into thin strips", "25g/1oz pea shoots", "50g/2oz mizuna leaves", "small handful mint leaves", "1 spring onion, sliced diagonally", "50g/2oz green beans, cut into 2cm/1in pieces", "small handful fresh coriander leaves", "small handfulfresh Thai basil leaves (or normal basil leaves)", "small handful bean sprouts", "1 lime, juice only", "1 tsp sunflower oil", "1 tsp fish sauce", "1 red chilli, finely diced", "1 garlic clove, finely sliced", "200g/7oz Thai jasmine rice", "200g/7oz Thai sticky rice", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the beef rending, pound the lemongrass to a pulp using a pestle and mortar. Tip the lemongrass into a small bowl. ", "Heat the frying pan over a medium heat. Add the coriander, cumin seeds and turmeric and dry fry until fragrant. Tip the spices into a spice grinder or the pestle and mortar. Grind the spices to a powder if using a grinder, or pound in a pestle and mortar until the spices are as smooth as possible. Set aside.", "In a wide pan or cast-iron wok, heat the block of coconut cream until it melts, keeping the heat low so that it does not burn. ", "Add the onions, garlic, chillies, ginger and pounded lemongrass to the pan and cook gently until the onions have softened and the mixture is fragrant. ", "Add the reserved ground spices and the bay leaf and fry for a few minutes more.", "Add the meat and increase the heat so that it browns on all sides. Stir until the meat is completely coated with the spices - this will take a few minutes. ", "Add the coconut milk, bring to the boil, then add the hot stock. ", "Turn the heat up to high and continue cooking for at least 1- 1½ hours, stirring occasionally until the sauce becomes thick and coats the meat well.", "For the salad, combine all the salad ingredients in a salad bowl and mix well. Set aside.", "For the dressing, whisk together all the dressing ingredients in a bowl. Set aside.", "For the sticky rice, tip the rice into a sieve and wash the two varieties of rice three times, draining each time. ", "Place the rice into a saucepan and cover with water to leave 1cm/½in water above the level of the rice. Add the salt and cover with a lid. Place over a high heat and bring to the boil.", "Boil the rice for five minutes, then, without removing the lid, turn the heat off and leave to steam for 20 minutes.", "To serve, pour the dressing into the salad and mix to combine. Pile the rice onto four plates and spoon the beef rending alongside. Serve the salad separately."]}, {"isVegetarian": false, "title": "Beef rolls in tomato ragù", "url": "www_bbc_co_uk_food_recipes_beefrollsintomatorag_67356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 small sirloin steaks", "30g/1oz parmesan cheese, grated", "4 garlic cloves, finely chopped", "handful flatleaf parsley, torn", "salt and freshly ground pepper", "6 tbsp olive oil", "150ml/¼ pint red wine", "1 onion, finely chopped", "1 celery stalk, very finely chopped", "2 tbsp tomato purée, diluted in 400ml/14fl oz lukewarm water", "2x400g cans chopped tomatoes", "handful fresh basil leaves, torn"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Arrange the slices of meat on a chopping board or a clean work surface and flatten them with a meat tenderiser (if you don't have one, place a flat wooden spatula  over the meat and bash with the palm of your hand).  Season with salt and pepper, then sprinkle with the grated parmesan, garlic, and parsley.  Roll each slice up tightly and secure well with toothpicks.", "For the sauce, heat the olive oil in a large saucepan.  When hot, lower the heat, add the meat rolls and seal well on all sides.  Increase the heat again, add the wine and  simmer until it has reduced by half.  Remove the meat and set aside.", "Add the onion and celery to the pan and stir well.  Cook until the remainder of the wine has nearly evaporated, then put the meat back in the pan and pour over the  diluted tomato concentrate and the chopped tomatoes.  Season with salt and pepper and stir in the basil. Lower the heat and cover with a lid, but not completely, so some  of the steam can escape.  Cook gently for 2 hours, stirring from time to time.  Check the seasoning.", "Serve the tomato sauce with some cooked pasta such as tagliatelle or large rigatoni. Then serve the meat rolls as a main course with a mixed leaf salad."]}, {"isVegetarian": false, "title": "Beef satay with crisp noodles", "url": "www_bbc_co_uk_food_recipes_beefsataywithcrispyn_87139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rib-eye beef, cut into strips", "½ tbsp soy sauce", "2 tbsp honey", "½ tsp chilli flakes", "1 tbsp sesame oil", "1 lime, zest and juice", "1 tbsp olive oil", "300ml/½ pint vegetable oil, for deep frying", "50g/2oz rice noodles", "1 tbsp chopped peanuts, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef satay, place the beef into a small bowl with the soy sauce, honey, chilli flakes, sesame oil, lime juice and zest and leave to marinate for ten minutes. ", "Thread the beef onto skewers that have been soaked in water. Heat the olive oil in a pan, add the skewers and brown them on all sides for 1-2 minutes. ", "For the noodles, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully drop in the noodles and cook for two minutes, or until puffed up and crisp. Carefully remove with a slotted spoon and drain on kitchen paper.", "To serve, pile the noodles onto a serving plate, top with the beef satay kebabs and sprinkle with chopped peanuts."]}, {"isVegetarian": false, "title": "Beef sausage toad-in-the-hole with onion gravy", "url": "www_bbc_co_uk_food_recipes_beefsausagetoadinthe_86522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "8 free-range eggs", "570ml/1 pint milk", "1 tbsp olive oil", "6 beef sausages", "75g/3oz beef dripping", "2 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper", "50g/2oz butter", "2 onions, sliced", "1 tbsp instant gravy granules", "1 tbsp yeast extract", "400ml/14fl oz vegetable stock", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the toad-in-the-hole, place the plain flour into a bowl and make a well in the centre. Whisk in the eggs and milk to make a smooth batter. Place in the fridge overnight.", "The next day, when you're ready to cook the toad-in-the-hole, preheat the oven to 220C/425F/Gas 7.", "Heat the olive oil in a frying pan, add the sausages and cook, turning frequently, until browned on all sides.", "Place the beef dripping into a roasting tin and place in the oven. Remove the batter from the fridge and whisk lightly until smooth and combined - it may have separated slightly overnight. Add the thyme leaves and season with salt and freshly ground black pepper.", "Remove the roasting tin from the oven, add the sausages and pour over the batter. Transfer to the oven and bake for 35-40 minutes, then open the oven door to remove the steam. Lower the oven temperature to 180C/350F/Gas 4 and cook for a further ten minutes, until golden-brown. Remove from the oven and leave to stand for a few minutes.", "For the gravy, heat most of the butter in a pan, add the onions and cook for ten minutes, or until soft.", "Add the gravy granules and yeast extract and stir to combine. Add the vegetable stock and bring to the boil. Reduce the heat and simmer for five minutes until thickened. Season with salt and freshly ground black pepper and stir in the remaining knob of butter.", "To serve, place portions of the toad-in-the-hole onto serving plates and pour over the gravy."]}, {"isVegetarian": false, "title": "Beef slices cooked with oloroso sherry", "url": "www_bbc_co_uk_food_recipes_beefslicescookedwith_92904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 2oz potatoes, such as King Edward or Maris Piper, peeled, cut into equal-sized pieces", "2 garlic cloves, peeled", "2 bay leaves", "salt and freshly ground black pepper", "75-110ml/3-4fl oz extra virgin olive oil", "4 x 200g/7oz slices fillet steak, sliced into 1cm/½in wide strips", "salt and freshly ground black pepper ", "2 tbsp extra virgin olive oil, plus extra for drizzling", "1 garlic clove, peeled, finely diced", "1 fresh rosemary sprig", "1 x 225g/8oz jar piquillo peppers, drained, sliced", "6 tbsp dry oloroso sherry", "4 fresh flatleaf parsley sprigs, leaves only, chopped", "4 fresh mint sprigs, chopped", "2 heads crisp lettuce, such as Romaine lettuce, leaves separated, sliced", "25g/1oz flaked toasted almonds", "1 pinch hot smoked paprika"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the olive oil mash, place the potatoes into a large saucepan and just cover with cold water. Add a pinch of salt, the garlic, bay leaves and two tablespoons of the olive oil, then bring the water to the boil. Reduce the heat until the liquid is simmering, then continue to simmer for 10-15 minutes, or until the potatoes are tender. Drain well.", "Return the drained potatoes to the pan, then place the pan over the residual heat for a few seconds to drive off any excess moisture.", "Mash the potatoes until smooth using a potato masher or ricer. Stir in the olive oil until well combined, then season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the beef, season the strips of beef, to taste, with salt and freshly ground black pepper. ", "Heat the oil in a non-stick frying pan or wok over a high heat until it is almost smoking. Add the garlic, beef strips and rosemary and stir-fry for 1-2 minutes, or until the beef has browned.", "Add the piquillo pepper slices and continue to stir-fry for a further minute, then pour in the sherry and boil for 2-3 minutes, or until most of the liquid has evaporated.", "Remove the pan or wok from the heat, then stir in the chopped parsley and mint leaves. ", "To serve, divide the sliced lettuce leaves equally among four serving plates. Spoon over the beef, vegetables and cooking juices. Drizzle over a little more extra virgin olive oil and sprinkle over the flaked almonds and smoked paprika. Spoon the olive oil mash alongside."]}, {"isVegetarian": false, "title": "Beef steak with griddled vegetables and chilli pesto", "url": "www_bbc_co_uk_food_recipes_beefsteakwithgriddle_71404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sweet potato, peeled and cut into 2.5cm/1inch dice", "1 courgette, peeled and cut into 2.5cm/1inch dice", "1 banana shallot, peeled and diced", "1 red chilli, de-seeded and diced", "4 tbsp olive oil", "few sprigs rosemary", "few sprigs thyme", "2 garlic cloves, peeled", "2 tbsp olive oil ", "2 beef steaks", "salt", "freshly ground black pepper", "1 red chilli, de-seeded and diced", "1 chilli, deseeded and roughly chopped", "4 tbsp olive oil", "small handful fresh basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the vegetables, place the potato, courgette, shallot and chilli into a large bowl and coat with the olive oil. ", "Add the rosemary, thyme sprigs and garlic and toss together.", "Heat an ovenproof griddle pan over a high heat and char-grill the vegetables for 4-5 minutes. ", "Transfer the pan to the oven and roast for 8-10 minutes or until the vegetables are soft.", "Meanwhile, generously season the beefsteaks with salt and freshly ground black pepper.", "Heat a griddle pan until searing hot.", "Fry the beefsteaks with the chilli for 2-3 minutes either side, or according to personal taste.", "To make the chilli pesto, place the chilli, olive oil and basil leaves into a mini-food processor and blitz until smooth.", "Serve the steak alongside the vegetables and drizzle with the chilli pesto."]}, {"isVegetarian": false, "title": "Beef stew with dumplings", "url": "www_bbc_co_uk_food_recipes_beefstewwithdumpling_87333", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstewwithdumpling_87333_16x9.jpg", "ingredients": ["2 tbsp olive oil", "25g/1oz butter", "750g/1lb 10oz beef stewing steak, chopped into bite-sized pieces ", "2 tbsp plain flour ", "2 garlic cloves, crushed ", "175g/6oz baby onions, peeled", "150g/5oz celery, cut into large chunks ", "150g/5oz carrots, cut into large chunks", "2 leeks, roughly chopped ", "200g/7oz swede, cut into large chunks", "150ml/5fl oz red wine", "500ml/18fl oz beef stock ", "2 fresh bay leaves", "3 tbsp fresh thyme leaves ", "3 tbsp chopped fresh flatleaf parsley ", "Worcestershire sauce, to taste ", "1 tbsp balsamic vinegar, or to taste", "salt and freshly ground black pepper ", "125g/4½oz plain flour, plus extra for dusting", "1 tsp baking powder", "pinch salt", "60g/2½oz suet", "water, to make a dough", "mashed potato ", "1 tbsp chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.", "Sprinkle over the flour and cook for a further 2-3 minutes.", "Add the garlic and all the vegetables and fry for 1-2 minutes.", "Stir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.", "Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.", "For the dumplings, sift the flour, baking powder and salt into a bowl.", "Add the suet and enough water to form a thick dough.", "With floured hands, roll spoonfuls of the dough into small balls.", "After two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)", "To serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley."]}, {"isVegetarian": false, "title": "Beef stew with Lyonnaise potatoes", "url": "www_bbc_co_uk_food_recipes_beefstewwithlyonnais_85110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, chopped", "100g/3½oz beef fillet, chopped into 2.5cm/1in cubes", "salt and freshly ground black pepper ", "1 tbsp tomato ketchup", "100ml/3½fl oz red wine", "75g/2¾oz tinned borlotti beans, drained", "1 carrot, peeled and chopped", "75g/2¾oz ratte potatoes (or other small, waxy potatoes), peeled and sliced", "1 tbsp fresh breadcrumbs, to serve", "50g/1¾oz unsalted butter", "1 tbsp olive oil", "100g/3½oz ratte potatoes (or other small, waxy potatoes), blanched and sliced", "1 garlic clove, sliced", "½ onion, thinly sliced", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef stew, melt the butter with the oil in a frying pan over a low heat and fry the onion and garlic until soft.", "Add the beef pieces and cook, stirring frequently, until browned on all sides. Season with salt and freshly ground black pepper.", "Add the ketchup and wine and stir well.", "Add the beans, carrot and potatoes and simmer for 10-12 minutes. ", "For the Lyonnaise potatoes, melt the butter with the oil in a frying pan over a medium heat and fry the potatoes for 8-10 minutes, until golden-brown.", "Add the garlic and onion, season with salt and freshly ground black pepper and cook gently until softened.", "To serve, place the stew into a bowl and sprinkle over the breadcrumbs. Place the potatoes alongside and sprinkle over the parsley."]}]