[{"isVegetarian": true, "title": "Pan-fried tomatoes", "url": "www_bbc_co_uk_food_recipes_panfriedtomatoes_84048", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch fresh basil ", "2 tbsp olive oil, plus 1 tbsp extra", "1 garlic clove, crushed", "sea salt and freshly ground black pepper", "2 tomatoes, thickly sliced", "25g/1oz plain flour"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the basil, oil and garlic into a food processor and blend until smooth. Season, to taste, with sea salt and freshly ground black pepper.", "Spoon the basil oil onto one side of the cut tomatoes.", "Place the extra tbsp oil into a frying pan over a high heat.", "Dredge the tomato slices in the flour, then place the tomatoes into the hot pan and fry for 2-3 minutes on each side, or until golden."]}, {"isVegetarian": false, "title": "Pan-fried squid with borlotti beans, chilli, anchovy, parsley and chopped rocket", "url": "www_bbc_co_uk_food_recipes_panfriedsquidwithbor_85600", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/11oz dried borlotti beans", "1 sprig sage", "1 red chilli, pricked with a knife", "1 garlic clove, cut into quarters", "2 tomatoes", "3 tbsp olive oil", "1 tsp red wine vinegar", "salt and freshly ground black pepper ", "6 whole fresh squid", "drizzle extra virgin olive oil", "1 red chilli, de-seeded and finely chopped", "3 anchovy fillets, chopped", "2 tbsp flatleaf parsley, chopped", "½ lemon, juice only", "salt and freshly ground black pepper", "handful chopped rocket, dressed with olive oil and lemon juice"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the beans, soak the borlotti beans overnight in plenty of clean cold water.", "Drain the beans and transfer to a large pan with three times the volume of water. Add the sage, chilli, garlic and tomatoes.", "Bring to the boil then reduce the heat to a simmer. Simmer gently for one hour or until the beans are tender (the time may vary depending on the age of the beans).", "Drain off three-quarters of the cooking liquor then transfer the beans and the remaining cooking liquor into a bowl. Remove and discard the chilli and sage. Remove the garlic, mash with a fork then return to the beans and stir through.", "Season with salt and black pepper and stir in the olive oil and vinegar.", "For the squid, peel off the wings and outer membrane and remove the head and intestines. Cut in half lengthways and scrape out the inside with a knife. Wash thoroughly with cold water and pat dry.", "Lay the squid pieces flat, skin-side down, and score with a sharp knife in a criss-cross pattern.", "Season the squid with salt and freshly ground black pepper and rub a little olive oil into the skin.", "Place a non-stick pan over a medium heat. When hot, add the squid, scored side down. Cook for one minute until golden-brown, then turn over. ", "Add the chilli, anchovy fillets, parsley and lemon juice to the pan. ", "Remove the squid and quickly slice into bite-sized pieces. Return immediately to the pan and toss briefly through the other ingredients.", "To serve, place a spoon of the borlotti bean mixture in the centre of a plate. Place a small amount of rocket on top and then the chopped squid."]}, {"isVegetarian": false, "title": "Pan-fried trout with almond purée", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithalm_86542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7g/½oz unsalted butter", "1 shallot, chopped ", "pinch salt", "600ml/1 pint 2fl oz milk", "200g/7oz almonds, flaked or whole, lightly toasted", "dash double or whipping cream", "dash almond oil", "freshly ground black pepper, to taste", "15g/½oz unsalted butter", "½ tbsp olive oil", "4 whole trout, scaled, gutted and heads removed ", "salt and freshly ground black pepper ", "1 lemon, juice only", "small bunch parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the almond purée, in a medium-sized pan melt the butter and sweat the chopped shallots until soft and transparent. Season with salt, to taste.", "Add the milk and almonds and bring to the boil. Cook for 30 minutes.", "Place the almonds and shallots into a blender with a few tablespoons of the milk they have been cooked in. Blend to make a fine purée. Adjust the consistency by adding more cooking liquid if required and a dash of cream and almond oil to taste.", "Return the purée to a smaller pan, season with salt and freshly ground black pepper and keep hot.", "For the trout, melt the butter with the olive oil in a non-stick, ovenproof pan. Heat until the butter is foaming. Season the trout with salt and freshly ground black pepper before placing them into the pan. Cook for approximately three minutes on the first side before carefully turning the trout over and transferring the pan to the oven for ten minutes.", "Remove the pan from the oven. Squeeze the lemon juice over the trout and leave to rest for a few minutes.", "To serve, spoon some of the hot almond purée onto each serving plate before placing the fish onto the plate. Add the parsley to the warm cooking oil in the pan, stir, then spoon over and around the fish."]}, {"isVegetarian": false, "title": "Pan-fried trout with orange hollandaise and fennel and grapefruit salad", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithora_92674", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp lemon juice", "2 tsp white wine vinegar", "2 large free-range egg yolks", "125g/4½oz butter", "pinch salt", "1 orange, zest only", "salt and freshly ground black pepper", "50g/2oz unsalted butter", "1 whole trout, filleted, skin removed", "1 orange, segmented (collect and reserve the juice released as you segment the orange in a bowl)", "1 pink grapefruit, segmented (collect and reserve the juice released as you segment the grapefruit in a bowl)", "1 fennel bulb, finely sliced", "2 shallots, peeled, finely sliced", "2 tbsp chopped fresh parsley", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the orange hollandaise, heat the lemon juice and white wine vinegar in a non-reactive pan until just boiling. ", "Meanwhile, heat the butter in a heavy-based pan over a low to medium heat until melted. (NB: Do not overcook the butter or it will burn.) ", "Blend the egg yolks and salt in a food processor until well combined. ", "With the motor running, gradually add the hot lemon and vinegar mixture in a thin stream, until all of the mixture has been fully incorporated into the egg yolks.", "With the motor running, gradually add the melted butter in a thin stream, until all of the butter has been fully incorporated into the mixture and the sauce has thickened.", "Transfer the hollandaise sauce to a bowl, then stir in the orange zest and season, to taste, with salt and freshly ground black pepper. Set aside (keep warm).", "For the trout and orange salad, heat 25g/1oz of the butter in a pan over a medium heat. When the butter is foaming, add the trout fillets and fry for 2-3 minutes on each side, or until cooked through. (NB: The trout is cooked through when the flesh is opaque.) Remove from the pan and keep warm.", "Heat the remaining 25g/1oz of butter in a separate frying pan over a medium heat. When the butter is foaming, add the orange and grapefruit segments and fry on both sides until caramelised.", "Meanwhile, blanch the sliced fennel and shallots in a large pan of boiling, salted water. Drain well, then refresh in ice-cold water. Drain again.", "In a large bowl, mix together the blanched fennel and shallots, caramelised orange and grapefruit and chopped parsley until well combined.", "Whisk together the extra virgin olive oil and the juices reserved from the segmented orange and grapefruit. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the fennel and grapefruit salad equally between two serving plates. Place one trout fillet on top of each portion. Drizzle over the orange hollandaise. Drizzle the oil and citrus dressing around the edge of the plates."]}, {"isVegetarian": false, "title": "Pan fried trout with new potatoes and green beans", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithnew_76752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz new potatoes", "110g/4oz French beans", "knob of butter", "2 trout fillets", "salt and freshly ground black pepper", "55g/2oz unsalted butter, melted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and boil the new potatoes for 8-10 minutes, or until tender, and the beans for 3-4 minutes. Drain.", "Gently heat the butter in a non-stick frying pan. Season the trout fillet and pan fry for 2-3 minutes on each side. ", "Transfer the trout to a serving plate. Spoon the new potatoes and beans alongside and drizzle with the melted butter to serve."]}, {"isVegetarian": false, "title": "Pan-fried trout with rhubarb and mizuna and croûton salad", "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithrhu_87935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter", "2 trout, filleted and skinned", "salt and freshly ground black pepper ", "2 stems rhubarb, sliced very thinly", "2 tsp caster sugar", "½ tsp ground ginger", "½ crusty white loaf", "2 tbsp olive oil", "salt and freshly ground black pepper ", "½ lemon, juice and zest", "1 tsp Dijon mustard", "salt and freshly ground black pepper ", "3-4 tbsp extra virgin olive oil", "50g/2oz mizuna leaves", "50g/2oz baby spinach leaves", "25g/1oz flatleaf parsley leaves"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the trout, heat a frying pan until hot and add half of the butter.", "Season the trout with salt and freshly ground black pepper, to taste, and place in the pan.", "Cook for two minutes, before carefully turning over with a fish slice and frying for a minute more. Remove the fish from the pan and set aside in a warm place.", "Heat a separate frying pan and add the remaining butter. Add the rhubarb, sugar and ground ginger and stir fry briefly until the rhubarb has just softened and the sugar has dissolved. Set aside in a warm place.", "For the croûtons, slice the crusts from the bread and cut into 1cm/½in cubes.", "Heat a frying pan until hot and add the olive oil. Add the cubed bread and salt and freshly ground black pepper, to taste. Fry for 2-3 minutes until golden-brown and crunchy.", "Transfer the fried bread to a plate lined with kitchen paper.", "For the salad, place the lemon juice and zest into a small bowl and add the mustard. Season with salt and freshly ground black pepper and whisk in the olive oil.", "Place the mizuna, baby spinach and flatleaf parsley leaves into a bowl, along with the croutons and the dressing and mix to combine.", "Divide the trout equally among four plates and top with some of the rhubarb. Place a pile of salad alongside and serve."]}, {"isVegetarian": false, "title": "Pan-fried turbot with wild mushrooms, mashed potatoes and cream sauce", "url": "www_bbc_co_uk_food_recipes_panfriedturbotwithwi_87179", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "2 tbsp olive oil", "salt and freshly ground black pepper ", "4 x 150-175g/6-7oz turbot fillets, skinned", "175ml/6fl oz white wine", "175ml/6fl oz fish stock", "175ml/6fl oz double cream", "55g/2oz butter", "2 tbsp olive oil", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "200g/8oz mixed wild mushrooms", "½ lemon, juice only", "2 tbsp flat leaf parsley, roughly chopped", "mashed potato"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot and add the butter and the olive oil.", "Season the fish with salt and freshly ground black pepper and place into the pan when the oil and butter are sizzling hot. Cook the turbot fillets for 2-3 minutes on each side, or until golden brown all over.", "For the cream foam, pour the white wine into a pan over a medium heat and bring to the boil. Boil until reduced by two thirds, then add the fish stock. Bring back to the boil and cook until the liquid has reduced by two thirds.", "Add the cream, bring back to the boil and cook until the liquid has reduced by half, then season, to taste, with salt and freshly ground black pepper. Set aside and keep warm until ready to serve.", "For the mushrooms, heat a clean frying pan and add the butter and the olive oil. Once hot add the shallots and garlic and fry for 2-3 minutes, until softened.", "Add the mushrooms and cook for a further two minutes, then season, to taste, with salt and freshly ground black pepper and add the lemon juice and parsley.", "Using a hand blender, blend the cream sauce until light and foaming.", "To serve, place a large spoonful of mashed potato into the centre of each plate. Place a turbot fillet on top of each and spoon the mushroom mixture around the edge of the potato. Spoon a little of the sauce foam over the mushrooms and serve."]}, {"isVegetarian": false, "title": "Pan-fried veal fillet with wild mushrooms, asparagus, wild garlic and sherry sauce", "url": "www_bbc_co_uk_food_recipes_panfriedvealfilletwi_88996", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz unsalted butter ", "75g/3oz shallots, sliced ", "10 sprigs fresh thyme", "110g/4oz button mushrooms, sliced ", "200ml/7fl oz dry Amontillado sherry ", "200ml/7fl oz chicken stock ", "200ml/7fl oz double cream ", "salt and freshly ground black pepper", "4 x 175g/6oz rosé veal fillets, cut into medallions ", "salt and freshly ground black pepper", "110g/4oz butter ", "1 tbsp olive oil ", "20 garlic cloves, peeled and blanched 3 times (place in cold water, bring to the boil, drain and refresh in cold water and repeat twice more)", "sprig fresh thyme", "20 asparagus tips, peeled and trimmed", "150g/5oz mixed wild mushrooms (such as mousserons, girolles, pied blue)", "110g/4oz wild garlic", "110g/4oz baby spinach leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat a frying pan until just hot, add half the butter and the shallots. Cook over a low heat until soft and transparent. ", "Add the thyme and mushrooms and cook until the mushrooms have softened.", "Add the sherry, turn up the heat and simmer until the liquid is reduced in volume by half.", "Add the chicken stock and simmer until the liquid has reduced in volume by half again.", "Add the cream and simmer until the liquid has reduce in volume by half again.", "Whisk in the remaining butter, pass through a fine sieve into a clean pan and season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the veal, season the veal medallions with salt and freshly ground black pepper.", "Heat a frying pan until hot and add a third of the butter and all of the olive oil. Add the veal and fry gently for 2-3 minutes, without turning, until golden-brown on one side.", "Turn the veal over, add the garlic and thyme and fry for 2-3 minutes or until the veal is golden-brown on both sides and the garlic is golden in colour and soft.", "Remove the veal and garlic from the pan and leave to rest in a warm place.", "Spoon off any excess fat from the cooking juices in the pan and add a splash of water to the pan to deglaze, scraping off any brown bits stuck to the bottom of the pan.", "Add this liquid to the sherry sauce. Reheat the sauce, whisking all the time, until the cooking juices have been incorporated. Keep warm.", "Bring a shallow pan of water to the boil, add another third of the butter and the asparagus. Cook gently for 2-3 minutes, until just tender, and drain", "Heat a separate frying pan until hot, add the remaining butter, the mushrooms, wild garlic and spinach leaves and sauté for 2-3 minutes, or until the mushrooms are cooked and the leaves wilted. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon two-thirds of the mushroom mixture into the centre of a large warm serving platter. Top with the veal medallions and the remaining mushroom mixture. Place the asparagus to one side and spoon over the sauce."]}, {"isVegetarian": false, "title": "Pan-fried wild salmon with spiced shellfish butter", "url": "www_bbc_co_uk_food_recipes_panfriedwildsalmonwi_81726", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35ml/1fl oz tomato ketchup", "25g/1oz English mustard", "25g/1oz capers", "2 shallots, finely chopped", "handful parsley, finely chopped", "1 tbsp snipped chives", "½ tsp chopped marjoram", "½ tsp thyme leaves", "6 tarragon leaves, finely chopped", "½ tsp chopped rosemary", "1 clove garlic, finely chopped", "6 anchovy fillets, finely chopped", "1 tbsp brandy", "1 tbsp Madeira", "½ tsp Worcestershire sauce", "1 tbsp paprika ", "½ tsp curry powder", "½ tsp cayenne", "1 lemon, zest and juice", "1 orange, zest only", "1 tsp salt", "450g/1lb butter, at room temperature, cut into small cubes", "150ml/5fl oz dry white wine ", "2 shallots, finely chopped", "1 clove garlic, finely chopped", "½ tsp soft thyme leaves ", "350g/12oz each small mussels and cockles or small clams ", "1 tsp olive oil ", "4 wild salmon fillets, each about 175g/6oz, skinned ", "salt and freshly ground black pepper ", "25g/1oz unsalted butter ", "1 tbsp reduced tomato passata or thinned tomato purée", "115g/4oz cooked brown shrimps, peeled ", "2 large diver-caught scallops, diced ", "8 Ratte or Pink Fir Apple potatoes, steamed until tender and peeled, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First make the Café de Paris butter. Combine all the ingredients, except the butter, in a large bowl. Set aside for 4 hours. ", "Beat the butter until fluffy, then mix with the other ingredients. Transfer to a sheet of cling film and shape into a neat log about 2.5cm/1in in diameter. Wrap in the cling film and chill. (This will make more butter than you need for this recipe, but it can be kept in the freezer for up to 6 months; it is good on steaks, chicken and fish.)", "For the salmon, heat the wine with the shallots, garlic and thyme in a large saucepan over a low heat for 3 minutes. Turn the heat up and add the mussels and cockles or clams. Cover with a lid and give the pan a good shake, then cook for about 3 minutes or until all the shells have just opened. Discard any that do not open.", "Tip into a sieve or colander set over a bowl so you can retain the juices. When cool enough to handle, remove the mussels and cockles from their shells and set aside; retain a few in their shells for garnish.", "Return the juices to the pan and reduce over a high heat until you have 4 tablespoons left. Keep warm. ", "Heat a large frying pan until very hot. Add 1 tablespoon of the Café de Paris butter and the olive oil. Season the salmon with salt and freshly ground black pepper and place in the pan. Cook for 2-3 minutes on each side, depending on the thickness. Remove and keep warm. ", "Pour the shellfish juices into the hot fish pan and stir to combine with the pan juices. Add 2 tablespoons of the Café de Paris butter, the unsalted butter and the reduced passata and cook until emulsified. Check the seasoning. Add the shelled mussels and cockles, shrimps and scallops and warm through. ", "To serve, place the salmon on four warmed plates and spoon the shellfish butter over the fish. Garnish with the mussels and cockles in shell and the steamed potatoes."]}, {"isVegetarian": false, "title": "Pan-fried veal with creamy wild mushrooms and cavolo nero", "url": "www_bbc_co_uk_food_recipes_panfriedvealwithcrea_92850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ veal escalope", "100g/3½oz wild mushrooms", "2 tbsp brandy", "25g/1oz butter", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "2 tbsp chopped chives", "25g/1oz butter", "1 tbsp olive oil", "150g/5½oz cavolo nero, stalks removed, finely sliced", "200ml/7½fl oz vegetable stock"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the veal, heat the olive oil in an ovenproof frying pan, and fry veal for 4-5 minutes on both sides, or until golden-brown on all sides. Remove the veal from the pan and set aside. Keep warm.", "Add the mushrooms to the same pan used to cook the veal and fry for 5-6 minutes. Return the veal to the pan.", "Add the brandy, heat briefly, then set light with a match. Let the flames flare up, then die down. Cook for 3-4 mins longer until most of the liquid has evaporated. (CAUTION: Keep the flames away from the eyes and face. Do not leave unattended.)", "Add the butter and cream, bring to the boil and heat for one minute. Season, to taste, with salt and freshly ground black pepper, then stir in the chopped chives.", "For the cavolo nero, melt the butter and olive oil in a frying pan and add the cavolo nero. Fry for one minute, then pour in the stock, bring the mixture to the boil and boil for 4-5 minutes, or until tender. ", "To serve, spoon the veal and wild mushrooms onto a serving plate and serve the cavolo nero alongside."]}, {"isVegetarian": false, "title": "Pan-fried whole crab with chilli paste", "url": "www_bbc_co_uk_food_recipes_panfriedwholecrabwit_10111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-1.5kg cooked whole crab", "2 tbsp coconut cream", "200ml/7fl oz coconut milk", "2 kaffir lime leaves, in fine julienne", "small bunch sweet Thai basil, picked", "lime juice, to taste", "palm sugar, to taste", "fish sauce, to taste", "300ml/10fl oz vegetable oil", "Note: This recipe originally uses Australian measurements. Equivalent measurements are as accurate as possible.", "This dish serves 1 devoted crab eater or 4 persons as part of a shared meal with steamed jasmine rice."], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pull off the top shell of the crab, discard the brown lungs and wash.", "Pull off the claws, chop the body in half, and crack the hard shell on the claws with the back of a cleaver.", "Preheat the vegetable oil to 180C/350F in a large wok and add the crabmeat.", "Stir fry the crabmeat for 1-2 minutes, then remove from the oil and drain well on kitchen paper.", "To a large wok, add 2 tbsp vegetable oil and the coconut cream. Cook on a high heat until the coconut cream fats separate and it becomes fragrant, about 3 minutes.", "Add the chilli paste, lime leaf julienne and chilli halves, fry out until fragrant. This should take about 2 minutes or a touch longer for the homemade paste.", "Add the palm sugar and allow to caramelise, then the fish sauce. The flavours of hot, salty, sour and sweet should be balanced.", "Add the coconut, bring to the boil and simmer for a minute. At this point, add the crab to the wok and continue to stir-fry until just cooked through, about 5 to 6 minutes. ", "Add the Thai basil and lime juice."]}, {"isVegetarian": false, "title": "Pan-grilled chicken breasts with parsley salad and sun-dried tomatoes", "url": "www_bbc_co_uk_food_recipes_pangrilledchickenbre_73924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chicken breasts", "olive oil ", "salt and freshly ground pepper", "1 handful of fresh basil", "600ml/1 pint olive oil", "150ml/¼ pint rice wine vinegar", "1 shallot, finely chopped", "2 garlic cloves crushed", "salt and freshly ground pepper", "4 handfuls Italian curly parsley, de-stalked", "Worcestershire sauce", "8 chopped sun-dried or blushed tomatoes", "parmesan cheese, slivers of"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First make the basil dressing. Whiz the basil with the oil, vinegar, shallot, garlic and seasoning in a blender or food processor. Keep aside.", "Brush the chicken breast with olive oil and cook on a pre-heated grill pan until just cooked through. The chicken should be golden on both sides and criss-crossed with markings from the grill pan. Season.", "For the salad, toss the parsley in a little of the basil dressing, and sprinkle with a little Worcestershire sauce. Put a portion of parsley salad on each plate, sprinkle with a few pieces of sun-dried tomato and slivers of parmesan cheese. ", "Serve with rustic roast potatoes or buffalo chips."]}, {"isVegetarian": false, "title": "Panhaggerty", "url": "www_bbc_co_uk_food_recipes_panhaggerty_93163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "250g/9oz streaky bacon", "6 potatoes, thinly sliced into rounds", "2 onions, peeled, sliced", "5 carrots, peeled, sliced", "500ml/17½fl oz chicken stock", "salt and freshly ground black pepper, to taste", "150g/5oz cheddar cheese, grated", "crusty bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a deep ovenproof pan. Fry the bacon for 3-4 minutes, or until golden-brown and slightly crisp. Remove from the pan and set aside to drain on kitchen paper. ", "In the same pan used to cook the bacon, arrange a layer of the sliced potatoes in the bottom of the pan. Cover the potatoes with a layer of sliced onions, then a layer of sliced carrots. Layer over some of the crisp bacon, then season with salt and freshly ground black pepper. ", "Repeat the process with the remaining potatoes, onions, carrots and bacon, finishing with a layer of potatoes on top. Season with salt and freshly ground black pepper. ", "Pour in the chicken stock so that all of the ingredients are covered, then bring to the boil. Cover the pan with a lid and reduce the heat to a simmer. Simmer for 15-25 minutes, or until the potatoes and carrots are tender. ", "Preheat the grill to high. ", "Uncover the pan and sprinkle over the grated cheese. Grill for 5-6 minutes, or until the cheese is bubbling and golden-brown. ", "To serve, spoon the panhaggerty into bowls and serve with some crusty bread to mop up the juices."]}, {"isVegetarian": false, "title": "Pan haggerty with smoked salmon", "url": "www_bbc_co_uk_food_recipes_panhaggertywithsmoke_90142", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, peeled, very finely sliced ", "200g/7oz Maris Piper, or similar waxy potatoes, very finely sliced", "50g/2oz butter", "salt and freshly ground pepper", "100g/3½oz smoked salmon, sliced", "75g/2½oz mature cheddar cheese", "100ml/3½fl oz yoghurt", "1 lemon, zest and juice only", "1 tbsp chopped fresh dill", "salt and freshly ground black pepper", "100g/3½oz smoked salmon slices"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Melt half of the butter in a deep ovenproof frying pan over a medium heat. Add the sliced onion and fry until softened, then remove from the pan with a slotted spoon.", "Place a layer of the potato slices into the same pan and fry for a few minutes until golden-brown.", "Add a layer of the fried onion, then add another layer of the potato slices. ", "Continue to layer onion, potato, onion, until you are ready to add the final layer of potato.", "Add a layer of smoked salmon and finish with a layer of potato.", "Melt the remaining butter in a separate pan. Pour the melted butter over the layers of potatoes, salmon and onions.", "Place the pan into the oven and bake for 40-45 minutes, or until cooked through. Towards the end of the cooking, preheat the grill to its highest setting.", "Before serving, grate the cheese over the top and finish under the grill until the cheese is melted and golden-brown.", "For the dressing, whisk together the yoghurt, lemon zest and juice and dill in a bowl. Season, to taste, with salt and freshly ground black pepper. ", "To serve, cut out wedges of the pan haggerty from the pan and place onto plates. Top with curled slices of smoked salmon and drizzle with the dressing."]}, {"isVegetarian": false, "title": "Panko-coated squid with palm sugar and coriander pesto", "url": "www_bbc_co_uk_food_recipes_panko-coated_squid_with_94929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp palm sugar", "4 garlic cloves, crushed", "2 tbsp finely grated fresh root ginger", "3 red chillies, finely diced", "6 tbsp fish sauce", "½ bunch fresh coriander", "½ bunch fresh mint", "3 limes, zest and juice only", "4 squid", "110g/4oz plain flour", "2 medium free-range eggs, beaten", "110g/4oz Japanese panko breadcrumbs", "vegetable oil, for deep-fat frying", "2 tbsp coriander cress ", "50g/1¾oz mitzuna leaves", "25ml/fl oz rapeseed oil", "2 limes, cut into wedges ", "4 spring onions", "1 red chilli, cut into rounds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the palm sugar and coriander pesto, place all the ingredients in a pestle and mortar and pound to a paste.", "For the squid, clean, score and prepare the squid. Pull the tentacles away from the body of the squid and remove the quill. Rinse inside the body of the squid under cold running water. Pull the ears (wing-like flaps) from the body. Pull the purplish skin from the ears and body to leave only the white meat.", "Cut the tentacles away from the guts by slicing just below the eyes. Check the centre of the tentacles for the hard beak, which can be discarded. (Discard the guts of the squid or, if desired, retain the ink sack to use in seafood pasta or risotto.)", "Either slice the body of the squid into rings, or cut down one side of it, open it out, scrape away any traces of guts left inside the body, then score the inside lightly in a cross-hatch pattern.", "Dry off the squid with kitchen roll before cooking.", "Prepare a plate of flour, a bowl of the egg and a plate of breadcrumbs.", "Preheat the oil in a deep-fat fryer to 180C/350F (CAUTION: hot oil can be dangerous; do not leave unattended.)", "Dip the prepared squid in the flour, then the egg and panko breadcrumbs and place in the deep fat fryer. Cook for a couple of minutes until golden-brown and crisp. Tip onto a plate lined with kitchen roll to drain.", "To serve, place each squid on a serving plate and drizzle the pesto over. Garnish with coriander cress and mitzuna dressed with the rapeseed oil, topped with lime wedges, spring onions and chilli."]}, {"isVegetarian": false, "title": "Panna cotta with mini doughnuts and fresh raspberries", "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_mini_79814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out", "100ml/3½fl oz condensed milk", "2 gelatine leaves, soaked in water for at least five minutes", "350ml/12fl oz buttermilk", "25ml/1fl oz vodka", "250g/9oz strong white flour", "pinch salt", "50g/1¾oz caster sugar", "30g/1oz butter, softened", "1 tsp fast-action yeast", "vegetable oil, for deep frying", "250g/9oz raspberries", "25g/1oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the panna cotta, chill a jug in the freezer.", "Heat the double cream, vanilla pod and seeds and the condensed milk in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk. Whisk until well combined.", "Pass the mixture through a fine sieve into the chilled jug, stir in the vodka.", "Place the jug in the fridge to chill, whisking every five minutes until the mixture begins to set. Pour the mixture into dariole moulds or ramekins and chill in the fridge for at least two hours.", "For the mini doughnuts, combine the flour, salt, and caster sugar in a large bowl.", "Mix in the butter, 150ml/5fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with cling film and set aside in a warm place for about an hour, or until doubled in size.", "Divide the dough into 12 equal portions and roll each into a ball.", "Line a baking tray with baking parchment and place the dough balls onto it, leaving plenty of room between each ball. Cover with a tea towel and set aside in a warm place to prove for a further 20 minutes.", "When the dough has proved, heat the oil in a deep-fat fryer to 150C/320F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "When the excess oil has drained off the doughnuts, place them onto a plate and dust with the remaining caster sugar until completely coated.", "To serve, place the raspberries, sugar and 50ml/2fl oz water in a pan and cook for 3-4 minutes. Blend until smooth and pass through a fine sieve. ", "Remove the panna cotta from the moulds and turn out into the centre of serving plates (briefly dip the base of each mould into a bowl of hot water and gently slide a knife around the edge of each panna cotta to loosen them). Serve with the doughnuts and raspberry sauce."]}, {"isVegetarian": false, "title": "Panna cotta with pineapple and ginger salsa", "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_86218", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panna_cotta_with_86218_16x9.jpg", "ingredients": ["sunflower oil, for greasing", "6 leaves fine leaf gelatine (11g) ", "600ml/20fl oz single cream", "300ml/10fl oz double cream", "75g/2½oz caster sugar", "1 tbsp vanilla extract", "1 small ripe pineapple, finely chopped(size of a currant)", "4 bulbs stem ginger, finely chopped (size of a currant)", "6 tbsp ginger syrup, from the jar"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Oil the inside of six 150–175ml/5-6fl oz metal individual pudding basins (timbale moulds) with sunflower oil and leave upside down to drain on kitchen paper to remove any excess.", "To make the panna cotta, soak the gelatine leaves in a bowl of cold water for about 5 minutes, or until soft.", "Pour both creams and the sugar into a saucepan and gently heat, stirring until just about to boil. Remove from the hob before it boils.", "Remove the gelatine from the water and squeeze to remove any extra water. Add the gelatine to the warm cream and stir until it has completely dissolved. Stir in the vanilla.  ", "Decant into a jug and pour into the moulds then cover with cling film. Leave in the fridge for a minimum of 6 hours, or ideally overnight, until firm to the touch.", "To make the salsa, mix the ingredients together in a bowl. Carefully turn out the panna cotta and invert it into the centre of a small plate. Spoon the salsa on top and around the edges."]}, {"isVegetarian": false, "title": "Panna cotta with roasted rhubarb and dripping cake", "url": "www_bbc_co_uk_food_recipes_panna_cotta_with_roasted_37276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out", "100g/3½oz caster sugar", "2-3 gelatine leaves, soaked in water for a few minutes", "350ml/12fl oz buttermilk", "25ml/1fl oz vodka", "oil, for greasing", "140g/5oz soft brown sugar", "85g/3oz clarified beef dripping", "225g/8oz mixed dried fruit and candied peel", "225g/8oz wholemeal flour", "1 tsp baking powder", "1 pinch ground cinnamon", "1 pinch freshly grated nutmeg", "1 pinch ground allspice", "½ tsp bicarbonate of soda", "500g/18fl oz rhubarb, cut into batons", "2 tbsp light soft brown sugar", "4 tbsp apple juice"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the panna cotta, chill a large jug or bowl in the freezer.", "Heat the double cream, vanilla pod and seeds and sugar in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk and whisk until well combined", "Pass the mixture through a fine sieve into the chilled jug, and then stir in the vodka.", "Return the jug to the fridge and whisk the mixture every five minutes until it begins to set. ", "Pour the mixture into dariole moulds and chill in the fridge for at least two hours, or until completely set.", "For the dripping cake, preheat the oven to 180C/350F/Gas 4. Grease and line an 18cm/7in cake tin.", "Put the sugar, dripping, dried fruit and candied peel into a saucepan. Add 225ml/8fl oz water and bring to the boil. Simmer gently for 10 minutes, then allow to cool in the pan.", "Sift the dry ingredients together in a large bowl. Make a well in the middle and add the cooled dried-fruit mixture. Stir with a wooden spoon, gradually drawing in the flour from around the edge of the well, until you have a smooth batter.", "Spoon the batter into the prepared tin and bake for about 40 minutes, or until a skewer inserted in the centre comes out clean.", "Leave in the tin for five minutes before turning out on to a wire rack to cool completely.", "For the roasted rhubarb, preheat the oven to 200C/400F/Gas 6.", "Place the rhubarb on a roasting tray, sprinkle over the sugar then drizzle over the apple juice. Roast in the oven for 8-12 minutes, or until just tender.", "Blend 125g/4½oz of the roasted rhubarb to a purée in a food processor. Reserve the remaining roasted rhubarb. ", "To serve, remove the panna cotta from their moulds, by briefly dipping the base of each mould into a bowl of boiled water. Gently slide a knife around the edge of each panna cotta and turn out into the centre of a serving plate. Serve with the rhubarb purée, a slice of dripping cake and roasted rhubarb. "]}, {"isVegetarian": false, "title": "Panna cotta with lavender", "url": "www_bbc_co_uk_food_recipes_pannacottawithlavend_85680", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225ml/8fl oz water", "100g/3½oz caster sugar", "handful lavender flowers", "600ml/1 pint 1½fl oz double cream", "50g/1¾oz vanilla sugar", "1 orange, zest only", "2 tsp gelatine"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the lavender flowers, heat the water and caster sugar together in a pan. ", "Stir until the sugar melts and then boil steadily, so that the liquid can reduce a little. ", "Take the pan off the heat and leave to cool.", "When the sugar has cooled, add the lavender flowers to the pan.", "For the panna cotta, line six ramekins with cling film and place on a tray. Warm three quarters of the cream with the vanilla sugar and orange zest in a pan, taking care not to boil the cream.", "Strain the mixture through a sieve into a mixing bowl. ", "Sprinkle the gelatine over two tablespoons of water until it becomes spongy. Heat very gently in a clean pan over a low heat until it dissolves. ", "Add the cream mixture to the gelatine and take off the heat. Leave to cool. ", "Softly whip the remaining cream and add the cream to the mixture.", "Pour the mixture into the lined ramekins and transfer to the fridge to chill.", "Chill for at least two hours until set. ", "Turn the panna cotta out onto individual serving plates and drizzle the lavender syrup over them. Decorate with the sugary lavender flowers."]}, {"isVegetarian": false, "title": "Panna e prosciutto (ham, mushroom and cream sauce)", "url": "www_bbc_co_uk_food_recipes_pannaeprosciuttohamm_71533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz single cream", "200g/7oz ham, cut into cubes", "100g/4oz salted butter", "pinch of grated nutmeg", "2 handfuls of button mushrooms, sliced", "handful of grated parmesan ", "salt", "freshly ground black pepper", "400g/14oz fresh tagliatelle, cooked according to packet instructions", "grated parmesan to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a frying pan, shallow-fry the mushrooms and ham in the butter until golden.  Add the cream, season with salt and pepper and a pinch of nutmeg and allow to cook for about one minute.  ", "Add the cooked pasta to the sauce and allow to thicken, but not too much. ", "Serve immediately with a sprinkle of grated or shaved parmesan cheese."]}, {"isVegetarian": false, "title": "Pan-roast chicken with crème fraîche spatzle", "url": "www_bbc_co_uk_food_recipes_panroastchickenwithc_83701", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, zest only", "2 garlic cloves, crushed", "2 sprigs fresh thyme", "75ml/2½fl oz white wine", "2 tbsp rapeseed oil", "4 chicken legs, bones removed, skin on", "2 chicken breasts, wing bone on, skin on", "250g/9oz plain flour", "½ tsp celery seeds", "½ tsp salt", "pinch freshly ground black pepper", "7 large free-range eggs", "3 tsp rapeseed oil", "1 tbsp olive oil", "2 shallots, finely chopped", "100ml/3½fl oz white wine", "350ml/12oz crème fraîche ", "1 lemon, juice only", "1 garlic clove, crushed", "salt and freshly ground black pepper", "150ml/5fl oz rapeseed oil", "½ hispi cabbage, finely sliced ", "bunch of fresh dill, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken, place the lemon zest, garlic, thyme and wine into a bowl and mix well.", "Smear the marinade mixture over the flesh of the chicken to cover, then place flesh-side down in a dish and place in the fridge to marinate for at least one hour, preferably overnight.", "Preheat the oven to 230C/445F/Gas 8.", "Place a large, ovenproof frying pan over a medium heat. When hot, add the rapeseed oil and the chicken pieces skin-side down. Fry for 3-4 minutes, until golden-brown, then turn the chicken over and transfer to the oven to roast for 8-10 minutes, until cooked through and tender.", "To make the spätzle, place the flour, celery seed, salt, pepper and eggs into a food processor and blend until combined into a smooth, thick batter.", "Bring a large saucepan of salted water to the boil. Add a teaspoon of the oil to the water.", "Spoon the batter mixture into a thin-nozzled piping bag and drizzle the batter across the boiling water. Boil for 2-3 minutes, until cooked through. ", "Place a frying pan over a medium heat. When hot add the remaining two teaspoons of rapeseed oil.", "Drain the spätzle and place straight into the hot frying pan. Fry the spätzle for 1-2 minutes, until just coloured, then remove and set aside in a bowl.", "To make the sauce, heat a small frying pan over a low heat. When warm add the olive oil and shallots and fry for 4-5 minutes, until softened.", "Add the wine, bring to the boil and reduce the liquid volume by a third.", "Add the crème fraîche, reduce the heat and warm the sauce through.", "Spoon half of the sauce over the spätzle and stir to combine.", "For the cabbage, whisk the lemon and garlic together in a bowl and season with salt and freshly ground black pepper. Add the oil and whisk again.", "Pour the dressing over the cabbage, add the dill and stir.", "To serve, carve the chicken into several pieces, place onto warmed plates with a spoonful each of spätzle and cabbage. Drizzle over the remaining sauce to taste."]}, {"isVegetarian": false, "title": "Pan-roasted chicken with beetroot and cauliflower with horseradish cream", "url": "www_bbc_co_uk_food_recipes_panroastedchickenwit_84338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 chicken breasts, skin on", "1 tbsp olive oil", "4 shallots, finely chopped", "1 clove garlic, finely chopped", "2 tbsp balsamic vinegar", "75ml/3fl oz extra virgin olive oil", "10g/½oz fresh chives, roughly chopped", "10g/½oz fresh flatleaf parsley, roughly chopped", "10g/½oz fresh dill, roughly chopped", "8 beetroot, cooked until tender, peeled and cut into segments", "salt and freshly ground black pepper ", "1 large cauliflower, cut into florets", "4 tbsp horseradish cream from a jar", "1 lemon, juiced", "150ml/5fl oz double cream, lightly whipped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "For the chicken, heat a large ovenproof frying pan and add the butter and olive oil.", "Season the chicken all over with salt and freshly ground black pepper and, once the butter is foaming, place into the pan, skin-side down. Fry for 3-4 minutes, until golden.", "Turn the chicken breasts over and transfer to the oven to roast for 12-15 minutes, or until completely cooked through.", "Meanwhile, for the beetroot, heat a small pan with the olive oil. Add the garlic and shallots and gently fry for 2-3 minutes, until tender but not browned.", "Add the balsamic vinegar, extra virgin olive oil and herbs and mix well. Place the beetroot into a serving bowl and pour the shallot mixture over. Stir to coat and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the cauliflower, bring a pan of water to the boil and add the cauliflower. Boil for 4-5 minutes, until just tender, then drain and refresh in iced water. Drain the cauliflower and set aside.", "Place the horseradish and lemon juice into a large bowl and whisk together. Add the whipped cream and season, to taste, with salt and freshly ground black pepper.", "Add the cauliflower to the horseradish mixture and stir well.", "To serve, place a spoonful each of the beetroot mixture and cauliflower mixture beside each other onto four plates and place a chicken breast onto each."]}, {"isVegetarian": false, "title": "Pan-roasted duck with cherry sauce", "url": "www_bbc_co_uk_food_recipes_panroastedduckwithch_83341", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ duck breast", "1 tbsp olive oil", "salt and freshly ground black pepper ", "6 cherries, stones removed", "1 tsp caster sugar", "100ml/3½fl oz white wine", "1 tsp cornflour, mixed into a paste with a little water", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the duck, rub the duck on both sides with the olive oil then season with salt and freshly ground black pepper.", "Heat a frying pan and cook the duck for five minutes skin-side down. Pour off excess fat and turn the duck breast over. Place in the oven and cook for eight minutes. Remove and rest for one minute.", "To make the sauce, heat the cherries in a frying pan and stir in the caster sugar.", "Add the wine and cornflour paste and cook to reduce by half.", "Serve the breast in the middle of the plate and spoon the cherry sauce around."]}, {"isVegetarian": false, "title": "Pan-roasted goose breast with roast swede and chestnuts and leek and cranberry sauce", "url": "www_bbc_co_uk_food_recipes_panroastedgoosewithr_78831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ goose breast", "salt and freshly ground black pepper", "½ swede chopped into large chunks", "50g/1¾oz butter", "1 tbsp olive oil ", "1 tin cooked, whole chestnuts ", "25g/1oz butter", "1 tbsp olive oil", "1 leek, washed and roughly chopped ", "1 large handful cranberry ", "2 tbsp balsamic vinegar ", "4 tbsp soft brown sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the goose breast with salt and freshly ground black pepper and place, skin-side down into a hot oven-proof frying pan. Cook for five minutes until golden. Turn and cook for another minute.", "Drain the fat from the goose pan and transfer to the preheated oven for ten minutes, or until cooked through. Take out once cooked and leave to rest.", "Meanwhile, place the swede into a saucepan of boiling water and cook for eight minutes. Drain and set aside.", "In a separate oven-proof frying pan, melt the butter with the oil. Add the chestnuts and cooked swede and transfer to the preheated oven to roast for five minutes, or until golden.", "For the leek and cranberry sauce, heat the oil and melt the butter in a saucepan. Add the leeks and cook for five minutes until soft.", "Add the cranberries, balsamic vinegar and brown sugar and cook for a further five minutes.", "To serve, place the goose breast on a warm plate with the roasted swede and chestnuts. Spoon over the leek and cranberry sauce."]}, {"isVegetarian": false, "title": "Roast monkfish, vegetable medley and cashew butter sauce", "url": "www_bbc_co_uk_food_recipes_panroastedmonkfishve_84265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp chopped fresh rosemary", "1 tsp chopped fresh parsley", "1 tbsp olive oil", "150g/7oz monkfish fillet", "salt and freshly ground black pepper ", "2 slices Parma ham", "50g/2oz baby carrot, blanched", "50g/2oz peas, blanched", "50g/2oz peeled and chopped potato, cooked", "25g/1oz butter", "salt and freshly ground black pepper ", "50g/2oz unsalted butter", "50g/2oz cashew nuts, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the monkfish, mix the herbs with the oil in a bowl and add the monkfish. Mix well to coat and leave to marinate for 2-3 minutes.", "Season the fish with salt and freshly ground black pepper and wrap with the Parma ham.", "Heat an ovenproof frying pan and add the fillet. Cook for one minute on each side, until the ham beginning to take colour, then transfer to the oven and roast for 6-8 minutes, or until completely cooked through.", "For the vegetable medley, place the vegetables in a bowl with the butter, mix together and season with salt and freshly ground black pepper.", "To make the cashew butter sauce, melt the butter in a frying pan over a medium heat. Add the cashew nuts and fry until golden-brown and season, to taste, with salt and freshly ground black pepper.", "To serve, place the vegetable medley onto a plate, arrange the fish on top and spoon over some of the cashew butter sauce."]}]