[{"ingredients": ["300g / 10½ oz de ricota, escurrida", "50g / 1¾oz de queso parmesano, finamente rallado", "nuez moscada recién rallada", "sal al gusto", "aproximadamente 250 g / 9 oz de sémola, para quitar el polvo", "aceite de oliva, para lloviznar", "2 cucharadas de aceite de oliva", "2 dientes de ajo, muy finamente picado o triturado", "1 cucharadita de hojuelas de chile seco", "500g / 1lb 2oz de tomates frescos, pelados y en puré (o equivalente en lata)", "azúcar pizca (opcional)", "puñado de hojas de albahaca", "sal y pimienta negra recién molida", "parmesano rallado", "hojas de albahaca"], "method": ["Coloque la ricota en un tazón grande y rompa con un tenedor. Agregue el parmesano y la nuez moscada y sazone con sal. Mezcle bien.", "Pon la mitad de la sémola en un plato o bandeja de asar. Moje la palma de sus manos y sumérjala en la sémola, esto ayudará a que la ricota se pegue demasiado. Forme cucharaditas de la mezcla en pequeñas albóndigas, o si desea evitar el desorden, use dos cucharaditas para hacer quenelles.", "Deberías terminar con entre 24-30 albóndigas, dependiendo de lo generoso que seas. Coloque las albóndigas en la sémola y vierta sobre la sémola restante, asegurándose de que estén completamente cubiertas.", "Cubra la bandeja y colóquela en la nevera durante al menos 8 horas, preferiblemente durante la noche. Cuando esté listo para cocinar, retire el gnudi y golpée cualquier semolina suelta.", "Para la salsa, caliente el aceite de oliva en una olla grande y agregue el ajo. Cocine muy suavemente durante 2-3 minutos, luego agregue los copos de chile y los tomates.", "Sazonar con sal y pimienta, luego llevar a ebullición y cocinar a fuego lento hasta que la salsa se haya reducido, no se debe espesar demasiado, tiene que ser bastante líquido para que quede bien con el gnudi. Pruebe y agregue una pizca de azúcar si cree que es necesario, luego agregue la albahaca fresca.", "Para cocinar el gnudi, ponga a hervir un sartén grande de agua con sal. Baje a fuego lento, agregue el gnudi, todo a la vez, y deje cocinar. Cuando los gnudi comiencen a flotar, estarán listos, esto tomará alrededor de 4-5 minutos. Quítelos cuidadosamente con una cuchara ranurada (tenga cuidado, son frágiles). Rocíe con un poco de aceite de oliva.", "Para servir, inunde un plato de servir con salsa y vierta las albóndigas encima. Cubra con un poco más de parmesano y hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_gnudi_with_arrabiata_38405", "title": "Gnudi con salsa arrabiata", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 langostas vivas", "2 cucharadas de aceite vegetal", "150g / 5oz de coco desecado", "4 chiles rojos secados a ojo de pájaro", "1 cucharada de semillas de cilantro", "1 cucharada de semillas de comino", "1 cucharadita de pimienta negra", "4 dientes", "2 cebollas en rodajas", "1 chile verde, finamente picado", "1 diente de ajo, finamente rallado", "Jengibre de 5 cm / 2 pulgadas, finamente rallado", "¼ cucharadita de cúrcuma molida", "50ml / 2fl oz de pulpa de tamarindo", "300ml / 11fl oz de leche de coco", "2 cucharadas de hojas de cilantro finamente picadas", "4 patatas fritas grandes, peladas y cortadas en trozos de 1cm / ½ in de espesor", "aceite vegetal, para freír", "sal marina, al gusto"], "method": ["Para la langosta, coloque las langostas en el congelador durante dos horas hasta que casi se congelen; esto las dejará inconscientes.", "Agréguelos a una olla grande de agua salada hirviendo y cocine a fuego lento durante dos minutos. Retire las langostas de la sartén, sumérjalas en agua helada y luego drene.", "Retire toda la carne de las conchas, manteniéndolas enteras, descarte la vena intestinal negra que corre por la carne de la cola y el saco estomacal y las branquias de la cabeza. La carne será blanqueada, no completamente cocida en esta etapa.", "En una cucharadita de aceite, fría el coco en una sartén honda con los chiles secos, las semillas de cilantro, las semillas de comino, los granos de pimienta y los clavos durante unos dos minutos, o hasta que estén ligeramente coloreados. Retire y deje a un lado para que se enfríe un poco, luego transfiera a un procesador de alimentos y mezcle hasta que el coco y las especias estén molidos finamente.", "Calentar el aceite vegetal restante en un wok, agregar las cebollas y freír durante 5-7 minutos, o hasta que estén claras y doradas.", "Agregue el ajo, el jengibre y el chile verde y fría por 2-3 minutos. Agregue la mezcla de especias de coco y cocine, revolviendo, durante dos minutos.", "Agregue la pulpa de cúrcuma y tamarindo y cocine a fuego lento durante 2-3 minutos. Agregue la leche de coco, poco a poco, revolviendo para combinar.", "Agregue las piezas de langosta y cocine a fuego lento durante dos minutos, o hasta que se caliente. Espolvorear en el cilantro picado y reservar hasta que esté listo para servir.", "Para las patatas fritas, ponga a hervir un sartén de agua con sal, agregue las chispas y cocine a fuego lento durante cinco minutos o hasta que estén tiernas.", "Escurrir cuidadosamente y luego secar. (Puede congelarlos en este punto si desea prepararse por adelantado. Coloque las papas fritas en una bandeja forrada en el congelador hasta que se congelen. Se pueden transferir, una vez congeladas, a una bolsa de plástico para almacenarlas en el congelador. antes de freír)", "Para terminar las astillas, caliente el aceite en una freidora a 180C / 350F / Gas 4.", "Agregue las papas fritas y fría por 4-5 minutos, o hasta que estén doradas y cocidas.", "Escurrir, colocar en un plato forrado con papel de cocina y espolvorear con sal marina.", "Para servir, cuchara la langosta en cuatro platos, vierta sobre la salsa y luego apile las fichas al costado."], "url": "www_bbc_co_uk_food_recipes_goan-style_lobster_with_90994", "title": "Langosta al estilo de Goan con chips", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "2 cebollas pequeñas, picadas", "2 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "2 cucharaditas de mango en polvo", "1 palo de canela, roto", "3 dientes de ajo picados", "1 chile rojo, finamente picado", "100g / 3½oz de coco fresco, rallado", "Leche de coco 400ml / 14fl oz", "4 cucharaditas de pasta de tamarindo", "675g / 1lb 8 oz de langosta cocida, carne extraída y cortada en trozos grandes", "1 cilantro de racimo pequeño, picado", "sal y pimienta negra recién molida"], "method": ["En una sartén grande, caliente el aceite. Cuando esté caliente agregue las cebollas y fría por 4-5 minutos, o hasta que estén doradas. Agregue todas las especias, ajo, chile, coco fresco y leche de coco. Llevar a ebullición, luego agregue la pasta de tamarindo y cocine a fuego lento durante 3-4 minutos.", "Revuelva a través de la carne de langosta. Cocine hasta que la langosta se caliente, luego espolvoree sobre el cilantro y sazone al gusto con sal y pimienta."], "url": "www_bbc_co_uk_food_recipes_goan_lobster_curry_02100", "title": "Langosta de Goan curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 cucharadita de semillas de cilantro", "¾ cucharaditas de semillas de mostaza (preferiblemente de color negro, pero el amarillo está bien)", "2 cucharaditas de jengibre fresco y picado", "2 chiles verdes, finamente picados", "½ cucharada de almendras picadas (opcional)", "1 cebolla pequeña, finamente picada", "200 g / 7 oz de coliflor, cortada en florecillas", "200g / 7oz de brócoli, cortado en florecillas", "2 tomates medianos, picados", "puñado de judías verdes", "½ cucharadita de polvo de cúrcuma", "1 cucharadita de sal", "1 cucharada de agua", "200ml / 7fl oz de leche de coco", "cilantro picado fresco para decorar"], "method": ["Caliente el aceite en una sartén a fuego alto. Cuando esté caliente agregue las semillas de mostaza y cilantro.", "Una vez que las semillas comiencen a pop, reduzca el fuego y agregue el jengibre, los chiles, las almendras y la cebolla. Revuelva y cocine durante dos minutos.", "A continuación, agregue los floretes de coliflor y brócoli y revuelva para mezclar todo bien, tape y cocine por cinco minutos.", "A continuación, agregue los tomates, judías verdes, cúrcuma, sal y agua. Revuelve y cubre la sartén, baja el fuego a fuego lento y cocina durante 3-5 minutos hasta que la coliflor esté tierna.", "Finalmente agregue la leche de coco y deje que hierva, reduzca el fuego a fuego lento y cocine por 2-3 minutos hasta que la salsa esté bien y espesa.", "Sirva adornado con cilantro fresco y chapatis gruesos calientes."], "url": "www_bbc_co_uk_food_recipes_goancoconutgobi_71895", "title": "Goan coco gobi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100g / 4oz", "1 cucharada de azúcar en polvo", "una pizca de sal", "1 huevo", "150ml / 5fl oz de leche de coco", "1 cucharada de mantequilla derretida, más extra para cepillar", "unas gotas de extracto de vainilla", "una buena pizca de ralladura de limón rallado", "un poco de aceite o mantequilla para hacer los panqueques y para engrasar la sartén", "10-12 cucharadas de coco rallado fresco", "1 cucharada de pasas doradas", "Melaza de palma 80g / 3oz o azúcar moreno, rallado grueso (o azúcar moreno)", "¼tsp de cardamomo molido", "¼ de nuez moscada, rallada"], "method": ["Tamiza la harina, el azúcar y la sal en un tazón. Haga un pozo en el centro y agregue el huevo, la leche de coco y la mantequilla derretida. Bata hasta obtener una mezcla suave, luego agregue la vainilla y la ralladura de limón. Debe tener una consistencia de colada delgada.", "Mezcle todos los ingredientes para el relleno.", "Caliente un poco de aceite o mantequilla en una sartén de 15-18 cm / 6-7 in. Vierta suficiente masa para cubrir la base finamente, inclinando la sartén para extenderla. Cocine por 1 minuto, hasta que se dore ligeramente por debajo, luego voltee y cocine el otro lado. Apaga y prepara los panqueques restantes de la misma manera.", "Divida el relleno entre los panqueques y enrolle. Coloque en platos individuales, cepille con mantequilla derretida y caliente a través de la parrilla.", "Sirve con helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_goancoconutpancakes_12752", "title": "Panqueques de coco Goan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "1 barra de canela", "1kg / 2lb 2oz pierna de cordero, deshuesada y cortada en cubos de 2.5cm / 1in", "2 cebollas, finamente cortadas", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz de 2.5cm / 1in, finamente rallado", "2 chiles rojos largos, en rodajas", "3 cucharadas de pasta de tamarindo", "1 cucharadita de mango en polvo (disponible en tiendas en línea)", "500ml / 18fl oz de caldo de carne", "Coco desecado 90g / 3½oz", "1 x 400 ml / 14fl oz puede leche de coco", "2 cucharadas de hojas frescas de cilantro", "2 cucharadas de aceite vegetal", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "3 vainas de cardamomo verde, divididas", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "1 cucharadita de cúrcuma", "3 dientes", "1 ramita de canela", "8 hojas de curry", "400g / 14oz de arroz basmati", "½ limón, solo jugo", "200 g / 7 oz de yogur griego", "Chutney de mango a 200 g / 7 oz"], "method": ["Para el curry, caliente una sartén de base pesada hasta que esté caliente, agregue las semillas de comino y cilantro, canela y pan tostado por unos segundos. Coloque las especias en un mortero o un molinillo de especias y triture hasta convertirlas en polvo.", "Caliente una sartén o cazuela grande de base pesada hasta que esté caliente, agregue el aceite vegetal y la carne de cordero y cocínelos hasta que se doren por completo. Retire con una espumadera y déjelo a un lado.", "Agregue las cebollas y cocine durante 10 minutos o hasta que estén suaves y doradas.", "Agregue el ajo, el jengibre, el chile, las especias tostadas y las especias restantes y cocine por un minuto.", "Regrese el cordero a la sartén, luego agregue el caldo de carne y cocine a fuego lento. Cubra con una tapa y cocine a fuego lento durante una hora y luego retire la tapa.", "Agregue el coco desecado y la leche de coco y vuelva a hervir a fuego lento. Cocine por otros 30 minutos o hasta que esté espeso y la carne esté tierna. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el arroz, caliente una cacerola hasta que esté caliente. Agregue el aceite, la cebolla, el ajo y las especias, y fría por dos minutos.", "Agregue el arroz y agregue 600ml / 1pint 1fl oz de agua. Llevar a ebullición, cubrir y reducir a fuego lento a fuego lento. Cocine durante 18-20 minutos hasta que el arroz esté tierno y todo el líquido se haya absorbido. Sazone con sal, pimienta negra recién molida, jugo de limón, y luego agregue las hojas de cilantro.", "Coloque el cordero en platos con una pila de arroz al lado. Termine con una cucharada de yogur y salsa picante de mango."], "url": "www_bbc_co_uk_food_recipes_goan_mutton_curry_with_54906", "title": "Goan cordero al curry con arroz pilau con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goan_mutton_curry_with_54906_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de coco fresco, cáscara eliminada, carne finamente rallada", "2 chiles rojos secos", "2 cucharadas de semillas de cilantro", "1 cucharada de pimienta negra", "4 dientes", "3 cucharadas de aceite vegetal", "2 cebollas, peladas, en rodajas", "1 chile verde, finamente picado", "½ cucharadita de jengibre y pasta de ajo (hecha golpeando juntas cantidades iguales de raíz fresca de jengibre y ajo)", "¼ cucharadita de cúrcuma molida", "50ml / 2fl oz de pulpa de tamarindo", "150ml / 5fl oz de leche de coco", "2-3 cucharadas de agua", "2 cucharadas de hojas de cilantro fresco finamente picado", "2 cucharadas de mantequilla", "4 x 500 g / 1 libra de langostas cocidas de 2 oz, conchas rotas y carne removida", "arroz hervido o ensalada verde"], "method": ["Para la pasta de especias, tueste el coco rallado en una sartén seca a fuego medio durante 3-4 minutos, o hasta que esté ligeramente dorado, luego colóquelo en un plato y déjelo enfriar.", "Regrese la sartén al fuego y tueste los chiles secos, las semillas de cilantro, los granos de pimienta y los clavos durante 2-3 minutos, o hasta que estén ligeramente coloreados y sean aromáticos, luego colóquelos en un plato y déjelos enfriar.", "Transfiera las especias tostadas y el coco a un procesador de alimentos con unas cucharadas de agua (o leche de coco) y mezcle hasta lograr una pasta homogénea. Dejar de lado.", "Para las langostas, caliente dos cucharadas de aceite vegetal en un wok y fría las cebollas y el chile por 5-6 minutos, o hasta que estén coloreados. Agregue el jengibre y la pasta de ajo y la cúrcuma y fría por otros 2-3 minutos, luego agregue la pasta de especias.", "Agregue la pulpa de tamarindo a la sartén y cocine a fuego lento durante 2-3 minutos, luego vierta la leche de coco y cocine a fuego lento durante otros 8-10 minutos. Agregue el agua para diluir la mezcla ligeramente, luego agregue las hojas de cilantro.", "Caliente el aceite vegetal restante en una sartén antiadherente y fríe la carne de la langosta durante 3-4 minutos, o hasta que se dore por todas partes. Agregue la mantequilla a la sartén y, cuando se derrita, cubra la langosta para formar un glaseado liviano.", "Para servir, vierta un poco de la salsa en cuatro tazones para servir poco profundos y divida la carne de langosta por igual entre ellos. Sirva con un tazón de arroz hervido o ensalada verde."], "url": "www_bbc_co_uk_food_recipes_goanstylelobster_91554", "title": "Langosta al estilo de Goa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite de oliva", "2 cebollas medianas, finamente picadas", "2 palitos de apio, destripados y picados", "125 g / 4½ oz de calabaza, pelada y picada", "2 dientes de ajo, pelados", "½ cucharadita de sal marina gruesa", "4 filetes de anchoa en aceite, escurridos", "500 g / 1 lb 2 oz de cabra picada", "1 cucharada de aceitunas verdes picadas", "1 cucharada de puré de tomate", "1 cucharada de harina normal", "150ml / 5fl oz de vino tinto", "150ml / 5fl oz de caldo de carne", "1 cucharada de romero picado", "½ cucharadita de canela molida", "sal y pimienta negra recién molida", "1kg / 2lb 4oz de papas harinosas, como King Edward, peladas y cortadas en trozos", "50 g / 1¾oz de mantequilla sin sal", "25g / 1oz de queso de cabra desmenuzable, desmenuzado", "25 g / 1 oz de queso parmesano, finamente rallado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para hacer el relleno, caliente una cucharada de aceite en una sartén ancha a fuego medio-bajo. Agregue las cebollas, el apio y la calabaza y cocine suavemente durante unos 10 minutos o hasta que la cebolla comience a ablandarse.", "Pon el ajo en un almirez y mortero con la sal marina y aplasta hasta formar una pasta. Agregue las anchoas y bash para formar una pasta áspera. Agregue esta mezcla a la sartén de verduras. Cocine suavemente durante unos cinco minutos, revolviendo, para que las anchoas comiencen a 'derretirse'. Retire el contenido de la sartén a un recipiente, dejando el aceite detrás.", "Aumenta el calor debajo de la sartén. Agregue un poco más de aceite si es necesario, y la mitad de la carne picada. Cocine, revolviendo, hasta que esté dorado, luego agréguelo a las verduras. Repita con la carne picada restante y luego devuelva toda la carne y verduras a la sartén.", "Agrega las aceitunas. Agregue el puré de tomate y la harina y cocine suavemente durante 2-3 minutos. Agregue el vino y el caldo, lleve a ebullición y cocine a fuego lento durante 15 minutos.", "Agregue el romero y la canela y sazone con sal y pimienta (si es necesario, las anchoas ya son bastante saladas).", "Transfiera la carne a una fuente de horno con capacidad de alrededor de 1.2 litros / 2 pintas.", "Para el relleno, poner las papas en una sartén, cubrir con agua, agregar un poco de sal y llevar a ebullición. Cocine a fuego lento durante 15-20 minutos, o hasta que las papas estén tiernas. Escurra bien, luego tritúrelos o empuje a través de un ricer de nuevo en la sartén caliente, y agregue la mantequilla.", "Extiende el puré sobre la carne en el plato. Combine el queso de cabra desmenuzado y el queso parmesano y espolvoree sobre la papa.", "Hornee en el horno precalentado durante 25-30 minutos, o hasta que la parte superior esté dorada y crujiente y el relleno esté burbujeante.", "Deje reposar de 10 a 15 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_goat-herd_pie_89365", "title": "Pastel de manada de cabras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goat-herd_pie_89365_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 granos de pimienta", "2 vainas de cardamomo", "12 dientes", "2 cucharadas de aceite", "2 cebollas grandes, en rodajas", "Chorizo ​​de cocción de 100 g / 3½ onzas", "140ml / 4½fl oz de caldo de pollo", "2 palitos de canela", "Jengibre de raíz de 2.5cm / 1in, rallado", "1 chile verde, picado", "2 filetes de pierna de cabra", "680 g / 1½ lb de patatas nuevas, cortadas a la mitad", "110g / 4oz de tomates, descuartizados", "2 cucharadas de perejil fresco picado", "sal marina y pimienta negra recién molida"], "method": ["Amarre los granos de pimienta, las vainas de cardamomo y los clavos de olor en una bolsa de muselina.", "En una sartén grande caliente una cucharada de aceite y luego fría las cebollas hasta que estén doradas.", "Corte aproximadamente tres cuartas partes del chorizo ​​y agregue a la sartén.", "Añadir el caldo y hervirlo. Agregue la canela, el jengibre, el chile y la bolsa de especias de muselina.", "Mientras tanto, caliente el aceite restante en una sartén limpia a fuego alto. Colorea los filetes de pierna bien por todos lados y luego agrega a la sartén. Cubra con una tapa y cocine por 30 minutos.", "En una olla limpia de agua hirviendo, hervir las papas por la mitad.", "Mientras tanto, agregue los tomates a la bandeja de carne y cocine a fuego lento durante 15 minutos más.", "Agregue las papas a la bandeja de carne y cocine por otros 30 minutos, o hasta que la carne y las papas estén cocidas.", "Mientras tanto, corte el resto del chorizo ​​en círculos y fría a fuego medio hasta que estén bien coloreados.", "Revuelva el perejil en el guiso y sazone al gusto con sal y pimienta negra recién molida. Servido cubierto con los anillos de chorizo."], "url": "www_bbc_co_uk_food_recipes_goat_and_tomato_bredie_87584", "title": "Bredie de cabra y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de arroz basmati", "110 g / 3¾oz de mantequilla clarificada (ghee), más extra para engrasar", "2 palitos de canela", "1 cucharadita de pimienta negra", "3 hojas de laurel", "3 cebollas en rodajas", "3 dientes de ajo, aplastados", "4 cm / 1½ en pieza de jengibre fresco y picado", "1kg / 2lb 4oz de cabra, deshuesada y en cubos", "2 cucharaditas de chile en polvo", "2 cucharaditas de cúrcuma molida", "2 cucharaditas de cilantro molido", "1 cucharadita de sal masala", "150ml / 5fl oz de caldo de verduras o agua", "400g / 14oz de yogurt natural", "puñado de ciruelas pasas", "3 chiles verdes, cortados longitudinalmente", "sal marina", "gran cilantro puñado, para adornar", "1 cebolla roja, finamente rebanada", "puñado de cilantro fresco (hojas y tallos), finamente picado", "¼ cucharadita de azúcar en polvo", "exprimir jugo de limón", "aceite vegetal o ghee", "8-10 huevos de pato al aire libre", "pizca de copos de chile"], "method": ["Para el biryani, lave y remoje el arroz durante al menos 20-30 minutos, preferiblemente 2 horas.", "Caliente una sartén grande a fuego alto. Agregue la mantequilla clarificada y, una vez que esté chisporroteando, agregue los palitos de canela, los granos de pimienta y las hojas de laurel. Cocine por un minuto sin quemarlos. Agregue las cebollas, el ajo y el jengibre y cocine por 3-4 minutos. La mezcla debe estar seca y marrón.", "Agregue la cabra y cocine durante 10 minutos, hasta que se dore. Si la mezcla comienza a pegarse, agregue algunas salpicaduras de agua.", "Agregue las especias molidas y 2 cucharaditas de sal y cocine por 5 minutos.", "Agregue el caldo y cocine a fuego medio durante 20 minutos, o hasta que la carne esté tierna y el curry se seque. Si no está seco en 20 minutos, continúe cocinando hasta que toda la humedad se haya evaporado, mirándolo de cerca.", "Retirar del fuego, quitar la tapa y dejar enfriar durante 30 minutos. Agregue el yogur y las ciruelas pasas.", "Mientras tanto, ponga el arroz en una sartén grande con 1 litro / 1¾ de agua. Cocine por 10 minutos, luego cuele a través de un colador y escurra en agua fría.", "Engrase un plato hondo grande y tapado con mantequilla clarificada. Layer el plato con arroz, curry, luego chiles verdes, luego repita y termine con una capa extra de arroz en la parte superior. Coloque una toalla de té húmeda sobre el biryani y colóquela. Cocine a fuego medio durante 25 minutos, hasta que obtenga arroz crujiente en el fondo de la sartén. Retire la tapa.", "Mientras tanto, para la ensalada de cebolla, coloca la cebolla y el cilantro en un bol. Agregue el azúcar y el jugo de limón y apriételos con las manos, asegurándose de realmente exprimir y macerar las cebollas; deberían verse como si hubieran reducido su tamaño y se hubieran \"cocinado\" ligeramente en el jugo de limón.", "Para los huevos, caliente el aceite en una sartén grande y cocine los huevos hasta que tengan bordes de encaje. Espolvorear con los copos de chile y una pizca de sal.", "Revuelve el biryani. Sirva cubierto con los huevos fritos y adornado con el cilantro, con la ensalada de cebolla al lado."], "url": "www_bbc_co_uk_food_recipes_goat_biryani_55073", "title": "Cabra biryani", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goat_biryani_55073_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva", "1 cebolla pequeña, finamente picada", "Cabra picada 300 g / 10½ oz", "2 dientes de ajo picados", "puñado de menta, picado", "puñado de perejil, picado", "25g / 1oz de piñones tostados", "1 cucharadita de canela molida", "1 cucharadita de comino", "pizca de nuez moscada recién rallada", "½ pepino, pelado y cortado en cubitos", "2 cucharadas de menta fresca picada", "300g / 10½ oz de yogur", "2 limas, solo jugo", "sal y pimienta negra recién molida", "4 panes pitta blancos, calentados", "400 g / 14 oz de queso feta o halloumi, roto en pedazos"], "method": ["Caliente una sartén pequeña y agregue 1 cucharada de aceite. Una vez caliente, agrega la cebolla y cocina hasta que esté suave. Coloque todos los ingredientes kofta, aparte del aceite, en un recipiente y mezcle bien. Dale forma a las salchichas.", "Caliente una sartén plana gruesa. Engrase los koftas con el aceite restante y cocine en la plancha durante 6-7 minutos girando constantemente para que se cocinen uniformemente.", "Mezcle todos los ingredientes del aderezo en un recipiente y sazone al gusto con sal y pimienta.", "Para servir, rellene el pan de pita con las koftas cocidas, el aderezo y el queso y disfrute del calor."], "url": "www_bbc_co_uk_food_recipes_goat_koftas_with_a_89880", "title": "Koftas de cabra con aderezo de yogur, menta y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de comino molido", "1 cucharadita de cúrcuma molida", "2 cucharaditas ras-el-hanout spice mix", "½ cucharadita de hilos de azafrán", "4 cucharadas de aceite vegetal", "600g / 1lb 6oz de carne de cabra (una mezcla de hombro, cuello y pierna), cortado en dados grandes", "1 cebolla, finamente picada", "2 dientes de ajo picados", "1 chile rojo, tallo y semillas retirados, picados", "4cm / 1½en raíz de jengibre fresco, sin pelar, finamente rallado", "1 ramita de canela", "1 x 400 g de tomates enlatados de estaño", "1 cucharada de miel", "Albaricoques secos listos para el consumo 125g / 4½oz, aproximadamente picados", "1 limón medio conservado, solo piel, más o menos picado", "sal marina y pimienta negra recién molida", "50 g / 1¾oz de pistachos, aproximadamente picados", "3 cucharadas de hojas frescas de cilantro picado", "3 cucharadas de perejil fresco de hoja plana picado", "3 cucharadas de hojas de menta fresca picadas", "25g / 1oz de mantequilla", "200g / 7oz de cuscús", "50 g / 1¾oz de pistachos, aproximadamente picados", "50 g / 1¾oz de almendras tostadas en copos", "50g / 1¾oz de piñones, tostados", "Albaricoques listos para el consumo 50g / 1¾oz, más o menos picados", "1 limón en conserva, solo piel, finamente picado", "3 cucharadas de hojas de menta fresca picadas", "3 cucharadas de raíz de cilantro fresco y hojas picadas", "3 cucharadas de perejil fresco de flatleaf recién picado", "1 limón, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Para el tagine, mezcla el comino, la cúrcuma, ras-el-hanout, hilos de azafrán y 2 cucharadas de aceite vegetal hasta que estén bien combinados. Agregue la carne de cabra al adobo y mézclela para cubrir la carne, luego déjela reposar para marinar durante el mayor tiempo posible (relájese en el refrigerador si está marinado durante más de 30 minutos).", "Caliente el aceite restante en una cacerola a prueba de fuego grande a fuego medio a alto. Freír la cebolla, el ajo, los chiles y el jengibre durante 2 o 3 minutos, o hasta que se ablanden. Agregue la carne de cabra marinada y fría por 2-3 minutos, o hasta que se dore por todos lados.", "Agregue la ramita de canela, los tomates enlatados y la miel y mezcle bien. Vierta 200 ml / 7 fl oz de agua y lleve la mezcla a ebullición, luego agregue los albaricoques y el limón en conserva y mezcle bien. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, y cocine a fuego lento durante 45-60 minutos, o hasta que la cabra esté tierna y la salsa se haya espesado, luego sazone al gusto con sal y pimienta negra recién molida.", "Justo antes de servir, agregue los pistachos picados y las hierbas.", "Mientras tanto, para el cuscús, caliente la mantequilla en una sartén con una tapa ajustada a fuego medio. Cuando la mantequilla esté espumosa, agregue el cuscús y saltee hasta que se dore por todas partes.", "Vierta 400 ml / 14 fl oz de agua, mezcle bien y retire la sartén del fuego. Cúbralo bien con la tapa o una hoja de papel de aluminio y póngalo a vapor por 5 minutos. Pelusa el cuscús al vapor con un tenedor, luego cubrir una vez más y vaporizar durante otros 5 minutos. Agregue las nueces, los albaricoques, el limón en conserva, las hierbas y el jugo de limón hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, amontone el cuscús de nueces tostadas en el centro de 4 platos para servir, luego coloque el tagine en la parte superior."], "url": "www_bbc_co_uk_food_recipes_goat_tagine_with_toasted_74021", "title": "Tagine de cabra con cuscús de nueces tostadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 1lb 2oz hombro de cabra, huesos extraídos, carne cortada en cubos de 2.5cm / 1in", "300g / 10½oz de yogurt natural", "2 cucharaditas de cilantro molido", "1 cucharadita de cúrcuma molida", "2 cucharaditas de sal", "1 cebolla, pelada, finamente picada", "5 dientes de ajo, pelados, dejados enteros", "6 chiles verdes", "50g / 2oz ghee", "1 cucharadita de semillas de comino", "5 vainas de cardamomo verde, ligeramente trituradas", "4 vainas de cardamomo negro, ligeramente trituradas", "10 dientes enteros", "2 hojas de laurel", "750ml / 1 pinta 7fl oz de caldo de cordero", "450 g / 1 libra de maíz dulce enlatado, escurrido, picado", "300g / 10½oz de harina de gramo", "Harina normal de 200g / 7oz", "15g / ½ oz de sal", "1cm / ½en raíz de jengibre, pelado, finamente picado", "2 chiles verdes, finamente picados", "1 cucharada de cilantro fresco finamente picado", "1 cucharadita de semillas de ajwain (carom)", "½ cucharadita de semillas de cebolla negra", "½ cucharadita de cúrcuma molida", "2 cucharadas de aceite vegetal", "200 ml / 7 fl oz de agua", "1 cebolla roja, pelada, finamente picada", "1 cebolla tierna, cortada, finamente picada", "3 cucharaditas de ghee", "1 limón, solo jugo", "2 cucharadas de cilantro fresco picado"], "method": ["Para el curry de cabra y maíz dulce, mezcle la carne de cabra, el yogur, el cilantro, la cúrcuma y la sal en un tazón grande. Cubra y reserve para adobar durante una hora.", "Mientras tanto, para el pan de garbanzo, mezcle la harina de cereal y la harina común en un tazón grande hasta que estén bien combinados.", "Agregue la sal, el jengibre, los chiles, el cilantro, las semillas de ajwain, las semillas de cebolla negra y la cúrcuma molida y mezcle hasta que estén bien combinados.", "Haz un pozo en el centro de los ingredientes secos. Poco a poco agregue el aceite y el agua, revolviendo bien, hasta que la mezcla se una como masa (es posible que no necesite usar toda el agua). Cubra la masa con una toalla de té húmeda y déjela reposar durante 15-20 minutos.", "Cuando la carne de cabra se haya marinado, continúe con el curry de cabra y maíz dulce. Mezcle la cebolla, el ajo y los chiles en una pasta lisa en un procesador de alimentos, luego reserve.", "Cuando la carne de cabra se haya marinado, caliente el ghee en una sartén de base pesada a fuego medio. Agregue las semillas de comino, las vainas de cardamomo verde y negro, los clavos de olor y las hojas de laurel y fríalos hasta que las especias comiencen a crujir, exploten y huelan a fragante. (PRECAUCIÓN: Las semillas salpicadas pueden ser peligrosas. Cubra la olla con una tapa y manténgala alejada de los ojos y la cara).", "Agregue la carne de cabra marinada a la sartén y fría durante 3-4 minutos, o hasta que se dore por todos lados. Agregue la cebolla, el ajo y la pasta de chile, revuelva bien y continúe cocinando por 2-3 minutos.", "Reduzca ligeramente el calor y vierta el caldo de cordero. Llevar el líquido a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 30 minutos, o hasta que la cabra esté tierna.", "Agregue el maíz dulce picado y continúe cocinando a fuego lento durante 8-10 minutos, revolviendo continuamente, hasta que el maíz dulce comience a descomponerse.", "Mientras tanto, divida la masa del pan de garbanzo en 8 pedazos y enrolle cada uno en una bola. Aplaste cada bola ligeramente entre las palmas de sus manos, y cubra con un poco de cebolla roja picada y cebolleta.", "Ruede las bolas de masa sobre una superficie de trabajo ligeramente enharinada a un diámetro de 20 cm / 8 pulgadas.", "Caliente una sartén grande a fuego medio a alto. Cuando la sartén esté caliente, agregue uno de los discos de pan de garbanzo y cocine durante 3-4 minutos, luego cepille el lado superior sin cocinar con un poco de ghee. Voltee el pan plano y continúe cocinando durante 3-4 minutos o hasta que se dore por ambos lados. Cepille el lado superior cocido del pan con un poco más de ghee. Repita el proceso con los panes restantes de garbanzo. Mantenga calientes los panes de garbanzos cocidos mientras cocina los discos de pan restantes.", "Para servir, divide el curry de cabra y maíz dulce por igual entre cuatro y seis platos para servir. Exprime un poco de jugo de limón y espolvorea con cilantro fresco. Sirve con el pan tibio de garbanzo."], "url": "www_bbc_co_uk_food_recipes_goatandsweetcorncurr_93827", "title": "Curry de cabra y maíz dulce con pan plano de garbanzo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 calabacines redondos grandes, cortados en rodajas gruesas de 1cm / ½ in", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "Queso de cabra de 400g / 14oz, cortado en rodajas gruesas de 1cm / ½ in", "200g / 7oz guisantes en la vaina", "200 g / 7 oz de habas frescas, peladas", "12 espárragos de lanzas, recortados", "2 cucharadas de vinagre de jerez", "1 cucharadita de mostaza Dijon", "6 cucharadas de aceite de oliva virgen extra", "pizca de azúcar en polvo", "4 rábanos grandes, muy finamente rebanados", "1 chalota de plátano, muy finamente cortada en anillos", "50g / 2oz de hojas de cohete", "50g / 2oz de hojas de espinaca baby", "50g / 2oz de berros, hojas recogidas", "1 brotes de guisantes"], "method": ["Precalentar la parrilla a alto.", "Caliente una sartén hasta que esté caliente. Frote las rodajas de calabacín con el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Coloque los calabacines en la plancha y cocine por un minuto en cada lado hasta que se marque con líneas de la plancha.", "Retire los calabacines de la plancha y cubra con una rebanada de queso de cabra.", "Coloque el calabacín y el queso de cabra debajo de la parrilla y cocine por 1-2 minutos hasta que el queso se haya derretido y se haya puesto dorado claro.", "Mientras tanto, ponga a hervir un sartén de agua con sal, agregue los guisantes, las habas y los espárragos y cocínelos durante dos minutos hasta que queden tiernos. Escurrir y apartar.", "Batir el vinagre de jerez, la mostaza de Dijon y el aceite de oliva virgen extra junto con una pizca de sal, pimienta y azúcar.", "Para servir, coloque los rábanos, los anillos de chalote, el cohete, las espinacas y el berro en un recipiente y mezcle para mezclar.", "Abra suavemente las vainas de guisantes, dejándolas medio abiertas, luego agregue junto con las habas y los espárragos, luego mezcle ligeramente una vez más.", "Coloque la ensalada en el plato, luego coloque cuidadosamente un par de trozos de calabacín en la parte superior y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_78832", "title": "Queso de cabra a la parrilla y calabacín con ensalada de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de leche entera", "1 cebolla, descuartizado", "1 hoja de laurel", "1 tomillo pequeño de racimo", "300g / 10oz de queso de cabra", "50g / 2oz de mantequilla", "Harina normal de 50g / 2oz", "4 huevos de gallinas camperas, separados", "3 cucharadas de cebollines finamente cortados", "10g / ¼oz de parmesano finamente rallado", "sal marina y pimienta negra recién molida"], "method": ["Corta un pedazo de pergamino para hornear de 42 cm / 16 pulgadas por la mitad a lo largo. Doble una mitad por la mitad otra vez y ate alrededor de un plato de soufflé de 13cm / 5in usando hilo de cocina. Levante el papel para que cree un collar que se eleva unos 5 cm más alto que el plato. Unte con mantequilla el interior del plato soufflé y el papel generosamente.", "Coloque la leche en una sartén pequeña antiadherente y agregue la cebolla, el laurel y el tomillo. Llevar a fuego lento a fuego lento, luego retirar del fuego y dejar reposar para infundir durante 15 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Coloque una bandeja para hornear en el horno para calentar. Cuele la leche con sabor a través de un tamiz fino en una jarra. Corte la corteza del queso de cabra y corte el queso en pedazos de 2cm / ¾. (Deberías terminar con 200 g / 7 oz de queso).", "Derrita la mantequilla en una cacerola de base pesada a fuego lento. Agregue la harina, cocine por unos segundos y gradualmente empiece a agregar la leche, poco a poco, revolviendo bien entre cada adición. Cuando la salsa esté suave y muy espesa, continúe cocinando por otros dos minutos, revolviendo constantemente, luego retírela del fuego y agregue la mitad del queso de cabra.", "Batir las yemas de huevo ligeramente y mezclar en la mezcla de leche hasta que quede suave. Sazone al gusto con sal marina y pimienta negra recién molida. Vierta en un tazón grande para mezclar y cubra la superficie con una lámina de película adhesiva para evitar que se forme la piel.", "Batir las claras de huevo con una pizca de sal hasta que estén firmes, pero no secos. Están listos cuando puedes voltear el recipiente boca abajo sin que se resbalen.", "Mezcle las cebolletas en la salsa de queso. Dobla el queso restante. Doble una cucharada grande de clara de huevo hasta que se combinen, luego doble el resto.", "Vierta la mezcla lentamente en el plato soufflé preparado. Espolvorear con el parmesano y pimienta negra recién molida. (Mantenga el queso parmesano en el centro del soufflé para que no se derrita y obstaculice la subida al adherirse al papel).", "Hornee en la bandeja de hornear precalentada en el horno durante 23-25 ​​minutos o hasta que se doren y se eleven. Retire del horno, retire la cuerda y sirva el soufflé inmediatamente."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_chive_87246", "title": "Soufflé de queso de cabra y cebolleta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de hojas de albahaca", "50g / 1¾oz de piñones tostados", "50 g / 1¾oz de queso parmesano, rallado", "2 dientes de ajo picados", "75-125ml / 2½-4fl oz de aceite de oliva virgen extra", "2 calabacines, rebanados longitudinalmente", "1 calabacín amarillo, rebanado longitudinalmente", "2 cucharadas de aceite de oliva", "2 pechugas de pollo cocidas y cortadas en tiras", "1 cebolla roja grande, en rodajas", "100g / 3½oz de tomates secados al sol", "1 pan redondo grande de pan, de 23cm / 9 pulgadas de ancho", "200g / 7oz de queso de cabra, en rodajas", "3 tomates de ciruela en rodajas finas", "puñado de hojas de albahaca", "Cohete de 2 manojos", "2 lechugas Little Gem, hojas separadas", "50 g / 1¾oz de virutas de queso pecorino", "100g / 3½oz de aceitunas negras sin hueso", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de Jerez"], "method": ["Para el pesto, coloque todos los ingredientes excepto el aceite en un procesador de alimentos y mezcle. Poco a poco agregue el aceite hasta que tenga una pasta espesa, y deje de lado.", "Para el pan en capas, caliente una sartén a la plancha.", "Mezcle los calabacines en un poco de aceite de oliva y colóquelos en la plancha caliente y cocine por 2-3 minutos.", "Rebana la parte superior de la barra de pan. Ahueca el pan sacando el pan suave, dejando una pared de pan de 3 cm / 1¼ pulgada alrededor de los bordes.", "Llene el pan hueco con capas de pollo, cebolla roja, calabacines, queso, tomates, albahaca y pesto, condimentar entre cada capa.", "Vuelva a colocar la tapa del pan y empuje hacia abajo, puede envolverlo en una película adhesiva y dejarlo toda la noche o cortar de inmediato.", "Para la ensalada, coloque el cohete, Little Gem, queso y aceitunas en un bol y mezcle.", "Batir el aceite y el vinagre juntos en un tazón pequeño para hacer un aderezo.", "Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle.", "Para servir, corte el pan relleno y colóquelo en un plato con la ensalada."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_mixed_95623", "title": "Pan de cabra con queso y pollo en capas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pequeña ramita de tomillo fresco, solo hojas", "Harina normal de 100g / 4oz", "25g / 1oz de mantequilla", "25 g / 1 oz de manteca de cerdo (o más mantequilla para una opción vegetariana)", "2 cebollas rojas, finamente rebanadas", "25g / 1oz de mantequilla", "25g / 1oz de azúcar morena suave", "1 cucharada de vinagre balsámico", "1-2 cucharadas de cassis", "sal y pimienta negra recién molida", "175g / 6oz de queso de cabra", "1 yema de huevo de gallinas camperas", "1-2 cucharadas de crema doble", "2 cucharadas de aceite de oliva", "2 cucharaditas de jugo de limón", "puñado de cohetes hojas"], "method": ["Para la masa, coloque las hojas de tomillo, la harina, la mantequilla y la manteca de cerdo en un procesador de alimentos y mezcle el ajuste del pulso hasta que la mezcla se asemeje a las migas de pan. Poco a poco agregue suficiente agua fría (alrededor de 2-3 cucharadas) para formar una masa suave. Envuelva la película adhesiva y déjela en la nevera para que se enfríe durante 30 minutos.", "Para la mermelada de cebolla roja, cocine todos los ingredientes a fuego muy bajo en una sartén, revolviendo ocasionalmente para que no se agrupen.", "Precaliente el horno a 200C / 390F / Gas 6 y coloque una bandeja de horno resistente en el horno.", "Divida los pasteles en cuatro. Usando un rodillo, extiéndalo y alinee 4 x 10cm / 4 en latas de tarta de fondo suelto. Alinee las latas con papel resistente a la grasa y al horno de frijoles.", "Coloque las latas en la bandeja de horno calentada y cocine durante 10 minutos. Retire los frijoles y el papel de revestimiento y vuelva al horno durante cinco minutos. Deja enfriar por unos minutos.", "Para el queso de cabra, recorte cualquier corteza y desmenuce el queso en un tazón. Mezcle con la yema de huevo y un chorrito de crema. Sazonar con sal y pimienta negra recién molida.", "Divida la mermelada de cebolla roja entre las tartaletas y coloque encima la mezcla de queso de cabra. Vuelva al horno durante 7-8 minutos, o hasta que la parte superior esté burbujeante y teñida de marrón.", "Vierta el aceite y el jugo de limón en un tazón y sazone con mucha sal y pimienta negra recién molida. Agregue las hojas y mezcle suavemente para cubrir.", "Para servir, retire cuidadosamente las tartas de sus latas y colóquelas en un plato para servir. Cubra con la ensalada de cohetes y sirva."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_onion_51943", "title": "Tartas de queso y cebolla de cabra", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_and_onion_51943_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 175g / 6oz, más extra para espolvorear", "100g / 3½oz de mantequilla fría, en cubos", "1 huevo de gallinas camperas, golpeado", "Nueces de 30g / 1oz, más o menos picadas", "sal y pimienta negra recién molida", "1 cucharada de aceite", "Chalotes de plátano de 500 g / 1 lb 2 oz, en rodajas finas", "2 cucharadas de vinagre balsámico", "1 cucharada de azúcar mascabado ligero", "300g / 10½oz de queso de cabra suave", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de perejil fresco picado"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Coloque una bandeja grande para hornear en el horno para calentarla.", "Para hacer la masa, coloque la harina, la mantequilla y un poco de sal en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Alternativamente, coloque en un tazón y frote la mantequilla en la harina con las puntas de los dedos. Agregue el huevo batido y una cucharada de agua y mezcle hasta que se forme una bola de masa.", "Enharine ligeramente una superficie de trabajo y extienda la masa finamente (alrededor de 3 mm / ⅛ de grueso). Espolvorea las nueces picadas sobre la masa. Cubra con film transparente y pase la película adhesiva para presionar las nueces en la masa. Corta 8 círculos grandes usando un cortador de pasteles o un platillo como guía y recubre las latas de pudín de Yorkshire. Coloque en el refrigerador para enfriar mientras realiza el llenado.", "Caliente el aceite en una sartén con tapa, agregue los chalotes y cocine a fuego alto durante 2 minutos, revolviendo con frecuencia. Baje el fuego, cubra y cocine por 10 minutos hasta que esté suave. Agregue el vinagre y el azúcar y cocine durante 15 minutos, revolviendo de vez en cuando, hasta que los chalotes sean de color marrón oscuro y caramelizados. Dejar de lado para enfriar.", "Coloque el queso de cabra, los huevos batidos y la mitad del perejil en un bol. Sazone con sal y pimienta y mezcle hasta que quede suave.", "Pinchar las bases de las cajas de tartas heladas por todo el lugar con un tenedor, luego cuchara en la mezcla de chalote. Vierta la mezcla de queso de las cabras sobre las chalotas.", "Deslice las latas sobre la bandeja para hornear caliente y cocine durante 20 minutos, o hasta que la masa esté crujiente y el relleno esté recién dorado. Espolvoree con el resto del perejil picado y sirva caliente o frío."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_shallot_60881", "title": "Queso de cabra y tarta de chalote", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Rinde 8 tartas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_and_shallot_60881_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½ oz de harina natural, más extra para espolvorear", "125g / 4½oz de harina blanca fuerte", "1 cucharadita de tomillo seco", "1¼ cucharadita de sal", "225 g / 8oz de mantequilla salada, refrigerada", "50g / 1¾oz de queso parmesano, rallado", "100g / 3½oz de aceitunas deshuesadas de Kalamata", "12g / ½ oz de alcaparras", "¾ cucharadita de pasta de anchoa", "4 cucharaditas de vinagre de vino tinto", "1 diente de ajo pequeño", "algunas ramitas de tomillo fresco", "150g / 5½oz de queso de cabra suave, sin corteza", "120 g / 4¼ oz de jamón de Parma"], "method": ["Para la masa, poner las harinas, el tomillo y la sal en un tazón. Haga un pozo en el medio y vierta en 150 ml / 5 fl oz de agua. Revuelva para combinar, luego amase durante un minuto hasta que esté bien combinado. Envuelva la película adhesiva y refrigere durante 30 minutos.", "Corta la mantequilla por la mitad horizontalmente. Coloque una pieza entre el papel de hornear y extiéndalo para que tenga 14 cm de ancho y 13 cm de profundidad. Regrese a la nevera mientras saca los pasteles.", "Coloque la masa sobre una superficie de trabajo ligeramente enharinada y ruede en un rectángulo de aproximadamente 15x45cm / 6x18 pulgadas. Con un lado corto más cercano a usted, ponga una porción de mantequilla en el tercio inferior de la masa y doble. Coloque la segunda pieza de mantequilla encima de la sección doblada y coloque la parte superior de la masa sobre la mantequilla. Pellizca los bordes para que la mantequilla quede sellada en la masa. Gírelo de modo que quede un borde corto hacia usted y extiéndalo en un rectángulo de 15x40 cm / 6x16 cm, dóblelo en tres (como una letra), envuélvalo en una película adhesiva y refrigere durante 30 minutos.", "Coloque la masa sobre una superficie de trabajo ligeramente enharinada, con el borde corto más cercano a su altura de 15x40cm / 6x16 pulgadas, doble el tercio inferior hacia arriba y el tercio superior hacia abajo. Dale a la masa un cuarto de vuelta y desplázate y dobla como antes. Envuelva la película adhesiva y refrigere durante 30 minutos.", "Con el borde corto hacia ti, desplázate y dobla como antes, gira un cuarto de vuelta y desplázate, esta vez cubre la masa con el queso parmesano rallado antes de doblar. Envuelva la película adhesiva y refrigere durante 30 minutos. Repita, pero sin rociar con parmesano.", "Para el llenado, primero haga una tapenade. Coloque las aceitunas, las alcaparras, la pasta de anchoa, el vinagre, el ajo y el tomillo en el procesador de alimentos y pulse hasta que tenga una pasta bastante suave.", "Para finalizar, enrolle la masa en un rectángulo grande y recorte para formar un rectángulo ordenado de aproximadamente 30x24 cm / 12x9½ pulg. Suavice un poco el queso de cabra en un recipiente machacándolo con un tenedor. Agregue tapenade y mezcle bien.", "Extienda el relleno sobre la masa y coloque el jamón de Parma uniformemente sobre la parte superior. Enrolle la masa firmemente comenzando por un borde corto hasta llegar al medio, luego repita en el otro lado. Cuando los dos rollos se unen, cepille con un poco de agua y presione suavemente para ayudarlos a mantener la forma. Cortar en rebanadas de 1cm / ½ en gruesas, usando un cuchillo de sierra grande. Coloque bien aparte en bandejas para hornear engrasadas y enfríe por 20 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hornee durante 20 minutos o hasta que la masa esté crujiente. Si aún están crudos en el medio, voltéelos y vuelva al horno por otros 2-3 minutos. Retire del horno y deje enfriar en la bandeja antes de servir."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_black_olive_33876", "title": "Queso de cabra, aceitunas negras y palmiste", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 16 palmisteras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_black_olive_33876_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de coquilla, sin cáscara y finamente picada", "50g / 2oz de pan rallado", "2 x 125 g / 4½ oz de queso de cabra Crottin de Chavignol", "2 melocotones blancos, partidos por la mitad, piedras removidas", "1 cucharada de miel, más extra para lloviznar", "algunas virutas de trufa negra fresca", "150 g / 5½ oz de mascarpone", "100g / 3½oz rizado (escarola)", "100g / 3½oz de acelga roja", "brotes de alfalfa, para adornar"], "method": ["Precaliente la parrilla a fuego medio-alto.", "En un tazón, combine los cocos picados con las migas de pan.", "Cortar los quesos de cabra en una diagonal por la mitad y enrollarlos en las migas de pan de azúcar.", "Coloque los melocotones a la mitad en una bandeja para hornear y rocíe con miel. Grill hasta que se dore.", "Mientras tanto, rallar un poco de trufa negra en el mascarpone y mezclar hasta que esté bien combinado.", "Mezcle el frisée con la acelga roja y divídalo entre cuatro platos para servir. Coloque una rodaja de queso de cabra y medio melocotón en la parte superior de cada plato. Rocíe un poco más de miel, termine con una cucharada de mascarpone trufada y una pizca de brotes de alfalfa."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_white_91501", "title": "Queso de cabra y ensalada de durazno blanco con crema de mascarpone trufada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]