[{"isVegetarian": true, "title": "Lime and coriander rice", "url": "www_bbc_co_uk_food_recipes_limeandcorianderrice_88154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz basmati rice", "3 tbsp fresh chopped coriander", "1 lime, zest and juice", "salt and freshly ground black pepper", "dash of olive oil"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice according to the packet instructions and then stir in the coriander, lime zest and juice, salt and freshly ground black pepper and olive oil. ", "Spoon into a bowl and serve."]}, {"isVegetarian": true, "title": "Lime cheesecake with strawberries", "url": "www_bbc_co_uk_food_recipes_limecheesecakewithst_92316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 strawberries, hulled and sliced", "300ml/½ pint double cream", "3 tbsp Greek-style yoghurt", "4 tbsp condensed milk", "½ lime, zest and juice", "55g/2oz dark chocolate, melted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put two 10cm/4in diameter chefs' rings on two plates. Line the edges with strawberry slices.", "Whisk the cream in a mixing bowl until it forms soft peaks. Stir in the Greek-style yoghurt, condensed milk and lime zest. Add the lime juice, to thicken the mixture.", "Spoon the cream mixture into the strawberry-lined rings and level off the top. Place in the fridge to set for 5-10 minutes, or longer if possible.", "Release the cheesecakes from the rings by heating carefully with a cook's blowtorch around the outside. Drizzle with the melted chocolate and serve."]}, {"isVegetarian": true, "title": "Lime and cranberry bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_limeandcranberrybrea_92670", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/limeandcranberrybrea_92670_16x9.jpg", "ingredients": ["8 limes, zest and juice", "85g/3oz chilled butter, cut into cubes", "225g/8oz caster sugar", "3 free-range eggs, lightly beaten", "300ml/10½fl oz full-fat milk", "300ml/10½fl oz double cream", "pinch salt", "3 free-range eggs", "100g/3½oz soft light brown sugar", "40g/1½oz unsalted butter, softened, plus extra for greasing", "4-6 soft white bread rolls, sliced", "100g/3½oz fresh cranberries", "50g/2oz dried cranberries", "3-4 tbsp rum (optional)", "8 tbsp ready-made redcurrant jelly, for glazing", "200ml/7fl oz double cream, whipped until stiff peaks form when the whisk is removed, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lime curd, heat all of the lime curd ingredients in a heavy-based saucepan over a low heat for 10-12 minutes, stirring constantly, until the mixture thickens. Strain through a fine sieve and set aside to cool. Once cool, pour into sterilised jam jars.", "For the pudding, heat the milk and cream in a separate saucepan until just boiling, then remove the pan from the heat. In a separate bowl, whisk the eggs, salt and sugar together until well combined, then pour the milk and cream mixture over the egg and sugar mixture, whisking until smooth and well combined.", "Butter the bread slices and, using about 12 tablespoons of the lime curd, spread curd over both sides of each slice of bread.", "Cover the bottom of a greased ovenproof dish with a layer of the bread slices, overlapping the edges of the bread slightly. Sprinkle over some of the fresh and dried cranberries and 1-2 tablespoons of rum, if using. Repeat the layering process once more, or until all of the bread, cranberries and rum have been used up. (NB: You should have enough for two layers.)", "Pour the cream and egg mixture over the bread and set aside to soak for one hour. ", "Preheat the oven to 180C/365F/Gas 4.", "Place the pudding dish into a roasting tray. Carefully add enough boiling water to the tray to reach one third of the way up the sides of the pudding dish (this is called a bain-marie). Transfer to the oven and bake for 40-45 minutes, uncovered, or until the custard has set and the top of the pudding is pale golden-brown. (NB: Check the pudding occasionally during cooking, pushing any cranberries that float to the surface back under the custard as it sets, using a fork, to prevent the cranberries from burning.)", "Remove the pudding from the oven and from the bain-marie and set aside to cool for 8-10 minutes. ", "Meanwhile, heat the redcurrant jelly in a saucepan with two tablespoons of water, until the jelly has melted and the mixture forms a smooth sauce. Brush the top of the pudding all over with this mixture, then set aside to cool for a further 10 minutes.", "Serve with the whipped cream."]}, {"isVegetarian": false, "title": "Limed queen scallops flambéed in tequila", "url": "www_bbc_co_uk_food_recipes_limedqueenscallopsfl_79862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["generous glug olive oil ", "generous knob butter ", "4 small shallots, finely chopped", "1 lime, juice and zest only", "1 tsp sugar", "2 dozen queen scallops, trimmed and ready to cook", "generous glug good-quality tequila (you can drink the rest of the bottle over dinner!)", "1 handful chives finely chopped ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil and butter in a heavy-bottomed frying pan over a medium heat. Add the shallots and sweat gently - do not allow to brown.", "Add the lime juice and zest and cook for a minute or two.", "Add the sugar and stir continuously - it's important to keep the ingredients moving around the pan at this point to prevent the sugar from burning.", "Increase the heat to high then add the scallops. Fry for another minute.", "Add a big glug of tequila and the chopped chives and flambé - if cooking on gas carefully let the flame just catch the pan or if using an electric hob you might need to use a match to ignite the tequila (CAUTION: Take care when flambéing the scallops and keep your face well away from the pan. If you're not an experienced cook you must be aware that this method of cooking can create large flames). If the tequila doesn't light quickly then don't be tempted to keep the pan on the heat any longer as this will overcook the scallops.", "Serve the scallops hot from the pan and in warm tortilla wraps or with lemon butter rice."]}, {"isVegetarian": true, "title": "Lime, ginger and vanilla soufflé", "url": "www_bbc_co_uk_food_recipes_limegingerandvanilla_81308", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg whites", "100g/3½oz caster sugar", "100ml/3½fl oz milk", "25g/1oz unsalted butter, plus extra for greasing", "1 tsp cornflour", "½ tsp ground ginger", "¼ tsp vanilla extract", "2 limes, zest only", "icing sugar, for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and place a baking tray in the oven to heat.", "In a large bowl whisk the egg whites until stiff peaks form. Gradually add the sugar and continue whisking until light and fluffy. Stop when the mixture is thick enough to leave a ribbon-like trail when the whisk is lifted.", "Heat the milk in a small saucepan to scalding point. Add the 25g/1oz butter and allow it to melt, then add the cornflour, ground ginger and vanilla extract. Whisk until thick. Pour into a large bowl and mix in the lime zest. ", "Spoon a little of the egg white mixture into the lime and ginger mixture and mix well. Carefully fold in the rest of the egg white mixture, making sure to maintain the volume.", "Fill two greased ramekins with the mixture and place on the hot baking sheet and into the oven. Cook for 10 minutes until the soufflés have risen.", "To serve, place the soufflés on the centre of a plate and dust with icing sugar."]}, {"isVegetarian": false, "title": "Lime roasted salmon fillet on citrus coriander mushy peas", "url": "www_bbc_co_uk_food_recipes_limeroastedsalmonfil_90411", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5oz salmon fillet", "1 lime, peeled and sliced", "1 tsp brown sugar", "salt and freshly ground black pepper", "85g/3oz frozen peas", "25g/1oz butter", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the salmon, heat half of the olive oil in an ovenproof frying pan and fry the fish skin-side down for 2-3 minutes, or until crisp and golden-brown. Lay the lime slices over the fish, sprinkle with the sugar, season with salt and freshly ground black pepper and place into the oven to roast for 5-7 minutes, or until cooked through. ", "For the peas, cook the peas in boiling water for 2-3 minutes, or until tender. Drain, then mash with the butter and lime juice and season with salt and freshly ground black pepper. ", "To serve, spoon the mushy peas onto a serving plate and lay the salmon over the top."]}, {"isVegetarian": false, "title": "Lime syrup", "url": "www_bbc_co_uk_food_recipes_limesyrup_72368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz caster sugar", "8 green cardamom pods, seeds removed and crushed", "150ml/5¼fl oz water", "150ml/5¼fl oz lime juice", "1 tbsp grated lime zest or to taste", "pineapple chunks or rings"], "serves": "Makes 4 Servings", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the caster sugar, cardamom pods and water in a pan. Stir over a gentle heat until the sugar has dissolved.", "Take off the heat and allow to cool before adding the lime zest. Mix and pour over the pineapple chunks or rings."]}, {"isVegetarian": true, "title": "Limoncello trifle", "url": "www_bbc_co_uk_food_recipes_limoncello_trifle_74838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs  ", "165g/6oz caster sugar", "2 free-range eggs, yolks only", "80g/3oz unsalted butter", "1 lemon, zest and juice only", "6-8  thick slices of Sicilian lemon and orange sweet bread (crusts off), quartered", "small glass of limoncello liqueur", "4 small meringue nests", "300ml/10fl oz fresh custard      ", "300ml/10fl oz double cream", "1 tbsp icing sugar", "¼ tsp vanilla extract", "handful toasted almond slivers", "candied lemon zest"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lemon curd, whisk the eggs, sugar and yolks together in a bowl. ", "In a heavy-based pan, over a very low heat, gently heat the butter, zest and juice, until the butter has melted. Add the egg mixture and stir constantly over a low heat until it’s thickened. This will take 10 minutes or more. Don’t rush it or you’ll get scrambled eggs. ", "Strain the lemon curd mixture into a bowl and cover with a circle of baking parchment, or use clingfilm in contact with the surface, to prevent a skin forming, and allow to cool.  If you are not using the curd immediately, strain into a sterilized jar, allow to cool and seal. ", "To assemble the trifle, line a 2 litre/3½ pint serving bowl with slices of Sicilian lemon and orange sweet bread, overlapping them slightly. ", "Drizzle the limoncello over the top and let it soak into the bread, then spread the lemon curd on top. ", "Break up the meringue nests and scatter them over the curd, followed by the custard generously spooned over the top. ", "Pour the cream into a bowl. Add the sugar and vanilla essence and whisk until it holds soft peaks when the whisk is removed. Spoon the cream over the top of the trifle in soft peaks. Scatter over the toasted almond and candied lemon zest. Chill until ready to serve."]}, {"isVegetarian": false, "title": "Limoncello-flavoured panna cotta with fresh strawberry sauce", "url": "www_bbc_co_uk_food_recipes_limoncelloflavouredp_11694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 gelatine leaves ", "250ml/8fl oz milk ", "250ml/8fl oz double cream ", "25g/1oz sugar ", "50ml/2oz limoncello liqueur    ", "knob of butter ", "50g/2oz sugar  ", "150g/5oz strawberries, quartered  ", "½ lemon, juice only", "To decorate:  ", "lemon slices dredged in icing sugar"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Soften the gelatine leaves in cold water.  ", "In a heavy-based saucepan, mix the milk, cream, sugar and limoncello liqueur.  Gently simmer,  remove from the heat and add the gelatine leaves.", "Stir until the gelatine has dissolved and pour into dariole moulds.  Leave to cool, then place in the fridge to set.  ", "To make the sauce, place the butter and sugar in a saucepan over a gentle heat and allow the butter to melt and sugar dissolve.  ", "Add the chopped strawberries and lemon juice.  Remove from the heat and pass through a sieve. Allow to cool. ", "Turn the panna cotta out onto individual serving plates and spoon the strawberry sauce all around.  Decorate with a slice of lemon dipped in icing sugar.   "]}, {"isVegetarian": true, "title": "Lincolnshire plum bread", "url": "www_bbc_co_uk_food_recipes_lincolnshireplumbrea_92134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz prunes, pits removed, roughly chopped", "50g/2oz currants", "50g/2oz sultanas", "150ml/5fl oz Earl Grey tea", "450g/1lb strong plain flour, plus extra for flouring", "125ml/4½fl oz milk", "6 tbsp soft brown sugar", "110g/4oz butter, melted, plus extra butter for greasing", "2 free-range eggs, beaten", "1½ tsp ground cinnamon", "1½ tsp ground allspice", "½ tsp vanilla extract ", "¼ tsp salt", "15g/½oz dried yeast", "butter", "Lincolnshire cheese"], "serves": "Makes 1 loaf (6-8)", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the dried fruits into a bowl and pour over the Earl Grey tea. Mix well and set aside to soak for 10 minutes.", "Meanwhile, sift the flour into a large bowl. Prepare a large loaf tin by greasing and flouring the bottom and sides.", "In a separate bowl, whisk together the milk, sugar, melted butter and eggs until well combined.", "Add the spices, vanilla extract and salt and whisk again to combine. ", "Add the dried yeast and whisk again to combine.", "Add the sifted flour a little at a time and whisk until all of the flour has been incorporated into the mixture and the mixture comes together as a soft dough.", "Strain the soaked dried fruits and discard the tea. Add the soaked fruits to the dough and knead for 3-5 minutes, or until the dough is smooth and elastic and the fruits are well combined in the mixture. ", "Transfer the dough to a clean bowl, cover with a clean tea towel and set aside in a warm place for 1-2 hours, or until doubled in size (proved). ", "When the dough has doubled in size, turn it out onto a lightly floured work surface and knead briefly. Transfer the dough to a large loaf tin and set aside for a further hour to rise.", "Preheat the oven to 190C/375F/Gas 5.", "When the dough has risen, bake in the oven for 40-50 minutes, or until golden-brown. Set aside to cool in the tin. ", "Allow to cool before slicing.", "To serve, cut the plum bread into slices and serve with butter and cheese."]}, {"isVegetarian": true, "title": "Lincolnshire Poacher cheese and potato croquettes with tomato salad", "url": "www_bbc_co_uk_food_recipes_lincolnshirepoacherc_86700", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large baking potatoes", "salt and freshly ground black pepper ", "110g/4oz Lincolnshire Poacher cheese, cut into small cubes", "50g/2oz plain flour", "2 free-range eggs, beaten", "50g/2oz fresh breadcrumbs", "vegetable oil, for deep-frying", "4 plum tomatoes, roughly chopped", "1 red onion, finely chopped", "1 tbsp capers", "handful flatleaf parsley, roughly chopped", "2 tbsp red wine vinegar", "4 tbsp rapeseed oil", "salt and freshly ground black pepper ", "75g/3oz mixed salad leaves"], "serves": "Serves 2-4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the croquettes, prick the baking potatoes all over with a fork and place in the oven for an hour, or until tender.", "Scoop the potato flesh into a bowl, discarding the skins. Mash with a potato masher until smooth and season, to taste, with salt and freshly ground black pepper. Set aside to cool.", "Take a piece of cheese and mould a little of the potato around it, pressing firmly into a sausage shape. Repeat with the remaining cheese and potato.", "Dredge the potato 'sausages' in the flour, then dip into the beaten egg and then the breadcrumbs to coat. Place in the fridge to set for 30 minutes.", "Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Remove the croquettes from the fridge and carefully place into the hot oil. Deep fry for 2-3 minutes, or until golden-brown and crisp on the outside and melting inside. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the salad, place the tomatoes, red onion, capers and flatleaf parsley into a bowl and stir.", "In a small bowl, whisk the vinegar and oil together and season, to taste, with salt and freshly ground black pepper.", "Pour two thirds of the dressing over the tomato salad and mix well. In another bowl, toss the salad leaves with the remaining dressing.", "To serve, place the croquettes onto serving plates with the tomato and leaf salads."]}, {"isVegetarian": true, "title": "Muhallabi (almond milk pudding)", "url": "www_bbc_co_uk_food_recipes_lindas_muhallabi_milk_08578", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lindas_muhallabi_milk_08578_16x9.jpg", "ingredients": ["7 tbsp cornflour", "1 litre/1¾ pints almond milk (with no added sugar, if possible)", "5 tbsp caster sugar", "2 tsp vanilla essence", "2 tbsp rosewater", "2 whole cardamom pods", "2 tbsp pistachios or almonds, coarsely ground", "1 tbsp finely ground cardamom"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the cornflour with a little of the almond milk to a smooth paste. Set aside.", "In a saucepan, heat the remaining almond milk with the sugar, vanilla essence, rosewater and cardamom pods over a medium heat, stirring until mixed well.", "Once the mixture has heated through, discard the cardamom pods, then pour in the cornflour paste and whisk vigorously until the mixture is smooth and has thickened to an almost custard-like consistency; this will take 10-15 minutes. Be careful not to let the mixture stick to the bottom of the pan.", "Pour the mixture into individual dishes or a large serving bowl and decorate with a sprinkling of ground pistachios or almonds and the ground cardamom. Set aside to cool, then cover and chill in the fridge for at least 15 minutes. Serve chilled."]}, {"isVegetarian": false, "title": "Linguine with fresh crab", "url": "www_bbc_co_uk_food_recipes_linguine_with_fresh_crab_02642", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz '00' flour, plus extra for dusting", "5 free-range eggs, lightly beaten", "pinch salt", "2 tbsp extra virgin olive oil", "1–2 tbsp cold water", "4 whole live crabs (800–900g/1lb 12oz–2lb each)", "1 leek, halved", "few sprigs fresh parsley ", "500ml/18fl oz white wine", "5 whole garlic cloves ", "85g/3oz pesto", "4 tbsp olive oil", "3 garlic cloves, finely chopped", "1 tsp finely chopped red chilli", "4 courgettes, finely diced", "1 tbsp finely chopped fresh parsley", "400g/14oz linguine, from the recipe above"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the linguine, put the flour on a work surface, make a well in the centre and add the beaten eggs, salt and oil. Using your fingertips in a circular motion, slowly incorporate the flour into the egg mixture, adding a little water if necessary, to form a dough.", "Knead for 5 minutes, until the dough is elastic and springs back when gently pressed. Cover with cling film and allow to rest for at least 30 minutes in the fridge.", "Roll the pasta dough out in 4-6 batches using a pasta machine working from the thickest to the penultimate setting, allowing the sheets to dry for 10 minutes uncut. Pass the rolled sheets through the linguine cutter on the machine and hang the linguine over a coat hanger or similar to air while you cook the sauce. ", "For the sauce, put the leek, parsley sprigs, 300ml/10fl oz of the wine, 5 whole garlic cloves in a large stock pot with enough water to cover the crabs. Bring to the boil, add the crabs and cook for about 6 minutes.", "Remove the crabs from the hot water and place immediately into iced water. When the crabs are cold, remove the meat from each. Open the body, remove all the brown meat and set aside. Remove the white meat from the skinny legs but leave the claws. Mix the white and brown meat together. Crack the claws but leave whole. Place the claws in a baking dish, pour over the pesto and leave to marinate. Clean out the crab shells.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Heat the olive oil in a large saucepan, add the chopped garlic, chilli, brown and white crab meat, courgettes and chopped parsley. Fry for 1 minute then add the remaining wine. When the sauce has bubbled down and thickened, remove from the stove. ", "Bake the marinated crab claws in the oven for 2 minutes to heat through.", "Meanwhile, bring a large pan of salted water to the boil and cook the fresh linguine for 2–3 minutes, drain and add to the sauce. Mix together and serve immediately.", "Present the dish with the linguine and sauce in a warmed pasta plate with a crab claw on top."]}, {"isVegetarian": false, "title": "Linguine with prawns and mussels", "url": "www_bbc_co_uk_food_recipes_linguine_with_prawns_and_29068", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/linguine_with_prawns_and_29068_16x9.jpg", "ingredients": ["500g/1lb 2oz mussels", "250g/9oz whole raw prawns ", "6 tbsp olive oil", "1 garlic clove, crushed", "½ red chilli, finely sliced", "50ml/2fl oz white wine", "1 lemon, juice only", "small bunch flatleaf parsley, roughly chopped", "400g/14oz linguine", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels by scrubbing them in cold water, and removing the beards. If any remain open after tapping them against the side of the work surface, discard them. Peel the prawns, removing the heads but leaving the tails intact. ", "Heat the olive oil in a large lidded saucepan, and add the garlic and chilli. After a minute or two, add the mussels and the wine. Cover with the lid and continue cooking for 1-2 minutes, or until the mussels open. If any mussels remain closed at the end of cooking, discard them.", "Add the prawns and cook for a further 4–5 minutes, then squeeze in the lemon juice. Remove the pan from the heat and add the roughly chopped parsley. Season to taste with salt and freshly ground black pepper.", "Meanwhile, cook the linguine in lightly salted boiling water for 7-8 minutes, or until al dente. Add the pasta to the pan with the shellfish sauce, mix together well and serve immediately. "]}, {"isVegetarian": false, "title": "Linguine alla carbonara", "url": "www_bbc_co_uk_food_recipes_linguineallacarbonar_85503", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "4 bacon rashers, chopped", "1 garlic clove, finely chopped", "5 tbsp double cream", "100g/3½oz fresh linguine, cooked according to packet instructions and drained", "1 free-range egg yolk", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan and fry the bacon until golden-brown. Add the garlic and cook for one minute.", "Add the double cream and bring up to the boil.", "Remove from the heat and immediately add the warm linguine and the egg yolk. Stir to coat the pasta.", "To serve, sprinkle over the chopped herbs and place the pasta into a serving dish."]}, {"isVegetarian": true, "title": "Linguine omelette with goats' cheese and aubergine", "url": "www_bbc_co_uk_food_recipes_linguineomelettewith_89109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ aubergine, chopped", "3 free-range eggs, beaten", "100g/3½oz goats' cheese, crumbled", "3 tbsp chopped fresh parsley", "½ tsp chilli flakes", "salt and freshly ground black pepper", "150g/5½oz linguine, cooked according to packet instructions"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the oil in a frying pan and fry the chopped aubergine for 5-6 minutes, or until softened.", "In a large bowl, combine the beaten eggs, goats' cheese, chopped parsley, chilli flakes, salt and freshly ground black pepper then stir in the cooked pasta. Add the fried aubergine and mix well. ", "Heat the remaining oil in  small frying pan and tip in the pasta mixture. Allow to cook for 3-4 minutes, or until the bottom is golden-brown and set, then carefully turn the pasta omelette over to cook the other side for a further 3-4 minutes, or until golden-brown and set. ", "To serve, slide onto a serving plate and cut into wedges."]}, {"isVegetarian": true, "title": "Linguine with chilli, lemon and basil", "url": "www_bbc_co_uk_food_recipes_linguinewithchillile_85502", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["handful fresh basil leaves ", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 red chilli, finely chopped", "2 garlic cloves, finely chopped", "½ lemon, juice only", "small handful fresh basil leaves, chopped", "200g/7oz fresh linguine, cooked according to packet instructions and drained"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the basil paste, place the basil and olive oil into a small food processor, season with salt and freshly ground black pepper and blend until smooth.", "For the linguine, heat the oil in a pan and gently fry the chilli and garlic for 1-2 minutes.", "Add the lemon juice, chopped basil leaves and cooked linguine and stir well to coat the pasta.", "To serve, place the linguine into a serving dish and top with a dollop of basil paste."]}, {"isVegetarian": false, "title": "Linguine with chilli crab", "url": "www_bbc_co_uk_food_recipes_linguinewithchillicr_7294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dried linguine", "15ml-1 tbsp chilli oil", "2 cloves garlic, chopped", "1 large red chilli, finely chopped", "2 tbsp flat leaf parsley, chopped", "170g/6oz tin white crab meat", "juice of 1 lemon", "30-45ml/2-3 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the linguine into a pan of boiling, salted water.", "Heat the chilli oil in a small pan, add the garlic, chilli, parsley and crab meat and cook gently for a couple of minutes.", "Stir in the lemon juice and olive oil.", "Drain the pasta and stir through the chilli crab sauce. Serve immediately."]}, {"isVegetarian": false, "title": "Linguine with pancetta, broccoli and cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_linguinewithpancetta_86108", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz pancetta or streaky bacon, chopped", "¼ onion, chopped", "½ head broccoli, cut into florets", "1 tsp chilli flakes", "5 tbsp white wine", "200g/7oz canned cherry tomatoes", "salt and freshly ground black pepper", "250g/9oz linguine, cooked according to packet instructions and drained"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a non-stick frying pan and fry the pancetta or bacon until crisp.", "Add the onion and fry until softened.", "Add the broccoli, chilli flakes and white wine and simmer until the wine has reduced by half.", "Add the cherry tomatoes and simmer for a further 3-4 minutes, or until the broccoli is tender and the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. Add the pasta to the pan and stir to coat in the sauce.", "To serve, place the pasta into serving dishes."]}, {"isVegetarian": true, "title": "Linguine with pesto", "url": "www_bbc_co_uk_food_recipes_linguinewithpesto_84898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz linguine, cooked according to packet instructions", "2 tbsp olive oil", "1 clove garlic, chopped", "3 spring onions, chopped", "1 handful fresh mint leaves, very finely chopped", "1 handful fresh basil leaves, very finely chopped", "1 garlic clove, chopped", "50ml/1¾fl oz olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium heat. Add the garlic and spring onions and fry for three minutes, until softened.", "Add the cooked linguine and stir well to warm through.", "For the pesto, place the mint, basil, garlic and oil into a bowl and mix well. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the linguine onto a plate and spoon the pesto over."]}, {"isVegetarian": false, "title": "Linguine with roasted figs", "url": "www_bbc_co_uk_food_recipes_linguinewithroastedf_79285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large fresh figs", "8 slices prosciutto or speck bacon", "2 shallots, peeled and chopped", "2 garlic cloves, peeled and chopped ", "1 tbsp olive oi, plus extra for cooking pastal", "100ml/3fl oz white wine ", "200g/7oz dolcelatte cheese", "300ml/10fl oz double cream ", "salt and freshly ground black pepper", "2 large sprigs fresh mint, chopped", "15g/½oz fresh basil, chopped ", "15g/½oz fresh chives, chopped ", "40g/1oz parmesan cheese, shaved", "400g/14oz linguine"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8.", "Wrap each fig in two slices of prosciutto or speck bacon and secure with wooden cocktail sticks.", "Bake in the oven for about 5-6 minutes, until the bacon is nice and crisp.", "Meanwhile, sweat the shallots and garlic in one tablespoon of olive oil for a few minutes, then add the white wine.", "Boil to reduce by half, then add the dolcelatte cheese and cream.  Reduce until slightly thickened, but do not boil or the mixture will split because of the fat in the cheese.", "Season with salt and pepper and add the some of the herbs, reserving the rest of the herbs for later.", "Cook the pasta in a generous amount of boiling salted water, with a little olive oil in it, according to packet instructions (usually about 6-8 minutes for linguine). Drain it well.", "Combine the drained pasta with the sauce and divide between four serving plates.", "Remove the cocktail sticks from the wrapped figs and place one wrapped fig on top of each plate of pasta.", "Garnish with the shavings of parmesan and the remaining fresh herbs."]}, {"isVegetarian": true, "title": "Linguine with spicy tomatoes and broccoli", "url": "www_bbc_co_uk_food_recipes_linguinewithspicytom_88952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, chopped", "1 tsp curry powder", "6 cherry tomatoes, halved", "½ head broccoli, cut into florets", "splash white wine", "splash boiling water", "salt and freshly ground black pepper ", "100g/3½oz linguine"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry for 2-3 minutes, or until softened but not coloured. Add the garlic and curry powder and fry for one minute, then stir in the cherry tomatoes and cook for 4-5 minutes, or until softened.", "Add the broccoli florets, a splash of white wine and a splash of boiling water and simmer for 3-4 minutes, or until the broccoli is just tender. Season with salt and freshly ground black pepper.", "Cook the linguine, according to packet instructions, then drain. Add the cooked linguine to the sauce and stir well to coat.", "Pile the linguine into a bowl and serve."]}, {"isVegetarian": false, "title": "Tuna pasta sauce with linguine", "url": "www_bbc_co_uk_food_recipes_linguinewithtunafish_70041", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/linguinewithtunafish_70041_16x9.jpg", "ingredients": ["375g/13oz dried linguine", "4 tbsp extra virgin olive oil", "3 tbsp finely chopped parsley", "2 garlic cloves, finely chopped", "1 small chilli pepper, finely chopped", "1cm/½in fresh ginger root, thinly sliced", "450g/1lb carton or bottle passata", "400g tin of tuna fish in oil, drained and roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta for 8-10 minutes or until al dente, and drain. ", "Meanwhile, heat the oil and gently fry 2 tablespoons of the parsley, the garlic, chilli and the ginger for a few minutes until slightly soft. Add the tomatoes and continue to cook for another few minutes. Stir in the tuna and salt.", "Toss the pasta with the sauce and serve sprinkled with the remaining parsley and freshly ground pepper."]}, {"isVegetarian": false, "title": "Linguini vongole with spinach", "url": "www_bbc_co_uk_food_recipes_linguinivongolewiths_81821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz linguini", "1 tbsp olive oil", "1 clove garlic, finely chopped", "250g/9oz fresh clams, cleaned", "100ml/3½fl oz white wine", "100g/3½oz baby spinach leaves", "1 tbsp chopped fresh parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the linguini in salted boiling water until al dente. Drain and set aside.", "Heat the olive oil in a medium-sized saucepan, add the garlic and cook gently until softened. ", "Add the clams and white wine, cover with a lid and cook for two minutes. ", "Stir in the spinach and cook, covered, for one minute. ", "Add the linguini to the clams, stir well and serve in large bowls with chopped parsley to garnish."]}, {"isVegetarian": false, "title": "Linzer torte with crème fraîche", "url": "www_bbc_co_uk_food_recipes_linzer_torte_with_crme_27127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "pinch ground cinnamon", "pinch ground cloves", "40g/1½oz caster sugar", "115g/4oz unsalted butter, softened", "2 free-range egg yolks", "400g/14oz apricot jam", "400g/14oz raspberry jam", "½ lemon, zest and juice ", "8–12 whole blanched almonds", "1–2 tbsp icing sugar", "100g/3½oz crème fraîche"], "serves": "Makes 1 large torte", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put the flour, spices and sugar in a mixing bowl. Rub in the butter, then add the egg yolks and bring the dough together. Wrap in cling film and chill for an hour.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Set aside approximately a third of the chilled pastry to make a lattice top. On a lightly floured work surface, roll out the remaining pastry to the thickness of a pound coin and line a 23–25cm/9–10in tart tin. Make a lattice by rolling out the reserved pastry and cutting it into 25cm/10in ribbons. Weave the pastry ribbons together leaving equal spaces between each ribbon (so squares of jam will be visible between the pastry).", "Fill the pastry case with apricot jam and place the lattice on top. Trim the edges using a knife. ", "Mix the raspberry jam with the lemon zest and juice and transfer to a piping bag fitted with a plain nozzle (alternatively place in a small food bag and snip off one corner). Pipe the jam into alternate squares of the lattice top. Put an almond on top of each square filled with jam. ", "Bake for 25–30 minutes, or until the pastry is crisp and golden-brown. Leave to cool in the tin. ", "To serve, dust the torte with icing sugar, cut into slices and with a spoonful of crème fraîche alongside."]}, {"isVegetarian": false, "title": "Liver and bacon with onions and gravy", "url": "www_bbc_co_uk_food_recipes_liver_and_bacon_with_30933", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz plain flour", "salt and freshly ground black pepper", "4.5kg/10lb lambs’ liver, sliced ", "300ml/10fl oz sunflower oil ", "10 onions, sliced", "1.25kg/2lb 12oz rindless streaky bacon rashers, each cut into 4–5 pieces ", "3.6 litres/10 pints beef stock ", "4 tbsp tomato ketchup"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put 400g/14oz of the flour into a large bowl and season with salt and freshly ground black pepper. ", "Heat half the oil in a large frying pan over a high heat.", "Coat the liver in the seasoned flour, shake off any excess, then fry each slice in the hot fat for 1–2 minutes on each side until lightly browned, but not completely cooked through. ", "Transfer the slices to a plate and repeat with the remaining liver.", "Reduce the heat, add rest of the oil and the sliced onion and cook for a minute or so, stirring occasionally. ", "Add the bacon to the pan and cook for 8–10 minutes or until the onion is a pale golden-brown and the bacon is beginning to crisp. ", "Sprinkle the rest of the flour over the onion and bacon and stir for a minute or so. Add the stock, bring to a simmer and cook over a medium heat until the gravy is thickened. Add the tomato ketchup and season with salt and freshly ground black pepper.", "Return the liver to the pan with the onion gravy for just 1–2 minutes to warm it through and finish cooking. "]}, {"isVegetarian": false, "title": "'Lion head' meatballs", "url": "www_bbc_co_uk_food_recipes_lionheadmeatballs_89292", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lionheadmeatballs_89292_16x9.jpg", "ingredients": ["500g/1lb 2oz beef mince", "4 garlic cloves, finely chopped", "2 tbsp grated fresh root ginger", "2 spring onions, finely chopped", "pinch sea salt", "1 tbsp Shaoxing rice wine or dry sherry (or more, to taste)", "2 tbsp light soy sauce", "1 tbsp toasted sesame oil", "1 free-range egg, beaten", "1 tbsp cornflour", "pinch ground white pepper", "100ml/3½fl oz groundnut oil", "750ml/1¼ pint vegetable stock", "300g/11oz Chinese leaf, quartered lengthways ", "3 dried Chinese mushrooms, soaked in warm water for 15 minutes, then drained (alternative use fresh chestnut mushrooms, sliced)", "1 tbsp light soy sauce", "1 tbsp cornflour, mixed with 2 tbsp cold water (optional)", "sea salt and ground white pepper", "2 large spring onions, sliced", "dash sesame oil (optional)"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, place all of the meatball ingredients into a large bowl and stir to combine.", "With damp hands, take a large mound of the minced meat mixture and mould into a ball that is a little larger than a golf ball. Place on a plate and repeat with the remaining meatball mixture.", "For the finished dish, pour the groundnut oil into a large deep pan and heat over a high heat. Using a metal ladle, carefully lower each meatball into the oil and spoon some of the oil over the meatballs. Cook for 4-5 minutes, or until golden-brown all over. ", "Pour all but two tablespoons of the cooking oil out into a heatproof bowl. Add the stock to the pan and arrange the slices of Chinese cabbage around the meatballs, curving them around the sides of the pan lengthways, then add the mushrooms and soy sauce and bring to the boil. Cover the pan, reduce the heat and cook gently for 15 minutes. Alternatively, cook the meatballs in the oven; arrange in a casserole dish, cover with kitchen foil and cook in a preheated oven at 100C/210F/Gas ¼ for 30 minutes. If the sauce is too thin, add the cornflour paste and stir until thickened.", "Take the meatballs off the heat and season, to taste, with sea salt and ground white pepper. Transfer to a serving dish, garnish with the spring onions, sprinkle over a dash of seame oil and serve immediately."]}, {"isVegetarian": false, "title": "Creamy salmon pasta bake", "url": "www_bbc_co_uk_food_recipes_littleitalypastabake_14520", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/littleitalypastabake_14520_16x9.jpg", "ingredients": ["340g/12oz macaroni pasta ", "1 large can red salmon ", "handful of basil ", "250ml/9fl oz passata (sieved tomatoes) ", "3 tbsp mascarpone ", "85g/3oz breadcrumbs ", "140g/5oz fresh mozzarella ", "30g/1oz pine nuts ", "30g/1oz butter ", "200g/7oz bag mixed salad leaves ", "virgin olive oil ", "balsamic vinegar ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 190C/375F/Gas 5. ", "Cook the pasta in plenty of boiling salted water as per instruction. ", "Place the salmon into a bowl, removing any large bones. ", "Tear the basil leaves and combine with the salmon. Add the passata, mascarpone and mozzarella. ", "Drain the pasta and combine with the salmon mixture. ", "Season well and place in an ovenproof dish. ", "Top with dots of butter and sprinkle over breadcrumbs and pinenuts. ", "Place in the oven to colour the top and heat through. ", "Serve with some salad leaves dressed with olive oil, balsamic vingar and seasoning."]}, {"isVegetarian": false, "title": "Little egg and ham pies", "url": "www_bbc_co_uk_food_recipes_littleeggandhampies_13893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["11 tsp olive oil or butter, for lining the muffin tray", "12 thin slices good quality ham", "12 large eggs, preferably free-range ", "2 tbsp cream", "sea salt", "freshly ground black pepper", "4tbsp freshly grated parmesan"], "serves": "Makes 12 pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4. ", "Lightly oil or butter a 12-hole muffin tray. Line the base and most of the sides of each mould with a slice of ham, then break an egg into the hollow. Drizzle with the cream and scatter with sea salt, pepper and parmesan.", "Bake for 15 to 20 minutes until the egg is just set and starting to shrink away from the sides of the tin. ", "Leave to cool for 5 minutes, then run a knife around each mould to loosen the ham and egg and remove to a wire tray. Eat warm or at room temperature."]}, {"isVegetarian": false, "title": "Liver and bacon with onions and gravy", "url": "www_bbc_co_uk_food_recipes_liver_and_bacon_with_94841", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/liver_and_bacon_with_94841_16x9.jpg", "ingredients": ["450g/1lb lambs’ liver, sliced and fully thawed if frozen", "25g/1oz butter ", "2 tbsp sunflower oil ", "4 tbsp plain flour", "1 onion, halved lengthways and sliced", "125g/4½oz rindless streaky bacon rashers, each cut into 4–5 pieces", "1 beef stock cube", "500ml/18fl oz just-boiled water", "1–2 tsp tomato ketchup", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rinse the liver in a colander under cold water and drain well on kitchen paper. Melt half of the butter with the oil in a large non-stick frying pan over a high heat.", "Put three tablespoons of the flour in a large bowl and season with salt and freshly ground black pepper. ", "Coat half the liver in the seasoned flour, shake off any excess, then fry each slice in the hot fat for 1–2 minutes on each side until lightly browned, but not completely cooked through. ", "Transfer the slices to a plate and repeat with the remaining liver.", "Reduce the heat and melt the remaining butter in the same pan. Add the sliced onion and cook for a minute or so, stirring to separate the layers. ", "Add the bacon to the pan and cook, stirring from time to time, for 8–10 minutes or until the onion is pale golden-brown and the bacon is beginning to crisp. ", "Sprinkle the rest of the flour over the onion and bacon and stir it for a minute or so. ", "Dissolve the stock cube in the just-boiled water and pour slowly into the pan, stirring constantly. ", "Bring to a simmer and cook over a medium heat until the gravy is thickened. Add a dash of tomato ketchup and season with salt and freshly ground black pepper.", "Return the liver to the pan with the onion gravy for just 1–2 minutes to warm it through and finish cooking. ", "Serve the liver and bacon with some mash and freshly cooked greens."]}, {"isVegetarian": false, "title": "Liver and bacon salad", "url": "www_bbc_co_uk_food_recipes_liverandbaconsalad_86845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices calf's liver 225g/8oz each, 4cm/2in thick", "salt and freshly ground black pepper", "100g/3½oz plain flour, seasoned with salt and freshly ground pepper ", "30g/1oz unsalted butter", "25ml/1fl oz good quality balsamic vinegar", "6 slices smoked back bacon, grilled, chopped into strips", "handful watercress", "handful rocket", "100g/3½oz cucumber, seeds removed, cut into small cubes", "8 sun-blushed tomatoes, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the liver well with salt and freshly ground black pepper, then dredge in the seasoned flour, shaking off any excess flour. ", "Melt the butter in a pan over a medium heat until it foams.", "Add the liver to the pan of melted butter and cook for three minutes, until the liver had turned slightly brown, then turn the liver over and cook for another three minutes. ", "Turn the liver over again, reduce the heat a little, and drizzle the liver with the balsamic vinegar. Cook for a further 2-3 minutes, or until cooked to your liking.", "Add the bacon, watercress, rocket, cucumber and sun-blushed tomatoes to the pan and stir well for ten seconds.", "To serve, place a piece of liver onto each plate and arrange the pan juices and vegetables around the plate."]}, {"isVegetarian": false, "title": "Liver, mash and onion rings", "url": "www_bbc_co_uk_food_recipes_liver_mash_and_onion_54291", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 8oz potatoes, quartered", "200g/7oz butter", "150ml/5fl oz milk", "50g/1¾oz  plain flour, for coating", "8 thin slices calves liver", "salt and freshly ground black pepper", "1 tsp fresh yeast", "400ml/14fl oz beer", "200g/7oz plain flour", "2 small onions, finely sliced into rings", "100g/3½oz baby capers, drained", "50g/1¾oz unsalted butter", "2 shallots, sliced", "2 tsp fresh thyme leaves", "100ml/3½fl oz red wine", "300ml/10 fl oz beef jus or stock", "2 tbsp sherry vinegar", "2 tbsp fresh chervil leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in salted water for 15 minutes, or until tender. Drain and place back into the saucepan over the heat to remove excess moisture. Mash the potatoes.", "Heat 150g/5½oz of the butter and the milk in a saucepan until the butter is melted. Add to the mash and beat well until soft and creamy. Season with salt and pepper.", "For the onion rings, put the yeast and beer into a bowl and whisk together. Add the flour and whisk to a smooth batter. Set aside for 5 minutes. ", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.) ", "Dip the onion rings in the batter then lower them carefully into the hot oil (you may need to do this in batches). When the onion rings are golden-brown, remove them using a slotted spoon and season with salt and pepper. Drain on kitchen roll.", "Add the capers to the deep fat fryer and cook for 1-2 minutes. Remove and drain on kitchen paper.", "For the gravy, heat the butter in a frying pan over a medium heat. When the butter is foaming add the shallots and fry for 2-3 minutes, or until just softened.", "Add the thyme and red wine, stir well and bring the mixture to the boil. Reduce the heat to a simmer and then simmer until the volume of liquid has reduced by one third.", "Add the jus and return the mixture to the boil. Reduce the heat slightly and simmer gently for 15-20 minutes, or until the liquid has thickened. Add the sherry vinegar, chervil and season with salt and pepper. Keep warm until ready to serve.", "For the liver, season the plain flour with salt and pepper. Place the slices of calf's liver in the flour and shake off any excess. ", "Heat the remaining butter in frying pan over a medium heat. When the butter is foaming, add the liver and fry for 1-2 minutes on each side, or until golden-brown on both sides.", "Place the mash onto serving plates and liver alongside. Pour over the gravy and top with the onion rings and capers."]}, {"isVegetarian": false, "title": "Liver with Parmesan polenta", "url": "www_bbc_co_uk_food_recipes_liver_with_parmesan_17265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["115g/4oz polenta", "40g/1½oz unsalted butter", "75g/2¾oz Parmesan, finely grated", "salt", "600g/1lb 5oz calf’s liver, trimmed and any thin membrane removed, cut lengthways into slices", "olive oil, for frying", "450g/1lb small onions, thinly sliced ", "30g/1oz unsalted butter", "4 tbsp chopped flatleaf parsley", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring 900ml/1½ pint  water to the boil in a large saucepan. Pour in the polenta in a slow, steady stream, stirring or whisking all the time. Bring to a simmer and leave to cook gently, stirring frequently, for 20 minutes until cooked. Add the butter, Parmesan and a little salt and mix in. ", "Meanwhile, cut the liver slices across at a slight angle into short strips, about 2.5cm/1in wide.", "Heat 3 tablespoons of the oil in a large, heavy-based frying pan over a medium-high heat. Add the onions and cook for 10 minutes, stirring frequently, until they are soft and deep golden-brown. Put in a bowl and keep warm. ", "Add 1½ teaspoons of the oil to the pan and heat over a high heat. When the oil is sizzling hot, add a quarter of the liver, season with salt and pepper and cook for 30 seconds, stirring constantly, until lightly browned.  Tip onto a plate and repeat three times with the remaining liver. ", "Return all the liver to the pan with the onions and any juices from the plate and toss over a high heat for another 30 seconds. Spoon on to a warm plate.", "Add the butter to the pan and scrape up any browned bits from the base. Remove from the heat and stir in the chopped parsley. Spoon over the liver and onions.", "To serve, put the polenta on warmed plates and spoon some liver and buttery juices on top. "]}, {"isVegetarian": false, "title": "Pork and parmesan ravioli", "url": "www_bbc_co_uk_food_recipes_lizs_pork_and_parmesan_68228", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lizs_pork_and_parmesan_68228_16x9.jpg", "ingredients": ["500g/1lb 2oz '00' pasta flour, plus extra for dusting", "2 tsp salt ", "5 free-range eggs", "1 tbsp olive oil", "3 tbsp olive oil", "500g/1lb 2oz pork mince", "3 garlic cloves, finely chopped", "1 onion, finely chopped", "1 celery stalk, trimmed, finely chopped", "2 free-range eggs", "3 tbsp chopped fresh parsley", "3 tbsp grated parmesan, plus extra to garnish", "3 tbsp tomato sauce (see below)", "3 tbsp olive oil", "3 garlic cloves, finely chopped", "1 celery stalk, trimmed, finely chopped", "1 onion, finely chopped", "700g/1½lb passata", "2 tbsp chopped fresh basil", "2 tsp dried oregano", "1 tsp caster sugar", "pinch salt, to taste"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pasta, pile the flour onto a chopping board or clean work surface and make a well in the centre. Pour the salt, eggs and oil into the well. Carefully mix the dry and wet ingredients together using a wooden spoon, then work the mixture into a dough using your hands, adding a touch of water if the dough feels dry. ", "Turn the pasta dough out onto a lightly floured work surface and knead for 12-15 minutes until it is smooth and glossy without any dry or damp patches. Roll the dough into a ball, wrap it in cling film and set aside to rest for 30 minutes.", "Meanwhile, for the filling, heat the oil in a saucepan over a medium heat. Add the pork mince, garlic, onion and celery and fry gently for 12-15 minutes, or until the pork has browned and the vegetables have softened. Remove from the heat and set aside to cool.", "For the tomato sauce, heat the oil in a separate frying pan over a medium heat. Add the garlic, celery and onion and fry for 6-8 minutes, or until just coloured. Add the passata and 300ml/10½ fl oz water, stir the mixture well and bring to the boil. ", "Reduce the heat until the mixture is simmering and simmer gently for 30 minutes, then stir in the basil, oregano, sugar and salt. Keep warm.", "When the filling mixture has cooled, blend it to a rough paste in a food processor, then transfer to a bowl. Beat in the eggs, parsley, parmesan and 3 tablespoons of the tomato sauce until well combined. ", "To make the ravioli, cut the dough into satsuma-sized pieces. Dust the rollers of a pasta machine with flour.", "Working with one piece of dough at a time, flatten the dough and feed it twice through a pasta machine set to its widest setting. Adjust the pasta machine so that the rollers are on the second-widest setting, then roll the dough through the machine again. Continue adjusting the machine until you have rolled the dough through its narrowest setting. Set the pasta sheet aside (cut it into smaller lengths if it is unmanageably long). ", "Repeat the rolling process with the remaining pieces of dough.", "When all of the pasta has been rolled out thinly, lay one sheet of pasta over a ravioli mould. Spoon a little of the filling mixture into the centre of each ravioli (use the wells of the mould as a guide). Brush the edges of each raviolo with water using a pastry brush or your finger. ", "Lay another sheet of pasta on top of the ravioli, then press the pasta sheets together to seal the edges of each raviolo, squeezing out as much air as possible in the process. Turn the ravioli out of the tray and cut through the sealed edges to separate them.", "Repeat the filling and cutting process with the remaining pasta sheets and filling mixture.", "Bring a large pan of salted water to the boil. Carefully lower the ravioli into the water, in batches, and cook for 3-4 minutes; they are cooked when they float to the surface of the water.", "Serve the ravioli in serving bowls topped with the warm tomato sauce and a sprinkling of parmesan."]}, {"isVegetarian": false, "title": "Liver Veneziana", "url": "www_bbc_co_uk_food_recipes_liverveneziana_83809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 mild onions, peeled and very finely sliced", "3 tbsp light olive oil ", "salt and freshly ground pepper", "40g/1½oz butter", "8 thin slices of calf's liver, cut into small squares", "1 tbsp chopped parsley", "2 tbsp wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Over a low heat, fry the onions in the olive oil until they are coloured and very soft - this can take up to 30 minutes. Season with salt and freshly ground pepper, and tip into a bowl.", "In a frying pan, heat the butter until foaming. Season the calf's liver with salt and freshly ground pepper, and briefly cook the meat in the butter for about 20 seconds. Transfer to a colander and drain.", "Tip the cooked onions back into the liver pan and toss briefly until they are golden brown and slightly scorched.", "Return the liver to the pan with the parsley and finally stir in the vinegar. Serve."]}, {"isVegetarian": true, "title": "Loaded aubergine burgers with avocado mayo", "url": "www_bbc_co_uk_food_recipes_loaded_aubergine_burgers_44288", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loaded_aubergine_burgers_44288_16x9.jpg", "ingredients": ["4 multiseed bread rolls (each weighing about 75g/2¾oz), halved", "1 large aubergine, wide middle section cut into 4 slices 2cm/¾in thick ", "1½ tbsp extra virgin olive oil", "½ tsp ground cumin", "½ tsp ground coriander", "1 small red pepper, deseeded and finely sliced", "1 small yellow pepper, deseeded and finely sliced", "1 red onion, finely sliced", "1½ tbsp red wine vinegar", "1 tbsp soft light brown sugar", "25g/1oz fresh rocket leaves or baby leaf salad", "1 large beef tomato, cut into four thick slices", "coriander sprigs, to garnish (optional)", "1 small ripe avocado, peeled, stoned and roughly chopped", "2 tsp fresh lime juice", "1 small garlic clove, crushed", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a griddle pan over a medium heat. ", "Meanwhile, to make the avocado mayo, place all the ingredients in a small bowl and season well. Mash with a fork until as smooth as possible and set aside.", "Toast the rolls cut-side down on the griddle pan for 1 minute and set aside. Brush the aubergine slices on both sides with half the olive oil and sprinkle with the cumin and coriander. Place on the griddle pan and cook for 4–5 minutes on each side, or until softened and lightly charred. ", "Meanwhile, heat the remaining oil in a large, non-stick frying pan and stir-fry the peppers and red onion for 8–10 minutes, or until well softened and lightly browned. Stir in the vinegar and sugar and season. Cook for a few seconds more, stirring constantly.", "Place the four bread roll bases between four plates and top each with a small handful of rocket, then a slice of tomato. Divide the pepper mixture between the rolls and top with the aubergine. Spoon the avocado mayo on top, garnish with a few coriander sprigs, if using, and cover with the roll tops. Secure with a wooden skewer if you like. Serve immediately."]}, {"isVegetarian": true, "title": "Loaded beetroot burgers with halloumi and sweet potato salad", "url": "www_bbc_co_uk_food_recipes_loaded_beetroot_burgers_73370", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/loaded_beetroot_burgers_73370_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1 red onion, finely chopped", "2 garlic cloves, crushed", "2 raw beetroots, peeled and grated", "1 courgette, grated", "2 large carrots, peeled and grated", "100g/3½oz porridge oats", "400g tin chickpeas, drained", "3 tbsp tahini ", "1 large free-range egg yolk", "4 spring onions, thinly sliced", "3 tbsp finely chopped fresh coriander", "sea salt and freshly ground black pepper", "extra virgin olive oil, for drizzling", "2 large sweet potatoes, peeled and cut into 1cm/½in-thick rounds", "200g/7oz halloumi, cut into 1cm/½in-thick slices", "3 large garlic cloves, thinly sliced", "2 red chillies, thinly sliced", "6 handfuls mixed salad leaves", "2 cooked beetroots, cut into 1cm/½in cubes", "handful fresh basil, finely chopped", "1 garlic clove, crushed", "1 lime, juice only", "3 tbsp extra virgin olive oil", "6 wholewheat sourdough buns, halved ", "230g/8oz hummus", "2 avocados, sliced", "handful ready-to-eat beansprouts", "½ red cabbage, shredded"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the beetroot burger, heat 1 tablespoon of the oil in a large frying pan over a medium heat. Fry the onion and garlic for 4–5 minutes, or until soft. Add the grated vegetables and cook, stirring often, for 5 minutes, or until soft. Drain away any excess liquid released by the vegetables.", "Place the oats, chickpeas, tahini and egg yolk in a food processor and pulse to combine. Tip the mixture into a bowl and stir in the grated vegetables, spring onions and coriander. Season generously with salt and pepper.", "Divide the mixture into six and shape into burgers. Cover and refrigerate for at least 30 minutes (or up to 24 hours). ", "Meanwhile, to make the salad, place a griddle pan over a high heat or preheat a barbecue. ", "Drizzle the extra virgin olive oil over the sweet potatoes and halloumi slices, scatter over the garlic and chillies and season with black pepper. Cook on the hot griddle or barbecue, turning once, until cooked through. ", "Meanwhile, beat together all the dressing ingredients in a bowl. Mix with the salad leaves and cooked beetroots and set aside.", "Heat 2 tablespoons oil in a frying pan over a medium heat. Cook the burgers, in batches if necessary, for 2–3 minutes on each side, or until golden and hot through.", "To serve, lightly toast the sourdough buns and top each base with hummus, avocado, beansprouts, red cabbage, a beetroot burger and the bun lid. Serve each burger with a handful of salad leaves topped with the griddled sweet potatoes and halloumi. "]}, {"isVegetarian": false, "title": "Lobscouse casserole", "url": "www_bbc_co_uk_food_recipes_lobscousecasserole_91838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 tbsp olive oil", "1.2kg/2½lb stewing beef, chopped", "2 marrow bones (ask your butcher for these)", "1 onion, peeled, chopped", "3 potatoes, peeled, chopped", "1 swede, peeled, chopped", "2 leeks, trimmed, chopped", "2 carrots, peeled, sliced", "2 bay leaves", "salt and freshly ground black pepper", "1.5 litres/2½ pints beef stock", "crusty bread, to serve (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 150C/300F/Gas 2.", "Heat the olive oil in a large casserole dish over a medium heat. Add the beef pieces and cook for 4-5 minutes, stirring occasionally, or until browned all over. ", "Add the marrow bones to the pan and continue to cook for a further 2-3 minutes.", "Remove the beef and marrow bones from the pan and set aside on a warm plate. ", "Add the chopped onions to the casserole the beef was cooked in. Fry in the pan juices for 1-2 minutes, or until softened. ", "Stir in the potatoes and swede and continue to cook for a further 2-3 minutes.", "Add the chopped leeks, carrots and bay leaves and season, to taste, with salt and freshly ground black pepper. Continue to cook for a further 1-2 minutes, or until just softened. ", "Return the beef and marrow bones to the casserole, then pour over enough beef stock to just cover the casserole contents. ", "Cover the casserole with a lid, then transfer to the oven and cook for 2½-3 hours, or until the beef is tender.", "To serve, spoon some of the lobscouse casserole into the centre of four to six serving plates and serve with crusty bread, if desired."]}, {"isVegetarian": false, "title": "Lobster and coconut curry", "url": "www_bbc_co_uk_food_recipes_lobster_and_coconut_78690", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for cooking", "2 onions, finely chopped", "8 garlic cloves, grated", "4cm/1½in piece fresh root ginger, peeled and grated", "2 tsp sea salt flakes", "1 tsp ground ginger", "1 tsp ground turmeric", "1 tsp ground cumin", "1 tsp ground cinnamon", "1 tsp chilli powder", "400ml can coconut milk", "200g/7oz chopped tomatoes", "50g/1¾oz desiccated coconut", "2 hot green chillies, thinly sliced ", "1 lemon, juice only", "2 cooked lobsters, cut into 2cm/¾in chunks", "6 tbsp roughly chopped fresh coriander", "4 tbsp roughly chopped pickled green chillies", "salt and freshly ground black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pour a little oil into a large, heavy-bottomed saucepan. Add the onions and cook over a low heat for 10–15 minutes, or until they start to colour. Add the garlic and cook, stirring, for 4–5 minutes, or until the onions are golden. Add the ginger, salt and all the dry spices, stir and cook for 2–3 minutes, or until fragrant.", "Pour in the coconut milk and chopped tomatoes and stir. Bring to the boil then reduce the heat and simmer for 10–15 minutes, or until the sauce has thickened slightly (don’t worry if it looks split). ", "Dry-fry the desiccated coconut in a frying pan until golden. Add it to the curry with the fresh chillies and cook for 3–4 minutes, or until thickened. ", "Season with lemon juice, salt and pepper. Add the lobster and warm through. Stir in the coriander and pickled chillies. Serve in warmed bowls."]}, {"isVegetarian": false, "title": "Lobster and fillet steak with straw fries and green salad", "url": "www_bbc_co_uk_food_recipes_lobster_and_fillet_steak_43951", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lobster, cooked and cooled", "2 tbsp olive oil", "2 x 175g/6oz fillet steaks", "100g/3½oz unsalted butter", "25g/1oz dulse or fresh watercress", "1 lemon, zest only", "vegetable oil, for frying", "2 large chipping potatoes, peeled and cut into straw fries", "2 Little Gem lettuces, leaves separated", "3 tbsp flavourless oil", "1 tbsp tarragon vinegar", "1 tsp Dijon mustard", "1 tsp freshly chopped tarragon", "pinch pink peppercorns, crushed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lobster and fillet steak, preheat the grill high. Cut the lobster in half and remove the tail and claw meat, chop it up and place back into the tail shells.", "Heat a griddle pan until hot and lightly oil the steak. Cook on each side for 3 minutes, or until cooked to your liking. Set aside to rest in a warm place.", "In the meantime place the butter and dulse (or watercress) in a bowl and mix. Place the lobster tails on a grill tray, dot some of the butter on top and place under the grill for 1-2 minutes or until the butter is melted and the lobster meat is hot.", "For the straw fries and salad, heat a deep-fat fryer to 180C, or half fill a large deep pan with vegetable oil and heat until a piece of bread turns golden-brown when dropped in the oil. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Lower the chips into the fryer and cook for 5 minutes, or until golden-brown and crisp. Drain on kitchen paper.", "Place the Little Gem lettuce in a large bowl. Mix the remaining salad ingredients together then pour over the lettuce.", "To serve, place the lobster tails on serving plates with the steak alongside. Place the chips in bowls along with the salad. Put a knob of butter on each steak just before serving."]}, {"isVegetarian": false, "title": "Lobster and mango salad with a beurre noisette", "url": "www_bbc_co_uk_food_recipes_lobster_and_mango_salad_99292", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ orange, zest removed and cut into very fine strips, flesh segmented", "250g/9oz mixed salad leaves (such as rocket, frissée, watercress, nasturtium or dandelion)", "2 tbsp sugar", "1 tbsp Moscatel vinegar", "2 tbsp rapeseed oil", "1x 550g/1lb 4oz precooked lobster ", "100g/3½oz butter", "salt", "1 lemon, juice only", "1 mango, peeled, stoned and sliced", "mustard cress, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the orange zest salad, blanch the strips of zest in boiling water three times to remove the bitterness. Drain the zest thoroughly and set aside on kitchen paper.", "Mix the salad leaves with the orange segments. Set aside.", "For the lobster and mango, blanch the lobster in boiling salted water, two minutes for the tails and three minutes for the claws.", "Remove the lobster meat from the shells, cut the tail in half and remove the claws.", "In a pan, warm the butter until foaming, drop in the lobster and heat through, basting all the time. Season, to taste, with salt and lemon juice.", "Remove the lobster from the pan and add the mango slices to the butter. Cook until the mango is soft and warm. Reserve the butter.", "For the orange zest salad, place the zest in a small frying pan with the sugar. Heat until the sugar is caramelised and coats the zest. Set aside to cool slightly, them mix with the vinegar and oil. Pour over the salad leaves and toss to coat.", "Place the dressed salad in the centre of serving plates with the lobster around the side and mango on top. Drizzle the butter over and garnish with mustard cress."]}, {"isVegetarian": false, "title": "Lobster and roquefort gratin", "url": "www_bbc_co_uk_food_recipes_lobster_and_roquefort_60668", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 800g/1lb 12oz cooked lobsters (or 3 smaller ones)", "250ml/9fl oz cream", "2 tbsp brandy", "125ml/4fl oz sweet white wine", "100g/3½oz roquefort cheese, crumbled", "sea salt and freshly ground black pepper", "220g/8oz unsalted butter", "1 tbsp white wine vinegar", "1 tbsp cracked white pepper", "4 free-range egg yolks", "30g/1oz unsalted butter", "1 bunch watercress", "50g/1¾oz baby spinach"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the lobster gratin, crack the lobsters open and carefully pick out all the meat. Slice into bite-sized morsels and set aside. Break up the shells with a rolling pin or mallet, place in the saucepan with half of the cream, add the brandy and wine and season will with salt and pepper. Simmer covered for 20 minutes, then strain though a fine sieve. Discard the shells, and whisk the cheese into the sauce.", "For the sabayon, put the butter into a small saucepan and bring slowly to a simmer. Skim the froth off the surface, then remove form the heat and leave to settle. Carefully pour the liquid butter into a bowl, taking care not to include any of the milky sediment. ", "Combine 4 tablespoons water with the vinegar and pepper in a small, thick-based saucepan. Boil over medium heat until reduced in volume by a third, leave to cool. Add the egg yolks and set over low heat, whisking continuously and ensuring that the whisk comes into contact with the entire bottom surface of the pan. The mixture should emulsify and become creamy in 8–10 minutes. Remove from the heat and slowly pour in the clarified butter, whisking vigorously. Check the seasoning, then strain though a fine sieve.", "For the watercress and spinach, heat a medium sauté pan and add the butter. Once melted add the watercress and spinach and cook until wilted down.", "To finish the lobster, heat a grill to high. Whip the remaining cream to soft peaks. Fold in the lobster sauce and sabayon. Do not over-mix or you will lose its lightness. Warm the lobster meat in a steamer or warm oven. Place in an ovenproof dish, cover with the sauce and immediately place under the grill. The sabayon and cheese will make the sauce glaze to a golden caramel colour. ", "Serve with the watercress and spinach alongside. "]}, {"isVegetarian": false, "title": "Lobster and scallops with ginger chutney and sauté green vegetables", "url": "www_bbc_co_uk_food_recipes_lobster_and_scallops_45414", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cooked lobsters, meat picked out, shells reserved", "4 scallops, shelled, cleaned and roe removed", "1 tbsp rapeseed oil", "2½ tbsp rapeseed oil", "1 tsp cumin seeds", "2 tsp sesame seeds", "200g/7oz root ginger, thinly sliced", "1 green chilli, slit open", "1 stick lemongrass, outside removed and finely chopped", "4 lime leaves, roughly chopped", "100g/3½oz palm sugar", "100g/3½oz tamarind paste", "pinch asafoetida", "1 dried red chilli, crushed", "½ tsp mustard seeds", "5-6 curry leaves", "1 bunch kai lan (Chinese broccoli), or alternatively Tenderstem broccoli", "1 tbsp rapeseed oil", "1 bunch spring onions, cut on the angle"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the ginger chutney, heat a large frying pan and add two teaspoons of the oil. Once hot add the cumin and sesame seeds. Once they start to pop add the ginger, chilli, lemongrass, lime leaves and cook for a couple of minutes.", "Add the palm sugar, tamarind, asafoetida and a little water and cook for 30-40 minutes.", "In a separate frying pan, add the rest of the oil and fry the dried chilli, mustard seeds and curry leaves for a couple of minutes. Set aside until ready to serve.", "For the scallops and lobster, heat a frying pan and add a little oil. Once hot, add the scallops and cook for approximately one minute on each side. At the last minute add the lobster meat.", "For the vegetables, place a saucepan of boiling water on the heat and add the kai lan and cook briefly. Then plunge it into ice-cold water and drain.", "Heat a large frying pan and add the oil, once hot add the spring onions and kai lan and fry gently without colouring for a couple of minutes.", "When ready to serve, preheat the grill to high. Put the cooked vegetables into the base of the lobster shells and add the scallop and lobster meat. Place the chutney on top and place under the grill for a couple of minutes and finish with the fried chilli, seeds and curry leaves."]}, {"isVegetarian": false, "title": "Lobster and sea bass with carrot julienne", "url": "www_bbc_co_uk_food_recipes_lobster_and_sea_bass_94004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lobsters, cooked", "50g/2oz butter", "1 onion, roughly chopped", "50g/2oz fresh root ginger, finely chopped", "4 sprigs thyme", "1 tbsp tomato purée", "75ml/3floz white wine", "300ml/11fl oz chicken stock ", "75ml/3fl oz double cream", "salt and freshly ground black pepper", "4 x 250g/9oz pieces sea bass fillet, pin-boned", "salt", "75g/3oz butter", "1 tbsp olive oil", "3 carrots, peeled and cut into julienne strips", "2 leeks, trimmed, washed and cut into julienne strips", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lobster sauce, cut the lobsters in half lengthways and pull out the meat. Crack the claws and remove the claw meat in one piece.", "Set aside the lobster meat and roughly chop the shells.", "Heat a large sauté pan until hot, add half the butter, the onion, ginger and thyme and cook for 2-3 minutes, or until just softened but not coloured.", "Add the lobster shells and tomato purée and cook for one minute.", "Add the white wine and chicken stock, bring to the boil, then reduce the heat and simmer for 10 minutes.", "Place in a food blender in batches and blend to a purée.", "Press through a fine sieve into a saucepan, whisk in the cream and check the seasoning, adding salt and pepper if necessary.", "When ready to serve, blend the sauce with a stick blender to create a light foam.", "Cut the lobster tail into large dice.", "Heat a frying pan until medium hot, add the remaining butter and lobster meat and claws and cook on each side for 1-2 minutes, or until just coloured and hot through.", "Season with salt and black pepper.", "For the sea bass, season the sea bass with a little salt. Heat a frying pan until medium hot, add a knob of butter and the olive oil and heat until just foaming.", "Add the sea bass, skin side down and pan fry for two minutes until the skin is crisp and the fish nearly cooked through.", "Flip over and cook on the flesh side for one minute, basting with the butter. Remove from the heat and leave to rest for one minute.", "Heat a separate frying pan until medium hot, add the remaining butter and the carrot and leek and stir fry for a couple of minutes, or until the vegetables are tender and just wilted down. Season with salt and freshly ground black pepper.", "To serve, pile the julienne into the centre of the plate then top with the sea bass. Place pieces of the lobster around the plate then spoon the foamy sauce over and around.", "Finish with the lobster claw on top of the sea bass. "]}, {"isVegetarian": false, "title": "Lobster masala with spiced lentils", "url": "www_bbc_co_uk_food_recipes_lobster_masala_with_74873", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 onion, finely chopped", "1 green chilli, thinly sliced", "1 tsp ground cumin ", "½ tsp ground turmeric ", "1 tsp garam masala ", "1 tsp ground coriander ", "350g/12oz red lentils, rinsed", "1 tbsp finely chopped fresh dill", "1 tbsp finely chopped fresh coriander ", "1 tbsp vegetable oil", "1 cinnamon stick", "3 cardamom pods, crushed", "3 cloves", "1 tsp fennel seeds", "1 green chilli, finely chopped", "2 shallots, finely chopped", "2 garlic cloves, crushed", "2.5cm/1in piece fresh root ginger, finely grated", "1 tsp ground cumin", "1 tsp ground coriander ", "1 tsp ground turmeric ", "1 tsp curry powder", "3 large ripe beef tomatoes, roughly chopped", "1 cooked lobster, split in half, flesh removed and cut into chunks, shells reserved", "2 spring onions, thinly sliced", "handful fresh coriander cress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the spiced lentils, melt the butter in a large saucepan over a medium heat. Add the onion and spices and sweat gently for 5–10 minutes, until soft. ", "Stir in the lentils and just cover with water. Bring to the boil and simmer for 30 minutes, or until all the water has evaporated and the lentils are soft. Stir in the dill and coriander. ", "Meanwhile. to make the masala sauce, heat the oil in a sauté pan over a medium heat. Add the cinnamon, cardamom, cloves, fennel, chilli, shallots, garlic and ginger and cook for 2–3 minutes.", "Add the cumin, coriander, turmeric, curry powder, tomatoes and 300ml/10fl oz of water and cook for 10–15 minutes. Blend in a food processor until smooth.", "Return the sauce to the pan and add the lobster. Simmer gently for 5 minutes, until heated through. ", "To serve, spoon the lobster masala back into the lobster shells and garnish with coriander cress and sliced spring onions. Serve with the spiced lentils. "]}, {"isVegetarian": false, "title": "Lobster mac 'n' cheese", "url": "www_bbc_co_uk_food_recipes_lobster_mac_n_cheese_90457", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lobster_mac_n_cheese_90457_16x9.jpg", "ingredients": ["300g/10½oz macaroni", "salt, to taste", "4 cooked lobster tails, shell on", "100ml/3½fl oz white wine", "750ml/1¼ pint milk", "1 bay leaf ", "slice onion", "1 tbsp vegetable oil", "50g/1¾oz butter", "1 onion, finely diced", "50g/1¾oz bacon lardons ", "2 garlic cloves, sliced", "1 sprig thyme, leaves only", "60g/2¼oz plain flour", "1 tsp mustard powder", "¼ tsp cayenne pepper", "75g/2½oz cheddar, grated", "75g/2½oz gruyère, grated", "50g/1¾oz fresh breadcrumbs", "2 cooked lobster tails", "knob of butter", "2 tbsp brandy"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Bring a large saucepan of water to the boil and salt it generously. Add the macaroni and cook for 8-10 minutes, or until just shy of al dente. Drain well. ", "Separate the lobster flesh from the tails, chop into bite-sized chunks and set aside. Put the shells in a saucepan and heat on a high heat. Pour in the white wine and allow to bubble fiercely. Remove from the heat and strain, discarding the shells and reserving the wine.", "Put the milk, bay leaf and onion slice into a saucepan. Heat slowly, until the milk is just below boiling point, then remove from the heat. Set aside. Leave the milk to infuse with the bay leaf and onion.", "Heat the oil and butter in a large saucepan. Add the diced onion and bacon and fry until the onion is lightly caramelised and the bacon is crisp and brown. ", "Add the garlic and thyme, then stir in the flour, mustard powder and cayenne. Stir until you have a roux (it will be lumpy because of the onion and bacon), then gradually add the milk, stirring between each addition, until it is all incorporated and you have a béchamel sauce. Add 50g/1¾oz each of the two types of cheeses and the reserved wine and stir on a low heat until the cheese has melted.", "Mix the sauce with the macaroni and stir in the lobster meat. Pour into a large, shallow ovenproof dish. ", "Mix the breadcrumbs with the remaining cheese. Sprinkle this over the macaroni. Bake in the oven for 30-35 minutes, or until it is piping hot, browned and bubbling.", "To garnish, heat a frying pan over a high heat. When hot add the butter and the lobster tails. Cook for 1 minute on each side until warmed through. Add the brandy and light with a match to flambé. (CAUTION: Keep well back from the flames and allow to die down before serving.) Remove the lobster tails from the pan and cut lengthwise. Place on top of the macaroni cheese and serve."]}, {"isVegetarian": false, "title": "Lobster on Morecambe Bay shrimp hash", "url": "www_bbc_co_uk_food_recipes_lobster_on_morecambe_bay_74761", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz butter", "2 shallots, finely chopped", "150ml/¼ pint vermouth", "150ml/¼ pint fish stock", "150ml/¼ pint double cream", "250g/9oz Morecambe Bay shrimp", "2 tomatoes, diced", "2 tbsp chopped fresh parsley", "4 cooked lobsters", "450g/1lb freshly cooked new potatoes", "25g/1oz butter", "salt and freshly ground black pepper", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "4 tbsp rapeseed oil", "1 tomato, diced", "¼ cucumber, diced", "2 Little Gem lettuce, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Melt 25g/1oz of butter in a saucepan. Add the shallots and cook until soft but not coloured. ", "Add the vermouth, bring to the boil then simmer until the volume of the liquid has reduced by two thirds. Add the fish stock and again reduce the volume of liquid by two thirds.", "Add the double cream and cook until reduced to a thick sauce consistency. Chop 50g/1¾oz of the shrimps and add to the sauce with 50g/1¾oz butter, stirring well. Add the tomato, parsley and 100g/3½oz whole shrimps, remove from the heat, set aside and keep warm.", "For the hash, crush the potatoes and mix in 25g/1oz butter. Stir in the remaining shrimp. Season with salt and pepper. Heat a large frying pan and cook the hash over a medium heat until golden-brown and crispy. ", "Remove the lobster meat from the shells but keep in shape. Put the lobster meat onto a baking tray with the remaining 100g/3½oz  butter, cover with foil and gently reheat in the oven for 2-3 minutes, or until warmed through.", "For the salad, mix the mustard, vinegar and oil in a small bowl to make a dressing. Mix the tomato, cucumber and lettuce in bowl. Before serving pour the dressing over the salad.", "To serve, place the potato hash on the plate, top with the lobster and spoon over the sauce. Serve the salad alongside."]}, {"isVegetarian": false, "title": "Lobster Thai red curry with pad Thai", "url": "www_bbc_co_uk_food_recipes_lobster_red_thai_curry_84326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 dried, hot red chillies, soaked in 75ml/3fl oz warm water", "2 large shallots, chopped", "2 garlic cloves, chopped ", "2 cm/1 in piece fresh root ginger, chopped", "1 stem lemongrass, finely chopped", "4 pieces coriander root, roughly chopped", "2 kaffir lime leaves, roughly chopped", "¼ tsp shrimp paste", "½ tsp ground cumin", "½ tsp ground coriander", "200ml/7fl oz coconut milk", "1 tbsp fish sauce", "1 tbsp tamarind paste", "1 lime, juice only", "1 tsp palm sugar", "4 cooked lobster, split in half lengthways", "2 tbsp coriander leaves, roughly chopped ", "1 tbsp vegetable oil", "1 large banana shallot, finely sliced", "1 red chilli, sliced", "2 garlic cloves, finely chopped", "1 tbsp grated fresh root ginger", "150g/5oz cooked peeled prawns", "400g/14oz cooked rice noodles", "125g/4½oz beansprouts", "2 tbsp tamarind paste", "2 tbsp fish sauce", "1 tbsp soy sauce", "1 lime, juice only", "3 tbsp roughly chopped fresh coriander", "2 tbsp roasted salted peanuts, crushed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Thai red curry paste, place all the ingredients, including the soaking water, into a pestle and mortar, or food processor, and blend to a fine paste.", "For the lobster curry, heat a wok or frying pan until hot, add three tablespoons of the curry paste and cook until just starting to change colour then add the coconut milk.", "Bring to a simmer and cook for five minutes then add the fish sauce, tamarind, lime and sugar. Check the seasoning and add salt and freshly ground black pepper as necessary. ", "Carefully remove the meat from the cooked lobsters, reserving the shells, and place the meat into the curry sauce and cook over a low heat until hot through.", "Add the coriander and stir through, then spoon the lobster meat back into the shells.", "For the pad Thai, heat a wok until hot, add the oil, shallot, chilli, garlic and ginger and stir fry for a minute.", "Add the prawns and cook for another minute.", "Add the noodles and bean sprouts and stir fry to heat through. Then add the tamarind paste, fish sauce, soy sauce and lime juice and stir to coat everything evenly.", "Cook for 1-2 minutes, until hot, then add the chopped coriander. ", "To serve, pile pad Thai onto each serving plate and sprinkle with crushed peanuts.", "Place the lobster alongside the pad Thai and spoon over the curry sauce to finish."]}, {"isVegetarian": false, "title": "Lobster rolls with avocado butter and fresh mango chutney", "url": "www_bbc_co_uk_food_recipes_lobster_roll_with_13362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cooked lobster, shell removed, tail cut into chunks and claws left whole", "50g/1¾oz plain flour", "50g/1¾oz ground polenta", "pinch hot smoked paprika ", "knob of butter", "salt and freshly ground black pepper", "1 avocado, peeled, stone removed, roughly chopped", "1 green chilli, finely chopped", "pinch ground cumin", "1 lime, juice only", "2 tbsp olive oil", "1 ripe mango, roughly chopped", "1 tsp chopped fresh tarragon leaves", "2 spring onions, finely chopped", "1 tsp finely chopped fresh root ginger", "1 garlic clove, crushed", "splash mirin", "splash light soy sauce", "splash sesame oil", "2 brioche rolls, halved", "Sriracha chilli sauce"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the avocado butter, put all the ingredients in a food processor and blend to a smooth purée.  ", "To make the mango chutney, put all the ingredients into a large bowl and mix well.", "Preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Mix the flour, polenta and paprika together in a shallow bowl. Dust the tail meat in the mixture and shake off any excess. Deep-fry for 2–3 minutes, until golden.", "Meanwhile, heat the butter in a frying pan and sauté the claws for 2–3 minutes, or until golden.", "To serve, toast the brioche rolls and spread with the avocado butter. Stuff the rolls with the crispy tail and claw meat and the mango chutney. Finish with a squeeze of Sriracha."]}, {"isVegetarian": false, "title": "Lobster ravioli with sautéed courgettes and leeks", "url": "www_bbc_co_uk_food_recipes_lobster_ravioli_with_90812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter", "1 onion, roughly chopped", "2 large carrots, roughly chopped", "4 sprigs fresh thyme", "50ml/2fl oz brandy", "750ml/1pint 6fl oz chicken stock", "110ml/4fl oz double cream", "300g/11oz '00' pasta flour, plus extra for dusting", "4 free-range eggs", "125g/4½oz salmon fillet, skinned", "50ml/2fl oz double cream", "¼ lemon, juice only", "salt and freshly ground black pepper", "1 x 750g/1lb 11oz cooked lobster, meat removed and sliced, shell reserved", "1 tbsp olive oil", "2 tbsp roughly chopped fresh chervil", "50g/2oz butter", "2 leeks, sliced into 7.5cmx1cm/3inx1in ribbons", "2 courgettes, sliced into 7.5cmx1cm/3inx1in ribbons", "12 fine asparagus", "1 punnet micro cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat a frying pan, add the butter and reserved lobster shell and fry for 5-6 minutes. Add the vegetables and fry for 3-4 minutes.", "Add the brandy, allow to heat briefly, then slowly tilt the pan towards the flame, or light with a match. Let the flames flare up then die down. Cook for 2-3 minutes longer, then add the stock. Bring the mixture to the boil and cook for a further 20 minutes. ", "Strain the sauce into a clean saucepan, add the cream and cook for a further minute. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the lobster ravioli, place the flour and three of the eggs into a food processor and pulse until it forms small crumbs.  Tip the mixture out onto a lightly floured work surface and bring together to form a dough. Knead lightly for 2-3 minutes, or until the dough is smooth and elastic. ", "Wrap the dough in cling film and chill in the fridge for 20 minutes.", "Meanwhile, blend the salmon fillet and cream in a small food processor to a purée. Season with the lemon juice, salt and freshly ground black pepper.", "Place the pasta dough onto a clean, flat work surface dusted with flour. Roll the dough out to a rough rectangle, then sprinkle with flour.", "Divide the pasta into two pieces, then pass each piece through a pasta machine several times, gradually reducing the thickness until you reach the thinnest setting and the pasta feels elastic. (Cover any pasta dough that you are not using with cling film so that is doesn’t dry out.)", "Lay a sheet of pasta onto the work surface and place spoonfuls of the salmon mixture at intervals along the sheet, leaving a gap of 6cm/2½in between each pile. Spoon out eight piles of salmon and top each pile with the sliced lobster meat.", "Beat the remaining egg in a bowl. Lightly brush the beaten egg around the piles of lobster. Top with a second sheet of pasta and press down lightly around the edges of the lobster. Using a pastry cutter, stamp out eight ravioli in 6cm/2½in rounds.", "Bring a large pan of salted water to the boil and cook the ravioli for 1-2 minutes, or until they float to the top of the pan. Drain, then mix with the chervil, olive oil and season with salt, and freshly ground black pepper.", "For the sautéed courgettes and leeks, heat a frying pan until hot, add the butter and the vegetables and fry for 2-3 minutes, or until just softened. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, blanch the asparagus in a saucepan of boiling salted water for 2-3 minutes, or until tender. ", "To serve, spoon the sautéed courgettes and leeks into the centre of serving plates. Top with the lobster ravioli and asparagus spears. Drizzle over the sauce and finish with a scattering of cress."]}]