[{"ingredients": ["4 huevos grandes y muy frescos", "½ oz (10 g) de morillas secas o porcini", "3 chalotes, pelados y finamente picados", "Setas planas grises oscuras de 4 oz (110 g), cortadas aproximadamente", "¼ de nuez moscada entera, rallada", "1 oz (25 g) de mantequilla", "sal y pimienta negra recién molida", "3 cucharadas redondas de crema fresca, crema semidescremada, yogur griego de oro fresco"], "method": ["Comience empapando las colmenillas o porcini unos 30 minutos antes de tiempo. Colóquelos en un recipiente con 5 fl oz (150 ml) de agua hirviendo y déjelos a un lado para remojarlos. Después de eso, colarlos en un colador y exprimirlos para eliminar el exceso de agua. (Puede reservar el agua de remojo, que puede congelarse y es ideal para sopas y salsas). Aparte 4 pedazos de morillas o porcini y coloque el resto en un procesador de alimentos, junto con los chalotes, los champiñones planos, la nuez moscada y la sal. y pimienta negra recién molida. Procese hasta que esté finamente picado.", "Calentar la mantequilla en una olla pequeña. Cuando empiece a formar espuma, agregue la mezcla de champiñones picados y, manteniendo el fuego bajo, deje que se cocine muy suavemente, sin tapa, durante 25-30 minutos; la idea es que cualquier exceso de líquido se evapore y deje una mezcla encantadora, oscura y concentrada.", "Todo esto se puede preparar con anticipación, pero cuando esté listo para cocinar los huevos, comience precalentando el horno a la marca de gas 4, 350 ° F (180 ° C) y hierva un hervidor de agua. Suavemente vuelva a calentar la mezcla y, revolviendo en 1 cucharada redondeada de crème fraîche o yogur, divídalo entre los moldes, haciendo una pequeña hendidura donde se colocará el huevo. Ahora rompa un huevo en cada uno y sazone. Mezcle el resto de la crème fraîche o yogur para aflojarlo, divídalo entre los platos con la parte posterior de la cuchara o con una espátula pequeña.", "Calentar la mantequilla en una olla pequeña. Cuando empiece a formar espuma, agregue la mezcla de champiñones picados y, manteniendo el fuego bajo, deje que se cocine muy suavemente, sin tapa, durante 25-30 minutos; la idea es que cualquier exceso de líquido se evapore y deje una mezcla encantadora, oscura y concentrada.", "Todo esto se puede preparar con anticipación, pero cuando esté listo para cocinar los huevos, comience precalentando el horno a la marca de gas 4, 350 ° F (180 ° C) y hierva un hervidor de agua. Suavemente vuelva a calentar la mezcla y, revolviendo en 1 cucharada redondeada de crème fraîche o yogur, divídalo entre los moldes, haciendo una pequeña hendidura donde se colocará el huevo. Ahora rompa un huevo en cada uno y sazone. Mezcle el resto de la crème fraîche o yogur para aflojarlo, divídalo entre los platos con la parte posterior de la cuchara o con una espátula pequeña.", "Coloque una porción de las morillas reservadas o porcini en la parte superior de cada molde, luego coloque los moldes en la bandeja para hornear, coloque la lata en el estante central del horno y agregue suficiente agua hirviendo para que llegue hasta la mitad de los lados del platos. Ahora deja que los huevos se horneen durante 15 minutos si te gustan suaves y con poco líquido, o 18 minutos si te gustan más. De cualquier manera, tenga en cuenta que continúan cocinando en los platos cuando salen del horno y alcanzan la mesa. Estos son encantadores servidos con rebanadas de pan integral y mantequilla."], "url": "www_bbc_co_uk_food_recipes_eggsencocottewithmor_67958", "title": "Huevos en cocotte con hongos morel o porcini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, cortada en cubos", "2 yemas de huevo de gallinas camperas", "½ cucharada de agua fría", "½ cucharada de jugo de limón", "sal y pimienta blanca recién molida", "2 magdalenas inglesas, divididas por la mitad horizontalmente, untadas con mantequilla", "2 grandes puñados de espinaca baby, al vapor", "4 huevos de gallina, escalfados"], "method": ["Precalentar la parrilla a mediano.", "Para la salsa holandesa, coloque 75 g / 2½ oz de la mantequilla en una cacerola pequeña y derrita lentamente con un poco de calor. Una vez derretido, retirar del fuego y reservar.", "Coloque las yemas de huevo en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento (tenga cuidado de que el recipiente no toque el agua) y bata hasta que quede pálido y espeso. Agregue el agua, el jugo de limón, la sal y la pimienta negra recién molida a las yemas de huevo y bata durante otros 30 segundos.", "Agregue la mitad de la mantequilla restante a la mezcla de huevo en el tazón y revuelva durante 1-2 minutos o hasta que la mezcla se espese. Retirar del fuego y batir con el resto de la mantequilla.", "Vierta lentamente la mantequilla derretida, batiendo constantemente, hasta que la salsa alcance la consistencia de la crema doble. Sazone al gusto con jugo de limón, sal y pimienta negra recién molida. Mantenga la salsa caliente apoyando el recipiente en una fuente de agua tibia.", "Coloque los muffins con mantequilla en una bandeja para hornear.", "Coloque las espinacas al vapor encima de las magdalenas, cubra con los huevos escalfados y vierta la salsa holandesa en la parte superior.", "Coloque la bandeja debajo de la parrilla precalentada durante 1-2 minutos, o hasta que la parte superior burbujee y se ponga dorada.", "Transfiera los huevos florentinos a dos platos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eggsflorentine_88979", "title": "huevos florentina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggsflorentine_88979_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de brioche", "2 huevos, golpeados", "botón de mantequilla", "2 rebanadas de salmón ahumado", "pimienta negra recién molida", "llovizna de aceite de oliva virgen extra"], "method": ["Sumerja la rebanada de brioche en los huevos batidos.", "Suavemente derrita la mantequilla en una sartén antiadherente y fríe la rebanada de brioche durante 2-3 minutos en cada lado, hasta que se dore.", "Transfiera a un plato de servir y coloque el salmón ahumado encima.", "Espolvorear con pimienta negra recién molida y rociar con aceite para servir."], "url": "www_bbc_co_uk_food_recipes_eggybread_76849", "title": "Pan de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "3 cucharadas de leche condensada", "puñado de arándanos", "2 rebanadas de brioche", "botón de mantequilla"], "method": ["Coloque los huevos en un recipiente con la leche condensada y mezcle.", "Coloque una rebanada de brioche en un plato y coloque los arándanos en la parte superior, coloque la segunda rebanada de brioche en la parte superior para hacer un sándwich. Empuja hacia abajo el sándwich para aplastar ligeramente los arándanos.", "Recoge con cuidado el sándwich de brioche y colócalo en la mezcla de huevo, volviéndolo completamente.", "Mientras tanto, caliente una sartén con mantequilla a fuego medio y alto, y cuando burbujee, coloque el sándwich de brioche en la sartén. Freír durante dos minutos por cada lado o hasta que estén dorados.", "Retire el brioche de la sartén y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_eggybread_84018", "title": "Pan de huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 4 oz de semillas de sésamo", "100g / 4oz de almendras blanqueadas", "50 g / 2 oz de semillas de cilantro", "10g / ½ oz de semillas de comino", "1 cucharadita de sal marina", "½ cucharadita de pimienta", "Pan turco", "aceite de oliva"], "method": ["Tueste todas las semillas y almendras juntas en una sartén seca y caliente. Sigue revolviendo hasta que esté fragante.", "Enfriar, luego triturar groseramente con sal y pimienta.", "Para servir, sumerge el pan turco en el aceite de oliva y luego en la dukkah."], "url": "www_bbc_co_uk_food_recipes_egyptiandukkah_13892", "title": "Dukkah egipcio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan fuerte", "7g sachet acción rápida levadura seca", "10g / ¼ oz de sal fina", "1½ cucharadas de aceite de oliva", "harina extra para quitar el polvo", "aceite de girasol para el tazón de engrase", "1 huevo de gallinas camperas, batido ligeramente con una pizca de sal", "pizca de sal"], "method": ["Coloque la harina en un tazón grande. Agregue la levadura en un lado del tazón y agregue la sal en el otro lado. La sal no debe colocarse encima de la levadura, ya que puede matarla y hacerla inactiva. Mezcle los ingredientes hasta que estén bien mezclados.", "Agregue un buen chorrito de aceite de oliva. Mida 340ml / 12fl oz de agua y agregue tres cuartos a la mezcla de harina, mezcle a mano y luego agregue el resto del líquido.", "Convierta la masa en una superficie de trabajo y amasar a mano hasta que la masa se vea sedosa y elástica. Esto tomará aproximadamente 10 minutos.", "Engrase un tazón de fuente de tamaño mediano y coloque la masa en el tazón. Cúbralo con una película adhesiva y déjelo a un lado para que se levante, durante aproximadamente una hora, o hasta que la masa duplique su tamaño.", "Cuando se haya levantado, voltee la masa sobre una superficie de trabajo ligeramente enharinada y amasar, para golpear la masa hacia atrás. Forma la masa en una bola.", "Divida la masa en ocho piezas iguales y luego despliegue cada pieza en un hilo de aproximadamente 40 cm de largo.", "Coloque los hilos sobre la superficie ligeramente enharinada como un pulpo, desplegado en un punto central en la parte superior. Pega todos los extremos en el punto central a la mesa con tu pulgar.", "Para la siguiente secuencia de trenzado, numere los hilos de masa de 1-8 de izquierda a derecha. Cada vez que mueve un hilo, tomará el nuevo número de su posición en la fila.\r\nPaso 1: coloca 8 debajo de 7 y más de 1\r\nPaso 2: coloca 8 sobre 5\r\nPaso 3: coloca 2 debajo de 3 y más de 8\r\nPaso 4: coloca 1 sobre 4\r\nPaso 5: coloca 7 debajo de 6 y más de 1\r\nRepite los pasos 2-5, hasta que toda la masa esté trenzada.", "Meta ambos extremos del pan por debajo para darle un acabado ordenado.", "Coloque la masa trenzada en una bandeja de horno enharinada, y deje probar durante otra hora, hasta que se eleve nuevamente.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cepille el pan con la colada de huevo batido y hornee en el horno durante 20-25 minutos."], "url": "www_bbc_co_uk_food_recipes_eight-strand_plaited_57815", "title": "Pan trenzado de ocho hilos", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eight-strand_plaited_57815_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["18 huevos grandes de gallinas camperas, solo blancos", "1kg / 2lb 4 oz de azúcar en polvo", "250g / 9oz de chocolate blanco", "400g / 14oz de chocolate con leche, picado", "200g / 7oz de chocolate blanco, picado", "600 g / 1 libra de fresas de 5 oz, cascadas", "600 g / 1 libra 5 oz zarzamoras", "Frambuesas de 500 g / 1 lb 2 oz (congelado está bien)", "6 cucharadas de azúcar glas", "1.2 litros / 2 pintas de crema doble", "Licor de flor de saúco 400ml / 14fl oz", "100g / 3½oz de azúcar glasé", "200 g de azúcar en polvo blanco"], "method": ["Para los merengues, dibuje un círculo de 22cm / 8½ pulgadas en dos pedazos de pergamino, luego dos círculos de 20cm / 8in en dos pedazos más de pergamino, y finalmente un círculo de 18cm / 7 pulgadas. Ahora dibuje una flor de ocho pétalos dentro del círculo, asegurándose de que los pétalos permanezcan dentro del círculo.", "Precalentar el horno a 140C / 275F / Gas 1.", "Coloque nueve de las claras de huevo en un tazón grande. Pese la mitad del azúcar en un tazón más pequeño. Usando una batidora eléctrica de mano a velocidad media, mezcle las claras de huevo con los picos suaves, luego agregue lentamente el azúcar y continúe batiendo hasta que se formen picos rígidos cuando se quiten los batidores y el merengue esté brillante.", "Coloque el merengue en una bolsa de plástico desechable equipada con una boquilla de estrella grande. Coloque dos plantillas de 22cm / 8½ pulgadas y una plantilla de 20cm / 8 pulgadas en las bandejas para hornear y coloque merengue en los pétalos, llenando los pétalos por completo.", "Con una cucharilla, haga pequeñas hendiduras en los pétalos. Estos sostendrán las bayas más adelante. Recuerde que estas capas se apilarán y, por lo tanto, deberían ser bastante superficiales.", "Coloque en el horno precalentado e inmediatamente baje a 100C / 225F / Gas ¼ y hornee por 1½ horas. Cuando terminen, apague el horno y deje que se enfríe durante 30 minutos con la puerta del horno abierta. Repita el proceso con las dos capas de merengue restantes. La capa de merengue más pequeña será la superior, así que póngala con cuidado, aunque hágala tan elaborada como desee.", "Mientras tanto, para las bayas de zarza, atemperar el chocolate con leche. Derrita la mitad del chocolate con leche en un recipiente colocado sobre una olla de agua hirviendo a fuego lento (asegúrese de que el fondo del recipiente no toque el agua). Caliente hasta que el chocolate alcance los 43 ° C / 109 ° F (mida la temperatura con un termómetro eléctrico para alimentos).", "Retire del fuego y agregue la mitad restante del chocolate con leche. Enfriar a 28 ° C / 82 ° F y luego calentar ligeramente a 30 ° C / 86 ° F. El chocolate ahora está templado. Repita el proceso con el chocolate blanco.", "Alinee una bandeja para hornear con un pergamino para hornear. Usando palitos de cóctel, sumerja las fresas en el chocolate con leche templado y colóquelas en la bandeja para hornear. Permitir establecer Vierta el chocolate blanco derretido en una manga pastelera equipada con una boquilla para escribir y zigzagueando el chocolate blanco sobre las fresas bañadas en chocolate. Dejar de lado.", "Para el coulis de frambuesa, mezcle las frambuesas y el azúcar glas en un procesador de alimentos, luego presione el puré a través de un colador fino en un tazón pequeño. Dejar de lado.", "Para la crema de flor de saúco, bata la crema en un tazón grande para mezclar a los picos suaves. Agregue el licor de flor de saúco y el azúcar glas con una espátula. Refrigere hasta que sea necesario.", "Una vez que las capas de merengue estén completamente frías, derrita el chocolate blanco y pinte esto sobre la parte superior de los merengues con un pincel de pastelería. Esto ayudará a evitar la absorción del exceso de líquido de la crema.", "Para armar el pavlova, coloque uno de los merengues más grandes en un soporte para pasteles. Agregue un cuarto de la crema en el centro. Coloque algunas de las moras en la parte superior, y coloque algunas bayas en los huecos en los pétalos de flores de merengue - alternar una fresa recubierta de chocolate en un pétalo, con tres moras en otro. Agregue la siguiente capa de merengue y repita.", "Agregue la capa superior de merengue y coloque una pequeña gota de crema en el centro, y cubra con una fresa de chocolate.", "Para hacer el azúcar hilado, disuelva el azúcar en dos cucharadas de agua en una cacerola mediana a fuego medio, revolviendo constantemente.", "Cuando el azúcar esté disuelto, sube el fuego y hierve sin remover hasta que tome un color cobrizo. Retire inmediatamente del fuego y coloque la olla en un fregadero con agua fría (tenga cuidado de no echar agua en el caramelo o tendrá que volver a empezar).", "Sumerja dos tenedores, unidos entre sí, en el caramelo y gírelos alrededor y sobre la capa de merengue, hasta que tenga una jaula de azúcar hilada.", "Servir en rodajas con el coulis de frambuesa."], "url": "www_bbc_co_uk_food_recipes_elderflower_and_bramble_33135", "title": "Elderflower y zarzamoras pavlova", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina blanca fuerte", "Harina blanca llana 250g / 9oz", "40 g / 1½ oz de mantequilla", "6g de sal marina fina", "2 bolsitas de 7 g de levadura instantánea", "120ml / 4fl oz de leche entera", "2 huevos grandes de gallinas camperas", "75ml / 2½fl oz de flor de saúco cordial", "1 tapa de aceite de limón de calidad alimentaria", "250g / 9oz de harina blanca fuerte", "Harina blanca llana 250g / 9oz", "40 g / 1½ oz de mantequilla", "12 vainas de cardamomo, aplastadas y sin semillas", "12 dientes", "6g de sal marina fina", "2 bolsitas de 7 g de levadura instantánea", "½ cucharadita de canela", "60g / 2¼ oz de azúcar en polvo de oro", "150ml / 5fl oz de leche entera", "2 huevos grandes de gallinas camperas", "80g / 3oz de mantequilla", "160g / 5¾oz de azúcar en polvo de oro", "3 limones, cáscara y jugo solamente", "2 huevos grandes de gallinas camperas y 1 yema de huevo grande de gallinas camperas", "3 manzanas Braeburn, peladas, sin corazón y finamente picadas", "80g / 3oz de arándanos congelados, descongelados", "1 limón, solo jugo", "150g / 5½ oz de mermelada de azúcar", "150g / 5½oz de azúcar glas", "2 cucharadas de flor de saúco cordial", "150g / 5½oz de azúcar glas", "1 cucharadita de pasta de vainilla", "1 cucharadita de canela", "1 cucharadita de jugo de limón", "2 cucharaditas de jugo de naranja", "Crema doble 600ml / 20fl oz", "Azúcar glas de 40g / 1½oz"], "method": ["Para la masa de flor de saúco, coloque ambas harinas en el cuenco de un mezclador independiente equipado con un gancho de masa. Frota la mantequilla con las yemas de los dedos y luego agrega la sal a un lado del tazón y la levadura a la otra.", "Caliente la leche a unos 40 ° C (si no tiene un termómetro de cocina, caliente suavemente la leche hasta que esté caliente al tacto).", "Agregue los huevos, la leche tibia, el aceite de limón y el caldo en el tazón y mezcle lentamente durante unos minutos para combinar. Aumente la velocidad y mezcle por unos minutos más. Transfiera a un tazón grande y cubra con una película adhesiva. Pruebe en un lugar cálido durante 1 hora, o hasta que duplique su tamaño.", "Para la masa de pan de especias, coloque ambas harinas en el cuenco de un mezclador independiente equipado con un gancho de masa. Frote la mantequilla con la punta de los dedos.", "Retire las semillas de las vainas de cardamomo y quite las cabezas de los dientes. Moler hasta que esté bien en una maja y mortero. Agregue a la mezcla de harina junto con la sal, la levadura, la canela y el azúcar.", "Caliente la leche a unos 40 ° C (si no tiene un termómetro de cocina, caliente suavemente la leche hasta que esté caliente al tacto). Agregue 3 cucharadas de agua y mezcle.", "Agregue los huevos y la leche caliente al recipiente y mezcle lentamente durante unos minutos para combinar. Aumente la velocidad y mezcle por unos minutos más. Transfiera a un tazón grande y cubra con una película adhesiva. Pruebe en un lugar cálido durante 1 hora, o hasta que duplique su tamaño.", "Para hacer la cuajada de limón, ponga la mantequilla, el azúcar impalpable, el jugo de limón y la ralladura en un recipiente resistente al calor y caliente en el microondas hasta que la mantequilla se haya derretido (alternativamente ponga el recipiente sobre una fuente de agua hirviendo a fuego lento). Batir los huevos y la yema de huevo en la mezcla de limón. Coloque sobre la fuente de agua hirviendo y revuelva hasta que espese. Pasar a través de un tamiz y dejar enfriar.", "Para hacer la mermelada de manzana y arándano, ponga un plato en el congelador. Agregue las manzanas, los arándanos, el jugo de limón y el azúcar en una sartén. Cocine a fuego lento durante unos 10-15 minutos hasta que las manzanas estén suaves. Llevar a ebullición durante unos minutos. Para verificar si el atasco ha alcanzado el punto de ajuste, coloque un blob en la placa congelada y déjelo enfriar durante unos minutos; si el atasco está listo, se arrugará al empujarlo con el dedo. Si no se arruga, cocine por unos minutos más y luego vuelva a probar. Una vez que se ha alcanzado el punto de ajuste, transfiera el atasco a una licuadora y rellene hasta que quede suave. Deja enfriar.", "Una vez que las masas han sido probadas, divida ambas masas en 12 piezas iguales. Ligeramente harina 4 bandejas para hornear y una superficie de trabajo. Enrolle cada pieza de masa en una bola y luego en forma de salchicha. Coloque 6 dedos en cada bandeja y vuélvalo a probar nuevamente durante 30 minutos o hasta que duplique su tamaño.", "Precalentar el horno a 205C / 185C Fan / Gas 6.", "Hornee los bollos durante 10-15 minutos o hasta que estén dorados. Retire de las bandejas y deje enfriar. Una vez frío, corta los bollos por la mitad a lo largo.", "Para el glaseado de flor de saúco, combine el azúcar glas y el cordial de flor de saúco en un recipiente hasta que se consiga una consistencia fluida y fluida.", "Para el glaseado de canela, combine el azúcar glas, la pasta de vainilla, la canela y el jugo de limón en un tazón. Agregue suficiente jugo de naranja para hacer un glaseado suave.", "Para decorar, sumerja las mitades superiores de los bollos de flor de saúco y limón en la glaseado de flor de saúco.", "Clava las mitades superiores de los bollos condimentados en el glaseado de canela.", "Para llenar los panecillos, azote la crema con el azúcar glas hasta que se formen picos rígidos cuando se quite la batidora. Transfiera a una manga pastelera desechable.", "Extienda el atasco en la mitad de los panecillos y la cuajada de limón en la otra mitad, luego vierta la crema en la parte superior. Sandwich los bollos juntos con las respectivas tapas heladas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_elderflower_and_lemon_58955", "title": "Bollos de flor de saúco y limón y bollos con especias", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 24 bollos para los dedos con hielo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz de azúcar en polvo", "2 limones", "alrededor de 25 cabezas de flor de saúco", "50g / 1¾oz de ácido cítrico", "2 tabletas de Campden"], "method": ["Pon el azúcar y 1.5 litros / 3lb de agua en una olla grande. Llevar a ebullición, revolviendo, hasta que el azúcar se haya disuelto. Retirar del fuego y dejar enfriar.", "Corta los limones finamente. Poner en una caja de plástico grande o un balde.", "Agregue las cabezas de flor de saúco a los limones con el ácido cítrico y las tabletas de Campden. (PRECAUCIÓN: las tabletas de Campden producen un gas irritante si se inhalan. Mantenga la cara bien alejada de la mezcla). Vierta sobre el jarabe de azúcar enfriado. Cubra y deje durante la noche o hasta un par de días.", "Tamizar y colar a través de la muselina en botellas esterilizadas y almacenar en la nevera. Para servir, diluir al gusto con agua sin gas o con gas."], "url": "www_bbc_co_uk_food_recipes_elderflower_cordial_21346", "title": "Flor de saúco cordial", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Hace aproximadamente 3-4 litros", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 500 g / 1 lb 2 oz, cascos eliminados", "300ml / 10½ fl oz crema doble extra gruesa", "½ vaina de vainilla, semillas raspadas con un cuchillo afilado", "450ml / ¾ pinta de mantequilla de flor de saúco brillante", "50 g / 2 oz de azúcar en polvo", "5 hojas de gelatina, empapadas en agua fría durante 5 minutos", "1 durazno, piedra removida, carne finamente picada", "50 g / 2 oz pequeñas fresas frescas, cortadas en cuartos", "pequeñas hojas de albahaca fresca, preferentemente albahaca griega"], "method": ["Para el helado de fresa, congele los cuartos de fresa en el congelador en una bolsa de comida sellable durante al menos 4 horas, pero preferiblemente durante la noche.", "Mientras tanto, para la gelatina de flor de saúco, caliente 100 ml / 3½ fl oz de la flor de saúco presioné y todo el azúcar impalpable en una cacerola a fuego medio hasta que hierva a fuego lento. Escurra la gelatina remojada y agréguela a la mezcla de flor de saúco, revolviendo hasta que se disuelva.", "Cuando la gelatina se haya disuelto, vierta el resto de la flor de saúco presioné y revuelva para combinar.", "Vierta la mezcla de gelatina de flor de saúco en un tazón ancho y poco profundo o en un plato con labios. Enfríe en el refrigerador hasta que esté listo, aproximadamente 30 minutos.", "Cuando las fresas se hayan congelado y la gelatina esté lista para servir, mezcle las fresas en un procesador de alimentos con las semillas de vainilla y la mitad de la crema durante 3-4 minutos, o hasta que la mezcla de helado esté suave y espesa y las fresas hayan comenzado para congelar la crema.", "Para servir, decorar la parte superior de la gelatina con los melocotones picados, fresas frescas picadas y albahaca, y luego cubrir con bolas de helado de fresa. Sirva inmediatamente, con el resto del helado en tazones al lado."], "url": "www_bbc_co_uk_food_recipes_elderflower_jelly_with_16318", "title": "Gelatina de flor de saúco con helado de fresa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5fl oz de harina común", "20 g / oz de azúcar en polvo", "½ cucharadita de copos de sal marina", "1 x 7g bolsita mezcla fácil levadura seca", "½ naranja, solo jugo", "3 huevos grandes de gallinas camperas, ligeramente batidos", "75 g / 2½ onzas de mantequilla, ablandadas y cortadas en cubos, más extra para engrasar", "100g / 3½z de uva", "ralladura de limón rallada", "vodka de flor de saúco, al gusto"], "method": ["Coloque la harina, el azúcar y la sal en un recipiente y mezcle bien. Luego agregue la levadura.", "Caliente el jugo de naranja ligeramente en una sartén.", "Revuelva suavemente los huevos en la mezcla de harina un poco a la vez, alternando con el jugo de naranja tibia y la mantequilla.", "Agregue las pasas y déle una buena mezcla hasta que forme una masa suave.", "Coloque la mezcla en dos latas de bollos engrasadas, moldes dariole o latas de baba de 11 cm / 4½ pulgadas (moldes de savarin).", "Cubra ligeramente con un paño de cocina y deje en un lugar cálido durante aproximadamente una hora, o hasta que duplique su tamaño y quede ligeramente esponjoso.", "Precalentar el horno a 180C / 350F / Gas 4.", "Hornee en el horno por 10-12 minutos hasta que se levante y dore.", "Retire del horno y deje enfriar en una rejilla de alambre.", "Para transportar para un picnic, colóquelo en un frasco de conserva con un poco de ralladura de limón y llovizna, al gusto, con vodka de flor de saúco."], "url": "www_bbc_co_uk_food_recipes_elderflower_vodka_babas_28481", "title": "Elderflower vodka babas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30 cabezas de saúco", "1.7litres / 3 pintas de agua hirviendo", "Azúcar en polvo 900g / 2lb", "50g / 2oz de ácido cítrico (disponible en farmacias)", "2 naranjas sin encerar, en rodajas", "3 limones no encerados, rebanados"], "method": ["Enjuague suavemente sobre las flores de saúco para eliminar cualquier suciedad o pequeñas criaturas.", "Vierta el agua hirviendo sobre el azúcar en un tazón muy grande. Revuelva bien y deje que se enfríe.", "Agregue el ácido cítrico, las rodajas de naranja y limón, y luego las flores.", "Deja en un lugar fresco por 24 horas, revolviendo ocasionalmente.", "Colar a través de un poco de muselina y transferir a botellas esterilizadas."], "url": "www_bbc_co_uk_food_recipes_elderflowercordial_6465", "title": "Flor de saúco cordial", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1.5litros / 2¾pints", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/elderflowercordial_6465_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas, finamente picadas", "2 chiles rojos pequeños, finamente picados", "½ bulbo de ajo, pelado y aplastado", "Raíz de jengibre de 5 cm / 2 pulgadas, finamente picada", "2 cucharaditas de cilantro molido", "1,5 kg / 3 lb 5 oz de cordero en cubitos (pida al carnicero una mezcla de hombro y pierna)", "100g / 3½ oz de albaricoques, picados", "100g / 3½oz de uva", "½ botella de vino blanco", "½ litro de caldo de pollo (o 2 cubos de caldo de pollo o verdura con ½ litro de agua)", "1 cucharada de miel", "1 cucharada de harina de maíz", "puñado de cilantro picado", "cuscús", "ensalada de hojas mixtas"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Caliente el aceite de oliva en una cacerola y cocine las cebollas durante unos minutos hasta que estén suaves, pero no coloreadas.", "Agregue el chile, el ajo, el jengibre y el cilantro molido, y cocine por un minuto más.", "Agregue el cordero y cocine hasta que la carne esté dorada.", "Agregue los albaricoques, las pasas, el vino, el caldo y la miel. Remover bien y llevar a ebullición.", "Transfiera al horno y cocínelo durante 1½ horas; alternativamente, puede cocinarlo a fuego lento sobre la placa durante 1½ horas.", "Agregue una cucharada de agua a la harina de maíz para formar una pasta y mezcle esta pasta con el cordero.", "Cocine por un par de minutos más para espesar, y agregue el cilantro picado. Servir con cuscús y una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_elizabethanlambstew_83712", "title": "Guiso de cordero isabelino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo de 2 kg / 4½ lb, preferiblemente de corral", "25g / 1oz de mantequilla", "1 cebolla grande, finamente picada", "115 g / 4oz de pasas", "225g / 8oz de ciruelas firmes, cortadas a la mitad, sin piedras", "6 bayas de enebro, ligeramente trituradas", "1 cucharadita de canela molida", "1 cucharadita de jengibre molido", "pizca de nuez moscada recién rallada", "miel líquida", "1 naranja, solo jugo", "300ml / 11fl oz de caldo de pollo", "300ml / 11fl oz de vino tinto", "algunas ramitas de romero fresco", "sal y pimienta negra recién molida", "jugos de pollo de la sartén", "25g / 1oz de mantequilla", "1 cebolla, finamente picada", "1 puerro, picado", "tomillo de ramita", "55ml / 2fl oz de crema individual", "sal y pimienta negra recién molida"], "method": ["Dorar el pollo por todas partes en una sartén antiadherente. Reserve a un lado, pero reserve los jugos en la sartén.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente la mantequilla, la cebolla y las pasas en una cacerola lo suficientemente grande como para sostener el pollo, y cocine hasta que se ablanden. Agregue las ciruelas, bayas de enebro, canela, jengibre y nuez moscada, y revuelva. Rocíe un poco de miel y vierta el jugo de naranja al gusto.", "Vierta el caldo de pollo y el vino tinto. Cocine a fuego lento durante unos minutos, luego agregue unas ramitas de romero. Sazonar generosamente con sal y pimienta negra recién molida.", "Agregue el pollo a la sartén, colóquelo en el horno precalentado y cocínelo durante aproximadamente 1 ½ horas, hilvanado varias veces. Las ciruelas se guisarán y crearán una salsa para acompañar al pollo. El pollo se cocinará cuando los jugos del muslo salgan claros cuando se pinche con un pincho.", "Mientras tanto, para el plato cremoso de puerro, caliente los jugos reservados en el sartén de pollo y agregue la mantequilla. Freír la cebolla y el puerro picado, luego agregar el tomillo. Vierta la crema individual sobre los puerros y sazone bien con sal y pimienta negra recién molida. Caliéntelo por un par de minutos. Sirva con el pollo picante de ciruela."], "url": "www_bbc_co_uk_food_recipes_elizabethanpotroastc_81091", "title": "Pollo asado isabelino con ciruelas con especias y puerros cremosos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas de jengibre 150 g / 5½ oz, aplastadas", "75g / 2¾oz de mantequilla, derretida", "400ml / 14fl oz de flor de saúco prensada", "100 g / 3½ oz de azúcar en polvo", "225 g / 8 oz de mascarpone", "1 vaina de vainilla, semillas raspadas usando un cuchillo", "50ml / 1¾oz de licor de flor de saúco", "Crema batida de 225ml / 8fl oz, batida hasta que se formen picos suaves cuando se quita la batidora", "Lichis enlatados 200 g / 7 oz, escurridos, cortados en cuartos", "125g / 4½oz de mermelada de lima", "50ml / 2fl oz de agua hirviendo", "flores comestibles, para adornar (opcional)"], "method": ["En un tazón, mezcle los bizcochos de jengibre triturados y la mantequilla derretida hasta que estén bien combinados. Presione esta mezcla en el fondo de cada uno de los seis vasos de vidrio para formar una capa uniforme.", "Llevar la flor de saúco presioné y el azúcar a ebullición en una sartén. Continúe hirviendo hasta que el volumen del líquido se haya reducido a la mitad. Dejar enfriar por 5-10 minutos.", "En un recipiente aparte, bata el mascarpone, las semillas de vainilla, la mezcla fría de harina de saúco y el licor de flor de saúco hasta que estén bien combinados. Agregue la crema batida hasta que esté bien combinada, luego agregue los lichis.", "Vierta la mezcla en los vasos.", "En un recipiente, mezcle la mermelada de lima con el agua hirviendo hasta que se haya disuelto. Déjelo enfriar un poco, luego extiéndalo sobre la superficie de cada tarta de queso.", "Enfríe las tartas de queso en la nevera durante dos horas.", "Para servir, coloque cada vaso en un plato pequeño. Decore cada pastel de queso con flores comestibles, si las usa."], "url": "www_bbc_co_uk_food_recipes_elderflowerandlychee_91445", "title": "Pastel de queso de flor de saúco y lichi", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de azúcar moreno claro y suave", "1 cucharada de arce o jarabe de oro", "3 cucharadas de harina común", "3 cucharadas de cacao en polvo", "¼ cucharadita de copos de sal marina", "1 huevo grande de gallinas camperas", "1 cucharadita de extracto de vainilla", "Piezas de nogal 50g / 1¾oz", "50 g / 1¾oz de chocolate negro o con leche"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3.", "Caliente la mantequilla, el azúcar y el jarabe de arce en una cacerola pequeña de base pesada, revolviendo ocasionalmente hasta que la mantequilla se haya derretido y el azúcar se haya disuelto. Retire del fuego.", "Mezcle la harina, el cacao y la sal en un tazón, luego bata la mantequilla derretida con una cuchara de madera hasta que quede suave.", "En un tazón pequeño, bata el huevo con la vainilla y revuelve en la sartén, asegurándose de que todo esté bien combinado. Doble las nueces y las chispas de chocolate. Vierta y raspe la mezcla en la lata de aluminio. Hornee durante 15-20 minutos, hasta que empiece a salir a los lados y la parte superior se haya secado un poco en los bordes.", "Transfiera a una rejilla de alambre y deje enfriar, pero no completamente. Los dejo por 20-30 minutos (y eso es bastante difícil). Si su necesidad no es tan grande, o si desea que vayan más lejos, corte cada casilla por la mitad nuevamente."], "url": "www_bbc_co_uk_food_recipes_emergency_brownies_43976", "title": "Brownies de emergencia", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/emergency_brownies_43976_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de cacahuete, para engrasar", "400g / 14oz de almendras en copos", "450g / 1lb de mantequilla sin sal", "500g / 1lb 2oz de azúcar granulada", "1 cucharadita de extracto de vainilla", "200g / 7oz de chocolate con leche, roto en pequeños trozos"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata para hornear de 42x27 cm / 17 x 11 pulgadas y 4 cm / 1½ pulgadas de profundidad con aceite de cacahuate.", "Coloque las almendras en un segundo lugar, limpie la bandeja para hornear y tueste en el horno durante 15 minutos, volteándolas una y otra vez después de cinco minutos y teniendo cuidado de no quemar los bordes. Retirar del horno una vez dorado y reservar para enfriar.", "Coloque la mantequilla en una sartén profunda de fondo grueso y derrita suavemente. Agregue el azúcar y revuelva hasta que se haya disuelto. Coloque un termómetro de azúcar en la sartén, ponga la mezcla a ebullición y burbujee a fuego medio hasta que alcance los 120 ° C / 250 ° F. Esto lleva unos cinco minutos.", "Agregue tres cuartas partes de las almendras tostadas y el extracto de vainilla a la mezcla de azúcar y mantequilla y déle un par de agitaciones vigorosas con una cuchara de madera. Tenga cuidado ya que la mezcla burbujeará bastante.", "Haga que la mezcla vuelva a hervir y, a fuego moderado, burbujee lenta y constantemente, revolviendo con frecuencia, durante aproximadamente 15 minutos hasta que la temperatura alcance los 150 ° C / 302 ° F. Tenga cuidado, ya que permanecerá durante un tiempo prolongado a 135 ° C / 275 ° F y luego aumentará rápidamente a 150 ° C / 300 ° F. Necesitarás atraparlo cuando esto ocurra o comenzará a arder.", "Tan pronto como la temperatura alcance los 150 ° C / 300 ° F, sacuda la sartén del fuego y vierta la mezcla de color dorado en la bandeja de horno engrasada. No te preocupes si se ve un poco grasoso. Deja enfriar por una hora.", "Coloque los pequeños trozos de chocolate de manera uniforme sobre la parte superior del toffee todavía caliente y déjelos derretir. Extiende el chocolate con una espátula.", "Amasar aproximadamente las almendras restantes en un procesador de alimentos y esparcir las migajas sobre el chocolate derretido. Deja enfriar.", "Para quitar el caramelo de la lata, toma un destornillador plano o un martillo de caramelo, rómpalo en trozos y guárdalo en la nevera."], "url": "www_bbc_co_uk_food_recipes_english_almond_butter_49759", "title": "Toffee de mantequilla de almendra inglés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 25 terrones de toffee de almendra", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/english_almond_butter_49759_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cabeza de ajo, clavos separados y pelados", "100 g / 3½ oz de raíz de jengibre fresco, pelado", "3 cucharadas de aceite vegetal", "5 cucharadas de ghee", "8 vainas de cardamomo", "4 hojas de laurel", "4 palitos de canela", "5 cebollas, finamente picadas", "1 cucharada de sal", "1 pollo entero, articulado, sin piel", "arroz pilaf al vapor, para servir"], "method": ["Mezcle el ajo, el jengibre, el aceite vegetal y 4 cucharadas de agua con un puré en un procesador de alimentos.", "Calentar el ghee en una cacerola de base pesada a fuego medio. Agregue el puré de ajo y jengibre y fría durante 1-2 minutos, luego agregue las vainas de cardamomo, las hojas de laurel y los palitos de canela.", "Agregue las cebollas y fría por 4-5 minutos, o hasta que estén ligeramente doradas.", "Agregue la sal y 500 ml / 17 fl oz de agua. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que esté hirviendo a fuego lento. Cubra a medias la sartén con la tapa y cocine a fuego lento durante 12-15 minutos, o hasta que el agua casi se haya evaporado.", "Revuelva la mezcla de cebolla, luego agregue otros 500 ml / 17 fl oz de agua. Cocine a fuego lento, medio cubierto, como antes, durante 12-15 minutos.", "Repita este proceso 5 veces más: esto atrae toda la dulzura natural de las cebollas y las ayuda a descomponerlas en una salsa dulce y sedosa.", "Agregue las piezas de pollo y cubra con 250 ml / 9 fl oz de agua. Ponga a hervir el agua, luego reduzca la temperatura hasta que esté hirviendo a fuego lento. Cubra la olla con la tapa y cocine el pollo durante 15-20 minutos, o hasta que esté bien cocido. (El pollo se cuece si los jugos salen limpios cuando la parte más gruesa del pollo se perfora con un pincho y no queda rastro de restos rosados).", "Sirva en tazones con arroz pilau al vapor."], "url": "www_bbc_co_uk_food_recipes_enams_chicken_korma_35055", "title": "Curry de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["375g / 13oz de masa pastelera dulce lista para usar", "200g / 7oz de mantequilla, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar en polvo", "3 huevos grandes de gallinas camperas", "Harina normal de 200g / 7oz, más extra para quitar el polvo", "125g / 4½ oz de almendras molidas", "½ cucharadita de polvo de hornear", "Atasco de albaricoque 150 g / 5 oz, calentado hasta que se derrita", "8 albaricoques frescos, piedras removidas, cortadas en cuartos"], "method": ["Precaliente el horno a 170C / 150C Fan / Gas 3. Engrase un molde de 30x23 cm / 12x9 in en mantequilla y alinee con papel de hornear.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta que sea un poco más grande que la lata de torta y tenga 0.5cm / ¼ de grosor.", "Enrolle la masa en un rodillo, y luego, forre la torta con la masa, presione suavemente en las esquinas y elimine cualquier exceso. Enfríe en la nevera mientras realiza el llenado.", "Batir la mantequilla y el azúcar en un tazón grande durante 5 minutos, hasta que estén pálidos, esponjosos y bien combinados. Alternativamente, use un mezclador de alimentos independiente para hacer esto.", "Batir los huevos de uno en uno, esperando hasta que cada uno se haya incorporado a la mezcla antes de agregar el siguiente.", "Doble la harina, las almendras molidas y el polvo de hornear.", "Cepille la masa con la mermelada de albaricoque calentada, luego mezcle la mezcla de relleno y alise la parte superior con una espátula. Decora la parte superior del relleno con las mitades de albaricoque.", "Hornee la tarta en el horno durante 30-35 minutos, hasta que el relleno se haya levantado y esté dorado, y una brocheta insertada en el centro salga limpia (si no lo hace, devuelva el horno al horno por 5 minutos más) minutos). Poner a un lado para enfriar, en la lata, en una rejilla, luego sacar de la lata y cortar en rectángulos para servir."], "url": "www_bbc_co_uk_food_recipes_english_apricot_and_84974", "title": "Albaricoque inglés y almendra hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 10-15 piezas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina de pan blanco fuerte, más extra para enharinar", "6 g de levadura de acción rápida", "6g de sal", "15 g / ½ oz de azúcar en polvo", "15 g / ½ oz de mantequilla ablandada, cortada en trozos pequeños", "1 huevo mediano de gallinas camperas (aproximadamente 22 g / ¾oz), ligeramente golpeado", "170ml / 6 fl oz de leche (debe hacer una masa suave - puede agregar hasta 30 ml / 1 fl oz adicionales si es necesario)", "aceite, para engrasar", "15g / ½ oz de sémola o polenta, más extra para quitar el polvo"], "method": ["Incline la harina en un tazón grande. Espolvorea la levadura en un lado de la harina y la sal en el otro lado de la harina. Agregue el azúcar, la mantequilla, el huevo y la leche, luego mezcle todos los ingredientes para formar una masa suave.", "Voltee la mezcla fuera del tazón sobre una superficie ligeramente enharinada y amasar durante 10 minutos, o hasta que esté suave, lisa y elástica.", "Engrase ligeramente un tazón grande con aceite. Coloque la masa en el recipiente engrasado, cubra y deje probar durante aproximadamente una hora, o hasta que duplique su tamaño.", "Polvore la superficie de trabajo con una mezcla de la sémola / polenta y la harina. Incline la masa sobre la superficie de trabajo y extiéndala hasta aproximadamente 2.5 cm de grosor.", "Polvo levemente dos bandejas para hornear con la mitad de la sémola o polenta.", "Con un cortador de lados rectos de 9cm / 3½oz, corte ocho magdalenas. Coloque cuatro muffins, espaciados uniformemente en cada una de las bandejas para hornear espolvoreadas. Espolvorea la sémola o polenta restante sobre la parte superior de los muffins.", "Déjala probar por otros 30 minutos.", "Precalentar la placa caliente o una sartén de base pesada en la placa a una temperatura muy baja. Planche los muffins durante aproximadamente 5-6 minutos, luego dé la vuelta y cocine por otros 5-6 minutos en el otro lado."], "url": "www_bbc_co_uk_food_recipes_english_muffins_56640", "title": "magdalenas inglesas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/english_muffins_56640_16x9.jpg", "isVegetarian": true, "recommendations": 0}]