[{"isVegetarian": true, "title": "Hot chocolate soufflé with maple syrup", "url": "www_bbc_co_uk_food_recipes_hotchocolatesoufflew_84539", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter, plus extra for greasing", "30g/1oz plain flour", "100ml/3½fl oz milk", "1 free-range egg yolk", "55g/2oz chocolate, melted", "2 tbsp maple syrup, plus extra to serve", "3 free-range egg whites, whisked until stiff peaks form when the whisk is removed", "icing sugar, for dusting"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Place a baking sheet in the oven to preheat.", "Grease two ramekins with butter and set aside.", "Melt the butter in a small saucepan over a medium heat. Add the flour and stir to form a thick paste or roux. Cook for one minute then remove from the heat.", "Gradually add the milk, whisking continuously, until a thick and smooth sauce is formed. ", "Mix the egg yolk, chocolate and maple syrup together in a separate bowl.", "Gradually add the white sauce to the chocolate mixture, stirring constantly.", "Carefully fold the egg whites into the chocolate mixture, then fill the two ramekins with the soufflé mixture. Run a thumbnail or teaspoon handle around the inside edge of the ramekins.", "Place the ramekins onto the preheated baking sheet and bake for 8-10 minutes, until the soufflés have risen.  ", "To serve, place each soufflé onto the centre of a plate, dust with icing sugar and drizzle with maple syrup."]}, {"isVegetarian": true, "title": "Hot chocolate and orange soufflé", "url": "www_bbc_co_uk_food_recipes_hotchocolateandorang_73216", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp double cream", "½ orange, juice and finely grated zest only", "250g/8 oz plain chocolate, finely chopped ", "90g/3 oz caster sugar or vanilla sugar", "4 egg yolks", "6 egg whites", "pinch of salt", "icing sugar, for dusting", "unsalted butter", "caster sugar", "whipped cream", "Grand Marnier"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Butter 6 small ovenproof soufflé dishes or ramekins, each large enough to take 200-300ml (1/3-½ pint) and dust with caster sugar.", "Put the cream, orange zest and juice into a saucepan large enough to take the chocolate, and bring up to the boil. ", "Tip the chocolate in, then draw off the heat and stir until melted. ", "Now stir in the sugar, then the egg yolks, one at a time.", "Whisk the egg whites with the salt until stiff. Fold into the chocolate sauce.", "Pour into the prepared soufflé dishes, then slide them straight into the freezer (covered with cling film) or into the hot oven. ", "Bake for 15-20 minutes (for unfrozen) or 20-25 minutes (for frozen) until well risen. ", "Dust with icing sugar and serve at once with some whipped cream, mixed with a few splashes of Grand Marnier."]}, {"isVegetarian": true, "title": "Hot chocolate drizzle pancake with brandy cream", "url": "www_bbc_co_uk_food_recipes_hotchocolatedrizzlep_88840", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz self-raising flour", "1 tbsp icing sugar", "2 free-range eggs", "150ml/5fl oz milk", "25g/1oz butter", "150ml/5fl oz double cream", "1 tbsp icing sugar", "2 tbsp brandy", "55g/2oz dark chocolate, melted, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and icing sugar together into a large bowl and crack in the eggs. Mix well, using a whisk, while slowly pouring in the milk until the mixture becomes a smooth batter, the consistency of double cream - you may not need all the milk.", "Melt the butter in a frying pan and pour in a ladle of the batter, swirling the pan to coat the surface evenly.  Fry for one minute until golden-brown on one side, then turn over and fry for another minute until golden-brown on both sides. Repeat until you have used up all of the batter.", "In a bowl, whip the cream together with the icing sugar and brandy until soft peaks form when the whisk is removed from the bowl.", "To serve, fold the pancake into quarters and drizzle over the melted chocolate. Spoon the whipped brandy cream onto the side and serve."]}, {"isVegetarian": true, "title": "Hot cross bun bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_hotcrossbunandbakedc_85970", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hotcrossbunandbakedc_85970_16x9.jpg", "ingredients": ["6 free-range egg yolks", "2 free-range eggs", "150g/5oz caster sugar", "300ml/½ pint whole milk", "300ml/½ pint double cream", "1 vanilla pod, split, seeds scraped out", "75g/2½oz butter", "8 ready-made hot cross buns, halved", "25g/1oz sultanas", "25g/1oz raisins", "25g/1oz demerara sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the custard, whisk the egg yolks, whole eggs and sugar together in a bowl.", "Place the milk, cream and the vanilla pod and seeds into a pan over a low heat and slowly bring to a simmer. Remove from the heat and remove the vanilla pod.", "Pour the milk and cream onto the egg mixture and whisk well.", "Butter the hot cross buns, then cut into quarters.", "Place a layer of the hot cross buns into a 22cm/9in x 10cm/4in, 5cm/2in deep ovenproof dish.", "Sprinkle with some sultanas and raisins and the demerara sugar. Repeat the layers and finish with a final layer of buns.", "Pour the custard over the buns and leave to stand for 20 minutes.", "Preheat the oven to 180C/355F/Gas 4.", "Place the dish into a deep roasting tray and add enough water to the tray to come a third of the way up the dish (this is a bain-marie). Cover with foil.", "Carefully place the pudding and bain-marie into the oven and bake for 20-30 minutes, or until the custard has set. Remove the foil for the final five minutes of cooking to brown the top.", "Serve the pudding with cream or mascarpone."]}, {"isVegetarian": true, "title": "Hot cross buns", "url": "www_bbc_co_uk_food_recipes_hotcrossbuns_397", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hotcrossbuns_397_16x9.jpg", "ingredients": ["625g/1.3lb strong white flour, plus extra for dusting", "1 tsp salt", "2 tsp ground mixed spice", "45g/1.5 oz unsalted butter, cut into cubes, plus extra for greasing", "85g/3oz sugar", "1 lemon, zest only", "1½ tsp fast-action yeast", "1 free-range egg", "275ml/10fl oz tepid milk", "125g/4oz mixed dried fruit", "2 tbsp plain flour", "vegetable oil, for greasing", "1 tbsp golden syrup, gently heated, for glazing"], "serves": "12 buns", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the buns, sieve the flour, salt and ground mixed spice into a large mixing bowl, then rub in the butter using your fingertips. Make a well in the centre of the mixture, then add the sugar and lemon zest and yeast. ", "Beat the egg and add to the flour with the tepid milk.  Mix together to a form a soft, pliable dough.", "Turn out the dough onto a lightly floured work surface. Carefully work the mixed dried fruit into the dough until well combined. Knead lightly for 5 minutes, or until smooth and elastic.", "Grease a large, warm mixing bowl with butter. Shape the dough into a ball and place it into the prepared bowl, then cover with a clean tea towel and set aside in a warm place for one hour to prove.", "Turn out the proved dough onto a lightly floured work surface and knock back the dough. Shape it into a ball again and return it to the bowl, then cover again with the tea towel and set aside for a further 30 minutes to rise.", "Turn out the dough onto a lightly floured work surface and divide it into 12 equal pieces. Roll each piece into a ball, then flatten slightly into a bun shape using the palms of your hands. Cover the buns again with the tea towel and set aside to rest for 5-10 minutes.", "Grease a baking tray with butter and transfer the buns to the tray. Wrap the tray with the buns on it loosely in greaseproof paper, then place inside a large polythene bag. Tie the end of the bag tightly so that no air can get in and set aside in a warm place for a further 40 minutes to rise. ", "Preheat the oven to 240C/475F/Gas 8. ", "Meanwhile, for the topping, mix the plain flour to a smooth paste with 2 tablespoons of cold water. ", "When the buns have risen, remove the polythene bag and the greaseproof paper. Spoon the flour mixture into a piping bag and pipe a cross on each bun.", "Transfer the buns to the oven and bake for 8-12 minutes, or until pale golden-brown. As soon as you remove the buns from the oven, brush them with the hot golden syrup, then set aside to cool on a wire rack."]}, {"isVegetarian": true, "title": "Hot fudge sauce", "url": "www_bbc_co_uk_food_recipes_hotfudgesauce_85722", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz granulated sugar ", "85g/3oz brown sugar ", "100g/3½oz cocoa powder ", "30g/1oz plain flour ", "½ tsp salt ", "1 x 400g/14oz can evaporated milk ", "250ml/9fl oz water ", "2 tbsp butter ", "2 tsp vanilla extract"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the granulated and brown sugar, cocoa powder, flour and salt into a saucepan. Add the evaporated milk, water and butter and bring slowly to the boil, stirring constantly. Once boiling, cook for five minutes.", "Remove the sauce from the heat and allow to cool slightly. Stir in the vanilla extract.", "Serve poured over vanilla ice cream."]}, {"isVegetarian": false, "title": "Hot fish salad", "url": "www_bbc_co_uk_food_recipes_hotfishsalad_75673", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 clove garlic, chopped", "½ yellow pepper, sliced", "4 spring onions, stripped", "50g/ 1 ¾oz sugar snap peas", "1 x plaice fillet, cut into strips", "20g/¾oz plain flour", "20g/¾oz corn flour", "oil for deep frying", "2 tbsp soy sauce", "1 lime, juice only", "1 tsp sesame oil", "2 tbsp sunflower oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and sauté the garlic, yellow pepper, spring onion and sugar snap peas for 4-5 minutes to soften.", "Coat the fish in a mixture of cornflour and plain flour. Heat the oil in a frying pan and deep-fry the fish for 2-3 minutes until crisp and golden. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) ", "To make the dressing, whisk together all the ingredients.", "Serve the vegetables on a plate and top with the fish. Drizzle with the dressing."]}, {"isVegetarian": true, "title": "Hot glazed custard pastry", "url": "www_bbc_co_uk_food_recipes_hotglazedcustardpast_87968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz ready-rolled puff pastry", "1 free-range egg white", "250g/9oz icing sugar, plus extra for dusting", "2 free-range egg yolks", "4 tbsp caster sugar", "450ml/16fl oz milk", "1 vanilla pod, split"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Lay the pastry on a non-stick baking sheet. In a bowl, mix the egg white and icing sugar together, then spread over the top of the pastry. Transfer to the oven and bake for 15 minutes. Cut into four squares.", "For the custard, whisk the egg yolks and sugar together in a bowl until pale and frothy.", "Heat the milk with the vanilla pod in a pan until it reaches boiling point. Remove the vanilla pod. Pour the hot milk onto the eggs and whisk well. Pour the mixture into a clean pan and stir over a low heat until thickened.", "To serve, place a slice of pastry onto a serving plate and pour over some custard. Layer up the remaining pastry slices and custard. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Hot hot bananas", "url": "www_bbc_co_uk_food_recipes_hothotbananas_91712", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp soft light brown sugar ", "½ tsp ground ginger ", "¼ tsp finely grated nutmeg ", "4 medium-sized bananas, skins on ", "20g/¾oz butter, cut into eight thin slices", "1 large lime, juice only", "whipped cream or vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Light the barbecue half an hour before you begin cooking. ", "In a bowl, mix together the brown sugar, ground ginger and grated nutmeg until well combined. ", "Make a deep incision lengthways down the curved side of each banana, from stalk to base. Gently open the bananas up and sprinkle the sugar and spice mixture underneath the skin of each banana. ", "Place two slices of butter into the incisions made in each banana, then squeeze in the lime juice. ", "Close the skin around the bananas and wrap them in aluminium foil. ", "When the flames from the barbecue have died down and the coals are ash-white, place the foil-wrapped bananas onto the grill and cook for 10-12 minutes, turning them occasionally with tongs, or until the bananas are soft when squeezed with the tongs. Remove the foil-wrapped bananas from the heat and set aside to cool slightly on serving plates.", "When the foil is cool enough to handle, open the banana parcels and discard the foil. Serve the bananas with a dollop of whipped cream or a scoop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Hot hot roots with fresh mango and coconut relish", "url": "www_bbc_co_uk_food_recipes_hothotrootswithfresh_92668", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hothotrootswithfresh_92668_16x9.jpg", "ingredients": ["2 tbsp sunflower oil, or groundnut oil", "3 onions, peeled, finely chopped", "4 garlic cloves, peeled, crushed to a paste with the edge of a knife", "4cm/1½in piece fresh root ginger, peeled, finely chopped or grated", "1 Scotch bonnet chilli, seeds removed, chopped", "½ tsp freshly ground black pepper", "1 tsp ground turmeric", "1½ tsp ground coriander", "1 cinnamon stick, broken in half", "300g/10½oz carrots, peeled, cut into equal-sized pieces", "300g/10½oz parsnips, peeled, cut into equal-sized pieces", "300g/10½oz sweet potatoes, peeled, cut into equal-sized pieces", "400g/14oz small waxy potatoes, halved lengthways", "1 litre/1¾ pints vegetable stock, or water", "2 fresh bay leaves", "2 tbsp tomato purée", "pinch soft dark brown sugar", "75g/2½oz cashew nuts, crushed, plus extra, chopped, to serve", "salt and freshly ground black pepper", "100g/3½oz French beans, trimmed, cut in half", "200g/7oz baby spinach leaves, washed", "4 tbsp double cream", "1 lime, juice only", "75g/2½oz desiccated coconut, just covered with boiling water and set aside to soak for 30 minutes", "½ tsp mustard seeds", "2 tsp caster sugar", "½ tbsp rum", "pinch salt", "2 ripe mangoes, peeled, stones removed, julienned", "2 red chillies, cut in half, seeds removed, very finely sliced", "1-2 limes, juice only", "handful fresh mint leaves"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the hot hot roots, heat the oil in a casserole over a medium heat and add the onions. Fry for 4-5 minutes, or until golden-brown, stirring well to ensure they don't burn. Add the garlic, ginger and chilli and cook for a further 5-6 minutes, stirring regularly, then add the spices and cook for a further minute, or until fragrant.", "Stir in the carrots, parsnips, sweet potatoes and potatoes and continue to cook for 4-5 minutes, or until softened and golden-brown. Add the vegetable stock (or water), bay leaves, tomato purée, soft dark brown sugar and crushed cashew nuts and stir to combine. Season, to taste, with salt and freshly ground black pepper.", "Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer for 15-20 minutes, or until the vegetables are tender, adding extra stock if the mixture becomes too dry. (The sauce should be thick enough to just coat the vegetables.)", "Add the beans and spinach, cook for a further three minutes, or until the beans are just tender, then stir in the cream. Add half the lime juice and season, to taste, with salt and freshly ground black pepper, adding more lime juice, to taste, as necessary", "Meanwhile, for the mango and coconut relish, transfer the soaked coconut to a food processor (squeeze the coconut to remove any excess water). Add the mustard seeds, caster sugar, rum and salt and blend to a coarse paste. ", "Layer the mango slices with spoonfuls of the coconut paste onto a serving plate, squeezing over the lime juice and a sprinkle of chilli between each layer. Sprinkle the mint over the top of the relish. (If you're preparing the relish ahead of time, add the mint just before serving.)", "Serve the hot hot roots scattered with chopped cashew nuts, and spoon the relish alongside."]}, {"isVegetarian": true, "title": "Hot-house eggs", "url": "www_bbc_co_uk_food_recipes_hothouseeggs_88980", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice bread", "1 tbsp olive oil", "1 free-range egg", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut a hole about the size of an egg yolk in the centre of the slice of bread.", "Heat the oil in a frying pan, add the bread and fry the bread and the cut-out round on both sides for 2-3 minutes, or until golden-brown.", "Just before the bread is fully fried on the second side, crack the egg into the hole in the bread. Fry for 1-2 minutes, then carefully flip the toast and egg over and fry on the other side for one more minute, or until the egg is cooked to your liking. ", "Slide the toast onto a serving plate and serve with the toasted round on the side. Season to taste with salt and freshly ground black pepper and serve immediately."]}, {"isVegetarian": false, "title": "Hot hounds with beer-and-mustard-barbied onions", "url": "www_bbc_co_uk_food_recipes_hothoundswithbeerand_67589", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hothoundswithbeerand_67589_16x9.jpg", "ingredients": ["4 large onions, thinly sliced", "150ml/5fl oz dark ale or bitter", "1 tbsp demerara sugar", "1 tbsp wholegrain mustard ", "large knob of butter", "1 large sprig of thyme", "salt and freshly ground black pepper ", "8 good-quality, thick sausages (experiment with some of the many varieties on offer)", "8 bread rolls, or pieces of French bread"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Take a large piece of foil and fold it in half. Scatter the onions in the middle and pull up the sides of the foil to create a shallow 'dish'. Mix together the beer, sugar and mustard, then pour over the onions. Add the butter and thyme and season with salt and pepper. Pinch together the edges of the foil to seal the parcel, ensuring you don't leave any gaps. This will allow the onions to steam and barbecue at the same time. ", "Place carefully on the barbecue. Leave to cook for 25-30 minutes until the onions are meltingly soft and most of the beer has reduced to a syrupy consistency. During the cooking time, carefully open the foil a few times and stir the onions. If there's too much liquid in the foil when the onions are almost cooked, open up the top of the foil and cook for a further 5 minutes to allow the liquid to evaporate.", "Place the sausages on a medium-hot barbecue and cook for 8-10 minutes, turning every so often. Check they're cooked through before serving. Put the cooked sausages in the rolls or French bread and dollop the onions on the top."]}, {"isVegetarian": false, "title": "Hot layered tortilla sandwich", "url": "www_bbc_co_uk_food_recipes_hotlayeredtortillasa_88186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 flour tortillas", "200g/7oz fillet steak", "100g/3½oz mature cheddar, grated", "2 spring onions, finely sliced", "2 tbsp chopped fresh coriander"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the oil in an ovenproof frying pan and fry the steak on both sides for about 1-2 minutes. Remove from the pan, slice thinly and set aside. ", "Place one flour tortilla into the pan. Layer up the cheese, spring onions, coriander and steak on top of the tortilla. Top with the other tortilla and sprinkle over a final layer of cheese. ", "Place the pan into the oven for about five minutes, until the cheese has begun to melt and the layers have stuck together. ", "Remove from the oven, cut into wedges and arrange on a serving plate."]}, {"isVegetarian": true, "title": "Hot lemon curd soufflés", "url": "www_bbc_co_uk_food_recipes_hotlemoncurdsouffls_68026", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large eggs ", "2 oz (50 g) golden caster sugar and 1 level dessertspoon golden caster sugar ", "grated zest and juice 1 medium lemon (2 tablespoons juice) ", "grated zest and juice 1 small lemon ", "1 large egg ", "1½oz (40 g) golden caster sugar ", "1 oz (25 g) cold unsalted butter, cut into small cubes ", "1 level teaspoon cornflour ", "a little sifted icing sugar, to serve:"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 170C/325F/Gas 3.", "First of all make the lemon curd by lightly whisking the egg in a medium-sized saucepan, then add the rest of the lemon curd ingredients and place the saucepan over a medium heat. Now whisk continuously using a balloon whisk until the mixture thickens; this won't take long ", "When you're ready to make the soufflés, separate the eggs, putting the yolks into a medium-sized bowl and the whites into a spanking-clean larger one. Now, using an electric hand whisk, whisk the whites to the stiff-peak stage, which will take 4-5 minutes start on a slow speed, gradually increasing to medium and then high. Then add the dessertspoon of caster sugar and whisk on a high speed for 30 seconds more. Next add the zest and lemon juice and the remaining 2 oz (50 g) of sugar to the yolks and mix them together briefly. Now take a tablespoon of the whites and fold them into the yolks to loosen the mixture, then fold the rest of the whites in using a light cutting and folding movement so as not to lose the precious air. Spoon the mixture into the prepared ramekins, piling it high like a pyramid, then run a finger round the inside rim of each one. ", "Next place them on the baking sheet and put this in the oven on the centre shelf for 15-17 minutes or until the tops are golden. Then remove them and let them settle for about 5 minutes to allow the lemon curd to cool. They will sink a little, but that's normal. Just before serving, place them on smaller plates and give them a light dusting of icing sugar."]}, {"isVegetarian": true, "title": "Hot marmalade sponge with custard", "url": "www_bbc_co_uk_food_recipes_hotmarmaladespongewi_86045", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, plus extra for greasing", "100g/3½oz caster sugar", "100g/3½oz self-raising flour", "2 free-range eggs", "2 tbsp milk", "4 tbsp marmalade", "190ml/4 fl oz milk", "1 vanilla pod, split and seeds removed ", "2 free-range egg yolks", "2 tbsp cornflour", "2 tbsp caster sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the marmalade, grease a 12cm/5in diameter ovenproof glass bowl with butter.", "Combine the butter and sugar in a blender or food processor until pale and creamy.", "Add the flour and eggs, milk and two tablespoons of the marmalade and blend again until combined.", "Spoon the remaining two tablespoons of marmalade into the base of the greased bowl. Add the batter.", "Cover with cling film and cook on full power in the microwave for 4-5 minutes until the cake is set and a skewer comes out clean.", "For the custard, heat the milk and vanilla pod in a saucepan, until it just reaches simmering point. Remove from heat.", "Whisk together the egg yolks, sugar and cornflour in a bowl.", "Remove the vanilla pod from the milk and pour the milk into the bowl with the eggs, whisk continuously until the mixture forms a smooth liquid.", "Return the mixture to the saucepan over a medium heat, stir constantly until the custard thickens enough to coat the back of a spoon.  Take off the heat immediately and pour into a jug.", "To serve, turn the sponge out onto a plate and pour over the custard."]}, {"isVegetarian": true, "title": "Hot potato salad", "url": "www_bbc_co_uk_food_recipes_hotpotatosalad_8643", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 large potatoes, cut into cubes olive oil ", "wine vinegar ", "medium sized onion, chopped ", "1-2 cloves garlic, crushed ", "handful fresh herbs, chopped ", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes until just cooked.", "Make up a simple viniagrette using 3 parts oil to 1 part vinegar.", "Add the onions, garlic, herbs and seasoning.", "Drain the potatoes and whilst they are still hot, tip them into the dressing. Stir well and serve. "]}, {"isVegetarian": false, "title": "Lamb and barley hotpot", "url": "www_bbc_co_uk_food_recipes_hotpot_83828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz pot barley", "3 medium onions", "2 large celery stalks", "1 large parsnip", "2 carrots", "4-5 medium potatoes", "8 thick neck of lamb chops", "a few sprigs of thyme and a few bay leaves", "½ tin corned beef, cut into thick chunks", "white pepper", "water or stock to cover", "small handful of parsley", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Boil the pot barley in unsalted water for 25 minutes, then drain it.", "Preheat an oven to 160C/320F/Gas 3.", "Peel the onions and slice them into thick rings.", "Cut the celery into short lengths.", "Peel the parsnip, carrot and potatoes and cut them into fat chunks.", "Pile the vegetables into a large deep pot, then tuck in the chops, thyme and bay leaves.", "Add the corned beef.", "Season with a little white pepper, no salt, then pour in the drained barley and enough water or stock to cover the meat and vegetables completely. Bring it slowly to the boil.", "Skim off the froth that accumulates on the surface with a slotted spoon.", "Cover the top of the stew with a sheet of greaseproof paper, then with a lid. Transfer the pot to the oven and cook for two hours.", "Remove the lid. The liquor should be thin, thickened only slightly by the potatoes. Chop the parsley and mix it in carefully, so as not to smash the vegetables, then season with salt and freshly ground black pepper.", "Leave overnight. Next day, skim the fat from the top, then reheat slowly on the stove until the meat is thoroughly hot and the broth gently bubbling. Season as required and serve piping hot."]}, {"isVegetarian": false, "title": "Hotpot with vinegar onions", "url": "www_bbc_co_uk_food_recipes_hotpotwithvinegaroni_88764", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp vegetable oil", "2 onions, finely chopped", "2 garlic cloves, chopped", "pinch fine salt", "200g/7oz button mushrooms, quartered", "500-600g/1lb 2oz-1lb 5oz braising steak", "2-3 tbsp plain flour seasoned with salt and freshly ground black pepper", "200ml/7fl oz red wine", "600ml/1 pint hot beef stock", "4 tbsp brown sauce", "dash Worcestershire sauce", "1 small bunch fresh thyme", "2 bay leaves", "sea salt and freshly ground black pepper", "500g/1lb 2oz new potatoes, peeled and cut into chunks", "200g/7oz plain white flour", "pinch fine salt", "100g/3¾oz cold unsalted butter, diced", "400ml/14fl oz malt vinegar", "1 large Spanish onion, finely sliced into rings"], "serves": "4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oven to 160C/320F/gas 3. Heat two tablespoons of the oil in a two litre (3 pints 10fl oz) flameproof casserole. ", "Add the onions and garlic with a little fine salt, and fry until light golden-brown. Remove with a slotted spoon, place in a bowl and reserve.", "Add another two tablespoons of oil to the pan and fry the mushrooms until cooked through. Tip the cooked mushrooms into the bowl containing the onions.", "Chop the beef into large cubes and coat in the seasoned flour. ", "Heat the remaining oil in the casserole and fry the beef, in two batches, until well browned all over. Remove from the pan and set aside.", "Pour in the wine and scrape the pan with a wooden spoon to loosen the browned bits. Simmer until it has a syrupy consistency, then add the stock, sauces, and herbs. Stir well and bring to a simmer.", "Return the onions, mushrooms, and beef to the pan, and add sea salt and freshly ground black pepper, to taste. Cover and place in the oven to braise for two hours, adding the potatoes after an hour.", "For the pastry, sift the flour and salt into a bowl. Rub in the butter, then slowly mix in 3-4 tablespoons of cold water to make a stiff dough, bringing the dough together to make a ball with your hands. Wrap the dough in cling film and refrigerate for at least an hour - remove the dough 15 minutes before using.", "For the vinegar onions, gently warm the vinegar in a pan, tip it into a large bowl and stir in the onions. Cover and set aside.", "Remove the casserole from the oven and rest for about 30 minutes. Increase the oven temperature to 200C/390F/gas 6. Roll out the pastry and, with a sharp knife, cut out a lid about 2.5cm/1in larger than the diameter of the casserole dish. ", "Discard the herbs from the casserole, taste and adjust the seasoning if necessary. ", "Brush water around the rim of the casserole dish. Place the pastry lid on top, sealing well to the edge, and brush all over with water. Pierce a hole in the centre. ", "Return to the oven to cook for 20-30 minutes until the pastry is a deep golden-brown colour. Leave to rest in a warm place for 10 minutes.", "Serve the hotpot with the vinegar onions on the side."]}, {"isVegetarian": false, "title": "Hot salmon with lime, chilli and coriander", "url": "www_bbc_co_uk_food_recipes_hotsalmonwithlimechi_93821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves, peeled, finely chopped", "5cm/2in piece fresh root ginger, peeled and finely chopped", "½ tsp sea salt", "1 lime", "500g/17½oz salmon fillet, skinned and pin boned", "50g/2oz spinach leaves", "1 small bunch fresh coriander", "1 small bunch fresh mint", "3 green chillies, chopped", "1 lime, juice only", "vegetable oil", "1 tbsp gram flour (also sold as besan or chickpea flour)", "2 tbsp thick yoghurt", "3 banana shallots, peeled, sliced into rings", "1 tsp sugar", "1 x 340g/12oz jar pickled baby beetroot, drained and finely chopped, 2 tbsp pickling liquid reserved", "1 tsp lime juice", "1 small bunch fresh coriander, leaves only"], "serves": "Makes 30", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, using a pestle and mortar pound the garlic and ginger with the salt to form a smooth paste. Spoon into a shallow dish and mix in the lime juice.", "Chop the salmon into 2.5cm/1in cubes and add to the dish. Mix gently to coat evenly in the mixture. Leave to marinate for about 10 minutes.", "For the coriander marinade, place the spinach, coriander and mint into a food processor. Add the chillies, a squeeze of lime juice and a trickle of vegetable oil. Blend until smooth, adding a little more oil if the mixture is too thick. Spoon into a bowl and mix in the flour and yoghurt. Season with a little salt, then add the marinated salmon, coating evenly in the mixture. ", "Preheat the oven to 200C/390F/gas 6. Grease 1-2 large baking sheets with olive oil. ", "Place the marinate salmon pieces onto the prepared trays, spacing them apart. Roast for 8-10 minutes, or until just cooked through. Remove from the oven and set aside. Preheat the grill to high.", "For the garnish, mix the sugar, reserved pickling liquid from the beetroot, lime juice and coriander leaves together in a bowl. Add the shallot rings and mix well to coat. ", "Place the trays of salmon under the grill and cook for 3-4 minutes, or until golden-brown. ", "To serve, spoon the grilled salmon into small serving dishes and garnish with the shallot mixture and chopped beetroot."]}, {"isVegetarian": false, "title": "Hot-smoked salmon with choucroute", "url": "www_bbc_co_uk_food_recipes_hotsmokedsalmonwithc_85463", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110ml/4fl oz extra virgin olive oil", "1 white cabbage, finely shredded", "2 garlic cloves, crushed", "1 bay leaf", "200ml/7fl oz vegetable stock", "2 tbsp sultanas", "600g/1lb 5oz hot-smoked salmon"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/410/Gas 7.", "For the choucroute, heat a large saucepan over a gentle heat and add the olive oil, cabbage, garlic and bay leaf. Stir for 1-2 minutes to combine then add the vegetable stock.", "Bring the stock to a boil, then reduce the heat to a simmer. Cover with a lid and cook for 40 minutes.", "Remove the lid, add the sultanas and continue to cook until all of the liquid has evaporated.", "For the salmon, place the hot-smoked salmon onto a baking tray and place into the oven to cook for 5-10 minutes, or until heated through.", "To serve, slice the hot-smoked salmon and place onto plates. Place a generous spoonful of choucroute alongside."]}, {"isVegetarian": false, "title": "Hot-smoked salmon and sun-blushed tomato blinis", "url": "www_bbc_co_uk_food_recipes_hotsmokedsalmonandsu_85063", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range egg whites", "1 free-range egg yolk", "1½ tbsp self-raising flour, sifted", "1 tbsp olive oil", "3 tbsp sun-blushed tomatoes, chopped", "6 fresh basil leaves, torn", "100ml/3½fl oz plain yoghurt", "salt and freshly ground black pepper", "85g/3oz hot-smoked salmon, flaked", "squeeze lemon juice", "1 spring onion, chopped", "salt and freshly ground black pepper ", "6 sun-blushed tomatoes", "1 tbsp chopped fresh chives", "½ lemon, cut into wedges"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the blinis, whisk the egg whites with an electric hand whisk until stiff peaks form when the whisk is removed.", "Fold the egg yolk and flour into the egg whites. ", "Heat the oil in a frying pan and drop four separate spoonfuls of the blini mixture into the pan. Fry for 3-4 minutes on each side, turning with a fish slice. Remove from the pan and set aside.", "For the sun-blushed tomato topping, place the chopped sun-blushed tomatoes, basil and yoghurt into a bowl. Mix well and season, to taste, with salt and freshly ground black pepper.", "For the salmon topping, place the salmon, lemon juice and spring onion into a bowl. Mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, place the blinis onto a plate and top two of them with the tomato topping and two with the salmon topping. Garnish the blinis with whole sun-blushed tomatoes, chives and lemon wedges."]}, {"isVegetarian": false, "title": "Hot prawn and smoked salmon salad", "url": "www_bbc_co_uk_food_recipes_hotprawnandsmokedsal_84904", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil ", "150g/5oz shell on prawns", "100g/3½oz smoked salmon", "pinch dried chilli flakes", "½ garlic clove, chopped", "2 handfuls rocket", "½ lemon juice only", "1 tsp grated fresh horseradish", "6 quails' eggs, fried"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat. Add the prawns, smoked salmon, chilli flakes and garlic and fry for three minutes.", "Place the rocket, lemon juice and horseradish into a bowl and mix well.", "Serve the rocket salad onto a plate, top with the smoked salmon and prawn mixture and top with the fried quails' eggs."]}, {"isVegetarian": false, "title": "Hot smoked salmon with warm potato and mange tout salad", "url": "www_bbc_co_uk_food_recipes_hotsmokedsalmonwithw_70010", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2x140g/5oz salmon fillets", "knob ginger, finely chopped", "1 garlic clove, finely chopped", "1 shallot, finely chopped", "1 tbsp dark, sweet soy sauce (ketjap manis) ", "1 tbsp maple syrup", "1 lime, juice only", "salt and freshly ground black pepper", "310g/11oz new potatoes", "140g/5oz mange tout", "1 lemon, juice only", "knob of butter", "olive oil", "handful of shredded coriander and basil", "oakwood smoked chippings used for smoking, NOT FUEL!"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together the ginger, garlic, shallot, soy sauce, maple syrup and lime juice.", "Take one sheet of foil, 30cm/12in long, lay salmon piece unmarinaded on one half of foil, drizzle marinade on and season well.", "Fold the foil over and turn it into envelope so the salmon is completely sealed. Take another sheet of foil, sprinkle the chippings on one half - put the bag containing the salmon on top of the chippings.", "Take a sharp knife and prick the top of the inner bag 20 times, fold the outer foil over the top and seal it in.", "Put the foil parcel on a hot griddle pan. Smoke for about 7-10 minutes", "You can put it in the oven to finish it off or you can put it on the barbecue.", "Boil the new potatoes until tender and do the same with the mange tout", "Toss together the potatoes with some olive oil, lemon juice and a knob of butter.  Mix in the herbs and serve with the salmon."]}, {"isVegetarian": false, "title": "Hot smoked teriyaki duck with pak choi and ginger", "url": "www_bbc_co_uk_food_recipes_hotsmokedteriyakiduc_73664", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, skin on", "1 tbsp dark soy sauce", "1 tbsp honey", "1 tbsp fresh lime juice", "2 large pieces tin foil", "large handful of wood chippings suitable for cooking, available from specialist cook shops", "2 pak choi, cut into quarters lengthways", "1 thumb-sized piece of ginger, cut into thin strips", "1 tsp sesame oil", "1 lime, juice only"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the soy, honey and lime juice together to form a fairly thick marinade. ", "Score the skin of the duck breast with a sharp knife half a dozen times.", "Preheat a pan and spoon half the marinade in. Immediately it will bubble and smoke, which is the time to add the duck, skin side down. ", "Cook the duck for one minute on each side to take on colour, then take it out of the pan.", "Take one sheet of foil, 30cm (12in) long. Lay the duck on one half of foil and season well.", "Fold the foil over and scrunch round the edges it to form an 'envelope' so the duck is completely sealed.", "Take another larger sheet of foil to make the 'smoking bag'. Sprinkle the wood chippings in the middle of this piece of foil and place the foil envelope containing the duck on top of these chippings.", "Take a sharp knife and prick the top of the inner bag, containing the duck, 20 times - this is to allow the smoke flavour to reach the meat. Now fold the outer foil over the top and seal it to create a 'smoking bag' around the duck parcel.", "Preheat a griddle pan over a medium-high heat and sit the foil parcel in the pan. Smoke over a medium heat for eight minutes until the duck is cooked but still nice and pink. You can put it in a preheated oven or on the barbecue to finish it off if you like (NOTE: smoking food in this way can produce a lot of smoke so it is advisable to open windows or an outside door during cooking and not to leave the food unattended).", "While the duck is smoking, blanch the pak choi in boiling salted water for one minute, then drain and toss in the sesame oil, lime juice and ginger.", "To serve, lay the pak choi on the plate, slice the duck into seven or eight slices and lay the duck on top. Drizzle around the rest of the marinade."]}, {"isVegetarian": true, "title": "Hot spiced cider", "url": "www_bbc_co_uk_food_recipes_hotspicedcider_72957", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/35fl oz cider ", "4 tbsp honey", "1 orange, peel only", "2 cinnamon sticks", "small handful of whole cloves", "2 tsp ground allspice", "generous splash of Somerset Cider Brandy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all ingredients into a saucepan, heat gently and stir occasionally for around 15 minutes (do not boil).  ", "When hot, strain into heatproof cups (leaving the flavourings in if you want) and enjoy."]}]